[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL2F3cy5hbWF6b24uY29tL2Jsb2dzL2RhdGFiYXNlL3JldHJpZXZlLWJpdGNvaW4tYW5kLWV0aGVyZXVtLXB1YmxpYy1ibG9ja2NoYWluLWRhdGEtd2l0aC1hbWF6b24tbWFuYWdlZC1ibG9ja2NoYWluLXF1ZXJ5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 09 Aug 2023 07:00:00 GMT",
        "title": "Retrieve Bitcoin and Ethereum Public Blockchain Data with Amazon Managed Blockchain Query | Amazon Web Services - AWS Blog",
        "content": "Over the past two years, public blockchain adoption has been driven by three primary use cases:\n\ndecentralized finance (DeFi), which provides an open financial system built using smart contracts on public blockchains\n\nnon-fungible tokens (NFTs) that certify ownership of digital assets and enable broad transferability of those digital assets\n\ndigital currency payments that enable value transfer without intermediate institutions\n\nIn addition to the adoption driven by the early Web3 innovators, regulated enterprises are also increasing their use of public blockchains. For example, financial institutions such as Itaú Bank and Fidelity are entering into the cryptocurrency space as trusted, regulated custodians and exchanges. Other institutions, such as Nasdaq, are enabling cryptocurrency for traditional finance as technology providers. Media companies such as Warner Music Group and consumer companies such as Nike continue to incorporate NFTs into their event ticketing and loyalty programs. Payment processors such as Visa and Mastercard are offering cryptocurrency debit cards and solutions for merchants.\n\nHowever, the growing adoption has also highlighted one of the growing challenges of building with blockchain, which is data. The immutability of blockchain transactions, a strength of the technology, means that the data can only grow with time. And although this data is stored publicly and can be accessed by everyone, transforming this information into a performant and accurate format that can be accessed efficiently at scale by applications is a challenge for many customers.\n\nIn this post, we describe the general challenges of working with blockchain data and introduce how Amazon Managed Blockchain Query, a feature of Amazon Managed Blockchain, can help you access blockchain data quickly so you can focus on building differentiators for the mainstream businesses and consumers.\n\nChallenges of blockchain data\n\nAt a high level, the challenges of preparing blockchain data is similar to many other big data problems: complicated ETL (extract, transform, and load) processes, disparate sources of information, and expensive storage.\n\nFirst, the method in which blockchain data is stored poses challenges for application use. Blockchain data is essentially stored as a ledger of state transformations between each block. That is, the information captures what changed from block n to block n+1, such as balance changes in addresses or new smart contracts being deployed. This structure, although well-suited for ensuring data integrity and security on a decentralized network, isn’t ideally suited for tasks like data analysis or developing applications that need to run complex queries. There are no simple data views that can serve commonly requested data in a performant manner that application builders are used to. Take for example a wallet developer, who needs to load the historical wallet balance of a user in seconds. To run the queries efficiently, they would first need to download the entire blockchain ledger (which could be several hundreds of gigabytes in size and requires connecting to blockchain nodes) from multiple blockchains such as Ethereum, Arbitrum, and Polygon. Following this, the data would need to be indexed in a database system that allows efficient queries—a task that presents a significant computational challenge, especially when dealing with larger blockchains.\n\nSecond, in order to provide real-time data, developers have to adapt their system for blockchain finality, which is the assurance that that past transactions can never change. Because blockchains are global and decentralized, it takes a certain time (or number of blocks) for the network to reach an agreement, or consensus, about the blockchain’s legitimate state. During this time, which could range from minutes to hours, data received by a blockchain node may be replaced by another dataset that is recognized by the network as legitimate. In busy times with many transactions being submitted to different nodes, blockchains may revert transactions from multiple blocks. This characteristic of eventual finality is challenging for developers because in such cases, they have to correct the data they have already processed and calculated (such as balances), while still keeping up to date with the streaming information from the blockchain. This also causes problems in situations demanding real-time data for decision-making processes. Take for example a financial application interacting with public blockchains. A high-value trade could potentially be run based on a confirmed transaction in the system. However, this transaction could be later reversed if the network acknowledges another chain as the true one. The financial implications of such a reversal could be significant, demonstrating the inherent risk and complexity associated with streaming real-time data from the blockchain.\n\nThird, developers must assimilate data from multiple sources to construct a complete picture of transactions and interactions in a manner that is easy for humans to understand. With applications now expected to be deployed across multiple blockchains, developers have to process information from different blockchains with potentially different standards. Data stored on the blockchain includes critical information such as the from address, to address, transaction amount, and address of the token smart contract. Blockchains such as Bitcoin and Ethereum both store data in completely different structures, and as such, developers who wish to access data from these blockchains must navigate these differences in data structure and JSON-RPC API options to extract that data in a usable manner.\n\nFourth, developers sometimes have to rerun smart contracts to understand the fine-grained details of their operations. This is one of the most resource-intensive challenges when working with blockchain data. Smart contracts are self-running contracts with the terms of the agreement directly written into lines of code. However, the current flexibility in how different smart contract developers code their functions and emit events on the blockchain makes tracking vital information such as balances or transaction details an arduous task. To interact with the distributed applications on the blockchain, such as decentralized lending platforms or decentralized exchanges, transactions often involve calling multiple smart contracts. Smart contracts often interact with each other and their behavior can vary based on the blockchain’s state. Consequently, obtaining an accurate understanding of what a smart contract was doing at a specific point in time often entails recreating the entire state of the blockchain at that moment and tracing the transactions. For example, consider a music artist offers a token-gated event where only holders of that artist’s Non-Fungible Token (NFT) collection on a given date would be admitted to a live concert. To verify the exact conditions under which an individual may be granted access to the event —such as the token balance of a given user’s wallet at a historical point in time or the exact NFT that user owned—a developer might have to recreate the entire state of the blockchain at a given time to determine who should and should not be granted access to the event, depending on smart contract design. This process is computationally expensive and time-consuming, presenting considerable challenges in terms of efficiency and scalability.\n\nAMB Query – Key Features\n\nIn this section, we discuss key features of Managed Blockchain Query and how it supports builders’ blockchain data needs.\n\nCost-efficient public blockchain data\n\nManaged Blockchain Query provides standardized APIs to retrieve blockchain data from multiple public blockchains, starting with Bitcoin and Ethereum, without requiring you to provision or manage infrastructure for blockchain nodes nor maintain indexing infrastructure to extract, transform, and load blockchain data for use in your applications. Managed Blockchain Query APIs offer predictable pricing by allowing you to pay only for the API requests you make, paying per million requests based on pricing buckets that are priced according to the compute and data resources required to render the result for the API request.\n\nTo illustrate the cost-efficiency of Managed Blockchain Query, imagine you operate a custodial digital asset wallet that interacts with the Bitcoin and Ethereum blockchains. Imagine the monthly demand for this wallet requires 20 million requests for token balances for user addresses on Bitcoin and .5 million requests to get transaction events (for example, transaction inputs and outputs) for Bitcoin. Additionally, the wallet must accommodate 5 million requests for token balances for Ethereum assets and 2.5 million requests for Ethereum transaction events. The cost for this request traffic is calculated in the following table (in the us-east-1 Region).\n\nReliable and highly available\n\nWith REST APIs available in the supported Regions backed by robust data indexing infrastructure and ETL pipelines, Managed Blockchain Query provides reliable and highly available access to public blockchain data across multiple chains. Managed Blockchain Query follows the AWS high standard for reliability, so you can build your application to use Managed Blockchain Query with confidence. Furthermore, you no longer have to guess about capacity, because Managed Blockchain Query APIs scale with your request volume to service your requests at subsecond latency. Managed Blockchain Query also provides high availability, and you can expect 99.9% availability from the service.\n\nRegardless of whether you are building a proof of concept or a high-scale production workload, Managed Blockchain Query can support your blockchain data query needs.\n\nAccelerate development of Web3 applications with developer-friendly REST APIs\n\nManaged Blockchain Query offers APIs that reduce the time and complexity involved in rendering public blockchain data insights to your applications and your users. For example, with a single API call, you can retrieve a list of transactions sent and received from a given wallet address on Ethereum, which makes it easy to populate a user interface with historical transaction details. Furthermore, you can use Managed Blockchain Query to get the current finalized and historical balance for native coins (such as ETH and BTC) and non-native tokens (such as ERC20) with subsecond latency. You can use this API to retrieve individual tokens as well as to retrieve a full list of token balances for a given wallet address. Managed Blockchain Query APIs make common blockchain data insights readily available to developers to use within a myriad of applications, such as web and mobile wallets, analytics pipelines, trading applications, and more, helping developers with dependencies on blockchain data launch products faster.\n\nUse cases for Managed Blockchain Query\n\nManaged Blockchain Query delivers common public blockchain data in a simple way to developers, without requiring custom data indexing and query infrastructure. For example, imagine a digital wallet that needs to display a list of historical transactions and current balances for Ethereum tokens (ERC20, ERC721, ERC1155 and native Ether (ETH). With Managed Blockchain Query APIs, this data is available with a simple REST API call. You can learn more about each API in the Managed Blockchain Query collection in Managed Blockchain Query Developer Guide.\n\nIn this section, we discuss a variety of lower-level use cases that Managed Blockchain Query APIs can address.\n\nQuery current and historical token balances on public blockchains\n\nThe GetTokenBalance API provides a way to get the balance of native coins (ETH, BTC) and various tokens (ERC20, ERC721, ERC1155), which can be used to get the current balance of an externally owned account (EOA) or a historical balance using a universal timestamp (Unix timestamp, in seconds). For example, you can use the GetTokenBalance API to get an address’s balance of an ERC20 token, USDC, on the Ethereum mainnet. You can also retrieve balances of tokens in a batch by providing a list of coins or tokens for which to get balances using the BatchGetTokenBalance API.\n\nRetrieve historical transaction data for a given address\n\nWith Managed Blockchain Query, you can easily retrieve historical data from public blockchains such as Ethereum. This enables several use cases, like populating transaction history on a mobile or desktop crypto wallet or providing contextual information about a transaction based on its transaction hash. In this example, you can use the ListTransactions and GetTransaction APIs to first get a list of all transactions for a given externally owned address (EOA) on the Ethereum mainnet, and then retrieve transaction details for a single transaction in the list.\n\nGet all token balances for a given address\n\nThe ListTokenBalances API is a powerful tool for wallets, user interfaces, Web3 utilities, and more, because it returns a list of all balances for an address across both tokens (ERC20, ERC721, ERC1155) and native coins (ETH, BTC) on a given public blockchain in a single API call. In this example, you can provide an EOA and a network on the Ethereum mainnet, and receive a list of token and native coin balances on Ethereum in the response.\n\nGet all tokens minted by a smart contract\n\nThe ListTokenBalances API can also return a list of all tokens (ERC20, ERC721, ERC1155) minted by a smart contract when passed the smart contract address as input. For example, you can retrieve information related to NFTs minted by an ERC721 smart contract on Ethereum in a single API call.\n\nList events emitted by a given transaction\n\nThe ListTransactionEvents API allows you to retrieve a list of smart contract standard events that are emitted as a result of a given transaction, identified by its hash (transaction identifier). For example, you can use ListTransactionEvents to inspect the resulting events of a transaction that calls a function of an ERC20 token smart contract on Ethereum, such as a Transfer event.\n\nUsing AMB Query in the AWS Management Console\n\nThe AWS Management Console experience for Amazon Managed Blockchain Query offers a graphical user interface query editor that allows you to test Query APIs straight from your browser via your AWS account. To illustrate how to use the query editor, this example details how to use the ListTransactions API to retrieve a full list of transactions an EOA has been party to.\n\nNavigate to the AWS Management Console and sign into your AWS account. Then navigate to the Amazon Managed Blockchain service using the search bar and select the “Query public blockchains” radio button on the right-hand side of the screen. Finally, select “Launch AMB Query”.\n\nOnce on the query editor page, you must select between the Bitcoin network or Ethereum mainnet as the target for your query. For this example, select “ETHERUM_MAINNET” from the “Blockchain network” dropdown.\n\nThen, select the AMB Query API you wish to run from the “Query type” dropdown, which in this case will be “ListTokenBalances”.\n\nThen, fill in both required and/or optional query parameters to finalize your request for blockchain data. In this example, provide an Ethereum externally owned account (EOA) address and any filters by date/time that are relevant.\n\nAfter adding all necessary details to your request, select “Run query” to receive results for your request. If no results are returned, verify that you are using an EOA that has transactions occurring within any date/time filters you have set for your request.\n\nYou may use the AMB Query editor in the AWS Management Console to test all supported AMB Query APIs and explore the Bitcoin and Ethereum data these APIs offer. AMB Query is a pay-as-you-go service billed based on your usage of APIs, thus no resources have been provisioned in your account as part of this hands-on example that need to be deleted.\n\nConclusion\n\nIn this post, we addressed the common challenges builders face when working with blockchain data, as well as how Managed Blockchain Query can address many of those challenges. If you would like to dive deeper into the technology behind Managed Blockchain Query and get hands-on with the service programmatically, check out our Managed Blockchain Query Developer Guide, which provides a series of code samples and an architecture example of how to use the service in the context of a digital wallet use case. Stay tuned for a follow-up blog post delving into technical concepts related to Managed Blockchain Query and how to integrate it with other AWS services.\n\nAbout the authors\n\nForrest Colyer manages the Web3/Blockchain Specialist Solutions Architecture team that supports the Amazon Managed Blockchain (AMB) service. Forrest and his team support customers at every stage of their adoption journey, from proof of concept to production, providing deep technical expertise and strategic guidance to help bring blockchain workloads to life. Through his experience with private blockchain solutions led by consortia and public blockchain use cases like NFTs and DeFi, Forrest helps enable customers to identify and implement high-impact blockchain solutions.\n\nJohn Liu is the Head of Product for Web3 / Blockchain at AWS. He has 13 years of experience as a product executive and 10 years of experience as a portfolio manager. Prior to AWS, John spent 4 years leading product and business development at public blockchain protocols with a heavy focus on cross-chain technology, DeFi, and NFTs. Prior to that, John gained financial expertise as Chief Product Officer for fintech companies and portfolio manager at various hedge funds."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy8zLXN0b2Nrcy13YXRjaC1ldGhlcmV1bS1idWlsZHMtMTIwNTAwNjk4Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 09 Aug 2023 07:00:00 GMT",
        "title": "3 Stocks to Watch as Ethereum Builds Base on PayPal Boost - Yahoo Finance",
        "content": "Ethereum (ETH) has always showcased its competency as an open-ended decentralized software platform. It is one of the selling points of the world’s second most-used cryptocurrency. However, PayPal Holdings, Inc.’s (PYPL) announcment on Monday that it would be introducing its own U.S. dollar-pegged stablecoin, PayPal USD (PYUSD), could spark some serious debate.\n\nPYUSD is an Ethereum-based stablecoin, which would, after introduction, be pegged to the value of the U.S. dollar. It has been designed for digital payments and the web, and will soon be available for U.S. customers. But even as this is bound to push Ethereum stocks up by establishing its place as the money layer on the Internet, it will also hit the crypto coin’s core value of decentralizing.\n\nCentralization issues are the most common attack areas within the gamut of decentralized finance or DeFi, one of the crypto world’s main differentiating features. In 2021 alone, DeFi hacks amounted to no less than $10 billion, revealing patterns of how the transactions are classified and tracked. Now, with around 430 million accounts actively using PayPal, the chances of cluster attacks would go up.\n\nMany smart contract auditors have highlighted that the PYUSD algo contains “freezefunds” and “wipefrozenfunds” functions, which are textbook examples of centralization attack vectors. Concerns have also been raised about the digital contract that users would sign, and that these contracts resemble censorship-enabled central bank digital currency.\n\nDespite this, Ethereum would get a massive boost once the project goes live. It would finally give Ethereum the mainstream push that it has been seeking all these years in its competition with Bitcoin (BTC). Coupled with the Shanghai Upgrade, under which it shifted its blockchain validation system from proof-of-work to proof-of-stake, this might be ETH’s year.\n\nPowered by these developments and what has largely been hailed as a crypto rebound, the price of Ethereum has soared 53.9% this year as of Aug 8. So, with Ethereum getting this push, it might be prudent to keep a watch on stocks exposed to this open-source blockchain platform, decentralized or not.\n\nStory continues\n\nAccenture plc ACN is a global system integrator that provides consulting, technology and other services, and markets Ethereum-based blockchain solutions to businesses to make it easier to process payments.\n\nAccenture’s expected earnings growth rate for the current year is 8.2%. The Zacks Consensus Estimate for its current-year earnings has improved by 0.1% over the past 60 days. Accenture currently carries a Zacks Rank #3 (Hold).\n\nCME Group Inc. CME operates as one of the world's largest futures exchanges and offers a wide range of derivatives contracts. It provides various solutions to invest in cryptocurrencies like Ethereum.\n\nCME Group’s expected earnings growth rate for the current year is 13.6%. The Zacks Consensus Estimate for its current-year earnings has improved by 3.4% over the past 60 days. CME Group currently carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nCisco Systems, Inc. CSCO is a tech giant that manufactures and sells hardware, software, and telecom equipment. Cisco was one of the first and foremost backers of Ethereum when it joined the Enterprise Ethereum Alliance back in 2017. In 2019, the company championed the widespread adoption of crypto on a global scale in a released report.\n\nCisco’s expected earnings growth rate for the current year is 13.1%. The Zacks Consensus Estimate for its current-year earnings has declined 0.3% over the past 60 days. Cisco currently carries a Zacks Rank #2.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nCME Group Inc. (CME) : Free Stock Analysis Report\n\nAccenture PLC (ACN) : Free Stock Analysis Report\n\nCisco Systems, Inc. (CSCO) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS93ZWIzLzIwMjMvMDgvMTAveTAwdHMtbmZ0LWNvbGxlY3Rpb24taXMtbWlncmF0aW5nLXRvLWV0aGVyZXVtLWFmdGVyLWFjY2VwdGluZy0zbS1ncmFudC1mcm9tLXBvbHlnb24v0gGBAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS93ZWIzLzIwMjMvMDgvMTAveTAwdHMtbmZ0LWNvbGxlY3Rpb24taXMtbWlncmF0aW5nLXRvLWV0aGVyZXVtLWFmdGVyLWFjY2VwdGluZy0zbS1ncmFudC1mcm9tLXBvbHlnb24vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 09 Aug 2023 07:00:00 GMT",
        "title": "Y00ts NFT Collection is Migrating to Ethereum After Accepting $3M Grant From Polygon - CoinDesk",
        "content": "“Frank and team played a huge role in helping us expand the NFT [profile picture] ecosystem on Polygon,” said Nailwal. “We will continue to nurture this community that’s tripled in size this year by redeploying the y00ts funds and more to support our native creators and projects we believe have the vision and conviction to help evolve NFTs, both as an artform and as a key to boundless utility.”"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiNGh0dHBzOi8vZm9ya2FzdC5uZXdzL3BheXBhbC11c2Qtc3RhYmxlY29pbi1ldGhlcmV1bS_SAThodHRwczovL2Zvcmthc3QubmV3cy9wYXlwYWwtdXNkLXN0YWJsZWNvaW4tZXRoZXJldW0vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 08 Aug 2023 07:00:00 GMT",
        "title": "PayPal launches regulated USD stablecoin on Ethereum - Forkast News",
        "content": "Editor profile\n\nWill Fee is an editor and Asia correspondent based in central Tokyo. He holds a Master of Philosophy in Japanese Studies from Oxford University, where he specialized in postwar politics, culture and society. He previously covered domestic politics for The Japan Times and is interested in exploring the political implications of a regulatory pivot toward crypto and Web3 in East Asia.\n\nAuthor's email\n\n[email protected]"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvZXRoZXJldW0taXMtdHVybmluZy1kZWZsYXRpb25hcnktYnV0LXByaWNlLXJlbWFpbnMtc3RhZ25hbnTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 08 Aug 2023 07:00:00 GMT",
        "title": "Ethereum Is Turning Deflationary, But Price Remains Stagnant - Watcher Guru",
        "content": "According to Ultra Sound Money data, as of August 7, the Ethereum (ETH) network has burned over half the coins issued since the merge. Around 6.5 million ETH coins have been issued since the merge, and over 3.5 million of them have been burned.\n\nEthereum currently has a supply of about 120.2 million coins. And since the model is still inflationary, more coins are added every year. As of now, the network adds about 580,000 ETH each year. However, the Ethereum network burns about 1.75 million ETH each year, lowering the supply by roughly 0.98%. This makes the platform somewhat deflationary because the circulating ETH amount reduces as coins get actively burned on the network.\n\nAlso Read: Ethereum: These ETH Futures ETFs Are Awaiting Approval\n\nPresently, gas fees generated by ETH transfers and smart contract operations are the main drivers of these burns. Additionally, NFT and DeFi platforms like OpenSea and UniSwap, also play a role. Additionally, the transfer of USDT, an ERC-20 token on the ETH network, also adds to ETH burns.\n\nWill Ethereum prices react to the burns?\n\nSource: Forbes\n\nSo far, ETH’s prices have not heavily responded to the burns. This could be because of less demand as of now. Burns without demand will do little to push the asset’s price. However, the project’s end goal is for the burn rate to outpace the rate of issuing new coins. This would effectively turn Ethereum (ETH) deflationary.\n\nAlso Read: How To Check An Ethereum Transaction?\n\nMoreover, many argue that ETH has become more deflationary than Bitcoin (BTC) after the implementation of the EIP-1559 protocol. This protocol is responsible for burning a fraction of the gas fee from each transaction. However, ETH does not have a fixed cap on its supply, unlike BTC which is capped at 21 million coins. Therefore, ETH’s burn rate will have to outpace its issuance in order for it to be truly considered a deflationary asset. At press time, Ethereum was trading at $1,833.89, down by 0.2% in the last 24 hours."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd3d3LnNsdHJpYi5jb20vc3BvbnNvcmVkLzIwMjMvMDgvMDkvaW50cm9kdWN0aW9uLWV0aGVyZXVtLWlyYXMtdG9wLTUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 09 Aug 2023 07:00:00 GMT",
        "title": "Introduction to Ethereum IRAs: top 5 crypto IRA companies reviewed 2023 - Salt Lake Tribune",
        "content": "#1 My Digital Money:\n\nFull-Service IRA: Yes\n\nFees: 1.9% per transaction\n\nOffers Other Alternative Assets: No\n\nStorage: Cold storage\n\nHeadquarters: Pasadena, CA\n\nFree Kit Link\n\n#2 Bitcoin IRA:\n\nFull-Service IRA: Yes\n\nFees: $240 annually + 10-15% on initial investment + 1% per trade\n\nOffers Other Alternative Assets: No\n\nStorage: Cold storage\n\nHeadquarters: Sherman Oaks, CA\n\nFree Kit Link\n\n#3 BitIRA:\n\nFull-Service IRA: Yes\n\nFees: $195 annually + 0.05% monthly storage fee\n\nOffers Other Alternative Assets: No\n\nStorage: Cold storage\n\nHeadquarters: Burbank, CA\n\nFree Kit Link\n\n#4 Broad Financial:\n\nFull-Service IRA: Yes\n\nFees: $300 annually\n\nOffers Other Alternative Assets: Yes\n\nStorage: Cold storage\n\nHeadquarters: Montvale, NJ\n\nFree Kit Link\n\n#5 Coin IRA:\n\nFull-Service IRA: No\n\nFees: 1% per sell, 1.25% per buy\n\nOffers Other Alternative Assets: No\n\nStorage: Cold storage\n\nHeadquarters: Woodland Hills, CA\n\nFree Kit Link\n\nIntroducing Ethereum IRAs\n\nFor some Americans, the prospect of adding cryptocurrencies to their Individual Retirement Account (IRA) has never crossed their mind. As a relatively new conception, many Americans are unaware of the myriad diversification benefits that a cryptocurrency IRA can offer them.\n\nWhile Gold IRAs and Silver IRAs are common avenues for people to protect their nest eggs with tangible assets, IRAs containing Bitcoin, Ethereum, and other digital currencies are only now starting to gain traction among retirement investors. However, in today’s age of generational inflation and interest rates at 5.5%, we’re seeing more and more investors turn to alternative assets such as cryptocurrencies in their IRAs in order to hedge against systemic market risks and stock market volatility.\n\nWhile newer to the scene, Crypto IRAs offer some of these same qualities as Precious Metals IRAs but with more potential long-term and short-term upsides.\n\nAccording to Bank of America, digital currencies could have a $2 trillion+ market value with 200 million+ users and spearhead the new age of global finance. Crypto makes international financial transactions borderless, efficient, and seamless while offering attributes akin to “digital gold.” As MicroStrategy CEO Michael Saylor says, “It is pretty clear digital gold is going to replace gold this decade.”\n\nBitcoin IRAs are the more established choice for crypto IRA enthusiasts. As the largest and most established cryptocurrency, they offer digital asset exposure to investors’ retirement accounts while maintaining a degree of stability with long-term upside. These IRAs have been around for roughly seven years, with the first Bitcoin IRA launching in 2016 by the aptly named company, BitcoinIRA.\n\nMainstream adoption of Bitcoin is increasing, too, with Colorado recently becoming the first U.S. state to accept crypto for tax payments. Abroad, central banks such as the European Central Bank are set to begin pilot projects for their own digital currencies that operate like Bitcoin. In fact, 11 central banks have already launched their own.\n\nThere’s clearly something to cryptocurrencies if even the world’s largest financial institutions are getting on board with these new technologies.\n\nFurthermore, Bitcoin outperformed gold and the stock market between 2019 and 2021, and is currently on pace to do the same in 2023. A CNBC report also showed that Bitcoin IRAs surged in popularity in 2021 as a vehicle for building long-term wealth while reaping the tax benefits of IRA accounts.\n\nBitcoin IRA accounts, however, don’t exclusively contain Bitcoin. While Bitcoin is the primary crypto holding, these IRA accounts often possess several other cryptocurrencies and altcoins.\n\nRecently, many savvy investors have shifted their Crypto IRA accounts to Ethereum IRAs. Although Bitcoin IRAs, to date, are better known, Ethereum provides investors with a whole new avenue of exposure to a different segment of the crypto universe and long-term potential.\n\nWhat is Ethereum, and How Does it Differ From Bitcoin?\n\nComparisons between Bitcoin and Ethereum, especially when it comes to IRA accounts, are inevitable. Bitcoin remains the largest and most established cryptocurrency. Ethereum has rapidly gained ground as the second-largest cryptocurrency by market cap over the last few years. As of Q3 2023, Ethereum has a token price of US$1,848 and a total market volume of $6.9 billion.\n\n(IronMonk Solutions via CoinMarketCap, sponsored) Ethereum has rapidly gained ground as the second-largest cryptocurrency by market cap over the last few years.\n\nBitcoin (BTC) and Ethereum (ETH) have inherent similarities. Both are investable cryptocurrencies, decentralized, and deregulated. Each is on the blockchain, stored in digital wallets, and powered by distributed ledgers and cryptography. This means that they cannot be changed, hacked, or controlled by any single centralized entity.\n\nHowever, that is about where the similarities end.\n\nPrimary Purposes\n\nBitcoin, as the world’s first cryptocurrency, was created in 2009 by an anonymous computer programmed who goes by the name of Satoshi Nakomoto. This came on the heels of the financial crisis recession, which necessitated new financial technologies to prevent future financial crises. Its purpose was to compete with fiat currencies as an electronic P2P currency system, medium of exchange, and store of value comparable to digital gold. Whether or not it has accomplished all of those goals is a matter of public debate.\n\nOn the other hand, Ethereum is the next-most-popular cryptocurrency, and it was built with a different purpose. It’s an avenue for developers to monetize smart contracts, create decentralized apps (“dApps”), and build on top of existing programming languages. Vitalik Buterin, a young mathematic and computer science prodigy, co-created Ethereum in 2013 to facilitate immutable, programmatic contracts. Chances are, it’s served its initial purpose more than Bitcoin has. Since its emergence, it has spawned a revolution in blockchain technology, leading to the creation of thousands of cryptocurrencies that run on its framework.\n\nNumerous surging areas in the crypto ecosystem, such as Decentralized Finance (DeFi), exchanges, NFTs, crypto gaming, and more, were built and monetized on the Ethereum blockchain. According to USA Today, the current price target for Ethereum in 2023 is about $2,900 per ETH token.\n\nIn many ways, Bitcoin and Ethereum are not direct competitors but rather cohabitors in the same universe. Yet the Ethereum ecosystem, especially as it upgrades to Ethereum 2.0, is growing exponentially. It is “open-sourced” and decentralized and offers smart contracts, making it fully programmable. Ethereum, more so than Bitcoin, has revolutionized the crypto ecosystem for developers as a medium to build real-world, fully customizable applications.\n\nPerhaps that’s why, from 2020 to 2022, Ethereum’s skyrocketing value dwarfed that of Bitcoin. Since mid-2022, however, Bitcoin and Ethereum have followed similar growth trajectories, as indicated in the charts below.\n\n(IronMonk Solutions via WalletInvestor, sponsored) Bitcoin Charts.\n\n(IronMonk Solutions via WalletInvestor, sponsored) Ethereum Charts.\n\n“Digital Gold vs. Digital Silver”\n\nGold and silver are precious metals that naturally compete, especially when it comes to IRA accounts. Gold is considered a store of value and inflation hedge because of limited supply and stability. Silver has similar attributes while offering more widespread industrial uses, affordability, and liquidity. Russ Koesterich of BlackRock notes that silver has more industrial uses than gold, such as electronic devices, electrical systems, and solar panels. Silver is also integral to an EV industry that could be a potential $46 trillion juggernaut industry by 2050, notably for “the electric engine, battery pack, and battery management system.” According to Morgan Stanley, silver is significantly cheaper than gold and more accessible to small retail investors. Moreover, silver is liquid, ubiquitous, and versatile in trading.\n\nOf course, similar to Bitcoin and Ethereum, gold and silver are 1 and 2 regarding precious metal market value.\n\nBitcoin is often compared to digital gold because it was the first cryptocurrency. It also has the largest market cap and is in limited supply, making it a digital store of value. Ethereum is often compared to digital silver because it is the second-largest cryptocurrency. Like silver, it serves various purposes for a wide range of applications. It is also cheaper than Bitcoin and more liquid.\n\nTransactions\n\nWhen it comes to transaction fees, Bitcoin remains significantly cheaper than Ethereum. Bitcoin’s transactions are also monetary, with notes and messages affixed and encoded within data fields in its transactions. In contrast, Ethereum transactions contain executable code for creating smart contracts or self-executing contracts and applications built on top of them.\n\n(IronMonk Solutions via TheBlock, sponsored) Transaction Fees.\n\nIn 2021, Ethereum underwent a “hard fork” where its underlying blockchain system was upgraded to smoothen out how transaction fees are calculated and make them less volatile. In 2023. After successfully forking, the Ethereum token saw an immediate +3.9% price surge.\n\nBitcoin is ready to do the same. After numerous hard fork events in its past, Bitcoin is headed for another sometime in the next few years—after which, we could see large-scale price action.\n\nWith Ethereum, you often get what you pay for. Ethereum’s transaction speed is infinitely faster than Bitcoin’s. The block time, which determines how long it takes for transactions to get confirmed, takes roughly 10 minutes for Bitcoin and 15 seconds for Ethereum. Bitcoin’s transaction throughput is only about 7 per second, compared to Ethereum’s 30 per second.\n\nFor this reason, Ethereum is a faster and more practical peer-to-peer payment system than Bitcoin according to many analysts and observers in the industry.\n\nEnergy Consumption/Staking\n\nBoth Bitcoin and Ethereum use proof of work (PoW) protocol. Proof of Work is a mechanism for networks to validate information recorded on their blockchains and is used widely in cryptocurrency mining for new tokens.\n\nOutside of congestion and lag times with proof of work protocols, proof of stake consumes enormous energy. While Ethereum plans to move to proof of stake (PoS) technology, Bitcoin will remain with PoW. PoS substitutes computational power with staking—making it less energy-intensive—and replaces miners with validators.\n\nCurrently, machines performing the “work” for Bitcoin consume vast amounts of energy primarily sourced from fossil fuels.\n\nBitcoin Energy Consumption Worldwide, 2017 to 2023 (Source: Statista)\n\nPer year, Bitcoin’s carbon footprint is comparable to the carbon footprint of the Czech Republic. Its power consumption compares to Thailand, and its small IT equipment waste is on par with the Netherlands.\n\nThat doesn’t even take into account what one single Bitcoin transaction wastes. One transaction is equivalent to the carbon footprint of 2,645,939 VISA transactions or 198,972 hours of watching YouTube, wastes about as much power as an average U.S. household over 73.36 days, and wastes about as much electricity as the weight of 2.18 iPhones 12 or 0.73 iPads. In short, Bitcoin is undeniably wasteful and can be seen as an ecological hazard.\n\nBy contrast, Ethereum is said to be “virtually unrecognizable in energy consumption” after numerous hard forks that have made transactions less power-intensive. As seen in the graphic below, Ethereum’s new Proof-of-Stake system utilizes fewer energy resources than PayPal, Netflix, and Airbnb.\n\n(IronMonk Solutions via Ethereum.org, sponsored) Annual Energy Consumption in TWh/yr.\n\nHow to Add Ethereum to Your IRA Account\n\nNow that we’ve gone through how Ethereum differs from Bitcoin let’s go through how you can add Ethereum to your IRA account. With more and more people realizing the widespread benefits of Ethereum, especially with how DeFi, NFTs, and the blockchain space continue evolving and growing, many are starting to see the long-term benefits of Ethereum and are opting to add it to their IRA accounts.\n\nBitcoin IRAs are still a new phenomenon, and Ethereum IRAs are even more recent. So it’s essential to understand what to do from start to finish, especially considering how traditional brokerage accounts typically do not support crypto IRAs.\n\nIt’s a simple process and takes only 4 steps.\n\nStep 1: Choose the type of IRA account you want\n\nEthereum IRA accounts, like Bitcoin IRAs or Gold and Silver IRAs, are self-managed or self-directed accounts. As the account holder, you are entirely in charge of selecting the assets in the IRA account.\n\nYou will have the option to choose between two types of self-directed retirement accounts:\n\nRoth Ethereum IRA\n\nAfter-tax retirement savings account that works just like any Roth IRA.\n\nNo upfront tax deduction with contributions.\n\nZero requirements to pay taxes later on when you retire and begin to take distributions.\n\nTraditional Ethereum IRA\n\nTax-deferred retirement savings account.\n\nContributions and gains will not be taxed.\n\nTypically tax-deductible contributions.\n\nFor 2023, annual contribution limits are $6,500 if under age 50 and $7,500 if age 50 or above (add an additional $500 to each for 2024)\n\nMust pay taxes on distributions during retirement.\n\nBeyond account type, you have to consider storage solutions and exchange solutions. Storage solutions digitally store and encrypt your crypto assets to protect them from theft or loss. Exchange solutions facilitate live crypto trading.\n\nStep 2: Use a reputable Ethereum IRA company to set up your account\n\nEthereum IRA accounts are self-managed; however, it’s essential to partner with a trusted third-party custodian to help set up your account. In reality, though, a reputable custodian does so much more. They provide FDIC insurance and technical support, ensure full IRS compliance, and handle all storage and exchange solutions.\n\nWhen choosing a provider, make sure to exercise discretion and go with one that provides all the required services. They must also understand crypto just as much as retirement accounts. Most importantly, they must have a sterling reputation from multiple sources and a strong track record.\n\nStep 3: Fund your account\n\nThere are several ways you can choose to fund your IRA account. You can do a direct bank transfer, IRA rollover, or direct IRA-to-IRA transfer. A top-notch IRA custodian can help facilitate any of these if you want to start an Ethereum IRA.\n\nCustodians are especially useful when it comes to rollovers, aka transferring funds from an existing IRA or any employer-sponsored account (barring restrictions) to a new Ethereum IRA.\n\nStep 4: Choose your assets\n\nJust because it’s called an Ethereum IRA doesn’t mean you have to limit yourself to only owning Ethereum. Working with your IRA provider can help you select a basket of crypto assets to hold in your retirement account and store it in secure digital wallets.\n\nThe Benefits of an Ethereum IRA\n\nThere are several benefits that an Ethereum IRA can offer you.\n\n1. Diversification\n\nWhether or not you are a crypto bull, crypto is now an asset class, just as any equity sector or commodity. In today’s economic and geopolitical environment, diversifying with multiple asset classes, including crypto, is paramount.\n\nYou can see it first hand too, when you compare the returns of Ethereum to those of Bitcoin, Gold, Silver, Copper, and Dow Jones, S&P 500, and Nasdaq ETFs. When Russia invaded Ukraine on February 24, 2022, Ethereum was the biggest gainer among these assets, dwarfing the others with a 33% rally all the way into April.\n\n(IronMonk Solutions via Stockcharts, sponsored) Returns of Ethereum to those of Bitcoin, Gold, Silver, Copper, and Dow Jones, S&P 500, and Nasdaq ETFs.\n\nMany reputable financial sources recommend allocating a portion of your portfolio to crypto assets. Fidelity’s Bitcoin Investment Thesis suggests dedicating 5% of a multi-asset portfolio to Bitcoin. Other studies, however, say to allocate assets into other cryptos, namely a 2019 Yale study that recommended allocating 4% to 6% towards a basket of cryptos. Many other financial advisors, CFPs, and financial experts are beginning to adopt a roughly 1% to 5% asset allocation recommendation. Within one’s crypto portfolio, a more recent 2023 report indicated that a 50-50 or 60-40 Bitcoin and Ethereum split may help maximize one’s returns.\n\n2. IRS-Compliant\n\nEthereum IRA accounts are fully IRS-compliant for one simple reason. The IRS sees crypto as a capital asset, like any other security. Therefore, it is fully acceptable under IRS guidelines to hold cryptocurrencies in an IRA.\n\nYou should be fine as long as you aren’t purchasing life insurance, a collectible, or directly violating the Internal Revenue Code Section 4975(c).\n\n3. Tax benefits\n\nThe tax benefits of an IRA account are their strongest selling point over a regular bank account, or in this case, a crypto wallet. Tax benefits work the same way for Ethereum IRA accounts as with any traditional IRA account. You need to make sure you pick the right one, though.\n\nLike other types of IRA accounts, Ethereum in an IRA is a capital gains tax shelter. Depending on the type of IRA you choose, you can have tax deductions for deposits or tax-deferred or tax-free growth on earnings.\n\nHowever, what makes an Ethereum IRA especially attractive is that dealing with crypto taxes is a headache. Not only do you have to account for capital gains any time you sell crypto at a profit for USD or any other fiat currency. To ensure tax compliance, you must physically record every trade and document precisely what each trade gained. With an Ethereum IRA, you don’t have to worry about that nonsense.\n\n4. Exposure to Ethereum’s rise and Web3\n\nEthereum is one of the most exciting investible digital assets today. The short-term rise of Ethereum has been more apparent when compared to Bitcoin and the broader equity markets.\n\nLong term, Ethereum has a robust development roadmap that can offer enormous potential, significantly as it upgrades to Ethereum 2.0. Moreover, because of Ethereum’s programmability, it not only gives you exposure to booming DeFi and dApp spaces. It powers an NFT space that’s more than just pricey animations. Digital Journal says the global NFT market could multiply by nearly 5x at a 23.3% CAGR by 2028 and could power the next iteration of the internet: Web 3.0.\n\nUnderstanding the Cons\n\nEthereum’s long-term potential is clear. Yet, before adding it to your IRA, understand some of the cons and drawbacks first.\n\nFirst and foremost, there are significant volatility risks. Ethereum’s volatility even compared to Bitcoin, is high. Yes, Ethereum has massive return potential and has crushed other asset classes ever since its inception and recently. Yet, with significant returns come big risks and instability.\n\nFor instance, we discussed how well Ethereum had performed ever since the Ukraine invasion. However, if you backtrack and look at its 1-year chart, you can see violent price swings and distinct peaks and valleys in 2022 and 2023. Don’t be alarmed by this, as such price movements are typical of crypto assets and newer assets perceived as riskier. While price actions such as these are capitalized upon by traders, these assets have trended upward in value since they were first introduced.\n\n(IronMonk Solutions via YCharts, sponsored) ETH-USD price chart August 2022 to 2023.\n\nOpportunity costs are another issue. Allocating a certain amount of funds in your IRA to a particular asset, such as Ethereum, uses up precious, limited contribution space ($6,500-7,000 per year) that could go towards other assets. Crypto IRAs typically come with higher minimum investment requirements than other IRAs. That doesn’t even include recurring management, custodial, and maintenance fees, which, mind you, are typically higher. Not to mention the complex fee structures that most Ethereum IRA providers possess.\n\nSigns also look like increased regulation for crypto is inevitable, as President Biden signed an executive order in March 2022 calling for a broader federal strategy for regulating digital assets.\n\nTop 5 Ethereum IRA Companies\n\nIf you want to start an Ethereum IRA, choosing a high-quality Ethereum IRA provider is easily the most critical step. Ensure your due diligence and go with a provider that offers the following characteristics:\n\nLongevity\n\nEase of Use\n\nRatings and Customer Reviews\n\nFees\n\nStorage Capabilities\n\nFounder and Executive Team\n\nData Security and Customer Safety\n\nCustomer Service\n\nConsidering these characteristics, we made your research a little bit easier with this list of our exclusive list of the top 5 Ethereum IRA companies. Our rankings were decided after extensive company background research and aggregated user reviews found all over the web.\n\nBest Ethereum IRA Companies\n\nURL: www.mydigitalmoney.com\n\nPhone: 833-636-2008\n\nYears in Business: 2\n\nBitcoin IRA Annual Fees: None\n\nFull-Service Bitcoin IRA: Yes\n\nInsured Bitcoin IRA? Yes\n\n(MyDigitalMoney | IronMonk Solutions, sponsored) MyDigitalMoney Logo.\n\nMy Digital Money was founded by industry veteran Collin Plume. Collin built the company from the ground up after learning the ins and outs of the IRA business through his principal venture, Noble Gold. Within 2 years, My Digital Money has become the highest-rated Ethereum IRA firm in the country and has gotten recognition for slashing its fees over time. The firm’s main focus is helping individual investors add metals and now crypto to their portfolios and retirement accounts.\n\nThis company’s leading Ethereum and Bitcoin investing platform makes it affordable and accessible to not only invest but also trade Bitcoin and other cryptocurrencies within an IRA. All of this can be done at the touch of a button through the company’s simple-to-use online dashboard. Plus, My Digital Money is one of the only companies that charge low transaction fees for every asset sold or purchased within their accounts (1.9%).\n\nPros:\n\nTerrific military-grade security protocols for all Ethereum wallets\n\nPartnership with Equity Trust Company for custodian services\n\nProvides affordable access to all major cryptocurrencies\n\nCons:\n\nA newer company that lacks the longevity of some competitors\n\nURL: bitcoinira.com\n\nPhone: 877-936-7175\n\nYears in Business: 5\n\nEthereum IRA Annual Fees: $240\n\nFull-Service Ethereum IRA: Yes\n\nInsured Ethereum IRA? Yes\n\n(Bitcoin IRA | IronMonk Solutions, sponsored) Bitcoin IRA Logo.\n\nDespite its name, Bitcoin IRA is not only a full-service solution for Bitcoin IRA services. Rather, they offer a wide variety of cryptocurrencies, including Ethereum. The company was founded by Camila Concha, Chris Kline, and Johannes Haze. Each founder has an impressive background and it is not their first endeavor. It is a fully self-trading platform so the user must make all of their investment decisions. They offer an app for their users on both Android and iOS, which is helpful and convenient for any trading account and a great way to watch your money grow. Their two account options are an IRA or an interest-bearing crypto account. Both are great options for someone thinking long-term for their crypto portfolio.\n\nPros:\n\nAvailable on both Mac and PC devices, as well as iOS and Android\n\nAllows you to borrow against Ethereum or Bitcoin\n\nIntuitive, user-friendly site and app\n\nCons:\n\nNot always clear regarding which assets you can and cannot invest in\n\nTax concerns may arise regarding the company’s 6% monthly payouts on IRA accounts\n\nURL: www.bitira.com\n\nPhone: 800-299-1567\n\nYears in Business: 6\n\nEthereum IRA Annual Fees: $400\n\nFull-Service Ethereum IRA: Yes\n\nInsured Ethereum IRA? Yes\n\n(BitIRA | IronMonk Solutions, sponsored) BitIRA Logo.\n\nThis California-based company offers one single account for all your alternative investments to be in one place. BitIRA has partnerships with Genesis to facilitate trading Ethereum, other crypto token, and various other alternative asset classes. The site also offers accounts for professional advisors to manage accounts on behalf of their clients. Professionally, there are not many options out there like this.\n\nPros:\n\nTerrific physical and cybersecurity track record\n\nEnhanced reporting and account holdings overview to track investment progress\n\nCons:\n\nNot always transparent regarding all costs implied in transactions\n\nHefty minimum deposit required ($5,000)\n\nURL: www.broadfinancial.com\n\nPhone: 800-395-5200\n\nYears in Business: 19\n\nEthereum IRA Annual Fees: $300\n\nFull-Service Ethereum IRA: Yes\n\nInsured Ethereum IRA? Yes\n\n(Broad Financial | IronMonk Solutions, sponsored) Broad Financial Logo.\n\nBroad Financial offers professional and non-professional self-directed accounts for traditional investments and alternative investments all in one account. They offer a wide variety including mortgage notes, peer-to-peer lending, private equity, and as we’ve been discussing, crypto and Ethereum IRAs. Overall, Broad Financial is a great one-stop-shop for more types of accounts that we have the space to type out, which says a lot about their experience in so many different spaces. They also offer individual consulting for newer investors looking to get a head start on their investments.\n\nPros:\n\nHuge variety of assets classes offered, including Ethereum and Ethereum-based tokens\n\nOffer products and accounts for individuals, businesses, and professional investment managers\n\nCons:\n\nA one-stop shop is great, but not heavily focused on being able to add cryptocurrency to your IRA as the other options we’ve discussed\n\nURL: coinira.com\n\nPhone: 888-988-COIN\n\nYears in Business: 6\n\nEthereum IRA Annual Fees: No Fees\n\nFull-Service Ethereum IRA: Yes\n\nInsured Ethereum IRA?: Yes\n\n(Coin IRA | IronMonk Solutions, sponsored) Coin IRA Logo.\n\nCoin IRA is an all-in-one solution that allows clients to self-trade in cryptocurrencies, physical gold, and physical silver in their self-directed Ethereum IRA accounts. They have low transaction fees and also allow users to buy and sell 24 hours a day, unlike some similar platforms. Client assets are held in institutional-grade storage solutions, with best-in-class security. They offer an easy-to-use platform similar to Coinbase to invest in cryptocurrency and precious metals online; the recent explosion of interest in cryptocurrency and security has continued to be a large concern which they seem to combat very well.\n\nPros:\n\nInstitutional-grade storage, with best-in-class security\n\nTransparent about their fees and their management team\n\nGreat reviews listed on their site which we verified\n\nHeavily focused on tax benefits, so for investors looking long term this should be a contender\n\nCons:\n\nThere aren’t as many cryptocurrencies to choose from as some other options\n\n#1 My Digital Money:\n\nFull-Service IRA: Yes\n\nFees: 1.9% per transaction\n\nOffers Other Alternative Assets: No\n\nStorage: Cold storage\n\nHeadquarters: Pasadena, CA\n\nFree Kit Link\n\n#2 Bitcoin IRA:\n\nFull-Service IRA: Yes\n\nFees: $240 annually + 10-15% on initial investment + 1% per trade\n\nOffers Other Alternative Assets: No\n\nStorage: Cold storage\n\nHeadquarters: Sherman Oaks, CA\n\nFree Kit Link\n\n#3 BitIRA:\n\nFull-Service IRA: Yes\n\nFees: $195 annually + 0.05% monthly storage fee\n\nOffers Other Alternative Assets: No\n\nStorage: Cold storage\n\nHeadquarters: Burbank, CA\n\nFree Kit Link\n\n#4 Broad Financial:\n\nFull-Service IRA: Yes\n\nFees: $300 annually\n\nOffers Other Alternative Assets: Yes\n\nStorage: Cold storage\n\nHeadquarters: Montvale, NJ\n\nFree Kit Link\n\n#5 Coin IRA:\n\nFull-Service IRA: No\n\nFees: 1% per sell, 1.25% per buy\n\nOffers Other Alternative Assets: No\n\nStorage: Cold storage\n\nHeadquarters: Woodland Hills, CA\n\nFree Kit Link\n\nConclusion: Open an Ethereum IRA TodayEthereum isn’t like other crypto assets. It offers the potential for explosive near-term returns coupled with long-term possibilities. Ethereum is so much more than just a digital token. It is a customizable and programmable blockchain force that can add exposure to DeFi, NFTs, or Web 3.0 to your IRA account.\n\nAdding Ethereum to your IRA can add some sizzle without a tax burden if you are a long-term bull. The risks are genuine, and there will be volatility. However, if you are a long-term investor, a few hiccups and corrections shouldn’t worry you.\n\nPlus, with the way Ethereum and Bitcoin have outperformed every major asset class in 2023 so far, investors could be riding the momentum to new heights in the months ahead.\n\nWhen it comes to your strategy for retirement, we recommend that you consider all the options. If you do your due diligence and partner with a reputable custodian, properly starting an Ethereum IRA account could add immense potential to your nest egg.\n\nFor the best results, we recommend the California-based My Digital Money for your Ethereum needs. This conclusion is based on years of historical outperformance, a perfect security track record, an innovative fee structure, and excellent customer reviews. To find out more about how a Bitcoin IRA can work for you, consider requesting a FREE info kit from My Digital Money or give them a call at 1-833-636-2008 for more information.\n\nREQUEST FREE KIT"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2xpZG9zLWFkb3B0aW9uLXN1cmdlcy13aXRoLTEwMDAwLW5ldy1zdGFrZXJzLWRlc3BpdGUtZXRoZXJldW1zLXByaWNlLXN0cnVnZ2xlcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 08 Aug 2023 07:00:00 GMT",
        "title": "Lido adoption surges with 10000 new stakers despite Ethereum's price struggles - CryptoSlate",
        "content": "More than 10,000 new stakers joined Lido (LDO) in July, according to the latest report from the liquid staking protocol, indicating its continued adoption and growth despite the current market situation.\n\nIn July, Lido’s TVL briefly exceeded $15 billion for the first time since May 2022 but fell below the benchmark due to Ethereum’s (ETH) price struggles.\n\nOver the preceding month, the value of Ether underwent a modest decline of approximately 3% to $1,815 as of press time, according to CryptoSlate’s data. This price correction emerged as the initial enthusiasm within the crypto market, fueled by a bullish streak in June primarily driven by institutional investors, gradually subsided.\n\nEven though Lido’s TVL experienced a decline from its impressive $15 billion benchmark, it retains its position as the foremost DeFi protocol. Notably, Lido continues to command a substantial 36% share of the aggregate TVL encompassing all DeFi projects.\n\nPredicts staked Ether to grow beyond 8M\n\nThe DeFi protocol predicted that the total number of staked Ethereum via its platform will surpass eight million in August, as it has consistently experienced large monthly net inflows despite the activation of withdrawals.\n\nDeFillama data shows that this prediction has come to pass with the total value of assets locked on Lido in terms of Ethereum currently at 8.08 million ETH, an all-time high. However, Lido’s website places the number at around 7.9 million as of press time.\n\nCurve Finance exploit impact Lido\n\nIn the wake of the recent exploit of Curve Finance, several liquidity providers withdrew their assets from the platform’s stETH-ETH pool.\n\nDespite the fact that this specific pool remained untouched by the exploit, stETH’s usage in DeFi experienced a decline of 2.88% compared to the previous month of June. Consequently, the overall share held within the liquidity pools also underwent a substantial contraction, plummeting by 53.07%.\n\nOther metrics\n\nLido’s increasing adoption has also translated into the growing adoption of its staked ETH. The number of unique addresses holding stETH increased by 9.26% from June to 255,000. The amount in lending pools also increased by 3.63%, while wstETH in Layer-2 networks jumped by 12.83%.\n\nThe demand for wrapped staked ETH on the layer-2 networks has also increased, with Arbitrum and Optimism bridges witnessing more wstETH deposits.\n\nHowever, Lido’s LDO token struggled considerably in July, falling 7% amid the contagion fears that gripped the DeFi market.\n\nMentioned in this article"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9wYXlwYWwtdXNkLWJvb24tZm9yLWV0aGVyZXVtLWJ1dC1ub3QtZGVjZW50cmFsaXphdGlvbi1zYXlzLWNvbW11bml0edIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 08 Aug 2023 07:00:00 GMT",
        "title": "PayPal USD: Boon for Ethereum but not decentralization, says community - Cointelegraph",
        "content": "PayPal’s new Ethereum-based stablecoin, PYUSD, has been seen as bittersweet news for the crypto community.\n\nWhile it could finally see Ethereum find its place in mainstream adoption, it could also spell trouble for decentralization and personal control of assets, warns the community.\n\nThe new stablecoin, PayPal USD, was launched on Aug. 7 and is issued by Paxos Trust Co. — the firm behind Binance USD (BUSD). It’s built on Ethereum and “designed for digital payments and Web3,” with the firm saying it will soon be available to United States customers.\n\nThe launch has been seen as a boon for Ethereum adoption. Ethereum bulls Anthony Sassano and Ryan Sean Adams believe the ERC-20 stablecoin will push the blockchain closer toward becoming the money layer of the internet.\n\nThis is the Ethereum contract address for PayPal's stablecoin.\n\n\n\nI can't believe i get to tweet that.\n\n\n\nWe've come so far. pic.twitter.com/S6kSqcV4ut — RYAN SΞAN ADAMS - rsa.eth (@RyanSAdams) August 7, 2023\n\nThe number of daily active users on Ethereum currently hovers between 300,000-400,000, according to Etherscan.\n\nHowever, Sean Adams noted that 430 million accounts actively use the online payment processor, which means that over 5% of the world’s 8 billion people could theoretically be onboarded onto Ethereum through PayPal’s new stablecoin.\n\nMartin Koppelmann, the CEO and co-founder of Gnosis, added that by launching PYUSD on Ethereum’s base layer, Ethereum layer-2s will be able to interact with PYUSD too.\n\nOthers, including lawmakers, have seen it as another example of larger institutions embracing crypto, breathing new life into the traditional payments system.\n\nIn an Aug. 7 statement, Patrick McHenry, chair of the United States House Committee on Financial Services, said stablecoins like PayPal’s PYUSD “hold promise as a pillar of our 21st century payments system.”\n\n#NEW: Chairman @PatrickMcHenry releases a statement following the announcement of PayPal's payment stablecoin launch.\n\n\n\nRead more https://t.co/LOF9ayUNnG pic.twitter.com/sRfSfLYbXQ — Financial Services GOP (@FinancialCmte) August 7, 2023\n\nHowever, not everyone is convinced about PayPal’s new stablecoin.\n\nSeveral smart contract auditors highlighted that PYUSD’s smart contract contains “freezefunds” and “wipefrozenfunds” functions, which they claim are textbook examples of centralization attack vectors in Solidity contracts.\n\nThe new Paypal USD stablecoin has an \"assetProtection\" role which can wipe your balance in two transactions (first `freeze`, then `wipeFrozenAddress`)\n\n\n\nIn smart contract security we call this a \"centralisation attack vector\" pic.twitter.com/RsmqvsnKvi — pashov (@pashovkrum) August 7, 2023\n\nThis concern was echoed by cryptocurrency researcher Chris Blec, who believes that PayPal will use the controversial functions where necessary.\n\nDigital asset lawyer Sasha Hodder believes many characteristics of PayPal’s stablecoin resemble that of a censorship-enabled central bank digital currency. Another smart contract auditor noted that PYUSD’s smart contract can be changed by PayPal at any time.\n\nI just read the PayPal USD terms of service.\n\n\n\n- full KYC\n\n- custody by Paxos\n\n- tied to your PayPal login\n\n- PayPal can reverse any transaction\n\n- claimed to be fully backed by actual USD\n\n\n\nAll the censorship capabilities of a CBDC, but launched by big tech instead of the gov't. — Sasha Hodder (@sashahodler) August 7, 2023\n\nIn October, PayPal was slammed for a controversial policy that could’ve seen users fined $2,500 for spreading “misinformation.” The firm later backpedalled, claiming the policy update was published “in error.”\n\nRelated: PayPal’s crypto holdings increased by 56% in Q1 2023 to nearly $1B\n\nMeanwhile, blockchain engineer Patrick Collins took a slightly more neutral view, suggesting that PayPal’s PYUSD could have been “epic” but believes some of the engineering choices were suboptimal — such as choosing an outdated version of Solidity to program the contract, making the contract upgradeable and not making it gas efficient.\n\nSassano also explained in a separate post that while PayPal’s stablecoin is centralized, Ethereum users are free to choose whether they wish to use it or not.\n\nYes, PayPal's stablecoin is centralized.\n\n\n\nNo, that doesn't make it any less cool that PayPal has a stablecoin.\n\n\n\nEthereum being a settlement layer for all types of value means that different types of assets will exist on the network & you get to choose which ones you want to use. — sassal.eth (@sassal0x) August 8, 2023\n\nPayPal said PYUSD will be rolled out within the next few weeks.\n\nETH is currently priced at $1,825, which is approximately the same price at the time of PayPal’s announcement about 10 hours ago, according to CoinGecko. Only minor fluctuations have been observed in ETH’s price since then.\n\nMagazine: DeFi Dad, Hall of Flame: Ethereum is ‘woefully undervalued’ but growing more powerful"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOC8wOS9ldGhlcmV1bS1sYXllci0ycy13aW5uaW5nLWFkb3B0aW9uLXdhci13aXRoLWJpdGNvaW5zLWxpZ2h0bmluZy1uZXR3b3JrLWNvaW5iYXNlLWNlby1icmlhbi1hcm1zdHJvbmcv0gGJAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA4LzA5L2V0aGVyZXVtLWxheWVyLTJzLXdpbm5pbmctYWRvcHRpb24td2FyLXdpdGgtYml0Y29pbnMtbGlnaHRuaW5nLW5ldHdvcmstY29pbmJhc2UtY2VvLWJyaWFuLWFybXN0cm9uZy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 09 Aug 2023 07:00:00 GMT",
        "title": "Ethereum Layer-2s Winning Adoption War With Bitcoin’s Lightning Network: Coinbase CEO Brian Armstrong - The Daily Hodl",
        "content": "Coinbase CEO Brian Armstrong says that the scaling solutions for Ethereum (ETH) have a better adoption rate than Bitcoin’s (BTC) Lightning Network.\n\nIn a recent earnings call, Armstrong says that Ethereum’s scaling solutions, such as Polygon (MATIC), Optimism (OP) and Arbitrum (ARB), are seeing heavy adoption.\n\n“We’ve been taking a fresh look at it [Lightning Network], and there’s been a number of really great teams from different companies working on open source solutions and some proprietary ones that are trying to help advance the state of technology there. I think the Layer-2 solutions on Ethereum, like Polygon and Optimism and Arbitrum, Base [Coinbase’s layer 2 network built on Ethereum] is built on one of those, Optimism, have — they’ve actually gotten more adoption.”\n\nAccording to the Coinbase CEO, scaling solutions can enhance the adoption level by becoming more user-friendly.\n\n“A lot of it comes down to usability challenges as well.\n\nIf you’re an average user, they don’t really want to know or maybe they don’t even care about these — what is it doing underneath, like the average user doesn’t want to have to learn how to bridge from Layer 1 to Layer 2 to send their payment. They just want to pay for something and it ‘just works.’\n\nI think what needs to happen, and this is something Coinbase can really help with is we can make this seamless in the background.\n\nIf somebody goes to pay for something online or a friend or a remittance payment or something like that, it should really negotiate — almost do a handshake underneath that would say, OK, what types of cryptocurrencies on what chains and is this recipient accepting, and which ones do I have? And it would basically do the bridge or the conversion in real time for you underneath. And so, you would just see the amount of dollars or something like that going over the wire, and it arrives in one second with $0.01…\n\nAnd you don’t have to worry about Layer 2 and all these kinds of things. That’s the ideal outcome we need to get to…”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiM2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2NvaW5iYXNlLWwyLWJhc2UtbWFpbm5ldNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 09 Aug 2023 07:00:00 GMT",
        "title": "Coinbase layer-2 network Base now live on Ethereum mainnet - Blockworks",
        "content": "Base, the Ethereum layer-2 network built with Optimism’s OP stack, is officially opening its doors today.\n\nCoinbase first revealed its intention to build Base in February, when CEO Brian Armstrong detailed what he was calling “The Coinbase Secret Master Plan.”\n\nThe launch of Base’s mainnet marks an important milestone of this plan, Jesse Pollak, head of protocols at Coinbase, told Blockworks.\n\nDevelopers have had access to Base since July 13, and a number of users have already bridged their ETH to the layer-2 network through a portal proxy contract. Members of crypto’s “degen” community also moved to make themselves at home on Base once the doors were ostensibly opened.\n\nAt launch, more than 100 decentralized apps (dapps) and service providers will operate on the network.\n\n​​In the first week of what Base is calling “on-chain summer,” users can mint multiple NFT designs and artworks to celebrate the launch. A handful of ecosystems and dapps will also be publicly available for users, including prominent players such as Uniswap, Aave and Compound.\n\n“We really see Base as the place to bring the next billion people on-chain,” Pollak said. “A lot of that is because of our ability to integrate that into those consumer experiences and make everything really easy to use.”\n\nWhat’s next for Base?\n\nBase’s developers are working with Optimism and actively looking into ways to continue decentralizing.\n\nA Leader Election proposal is currently in the works, which Pollak describes as a first milestone to decentralized sequencing.\n\nThe team is also in touch with Espresso Systems, who has recently revealed a testnet version of the Espresso Sequencer.\n\n“I think it’s a great illustration of the approach we’re taking with the OP stack and Base,” Pollak said. “Rather than trying to do it all ourselves, we’re leveraging the magic of decentralization and saying: Hey, we have this open-source technology stack, it’s customizable, it’s modular, it’s built to be pluggable.”\n\nThe Base and Optimism teams are also working with other ecosystem contributors to explore zkEVM technology and how it could be incorporated into the OP stack.\n\n“I feel pretty blessed and lucky that we are in a position where there are all these incredible teams that are seeing the OP stack as a shelling point and are contributing to it in a really meaningful way,” Pollak said.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMilAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3B1ZmZlci1maW5hbmNlLXJhaXNlcy01LTVtLXNlZWQtZnVuZGluZy10by1zdHJlbmd0aGVuLWV0aGVyZXVtLWRlY2VudHJhbGl6YXRpb24tLXNjYWxhYmlsaXR5LTMwMTg5NjAwMi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 08 Aug 2023 07:00:00 GMT",
        "title": "Puffer Finance Raises $5.5M Seed Funding to Strengthen Ethereum Decentralization & Scalability - PR Newswire",
        "content": "GEORGE TOWN, Cayman Islands, Aug. 8, 2023 /PRNewswire/ -- Puffer Finance, a blockchain infrastructure company, has announced the successful closure of its seed round, raising a total of $5.5 million USD. The round was co-led by Lemniscap and Lightspeed Faction, with participation from Brevan Howard Digital, Bankless Ventures, Animoca Ventures, DACM, LBK, SNZ and Canonical Crypto.\n\nThe funding will be leveraged to accelerate the development of Puffer's open-source Secure-Signer solution for the public good, and to create a capital-efficient permissionless staking pool.\n\nPuffer Finance Raises $5.5M Seed ­Funding to Strengthen Ethereum Decentralization & Scalability\n\nPuffer recognizes the inherent challenges validators face in the Ethereum Proof of Stake (PoS) network, particularly the risk of losing all of their staked ETH to slashing penalties resulting from software bugs or user errors. This carries significant risk for solo stakers without access to substantial amounts of ETH, discouraging small-scale participation and increasing the appeal of centralized services.\n\nPuffer's open-source project Secure-Signer is a remote signing tool designed to prevent Ethereum validators from committing slashable offenses, limiting access to validator keys in order to mitigate the effect of software bugs and user errors while simultaneously protecting them from costly penalties that disproportionately impact solo stakers. Secure-Signer previously received support from the Ethereum Foundation in the form of a $120k grant, underscoring its importance within the Ethereum ecosystem.\n\nAdditionally, Puffer Finance is actively working on a protocol to lower the barrier of entry for at-home stakers and to help them unlock additional rewards, providing a financially viable alternative to centralized Liquid Staking Providers (LSPs), whose economies of scale can otherwise provide greater rewards by addressing the issue of inactivity penalties and implementing innovative anti-slashing technology. The protocol will effectively reduce the bond requirement from 32 ETH to just 2 ETH.\n\nOther participants in Puffer's seed round include community funds such as 33DAO, WAGMI33, and Concave, as well as angel investors including DiscusFish, Co-founder of F2Pool & Cobo; Sreeram Kannan, Founder of Eigen layer; Frederick Allen, Staking Sales Lead at Coinbase Institutional; Calvin Liu, Head of Strategy at Eigen Layer; Ramble, Founder of the North American Blockchain Association; Mr.Block: Core Contributor at Curve; Ladislaus von Daniels, Staking Educator, Richard Malone, Head of Business at Obol Labs.\n\nPuffer's seed round follows an initial $650K raise in a pre-seed round led by Jump Crypto, and supported by IoTeX, Acanam Capital.\n\nCommenting on the announcement, Amir Forouzani, and Jason Vranek, Founders of Puffer Finance, said: \"The rapid advancements in infrastructure and user experience have primed Ethereum for mass adoption. As this era ushers in new centralization pressures, preserving Ethereum's core values becomes increasingly essential. We hope the Puffer Protocol will create a pocket within the validator set where decentralization can thrive. By lowering barriers to entry, anyone can run a Puffer Node from their home to operate Web3 infrastructure and play a pivotal role in shaping a Web3 that is resilient and censorship-resistant. We want to express our utmost gratitude to our investors for their trust, support, and partnership. Together and with our community, we will build a flourishing ecosystem true to the values that made Ethereum so special.\"\n\nJustin Drake, Researcher at the Ethereum Foundation, said: \"Validator operators should consider Puffer's SGX-based secure signer – at least until we get one-shot signatures. Zooming out, enclaves are a great way to incrementally improve security whenever pure cryptoeconomic defences fall short.\"\n\nRoderik van der Graaf, Founder of Lemniscap, said: \"The Puffer team is spearheading the development of sophisticated technological solutions geared towards reducing centralisation pressures on Ethereum. Puffer's proprietary Secure-Signer solution greatly mitigates operational risks associated with user errors and client bugs, providing best-in-class security for validators. The solution's low capital requirement of 2 ETH is a game changer in terms of broadening the accessibility of revenue streams for at-home stakers, encouraging new swathes of ecosystem participants to stake their claim in the burgeoning sector.\"\n\nSamuel Harrison, Managing Partner of Faction, said: \"Through software defined security, Puffer enables lower fees for users and higher ROI for node operators, whilst enabling a more decentralized and fragmented validator ecosystem. This advancement is beneficial for the entire space.\"\n\nAbout Puffer Finance\n\nPuffer is defining a new industry standard for secure validator operations with the primary objective of preserving decentralization, with Anti-Slashing technologies designed to minimize the chance of slashing events. The company's Secure-Aggregator technology provides the foundation to build a secure, scalable, and performant liquid staking protocol. Allowing permissionless and capital-efficient Node Operator (NoOp) participation allows anyone to join the PufferPool to help preserve Ethereum's decentralization.\n\nAbout Lemniscap\n\nLemniscap is an investment firm specializing in investments in emerging crypto assets and blockchain startups. Since its founding in 2017, Lemniscap has funded multiple investments in the crypto blockchain space, on the core belief that blockchain technology will upend traditional business models, resulting in profound changes in the world economy. The Lemniscap team consists of talented people with backgrounds in financial markets, PE/VC, technology and entrepreneurship. For more information, visit https://lemniscap.com/.\n\nAbout Lightspeed Faction\n\nFaction is a joint-venture with Lightspeed Venture Partners. We back disruptive crypto projects at the early stage. We invest in the best entrepreneurs at the Seed and Series A, across both equity and tokens. We look to partner with BUIDLers who are working on something fundamentally useful in blockchain and who are passionately pushing the industry forward. We invest across the stack (layer zero to applications) and sectors (DeFi to NFTs). Regardless of vertical or horizontal, our north star is always the same: great entrepreneurs creating real utility and pushing the frontier. For more information, visit https://www.faction.vc/\n\nMedia contact:\n\nmedia@puffer.fi\n\nPhoto - https://mma.prnewswire.com/media/2170815/PufferFinance.jpg\n\nSOURCE Puffer Finance"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vZGVjcnlwdC5jby8xNTE5NTkvZGVnb2RzLWRpdGNoLXBvbHlnb24tbW92aW5nLXkwMHRzLWV0aGVyZXVtLXJldHVybmluZy0zLW1pbGxpb24tZ3JhbnTSAWRodHRwczovL2RlY3J5cHQuY28vMTUxOTU5L2RlZ29kcy1kaXRjaC1wb2x5Z29uLW1vdmluZy15MDB0cy1ldGhlcmV1bS1yZXR1cm5pbmctMy1taWxsaW9uLWdyYW50P2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 09 Aug 2023 07:00:00 GMT",
        "title": "DeGods Ditch Polygon, Moving y00ts to Ethereum and Returning $3 Million Grant - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nDeLabs’ NFT profile picture (PFP) project y00ts has already made one migration, from Solana to Ethereum scaling network Polygon earlier this year—and it’s about to take another trip, migrating over to Ethereum mainnet to live alongside the startup’s more prominent DeGods collection.\n\nThe news was announced late Wednesday afternoon in the run-up to the reveal of DeGods' “Season 3” content. DeGods is a valuable PFP collection that also previously migrated over from Solana this past spring. DeLabs has yet to reveal a date for the migration, which was a surprise move given all of the buzz around the original shift away from Solana.\n\n“Polygon Labs has been a truly incredible partner for y00ts,” said DeLabs founder Rohun “Frank” Vora, in a press release. “But ultimately, we believe it makes the most sense for y00ts to be on the same chain as DeGods.”\n\nAD\n\nAD\n\n3. The migration date will be announced shortly. pic.twitter.com/5YVgyCg2cV — y00ts (@y00tsNFT) August 9, 2023\n\nPolygon Labs, a company that supports the development of the Polygon blockchain and projects built on it, had given DeLabs a $3 million grant as part of the agreement to move from Solana. The funds were going to be used to expand the DeLabs team, which had agreed to help incubate and support other Polygon projects.\n\nToday, DeLabs said that the entire grant will be returned to Polygon Labs as the project departs the Polygon ecosystem. Polygon Labs, for its part, said that $1 million of the returned funds will be put towards supporting “Polygon-native builders and creators,” with details to be revealed at a later date.\n\n“We tried our best to make it work, but we just need to bring our two communities together,” Frank added in a tweet. “I would appreciate it if everyone remains respectful of all parties involved. It’s all love.”\n\nIn a press release, Polygon co-founder Sandeep Nailwal pointed to what he says is significant growth for the Polygon PFP ecosystem, noting that DeLabs “played a huge role” in driving that.\n\nAD\n\nAD\n\n“We will continue to nurture this community that’s tripled in size this year by redeploying the y00ts funds,” said Nailwal, “and more to support our native creators and projects we believe have the vision and conviction to help evolve NFTs, both as an artform and as a key to boundless utility.”\n\nThe market has reacted positively to the news, apparently, with the floor price—or the price of the cheapest listed NFT in the project—on the OpenSea marketplace jumping from 1.7 ETH (about $3,150) earlier today to about 2.09 ETH ($3,880) shortly after the news broke, although it has settled slightly to about 2 ETH ($3,710).\n\nDeGods is one of the most valuable NFT projects on the market. According to data from NFT Price Floor, it’s the third-most valuable PFP project on the market for a collection with at least 10,000 pieces, at an entry price of 8.75 ETH—about $16,240 worth as of this writing."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vZGF0YWNvbm9teS5jb20vMjAyMy8wOC8wOC9ldGhlcmV1bS1hbmQtc21hcnQtY29udHJhY3RzLXVubGVhc2hpbmctdGhlLXBvd2VyLW9mLWRlY2VudHJhbGl6ZWQtYXBwbGljYXRpb25zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 08 Aug 2023 07:00:00 GMT",
        "title": "Ethereum And Smart Contracts: Unleashing The Power Of Decentralized Applications - Dataconomy",
        "content": "In the fast-paced world of blockchain technology, Ethereum has emerged as a groundbreaking platform that revolutionizes how we perceive decentralized applications (DApps).\n\nAt the core of this innovation lies the concept of smart contracts, enabling the trustless and automated execution of agreements. This article delves into the prowess of Ethereum, emphasizing its role in empowering DApps through smart contracts.\n\nUnderstanding Ethereum\n\nEthereum, introduced by Vitalik Buterin in 2015, is a decentralized, open-source blockchain platform that enables developers to build and deploy DApps. Unlike Bitcoin, Ethereum was designed to be more versatile, allowing not only the exchange of a native cryptocurrency, Ether (ETH) but also the creation of smart contracts. This fundamental difference sets Ethereum apart and forms the foundation for its widespread adoption.\n\nThe concept of smart contracts\n\nAt the heart of Ethereum’s disruptive potential lies the concept of smart contracts. Smart contracts are self-executing agreements with predefined rules and conditions that automatically trigger actions upon fulfillment.\n\nUtilizing blockchain technology makes these contracts immutable and transparent, eliminating the need for intermediaries. This feature has paved the way for various applications in finance, supply chain management, gaming, and more industries.\n\nUnleashing Decentralized Applications (DApps)\n\nDecentralized applications (DApps) are digital applications that operate on a decentralized network, providing users with enhanced security, privacy, and control over their data. Ethereum has emerged as a leading platform for DApps due to its robustness, flexibility, and large developer community.\n\nDApps built on Ethereum offer a wide array of advantages over traditional centralized applications, such as resistance to censorship, single points of failure, and increased transparency.\n\nBenefits of Ethereum for DApp developers\n\nEthereum provides numerous benefits for developers seeking to create innovative DApps. The blockchain’s security features and compatibility with various programming languages make it an attractive choice for developers worldwide. Ethereum’s active community fosters collaboration and knowledge-sharing, contributing to the growth of the entire ecosystem.\n\nReal-world use cases of Ethereum-based DApps\n\nThe advent of Ethereum has sparked a wave of transformative DApps in various sectors. One of the most notable applications is the rise of Decentralized Finance (DeFi) platforms. DeFi applications provide financial services like lending, borrowing, and yield farming, all governed by smart contracts, eliminating the need for traditional financial institutions. .\n\nNon-Fungible Tokens (NFTs) have gained immense popularity, allowing artists and gamers to tokenize digital assets, revolutionizing art ownership and in-game item trading.\n\nChallenges and limitations of Ethereum\n\nDespite its remarkable achievements, Ethereum faces several challenges. Scalability remains a pressing concern as the network struggles to handle many transactions, leading to high fees and slower processing times.\n\nMoreover, the energy consumption required for Ethereum’s Proof of Work (PoW) consensus mechanism has raised environmental concerns, mirroring the debates that arose during the bitcoin buyer.\n\nEthereum 2.0: The upgrade to overcome challenges\n\nEthereum has been undergoing a major upgrade to Ethereum 2.0 to address these issues. This transition introduces a Proof of Stake (PoS) consensus mechanism, significantly reducing energy consumption and improving scalability. Ethereum 2.0 aims to transform the blockchain into a faster, more secure, and more sustainable platform, enhancing the overall user experience.\n\nThe future of Ethereum and DApps\n\nAs Ethereum continues to evolve, its impact on DApps and decentralized technologies will likely expand further. With ongoing developments and improvements, Ethereum is positioning itself as a formidable force driving innovation across various industries. Its versatility and adaptability will play a pivotal role in shaping the future of blockchain technology.\n\nConclusion\n\nEthereum has undeniably unlocked the potential of DApps through the ingenious concept of smart contracts. Its impact on the blockchain industry is akin to the rise of the Bitcoin Era. By providing developers with a robust and versatile platform,\n\nEthereum has ushered in a new era of decentralized applications, fostering a paradigm shift in how we interact with digital services. As we continue to explore the possibilities of blockchain technology, Ethereum stands tall as a trailblazer, empowering the world with the power of decentralization.\n\nFeatured image credit: Zoltan Tasi/Unsplash"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vd3d3LmNvaW50cmlidW5lLmNvbS9lbi9jcnlwdG8tZXRoZXJldW0tbGVtcGlyZS1kdS1jeWJlcmNyaW1lLTIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 08 Aug 2023 07:00:00 GMT",
        "title": "Crypto: Ethereum, the empire of cybercrime - Cointribune EN",
        "content": "Tue 08 Aug 2023 ▪ 4 min of reading ▪ by Evans S.\n\nIn the crypto sector, Ethereum presents itself not as an idyllic asylum, but rather as an unsuspected empire of cybercrime. On this digital stage, an alarming manifestation of crime thrives, the titanic scale of which was recently unveiled by insightful researchers.\n\nThe proliferating shadow of cybercrime on Ethereum\n\nThe spectre of cybercrime is spreading in the shadow of the Ethereum network. While bitcoin remains the undisputed behemoth of the cryptosphere, Ethereum stands out for the complexity of its fraudulent activities, according to researchers.\n\nIts ability to host smart contracts offers a wider range of digital crimes. This characteristic transforms Ethereum into a veritable cybercrime empire.\n\nAccording to information extracted from blockchain explorers such as Etherscan, an alarming number of over 5,600 Ethereum addresses have been identified as being linked to cybercrime activities.\n\nWhat’s more, these findings find a powerful echo in the rigorous analyses carried out by Whale Alert’s ScamAlert. Together, these data reveal the frightening extent of cybercrime in the Ethereum ecosystem.\n\nThese tagged addresses traced over 1.78 million transactions from unsuspecting victims, totaling a staggering $1.65 billion in stolen funds. This figure is almost 16 times greater than self-reported losses to the FTC, revealing the severe extent to which crypto cybercrime is under-reported by regulators.\n\nThe many faces of cybercrime on Ethereum\n\nOn the throne of Ethereum crime, Ponzi schemes reign supreme. They account for 60% of stolen funds, far surpassing the scale of traditional financial Ponzi schemes. Fraudulent donations follow at 18%, followed by mining (13%) and hacking (5%).\n\nThe pseudonymity offered by blockchain has given Ponzi scams a mask of anonymity. This makes them harder to detect and crack down on.\n\nWhat’s more, the global reach of cryptocurrencies has widened the scope of these scams. As a result, crypto-Ponzi scams have become a ubiquitous and worrying threat to investors worldwide.\n\nBut the evil doesn’t stop there. New cybercrimes are emerging, specific to the cryptocurrency ecosystem. Rug pulls”, for example, lure investors into new projects only to abandon them abruptly, draining all liquidity. Phony token scams create worthless imitations of real coins to fool traders.\n\nRepercussions and the need for a shift in direction\n\nBeyond simple quantification, the researchers analyzed the impact of cybercrime on investor behavior.\n\nIn the short term, victims obtain higher returns by taking greater risks. But over the long term, their risk-adjusted returns significantly underperform those of non-victims.\n\nImproved consumer protection is urgently needed to safeguard mainstream investors as cryptocurrency adoption grows. Regulators must also step up their efforts to curb illicit crypto activity, before it seriously undermines confidence in blockchain technology as a whole.\n\nOnly increased diligence on the part of legislators and investors will enable decentralized finance innovation to continue to flourish. What’s more, Bitcoin’s spectacular spike to $150k during its halving could attract an influx of newcomers, unfortunately opening the door to a potential multiplication of scams. Stay safe!\n\nMaximize your Cointribune experience with our 'Read to Earn' program! Earn points for each article you read and gain access to exclusive rewards. Sign up now and start accruing benefits.\n\nClick here to join 'Read to Earn' and turn your passion for crypto into rewards!\n\nA A Lien copié"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vYmxvY2tvbm9taS5jb20vd2hhdC1kb2VzLXBheXBhbHMtc3RhYmxlY29pbi1vbi1ldGhlcmV1bS1tZWFuLWZvci1jcnlwdG8v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 09 Aug 2023 07:00:00 GMT",
        "title": "What Does PayPal's Stablecoin on Ethereum Mean for Crypto? - Blockonomi",
        "content": "PayPal has long been interested in the evolving crypto landscape, but with its recent stablecoin announcement, the payments giant is taking its involvement to the next level.\n\nPayPal, one of the world’s largest online payment systems, has introduced its own stablecoin, called PayPal USD (PYUSD). The ERC-20 stablecoin will be pegged by the “dollar deposits, US treasuries, and cash equivalents.” Upon the rollout, PYUSD is set to launch on Ethereum and is worth $1.\n\nPayPal’s Stablecoin Could be Huge\n\nThe stablecoin is a collaborative effort of PayPal and Paxos to revolutionize the digital payment landscape and Web3. According to PayPal, it is designed to be compatible with popular exchanges, Web3 apps, and wallets.\n\nUsers can register for the initial $PYUSD distribution by connecting their crypto wallets, such as MetaMask, Ronin Wallet, Coinbase, and Ledger Live.\n\nUsers can buy, sell, send, and receive PayPal USD in the app or on the website with zero transaction fee. PayPal also enables customers to convert the stablecoin into other cryptos for a fee.\n\nIn the initial phase, buying, selling, holding, and transferring PYUSD are accessible exclusively to eligible US PayPal Balance accounts. But there are plans to extend its remittance support to the Venmo app in the near future.\n\nThe introduction of PYUSD is projected to boost its appeal within the cryptocurrency and Web3 sectors, with functionalities like facilitating shopping and crypto token trading. The long-term vision for PYUSD, as expressed by PayPal CEO Dan Schulman in a conversation with Bloomberg, is for it to become an integral part of the broader payments infrastructure.\n\nSchulman is confident that PYUSD will further solidify PayPal’s market dominance in the electronic payments realm by offering users a speedy blockchain-based transfer option that bypasses intermediaries. This ambitious initiative by PayPal and Paxos is poised to shape the future of financial transactions and foster greater convenience for users in the digital age.\n\nPaxos and PayPal announced their partnership in 2020. Back at that time, the two entities reportedly aimed to build innovative crypto products. It appears that the issuance of PayPal’s stablecoin is part of the collaborative efforts.\n\nAccording to the original plan, the stablecoin was set to launch in February 2023. However, the project faced hurdles and delays due to Paxos’ run-ins with U.S. authorities.\n\nPrior to PayPal USD, Paxos is widely known as an issuer of another stablecoin – Binance USD (BUSD). However, this stablecoin and the company fell under the radar of the U.S. Securities and Exchange Commission.\n\nOn February 13, 2023, Wall Street Journal reported that the SEC was prepared to sue Paxos for issuing an unregistered security, in that case, BUSD.\n\nIn response to the allegations, Paxos issued a statement to voice disagreement with the SEC. The firm clarified that BUSD was not a security under federal securities laws and segregated from one another and in bankruptcy-protected bank accounts.\n\nCentralization Concern\n\nThe news that PayPal would launch a stablecoin was first revealed on August 7, 2023, on the company’s official Twitter account.\n\nThe announcement quickly drew a lot of attention from the crypto community, with some people expressing excitement about the potential for the move to boost crypto adoption, while others expressed concerns about the centralization of the project.\n\nThose who favor PayPal’s move argue that it will make it easier for people to buy and use cryptocurrencies.\n\nPayPal has a large user base and that the company’s integration with the traditional financial system will make it easier for people to convert their fiat currency into cryptocurrencies and vice versa. Some also argue that the launch of a PayPal-backed stablecoin will help to legitimize cryptocurrencies and make them more attractive to mainstream investors.\n\nOn the other hand, some people have expressed concerns about the centralization of the project. They argue that PayPal is a centralized entity and that the company’s control over the stablecoin could pose a risk to its users."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vZmluYm9sZC5jb20vNS1mYWN0b3JzLXRoYXQtY291bGQtc2VuZC1ldGhlcmV1bS10by01MDAwL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 08 Aug 2023 07:00:00 GMT",
        "title": "5 factors that could send Ethereum to $5,000 - Finbold - Finance in Bold",
        "content": "With the majority of the cryptocurrency market dragging its feet in recent weeks, it is no surprise that its second-largest asset by market cap, Ethereum (ETH), is doing the same. However, the hope remains it could hit the high price level of $5,000 sometime in the future.\n\nAs it happens, Ethereum managed to get close to this mark on November 9, 2021, when it reached its all-time high (ATH) of $4,815.01, climbing by 168.25% from the $1,794.97 where it stood on July 21, 2021, which is close to its price at present and suggests a very real possibility of repeating this success.\n\nWith this in mind, Finbold has analyzed the main factors that could (but do not necessarily have to) lead Ethereum closer to the $5,000 price level and eventually overtake it – either by themselves or together with other influences.\n\nMass adoption of Ethereum-based applications\n\nWith Ethereum being the most popular blockchain choice to build a wide range of decentralized applications (dApps) on, such as in the sector of decentralized finance (DeFi), non-fungible tokens (NFTs), and gaming, it could help its cryptocurrency grow further in price, thanks to the growing demand.\n\nFor instance, one of the major companies building on the Ethereum blockchain is PayPal (NASDAQ: PYPL), which has recently announced the launch of its own ERC-20 United States dollar-pegged stablecoin PayPal USD (PYUSD), issued by crypto firm Paxos Trust Company, as Finbold reported on August 7.\n\nImproved scalability\n\nWith the launch of the better-performing, more accessible ‘Ethereum 2.0,’ the network has improved its scalability, helping it handle more transactions per second and making it more attractive to users and developers. If this trend continues, it could lead to growing demand for Ethereum and its higher price.\n\nIndeed, the Ethereum development team has been working hard on boosting the network’s usability, the work that also brought a shift from the proof-of-work (PoW) to the proof-of-stake (PoS) model with an aim to reduce energy waste and transaction times, as well as improve scalability.\n\nInstitutional adoption\n\nOn top of that, more institutional investors recognizing Ethereum’s potential and buying more ETH could drive the price higher simply by following the rules of supply and demand – the more desirable an asset is, the higher its price, and institutions can have the power to contribute in shaping market trends.\n\nFurthermore, Ethereum’s advance could also happen under the influence of the Tesla (NASDAQ: TSLA) and X (formerly Twitter) CEO, Elon Musk, supporting the bold prediction on the future of the crypto market that could see both Ethereum and Bitcoin (BTC) surge massively.\n\nRegulatory environment\n\nAmid increased regulatory pressure, particularly in the US, which has culminated in multiple lawsuits against some of the industry’s largest representatives, the cryptocurrency market as a whole can feel its effects, which is why positive regulatory developments and favorable regulations for digital assets could help drive their prices, including Ethereum.\n\nOne example of such positive developments is the refusal of the British financial services minister, Andrew Griffith, to agree with the Treasury Committee’s recommendation to regulate retail trading and investing in unbacked crypto assets as gambling in late July and his support of their treatment as other financial services.\n\nMarket sentiment\n\nFinally, the atmosphere in the wider crypto and macroeconomic landscape can often influence the price of particular assets, including cryptocurrencies like Ethereum, for instance, with positive (or negative) developments and news coverage about the industry.\n\nIndeed, the above factors could contribute to the bullish sentiment, and when people are feeling bullish about digital assets in general, they are more likely to invest in them, and the positive sentiment could affect the price of ETH, which is more likely to increase.\n\nEthereum price analysis\n\nMeanwhile, Ethereum was at press time changing hands at the price of $1,828.2, the same as the day before, in addition to losing 0.29% in the last week and declining 2.05% on its monthly chart, as per the latest information retrieved on August 8.\n\nEthereum 7-day price chart. Source: Finbold\n\nIn conclusion, time will tell if the above factors are truly powerful enough to push the price of Ethereum toward $5,000. But one thing is for certain – they could, indeed, contribute to its strengthening and, in time, possibly reaching this coveted price level.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOC8wOS9hbmFseXRpY3MtZmlybS1yZXZlYWxzLW1hc3NpdmUtaW1iYWxhbmNlLWluLXdlYWx0aC1kaXN0cmlidXRpb24tYW1vbmctZXRoZXJldW0tYW5kLWRvZ2Vjb2luLWhvbGRlcnMv0gGJAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA4LzA5L2FuYWx5dGljcy1maXJtLXJldmVhbHMtbWFzc2l2ZS1pbWJhbGFuY2UtaW4td2VhbHRoLWRpc3RyaWJ1dGlvbi1hbW9uZy1ldGhlcmV1bS1hbmQtZG9nZWNvaW4taG9sZGVycy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 09 Aug 2023 07:00:00 GMT",
        "title": "Analytics Firm Reveals Massive Imbalance in Wealth Distribution Among Ethereum and Dogecoin Holders - The Daily Hodl",
        "content": "New data from IntoTheBlock suggests there exists a huge imbalance in the distribution of wealth for the Ethereum (ETH) and Dogecoin (DOGE) ecosystems.\n\nThe firm says that about 80% of the supply of both ETH and DOGE are owned by just about 0.01% of the total addresses holding the tokens.\n\nBy comparison, 0.32% of Bitcoin (BTC) addresses own 80% of the BTC supply, according to IntoTheBlock.\n\n“Ever wondered about the distribution of wealth in different cryptocurrencies? Here’s a snapshot:\n\nBitcoin: ~80% owned by 0.32% of addresses, including Satoshi’s wallets.\n\nDogecoin: ~80% held by a mere 0.014% of addresses.\n\nEthereum: ~80% in the hands of just over 0.01%, closely resembling DOGE’s pattern.\n\nThese stats are important to consider when planning your strategy, especially when dealing with assets that have a smaller market cap and/or liquidity.”\n\nThe firm warns that when just a few addresses have a huge amount of a blockchain project’s tokens those holders can have an outsized influence on that crypto project’s ecosystem.\n\nIntoTheBlock also looks more closely at the disbursement of Bitcoin across holding wallets.\n\n“We offer a comprehensive holder composition matrix for all assets listed on our platform. Analyzing the supply concentration is essential in assessing the potential dominance of large holders within a network.”\n\nAccording to the firm’s chart, just four addresses have more than 100,000 Bitcoin in their wallets for a combined 660,000 BTC, worth about $19.3 billion at time of writing. That sum represents about 3.39% of the total BTC supply.\n\nAt the other end of the spectrum, about 52% of total BTC addresses, or about 25.13 million, own up to 0.001 BTC for a total of 5,120 Bitcoin, which have a combined value of $149.3 million and are about 0.03% of the total supply.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wOC8wOC9wYXlwYWxzLW5ldy1zdGFibGVjb2luLWFuZC10aGUtMi13b2x2ZXMtaW5zaWRlLWNyeXB0by_SAXFodHRwczovL3d3dy5jb2luZGVzay5jb20vY29uc2Vuc3VzLW1hZ2F6aW5lLzIwMjMvMDgvMDgvcGF5cGFscy1uZXctc3RhYmxlY29pbi1hbmQtdGhlLTItd29sdmVzLWluc2lkZS1jcnlwdG8vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 08 Aug 2023 07:00:00 GMT",
        "title": "PayPal’s New Stablecoin and the ‘2 Wolves’ Inside Crypto - CoinDesk",
        "content": "But it is interesting to imagine exactly what Web3 would look like if a company like PayPal was a major crypto services provider, or even what the company’s own vision for Web3 in five years will be. There is little doubt that PayPal will have to abide by U.S. sanctions, develop lengthy blacklists and use automated software to (sometimes erroneously) freeze accounts; that it will likely have underpaid comms people doing its crypto customer service. More people will be in crypto, but like the internet after the “Eternal September” that brought a critical mass of people online (and necessitated the need for digital-first payments options like PayPal), crypto may become unrecognizable to today’s users."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vZGVjcnlwdC5jby8xNTE4NzAvY29pbmJhc2UtZXRoZXJldW0tbDItbGF1bmNoZXMtbWFpbm5ldC13aXRoLTE0Mm0tYWxyZWFkeS1vbi1pdHMtbmV0d29ya9IBZmh0dHBzOi8vZGVjcnlwdC5jby8xNTE4NzAvY29pbmJhc2UtZXRoZXJldW0tbDItbGF1bmNoZXMtbWFpbm5ldC13aXRoLTE0Mm0tYWxyZWFkeS1vbi1pdHMtbmV0d29yaz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 09 Aug 2023 07:00:00 GMT",
        "title": "Coinbase Ethereum L2 Launches Mainnet With $142M Already on Its Network - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCoinbase has launched the mainnet for Base, its Ethereum layer-2 network, as part of its bid to spur the development of millions of new decentralized apps.\n\nAfter months in development, Coinbase is launching its Base through a month-long launch event called Onchain Summer. Since it was announced last week, the enthusiasm around Base has been strong with just over $142 million in total value locked in the ecosystem, an almost 52% increase in total value locked from the week leading up to the launch, according to Dune Analytics.\n\n\"I think it's incredibly exciting that there's been so much energy and appetite for folks to come and use Base, even before we publicly launched,\" said Jesse Pollak, Coinbase’s senior director of engineering, in an interview with Decrypt.\n\nAD\n\nAD\n\nPollak characterized Base's launch as part of a more ambitious plan of bringing millions of more users on-chain, and doing that means showcasing more of what can be done with the technology than just focusing around cryptocurrencies.\n\nPart of this effort is being demonstrated with the more than 100 decentralized apps (dapp) that will be available with Base’s launch, a portion of which were created by developers who received early access to the blockchain last month.\n\nUnlike other layer-2 networks, like Arbitrum and Optimism, Pollak insists that Coinbase has no plans to introduce any native tokens to Base. He said tokens \"distort\" what is being done on a network, something Coinbase would rather avoid in favor of focusing on incubating developers.\n\n\"We want folks to see Base as kind of an opportunity for growth and expansion,\" explained Pollak. \"But we also think it's really important that we incubate, and curate a Base native community where folks who are really building base first, and creating for this new kind of world.\"\n\nBy not issuing a token, Coinbase may also be avoiding a regulatory minefield at a time when it is already facing serious legal pressure. On June 6, Coinbase was sued by the Securities and Exchange Commission for allegedly operating as an unlicensed securities exchange. The agency also accused Coinbase of dealing in unregistered securities, among which it said were popular tokens like Solana, Polygon and Cardano.\n\nAD\n\nAD\n\nPollak said the SEC's lawsuit is unlikely to derail work on Base, because it is aimed at areas of Coinbase’s business that are not directly related to the ecosystem that it is trying to foster.\n\n\"That pursuit is something that is pretty separate and distinct from the questions that the SEC is asking around tokens and regulating them,\" said Pollak, adding that Coinbase has been \"really encouraged\" by recent legislative and judicial changes around crypto regulation that he hopes will mean clearer regulatory clarity is forthcoming."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3doZW4taXMtZWlwLTQ4NDQtYW5kLXdoeS1pcy1pdC1jb25zaWRlcmVkLXRoZS1iaWdnZXN0LWdhbWUtY2hhbmdlci1mb3ItZXRoZXJldW0tMjAyMzA4MDgwODU00gGPAWh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9hbXAvY3J5cHRvY3VycmVuY2llcy9uZXdzL3doZW4taXMtZWlwLTQ4NDQtYW5kLXdoeS1pcy1pdC1jb25zaWRlcmVkLXRoZS1iaWdnZXN0LWdhbWUtY2hhbmdlci1mb3ItZXRoZXJldW0tMjAyMzA4MDgwODU0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 08 Aug 2023 07:00:00 GMT",
        "title": "When is EIP-4844, and why is it considered the biggest game changer for Ethereum? - FXStreet",
        "content": "Share:\n\nEthereum protocol’s proposed upgrade EIP-4844 is expected to go live in Q4 2023.\n\nEIP-4844 is known as proto-danksharding, its objective is to reduce fees by introducing a new transaction type.\n\nEthereum developers tried to reduce transaction fees through the past few upgrades.\n\nEIP-4844, Ethereum blockchain’s proposed upgrade, is lined up for Q4 2023. Its primary feature is called proto-danksharding. Proto-danksharding has two key objectives for the Ethereum blockchain:\n\nReducing transaction fees\n\nIncreasing transaction throughput\n\nThe Ethereum Improvement Proposal (EIP) aims to achieve these objectives through the introduction of “blobs” of data, a new transaction type on the ETH blockchain.\n\nAlso read: Ethereum buying spree likely in August as DAI whale holdings climb higher\n\nWhat are EIPs and why are they important?\n\nEIPs specify new features or processes that improve the Ethereum blockchain. The proposal defines technical specifications, and they are considered key for the community of developers to propose, debate and adapt changes to continuously improve the ETH blockchain.\n\nEIPs are a vehicle of governance on the Ethereum blockchain. While anyone is free to propose an improvement, stakeholders in the community determine if it should be adopted or included in a network upgrade.\n\nThe Ethereum blockchain has faced a key challenge since its launch – the spike in transaction fees on the network. To address this issue, several solutions and EIPs have been proposed. EIP-4844 or proto-danksharding is set to address this as one of its key objectives.\n\nWhat is EIP-4844?\n\nEIP-4844, better known as proto-danksharding, is named after Ethereum researchers Proto Lambda and Dankrad Feist.\n\nSharding is another name for partitioning a database into smaller data segments. In simple terms, it's like cutting a pizza into slices. A pizza can be consumed more effectively and with higher efficiency when cut into slices, and the same can be applied to specific data segments.\n\nThere are several unique features in addition to segmenting data. While the Ethereum base layer processes around 15 TPS and layer 2 rollups take the number to 100, danksharding is predicted to eventually increase Ethereum’s throughput to 100,000.\n\nThe Ethereum blockchain is headed in the direction of a full “danksharding,” and EIP-4844 is the first step. It would increase the throughput from 100 to 1,000. While it is scheduled to occur in Q4 2023, delays are anticipated.\n\nEIP-4844 is considered a game changer for this reason\n\nEIP-4844 introduces blob-carrying transactions. These are similar to regular transactions with added pieces of information. Ethereum contributor Ben Edgington has summarized EIP-4844 as an improvement that “bolts blobs onto blocks.”\n\nIn the first look it may be perceived as an increase in blocksize, which is counterintuitive to increasing efficiency. However, blobspace is different from blockspace, and blobs are not visible to the Ethereum Virtual Machine. They do not occupy space on the base layer of the blockchain. Blobs are visible for a short period of time, and the space occupied by them is relatively cheaper when compared to blocks.\n\nThe scaling and cost-saving benefits of sharding comes from EIP-4844, making it a game changer improvement for the Ethereum blockchain.\n\nThe Ethereum blockchain’s future roadmap is centered on “rollups,” and EIP-4844 is a part of the same. Users will experience the difference post implementation of EIP-4844, as ETH transactions become faster and fees become relatively cheaper. This is likely to boost the competitiveness of the Ethereum blockchain."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZGVjcnlwdC5jby8xNTE5Mjcvdml0YWxpay1idXRlcmluLXNhbS1iYW5rbWFuLWZyaWVkLWFpLWhvbGx5d29vZNIBTmh0dHBzOi8vZGVjcnlwdC5jby8xNTE5Mjcvdml0YWxpay1idXRlcmluLXNhbS1iYW5rbWFuLWZyaWVkLWFpLWhvbGx5d29vZD9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 09 Aug 2023 07:00:00 GMT",
        "title": "Ethereum's Vitalik Buterin: Crypto Community Never Really Respected Sam Bankman-Fried - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum co-founder Vitalik Buterin said the crypto community had reservations about Sam Bankman-Fried and FTX from the beginning, despite Bankman-Fried's high profile in the mainstream media as an industry leader.\n\n\"I think a lot of people have this misconception that everybody deeply respected Sam and that he caught the entire ecosystem by surprise,\" Buterin said in a podcast interview with Sriram Krishnan and Aarthi Ramamurthy. “I think it is true that nobody expected a literal $8 billion blow up, but if you're looking at Ethereum influencers like Anthony Sassano, a lot of them disrespected him and FTX from the beginning.\"\n\nKrishnan and Aarthi interview founders, CEOs, and film makers on their eponymous podcast, which featured Buterin last month.\n\nAD\n\nAD\n\nButerin went on to explain that many in the crypto ecosystem were suspicious of Bankman-Fried because he seemed unable to articulate a coherent vision for why cryptocurrency technology was valuable.\n\n\"He was just not able to articulate a vision of why crypto was good—he just clearly saw it as purely a business opportunity,\" Buterin recalled. \"It's like, 'Oh, hey, crypto is this thing where you can make money.'\"\n\nButerin contrasted Bankman-Fried's outlook with the cypherpunk values and decentralization goals that initially animated Bitcoin, Ethereum and other blockchain projects, saying the disgraced entrepreneur was just \"regurgitating other people's perspectives of 'disintermediation is good, creating more open markets is good'—things that have been said by influencers for years.\"\n\n\"He just, I think, never really struck the community as a person who deeply believed it,\" he said. \"That more than anything else might really be the cause of the mistrust that existed already.\"\n\nThe Ethereum founder also touched on the rapid progress of artificial intelligence systems like ChatGPT, expressing optimism about their potential to augment human creativity rather than fully replace human jobs and talents.\n\nAD\n\nAD\n\n\"I think one of the positive aspects of this is that I think it's a good example of how, instead of AI killing 30% of the jobs, which would be catastrophic and terrible, it's like, AI is killing 30% of your job, which is like actually an amazing time saver,\" Buterin said.\n\nHe acknowledged that more jobs will be lost as AI approaches full human capabilities, but that for now, AI is something to be embraced.\n\n\"At this stage one, the last section of the sprint's to human level AI, that aspect of things is interesting—it's empowering people with more than replacing people, at least so far,\" Buterin said.\n\nHe also suggested that powerful AI tools like image generators could help individual creators make films and other artistic works without the need for an expensive Hollywood-style production.\n\n\"The thing happening that we don't want to see is artists getting replaced; the thing that I wants to see is an author, instead of just being able to write a novel, also being able to personally make a movie,\" Buterin said. \"I would want to see the cost of making a movie go down from $100,000 to one person with basically just his creativity and a couple of months with an AI platform.\"\n\nIn his view, disrupting Hollywood would be a good thing.\n\n\"We get away from all of these horrible remixes, like, Marvel fights King Kong with a touch of Star Trek versus Star Wars on the side, \" he said. \"Get to actual real stories reflecting different people's values.\"\n\n\"That enhancement of existing individual creativity, that excites me,\" Buterin told his hosts.\n\nAD\n\nAD\n\nIndeed, the Ethereum founder positioned AI as one of the most significant developments in all of history.\n\n\"This human to superhuman AI transition, that level of transition, I would argue has only happened basically three or four times in the history of the Earth,\" he said.\n\nBut Buterin also acknowledged the need for more research and potentially some limited regulation around advanced AI to address possible risks down the line. He emphasized that any rules should be narrowly targeted rather than sweeping bans that would hinder innovation.\n\n\"I see these really compelling arguments from the AI risk people. But then, like, we have a yet a long, multi 100 year history of people predicting all kinds of really awful consequences to the next wave of technology. What's happened, over and over again, for centuries, is we adapt.\"\n\nEditor’s note: This article was written with the assistance of AI. Edited and fact-checked by Ryan Ozawa."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vdW5jaGFpbmVkY3J5cHRvLmNvbS9wYXlwYWwtbGF1bmNoZXMtcHl1c2Qtc3RhYmxlY29pbi1idWlsdC1vbi1ldGhlcmV1bS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 08 Aug 2023 07:00:00 GMT",
        "title": "PayPal Launches PYUSD Stablecoin Built on Ethereum - Unchained - Unchained",
        "content": "The U.S. dollar-pegged stablecoin will be issued by Paxos Trust and backed by dollar deposits, short-term Treasury bills and similar assets.\n\nPayments giant PayPal announced on Monday the launch of a new stablecoin, dubbed PayPal USD (PYUSD), built on the Ethereum blockchain.\n\nThis is the Ethereum contract address for PayPal's stablecoin. I can't believe i get to tweet that. We've come so far. pic.twitter.com/S6kSqcV4ut — RYAN SΞAN ADAMS – rsa.eth (@RyanSAdams) August 7, 2023\n\nThe stablecoin will be pegged to the value of the U.S. dollar and will be fully backed by U.S. dollar deposits, short term Treasuries and similar cash equivalents.\n\n“The shift toward digital currencies requires a stable instrument that is both digitally native and easily connected to fiat currency like the U.S. dollar,” said Dan Schulman, president and CEO of PayPal in a statement.\n\nPYUSD utilizes Ethereum’s ERC-20 token standard and can be exchanged for other cryptocurrencies on PayPal. The stablecoin will be issued by Paxos Trust, which is subject to regulatory oversight by the New York State Department of Financial Services (NYDFS).\n\nPayPal, which has more than 430 million active users, first offered users the ability to trade cryptocurrencies like Bitcoin, Ethereum, Bitcoin Cash and Litecoin through its platform in 2020. However, the company had put its plans to bring its own stablecoin to market on hold earlier this year, after the NYDFS began a probe into Paxos.\n\n“This announcement is a clear signal that stablecoins – if issued under a clear regulatory framework – hold promise as a pillar of our 21st century payments system,” commented U.S. House Committee on Financial Services Patrick McHenry.\n\nMeanwhile, blockchain proponents believe that the development is a step in the right direction for the wider crypto industry on its path towards more mainstream adoption.\n\n“Ethereum is slowly but surely becoming a global settlement layer for all types of value,” tweeted Ethereum advocate Anthony Sassano.\n\nSassano also addressed several criticisms raised by smart contract auditors, who took issue with some of the design choices in PYUSD’s smart contract which comes with functions that allow for wiping a user’s entire balance.\n\nThe new Paypal USD stablecoin has an \"assetProtection\" role which can wipe your balance in two transactions (first `freeze`, then `wipeFrozenAddress`) In smart contract security we call this a \"centralisation attack vector\" pic.twitter.com/RsmqvsnKvi — pashov (@pashovkrum) August 7, 2023\n\n“Yes, PayPal’s stablecoin is centralized. No, that doesn’t make it any less cool that PayPal has a stablecoin. Ethereum being a settlement layer for all types of value means that different types of assets will exist on the network & you get to choose which ones you want to use,” said Sassano."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy91c2RjLWlzc3Vlci1jaXJjbGUtbGF1bmNoZXMtbXBjLXdhbGxldC1iZXRhLWV0aGVyZXVtLXBvbHlnb24tYXZhbGFuY2hl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 08 Aug 2023 07:00:00 GMT",
        "title": "USDC issuer Circle launches MPC wallet beta for Ethereum, Polygon, Avalanche - Cointelegraph",
        "content": "USD Coin (USDC) issuer Circle has released a beta version of a multiparty computation (MPC) wallet service, according to an Aug. 8 announcement. The new service will allow developers of decentralized finance (DeFi) apps, Web3 video games, e-commerce services and other blockchain applications to create customized wallets specifically for their users. It will be available initially on Ethereum, Avalanche and Polygon.\n\nBuilding crypto apps is still too hard. Plus, less than 0.5% of the 100 million developers worldwide are actively building crypto apps today.\n\n\n\nThis needs to change. Our new wallet-as-a-service developer platform is a huge step in that regard. Check it out https://t.co/ku9LTz8Z97 — Patrick Hansen (@paddi_hansen) August 8, 2023\n\nMPC wallets are secured by splitting a user’s private key into multiple shards and distributing them through a decentralized network. It’s a new wallet technology many Web3 developers have been using. MPC wallets can be accessed via an application programming interface, giving them a “Web2 feel” that some developers and users prefer.\n\nAccording to an explanatory blog post from Circle, the new service will allow developers to “choose the best wallet security and control configurations.” For example, some developers may want to host their own MPC nodes to ensure they are not completely reliant on Circle, while others may want to choose the simpler method of connecting to Circle’s nodes. Developers can also choose to “share transaction signing responsibilities with the users,” allowing them to recover keys if users lose them, or they can make the product noncustodial by requiring users to sign every transaction.\n\nAccording to Circle co-founder and CEO Jeremy Allaire, the new service is essential in promoting the use of USDC:\n\n“Circle’s Programmable Wallets is part of a new, core pillar of our strategy to advance global, mainstream utility and adoption of digital assets like USDC and public blockchain-based payments. This new platform marks the first step for Circle’s Web3 services as we work to ease common pain points for developers.”\n\nMPC wallets have faced controversy, with the widely used Multichain MPC bridge hacked on July 7, causing investors to lose over $100 million. The Multichain team later admitted that all MPC shards had been stored on a cloud server under the control of the CEO.\n\nIn an emailed statement to Cointelegraph, Circle’s senior director of product management, Gagan Mac, claimed that the new service “is built and maintained in-house and doesn’t leverage external vendors,” implying that third-party cloud storage systems will not be used. In addition, Gagan stated that “some developers and enterprises may prefer to host an MPC node,” which they will be allowed to do if they wish. Multichain did not allow partners to host their own nodes.\n\nCircle recently stated that the demand for euro-based stablecoins is heating up and also argued that a yuan stablecoin would be better than a Chinese central bank digital currency."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vYW1iY3J5cHRvLmNvbS93aHktYW4tZXRoZXJldW0tZXRmLWNvdWxkLWJlLW9uLXRoZS1jYXJkcy_SAURodHRwczovL2FtYmNyeXB0by5jb20vd2h5LWFuLWV0aGVyZXVtLWV0Zi1jb3VsZC1iZS1vbi10aGUtY2FyZHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 09 Aug 2023 07:00:00 GMT",
        "title": "Why an Ethereum ETF could be on the cards - AMBCrypto News",
        "content": "The launch of PYUSD had little to no impact on the market.\n\nAnalysts opined that regulators would approve several Ethereum futures ETFs.\n\nThis year, the evolution of the cryptocurrency market has been marked by various milestones. First, it was the approval of a leveraged Bitcoin [BTC] Exchange Traded Fund (ETF). Now, payment giant PayPal has confirmed the integration of stablecoins into its platform with the launch of PayPal USD [PYUSD].\n\nRealistic or not, here’s ETH’s market cap in BTC’s terms\n\nThe success of these developments signaled the growing acceptance of cryptocurrencies in mainstream finance. For a while, the ecosystem has been evolving and converging with traditional financial systems.\n\nBut the question on many minds now is whether the regulatory landscape and market demand are aligning to pave the way for co-participation in the traditional and blockchain sectors. Could an Ethereum [ETH] ETF be the next logical step?\n\nPYUSD fails to impact the market\n\nAs of this period, the crypto market had slipped a bit from the highs registered in Q1. Fortunately, the development would prove to have a positive impact on BTC’s price and the broader market.\n\nBeyond the approved leveraged ETFs, the U.S. SEC could also be in line to approve multiple Bitcoin Spot ETFs, according to Cathie Wood.\n\nWood, the CEO of asset management firm ARK Invest, said in an interview with Bloomberg on 7 August,\n\n“I think the SEC, if it’s going to approve a Bitcoin ETF, will approve more than one at once.”\n\nHowever, the launch of PYUSD did not follow a similar market reaction to ETF acceptance. Over the last 24 hours, prices of many cryptocurrencies have either remained the same or hovered around the same point.\n\nA good day for stablecoins?\n\nOne reason for this neutrality could be the fact that stablecoins generally have a 1:1 peg to the U.S. dollar. Besides the fact that these assets are not as volatile as their other counterparts, the stablecoin market has been prone to sudden changes and challenges.\n\nFor instance, the market cap of Circle [USDC] fell as a result of the challenges banks faced by U.S. bank sometime banks. Binance USD [BUSD], on the other hand, has been increasingly decreasing as per market cap since regulators ordered a stop to its minting.\n\nThe challenges faced by these stablecoins have helped Tether [USDT] extend its dominance in the market. It also gave rise to the attention TrueUSD [TUSD] gained.\n\nAMBCrypto spoke to Harman Singh, Director at Cyphere, a security firm whose mission is to protect the digital assets of investors in the UK and the U.S. about the matter. Singh opined that PYUSD was a good move for the ecosystem, noting,\n\n“This move could also encourage other major companies to follow suit, consequently driving further growth and acceptance of digital currencies. Additionally, the introduction of a PayPal stablecoin could enhance the usability and accessibility of cryptocurrencies for everyday transactions.”\n\nMeanwhile, the introduction of PYUSD has led to the launch of several imposters on several chains. Typically, degenerates in the ecosystem are known to deploy new tokens based on trending narratives.\n\nAnd according to information from DEX Screener, chains including Ethereum, BNB Chain, and Coinbase’s L2 Base have not been left out. For example, the PYUSD/WETH pair on the Ethereum blockchain rallied as much as 22,237% 18 hours after launch with a 24-hour volume of $2.9 million.\n\nOpening the way for Ethereum ETF approval\n\nAway from Ponzis and memes, there has been speculation that the PYUSD deployment could give way to the approval of Ethereum futures ETF. One reason this speculation thrived was that PayPal decided to launch PYUSD as an ERC-20 token.\n\nAnd a few days back, Bloomberg Intelligence analysts James Seyffart and Eric Balchunas confirmed that there have been about 12 different futures ETF applications. The duo also opined that the applications have a 75% chance of approval.\n\nHow much are 1,10,100 ETHs worth today?\n\nBut when asked about the chance of an Ethereum spot ETF, Seyffart said it could take some time. He said,\n\n“Time will tell. But if we get spot Bitcoin ETFs AND Ether futures ETFs, it would only be a matter of time before spot Ether. Absolute utter soonest would be ~260 days from Eth futures launch if i had to guess. All becomes irrelevant if spot btc dont launch or eth futures dont launch or if SEC files a suit somewhere claiming ETH to be a security. There are A LOT of ‘ifs’”\n\nSingh also commented on the Bitcoin and Ethereum ETF applications. Accoridng to him, the approval of the ETFs could foster increased institutional demand for both cryptocurrencies. He said,"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA4LzA4L2Jsb29tYmVyZy1hbmFseXN0LXByZWRpY3RzLW1hc3MtZGllLW9mZi1vZi16b21iaWUtZXRoZXJldW0tZXRoLWNvbXBldGl0b3JzL9IBcGh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA4LzA4L2Jsb29tYmVyZy1hbmFseXN0LXByZWRpY3RzLW1hc3MtZGllLW9mZi1vZi16b21iaWUtZXRoZXJldW0tZXRoLWNvbXBldGl0b3JzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 08 Aug 2023 07:00:00 GMT",
        "title": "Bloomberg Analyst Predicts Mass Die-Off of ‘Zombie’ Ethereum (ETH) Competitors - The Daily Hodl",
        "content": "Bloomberg Intelligence’s crypto market analyst Jamie Coutts is warning that Ethereum (ETH) competitors may soon fizzle out.\n\nCoutts tells his 5,938 X followers that ETH competitors put up abysmal second-quarter financials this year, which he says indicates these projects are likely doomed.\n\nAccording to Coutts, there are similarities between “zombie” companies traded on the stock market and layer-1 blockchain projects that are seeing their demand plummet.\n\n“The alternative L1 (layer-1) blockchain landscape reminds me of zombie companies (EBIT [earnings before interest and taxes] > Interest Expense) in the fiat world. I don’t see how crypto avoids a massive die-off in the not-too-distant future.\n\nInsufficient demand (fees) + high inflation = negative profitability.”\n\nAccording to his chart, Ethereum’s network pulled in more than $500 million in profits in the second quarter of 2023, while other layer-1 projects saw a decline of more than $1.5 billion.\n\nCoutts says that “zombie” companies and layer-1 projects can attract investor interest for their potential. But he says with the Federal Reserve’s high interest rates, such speculative investments are less appealing, likely dooming many layer-1 blockchains.\n\n“For clarification, 23% of Russell 3000 are by definition ‘zombie’ companies. People will pay for potential growth and for some that will eventually result in profitability. The problem is the new rates regime – there will inevitably be attrition. Same for Alt-L1s, some will survive and thrive but a lot will need to change course.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMimwFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2NyeXB0by90b2tlbi9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1yZWdhaW5zLTI5NTAwLWV0aGVyZXVtLWJlbG93LTE4NTAtc2hpYmEtaW51LXNvbGFuYS1yaXNlLTUtZWFjaC0zOTMzNzMtMjAyMy0wOC0wOdIBnwFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2FtcC9jcnlwdG8vdG9rZW4vc3RvcnkvY3J5cHRvLXByaWNlLXRvZGF5LWJpdGNvaW4tcmVnYWlucy0yOTUwMC1ldGhlcmV1bS1iZWxvdy0xODUwLXNoaWJhLWludS1zb2xhbmEtcmlzZS01LWVhY2gtMzkzMzczLTIwMjMtMDgtMDk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 09 Aug 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin regains $29,500; Ethereum below $1,850; Shiba Inu & Solana rise 5% each - Business Today",
        "content": "Bitcoin and other top crypto tokens were mostly higher on Wednesday ahead of the key economic data due later this week. The entire narrative for Bitcoin has shifted towards the Bitcoin ETF, which is less volatile of late as the $30,000-mark is a critical threshold. But macros continue to weigh.\n\n\n\nBitcoin was back in action on Wednesday as the largest crypto token gained more than 2 per cent to regain 29,500-mark. However, its largest peer, Ethereum was trading higher, rising more than a per cent but could not race past $1,850-levels. Price action in the major altcoins was on the higher side.\n\n\n\nBitcoin’s prices crossed $30,000 before settling at trading above the $29,500 level. This shift might be because of China's reduced trade figures for July and the US 10-year Treasury yield dropped. Over the past 24 hours, Solana, Shiba Inu, Hedera, and TonCoin gained Ethereum continuing trading between the $1,800-$1,900 range, said Edul Patel, CEO & Co-founder at Mudrex.\n\n\n\nBarring a few exceptions, all top crypto tokens were trading higher on Wednesday. Shiba Inu and Solana gained more than 5 per cent each, while Polygon gained 4 per cent. XRP rose 3 per cent, whereas Cardano, Polkadot and Litecoin added 2 per cent each. Among the losers, Bitcoin Cash and Tron were about a per cent each.\n\n\n\nThe global cryptocurrency market cap was trading significantly higher, rising up to $1.19 trillion-mark as it rose as much as 2 per cent in the last 24 hours. However, the total trading volumes surged about 13 per cent to $36.67 billion.\n\n\n\n\n\n\n\nTech View by Giottus Crypto Platform\n\nPolygon (MATIC) is experiencing a positive break following wider sentiment in the market postPaypal’s new stablecoin news. The asset is showing signs of recovery suggesting a breakout from the descending channel.If successful, MATIC could hit the key 100-day moving average around the $0.80 area.\n\n\n\n\n\nIts RSI reading is currently at 45.7 and has started moving sideways, indicating that the asset may recover towards neutral territory. However, if MATIC is unable to break through the $0.75 barrier, price may fall. The most recent low (about $0.65) serves as an early support level.\n\nMajor Levels:\n\nSupport: $0.65, $0.55\n\nResistance: $0.75, $0.80, $0.90\n\n\n\n\n\n(Views and recommendations given in this section are the analysts' own and do not represent those of Business Today. Please consult your financial adviser before taking any position in the asset/s mentioned.)\n\nAlso read: Tata Power to share Q1 results today; profit may drop up to 20% as coal biz weighs\n\nAlso read: 3,200% return in 2023! Top BSE stock performer announces split of shares"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA4LzA4L2hlcmVzLW15LXRvcC1jcnlwdG9jdXJyZW5jeS10by1idXktaW4tYXVndXN0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 08 Aug 2023 07:00:00 GMT",
        "title": "Here's My Top Cryptocurrency to Buy in August - The Motley Fool",
        "content": "The long crypto winter throughout 2022 was challenging for many investors, to put it mildly. But those who stuck it out have been rewarded with substantial gains so far this year.\n\nEthereum (ETH 1.20%) is currently up by around 52% so far this year, and Bitcoin (BTC 1.25%) has soared by roughly 74% in that timeframe. Some smaller cryptocurrencies have seen even larger gains, with Solana (SOL 0.62%) surging by a whopping 141% this year.\n\nIt's still critical to choose the right investments, however. Despite this upswing in prices, there will likely be more volatility on the horizon, and buying the wrong crypto now could come back to bite you later.\n\nWhile crypto is still speculative and there's no one-size-fits-all buying option, there's one investment I'm loading up on in August: Ethereum.\n\nEthereum continues to be a juggernaut\n\nEthereum has long been a leader in the industry, and it continues to dominate. It's the second-largest crypto behind Bitcoin by market cap, making up just under 20% of the entire crypto sector.\n\nEthereum's smart contract platform provides a wide range of uses, as it can host everything from non-fungible token (NFT) marketplaces to decentralized finance (DeFi) applications to metaverse projects and more.\n\nThat alone gives it more utility than its largest competitor Bitcoin, which is used primarily as a payment coin or hedge against inflation. Ethereum's sheer size also gives it an advantage over smaller, similar networks (such as Solana or Cardano), as it dominates the smart contract space.\n\nLate last year, Ethereum developers also successfully finalized The Merge. This landmark upgrade transformed the network into a proof-of-stake blockchain, reducing its energy output by roughly 99%. Meanwhile, Bitcoin still uses the incredibly energy-intensive proof-of-work system, which could make it harder for the crypto to keep up with demand over time.\n\nMore upgrades could further strengthen Ethereum\n\nThe Merge was the biggest update to Ethereum so far, but it's far from the last. In fact, Ethereum founder Vitalike Buterin said at the Ethereum Community Conference last year that the network is only around 40% complete -- and it should get stronger with each update.\n\nButerin has created a roadmap of Ethereum's future updates, and the next one -- called The Surge -- is expected to improve the blockchain's speed and reduce transaction fees.\n\nThis has long been a sore spot for Ethereum, and its sluggish transaction times and high fees have caused many users to flock to faster and cheaper networks like Solana. If The Surge is able to squash these problems, it could be monumental for Ethereum's long-term potential.\n\nBeyond The Surge, there are several other updates on the roadmap -- including The Scourge, The Verge, The Purge, and The Splurge. The later updates likely won't take place until several years from now, but the roadmap has been designed to tackle problems in order of most to least pressing for users.\n\nIs Ethereum a good investment right now?\n\nEthereum is already a strong investment, and it should only get stronger with each new upgrade. But there are risks to consider, too.\n\nFor one, the crypto industry moves at break-neck speed, and developers are creating new blockchains by the day. While Ethereum's size and popularity give it a major leg up over smaller competitors, that doesn't mean a new network can't swoop in and steal market share -- especially if Ethereum fumbles any of its future upgrades.\n\nAlso, cryptocurrency in general is still a risky investment. Despite all of its potential uses, Ethereum's utility is largely based on speculation. In other words, if NFTs, DeFi, the metaverse, or other decentralized applications gain widespread acceptance, Ethereum will benefit from it. If they don't, Ethereum could suffer.\n\nWhen you invest in any cryptocurrency, there's always a risk it may not pan out. But if you're willing to take that risk, Ethereum could be a strong investment with loads of long-term potential."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOC8wOS9ldGhlcmV1bS1iYXNlZC1hbHRjb2luLXNob3dpbmctc2lnbnMtb2YtcG90ZW50aWFsLWJyZWFrb3V0LXNheXMtdHJhZGVyLXdoby1uYWlsZWQtMjAxOC1iaXRjb2luLWJvdHRvbS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 09 Aug 2023 07:00:00 GMT",
        "title": "Ethereum-Based Altcoin Showing Signs of Potential Breakout, Says Trader Who Nailed 2018 Bitcoin Bottom - The Daily Hodl",
        "content": "A closely followed crypto strategist says that one mid-cap altcoin looks poised to break out against Bitcoin (BTC), Ethereum (ETH) and the US dollar (USD).\n\nPseudonymous analyst Bluntz tells his 223,800 X followers that the decentralized oracle network Chainlink (LINK) is forming a bullish continuation pattern across all three pairs.\n\nAccording to the analyst, LINK’s price action stands out amid a generally stagnant crypto market.\n\n“Been struggling to find anything that looks decent for quite a while in this chop, but LINK is finally starting to look promising here with a potential bull flag breakout forming on not just USD pair but also its BTC and ETH cross pairs.”\n\nAt time of writing, Chainlink is worth $7.44, a price level that’s very close to touching the trader’s diagonal resistance on LINK’s USD pair.\n\nThe trader is also updating his outlook on Ethereum itself. Bluntz says that ETH appears to be mirroring Bitcoin’s early 2019 market structure when it massively rallied after breaking out from an ascending triangle pattern.\n\nAccording to the analyst, Ethereum will likely witness a parabolic surge once it moves above resistance at $2,050.\n\n“When ETH finally breaks out from $2,050, it’ll be an open-the-flood-gates moment. There won’t be any ‘retest,’ just a 40% weekly candle. In my mind, this is a when-not-if situation. Our only job here is to survive the chop…\n\nThis $2,050 god breakout candle on ETH will most likely be the candle that bottoms ETH/BTC.”\n\nAt time of writing, ETH is worth $1,858.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LnJpc2submV0L2Rlcml2YXRpdmVzLzc5NTc0MDUvbmV3LWhvcGUtZm9yLWNyeXB0by1kZXJpdmF0aXZlcy1hcy1tYXJrZXRzLXVyZ2VkLXRvLWhhaWwtY2VzctIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 08 Aug 2023 07:00:00 GMT",
        "title": "Markets - New hope for crypto derivatives as markets urged to hail CESR - Risk.net",
        "content": "Ethereum staking index could allow swap curve and structured products to develop\n\nLast September, Ethereum crossed the Rubicon. The blockchain, which had until then operated under a proof-of-work (Pow) architecture similar to those underpinning cryptocurrencies such as bitcoin, switched to an entirely new mechanism known as proof of stake (Pos).\n\nUnder the old system, block creators known as ‘miners’ would be given Ethereum’s cryptocurrency ether (ETH) in return for decrypting hexadecimal numerical codes. Under Pos, members of the network – now known as ‘validators’ – stake their ETH tokens into a smart contract, which enables them to earn fees by confirming transactions. The tokens can be destroyed if the validators behave improperly.\n\nThe transition also triggered what CoinFund president Chris Perkins says was a “light bulb” moment for his digital asset investment firm. Perkins saw that the fees validators would earn could wax and wane depending on the level of demand on the network. Surprising market events, like the collapse of crypto exchange FTX, could cause spikes in demand and lead to higher fees.\n\nI’m hopeful we can build social consensus that CESR is the standard benchmark for Ethereum staking. Once we have social consensus, the industry – both trad-fi and crypto – can build Chris Perkins, CoinFund\n\nPerkins realised that validators, like any businesses with variable income and fixed costs, would need a way to hedge their financial exposure, and so he joined forces with CoinDesk Indices to launch the Composite Ether Staking Rate (CESR), which tracks the yields validators earn. The benchmark – pronounced in the same way as the Roman emperors – could also enable validators to enter into swap contracts whereby they would exchange CESR for a fixed rate, thus locking in their profits.\n\nPerkins says CESR, as a staking yield index, is a “non-correlated rate to traditional finance”. He believes certain investors, such as hedge funds and family offices, might use it to achieve a stream of returns unconnected to conventional asset classes – such as bonds and equities, the values of which can fluctuate in reaction to changes in the US Federal Reserve’s monetary policy.\n\nAndy Baehr, managing director at CoinDesk Indices, says using CESR as a settlement rate will support a fixed-versus-floating swap market that lines up natural users on both sides. He believes validators could experience less volatility in their revenue by swapping their variable staking yield for a fixed rate.\n\n“The other side of the trade – receiving floating – could carry a risk premium and could be incorporated into investor products,” he says. “Due to the natural convexity of Ethereum staking yields, dealers may find that holding on to floating inventory is, in a sense, right-way risk.\n\n“The question is, where is that fixed rate going to trade? That comes down to what fixed payments validators will be happy to receive to give away that convexity in service of improving the Sharpe ratio of their stake.”\n\nIn the arena\n\nCESR is not the only staking yield index that market participants have looked at. Switzerland-based Compass Financial Technologies has been working with exchange-traded product (ETP) issuers to use its own staking yield rate as a base yield in ETH products. Compass is a European Union-approved benchmark administrator, and its STYETH index is approved for use in regulated products in the bloc.\n\nETPs could use swaps based on staking yield indices to give investors a total return on ETH.\n\nSo far, most crypto ETPs simply give investors exposure to the performance of ETH. Guillaume Le Fur, Compass’s CEO, says some ETP providers have begun to offer clients a fixed staking yield on top of that. However, this is typically at the discretion of the asset manager. Compass has been working with issuers to incorporate the returns from its index into the products.\n\nETPs come with liquidity management issues. With ETH, unlike some coins on Pos blockchains, there is no minimum period of days during which the currency must be staked. However, ETH does have an entry queue: it currently takes around 31 days to stake the currency but only one minute to exit. Based on that, an ETP could not at any time stake 100% of its ETH holdings as it would have to manage daily liquidity requirements.\n\nETPs keep as profit the margin between the actual staking rate and what the client receives. Although this is currently acceptable to retail investors, Le Fur thinks that if more institutions are to be attracted to the market they will want the total return exposure.\n\nAnother use case is structured products. Chris Bae, founder and chief executive of Enhanced Digital Group, says CESR could be used for a classic zero-coupon bond structure, where the reference rate is used as the pull-to-par by maturity. The difference at inception could be used to buy ETH options that provided customised payoffs.\n\n“It just opens the yield world beyond securities lending,” he says. “It’s actually a yield that we can grasp from the validators. And then all of a sudden – if you can build on it, put notes on it and financialise it – it’s a really tangible hurdle and interest rate for the ETH ecosystem. Validators may be willing to swap up a considerable percentage of their received staking yields for fixed US dollars to pay for things like expenses or loan costs.\n\n“Interest in structured products in general has gone up as interest rates have risen. But with US Treasuries paying more than 5%, the overall macro environment provides a lot of choices for competitive yields.\"\n\nGreg Schvey, CEO of market infrastructure technology company Axoni, says CESR could provide transparency around staking services, and thereby enable users of those services to “understand the spread they’re paying the service provider by comparing to the benchmark rate”.\n\nHe adds: “Given the inherent transparency provided by the blockchain, it would also help prevent the manipulation and related issues we’ve seen in Libor.”\n\nNot everyone is convinced about CESR’s merits. Max Boonen, founder of digital asset liquidity provider B2C2, believes it is too early for the benchmark to take off. “There could be demand for the rate if it’s freely accessible and a licensing fee doesn’t need to be paid,” he says. “But more of a market around the actual act of staking is needed before we have data providers and the like on top.\n\n“We don’t really have much in the way of convenient user interfaces with staking. It tends to be a little bit convoluted because you need to go deep in the technology. Some exchanges offer staking as a service, but I think we’re only at the beginning of that industry.”\n\nGiven the inherent transparency provided by the blockchain, [CESR] would also help prevent the manipulation and related issues we’ve seen in Libor Greg Schvey, Axoni\n\nHowever, Perkins says CoinFund does not mind being early and that it has responded to the feedback of finance and academia by engineering a benchmark that is robust, institutional and investible. He adds that CESR is transparent and replicable – enabling industry stakers to compete against the mean.\n\n“This sort of transparency should be a good thing for markets,” he says. “I’m hopeful we can build social consensus that CESR is the standard benchmark for Ethereum staking. Once we have social consensus, the industry – both trad-fi and crypto – can build.”\n\nWhen in ETH, do as the ETH traders do\n\nOne crypto-native market-maker is already on board with CESR.\n\nRyan Kim is head of derivatives at California-based FalconX, which is the only crypto-native firm registered as a swap dealer with the US Commodities and Futures Trading Commission. He sees demand for a contract where the CESR rate is denominated in ETH, with the USD/ETH exchange rate locked in at the outset, so both the fixed and floating legs can be exchanged in dollars. Under that scenario, Kim says FalconX could manage the USD/ETH risk, though he adds that the validators would probably want to receive the fixed leg in dollars so they could use it to pay for business or loan expenses.\n\n“What they can do is come to FalconX and say ‘I will give you every month my ETH production at the rate that is the average rate,’” he says. “‘And in exchange, you will give me a set number of dollars every month.’ I have now completely taken out the uncertainty involved with this loan. And I now know I have this stream of dollar payments no matter what the price of ETH does, and as long as I beat the average I will have that ETH on hand to deliver to Falcon X.”\n\nKim says a typical tenor would be six months, with monthly coupon payments, and a typical notional size would be around $250 million. Initially, he expects most interest to come from the validator side – which would mean FalconX, as a market-maker, having to find a way to hedge – though he also expects an interdealer market in the swaps to grow over time.\n\nPerkins is confident other market-makers will get involved. Over time, he believes swap trading on the benchmark will allow for the development of a term curve, which asset managers could use as a discount curve to value their ETH assets.\n\nLast year, staking yield swaps were also attempted on Lido, a benchmark that takes in just under 30% of the total number of validators. However, while this rate is based on what Lido itself produces, Perkins says CESR is based on data from the entire Ethereum blockchain – more than 750,000 validators – “rather than a subset”.\n\nCompass says STYETH also follows all on-chain validators worldwide.\n\nEmpire building\n\nBanks have so far been slow to take interest in CESR. Although Perkins detects curiosity from their research departments, he says traders are taking longer to “digest” the benchmark. Basel capital rules mean a punitive 1,250% risk weight can be applied to holding crypto assets such as bitcoin or ETH on bank balance sheets.\n\nPerkins characterises CESR as “a synthetic version once removed”, as it does not reference ETH’s underlying price. “If I was at a bank, I would definitely be working closely with my capital people to see if there’s a structure upon which this could fit into the rates bucket,” he says.\n\nPerkins, who was previously global co-head of futures, clearing and FX prime brokerage at Citi, is working with the International Swaps and Derivatives Association on updating its crypto definitions, which do not cover swaps. He believes there may be more interest in CESR from banks once ETH celebrates its 10th birthday in 2025: “That’s a nice institutional unlock when you have 10 years of risk data.”\n\nCESR went into production on September 15 last year after CoinDesk and Coinfund had finalised its methodology. Perkins expects more interest from regulated exchanges once it has amassed more than 12 months of historical data. He says that, as a truly global rate, it compares favourably with overnight index swap rates that are split up by jurisdiction, such as Eonia and Sonia.\n\nCESR is currently calculated once a day, seven days a week, based on a look-back period of 24 hours, but it has the potential to move to hourly releases. Initially offered in the US only, the benchmark is expected to go fully live later this month, with trades announced shortly afterwards.\n\nRelated Crypto gets to grips with interest rate swaps New derivatives provide synthetic access to staking yields and are being used in structured products\n\nBae of Enhanced Digital Group admits that a “beautiful seamless curve” will not emerge immediately. He likens the evolution required for CESR to the forward curve for China’s offshore renminbi in Hong Kong, which took two years to develop.\n\n“CNH was really hard to adopt,” he says. “People were like, ‘Well, I don’t know why I want to trade that yet.’ It was just one week and one month for a long time. And then it got to three months.” He adds that a turning point that made the curve more tradeable was an increase in CNH-denominated bonds issued by Hong Kong corporates. He does, however, see definite uses cases for CESR.\n\nPerkins says the benchmark is also “a pretty beautiful on-ramp into crypto for rates”, as it would enable cross-currency swaps with fiat currencies or floating-for-floating basis swaps, such as SOFR against CESR.\n\n“If you have a view that traditional interest rates are going down and activity in Ethereum is going up,” he says, “maybe you go long CESR and short SOFR.”\n\nIt remains to be seen whether CESR will prove as all-conquering as its namesake. Rome was not built in a day but there are now, it seems, more roads leading to crypto derivatives.\n\nEditing by Daniel Blackburn"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0taGlzdG9yaWNhbC1wbGF5Ym9vay1wb2ludHMtMzgwMC1jb21pbmctbW9udGhzL9IBYWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0taGlzdG9yaWNhbC1wbGF5Ym9vay1wb2ludHMtMzgwMC1jb21pbmctbW9udGhzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 09 Aug 2023 07:00:00 GMT",
        "title": "Ethereum: Historical Playbook Points To $3,800 In Coming Months - NewsBTC",
        "content": "Renowned analyst Josh Olszewicz has shared some compelling insights on Ethereum’s price trajectory. Drawing parallels from historical patterns, Olszewicz’s analysis suggests that Ethereum might be gearing up for a significant rally in the coming months.\n\nHistorical Pattern: Ethereum Forms Ascending Triangle\n\nOlszewicz starts by highlighting Ethereum’s current price pattern, jokingly stating, “Ethereum: ascending triangle 450 million years in the making w/fib extensions to $3k.” This ascending triangle, characterized by a flat top and rising bottom, has been forming since May 2022, and if history is any guide, it could be a bullish sign for Ethereum.\n\nDescending volume, another feature of this pattern, further strengthens the bullish bias. However, Olszewicz cautions that the “bias remains bullish until price breaks below diagonal support.” He also points out the psychological resistance at $2,000, noting it as an “extremely obvious signal that it’s go time, which should help the breakout.”\n\nTo bolster his analysis, Olszewicz draws parallels from Bitcoin’s past. He recalls, “take BTC in 2015/2016 [the price formed an ascending triangle for 210 days with descending volume] and BTC in 2018/2019 [ascending triangle for 130 days with descending volume] as examples.” In both instances, Bitcoin surged towards the Fibonacci extension levels post the breakout.\n\nEthereum itself isn’t a stranger to such patterns. Olszewicz cites, “ETH has also had previous examples in 2017 (bullish continuation) and 2019 (bullish reversal).” Each ascending triangle pattern lasted 180 days. Both times ETH surged towards the 2.618 Fibonacci extension level.\n\nDrawing from these historical patterns, Olszewicz suggests that Ethereum is currently holding the potential to overshoot the 1.618 Fibonacci level and possibly reach the 2.618 level, which translates to a price of $3,800. However, he wisely advises, “but don’t get out the imaginary profit calculator just yet, let’s break $2k first.”\n\nETH vs. BTC: Which One Is The Better Trade?\n\nWhile Ethereum’s potential rally is intriguing, Olszewicz also delves into its performance relative to Bitcoin. He observes that Ethereum has underperformed Bitcoin year-to-date, attributing this to the ETF narrative and Bitcoin’s dominance as hard money. He speculates, “the better trade may continue to be BTC/USD, especially with initial spot ETF inflows favoring BTC.”\n\nHowever, if the ETH/BTC pair can break and sustain new highs, it might hint at a runaway trade for Ethereum. But Olszewicz remains skeptical, stating it’s “unlikely based on ETF flows.”\n\nOlszewicz also doesn’t shy away from discussing potential bearish scenarios. He’s closely watching certain bearish ETH/BTC levels, including the current local low at 0.050 and the previous inverse head and shoulders neckline at 0.039.\n\nFor Bitcoin, he suggests a potential move to $42,000, provided it maintains certain bullish conditions. He notes, “as long as we can maintain prices above the midline of the PF & stay in the cloud, we have a decent shot at reaching $42k before halving.”\n\nWrapping up his analysis, Olszewicz envisions a dream trade where Bitcoin breaks bullish first, possibly due to technicals or a spot ETF approval. In this scenario, Ethereum breaks $2,000 but lags behind Bitcoin, leading to ETH/BTC getting “crushed, allowing for an eventual profit taking rotation from Bitcoin to Ethereum”. However, he concludes with a word of caution: “without inflows, we ain’t movin.”\n\nAt press time, ETH traded at $1,860.\n\nFeatured image from iStock, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmZvcmJlc2luZGlhLmNvbS9hcnRpY2xlL2NyeXB0b2N1cnJlbmN5L3BheXBhbC10by1yZWxlYXNlLWV0aGVyZXVtYmFzZWQtc3RhYmxlY29pbi1saW5rZWQtdG8tdXMtZG9sbGFyLzg3Mzg1LzHSAX1odHRwczovL3d3dy5mb3JiZXNpbmRpYS5jb20vYW1wL2FydGljbGUvY3J5cHRvY3VycmVuY3kvcGF5cGFsLXRvLXJlbGVhc2UtZXRoZXJldW1iYXNlZC1zdGFibGVjb2luLWxpbmtlZC10by11cy1kb2xsYXIvODczODUvMQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 09 Aug 2023 07:00:00 GMT",
        "title": "PayPal to Release Ethereum-Based Stablecoin Linked to U.S. Dollar - Forbes India",
        "content": "Image: Shutterstock\n\nPayPal's entrance into the stablecoin arena with the unveiling of the PayPal USD (PYUSD) stablecoin has sparked both excitement and scepticism within the crypto landscape. This move positions PayPal as a major player in the digital assets space, and has triggered discussions about the potential impact on the broader financial ecosystem.The Ethereum-based token would be available to PayPal users in the US, and users would be able to transfer the PYUSD tokens from their PayPal accounts to supported external wallets. As PayPal claims, the tokens can be used to make payments and convert any of the supported crypto on PayPal into or from PYUSD. The partnership between PayPal and Paxos Trust Co., the issuer of PYUSD, underscores the collaboration between traditional financial institutions and the crypto space. As PayPal gradually rolls out access to PYUSD for its U.S. customers, the stablecoin's integration with the platform may lead to increased adoption and utilisation.PayPal's stablecoin initiative has sparked comparisons to BlackRock's endorsement of Bitcoin, indicating its perceived significance within the industry. The stability and backing of PYUSD could attract broader adoption and usage, extending beyond speculative trading. Industry experts suggest that PayPal's move could inspire other major companies to explore digital asset integration.However, PayPal's entrance into the stablecoin space also raises regulatory considerations. Despite regulations in the European Union and other regions, concerns over stablecoins' systemic influence continue. The U.S. lawmakers strive to create a stablecoin regulatory structure, and PayPal's PYUSD introduction will undoubtedly engage regulators, including the Federal Reserve and the Securities and Exchange Commission. On this development, Shivam Thakral, CEO of BuyUcoin, India's second-longest-running virtual digital asset exchange, stated, \"PayPal's entry into the stablecoin market highlights the growing acceptance and usage of cryptocurrencies within conventional financial institutions and may pave the way for additional market innovation. We can expect more fintech giants to make [their] foray into the digital asset market by leveraging the combined strength of digital and traditional finance.”In light of the ongoing discussions surrounding stablecoins and their role in the future financial landscape, PayPal's PYUSD launch represents a significant step toward the mainstream acceptance of digital assets. With regulatory scrutiny and evolving legislative efforts, the stablecoin's potential impact sets the stage for a dynamic period of exploration and innovation in the crypto world."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY29pbmpvdXJuYWwubmV0L25ld3MvYXB5LWZvcmVjYXN0LXdoYXQtd2lsbC1oYXBwZW4tdG8tZXRoZXJldW1zLXN0YWtpbmcteWllbGQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 09 Aug 2023 07:00:00 GMT",
        "title": "APY forecast: what will happen to Ethereum's staking yield? - CoinJournal",
        "content": "Key Takeaways\n\nEthereum completed its long-awaited Merge upgrade in September 2022\n\nStakers are currently earning approximately 4% APY from their Ether tokens\n\n19% of the total Ether supply is staked, the lowest ratio of any of the leading coins\n\nStaking rewards are divided among stakers, meaning the APY earned decreases as more users stake\n\nDemand on the network increases gas fees and ultimately contributes to more APY, meaning there are several factors at play when trying to assess where the yield may land\n\nAll in all, it remains up for debate as to where the yield is headed, despite many analysts predicting basement-level yields of 1%-2% are inevitable\n\nThe fundamentals of Ethereum were entirely transformed in September 2022 when the Merge went live, the blockchain officially becoming a proof-of-stake consensus. The implications for this are many, however one of the more fascinating aspects is that investors can now earn a yield from staking their Ether tokens.\n\nLet’s dive into how popular staking has been, where it’s trending going forward, and speculate about where the all-important APY may land.\n\nEthereum stakers are increasing\n\nEthereum staking has proved wildly popular. There is currently almost 18.75% of the total supply staked. The below chart from CryptoQuant shows that not only has the increase been consistent, but the rate of increase has steepened noticeably since the Shapella upgrade in April.\n\nShapella finally allowed staked Ether to be withdrawn, with some early stakers having had tokens locked up since Q4 of 2020. There was hence some concern that Ether would be withdrawn en masse once the Shapella upgrade went live, the subsequent sell pressure bound to dent the price. Not only has this happened, but staking has only become more popular since the upgrade.\n\nDespite the popularity of Ethereum staking, and the lack of withdrawals sparked by Shapella, the network’s staked tokens as a percent of the total supply still pale in comparison to other proof-of-stake blockchains.\n\nThe chart below highlights Ethereum in yellow, its 19% ratio far below the other major proof-of-stake coins. Assessing the rest of the top 10 by staked market cap, these coins average a 53% stake ratio, with only BNB Chain remotely close to Ethereum, sitting at 15%.\n\nIf we then shift the chart to assess the total market cap of the staked portion of coins, Ethereum’s dominance is clear. Its 19% staked tokens carry a value of $43 billion – more than the other nine cryptos’ staked market caps combined.\n\nEthereum’s low staked ratio implies that it should have more, at least if other coins can be used as a benchmark. This is especially true when considering recent bullish developments on the Ethereum network which suggest it may be solidifying its place as the market-leading smart contract platform. Most notable of these could be discussion around potential Ether futures ETFs, as well as the announcement that PayPal is launching a stablecoin on the network this week.\n\nSo, what happens to the staking yield if the amount of staked Ether does indeed continue to increase? Remember, the total annual yield paid out to stakers is calculated as follows:\n\n[(gross annual ETH issuance + annual fees*(1-% of fees burned)]\n\nThese total staking rewards are then divided by the average ETH staked over the year to commute the APY.\n\nIn other words: The amount of ether staked is in the denominator of the fraction. So as the amount staked gets bigger, the APY shrinks. This effect can already be seen in what has happened to date. Analysts had predicted a yield of 10%-12% ahead of the Merge, however today it is closer to 4%. And that is 4% with its staking ratio completely out of whack compared to other proof-of-stake coins, as mentioned above.\n\nWhat happens next?\n\nWith the amount of Ether staked increasing incessantly, is the yield therefore primed to collapse?\n\nSome analysts believe it is headed towards 1%-2%; some even think less. The reality is that nobody really knows because, as always, demand relies on a variety of factors.\n\nWe need to remember, as we often say in these columns, that speculating on the future of crypto is so difficult because we have such little data to work with. This is true for Ethereum as a whole, which only launched in 2015, but especially so regarding the yield, as the Merge has only been live since September (or since April if you count the “true” completion date as post-Shapella).\n\nHence, it is a challenge to forecast the staking yield going forward. We have focused on the impressive growth of staking thus far, and while this will drive the yield down, demand on the network will increase the numerator of the aforementioned formula and kick the yield up.\n\nIndeed, looking at total transactions, the rate has been quite resilient throughout the last eighteen months, despite the bloodbath in the sector last year.\n\nThen again, crypto is changing quickly. It remains difficult to foresee how regulation, infrastructural development (restaking and Eigeanlayer spring to mind as an example) and the macro landscape, just to name a few factors, will affect the climate going forward.\n\nSpeaking of macro, there is also the matter of trad-fi yields. Currently, the Fed funds rate is 5.25%-5.5%, having been near-zero prior to March 2022. Backing out probabilities from Fed futures implies the market is expecting the end of the cycle is near. Not to mention, with the mammoth amount of debt in the current system, rates cannot stay high forever.\n\nCould falling trad-fi yields affect demand for staking yield? Perhaps – while it is hard to separate the overall liquidity drain and suppressing of risk assets that occurs out of hiked rates, the superior (and risk-free) return is definitely a key reason why capital has flooded out of DeFi in the last year. While previously-dizzying DeFi yields have collapsed, trad-fi yields have rocketed as the Federal Reserve has scrambled to rein in rampant inflation.\n\nFurthermore, if yield does fall down towards 1%-2%, stakers could begin to pull out and search elsewhere for income. This would therefore create a reflexive relationship with regard to the yield.\n\nAll in all, it remains too early to speculate about where the Ethereum staking yield is ultimately headed, at least with any degree of confidence; it depends on too many factors and the sample space is too brief to date. It does seem likely, if not inevitable, that the yield will decline to some degree, but the question of how much is a difficult one to answer. While many are adamant the APY will cascade downwards to uber-thin levels – and for the avoidance of doubt, it may do – we have presented here at least some points of consideration as to why the situation may not be as clear cut."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS8xMDAtbWlsbGlvbi1taWxlc3RvbmUtYWNoaWV2ZWQtZm9yLWV0aC1ub24temVyby1hZGRyZXNzZXMv0gFXaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tLzEwMC1taWxsaW9uLW1pbGVzdG9uZS1hY2hpZXZlZC1mb3ItZXRoLW5vbi16ZXJvLWFkZHJlc3Nlcy8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 08 Aug 2023 07:00:00 GMT",
        "title": "100 Million Milestone Achieved for ETH Non-Zero Addresses - CryptoPotato",
        "content": "Blockchain data and intelligence provider Glassnode estimated that the number of Ethereum addresses holding even the smallest fraction of ETH (wei) had reached an all-time high of 104,076,868.\n\nAs CryptoPotato recently reported, Bitcoin non-zero addresses have also experienced a substantial rise, tapping an ATH of almost 48 million at the end of July.\n\nDespite ether’s recent consolidation at approximately $1,830, the number of Ethereum non-zero addresses has rapidly increased in the past few months, surpassing the milestone of 100 million.\n\n\n\nThose addresses were approximately 20 million in 2019 and around 50 million at the start of 2021 (a few months before the bull market, which saw ether reaching an all-time high price of almost $4,900 (per CoinGecko’s data).\n\nSeparately, the crypto data provider revealed that Ethereum’s amount of supply last active between seven and ten years ago hit an ATH of over 4.3 million ETH. The current circulating supply of the cryptocurrency is around 120 million.\n\nGlassnode estimated earlier this week that 5.67M BTC have stayed dormant since 2017 or a longer time ago. The total amount of the leading digital asset equals 19.45 million, meaning the aforementioned percent supply climbed to a peak of almost 30%."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vZGVjcnlwdC5jby9uZXdzLWV4cGxvcmVyP3Bpbm5lZD0yNTk0MDUmdGl0bGU9anBtb3JnYW4tcGF5cGFscy1zdGFibGVjb2luLWNvdWxkLWJlLWEtYm9vc3QtdG8tZXRoZXJldW3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 08 Aug 2023 18:08:05 GMT",
        "title": "News Explorer — JPMorgan: PayPal's Stablecoin Could Be a Boost to Ethereum - Decrypt",
        "content": "Aug 8, 3:50 pm\n\nThe Block\n\nJPMorgan: PayPal's Stablecoin Could Be a Boost to Ethereum\n\nJPMorgan believes that the launch of PayPal's stablecoin could benefit Ethereum by increasing its total value locked and attracting more firms to choose the Ethereum blockchain for their stablecoin or decentralized projects. However, some experts criticize PayPal's choice due to Ethereum's high transaction fees. To improve the user experience, PayPal may need to subsidize transaction costs or support PYUSD on other networks with cheaper gas fees."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jb2luYmFzZS1iYXNlLW5ldHdvcmstb2ZmaWNpYWxseS1sYXVuY2hlZC1oZXJlcy1ob3ctaXQtY2FuLWJlLXVzZWTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 09 Aug 2023 07:00:00 GMT",
        "title": "Base network has officially launched: Here's how it can be used - Cointelegraph",
        "content": "Coinbase’s Base network has officially launched after spending a few weeks in an “open for builders only” phase. The network is now ready to onboard users, according to an Aug. 9 announcement from the team.\n\nSeveral Web3 development teams have simultaneously announced that they are releasing apps for Base, and the network’s team has released a schedule of upcoming events to celebrate its launch.\n\nBase is open and Onchain Summer is here\n\n\n\nBecome a part of Base history by minting “Base Day One” to join the story of bringing the world onchain\n\n\n\nOur story.https://t.co/qaDj7CBCMd pic.twitter.com/9PZCLQQV7p — Base ️ (@BuildOnBase) August 9, 2023\n\nBase initially launched in beta version on Feb. 23. As soon as it was announced, many in the crypto community speculated that it could help to onboard more users into Web3 protocols, thanks to Coinbase’s large user base. The network launched its mainnet version “for builders” on July 13, but the team warned that it wasn’t ready for users yet. On Aug. 9, the network became available for all users.\n\nHere are a few things users can do on Base right now.\n\nBridge tokens\n\nUsers can bridge Ether (ETH) from mainnet to Base using the official Base bridge, which launched a user interface on Aug. 3. On Aug. 9, the cross-chain bridging protocol Wormhole announced it is available on Base.\n\nSwap tokens and provide liquidity\n\nAt least two decentralized cryptocurrency exchanges (DEXs) have announced they are running on Base, and a third may relaunch soon. Uniswap, one of the first decentralized exchanges on Ethereum, declared its Base version was running on Aug. 7.\n\nMaverick Protocol announced its Base version on Aug. 8. Maverick claims to provide greater capital efficiency and allow for greater customization than its competitors.\n\nA third DEX on Base, LeetSwap, was previously running during the “builders only” phase but is currently shut down due to an Aug. 1 exploit. The team intends to relaunch the project at some point in the future. LeetSwap claims to be a DEX for “leet degens\" and offers “dual-token farm rewards” to maximize yield.\n\nThese three apps provide options for users who want to swap tokens or become liquidity providers.\n\nMake payments\n\nAt least one payment app for Base is available.\n\nBeam is a web-based app that allows users to make payments using either U.S. Dollar Coin (USDC) or the app’s native coin, Eco. According to the app’s developers, users aren’t required to store seed words or possess Ether to pay for gas fees. They can log in with their Twitter accounts and pay for gas using USDC or Eco. The app also features a built-in fiat-to-crypto and crypto-to-fiat gateway.\n\nBase announced Beam’s launch for the network on July 27.\n\nRegister a username\n\nMasa Finance has released its soulbound token protocol for Base. On Aug. 8, the protocol announced that users can now register \".base\" Masa usernames on the new network. These usernames may later be used for credit underwriting and other Know Your Customer-compliant services.\n\nIn its announcement, Masa claimed to have minted over 280,000 usernames on Base since the builder phase began.\n\nLaunch a decentralized autonomous organization (DAO)\n\nDecentralized autonomous organization creation protocol Aragon has launched its “no-code Aragon app” and “modular Aragon OSx” on Base to allow for DAOs to be easily created on the new network. Although it’s mostly developers who will use this function, end users can also establish DAOs on Base through Aragon.\n\nMint and collect nonfungible tokens (NFTs)\n\nOnchain Summer user interface. Source: Base\n\nMultiple brands and projects will allow users to mint NFTs exclusively on Base throughout August and early September. These include Coca-Cola, Coinbase’s Stand With Crypto campaign, Showtime, Atari, Optimism, OpenSea and others. Each NFT launches on a different day of the Onchain Summer festival. For example, the Showtime NFT becomes available on Aug. 18, while the Atari one launches on Aug. 25.\n\nSome investors lost during Base's phased launch\n\nDespite Base’s initial success in attracting app developers, its launch hasn’t been without problems. The network was up and running between July 13 and Aug. 2 but didn’t have a bridge UI. As a result, some users attempted to get an early lead by using developer tools to transfer ETH to the network and buy memecoins that were expected to rise in value after the network’s official launch. However, many investors lost money in these projects due to various launch issues.\n\nAn estimated $2.2 million was lost by investors in the July 28 Pond0x memecoin launch due to confusion surrounding how the token was supposed to be distributed. Another $1.9 million was lost during the July 31 BALD token launch on Base when the developer pulled some of its liquidity."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA4LzA5L3RoZS1wcm90b2NvbC1jb2luYmFzZS1sYXVuY2hlcy1vd24tYmxvY2tjaGFpbi1hcy1zbGV1dGhzLXNjb3VyLXBheXBhbHMtc3RhYmxlY29pbi1zb2Z0d2FyZS_SAYgBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wOC8wOS90aGUtcHJvdG9jb2wtY29pbmJhc2UtbGF1bmNoZXMtb3duLWJsb2NrY2hhaW4tYXMtc2xldXRocy1zY291ci1wYXlwYWxzLXN0YWJsZWNvaW4tc29mdHdhcmUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 09 Aug 2023 07:00:00 GMT",
        "title": "The Protocol: Coinbase Launches Own Blockchain as Sleuths Scour PayPal's Stablecoin Software - CoinDesk",
        "content": "OPEN-SOURCE, OPEN WOUND. Matter Labs, developer behind the Ethereum layer-2 network zkSync, was accused by rival Polygon of copying part of its open-source code without providing proper attribution. Matter Labs quickly acknowledged that some code was copied, but insisted that the attribution had been provided. Matter Labs CEO Alex Gluchowski later conceded that its attributions could have been more prominent, writing on X (formerly Twitter) that “there is a more standard approach to attributions, which we will wholeheartedly apply from now on.\" The kerfuffle provided a lesson on the community norms around usage of open-source software – and an example of just how touchy things can get in an ultra-competitive environment."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY3J5cHRvLm5ld3MvY2hpbGl6LWFuZC1ldGhlcmV1bS1jbGFzc2ljLXVuZGVycGVyZm9ybWluZy1wb21lcmRvZ2UtcmlzaW5nL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 09 Aug 2023 07:00:00 GMT",
        "title": "Chiliz and Ethereum Classic underperforming, Pomerdoge rising - crypto.news",
        "content": "Chiliz (CHZ) and Ethereum Classic (ETC) have been underperforming for weeks. As a result, many are turning to Pomerdoge, a new cryptocurrency project whose native token, POMD, has been racing in recent days.\n\nChiliz declining\n\nCrypto market statistics show that Chiliz remains in a bear run, with CHZ dropping 1.43% in the last 24 hours to $0.075 when writing.\n\nYou might also like: Shiba Inu millionaires accumulating POMD in Pomerdoge presale\n\nAt this pace, the token fell 1.4% in the previous two weeks and 0.9% in the past week. Overall, the token is down 1.73% over the last 30 days.\n\nMeanwhile, CHZ trading volumes are up 23.93% on the last day to around $31.44 million.\n\nGiven these inconsistencies, Chiliz holders are rapidly considering other high-growth projects, including POMD.\n\nEthereum Classic dropping\n\nAnother token that the market downturn has impacted is Ethereum Classic.\n\nIn the last 24 hours, ETC shaved 0.68%, forcing prices lower to $17.66. In the previous 30 days, the coin dropped 6.8%. At the same time, it is down 2.4% and 3% in the last two and one week, respectively.\n\nYou might also like: Litecoin and Polkadot holders exploring the Pomerdoge presale\n\nAt this rate, ETC is underperforming, and investors are looking for other options, wherein Pomerdoge has emerged as an option to consider. POMD holders are optimistic and expect gains by the end of the year.\n\nPomerdoge attracting investors\n\nPomerdoge is a play-to-earn gaming platform that connects individuals worldwide for digital networking and competition, attracting investors.\n\nPomerdoge investors can also purchase a set of 7,777 unique non-fungible tokens (NFTs). At the same time, presale investors are eligible for a share of revenue based on their POMD token share.\n\nThe Pomerdoge presale phase is ongoing, and each token is available for $0.007.\n\nSolidProof and Cyberscope have audited Pomerdoge while the token’s liquidity will be locked for life to ensure the safety of the tokens.\n\nInvestors looking for a return can explore the Pomerdoge project during the presale.\n\nFind out more about the Pomerdoge (POMD) presale today:\n\nWebsite: https://pomerdoge.com/\n\nTelegram Community: https://t.me/pomerdoge\n\nDisclosure: This content is provided by a third party. crypto.news does not endorse any product mentioned on this page. Users must do their own research before taking any actions related to the company.\n\nFollow Us on Google News"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMikAFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3RvcC0zLXByaWNlLXByZWRpY3Rpb24tYml0Y29pbi1ldGhlcmV1bS1yaXBwbGUtbWFya2V0cy1zaG93LW9wdGltaXNtLWFoZWFkLW9mLXVzLWNwaS0yMDIzMDgwOTE4NTfSAZQBaHR0cHM6Ly93d3cuZnhzdHJlZXQuY29tL2FtcC9jcnlwdG9jdXJyZW5jaWVzL25ld3MvdG9wLTMtcHJpY2UtcHJlZGljdGlvbi1iaXRjb2luLWV0aGVyZXVtLXJpcHBsZS1tYXJrZXRzLXNob3ctb3B0aW1pc20tYWhlYWQtb2YtdXMtY3BpLTIwMjMwODA5MTg1Nw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 09 Aug 2023 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Cryptocurrency prices rally as markets anticipate US CPI - FXStreet",
        "content": "Share:\n\nBitcoin price could make a 5% run to $30,400 if it closes decisively above $30,259 or a pullback to demand zone.\n\nEthereum price coils up for a retest of the $1,836 to $1,806 demand zone unless bullish momentum propels it past the $1,887 hurdle.\n\nRipple price tests the 50-day EMA at $0.6591 as bulls look to breach the $0.6840 resistance level.\n\nCryptocurrency prices are rallying starting with Bitcoin (BTC) price, which is trading with a bullish inclination. With it, the rest of the altcoin category is flashing green, starting with Ethereum (ETH) and Ripple (XRP). It all comes ahead of the US Consumer Price Index (CPI), which has been scheduled for August 10 at 12:30 GMT.\n\nAccording to studies, the relationship between cryptos and US inflation is ultimately tenuous. Whilst there have been periods where cryptos appear to have been used as an inflation hedge, these are not consistent enough and too often contradicted to offer a robust correlation.\n\nThat said, if Thursday’s CPI reading causes market volatility it will probably spill over into crypto as there is evidence of a correlation with broader market volatility (as measured by the VIX). A big miss, therefore, could impact the big crypto. Ethereum (ETH) and Ripple (XRP), meanwhile, are both riding on this optimism, but it remains to be seen whether this is sustainable."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMilAFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3JpcHBsZXMtcGFydGlhbC12aWN0b3J5LWFnYWluc3QtdGhlLXNlYy10cmVhdGVkLWFzLWFtbXVuaXRpb24taW4ta29yZWFzLXRlcnJhLWx1bmEtdHJpYWwtMjAyMzA4MDgwNjMx0gGYAWh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9hbXAvY3J5cHRvY3VycmVuY2llcy9uZXdzL3JpcHBsZXMtcGFydGlhbC12aWN0b3J5LWFnYWluc3QtdGhlLXNlYy10cmVhdGVkLWFzLWFtbXVuaXRpb24taW4ta29yZWFzLXRlcnJhLWx1bmEtdHJpYWwtMjAyMzA4MDgwNjMx?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 08 Aug 2023 07:00:00 GMT",
        "title": "XRP price gears up for rally as Korea’s prosecutors rely on Ripple ruling for Terra LUNA trial - FXStreet",
        "content": "Share:\n\nKorean prosecutors in the Terra LUNA crash trial are intent on wielding Ripple’s partial victory against the SEC to substantiate their case.\n\nThe Ripple ruling was centered on XRP’s status as a security, while the Terra LUNA trial is focused on a similar concern.\n\nAuthorities are keen to leverage US court judgements to support their arguments that Terraform Labs’ sister tokens are not securities.\n\nRipple’s partial victory against a US financial regulator, through Judge Analisa Torres' has laid the foundation for leveraging the court ruling in other related cases in Korea.\n\nProsecutors in Terra LUNA’s trial in Korea are drawing leverage from the US court decision and plan on using the ruling to substantiate their arguments in court.\n\nAlso read: Hong Kong Securities Commission warns crypto exchanges against improper practices, derivatives trading\n\nXRP price is gearing for a rally\n\nAccording to a pro-XRP attorney John Deaton, XRP is on track to hit a new all-time high if Bitcoin bull market makes a comeback. Deaton is bullish on the altcoin's recovery and considers Bitcoin price rally is an important condition for XRP price to rally. Find out more about it here.\n\nRipple ruling in SEC case to substantiate Korean prosecutors’ arguments\n\nAccording to sources from the Seoul Prosecutor’s office, the Terra LUNA lawsuit is centered on the status of those tokens as “securities.” Prosecutors have revealed their plan to submit papers and judgements as evidence to prove that Terraform Labs’ sister tokens were not securities.\n\nChief Prosecutor Dan Seong-han of the Seoul Southern District Prosecutor’s Office states that the office has received a translation of the Ripple-related judgment from the Southern District Court of New York, requested by the Ministry of Justice.\n\nRipple’s partial victory against the SEC is considered key to substantiate prosecutor’s claims supporting LUNA’s status as a “non-security.”\n\nJudge Analisa Torres of the Southern District Court of New York ruled in favor of Ripple on July 13, to the effect that the “investment contract” status of XRP could not be recognized. This ruling is the one that is expected to raise concerns in the Terra LUNA trial.\n\nChief Prosecutor Dan said,\n\nThe ruling acknowledged that the sale of its own tokens by the Ripple issuer to receive investment from institutional investors was the sale of unregistered investment securities."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9ldGhlcmV1bS1yZWRkaXQtdG9rZW4tbW9vbnMtc29hcnMtb24ta3Jha2VuLWFmdGVyLTQ3MC1jcnlwdG8tY29tLWxhdW5jaC_SAWVodHRwczovL2NyeXB0b3BvdGF0by5jb20vZXRoZXJldW0tcmVkZGl0LXRva2VuLW1vb25zLXNvYXJzLW9uLWtyYWtlbi1hZnRlci00NzAtY3J5cHRvLWNvbS1sYXVuY2gvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 09 Aug 2023 07:00:00 GMT",
        "title": "Ethereum Reddit Token MOONS Soars on Kraken After 470% Crypto.com Launch - CryptoPotato",
        "content": "Moons’ name checked out on the price chart with a 72% gain by late Tuesday.\n\nMoons and Bricks are tokens Redditors earn from the user-generated content they post on Reddit. Kraken recently listed them, and they’re soaring in price on the San Francisco-based crypto exchange.\n\nMOONS Token Soars 72% after Kraken Listing\n\nKraken listed the decentralized tokens for spot and futures trading on Aug 7. Both Reddit coins are available for exchange with the USD and EUR, while Moons is up for perpetual futures contracts.\n\nBricks (BRICK) is an ERC-20 token used on the /r/Fortnite subreddit. Moons (MOON) is an ERC-20 for the /r/Cryptocurrency subreddit. Users can tip for posts or comments or spend them on subreddit marketplaces with these tokens.\n\nThe Fortnite and Cryptocurrencies subreddits have 610K and 308K members, respectively. They’ve apparently got some serious clout online. As rumors of a Kraken listing faded last month, Crypto.com’s Moons’ listing launched the coin 470% by Wednesday evening from that Sunday’s prices.\n\nApollo app should have started a crypto token named Moons.\n\nWhile the SEC continues to move aggressively against crypto exchanges in court, clearly not all online investor interest is feeling the chill.\n\nHere’s an interesting question that could help clarify matters in the ongoing debate over crypto’s classification: Are Moon and Brick tokens securities contracts, or digital artifacts of value, bought and sold in resale markets like eBay?\n\nEither way, the rally in Moon and Brick Reddit tokens shows strength for the social media company after a hectic summer. Subreddit communities closed shop to protest changes in API fees at Reddit. Last month an L1 social media blockchain even put out a $1M bounty for a decentralized Reddit.\n\nHowever well a blockchain alternative may do, it seems Reddit is pulling through."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiKmh0dHBzOi8vYml0Y29pbi5jb20uYXUvc29sYW5hLXZzLWV0aGVyZXVtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 09 Aug 2023 07:00:00 GMT",
        "title": "Solana vs Ethereum - Bitcoin Australia",
        "content": "In the vast world of cryptocurrencies, two giants stand out in the realm of smart contracts and dApps (that’s short for decentralised applications, by the way!): Solana and Ethereum. Imagine these two blockchain networks different brands of smartphones, each with its own cool features, user base, and unique quirks. While Ethereum has been around for a while and is like the OG iPhone of the crypto world, Solana is like the sleek new competitor that’s turning heads. So, if you’ve ever wondered how these two compare or which one might be better for your needs, you’ve come to the right place!\n\nShort Summary\n\nSolana vs Ethereum : Ethereum is like the legendary band with a massive following and long-standing reputation, while Solana is the breakout star impressing everyone with speed and affordability.\n\nConsensus Mechanisms : Both cryptocurrencies have adopted the “proof of stake” system, a greener and more efficient method of confirming transactions, moving away from the energy-intensive “proof of work.”\n\n: Both cryptocurrencies have adopted the “proof of stake” system, a greener and more efficient method of confirming transactions, moving away from the energy-intensive “proof of work.” Costs, Speed, and Security: While the Solana network boasts faster speeds and lower fees, Ethereum takes the lead in decentralisation and security, offering a more tried-and-true system that’s earned users’ trust over the years.\n\nContents\n\nUnderstanding the Ethereum Blockchain\n\nEthereum is like this super cool digital playground where developers can create and run their own games (or apps) using something called “smart contracts.” Think of these smart contracts as self-executing rules—like if you do A, then B will automatically happen. The Ethereum network has been around since 2015, making it one of the OGs in the crypto scene. It’s not just about trading coins; it’s more about building a whole new digital universe. And, just like any popular game, it has tons of players (users) and developers adding new stuff all the time!\n\nUnderstanding the Solana Blockchain\n\nImagine if Ethereum was the classic video game everyone knew and loved, and then Solana comes in like the hot new sequel with faster levels and cooler graphics. Solana is also a place where developers can build games (or, you know, apps) using smart contracts, just like Ethereum. But here’s the kicker: the Solana network claims to be super speedy and can handle loads of transactions in a jiffy without slowing down or costing you a ton in fees. Think of it like playing a game with zero lag, even if everyone in school is playing at the same time. It’s newer to the scene than Ethereum, but it’s quickly gaining fans because of its performance perks.\n\nComparing Consensus Mechanisms\n\n“Consensus mechanisms” is just a fancy term for how cryptocurrencies like Solana and Ethereum agree on stuff (like confirming transactions). Think of it like a classroom vote on where to go for a field trip. In the early days, Ethereum used something called “proof of work,” which is kind of like everyone in class doing a ton of math problems to vote (yeah, super energy-consuming!). But now, both Ethereum and Solana use “proof of stake” to process transactions. In this method, instead of doing math problems, it’s like the kids with the most candy (or coins) get a bigger say in the vote. It’s way less energy-hungry and faster. Both systems have their pros and cons, but proof of stake is seen as the greener, more efficient choice, and that’s what both our crypto stars are rocking now!\n\nSpeed and Scalability\n\nWhen we talk about “Speed and Scalability,” think about it like the difference between a regular skateboard and a high-speed electric one. Both can get you around, but one’s going to do it faster and can handle more bumps in the road. In the crypto world, speed means how quickly transactions happen (transaction speed), and scalability is about how a system deals when tons of people start using it at once. Even though both Ethereum and Solana use “proof of stake” (remember, that’s the cool new voting system with the candy), Solana is often praised for being the speedier skateboard. It’s designed to have very fast transaction speeds without getting clogged up. Ethereum’s no slouch, but there have been times when it got overwhelmed and slowed down, like a popular game server on launch day. Both are working hard to improve, but for now, Solana’s got the edge in the speed department.\n\nDecentralisation and Security\n\nImagine a school project: if the whole grade participates, no one person can dominate or mess things up, right? This is kinda how Ethereum rolls. It’s like a big group project where loads of participants (called nodes) make sure everything’s legit. This means no single person or group has too much power. Now, Solana, on the other hand, has had instances where a smaller group (around 30 validators) held a big chunk (like 35%) of the influence. Think of it as if just a few kids in class had most of the markers and paper. There’ve been times when Solana’s system has had hiccups or outages, kind of like a game crashing unexpectedly. While Ethereum has been more like that reliable old game that rarely glitches. So, even if Solana might save you some digital coins with its lower fees, Ethereum’s been around the block and has that trusty, decentralised vibe which adds an extra layer of safety for folks investing their cash. Always good to remember: cheaper isn’t always better if you’re skipping out on some key safety features!\n\nCosts and Fees\n\nThink of this like choosing between two streaming services. One might have all the top shows and is super popular, but man, the monthly fee is kinda steep. The other is newer, has some cool features, and is easier on your wallet. Ethereum, being the popular kid on the block, has had moments where its transaction costs (they call them “gas fees”) shoot up like crazy, especially when everyone’s trying to use it at the same time. On the flip side, Solana tends to be the budget-friendly option with low transaction fees. It’s kinda like getting a decent streaming service for half the price. Both use “proof of stake”, which should help with costs in the long run, but for now, if you’re looking to save some digital dough, Solana might be your go-to. But, as with any deal, always check what you’re getting for the price!\n\nMarket Capitalisation and Adoption\n\n“Market Capitalisation and Adoption” might sound super fancy, but let’s break it down. Imagine two bands: one’s been on the charts for years, has tons of loyal fans, and sells out stadiums. The other is the breakout star of the year, super hot right now, but still building its fan base. Ethereum is like that legendary band. It’s been around, has a massive value (that’s the “market capitalisation” part), and loads of people and businesses use it. Solana, the new hitmaker, is gaining fans fast and has a growing value, but it’s not quite at Ethereum’s superstar level yet. Both being on “proof of stake” means they’re keeping up with the modern beats, but in terms of sheer sise and popularity, Ethereum’s still got the bigger fan club. However, as with any new sensation, Solana’s making waves and might just surprise everyone in the future.\n\nSummary\n\nLet’s wrap this up! Ethereum’s been a big player in the crypto world for a while, known for its strong decentralisation, security, and huge market value. But its fees can sometimes be a bummer. On the other hand, Solana’s the newer kid on the block, impressing everyone with its speed and lower costs. However, it’s had a few hiccups with reliability. Both are using the “proof of stake” method, which is like a green, efficient way to run things. As for what the future holds? Well, both are cooking up cool upgrades to get even better. At the end of the day, they’ve both got their strengths and challenges, so it really comes down to what you value most in your crypto adventure!\n\nFrequently Asked Questions\n\nWill Solana surpass Ethereum?\n\nIt’s a hot topic! The crypto world is ever-evolving, and while Ethereum has held a dominant position for a while, Solana’s been making waves with its features and performance. Predicting the future of cryptocurrencies is always tricky, so it’s hard to say definitively. What’s for sure is that both have unique strengths and are pushing boundaries in their own ways.\n\nWhy use Solana instead of Ethereum?\n\nThere are several reasons one might lean towards Solana. It boasts faster transaction speeds and generally has lower transaction fees compared to Ethereum, especially during peak times. If you’re into developing applications or just making transactions, and speed and cost are your top priorities, then Solana might be a good fit for you. But, as always, it’s essential to research and figure out what suits your needs best.\n\nWhat are the main differences between Ethereum and Solana?\n\nAt their core, both Ethereum and Solana allow for decentralised apps and smart contracts. But here’s a quick breakdown:\n\nSpeed: Solana often has faster transaction speeds. Fees: Solana typically offers lower transaction fees. Decentralisation & Security: Ethereum has a more decentralised network, which some argue provides better security. Adoption: Ethereum, being older, has a wider user base and more applications built on its platform. Solana, while newer, is growing rapidly. Consensus Mechanism: As of this writing, both use proof of stake, but they arrived there differently with Ethereum transitioning from proof of work.\n\nWhich platform has lower transaction fees?\n\nSolana usually has lower transaction fees compared to Ethereum, especially during high-traffic times. This can be a significant advantage for those looking to minimise costs during transactions or when deploying applications. However, as the crypto landscape is dynamic, it’s a good idea to stay updated on fee structures and trends."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tYXMtZXRoLWJ1cm5lZC1zaW5jZS10aGUtbWVyZ2UtcmVhY2hlcy1hbGwtdGltZS1oaWdoL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 08 Aug 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction As ETH Burned Since The Merge Reaches All-time High - Analytics Insight",
        "content": "Ethereum (ETH) price is practically unchanged with a mere 0.14% increase over the last 24 hours. The amount of ETH burned since “The Merge” has reached all-time high but has done little to spark optimism among the investors.\n\nThe Ethereum network has burned more than 50% of all the ETH issues since “The Merge ” event that saw Ethereum migrate from a proof-of-work consensus mechanism to the proof-of-stake on the Beacon chain.\n\nAccording to data from Ultra Sound Money, the network has burned over 3.5 million ETH out of 6.5 million issued over the two years after Ethereum’s EIP-1559 was introduced.\n\nWith the current rate, Ethereum is burning approximately 1.75 million ETH each year, resulting in a supply reduction of about 0.98%. From a technical perspective, the platform is gradually shifting towards a deflationary nature as the circulating supply of ETH diminishes over time due to active coin burns within the network.\n\nThis is in turn expected to increase the demand for the largest altcoin by market capitalization. In the meantime, ETH price is at risk of more losses as areas around the $1,700 demand zone come into the picture.\n\nEthereum Price At Risk of a 7% Decline\n\nBetween July 14 and August 8, the ETH price action has formed a descending triangle pattern on the daily chart. This pattern is characterized by a sequence of lower highs and relatively stable lows, reflecting a negative market sentiment. If Ether’s price closes below the horizontal line of the triangle at $1,823, it would indicate a potential continuation of the on-going downtrend.\n\nIn such a scenario, the price of the smart contracts pioneer token could drop lower with the immediate support level situated at the $1,800 psychological level.\n\nAn added layer of support is anticipated to emerge from the 200-day Simple Moving Average (SMA) at $1,788, preceding the price reaching the technical target of the current chart pattern at $1,700. Such a movement would lead to a cumulative loss of 7.23% from the current price.\n\nETH/USD Daily Chart\n\nSupporting the bearish case for the Ethereum price is the Moving Average Convergence Divergence (MACD) indicator and the Relative Strength Index (RSI) which exhibited downward trends. The RSI value of 42 indicated the dominance of bearish sentiment in the ETH price trend.\n\nOn the positive side, bullish momentum would require pushing Ether’s price above the descending triangle, necessitating a daily candlestick closure above the resistance line at $1,852, embraced by the 50-day SMA. Beyond this point, a formidable supply zone spans between $1,880 flanked by the 100-day SMA and the $1,900 psychological level.\n\nBreaking this barrier would validate a bullish breakout from the triangle, with the bulls then targeting the significant resistance at $1,960, followed by the psychological threshold of $2,000.\n\nThis could be where Ether’s upside could be capped for the short term.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMi0wFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9ob3ctdG8tcHJlZGljdC1mdXR1cmUtY3J5cHRvLXByaWNlcy10aGUtYmVnaW5uZXJzLWd1aWRlLXRvLWNyeXB0by1jcnlzdGFsLWJhbGxpbi1hbmQtcHJpY2UtcHJlZGljdGlvbnMtb2YtYml0Y29pbi1ldGhlcmV1bS1hcGVtYXgtZG9nZWNvaW4tc2hpYmEtaW51LXBlcGUtY29pbi13b3JsZGNvaW4tYW5kLW1vcmUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 08 Aug 2023 07:00:00 GMT",
        "title": "How to Predict Future Crypto Prices? The Beginners Guide to Crypto Crystal Ballin' and Price Predictions of Bitcoin ... - Analytics Insight",
        "content": "Ever wondered if there’s a magic crystal ball out there that can predict the prices of cryptos like Bitcoin, Ethereum, Solana, Dogecoin, and that ever-adorable Shiba? Dive in, as we untangle the crypto spaghetti and shed some light on the new sensation: ApeMax! When you’re done reading this guide, you will have a complete understanding of what you can and cannot predict in cryptocurrencies and how to make sense of the many crypto price predictions out there.\n\nLet’s dive deep into the goldmine of research from all corners of the crypto world and get a grip on the wild ride of crypto price predictions. Jump in, folks!\n\nComplete List of Top Crypto Predictions\n\nBelow are the burning questions and topics that crypto analysts and experts are noodling over right now.\n\nMarket Volatility: Bitcoin’s nudging that resistance level of $30,000 again. Feels like some recovery vibes, right? But hold onto your digital hats – is this genuinely the start of a bounce-back, or are other factors lurking around the corner, ready to mess with the market mood in upcoming months?\n\nBitcoin’s nudging that resistance level of $30,000 again. Feels like some recovery vibes, right? But hold onto your digital hats – is this genuinely the start of a bounce-back, or are other factors lurking around the corner, ready to mess with the market mood in upcoming months? Apemax’s Performance: The ApeMax presale has been blowing up, catching lots of eyes. And why? Because ApeMax ain’t just another coin—it’s mixing serious staking utility with some good ol’ meme coin vibes. So, the question is: Should we be keeping ApeMax on our “crypto to watch” radar?\n\nThe ApeMax presale has been blowing up, catching lots of eyes. And why? Because ApeMax ain’t just another coin—it’s mixing serious staking utility with some good ol’ meme coin vibes. So, the question is: Should we be keeping ApeMax on our “crypto to watch” radar? Regulatory Buzz: Everyone in the crypto space is keen for some clear rules, right? There’s a bunch of changes happening worldwide, and yep, they’re gonna shake things up for cryptos. While some countries are giving cryptos a big thumbs up, others? Not so much. So the million-dollar question: where’s all this heading? It’s got the whole crypto crew talking.\n\nEveryone in the crypto space is keen for some clear rules, right? There’s a bunch of changes happening worldwide, and yep, they’re gonna shake things up for cryptos. While some countries are giving cryptos a big thumbs up, others? Not so much. So the million-dollar question: where’s all this heading? It’s got the whole crypto crew talking. Macroeconomic Vibes: So, with stuff like the dollar dipping and rate hikes hitting the pause button, what’s it doing to the global crypto scene? Is Bitcoin (and the crypto gang) getting a boost from all these shake-ups?\n\nSo, with stuff like the dollar dipping and rate hikes hitting the pause button, what’s it doing to the global crypto scene? Is Bitcoin (and the crypto gang) getting a boost from all these shake-ups? Looking Ahead: So here’s the lowdown: Some crypto gurus reckon Bitcoin might steal the show in 2023 and 2024, thanks to that halving event and more folks hopping on board. But on the flip side, there’s chatter about potential dips, all because of those pesky rising interest rates and stricter money moves. Bottom line? The crypto rollercoaster ain’t stopping anytime soon. Hold onto your hats!\n\nApeMax: The Talk of Crypto-Town\n\nIn case you’ve been living under a rock and haven’t heard of ApeMax yet, here’s a quick look. ApeMax ain’t your average crypto, it’s rocking some fresh tokenomics and spicing things up with a touch of meme coin madness. With ApeMax, you can stake on stuff you’re into and maybe pocket some rewards. They call it the “Boost-to-Earn” and guess what? It’s in play straight from the start, even during the presale party!\n\nWhat’s this ApeMax Presale buzz?\n\nThe ApeMax Presale is on, and you can grab some ApeMax tokens right now on their website. Heads up, though: the price ticks up a notch every day. And for you eager beavers? There are some early bird discounts tucked inside loot boxes. Folks are chattering about this hot crypto presale, so it’s a cool chance to get the 411 on ApeMax!\n\nAre Crypto Predictions Fact or Fiction?\n\nNow, let’s spill the tea. If we knew the exact trajectory of cryptos, we’d all be sipping pina coladas on a private island. The world of price predictions is a mixed bag of data analysis, gut feelings, and let’s face it, a bit of wishful thinking. But here’s what’s cool: Whether you’re team #HODL or just crypto-curious, there’s never a dull moment.\n\nWhat about AI and Crypto Predictions?\n\nTech heads are unleashing AI tools in the quest to predict crypto moves. From parsing tweets to analyzing market patterns, these digital soothsayers like Augur and Endor are on the case. Yet, they’re not infallible. Remember, with cryptos, the only guarantee is volatility.\n\nWhy is it so hard to make good crypto predictions?\n\nLook, calling the crypto game ain’t easy. Why? First, it’s wild out there with all the ups and downs – that’s volatility for you. Then, toss in a salad of stuff like what the big suits say (regulatory news), shiny tech upgrades, how the crypto crowd feels, and even the big world money moves. And, don’t forget, big names like Bitcoin don’t sleep – they’re always on, so who knows when the next curveball comes? Plus, let’s be real: crypto is still the new kid on the block. So, we’re kinda learning as we go without much past info to guide us.\n\nFinal Words from the Wise: Tread Carefully with Crypto, Folks!\n\nLet’s not sugarcoat it: the crypto world’s got its risks, and they’re big ones. We’re talking about serious volatility and unpredictability here. So, if you’re thinking of diving into the crypto pool, you’d better double-check the depth first. Always do your homework—like, deep-dive research—and know the risks before you part with your cash. And hey, a heads up for our friends in the US, Canada, and some other places: ApeMax is not available in your countries. Best to hit up the ApeMax official site to see where the no-go zones are. Stay safe and savvy out there!\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZW4uZXRoZXJldW13b3JsZG5ld3MuY29tL2N1cnZlLWRlZmktZmlyc3QtcmVzcG9uZGVyLXRlbGVncmFtLWJvdC_SAU1odHRwczovL2VuLmV0aGVyZXVtd29ybGRuZXdzLmNvbS9jdXJ2ZS1kZWZpLWZpcnN0LXJlc3BvbmRlci10ZWxlZ3JhbS1ib3QvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 08 Aug 2023 07:00:00 GMT",
        "title": "Curve Incident Spurs DeFi First Responder Telegram Bot - SEAL 911 - Ethereum World News",
        "content": "Auditors, security experts, and white hat hackers are banding together after Curve’s $73.5 million hack to provide emergency assistance.\n\nThe working solution spearheaded by Paradigm’s head of security Sam (@samczsun) is a telegram bot called SEAL 911.\n\nSam explained that SEAL 911 could tackle the hardest part of responsible disclosure during high-pressure crypto hacks.\n\nParadigm research partner and head of security, Sam (@samczsun), unveiled a joint effort between auditors, security professionals, and white hat hackers aimed at providing assistance during crypto hacks.\n\nThe working solution – a telegram bot – arrives amid multi-million rescue missions for Curve Finance, one of DeFi’s largest exchanges which was recently exploited for $73.5 million in cryptocurrencies.\n\nAccording to Sam, SEAL 911 allows anyone to contact a professional from a pool of veteran security experts in emergency situations. The list includes experts from MetaMask, ConsenSys, Peckshield, Polygon, Origin Protocol, Wintermute, Paradigm, and Yearn to name a few.\n\nOver the past few days I’ve been working with a group of whitehats, auditors, and other security leaders to try and solve the hardest part of responsible disclosure: finding the right person to talk to. – Sam (@samczsun) on Twitter.\n\nThe initiative hopes to provide vetted assistance during hacks, and potentially mitigate losses from decentralized finance protocols.\n\nCurve Recovers Loot From Vyper-Pool Exploit\n\nDeFi’s community remains watchful even as Curve Finance recovers almost 75% of exploited liquidity. CRV’s price dropped along with TVL on Ethereum’s DeFi scene after attackers leveraged a reentrancy vulnerability to steal millions from crypto pools on Curve’s decentralized exchange.\n\nOver a week later, the DEX recovered $52.3 million out of $73.5 million stolen in late July/early August. CRV’s price also buoyed back to 60 cents after dropping to 49 cents following the exploit.\n\nCurve is offering 10% of the outstanding funds – worth $1.8 million – as a bounty in return for information about the exploiter."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMikgFodHRwczovL2ZhY3RseS5pbi90aGlzLXB1cnBvcnRlZC10aGUtaW5kaWFuLWV4cHJlc3MtYXJ0aWNsZS1yZXBvcnRpbmctYS1uZXctY3J5cHRvY3VycmVuY3ktaW52ZXN0bWVudC1zYWlkLXRvLWJlLXByb21vdGVkLWJ5LWdhdXRhbS1hZGFuaS1pcy1mYWtlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 08 Aug 2023 07:00:00 GMT",
        "title": "This purported ‘The Indian Express’ article promoting investments by prominent businessmen is fake - Factly",
        "content": "Update (08 August 2023):\n\nAnother post sharing an URL and the screenshot of a purported article published by ‘The Indian Express’ is being shared on social media claiming that Infosys Co-Founder Narayana Murthy, a Co-Founder and Former CEO of Infosys, launched a new trading platform that will help every citizen of India to have stable passive income.\n\nBut the URL shared in the post leads to a dubious phishing website as it is different from the URL of ‘The Indian Express’. ‘The Indian Express’ did not publish any such article reporting a new trading platform said to be announced by Narayana Murthy. On searching for further details regarding this fake website, we found that this fake website with the domain name ‘https://indian-expresslive.com/’ was registered on 02 June 2023. The Registrar’s name was mentioned as ‘NameCheap, Inc’.\n\nUpdate (17 April 2023):\n\nAnother post sharing an URL and the screenshot of a purported article published by ‘The Indian Express’ is being shared on social media claiming that Nandan Nilekani, an Indian Businessman and co-Founder of tech giant Infosys, had invested Rupees 892 Million in a new trading platform to make ordinary people richer. But the URL shared in the post directs to an unrelated article published by ‘The Indian Express’ on 28 April 2022. The article reported about Nandan Nilekani’s new ambitious goal of helping PM Narendra Modi in building an open network system that can create a freely accessible online system where traders and consumers can buy and sell everything online.\n\nAccording to the article, the objective behind this initiative is to eventually curb the online domination of Amazon and Walmart-owned Flipkart e-commerce sites. The article did not report anything about Nandan Nilekani investing in any new trading platform to help poor people in the country.\n\nDenying these social media rumours about him launching a crypto project, Nandan Nilekani in a tweet on 15 February 2022 stated-“You may have encountered a post on various social media platforms claiming that I have launched a crypto project. This is #fakenews! Please avoid clicking on it and report it as misleading/false information on the platform where you see it.” Several news websites have published articles reporting Nandan Nilekani’s clarification about these false claims about him launching a crypto project to help poor people.\n\nYou may have encountered a post on various social media platforms claiming that I have launched a crypto project. This is #fakenews! Please avoid clicking on it and report it as misleading/false information on the platform where you see it. — Nandan Nilekani (@NandanNilekani) February 15, 2022\n\nUpdate (09 October 2022):\n\nAnother post with a similar phishing URL of a purported article published by ‘The Indian Express’ that talks about a special report on Mukesh Ambani’s secret investment is being shared on social media. But, as explained below, ‘The Indian Express’ did not publish any such articles reporting such a new cryptocurrency investment promoted by prominent personalities.\n\nPublished (11 September 2022):\n\nA post sharing an URL of a purported article published by ‘The Indian Express’ is being shared on social media claiming that thousands of people were raking in millions of rupees in a new cryptocurrency investment that is said to be advised by the Indian Business Tycoon Gautam Adani. This purported article reported that Gautam Adani, during an interview with Sonal Mehrotra Kapoor on Good Morning India, advised people to invest in a new cryptocurrency auto-trading program called Ethereum Code, for making money in a short time. Let’s verify the claim made in the post.\n\nClaim: ‘The Indian Express’ article that reported a cryptocurrency investment suggested by Gautam Adani.\n\n\n\nFact: The purported ‘Indian Express’ article shared in the post is from a dubious & fake website. ‘The Indian Express’ did not publish any such article reporting such a new cryptocurrency investment promoted by Gautam Adani. Gautam Adani did not promote Etherium Code cryptocurrency in any of his interviews. Hence, the claim made in the post is False.\n\nOn carefully observing the purported article shared in the post, one can see the masthead of the purported article stating ‘The Indian Expres’, which is different from the ‘The Indian Express’ masthead printed on the original news website. Further, the URL shared in the post indicates that it leads to a dubious phishing website as it is different from the URL of the ‘Indian Express’. Also, we could find several grammatical errors in the purported article shared in the post.\n\nOn searching for further details regarding this fake website, we found that this fake website with the domain name ‘rsnmdfgh5l.digital’ was registered on 12 May 2022. The Registrar’s name was mentioned as ‘NameSilo, LLC. The registrar contact organization was mentioned as ‘See PrivacyGuardian.org’. On opening the home page of this website, it states, ‘We’re Coming Soon.. We’re working on our new website. Join our newsletter and get notifed’. So, it can be confirmed from all these details that the purported Indian Express article shared in the post is published by a dubious website.\n\nWhen we searched to check whether ‘The Indian Express’ had published any such article reporting the new cryptocurrency investment said to be advised by Gautam Adani, we could not find any such news report on the official website of ‘The Indian Express’. Earlier, ‘The Indian Express’ through the tweets clarified about similar fake articles attributed to the Indian Express on social media. We could not find any video of Money-control Editor, Sonal Mehrotra Kapoor, interviewing Adani Group Chairman Gautam Adani. Also, when we searched to check whether Gautam Adani had advised people to invest in Ethereum, we could not find any news report confirming this information.\n\n#FakeNewsAlert | A website called https://t.co/e4FzYarnIt has posted a story trying to look like an https://t.co/XYlZoUMMsK page. This has nothing to do with The Indian Express and is a misuse of our masthead. pic.twitter.com/smZurJsXmA — The Indian Express (@IndianExpress) September 4, 2021\n\nEthereum Code is a dubious cryptocurrency trading platform that asks users to provide names and e-mail addresses to join the community. From all these pieces of evidence, it can be concluded that the purported Indian Express article shared in the post is fake.\n\nTo sum it up, this purported Indian Express article reporting a new cryptocurrency investment said to be promoted by Gautam Adani is fake."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNyeXB0by1uZXdzLWZsYXNoLmNvbS9zb2xhbmEtdHZsLXNvYXJzLW91dHBlcmZvcm1zLWV0aGVyZXVtLWJzYy1hbmQtYXZhbGFuY2hlLXdpdGgtMTQtZ3Jvd3RoL9IBb2h0dHBzOi8vd3d3LmNyeXB0by1uZXdzLWZsYXNoLmNvbS9zb2xhbmEtdHZsLXNvYXJzLW91dHBlcmZvcm1zLWV0aGVyZXVtLWJzYy1hbmQtYXZhbGFuY2hlLXdpdGgtMTQtZ3Jvd3RoLz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 09 Aug 2023 07:00:00 GMT",
        "title": "Solana TVL Soars: Outperforms Ethereum, BSC, and Avalanche with 14% Growth - Crypto News Flash",
        "content": "Solana outperforms the likes of Ethereum and Binance Smart Chain in Total Value Lock (TVL) while maintaining 100 percent average uptime for six straight months.\n\nIts active user count has, however, declined by 5 percent in the last 30 days.\n\nSolana (SOL) makes incredible progress in the crypto-sphere as its network activities boom and outperform industry giants. According to data, Solana recorded a 14 percent surge in its Total Value Locked (TVL) last month. This signifies a bounce back from the severe decline recorded last year following several downtimes and the seven major exploits that hit the chain.\n\nThe TVL of Solana started the year with $209.25 million. Since then, there has been an increase of 217 percent to hit $664 million as of press time. Interestingly, the heavyweight L1 networks like Ethereum, Binance Smart Chain, and Avalanche declined by 13 percent, 6 percent, and 10 percent respectively when Solana recorded an uptick last month.\n\nThe negative growth of TVL is not limited to layer 1 solutions as Arbitrum, a Layer 2 scaling solution also fell by 7 percent last month. Optimism, however, defied the odds to make a 10 percent surge in its TVL last month.\n\nA careful observation of the Solana network shows a contradictory movement of its users’ activity within the period.\n\nSolana Active User Count and SOL Price Performance\n\nAccording to Token Terminal, there was a 5 percent decline in active user count in the past 30 days. This means no major improvement has been recorded since last year’s downtimes and exploits. In the past 180 days, the daily active user count has fallen by 15 percent.\n\nIn the last 12 months, it has recorded a whopping 50 percent fall. Just last week, the number of active user activity reduced by 1.6 percent due to the declined trading volume across the decentralized exchanges on the chain. It was also observed that zkSync, which has very low TVL, surpassed Solana in Decentralized Exchange (DEX) trading Volume in the period under review.\n\nSolana, however, had other surges apart from TVL. It’s transaction fee and network revenue recorded a surge. According to Solscan, network fees imposed on successful non-vote transactions moved to a high of 53.06 SOL on August 2. Compared to 31.64 SOL recorded last month, this is a significant growth in network fees. This is said to be a general issue as all network fees spiked by 50 percent last month. On a year-on-year basis, L1’s revenue surged by 21 percent.\n\nSolana recorded a 100 percent average uptime each month in the past six straight months and is said to be a contributing factor to the growth. Since this was a major issue last year as it eroded trust and raised concerns about the stability of the network, the current development appears as good news.\n\nIn other areas, Solana recorded an impressive $24.7 million in daily transactions as of June, surpassing Ethereum which only got half of Solana’s numbers.\n\nThe native token (SOL ) is doing equally well; it surged by 19 percent in the last 30 days and recorded a 5.5 percent surge in the last seven days. Its 24-hour growth is also 5.6 percent, pushing the price to $24.75 as of press time. Regardless, Solana is still down by 90 percent from its all-time high of $259.96.\n\nThis article is provided for informational purposes only and is not intended as investment advice. The content does not constitute a recommendation to buy, sell, or hold any securities or financial instruments. Readers should conduct their own research and consult with financial advisors before making investment decisions. The information presented may not be current and could become outdated."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZmluYm9sZC5jb20veHJwLW1ha2VzLW92ZXItMS1taWxsaW9uLXRyYW5zYWN0aW9ucy1kYWlseS1oZXJlcy13aHktaXQtbWF0dGVycy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 09 Aug 2023 07:00:00 GMT",
        "title": "XRP makes over 1 million transactions daily; Here's why it matters - Finbold - Finance in Bold",
        "content": "Both the XRP Network (XRP) and the Ethereum Network (ETH) are among the most used crypto networks, considering the daily number of transactions being carried out in Ripple’s public ledger and Ethereum’s blockchain. A metric that reflects the demand for their technologies.\n\nOn August 8, data retrieved by Finbold from BitInfoCharts shows that there were close to 1.28 million daily transactions on XRP Ledger, as opposed to 1.09 million for Ethereum. Bitcoin (BTC), the leading cryptocurrency, lies far behind with circa 0.33 million transactions taking place on its blockchain.\n\nThe competition for ‘the most used network’ in the number of transactions is fierce — coming from a long date. Both XRP and Ethereum have their shining moments, but the first saw a drop in July that is now mostly recovered.\n\nBitcoin, Ethereum, XRP Transactions historical chart. Source: BitInfoCharts\n\nStill, according to current data, the XRP Network has done an average of 53,330 transactions per hour in the last 24 hours, while the Ethereum Network accomplished an average of 45,900 transactions per hour. The Bitcoin Network gets an average of 17,288 per hour.\n\nTransactions volume for XRP, ETH, and BTC\n\nHowever, the situation reverses for the volume being sent in the same period:\n\nBitcoin: 280,266 BTC ($8.35 billion) — 1.44% market cap\n\nEthereum: 992,507 ETH ($1,84 billion) — 0.7812% market cap\n\nXRP: 749,743,000 XRP ($0.48 billion) — 1.41% market cap\n\nBitcoin is the leader both in US dollar (USD) volume and percentage of the market cap; while XRP loses to Ethereum in USD volume, but gets really close to BTC when weighted by market value. The 24-hour transactions volume for the XRP Ledger was gathered from Blockchair, as BitInfoCharts didn’t provide this metric.\n\nXRP price analysis\n\nMeanwhile, XRP is, by press time, changing hands at the price of $0.64, registering an increase of 4.60% on the day.\n\nThis is a price range that has been kept since the beginning of August. On July 13, XRP saw a massive pump from $0.47 to $0.81 (+72%) but is steadily retracing to the current zone.\n\nTaking into account a similar demand for the number of transactions, and a superior demand for transaction volume weighted by market cap, 1 XRP would be worth $2.24 if its network had the same fully diluted market capitalization as Ethereum.\n\nAll things considered, the digital asset’s ability to meet these expectations will depend on further developments related to XRP and Ethereum, as well as the general sentiment on the wider crypto and macroeconomic landscape.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDgvMDkvcGFuY2FrZXN3YXAtcHJvdGVjdGlvbi1hZ2FpbnN0LW1ldi1ldGhlcmV1bS1ibG9ja2NoYWluL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 09 Aug 2023 07:00:00 GMT",
        "title": "PancakeSwap: protection against MEV on the ethereum Blockchain - The Cryptonomist",
        "content": "Decentralized trading platform PancakeSwap has announced a partnership with software development company BloXroute to implement protection against the unwanted presence of Mev bots on the Ethereum blockchain.\n\nMev bots play a key role in Ethereum’s transaction architecture by creating a homogeneous marketplace at the price level, yet they are often the root cause of front-run attacks against the end user.\n\nWith this new feature, the user experience should take a huge step forward, going to make the DeFi world more efficient and transparent.\n\nEthereum: What are Mev bots?\n\nWhen talking about the internal structure of Ethereum block validation we cannot avoid mentioning the so-called Mev bots, which play a very important role nowadays.\n\nWithout falling into complex terminologies, we can describe these bots as a state-of-the-art technique that exploits the sorting of transactions during the process of block verification by a validator to go speculating on price slippage during trading on DEXs such as PancakeSwap.\n\nThe term “MEV” stands for “Maximum Extractable Value” and is intended to represent all those techniques aimed at maximizing the profit of these individuals (who run specialized bots and software) involved in handling transactions on Ethereum from the mempool to the final inclusion within a block.\n\nFront-run attacks are where mev bots are able to profit most: by choosing to include, omit, or reorder certain TXs in a block, the mev can place OWN ORDERS in advance of others and gain from the impact generated on prices at the expense of other users.\n\nOther instances of gain for mevs involve arbitraging the value of an asset across different decentralized markets and liquidating borrows in lending platforms.\n\nAll of this harms the experience of the end user who will have to deal with high price slippage and the risk of being frontrunners.\n\nAt the same time, the presence of these bots helps marketplaces based on AMM mechanisms to level asset prices across different platforms, avoiding price discrepancies and enabling more efficient lending activity on DeFi.\n\nPancakeSwap and the partnership with bloXroute: a protection against Ethereum mev bots\n\nThe decentralized exchange PancakeSwap has found a solution by partnering with the technology company bloXroute to prevent Mev bots from practicing front run attacks against its users on the Ethereum blockchain and BNB chain.\n\n🤝bloXroute is excited to partner with @pancakeswap to help DeFi traders on #BSC and #Ethereum.\n\n\n\n😃bloXroute’s Protect RPC integration into PancakeSwap will give users free access to private transactions and industry leading inclusion rates for secure and efficient trading.\n\n\n\n1/4 pic.twitter.com/QdYxB48cL0 — bloXroute Labs (@bloXrouteLabs) August 8, 2023\n\nIn particular, those who trade cryptocurrencies on the DEX will be able to access bloXroute’s RPCs for free, helping them to get better price execution on their swaps.\n\nThese RPCs ensure that TXs sent through them are not visible in the mempool, thus preventing a Mev bot from identifying a profit opportunity and swapping the sorting of a block at will.\n\nIn the previous version of MEV Protect RPC on BNB Chain, the protection rate offered by bloXroute on PancakeSwap was 85% while with the latest update, full coverage will be possible.\n\nThe feature requires less than a minimum to be enabled on a non-custodial wallet like Metamask and can generate large economic benefits for the end user.\n\nRegarding the news, PancakeSwap’s head chef Mochi stated that:\n\n“PancakeSwap is pleased to work with a leading industry partner bloXroute, to protect our users from MEV activities such as front-running and sandwich attacks. This collaboration aims to maximize the value our users receive.”\n\nFor the DeFi world to compete with centralized crypto service providers, it is critical that when a user performs a swap, the process is easy, fast, inexpensive, and with real-time pricing reference.\n\nIn and of itself, this niche market presents significant risks related to hacks and exploits of decentralized platforms: if there are not constant improvements in the way individuals approach executing transactions it is safe to assume that decentralized finance will never reach mass adoption.\n\nThis partnership between Pancakeswap and bloXroute is precisely aimed at improving the efficiency of DeFi environments and making the user experience more enjoyable.\n\nBloXroute Labs and research in the crypto space\n\nBloXroute represents one of the most prominent blockchain software development companies in the crypto industry with a very strong presence and commitment to the Ethereum ecosystem.\n\nThe Chicago-based tech startup aims to take trading on decentralized exchange platforms to another level.\n\nThrough its blockchain distribution (BDN) and hyper-connectivity on Ethereum, BNB Chain, Polygon and Solana, the BloXroute team is able to offer low-latency DeFi with protection against Mev and price manipulation.\n\nAbout 350 trading firms in the decentralized finance world take advantage of BDN infrastructure to get faster and more efficient data that can offer a high inclusion rate and more competitive transaction propagation.\n\nOf note, about 40% of the volume running on Ethereum travels through BloXroute’s relayers and more than 500,000 validators connected to it.\n\nIn recent months the company has focused on the world of Mev-bots and devising a solution to prevent sandwich/front-run attacks without damaging the Ethereum ecosystem.\n\nIn this regard, during the last ECC in Paris, the Chicago-based company’s CEO, Uri Klarman, presented a solution called “Instant Inclusion Ethereum” (iiETH) that allows for real-time blockchain inclusions of transactions with protection against Mev-attacks.\n\nBelow you can find his speech during the conference explaining this innovation:"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiowFodHRwczovL3RoZWN1cnJlbmN5YW5hbHl0aWNzLmNvbS9hbHRjb2lucy9jcm9ub3MtYmxvY2tjaGFpbi11bnZlaWxzLXRlc3RuZXQtbGF1bmNoLW9mLWlubm92YXRpdmUtY3Jvbm9zLWV4cGxvcmVyLWZvci1lbmhhbmNlZC1ldGhlcmV1bS1hbmQtY29zbW9zLWludGVncmF0aW9uLTYzMTg50gGnAWh0dHBzOi8vdGhlY3VycmVuY3lhbmFseXRpY3MuY29tL2FsdGNvaW5zL2Nyb25vcy1ibG9ja2NoYWluLXVudmVpbHMtdGVzdG5ldC1sYXVuY2gtb2YtaW5ub3ZhdGl2ZS1jcm9ub3MtZXhwbG9yZXItZm9yLWVuaGFuY2VkLWV0aGVyZXVtLWFuZC1jb3Ntb3MtaW50ZWdyYXRpb24tNjMxODkvYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 09 Aug 2023 07:00:00 GMT",
        "title": "Cronos Blockchain Unveils Testnet Launch of Innovative Cronos Explorer for Enhanced Ethereum and Cosmos Integration - The Currency Analytics",
        "content": "In a significant stride towards innovative blockchain exploration, the Cronos blockchain platform has unveiled the testnet iteration of the Cronos Explorer. This milestone announcement, revealed through a dedicated platform known as X and elaborated in a comprehensive blog post on the official Cronos website, ushers in a new era of exploration within the Ethereum and Cosmos ecosystems.\n\nCronos Explorer is set to undergo a series of comprehensive developments over the coming year, with the goal of establishing itself as a prominent player in the realm of blockchain explorers. This unique platform is designed to cater specifically to the needs of Cronos developers and users, offering a range of tailored features that enhance the blockchain exploration experience. While it is important to note that the project is still in its nascent stages and does not yet encompass all functionalities of existing block explorers, the initial offering showcases promising potential.\n\nFor the time being, users of the Cronos Mainnet will continue to rely on Coronoscan without any disruption. The integration of the main net’s explorer is still under consideration, and a schedule has not been determined as of yet. Simultaneously, the Cronos Testnet will remain accessible as the new Cronos Explorer gradually achieves feature parity, a process expected to unfold over several months.\n\nTestnet users will gain access to a plethora of valuable information, including wallet details, transfer histories, and block data. The platform will facilitate the understanding of diverse transfer types, presenting both historical and real-time account balances. By addressing user concerns related to Ethereum-based technology, Cronos Explorer is designed to provide an efficient and convenient approach to accessing information about the Cronos chain, spanning both the Cosmos SDK layer and the EVM layer.\n\nOne standout feature of the Cronos Explorer lies in its ability to monitor transfer fees, encompassing both Cosmos transfers and EVM transfers. These cumulative transfer fees will be displayed in the “Block Rewards” field of block details, enhancing transparency for users. The platform will also offer unique functionalities such as the ability to filter token transfers and analyze internal transfers, streamlining transfer analysis and heightening user convenience.\n\nTo summarize, the testnet introduction of Cronos Explorer marks a pivotal advancement for the Cronos blockchain, introducing a range of innovative features that bridge the Ethereum and Cosmos ecosystems seamlessly. The project is poised for continuous development over the upcoming year, with the overarching objective of providing a user-friendly and intuitive exploration experience for all Cronos users. As Cronos takes this stride towards enhanced blockchain exploration, the Ethereum and Cosmos communities eagerly anticipate the benefits this integration will bring.\n\nIn the world of blockchain technology, evolution is constant, and Cronos sets a precedent by marrying innovation and accessibility through its pioneering Cronos Explorer.\n\nRecent developments and opinions on Cronos:\n\nCronos Unveils Groundbreaking Testnet Launch of Cronos Explorer: A milestone for the Cronos blockchain, this announcement unveils the project’s commitment to providing users with an unparalleled exploration experience. The integration of Ethereum and Cosmos functionalities within the platform exemplifies the forward-thinking approach Cronos embraces.\n\nUser-Focused Enhancements Propel Cronos Forward: As the Cronos Explorer enters its testing phase, users can look forward to a range of enhancements that streamline blockchain exploration. The platform’s unique features, such as the ability to monitor transfer fees and analyze internal transfers, promise to elevate user experience and understanding.\n\nEthereum-Cosmos Integration Catalyst for Blockchain Innovation: The integration of Ethereum and Cosmos functionalities within Cronos Explorer signifies a pivotal moment for blockchain technology. By bridging these ecosystems, Cronos opens the door to new possibilities and applications, fostering a collaborative environment for innovation."
    }
]