[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiNGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2NlbG8tcmV0dXJuLWhvbWUtZXRoZXJldW3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "'Carbon-negative' Celo to 'return home' to Ethereum as layer-2 - Blockworks",
        "content": "The primary architect of the Celo blockchain, cLabs, plans to “return home” as an Ethereum layer-2 network using the Optimism stack.\n\ncLabs said the decision had come after months of research and initial discussions with stakeholders, alongside technical development in rollups. The team announced it Saturday during the Ethereum Community Conference in Paris.\n\n“It has become a viable path by which to allow Celo to align even more closely with Ethereum — by connecting trustlessly with it and leveraging its economic security,” cLabs said.\n\nIn an optimistic rollup, transactions are first processed off-chain and considered valid even before they’re settled on Ethereum mainnet, a process which happens in batches — hence the term “optimistic.”\n\ncLabs is also planning to incorporate EigenDA, a data availability layer sourced from re-staking project EigenLayer. The move would aim to reduce network storage expenses.\n\nThe team intends to design a decentralized sequencer for use by Celo’s existing validators. The network’s native token would still be used for governance. CELO, which started out on Ethereum as an ERC-20, has jumped 11% today to a $300 million market cap.\n\nCelo has lost about half of its market cap over the past year\n\nDetailed in the project’s governance forum, Berlin-headquartered cLabs said adopting a rollup model for Celo could help the network grow.\n\nCelo mainnet, which is EVM-compatible, launched on Earth Day in 2020 — around two and a half years before Ethereum ditched proof of work for the less energy-intensive proof of stake. Celo says it’s carbon negative via an offset program with Wren, a subscription startup for reducing carbon footprints.\n\nThe upgrade will eventually come as a hard fork, the team said. End users shouldn’t notice if everything goes well. Transaction fees should remain consistent with no big changes for existing dApps, mobile-first features or its regenerative finance stack.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9lbnRlcnByaXNlLWJsb2NrY2hhaW4tZXRoZXJldW0tZm9yLWJ1c2luZXNzLWV4cGxhaW5zLWtleS11c2UtY2FzZXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jul 2023 07:00:00 GMT",
        "title": "Enterprise blockchain: 'Ethereum for Business' explains key use cases - Cointelegraph",
        "content": "The cryptocurrency market has encountered its share of ups and downs over the past year, but blockchain technology continues to see impressive growth as businesses seek digital transformation.\n\nRecent findings from the market research platform, MarketsandMarkets, estimated the global blockchain market size to be $7.4 billion in 2022. While notable, the report indicates that the blockchain sector is expected to generate $94 billion in revenue by the end of 2027. If these findings are accurate, this will result in a compound annual growth rate of 66% from 2022 to 2027.\n\nBreaking down ‘Ethereum for Business’\n\nSpecifically speaking, many enterprises today are using the Ethereum blockchain to improve outdated business processes. Paul Brody, global blockchain leader for Ernst & Young (EY), told Cointelegraph that he believes the Ethereum network will drive the most growth for the enterprise blockchain market going forward.\n\nTo bring this to light, Brody recently published Ethereum for Business. According to Brody, this book intends to help non-technical, C-level executives and company leaders understand how and why Ethereum applies to specific use cases.\n\nBook cover. Source: University of Arkansas Press\n\nTo ease readers into the subject matter, Brody begins part one of the book by explaining how Ethereum works using relatable language. “There are three foundational concepts that are useful to understand — the distributed ledger, the programmable ledger, and consensus algorithm,” he writes. Brody then explains that every “financial system has a ledger,” but notes that the difference between centralized, traditional systems and Ethereum is that “Ethereum’s ledger is public and distributed to all participants.”\n\nThe first chapter also explains the terminology associated with blockchain networks. Brody writes that “batches of transactions are known as ‘blocks.’” He ends the chapter by mentioning that the Ethereum network is often attractive to business users because it offers the “convenience of an integrated digital business” without a centralized market operator.\n\nBefore going in-depth on specific use cases, Brody spends the next few chapters of the book detailing terminology like wallets, tokens and smart contracts. For instance, in chapter four, he writes:\n\n“In Ethereum, both the money and the stuff can be represented as tokens, while the terms of the exchange between two parties can be captured in a smart contract.”\n\nBrody adds that everything of value is stored in a wallet when using the Ethereum blockchain: “Wallets are just a name for a digital account where you can store your keys and the access rights to contacts and assets you control through those keys.”\n\nRecent: AI in healthcare: New tech in diagnosis and patient care\n\nChapter five focuses on oracles; as Brody mentions, “enterprise transactions will require extensive use of oracles” since external data sources will be essential for completing smart contracts for business purposes.\n\nThe information presented at the beginning of Brody’s book is extremely useful for readers that may be new to the blockchain sector. The following chapters focus on concepts like privacy, which is a crucial consideration for enterprises leveraging blockchain.\n\nIn chapter six, Brody writes, “Though enterprises require privacy, blockchains do not, by default, offer privacy.” Given this, Brody focuses this section on privacy applications that can be applied to support enterprise transactions. Although Brody mentions at the beginning of the book that the read is not meant to promote EY’s blockchain work, he does detail how Nightfall and Starlight — two privacy mechanisms created by EY — are used by businesses to ensure private blockchain transactions.\n\nReal-world enterprise Ethereum use cases\n\nPart two of Brody’s book focuses on use cases and case studies. This section is probably the most interesting because it explains why the technology could be helpful for business processes.\n\nTokenization is heavily discussed in section two, with Brody writing that it is “the single most important thing enterprises can do in the blockchain space.” He adds that tokenization is often the first decision that firms using blockchain make since this can be used to digitize assets that can be easily tracked and managed.\n\nAlthough Brody explains the difference between ERC-20 and ERC-721 tokens, he emphasizes that the ERC-1155 standard is gaining traction among enterprises due to its blend of fungible and nonfungible properties. Brody shares that an EY client in the pharmaceutical industry is currently using ERC-1155 tokens to track serialized medicine packages. “Using the 1155 standard, this firm can mint large volumes of tokens and transfer them in big batches to distributors and others,” he writes.\n\nBrody continues sharing real-world examples of how EY clients apply the Ethereum blockchain. For instance, he explains how Italian beer producer Peroni uses blockchain for traceability, allowing consumers to scan a QR code to understand how the beer was produced.\n\n“Those looking at a beer non-fungible token (NFT) from Peroni on the Polygon PoS chain (an Ethereum side chain), will be able to see Peroni’s final batch token as well as input tokens from the malt house and farms,” writes Brody.\n\nIn addition to these use cases, Brody details how blockchain helps with supply chain management, contract management, carbon emission tracking, payments and more. He emphasizes in this section that “Blockchains will do for business ecosystems what ERP [enterprise resource planning] did inside the single enterprise.”\n\n‘Ethereum for Business’ is educational, but blockchain is broad\n\nWhile Ethereum for Business provides an in-depth and clear view of enterprise Ethereum, readers should remember that the blockchain ecosystem is broad. There are a number of different blockchain networks that businesses can use aside from Ethereum.\n\nRecent: Bug bounties can help secure blockchain networks, but have mixed results\n\nYet it’s notable that Brody’s new book gives an in-depth overview of the Ethereum ecosystem, breaking down key concepts while providing real-world use cases. This is extremely important, as education around blockchain technology is still needed to drive mainstream adoption.\n\nThe views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA3LzE2L3dpbGwtYW4tdXBjb21pbmctdGVjaC11cGdyYWRlLXNlbmQtZXRoZXJldW0tc29hcmluL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jul 2023 07:00:00 GMT",
        "title": "Will an Upcoming Tech Upgrade Send Ethereum Soaring? - The Motley Fool",
        "content": "Currently trading at a price of around $1,900, Ethereum (ETH 0.33%) is looking for its next big catalyst. While Ethereum is up by more than 60% year to date, it's still down significantly from the all-time high of $4,891.70 that it hit nearly two years ago. So it has plenty of potential upside.\n\nThat next big catalyst could be a blockchain upgrade that's tentatively scheduled to take place before the end of the year. In mid-2022, The Merge galvanized investors, and the crypto at one point rose 85% from the end of June to mid-August just before the upgrade took place in September. (The gain, of course, didn't last amid the brutal crypto winter.)\n\nCould this pending upgrade have a similarly positive impact?\n\nNot all tech upgrades are created equal\n\nAt the outset, it's important to differentiate between transformational upgrades and incremental upgrades. The Merge, which turned Ethereum from a proof-of-work blockchain into a proof-of-stake blockchain, was monumental. That helps to explain why there was so much investor excitement about The Merge.\n\nThe coming upgrade, known as Dencun (a mashup of \"Cancun\" and \"Deneb\"), will be more incremental. It has two goals: to reduce transaction fees on the Ethereum blockchain and to increase the network's throughput. In short, it will help Ethereum to run faster and cheaper, and that's certainly worthwhile. But is it really a big deal?\n\nThe answer will depend on how much of an impact Dencun has on blockchain performance. Right now, Ethereum's transaction fees (known as \"gas fees\") can become exorbitant during peak periods of demand. Thus, any change that brings down these fees significantly is certainly important. Moreover, Dencun is the next big step on Ethereum's path to becoming able to handle 100,000 transactions per second. That's a huge number. To put it into context, the Visa (V 1.20%) credit card network can handle about 65,000 transactions per second.\n\nThe big picture\n\nThe really exciting part, if you're a long-term crypto investor, is how the new upgrade fits into the bigger picture. Ethereum has planned a series of improvements as part of its long-term plan to ensure it remains a best-in-class blockchain. In November, Ethereum co-founder Vitalik Buterin released an updated roadmap for development, and Dencun is part of stage one of a five-stage process.\n\nTo put it another way, Ethereum is not resting on its laurels after The Merge. After this stage, which is known as The Surge, there will be The Scourge, The Verge, The Purge, and The Splurge. Even if each of these developmental stages lasts for only six months or so, that's still a solid two to three years more of regular improvements being made to the blockchain.\n\nShould you buy Ethereum?\n\nOn its own, Dencun might not be enough to make Ethereum soar. It's just an incremental change to help the blockchain run faster and smoother. Yes, it will improve scalability and efficiency, and it will introduce a new transaction type, but it's not a transformational change like The Merge.\n\nHowever, if you consider this tech upgrade as one step in a long-term process designed to make Ethereum a best-in-class blockchain, then it's an exciting story. Some crypto traders have even suggested that Ethereum could more than double in value to the $5,000 price level as a result of this upgrade.\n\nPersonally, I think that's expecting too much from this upgrade since the all-time high for Ethereum is just under $5,000, and that was during the peak of a huge bull market for risky assets like cryptocurrencies. But as more details about Dencun get released, and as more people understand how it could put Ethereum on the path to 100,000 transactions per second, then it's not out of the realm of possibility that the token will experience an extended rally heading into 2024. For that reason, I'm bullish on Ethereum's prospects."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDcvMTcvY2Vsby1wcm9wb3Nlcy10by1kaXRjaC1vd24tc3RhbmRhbG9uZS1ibG9ja2NoYWluLWZvci1sYXllci0yLW5ldHdvcmstb24tZXRoZXJldW0v0gF-aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wNy8xNy9jZWxvLXByb3Bvc2VzLXRvLWRpdGNoLW93bi1zdGFuZGFsb25lLWJsb2NrY2hhaW4tZm9yLWxheWVyLTItbmV0d29yay1vbi1ldGhlcmV1bS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Celo Proposes to Ditch Own Standalone Blockchain for Layer-2 Network on Ethereum - CoinDesk",
        "content": "The existential change could simplify liquidity sharing between Celo and Ethereum while boosting security and facilitating a seamless developer experience, according to the post. Celo is already compatible with the Ethereum Virtual Machine or EVM, meaning Ethereum developers can easily port over their existing apps or can develop new ones using many of the same tools."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1tb3ZlLTE5MDAv0gFCaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vYW5hbHlzaXMvZXRoL2V0aGVyZXVtLXByaWNlLW1vdmUtMTkwMC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Price Prepares For The Next Move As Risk of Bounce Grows - NewsBTC",
        "content": "Ethereum price failed to stay above $2,000 and corrected lower against the US Dollar. ETH could start a fresh rally if there is a move above $1,950.\n\nEthereum started a downside correction and tested the $1,900 level.\n\nThe price is trading below $1,950 and the 100-hourly Simple Moving Average.\n\nThere is a key bearish trend line forming with resistance near $1,930 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could start a fresh increase if it clears the $1,930 and $1,950 resistance levels.\n\nEthereum Price Could Restart Rally\n\nEthereum’s price rallied above the $1,970 resistance. ETH even climbed above $2,000 but failed to extend gains. A high was formed near $2,027 before there was a bearish reaction.\n\nThere was a move below the $1,950 support zone and the 100-hourly Simple Moving Average. The price even tested the $1,900 level. A low is formed near $1,900 and the price is now consolidating losses. It is trading near the 23.6% Fib retracement level downward move from the $2,027 swing high to the $1,900 low.\n\nEther is also trading below $1,950 and the 100-hourly Simple Moving Average. Besides, there is a key bearish trend line forming with resistance near $1,930 on the hourly chart of ETH/USD.\n\nOn the upside, immediate resistance is near the $1,930 level. The first major resistance is near the $1,950 zone, above which the price could rise toward the $1,975 resistance zone. It is close to the 61.8% Fib retracement level downward move from the $2,027 swing high to the $1,900 low.\n\nSource: ETHUSD on TradingView.com\n\nThe next major resistance is near the $2,000 level. Any more gains could send Ether toward the $2,050 resistance or even $2,120.\n\nMore Losses in ETH?\n\nIf Ethereum fails to clear the $1,930 resistance, it could a fresh decline. Initial support on the downside is near the $1,920 level.\n\nThe first major support is near the $1,900 level, below which the price might gain bearish momentum. The next major support is near the $1,850 support level. Any more losses could send Ether toward the $1,825 support level in the near term.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 level.\n\nMajor Support Level – $1,900\n\nMajor Resistance Level – $1,950\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmJpdHJhdGVzLmNvbS9uZXdzL3AvcHJvdG8tZGFua3NoYXJkaW5nLWlzLWdvaW5nLXRvLWNoYW5nZS1ldGhlcmV1bS1jb21wbGV0ZWx5YW5kLWZvci10aGUtYmV0dGVy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Proto-Danksharding Is Going to Change Ethereum Completely—And for The Better - Bitrates",
        "content": "A significant improvement to Ethereum is scheduled for later this year: proto-danksharding, the first step on the path to danksharding.\n\nLast year, Ethereum faced a seemingly impossible task – migrating from the Proof of Work consensus algorithm to the Proof of Stake (PoS) system, which reduced energy consumption by 99.95%. It managed to switch to a completely new design without disrupting the previous blockchain network. In spite of this achievement, there will be more upgrades to the network to improve scalability and ensure evolution. One of the most significant improvements to Ethereum is scheduled for later this year. We're talking about proto-danksharding, the first step on the path to danksharding. Even if rollups can help reduce fees for many Ethereum users, they're inadequate in the long term due to various technical difficulties. Danksharding encourages rollups to use the backspace by lowering the cost.\n\nEIP-4844 Will Benefit Ethereum and Other Layer 2 Rollup Solutions\n\nThe Ethereum Improvement Proposal 4844, also referred to as the Cancun upgrade, introduces a new type of transaction containing a considerable amount of data that can't be retrieved during the Ethereum Virtual Machine execution but whose commitment can be accessed. With EIP-4844, Ethereum is progressing unto an architecture called sharding, which involves splitting the blockchain into tinier, livelier blockchains so that it can handle more transactions. The aim is to scale computation without impacting decentralization and security. Therefore, data must be stored efficiently (and be easily retrievable to end users). Attention must be paid to the fact that sharding and danksharding are interrelated, but they're not one and the same thing. Danksharding represents a means to an end: dividing networks in an effort to scale Ethereum.\n\nTo implement the complete sharding roadmap, blob-carrying transactions are used. A blob refers to partitioned data across bytes, from left to right, enabled by a KZG commitment. Making a cryptographic commitment is just like a promise in that you commit to a statement and demonstrate later that you were abiding by it. A constant-sized polynomial commitment scheme was introduced in 2010 – it goes by the name of KZG. Even opening multiple evaluations requires only a constant amount of communication overhead. Back on topic, the blobs can help alleviate Ethereum's network burden, growing largely enough to accommodate moderate pieces of data. The blobs are coupled with the Beacon Chain, so the data from the new transaction format is downloadable by all consensus nodes.\n\nTransactions Carrying Blobs Allow Layer 2 Solutions to Retrieve the Data in A Manageable Timeframe\n\nBig data applications require high-performance storage, not to mention transaction support. The blob storage system retains essential consistency and high throughput under heavy access. Blob-carrying transactions don't compete with the gas usage of standard transactions, although they function similarly. A blob enables two batches of transactions in Layer 2 networks, so it's critical to Ethereum's future. Indeed, Layer 2 networks have allowed transaction-heavy applications to overcome the Mainnet's gas fees, but additional scaling is required at the network level. To be clear, danksharding isn't meant to reduce the need for Layer 2 scaling Solutions.\n\nThe Dencun Upgrade Is Nearing the Final Stages of Planning\n\nDencun covers two individual upgrades: Cancun, the upgrade to Ethereum's execution Layer, and Deneb, which targets the consensus layer of Ethereum. Besides proto-danksharding, a few minor code changes to the Ethereum Virtual Machine. The other EIPs that made the proposals are:\n\nEIP-1153 - to introduce transient storage opcode that improves efficiency and reduces costs; it enables cleaner smart contracts, saves lots of gas, and simplifies the EVM design\n\n- to introduce transient storage opcode that improves efficiency and reduces costs; it enables cleaner smart contracts, saves lots of gas, and simplifies the EVM design EIP-4788 - to expose data about the Beacon Chain to the execution layer for permissionless access by smart contracts, improving designs for bridges\n\n- to expose data about the Beacon Chain to the execution layer for permissionless access by smart contracts, improving designs for bridges EIP-5656 - to introduce a new EVM instruction for efficient copying of memory areas\n\n- to introduce a new EVM instruction for efficient copying of memory areas EIP-6780 - to recover funds to the caller but not delete the account; basically, it eliminates code that could terminate smart contracts\n\nEthereum developer Mario Havel stated that Dencun is approaching the final stages of planning during the ETH conference in Spain. The upgrade will hand over the responsibility of storing complete information about the blockchain's state to a dedicated \"archival node,\" which will support a more extensive set of full nodes to store less data. The following upgrade will be the Verge, which will include Verkle trees. At any rate, Ethereum developers will soon release an in-depth specs document that includes test vectors for the Dencun upgrade.\n\nBlockchain architecture is complex (and the Ethereum Roadmap even more so)\n\nThe use of blockchain technology in software development helps create more secure and transparent systems. The blockchain is a complex structure with numerous components, but the Ethereum Roadmap is more complicated in nature. With the arrival of the Merge, Ethereum went from Proof of Work to Proof of Stake, opening the door for Ethereum 2.0 and advancing the evolution of cryptocurrency. The Shapella hard fork was an important milestone on the network roadmap. Still, it's just one step towards a fully scalable Ethereum ecosystem. The Dencun hard fork will implement proto-danksharding in the fourth quarter of 2023, allowing rollups to add cheaper data to the blocks and reduce network fees.\n\nThe blobs set the foundation for data sharding. To be more precise, instead of having separate sidechains, there's only one chain with a huge amount of information. Ethereum will leverage KZG commitments as its polynomial commitment scheme. It's called a commitment because the elliptic curve point is sent to a verifier, who can't alter the polynomial they're working with. They can only provide valid proof. The blobs will store data for a limited amount of time, so they won't come in contact with the Ethereum Virtual Machine even if its contents and availability can be verified by it.\n\nIt's expected that the Ethereum Roadmap will change as new information and technology become available. The Merge was the first step in Vitalik Buterin's big-picture thinking, meaning it's not the last. The network will enter a state of progressive improvements, with efforts focused on a certain point: scalability. As Ethereum's founder put it:\n\nIt is really central to the problems that are preventing a lot of the cryptocurrency and blockchain applications that we dream of going mainstream."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1zdGFibGVjb2luLWRldmVsb3Blci1ldGhlbmEtc3VycGFzc2VzLWVwaWMtbWlsZXN0b25l0gFRaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtLXN0YWJsZWNvaW4tZGV2ZWxvcGVyLWV0aGVuYS1zdXJwYXNzZXMtZXBpYy1taWxlc3RvbmU_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Stablecoin Developer Ethena Surpasses Epic Milestone - U.Today",
        "content": "Ethena, a crypto start-up, has achieved a significant milestone by securing an impressive $6 million in seed funding, according to a report from Axios. The funding round, led by prominent investment firm Dragonfly, demonstrates growing interest in Ethena's cutting-edge stablecoin project.\n\nAdvertisement\n\nThus, in response to the challenges faced by previous stablecoin ventures, the start-up has developed a unique approach to ensuring its stablecoin, known as USDe, maintains a stable value relative to the U.S. dollar. By employing Ethereum derivatives and a hedging mechanism, Ethena aims to ensure that the value of USDe remains pegged to the dollar.\n\nThe difference\n\nThe key to this solution lies in the innovative use of collateral from users, allowing the platform to effectively hedge price exposure through shorting Ethereum via perpetual swaps. Through a balanced combination of staked ETH and derivatives, Ethena aims to neutralize any potential gains or losses, safeguarding the stability of USDe.\n\nThe start-up wants to distinguish itself from previous attempts at algorithmic stablecoins, such as the infamous Terra Luna. Moreover, Ethena's approach sets it apart from current stablecoin leaders USDC and USDT, which predominantly rely on traditional fiat-based assets like bills and bonds.\n\nThe success of Ethena's funding round is further amplified by the support it has garnered from prominent players in the cryptocurrency industry. Notable investors include big crypto exchanges and, additionally, Arthur Hayes. The founder of BitMEX and his family office have provided crucial backing to the project. This is especially noteworthy since Hayes himself has advocated for the development of an algorithmic stablecoin backed by Bitcoin derivatives, known as NakaDollar."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vZGVjcnlwdC5jby8xNDg3NjAvZXRoZXJldW0tc2NhbGluZy1zb2x1dGlvbi16a3N5bmMtbGF1bmNoZXMtbGF0ZXN0LXByb3Zlci10ZWNoLWJvb2p1bdIBY2h0dHBzOi8vZGVjcnlwdC5jby8xNDg3NjAvZXRoZXJldW0tc2NhbGluZy1zb2x1dGlvbi16a3N5bmMtbGF1bmNoZXMtbGF0ZXN0LXByb3Zlci10ZWNoLWJvb2p1bT9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Scaling Solution zkSync Unveils Latest Prover Tech ‘Boojum’ - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nzkSync is taking yet another step to decentralize.\n\nNamed after a mythical creature found in Lewis Carroll’s poem ‘The Hunting of the Snark,’ the team behind zkSync has launched the latest upgrade to the speedy layer-2 network.\n\nThe launch is in so-called mainnet shadow mode, per the team, as part of the launch's phased rollout. This mode is a testing zone that runs in parallel to the mainnet.\n\nzkSync is a novel scaling solution for Ethereum and one of the few that use zero-knowledge (zk) rollups to do so. Rollups come in two varieties: zk and optimistic. Both batch transactions off of the mainnet, roll them up into even smaller bundles, then those bundles are compressed into a proof, and settled on Ethereum.\n\nPart of that process involves a prover. This piece of technology is what does the compressing and packing of all those transactions. It's the cryptographic equivalent of a trash compactor, except it's not trash but potentially thousands of dollars in crypto activity.\n\nGiven the high computing power needed to generate those proofs, however, the barrier for users to participate is quite high.\n\nThe latest upgrade will address precisely this.\n\nCalled Boojum, which, per Carroll, is the most dangerous variety of Snark (itself a fictionalized creature), the tech will lower the hardware barrier to help secure zkSync.\n\nAD\n\nAD\n\nThe new prover can be operated with as little as 8 gigabytes of hardware, whereas the average prover demands roughly 500 gigabytes on average, said zkSync CEO Alex Gluchowski.\n\n“So far, we've seen the benchmark competitors indicating something like north of 500 gigabytes of RAM for a prover,” he told Decrypt. “And as you can only run it on the cloud, it's not ready for this [wide adoption]. Our prover requires only eight gigabytes of GPU RAM and it can run on GPUs that are compatible with gaming computers.”\n\nAlong with lowering the hardware demands, Boojum is also doing all its transaction compressing for much cheaper, too. Cutting costs here is crucial, even if it's only pennies.\n\n“Just because a single transaction costs $1 to produce, or even 10 cents, or even less than that, getting through hundreds of thousands of transactions per second would mean massive expanding, and you will probably not have enough of the hardware in the vulnerable clusters to produce and sustain this load,” said Gluchowski.\n\nInstead of several large data centers supporting a blockchain network, especially one executing such taxing computations as generating cryptographic proofs, the upgraded prover will make it accessible to anyone.\n\nJust like miners on Bitcoin and validators on Ethereum are paid for securing their networks, so too would provers on zkSync, he said.\n\nThe zkSync CEO even argued that it could be a viable way to repurpose the mining industry.\n\n“I personally don't think the proof of work will be a sustainable source of business,” he told Decrypt. “They will have to shift to something that actually provides normally redundant value, not like waste kind of work. Actually like doing some useful work.”\n\nAD\n\nAD\n\nWith this step in the decentralization step executed, Gluchowski said that the next step is to decentralize zkSync’s sequencer. This piece of a blockchain is responsible for ordering transactions in each block.\n\nExecuting this step also suggests a token launch in the future, he told Decrypt.\n\n“When you decentralized the sequencer, you will need some way to permissionlessly verify transactions,” said Gluchowski."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vY3J5cHRvbmV3cy5jb20vZ3VpZGVzL2hvdy10by1idXktZXRoZXJldW0td2l0aC1wYXlwYWwuaHRt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "How to Buy Ethereum with PayPal in 2021 - Cryptonews",
        "content": "How to Buy Ethereum with PayPal\n\nBuying Ethereum with PayPal is an attractive option for the buyers facing banking restrictions in their countries of residence. At the same time, this is a viable alternative to banks whose transaction or conversion fees are considered too high…\n\nBuying Ethereum with PayPal is an attractive option for the buyers facing banking restrictions in their countries of residence. At the same time, this is a convenient alternative to banks whose transaction or conversion fees are considered too high for one’s taste or pocket. There are few quick legit ways how to buy Ethereum with PayPal.\n\nSince late 2020, you can buy cryptocurrencies using your PayPal e-wallet. All you need to do is have a funded PayPal account, choose the cryptocurrency you want to buy, and confirm your purchase.\n\nHowever, buying ether on PayPal has its own caveats. For instance, PayPal does not allow you to withdraw your crypto assets into a private self-hosted wallet, meaning that you won’t be able to use it for anything else but selling it back to PayPal once its price goes up or down. The essence of cryptocurrency is the ability to own private digital cash without having to rely on any intermediaries and send or receive them in a censorship-resistant way. At least for now, getting cryptocurrency via PayPal is a safe way to get exposure to the asset class, but it does not let you use it in ways it was made to be used – as a free and open peer-to-peer (P2P) financial system without trusted intermediaries.\n\nLuckily for you, there actually are three other methods of how you can buy Ethereum with PayPal instantly via other platforms that give you full ownership of your digital assets.\n\nBuying Ethereum With PayPal via LocalEthereum\n\nAnother option is to visit LocalEthereum as an informal exchange platform on which you can find and get in touch with people who sell ether in various areas. Depending on their preferences, they may accept PayPal payment from you.\n\nLocalEthereum operates as a website which connects you with people who want to sell Ethereum in your local area or worldwide. It is like “eBay of Ethereum.” Depending on how thorough you are in your search, sooner or later you will find someone willing to accept PayPal payments. If you want to buy ETH with PayPal in this manner, you should pay attention to any aspect of a transaction in advance, as you alone will bear the risk of dealing with scammers. Some of them may claim that they never received your payment, so go for reputable traders only. Make sure you check their terms of trade and try to learn as much about them as possible before clicking on a payment button.\n\nThese are the most convenient ways to purchase Ethereum with PayPal. If you want to learn more about how to buy other cryptocurrencies, see our “How to get altcoins” guide."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL3d3dy5mb3JiZXNpbmRpYS5jb20vYXJ0aWNsZS9jcnlwdG9jdXJyZW5jeS9jZWxvLWJsb2NrY2hhaW4taXMtcmV0dXJuaW5nLXRvLXRoZS1ldGhlcmV1bS1lY29zeXN0ZW0td2l0aC10aGUtbDItdHJhbnNpdGlvbi84NjY5OS8x0gGMAWh0dHBzOi8vd3d3LmZvcmJlc2luZGlhLmNvbS9hbXAvYXJ0aWNsZS9jcnlwdG9jdXJyZW5jeS9jZWxvLWJsb2NrY2hhaW4taXMtcmV0dXJuaW5nLXRvLXRoZS1ldGhlcmV1bS1lY29zeXN0ZW0td2l0aC10aGUtbDItdHJhbnNpdGlvbi84NjY5OS8x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Celo Blockchain is returning to the Ethereum ecosystem with the L2 transition - Forbes India",
        "content": "Image: Getty Images\n\nCelo, a blockchain platform, has proposed to return to the Ethereum ecosystem by transitioning from an independent layer-1 blockchain to an Ethereum layer-2 (L2) solution. The move aims to leverage OP Stack as the architecture for Celo's Ethereum L2 blockchain, enabling seamless integration with Ethereum's tooling and libraries.The proposal discussed on Celo's governance forum outlines critical elements of the transition. It includes establishing an off-chain data availability layer operated by Ethereum node operators and secured by restaked Ether (ETH). The existing validators would also be transformed into decentralised sequencers for the L2 solution.Layer-1 and Layer-2 blockchains differ in purpose and design. While layer-1 networks operate independently, layer-2 solutions enhance the performance of layer-1 blockchains. The transition to Ethereum L2 would offer benefits such as increased security and lower gas fees compared to other L2 solutions.The proposal assures end-users would not be affected by the migration, and CELO token holders would retain control over core contracts by voting on governance proposals. Moreover, CELO tokens would be used to pay for gas within the new L2 ecosystem.It is expected to facilitate increased liquidity flow between Celo and other chains. It may introduce additional costs for sequencers, including fees on the data availability layer and gas on Ethereum.The proposal is scheduled for discussion on a governance call on July 21, followed by a \"temperature check\" the following day. If adopted, the transition would enable Celo to benefit from Ethereum's robust tooling and libraries, enhancing compatibility and expanding possibilities for developers.Celo has been actively improving its mobile experience and incorporating features that target developing economies, where demand for technological payment solutions is high. By embracing the Ethereum L2 solution, Celo aims to unlock further potential and strengthen its position within the competitive blockchain landscape.As the governance discussions unfold and the technical details are finalised, the community eagerly awaits the outcome, which could mark a significant milestone in the evolution of Celo's blockchain ecosystem and its integration with the broader Ethereum network."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vY3J5cHRvYnJpZWZpbmcuY29tL2JyaWRnaW5nLXRoZS1nYXAtYmV0d2Vlbi1zb2xhbmEtZXRoZXJldW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Bridging the Gap Between Solana and Ethereum: Neon EVM Debuts on Solana Mainnet - Crypto Briefing",
        "content": "Share this article URL Copied\n\nNeon EVM, an Ethereum Virtual Machine, has been launched on the Solana mainnet working to bridge the gap between Ethereum and Solana’s computing models. This will enable Ethereum DApps to utilize Solana effectively for transaction settlements:\n\nApply today for the Early Builders Program and be a part of the Neon EVM’s mission to revolutionize blockchain technology. https://t.co/sMj0zIzSAA #NeonEVM #Solana #Ethererum pic.twitter.com/o7n90MmDbb — Neon EVM (@Neon_EVM) July 3, 2023\n\nThe Neon EVM smart contract, residing on Solana’s blockchain, processes wrapped Ethereum transactions, integrating the robustness of Ethereum’s DApp environment with Solana’s highly efficient infrastructure.\n\nThis design allows developers to deploy Ethereum DApps directly onto the network, using Solana’s technical capabilities while requiring minimal code reconfiguration.\n\nIn the past, cost-effectiveness for EVM DApps typically meant resorting to rollups or sidechains. The arrival of Neon EVM on Solana sets a new precedent by offering an alternative to layer 2 solutions.\n\nEthereum’s average transaction fee is around $2. L2s can offer a saving of 4–20 times with transaction costs falling between $0.5–$0.1. Solana, on the other hand, features an average transaction fee of a mere 0.00001 SOL (~$0.0002) per transaction – an impressive 10,000-fold saving. Neon EVM’s initial Devnet tests have already confirmed the protocol’s real-world efficacy.\n\n“Once we repeat these tests in production, we will present the figures based on the real-world data.” Marina Guryeva, director of the Neon Foundation, stated in a statement.\n\nThe launch has also activated the Neon Decentralized Autonomous Organization (DAO), a community that will have a significant influence on the future trajectory of Neon EVM."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jZWxvLWJsb2NrY2hhaW4tcHJvcG9zZXMtcmV0dXJuLXRvLWV0aGVyZXVtLWVjb3N5c3RlbS10cmFuc2l0aW9uLXRvLWwy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jul 2023 07:00:00 GMT",
        "title": "Celo blockchain proposes return to Ethereum ecosystem, transition to L2 - Cointelegraph",
        "content": "CLabs, the organization responsible for developing the Celo blockchain, is seeking to return to the Ethereum ecosystem by transitioning from an independent EVM-compatible layer-1 blockchain to an Ethereum layer-2 solution.\n\nAccording to a proposal discussion on Celo’s governance forum, the transition would include leveraging OP Stack as the architecture to become an Ethereum L2 blockchain, eliminating the need to monitor tooling and libraries composability through upgrades, thus “making it easy for Celo developers to utilize the full gambit of Ethereum tooling/libraries.”\n\nOther key differentiating factors would include an off-chain data availability layer operated by Ethereum node operators and protected by restaked Ether (ETH), along with transforming current validators into decentralized sequencers for L2.\n\nLayer-1 and Layer-2 blockchains differ primarily in purpose, but also in their design and architecture. While L1 networks are designed to be self-sufficient, L2 solutions are aimed at enhancing the performance of L1 blockchains rather than operating independently.\n\ncLabs proposed upgrade. Source: Celo's governance forum\n\nBenefits from the transition were said to include increased security while maintaining low gas fees. “We expect no material change of gas fees. As the proposal is for an L2 solution with off-chain data availability, gas costs can be a lot lower than on other L2s,” reads the proposal, scheduled to be discussed on a governance call on July 21 before being released for a “temperature check” on the following day.\n\nBy adopting the proposal, end-users would not be affected by the migration, and CELO tokenholders would retain control over core contracts by voting on governance proposals. Additionally, CELO tokens will also be used to pay for gas.\n\nAlthough the transition seems purely technical, it may affect the Celo ecosystem in different ways. As per the forum discussion, it could potentially enable more liquidity to flow between Celo and other chains but also generate extra costs for sequencers, such as fees on the data availability layer and gas on Ethereum. In addition, it is also unclear whether sequencers' rewards would match with current validators’ rewards.\n\nWith blockchains becoming increasingly competitive, Celo has been working on improving its mobile experience by incorporating increased functionality and particular features. The Celo ecosystem is also targeting developing economies, where more technological solutions for payments are in demand.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Here’s how Ethereum’s ZK-rollups can become interoperable"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy91bnN0b3BwYWJsZS1kb21haW5zLWFkZHMtZXRoLWRvbWFpbnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Unstoppable Domains adds .eth domains through Ethereum Name Service - Cointelegraph",
        "content": "Two of the biggest platforms powering Web3 decentralized domains are now available under one roof after Unstoppable Domains announced support for .eth domain names from the Ethereum Name Service (ENS).\n\nThe two service providers have been central pillars in the Web3 domain space, allowing users to create human-readable domain names and cryptocurrency wallet addresses. Decentralized domains also act as a profile across the Web3 ecosystem, unlocking a host of functionalities.\n\n.eth is coming to Unstoppable.\n\n\n\nUnstoppable is now your one-stop shop for Web3 domains. Buy and manage your .eth, .nft, or .x domains all in one place.\n\n\n\nBetter yet? We’re introducing new functionality that makes buying .eth domains easier and more seamless.\n\n\n\npic.twitter.com/lKB5yNwuD7 — unstoppable.polygon (@unstoppableweb) July 17, 2023\n\nAs Cointelegraph previously explored, Unstoppable Domains and ENS accounted for a combined six million domain registrations in early 2023, with registrations increasing markedly from 2022 onwards.\n\nUsers can now buy .eth names through Unstoppable with added payment methods and functionality to streamline the management of ENS domains. All .eth domains purchased from Unstoppable will be registered through the ENS smart contract and have the same functionality as those registered directly through ENS.\n\nRelated: State of play: Decentralized domain services reflect on industry progress\n\nUsers can also purchase .eth domains through Unstoppable without connecting them to an existing Ether (ETH) wallet. This is provisioned for by Unstoppable Vault, a noncustodial offering that allows users to secure Web3 domains without initially having a cryptocurrency wallet.\n\nENS users can also take advantage of an auto-renewal mechanism through Unstoppable, canceling out the need to renew .eth domains on-chain and the possibility of losing a domain as a result.\n\nThe integration with Unstoppable also allows .eth users to purchase their desired Web3 domain with several different payment methods, from Bitcoin (BTC) and 12 different cryptocurrencies to conventional fiat payment options, including credit cards, PayPal, Google Pay and Apple Pay.\n\nUnstoppable is also developing .eth domain management tools, which will include the ability to set cryptocurrency addresses, manage on-chain profile data and transfer .eth domains.\n\nAn announcement shared with Cointelegraph highlights that users who buy .eth domains through Unstoppable can use ENS integrations. However, .eth domains purchased through Unstoppable will not function with Unstoppable’s 800 or so integrations.\n\nUnstoppable also supports a number of Web3 domains including .nft, .crypto, .wallet, .dao, .bitcoin, .polygon, .BinanceUS and .blockchain.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Ordinals turned Bitcoin into a worse version of Ethereum: Can we fix it?"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9hYXZlLXByb3RvY29sLWxhdW5jaC1zdGFibGVjb2luLWdoby1ldGhlcmV1bS1tYWlubmV00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Aave Protocol launches stablecoin GHO on Ethereum mainnet, $2M minted - Cointelegraph",
        "content": "Decentralized finance (DeFi) protocol Aave has launched its algorithmic United States-dollar pegged stablecoin GHO on the Ethereum mainnet, with $2.19 million worth of GHO minted so far.\n\nAave announced the launch of the new stablecoin in a July 16 blog post, describing the new stablecoin GHO as a “decentralized, over-collateralized” asset. The stablecoin is backed by a “multitude” of digital assets including Ethereum’s native currency Ether (ETH) and Aave’s native token AAVE (AAVE).\n\nLet's GHO! Congrats to the @AaveAave community on the Mainnet Launch. https://t.co/vI7JbMLYb4 — GHO (@GHOAave) July 15, 2023\n\nThe launch of GHO on mainnet came after a community governance vote, which saw nearly 100% of the 424 participating addresses vote in favor of the new stablecoin.\n\nUnlike centralized stablecoins such as Tether’s USDT (USDT), which have drawn some criticism for an apparent lack of transparency around its reserves, the assets backing GHO are transparent and verifiable and can be confirmed by on-chain data, according to Aave.\n\n“All transactions are performed through self-executing smart contracts, and all data regarding GHO transactions is available and auditable directly from the blockchain or via numerous user interfaces,” Aave wrote.\n\nAdditionally, Aave said GHO’s revenue would further bolster its DAO treasury, with governance being entrusted to AAVE and stkAAVE token holders.\n\nTotal circulating supply of GHO since inception. Source: DeFiLlama\n\nThe GHO stablecoin is currently available to the public:\n\n“Anyone can mint GHO using the assets they supply into the Aave Protocol V3 Ethereum market as collateral, ensuring that GHO is overcollateralized by a multitude of assets.”\n\nRelated: Circle CEO spells doom scenario for US dollar in warning to Congress\n\nThe launch of GHO marks another addition to the growing ranks of DeFi-native algorithmic stablecoins. On May 4, DeFi protocol Curve launched its flagship algorithmic stablecoin crvUSD.\n\nAt the time of publication, MakerDAO’s Ethereum-based stablecoin DAI is the largest algorithmic stablecoin in circulation, commanding a $4.28 billion market capitalization according to data from DefiLlama.\n\nHowever, the total stablecoin market remains dominated by centralized issuers including Tether and Circle.\n\nStablecoin dominance by market capitalization. Source: DeFiLlama\n\nAt current, Tether’s USDT and Circle’s USD Coin (USDC) account for 87% of the total circulating supply of all U.S.-dollar pegged stablecoins.\n\nAt the time of publication, GHO is trading slightly below the desired $1 peg at $0.9927 and has fallen as low as $0.9814 on July 16, according to price data from CoinMarketCap.\n\nCointelegraph contacted Aave for comment but has yet to receive an immediate response.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Unstablecoins: Depegging, bank runs and other risks loom"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtd2hhbGVzLXNlbGxpbmctdGhlaXItaG9sZGluZ3Mtd2hhdHMtaGFwcGVuaW5n0gFOaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtLWV0aC13aGFsZXMtc2VsbGluZy10aGVpci1ob2xkaW5ncy13aGF0cy1oYXBwZW5pbmc_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jul 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Whales Selling Their Holdings, What's Happening? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nRecent data reveals that Ethereum (ETH) whales are significantly selling off their holdings. One such instance involved a transaction where a whale sold 4,549 ETH for approximately $8.78 million, at a price of $1,930 around 14 hours ago. Notably, this particular whale initially spent $6 million to buy 4,549 ETH at a price of $1,319 on Jan. 9, which means they made a profit of approximately $2.78 million.\n\nAdvertisement\n\nThis sell-off pattern among ETH whales might have been triggered by a strategic move to reap the benefits of the cryptocurrency's recent surge in value. This market situation largely stems from the positive court decision in favor of Ripple's XRP, which had a ripple effect on several other cryptocurrencies, including Ethereum.\n\nA whale sold 4,549 $ETH for 8.78M $USDT at a price of $1,930 14 hrs ago.\n\n\n\nThis whale spent $6M to buy 4,549 $ETH at a price of $1,319 on Jan 9, and has earned $2.78M so far.https://t.co/pzSfTqYuPn pic.twitter.com/PEtWS9LXmE — Lookonchain (@lookonchain) July 16, 2023\n\nThe court's decision seems to have provided a significant boost to the overall cryptocurrency market sentiment, leading to a considerable price appreciation for several tokens, Ethereum included.\n\nSubsequent to the XRP court decision, Ethereum surged to around $2,000. This impressive rally undoubtedly offered an attractive profit-taking opportunity for ETH whales who had acquired their holdings at lower price levels. As such, the current ETH sell-off by whales could be a reflection of these large investors cashing in on their profits, an understandable move considering the crypto market's notorious volatility.\n\nHowever, as whales started selling, the price of Ethereum began to retreat from its $2,000 level, a natural market reaction to a substantial sell-off. This recent activity in the Ethereum market serves as a reminder of the significant influence whales can wield on crypto prices, often leading to sharp price fluctuations."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vY29pbmdhcGUuY29tL2p1c3QtaW4tZ25vc2lzLXVudmVpbHMtdmlzYS1jZXJ0aWZpZWQtZGViaXQtY2FyZC1hdC1ldGhlcmV1bS1jb25mZXJlbmNlL9IBYWh0dHBzOi8vY29pbmdhcGUuY29tL2p1c3QtaW4tZ25vc2lzLXVudmVpbHMtdmlzYS1jZXJ0aWZpZWQtZGViaXQtY2FyZC1hdC1ldGhlcmV1bS1jb25mZXJlbmNlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Just-In: Gnosis Unveils Visa-Certified Debit Card at Ethereum Conference - CoinGape",
        "content": "Gnosis, a leading blockchain company, has unveiled Gnosis Pay and Gnosis Card, marking the world’s first decentralized payment network and self-custodial debit card. The official announcement was made at The Ethereum Community Conference (EthCC), the largest annual European Ethereum04-days event.\n\nGnosis Pay and Gnosis Debit Card\n\nEthereum’s sidechain Gnosis, introduces Gnosis Pay and Gnosis Card, pioneering the integration of decentralized payment networks with traditional processors and a Visa-certified consumer debit card connected to an on-chain self-custodial wallet.\n\nadvertisement\n\nIt will initially be available in EU and EEA countries, along with the UK. Expansion plans for Q4 include the United States, Brazil, Mexico, Singapore, and Hong Kong. This innovative offering differentiates itself from other Web3 payment cards as it is not prepaid.\n\nThese innovative offerings enable users to pay for online purchases using stablecoins and Visa’s payment system. Gnosis Pay operates as a layer 2 solution on the chain, ensuring faster and more cost-effective transactions, stemming from a collaboration between Gnosis and payment processor SaltPay.\n\nAlso Read: Australia’s Big Four Banks Block Payments To Crypto Exchanges\n\nRevolutionizing Crypto Payments\n\nUpon launch, users will have the ability to spend EURe, a stablecoin pegged to the Euro, on the Gnosis Card. The team behind Gnosis Pay is actively working on integrating MakerDAO’s decentralized stablecoin, DAI, for further payment options.\n\nWith Gnosis Pay, you can spend your digital assets directly from you wallet wherever Visa is accepted. – Gnosis Pay, July 17, 2023\n\nInitially, Gnosis Pay will provide a physical card and web app, with a mobile app in the pipeline. Signing up for the service incurs a 30 EURe fee, marking the beginning of a new era in crypto payments.\n\nFollowing its spin-out as a separate business in July, Gnosis maintained strong ties with Safe, evident in the incorporation of Safe wallets in their recent product offerings.\n\nAlso Read: Binance Launches New Feature Responding To User Feedback"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vZGVjcnlwdC5jby8xNDg3MTUvdGhpcy13ZWVrLWluLWNvaW5zLWFsdGNvaW5zLXhycC1zb2xhbmEtY2FyZGFuby1wb2x5Z29uLWJpdGNvaW4tZXRoZXJldW3SAWdodHRwczovL2RlY3J5cHQuY28vMTQ4NzE1L3RoaXMtd2Vlay1pbi1jb2lucy1hbHRjb2lucy14cnAtc29sYW5hLWNhcmRhbm8tcG9seWdvbi1iaXRjb2luLWV0aGVyZXVtP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jul 2023 07:00:00 GMT",
        "title": "This Week in Coins: XRP Leads Alt Week as Solana, Cardano and Polygon Outperform Bitcoin and Ethereum - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt.\n\nIt was a week of altcoin rallies after Ripple’s courtroom victory against the SEC, and details of an upcoming Polygon 2.0 rollout shifted attention away from the two market leaders.\n\nBitcoin (BTC) still gained in value, a modest 3%, and currently changes hands at $30,287, according to CoinGecko.\n\nAD\n\nAD\n\nOn Monday, reports hit the press that the British multinational bank Standard Chartered predicted that Bitcoin will hit $120,000 before 2025. It wasn’t quite enough to boost the price of the world’s biggest cryptocurrency by market capitalization this week, though.\n\nEthereum (ETH) fared substantially better, though not in the same league as the altcoins. It rose 6.6% to trade at $2,001 at the start of the weekend—$1,932 as of this writing. On Thursday, Ethereum hit $2,000 for the first time since May.\n\nWhile the latest CPI report, released on Wednesday, indicates that U.S. inflation is going down in line with expectations, it wasn’t quite enough to send investors toward the two most popular cryptocurrencies.\n\nThe first substantial bit of altcoin news broke on Tuesday when Polygon (MATIC) began to surge following an uptick in network growth.\n\nOn Thursday, Polygon published a technical proposal for Polygon 2.0 and proposed the launch of a new native token for the network: POL token—a kind of upgrade to MATIC.\n\nClearly, it was already a good week for Polygon holders, but things got even better on Thursday when a judge presiding over the Ripple vs SEC case ruled in favor of Ripple.\n\nAD\n\nAD\n\nJudge Analisa Torres ruled that XRP \"is not necessarily a security on its face” and programmatic sales of XRP to the public did not break securities laws, but some $728 million worth of institutional sales of XRP did qualify as securities offerings because they were sold to buyers who expected to profit in a common enterprise.\n\nThe news didn’t just boost XRP, it also caused Polygon, Solana (SOL) and Cardano (ADA) to blow up by double digit percentages on Thursday. Crypto’s total market cap surged 6% in the hours following to hit $1.3 trillion on Friday.\n\nAt the start of the weekend, all four altcoins were up by double digit percentages over the last seven days. XRP leads with an eye-popping 66% spike in price and currently trades at $0.72194.\n\nSolana blew up 33% and now trades at $27.44, Polygon rose 24% before settling to $0.8061 and Cardano added 22%, now $0.3299.\n\nOther particularly noteworthy rallies this week include Stellar’s XLM, up 47% and now trades at $0.1316, Chainlink (LINK) added 14% to settle at $6.96, and Lido DAO (LDO) rallied 26% to trade at $2.37 as of this writing.\n\nThere were no major losses among the top thirty cryptocurrencies.\n\nCoinbase, Kraken and Crypto.com all announced they would all be relisting XRP after the momentous court ruling.\n\nFinally, regulators across the world are continuing to grapple with the growing crypto industry.\n\nAD\n\nAD\n\nOn Monday, two high-level European Union institutions, the European Banking Authority and the European Securities and Markets Authority, both released new guidelines in the runup to the implementation of Markets in Crypto Assets (MiCA), a comprehensive framework for governing the industry across all the bloc’s 27 member states.\n\nMiCA comes into force on 30 June 2024.\n\nAnd on Tuesday, South Korea's Financial Services Commission (FSC) announced the implementation of rules, effective from January 2024, requiring crypto firms to submit detailed crypto disclosures in their financial statements."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL2RlY3J5cHQuY28vbmV3cy1leHBsb3Jlcj9waW5uZWQ9MjMwNTczJnRpdGxlPWV0aGVyZXVtLWxheWVyLTItbmV0d29yay1tYW50bGUtbGF1bmNoZXMtbWFpbm5ldC1hbHBoYS13aXRoLW1vZHVsYXItY2hhaW4tYXBwcm9hY2jSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "News Explorer — Ethereum Layer-2 Network Mantle Launches Mainnet Alpha With Modular Chain Approach - Decrypt",
        "content": "Jul 17, 8:44 am\n\nThe Block\n\nEthereum Layer-2 Network Mantle Launches Mainnet Alpha With Modular Chain Approach\n\nMantle Network, an Ethereum Layer 2 blockchain, has launched its mainnet alpha after six months of development and testing. The network, backed by BitDAO, takes a modular chain approach, separating execution, data availability, consensus, and settlement into distinct layers. With its adaptive and iterative design, Mantle aims to stay at the forefront of technological breakthroughs in the Ethereum ecosystem."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LmFsdGNvaW5idXp6LmlvL25mdC9uZnQtbmV3cy1ldGhlcmV1bS11cC1uZnRzLW5vdC1zby1tdWNoLWp1bHktd2Vlay0yL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "NFT News | Ethereum Up NFTs Not So Much | July Week 2 - NFT - Altcoin Buzz",
        "content": "As we kick off another week in July, Bitcoin and Ethereum’s erratic price swings continue to enthrall investors. Bitcoin takes the stage with a confident stride while Ethereum also paints a vibrant picture, surging to new local heights at just over $2,1078.\n\nSo, the scene is set, and these digital behemoths are the center of attention. Will they maintain their upward trend, or will unexpected turns shape this week’s NFT market drama? Let’s plunge into the NFT Market and investigate the options!\n\n1) A Steady Week For NFT Trade Volume\n\nThe NFT market was consistent this week, maintaining a total trading volume of just under $85 million, holding steady from the previous week. While the market continues to face challenges and obstacles, there was no noticeable decrease in trading activity.\n\nHowever, It is crucial to remember that a stable trading volume does not necessarily designate traders becoming more interested or involved. On the contrary, it could be that the bottom is in, and the participants that remain are trading among themselves. It has been a while since new money has come in, and volume is being passed between collections and chains.\n\n2) Holders Are Holding Amidst The Mixed Circumstances\n\nNFTs continue to witness intriguing shifts in various aspects. It is evident that the NFT market goes on experiencing a mix of both positive and negative developments. On the one hand, the number of NFT holders continues to rise, reaching an impressive 4,580,186, indicating a tiny increase of 0.24%.\n\nHowever, there has been a considerable decline in active NFT traders, with a fall of 19.42%, accompanied by a significant decrease of 23.50% in the number of sellers. Moreover, the count of buyers also saw a decline of 14.24%. These figures suggest a shift in the market dynamics, potentially signifying a temporary downturn.\n\n3) NFT OpenSea Trading – Positive rise in Unique Active Wallet Transaction\n\nThe current week he experienced notable changes in key metrics of OpenSea. The total count of unique active wallets engaged in transactions witnessed a positive growth of 4.01%, totaling 11.07k. This rise indicates a reversal of the declining trend seen in the previous week. However, the number of transactions on the platform experienced a slight decrease of 0.14%, settling at 20.36k. Similarly, the trade volume dropped 3.62%, amounting to $2.92 million.\n\nOn the bright side, the smart contract balance increased by 0.29% to $67.83k, showcasing a steady increment in the funds held within smart contracts on the OpenSea platform.\n\n4) Slight Dip In Blur Activity\n\nThe market data for this week show that the Blur market is still in ebb and flow. In stark contrast to the previous week, the market encountered a considerable decline in several crucial indicators, signaling a shifting landscape. The total count of unique active wallets dwindled to 13.35k, plummeting by 16.45%. Consequently, the number of transactions experienced a significant downturn of 16%, totaling 42.77k, reflecting a decreased market engagement.\n\nTrade volume also suffered a notable setback, plummeting by 33.24% to $121.51M, indicating decreased market liquidity. While the smart contract balance declined slightly by 0.99% to $115.01M, its overall impact remained relatively stable. These fluctuations emphasize the dynamic nature of the Blur market, underscoring the need for adaptability and strategic decision-making in the face of evolving trends.\n\n5) Solana NFTs\n\nThis week, Solana NFTs witnessed a significant decline in various crucial parameters. The total count of unique active wallets experienced a sharp drop of 16.45%, reaching 13.35k. Moreover, the number of transactions decreased by 16%, totaling 42.77k. The trade volume hit substantially, plummeting by 33.24% to $121.51 million. The smart contract balance dipped slightly by 0.99%, reaching $115.01 million. Unfortunately, this week’s report paints a picture of diminishing activity and reduced investor interest in Solana NFTs.\n\n6) Polygon NFTs\n\nOver the past week, the dynamic landscape of the Polygon NFT market has witnessed several intriguing transformations across various platforms. Polygon NFTs on OpenSea continue to impress.\n\nThe statistics show this week was a winning game for OpenSea. The average price of NFTs on OpenSea experienced a substantial surge, climbing by an astounding 31.71% to reach $21.94. This notable increase in average price indicates growing demand and value appreciation for NFTs on the platform. Moreover, OpenSea attracted a larger audience of traders, with the number of participants rising by 10.66% to an impressive count of 12,827. Additionally, OpenSea witnessed commendable growth in trading volume, which soared by 25.94% to reach $436.24k, stating the platform’s growing popularity for Polygon NFTs.\n\nHowever, the rest of the Polygon Market places saw declines. Jump.trade Faces Challenges. The average price of NFTs on Jump.trade experienced a slight decline of 2.56%, settling at $29.44. Furthermore, the number of traders on Jump.trade showed a notable decrease, declining by 34.14% to 54 traders, indicating a temporary dip in participation and market activity. Additionally, the platform experienced a considerable drop in trading volume, which decreased by 29.38% to a total of $13.72k, suggesting a temporary slowdown in the platform’s transactional momentum.\n\nOKX NFT Marketplace Faces Headwinds. The OKX NFT Marketplace encountered challenges this week. The average price of NFTs on the platform experienced a dip of 5.02%, settling at $3.85. The number of traders witnessed a remarkable increase, rising 106.39% to 3,678 traders. However, trading volume declined by 51.66%, reaching $5.39k, indicating a temporary slowdown in transactional activity within the platform.\n\n7) Quick News Round-Up\n\nGet Protocol Raises $45 Million to Revolutionize Ticketing Industry with NFTs.\n\nGet Protocol, a blockchain-based ticketing platform, has successfully secured $45 million in funding to disrupt the ticketing industry by leveraging non-fungible tokens (NFTs).\n\nGet Protocol uses NFTs to combat ticket fraud, scalping, and counterfeiting, boosting transparency and security for event organizers and ticket buyers.\n\n2. CryptoPunk DJ Signs with WME and Plans Music Releases\n\nA CryptoPunk DJ, known by his seed phrase, has signed with talent agency WME.\n\nThe artist intends to release music in the near future, combining the worlds of cryptocurrency and music.\n\n3. Notorious B.I.G. Iconic Photo Auctioned as Ethereum NFT\n\nAn iconic photograph of the late rapper Notorious B.I.G., taken by Barron Claiborne, is being auctioned as a non-fungible token (NFT) on Ethereum.\n\nThe NFT auction, hosted by the auction house Sotheby’s, allows fans to bid on the digital representation of the famous image, capturing the opportunity to own a unique piece of hip-hop history.\n\n4. Binance Labs Invests $15 Million in Crypto Game Publisher Xterio\n\nBinance Labs, the investment arm of Binance, has made a $15 million investment in Xterio, a crypto game publisher.\n\nThis investment aims to support Xterio’s development and growth in the crypto gaming industry.\n\n⬆️ For more cryptocurrency news, check out the Altcoin Buzz YouTube channel.\n\n⬆️ Check out our most up-to-date research, NFT and Metaverse buy, and how to protect your portfolio in this market by checking out our Altcoin Buzz Access group, which for a limited time, is FREE. Try it today."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiH2h0dHBzOi8vd3d3Lm9reC5jb20vbGVhcm4vbGluZWHSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "About Linea: A groundbreaking Ethereum scalability solution - OKX",
        "content": "ConsenSys is the leading global blockchain technology company behind a groundbreaking new solution that's helping address Ethereum's scalability challenge — Linea.\n\nTo date, ConsenSys has been pivotal in advancing the adoption and development of decentralized applications (DApps) on the Ethereum blockchain. Founded by Joseph Lubin, one of the co-founders of Ethereum, ConsenSys has emerged as a key player in the blockchain space.\n\nThe company provides a wide range of services and products catering to the blockchain ecosystem's different aspects. From infrastructure solutions to developer tools and enterprise platforms, ConsenSys offers a comprehensive suite of offerings to empower businesses and individuals to realize the potential of blockchain technology.\n\nOne of ConsenSys' core objectives is driving innovation and scalability on the Ethereum network. Ethereum, known for its smart contract functionality, has gained significant popularity and widespread usage. However, scalability has become a pressing challenge as more applications and users join the network. ConsenSys is actively developing and implementing solutions to address this scalability bottleneck.\n\nLinea is the latest advancement in ConsenSys zkEVM, enabling a new wave of cutting-edge DApps on the Ethereum blockchain. By leveraging zkEVM technology, Linea can help enhance the scalability of Ethereum-based DApps.\n\nUnderstanding Ethereum's scalability challenges\n\nDespite Ethereum's transition from a Proof-of-Work (PoW) to a Proof-of-Stake (PoS) consensus mechanism, it still encounters notable scalability challenges.\n\nNetwork congestion During periods of high activity, the Ethereum network can become congested, leading to slower transaction processing times and increased fees. This congestion limits the network's capacity to handle many transactions simultaneously.\n\nLimited transaction throughput Ethereum's current design restricts the number of transactions processed per second, resulting in scalability limitations. As demand increases, the network may struggle to accommodate all transaction requests promptly.\n\nHigh gas fees Gas fees are payments made by users to execute transactions and smart contracts on the Ethereum network. Gas fees can surge during peak times, making it expensive for users to interact with DApps and perform transactions.\n\nBlockchain size and synchronization As the Ethereum blockchain grows due to transaction history and smart contract execution, new network participants face challenges in synchronizing and storing the entire blockchain, impacting scalability.\n\nSmart contract execution Ethereum's sequential execution of smart contracts limits parallel processing capabilities. As a result, complex and resource-intensive smart contracts can cause delays, hindering overall scalability.\n\nScalability issues profoundly impact Ethereum's performance and user experience, hindering its ability to handle a growing user base and increasing transaction volumes. The combination of slow transaction processing and high fees can make Ethereum less accessible to a broader user base, potentially slowing its wider adoption. Small businesses, individuals, and developers may find it challenging to apply Ethereum for their applications or transactions due to the limited user experience.\n\nThe good news is, Ethereum 2.0 is poised to revolutionize the user experience by introducing faster transaction processing times, reducing fees, and expanding network capacity. These enhancements aim to create a seamless and efficient user environment, enabling a more comprehensive array of applications and interactions on the Ethereum network.\n\nAdditionally, the emergence of layer 2 solutions further addresses these challenges, providing support and alleviating pain points. With Ethereum 2.0's improved scalability and infrastructure, developers gain exciting opportunities to build and deploy DApps faster and more efficiently. This advancement encourages innovation and attracts a larger pool of developers to contribute to the vibrant Ethereum ecosystem.\n\nWhat is Linea?\n\nLinea, developed by ConsenSys, is a groundbreaking project addressing Ethereum's scalability challenges. Its purpose is to provide a scalable layer 2 solution that enhances the performance and usability of the Ethereum network. With Linea, ConsenSys seeks to unlock the full potential of DApps by tackling the limitations of the Ethereum mainnet.\n\nScalability is a crucial challenge for Ethereum, and Linea offers a solution by leveraging innovative technology and architecture. It uses zero-knowledge proofs and off-chain computation techniques to optimize transaction processing and ease network congestion.\n\nBy performing complex computations off-chain and submitting only essential information to the Ethereum mainnet, Linea significantly increases transaction throughput, enabling faster and more cost-effective transactions.\n\nLinea's architecture revolves around its zkEVM (Zero-Knowledge Ethereum Virtual Machine) rollup network. It combines the power of zero-knowledge proofs with Ethereum Virtual Machine (EVM) compatibility, allowing Linea to operate on par with the EVM.\n\nThis compatibility ensures seamless integration with existing Ethereum smart contracts and DApps, allowing developers to leverage Linea's scalability benefits without requiring major code modifications.\n\nThe components of Linea's architecture work in harmony to achieve scalability. The zkEVM rollup network processes transactions off-chain while maintaining the security and integrity of the Ethereum mainnet. Zero-knowledge proofs provide efficient and secure verification of computations, reducing the burden on the network and enhancing scalability. Linea's architecture also seamlessly integrates with other Ethereum tools and services, offering developers a streamlined experience in building and deploying scalable DApps.\n\nWith Linea, ConsenSys will help Ethereum take a significant step towards becoming a more efficient, scalable, and widely adopted blockchain platform.\n\nWhat's the tech behind Linea?\n\nLinea represents a significant leap forward in tackling Ethereum's scalability challenges. Linea leverages cutting-edge technology, including zero-knowledge (ZK) cryptography, zkSync, and StarkWare, to provide a robust solution that enhances scalability while maintaining security and interoperability.\n\nThe power of ZK cryptography\n\nLinea's foundation lies in the innovative realm of ZK cryptography. This cryptographic technique enables efficient and secure verification of transactions without revealing sensitive data. Linea's adoption of ZK cryptography results from extensive research and development in the field, paving the way for scalable and privacy-preserving solutions.\n\nzkSync: Empowering off-chain scaling\n\nAt the heart of Linea's technology stack is zkSync, a layer 2 scaling solution that uses ZK proofs. By processing transactions off-chain, zkSync significantly reduces congestion on the Ethereum mainnet, leading to faster and more cost-effective transactions. This approach unlocks tremendous scalability potential, making sure Ethereum can handle a growing user base and increasing transaction volumes.\n\nStarkWare: Enabling privacy and efficiency\n\nAnother critical component integrated into Linea is StarkWare's technology. StarkWare provides scalability solutions through its STARK technology, which enables efficient verification of computations while preserving privacy. By incorporating StarkWare's expertise, Linea ensures the secure and private execution of off-chain computations, enhancing scalability and user confidence.\n\nRollups: Unleashing scalability potential\n\nA fundamental concept in Linea's architecture is rollups. Rollups enable the aggregation of multiple transactions or computations off-chain, resulting in a summarized proof submitted to the Ethereum mainnet. This approach drastically reduces on-chain processing, improving scalability.\n\nLinea's zkEVM rollup network is a powerful layer 2 solution, efficiently processing transactions and smart contract computations off-chain while ensuring integrity and security.\n\nIntegration with Ethereum and beyond\n\nLinea seamlessly integrates with the Ethereum network, enhancing its scalability and performance. It operates as a layer 2 solution built on Ethereum's existing infrastructure, capitalizing on the network's security and decentralization.\n\nThanks to EVM compatibility, Linea offers a seamless integration process, allowing existing Ethereum smart contracts and DApps to leverage its scalability benefits without extensive modifications.\n\nMoreover, Linea aspires to collaborate with other blockchain platforms. Through interoperability protocols and cross-chain bridges, Linea sees a future where it can communicate and facilitate asset transfers across different blockchain networks. This integration opens up exciting opportunities for cross-platform collaboration and the expansion of Linea's ecosystem.\n\nWhat's next for Linea?\n\nLinea can potentially revolutionize Ethereum and the broader blockchain ecosystem in two ways. Firstly, by integrating zkEVM and rollup technology, Linea can overcome Ethereum's scalability limitations, enhancing transaction throughput and scalability. This can drive innovation, attract more developers, and solidify Ethereum's position as a leading blockchain platform.\n\nSecondly, Linea's focus on interoperability and portability enables seamless migration of DApps between Linea and other EVM-supported chains. This eliminates the need for rewriting contracts and simplifies the development process, making it easier for developers to build on Linea. Additionally, Linea's interoperability expands its reach beyond Ethereum, allowing integration with other blockchain platforms and contributing to a more interconnected and versatile blockchain ecosystem.\n\nLinea offers many benefits for both developers and users in the blockchain space. Developers can apply Linea's integration of zkEVM and rollup technology to build scalable and high-performance DApps with improved transaction throughput and reduced congestion.\n\nThe seamless compatibility with existing Ethereum smart contracts enables developers to migrate their DApps effortlessly between Linea and other EVM-supported chains, streamlining the development process and expanding their application's reach.\n\nFor users, Linea delivers a more efficient and user-friendly experience with faster transaction processing times, lower fees, and the ability to access and use assets across different blockchain platforms, enhancing convenience and control.\n\nWith its scalability and interoperability features, Linea supports innovation, growth, and accessibility in the blockchain ecosystem.\n\nWhile Linea holds great promise in enhancing scalability and improving user experiences, some potential challenges may need to be addressed during its rollout.\n\nLimited access during initial rollout During the mainnet alpha phase, Linea's network and remote procedure calls will only be accessible to launch partners, potentially posing initial challenges for developers and users outside the partner ecosystem.\n\nLimited withdrawal limits Initially, Linea imposes withdrawal limits that will gradually decrease and be eliminated over the first 90 days in collaboration with bridge partners. Although this supports network security and stability, it may inconvenience users needing immediate access to their assets.\n\nDelay in state changes on the Ethereum mainnet Linea introduces a delay between the layer 2 network and the Ethereum mainnet, with state changes committed after at least eight hours. This safeguard protects user assets from potential malicious actors but introduces a delay in transaction finality, affecting time-sensitive applications.\n\nIncomplete EVM opcode and precompile coverage The Linea mainnet alpha may lack full coverage of EVM opcodes and precompiles, but the team plans to implement them based on feedback and specifications. This limited coverage may temporarily restrict the functionality and compatibility of specific smart contracts and DApps on the Linea network.\n\nTo help ease any hurdles, Linea has invited developers and community members to participate in its bug bounty program.\n\nLinea's roadmap progresses through phases, with exciting features to look forward to:\n\nPhase 0: Establish the mainnet alpha with zkEVM and the Security Council.\n\nPhase 1: Focuses on open-sourcing the codebase and achieving 100% EVM coverage.\n\nPhase 2: Expanding the Security Council and enabling censorship-resistant withdrawals.\n\nPhase 3: Decentralizing operators and governance.\n\nPhase 4: Introduce a Multi-Prover rollup and limit governance powers for a robust and decentralized ecosystem.\n\nWe'll keep you updated on how things progress with Linea's roadmap.\n\nThe final word\n\nBy incorporating advanced technologies like zero-knowledge proofs and off-chain computation, Linea offers a scalable layer 2 solution that enhances the performance and usability of the Ethereum network. Its zkEVM rollup network ensures compatibility with existing smart contracts and enables seamless integration with other Ethereum tools and services.\n\nWith Linea, developers can build scalable DApps and transition existing applications without significant code modifications, while users benefit from faster transactions and reduced fees. Linea represents an important step forward for Ethereum, propelling it towards becoming a more efficient, scalable, and widely adopted blockchain platform.\n\nAs Linea revolutionizes Ethereum's capabilities, it paves the way for increased innovation, growth, and accessibility in decentralized applications.\n\nDisclaimer:\n\nTHIS ARTICLE IS PROVIDED FOR INFORMATIONAL PURPOSES ONLY. IT IS NOT INTENDED TO PROVIDE ANY INVESTMENT, TAX, OR LEGAL ADVICE, NOR SHOULD IT BE CONSIDERED AN OFFER TO PURCHASE OR SELL OR HOLD DIGITAL ASSETS. DIGITAL ASSET HOLDINGS, INCLUDING STABLECOINS, INVOLVE A HIGH DEGREE OF RISK, CAN FLUCTUATE GREATLY, AND CAN EVEN BECOME WORTHLESS. YOU SHOULD CAREFULLY CONSIDER WHETHER TRADING OR HOLDING DIGITAL ASSETS IS SUITABLE FOR YOU IN LIGHT OF YOUR FINANCIAL CONDITION. PLEASE CONSULT YOUR LEGAL/TAX/INVESTMENT PROFESSIONAL FOR QUESTIONS ABOUT YOUR SPECIFIC CIRCUMSTANCES."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vZGVjcnlwdC5jby9yZXNvdXJjZXMvd2hhdC1pcy1nbm9zaXMtbGVhcm4tYXJ0aWNsZdIBP2h0dHBzOi8vZGVjcnlwdC5jby9yZXNvdXJjZXMvd2hhdC1pcy1nbm9zaXMtbGVhcm4tYXJ0aWNsZT9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "What Is Gnosis? How Decentralized Prediction Markets Work - Decrypt",
        "content": "In brief Gnosis started out in 2015 as a decentralized prediction market on the Ethereum blockchain.\n\nEstablished at the end of 2020, GnosisDAO is the collective steward of the Gnosis ecosystem.\n\nThe CoW (Confidence of Wants) protocol is a permissionless decentralized exchange (DEX)\n\nYour Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nOriginally envisioned as a decentralized prediction market, Gnosis is a blockchain project running on top of the Ethereum network.\n\nGnosis started out in 2015 as a decentralized prediction market on the Ethereum blockchain. Originally, the team behind the project intended to develop a platform similar to the once promising betting platform Augur, with the now discontinued Gnosis Olympia becoming the project’s first flagship decentralized application (dApp).\n\n\n\nThe idea of a prediction market is still very much alive though: while Gnosis itself serves as an open framework, prediction markets are realized in third-party dApps built on top the Gnosis Chain, such as Azuro, Omen, and Reality Card. These platforms allow users to bet on the outcome of sport events, cryptocurrency prices, technology developments and politics, among other categories.\n\nWith the realization of a greater need for infrastructure tools to expand the utility of the Ethereum ecosystem, Gnosis also moved to develop products such as a decentralized custody protocol and asset management platform Safe (previously known as Gnosis Safe) and the CoW Protocol (previously known as the xotocol), a permissionless trading protocol, which—somewhat similar to the way Uniswap and 1inch work— finds the lowest price for trades across exchanges and aggregators.\n\n\n\nOther products developed by Gnosis include Conditional Tokens— a new asset class designed to facilitate the creation of highly liquid prediction markets, with the value of the assets directly correlated to the outcome of an event, as well as Gnosis Auction and Zodiac.\n\nAD\n\nAD\n\nGnosis Auction helps projects discover a fair price for their token, whereas Zodiac is a collection of tools for composable Decentralized Autonomous Organizations (DAOs).\n\nIn November 2020, Gnosis announced the creation of GnosisDAO, described as a prediction market-driven collective with the mission to successfully steward the Gnosis ecosystem through futarchy—a form of governance where prediction markets play a crucial role in determining which policies will have the most positive effect.\n\n\n\nNext year, the xDai and GnosisDAO communities voted to merge their ecosystems to create the Gnosis Chain— an EVM-based Ethereum sidechain for stable transactions that leverages the xDai token.\n\n\n\nSafe, in its turn, announced the launch of its SafeDAO and Safe Token in September 2022.\n\nThe Gnosis ecosystem overview\n\nThe Gnosis ecosystem is powered by a native token called GNO, which is used for staking on the Gnosis Beacon Chain and serves as the governance token for the GnosisDAO.\n\nTo improve the utility of the Ethereum blockchain, the Gnosis ecosystem relies on several components.\n\n\n\nCoW Protocol\n\nThe CoW (Confidence of Wants) protocol is a permissionless decentralized exchange (DEX), enabling users to exchange any ERC-20 token—a token standard that allows developers to create their own tokens on the Ethereum network.\n\nAD\n\nAD\n\nWhat sets the CoW protocol apart from other DEXs is its unique approach to matching and executing trades. Rather than using an automated market maker system that relies on user-provided liquidity, the CoW Protocol matches buyers and sellers through multi-token batch auctions and executes trades at the most favorable available price.\n\nThe batch auction mechanism functions by consolidating buy and sell orders every five minutes. Other users can then vie to offer the best order settlement for the group of trades, a process referred to as \"solving.\" Individuals who engage in this activity on the protocol are known as \"solvers.\"\n\nBy employing solving, traders on the CoW Protocol are shielded from miner extractable value (MEV), which refers to the process where individuals who create new ETH can further profit by manipulating their control over the network and prioritizing certain users’ transactions.\n\nSafe\n\nSafe is a customizable multisignature wallet infrastructure that operates as a smart contract wallet on the Ethereum network, mandating a predetermined number of approvals before a transaction can be executed.\n\nSafe offers support for ETH, ERC-20 and ERC-721 (NFTs) tokens, as well as the ability to interact with various DeFi platforms.\n\n\n\nSafe is governed by SafeDAO, a decentralized collective of core contributors, backers, users and ecosystem contributors, collectively known as Safe Guardians.\n\nGnosis Chain\n\nThe Gnosis Chain is an Ethereum Virtual Machine (EVM) execution-layer chain that utilizes the xDAI stablecoin to enable transactions and cover fees. The network's security is ensured by the Gnosis Beacon Chain (GBC) consensus layer.\n\nAD\n\nAD\n\nThe GBC uses a Proof-of-Stake (PoS) mechanism, where users lock up a certain amount of GNO tokens to participate in the transaction validation process. By doing so, they can earn additional GNO tokens as a reward for aiding in securing the network.\n\nGnosisDAO\n\nEstablished at the end of 2020, GnosisDAO is the collective steward of the Gnosis ecosystem.\n\nAs a DAO, Gnosis uses the products it creates to guide decisions on the development, support and governance of its ecosystem.\n\nThe GnosisDAO governance process is primarily conducted on the Gnosis Forum, with every successful proposal required to pass three phases before being approved. The governance process is permissionless, meaning there’s no single entity restricting access or controlling participation, with the only requirement that community members hold a minimum of 1 GNO to participate in the GnosisDAO Snapshot poll that makes a ruling on a proposal’s outcome.\n\nToday, the GnosisDAO treasury controls over 150,000 ETH and 8 million GNO, with the GNO tokens vested over eight years.\n\n\n\n\n\n\n\n"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMivwFodHRwczovL2NyeXB0b25ld3MuY29tL25ld3MvdG9kYXktaW4tY3J5cHRvLWdub3Npcy1yZWxlYXNlZC1wYXktYW5kLWNhcmQtcHJvZHVjdHMtY2xhYnMtcHJvcG9zZXMtbWlncmF0aW5nLWNlbG8tdG8tbGF5ZXItMi1idWlsdC1vbi1ldGhlcmV1bS11bnN0b3BwYWJsZS1kb21haW5zLWFkZHMtZW5zLWJhc2VkLWV0aC1kb21haW5zLmh0bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Today in Crypto: Gnosis Released Pay and Card Products, cLabs Proposes Migrating Celo to Layer 2 Built on ... - Cryptonews",
        "content": "Today in Crypto: Gnosis Released Pay and Card Products, cLabs Proposes Migrating Celo to Layer 2 Built on Ethereum, Unstoppable Domains Adds ENS-based .eth Domains\n\nSource: gnosispay.com\n\nGet your daily, bite-sized digest of cryptoasset and blockchain-related news – investigating the stories flying under the radar of today’s crypto news.\n\n__________\n\nPayments news\n\nGnosis, a sidechain to Ethereum, announced today that it is releasing Gnosis Pay and Gnosis Card, described as “the World’s First Decentralized Payment Network and Self-Custodial Debit Card.” The team said that with Gnosis Pay, users can spend digital assets directly from their wallets wherever Visa is accepted. It fuses Visa Debit functionality with smart wallet technology from Safe. It added that the Gnosis Card is linked directly to an onchain wallet instead of a traditional bank account, built on the Gnosis Pay decentralized payment network.\n\nBlockchain news\n\ncLabs , the core developer behind the Celo blockchain, proposed migrating its network from Layer 1 to Layer 2 built on Ethereum . The team said that this would enable building openly in the spirit of Web3, while the upgrade has the potential to enhance the scope and impact of Celo through increased security – given that Celo would inherit Ethereum security. “As Celo becomes run partly by Ethereum node operators through EigenLayer , this would also make Celo the first major project with a restaking use case,” said the announcement, The team also wants to use the OP Stack , a tool offered by Optimism , to facilitate the transition and build its chain’s requirements.\n\n, the core developer behind the blockchain, proposed migrating its network from Layer 1 to Layer 2 built on . The team said that this would enable building openly in the spirit of Web3, while the upgrade has the potential to enhance the scope and impact of Celo through increased security – given that Celo would inherit Ethereum security. “As Celo becomes run partly by Ethereum node operators through , this would also make Celo the first major project with a restaking use case,” said the announcement, The team also wants to use the , a tool offered by , to facilitate the transition and build its chain’s requirements. Mantle Network, a modular Ethereum layer-2 (L2) blockchain, unveiled its mainnet today at the EthCC in Paris. Per the press release, Mantle Network Mainnet Alpha is “the culmination of six months of development efforts, during which the network processed 14 million+ on-chain transactions, saw 140,000+ smart contracts deployed, welcomed 48,000+ developers, connected to 690,000+ unique wallet addresses, and maintained a monthly active wallet addresses count of 157,000+.” The testnet phase concluded following multiple security audits that helped remove potential risks and vulnerabilities, it added.\n\nDeFi news\n\nDomain and digital identity platform Unstoppable Domains today announced the addition of Ethereum Name Service (ENS)-based .eth domains to the Unstoppable website, with plans to become “the first one-stop shop for Web3 domains with support for all leading naming systems and blockchains.” The launch will allow anyone to natively buy .eth domains via Unstoppable, said the press release. Adding .eth domains to Unstoppable also gives users a single platform to buy their .eth, .nft, .crypto, and .polygon domains in one place. Every .eth domain purchased from Unstoppable will be registered through the ENS smart contract with the same full functionality as other .eth domains. In the coming months, Unstoppable will introduce the ability to manage .eth domains within the Unstoppable experience, including setting crypto addresses, managing on-chain profile data, and transferring .eth domains, the team added.\n\nInvestment news\n\nThe DFINITY Foundation , a not-for-profit science and technology organization and a contributor to the Internet Computer blockchain (ICP), today announced the launch of a $5 million decentralized artificial intelligence (DeAI) grant to support projects leveraging AI on ICP. The Internet Computer will be the first blockchain to run advanced AI models on its decentralized and permissionless network in a quasi-trustless mode, the team said, and “later, we will release full “AI smart contracts” leveraging work that enables neural networks to run deterministically.” Many projects on this blockchain already depend on AI, but the team anticipates “much heavier usage” once native Web3 AI is available.\n\n, a not-for-profit science and technology organization and a contributor to the Internet Computer blockchain (ICP), today announced the launch of a $5 million decentralized artificial intelligence (DeAI) grant to support projects leveraging AI on ICP. The Internet Computer will be the first blockchain to run advanced AI models on its decentralized and permissionless network in a quasi-trustless mode, the team said, and “later, we will release full “AI smart contracts” leveraging work that enables neural networks to run deterministically.” Many projects on this blockchain already depend on AI, but the team anticipates “much heavier usage” once native Web3 AI is available. ConsenSys, the Ethereum developer behind the MetaMask wallet, held talks with investors over the summer about a potential capital injection – it met with multiple investors about fundraising in recent weeks, The Block reported, citing four people familiar with the matter. However, the company claims that it is not actively fundraising. A spokesperson was quoted as saying that “the company has experienced a significant influx of inbound investor interest, fueled in part by inaccurate reporting on the secondary market activity in our stock earlier this year,” adding that the company does not need money and is “not actively engaged in a formal process.”\n\nSecurity news"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5jbmJjdHYxOC5jb20vcGhvdG9zL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZS10b2RheS0xNy1qdWx5LWJpdGNvaW4tZXRoZXJldW0tZG9nZWNvaW4tc29sYW5hLXNoaWJhLWludS1wb2x5Z29uLTE3MjM1NTgxLmh0bdIBjQFodHRwczovL3d3dy5jbmJjdHYxOC5jb20vcGhvdG9zL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZS10b2RheS0xNy1qdWx5LWJpdGNvaW4tZXRoZXJldW0tZG9nZWNvaW4tc29sYW5hLXNoaWJhLWludS1wb2x5Z29uLTE3MjM1NTgxLmh0bS9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin above 30k mark, Ethereum and other tokens trade mixed - CNBCTV18",
        "content": "1 / 8\n\nBitcoin | The world's largest and most popular virtual currency, Bitcoin, rose 0.2 percent to $30,279.4. Its market value stood at $588.6 billion. The trade volume was at $8.3 billion.\n\n2 / 8\n\n\"Bitcoin went below $30,000 briefly over the weekend as Ripple’s win against SEC enabled surge for the altcoins Bitcoin’s moving average indicates a ‘Buy’ sentiment whereas the market oscillators indicate a ‘Neutral’ sentiment,\" said Rajagopal Menon, Vice President, WazirX.\n\n3 / 8\n\nEthereum | The second largest virtual currency, Ethererum or Ether, fell 0.1 percent to $1,927.3 with a market capitalisation of $231.7 billion. The trade volume of Ethereum was $4.3 billion in the last 24 hours.\n\n4 / 8\n\n\"Ethereum is presently trading above $1,900, and we might see it trade within the narrow range of $1,900 to $1,950 this week,\" said Edul Patel of Mudrex.\n\n5 / 8\n\nDogecoin | Meme-based virtual currency, Dogecoin, fell half a percent. Its market value stood at $9.8 billion. The trade volume was at $335.9 billion.\n\n6 / 8\n\nSolana | Solana gained 2.3 percent to $28.1 with a market capitalisation of $11.4 billion. The trade volume of Solana was $707 million in the last 24 hours.\n\n7 / 8\n\nShiba Inu | Shiba Inu slid 0.8 percent with a market capitalisation of $4.7 billion. The trade volume was $91 million in the last 24 hours.\n\n8 / 8"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vY29pbnBlZGlhLm9yZy9iZWdpbm5lcnMtZ3VpZGUvd2hhdC1pcy1hcmJpdHJ1bS1ibG9ja2NoYWluL9IBRmh0dHBzOi8vY29pbnBlZGlhLm9yZy9iZWdpbm5lcnMtZ3VpZGUvd2hhdC1pcy1hcmJpdHJ1bS1ibG9ja2NoYWluL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jul 2023 07:00:00 GMT",
        "title": "Arbitrum 101: The Future of Ethereum Scaling is Here! - Coinpedia Fintech News",
        "content": "Qadir Ak is the founder of Coinpedia. He has over a decade of experience writing about technology and has been covering the blockchain and cryptocurrency space since 2010. He has also interviewed a few prominent experts within the cryptocurrency space.\n\nArbitrum is one of the most promising layer-2 scaling solutions for Ethereum. It offers a number of advantages over the Ethereum mainnet, including faster transaction speeds, lower fees, and full compatibility with existing Ethereum applications.\n\nAs the Ethereum ecosystem continues to grow, Arbitrum is poised to play a major role in enabling its scalability and adoption.\n\nWhat will you learn in this article?\n\nWhat is Arbitrum and how does it work?\n\nThe benefits of using Arbitrum\n\nThe risks associated with Arbitrum\n\nThe Arbitrum ecosystem\n\nThe future of Arbitrum\n\nWe know you can’t wait to get started. Dive in!\n\nKey Takeaways Layer 2 scaling solutions like Arbitrum offer faster and cheaper transactions to solve Ethereum’s scaling problems.It uses optimistic rollup to batch transactions and execute them off-chain.It is one of the fastest growing Layer-2 solutions, with over 50% YoY growth in developers.\n\n1. What is Arbitrum?\n\nA layer-2 scaling solution for Ethereum, Arbitrum is devised to work on the scalability and reduce the high gas fees linked to the Ethereum network. It is operating as a sidechain which runs with Ethereum mainnet and offers faster and cheaper transactions.\n\nIt is compatible with Ethereum’s smart contracts which makes the developers port their existing Ethereum applications to Arbitrum with very minimum modifications.\n\nIt uses an “optimistic rollup” approach which makes sure that most transactions are processed off-chain and validated on-chain, thus reducing the load on the Ethereum mainnet.\n\nAs the transactions are processed off-chain, there is much lower gas fees in comparison to Ethereum.\n\nIt relies on Ethereum’s security for dispute resolution.\n\nIt is compatible with Ethereum’s ecosystem.\n\n1.1. Overview\n\nIn 2018, a team of researchers and engineers established Offchain Labs, laying the foundation for what would become Arbitrum. The primary objective was to tackle the scalability and high gas fee issues plaguing Ethereum. In 2019, Offchain Labs introduced the alpha version of Arbitrum, a proof-of-concept showcasing its advanced rollup technology. The most significant milestone came in 2021 with the launch of Arbitrum One, the mainnet version of Arbitrum. This marked a major step towards providing a layer-2 solution for the Ethereum ecosystem.\n\n1.2. How Does it Work?\n\nLet us consider Arbitrum as a super-fast and cost-effective express line for the Ethereum network.\n\nWhen someone wants to work with Ethereum, like trading, he can send the transaction to Arbitrum instead of the main Ethereum line.\n\nArbitrum processes the work off-chain, just like a secret shortcut, making things super quick without dealing with heavy traffic.\n\nOnce a transaction is processed on Arbitrum’s express line , one gets a ticket faster. It is verified on Ethereum’s main line which is slower but secure.\n\nArbitrum takes less fees for faster rides as its work is mostly off-chain.\n\nIn case of disputes, Ethereum’s security guards (its decentralised network) step in to rectify everything.\n\nIt makes using Ethereum faster and cheaper by using a very wise shortcut.\n\n1.3. Deciphering Layer 2 Scaling\n\nLayer 2 scaling is akin to adding an extra express highway alongside the main road to reduce traffic congestion. In the cryptocurrency world, it involves creating a secondary layer parallel to the primary blockchain, enabling faster and more cost-effective transaction processing. This secondary layer can manage numerous transactions without overburdening the primary blockchain, enhancing overall system efficiency.\n\n1.4. The Arbitrum Airdrop\n\nAn Airdrop refers to the distribution of tokens to eligible users who actively engage with the Arbitrum Layer 2 scaling solution. Here’s how the Arbitrum Airdrop operates:\n\nTo qualify, users must interact with the Arbitrum network, whether by using DApps or conducting transactions on Arbitrum Layer 2.\n\nThe Airdrop team takes a “snapshot” of the Ethereum blockchain at a specific block height, recording the addresses and balances of users active on Arbitrum up to that point.\n\nAfter the snapshot, tokens are distributed to eligible addresses on a one-to-one basis.\n\nIn some cases, users may need to claim their tokens through a website or transaction.\n\nOnce received, these tokens can be used in various ways.\n\nArbitrum airdrops reward early adopters and promote blockchain technology usage, fostering the growth of the ecosystem. One of the highly anticipated airdrops in 2023 is $ARB, with specific criteria for “active” user qualification.\n\n1.5. The ARB Token in Focus\n\nARB is the native ERC-20 compatible governance token for the Arbitrum network, serving various functions, including value transfer, investment, and governance voting. The initial supply of $ARB at launch was 10 billion, with a 2% annual inflation rate. In March 2023, approximately 12.75% of the total supply was distributed among eligible users and DAOs, resulting in a circulating supply of around 1.275 billion $ARB.\n\nARB tokens grant users a voice in Arbitrum DAO governance. The DAO plays a pivotal role in decision-making regarding fund allocation, protocol operations, and system investments. These decisions are made transparently on platforms like Snapshot.org, where users can cast their votes. ARB token holders also participate in the election of members for the security council, a 12-member team responsible for managing the treasury wallet.\n\n2. What is the Arbitrum Bridge?\n\nIt is a mechanism which allows a user to move his assets between Ethereum blockchain (Layer 1) and Arbitrum Layer 2 network. It is like a bridge connecting two stations, Ethereum mainnet and Arbitrum Layer 2.\n\nTo use it, first deposit the assets, Ether (ETH) or other tokens, into a smart contract on Ethereum mainnet.\n\nAfter depositing the assets, initiate a transfer through Arbitrum bridge by sending a request or transaction from Ethereum to Arbitrum.\n\nOnce a request is received, it processes it on the Arbitrum layer 2 network. The assets become available on Arbitrum, where they can be used for faster and cheaper transactions.\n\nThe assets can be moved back to Ethereum mainnet by initiating a withdrawal from Arbitrum bridge. The bridge would release the assets on Ethereum, and they become available on Ethereum again.\n\n3. Key Benefits of Arbitrum\n\nArbitrum offers several advantages, making it a compelling choice for Ethereum users and developers:\n\nTransaction Acceleration: Arbitrum significantly accelerates transaction processing, supporting a high number of transactions per second. This enhanced speed results in quicker and more efficient interactions with DApps. Reduced Transaction Fees: Users can enjoy lower transaction fees when compared to the Ethereum mainnet, reducing the overall cost of engaging with the network. Full Ethereum Compatibility: Arbitrum ensures full compatibility with Ethereum, allowing seamless migration of existing Ethereum applications with minimal adjustments. Scalability Enhancement: By offloading transactions and smart contract processing to Layer 2, Arbitrum alleviates network congestion on the Ethereum mainnet, enhancing overall scalability. Security Focus: Arbitrum places a strong emphasis on security by relying on Ethereum’s robust security model, assuring users of a safe environment for their activities. Interoperability: Arbitrum enables seamless asset movement between Ethereum and its Layer 2 solution using bridges, ensuring users can transition between the two layers with ease. Developer-Friendly: Developers can create smart contracts on Arbitrum with minimal adjustments to their existing Ethereum code, simplifying the development process. Improved User Experience: The improved speed and cost-effectiveness of Arbitrum translate to an enhanced user experience for both users and traders.\n\n4. Arbitrum Ecosystem Explained\n\nThe Arbitrum ecosystem encompasses various essential products, each designed to enhance the network’s functionality and accessibility. Here are the major components:\n\nArbitrum One\n\nLaunched in August 2021, Arbitrum One serves as the official mainnet of the Arbitrum ecosystem. It powers the system and processes transactions on the Arbitrum Virtual Machine (AVM), an extension that’s fully compatible with Ethereum’s EVM.\n\nArbitrum Nitro\n\nArbitrum Nitro represents a significant technical upgrade to the underlying technology of the Arbitrum One ecosystem. With Nitro, the network becomes faster, more EVM-compatible, and more cost-effective.\n\nArbitrum Nova\n\nArbitrum Nova is a new chain dedicated to reducing individual transaction costs by minimizing data storage on the Ethereum blockchain. This is particularly beneficial for games and social DApps with a high volume of transactions but low individual transaction value.\n\n5. Risk Analysis\n\nIt’s essential to recognize potential risks associated with Arbitrum:\n\nSmart Contract Vulnerabilities: Bugs or flaws in smart contracts could lead to fund losses. Validator Control: Arbitrum relies on a set of validators to confirm transactions, which may introduce centralization risks. Dependency on Ethereum: Any issues in the Ethereum mainnet could impact Arbitrum’s security and functionality. Bridge Security: The use of bridges introduces potential security risks if not managed effectively. Regulatory Impact: Regulatory changes could affect the use of Arbitrum. Scaling Limitations: Arbitrum may experience scaling limitations during periods of high demand, potentially leading to slower transactions or increased fees. Complexity: Layer 2 solutions like Arbitrum can be more complex for users to understand and navigate compared to the Ethereum mainnet. Competition: Arbitrum faces competition from other Layer 2 solutions running parallel to its ecosystem.\n\nTo mitigate these risks, users should exercise caution, adopt best security practices, and stay informed about potential vulnerabilities.\n\n6. A Promising Future for Arbitrum\n\nArbitrum’s future is filled with optimism and promising developments. Some notable highlights include:\n\nIntroduction of Global Elastic nodes, providing a reliable and scalable approach to accessing Web3 data for developers.\n\nMaturation of current DApps such as GMX and Radiant on the network.\n\nThe launch of Bunni gauges, allowing users to stake BUNNY tokens on the network and earn rewards.\n\nA notable increase of 2.4 million active addresses on the blockchain in the past month as of July 2023.\n\nThe success of Arbitrum Nova with over 600,000 unique addresses.\n\nDespite governance disputes, Arbitrum has garnered widespread adoption.\n\nArbitrum’s Total Value Locked (TVL) in smart contracts ranks fourth after Binance Smart Chain, with a TVL of $2.26 billion.\n\nThese indicators suggest that Arbitrum is thriving and its market valuation is balanced. As a result, experts predict a promising future for Arbitrum in the cryptocurrency landscape.\n\n7. Final thoughts\n\nArbitrum is a promising Layer 2 scaling solution to Ethereum. It offers significant benefits like lower fees, higher transaction speed and improved scalability. It has been working towards improving Ethereum’s user experience. However, it is facing competition from other Layer 2 networks. With constant upgrades and regular improvements, Arbitrum could do wonders as a blockchain network!\n\nFAQs\n\nQ1. What is the use of Arbitrum? Arbitrum is a technology devised to scale Ethereum’s functionality and scalability. Q2. Is Arbitrum a good crypto? It is a layer two Ethereum scaling solution by Off-chain Labs. It has been trending since its inception. Experts call it a good crypto investment. Q3. Who owns Arbitrum? It was developed by Offchain Labs, a blockchain research and development company founded in 2018.\n\nWell Done! You have now completed the Lesson. Complete the Quiz and Get Certified! All The Best! Enroll Quiz\n\nDisclaimer and Risk Warning The information provided in this content by Coinpedia Academy is for general knowledge and educational purpose only. It is not financial, professional or legal advice, and does not endorse any specific product or service. The organization is not responsible for any losses you may experience. And, Creators own the copyright for images and videos used. If you find any of the contents published inappropriate, please feel free to inform us."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNy8xNy9mYW50b20tZnRtLWZvdW5kZXItYW5kcmUtY3JvbmplLXNheXMtbXVsdGljaGFpbi1oYWNrLXdhcy1hLWJpZy1ibG93LXRvLWV0aGVyZXVtLXJpdmFscy1lY29zeXN0ZW0v0gGGAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA3LzE3L2ZhbnRvbS1mdG0tZm91bmRlci1hbmRyZS1jcm9uamUtc2F5cy1tdWx0aWNoYWluLWhhY2std2FzLWEtYmlnLWJsb3ctdG8tZXRoZXJldW0tcml2YWxzLWVjb3N5c3RlbS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Fantom (FTM) Founder Andre Cronje Says Multichain Hack Was a ‘Big Blow’ to Ethereum Rival’s Ecosystem - The Daily Hodl",
        "content": "Fantom (FTM) creator Andre Cronje says that the recent exploit of cross-chain bridge Multichain was a massive setback for the Ethereum (ETH) rival.\n\nWriting in the community’s forum, Cronje says that the Fantom team was misled about the true security level of Multichain.\n\nCronje also says that he and his team plan to seek solutions that will make all victims of the Multichain hack whole.\n\n“Multichain was a big blow, we had a lot of assurances from the team around the server decentralization, access, and geolocation distribution. Don’t trust, verify (saying this to myself).\n\nWe are exploring all options at this point, working with relevant organizations to try and recover assets. Beyond that also looking into other backstops or helping recovery, even using foundation treasury. Until we have more data we just can’t give any hard confirmations. We won’t leave this as is though, we will do everything in our power to make everyone whole.\n\nWe are also continuing to engage with Circle, Tether, TrueUSD, Binance, etc. for native issuance, and reviewing roll-ups for native bridge infrastructure. When we have more verifiable information we will propose an action plan.\n\nAs you can imagine, the foundation and all of our staff had exposure to these assets as well.”\n\nMultichain’s Fantom bridge was exploited for at least $126 million as bad actors were able to steal a number of coins, including crypto assets such as Chainlink (LINK), Wrapped Bitcoin (wBTC), Wrapped Ethereum (wETH) and a trio of stablecoins.\n\nAccording to market analytics tool DefiLlama, Fantom’s total value locked (TVL) has fallen drastically, from $200 million before the incident to $67 million today.\n\nMultichain has since shuttered its operations, saying that its CEO was arrested by Chinese authorities in May and has not been in contact with the blockchain’s team ever since.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on Twitter, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/houchi"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiMWh0dHBzOi8vY29pbmRvby5jb20vaG93LXRvLWJ1eS1ldGhlcmV1bS1vbi1ldG9yby_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "How to Buy Ethereum on eToro - Latest Cryptocurrency Prices & Articles",
        "content": "Ethereum is the second most traded cryptocurrency and continues to amaze us with its implications within various sectors, being a leading player in the digital asset world. If you are intrigued by the potential of ETH and want to be part of this growing community, you have come to the right place.\n\nWhether you are new to crypto or an experienced trader, in this comprehensive guide, you will learn how to buy Ethereum on eToro, a trusted exchange platform that offers a straightforward and secure way to acquire and manage your Ethereum investments.\n\nSo, fasten your seatbelts, and embark on this journey into the realm of one of the most popular cryptocurrencies! By the end of this comprehensive guide, you’ll know how to navigate the eToro platform, purchasing Ethereum holding. Let’s dive in!\n\nThe Role of Ethereum in the Crypto World\n\nThe Ethereum ecosystem is growing daily, as it is the second-largest cryptocurrency by market capitalization. At this point, it’s no doubt that Ethereum stands at the core of blockchain and decentralized applications, having implications within many sectors, such as finance through decentralized finance or DeFi (Decentralized Finance) apps, art collectibles through NFTs (Non-Fungible Tokens), gaming, and technology.\n\nWithin Decentralized Applications (dApps), Ethereum aims to provide a platform for developing and deploying dApps. Also, it introduced the concept of self-executing contracts that operate in an automatic system to execute transactions and agreements when the conditions are met, thus eliminating intermediaries.\n\nMoreover, Ethereum future developments are strongly intertwined with the industry by being an open-source software platform for blockchain apps.\n\nWhat is the eToro Platform?\n\neToro is a user-friendly and straightforward brokerage and social trading platform that comes to the aid of many crypto enthusiasts, regardless of their trading skill level.\n\nOn eToro, you can choose your favorite crypto from the other 80 currencies and start trading immediately, without hassle, and in a secure environment. And speaking of security, eToro integrates multi-level security features, such as 2FA (2 Factor Authentication) verification, cold storage, FDIC-insured USD balances, multi-signature facilities, private keys, and KYC (Know Your Customer).\n\nIt is striking that the eToro user base has grown exponentially since its inception, and fast forward to the third quarter of 2022, the platform experienced exponential growth, reaching a staggering 31 million users.\n\nThese figures highlight the significant increase in eToro’s user base, demonstrating the platform’s popularity and the growing interest in cryptocurrencies and trading.\n\nThe Advantage of Buying Ethereum on eToro\n\nBesides the security measures, which say much about the trading platform, we could only move further by mentioning that eToro offers nonstop trading, even for fractional purchases, with minimal fees.\n\nAs the platform is easy to use and has a friendly interface, we could say that it’s suitable for everyone, especially the new starters, which have two different bonus experiences to strengthen their skills further: demo trading and copy trading, which allow users to test their trading strategy with practice funds, and mimic the trades of other crypto investors.\n\nAlso, eToro has no hidden fees, so transparency is the way to go. With a trading fee of 1% and a crypto conversion (minimum 0.3 ETH) of 0.006 units, eToro has managed to keep its users appeased.\n\nHow to buy Ethereum on eToro | Your Comprehensive Guide\n\nBefore joining million other users, be sure to create your eToro account. If you already have your account in place, please skip to step number two. For the rest of the newcomers, we have only one piece of advice: to take your time with the account setup, as we wanted to offer you one of the best guides on buying Ethereum on eToro.\n\nAlso, to buy Ethereum or any other coin on eToro, you will need fiat money; thus, checking your bank’s stance on cryptocurrency before creating an account is best.\n\nStep 1: Visit the official website to create your account\n\nStep 1.2: Create an eToro account\n\nStep 1.3: Follow the on-screen instructions\n\nStep 1.5: Verify your eToro account\n\nStep 1.6: Select the financial instruments\n\nStep 1.7: Complete your eToro account\n\nStep 1.8: Complete your address\n\nStep 1.9: Select your stock investment experience\n\nStep 1.10: Select the level of your crypto investing experience\n\nStep 1.11: Choose the leveraged investing experience\n\nStep 1.12: What is your trading knowledge?\n\nStep 1.13: Trading knowledge assessment\n\nStep 1.14: What is your trading strategy?\n\nStep 1.15: The Purpose of trading digital currencies\n\nStep 1.16: Your attitude to risk\n\nStep 1.17: Complete your eToro profile\n\nStep 1.18: Your financial status\n\nStep 1.19: Your eToro account resolution is here!\n\nStep 1.20: Complete your profile to deposit funds into your eToro account\n\nStep 2: Deposit Funds into your eToro account\n\nPlease note that the minimum deposit in fiat is 95 € or $100, and it can be done by using a credit or debit card or a regular bank transfer from your bank account. So, complete all the details and hit the “Deposit” button.\n\nStep 3: Buy Ethereum\n\nFrom your dashboard, type into the search bar “Ethereum,” navigate to the page, and click “Invest”; you’ll be buying Ethereum at the current market price.\n\nStep 4: Set Up a Crypto eToro Wallet\n\nWhen buying Ethereum on eToro, you have the option to store your currencies in your eToro account safely or create your eToro crypto wallet. Even though you are not required to have a crypto wallet, we highly recommend one.\n\nBuy Ethereum on eToro: Tips and Tricks\n\nUpon buying Ethereum on eToro, it’s essential to keep a few tips and tricks in mind to make the process smooth and successful. Here are some recommendations to consider:\n\n1. Conduct thorough research\n\nIndeed, the crypto world could be exciting and new; however, its volatility makes it susceptible to theft, fraud, and malware attacks. So, before investing, whether in Ethereum or any other digital currency, be sure to research. At Coindoo, we aim to constantly provide you with comprehensive crypto-related information, guides, reviews, and the latest regarding blockchain technology.\n\n2. Only invest funds that you are comfortable risking\n\nStar by making a rule only to invest what you are comfortable risking, but to reach this amount, you must consider your overall financial situation to your realistic long-term goals.\n\n3. Use eToro’s Copy Trader feature\n\nAs eToro offers this option for new traders, it is wise to take advantage of such a mechanism to leverage the expertise of experienced traders in the Ethereum market.\n\n4. Stay updated with market analysis\n\nTake advantage of eToro’s educational side. Either by joining their learning academy or by checking the market news and analysis, this is a mandatory step to ensure the desired success of your trading efforts.\n\n5. Consider long-term investment strategies\n\nInstead of focusing on only one type of investment or currency, it is wise to research different other strategies that have the potential of snowballing. In our case, you can further explore Ethereum’s implication within the tech sector, analyze the DeFi market and draw a conclusion.\n\nFAQ on Buying Ethereum on eToro\n\nHow to buy Ethereum on eToro?\n\nStep 1: Visit the official website to create your account;\n\nStep 2: Deposit Funds into your eToro account;\n\nStep 3: Buy Ethereum;\n\nStep 4: Set Up a Crypto eToro Wallet.\n\nCan you invest in Ethereum with eToro?\n\neToro is a safe platform for Ethereum trading, including selling and buying. Moreover, eToro offers 2FA verification, cold storage, FDIC-insured USD balances, multi-signature facilities, private keys, and KYC.\n\nWhat is the eToro fee for Ethereum?\n\neToro only charges a 1% fee for buying or selling, regardless of the currency.\n\nFinal Thoughts\n\nWe hope our comprehensive guide shines a light on your crypto investment plan, highlighting key aspects of your general strategy.\n\nBe sure to research the crypto trends and news further to take a step toward your goals, and this cannot be done just by looking at a step-by-step guide. Instead, it requires multiple educational mediums, keeping an eye on the big players, and experimenting only with what you are willing to lose.\n\nShare this Post Twitter\n\nLinkedin\n\nFacebook\n\nReddit\n\n* The information in this article and the links provided are for general information purposes only and should not constitute any financial or investment advice. We advise you to do your own research or consult a professional before making financial decisions. Please acknowledge that we are not responsible for any loss caused by any information present on this website."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2V0aGVyZXVtLXByaWNlcy1zdHJ1Z2dsaW5nLXRvLXBpZXJjZS0yMTAwLXdoaWxlLXRvYWRzLXNldC1mb3ItNDUwLXN1cmdlLW9uLWxhdW5jaC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jul 2023 07:00:00 GMT",
        "title": "Ethereum prices struggling to pierce $2,100 while TOADS Set For 450% Surge On Launch - Analytics Insight",
        "content": "Ethereum (ETH) has long held the spotlight as one of the leading digital assets due to its thriving ecosystem. Recent market trends have shown that Ethereum faces an uphill battle. The value of ETH has been struggling to breach the psychological barrier of $2,100, reflecting the current challenges of cryptocurrency.\n\nWhile Ethereum grapples with its resistance, the launch date for a top-performing digital currency called DigiToads (TOADS) has finally been revealed. As crypto enthusiasts eagerly await this upcoming project, experts and analysts predict that upon release on August 21st, 2023, TOADS will experience an astounding 450% surge in value.\n\nThis article will explore Ethereum’s struggle to breach the $2,100 resistance level while forecasting the potential rally from DigiToads’ upcoming launch on decentralized exchanges.\n\nDigiToads (TOADS) Upcoming Launch Will Result In Massive Growth\n\nDigiToads is an innovative meme coin that has been the center of attention lately, owing to its thriving presale phase. It’s been an incredible few months for DigiToads’ early investors, with the presale event going mainstream as the best ICO. This factor has helped DigiToads presale generate over $6 million in funding across 9 out of 10 stages, making it one of the most successful crypto presales in 2023.\n\nTOADS have experienced an astounding 370% surge in value during the presale, soaring from $0.01 to an impressive $0.047 in just nine stages. With the token launch scheduled after this year’s best ICO concludes, the presale is projected to culminate in an outstanding 450% return on investment. Investors and enthusiasts eagerly anticipate the token launch, hoping to capitalize on the potential of TOADS.\n\nThis projection is based on the high demand witnessed during the ongoing presale, the limited supply, and the innovative features offered by the cryptocurrency. DigiToads is not just about hype but also about utility. By leveraging NFTs and DeFi gaming, DigiToads’ potential for widespread adoption must be considered. The chance to participate in the best crypto investment platform like DigiToads, with the possibility of multiplying investments, is the selling point that has drawn investors’ participation in the token.\n\nThe presale is on its way to culminate in a listing on two top decentralized exchanges, Uniswap and BitMart, scheduled for August 21st. Global investors can access the token for buying and trading, while early investors can withdraw their TOADS tokens. This significant milestone for DigiToads has sparked speculation and anticipation among investors.\n\nThe reputable and established exchange listings will bolster the token’s growth and market presence. Analysis experts have predicted that since new DeFi projects possess more potential, once DigiToads hit the market, the value of the TOADS token will experience an astounding surge. Conservative estimation suggests an increase of at least 10x from the launch price of $0.055, making it the best crypto investment this bearish season.\n\nEthereum (ETH) Facing Huge Competition, Leading To Price Struggle\n\nDespite several attempts over the past few weeks, Ethereum has struggled to breach the $2,100 resistance barrier. Investors and traders have closely monitored this crucial level, as it represents a psychological and technical obstacle to the cryptocurrency’s price growth. While ETH has shown resilience and made remarkable gains, the current market sentiment has created an atmosphere of caution and uncertainty.\n\nSeveral external factors have contributed to the recent price struggles of Ethereum. On-chain data and general market sentiment suggest that crypto traders favor BTC over ETH due to the potential growth the Bitcoin ETF could bring. This has contributed to Ethereum consolidating at the $2100 mark and investors migrating to new DeFi projects that show promise.\n\nConclusion\n\nAs Ethereum faces challenges in breaching the $2,100 resistance, DigiToads emerges as a promising digital asset. The upcoming launch of DigiToads is anticipated to bring a remarkable 450% surge in value, attracting investors seeking profitable opportunities. With a successful presale, DigiToads has generated significant funding and mainstream attention. Whether this project lives up to the expectations remains to be seen, but one thing is sure: DigiToads has already made its mark, and it’s a project worth keeping an eye on.\n\nVisit DigiToads Presale\n\nMint DigiToads NFTs Here\n\nBuy DigiToads NFTs on OpenSea\n\nJoin the community\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9ldGhlcmV1bS1ldGgtcHJpY2UtcHJlZGljdGlvbi1ndWlkZS10by1yaXBwbGUtc2VjLWxhd3N1aXQtdmljdG9yeS1hbmQtbmV3LWZhc3QtZ3Jvd2luZy1jcnlwdG8tYXBlbWF4L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Prediction | Guide to Ripple SEC Lawsuit Victory and New Fast Growing Crypto ApeMax - Analytics Insight",
        "content": "This comprehensive guide offers a detailed overview of Ethereum price predictions and also discusses the ongoing legal challenges faced by Ripple in the Ripple vs SEC lawsuit. With insights gathered from multiple sources, this article provides fresh information and analysis for crypto enthusiasts interested in Ethereum’s price outlook and the latest developments in the legal battle between Ripple and the SEC. Delve into this guide which discusses Ethereum’s future prospects and the potential impact of the ongoing legal battle.\n\nEthereum (ETH) Price History\n\nEthereum’s price history reflects its many fluctuations over the years. In 2021, Ethereum experienced a notable surge in value driven by increased demand that might be attributable to technological advancements, including the introduction of the Berlin update and reduced transaction fees. However, the collapse of FTX in late 2022 had a significant impact on the cryptocurrency’s price. As of July 10, 2023, Ethereum was valued at $1,864.58, a considerable decrease from its peak price of around $4,400 at the end of 2021. The crypto market is known for its volatility, and Ethereum’s price history reflects the dynamic nature of the industry.\n\nWhat is ApeMax?\n\nApeMax has emerged as a highly interesting and innovative new cryptocurrency, garnering growing excitement within the crypto community. This project introduces a decentralized platform that allows holders to stake their tokens and earn rewards in a secure and transparent manner. ApeMax’s could revolutionize the meme coin landscape as it combines entertaining and interactive elements with fun utility and staking functionalities, and all these features are accessible even during the presale period. With its interesting tokenomics, ApeMax is an intriguing contender in the realm of new meme coins, captivating the attention of crypto fans.\n\nWhat is the ApeMax Presale?\n\nThe ApeMax presale is currently open, presenting a limited-time opportunity for eligible buyers to acquire ApeMax tokens presale prices. ApeMax Coin stands out with its innovative tokenomics, enabling token holders to earn rewards by staking their coins on a diverse range of entities, including content creators, Web3 projects, influencers, and philanthropic organizations that align with their interests.\n\nBy participating in the ApeMax presale, eligible buyers can immediately engage in the rewards process of staking. This distinctive feature sets ApeMax apart from other cryptocurrencies, as users can start using the token’s utility and start staking and earning rewards right from the initial stages, even during the presale period.\n\nTiming plays a pivotal role in the cryptocurrency landscape. The presale price of ApeMax undergoes gradual increments every 24 hours during the presale phase. Additionally, early-stage buyers of ApeMax have the exclusive opportunity to acquire Early Birds Loot Boxes, through which they can enjoy discounts of up to 50% on ApeMax tokens.\n\nCan Ethereum reach $100K?\n\nNo, it is unlikely that Ethereum will reach $100,000 per coin anytime soon. While Ethereum has shown strong growth and potential, achieving such a high value would require a significant increase in demand and adoption. Factors such as market dynamics, regulatory challenges, and competition from other cryptocurrencies make it improbable. It’s essential to approach price predictions with caution and conduct thorough independent analysis before making crypto decisions.\n\nHow much will my Ethereum be worth in 2025?\n\nThe exact value of Ethereum in 2025 is uncertain and highly speculative. Predicting future prices of cryptocurrencies is challenging due to various factors that can influence the market. While Ethereum has shown promise and growth in the past, it’s important to consider the volatility and unpredictability of the crypto market. It is advisable to conduct thorough research, analyze market trends, and consult with financial professionals before making any crypto purchases.\n\nWhat will Ethereum be worth in 2030?\n\nThe future value of Ethereum in 2030 is speculative and uncertain. Predicting the long-term price of cryptocurrencies is challenging due to the dynamic nature of the market and various factors that can influence prices. Ethereum has shown past potential for growth and adoption, but it’s important to consider the volatility and unpredictable nature of the crypto market. Conducting thorough research, staying informed about market trends, and seeking advice from unbiased experts is essential prior to making any crypto related decisions.\n\nCan Ethereum crash to zero?\n\nWhile it is somewhat unlikely that Ethereum will crash to zero, it’s important to acknowledge the inherent risks associated with cryptocurrencies, and even though this scenario may seem unlikely, it is possible for Ethereum and any crypto for that matter to crash to zero. Ethereum has established itself as one of the leading blockchain platforms with a wide range of use cases and strong community support. However, like any crypto, there are factors that can impact its value, including market volatility, regulatory changes, technological developments, and consumer sentiment. It’s crucial to stay informed, and understand and assess the risks involved before making any crypto acquisitions.\n\nDoes Ethereum have a future?\n\nYes, according to some analysts, Ethereum could have an interesting future. As one of the leading blockchain platforms, Ethereum has established itself as a fundamental infrastructure for decentralized applications (dApps) and smart contracts. Its robust developer community and ongoing improvements, such as the Ethereum 2.0 upgrade, aim to address scalability and enhance the network’s performance. Ethereum’s versatility and wide range of use cases, including decentralized finance (DeFi), non-fungible tokens (NFTs), and more, position it for continued innovation. However, as with any cryptocurrency and blockchain, it’s important to conduct thorough research and consider various factors before making any decisions. Like all cryptocurrencies, Etheruem remains highly volatile and risky, and may not be suitable for everyone.\n\nThe purchase of cryptocurrencies is not suitable for all individuals, and it is advised to exercise caution, conduct independent research, and carefully assess the considerable risks involved prior to engaging in any crypto acquisitions. People from the United States, Canada, countries that are under sanctions, and other blocked countries are not permitted to procure ApeMax coins. The official ApeMax website provides a complete list of the blocked countries.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDcvMTcvemtzeW5jLWludHJvZHVjZXMtbWFzcy11c2FibGUtc3RhcmstcHJvb2Ytc3lzdGVtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "ZkSync Introduces Mass-Usable STARK Proof System - Crypto Times",
        "content": "An Ethereum scaling protocol, zkSync, has recently launched its latest STARK-based proof system called Boojum, establishing a new benchmark for Ethereum layer-2 scaling solutions.\n\nSay hello to Boojum 👋: zkSync Era’s new high-performance proof system for radical decentralization. Boojum is an upgrade that will transition zkSync Era to a STARK-powered proof system, providing world-class performance on consumer-grade hardware.\n\n\n\n💡 Learn more:… pic.twitter.com/1GrwJ5Y07A — zkSync (∎, ∆) (@zksync) July 17, 2023\n\nBoojum leverages Scalable Transparent Argument of Knowledge (STARK) technology and is designed to operate efficiently on everyday consumer-grade GPUs, enhancing processing capabilities and accessibility.\n\nZkSync Era is a prominent player in the blockchain industry, renowned for its groundbreaking ZK-rollups protocol that boosts capacity, speed, and cost-efficiency.\n\nThe advent of Boojum brings forth enhanced processing power and streamlined hardware demands, utilizing a mere 16GB of GPU RAM, rendering it more accessible and user-friendly compared to its predecessor zk-SNARKs.\n\nOne of Boojum’s key advancements lies in its innovative approach of combining STARK and SNARK, resulting in a streamlined proof system that reduces storage requirements and verification costs.\n\nThis breakthrough strengthens Ethereum’s layer-2 scaling solution by offering an efficient and cost-effective approach.\n\nThe zkSync Era’s mainnet serves as a rigorous testing environment for Boojum, with developers utilizing “shadow proofs” based on real production data.\n\nThis seamless transition ensures the system’s reliability and readiness without the need for regenesis, providing users with a professional and user-friendly experience.\n\nThe introduction of Boojum showcases zkSync Era’s commitment to driving innovation and expanding the adoption of the Ethereum blockchain.\n\nWith its powerful processing capabilities and accessible hardware requirements, Boojum sets the stage for a scalable and cost-effective era of Ethereum layer-2 scaling."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZGVjcnlwdC5jby8xNDg4MjQvZXRoc2NyaXB0aW9ucy1leHBsb2l0LXNtYXJ0LWNvbnRyYWN0LW92ZXItMjAwLXN0b2xlbtIBVGh0dHBzOi8vZGVjcnlwdC5jby8xNDg4MjQvZXRoc2NyaXB0aW9ucy1leHBsb2l0LXNtYXJ0LWNvbnRyYWN0LW92ZXItMjAwLXN0b2xlbj9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jul 2023 07:00:00 GMT",
        "title": "Over 200 Ethscriptions Nabbed in Smart Contract Exploit - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA new protocol that lets people create and share digital objects on Ethereum has hit a major setback, according to its creator, who said the Ethscriptions main marketplace had been hacked.\n\nLaunched last month by Tom Lehman, co-founder and former CEO of Genius.com, Ethscriptions is a novel way to create Ethereum assets that leverage transaction “calldata” to write non-financial data to the network’s blockchain.\n\nThe Ethscriptions’ protocol itself and other applications that tap the technology haven’t been impacted, Lehman said. Yet, a sizable number of Ethscriptions listed on Ethscriptions.com have been stolen, Lehman said on Twitter on Friday.\n\nAD\n\nAD\n\n“About 123 individual addresses lost a total of about 202 ethscriptions in this exploit,” he said. “Any young protocol will have bumpy landings, but this is definitely not what I meant.”\n\nhttps://t.co/ZcR9HKlexS Marketplace Security Incident Update In this Tweet I’m going to walk you through how the exploit happened and what we are doing about it. First, to be clear, this was not a vulnerability in the Ethscriptions Protocol. This was a vulnerability in one… pic.twitter.com/i5Q0W2PRMQ — Middlemarch (@dumbnamenumbers) July 12, 2023\n\nIn terms of value, it’s unclear exactly how much was lost in connection with the exploit. But according to data from NFT marketplace OpenSea, some inscriptions have sold for as much as 5 Ethereum or around $9,600 in the past month.\n\nLehman told Decrypt that, regarding the Ethscriptions lost, “it’s all terrible,” but he specifically lamented the theft of Ethscription #56, describing it as “brutal” and pointing to the rarity often ascribed to earlier artifacts.\n\nThe exploit also has a particular sting, Lehman said, because it was meant to serve as an example that other marketplaces building out support for Ethscriptions could lean on.\n\nAD\n\nAD\n\n“The purpose of the marketplace was basically to help show other people how to create marketplaces and help build an ecosystem,” he said. “Unfortunately, we fell on our face in that area.”\n\nLehman claimed responsibility for the failure, explaining the exploit could be traced to a smart contract that he and Indelible Labs co-founder Michael Hirsch created. A snippet of code allowed people to withdraw Ethscriptions that they didn't own from the marketplace.\n\n“Part of the challenge with this new protocol is that you save a bunch of money from limiting the use of smart contract storage, but then you have to be more strategic surrounding how you use contracts in cases like marketplaces,” he said. “You have to figure out a way to either give smart contracts information or make it so smart contracts don’t need that information.”\n\nThe Ethscriptions.com marketplace will be relaunched once necessary changes are made to the protocol itself, according to Lehman, who said he’s been in contact with many of those impacted by the exploit. He praised them on Twitter as “the earliest adopters” of the Ethscriptions protocol.\n\nEthscriptions are distinct compared to traditional NFTs, stored in transaction-level data as opposed to being tokens issued on Ethereum by smart contracts, like in the case of the ERC-721 token standard. According to a Dune Analytics dashboard, around 474,000 Ethscriptions have been created so far.\n\nThe protocol’s emergence follows Ordinals’ rise in popularity, used for creating NFT-like assets on Bitcoin, which has led to a new wave of experimentation with crypto’s oldest coin.\n\nLehman drew attention to the exploit on July 14. Days later, a disclaimer about the impacted state of the marketplace remains. A warning on Ethscriptions.com reads, “There is an issue with the marketplace contract! Withdraw your Ethscriptions and do not create new listings!”"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2JpdGNvaW4tYW5kLWV0aGVyZXVtLXNob3ctbGltaXRlZC11cHNpZGUtd2hpbGUtaW5xdWJldGEtcHJvamVjdGlvbnMtc2hvdy01MDAtZ3Jvd3RoLWluLTIwMjMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Show Limited Upside While InQubeta Projections show 500% Growth in 2023 - Analytics Insight",
        "content": "The cryptocurrency market has long been dominated by heavyweights like Bitcoin and Ethereum, which have captured the attention of investors worldwide. While these cryptocurrencies have delivered impressive returns in the past, some experts believe that their exponential growth may be slowing down.\n\nHowever, amidst this scenario, a new contender is emerging with the potential to outpace Bitcoin and Ethereum: InQubeta and its native QUBE token. Here’s why QUBE is generating excitement among investors and why it may offer a 5X return on investment in the near future.\n\nThe Limitations of Bitcoin and Ethereum\n\nBitcoin and Ethereum have undoubtedly made significant strides in the world of digital currencies. Bitcoin, as the pioneer cryptocurrency, has enjoyed substantial growth and widespread adoption. Ethereum, on the other hand, has revolutionized the blockchain industry with its smart contract capabilities and the development of decentralized applications (DApps). However, as these cryptocurrencies mature, their growth potential may become more limited compared to newer projects.\n\nThe Rise of InQubeta (QUBE)\n\nInQubeta is a rising star in the crypto space and is capturing the attention of investors with its innovative approach and promising features. Unlike Bitcoin and Ethereum, which have already experienced exponential growth, QUBE presents an opportunity for substantial gains in the near future. Its ongoing presale has been met with enthusiasm, raising expectations for its long-term potential.\n\nInvesting in QUBE\n\nSeveral factors contribute to QUBE’s potential for significant growth. Firstly, its focus on the AI industry positions it at the forefront of the next technological frontier. As AI continues to expand its reach across industries, QUBE’s integration of AI technology offers a unique value proposition for investors.\n\nFurthermore, QUBE’s community-driven nature fosters active participation and engagement. Token holders have governance rights, allowing them to shape the project’s future and direction. This decentralized approach not only strengthens the project’s resilience but also instills a sense of ownership and involvement among investors.\n\nQUBE’s Unique Value Proposition:\n\nQUBE brings several key features to the table that differentiate it from other cryptocurrencies. Its fractionalized NFT approach allows investors to own fractions of AI-driven assets, promoting inclusivity and increasing accessibility. By breaking down barriers to entry, QUBE enables a broader range of investors to participate in AI-driven projects and benefit from their potential growth.\n\nAdditionally, InQubeta leverages blockchain technology to enhance security and transparency. Through smart contract auditing and multi-layered verification processes, the platform ensures a secure environment for investors, mitigating the risks associated with traditional crowdfunding methods. This focus on security builds trust within the community and sets QUBE apart as a reliable investment opportunity. While Bitcoin and Ethereum may have already reached a level of maturity, QUBE presents an opportunity for exponential growth in the crypto market. Don’t Miss Out On QUBE Presale\n\nInQubeta (QUBE) is currently in its presale which has raised over $1.4 million within a few weeks of launch. The presale has attracted both institutional and retail investors due to its low barrier of entry and multiple payment options. InQubeta has also revealed plans to launch a staking dapp for QUBE holders to stake their assets for rewards, an NFT marketplace and a unique DAO for decentralized governance.\n\nWhile Bitcoin and Ethereum may continue to play essential roles in the crypto market, QUBE’s innovative features and growth potential make it a compelling option for investors seeking exponential gains in the near future.\n\nVisit InQubeta Presale\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L25leHQtYmlnLWNyeXB0by1jb2luLWFmdGVyLWV0aGVyZXVtLXNvbGFuYS1jb3VsZC1pdC1iZS1zY29ycGlvbi1jYXNpbm8tdG9rZW4v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jul 2023 07:00:00 GMT",
        "title": "Next Big Crypto Coin After Ethereum & Solana - Could It Be Scorpion Casino Token? - Analytics Insight",
        "content": "Next Big Crypto Coin After Ethereum & Solana – Could It Be Scorpion Casino Token?\n\nGoing through the journey of discovering the next big crypto coin in the captivating realm of blockchain, it’s clear that Ethereum (ETH) and Solana (SOL) have emerged as two prominent players. Since their launch, both tokens have experienced remarkable growth, attracting the attention of investors worldwide. Their price fluctuations, ranging from all-time lows (ATL) to its all-time highs (ATH), offer a nuanced perspective on altcoin trajectories.\n\nBy studying these fluctuations, crypto enthusiasts gain insights into market dynamics and can make informed predictions about the future. Among the newcomers, Scorpion Casino Token (SCORP) exhibits tremendous potential in becoming the next big crypto coin set for explosive growth in 2023.\n\nEthereum (ETH): Revolutionising Smart Contracts\n\nIn the realm of cryptocurrency, Ethereum (ETH) stands out as a pioneering force behind smart contracts. This decentralised platform introduced a revolutionary concept of executing programmable transactions, transforming the blockchain industry. With Ethereum, developers can create and deploy decentralised applications (DApps) and leverage the power of smart contracts, unlocking a world of innovative possibilities.\n\nETH’s vast and active developer community is one of its key strengths. This thriving ecosystem fosters continuous innovation and improvement, solidifying Ethereum’s position as a reliable choice for individuals and enterprises seeking to harness the potential of blockchain technology.\n\nThe price trajectory of Ethereum from its all-time low (ATL) to all-time high (ATH) has been remarkable. Since its launch, ETH has witnessed several price cycles. Starting at a mere $0.43 in 2015, Ethereum reached an astonishing ATH of over $4,000 in 2021, generating substantial returns for early investors and demonstrating its immense growth potential.\n\nSolana (SOL): Empowering High-Performance Applications\n\nSolana (SOL), a relatively newer player in the market, has garnered significant attention to become the next big crypto coin for its exceptional ability to handle high-performance applications with lightning-fast transaction speeds. Its innovative approach to scalability and throughput sets it apart from other cryptocurrencies, positioning SOL as a strong contender for future success.\n\nSOL’s unique architecture, combining Proof of History and Proof of Stake mechanisms, enables unprecedented scalability and efficiency. By overcoming traditional blockchain limitations, Solana empowers developers to build complex applications without compromising on speed or security.\n\nThe price trajectory of Solana has been nothing short of extraordinary. Since its inception, SOL has experienced substantial value surges, particularly in 2021. Starting at an ATL of $0.22, Solana soared to an ATH of over $200, showcasing an exponential increase in price and offering significant returns on investment opportunities.\n\nThe Future Potential of Scorpion Casino Token (SCORP) | Next Big Crypto Coin?\n\nScorpion Casino Token (SCORP) presents an enticing investment opportunity with its burn/deflationary model. This unique mechanism involves the periodic removal of tokens from circulation with each transaction and profit from its platform, Scorpion Casino, used to burn existing tokens. By gradually reducing the total supply over time, this approach creates scarcity and enhances the token’s value, incentivizing long-term holders.\n\nAlthough SCORP is currently in its presale stage, it has already gained substantial attention, thanks to its association with an established platform. The integration of SCORP within an existing ecosystem provides immediate utility and opens up a wide range of potential use cases. This association not only adds credibility to the token but also unlocks numerous growth and adoption opportunities.\n\nIn light of SCORP’s burn/deflationary model, which involves systematically reducing the token supply over time, coupled with its close partnership with an established platform, the potential for SCORP’s future success becomes increasingly evident. Its unique features and promising growth trajectory position SCORP as an attractive investment option for those seeking the next big thing in the crypto market.\n\nExploring the Future of Cryptocurrency\n\nEthereum and Solana stand as two remarkable players in the cryptocurrency industry. Ethereum’s trailblazing role in smart contracts and its robust developer community make it a reliable and established choice. Meanwhile, Solana’s impressive scalability and throughput capabilities position it as a high-performance solution for decentralised applications.\n\nLooking ahead to the future, Scorpion Casino Token (SCORP) emerges as a cryptocurrency with immense potential. Its burn/deflationary model, connection to an established platform, and the substantial adoption it has already witnessed set the stage for significant success. As investors and enthusiasts search for the next cryptocurrency to explode in 2023, SCORP undoubtedly deserves attention.\n\nBy understanding the unique features, price trajectories, and growth potential of Ethereum, Solana, and Scorpion Casino Token (SCORP), investors can make informed decisions about discovering the next big crypto coin and explore the exciting world of cryptocurrency with confidence.\n\nScorpion Casino Token (SCORP):\n\nPresale: https://presale.scorpion.casino/\n\nWebsite: https://scorpion.casino/Casino\n\nInstagram: https://www.instagram.com/scorpion.casino\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vaW52ZXp6LmNvbS9uZXdzLzIwMjMvMDcvMTcvY2Vsby1wcm9wb3Nlcy11cGdyYWRlLXRvLXRyYW5zaXRpb24tbmV0d29yay10by1hbi1ldGhlcmV1bS1sMi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Celo proposes upgrade to transition network to an Ethereum L2 - Invezz",
        "content": "Celo, a mobile-first and EVM-compatible blockchain network, has announced a proposal for an upgraded that could see the Layer 1 platform transition into an Ethereum Layer 2 protocol.\n\nThe proposal by cLabs, the core developer of Celo blockchain, will go through a governance vote and adoption will pave the way for migration from an independent EVM-compatible network to an L2 on the world’s largest proof-of-stake network.\n\n14/\n\n\n\nGet ready to vote 🗳️\n\n\n\nFollowing the governance call, an indicative on-chain governance proposal (or “temperature check”) will be released for the community to vote on as early as Saturday, July 22.\n\n\n\nAs excited as we are? Share your comments & takes below! 👇 — Celo 🦇 🌳 (@CeloOrg) July 16, 2023\n\nUpgrade to boost Celo’s security and adoption\n\nCopy link to section\n\nAs an Ethereum L2, Celo will initially leverage the OP Stack, a modular open-source software that allows for the building of highly scalable and interoperable layer 2 blockchains. While the L2 solution will tap into Optimism’s modular software, it will have some key differentiators.\n\nThese will include a decentralised sequencer powered by Celo blockchain’s existing validator set; off-chain data availability and a design that retains the 1-block finality currently in use. The migration will integrate EigenLayer, a restaking provider.\n\nFeatured Broker Looking to invest? Invest and trade CFD stocks, ETFs, digital assets & commodities in minutes with our highest-rated broker. Buy or sell stock CFDs with Plus500. 82% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you can afford to take the high risk of losing your money. Open your account Buy or sell stock CFDs with Plus500. 82% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you can afford to take the high risk of losing your money. Ad\n\nAccording to Celo, the upgrade ties into the network’s Web3 vision and will benefit from greater security by inheriting Ethereum’s security features. The transition will also further Celo’s adoption via increased cross-community collaboration, enhanced compatibility and low gas fees as a result of off-chain data availability.\n\nAre you looking for fast-news, hot-tips and market analysis? Sign-up for the Invezz newsletter, today.\n\nCelo will also benefit from more real-world use cases across thousands of dApps in the Ethereum ecosystem. Currently, the blockchain supports Uniswap, Sushiswap and UbeSwap among other decentralized applications.\n\nNo impact on CELO token holders\n\nCopy link to section\n\nThe proposed technical upgrade will not impact CELO holders, the team noted. This means native CELO will remain the governance tool for the ecosystem and holders will control both core contracts and validator set via governance vote, staking and election.\n\nCELO traded at $0.57 on Monday morning, about 10% up in the past 24 hours and 18% in the past week. Year-to-date highs near $0.90 was reached in February. However, the token’s price remains more than 94% from its all-time high of $9.82 reached in August 2021."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvY2Vsc2l1cy1pcy1zZWxsaW5nLW1vcmUtcGFpbi1mb3ItYm5iLWxpbmstYW5kLXNueC_SAVNodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2NlbHNpdXMtaXMtc2VsbGluZy1tb3JlLXBhaW4tZm9yLWJuYi1saW5rLWFuZC1zbngvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Celsius Is Selling, More Pain For BNB, LINK, And SNX? - NewsBTC",
        "content": "Celsius, the bankrupt crypto lender, has started selling its non-Bitcoin and non-Ethereum crypto assets, records on July 17 indicate. According to on-chain data from Lookonchain, Celsius has transferred approximately $23.5 million of various cryptocurrencies, including BNB, ZRX, LINK, BONE, and SNX, to FalconX and OKX, respectively.\n\nDifferent amounts of these tokens were transferred by Celsius, a move that, while it could be positive for creditors, may impact the token valuations of those projects.\n\nCelsius Selling Altcoins\n\nLookonchain revealed that Celsius moved $8.5 million worth of LINK, the native currency of Chainlink, a middleware protocol linking on-chain smart contracts to external but verified data. At the same time, it also moved $7.84 million worth of SNX, the native token of Synthetix, a protocol allowing users to trade derivatives called synths, was transferred.\n\nCelsius also went on to move $3 million worth of BNB, the coin behind the sprawling Binance ecosystem, $2.26 million worth of 1INCH, the token aggregator, and $1.9 million worth of ZRX, the token behind one of the first decentralized finance platforms, Ox Protocol.\n\nThe bankrupt lender also moved $709,678 worth of FTT, the token behind the collapsed FTX exchange, to FalconX. In response, FalconX has started depositing these tokens to Binance for selling.\n\nThe only token moved to a different exchange was BONE, where Celsius moved $235,000 of the meme token to the popular cryptocurrency exchange, OKX.\n\nWhile OKX caters to retail and institutional investors, FalconX serves institutional investors, offering diverse services, including liquidity provision and risk management. So far, a large tranche of tokens held by Celsius has moved through FalconX.\n\nIn late June, Judge Martin Glenn of the Southern District of New York allowed Celsius to start converting all their tokens to either Bitcoin or Ethereum, the two currencies that would be allowed to pay back creditors. All conversions were set to begin on July 1.\n\nAltcoins Taking A Hit\n\nThe transfer also comes amid a favorable ruling that saw a US Judge say XRP, one of the major altcoins, is not a security and can be traded like a commodity, just like Bitcoin. However, even though news pumped altcoins, mostly XRP, momentum tapered during the weekend, and most altcoins fell back from last week’s highs.\n\nRelated Reading: XRP Whales Ride The Crypto Surge, As Ripple Token Notches 62% Price Spike\n\nAmong the impacted tokens included BNB, the native currency behind Binance, the world’s largest ecosystem. The coin currently oscillates within a $30 range as bears dominate price action. From the daily chart, BNB has resistance at $260 and is down over 30% from April 2023 highs.\n\nLINK and SNX are seeing similar price actions, both recording losses on the 24-hour chart. LINK is down 2.97% to be trading at $6.63, while SNX is nursing 3.94% losses, bringing its price to $2.64.\n\nFeature image from Canva, chart from TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vZW4uZXRoZXJldW13b3JsZG5ld3MuY29tL2FydGh1ci1oYXllc3MtaG9seS1ncmFpbC1zdGFibGVjb2luLWRlZmktcHJvamVjdC1ldGhlbmEtcmFpc2VzLTZtL9IBZ2h0dHBzOi8vZW4uZXRoZXJldW13b3JsZG5ld3MuY29tL2FydGh1ci1oYXllc3MtaG9seS1ncmFpbC1zdGFibGVjb2luLWRlZmktcHJvamVjdC1ldGhlbmEtcmFpc2VzLTZtL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Arthur Hayes's \"Holy Grail\" Stablecoin DeFi Project Ethena Raises $6M - Ethereum World News",
        "content": "Ethena is a startup that is developing a stablecoin and digital savings bond that will be backed by derivatives.\n\nThe stablecoin will be backed by equal amounts of staked ETH and perpetual swaps shorting Ethereum.\n\nThe project has secured a $6 million seed funding from DragonFly, a venture capital firm founded by Arthur Hayes.\n\nEthena’s stablecoin and savings bond will be built on the Ethereum blockchain, ensuring decentralization and transparency.\n\nEthena is not the first project to create a stablecoin backed by derivatives. However, they believe that their approach has the potential to be more successful than previous attempts.\n\nEthena strives to become a pioneer in the crypto industry by developing a stablecoin and digital savings bond. These innovative financial products will be supported by derivatives and will maintain value, in relation to the US dollar without depending on the conventional financial system. Ethena is focusing on creating these offerings for investors outside of the United States.\n\nOne of their products is a stablecoin that has a mechanism to preserve its peg to the US dollar. Additionally they are working on introducing the worlds native savings bond.\n\nFormer BitMex CEO, Arthur Hayes will provide guidance and advice to Ethena. The project secured a $6 million seed funding from DragonFly, a venture capital firm specializing in investments, which was founded by Arthur Hayes himself. Notable participants in this round include crypto derivative exchanges like Deribit, ByBit, OKX, Gemini and Huobi.\n\nThe ultimate objective of Ethena is to establish an alternative to banking systems worldwide. They firmly believe that their stablecoin and savings bond will offer individuals a decentralized and accessible means of preserving and growing wealth.\n\nAccording to Guy Young, the Founder and CEO of Ethena their platform aims to address the immediate need within the crypto space: DeFi endeavors to create a parallel financial system; however stablecoins, which are vital financial instruments in this sector remain completely reliant, on traditional banking infrastructure.\n\n\n\nWe strongly believe that individuals worldwide should have access, to a financial tool, a dollar based savings instrument to securely store their wealth. With our stablecoin we are bringing to life our vision of a native stablecoin that does not rely on traditional banking systems. This enables the creation of an permissionless internet bond.\n\nA breakdown of what Ethena does:\n\n\n\nStablecoin: The Ethena stablecoin will be backed by derivatives holding equal amounts of staked ETH and perpetual swaps shorting Ethereum. This unique approach allows it to maintain its peg to the US dollar without depending on the infrastructure. This improvement addresses some of the limitations found in existing stablecoins which are often susceptible to manipulation and volatility.\n\n\n\nSavings bond: The Ethena savings bond will be a token that function similarly to a US treasury bond. However it distinguishes itself by being permissionless and accessible to individuals around the world. This means that anyone, regardless of their location or financial standing will have the opportunity to invest in the Ethena savings bond.\n\n\n\nDecentralized: Ethenas stablecoin and savings bond will be built on the Ethereum blockchain ensuring decentralization and transparency. This means that there won’t be a single point of failure and people will have control over their funds.\n\nAccessible: Everyone around the world, regardless of their location or financial status, will have access to Ethenas stablecoin and savings bonds. This accessibility is made possible because they will be built on the Ethereum blockchain, a platform that’s source and permissionless.\n\nThis Isn’t The First Time Stablecoins Backed By Derivatives Have Been Created\n\nYou heard it right! In the past there has been attempts to create stablecoins backed by derivatives. One example is Basis Cash, which launched in 2020. Basis Cash tried to maintain its value by relying on a mix of derivatives linked to the US dollar, gold and oil. Unfortunately it failed to maintain its peg and therefore had to shut down in 2021.\n\nAnother failed attempt was IRON Finance, which was launched in 2021. IRON Finance used derivatives tied to the US dollar and Ethereum as its backing. IRON Finance was also shut down in 2021 after it even tually lost $150 million due to a hack.\n\nThe failures of Basis Cash and IRON Finance highlight the challenges in creating a stablecoin backed by derivatives that are both secure and dependable. Ethena presents an approach to leveraging derivatives for stabilizing a coin, which holds the potential, for success.\n\nIn the past there have been challenges, in understanding the complexities of derivatives. This has made it difficult for issuers to effectively manage the risks involved in using derivatives to support a stablecoin.\n\nThe trading costs associated with derivatives can be quite high. This poses a challenge for issuers who need to generate revenue to cover the expenses of maintaining the stablecoins value.\n\nDerivatives are subject to regulations in jurisdictions. This adds another layer of difficulty for issuers as they strive to comply with the rules and regulations.\n\nDespite these obstacles there are advantages in using derivatives as collateral for a stablecoin such as enhanced security, increased reliability and improved efficiency.\n\n“Ethena is building the holy grail of stablecoins: a coin that is truly stable, decentralized, and capital-efficient,” said Tom Schmidt, General Partner at Dragonfly. “Stablecoins have grown massively in popularity over the past few years by providing access to USD-denominated savings and remittances for people around the world, but they’ve always been handicapped by one of these three issues. Ethena has a breakthrough design that remedies these issues while also benefiting a broad user-base. We’re thrilled to be partnering with them to bring their vision to life.”\n\nEthena plans to utilize the initial investment to get ready for the release of their stablecoin and bond asset in the third quarter of 2023. This includes successfully finishing the testnet phase in Q3 of this year, establishing partnerships with prominent players in the industry and conducting thorough smart contract audits to guarantee the security and efficiency of the protocol."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmJpdGNvaW5zZW5zdXMuY29tL2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tZGFpbHktMTYtanVseS11cmdlbnQtdGhlLW1vc3QtaW1wb3J0YW50LXN1cHBvcnQtZm9yLWV0aC1yaWdodC1ub3cv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction Daily (16-July): Urgent! The Most Important Support For ETH Right Now. - Bitcoinsensus",
        "content": "Urgent! The Most Important Support For ETH Right Now. Can the ETH Bulls defend this 4-hour level?\n\nThe direction the Ethereum trend will take in the coming days is directly dependent on if the Altcoin price can stay above a major key support level in the 4-hour timeframe.\n\nWe have seen this $1,823 support get defended over and over again in the past. And when the ETH price managed to break below it, we saw a massive sell-off follow.\n\nThis indicates the importance of this key level, and in this Ethereum analysis, we will be focusing on it and talking about the possible price scenarios that might be possible for the Ethereum price come next week.\n\nTo trade ETH with leverage, sign-up to Bybit right now! Bybit’s BIGGEST Bonus Campaign is now live! You can get up to a $30,000 Bonus when you fund your Bybit account with our Bybit link\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nPossible Price Scenarios For Ethereum\n\nUrgent! The Most Important Support For ETH Right Now. Can the ETH Bulls defend this 4-hour level?\n\nFor Ethereum to remain bullish, the ETH $1,823 key support must be respected at all costs! This key support is the line in the sand and it helps us fully understand what the ETH price is doing right now.\n\nIf the ETH bulls can defend this key support, there is a very high probability that we might see more bullish momentum begin to enter the market come next week.\n\nSo in the coming days, we will be keeping a close eye on this $1,823 key support level to see how the price reacts to it in the coming days.\n\nFinal Verdict!\n\nThe Ethereum price is right now in the bullish territory and there is a very high probability that we might see the Altcoin continue to push higher in the coming days.\n\nHowever, for this bullish bias and momentum to remain valid, we need to see the Altcoin respect and continue to trade above the $1,823 key support level in the 4-hour timeframe.\n\nAs far as the ETH price can stay above this 4-hour key support, there is a very high probability that we might see more buyers begin to step back into the market in the coming days.\n\nHowever, if this key level gives way, this could be really bad for the ETH bulls.\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nHow to Trade Bitcoin (BTC)?\n\nTo understand the basics of Bitcoin trading, you can read our How To Trade Bitcoin Guide. It can prove helpful for traders who are just getting started with Bitcoin trading. You can also check out our list of top Bitcoin Exchanges To Trade With.\n\nPrimeXBT Covesting: Trade Hassel Free\n\nSign-up on PrimeXBT today to trade Bitcoin hassle-free. You can copy experienced traders and access hundreds of different strategies on the platform! Don’t forget to claim your 25% bonus by using the promo code “bitcoinsensus50” when you sign-up with our link PrimeXBT Covesting"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmNyeXB0b3BvbGl0YW4uY29tL3Vuc3RvcHBhYmxlLWRvbWFpbnMtZXhwYW5kcy13ZWIzLW9mZmVyaW5ncy13aXRoLWV0aGVyZXVtLW5hbWUtc2VydmljZS1zdXBwb3J0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Unstoppable Domains expands Web3 offerings with Ethereum Name Service support - Cryptopolitan",
        "content": "In a significant move to bolster the Web3 space, digital identity platform Unstoppable Domains has announced support for Ethereum Name Service (ENS) domain names. However, the integration allows users to register a simpler name, like “me.eth,” in place of lengthy wallet addresses, according to company sources. This latest development expands Unstoppable Domains’ portfolio of Web3 offerings, which include the widely recognized .crypto, .nft, and .polygon domain endings.\n\n.eth is coming to Unstoppable. 🔥\n\n\n\nUnstoppable is now your one-stop shop for Web3 domains. Buy and manage your .eth, .nft, or .x domains all in one place. 🌐\n\n\n\nBetter yet? We’re introducing new functionality that makes buying .eth domains easier and more seamless.\n\n\n\n👇🧵 pic.twitter.com/lKB5yNwuD7 — unstoppable.x (@unstoppableweb) July 17, 2023\n\nThe company, with its 3.6 million registered domains, and ENS, holding 2.7 million, are leading the industry in digital identity preservation. This integration represents an important stride in unifying the user experience across different blockchain domains. However, Matt Gould, CEO and Co-Founder of Unstoppable Domains expressed the company’s intention to simplify domain management and purchase for Web3 users who wish for a single platform for their diverse digital assets.\n\nStreamlining domain ownership and management\n\nBeyond the provision of .eth domain endings, Unstoppable Domains has rolled out several features to streamline domain ownership and management. The company is also offering auto-renewal for Ethereum-based domains, reducing the risk of losing highly coveted domain names due to expiry. Unstoppable Domains has also implemented a vault for custody buyers’ domains before they are linked to their wallets.\n\nFurther enhancing user convenience, the platform now supports both fiat payments and cryptocurrencies, enabling customers to purchase domains using credit cards, PayPal, Apple Pay, Google Pay, Bitcoin, and 12 different cryptocurrencies.\n\nUnstoppable Domains is working to develop .eth domain management tools, which will include the ability to set cryptocurrency addresses, manage on-chain profile data, and transfer .eth domains. While domains purchased from Unstoppable will be registered through the ENS smart contract and maintain ENS functionality, they will initially not support Unstoppable’s vast integration network.\n\nThe integration between Unstoppable Domains and ENS indicates a significant milestone toward a unified and user-friendly Web3 ecosystem. As part of its commitment to the Web3 space, Unstoppable Domains is also actively participating in the Web3 Domain Alliance. The organization aims to foster collaboration and standardization in developing digital identities across the crypto space."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LmNyeXB0b3BvbGl0YW4uY29tL3prc3luYy11bnZlaWxzLWJvb2p1bS11cGdyYWRlLXRvLWVuaGFuY2UtZXRoZXJldW0tbGF5ZXItMi1zY2FsaW5nL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "zkSync unveils Boojum upgrade to enhance Ethereum Layer-2 scaling - Cryptopolitan",
        "content": "Matter Labs, the core developer of Ethereum Layer-2 scaling solution zkSync Era, has announced the launch of Boojum, a revolutionary proof system designed to enhance performance and accessibility. Boojum is built on a new Rust-based cryptographic library developed by zkSync, utilizing STARK technology to power the upgraded Zero-Knowledge (ZK) circuits. However, this significant development moves zkSync Era away from its previous reliance on SNARKs (another form of zero-knowledge proof) and promises to deliver several times more throughput.\n\nSay hello to Boojum 👋: zkSync Era’s new high-performance proof system for radical decentralization. Boojum is an upgrade that will transition zkSync Era to a STARK-powered proof system, providing world-class performance on consumer-grade hardware.\n\n\n\n💡 Learn more:… pic.twitter.com/1GrwJ5Y07A — zkSync ∎ (@zksync) July 17, 2023\n\nBoojum to bring enhanced performance and reduced hardware requirements\n\nThe introduction of Boojum brings substantial performance improvements to zkSync Era’s transaction processing capabilities. The new proof system enables faster transaction proofs, allowing the system to prove transactions at an accelerated pace. Moreover, Boojum’s innovative design significantly reduces hardware requirements, making it compatible with consumer-grade GPUs and requiring only 16 GB of GPU RAM. This accessibility enhancement ensures that users with regular hardware can actively participate in the network and contribute to its growth.\n\nBoojum’s upgrade is currently in an experimental phase on the zkSync Era mainnet, generating and verifying ‘shadow proofs’ using real production data. This comprehensive testing process aims to fine-tune the system, identify potential issues, and mitigate risks before the full migration.\n\nBoojum’s reduced hardware requirements and improved performance are expected to boost zkSync Era and the broader Ethereum ecosystem. The increased accessibility enables a wider range of users to engage with the network, fostering inclusivity and decentralization. By making the proof system compatible with consumer-grade GPUs, Matter Labs is democratizing participation in the network, allowing individuals with regular hardware setups to contribute to the transaction compressing process.\n\nAdditionally, Boojum’s ability to operate with lower hardware specifications opens up cost-effective options for participants. The reduced hardware demands result in more affordable setups, which can positively impact the economics of participating in the zkSync Era network.\n\nThe innovation presented by Matter Labs and zkSync holds the potential to shape the future of Layer 2 scaling solutions, with implications for decentralized finance (DeFi) applications and broader blockchain adoption.\n\nThe successful deployment of Boojum on the mainnet in the experimental phase marks a significant milestone for Matter Labs, zkSync, and the entire Ethereum community. As the testing and fine-tuning process progresses, stakeholders eagerly anticipate the full migration and the subsequent impact on scalability, accessibility, and user engagement within the zkSync Era ecosystem."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY2FwdGFpbmFsdGNvaW4uY29tL3doYXQtaXMtZXRoZXJldW0tcmFpbmJvdy1jaGFydC1ob3ctdG8tcHJlZGljdC1ldGgtcHJpY2Uv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "What Is Ethereum Rainbow Chart & How to Predict ETH Price? - Captain Altcoin",
        "content": "Home » Journal What Is Ethereum Rainbow Chart & How to Predict ETH Price? Journal What Is Ethereum Rainbow Chart & How to Predict ETH Price? Felix Küster\n\nMETA DESCRIPTION: The Ethereum Rainbow Chart can be a useful tool for analyzing ETH’s price movements – learn how it can help you inform your investment decisions.\n\nThe Ethereum Rainbow Chart is a graphical representation of ETH price movements that uses color bands to indicate whether ETH is overvalued or overvalued at any given time. The chart draws data from historical Ethereum price data, presenting it in a logarithmic fashion.\n\nWith Ethereum showing robust bullish activity over the past couple of weeks and the movements in the broader crypto market driven by renewed investor optimism, many investors and Ethereum holders are wondering how ETH might perform in the coming weeks and months.\n\nIn this article, we are going to explain what is the Ethereum Rainbow Chart and how it can be used as a complementary tool to make informed investment decisions.\n\nWhat is the Ethereum Rainbow Chart?\n\nThe Ethereum Rainbow Chart is a graphical representation of Ethereum’s past and potential future price trajectory, offering a streamlined view of the main resistance and support price levels. The chart is modeled using logarithmic regression and uses a color-coded spectrum to represent the different price zones.\n\nThe Ethereum Rainbow Chart allows you to easily analyze historical and future ETH price movements. Image source: CoinCodex\n\nThe colors in the Ethereum Rainbow Chart go from dark red to blue, like in a rainbow, hence the name. The red band is the most expensive, and the blue band is the cheapest. In total, there are nine distinct bands, each showing what a particular price level could mean in a historical context – if you see that Ethereum is trading in the dark red band, for instance, you can quickly deduce that ETH is heavily overbought and could see a big price correction going forward.\n\nIt is worth pointing out that the Ethereum Rainbow Chart shouldn’t be used as a foolproof prediction tool due to its limitations. It can’t take into account things like current events, software development, investment sentiment, or any other external data points that could have an impact on ETH price. Instead, it relies on historical price movement trends to model future price movements. For this reason, the Rainbow Chart works best as a complementary research tool and shouldn’t be used as an exclusive source of information.\n\nHow to use the Ethereum Rainbow Chart to predict ETH price?\n\nThe idea behind the chart is to help you make better decisions about when to buy or sell Ethereum. For example, if the price of ETH is in the red band, it means that it is very high compared to its historical trend, and it might be a good time to sell some of your ETH and take some profits.\n\nOn the other hand, if the price of Ethereum is in the blue band, it means that it is very low compared to its historical trend, and it might be a good time to buy some Ethereum and hold it for the long term.\n\nEach band on the chart features a self-explanatory description of different ETH price levels. Image source: CoinCodex\n\nHere’s an example of how using the Ethereum Rainbow Chart can come in handy in a real-world setting. Let’s say you might be interested in knowing whether buying ETH at its current price might be worth it based on past price trends. With the price of ETH hovering around $1,850 at the time of writing, we can consult the chart to see how that price compares to historical movements.\n\nIn the image above, we can see that the current price of ETH positions it in the yellow band, which is right in the middle of the pack. This means that Ethereum markets are currently balanced, with no significant overselling or overbuying going on. However, if you are looking to hold ETH for a longer period of time – for example, till the end of the year – that same price of $1,850 would position ETH in the “Still cheap” band, signaling that it might be a good price level to enter the position.\n\nIf ETH is trading in one of the higher bands, you should consider selling it and taking profit. Image source. CoinCodex\n\nThese findings can inform your investment decisions and allow you to plan your trades accordingly. As a basic rule of thumb, you should be more willing to sell your ETH when it is in the higher bands and hold onto it or even buy some more when it is in the lower bands.\n\nEthereum Rainbow Chart is a great analytical tool, but make sure to consider its limitations\n\nThe Ethereum Rainbow Chart draws data from nearly 8 years of Ethereum historical price data, providing an easy-to-understand view of ETH’s price movements and its support and resistance levels. Still, the Rainbow Chart relies on historical data exclusively, so it shouldn’t be used as a primary investment resource.\n\nHowever, in combination with a prediction tool like CoinCodex’s Ethereum price prediction algorithm, which takes into account additional technical indicators and the cyclic nature of crypto bull and bear markets, the Rainbow Chart can be a very powerful tool.\n\nGenerally speaking, the price peaks and valleys you can find on the Ethereum Rainbow Chart are largely correlated with Bitcoin’s halving cycle. Usually, the cryptocurrency prices reach their peak about a year into each halving cycle and revisit it every four years. The next BTC halving, the fourth so far, is expected to happen in the spring of 2024. Check the video below to see which cryptocurrencies could be a good investment in light of the next halving event."
    }
]