[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiIWh0dHBzOi8vbWlsa3JvYWQuY29tL3N0YWtpbmcvZXRoL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Staking Rewards 2024: Top ETH Staking Platforms - Milk Road",
        "content": "Ethereum staking is the process of locking up some of your ETH tokens to help validate blocks and secure the Ethereum network. In return, you will receive Ethereum staking rewards in the form of more ETH.\n\nKey Takeaways Staking your ETH provides you with annual percentage yield (APY) rewards on your staked tokens.\n\nOn-chain ETH staking yields are currently around 4% APY.\n\nThere are three methods to stake your Ethereum — staking through a centralized exchange, staking pools, or running your own node(s). We will cover exactly how to stake ETH using each approach.\n\nFeatured Ethereum Staking Offers For March 2024\n\nNexo Best For Daily Payments Open an Account On Nexo’s site Review 4 Nexo Review Tokens Available ETH ETH Rewards 4% to 12% 4% to 12% Liquid Staking Yes. NETH Yes. NETH Supported Blockchains Ethereum Ethereum Fees 0.03% – 0.20% 0.03% – 0.20% Min. Staking Amount $10 $10 Lock In Period None None Payout Frequency Daily Daily Availability Europe Europe Overview Nexo is a Swiss-based crypto platform featuring staking (ETH only), lending, and a crypto exchange. Nexo’s Smart Staking lets users stake ETH with daily rewards. Swap your ETH for NETH (Nexo Staked Ethereum) in one click to start earning. When you’re ready to unstake, use the Nexo platform to swap your NETH back to ETH. Nexo Smart Staking is not available in the US. Pros & Cons Pros Stake ETH in low amounts\n\nKeep liquidity when staking ETH\n\nUnstake anytime, with a guaranteed 1:1 exchange rate\n\nBorrow against your NETH tokens Cons Staking not available in the US Why We Like Nexo For Staking With Nexo, you can stake anything you want as long as it’s ETH. But while a bit short on selection, Nexo has a great way to stake ETH to earn a yield while staying liquid. Just deposit your ETH on Nexo’s easy-to-use platform and get an equivalent token called NETH (Nexo Staked Ethereum). You can borrow against your NETH or swap it back for ETH at any time while earning a staking yield on your remaining NETH balance. Nexo calls this Smart Staking, and you can get started with as little as $10.\n\nStader Best For Multi-Asset Staking Open an Account On Stader’s site Review 4.3 Tokens Available ETH, MATIC, HBAR, BNB, NEAR, FTM, LUNA ETH, MATIC, HBAR, BNB, NEAR, FTM, LUNA Rewards 3.5% to 15+% 3.5% to 15+% Liquid Staking Yes Yes Supported Blockchains Ethereum, Polygon, BNB, Fantom, Terra, & More Ethereum, Polygon, BNB, Fantom, Terra, & More Fees 10% 10% Min. Staking Amount None None Payout Frequency Varies by asset Varies by asset Availability Worldwide Worldwide Pros & Cons Pros Committed to decentralized staking\n\nMATIC staking on Polygon\n\n40+ Protocol integrations to enhance yields Cons Limited liquidity for Stader liquid tokens\n\nPrimary liquidity pools pair liquid tokens with Stader SD token Features Support for MATIC staking on Polygon: Staking MATIC must be done on the Ethereum network, which can be costly. Stader Labs introduces the ability to stake MATIC on the Polygon network, opening a yield opportunity for smaller positions.\n\nDeFi integrations: Put your staked assets to work in other DeFi protocols to boost your yield. Options vary by chain and include liquidy pools, lending platforms, and yield optimizers.\n\nNewbie-friendly UI: If you know the basics of working with a DeFi wallet like MetaMask, Stader makes it a breeze to stake assets like MATIC and ETH with a liquid token. Why We Like It DeFi can be intimidating if you’re new to the space, but Stader’s user interface and flow for basic liquid staking help both newcomers and seasoned pros put their crypto to work in a jiffy. Smart contract audits from Halborn and Certik help ensure the code is solid, reducing the risk of exploits.\n\nHow Much Can I Earn By Staking Ethereum?\n\nEthereum staking rewards follow a curve where the more ETH is staked, the lower the rewards are. Post-merge, the APY is hovering at around 5% for Ethereum validators.\n\nIt’s important to keep in mind that ETH staking APY is highest for those running their own validator nodes, while those staking Ethereum through a centralized exchange or an ETH staking pool will likely earn a bit less due to the validator fees they will pay. The exception to this is when centralized exchanges boost reward APYs higher than on-chain rates as a marketing effort to attract staking market share.\n\nLearn more about earning crypto interest with our complete guide.\n\nETH 2.0 Staking\n\nAs of 9/15/22, the Ethereum blockchain now uses the proof-of-stake consensus mechanism. Previously, the network ran using proof-of-work for many years, with the ultimate goal of getting to POS.\n\nFollowing the rollout of ETH staking (ETH 2.0), ETH could not be unstaked. Good news: This restriction has since been lifted with the recent Shanghai upgrade. But in some cases, stakers may still find delays in unstaking because each validator node must have 32 staked ETH.\n\nCrypto always finds a way. To provide access to the value locked in staked ETH, several protocols now offer “liquid staking” covered below.\n\nLido: stETH liquid staking token\n\nstETH liquid staking token Coinbase: cbETH liquid staking token\n\ncbETH liquid staking token Rocketpool: rETH liquid staking token\n\nThis form of ETH staking issues a liquid “staked token” that can be spent, traded, or used as collateral — just like regular ETH. The collateral option is particularly attractive to many ETH holders who want to borrow against their ETH without losing their ETH staking rewards.\n\nHow To Stake Ethereum\n\nEach validator on the Ethereum blockchain is required to have 32 ETH staked in order to become a validator. Fortunately, not everyone looking to earn staking rewards has to first save up 32 ETH.\n\nValidators allow smaller ETH holders to delegate their tokens to them and thus earn a part of their Ethereum staking rewards.\n\nBelow we cover how to stake ETH using three common methods, ranging from the easiest to the most difficult:\n\nStaking via a centralized exchange : Exchanges such as Gemini provide support for ETH staking. The process takes just a few clicks and allows you to start earning rewards on your ETH instantly.\n\n: Exchanges such as Gemini provide support for ETH staking. The process takes just a few clicks and allows you to start earning rewards on your ETH instantly. Staking via an ETH staking pool : This intermediate option requires a few more steps but has the added benefit of giving you a liquid token that can be used in place of your staked ETH, even as your tokens remain staked and earn rewards. Lido offers a liquid staking pool, as does Coinbase.\n\n: This intermediate option requires a few more steps but has the added benefit of giving you a liquid token that can be used in place of your staked ETH, even as your tokens remain staked and earn rewards. Lido offers a liquid staking pool, as does Coinbase. Running your own network validator: This is the most direct but also the most challenging way to stake ETH. Running your own validator node requires a 32 ETH stake and a machine that’s on and connected to the internet 24/7.\n\nStaking ETH Via A Centralized Exchange [Easy] Centralized crypto exchanges offer the ability to stake your ETH tokens and earn staking rewards. These rewards vary across exchanges but are usually in the 3% – 7% APY range. Additionally, most exchanges will own the keys to your wallet, which means that your funds will be entrusted to a counterparty. How To Pick A Centralized Exchange Entrusting your crypto to a corporation can be stressful and should only be done when you are sure of the integrity of the company you are working with. Big names like Coinbase are solid options with long-standing reputations in the crypto space. Besides security, the other big consideration when picking a centralized exchange to stake on is the rewards rates that are offered. While Ethereum has an official staking reward rate that applies to all stakers, some platforms provide bigger rewards in an attempt to earn market share. However, be careful of unknown platforms offering APY rates that sound too good to be true — they often are. Pros And Cons Of Staking ETH With A Centralized Exchange Pros Staking through a centralized exchange is very simple and takes just a few clicks.\n\nSometimes you can get very high APY rates when platforms run specials.\n\nCentralized exchanges provide simple, easy-to-understand tax reporting. Cons Exchanges will store your crypto in their proprietary wallets – you no longer directly control your crypto.\n\nIf the company experiences a hack or goes out of business, your crypto may be at risk.\n\nStaking through a centralized exchange is generally antithetical to the decentralized ethos. How to stake your ETH on a centralized exchange: Step by step Editor’s pick for best exchange for staking Ethereum: Coinbase.com – learn more at our full Coinbase review. Step 1: To get started, visit Coinbase to open an account if you don’t have one already. You’ll need complete identity verification. Step 2: Select “My assets” on the left menu and then look for the Buy & Sell box on the right column. This method is faster, but using Advanced trade saves on fees. You’ll find a full walkthrough on how to use Coinbase Advanced in our Coinbase review. Step 3: Under “My assets,” click on your ETH balance and choose “Stake now.” Staking ETH Via An ETH Staking Pool [Intermediate] The minimum Ethereum balance required to stake as an individual is 32 ETH. Most crypto holders do not have that large of a balance, so innovative solutions for staking with a smaller balance have evolved. While one of these solutions is staking through a large centralized exchange, as covered above, another way is to use an Ethereum staking pool. A staking pool is simply a group of ETH holders getting together and pooling their ETH to reach the 32 token threshold necessary to stake. They then split staking rewards proportionally based on contributions. Staking pools have become a buzzing industry by themselves, with entire crypto platforms being established just to provide staking pools as a service. Not all staking pools, however, are the same. The primary difference is whether a staking pool is liquid or non-liquid: Non-liquid staking pools : Traditional, non-liquid staking pools just allow ETH holders to pool their tokens and take advantage of staking rewards. They do not issue a derivative liquid token that can be traded the way liquid staking pools do.\n\n: Traditional, non-liquid staking pools just allow ETH holders to pool their tokens and take advantage of staking rewards. They do not issue a derivative liquid token that can be traded the way liquid staking pools do. Liquid staking pools: A liquid staking pool will not only pool ETH tokens together, but it will also provide stakers with a derivative token that can be actively traded and used. This option lets stakers earn staking rewards while not losing out on liquidity in the process. Liquid staking pools Non-liquid staking pools Issue Liquid Derivative Token Yes No Potentially Taxable Event Yes No Reward Earning Potential Higher Lower Staking ETH Via a Non-Liquid ETH Staking Pool Non-liquid staking pools are a way for ETH holders to earn staking rewards without having the 32 ETH required to self-stake. Unlike liquid staking pools, non-liquid staking pools do not offer a derivative token that can be traded while your ETH is locked up. An important benefit of non-liquid staking pools compared to liquid staking pools is that non-liquid staking does not create a taxable event. In liquid staking, you get a liquid token (such as stETH) back when you stake your ETH. This token swap, however, is treated like any other token swap and is considered a taxable event by the IRS. Non-liquid staking does not issue a new token, therefore does not incur this tax. Note that the actual staking rewards earned through staking APYs are still considered taxable in both liquid staking and non-liquid staking scenarios. Staking rewards for non-liquid staking pools are usually around 4%-6% APY. While these rewards are not as high as liquid staking pools, they are still a great way to put idle ETH to use and staking pools don’t require a balance threshold of 32 ETH. Our picks for non-liquid staking pools: Everstake Chorus One Bitcoin Suisse Current APY 4.05% 3.64% 5.30% Staking ETH Via a Non-Liquid ETH Staking Pool Non-liquid staking pools are a way for ETH holders to earn staking rewards without having the 32 ETH required to self-stake. Unlike liquid staking pools, non-liquid staking pools do not offer a derivative token that can be traded while your ETH is locked up. An important benefit of non-liquid staking pools compared to liquid staking pools is that non-liquid staking does not create a taxable event. In liquid staking, you get a liquid token (such as stETH) back when you stake your ETH. This token swap, however, is treated like any other token swap and is considered a taxable event by the IRS. Non-liquid staking does not issue a new token, therefore does not incur this tax. Note that the actual staking rewards earned through staking APYs are still considered taxable in both liquid staking and non-liquid staking scenarios. Staking rewards for non-liquid staking pools are usually around 4%-6% APY. While these rewards are not as high as liquid staking pools, they are still a great way to put idle ETH to use and staking pools don’t require a balance threshold of 32 ETH. Our picks for non-liquid staking pools: Everstake Chorus One Bitcoin Suisse Current APY 4.05% 3.64% 5.30% Staking ETH Via a Liquid Staking Pool Liquid staking pools generally provide the highest earning opportunity when staking your ETH. Not only do these pools benefit from the official ETH staking rewards, but the liquid tokens they issue can also be lent out or leveraged across DeFi for increased yield. It’s important to keep in mind that since liquid staking providers issue a new token that represents your staked ETH, liquid staking may be a taxable event, as you are swapping one crypto token for another. This is in contrast to non-liquid staking pools, which do not provide a derivative token and thus do not provide additional return potential nor the taxable event when you swap. While the traditional ETH staking rewards are around 5%, using liquidity staking paired with lending or liquidity mining, stakers can achieve APY rewards upwards of 10%. Editor’s Pick: Lido Besides Lido, some other liquid staking providers include: Token Ticker Token Market Cap Current Token APY Rocket Pool rETH $148,447,361 5.26% Stakewise sETH2 $84,916,544 5.92% Ankr aETHc $35,428,861 4.36% How to Pick a Staking Pool Several factors should be considered when picking a staking pool: Fees : Staking pools normally provide lower staking returns than directly staking ETH by running your own validator. This is because they are providing you an intermediary service in setting up the pools that allow your ETH to be staked. Each platform has different fees, and since, for many, the primary goal of ETH staking is to earn as much return as possible, it’s important to compare these fees.\n\n: Staking pools normally provide lower staking returns than directly staking ETH by running your own validator. This is because they are providing you an intermediary service in setting up the pools that allow your ETH to be staked. Each platform has different fees, and since, for many, the primary goal of ETH staking is to earn as much return as possible, it’s important to compare these fees. Validators : Staking pools delegate their staked funds to validators who perform the function of securing the Ethereum blockchain. The idea behind a blockchain is that power is as decentralized as possible, so picking a staking pool that uses a wide variety of validators or one that’s not as popular as the top staking pools is a good idea for anyone focused on decentralization.\n\n: Staking pools delegate their staked funds to validators who perform the function of securing the Ethereum blockchain. The idea behind a blockchain is that power is as decentralized as possible, so picking a staking pool that uses a wide variety of validators or one that’s not as popular as the top staking pools is a good idea for anyone focused on decentralization. Security: Liquid staking providers issue their own liquid tokens that are associated with their platforms. The integrity (and price) of this token depends in large part on the security of the underlying platform. The major staking pool platforms, such as Lido, are solid choices in this regard, though smaller platforms generally also have good security. Besides Lido, some other liquid staking providers include: Marinade Finance\n\nSocean\n\nParrot Pros Liquid staking provides the best returns on staked ETH, especially when paired with other strategies such as lending.\n\nAllows for simple staking without needing 32 ETH\n\nSome staking pools require as little as 0.01 ETH to stake. Cons Liquid staking is often a taxable event as you are swapping tokens.\n\nTakes some know-how of the DeFi ecosystem to get the biggest returns with liquid staking.\n\nSome popular staking pool providers only use a handful of validators, thus contributing to the centralization of Ethereum. How to Stake Ethereum Using a Staking Pool It’s best to use staking pools through a trusted third party. The instructions below will walk you through liquid staking your Ethereum with Lido Finance. We will be using the MetaMask wallet in this example which can be downloaded here. Please note: While the price of Lido’s stETH token is normally pegged 1:1 to the price of ETH, market volatility and other extraneous events may sometimes lower stETH’s price when compared to ETH. This means that you may be able to buy stETH for less than ETH and get access to Lido’s yield rewards without having to stake your ETH. Check the current stETH price before staking to make sure you’re getting the best deal. Step 1: Navigate to the Ethereum staking part of Lido’s website and click “Stake Ethereum” to get started. Step 2: On the next page, click “Connect Wallet.” Step 3: Select the “MetaMask” option. Step 4: You will then receive a prompt in your wallet that asks you to connect to the Lido website. Click “Next” and then “Connect” on the next screen. Step 5: Your wallet will now be connected to the Lido website. Step 6: Next, enter the amount of ETH that you would like to stake and click the “Submit” button. Step 7: You will be asked to confirm the transaction in your wallet. Click the blue “Confirm” button in order to initiate the transaction. Step 8: Back on the Lido website, you will see a short waiting screen while the platform confirms your transaction. Step 9: Once the transaction goes through, you will see a new balance of “stETH” in your wallet and in the Lido UI. This is Lido’s liquid token that you have received in exchange for your staked ETH.\n\nBoost Ethereum Staking Rewards With stETH\n\nLiquid tokens can be used to earn additional rewards on top of Ethereum’s staking rewards.\n\nOnce you’ve gotten your stETH tokens by following the above instructions, you can boost your ETH staking rewards by depositing your stETH to Yearn Finance’s Curve stETH vault. This staking method combines the base ETH staking yield with the yield from staking stETH through Curve as well as Yearn’s vault yields.\n\nAn Example\n\nFor example, if you are earning 4% ETH staking APY on Lido through your staked ETH, and then you take your earned stETH tokens and stake them through Yearn’s stETH pool which provides another 4.81% APY, you will be earning a total of 8.81% APY on your ETH after the Lido and Yearn.finance staking.\n\nThese rewards are not paid out in ETH, however. When staking through Lido, you earn ETH staking rewards in Lido’s stETH token. After you take your stETH tokens from Lido and stake them on Yearn.finance, (using the instructions below) your Yearn rewards will be paid out in the Curve stETH token. Both stETH and Curve stETH can be swapped back to ETH at any time using an exchange.\n\nThe below table illustrates our example’s combined APY.\n\nStaking APY Earn Rewards In Staking With Lido 4% stETH tokens Staking With Yearn.finance 4.81% Curve stETH tokens Combined Return 8.81%\n\nStaking stETH Through Yearn.finance Step 1: Navigate to Yearn.finance’s Curve stETH vault and connect your wallet by using the “Connect Wallet” button in the top right corner. Note: You can view the current APY of the Yearn vault under the “APY” section. Step 2: Under the “From Wallet” section on the right, click on the Curve stETH icon and select “stETH” as the currency you are depositing from your wallet. Step 3: Enter the amount of stETH that you would like to deposit and click “Approve”. Confirm the transaction through your wallet. Step 4: Once you have approved the transaction, the “Deposit” button will become available. Click “Deposit” to deposit your stETH and start earning Curve stETH APY. Note on fees: Yearn takes a 2% man agement fee on all vault deposits. They also take a 20% performance fee on all yield earned. The instructions above use a Yearn feature called “Zap” which also adds a 0.3% fee to the transaction. Find out more about Yearn fees on their website. Running Your Own ETH Validator [Hard] Network validators are responsible for validating Ethereum transactions and creating Ethereum blocks. Validators are individuals who have at least 32 ETH staked and have the equipment necessary to perform their duties. Getting started as a network validator certainly takes some technical savvy. While not every validator has to have a massive computing rig at their home, and some can use off-site machines in data centers, validators must still be prepared to handle issues that arise and must understand the intricacies of the Ethereum blockchain. After staking the 32 ETH necessary to become a validator and getting set up, you can expect to earn the full non-diluted staking APY on your ETH (around 5%). What You Need to Run Your Own Network Validator First and foremost, network validators need to have a balance of 32 ETH in order to begin the process. In terms of direct necessities, a physical computer with a 24/7 connection to the internet is required. Software in the form of an execution layer client and a consensus layer client, as well as validator-specific Ethereum keys, will also be necessary. Hardware Requirements The hardware requirements to run a network validator node are not nearly as demanding as those for proof-of-work mining. Most of today’s consumer-grade machines are powerful enough for the task. Please note that you will need a machine with an SSD and cannot use an HDD for validating. It is also strongly recommended that a 64-bit Linux system is used with a cable internet connection (not WiFi). Minimum System Requirements Recommended System Requirements Operating System 64-bit Linux, Mac OS X, Windows, Arm64 64-bit Linux, Mac OS X, Windows, Arm64 Processor Intel Core i5–760 or AMD FX-8100 or better Intel Core i7–4770 or AMD FX-8310 or better RAM 4GB RAM 8GB RAM Storage 20GB available space SSD (you cannot use a hard disk drive) 100GB available space SSD (you cannot use a hard disk drive) Internet Broadband connection Broadband connection through ethernet cable Find out more about these requirements from the Ethereum.org website. Cloud Providers It’s not necessary to use a personal machine in order to run a validator node. In fact, many validators opt for using a cloud service that allots them space on a remote machine which they can use to run their node. Here are some of the most popular cloud providers: Allnodes : As one of the biggest cloud hosting providers, Allnodes hosts over 33,000 nodes with an aggregate value of over $1.5 billion dollars. Getting started on Allnodes is simple and the service starts at just $5/month.\n\nBlox : Blox staking takes pride in their fully non-custodial solution which allows users to retain full control of their private validator keys. What’s more is that signing up for the service and getting started is currently free.\n\nBlockdaemon : A favorite cloud provider for institutional stakers. Blockdaemon supports over 60 blockchains and counts some of the largest crypto players among its clients. Their cloud node is touted as a “White Label Validator” service and can be accessed here.\n\nPros And Cons Of Running An Ethereum Pros Get the best staking rewards available, with no middleman.\n\nParticipate directly in operating the Ethereum chain.\n\nNo reliance on third-party platforms, so your staked funds are not exposed to potential hacks or site downtime. Cons ETH cannot be unstaked until a future upgrade of the Ethereum network.\n\nRequires technical know-how.\n\nMistakes made in the process may reduce your rewards or even get you ejected from the network\n\nHow to Stake Ethereum With Your Own Network Validator Step 1: Acquire 32 ETH + the necessary hardware and software for becoming a validator. (More info) Step 2: Generate your validator keys and deposit your 32 ETH. (More info) Step 3: Practice on a testnet, complete the validator checklist and wait to get activated. (More info) The Merge And Ethereum Staking Ethereum has traditionally been a blockchain secured through the proof-of-work mechanism. On September 15th, 2022, however, the network seamlessly transitioned over to a proof-of-stake mechanism by merging the main Ethereum chain with the Beacon chain — which had itself been running through a proof-of-stake consensus mechanism since 2020. The price of ETH did not experience major moves in response to The Merge, and the network experienced no downtime or disturbances. Ethereum’s proof-of-stake mechanism now allows the blockchain to run at full capacity with a much smaller environmental impact, significantly lower transaction fees, and a higher throughput of transactions per second. The Merge, however, is not the last planned Ethereum upgrade. Over the coming months and years, the network is slated to undergo a series of changes that make Ethereum a much cheaper and faster blockchain. Ethereum co-founder, Vitalik Buterin, has lyrically labeled the planned updates as the surge, the verge, the purge, and the splurge. The Surge : This planned upgrade is the addition of sharding which will allow Ethereum to process over 100,000 transactions per second. The Surge is expected to be deployed to the Ethereum network at some point in 2023.\n\nThe Verge : This upgrade will reduce the amount of data that network validators are required to keep on their hard drives when helping to run the protocol, thereby making the validating process more efficient.\n\nThe Purge : The Purge is meant to reduce the hard drive space that storing ETH takes up, as well as not requiring nodes to store history — thereby increasing the efficiency of the network.\n\nThe Splurge : According to Vitalik, the Splurge is a catch-all term for “all of the other [upcoming] fun stuff.”\n\n\n\nTo Sum It Up\n\nEthereum staking provides holders with the opportunity to validate the Ethereum network while simultaneously earning Ethereum straking rewards (paid in ETH).\n\nIt’s also important to choose wisely when deciding where to stake ETH. While the network requires a 32 ETH balance to directly stake, service providers such as staking pools and centralized exchanges allow staking with much smaller balances.\n\nFrequently Asked Questions\n\nHow Much ETH Do You Need To Stake? Normally, it’s 32 ETH. However, this only applies to validators directly staking to the Ethereum blockchain. Service providers such as staking pools and centralized exchanges act as middlemen between validators and ETH holders and allow staking with a much lower ETH stake. Can You Compound Your ETH Staking? Ethereum staking rewards automatically compound in most cases, giving you an annual percentage yield (APY) higher than the annual percentage rate (APR) for your ETH stake. Many ETH staking platforms compound ETH staking rewards every few days. Using liquid staking, ETH stakers can earn both ETH staking rewards and additional yield through activities like lending and liquidity mining. Are ETH Staking Pools Profitable? Non-liquid staking pools generally provide staking rewards close to the official Ethereum staking APY (normally around 4%) Liquid staking pools also provide these staking rewards, but they issue a liquid token that can be leveraged to earn even more. What Is ETH Staking Yield? Since validators with staked ETH are necessary to keep the Ethereum blockchain running, they are compensated by the chain for having their ETH staked. This reward is referred to as “staking yield” and is currently around 5% annual percentage yield (APY). What Are The Best ETH Staking Validators? The best staking validators often have a long history of validating the Ethereum blockchain with few or no failed blocks, as well as 24/7 uptime and low commissions. What Are The Best ETH Staking Pools? Our pick for the best Ethereum staking pool is Lido.\n\nContributor George Hristov George is a tech writer interested in web3 startups and communities. In the dynamic world of crypto, he stays plugged into the day-to-day headlines, deep dives, and industry commentary. Read More"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDYvMDkvZXRoZXJldW1zLWJ1dGVyaW4tcmVsZWFzZXMtcm9hZG1hcC1hZGRyZXNzaW5nLXNjYWxpbmctcHJpdmFjeS13YWxsZXQtc2VjdXJpdHkv0gF7aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wNi8wOS9ldGhlcmV1bXMtYnV0ZXJpbi1yZWxlYXNlcy1yb2FkbWFwLWFkZHJlc3Npbmctc2NhbGluZy1wcml2YWN5LXdhbGxldC1zZWN1cml0eS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Ethereum’s Buterin Releases Roadmap Addressing Scaling, Privacy, Wallet Security - CoinDesk",
        "content": "“It's not just features of the protocol that need to improve; in some cases, the way that we interact with Ethereum needs to change pretty fundamentally, requiring deep changes from applications and wallets,” Buterin writes."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V0aGVyZXVtLWFkb3B0LXRocmVlLXRyYW5zaXRpb25z0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Vitalik Buterin: Ethereum must adopt 'three transitions' to succeed - Blockworks",
        "content": "As one of the largest blockchain ecosystems continues to grow, Ethereum co-founder Vitalik Buterin notes that it will be necessary to adopt the “three transitions” for Ethereum to be sustainable in the long term.\n\nThese transitions, as Buterin explains in his latest blog post are: layer-2 scaling, wallet security and privacy.\n\n“It’s not just features of the protocol that need to improve; in some cases, the way that we interact with Ethereum needs to change pretty fundamentally, requiring deep changes from applications and wallets,” Buterin wrote.\n\nButerin explains that it will be necessary to build cross-chain solutions of layer-2 blockchains, drawing on examples of how it is difficult now for users to have only one address with the multiple different scaling solutions that exist on top of Ethereum today.\n\n“In an L2 scaling world, users are going to exist on lots of L2s. Are you a member of ExampleDAO, which lives on Optimism? Then you have an account on Optimism! Are you holding a CDP in a stablecoin system on ZkSync? Then you have an account on ZkSync… The days of a user having only one address will be gone,” he said.\n\nThis must be achieved at the same time as the further development of smart contract wallets and privacy.\n\nBlockchain solutions are beginning to look more alike\n\nThese three transitions are not completely new to the blockchain ecosystem at large, and definitely not unique to Etheruem.\n\nCross-chain solutions that can help different networks communicate with one another, for example, has been explored in depth by the Cosmos ecosystem — a network of individual layer-1 app chains.\n\nIn an interview with Blockworks, Dougie DeLuca, an investor at Figment Capital, noted that rollup ecosystems are beginning to resemble Cosmos in a lot of ways.\n\n“There’s conversations right now about how blockchain design is just going to be commoditized, and they’re going to look kind of similar. This is honestly the earliest sign of this that I’ve seen, where the Cosmos has proliferated the idea of app chains. And rollups right now are moving more and more towards app specific rollups, which is similar to an app chain,” DeLuca said.\n\nCosmos layer-1 blockchains, for example, communicate with each other through an inter-blockchain communication protocol (IBC). A more Ethereum-native solution to resolving the interoperability between layer-2s would be Connext, a team building out chain abstraction.\n\nLoading Tweet..\n\nSimilarly, with smart contract wallets, Etheruem is designing account abstraction solutions that will enable users to have self custody over their own wallets. In Cosmos, this is currently being explored by Authz.\n\nAlthough fundamentally different, the end goal is similar.\n\n“I think it would be great for the Cosmos and rollup teams to work closely together…Ethereum has been focusing on one set of problems for a long time, and Cosmos another set. If we combine our knowledge, I think we actually have a pretty great solution that we can work towards,” DeLuca said.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vY29pbmNvZGV4LmNvbS9hcnRpY2xlLzI1OTMyL2V0aGVyZXVtLXRyaXBsZS1oYWx2aW5nL9IBP2h0dHA6Ly9hbXAuY29pbmNvZGV4LmNvbS9hcnRpY2xlLzI1OTMyL2V0aGVyZXVtLXRyaXBsZS1oYWx2aW5nLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "What Is Ethereum Triple Halving? How ETH Became Deflationary - CoinCodex",
        "content": "If you’ve been around crypto for a while, you’ve probably heard of the Bitcoin halving, which is a highly anticipated event that happens every four years. But did you know about the Ethereum triple halving?\n\n“Ethereum triple halving” is a term used to describe three factors that are providing deflationary pressure to the ETH supply. The term is inspired by the Bitcoin halving, which is a mechanism implemented in the Bitcoin protocol that cuts the issuance of new BTC coins by half roughly every four years.\n\nIn this article, we’ll explain the Ethereum triple halving and how it can effect the prospects of ETH as a long-term investment.\n\nBefore we continue, we should make it clear that the name “Ethereum triple halving” is a bit deceiving—we’ll explain why in the next section of the article. Regardless, the name has been adopted by the crypto community, and the concept it describes is very important if you’re considering investing in ETH.\n\nWhat is the Ethereum triple halving?\n\nHowever, it’s important to keep in mind that unlike the Bitcoin halving, the Ethereum triple halving is not an actual event built into the Ethereum protocol. Instead, it’s a term that the Ethereum community came up with to describe how new mechanisms implemented in the Ethereum protocol are helping reduce the supply of ETH.\n\nThe concept of the Ethereum triple halving consists of three main parts:\n\nReduced ETH issuance under Proof-of-Stake consensus\n\nETH burning via the EIP-1559 upgrade\n\nEthereum staking lowers the amount of ETH that is effectively in circulation\n\nNow, let’s explore how each of these factors is impacting the ETH supply and how they could help Ethereum recover from the crypto bear market.\n\nThe migration to Proof-of-Stake has led to reduced ETH issuance\n\nEthereum’s migration from Proof-of-Work to Proof-of-Stake has had a very significant impact on the ETH supply. The reason for this is quite simple—the Ethereum blockchain has to issue much fewer ETH to reward stakers than the amount of ETH it had to issue to reward miners.\n\nCryptocurrency mining is an energy-intensive process that requires a significant upfront investment in mining hardware. Meanwhile, staking requires much less energy and is cheaper to get started with. Therefore, the network needs to issue a smaller amount of ETH to reward stakers adequately compared to the amount of ETH it had to issue to incentivize miners.\n\nMore specifically, the Ethereum protocol was issuing around 13,000 ETH per day to reward miners under the Proof-of-Work model. Under the new Proof-of-Stake model, the Ethereum protocol only has to issue about 1,600 ETH per day to reward stakers. This is a reduction of about 87.7%.\n\nAccording to ETH supply tracker ultrasound.money, the Ethereum supply has decreased by 281,627 ETH from September 15, 2022 to June 9, 2023. According to the aggregator’s estimates, the supply would have instead increased by 2.8 million ETH in the same time period if Ethereum still used Proof-of-Work.\n\nIn the following chart, you can see how the supply of ETH has changed since the transition to Proof-of-Stake (September 15, 2022). For comparison, the chart also includes the change in Bitcoin’s supply and the change in ETH supply if it still used Proof-of-Work (simulated).\n\nAs we can see, ETH has been slightly deflationary since the transition over to the Proof-of-Stake consensus mechanism. If this trend continues, it favors long-term ETH holders since ETH will become increasingly scarce, providing positive pressure to the coin’s price.\n\nHowever, there’s no guarantee that the ETH supply will continue to be deflationary forever, as we’ll explain in the following section.\n\nEIP-1559 and transaction fee burning\n\nSo, we learned that the ETH issuance rate has dropped to about 1,600 ETH per day since the Merge. But if 1,600 new ETH is being created every day, how has the supply of ETH decreased?\n\nThe answer lies in the EIP-1559 upgrade, which was activated through the London hard fork in August 2021. The upgrade reworked Ethereum’s transaction fee structure with a mechanism in which the base ETH gas fee paid for transactions is burned. It also gave Ethereum users the option to add a “tip” for validators to have their transaction prioritized.\n\nComparing the Ethereum transaction fee mechanisms before and after EIP-1559. Image source: ConsenSys\n\nEIP-1559 is the reason why the ETH supply has decreased despite new ETH coins being created every day to reward validators. The amount of ETH that’s being burned of course depends on how much ETH users are paying for transactions on the Ethereum network. So, when demand for transactions on Ethereum grows, more ETH is burned.\n\nSo far, the amount of ETH burned through EIP-1559 has outpaced the amount of ETH that’s being issued, resulting in a slight reduction in the ETH supply. If demand for transactions for Ethereum drops in the future, however, we could see ETH becoming inflationary again.\n\nETH staking\n\nETH staking is the third factor included in the Ethereum triple halving concept. Following the move to Proof-of-Stake, ETH holders can stake their coins to help secure the Ethereum network and earn staking rewards in exchange.\n\nEssentially, staking Ethereum provides another incentive to passively hold ETH and lock it up in staking, which temporarily removes it from circulation (staked coins cannot be sold without being unstaked first).\n\nThis part of the Ethereum triple halving has become a bit less relevant recently. This is because the Shapella upgrade, which was enabled on April 12, 2023, introduced the ability to withdraw staked ETH coins. Between the introduction of Ethereum staking in December 2020 and the Shanghai upgrade, staked ETH could not be withdrawn, so they were truly removed from circulation.\n\nStill, the ability to withdraw ETH hasn't actually translated to a flood of ETH withdrawals — it appears that most ETH stakers are happy to stake their coins and passively earn yield on their holdings.\n\nIn fact, we can see a sharp uptick in the amount of staked ETH after the Shanghai upgrade went live on April 12, 2023. This means that overall, the upgrade increased confidence in Ethereum's staking system and made a larger number of investors willing to stake their coins. At the time of writing, there's a total of 22.7 million staked ETH.\n\nTotal amount of staked ETH (emphasis added). Image source: Dune Analytics / @hildobby\n\nNow that ETH holders have the option of withdrawing their staked coins, staked ETH can no longer be counted as removed from circulation. Still, the ability to stake ETH is an incentive against selling, so one could still argue that ETH staking is a positive influence on ETH as a long-term investment.\n\nWhen is the Ethereum triple halving happening?\n\nUnlike the Bitcoin halving, the Ethereum triple halving is not an actual event, so it doesn’t have a date. All the mechanisms described by the term Ethereum triple halving have already been implemented, so we can say that the Ethereum triple halving has already happened and will continue to be in effect so long as the Ethereum protocol is changed in a relevant way.\n\nThe ETH triple halving has already turned the ETH supply deflationary, although there’s no guarantee that it will remain this way. Due to the burn mechanics introduced in EIP-1559, the fluctuations in the ETH supply are determined by the demand for transactions on the Ethereum network. If ETH continues to be deflationary, the Ethereum triple halving could positively impact the long-term Ethereum price prediction.\n\nThe bottom line — The Ethereum triple halving has made ETH a better long-term investment\n\nThe Ethereum triple halving’s impact on the ETH supply has made ETH a more attractive asset to hold over the long term, as it significantly reduced the amount of new ETH coins that are entering circulation. In fact, ETH has even turned slightly deflationary after the last part of the Ethereum triple halving, the transition to Proof-of-Stake, was implemented in September 2022.\n\nOf course, the Ethereum triple halving is only one of the factors to consider when evaluating Ethereum as an investment. It’s also important to keep up with developments on the Ethereum scalability front, which will ultimately determine whether Ethereum will be able to gain truly widespread adoption."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZGVjcnlwdC5jby8xNDM5OTEvZXRoZXJldW0tZmFpbHMtd2l0aG91dC10aGVzZS0zLWNoYW5nZXMtc2F5cy12aXRhbGlrLWJ1dGVyaW7SAVtodHRwczovL2RlY3J5cHQuY28vMTQzOTkxL2V0aGVyZXVtLWZhaWxzLXdpdGhvdXQtdGhlc2UtMy1jaGFuZ2VzLXNheXMtdml0YWxpay1idXRlcmluP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 10 Jun 2023 07:00:00 GMT",
        "title": "'Ethereum Fails' Without These 3 Changes, Says Vitalik Buterin - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIf Ethereum is to expand how it's used, it will need to undergo three major transitions or risk undermining its own future, said Ethereum co-founder Vitalik Buterin.\n\nIn a blog post published on Friday, Buterin laid out his ideas for what it will take to help Ethereum mature if it is to expand in use. Calling them “The Three Transitions,” Buterin said they would need to evolve around transitions in layer-2, or “L2,” scaling solutions, a move to smart contract wallets, and greater privacy for fund transfers.\n\nButerin’s proposals bump into what has been called the \"blockchain trilemma.\" A blockchain's most important traits are being decentralized, secure, and scalable, but it can only usually achieve two of these three.\n\nAD\n\nAD\n\nTo overcome this, Buterin said that it is acknowledged that these transitions would be challenging to coordinate, but said they were needed for Ethereum to survive.\n\nOf the three, Buterin singled out a need to expand use of L2 solutions called “rollups” as an important part of this transition. An ordinary L2 function processes transactions off of the main Ethereum blockchain, or the L1.\n\nA rollup is a scaling solution that bundles these transactions and then validates a proof of them as a much smaller piece of data on the mainnet to keep it from getting too clogged. As a result, the cost of an Ethereum transaction can be lower.\n\n\"Layer 2s are critical to the success of Ethereum’s vision of the world computer. Without L2s, Ethereum won’t scale,\" CEO of OP Labs and co-founder of Ethereum scaler Optimism Karl Floersch told Decrypt. \"Without scale, Ethereum will never be able to support the world’s compute demand, and until the world’s compute is fully supported, we can’t fully realize Ethereum’s vision.\"\n\nCritically, said Buterin, the version of Ethereum that does not address the move to rollups \"fails,\" adding that transaction costs would only surge in the face of a bull run and encourage more centralization on its blockchain.\n\nAD\n\nAD\n\n\"The solution isn't simply 'move users off of mainnet.' Rather, the solution lies in extending the capabilities of the Ethereum network,\" Floersch said. \"This means that instead of thinking about it as a migration from mainnet, we can think about it as load balancing the demand for Ethereum mainnet with other highly secure OP chains.\"\n\nBringing Ethereum from the edge\n\nEli Ben-Sasson, co-founder of the Israeli-based company StarkWare behind layer-2 scaling solutions StarkEx and StarkNet, said Buterin was “right” in his diagnosis of what it would take to see an expanded Ethereum.\n\nHe said his company was already using the smart contract wallets as part of its StarkNet, and believes more of this type of scaling is “over the horizon.”\n\n“Having the leadership from Vitalik which both appreciates the excitement of this moment and urges the community to get on board is a big part of what will propel Ethereum’s success,” Ben-Sasson told Decrypt.\n\nButerin said the move to smart contract wallets has some \"technical issues\" to work through but is \"not a large burden\" to address.\n\nWith a smart contract, contracts automatically execute their terms when predefined conditions are met, and Buterin said they would make some processes easier like covering transactions for non-ETH tokens.\n\nOf the three transitions, Buterin expressed concern that meeting privacy concerns would be among the bigger challenges. He said that without enough data privacy measures in place, users concerned about this will stay away from Ethereum.\n\n“Without [privacy], Ethereum fails because having all transactions available publicly for literally anyone to see is far too high a privacy sacrifice for many users,\" said Buterin.\n\nAD\n\nAD\n\nTo address this, Buterin suggested using \"stealth address\" to help protect user identities, but these methods are still maturing because of issues around cost and functionality."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWV0aGVyZXVtLXRvLXNoYWtlLW9mZi10b290aGxlc3MtYWR2ZXJzYXJ5LXNlYy1hcy1mb21jLWxvb21z0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin, Ethereum to shake off 'toothless adversary' SEC as FOMC looms - Cointelegraph",
        "content": "Bitcoin (BTC) and Ether (ETH) are due volatility — but not thanks to “toothless” United States regulators, new analysis says.\n\nIn its latest market update on June 9, trading firm QCP Capital told market participants to gear up for macro-fueled price action for BTC and ETH.\n\nRelated: Why is Bitcoin price stuck?\n\nQCP Capital: U.S. crypto “mudslinging” to continue\n\nThe dust is continuing to settle on this week’s main macro stories — lawsuits against exchanges Binance and Coinbase from the U.S. Securities and Exchange Commission.\n\nMore upheaval will come in the future, QCP believes, as the macro environment from next week onward becomes much more unpredictable.\n\nThe SEC and Chair Gary Gensler, however, even if they continue to go after crypto, will not spark the mass price depreciation that some fear.\n\n“Once again trigger-happy Gensler and his SEC cronies wielded their ‘securities’ threat on their favourite whipping industry. However as we have maintained before, BTC/ETH will continue to treat the SEC as a toothless adversary — especially as it becomes crystal clear that the term ‘security’ will not apply to either,” it wrote.\n\n“As more and more such far-fetched SEC complaints are filed, it becomes increasingly clear all they are seeking are sensational headlines leading to a final fat settlement. After all, Gensler has proven the most capitalist of all previous regulators.”\n\nWhat could put the cat among the pigeons, QCP warns, is the U.S. Department of Justice or other arms of the establishment.\n\n“And if one of them gets involved, then the case becomes more serious and all bets are off,” it continued.\n\n“Nonetheless we expect more mudslinging from the Biden administration to continue on crypto, and even ramp up into election season next year.”\n\nThe days following the exchange lawsuits have so far seen crypto market sentiment withstand the pressure, with the Crypto Fear & Greed Index staying rooted at 50/100 — “neutral” territory.\n\nCrypto Fear & Greed Index (screenshot). Source: Alternative.me\n\nBitcoin price consolidates into “action packed” week\n\nBeyond the SEC itself, meanwhile, next week’s macro data reports could provide a trigger of their own.\n\nRelated: Bitcoin price can gain 60% if ‘textbook’ chart pattern confirms — Trader\n\nThe Consumer Price Index (CPI) print for May is due June 13, along with a Federal Reserve policy update, which will decide the next step for benchmark interest rates.\n\n“Going into next week, we have an action packed macro week as well — with US CPI, the June FOMC (including quarterly Fed rate projections) and other huge central bank meetings all taking place,” QCP noted.\n\nThe analysis also flagged changes to the Treasury General Account, apt to suck liquidity out of the monetary system and in doing so present a potential headwind for risk assets across the board.\n\nThat theory is on the radar for other well-known crypto figures, including former BitMEX CEO Arthur Hayes, who has been monitoring it since the start of 2023.\n\nQCP’s optimistic perspective comes as BTC/USD continues to tread water near key price support levels, with the 200-week EMA in particular.\n\nBTC/USD traded at around $26,600 on Bitstamp at the time of writing, according to data from Cointelegraph Markets Pro and TradingView.\n\nBTC/USD 1-hour candle chart on Bitstamp. Source: TradingView\n\nMagazine: Home loans using crypto as collateral: Do the risks outweigh the reward?\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNi8wOS90d28tbWFqb3ItY2F0YWx5c3RzLWFyZS1hLWJvb24tZm9yLWV0aGVyZXVtLXByaWNlLXNheXMtYmxvb21iZXJnLWFuYWx5c3QtbWlrZS1tY2dsb25lLWJ1dC10aGVyZXMtYS1jYXRjaC_SAY4BaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDYvMDkvdHdvLW1ham9yLWNhdGFseXN0cy1hcmUtYS1ib29uLWZvci1ldGhlcmV1bS1wcmljZS1zYXlzLWJsb29tYmVyZy1hbmFseXN0LW1pa2UtbWNnbG9uZS1idXQtdGhlcmVzLWEtY2F0Y2gvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Two Major Catalysts Are a Boon for Ethereum Price, Says Bloomberg Analyst Mike McGlone – But There’s a Catch - The Daily Hodl",
        "content": "Bloomberg Intelligence’s senior macro strategist Mike McGlone says that two major catalysts could send Ethereum (ETH) much higher.\n\nIn a tweet to his 58,000 followers, McGlone says that rising demand for ETH and a declining supply are bullish signs for the smart contract platform.\n\nHowever, the macro strategist says headwinds from continued Federal Reserve rate hikes and weakening technicals for financial markets may limit ETH price action to the upside.\n\n“Solid Ethereum Supply/Demand vs. Fed, Weak Technicals: BI Crypto. Demand and adoption appear to be low and rising vs. diminishing supply, which is positive for the Ethereum (ETH) price, but an unfavorable Fed and technical backdrop at the start of June may keep a lid on prices.”\n\nMcGlone’s chart looks at economic indicators such as copper futures and federal funds futures, which indicate an economic slowdown may be coming.\n\nMcGlone also looks at the performance of Ethereum against the Nasdaq 100 Stock Index and notes that ETH is struggling to cross the $2,000 level despite the Nasdaq’s recent surge.\n\n“Divergent Weakness and Ethereum’s $2,000 Ceiling – The inability of Ethereum to stay above $2,000 despite a 52-week high in the Nasdaq 100 Stock Index in 2Q may portend a resistance ceiling for the crypto. The token may depend on the stock index to lift all boats.”\n\nEthereum is trading for $1,845 at time of writing, up 0.7% during the last 24 hours.\n\nMcGlone notes that Bitcoin (BTC) is also down against the Nasdaq, which has taken off in the near term largely due to the potential of artificial intelligence (AI).\n\n“Cryptos vs. AI: Bitcoin’s $1 Trillion Ceiling May Guide Nvidia – Down about 5% in 2Q, high-beta Bitcoin shows little endorsement of the roughly 10% jump in the Nasdaq 100 Stock Index, of which Nvidia is ranked fourth in weight. Bitcoin down vs. the Nasdaq up is rare.”\n\nBitcoin is worth $26,474 at time of writing, up 0.4% during the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Titima Ongkantong/monkographic"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvZXRoZXJldW0tcHJpY2UtYW5hbHlzaXMtc2VsbGVycy1pbi1jb250cm9sLW1heS1wbHVuZ2UtZXRoLXByaWNlLXRvLTE2NTAtYnV5LXRoaXMtZGlwL9IBdmh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvZXRoZXJldW0tcHJpY2UtYW5hbHlzaXMtc2VsbGVycy1pbi1jb250cm9sLW1heS1wbHVuZ2UtZXRoLXByaWNlLXRvLTE2NTAtYnV5LXRoaXMtZGlwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 10 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Price Analysis: Sellers in Control May Plunge $ETH Price to $1650; Buy this Dip? - CoinGape",
        "content": "Ethereum Price Analysis: Today on June 10th, the crypto market witnessed a massive liquidation amid the US SEC lawsuit against big crypto exchanges Binance(BNB) and Coinbase(COIN). As a result, the market leaders Bitcoin and Ethereum tumbled 2.5% and 6.5% on intraday levels respectively. Amid this downfall, the ETH price lost crucial monthly support of $1775-$1765 indicating the coin holders could experience an extended correction.\n\nAlso Read: Ethereum Co-Founder Names Three Key Transitions to Watch as Network Grows\n\nadvertisement\n\nEthereum Price Daily Chart\n\nA bearish breakdown below the $1765 support sets the ETH price on a 5.5% loss\n\nThe long-term trend for Ethereum stays bullish as long as the support trendline is intact;\n\nThe intraday trading volume in Ether is $4.6 Billion, indicating a 0.27% loss.\n\nSource- Tradingview\n\nToday, the Ethereum price showcased a high momentum breakdown from the $1775-$1765 support level. Losing this last swing low support hints the ETH price may prolong the ongoing correction phase.\n\nIf the daily candle closes below the $1765 support the selling pressure will accelerate and offer trades the opportunity to short sell. With sustained selling the coin price will tumble 5.5% to hit the long-coming support trendline.\n\nPreviously, a retest to this support trendline triggered a significant recovery in the ETH price, validating this level as a crucial accumulation zone. Therefore, potential traders must mark this dynamic support if looking for a dip opportunity.\n\nWill Ethereum Price Reach $1700?\n\nThe intense sell-off today backed by high volume indicates the sellers have a strong conviction to take the Ethereum price lower. With the breakdown of $1775-$1765 support, the coin price will more likely plunge to the next significant support of $1700, followed by the combined support of $1650 and ascending trendline.\n\nAverage Directional Index: The uptick in the daily ADX slope assures sufficient strength in sellers to carry further downfall.\n\nBollinger Band: A downtick in the lower band of the BB indicator accentuates high momentum selling in the market."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtcHJpY2UtYW5hbHlzaXMtZm9yLWp1bmUtMTDSATtodHRwczovL3UudG9kYXkvZXRoZXJldW0tZXRoLXByaWNlLWFuYWx5c2lzLWZvci1qdW5lLTEwP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 10 Jun 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Analysis for June 10 - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nSellers have seized the initiative as the prices of coins have sharply gone down.\n\nAdvertisement\n\nTop coins by CoinMarketCap\n\nETH/USD\n\nEthereum (ETH) has lost more than Bitcoin (BTC), declining by 5.45% since yesterday.\n\nImage by TradingView\n\nOn the hourly chart, the rate of Ethereum (ETH) has made a false breakout of the recently formed support level at $1,726. If buyers can seize the lost initiative and get the price back to $1,760, the upward move may continue to the $1,780 mark.\n\nImage by TradingView\n\nOn the daily time frame, the price of ETH is about to fix below the important support at $1,737. If it happens, the accumulated energy might be enough for a more profound decline to the $1,700 area within the next few days.\n\nImage by TradingView\n\nBears are also more powerful than bulls from the midterm point of view. The rate has returned to the support level after its false breakout, which means that buyers are not ready to seize the initiative yet.\n\nIn this case, traders can expect a fall to the $1,600-$1,650 zone shortly.\n\nEthereum is trading at $1,743 at press time."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vYW1iY3J5cHRvLmNvbS90aGUtaG93LWFuZC13aHktb2YtZXRoZXJldW1zLWxhdGVzdC11cGRhdGUv0gFFaHR0cHM6Ly9hbWJjcnlwdG8uY29tL3RoZS1ob3ctYW5kLXdoeS1vZi1ldGhlcmV1bXMtbGF0ZXN0LXVwZGF0ZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 10 Jun 2023 07:00:00 GMT",
        "title": "The how and why of Ethereum’s latest update - AMBCrypto News",
        "content": "Ethereum developer proposed final changes to add to the Cancun upgrade.\n\nETH’s price soared alongside its velocity.\n\nThe new Cancun update that is supposed to be launching on Ethereum [ETH] has been a huge subject of discussion for developers over the last few months. Recently, in the “All Core Developers Consensus Call”, many details of the update were finalized.\n\nIs your portfolio green? Check out the Ethereum Profit Calculator\n\nDevelopers come to an agreement\n\nThe main topic of discussion was about blobs. Blobs are chunks of data that can be added to the Ethereum blockchain. An Ethereum developer named Dankrad Feist conducted an experiment to test how well the Ethereum network can handle large blocks with additional data.\n\nFeist found that the Ethereum network successfully processed blocks with 128 kB to 1 MB of extra data without causing any problems. He tested factors like bandwidth usage, block speed, and missed attestations. Everything remained stable regardless of block size.\n\nHowever, there was one instance where a block carrying 1 MB of additional data caused a temporary reorganization of the blockchain.\n\nBased on the experiment, Feist suggested making some changes. He recommended increasing the maximum number of blobs per block from 4 to 6, as specified in EIP 4844. He also suggested reevaluating the deadline for receiving blocks within a certain time frame.\n\nNext, the participants discussed making modifications to EIP-4788. This EIP allows the Beacon block root to be visible in the EVM (Ethereum Virtual Machine). The suggestion was to restrict the quantity of block roots stored on the EL (Execution Layer) to control the growth of the blockchain’s state.\n\nThough implementing this change would require EL clients to perform additional disk writes, everyone in the discussion agreed that it was a necessary adjustment.\n\nThe team made plans to launch a new testnet called Holesky, which will serve as an alternative platform for implementing changes to the beacon chain. The main goal of Holesky is to run a larger number of validators compared to the mainnet. This will enable them to perform stress tests and evaluate any modifications related to the Beacon chain.\n\nState of ETH\n\nThese developments could have a positive impact on the price of ETH in the future. At press time, ETH was trading at $1,845.16 according to CoinMarketCap.\n\nRealistic or not, here’s ETH market cap in BTC’s terms\n\nIts price grew over the last few days, along with its velocity. This indicated that the number of ETH transfers were increasing. However, the MVRV ratio for ETH grew in tandem with its price. The growing MVRV ratio implied that ETH was slightly in the overbought zone at the time of writing."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vZmluYm9sZC5jb20vaXMtaXQtdG9vLWxhdGUtdG8tYnV5LWV0aGVyZXVtLWV0aC1wcmljZS1wcmVkaWN0aW9uLWZvbGxvd2luZy1zZWMtY3JhY2tkb3duL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Is It Too Late to Buy Ethereum? ETH Price Prediction Following SEC Crackdown - Finbold - Finance in Bold",
        "content": "DISCLAIMER: This article is a SPONSORED Press Release and does not constitute Finbold's editorial content nor undergo monitoring. Crypto assets/products involve significant risks. Do not invest unless you are prepared to lose your entire investment. For a full disclaimer, please click here.\n\nEthereum, the world’s second-largest cryptocurrency by market cap, is up 54% over the first six months of the year. However, the price of ETH has stagnated in recent weeks, leading many traders to wonder whether it’s too late to buy Ethereum.\n\nWe’ll take a closer look at Ethereum’s price potential for the remainder of 2023 and highlight two emerging coins that traders are buzzing about this week.\n\nEthereum started off 2023 hot, gaining more than 30% in the first two weeks of the year. While the speed of its ascent slowed down, the token has been extremely successful over the past several months.\n\nThat’s thanks in part to a major catalyst for Ethereum: the blockchain’s transition to proof-of-stake in September and its successful Shanghai upgrade, which unlocked staked ETH, in April.\n\nThese two upgrades not only demonstrated the ability of Ethereum to make huge, impactful changes to its network. They also had practical impacts for investors, turning Ethereum into a yield-generating blockchain with liquid staking potential.\n\nEthereum hit a 2023 high of $2,140 immediately after the Shanghai upgrade, but the price response to this massive news was surprisingly muted. Many traders speculated that the upgrade was already priced in—and the typical crypto response to ‘sell the news’ likely played a role.\n\nSince April, the ETH price has been stagnant. For the most part, the token has traded sideways between $1,750 and $1,950.\n\nThe good news for Ethereum investors is that this sideways price action likely represents consolidation after the token’s run-up in the first half of the year. Trading volume remains high and Ethereum’s fundamentals are solid following its staking implementation.\n\nThe real test for Ethereum will be whether it can break above resistance at $2,020 later this month or in July. ETH briefly broke this level in April, but failed to maintain a breakout.\n\nIt could take several more retests of the $2,020 resistance before ETH successfully breaks out. However, it appears inevitable from both technical and fundamental perspectives.\n\nWhen the breakout happens, Ethereum could rise quickly to $2,650—the token’s next area of technical resistance. That represents a 43% gain from today’s price.\n\nCrypto Market Resilient in Face of SEC Lawsuits\n\nEthereum is arguably one of the strongest coins in the crypto market right now thanks to its successful upgrades and its centrality to the crypto ecosystem. In contrast, Bitcoin has been trending sideways and down, with some analysts predicting a breakdown to the $20,000 price level.\n\nStill, crypto bulls have reason to be excited right now. In the face of major lawsuits by the US Securities and Exchange Commission (SEC) against Binance and Coinbase, the crypto market hardly blinked. Bitcoin dropped 5%, then regained that amount and more within 48 hours.\n\nThis resilience suggests that crypto investors aren’t plagued by the same fear that haunted the market in 2022. Traders and investors are far more bullish and are willing to be aggressive in looking for the next big opportunity.\n\nFor many traders, the biggest opportunities aren’t in crypto majors like ETH or BTC. Instead, they think potentially huge profits can be found in emerging tokens like Wall Street Memes ($WSM) and yPredict ($YPRED).\n\nWall Street Memes Raises $5.5 Million to Mock Wall Street, Best Meme Coin for 2023\n\nWall Street Memes is a new meme coin that’s generated a lot of excitement among traders and investors. Just two weeks after launching its presale, the project has already raised $5.5 million.\n\nWall Street Memes taps into an anti-Wall Street ethos that’s always been prominent within the crypto community, and is especially strong in the wake of the SEC’s campaign against the crypto industry. The project has many supporters from the r/WallStreetBets community, which has a combined 400,000 social media followers.\n\nThe team behind Wall Street Memes also has experience making a mockery of Wall Street. The same developers were behind the Wall Street Bulls NFT collection, which sold out in just over 30 minutes when it launched in 2021.\n\nThe Wall Street Memes presale is making 50% of the total $WSM supply available to the public. Anyone can join and the project is fully community-driven—the developers haven’t set aside any $WSM for themselves.\n\nDuring the current presale stage, investors can buy $WSM for $0.028, a 25% discount to the list price. Early investors can also join the Wall Street Memes airdrop, which is giving away $10,000 worth of $WSM to each of five lucky investors.\n\nVisit Wall Street Memes Presale\n\nTop AI Coin yPredict Raises $2.2 Million for AI-powered Predictive Models\n\nyPredict is another emerging project that has crypto traders buzzing. It’s raised more than $2,2 million for its $YPRED token and has more than 20,000 on its waitlist ahead of its launch.\n\nyPredict is leveraging AI to build predictive models that can forecast the price of any crypto asset. With yPredict models, for example, traders can quickly see whether Ethereum will go up or down and by how much.\n\nThe project is releasing its AI price modeling tools to the community, enabling quants and developers to build their own custom models. Then traders and analysts can subscribe to their favorite models in the yPredict marketplace.\n\nThis approach is good for everyone. Quants and developers can earn passive income by selling subscriptions to their models. Traders and analysts can combine multiple models and take different approaches to analyzing cryptos. All transactions in the marketplace will require yPredict’s native token, $YPRED.\n\nIn addition, yPredict’s treasury gets a cut of each new subscription. Users who stake $YPRED token receive a 10% share of every new subscription on the platform.\n\n$YPRED is on sale now for $0.09, a 25% discount to the $0.12 list price. Traders and investors have to hurry since the next price increase is only a few days away.\n\nVisit yPredict Presale"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vaGFja2Vybm9vbi5jb20vaG93LWhlZGVyYXMtdW5pcXVlLWZlYXR1cmVzLWFuZC1oYmFyLWFyZS1hdHRyYWN0aW5nLWNyZWF0b3JzLWFuZC1hbmQtY2hhbGxlbmdpbmctZXRoZXJldW1zLWxlYWRlcnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "How Hedera's Unique Features and HBAR Are Attracting Creators and Challenging Ethereum's Leaders - hackernoon.com",
        "content": "1,619 reads\n\nHow Hedera's Unique Features and HBAR Are Attracting Creators and Challenging Ethereum's Leaders\n\nEN"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3Mvdml0YWxpay1idXRlcmluLXNheXMtZXRoZXJldW0td2lsbC1mYWlsLXdpdGhvdXQtdGhyZWUtdml0YWwtY2hhbmdlc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Vitalik Buterin Says Ethereum Will Fail Without Three Vital Changes - Watcher Guru",
        "content": "In a recent blog post, the co-founder of the network Vitalik Buterin says that Ethereum will fail without three vital changes. Specifically, Buterin has introduced what he refers to as “The Three Transitions” in his recent post. Moreover, he spoke of their importance for blockchain’s continued development.\n\nButerin spoke on the future of the blockchain, and how Ethereum could expand its utilization. However, for that to take place, he has highlighted Layer-2 (LS) scaling, wallet security, and privacy, as important transitions for the network.\n\nSource: Redot.com\n\nButerin Brings Forth Three Transitions for Ethereum\n\nWithin the digital asset industry, there are few names as revered as Ethereum. A blockchain network that has become one of the most popular in the world has clearly established itself as an important piece of the industry’s future. However, its co-founder has recently expressed what could stand in the way of that future.\n\nIn a recent blog post, Vitalik Buterin says Ethereum will fail without three vital changes. Specifically referred to as the “Three Transitions, the post discusses the necessity for the growth of the platform. Moreover, Buterin says they are utterly important “as Ethereum transitions from a young experimental technology, into a mature tech stack,” seeking to grow.\n\nSource: CryptoPotato\n\nOf the three transitions, Buterin first mentions L2 scaling. Buterin writes that “Ethereum fails because each transaction costs $3.75,” with it only increasing in the event of a bull run. Moreover, he notes, “Every product aiming for the mass market inevitably forgets about the chain and adopts centralized workarounds for everything.”\n\nAdditionally, Buterin references wallet security. Specifically, stating that “Ethereum fails because users are uncomfortable storing their funds,” and will too often utilize centralized exchanges.\n\nFinally, Buterin discussed the privacy transition, discussing the necessity for its development. Buterin remarks that public availability for transitions “is far too high a privacy sacrifice for many users, and everyone moves onto centralized solutions that at least somewhat hide your data.”\n\n“These three transitions are crucial,” Buterin conclusively states. Adding that, although they are challenging, the network requires “deep changes from applications and wallets.” Ultimately, calling for the transitions mentioned to “radically reshape the relationship between users and addresses.”"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiJmh0dHBzOi8vbWlsa3JvYWQuY29tL2d1aWRlL2J0Yy12cy1ldGgv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Ethereum vs. Bitcoin 2024 - ETH vs. BTC Comparison - Milk Road",
        "content": "This article compares the cryptocurrencies ETH and BTC, looking at their differences, pros and cons, and if they constitute good investments.\n\nEthereum (ETH) Vs. Bitcoin (BTC)\n\nEthereum and Bitcoin are the two most widely-used cryptocurrencies globally. They’re programmed differently, e.g., Ethereum uses the proof-of-stake consensus mechanism, while Bitcoin uses proof-of-work. This article will help you understand the differences between them.\n\nETH Vs. BTC Chart\n\nETH BTC Creator Vitalik Buterin and Gavin Wood Satoshi Nakamoto Launch date July 30, 2015 January 3, 2009 Market capitalization $148 billion $317 billion Supply 122 million tokens 19 million tokens Hash Rate None (doesn’t rely on mining) 255MH/s Fees Varying gas fees Varying gas fees Privacy Pseudonymous Pseudonymous Consensus mechanism Proof-of-stake Proof-of-work Block time 10 to 19 seconds 10 minutes Future token issuance Maximum of 18 million new tokens every year Maximum supply of 21 million tokens All-time high $4,811.39 $67,598.09\n\nWhat Is Bitcoin? Bitcoin is a decentralized digital currency operating on a blockchain. The blockchain is a public ledger that records all transactions on the Bitcoin network. Anyone with a Bitcoin wallet address can send tokens to another address or receive tokens from another address. Bitcoin was conceptualized and created by Satoshi Nakamoto, a pseudonym for a person whose real identity remains unknown. The first block for Bitcoin was created in January 2009, and the first reported real-world financial transaction using Bitcoin took place in May 2010 when a Florida man paid 10,000 BTC for two boxes of pizzas. As of its first reported transaction, one Bitcoin was worth roughly a fourth of a cent. A few years after, millions of people began adopting the token, and demand shot up, driving the price of a single Bitcoin to an all-time high of over $67,000 in 2021. However, the 2022 crypto market crash has seen the price of Bitcoin slump to just over $16,000.\n\nPros And Cons Of Investing In Ethereum\n\nPros Supports global transactions with fast speeds\n\nSupports global transactions with fast speeds Zero network downtime over the past few years\n\nZero network downtime over the past few years Decentralized digital currency Cons Highly volatile\n\nHighly volatile Transaction fees can be high depending on network demand\n\nTransaction fees can be high depending on network demand No maximum supply, so there’s a high risk of inflation\n\nETH Vs. BTC: Similarities And Differences\n\nSimilarities Both tokens have high demand and a very liquid market.\n\nBoth are decentralized tokens operating on a public ledger (blockchain).\n\nBoth tokens have millions of users globally.\n\nBoth use alphanumeric strings as wallet addresses and are tradable on crypto exchanges. Differences ETH uses the proof-of-stake consensus mechanism, while BTC uses proof-of-work.\n\nBTC has a maximum supply, while ETH doesn’t.\n\nBTC relies on mining, while ETH doesn’t.\n\nThe Ethereum blockchain processes transactions significantly faster than the Bitcoin blockchain.\n\nETH Vs. BTC Price\n\nBTC has historically had a much higher market capitalization than Ethereum. Both cryptocurrencies peaked in 2021, a bubbly year for digital assets, but in 2022 have plunged from their all-time highs.\n\nBitcoin Vs. Ethereum Fees\n\nEvery Bitcoin transaction includes a gas fee paid to the miners on the network validating the transaction. Likewise, every Ethereum transaction includes gas fees paid to the network’s validators. These fees are separate from what exchanges and brokerages charge to facilitate transactions.\n\nETH BTC Gas Fee: The minimum number of tokens necessary to execute a transaction, and it varies based on network demand. You can offer additional tips so that validators will prioritize your transaction. Gas Fee: The amount paid to the blockchain to execute a transaction. It varies based on network demand.\n\nBitcoin Vs. Ethereum Privacy\n\nUsing a decentralized exchange, you can purchase Bitcoin or Ethereum without giving up your identity. In contrast, centralized exchanges have know-your-customer (KYC) requirements, so users must provide some form of identity. Yet, even when you use a decentralized exchange, both Ethereum and Bitcoin aren’t fully anonymous, as someone may be able to tie your wallet address to your real-world identity via a platform you transact with.\n\nWhat Is Proof Of Work (POW) Vs. Proof-Of-Stake (POS)? Proof of Work and Proof of Stake are the most popular mechanisms for validating transactions on a blockchain, but they work differently. Proof of Work Proof of Stake Relies on miners whose capacity depends on computational power Relies on stakers whose validating capacity depends on the amount of tokens they stake Miners receive block rewards Stakers receive transaction fees as rewards Requires expensive mining equipment and high energy usage Doesn’t require expensive equipment or high energy usage The proof-of-work mechanism uses a competitive validation method (solving complex mathematical puzzles) to confirm transactions and add new blocks to the blockchain, while proof of stake uses validators selected at random to confirm transactions and add new blocks. Bitcoin operates on the proof-of-work mechanism, while Ethereum operates on the proof-of-stake mechanism.\n\nBTC Vs. ETH Use Cases\n\nYou can use BTC and ETH for different types of transactions or as a store of value.\n\nTop BTC Use Cases\n\nStore of value : You can use BTC as an alternative currency to store your assets.\n\n: You can use BTC as an alternative currency to store your assets. Online Payment : Many online merchants now accept BTC for payment.\n\n: Many online merchants now accept BTC for payment. Trading : You can swap BTC for other types of cryptocurrencies on an exchange.\n\n: You can swap BTC for other types of cryptocurrencies on an exchange. Dapps: You can use BTC to transact on various decentralized apps, e.g., games and gambling apps.\n\nTop ETH Use Cases\n\nStore of value : You can also use ETH as a store of value and a hedge against inflation from your local currency, but a stablecoin better fits this purpose.\n\n: You can also use ETH as a store of value and a hedge against inflation from your local currency, but a stablecoin better fits this purpose. Staking : You can stake your ETH on the Ethereum blockchain to earn a percentage of transaction fees paid to the network.\n\n: You can stake your ETH on the Ethereum blockchain to earn a percentage of transaction fees paid to the network. NFTs : You can use ETH to buy non-fungible tokens (ETH) on various platforms.\n\n: You can use ETH to buy non-fungible tokens (ETH) on various platforms. Lending: You can lend your ETH to other users and earn interest via a lending protocol.\n\nETH Vs. BTC Long-Term: Which Is A Better Investment?\n\nETH and BTC can be good long-term investments that’ll yield profits. Yet, be sure to perform your own due diligence before investing in any cryptocurrency. This article isn’t investment advice.\n\nA Case For Investing In ETH\n\nETH is one of the most traded cryptocurrencies globally. Anyone getting into the crypto markets as a newbie has likely heard of ETH, so may be compelled to buy it. The Ethereum network offers very fast transaction processing speeds compared to many other cryptocurrencies. It’s volatile but not as volatile as most altcoins. The token’s recent shift from the proof-of-work mechanism to proof of stake has attracted more users and increased its demand.\n\nAs of late 2022, the crypto market is experiencing a widespread rout that has the value of many tokens to plunge, including ETH. If you believe the market is headed for recovery, it’ll be a smart decision to invest in ETH.\n\nPotential Risks\n\nThe token is vulnerable to massive price swings.\n\nTransaction fees can be very high when there’s significant demand on the network.\n\nMany smart contract platforms are emerging to compete with Ethereum, so its appeal might fade.\n\nCrypto wallets and exchanges where you hold ETH are vulnerable to hacking attacks.\n\nA Case For Investing In BTC\n\nBTC is the cryptocurrency with the highest market capitalization. The demand for BTC is enormous across the globe, so there’s always the chance of it increasing in value. Lately, institutional investors have set their sights on the cryptocurrency markets, and BTC is the asset most of them buy. BTC is already huge, yet there’s significant potential for growth in its demand, meaning it could be a good long-term investment.\n\nPotential Risks\n\nBTC is significantly volatile.\n\nBTC is vulnerable to a 51% attack — a group of miners controlling more than 50% of the network’s mining power can connive to disrupt it.\n\n— a group of miners controlling more than of the network’s mining power can connive to disrupt it. There’s no central authority to retrieve your BTC if you fall victim to hacking.\n\nGovernments may decide to ban or restrict the use of Bitcoin if it’s affecting their national currencies.\n\nRemember that investing comes with risks. Hence, it’s wise to only invest money that you can forfeit without losing much sleep. Always do your own research before investing, and remember that this article doesn’t constitute investment advice.\n\nBest Cryptocurrency Exchanges To Buy ETH\n\nCoinbase: Best For Ease Of Use\n\nBest For Ease Of Use Binance: Best For Low Fees\n\nBest For Low Fees Uniswap: Best For DeFi Users\n\n1. Coinbase: Best For Ease Of Use Why we picked it: Coinbase makes it easy for residents of the US and many other countries to sign up and trade cryptocurrencies. It’s also a publicly-traded company subject to regulations from the US Securities and Exchange Commission, so the chances of losing your funds due to misuse are lower. Buy ETH On Coinbase Read Our Coinbase Review\n\n2. Binance: Best For Low Fees Why we picked it: Binance lets you trade ETH or any other cryptocurrency for much lower fees than competing platforms. It charges a standard fee of 0.1% for crypto trades. Buy ETH on Binance Read Our Binance Review\n\n3. Uniswap: Best For DeFi Users Why we picked it: Uniswap is a decentralized exchange where you can trade assets directly with other users and keep full control of your private keys. There’s no central intermediary that can tamper with your ETH tokens when you use Uniswap. Buy ETH on Uniswap Read Our Uniswap Review\n\nBest Cryptocurrency Exchanges To Buy BTC\n\nCrypto.com: Best for mobile app\n\nBest for mobile app Kraken: Best for ease of use\n\nBest for ease of use Binance: Best for low fees\n\n1. Crypto.com: Best For Mobile App Why we picked it: Crypto.com offers an intuitive mobile app that enables users to trade BTC with ease. Buy BTC on Crypto.com Read Our Crypto.com Review\n\n2. Kraken: Best For Ease Of Use Why we picked it: Kraken offers an intuitive interface that’s suitable for both newbies and advanced traders. Buy BTC on Kraken Read Our Kraken Review\n\n3. Binance: Best For Low Fees Why we picked it: Binance lets users trade cryptocurrencies for relatively low fees of 0.1% per trade. Buy BTC on Binance Read Our Binance Review\n\nTo Sum It Up\n\nBTC and ETH are two of the most popular cryptocurrencies worldwide. They have core differences and similarities, which we’ve outlined for you. We’ve also mentioned the advantages and disadvantages of each token over the other. Both digital assets can be good long-term investments if the crypto market recovers from the 2022 crash, and you can easily buy them using a crypto exchange.\n\nFrequently Asked Questions\n\nWhat Is The Main Difference In Application Between Ethereum And Bitcoin? BTC is primarily used as a store of value, while ETH is mainly used to transact with applications built on the Ethereum blockchain. What Are Some Of The Similarities Between Bitcoin And Ethereum? They are both decentralized tokens operating on a transparent public ledger. Which Is Better: ETH Or BTC? There’s no objectively “better” token; they each have their pros and cons. For example, ETH offers much faster transaction speeds, while BTC offers better privacy. What’s The Difference Between Ethereum And Bitcoin? Ethereum operates on the proof-of-stake consensus mechanism, while BTC operates on the proof-of-work mechanism. ETH Vs. BTC Mining: What’s The Difference? Bitcoin relies on mining, i.e., using computers to solve complex mathematical equations, but Ethereum no longer relies on mining following The Merge in September 2022.\n\nContributor Chisom Maduonuorah Chisom Maduonuorah is a writer passionate about tech startups, venture capital, the global stock markets, and emerging financial markets like cryptocurrency. When not writing, you can find him staring into the sky pondering what life is about. Read More"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLWNvLWZvdW5kZXItbmFtZXMtdGhyZWUta2V5LXRyYW5zaXRpb25zLXRvLXdhdGNoLWFzLW5ldHdvcmstZ3Jvd3Mv0gFjaHR0cHM6Ly9jb2luZ2FwZS5jb20vZXRoZXJldW0tY28tZm91bmRlci1uYW1lcy10aHJlZS1rZXktdHJhbnNpdGlvbnMtdG8td2F0Y2gtYXMtbmV0d29yay1ncm93cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 10 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Co-Founder Names Three Key Transitions to Watch as Network Grows - CoinGape",
        "content": "As the Ethereum network continues to grow and evolve, its co-founder has identified three key transitions that are set to shape its future trajectory.\n\nVitalik Buterin, the visionary mind behind the world’s second-largest crypto, recently outlined these transitions in a blog post, highlighting their significance in enhancing scalability, security, and privacy within the Ethereum ecosystem.\n\nadvertisement\n\nOne of the most pressing challenges for Ethereum has been its scalability. As the network gained popularity, the increased demand for transactions caused congestion and high fees, hindering its usability. To address this issue, Buterin points to the transition to Layer 2 scaling solutions as the first transition, specifically rollups.\n\nThe second transition pointed by Buterin is the wallet security transition, specifically smart contract wallets.\n\nBy adopting smart contract wallets, users can have greater confidence in the security of their assets. Without the second transition, Buterin highlighted that Ethereum fails because users are hesitant to save their funds (and non-financial assets), and everyone migrates to centralized exchanges. Buterin believes that social recovery wallets are important for greater security and user experience.\n\nAdditionally, the Ethereum co-founder also stressed the significance of privacy as the third transition. Buterin acknowledges the need for privacy-preserving features within the Ethereum network, specifically focusing on funds transfers and the development of related tools such as social recovery, identity, and reputation systems.\n\nTo enable privacy features for Ethereum users, Buterin suggested implementing stealth address methods.\n\nChallenges Involved with the Transitions\n\nAchieving scalability, security, and privacy improvements on Ethereum requires more than just protocol upgrades, according to Buterin.\n\nAs with any new project, Buterin highlighted some challenges that may be involved in these transitions. He highlighted that the successful implementation of these transitions requires coordination among various stakeholders in the Ethereum community, including developers, miners, users, and application builders.\n\nAccording to the Ethereum co-founder, Transitioning to these new solutions necessitates educating and encouraging users to adopt the changes. This is because users need to understand the importance of these transitions and feel confident in adopting them.\n\nBy recognizing the importance of coordination, facilitating changes in application design, and prioritizing user education and adoption, the Ethereum community can navigate these challenges and ensure the successful resolution of these transitions."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtZm91bmRlci12aXRhbGlrLWJ1dGVyaW4taW5kaWNhdGVzLXRoaXJkLXBpbGxhci1vZi1ldGhlcmV1bS1ldGgtYWZ0ZXItcm9sbHVwcy1hbmQtYWHSAXRodHRwczovL3UudG9kYXkvZXRoZXJldW0tZXRoLWZvdW5kZXItdml0YWxpay1idXRlcmluLWluZGljYXRlcy10aGlyZC1waWxsYXItb2YtZXRoZXJldW0tZXRoLWFmdGVyLXJvbGx1cHMtYW5kLWFhP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Founder Vitalik Buterin Indicates Third Pillar of Ethereum (ETH) After Rollups and AA - U.Today",
        "content": "Advertisement\n\nThe evolution of Ethereum (ETH) from experimental niche technology into a mainstream tech stack includes three roadmaps. Should the network fail at one of them, it would be difficult for it to achieve massive adoption in competition with centralized competitors. Vitalik Buterin described these \"building blocks\" of a mature Ethereum (ETH).\n\nScaling transition, security transition, privacy transition: Vitalik Buterin on Ethereum (ETH) maturing\n\nIn order to continue its evolution into a mature tech stack that is able to bring an \"open, global and permissionless experience\" to a new generation of users, Ethereum (ETH) needs to undergo three transitions. The second largest blockchain needs to focus on scalability, security and privacy; the three milestones should be accomplished almost simultaneously, Buterin claimed in his recent article.\n\nIn terms of L2-centric scaling, rollups are the best solution: every dApp should move its operations to a rollup-based network. The wallet security transition will be achieved through \"smart conract wallets\" enabled by the Account Abstraction concept.\n\nAs covered by U.Today previously, Account Abstraction, or EIP 4337, is a recent update of the Ethereum (ETH) protocol design. It blurs the line between on-chain wallets and smart contracts: every wallet can now become a \"decentralized bank.\"\n\nMeanwhile, the privacy transition is of paramount importance: privacy should be available for all operations - both existing and potential - on Ethereum (ETH) blockchain, Vitalik stresses:\n\n...making sure privacy-preserving funds transfers are available, and making sure all of the other gadgets that are being developed (social recovery, identity, reputation) are privacy-preserving.\n\nVitalik highlighted that we should not view these changes as simple EIPs or even hardforks as they are far more sophisticated. To achieve the mentioned goals, in some aspects, Ethereum's (ETH) design needs to change \"pretty fundamentally.\"\n\n\"You only can choose three out of three\"\n\nAt the same time, all three goals should be addressed simultaneously: we cannot focus on one or two of them. Without a scaling transition, Ethereum (ETH) fees will be too high, and products will be seeking centralized alternatives to moving money on-chain.\n\nWithout advanced wallet security, it would be uncomfortable for users to store Ethers and Ethereum-based tokens in noncustodial wallets so that they would yet again need centralized custody.\n\nRegarding the third roadmap, the situation looks the same for Vitalik: future users of Ethereum (ETH) will not be happy about having all of their activities exposed to third parties with no obfuscation.\n\nAs covered by U.Today previously, Bitcoiners (BTC) accused Ethereum (ETH) developers of \"lying\" about the scaling potential of their L1 blockchain."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS13aGFsZXMtc2hpZnQtbGFyZ2UtY2h1bmtzLW91dC1vZi1leGNoYW5nZXMtYXMv0gFRaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2V0aGVyZXVtLXdoYWxlcy1zaGlmdC1sYXJnZS1jaHVua3Mtb3V0LW9mLWV4Y2hhbmdlcy1hcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 10 Jun 2023 07:00:00 GMT",
        "title": "Ethereum whales shift large chunks out of exchanges as… - AMBCrypto News",
        "content": "The ETH supply on exchanges dropped to its record low at the time of publication.\n\nSupply held by top non-exchange addresses has shot up.\n\nEthereum [ETH] whales have increased their appetite despite the prevailing uncertainty in the market. One of these whale wallets, withdrew nearly 39,300 ETH in a series of transactions over the last month from world’s largest crypto trading platform Binance.\n\nIs your portfolio green? Check out the Ethereum Profit Calculator\n\nHighlighted by on-chain analytics firm Lookonchain through a tweet dated 9 June, the address which was created more than a month ago, accumulated ETH worth more than $70 million according to press time market price. Interestingly, each of these withdrawals came after a price drop.\n\nA whale has withdrawn 15.2K $ETH ($28M) from #Binance in the past 3 hours. The wallet was created 32 days ago and has withdrawn a total of 39.3K $ETH ($72M) from #Binance, each seemingly withdrawn after a price drop. Is this whale accumulating $ETH for the future bull market? pic.twitter.com/0pjukPI4JL — Lookonchain (@lookonchain) June 9, 2023\n\nBull run anticipation or…?\n\nRecently, the American affiliate of Binance, Binance.US announced that it will suspend USD trading on the platform from 13 June and asked customers to withdraw their assets before the mentioned date. On the expected lines, there was a large flight of crypto assets out of the exchange.\n\nHowever, it was not Bitcoin [BTC] but rather ETH that formed the majority of the withdrawn assets, as per latest data from research firm Nansen.\n\nHistorically, a large wave of withdrawals is seen as reduced sell-off risks and investors’ anticipation of a bullish surge. But in the current scenario, the accumulation could be a result of eroding confidence in centralized entities. Investors could be shifting funds to a safer place.\n\nMeanwhile, data from Santiment showed that the percentage of ETH supply on exchanges dropped to its record low of 9.45% at the time of publication. Simultaneously, the supply held by top non-exchange addresses has shot up over the past month or so, indicating that whales were snapping up ETH in droves.\n\nInvestors still bullish on ETH\n\nThe FUD triggered by U.S. regulators since the start of the week have engulfed ETH as well. The largest altcoin by market cap exchanged hands at $1,750.39 at press time, plunging to its lowest level since end-march, as per CoinMarketCap.\n\nDespite the negative price action, most traders in the futures market continued to bet on ETH’s price rise. As per Coinglass, the funding rate for ETH was positive, reflecting the dominance of bullish long positions.\n\nRead Ethereum’s [ETH] Price Prediction 2023-24\n\nRecently, co-founder Vitalik Buterin outlined three crucial growth areas – L2 scaling solution, the wallet, and privacy transitions, which Ethereum needed to pass through to gain “full maturity”."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiJGh0dHBzOi8vbWlsa3JvYWQuY29tL3N0YWtpbmcvbGlxdWlkL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Best Liquid Staking Platforms For Crypto March 2024 - Milk Road",
        "content": "Key Takeaways Liquid staking is an efficient and flexible way to stake your crypto\n\nThere are many platforms that provide liquid staking, all with different yields, fees, and supported tokens\n\nIt’s important to do your research before picking a liquid staking platform\n\nIn this article, we cover the top liquid staking platforms. Liquid staking has become all the rage in the last few years as more blockchains move to proof-of-stake (PoS) mechanisms.\n\nSince liquid staking tokens are platform-specific, it’s important to pick the correct platform so that your staked crypto is not at risk and you’re maximizing your rewards.\n\nTop Liquid Staking Platforms\n\nPlatform Supported Chains APYs Supported Tokens Liquid Staking Tokens Fees Lido Ethereum\n\nPolygon\n\nSolana 4.4%\n\n6.3%\n\n6.7% ETH\n\nMATIC\n\nSOL stETH\n\nstMATIC\n\nstSOL 10% Stader Labs Ethereum\n\nPolygon\n\nBinance\n\nHedara\n\nFantom\n\nNear\n\nTerra 2.0 5.7%\n\n4.74%\n\n3.52%\n\n7.65%\n\n4.7%\n\n8.75%\n\n15.84% ETH\n\nMATIC\n\nBNB\n\nHBAR\n\nFTM\n\nNEAR\n\nLUNA ETHx\n\nMATICx\n\nBNBx\n\nHBARx\n\nFTMx\n\nNEARx\n\nLUNAx 10% Rocket Pool Ethereum 3.93% ETH rETH 5% – 20% ANKR Ethereum\n\nPolygon\n\nBinance\n\nFantom\n\nAvalanche\n\nPolkadot 3.55%\n\n3.73%\n\n2.55%\n\n1.98%\n\n7.26%\n\n13.44% ETH\n\nMATIC\n\nBNB\n\nFTM\n\nAVAX\n\nDOT ankrETH\n\nankrMATIC\n\nankrBNB\n\nankrFTM\n\nankrAVAX\n\naDTOb 2% – 10% Marinade Finance Solana 6.79% SOL mSOL 6% Coinbase Prime Ethereum N/A ETH lsETH 15%\n\nLido Best for Beginners Open an Account On Lido’s site Review 4.8 Tokens Available SOL, ETH, MATIC SOL, ETH, MATIC Rewards 4.4% – 6.7% APY 4.4% – 6.7% APY Liquid Staking Yes. stETH, stMATIC, stSOL Yes. stETH, stMATIC, stSOL Supported Blockchains Ethereum, Polygon, Solana Ethereum, Polygon, Solana Fees 10% 10% Min. Staking Amount None None Lock In Period One year One year Payout Frequency Daily Daily Overview Lido is by far the most popular staking platform. The platform is responsible for over $10 billion in total value locked (TVL) across its Ethereum, Polygon, and Solana liquid staking tokens. Pros & Cons Pros Staking returns that are very close to what you would get running your own node\n\nTokens such as stETH and stSOL are well-adopted and can be used as collateral for lending or in other DeFi applications Cons A large portion of all the staked ETH comes from Lido stETH, which makes validators very concentrated and contrary to the decentralized vision of Ethereum\n\nYou can sometimes get larger APYs using other staking services Features Largest liquid staking platform\n\nThree supported chains: Ethereum, Polygon, Solana\n\nLido charges a 10% flat fee on all staked tokens Why We Like It Since liquid staking tokens are specific to the platforms that generate them (for example, staked ETH through Lido is stETH, while staked ETH through Rocket Pool is rETH), it’s important to pick a platform with a strong future. Lido has been around for a while and is well-positioned to succeed in the future, so we like it because it seems like a good bet when it comes to liquid staking.\n\nStader Best For Multi-Asset Staking Open an Account On Stader’s site Review 4.3 Tokens Available ETH, MATIC, HBAR, BNB, NEAR, FTM, LUNA ETH, MATIC, HBAR, BNB, NEAR, FTM, LUNA Rewards 3.5% to 15+% 3.5% to 15+% Liquid Staking Yes Yes Supported Blockchains Ethereum, Polygon, BNB, Fantom, Terra, & More Ethereum, Polygon, BNB, Fantom, Terra, & More Fees 10% 10% Min. Staking Amount None None Payout Frequency Varies by asset Varies by asset Availability Worldwide Worldwide Pros & Cons Pros Committed to decentralized staking\n\nMATIC staking on Polygon\n\n40+ Protocol integrations to enhance yields Cons Limited liquidity for Stader liquid tokens\n\nPrimary liquidity pools pair liquid tokens with Stader SD token Features Support for MATIC staking on Polygon: Staking MATIC must be done on the Ethereum network, which can be costly. Stader Labs introduces the ability to stake MATIC on the Polygon network, opening a yield opportunity for smaller positions.\n\nDeFi integrations: Put your staked assets to work in other DeFi protocols to boost your yield. Options vary by chain and include liquidy pools, lending platforms, and yield optimizers.\n\nNewbie-friendly UI: If you know the basics of working with a DeFi wallet like MetaMask, Stader makes it a breeze to stake assets like MATIC and ETH with a liquid token. Why We Like It DeFi can be intimidating if you’re new to the space, but Stader’s user interface and flow for basic liquid staking help both newcomers and seasoned pros put their crypto to work in a jiffy. Smart contract audits from Halborn and Certik help ensure the code is solid, reducing the risk of exploits.\n\nRocket Pool Best for Communities Open an Account On Rocket Pool’s site Review 4.6 Tokens Available ETH ETH Rewards 3.93% 3.93% Liquid Staking Yes. rETH Yes. rETH Supported Blockchains Ethereum Ethereum Fees 5% – 20% 5% – 20% Availability Worldwide Worldwide Overview Rocket Pool is a large liquid staking protocol that’s best known for its community-forward approach. The protocol is entirely community owned and has a large presence on platforms like Reddit. One of Rocket Pool’s standout features is that it allows you to stake as little as 0.01 ETH to start earning rewards or stake just 16 ETH to run your own validator node. Pros & Cons Pros One of the most popular liquid staking platforms\n\nCan be used by individuals and businesses to set up staking pools with custom fees and rules\n\nWhen staking, users get the “RPL” token as a reward, which is the governance token of the Rocket Pool DAO Cons While other platforms allow immediate un-staking, Rocket Pool requires lock-ins for between 3 and 12 months for validators\n\nFees can be as high as 20% on rewards from certain staking pools Features Run by the community through a decentralized autonomous organization (DAO)\n\nYou can run an Ethereum node by staking just 16 ETH (it normally costs 32 ETH)\n\nThe protocol does not charge a flat commission fee on rewards, instead, you can pick from fees between 5% and 20% depending on how you decide to stake Why We Like It When it comes to community-owned and managed liquid staking platforms, Rocket Pool is definitely at the top. While many other liquid staking providers are opaque private companies, Rocket Pool is governed by a DAO where users can vote on proposals and decide the future of the protocol together.\n\nANKR Best for Multi-Chain Staking Open an Account On ANKR’s site Review 4.5 Tokens Available ETH, MATIC, BNB +More ETH, MATIC, BNB +More Rewards 3.55%-13.44% 3.55%-13.44% Liquid Staking ankrETH, ankrMATIC, ankrBNB +More ankrETH, ankrMATIC, ankrBNB +More Supported Blockchains Ethereum, Polygon, Binance +More Ethereum, Polygon, Binance +More Fees 3.55%-13.44% 3.55%-13.44% Availability Worldwide Worldwide Overview ANKR provides liquid staking for a wide range of popular crypto assets, including Ethereum, Binance, Polygon, and several more. The protocol also provides infrastructure solutions for companies looking to run their own blockchains. Pros & Cons Pros Liquid staking for a wide range of popular cryptocurrencies\n\nPartnered with lots of blockchains, including Polygon, Solana, Binance, and more, to offer natively integrated services that are faster and cheaper Cons Liquid staking is not ANKR’s main offering, so it can sometimes be deprioritized in favor of other services\n\nNot as popular as Lido or Rocket Pool Features Offers delegated staking, bridge services, and self-hosted blockchains for more advanced users\n\nProvides services on multiple chains, not just Ethereum\n\nUses a reputation-based system to ensure all node validators are trustworthy and staked funds are protected Why We Like It ANKR has built a reputation as one of the most reliable blockchain services. Its liquid staking features several different chains and fees that are competitive, all backed up by the reputation of the ANKR brand.\n\nMarinade Finance Best for Solana Staking Open an Account On Marinade Finance’s site Tokens Available SOL SOL Rewards 6.79% 6.79% Liquid Staking Yes. mSOL Yes. mSOL Supported Blockchains Solana Solana Fees 6% 6% Availability Worldwide Worldwide Overview Marinade Finance is the top liquid staking platform on the Solana blockchain. While it only supports staking for the SOL token, Marinade has a “total value locked” (TVL) of over $130 million. Pros & Cons Pros Staking rewards for SOL are more than 6%, and fees are only around 6% of earned rewards\n\nMarinade is governed by a DAO, so it is decentralized and community-owned\n\nYou can use your mSOL to earn upwards of 20% APY by staking it on the Marinade website Cons As a Solana-specific product, Marinade only supports staking SOL\n\nMarinade is a newer liquid staking protocol that has not been stress-tested as much as some others Features Stake SOL and receive the liquid mSOL token\n\nThe mSOL token represents both your underlying SOL balance and the APY rewards\n\nUnstake at any time Why We Like It Marinade is a great option for anyone looking to stake their SOL. The platform provides an easy-to-use staking interface as well as instant unstaking for low fees.\n\nCoinbase Best For Beginners Open an Account On Coinbase’s site Review 4.6 Coinbase Review Tokens Available ETH, SOL, ADA, XTZ + more ETH, SOL, ADA, XTZ + more Rewards 2% to 6.12% 2% to 6.12% Liquid Staking Yes. lsETH Yes. lsETH Supported Blockchains Ethereum, Cardano, Solana + More Ethereum, Cardano, Solana + More Min. Staking Amount $0 – $1 $0 – $1 Lock In Period None None Payout Frequency Daily to Quarterly Daily to Quarterly Availability Worldwide Worldwide Overview Coinbase is one of the most popular exchanges for staking and much more. Coinbase is the first stop for many first-time crypto buyers and gives users room to grow with an exchange, a wallet, a rewards card, an NFT marketplace, and more. Pros & Cons Pros Easy to use, start earning in seconds\n\nEarning displayed immediately upon login\n\nStart staking with as little as $1 Cons Limited selection of cryptos for staking\n\nLower APYs compared to other exchanges Why We Like Coinbase For Staking In a nutshell, it’s easy. Coinbase offers fewer staking options (just six) compared to many other exchanges. But if you’re a Coinbase user already, you’ll appreciate the way Coinbase displays your earnings in your account dashboard, never leaving you guessing. Staking on Coinbase is as easy as you’d expect, taking just a few newbie-friendly clicks. Options include top cryptos like Ethereum, Cardano, and Solana.\n\nWhat is Liquid Staking?\n\nLiquid staking is a special type of staking. Rather than simply locking up your crypto to earn rewards, you can actually receive a liquid token in return for staking that you can then use in place of your original crypto.\n\nFor example, in traditional staking, you lock up your SOL (Solana) for some period of time in order to earn some annual percentage yield (APY). During this time, your SOL cannot be used for anything else — if you unstake or move your SOL, you will stop earning interest.\n\nLiquid staking fixes this by issuing you a liquid token any time you stake. When you stake your SOL, for example, you will receive a “liquid” token such as mSOL in return that you can trade and sell just as if you had your original SOL. This allows you to earn even more in rewards using your mSOL by lending it out or using it across DeFi (decentralized finance).\n\nLiquid Staking vs. Staking\n\nWe’ve already covered the basic differences between liquid staking and traditional staking — namely, liquid staking gives you a new “liquid” token that you do not receive with traditional staking.\n\nWhile traditional staking is supported natively by many blockchains, such as Ethereum and Solana, third-party platforms must be used to facilitate liquid staking. Services such as Lido, Rocket Pool, and others make liquid staking possible by issuing their own liquid tokens in exchange for your staked cryptocurrencies (such as ETH and SOL).\n\nThis means that while normal staking only exposes you to the blockchain itself, liquid staking also exposes you to a third-party platform. If Lido or Rocket Pool were to get hacked or go bankrupt, your liquid staking tokens would also go down with them, so it’s important to be mindful when choosing between these platforms.\n\nWant a full rundown of crypto staking? Check out our full guide.\n\nHelpful Definitions\n\nExplaining liquid staking involves lots of jargon. Check out the dropdown below for some helpful definitions before reading on.\n\nStaking Definitions\n\nLiquid Staking Derivative Token: When you stake a cryptocurrency, such as ETH or SOL, through liquid staking, you will receive a “liquid” token in return. This token will usually have a prefix, such as “stETH” or “mSOL.” It usually represents your underlying staked crypto plus the accrued interest from staking.\n\nWhen you stake a cryptocurrency, such as ETH or SOL, through liquid staking, you will receive a “liquid” token in return. This token will usually have a prefix, such as “stETH” or “mSOL.” It usually represents your underlying staked crypto plus the accrued interest from staking. Validators: In proof-of-stake (PoS) blockchains such as Ethereum and Solana, validators are the trusted parties used to run the blockchain. By staking a certain amount of tokens (such as 32 ETH), validators receive data from the blockchain and verify that all transactions are correct.\n\nIn proof-of-stake (PoS) blockchains such as Ethereum and Solana, validators are the trusted parties used to run the blockchain. By staking a certain amount of tokens (such as 32 ETH), validators receive data from the blockchain and verify that all transactions are correct. APY: In return for staking the crypto necessary to run the blockchains (like the 32 ETH), validators will be awarded an “annual percentage yield” (APY). This is a reward that they get on top of their staked ETH for their service of helping to validate the blockchain.\n\nIn return for staking the crypto necessary to run the blockchains (like the 32 ETH), validators will be awarded an “annual percentage yield” (APY). This is a reward that they get on top of their staked ETH for their service of helping to validate the blockchain. Commissions/Fees: Many liquid staking platforms will take a commission or a fee out of the APY paid out to stakers. If a blockchain pays 6% APY to stakers, for example, your liquid staking platform may take 10% of that APY as a fee for providing you with a liquid token.\n\nLiquid Staking Benefits\n\nLiquid staking has many benefits, which make it a preferred option for investors looking to get the most out of their crypto.\n\nLiquidity : As the name implies, liquid staking gives you a liquid token in return for your staked crypto. This allows you to earn an even higher yield on your staked crypto by lending out your liquid token or leveraging it across DeFi.\n\n: As the name implies, liquid staking gives you a liquid token in return for your staked crypto. This allows you to earn an even higher yield on your staked crypto by lending out your liquid token or leveraging it across DeFi. Better Blockchain Security: The staking mechanism lies at the core of proof-of-stake blockchains. These blockchains need stakers in order to remain secure, so whenever you liquid stake your crypto, you are helping to run the blockchain.\n\nThe staking mechanism lies at the core of proof-of-stake blockchains. These blockchains need stakers in order to remain secure, so whenever you liquid stake your crypto, you are helping to run the blockchain. Risk Management: Your liquid staking tokens can be used as collateral to take out DeFi loans or to provide you additional yield in interest-bearing accounts. You can put these loans to work for personal use, or you can re-invest the funds.\n\nLiquid Staking Risks\n\nAs with anything in crypto, there’s no such thing as a free lunch. Liquid staking comes with its own risks:\n\nPlatform Risk: Your liquid staking tokens will be platform-specific. stETH, for example, is a liquid staking token for ETH that’s specific to the Lido platform. This means that any time you are holding stETH, you are exposed to how Lido performs as a company. If it were to get hacked or go bankrupt, the value of your stETH tokens might be affected.\n\nYour liquid staking tokens will be platform-specific. stETH, for example, is a liquid staking token for ETH that’s specific to the Lido platform. This means that any time you are holding stETH, you are exposed to how Lido performs as a company. If it were to get hacked or go bankrupt, the value of your stETH tokens might be affected. Limited Support: Liquid staking tokens are generally not as well supported by exchanges as other major cryptocurrencies. For example, you can trade ETH pretty much anywhere and use it for any DeFi application. stETH, meanwhile, is less well-supported, so your options may be more limited.\n\nLiquid staking tokens are generally not as well supported by exchanges as other major cryptocurrencies. For example, you can trade ETH pretty much anywhere and use it for any DeFi application. stETH, meanwhile, is less well-supported, so your options may be more limited. Taxes: In the US, trading your staked crypto for a liquid staking derivative represents a taxable event. This is because the trade is a “swap,” which is considered a sale that has to have capital gains or losses calculated.\n\nWho Should Liquid Stake?\n\nPeople Who Are Intermediate Users: Liquid staking is an advanced concept in crypto that can prove difficult to navigate. While savvy beginners may be able to participate in liquid staking, they should do so at their own risk and be aware of some of the risks they are taking.\n\nLiquid staking is an advanced concept in crypto that can prove difficult to navigate. While savvy beginners may be able to participate in liquid staking, they should do so at their own risk and be aware of some of the risks they are taking. People Who Need Liquidity: The largest benefit of liquid staking is that it provides liquidity. If you want to earn a yield on your crypto but you also need to use it as collateral, or you want to lend it to earn even more, getting another token through liquid staking may be a good option.\n\nThe largest benefit of liquid staking is that it provides liquidity. If you want to earn a yield on your crypto but you also need to use it as collateral, or you want to lend it to earn even more, getting another token through liquid staking may be a good option. People Who Are Long-Term Holders: Liquid staking, like normal staking, is most profitable over a long timeframe. If you pair liquid staking with lending or liquidity providing, you can earn even more on your crypto over the long term.\n\nWho Shouldn’t?\n\nPeople Who Are Just Starting Out: As we’ve mentioned before, liquid staking is an advanced concept that can take a while to understand and use effectively. If you’re a beginner looking to earn some extra yield on your crypto, a simpler option, such as lending or providing liquidity, may be a better bet.\n\nAs we’ve mentioned before, liquid staking is an advanced concept that can take a while to understand and use effectively. If you’re a beginner looking to earn some extra yield on your crypto, a simpler option, such as lending or providing liquidity, may be a better bet. People Who Want Simple Taxes: When you swap your crypto for liquid staked assets, you are incurring a taxable event. At the end of the year, you will have to go back and pay taxes on all of the capital gains you incurred every time you swapped a crypto for its liquid-staked version.\n\nWhen you swap your crypto for liquid staked assets, you are incurring a taxable event. At the end of the year, you will have to go back and pay taxes on all of the capital gains you incurred every time you swapped a crypto for its liquid-staked version. People Who Can’t Afford To Lose Any Crypto: Liquid staking is risky — you may make a mistake during the many steps required to stake and unstake your crypto, or your liquid staking platform may experience a hack or become insolvent. It’s best done with crypto you can afford to lose and that you plan on holding for a long time.\n\nTo Sum It Up\n\nIn summary, liquid staking is an intermediate strategy used by savvy traders to earn yield on their crypto while also retaining a liquid asset. While it can be very profitable, it’s important to note that liquid staking is risky and should be undertaken only after you do proper research.\n\nRemember to never stake money that you can’t afford to lose.\n\nFrequently Asked Questions\n\nWhy Is Liquid Staking Different Than Other Types Of Staking? Liquid staking is different from traditional staking because it provides you with a “liquid” token while your crypto is staked. You can use this liquid token to lend, provide liquidity, and much more across DeFi to boost your yield even more. What Liquid Staking Protocol Is Best? It’s difficult to determine which staking protocol is the best. Lido is the largest staking protocol, while Rocket Pool is known for its vibrant community. Additionally, Coinbase Prime and ANKR are good choices for institutional stakers. What Are Liquid Staking Derivatives? Liquid staking derivatives are simply the liquid tokens that represent your staked crypto. For example, when staking ETH through Lido, your “liquid staking derivative” token will be “stETH.” What’s The Difference Between Liquid Staking And Liquidity Pools? While similar in name, liquid staking, and liquidity pools are two very different concepts. Liquid staking is when you receive a liquid token in return for staking your crypto. Liquidity pools, on the other hand, are when you provide “liquidity” to a pair of tokens that other traders can use to trade. For example, you can supply ETH liquidity into a USDC/ETH pool which will provide the ETH that traders need to buy when they are selling USDC. What Are The Advantages Of Liquid Staking Tokens? Liquid staking tokens allow you to have access to your staked crypto without any lockups. Normally, you can’t use your staked tokens for anything until you un-stake them. With liquid staking, you can use your liquid tokens to lend, provide liquidity, or as collateral when taking out loans.\n\nContributor George Hristov George is a tech writer interested in web3 startups and communities. In the dynamic world of crypto, he stays plugged into the day-to-day headlines, deep dives, and industry commentary. Read More"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbmdhcGUuY29tL2NyeXB0by1tYXJrZXQtY3Jhc2gtaGVyZXMtd2h5LWJpdGNvaW4tZXRoZXJldW0tYWx0Y29pbnMtYXJlLWZhbGxpbmctc2hhcnBseS_SAWVodHRwczovL2NvaW5nYXBlLmNvbS9jcnlwdG8tbWFya2V0LWNyYXNoLWhlcmVzLXdoeS1iaXRjb2luLWV0aGVyZXVtLWFsdGNvaW5zLWFyZS1mYWxsaW5nLXNoYXJwbHkvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 10 Jun 2023 07:00:00 GMT",
        "title": "Crypto Market Crash: Here's Why Bitcoin, Ethereum, Altcoins Are Falling Sharply - CoinGape",
        "content": "The crypto market crashed on Saturday, with the global market cap dropping 6% to $1.04 trillion in the past 24 hours. The total liquidation comes in at $400 million over the last 24hrs as over 190,000 traders were liquidated. The largest single liquidation happened on the crypto exchange OKX, with ETH-USD-SWAP valued at $2.18 million.\n\nBitcoin price tumbles 4%, with major downfall coming within just 2 hours. BTC price fell to a 24-hour low of $25,500. Bitcoin currently trades near $25600, with a high probability of falling below the $25k level.\n\nadvertisement\n\nEthereum price fell 6%, with the 24-hour low and high of $1765 and $1854. ETH price currently trades below $1750. The selling pressure continues to mount with increasing trading volumes.\n\nAltcoins such as Filecoin, Polygon, Cardano, Solana, Chiliz, Sandbox, Decentraland, Axie Infinity, and others fell more than 25%. Shiba Inu (SHIB) lead the crypto market crash, falling 30% in the last 24 hours. Some buying from the dip is also recorded.\n\nAlso Read: Binance To Temporarily Suspend All Crypto Margin And Earn Related Services\n\nReasons Behind the Crypto Market Crash\n\nMajor liquidations were recorded in the cryptocurrencies mentioned in the US SEC lawsuits against Coinbase and Binance. However, the massive liquidation came in response to Binance.US stopping USD fiat support on the exchange and Robinhood delisting Solana (SOL), Cardano (ADA), and Polygon (MATIC).\n\nUS SEC mentioned BNB, BUSD, SOL, ADA, MATIC, FIL, ATOM, SAND, MANA, ALGO, AXS, and COTI as securities in the Binance lawsuit. The agency listed SOL, ADA, MATIC, FIL, SAND, AXS, CHZ, FLOW, ICP, NEAR, VGX, DASH, and NEXO as securities in the Coinbase lawsuit.\n\nAccording to Coinglass, over $300 million in longs and $30 million in shorts were liquidated in the last 24 hours. The liquidations majorly happened on Binance, OKX, and Bybit, with BTC ($50M), ETH ($46M), ADA ($17M), SOL ($16M), LTC ($12M), DOGE ($11M), BNB (10M), FIL ($10M), and MATIC ($9M).\n\nGrayscale Investments has also filed a request with the US SEC seeking withdrawal of the Trust’s Registration Statement on Form 10 for Grayscale Filecoin Trust. The SEC staff continues to view Filecoin (FIL) as security. However, Grayscale says it will continue to believe that FIL is not a security.\n\nMarket makers such as Jump Crypto and Cumberland have pulled all the liquidity from altcoins. Market makers were caught dumping major crypto to exchanges Binance and Coinbase. Binance.US partners are reluctant to work with the exchange, causing a major selloff across the market.\n\nMoreover, over 4 trillion Shiba Inu (SHIB) tokens worth millions were moved from Shiba Staking to crypto exchange Binance. It triggered a selloff in SHIB and BONE prices.\n\nScimitar Capital, the hedge fund rumored to be behind the massive $2 billion altcoin liquidation, said:\n\n“Our fund has made the strategic decision to liquidate our crypto holdings and return the capital to our esteemed LPs. We believe this move will provide enhanced stability and opportunities.”\n\n[BREAKING] The fund that liquidated $2B of altcoins late Friday night in the broad crypto selloff is rumored to be Scimitar Capital pic.twitter.com/e23mbpuJda — thiccy (@thiccythot_) June 10, 2023\n\nAlso Read: Terra Classic’s Biggest v2.1.0 Parity Upgrade Proposal Officially Passed, LUNC To $1"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2V0aGVyZXVtL2V0aGVyZXVtcy12aXRhbGlrLWJ1dGVyaW4tcG9seWdvbnMtc2FuZGVlcC1uYWlsd2FsLWRvbmF0ZS0xMDAtbWlsbGlvbi10by1jb3ZpZC0xOS1yZXNlYXJjaC_SAYUBaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy9ldGhlcmV1bS9ldGhlcmV1bXMtdml0YWxpay1idXRlcmluLXBvbHlnb25zLXNhbmRlZXAtbmFpbHdhbC1kb25hdGUtMTAwLW1pbGxpb24tdG8tY292aWQtMTktcmVzZWFyY2gvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 10 Jun 2023 07:00:00 GMT",
        "title": "Ethereum’s Vitalik Buterin, Polygon’s Sandeep Nailwal Donate $100 Million To COVID-19 Research - NewsBTC",
        "content": "Vitalik Buterin, co-founder of Ethereum, and Sandeep Nailwal, co-founder of Polygon, have pledged $100 million to help accelerate COVID-19 research and relief efforts in India.\n\nWith COVID-19 variants continuing to emerge and spread, and with a very high number of people experiencing long-term symptoms speeding up, research efforts are critical.\n\nHow The Donation Will Be Used To Support COVID-19 Research\n\nThe donations from Buterin and Nailwal are some of the largest philanthropic contributions ever made in crypto. Buterin made the announcement in a Twitter thread and according to the thread, the fund will be donated to Crypto Relief, with the funds going directly to researchers working on solutions to combat the long-term effects of coronavirus.\n\nCrypto Relief is a project led by set up by Nailwal during the height of the COVID pandemic as an emergency relief fund. The polygon co-founder said the non-profit organization is now upgrading into a long-term strategic fund for healthcare donations in India. Buterin also confirmed this change of approach in his Twitter post, noting that dealing with Covid and future pandemics needs to take an integrated global approach.\n\n“Work in India continues to be a key part of the solution, but we also need an integrated global approach,” the co-founder said.\n\nThe money will go to fund research projects related to cutting-edge scientific discoveries & inventions in India and other developing nations. Overall, it’s a win for science, a win for global health, and a win for humanity.\n\nETH price falls to the $1,700 level | Source: ETHUSD on TradingView.com\n\nPast Donations Of Vitalik Buterin To COVID Relief\n\nVitalik Buterin has a history of donating to important causes like COVID-19 relief, with him donating cryptocurrencies worth $1.5 billion to several non-profit organizations in 2021. During this period, Buterin donated over $1 billion worth of Shiba Inu coin to aid India’s fight against the coronavirus.\n\nButerin made the donation by offloading 50 trillion SHIB tokens worth $1.2 billion, which he was gifted by the creators of the Shiba Inu coin. With India being one of the most badly affected countries during the pandemic, the fund helped provide medical equipment and supplies as the country battled a deadly second wave of COVID-19 infections.\n\nOutside of the pandemic, Buterin has donated millions of dollars in crypto to various charities and causes. Last year, he quietly donated $5 million to Ukraine relief efforts following the Russian invasion.\n\nFeatured image from Coingape, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vZGVjcnlwdC5jby8xNDQwMzMvZm9vZG1hc2t1LWZvb2QtbWFzay1wcm9vZi1vZi1lYXQtbmZ00gFEaHR0cHM6Ly9kZWNyeXB0LmNvLzE0NDAzMy9mb29kbWFza3UtZm9vZC1tYXNrLXByb29mLW9mLWVhdC1uZnQ_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 10 Jun 2023 07:00:00 GMT",
        "title": "Foodmasku Dishes Out Edible Masks on Ethereum - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nSome detractors of NFTs fixate on their ethereal, intangible nature. How can they be art, critics cry, if they're only digital, virtual, disconnected from reality?\n\nIt would be difficult to levy those claims against the works of Foodmasku.\n\nAD\n\nAD\n\nThat’s the moniker of Antonius Wiriadjaja, the multimedia performance artist who—for three years now—has created NFTs depicting himself wearing masks made entirely of food, and then eating the masks. The ultimate consumption of the work is a rule, a key component.\n\nCourtesy: Foodmasku\n\nThe association between masks and food—and between food masks and the blockchain for that matter—is not necessarily intuitive. That may be because, for Wiriadjaja, those connections were the product of organic necessity.\n\nIn the earliest months of the pandemic, the artist recalls, he and a group of remote colleagues were navigating the still-bizarre realm of Zoom encounters. One fateful day, one of his friends became inadvertently trapped in a video filter that apparently turned their face into a pickle. The caller was embarrassed. Wiriadjaja’s first impulse was to make them feel better.\n\n“So I took [a part of] my dinner, which was a piece of kale, put it on my face and said 'Hey, I have a filter on as well,’” Wiriadjaja told Decrypt at NFC Lisbon earlier this week.\n\nThe pickled participant was delighted, their shame washed away, and they asked Wiriadjaja what he was going to wear tomorrow. Foodmasku was born.\n\nCourtesy: Foodmasku\n\nIn the following weeks and months, Wiriadjaja dedicated himself to the mission of creating, documenting, and eating food masks. Banana eyes, broccoli nostrils, noodle noses, shrimp eyebrows... every day, a new sumptuous self-portrait.\n\nAD\n\nAD\n\nThe project steadily gained steam, but that success was a double-edged sword: people were so enamored with Wiriadjaja’s food masks that phony Foodmasku accounts began popping up across numerous social media platforms.\n\nCourtesy: Foodmasku\n\nThis was March 2021, and Wiriadjaja was frustrated. There had to be a way to own digital files, to protect his edible oeuvre. He did some searching online and came across NFTs. The artist Beeple had just sold an NFT artwork for $69 million, catapulting the emerging technology into the mainstream.\n\nSo Foodmasku became a Web3 artist. Not out of an ideological or artistic commitment to the ethos of decentralization, but instead—as with the inciting kale flap—because it just made sense.\n\nTo date, Wiriadjaja has created almost 2,000 Foodmasku NFTs, generating about 50 ETH, or $92,000, in sales.\n\nCourtesy: Foodmasku\n\nThe artist, who was born in Indonesia and raised in Boston, has faced different reactions to his works across various cultures and contexts. A through-line, he’s found, is that people across the world tend to be afraid of technology.\n\n“Technology is scary to everyone, everywhere,” he said. “Indonesians are worried that technology’s going to kill off their traditional arts, Americans are worried technology’s going to take all of their jobs. But one thing everybody relates to is food.”\n\nIf foods and masks and emergent digital technologies can be brought together to give Wiriadjaja’s colorfully inventive and optimistic portraits a cohesive thesis, it might be that any medium possesses the capacity to tap into the universal vibrancy of humanity.\n\nCourtesy: Foodmasku\n\nIn that vein, Wiriadjaja has recently become fascinated with artificial intelligence. He’s developing a project called “Proof of Eat,” which is intended to clear the air on the increasing disquiet prompted by blurring of the line between humans and machines.\n\nAD\n\nAD\n\n“One big test of whether a creator is human or not, is if they can eat food,” he said."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2hvdy1ldGhlcmV1bS1jb3VsZC1zbWFzaC11czIwMDAtdGhpcy13ZWVrLWEtcHJpY2UtYW5hbHlzaXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 10 Jun 2023 07:00:00 GMT",
        "title": "How Ethereum Could Smash US$2000 This Week: A Price Analysis - Analytics Insight",
        "content": "The cryptocurrency Ethereum could smash US$2000, as per the Ethereum price analysis.\n\nDue to its growth potential and distinctive qualities, including its smart contract capability and decentralized applications, Ethereum is a promising investment. In addition, a sizable and committed developer community is continually working to enhance the platform and broaden its use cases. Ethereum probably could smash US$2000 this week. On June 5, 2023, the price of Ethereum is US$1,904.93. Ethereum’s price would have to rise by more than 5% to hit US$2000. Although it seems unlikely, this is conceivable.\n\nExperts foresee Ethereum could smash US$2000. Several elements impact Ethereum price analysis, which could lead to an ETH breakthrough above US$2,000 in the future. First, the Ethereum network is undergoing a big update known as Ethereum 2.0, which is anticipated to greatly enhance the network’s scalability and security. Even though this update won’t be finished until 2023, some early adopters are already staking their ETH tokens to support network security. The demand for ETH is anticipated to rise as more of it is staked, which could raise the price.\n\nSecond, the general cryptocurrency market is positive, with recent gains in Bitcoin (BTC) and other significant cryptocurrencies. This optimistic outlook may also apply to ETH, which would support price growth.\n\nAnd last, a breakout in ETH may be aided by the imminent Ethereum Merge. The Ethereum network has undergone a significant upgrade called The Merge, which will alter the way ETH is mined. The proof-of-stake (PoS) consensus method will replace the current proof-of-work (PoW) consensus mechanism used to mine Ethereum (ETH). The Ethereum network is anticipated to become more secure and energy efficient as a result of this change. As a result, the Merge might draw in more investors, which might raise the price of ETH.\n\nHere are several important technical thresholds to look out for: The all-time high for ETH is US$2,000. A significant positive indication would be a breakout above this level. The 200-day moving average for ETH is US$2,100. The upswing would be confirmed, and potential gains may be made if there were a breakout above this level. The 50-day moving average for ETH is US$2,200. The Bulls would be in charge if there was a breakout above this level.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY3J5cHRvZGFpbHkuY28udWsvMjAyMy8wNi92aXRhbGlrLW91dGxpbmVzLXRocmVlLXRyYW5zaXRpb25zLWZvci1ldGhlcmV1bS1zLWZ1dHVyZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Vitalik Outlines Three Transitions for Ethereum's future - CryptoDaily",
        "content": "Table of Contents\n\nIn a recent blog post, Ethereum co-founder Vitalik Buterin has unveiled a roadmap consisting of three significant technical transitions that he believes are vital for ensuring the long-term success and sustainability of the Ethereum blockchain.\n\nThree must-implement transitions\n\nButerin emphasises that these transitions, namely Layer 2 scaling, wallet security enhancement, and privacy measures, are essential in maintaining Ethereum's decentralised nature and for guaranteeing open and unrestricted access for all users.\n\nFailure to implement these transitions, warns Buterin, could potentially undermine Ethereum's viability as a robust and widely adopted platform.\n\nLayer 2 scaling\n\nThe first transition focuses on scaling Layer 2 solutions. Over the past few years, Ethereum has witnessed the emergence of a Layer 2 ecosystem comprising solutions like Optimistic Rollup and Zero Knowledge-Rollup, which have effectively reduced transaction costs. However, as the majority of activities still occur on the main Ethereum network, further maturation and scaling of the Layer 2 space are necessary.\n\nButerin highlights the potential consequences of neglecting Layer 2 scaling, including skyrocketing transaction fees during market expansion phases or bullish market trends. Such circumstances may lead users to seek centralised alternatives, posing a threat to Ethereum's decentralisation goals.\n\n\"The absence of the first transition, Layer 2 scaling, would render Ethereum vulnerable, with each transaction costing $3.75 ($82.48 during a bullish market). This would inevitably drive mass-market products to disregard the Ethereum chain and adopt centralized workarounds,\" Buterin explained.\n\nWallet security\n\nThe second transition highlighted by Buterin centres around wallet security. Buterin expresses concern that potential security risks may discourage users from storing their funds and non-financial assets on the Ethereum network, driving them towards centralised exchanges as a safer alternative.\n\n\"Without the second transition, wallet security, Ethereum's success is compromised as users become hesitant to store their funds securely. This could result in a mass migration towards centralized exchanges,\" warns Buterin.\n\nTo enhance wallet security, Buterin proposes a shift towards smart contract wallets with advanced features such as social recovery, similar to the concept of account abstraction. These enhanced wallets would offer improved security measures and an enhanced user experience.\n\nPrivacy\n\nThe third and final transition emphasised by Buterin is privacy. He cautions that the absence of robust data privacy measures may discourage users from utilising Ethereum's capabilities fully. To address this concern, Buterin suggests the implementation of stealth address protocols, which would provide privacy features for Ethereum users.\n\nBy integrating stealth address protocols, Ethereum would be able to offer enhanced privacy options, attracting users who value anonymity and data protection.\n\nDisclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2V0aGVyZXVtLXByaWNlLXdvbnQtaGl0LTEwMDAwLXRoaXMteWVhci1idXQtdGhpcy1hbHRjb2luLWlzLXNldC1mb3ItMjB4LWdhaW5zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Price Won't Hit $10000 This Year, But This Altcoin Is Set For 20X Gains - Analytics Insight",
        "content": "With the end of the second quarter of 2023 approaching in just a few weeks, the hopes of Ethereum reaching $10,000 have pretty much plummeted in the community.\n\nAnd while ETH is still holding strong around $1.9k barrier and will probably surpass even $2,500-$3,000 mark by Q3, any larger spikes seem unlikely at the moment.\n\nHowever, if you’re among the investors that are looking for more than just slight 10-15% increases, there seems to be one altcoin on the radar that’s poised for enormous profits – Wall Street Memes (WSM).\n\nWall Street Memes (WSM) began its presale less than a week ago and it’s already making huge moves within the market, with the community captivated by its innovative ideas and impressive technology.\n\nLet’s check out all the details.\n\n>>>Buy $WSM Now<<<\n\nEthereum Unlikely to Hit $10k Mark in 2023 – Turn Your Focus toward WSM, a New Altcoin with 20X Gain Potential\n\nWhile the vast majority of experienced crypto investors in the industry believe that Ethereum is bound to reach the $10,000 mark at some point, not many have faith anymore that it will happen in 2023.\n\nAlthough things started off on the right foot for cryptocurrencies this year, the last two months have still been a constant seesaw around the $2,000 price.\n\nAnd, with Fed’s gloomy predictions, negative economic turbulences around the globe, and overall high crypto uncertainty right now, all indicators suggest that ETH is far from reaching $10k soon.\n\nBut that doesn’t mean you can’t make some impressive profits with other coins. 7\n\nTo be specific, one token that’s caught the attention of every major investor in the game in the last few days is Wall Street Memes (WSM).\n\nLet’s see what the hype is about.\n\n>>>Buy $WSM Now<<<\n\nWall Street Memes Is Tokenizing the Iconic “Greed is Good” Scene Movement – This Innovative Approach Could Lead to 30x-50x Profits!\n\nBorn out of the legendary GameStop fiasco of 2021 and the enduring legacy of the brave Wall Street Bets heroes, WSM has established itself as a unique digital asset that combines speculation and community rewards within the vibrant social media meme subculture.\n\nIn the ever-evolving world of cryptocurrency, meme tokens have consistently emerged as the best-performing assets during the last few bull runs.\n\nJust look at the success stories of Dogecoin and Shiba Inu in 2021, or the recent phenomenon of PEPE and $SPONGE.\n\nNow, the ‘$WSM army’ aims to replicate that prosperity by showing the world that ‘greed is good,’ inspired by the iconic slogan of Gordon Gekko, the popular Wall Street movie character.\n\nWall Street Memes stands apart from other spontaneous meme coins, boasting a strong foundation with the support of over one million followers across its social media channels. These dedicated enthusiasts have been captivated by the popular NFT collections and engaging Instagram memes, all centered on the thrilling world of crypto and stocks, or as Gen Z likes to call them, stonks.\n\nThe power of the WSM token lies in its ability to ‘tokenize the movement’ and empower its community.\n\nConsidering all of these factors, it seems imminent that huge profits are on the way for those that invest early in WSM. Will you be one of them?\n\n>>>Buy $WSM Now<<<\n\nWall Street Memes Presale Raises Over $1.6M in Less Than a Week and Makes it Clear That it’s the Hottest Profit Token on the Market Right Now\n\nWith a total supply of 2 billion tokens, every single WSM token can be held and traded by community members. The team has set aside 50% of the tokens exclusively for presale buyers, ensuring that early supporters can benefit from the initial momentum.\n\nAn additional 30% of the supply is allocated for community rewards, reinforcing commitment to the collective success of all members. Finally, 20% of the tokens will be dedicated to liquidity, ensuring seamless trading experiences once WSM is listed on major exchanges.\n\nThe presale for WSM tokens officially started on May 26th, and we’ve seen it already raise $4.8M in what’s one of the fastest-growing presales of the year.\n\nPrice bumps are expected with every new presale stage, so if you want to maximize your chances of bigger gains, now is the perfect time to join.\n\n>>>Buy $WSM Now<<<\n\nThe Verdict\n\nEven though Ethereum has seen some solid increases this year and is set to soon hit the $2k barrier, 5x profits to $10k don’t seem realistic at the moment.\n\nIf big gains are what you’re looking for, you should check out the booming presale token Wall Street Memes (WSM) instead.\n\nWith unique ideas, an innovative approach to blockchain tech, and a huge community on social media showing its support, many believe that WSM could easily reach 30x-50x gains in the following weeks.\n\nAnd if you want to profit from those bull movements, now is the best time to join the flourishing presale.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMizgFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWluLWluZGlhLWp1bmUtMTAtY2hlY2stbWFya2V0LWNhcC1iaXRjb2luLWV0aGVyZXVtLW1lcmdlLWRvZ2Vjb2luLXNvbGFuYS1saXRlY29pbi1yaXBwbGUteHJwLWJpbmFuY2UtdG9rZW4tcW50LXByaWNlcy1nYWluZXItbG9zZXItMTYwODEwMtIB0gFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWluLWluZGlhLWp1bmUtMTAtY2hlY2stbWFya2V0LWNhcC1iaXRjb2luLWV0aGVyZXVtLW1lcmdlLWRvZ2Vjb2luLXNvbGFuYS1saXRlY29pbi1yaXBwbGUteHJwLWJpbmFuY2UtdG9rZW4tcW50LXByaWNlcy1nYWluZXItbG9zZXItMTYwODEwMi9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 10 Jun 2023 07:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin, Ethereum, Dogecoin See Losses As XDC Network Becomes Top Gainer - ABP Live",
        "content": "Bitcoin (BTC) and Ethereum (ETH) — two of the most valued crypto coins — managed to rise above the $25,000 and $17,00 marks, respectively, on early Saturday morning. However, in terms of percentage-wise performance, BTC witnessed a loss of 2.13 percent. Other popular altcoins — including the likes of Dogecoin (DOGE), Solana (SOL) — landed in the negative as overall prices saw minor losses across the board. XDC Network (XDC) emerged to be the biggest gainer, seeing a 24-hour jump of over 1.21 percent. Polygon (MATIC), on the other hand, turned out to be the biggest loser.\n\nAt the time of writing, the global crypto market cap stood at $1.05 trillion, registering a 24-hour loss of 4.30 percent.\n\nBitcoin (BTC) price today\n\nBitcoin price stood at $25,833.66 seeing a 24-hour loss of 2.13 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 23.30 lakhs.\n\nEthereum (ETH) price today\n\nETH price stood at $1,794.93, marking a 24-hour loss of 2.35 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 1.61 lakhs.\n\nDogecoin (DOGE) price today\n\nDOGE registered a 24-hour loss of 12.92 percent as per CoinMarketCap data, currently priced at $0.05899. As per WazirX, Dogecoin price in India stood at Rs 5.6003.\n\nLitecoin (LTC) price today\n\nLitecoin saw a 24-hour loss of 10.67 percent. At the time of writing, it was trading at $78.28. LTC price in India stood at Rs 7,703.25.\n\nRipple (XRP) price today\n\nXRP price stood at $0.5027, seeing a 24-hour loss of 4.09 percent. As per WazirX, Ripple price stood at Rs 46.9995.\n\nSolana (SOL) price today\n\nSolana price stood at $13.97, marking a 24-hour loss of 26.61 percent. As per WazirX, SOL price in India stood at Rs 1,500.00.\n\nTop crypto gainers today (June 10)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nXDC Network (XDC)\n\nPrice: $0.03592\n\n24-hour gain: 1.21 percent\n\nGemini Dollar (GUSD)\n\nPrice: $1.00\n\n24-hour gain: 0.72 percent\n\nHuobi Token (HT)\n\nPrice: $2.87\n\n24-hour gain: 0.53 percent\n\nUNUS SED LEO (LEO)\n\nPrice: $3.54\n\n24-hour gain: 0.52 percent\n\nTether (USDT)\n\nPrice: $1.00\n\n24-hour gain: 0.03 percent\n\nTop crypto losers today (June 10)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nPolygon (MATIC)\n\nPrice: $0.6507\n\n24-hour loss: 17.33 percent\n\nCardano (ADA)\n\nPrice: $0.2704\n\n24-hour loss: 15.45 percent\n\nSolana (SOL)\n\nPrice: $16.11\n\n24-hour loss: 14.28 percent\n\nFlow (FLOW)\n\nPrice: $0.5478\n\n24-hour loss: 11.60 percent\n\nAptos (APT)\n\nPrice: $6.81\n\n24-hour loss: 11.44 percent\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZW4uZXRoZXJldW13b3JsZG5ld3MuY29tL2JpbmFuY2UtdXMtc3VzcGVuZC11c2Qtd2l0aGRyYXdhbC1qdW5lLTEzL9IBT2h0dHBzOi8vZW4uZXRoZXJldW13b3JsZG5ld3MuY29tL2JpbmFuY2UtdXMtc3VzcGVuZC11c2Qtd2l0aGRyYXdhbC1qdW5lLTEzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Binance US' Banking Partners To Suspend USD Withdrawals By June 13 - Ethereum World News",
        "content": "Binance US has announced that its banking partners plan to suspend USD withdrawal channels as soon as June 13, 2023.\n\nThe crypto exchange will suspend USD deposits today and will delist USD pairs next week.\n\nBinance US is encouraging its customers to take “appropriate actions” with their USD.\n\nThe exchange has assured that it will maintain 1:1 reserves for all customer assets.\n\nBinance US is suspending USD deposits on its trading platform effective immediately. The crypto exchange has revealed that its banking partners are preparing to pause fiat (USD) withdrawal channels as early as June 13, 2023. The American arm of the world’s largest crypto exchange blamed the deposit and withdrawal suspension on the enforcement action initiated by the U.S. Securities and Exchange Commission.\n\nBinance US Blames SEC’s Extremely Aggressive and Intimidating Tactics\n\nBinance US took to Twitter a little while ago to inform its customers about the latest developments regarding its online trading platform. The exchange accused the SEC of using extremely aggressive and intimidating tactics in pursuit of its “ideological campaign against the American digital asset industry.”. According to the crypto giant’s American arm, the legal troubles and complications stemming from the securities regulator’s actions have led to challenges with the banks that the exchange works with.\n\nThe crypto exchange stated that in the interest of consumer protection, it will suspend USD deposits today and transition to a “crypto-only” exchange. All customers are being encouraged to withdraw their fiat assets from the American exchange before June 13, 2023. The exchange warned that due to elevated volumes and weekend bank closures, the withdrawal process may take longer than usual.\n\nWhile we remain open to a productive compromise that enables a thriving digital asset marketplace in America, Binance.US will continue to vigorously defend ourselves, our customers, and industry against the meritless attacks of the SEC.” Binance US\n\nBinance US will start delisting USD trading pairs, including BTC/USD starting next week. Any USD balance remaining on the platform after June 13, 2023, will likely be converted to stablecoins. The crypto exchange has assured its customers that it will maintain 1:1 reserves for all customer assets."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2NyeXB0by1yZXZvbHV0aW9uLWVhcmx5LWJpdGNvaW4tYW5kLWV0aGVyZXVtLWludmVzdG9ycy1maW5kLWdlbS1pbi1kaWdpdG9hZHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Crypto Revolution: Early Bitcoin and Ethereum Investors Find Gem In DigiToads - Analytics Insight",
        "content": "The crypto market has undergone a transformative revolution, with Bitcoin (BTC) and Ethereum (ETH) paving the way for a new era of digital assets. As these pioneering cryptocurrencies continue to shape the financial landscape, early investors have kept a keen eye out for the next profitable opportunity. DigiToads (TOADS), a remarkable discovery in this quest, has captivated investors’ attention.\n\nAs the crypto revolution gains momentum, the rise of DigiToads has become a beacon of potential, offering a unique best crypto investment prospect for those who dare to explore the uncharted territories of the digital realm. With the potential to revolutionize the blockchain landscape, TOADS has emerged as a hidden gem that promises untapped opportunities for those who recognize its immense value.\n\nThis article will explore DigiToads’ remarkable journey and why early Bitcoin and Ethereum investors find this cryptocurrency enticing.\n\nDigiToads (TOADS): A Web3 Gem Unleashing Unique Digital Creatures and Crypto Gaming Power\n\nDigiToads presents an excellent Web3 gaming platform that integrates collecting, nurturing, and engaging in battles with one-of-a-kind digital creatures called DigiToads. By combining innovative gameplay, community-focused initiatives, and promising investment potential, DigiToads has quickly become a hidden gem attracting the attention of early crypto adopters.\n\nTo make their DigiToads stronger in the competitive swamp arena, players can utilize TOADS DeFi tokens, the native currency of the DigiToads ecosystem. Players can enhance the size, strength, and abilities of their DigiToads by using TOADS tokens to acquire food, potions, and training equipment. This strategic approach gives players a competitive edge during battles against other players.\n\nDigiToads ensures that its community is consistently rewarded for its participation. At the end of each monthly season, the top 25% of players on the leaderboard receive TOADS DeFi tokens as a reward. 50% of the funds generated from in-game item sales are allocated to the prize fund, which is distributed.\n\nThe DigiToads project introduces an NFT staking platform where 2% of every TOADS transaction is allocated to a staking pool. This pool is distributed to NFT holders who regularly stake their cool NFTs. By incentivizing NFT holders to participate actively, DigiToads ensures continuous rewards and fosters a vibrant marketplace for digital collectibles.\n\nDigiToads presale has been strategically designed to offer substantial growth potential for early participants. In Lilypad 7 of the ten-stage presale, the project has raised over $4.7 million, with over 98% of the TOADS sold tokens. With an affordable presale price of 0.036 USD, investors can benefit from a potentially significant return on investment.\n\n>> Buy DigiToads Now <<\n\nBitcoin (BTC): Unveiling The Power of a Decentralized and Transparent Monetary System\n\nBitcoin, the first-ever decentralized cryptocurrency, emerged as a groundbreaking financial innovation. Early BTC investors were visionaries who recognized the potential of this pioneering technology. They saw beyond the skepticism and uncertainty surrounding cryptocurrencies then and embraced the idea of a decentralized and transparent monetary system.\n\nAmid the ongoing crypto revolution, early BTC investors have found a promising gem in DigiToads. These investors have discovered a valuable asset in DigiToads, as it promises to generate significant returns on investment, similar to the early days of Bitcoin and Ethereum.\n\nEthereum (ETH): Pioneering Smart Contracts and Decentralized Applications\n\nEthereum, often hailed as the pioneer of smart contracts and decentralized applications, continues to shape the landscape of blockchain technology. ETH is a powerful medium for facilitating peer-to-peer transactions and powering decentralized finance (DeFi) protocols.\n\nEarly investors in ETH have recently discovered the untapped opportunities in DigiToads. These Ethereum investors recognized the value of DigiToads’ innovative approach to cool NFTs and its potential for mass adoption in the booming NFT market.\n\n>> Buy DigiToads Now <<\n\nSummary\n\nThe ongoing crypto revolution has opened up unprecedented opportunities for early investors seeking the best crypto investment, particularly those with foresight in identifying promising projects. DigiToads has emerged as a true gem among these projects for early Bitcoin and Ethereum investors. With its innovative approach to non-fungible tokens (NFTs) and its dedicated community, DigiToads has proven itself as a valuable asset in the crypto space. Join the ranks of visionary investors and embrace the potential of DigiToads today!\n\nFor more information on DigiToads visit the website, join the presale or join the community for regular updates.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMikgFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1ob2xkcy1hYm92ZS0yNjUwMC1ibmItY2FyZGFuby1mYWxsLXVwLXRvLTMvYXJ0aWNsZXNob3cvMTAwODcwNTIyLmNtc9IBlgFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1ob2xkcy1hYm92ZS0yNjUwMC1ibmItY2FyZGFuby1mYWxsLXVwLXRvLTMvYW1wX2FydGljbGVzaG93LzEwMDg3MDUyMi5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin holds above $26,500; BNB, Cardano fall up to 3% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe cryptocurrency markets were trading mixed on Friday. Bitcoin, XRP , and Polygon were trading with gains, while Ethereum, BNB , and Cardano were trading with cuts.Bitcoin (BTC) rose 0.58% to $26,532, whereas Ethereum (ETH) was below the $1,850 level. The global cryptocurrency market cap was trading higher around $1.1 trillion, rising 0.53% in the last 24 hours.\"Crypto markets have traded sideways in the last 24 hours. The crypto fear and greed index continues to maintain yesterday’s position right in the middle of the scale with 50 points. BTC’s hold around $26.5k remains firm despite events pertaining to the SEC lawsuits and the upcoming monetary policy decision by the Feds due next week,\" Parth Chaturvedi, Investments Lead at CoinSwitch Ventures, said.The total volume in DeFi stood at $1.91 billion, 7.38% of the total crypto market 24-hour volume. The volume of all stablecoins is at $24.7 billion, which is 95.36% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, was around $515 billion. BTC volume stood at approximately $11.85 billion, falling 31.34% in the last 24 hours. Bitcoin’s dominance is currently 46.69%, an increase of 0.10% over the day, according to CoinMarketCap.\"The SEC action on crypto firms has not impacted BTC prices in a big way as the world’s largest crypto holds strong above the $26,000 mark. The largest altcoin, ETH, also remains resilient and did not slide further in the last 24 hours which is mainly due to optimism around Fed’s monetary policy decision which is due next week. There is a sense in the market that Fed may relax its hawkish stance to boost market liquidity,\" Shivam Thakral, CEO of BuyUcoin, said.Rajagopal Menon, Vice President at WazirX said, \"Major market oscillators point to a neutral sentiment. The Relative Strength Index (14) sits at 45, with a neutral outlook. The Stochastic %K (14, 3, 3) at 35 and the Average Directional Index (14) at 22 indicate a Neutral outlook as well.\"The MACD Level (12, 26), at −261, indicates Sell. The Stochastic RSI Fast (3, 3, 14, 14) is Neutral at 41 and William's Percentage indicates Neutral at -64 as well,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 12.27 hours, IST on June 9, 2023)Bitcoin $26,532 0.58%Ethereum $1,838 -0.10%Tether $1.00 -0.04%BNB $258 -0.51%XRP $0.5231 0.53%Cardano $0.3169 -2.98% Dogecoin $0.6776 0.03%Polygon $0.7797 1.83% Litecoin $87.79 -0.41%Polkadot $5.01 -0.48%Tron $0.07765 0.93%Avalanche $13.83 -0.52%Shiba Inu $0.000007925 -0.16%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vYml0Y29pbmlzdC5jb20vZXRoZXJldW0tYnV0ZXJpbnMtcHJvcG9zZWQtMy10cmFuc2l0aW9ucy_SAURodHRwczovL2JpdGNvaW5pc3QuY29tL2V0aGVyZXVtLWJ1dGVyaW5zLXByb3Bvc2VkLTMtdHJhbnNpdGlvbnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Success Hinges On Vitalik Buterin's Proposed '3 Transitions' - What Are They? - Bitcoinist",
        "content": "Ethereum, the renowned blockchain platform and brainchild of Vitalik Buterin, faces a crucial crossroad on its path to further growth and adoption.\n\nIn a blog post recently shared by the Ethereum co-founder himself, Buterin highlights the imperative need for three pivotal transitions that Ethereum must undergo in order to ensure its prosperous future.\n\nThese transitions, aptly dubbed “The Three Transitions,” revolve around the realms of Layer-2 scaling solutions, the implementation of smart contract wallets, and the augmentation of privacy in fund transfers.\n\nWithout embracing these transformative changes, Buterin says Ethereum risks hindering its own expansion and jeopardizing its position as a frontrunner in the ever-evolving landscape of decentralized technologies.\n\nLayer-2 Scaling: Addressing Ethereum’s High Gas Fees\n\nOne of the most pressing challenges faced by the Ethereum network is the issue of exorbitant gas prices, according to Buterin. To tackle this problem head-on, Buterin proposes the adoption of Layer-2 rollups, which offer a promising solution.\n\nBy embracing rollups on a large scale, Ethereum can effectively mitigate the persistently high gas fees that have been a significant deterrent for users.\n\nEven in the current crypto winter, widely considered the harshest downturn in the history of cryptocurrencies, gas fees for Ethereum transactions still hover around $3.\n\nButerin emphasizes the unsustainability of this situation, emphasizing that widespread adoption of Layer-2 solutions is the key to resolving the issue.\n\nNeglecting to do so would inevitably lead users to seek out “centralized workarounds” that offer more affordable alternatives and are easier to navigate.\n\nWallet Security: Enhancing User Experience And Trust\n\nAccording to Buterin, the lack of improved wallet security creates a barrier to users fully embracing the self-custody of their assets, leading them to seek centralized alternatives like exchanges. To overcome this challenge, it is crucial to enhance wallet security measures and provide a user-friendly experience that instills trust.\n\nFurthermore, Buterin highlights the significance of interoperability between wallets and networks. Seamless integration allows for a smoother experience when utilizing cryptocurrencies for day-to-day transactions such as purchasing groceries.\n\nETH market cap currently at $209 billion. Chart: TradingView.com\n\nEthereum Privacy: Overcoming The Transparency Challenge\n\nThe absence of privacy in individual transactions poses a significant hurdle to Ethereum’s goal of becoming the preferred network for everyday users, according to the developer.\n\nThe lack of confidentiality and the public visibility of transactions can deter individuals from embracing cryptocurrencies in their daily lives.\n\nButerin contends that if transactions are easily traceable and linked to users, people would be reluctant to use crypto for everyday activities.\n\nAcknowledging the importance of privacy, he proposes the utilization of stealth addresses as a potential solution. However, he also admits that privacy concerns remain a formidable problem without a readily available remedy.\n\nWhile Buterin recognizes the significance of privacy, finding a comprehensive and practical solution is a complex challenge.\n\nEthereum, like many other blockchain networks, grapples with balancing transparency and security with the need for individual privacy.\n\nResolving this issue requires ongoing research, development, and collaboration to ensure that privacy concerns are adequately addressed within the Ethereum ecosystem.\n\nFeatured image from Cryptonomist"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMioAFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vc3RlbGxhcnMtYW5kLXhsbXMtcmVzaWxpZW5jZS1kZWZ5aW5nLXNlYy1hbmQtZ2Vuc2xlci1zb3JvYmFuLWVtZXJnZXMtYXMtc3VwZXJpb3ItZXRoZXJldW0tYWx0ZXJuYXRpdmUtZm9yLWJ1aWxkaW5nLXRoZS1mdXR1cmUv0gGmAWh0dHBzOi8vd3d3LmNyeXB0by1uZXdzLWZsYXNoLmNvbS9zdGVsbGFycy1hbmQteGxtcy1yZXNpbGllbmNlLWRlZnlpbmctc2VjLWFuZC1nZW5zbGVyLXNvcm9iYW4tZW1lcmdlcy1hcy1zdXBlcmlvci1ldGhlcmV1bS1hbHRlcm5hdGl2ZS1mb3ItYnVpbGRpbmctdGhlLWZ1dHVyZS8_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Stellar’s and XLM’s Resilience: Defying SEC and Gensler, Soroban Emerges as Superior Ethereum Alternative for Building the Future - Crypto News Flash",
        "content": "Stellar Foundation makes a compelling case for Soroban, and why it should be prioritized similarly to platforms such as Ethereum and Solana.\n\nThe Soroban smart contract is attempting to compete with Ethereum as it caters to a wider audience despite being a newbie on the market.\n\nSoroban, according to Stellar’s definition, is a developer-friendly Rust-based smart contracts platform. The smart contract was not only designed for sensibility but also for scalability. The smart contract is already live on a test network known as Futurent. It also integrates with and works alongside the Stellar blockchain network. designed for scale and sensibility.\n\nIn a recent blogpost, Stellar has detailed multiple reasons why the smart contract should hold as much importance as the likes of Ethereum and Solana, despite their popularity and larger adoption levels. When it comes to the best platform for specific use cases, that also supports a specific goal and value, Stellar wants the ecosystem to consider Sobran for a variety of reasons.\n\nAlthough Stellar maintains that Soboran might not be the answer for every smart contract developer or entrepreneur, the foundation is certain that the smart contract is a compelling choice to consider when looking to build a blockchain-based project. The blogpost read.\n\nLet’s start with the obvious tech differences. Ethereum uses the Ethereum Virtual Machine (EVM) runtime environment, and contracts are built using the Solidity programming language (for the most part, you can also use Vyper or Yul), while Soroban uses the WebAssembly (WASM) runtime environment and supports contracts written in a broader range of languages such as Rust, C, C++, Go, AssemblyScript, and more.\n\nSoroban seeks to disrupt the real-world and fintech finance ecosystem\n\nAdditionally, it was revealed that its mission since conception, has been centered around bringing financial access to everyone across the globe. This inclusive approach is one that Soroban also follows. While EVM was created mainly for the Ethereum blockchain, WASM was created for broader interoperability. This makes it possible for WASM to be utilized in many different environments like web browsers, server-side applications, and other blockchain platforms. The blog spot further added.\n\nThe same interoperability distinction can be applied to Solidity versus Rust. Solidity was explicitly designed for writing smart contracts on the Ethereum blockchain, while Rust is a general-purpose programming language that, while great for smart contract development, can also be used for web development, systems programming, and more.\n\nAsides from being an inclusive technology, the Soroban smart contract also serves the greenfield ecosystem and the real-world tech ecosystem.\n\nEthereum currently boasts a large number of assets on the network, along with many fiat-backed stablecoins. It is however worth noting that the stablecoins on the network are backed by popular fiat currencies and CBDCs. Stellar on the other hand is more focused on worldwide reach with a more expansive range of fiat-backed stablecoins such as Circle’s USDC and Euro Tempo (EURT) issued by Tempo.\n\nThis article is provided for informational purposes only and is not intended as investment advice. The content does not constitute a recommendation to buy, sell, or hold any securities or financial instruments. Readers should conduct their own research and consult with financial advisors before making investment decisions. The information presented may not be current and could become outdated."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vdGltZXN0YWJsb2lkLmNvbS9zaHl0b3NoaS1rdXNhbWEtY29tcGFyZXMtc2hpYmEtaW51LXNoaWItd29vZnBhcGVyLXRvLXZpdGFsaWstYnV0ZXJpbi1zb2x1dGlvbnMtZm9yLWV0aGVyZXVtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Shytoshi Kusama Compares Shiba Inu (SHIB) Woofpaper to Vitalik Buterin Solutions for Ethereum - Times Tabloid",
        "content": "Shytoshi Kusama, a Shiba Inu lead Developer, recently took to his verified Twitter account to make a joke about the Woofpaper v2, comparing and contrasting its details with Buterin’s article, an article released initially by the Ethereum (ETH) founder, Vitalik Buterin.\n\nNotably, Buterin’s article contained three proposed solutions to some of Ethereum’s blockchain problems.\n\nRead Also: A Realistic Look at the Possibility for Shibarium to Send Shiba Inu (SHIB) Price to $0.001\n\n“Did you leak the Woofpaper 2 draft to VB, bro,” Kusama teased Kaal Dhairya in the caption he used in sharing an article highlighting the solutions newly presented by Buterin.\n\nAs expected, Kusama’s tweet generated reactions and speculations from Shiba Inu enthusiasts. The reason for this speculation is that the Woofpaper v2 is already live for public view. Some strong SHIB advocates opined that Shytoshi Kusama could be referring to drafts of the Woofpaper v3.\n\nSolutions To Ethereum Challenges – A Brief Insight Into Buterin’s Article\n\nThe article released by Vitalik Buterin pinpointed three things Ethereum needs to survive. Per the paper report, Ethereum must ensure the availability of these features; transition to roll-ups (layer-2), Smart contract wallets, and privacy-oriented measures to ensure it maintains its position at the top of blockchain technology.\n\nThe article highlighted how the transition to roll-ups would be significant in Ethereum’s growth, noting that it will provide substantial scaling support to empower Ethereum.\n\nAlso, Smart contract wallets got emphasized in the article. Smart contract wallets are viable options for resolving security problems. Per the report paper, deploying privacy-oriented standards could help solve investors’ privacy concerns.\n\nRead Also: Shiba Inu Team Member Releases Latest Update Regarding Shibarium Launch: Details\n\nHow Far Has Shiba Inu Gone In Addressing These Issues\n\nKusama’s reaction to Buterin’s article indicates that Shiba Inu already made provisions to solve these problems. The most notable anticipated solution is the Shibarium, the upcoming layer-2 network for Shiba Inu.\n\nScalability experienced in Ethereum appears solved due to Shibarium’s unique nature. The Layer-2 network could double as a second layer for layer-1 blockchains like Ethereum, taking some workloads off the layer-1 blockchain.\n\n<\n\nIn addition, Shibarium promises users top-notch security features by integrating proof-of-stake (PoS) validators and the Plasma framework. In users’ privacy aspect challenges, the incorporation of Bermuda, a privacy-oriented blockchain solution, would likely solve this problem.\n\nThe solutions highlighted above are the possible ways Shibarium could address the challenges highlighted in Buterin’s article; it is yet to be confirmed if Kusama hinted at more efficient measures detailed in drafts of a yet-to-be-released Woofpaper version.\n\nFollow us on Twitter, Facebook, Telegram, and Google News"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LnRoZWNvaW5yZXB1YmxpYy5jb20vMjAyMy8wNi8wOS9ldGhlcmV1bS1sMi1uZXR3b3JrLWFyYml0cnVtLXNodXRzLWRvd24tZm9yLWhvdXJzLWR1ZS10by1hLWJ1Zy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Ethereum L2 Network, Arbitrum, Shuts Down for Hours Due to a Bug - The Coin Republic",
        "content": "Outages over the blockchain network hampers general activities like transactions and operations over DeFi platforms, and more. The potential reasons for the same vary from a bug, network congestion, failure of update, etc. Out of these reasons, the Layer 2 scaling solution of Ethereum network, Arbitrum, recently got shut down for a couple of hours because of a software bug.\n\nArbitrum network users reportedly witnessed a sudden stop in mainnet transactions on Wednesday, June 7. The halt lasted for about two hours before the operations continued. Soon enough, the initial probe found a software bug behind the hindrance in the regular operations, following ‘the sequencer’ getting affected.\n\nThe developers team of Arbiturm explained in detail over Twitter about the malfunction in the sequencer, and how the bug did not let the transactions pass to the Ethereum mainnet. The automated function of refilling the wallet belonging to the node with transaction fees in ETH had also stopped. Thus, until the process resumed after a wait of two hours, the settlements piled up in abundance.\n\nIn a short period of inactivity, the activities got hampered over the network. It resulted in 2.2 Billion worth cryptocurrency transactions or movement over the Ethereum scaling network to be stopped. The decentralized applications over the blockchain like Uniswap and GMX also faced similar experiences.\n\nThe sequencer, which is a full node of Arbitrum designated and responsible to carry forward the users’ transactions to Layer 1, was said to be behind the outage over the network. This way the node becomes crucial for the transaction process over the network. One of the two wallets involved in the transaction to send it over Ethereum needs to hold ETH equivalent to transaction fees.\n\nHelping Hand for Ethereum Network\n\nBlockchain research and development company, Off Chain Labs, developed Arbitrum in 2018. The layer 2 scaling solution was aimed to burden-off the heavily loaded with activities off the Ethereum mainnet. Akin to other networks based on rollup systems, the network facilitates off-chain transactions to its users. The scaling solution currently holds total value locked (TVL) worth 2.2 Billion USD.\n\nIts Optimistic Rollup Technology empowers the solution for boosting its transactions across decentralized applications. Arbitrum network primarily collects the transactions together and makes them bundled in batches prior to forwarding it to the Ethereum network.\n\nThe network had been through the Nito upgrade in August, last year. Since the upgrade, it has had outages about eight times lasting from 30 minutes to 2 hours.\n\nUSDC Stablecoin on Arbitrum\n\nStablecoin issuer, Circle, announced the launch of its native USD Coin (USDC) stablecoin on Arbitrum. Following the upgrade, the blockchain network becomes the ninth one to support USDC. The stablecoin will continue its inherent facilities over the new network."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vd3d3LnRoZXRlY2hlZHZvY2F0ZS5vcmcvdGhlLWJlc3QtZXRoZXJldW0tZXRoLWRhcHBzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "The Best Ethereum (ETH) DApps - The Tech Edvocate",
        "content": "Spread the love\n\nEthereum (ETH) is one of the most successful platforms for decentralized applications (DApps) in the world. Developed in 2014, Ethereum has seen significant growth in adoption in recent years, thanks to the numerous DApps that run on its blockchain network. These DApps are decentralized applications that allow users to interact with each other in a trustless and transparent manner, using blockchain technology to ensure that all transactions are secure.\n\nHere are the best Ethereum DApps that you should know about:\n\n1. Uniswap: Uniswap is a decentralized exchange (DEX) that allows traders to exchange Ethereum-based tokens without a central authority controlling the platform. It is an automated market maker (AMM) DApp that uses smart contracts to ensure the trades are completed fairly and transparently. Uniswap was launched in November 2018 and has grown to become one of the most popular DEXs on the Ethereum network.\n\n2. decentralized finance (DeFi): DeFi is a decentralized financial platform that provides users with a range of financial services such as lending and borrowing money, trading, and investing in cryptocurrency without relying on a centralized authority. DeFi is a network of DApps that allow users to interact with each other directly, without intermediaries. The most popular DeFi DApps include MakerDAO, Aave, Compound, Curve, and Yearn Finance.\n\n3. Golem: Golem is a decentralized supercomputer that allows users to rent out their unused computing power to people who need it. It is a DApp that enables people with low-powered computers to gain access to the processing power of more powerful computers.\n\n4. Chainlink: Chainlink is a decentralized oracle network that provides accurate and reliable data feeds to smart contracts on the Ethereum network. Smart contracts on Ethereum rely on external data to execute, and Chainlink provides a secure and reliable source of data to ensure that the contracts execute correctly.\n\n5. CryptoKitties: CryptoKitties is a virtual pet breeding game that allows players to buy, sell, and breed virtual cats on the Ethereum network. Each cat is unique and has its attributes, making it a collectible item that can be traded on the marketplace.\n\nIn conclusion, Ethereum has become the center of the decentralized application world, thanks to its secure and transparent blockchain network. The above are just a few examples of the best Ethereum DApps currently available, and the potential for new innovative DApps is limitless. The world is moving towards decentralized systems and Ethereum provides the best platform for developers and users to build, innovate and enjoy its decentralized world."
    }
]