[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8venljcnlwdG8uY29tL2V0aGVyZXVtLWZhY2VzLWNyb3Nzcm9hZHMtYXMtc29sYW5hLWdhaW5zLWdyb3VuZC1pbi1zbWFydC1jb250cmFjdC1kb21pbmFuY2Uv0gFmaHR0cHM6Ly96eWNyeXB0by5jb20vZXRoZXJldW0tZmFjZXMtY3Jvc3Nyb2Fkcy1hcy1zb2xhbmEtZ2FpbnMtZ3JvdW5kLWluLXNtYXJ0LWNvbnRyYWN0LWRvbWluYW5jZS8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Faces Crossroads as Solana Gains Ground in Smart Contract Dominance - ZyCrypto",
        "content": "Advertisement\n\nEthereum (ETH), the once-revered pioneer in smart contract platforms, now finds itself at a crucial juncture as Solana (SOL) makes significant strides in the domain.\n\nOver the past week, the cryptocurrency community has been abuzz with discussions sparked by Solana’s 800% YTD price surge and the ecosystem’s impressive growth, with some speculating about its potential to surpass Ethereum. The ongoing debate revolves around scalability, transaction fees, and the fundamental shift from Proof of Work (PoW) to Proof of Stake (PoS) that Ethereum made.\n\nNotably, Ethereum’s troubles seem to compound, with the ultra-sound money narrative faltering as Ether (ETH) faces a 30% decline year-to-date against Bitcoin (BTC). Simultaneously, it’s losing ground to Solana on the smart contract front, as highlighted by popular trader Rip Vanwinkle on Saturday via X (formerly Twitter).\n\nAccording to Vanwinkle, Ethereum’s move from Proof of Work (PoW) to Proof of Stake (PoS) was a betrayal of its initial principles. In the tweet, he argued that the transition aimed at enriching founders and insiders by enabling them to stake ETH and profit from fees that would otherwise be burned as gas. This transition, according to him, undermined Ethereum’s core purpose as a gas token and challenged the principles of decentralization.\n\nIn response to these criticisms, Ethereum co-founder Vitalik Buterin has recently acknowledged the need for improvements, noting they are actively working on the Ethereum 2.0 upgrade. This upgrade intends to address scalability and transaction fee issues by implementing a PoS consensus mechanism. However, the success of this transition remains uncertain, leaving Ethereum vulnerable to the growing popularity of Solana.\n\nAdvertisement\n\nIt is important to note that Solana’s appeal lies in its scalability and cost-effectiveness for smart contracts. Despite lacking complete decentralization, users prioritize low fees and fast transactions over absolute decentralization.\n\nMeanwhile, the broader cryptocurrency landscape has witnessed a surge in smart contract platform tokens, with Solana and Avalanche closing in on Ethereum and Binance Coin (BNB). Notably, in terms of value, Solana has experienced a 67% surge in the past month, positioning itself as the closest contender to Ethereum which is up only 11%.\n\nAdditionally, as highlighted by ZyCrypto, Solana’s Decentralized Exchange (DEX) trading volumes surpassed those of Ethereum for the first time in history this week, holding consistently for three days. Digital asset platform Coinchange has even predicted that this trend could extend to the Total Value Locked (TVL) in DeFi in the near future.\n\nThat said, Ethereum’s fate in this evolving landscape remains uncertain as it grapples with internal challenges and external competition. It thus remains to be seen whether Ethereum can maintain its dominance as a smart contract platform."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy8zLXJlYXNvbnMtd2h5LWV0aGVyZXVtLWV0aC1wcmljZS1jb3VsZC1yYWxseS1hYm92ZS0yNTAw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "3 reasons why Ether (ETH) could rally above $2,500 - Cointelegraph",
        "content": "Ether (ETH) last approached the $2,400 resistance on Dec. 9 but failed to break through, resulting in a retest of the $2,120 support level. This time, investors are gaining confidence in surpassing this level, venturing into territory not seen since May 2022, before the collapse of the Terra ecosystem. On Dec. 22, Ether stood out with a 4% increase, while Bitcoin (BTC) and BNB (BNB) remained primarily unchanged.\n\nWhile the spotlight is on the exchange-traded fund (ETF) narrative as the primary driver of recent cryptocurrency gains, there are several reasons supporting Ether’s price surge that could potentially push it above $2,500 before the expected ETF approval in mid-January, although the United States Securities and Exchange Commission (SEC) might take until March.\n\nEthereum network DApp volumes and protocol fees\n\nRather than attempting to predict the future, which is a challenging task in the fast-paced cryptocurrency industry, it’s more prudent to analyze recent trends influencing the demand for Ether using decentralized applications (DApps) activity as an indicator. One can start by examining DApp volumes, as some sectors do not require a large total value locked (TVL), such as nonfungible token marketplaces, games, layer-2 bridges and social networks.\n\n7-day DApp volumes per blockchain in U.S. dollars. Source: DappRadar\n\nEthereum DApp volumes reached $27.8 billion in the last seven days, marking a 14.2% increase on the previous week. This growth was driven by a 21% gain in Uniswap and a 52% gain in Balancer volumes. In contrast, BNB Chain’s volumes for the same period stood at $4.5 billion, while Arbitrum amassed another $5 billion. Most notably, Ethereum was the only blockchain among the top six to experience a volume increase in the past seven days.\n\nTo provide some perspective, Solana (SOL) would need to increase by 12 times to reach half of Ethereum DApps’ current transaction volume. In general, 20% of users account for 80% of the volume, which holds for DApps. Given Ethereum’s first-mover advantage and substantial treasury for ecosystem development support, the odds do not favor a flipping in the short to medium term.\n\nFurthermore, no other blockchain can match Ethereum’s protocol, which generated $95.4 million in fees in the last seven days, excluding Bitcoin, which is not a direct competitor in the DApp ecosystem. Aside from incentivizing network security, this data indicates significant potential for increased activity following future updates, including ’DenCun’ scheduled for January, which aims to enhance processing capacity and reduce costs.\n\nEthereum spot ETF approval is not priced in according to derivatives markets\n\nThe eventual approval of the Ether spot ETF will set Ether apart from other cryptocurrencies in terms of regulation. Competitors have only been nominally mentioned by regulators in recent court cases against exchanges, which face charges for offering securities brokerage and services without proper registration.\n\nRelated: Community responds to Gary Gensler’s latest jab at crypto\n\nFinally, investors should assess the positioning of Ether derivatives traders, especially large investors and market makers. The Ether futures premium, measuring the difference between two-month contracts and the spot price, has reached its highest level in over a year. In a healthy market, the annualized premium, or basis rate, typically falls within the 5% to 10% range.\n\nEther two-month futures premium vs. spot markets. Source: Laevitas.ch\n\nThe current 13.5% Ether futures annualized premium suggests that traders are not taking the spot Ether ETF approval for granted. During widespread excitement, this indicator tends to exceed 20%, driven by increased demand for leveraged long positions, causing price distortions relative to the spot market. This data implies the potential for a positive price impact in case of approval, whether in January or March.\n\nBased on Ethereum’s network activity, Ether investors should not yield to the pressure from contenders gaining momentum, at least not until these contenders pose a genuine threat in terms of volumes and deposits. Furthermore, the ETH derivatives indicator provides clear guidance that professional traders are bullish despite Ether’s price nearing its highest level since May 2022. This suggests that investors are confident in Ether’s ability to break above $2,500.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMi8yMy9ldGhlcmV1bS1zaGliYS1pbnUtYW5kLW9uZS1hbHRjb2luLXRoYXRzLWV4cGxvZGVkLW92ZXItMjUwLWluLXR3by1tb250aHMtZmxhc2hpbmctYnVsbGlzaC1zaWduYWxzLXNhbnRpbWVudC_SAZEBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMTIvMjMvZXRoZXJldW0tc2hpYmEtaW51LWFuZC1vbmUtYWx0Y29pbi10aGF0cy1leHBsb2RlZC1vdmVyLTI1MC1pbi10d28tbW9udGhzLWZsYXNoaW5nLWJ1bGxpc2gtc2lnbmFscy1zYW50aW1lbnQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "Ethereum, Shiba Inu and One Altcoin That’s Exploded Over 250% in Two Months Flashing Bullish Signals: Santiment - The Daily Hodl",
        "content": "Cryptocurrency analytics platform Santiment is naming three digital assets that it says possess long-term bullish prospects.\n\nSantiment says that Ethereum (ETH), Shiba Inu (SHIB) and the artificial intelligence-focused crypto project Fetch.ai (FET) are witnessing a reduction of the supply held on exchanges by their top 10 holders.\n\nAccording to Santiment, the moving of the three crypto assets by the respective top 10 holders from exchanges is a “bullish long-term signal”.\n\nThe crypto analytics platform says that in the case of Fetch.ai, the top 10 largest wallets have reduced their FET holdings on exchanges by 26.1% in the last three months. The top 10 holders of Ethereum and Shiba Inu, on the other hand, have cut their holdings on exchanges by 4.3% and 2.7%, respectively, over the past 90 days.\n\nEthereum is trading at $2,306 at time of writing, while Shiba Inu is changing hands at $0.0000106. Fetch.ai is priced at $0.729 at time of writing, up by 259% from its October 23rd price of $0.203.\n\nEarlier this week, Santiment said that the supply of Ethereum on exchanges had reached a new low since the official launch of the second-largest crypto asset by market cap.\n\n“As Ethereum’s market value hangs just above $2,170, the largest exchange wallets continue to move coins into smaller wallets or off exchanges entirely. 240,000 ETH has been collectively moved from these wallets in 24 hours, a 2.99% drop in coins held.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY3J5cHRvLm5ld3MvZXRoZXJldW0tbG9uZy10ZXJtLWhvbGRlcnMtaGl0LXJlY29yZC1udW1iZXJzLXN1cnBhc3NpbmctYml0Y29pbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 24 Dec 2023 08:00:00 GMT",
        "title": "Ethereum long-term holders hit record numbers in December - crypto.news",
        "content": "The amount of Ethereum (ETH) owned by long-term holders has reached a new milestone, hitting 70% since Dec. 1.\n\nAccording to blockchain analytics firm IntoTheBlock, this is noteworthy as it puts Ethereum ahead of Bitcoin (BTC) per the same metric, which hovered just shy of 70%.\n\nThe amount of $ETH owned by long-term hodlers reached a record of over 70% in December pic.twitter.com/znKGxTAkvU — IntoTheBlock (@intotheblock) December 24, 2023\n\nSome market watchers consider the rise in the proportion of ETH held by these holders as showcasing a conviction in the cryptocurrency’s long-term potential.\n\nThe record comes amidst predictions that the time for Ethereum to outshine Bitcoin is fast approaching. On Dec. 23, well-known crypto analyst Raoul Pal reiterated an earlier prediction suggesting 2024 could see ETH and BTC repeat their 2021 cycle.\n\nIn that year, ETH went on to outpace BTC’s performance, growing by 254% to Bitcoin’s 45% after initially falling behind.\n\nFor all the ETH bears… in Feb 2021, BTC first hit $44,000 (where it is today) and ETH was at $1400 (now $2250), 9 months later ETH was up 245%, BTC was up 45%…\n\n\n\nI think ETH outperforming BTC will be a key macro trend of 2024 and our work at EXPAAM suggests it. 1/ pic.twitter.com/QGSZahhldg — Raoul Pal (@RaoulGMI) December 21, 2023\n\nPal’s outlook was mirrored in a cautiously optimistic forecast from JPMorgan analysts, who, despite their overall conservative attitude towards the crypto market, predicted ETH will outpace BTC and other digital assets in market price performance by 2024.\n\nYou might also like: Arthur Hayes forecasts Ethereum to soar above $5k in 2024\n\nThis upbeat outlook on ETH, as conveyed by Nikolaos Panigirtzoglou and his team, is tied to the significant EIP-4844 upgrade, known as protodanksharding. Set for launch in the first half of 2024, this upgrade is expected to significantly enhance Ethereum’s network performance by implementing a more efficient sharding method.\n\nDespite the current price action still lagging behind Bitcoin’s level, more analysts also feel the recent impressive performance of altcoins and L2 projects hints at an impending ETH rally, with the cryptocurrency currently priced at $2,300—a 4.3% increase over the past seven days and an 88.6% increase over 12 months.\n\nYet, Ethereum co-founder Vitalik Buterin has recently raised eyebrows by transferring 500 ETH, valued at over $1 million, to Coinbase, as per onchain analysts.\n\nThis follows a series of significant transfers made by Buterin in September and his statement in October that he hasn’t “sold Ether for personal gain since 2018.”\n\nThe recent activity in Buterin’s Ethereum wallet, including a $3.79 million transfer in ETH over ten days in September, led to speculation of him selling his crypto holding, which he later clarified as being for philanthropy rather than personal gain.\n\nFollow Us on Google News"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2JpdGNvaW4tZXRoZXJldW0tYW5kLWVpZ2VubGF5ZXItYS1wbGF5LWluLXRocmVlLWFjdHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin, Ethereum, and EigenLayer - A Play in Three Acts - CryptoSlate",
        "content": "The following is a guest post from John deVadoss, the Co-founder of InterWork Alliance.\n\nAct One: From a Crisis, A New Institution Emerges\n\nOn July 30, 2008, the United States Housing and Economic Recovery Act, intended to address the subprime mortgage crisis (which had precipitated the then ongoing Global Financial Crisis), was formally signed. Two weeks later, on Monday, August 18, 2008, the domain bitcoin.org was registered.\n\nBy November 2008, Quantitative Easing was in action, and the United States Federal Reserve had started buying mortgage-backed securities. In January 2009, the code for Bitcoin was released as open-source, and by March 2009, the Federal Reserve held close to two trillion US dollars of bank debt, mortgage-backed securities, and Treasury notes.\n\nSuppose the goal was to beta-test digital currency at scale towards disintermediating secondary and tertiary financial institutions by directly linking citizens and a central bank. In that case, Bitcoin has been a spectacular success, heralding the upcoming era of CBDCs. If the goal were to make the common man conversant with digital currencies and their usage, Bitcoin would have succeeded remarkably.\n\nA revolutionary breakthrough when it was released, Bitcoin is many things to many people: a virtual currency, a new kind of money, a store of value, and the promise of freedom. But, more than anything, Bitcoin is a new monetary institution for the digital age. Bitcoin has demonstrated that digital monetary institutions are the future; it has done its job by moving the goalposts from why to when.\n\nSome see in Bitcoin and its pseudonymous creator(s), a Robin Hood-type legend, a Zorro-like hero, or a populist protagonist standing up against the system. It is not for me to deconstruct the thematic illusions, but as the old adage goes, the truth is bound to make you smile when it arrives.\n\nAct Two: The Rise of a Monolith and its Discontents\n\nBitcoin begat Ethereum, a 21st-century application platform to rival any of Silicon Valley’s so-called enterprise-grade, global-scale platforms. And the Ethereum team did it all in the open, on with a crew of mostly volunteer developers spanning time zones and political and geo-political boundaries, long before working from home was a thing, shepherded by the genius of their founders and core developers.\n\nWhy Ethereum? Contrary to popular perception, Bitcoin is more than an application; it is more than the collection of technical capabilities that comprise the network and certainly more than a token. It is an institution, a self-governing institution. But it is not a platform. Bitcoin, when it was released, had a level of scripting extensibility, but it was not yet ready to enable developers to build new instances on top of it.\n\nEthereum, with its vision of being the world’s computer, set out to create the definitive decentralized platform abstraction, a blockchain with built-in Turing-complete programming support, allowing developers to write smart contracts and to create decentralized protocols, services, and applications. And by any measure, the Ethereum project has been stunningly successful.\n\nProgrammable money, fiat-backed stablecoins, and the digitization of real-world assets are but some of how Ethereum has reshaped the world of monetary policy. Lending/borrowing platforms, prediction markets, and insurance are some of the financial domains in which Ethereum has helped rewrite the rules for historically highly intermediated products.\n\nAs a result of its extraordinary success, scaling has turned out to be a critical issue for the Ethereum project; it is worth noting that its scalability issues result from the project’s prioritization of decentralization and security over scale. Scaling enhancements are anticipated to address network congestion and reduce transaction costs; Ethereum’s gas fee problem has been a recurring theme.\n\nThere are two primary ways to scale the Ethereum network: on-chain and off-chain. On-chain refers to enhancements to the base layer and modifications to the network. Off-chain refers to the use of a separate network(s) (so-called Layer 2) to process transactions; Layer 2 networks may choose to emphasize scale over decentralization and security as they can benefit from the base network’s strengths in these areas.\n\nNow, here is where things became very interesting. The so-called “on-chain” proponents appear to be reluctant to let go, while the “off-chain” exponents appear to be eager to innovate. This is the classic saga of a maturing platform: how much loose coupling? How much composability? And on the other side, how much to enshrine on-chain before it becomes a net detractor for innovation?\n\nFor obvious reasons, Ethereum does not want to end up primarily as a reconciliation ledger for other Layer 2 networks and roll-ups, but at the same time, a monolithic approach imposes limits on a platform and its ecosystem and impacts a platform’s ability to continue to grow its developer base. Things came to a head when Ethereum did its Merge update to Proof of Stake from Proof of Work.\n\nTrust is now a facet of staking and not mining anymore; was the value now more in the tokens and with the stakers? Or did it still lie in the underlying capabilities? And for how long? Could they be swapped out with newer, more innovative capabilities? And this leads to Act Three.\n\nAct Three: A New Economic Platform Advances\n\nEthereum begets EigenLayer, a first-of-a-kind economic platform.\n\nIn retrospect, it may appear linear, but it was genius, a first-class paradigm shift. The world may not be different with a change of paradigm, but the developer now works in a different world as they say, with a new mental model. We will look back and see a distinct transformation between decentralized applications in the Pre-EigenLayer era and those in the Post-EigenLayer era.\n\nAnd it was the Merge, with the shift to PoS that enabled EigenLayer to reframe the decentralized application model; PoW has no notion of negative incentives, but with PoS, while validators may earn rewards, their stake may also be slashed for misbehavior. With the advent of PoS, EigenLayer is able to programmatically bootstrap and scale Ethereum’s trust model to guarantee economic security for a host of new protocols and services.\n\nDevelopers can secure their services without the need to create their validators, or to launch tokens, etc. The promise of loose coupling can now be extended to economic abstractions by creating markets for decentralized trust. A fascinating three-act play thus far, it remains to be seen what act four portends.\n\nJohn deVadoss is a co-founder of the InterWork Alliance, and he serves as on the Governing Board of the Global Blockchain Business Council."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vdS50b2RheS9hbmNpZW50LWV0aGVyZXVtLXdoYWxlLWhvbGRpbmctMjY0LW1pbGxpb24taW4tZXRoLXN0aXJzLWNvbW11bml0eS1yZWFjdHPSAVxodHRwczovL3UudG9kYXkvYW5jaWVudC1ldGhlcmV1bS13aGFsZS1ob2xkaW5nLTI2NC1taWxsaW9uLWluLWV0aC1zdGlycy1jb21tdW5pdHktcmVhY3RzP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "Ancient Ethereum Whale Holding $26.4 Million in ETH Stirs, Community Reacts - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nPopular blockchain sleuth that tracks large cryptocurrency transfers and shares their details on Twitter/X with the community, Whale Alert, has reported that an ancient Ethereum wallet has come back to life after staying inactive for nearly nine years.\n\nDormant whale stirs, holding thousands of ETH\n\nThe aforementioned source spotted a pre-mine Ethereum address with 11,640 ETH worth $26,489,720 has awakened after 8.4 years, which means that it was last used in late 2014 after the Ethereum team finished raising money via its initial coin offering.\n\nSo far, the whale has transferred 500 ETH to a freshly created wallet.\n\nMeanwhile, this transaction sparked a heated discussion within the cryptocurrency community. They suggested various explanations for this whale awakening particularly now, mostly leaving sarcastic comments or assuming it could be \"paper hands.\"\n\n💤 💤 💤 A dormant pre-mine address containing 11,640 #ETH (26,489,720 USD) has just been activated after 8.4 years!https://t.co/k9g7OmWl2r — Whale Alert (@whale_alert) December 23, 2023\n\nOver the past month, several Ethereum wallets got activated after years of dormancy, selling massive amounts of ETH. In early December, the second most popular cryptocurrency Ethereum staged a rise of a whopping 10%, retaking the $2,377 price level, so many whales apparently decided to start selling their ETH stashes bought during the Ethereum ICO.\n\nBy Dec. 10, however, Ethereum made a rebound, losing the 10% it had gained, and then soared again, adding 7.38% by now. At the time of this writing, Ethereum is changing hands at $2,285. Despite all the market turbulence, the coin has managed to hold above the $2,200 level; even though it dipped a few times well below it, it is still holding above $2,000.\n\nArthur Hayes expects ETH to reach $5,000\n\nIt has been reported that BitMEX founder and its former CEO Arthur Hayes has sold his Solana (SOL) stash and bought an undisclosed amount of Ethereum. He also shared that he expects Ethereum to skyrocket to the $5,000 price mark without specifying when, at least approximately.\n\nWhile Hayes just bought ETH, an anonymous whale, according to a tweet by smart money tracker @lookonchain, has made a 433x profit on trading ETH, earning approximately $1 million. They sold 1 ETH to acquire 293.8 million OMNI and then disposed of it, gaining 176 ETH. They now hold 155 million OMNI left in their wallet and a profit of $1 million made within a single day."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMTIvMjQvd2hlbi1jYW4taS11bnN0YWtlLWV0aGVyZXVtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 24 Dec 2023 08:00:00 GMT",
        "title": "When Can I Unstake Ethereum? Understanding Ethereum Unstaking – The Crypto Basic - The Crypto Basic",
        "content": "“When can I unstake Ethereum?”, that is the question… gaining traction among crypto enthusiasts.\n\nAs cryptocurrencies continue to evolve incessantly, understanding the nuances of staking and unstaking Ethereum becomes essential, which is why this article by The Crypto Basic, your number one source for crypto news, aims to shed light on this topic, offering clarity for those navigating the intricate universe of crypto coins and staking.\n\nWhat is Staking Ethereum?\n\nStaking Ethereum refers to the process where Ethereum holders lock up their ETH to support the network’s operation; this transitioned significantly with the Ethereum network’s shift from proof-of-work (PoW) to proof-of-stake (PoS) in September 2022, known as The Merge.\n\n- Advertisement -\n\nStaking involves committing your Ethereum to the network, where it helps to secure the system and, in return, earns staking rewards.\n\nThis change aimed to enhance the network’s energy efficiency and scalability.\n\nWhat Does it Mean to Unstake Ethereum?\n\nUnstaking Ethereum is the process of withdrawing your staked ETH along with any earned rewards; it’s the reversal of staking, where you reclaim your staked Ethereum.\n\nUnstaking became possible with the completion of the Shapella upgrades (Shanghai and Capella upgrades), which followed The Merge; these upgrades allow users to retrieve their initially staked principal and unlock their staking rewards.\n\n- Advertisement -\n\nWhen Should You Unstake Ethereum?\n\nThe decision to unstake Ethereum depends on several factors, including personal investment goals and market conditions; typically, you might consider unstaking:\n\n1. When You Need Liquidity\n\nIf you require access to your staked ETH for trading or other purposes.\n\n2. When Market Conditions Are Met\n\nBased on your analysis of the crypto market, you might choose to unstake to capitalize on favorable market trends.\n\n3. When You Require a Change in Your Investment Strategy\n\nShifting your investment focus away from staking to other forms of crypto investments.\n\nThe Process of Unstaking Ethereum\n\nUnstaking Ethereum is a process that requires careful consideration due to its irreversible nature; here’s what you need to know:\n\n1. Irreversible Requests\n\nOnce you submit an unstaking request, it cannot be canceled, i.e., your ETH in the unstaking process cannot be traded, transferred, or restaked.\n\n2. Rewards During Unstaking\n\nThere’s no guarantee that ETH will continue earning new rewards during the unstaking period.\n\n3. Timeline\n\nUnstaking typically takes around 10 days, depending on network conditions and the number of users unstaking simultaneously.\n\n4. Reward Unlocking\n\nPost-Shapella upgrade, existing ETH staking rewards automatically go through an unlocking process, making them available without requiring an unstaking request.\n\nTechnical Aspects of Unstaking Ethereum\n\nUnderstanding the technicalities behind unstaking is crucial, and here’s why:\n\n1. The Shapella Upgrades\n\nThe Shapella upgrades made unstaking feasible on the Ethereum network by introducing changes to both the Execution Layer (“Deneb”, where smart contracts and transactions occur) and the Consensus Layer (“Cancun”, where network security and validator operations take place).\n\n2. Types of Unstaking\n\nEthereum supports both full and partial unstaking: full unstaking involves exiting the active validator set and receiving the initial stake plus accrued rewards; partial unstaking happens automatically when a validator’s balance exceeds 32 ETH, where the excess amounts are sent to the validator’s address.\n\n3. Exit Process\n\nExiting the validator set is a prerequisite for full unstaking; the time it takes to exit depends on the number of validators in the queue.\n\nThe process includes a cooldown period post-exit before the ETH can be unstaked.\n\nPlatform-Specific Unstaking Procedures\n\nDifferent platforms have distinct procedures for unstaking Ethereum; for instance, on Kraken:\n\nNavigate to the ‘Earn’ section after signing in; Select Ethereum (ETH) from the list of assets and choose ‘Unstake’; Enter the amount to be unstaked and confirm the process; The unstaked amount will appear as ‘Pending’ in the Portfolio tab until the end of the lockup period.\n\nRisks and Considerations in Unstaking Ethereum\n\nUnstaking Ethereum is not without risks and considerations, including:\n\n1. Market Volatility\n\nThe value of Ethereum can fluctuate significantly during the unstaking period.\n\n2. Loss of Staking Rewards\n\nOnce you unstake, you forfeit potential future staking rewards.\n\n3. Network Congestion\n\nHigh demand for unstaking can lead to delays in processing requests.\n\nKeeping Up with Ethereum and Crypto Trends\n\nStaying updated with the latest trends and news in cryptocurrencies is vital for anyone engaged in staking or other crypto-related activities.\n\nFor the most recent updates and insights in the world of cryptocurrencies, The Crypto Basic is your go-to source."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9jcnlwdG9jdXJyZW5jaWVzL25ld3MvZXRoZXJldW0tcHJpY2UtY291bGQtY3J1bWJsZS11bmRlci1yaXNpbmctc2VsbGluZy1wcmVzc3VyZS0yMDIzMTIyMzExMzPSAXpodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy9ldGhlcmV1bS1wcmljZS1jb3VsZC1jcnVtYmxlLXVuZGVyLXJpc2luZy1zZWxsaW5nLXByZXNzdXJlLTIwMjMxMjIzMTEzMw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "Ethereum price could crumble under rising selling pressure - FXStreet",
        "content": "The dates are subject to change if any unexpected bugs are discovered by developers. In the recent All Core Developers Consensus (ACDC) call, devs agreed to reconvene to discuss progress in the next meeting on January 4.\n\nBased on on-chain data from Santiment, Ethereum supply on exchanges as a percentage of Ether’s total supply climbed from 8.07% to 8.16%. The increase in ETH tokens on the exchange platform is significant in comparison to the past three months, seen in the chart below. Mounting selling pressure could push ETH price lower.\n\nEthereum supply on exchanges noted a considerable increase between December 21 and Saturday. As ETH reserves in exchange wallets climb, there is more Ether available to sell, typically increasing the selling pressure on the altcoin .\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi1hcy1iZWFyLXRyYXAtcG9pbnRzLXRvLTEwLXN1cmdlL9IBW2h0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi1hcy1iZWFyLXRyYXAtcG9pbnRzLXRvLTEwLXN1cmdlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction as Bear Trap Points to 10% Surge Ahead - CoinGape",
        "content": "Ethereum Price Prediction: The recent volatility in the crypto market takes a bullish turn this week as market sentiments show optimism for the nearing deadline of the U.S. Securities and Exchange Commission’s (SEC) decision to spot Bitcoin ETF Thus, the second largest cryptocurrency Ethereum(ETH) has been rising for the past three days, reclaiming the recently lost support of channel pattern and 20-day EMAs. Will this counterattack push the Ether price to $2500?\n\nAlso Read: Ethereum (ETH) Price Eyeing Rally to $2,700 Amid Strong Exchange Outflows\n\nadvertisement\n\nHere’s Why the Next Leap Could Push ETH to $2500\n\nThe ETH Price reentering the channel pattern should offer buyers with additional support to rally.\n\nA healthy retracement in ETH price hints a strong bounce is likely\n\nThe intraday trading volume in Ether is $16.4 Billion, indicating a 22% gain.\n\nThe last ten weeks’ recovery in Ethereum price can be traced using a rising channel pattern. The lower trendline of this channel offered strong pullback support to buyers, assisting them in prolonging the recovery trendline.\n\nHowever, amid the third week of sell-off in the crypto market, the ETH price gave a bearish breakdown from the pattern’s lower support. This lost surge was expected to surge selling pressure and trigger an aggressive correction.\n\nHowever, the buyers made a counterattack with a higher volume and reentered the channel pattern. With an intraday gain of 4.5%, the ETH price is now trading at $2341 and marked the prior breakdown as a bear trap.\n\nThus, the traders with sellers with tight stop loss may face forced liquidation and pour additional buying orders into the market. If the coin price manages to show sustainability above the reclaimed support, the buyers may drive a 10% rally to revisit the upper trendline near $2500.\n\nFunding Rates Surge Signals Confidence in a Climb to $2,500\n\nThe recent upward trend in Ethereum has been accompanied by a noteworthy increase in Ethereum Funding Rates, indicating a widespread expectation among traders for further gains, with a target of $2,500 in sight. Data from Coinglass, a prominent tracker of cryptocurrency derivatives, shows that the ETH Funding Rates surged to an impressive 0.045% last Friday. This increase in funding rates signals that traders are leaning bullish on the asset, willing to pay a premium to hold long positions. This optimistic sentiment can create a self-reinforcing effect, as the higher funding rates may attract more traders to enter long positions, expecting the price to climb\n\nBollinger Band: The narrow range in the Bollinger Band indicator reflects increasing volatility in the market.\n\nAverage Directional Index: The daily ADX slope at 24% hints the buyers have enough steam to lead a further rally."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMi8yMy9icmFjZS1mb3ItYS1zdHJvbmctcmFsbHktdHJhZGVyLXNheXMtZXRoZXJldW0tcml2YWwtaGFzLWVudGVyZWQtYnVsbGlzaC16b25lLWNvdWxkLXN1cmdlLWJ5LWRvdWJsZS1kaWdpdHMv0gGPAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzEyLzIzL2JyYWNlLWZvci1hLXN0cm9uZy1yYWxseS10cmFkZXItc2F5cy1ldGhlcmV1bS1yaXZhbC1oYXMtZW50ZXJlZC1idWxsaXNoLXpvbmUtY291bGQtc3VyZ2UtYnktZG91YmxlLWRpZ2l0cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "‘Brace for a Strong Rally’ – Trader Says Ethereum Rival Has Entered Bullish Zone, Could Surge by Double Digits - The Daily Hodl",
        "content": "Cryptocurrency analyst and trader Ali Martinez is expressing bullish sentiment on an Ethereum (ETH) competitor based on price action.\n\nMartinez tells his 36,800 followers on the X social media platform that Fantom (FTM) managing to overcome and stay above a key resistance level “marks a significant bullish turn” for the smart contract-enabled blockchain platform’s native token.\n\nAccording to Martinez, FTM has the potential to surge by about 35% from the current level to around $0.65.\n\n“As long as FTM stays above this crucial level [of $0.47], brace for a strong rally!”\n\nPer a chart citing data from blockchain analytics platform IntoTheBlock, 99.21% of investors and traders who bought FTM at between $0.399 and $0.542 are in profit while only 0.76% are underwater.\n\nFantom is trading at $0.482 at time of writing, up by over 60% over the past 30 days.\n\nNext up is the Ethereum scaling solution Polygon (MATIC). Martinez says that Polygon has an enormous resistance zone to overcome.\n\n“Polygon is currently up against a tough supply wall, ranging from $0.79 to $0.84. In this zone, around 39,000 addresses are holding over 4.24 billion MATIC.\n\nFor MATIC to embark on a journey to new heights, it’s crucial to break through this level with conviction.”\n\nMATIC is trading at $0.855 at time of writing, up by 7% over the past 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ob3ctdG8tdXNlLXRoZS1wb2x5Z29uLWJyaWRnZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "How to use the Polygon Bridge - Cointelegraph",
        "content": "The Polygon Bridge facilitates seamless asset transfers between different blockchain networks, enabling users to navigate diverse ecosystems and leverage decentralized finance (DeFi) opportunities.\n\nWhat is the Polygon Bridge?\n\nPolygon blockchain is an Ethereum layer-2 scaling solution. The Polygon Bridge is a cross-chain interoperability channel assisting interchain communication between different blockchains to Ethereum and vice versa.\n\nThe Polygon Network also provides resources for developing scalable decentralized applications (DApps). Polygon enables the quick and easy deployment of DApps to well-known DeFi platforms such as SushiSwap, Aave and Curve.\n\nSince Polygon transactions are faster and cheaper than Ethereum transactions, users and DApp developers opt for digital asset migration via the Polygon Bridge. But how fast is the Polygon Bridge? While the Ethereum network can handle 14 transactions per second (TPS), the Polygon Bridge facilitates up to 65,000 TPS.\n\nHow does the Polygon Bridge work?\n\nPolygon Bridge operates on a trustless, dual-consensus architecture to maximize efficiency and decentralization. It uses a single-token architecture and allows arbitrary state transitions on Ethereum Virtual Machine (EVM)-compatible sidechains.\n\nThe Polygon network has two bridges — the Plasma Bridge and the proof-of-stake (PoS) Bridge — to validate transactions. The cheapest way to bridge Ether (ETH) to Polygon is via the PoS Bridge.\n\nThe Plasma Bridge utilizes Ethereum Plasma’s scaling technology to enhance transfer security. It can handle transfers of native tokens such as Polygon’s MATIC (MATIC) and some Ethereum tokens, such as ETH, ERC-20 and ERC-721.\n\nOn the other hand, the PoS Bridge relies on a PoS consensus for its network security. While withdrawals may take time to confirm, Polygon processes deposits instantly. Users can use the PoS Bridge to transfer most ERC tokens and Ether. For the PoS Bridge, withdrawals can take from 45 minutes to three hours, while for the Plasma Bridge, it can take up to seven days.​\n\nTokens will continue circulating if they cross over the Polygon Bridge since the circulating supply of the token will not change. In short, when a user transfers tokens from the Ethereum network to the Polygon network, they remain locked.\n\nThe number of tokens created on the Polygon network will equal those created on the Ethereum network (token wrapping). Polygon will burn the pegged tokens while bridging the tokens back to Ethereum, unlocking the tokens on Ethereum.\n\nWhy use Polygon Bridge\n\nDue to its widespread use, Ethereum often faces considerable network congestion from the substantial volume of transactions. The Polygon sidechain provides a layer-2 scaling solution for Ethereum transactions, making it easier, faster and cheaper to access the network and transfer crypto assets between platforms.\n\nMoreover, Polygon Bridge’s utility lies in enhancing interoperability, reducing transaction costs and accelerating transaction speeds, thereby providing users with a more efficient and cost-effective means of transferring assets across networks. Additionally, it opens up opportunities for utilizing diverse DApps and accessing various financial services available on both the Ethereum and Polygon chains.\n\nHow to transfer assets from Ethereum to Polygon via the PoS Bridge\n\nA user needs a compatible crypto wallet to transfer assets from Ethereum to Polygon. Polygon supports several wallets, chiefly MetaMask, Coinbase, Bitski and Venly. In this article, we’ll be using the MetaMask wallet to explain below the step-by-step process of using the Polygon Bridge:\n\nStep 1: Click the “Polygon Bridge” icon to log in to the Polygon wallet suite.\n\nStep 2: Connect to the MetaMask crypto wallet by scanning the QR code with your smartphone.\n\nStep 3: Click “Connect” on the smartphone to confirm the connection.\n\nStep 4: Once you’ve successfully linked to the wallet, the page will redirect you to the Polygon Bridge interface.\n\nStep 5: Click the “Bridge” button on the left to transfer assets from the Ethereum mainnet to Polygon.\n\nStep 6: Select a token to use for the bridge by clicking its name. After entering the desired amount, click the “Transfer” icon. Deposits take about seven to eight minutes.\n\nStep 7: Carefully review all the transaction details, including the token transfers and estimated cost, before clicking “Continue.”\n\nStep 8: Verify the deposit’s estimated gas fees, and if you’re satisfied, click “Continue.”\n\nStep 9: In the MetaMask wallet, you can review the transaction’s details, but you must click “Confirm” to sign and approve the transfer.\n\nStep 10: You have to wait for the tokens to appear in your Polygon wallet. The transaction can be tracked by clicking on “View on Polygonscan” in the MetaMask wallet.\n\nHow to bridge MATIC tokens from the Polygon network to the Ethereum blockchain via the PoS Bridge\n\nBefore transferring assets between the Polygon PoS Bridge and the Ethereum blockchain, users must map tokens between the platforms using the Polygon Token Mapper.\n\nOnce that’s done, follow these steps to use the PoS bridge, utilizing MetaMask:\n\nStep 1: On the “Bridge” interface, click “Withdrawal.”\n\nStep 2: You must choose the token you want to transfer to the Ethereum network.\n\nStep 3: You can click the “Switch Bridge” option beside the “Transfer Mode” to choose a compatible transfer bridge, although the PoS Bridge will automatically select the default option for transferring tokens from Polygon to Ethereum. In this case, choose the PoS Bridge.\n\nStep 4: Enter the desired amount and click “Transfer.”\n\nStep 5: Click “Continue” after reviewing the transaction’s details.\n\nStep 6: Review the “Transfer Overview” prompt and projected gas fees. If the charges are acceptable, click “Continue.”\n\nStep 7: Evaluate the transaction details once again and click “Confirm” if satisfied.\n\nStep 8: Sign and approve the transfer to the Polygon Bridge MetaMask wallet. Ensure all the details are correct before clicking the “Confirm” button.\n\nStep 9: The transfer progress will appear. The withdrawal process could take up to three hours to allow PoS validators to verify the transaction.\n\nStep 10: Click “Continue” to transfer the assets to the MetaMask wallet. After logging in to the wallet, click “Import Tokens” after the validation and completion of the withdrawal.\n\nHow to bridge MATIC tokens from the Polygon network to the Ethereum blockchain via the Plasma Bridge\n\nTo bridge MATIC tokens from the Polygon network, users should initially integrate the Polygon network into their wallet. If using MetaMask, access the wallet, incorporate Polygon, or utilize the Polygon Wallet interface to integrate MetaMask.\n\nThen, follow the steps below to bridge MATIC to Ethereum through the Plasma Bridge:\n\nStep 1: Navigate to the “Bridge” interface and select “Withdraw.” Select “Matic Token” from the drop-down menu, enter the amount, and click “Transfer.” The system automatically chooses Plasma Bridge when clicking “Transfer.”\n\nStep 2: Read the notification labeled “Important.” The interface will display the transaction’s estimated gas fee. Click “Continue” if the gas fee estimate is satisfactory. Double-check the transaction details.\n\nStep 3: A MetaMask pop-up will appear, asking you to approve the transaction. When you click “Confirm,” the transfer will commence.\n\nStep 4: Wait for the checkpoint as validators confirm the transaction. This may take three hours.\n\nStep 5: Unlike the PoS Bridge, this transfer requires a second confirmation on arrival at the “Checkpoint.” After the second confirmation, click “Continue” to start the mandatory seven-day “Challenge Period.”\n\nStep 6: Once the “Challenge Period” ends validating the transaction, select “Continue” to claim and send the MATIC tokens to the MetaMask wallet.\n\nIt is crucial to note that the Plasma Bridge also works with ERC-721 tokens.\n\nBenefits of utilizing the Polygon Bridge for cross-chain transactions\n\nUtilizing the Polygon Bridge for cross-chain transactions offers a spectrum of advantages. It presents a cost-effective and rapid solution, minimizing transaction fees and congestion experienced on the Ethereum network.\n\nWith seamless interoperability, it facilitates smooth asset transfers across diverse blockchains, amplifying accessibility to decentralized finance opportunities. The bridge enhances scalability by mitigating network bottlenecks and empowering users with faster transaction speeds.\n\nMoreover, it fosters a secure environment, leveraging the robustness of Polygon’s architecture to ensure the integrity of cross-chain transactions. Overall, the Polygon Bridge stands as an efficient, economical and secure conduit for navigating between blockchain networks, enabling a more inclusive and streamlined decentralized ecosystem.\n\nRisks of utilizing bridges for cross-chain transactions\n\nThere are risks associated with using cross-chain bridges in decentralized ecosystems. These bridges might have security flaws that expose assets to risks such as network intrusions or smart contract exploits. Complexities in interoperability may cause delays in transactions, inconsistent chains or even the loss of assets in transfers.\n\nMoreover, depending on several networks makes one more vulnerable to network congestion or problems associated with it, which can affect transaction costs and speeds. The dynamic nature of blockchain technology and regulatory uncertainties present additional obstacles that could impact the functionality of cross-chain bridges.\n\nIn some cases, bridges may face liquidity issues, making it difficult to move large amounts of assets quickly. When conducting cross-chain transactions, users must be cautious, recognize these risks, and take appropriate precautions, just like with any newly developed technology.\n\nThe future of cross-chain bridges\n\nThe future of cross-chain bridges appears promising, poised for evolution and integration across diverse blockchain ecosystems. Improvements in interoperability, smooth asset transfers and network friction reduction are expected to be the main areas of focus.\n\nMoreover, technological innovations have the potential to simplify user experiences, lower costs, and introduce more efficient protocols. In addition, anticipate more security measures to strengthen these bridges and guarantee dependability and trust when transferring assets.\n\nCross-chain bridges will be essential in promoting cooperation, opening up decentralized finance applications, and increasing the opportunities for users to easily engage across multiple blockchains as the blockchain landscape develops."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vdS50b2RheS9uYXJyYXRpdmUtc2hpZnQtYXdheS1mcm9tLWV0aC1pbnZlc3Rvci1qdXN0aW4tYm9ucy1vbi1ub24tZXZtLWwxc9IBVWh0dHBzOi8vdS50b2RheS9uYXJyYXRpdmUtc2hpZnQtYXdheS1mcm9tLWV0aC1pbnZlc3Rvci1qdXN0aW4tYm9ucy1vbi1ub24tZXZtLWwxcz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "'Narrative Shift Away From ETH': Investor Justin Bons on Non-EVM L1s - U.Today",
        "content": "Advertisement\n\nIn Q4, 2023, the cryptocurrency segment is going through \"awesome\" processes as mainstream narratives are moving toward truly scalable L1s, a seasoned cryptocurrency expert says. Did EVM L2s fail to deliver on their promises?\n\nSOL, AVAX, NEAR, EGLD: Justin Bons indicates \"narrative shift\" and L2s' failure\n\nThe blockchain sphere is witnessing a major \"narrative shift\" nowadays. Instead of Ethereum (ETH), all eyes are on its L1 competitors, Cyber Capital CIO Justin Bons says in a recent X post.\n\nWhat is happening in cryptocurrency now is awesome\n\n\n\nThere has been a narrative shift away from ETH in favor of scalable L1s such as SOL, AVAX, NEAR & EGLD\n\n\n\nValidating the criticisms of ETH's \"L2 scaling\" roadmap\n\n\n\nThe future is so bright as the blockchain trilemma has been solved! — Justin Bons (@Justin_Bons) December 22, 2023\n\nScalable first-layer blockchains like Solana (SOL), Avalanche (AVAX), Near Protocol (NEAR) and MultiverseX (formerly Elrond, EGLD) are beneficiaries of this shift.\n\nThis process is validating Ethereum's (ETH) strategy to bet on Layer 2 solutions (rollups) as a core scaling instrument, Bons concluded.\n\nAs a result of this shift, the \"blockchain trilemma\" may have finally been solved. As covered by U.Today previously, in his earliest statements, Bons appreciated the scaling opportunities of Tezos (XTZ) and The Open Network (TON).\n\nThe Cyber Capital CIO is an adamant critic of the current state of Bitcoin (BTC), Ethereum (ETH) and its L2s as well as XRP.\n\nNew Solana (SOL) summer catalyzed by retro airdrops?\n\nAccording to his views, these assets lack security and decentralization. Also, he stressed that a blockchain should make its L1 scalable instead of relying on rollups and sidechains.\n\nSolana (SOL) as a dangerous Ethereum (ETH) competitor is yet again in the spotlight for analysts in December 2023. As the blockchain exceeded Ethereum (ETH) in DEX trading and NFT sales, experts recall its 2021 rally to three-digit zones.\n\nAt the same time, the interest in Solana (SOL) is triggered by the activity of retroactive airdrop farmers. Inspired by Jito Network's (JTO) generous rewards, they are completing tasks to be eligible for Jupiter, Orca and other potential airdrop campaigns expected in Q1, 2024."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMi8yNC92ZXRlcmFuLXRyYWRlci1wZXRlci1icmFuZHQtd2l0aGRyYXdzLWJlYXJpc2gtb3V0bG9vay1vbi1ldGhlcmV1bS1zYXlzLXNvbGFuYS1jYW4tY29udGludWUtdHJlbmRpbmctaGlnaGVyL9IBkAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMi8yNC92ZXRlcmFuLXRyYWRlci1wZXRlci1icmFuZHQtd2l0aGRyYXdzLWJlYXJpc2gtb3V0bG9vay1vbi1ldGhlcmV1bS1zYXlzLXNvbGFuYS1jYW4tY29udGludWUtdHJlbmRpbmctaGlnaGVyL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 24 Dec 2023 08:00:00 GMT",
        "title": "Veteran Trader Peter Brandt Withdraws Bearish Outlook on Ethereum, Says Solana Can Continue Trending Higher - The Daily Hodl",
        "content": "Seasoned trader Peter Brandt says he’s no longer expecting the leading altcoin Ethereum (ETH) go on a big move to the downside.\n\nLast week, Brandt told his 707,300 followers on the social media platform X that he was shorting Ethereum, predicting that ETH could tumble to as low as $650.\n\nIn an update, the veteran trader says that circumstances have changed and he’s no longer bearish on the top altcoin as ETH has managed to move above the resistance of an ascending triangle pattern.\n\n“Strong opinions, weakly held. When circumstances change, my opinion changes.\n\nMy recent appraisal of ETH called for an immediate price collapse – that has not happened. I have withdrawn my bearish outlook based on chart structure.”\n\nAt time of writing, Ethereum is trading for $2,316, still above the pattern’s resistance.\n\nLooking at Ethereum rival Solana (SOL), the seasoned analyst says that while the altcoin has already met his upside target, it is still within the realm of possibility for the coin to continue going up.\n\n“The log scale target of $86.48 of Solana SOL/USD has been met. Of course, prices can trend well beyond target levels.”\n\nAt time of writing, Solana is trading for $111.55, up about 56% in the last seven days.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/sdecoret/monkographic"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtc2F3LTg1LWdyb3d0aC1pbi0yMDIzLWJ1dC10aGVyZS1pcy1zdGlsbC1tYWpvci1wcm9ibGVt0gFXaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtLWV0aC1zYXctODUtZ3Jvd3RoLWluLTIwMjMtYnV0LXRoZXJlLWlzLXN0aWxsLW1ham9yLXByb2JsZW0_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 24 Dec 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) Saw 85% Growth in 2023, but There Is Still Major Problem - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum has seen an 85% increase in market cap in 2023. While this growth is substantial, it slightly underperforms compared to other major assets in the blockchain space. Despite the much-anticipated upgrades, ETF applications and robust adoption metrics, Ethereum faces a critical challenge that undermines its competitive edge: its Layer 1 (L1) scalability.\n\nAdvertisement\n\nThe scalability issues and high transaction fees of Ethereum's L1 have stifled the growth potential of its DeFi ecosystem. While Ethereum has long been the leading platform for decentralized applications, its inability to efficiently scale has led to exorbitant fees and slower transaction times, causing frustration for both developers and regular users.\n\nEthereum grew ~85% in market cap in 2023, slightly underperforming other major assets despite upgrades, ETF applications and showing robust adoption metrics. pic.twitter.com/cdvV085cxz — IntoTheBlock (@intotheblock) December 23, 2023\n\nOn the other hand, Solana has been making significant strides, boasting a growth pace that starkly outshines Ethereum. With its promise of high throughput and low transaction costs, Solana is rapidly gaining traction. It has positioned itself as a more scalable and cost-effective blockchain, attracting a burgeoning number of DeFi projects and users. This has allowed Solana to carve out a substantial market share, positioning itself as a formidable competitor to Ethereum.\n\nSimilarly, networks like Avalanche have demonstrated the critical importance of scalability in the blockchain trifecta of decentralization, security and scalability. Avalanche's growth has been bolstered by its high-performance capabilities, which cater to the demands of modern-day applications seeking swift and affordable transactions.\n\nThe scaling issue looms large over Ethereum's future prospects. If not addressed with urgency and efficiency, Ethereum risks losing its pioneering status in DeFi to more agile and scalable competitors. The race is on for Ethereum to deliver on its scaling promises, as the growth of its market cap alone is not a sufficient indicator of its long-term viability in an increasingly competitive landscape."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMi8yMy9ldGhlcmV1bS1ldGgtcHJpbWVkLXRvLW91dHBlcmZvcm0tYml0Y29pbi1idGMtaW4tMjAyNC1hY2NvcmRpbmctdG8tbWFjcm8tZ3VydS1yYW91bC1wYWwtaGVyZXMtd2h5L9IBhwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMi8yMy9ldGhlcmV1bS1ldGgtcHJpbWVkLXRvLW91dHBlcmZvcm0tYml0Y29pbi1idGMtaW4tMjAyNC1hY2NvcmRpbmctdG8tbWFjcm8tZ3VydS1yYW91bC1wYWwtaGVyZXMtd2h5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) Primed To Outperform Bitcoin (BTC) in 2024, According to Macro Guru Raoul Pal – Here’s Why - The Daily Hodl",
        "content": "Former Goldman Sachs executive Raoul Pal is predicting that Ethereum (ETH) will outperform Bitcoin (BTC) in 2024.\n\nThe Real Vision CEO tells his one million followers on the social media platform X that Ethereum against Bitcoin (ETH/BTC) may repeat a similar 2021 bull market price pattern next year.\n\n“For all the ETH bears, in February 2021, BTC first hit $44,000 (where it is today) and ETH was at $1,400 (now $2,250). Nine months later ETH was up 245%, BTC was up 45%. I think ETH outperforming BTC will be a key macro trend of 2024 and our work at EXPAAM (Exponential Age Asset Management) suggests it.”\n\nETH/BTC is trading for 0.05288 BTC ($2,314) at time of writing.\n\nThe analyst believes that more favorable macroeconomic conditions for risk assets like Ethereum are on the horizon that will send ETH soaring similar to the way it did two years ago.\n\n“It’s all about liquidity and the business cycle leading the risk curve. Narrative follows.”\n\nThe analyst also says he believes that ETH competitor Solana (SOL) will outperform Ethereum in 2024.\n\nWhen asked by a social media user, “Do you think ETH will somehow outperform SOL in 2024?” Pal answered, “No.”\n\nSOL/ETH is trading for 0.0419 ETH ($97.01) at time of writing. SOL has surged from $9.99 at the beginning of the year, a more than 871% gain from its current value.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMi8yNC90b3AtYW5hbHlzdC1mbGlwcy1idWxsaXNoLW9uLWV0aGVyZXVtLWxheWVyLTItYWx0Y29pbi1zYXlzLWNsZWFyLXNraWVzLWFoZWFkLWZvci1vbmUtZGVmaS1jcnlwdG8v0gGGAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzEyLzI0L3RvcC1hbmFseXN0LWZsaXBzLWJ1bGxpc2gtb24tZXRoZXJldW0tbGF5ZXItMi1hbHRjb2luLXNheXMtY2xlYXItc2tpZXMtYWhlYWQtZm9yLW9uZS1kZWZpLWNyeXB0by9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 24 Dec 2023 08:00:00 GMT",
        "title": "Top Analyst Flips Bullish on Ethereum Layer-2 Altcoin, Says Clear Skies Ahead for One DeFi Crypto - The Daily Hodl",
        "content": "A crypto strategist who nailed the top of the Bitcoin (BTC) bull market in 2021 believes that one Ethereum (ETH) scaling solution that’s trading under the radar will see a burst to the upside.\n\nPseudonymous crypto strategist Pentoshi tells his 727,200 followers on the social media platform X that he’s bullish on Arbitrum (ARB).\n\nAccording to the analyst, ARB will likely receive a shot in the arm if it manages to take out its immediate resistance at $1.70.\n\n“I think it needs to get over $1.70 to really get anyone excited. Has a great shot at trading up there near term.”\n\nAt time of writing, ARB is trading for $1.38.\n\nThe analyst is also keeping an eye on Injective (INJ), a decentralized exchange that aims to offer a variety of financial products including spot trading and futures. According to Pentoshi, it’s clear skies for INJ as there is no resistance left to stop the altcoin from price discovery.\n\n“This is one of the craziest charts in the entire space, and currently in price discovery. So right now it’s clear skies. I don’t know if you get it, but I think under $30 is a buy if given the chance.”\n\nAt time of writing, INJ is trading for $42.14.\n\nThe analyst is also looking at Optimism (OP), another layer-2 altcoin. According to Pentoshi, OP also has no known resistance left after breaking its recent all-time high at around $3.29.\n\n“About to begin price discovery… Often around discovery is a great time to buy as it’s likely to have continuation after some consolidation.”\n\nAt time of writing, OP is worth $3.42.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMi8yMy9uZXctbG93cy1pbmNvbWluZy1mb3ItYml0Y29pbi1ldGhlcmV1bS1hbmQtYWx0Y29pbnMtd2FybnMtYW5hbHlzdC13aG8tbmFpbGVkLXRoZS0yMDIyLWNyeXB0by1jb2xsYXBzZS_SAYsBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMTIvMjMvbmV3LWxvd3MtaW5jb21pbmctZm9yLWJpdGNvaW4tZXRoZXJldW0tYW5kLWFsdGNvaW5zLXdhcm5zLWFuYWx5c3Qtd2hvLW5haWxlZC10aGUtMjAyMi1jcnlwdG8tY29sbGFwc2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "New Lows Incoming for Bitcoin, Ethereum and Altcoins, Warns Analyst Who Nailed the 2022 Crypto Collapse - The Daily Hodl",
        "content": "A widely followed crypto trader is warning that Bitcoin (BTC) and other altcoins could soon make an abrupt trend reversal toward new lows.\n\nPseudonymous trader and crypto bear Capo tells his 781,400 followers on the social media platform X that Bitcoin could soon revisit the low $30,000s and bring a sudden market correction to alts after they rally one more time.\n\n“As posted on TG (Telegram) a few days ago, BTC is probably forming a local top here at $40,000-$45,000. ETH could reach $2,500s, and some alts could have the last pumps. After this, a full reversal to new lows is likely over the next few weeks…\n\nI believe new lows are still to come before the real bull market begins.”\n\nThe trader elaborates on his reasoning in a thread about why “we might still see new lows over the coming months.”\n\n“Let’s start with BTC on HTF (high timeframe). We have seen a bullish trend during 2023. Many think that this is the start of a new bull market, but in my opinion, this is a corrective move. Now the price is at a major resistance zone. Confirmations are on the chart.”\n\nHe uses the Elliott Wave theory, which attempts to forecast price movements based on crowd psychology that is manifested in waves. The Elliott Wave theory suggests that price impulses happen in five waves after three-wave “ABC” corrections.\n\n“BTC EW (Elliott Wave) perspective: the bearish trend during 2022 was an impulsive move that broke the 2020-2021 bull market trend. Now, the move from the $16,000 low looks like a corrective move (wave B/X). This move tends to be followed by another impulsive move (wave C/Y).”\n\nLooking at Ethereum, the trader predicts that ETH could decline as low as $550 after facing resistance at around the $2,600 level.\n\n“[ETH] has broken a key level and the next major resistance is $2,500-$2,600. It has a lot of liquidity below that should be taken eventually. The bearish confirmation would be a clean break below $2,000-$2,100.”\n\nHe suggests other altcoins are surging from an inflow of money from Bitcoin sales, which he says often indicates a market correction is coming soon.\n\n“Money is flowing from BTC to altcoins. This usually happens during the last phases of a bullish trend. Some altcoins could pump more, but the trend is overextended and reaching to an end. When OTHERS (altcoins index) reaches the green zone, we should see a strong correction.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1raWxsZXItc29sYW5hLXNvbC1yZWNvcmRzLXdob3BwaW5nLTMwMC1ncm93dGgtYWdhaW5zdC1ldGjSAVZodHRwczovL3UudG9kYXkvZXRoZXJldW0ta2lsbGVyLXNvbGFuYS1zb2wtcmVjb3Jkcy13aG9wcGluZy0zMDAtZ3Jvd3RoLWFnYWluc3QtZXRoP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 24 Dec 2023 08:00:00 GMT",
        "title": "'Ethereum Killer' Solana (SOL) Records Whopping 300% Growth Against ETH - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a remarkable turn of events, the Solana token (SOL), initially hailed as the \"Ethereum killer\" over two years ago, has solidified its reputation by recording an extraordinary 300% surge against Ethereum (ETH) in the past couple of months.\n\nAdvertisement\n\nThe crypto market has witnessed a paradigm shift as SOL's value soared by an astonishing 440%, hitting a pinnacle of $118.3 — a milestone not seen since April 2022.\n\nDuring the same period, the SOL/ETH price graph exhibited an unparalleled ascent, reaching 0.051 ETH per Solana token. This surge has not been observed since December 2021, and the trend shows no sign of abating.\n\nNotably, as Solana experienced this meteoric rise, Ethereum remained relatively stagnant, prompting speculations that the era of Ethereum dominance may be waning.\n\nFlippening, but Solana flips Ethereum\n\nAnalysts have begun to question whether Solana is poised to dethrone Ethereum permanently. The media landscape is buzzing with discussions about a potential shift in the cryptocurrency hierarchy, with some suggesting that ETH may be consigned to the past while Solana charts the future.\n\nEven as Ethereum exhibited modest growth in response to the market dynamics, Solana's remarkable rally has left it 20% away from its all-time high relative to Ethereum's price.\n\nThe lingering question now is whether Solana can fulfill its moniker as the \"Ethereum killer\" and establish a new all-time high. ETH, on the other hand, faces the challenge of recovering from the recent weeks' lag.\n\nWith Solana's newfound prominence, market observers are contemplating whether the cryptocurrency landscape is witnessing a default shift toward the innovative blockchain platform."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vdS50b2RheS9kb2dlY29pbi1mb3VuZGVyLXNwYXJrcy11bmJlbGlldmFibGUtZXRoZXJldW0tc29sYW5hLWZhY2Utb2Zm0gFRaHR0cHM6Ly91LnRvZGF5L2RvZ2Vjb2luLWZvdW5kZXItc3BhcmtzLXVuYmVsaWV2YWJsZS1ldGhlcmV1bS1zb2xhbmEtZmFjZS1vZmY_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 24 Dec 2023 08:00:00 GMT",
        "title": "Dogecoin Founder Sparks Unbelievable Ethereum-Solana Face-Off - U.Today",
        "content": "Dogecoin creator Billy Markus, widely known as Shibetoshi Nakamoto, has ignited a remarkable face-off between Ethereum and Solana in an unconventional manner.\n\nAdvertisement\n\nIn a recent post, Markus threw the contentious question to the crypto community: \"Which is better, Solana (SOL) or Ethereum (ETH)? My opinion on which one is better is whichever community tips me more!\" He attached the addresses of his wallets on both platforms and waited for the verdict.\n\nThe response was swift and astonishing. Within just five hours, Markus amassed over $10,000 in various cryptocurrencies, with his Ethereum wallet receiving $8,200, primarily in ETH, comprising 88% of the total.\n\nThe Solana wallet, while garnering fewer funds, secured nearly $2,000 in various assets. However, it was the eclectic mix of Solana tokens that caught Markus by surprise.\n\nthis is getting completely out of control 🤣 pic.twitter.com/zMslZsLb43 — Shibetoshi Nakamoto (@BillyM2k) December 24, 2023\n\nHe conveyed that the wallets were now accumulating a diverse array of items. Originally intended as a lighthearted post, Markus shared that the situation took an unexpected turn when individuals began sending a variety of unfamiliar items to the wallets.\n\nHe admitted to having limited knowledge about Solana, except for its frequent appearance in his recent online activity.\n\nSolana versus Ethereum\n\nThe unconventional face-off between Solana and Ethereum gained traction amid Solana's remarkable surge, securing its position as the fourth-largest cryptocurrency by market capitalization. SOL exhibited astonishing 300% growth against ETH, reaching levels unseen since December 2021.\n\nThis resurgence reignited the discourse over whether Solana could potentially \"kill ETH,\" prompting the DOGE founder to offer his unique resolution to the dispute."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS90cmFkZmktZW1icmFjaW5nLWV0aGVyZXVtLW1lc3NhcmktcHJlZGljdHMtd2FsbC1zdHJlZXRzLWF0dHJhY3Rpb24tdG8tdGhlLWJsb2NrY2hhaW4v0gFyaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL3RyYWRmaS1lbWJyYWNpbmctZXRoZXJldW0tbWVzc2FyaS1wcmVkaWN0cy13YWxsLXN0cmVldHMtYXR0cmFjdGlvbi10by10aGUtYmxvY2tjaGFpbi8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "TradFi Embracing Ethereum: Messari Predicts Wall Street’s Attraction to the Blockchain - CryptoPotato",
        "content": "Messari’s latest newsletter posits that the industry is witnessing crypto’s adolescence, emphasizing that smart contract blockspace is becoming a commodity.\n\nCEO Ryan Selkis acknowledged 2023 as Ethereum’s best year yet, citing its status as the strongest network in terms of community size and revenue generation through fees. However, he suggested that the crypto industry is still in its “adolescence” while asserting that smart contract blockspace is evolving into a commodity, implying a paradigm shift in the way developers approach blockchain platforms.\n\nBullish Case for Ethereum\n\nA significant point raised in Messari’s report is the expected decentralization away from Ethereum by developers. The market intelligence company predicts that most developers will lean towards the lowest cost and highest performance blockchains, interacting with the second-largest blockchain primarily through rollups and bridges – a shift that aligns with Ethereum’s long-term explicit direction.\n\nContrary to the narrative of Ethereum losing its prominence, Selkis outlined a bullish case for the blockchain network. The exec highlighted Ethereum’s long-established network reliability, a liquid ecosystem, and a staggering $300 billion market cap – ten times higher than its nearest smart contract network competitor.\n\nSelkis emphasized that Ethereum’s maturity becomes a key factor in attracting rollup and app developers, ensuring the platform remains a significant player in the evolving blockchain ecosystem.\n\nEthereum’s potential success in 2024 could be closely tied to how traditional finance (TradFi) embraces the platform. According to Messari, Ethereum, with its clean and environmentally friendly narrative, is positioned as an attractive option for Wall Street. Selkis anticipates a fast follow-up of an ETF for Ethereum, similar to the trend observed with Bitcoin.\n\nEthereum’s appeal to traditional financial institutions becomes more evident with a net deflationary supply and an annual fee generation of around $300 million, the report detailed.\n\nMessari’s annual report characterized Ethereum as a “Chaotic Good” as it continued to thrive on volatility and chaos. While Bitcoin is often considered a bet against bankrupt central banks, Ethereum, according to Selkis, represents a bet against morally bankrupt investment banks. This depiction underscored Ethereum’s adaptability in the face of geopolitical uncertainties.\n\nSolana: Back From Dead\n\nSolana emerged as the crypto industry’s comeback player of the year, defying skepticism following the FTX collapse last fall. The ecosystem experienced a remarkable resurgence, marked by a rapid stream of new product releases, a surge in on-chain liquidity, and increased availability of developer tools.\n\nNotable tech upgrades, including local fee markets, QUIC, and stake-weighted QOS, contributed to a significant reduction in Solana’s downtime compared to 2022.\n\nThe focus in 2024 will be on:\n\nPerformance enhancements via Firedancer and Sig.\n\nThe development of light clients through Tinydancer.\n\nThe deployment of the token-22 standard, which extends Solana token functionalities."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL3Jhb3VsLXBhbC1mb3JlY2FzdHMtZXRoZXJldW1zLWRvbWluYW5jZS1vdmVyLWJpdGNvaW4taW4tMjAyNC_SAVxodHRwczovL2NvaW5wZWRpYS5vcmcvbmV3cy9yYW91bC1wYWwtZm9yZWNhc3RzLWV0aGVyZXVtcy1kb21pbmFuY2Utb3Zlci1iaXRjb2luLWluLTIwMjQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "Is 2024 the Year Ethereum Will Steal Bitcoin’s Throne? - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nStory Highlights Raoul Pal, founder of Global Macro Investor, predicts Ethereum (ETH) will outperform Bitcoin (BTC) in 2024.\n\nHe points to Ethereum's strong performance in 2021, when it rose 245% compared to Bitcoin's 45% gain.\n\nPal believes similar trends will continue in 2024, with Ethereum potentially taking the lead in the next bull run.\n\nRaoul Pal, the esteemed Founder and CEO of Global Macro Investor, has made a prediction that’s capturing attention: Ethereum (ETH) might outshine Bitcoin (BTC) in 2024. Known for his insightful market analyses, Pal’s projection could signify a significant shift in the cryptocurrency landscape.\n\nFor all the ETH bears… in Feb 2021, BTC first hit $44,000 (where it is today) and ETH was at $1400 (now $2250), 9 months later ETH was up 245%, BTC was up 45%…\n\n\n\nI think ETH outperforming BTC will be a key macro trend of 2024 and our work at EXPAAM suggests it. 1/ pic.twitter.com/QGSZahhldg — Raoul Pal (@RaoulGMI) December 21, 2023\n\nRead on for more insights.\n\nThrowback to 2021: A Year of Market Dynamics\n\nPal’s forecast draws from past events, notably the 2021 bull run. During this period, Bitcoin initially had a dominant position. In February 2021, Bitcoin reached $44,000, while Ethereum was at a comparatively lower $1,400. However, by the end of that year, Ethereum’s value surged by 245%, overshadowing Bitcoin’s 45% growth.\n\nPal believes this shift in 2021 might be a sign of what’s to come. Today, with Bitcoin around $44,000 and Ethereum at $2,300, we see similar patterns emerging.\n\nEthereum’s Current Market Performance\n\nRecent market data aligns with Pal’s predictions. Even as Bitcoin’s value remains strong at $44,000, Ethereum has seen a notable growth, rising by 4.83% in the last 24 hours to reach $2,336. This rise, coupled with a slight 0.27% dip in Bitcoin’s value, has sparked discussions about Ethereum’s potential leadership in the upcoming bull run.\n\nPal’s insights go beyond just comparing prices. He emphasizes factors like liquidity and business cycles, highlighting their impact on cryptocurrency trends. As economic cycles change, so does investor behavior, affecting assets like Bitcoin and Ethereum.\n\nAlso Read: Ethereum Regains Strength: Breaking This Barrier May Lead the ETH Price To $3,500\n\nVaried Perspectives: Pal vs Brandt\n\nWhile Pal is optimistic about Ethereum’s future, not everyone shares his view. Peter Brandt, an experienced trader, predicts Ethereum might drop to $650. Yet, Pal’s stance, grounded in historical data and current trends, offers a brighter outlook for Ethereum supporters, setting the stage for an intriguing 2024 in the cryptocurrency world.\n\nClassical chart patterns in price charts are not sacred – they fail to perform according to the textbooks all the time\n\n\n\nBut, if the rising wedge in Ethereum $ETH complies with the script, the target is $1,000, then $650\n\n\n\nI shorted ETH on Friday — I have a protective B/E stop pic.twitter.com/76CciT3PE5 — Peter Brandt (@PeterLBrandt) December 18, 2023\n\nRead More: Ethereum (ETH) Price Set to Dominate – $5,000 in 2024?"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vY3J5cHRvdGlja2VyLmlvL2VuL2V0aGVyZXVtLXByaWNlLWZvcmVjYXN0LWJpdGNvaW4taGFsdmluZy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price Forecast is Promising! Will Ethereum Reach $5000 After Bitcoin Halving? - CryptoTicker.io - Bitcoin Price, Ethereum Price & Crypto News",
        "content": "Ethereum price surged significantly in the past day, crossing the $2,300 mark once again. Ether outperformed Bitcoin in this growth. Looking ahead, there’s speculation that Ethereum might hit an all-time high in the coming weeks or months, potentially surpassing the $5,000 mark after Bitcoin halving. Will ETH reach the $5000 mark? Let’s take a look at this Ethereum price forecast article in more detail.\n\nHow has the Ethereum price moved in recent days?\n\nEthereum’s price has seen a significant increase again in recent days, especially just one day ago. The ETH value increased by more than 4% during this time.\n\nThe price of Ethereum today is $2,291.83, and in the last 24 hours, it went up by 1.03%. The total value of all Ethereum in circulation is $275.44 billion, and it makes up 16.50% of the entire cryptocurrency market. The recent trading activity in the last day reached $25.55 billion.\n\nThe highest price Ethereum has ever reached was on November 10, 2021, when it reached $4,867.17. Its lowest price ever was on October 21, 2015, at $0.420897. After reaching its highest, the price went down to a low of $897.01, and then it went up again to $2,408.42.\n\nRight now, people are generally optimistic about the future price of Ethereum, and the Fear & Greed Index is at 70, indicating a sense of greed among investors.\n\nThe total number of Ethereum coins currently in circulation is 120.18 million. In the past year, 2.19 million new Ethereum coins were created, resulting in a yearly supply inflation rate of -1.79%. Ethereum is currently ranked #1 in the Proof-of-Stake Coins category and #2 in the Layer 1 category based on market cap.\n\n—> CLICK HERE TO BUY ETH SPOT<—\n\nEthereum Price Forecast: Is there going to be a price explosion after the Bitcoin halving?\n\nThe Bitcoin Halving is scheduled for April 2024 and there’s a high probability that the first Bitcoin Spot ETFs will get approval in the US even before that. This approval could not only boost the price of Bitcoin but also impact the Ethereum price positively. In recent weeks, it has been observed that the price of Ethereum tends to rise shortly after Bitcoin experiences an increase.\n\nThis suggests the possibility of a significant surge in Ethereum’s value during the first quarter of 2024. Additionally, there is speculation that this uptrend may prompt discussions about the introduction of an Ethereum ETF. Rumors circulating over the past few weeks even hint at plans by BlackRock, a major investment management company, to explore the creation of an Ethereum ETF.\n\n—> CLICK HERE TO BUY ETH SPOT<—\n\nCan Ethereum price rise to $5,000 after halving?\n\nIf the current bullish trend in the crypto market persists and the introduction of Bitcoin Spot ETFs has a notably positive impact on prices, there’s a potential for a substantial and rapid increase in the Ethereum price within the first 3 to 4 months.\n\nOver the past year, Ethereum (ETH) has demonstrated remarkable performance, with an impressive 87% increase in its price. This surge has not only outpaced a majority, precisely 57%, of the top 100 cryptocurrencies but has also positioned Ethereum as a standout performer in the market.\n\nThe consistent upward trajectory is further highlighted by the fact that Ethereum is currently trading above its 200-day simple moving average, a key indicator of sustained positive momentum. Remarkably, in the last 30 days, Ethereum has experienced 19 green days, accounting for a significant 63% of the observed period, underscoring the prevailing bullish sentiment.\n\nThe cryptocurrency is also hovering near its cycle high, hinting at the potential for further gains. Additionally, Ethereum boasts high liquidity, substantiated by its substantial market cap. Moreover, the negative yearly inflation rate of -1.79% contributes to its appeal as a deflationary asset, potentially attracting long-term investors.\n\nAs the crypto market continues to evolve, these factors collectively suggest a favorable outlook for Ethereum, hinting at the possibility of continued growth and positive price developments in the near future.\n\nFollowing the Bitcoin Halving, there’s a possibility of reaching a new all-time high in 2024, and the $5,000 mark is within reach. With increasingly optimistic forecasts in recent weeks for both Bitcoin and Ethereum, it’s conceivable that the Ethereum price could hit $5,000 in 2024.\n\n—> CLICK HERE TO BUY ETH SPOT<—\n\nWhere to Buy Ethereum?\n\nBitget stands out as a viable platform to purchase Ethereum. Known for its security and user-friendly interface, Bitget makes starting your cryptocurrency investment journey straightforward. To buy Ethereum on Bitget, simply create an account, complete the necessary KYC procedures, deposit funds, and execute your purchase.\n\n\n\n\n\nYou might also like\n\nMore from Altcoin"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bXMtZGVuY3VuLXVwZ3JhZGUtc2V0LWZvci1sYXVuY2gtaW4tMjAyNC1kZXRhaWxzLWhlcmUv0gFXaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2V0aGVyZXVtcy1kZW5jdW4tdXBncmFkZS1zZXQtZm9yLWxhdW5jaC1pbi0yMDI0LWRldGFpbHMtaGVyZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "Ethereum’s Dencun upgrade set for launch in 2024, details here - AMBCrypto News",
        "content": "Ethereum developers target January for the first testnet deployment.\n\nProgress made on the network increased, gas usage surged.\n\nEthereum [ETH] developers intensify testing for the upcoming Dencun upgrade, a significant milestone anticipated next year, introducing increased data storage capacity through the implementation of a process termed “proto-danksharding.”\n\nMore updates and upgrades\n\nIn a biweekly call on 21st December, developers revealed their target date of 17th January for the Goerli test network to undergo the Dencun upgrade, to enhance layer 2 rollup efficiency and expand blockchain scalability.\n\nTim Beiko, protocol support lead at the Ethereum Foundation, noted the possibility of cancellation in the event of major issues before the set date.\n\nLast 2023 AllCoreDevs call about to kick off 🫡 Agenda: https://t.co/jVzStnpnmZ\n\nStream: https://t.co/pT6x13i7nD Will recap here later today https://t.co/YDWpJbtOma — timbeiko.eth ☀️ (@TimBeiko) December 21, 2023\n\nMoreover, the Dencun upgrade, initially slated for Q4 2023, was rescheduled to 2024 due to the intricate engineering aspects. Developers outlined a tentative timeline for Dencun testing, intending to run through Sepolia on 31st January.\n\nNew folks, new forks\n\nAdditionally, the Goerli Shadow Fork took place with a network configuration involving 300 nodes distributed across North America, Europe, India, and Australia.\n\nThe fork proceeded smoothly, and post-Dencun, the network achieved a 99% participation rate. The term “participation rate” refers to the percentage of nodes that successfully adopted the changes introduced by the fork.\n\nOnce stability was established, teams initiated a network spamming exercise with blobs, aiming for an average of 4 per block, but the network stabilized around 3 as planned.\n\nThe introduction of blobs increased the network’s bandwidth usage by approximately 200 kbps, shifting from an average of 700 to 900 kbps.\n\nNotably, 95% of blobs propagated in less than 2 seconds, with an average propagation time below 500 milliseconds.\n\nHow is ETH doing?\n\nThe news is likely to boost confidence within the Ethereum community. Moreover, it could potentially attract more users and projects to leverage the upgraded platform.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nAt press time, ETH was trading at $2,315.75 and its price had grown by 4.15% in the last 24 hours. The overall interest in the network remained high during this period.\n\nThis was shown by the consistent gas usage on the Ethereum network. Coupled with that, the overall NFT trades occurring on the Ethereum network had also grown."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vZmluYm9sZC5jb20vYml0Y29pbi1hbmQtZXRoZXJldW0tcHJvZGlneS1pbnZlc3Rvci1zZXRzLXNpZ2h0cy1vbi1uZXctY3J5cHRvY3VycmVuY3ktZm9yLWZ1dHVyZS1nYWlucy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin and Ethereum Prodigy Investor Sets Sights on New Cryptocurrency for Future Gains - Finbold - Finance in Bold",
        "content": "Press Releases are sponsored content and not a part of Finbold's editorial content. For a full disclaimer, please click here. If you encounter any issues, kindly report them to [email protected]. Crypto assets/products can be highly risky. Never invest unless you’re prepared to lose all the money you invest.\n\nSince blockchain was introduced to the world in 2008, Bitcoin (BTC) and Ethereum (ETH) have consistently dominated the market. As a crypto investor, you most likely have one or both of these tokens in your portfolio. However, it is time for investors to explore Borroe Finance ($ROE), a new crypto token that can deliver ROI like BTC in 2011 and ETH in 2016. Keep reading to see expert forecasts and opinions on these tokens.\n\n>>BUY $ROE TOKENS NOW<<\n\nBTC Maintains $40K – $45K in December\n\nOn December 14, crypto expert and Researcher Chris Blec drew attention to the gradual centralization of Bitcoin’s mining process. According to Blec, Foundary USA and AntPool jointly control 55% of Bitcoin’s global hash rate, requiring all their miners to complete a KYC registration. Bitcoin was initially meant to be fully decentralized, and this mining centralization process may pose future problems for the crypto community.\n\nThis discussion came when Bitcoin miners and investors are counting down to the April 2024 BTC halving. BTC sold for $43,950 on December 9, and a week later, BTC lost 3.76% and sold for $42,315. Analysts say BTC will likely range till the end of the year before turning bullish. Therefore, BTC may trade for $50,000 in Q1 2024, thanks to an influx of beginner cryptocurrency investors looking to benefit from a likely surge.\n\nInvestors Bet on Borroe Finance to Deliver Triple-digit ROI in 2024\n\nDeFi companies find it hard to meet their short-term liquidity needs due to a lack of credit from financial institutions. Luckily, Borroe Finance aims to solve this problem by providing an AI-powered fundraising platform where web3 businesses can sell their future earnings at discounted prices. Additionally, Borroe Finance ensures the safety of the fundraising process and guarantees ROI by incorporating AI risk assessment into its protocol.\n\nCurrently, $ROE is in its third presale stage, and the token is selling for $0.0175. After all presale stages conclude, $ROE will hit the mainstream crypto market and sell for $0.04. At this stage, early $ROE investors will record a massive 128.6% ROI for a start. Additionally, experts predict that $ROE will likely trade for $0.175 when $ROE inevitably becomes popular in the crypto market.\n\n>>BUY $ROE TOKENS NOW<<\n\nETH Dips Amid Plans for Dencun Upgrade\n\nOn December 15, Christine Kim, vice president of research at Galaxy, revealed that Ethereum core developers plan to launch a Goerli shadow fork to test the Cancun/Deneb upgrade with live clients. This shadow test will reveal places where improvements are needed before the Ethereum Dencun upgrade goes live on the mainnet. Experts say this Dencun upgrade will ensure Ethereum handles more transactions per time.\n\nDespite this ecosystem development, ETH lost 5.44% in the second week of December. On December 9, ETH traded for $2,355. Within a week, ETH went bearish and sold at $2,229. ETH and other top altcoins went bearish in December. However, analysts say this price reversal is temporary, and the crypto market will likely record a bull run in Q1 2024 thanks to the upcoming Bitcoin halving. Therefore, ETH will likely trade for $2,550 by January 2024.\n\nLearn more about Borroe Finance here:\n\nVisit Borroe Finance Presale | Join The Telegram Group | Follow Borroe Finance on Twitter"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1ob2RsZXJzLXN1cnBhc3MtYml0Y29pbi13aGF0LW5vdy_SAURodHRwczovL2FtYmNyeXB0by5jb20vZXRoZXJldW0taG9kbGVycy1zdXJwYXNzLWJpdGNvaW4td2hhdC1ub3cvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 24 Dec 2023 08:00:00 GMT",
        "title": "Ethereum HODLers surpass Bitcoin, what now? - AMBCrypto News",
        "content": "ETH HODLers were unconcerned about the altcoin’s price fluctuations.\n\nThe short and long-term technical outlook suggested a bullish move for ETH.\n\nLong-term Ethereum [ETH] holders have desisted from liquidating their holdings while helping the coin reach a new milestone, IntoTheBlock noted.\n\nAccording to IntoTheBlock, the amount of ETH owned by HODLers has now hit 70% since the 1st of December.\n\nThe data also means that the altcoin had passed Bitcoin’s [BTC] position per the same metric. For BTC, the amount of coins held by long-term holders was almost at 70%, but ETH still surpassed it, AMBCrypto found.\n\nIt is important to mention that the blockchain analytics firm came to this conclusion after examining the BTC/ETH ratio.\n\nThe amount of $ETH owned by long-term hodlers reached a record of over 70% in December pic.twitter.com/znKGxTAkvU — IntoTheBlock (@intotheblock) December 24, 2023\n\nHODLers are vital to the health of any blockchain. This is because they rarely sell their coins irrespective of volatility or price performance.\n\nSo, the increase in the ETH owned by HODLers implies that there is enough conviction that the cryptocurrency’s long-term potential was worth waiting for.\n\nHowever, it is not surprising that the record came in December. This is because there have been predictions that ETH’s time to outshine Bitcoin is near.\n\nThough the price action was not yet at Bitcoin’s level, the impressive run of altcoins including L2 projects suggests that an ETH rally could be close.\n\nAs of this writing, ETH’s price was $2,290— a 3.69% increase in the last seven days. Regarding the long-term price potential, AMBCrypto decided to check Ethereum’s Dormancy.\n\nDormancy is the ratio of coin days destroyed and total transfer volume. The metric gives an insight into the sentiment of long-term holders.\n\nUp until the 23rd of December, Ethereum’s Dormancy showed high values. This suggests an increase in transactions by older coins. However, at press time, the metric was down to 67.61. This implies that older coins have largely remained unspent.\n\nIf Dormancy remains lower, then ETH may have a good shot at a rally in the near term.\n\nPer the 4-hour ETH/USD chart, the Exponential Moving Average (EMA) showed that the coin might be bullish in the mid to long term. This was because the 50-day EMA (blue) had crossover the 200 EMA (yellow).\n\nThis position is usually in favor of a bullish trend.\n\nSo, investors planning to hold ETH for an extended period might have a chance at buying at a discount. Another indicator to consider is the Aroon indicator. Results from the Aroon provide an idea of what ETH might do in the short term.\n\nRealistic or not, here’s ETH’s market cap in BTC terms\n\nAt the time of writing, the Aroon Up (orange) was 21.43% while the Aroon Down (blue) was at the zero midpoint.\n\nThus, short-term holders may not need to wait for the long-term ETH rally before making potential gains. However, traders may need to be cautious as it could take a little while before confirmation of the bullish thesis."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vYW1iY3J5cHRvLmNvbS93aHktZXRoZXJldW0tbWF5LW91dHBlcmZvcm0tYml0Y29pbi1pbi0yMDI0L9IBRmh0dHBzOi8vYW1iY3J5cHRvLmNvbS93aHktZXRoZXJldW0tbWF5LW91dHBlcmZvcm0tYml0Y29pbi1pbi0yMDI0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "Why Ethereum may outperform Bitcoin in 2024 - AMBCrypto News",
        "content": "ETH may displace Bitcoin’s dominance next year, an investor pointed out.\n\nLong-term investors are confident of the altcoin’s performance.\n\nAccording to Raoul Pal, Ethereum [ETH] will outperform Bitcoin [BTC] by 2024. Pal, who shared the opinion on X, noted that there could be a repeat of the 2021 cycle where BTC initially beat ETH’s performance.\n\nBut nine months later, ETH was up 245% while BTC gained 45% within the same period.\n\nIt's all about liquidity and the business cycle leading the risk curve. Narrative follows. — Raoul Pal (@RaoulGMI) December 21, 2023\n\nPal’s point of view was not only his. But it was also that of Exponential Age Asset Management (EXPAAM).\n\nEXPAAM is a digital asset investment management firm co-founded by Pal, who also doubles as the CEO of Global Micro Investor. In defending his school of thought, the investors noted that:\n\n“It’s all about liquidity and the business cycle leading the risk curve. Narrative follows.”\n\nThis year, Ethereum’s price has increased by 92.04% while it changed hands at $2,3110. However, BTC’s performance has been better, thanks to its 163.21% hike.\n\nSince there were discussions that ETH’s growth potential was massive, AMBCrypto dug into the matter.\n\nIndications from the Market Value to Realized Value (MVRV) Z-score showed that the reading was 0.61. The MVRV Z-score has been historically effective in identifying when the market value is below the realized value.\n\nIt also shows when the realized value is above market value.\n\nSince the metric was below 1, it means the market value is far below the realized value. Therefore, buying ETH at this level has the potential to produce great returns for investors.\n\nPer price action, the Exponential Moving Average (EMA) showed that ETH’s value could grow exponentially in the long term.\n\nAt the time of writing, the 50 EMA (blue) had crossed over the 200 EMA (yellow). This position is termed a golden cross, and it is a bullis sign.\n\nAMBCrypto then considered Ethereum’s On Balance Volume (OBV) as shown the daily chart. At press time, the OBV had increased to 11.6 million.\n\nThe OBV measures buying and selling pressure. So, the increase means that market players intend to push the price up in the short term.\n\nTherefore, the recent report that ETH may hit $2,500 soon remain valid. However, the Moving Average Convergence Divergence (MACD) had turned negative.\n\nThe MACD reading indicate a bearish momentum. Thus, there is a chance the ETH’s price drops below $2,300 before the potential run to $2,500.\n\nIn addition, the Long Tern Holder NUPL (LTH-NUPL) has moved from hope and fear into optimism.\n\nThe LTH-NUPL is the Net Unrealized Profit/Loss that takes into account only UTXOs with a lifespan of at least 155 days and serves as an indicator to assess the behavior of long term investors.\n\nHow much are 1,10,100 ETH worth today?\n\nThis position implies that the broader market believe that ETH’s performance in 2024 would be better than in 2023.\n\nIf the altcoin does, then Pal’s prediction may be considered concrete."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL3d3dy5iZW56aW5nYS5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS8yMy8xMi8zNjM1OTgyMS9iZW56aW5nYS1idWxscy1hbmQtYmVhci1hcHBsZS10ZXNsYS1ldGhlcmV1bS1hbmQtYW5hbHlzdC1kZXRhaWxzLWNvbmRpdGlvbnMtZm9yLWRvZ2Vjb2lucy3SAS1odHRwczovL3d3dy5iZW56aW5nYS5jb20vYW1wL2NvbnRlbnQvMzYzNTk4MjE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "Apple, Tesla, Ethereum And Analyst Details Conditions For Dogecoin's 'Gorgeous Pump' This Christmas: Benz - Benzinga",
        "content": "Benzinga examined the prospects for many investors' favorite stocks over the last week — here's a look at some of our top stories.\n\nThe three primary stock indices marked their eighth straight week of gains, a milestone not seen for the S&P 500 since 2017 and for the Dow since 2019, with increases of 0.8% for the S&P 500, 0.2% for the Dow, and 1.2% for the Nasdaq.\n\nInflation, as measured by the Personal Consumption Expenditures (PCE) index, decreased to 2.5% in November, reaching its lowest point since March 2021, and heightening the anticipation of multiple interest rate cuts in 2024. Following the significant drop in the Federal Reserve's preferred inflation gauge, economists on Friday started to reevaluate the potential impact on the Fed's plans for the next year.\n\nThe disclosure of the PCE inflation figures was accompanied by varied economic data, including an increase in the Michigan Consumer Sentiment Index for December and a substantial drop in November's home sales, which fell below projections.\n\nBenzinga provides daily reports on the stocks most popular with investors. Here are a few of this past week's most bullish and bearish posts that are worth another look.\n\nThe Bulls\n\n\"2024 Predictions For Apple, Tesla, 'Magnificent 7' And Musk From Analyst Dan Ives: It's AI's '1995 Moment',\" by Chris Katje, discusses Daniel Ives' predictions for 2024, highlighting major anticipated developments for Apple Inc. AAPL and Tesla Inc. TSLA, and a monumental breakthrough in AI, which was likened to the internet's emergence in 1995.\n\n\"Novogratz Explains Why Bitcoin Could Be About To Make A 'Parabolic Move' To All-Time Highs And Beyond,\" by Adam Eckert, features Mike Novogratz's forecast of a dramatic rise in Bitcoin BTC/USD, which could potentially surpass previous highs as a result of the anticipated ETF approval and market dynamics.\n\n\"'Gorgeous Pump On DOGE This Christmas:' Crypto Analyst Predicts Dogecoin Rally If It Breaches This Level,\" by Mehab Qureshi, reports that a crypto analyst predicts a significant rally for Dogecoin DOGE/USD if it surpasses the $0.106 mark amid recent whale activities and supportive market trends.\n\nFor additional bullish calls of the past week, check out the following:\n\nShiba Inu Makes History: First Decentralized Ecosystem With Plans To Secure .shib Top-Level Domain, Revolutionizing Web3\n\n'Magnificent 7' Widens Gap With Rest Of S&P 500, But That May Change In 2024\n\nNetflix Has 'Right Formula With Global Content Creation': Why Analyst Is Bullish For Fourth Quarter Results\n\nThe Bears\n\n\"Oil Prices Fall After Angola Says It Will Quit OPEC,\" by Neil Dennis, details a more than 1% decline in oil prices on Thursday, including Brent crude and U.S. West Texas Intermediate crude, and a 0.2% drop in the United States Oil Fund USO, following Angola's announcement to leave OPEC.\n\n\"Veteran Trader Says Ethereum Will Drop Over 75% To $650; 'Price Charts Are Not Sacred',\" by Mehab Qureshi, reports Peter Brandt's prediction of a dramatic over 75% drop in Ethereum ETH/USD to $650, citing the unreliability of classical chart patterns and concerns over Ethereum's functionality and transaction fees.\n\n\"Roku Analyst Turns Bearish, Believes This Revenue Growth Driver Is Less Economic,\" by Priya Nigam, reports on Seaport Research Partners analyst David Joyce downgrading Roku Inc. ROKU from \"Neutral\" to \"Sell,\" citing concerns over its business model and competition in the streaming market.\n\nFor more bearish takes, be sure to see these posts:\n\nWe're In For A Santa Claus Rally Alright, But It Might Be Subpar: Here Are 5 Reasons Why\n\nBankruptcies On The Rise Following End Of COVID Relief Measures And High-Interest Rates\n\nMark Zuckerberg's Meta Said To Be Worried About Indian Telecom Bill's Impact On WhatsApp\n\nKeep up with all the latest breaking news and trading ideas by following Benzinga on Twitter."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMTIvMjQvZXRoZXJldW0tbG9uZy10ZXJtLWhvbGRlci1jb252aWN0aW9uLWhpdHMtbmV3LWhpZ2hzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 24 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Long-Term Holder Conviction Hits New Highs - Crypto Times",
        "content": "The amount of Ethereum (ETH) owned by long-term holders has reached a new high, surpassing 70% since December 1st according to blockchain analytics firm IntoTheBlock.\n\nThis metric now exceeds Bitcoin’s (BTC), which has hovered just under 70%, showing conviction in Ethereum’s long-term potential.\n\nThe amount of $ETH owned by long-term hodlers reached a record of over 70% in December pic.twitter.com/znKGxTAkvU — IntoTheBlock (@intotheblock) December 24, 2023\n\nRecent predictions have suggested that 2024 could see ETH outperform BTC again, repeating the 2021 cycle where ETH grew 254% versus BTC’s 45% after initially lagging.\n\nFor all the ETH bears… in Feb 2021, BTC first hit $44,000 (where it is today) and ETH was at $1400 (now $2250), 9 months later ETH was up 245%, BTC was up 45%…\n\n\n\nI think ETH outperforming BTC will be a key macro trend of 2024 and our work at EXPAAM suggests it. 1/ pic.twitter.com/QGSZahhldg — Raoul Pal (@RaoulGMI) December 21, 2023\n\nThough still behind BTC’s price, analysts feel recent altcoin and L2 performance hints an ETH rally is coming, with ETH up 4.3% over 7 days and 88.6% over 12 months to $2,300.\n\nYet co-founder Vitalik Buterin recently raised eyebrows transferring 500 ETH worth over $1 million to Coinbase, following September transfers and an October statement he hasn’t “sold Ether for personal gain since 2018.”\n\nAdditionally, JPMorgan analysts predict ETH will outpace BTC and other assets by 2024, tied to the major EIP-4844 “protodanksharding” upgrade launching early 2024 to enhance network performance.\n\nThough cautiously optimistic on crypto overall, they feel this Ethereum upgrade will drive significant price gains."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLWFpbnQtZGVhZC1oZXJlcy13aHktZXRoZXJldW0tY2FuLW91dHBlcmZvcm0tYml0Y29pbi1pbi1xMS0yMDI0L9IBYWh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLWFpbnQtZGVhZC1oZXJlcy13aHktZXRoZXJldW0tY2FuLW91dHBlcmZvcm0tYml0Y29pbi1pbi1xMS0yMDI0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Ain’t Dead: Here’s Why Ethereum Can Outperform Bitcoin in Q1 2024 - CoinGape",
        "content": "Ethereum (ETH) has delivered a strong performance quite in tune with the Bitcoin performance. However, it has underperformed other Layer-1 competitors such as Solana, Polkadot, and Chainlink. This has led to a new debate about whether Ethereum is dead and what future it holds.\n\nEthereum’s Prominence Won’t Diminish\n\nCrypto analyst Michael van de Poppe suggests that Ethereum’s prominence will not diminish but rather strengthen for several reasons:\n\nadvertisement\n\nEthereum’s transition from PoW to PoS has garnered attention, and its true impacts are yet to be fully realized. The coming year is expected to reveal the fundamental growth of the ecosystem, making Ethereum potentially deflationary and a more enticing investment than Bitcoin. Similar to Bitcoin, Ethereum is in the process of having a Spot ETF application, which, upon approval, could be more significant. This development opens doors for decentralized applications (dApps) built on Ethereum to be included in ETFs, potentially increasing its appeal. Van de Poppe highlights the money flow cycle, noting that Bitcoin usually takes the spotlight before halving. In this cycle, the approval of Bitcoin ETFs is expected to generate positive momentum. As money flows through market capitalizations, Ethereum is likely to be the next beneficiary.\n\nQ1 Is Always Great for ETH\n\nCrypto analyst Michale van de Poppe says that in recent weeks, Ethereum has faced negative sentiment, experiencing underperformance compared to Bitcoin. This is considered organic and natural price action, given the prevailing focus on Bitcoin before the ETF approval. Ethereum is anticipated to follow a similar pattern, and this carries various implications and reasons, particularly with the absence of distinct price action at the moment.\n\nPoppe also shares a chart showing that historically, ETH has always outperformed Bitcoin during the first quarter of the year.\n\nMichael van de Poppe anticipates a Bitcoin price range of $48,000 to $51,000 to be achieved before the awaited ETF approval. His forecast also includes a peak in Bitcoin’s performance in January, prompting a swift movement of funds towards altcoins. According to Poppe, the Bitcoin dominance is likely reaching its pinnacle before the Bitcoin halving. Consequently, he suggests that the first quarter of the year will present favorable returns for investments in the Ethereum (ETH) ecosystem.\n\nThe #Bitcoin dominance is likely peaking pre-Bitcoin halving. That means that Q1 is going to give a great return for investments in the $ETH ecosystem. I'm positioned and ready. pic.twitter.com/Iqlxkojz4w — Michaël van de Poppe (@CryptoMichNL) December 22, 2023"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL2NyeXB0b2RhaWx5LmNvLnVrLzIwMjMvMTIvc29sYW5hLXNvbC1tYXktZGV0aHJvbmUtZXRoZXJldW0tZXRoLWluLXRoZS1ibG9ja2NoYWluLWJhdHRsZS13aGF0LW90aGVyLWNvaW4taXMtcHJpbWVkLWZvci1hLWNoYWxsZW5nZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "Solana (SOL) May Dethrone Ethereum (ETH) in the Blockchain Battle. What Other Coin is Primed for a Challenge? - CryptoDaily",
        "content": "Table of Contents\n\nThe recent developments in the cryptocurrency sphere have added an extra layer of excitement. Reports suggest that the Securities and Exchange Commission (SEC) is on the brink of approving the first-ever spot Bitcoin exchange-traded fund (ETF) in the U.S. This significant move, following a pivotal conference call with ETF contenders, indicates a potential catalyst for the entire crypto market. The implications extend beyond Bitcoin, potentially impacting altcoins profoundly. This article examines the current trends, key technical indicators and price forecasts for Ethereum (ETH), Solana (SOL) and Litecoin (LTC).\n\nSimultaneously, the collaboration between StealthEX and Crypto Daily injects a festive twist into the crypto landscape. Going beyond providing insights into market dynamics, this partnership offers an exclusive opportunity to infuse the holiday spirit into optimal engagement within the cryptocurrency space.\n\nWin Big This Christmas: StealthEX's $1,000 Festive Giveaway Awaits!\n\nGet ready to feel the holiday magic with StealthEX's thrilling $1,000 giveaway, running from December 13th to 23rd! This festive fortune is open to all. Simply swap your favorite cryptos like Ethereum (ETH), Solana (SOL), Litecoin (LTC), and more (with a minimum transaction of $100), submit your transaction details, and you could be in for a big win.\n\nThe holiday cheer gets bigger with prizes galore: $500 for the grand prize winner, and $250 each for two lucky runners-up. The winners will be announced on December 24th, so keep your eyes on StealthEX’s channels.\n\nJump into the festive action with StealthEX, make your swaps, and be part of this holiday excitement. May your Christmas be merry, lucky, and profitable!\n\nEthereum (ETH) Technical Analysis\n\nEthereum (ETH) is currently on a positive trajectory, exhibiting a price range between $2,280 and $2,316.04, showcasing a notable 3.41% surge. Over the past month, the cryptocurrency has demonstrated remarkable growth, boasting an impressive 20% increase. An insightful look at on-chain metrics discloses that 77% of ETH holders find themselves in a profitable position at the current price, while 21% are currently experiencing losses. Notably, approximately 46% of Ethereum is held by larger investors, underscoring the considerable influence wielded by whales in the market.\n\nIn terms of technical analysis, the overall assessment is nuanced. Key indicators such as the Relative Strength Index (RSI) registering at 59.72 and the Commodity Channel Index (CCI) at 49.05 present neutral signals. Conversely, the Awesome Oscillator at 49.18 and Momentum at 113.38 are suggestive of a buying opportunity.\n\nCrucially, all major moving averages, spanning from the 10-day to the 200-day, align in signaling a buy recommendation. Specifically, the 50-day Exponential Moving Average (EMA) at $2106.59 crossing above the 200-day EMA at $1878.54 delivers a robust bullish signal. This upward trend is further reinforced by a noteworthy 30% surge in trading volume over the past 24 hours, affirming a strengthening market sentiment.\n\nEthereum (ETH)Price Prediction\n\nEthereum's current technical analysis from various sources indicates a strong bullish trend, with most indicators suggesting a buying opportunity. The global distribution of its transactions and the consistent increase in its market cap and trading volume reflect its robust position in the cryptocurrency market.\n\nIn the event that Ethereum (ETH) maintains its bullish momentum, a potential test of the immediate resistance at $2347.18 appears on the horizon. A breakthrough beyond this level has the potential to propel the price to higher levels, with a notable target at $2705.38.\n\nHowever, it's crucial to acknowledge the inherent volatility of the crypto market, and a bearish scenario cannot be entirely dismissed. In such a situation, Ethereum might experience a decline to the initial support at $1988.98. Failure to sustain momentum above this level could lead to a further slide, potentially reaching $1841.58. Prudent consideration of both bullish and bearish scenarios is essential for a comprehensive assessment in the dynamic landscape of cryptocurrency trading.\n\nSwap Ethereum (ETH) on StealthEX now and dive into the holiday giveaway before it's too late!\n\nSolana (SOL) Technical Analysis\n\nSolana (SOL) has recently made significant strides in the crypto realm. It has impressively flipped Binance Coin (BNB) to become the fourth-largest cryptocurrency by market cap and is now eyeing Ethereum's position. This year, Solana has seen a remarkable 665% increase in price, particularly excelling in the last quarter. The launch of the Solana Saga Phone and the distribution of 30 million BONK tokens have contributed to this surge.\n\nAdding to Solana's growing ecosystem, Paxos, a tokenization and stablecoin platform, announced its expansion to the Solana blockchain.The move was approved by the New York Department of Financial Services (NYDFS). It is Paxos' first venture beyond Ethereum. The introduction of the Pax Dollar (USDP) on Solana, scheduled for January 2024, is expected to enhance the blockchain's landscape.\n\nSolana (SOL) is exhibiting a dynamic market performance, with its price fluctuating between $93.94 and $97.01, reflecting a weekly increase of 28%. This recent upswing is part of a broader positive trend observed in Solana's market behavior.\n\nIn the realm of technical analysis, Solana presents a complex picture. Key indicators like the Relative Strength Index (RSI), positioned at 76.7136, and the Commodity Channel Index (CCI) at 272.4531, offer neutral signals. However, the Momentum indicator at 28.4742 and the MACD Level at 7.6669 hint at potential buying opportunities.\n\nA critical aspect of Solana's technical analysis is the unanimous buy signal from all major moving averages, ranging from the 10-day to the 200-day. This consensus among moving averages is a strong indicator of a bullish trend for Solana. The Exponential Moving Average (EMA) values, particularly the 50-day EMA at $62.3539 and the 200-day EMA at $39.1178, further reinforce this bullish outlook.\n\nMoreover, the trading volume for Solana has seen a significant increase, which is indicative of growing investor interest and a solidifying market position. This surge in trading activity, coupled with the favorable technical indicators, suggests a robust and continuing upward trajectory for Solana in the cryptocurrency market.\n\nSolana (SOL) Price Prediction\n\nSolana's recent performance and technical indicators suggest a strong bullish momentum. The blockchain's growing adoption, highlighted by significant developments like Paxos' expansion and increasing market cap, positions Solana as a formidable player in the crypto space. The nearest upside target for SOL lies at $98.3447, but given its exceptional performance, the possibility of a surge to $115.5695 cannot be discounted.\n\nIn the event of a correction, should SOL dip below its pivot point of $72.3196, there is potential for a descent to test the support level at $55.1199.\n\nSolana's impressive market performance, bolstered by strategic expansions and a strong technical outlook, positions it as a key cryptocurrency to watch.\n\nDon't miss out – exchange Solana (SOL) on StealthEX today and grab your chance at the $1,000 holiday prize!\n\nLitecoin (LTC) Technical Analysis\n\nLitecoin (LTC) is demonstrating a positive momentum, approaching the $74 mark with a 10% monthly increase. This upswing is part of Litecoin's broader trend of growth and market resilience.\n\nRecently, Litecoin achieved a significant milestone by processing its 200 millionth transaction, indicating accelerated growth and a robust network. In a single day, Litecoin recorded 1.4 million on-chain transactions, surpassing the combined total of Bitcoin (BTC) and Ethereum (ETH) in terms of active addresses. This surge in activity is a testament to Litecoin's increasing adoption and efficiency in facilitating transactions.\n\nThe technical analysis of Litecoin, based on data from TradingView, presents a nuanced view. Indicators like the Relative Strength Index (RSI) at 54.13 and the Commodity Channel Index (CCI) at -20.65 show neutral signals. The Momentum indicator at 1.0187 suggests a buying opportunity, while the MACD Level at -0.0703 indicates a sell signal.\n\nMost moving averages signal a buy, with the Exponential Moving Average (EMA) and Simple Moving Average (SMA) across various timeframes favoring a bullish trend. Specifically, the 10-day SMA and 10-day EMA are at $71.81306887 and $71.58604877 correspondingly, while the 100-day SMA and 100-day EMA are at $71.27299416 and $68.54520547.\n\nLitecoin (LTC) Price Prediction\n\nLitecoin's recent performance, characterized by significant transactional throughput and growing active addresses, positions it as a strong contender in the altcoin market. The technical indicators suggest a generally bullish trend in the short term, with some caution advised for long-term investments due to mixed signals in the longer moving averages.\n\nIf Litecoin manages to sustain its momentum above the pivotal point of $72.93986016, it is plausible that the cryptocurrency could ascend to its immediate upside target at $80.25918644. Beyond this level, the next significant resistance awaits at $87.57851272.\n\nOn the downside, the support levels are identified at $68.37705921 and $65.62053388. These levels serve as crucial points where Litecoin might find buying interest, potentially preventing further declines.\n\nSwap Litecoin (LTC) on StealthEX now to be part of the festive fortune – time's running out!\n\nConclusion\n\nThe SEC's expected approval of Bitcoin ETF could be a game-changer. It could usher in a new era of institutional investment and mainstream acceptance of cryptocurrencies. the implications may be far-reaching for the entire market, including Ethereum (ETH), Solana (SOL), and Litecoin (LTC). Litecoin's market achievements, combined with its current technical indicators, paint a picture of a cryptocurrency with strong fundamentals and potential for continued growth. At the same time, Solana's rapid growth and increasing adoption in various crypto sectors make it a significant contender in the blockchain arena. If the current pace continues, Solana could revisit its all-time high and potentially challenge Ethereum's dominance in the DeFi, NFTs, and smart contracts space. While the current outlook for ETH, SOL, and LTC is promising, the inherent volatility of the crypto market requires a balanced approach, considering both potential gains and risks.\n\n\n\nDisclaimer: This is a sponsored article and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5jcnlwdG9nbG9iZS5jb20vbGF0ZXN0LzIwMjMvMTIvZm9ybWVyLWdvbGRtYW4tc2FjaHMtZXhlYy1wcmVkaWN0cy1ldGhlcmV1bS1hbmQtc29sYW5hcy1kb21pbmFuY2UtaW4tMjAyNHMtY3J5cHRvLW1hcmtldC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "Ethereum & Solana to Outshine Bitcoin in 2024, Predicts Raoul Pal - CryptoGlobe",
        "content": "Raoul Pal, a former Goldman Sachs executive and CEO of Real Vision, has made a bold prediction about the performance of Ethereum (ETH) and Solana (SOL) in 2024. Addressing his one million followers on a social media platform on December 21, Pal suggested that Ethereum might replicate its 2021 bull market pattern against Bitcoin (ETH/BTC) in the coming year.\n\nPal’s analysis is rooted in historical data. He recalled that in February 2021, when Bitcoin first reached $44,000, Ethereum was priced at $1,400. Nine months later, Ethereum had surged by 245%, while Bitcoin had only risen by 45%. Based on this, Pal believes that Ethereum outperforming Bitcoin could be a major trend in 2024. His firm, Exponential Age Asset Management (EXPAAM), supports this view.\n\nThe analyst also anticipates more favorable macroeconomic conditions for risk assets like Ethereum, which could lead to a similar surge as seen two years ago. He emphasized the importance of liquidity and the business cycle in driving these trends, suggesting that narratives often follow these underlying factors.\n\nIt's all about liquidity and the business cycle leading the risk curve. Narrative follows. — Raoul Pal (@RaoulGMI) December 21, 2023\n\nIn a surprising twist, Pal also believes that Solana will outperform Ethereum in 2024. Responding to a query on social media, he simply stated, “No,” when asked if Ethereum could outperform Solana.\n\nNo. — Raoul Pal (@RaoulGMI) December 21, 2023\n\nPal’s interest in Solana is partly influenced by the development of Firedancer, a new validator client for the Solana blockchain. Developed by Jump Crypto, a division of Jump Trading Group, Firedancer aims to enhance network performance within existing hardware constraints. This development is significant as Solana’s network currently relies on a single validator client developed by Solana Labs. Firedancer, expected to launch on the mainnet in Summer 2024, promises to optimize network performance and add security by reducing software-induced outages.\n\nMessari, a market intelligence firm, has highlighted scalability as a critical challenge in the crypto sector. Solana’s commitment to a monolithic architecture, as opposed to modular solutions adopted by other networks, is a key focus of Firedancer. Initial tests of Firedancer have shown promising results, achieving a transaction speed of one million transactions per second (TPS) with just four CPU cores, surpassing Solana’s recommended 12-core setup.\n\nIf successfully implemented, Firedancer could offer several benefits, including reducing latency in the DeFi sector and enabling high-throughput Web2 applications to function on-chain. It could also enhance Solana’s network resilience by introducing client diversity, mitigating risks related to software bugs.\n\n1/ Scalability is a key factor in the crypto space, with the modular approach gaining popularity. However, @Solana has taken a contrarian stance.@kelxyz_ explains how @jump_firedancer, a validator client developed by @jump_ aims to enhance Solana's monolithic approach.🧵 pic.twitter.com/zRc3Q5wSeT — Messari (@MessariCrypto) June 6, 2023\n\nPal’s optimism about Solana is further bolstered by performance charts against Ethereum and Bitcoin. He likened Solana’s upward trend in these charts to a rocket ship, indicating a promising future. His enthusiasm grew after interviews with the Jump Crypto team responsible for Firedancer, learning that the new validator client would not only boost Solana’s transaction speed but also fortify the security of the entire blockchain. The team behind Firedancer is focused on achieving high-frequency trading speeds, which Pal believes could be a game-changer for Solana.\n\nAlthough the exact launch date for Firedancer is unclear, Pal remains bullish on Solana’s prospects. He has previously suggested that Solana could emulate Ethereum’s bullish market cycle from 2021. He maintains this view, speculating that Solana could be the Ethereum of the current market cycle without diminishing the value of Ethereum or Bitcoin.\n\nPal concluded by stating that in the current economic landscape, the goal is to maximize gains whenever possible, and he sees Solana as a strong candidate for achieving this objective."
    }
]