[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vd3d3LmJhbmtyYXRlLmNvbS9pbnZlc3RpbmcvaG93LXRvLWJ1eS1ldGhlcmV1bS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "How To Buy Ethereum - Bankrate.com",
        "content": "Advertiser Disclosure\n\nWe are an independent, advertising-supported comparison service. Our goal is to help you make smarter financial decisions by providing you with interactive tools and financial calculators, publishing original and objective content, by enabling you to conduct research and compare information for free - so that you can make financial decisions with confidence.\n\nOur articles, interactive tools, and hypothetical examples contain information to help you conduct research but are not intended to serve as investment advice, and we cannot guarantee that this information is applicable or accurate to your personal circumstances. Any estimates based on past performance do not a guarantee future performance, and prior to making any investment you should discuss your specific investment needs or seek advice from a qualified professional.\n\nHow We Make Money\n\nThe offers that appear on this site are from companies that compensate us. This compensation may impact how and where products appear on this site, including, for example, the order in which they may appear within the listing categories, except where prohibited by law for our mortgage, home equity and other home lending products. But this compensation does not influence the information we publish, or the reviews that you see on this site. We do not include the universe of companies or financial offers that may be available to you.\n\nEditorial disclosure\n\nAll reviews are prepared by our staff. Opinions expressed are solely those of the reviewer and have not been reviewed or approved by any advertiser. The information, including any rates, terms and fees associated with financial products, presented in the review is accurate as of the date of publication."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDQvMTgvZXRoZXJldW0tdW5zdGFraW5nLXJlcXVlc3RzLW5vdy1mYWNlLWFib3V0LWEtMTctZGF5LXdhaXQv0gFmaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wNC8xOC9ldGhlcmV1bS11bnN0YWtpbmctcmVxdWVzdHMtbm93LWZhY2UtYWJvdXQtYS0xNy1kYXktd2FpdC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Unstaking Requests Now Face About a 17-Day Wait - CoinDesk",
        "content": "Concurrently, stakers over the last 24 hours have deposited more ETH into the chain than there have been withdrawal requests, creating a net 86,000 ETH staked, or 0.3% increase in staked ETH – despite all the withdrawals that have already taken place. This shows that since the upgrade, stakers have gained confidence in Ethereum’s staking process."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3JlZ3VsYXRvcnktY2xhcml0eS1ldGhlcmV1bS1nZW5zbGVy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Regulatory Clarity? Gensler Can't Give a Simple Yes or No on Ethereum - Blockworks",
        "content": "Gary Gensler, the chair of the SEC appeared before Congress today to answer questions regarding his controversial tenure.\n\nAmong the questioners: Chair of the Financial Services Committee, Patrick McHenry.\n\nRegulators and prosecutors have been asserting, variously, that ether is a security (the attorney general of New York) or a commodity (the CFTC), or that it was a commodity in the past, but now they won’t say (the SEC’s director of corporate finance, William Hinman, said that neither ether nor bitcoin were securities in 2018).\n\nGiven that Gensler has spent considerable energy telling the digital asset industry that they have all the regulatory clarity they need, it’s worth transcribing the interchange between the two men word-for-word, so that you can judge for yourself if Gensler was clear.\n\nMcHenry asked Gensler some very specific questions, including this one, regarding Ether (ETH), the native token of the Ethereum blockchain.\n\n“Clearly an asset cannot be both a commodity and a security. Do you agree?”\n\n“Ummm, I… I… it’s… actually all securities are commodities under the Commodity and Exchange Act, it’s that we’re excluded commodities, but I would agree that a security cannot also be an excluded commodity and an included commodity, I’m sorry chair, just to talk about the Commodity Exchange Act, more precisely.”\n\nMcHenry did not appear to think this answer was an answer at all.\n\nHe followed up: “I’m asking you, sitting in your chair now, to make an assessment under the laws that exist: Is ether a commodity, or a security?”\n\n“Without speaking to any one…” began Gensler.\n\n“You’ve repeatedly said you won’t speak to one,” interrupted McHenry, “But you’ve spoken to one: bitcoin. So I’m asking you to speak to a second one, with the second largest market cap.”\n\n“In speaking to the tokens,” Gensler replied, “There’s ten to twelve thousand, if there’s a group of entrepreneurs…”\n\n“I’m asking about one,” interjected McHenry. “I’m asking you a specific question, Chair Gensler. I said this in private, this should be no shock to you that I’m asking this question. Is ether a commodity, or a security?”\n\nGensler: “And again, it depends on the facts and the law on if there’s a group of individuals…”\n\nMcHenry: “I’m asking about the facts and the law, sitting in your seat, and the judgment you are making.”\n\nGensler: “And so, Mr. Chair, I think you would not want me to prejudge…”\n\nMcHenry wasn’t having it. “But you have prejudged on this. You’ve taken 50 enforcement actions. We’re finding out as we go, as you file suit, as people get Wells notices on what is a security in your view and your agency’s view. I’m asking you a very simple question about the second-largest digital asset. What is your view?”\n\nOnce again, Gensler refused to answer. “And my view is, if there’s a group of individuals in the middle of it, the public is entitled…”\n\nMcHenry gave up and moved on.\n\nThere’s your regulatory clarity.\n\nNow come in and register.\n\nYouTube / GOP Financial Services\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jcnlwdG8tZXRoZXJldW0tbmV0d29yay1maW5pc2hlcy1zaGFuZ2hhaS0wMDA4NTk0MDYuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Apr 2023 07:00:00 GMT",
        "title": "Crypto's Ethereum Network Completes Key Software Upgrade Without a Hitch - Yahoo Finance",
        "content": "(Bloomberg) -- Ether rallied past $2,000 for the first time since August after a widely anticipated software upgrade to the most commercially important blockchain went according to plan, and as worries of initial rapid outflows proved unfounded.\n\nMost Read from Bloomberg\n\nThe so-called Shanghai, or Shapella, update enables investors to queue up to withdraw Ether coins they had pledged to help operate the Ethereum network in return for rewards, a process called staking. And so far, 96% of withdrawal volume has been from users withdrawing their rewards instead of their entire stakes, according to researcher Flipside Crypto.\n\nEther jumped as much as 6% to $2,023 on Thursday, taking it to levels not seen since May 2022. Its 68% year-to-date gain still trails Bitcoin’s 84% gain. But there could be some additional upside if the size of withdrawals in the queue — now two weeks long, according to Rated Network Explorer — remains muted.\n\n“This could still be volatile,” said Noelle Acheson, author of the “Crypto Is Macro Now” newsletter. “There is a queue forming for ETH withdrawals, and the looming sell pressure from Kraken, Celsius and others — that have to un-stake” but the “overall liquidity situation is favorable for crypto assets.”\n\nCrypto exchange Kraken, which is discontinuing staking products in the US as part of a settlement with the US Securities and Exchange Commission, dominated the initial exit queue, based on figures compiled by Rated.\n\nBut overall, the amount of Ether entering the market from Shanghai withdrawals is much lower than what was previously expected, said Grayscale Research analyst Matt Maximo. “The amount of new ETH being staked is also outpacing the withdrawals, which is creating added buy pressure to offset the withdrawn ETH.”\n\nStory continues\n\nAbout 1.2 million of Ether tokens — worth approximately $2.3 billion at current prices — was expected to be withdrawn over the next five days, according to researcher Coin Metrics. However, that represents just 6% of the roughly $36.7 billion of Ether locked up for staking, data from Staking Rewards shows.\n\nInvestors had been braced for crypto price swings around the upgrade, but so far digital-asset markets have been largely steady.\n\nSmaller coins from applications that try to make it easier to harness Ether staking rewards, such as Lido and Rocket Pool, advanced, according to CoinGecko data. LDO climbed 7.2% and RPL was up 11%, the data showed.\n\nThe Ethereum blockchain in September last year transitioned to a proof-of-stake from a proof-of-work approach, a revamp called the Merge that slashed the network’s electricity consumption.\n\nProof-of-stake uses piles of Ether — placed in special so-called staking wallets — to help order transactions on the Ethereum network. And with investors now able to withdraw staked funds — boosting the appeal of an Ether investment — a debate is stirring over whether Ethereum could someday replace Bitcoin as the world’s largest digital currency.\n\n“Ethereum is updating and navigating with great skill — so far anyway — and cementing its position as the No. 2 crypto,” said Aaron Brown, a crypto investor who writes for Bloomberg Opinion. The network is “moving to the future much faster than Bitcoin.”\n\n--With assistance from Sidhartha Shukla and Carly Wanna.\n\n(Updates price reactions and adds commentary in fourth paragraph.)\n\nMost Read from Bloomberg Businessweek\n\n©2023 Bloomberg L.P."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1pcy11cC0xNS12ZXJzdXMtYml0Y29pbi1zaW5jZS1zaGFwZWxsYS1tb3JlLWV0aC1wcmljZS1nYWlucy1haGVhZNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Ethereum is up 15% versus Bitcoin since Shapella — More ETH price gains ahead? - Cointelegraph",
        "content": "Ether (ETH) entered a sharp price recovery a week after hitting a six-month low versus Bitcoin (BTC).\n\nOn April 18, the widely-tracked ETH/BTC pair reached 0.0709 BTC, up about 15% from its local bottom of 0.0602 BTC six days ago. Now, the pair eyes a run-up toward 0.075 BTC by June, based on the fractal setup previously discussed here.\n\nETH/BTC daily price chart. Source: TradingView\n\nEthereum’s Shapella FOMO\n\nInterestingly, Ether’s local bottom formation versus Bitcoin occurred on the day of Ethereum’s long-awaited Shapella upgrades.\n\nThe hard fork enables Ether stakers to withdraw their rewards — around 1.1 billion ETH — from Ethereum’s proof-of-stake smart contract. This update may have boosted ETH’s appeal compared to BTC, beating anticipations that a freshly unlocked Ether supply would increase sell pressure.\n\nStakers have withdrawn 574,700 ETH — worth about $1.21 billion — since the Shapella upgrades on April 12, according to data fetched by Nansen. Interestingly, Ether’s price in U.S. dollar terms has increased by 14.25% in the same period.\n\nETH deposits vs. withdrawals. Source: Nansen\n\nIt means that many stakers have decided to hold onto their Ether rewards. On the other hand, Bitcoin has failed to log a decisive breakout above its technical resistance of $30,000, possibly making ETH a more attractive short-term bet for traders.\n\nWeak institutional inflows versus Bitcoin\n\nInstitutional investors have shown more interest in Bitcoin than Ether in the past week, according to CoinShares’ weekly report.\n\nFor instance, Bitcoin-based investment vehicles witnessed $103.8 million in inflows in the week ending April 14. In comparison, Ethereum funds attracted $300,000, showing that mainstream investors may have followed the “sell the news” strategy after the Shapella upgrades.\n\nNet flows into crypto funds. Source: CoinShares\n\nEther’s price, meanwhile, is also at risk of a possible bearish reversal move due to its overbought daily relative strength index.\n\nRelated: Shapella could bring institutional investors to Ethereum despite risks\n\nIf ETH price retreats from its current resistance level of around $2,140, its immediate downside target appears at around $1,984, which acted as resistance in May 2022 and August 2022.\n\nETH/USD daily price chart. Source: TradingView\n\nAn extended sell-off could push Ether price down to its 50-day exponential moving average (50-day EMA; the red wave) near $1,800, down about 15% from its current price levels.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vZm9ya2FzdC5uZXdzL3NlYy1nYXJ5LWdlbnNsZXItZXRoZXJldW0tc2VjdXJpdHkv0gE8aHR0cHM6Ly9mb3JrYXN0Lm5ld3Mvc2VjLWdhcnktZ2Vuc2xlci1ldGhlcmV1bS1zZWN1cml0eS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Apr 2023 07:00:00 GMT",
        "title": "SEC’s Gary Gensler dodges question on whether Ethereum is a security - Forkast News",
        "content": "Securities and Exchange Commission (SEC) Chair Gary Gensler did not give a direct answer when asked whether Ether, the native cryptocurrency of the Ethereum blockchain, is a security or a commodity at a congressional oversight hearing on Tuesday.\n\nSee related story: CFTC chair calls Ethereum a commodity, in contrast to SEC chair Gensler’s position\n\nFast facts\n\nGensler directly addressed the House Financial Services Committee (HFSC) for the first time since October 2021, which was before the collapse of FTX and crypto-friendly banks, including Signature, Silicon Valley Bank, and Silvergate.\n\nGensler did not give a clear and direct answer to Congressman Patrick McHenry, the committee chairman, who asked if Ether, the second-largest cryptocurrency by market capitalization, is a security.\n\n“Actually, all securities are commodities under the Commodity Exchange Act. It’s that we are excluded commodities. But I would agree that a security cannot be also an excluded commodity and an included commodity,” responded Gensler.\n\nRegulators and prosecutors have held contrasting views on how to classify Ether. The Attorney General of New York recently called it a security, but the Commodity Futures Trading Commission Chair Rostin Behnam argued that it is a commodity.\n\nGensler hinted on multiple occasions that he may view cryptocurrencies based on the proof-of-stake consensus mechanism, such as Ether, as securities.\n\nIn May 2022, Gensler publicly labeled Bitcoin, the world’s largest cryptocurrency by market cap, as a commodity.\n\nGensler told the HFSC on Tuesday that the SEC needs more resources and bodies to regulate the crypto asset class.\n\nLate last month, Gensler testified before the Subcommittee on Financial Services and General Government and requested US$2.4 billion in funding from Congress for the agency’s operations, which includes its cryptocurrency crackdown.\n\nSee related story: SEC chair Gensler: No plans to ban crypto, says it’s ‘up to Congress’\n\n(Updates to fifth and eighth graph)"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZGVjcnlwdC5jby8xMzcxNjcvaGFja2VyLXN0b2xlbi0xMC1taWxsaW9uLWV0aGVyZXVtLW5vLW9uZS1rbm93cy1ob3fSAVJodHRwczovL2RlY3J5cHQuY28vMTM3MTY3L2hhY2tlci1zdG9sZW4tMTAtbWlsbGlvbi1ldGhlcmV1bS1uby1vbmUta25vd3MtaG93P2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "A Hacker Has Stolen $10 Million in Ethereum and No One Knows How - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA $10 million hack targeting sophisticated crypto users has top security experts baffled.\n\nTaylor Monahan, former CEO and founder of Ethereum wallet manager MyCrypto, said on Twitter Tuesday that over 5,000 in ETH had been stolen since December.\n\nThat’s over $10.4 million-worth of crypto at today’s prices.\n\nAD\n\nAD\n\nThe worrying part? It hit hardware wallets of users who prioritized security, according to Monahan.\n\n“For the past 48 hrs I’ve been unwinding a massive wallet draining operation,” wrote Monahan, who joined MetaMask after MyCrypto was acquired by the crypto wallet’s parent company ConsenSys last year. “Folks are those who are more crypto native than most” and “reasonably secure” were hit by the draining of funds, she tweeted.\n\nFor the past 48hrs I've been unwinding a massive wallet draining operation 😳😭 I don't know how big it is but since Dec 2022 it's drained 5000+ ETH and ??? in tokens / NFTs / coins across 11+ chains. Its rekt my friends & OGs who are reasonably secure. No one knows how. pic.twitter.com/MafntG7RkP — Tay 💖 (@tayvano_) April 18, 2023\n\nIn other words, these aren’t crypto newbies clicking on obvious phishing links that are being drained. The attack is far more sophisticated than that, and it’s OGs who are being “rekt,” Monahan explained. “No one knows how.”\n\nThe security team behind popular crypto wallet MetaMask told Decrypt that the “unidentified exploit” hit crypto users “including, but not limited, to MetaMask users.”\n\nAD\n\nAD\n\n“The on-chain behavior heavily suggests a private key compromise,” they said.\n\n“What current investigations are showing is that it seems that this specific attack vector is pointing towards these users’ secret recovery phrases being compromised somewhere down the line, likely due to unintentionally insecure storage of said phrase.”\n\nPrivate keys are used by crypto users to access their funds stored in a wallet—be it digital or physical—and authorize transactions.\n\nMonahan also said that the attack targeted funds held on wallets created from 2014-2022. “My best guess [right now] is that someone has got themselves a fatty cache of data from 1+ [years] ago [and] is methodically draining the keys as they parse them from the treasure trove,” Monahan tweeted. She emphasized that, however, that this is only a guess, and no one yet has been able to “determine the source of their compromise.”\n\nHer best advice? “Please don’t keep all your assets in a single key or secret phase for years,” she said.\n\nMetaMask’s security team added that in order to protect funds, users must not store their private keys anywhere online or on any “internet-enabled device.”\n\n“If you ever get to the point where your wallet is so old that you can’t remember if you’ve been 100% diligent with its keys at all times, then consider creating a new wallet,” they added."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wNC8xOC9yb2NrZXQtcG9vbC1tYWRlLWl0LWNoZWFwZXItdG8tc3Rha2UtZXRoLXRocm91Z2gtaXRzLXBsYXRmb3JtLWZvbGxvd2luZy1ldGhlcmV1bS1zaGFuZ2hhaS11cGdyYWRlL9IBkwFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wNC8xOC9yb2NrZXQtcG9vbC1tYWRlLWl0LWNoZWFwZXItdG8tc3Rha2UtZXRoLXRocm91Z2gtaXRzLXBsYXRmb3JtLWZvbGxvd2luZy1ldGhlcmV1bS1zaGFuZ2hhaS11cGdyYWRlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Rocket Pool Made It Cheaper to Stake ETH Through Its Platform Following Ethereum Shanghai Upgrade - CoinDesk",
        "content": "RPL has rallied almost 30% to $55.37 in the six days since Shapella, per CoinGecko. Rocket Pool’s total value locked (TVL) increased more than 20% to $1.47 billion in the same period, making it the third-largest liquid staking entity, trailing only Lido and Coinbase, data from DefiLlama shows."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vZm9ya2FzdC5uZXdzL2V0aGVyZXVtLWluZmxvd3Mtc2xvdy1mb2xsb3dpbmctc2hhbmdoYWktdXBncmFkZS1leGNoYW5nZXMtc2VlLWV0aGVyLWluZmx1eC_SAWVodHRwczovL2Zvcmthc3QubmV3cy9ldGhlcmV1bS1pbmZsb3dzLXNsb3ctZm9sbG93aW5nLXNoYW5naGFpLXVwZ3JhZGUtZXhjaGFuZ2VzLXNlZS1ldGhlci1pbmZsdXgvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Ethereum inflows slow following Shanghai upgrade, exchanges see Ether influx - Forkast News",
        "content": "Ethereum-linked products saw little investment interest with inflows of around US$300,000 in the week ending April 14, accounting for a tiny portion of the total US$114 million weekly inflow into digital assets and despite the blockchain’s milestone upgrade last week, according to a report from European cryptocurrency investment firm CoinShares.\n\nSee related article: Kraken to withdraw US$1.17 bln of staked Ether in line with SEC ruling, settlement\n\nFast facts\n\nTotal investment in digital asset products reached US$114 million last week, with Bitcoin getting the lion’s share of US$104 million, according to the report. It was the fourth week in a row of inflows.\n\n“This four-week run of inflows now total US$345 million, almost fully correcting the prior six-week run of outflows that totalled US$408 million,” the CoinShares report said. “We believe this is a flight to safety by investors fearful of the ongoing traditional finance challenges.”\n\nDevelopers of the Ethereum blockchain on April 12 updated the network with new features including allowing the withdrawal of staked Ether. Such tokens were deposited to support the operations of the Ethereum blockchain, the world’s second-biggest, in return for a passive income, usually in the form of more tokens.\n\nHowever, data from on-chain analysis company CryptoQuant showed during the period between April 13 and 17, cryptocurrency exchanges saw a net inflow of about 131,395 Ether (US$273.3 million), compared to the more than 1.46 million Ether in total transferred to the exchanges, a move typically indicating selling intention from crypto holders.\n\nAnalysts at crypto research firm Kaiko said on Monday that the ETH-USD pair on crypto exchange Coinbase has seen more sell orders than buys since the upgrade.\n\nAs of Tuesday noon in Hong Kong, around 1.06 million Ether have been withdrawn since the Wednesday upgrade with 465,940 Ether deposited, according to data from Token Unlocks.\n\nEther edged down 0.88% in the past 24 hours to change hands at US$2,080, but rose 8.24% in the past seven days, according to data from CoinMarketCap. Bitcoin fell 1.73% in the last 24 hours to trade at US$29,464, logging a 2.1% weekly drop.\n\nSee related article: Ethereum Shanghai upgrade prompts Ether withdrawals, but no stampede for exits"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3JvY2tldC1wb29sLWF0bGFzLWV0aGVyZXVtLXN0YWtpbmfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Rocket Pool Upgrade Lowers Ethereum Staking Cap to 8 ETH - Blockworks",
        "content": "Rocket Pool, the Ethereum-based DeFi staking protocol, has just pushed a major update granting users instant access to ETH staking rewards moving forward.\n\nAtlas, which launched without issue Monday evening, brings changes and features following the successful rollout of Ethereum’s Shapella upgrade last week. Shapella enabled ETH stakers to withdraw their crypto for the first time.\n\nThis meant Rocket Pool could lower Ethereum staking amounts for its so-called “minipools.” These tailored validator nodes now accept ETH stakes as small as 8 ETH ($16,800), down from 16 ETH ($33,600).\n\nStaking individually to the Ethereum blockchain demands at least 32 ETH ($67,100). Rocket Pool also supports pooling of ETH to boost chances of earning greater rewards.\n\n“Atlas has two themes, withdrawals and scaling Rocket Pool,” the team said in an Atlas live stream. “Node operators can now access their rewards they’ve generated over the last 14 months … if they want to, they can exit completely.”\n\nAtlas brings with it automatic rewards distributions, a unified Grafana dashboard and support for an Ethereum consensus client known as Lodestar.\n\nRocket Pool users can separately stake any amount of ETH to receive a liquid staking derivative token, rETH. Similar to other staking services such as Lido, Rocket Pool’s minipools and rETH let investors with less capital participate in the staking process to earn rewards otherwise out of reach.\n\nFurther changes made it easier to engage with the Ethereum blockchain by providing greater flexibility in Beacon Chain management, the team said.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1sYXllci0yLWJyaWRnaW5nLXVwLXNpeGZvbGQteWVhci1vbi15ZWFyLWluLXExLWFsY2hlbXnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Ethereum layer 2 bridging up sixfold year-on-year in Q1 — Alchemy - Cointelegraph",
        "content": "Ethereum layer 2s, such as Optimism, Arbitrum and Polygon, increased in popularity in the first quarter of 2023, according to a report from Web3 development platform Alchemy. Over 635,000 Ethereum users bridged crypto assets to these networks from January to March, an increase of 44% over the fourth quarter of 2023 and 518% over the first quarter of 2022.\n\nThe report, titled simply “Web3 Development Report,” cited Dune Analytics as its source for this data. It showed that only 103,000 users made bridging transactions to layer 2s in the first quarter of 2022, whereas the same three months saw over 635,000 users perform these transactions.\n\nAlchemy suggested that this increased activity may have been reinforced by successful airdrops from Optimism and Arbitrum in Q1, 2023.\n\nIn addition to increased asset bridging from users, layer 2s also showed greater activity from developers. Although the deployment of smart contracts related to layer 2s decreased by 30% relative to Q4 2022, it still increased by 160% when compared to Q1, 2022, the report said.\n\nThe crypto industry is coming off the back of a steep downturn in trading volume and crypto prices during 2022, with scandals like the UST depegging and FTX collapse causing many investors to shy away. But despite this negative sentiment, users still flocked to these new scalability solutions.\n\nRelated: 3 signs Arbitrum price is poised for a new record high in Q2\n\nThe Ethereum ecosystem as a whole also showed increased developer interest. Ethereum software development kits (SDKs) such as Ethers.js, Web3.js, Hardhat and Web3.py were downloaded 1.3 million times in Q1 2022. This became 1.9 million in the first quarter of 2023, an 8% increase. In addition, downloads of the MetaMask SDK, a tool used to develop apps that can interact with Ethereum wallet MetaMask, increased in each month of the first quarter.\n\nEthereum layer 2s have been offered as a solution to Ethereum’s scalability problem, which has been periodically causing high gas fees since as early as 2020. Some experts have argued that sharding the Ethereum network will also help to cut down on gas fees.\n\nThis story was updated on April 18 to clarify that the number of users bridging has increased by 518%, not the amount of assets bridged."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA0LzE4L2N1YmlzdC1sYXVuY2hlcy1iYW5rLWdyYWRlLWV0aGVyZXVtLWtleS1tYW5hZ2VtZW50LXNlcnZpY2Uv0gFsaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDQvMTgvY3ViaXN0LWxhdW5jaGVzLWJhbmstZ3JhZGUtZXRoZXJldW0ta2V5LW1hbmFnZW1lbnQtc2VydmljZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Cubist Launches Bank-Grade Ethereum Key Management Service - CoinDesk",
        "content": "“HSMs are the gold standard in the banking industry, and for a good reason,” said Wahby. “Conceptually an HSM means your key is bound to a physical object. That’s very different from a case where somebody puts malware on your computer and silently copies your keys, and then a few weeks later the hack happens.”"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2F1cm94LXdhbGxldC1ldGhlcmV1bS10cmFuc2FjdGlvbnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Aurox Makes it Simpler to Transact on Ethereum - Blockworks",
        "content": "Aurox wallet users will no longer need to hold ether to make transactions on the blockchain.\n\nOn Ethereum today, token swapping involves users having to hold ether (ETH) in their wallets so that they can pay for gas fees which will execute the transactions. This can be a confusing experience for users who are not yet familiar with the DeFi ecosystem.\n\nTo resolve this pain point, web brower extension-based Aurox Wallet has partnered with Chainlink to enable its users to pay gas fees in any ERC-20 token instead of paying for the cost in ETH.\n\nIn an interview with Blockworks, Aurox CEO Giorgi Khazaradze explains that one of the biggest challenges he came across when he first dabbled into the blockchain technology space was not understanding that he needed to hold certain tokens in order to make transactions on-chain.\n\n“I wanted to send USDC to my developer and I couldn’t because I didn’t have any ETH — I think a big holdup on people that are entering into DeFi is they don’t realize that one tiny thing can basically make your wallet useless,” Khazaradze said. “So we developed a version where even if you set up a brand new wallet, you deposit your USDC into it, you can swap that USDC in the wallet…you don’t ever have to touch ETH at all.”\n\nUnlike many of its competitors, Aurox Wallet will not be following the ERC-2771 token standard Khazaradze notes.\n\nERC-2771 requires users to approve transactions for the ERC20 token, which means they are still required to cough up ETH for network fees.\n\nAs it currently stands, only tokens such as DAI allow users to execute transactions without paying an approval transaction fee, Khazarade said.\n\nInstead, Aurox Wallet will be using Flashbots to bundle and approve transactions.\n\nFor example, if a user is trying to swap USDC for USDT, a bundled transaction will be sent to the Flashbots ​​Remote Procedure Call (RPC) and the transactions will be executed within the same block in three separate transactions:\n\nTransfer: ETH would be transferred from Aurox’s hot wallet to the user’s wallet if they do not hold any ETH.\n\nApproval: if necessary.\n\nSwap: The input token will be converted to ETH and paid back to Aurox for enabling the initial ETH transaction.\n\nPrices will be executed based on Chainlink Price Feeds to ensure users are getting accurate rates sourced from multiple different exchanges.\n\nAlthough multiple swaps will likely increase transaction fees, an Aurox GitHub post notes that these fees are offset by benefits such as Flashbots protecting users from being frontrun by MEV bots and is still relatively cheaper than paying trading and withdrawal fees on centralized exchanges.\n\nIt also notes that transactions are instant, meaning it is much faster than bridging tokens from another blockchain. Transferring ETH from another Web3 wallet is the only method that could be cheaper — albeit by a small margin.\n\nUltimately, Khazarade believes this new Aurox wallet feature will be able to eliminate “a pretty serious user experience problem for retail users.”\n\nA mobile version of the wallet along with hardware wallet support is planned.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDQvMTkvZXRoZXJldW0tZmVlcy1zcGlrZS1hcy1ib3RzLXNwZW5kLW1pbGxpb25zLXRvLWZyb250cnVuLXB1bnRlcnMtb2YtcGVwZS1jaGFkL9IBeWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDQvMTkvZXRoZXJldW0tZmVlcy1zcGlrZS1hcy1ib3RzLXNwZW5kLW1pbGxpb25zLXRvLWZyb250cnVuLXB1bnRlcnMtb2YtcGVwZS1jaGFkL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Fees Spike as Bots Spend Millions to Front-Run Punters of PEPE, CHAD - CoinDesk",
        "content": "A sandwich attack, traps a user's transaction between two transactions, which is then further manipulated to gain profits. This is done by front-running the victim's trade by buying the same asset, and then selling tokens to the victim in the same trade for a slightly higher price."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDQvMTkvY29pbmRlc2std2luZHMtZG93bi12YWxpZGF0b3ItemVsZGEtYXMtZXRoZXJldW0tZW5hYmxlcy1zdGFraW5nLXdpdGhkcmF3YWxzL9IBeWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDQvMTkvY29pbmRlc2std2luZHMtZG93bi12YWxpZGF0b3ItemVsZGEtYXMtZXRoZXJldW0tZW5hYmxlcy1zdGFraW5nLXdpdGhkcmF3YWxzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Apr 2023 07:00:00 GMT",
        "title": "CoinDesk Winds Down Ethereum Validator ‘Zelda,’ and We Now Wait to Get Money Back - CoinDesk",
        "content": "CoinDesk Winds Down Ethereum Validator ‘Zelda,’ and We Now Wait to Get Money Back\n\nFollowing last week's milestone Shanghai upgrade, we moved to wind down CoinDesk's Ethereum validator project, but it could be a week before the 32 ETH we staked (about $67,000 worth) hits our wallet. C. Spencer Beggs, our director of engineering, breaks down the technical steps he's taken."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMDQvMTkvc2VjLWNoYWlyLWdlbnNsZXItZGVjbGluZXMtdG8tc2F5LWlmLWV0aGVyLWlzLWEtc2VjdXJpdHktaW4tY29udGVudGlvdXMtY29uZ3Jlc3Npb25hbC1oZWFyaW5nL9IBjQFodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMDQvMTkvc2VjLWNoYWlyLWdlbnNsZXItZGVjbGluZXMtdG8tc2F5LWlmLWV0aGVyLWlzLWEtc2VjdXJpdHktaW4tY29udGVudGlvdXMtY29uZ3Jlc3Npb25hbC1oZWFyaW5nL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Apr 2023 07:00:00 GMT",
        "title": "SEC Chair Gensler Declines to Say if Ether Is a Security in Contentious Congressional Hearing - CoinDesk",
        "content": "Over the course of the marathon hearing, Gensler fended off questions about whether his agency was pushing too hard on proposed rules, providing too little time for public feedback on these rules, how it was approaching crypto companies hoping to operate in the U.S. and a host of noncrypto questions, including proposed disclosure requirements around climate change and audit trails."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tZXRoLWF0LXJpc2stYXMtc3Rha2VyLXNlbGwtb2ZmLWNvbmNlcm5zLWVtZXJnZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction: ETH At Risk As Staker Sell-Off Concerns Emerge - Analytics Insight",
        "content": "Ethereum (ETH) has been oscillating around the $2,100 level for the past four days as the Shapella upgrade excitement fades away. There are emergent signals of stakers positioning themselves for sell-action, as revealed by on-chain metrics. Traders are now concerned about the ability of the buyers to defend the immediate support level at $2,000.\n\nEthereum Stakers Are Ready To Offload\n\nFollowing an initial positive reaction to the successful Ethereum Shapella upgrade, the second largest altcoin by market capitalization now faces an uncertain short-term future. According to data from Glassnode, the supply of ETH deposited on exchanges has increased by more than 100,000 Ether since April 10. This is an indication that holders are seeking to sell their tokens, which can happen faster and easier when it is on the trading platforms.\n\nThe chart below shows that Ethereum balance on exchanges increased by 0.6% from 18.09 million ETH on April 13 (a day after stETH withdrawal was enabled) to 18.20 million ETH on April 17.\n\nNote that when crypto assets are held on exchanges, it makes them readily available for trading, and with Ethereum stakers pulling out their coins from the Beacon Chain, they could accumulate overhead pressure. Such an outcome could provoke a potential pullback in the next few days.\n\nAdditionally, an evaluation of the aggregate order books from different exchanges shows that the number of Ether available for sale at the moment is far more than the demand at the current market rates. On-chain data by IntoTheBlock reveals that there are open sell-orders for 6 million ETH around the +/-30% price boundaries. However, as it stands, buyers have only placed orders for around 5.2 million ETH.\n\nWhen exchange order books record more sell orders than buy orders, it usually means there is higher supply than demand for the asset.\n\nTherefore, the influx of Ethereum coins on exchanges, a sign of selling momentum accumulated possibly due to newly unstaked coins, and unbalanced exchange order books could all play out, triggering a sell-off in Ethereum price.\n\nEthereum Price At Risk Of 9% Losses\n\nETH was trading at $2,101, up 0.34% on the day, with a 24-hour trading volume of $9.23 billion. The largest altcoin was trading within a significant supply stretching from $1,900 to $2,150. If the price volatility remains the same, the Ethereum price could remain within this area for some time.\n\nThis means, a daily candlestick close below the $2,000 psychological level could see ETH drop toward the $1,900 defense level. This would represent a 9.4% drop from the current price. This could be where Ethereum’s downside is capped for the short-term.\n\nHowever, incase of immense selling, Ethereum could drop below $1,900 to revisit the 50-day Simple Moving Average (SMA) at $1,768, the 100-day SMA at $1,678, and the 200-day SMA at $1,486.\n\nETH/USD Daily Chart\n\nOn the other hand, Ethereum was trading above these SMAs, suggesting that it sat on relatively strong support that could absorb any selling pressure. In addition, the RSI was pointing upward and was positioned in the positive region at 70, reinforcing the buyers’ grip on the price.\n\nAs such, a daily candlestick close above the upper limit of the supply zone at $2,150 would confirm a bullish breakout for ETH. Such a move would bolster Ethereum toward $2,500 representing a 19.5% uptick from the current levels.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNC8xOS9hbmFseXN0LWtub3duLWZvci1jYWxsaW5nLWJvdHRvbXMtZm9yZWNhc3RzLWV0aGVyZXVtLWV0aC1yYWxseS10by1hbGwtdGltZS1oaWdocy1oZXJlcy1oaXMtb3V0bG9vay_SAYgBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDQvMTkvYW5hbHlzdC1rbm93bi1mb3ItY2FsbGluZy1ib3R0b21zLWZvcmVjYXN0cy1ldGhlcmV1bS1ldGgtcmFsbHktdG8tYWxsLXRpbWUtaGlnaHMtaGVyZXMtaGlzLW91dGxvb2svYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Apr 2023 07:00:00 GMT",
        "title": "Analyst Known for Calling Bottoms Forecasts Ethereum (ETH) Rally to All-Time Highs – Here’s His Outlook - The Daily Hodl",
        "content": "An analyst who correctly called Bitcoin’s (BTC) 2018 price floor says Ethereum (ETH) looks poised to significantly outpace the crypto king en route to its all-time highs.\n\nPseudonymous analyst Smart Contracter tells his 222,400 Twitter followers that he’s keeping an eye on the Ethereum versus Bitcoin pair (ETH/BTC).\n\nAccording to the crypto strategist, ETH/BTC has likely carved a 2023 low at around 0.062 BTC ($1,879) and may now be in a position to witness a sustained uptrend in the coming months.\n\n“So far ETH/BTC has played out exactly as I had predicted it would over four months ago down to the pico low [at] 0.062 level. The best part is I think it trades well over 0.10 ($3,032) by the end of the year.”\n\nA bullish ETH/BTC pair indicates that Ethereum is rising in value faster than Bitcoin. At time of writing, the ETH/BTC pair is trading for 0.069 BTC, worth $2,092.\n\nLooking at Ethereum itself, Smart Contracter says the leading altcoin has managed to take out a key resistance level on the weekly chart that has kept ETH bearish for almost a year.\n\n“ETH just had a mega-strong weekly close out of a 300-day range… Time to overcome the PTSD (post-traumatic stress disorder) and get back into the mindset of the good old days.”\n\nFollowing Ethereum’s breakout, Smart Contracter thinks that ETH could rally to its all-time high at around $4,800.\n\n“Tell me this thing ain’t going to all-time highs.”\n\nAt time of writing, Ethereum is trading for $2,097.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL21ldi1ib3QtcmVzcG9uc2libGUtZm9yLTctb2YtdG90YWwtZ2FzLW9uLWV0aGVyZXVtLW5ldHdvcmstaW4tMjQtaG91cnMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Apr 2023 07:00:00 GMT",
        "title": "MEV bot responsible for 7% of total gas on Ethereum network in 24 hours - CryptoSlate",
        "content": "MEV bot “jaredfromsubway.eth” is responsible for 7.26% of the total gas spent on the Ethereum (ETH) network in the last 24 hours, according to dune analytics data.\n\nAccording to the data, the bot spent 560.08 ETH — worth $1.1 million — in gas in the last 24 hours. The same address is responsible for around 4.5% — $2.5 million — of the gas fees spent on the blockchain network during the past week.\n\nThe top gas spenders list on Etherscan corroborates the above . This means the bot has spent more on gases than ETH layer2 networks like Arbitrum and Optimism during this period.\n\nNFT data research firm Sealunch said the bot has spent more than 3.720ETH ($7M) in gas fees and performed more than 180,000 transactions in the last 2 months.\n\nSealunch added that most of the bot transactions were sandwich attacks targeting traders trading low-cap tokens like PEPE, BONZI, and WOJAK. Sandwich attacks are often used to front-run unsuspecting users’ transactions for profit.\n\nMeanwhile, the bot transactions also pushed ETH gas fees higher, according to analyst Hildobby. According to data from ultrasound.money, the network’s base fees moved from under 20 gwei on April 12 to as high as 146.82 GWEI on April 19."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9ldGhlcmV1bS1ldGgtdGFwcGVkLW5ldy0xMS1tb250aC1oaWdoLWJpdGNvaW4tYnRjLXNsaXBzLWJlbG93LTMway1tYXJrZXQtd2F0Y2gv0gFsaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL2V0aGVyZXVtLWV0aC10YXBwZWQtbmV3LTExLW1vbnRoLWhpZ2gtYml0Y29pbi1idGMtc2xpcHMtYmVsb3ctMzBrLW1hcmtldC13YXRjaC8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Tapped New 11-Month High, Bitcoin (BTC) Slips Below $30K: Market Watch - CryptoPotato",
        "content": "After several days of trading above the coveted $30,000 line, bitcoin has slipped below that level, charting a 5-day low.\n\nIn contrast, ETH pumped a bit higher today to register its new highest price level since May last year. BNB, DOGE, and SOL are up by impressive percentages, meanwhile.\n\nBitcoin Falls Below $30K\n\nAfter regaining the $30,000 level last week, the primary cryptocurrency remained mostly above it for the next several days, and even the US CPI numbers couldn’t really shake it. The most significant price increase came on Friday when the asset touched $31,000 for the first time since June 2022.\n\nHowever, the bears intercepted the move and pushed BTC south. Hours later, it found itself dumping to $30,000 but managed to maintain that level during the weekend amid low trading volumes.\n\nAs Sunday was coming to an end, BTC initiated a leg up but was stopped ahead of $30,600. The subsequent rejection drove it south hard, and bitcoin went to a 5-day low of $29,800.\n\nAlicia Bakery CMO - A really good agency Did you like this market update?\n\nThis is all you need not to miss any price action in the raging crypto markets. Start receiving this recap, for free, every day: Invalid email address Your privacy is guranteed. Thanks for subscribing, you will get your first report in the next hours!\n\nAs of now, the asset has recovered around $100 but still stands below $30,000. Its market capitalization has retraced to under $580 billion, while its dominance over the alts has taken another hit and is now down to 45.7% after exceeding 47% a week ago.\n\nETH’s New Local Peak\n\nEthereum stole bitcoin’s spotlight last week upon the completion of the long-anticipated Shapella update. Its native token has massively outperformed BTC, resulting in increasing its dominance. Amid the substantial moves in staked ETH, the asset spiked once more hours ago to over $2,130 to chart its latest 11-month high before retracing to just under $2,100 as of now.\n\nBinance Coin, Dogecoin, Solana, and Litecoin have all added somewhere between 3-4% in a day. As a result, BNB trades at $345, DOGE is above $0.9, SOL is at $25, and LTC is inches away from $100.\n\nAvalanche has soared by 6% in a day and over 15% in a week to exceed $20.\n\nThe total crypto market cap has remained at essentially the same spot as yesterday at $1.265 trillion on CMC."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNC8xOC9jYXJkYW5vLWRlZmktZWNvc3lzdGVtLWV4cGxvZGVzLWFzLWV0aGVyZXVtLXJpdmFscy10dmwtZ29lcy11cC0xNzItc2luY2UtbGFzdC15ZWFyLWNyeXB0by1pbnNpZ2h0cy1maXJtL9IBjQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNC8xOC9jYXJkYW5vLWRlZmktZWNvc3lzdGVtLWV4cGxvZGVzLWFzLWV0aGVyZXVtLXJpdmFscy10dmwtZ29lcy11cC0xNzItc2luY2UtbGFzdC15ZWFyLWNyeXB0by1pbnNpZ2h0cy1maXJtL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Cardano DeFi Ecosystem Explodes As Ethereum Rival’s TVL Goes Up 172% Since Last Year: Crypto Insights Firm - The Daily Hodl",
        "content": "New data from crypto insights firm Messari shows the Cardano (ADA) ecosystem’s rapid expansion over the last year.\n\nIn a new report, Messari says that Cardano’s total value locked (TVL), or the amount of assets sitting within its protocols, has gone up 172% quarter over quarter (QoQ).\n\nAccording to Messari, the recent launch of Cardano-stablecoins were the main drivers behind the growth.\n\n“Total value locked (TVL) denominated in USD on Cardano grew 172% QoQ from $50.8 million to $138.3 million. The recent adoption of new stablecoins was a catalyst for this growth, as they are a cornerstone of DeFi but were missing from the ecosystem.”\n\nMessari says that Minswap, an automated market maker (AMM) on Cardano, remains the chain’s leading decentralized exchange (DEX) as far as TVL, but decreased in dominance over the first quarter due to the emergence of several DeFi (decentralized finance) protocols, including ADA-backed stablecoin Djed.\n\n“The shift in dominance from incumbent DEXs to emerging DeFi applications is due to:\n\nDjed, an overcollateralized ADA-backed stablecoin minting protocol, ending Q1 with a TVL of $13.1 million and a dominance of 9.5%.\n\nLiqwid, a borrowing and lending protocol, ending Q1 with a TVL of $8.4 million and a dominance of 6%.\n\nIndigo, an issuer of synthetic assets and stablecoins, ending Q1 with a TVL of $24.1 million and a dominance of 17.4%.”\n\nMessari says that in Q1 of this year, Cardano saw significant progress in technological developments such as advancements in scalability and VM (virtual machine) compatibility.\n\nLast week, Cardano developers Input Output Global announced the launch of Lace, a new Cardano-native crypto wallet that supports hardware wallet integration and access to NFT (non-fungible token) marketplaces, decentralized apps (DApps) and DeFi services. Users can also stake ADA directly from the platform.\n\nThe developers say they are already working on new features that will be added to future releases as they promise to give Lace a slew of regular updates and enhancements.\n\n“The Lace team is already hard at work developing a DApp Store, a desktop app and digital identity solutions. Meanwhile, fiat on/off ramps, in-wallet swaps, a richer staking experience with multi-delegation, and a portfolio view are all in the pipeline.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/VectorBar/Mingirov Yuriy"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vdW5jaGFpbmVkY3J5cHRvLmNvbS9zZWMtY2hhaXItZ2FyeS1nZW5zbGVyLWF2b2lkcy1xdWVzdGlvbi1pcy1ldGhlcmV1bS1hLXNlY3VyaXR5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Apr 2023 07:00:00 GMT",
        "title": "SEC Chair Gary Gensler Avoids Question: 'Is Ethereum a Security?' - Digital Assets - Unchained - Unchained",
        "content": "U.S. House Financial Services Committee Chair Patrick McHenry pressed SEC Chair Gary Gensler to give a definitive answer about his stance on Ethereum.\n\nU.S. Securities and Exchange (SEC) Chair Gary Gensler repeatedly dodged the question on whether Ethereum is a security or a commodity.\n\nIn an April 18 hearing before the House Financial Services Committee, Gensler was questioned by the Committee’s chair Patrick McHenry on his stance on the second-largest cryptocurrency by market cap.\n\nMcHenry referenced prior statements made by former Director of the SEC’s Corporate Finance Division Bill Hinman that ETH was not a security (which would make it a commodity), and statements last month from the CFTC Chair Rostin Benham that ETH was a commodity against a contradictory one by NYAG Letitia James that ETH was a security.\n\n“Clearly an asset cannot be both a commodity and a security. Do you agree?” McHenry asked Gensler.\n\n“Actually, all securities are commodities under the Commodity Exchange Act. It’s that we are excluded commodities. But I would agree that a security cannot be also an excluded commodity and an included commodity,” Gensler responded.\n\nMcHenry then asked Gensler to make an assessment, under the laws that exist today, to categorize Ether as either a commodity or a security.\n\n“You’ve repeatedly said you’re not going to speak to one, except you’ve spoken to one: Bitcoin. So I’m asking you to speak to the second-largest [cryptocurrency] by market cap here,” McHenry said.\n\nGensler alluded to the “ten to twelve thousand” tokens that exist today, seemingly intending to make a point about a group of entrepreneurs that launch a token with the intent of making a profit, but McHenry pressed him to specifically answer the question he posed.\n\nWhen Gensler attempted to avoid giving a direct answer again, saying he did not want to “pre-judge” on the subject, McHenry pointed out that he had in fact done so by bringing 50 enforcement actions against crypto firms.\n\n“We’re finding out as we go, as you file suit, as people get Wells notices, on what is a security in your view, in your agency’s view,” said McHenry.\n\nIn March, The Block reported that Gensler suggested that Proof-of-Stake tokens, a category that Ethereum now falls under, are securities. In his view, the concept of users locking up tokens in a protocol with the anticipation of profit would put those token operators under the purview of the agency."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9ibG9ja2NoYWluLXByb2plY3QtdG9uLWxhdW5jaGVzLWV0aGVyZXVtLWJyaWRnZS_SAU1odHRwczovL2NyeXB0b3BvdGF0by5jb20vYmxvY2tjaGFpbi1wcm9qZWN0LXRvbi1sYXVuY2hlcy1ldGhlcmV1bS1icmlkZ2UvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Apr 2023 07:00:00 GMT",
        "title": "Blockchain Project TON Launches Ethereum Bridge - CryptoPotato",
        "content": "The TON Foundation – a non-profit association of developers and enthusiasts behind The Open Network (TON) – has announced the rolling out of a two-way bridge to facilitate the transfer of ERC-20 tokens from Ethereum to natively wrapped fungible tokens (Jettons) on TON.\n\nAccording to the press release shared with CryptoPotato, the bridge is designed to offer a seamless transactional interface between Ethereum and TON. This marks a “significant milestone” in the evolution of the TON ecosystem.\n\nFirst Unlimited Bridge Goes Live\n\nThe new offering, touted as – the first unlimited bridge – will help users to bridge Wrapped Bitcoin (wBTC), Tether tokens (USDt), USD Coin (USDC), and Dai (DAI). At launch, users will only be able to bridge over four assets. Going forward, the TON Foundation intends to make more tokens available for bridging soon.\n\nThe foundation has welcomed white hat hackers to test the security integrity of the unlimited bridge through a hackathon in 2022.\n\nThe announcement further revealed that audits from prominent blockchain security firm CertiK, а smart contract auditor, Quantstamp, a specialist auditor in the blockchain space, and Hexens, a smart contract auditor, were made on the bridge.\n\nWhile validators voted on the formation, CertiK and Quantstamp conducted end-to-end audits on the TON blockchain. Commenting on the development, Justin Hyun, Head of Incubation at TON Foundation, said:\n\n“We are delighted with the introduction of this two-way bridge, the first unlimited bridge to go live on TON. We anticipate that this bridge will bring a host of new users to the TON ecosystem. By entering into closer proximity with other layer one blockchains through such bridges, our users will experience the advantages that TON holds over its competitors.”\n\nTether Integration\n\nThe latest development comes less than a month after Telegram added a new feature enabling users to send each other the world’s largest stablecoin, Tether, on the Tron blockchain.\n\nThe new feature enabled users to buy, swap, and make P2P trades with TRC20 by expanding the app’s facility for crypto payments. This also allowed users on the instant messaging service to directly send USDT to their peers with no transaction fees."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMioQFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9jcnlwdG8tcHJpY2UtcHJlZGljdGlvbnMtMjAyMy13aHktYml0Y29pbi1wcmljZS1wdW1wLXRvLTYway1ldGhlcmV1bS1wcmljZS13aWxsLXN1cmdlLXBhc3QtNmstYW5kLWxvdmUtaGF0ZS1pbnUtd2lsbC1yYWxseS10by0yL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Apr 2023 07:00:00 GMT",
        "title": "Crypto Price Predictions 2023: Why Bitcoin Price pump to $60k, Ethereum Price will surge past $6k, and Love Hate Inu ... - Analytics Insight",
        "content": "We are currently experiencing market conditions we have not seen since we first started to come out of the pandemic. 2023 has truly been a blessing for the market after it experienced one of its worst periods ever at the back end of 2022.\n\nThe new year began with a bull run and it has been a case of start as you mean to go on for the market as a whole. Sure there have been some blips along the way but generally things have been pointing upward. The emergence of presales as successful as Love Hate Inu (LHINU) and the recovery of traditional giants Bitcoin (BTC) and Ethereum (ETH) shows how the growth is really market-wide and indicates this is not a flash in the pan thing and should continue through Q2 and beyond.\n\nThere was a lot of caution preached after the first bull run of the year that it likely wasn’t sustainable and even as Bitcoin and Ethereum continued to grow after the run on traditional banks some experts were still saying the growth would slow due to interest rate hikes. Well, that hasn’t been the case and even though news coming from the feds suggests rates will still not be slashed by Q3 there is still positive buzz around the market.\n\n>>Buy Love Hate Inu Now!<<<\n\nWhy BTC and ETH will not stop pumping\n\nNow even the most skeptical of analysts are starting to change their tone. There has been too much growth market-wide to dismiss it as anything other than real. Bitcoin (BTC) and Ethereum (ETH) are the market’s two biggest currencies so their price movement tends to be mirrored by the market as a whole. It is their continued positive movement that has won over the doubters.\n\nIn the chart above we can see Bitcoin’s growth over the last 3 months. This is the reason many believe it can return to the heights of 2021 and finally break $60,000 again. It has already seen growth of over 55% since the start of the year and that’s even after the disappointment of interest not being slashed as they were predicted to be at the start of the year.\n\nSo imagine what will happen to the price once these rates finally slow and are cut? The price will likely go through the roof! This is on top of the news that has been consistently flowing in from around the world about countries softening their views of Bitcoin and many taking steps toward hiring regulators so as to introduce it to their markets in the future.\n\nWhen we take all the above into consideration and the fact that eventually, inflation rates will have to stop, we think $60,000 might even be a modest marker for Bitcoin in the next few years.\n\n>>>Buy Love Hate Inu Now!<<<\n\nUnlike Bitcoin, Ethereum has been experiencing growth due to events happening within the ecosystem. On April 12th the long-awaited Shanghai upgrade took place. This was the first time ETH holders could finally withdraw the native currency and any rewards they had incurred.\n\nSome experts feared this would plummet the price of ETH due to a mass withdrawal of funds but it looks like it has mostly been the rewards that have been withdrawn. This of course strengthens Ethereum’s position as clearly, their holders believe in the project long-term.\n\nJust looking at the chart above we can see nearly 75% growth in just the last 3 months alone. Just like with Bitcoin, the $6k barrier actually feels like it will be broken by Ethereum a lot sooner than many would have thought a little while ago.\n\nWhile these traditional giants look set to continue to pump the presale of Love Hate Inu (LHINU) is gathering a similar amount of attention, let’s see why!\n\n>>>Buy Love Hate Inu Now!<<<\n\nLove Hate Inu- Meme coin set to break $2 once launched\n\nIt is nearly unheard of that a presale coin would be in the news as much as coins like Ethereum and Bitcoin, but Love Hate Inu (LHINU) is no ordinary coin and it represents the most exciting project on the market right now.\n\n>>>Buy Love Hate Inu Now!<<<\n\nThe presale is still not even two months old and already it has raised over $4.5 million. Why is this the best investment opportunity right now? Well, firstly it’s the very first meme coin/V2E platform meaning it will have the virality of a meme coin and the utility of a staking coin. We think that once launched it will easily pump to $2 and beyond.\n\nOne look at the site now and you will see why experts and influencers can’t dedicate enough words to this crypto. For example, it is showing its future users the kind of polls they will be able to vote on, they have a ‘do you love or hate celebrity x’ poll currently to view. Each celebrity is represented by a hilarious angel and devil meme version of themselves.\n\n>>Buy Love Hate Inu Now!<<<\n\nThis of course will draw in the influencers but the experts have been drawn in by the very comprehensive white paper. Love Hate Inu is really thinking about the future and security of their project. 90 percent of the total coin allocation will be sold at presale to prevent a dodgy rug pull from happening once the coin goes to its CEX listings, this also ensures only the real LHINU lovers will have a say in any future company decisions.\n\n>>>Buy Love Hate Inu Now!<<<\n\nIf you weren’t sold on Love Hate Inu being the best investment opportunity on the market they also put their user’s experience to the forefront. A stake-2-vote system will be implemented that requires users to stake LHINU for 30 days before they can vote. This in turn ensures a voter’s anonymity which will also be useful in the discussion platform that will be available under polls.\n\nThe more you stake the more control you will have over these polls. Also, in the future, users will be able to suggest and run their own polls. This is to harvest a community vibe and the users will need to put forward their own LHINU to run the poll. There can then be a lively discussion about what polls should go on the site, giving a lot of the power to the users.\n\nThe price of LHINU once launched will be $0.000145 so predicting a growth spurt to $2 is ambitious. However, the market has not seen a meem coin with its capabilities before so we think it will blow the competition out of the market and soar past $2 in the future.\n\n>>>Buy Love Hate Inu Now!<<<\n\nConclusion\n\nIt seems to be good news all around for the crypto market, we have incredibly successful presales like Love Hate Inu ongoing, and traditional giants Bitcoin and Ethereum look set to reach previous highs. Of all 3 Love Hate Inu is by far the best investment opportunity, its room to grow is far bigger than the other two and it can be bought at a rock bottom price meaning investors can stockpile it before it pumps.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGgtc3Rha2luZy1wYXNzZXMtd2l0aGRyYXdhbHMtZm9yLXRoZS1maXJzdC10aW1lLWFmdGVyLXNoYXBlbGxhLXVwZ3JhZGXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "ETH staking passes withdrawals for the first time since Shapella upgrade - Cointelegraph",
        "content": "The Ethereum blockchain underwent a successful Shapella upgrade on April 12, allowing validators to withdraw their staked Ether (ETH) from the Beacon Chain after three years. After seeing over 1 million ETH in withdrawals in the first week, the amount of staked ETH has now surpassed the number of ETH being withdrawn for the first time since the Shapella upgrade.\n\nData from the on-chain analytics firm Nansen suggests that more ETH is currently being staked than withdrawn. As of April 17, the ETH staking volume of 124,000 ETH exceeded the withdrawal volume of 64,800 ETH for the first time. In the last 24 hours, the amount of staked ETH was 94,968 against 27,076 in withdrawals. The first round was primarily partial withdrawals from Lido and old validators. It takes approximately three days to get into the withdrawal queue.\n\nVolume of staked ETH vs withdrawals. Source: Nansen\n\nThe Shapella upgrade was projected as a make-or-break situation for the Ethereum blockchain as millions in unlocked ETH posed a risk of mass selling. However, the majority of the validators are restaking their unlocked Ether. Crypto exchange Binance will open withdrawals on April 19.\n\nRelated: Ethereum price metrics hint that ETH might not sell off after the Shapella hard fork\n\nOut of the 1 million withdrawn ETH, three addresses restaked a total of 19,844 ETH. Three addresses transferred ETH to centralized exchanges (CEXs) after withdrawal, with 71,444 ETH sent to different exchanges. Other whales did the same, with some sending it to Huobi staking addresses and a few others to CEXs, according to data shared by Lookonchain.\n\nMost early withdrawals are staking rewards, and a few validators, like Kraken, had to exit to comply with a United States Securities and Exchange Commission ruling. Currently, 22,231 validators have signed up for a complete exit out of 574,624, while 910,930 ETH of the 18.6 million staked ETH is slated to be withdrawn.\n\nAnother prominent reason for the diminishing withdrawals could be ETH’s price, as the average price of staked ETH is about $2,137.\n\nMagazine: 2023 is a make-or-break year for blockchain gaming: Play-to-own"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2V0aGVyZXVtLXByaWNlLXB1bXBzLTEwLWJ1dC10YW1hZG9nZS1pcy1zZXQtdG8tcmlzZS0yMDAtYWZ0ZXItYS1uZXctZXhjaGFuZ2UtbGlzdGluZy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Ethereum price pumps 10%, but Tamadoge is set to rise 200% after a new exchange listing! - Analytics Insight",
        "content": "The long-awaited Ethereum’s Shanghai update finally happened. The final step of Ethereum’s transition from proof of work to proof of stake pushed Ethereum’s price up by $2,000.\n\nThis is the first time Ethereum’s price has pumped this much in eight months, reaching the highest level since March 2022. Now, Ethereum price predictions say this second-largest crypto could reach a maximum of $3,380.14 this year.\n\nWhether or not these real increases will happen is yet to be seen, but experts agree this price pump will affect other Ethereum-based cryptos too.\n\nIn particular, Tamadoge, as one of the well-known Ethereum-based cryptos, could face exponential growth.\n\nExperts think this meme crypto could even outperform Ethereum and become one of the best cryptos to invest in this year. Moreover, the project is on a fast track to dethroning Shiba Inu and Dogecoin as the most successful meme coin, thanks to its cutting-edge technology and powerful tokenomics.\n\nHere is a short overview of everything happening in the Tamadoge universe lately. Also, we will name a few reasons why you should choose Tamadoge over other meme coins and Ethereum-based projects.\n\n>>>Buy Tamadoge Now<<<\n\nTamadoge to rise 200% after a new exchange listing\n\nTamadoge will list on a top 5 crypto exchange on April 27th, the Tamadoge team announced. Tamadoge will confirm the name of the exchange on April 24th, a few days before the listing.\n\nThe announcement will set the Tamadoge’s price to a bullish movement. Crypto experts believe this new listing will push TAMA’s price above $0.0133.\n\nThis listing would make this meme project available to millions of new investors worldwide. TAMA’s price could break the $0.22 level and jump by over 120%, looking mid-term.\n\n>>>Buy Tamadoge Now<<<\n\nPotential new high on the horizon\n\nZooming in on TAMA’s long-term price, there are three potential price targets: $0.0225 (66% gain), $0.034 (156% gain), and $0.042 (234% gain).\n\nTamadoge had the first price pump after the OKX listing. Then, TAMA’s price hit an all-time high of $0.196. But since then, Tamadoge has established itself as the best P2E platform.\n\nThis leads to price sustainability and new price pumps, especially after the positive news about the project.\n\nThe listing on the top-tier exchange is just the first step in the process of making Tamadoge the meme coin of the future. The exchange listing, combined with investors’ loyalty to the project and positive project fundamentals, can take TAMA to a new price high.\n\n>>>Buy Tamadoge Now<<<\n\n22k users are enjoying Tamadoge P2E Arcade\n\nTamadoge recently released Play 2 Earn Arcade with five games players can access to earn rewards:\n\nRocket Doge – A game in which you navigate your Tamadoge through obstacles using rockets.\n\nSuper Doge – Your Tamadoge pets must collect in-game coins while battling enemies.\n\nTo the Moon – You must take your Tamadoge to the moon or new heights.\n\nTamadoge Run – Set in the graveyard, Tamadoge pet must fight ghosts and doge devils.\n\nTama Blast – Your Tamadoge must score as many goals as possible\n\nAs of April 13th, 22k users played on the Tamadoge Arcade and spent over 84,000 credits in the ecosystem.\n\n>>>Buy Tamadoge Now<<<\n\nWhat makes Tamadoge a terrific investment option?\n\nTamadoge is the first meme coin with utility that provides real value for users.\n\nThis is the token of the future. Tamadoge builds on the success of Doge and uses the tried and tested principles that allow you to breed your pet.\n\nTamadoge is the NFT pioneer. The project uses the latest NFT technology, helping you to inject life into Tamadoge pets.\n\nThe system is structured to create demand.\n\nTamadoge is designed to have a large user base because it is created for non-P2E gamers, too.\n\n>>>Buy Tamadoge Now<<<\n\nWhy should you invest in Tamadoge?\n\nYou get the token that will increase its value. The newest exchange listing will pump TAMA’s price by 200%, increasing its price on other exchanges.\n\nYou get the token with utility. Meme coins with utility are the only ones to survive the changing crypto market, and Tamadoge will overthrow Shiba Inu and Dogecoin.\n\nYou don’t have any transaction costs on your purchase.\n\nYou earn great rewards while playing fun games and showing your skills.\n\nYou invest in the token of the future.\n\n>>>Buy Tamadoge Now<<<\n\nFinal thoughts\n\nNow is the best time to buy Tamadoge and enjoy great rewards. Different exchanges listed TAMA, from OKX to LBANK, Uniswap, MEXC, and BKEX.\n\nThe tremendous potential of Tamadoge has attracted numerous investors who are enjoying many benefits the project offers. Join them now and get the token of the future!\n\n>>>Buy Tamadoge Now<<<\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNC8xOC90b3AtZXRoZXJldW0tYWx0Y29pbi1leHBsb2Rlcy00Ny1pbi1vbmUtd2Vlay1hcy13aGFsZXMtc2VuZC1taWxsaW9ucy1vZi10b2tlbnMtdG8tY3J5cHRvLWV4Y2hhbmdlL9IBhwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNC8xOC90b3AtZXRoZXJldW0tYWx0Y29pbi1leHBsb2Rlcy00Ny1pbi1vbmUtd2Vlay1hcy13aGFsZXMtc2VuZC1taWxsaW9ucy1vZi10b2tlbnMtdG8tY3J5cHRvLWV4Y2hhbmdlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Top Ethereum Altcoin Explodes 47% in One Week As Whales Send Millions of Tokens to Crypto Exchange - The Daily Hodl",
        "content": "A couple of crypto whales unloaded millions of Arbitrum (ARB) after the popular Ethereum (ETH) scaling solution witnessed significant gains this week.\n\nBlockchain tracker Lookonchain notes that the largest buyer of Arbitrum on its first day of listing back in March transferred a large stack of nearly 10,000 ARB, worth about $17 million, to top crypto exchange Binance a few days ago.\n\nA separate ARB whale also transferred its entire Arbitrum bag, worth $18 million, to Binance on Friday, according to Lookonchain.\n\n“The whale with 11 million ARB ($18 million) transferred all ARB to Binance…\n\nThe buying cost was $13.55 million and the average buying price was ~$1.24.\n\nIf he sells at $1.64, he will make a profit of $4.54 million, an ROI (return on investment) of 33%.”\n\nThe 33rd-ranked crypto asset by market cap rallied from a seven-day low of $1.16 to a high of $1.71, marking gains of over 47%. ARB has slightly given up some of its gains and is trading for $1.63 at time of writing.\n\nArbitrum currently ranks fourth among all chains in terms of total value locked (TVL) with $2.27 billion, behind Ethereum, Tron (TRX) and BNB Smart Chain, according to the decentralized finance tracker DeFi Llama.\n\nThe TVL of a blockchain represents the total capital held within its smart contracts. The metric is calculated by multiplying the amount of collateral locked into the network by the current value of the assets.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vdW5jaGFpbmVkY3J5cHRvLmNvbS93aHktbWV2LXdpbGwtYWx3YXlzLWJlLWNvbnRyb3ZlcnNpYWwv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Why MEV Will Always Be Controversial - Unchained - Unchained",
        "content": "Episode 482\n\nMaximal extractable value, or MEV, is a mainstay of the Ethereum landscape. But the process of validators reaping profits from handling new blocks is not without controversy. Ethereum Foundation researcher Justin Drake and bloXroute Labs CEO Uri Klarman assess the current state of MEV. Hear them disagree about the path forward for making Ethereum fairer for all its economic actors.\n\nListen to the episode on Apple Podcasts, Spotify, Overcast, Podcast Addict, Pocket Casts, Stitcher, Castbox, Google Podcasts, TuneIn, Amazon Music, or on your favorite podcast platform.\n\nShow highlights:\n\nwhat MEV is and how it has evolved over time\n\nthe nuances of the newly proposed MEV Blocker and why it’s important for users\n\nwhether it’s possible to enable “back-running” while preventing front-running\n\nhow to give power back to blockchain users\n\nwhat the differences and similarities are among several projects trying to solve MEV\n\nhow “MEV Burn” will be like the EIP-1559 to what Justin calls contention\n\nwhether EigenLayer can help solve MEV problems\n\nwhether wallets and DEXs could be doing something different to prevent MEV and generate more revenue\n\nhow “exclusive order flow” could be detrimental to DeFi users\n\nwhat proposer-builder separation (PBS) is and whether it will change MEV distribution\n\nwhy Uri doesn’t think PBS is the right step forward for Ethereum\n\nThank you to our sponsors!\n\nGuests:\n\nJustin Drake, researcher at the Ethereum Foundation\n\nUri Klarman, CEO of bloXroute Labs\n\nLinks\n\nMEV Blocker\n\nMEV Distribution\n\nMEV Smoothing\n\nMEV Burn\n\nProposer-Builder separation"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL2dhcnktZ2Vuc2xlci1zdHVtYmxlcy1vbi13aGV0aGVyLWV0aGVyZXVtLWlzLWEtc2VjdXJpdHktb3ItYS1jb21tb2RpdHkv0gFmaHR0cHM6Ly9jb2lucGVkaWEub3JnL25ld3MvZ2FyeS1nZW5zbGVyLXN0dW1ibGVzLW9uLXdoZXRoZXItZXRoZXJldW0taXMtYS1zZWN1cml0eS1vci1hLWNvbW1vZGl0eS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Apr 2023 07:00:00 GMT",
        "title": "Gary Gensler Stumbles On Whether Ethereum Is A Security Or A Commodity - Coinpedia Fintech News",
        "content": "Qadir Ak is the founder of Coinpedia. He has over a decade of experience writing about technology and has been covering the blockchain and cryptocurrency space since 2010. He has also interviewed a few prominent experts within the cryptocurrency space.\n\nThe House Financial Services Committee is holding a hearing to perform oversight of the Securities and Exchange Commission. Republicans on the committee have stated that they are dedicated to holding Chair Gensler responsible for his strategy of regulating the digital asset ecosystem through enforcement, his reckless regulatory agenda, and his disregard for the Commission’s capital formation mandate.\n\nWhen questioned about the status of Ethereum as to whether it is a security or commodity. Gensler falters before the house.\n\nSEC Chair Gary Gensler Gets Grilled On Crypto Regulation In The U.S. House Hearing\n\nIn his opening remarks, Representative Patrick McHenry brought up the commission’s “punishing” of companies who deal in digital assets through regulation and enforcement without a clear route to compliance. The congressman renewed proposals for legislation that would provide “clear rules of the road” for cryptocurrency.\n\nFurther, to Chairman McHenry’s dismay, the SEC Chair evaded a direct response when Gensler inquired if Ethereum (ETH) was a security or a commodity. The Chair of the House Committee repeatedly questioned Gensler about ETH in particular given the 50 enforcement actions, to which Gensler attempted to respond in a generic manner by saying, “It depends on the facts of the law.”\n\nGensler’s vague comments were repeatedly highlighted by McHenry, who cited the SEC chair’s desire to classify Bitcoin as a commodity and hinted at earlier, private discussions on ETH before the hearing.\n\n“Clearly an asset cannot be both a commodity and a security,” said McHenry. “I’m asking you, sitting in your chair now, to make an assessment under the laws as exist, is Ether a commodity or a security?”\n\n“You have pre-judged on this: you’ve taken 50 enforcement actions. We’re finding out as we go, as you file suit, as people get Wells notices, on what is security in your view, in your agency’s view.”\n\nGensler had previously stated in his pre-hearing testimony that cryptocurrency intermediates were engaging in securities transactions and should register with the SEC. An all-Republican coalition of lawmakers challenged this position in a letter denouncing the SEC’s viewpoints. Regulatory frameworks that are incompatible with the underlying technology and inapplicable to laws governing the issuing of securities, according to the letter, were imposed on crypto businesses by the SEC.\n\nCommunity Reactions\n\nThe crypto community, which has long criticized Gary Gensler’s leadership of the SEC and its policies, has praised the inquiries made by Rep. Patrick McHenry.\n\nSome have said that Gensler ought to be removed from his role as SEC chairman immediately and should be replaced by somebody with more industry knowledge."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMikwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9hLXNtYWxsLWNoYW5nZS1vZi1jb2RlLWEtZ2lhbnQtbGVhcC1mb3Itd2ViMy1ldGhlcmV1bXMtc2hhcGVsbGEtdXBncmFkZS9hcnRpY2xlc2hvdy85OTU4MTE0NS5jbXPSAZcBaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvYS1zbWFsbC1jaGFuZ2Utb2YtY29kZS1hLWdpYW50LWxlYXAtZm9yLXdlYjMtZXRoZXJldW1zLXNoYXBlbGxhLXVwZ3JhZGUvYW1wX2FydGljbGVzaG93Lzk5NTgxMTQ1LmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "A small change of code, a giant leap for Web3: Ethereum's Shapella upgrade - The Economic Times",
        "content": "(What's moving Sensex and Nifty Track latest market news stock tips and expert advice , on ETMarkets . Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .)\n\nDownload The Economic Times News App to get Daily Market Updates & Live Business News.\n\nSubscribe to The Economic Times Prime and read the Economic Times ePaper Online.and Sensex Today.\n\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3Mvc2VjLWNoYWlyLWdhcnktZ2Vuc2xlci1yZWZ1c2VzLXRvLWFuc3dlci1pZi1ldGhlcmV1bS1ldGgtaXMtYS1zZWN1cml0eS1kdXJpbmctY29uZ3Jlc3Npb25hbC1oZWFyaW5n0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "SEC Chair Gary Gensler Refuses to Answer if Ethereum (ETH) is a Security During Congressional Hearing - Watcher Guru",
        "content": "While testifying before Congress today, SEC Chair Gary Gensler refused to answer if Ethereum (ETH) was a commodity or a security. Moreover, the hearing before the House Financial Services Committee regarded potential SEC oversight in regulatory action taken against the digital asset industry.\n\nWithin his pre-hearing testimony, Gensler restated his opinion that crypto assets are compatible with existing securities laws. Conversely, Gensler refused to offer a straight answer to questions on the security status of Ethereum.\n\nJUST IN: 🇺🇸 SEC Chair Gensler refuses to answer if Ethereum $ETH is a commodity or a security while testifying before congress. pic.twitter.com/IkDTgNrfix — Watcher.Guru (@WatcherGuru) April 18, 2023\n\nGensler Confronted on Crypto Security Claim\n\nThe chairman of the US Securities and Exchange Commission was called before Congress today. Specifically, the hearing was centered around action taken by the regulator regarding the digital asset industry.\n\nWithin that hearing, SEC Chair Gary Gensler refused to say if Ethereum (ETH) is a commodity or a security. Indeed, Gensler faced questions from House Committee Chairman Patrick McHenry. Subsequently, in answering the question regarding this, Gensler replied, “It depends on the facts of the law.”\n\nSource: Pensions & Investments\n\nAmidst the hearing, Chairman McHenry noted that the SEC took 50 different enforcement actions against the digital asset industry. Furthermore, they did so without laying out clear rules of operation for stakeholders.\n\nSpecifically, McHerny stated, “Punishing crypto market companies when not clearly mentioning rules as to how they should comply is not ideal. Regulation by enforcement is not sustainable. Moreover, Republican lawmakers opposed Gensler’s approach to crypto regulation in a new letter arriving ahead of today’s testimony."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vdS50b2RheS91d2VyeC13ZXJ4LWludHJvZHVjZXMtYWx0ZXJuYXRpdmVzLWZvci1ldGhlcmV1bS1ldGgtZXRoZXJldW0tY2xhc3NpYy1ldGMtc3VwcG9ydGVyc9IBZ2h0dHBzOi8vdS50b2RheS91d2VyeC13ZXJ4LWludHJvZHVjZXMtYWx0ZXJuYXRpdmVzLWZvci1ldGhlcmV1bS1ldGgtZXRoZXJldW0tY2xhc3NpYy1ldGMtc3VwcG9ydGVycz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Apr 2023 07:00:00 GMT",
        "title": "Uwerx (WERX) Introduces Alternatives for Ethereum (ETH), Ethereum Classic (ETC) Supporters - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nThe secret to making it in crypto is by investing at the earliest stages of a project that is loaded with potential for future growth, is a game-changer in the industry or innovates entire sectors. Uwerx (WERX) presale token is likewise drawing attention from various types of crypto investors.\n\nUwerx (WERX) ready to rally in 2023\n\nUwerx (WERX) is launching the first decentralized freelance marketplace that aims to improve on existing platforms like Upwork and Fiverr –– but with the added bonus of paying minimal transaction fees, more robust data and intellectual property protections, and more transparent and immutable recordkeeping practices. Uwerx (WERX) is tapping into the lucrative $1 trillion gig economy.\n\nWhile investing in Ethereum Classic (ETC) or Ethereum (ETH) might be good long-term picks, Uwerx (WERX) presents an infinitely higher upside.\n\nCrypto analysts believe that Uwerx has ensured the Web3-enabled freelance marketplace platform's long-term success by first passing an audit from InterFi Network and Solidproof, and then by locking liquidity on the platform for 25 years after the presale concludes. Additionally, contract ownership will also be renounced before the project is listed on centralized exchanges.\n\nEthereum (ETH) looks promising in 2023\n\nEthereum (ETH) is a decentralized smart contract platform that supports a robust ecosystem of decentralized applications (dApps). Investors have been loading up on Ethereum (ETH) at its low rates, in the hope that Ethereum (ETH) can manage to go on a big run in 2023. As predicted, Ethereum is now above $2,073; in our opinion, ETH is going to keep climbing.\n\nEthereum Classic (ETC) stays resilient\n\nEthereum Classic (ETC) is a decentralized smart contract platform launched in 2015. Ethereum Classic (ETC) has enjoyed price appreciation associated with its cousin, Ethereum (ETH), because of its status as the \"original\" blockchain of provenance. Ethereum Classic (ETC) enjoyed all-time highs of $176 at its peak in 2021, but is, as of this writing, trading at the $20-$22 levels.\n\nAccording to analysts, current Ethereum Classic (ETC) price action indicates a decline in the token's usage, with Ethereum Classic (ETC) holders dropping significantly since the 2021 peak. In fact, in January 2023, cryptocurrency exchange Coinbase delisted Ethereum Classic (ETC) on its platform due to low usage.\n\nUwerx (WERX) might see upsurge in 2023\n\nRemote work is no longer just a trend – it is a reality, along with freelancing. This trend is not going to end as we move to a post-pandemic world. With tens of millions of freelancers expected to join its global ranks, Uwerx (WERX) has all the chances to grow in prominence and value over time.\n\n\n\nPresale: invest.uwerx.network\n\nTelegram: https://t.me/uwerx_network\n\nTwitter: https://twitter.com/uwerx_network"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiogFodHRwczovL3d3dy5hdGFsYXlhci5jb20vZW4vYXJ0aWN1bG8vZWNvbm9teS1hbmQtYnVzaW5lc3MvY29tcGFyaXNvbi1jYXJkYW5vLWV0aGVyZXVtLWFuZC1iaWctZXllcy1jb2luLXF1ZXN0LWVuaGFuY2VkLXZhbHVlLWFuZC11dGlsaXR5LzIwMjMwNDE5MTA0OTA2MTgyNTk0Lmh0bWzSAaYBaHR0cHM6Ly93d3cuYXRhbGF5YXIuY29tL2VuL2FydGljdWxvL2Vjb25vbXktYW5kLWJ1c2luZXNzL2NvbXBhcmlzb24tY2FyZGFuby1ldGhlcmV1bS1hbmQtYmlnLWV5ZXMtY29pbi1xdWVzdC1lbmhhbmNlZC12YWx1ZS1hbmQtdXRpbGl0eS8yMDIzMDQxOTEwNDkwNjE4MjU5NC5hbXAuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Apr 2023 07:00:00 GMT",
        "title": "A Comparison Of Cardano, Ethereum, And Big Eyes Coin In The Quest For Enhanced Value And Utility - Atalayar EN",
        "content": "In recent months, the cryptocurrency market has experienced a surge of interest, with investors keeping a close eye on market developments during the current bullish run. One cryptocurrency that has been garnering widespread attention is Cardano, a blockchain platform that promises to bring added value to the decentralized finance (DeFi) ecosystem. It's worth noting that discussions related to Cardano typically bring up Ethereum and Big Eyes Coin (BIG).\n\nTherefore, this piece aims to provide a comprehensive comparison of the three leading contenders in the crypto industry, namely Cardano, Ethereum, and Big Eyes Coin. Each offers unparalleled value and utility to its diverse user base. We will examine their respective price projections, and updates, and take a quick trip down memory lane to explore their backgrounds.\n\nThe Crypto Dominators\n\nETH: Dominating The NFT Market\n\nEthereum is a decentralized platform that permits the development and deployment of decentralized applications, and it is renowned for its smart contract feature. The platform has become a popular choice for DeFi applications. The most recent upgrade, known as \"Shapella,\" or the Shanghai Upgrade, introduced the ability for users to withdraw their assets and access their cryptocurrencies more efficiently. Improvements were also made to sharding, EVM, and EOF. The main feature of the update is the ability for validator staking withdrawals on the main network.\n\nCardano, The Blockchain Aimed At Empowering Change-Makers\n\nCardano, founded by Charles Hoskinson in 2015, is a blockchain platform that operates on a Proof of Stake consensus mechanism, with a focus on providing a secure and scalable platform for decentralized applications, while bringing DeFi to a wider audience. Although Cardano has faced criticism over delays and network updates, it remains committed to expanding its influence in West Africa.\n\nBig Eyes Coin: Progressing Beyond Meme Recognition\n\nBig Eyes Coin, or BIG, is a cryptocurrency that is growing in popularity due to its innovative features, secure system, and potential in the DeFi ecosystem. It has also gained attention for its meme-inspired platform. Audits by Solidity Finance and verification by CoinSniper have ensured that the platform is secure for investors.\n\nBIG is not just a meme token, but a community-based token that enables investors to participate in decision-making processes. It also has a profitable NFT trading collection available on OpenSea. The presale raised $33.5 million and the ICO period ended on June 3rd, with the promo code END300 offering a 300% reward on all BIG purchases.\n\nA Thorough Comparison Of ADA, ETH, And BIG In The Cryptocurrency Scene\n\nIt's important to note the distinct differences between Cardano, Ethereum, and Big Eyes Coin. While Cardano and Ethereum utilize Proof-of-Stake (PoS) consensus mechanisms, Big Eyes Coin uses the innovative Proof-of-Attention (PoA) mechanism, which can make their architecture faster and more efficient. However, Big Eyes Coin's PoA consensus mechanism is unique in that it incentivizes user engagement on the network, promoting security.\n\nETH has a more extensive developer community than ADA or BIG, leading to more projects and applications being developed on the platform. ETH's smart contract functionality is also more advanced, and it has a higher market capitalization.\n\nInvestors are also interested in Cardano's price prediction. ADA has seen significant price growth recently, although it experienced a slight 2.6% dip on Wednesday, trading at $0.39. Meanwhile, ETH dropped 2.53% with a trading price of $1,873.46, after surpassing the barrier at $1,919.27 on Tuesday. The USDT to BIG price is currently at 1891.89, but it is predicted to fall to $BIG 1772.15 by the last day of BIG presale on June 3rd.\n\nA Peak In The Future\n\nAlthough ADA and ETH have been around in the crypto industry for a while, the BIG team and its growing community remain optimistic about their platform's prospects. They recognize the strength of these established players, but they firmly believe that BIG will eventually surpass its competitors and become a dominant force in the market. Their unshakable confidence in the platform's potential reflects their trust in its innovative features and the bright future that awaits it.\n\nAll Things Big Eyes Coin\n\nPresale: https://buy.bigeyes.space/\n\nWebsite: https://bigeyes.space/\n\nTelegram: https://t.me/BIGEYESOFFICIAL"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy91cy1ob3VzZS1jb21taXR0ZWUtY2hhaXItcmVwZWF0ZWRseS1wcmVzc2VzLXNlYy1jaGFpci1pcy1ldGhlci1hLWNvbW1vZGl0eS1vci1hLXNlY3VyaXR50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Gary Gensler refuses to answer if ETH is a security: SEC hearing - Cointelegraph",
        "content": "Patrick McHenry, chair of the United States House Financial Services Committee, jumped right into criticism of the Securities and Exchange Commission and its leadership over digital assets at an oversight hearing.\n\nIn an April 18 hearing on oversight of the SEC, Representative McHenry used his opening statement to bring up the commission’s “punishing” of digital asset firms through regulation by enforcement without a clear path to compliance. The member of Congress reiterated calls for U.S. lawmakers to provide “clear rules of the road” for crypto through legislation. In addition, he pressed SEC Chair Gary Gensler to give a definitive answer on whether Ether (ETH) qualified as a security under the SEC’s purview or a commodity under the Commodity Future Trading Commission’s.\n\nMcHenry repeatedly talked over Gensler’s responses that did not include specifics, citing the SEC chair’s willingness to label Bitcoin (BTC) as a commodity and hinting at private discussions on ETH prior to the hearing.\n\nGary Gensler and Representative McHenry arguing on whether $ETH is a commodity or a security, with Gensler unable to answer the question pic.twitter.com/DTMtazYmuS — Cointelegraph (@Cointelegraph) April 19, 2023\n\n“Clearly an asset cannot be both a commodity and a security,” said McHenry. “I’m asking you, sitting in your chair now, to make an assessment under the laws as exist, is Ether a commodity or a security?”\n\nHe added:\n\n“You have pre-judged on this: You’ve taken 50 enforcement actions. We’re finding out as we go, as you file suit, as people get Wells notices, on what is a security in your view, in your agency’s view.”\n\n.@GaryGensler's tenure has been defined by recklessness. His agenda runs roughshod over process, precedent, & the #SEC’s statutory authority. I look forward to speaking with him today.\n\n\n\nTune in at 10:00am https://t.co/qNdJ4wDkw5 — Patrick McHenry (@PatrickMcHenry) April 18, 2023\n\nRepresentative Maxine Waters, ranking member of the House committee, did not press Gensler on ETH but focused her questioning on the SEC’s enforcement capabilities. According to the SEC chair, the commission had the means, the authority and the will to bring crypto firms into regulatory compliance.\n\nMany in and out of the crypto space have criticized the SEC under Gensler for taking enforcement actions against firms involved with digital assets and blockchain technology. On April 17, the SEC charged crypto asset trading platform Bittrex and its co-founder William Shihara for offering unregistered securities, and a Wells notice issued to Coinbase in March suggests the major exchange could be next.\n\nGensler claimed the crypto market was “rife with noncompliance”, in many cases firms willfully doing so. His written testimony said compliance with the SEC extended to decentralized finance platforms — an indication of the commission proposing changing its rules to include DeFi in exchanges under its purview.\n\nRelated: Video of SEC chair praising Algorand resurfaces after recently deeming it a security\n\nThe April 18 hearing was the first time Gensler had directly addressed the House committee since October 2021 — prior to the collapse of FTX, Celsius, BlockFi and crypto-friendly banks including Signature, Silicon Valley Bank and Silvergate. The Financial Services Committee will also meet to discuss stablecoin regulation in an April 19 hearing.\n\nMagazine: Crypto regulation: Does SEC Chair Gary Gensler have the final say?"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vdmlkZW8vc2Nyb2xsLWNvLWZvdW5kZXItZXRoZXJldW0tc2NhbGluZy0xNDQzMTgwNjMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Apr 2023 07:00:00 GMT",
        "title": "Scroll Co-Founder on Ethereum Scaling Race - Yahoo Finance",
        "content": "A decentralized, global team of developers is shirking the urge to be the first to scale Ethereum. As part of CoinDesk's Projects to Watch 2023, Scroll co-founder Sandy Peng discusses Ethereum's \"zero-knowledge\" arms race and how Scroll stands out from the competition."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiJWh0dHBzOi8vdGhlZGVmaWFudC5pby9tZW1lY29pbi1zZWFzb27SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "PEPE Rallies 500x As Investors Pile Into New Wave Of Memecoins - The Defiant - DeFi News",
        "content": "Single MEV Bot Accounts For 7% Of Daily Ethereum Gas Usage\n\nBy: Owen Fernau • Loading...\n\nCrypto News\n\nMemecoins are pumping like it’s 2021.\n\nPEPE, a new Ethereum-based token named after the cartoon character turned memetic icon Pepe the Frog, has ascended to a market capitalization of $86M in less than five days, making it the sixth-most valuable memecoin, going by a list from CoinGecko.\n\nPepe the Frog\n\nThe PEPE rally has spurred enterprising developers to spin up tangential projects — WOJAK, named after another popular memetic character, launched on April 17 and has already jumped to a $10M market capitalization in just over a day.\n\nWojak, also known as Feels Guy\n\nSpeculators who caught these tokens early are sitting on astronomical profits reminiscent of 2021’s dog coin mania, when DOGE and SHIB rallied to their all-time highs.\n\n‘Double-edged Sword’\n\nRyan Watkins, the co-founder at Syncracy Capital, a crypto-focused hedge fund, thinks memecoins’ success has a mixed effect on the digital asset space. “It’s a double-edged sword,” he told The Defiant over Telegram. “On one hand, memecoins make crypto more fun and accessible. On the other, they reaffirm many skeptics’ criticisms that the industry’s only use case is gambling.”\n\nIndeed, many in the crypto community find memecoins fun, all the more so when they are making money. The Pepe and Wojak characters pop up daily in crypto Discord and Telegram channels, imbuing tokens associated with them with added allure to the blockchain-savvy.\n\nDeFi Alpha Premium Content DeFi Daily | Weekdays\n\nDeFi Alpha Letter | Weekly\n\nDefiant Podcast Transcript | Weekly\n\nInbox Dump | Saturday\n\nWeekly Recap | Sunday Looking for Alpha? Become a premium member of The Defiant and join our DeFi Alpha community. Start for free\n\nConversely, to crypto-outsiders, it’s difficult to discern any real difference between DOGE and PEPE. They’re both tokens with questionable utility — it’s easy to write off investing time and effort into hot potato games as the most wasteful aspects of the crypto industry.\n\nRegardless of whether the new memecoins’ success is good for crypto as a whole, they’ve certainly caught investors’ attention, with a new token dropping seemingly every few hours.\n\nZ, a well-known pseudonymous trader who has been posting seemingly non-stop about PEPE over the past three days, told The Defiant they first bought the token when it had a $30,000 market capitalization. At the token’s current market capitalization of over $80M — the trader’s PEPE is worth over 2000 times what they paid for it.\n\n“The PEPE pump is ringing the bell and waking everyone up to speculate,” Z said. “Seeing the memes that have always been around us and that we see daily become the top memecoins feels healing, cleansing.” The trader said they first heard about PEPE through a private Twitter group.\n\n‘Dogs Have Had Their Day’\n\nThe creators of the website for PEPE, who didn’t immediately respond to a request for comment from The Defiant, are looking to take on canine-themed tokens like DOGE and SHIB, which have dominated the memecoin space. “The dogs have had their day,” the PEPE site reads. “It’s time for Pepe to take reign.”\n\nSome entrepreneurs haven’t gotten the notice that dog coins are done for — AIDOGE, which launched on April 10 on Layer 2 network Arbitrum as a free claim for ARB airdrop recipients, has already hit a $35M market capitalization as of April 18.\n\nEthereum Gas Spikes\n\nThe action around memecoins is starting to affect other users of the Ethereum blockchain. Gas fees, the amount of ETH it costs to make a transaction, spiked to their second-highest level in the last six months, according to a dashboard by pseudonymous analyst Hildobby.\n\nEthereum Median Gas Price\n\nThis means Ethereum users are paying over $30 to trade a token on a decentralized exchange like Uniswap or Balancer.\n\nMEV Bot Dominates Ethereum Gas Usage\n\nAccording to information provider SeaLaunch, one entity using the Ethereum domain jaredfromsubway.eth, is running an MEV bot responsible for using 7% of the gas on Ethereum at one point. MEV bots profit by inserting orders ahead and behind unsuspecting traders, resulting in worse execution prices for users\n\nJaredfromsubway.eth was still the top gas consumer as of 10pm ET on April 18.\n\nTop Gas Consumers. Source: Etherscan\n\nTo be sure, it’s not only general Ethereum users who bear the cost of memecoin season. The hype-laden world of memecoins comes with its ups and downs. BONK, a token on the Solana blockchain, was red hot in January but is now down nearly 80% from its peak.\n\nUnproven Meme Value\n\nAnd the idea of a token’s value actually being tied to a meme’s usage is unproven.\n\nPunk6529, a pseudonymous influencer, developed an NFT project geared around owning memes. After peaking in mid-January with a 59,000 ETH market capitalization, The Memes, as the project is called, have dropped nearly 75% to roughly 15,000 ETH, according to data provider NFTGo.\n\nStill, for some avid traders, memecoins provide the spark to get them through the bear market. Or maybe it provides some hope that the bear market may truly be ending.\n\nIn the long run, Syncracy’s Watkins doesn’t think the memecoin phenomenon does too much harm. “It does get tiring after a while, but speculation attracts capital to the industry necessary to fund new and interesting projects,” he said. “I don’t think memecoins are meaningfully stealing energy from ‘real’ projects.”"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMilAFodHRwczovL3d3dy5idXNpbmVzcy1zdGFuZGFyZC5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9leHBsYWluZWQtYWxsLXlvdS1uZWVkLXRvLWtub3ctYWJvdXQtZXRoZXJldW0tcy1sYXRlc3QtdXBncmFkZS1zaGFwZWxsYS0xMjMwNDE4MDA2NTlfMS5odG1s0gGYAWh0dHBzOi8vd3d3LmJ1c2luZXNzLXN0YW5kYXJkLmNvbS9hbXAvbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9leHBsYWluZWQtYWxsLXlvdS1uZWVkLXRvLWtub3ctYWJvdXQtZXRoZXJldW0tcy1sYXRlc3QtdXBncmFkZS1zaGFwZWxsYS0xMjMwNDE4MDA2NTlfMS5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Explained: All you need to know about Ethereum's latest Shapella upgrade - Business Standard",
        "content": "Last week, the developers of Ethereum announced that they have completed an upgrade called \"Shapella\". Called the final milestone in Ethereum's multi-year transition from Proof-of-Work (PoW) to Proof-of-Stake (PoS) consensus, it will make earlier staked Ethereum more liquid.\n\nWhat is \"Shapella\"?\n\nThe term \"Shapella\" is derived from the words \"Shanghai\" and \"Capella\". These are two of five Ethereum Improvement Proposals (EIPs) that will be upgraded in the process. The upgrade will change the way Ethereum works. EIP-2565, EIP-2929, and EIP-2718 are the other protocols which will be upgraded.\n\nThe upgrade was completed on April 12.\n\nWhat changed after Shapella?\n\nIn September last year, Ethereum underwent a major upgrade called \"The Merge\", in which the network transitioned from a proof-of-work to a proof-of-stake consensus. Users were rewarded for \"staking\", and not selling, their Ether and participation in the validation of the network.\n\nIn staking, the investors can freeze their tokens on the cryptocurrency's network. In return, they can earn rewards. The staked tokens are used to develop a system to validate the transactions on the database, unlike PoW, where data has to be entered by miners.\n\nHowever, it was a one-way street. To date, 18 million Ethereum tokens have been staked on the network, valued at $33 billion. The users were not able to withdraw their holdings.\n\nShapella has enabled \"unstacking\" Ether. Shanghai will create a new transaction type that will allow stakers to withdraw their balances, while Capella will enable the network to accept a withdrawal request.\n\nUsers were immediately allowed to withdraw their Ether token. Some 57,600 Ether tokens per day can be withdrawn through full withdrawals and partial withdrawals.\n\nMoreover, as it reduces the need to enter data by miners, staking brings down energy consumption. Now with Shapella, more investors will be encouraged to stake their holdings as it will be easier to withdraw.\n\nWhat happened after the Shapella upgrade?\n\nAfter the upgrade, Indian crypto investors flocked to invest as well as withdraw Ethereum. Major Indian crypto exchanges like WazirX and CoinDCX saw significant spikes in Ethereum trading.\n\nIn the past seven days, Ethereum has jumped 9.28 per cent and was trading at $2,097 on Tuesday, according to coinmarketcap."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vdW5jaGFpbmVkY3J5cHRvLmNvbS93aGF0LWlzLXByb3RvLWRhbmtzaGFyZGluZy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "What is proto-danksharding? - Unchained - Unchained",
        "content": "Proto-danksharding is the first in a series of proposed Ethereum upgrades that aim to split up the network into lots of little chains, known as shards. The hope is that running lots of shards in parallel will allow the entire Ethereum network to grow without slowing down, even if many more individuals start to use the network.\n\nIt will take several years for danksharding to be fully realized on Ethereum. Yet, once implemented, sharding could increase the throughput of the blockchain, make transactions far cheaper, and prevent bottlenecks.\n\nAccomplishing all this would solve several of the major pain points of Ethereum, namely slow and expensive transactions that can cause congestion in times of network stress. Sharding will also reduce the cost of running a validator over time, thereby decentralizing the network.\n\nProto-Danksharding\n\nThe flowery name for the upgrade, which also goes by “Shard Blob Transactions,” conceals a more prosaic technical name: EIP-4844. EIP stands for Ethereum Improvement Proposal, the title given to any recommendation to upgrade the blockchain.\n\nDanksharding is the name of the sharding design that Ethereum’s developers propose to use on the network. “Dank,” in addition to referencing slang that means something like “cool” or “good,” is a hat tip to Ethereum Foundation researcher Dankrad Feist.\n\nProto-danksharding, i.e., EIP-4844, is the first step toward implementing full danksharding. It would implement most of the logic and craft the rules that would be required for danksharding to go ahead. Consider it “danksharding-lite.”\n\nThe upgrade would also introduce a new type of transaction called a “blob-carrying transaction.” These look just like regular transactions but hold a relatively large and inexpensive piece of data known as a blob. The benefit of these blob-carrying transactions, explained in greater detail below, is greater efficiency, particularly for existing scaling solutions like rollups. That will cut costs and improve speeds.\n\nHow Danksharding Works\n\nSo how does danksharding propose to scale Ethereum? Put simply, instead of verifying everything in a block, danksharding aims to have the Ethereum blockchain merely verify that these data-efficient “blobs” contain the right kind of information and carry out any orders contained therein.\n\nThis cuts down the amount of work required by the execution layer of Ethereum, the part of the network that is responsible for carrying out the instructions set by the other side of Ethereum, known as the consensus layer.\n\nThe execution layer of Ethereum is busy enough as it is, and making things more efficient speeds up the blockchain. Blob transactions are supposedly cheaper to execute, too, ultimately reducing transaction costs for users.\n\nThese blobs of data are likely to contain information relevant to layer-2 protocols, like Arbitrum or Optimism. Layer-2 protocols, which wrap up bundles of Ethereum transactions and process them elsewhere, are also important for scaling Ethereum. It is expected that danksharding and layer-2 protocols will work hand in hand.\n\nIn addition to the above, danksharding also reimagines how transaction fees are paid on Ethereum. One class of actor, known as the proposer, determines which transactions should fit into a block. A second class—so-called block builders—bids on the right to determine the transactions that are contained within a block.\n\nHow Will Proto-Danksharding Affect You?\n\nProto-danksharding only introduces a very limited version of danksharding; it’s mostly throat-clearing for the real thing. However, it should make transacting on some layer-2 protocols, which will be able to access these new blob transactions, a lot cheaper.\n\nBut even these layer-2 transactions will pale in comparison to the genuine article: proto-danksharding will provide a single megabyte of data availability for each transaction, while actual danksharding will hit 16 megabytes.\n\nDanksharding doesn’t have a release date, and the peanut gallery of Twitter pundits expects that even proto-danksharding could take years.\n\nIn late 2022, Ethereum officially switched from proof of work to proof of stake (known as the Merge), reducing its environmental impact by a factor of 99%. The Merge was Ethereum’s biggest upgrade to date. It took about six years to implement, and came following innumerable delays.\n\nWhile you wait, note that upgrades to the Ethereum blockchain itself will be complemented by advances to layer-2 technologies, such as zk-SNARKs and rollups."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy50cmFkaW5ndmlldy5jb20vbmV3cy9uZXdzYnRjOmI5MjY1Yjc5MTA5NGI6MC1vdmVyLTQxLW1pbGxpb24tb2YtZXRoZXJldW0tbG9uZ3MtbGlxdWlkYXRlZC1yZWFjaGluZy1hLW5ldy00LXdlZWstaGlnaC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Apr 2023 07:00:00 GMT",
        "title": "Over $41 Million Of Ethereum Longs Liquidated, Reaching A New 4-Week High - TradingView",
        "content": "Over $41 million of ETH long positions have been liquidated as Ethereum prices flash crash from their April peaks, Coinglass data on April 19 reveals.\n\nEthereum Remains Volatile\n\nETH, the native cryptocurrency of the Ethereum network, is under immense pressure when writing. Although the uptrend remains, and the coin has generally posted impressive results over the last four months, the price drop today has led to the biggest liquidation of ETH long positions in over one month.\n\nAccording to Coinglass data, ETH long positions were also wrecked on March 22 when over $31 million were forcefully closed. On average, less than $10 million of ETH longs have been closed on other trading days in the last month.\n\nNewsBTC\n\nThe magnitude of long or short liquidation can be used to measure general volatility in the market. Volatility indicates how fast or slow an asset price moves within a given period.\n\nDepending on the general liquidity, asset prices can move at different paces. In crypto, the most liquid assets, like Bitcoin and Ethereum, are usually less volatile than altcoins, for example, those outside the top 50.\n\n$41 Million Of ETH Longs Liquidated\n\nFrom the $41 million ETH longs liquidated, a big chunk is in OKX and Binance. These are some of the world’s largest cryptocurrency exchanges that support the derivatives trading of crypto assets.\n\nBy supporting margin, perpetual futures, and other derivatives, OKX and Binance traders can use leverage to trade bigger positions than they would ordinarily be able to. Although leverage can amplify gains, it risks the trader’s account when prices move against their prediction.\n\nThe drop of ETH prices from $2,100 moved against leverage traders in, among other platforms, Binance and OKX, leading to tens of millions of dollars being liquidated. www.tradingview.com/x/gbQIKdue\n\nBy liquidating a position, the exchange forcefully closed the long position and secured the margin since it couldn’t cover the ongoing loss. How quickly a position can be liquidated also depends on the leverage level. Traders with high leverage and trading bigger positions in a volatile market stand a higher risk of having their positions liquidated.\n\nThe sharp spike in ETH long liquidations is less than a week after $54 million of short positions were liquidated on April 14. The number of ETH shorts closed by the exchange was also the largest in over a month. As the trend observed, most of those short positions were from Binance and OKX. There were also more short positions closed on Bybit and Deribit."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNC8xOC90cmFkZXItdW52ZWlscy1wcmljZS10YXJnZXQtZm9yLXNvbGFuYS1zb2wtc2F5cy1oZXMtYnVsbGlzaC1vbi1kb2dlY29pbi1kb2dlLWFuZC1vbmUtZXRoZXJldW0tcml2YWwv0gGJAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA0LzE4L3RyYWRlci11bnZlaWxzLXByaWNlLXRhcmdldC1mb3Itc29sYW5hLXNvbC1zYXlzLWhlcy1idWxsaXNoLW9uLWRvZ2Vjb2luLWRvZ2UtYW5kLW9uZS1ldGhlcmV1bS1yaXZhbC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Trader Unveils Price Target for Solana (SOL), Says He’s Bullish on Dogecoin (DOGE) and One Ethereum Rival - The Daily Hodl",
        "content": "A popular crypto trader thinks Ethereum (ETH) competitor Solana (SOL) could see sizeable gains in the next two weeks.\n\nThe pseudonymous analyst Cantering Clark, tweeting from his new Man o’ War Twitter account, says he believes SOL could rally by as much as 23% in the short term.\n\n“I think if we can handle $27, $30 is a reasonable target in the next two weeks.”\n\nSOL is trading at $24.33 at time of writing.\n\nCantering Clark also tells his 165,100 Twitter followers that he’s bullish on the top meme asset Dogecoin (DOGE) and layer-1 protocol Aptos (APT).\n\n“Have been long DOGE.\n\nAdded SOL and APT.”\n\nDOGE is trading at $0.0905 at time of writing and is up 1.17% in the past day. Aptos is trading at $12.21 and is down 2.28% in the last 24 hours.\n\nDespite the gains of the past months, Cantering Clark says he still feels cautious about the overall prospects of Bitcoin (BTC). According to the trader, he believes Bitcoin could potentially witness a big sell-off event as long as it is trading below a key resistance level at $34,000.\n\n“When followers get perplexed as to why I started getting cautious around $28,000 and managing positioning more, hedging some or all at points etc.\n\nThe entire area of $28,000-$32,000 had the potential to be a pretty reasonable sticky point. There is a reason why I never give much back to the market.\n\nI bought before the FTX nuke in November and ate that, added at the lows, and bought again at $20,500.\n\nUntil we are back in the 2021 range meaningfully, I will sleep with one eye open.”\n\nAt time of writing, Bitcoin is trading for $29,509.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney\n\nShutterstock/MrArtHit"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2NyeXB0by12ZXRlcmFucy10YXJnZXRlZC1pbi1teXN0ZXJpb3VzLW1ldGFtYXNrLWhlaXN0cy01ay1ldGgtc3RvbGVuL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Crypto veterans targeted in mysterious wallet heists – up to 5k ETH allegedly stolen - CryptoSlate",
        "content": "More than 5,000 Ethereum (ETH) and an undetermined quantity of tokens and NFTs have been stolen across multiple chains in an ongoing hack since late last year, said MetaMask dev @tayvano_.\n\n“I don’t know how big it is but since Dec 2022 it’s drained 5000+ ETH and ??? in tokens / NFTs / coins across 11+ chains.“\n\nThe dev added that they had been investigating for the last two days but cannot determine how the attacker is carrying out the thefts. Moreover, the victims are all “OGs who are reasonably secure.”\n\nOGs targeted in sophisticated wallet heist\n\n@tayvano_ pointed out that this is a sophisticated attack deliberately targeting OGs, reiterating that no one can work out where the exploit lies.\n\n“This is NOT a low-brow phishing site or a random scammer. It has NOT rekt a single noob. It ONLY rekts OGs.”\n\nForensic device examination has led nowhere — further stumping investigations into the method used to access the victims’ wallet.\n\nThe commonalities between cases were the keys were created between 2014 and 2022, and victims are “crypto native,” such as possessing multiple addresses and working within the crypto industry.\n\nThe hacker will commit “primary” thefts, with “secondary” thefts following hours later to collect assets and dust missed during the initial heist — sometimes weeks or months later.\n\nIn the case of large thefts, the attacker will swap assets into ETH inside the wallet, then send the tokens to a centralized swapper, including SimpleSwap and ChangeNOW — always swapping into Bitcoin (BTC).\n\nSitting on the swapped BTC for a week, the funds are sent to a mixer for address obfuscation.\n\nTips on staying safe\n\n@tayvano_ speculates that the attacker has acquired a data cache from the victims’ device. Using this, they can abstract the wallet keys — but the dev stresses that this is “just a guess.”\n\n“My best guess rn is that someone has got themselves a fatty cache of data from 1+ yr ago & is methodically draining the keys as they parse them from the treasure trove.“\n\nThe dev cautioned users to avoid storing all their digital assets on a single wallet key. Instead, people should split their crypto across multiple keys or hold assets on a hardware wallet.\n\n“PLEASE DON’T KEEP ALL YOUR ASSETS IN A SINGLE KEY OR SECRET PHRASE FOR YEARS. THE END.“\n\nConsenSys contacted CryptoSlate to clarify that multiple chains and wallets have been affected by the ongoing hack. MetaMask’s role in this is in taking the investigative lead.\n\nMentioned in this article"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vdGVjaC90ZWNobm9sb2d5L2luZGlhbi1jcnlwdG8taW52ZXN0b3JzLWZsb2NrLXRvLWV0aGVyZXVtLWFmdGVyLXNoYXBlbGxhLXVwZ3JhZGUvYXJ0aWNsZXNob3cvOTk1NjUxMTYuY21z0gGJAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS90ZWNoL3RlY2hub2xvZ3kvaW5kaWFuLWNyeXB0by1pbnZlc3RvcnMtZmxvY2stdG8tZXRoZXJldW0tYWZ0ZXItc2hhcGVsbGEtdXBncmFkZS9hbXBfYXJ0aWNsZXNob3cvOTk1NjUxMTYuY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Indian crypto investors flock to Ethereum after 'Shapella' upgrade - The Economic Times",
        "content": "Elevate Your Tech Prowess with High-Value Skill Courses Offering College Course Website IIM Kozhikode IIMK Advanced Data Science For Managers Visit MIT MIT Technology Leadership and Innovation Visit Indian School of Business ISB Professional Certificate in Product Management Visit\n\nIndian crypto investors have started showing interest in Ethereum (ETH) following the highly anticipated Shapella upgrade, which resulted in a surge in transaction volumes in the digital asset last week across major local cryptocurrency exchanges.At Wazir X , the transaction volume for ETH grew from $52,000 on April 9 to $3,75000 on April 14, recording a near-eight-fold increase.Another top exchange, CoinDCX, said that its ETH volumes had spiked significantly - by 55% - on the INR trading pair over the last few weeks.According to the exchanges, the transaction volumes of ETH decreased over the weekend, but this is a common trend in the crypto markets, which usually experience lower volumes during weekends.“We anticipate an increase in momentum starting from this week,” said Minal Thukral, EVP-Growth, CoinDCX.Ethereum has been up 11.73 % in the last 7 days, touching $2,076 on Coinmarketcap at 5 PM Mumbai time on Monday.On April 12, the Ethereum blockchain underwent simultaneous \"Shanghai\" and \"Capella\" upgrades while operational. The Shanghai upgrade primarily impacted Ethereum's (ETH) Execution Layer, while Capella targeted the Consensus Layer. The implementation dubbed \"Shapella,\" is expected to enhance the network's performance, security, and efficiency.The upgrade allowed users to withdraw billions of dollars in Ether, the native token of the Ethereum network, and the network recorded a hefty inflow of deposits, touching a yearly high of $2,129.Staking in crypto involves holding and locking up a certain amount of cryptocurrency to participate in the network and earn returns akin to a traditional bank FD.Investors were fearing that Ether holders would quickly withdraw their staked tokens, but fresh deposits helped sustain the staking balance for a couple of days. But lately, withdrawals from Ethereum staking contracts have exceeded deposits.Indian investors said that Ethereum holders now have more confidence to stake their tokens after the Shanghai upgrade as it will allow them to unstake their ETH after a 14-day lock-in period from that day.\"Unlike other Smart Contract Blockchains, the percentage of staked tokens is only 15% in Ethereum, which is expected to rise from here on. Cardano has 69% of ADA tokens staked, Avalanche has 54% AVAX staked, Solana has 71% of SOL staked,\" said Ashwini Nadar, a Mumbai-based software professional and avid crypto enthusiast.Ethereum, a decentralized blockchain platform founded by Vitalik Buterin in 2015, allows developers to create decentralised applications (dApps) and smart contracts. It ranks as the second-largest cryptocurrency platform by market capitalisation, following Bitcoin.Ethereum upgrades, often called \"hard forks\" or \"network upgrades,\" entail modifications to the Ethereum protocol or the Ethereum Virtual Machine (EVM), which operates smart contracts.At CoinDCX, Ethereum gained more than 6% a day after the upgrade.The exchange said that its on-chain data showed that there was a significant increase of nearly 100,000 ETH tokens staked on the Ethereum blockchain on April 14, marking the largest one-day increase in almost two months.\"This suggests that rather than withdrawing staked ETH to cash out, a significant portion of investors view the successful Shapella upgrade as an indication to stake their Ether tokens,\" said Thukral of CoinDCX.The upgrade sets the stage for a transition to a proof-of-stake (PoS) consensus mechanism, replacing the existing proof-of-work (PoW) system."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiugFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMTktYXByaWwtMjAyMy9hcnRpY2xlc2hvdy85OTYwODY0NC5jbXPSAb4BaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXByaWNlcy10b2RheS1saXZlLW5ld3MtYml0Y29pbi1kb2dlY29pbi1ldGhlcmV1bS1zaGliaGEtaW51LWNyeXB0b2N1cnJlbmN5LWxhdGVzdC11cGRhdGVzLTE5LWFwcmlsLTIwMjMvYW1wX2FydGljbGVzaG93Lzk5NjA4NjQ0LmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Apr 2023 07:00:00 GMT",
        "title": "Crypto Price Today Live: Bitcoin rises above $30k; Solana, BNB fall up to 3% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe cryptocurrency markets were trading mixed on Wednesday. Bitcoin, XRP and Dogecoin were trading with gains, while Ethereum, BNB and Solana were trading with cuts.Bitcoin (BTC) rose 1.48% to $30,136, whereas Ethereum (ETH) was below the $2,100 level. BTC volume in the last 24 hours stood at approximately $19.04 billion, rising 11.46% in the last 24 hours.\"Over the past 24 hours, Bitcoin has bounced back to the US$30,000 level, recuperating from earlier losses. Investors seem to have renewed their interest in assets that hold value, despite fading concerns about the banking industry. To continue its upward trend, BTC will need to overcome its next resistance level at US$30,500, while its support level is at US$29,800,\" Edul Patel, Co-founder and CEO at Mudrex, said.The total volume in DeFi is currently 4.14 billion, 9.13% of the total crypto market 24-hour volume. The volume of all stablecoins stood at $41 billion, which is 90.4% of the total crypto market 24-hour volume.The global cryptocurrency market cap was trading lower around $1.27 trillion, rising 0.36% in the last 24 hours.The market cap of Bitcoin, the world's largest cryptocurrency, was around $582 billion. Bitcoin’s dominance is currently 45.93%, an increase of 0.51% over the day, according to CoinMarketCap.\"After witnessing a minor downward trend, BTC rebounded above the critical $30,000 mark as the positive sentiment around Defi continues to grow. The current rally in the crypto market is driven by macro factors and its momentum depends on the favourable factors surrounding the financial markets,\" Shivam Thakral, CEO of BuyUcoin, said.Sathvik Vishwanath, Co-Founder & CEO of Unocoin, said, \"Bitcoin remained in a narrow range of $30,200 to $30,500, but rose to $30,500 during the US trading session, turning its previous support at $30,200 into a resistance level. A continued downtrend could see BTC fall to $29,189 if it breaks below the $29,700 level.\"Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 12.28 hours, IST on April 19, 2023)Bitcoin $30,136 1.48%Ethereum $2,073 -1.62%Tether $1.00 -0.03%BNB $336 -2.75%XRP $0.5242 1.61%Cardano $0.4351 -2.10%Dogecoin $0.09253 -0.62%Polygon $1.16 -0.83%Solana $24.33 -2.96%Polkadot $6.80 -0.18%Shiba Inu $0.00001148 -0.74% Litecoin $100.7 -1.22%Tron $0.06661 0.68%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vZGVjcnlwdC5jby9uZXdzLWV4cGxvcmVyP3Bpbm5lZD0xNTExMzQmdGl0bGU9ZXRoZXJldW0tdmFsaWRhdG9ycy1mYWNlLTE3LWRheS13aXRoZHJhd2FsLXdhaXQtZHVlLXRvLW11bHRpcGxlLWRlbGF5c9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 22:22:57 GMT",
        "title": "News Explorer — Ethereum Validators Face 17 Day Withdrawal Wait Due to Multiple Delays - Decrypt",
        "content": "Apr 18, 6:28 pm\n\nCoindesk\n\nEthereum Validators Face 17 Day Withdrawal Wait Due to Multiple Delays\n\nEthereum validators who requested to withdraw their staked ether (ETH) following the Shanghai upgrade will have to wait up to 17 days to receive their funds, according to data from Nansen. This is due to a 25-minute wait, an 11.7 day exit queue, a 27 hour withdrawal delay, and a 4.25 day processing period. Partial withdrawals are faster, taking only 4.27 days."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vYml0YnV5LmNhL2d1aWRlcy9ldGhlcmV1bS1tZXJnZS10b3AtMTAtdGhpbmdzLXRvLWtub3fSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Merge – Top 10 Things to Know - Bitbuy",
        "content": "Ethereum, the second largest cryptocurrency by market value has conducted its final test run for the long-awaited upgrade that will be a pivotal moment in the history of crypto. This upgrade is being called the ‘Merge’ and is said to be happening in mid-September. Before we go deeper into the details of this merge, we need to understand what exactly it is. Here are the top 10 things you need to know about the Ethereum ‘Merge’:\n\n1. What is the Merge?\n\nThe ‘Merge’ refers to the event when the Ethereum blockchain changes from using Proof-of-Work (PoW) to Proof-of-Stake (PoS). Because two independent blockchains that are now operating in parallel will be merged, it is known as \"the Merge’ due to the \"Beacon Chain,\" a specialized blockchain, and the main Ethereum blockchain being combined, or \"merged.\"\n\nThe beacon chain is empty of transactions. There are no DeFi applications or tokens. It is an empty blockchain that exists just to support the Proof of Stake consensus algorithm. Since the Beacon Chain is a \"empty chain,\" it may join the Ethereum blockchain and replace the role of Ethereum's PoW system without having to worry about any other factors. A brand-new PoS consensus method will take the place of Ethereum's PoW validation once these two chains are combined.\n\n‍\n\n2. Why is this so Important?\n\nIn the history of cryptocurrency, no blockchain has seen such a profound transformation. A crucial aspect of a blockchain's operation is not changed very frequently, and none have undergone modifications with an economy as significant and well-developed as Ethereum's. TheMerge is a long-awaited moment in the crypto world, and it will likely change the industry tremendously, paving the way for future Ethereum upgrades and setting a precedent for other blockchain and DeFi upgrades in the future.\n\n‍\n\n3. What are the benefits?\n\nEthereum's transition to a PoS consensus will bring numerous benefits, including improved efficiency, scalability, and security, as well as reduced centralization. One of the main outcomes of the Merge and transition to PoS is that it will reduce Ethereum’s energy consumption drastically. Ethereum, will consume about 99.5%less energy post-merge. Investors and authorities who care about the environment are concerned about the energy use associated with crypto currency mining. For instance, US legislators frequently criticize Bitcoin mining because of the network's significant carbon impact.\n\n‍\n\n4. Will The Merge reduce gas fees?\n\nA common misconception is that the Merge will materially lower Ethereum’s transaction fees (gas fees).It was highlighted that the Merge does not increase network capacity but rather alters the consensus procedure. The relationship between network capacity and demand determines gas pricing. While switching from a PoW to a PoS consensus, the Merge does not significantly impact any aspects that directly affect network throughput or capacity. In future upgrades, Ethereum’s gas price may decrease but for now, it will remain unchanged following theMerge.\n\n‍\n\n5. What does this mean for Eth?\n\nThe economics of ETH have been significantly impacted by TheMerge. This element of the Merge is the most important to investors. Because of the Merge's reduced ETH supply and transformation into a native yield-bearing asset, ETH's economics are fundamentally altered.Because there is less of a need to compensate PoW miners, Ethereum may lower its annual ETH issuance from 4.3% to 0.43%, making Ethereum a deflationary asset. Most people view the decrease in additional ETH issuance as exceedingly positive.\n\n‍\n\n6. How will this affect the price of ETH?\n\nEthereum recently traded in the mid-$1,800 range, up more than 80% from its mid-July lows of under $1,000. While most of this has coincided with a general uptick in the cryptocurrency market with improved macro mood (Bitcoin is up over 25% from its mid-July lows), experts have noted that anticipation for the merger has been a key factor pushing ETH’s price higher.\n\nETH really seemed to take notice of the upcoming Merge when senior developer Tim Beiko tentatively put forth an official date for the Mainnet merge to take place this September. Anything that pushes that date back may weigh on ETH in the short-term. After the recent successful Goerli merge, combined with softer than expected US inflation figures for July that were just released, ETH prices could be in within a shot of hitting $2,000 in the very near future.\n\n‍\n\n‍7. How do I prepare for the Merge?\n\nGiven that this is one of the largest occasions in the whole history of the cryptocurrency sector, it is expected that many dishonest persons would try to take advantage of it in hopes of defrauding trusting individuals of their money. It is crucial to understand that prior to theMerge, users and holders of ETH do not need to make any changes to their accounts or wallets.\n\nAfter the switch to PoS, Ethereum's complete history, going all the way back to its creation, will be preserved. After the Merge, all balances in wallets will remain accessible, and users and holders are not forced to update.\n\n‍\n\n8. Are there risks involved?\n\nEthereum critics, who are usually bitcoin maximalists relate the merge to replacing an airplane's engine in the middle of a passenger flight. Not just the aircraft but also the $183 billion worth of ether in circulation are under jeopardy. Undoubtedly, there are many risks involved in making a mistake, which is one of the primary reasons why theMerge has taken so long. As a result, there is plenty of testing and polishing going on behind the scenes.\n\n‍\n\n9. Will this be it for Ethereum Upgrades?\n\nNo! A successful \"Merge\" also prepares the ground for the rest of the Ethereum roadmap which includes upgrades, known as\"Surge,\" \"Verge,\" \"Purge,\" and\"Splurge.\" Ethereum co-founder Vitalik Buterin discussed the upgrade path, which would make Ethereum \"a far more scalable system,\" at the recent Ethereum Community Conference (EthCC) in Paris.\n\nFuture upgrades include supporting thousands of transactions per second to make applications faster and more affordable to use, improving its protocol's security against all types of attack as use of it rises, and being more environmentally friendly.\n\n‍\n\n10. Wen Merge\n\nThe merge is currently set to occur on September 15. Exciting potential and innovations are presented by the Merge and the rest of Ethereum's roadmap. Many followers of Ethereum anticipate positive outcomes, but it's yet unclear how these changes will affect the ecosystem.\n\nSince cryptocurrency is still in its infancy, there is extreme potential for it to develop. There will be advancements in the future that no one can currently conceive but which will unquestionably be very important in this booming business.\n\n‍\n\n‍\n\nBitbuy now offers Ethereum staking for Canadians in a safe and regulated environment. Learn more on how you can effortlessly start earning staking rewards here."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vd3d3LmZpbmRlci5jb20uYXUvZXRoZXJldW0vaG93LXRvLXN0YWtlLWV0aGVyZXVt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Apr 2023 07:00:00 GMT",
        "title": "How to stake Ethereum and earn ETH rewards (2024 update) - finder.com.au",
        "content": "Following the Merge, Ethereum now uses proof of stake (POS), which allows you to stake your Ether coins (ETH) in return for more ETH.\n\nStaking is designed to make the Ethereum network faster, more scalable and more sustainable. Mining on Ethereum has stopped, leaving staking the only way to earn new ETH. There are both simple and complex ways to participate in staking, each with its own benefits and risks that you need to weigh up.\n\nThis is not an endorsement of cryptocurrency or any specific provider, service or offering. It is not a recommendation to trade or use any services.\n\nWhat is Ethereum staking?\n\nEthereum staking involves validating transactions on the Ethereum network to earn new ETH coins. By locking up a minimum of ETH in a wallet, you gain the ability to confirm whether a transaction conforms to signature requirements and other rules. In return for your work, you get additional ETH coins – these are called staking rewards.\n\nAnyone can become a validator by staking through dedicated software, through your Ethereum wallet or by joining a staking pool.\n\nThe minimum amount of ETH required to run a validator node alone is 32. Anyone with less than that will want to join a pool or another service that lets you stake small amounts of ETH for rewards. You can find these pools on trading platforms such as Kraken and Binance, or DeFi services like Lido and Rocket Pool. These services usually let you start with 1 ETH or even less.\n\nStaking's goal is to make the network more secure from attacks and more decentralised. Ethereum staking is the only way to create new ETH coins following the Merge, which made energy-intensive mining obsolete.\n\nWhat is the Merge? The Merge refers to the Ethereum network upgrade that went live in September 2022. It implemented the following: The final transition to PoS and elimination of proof-of-work (PoW) mining.\n\nEnabled future scaling upgrades that will increase transaction speed and throughput.\n\nReduced energy consumption by 99.95%.\n\nHow to stake Ethereum\n\nThere are various ways of staking Ethereum. This depends on how much Ether you're willing to deposit and how comfortable you are using the Ethereum blockchain.\n\nYou must stake 32 ETH to become a validator on your own. This means you get to keep the full staking rewards. With anything less than that, you can join a pool like the DeFi protocol Lido or use an exchange like Kraken. This makes staking a lot easier for most people, although the pool will take a cut of your rewards.\n\nEthereum staking through an exchange pool\n\nIf you don't have 32 ETH or want to deposit that much, consider joining a staking pool.\n\nThis is a simpler process than staking alone as the pool and services staking for you typically do the technical work on your behalf. Because these pools provide a service for you, most pools charge either a flat fee or a percentage of your rewards for doing so.\n\nExchange pools operate on exchanges like Binance, Coinbase and Kraken, but some of these may not be available to users in Australia. Joining is a matter of creating an account with an eligible exchange and following the instructions for staking your ETH.\n\nAmount to earn on 1 ETH = $6,173.93450 Choose a rate 7% - Kraken Cryptocurrency Exchange 4.5% - Bitstamp Cryptocurrency Exchange Show all table options Daily earnings $0.00 0 ETH Weekly earnings $0.00 0 ETH Monthly earnings $0.00 0 ETH Yearly earnings $0.00 0 ETH Cryptocurrency prices provided by CoinGecko. Results are an estimate based on Finder internal data, provided on a best effort basis. Rate data may be delayed up to 7 days. Please check the provider website for the most current rates and information, and to verify any data provided by this calculator before applying for any product. Loading Coins... Exchange Current rate Monthly average Lock-up period Variable or Locked rates Go to site Bitstamp Cryptocurrency Exchange 4.5% 2.62% Varies Variable Read review Kraken Cryptocurrency Exchange 7% 0% Varies Variable Earn now\n\nHow to use the table and calculator Compare rates. The table and calculator display the annual percentage yield (APY). Rates vary depending on a number of factors like the provider, term length and whether or not the rates are variable or fixed. Keep in mind that cryptocurrency yields fluctuate each day. For a more accurate overview, we've provided an average rate based on data from the past month. Choose a variable or fixed rate. To protect against fluctuations, some providers offer a fixed rate. These rates stay consistent over time and do not fluctuate with the market.\n\nCompare lock-up periods. Some accounts require you to keep your funds locked up for a set period, while others will let you withdraw at any time. Calculate your returns. Use the calculator to project how much you could earn with each provider. Start earning. Once you've made your choice, click on the green \"Earn now\" button to go to the provider's website and create an account or log in.\n\nEthereum staking with a wallet\n\nYou can use any compatible Web3 wallet like MetaMask to stake through a pool like Lido or Rocket Pool. The process only takes a few minutes and has the added benefit of providing you with a Liquid Staking Derivative (LSD).\n\nLSD's are tokens that represent your staked share of ETH and increase in value over time, which reflects your accrued staking rewards. LSDs like stETH (Lido) and rETH (Rocket Pool) can are popular and can be easily sold or used with DeFi apps.\n\nAnother way of staking through a wallet is by using a Ledger hardware wallet. Ledger allows you to stake directly through the Ledger Live software or in conjunction with a Web3 wallet. Using a hardware wallet to stake adds an additional layer of security, and is considered the safest way to store cryptocurrency. Ledger partners with either Lido or Kiln to provide staking services through Ledger Live.\n\nIf you have the full 32 ETH required you can use MyEtherWallet which has partnered with a node-hosting service called Staked. It allows browser and mobile wallet users to stake ETH directly through their wallet as a validator.\n\nLedger Nano X Wallet Trezor Model T Wallet Ledger Nano S Plus Wallet Go to site Go to site Go to site Supported assets 5,500+ Supported assets 9,000+ Supported assets 5,500+ Price (USD) $149 Price (USD) $179 Price (USD) $79 See more of the best crypto wallets Compare wallets\n\nEthereum staking with a validator node\n\nStaking as a validator is complex, but here's a brief overview of a method to help you decide if it's right for you.\n\nEither install staking software on your computer or buy specialised staking hardware. Connect your hardware to the internet. Download and validate Ethereum's blockchain data. Run the execution and consensus client software. Deposit your ETH to the official ETH staking address after verifying it at ethereum.org.\n\nHardware requirements to stake alone\n\nYou need storage space and a stable connection to run the validator software:\n\nStaking requires around 2TB SSD storage drive.\n\nYou need a 24/7 uptime without bandwidth caps to sync and validate without interruptions.\n\n8GB RAM if using Raspberry Pi or 16–32GB RAM on a regular computer.\n\nIntel NUC, 7th-gen processor or higher.\n\nHow does Ethereum staking work?\n\nWith Ethereum staking, you secure and add new blocks to the Beacon Chain. You must deposit either 32 ETH to become a full validator or join a staking pool with a lower amount.\n\nYou earn rewards for correctly validating transactions. If you make too many mistakes – for example, validating conflicting blocks – you can lose a part of your staked coins through slashing, a process designed to punish poor validators. You might also be booted from the network.\n\nSlashing\n\nSlashing is a penalty designed to punish validators who submit fraudulent transactions to the Ethereum blockchain. If a validator breaks the rules, they will have a portion of their staked 32 ETH removed from their ownership and be booted from the network.\n\nHow much can I earn with Ethereum staking?\n\nAs of September 2022 you can earn around 4% of your invested ETH, paid annually in ETH coins. This rate is dynamic though and will change over time.\n\nYour rate of return depends on the number of ETH staked at any given time across the network. When fewer ETH are validating the network, the reward is higher to provide an incentive for more users to stake their ETH. The more ETH staked at the same time, the lower the reward.\n\nThe dollar value of your return depends on the current price of ETH. If the price of ETH rises, your reward increases even more. But if the price of ETH drops, your reward value drops as well.\n\nWhen do I get my staking rewards?\n\nThe network transfers ETH staking rewards to validators every epoch – every 384 seconds or roughly 6.5 minutes. The number of coins each validator receives is calculated based on the state of the Ethereum network after an epoch is complete.\n\nYou must be an active validator during the previous epoch to receive a reward, meaning you need to be online and validating the network. You will only be rewarded for the epochs you participate in. Calculations of potential rewards provide only an estimate and you won't know your exact reward amount until you receive it.\n\nBenefits of staking Ethereum\n\nAside from earning ETH rewards, staking is designed for those who want to be part of the community actively building the foundation of the new Ethereum.\n\nYou help the network grow and contribute toward a decentralised world. If this kind of work aligns with your ideology, it might be your main reason to stake.\n\nDrawbacks of staking Ethereum\n\nBefore getting started, weigh potential drawbacks that include the following:\n\nYou must lock up your ETH. You can't access your ETH until the developers make another upgrade after the Merge.\n\nYou can't access your ETH until the developers make another upgrade after the Merge. You can lose ETH. If you're offline for more than 50% of the epoch time or make mistakes, it can cost you. How much you lose depends on your impact on the network. Let's say you and more than two-thirds of validators are offline. You could progressively lose up to 50% of your stake over 21 days. After 21 days, you might be kicked out of the validator pool.\n\nIf you're offline for more than 50% of the epoch time or make mistakes, it can cost you. How much you lose depends on your impact on the network. Let's say you and more than two-thirds of validators are offline. You could progressively lose up to 50% of your stake over 21 days. After 21 days, you might be kicked out of the validator pool. You must keep your address safe. Without your withdrawal address and recovery phrase, you can lose all of your ETH.\n\nWithout your withdrawal address and recovery phrase, you can lose all of your ETH. Value is affected by the market. Because your ETH is locked, if the price of Ether drops, you could lose the value of your cryptocurrency without the ability to sell them off.\n\nBottom line\n\nEthereum staking is the process of locking up a portion of Ether to validate the Ethereum network and earn rewards. You can stake solo with 32 ETH or join a staking pool with a lower amount.\n\nUsing a pool like Lido or Rocket Pool will also provide you with a token which represents your share of staked ETH and rewards. These can be easily sold or used in DeFi applications.\n\nFor added security, consider using a hardware wallet to protect your private keys if you decide to stake through a wallet.\n\nKeep in mind there are various risks involved with staking, such as slashing or smart contract vulnerabilities.\n\nIf the risks feel worth the reward, you'll need to buy some ETH to get started on your staking journey."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9hbGwtYWJvdXQtZW9zLWV2bS1pdHMtc3RhbmRpbmctYWdhaW5zdC16a2V2bS1hbmQtemtzeW5jLWVyYS1hbmQtbW9yZS_SAV9odHRwczovL2FtYmNyeXB0by5jb20vYWxsLWFib3V0LWVvcy1ldm0taXRzLXN0YW5kaW5nLWFnYWluc3Qtemtldm0tYW5kLXprc3luYy1lcmEtYW5kLW1vcmUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "All about EOS EVM, its standing against zkEVM and zkSync Era, and more - AMBCrypto News",
        "content": "EOS has claimed that its EVM is considerably faster than Polygon and Solana.\n\nThe token’s price increased after the launch, but later registered a decline.\n\nEOS Network Foundation [EOS] recently launched its EOS EVM, an emulation of the Ethereum Virtual Machine, deployed as a smart contract on the blockchain. Ignas, a popular Twitter account that posts insights about DeFi and other crypto spaces, highlighted EOS EVM’s features and capabilities in a 17 April tweet.\n\n1/6 EOS launched the EOS EVM chain. It offers $EOS performance with the resources of the Ethereum community. EOS EVM claims to be 25x faster than AVAX and 3x faster than Solana or Polygon. — Ignas | DeFi Research (@DefiIgnas) April 17, 2023\n\nHow much are 1,10,100 EOSs worth today?\n\nA-Z about EOS EVM\n\nThe EOS EVM runs decentralized applications written in Solidity, the native programming language of Ethereum [ETH]. The solution was developed to tackle the challenges faced by Ethereum developers, such as scalability.\n\nThe blockchain’s new EVM aims to solve this problem by successfully combining the strong performance of the EOS Network with the easily accessible resources of the Ethereum community. The newly launched EVM is designed to complement Ethereum and accelerate the network’s mass adoption.\n\nEOS EVM vs. competitors\n\nIgnas’ tweet mentioned that EOS EVM claims to be 25 times faster than Avalanche [AVAX] and three times faster than Solana [SOL] or Polygon [MATIC]. Better speed can be a key factor in attracting new users. Apart from the speed, ENV committed to investing $20 million in GameFi and EOS EVM projects to further the growth and adoption of EOS. But will it be enough to entice the community?\n\nThe question can be better answered after checking the performance of its competitors, such as Polygon’s zkEVM. As per Dune’s data, zkEVM’s unique depositors have declined sharply, which can be good news for EOS EVM. A similar decline was also noted on zkSync Era’s unique wallet counts, giving EOS EVM an opportunity to grow.\n\nEOS network since EVM launch\n\nIt was interesting to see that on the day of the EVM launch, the blockchain’s network value spiked as its TVL increased. However, the uptrend was short-lived, as it declined over the following days.\n\nDespite the EVM launch, the network’s development activity remained low in April 2023. Nonetheless, EOS remained a topic of discussion in the crypto community as its social volume remained relatively high throughout the last 30 days.\n\nRealistic or not, here’s EOS market cap in BTC’s terms\n\nThe network’s token reaction was positive\n\nSoon after the EVM was released on 13 April, the blockchain’s native token’s price action turned bullish. However, the upward momentum halted soon as its price went down over the coming days.\n\nWhile its price increased, positive sentiments around EOS also spiked. Another good news for the token was its green funding rate, reflecting its demand in the futures market. At the time of writing, the token was trading at $1.21, with a market capitalization of more than $1.3 billion."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZmluYm9sZC5jb20vZXRoZXJldW0tcmFpbmJvdy1jaGFydC1zZXRzLWV0aC1wcmljZS1mb3ItZW5kLW9mLTIwMjMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Rainbow chart sets ETH price for end of 2023 - Finbold - Finance in Bold",
        "content": "After the Shanghai and Capella upgrades, jointly called Shapella, enabled Ethereum (ETH) unstaking for the first time since ETH staking was introduced in December 2020, its price surpassed the $2,000 psychological threshold and remained stable, leaving investors to try and gauge its future movements.\n\nIn doing so, some cryptocurrency traders use BlockchainCenter’s rainbow price chart for Ethereum to follow the digital asset’s historical movements in relation to various moving averages (MA), which may help in recognizing certain trends and allow people to make investing decisions.\n\nCurrently, the rainbow chart suggests that Ethereum is in the ‘Fire Sale’ phase, which is indicated by the purple color and ranges between $0 and $2,320, as it is trying to break upwards into the ‘Undervalued’ zone (blue), which stands between $2,320 and $3,282, according to the data retrieved by Finbold on April 18.\n\nEthereum rainbow price chart. Source: BlockchainCenter\n\nAs opposed to the Bitcoin (BTC) rainbow chart, which suggests trends up to 2035, Ethereum’s (for now) only allows users to observe possible trends for the next several months – until October 2023 – but one can still make educated guesses based on its earlier chart patterns.\n\nEnd-of-year projections\n\nSpecifically, Ethereum was last in the ‘Fire Sale’ zone in July 2020, from which it took almost a year (until May 2021) to peak in the ‘But have we *earned* it’ zone at $4,354. Today, this zone for ETH ranges between $14,625 and $21,231, and it may not happen until February 2024 if the chart patterns repeat themselves.\n\nBefore that, Ethereum was in the ‘Fire Sale’ area only once – in October 2015, soaring to the ‘Go back to BTC?’ zone four months later. That said, this bullish rally was followed by a drop toward the ‘Undervalued’ area, which it reached in January 2017. However, ETH crossed the barrier for ‘Maximum Bubble Territory’ in May 2017, staying there interchangeably with the ‘Go Back to BTC?’ until August 2018.\n\nIf this pattern is to happen again, it would mean that Ethereum could soar to the ‘Go back to BTC?’ in August 2023 (currently between $21,231 and $30,654), then drop to the ‘Undervalued’ in September 2024 (currently between $2,320 and $3,282), before skyrocketing in January 2025 in the ‘Maximum Bubble Territory’ ( $30,654 and beyond).\n\nEthereum price analysis\n\nAs things stand, Ethereum is currently changing hands at the price of $2,104.50, which demonstrates an increase of 0.56% on the day, adding up to the positive weekly change of 10.19% and an 18.94% gain in the last month, as the asset is holding on to the nearly 80% increase it achieved since the year’s turn.\n\nEthereum year-to-date (YTD) price chart. Source: Finbold\n\nAll things considered, the most bullish rainbow chart scenario for Ethereum sees it surpassing $21,231 in August. On the other hand, $14,625 is possible, but not before February 2024. However, it is important to keep in mind that the situation in the crypto sector can change quickly and depends on more outside factors than just chart patterns.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vYmxvY2tjaGFpbnJlcG9ydGVyLm5ldC9ldGhlcmV1bS1ldGgtcHJpY2UtcHJlZGljdGlvbi0xMDAwMDAv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Apr 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Prediction $100,000 - Blockchain Reporter",
        "content": "Cryptocurrency and blockchain technology have long been evolving with the inclusion of exclusive and groundbreaking innovations. This evolution started right due to the shortcomings and difficulties faced by the crypto users who utilized the primary crypto token . The initial altcoin (the term used for cryptocurrencies other than Bitcoin) to deal with the issues of the chief crypto was . It was developed and launched by Ethereum a few years after.\n\nEthereum: An Introduction\n\nFundamentally, Ethereum is known as a worldwide decentralized software platform that uses blockchain technology. It is usually famous for its local crypto token Ether (ETH). The platform of Ethereum can be utilized to develop any safe digital technology. Its token is structured for payment dealing with the work carried out to support the blockchain. Nonetheless, the members can additionally utilize it for the payment of tangible services and goods if accepted. Ethereum is developed to be decentralized, secure, programmable, and scalable.\n\nOne important aspect of Ethereum and other cryptocurrencies is the concept of a trading pair. With Ethereum, the most common trading pair is ETH USDT or Ether traded against the Tether stablecoin (pegged to the US dollar).\n\nIt is known as a blockchain platform that is preferred by enterprises and developers who are engaged in developing technology to facilitate the industries as well as serve real-world use cases. Ethereum is locally compatible with smart contracts that are categorized as an essential instrument at the back of the decentralized applications (dApps). Several applications related to decentralized finance (DeFi) utilize smart contracts in addition to blockchain technology.\n\nEthereum (ETH) Price Statistics\n\nEthereum (ETH) Price: $2,009.15 Ethereum (ETH) Rank: 2 Ethereum (ETH) Market Cap: $242,018,190,647 Ethereum (ETH) Trading Volume: $12,792,581,321 Ethereum (ETH) 24h High: $2,022.15 Ethereum (ETH) 24h Low: $1,901.86\n\nA Brief History\n\nThe idea of developing\n\nis credited to Vitalik Buterin. A white paper was published by him about Ethereum back in the year 2014. The platform of Ethereum was introduced a year later by Joe Lubin (the person who founded the blockchain software firm ConsenSys) and Vitalik Buterin in 2015. The Ethereum founders are considered among the earliest to be in knowledge of blockchain technology’s complete potential beyond just offering a secure method for virtual payments.\n\nSince Ethereum’s launch, a great rise has been witnessed in Ether’s market. As a result of this, the ETH token remained successful in getting the 2nd spot after the top crypto Bitcoin in terms of market value. In this way, it is now the top crypto token among the altcoins. Similar to the rest of the digital assets, Ethereum has blockchain technology underlying it. A blockchain contains blocks in a lengthy chain.\n\nThe information kept in each of the blocks is incorporated into each of the latest-developed blocks with exclusive data. Within the network, the blockchain’s identical copy is distributed. A network containing automated programs is responsible for the validation of this blockchain. The respective programs get to a consensus over the legitimacy of the transfer of information. No modifications can be done to the blockchain if the network does not reach a consensus.\n\nThe respective characteristic makes it considerably shielded. An algorithm, usually known as a consensus mechanism, is utilized to reach a consensus. Ethereum network utilizes the proof-of-stake algorithm that enables a group of members known as validators to develop exclusive blocks as well as operate in mutual harmony. In this way, they validate the information contained by them.\n\nThe blocks keep information dealing with the blockchain’s status, a series of attestations (taking into account a validator’s signature), transfers, and so on. It is noteworthy here that Ethereum formally altered its algorithm from the proof of work (PoW) to proof of stake (PoS) back in September last year with its enormous “The Merge” upgrade. PoW is the power-intensive and expensive consensus mechanism while PoS is the latest, cost-effective, less energy-consuming, and environment-friendly consensus mechanism. The upgraded Ethereum is called Ethereum 2.0.\n\nProof-of-Stake Mechanism\n\nProof-of-stake is different from proof-of-work because it does not need the energy-consuming computing known as mining for the validation of the blocks. On the contrary, it utilizes a finalization protocol named Casper-FFG as well as an algorithm named LMD. These are added into a consensus named Gasper. The respective mechanism is responsible for monitoring the consensus as well as defining how validators are given rewards for their work or get punished for their dishonesty.\n\nSingle validators are required to stake thirty-two ETH tokens to be eligible for validation. People can stake minor\n\namounts, nevertheless, there is a need for them to join a validation pool as well as share the rewards. A validator develops an exclusive block as well as confirms that the information is valid in a procedure known as attestation.\n\nIn this process, the block is broadcasted to the rest of the validators within a committee specified for the verification as well as vote for the validity. On the other hand, the dishonest validators – who attempt to assault the network – are penalized as the ETH tokens staked by them are burned. Burning is considered the delivery of crypto assets to a wallet with no keys.\n\nGrand Split in Ethereum\n\nThe split or hard fork of Ethereum is known as a prominent incident in the platform’s history, dividing it into Ethereum Classic and Ethereum. Back in 2016, several network members obtained majority control of the platform’s blockchain. As a consequence of that, they took away ETH assets of above $50M worth. The respective funds were specified for a project named “The DAO.” Keeping this in view, the majority of the community demanded the return of the stolen assets.\n\nThey wanted this to be done by the invalidation of the present Ethereum blockchain as well as authorizing a blockchain platform with a reviewed history. Nevertheless, a portion of the community intended to keep up with the Ethereum blockchain’s original version. That is how Ethereum’s unmodified version became Ethereum Classic (ETC) following the split. Ethereum Classic’s blockchain still uses the PoW consensus algorithm and several speculations are also being made about the Ethereum mining profitability.\n\nComparison between Ethereum and Bitcoin\n\nA comparison is often drawn between Ethereum and Bitcoin. Though both crypto tokens have several similarities, there are also a few distinctions among them. The developers and founders of Ethereum describe it as the top programmable blockchain of the world as it is an electronic as well as programmable network that supports several applications. On the other hand, the blockchain of Bitcoin has been developed just to support the\n\ntoken.\n\nThe cumulative number of Bitcoin tokens to be entered into circulation is up to 21M. As opposed to this, the number of ETH tokens to be created is unlimited, though the time consumed in processing an ETH block limits the number of tokens to be minted every year. The Ethereum tokens in circulation are above 122M. Another important distinction between them is related to how these networks deal with the transfer processing charges.\n\nThe respective fees are paid on Ethereum by members while carrying out transfers. The charges linked to Bitcoin transfers are engrossed by the wider Bitcoin network. Above all, the consensus mechanisms of both networks are different although formerly both were using the same. Ethereum is now using a proof-of-stake consensus mechanism while\n\nEthereum (ETH) Price Prediction: Price History\n\nis still utilizing its original proof-of-work consensus where the miners need to compete with each other for rewards.\n\nWith the past price performance of the crypto assets, the long-term crypto market outlook is clarified. It makes it easy to know more about Bitcoin as well as the altcoin market trends. In the case of Ethereum, the initial transaction on the network was performed back in the year 2015. Since its launch, during the major portion of that year, Ethereum remained under the $1 mark.\n\nNonetheless, in the next year, Ether moved beyond $10 in terms of price when it reached $10.03 for a brief time on the 4th of March in 2016. In the year 2017, Ether gained considerable fame and touched $100 in May. After that, by the year’s end, the crypto token’s value reached $774.69. Then, within 2018’s 1st week, it even reached above the $1000 spot. Following the unprecedented upsurge, the crypto crash (better called the Bitcoin crash) was also experienced by Ether in 2018.\n\nAs a result, a decrease of nearly $100 in price per token was seen by 2018’s end. Following that, between 2019 and 2021, the token again rallied and touched its all-time high price on the 9th of November at approximately $4,815. During 2022’s initial half, the value of the token went through a significant dip. However, several developments have been carried out by the network. The chief characteristics of Ethereum like providing worldwide compatibility for DApps, smart contracts, and other scaling solutions have increased crypto adoption.\n\nEthereum (ETH) Price Prediction: Price Analysis\n\nAt present, the price of Ethereum is $2,009.15. The fundamental analysis of Ethereum’s price says that it has a 24-hour high of up to $2.022.15 while $1,901.86 is its 24-hour low price level. The current price of the token has increased by 4.94% in the recent 24 hours. The market capitalization of Ethereum stands at $242,018,109,647. The 24-hour trading volume of the crypto token is approximately $12,792,581,321. The circulating supply of Ethereum is almost 120,457,776 ETH tokens while its cumulative supply is nearly 120,457,776.\n\nThe technical analysis of Ether points out that it has an overall bullish sentiment. This has become possible after the Ethereum network’s continuous efforts to exit the bearish momentum that it was experiencing during the previous months. The potential cause behind it was the general crypto downfall and other macroeconomic factors. Since the initial coin offering of Ethereum, the price of ETH has jumped by up to 6,788.06 times in comparison with the US dollar.\n\nOn the other hand, a 105.78 times spike has been seen by the token in comparison with the top crypto Bitcoin. The fear and greed index is placed at 70 showing “Greed.” Apart from that, in the recent thirty days, the token has seen positive price movement in up to 16 days. The token is currently trading at a top point within its trading cycle. Moreover, Ether has a very low inflation rate. The annual inflation rate of Ethereum is almost 0.07% at the moment.\n\nEthereum (ETH) Price Prediction\n\nThe crypto market trends and the market analysis point out that Ethereum will likely see a great upsurge in its value in the coming time irrespective of the cryptocurrency price volatility. Apart from the retail adoption, the institutional adoption of Ethereum is also expected to have substantial uptake in the future. According to the anticipation, the political factors and the global economic factors will also get gradually favourable for crypto. Furthermore, the regulatory landscape around crypto will also be improved to a great extent.\n\nEthereum (ETH) Price Prediction 2023\n\nThe crypto market analysis brings to the front that blockchain technology trends are getting more and more traction around the world. In this respect, Ethereum network scalability will play a significant role in onboarding a lot of exclusive people into the crypto ecosystem. Exclusive innovations like smart contracts in Ethereum are expected to elevate its popularity. Hence, the maximum price of Ether will be up to $2,650 this year. $1,450 will be its minimum price. The crypto token will trade for around $2,050 on average.\n\nEthereum (ETH) Price Prediction 2025\n\nEthereum price forecast indicates that the political and economic factors affecting crypto prices will expectedly become supportive for crypto. With the dependence of decentralized finance (DeFi) on Ethereum along with the positive crypto market predictions and trends,\n\nEthereum (ETH Price Prediction 2030\n\nis expected to reach the price level of $6,000 at maximum by 2025. The minimum price of the token will be nearly $4,300. On the other hand, ETH is anticipated to trade at around $5,150 by that year.\n\nThe positive long-term crypto market outlook suggests that the crypto regulatory landscape and its impact on prices will become positive by the year 2030. Furthermore, the crypto market sentiment analysis signifies that a huge proportion of the financial community will be pro-crypto by that time. Apart from that, the institutional adoption of cryptocurrencies will also have an enormous spike.\n\nIn this regard, the Ethereum 2.0 features and benefits will grasp the attention of entrepreneurs. Ethereum price history and trends are presently pointing toward a bullish price momentum to be seen in the next years. It is expected that cryptocurrency investment opportunities will also increase with time.\n\nParticularly, Ethereum adoption and use cases will additionally surge significantly. Therefore, it is projected that the token might reach $15,555 as its maximum price by 2030. The minimum price level of Ether is predicted to be $12,500. Nevertheless, $14,028 will be the average price level of ETH by that year.\n\nCan Ethereum (ETH) Reach $100,000\n\nAt present no sufficient data is available on whether Ethereum will touch $100,000. However, Ether’s price can reach the price level of $40,000 by the year 2040.\n\nFundamentally, Ethereum is known as a worldwide decentralized software platform that uses blockchain technology. It is usually famous for its local crypto token Ether (ETH). The platform of Ethereum can be utilized to develop any safe digital technology. Its token is structured for payment dealing with the work carried out to support the blockchain. Nonetheless, the members can additionally utilize it for the payment of tangible services and goods if accepted. Nowadays there are many ways to earn free Ethereum. Ethereum is developed to be decentralized, secure, programmable, and scalable.\n\nConclusion\n\nThe huge potential of Ethereum discloses that the\n\nFAQ\n\nWhat is Ethereum? Ethereum is a global, decentralized software platform that uses blockchain technology. It is best known for its native cryptocurrency token, Ether (ETH). The Ethereum platform can be used to develop secure digital technologies, and its token is designed for payment processing for work done to support the blockchain.\n\nWho created Ethereum? Ethereum was created by Vitalik Buterin, who published a white paper about it in 2014. The platform was launched in 2015 by Buterin and Joe Lubin, founder of the blockchain software firm ConsenSys.\n\nWhat is a smart contract? Smart contracts are self-executing contracts with the terms of the agreement directly written into code. They run on blockchain technology and facilitate decentralized applications (dApps).\n\nWhat is Ethereum’s consensus mechanism? Ethereum currently uses a proof-of-stake (PoS) consensus mechanism, which allows a group of validators to create new blocks and verify the information within them. Ethereum transitioned from a proof-of-work (PoW) to a PoS mechanism with its “The Merge” upgrade in September last year.\n\nWhat was the Ethereum hard fork? The Ethereum hard fork occurred in 2016, when a portion of the community decided to invalidate the existing Ethereum blockchain and adopt a new one with a revised history. This event led to the creation of Ethereum Classic (ETC), which maintains the original, unmodified version of the blockchain.\n\nHow does Ethereum differ from Bitcoin? Ethereum and Bitcoin differ in their purpose, token supply, and consensus mechanisms. Ethereum is designed as a programmable blockchain, whereas Bitcoin’s blockchain is designed solely to support the BTC token. Ethereum has an unlimited token supply, while Bitcoin has a fixed supply of 21 million tokens. Ethereum uses a proof-of-stake consensus mechanism, while Bitcoin still uses proof-of-work.\n\nWhat are some Ethereum price predictions for 2023, 2025, and 2030? Ethereum price predictions include: 2023: Maximum price of $2,650, minimum price of $1,450, and an average price of $2,050.\n\n2025: Maximum price of $6,000, minimum price of $4,300, and an average price of $5,150.\n\n2030: Maximum price of $15,555, minimum price of $12,500, and an average price of $14,028.\n\nCan Ethereum (ETH) reach $100,000? Currently, there is not enough data to determine if Ethereum will reach $100,000. However, it is predicted that Ethereum’s price could reach $40,000 by the year 2040.\n\ntoken will offer great investment opportunities. However, investors should also be cautious of the volatility of the crypto market. They should do proper research and keep an eye on good and suitable cryptocurrency trading strategies and investment strategies. Additionally, they should not neglect the risk factor of this space and should only move forward if they have a taste for it.\n\nREAD MORE:\n\nEthereum Price Prediction: Important Factors For Investors\n\nMullen Automotive Stock Price Prediction: Will Mullen’s Bankruptcy Risk Cause More Price Drops for MULN?\n\nBaby Doge Coin (BABYDOGE) Price Prediction\n\nLucid Stock Price Prediction 2025: Can LCID Stock Recover Amid Bearish Sentiment?\n\nEverGrow Coin Price Prediction: Will EGC Skyrocket to $1 Soon?\n\nMANA Price Prediction $100 In 2022-2030: Will Decentraland Rise to $100?\n\nRivian Stock Price Prediction 2025 & 2030: What Lies Ahead for RIVN Stock Price?"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3LmFzaWFjcnlwdG90b2RheS5jb20vd2hhdC1pcy1vcHRpbWlzbS1sYXllci0yLXByb3RvY29sLW9uLWV0aGVyZXVtL9IBTmh0dHBzOi8vd3d3LmFzaWFjcnlwdG90b2RheS5jb20vd2hhdC1pcy1vcHRpbWlzbS1sYXllci0yLXByb3RvY29sLW9uLWV0aGVyZXVtLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Apr 2023 07:00:00 GMT",
        "title": "What is Optimism: Layer 2 Protocol on Ethereum - Asia Crypto Today",
        "content": "In the ever-evolving world of blockchain technology and cryptocurrencies, Optimism has emerged as a game-changer in the Ethereum ecosystem. By offering faster transaction speeds and reduced costs, Optimism has quickly gained traction among developers and users alike. In this comprehensive guide, we will explore the origins of Optimism, its core technology, and the impact it has had on the Ethereum network.\n\nWe’ll discuss the revolutionary OP token and its role in governance, the creative potential of Optimist NFTs, and the reasons why developers are increasingly drawn to Optimism’s capabilities. So, whether you’re a developer, crypto enthusiast, or simply curious about the future of blockchain technology, this ultimate guide to Optimism is the perfect starting point for your journey.\n\nBackground\n\nOptimism emerged on the scene in June 2019, and within a few months, they had already set up their testnet. However, it took until January 2021 for an alpha mainnet to be introduced, and it wasn’t until December 2021 that Optimism saw a worldwide release with comprehensive compatibility for Ethereum and its EVM. The company was established in 2019, led by a team of experts including Chief Scientist Benjamin Jones, CEO Jinlan Wang, and Protocol Product Manager Kevin Ho.\n\nWhat is Optimism?\n\nOptimism enhances Ethereum transactions by accelerating their speed and reducing their costs through the implementation of advanced data compression methods on a separate blockchain. The core of Optimism’s scaling strategy lies in its use of optimistic rollups, a technique that consolidates multiple transactions into a single transaction. This is then settled on an alternate blockchain, with the transaction receipts sent back to the primary Ethereum blockchain.\n\nOptimistic rollups are a unique type of rollup that ‘optimistically’ assumes the validity of all transactions within the rollup. This approach saves time as individual transactions don’t require direct proof of validity. Validators in the rollup have a week to examine the rollup if they suspect it contains fraudulent data.\n\nData from a Dune Analytics dashboard reveals that Optimism slashes Ethereum transaction fees, also known as gas fees, by an impressive 129 times. DeFi platforms like Synthetix and Uniswap have embraced this technology, further showcasing its effectiveness.\n\nHow Do Rollups Work?\n\nOptimistic rollups work by aggregating multiple off-chain transactions into large batches before submitting them to the Ethereum network. This approach allows for the distribution of fixed costs across numerous transactions, effectively lowering the fees for end-users. Additionally, optimistic rollups utilize compression techniques to minimize the data volume posted on the Ethereum blockchain.\n\nThe term “rollups” is used because these techniques bundle or roll up data from hundreds of transactions, such as non-fungible token (NFT) mints and token swaps, into a single transaction on the Ethereum mainnet (layer 1). By consolidating so many transactions into one, the blockchain transaction or “gas” fee required is reduced to just one transaction, evenly distributed among all participants.\n\n“Optimistic” rollups get their name from the assumption that transactions are valid until proven otherwise, or “innocent until proven guilty.” A designated time window allows for the challenging of potentially invalid transactions by presenting a “fraud proof” and executing the transactions’ computations based on available state data. Optimism compensates for the gas necessary to carry out the computation of the fraud proof, ensuring the process remains efficient and transparent.\n\nOP Token\n\nOptimism introduced the OP token on May 31, initially distributing 214 million OP tokens for free (known as an “airdrop”) to 231,000 eligible addresses. This initial distribution represented 5% of the total supply of 4.29 billion tokens, with 95% of the supply remaining to be introduced to the market. The Dune Analytics dashboard provides information on the number of users who claimed the first airdrop.\n\nThe initial airdrop led to some dissatisfaction among the Optimism community as a few users claimed their tokens early and proceeded to sell them off.\n\nHolding OP tokens grants individuals the right to participate in The Optimism Collective, a dual-tier governance system consisting of the Token House and the Citizens’ House. The Token House, which is currently operational, oversees technical decisions related to Optimism, including software updates. The Citizens’ House, on the other hand, is responsible for governing public-goods funding decisions.\n\nOptimist NFTs\n\nOptimist NFTs are fully customizable digital avatars designed to represent your personality and establish your web3 identity. With Optimist NFTs, you can create a distinctive avatar that embodies your unique character and interests.\n\nTo craft your personalized avatar and embark on your web3 journey, visit the avatar builder. Here, you can tailor your avatar to reflect your individual style and interests before minting it for the world to see.\n\nCurrently in its Beta phase, Optimist NFTs are only available for minting by voters in RetroPGF 2. Starting in early 2023, a few hundred active addresses will be invited to mint each month based on their involvement in the Optimism Collective and data logged in the AttestationStation.\n\nIf you’re interested in minting Optimist NFTs in the future, follow @OptimismFND on Twitter or explore their documentation to discover products that can help build your reputation on Optimism.\n\nAs the Optimism Collective expands to include the entire crypto community, Optimist NFTs will become widely accessible for minting and customization. In the future, new traits can be unlocked depending on your participation within the Optimism ecosystem and the reputation you’ve gained. During the initial stages of the Optimist NFT rollout, make sure to use the same device on which you minted your NFT to guarantee that your traits are accurately returned.\n\nWhy Developers Like Optimism\n\nOptimism is highly attractive to developers due to its seamless compatibility with the layer 2 network and existing Ethereum applications. The ability to create apps on the layer 2 network and ensure smooth functionality with Ethereum has led to a growing number of users and dApps being developed, all while benefiting from Ethereum’s security. Consequently, the number of Optimism transactions has surged over tenfold in the past year.\n\nHowever, Optimism isn’t competing with Ethereum; rather, it complements Ethereum’s scaling strategy, which is centered around a rollup-centric roadmap. Optimistic rollups, such as those implemented by Optimism and Arbitrum (currently the two largest Layer 2 protocols), are designed to boost Ethereum’s throughput. By processing transactions externally, they reduce the computational burden on the Ethereum mainchain, resulting in a significant increase in speed.\n\nConclusion\n\nAs the blockchain and cryptocurrency landscape evolves, Optimism presents itself as a notable development in the Ethereum ecosystem. As we continue to witness new advancements and adoption, it is essential to stay informed and engaged with the technologies that shape our decentralized future. By understanding platforms like Optimism and their role within the broader context, we can make more informed decisions and better anticipate upcoming trends in the blockchain space."
    }
]