[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V0aGVyZXVtLXNoYXBlbGxhLW9rLWRlc3BpdGUtYnVn0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Ethereum's Shapella Upgrade Went Through Despite 'Ridiculous Bug' - Blockworks",
        "content": "Ethereum core developers met for their first group call since the activation of the Shanghai-Capella fork on Thursday to prepare for the next phase of the network’s evolution.\n\nTim Beiko, who runs protocol meetings for Ethereum, briefly congratulated the assembled devs before getting down to business.\n\n“Great work everyone on Shapella — it worked,” Beiko said.\n\nBut there was one issue of consequence: A bug in the main execution client Prysm, related to MEV-Boost, caused validators to fail to propose blocks — a crucial part of the normal functioning of the blockchain.\n\nThe Prysm team issued a post-mortem analysis on Friday, identifying the root cause as a missing field during the “unblinding” of the “builder blinded block.”\n\nIn the post-Merge Ethereum blockchain, the “builder blinded block” is a type of block that has been processed by a tool called the “builder” to hide certain information. “Unblinding” this block refers to the process of revealing the hidden information using a cryptographic technique. The missing field — BlsToExecutionChanges — was supposed to be populated during this process, but it was not, which caused the issue.\n\n“It’s safe to say that most of the missed blocks were due to this bug,” pseudonymous Prysm developer Potuz told his colleagues on the Thursday call.\n\nThis bug was difficult to detect when Shapella was activated on testnets, like Goerli.\n\nLuckily, a “circuit breaker” triggered early on, and relayer teams reacted quickly to temporarily disable Prysm support from most relayers, preventing the issue from having a wider impact on network operation.\n\nHowever, the incident highlighted several lessons learned, including the need for more comprehensive testing, and closer collaboration with other teams, such as Flashbots.\n\n“We should set up a way that all of our coding is oriented towards testing the builder,” Potuz said. “This is a ridiculous bug that should not have happened at all. There’s many places where this should have been tested, and all of them failed at the same time. This is impressive.”\n\nA retrospective analysis of the Goerli testnet discovered evidence of the bug there, but the effect was not significant enough in the test environment to attract developer attention, the Prysm team explained on the call.\n\nAround 40% of the Ethereum network nodes run Prysm software, but that percentage has been gradually shrinking as the Ethereum community recognized the need for client diversity. Other clients, Lighthouse, Teku, Nimbus and Lodestar picked up the slack to keep the chain running.\n\nWith Shapella safely in the rear view mirror, developers can now turn their full attention to the next major upgrade, known as Cancun-Deneb, or “Dencun” for short. Cancun, Mexico, was the site of the Devcon 3 conference, in 2017, and Deneb is a star in constellation Cygnus, the swan and a vertex of the Summer Triangle.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS93aGF0LWlzLXRoZS1ldGhlcmV1bS1zaGFuZ2hhaS1zaGFwZWxsYS11cGdyYWRlLWV2ZXJ5dGhpbmcteW91LW5lZWQtdG8ta25vdy_SAWhodHRwczovL2NyeXB0b3BvdGF0by5jb20vd2hhdC1pcy10aGUtZXRoZXJldW0tc2hhbmdoYWktc2hhcGVsbGEtdXBncmFkZS1ldmVyeXRoaW5nLXlvdS1uZWVkLXRvLWtub3cvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "What is the Ethereum Shanghai (Shapella) Upgrade? Everything You Need to Know - CryptoPotato",
        "content": "Ethereum’s Shanghai upgrade, also commonly referred to as Shapella (we’ll explain why below), took place on April 12th.\n\nIt was a major upgrade following Ethereum’s transition to Proof-of-Stake (a.k.a The Merge), and it introduced a major mechanic change.\n\nThe upgrade consists of a few Ethereum Improvement Proposals (EIPs), although most of the focus is on one particular.\n\nThe EIPs in question are:\n\nEIP-3651 : Warm COINBASE\n\n: Warm COINBASE EIP-3855 : PUSH0 instruction\n\n: PUSH0 instruction EIP-3860 : Limit and meter initcode\n\n: Limit and meter initcode EIP-4895 : Beacon chain push withdrawals as operations\n\n: Beacon chain push withdrawals as operations EIP-6049: Deprecate SELFDESTRUCT\n\nWith that in mind, let’s take a closer look and understand why the Shanghai upgrade is so important.\n\nWhat is the Ethereum Shanghai Upgrade?\n\nEthereum’s Shanghai upgrade is arguably one of the most important events in the crypto industry in 2023.\n\nBefore we dive in, did you know that it’s also commonly referred to as the Ethereum Shapella upgrade? The name comes from Shanghai – the city-host of the Devcon 2 conference, and Capella – the brightest star in the northern constellation of Auriga.\n\nAs we know from our guide on Ethereum’s Merge (the transition to Proof-of-Stake), the network has two layers – the execution layer and the consensus layer. The former used to be the main one that Ethereum ran on before The Merge, while the consensus layer was also known as the Beacon Chain.\n\nWith that in mind, the upgrade took part on both layers. Shanghai happened on the execution layer, while Capella – was on the consensus one. Combining both names gives us “Shapella.” However, the Shanghai name remains more prevalent, so for the sake of simplicity, we will use it in the guide going forward.\n\nThe Shanghai upgrade introduced a pivotal mechanic in Ethereum’s network, and while there are many EIPs (as seen above), one of them is critical. Namely, this is EIP- 4895.\n\nWhat is EIP-4895 in the Shanghai Upgrade?\n\nWhile it’s currently running on PoS, Ethereum was using the proof-of-work consensus algorithm well before The Merge took place, But the plans to transition were in play for many years when developers created the so-called Beacon Chain.\n\nThe Beacon Chain was (and still is) secured by PoS. To maintain its integrity, allow it to function as intended, and carry out transactions and smart contracts, it needed validators – just like any other PoS-based blockchains where miners do not exist.\n\nTherefore, those who wanted to partake in the future of the so-called Ethereum 2.0 were able to stake 32 ETH to secure the Beacon chain. The ETH was staked in the Beacon Depositor contract. Validators would then earn interest on their ETH – a reward for securing the network during this development stage.\n\nThe only catch? Well, they weren’t allowed to unstake their 32 ETH until a later, undetermined date. It’s taken years for the team to successfully deliver The Merge, and now, the Shanghai upgrade, through EIP-4895, finally allowed validators to unlock their ETH.\n\nThis guide is not intended as a technical walkthrough, so if you want to learn more about how the mechanic will become possible, please take a look at the official website page for EIP-4895.\n\nIn essence, the goal was to:\n\nIntroduce a system-level “operation” to support validator withdrawals that are “pushed” from the beacon chain to the EVM. These operations create unconditional balance increases to the specified recipients.\n\nThe Beacon depositor contract, as mentioned above, contained about 18 million ETH, which accounted for roughly 15% of the total circulating supply.\n\nValidators are now free to withdraw, albeit with some considerations, their stake and do whatever they decide with it – it becomes entirely liquid. That made this particular EIP very important.\n\nHow do ETH Withdrawals Work?\n\nAs mentioned above, there are some considerations when withdrawals were opened. First things first, there are two types of them – full and partial. Full withdrawals allow validators to exit their stake completely, taking their entire balance of ETH, including the original 32 ETH, as well as any rewards they may have accrued.\n\nPartial withdrawals only allow validators to access the excess (balances over the 32 ETH) needed to run a validator node.\n\nWithin every single block that’s added to the network, 16 validators are able to make partial withdrawals.\n\nIn essence, a total of 1,800 validators can unstake fully.\n\nOther Ethereum Improvement Proposals in the Shanghai Upgrade\n\nThe other proposed improvements were aimed at reducing gas fees during periods of very high network congestion and activity.\n\nEIP-3651 aims to lower the gas costs that are associated with the maximal Extractable Value payments when accessing the COINBASE address. In this particular sense of the word, COINBASE refers to a solution that allows developers to receive new tokens and not the popular US-based exchange.\n\nEIP-3855 is designed to introduce a new instruction that pushes the constant value 0 onto the stack. It’s also aimed at lowering gas costs, but more so for developers. The other proposal, EIP-3860, aims to reduce the fees in other instances, and the same is true for the last EIP-6049 to a certain extent.\n\nConclusion\n\nThe Shanghai (Shapella) upgrade is a landmark development for Ethereum on its path to achieving security, decentralization, and scalability.\n\nIt also removes a huge burden on validators and provides a clear outlook on the network state now that validators have the option to freely remove their stake at will."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDQvMTQvYml0Y29pbi1ldGhlci10dXJuLXVwd2FyZC1pbi1hLWJ1c3ktd2Vlay1vZi1ldGhlcmV1bS1hbmQtaW5mbGF0aW9uLW5ld3Mv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Ether ETH Price Swings Upward After Ethereum Upgrade, but What About the Future? - CoinDesk",
        "content": "Both BTC and ETH breached the upper range of their Bollinger Bands this week, an indication of increased bullishness. The Bollinger Bands indicator is a technical tool that plots an asset's moving average and two standard deviations above and below. A breach of Bollinger Bands in either direction is considered to be a significant event, in this case a bullish one."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1yZXNlYXJjaGVyLXNheXMtc3Rha2luZy1yZXZlYWxzLWlwLWFkZHJlc3Mtc3BhcmtpbmctcHJpdmFjeS1jb25jZXJuc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Ethereum researcher says staking reveals IP address, sparking privacy concerns - Cointelegraph",
        "content": "A researcher at the Ethereum Foundation has revealed that the IP addresses of Ether (ETH) stakers are monitored as part of a broader set of metadata, causing the cryptocurrency community to flag Ethereum for privacy concerns.\n\nIn an April 12 interview on the crypto podcast Bankless, EF researcher Justin Drake revealed that he learned this information “internally” — presumably, at the foundation.\n\nThe metadata Drake referred to is used to track a wide range of things, he explained:\n\n“There’s a lot of metadata, you can look at deposit addresses, you can look at withdrawal addresses, you can look at fee recipients, you can look at IP addresses.”\n\nDrake’s comments appeared to have taken Bankless host Ryan Sean Adams by surprise.\n\nEthereum = 1984 chain\n\n\n\nJustin Drake, who works as the \"Researcher\" at the Ethereum Foundation, said today that when you stake your ETH, you can be tracked via IP address.\n\n\n\nHe says he knows information \"internally\" that such databases exist. pic.twitter.com/2V6DvTobL3 — Pledditor (@Pledditor) April 13, 2023\n\n“So it’s a fairly Sybil resistant dataset of your most involved Ethereum citizens?” Adams asked.\n\n“Exactly,” Drake responded.\n\nThe conversation was initiated when Drake predicted that “special airdrops” may become available for solo stakers — but not the industry heavyweights:\n\n“Then you can identify, okay, we know who Kraken is, we know who Coinbase is, and we can just not give them an airdrop if the purpose of the airdrop is to airdrop to specific individuals that are running solo validators.”\n\nThe conversation caused a stir on Crypto Twitter.\n\nRelated: Crypto privacy is in greater jeopardy than ever before — here's why\n\nOne Twitter user referred to Ether as the “real surveillance coin,” while another mocked Drake by sarcastically rehashing him: “We can stop censorship by censoring those we don’t like.”\n\nAnother described the situation as “central governance to a T.”\n\nTo resolve the privacy concerns, one Twitter user suggested that Ethereum users take on-chain privacy responsibilities into their own hands by installing a Linux operating system, using a Virtual Private Network (VPN) and storing crypto assets on a hardware wallet such as Ledger:\n\nDeFi security setup:\n\n- Linux system\n\n- VPN 24/7\n\n- Ledger (hardware wallet)\n\n\n\nProtect yourselves from data mining and scams\n\n\n\nAm I missing anything? https://t.co/X2YrGwpbdx — DeFi Crypto Vaults (@DefiVaults) April 13, 2023\n\nIt isn’t the first privacy-related statement to have caused a stir in the crypto community either.\n\nConsenSys, the team behind Ethereum wallet MetaMask, began collecting IP addresses in November. The policy amendment was made to ensure that the firm could comply with Know Your Customer (KYC) and Anti-Money Laundering (AML) policies where necessary.\n\nCointelegraph contacted Drake and the Ethereum Foundation for comment but did not receive an immediate response.\n\nMagazine: ‘Account abstraction’ supercharges Ethereum wallets: Dummies guide"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiNGh0dHBzOi8vdGhlZGVmaWFudC5pby9zb2xvLWV0aGVyZXVtLXN0YWtlcnMtYWlyZHJvcHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 19:14:25 GMT",
        "title": "Ethereum Researcher Predicts Solo Stakers May Get Airdrops - The Defiant - DeFi News",
        "content": "Solo nodes would bolster the Ethereum network's decentralization.\n\nBy: Samuel Haig • Loading...\n\nDeFi News\n\nJustin Drake, a researcher at the Ethereum Foundation, said there might be airdrops on he way for individual stakers in the Ethereum network.\n\n“My prediction is that there is going to be special airdrops specifically for solo validators,” Drake said during an April 12 interview on the Bankless podcast.\n\nDrake’s prediction may serve as an incentive for ETH stakers to run solo nodes, which would bolster the network’s decentralization. The comment came on the same day that Ethereum completed its long-awaited Shapella upgrade, which enabled Ethereum stakers to withdraw for the first time.\n\nTracking Information\n\nDrake implied other organizations, not necessarily the EF, were tracking information that is publicly available on the Ethereum blockchain, to identify the wallets of the most committed Ethereum users.\n\n“What is happening right now, this is information that I know internally, there are some people looking at the metadata set for validators,” Drake said.\n\nPrivacy Concerns\n\nBut Ethereum detractors are decrying the network’s lack of privacy.\n\nDrake said the metadata collected includes deposit and withdrawal addresses, fee recipients, IP addresses, and indicators suggesting multiple validators could be operated by the same entity.\n\nPledditor, a pro-Bitcoin commentator, likened Ethereum to the dystopian surveillance state depicted in George Orwell’s novel, 1984, in response to the news. “When you stake your ETH, you can be tracked via IP address,” they said.\n\nDecentralization\n\nThe Ethereum Foundation is keen to encourage more stakers to participate as solo validators to further decentralize its validator ecosystem.\n\nLido, a liquid staking provider spanning 29 independent node operators, is the largest Ethereum staker with 21% of staked ETH, according to Dune Analytics. Lido is followed by centralized exchanges Coinbase with nearly 13%, Kraken at 7%, and Binance with 6%.\n\nEthereum’s eight largest validators represent more than two-thirds of all staked Ether combined."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vZm9ya2FzdC5uZXdzL2tyYWtlbi10by13aXRoZHJhdy11czEtMTctYmxuLW9mLXN0YWtlZC1ldGhlci1pbi1saW5lLXdpdGgtc2VjLXJ1bGluZy1zZXR0bGVtZW50L9IBamh0dHBzOi8vZm9ya2FzdC5uZXdzL2tyYWtlbi10by13aXRoZHJhdy11czEtMTctYmxuLW9mLXN0YWtlZC1ldGhlci1pbi1saW5lLXdpdGgtc2VjLXJ1bGluZy1zZXR0bGVtZW50L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Kraken to withdraw US$1 bln of staked Ether after SEC ruling against staking crypto - Forkast News",
        "content": "Kraken has registered to withdraw 556,272 Ether worth about US$1.17 billion, the largest amount since the Ethereum blockchain’s Shanghai upgrade on Wednesday this week to allow such withdrawals.\n\nKraken accounted for 63.3% of all staked Ether in the queue for withdrawal as of 1:30 p.m. on Friday in Hong Kong, according to data from blockchain data tracker Nansen.\n\nThe withdrawals by Kraken come after the SEC in February fined the exchange US$30 million for failing to register staking programs and forced it to shut down its staking services for U.S. users.\n\n“It’s kind of expected that certain centralized exchanges are initiating withdrawals. That includes Kraken,” Zhuling Chen, chief executive officer of crypto staking service provider RockX, said in an interview on Thursday.\n\nKraken did not respond to two emails from Forkast requesting comment.\n\nThe main feature of Ethereum’s upgrade is allowing users known as validators to withdraw their staked Ether. Such tokens were deposited to support the operations of the Ethereum blockchain, the world’s second-biggest, in return for a passive income, usually in the form of more tokens. As many as 115,200 withdrawals can be processed a day, according to the Ethereum Foundation.\n\nCoinbase, the largest crypto exchange in the U.S., has initiated withdrawal requests of 94,749 Ether, which accounted for 10.8% of the total in the queue, the Nansen data showed. Crypto exchange Huobi has requested withdrawals of 45,072 Ether – about 5.1% of the total in the queue.\n\n“Other than [centralized exchanges], we have not seen a huge volume of withdrawals,” said Chen. He added that in tandem with the exits, there’s a “steady inflow of staked Ether.”\n\nAbout 107,790 Ether have been staked since the upgrade, while 249,270 Ether have been withdrawn as of 1:30 p.m. in Hong Kong, according to data from Token Unlocks. More than 1 million Ether are in the queue for withdrawal, the data showed.\n\nWith around 18 million Ether (US$34.5 billion) – or about 15% of the total supply – staked into the network, according to Etherscan, concerns emerged earlier that holders could rush to withdraw and cash in the token.\n\nBut on-chain data provider CryptoQuant said in a report in February it didn’t expect a flood of Ether sales.\n\n“We argue that there would be low selling pressure for Ether from staking withdrawals after the Shanghai upgrade,” CryptoQuant said, adding that the majority of the staked Ether was still holding losses compared to Ether prices when it was staked. Ether reached all time highs of more than US$4,600 in November 2021.\n\n“Typically, selling pressure emerges when market participants are sitting on extreme profits, which is not the case right now for the Ether that has been staked,” CryptoQuant said.\n\nThat view seems to be supported in the market. Ether’s price rose 10.54% in the past 24 hours to change hands at US$2,119 and breach the US$2,000 ceiling for the first time since August last year, according to CoinMarketCap data. The token has risen 77% so far this year.\n\nCryptoQuant also pointed out that the currently locked Ether cannot be withdrawn simultaneously, estimating it may take up to a year to withdraw the total value staked in the network.\n\nThe Shanghai upgrade is a significant milestone in Ethereum history, as it “eliminates the biggest counterparty risk,” Chen said.\n\n“In the past, you’re basically sending your ETH into a black hole and you’re hoping that [for] indefinite time you can get your ETH back together with the rewards,” he said. “But now actually this promise has been delivered.”"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMilwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1yaXNlcy1hYm92ZS0zMDcwMC1ldGhlcmV1bS1jYXJkYW5vLWp1bXAtdXAtdG8tMTEvYXJ0aWNsZXNob3cvOTk0ODQwMzMuY21z0gGbAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZS10b2RheS1iaXRjb2luLXJpc2VzLWFib3ZlLTMwNzAwLWV0aGVyZXVtLWNhcmRhbm8tanVtcC11cC10by0xMS9hbXBfYXJ0aWNsZXNob3cvOTk0ODQwMzMuY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin rises above $30,700; Ethereum, Cardano jump up to 11% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe cryptocurrency markets were trading higher on Friday with an increase of over 4% in the crypto market cap in the last 24 hours. Bitcoin (BTC) rose 2.30% to $30,786, whereas Ethereum (ETH) surged 10.5%, and was above the $2,100 level.\"Rising by over 10% in the past 24 hours, ETH is trading in the $2.1k zone despite some fearing a massive dump after the Shapella upgrade. BTC is also on the rise to chase the $31k mark. The crypto fear and greed index have jumped 7 points to regain the scoring for 68, hinting towards increasing investor confidence,\" Parth Chaturvedi, Crypto Ecosystem Lead at CoinSwitch, said.Other top crypto tokens were also trading higher on Friday. Dogecoin jumped nearly 9%. Meanwhile, BNB , XRP, Litecoin , Solana and Cardano also traded with gains. The global cryptocurrency market cap was trading higher around $1.28 trillion, rising 4.25% in the last 24 hours.The market cap of Bitcoin, the world's largest cryptocurrency, was around $595 billion. Bitcoin’s dominance is currently 46.30%, a decrease of 0.95% over the day, according to CoinMarketCap.\"Bitcoin surged above the US$30,800 level in the past 24 hours as crypto markets continued to react to the latest US inflation report. The support for BTC is located at the US$30,400 level, while resistance lies at the US$30,800 level,\" Edul Patel, Co-founder and CEO at Mudrex, said.Rajagopal Menon, Vice President at WazirX said, \"Major market oscillators point to a neutral sentiment. The Relative Strength Index (14) sits at 71, with a neutral outlook. The Stochastic %K (14, 3, 3) indicates “Sell” at 88 and the Average Directional Index (14) indicates a Neutral outlook at 39.\"The MACD Level (12, 26), at 1097, indicates Buy. The Stochastic RSI Fast (3, 3, 14, 14) indicates Sell at 86 and William's Percentage is Sell at −9 as well,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 10.54 hours, IST on April 14, 2023)Bitcoin $30,780 2.34%Ethereum $2,117 10.52%Tether $1.00 0.01%BNB $334 4.82%XRP $0.5247 3.79%Cardano $0.4414 8.49%Dogecoin $0.09086 9.12%Polygon $1.18 6.97%Solana $25.32 5.60%Polkadot $6.79 5.81%Shiba Inu $0.00001139 4.18%Litecoin $98.24 6.28%Tron $0.0665 2.31%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vY29pbmdhcGUuY29tL2V0aC12cy1idGMtd2h5LWV0aGVyZXVtLXByaWNlLW1heS1mYWNlLXNob3J0LXRlcm0tcGFpbi1haGVhZC_SAVZodHRwczovL2NvaW5nYXBlLmNvbS9ldGgtdnMtYnRjLXdoeS1ldGhlcmV1bS1wcmljZS1tYXktZmFjZS1zaG9ydC10ZXJtLXBhaW4tYWhlYWQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "ETH Vs BTC: Why Ethereum Price May Face Short Term Pain Ahead? - CoinGape",
        "content": "Ethereum News: Ethereum, the second largest crypto registered a price surge of a whooping 7% in the last 24 hours as its network successfully completed the much anticipated Shanghai hard fork. However, the upgrade has allowed the network participants to withdraw their staked funds.\n\nAlso Read: Ethereum Institutional Demand Rises, Will ETH Put BTC Out of Crypto Spotlight?\n\nadvertisement\n\nEthereum Set To Outperform Bitcoin?\n\nThe biggest of altcoins rallied as Ethereum (ETH) price breached the much anticipated $2100 mark after 9 long months. Ethereum price surge comes in when Bitcoin, the biggest crypto asset seems to be in the driving seat mid term. As the sentiment turned out in the favor of ETH, the second largest crypto outperformed BTC over the period of the last 7 days. ETH price spiked by 13%, while BTC price jumped by 10%.\n\nCrypto Analyst, Credible Crypto suggested that Ethereum price might take a hit in the short term, while it is safe to with Bitcoin under this phase. It is important to note that when Bitcoin lead, altcoins follow. As the ETH price broke out through the $2.1K level shortly after breaching the crucial $2K level, implies ETH strength. Read More Ethereum News Here…\n\nAlso Read: US SEC Might Face Jury Over Ripple’s Fair Notice Defence\n\nHowever, this could also suggest that attention now may shift to some altcoin but only if Bitcoin stays and maintain for a bit. Cryptos like Cardano (ADA) and Solana (SOL) price are up by 14% and 21%, respectively.\n\nIt is important to note that ETH price jump is quite weak compared to the Bitcoin surge as market participants didn’t buy Ethereum anticipating a drop after the update. Meanwhile, the amount of unstaking turned out to be much less the expected and ETH price registered a surge. ETH price is up by over 5% in the last 24 hours. It is trading at an average price of $2,115, at the press time."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDQvMTQvZXRoZXItcmFsbGllcy0xMnBlcmNlbnQtaW4tdHdvLWRheXMtdG9wcGluZy0yMTAwLWFmdGVyLXRlY2gtdXBncmFkZS5odG1s0gFsaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjMvMDQvMTQvZXRoZXItcmFsbGllcy0xMnBlcmNlbnQtaW4tdHdvLWRheXMtdG9wcGluZy0yMTAwLWFmdGVyLXRlY2gtdXBncmFkZS5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Ether rallies up to 12% in two days, briefly topping $2,100 after tech upgrade - CNBC",
        "content": "Ether, the digital token of the Ethereum blockchain, is the second-largest cryptocurrency in the world by market value.\n\nCryptocurrencies built on their post-Shanghai/Shapella gains Friday as investors breathed a sigh of relief that Ethereum's latest tech upgrade was completed successfully and without some of the potentially negative aftereffects they initially feared.\n\nEther closed higher by about 3% at $2,084.91, bringing its two-day gain to 10%, according to Coin Metrics, and its weekly gain to 12.32%. Earlier, it rose as high as $2,130.30, its highest level since May. Coin Metrics measures a week in crypto, which trades 24 hours a day, from the stock market close one Friday to the next.\n\nMeanwhile, bitcoin was flat Friday but sustained the $30,000 level it first hit on Monday for the first time since June. It closed at $30,318.38 Friday and posted an 8.61% gain for the week, making it its best week since June 8."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtcHJpY2UtYW5hbHlzaXMtZm9yLWFwcmlsLTE10gE8aHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtLWV0aC1wcmljZS1hbmFseXNpcy1mb3ItYXByaWwtMTU_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Apr 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Analysis for April 15 - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe market is mainly trading sideways at the beginning of the weekend.\n\nAdvertisement\n\nETH/USD\n\nThe rate of Ethereum (ETH) has almost not changed since yesterday.\n\nOn the local chart, Ethereum (ETH) is trading closer to the resistance than to the support, which means that bulls are more powerful than bears at the moment.\n\nCurrently, the daily closure plays an important role. It the bar closes above the $2,100 mark, there is a chance to see a breakout followed by a blast to $2,130.\n\nOn the bigger time frame, Ethereum (ETH) is trading between the recently formed levels. In this case, consolidation in the narrow range of $2,075-$2,130 is the more likely scenario for the next days.\n\nOn the weekly chart, the rate of Ethereum (ETH) is about to fix above the level at $2,015. If it happens and the bar closes with no long wicks, there is a high chance to see a further rise to the $2,200-$2,300 zone.\n\nEthereum is trading at $2,099 at press time."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V0aGVyZXVtLXZhbGlkYXRvcnMtd2l0aGRyYXctNjIwbS1ldGjSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Validators Withdraw $620M ETH in Less Than 2 Days - Blockworks",
        "content": "Ethereum has either fully or partially processed nearly 300,000 ETH ($617 million) in staking withdrawals since Shapella went live Wednesday.\n\nAlmost 5,600 validators have completely unstaked their ETH in that time, representing 1% of the network’s entire set.\n\nAn additional 17,500 validators are currently waiting in the withdrawal queue, as of midday ET. The combined stake of those exiting validators represents a minimum of about 563,000 ETH ($1.16 billion).\n\nPost-Shapella, Ethereum caps the number of validator withdrawals per day at 1,800, so the current queue should be cleared in 10 days, although more are expected to join.\n\nRead more: Stakers, Don’t Let the Shanghai Upgrade Centralize Ethereum\n\nThere are still more than 563,000 active Ethereum validators, so the outflows won’t make a dent in the network’s overall security. More relevant is how validator outflows are changing ETH’s liquid supply.\n\nThe total number of ETH staked has fallen 0.76% since Shapella went live, per Blockworks Research, which means 137,600 ETH ($283.3 million) in additional liquid tokens.\n\nCoinGecko reports $16.8 billion in ETH trade over the past 24 hours — vastly more than what’s been unstaked so far.\n\nAs for the validators that have already completely exited, crypto exchange Kraken is responsible for 41%, according to Rated Network’s explorer.\n\nThose unlocks were potentially inspired by the firm’s SEC settlement from February, which demanded it cease offering staking-as-a-service products, including those related to Ethereum.\n\nThere are fresh ETH deposits flowing into the Beacon Chain\n\nHuobi and self-styled “automated wealth creation community” PieDAO come in second and third for validator exits, with 23% and 13% of the recent set, respectively.\n\nHowever, fresh validators are coming in. As of midday ET, users have staked close to 162,300 ETH ($333 million) in the Beacon Chain since Shapella, according to Blockworks Research data, equal to as many as around 5,100 new validator nodes.\n\nSome speculated that ETH would tank under selling pressure from newly unstaked validators. The earliest stakers locked their tokens in the Beacon Chain back in November 2020 — when ETH was worth $700.\n\nETH’s price is now worth triple, currently trading for just under $2,100. ETH went for as much as $4,600 last November, at the peak of the last bull run.\n\nBut, as it turns out, the market has easily absorbed validator liquidations so far, now up 9% since withdrawals were activated.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1vbi1jaGFpbi1kYXRhLWZvcmVjYXN0cy10aGUtd2l0aGRyYXdhbC1vZi0xLTRtLWV0aC1vdmVyLXRoZS1uZXh0LWZldy1kYXlz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Ethereum on-chain data forecasts the withdrawal of 1.4M ETH over the next few days - Cointelegraph",
        "content": "Ethereum’s long-anticipated Shanghai and Capella upgrades were activated on April 12, and the total withdrawals in the first 40 hours following stood at 142,425 Ether (ETH), per Nansen data. This falls in line with previous estimates.\n\nFor a brief moment on April 12, when Shapella was activated, the deposits to ETH staking contracts outpaced withdrawals. However, deposits have slowed down come April 13, while withdrawals are going strong.\n\nETH moved for withdrawals\n\nValidators are required to update their staking software clients with withdrawal credentials changed to 0x01 from 0x00 and point to a valid Ethereum address. Once validators do that, partial withdrawals —i.e., withdrawals of rewards above 32 ETH — will be processed automatically.\n\nAt the time of writing, 70.1% of validators have changed to 0x01, with 407,851.20, worth over $850 million, set for withdrawal.\n\nAdditionally, 875,325 ETH (worth $1.85 billion) is waiting for full exit. Adding to the amount already processed in the first 40 hours, over 1.42 million ETH will be withdrawn from the staking contract.\n\nETH withdrawals will be rate limited to 1,800 validators per day, translating to a daily withdrawal of 57,600 ETH per day based on 32 ETH per validator. With 875,325 ETH waiting for full exit, it corresponds to potential daily selling pressure of between $120 million.\n\nValidators moving to withdraw their ETH. Source: Nansen\n\nIn the first three days, when partial withdrawals will be processed as well, the total daily withdrawals will be 136,000 ETH and 173,000 ETH per day.\n\nHowever, the above statistics must be taken with a grain of salt because 62.8% are forced withdrawals from the U.S.-based crypto exchange Kraken in response to a $30 million settlement with the U.S. Securities Exchange Commission to discontinue staking services.\n\nThere is a chance that a significant portion of Kraken withdrawals will move to decentralized liquid staking platforms like Lido, Frax and Rocket Pool instead of being sold on the market.\n\nBreakdown of ETH waiting for withdrawals by entities. Source: Nansen\n\nInterestingly, Lido accounts for 56.07% of the withdrawals processed so far, which is slightly concerning, as previous estimates suggested that withdrawals from liquid staking derivative platforms like Lido would be minimal.\n\nCurrently, 9.6 million staked ETH is in profit, which will remain most vulnerable to a sell-off. It also remains to be seen if more illiquid stakers will move to withdraw their ETH, as they represent over 34% of the 17.4 million ETH deposited in total.\n\nEther price analysis\n\nTechnically, the ETH/USD pair looks bullish, having broken above the $2,000 resistance level. Buyers will look to target the support and resistance levels around $2,300 and the May 2022 breakdown levels at around $2,900. Short-term support to the downside lies at around $1,725.\n\nETH/USD daily price chart. Source: TradingView\n\nRelated: Shapella could bring institutional investors to Ethereum despite risks\n\nThe funding rates for ETH perpetual contracts are in neutral territory, deposit the price surge, per Coinglass data. Usually, neutral positioning of the perpetual market after a major price surge means that traders are not yet excited with the present rally, which is represented by a spike in positive funding rates. It also allows more upside room for prices.\n\nETH perpetual futures funding rate. Source: Coinglass\n\nHowever, given that there could be some spot selling pressure from the ETH withdrawals, it will likely restrict the uptrend in the market.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDQvMTQvZXRoZXJldW0tbGF5ZXItMi1uZXR3b3JrLXprc3luYy1lcmEtanVtcHMtdG8tbmVhcmx5LTI1MG0taW4tbG9ja2VkLXZhbHVlL9IBdmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDQvMTQvZXRoZXJldW0tbGF5ZXItMi1uZXR3b3JrLXprc3luYy1lcmEtanVtcHMtdG8tbmVhcmx5LTI1MG0taW4tbG9ja2VkLXZhbHVlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Layer 2 Network zkSync Era Jumps to Nearly $250M in Locked Value - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvMy1jcnlwdG9jdXJyZW5jaWVzLXNob3dpbmctc2FtZS1idWxsaXNoLXBhdHRlcm5zLWFzLWV0aGVyZXVtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "3 Cryptocurrencies Showing Same Bullish Patterns As Ethereum - CoinGape",
        "content": "In the weekly time frame chart, the Ethereum price shows a bullish breakout from a famous chart pattern called the symmetrical triangle pattern. Under the influence of this pattern coin prices usually narrow within two converging trendlines and offer a significant direction rally upon the breakout of the trendlines. Thus, today we will look for the same chart pattern in fellow altcoins and determine the potential growth as they follow one of the market leaders.\n\nBinance Coin(BNB)\n\nSource- Tradingview\n\nadvertisement\n\nFor over a year, the Binance coin price resonated between two converging trendlines showing the formation of a symmetrical triangle pattern. Traders have been actively responding to the pattern setup as evidenced by the coin price bouncing off the support trendline twice and the resistance trendline three times.\n\nBy the press, the BNB price trades at $322 and rechallenges the resistance trendline of the chart pattern. If the weekly candle breach above the downsloping trendline the buyers will obtain significant support to lead the coin price higher.\n\nIn a favorable bullish scenario, the BNB price could rally 80% to reach the $6000 mark.\n\nChainlink (LINK)\n\nSource- Tradingview\n\nOver the past eleven months, the chainlink coin price has wobbled within two horizontal levels $9.4 and $5.4, indicating an evident sideways trend. However, within this consolidation phase, the coin price narrowing within two converging trendlines indicates the formation of a symmetrical triangle.\n\nAs for now, the LINK price trades at $7.756 and retests the overhead resistance trendline of the chart pattern. A potential breakout from the aforementioned trendline with a weekly candle closing above offers an early sign of trend reversal.\n\nThis breakout could assist buyers to escape this consolidation phase and chase the $12 high.\n\nAlso Read: Top Crypto Copy Trading Platforms For 2023\n\nUniswap (UNI)\n\nSource- Tradingview\n\nIn the weekly time frame chart, the UNI/USD pair shows a simple structure of a symmetrical triangle pattern where the prices are getting squeezed with two converging trendlines. With the recent growth in the crypto market, the coin price has recently rebounded from the support trendline indicating a bull cycle with the chart pattern.\n\nCurrently, the UNI price trades at $6.3, and with sustained buyers, the price will rise 10% to challenge the overhead trendline. If the buyers manage to pierce the resistance trendline, the accelerated buying pressure would drive the coin 88% higher to hit the $13 mark."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9lb3MtZXZtLXRvLWFsbG93LWludGVyb3BlcmFiaWxpdHktYWNyb3NzLWV0aGVyZXVtLWVvc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "EOS EVM to allow interoperability across Ethereum, EOS - Cointelegraph",
        "content": "The EOS Network Foundation (ENF) has announced the beta launch of the EOS EVM mainnet, which aims to improve interoperability between two blockchain ecosystems, Ethereum and EOS.\n\nEOS EVM emulates the Ethereum Virtual Machine (EVM) and allows for the deployment of decentralized applications (DApps) written in Solidity, the programming language used by the vast majority of web3 developers.\n\nLaunching April 14th: The next generation of EVMs is almost here.\n\n\n\nAt 800+ swaps per second, $EOS EVM is BY FAR the most performant EVM, benchmarked at 25x faster than Avax and 3x faster than Solana.\n\n\n\nIf you’re a Solidity dev or interested in EVM's, this thread is for you:\n\npic.twitter.com/McL4616nPa — Yves La Rose (@BigBeardSamurai) April 10, 2023\n\nThe ENF team said that Ethereum's scalability issues create challenges for mass-scale DApp deployment. The launch of EOS EVM aims to bridge this gap. The team is planning to do this by combining the resources of the Ethereum community with the performance of the EOS Network offers.\n\nYves La Rose, the founder and CEO of the EOS Network Foundation, said that this was a very important milestone for the network and paves the way for an interoperable future. “EOS EVM is a significant milestone and represents our commitment to a multi-chain future,” La Rose explained.\n\nLa Rose also said that this allows developers to have access to lower fees and faster transactions of the EOS network offers.\n\nRelated: When levees break, liquidity flows — Analyzing Ethereum Shapella and liquidity staking derivatives\n\nAs the Ethereum network expects more adoption after the most recent Shapella upgrade, projects have been prioritizing the implementation of EVM compatibility within their networks. On April 3, Astar Network launched smart contracts that supported two virtual machines, including EVM and the WebAssembly Virtual Machine. Astar Network founder Sota Watanabe said that this would allow the creation of new multichain applications within their network.\n\nMeanwhile, the beta version of Polygon’s zkEVM, a zero-knowledge rollup scaling solution, was released on March 27. This technology mimics the transaction execution environment of the Ethereum mainnet. According to Polygon, this will allow DApps to scale with higher performance.\n\nMagazine: ‘Account abstraction’ supercharges Ethereum wallets: Dummies guide"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNC8xNS9jcnlwdG8tdHJhZGVyLXNheXMtZXRoZXJldW0tYWx0Y29pbi10aGF0cy1leHBsb2RlZC0xOTAtdGhpcy15ZWFyLWFib3V0LXRvLWhpdC1uZXctYWxsLXRpbWUtaGlnaC_SAYUBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDQvMTUvY3J5cHRvLXRyYWRlci1zYXlzLWV0aGVyZXVtLWFsdGNvaW4tdGhhdHMtZXhwbG9kZWQtMTkwLXRoaXMteWVhci1hYm91dC10by1oaXQtbmV3LWFsbC10aW1lLWhpZ2gvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Apr 2023 07:00:00 GMT",
        "title": "Crypto Trader Says Ethereum Altcoin That’s Exploded 190% This Year Is About To Hit New All-Time High - The Daily Hodl",
        "content": "A widely followed crypto analyst says that an Ethereum-based (ETH) altcoin looks set to hit new all-time highs after rising 190% in 2023.\n\nPseudonymous trader Smart Contracter tells his 222,300 Twitter followers that layer-2 scaling solution Optimism (OP) will likely end up making all-time highs after breaking out from weeks of consolidation inside an ascending triangle pattern.\n\n“Beautiful ascending triangle breakout on OP after weeks of sideways/accumulation.\n\nAlso like how all the moves down from the highs are corrective three-wave moves.\n\nI think this one ends up making all-time highs.”\n\nOP is trading for $2.64 at time of writing, an 8.16% gain on the day and about a 190% increase since the start of the year.\n\nThe crypto strategist then turns his sights on the peer-to-peer payments network Litecoin (LTC).\n\nSmart Contracter says that he missed out on the opportunity to capitalize on the latest Bitcoin (BTC) rally because he made an error and sold during a period of low volatility, but now he’s looking to accumulate Litecoin as he believes the altcoin is flashing a bullish signal against the crypto king (LTC/BTC).\n\n“Missed this most recent BTC impulse as I got shook out during low [volatility] Easter break (rookie mistake). Now looking to chase alts with good BTC pair setups, and I think LTC is one of them. I think LTC/BTC is very close to a reversal and higher low on daily.”\n\nThe LTC/BTC pair is currently trading at 0.003148 ($95.64).\n\nSmart Contracter then turns his attention toward the leading smart contract platform Ethereum. According to the trader, the fear surrounding the platform’s new Shanghai update, which now allows users to withdraw their staked ETH, is not warranted. He also believes the top altcoin is flashing vibes of Bitcoin’s price action in 2019 when the crypto king surged by about 300% in a few months.\n\n“Still think people are completely overreacting about the ETH Shanghai unlock and all I’m getting is 2019 vibes.”\n\nETH is trading for $2,095 at time of writing, a nearly 1.5% decrease during the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney\n\nShutterstock/Sensvector"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vZGVjcnlwdC5jby8xMzY3NTEvaGFja2VyLXJvYnMtYml0cnVlLTIzbS1ldGhlcmV1bS1zaGliLWFzc2V0c9IBS2h0dHBzOi8vZGVjcnlwdC5jby8xMzY3NTEvaGFja2VyLXJvYnMtYml0cnVlLTIzbS1ldGhlcmV1bS1zaGliLWFzc2V0cz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Hacker Robs Crypto Exchange Bitrue of $23M in Ethereum, SHIB, Other Assets - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCrypto exchange Bitrue announced this morning that it had identified an exploit in one of its hot wallets.\n\nThe attacker was able to withdraw assets valued at approximately $23 million in Ethereum (ETH), Quatn (QNT), GALA, Shiba Inu (SHIB), Holo (HOT), and Polygon (MATIC).\n\nHot wallets are a type of crypto wallet used to store cryptocurrencies that are connected to the internet and easily accessible. These are, however, more vulnerable to cyberattacks and theft than cold wallets, which are not connected to the internet.\n\nAD\n\nAD\n\nAccording to blockchain security firm PeckShield, the attacker swapped 173,000 QNT, 22.55 billion SHIB, 46.4 million GALA, and 310,000 MATIC for ~8,540 ETH and withdrew to this Ethereum address. The address currently holds $3.2 million worth mainly in SHIB and HOT.\n\nBitrue reported that the affected hot wallet only held less than 5% of the exchange's overall funds. They have suspended withdrawals from the exchange until April 18.\n\nIn 2019, the exchange suffered another attack where around $5 million worth of Ripple (XRP) and Cardano (ADA) tokens were drained from Bitrue due to a vulnerability in their internal review processes, allowing attackers to gain access to customer accounts."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9tb3ZpbmctYmV5b25kLXRoZS1ibG9ja2NoYWluLXRyaWxlbW1hLWwxLXZzLWwy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Moving beyond the blockchain trilemma: L1 vs. L2 - Cointelegraph",
        "content": "As of February 2023, over 44.15 million unique addresses have a non-zero balance of Bitcoin (BTC). While this may seem impressive, let’s face it — blockchain technology has come a long way since Bitcoin’s inception in 2009.\n\nBitcoin addresses with a non-zero balance. Source: Glassnode\n\nHowever, as the technology continues to evolve and gain mainstream adoption, scalability remains one of the biggest challenges facing the industry. Bitcoin and Ethereum, two of the largest blockchain networks, are highly decentralized, with thousands of nodes operating on each network (17,553 nodes for Bitcoin and 7,099 nodes for Ethereum as of April 14, 2023).\n\nEthereum mainnet statistics. Source: Ethernodes\n\nWhile this decentralization provides greater security, it also results in slower transaction speeds and scalability issues due to the significant computational resources required to maintain the continuously growing sum of nodes.\n\nHence, the blockchain trilemma, coined by Vitalik Buterin, suggests that blockchains can only have two out of three properties: scalability, security and decentralization. As a result, this fundamental trade-off represents a significant barrier to the widespread adoption of blockchain technology.\n\nThere are two primary strategies that have been introduced to tackle the scalability challenge: layer-1 (L1) and layer-2 (L2) solutions. While L1 solutions seek to optimize the base layer of a blockchain, L2 solutions provide an additional layer on top of the base layer to facilitate faster and more affordable transactions. Needless to say, this has sparked an ongoing battle between the two approaches as each demonstrates unique strengths and weaknesses.\n\nLayer-1 blockchains\n\nLayer-1 blockchains, such as Bitcoin and Ethereum, are designed to optimize the foundational layer of a blockchain protocol to increase transaction throughput and reduce fees. Their maximum capacity is often limited by network congestion and other factors, so L1 scaling solutions directly extend the blockchain protocol to improve scalability.\n\nA prominent example of this is the introduction of Ethereum 2.0 and the subsequent development of (dank) sharding. Sharding aims to increase Ethereum’s transaction processing speed and reduce fees by splitting the network into smaller, more manageable shards. Each shard can then process transactions in parallel, significantly increasing the network’s overall speed.\n\nLayer-2 blockchains\n\nLayer-2 blockchains, on the other hand, refer to a network or technology that operates on top of an underlying blockchain protocol with the aim to improve scalability too. The idea behind L2s is to shift transactions from the base layer blockchain to an adjacent system architecture that is able to process the majority of the data and then report back to the base blockchain to finalize the result.\n\nFor instance, Ethereum is a layer-1 network, and a number of layer-2 solutions have been built to improve transaction speeds on the Ethereum network, including Polygon (MATIC), Optimism (OP) and Arbitrum (ARB).\n\nThe battle\n\nUndoubtedly, the scalability battle has come to the forefront with recent developments in L1 and L2 blockchains. While this may be the case, understanding the differences between L1 and L2 blockchain networks is crucial to gain insight and distinguish the primary differences between both layers.\n\nArchitecture\n\nLayer-1 blockchains and layer-2 scaling solutions differ not only in their purpose but also in their fundamental design and architecture. L1 blockchains are designed to be self-sufficient, meaning that all the necessary layers for data availability, consensus, and execution are integrated into a single system. This design is intended to provide the security, decentralization, and immutability, that are the hallmarks of blockchain technology.\n\nIn contrast, layer-2 scaling solutions are designed to enhance the performance of L1 blockchains rather than operate as independent blockchains. Layer-2 scaling solutions use off-chain techniques such as state channels, nested blockchains, rollups and sidechains to process transactions faster and more efficiently. In this way, layer-2 scaling solutions can increase the transaction throughput of L1 blockchains without compromising their security and decentralization.\n\nScalability method\n\nAnother significant difference between L1 and L2 scaling solutions lies in their scalability methods. L1 blockchains depend on various techniques such as consensus mechanism changes, chain forking and sharding to boost their transaction throughput. While these methods can improve transaction speeds, they can also lead to network congestion, security risks and fragmentation. L2 scaling solutions, on the other hand, process transactions off-chain, allowing for increased speed and efficiency while still relying on the primary network for security and decentralization. This approach reduces the risk of network congestion, minimizes fragmentation and enhances the overall performance of the blockchain ecosystem.\n\nNakamoto coefficient — the main measure of decentralization\n\nThe Nakamoto coefficient is an important metric to consider when evaluating the level of decentralization in a blockchain network. It is crucial to consider the trade-off between scalability and decentralization when measuring up the difference between L1 and L2 solutions.\n\nOften, L1 solutions such as Near protocol (NEAR) or Solana (SOL) have a higher coefficient because they offer a high degree of decentralization due to their reliance on a large number of validators. On the other hand, L2 solutions such as Opside or zkSync could offer improved scalability through the use of off-chain processing, but in turn, would be less decentralized due to their reliance on a smaller set of validators.\n\nThe bottom line\n\nThe ongoing battle between L1 and L2 solutions has its fair share of pros and cons. While L1 blockchains offer superior security and decentralization, they suffer from scalability issues. In contrast, L2 solutions offer scalability and lower fees, but may come at the cost of compromising the security and decentralization of the underlying blockchain.\n\nEvidently, L2 solutions are not a “one-size-fits-all” solution to the scalability challenge. They rely on the base layer’s security and decentralization, and if the base is compromised, it could affect the very foundation of the layer-2 solutions in question.\n\nNeedless to say, as blockchain technology continues to mature, the outcome of this showdown will likely determine the path forward for scaling the technology to meet the demands of real-world applications. In the meantime, it is vital for both L1 and L2 solutions to work together to effectively address the scalability challenge.\n\nDigi516 has been a crypto researcher and NFT enthusiast for almost a decade, with experience in educating and managing several crypto communities. Now, as head of community lead at XGo, Digi516 is on a mission to onboard the next 100 million users to Web3 and empower sovereign financial freedom."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY3J5cHRvdGlja2VyLmlvL2VuL2JpdGNvaW4tZXRoZXJldW0tYW5kLXhycC1wcmljZS1hbmFseXNpcy1mb3ItYXByaWwtMTUtMjAyMy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin, Ethereum and XRP Price Analysis for April 15, 2023 - CryptoTicker.io - Bitcoin Price, Ethereum Price & Crypto News",
        "content": "Welcome to our latest cryptocurrency price analysis for April 15, 2023, where we take a closer look at Bitcoin, Ethereum, and XRP. As the cryptocurrency market continues to evolve and mature, it’s important to keep a close eye on the latest trends and developments. In this article, we will provide an in-depth analysis of the price movements of these three major cryptocurrencies, and discuss what the future may hold. Will crypto prices continue to rise? Or will we witness a short-term price adjustment?\n\nBitcoin Price Analysis for April 15, 2023\n\nBitcoin prices managed to start a renewed uptrend as prices bounced from the support price of $19,700. From there, Bitcoin prices increased by more than 50% in 1 month. Today, we see how the $31,000 price consists of a short-term resistance, sending prices slightly lower. We anticipate that prices will continue to retrace lower and enter the price zone between $28,000 and $29,000. However, prices should be able to rise back again and breach the 31K resistance.\n\nEthereum Price Analysis for April 15, 2023\n\nEthereum’s chart looks very similar to Bitcoin’s. This is no coincidence as Bitcoin’s dominance in the crypto market rose back to 46%. This means that the price movement of Bitcoin influences other altcoins when its prices move either way. Ethereum price reached the high price of $2,115 and is looking to either consolidate or retrace lower. After a rise in prices from $1,850, ETH should retrace as part of a breather. We expect a similar price action as Bitcoin’s, where ETH adjusts towards $1,950 briefly before continuing higher.\n\nXRP Price Analysis for April 15, 2023\n\nXRP prices started to rise after consolidating on the support price of $0.36 after lagging for quite a while. After extended consolidation, XRP prices shot high and increased by more than 60% within 2 weeks. XRP established a new support price at $0.50 and is on a new uptrend. From the current $0.52, XRP should be able to reach the psychological price of $0.60 and make 14%.\n\n\n\n\n\nYou might also like\n\nMore from Altcoin"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vZG9tYWlubmFtZXdpcmUuY29tLzIwMjMvMDQvMTUvZW5zLWFza3MtY291cnQtdG8tdHJhbnNmZXItZXRoLWxpbmstYWZ0ZXItZG5zLWFidXNlLWNvbXBsYWludC10YWtlcy1zaXRlLWRvd24v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Apr 2023 07:00:00 GMT",
        "title": "ENS asks court to transfer eth.link after DNS abuse complaint takes site down - Domain Name Wire",
        "content": "Group wants to transfer domain away from registrar it’s in litigation with.\n\nEthereum Name Service (ENS), the entity behind blockchain-based .eth domain names, is asking a court (pdf) to allow it to transfer eth.link to a different registrar.\n\nENS and Virgil Griffith sued Dynadot in September 2022 after the registrar sold the domain for $852,000 in an expired domain name auction. Griffith is in jail for helping North Korea evade sanctions and could not renew the domain.\n\nThe court issued a preliminary injunction in ENS’ favor that ordered the domain to be transferred to the plaintiffs pending the outcome of the case.\n\nDynadot transferred the domain to the plaintiffs but put a transfer lock on it to prevent it from being transferred to another registrar.\n\nENS didn’t complain about the lock until a DNS abuse took eth.link down at the end of March. Dynadot temporarily removed the nameservers for the domain upon receipt of the complaint but restored them hours later.\n\nConcerned that Dynadot could take the site down again, ENS is asking the court to allow it to move the domain to another domain name registrar."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMinAFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2NyeXB0by90b2tlbi9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi10cmFkZXMtbmVhci0zMWstZXRoZXJldW0tc3VyZ2VzLTEwLXRvLWhpdC0yMTAwLWRvZ2Vjb2luLWdhaW5zLTgtMzc3MzY1LTIwMjMtMDQtMTTSAaABaHR0cHM6Ly93d3cuYnVzaW5lc3N0b2RheS5pbi9hbXAvY3J5cHRvL3Rva2VuL3N0b3J5L2NyeXB0by1wcmljZS10b2RheS1iaXRjb2luLXRyYWRlcy1uZWFyLTMxay1ldGhlcmV1bS1zdXJnZXMtMTAtdG8taGl0LTIxMDAtZG9nZWNvaW4tZ2FpbnMtOC0zNzczNjUtMjAyMy0wNC0xNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin trades near $31k; Ethereum surges 10% to hit $2,100, Dogecoin gains 8% - Business Today",
        "content": "Bitcoin and other crypto tokens were trading with big gains on Friday as the moderately paced momentum continued. Crypto market observers expecting post-Shapella selling pressure to send Ether's price plunging slogged through a day of disappointment.\n\n\n\nBitcoin marched towards the $31,000 mark as the largest crypto token was trading 2 per cent higher. Its largest peer, Ethereum, outperformed with a big margin as it soared more than 10 per cent to hit the $2,1000 mark in the last 24 hours.\n\n\n\nETH is trading sharply higher despite some fearing a massive dump after the Shapella upgrade. As expected, liquid staking protocols are in the green. Bitcoin rose to chase the $31,000-mark, The crypto fear and greed index have jumped 7 points to regain the scoring for 68, hinting towards increasing investor confidence, said Parth Chaturvedi, Crypto Ecosystem Lead at CoinSwitch\n\n\n\n\"In other news, Twitter has partnered with eToro to allow users to buy and sell stocks, crypto, and other assets. This could spur retail investments as newer avenues come into play. The development indicates that traditional finance players are increasingly entering the crypto market,\" he said.\n\n\n\nAll top crypto tokens were trading with big gains on Friday. After Ethereum, Dogecoin zoomed 8 per cent, whereas Cardano and Polygon surged 7 per cent each. Polkadot gained 6 per cent, whereas Litecoin was up 5 per cent during the early trading hours.\n\n\n\nThe global cryptocurrency market cap was trading sharply higher, around $1.28 trillion, rising as much as 4 per cent in the last 24 hours. However, the total trading volumes gained almost 16 per cent to $53.48 billion.\n\n\n\nOn Thursday, Bitcoin was trading around $30,750, while Ethereum was around $2,100. The Shapell upgrade marked Ethereum's transition from PoW to a PoS consensus mechanism. Some market watchers were unsure of ETH's price response, said Sathvik Vishwanath, Co-Founder & CEO at Unocoin.\n\n\n\n\"The token prices of several liquid staking derivatives rose, including LDO Lido DAO, RPL Rocket Pool and SD Stader. Arbitrum Ethereum Scaling System ARB token was one of the best-performing digital assets of the day. In addition, Uniswap on Thursday announced a mobile wallet app that includes support for Arbitrum,\" he said.\n\nBlockchain app factory, an enterprise blockchain technology solutions provider has entered into a strategic partnership with bitsCrunch, a forensic and AI-powered NFT analytics firm.\n\nThe symbiotic association between the two leading brands will leverage the combined power of their technologies to empower users with forensics and AI-powered real-time analytics. The strategic alliance is aimed at making NFT trading a highly informed decision for users across the globe.\n\n\n\nNote: Price change in last 24 hours\n\n\n\n\n\nTech View By Giottus Crypto Platform\n\nFor the past month, Ethereum (ETH) has been bouncing between the 0.38 fib level at $1,912 and a descending trendline that's been hanging around for over a year. This week, ETH busted through that resistance and skyrocketed past the crucial $2,000 mark.\n\n\n\nWith the $2,000 level acting as solid support and the next fib target of $2,230 in sight, things are looking good for the asset. A continued rally can potentially propel it toward the golden pocket near $2,500 if the trend continues.\n\nETH's 50 and 200-day moving averages (at $1,728 and $1,471, respectively) are a sign that ETH could be overbought. If the bears succeed to drag down ETH below $2,000 again, they should set their sights on the $1,728 mark to follow up, with the ascending trendline being their next hurdle.\n\n\n\nMajor Levels\n\nResistance: $2,230, $2,500, $2,661\n\nSupport: $2,000, $1,912, $1,728\n\n\n\n\n\n(Views and recommendations given in this section are the analysts' own and do not represent those of Business Today. Please consult your financial adviser before taking any position in the asset/s mentioned.)"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vdS50b2RheS90aW0tYmVpa28tc2hhcGVsbGEtcmVtb3Zlcy1yaXNrLWludml0ZXMtbW9yZS1ldGhlcmV1bS1zdGFraW5n0gFRaHR0cHM6Ly91LnRvZGF5L3RpbS1iZWlrby1zaGFwZWxsYS1yZW1vdmVzLXJpc2staW52aXRlcy1tb3JlLWV0aGVyZXVtLXN0YWtpbmc_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Tim Beiko: Shapella Removes Risk, Invites More Ethereum Staking - U.Today",
        "content": "During his recent appearance on Laura Shin's \"Unchained\" podcast, Tim Beiko discussed the impact of Ethereum's Shapella upgrade on the network's decentralization and validator staking.\n\nAdvertisement\n\nBeiko highlighted that the upgrade significantly \"de-risks\" staking for Ethereum since validators can now withdraw their stakes from the Beacon chain.\n\nThis development not only proves that withdrawals are possible but also reduces the commitment validators have to make, allowing them to try staking with more confidence and ease.\n\nBeiko went on to explain how the Shapella upgrade may encourage a reshuffling of staking providers. Validators may choose to move from centralized exchanges to liquid staking projects or try out solo staking since the ease of withdrawal reduces potential risks.\n\nThe upgrade also allows validators to accrue rewards directly on their validators, which were previously inaccessible on the Beacon chain.\n\nFurthermore, Beiko expressed hope that the upgrade would lead to more solo stakers joining the network. With improved guides and support for setting up validators, the Shapella upgrade has made the process more approachable for users who may have been hesitant to stake before.\n\nThe Ethereum network's concept of coordinated penalties also encourages decentralization as the penalties for issues with centralized services, such as AWS, would be greater than if the validators were more distributed.\n\nThe developer believes that the Shapella upgrade has the potential to invite more staking and promote decentralization within the Ethereum network. By enabling withdrawals, reducing commitment and facilitating a shift from centralized exchanges to liquid staking projects and solo staking, the upgrade paves the way for a more secure and decentralized future for Ethereum."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vZGVjcnlwdC5jby9uZXdzLWV4cGxvcmVyP3Bpbm5lZD0xNDg5NDkmdGl0bGU9ZXRoZXJldW0tcHJpY2Utc3VyZ2VzLWFmdGVyLXNoYW5naGFpLWhhcmQtZm9yay1oaXR0aW5nLTExLW1vbnRoLWhpZ2jSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 10:57:12 GMT",
        "title": "News Explorer — Ethereum Price Surges After Shanghai Hard Fork, Hitting 11-Month High - Decrypt",
        "content": "Apr 14, 9:09 am\n\nDecrypt\n\nEthereum Price Surges After Shanghai Hard Fork, Hitting 11-Month High\n\nEthereum (ETH) is experiencing a surge in price, jumping 7% in the past day and reaching an eleven-month high of $2,123.35. This is likely due to the successful completion of the Shanghai hard fork, which allows investors to stake coins on the Ethereum mainnet and withdraw previously staked funds. Onchain data shows that a total of 277,046 ETH ($58.5 million) has been withdrawn since the upgrade."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vYW1iY3J5cHRvLmNvbS93aWxsLWV0aC13aXRuZXNzLWEtcHJpY2UtY29ycmVjdGlvbi10aGVzZS11cGRhdGVzLW1heS1sZWFkLXlvdS10by1iZWxpZXZlLXRoYXQv0gFpaHR0cHM6Ly9hbWJjcnlwdG8uY29tL3dpbGwtZXRoLXdpdG5lc3MtYS1wcmljZS1jb3JyZWN0aW9uLXRoZXNlLXVwZGF0ZXMtbWF5LWxlYWQteW91LXRvLWJlbGlldmUtdGhhdC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Will ETH witness a price correction? These updates may lead you to believe that… - AMBCrypto News",
        "content": "ETH demand soars on both the spot and derivatives market after a successful upgrade.\n\nAssessing the prospects of a retracement as some ETH whales take profit.\n\nMore than 24 hours have passed since the Ethereum [ETH] network successfully deployed the Shanghai upgrade. The hype around the upgrade will rapidly die down but what does this mean for ETH?\n\nMajor blockchain networks have historically been characterized by a strong bull run for their native cryptocurrencies. A resurgence of sell pressure tends to follow during or after the upgrade. Will that be the same case for ETH now that the highly anticipated Shanghai upgrade has been launched?\n\nIs your portfolio green? Check out the Ethereum Profit Calculator\n\nInitial responses post the upgrade have been positive, especially from the derivatives market. Glassnode recently revealed that ETH open interest perpetual contracts soared to a two-year high on OKex in the last 24 hours. They were up to a 15-month high on rival exchange ByBit.\n\n? #Ethereum $ETH Open Interest in Perpetual Futures Contracts just reached a 2-year high of $1,126,441,832.21 on #Okex Previous 2-year high of $1,107,993,160.84 was observed on 08 February 2023 View metric:https://t.co/L43VVP6PlY pic.twitter.com/QbEqt6yPlO — glassnode alerts (@glassnodealerts) April 13, 2023\n\nThe bulk of the open interest flooded into the market between 11 and 13 April. This means the demand started flowing in just before the merge. ETH’s funding rate was at its highest level in the last four week at press time.\n\nStrong demand fuel’s ETH rally above $2,000\n\nThe derivatives demand surge confirmed a clear and strong response from investors. Such an outcome is often characterized by a more price volatility and that has been the case with ETH.\n\nThe derivatives market demand coupled with strong spot performance triggered favored ETH bulls because it finally rocketed above the highly coveted $2,000 price level. ETH exchanged hands at $2009 at press time.\n\nCan ETH bulls maintain the momentum and sustain prices above $2,000? If the outcome will be consistent with historic observations, the latest ETH rally will likely be followed by strong sell pressure. Multiple signals already point towards such an outcome. For example, ETH, at the time of writing, was overbought according to the RSI.\n\nETH exchange flows are the next noteworthy signal courtesy of the recent pivot in flows. It suggested that buying volumes post upgrade might already be slowing down. Despite this, the latest exchange flows revealed that outflows outweighed exchange inflows by a significant margin.\n\nAn opportunity for short sellers?\n\nSome whales are already selling as indicated by ETH’s supply distribution. Addresses in the 10,000 to 100,000 ETH and 1 million to 10 million range offloaded some ETH in the last 24 hours.\n\nMost of the other whale categories were still buying during the same period. The same accumulating whale categories had a larger share of the circulating supply, thus explaining why the price remained bullish.\n\nHow much are 1,10,100 ETHs worth today?\n\nShort sellers might also have a solid chance to secure some gains if more whales start taking profits. A shift in the tide in favor of the bears may trigger a cascading effect. This is because ETH’s latest rally was fueled by leverage.\n\nA price pivot will likely trigger leverage liquidations, forcing long traders to sell to cover losses. While a bearish retracement is on the cards, ETH traders should also watch out for an extended upside courtesy of the influx of market confidence."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA0LzE0L29seW1wdXMtZGFvLXZvdGVzLXRvLWJ1eS1tb3JlLWV0aC1mb3ItdHJlYXN1cnktYmFja2luZy1vaG0tdG9rZW4v0gFyaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDQvMTQvb2x5bXB1cy1kYW8tdm90ZXMtdG8tYnV5LW1vcmUtZXRoLWZvci10cmVhc3VyeS1iYWNraW5nLW9obS10b2tlbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Olympus DAO Votes to Buy More ETH for Treasury Backing OHM Token - CoinDesk",
        "content": "Relwyn said the treasury operations team “agrees” with community members’ bullishness, but cautioned the protocol can’t just YOLO everything into ETH without incurring a hearty dose of risk. Number may go up right now, but “number can go down, too,” said Relwyn,"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy91bmlzd2FwLXByb3Bvc2FsLXRvLWxhdW5jaC1vbi1wb2x5Z29uLXprZXZtLWlzLXNldC10by1wYXNz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Uniswap proposal to launch on Polygon zkEVM is set to pass - Cointelegraph",
        "content": "Decentralized exchange Uniswap is seemingly set to launch on the new zero-knowledge Ethereum Virtual Machine (zkEVM) roll-up solution from scaling solution provider Polygon.\n\nWhile Uniswap (UNI) tokenholders have until April 14 at 9:05 pm UTC to vote on the proposal to launch Uniswap v3 on the zkEVM, the 40 million vote threshold needed for the proposal to pass has already been reached, with over 42.4 million votes recorded in favor of the integration.\n\nAll 191 Ethereum addresses voted in favor of the proposal, with financial modeling platform Gauntlet and Ethereum infrastructure provider ConsenSys leading with over 7 million votes each, according to Tally, a voting dashboard for decentralized finance projects.\n\nTop votes in favor of integrating Uniswap v3 on Polygon zkEVM. Source: Tally\n\nThe author of the proposal, Polygon Business Development Lead Jack Melnick, argued that now is the “right moment” to make Uniswap v3 available on Polygon’s zkEVM because it is “EVM equivalent” — meaning that there is no need to recompile EVM smart contracts:\n\n“There’s significant value in Uniswap being available on an EVM compatible ZK rollup. Deploying early on zkEVM helps solidify Uniswap’s place as the number one DEX and a thought leader.”\n\nThe integration will also provide validation and fast finality for off-chain transactions, said Melnick.\n\nIn addition, the high level of adoption that Polygon has managed to harness makes integrating on Polygon’s zkEVM a “priority,” he explained.\n\nAs for what factors will make this deployment a boom or bust, Melnick pointed to several key on-chain metrics:\n\n“A successful zkEVM deployment will, in an organic and sustained manner, grow Uniswap’s Total Addressable Market across TVL, unique interacting wallet, volumes, and integration with partner dApps.”\n\n“As demand for zk-blockchains and proximity to Ethereum rises, users and builders will increasingly look to zkEVM solutions to build and trade,” he added.\n\nMelnick is confident the integration will pose “minimal risks” at least “relative” to other blockchains because the Polygon zkEVM uses zero-knowledge proofs to inherit Ethereum’s security.\n\nThe Polygon Bridge has been “disintermediated,” and data will be sourced from “reputable” oracle providers, Melnick added, which he expects will only strengthen security at the protocol level.\n\nPolygon’s zkEVM had its official mainnet launch on March 27.\n\nRelated: Uniswap’s first governance vote fails... Despite 98% support\n\nIn a similar move, Uniswap v3 integrated with the BNB Chain — a smart contract blockchain built by Binance — on March 15.\n\nThe governance vote wasn’t as stark though, with only 65% voting in favor of the proposal.\n\nUnited States venture capital firm Andreessen Horowitz (a16z) — the largest UNI token holder — voted against the BNB proposal with its 15 million UNI tokens.\n\nMagazine: ZK-rollups are ‘the endgame’ for scaling blockchains, Polygon Miden founder"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDQvMTUvY2Fub25zLWNhZGFicmEtam9pbnMtbmZ0LWNyYXplLXdpdGgtZXRoZXJldW0tcGhvdG8tbWFya2V0cGxhY2Uv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Apr 2023 07:00:00 GMT",
        "title": "Canon's Cadabra Joins NFT Craze with Ethereum Photo Marketplace - Crypto Times",
        "content": "As the photography business increases its footprint in the Web3 space, Canon USA is preparing to launch a brand-new NFT marketplace, “Cadabra,” focused on photography. Following a successful NFT drop in 2022, this is Canon’s first significant entry into the Web3 market.\n\nVarious kinds of tokenized photographs will be available on the Cadabra marketplace. Participating artists can sell tangible prints of their work, giving them new sources of income. Canon will fill orders for these prints, and the market will accept payments made with credit/debit cards and cryptocurrencies.\n\nThe Cadabra marketplace will offer initial drops of photo collections and a secondary resale market. Additionally, it makes priceless and one-of-a-kind digital artworks available to collectors.\n\nCanon will debut the marketplace later in 2023 after previewing it at the NFT NYC conference this week. The Cadabra marketplace will compete with Other photographic NFT marketplaces like Quantum Art and Sloika.\n\nBoth Isaac “Drift” Wright (“Where My Vans Go?”) and Justin Aversano (“Twin Flames”) have produced significant photo NFT collections which can help them get featured on Cadabra.\n\nThe photographers that Canon will showcase on the site are still a mystery. However, the corporation has promised various genres, such as landscapes, sports, animals, and lifestyle. The growth of NFTs has offered collectors access to rare and valuable digital artworks and new money streams for artists."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiK2h0dHBzOi8vdGhlZGVmaWFudC5pby9ldGhlcmZpLWRlcG9zaXRzLXJpc2XSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Liquid Staking Platform Ether.Fi Deposits Surge Ahead Of Launch - The Defiant - DeFi News",
        "content": "Non-custodial Liquid Staking Protocol Enters Crowded Sector\n\nBy: Aleksandar Gilbert • Loading...\n\nDeFi News\n\nA new entrant in the crowded liquid staking industry has grown quickly since its debut last month, buoyed by a simple promise: you can keep your coins.\n\nCrypto locked in Ether.Fi has grown to more than $37M since it began accepting deposits ahead of its launch on Ethereum mainnet on March 4. Like other liquid staking protocols, it attempts to solve a dilemma posed by Ethereum’s security model.\n\n“Ether.Fi offers truly decentralized staking,” the company boasts on its website. “The staker, not the node operator, owns all the keys.”\n\nIn an interview with crypto data company Token Terminal this week, CEO Mike Silagadze said custodial staking “just seemed like it didn’t meet the risk/reward ratio, where you’re getting your 5% yield, but you’re losing custody of your ETH.”\n\nInstitutional Investors\n\nInstitutional investors are especially wary of taking that risk, Silagadze told The Defiant. He is betting that his non-custodial product will draw institutional money, which has largely sat on the sidelines since Ethereum enabled staking more than two years ago.\n\nEthereum, like other Proof-of-Stake blockchains, relies on users who are willing to lock up, or stake, their ETH in order to validate transactions. While ETH staked directly in the Beacon Chain comes with a modest annual yield, it cannot be used in more lucrative DeFi protocols.\n\nLiquid staking protocols address this dilemma by staking ETH on users’ behalf, batching deposits and handing them off to so-called “node operators” who run the hardware and software combination required to secure the Ethereum network.\n\nBut liquid staking protocols are custodial services, a potential liability in an industry where people are loathe to relinquish control of their assets. Ether.Fi claims to have built a protocol that should make everyone happy.\n\nNon-custodial Staking\n\nEther.Fi was originally a hedge fund, with plans of staking Ether on customers’ behalf and using DeFi strategies to boost that yield.\n\nDeFi Alpha Premium Content DeFi Daily | Weekdays\n\nDeFi Alpha Letter | Weekly\n\nDefiant Podcast Transcript | Weekly\n\nInbox Dump | Saturday\n\nWeekly Recap | Sunday Looking for Alpha? Become a premium member of The Defiant and join our DeFi Alpha community. Start for free\n\n“In investigating what options were available for staking, we very quickly reached the conclusion that we weren’t comfortable using any of them, for a number of reasons,” Silagadze told Token Terminal. “One, they were either fully custodial or semi-custodial.”\n\nThe company pivoted to build the staking service it wished it had at its disposal.\n\nUsers retain custody of their Ether by generating mnemonic withdrawal credentials and validator keys.\n\n“With other protocols, this key generation is performed on a centralized server by the node operator,” according to Ether.Fi. “Via the ether.fi protocol, the staker then shares an encrypted copy of the validator key with the node operator (required for validation duties).”\n\n“Early Adopter”\n\nIt’s off to a promising start. As of Friday, more than 14,000 wallets had deposited ETH in the protocol’s “early adopter” smart contract. And deposits have picked up since Wednesday, when Ethereum’s developers upgraded the blockchain to allow for the withdrawal of staked ETH.\n\nSilagadze told Token Terminal he expected the first $20M to $30M in TVL to come from the institutional investors who had been with the company since its hedge fund days.\n\nThat hasn’t been the case.\n\nOf the $37M, about $1.4M has come from those investors, Silagadze told The Defiant. The remainder has come from retail investors, with average deposits at 0.2 ETH – stakers can deposit any amount, not the 32 ETH increments required when running a node.\n\n“To be frank, we were kind of surprised at the uptake,” he said.\n\nFierce Competition\n\nThe company closed a $5M funding round in February. Investors include North Island Ventures, Chapter One, Node Capital, and controversial crypto investor Arthur Hayes.\n\nBut Ether.Fi faces a tough road ahead. The competition is fierce and entrenched. Ether.Fi’s $37M in deposits represents a rounding error in the $19B staking industry. Lido, the industry leader, accounts for almost two-thirds of that figure.\n\nThe company plans on taking a snapshot of its users as of April 30, three days after it debuts on Ethereum mainnet. Early depositors are awarded bonus points that will allow them to get boosted staking rewards “and other benefits” when the protocol moves to mainnet at the end of the month, according to Silagadze.\n\nHowever, he insists no protocol token is in the works, and that the snapshot has nothing to do with a token airdrop.\n\n[ UPDATE: Article updated April 14 @ 7:40pm to correct the amounts of ETH stakers can deposit when using Ether.fi and the fact that deposits aren’t on test net]"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ibG9ja3NlYy1sYXVuY2hlcy1jb2xsYWJvcmF0aXZlLXRlc3RpbmctdG9vbGtpdC1mb3ItcHJpdmF0ZS1mb3JrZWQtY2hhaW5z0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Apr 2023 07:00:00 GMT",
        "title": "BlockSec launches collaborative testing toolkit for private forked chains - Cointelegraph",
        "content": "Blockchain security tech firm BlockSec has launched a new toolkit that enables collaborative testing on private chains “forked from arbitrary (transaction) positions” and block numbers on the Ethereum mainnet.\n\nThe developer and security researcher-focused toolkit is dubbed the “Phalcon Fork” and launched on April 14.\n\nWe're thrilled to introduce Phalcon Fork, a cutting-edge toolkit for Web3 developers & security researchers! It enables collaborative testing with private mainnet states, creating private chains forked from any mainnet position. #Web3 #DeFi pic.twitter.com/TlK169GeLP — BlockSec (@BlockSecTeam) April 14, 2023\n\nPhalcon Fork aims to provide greater control over work being conducted on testnets, such as transaction testing, analysis and debugging.\n\nIn the user manual, BlockSec touts that this extra control comes from being able to easily “fork arbitrary (transaction) positions and block numbers,” and retain certain “services and states” from the Ethereum mainnet.\n\n“Compared with traditional solutions like Goerli [...], Phalcon Fork has the following advantages: retain services and states from the mainnet, facilitating rapid integration and debugging with other DeFi contracts. [And maintain] full control over block information (e.g., Timestamp, BaseFee, MixDigest),” the Phalcon Fork user manual reads.\n\nWith the toolkit, users can also utilize features such as snapshots, enabling them to save certain blockchain positions and revert back to them at will during their testing processes. The snapshots essentially record the transactions being executed and deployed by the user at a given time.\n\n“The snapshot feature is particularly useful in the following two scenarios: When a user wants to run multiple times of a testing script, he/she just needs to revert to the original snapshot and rerun the script. [Or] When a user wants to save some states and return to them later, he/she can create a snapshot and then revert to this snapshot later,” the manual reads.\n\nPhalcon Fork also has an integrated faucet so users can acquire free fork network Ether (ETH) to conduct transactions on the private chains.\n\nTo directly interact with the chains and execute transactions, Phalcon Fork provides a remote procedure call node called Fork RPC, which can be integrated with Ethereum Virtual Machine-compatible development frameworks such as Hardhat, Foundry and Remix or added to MetaMask.\n\nAs it stands, users can only fork from the Ethereum mainnet; however, future support for additional blockchains, such as the BNB Smart Chain and Arbitrum, has been teased.\n\nTeased blockchain support additions. Source: Twitter\n\nApril has been a significant month for Ethereum developers, given that the highly anticipated Shapella hard fork went live on the Ethereum mainnet without a hitch on April 12. A major feature of the upgrade enables Ethereum validators to withdraw staked ETH from the Beacon Chain.\n\nRelated: Less than 1% of staked ETH estimated to be sold after Shapella: Finance Redefined\n\nThe move has been met with positive price action from Ether (ETH), with the asset gaining roughly 12% since April 12, to sit at $2,092 at the time of writing.\n\nSeven-day ETH price chart. Source: CoinGecko\n\nMagazine: ZK-rollups are ‘the endgame’ for scaling blockchains, Polygon Miden founder"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2JpZy1leWVzLWNvaW4tZXRoZXJldW0tYW5kLWJpdGNvaW4taXMtdGhpcy10aGUtYnVsbC1tYXJrZXQtaW52ZXN0b3JzLWhhdmUtYmVlbi13YWl0aW5nLWZvci_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Big Eyes Coin, Ethereum, and Bitcoin: Is This the Bull Market Investors Have Been Waiting for? - Analytics Insight",
        "content": "In the last ten years, the finance sector has seen the rise of digital currencies such as Bitcoin (BTC), Ethereum (ETH), and Big Eyes Coin (BIG). This development has had varying effects on the prices of traditional commodities like gold, silver, and other precious metals. It’s evident that the surge in digital assets has influenced the prices of gold and silver and vice versa. In the current year, both the prices of gold and silver and cryptocurrencies have been on the rise, prompting speculation among financial market enthusiasts about a potential bull market.\n\nAnticipating the Big Release of Big Eyes Coin\n\nBig Eyes Coin is a new cryptocurrency project that has attracted a significant following. The project aims to create a platform for artists and collectors to trade and invest in digital art. Big Eyes Coin’s community, known as the Cat Crew, is eagerly anticipating the bull run as gold and silver prices increase along with cryptocurrencies.\n\nWise investors who bought Big Eyes Coin during its early presale stages are celebrating the remarkable increase in its value over time. At stage 1 of the presale, each Big Eyes Coin was worth $0.0001, but as of stage 12, its value has risen to $0.00049, which represents a 390% increase. Investors who wait too long to invest in the token could miss out on opportunities as the price of the coin is set to increase with each presale stage. Therefore, it is crucial to invest early to maximize returns.\n\nMoreover, Big Eyes Coin is offering its bonus code BULLRUN250 for crypto fans and financial market enthusiasts who want to get an extra 250% on their next BIG purchase.\n\nBitcoin’s Soaring Price: Should You Consider Investing Now?\n\nBitcoin has a strong relationship with gold and silver, while its relationship with the stock market has weakened. Crypto analysts and financial market experts have observed this phenomenon as news of the banking crisis flooded the internet. BTC welcomed a new rally twice in the middle of March, and its price continues to climb.\n\nThis could be a good opportunity to invest in Bitcoin if investors are willing to hold onto BTC for several years. Token holders can also buy BTC in small sizes to avoid worrying about buying too high. However, investors must still remember that prices may continue to rise over time. As of the time of this writing, Bitcoin is valued at $28,480 and has seen a 1.44% increase in the last seven days.\n\nEthereum Breaks Through Resistance Level Barrier\n\nThe crypto market has seen a positive trend with Ethereum, the second-largest cryptocurrency by market capitalization, breaking the $1,900 resistance level for the first time in seven months. The cryptocurrency is currently trading above $1,910, which is an encouraging sign for Ethereum investors. ETH was last valued at this price on August 16th, 2022, during a crypto market downturn. This occurred as the United States Federal Reserve raised the Federal Funds rate in an attempt to combat inflation.\n\nIs a Bull Market Approaching? Consider Your Investment Opportunities Now\n\nThe bull market presents an exciting opportunity for investors looking to capitalize on the rising prices of crypto coins and positive market sentiment. This is the best time to invest in crypto as the upward trend is likely to continue. As the price of Ethereum continues to rise, it is expected to reach the next stop of $2,000. The upcoming Ethereum 2.0 upgrade, which aims to improve the network’s scalability, security, and energy efficiency, is expected to make Ethereum even more appealing to investors and developers.\n\nLooking for the next crypto to enhance your portfolio? Check out Big Eyes Coin today.\n\nVisit Big Eyes Coin’s (BIG) website and social media:\n\nPresale: https://buy.bigeyes.space/\n\nWebsite: https://bigeyes.space/\n\nTelegram: https://t.me/BIGEYESOFFICIAL\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZW4uZXRoZXJldW13b3JsZG5ld3MuY29tL2EtYmVnaW5uZXJzLWd1aWRlLXRvLWVpcC01NzI1LXRyYW5zZmVyYWJsZS12ZXN0aW5nLW5mdHMv0gFdaHR0cHM6Ly9lbi5ldGhlcmV1bXdvcmxkbmV3cy5jb20vYS1iZWdpbm5lcnMtZ3VpZGUtdG8tZWlwLTU3MjUtdHJhbnNmZXJhYmxlLXZlc3RpbmctbmZ0cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "A Beginner’s Guide to EIP-5725: Transferable Vesting NFTs - Ethereum World News",
        "content": "Since the launch of the ERC-721 standard for non-fungible tokens in 2018, the crypto world has seen NFTs evolve in ways that would have been difficult to imagine five years ago. New use cases and capabilities are fundamentally changing the way users interact with not only the NFTs themselves, but also with the projects and companies behind the NFTs.\n\nCore contributors to ApeSwap, a decentralized exchange and bonding protocol, and team members of Paladin, a blockchain security provider, collaborated to develop an extension to the ERC-721 standard that allows for exciting new functionality for NFTs. The EIP-5725: Transferable Vesting NFT standard is the result of careful consideration of what NFTs can and should be, as well as many rounds of real-world testing and iteration.\n\nWhat is EIP-5725?\n\nAn Ethereum Improvement Proposal, or EIP, is a document used to recommend and describe standards for the Ethereum community. There are multiple types of EIPs, but EIP-5725 is a ERC (Ethereum Requests for Comments) proposal, meaning that it affects application-level standards and specifications.\n\nThe EIP that ApeSwap and Paladin have worked together to create is called EIP-5725: Transferable Vesting NFT. This EIP provides an interface for transferable vesting NFTs which release underlying tokens over time.\n\nWhile time locks and vesting are both important mechanisms for controlling the distribution of ERC-20 tokens and have been around since the age of ICOs, the lack of standardization across the industry can be problematic. Without a standardized approach, it can be difficult for investors to understand how a particular token is being distributed and what the implications of that distribution might be.\n\nHow does EIP-5725 work?\n\nEIP-5725 allows for the implementation of a standard API for NFT based contracts to allow two primary functionalities: transferability, and vesting.\n\nProjects that implement EIP-5725 are able to use their NFTs to represent unvested tokens that belong to the holder of the NFT. In other words, this standard allows projects to either integrate with an existing NFT marketplace, or create their own, to be used as a secondary market for vesting tokens.\n\nAlso, using EIP-5725, projects can hold and represent the vested and locked properties of any underlying token (ERC-20 or otherwise) that is emitted to the NFT holder. This standard is an extension of the ERC-721 token that provides basic functionality for creating vesting NFTs, claiming the tokens and reading vesting curve properties.\n\nWhy is EIP-5725 important?\n\nEIP-5725 allows projects to implement several new capabilities to create value for users and projects:\n\nTransferability of vesting tokens: When using EIP-5725, vesting tokens are emitted to the holder of a transferable NFT, meaning that users can buy or sell the NFTs that represent unvested tokens. This secondary market offers users more flexibility around the underlying asset, as they can liquidate or trade it at any time. Custom NFT art capabilities: EIP-5725 also allows projects to create custom NFT art based on a variety of underlying inputs. For example, projects can choose to include a limited edition seal or color scheme on NFTs of particular significance or value, which can then become one of the considerations when valuing the NFT on a secondary market. Novel vesting curves: The vesting curves within EIP-5725 NFTs do not have to be linear — they are entirely customizable, and can have accelerating or decelerating vesting depending on the use case required by the project. Aggregated, holistic views of vesting tokens and properties: The standard EIP-5725 API enables projects to create holistic dashboards and reporting tools that aggregate the status of their vesting NFTs across entire chains, which can help the project make more informed strategic decisions about future releases and marketing efforts.\n\nHow are projects using EIP-5725 right now?\n\nApeSwap has used the EIP-5725 standard to create a category of products called ApeSwap Bonds. ApeSwap Bonds allow crypto projects to create transferable NFTs that users purchase with liquidity provider tokens. Holders of the NFTs then receive tokens at a discount, which is set by a variety of factors, linearly over the course of a vesting period set by the project.\n\nThis approach is superior to the traditional yield farming model in that the capital that a project puts forth as discounted tokens generates a return in the form of project-owned liquidity, as opposed to rented liquidity where reward tokens spent generate no return for the project.\n\nTo date, ApeSwap has created $1M worth of protocol-owned liquidity for itself and over $1.5M worth of liquidity owned by its partners through the sale of ApeSwap Bonds.\n\nWhy should users educate themselves on EIP-5725?\n\nApeSwap and Paladin are excited to promote the EIP-5725 standard to the crypto community at large to enable users to take advantage of the many opportunities that it creates. Users who are interested should learn more about ApeSwap Bonds in the documentation and stay tuned for new Bonds partners and capabilities launching soon.\n\nIf you have a favorite crypto project that might be a good fit for Bonds, have them reach out to ApeSwap.\n\nAdditionally, users and project contributors are encouraged to add to the ongoing discussion at the Ethereum Magicians forum."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZGFpbHljb2luLmNvbS90ZXN0bmV0cy1jcnlwdG8tdGVzdC1uZXR3b3Jrcy10by1lYXJuLWNyeXB0b2N1cnJlbmN5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Apr 2023 07:00:00 GMT",
        "title": "Testnets in Crypto: How To Use Test Networks to Earn Cryptocurrency - DailyCoin",
        "content": "Testnets are the unsung heroes of the crypto world. Every time a shiny new blockchain, cryptocurrency, or dApp goes live, it’s almost guaranteed that it has already existed for months on a test network.\n\nLike a shadowy vigilante, testnets expose hidden vulnerabilities and protect the cryptocurrency ecosystem. What many people don’t know about testnets is that there is a litany of benefits to using and exploring them, even if you’re not a developer.\n\nHow is something designed to be valueless so valuable?\n\nWhat are blockchain testnets? Why should everyone use them, and how can I get started?\n\nWhat are Testnets?\n\nA testnet is a valueless, low-risk sandbox environment similar to a main network. Blockchain engineers and smart contract developers use testnets to trial the functionality of their protocols and decentralized applications before deploying them on a mainnet or live blockchain.\n\nBecause a testnet is a separate ledger from its main network, all coins and tokens have no value. Regardless of the market price of Bitcoin (BTC), testnet bitcoin should always be worth $0. As a result, all transaction fees on a testnet are essentially free.\n\nThis is important for DeFi developers on networks like Ethereum (ETH), infamous for expensive gas fees. The Ethereum testnet enables developers to send thousands of transactions for free, which would normally cost tens of thousands of dollars.\n\nWhat Is the Purpose of Test Networks?\n\nThe main purpose of a testnet is to trail contracts and applications in a free environment. This helps developers ensure their applications run smoothly but also helps expose vulnerabilities and potential security issues.\n\nCybersecurity attacks in the crypto space are commonplace, with the on-chain world of DeFi and NFTs being particularly hazardous. White-hat hackers and security auditors use blockchain testnets to find potential faults before contracts get deployed on the mainnet, where an exploit could cost developers, and users like you and me, millions of dollars.\n\nThe cost of failure of a main network like Ethereum or XRP could be devastating. Hence, developers need a secure, valueless environment to make mistakes and break things safely before the public uses them.\n\nDo Testnet Coins Have Any Value?\n\nRemember when I said earlier that testnet coins have no value? The truth is, it’s not so black and white.\n\nDevelopers still need testnet coins, like Goerli Ethereum (gETH), to pay ‘transaction fees’ on the testnet. That means they still have some demand from developers testing decentralized applications.\n\nTestnet coins are collected from faucets, or free sites that ‘drip’ small amounts of test cryptocurrency into a testnet wallet. During periods of high demand, these faucets actually empty their supply of testnet coins, making them a hot commodity on the crypto market. For a brief moment, gETH was trading at over $1.\n\nIn February, a bridge opened between the Goerli Ethereum Testnet and the Ethereum Mainnet. Developers needing gETH can buy testnet Ethereum if the faucets are empty or unavailable.\n\nYou can’t trade gETH on a crypto exchange like Binance or Coinbase, but decentralized exchanges like UniSwap aren’t bound by the same restrictions as their centralized alternatives.\n\nThis was great news for developers and testnet faucet farmers who’ve been collecting gETH for free over time. In fact, one savvy player could even play a Cryptopunk NFT worth over $100,000 with gETH they accumulated for free.\n\nUltimately, testnet coins are intended to be free for everyone and have zero value on the market. That doesn’t mean that there is no demand and that testnet crypto is worthless.\n\nWhy You Should Use a Testnet, Even If You’re Not a Blockchain Developer\n\nEven if buying a Cryptopunk for free isn’t enough of an incentive, the non-developers out there might be thinking:\n\n‘That’s all very interesting, but what does that mean for me, a humble crypto enthusiast?’\n\nThere are plenty of benefits to using a testnet, even if you aren’t building dApps or designing blockchains. Many emerging crypto projects ask community members to trial products on a testnet in exchange for rewards, like token airdrops.\n\nFor example, the Aptos Incentivized Testnet gave anywhere between 150-300 APT tokens to selected users who operated a node validator or minted an NFT on their testnet. These tasks didn’t take long to complete, and participants could claim an airdrop worth over $5,000 at Aptos’ all-time high price.\n\nHow Do I Access A Testnet?\n\nThe good news is that accessing a blockchain testnet is easy. Metamask is a great open-source testnet wallet for any EVM (Ethereum Virtual Machine) network, like Polygon.\n\nAll you need to do is visit a trusted site like Chainlist and connect your wallet. Then, check the box to ‘Include Testnets’ and search for your chosen network, and the site will automatically configure your testnet account for you.\n\nWhich Blockchain Networks Have a Testnet?\n\nAlmost every blockchain in the cryptocurrency industry uses a testnet of some description. That includes leading Layer-1 networks like Solana and Cardano.\n\nSome networks, like Ethereum, have multiple different test networks for different areas of development. You must make sure you’re connecting to the right network for your specific testing requirements, or else you might run into some errors.\n\nOn the Flipside\n\nBlockchain testnets are an obscure area of the crypto industry. As a result, you may find the occasional scammer who will try and confuse you into sending your real crypto for valueless testnet coins.\n\nAs always, take extra care when exploring the possibilities of a blockchain testnet and never give anyone your crypto or seed phrase.\n\nWhy You Should Care\n\nEven if you’re not a developer, using a blockchain testnet can make you eligible for generous airdrops and give you a better understanding of how certain blockchains and decentralized applications work for free.\n\nFAQs"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vcm9sbGluZ3N0b25laW5kaWEuY29tL3RoZS13b25kZXJmdWwtd29ybGQtb2YtZXRoZXJldW0v0gE-aHR0cHM6Ly9yb2xsaW5nc3RvbmVpbmRpYS5jb20vdGhlLXdvbmRlcmZ1bC13b3JsZC1vZi1ldGhlcmV1bS8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Apr 2023 07:00:00 GMT",
        "title": "#CryptoExplained: The Wonderful World of Ethereum - Rolling Stone India",
        "content": "As Ethereum prepares for its latest upgrade, it’s a good time to look at the second biggest crypto currency by market cap after Bitcoin. In fact, the Ethereum Ecosystem as a whole is very likely more valuable than the Bitcoin ecosystem even though the currency is only second, because the vast majority of Financial Assets in crypto, exist on Ethereum. Tokens, NFT’s, DAO’s, decentralized exchanges and more, are all innovations that first took hold in the Ethereum ecosystem and have come to dominate the Crypto economy. In this series of articles, we will explore the Ethereum ecosystem and why it could become the base layer of trust on the internet.\n\nSo what exactly is Ethereum? Ethereum is a blockchain based decentralized system like bitcoin, and its native currency is called Eth. The Bitcoin network is very specialized and is primarily focused on being a decentralized method of exchanging value in the form of the Bitcoin token. Ethereum on the other hand is focused on being a world computer. This means that not only does it have the ability to transfer value, but it also allows the creation of smart contracts that are immutable and trustless. Smart contracts that are run by a decentralized computer form the basis of the wonderful world of ethereum.\n\nAny normal person would wonder why we need to run smart contracts on a decentralized network? We need this for the same reason we need transactions recorded by decentralized computers (see my article on Bitcoin). Trust.\n\nA smart contract is simply a set of instructions that a computer can understand. A smart contract that is stored and run by the Ethereum decentralized system means that it will run anywhere in the world, any time, by any one, exactly the way it was written. This is because the smart contract is checked by thousands of computers around the world to ensure that it has not been changed. This is different from a piece of code run on a centralized system that can be changed by the person running it without anyone knowing it.\n\nSo we can trust that a smart contract that was written to allocate assets in specific ways will always do that. For example, a Will written in the form of a smart contract will always transfer funds the way the writer intended. Imagine a Warren Buffet of the crypto world who wanted to make sure his wealth was transferred to charities on his death. Warren could write a smart contract that included the addresses of the charities and the amounts each would receive. He would publish it on the network. Once the contract detects that Warren has passed away, it automatically transfers the assets to these charities. No lawyers, no arbitration, and no family members tampering with the will.\n\nSmart contracts form the basis of most things we consider to be innovations in crypto. Tokens for example are created using the ERC-20 smart contract. This is a specific type of ethereum contract that specifies how the features of a token are to be constructed. This standard is the reason so many coins exist. The vast majority of ‘Crypto Currencies’ are actually ERC-20 tokens that run on Ethereum. This means that transactions with these currencies are recorded on the Ethereum blockchain and not a blockchain specific to the token. This also means that you can create your own crypto currency in less than 10 minutes. Try it out at https://docs.openzeppelin.com/contracts/4.x/wizard\n\nNFT’s, DAO’s, and decentralized exchanges also use smart contracts to operate. And thanks to these we have things like Crypto Kitties, Nouns DAO, Uniswap, and Crypto Punks. The wonderful world of ethereum has created innovations the world has never seen before that is turning finance, law, and value transfer on its head. And it is poised to continue to do so."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMikgFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC93aXRoLWJpdGNvaW4tYnRjLWFuZC1ldGhlcmV1bS1ldGgtcmFsbHlpbmctaG93LWRvZXMtdGhlaXItZ3Jvd3RoLWNvbXBhcmUtdG8tbmV3LWRlZmxhdGlvbmFyeS1tZW1lLWNvaW4tZGlnaXRvYWRzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Apr 2023 07:00:00 GMT",
        "title": "With Bitcoin (BTC) and Ethereum (ETH) Rallying How Does Their Growth Compare To New Deflationary Meme Coin ... - Analytics Insight",
        "content": "Over the past few years, meme coins have taken the crypto industry by storm by offering ways for investors to generate huge profits from tokens that seem to have no intrinsic value.\n\nHowever, as we move into 2023, many meme tokens with exciting prospects and real-world utility are now providing limitless growth opportunities.\n\nOne of these meme tokens with an exciting prospect is DigiToads, a recent toad-featuring token revolutionizing the crypto industry with its deflationary, utility-rich, community-oriented features.\n\nCompared to major crypto projects like Bitcoin (BTC) and Ethereum (ETH), DigiToads (TOADS) has proven to be a high-growth token.\n\nIn this article, we are going to look at the new token, DigiToads (TOADS), as it compares to Bitcoin (BTC) and Ethereum (ETH).\n\nDigiToads (TOADS)\n\nDigiToads (TOADS) is a deflationary meme coin with a focus on real-world utility. DigiToads is a high-growth token. And holders of its native token, TOADS, will earn residual income through NFT staking and P2E gaming.\n\nThe DigiToads’ P2E Gaming features an exciting web3 game that allows players to collect, nurture and battle other unique DigiToads.\n\nEach DigiToad has its own characteristics, giving players a wide range of options. Players will acquire these DigiToads by buying, trading, or winning them.\n\nPlayers will have the opportunity to make their DigiToads the strongest in the swamp arena. They can achieve this by using their TOADS tokens to purchase food and training equipment for their DigiToads.\n\nThese items will help their DigiToads learn new abilities, increase their size and strength, thereby helping the players compete better in battles against other players.\n\nAt the end of the DigiToads season, which lasts for one month, the platform allocates 50% of the funds raised from sales to the prize fund and distributes it among the top 25% of players. This provides the players with an opportunity to earn real money while enjoying the game.\n\nThe DigiToads ecosystem also incorporates NFT staking. This is a well-designed system that guarantees that the community is always rewarded.\n\nThe platform ensures that 2% of every TOADS transaction is put into the staking pool allowing users who stake their NFTs to get rewards depending on how much time their tokens are staked.\n\nDigiToads also plans to support the Amazon rainforest, home to many species of toads and frogs. The platform will donate 2.5% of the money raised from its sales to charities dedicated to replanting trees and preserving the rainforest.\n\nBitcoin (BTC)\n\nBitcoin (BTC) is a decentralized digital currency which one can use to purchase, sell, and exchange directly with other users without any intermediary.\n\nThe token’s creator, Satoshi Nakamoto, said that there is the need for “an electronic payment system based on crypto proof instead of trust.”\n\nBitcoin is open-source; nobody owns or controls it, and everyone can participate. Bitcoin uses peer-to-peer technology to operate without any need for a central authority; managing transactions is carried out by the network.\n\nThrough its special properties, Bitcoin includes many exciting features not covered by previous payment systems.\n\nSince its launch, Bitcoin has risen dramatically in value. Although it once sold for under $10 per token, as of April 11, one BTC sells for about $30,000.\n\nBecause its supply is limited to only 21 million tokens, many crypto experts expect Bitcoin’s price to keep rising, especially as more big investors begin to treat it as digital gold to hedge against market inflation and volatility.\n\nEthereum (ETH)\n\nEthereum (ETH) is an open-source blockchain developed in 2015 by Vitalik Buterin, who wanted a project that would deliver much more possibilities against Bitcoin’s design for storing and transferring money.\n\nVitalik Buterin’s thinking was: if one can use blockchain technology to decentralize money, why can’t we use the same blockchain to decentralize other things?\n\nEthereum introduced the decentralized app (DApp) system, enabling developers to create applications that expanded the use of blockchain to many uses.\n\nThe Ethereum network is the leading system for the nascent decentralized finance (DeFi). The system aids smart contracts in executing secure financial transactions. Smart contracts allow decentralized applications to run automatically on the blockchain when specific predetermined conditions are met.\n\nThe supply of ETH is infinite, and there are currently more than 121 million in circulation. The 2022 Ethereum “Merge” will dramatically slow the creation of new tokens and possibly make Ether deflationary.\n\nConclusion\n\nThe TOADS token is a high-growth asset that offers tremendous growth opportunities for investors to earn passive income through holding the tokens, NFT staking, and P2E gaming.\n\nDigiToads presale for the TOADS has just started, with over $1.2m raised so far. The token is currently selling at the price of $0.016.\n\nThis is an excellent opportunity for early investors to achieve higher returns on their investment as the presale will go through ten stages, with the token’s price increasing at each stage.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3Lml0d2ViLmNvLnphL2FydGljbGUvc2EtY3J5cHRvLWV4Y2hhbmdlcy11cGJlYXQtYWZ0ZXItcjU0M2JuLWV0aGVyZXVtLXVwZ3JhZGUvbHdyS3g3M1lubU5xbWcxb9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "SA crypto exchanges upbeat after R543bn Ethereum upgrade - ITWeb",
        "content": "South African crypto exchanges are optimistic about this week’s upgrade of Ethereum (ETH), the world’s second most popular digital currency after Bitcoin.\n\nThis, after the software that underpins the second-biggest crypto coin was upgraded on Wednesday in a process called the “Merge”.\n\nThe Ethereum Merge is the joining of Ethereum’s proof-of-stake Beacon Chain with the Ethereum Mainnet to transition the Ethereum blockchain off the legacy proof-of-work system.\n\nThe event gives Ethereum investors access to more than $30 billion (R543 billion) of the digital tokens.\n\nWhile some of the exchanges ITWeb spoke to say they are seeing an uptick in Ethereum trading on their platforms since the upgrade, some say it’s still too early to tell, and they are taking a cautious approach to the development.\n\nProof-of-stake switch\n\nChristo de Wit, Luno country manager for South Africa, says the Shanghai upgrade, as the latest upgrade is known, was the most anticipated Ethereum upgrade since the Merge last year, also known as the Paris upgrade, when the network completed its switch from proof-of-work to proof-of-stake.\n\nDe Wit explains that Shanghai will allow stakers, also referred to as validators, to unstake funds that have been locked since work started on this switch in December 2020.\n\n“Ahead of the upgrade, analysts were looking at how many stakers would withdraw their Ethereum. Specifically, how many of these stakers would withdraw their rewards earned versus how many withdraw rewards and the base amount staked.\n\n“With uncertainty around locked coins no longer an issue, they also wondered how many new investors would stake Ethereum,” he says.\n\nDavid Porter, GM of AltCoinTrader, says up until now, “validators on the Ethereum network weren’t able to withdraw their staked Ethereum, of which a minimum of 32 ETH was required in order to run your own validator”.\n\nAccording to Porter, this is not an insignificant amount of capital to have tied up and equates to over R1 million at today’s prices.\n\n“With the latest upgrade, users can now ‘unstake’ their ETH for the first time since December 2020.”\n\nSays Farzam Ehsani, CEO and co-founder of VALR: “The funds that were staked to ensure the integrity of the blockchain which were previously locked up are now available to be withdrawn and certain other optimisations to the network were included in the upgrade.”\n\nCrypto confidence\n\nAsked about the local market’s reaction to the Merge, De Wit says the Shanghai upgrade was triggered on 12 April at 22:27 UTC, which was just after midnight in South Africa.\n\n“At this stage it is too early to definitively comment on the reaction of South African investors. In anticipation of the upgrade, there was a lot of excitement in the crypto community, as the upgrade would conclude the Ethereum blockchain’s migration to a full proof-of-stake consensus mechanism.”\n\nWhile it’s too early to tell, De Wit points out that according to beaconcha.in, roughly half an hour after the Shanghai upgrade was activated, about $10 million worth of ETH had been processed.\n\n“We have seen that the price of Ethereum has remained stable and risen slightly in the immediate period after the upgrade, which could signal confidence in the network and the upgrade.”\n\nPorter says AltCoinTrader is seeing a small uptick in the volumes of Ethereum traded on its platform since the event. Like investors elsewhere, local crypto investors have been cautiously optimistic about this upgrade, he notes.\n\n“It’s obviously an important milestone on the Ethereum roadmap, but there was a fear that unlocking 18 million ETH for withdrawal (about 16% of the total supply) may lead to some sell-side pressures on the market.\n\n“However, this fear appears to have been largely unfounded. Personally, I think that investors know the value and, of course, the potential future value of their ETH and are not simply rushing to unstake their ETH now that they can.\n\n“We think this may just be borne from the positive market sentiment generally and perhaps the sense that ‘another successful Ethereum upgrade’ has been completed. In short, I don’t think the upgrade itself has led to increased trading volumes.”\n\nLikewise, Ehsani says VALR has seen an increase in ETH transactions.\n\n“South African and global investors have received the news of the successful upgrade in a very positive light. Ethereum is trading 9% higher in the last 24 hours at the time of my response.”"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDQvMTQvYnVsbC1ydW4tZXZlbnRzLWNyeXB0by1hdGgv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Bull run events and crypto ATH - The Cryptonomist",
        "content": "Many technical terms related to crypto markets are used among insiders: two of them, closely related to each other, are bull run and ATH.\n\nThree major bull runs have already occurred in the past, during which the major cryptocurrencies have hit their ATHs.\n\nCrypto bull runs and the reaching of ATHs\n\nFor a long time now, investors and speculators who buy into the financial markets by driving up prices are called bulls.\n\nBy definition, bulls are those investors who think that the market, or a specific asset, is ready to go up in price. In other words, they are those who take a bullish approach at any given time, and therefore buy in the hope of being able to resell at higher prices in the future.\n\nIn contrast, bearish people are called bears.\n\nIt is worth noting that bulls often turn into bears in times of panic, or bears turn into bulls in times of enthusiasm.\n\nWhen a large number of bulls collectively move large amounts of capital to make purchases, this tends to have a positive impact on prices, causing them to rise. In cases where such a dynamic goes on for a long time it is called a bull run.\n\nSo far only three large bull runs lasting several months have occurred in the crypto markets. In all three cases they occurred the year after the one of the three Bitcoin halvings that have occurred to date, and in all three cases they have lasted more or less a year.\n\nThe first crypto bull run and ATH event\n\nBitcoin’s first halving occurred in 2012, when Ethereum did not yet exist. Indeed, the first big bull run, in 2013, specifically involved the price of Bitcoin, which rose in less than twelve months from about $10 to about $1,100.\n\nThe gain was nearly 11,000%, although the speculative bubble subsequently burst and in 2014-2015 the price returned to $150.\n\nBitcoin’s second halving occurred in 2016, which was the year after the creation of Ethereum but the year before the creation of BNB. The second big bull run, in 2017, mainly involved Ethereum, which went from $10 to $1,400 in less than twelve months.\n\nTo be fair, several altcoins already existed in 2017, so much so that some, such as Ripple (now XRP), recorded even bigger jumps. But many of those that made a bang in 2017-2018 later failed to return to those levels, XRP foremost among them.\n\nThe second halving occurred in 2020, with the third big bull run occurring in 2021. In this last big bull run it was mostly altcoins, such as BNB, Dogecoin, or Shiba Inu, that recorded stratospheric performances, far more than Bitcoin or Ethereum.\n\nThe next halving will take place in 2024, in the spring.\n\nThe All-Time-High (ATH)\n\nATH is trivially an acronym for All Time High, meaning literally the highest price of all time.\n\nSpecifically, when it comes to financial markets it refers to a value that is greater than all previous values of the same parameter or price of the same asset.\n\nBitcoin’s price hit its ATH on 10 November 2021, obviously in the midst of a bull run, when it briefly exceeded $69,000.\n\nThe ATH of ETH (Ethereum’s native cryptocurrency) was also recorded on 10 November 2021, almost at $4,900.\n\nBNB’s price, on the other hand, touched its absolute all-time highs on 10 May, also in 2021, just below $690.\n\nIt is worth noting that XRP’s ATH remains that of 7 January 2018, namely of the previous big bull run, when it touched $3.4.\n\nThis means that it is not always the case that when a bull run is triggered in the crypto markets that all cryptocurrencies record a new ATH.\n\nTo date, Bitcoin has always registered a new ATH in all big bull runs, as has Ethereum, even though it has had one less.\n\nIndeed, almost all of those cryptocurrencies that were born after the 2017 bull run, but before the 2021 bull run, have had their highest prices recorded precisely in 2021, or at most in early 2022.\n\nIn contrast, among those that had already gone through the 2017 bull run are several that failed to return near the ATH in 2021. Ripple, which is now called XRP, but also Tron, Monero, Stellar, Bitcoin Cash, and so on.\n\nWhen will the next bull run occur\n\nNo one knows when the next big bull run might trigger, but in theory it could start after Bitcoin’s next halving.\n\nIt is worth noting that back in 2020 the halving occurred in the spring, while for example in 2016 it was in the summer. In both cases, however, the bull run started either in December of that year or in January of the following year.\n\nHowever, there is no certainty that Bitcoin’s halving of 2024 will produce a new big bull run in 2025, even though Bitcoin’s four-year cycles to date have always exhibited similar trends capable of affecting the performance of the entire crypto market.\n\nIn addition, there is also no certainty that, in the event of a new big bull run, the prices of major cryptocurrencies will make new ATHs.\n\nFor example, what happened to XRP during the last two bull runs could also happen to DOGE in the future, so there is no guarantee that prices should go up.\n\nIn addition, by now the price of Bitcoin has amply demonstrated that it is influenced by the monetary policies of central banks. In particular the US central bank, so the entire dynamics above may also be significantly affected in the future by decisions made by the Fed."
    }
]