[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiMmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V0aGVyZXVtLW1lcmdlLW9uZS15ZWFy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Sep 2023 07:00:00 GMT",
        "title": "A year after the Merge, institutional ETH adoption 'still forthcoming' - Blockworks",
        "content": "A year after Ethereum switched its consensus model to proof-of-stake, several barriers limiting institutional adoption of ether staking remain.\n\nStaking involves depositing 32 ETH to activate validator software. As validators process transactions and add new blocks to the blockchain, they earn rewards.\n\nThough various metrics signal clear growth in the segment, hurdles such as regulatory uncertainty and the macroeconomic environment are keeping many institutions on the sidelines, industry participants told Blockworks.\n\nThe number of Ethereum network validators has increased from roughly 400,000 to nearly 800,000 since the so-called Merge, according to data from staking company Attestant.\n\nAbout 210,000 of those validators were added to the network after the Shapella upgrade in April — an event that allowed stakers with locked-up ether to retrieve their deposits from the network’s smart contract.\n\nRead more: Shapella upgrade could reignite institutional interest in blockchain\n\nThere was roughly 29.4 million ETH deposited in the Beacon smart contract, Compass Point Research & Trading analysts said in a Sept. 8 research note. This accounts for nearly a quarter of ether’s circulating supply.\n\nLido has the largest percentage of staked ETH, with a roughly 29% share, the data shows. Centralized exchanges hold 20% of staked ether, with Coinbase accounting for about half of that.\n\nThe percentage of ETH supply that is staked could move to between 30% and 40%, Compass Point analysts added, noting that is more in line with other proof-of-stake chains.\n\nBen Dean, director of digital assets at WisdomTree in Europe, told Blockworks in the days leading up to the Merge that Ethereum’s switch to proof-of-stake “completely changes the investment case for ether.”\n\nA February survey by Nickel Digital Asset Management found that 77% of institutions believed the Merge would increase ether adoption. Roughly 40% of respondents said they expected ETH’s price to be at least $2,000 by the end of 2023.\n\nEther’s price was about $1,620 at 9 am ET on Friday — up 35% year to date but down 11% in the last month.\n\nHurdles in the way of broader adoption\n\nMore than 40% of the institutions that hold ether with Anchorage Digital also stake the ETH on its crypto platform, according to a company spokesperson. Anchorage has seen the amount of ETH staked on its platform increase by four times since the end of 2022.\n\nBut sweeping adoption remains to be seen, as demand for staking ETH remains the highest among crypto funds, Anchorage Digital co-founder Diogo Mónica said.\n\n“Many crypto-native players approach Ethereum with a long-term horizon, so actively participating by staking is the next logical step,” he told Blockworks in an email.\n\nSome venture capital funds — especially those with redemption requirements — do not stake all of their ETH due to liquidity concerns, Mónica added. Some corporations that hold ether are waiting for more tax guidance before fully jumping into staking, he noted.\n\n“Institutions are also watching the continued evolution of the Ethereum ecosystem,” Mónica explained. “All eyes are on sharding as the next major upgrade, which would significantly increase the scalability of the network.”\n\nRegulatory uncertainty is another hurdle, said Brian Mosoff, CEO of Ether Capital.\n\nWhile Ether Capital is actively staking 97% of its treasury, they are in the clear minority.\n\nThe bulk of post-Merge ether adoption is coming from retail investors through exchanges and individual at-home stakers, rather than institutions, Mosoff added.\n\n“Infrastructure in the crypto space has improved, but there is still a need for regulatory clarification, especially in the United States,” he said. “Questions remain about how these services should be offered and whether staking providers will require specific registrations.”\n\nCrypto exchange Bitstamp is set to end ether staking for US customers later this month, citing “current regulatory dynamics” in the country.\n\nThe Securities and Exchange Commission targeted the staking services of Coinbase and Binance in June lawsuits against the companies. Kraken stopped its staking services in February as part of a settlement with the regulator.\n\nAside from regulatory uncertainty, another factor affecting ETH staking demand is the macroeconomic environment, Mosoff noted. The rise in interest rates has led some traditional finance investors to consider safer or more familiar investments like Treasury bills, he added.\n\n“Mainstream education is still necessary to help people understand that Ethereum exposure should not be solely motivated by yield,” Mosoff said. “Those interested in staking yield must first recognize the importance of having ETH exposure in their portfolio as a long-term growth asset before appreciating the benefits of a 3% to 5% risk-free rate.”\n\nDespite some of the current barriers around demand, staking highlights ether’s “productivity as an asset,” he noted.\n\nRead more: Vitalik Buterin previews a future built on Ethereum\n\n“Will we see more people be able to participate in sequencing and security on layer-2?” Mosoff said. “What about EigenLayer providing security for specific apps or other chains?”\n\nHe added: “We are only beginning to scratch the surface of a post-Merge world.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDkvMTUvYS15ZWFyLWFmdGVyLWV0aGVyZXVtLW1lcmdlLW5ldC1zdXBwbHktZG93bi1uZWFybHktMzAway1ldGhlci_SAW5odHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA5LzE1L2EteWVhci1hZnRlci1ldGhlcmV1bS1tZXJnZS1uZXQtc3VwcGx5LWRvd24tbmVhcmx5LTMwMGstZXRoZXIvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Sep 2023 07:00:00 GMT",
        "title": "A Year After Ethereum Merge, Net Supply Down Nearly 300K Ether - CoinDesk",
        "content": "\"While Ethereum is 'down' it is certainly not 'out' and Ether investors should slowly monitor any positive news flow around the EIP-4844 upgrade. But a lot is at 'stake'; if this upgrade is seen as another minimal improvement, then the best days might be behind Ethereum,\" Thielen said, noting the increase in Ethereum's monthly transactions from 28 million to 32 million since the Merge."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5ibG9vbWJlcmcuY29tL25ld3MvYXJ0aWNsZXMvMjAyMy0wOS0xNi9ldGhlcmV1bS1zLWV0aC1zdWNjZXNzZnVsLW92ZXJoYXVsLXNlbmRzLWRldmVsb3BlcnMtc2NyYW1ibGluZy1mb3ItYW5vdGhlci1maXjSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Sep 2023 07:00:00 GMT",
        "title": "Ethereum's Successful Overhaul Sends Developers Scrambling for Another Fix - Bloomberg",
        "content": "One year after one of the most talked about software upgrades since the Y2K changeover more than two decades ago, crypto’s most important commercial highway risks becoming a victim of its own success.\n\nThe revamp of the Ethereum network , which was known as the Merge, turned out to be a seamless transition to a more energy-efficient system of ordering transactions on the blockchain. One of the incentives offered to participants is the ability to earn a yield on tokens used to help the network run. Surging demand for the so-called staking feature has now raised the prospect of the network bogging itself down."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1tZXJnZS1hLXllYXItbGF0ZXItZW5lcmd5LWNvbnN1bXB0aW9uLWRvd24tY2VudHJhbGl6YXRpb24tZmVhcnMtb25nb2luZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Merge anniversary — 99% energy drop but centralization fears linger - Cointelegraph",
        "content": "One year after its historic transition to proof of stake, Ethereum has seen a massive reduction in energy use and a marked improvement in access to the network, however, a number of technical issues still mark the road ahead.\n\nThe Merge was executed on Sept. 15, 2022 — an event that saw the Ethereum mainnet merging with a separate proof-of-stake blockchain called the Beacon Chain.\n\nThe most noticeable improvement to Ethereum post-merge was the seismic shift from an energy-guzzling proof-of-work (PoW) consensus mechanism to PoS, which saw the Ethereum network drastically reduce its total power consumption.\n\nAccording to data from The Cambridge Centre for Alternative Finance, the Ethereum network has seen its energy use drop more than 99.9% from the approximately 21 terawatt hours of electricity it used while running under PoW.\n\nThe Merge has reduced Ethereum's power consumption by more than 99%. Source: CCAF\n\nEthereum turns deflationary\n\nOutside of using less power, The Merge also saw the Ethereum network become economically deflationary, meaning that the number of new Ether (ETH) issued to secure the network has been outpaced by the amount of ETH removed from supply forever.\n\nAccording to data from the Ethereum data provider ultrasound.money, a little more than 300,000 ETH (worth $488 million at current prices) has been burned since the Merge. At current burn rates, the total supply of ETH is being reduced at a rate of 0.25% per year.\n\nChange in ETH supply since the Merge. Source: Ultrasound Money\n\nWhile many proponents believed that the price of Ethereum would surge in response to this new deflationary pressure, the hopes of a dramatic increase in the price of ETH were buffeted by a series of macroeconomics headwinds such as the banking crisis and spiking inflation.\n\nNotably, the growth of ETH paled in comparison to the growth in the price of Bitcoin (BTC) in the first quarter of this year, with the flagship crypto asset seeming to benefit from much of the traditional financial instability brought about by the banking crisis.\n\nPrice action aside, the central theme of the proof-of-stake upgrade was the introduction of stakers in place of miners to secure the network.\n\nThe subsequent Shapella upgrade in April 2023 drove ETH in huge droves toward staking. The top beneficiaries of this shift were the liquid staking providers such as Lido and Rocket Pool.\n\nLiquid staking takes over\n\nSince the Merge, liquid staking providers have come to dominate the Ethereum landscape, with more than $19.5 billion worth of ETH currently staked by way of liquid staking protocols, according to data from DefiLlama.\n\nAt the time of publication, Lido is by far the largest staking provider, accounting for 72% of all staked ETH.\n\nLido currently accounts for 72% of all staking on Ethereum. Source: DeFiLlama\n\nHowever, while many Ethereum advocates, including Labrys CEO Lachlan Feeney, have praised the switch to staking for removing the barriers of expensive, sophisticated hardware for mining, one of the primary concerns with the rise of liquid staking has been the level of control granted to staking providers, in particular Lido Finance.\n\n“Liquid staking is ultimately good for the network as it ensures that the governance of the network is not restricted only to the wealthy. However, it has also led to the rise of its own problems,” Feeney told Cointelegraph.\n\nAt least five Ethereum liquid staking providers working towards imposing a 22% limit rule, in a move to ensure the Ethereum network remains decentralized — though Lido voted not to take part.\n\nRelated: Ethereum’s active addresses second-highest in history: Analysts\n\nNotably, Lido voted by a 99.81% majority not to self-limit back in June, leading Ethereum advocate Superphiz to declare that the the staking providers had “expressed an intention to control the majority of validators on the beacon chain.”\n\nLido voted by a 99.81% majority not to self-limit. They have expressed an intention to control the majority of validators on the beacon chain.https://t.co/T16rTdM3gm — superphiz.eth ️ (@superphiz) August 31, 2023\n\nThis move has led to widespread concerns over the potential centralization of validation on Ethereum.\n\n“Lido presently controls 32.26% of all staked Ether on the network worth over $14 billion. In the long run, I am confident that Ethereum is better off with liquid staking than without it; however, there are many challenges that still need to be overcome,” Feeney concluded.\n\nFeeny also noted that the most pressing concern for Ethereum in the immediate future was the growing regulatory pressure against crypto and blockchain in the United States more broadly.\n\n“Regulatory bodies, particularly in the U.S., appear to be hellbent at the moment on eliminating the U.S.-based blockchain industry,” he said.\n\n“It would be devastating for Ethereum and the global blockchain community if it becomes too difficult for blockchain companies to operate in the U.S.”\n\nOutside of staking, client diversity also remains a central issue. On Sept. 5, Vitalik Buterin took to the stage at Korea Blockchain Week to discuss the six key problems that need addressing to solve the problem of centralization.\n\nCurrently, the majority of the 5,901 active Ethereum nodes are being run through centralized web providers like Amazon Web Services, which many experts claim leaves the Ethereum blockchain exposed to a centralized point of failure.\n\nDistribution of Ethereum nodes from web service providers. Source: Ethernodes\n\nIn Buterin’s view, in order for Ethereum to remain sufficiently decentralized in the long-term it needs to be easier for everyday people to run nodes, which means drastically reducing costs and hardware requirements for node operators.\n\nButerin’s primary solution was the concept of statelessness, which removes the reliance on centralized servers by reducing data requirements for node operators to near-zero.\n\n“Today, it takes hundreds of gigabytes of data to run a node. With stateless clients, you can run a node on basically zero.”\n\nWhile this was Buterin’s most prominent concern for the centralization issue, he explained that these problems may not be solved for another 10 to 20 years.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: NFT collapse and monster egos feature in new Murakami exhibition"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZGVjcnlwdC5jby8xOTczNDEvb25lLXllYXItYWZ0ZXItdGhlLW1lcmdlLXdoZXJlLWRvZXMtZXRoZXJldW0tc3RhbmTSAVJodHRwczovL2RlY3J5cHQuY28vMTk3MzQxL29uZS15ZWFyLWFmdGVyLXRoZS1tZXJnZS13aGVyZS1kb2VzLWV0aGVyZXVtLXN0YW5kP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Sep 2023 07:00:00 GMT",
        "title": "One Year After the Merge: Where Does Ethereum Stand? - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe crypto zeitgeist evolves so quickly that Ethereum’s so-called merge feels like forever ago. But it’s been exactly one year since the network fully transitioned to using proof of stake and there have been notable shifts since the change.\n\nIn terms of Ethereum’s price, not much may appear to have changed since last September. A day before the transition took place, ETH traded hands at around $1,600—approximately the same price it’s trading at a year later.\n\nHowever, under the hood and on-chain, there have been substantial developments, whether that’s a decrease in Ethereum’s overall supply or a sharp increase in the amount of Ethereum that’s staked, just to name a few.\n\nAD\n\nAD\n\nEnergy Consumption\n\nPrior to the shift, Ethereum verified on-chain transactions with the same consensus mechanism as Bitcoin: proof of work. It requires miners to compete to solve complex mathematical equations. In exchange for participating in the energy-intensive process, they earn rewards.\n\nBut when Ethereum shifted to proof of stake, it meant validators, not miners, needed to pledge Ethereum to secure the network in exchange for rewards. One of the most notable impacts was a reduction in Ethereum’s energy use. The network’s carbon footprint shrank by 99.99%, according to a report from the Crypto Carbon Ratings Institute.\n\nCrypto has garnered a mainstream reputation for consuming lots of energy. And Canadian investor Kevin O'Leary is among those who have highlighted ESG concerns as one of the main things holding crypto adoption back. Financial institutions from BlackRock to Fidelity have caught flack for crypto moves due to environmental concerns with crypto as well.\n\nIt’s significant that the merge rendered those anti-crypto criticisms moot for the industry’s second-largest coin, Dermot O'Riordan, director of the Pocket Network Foundation told Decrypt.\n\n“People were like, ‘This seems fun and cool, but you’re all bucking around while the Earth is burning,” he said. “It was a genuine drag on the believability and credibility of the technology.”\n\nAD\n\nAD\n\nLiquid Staking\n\nSince Ethereum’s transition, the amount of Ethereum staked has nearly doubled. The total has grown 93% to 26.5 million Ethereum worth close to $43 billion, according to a dashboard on Dune created by Dragonfly Data Scientist Hildebert Moulié. That equates to one out of every five Ethereum.\n\nAt the same time, centralization and censorship concerns have been raised in the upgrade’s wake. That’s because people fear control over verifying the network’s transactions could become isolated in the hands of a few, whether that’s a firm like an exchange or projects that make it easier for users to pool funds together and earn staking rewards.\n\nAhead of the merge, some were particularly concerned about exchanges like Coinbase becoming involved in staking due to U.S. sanctions against Tornado Cash, the coin-mixing service. The worry that centralized entities would censor transactions to stay compliant made decentralized applications like Lido Finance a better bet in terms of decentralization.\n\nHowever, the heavy use of Lido, a liquid staking solution, has garnered particular attention as of late. It’s now been identified as a potential weak point for Ethereum’s ecosystem in terms of decentralization because Lido now supports 32% of all Ethereum staked, according to Moulié’s dashboard.\n\nWhen it comes to liquid staking tokens, Lido Staked Ethereum ($STETH) looms large, with a market capitalization of $14 billion, according to CoinGecko. For reference, the second largest token by market capitalization representing staked Ethereum is Rocket Pool ETH ($RETH), with a market capitalization of $926 million.\n\nDespite concerns, O'Riordan noted that liquid staking tokens have been a major source of growth for decentralized finance.\n\nLiquid staking enables Ethereum holders to pledge their tokens for a reward, and still be able to leverage the value of that Ethereum with a respective token that’s issued and pegged to its price. Even though decentralized exchanges have seen a dip in value for associated assets since the merge, liquid staking continues to flourish.\n\nWhen the merge took place, there wasn’t a way for people to withdraw staked Ethereum, making services like Lido especially attractive. But Ethereum’s Shanghai upgrade in April enabled staking withdrawals, effectively sealing the network’s transition to proof of stake.\n\nAD\n\nAD\n\nScaling Solutions\n\nIn order for Ethereum to achieve significant adoption, the network needs to be able to process lots of transactions in a timely way—so the logic goes.\n\nThe merge wasn't intended to improve Ethereum’s speed, and as a result, Ethereum’s average transactions per second has mostly hovered in the teens since last September, according to the analytics site L2 Beat. Still, it set the stage for what’s next.\n\nThe “surge,” a suite of upgrades slated to follow the merge, is expected to improve Ethereum’s scalability, according to a vision for Ethereum’s roadmap articulated by co-founder Vitalik Buterin ahead of the merge last July.\n\nHowever, scaling solutions that seek to address Ethereum’s current limitations have also become more present in crypto. Average transactions per second between all Ethereum layer-2 networks has now surpassed 50, a significant improvement from last year, according to L2 Beat.\n\nWhen combined, the total number of transactions over the past 30 days for popular layer-2 networks zkSync Era, Optimism, and Arbitrum Nova totals over 61 million. That’s twice the number of transactions on Ethereum during the same span.\n\nThe recent proliferation of layer-2 tech is partly due to a foundation the merge created in terms of security at Ethereum’s base level, Nebojsa Urosevic, co-founder of infrastructure solutions provider Tenderly told Decrypt.\n\n“The merge indeed laid foundational bricks for further scalability enhancements,” he said. “Post-merge, we've seen a bolstered commitment to layering approaches, with layer-2 solutions coming to the forefront.”\n\nThe SEC\n\nMeanwhile, staking has emerged as a regulatory flashpoint in the U.S., where the Securities and Exchange Commission (SEC) has gone after several crypto exchanges for offering services to help users earn network rewards.\n\nAD\n\nAD\n\nKraken's settlement with the SEC in February, involving a $30 million fine, stemmed from allegations that its staking-as-a-service program constituted an unregistered securities offering. Similar claims were raised against Coinbase and Binance in lawsuits over their respective staking products.\n\nWhile the SEC has ensnared several tokens in its lawsuits against Binance and Coinbase, alleging they are examples of unregistered securities, some have noticed and questioned why the regulator hasn’t called out tokens that use proof of work as illicitly issued assets.\n\nBut U.S. regulators are still at odds over how to classify Ethereum. The result is an apparent turf war between two of the largest financial watchdogs: The SEC and Commodity Futures Trading Commission (CFTC).\n\nCFTC Chairman Rostin Behnam said Ethereum is a commodity in March. A month before, SEC Chair Gary Gensler had suggested that “everything but Bitcoin” is a security, and then he sidestepped questions regarding Ethereum in April.\n\nSupply & Direction\n\nAnother notable impact the merge has had on Ethereum is a decrease in the token’s overall supply. The way the shift has changed how new Ethereum is issued versus how often it's removed from circulation—a process known as burning—has resulted in a 0.25% decrease in the total amount of Ethereum in circulation, according to sound.money.\n\nIn retrospect, the merge may seem like a footnote in crypto’s history books compared to the turbulence and corporate blow-ups that defined crypto markets in 2022. But in terms of the future, O'Riordan compared it to a beacon that illuminates Ethereum’s overall direction.\n\n“There’s a renewed belief in confidence that Ethereum can actually pull off these major technical upgrades and do ambitious things,” he said. “While Ethereum can be slower than we’d all like it to be, it’s ultimately moving forward and staying true to its values at the same time.”\n\nDevelopers have been hammering out plans for one of Ethereum’s next big upgrades, dubbed “Dencun,” core developer Mario Havel told Decrypt in July. It includes the introduction of a feature called proto-danksharding, which is expected to scale Ethereum to over 100,000 transactions per second once it’s fully realized.\n\nAD\n\nAD\n\nOther features in the works, such as account abstraction, would effectively make managing a crypto wallet as easy as managing an email account. And earlier this month Buterin talked about a feature called stateless clients, which would make running Ethereum nodes on smartphones feasible down the line."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8venljcnlwdG8uY29tL2V0aGVyZXVtLW5vLWxvbmdlci10b3AtZG9nLWFtb25nLWluc3RpdHV0aW9uYWwtaW52ZXN0b3JzLWFtaWRzdC1mZWFycy1vZi1jcmFzaC10by0xMDAwL9IBcGh0dHBzOi8venljcnlwdG8uY29tL2V0aGVyZXVtLW5vLWxvbmdlci10b3AtZG9nLWFtb25nLWluc3RpdHV0aW9uYWwtaW52ZXN0b3JzLWFtaWRzdC1mZWFycy1vZi1jcmFzaC10by0xMDAwLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Sep 2023 07:00:00 GMT",
        "title": "Ethereum No Longer Top Dog Among Institutional Investors Amidst Fears of Crash to $1,000 - ZyCrypto",
        "content": "Advertisement\n\nHead of Research at CoinShares, James Butterfill, revealed some concerning news in the latest European digital asset manager report. With a $59 million outflow in the past week, tensions are high in the crypto market. While Bitcoin was the asset that had the greatest losses, it seems Ethereum is headed for more pain, while overall trading volumes dropped by 73% from the previous week.\n\nInstitutional Outflows Remain High\n\nWhile XRP saw inflows of $0.7 million, ETH outflows totalled $4.8 million, bringing the year’s total to $108 million. Butterfill said the lacklustre performance made ETH “the least loved digital asset amongst ETP investors this year.”\n\nETP, which stands for ‘Exchange-Traded Product’, includes a wide range of investment products designed to expose investors to various assets, such as ETFs, exchange-traded notes (ETN), and exchange-traded mutual funds (ETFM).\n\nThe recent FTX scare about a massive sell-off of tokens, which could potentially trigger larger price drops, further causes concerns. FTX lawyers asked the court to allow the liquidation of $3.4 billion in crypto assets. The Delaware Bankruptcy Court approved on September 13, but the proposal would only allow for an initial release of $100 million in funds per week. This would not likely trigger massive price movements as some initially feared.\n\nCould ETH Slide Below the Crucial $1,000 Mark?\n\nIn a report named ‘The Altcoin Crash is Coming’, research platform Matrixport suggests a grim outlook for Ethereum. It said: “A decline below $1,500 could bring back the idea that Ether could decline to $1,000 — a level that would appear justified based on the revenue projection from the Ethereum ecosystem.”\n\nAdvertisement\n\nOn the upside, Cathie Wood’s Ark Invest recently applied for Spot Ethereum ETF. While it remains to be seen if this gets approval, given the many Spot Bitcoin ETFs currently in limbo, it sends an overall bullish signal that the second-largest cryptocurrency is still popular. As per CoinMarketCap, Ethereum is currently trading at $1619, down about 13.85% month-on-month.\n\nSource: CoinMarketCap\n\nThe report by Matrixport also highlights that the current ETH price is below the 50-day moving average, which is considered a bearish signal. Of course, ETH is not the only cryptocurrency experiencing losses; the overall market is trending downward with few exceptions. This makes ETH losses less about Ethereum’s fundamentals and more about overall market sentiment."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ldGhlcmV1bS1ibG9ja2NoYWluLWxhdW5jaGVzLWhvbGVza3ktdGVzdC0xNDAyMDk1NDIuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Blockchain Launches 'Holesky' Test Network, on First Anniversary of Historic 'Merge' - Yahoo Finance",
        "content": "Ethereum developers launched a new test network, Holesky, on Friday that they say will improve the largest smart-contracts blockchain’s testing capability – by making it twice as big, at least based on one metric, than the main network.\n\nThe first blocks proposed on the new test network were visible on Friday via a new blockchain explorer set up specifically to monitor Holesky, on the website beaconcha.in.\n\nThe launch of Holesky was selected to mark the first anniversary of Ethereum completing the \"Merge,\" its historic transition to a \"proof-of-stake\" blockchain, from the original and more energy-hungry \"proof-of-work\" model that Bitcoin uses.\n\nTestnets are copies of a blockchain – in this case Ethereum – used specifically for testing new applications and smart contracts in a low-stakes environment.\n\nEthereum developers expect Holesky to eventually replace the Goerli testnet, targeted for sunset in early 2024.\n\nBiggest testnet for Ethereum\n\nEthereum core developer Parithosh Jayanthi told CoinDesk that Holesky is expected to become the biggest testnet for Ethereum, and should have 1.4 million validators to help address scalability problems with mainnet. That's double the 700,000 on Ethereum.\n\nGoerli and Sepolia, another Ethereum testnet, are operated by a smaller subset of “validators” than the main Ethereum chain, and some developers think these smaller validator sets pose a problem.\n\nBy making Holesky bigger, developers will theoretically be able to test infrastructure and upgrades under more rigorous conditions, meaning tests that go smoothly on Holesky should be less likely to face unforeseen issues on mainnet.\n\n“We don't want to hit a scaling issue that could happen first on mainnet,” Jayanthi told CoinDesk prior to Holesky's debut. “We want to catch [scaling issues] on testnet, which means we have to have a testnet that's bigger” than the main Ethereum chain.\n\nRead more: Hello Holesky, Ethereum’s Newest Testnet"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA5LzE2L2NvdWxkLXRoaXMtbmV3LW1vdmUtZnJvbS1jYXRoaWUtd29vZC1hbmQtYXJrLWludmVzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Sep 2023 07:00:00 GMT",
        "title": "Could This New Move From Cathie Wood and Ark Invest Send Ethereum Soaring? - The Motley Fool",
        "content": "In what could be a big catalyst for Ethereum (ETH -0.54%), Cathie Wood's Ark Invest has filed an application for the first-ever spot Ethereum exchange-traded fund (ETF). This comes after a summer filled with twists and turns surrounding the launch and approval of the first-ever spot Bitcoin ETF.\n\nSo could this new ETF from Ark Invest send the price of Ethereum soaring? There are several different factors to consider.\n\nInstitutional demand\n\nLet's face it -- the launch of a spot Ethereum ETF probably means little for the seasoned crypto investor. Why would you go to the added step of buying an ETF (which comes with management fees), when you can already go to a cryptocurrency exchange like Coinbase Global and buy Ethereum directly? The only allure of a spot crypto ETF is if you want exposure to crypto, but without the risk or hassle of investing directly in crypto.\n\nThe big reason a spot Ethereum ETF is so bullish for the markets is because it signals pent-up institutional demand for the world's second-largest cryptocurrency. Many institutional investors are unwilling or unable to purchase crypto directly, due to the constraints placed on them. Do you really want your pension fund or university endowment dabbling in a volatile, poorly regulated industry with significant risk of loss?\n\nBut the picture changes when you take into account a market-traded financial instrument that has been approved by the Securities and Exchange Commission (SEC). According to the Ark Invest filing, the spot Ethereum ETF would trade on the CBOE BZX Exchange and custody its crypto assets with Coinbase. That essentially makes Ethereum \"safe\" (relatively speaking) for the world's biggest institutional investors. And that's where things get really exciting, because it could signal a tsunami of new money flowing into Ethereum. Theoretically, that new influx of money should boost Ethereum's price. It's just simple supply and demand.\n\nLessons from Bitcoin this summer\n\nAnd that, of course, brings us to what happened this summer, which was headlined by one big event: the decision by BlackRock, the world's biggest fund manager, to file for a spot Bitcoin ETF on June 15. That led to a flurry of follow-on filings from other institutional investors, a response by the SEC, and new adjustments to those filings in response to the SEC. Just about everyone -- including Ark Invest -- was trying to be first in line for the first-ever spot Bitcoin ETF.\n\nAnd the market responded accordingly. The Bitcoin rally in June was very real. On the date of the BlackRock ETF filing, Bitcoin was trading around $25,000. Thirty days later, it was trading near $30,000, and bullish sentiment was risiing. It seemed to be a matter of not if, but when, a new spot Bitcoin ETF would be approved. Finally, it looked like Bitcoin was about to go mainstream.\n\nGranted, the effect on Ethereum is not going to be as great as for Bitcoin, simply due to the fact that institutional investors still prefer Bitcoin to Ethereum. But there is almost certain to be a similar type of effect, given that Ethereum now accounts for roughly 20% of the entire market cap of the crypto market.\n\nThe heavy hand of the SEC\n\nSo what could possibly go wrong? There's a short answer: the SEC. There's something about a spot Bitcoin ETF that the SEC doesn't like. Despite the fact that the SEC has already approved futures-based Bitcoin ETFs, it doesn't seem to want to approve a spot Bitcoin ETF. So it's uncertain how long the approval process could take. Ark Invest, for example, originally filed its first spot Bitcoin ETF application back in 2021.\n\nAnd, in the case of Ethereum, there's an added wrinkle. That's because Ark Invest is essentially skipping a step here. Unlike with Bitcoin, no futures-based Ethereum ETF has yet been approved in the U.S., although several applications have been filed. So Ark Invest is skipping from no Ethereum ETF in the U.S. to spot Ethereum ETF without the intermediate step of a futures-based Ethereum ETF.\n\nThe big picture\n\nDespite these regulatory challenges, the big picture is that the decision by Ark Invest to file for a spot Ethereum ETF appears to signal that there's plenty of institutional demand for Ethereum. As crypto becomes more and more of a mainstream asset class for institutional investors, that's huge for Ethereum's future prospects. So buckle up: This could get interesting if Cathie Wood ever gets SEC approval for the first-ever spot Ethereum ETF."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2hvbmcta29uZy1sYXdtYWtlci1xdWlldHMtY3J5cHRvLXN0YWJpbGl0eS1jb25jZXJucy1yYWlzZWQtYnktZXRoZXJldW0tY28tZm91bmRlci_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Sep 2023 07:00:00 GMT",
        "title": "Hong Kong lawmaker quiets crypto stability concerns raised by Ethereum co-founder - CryptoSlate",
        "content": "Hong Kong Legislative Council member Johnny Ng has invited Ethereum (ETH) co-founder Vitalik Buterin to the region so that he can gain insights into its approach to cryptocurrency projects, according to a Sept. 15 post on X, formerly Twitter.\n\nOn Sept. 14, Buterin, speaking at the Web3 Transitions Summit in Singapore, reportedly advised cryptocurrency projects to carefully assess the stability of Hong Kong’s crypto regulatory environment, noting that the complex relationship between the city-state and Mainland China could pose challenges for ventures operating in the region.\n\nAccording to Buterin, he has difficulty judging if the current level of friendliness towards crypto could be sustained for a long time, considering China’s open antagonism to the emerging industry.\n\nNg replies to Buterin.\n\nIn response, Ng attempted to address Buterin’s concerns by emphasizing that the region cannot abruptly reverse its established policies because “every policy or legislation in Hong Kong will go through a period of discussion, including government policy writing, public consultation, discussions in multiple committees of the Legislative Council and the General Assembly.”\n\nHe added:\n\n“Hong Kong’s policies and laws will not change overnight. All relevant strategies and regulations have gone through major social consensus and complete procedures. Therefore, I can tell Mr. Vitalik that Hong Kong’s policies are very stable.”\n\nThe lawmaker also explained the relationship between the region and China, saying they practice a “one country, two systems” policy that allows Hong Kong to “formulate policies on virtual assets and welcomes global compliance companies to develop” under their jurisdiction. According to Ng, there are no “complications” in this unique relationship.\n\nHong Kong is actively drawing crypto firms, including CoinEx, OKX, and others, to its jurisdiction by establishing frameworks for their compliant operations.\n\nThe region’s financial watchdog, Hong Kong Monetary Authority (HKMA), encouraged banking giants to accept crypto exchanges as clients and revealed intentions to implement a comprehensive regulatory framework for stablecoins."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtYnVzZC1oaXN0b3JpYy1kb3JtYW50LW1vdmVtZW50LXNwYXJrcy1zcGVjdWxhdGlvbtIBUmh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtYnVzZC1oaXN0b3JpYy1kb3JtYW50LW1vdmVtZW50LXNwYXJrcy1zcGVjdWxhdGlvbj9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Sep 2023 07:00:00 GMT",
        "title": "Ethereum (ETH), BUSD Historic Dormant Movement Sparks Speculation - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a new tweet, on-chain analytics firm Santiment notes that the second largest cryptocurrency, Ethereum (ETH), and Binance USD (BUSD) stablecoin are seeing dormant coin movements.\n\nAdvertisement\n\nSantiment observes that Ethereum and BUSD have had historic dormant movements this week. This is because the average age at which both tokens have been sitting in wallets has become much younger after massive stagnation. In this regard, that of BUSD fell by 378 days, while that of Ethereum fell by 26 days.\n\n🤔 The average age in which #Ethereum and #BinanceCoin tokens have been sitting in wallets both became much younger after massive stagnation. Do you believe both coincide with the #FTX liquidations and sell-offs that began this week? https://t.co/RyFfUbMe22 pic.twitter.com/KfRZPtCZn1 — Santiment (@santimentfeed) September 15, 2023\n\nIt is speculated that this historic dormant movement might be related to the FTX-triggered liquidations and sell-offs that began earlier in the week.\n\nFTX, which currently controls over $3.4 billion in crypto assets, has been granted permission to sell its crypto holdings by a U.S. judge.\n\nFTX will be allowed to sell off in weekly batches, with a first-week restriction of $50 million and following weekly limits of $100 million. However, BTC and ETH can only be sold after giving the creditors' committee, ad hoc committee and the U.S. trustee a 10-day notice.\n\nThis aside, in recent weeks, Ethereum has seen dormant ICO-era whale wallets come to life. In the past week, a dormant pre-mine address that held 185 ETH worth $302,096 revived after 8.1 years.\n\nBinance moving to end support for BUSD\n\nAs part of its gradual move to end support for the BUSD stablecoin by 2024, crypto exchange Binance moved to burn several idle Binance-pegged tokens this week.\n\nOn Sept. 14, Binance set fire to idle Binance-pegged tokens, namely TUSDOLD (BSC), BUSD on the MATIC network, BUSD both on the BSC and BNB networks and BUSD on the TRX network.\n\nIn August, Binance announced it would gradually end support for BUSD, urging users to convert the token to other crypto assets by February next year. Paxos stopped issuing the stablecoin in February following a regulatory crackdown on the BUSD token."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tYml0Y29pbi1hY3RpdmUtYWRkcmVzc2VzL9IBTGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tYml0Y29pbi1hY3RpdmUtYWRkcmVzc2VzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Surges Ahead Of Bitcoin In Active Addresses, What Does This Mean? - NewsBTC",
        "content": "Since its inception, Ethereum has continuously been compared to Bitcoin with the former being hailed as a better option to the latter in some cases. As the years have flown by, the competition has gotten even fiercer, especially with ETH growing rapidly. Eventually, Ethereum seems to be catching up with Bitcoin, especially in terms of active addresses.\n\nEthereum Active Addresses Surpass Bitcoin\n\nOn Thursday, September 14, on-chain data tracker Santiment revealed a surprising update on the fierce rivalry between Bitcoin and Ethereum. In the X post, the tracker revealed that the number of unique addresses that were transaction on the network had reached its second-highest daily figure of all time.\n\nWhile this is significant on the part of the blockchain alone, it is also significant in terms of the competition between the two largest assets in the space. To put this in perspective, the 1,089,893 figure reported by Santiment puts Ethereum ahead of Bitcoin in terms of this metric alone.\n\nThe last time that the daily unique active addresses on the network hit its new all-time high was back in December 2022. So it has been almost a year since the metric was this high, suggesting a unique driving factor behind it.\n\nThis report is also in line with the report from Artemis Terminal that shows that Ethereum was right in front of Bitcoin in terms of daily active addresses.\n\nETH active addresses surpass BTC on Wednesday | Source: Artemis Terminal\n\nArtemis reports that on September 13, Ethereum saw a total of 1.03 million daily addresses compared to Bitcoin’s 743,800 addresses in the same time period. However, this figure has since retracted and Bitcoin has pulled in front of Ethereum once more as of September 14.\n\nWhat Does This Mean?\n\nWhile Ethereum’s surge on Wednesday was impressive, it does not mean much since the network has been unable to sustain the growth. Also, the surge could be easily explained by the rise in the popularity of the Friend.Tech decentralized finance social media platform based on the Ethereum blockchain.\n\nFriend.Tech had seemingly come back from the death to reach a new all-time high in its number of daily users. Since an ETH address is required to participate in the platform, it is no surprise there was an uptick in the number of ETH addresses active on the network.\n\nThe spike in the number of daily active addresses also seems to have had little impact on the price of the cryptocurrency itself. ETH’s price is still struggling to hold above $1,600, with small gains of 0.35% in the last day and losses of 1.15% in the last week.\n\nETH price still holding above $1,600 | Source: ETHUSD on Tradingview.com\n\nFollow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from CBS News, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA5LzE1L2V0aGVyZXVtLWJsb2NrY2hhaW4tbGF1bmNoZXMtaG9sZXNreS10ZXN0LW5ldHdvcmstb24tZmlyc3QtYW5uaXZlcnNhcnktb2YtaGlzdG9yaWMtbWVyZ2Uv0gGGAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDkvMTUvZXRoZXJldW0tYmxvY2tjaGFpbi1sYXVuY2hlcy1ob2xlc2t5LXRlc3QtbmV0d29yay1vbi1maXJzdC1hbm5pdmVyc2FyeS1vZi1oaXN0b3JpYy1tZXJnZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Blockchain Launches 'Holesky' Test Network, on First Anniversary of Historic 'Merge' - CoinDesk",
        "content": "“We don't want to hit a scaling issue that could happen first on mainnet,” Jayanthi told CoinDesk prior to Holesky's debut. “We want to catch [scaling issues] on testnet, which means we have to have a testnet that's bigger” than the main Ethereum chain."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vZGVjcnlwdC5jby8xOTc0MjkvdGhpcy13ZWVrLWluLWNvaW5zLWJpdGNvaW4tc3RlYWR5LWV0aGVyZXVtLWludmxhdGlvbmFyeS10b25jb2luLXJpc2Vz0gFlaHR0cHM6Ly9kZWNyeXB0LmNvLzE5NzQyOS90aGlzLXdlZWstaW4tY29pbnMtYml0Y29pbi1zdGVhZHktZXRoZXJldW0taW52bGF0aW9uYXJ5LXRvbmNvaW4tcmlzZXM_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Sep 2023 07:00:00 GMT",
        "title": "This Week in Coins: Steady Week for Bitcoin and Ethereum, Toncoin Balloons 23% - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt.\n\nIt was another week of fairly stable prices for leading cryptocurrencies. Bitcoin (BTC) grew 3% over the seven days and started Saturday trading at $26,564, while Ethereum (ETH) remains more or less at the same price it was seven days ago at $1,636.\n\n​​\n\nAD\n\nAD\n\nEthereum’s growth may have been hobbled by reports that its supply recently turned inflationary (meaning more Ether is issued than burned) in one of few such periods since the Merge in September 2022. Last week, Ethereum’s supply increased by 4,092 ETH tokens worth around $6.6 million, per Ultrasound.money data.\n\nThe leading cryptocurrencies traded sideways all week, even after the U.S. Bureau of Labor Statistics’ (BLS) latest Consumer Price Index (CPI) on Wednesday revealed that inflation had risen a fraction above economists’ projections last month due to rising gasoline prices.\n\nOnly three cryptocurrencies posted any notable price movement this week. Two tokens rallied: Bitcoin Cash (BCH) grew 11.5% to $213.79, while Toncoin (TON) blew up 23% to trade at $2.20.\n\nTON’s explosive price movement this week was catalyzed by news on Wednesday that its parent company—Telegram—has integrated The Open Network blockchain’s Web3 wallet into its messaging app, bringing easy access to TON for the app’s 800 million users.\n\nThe move represents a symbolic win for Telegram. Technically, the company withdrew from involvement in TON in 2020 after litigation by the U.S. Securities and Exchange Commission. Telegram was accused of offering unregistered securities in the form of a token called Gram. It settled with the SEC by paying a fine of $18.5 million and returning unspent funds to investors.\n\nOne cryptocurrency notably depreciated over the week: Stellar (XLM) fell 9.3% to trade at $0.118263 at the time of writing. Its poor performance this week appears to be a correction from last week, when XLM rallied 10% off the back of a tweet that promised “something cool” in ten days.\n\nAD\n\nAD\n\nWas it a major network overhaul? Nope, it was a big-budget commercial with Idris Elba.\n\nIn the news: adoption!\n\nThere were more encouraging signs of crypto adoption throughout the global north this week.\n\nOn Monday, Sony subsidiary Sony Network Communications announced it was developing a blockchain network in collaboration with crypto tech firm Startale Labs. The Singapore-based joint venture will be known as Sony Network Communications Labs Pte. Ltd. It remains unclear what Sony may use the platform for.\n\nAmerican payments giant PayPal launched crypto to USD off-ramps on Tuesday. The move came after PayPal launched a crypto On Ramp integration last month, enabling direct crypto purchases to MetaMask and Ledger users. Undoubtedly, the company’s biggest move in the space this year was the announcement of its own in-house greenback-pegged stablecoin PayPal USD.\n\nFinally, on Wednesday, Taurus–a Swiss crypto fintech firm—announced an agreement with Deutsche Bank. Deutsche Bank will also use Taurus’ infrastructure to offer custody and tokenization services for its customers, according to a press release shared with Decrypt."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V0aGVyZXVtLWhvbGVza3ktdGVzdG5ldC1sYXVuY2gtZmFpbGVk0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Sep 2023 07:00:00 GMT",
        "title": "Ethereum's Holešky testnet launch hits a speed bump - Blockworks",
        "content": "Ethereum’s Goerli testnet will soon come to an end following the launch of a new testnet, dubbed Holešky.\n\nTestnets are essentially copies of blockchains and exist for developers to test their protocols and smart contracts before deploying them onto the main blockchain.\n\nToday, there are two main Ethereum testnets: Sepolia, a network designed for blockchain application development, and Goerli, used to test for validating and staking.\n\nHolešky was meant to launch on Sept.15, marking the one-year anniversary of the Ethereum proof-of-stake merge. However, the network failed to launch due to a misconfiguration and will require a relaunch.\n\nLoading Tweet..\n\nSunsetting a blockchain is a typical process. Over time, they become difficult to maintain and run nodes on due to their growing state and transaction history.\n\nDesigned to address supply issues\n\nHolešky is designed to address Goerli’s goETH supply issues, which have caused headaches for developers.\n\nGoerli goETH supply is capped at 115 million goETH total, meaning there can be no more than 115 million goETH circulating on the network.\n\nDevelopers testing on Goerli can receive goETH from a faucet. The token isn’t meant to have real-world value and exists so developers can pay gas fees when testing their products.\n\nBut with its limited supply, individual wallets began hoarding the token. This made it more difficult for developers to test their applications on the testnet.\n\nHolešky is designed to be much larger than Goerli, allowing validators to test in a more realistic on-chain environment and resolve the goETH supply issues.\n\nAccording to Parithosh Jayanthi, a developer at the Ethereum Foundation, Holešky will be able to handle a client size three times larger than that of Ethereum mainnet today.\n\n“We need to launch Holesky with such a large number of validators in order to ensure we can test the limits of the beaconchain in a safe manner,” Jayanthi tweeted.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vdS50b2RheS90aGlzLWV0aGVyZXVtLW5ldHdvcmstdXBkYXRlLWlzLWV4dHJlbWVseS1pbXBvcnRhbnTSAUdodHRwczovL3UudG9kYXkvdGhpcy1ldGhlcmV1bS1uZXR3b3JrLXVwZGF0ZS1pcy1leHRyZW1lbHktaW1wb3J0YW50P2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Sep 2023 07:00:00 GMT",
        "title": "This Ethereum Network Update Is Extremely Important - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nA new update to the Ethereum network, known as EIP-7514, is a game-changer, and here's why it matters to every investor out there.\n\nAdvertisement\n\nFirst off, what's an EIP? It stands for Ethereum Improvement Proposal, a term for a planned update. This particular one, EIP-7514, is part of the Ethereum Dencun upgrade. Its main goal? To slow down how quickly people are staking their Ethereum (ETH) and give the community more time to figure out the best way to reward those who do.\n\nWhy slow down staking? Well, if everyone rushes to stake their ETH, we could hit a point where half of all ETH is staked by May 2024, three-quarters by September 2024 and — hold your breath — 100% by December 2024. While that might sound like a good thing, it is not. Too much staking can strain the network and does not necessarily make it more secure. Plus, rewards for staking could become so small that they are not worth the effort.\n\nThe update changes how many new validators (people who process transactions and create new blocks) can join the network. Before, this number could grow exponentially, but now it will increase at a more controlled, linear rate. This is crucial because more validators mean more messages and data to handle, which could slow things down.\n\nBut what about rewards for staking? That is still up for debate. The Ethereum community is buzzing with discussions on how to best incentivize people to stake their ETH. This update buys time for those conversations to happen and for researchers to explore better solutions.\n\nSo, what's the takeaway? EIP-7514 is similar to hitting the \"pause\" button. It gives the Ethereum community a chance to catch its breath, reassess and make more informed decisions about the future. And for a network that has seen explosive growth and change since its inception, a moment to pause and reflect is not just welcome; it is essential."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy8zLWtleS1ldGhlcmV1bS1wcmljZS1tZXRyaWNzLXN1Z2dlc3QtdGhhdC1ldGgtaXMtZ2VhcmluZy11cC1mb3Itdm9sYXRpbGl0edIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Sep 2023 07:00:00 GMT",
        "title": "3 key Ether price metrics suggest that ETH is gearing up for volatility - Cointelegraph",
        "content": "Ether’s price has been dealing with some strong headwinds, and on Sept. 11, the price of the altcoin endured a critical test when it plunged to the $1,530 support level. In the days that followed, Ether (ETH) managed to stage an impressive recovery by surging 6%. This resurgence may signal a pivotal moment, following a month that had seen ETH endure losses of 16%.\n\nEven with the somewhat swift recovery, Ether’s price performance raises questions among investors about whether it has the potential to climb back to $1,850, and ETH derivatives and network activity might hold the key to this puzzle.\n\nEther/USD price index, 1-day. Source: TradingView\n\nMacroeconomic factors have played a significant role in mitigating investor pessimism, given that inflation in the United States accelerated for the second consecutive month, reaching 3.7%, according to the most recent Consumer Price Index report. Such data reinforces the belief that the U.S. government’s debt will continue to surge, compelling the Treasury to offer higher yields.\n\nScarce assets are poised to benefit from the inflationary pressure and the expansive monetary policies aimed at bridging the budget deficit. However, the cryptocurrency sector is grappling with its own set of challenges.\n\nRegulatory uncertainty and high network fees limit investors’ appetite\n\nThere’s the looming possibility of Binance facing indictment by the U.S. Department of Justice. Furthermore, Binance.US has found itself entangled in legal battles with the U.S. Securities and Exchange Commission, leading to layoffs and top executives departing from the company.\n\nBesides the regulatory hurdles faced by cryptocurrencies, the Ethereum network has witnessed a notable decline in its smart contract activity, which is at the core of its original purpose. The network still grapples with persistently high average fees, hovering above the $3 mark.\n\nEthereum network DApps rank by active addresses. Source: DappRadar\n\nOver the past 30 days, the top Ethereum decentralized applications (DApps) have seen an average 26% decrease in the number of active addresses. An exception to this trend is the Lido liquid staking project, which saw a 7% increase in its total value locked (TVL) in ETH terms during the same period. It’s worth mentioning that Lido’s success has been met with criticism due to the project’s dominance, accounting for a substantial 72% of all staked ETH.\n\nVitalik Buterin, co-founder of Ethereum, has acknowledged the need for Ethereum to become more accessible for everyday people to run nodes in order to maintain decentralization in the long term. However, Buterin does not anticipate a viable solution to this challenge within the next decade. Consequently, investors have legitimate concerns about centralization, including the influence of services like Lido.\n\nETH futures and options show reduced interest from leveraged longs\n\nA look at derivatives metrics will better explain how Ether’s professional traders are positioned in the current market conditions. Ether monthly futures typically trade at a 5 to 10% annualized premium — a situation known as contango, which is not unique to crypto markets.\n\nEther 2-month futures annualized premium. Source: Laevitas\n\nThe premium for Ether futures hit its lowest point in three weeks, standing at 2.2%, indicating a lack of demand for leveraged long positions. Interestingly, not even the 6% gain following the retest of the $1,530 support level on Sept. 11 managed to push ETH futures into the 5% neutral threshold.\n\nOne should look at the options markets to better gauge market sentiment, as the 25% delta skew can confirm whether professional traders are leaning bearish. In short, if traders expect a drop in Ether’s price, the skew metric will rise above 7%, while periods of excitement typically have a -7% skew.\n\nEther 30-day options 25% delta skew. Source: Laevitas\n\nOn Sept. 14, the Ether 25% delta skew indicator briefly shifted to a bullish stance. This shift was driven by put (sell) options trading at an 8% discount compared to similar call (buy) options. However, this sentiment waned on Sept. 15, with both call and put options trading at a similar premium. Essentially, Ether derivatives traders are displaying reduced interest in leveraged long positions, despite the successful defense of the $1,530 price level.\n\nOn one hand, Ether has potential catalysts, including requests for a spot ETH exchange-traded fund and macroeconomic factors driven by inflationary pressure. However, the dwindling use of DApps and ongoing regulatory uncertainties create a fertile ground for FUD — fear, uncertainty and doubt. This is likely to continue exerting downward pressure on Ether’s price, making a rally to $1,850 in the short to medium term appear unlikely.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1sYXVuY2hlcy1uZXctdGVzdG5ldC1ob2xlc2t5LWFsbG9jYXRlcy0xLTZiLWV0aC1mb3ItZGV2c9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Sep 2023 07:00:00 GMT",
        "title": "Ethereum launches new testnet 'Holešky,' allocates 1.6B ETH for devs - Cointelegraph",
        "content": "Ethereum developers launched a new testnet on Sept. 15. Called “Holešky,” the network is expected to be used for staking, infrastructure and protocol development, according to its developer documents. Sepolia will remain the dominant network for application development.\n\nAn initial supply of 1.6 billion Holešky testnet Ether (HETH) will be allocated to validators on Holešky’s launch day to bootstrap the network into operation, according to Ethereum developer Tim Beiko. This represents 10 times the amount of Ether (ETH) present on mainnet. Beiko stated that developers were comfortable with producing this amount because “devnets [are] regularly using 10B supply.”\n\nPreviously, the Goerli testnet was used to test new staking, infrastructure and protocol developments. Goerli is the oldest Ethereum testnet in operation, having been launched in 2018. In October, protocol developers began complaining that Goerli had too low of a supply of Goerli ETH to adequately handle testing needs. Given its large initial supply of HETH, Holešky is expected to help alleviate this problem.\n\nRelated: Ethereum Merge anniversary — 99% energy drop but centralization fears linger\n\nSince Sepolia was launched in 2021, the Ethereum team has been urging application developers to move from Goerli to Sepolia, leaving only protocol developers remaining on the old network prior to the launch of Holešky. The team plans to deprecate Goerli in January 2024. After deprecation, Goerli will be maintained for another year, then shut down entirely, according to its documentation.\n\nHolešky could see a lot of use, as Ethereum devs have an ambitious roadmap ahead of them. They intend to implement proto-danksharding, danksharding and other features they believe will reduce fees, as well as features like Verkle trees, which are intended to make running a node less expensive. Each of these features will need to be trialed on a testnet before being implemented on mainnet."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA5LzE1L3NlY29uZC1sYXJnZXN0LXN0YWJsZWNvaW4tdXNkYy1sYXVuY2hlcy1vbi1ldGhlcmV1bS1ldGgtY29tcGV0aXRvci1uZWFyLXByb3RvY29sLW5lYXIv0gF7aHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDkvMTUvc2Vjb25kLWxhcmdlc3Qtc3RhYmxlY29pbi11c2RjLWxhdW5jaGVzLW9uLWV0aGVyZXVtLWV0aC1jb21wZXRpdG9yLW5lYXItcHJvdG9jb2wtbmVhci9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Sep 2023 07:00:00 GMT",
        "title": "Second-Largest Stablecoin USDC Launches on Ethereum (ETH) Competitor NEAR Protocol (NEAR) - The Daily Hodl",
        "content": "The second-largest stablecoin by market cap, USD Coin (USDC), is now available natively on the Ethereum (ETH) competitor NEAR Protocol (NEAR).\n\nIn addition to NEAR, USDC is also available natively on Algorand (ALGO), Arbitrum ( ARB), Avalanche (AVAX), Base, Ethereum, Flow, Hedera (HBAR), Noble, Optimism (OP), Solana (SOL), Stellar (XLM), and Tron (TRX).\n\nExplains USDC’s issuer Circle,\n\n“Developers can now take advantage of the speed and scalability of the NEAR blockchain to build fast, user-friendly apps with USDC and coded in popular programming languages like JavaScript and Rust.”\n\nTop US crypto exchange Coinbase and Circle co-created USDC in 2018 and jointly managed the asset, which aims to maintain a peg to the US dollar, through the Centre Consortium until last month.\n\nIn August, Coinbase Chief Executive Brian Armstrong and Circle CEO Jeremy Allaire said that Circle would bring all of USDC’s governance and operations responsibilities in-house. The CEOs also noted that Coinbase planned to purchase an equity stake in Circle.\n\nNEAR is trading at $1.10 at time of writing. The 42nd-ranked crypto asset by market cap is up more than 1.6% in the past 24 hours.\n\nNEAR Protocol says it’s focused on scalability and stability. The project aims to allow developers to build decentralized applications at low cost.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9ldGhlcmV1bS1zdXJwYXNzZXMtYml0Y29pbi13aXRoLW92ZXItMS1taWxsaW9uLWRhaWx5LWFjdGl2ZS1hZGRyZXNzZXMv0gFjaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL2V0aGVyZXVtLXN1cnBhc3Nlcy1iaXRjb2luLXdpdGgtb3Zlci0xLW1pbGxpb24tZGFpbHktYWN0aXZlLWFkZHJlc3Nlcy8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Surpasses Bitcoin with Over 1 Million Daily Active Addresses - CryptoPotato",
        "content": "Data from the Artemis Terminal reveals that Ethereum (ETH), the second-largest blockchain network by market capitalization, has surpassed Bitcoin (BTC) in terms of daily active addresses.\n\nAccording to the latest statistics, Ethereum boasts 1.03 million daily active addresses, while Bitcoin stands at 743,800.\n\nSantiment’s Insights into Ethereum’s On-Chain Activity\n\nAccording to a report by market intelligence platform Santiment, Ethereum’s on-chain activity analysis reveals a surge in daily active addresses for Ether.\n\nOn Sept. 13, the number of daily active addresses reached approximately 1,089,893. Notably, this surge represents the second-highest daily active address count in Ethereum’s history, with the highest count recorded on Dec. 9, 2022, coinciding with Ether’s retest of its post-2021 bear market losses.\n\nData from Artemis Terminal also indicates that Ethereum now has more daily active addresses than Bitcoin, boasting 1.03 million daily active addresses, while the latter has 743,800.\n\nData from Etherscan reveals that the number of daily transactions on the Ethereum network has recorded a new all-time high, with Sept. 13 seeing 1,627,860 transactions, reflecting a growing interest and optimism. The previous peak was recorded on Sept. 17, 2020, reaching about 1,406,000.\n\nAnalysts at Santiment suggest that this increase in on-chain activity could pave the way for enhanced market volatility and potentially a recovery in the Ether market. Despite Ethereum’s recent market instability, which pushed its price below the $1,700 threshold, the cryptocurrency remains an important player in the decentralized finance (DeFi) ecosystem and the smart contract space, boasting approximately $20 billion in total value locked.\n\nEthereum Price Analysis\n\nWhile Ethereum maintains its status as a major altcoin with unique fundamentals, it remains significantly influenced by Bitcoin’s price movements. Historically, September, particularly before Bitcoin halving events, has been identified as a bearish month for the cryptocurrency market.\n\nAs a result, Ethereum’s price is expected to continue its descent in the upcoming weeks, possibly approaching the next support level of around $1.5k. Additionally, the digital asset faces substantial selling pressure due to the occurrence of weekly and daily death crosses between the 50 and 200 Moving Averages (MA)."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2JpdGNvaW4tbmV3cy9iaXRjb2luLWV0aGVyZXVtLWRhaWx5LWFjdGl2ZS1hZGRyZXNzZXMtbGFnZ2luZy10eC1jb3VudC_SAWJodHRwczovL3d3dy5uZXdzYnRjLmNvbS9iaXRjb2luLW5ld3MvYml0Y29pbi1ldGhlcmV1bS1kYWlseS1hY3RpdmUtYWRkcmVzc2VzLWxhZ2dpbmctdHgtY291bnQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin Dominates Ethereum In Daily Active Addresses Despite Lagging In TX Count - NewsBTC",
        "content": "Ethereum might be the king of smart contracts and the world’s primary hub for decentralized finance (DeFi) and non-fungible tokens (NFTs) activity but onchain data suggests that Bitcoin is ahead in user engagement, interpreted by the number of daily active users, and network activity is at acceptable, healthy levels, reading from the number of daily transactions confirmed.\n\nBitcoin Leads Ethereum In Daily Active Addresses\n\nAccording to Artemis Terminal data on September 15, Bitcoin, despite being predominantly a transactional layer, enabling the peer-to-peer (P2P) transfer of value between addresses, has more daily active users than Ethereum.\n\nThis observation is even as Ethereum serves as a conduit of value since assets can be moved, just like in Bitcoin, and a smart contract platform for deploying trustless and automated decentralized applications (dapps). Some, like Uniswap, a decentralized exchange (DEX), process billions worth of transactions every month.\n\nOn September 15, Bitcoin had over 800,000 daily active addresses (DAA), more than twice those in Ethereum, which stood at slightly over 378,000. The only time there was a slight change was on September 13, when over 1 million addresses were activated on Ethereum.\n\nThen, the number of DAA on Bitcoin also fell to around 743,000. However, the DAA on Ethereum has fallen sharply while Bitcoin has maintained an upward trajectory since late August. During this time, Ethereum’s DAA has been fluctuating heavily, as evidenced by the rise and fall on Sep 13 and through to today.\n\nEthereum Processes Over 1 Million Transactions Everyday\n\nEthereum shines in the number of daily transactions processed. When writing on September 15, the smart contract platform had processed over 1 million transactions while Bitcoin lagged, confirming less than 600,000.\n\nEven at this level, Ethereum has processed less than half of what it did on September 13, when the network processed over 2.3 million transactions. On the other hand, Bitcoin’s daily transactions have been steady, while those of Ethereum have, on average, risen over the past three months, as Artemis Terminal data shows.\n\nDAA and daily transaction count are important metrics that on-chain analysts use to analyze the level of engagement and health of public blockchains.\n\nOver the past 18 months, activity has rapidly shrunk as asset prices fall in the crypto winter. Ethereum’s drop from around $5,000 in late November 2021 to as low as $1,500 in 2022 weighed negatively on DeFi and NFT activity.\n\nAccording to DeFiLlama, the total value locked (TVL) of DeFi protocols has stabilized below $50 billion, down from around $180 billion in 2021. Meanwhile, trading volume has crashed by over 90%, dragging the value of NFT-related projects, including Immutable X and ApeCoin. To illustrate, APE is down 96% from peaks.\n\nFeature image from Canva, chart from TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMikQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOS8xNi9uZXctY29pbmJhc2UtZXRoZXJldW0tbGF5ZXItMi1zdXJnZXMtdG8tbmV3LWFsbC10aW1lLWhpZ2gtaW4tZGFpbHktdHJhbnNhY3Rpb25zLW91dHBhY2luZy1hcmJpdHJ1bS1hbmQtb3B0aW1pc20v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Sep 2023 07:00:00 GMT",
        "title": "New Coinbase Ethereum Layer-2 Surges to New All-Time High in Daily Transactions, Outpacing Arbitrum and Optimism - The Daily Hodl",
        "content": "Coinbase’s new Ethereum (ETH) layer-2 scaling solution Base set a new all-time high in terms of daily transactions on Thursday.\n\nBase skyrocketed to more than 1.8 million transactions on September 14th, shattering its previous record of around 1.4 million, according to the project’s block explorer.\n\nThe new layer-2 project actually clocked more transactions that day than the combined total processed by its rivals Arbitrum (ARB) and Optimism (OP). Arbitrum saw around 500,000 transactions on Thursday and Optimism clocked roughly 378,000, according to their respective block explorers.\n\nBase officially launched last month and is powered by Optimism. Coinbase has previously said it hopes the project helps onboard over a billion people into the crypto economy.\n\nThe exchange has noted there are no plans to launch a network token associated with Base. The project is designed to be compatible with Ethereum, Ethereum layer-2s and alternative layer-1 blockchains.\n\nOP is worth $1.38 at time of writing. The 41st-ranked crypto asset by market cap is up 2.2% in the past 24 hours and more than 6.1% in the past seven days.\n\nARB is trading for $0.788 at time of writing. The 39th-ranked crypto asset by market cap is down more than 2.1% in the past day and more than 12.5% in the past week.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiOmh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtZmFjZXMtc3VkZGVuLTEzLWJpbGxpb24tZHJhaW7SAT5odHRwczovL3UudG9kYXkvZXRoZXJldW0tZXRoLWZhY2VzLXN1ZGRlbi0xMy1iaWxsaW9uLWRyYWluP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Sep 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Faces Sudden $13 Billion Drain - U.Today",
        "content": "Advertisement\n\nEthereum, the world's second-largest cryptocurrency by market capitalization, has seen roughly $13 billion exit its market in the past few days, raising questions about investor sentiment toward the digital asset.\n\nThis comes amid a broader downturn for Ethereum, which has witnessed four consecutive weeks of declining prices.\n\nMajor shift in capital flows\n\nThe $13 billion outflow is backed by data from Glassnode's Market Realized Value Net Capital Change Breakdown metric. This metric offers a 30-day net position change for dominant assets on the cryptocurrency market, including Bitcoin (BTC), Ethereum (ETH) and stablecoins like Tether (USDT), USD Coin (USDC) and Binance USD (BUSD).\n\nThe Realized Cap, a key component of this metric, values each coin at its last transacted price. This offers a more accurate portrayal of capital flows by considering the liquidity of each coin and filtering out speculative off-chain trading. The sudden capital outflow could signal bearish sentiment among investors, prompting caution.\n\nBullish turnaround?\n\nHowever, there is another side to the story. Cryptocurrency analysts are paying close attention to a particular chart pattern on Ethereum — a hammer candle on its weekly chart.\n\nAs reported by U.Today, Jake Wujastyk, among other market watchers, points out that this formation typically appears at the end of a downtrend.\n\nA hammer candle is characterized by a short body and a long lower wick, suggesting that the asset's price may have found a market bottom and could be poised for an upward reversal.\n\nDespite the four-week slide, the hammer candle has injected a sense of optimism into the investor community, which is now discussing the possibility of a bullish turnaround."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOS8xNi90ZXRoZXItdXNkdC1tb3ZlbWVudC1zaWduYWxzLWZ1dHVyZS1idXktaW50ZXJlc3QtYXMtYml0Y29pbi1hbmQtZXRoZXJldW0tc3VwcGx5LW9uLWV4Y2hhbmdlcy1kaXBzLXNhbnRpbWVudC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Sep 2023 07:00:00 GMT",
        "title": "Tether (USDT) Movement Signals ‘Future Buy Interest’ As Bitcoin and Ethereum Supply on Exchanges Dips: Santiment - The Daily Hodl",
        "content": "Troves of the top stablecoin USDT are moving back onto crypto exchanges, a potentially bullish indicator, according to the crypto analytics firm Santiment.\n\nSantiment notes 24.1% of USDT’s total supply now sits on exchanges, the highest level since March.\n\nThe analytics firm also notes that Bitcoin (BTC) and Ethereum’s (ETH) supply on exchanges has resumed going down, indicating traders are comfortable in HODLing the top two crypto assets.\n\nSantiment calls those two trends “a golden combination” which the firm says indicates “more future buy interest.”\n\nAdditionally, the analytics firm says Bitcoin has been witnessing its highest level of unique address activity since April, with an average of 1.1 million BTC addresses sending and receiving the asset per day.\n\nHowever, Santiment says that traders are seeing the recent Bitcoin rally as an opportunity to unload their BTC holdings at a small profit.\n\nSantiment is also keeping a close watch on the issue that defunct crypto exchange FTX may start selling its massive crypto holdings. According to the analytics firm, dormant Ethereum and Binance Coin (BNB) suddenly moved this week just amid news about FTX’s possible liquidation.\n\n“The average age in which Ethereum and Binance Coin tokens have been sitting in wallets both became much younger after massive stagnation. Do you believe both coincide with the FTX liquidations and sell-offs that began this week?”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMimwFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3RvcC0zLXByaWNlLXByZWRpY3Rpb24tYml0Y29pbi1ldGhlcmV1bS1yaXBwbGUtbmV4dC1tb3ZlLWZvci1idGMtYXMtaXQtZmFjZXMtY3J1Y2lhbC1yZXNpc3RhbmNlLTIwMjMwOTE1MjAwNdIBnwFodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy90b3AtMy1wcmljZS1wcmVkaWN0aW9uLWJpdGNvaW4tZXRoZXJldW0tcmlwcGxlLW5leHQtbW92ZS1mb3ItYnRjLWFzLWl0LWZhY2VzLWNydWNpYWwtcmVzaXN0YW5jZS0yMDIzMDkxNTIwMDU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Sep 2023 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: CPI jump by was expected to stir the BTC price, and it has - FXStreet",
        "content": "Share:\n\nBitcoin price could test the $24,000 range, a 10% fall seems likely before upside potential actualizes.\n\nWith Ethereum’s 0.94 correlation with Bitcoin, ETH could follow BTC down 10% to test the $1,500 range.\n\nRipple price is due for a big move after bouncing from $0.4600 support and breaking a major trendline.\n\nBitcoin (BTC) price has reclaimed support above $26,000 and is now eyeing a breakout past $27,000. This could exit a multi-week range. The risk signal's nose-diving into the 60 range indicates there is a change in attitude. As such, it is likely that profit-taking pressure could present around $27,400 and $28,000. However, this climb seems poised as a step before tackling the psychological barrier at $30,000. If it manifests, the Ethereum (ETH) price could follow.\n\nAlso Read: Bitcoin open interest outperformed crypto markets amid BTC Spot ETF hype\n\nBitcoin price could fall before next move north\n\nBitcoin (BTC) price is trading with a bullish bias, but much remains in the balance considering there is currently no bullish fundamental to fuel a surge. Also, September has proven to be a bad month for BTC, thereby increasing the odds for a slump.\n\nAs Bitcoin price confronts the resistance presented by the downtrend line at $26,640, the odds of a pullback continue to increase as momentum fades. The falling Relative Strength Index (RSI) shows this, bolstered by the Stochastic RSI, which is at 94. This momentum indicator often moves very quickly from overbought to oversold or vice versa, and judging by its position, BTC is overbought.\n\nAccordingly, Bitcoin price could drop to the demand zone at around the $26,000 psychological level. In the dire case, the slump could see BTC breach the lower boundary of the demand zone at $24,843. The downtrend would be confirmed by a strong move under the last lower high of September 12 at $25,131.\n\nBTC/USDT 1-day chart\n\nConversely, increased buying momentum could see Bitcoin price breach the $26,640 resistance level, potentially going as far as the psychological $28,000 or higher, tagging the $29,020 roadblock. A strong move above this supplier congestion zone could clear the path into the $30,000 range.\n\nAlso Read: What to expect from Bitcoin price as $3.4 trillion stock options set to expire on Friday\n\nEthereum price could follow BTC 10% south\n\nEthereum (ETH) price found support at $1,552, bouncing 5% north to the current price of $1,619, and confronting resistance presented by the downtrend line at $1,624. Momentum is also waning for ETH, visible through the falling RSI. Aslump seems likely, and the Proof-of-Stake (PoS) token could drop 5% to $1,552 or 10% to the $1,500 psychological level.\n\nNotice its Stochastic RSI at 96, with an almost perfect track record of falling once it gets to this level. Every fall of the Stochastic RSI is mirrored by the price, therefore adding credence to the bearish thesis.\n\nETH/USDT 1-day chart\n\nOn the other hand, Ethereum price could shatter the $1,624 barricade and extend into the $1,682 resistance level. A decisive breach of the August 31 high marked by the $1,700 psychological level could clear the path for a possible reclamation of $1,791, a critical multi-month support that flipped into a resistance during the August 17 crash. This would denote a 10% rise up the ladder.\n\nAlso Read: Ethereum celebrates first anniversary of ETH Merge with 99.9% drop in energy usage\n\nRipple price bounces and shatters, what next?\n\nRipple (XRP) price boasts four successive green bars since September 12 after escaping from the suppression of the descending parallel channel. While the move is solid, confirmation for the uptrend will only happen after XRP breaks through the supply zone at $0.5373.\n\nA sustained uptrend steered by increasing buying pressure could see Ripple extend to the August 16 high at $0.6098 or in a highly bullish case escalate to the $0.6858 roadblock, close to the ambitious $0.7000 psychological level. This would indicate a 30% climb above the confirmation level.\n\nThe RSI is pointing north, supporting this outlook as it means momentum continues to rise. Similarly, the Stochastic RSI has some ground to cover before reaching its range high of 100, where it has been rejected multiple times before. ETH could correct once the Stochastic RSI tags this level.\n\nXRP/USDT 1-day chart\n\nMeanwhile, the risk of pullback remains strong considering this RSI is below 50, showing momentum, and therefore, price strength, remains low. A retracement back into the foothold of the descending parallel channel at $0.4600 could see XRP value continue dropping, likely to the range low of $0.4191 marked by the channel’s midline, or in the dire case, the support floor at $0.3562.\n\nAlso Read: Ripple (XRP) trading analysis: Bearish sentiment persists, eyes on key support"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9kaWQtZXRoZXJldW0tYWNjb21wbGlzaC1pdHMtb2JqZWN0aXZlcy1vbmUteWVhci1pbnRvLXRoZS1tZXJnZS_SAVlodHRwczovL2FtYmNyeXB0by5jb20vZGlkLWV0aGVyZXVtLWFjY29tcGxpc2gtaXRzLW9iamVjdGl2ZXMtb25lLXllYXItaW50by10aGUtbWVyZ2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Sep 2023 07:00:00 GMT",
        "title": "Did Ethereum accomplish its objectives, one year into the Merge? - AMBCrypto News",
        "content": "Ethereum’s annual carbon footprint declined significantly since The Merge.\n\nEthereum became deflationary, but there was yet to be a big impact on ETH’s value.\n\nEthereum [ETH] maximalists and much of the crypto industry celebrated the one-year anniversary of The Merge, which marked a historic shift from the proof-of-work (PoW) consensus mechanism to the proof-of-stake (PoS).\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nA greener Ethereum\n\nIntended to cut down the exponentially increasing power consumption and build an environment-friendly image for the blockchain, the results have been nothing short of astounding.\n\nAs per data from Cambridge Bitcoin Electricity Consumption Index (CBECI), Ethereum’s annual electricity usage was 0.00731 terawatt-hours (TWh) at the time of publication, a staggering 99.9% drop since the Merge. For context, this was less than Bitcoin [BTC], whose annual consumption stood at 120.31 TWh.\n\nMoreover, Ethereum now draws less power than payment company PayPal and online steaming giant Netflix.\n\nConsequently, Ethereum’s annual carbon footprints have also reduced, falling by more than 99% to 2,659 tons of CO2, according to data by Crypto Carbon Ratings Institute.\n\nThe Merge was a watershed event in the brief history of Ethereum. Under the new PoS model, staked ETH, rather than expensive hardware, secures the network and validates transactions.\n\nBy eliminating the power-guzzling devices from the scope, which competed with each other to solve complex cryptographic problems, Ethereum seemed to have made a decisive shift to sustainability and scalability.\n\nIn the long run, it could boost Ethereum growth because investors will no longer have to cope with the stigma surrounding investments in non-eco-friendly technologies.\n\nEthereum goes into deflation\n\nWhile Ethereum clearly improved its green credentials, there was more to celebrate as far as the long-term economic outlook was concerned.\n\nAccording to ultrasound.money, the Ethereum network experienced deflation following the Merge, with a net supply reduction of roughly 300,000 ETH as of this writing. At the prevailing burn rates, the net supply was shrinking at an annual rate of 0.248%.\n\nThe significance of the Merge could be gauged by the fact that had the transition not taken place, ETH’s total supply would have increased by more than 3.8 million with an annual inflation rate of 3.16%.\n\nBefore transitioning to the PoS, miners guarding the Ethereum network were issued approximately 13,000 ETH/day, according to Ethereum.org. This was because the process of mining was an economically intensive activity, which historically required high levels of ETH issuance to sustain.\n\nHowever, after switching to the PoS, mining became redundant and only staking remained a valid means of block production. Furthermore, with the PoS mechanism, a set amount of ETH is burned for each transaction. This corresponds to the minimum amount required for a transaction to be considered valid, i.e. base fee.\n\nThe long-term projections painted a happy picture for ETH. The supply will reportedly hover around the 120 million mark until August 2024. After this, the supply would steadily start declining until an equilibrium is attained.\n\nStaking interest at its peak\n\nWhile the Merge was a game changer, some key aspects of the PoS transition had to wait until the completion of the Shapella upgrade. Foremost among them was the right granted to stakers to unlock their holdings at will.\n\nWith more freedom and renewed confidence in staking activity, more and more users came forward to lock their holdings in pursuit of rewards. As per the latest update by Glassnode, the total staked supply hit a fresh peak of 29.06 million. This represented a growth of 58% since the day of Shapella execution.\n\n? #Ethereum $ETH Total Value in the ETH 2.0 Deposit Contract just reached an ATH of 29,060,084 ETH View metric:https://t.co/SzbMPqvhlb pic.twitter.com/1LZvcNI1RO — glassnode alerts (@glassnodealerts) September 15, 2023\n\nThe increased interest in staking augured well for the security of the network.\n\nSome concerns linger\n\nAmidst the optimism and bullish sentiment, it was also necessary to examine the misses. Matt Cutler, CEO & Co-Founder of blockchain infra provider Blocknative, pointed out a few concerns around decentralization of Ethereum’s core infrastructure.\n\n“In the last 14 days, ~75% of the blocks on the Ethereum network were built by just three block builders – two of which widely recognized as vertically integrated Searcher/Builders). This seems less decentralized than the ecosystem aspires to be.”\n\nRead Ethereum’s [ETH] Price Prediction 2023-24\n\nFurthermore, if one looked at ETH’s price trajectory since the Merge, there has only been an 11% increase in value, according to data from CoinMarketCap.\n\nThis implied that, contrary to common perception, major technological improvements still do not put significant upward pressure on cryptos. The market continues to be driven by sentiment around the asset, rather than its fundamentals."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vdS50b2RheS9uZWFybHktMS1taWxsaW9uLWV0aGVyZXVtLWV0aC1idXJuZWQtc2luY2UtbWVyZ2UtdXBkYXRlLWRldGFpbHPSAVNodHRwczovL3UudG9kYXkvbmVhcmx5LTEtbWlsbGlvbi1ldGhlcmV1bS1ldGgtYnVybmVkLXNpbmNlLW1lcmdlLXVwZGF0ZS1kZXRhaWxzP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Sep 2023 07:00:00 GMT",
        "title": "Nearly 1 Million Ethereum (ETH) Burned Since Merge Update: Details - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nOn Sept. 15 last year, Ethereum implemented the historic Merge upgrade, which ushered in the transition from the proof-of-work (PoW) consensus mechanism to the proof-of-stake (PoS) mechanism.\n\nAdvertisement\n\nThe upgrade undoubtedly ushered in a new era for Ethereum, making it environmentally friendly and a deflationary currency.\n\nTo commemorate the first anniversary of the pivotal upgrade, top crypto exchange Binance took to X to share the milestones reached since the Merge upgrade.\n\nBinance discusses the changes experienced since the upgrade, using an image attached to its post. Nearly one million ETH have been burned, compared to the 680,000 ETH issued.\n\nIt's been one year since the historic Ethereum merge.\n\n\n\nHere's a look at some of the key stats following the switch to proof-of-stake. pic.twitter.com/3bpNPuDQ5E — Binance (@binance) September 15, 2023\n\nAccording to the Ethereum analytics dashboard, Ultrasound Money, Ethereum has burned 980,377 ETH while minting 680,455 ETH. Consequently, supply has decreased by nearly 300,000 ETH since the switch to proof of stake.\n\nMore than 22% of ETH is now staked. Gas fees, although they were not impacted by the Merge upgrade, stood on average at 24.9 gwei.\n\nEthereum has slashed its energy requirements by 99.99%. The PoS mechanism burns a percentage of the transaction fees collected from users. Validators are paid a priority fee or a top that users add to the base to persuade validators to favor transactions. Meanwhile, the base fee is consumed, removing Ether from circulation.\n\nEthereum researcher \"Sassal ETH\" took to X to celebrate the milestones achieved by the largest smart contract network since the Merge. Aside from 980,000 ETH burned since the upgrade, 11.6 million ETH have been staked, and 362,000 new validators have been added.\n\nOn the other hand, ETH's price is only slightly up 1.9% yearly, according to CoinGecko data, and currently trades at $1,621.\n\nIn positive news, Ethereum is set to welcome its newest testnet, Holesky, as the Goerli testnet nears sunset."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9pcy1ldGhlcmV1bXMtb24tY2hhaW4tYWN0aXZpdHktY2xvc2luZy1pbi1vbi1pdHMtYXRoL9IBT2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9pcy1ldGhlcmV1bXMtb24tY2hhaW4tYWN0aXZpdHktY2xvc2luZy1pbi1vbi1pdHMtYXRoL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Sep 2023 07:00:00 GMT",
        "title": "Is Ethereum’s on-chain activity closing in on its ATH? - AMBCrypto News",
        "content": "Transactions on the blockchain spiked as ETH’s trading volume fell.\n\nNetwork growth also decreased as ETH held on to the $1,600 region.\n\nTen months after FTX collapsed, the exchange was on the lips of many players in the market again, as the court approved the liquidation of a sizable part of its assets. This reappearance ensured that the social volume and dominance around FTX jumped.\n\nRead Ethereum’s [ETH] Price Prediction 2023-2024\n\nETH takes second place\n\nHowever, according to Santiment, conversations surrounding FTX were not the only metric that rose. Interestingly, Ethereum’s [ETH] on-chain activity also reached its second-highest ever in history on 14 September.\n\n? Conversations related to #FTX have hit a 5-month high after the exchange received approval to liquidate $3.4B in #crypto. #Ethereum, in particular, has seen odd #onchain activity since, including its 2nd largest activity day of all time yesterday. https://t.co/fFXYKicnMx pic.twitter.com/lnrqYW9hmy — Santiment (@santimentfeed) September 14, 2023\n\nAs the name suggests, on-chain activity refers to blockchain transactions that exist and have been verified by validators or miners. Although on-chain activity increased, the daily trading volume of ETH fell.\n\nAt press time, Santiment showed that Ethereum’s trading volume was down to 4.73 billion. The trading volume is a different metric from on-chain volume, in the sense that the trading volume only considers transactions on exchanges.\n\nHowever, on-chain volume measures transactions involving external wallets. Therefore, the decrease in trading volume means that most of the activity on Ethereum occurred outside the shores of exchanges.\n\nTo buttress the on-chain activity point, active addresses was one metric to go to. Active addresses show the number of unique addresses involved in transactions daily. In tracking this data, this metric indicates the daily level of crowd interaction (or speculation) with a token.\n\nAs of 14 September, there were over 1.1 million active addresses on the Ethereum blockchain. This meant that a lot of distinct addresses participated in the transfer of assets over the network.\n\nOverlooked by the new entrants\n\nUnfortunately, the rise in active addresses could not save Ethereum’s network growth from a notable fall. At the time of writing, the network growth was down to 27,500. Network growth measures the number of new addresses interacting with a network.\n\nTherefore, the chart above means new addresses were not the main players in the rise in on-chain activity. The decrease also means that user adoption of ETH was very low. For ETH, the increase in network activity did not do much to change its price action.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nAt press time, ETH’s price was $1,627, similar to what it was at the beginning of the week. Also, it is also interesting to see that the FUD around ETH, being one of the cryptocurrencies listed for FTX liquidation, has failed to materialize into a price plunge.\n\nHowever, market participants may need to watch out for the timeframe FTX sets for liquidation. As it stood at press time, it was likely that ETH would continue to consolidate around $1,600."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZmluYm9sZC5jb20vZXRoZXJldW0tbWVyZ2UtMS15ZWFyLWFubml2ZXJzYXJ5LTQta2V5LWluc2lnaHRzLXlvdS1uZWVkLXRvLWtub3cv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Merge 1-year anniversary: 4 key insights you need to know - Finbold - Finance in Bold",
        "content": "One year ago, on September 15, Ethereum (ETH) went through a major update that changed the Ethereum Network in its roots by ultimately moving from a Proof of Work (PoW) to a Proof of Stake (PoS) system.\n\nThis update was called ‘The Merge’, as it merged the Beacon Chain with Ethereum’s mainnet, resulting in the Ethereum 2.0 network, which is 99% less costly to keep than the old network with massive consumption of energy and electronic device waste.\n\nWith a lower maintenance cost for validators, The Merge also decreased validators’ block rewards from supply inflation, dramatically impacting ETH’s tokenomics for what enthusiasts started calling “ultra-sound money”.\n\nTogether with the London Upgrade — that happened one year before The Merge, in August 2021 — these changes can be seen in economic analysis, such as the price ETH would trade at if Ethereum reaches its all-time high market cap.\n\nETH tokenomics data since The Merge\n\nData retrieved by Finbold on September 15 from ultrasound.money shows that 980,541 ETH were burned in the 365 days since The Merge.\n\nEthereum economic data since The Merge. Source: ultrasound.money\n\nMoreover, as only 680,724 ETH were issued through validators’ block subsidy, Ethereum’s circulating supply decreased by close to 300,000 ETH in the period. Resulting in a 0.25% deflation due to the mentioned updates.\n\nEthereum price analysis\n\nMeanwhile, Ethereum is trading at $1,622 by press time. With approximately 10% in yearly gains after The Merge on September 15, 2022.\n\nETH 1-year price chart. Source: Finbold\n\nThis positive outcome for Ethereum comes amid a mostly bearish sentiment in the cryptocurrency market in the last year, which makes many analysts believe that crypto investors are yet to see the long-term effects of The Merge for the second largest crypto by market cap.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0tbWVyZ2UtaXMtb25lLWhlcmUtYXJlLXRoZS1oaWdobGlnaHRzLXNvLWZhci_SAVZodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2V0aGVyZXVtLW1lcmdlLWlzLW9uZS1oZXJlLWFyZS10aGUtaGlnaGxpZ2h0cy1zby1mYXIvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Merge Is One: Here Are The Highlights So Far - NewsBTC",
        "content": "It has been a year since the Merge took place, and as expected, the world’s second largest cryptocurrency, Ethereum, has experienced many changes since then. What are some of them? Let’s take a look.\n\nOne Year In: How Has Ethereum Changed?\n\nAccording to a prominent figure in the Ethereum community, Sassal, 980,000 ETH have been burned since Ethereum transitioned from a proof-of-work (PoW) consensus to proof-of-stake (PoS).\n\nAhead of the Merge, Ethereum had implemented a significant upgrade known as the London hard fork. This introduced a fee-burning mechanism with transaction base fees being burned immediately after a transaction is processed.\n\nThis move was geared towards making Ether deflationary, considering that some tokens are removed permanently from circulation. Ethereum supply is down by 0.25% since the Merge took place.\n\nFurthermore, the Merge resulted in the network being secured by validators who stake their ETH as against Miners, who were the backbone of the network under the PoW consensus. In line with this, over 11.6 million ETH (since the Merge) has been staked to secure the network and also earn passive income in return.\n\nETH market cap at $196 billion on the weekend chart: TradingView.com\n\nThe top stakers include the staking platform Lido DAO which has a market share of 22.64%, according to data from Dune Analytics. Other top stakers include exchanges like Coinbase, Binance, and Kraken.\n\nMeanwhile, the number of validators on the network has significantly increased since the Merge, with 362,000 new validators joining the network.\n\nDown In Valuation But Not Value\n\nEthereum’s price has increased by close to 11% from a year ago. However, many may consider this insignificant for a token that hit an all-time high of $4,891 the previous year. Nevertheless, there are positives to take from the Merge, as Ethereum has undoubtedly become more valuable since it occurred despite the current bear market woes.\n\nA crypto analyst noted that ETH’s annual inflation rate has decreased since the Merge, and trading activity on Ethereum’s layer-2 chains has also increased significantly. That would suggest that more people are being onboarded into the Ethereum ecosystem.\n\nAccording to him, Ethereum’s fundamentals are also at an all-time high, as there are factors that show that the ecosystem is stable and healthy. One of them happens to be the fact that traditional financial (TradFi) institutions are taking an interest in ETH.\n\nCathie Wood’s ARK Invest recently filed to offer an Ethereum Spot ETF (a first of its kind). This is alongside other institutions that have filed to offer an Ethereum futures ETF (of which ARK Invest happens to be among them).\n\nFeatured image from WAYA Media\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS10aGlzLWlzLXdoeS1ldGhzLWxvbmctdGVybS1wb3RlbnRpYWwtbG9va3MtcHJvbWlzaW5nL9IBWGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS10aGlzLWlzLXdoeS1ldGhzLWxvbmctdGVybS1wb3RlbnRpYWwtbG9va3MtcHJvbWlzaW5nL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Sep 2023 07:00:00 GMT",
        "title": "Ethereum: Why ETH’s long-term potential looks promising - AMBCrypto News",
        "content": "Ethereum protocol layer receives a substantial amount of FriendTech revenue.\n\nWhy the protocol layer’s ability to tap into WEB3 value underscores ETH’s long-term potential.\n\nYou may have heard the phrase “the crypto market is still in its early stages.” But have you ever wondered how successful Ethereum [ETH] could be when the market fully realizes its potential?\n\nIs your portfolio green? Check out the Ethereum Profit Calculator\n\nEthereum was still focused on the long-term goal of mass adoption. Achieving this goal could generate robust growth from a revenue point of view. The reason why there are such high expectations for Ethereum is because layer 1 networks are built to secure value in WEB3. A departure from the WEB2 approach which mainly provides value to the application layer.\n\nTo demonstrate how Ethereum’s protocol layer has been benefitting, the WEB3 Academy conducted an analysis of how the blockchain is benefiting from Base and FriendTech. The latter is a WEB3 social application that is among the fastest growing projects and it operates on the Base network. However, the latter relies on Ethereum to process transactions.\n\nAccording to WEB3 Academy’s breakdown of FriendTech’s revenue sharing, Ethereum receives a substantial amount.\n\nHow FriendTech’s $148 Million Volume & 4.1 Million Transactions Benefitted an Entire Ecosystem. ? Onchain Value Accrual: THE MOST important concept in web3, that nobody is talking about. Bookmark this tweet & come back to it because this is the most important lesson we will… pic.twitter.com/eQGKKrBm7B — Web3 Academy ? (@web3academy_) September 14, 2023\n\nThe same analysis suggested that Ethereum may experience exponential dApp growth in the next 10 years. If that is the case, Ethereum holders and stakers stand to reap the benefits over time. In other words, ETH’s long-term prospects look quite promising especially if it achieves mass adoption.\n\nAssessing key Ethereum growth metrics\n\nUnsurprisingly, the supply of ETH held by top addresses has been growing steadily over the last 12 months. In fact, it is now at its highest point so far this year. In contrast, network growth slowed down largely reflecting the overall short-term headwinds across the market. The Ethereum network growth figure, at the time of writing, was at its lowest level in the last 12 months.\n\nNote that Ethereum’s network growth is subject to prevailing market conditions. It is often high during highly volatile market conditions, especially during bullish periods which also tend to attract more projects.\n\nHow many are 1,10,100 ETHs worth today\n\nSpeaking of projects, a growing number of dApps should in theory provide a higher amount of fees over time assuming all factors are held constant. However, it is often not linear growth since fees are influenced by high and low swings in network activity.\n\nFor example, Ethereum had its highest fees in May within the last 12 months. The daily fees generated at the May highs were around 16,438 ETH, a stark contrast to the 2462 ETH fees achieved in the last 24 hours."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vY29pbnBlZGlhLm9yZy9hbHRjb2luL3hycC1lbWVyZ2VzLWFzLXRoZS1wcmVmZXJyZWQtY3J5cHRvY3VycmVuY3ktb3Zlci1iaXRjb2luLWFuZC1ldGhlcmV1bS1pbi1qYXBhbi1zdHVkeS1yZXZlYWxlZC_SAYABaHR0cHM6Ly9jb2lucGVkaWEub3JnL2FsdGNvaW4veHJwLWVtZXJnZXMtYXMtdGhlLXByZWZlcnJlZC1jcnlwdG9jdXJyZW5jeS1vdmVyLWJpdGNvaW4tYW5kLWV0aGVyZXVtLWluLWphcGFuLXN0dWR5LXJldmVhbGVkL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Sep 2023 07:00:00 GMT",
        "title": "XRP Outshines Bitcoin and Ethereum, Becomes Japan’s Preferred Cryptocurrency - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nStory Highlights XRP has become Japan's preferred cryptocurrency, outpacing Bitcoin and Ethereum.\n\nThis is due to Ripple's strategic partnerships with Japanese companies, such as SBI Holdings.\n\nXRP is also gaining popularity in South Korea, where it often outperforms Bitcoin on major exchanges.\n\nA recent study conducted by the City University of Hong Kong has revealed that XRP has swiftly become Japan’s preferred cryptocurrency, outpacing both Bitcoin and Ethereum. This digital currency, closely associated with Ripple, has not only showcased significant trading volumes but has also begun to redefine Japan’s cryptocurrency landscape.\n\nXRP Takes the Lead!\n\nIn February, a significant shift occurred in Japan’s crypto market, XRP emerged as the frontrunner, boasting an impre­ssive trading volume of 1.36 billion units. This surge can be attributed to Ripple’s strategic partne­rship with SBI Holdings, Japan’s largest venture capital fund.\n\nStrategic Partnerships for the Win\n\nRipple’s strategic alliances haven’t just strengthened its foothold in Japan; they have also bolstered the allure of XRP. A noteworthy development has arisen with SBI Remit, a subsidiary of SBI VC Trade, planning to utilize XRP for cross-border payments. This move further enhances the utility of this digital asset.\n\nIt’s worth noting that while Bitcoin still maintains a larger trading volume in yen terms, XRP’s significant ascent is undeniable.\n\nRead More: Has Japan Adopted Cryptocurrency the Same Way as the West?\n\nEveryone is Gaga Over XRP\n\nBITMAX, a Japan-based e­xchange, conducted a survey re­vealing that 25% of respondents now re­gard XRP as their preferred cryptocurrency. This surge in popularity can be attributed to the ripple effect of expanding global partnerships among major corporations and government endorsements for its swift and secure cross-border payment transactions.\n\nIn addition, the survey results reveal that Bitcoin has a slight le­ad at 26%, whereas Ethere­um significantly trails behind with only 9% of respondents favoring it as their preferred digital asse­t. This emerging pattern strongly suggests that Japanese investors are actively expanding their cryptocurre­ncy portfolios.\n\nXRP’s Impact Extends to South Korea\n\nXRP’s influence goes beyond Japan, highlighting its strong presence and consistent trading volumes in South Korea. In fact, it often outperforms Bitcoin on major South Korean crypto e­xchanges, solidifying XRP as a global player in the cryptocurre­ncy arena.\n\nXRP’s surging trading volumes and growing favor among inve­stors are reshaping the crypto landscape by challenging the established dominance of Bitcoin and Ethere­um.\n\nRead More: Top Reasons Why XRP is About to Become Way Bigger Than Everyone Thinks"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8venljcnlwdG8uY29tL2V0aGVyZXVtLWRldmVsb3BlcnMtZGVidXQtbmV3LXRlc3RuZXQtaG9sZXNreS1vbi10aGUtbWVyZ2UtYW5uaXZlcnNhcnkv0gFgaHR0cHM6Ly96eWNyeXB0by5jb20vZXRoZXJldW0tZGV2ZWxvcGVycy1kZWJ1dC1uZXctdGVzdG5ldC1ob2xlc2t5LW9uLXRoZS1tZXJnZS1hbm5pdmVyc2FyeS8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Developers Debut New Testnet Holesky On The ‘Merge’ Anniversary - ZyCrypto",
        "content": "Advertisement\n\nThe Ethereum blockchain has ushered in a new testnet called Holesky, one year after its monumental transition to a proof-of-stake consensus algorithm.\n\nThe newly launched test network, initially referred to as Holli, aims to enhance the main Ethereum network’s testing capabilities by making it twice as large.\n\nEnter, Holesky\n\nEthereum core developers on September 15 launched the Holesky test network.\n\nInitial blocks proposed on Holesky were seen today through a blockchain explorer created to monitor the new test net on beaconcha.in.\n\nTest networks are like duplicates of the original Ethereum blockchain, but developers use them for testing new applications and fixing bugs without influencing the mainnet.\n\nAdvertisement\n\nThe rollout of Holesky coincides with the first anniversary of the Ethereum Merge event. The Merge was executed on September 15, 2022 — an event that saw the Ethereum mainnet merging with the Beacon Chain. With the historic upgrade, Ethereum made a switch from its original proof-of-work mining system to a more energy-efficient proof-of-stake model.\n\nEthereum’s ecosystem presently has two main test networks: Goerli and Sepolia. However, now that Holesky introduced, Ethereum will wave goodbye to Goerli, in the first half of 2024. Holesky will then become Ethereum’s largest existing test net with at least 1.4 million validators, compared to the mainnet’s 700,000.\n\nOne of the distinguishing characteristics of Holesky is the envisioned provision of roughly 1.6 billion test network ether. Developers decided not to lower that figure to correspond to the Ethereum mainnet’s 120 million ETH supply. This significant supply is intended to fix obstacles developers encounter when procuring testnet ETH on the primary testnets. The huge amount of testnet ether will give Ethereum’s developer community easier access to testing smart contracts on Holesky.\n\nETH Price Unmoved\n\nThe price of the second-largest cryptocurrency by market cap, ether, remained relatively unstirred by the Holesky launch news.\n\nETH was currently trading just above $1,636, down slightly less than a percentage point over the past 24 hours. Bitcoin has behaved similarly, shedding 1.1% of its value during the same timeframe to change hands at $26,583.72."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vYmxvZy5iaXRmaW5leC5jb20vbWVkaWEtcmVsZWFzZXMvYml0ZmluZXgtdW52ZWlscy1zdXBwb3J0LWZvci1mb3JrZWQtZXRoZXJldW0tcHJvb2Ytb2Ytd29yay1ldGh3L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Sep 2023 07:00:00 GMT",
        "title": "Bitfinex Unveils Support for Forked Ethereum Proof-of-Work (ETHW) - Bitfinex blog - Bitfinex",
        "content": "Bitfinex Unveils Support for Forked Ethereum Proof-of-Work (ETHW)\n\nROAD TOWN, British Virgin Islands, September 16 2022 – Bitfinex, a state-of-the-art digital token trading platform, will support the Ethereum Proof-of-Work fork as the exchange provides its user base with an optimal trading experience after the Merge.\n\nThe Ethereum Merge’s successful transition from proof of work to proof of stake, which took place this week, represents a monumental milestone in the evolution of the digital token economy. The Merge has also resulted in a forked, Proof-of-Work, Ethereum chain.\n\nETHW deposits and withdrawals are now open on Bitfinex after the token was listed on the platform on 15/09/22.\n\n“We are delighted to announce our support for Ethereum Proof-of-Work,” said Paolo Ardoino, CTO at Bitfinex. “As an exchange we always strive to provide our user base with a choice of digital tokens to trade and an optimal trading experience.”\n\nBitfinex customers with an Ethereum (ETH) balance in their account at the time of the Merge snapshot (Block 15537393) will have received forked Ethereum Proof-of-Work (ETHW) digital tokens.\n\nCustomers have been credited ETHW, and the ETHW:USD market will be open as of 15/09/22 at 9:15 PM UTC for trading. Deposits and withdrawals will commence for ETHW in the coming days. We shall update you accordingly.\n\nFinanced positions\n\nAs explained in a previous post, the following scenarios will apply for users who engage in peer-to-peer financing activities using ETH on the Bitfinex platform.\n\nCustomers with Margin short ETH positions will be debited an equivalent amount of the forked token from their margin wallet.\n\nCustomers with Margin long ETH positions will be credited an equivalent amount of the forked token to their margin wallet.\n\nCustomers who are lending their ETH will be credited an equivalent amount of the forked token to their wallet balance\n\n\n\nCustomers will have until October 15 2022 to settle their negative balances. A failure to timely settle negative balances may result in Bitfinex settling those balances at the prevailing market rates, as determined by Bitfinex in its sole discretion.\n\nYou can find more information relating to EthereumPoW at https://ethereumpow.org.\n\n*All users of www.bitfinex.com are subject to Bitfinex’s terms of service [Link to the TOS] (“TOS”). Please note that U.S. persons (as defined in the TOS), among other prohibited persons (as defined in the TOS), are strictly prohibited from directly or indirectly holding, owning or operating an Account (as defined in the TOS) on www.bitfinex.com.\n\n###\n\nAbout Bitfinex\n\nFounded in 2012, Bitfinex is a digital token trading platform offering state-of-the-art services for traders and global liquidity providers. In addition to a suite of advanced trading features and charting tools, Bitfinex provides access to peer-to-peer financing, an OTC market and margin trading for a wide selection of digital tokens. Bitfinex’s strategy focuses on providing unparalleled support, tools, and innovation for experienced traders and liquidity providers around the world. Visit www.bitfinex.com to learn more.\n\nMedia Contact for Bitfinex\n\nJoe Morgan\n\nSenior PR Manager\n\n[email protected]"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiNGh0dHBzOi8vZGVjcnlwdC5jby9yZXNvdXJjZXMvd2hhdC1hcmUtd3JhcHBlZC10b2tlbnPSATpodHRwczovL2RlY3J5cHQuY28vcmVzb3VyY2VzL3doYXQtYXJlLXdyYXBwZWQtdG9rZW5zP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Sep 2023 07:00:00 GMT",
        "title": "What Are Wrapped Tokens? How They Work and What They’re Used For - Decrypt",
        "content": "In brief Wrapped tokens are a way to use cryptocurrencies such as Bitcoin or Dogecoin on blockchains other than the blockchain they were originally built on.\n\nWrapped tokens are backed 1:1 by their underlying asset, which is stored in a digital vault.\n\nWrapped tokens are a solution to the problem of blockchain interoperability.\n\nYour Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nOne way to understand blockchains such as Bitcoin and Ethereum is as separate distributed databases. As blockchains are separate, they can’t communicate easily with each other.\n\nYou can’t use your Bitcoin directly on the Ethereum blockchain, because only the Bitcoin blockchain “knows” that you hold Bitcoin.\n\nAD\n\nAD\n\nWrapped tokens were created as a solution to this problem. With wrapped tokens, you can effectively move assets between blockchains and use them across the crypto ecosystem.\n\nWhat are wrapped tokens?\n\nWrapped tokens are assets that allow the value of a native asset from one blockchain to transfer to another blockchain. One of the best-known wrapped tokens is Wrapped Bitcoin (WBTC). WBTC is pegged 1:1 to the price of Bitcoin (BTC), so that one WBTC should always equal one BTC. But unlike BTC, WBTC is available as ERC-20 or TRC-20 tokens, which means it can be used and traded on the Ethereum and Tron blockchains.\n\nIn a way, wrapped tokens are similar to stablecoins such as USDT, which follow the price of the U.S. dollar. Just as one WBTC is pegged to the price of one BTC, one USDT is pegged to the price of $1.\n\nWhat makes a wrapped token a wrapped token, though, is not just whether it is pegged 1:1 to the price of another asset. It's the technology behind it and the way in which its value is backed and maintained.\n\nDid you know? On January 14, 2021, CoinMarketCap briefly (and erroneously) listed the market cap of WBTC as 432 quadrillion US dollars, or more than 1,000 times the total estimated wealth in the world, according to the\n\nFinancial Times.\n\nHow do wrapped tokens work?\n\nWrapped tokens are created and destroyed by a process called “minting” and “burning.” To mint a wrapped token such as WBTC, the underlying asset, in this case BTC, is sent to a custodian who stores the BTC in a digital vault. Once the underlying BTC has been locked away, an equivalent amount of WBTC can be minted.\n\nAD\n\nAD\n\nThis process can also be understood as “wrapping.” The underlying asset is “wrapped up” in a digital vault using a smart contract, and a newly wrapped asset is minted for use on another blockchain.\n\nTo burn WBTC, the same process is followed, but in reverse. The WBTC is removed from circulation, and the equivalent amount of BTC is released from the digital vault and allowed back into circulation.\n\nJust as minting wrapped tokens can be thought of as “wrapping” the underlying asset to create a token of equivalent value for use on another blockchain, burning wrapped tokens can be thought of as “unwrapping” the underlying asset.\n\nThis process of minting and burning, or wrapping and unwrapping, means that all wrapped tokens, from WBTC to renDOGE (a wrapped form of Dogecoin), are backed by an equivalent amount of their underlying currency. For every 100 renDOGE that has been minted, 100 DOGE are being held to back the value of the wrapped token.\n\nWhat’s so special about wrapped tokens?\n\nWrapped tokens such as WBTC offer interoperability between blockchains so that people can move assets easily and take advantage of features and applications on other blockchains. Those advantages might be faster transaction times, lower fees, or yield farming opportunities.\n\nWhile the amount of WBTC in circulation has been steadily increasing, bridges—a solution which allows you to wrap your own tokens to move them across blockchains—have been proliferating.\n\nThis comes with some risks: bridges have been the target of a number of hacks, and Ethereum creator Vitalik Buterin wrote in January 2022 that their security vulnerabilities were why he is \"pessimistic about cross-chain applications.\"\n\nExamples of wrapped tokens\n\n🎁₿ WBTC - Project that wraps BTC for use on the Ethereum blockchain; operated by the WBTC DAO and started jointly by Kyber, Ren, and BitGo\n\n🎁Ξ WETH - Wrapped ETH, or WETH, was created by a group of projects run by 0x labs and is an ERC-20 version of Ethereum that can be used as an asset on DeFi protocols\n\n🐕 renDOGE - Wrapped version of Dogecoin that can be minted using the RenBridge on the RenVM protocol\n\nThe future of wrapped tokens\n\nAchieving interoperability between different blockchains is a challenge for the industry.\n\nAD\n\nAD\n\nOne problem is that as more blockchains are created, the number of bridges needed to ensure that assets on a blockchain can easily transfer to every other blockchain increases exponentially.\n\nSolutions are being developed to try to make bridging assets between blockchains easier and more efficient. One way to do this is with a bridge hub, which refers to a central bridge that all other blockchains bridge to. An example of this is Darwinia, a cross-chain bridge hub being built on Substrate.\n\nFor the foreseeable future, at least, bridges and wrapped tokens are set to continue to be a central part of the solution for interoperability."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL2lzLWV0aGVyZXVtcy1laXAtNzUxNC1hLWRvdWJsZS1lZGdlZC1zd29yZC_SAUpodHRwczovL2NvaW5wZWRpYS5vcmcvbmV3cy9pcy1ldGhlcmV1bXMtZWlwLTc1MTQtYS1kb3VibGUtZWRnZWQtc3dvcmQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Puts the Brakes on Staking with EIP-7514; Here’s Why - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nStory Highlights EIP-7514 is an Ethereum Improvement Proposal that aims to slow down the rate of staking on the Ethereum network.\n\nThe network could reach a point where half of its Ether is staked by May 2024 and 100% by December 2024.\n\nThis could cause problems such as increased network strain and diluted staking rewards.\n\nThe Ethereum network is no stranger to upgrades and improvements, but the latest Ethereum Improvement Proposal (EIP-7514) has the crypto community buzzing like never before. As part of the Ethereum Dencun upgrade, EIP-7514 aims to put a brake on the current speed of staking on the Ethereum network. The proposition may sound dull, but hang on; there’s more than meets the eye.\n\nHot off the press, some last min additions for Deneb:\n\n\n\nEIP-7514 (Add max epoch activation churn limit). Target churn is 8\n\nEIP-7516 (BLOBBASEFEE opcode)\n\n\n\nThey shouldn't delay upcoming devnet9 and Deneb — terence.eth (@terencechain) September 14, 2023\n\nWhat’s the Fuss About EIP-7514?\n\nFirstly, what even is an EIP? For the uninitiated, EIP stands for Ethereum Improvement Proposal. Think of it as a blueprint for changes or additions to the Ethereum network. EIP-7514, in particular, aims to decelerate the rate at which ETH holders are staking their assets.\n\nIf the current rate of staking continues unabated, the Ethereum network could potentially reach a point where half of its Ether is staked by May 2024. More alarmingly, that number could hit 100% by December 2024. While this may seem like robust community participation, it brings along its own set of problems—increased network strain and diluted staking rewards, which could disincentivize long-term staking.\n\nRead More: Ethereum Daily Active Addresses Surge: ETH Price to Rebound Soon?\n\nBefore EIP-7514, the number of validators (these are the good folks who process your transactions and create new blocks) could grow exponentially. However, more validators mean more messages and data to process, which could bottleneck the network.\n\nEthereum Community Response\n\nCrypto influencer Dankard Feist tweeted in favor, arguing that the lower churn limit afforded by the EIP would give the community the time needed to research, debate, and implement solutions.\n\nMy reasoning on why I'm for EIP-7514. It is currently unclear if (especially liquid) staking will keep growing indefinitely. In the case that the withdrawal queue does not empty over the next few months, the lower churn limit will give the Ethereum community the time needed to… — Dankrad Feist (@dankrad) September 14, 2023\n\nOn the flip side, Ethereum investor Ryan Berckman criticized the rushed nature of the proposal, claiming it could compromise the network’s neutrality.\n\nMy understanding is that EIP-7514 was considered too quickly, and the proposed urgency to cap validator growth doesn't align with the steadily shrinking activation queue.\n\n\n\nEIP-7514 should be excluded https://t.co/l2yK5srNN9 pic.twitter.com/ZMu4BoiR00 — Ryan Berckmans ryanb.eth🦇🔊 (@ryanberckmans) September 14, 2023\n\nThe Ethereum network has been on a roller-coaster ride since its inception, and EIP-7514 could be considered as hitting the “pause” button. It grants the Ethereum community the breathing room needed to make more informed decisions about its future.\n\nAlso Read: How did Bitcoin and Ethereum React to the CPI Report?\n\nBut, as with all things crypto, there’s a downside. Fast-tracking changes to staking parameters could compromise Ethereum’s commitment to maximum neutrality, a unique asset in an increasingly competitive crypto landscape."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMikQFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2NyeXB0b2N1cnJlbmNpZXMtcHJpY2UtcHJlZGljdGlvbi1ldGhlcmV1bS1iaXRjb2luLWJpbmFuY2UtZXVyb3BlYW4td3JhcC0xNS1zZXB0ZW1iZXItMjAyMzA5MTUxMjQz0gGVAWh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9hbXAvY3J5cHRvY3VycmVuY2llcy9uZXdzL2NyeXB0b2N1cnJlbmNpZXMtcHJpY2UtcHJlZGljdGlvbi1ldGhlcmV1bS1iaXRjb2luLWJpbmFuY2UtZXVyb3BlYW4td3JhcC0xNS1zZXB0ZW1iZXItMjAyMzA5MTUxMjQz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Sep 2023 07:00:00 GMT",
        "title": "Cryptocurrencies Price Prediction: Ethereum, Bitcoin & Binance – European Wrap 15 September - FXStreet",
        "content": "Share:\n\nThe great Ethereum Merge completes its first anniversary on Friday, September 15. The network’s energy usage has dropped drastically over the past year since Ethereum’s transition away from proof-of-work to proof-of-stake.\n\nThe blockchain network’s core developers concluded their “all core devs” call early on Friday, with some key changes like the inclusion of a new Ethereum Improvement Proposal, EIP-7514. The Ethereum Merge, the transition from proof-of-work to proof-of-stake, reduced energy usage by 99.9% on the blockchain.\n\nBitcoin price remains unfazed by the US CPI announcement on September 13 and continues to move in a range. The weekly chart, however, shows a potential short-term recovery rally that could set the stage for a steep correction.\n\nBitcoin price action holds the potential for history to repeat or at least rhyme. On the daily chart, BTC currently trades at $26,257 and is supported by the Momentum Reversal Indicator’s (MRI) support level depicted in green dots at $25,188.\n\nThe Securities & Exchange Commission (SEC) has accused Binance US of violation of a prior consent order. According to a court filing released Thursday, the US securities regulator argues that the crypto trading platform has failed to cooperate with the ongoing probe over alleged unregistered securities offerings.\n\nBinance’s native token, BNB’s price remained unaffected by the development in the lawsuit. In June, the US securities regulator filed a lawsuit against Binance entities and founder Changpeng Zhao (CZ) with 13 charges. These include operating unregistered exchanges, broker-dealers and clearing agencies, misrepresenting trading controls and oversight on the Binance US platform and the unregistered offer and sale of securities."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ob3ctZXRoZXJldW1zLXByaWNlcy1yZWFjdGVkLWFmdGVyLWludHJpZ3VpbmctcmVjb3JkLWhpZ2gtc3Bpa2Uv0gFaaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2hvdy1ldGhlcmV1bXMtcHJpY2VzLXJlYWN0ZWQtYWZ0ZXItaW50cmlndWluZy1yZWNvcmQtaGlnaC1zcGlrZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Sep 2023 07:00:00 GMT",
        "title": "How Ethereum’s prices reacted after intriguing record-high spike - AMBCrypto News",
        "content": "Ethereum’s transactions and active users spiked to a record high.\n\nETH was on a four-day consecutive price uptrend at press time, trading above $1,600.\n\nAs per a 13 September post on X (formerly Twitter), the number of active Ethereum [ETH] users surged to over 1 million. How has this surge affected other important metrics?\n\nRead Ethereum’s [ETH] Price Prediction 2023-24\n\nEthereum active addresses witness a brief spike\n\nAccording to an analysis of the active user metric, Ethereum’s surge to 1 million active addresses was a stark contrast to the typical average of approximately 300,000 active users that Ethereum had been experiencing prior to the spike.\n\nSomething weird is going on with daily active Ethereum addresses. from their usual 300-400K to over 1M yesterday. pic.twitter.com/nXgW6ydCES — Patrick Scott | Dynamo DeFi (@Dynamo_Patrick) September 14, 2023\n\nHowever, as of this writing, the number of active users had returned to its previous range. The observable count of active addresses stood at over 350,000 at press time. Was there any impact on other metrics?\n\nEthereum’s transactions and volume analysis\n\nAccording to the transaction data from DefiLlama, there was a noticeable increase in the number of active Ethereum users that correlated with a surge in transactions.\n\nThe transaction chart indicated that on the same day as the spike in active users, the number of transactions surged to over 1.6 million. Prior to this surge, the transaction count typically ranged from 800,000 to 1 million.\n\nNotably, this peak marked the highest transaction volume recorded so far this year.\n\nHowever, similar to the active users, the transaction count has since decreased. As of this writing, the number of transactions was approximately 1 million.\n\nInterestingly, a review of the volume trend revealed that it remained relatively unaffected by the spike in active users and transactions. It displayed a stable, non-spiky pattern and currently stands at around $754 million.\n\nETH on an uptrend of its own\n\nExamining ETH’s price trend using a daily timeframe chart revealed that it has been following its upward trajectory. The chart indicated a four-day streak of consecutive gains, following a period of stagnant movement and a significant dip.\n\nHow much are 1,10,100 ETHs worth today?\n\nAs of this writing, Ethereum was trading at approximately $1,630, showing a slight uptick of less than 1%. It’s worth noting that although the Relative Strength Index (RSI) still indicated a position below the neutral line, the ongoing price uptrend had pushed it higher.\n\nHowever, as of the time of this update, the exact cause behind the surge in transactions and active users remained unknown."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1yZWFjaGVzLW5ldy1pbXBvcnRhbnQtbWlsZXN0b25lLWFtb25nLWludmVzdG9ycy1kZXRhaWxz0gFUaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtLXJlYWNoZXMtbmV3LWltcG9ydGFudC1taWxlc3RvbmUtYW1vbmctaW52ZXN0b3JzLWRldGFpbHM_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Reaches New Important Milestone Among Investors: Details - U.Today",
        "content": "The open interest metric refers to the number of futures contracts/options which are held by investors' inactive positions, therefore a rising value indicates their growing interest and an inflow of additional money into the market — Ethereum in this particular case. High open interest also indicates high market activity since traders keep opening new positions.\n\nAdvertisement\n\nA recent X post published by on-chain data vendor Glassnode shows that ETH futures OI has reached a one-month high of $125,397,615.99 on one of the leading crypto exchanges, Bitfinex.\n\nMost likely, high open interest indicates a bullish trend, however, sometimes it may signify an upcoming change of trends from bullish to bearish as well, if the IO metric becomes too high.\n\n📈 #Ethereum $ETH Futures Contracts Open Interest just reached a 1-month high of $125,397,615.99 on #Bitfinex\n\n\n\nPrevious 1-month high of $125,329,725.40 was observed on 15 September 2023\n\n\n\nView metric:https://t.co/FVI1qN3bra pic.twitter.com/MNnAGc867P — glassnode alerts (@glassnodealerts) September 16, 2023\n\nAside from that, Glassnode also registered an increase in new ETH investors. According to another X post published earlier today, the total count of ETH non-zero wallets has surged to an all-time high of 106,018,155.\n\nOver the past week, the Ethereum price has demonstrated a rise by more than 7%, surging from $1,538 to the $1,650 level. However, earlier today, ETH saw a sudden marginal decline and is now trading at $1,634."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9hYm4tYW1yby1pc3N1ZXMtNW0tZGlnaXRhbC1ncmVlbi1ib25kLXRocm91Z2gtcG9seWdvbi1wb3dlcmVkLXRva2VuedIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Sep 2023 07:00:00 GMT",
        "title": "ABN Amro issues 5M euro digital green bond through Polygon-powered Tokeny - Cointelegraph",
        "content": "Dutch bank ABN Amro has carried out a digital green bond offering that made use of Polygon’s layer-2 Ethereum scaling technology to raise 5 million euros ($5.3 million).\n\nThe green bond was issued as an ERC-3643 token through Tokeny, an infrastructure platform that uses Polygon to allow financial institutions to issue and manage securities and financial instruments\n\nABN AMRO was able to secure 5 million euros in funding for real estate investor Vesteda. According to the bank, Vesteda intends to use the funding to refinance “green assets” as part of the company’s green finance framework\n\nGreen bonds are a means to raise funds that are used to invest in projects or companies that are sustainable and have a positive environmental impact.\n\nABN AMRO laid out further details of the green bond, which saw DekaBank take ownership of tokens representing its 5 million euro investment after payment was made. The bank makes use of Fireblocks to manage private keys to the digital bond\n\nRelated: EIB settles 100 million euro digital bond on private blockchain\n\nABN AMRO has previously explored digital bonds issuance, including purchasing and reselling a digital bond from the European Investment Bank (EIB).\n\nThe bank’s head of debt capital markets, Olivier Aartsen, said ABN AMRO aims to support multiple digital bond offerings in the future.\n\nABN Amro’s digital asset lead, Martijn Siebrand, added that using the ERC-3643 standard allowed the bank to embed compliance rules into digital bonds.\n\n“They can even seamlessly and compliantly interact with other applications on the public network thanks to native interoperability.”\n\nMainstream financial institutions are increasingly making use of blockchain technology to issue and manage digital bond offerings for a number of different use cases.\n\nSiemens grabbed headlines in February 2023 as it launched a $64 million digital bond that drew direct investment from DekaBank, DZ Bank and Union Investment.\n\nMeanwhile, the European Investment Bank issued a unique blockchain-based digital bond in June 2023 powered by environmentally incentivized node infrastructure. The 1 billion Swedish krona ($89.5 million) bond is set to offer a 3.638% fixed rate over two years to institutional investors.\n\nThe platform underpinning the EIB’s digital bond was developed in a joint project including Skandinaviska Enskilda Banken and Credit Agricole CIB. So|bond is intended to be used to issue, trade and settle bonds digitally."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMipQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vaW5kdXN0cnkvYmFua2luZy9maW5hbmNlL2NoYXJ0aW5nLWEtbmV3LXBhdGgtaW4tZGVmaS1ldmVybG9kZ2UtZWxkZy1yaXNlcy1lY2xpcHNpbmctZXRoZXJldW0tZXRoLWFuZC1zb2xhbmEtc29sL2FydGljbGVzaG93LzEwMzY4NjAyNC5jbXPSAakBaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL2luZHVzdHJ5L2JhbmtpbmcvZmluYW5jZS9jaGFydGluZy1hLW5ldy1wYXRoLWluLWRlZmktZXZlcmxvZGdlLWVsZGctcmlzZXMtZWNsaXBzaW5nLWV0aGVyZXVtLWV0aC1hbmQtc29sYW5hLXNvbC9hbXBfYXJ0aWNsZXNob3cvMTAzNjg2MDI0LmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Sep 2023 07:00:00 GMT",
        "title": "Charting a New Path in DeFi: Everlodge (ELDG) Rises, Eclipsing Ethereum (ETH) and Solana (SOL) - The Economic Times",
        "content": "Everlodge (ELDG), now in its presale phase, is carving an impressive path that makes it stand shoulder-to-shoulder with established giants Ethereum (ETH) and Solana (SOL). This piece delves into the journey of Everlodge, outlining its rise and the potential to reshape the future of DeFi.\n\nJoin the Everlodge presale\n\nEverlodge (ELDG): An 80% Price Surge and Global Anticipation\n\nWith just $100, you could own a stake in an upscale New York hotel, a coveted Airbnb in London's center, or a serene Maldivian villa. But how is this possible?\n\nThe Everlodge vision is to transmute these properties into divisible NFTs available for trade on the blockchain, making high-end real estate investments accessible to many without hefty initial investments.\n\nAnchored on the Ethereum blockchain, these NFTs embody trust, clarity, genuineness, and an unmatched level of investor authority. Notably, the NFT metadata encapsulates every critical property detail to avoid the limitations of traditional real estate investments.\n\nEverlodge's idea is a game-changing one. Its potential lies in that real estate investments usually limited to investors with deep pockets, can now be purchased as fractional shares at low prices. Thus, Everlodge allows smaller-sized investors to benefit from the industry's growth without paying exorbitant fees or settling for lower returns.\n\nThe fervor surrounding Everlodge's presale is palpable, with millions of investors clamoring for the last remaining ELDG tokens selling for $0.018 in phase 3. The current price represents an 80% pump as the price rises throughout the presale event.\n\nGiven that the vacation rental market is valued at a staggering $82.6 billion and is poised for a 4.7% CAGR from 2023-2030, change is unmistakably in the wind. The upside for Everlodge is immense, prompting early investors to look at the project's promise in anticipation.\n\nAnalysts project Everlodge not merely as a participant but potentially as a game-changer in the real estate landscape, with whispers of ELDG's value skyrocketing by a whopping 30x once the full platform launches.\n\nEthereum (ETH)'s Fluctuations between $2,000 and $2,100\n\nOver the past few months, Ethereum has attempted to break free from the $2,000 to $2,100 range. However, a swift 12% descent over the past few weeks to the $1,600 level has further dampened Ethereum's momentum.\n\nSo, what's curbing Ethereum's potential? Despite its strong fundamentals and a $21 billion TVL, Ethereum remains chained to Bitcoin's price movements. As Bitcoin grapples with its own market hurdles, Ethereum is caught in the ensuing ripple effect, leading traders to seek more stable grounds.\n\nBut the Bitcoin link is just one facet. Diminishing network activity and looming apprehensions of massive sell-offs further darken the horizon. This sentiment is mirrored in Ethereum's TVL, which witnessed a sharp 50% drop since mid-April.\n\nYet, for Ethereum's major stakeholders, the landscape isn't entirely bleak. Many draw parallels between the early promise they saw in Ethereum in 2017 and the potential they now see in Everlodge. This budding interest, amplified by the enticing offers in the Everlodge presale, is steering Ethereum traders to venture into this emerging realm.\n\nSolana (SOL): Shifting Investor Focus to New Horizons like Everlodge (ELDG)\n\nSolana's price recently surged from $8 to an admirable $32. A combination of factors fueled this ascent: Solana's recovery from the FTX debacle, the success of the Ripple/SEC legal case, and its ability to overcome minor technical glitches that once dampened its appeal.\n\nHowever, despite this strong trajectory, Solana could not breach the $32 resistance point. Its current standing at $18.95 marks a considerable 40% slide in just two months. While analysts hold the conviction that the $16 mark offers staunch support, the precipitous drop undeniably jolted the faith of Solana enthusiasts.\n\nYet, experts continue to spotlight Solana's promise as a frontrunner in layer-1 technology and the DeFi realm. Since the year's outset, the platform's 50% augmentation in TVL is a testament to its bullish prospects.\n\nThat said, it's undeniable that Solana, much like its counterparts, has been swayed by the overarching bearish market mood. Consequently, some investors are setting their sights on fresher prospects, with Everlodge emerging as a shining beacon in the darkness.\n\nFind out more about the Everlodge (ELDG) Presale\n\nWebsite: https://www.everlodge.io/\n\nTelegram: https://t.me/everlodge\n\nDisclaimer:\n\nThis is an advertorial. BCCL disclaims any and all warranties - expressed or implied - relating to the content and does not guarantee, vouch for, or endorse any of the content. The content does not promote, suggest or present Crypto products to be a way to solve financial difficulties / achieve financial security / act as an alternative to employment / income opportunity. Crypto products, crypto currencies, NFTs are unregulated and may be risky, with no legal recourse in case of monetary loss. Views expressed herein are independent opinions based on studies. You may act at your own risk while relying on the content of this advertorial. Should you make a decision to act, or omit to act, you should seek appropriate legal advice in the relevant jurisdiction.\n\nDisclaimer: Content Produced by IPD"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmJubmJsb29tYmVyZy5jYS9ldGhlcmV1bS1mb3VuZGVyLWJ1dGVyaW4tZm9yZWNhc3RzLWJsb2NrY2hhaW4tbWVyZ2Utb24tc2VwdC0xNS0xLjE4MDUwNznSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Founder Buterin Forecasts Blockchain Merge on Sept. 15 - BNN Bloomberg",
        "content": "(Bloomberg) -- A much-anticipated software upgrade of the Ethereum blockchain, known in crypto as the Merge, is now likely to happen around Sept. 15, according to network co-founder Vitalik Buterin.\n\nThe Merge represents a transition in how Ether tokens are minted and transactions are validated, away from mining blocks using complex computational puzzles under the proof-of-work method and toward proof-of-stake. Under the POS method, Ether holders can sign up to validate transactions on Ethereum based on stashes of locked up tokens.\n\nFollowing a final test stage of the Merge known as Goerli earlier this week, Buterin said the proof-of-work version of Ethereum now only has a rough “fixed number” of mining slots. This means developers can be more certain about when the official network upgrade might begin.\n\nA previous forecast set a date between Sept. 15 and Sept. 20. There is another call between Ethereum developers next week to hammer out any last-minute hiccups to the Merge, at which a definite date will be settled upon.\n\nRead more Ethereum Developers Set September Target for Software Update\n\nTokens developed by other teams to capitalize on the Merge have soared over the last month as the upgrade edges closer. Ether has jumped 80% in the same period.\n\nEther was down about 1.4% to $1,875 as of 9:35 a.m. in New York. The second-largest cryptocurrency in market value after Bitcoin reached a record of around $4,860 in November.\n\n©2022 Bloomberg L.P."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3LmNyeXB0b3BvbGl0YW4uY29tL3NsZWVwZHJvcHBpbmctc2NhbS1jb3N0cy1ldGhlcmV1bS11c2Vycy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Sep 2023 07:00:00 GMT",
        "title": "Sleepdropping scam costs Ethereum users $11.5 million - Cryptopolitan",
        "content": "Cybersecurity firms Forta Network and Blockfence have disclosed how a sophisticated scam, coined “sleepdropping,” has cost Ethereum users $11.5 million since its first detection in December 2022. The insidious operation centers on ERC-1155 tokens, often disguised as legitimate NFTs. Alarmingly, these fraudulent airdrops have reached over 500,000 addresses. The tactics deployed by the scammers expose the Achilles’ heel of smart contracts, even as they continue to gain mainstream acceptance.\n\nA critical facet of this scam is the fraudulent website that deceives users into engaging in risky financial transactions. On the surface, these websites are legitimate platforms. However, once users engage with these sites, their funds end up in the pockets of unknown fraudsters. Over 20,000 users have already fallen prey to this intricate scam.\n\nInterestingly, the scammers have even replicated a genuine Lido NFT token as a “badge” for a supposed airdrop, extending the web of deceit. While the NFT itself poses no direct risk to the user’s financial assets, the real danger lies in the secondary interactions it encourages. Users who believe the airdrop is genuine may claim harmful tokens on phishing sites. The scam transforms a harmless token into a lure that pulls users into a financial trap.\n\nWhat complicates the matter further is the seemingly authentic nature of the smart contracts used to disseminate these tokens. In some instances, these contracts mimicked legitimate airdrops from reputable sources, such as those that rewarded early Lido stakers in 2021. According to Forta Network, an observant user might even see the tokens coming from a legitimate source, highlighting the depths these scammers are willing to feign authenticity.\n\nThe research conducted by Forta and Blockfence has identified more than a hundred unique smart contracts connected to this scam. These contracts share similar deployment characteristics, providing clues to the scam’s modus operandi. The scam unfolds in three main stages, which are as follows: fraudulent airdrop operations, deceptive websites, and malicious contracts that ultimately siphon off users’ funds."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vY29pbmN1bHR1cmUuY29tL2F1L2ZvcmVjYXN0L2V0aGVyZXVtLWNsYXNzaWMtZXRjLXByaWNlLXByZWRpY3Rpb24v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Classic (ETC) Price Predictions 2023-2030 - Coin Culture",
        "content": "Ethereum (ETH) is one of the leading cryptocurrencies besides Bitcoin (BTC). Yet, another iteration of Ethereum asserts its authenticity, namely Ethereum Classic (ETC). Ethereum Classic remained loyal to the original blockchain following a hard fork triggered by network breaches in 2016. This article delves into Ethereum Classic (ETC) and Ethereum Classic (ETC) price predictions for 2023-2030.\n\nWhat is Ethereum Classic (ETC)?\n\nEthereum Classic (ETC) emerged in 2016 as a cryptocurrency through a hard fork, a permanent split, originating from Ethereum (ETH). Like the Ethereum network, the Ethereum Classic blockchain can support smart contracts and decentralised applications, and it upholds its distinct Ethereum Classic tokens.\n\nThe fork from Ethereum to Ethereum Classic was prompted by a significant hacking incident, an uncommon yet not unprecedented occurrence in crypto blockchains. This breach resulted in the loss of 3.6 million Ethereum tokens. The primary Ethereum blockchain responded by implementing updates to rectify the erroneous transactions. However, a segment of the original Ethereum community disagreed with this approach, leading to the creation of Ethereum Classic. It was built using the unmodified Ethereum ledger, which included the transactions from the hack.\n\nEthereum Classic stands apart because it preserves the original Ethereum blockchain. It employs the proof-of-work protocol to validate transactions, demanding substantial computational resources for ETC mining. While Ethereum Classic and Ethereum currently use the proof-of-work method, Ethereum is concurrently transitioning to a different consensus mechanism known as proof of stake.\n\nEthereum Classic’s native token is also named Ether, which can create confusion. However, their distinction lies in their ticker symbols: the new Ether is denoted as ETH, while Ethereum Classic’s token is represented as ETC. ETC has a circulating supply of 143,002,842 tokens, with a maximum supply of 230,000,000. Miners can earn ETC tokens by upholding and securing the network’s operations.\n\nEthereum Classic (ETC) Price History\n\nNow, let’s take a closer look at the price history of ETC. Note that while past performance should not be relied upon as an indicator of future outcomes, understanding the coin’s historical trends provides valuable context for making or interpreting Ethereum Classic price predictions.\n\nETC initially traded at $2.08 when the blockchain split in July 2016. Subsequently, its price declined to a low of $0.75 in November 2016. But it then embarked on a significant rally, reaching $46 by December 2017. After this surge, the price experienced a downturn, falling to $3.76 by December 2018.\n\nIn February 2020, ETC saw a resurgence, reaching $12.34, its highest level since 2018. The price dipped to $4.51 in March 2020 due to market anxiety related to the COVID-19 pandemic. Throughout the rest of the year, ETC traded within a range of $4 to $6.\n\nThe beginning of 2021 marked a favourable period for the crypto market, and ETC capitalised on increased participation. It achieved an all-time high of $176.16 on May 6, 2021, followed by a sharp decline during the market crash. ETC hit a low of $32.51 on June 22.\n\nOn August 15, 2021, Ethereum Classic reached $76.94, its highest level since the May decline. It reached $77.07 on September 6 but subsequently retreated, closing the year at $34.12.\n\nIn 2022, the crypto market faced various challenges, impacting ETC’s performance. It hovered around the $30 mark in January but rebounded to $52.17 in March. Subsequent market crashes led to a low of $12.60 on June 18. ETC then stabilised between $20 and $30 for several months. The collapse of the FTX exchange caused another market crash, with ETC reaching a low of $14.89 on December 19.\n\nBy year-end, it had recovered to $15.69, representing an annual decline of nearly 55%. Despite the losses, ETC outperformed the broader crypto market, which experienced a roughly 65% drop in 2022.\n\nSo far in 2023, the crypto market has seen some positive momentum, ETC has witnessed a price increase. Its peak occurred on February 4, with a high of $24.79. A subsequent decline, exacerbated by the Silvergate Bank’s collapse, caused ETC to drop to $16.25 on March 10. The crypto recovered partly due to growing interest in ETH driven by a new hard fork. As of April 13, Ethereum Classic was valued at approximately $22.55.\n\nDuring this period, just over 140.4 million ETC were in circulation out of a total supply of 210.7 billion. This gave the coin a market capitalisation of approximately $3.1 billion, ranking it the 23rd largest cryptocurrency by market cap.\n\nEthereum Classic Price Forecasts by Experts\n\nBefore delving into Ethereum Classic price predictions, note that price forecasts, especially for the inherently volatile cryptocurrency market, often prove inaccurate. Long-term crypto price predictions typically rely on algorithms that can swiftly change.\n\nCoincodex presents an optimistic short-term outlook for Ethereum Classic’s price, projecting a rise to $16.29 by September 9, 2023, marking a potential 6.48% increase from its current value. Their analysis is rooted in technical indicators, reflecting a bearish sentiment alongside a Fear & Greed index standing at 40. Coincodex’s projections suggest a substantial price surge to $36.25 in 2024. However, subsequent years may bring corrections, leading to a market price of $23.99 in 2025, followed by $16.83 in 2030, and a long-term estimate of $13.69 by 2040.\n\nRead more: CAKE Price Predictions 2023-2050: Is CAKE Token Worth Buying?\n\nWallet Investor adopts a pessimistic perspective on Ethereum Classic (ETC) as a long-term investment. According to their projections, ETC’s price could drop to $1.430 by 2024, indicating a substantial decline of approximately 90.69%.\n\nDigitalCoinPrice offers a bullish Ethereum Classic price forecast, envisioning ETC’s value reaching $33.69 by the end of 2023, representing a significant 119.19% surge from its current valuation. Their prediction is grounded in a comprehensive analysis of market dynamics and technical metrics, all pointing towards robust bullish tendencies for ETC. Digitalcoin Price further indicates that this bullish trajectory may persist over the long term, with maximum price targets of $69.93 in 2026, $115.05 in 2029, and an impressive $208.60 in 2032.\n\nGov Capital’s ETC price prediction places the coin’s price at approximately $52.95 on April 13th of the following year, with a subsequent rise to $225.01 in five years.\n\nForex Trading on YouTube highlights a crucial weekly support range for Ethereum Classic, with a lower boundary around $11.50 and an upper boundary near $14.50. The trader suggests that a breach of this support area could lead to a significant decline, potentially down to $8.\n\nEthereum Classic (ETC) Price Predictions 2023-2030\n\nThough Ethereum Classic price prediction had to make a tremendous effort to fork out of its origin and compete long and hard with its rival cryptocurrencies, it was not long before it would outperform during the last year. According to the technical analysis, most of Ethereum Classic’s competitors did not mesmerise the traders either. Let us check the data for the Ethereum Classic price forecast from 2023 to 2030.\n\nEthereum Classic Price Prediction 2023\n\nAccording to the ETC price prediction for 2023, Ethereum Classic’s price might exceed $30. By the end of the year, Ethereum Classic is expected to reach a minimum price level of $18.18. And the ETC coin can get a maximum level of $44.16.\n\nEthereum Classic Price Forecast 2024\n\nStating that a jaw-dropping possibility does not exist and that bulls will ride the crypto market, it is once again expected that the ETC coin will rule the crypto industry with an average price pegged around $44.67. This shows Ethereum Classic has the full potential to sustain and consistently grow even in adverse conditions.\n\nEthereum Classic Price Prediction 2025\n\n2025 might mark the benchmark year as the ETC price is predicted to surpass $50 by all means. Based on the ETC price prediction for 2025, the coin is estimated to reach the minimum price of $46.64 and the maximum price of $67.14 by the end of 2025.\n\nETC Token Price Prediction 2026\n\nAccording to the ETC price prediction 2026, the currency will remain bullish. Moreover, future innovations and integration might affect positive trends in the overall growth of the ETC ecosystem. By 2026, the price of the Ethereum Classic forecast may hit the max price of $85.83. On the other hand, based on Ethereum Classic predictions, it may correct towards $59.62.\n\nEthereum Classic Predictions 2027\n\nEthereum Classic might continue to trade across $90 over 2027 as per the Ethereum Classic price predictions. By the end of the year, the price of ETC is predicted to reach a minimum price level of $76.29. On the upside, the ETC coin might hit the maximum price level of $109.82.\n\nRead more: ONE Price Predictions 2023-2030: Will Harmony Hit $1?\n\nETC Coin Price Prediction 2028\n\nAs per the ETC forecast 2028, Ethereum Classic might trade at around $110 during 2028. By the end of the year, the price of Ethereum Classic is estimated to reach a minimum price level of $97.83. And on the upside, the ETC coin might get the maximum price level of $140.83.\n\nEthereum Classic Price Forecast 2029\n\nBased on ETC price prediction 2029, Ethereum Classic might hover around $150.90 during 2029. The price of Ethereum Classic might reach a minimum price level of $123.71. And on the positive side, the ETC price might reach the maximum level of $178.09.\n\nEthereum Classic Price Prediction 2030\n\nAccording to our Ethereum Classic price prediction 2030, the minimum price of ETC might achieve a significant height of $150 with an average price of Ethereum of $183.38. The maximum price of Ethereum Classic will be around $216.43, which is much more than the current price level, by the end of the year.\n\nIs Ethereum Classic (ETC) a Good Investment?\n\nThe distinction is quite evident when comparing the Ethereum blockchain to the Ethereum Classic blockchain. Ethereum has outperformed Ethereum Classic regarding price performance in recent years. Its strong price performance has driven increased user adoption, prompting merchants and service providers to expand their accepted deposit methods to include Ethereum. Some price predictions even suggest that Ethereum may surpass Bitcoin in terms of usage in gaming deals. So, should you consider selling Ethereum Classic and acquiring Ethereum instead?\n\nOn the other hand, Ethereum Classic has faced challenges, particularly as the optimism surrounding Bitcoin’s potential rise to $100K has given way to concerns about stability around $40K. Previously, the growth of Bitcoin was expected to bring stability to other cryptocurrencies, including Ethereum Classic, but this scenario has not materialised. Hence, many coins, including Ethereum Classic, have experienced a sustained decline.\n\nDespite the ongoing market difficulties, there remains the possibility of a market resurgence. Buying during market dips may present an opportunity for Ethereum Classic investors. As Bitcoin continues to make gains, there is a chance that Ethereum Classic could also surpass the $50 mark. However, the rise of this cryptocurrency is contingent on a rally in the market and stability in its value.\n\nRead more: BTT Price Predictions 2023-2030: Is BitTorrent a Good Investment?\n\nEthereum Classic (ETC) Price FAQs\n\nIs Ethereum Classic superior to Ethereum?\n\nIt’s challenging to compare definitively as both have strengths and weaknesses. Ethereum Classic can support smart contracts and dApps. In contrast, Ethereum enjoys more excellent investor support, and its functionality is more robust on the newer ETC blockchain. Both are prominent cryptocurrencies in the crypto world. It’s akin to asking whether wine or whiskey is better!\n\nDoes Ethereum Classic have a future?\n\nIndeed, there is potential. Based on historical data and past bullish price trends, we anticipate a bright future. This is particularly true because Ethereum, a pioneer of Smart Contracts, can benefit Ethereum Classic’s price prediction through established systems and partnerships.\n\nCould Ethereum Classic (ETC) face failure?\n\nThe fate of Ethereum Classic largely depends on the future average price of the ETC token. It’s crucial to conduct your due diligence. Financial resources, security, miner interest, and team stability can impact its stability. Mass adoption and prevailing market sentiments significantly influence the project’s longevity.\n\nCan the ETC token reach $1000?\n\nNo, according to our prediction model, there is no foreseeable scenario where the Ethereum Classic (ETC) token hits $1000 in the future. While ETC’s price may experience notable upward movements, achieving such a substantial milestone appears unlikely based on available data and prevailing market conditions."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vZW4ubmV3czRzb2NpYWwuY29tL2NyeXB0b2N1cnJlbmN5LW5ld3MvZXRoZXJldW0tcHJpY2Utc3RyaXZpbmctaGFyZC10by1vdmVydHVybi1iZWFyaXNoLW1vbWVudHVtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Price Striving Hard To Overturn Bearish Momentum - News 4 Social English",
        "content": "Ethereum Price Striving Hard To Overturn Bearish Momentum\n\nFrom its low of $1550 on September 12th, ETH has risen briefly.\n\nIf the price rises above the $1657 resistance level then it will likely rally further.\n\nThe recent attempt to establish the Ethereum Holesky test network was unsuccessful because of a parameter mismatch. The network is still scheduled for a formal debut soon and will become Ethereum’s biggest test network, with 1.46M validator nodes, twice as large as the primary network.\n\nThe release of Holesky marks a major stride forward for Ethereum in the shift to ETH 2.0, moving user’s one step closer to a blockchain that is both more scalable and safe.\n\nSantiment, an on-chain analytics provider, surprised everyone on September 14, with new information. The twitter post stated that the second-highest daily total of unique addresses transacting on the network had been attained, according to the tracker.\n\nOn September 14, a massive 1,089,893 distinct wallets sent or received ETH on the Ethereum network, the second biggest figure in the asset’s over 8 year of existence. As a result of this unprecedented occurrence, prices may now be ready to recover.\n\nTransaction Volume Declines\n\nFrom its low of $1550 on September 12th, ETH has risen briefly indicating a change in momentum. At the time of writing, the price of ETH is $1635 and is up 0.56% in the last 24 hours as per data from CMC. The volume is down 8.26% indicating that investors and traders are staying away for the time being, waiting for a clear indication.\n\nSource: CoinMarketCap\n\nIf the price rises above the $1657 resistance level then it will likely rally all the way till $1737. On the other hand, if the ETH price falls below $1542 then a fresh decline is on the cards. It will then likely test the $1434 support level.\n\nCheck More Latest Cryptocurrency News Click Here– Latest Cryptocurrency News\n\nCheck More Business News Click Here– Latest Business News"
    }
]