[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDUvMDQvbGF5ZXItMi1uZXR3b3JrLW9wdGltaXNtLXRvLXVzZS1ldGhlcmV1bS1hdHRlc3RhdGlvbi1zZXJ2aWNlLXRvLXByb21vdGUtdXNlci10cnVzdC_SAYABaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wNS8wNC9sYXllci0yLW5ldHdvcmstb3B0aW1pc20tdG8tdXNlLWV0aGVyZXVtLWF0dGVzdGF0aW9uLXNlcnZpY2UtdG8tcHJvbW90ZS11c2VyLXRydXN0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 May 2023 07:00:00 GMT",
        "title": "Layer 2 Network Optimism to Use Ethereum Attestation Service to Promote User Trust - CoinDesk",
        "content": "“People in the Optimism Collective have been kind of trying to figure out, ‘hey, how do we actually identify one person – and not just like any person, but like a positive contributor to the space – to give these tokens to’ and that's when we started experimenting with attestations,” Bacchus said."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vdGhlZGVmaWFudC5pby9ldGhlcmV1bS1kZXZlbG9wZXJzLWluLWZpbmFsLXN0YWdlcy1vZi1wbGFubmluZy1uZXh0LW1ham9yLXVwZ3JhZGXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 04:01:43 GMT",
        "title": "Ethereum Developers In ‘Final Stages Of Planning’ Next Major Upgrade - The Defiant - DeFi News",
        "content": "‘Dencun’ Will Focus On Scaling To Reduce Transaction Costs\n\nBy: Samuel Haig • Loading...\n\nDeFi News\n\nDespite Ethereum’s Shapella upgrade going live just three weeks ago, the Ethereum Foundation is already looking ahead to the network’s next upgrade, dubbed Dencun.\n\nAccording to a May 3 blog post from Ethereum Foundation community manager Tim Beiko, Ethereum’s core developers are already in “the final stages of planning” for Dencun.\n\n“We currently have a tentative set of [Ethereum Improvement Proposals] included in the next network upgrade,” Beiko said.\n\nThe primary update included in Dencun is EIP-4844, also known as “Proto-Danksharding” or “The Surge.” Researchers anticipate the update will reduce the costs associated with transacting on Ethereum Layer 2 by orders of magnitude. Beiko did not offer any timeline for when Dencun might be activated.\n\nThe news comes as Layer 2 networks have emerged as the leading Ethereum scaling solution. Layer 2s surpassed the Ethereum mainnet by daily transaction volume in February, with L2s currently beating Ethereum by double with 2M transactions daily. L2 transactions peaked at nearly 4M six weeks ago, while mainnet activity trended steady at roughly 1M each day for the past six months.\n\nEthereum (blue) versus combined L2 (red) daily transaction volume.\n\nL2s represent a combined total value locked (TVL) of $9.3B, according to L2Beat, equal to one-fifth of the entire DeFi TVL, according to DeFi Llama.\n\nThe Surge\n\nEIP-4844 will replace the blockspace-intensive “calldata” currently stored on-chain alongside transactions with “blobs,” with analysts tipping the upgrade will improve Layer 2 throughput by orders of magnitude. Unlike calldata, Blobs do not compete with Ethereum transactions for gas, significantly reducing the blockspace associated with processing transactions on L2.\n\n\n\nIn a recent appearance on The Defiant Podcast, Carl Beekhuizen of the Ethereum Foundation said the cost of storing data on-chain is the main barrier restricting the scalability of Layer 2 networks. “The idea behind Danksharding and EIP-4844 is to provide really cheap data storage… so the L2s can provide cheap transactions to their users,” Beekhuizen said.\n\nOther Confirmed Upgrades\n\nBeiko confirmed that Dencun will include at least three other upgrades.\n\n\n\nEIP-1153 will introduce “transient storage,” which allows certain data to be discarded from transactions rather than stored on-chain. The upgrade will further improve blockspace availability and reduce the costs associated with storing data on-chain.\n\nDeFi Alpha Premium Content DeFi Daily | Weekdays\n\nDeFi Alpha Letter | Weekly\n\nDefiant Podcast Transcript | Weekly\n\nInbox Dump | Saturday\n\nWeekly Recap | Sunday Looking for Alpha? Become a premium member of The Defiant and join our DeFi Alpha community. Start for free\n\nEIP-6475, also called SSZ Optionals, is a companion to proto-danksharding — which introduces a new type of transaction that uses simple serialize (SSZ) encoding. Beiko said EIP-6475 ensures transaction formats are forward-compatible future SSZ-upgrade devs plan to introduce in the future.\n\nEIP-6780 will deactivate the SELFDESTRUCT opcode, which is used to terminate a smart contract. Beiko said the function is not behaving as expected for certain use cases, adding that client teams are currently considering different solutions for modifying the code.\n\nAmbitious Roadmap\n\nEthereum is currently undergoing a period of significant transformation which began with the Merge last September, transitioning Ethereum to Proof of Stake consensus. Once the Surge is live following Dencun, Ethereum will undergo three other major upgrades in the form of the Verge, the Purge, and the Splurge.\n\nThe Verge will introduce Verkle trees and stateless clients to make Ethereum more lightweight and bolster decentralization. Vitalik Buterin, Ethereum’s co-founder and chief scientist, said that after The Verge, users will be able to launch nodes “without having hundreds of gigabytes on your disc.”\n\nThe Purge will remove old history from the blockchain, meaning nodes won’t be required to store the entire history of the blockchain. The network will delete transaction data after it is 30 days old, with infrastructure providers like the Etherscan block explorer expected to continue compiling older historical data.\n\nFinally, the Splurge will introduce “all of the other fun stuff” bolstering the network’s efficiency and performance not included in other upgrades.\n\nEthereum’s core devs expect the network will enter a phase of relative stability following the Splurge, with Vitalik predicting that Ethereum “will look more like a system that optimizes for safety and predictability.”"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbWFnYXppbmUvam9lLWx1YmluLXRoZS10cnV0aC1hYm91dC1ldGgtZm91bmRlcnMtc3BsaXQtYW5kLWNyeXB0by1nb29nbGUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 May 2023 07:00:00 GMT",
        "title": "Joe Lubin: The truth about ETH founders split and 'Crypto Google' - Cointelegraph",
        "content": "\n\nThere’s a narrative that’s grown up around Ethereum’s two most important co-founders, Joe Lubin and Vitalik Buterin, to explain how they went in different directions almost a decade ago.\n\n\n\nIt suggests the pair fell out over the blockchain’s future direction, with the idealistic 20-year-old Buterin determined to turn Ethereum into a nonprofit foundation, while Lubin and others wanted to commercialize the technology via a for-profit company.\n\n“That wasn’t really what happened,” the billionaire founder of Ethereum infrastructure and software firm ConsenSys tells Magazine during an in-depth interview in Tel Aviv.\n\n“What happened was people were looking for a way to explain why these two people were bumped out of the project. And that was a convenient way to label it. But that wasn’t the reason they were moved.”\n\nLubin’s referring to Ethereum’s infamous “Red Wedding” in 2014 when the eight co-founders and the team gathered to incorporate Ethereum as a company.\n\nFormer Ethereum CEO Charles Hoskinson (right) with creator Vitalik Buterin (left) from back in the day. (Flickr)\n\nThe meeting descended into bickering and infighting over internal politics that saw a devastated CEO Charles Hoskinson pushed out of the team, along with underperforming co-founder Amir Chetrit.\n\n“I think it’s true that I and several people on the team — like maybe everybody else — believed that you need to draw businesses in, you needed economic, commercial validation in order to build better things, even open-source software,” the 58-year-old says in his slow, measured tones.\n\n\n\n“But that wasn’t the root of why I started ConsenSys or why two people were bumped off the project.”\n\nRed Wedding and Crypto Google\n\nAs documented in Camilla Russo’s history of Ethereum, The Infinite Machine, the co-founders had gathered in Zug, Switzerland on June 7, 2014, to sign a document transforming Ethereum into a for-profit company. But instead of signing the contract, tensions boiled over Hoskinson’s management style and personality, Chetrit’s contribution to the project, Ethereum’s future direction and other internal political issues.\n\n\n\n\n\nAfter much back and forth, the decisions were all left to the gangly 20-year-old math genius who’d created the project in the first place. After some time alone on the terrace, he returned to say Hoskinson and Chetrit were out, and Ethereum would become a nonprofit foundation instead of a company.\n\n\n\n“Vitalik wrote an amazing white paper — it was right place, right time, incredible vision — and it attracted lots of people of disparate backgrounds, and we worked together well for chunks of time,” Lubin says by way of context.\n\nJoe Lubin in conversation with Magazine in Tel Aviv.\n\n“We had differences of opinion, at times, those differences of opinion boiled over famously… infamously. And there was a moment where two people were bumped out of leadership, and up to that point, we were having discussions about whether we were going to be purely nonprofit, or whether we were going to pursue a nonprofit track, put it under a foundation, and then the same group of people who worked so nicely together would build Crypto Google together.\n\n“And it became apparent to all of us that we probably weren’t going to build Crypto Google. But it was also clear to all of us that nobody was even close to being able to build Crypto Google and that we’re just building the foundation and the platform for a long time.”\n\nLubin was already planning his own for-profit company to build out Ethereum’s application layer when the decision was made, and it spun into life not long afterward.\n\nWhile other co-founders, such as Gavin Wood (Polkadot), contributed more to the early protocol itself, arguably none of them, apart from Buterin, has since contributed as much as Lubin to what Ethereum is today. While ConsenSys didn’t turn into Crypto Google, its infrastructure and apps are as important to Ethereum now as Google is to the web.\n\n“ConsenSys wasn’t formed to commercialize it. It was formed to continue the vision and the mission of the Ethereum platform,” Lubin explains.\n\n\n\nRelated: The Vitalik I know — Dmitry Buterin\n\nWho is Joe Lubin?\n\nBorn in Toronto in 1964, Lubin studied electrical engineering and computer science at Princeton in the mid-1980s, where his roommate was another future crypto billionaire, Mike Novogratz of Galaxy Digital. Amazon founder Jeff Bezos was in the same faculty, though Lubin tells Magazine they never met.\n\nJoe Lubin was almost 50 before he jumped on board the Ethereum train and made his first billion.\n\nLubin has had a surprisingly diverse career, working in AI, robotics and autonomous music creation for a number of different employers. He founded a hedge fund and was the vice president of private wealth management at Goldman Sachs, but nothing world-changing, according to Novogratz, as quoted in the Financial Times in 2021.\n\n“Joe was one of the brightest among us, a forward thinker, but by 45 hadn’t done anything to stand out,” Novogratz recalled. “I don’t think any of our gang would have guessed how things would turn out.”\n\n\n\nRelated: Here’s how Ethereum’s ZK-rollups can become interoperable\n\nThe combination of his near-front-row seat to the September 11 attacks on the World Trade Center and then the global financial crisis shook him to his core. He said at the ConsenSys Ethereal Summit in May 2017 that the events had made him feel as though “we were living in a global society and economy that was figuratively, literally and morally bankrupt.”\n\n\n\nHe believed a slow, cascading financial collapse was taking place, which made him receptive to the ideas in the Bitcoin white paper, which he read in 2011. The following year he moved to Jamaica with his girlfriend, who was trying to forge a career in dancehall music, and he became a music producer while investing in Bitcoin and waiting for the collapse.\n\nDuring a trip home to Toronto in late 2013, he attended a Bitcoin meetup alongside another co-founder, Anthony Di Iorio, and encountered a kid named Vitalik Buterin, who was touting his just-written white paper for an improved version of Bitcoin called Ethereum. Lubin was “blown away,” and he became an official co-founder in early 2014.\n\nThe core early Ethereum team at the house rented for Bitcoin Miami 2014, including Joe Lubin in the back row, second from right. (yanislav.medium.com)\n\n\n\nApproaching 50, he was an odd fit with a bunch of anti-establishment 20-something-year-old coders, but his Jamaican music production background gave him just enough cachet with the team to get by. And, of course, Lubin and Di Iorio personally bankrolled around $500,000 to $800,000 of the funding necessary to get Ethereum off the ground.\n\nLubin’s experience also helped the team avoid potential pitfalls and roadblocks, and he insisted on early meetings with the United States Securities and Exchange Commission and hiring high-priced lawyers to minimize the extraordinary legal risks.\n\nConsenSys arises!\n\nConsenSys was founded in Switzerland in October 2014 for legal reasons, which subsequently led to a nasty ongoing court battle between employees and shareholders who claim they weren’t properly compensated when the assets were transferred to an American entity.\n\nRelated: ‘Account abstraction’ supercharges Ethereum wallets: Dummies guide\n\nBut it actually operated from a graffiti-covered warehouse in Bushwick, Brooklyn. The aim was to build out applications and infrastructure for Ethereum by investing in startups, incubating projects and consulting with firms like JPMorgan and BHP Billiton on how to incorporate this new technology. It spawned more than 50 businesses early on, including a poker site, a prediction market and a healthcare records firm. But by all accounts, its early years were pretty slapdash, with no real corporate structure.\n\nMetaMask co-founder Dan Finlay spoke about the early days on the Epicenter podcast.\n\n\n\n“ConsenSys was this wonderful, just kind of chaotic incubator at the early stages. I don’t know, there must have been hundreds of different experiments getting validated and tried out there. And there was a really exciting energy,” he says, adding that a lot of projects got built before Ethereum could support them:\n\n“Back then, it was very normal to just kind of build your application as if the blockchain was going to scale or did scale already.”\n\nIn 2018, a Forbes investigation suggested that pretty much all of ConsenSys’ projects were in the red, and the company was burning $100 million a year on non-profitable projects, including an asteroid mining company.\n\nForbes took aim at ConsenSys in a 2018 investigation. (Forbes)\n\nNot long after, Lubin axed a bunch of underperforming projects, culled the 1,200-strong headcount and reset the company into ConsenSys 2.0 with a much more corporate and accountable culture.\n\nDespite being worth $7 billion after its most recent $450-million fundraising round in 2022, ConsenSys let go of another 11% of its staff in January of this year. Lubin tells Magazine it was readying itself to survive bad conditions as “macroeconomic and geopolitical” storm clouds gathered.\n\n“We wanted to ensure that we had significant runway so that we can stay strong and build,” he says, revealing it was eyeing a number of acquisitions that “if we’re able to bring some on board that will add really valuable pieces.”\n\nI am excited to share news of our Series D fundraise. https://t.co/SZP36mgBfl — Joseph Lubin (@ethereumJoseph) March 15, 2022\n\nCentralization vs. decentralization\n\nAnyone who’s listened to Lubin speak will know that he’s genuinely committed to, and a proponent of, the benefits of decentralization.\n\n\n\nSo, is there tension between running a centralized company like ConsenSys that provides the crucial infrastructure to a decentralized blockchain?\n\n“I don’t think there’s a tension,” he says.\n\n“It’s all about progressive decentralization. There’s nothing wrong with having an entity that is organized in one way that is trying to build something that is organized in a different way.”\n\nLubin explains that the products ConsenSys is building need to achieve “product-market fit; otherwise, they’re kind of useless, and so bringing something forth, wholly and perfectly decentralized, is very difficult — it may be impossible.”\n\nConsenSys plays a big role in the Ethereum ecosystem.\n\nConsenSys’ most crucial infrastructure is called Infura, which offers Ethereum nodes as a service, making it easier for developers and users to connect to the network. It’s basically an intermediary service between decentralized apps (DApps) and the blockchain that projects rely on to stay up and running.\n\nInfura probably works a little too well, as much of the Ethereum ecosystem is dependent on it. That means if Infura goes down, so too do half the network’s projects, including Uniswap, Compound, MetaMask and Aave.\n\nIt’s also a weak point for censorship and was criticized by some for complying with the Tornado Cash sanctions.\n\nDecentralizing Infura\n\nConsenSys has been working on a plan for some time now to “decentralize Infura.” This will take the form of a marketplace of competing infrastructure providers that offer similar services, of which Infura itself would be one.\n\nLubin believes it’s “extremely important” to make this happen.\n\n“I’ve been a proponent of decentralizing Infura since the start but more actively since five years ago,” he says.\n\n“What we’ve run into is that our ecosystem keeps having these wicked growth spurts,” he continues, adding, “It was a sub-priority to keep things going rather than to start a parallel project to parallelize and decentralize — and that’s going pretty well right now.”\n\nThe protocol will either be called XFura or the Decentralized Infura Network Protocol.\n\n“The idea is that we believe now that we can take a high-performance product and federate the protocol, initially do a lot of hand-holding with other providers and then we situate Infura on the protocol,” he says.\n\n“It’s pretty close. There are a bunch of very sophisticated partners that are working closely with EG [Galano], the lead of the project. I can’t give you a date.”\n\nAlthough Infura researcher Patrick McCorry went out of his way in an interview with Cointelegraph to say censorship resistance was not the point of decentralizing Infura, that’s certainly one of the benefits.\n\n\n\nA decentralized network would enable DApps to pick and choose providers, allowing them potentially to get around censored protocols or addresses like Tornado Cash.\n\n“I like the idea that there’s optionality,” says Lubin, carefully noting that different providers would operate in different nation-states and jurisdictions.\n\n“I think that works well if there’s a lot of them and if there’s real choice, so you can always go to an uncensored service and be sure that they’ve got enough validating power so that you’re gonna get your transaction processed fairly rapidly.”\n\nHowever, he adds it’s equally possible that future aspects of the protocol are obfuscated so that no one actually knows what’s in a packet or a transaction. He says he knows of people already “working on protocol enhancements” who will make this happen, and the explosion of layer 2s and layer 3s makes it even more likely.\n\n“If they’re already glommed in and impossible to read, then it’s hard to imagine that regulators will either care that much or have the ability to do anything,” he says.\n\n\n\n“I’m sure [there is] lots of criminal activity that flows through AWS and Azure and every mail server everywhere. So, there’s a level of infrastructure that you just can’t halt because it’s doing mostly useful activity.”\n\nDecentralizing MetaMask\n\nThe other core bit of infrastructure provided by ConsenSys that underpins the entire Ethereum ecosystem is its ubiquitous browser wallet MetaMask. It’s also being sort of decentralized by crowdsourcing the development of new features and the addition of new blockchains.\n\n\n\nCalled MetaMask Snaps, it’ll turn the browser wallet into a permissionless platform for others to build on — one proof-of-concept Snap enables MetaMask to act as a Bitcoin wallet.\n\nJoe Lubin has arguably made a bigger contribution to Ethereum than any other co-founder apart from Vitalik Buterin.\n\n“The MetaMask Grants DAO [decentralized autonomous organization] will get increasingly decentralized and will incentivize people to build cool things, to start companies that permissionlessly innovate that we have nothing to do with,” says Lubin.\n\nHe explains that over the years, MetaMask was approached by numerous blockchains looking for support, but after they’d crunched the numbers, there wasn’t enough activity to justify splitting its focus from Ethereum. Snaps, though, will open the doors to everyone.\n\nCrypto regulations\n\nLubin is unconcerned about the possibility of Ethereum being declared a security, saying, “It’s as likely and would have the same impact as if Uber was made illegal.”\n\n\n\n“There would be tremendous outcry from not just the crypto community but different politicians, certain regulators.”\n\nThere’s a sense of frustration from Lubin that this ground even needs to be covered again, saying that ConsenSys has been through all of this in discussions with the SEC and Commodity Futures Trading Commission over many years.\n\n“We went in there on a voluntary basis five years ago or something like that, when they’re just trying to wrap their heads around what tokens were,” he says.\n\n\n\n“They thought back then that everything was a security; we think [we] helped them significantly understand that lots of tokens are not securities and then they went away, and Gary and his team now think almost everything’s a security.”\n\nBut he believes that the renewed focus on regulations in the wake of the FTX and stablecoin collapses will ultimately be a good thing.\n\n“We now have the world’s attention, and smart people who care will prevail because it just makes sense,” he says.\n\n\n\n“And sure, there will be people with agendas who don’t want to see it that way. Maybe the banking lobby will help them not see it that way. But in terms of finally paying a lot of attention to trying to regulate an important space, I do believe that clear heads will think through this and that people will start to understand the benefits of decentralization and make good regulation for CeFi [centralized finance] and no regulation for tech, crypto.”\n\nCrisis equals opportunity\n\nIn fact, Lubin is remarkably philosophical and sanguine about all the regulatory, game theory and technological challenges facing Ethereum. For example, he concedes centralization of staking on platforms like Lido could become a concern, but because progressive decentralization is baked into the nature of the ecosystem, it won’t be a problem for long.\n\n“Things don’t start very decentralized,” he says. “These are still pretty new innovations, and our ecosystem is pretty exacting. If you want to be in the Ethereum ecosystem proper, then you’re not going to want to try to dominate something, you’re not going to want to operate centralized for very long. The ecosystem will identify that as problematic and come up with solutions for it, which is great.”\n\nIn Lubin’s world view, problems are just short-term issues you deal with as part of the process of making the project better.\n\n“I see things as processes. I hope we run into lots of complications in the near term, and all the way through, because every complication just points out how we can build a more robust platform and a more decentralized platform. Yes, hopefully, we’ll run into lots of difficult problems.”\n\n“Lots of smart people have good solutions that are being built.”\n\n\n\nAlso read: Ethereum is eating the world — ‘You only need one internet’\n\nThe future of Ethereum\n\nThe big question is, where does he see Ethereum heading? Does he believe the world’s entire financial system could end up running on Ethereum using ZK-Rollups?\n\nLubin says the founding conception of Ethereum was that it would become a “world computer,” and he suggests that was still in the cards.\n\n“I think several of us thought early on that we were building the Star Trek computer essentially,” he says, explaining it handled pretty much anything and everything.\n\n“And so, I think that decentralized protocols will be the underlying trust foundation for lots of heterogeneous architectures. So, it’s possible that Ethereum will scale sufficiently so that we can have one trust foundation and then build lots of layer 2s and layer 3s and up.”\n\n“There have been many computer revolutions for the last 200 and something years and this is another one.”\n\n“So, the answer’s yes. And the answer will take time to unfold. It would be impossible to rearchitect the global economy or global financial system in a short period of time.”"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiMGh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvaG93LXRvLXVud3JhcC1ldGhlcmV1bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 May 2023 07:00:00 GMT",
        "title": "How to Unwrap Ethereum? - Watcher Guru",
        "content": "The Ethereum network has made the switch from proof-of-work mining to proof-of-stake mining. The transition was completed successfully on September 15, 2022. Additionally, the blockchain went through some major changes as the miners were replaced by validators.\n\nRecently, the much-awaited Shapella upgrade went live, allowing these stakers to withdraw their staked ETH. However, ETH is the second-largest cryptocurrency and was created way back before the emergence of dApps.\n\nAlso read: How To Change Slippage Tolerance on PancakeSwap?\n\nThen the real question emerges as to what it is and why it exists. Wrapped Ether was created to give Ethereum-based decentralized applications (dApps) a more standardized approach to interface with Ether, the network’s native coin.\n\nWhat is Wrapped Ethereum (wETH)?\n\nwETH is just Ether wrapped in a smart contract to provide it with a standardized ERC-20 interface, allowing it to be exchanged and utilized within decentralized exchanges (DEXs) and other Ethereum-based services.\n\nGiven that Ether lacked the most widely used standard for tokens, the ERC-20 interface, it was necessary to create wETH. The process of wrapping ether includes moving the ETH to a smart contract. wETH will then be generated in return for this process. Additionally, this is to ensure that there is a reserve backing every wETH.\n\nAlso read: Is MetaMask Safe (2023)?\n\nBefore we look into how to unwrap Ethereum, let us look at how we can wrap it in just a few simple steps.\n\nHow to wrap Ether?\n\nThere are different ways to wrap Ethereum. One method involves the swapping of ETH for wETH through a cryptocurrency exchange. Another common method is the use of a smart contract. Let us look at the step-by-step guide on how to wrap ETH using OpenSea and MetaMask.\n\nGo to OpenSea and connect your MetaMask wallet.\n\nClick on the “Wallet” option. You will see three dots in the top-right corner. Click on the three dots next to Ethereum.\n\nClick on “Wrap” from the drop-down menu.\n\nEnter the amount and click on “Wrap ETH.”\n\nOnce it is done, confirm the MetaMask pop-up for the transaction to be complete.\n\nThat’s it. You will receive wETH which will shine brightly in pink.\n\nNow that we have covered how to wrap Ether, let us look at how to unwrap Ether using MetaMask and OpenSea.\n\nAlso read: How to Buy Crypto with Western Union\n\nHow to unwrap Ethereum?\n\nUnwrapping Ethereum is also a straightforward process. It works similarly to how you convert ETH to wETH. Let us look at the steps below."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZGVjcnlwdC5jby8xMzg5MTYvZGNnLWJhcnJ5LXNpbGJlcnQtc2VsbHMtZ3JheXNjYWxlLWV0aGVyZXVtLWNsYXNzaWMtdHJ1c3Qtc2hhcmVz0gFfaHR0cHM6Ly9kZWNyeXB0LmNvLzEzODkxNi9kY2ctYmFycnktc2lsYmVydC1zZWxscy1ncmF5c2NhbGUtZXRoZXJldW0tY2xhc3NpYy10cnVzdC1zaGFyZXM_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "DCG’s Barry Silbert Sells $755K Worth of Grayscale Ethereum Classic Trust Shares - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBarry Silbert, the founder and CEO of Digital Currency Group (DCG), has sold some of his Grayscale Ethereum Classic Trust (ETCG) shares, according to a recent SEC filing.\n\nDCG is one of the largest crypto conglomerates on the market and counts Grayscale Investments, the trust’s issuer, as one of its subsidiaries.\n\nAccording to the filing, Silbert has moved to liquidate nearly 120,000 ETCG shares, worth an aggregate market value of approximately $755,295 dollars. This also appears to be the first time Silbert has sold any of his ETCG shares, according to SEC filings.\n\nAD\n\nAD\n\nThe ETCG fund, which launched in 2017, allows investors to gain exposure to Ethereum Classic (ETC) through a brokerage account. ETC and Ethereum (ETH) used to be the same thing until 2016, when developers implemented a hard fork of the network to return millions worth of stolen funds to investors after a hack. The fork was notably backed by Ethereum co-founder Vitalik Buterin.\n\nThe ETCG sale represents a small portion of the fund’s $225 million assets under management and 14 million outstanding shares—of which Silbert is a 10% shareholder. He’s also listed as one of the fund’s directors.\n\nThe sale was brokered by New York-based firm Cannacord Genuity on April 28 on the OTCQX, the highest tier of over-the-counter (OTC) market for trading securities, according to the SEC filing.\n\nSilbert’s shares were originally purchased during two privately negotiated transactions over the 2017-2018 period. So far, he hasn’t made any official comments on the recent transaction.\n\nIt’s a somewhat surprising development to see the crypto permabull selling his ETCG shares. Silbert has been in the crosshairs over the past months, due to a $630 million dollar debt DCG-owned lending desk Genesis owes to Gemini, a crypto exchange and custodian owned by the Winklevoss twins.\n\nAD\n\nAD\n\nEarlier this week, the companies announced they had entered into a 30-day mediation process to settle the outstanding loan balance. “If DCG is unable to pay and/or restructure its debt, DCG risks defaulting on its obligations,” Gemini said in a statement."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vdW5jaGFpbmVkY3J5cHRvLmNvbS9ldGhlcmV1bS1kZXZlbG9wZXJzLW91dGxpbmUtcGxhbnMtZm9yLWRlbmN1bi1uZXR3b3JrLXVwZ3JhZGUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Ethereum Developers Outline Plans for 'Dencun' Network Upgrade - Unchained - Unchained",
        "content": "The core feature of the Dencun upgrade is EIP-4844, or Proto-Danksharding, which will make Layer 2 transactions significantly cheaper.\n\nDencun will be the next major network upgrade after Shapella, and has the potential to lower transaction costs on Ethereum.\n\nIn a blog post published this week, Ethereum core developer Tim Beiko revealed the next set of major Ethereum Improvement Proposals (EIP) that have been tentatively included in the Dencun upgrade.\n\nDencun, a term coined by a combination of the star Deneb and Mexican city Cancun, follows a similar naming convention to Shapella, which was named after the Chinese city Shanghai and northern-constellation star Capella.\n\nThe upgrade will focus on bringing improvements and changes to Ethereum’s execution layer through four EIPs that have been decided upon so far. Just like most of the attention in the Shapella upgrade was centered around EIP-4895, which enabled validator withdrawals from the Beacon Chain, the focus of this upgrade will likely be EIP-4844, otherwise known as “Proto-Danksharding” or “The Surge.”\n\nThis EIP will introduce temporary “data blobs” to the Ethereum network, which Layer 2 networks can use to post the transaction/proof data currently stored elsewhere. The fact that blobs are store ephemerally means that gas costs will be significantly lower, which will lead to much cheaper Layer 2 transactions, explained Beiko.\n\n“While not quite as big as The Merge, EIP-4844 is a significant change to Ethereum: it introduces a whole new data layer to the network, which both the current consensus and execution layers must interact with,” he said.\n\nIntroducing EIP-4844 will also mean there is less room for other changes to the network, but developers have still included three other EIPs alongside it. These include EIP-1153, which improves blockspace availability, EIP-6475, that makes transaction formats forward-compatible, and EIP-6780, which deactivates the code used to terminate a smart contract.\n\nBeiko did not specify when this upgrade would be deployed, but said that the next update on Dencun’s finalized scope would likely be the first testnet fork announcement."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vZm9ya2FzdC5uZXdzL2V0aGVyZXVtLW5mdC13YXNoLXRyYWRlcy1hcHJpbC1jcnlwdG9zbGFtL9IBQ2h0dHBzOi8vZm9ya2FzdC5uZXdzL2V0aGVyZXVtLW5mdC13YXNoLXRyYWRlcy1hcHJpbC1jcnlwdG9zbGFtL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Ethereum had over US$635 mln in NFT wash trades in April, CryptoSlam reveals - Forkast News",
        "content": "Over US$635 million of Ethereum non-fungible token sales in April were wash trades, which made up nearly 60% of all NFT trades on the blockchain for the month, according to new data from CryptoSlam,\n\nThe new data also revealed wash trading activities on Solana, Binance, Polygon, Cardano, Flow and Arbitrum, which had been largely unknown until now.\n\nWash trades refer to an investor acting as both the buyer and seller of a financial instrument to generate misleading trading volume and potentially manipulate prices. The practice is illegal in U.S. securities markets.\n\nBlur marketplace’s point farming is the primary driver of Ethereum NFT wash trades, leading to US$3.4 billion worth of NFT trades being flagged as wash sales so far this year. Blur traders’ bids and listings are incentivized by the marketplace’s points — the platform’s loyalty system — fueling some traders’ reliance on bulk wash sales to maximize points, which is subsequently rewarded in the form of Blur’s utility token, $BLUR.\n\nIn March, over US$1.1 billion, or 66% of all NFT sales on Ethereum, were wash trades. However, the single highest wash trading day occurred on Feb. 20, days after the launch of $BLUR. Traders aggressively farmed points to earn more $BLUR token rewards, resulting in over 85% of the day’s sales volume, valued at US$295 million, being flagged as wash trades.\n\nMonthly sales and wash transactions on Ethereum in 2023\n\nFebruary, March, and April stand out as high points for wash trading on Ethereum, with a combined total value of over US$3.135 billion. At the peak of wash trading on March 4, 2023, daily NFT wash trades transactions on Ethereum reached 49,806 compared to 2,743 on April 16, 2022, the apex of $LOOKS token farming.\n\nSimilar to $BLUR token farming in 2023, traders in early 2022 were farming $LOOKS tokens at the then-new LooksRare marketplace. CryptoSlam’s data has revealed $LOOKS farming as the driving factor behind US$819 million in wash sales that took place on Jan. 19, 2022, the most successful day for wash trading ever. Over US$18 billion in wash trades were flagged in January and February 2022.\n\nThough the value of wash trading sales has decreased since last year, the number of transactions has grown nearly 20x, CryptoSlam data shows.\n\nThe top two wash-traded collections across all blockchains are Ethereum’s Terraforms and Meebits, with US$11.5 billion and US$9 billion in flagged trades, respectively. Standout NFTs from these collections include Terraforms #4206, which has been wash traded for 86,905.12 ETH (US$242.97 million), and Meebit #13824 for 29,453.9 ETH (US$99. 4 million).\n\nMeebit #13824 (left) and Terraform #4206 (right).\n\nHighlighting the extent of traders’ practices, CryptoSlam has uncovered US$31 billion in all-time wash trade sales volume on Ethereum, totaling 41% of the blockchain’s US$74 billion in sales. An additional US$330 million in wash trades is reflected across the other top 10 NFT blockchains, making up a much smaller percentage of their all-time sales.\n\nWash trading is expected to continue and possibly increase on Ethereum as traders use liquidity-providing tools like BenDAO, NFTfi and Blur’s new Blend lending protocol to pursue more platform rewards in Blur’s Season 2.\n\n1/ Introducing Blend: the Peer-to-Peer Perpetual Lending Protocol for NFTs.\n\n\n\nBuilt in collaboration with @danrobinson and @transmissions11 at @paradigm, Blend enables 10x higher yield opportunities than current DeFi protocols and unlocks greater liquidity for NFTs.\n\n\n\nHere’s how 👇 pic.twitter.com/uOFC6i3LSq — Blur (@blur_io) May 1, 2023\n\nWhile Ethereum owns the bulk of global wash sales due to $LOOKS and $BLUR token farming, it is expected to continue on other chains with a growing number of marketplaces adopting reward incentives.\n\n(Update: edits third paragraph to clarify wash trading defintion)"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vZGFpbHljb2luLmNvbS9jYXJkYW5vcy1oeWRyYS12cy1saWdodG5pbmctbmV0d29yay1zaGFyZGluZy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "How Cardano's Hydra Layer-2 Is Challenging Bitcoin Lightning Network and Ethereum Sharding - DailyCoin",
        "content": "Cardano released its Layer-2 scalability solution, Hydra.\n\nHydra introduces a novel scaling solution that challenges Bitcoin, Ethereum, and others.\n\nAccording to Charles Hoskinson, Cardano’s new solution could make it the fastest, most scalable network.\n\nCardano has long been vying for a spot among the top cryptocurrency projects. Now, with its scalability solution Hydra up and running, it has solidified its position as a major player in the industry, standing alongside its more established peers, Bitcoin and Ethereum.\n\nHydra, the Layer-2 solution from the Proof of Stake (POS) Chain, is one of the most highly anticipated upgrades. Now that it is here, people are excited to see it deliver Cardano’s promise of being the fastest and most scalable payment network in the world, challenging the likes of Bitcoin and Ethereum.\n\nWhat Is Hydra?\n\nThe Hydra Head Protocol or Hydra is Cardano’s open-source Layer-2 scalability solution that, according to Charles Hoskinson, would make Cardano the fastest payment network in the world.\n\nAnnounced in September 2019, after much anticipation, delays, and hurdles, Hydra finally made it to the Cardano main chain in May 2023, thanks to engineers from the Cardano Foundation and IOHK.\n\nHydra is an isomorphic scaling solution. This means it replicates Cardano’s functionality and security guarantees on an off-chain ledger network while maintaining communication between the two layers.\n\nCardano Hydra use case. Source: Hydra Head Protocol.\n\nIt operates almost similarly to state-channel solutions such as Bitcoin’s Lightning Network and Ethereum’s Raiden Network. Users can securely and instantly perform transactions on their private networks, in this case, Hydra heads, and settle the result on the main chain, enabling faster and cheaper transactions while keeping the integrity and security of the network.\n\nWhat’s unique about Hydra is that off-chain ledgers through Head nodes can act as special dApps for developers who look to scale their apps. With Hydra, developers can independently run on-chain scripts or software stack on their private nodes and securely publish the result on the main chain instantly and at a low price.\n\nHydra brings a solid solution, allowing Cardano to compete with Ethereum and Bitcoin.\n\nIn Contrast with Other Scalability Solutions\n\nBoth Bitcoin and Ethereum have long established themselves in the cryptocurrency world, with the latter powering a myriad of Layer-2 protocols. Additionally, Ethereum’s sharding and Bitcoin’s lightning network are some of the best solutions in the space, earning the networks a collective market cap of $807 billion.\n\nAlthough Cardano is often compared with Bitcoin and Ethereum, its string of delays and issues drew much criticism from the community, leading to slow growth evident with its $13 billion market cap. However, with Hydra in the mix, it can finally sit at the table with its solution.\n\nEthereum, Cardano, and Bitcoin Compared\n\nWhile Ethereum Sharding, Bitcoin Lightning Network, and Cardano’s Hydra solution may come from the same family or operate similarly, comparing or saying one is better wouldn’t be fair. Each scalability solution has its pros and cons and addresses different challenges.\n\nSharding is a Layer-1 solution that focuses on increasing the network’s capacity and increasing the overall transaction throughput of the network. It breaks the blockchain into shards that process transactions parallel to the main chain.\n\nHowever, according to Charles Hoskinson, Sharding is “very complex.” Because of this complexity, network security and performance drastically defer because it operates on the main chain. Additionally, it requires a lot of resources and can be expensive to implement.\n\nHydra, on the other hand, creates an independent off-chain ledger network that replicates the security and functionality of the Cardano chain, allowing it to maintain both security and performance without congesting the main chain. It doesn’t rely on soft or hard forks, making it inexpensive and straightforward to implement.\n\nConversely, Bitcoin Lightning Network is a Layer-2 solution on top of Bitcoin, which uses bi-directional off-chain payment channels between users, enabling fast, cheap, and scalable transactions.\n\nHowever, because it uses payment channels, it only supports asset transfer, unlike Hydra, which allows developers to run scripts and elaborate transactions instantly off-chain as it would on the main chain.\n\nOn the Flipside\n\nAn Ethereum founder accused Cardano Founder of contributing nothing to Ethereum.\n\nMany competitors called Cardano’s EUTXO design a security flaw; Hoskin replied that the model made it more secure.\n\nWhy You Should Care\n\nCardano’s Hydra solution brings competition to the space. The better the competition, the better the solutions, leading to greater adoption. Cardano’s new protocol could significantly elevate the network’s status in the cryptocurrency industry and attract more developers to build apps on the network.\n\nFAQs\n\nWhat is Hydra on Cardano? Hydra is Cardano’s Layer-2 scaling solution that creates independent off-chain ledgers with functionality, features, and security similar to the Cardano main chain. Is Hydra built on Cardano? Yes, Hydra is built on Cardano. It is a Layer-2 scaling solution that processes transactions on an off-chain ledger and settles the result on the main chain. Is Hydra a Layer-2? Yes, Hydra is a Layer-2 solution on Cardano. It operates on top of Cardano to maximize the throughput and functionality of the underlying blockchain. Is Cardano Layer-1 or Layer-2? In blockchain-speak, Layer-1 is the base blockchain where all network activity and transactions are validated and finalized. Cardano is Layer-1.\n\nRead about other blockchains’ developments:\n\nHow Flare’s New Blockchain APIs on Google Cloud Impact Web3\n\nRead what Charles Hoskinson has to say:\n\nCardano Founder Charles Hoskinson Responds to Jab by Ethereum Co-Founder"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2N1cnZlLWRlcGxveXMtc3RhYmxlY29pbi1zbWFydC1jb250cmFjdNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 May 2023 07:00:00 GMT",
        "title": "Curve Deploys Stablecoin Smart Contract on Ethereum - Blockworks",
        "content": "Curve Finance has deployed the smart contract for its stablecoin crvUSD on Ethereum.\n\nThe project designed the stablecoin using the Lending-Liquidating Automated Market Maker Algorithm (LLAMMA), which is a combination of both a traditional AMM and a lending market.\n\nAccording to a white paper from last October, LLAMMA uses an external oracle that ensures that crvUSD pools are made up of two different assets: crvUSD and the asset used to mint the stablecoin (such as ETH or BTC). This differs from other AMM designs, where assets are swapped at the price determined by the AMM curve.\n\nWhen the price of the collateral is higher, all of the user’s deposits will be in the deposited collateral, but as the price of the collateral goes lower, the oracle will convert the deposits to crvUSD.\n\nCurve deployed its initial crvUSD smart contracts yesterday, but a minor issue where fees were not flowing to the project’s DAO was noted by its team, Blockworks Research Senior Analyst Dan Smith said.\n\nThis protocol resolved this minor issue after Curve Finance redeployed an updated smart contract this morning.\n\nEven though information on Etherscan shows that Curve minted an initial 20 million crvUSD, Smith notes that this was part of the deployment process and the tokens themselves did not leave the system.\n\n“crvUSD only becomes circulating after it has been borrowed by an end user,” he said.\n\nAt the time of writing, Michael Egorov, the founder and CEO of Curve Finance, has the only open loan of $1.05 million.\n\nThe final step, Smith noted, will be to push the user interface onto the Curve website.\n\n“With two major releases during the depths of the bear market (crvUSD and upgraded tri crypto contracts), Curve is well positioned for success when liquidity and volume returns,” Smith said.\n\n“Curve now controls multiple parts of [the] DeFi stack with a DEX, lending market, and stablecoin.”\n\nTo learn more about Curve Finance and its Q1 performance, check out this detailed report by Blockworks Research.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1ldGgtZGVjb2RpbmctdGhlLXBvc3NpYmlsaXR5LW9mLWEtcHJpY2UtY29ycmVjdGlvbi1hcy1mYWlsZWQtdHJhbnNhY3Rpb25zLXN1cmdlL9IBc2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1ldGgtZGVjb2RpbmctdGhlLXBvc3NpYmlsaXR5LW9mLWEtcHJpY2UtY29ycmVjdGlvbi1hcy1mYWlsZWQtdHJhbnNhY3Rpb25zLXN1cmdlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 May 2023 07:00:00 GMT",
        "title": "Ethereum [ETH]: Decoding the possibility of a price correction as failed transactions surge - AMBCrypto News",
        "content": "The total number of failed Ethereum transactions exceeded 500,000.\n\nETH’s price craters as network activity experienced a dip.\n\nAccording to data from CryptoQuant, there was a significant surge in the total number of failed Ethereum[ETH] transactions, reaching over 500,000 as of 2 May.\n\nHow much are 1,10,100 ETHs worth today?\n\nTaking a cue from ETH’s historical performance, pseudonymous CryptoQuant Analyst MACD, found an interesting fact. Whenever the total count of failed ETH transactions exceeded 200,000, it indicated “market overheating” and was often followed by price corrections.\n\n“In the past, when Ethereum’s transaction failures rise above 200,000, it shows a market overheating and has often seen a price correction.”\n\nTo brace for a price correction or not?\n\nIn the last month, ETH’s price oscillated between $2100 and $1800. At press time, the leading altcoin exchanged hands at $1,869, with a 2% price rally within the past 24 hours, data from CoinMarketCap showed.\n\nOn-chain assessment of ETH’s performance revealed a decline in network activity since 14 April. According to Santiment, the count of daily active addresses that have since traded the alt fell by 41%.\n\nAdditionally, the number of new addresses created daily on the ETH network has plummeted as well. Information from the on-chain data provider revealed the creation of 12,492 new addresses on the ETH network on 1 May. This represented an 86% drop from the 91,560 new addresses created on 14 April.\n\nWith the continued decline in the count of new and active addresses trading ETH, the coin’s value fell from $2100 on 14 April to $1,869 at press time.\n\nIn addition to a fall in its network activity, ETH’s funding rates fell to a one-month low of -0.013 on 3 May. When a crypto asset records negative funding rates, it means that most traders in the market are taking short positions or betting against the asset.\n\nAs a result, it is often taken as an indicator of bearish sentiment and sometimes precipitates a decline in an asset’s value.\n\nFurthermore, as ETH’s price fell since mid-April, holders of 1000 to 100,000 ETH coins gradually distributed their ETH holdings, contributing to the decline in value, per data from Santiment.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nInterestingly, bigger whales, that hold between 100,000 to 10,000,000 ETH coins, increased their holdings during the same period. However, with bearish sentiments still lingering in the market, this has failed to result in any significant price rally.\n\nAt press time, ETH’s Relative Strength Index (RSI) and Money Flow Index (MFI) were positioned beneath their respective neutral spots, in downtrend positions. This indicated waning buying pressure and highlighted the need for new demand to drive up the alt’s value."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMDUvZXRoZXJldW1zLW1lZGlhbi1nYXMtcHJpY2Utc3VyZ2VzLXRvLTEyLW1vbnRoLWFzLXBlcGUtZnJlbnp5LWdyaXBzLW1hcmtldC_SAXpodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA1LzA1L2V0aGVyZXVtcy1tZWRpYW4tZ2FzLXByaWNlLXN1cmdlcy10by0xMi1tb250aC1hcy1wZXBlLWZyZW56eS1ncmlwcy1tYXJrZXQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Ethereum Gas Fee Surges to 12-Month High as PEPE Frenzy Grips Market - CoinDesk",
        "content": "PEPE surpassed the $500 million mark in market capitalization within three weeks of the launch. Similar frenzied activity has been seen other smaller coins. For instance, CHAD and 4TOKEN have rallied 450% and 250% in one week, while DINO has risen 500% in two weeks."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZGVjcnlwdC5jby8xMzg5ODkvcGVwZS1tZW1lLWNvaW4taHlzdGVyaWEtcHVzaGVzLWV0aGVyZXVtLWdhcy1mZWVzLTEteWVhci1oaWdo0gFcaHR0cHM6Ly9kZWNyeXB0LmNvLzEzODk4OS9wZXBlLW1lbWUtY29pbi1oeXN0ZXJpYS1wdXNoZXMtZXRoZXJldW0tZ2FzLWZlZXMtMS15ZWFyLWhpZ2g_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "PEPE Meme Coin Hysteria Pushes Ethereum Gas Fees to 1-Year High - Decrypt",
        "content": "Create an account to save your articles.\n\nCreate an account to save your articles.\n\nYour Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum’s gas fees have surged above a one-year high as the demand for trading the PEPE meme coin continues to soar.\n\nThe average cost of a single transaction on Ethereum jumped above $15.82 on May 4.\n\nWhile Ethereum’s mean transaction fees have reached much higher levels of between $50 to $70 in 2021, things have been quiet since the market crashed in May 2022.\n\nAD\n\nAD\n\nDaily median gas price. Source: Etherscan .\n\nIt’s likely that excitement around meme coins, specifically the newly-launched PEPE, is responsible for the revival in gas fees.\n\nIn the last 24 hours, the trading volume for PEPE surpassed $150 million on Uniswap, higher than Wrapped Bitcoin (WBTC) and USDT stablecoin volumes.\n\nThe PEPE token also entered the top 100 largest cryptocurrencies by market capitalization on May 1, obtaining a valuation of over $500 million. The token has continued to surge since then, last trading at a market value of $879 million.\n\nFollowing the success of PEPE coin, numerous copycats have also emerged representing different internet memes.\n\nData from crypto analytics firm Nansen shows that the most active smart contracts on Ethereum are currently Uniswap trading pools for meme coins such as SPONGE, TURBO, BOB, and TRBNR.\n\nAD\n\nAD\n\nMost used DeFi contracts on Ethereum on May 5, 2023. Source: Nansen\n\nThe increased gas fees witnessed 9,392 in ETH burned over the last 24 hours, at par with one-year high levels.\n\nEthereum executed a hard fork in 2021 which meant that a portion of all Ethereum transactions were destroyed. Thus, as activity increases on the network, more ETH is destroyed.\n\nThe rise in Ethereum’s transaction fees has led to a rise in gas fees for Layer-2 transactions as well.\n\nAre Ethereum scaling solutions helping?\n\nThe gas fees for layer-2 transactions have also surged with mainnet fees as related data for layer-2 transactions are also posted in layer-1 blocks for security.\n\nThere are two kinds of layer-2 scaling solutions: zero-knowledge proofs and optimistic. Both use another technology called rollups, which batch transactions off of the mainnet into a single, smaller transaction before settling on the mainnet.\n\nNotably, zero-knowledge proof (ZK)-based rollups were hit relatively worse than optimistic rollups. The fees for swapping tokens on ZK-based scaling solutions like Polygon zkEVM, Starknet, and zkSync Era mainnet surged between $2 to $11.\n\nA zkSync Discord community member noted they had to pay $11 swap ETH to USDC, noting in amazement that “Is it gonna cost that much?”\n\nAnother user complained about $30 in fees for DeFi deposits on zkSync.\n\nAD\n\nAD\n\n$30 gas fee on Layer 2 $ZKS $ZKSYNC @zksync\n\nI don't understand, I thought layer 2 were made to reduce gas fees 😱😱 pic.twitter.com/Uz6k5p4bC5 — Kool Crypto ⚙️🛸 (@healthymofin) May 5, 2023\n\nAccording to L2 Fees data, the gas fees for sending ETH on Arbitrum One and Optimism, both of which are Optimistic rollup solutions, are between $0.2 to $0.6 for swap tokens, which is around ten times higher than the mean value."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMikAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNS8wNS90b3AtdHJhZGVyLXVwZGF0ZXMtb3V0bG9vay1vbi1iaXRjb2luLWFuZC1vbmUtbmV3LWV0aGVyZXVtLXJpdmFsLXNheXMtdGhpcy1jcnlwdG8tYXNzZXQtY2xhc3MtaXMtZ29pbmctdG8temVyby_SAZQBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDUvMDUvdG9wLXRyYWRlci11cGRhdGVzLW91dGxvb2stb24tYml0Y29pbi1hbmQtb25lLW5ldy1ldGhlcmV1bS1yaXZhbC1zYXlzLXRoaXMtY3J5cHRvLWFzc2V0LWNsYXNzLWlzLWdvaW5nLXRvLXplcm8vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Top Trader Updates Outlook on Bitcoin and One New Ethereum Rival, Says This Crypto Asset Class Is Going to Zero - The Daily Hodl",
        "content": "A popular crypto strategist is updating his outlook on Bitcoin (BTC) and one Ethereum (ETH) rival as he warns memecoins are likely to collapse.\n\nPseudonymous analyst Altcoin Sherpa tells his 195,100 Twitter followers that Bitcoin continues to lack a clear upward or downward trend and remains trading sideways.\n\nAccording to his chart, Sherpa says Bitcoin has been chopping around in the $25,000 to $30,000 range for the past 48 days. The previous range Bitcoin chopped around in was between about $19,500 and $25,000 and that lasted 57 days.\n\n“BTC: The problem for most traders the last six months is that there hasn’t been a continuous trending environment like in 2020 and 2021 (for alts). Lots of chop overall and just a few trending weeks followed by more chop. Know yourself and where to trade.”\n\nBitcoin is trading for $29,305 at time of writing, up 1.5% during the past 24 hours.\n\nAlso on the trader’s radar is the new layer-1 blockchain Sui Network (SUI).\n\nBased on Fibonacci retracement levels, a method of technical analysis for determining an asset’s support and resistance levels, Sherpa believes SUI will revisit a lower range of $1.29. However, he warns if Bitcoin dips, SUI could drop down to $1.24.\n\n“SUI: Expecting range lows to come eventually around $1.29, but it’s going way lower if Bitcoin shits the bed IMO (In my opinion). Still, it looks like somewhat accumulation phase as long as BTC is stable.”\n\nSui Network is worth $1.31 at time of writing, down 1.9% during the past 24 hours.\n\nNext, the trader weighs in on skyrocketing Pepe (PEPE), a memecoin that launched last month. He warns Pepe and other meme tokens are likely going to collapse.\n\n“PEPE derivatives are going to moon, aka all the other memecoins right now. But be warned; these are all going to go to $0 and will be short lived. Full on casino over the next few weeks IMO (in my opinion), same story as it always is.”\n\nLastly, Altcoin Sherpa looks at layer-2 scaling solution Arbitrum (ARB).\n\nHe predicts Aribitrum will dip lower by looking at several Exponential Moving Averages (EMAs) and the Fibonacci retracement levels. Traders look at the EMA to determine whether an asset’s price is in a downtrend. If the price is below the EMA, then the asset is likely going to remain bearish.\n\n“ARB: Haven’t paid as much attention to this one lately, but I wouldn’t be surprised if it falls through and goes to the $1.15-$1.20 area again. This is still a great chain but new flavor of the month (SUI) + memecoin madness (PEPE) are sucking liquidity out of ‘normal’ coins.”\n\nArbitrum is worth $1.36 at time of writing, up 3% during the past 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Kartavaya Olya/Sol Invictus/monkographic"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9ldGhlcmV1bS1tZWRpYW4tZ2FzLWZlZS1oaXQtMTItbW9udGgtaGlnaC1hbWlkLW1lbWVjb2luLXJlc3VyZ2VuY2Uv0gFgaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL2V0aGVyZXVtLW1lZGlhbi1nYXMtZmVlLWhpdC0xMi1tb250aC1oaWdoLWFtaWQtbWVtZWNvaW4tcmVzdXJnZW5jZS8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Ethereum Median Gas Fee Hit 12-Month High Amid Memecoin Resurgence - CryptoPotato",
        "content": "In recent weeks, the Ethereum community has been grappling with an issue causing concern for many users – the rapidly increasing gas consumption on the network.\n\nGas fees are charged for processing transactions on the Ethereum blockchain, and they have been rising at an alarming rate.\n\nEthereum Gas Fee Hits 12-Month High\n\nAccording to data from Dune, shared by data scientist Hildobby, the median price of ETH gas, measured in gwei and averaged over seven days, has surged to 87, a level not seen in the past 12 months – since May 2022. The average transaction fee now hovers around $50, a significant increase from just a few months ago when it was less than $10.\n\nThe high gas fees have caused frustration among users, who find it increasingly expensive to perform even simple transactions on the network. Many small-scale users, such as decentralized application (dApp) developers, traders, and retail investors, are finding it difficult to participate in the Ethereum ecosystem due to the high cost of gas fees.\n\ntry to buy a ~$20 NFT on eth, and the gas is ~$40.\n\nsome ppl say the infra operators deserve to be paid. sure, but imaging paying visa $40 fee for buying a $20 digital good.. infra should be affordable. pic.twitter.com/5L4SYjT5af — 0xMQQ (@0xMQQ) April 18, 2023\n\nMemecoins Return\n\nThe issue is primarily due to the increasing demand for processing transactions on the network, as memecoins return to the market after being silent for almost two years. Over the past few weeks, memecoin trading has gained momentum, with most of the trading activities taking place on the Ethereum blockchain.\n\nOne such memecoin is PEPE, whose market cap jumped by more than 100x within the last two weeks after its launch in mid-April. Other memecoins that have recorded significant hype over the past few weeks include ArbDogeAI, WOJAK, and SHIBAI.\n\nAnother possible reason for the high ETH gas fee is the resurgence in NFT trading on the Ethereum blockchain. While such volumes declined significantly in April, perhaps due to the rebirth of memecoins, reports revealed that they reached $4.7 billion in Q1, 2023, a 137% from the previous year.\n\nFurthermore, data from the blockchain intelligence platform Glassnode revealed that gas consumption from NFT-related activities on Ethereum surged by 94% between January and February.\n\nThe Way Forward\n\nThe Ethereum community is actively working on solutions to address the issue, including implementing Ethereum Improvement Proposal (EIP) 4844. This proposal aims to reduce gas fees and transaction throughput by introducing a new type of transaction that accepts “blobs” of data.\n\nIn the meantime, users have been forced to adjust their strategies, with some opting to perform transactions during off-peak hours when gas fees are typically lower. Others have been switching to alternative blockchain networks that offer lower fees or opting for layer 2 scaling solutions such as Polygon to reduce the cost of transactions."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiMWh0dHBzOi8vd3d3LmxjeC5jb20vZXRoZXJldW0tdmlydHVhbC1tYWNoaW5lLWV2bS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 May 2023 07:00:00 GMT",
        "title": "Ethereum Virtual Machine (EVM) - LCX",
        "content": "The Ethereum Virtual Machine (EVM) is designed as the runtime environment for Ethereum smart contracts. EVM functions similarly to a decentralized computer with millions of executable projects. It serves as the virtual machine that supports Ethereum’s whole operating system and is responsible for the execution and deployment of smart contracts.\n\nThe EVM lies atop the hardware and node network layers of Ethereum. It is Turing-complete and can therefore execute any program written in any programming language, letting developers write smart contracts and decentralized applications (DApps) for the emerging Web3 area with ease.\n\nIts primary function is to compute the network’s status and to execute and compile different types of smart contract code into a human-readable format known as “Bytecode.” This enables Ethereum nodes to identify smart contracts deployed on EVM-compatible chains such as Polygon or Avalanche and enables developers to easily move their Dapps or tokens from Ethereum to other EVM-compatible chains. These essential features of EVM make it one of the most powerful virtual computers currently available.\n\nHow Does It Work?\n\nThe Ethereum Network, conceived in 2013 by the programmer Vitalik Buterin, owes its phenomenal success as the blockchain of choice for DApp developers to the Ethereum Virtual Machine (EVM) that was created by Gavin Wood during his employment at Ethereum. EVM is a particular state machine that operates constantly and whose immutable actions define the state of each block in the Ethereum blockchain. It is written in C++ and uses the LLVM Project compiler.\n\nThe EVM not only governs what nodes can or cannot do to the distributed ledger maintained by the Ethereum blockchain but also defines the specific rules of changing state from block to block. This feature allows the smart contract functionality for which Ethereum has become renowned.\n\nThe EVM is a stack-based virtual machine, which means that it operates on a last-in, first-out (LIFO) data structure known as a stack with a depth of 1024 items, each of which is a 256-bit word. The 256-bit word size of the EVM makes native hashing and elliptic curve operations possible, ensuring that only the rightful owners can use the funds. For each input it receives, the EVM generates an output that is deterministic and mathematically function-like in the most basic sense. This stack is used to hold and manipulate data during the execution of smart contracts. When a smart contract is executed on the EVM, the code is run through a series of operations that manipulate the stack.\n\nMoreover, the EVM supports a variety of programming languages, including Vyper and Solidity, with Solidity being the most widely used language for smart contract source code. These programming languages are applied to create smart contracts, which are then transformed into the bytecode required for the EVM. The on-chain bytecode, also known as the runtime bytecode, is subsequently turned into an opcode that the EVM computing engine interprets in order to carry out the specified activities."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLWdhcy1mZWVzLWhpdC1yZWNvcmQtbGV2ZWxzLWFtaWQtcGVwZS1tZW1lLWNvaW4taHlwZS1mbGlwcy1zaGliLWRvZ2Uv0gFmaHR0cHM6Ly9jb2luZ2FwZS5jb20vZXRoZXJldW0tZ2FzLWZlZXMtaGl0LXJlY29yZC1sZXZlbHMtYW1pZC1wZXBlLW1lbWUtY29pbi1oeXBlLWZsaXBzLXNoaWItZG9nZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Ethereum Gas Fees Hit Record Levels Amid PEPE Meme Coin Hype; Flips SHIB, DOGE - CoinGape",
        "content": "Ethereum gas fees are again touching record levels as meme coins take over the crypto space by storm. The frog-themed meme coin PEPE hype has especially caused Ethereum gas fees to hit a yearly high.\n\nThe high gas fee is making transactions costly for users, while also pushing up prices amid demand for meme coins such as PEPE.\n\nadvertisement\n\nEthereum Gas Fees Reaches Yearly High\n\nAccording to data by Etherscan, the average gas prices reached 94 gwei and even hit a high of 184 gwei on May 5. The massive jump in Ethereum gas fees is due to the increase in demand for meme coins on the Ethereum network, making transaction costs higher.\n\nThe hype surrounding PEPE meme coin and profits made by investors by trading in the meme coin is causing most people to swap their crypto including other meme coins to PEPE through Uniswap. The average transaction cost on Uniswap has jumped to $32.60.\n\nAs per data, transactions on Uniswap alone have burned over 15,000 ETH in the last 7 days. Uniswap currently accounts for 35% of gas fees, becoming the top “Gas Guzzler” in the last few days.\n\nIn the last 24 hours, the trading volume for PEPE jumps over $150 million on Uniswap, surpassing Tether (USDT) stablecoin and wrapped BTC (WBTC).\n\nAlso Read: Top Exchange Lists Pepe Coin After 200% Rally, Will It Flip SHIB and DOGE?\n\nPEPE Price Skyrockets Over 600% in a Week\n\nPEPE price has skyrocketed over 600% in a week as whales and traders pour money into the frog-themed meme coin. The market cap has reached $848 million, entering the top 100 crypto list.\n\nPEPE price jumped 30% in the last 24 hours, with the price currently trading at $0.00000202. The 24-hour low and high are $0.00000151 and $0.00000232, respectively. Furthermore, the trading volume has increased by 150% in the last 24 hours, indicating an interest among traders.\n\nAlso Read: Coinbase Legal Chief Takes Pre-Emptive Strike Against US SEC"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZGVjcnlwdC5jby8xMzg5NjEveW91LWNhbi1taW50LWEtZnJlZS1ldGhlcmV1bS1uZnQtZm9yLWtpbmctY2hhcmxlcy1jb3JvbmF0aW9u0gFcaHR0cHM6Ly9kZWNyeXB0LmNvLzEzODk2MS95b3UtY2FuLW1pbnQtYS1mcmVlLWV0aGVyZXVtLW5mdC1mb3Ita2luZy1jaGFybGVzLWNvcm9uYXRpb24_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "You Can Mint a Free Ethereum NFT for King Charles’ Coronation - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nHear ye, hear ye! Just in time for the coronation of King Charles III and Queen Camilla on May 6, the Evening Standard newspaper has teamed with digital artist Trevor Jones to launch a free collection of commemorative Ethereum NFT celebrating the event on Nifty Gateway.\n\nCreated in collaboration with Apollo NFT, “The Oath” can be claimed directly on Nifty Gateway or by using a QR code printed in the newspaper. The QR codes are also posted on billboards along Oxford Street, for those travelling to the capital to take part in the celebrations in person. But before you let the FOMO set in, the NFTs won’t be minted and delivered to collectors' wallets until May 7.\n\n“With the eyes of the world on London this weekend, we are extremely proud to collaborate with Trevor Jones and celebrate this iconic moment for our city,” Evening Standard CEO Charles Yardley said. “Trevor’s NFT depicts imagery representing centuries of tradition and history, in a format that represents how the modern world is democratising art for both artists and collectors.”\n\nAD\n\nAD\n\nThe Oath NFT began as a physical painting by Jones in his Edinburgh studio. The artwork depicts Saint Edward’s Crown, worn by Queen Elizabeth II in her 1953 coronation.\n\n“With Layer-2 in play now and the carbon footprint down 99.99%, there’s no longer an environmental issue with using the Ethereum blockchain,” Jones told Decrypt. “More importantly, however, I saw this as a fantastic opportunity to onboard new collectors into the NFT art scene, which is currently hitting quite the lows from the last couple of years.”\n\nLayer-2 refers to a protocol built on a blockchain like Immuntable X or the Bitcoin Lightning Network.\n\nThis looks incredible! @W1curates lighting up Oxford St., London with the NFT artwork 'The Oath' celebrating the King's #Coronation. Claim your free edition of the NFT here 👇 👑 https://t.co/n0uEBYTnAd In partnership with @EveningStandard & @ApolloNft #CoronationWeekend pic.twitter.com/w0hWHDhkqm — Trevor Jones 🎨 (@trevorjonesart) May 4, 2023\n\n“Dropping on Nifty Gateway meant that anyone could register an account simply with an email address and mint their first NFT artwork,” Jones said, adding that he wanted the process to be as simple as possible for collectors minting their first NFT.\n\nAD\n\nAD\n\nThe Evening Standard joins other media outlets making the leap into Web3, including TIME, GQ, and Playboy.\n\nThe Oath isn't the first NFT mint to commemorate the British royal family. In September, following the passing of Queen Elizabeth II, an NFT collection, QueenE by Web3 builders Fabio Sevá, Vinícius Rodrigues, Everton Matumoto, and the pseudonymous mladen.eth, was launched to celebrate the life of England’s longest (1952-2022) reigning monarch.\n\nNon-fungible tokens, NFTs, are cryptographically unique tokens linked to digital and physical content, providing proof of ownership, authenticity, or membership in a group. Previous collections by Jones include Bitcoin Angels, Man vs. Machine with rap icon Ice Cube, and Picasso’s Bull."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3lvZGEtY29pbnMtc3VkZGVuLWNvbGxhcHNlLWhvdy1pbnZlc3RvcnMtbG9zdC1vdmVyLTEyOWstaW4tZXRoZXJldW0tdG8tYS1ydWctcHVsbC1zY2FtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Yoda coin's sudden collapse: how investors lost over $129K in Ethereum to a rug pull scam - CryptoSlate",
        "content": "YODA coin rug pulled and lost 100% of its value on May 5, as crypto sleuth PeckShieldAlert revealed.\n\nThe project deleted its Twitter account, and the scammer already transferred over 68 Ethereum (ETH), according to PeckShieldAlert’s tweet.\n\nThe rug pull\n\nAvid crypto collector @borovik.eth was one of the first ones to realize the pull. He tweeted a screenshot of Yoda Coin’s official account, which was inaccessible.\n\nCrypto Twitter then provided additional information about the suspended addresses in the comments. On-chain sleuth ZachXBT shared that the YodaCoin team also deactivated nine bot accounts with gold checkmarks.\n\nPeckShieldAlert monitored the scammers’ wallet movements and discovered that they moved over 68 ETH to the FixedFloat exchange. The amount equates to over $129,000 in ETH at the time of writing.\n\nMemecoin season\n\nEven though the crypto community’s thoughts on memecoins may vary, recent data revealed that they are, in fact, quite resilient. A CryptoSlate insight from April stated that memecoins:\n\n“Continue to defy expectations by thriving in the bear market, outperforming other cryptocurrencies and expanding their utility, attracting retail investors and newcomers to the crypto world.”\n\nPopular memecoins like Dogecoin (DOGE) and Shiba Inu (SHIB) have proven themselves to be quite profitable in the past. While their volatility has become mainstream, other memecoins have been surprising investors lately.\n\nMost recently, memecoin PEPE (PEPE) attracted the eyes of the crypto community when it soared over 90% within 24 hours on May 1. At the time of writing, PEPE continues its surge. The token recorded a 59.38% increase in the last 24 hours and a nearly 700% increase over the previous seven days.\n\nA few days later, the Turbo memecoin, created by ChatGPT, reached over a $30 million market cap within a week of its launch. Several crypto exchanges have also listed Turbo tokens as a tradable asset.\n\nAccording to CryptoSlate data, the memecoin market has 1.49% sector dominance with over a $17 billion market cap. The sector’s 24-hour volume sits at over $1.49 billion.\n\nMentioned in this article"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3Lm5mdGN1bHR1cmUuY29tL25mdC1uZXdzL2JleW9uZC1ldGhlcmV1bS1iaXRjb2luLW9yZGluYWxzLWJyZWFrLTNtLWluc2NyaXB0aW9ucy10YWtpbmctdGhlLWNyeXB0by1pbmR1c3RyeS1ieS1zdG9ybS_SAYUBaHR0cHM6Ly93d3cubmZ0Y3VsdHVyZS5jb20vbmZ0LW5ld3MvYmV5b25kLWV0aGVyZXVtLWJpdGNvaW4tb3JkaW5hbHMtYnJlYWstM20taW5zY3JpcHRpb25zLXRha2luZy10aGUtY3J5cHRvLWluZHVzdHJ5LWJ5LXN0b3JtLz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 May 2023 07:00:00 GMT",
        "title": "Beyond Ethereum: Bitcoin Ordinals Break $3m Inscriptions Taking the Crypto Industry by Storm - NFT Culture",
        "content": "Bitcoin Ordinals have recently taken the crypto industry by storm, with registrations surging to an all-time high of 3.4 million last week. This explosion of interest in the protocol is exciting news for the NFT market and suggests that the crypto industry is becoming more interested in NFTs and their applications beyond Ethereum.\n\nOrdinals Protocol allows users to embed data into the Bitcoin blockchain by inscribing references to digital art into small Bitcoin-based transactions. Despite the skyrocketing fees, the surge in daily enrollments began on April 21st and peaked on May 1st, with over 372,000 enrollments in just 24 hours. This surge in registrations contributed to an all-time high in daily BTC transactions on May 1st, reaching 682,281.\n\nAlthough most registrations for the protocol are text-based, followed by applications and JPEG images, the surge in enrollments is significant for the industry. Bitcoin Ordinals NFT is compliant with the BRC-20 standard – Bitcoin Request for Comment number 20 – which was introduced last March, enabling new tokens to be minted on the BTC network.\n\nI can't believe my eyes BRC-20 demand leading to a 700% increase in fees AFTER what we've seen with Ordinal Inscriptions 12,800% increase in fees from BEFORE Ordinal Inscriptions launched 300,000 unconfirmed transactions in the mempool pic.twitter.com/oyLceu6ODe — trevor.btc @ NYC (@TO) May 2, 2023\n\nWhat’s also interesting is that BTC maximalists used to be very opposed to ordinals, but appear to be coming around. The surge in registrations may be evidence that Bitcoin Ordinals NFT is becoming more accepted among BTC maximalists as they realize the potential for NFTs on the Bitcoin blockchain.\n\nThe explosion in numbers and daily enrollments is exciting news for the crypto industry and suggests that there is a growing demand for NFTs on the Bitcoin blockchain. With the surge in interest in Bitcoin Ordinals NFT, we can expect to see more innovation and growth in the NFT market.\n\nBitcoin Ordinals NFTs are not only contributing to the growth of the NFT market but also to the overall Bitcoin network by incentivizing miners, prioritizing valuable transactions, and enhancing network security. While the high fees may put a higher price tag on transactions on the network, proponents of Ordinals believe that the benefits outweigh the costs and that it opens up new use cases for Bitcoin, bringing in liquidity, new users, and developers, ultimately making Bitcoin more valuable through better user experience and more use cases."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL2NvaW50ZWxlZ3JhcGguY29tL3ByZXNzLXJlbGVhc2VzL2dvcmFjbGUtZW5oYW5jZXMtY3Jvc3MtY2hhaW4tY29tcGF0aWJpbGl0eS1vbi1hbGdvcmFuZC1pbXBvcnRpbmctZGF0YS1mcm9tLWV0aGVyZXVtLWFuZC1tb3Jl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 May 2023 07:00:00 GMT",
        "title": "Goracle enhances cross-chain compatibility on Algorand: Importing data from Ethereum and more - Cointelegraph",
        "content": "Goracle, the decentralized blockchain oracle solution built on the Algorand blockchain, has announced that it will now be able to import data from Ethereum and nearly any other blockchain. This feature enables developers to build cross-chain applications that can interact with multiple blockchains, increasing the overall utility ofAlgorand.\n\nGoracle’s features enables Algorand to act as a settlement layer for other blockchains, providing seamless access to data on other chains and facilitating cross-chain liquidity. This feature will enable developers to build a wide range of applications without building their own centralized oracles. For example, developers can now build DeFi apps that allow users to trade assets across multiple blockchains.\n\nOther use cases for cross-chain applications include supply chain management, gaming and asset management. For example, developers can build applications that track the movement of goods across different blockchains, verify the ownership of virtual assets in games, or manage a portfolio of assets across different blockchains.\n\nAdam Kinley, Director of Strategic Partnership at Goracle, said:\n\n“By enabling importing of data from other blockchains, Goracle is taking a major step forward in driving adoption of the Algorand blockchain. Our solution allows developers to build innovative applications that leverage the unique features of multiple blockchains while providing more opportunities for users to interact with the Algorand network.”\n\nAlgorand is already one of the leaders in the space when it comes to speed, security and transactions per second. With Goracle’s new feature, the Algorand blockchain is poised to become the preferred settlement layer for other blockchains. This is a major step forward for Algorand and interoperability in the blockchain industry, paving the way for new innovations and greater adoption.\n\nAbout Goracle\n\nGoracle is a decentralized blockchain oracle solution built on the Algorand blockchain. It provides a secure and reliable way for smart contracts on the Algorand blockchain to access off-chain data. With the new cross-chain compatibility feature, Goracle can import data from Ethereum and other blockchains, opening up new use cases and opportunities for developers. Goracle is currently in Testnet, and plans to launch to Mainnet in June.\n\n\n\nGoracle Social Links:"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vcHJvdG9zLmNvbS9ob3ctY3J5cHRvLXRyYWRlcnMtY2FuLXV0aWxpemUtbWV2LWluLWJsb2NrY2hhaW4tdHJhbnNhY3Rpb25zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 May 2023 07:00:00 GMT",
        "title": "How crypto traders can utilize MEV in blockchain transactions - Protos",
        "content": "Listen to this article.\n\nMaximum extractable value (MEV) refers to all of the money that can be extracted by reordering, viewing, adding, including, or excluding transactions within a block. The vast majority of MEV occurs via decentralized exchanges (DEXs) like Uniswap.\n\nIn all financial markets, the order of transactions is one of the most important determinants of price — think quants who colocate nearby exchange servers with fiber optic cables to ensure their orders fill first.\n\nVery often, discussions of MEV include the parties responsible for confirming transactions for ERC-20 tokens on Ethereum, which can come with issues such as validators being complicit with trading bots. Digital asset market participants have other ways to extract MEV using the different types of maximum extractable value.\n\nHere are the four types of MEV:\n\nSovereign MEV\n\nBlockchain communities can attempt to control their own MEV through sovereign MEV, which refers to setting protocol rules for extracting MEV, allowing or disallowing certain tactics for MEV extraction, and specifying where MEV proceeds may accumulate.\n\nA protocol’s community can decide who and what to prioritize via sovereign MEV practices, often with consequences for breaking these rules. With some blockchains with sovereign MEV rules, for example, an abusive validator might face penalties such as staking pool users moving to another staking platform or validator. Others allow the community to decide who gets the MEV or how MEV is generated.\n\nRead more: Ethereum tries to reduce MEV with blockers and rebates\n\nInternal MEV\n\nInternal MEV refers to MEV generated directly on an application-specific blockchain or ‘appchain.’ This form of MEV allows application developers to set rules that include the acceptable methods for capturing MEV. It can use atomic arbitrage, a trading strategy that places a buy order on one trading platform and a sell order of an equivalent quantity on another trading platform at the same time.\n\nCeFi-DeFi MEV\n\nCeFi-DeFi MEV uses a form of arbitrage that exploits the differences between centralized exchanges and decentralized finance apps. An asset’s price tends to update on centralized exchanges before on-chain pools and DEX liquidity providers can reposition.\n\nCeFi-DeFi MEV is one of the largest generators of MEV due to activity from arbitrage traders.\n\nInterchain MEV\n\nInterchain MEV takes advantage of the idea that most blockchains operate in ‘silos’ that don’t permit them to natively ‘see’ what’s happening on other blockchains. For example, the Bitcoin network cannot (excepting the use of third-party oracles) ‘see’ transactions on the Ethereum blockchain.\n\nInterchain MEV allows traders who can analyze cross-blockchain data to profit from swapping assets across blockchains via bridges or DEXs. Interchain MEV and associated arbitrage tactics happen most often in cross-domain blockchains like Cosmos.\n\nMEV is unavoidable\n\nEven Ethereum founder Vitalik Buterin has admitted that MEV will always exist in Ethereum. Validators can always select the transactions with higher fees — even if those transactions are from obvious front-running or sandwich attackers. MEV traders use a variation of arbitrage and other techniques to maximize profits.\n\nOn the bright side, developers can build ways to keep MEV under control by adding rules on who can get the rewards and how users can extract MEV from their blockchains through sovereign MEV practices.\n\nGot a tip? Send us an email or ProtonMail. For more informed news, follow us on Twitter, Instagram, Bluesky, and Google News, or subscribe to our YouTube channel."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMitwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtNC1tYXktMjAyMy9hcnRpY2xlc2hvdy85OTk4MTQ1OS5jbXPSAbsBaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXByaWNlcy10b2RheS1saXZlLW5ld3MtYml0Y29pbi1kb2dlY29pbi1ldGhlcmV1bS1zaGliaGEtaW51LWNyeXB0b2N1cnJlbmN5LWxhdGVzdC11cGRhdGVzLTQtbWF5LTIwMjMvYW1wX2FydGljbGVzaG93Lzk5OTgxNDU5LmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 May 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin rises above $29k; Ethereum, Polygon surge up to 3% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe cryptocurrency markets were trading higher in Thursday's trade after the US Fed raised its benchmark lending rate by 25 bps again to cool inflation. Bitcoin (BTC) rose 2.44% to $29,152, whereas Ethereum (ETH) was above the $1,900 level. BTC volume in the last 24 hours stood at approximately $19.5 billion, rising 20.54% in the last 24 hours.\"Following the Federal Reserve's decision to raise interest rates by 25 basis points, Bitcoin is regaining its strength. The Fed indicated that this week's increase could be the last for the time being. At present, Bitcoin is being traded at the US$29,000 level and is gradually approaching its resistance levels of US$29,420 and US$30,000,\" Edul Patel, Co-founder and CEO at Mudrex, said.“As the upcoming US employment figures are scheduled to be released on Friday, investors and traders are keeping a watchful eye on them,” Edul added.The global cryptocurrency market cap was trading higher around $1.20 trillion, rising 2% in the last 24 hours.The total volume in DeFi is currently 3,45 billion, 8.04% of the total crypto market 24-hour volume. The volume of all stablecoins was at $38.99 billion, which is 90.76% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, was around $563 billion. Bitcoin’s dominance is currently 47.13%, an increase of 0.21% over the day, according to CoinMarketCap.\"Bitcoin (BTC) rallied 2% overnight as the US Fed indicated that it may pause interest rate hikes in the future. Given concerns about the US banking crisis, investors are likely to move capital towards Gold and Bitcoin in the short term. BTC has to reclaim $30,000 to strengthen its 2023 rally,\" Vikram Subburaj, CEO of Giottus Crypto Platform, said.Sathvik Vishwanath, Co-Founder & CEO of Unocoin said that Bitcoin bounced back from the $28,100 level but faces strong resistance at the $29,295 level. “A break above this level could lead to a target of $29,975 and eventually $30,000,” he said.\"However, the candlestick patterns indicate bearish sentiment, while the RSI and MACD indicators indicate a possible downtrend. The 50-day EMA also acted as a support area around $28,800. Immediate support lies near $27,600 and a break below this level could lead to further declines towards $27,200,\" Sathvik added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 11.57 hours, IST on May 04, 2023)Bitcoin $29,157 2.45%Ethereum $1,901 2.14%Tether $1.00 0.01% BNB $326 1.12% XRP $0.4628 0.72%Cardano $0.3946 2.12% Dogecoin $0.0794 1.26%Polygon $0.9976 2.80%Solana $22.23 1.74%Polkadot $5.76 1.46%Shiba Inu $0.00001006 1.08% Litecoin $88.47 0.49%Tron $0.06934 0.28%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZW4uZXRoZXJldW13b3JsZG5ld3MuY29tL2V0aGVyZXVtLWdhcy1mZWVzLTEteWVhci1oaWdoLW1lbWVjb2luL9IBTGh0dHBzOi8vZW4uZXRoZXJldW13b3JsZG5ld3MuY29tL2V0aGVyZXVtLWdhcy1mZWVzLTEteWVhci1oaWdoLW1lbWVjb2luL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Ethereum Gas Fees Hit 1-Year High Amid Memecoin Renaissance - Ethereum World News",
        "content": "Summary:\n\nEtherscan data showed the average cost of Ethereum transactions rose as high as $15 on May 4, a 1-year high.\n\nGas fees on L2 networks also skyrocketed, particularly on chains built using zero-knowledge proofs like Polygon zkEVM and zkSync Era.\n\nCrypto participants believe the memecoin renaissance led by PEPE coin is the main reason behind expensive transaction costs on crypto’s largest altcoin blockchain.\n\nGas fees on Ethereum flew to their highest level since 2022 in the middle of a memecoin renaissance championed by the “Pepe the frog” themed altcoin, PEPE.\n\nThe cost of sending transactions rose as high as $15 on May 4, its highest point in over a year. Gas fees had previously stayed at lower levels in the months after Terra crashed and the crypto markets nosedived.\n\nPEPE Trading Propels Ethereum Gas Fees\n\nEthereum’s ecosystem is no stranger to memecoin mania as tokens like Dogecoin and Shiba Inu have drawn speculative traders before. It’s unclear whether the PEPE token will last as long as these OG memecoins after hitting a $1 billion market cap, a topic that Binance weighed in on after listing PEPE for spot trading today.\n\nBinance paused PEPE deposits shortly after citing technical difficulties.\n\n#Binance has postponed the listing of $FLOKI and $PEPE until May 5, 2023, 18:00 UTC.\n\n\n\nTrading will start at 18:00 UTC, as opposed to the original start time of May 5, 16:00 UTC.\n\n\n\nPlease note that deposits for both PEPE and FLOKI will resume at 15:30 UTC.https://t.co/pJieemoTyP — Binance (@binance) May 5, 2023\n\nThere are also indicators pointing to PEPE as the reason behind Ethereum’s pricey gas fees. PEPE holders traded $150 million in volume over the past 24 hours on the decentralized exchange Uniswap.\n\nIncreased interest in PEPE pushed the token into the top 100 cryptocurrencies by market cap. The token sits at #42 according to CoinMarketCap. Nansen data clocked several copycat tokens and increased trading activity tied to other memecoins on ETH’s chain.\n\nHigh Gas Fees Rock L2 Networks Too\n\nLayer 2 networks designed to reduce transaction costs experienced high gas fees as network demand shot up. Fees on layer 2 scaling solutions built using zero-knowledge proofs like Polygon zkEVM and zkSync Era were significantly higher than L2’s designed using optimistic rollups.\n\nPer L2 Fees data, the cost of a single transaction on zk rollups ranged between $2 to $11, rising as high as $30.\n\n$30 gas fee on Layer 2 $ZKS $ZKSYNC @zksync\n\nI don't understand, I thought layer 2 were made to reduce gas fees 😱😱 pic.twitter.com/Uz6k5p4bC5 — Kool Crypto ⚙️🛸 (@healthymofin) May 5, 2023\n\nUsers also flocked to Ethereum Virtual Machine-compatible chains like BNB Chain as memecoin mania continued."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvcGVwZS1jb2luLXNwaWtlcy1ldGgtZ2FzLWZlZS1oaXRzLXRvLTEteWVhci1oaWdoc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Pepe Coin Spikes ETH Gas Fee Hits to 1-Year Highs - Watcher Guru",
        "content": "Pepe Coin (PEPE) is the latest craze to grasp the crypto sector. The token has gained as much as 665% in the last week and 585% in 14 days. The asset has led to many investors bowing down in FOMO (fear of missing out) of what many think is the new memecoin king. However, a parallel development has taken place thanks to the craze around the frog-themed crypto project. Demand for Pepe Coin (PEPE) has caused a surge in Ethereum (ETH) gas fees. Gas fee on the popular network has reached one-year highs due to increased transactions to buy PEPE.\n\nOn May 4, the average cost of a single Ethereum transaction increased above $15.82. Although Ethereum’s average transaction costs rose to between $50 and $70 in 2021, things have been relatively quiet since the market collapsed in May 2022.\n\nPEPE trade volume on Uniswap has topped $150 million over the past 24 hours, outpacing Wrapped Bitcoin (WBTC) and USDT stablecoin levels. On May 1, the PEPE token, with a market capitalization of nearly $500 million, also broke into the top 100 cryptocurrencies. The project is getting close to reaching a $1 billion market cap valuation.\n\nEthereum witnesses increased burns due to Pepe Coin\n\nDue to the higher gas prices, 9,392 ETH were burned during the last 24 hours, reaching a one-year high. In 2021, Ethereum underwent a hard fork, which leads to the burning of a portion of all Ethereum transactions. As a result, more ETH is destroyed on the network as activity rises. Moreover, gas fees for Layer-2 transactions have increased as a result of the increase in Ethereum’s transaction fees.\n\nNonetheless, PEPE’s rise, although meteoric, might be fueled by FOMO and the hopes of making a quick buck. The project does not have a lot of use cases, nor does it have a lot of liquidity. At press time, PEPE was trading at $0.00000208, up by 56% in the last 24 hours."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZGVjcnlwdC5jby8xMzkwMTAvbGlhbS1iaW5hbmNlLWxpc3RzLXBlcGUtbWVtZS1jb2luLW1hcmtldC1jYXAtaGl0cy0xLWJpbGxpb27SAVtodHRwczovL2RlY3J5cHQuY28vMTM5MDEwL2xpYW0tYmluYW5jZS1saXN0cy1wZXBlLW1lbWUtY29pbi1tYXJrZXQtY2FwLWhpdHMtMS1iaWxsaW9uP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Binance Lists PEPE as Meme Coin Market Cap Hits $1 Billion - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe world's largest crypto exchange by volume has just added two more meme coins to the casino.\n\nBinance today announced it would list both Pepecoin (PEPE) and Floki Inu (FLOKI) in the platform's so-called innovation zone.\n\nTo enter, traders must first answer two questions correctly regarding how much money they could lose trading in this zone (more or less than 50%?) and whose fault it would be if they do indeed face a \"total loss\" of funds.\n\nAD\n\nAD\n\nFLOKI has since soared 57% and PEPE has risen another 77%, pushing the frog-inspired token's market capitalization across the $1 billion mark. Still, both coins trade at far less than a penny, at press time.\n\nThe exchange has also provided another word of warning for prospective traders. \"Please note that, as of the time of writing, PEPE has no token utility or value support mechanism,\" reads the listing note on Binance. \"Also, there are signs that certain insiders or team members were able to buy 7% of the total token supply minutes after TGE [Token Generation Event].\"\n\nTrading for these two tokens kicks off today at 12pm ET. Interested parties can also trade both meme coins on margin against Tether's dollar-pegged stablecoin.\n\nWhat is PEPE?\n\nPEPE is the latest meme coin to soar in value and capture the crypto industry's attention. It's based on the artist Matt Furie's Pepe the Frog.\n\nOver the past week, the token has risen by a whopping 1,000%, per Coingecko. It's now the 45th-largest cryptocurrency by market capitalization, overtaking Fantom's native FTM token as well as The Sandbox's SAND token.\n\nAD\n\nAD\n\nBesides its meteoric price rise, the flurry of speculation has also sent gas fees on Ethereum soaring to 1-year highs.\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3QvYWF2ZS1nb2VzLWxpdmUtb24tc2Nyb2xsLWFscGhhLXRlc3RuZXQtYS1nYW1lLWNoYW5nZXItZm9yLWV0aGVyZXVtLXNjYWxpbmfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 May 2023 07:00:00 GMT",
        "title": "Aave Goes Live on Scroll Alpha Testnet: A Game-Changer for Ethereum Scaling? - BSC NEWS",
        "content": "Disclaimer: Overall it is vital to proceed with caution when purchasing tokens that have just been listed. For those who have not already read our articles on safety in the BSC it is crucial to reference the following items,\n\n\n\nThis is a paid press release, BSC.News does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. The project team has purchased this advertisement article for $1500. Readers should do their own research before taking any actions related to the company. BSC.News is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned in the press release. : Overall it is vital to proceed with caution when purchasing tokens that have just been listed. For those who have not already read our articles on safety in the BSC it is crucial to reference the following items, HERE and HERE This is a paid press release, BSC.News does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. The project team has purchased this advertisement article for $1500. Readers should do their own research before taking any actions related to the company. BSC.News is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned in the press release.\n\nDisclaimer: The content in the above article is a press release, provided by a third party. Readers should do their own research before interacting or engaging with the mentioned companies and/or any related services. BSC News is neither directly nor indirectly responsible for any damage or loss caused or alleged to be caused by or in connection with the use of any content, goods or services mentioned in the above article.\n\nDisclaimer: Overall it is vital to proceed with caution when purchasing tokens that have just been listed. For those who have not already read our articles on safety in the BSC it is crucial to reference the following items,\n\n\n\nThis is a paid press release, BSC.News does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. The project team has purchased this advertisement article for $2500. Readers should do their own research before taking any actions related to the company. BSC.News is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned in the press release. : Overall it is vital to proceed with caution when purchasing tokens that have just been listed. For those who have not already read our articles on safety in the BSC it is crucial to reference the following items, HERE and HERE This is a paid press release, BSC.News does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. The project team has purchased this advertisement article for $2500. Readers should do their own research before taking any actions related to the company. BSC.News is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned in the press release.\n\nDisclaimer: This is a paid Ask Me Anything (AMA), BSC.News does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. The project team has purchased this advertisement AMA for $2000 Readers should do their own research before taking any actions related to the company. BSC.News is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned in the AMA.\n\nDisclaimer: This article is exclusive BSC News Premium Content. Premium content is viewable without a membership for a limited time. After the limited time period expires, readers will need to either subscribe or hold a BSC News NFT to view Premium Content. Visit the BSC News NFT website, Discord, and Twitter to learn more about becoming a Premium member.\n\nDisclaimer: The content of this piece is the opinion of the writer. Nothing in this article is intended to constitute financial advice. The content of this article is intended for entertainment and educational purposes only. Investing in cryptocurrency carries a high degree of risk. Capital is at risk, and returns are never guaranteed. You should always do your own research.\n\nDisclaimer: Disclaimer: This article is written by a visiting author. Opinions herein are those of the visiting author. Nothing in this article is intended to constitute financial advice. The content of this article is intended for entertainment and educational purposes only. Investing in cryptocurrency carries a high degree of risk. Capital is at risk, and returns are never guaranteed. You should always do your own research."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZGFpbHljb2luLmNvbS9ldGgtaGl0cy1yZWNvcmQtZGVmbGF0aW9uLWFzLW1lbWUtY29pbi1tYW5pYS1zdXBlcmNoYXJnZXMtYnVybi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "ETH Hits Record Deflation as Meme Coin Mania Supercharges Burn - DailyCoin",
        "content": "A record number of ETH has been burned in the past week.\n\nETH has never been as deflationary as now.\n\nETH deflation has been most likely supercharged by the meme coin mania led by PEPE.\n\nEthereum’s native currency, ETH, is frequently called “ultrasound money” due to its deflationary properties.\n\nIndeed, ETH has been consistently deflationary since Ethereum switched from a proof-of-work to a proof-of-stake consensus mechanism. And it’s been extra deflationary in the past week or so, thanks to the ongoing meme coin mania led by PEPE.\n\nETH Hits Record Deflation\n\nEthereum’s native currency ETH has been steadily going deflationary since merging the proof-of-work and proof-of-stake chains. However, in the past seven days alone it has burned around a significant portion of all ETH burned.\n\nAccording to data from Ultrasound Money, 33,200 ETH has been burned in the last week. This represents a whopping 21.5% of all ETH burned since the merge 232 days ago, which currently stands at 154,154 ETH. ETH has never been more deflationary than now.\n\nThe 33,200 burned ETH in the past week equals a 1.44% yearly deflation. If Ethereum still used proof-of-work, ETH’s supply would grow by 2.09%.\n\nAt current daily run rate ETH would deflate 2% annually. Sure these levels aren’t sustainable in a bear, but what happens when we get a bull? pic.twitter.com/3JW6tkpUUt — Hal Press (@NorthRockLP) May 5, 2023\n\nWhat’s even more impressive about these numbers is that crypto is currently in a bear market and there’s little economic activity going on.\n\nHowever, the meme coin mania that seemingly came out of nowhere is spurring the current ETH deflation.\n\nMeme Coins Supercharge ETH Burn\n\nIf there’s one thing meme coins are great at doing post-merge, it’s burning ETH and increasing its deflation.\n\nThe current meme coin mania has most likely supercharged the current ETH deflation. PEPE, a meme coin that surfaced just a few weeks ago, has pumped almost 3,000% and captured many hearts in the crypto space.\n\nPEPE is currently the 58th largest cryptocurrency with an almost $900 million market capitalization, according to data from CoinGecko.\n\nOther meme coins like WOJAK, CGPT, and WSB have also contributed to high gas fees and, in turn, larger ETH burn. In general, gas has increased significantly in the past few weeks, with people spending $20 and more on a single transaction.\n\nI downloaded 413,283 PEPE Uniswap transactions from @DuneAnalytics\n\n\n\nPEPE traders have burned ~5,300 ETH ($10M) in gas over the past 3 weeks 🤯\n\n\n\n1/🧵 pic.twitter.com/9lZxGGjtT5 — Alex (@thiccythot_) May 5, 2023\n\nOn the Flipside\n\nThe meme mania may be unsustainable due to a weak economic environment and the ongoing bear market. Once the meme craze ends, ETH burn will significantly subside until the next bull market or another meme mania.\n\nWhy You Should Care\n\nETH being deflationary is one of the most attractive properties of the asset. Investors should consider following the deflation/inflation curve of ETH to position themselves better.\n\nRead more about recent PEPE price action:\n\nPEPE Rips 69% to Hit New All-Time as Whales Buy Millions\n\nRead more about a TikTok star joining a new Snapmuse.io creator platform:\n\nMajor TikTok Star Joins New Snapmuse.io Creator Platform on Polygon"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9tZW1lY29pbi1oeXBlLWRyaXZlcy1iaXRjb2luLXRyYW5zYWN0aW9uLWZlZXMtdG8tbXVsdGkteWVhci1oaWdoc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Memecoin hype drives Bitcoin transaction fees to multi-year highs - Cointelegraph",
        "content": "The ongoing trading frenzy of memecoins like Pepe Coin (PEPE) has triggered an unwanted consequence for Bitcoin (BTC) — driving its transaction costs to multi-year highs.\n\nBitcoin transaction fees surged in early May, reaching their highest point over the past two years, according to data from Crypto Fees.\n\nOn May 3, the total amount of fees paid on the Bitcoin blockchain reached $3.5 million, jumping about 400% from late April. The average Bitcoin transaction fee reached as much as $7.2, according to YCharts.\n\nTotal Bitcoin transaction fees between May 2021 and May 2023. Source: CryptoFees\n\nThe latest increase in BTC transaction fees is primarily attributed to a surge in Bitcoin activity involving BRC-20 transactions. According to data from Galaxy Research, 50% of all Bitcoin transactions on May 2 were related to BRC-20 transactions.\n\nModeled after Ethereum’s ERC-20 token standard, BRC-20 is an experimental token standard allowing users to issue and transfer fungible tokens on the Bitcoin blockchain. The standard was introduced in March 2023 by a pseudonymous on-chain analyst known as Domo.\n\nThe BRC-20 token standard has quickly become a major trend in the cryptocurrency industry, specifically amid the sharp growth of the PEPE memecoin. The token has rallied more than 600% over the past seven days, reaching its all-time high of $0.00000216 on May 5.\n\nPEPE 30-day price chart. Source: CoinGecko\n\nThe Bitcoin blockchain isn’t the only blockchain affected by the ongoing memecoin hype. Gas fees on the Ethereum blockchain have also been skyrocketing to new multi-month highs recently.\n\nOn May 2, ETH transaction fees hit an aggregate amount of more than $19 million, a level not seen since May 2022, according to Crypto Fees. The Ethereum blockchain remains the most expensive network in terms of transaction fees at the time of writing.\n\nRelated: Bitcoin miners have earned $50B from BTC block rewards, fees since 2010\n\nDespite the latest spike in Bitcoin transaction fees, the current BTC transaction cost is still far from all-time high levels. The highest Bitcoin transaction fees were recorded in April 2021, when the average BTC transaction cost almost reached $70 amid a major decline in the Bitcoin network hash rate. The previous highest point in BTC transaction fees was in 2017, with transaction costs surging above $60.\n\nMagazine: Asia Express: Justin Sun’s SUI-farming sins, PEPE’s wild run, 3AC’s oyster philosophy"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vZGFpbHljb2luLmNvbS93aHktaHlkcmEtaW1wb3J0YW50LWNhcmRhbm9zLXNjYWxhYmlsaXR5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Why Is Hydra Important for Cardano's Scalability? - DailyCoin",
        "content": "Cardano recently released its highly anticipated scaling solution Hydra.\n\nThe Layer-2 solution brings a novel infrastructure to the blockchain space that makes developing apps significantly scalable and efficient.\n\nHydra is still under development; however, it could propel Cardano’s adoption when completed.\n\nCardano has been pushing to compete with Ethereum since its inception in 2017; however, it has long needed scalability and practicality. With Hydra in the mix, the Proof-of-Stake network may have found the key to unlock its potential as an “Ethereum killer.”\n\nAfter much anticipation, Cardano’s novel Layer-2 solution Hydra has made its way onto the main chain, bringing a plethora of essential features. The protocol expects to play a critical role in the network’s adoption with its unparalleled speed and efficiency.\n\nHail Hydra\n\nCardano’s new scaling solution Hydra is a force to be reckoned with. The protocol builds upon Bitcoin’s iconic lightning network and adds heaps of functionality, security, and scalability.\n\nIt introduces a novel state channel framework that allows developers to instantly run scripts, complex transactions, and more off-chain while maintaining similar functionality and security to the Cardano main chain. This approach has been relatively challenging for most scaling solutions like sharding and zk-rollups, which struggle with performance and functionality.\n\nThanks to Hydra’s isomorphism, the ability to replicate the functionality and security of Cardano’s main chain, developers can now access a simple, low-cost, secure, and computationally inexpensive solution that enables them to scale up their decentralized protocols as if it were running on the Cardano main chain.\n\nWith Hydra, Web3 could soon welcome optimized and scalable dApps that rely on instant micropayments such as subscription-based content, in-app purchases, games, and more without congesting the main chain or raising network fees.\n\nLife Cycle of Hydra Head – Source: Hydra Head Protocol.\n\nHydra introduces a myriad of possibilities to Cardano. Another one of its many capabilities is customizability. Since Hydra nodes can be run independently, developers can customize their Hydra Heads to suit their dApps’ needs.\n\nFor instance, decentralized exchanges can operate independently on Hydra Heads, handle millions of transactions and traffic, and run complex consensus and governance models, while maintaining users’ security and network performance.\n\nHydra brings a solid solution with innovative features but is still under development. When completely developed, Charles Hoskinson, the founder of Cardano, shared that Hydra would make Cardano the fastest payment network in the world.\n\nWhat’s Next for Cardano?\n\nThere’s a lot in store for Hydra. It’s an open-source project with hundreds of developers worldwide working to improve it. Initially, Hydra aimed to shift 99% of all Cardano traffic off-chain to Hydra Heads. However, the Cardano Foundation deemed it “too ambitious” and moved on to a new goal – bringing Dapps off-chain.\n\nThe first generation of Hydra is set on being the number one dApp on Cardano by all available metrics, such as Total Value Locked (TVL), traffic, volume, and more. According to DefiLlama, the top dApp by TVL is Minswap, with over $52 million locked. Cardano has a collective TVL of $154 million, and Ethereum has $29.42 billion at press time.\n\nOn the Flipside\n\nCharles Hoskinson shared in an interview that Bitcoin lacks programmability and can only perform a limited set of tasks, such as pushing value around.\n\nCardano saw significant increases in financial and ecosystem metrics due to increased dApp transactions and the adoption of new stablecoins in Q1 2023.\n\nWhy You Should Care\n\nScalability is a big issue in the blockchain industry and one of the significant parts of the blockchain trilemma. Leading blockchains like Ethereum have struggled in the past with network congestion and high network fees, which can deter adoption.\n\nWith blockchain technology expected to take off, billions of users could likely adopt the technology, increasing the need for scaling solutions that can easily handle significant traffic, such as Hydra.\n\nFAQs\n\nWhat does Hydra do for Cardano? Hydra, or Hydra Head Protocol, is a Layer-2 isomorphic scaling solution that creates a network of off-chain ledgers with the security guarantees and functionality of the Cardano main chain. How does Cardano solve scalability? Cardano solves scalability in several ways, including its Hydra Head Protocol. The Hydra Layer-2 solution allows developers and users to instantly process transactions, scripts, metadata, and more as if on the Cardano chain and then settle the final result on the main chain. How fast is Cardano Hydra? Hydra is rumored to have a whopping one million TPS; however, Charles Hoskinson dismissed those rumors and explained that Hydra works to achieve a limitless number. Currently, the speed at which Hydra operates is being tested. What happened to the Hydra crypto? Announced in 2019, after many delays, the first generation of Hydra made it to the Cardano mainnet in April 2023.\n\nAre whales migrating to Cardano?\n\nCardano Whales Amass $218M in ADA Tokens Over Two Weeks\n\nRead more about Hydra:\n\nHow Cardano’s Hydra Layer-2 Is Challenging Bitcoin Lightning Network and Ethereum Sharding"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3RvcC0zLWNyeXB0b3MtZm9yLXRoZS1uZXh0LWJ1bGwtbWFya2V0LWNvbmZsdXgtY2Z4LWV0aGVyZXVtLWV0aC1hbmQtY29sbGF0ZXJhbC1uZXR3b3JrLWNvbHQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Top 3 Cryptos for the Next Bull Market: Conflux (CFX), Ethereum (ETH), and Collateral Network (COLT) - Analytics Insight",
        "content": "In this article, we’ll discuss the top 3 cryptos poised to lead the charge in the next bull market: Conflux (CFX), Ethereum (ETH), and Collateral Network (COLT). Among these projects, Collateral Network (COLT) is currently in the presale phase, offering early investors an opportunity to grab discounted COLT. Let’s dive into each of these projects and discover how they could potentially benefit from the next bull market.\n\n>>BUY COLT TOKENS NOW<<\n\nCollateral Network (COLT)\n\nCollateral Network (COLT) is a groundbreaking peer-to-peer lending platform that empowers individuals to borrow money using real-world assets as collateral. What sets Collateral Network (COLT) apart from other lending platforms is their reliance on a blockchain system to execute transactions without intermediaries.\n\nCollateral Network (COLT) goes a step further by tokenizing the assets into NFTs. This process allows loan collateral to be divided into multiple segments, enabling lenders to finance any number of these fragments as they desire.\n\nCollateral Network (COLT)’s approach not only expands the lending market to a broader array of potential lenders but also injects additional liquidity into the sector. As a result, Collateral Network (COLT) is poised to disrupt the trillion-dollar asset-backed lending industry.\n\nCOLT, the platform’s utility token, grants holders access to NFT auctions, exclusive discounts, and the opportunity to stake for extra rewards. As Collateral Network (COLT) continues gaining momentum and onboarding new users, demand for the COLT token is expected to rise.\n\nCOLT tokens can be purchased for a current price of $0.014 during phase 2 of the presale. Since more than 30 million tokens have already been sold, analysts anticipate that Collateral Network (COLT) tokens could reach $0.35 per token by the end of 2023.\n\nConflux (CFX)\n\nConflux (CFX) is a third-generation blockchain network focused on scalability, security, and decentralization. Conflux (CFX) uses a new consensus algorithm called Tree Graph to make it more efficient than other blockchains without sacrificing any of its core principles.\n\nIn addition to its strong fundamentals, Conflux (CFX)’s native token, CFX, has been performing exceptionally well on the market. The price of Conflux (CFX) has increased by more than 1,000% since the beginning of 2023.\n\nPart of this Conflux (CFX) price surge can be attributed to the fact that Hong Kong is opening back up to cryptocurrency. As a project based in China, Conflux (CFX) is particularly well-positioned to benefit from this new wave of crypto adoption.\n\nMoving forward, Conflux (CFX) is expected to build on its strong fundamentals and continue its impressive growth. Analysts anticipate that the price of Conflux (CFX) could surpass $0.80 by the end of 2023 — a potential 158%+ return.\n\nEthereum (ETH)\n\nLast but certainly not least, is Ethereum (ETH). As the second-largest cryptocurrency by market capitalization, Ethereum (ETH) is an obvious choice for any investor looking to diversify their crypto portfolio with a tried and true asset.\n\nWhat makes Ethereum (ETH) so attractive, is its strong and wide-reaching network of developers. With the help of Ethereum (ETH)’s expansive developer community, projects built on top of the platform can benefit from a wider array of resources — allowing for faster innovation and more secure code.\n\nWhile there have been attempts to challenge Ethereum (ETH)’s status as the leading smart contract platform, none have yet been able to unseat the king of dApps. This gives investors confidence that their investments in Ethereum (ETH)-based projects are likely safe from other competitors.\n\nLooking ahead, analysts anticipate that Ethereum (ETH) could reach $3,600 by the end of 2023 if the bull market continues. The $1,800 price mark should act as support, but if it breaks, Ethereum (ETH) could fall back down to $1,650.\n\nIf you wish to purchase the $COLT token for only $0.014, follow the links below and take advantage of this unique opportunity to earn an extra 40% purchase bonus on your investment!\n\nFind out more about the Collateral Network presale here:\n\nWebsite: https://www.collateralnetwork.io/\n\nPresale: https://app.collateralnetwork.io/register\n\nTelegram: https://t.me/collateralnwk\n\nTwitter: https://twitter.com/Collateralnwk\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMilwFodHRwczovL3d3dy5tb25leWNvbnRyb2wuY29tL25ld3MvYnVzaW5lc3MvY3J5cHRvY3VycmVuY3kvY3J5cHRvY3VycmVuY3ktcHJpY2VzLW9uLW1heS00LWJpdGNvaW4taG9sZHMtYWJvdmUtMjg1MDAtZXRoZXJldW0tcmlzZXMtdXAtdG8tMi0xMDUyMzM2MS5odG1s0gGbAWh0dHBzOi8vd3d3Lm1vbmV5Y29udHJvbC5jb20vbmV3cy9idXNpbmVzcy9jcnlwdG9jdXJyZW5jeS9jcnlwdG9jdXJyZW5jeS1wcmljZXMtb24tbWF5LTQtYml0Y29pbi1ob2xkcy1hYm92ZS0yODUwMC1ldGhlcmV1bS1yaXNlcy11cC10by0yLTEwNTIzMzYxLmh0bWwvYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 May 2023 07:00:00 GMT",
        "title": "Cryptocurrency Prices on May 4: Bitcoin holds above $28,500; Ethereum rises up to 2% - Moneycontrol",
        "content": "Bitcoin\n\nCryptocurrencies are largely trading higher after the Federal Reserve hikes interest rates by a quarter point.\n\nThe global crypto market cap is $1.20 trillion, a 1.63% increase over the last day.\n\nStory continues below Advertisement Remove Ad\n\nThe total crypto market volume over the last 24 hours is $42.15 billion, which makes a 19.20% increase. The total volume in DeFi is currently $3.44 billion, 8.17% of the total crypto market 24-hour volume.\n\nBitcoin’s dominance is currently 47.03%, an increase of 0.13% over the day.\n\nBitcoin rose by almost 2% to $28,526 and Ethereum was above $1,850, while the global cryptocurrency market cap rose by 1% to $1.17 trillion.\n\nThe volume of all stablecoins is now $38.50 billion, which is 91.35% of the total crypto market 24-hour volume. Speculators may be anticipating an announcement on interest rate hikes by the Federal Reserve, leading some experts to predict that ongoing banking crises and the US economic outlook may affect short-term price movements in Bitcoin.\n\nThe banking crisis doesn't appear to be over yet. Shares of PacWest Bancorp (PACW) fell by more than 50% in after-hours action on Wednesday following a Bloomberg report the U.S.-based lender is mulling a range of strategic options.\n\nBitcoin (BTC) was up on the news, rising more than 2% to $28,900 at press time.\n\nStory continues below Advertisement Remove Ad\n\nStory continues below Advertisement Remove Ad\n\nThe news on PacWest comes only days after First Republic Bank (FRC) was taken over by the Federal Deposit Insurance Corp.\n\nAt 8.00 am on May 4, these were the prices of the top cryptocurrencies (data from WazirX):"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2JpZy1leWVzLWNvaW4tcHJldmFpbHMtb3Zlci1iZWFyLW1hcmtldC1hcy1ldGhlcmV1bS1hbmQtcmlwcGxlLXNsdW1wL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 May 2023 07:00:00 GMT",
        "title": "Big Eyes Coin Prevails Over Bear Market as Ethereum and Ripple Slump - Analytics Insight",
        "content": "The crypto market is staring at a slump after reaching wild highs in April. Ripple and Ethereum, the biggest gainers of the last bull run, are facing selling pressure as the market has turned red. Ripple saw its value climb to $0.5697 but is now trading at $0.4641. Ethereum saw its price reach $2,127, but the second-biggest crypto by market cap is now trading at $1,837. Amidst marketwide bearish performance, Big Eyes Coin, a meme coin in presale, is emerging as an outlier to the market sentiments. The project is going through a highly successful, and the crypto community has taken note.\n\nRipple Feels the Heat From Crypto Liquidation\n\nRipple has seen its value come down to $0.4641 as the token has lost almost 3% of its value. The token’s downward trend has come after a strong performance, even in the face of a lawsuit filed by the US SEC. XRP’s poor performance comes after major exchanges are reporting wide-scale liquidations.\n\nThe Ripple network was built to facilitate efficient cross-border transactions. The network only takes seconds to perform transactions that traditional methods take upwards of hours or even days. The network uses XRP as its utility token and has seen adoption from governments and large banks like Santander. The network is projected to grow in popularity and value as its on-chain activity grows rapidly.\n\nEthereum Slips Below $1,900 Level\n\nEthereum slipped below the $1,900 level after a month of strong performance. The network saw its price rise to $2,127 after its successful Shanghai upgrade. The upgrade marked the network’s full transition into a proof-of-stake (PoS) network. As of writing, ETH is trading at $1,848.\n\nEthereum is the second-largest cryptocurrency by market capitalization, and the network has the largest ecosystem of Dapps. Ethereum boasts the largest developer community and has always been at the forefront of crypto innovation. The network PoS upgrade is aimed at making it energy and cost-efficient. The upgrade will improve the network’s scalability and will drive more DeFi projects into the network. The network’s improved fundamentals will make it a strong investment for the future.\n\nBig Eyes Coin Beats Market Blues\n\nBig Eyes Coin is in its presale, and the token has turned heads with its strong performance. The project has raked up investment worth more than $34.5 million. The cat-themed meme coin’s presale will end on June 3rd and launch on Uniswap on June 15th. Big Eyes Coin Team has released the END300 promo code to celebrate the successful close of the presale. By using the code, investors can avail a 300% bonus on their purchase of BIG tokens.\n\nThe biggest draw of the network is its community-focused development roadmap. The network has released NFT cards that community members can use to mint BIG NFTs. Members can trade their BIG NFTs on Opensea, one of the largest NFT marketplaces. Additionally, the project has stated its aspirations to build DeFi projects in its ecosystem. The project is reportedly trying its hand in the p2e NFT gaming arena. These steps will potentially create wealth for the Big Eyes Coin community.\n\nBig Eyes Coin is also committed to acting on climate change. The project has set aside 5% of its liquidity to donate to charity. The community members can decide the causes the project contributes to.\n\nWhile the crypto market looks at a downturn, Big Eyes Coin has emerged as a bright spot. The project’s hugely successful presale underlines investor confidence in the project and signals its utility too. Big Eyes Coin’s performance is significant in the face of underperformance by heavyweights like ETH and XRP.\n\nSo, waste no more time and join the Big Eyes Coin presale to get in on an exciting crypto journey. Also, don’t forget to use the END300 promo code to make your entry into the BIG presale extra sweet.\n\nFor More on Big Eyes Coin (BIG):\n\nPresale: https://buy.bigeyes.space/\n\nWebsite: https://bigeyes.space/\n\nTelegram: https://t.me/BIGEYESOFFICIAL\n\nOpensea: https://opensea.io/collection/big-eyes-lootbox-cards\n\nTwitter: https://twitter.com/BigEyesCoin\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9tZW1lcy1nb25lLW1haW5zdHJlYW0tYS1jbG9zZXItbG9vay1hdC1ldGhlcmV1bS1iYXNlZC1tZW1lLWNvaW5zLXNoaWJhLWludS1mbG9raS1pbnUtYmlnLWV5ZXMtY29pbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Memes Gone Mainstream: A Closer Look At Ethereum-Based Meme Coins Shiba Inu, Floki Inu & Big Eyes Coin - Analytics Insight",
        "content": "Meme coins have captured the world’s attention, as they continue to soar in value following Elon Musk’s tweets and the enthusiasm of the crypto community. While Dogecoin (DOGE) is currently the most well-known meme coin, other meme coins such as Shiba Inu (SHIB), Floki Inu (FLOKI), and Big Eyes Coin (BIG) are also gaining significant traction.\n\nAlthough all three of these meme coins operate on the Ethereum blockchain, they differ in terms of their utility and marketing approach. Shiba Inu and Floki Inu primarily rely on their cute mascots and celebrity endorsements to generate interest and appeal to the community, while Big Eyes Coin emphasises its usefulness in the e-commerce industry and its cat-themed approach.\n\nLet’s take a closer look at these meme coins and how they are becoming a sensation in the crypto verse!\n\nShiba Inu & Floki Inu: The Crypto Dog Duo\n\nShiba Inu (SHIB) and Floki Inu (FLOKI) are two meme coins that have gained significant traction in the cryptocurrency world. Shiba Inu (SHIB) is a meme coin inspired by the famous Japanese dog breed and gained widespread attention after a tweet from Elon Musk in early 2021.\n\nIt has been dubbed the “Dogecoin Killer” due to its resemblance to Dogecoin. Shiba Inu (SHIB) has gained more popularity with the development of ShibaSwap, a decentralised exchange for SHIB tokens.\n\nOn the other hand, Floki Inu (FLOKI) is a newer meme coin that has been inspired by Elon Musk’s recent announcement that his new dog is named Floki. It is still in its early stages, but it has already attracted a considerable amount of interest and attention from crypto investors.\n\nBoth of these meme coins are ERC-20 tokens operating on the Ethereum blockchain, with a total supply of one quadrillion tokens each. They also share a common tokenomics feature where a certain percentage of each transaction fee is burned to decrease the total supply and potentially increase the value of the remaining tokens.\n\nBig Eyes Coin: The Feline Snatching the Spotlight from the Canines!\n\nThe presale of Big Eyes Coin has been incredibly successful, with many investors eager to get their hands on this exciting new cryptocurrency. The presale has already raised over $34 million, making it one of the most successful presales in recent memory.\n\nHowever, time is running out for investors who have yet to participate, as the presale will end on June 3rd. Despite this, there is still a chance for investors to get involved and potentially profit from Big Eyes Coin. By using the code END300, investors can receive a generous 300% bonus, making it an even more enticing opportunity.\n\nBig Eyes Coin is more than just a typical cryptocurrency. It aims to make a positive impact on the world by supporting ocean conservation efforts. The project has pledged to donate 5% of its total supply to help preserve the ocean’s health, which not only contributes to a better environment but also reinforces the cryptocurrency’s value.\n\nMoreover, the project’s team actively engages with its community by hosting social media contests and events that foster excitement and unity among supporters and investors.\n\nSo, don’t let this golden opportunity slide by, get your BIG tokens today and get a chance to join the millionaire club!\n\nFor all things Big Eyes Coin (BIG):\n\nPresale: https://buy1.bigeyes.space/?source=insight\n\nWebsite: https://bigeyes.space/\n\nTelegram: https://t.me/BIGEYESOFFICIAL\n\nOpenSea: https://opensea.io/collection/big-eyes-lootbox-cards\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMizAFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWluLWluZGlhLW1heS01LWNoZWNrLW1hcmtldC1jYXAtYml0Y29pbi1ldGhlcmV1bS1tZXJnZS1kb2dlY29pbi1zb2xhbmEtbGl0ZWNvaW4tcmlwcGxlLXhycC1iaW5hbmNlLXRva2VuLXFudC1wcmljZXMtZ2FpbmVyLWxvc2VyLTE1OTk5OTDSAdABaHR0cHM6Ly9uZXdzLmFicGxpdmUuY29tL2J1c2luZXNzL2NyeXB0by9jcnlwdG9jdXJyZW5jeS1wcmljZS10b2RheS1pbi1pbmRpYS1tYXktNS1jaGVjay1tYXJrZXQtY2FwLWJpdGNvaW4tZXRoZXJldW0tbWVyZ2UtZG9nZWNvaW4tc29sYW5hLWxpdGVjb2luLXJpcHBsZS14cnAtYmluYW5jZS10b2tlbi1xbnQtcHJpY2VzLWdhaW5lci1sb3Nlci0xNTk5OTkwL2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Sees Gains As Sui Becomes Top Loser - ABP Live",
        "content": "Bitcoin (BTC) and Ethereum (ETH) — two of the most valued crypto coins — managed to rise above the $29,000 and $18,00 marks, respectively, on early Friday morning. Other popular altcoins — including the likes of Dogecoin (DOGE), and Litecoin (LTC) — landed in the negative as overall prices saw minor losses across the board. Casper (CSPR) emerged to be the biggest gainer, seeing a 24-hour jump of over 3.04 per cent. Sui (SUI), on the other hand, turned out to be the biggest loser.\n\nAt the time of writing, the global crypto market cap stood at $1.20 trillion, registering a 24-hour gain of 0.14 per cent.\n\nBitcoin (BTC) price today\n\nBitcoin price stood at $29,266.13 seeing a 24-hour gain of 0.62 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 25.45 lakhs.\n\nEthereum (ETH) price today\n\nETH price stood at $1,899.59, marking a 24-hour loss of 0.13 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 1.65 lakhs.\n\nDogecoin (DOGE) price today\n\nDOGE registered a 24-hour loss of 0.73 percent as per CoinMarketCap data, currently priced at $0.07884. As per WazirX, Dogecoin price in India stood at Rs 6.8698.\n\nLitecoin (LTC) price today\n\nLitecoin saw a 24-hour loss of 1.18 percent. At the time of writing, it was trading at $88.34. LTC price in India stood at Rs 7,567.23.\n\nRipple (XRP) price today\n\nXRP price stood at $0.4643, seeing a 24-hour gain of 0.10 percent. As per WazirX, Ripple price stood at Rs 40.0021.\n\nSolana (SOL) price today\n\nSolana price stood at $22.00, marking a 24-hour loss of 1.26 percent. As per WazirX, SOL price in India stood at Rs 1,930.00.\n\nTop crypto gainers today (May 5)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nCasper (CSPR)\n\nPrice: $0.06165\n\n24-hour gain: 3.04 percent\n\nInternet Computer (ICP)\n\nPrice: $6.00\n\n24-hour gain: 2.69 percent\n\nToncoin (TON)\n\nPrice: $2.09\n\n24-hour gain: 1.94 percent\n\nTrust Wallet Token (TWT)\n\nPrice: $1.18\n\n24-hour gain: 1.82 percent\n\nKava (KAVA)\n\nPrice: $0.7898\n\n24-hour gain: 1.69 percent\n\nTop crypto losers today (May 5)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nSui (SUI)\n\nPrice: $1.27\n\n24-hour loss: 9.58 percent\n\nStacks (STX)\n\nPrice: $0.7526\n\n24-hour loss: 5.45 percent\n\nOptimism (OP)\n\nPrice: $2.04\n\n24-hour loss: 4.82 percent\n\nInjective (INJ)\n\nPrice: $7.43\n\n24-hour loss: 4.56 percent\n\nMina (MINA)\n\nPrice: $0.6222\n\n24-hour loss: 4.51 percent\n\nWhat Crypto Exchanges Are Saying On Present Market Scenario\n\nMudrex co-founder and CEO Edul Patel told ABP Live, “Bitcoin fluctuated between US$28,700 and US$29,000 on Thursday, but after the Federal Reserve announced an interest rate increase, the cryptocurrency saw a steady uptick, with bullish trends apparent. Currently, BTC is supported at US$28,800 and faces resistance at US$29,420. In contrast, Ethereum remained stable at US$1,900 during the last 24 hours. Investors are closely monitoring the U.S. employment data set to release today.”\n\nWazirX Vice President Rajagopal Menon said, “Crypto markets remain in a state of confusion as Bitcoin stays near $29,000 while investors assess recent central bank interest rate increases and ongoing bank crises. Data from CryptoQuant shows high selling pressure but also a high Coinbase and Korean premium, suggesting strong buying demand. On WazirX, Orchid (OXT) and Bakery Token (BAKE) have been the top gainers in the last 24 hours.”\n\nBuyUcoin CEO and India’s second-longest-running digital asset exchange Shivam Thakral said, “The crypto market quickly recovered from the latest rate hike of 25 basis points announced by the Fed. BTC is holding strong above the $29,000 mark while Ether is almost touching the $1900 level at the time of writing. The crypto market is witnessing restricted growth due to high inflation and other macroeconomic factors and the Jobs data on Friday will act as a key stimulant for the market momentum.”\n\nSathvik Vishwanath, CEO and co-founder of Unocoin said, “Bitcoin is currently trading at $29,286 while other major cryptocurrencies like BNB and ETH are trading at around $326 and $1,900 respectively. The crypto market remains in a consolidation phase as economic risks and the likelihood of a short-term Fed rate cut cycle increase. US Treasury markets are taking note, and if yields continue to trend downward, cryptocurrencies like Bitcoin could benefit from safe-haven demand as investors look for hard money alternatives to fiat currencies. Despite uncertainty about the global economic outlook, the potential for a short-term bitcoin price pump remains high.”\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vZmluYm9sZC5jb20vd2UtYXNrZWQtY2hhdGdwdC13aGF0LXdpbGwtYmUtZXRoZXJldW0tcHJpY2UtaW4tMjAyNS1oZXJlcy13aGF0LWl0LXNhaWQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "We asked ChatGPT what will be Ethereum price in 2025; Here's what it said - Finbold - Finance in Bold",
        "content": "With the renewed interest in artificial intelligence (AI) sparked by the release of the text-based AI platform ChatGPT, the tool has proven exceptionally useful in multiple areas, including providing insights into the future price trends of assets on the cryptocurrency market, such as that of Ethereum (ETH).\n\nAfter dutifully reminding the reader that “investing in cryptocurrencies is risky” and that the actual price of Ethereum may be higher or lower than the estimates, ChatGPT has provided “some information on the possible Ethereum price range by 2025, based on ecosystem developments and upgrades, related news, community support, user base, and other factors.”\n\nIs $10,400 possible?\n\nAs some of the factors that could impact crypto asset’s price by 2025, ChatGPT singled out the “ongoing development and improvement of the Ethereum ecosystem, including upgrades to the Ethereum 2.0 protocol,” and “the growth of decentralized finance (DeFi) applications.”\n\nOn top of that, the AI tool pointed out the “adoption by major companies or financial institutions, or partnerships with other blockchain projects” as well as “the number of customers and developers building on the Ethereum blockchain” as further positive factors potentially driving its price up. Finally, as it explained:\n\nEthereum price prediction for 2025. Source: ChatGPT\n\nOther not-so-bullish predictions\n\nAt the same time, CoinPriceForecast is a lot less bullish on the price of Ethereum in 2025, predicting a price of $2,685 at the end of 2024, followed by $2,825 by mid-2025 and ending the year 2025 with $2,446, according to the most recent data retrieved by Finbold.\n\nEthereum price prediction for 2023, 2024, and 2025. Source: CoinPriceForecast\n\nInterestingly, the price prediction model over at PandaForecast trends more to the bearish side, targeting $2,045 in January 2025, $1,319 in June, and $1,752 in December 2025, with even its optimistic range seeing $2,224 at the year’s beginning and $2,084 at its conclusion.\n\nEthereum price analysis\n\nMeanwhile, Ethereum was at press time trading at the price of $1,901, which represents a very modest increase of 0.03% on the day, as well as a drop of 0.49% in the last seven days but still a 1.59% gain on its monthly chart, according to the data retrieved on May 5.\n\nEthereum 30-day price chart. Source: Finbold\n\nWhether the ChatGPT’s very optimistic prediction has a chance o f coming true will largely depend on future positive sentiment and developments directly connected to the Ethereum network, as well as the overall attitude on the wider crypto and macro landscapes.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vdHJhZGVyLW1ha2VzLTM4Njc1LXByb2ZpdC13aXRoLXBlcGUtdHVybmluZy0yLTEtZXRoZXJldW0taW50by0xLTcxLW1pbGxpb24tdXNpbmctbWVtZS1jb2luLWh5cGUv0gGIAWh0dHBzOi8vd3d3LmNyeXB0by1uZXdzLWZsYXNoLmNvbS90cmFkZXItbWFrZXMtMzg2NzUtcHJvZml0LXdpdGgtcGVwZS10dXJuaW5nLTItMS1ldGhlcmV1bS1pbnRvLTEtNzEtbWlsbGlvbi11c2luZy1tZW1lLWNvaW4taHlwZS8_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Trader Makes 38,675% Profit with Pepe, Turning 2.1 Ethereum into $1.71 Million Using Meme Coin Hype - Crypto News Flash",
        "content": "A trader netted a massive $1.7 million in profits by buying more than four trillion PEPE coins just before this massive rally.\n\nAmid the current price surge, PEPE is leading the memecoin fest leading it to become the 41st largest cryptocurrency by market cap.\n\nThe memecoin crypto space is currently bustling with activity Pepe (PEPE), the competitor to Dogecoin and Shiba Inu is making much noise. As per the latest report, a crypto trader has recently netted 38,675 percent profit by trading PEPE which is already up by more than 500 percent in just over the last two weeks.\n\nAs per the blockchain tracker LookonChain, the crypto trader purchased a total of four trillion PEPE memecoins at a price of 2.1 Ethereum, worth $4,140 back then. As it turns out, the trader has sold more than 75 percent of its PEPE coin holdings netting more than $1.705 million in profits just within a span of two weeks. The trader now holds a balance of less than one million in his kitty. Data from LookonChain notes:\n\nA SmartMoney bought 4 trillion PEPE at a cost of 2.1 ETH ($4,410) and made approximately $1.71 million! And this guy also traded a lot of MEME coins. The SmartMoney discovered PEPE and spent 2.1 ETH ($4,410) to buy four trillion PEPE six hours after PEPE was listed. After each price surge in PEPE, he sold part of PEPE instead of selling all of them. He sold a total of 3.27 trillion PEPE for $906,000 and currently holds 700 billion PEPE worth $808,000.\n\nThe PEPE coin rally\n\nThe PEPE Coin has been currently leading the rally in the memecoin space and has become the undisputed cryptocurrency among its peers. As of press time, PEPE is trading 128 percent up at a price of $0.00000365 with a market cap of over $1.4 billion. By its market cap, PEPE ranks as the 41st largest cryptocurrency.\n\nAs per the on-chain data tracker, the trader who mostly transacts on the Ethereum blockchain has netted triple-digit profits over the two-other lesser known memecoins. The data from LookonChain notes:\n\n“This smart money has transactions on almost every chain, and 97% of assets are on Ethereum. He also bought BULL at $0.00075, now at $0.0045, which increases 500%. And bought BABYPEPE at $0.00000000024, now at $0.00000000123, which increases 415%.”\n\nPEPE has once again triggered the memecoin fest and grabbed the limelight away from the top players such as Doegcoin (DOGE) and Shiba Inu (SHIB).\n\nRecently, there’s quite some interesting activity spotted with these two of the biggest memecoins. Over the last month, dormant whale address inactive for the last 9.3 years and holding millions of DOGE coins turned active once again.\n\nThis article is provided for informational purposes only and is not intended as investment advice. The content does not constitute a recommendation to buy, sell, or hold any securities or financial instruments. Readers should conduct their own research and consult with financial advisors before making investment decisions. The information presented may not be current and could become outdated."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMipgFodHRwczovL3d3dy5vdXRsb29raW5kaWEuY29tL2J1c2luZXNzLXNwb3RsaWdodC9iaXRjb2luLWFuZC1ldGhlcmV1bS1hcmUtcmVjb3JkaW5nLWxvc3Nlcy10aGUtZW52aXJvbm1lbnRhbC1jb2luLWVjb3RlcnJhLXNvb24tdG8tYnJlYWstdGhlLTMtbWlsbGlvbi1tYXJrLW5ld3MtMjgzOTc50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Bitcoin And Ethereum Are Recording Losses – The Environmental Coin Ecoterra, Soon To Break The 3 Million Mark - Outlook India",
        "content": "Right now, Ecoterra’s presale is happening, and it's already raised over $2.8 million, and it's about to hit the $3 million mark very soon! And the best part? You can get ECOTERRA tokens for just $0.007, but the price is going to go up soon, so you need to act fast! Plus, with the team behind the project announcing that the coin will list for $0.01 in Q3 2023, early-bird investors could see huge returns."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy50aGVjb2lucmVwdWJsaWMuY29tLzIwMjMvMDUvMDUvY29sbGF0ZXJhbC1uZXR3b3JrLWNvbHQtZW1lcmdlcy1hcy1iZXR0ZXItb3Bwb3J0dW5pdHktdGhhbi1zdGFja3MtY3J5cHRvLWFuZC1ldGhlcmV1bS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Collateral Network (COLT) Emerges As Better Opportunity Than Stacks Crypto And Ethereum - The Coin Republic",
        "content": "After the tumultuous market crash last year, 2023 has brought some relief to cryptocurrencies. Among them, Collateral Network (COLT), Stacks (STX), and Ethereum (ETH) are leading the way for bulls. In this article, we will analyze how a new project, Collateral Network, is leaving well-established cryptos like Stacks and Ethereum behind in growth rate.\n\n>>BUY COLT TOKENS NOW<<\n\nStacks Eyes To Tap Artificial Intelligence\n\nAs the hype around the integration of artificial intelligence into Web3 is growing, Stacks has also moved forward. Recently, an AI-powered developer platform, Replit, started featuring the Stacks layer for Bitcoin. After this development, verified Stacks “Repls” will be accessible to over 20 million users of Replit.\n\nThis will help developers learn how to build on the Stacks blockchain. The engineering resources available in the Stacks Replit profile will include code templates, the Stacks Connect start kit, and beginner tutorials. Although Stacks is trying to integrate new technologies into its blockchain, the growth has tumbled in the past few weeks. At the time of writing, Stacks (STX) is changing hands at $0.71.\n\nEthereum Launches ETHIndia Grant 2.0\n\nTo increase its adoption and network activity, Ethereum has launched the second season of the ETHIndia Grants program. Under ETHIndia, Ethereum will provide developers with up to $5,000 in equity-free grants to support their projects. Besides, Ethereum will also provide continuity grants or external funding to growth-oriented projects.\n\nEthereum, through this program, wants to encourage and incentivize developers to build projects in the areas of ZK tech, next-gen wallets, and more. The ETHIndia Grants 2.0 program has followed the launch of Ethereum’s Shanghai Upgrade. Notably, the market value of Ethereum has witnessed a rise after the rollout of the Shanghai Upgrade. At the time of writing, Ethereum (ETH) is available to trade at $1,887.34, registering an increase of 9% in the past month.\n\nDemand For Collateral Network Shoots Up\n\nAre you looking for a platform where you can unlock liquidity from your luxury watch, vintage car, fine wine, or any other valuable physical asset and borrow crypto?\n\nCollateral Network will be the go to place on the blockchain to achieve this. On Collateral Network, people will be able to borrow crypto by using their real world physical assets as collateral. This unique platform is set to disrupt the traditional lending market set to be worth $1721.38 billion by 2031 (source: allied market research).\n\nBorrowers seeking loans send their physical assets to Collateral Network. The company then evaluates the asset, mints an NFTs that represent the physical item and fractionalizes it. These asset-backed fractional NFTs are sold to investors to fund the loans.\n\nLenders on the platform are from all over the globe so borrowers now have access to global liquidity and can obtain loans at competitive rates, lenders in return earn a fixed weekly income.\n\nThe platform is permissionless so there will be no need to submit private documents like proof of income or credit history to secure a loan.\n\nCollateral Network’s presale is storming and COLT tokens are set to skyrocket by 3500% to $0.35 in the upcoming months. Just 38% of the total COLT supply will be released during the presale, and over 100 million tokens are already sold. At present, you can lock a COLT token at $0.014.\n\nFind out more about the Collateral Network presale here:\n\nWebsite: https://www.collateralnetwork.io/\n\nPresale: https://app.collateralnetwork.io/register\n\nTelegram: https://t.me/collateralnwk\n\nTwitter: https://twitter.com/Collateralnwk\n\n\n\nDisclaimer: Any information written in this press release or sponsored post does not constitute investment advice. Thecoinrepublic.com does not, and will not endorse any information on any company or individual on this page. Readers are encouraged to make their own research and make any actions based on their own findings and not from any content written in this press release or sponsored post. Thecoinrepublic.com is and will not be responsible for any damage or loss caused directly or indirectly by the use of any content, product, or service mentioned in this press release or sponsored post."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vaW90YS1zaGltbWVyLW5ldHdvcmstYm9vbXMtd2l0aC0yMjAwMC1kYWlseS1hY3RpdmUtYWRkcmVzc2VzLWFuZC1iZXR0ZXItcGVyZm9ybWFuY2UtdGhhbi1ldGhlcmV1bS_SAYoBaHR0cHM6Ly93d3cuY3J5cHRvLW5ld3MtZmxhc2guY29tL2lvdGEtc2hpbW1lci1uZXR3b3JrLWJvb21zLXdpdGgtMjIwMDAtZGFpbHktYWN0aXZlLWFkZHJlc3Nlcy1hbmQtYmV0dGVyLXBlcmZvcm1hbmNlLXRoYW4tZXRoZXJldW0vP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "IOTA: Shimmer Network Booms with 22,000 Daily Active Addresses and Better Performance than Ethereum - Crypto News Flash",
        "content": "The daily active addresses on the Shimmer Network saw a major boost with the start of the Treasures of Shimmer airdrop campaign.\n\nSince its launch 7 months ago, the Shimmer blockchain has delivered robust performance without any bugs or any other major issues.\n\nThe IOTA Shimmer network has gained popularity in just a few months of launch and is turning out to be one of the most preferred platforms for new projects to launch their services. In the latest development, IOTA co-founder Dominik Schiener took to Twitter to celebrate the milestone for the Shimmer Layer 1 network.\n\nReporting a massive growth in utility, Schiener said that the Shimmer blockchain now has 22,000 daily active addresses. This followed the airdrop campaign by Treasures of Shimmer. In the recent development, Web3 gaming experience IOTAHeroes has launched the Treasures of Shimmer Battle test on the ShimmerEVM network.\n\nSchiener said that the Shimmer ecosystem is flourishing and growing daily and that the native SMR token price will hit new highs very soon.\n\n22k daily active addresses just on the Shimmer L1 yesterday with the start of the Treasures of Shimmer airdrop campaign. The tech is amazing. The ecosystem is flourishing and growing daily. This is the way $SMR #Shimmer Imagine how SMR will fly once this hits mainnet. pic.twitter.com/H7utlU9e5y — Dominik Schiener (@DomSchiener) May 4, 2023\n\nThe Treasures of Shimmer kicked off earlier this week on May 3 and is a two-week-long incentive campaign that will reward projects and users for participating in the public testing of the ShimmerEVM chain, as well as the dApps deployed on it. Later, the participants will participate in the public testing of 1.3 million SMR tokens.\n\nThe Robust Performance of the Shimmer Network\n\nIn its report for the first quarter of the year 2023, the IOTA Foundation spoke about the success of the Shimmer Network attained in a very short period of time. Since its launch in late September 2022, IOTA’s staging network Shimmer operated successfully without any bugs or any other major issues.\n\nAs we know, both IOTA and the Shimmer networks are Layer-1 platforms that use the Tangle technology with DAG for transactions as well as data storage but differ in tokenization. Shimmer’s Stardust protocols also facilitate NFTs, customer tokens, and alias outputs on the Layer 1 network.\n\nNote that Shimmer is a staging network of the IOTA blockchain and serves as a testbed for testing new innovations before they make their way to the IOTA mainnet. The Stardust feature is currently limited only to Shimmer and might arrive on the IOTA blockchain in the future.\n\nAlso, while IOTA uses dust protection, Shimmer asks users to back up their stored data on the Tangle with the SMR tokens. Everyone is now eagerly awaiting the launch of the ShimmerEVM which will facilitate seamless transfer of assets between Shimmer and Ethereum.\n\nHowever, developers have currently launched the ShimmerEVM testnet a month ago. The Shimmer EVM testnet has reached a transaction milestone of approximately one million and has over 38,000 active wallet addresses, just a month after its launch. The platform has also successfully deployed over 2,200 smart contracts.\n\nThis article is provided for informational purposes only and is not intended as investment advice. The content does not constitute a recommendation to buy, sell, or hold any securities or financial instruments. Readers should conduct their own research and consult with financial advisors before making investment decisions. The information presented may not be current and could become outdated."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3RoZWN1cnJlbmN5YW5hbHl0aWNzLmNvbS9hbHRjb2lucy90aGUtY2FuY3VuLXVwZ3JhZGUtYm9vc3RpbmctdGhlLXBlcmZvcm1hbmNlLWFuZC1iZW5lZml0cy1vZi1ldGhlcmV1bS1iYXNlZC1wcm9qZWN0cy01NDA3M9IBhwFodHRwczovL3RoZWN1cnJlbmN5YW5hbHl0aWNzLmNvbS9hbHRjb2lucy90aGUtY2FuY3VuLXVwZ3JhZGUtYm9vc3RpbmctdGhlLXBlcmZvcm1hbmNlLWFuZC1iZW5lZml0cy1vZi1ldGhlcmV1bS1iYXNlZC1wcm9qZWN0cy01NDA3My9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "The Cancun Upgrade: Boosting the Performance and Benefits of Ethereum-Based Projects - The Currency Analytics",
        "content": "Ethereum, the second largest cryptocurrency by market capitalization, is gearing up for its next major upgrade, the Cancun upgrade. This upcoming upgrade is expected to boost the performance of the Ethereum network, making it more efficient and secure than ever before. As the Ethereum network undergoes this upgrade, it is predicted that Ethereum-based projects will also reap the benefits.\n\nOne of the projects that is set to benefit from the Cancun upgrade is Big Eyes Coin, an Ethereum-based project that has recently gained a lot of attention due to its successful presale. Big Eyes Coin is a unique deflationary token that employs a burn mechanism to increase the coin’s scarcity and ultimately drive up its value. With the upcoming Ethereum upgrade, Big Eyes Coin is expected to attract even more attention from the crypto community.\n\nAnother project that is poised to benefit from the Cancun upgrade is Robot Era, a crypto project that aims to compete with the leaders of the NFT gaming metaverse. Robot Era is a platform that allows users to build and customize their own robots, which can then be used in various games and applications. With the improved efficiency and security of the Ethereum network post-upgrade, Robot Era is expected to become a more attractive option for gamers and investors alike.\n\nThe Cancun upgrade is set to bring significant improvements to the Ethereum network, including improvements to transaction throughput, security, and overall performance. These improvements will not only benefit Big Eyes Coin and Robot Era, but also the entire Ethereum ecosystem. As more projects are built on top of Ethereum, the network’s performance and security become increasingly important.\n\nThe Ethereum network has been a leader in the blockchain space for years, and this upgrade shows the continued commitment of the Ethereum team to improving the network’s capabilities. As more and more projects are built on top of Ethereum, the network’s importance only continues to grow, and it is crucial that the network remains efficient and secure.\n\nOverall, the Cancun upgrade is a positive development for the Ethereum community, and it is expected to bring significant benefits to Ethereum-based projects, investors, and users alike. As the upgrade is implemented and the network’s capabilities continue to improve, we can expect to see even more innovation and growth in the Ethereum ecosystem in the coming months and years.\n\nIn conclusion, the Cancun upgrade is a highly anticipated event in the Ethereum community, as it promises to bring significant improvements to the network’s performance, security, and overall functionality. With these upgrades, Ethereum-based projects such as Big Eyes Coin and Robot Era are expected to see an increase in attention and adoption, as the network becomes more efficient and secure."
    }
]