[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDYvMTQvZXRoZXJldW0tZWNvc3lzdGVtLWlzLWdldHRpbmctYnVzaWVyLW5vdC1xdWlldGVyLWFtaWQtbGF5ZXItMi1zaGlmdC_SAXFodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA2LzE0L2V0aGVyZXVtLWVjb3N5c3RlbS1pcy1nZXR0aW5nLWJ1c2llci1ub3QtcXVpZXRlci1hbWlkLWxheWVyLTItc2hpZnQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Ecosystem Is Getting Busier, Not Quieter, Amid Layer 2 Shift - CoinDesk",
        "content": "Lastly, we see strong growth and a shift toward off-chain execution continuing for several reasons. First, the Ethereum protocol continues to move in this direction and will particularly do so with its next upgrade, including proto-danksharding, which expands Ethereum’s data availability capabilities. Moreover, not only is the base layer itself improving, but so, too, are the layer 2s, with improved decentralization and new paradigms around interconnectivity and shared security ahead. And these base and secondary layer improvements will come together to enable new use cases and functionality, creating a virtuous cycle. Portended by rising ecosystem transaction counts, Ethereum is perhaps on its way to becoming the world’s settlement layer."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA2LzE0L2p1c3QtaG93LXJlYWxpc3RpYy1pcy1hLTUwMDAwLXByaWNlLXRhcmdldC1mb3ItZXRoL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Just How Realistic Is a $50,000 Price Target for Ethereum? - The Motley Fool",
        "content": "Through the first six months of 2023, Ethereum (CRYPTO: ETH) has been one of the top-performing cryptocurrencies, up more than 45% year to date. It now trades around $1,745, after briefly breaking through the $2,000 level earlier this year. However, Ethereum is still down by nearly 65% from its all-time high of $4,891.70.\n\nGiven Ethereum's performance this year, some investors are now recalibrating and putting more aggressive price targets on the token. Most recently, New York-based investment firm VanEck put out a head-spinning $50,000 price target for Ethereum by 2030. Given Ethereum's current price, that implies a more than 25x return. But just how realistic is that?\n\nThe bullish scenario for Ethereum\n\nVanEck's valuation model is based on several key building blocks, so this is not the sort of pie-in-the-sky price target that is so commonly promoted by super-bullish crypto enthusiasts. The first building block is Ethereum's revenue model, which relies primarily on transaction fees. The second building block is Ethereum's coin supply, which is actually decreasing over time, helping to prop up the crypto's price. And the third building block is what VanEck calls the \"broad market capture strategy\" of Ethereum. Basically, this means that Ethereum is involved in just about everything blockchain-related these days.\n\nFor each of these building blocks, it is then possible to construct a base, bear, and bull case scenario. For the bullish scenarios to take place, Ethereum needs to remain the market leader in every niche of the blockchain sector, such as non-fungible tokens (NFTs), while also broadening the number of real-world applications in which it is used in areas such as finance, banking, and payments. This is what a broad market-capture strategy would look like for the next seven years.\n\nTransaction volume and growth forecasts\n\nWhen it was founded back in 2015, Ethereum had a clear first-mover advantage. At that time, it had no legitimate Layer 1 blockchain rivals. But now, Ethereum must contend with the likes of Solana, Avalanche, and Cardano. And each of these Layer 1 blockchain rivals will continue to chip away at Ethereum's transaction volume. This makes it highly unlikely that Ethereum will hit the revenue targets in the bull case scenario. Right now, VanEck is projecting that transaction fees (i.e., revenue) will explode by more than 50x between now and 2030.\n\nThat doesn't seem likely, given that Ethereum continues to rely on a patchwork system of Layer 2 blockchains (which sit on top of its main blockchain) to process all of those transactions. VanEck views this Layer 2 ecosystem as a positive for Ethereum, and seems to suggest that the transaction fees generated on these blockchains should be factored into the overall revenue mix of Ethereum.\n\nBut I'm not so convinced that this Layer 2 blockchain activity should be seen as a sign of strength. From my perspective, they are just further proof that Ethereum is having a hard time going one-on-one with its rival Layer 1 blockchains, which are still much faster and much cheaper to use. Ethereum is most likely years away from reaching its peak transaction-processing capabilities.\n\nCan Ethereum reach $50,000?\n\nGiven all of the above, VanEck appears to be too aggressive in its growth assumptions for Ethereum. For example, VanEck currently projects revenue for the category \"metaverse, social, and gaming\" to balloon by 50x in its bull case scenario. Counting on massive growth in this category seems flawed given that the metaverse investment thesis has completely imploded over the past 18 months.\n\nAnd not taking into account all the potential for its Layer 1 rivals to chip away at its dominance seems short-sighted to me. Plus, it's important to keep in mind regulatory risk. If the Securities and Exchange Commission ever rules that Ethereum is a security, that would pose a huge risk to Ethereum's business model.\n\nSimply put, a $50,000 price forecast just seems too aggressive. Remember: the all-time high for Ethereum is under $5,000, and Ethereum has already shown real weakness this year when it comes to pushing past the $2,000 mark. That being said, I'm still bullish on Ethereum both in the short term and the long term. It is a highly diversified crypto with exposure to every sector of the blockchain world. But I am readjusting my own expectations about Ethereum to keep them as realistic as possible."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vd3d3Lmpkc3VwcmEuY29tL2xlZ2FsbmV3cy9jb3VydC1wcm92aWRlcy1ndWlkYW5jZS1vbi1zb2NpYWwtNTkwOTA1NS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Court Provides Guidance on Social Influencer Advertising in Ethereum Max Crypto Lawsuit - JD Supra",
        "content": "This week, a federal court in California issued an 80-page opinion that painstakingly walks through claims made against several celebrities who had promoted the Ethereum Max (EMAX) cryptocurrency, also called tokens.\n\nThe lawsuit was filed last year against Kim Kardashian, Floyd Mayweather, and former professional basketball player Paul Pierce, challenging their EMAX endorsements and social media posts. Since then, the plaintiffs have amended the complaint multiple times.\n\nAmong other issues it addressed, this week’s court decision provided a helpful reference point showing where a court aligned with and diverged from the Federal Trade Commission’s Endorsement Guides.\n\nFirst, the court found that the “#AD” disclaimer in the following post made clear that Kardashian was being paid, even though it appeared toward the bottom of the post.\n\nThe court held that because “#AD” appeared before the swipe-up banner, “any reasonable consumer would inevitably see the hashtags before swiping up to purchase the Tokens.” It observed that Kardashian is a well-known influencer who is paid for many of her social media posts, and therefore, “it should not come as a surprise to any reasonable consumer that she was paid” for the post, given that it included the “#AD” disclaimer. The court dismissed the plaintiffs’ challenge to the disclosure and concluded it was clear that the post was sponsored advertising.\n\nThe decision demonstrates that courts will look at social posts in context to determine whether reasonable consumers understand that a post is sponsored. It also appears to diverge from the FTC’s position in the Endorsement Guides: What People Are Asking, where the agency writes, “if #ad is mixed in with links or other hashtags at the end, some readers may just skip over all of that stuff.”\n\nSecond, the court weighed in on a so-called dark pattern (though thankfully it did not use the phrase). In her post, Kardashian also wrote that EMAX “burned…literally 50% of their admin wallet…,” which the court said created a false sense of scarcity. It found that “[t]he only possible reason that a business would pay someone to tell millions of followers that its product was rapidly being ‘burned’ is to create an impression of scarcity. . . Advertising that conveys messages concerning limited supply or limited time offers are meant to create a sense of urgency and will inevitably be material to consumers who want the product or price offered.” However, it is possible that the nature of the challenge—a cryptocurrency where scarcity and timing hugely impact the price and value—played into the court’s reasoning.\n\nNext, the court held that Mayweather’s statement at the “Bitcoin 2021” conference that “I believe there’s gonna be another cryptocurrency just as large as Bitcoin someday,” while wearing a t-shirt with “EthereumMax” emblazoned across the chest, was “clearly puffery, upon which no reasonable consumer could rely.” The court noted that it was a statement of opinion about the prospects for the future, not a measurable, objective statement of fact. Similarly, the court rejected the plaintiffs’ argument that Mayweather had a duty to disclose that he was being paid by EMAX’s founders when he wore certain articles of EMAX clothing and allowed EMAX to exploit his name and likeness.\n\nHowever, the court found that a “fraud by omission” claim required plaintiffs to allege specifically where and how the disclosure should have been made. Thus, it suggested that it might agree with the plaintiffs if they amend their complaint to allege more detailed facts in the complaint. Whether the court will ultimately agree with the plaintiff (and the FTC’s position on the matter) remains to be seen.\n\nInterestingly, the defendants argued that plaintiffs could have avoided the losses by refraining from investing or doing more research before investing. The court rejected this argument, noting it is “significant that the social media posts and promotions were specifically aimed at the celebrities’ already-dedicated followers” and “by definition such ‘followers’ are inevitably predisposed to place significance on what the celebrities they follow are doing and saying.” As a result, it held that “the celebrities’ own followers are particularly vulnerable to the messages conveyed to them, perhaps suggesting that such consumers should not bear all the risk.”\n\nThe court went one step further, observing that the relevant information (i.e., that the celebrities were promoting the tokens in exchange for a commission as opposed to an honest belief in the soundness of the investment) was not disclosed anywhere by anyone, and even if consumers could have suspected that the celebrities were being paid to promote the tokens, there was nothing they could do to confirm or dispel that belief.\n\nFinally, when determining consumer injury, the court looked at the FTC’s Data Spotlight: “Reports show scammers cashing in on crypto craze,” when determining whether consumers suffered harm from the defendants’ marketing. It acknowledged that the report did not specifically address or name any of the defendants in the case, but it nevertheless found it plausible that the defendants “engaged in the exact kind of bogus crypto ‘investment opportunity’ scam that the FTC Data Spotlight reported on as causing hundreds of millions (and rising) of dollars of damage to investors.”\n\nThe decision suggests that courts will follow the FTC’s guidance in many circumstances, and even look to the agency’s reports when analyzing consumer harm. However, the opinion signals that (as with all advertising), influencers’ social media posts and endorsements should be viewed in context. The Ethereum Max plaintiffs have one more opportunity to amend the complaint, where we expect these issues to continue to play out. Stay tuned."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiHWh0dHBzOi8vbWlsa3JvYWQuY29tL2xheWVyLTIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "5 Ethereum Layer 2 Projects 2024 - L2 Solutions For ETH - Milk Road",
        "content": "Key Takeaways Layer 2 solutions provide faster and cheaper transactions compared to the main Ethereum blockchain.\n\nThere are several Layer 2 blockchains that enjoy mass adoption.\n\nDifferent Layer 2 technologies determine the tradeoffs between speed, security, and cost that the different solutions employ.\n\nTop 5 Ethereum L2 Projects\n\nPolygon (MATIC): Best mainstream Layer 2\n\nBest mainstream Layer 2 Arbitrum: Best for developers\n\nBest for developers Optimism: Best for Ethereum compatibility\n\nBest for Ethereum compatibility StarkEx: Best for high performance\n\nBest for high performance zkSync: Best for security\n\nProject Daily Active Users Transactions per Second Platform Token Total Value Locked (TVL) Polygon (MATIC) 400,000 65,000 MATIC $1.09 billion Arbitrum 130,000 40,000 ARB $2.22 billion Optimism 40,000 2,000 OP $900 million StarkEx N/A N/A None $540 million zkSync N/A N/A None $52 million\n\nPolygon (MATIC) Best Mainstream Layer 2 Learn More at Polygon (MATIC) Daily Active Users 400,000 400,000 Transactions per second 65,000 65,000 Token MATIC MATIC TVL $1.09 billion $1.09 billion Overview Polygon is one of the most popular Layer 2 solutions for Ethereum. It processes transactions for a wide range of trading applications, blockchain games, and more. In fact, large web2 companies such as Meta and Reddit rely on Polygon to power the blockchain-enabled parts of their applications. Pros & Cons Pros Cheap, fast, and efficient blockchain that supports a wide range of use-cases\n\nOver 400,000 daily active users\n\nThe project is supported by large names such as Coinbase Ventures Cons Polygon’s proof-of-stake (PoS) consensus mechanism has been criticized for being too centralized in the past\n\nLayer 2’s like Polygon are generally not quite as secure as the main Ethereum chain\n\nArbitrum Best For Developers Learn More at Arbitrum Review 4.7 Daily Active Users 130,000 130,000 Transactions per second 40,000 40,000 Token ARB ARB TVL $2.22 billion $2.22 billion Overview Arbitrum is a rollup-based Layer 2 and also one of the biggest Ethereum scaling solutions. The Arbitrum airdrop in March of 2023 led to over $1 billion dollars of wealth creation for users of the platform as they all received free ARB tokens in their wallets. Pros & Cons Pros More than 3.9 million users\n\nLarge ecosystem that includes NFT marketplaces, blockchain games, stablecoins and much more.\n\nSupported by some of the largest decentralized finance (DeFi) apps including 1inch, Aave, Balancer, and more Cons Arbitrum is not a standalone chain and thus relies on the security of the underlying Ethereum chain in order to run\n\nThe optimistic rollup technology of Arbitrum means withdrawals of funds can take up to a week\n\nOptimism Best For Ethereum Compatibility Learn More at Optimism Review 4.5 Daily Active Users 40,000 40,000 Transactions per second 2,000 2,000 Token OP OP TVL $900 million $900 million Overview Optimism is another popular rollup scaling solution for the Ethereum ecosystem. The project was started in 2019 and has since become one of the largest Layer 2 solutions, with a TVL of almost $1 billion. Pros & Cons Pros Has saved users over $1 billion in gas fees compared to Ethereum\n\nOptimism “quests” allow users to earn bounties for learning about the Optimism ecosystem\n\nThe Optimism team has promised a “season of airdrops” for regular users Cons Optimism currently uses a single “sequencer” to order transactions before submitting them to Ethereum, which introduces a significant level of centralization\n\n“Optimistic rollup” technology is still quite new and not fully tested Features Over 40,000 daily active users\n\nHome to one of the most popular crypto trading platforms, Synthetix\n\nVery tightly integrated with Ethereum, boasting “If it works on Ethereum, it works on Optimism at a fraction of the cost.”\n\nStarkEx Best For High Performance Learn More at StarkEx Review 4.5 Daily Active Users N/A N/A Transactions per second N/A N/A Token None None TVL $540 million $540 million Overview StarkEx is a scaling solution that’s a bit different from the others on the list. It relies on “zero-knowledge proofs” which is a faster and more secure scaling mechanism. By using zero-knowledge proofs StarkEx can provide low gas fees and fast transactions without compromising on security. Pros & Cons Pros Trusted by some of the most popular Ethereum projects including Sorare, ImmutableX, and dYdX\n\nHas over 100,000 users\n\nBatches transactions for much higher throughput Cons Zero-knowledge proof technology is complex and may take a while for beginners to understand\n\nUnlike many other Layer 2’s, StarkEx does not have a platform token you can buy and trade Features Processed over $700 billion in trading volume\n\nProcessed over 290 million transactions\n\nOver 90 million NFTs minted\n\nzkSync Best For Security Learn More at zkSync Review 4.7 Daily Active Users N/A N/A Transactions per second N/A N/A Token None None TVL $52 million $52 million Overview zkSync is another Layer 2 that uses zero-knowledge (ZK) proofs to scale the Ethereum blockchain. zkSync is committed to not only scaling the speed of the Ethereum blockchain but preserving its values of freedom, self-sovereignty, and decentralization. Pros & Cons Pros zkSync takes security seriously — bug bounties offer up to $2.3 million for revealing critical security flaws\n\nAll code is open-source which provides transparency and trust\n\nOver 500,000 active user accounts Cons zkSync’s emphasis on security means the platform is experiencing a slow roll-out\n\nNot nearly as widely adopted as other Layer 2’s like Polygon and Arbitrum Features Makes no security compromises since it inherits 100% of Ethereum’s security features\n\nSupports all Ethereum-based projects without requiring them to make any code changes\n\nHas raised over $450 million in funding from notable investors such as a16z and Dragonfly\n\nWhat Are Ethereum Layer 2 (L2) Protocols?\n\nEthereum is one of the most popular blockchains. However, its focus on strict security and decentralization means that the blockchain can only process about 14 transactions per second. Because of this, Ethereum transaction costs are usually very high, and transactions can take a long time to process.\n\n“Layer 2” solutions are blockchains built on top of (or in parallel with) the Ethereum blockchain that is used to scale its capabilities. These chains usually process many more transactions per second for much less in fees. In return, however, Layer 2 blockchains are usually more centralized and not as well-secured as the main “Layer 1” Ethereum chain.\n\nAs an analogy, you can imagine the Ethereum network as the US Postal Service — or the main government-owned postal courier in a country. It is reliable, secure, and available to everyone, but it often suffers from congestion, delays, and relatively high costs due to its wide reach and demand.\n\nLayer 2’s, on the other hand, are like private delivery services. There are many more of them, and they can transfer packages faster and cheaper. On the other hand, they don’t have the credibility of the main postal service and may not be trusted by everyone to ship the most important packages.\n\nWhy Do We Need L2 Solutions?\n\nMany popular blockchain projects are building their services on Layer 2 blockchains in order to provide their users with more affordable trading, gaming, lending, and much more. Large tech companies such as Reddit and Meta are opting to use Layer 2 solutions to bring their web3 offerings to the masses for a low cost.\n\nThe Ethereum blockchain has upcoming upgrades which will scale the capacity of the network. However, there are already several tried-and-true Layer 2 projects, and the bridges need to use them, that will most likely continue to see wide adoption even as the main Ethereum chain improves.\n\nL1 Vs. L2\n\nLayer 1\n\nAverage transaction fees are $5+\n\nTransactions per second are limited to around 14\n\nSecurity is a top priority that hampers the speed of the blockchain\n\nFully decentralized — cannot be changed or halted without mass consensus\n\nLayer 2\n\nAverage transaction fees are less than $1\n\nCan process potentially hundreds of thousands of transactions per second\n\nSecurity is still very tight, but may sometimes be compromised in favor of speed\n\nSome Layer 2 chains are much more centralized than Layer 1’s, leading to concerns about their reliability and independence\n\nWhat Are Ethereum Rollups?\n\nOptimism, Arbitrum, StarkEx, and zkSync are all examples of Ethereum “rollups.” A rollup is a type of Layer 2 scaling technology that processes transactions off-chain and then submits them all together in a “rollup” to the main Ethereum chain.\n\nThere are two types of rollups:\n\nOptimistic Rollups: Optimistic rollups assume that all transactions within the rollup are valid, and they are automatically submitted to the main Ethereum chain. If a transaction is not valid, there is a specific time window within which anyone can submit “fraud proof” that proves the transaction is incorrect. This allows the chain to process transactions quickly and only do extra work if a transaction is proven to be fraudulent. Arbitrum and Optimism are examples of Layer 2’s utilizing optimistic rollups.\n\nOptimistic rollups assume that all transactions within the rollup are valid, and they are automatically submitted to the main Ethereum chain. If a transaction is not valid, there is a specific time window within which anyone can submit “fraud proof” that proves the transaction is incorrect. This allows the chain to process transactions quickly and only do extra work if a transaction is proven to be fraudulent. Arbitrum and Optimism are examples of Layer 2’s utilizing optimistic rollups. Zero-Knowledge Rollups: Zero-knowledge, or “ZK,” rollups check every single transaction for validity before submitting it to the blockchain. These types of rollups use sophisticated cryptography and math known as “zero-knowledge proofs” in order to verify that each transaction is legitimate. Among decentralization and security purists, ZK rollups are the preferred Ethereum scaling mechanism. However, they are much more complicated than optimistic rollups and have not yet enjoyed as wide of adoption. StarkEx and zkSync are examples of Layer 2’s utilizing zero-knowledge rollups.\n\nTo Sum It Up\n\nEthereum sees tons of demand and Layer 2’s are here to help scale the blockchain and make it accessible to everyone. While the technologies are still in their infancy, Layer 2’s such as Polygon and Arbitrum are already seeing wide adoption, while ZK-based Layer 2’s like StarkEx and zkSync promise cheaper transactions with no impact on security.\n\nFrequently Asked Questions\n\nWhat Are ETH L2 Tokens? L2 tokens are the platform tokens for Layer 2 blockchains such as Polygon, Arbitrum, and Optimism. L2 tokens trade just like any other cryptocurrency token, meaning they may go up or down in price. What Are The ETH L2 Fees? L2 fees are generally much lower than the fees on Ethereum Mainnet. For example, the average fee on Polygon is $0.018 per transaction, compared to $5+ on Ethereum. What Is The Best Ethereum L2? It’s difficult to say that any single L2 is the best. It really depends on what you’re looking for. For wide adoption and fast transactions, L2’s like Polygon and Arbitrum are good choices. If security and decentralization is very important to you, then zero-knowledge rollups like StarkEx and zkSync may be good choices.\n\nContributor George Hristov George is a tech writer interested in web3 startups and communities. In the dynamic world of crypto, he stays plugged into the day-to-day headlines, deep dives, and industry commentary. Read More"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3RoZS1ncmFwaC1taWdyYXRlcy10by1hcmJpdHJ1bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "The Graph ditches Ethereum, migrates to Arbitrum in anticipated move - Blockworks",
        "content": "The Graph, a blockchain indexing protocol founded in 2018, is fully migrating to the Arbitrum network from Ethereum on Wednesday.\n\nThe Graph’s move to the popular layer-2 was initiated by network participants in an attempt to lower gas fees, accelerate transactions, and increase the protocol’s accessibility, according to a press release from The Graph Foundation.\n\nEdge & Node CEO Tegan Kline said users weighed the options among layer-2 networks and Arbitrum ultimately came out on top.\n\n“The Graph users have continually searched for solutions to improve gas efficiencies and enhance other aspects of the network,” Kline said in a statement. “After careful consideration of all options on the market, the ecosystem selected Arbitrum as the Layer 2 scaling solution that will bring speed and affordability to protocol developers and network participants.”\n\nThis has been long in the making, with plans to move being known as far back as April 2022 via a governance proposal that suggested creating a set of contracts that would bridge GRT transactions to Arbitrum. Discussions about moving to a layer-2 network because of prohibitively expensive gas prices date back to November 2021 on The Graph’s forums.\n\nA June 2022 proposal was the first to present a deployment of The Graph on Arbitrum. Its proposers, Edge & Node software engineers Pablo Carranza Vélez and Ariel Barmat, suggested it wasn’t a good idea to migrate in “one go.”\n\nSince then, The Graph has gradually taken more steps to exit the Ethereum network, including enabling indexing rewards on Arbitrum and deploying transfer tools enabling users to move tokens to Arbitrum. Both proposals were passed unanimously.\n\nThe statement from The Graph Foundation further explained that its users should start receiving transition prompts today.\n\n“Protocol users will be presented with an option to transition to Arbitrum across The Graph’s suite of products. Protocol rewards will continue to gradually shift from Ethereum to Arbitrum, and over time, will transition entirely to Arbitrum,” the press release said.\n\nUpdated June 14, 2023 at 2:00 pm ET: A previous version of this article stated that The Graph migrated to Arbitrum on Tuesday. The protocol made the switch on Wednesday.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vb2JzZXJ2ZXIuY29tLzIwMjMvMDYvZXRoZXJldW0tdml0YWxpay1idXRlcmluLWRvbmF0aW9uLWNyeXB0by1jb3ZpZC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Co-Founder Vitalik Buterin Donates $100M in Crypto for Covid Relief - Observer",
        "content": "Vitalik Buterin, co-founder of the Ethereum Blockchain, is donating $100 million to fund Covid-19 research projects in India. However, the funds won’t be given as physical cash but in the form of USD Coin (USDC) cryptocurrency.\n\nSign Up For Our Daily Newsletter Sign Up Thank you for signing up! By clicking submit, you agree to our <a rel=\"nofollow noreferer\" href=\"http://observermedia.com/terms\">terms of service</a> and acknowledge we may use your information to send you emails, product samples, and promotions on this website and other properties. You can opt out anytime. See all of our newsletters\n\n“Pandemics beyond Covid continue to be a large risk in the 21st century,” the Russian-American programmer tweeted. “We look forward to continuing our efforts to better live with airborne viruses and eventually live without them.”\n\nEarmarked for improvements in indoor air quality and research into the effects of Long Covid, $10 million in USDC will be provided by Buterin himself, while $90 million worth of the cryptocurrency will be given by Crypto Relief, a Covid-19 relief fund created by Sandeep Nailwal, the founder of the Polygon blockchain. The fund previously allocated $100 million in 2022 to Covid-19 initiatives selected by Buterin.\n\nWhile this year’s donation from Crypto Relief will be given as USDC, it comes from a transfer of the meme-cryptocurrency Shiba Inu (SHIB) given to the fund by Buterin. In May 2021, he donated more than $1.2 billion worth of the tokens to Crypto Relief, in addition to making million-dollar gifts of cryptocurrency to organizations like Gitcoin, GiveWell, Methuselah Foundation and Machine Intelligence Research.\n\nNailwal later returned $100 million worth of the SHIB coins to Buterin, citing issues surrounding India’s legislation for relief fund distribution. In response, Buterin formed his own fund, Balvi, to distribute the money. In November of 2022, Balvi gave $9.4 million in cryptocurrency to the University of Maryland to fund studies on air disinfection, followed by a $15 million donation in March to the University of California San Diego to establish the Meta-Institute for Airborne Disease in a Changing Climate.\n\nWhat are the pros and cons of crypto donations?\n\nA growing number of public institutions and non-profits have begun to accept cryptocurrency donations in recent years. Fidelity Charitable, a public charity and the largest grantmaker in the U.S., has received more than $500 million in cryptocurrency since it began accepting it in 2015, according to its most recent annual report.\n\nGiving cryptocurrency as a donation instead of first converting the digital currency into cash allows donors to bypass the capital gains tax, meaning charities may receive larger donations in crypto than they would in cash. Some nonprofits, like the American Red Cross and Save the Children, have established programs to immediately convert crypto gifts into liquid funds.\n\nFor Buterin’s donation to the University of Maryland, the school partnered with the Giving Block, which aids donees accepting cryptocurrency and helps donors find charities willing to accept the gifts. The University of California San Diego exchanged its donation into U.S. dollars through Engiven, which provides crypto donation services to nonprofits.\n\nBut figuring out how to accept cryptocurrency or when to convert the currency into cash can be confusing for nonprofits. And the unstable nature of the crypto market provides an additional layer of risk for institutions that can’t be certain of a gift’s reliability. Numerous donations promised to nonprofits by the now-bankrupt crypto fund FTX and its founder Sam Bankman-Fried, for example, were withdrawn after FTX collapsed in November.\n\nThe tenuous nature of cryptocurrency gifts was also evident in Buterin’s more than $1 billion gift to Crypto Relief in SHIB, which subsequently spooked holders of the coin and led to a 36 percent decrease in its value, according to Forbes.\n\nOther nonprofits have expressed concerns about these types of donations, such as the energy-intensive nature of cryptocurrency mining. In 2021, Greenpeace announced it would no longer accept Bitcoin because of its environmental impact, while the Mozilla Foundation cited similar reasons for its decision to restrict certain types of cryptocurrency donations.\n\nMeanwhile, the Wikipedia Foundation, which has accepted cryptocurrency since 2014, revealed in May of 2022 that it would stop accepting the donations following a three-month discussion of concerns related to the currency’s energy use and the foundation’s potential promotion of a risky industry."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZGVjcnlwdC5jby8xNDQ2MDEvdGhpcy1tb2JpbGUtcHV6emxlLWdhbWUtZWFybnMteW91LWJpdGNvaW4tZXRoZXJldW0tcGxheWluZ9IBWmh0dHBzOi8vZGVjcnlwdC5jby8xNDQ2MDEvdGhpcy1tb2JpbGUtcHV6emxlLWdhbWUtZWFybnMteW91LWJpdGNvaW4tZXRoZXJldW0tcGxheWluZz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "This Mobile Puzzle Game Earns You Bitcoin or Ethereum for Playing - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIf you’re on the hunt for a casual, free-to-play mobile game that pays you cryptocurrency along the way, Ethereum Blast might do the trick.\n\nWhile I wouldn’t go so far as to say I had a “blast” playing through the simplistic color-matching puzzle stages, it’s a decently fun diversion that can put a little bit of Ethereum or Bitcoin into your wallet while you play.\n\nBling Financial’s free iOS and Android game is a simple color-matching puzzle game with a vibe that’s best described as “sci-fi meets Ethereum.” All that really means is that you’ll see the familiar Ethereum symbol floating around the menus and interface here and there, and people who aren’t crypto die-hards shouldn’t be turned off by that modest window dressing.\n\nAD\n\nAD\n\nEthereum Blast is a straightforward puzzler, tasking you with tapping two or more connected, like-colored stones to clear them from the board. As you clear stones, new ones fall from above to fill the space and potentially sets up larger matches that can earn you power-ups in the process. Each level provides certain targets of stones or items to clear within a limited number of moves.\n\nScreenshots from Ethereum Blast on iOS. Image: Decrypt\n\nIt’s all easy to grasp and control, with simple taps used to clear blocks or activate power-ups. But it’s also largely unchallenging and mostly mindless, and you'll earn plenty of power-ups to get you out of any binds. I played through nearly 50 stages and only lost once along the way. But as a simple on-the-go distraction, it’s pleasant enough—much like Tetro Tiles, another mobile puzzler with crypto rewards.\n\nHow much can you reasonably earn by playing? Your mileage may vary, but I earned about $0.20 worth of crypto in about two hours of play. Bling’s games reward you with Bling points that you can then convert into Ethereum or Bitcoin, and then cash out to a Coinbase or PayPal account. I cashed out in ETH, but it would’ve been the same USD value in Bitcoin too.\n\nIt’s not much—but it’s more than I earned playing Bling’s Bitcoin Solitaire, which earned me about $0.09 worth of Bitcoin in a two-hour span. However, your earning potential in Ethereum Blast diminishes the more you play, as the amount of Bling points offered for playing each stage appears to dwindle over time. The game may not hold your interest for long anyway.\n\nAnd to be clear, the amount of ads you’ll watch to earn even pennies’ worth of crypto is pretty overwhelming. You’ll face a full-screen video ad after nearly each completed level, and these typically last for a minute or more before you’re able to tap your way out of them. Given how short the levels are, that means you’ll spend about as much time playing as watching ads.\n\nAD\n\nAD\n\nIs that worth it to make about $0.10 per hour? Honestly, I’d rather spend my time playing a more engaging mobile puzzler without crypto rewards—like Threes or Grindstone, or my on-and-off guilty pleasure, Candy Crush Saga. But if you’re intent on “stacking sats” or eking out ETH while playing games, Ethereum Blast is a solid option."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3LmxlZGdlcmluc2lnaHRzLmNvbS9iYW5rLW9mLWNoaW5hLWludGwtYm9jaS10b2tlbml6ZWQtc2VjdXJpdHktZXRoZXJldW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Bank of China Investment issues tokenized security on Ethereum - Ledger Insights",
        "content": "Today UBS Hong Kong said that the Bank of China Investment (BOCI) has issued CNH 200 million ($28m) in digital structure notes on the Ethereum public blockchain. While the issuance was by the international investment subsidiary of the Bank of China, domestically, it is state-owned and China’s second largest bank.\n\nThe tokenized securities were issued under Hong Kong and Swiss Law on the UBS Tokenize service.\n\n“BOCI is very pleased to be at the forefront of innovation in technology finance and digital finance,” said Ms Ying Wang, Deputy CEO at BOCI. “Working together with UBS, we are driving the simplification of digital asset markets and products, for customers in Asia Pacific through the development of blockchain-based digital structured products, designed specifically for customers in Asia Pacific.”\n\n“We are encouraged by the evolution of Hong Kong’s digital economy and are committed to promoting the digital transformation and innovative development of Hong Kong’s financial industry.”\n\nLate last year, UBS Wealth Management announced it issued $50 million of blockchain-based debt securities to high net worth individuals (HNWI) based in Hong Kong and Singapore. In that case, it used English and Swiss law and a permissioned version of the Ethereum blockchain.\n\nUBS has been a blockchain trailblazer for some time. It was one of the initiators of the Utility Settlement Coin, which evolved into Fnality, the bank-backed settlement token project readying for launch in the UK.\n\nLast year, the bank also issued its own $370 million blockchain bond on the Swiss Digital Exchange (SDX). That was groundbreaking as the largest native digital security issued to date. Additionally, it was innovative because the central securities depository (CSD) of SDX was linked to the conventional SIX CSD allowing most investors to buy the tokenized securities conventionally."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3LnRoZXBsYWlkaG9yc2UuY29tLzIwMjMvMDYvMTMvc2hvdWxkLWktYnV5LWJpdGNvaW4tb3ItZXRoZXJldW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Should I Buy Bitcoin or Ethereum? - The Plaid Horse",
        "content": "Bitcoin and Ethereum are two of the most well-known cryptocurrencies in the market, each with its unique features and potential for growth. As the cryptocurrency market continues to expand, investors may wonder which digital asset is the better investment. In this article, we’ll compare Bitcoin and Ethereum by examining their advantages, risks, and personal considerations to help you make an informed decision and finally buy Ethereum with credit card without any stress.\n\n\n\nExplanation of Bitcoin and Ethereum\n\nBitcoin is the first and most well-known cryptocurrency, launched in 2009. It operates on a decentralized network and uses blockchain technology to facilitate transactions. Ethereum, launched in 2015, is a blockchain platform that enables developers to build and deploy decentralized applications (dApps) and smart contracts. Its native cryptocurrency, Ether (ETH), is used to power these applications and facilitate transactions within the network.\n\n\n\nBrief Overview of the Cryptocurrency Market\n\n\n\nThe cryptocurrency market has grown significantly in recent years, with thousands of digital assets available for investment. While Bitcoin and Ethereum are the most well-known, other cryptocurrencies offer unique features and potential for growth.\n\n\n\nAdvantages of Bitcoin\n\n\n\nBitcoin offers several advantages, including:\n\n\n\nEstablished and Widely Recognized\n\nAs the first cryptocurrency, Bitcoin has established itself as a recognizable brand and a dominant player in the market. Its widespread adoption and recognition can provide a level of stability and liquidity that can be attractive to investors.\n\n\n\nLarger Market Cap\n\nBitcoin has a larger market capitalization than Ethereum, making it a more established and stable investment option.\n\n\n\nLimited Supply\n\nBitcoin has a limited supply of 21 million coins, which can increase its value over time as demand grows.\n\n\n\nAdvantages of Ethereum\n\nEthereum offers several advantages, including:\n\n\n\nSmart Contract Functionality\n\nEthereum’s smart contract capabilities have led to a growing number of use cases, from decentralized finance (DeFi) to non-fungible tokens (NFTs). This functionality can drive innovation and increase the platform’s value over time.\n\n\n\nFaster Transaction Times\n\nEthereum’s transaction times are faster than Bitcoin’s, making it a more efficient option for transactions.\n\n\n\nGrowing Ecosystem of Decentralized Applications\n\nEthereum’s growing ecosystem of dApps and smart contracts can provide a level of versatility and potential for growth that can be attractive to investors.\n\nRisks and Concerns\n\n\n\nBoth Bitcoin and Ethereum come with risks and concerns, including:\n\n\n\nVolatility of the Cryptocurrency Market\n\nThe cryptocurrency market is known for its volatility, with prices often experiencing significant fluctuations. This volatility can lead to potential losses for investors who are not prepared to weather market downturns.\n\n\n\nRegulatory Uncertainty\n\nAs the cryptocurrency market continues to grow, it may face increased regulatory scrutiny from governments worldwide. Changes in regulations could impact Bitcoin’s and Ethereum’s value and their ability to operate in certain jurisdictions.\n\n\n\nSecurity Concerns\n\nCryptocurrencies are vulnerable to security breaches and hacks, which can lead to potential losses for investors.\n\n\n\nConclusion\n\n\n\nWhen deciding between Bitcoin and Ethereum, personal considerations should be taken into account. Consider your investment goals, risk tolerance, and market conditions to determine which digital asset aligns with your objectives. Ultimately, the decision to buy Bitcoin or Ethereum should be based on a thorough analysis of the advantages, risks, and personal considerations involved. Remember, investing in cryptocurrencies comes with risks, and it’s essential to conduct thorough research and consider multiple perspectives before making any investment decisions."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvZXRoZXJldW0tY2FuLXJlYWNoLTUwMDAwLWluLTIwMzAtbGV0cy1maW5kLW91dNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Can Reach $50000 in 2030? Let's Find Out - Watcher Guru",
        "content": "Ethereum (ETH) surpassing Bitcoin (BTC) as the largest crypto ecosystem, has been a major topic of debate over the past few years. The event is sometimes dubbed “the flippening.” However, regardless of ETH becoming the number one crypto, a report by VanEck said that the token could reach $50,000 in 2030. In the first six months of 2023, ETH has risen by around 45%, which is quite impressive. BTC, on the other hand, has increased by as much as 57%.\n\nVanEck’s valuation method is based on a number of fundamental components. The first part is Ethereum’s business model, which mainly depends on transaction fees. The second part is the ETH coin supply, which falls over time and supports the crypto’s price to increase. Additionally, the third part is what VanEck referred to as the “broad market capture strategy.” In essence, it means that Ethereum is currently involved in almost everything blockchain-related.\n\nCan Ethereum realistically reach $50k?\n\nETH is one of the most development-heavy blockchain projects in the industry. This is a fundamental metric for future growth. Although rival networks have appeared, none are as significant as ETH. Moreover, the recent pressure from regulators has greatly affected rival networks like Solana (SOL), Cardano (ADA), and Polygon (MATIC). All three were named by the U.S. SEC (Securities and Exchange Commission) in its suit against Coinbase. However, Ethereum (ETH) was said to not be a security. This keeps ETH at a fairly safe distance from the recent chaos.\n\nAdditionally, ETH has a lot of room to grow. The difference between the largest and second-largest crypto projects is massive, and the gap could be lessened in the future. Moreover, ETH has a lot more use cases than BTC. Therefore, it could see even greater adoption in the years to come. In fact, the “flippening” might very well happen within a few years. Therefore, VanEck’s forecast of ETH reaching $50k by 2030, seems very possible. At press time, ETH was trading at $1,745.50, down 0.5% in the last 24 hours."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vZmluYm9sZC5jb20vZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi1mb2xsb3dpbmctc2VjLXJ1bGluZy1jYW4taXQtd2l0aHN0YW5kLXRoZS1jcnlwdG8tY3Jhc2gv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction Following SEC Ruling - Can It Withstand the Crypto Crash? - Finbold - Finance in Bold",
        "content": "DISCLAIMER: This article is a SPONSORED Press Release and does not constitute Finbold's editorial content nor undergo monitoring. Crypto assets/products involve significant risks. Do not invest unless you are prepared to lose your entire investment. For a full disclaimer, please click here.\n\nThe cryptocurrency market remains prone to extreme bearishness after the SEC sued Binance and Coinbase for illegal operation and sale of unregistered securities, while also labelling a select number of major coins are securities.\n\nDespite Ethereum not being explicitly named in the lawsuit, it has received an enormous brunt of the negative outlook. The token has fallen over 6% in the past week as pre-FOMC fears also make matters worse.\n\nAs ETH and other major tokens struggle, Investors are already flocking to new tokens not targeted by the SEC that can offer better immediate prospects. Let’s take a look at Ethereum’s chances of recovering from the crash and which new tokens traders are backing to defy the bear market.\n\nEthereum Price Prediction Remains Bearish for June\n\nThe security versus commodity debate has now become the overarching narrative of the crypto market. In its lawsuit, the SEC labelled several major altcoins such as Cardano, Solana and MATIC as unregistered securities. These tokens plummeted by as much as 30% following the filing.\n\nOn the surface, the SEC’s lawsuit could have been beneficial for Ethereum. Both the Solana and Cardano communities have not shied away from calling themselves “Ethereum Killers”, and both blockchains are designed to replace Ethereum as the leading platform for smart contract technology. Thus, a bearish outlook for ADA and SOL could have been bullish for Ether.\n\nAs it turns out, Ethereum may soon find itself on the SEC’s target as well. SEC chairman Gary Gensler has said multiple times that Bitcoin is the only cryptocurrency that he is comfortable deeming a commodity. In a tense exchange with Representative Patrick McHenry during his congressional hearing, Gensler hesitated in clarifying whether ETH is a security or not.\n\nSeveral other key figures have taken a strong stance against Ether as well. New York Attorney General Letitia James sued KuCoin for offering the sale of ETH, which she labelled as an unregistered security.\n\nThe token may soon face a double whammy as the Federal Reserve is set to decide on a major interest rate hike next week. Several key officials including Fed chair Jerome Powell have taken an uncompromising stance in their fight against soaring inflation levels. If the Fed indeed proceeds with another interest rate hike, ETH prices could take another major hit.\n\nA recent report by CoinShares highlighted that Ethereum-based assets saw outflows totalling $36 million in just the last week. The report believes that most of the outflows are a result of the Fed’s unending hawkish monetary policy.\n\nThe Ethereum blockchain also needs significant improvements to ensure long-term user retention. In his blog, Ethereum founder Vitalik Buterin explained that the blockchain will simply die without three key transitions of scalability, privacy and wallet security. Buterin’s biggest fear is that with ETH transactions costing a lot of fees, users will simply move to other options like Solana and Cardano. While these blockchains are more centralised than Ethereum, they are also significantly faster.\n\nTradingView, a technical analysis platform, gives a sell signal to the token in the daily time frame. With ETH underperforming 12 of the 15 most important moving average indicators, its price prediction remains bearish for June.\n\nWhich Tokens are Outperforming the Beark Market?\n\nDespite the struggles of major tokens several new tokens are providing hope to traders.\n\nTwo of these include Wall Street Memes and Ecoterra, both of which are sailing through their respective presales.\n\nWall Street Memes Token Raises $6.5 Million in Bid to Be the Next Big Meme Coin\n\nThe Wall Street Memes token has become one of the hottest commodities in the meme coin market. Investors are losing confidence in tokens such as Pepe and Doge due to their inability to perform in the bear market. But the $WSM token has become one of the most consistent performers as it has raised over $6.5 million in less than 3 weeks.\n\nThe token is a result of the same community spirit that inspired the historic GameStop short squeeze in 2021. In fact, the Wall Street Memes group considers it its mission to disrupt the traditional financial landscape. The group also has a strong track record in the crypto space as well. It sold out its Wall St Bulls NFT collection in 32 minutes, netting a cool $2.5 million. It has also recently announced its own Bitcoin ordinal NFTs.\n\nThe group is not resting on its laurels as the Wall Street Memes token has adopted community-driven tokenomics. The entire $WSM supply is available to the general public, with no cuts for any private sales. 50% of the tokens are available during the presale itself, allowing ample opportunities for investors to take advantage of the early presale prices.\n\n30% of the token supply is reserved for cool community awards, to be used to further enhance user adoption. 5 lucky degens will earn $10K worth of $WSM tokens through a generous airdrop.\n\nA global brand value and a million-strong internet army mean that the $WSM tokens are quickly selling out. Investors have limited opportunity to purchase the token through bank cards or by swapping ETH or USDT tokens.\n\nVisit Wall Street Memes Presale\n\nNew Green Crypto Project Ecoterra Raises $5 Million in Fight Against Climate Change\n\nAs the concerns of global warming and climate change rise, investors are now clamouring for eco-friendly investment opportunities in the crypto space. The newly launched Ecoterra project is dominating this demand as it recently reached the $5 million milestone in presale.\n\nThe project has come up with an innovative implementation of blockchain technology and tokenomics to tackle the anthropogenic climate crisis. It incentivizes individuals and corporations to play their roles in reversing the harmful effects of global warming.\n\nFor example, companies spend millions of dollars to build an eco-friendly reputation. With Ecoterra, companies can simply purchase recycled products at a cheap cost and earn social credit. Similarly, individuals can earn $ECOTERRA tokens by recycling waste products or by paying their green energy bills through the platform.\n\nThe project has partnered with leading climate action organisation Verra to offer cost-effective carbon offset solutions. Users can reduce their carbon footprint by purchasing these offsets from Ecoterra’s carbon offsets marketplace.\n\nGiven the token’s strong presale and its crucial role in changing the mainstream perception of the crypto industry, it is a likely candidate for several Tier-1 exchange listings including Binance.\n\nInterested investors can become a part of this green movement by purchasing Ecterra tokens either through bank cards or by swapping ETH or USDT tokens.\n\nVisit Ecoterra Presale"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9hd3Mtd2VudC1kb3duLWJ1dC1ldGhlcmV1bS1zdGF5ZWQtdXDSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "AWS experienced outages in the US, but Ethereum kept humming - Cointelegraph",
        "content": "Amazon Web Services (AWS) suffered a minor outage, but there was no significant impact on Ethereum network nodes even though they largely rely on Amazon’s hosting.\n\nOn June 13, the cloud service provider went down temporarily for around three hours. At 12:08 pm PDT, the company first reported it was “investigating increased error rates and latencies” in parts of the United States.\n\nMany mainstream news organizations, such as the Associated Press, were affected and unable to publish articles. Ethereum advocate Evan Van Ness observed the outage noting that the Ethereum network was not affected.\n\nAWS is down\n\n\n\nEthereum is humming along unaffected\n\n\n\nBitcoin maxis hardest hit pic.twitter.com/9YGBXRC4CL — Evan Van Ness (@evan_van_ness) June 13, 2023\n\nAccording to Ethernodes, 64.5% of the Ethereum network is reliant on Amazon hosting providers and only a small fraction may have been affected due to the regional nature of the outage. Such high reliance on AWS is a worrying sign for the decentralization of the network and a much wider disruption would have resulted in a shock for the Ethereum network.\n\nDistribution of Ethereum nodes from web service providers. Source: Ethernodes\n\nVan Ness added the impact may have been more significant if the outage was in Europe due to the amount of Ether (ETH) staked on Lido, which is currently around 7.1 million or 35% of the total:\n\n“I imagine there would be some effect if AWS went down in Europe given how much of Lido is in the cloud.”\n\nEthereum has previously been criticized for centralization due to its reliance on infrastructure provider Infura, which provides network nodes to companies and organizations. Many of these companies, and liquid staking platform Lido, rely heavily on AWS for cloud hosting services.\n\nRelated: 3 cloud providers accounting for over two-thirds of Ethereum nodes\n\nAround 20 minutes after the discovery of the problem, AWS said that the root cause of the issue was connected to a service called AWS Lambda, which lets customers run code for different types of applications.\n\nOver three hours after AWS went down the company reported that “the issue has been resolved and all AWS Services are operating normally,” at 3.37 PM PDT.\n\nAccording to the hosting platform Kinsta, AWS has the dominant market share among cloud hosting providers, at 34%.\n\nMagazine: Joe Lubin: The truth about ETH founders split and ‘Crypto Google’"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvcmlwcGxlL3hycC1zZWMtY2FzZS1jb3VsZC1iZS1hLWJvb24tZm9yLWV0aGVyZXVtLWhlcmVzLXdoeS_SAVxodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL3JpcHBsZS94cnAtc2VjLWNhc2UtY291bGQtYmUtYS1ib29uLWZvci1ldGhlcmV1bS1oZXJlcy13aHkvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "XRP SEC Case Could Be A Boon For Ethereum, Here’s Why - NewsBTC",
        "content": "Ethereum (ETH) has experienced a sharp decline since Saturday, dropping from the $1,838 line down to the current level of $1,738 while XRP traded sideways. This has caused concern among investors and traders in the Ethereum market.\n\nHowever, experts and analysts believe the recent disclosure of the Hinman documents on June 13th could mark a relief wave for Ethereum’s price.\n\nThe Hinman documents refer to a series of emails and memos from the former director of the Securities and Exchange Commission’s (SEC) Division of Corporation Finance, William Hinman, recently released to the public.\n\nThe Hinman documents include a series of emails and memos from the former director of the SEC, who declared in 2018 that Ethereum’s native token, Ether, is not a security.\n\nEthereum Traders Should Keep An Eye On The XRP Case\n\nRecently, the release of emails from former SEC official William Hinman regarding Ethereum has caused a stir in the cryptocurrency community. While some have claimed that the documents are a smoking gun for the cryptocurrency, others have downplayed their significance.\n\nHowever, analyst Adam Cochran has argued that the documents are a nuance that puts current SEC Chairman Gary Gensler in a corner.\n\nThe Hinman speech attempted to clarify the SEC’s position on digital assets, such as ETH and XRP, and their relation to security regulations. In his speech, Hinman went beyond the scope of the Howey test and attempted to understand the nuanced intent of users vs. investors. He also questioned the concept of morphing, or whether something can be a security and then later not a security.\n\nThe feedback comment from SEC staff specifically noted to him that they wanted to pivot to the discussion of “what is a security” rather than the idea of morphing. And that their concerns came from implication differences between the Securities Act and the Exchange Act.\n\nHinman specifically drew attention to the idea that “promoters” have a very specific legal analysis point – and that even a coordinated group of actors working on something wouldn’t rise to the level of being deemed the promoter if their efforts weren’t essential.\n\nThe draft on Ethereum, which came after meeting with Vitalik Buterin, Ethereum founder, and his lawyers, noted that Ethereum was not at such time a security and that secondary sales didn’t raise Securities Act concerns – only Exchange Act and Commodities Act concerns.\n\nAccording to Cochran, that footnote is of incredible importance as it notes that the SEC internally viewed secondary sales not as sales of the promoter at the time.\n\nFurthermore, Cochran believes the documents are damning for Gensler’s position because they acknowledge the idea of ‘reverse-morphing’ of an asset becoming a security. Suppose the SEC wanted to argue that Ethereum is a security today. In that case, they must acknowledge the idea of ‘morphing’, prove the burden of a promoter being liable for all secondary sales of an asset ever, and break every precedent of horizontal and vertical commonality.\n\nCochran further claimed:\n\nFor Gary to conclude that proof-of-stake Ethereum is a security, he would both need to fight a landslide of precedent on the most litigated part of Howey analysis – and admit to the idea that securities status can change over time with decentralization.\n\nOverall, many market analysts believe that disclosing the Hinman documents could boost Ethereum’s price in the short term. This is because it removes some of the regulatory uncertainty surrounding Ethereum and could increase investor confidence in the cryptocurrency.\n\nFeatured image from Unsplash, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDYvMTQvZGlzdHJpYnV0ZWQtdmFsaWRhdG9yLXRlY2hub2xvZ3ktbWFya3MtbGFzdC1rZXktbWlsZXN0b25lLWluLWV0aGVyZXVtcy1jdXJyZW50LWVyYS_SAYABaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wNi8xNC9kaXN0cmlidXRlZC12YWxpZGF0b3ItdGVjaG5vbG9neS1tYXJrcy1sYXN0LWtleS1taWxlc3RvbmUtaW4tZXRoZXJldW1zLWN1cnJlbnQtZXJhL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "‘Distributed Validator Technology’ Marks Last Key Milestone in Ethereum’s Current Era - CoinDesk",
        "content": "With more clients and node operators in different geographical areas running a single validator, even if several node operators experience downtime as a result of a malicious actor or a bug in the codebase, the entire validator wouldn’t go down since a significant portion of the network is using distributed validator technology."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2VpZ2VubGF5ZXItZGVwbG95cy1vbi1ldGhlcmV1bS1tYWlubmV00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "EigenLayer deploys restaking protocol on Ethereum mainnet - Blockworks",
        "content": "Ethereum restaking protocol EigenLayer has launched on Ethereum mainnet.\n\nThe launch supports tokens including stETH, rETH, cbETH and solo-stakers.\n\nEigenLayer is designed to extend Ethereum security to software modules such as bridges, oracle networks and consensus mechanisms by utilizing restaking to offer pooled security mechanisms. They’re built on top of the network.\n\nThe EigenLayer protocol consists of stakers, who commit stake, and operators, who provide technical validation services for actively validated services (AVSs), Brianna Montgomery, head of strategy at Eigen Labs, told Blockworks.\n\nSeveral AVSs are building on EigenLayer, and a handful have publicly pointed to their plans, Montgomery said.\n\nKnown AVSs include EigenDA, Espresso, Witness Chain, Omni and Lagrange.\n\n“Others are building in private,” Montgomery said. “More details about projects building on EigenLayer will be shared as and when available.”\n\nHow does EigenLayer work?\n\nStakers can give permission to EigenLayer smart contracts, subjecting their staked ether to slashing conditions — and granting the opportunity to validate different software modules on top of the layer-1.\n\nThe design is such that additional rewards are meanwhile earned, and stakers can also delegate the validation to an operator of their choice.\n\n“In both scenarios, the Restaker retains the agency over their stake and chooses which AVSs they opt-in to validate for,” Montgomery said.\n\nTo ensure honest operators opting in do not face slashing, Montgomery said a handful of checks and balances have been baked in.\n\n“For instance, we encourage AVSs deployed on EigenLayer to only have objectively attributable faults…Additionally, to prevent unintentional slashing caused by software bugs in the slashing contracts, there is a veto committee consisting of reputable members from the ecosystem,” she said.\n\nAdded Montgomery: “Any AVS smart contract seeking to slash a validator must submit its request to the veto committee, who can veto or approve it based on the legitimacy of the request.”\n\nInitial mainnet launch\n\nThe initial mainnet launch will only include restaking, with operators and validators being part of a second launch iteration in the works. Native staking will also be available in the initial launch.\n\nUsage limits of 3,200 of each asset, with a maximum of 32 token deposits for each unique user address will be set in the interest of protocol security, EigenLayer said in a statement.\n\nThis means there will be a cap of 9,600 liquid staking tokens, coupled with a minimum of 300 unique deposits, able to participate across the three liquid staking tokens available at mainnet.\n\nUsage limits will be evaluated and raised over the coming weeks, with the goal of eventually being completely uncapped.\n\nNative restaking will also be available through the creation of EigenPods — a smart contract that facilitates staking of the Beacon Chain layer, where stakers must direct their validator withdrawal credentials.\n\nAlthough there are no restrictions on the number of validators that can link to EigenPods being placed, EigenPods will stop being created once native restaking reaches 9,600 ETH.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDYvMTQvcDJwb3Jncy1ldGhlcmV1bS1zdGFraW5nLWFwcGxpY2F0aW9uLWlzLW5vdy1hdmFpbGFibGUtb24tcG9wdWxhci13YWxsZXQtcHJvdmlkZXItc2FmZS_SAYMBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wNi8xNC9wMnBvcmdzLWV0aGVyZXVtLXN0YWtpbmctYXBwbGljYXRpb24taXMtbm93LWF2YWlsYWJsZS1vbi1wb3B1bGFyLXdhbGxldC1wcm92aWRlci1zYWZlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "P2P.org’s Ethereum Staking Application Is Now Available on Popular Wallet Provider Safe - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDYvMTQvdGhlLWdyYXBoLXN0YXJ0cy1taWdyYXRpbmctaXRzLXNldHRsZW1lbnQtbGF5ZXItdG8tYXJiaXRydW0tZnJvbS1ldGhlcmV1bS_SAXdodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA2LzE0L3RoZS1ncmFwaC1zdGFydHMtbWlncmF0aW5nLWl0cy1zZXR0bGVtZW50LWxheWVyLXRvLWFyYml0cnVtLWZyb20tZXRoZXJldW0vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "The Graph Migrates its Settlement Layer to Arbitrum from Ethereum - CoinDesk",
        "content": "With the migration, The Graph becomes one of the largest Ethereum apps to transition to a layer 2 rollup – a move that one of The Graph developers Edge & Node say will decrease barriers of entry for The Graph’s participants without compromising on security."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wNi8xMy9oaW5tYW4tZW1haWxzLXJldmVhbC0yMDE4LXNwZWVjaC1vbi1ldGhlci1kcmV3LWlucHV0LWZyb20tbXVsdGlwbGUtc2VjLW9mZmljaWFscy_SAYABaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3BvbGljeS8yMDIzLzA2LzEzL2hpbm1hbi1lbWFpbHMtcmV2ZWFsLTIwMTgtc3BlZWNoLW9uLWV0aGVyLWRyZXctaW5wdXQtZnJvbS1tdWx0aXBsZS1zZWMtb2ZmaWNpYWxzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Hinman Emails Reveal 2018 Speech on Ether Drew Input From Multiple SEC Officials - CoinDesk",
        "content": "“As written, the language remains vague as to whether ETH is a security. If you want to make an affirmative statement that it is not a security, the language could be stronger (i.e., just say it). If you don't want to take an affirmative stance, we suggest using language similar to what you used for Bitcoin re. the disclosure regime to make it more consistent,” wrote former SEC Director of Trading and Markets Brett Redfearn on June 12, 2018."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tYXMtZXRoLXNpdHMtb24tMTcwMC1zdXBwb3J0LWhvdy10by1zdGF5LXByb2ZpdGFibGUtdGhpcy13ZWVrL9IBcGh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tYXMtZXRoLXNpdHMtb24tMTcwMC1zdXBwb3J0LWhvdy10by1zdGF5LXByb2ZpdGFibGUtdGhpcy13ZWVrL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Will Ethereum Price Retest $1,700 Support? Will US FOMC Meeting Trigger ETH Rally Today? - CoinGape",
        "content": "Ethereum price knee-jerk reaction to Tuesday’s better-than-expected Consumer Price Index (CPI) data was not strong enough to weaken the seller congestion at $1,800. However, ETH’s brief rebound touched highs of $1,760 followed by a minor but sharp dip which confirmed the viability of support at $1,730.\n\nThe token powering the largest smart contracts ecosystem is currently trading at $1,738 while bulls battle a seemingly strengthening bearish grip.\n\nadvertisement\n\nWith support at $1,700 staying intact coupled with building optimism ahead of the United States Federal Open Market Committee (FOMC) meeting later on Wednesday, Ethereum price could embark on an upward trajectory targeting $1,800 and $2,000 price points, respectively.\n\nCan US Fed Rate Decision Trigger Ethereum Price Rally?\n\nAccording to this analysis of Bitcoin Price, investor confidence received a boost following the release of the CPI report, which revealed a year-on-year inflation deceleration to 4.9% in April, modestly undercutting the predictions made by market watchers interviewed by Dow Jones survey.\n\nLater today, the FOMC meeting will decide whether to pause interest rate hikes, which have been maintained since Q1 2022. There is a higher probability of a pause following earlier communication by the Fed. About 76% of market participants, according to CoinDesk, believe the regulator will discontinue the historic interest rate hikes.\n\n“Inflation is coming down, just as the Fed intended, and that’s easing fears about the economy’s future,” Callie Cox, an analyst trading firm eToro told CNBC. “Lower inflation also supports the case for the end of rate hikes, and higher rates are what started the crypto winter over a year ago.”\n\nAs the Fed ponders ending rate hikes, optimism is expected to build among investors. Risky asset classes like Bitcoin and Ethereum are expected to benefit the most from the “easing of tight liquidity conditions,” Cox added.\n\nEthereum Price Settles For Consolidation\n\nEthereum price has been stuck between a rock and a hard place since the SEC-triggered sell-off last week. On the downside, support at $1,730 appears robust enough to keep bears in check.\n\nHowever, it has become a daunting task for bulls to deal with resistance at $1,760. If the buy signal from the Moving Average Convergence Divergence (MACD) indicator stays put on the four-hour timeframe chart, the probability for a breakout above $1,800 would remain high.\n\nRemember, bulls are at a disadvantage now that ETH is trading below all the major applied moving averages, including the 200-day EMA (purple), the 100-day EMA (blue), and the 50-day EMA (red).\n\nIf push comes to shove and declines extend below $1,730, investors can start acclimatizing to increased overhead pressure and subsequent losses to $1,700 and $1,600, respectively.\n\nEthereum On-chain Activity Steadies\n\nIntriguingly, some key on-chain metrics have remained steady despite last week’s capitulation. Having achieved a record peak in May, the momentum of staking activities within the Ethereum network has extended its upward trajectory into June 2023.\n\nGlassnode’s ‘Supply in Smart Contracts’ metric offers insights into staking dynamics by gauging the share of the overall circulating ETH currently committed to various protocols.\n\nIn the period spanning from June 1 to June 12, cryptocurrency enthusiasts have further committed an additional 360,000 ETH to the Ethereum Beacon chain and DeFi smart contracts.\n\nThe spike in Ether held in staking contracts shrinks available supply on exchanges, thus reducing selling pressure. If this fundamental factor holds, Ethereum price may ignite an uptrend in the short term.\n\nRelated Articles"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3NlYy1oaW5tYW4tZXRoLW5vdC1zZWN1cml0edIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "SEC officials pushed Hinman to clarify ETH wasn't a security: Court docs - Blockworks",
        "content": "The SEC released hundreds of documents, including emails and notes, after a judge ordered the documents to be unsealed as part of the ongoing legal battle between Ripple and the securities regulator.\n\nThe highly-anticipated documents related to a June 2018 speech from former SEC Division Director William Hinman were released on Tuesday, June 13.\n\nThe documents show how Hinman’s speech — which clarified that the SEC didn’t believe that ether was a security at the time — evolved prior to the SEC targeting XRP as a security.\n\nIn his speech, Hinman said, “And putting aside the fundraising that accompanied the creation of Ether, based on my understanding of the present state of ether, the Ethereum network and its decentralized structure, current offers and sales of ether are not securities transactions.”\n\nThe released documents show conversations between SEC employees at the time — including the trading and markets department’s comments — and Hinman.\n\nIn an email, Hinman said the language around ether “would be used if we all are in agreement. We also have a call with [Vitalik] Buterin later this week to confirm our understanding of how the Ethereum Foundation operates.”\n\nBrett Redfearn, the director of trading and markets at the time, told Hinman via email his original language on ETH and whether it was a security remained “vague.” Redfearn suggested that Hinman use “stronger” language.\n\nGoogle Document comments show an unnamed editor saying, “As we discussed, as written, referring to the sentiment within this section of the speech. We think the relevant question as discussed throughout the rest of the speech is whether a digital asset meets the legal standards of a security, not whether it warrants regulation as a security.”\n\nThe comments also show the SEC saying that “we do not want to suggest that BTC is a security.”\n\nAn additional comment left on the document says:\n\n“We thought you were going to say that you don’t believe ETH is a security. We think that is a helpful message. This statement, on the other hand, appears likely to create more confusion about the status of ETH. To the extent you don’t say ETH is not a security, please consider confirming the policy rationale to the disclosure regime of the federal securities laws, as you did with respect to Bitcoin earlier in the paragraph.”\n\nEmployees also noted that they had “reservations” about including a direct statement on ether in the speech because “it seems that it would be difficult for the agency to take a different position on ether in the future. Further, the rest of the paragraph strongly implies the thinking applies to ether.”\n\n“Without the sentence about ether, those implications might generate a useful reaction about ether (from purchasers or those in the FinTech space). With the sentence, the reaction seems less likely to focus on the analysis, and more likely to focus on the potential fallout of making a direct statement about ether’s status as a security.”\n\nIn another comment, SEC officials acknowledged that “the fact that tokens on a sufficiently decentralized network are no longer securities — and no longer are required to register with all the benefits to investors of registration — seems to point out what might be considered a “regulatory gap” that exists in this space.”\n\n“In other words, this speech acknowledges that there is an “other” category,” the comments said. “It’s not a security because there’s no “controlling group” (at least in the Howey sense) yet, like many other things (medication, credit cards) there may be a need for regulation to protect purchasers.”\n\nKnown conflicts of interest\n\nA first batch of emails between Hinman and Shira Pavis Minton, the designated agency ethics official at the SEC, was released in April 2022 after Empower Oversight, a nonprofit whistleblower organization, successfully filed a Freedom of Information Act request.\n\nMinton warned Hinman that he is not to engage in any SEC matters that could impact law firm Simpson Thacher, where he worked before the SEC, due to his financial interest in the firm. He was also advised not to meet with anyone from Simpson Thacher.\n\nHinman met with Josh Bonnie, a partner at Simpson Thacher, several times after being warned about the conflict of interest, Empower Oversight said in an April 2022 statement. The former SEC director also met with the co-founders of and investors in Ethereum ahead of the speech he gave in 2018 declaring ether a token, not a security.\n\nThe April 2022 email release suggested that Hinman and the SEC had an interest in promoting and protecting ether over other, similar tokens. If this were found to be true, it would be a significant win for Ripple.\n\nShortly after these documents revealed the agency may have acted inconsistently with their classification of crypto tokens, a judge ruled that the SEC would not be able to edit or clarify any of the content in the emails ahead of the XRP case, which had already been underway for over a year when the first round of emails dropped.\n\nThe SEC and Ripple are awaiting a summary judgment, which Ripple’s legal team previously said could come before the end of the year. There is a possibility that the judge could rule that there is not sufficient evidence for a summary judgment and the case could go to trial, or Ripple and the SEC could potentially agree on a settlement, although Ripple has said this is an unlikely outcome.\n\nNews analysis by David Canellis\n\nOutside of an outright win against the SEC, the release of the Hinman emails is the Superbowl for XRP investors.\n\nA word of caution, especially as markets push XRP nearly 10% higher: The Hinman speech never explicitly mentioned Ripple — or any other cryptocurrency apart from bitcoin and ether, for that matter.\n\nIn a bid to defend itself from an antagonistic regulator, Ripple Labs has attempted to draw parallels between Ethereum and its XRP technology, token sales and promotional efforts. To borrow Hinman’s phrasing, if Ethereum can become “sufficiently decentralized” over time — then maybe so too can XRP transform from a security into a commodity.\n\nSuch an evolution would certainly undermine the SEC’s case. Perhaps converting to a slap on the wrist akin to Block.one’s $22 million settlement, after it raised up to $4.4 billion with its own token sale.\n\nBut the XRP Ledger is a different beast than Ethereum — far lower in terms of validator counts and use cases, but with a more direct line to corporate support in the form of Ripple Labs.\n\nIt may be tempting to believe Hinman’s treatment of Ethereum is analogous to XRP, vindicating the latter by association.\n\nBut to do so would run the risk of underestimating key differences between major blockchain technologies, at a time when regulator pettiness is at an all-time high. How the courts will ultimately navigate that is still anyone’s guess, and these emails could simply bolster the case for ether’s commodity classification, with XRP’s relevance merely tangential.\n\nThe end of the Ripple v. SEC case may well be in sight, but consider the final outcome as hazy as the SEC’s definition of “crypto security.”\n\nUpdated June 13, 2023 at 11:22 am ET: Additional quotes added from the court documents.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9saWRvLXJpc2stdG8tZXRoZXJldW0tZ3Jvd3MtYXMtc2VjLXRhcmdldHMtZXhjaGFuZ2Utc3Rha2luZy1zZXJ2aWNlcy_SAWJodHRwczovL2NyeXB0b3BvdGF0by5jb20vbGlkby1yaXNrLXRvLWV0aGVyZXVtLWdyb3dzLWFzLXNlYy10YXJnZXRzLWV4Y2hhbmdlLXN0YWtpbmctc2VydmljZXMvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Lido Risk to Ethereum Grows as SEC Targets Exchange Staking Services - CryptoPotato",
        "content": "The U.S. Securities and Exchange Commission is convinced that all crypto assets aside from Bitcoin are securities. Its latest war on crypto exchanges has included staking services, which the regulator seeks to shut down.\n\nThis could push more staked ETH out of exchanges and onto the market-leading liquid staking provider Lido. This may sound good, but it poses significant risks to the Ethereum ecosystem.\n\nLido Staking Risks Exposed\n\nLido provides liquid staking services for Ethereum as an alternative to self-staking, which is highly technical, and involves exchanges that take substantial commissions.\n\nIt has rapidly become the market leader with 7.18 million staked ETH, or 36% of the total 19.6 million staked.\n\nOn June 13, Ethereum advocates at ‘Bankless’ sounded the alarm on Lido, calling for the prevention of its domination of ETH staking.\n\nA continued SEC crackdown on exchanges is likely to push more staked Ethereum to Lido, it noted. There was already a surge in staked ETH redemptions from Coinbase last week after the lawsuit by the regulator.\n\nKraken was forced to end its Ethereum staking services for U.S. users in February, resulting in an exodus as soon as Shapella rolled out.\n\nFurthermore, Lido’s market share has grown since the Shapella upgrade enabled staking withdrawals.\n\nEthereum developers such as Danny Ryan have warned about the dangers of staking “cartelization,” in which platforms such as Lido can extract outsized profits compared to non-pooled capital.\n\nBankless reported that the platform was near the first threshold with around a third of all staked ETH.\n\n“Lido is nearing the first of three thresholds at which Ethereum is more easily manipulated by an attacker.”\n\nIt added that Lido has already voted against self-limiting deposits, but Ethereum advocates are now calling for them to do so.\n\n“It’s unlikely Ethereum will implement such controls at the protocol level, but it is clear Lido must face economic repercussions,” Bankless noted.\n\nThere is a growing movement to divest from Lido and explore alternative Ethereum staking options.\n\n“Etherians must band together and decrease our reliance on Lido to prevent its domination over staking!”\n\nETH Price Outlook\n\nEthereum staking deposits are still outpacing withdrawals, however, asset prices have taken a hit following last week’s regulatory attacks on the industry.\n\nETH was trading flat on the day at $1,745 at the time of writing, according to CoinGecko. The asset has lost more than 8% since the SEC sued Binance and Coinbase last week, more than its big brother Bitcoin.\n\nAdditionally, it is looking increasingly bearish, having fallen to the lower boundary of its three-month-long range-bound channel."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1yZWNvdmVyeS0xNzgwL9IBRmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1yZWNvdmVyeS0xNzgwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Price Breaking This Confluence Resistance Could Start Recovery - NewsBTC",
        "content": "Ethereum price is finding bids above the $1,720 zone against the US Dollar. ETH could start a decent recovery if there is a move above the $1,770 resistance.\n\nEthereum is struggling below the $1,770 and $1,780 resistance levels.\n\nThe price is trading below $1,770 and the 100-hourly Simple Moving Average.\n\nThere was a break above a short-term contracting triangle with resistance near $1,740 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could recover if there is a move above the $1,770 and $1,780 levels.\n\nEthereum Price Holds Support\n\nEthereum’s price remained well-bid above the $1,720 support zone. ETH seems to be forming a base above the $1,720 level, similar to Bitcoin. A low is formed near $1,718 and the price is slowly moving higher.\n\nThere was a move above the $1,740 level. Besides, there was a break above a short-term contracting triangle with resistance near $1,740 on the hourly chart of ETH/USD. The pair is now struggling to settle above the 23.6% Fib retracement level of the key decline from the $1,855 swing high to the $1,718 low.\n\nEther is still trading below $1,770 and the 100-hourly Simple Moving Average. Immediate resistance is near the $1,760 zone and the 100-hourly Simple Moving Average. The next major resistance is near the $1,770 level. The first major resistance is near $1,780 or the 50% Fib retracement level of the key decline from the $1,855 swing high to the $1,718 low.\n\nSource: ETHUSD on TradingView.com\n\nA proper move above the $1,770 and $1,780 resistance levels might send Ether toward $1,850. The next resistance sits near $1,880, above which Ethereum could rise toward the $1,920 level. Any more gains above the $1,920 resistance zone might send the price toward the $2,040 resistance.\n\nFresh Decline in ETH?\n\nIf Ethereum fails to clear the $1,780 resistance, it could start another decline. Initial support on the downside is near the $1,730 level and the triangle trend line.\n\nThe next major support is near the $1,720 level. If there is a break and close below the $1,720 support, the price could start a major decline toward the $1,640 support. Any more losses may perhaps send the price toward the $1,600 zone.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 level.\n\nMajor Support Level – $1,720\n\nMajor Resistance Level – $1,780\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMikQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNi8xNC9jcnlwdG8tYW5hbHlzdC1kZXRhaWxzLXBvdGVudGlhbC1yZXZlcnNhbC1sZXZlbHMtZm9yLWV0aGVyZXVtLWJpbmFuY2UtY29pbi1hbmQtbGl0ZWNvaW4tYW1pZC1hbHRjb2luLWNvcnJlY3Rpb24v0gGVAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA2LzE0L2NyeXB0by1hbmFseXN0LWRldGFpbHMtcG90ZW50aWFsLXJldmVyc2FsLWxldmVscy1mb3ItZXRoZXJldW0tYmluYW5jZS1jb2luLWFuZC1saXRlY29pbi1hbWlkLWFsdGNvaW4tY29ycmVjdGlvbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Crypto Analyst Details Potential Reversal Levels for Ethereum, Binance Coin and Litecoin Amid Altcoin Correction - The Daily Hodl",
        "content": "A closely followed analyst is outlining key price levels where he believes crypto bulls would step in and ignite trend reversals for Ethereum (ETH), Binance Coin (BNB) and Litecoin (LTC).\n\nIn a new video update, analyst Michaël van de Poppe tells his 163,000 YouTube subscribers that Ethereum is at risk of further downside unless it can reclaim support at $1,785.\n\n“This entire area of $1,785 is something we need to sustain. Otherwise, we are going to look at a case that I think we are going to retest the area around $1,600 and have the reversal taking place.”\n\nAt time of writing, ETH is trading for $1,751. A move toward Van de Poppe’s reversal area suggests an over 8% decline for leading altcoin.\n\nLooking at Binance Coin, the utility token of the world’s largest crypto exchange, Van de Poppe says that BNB’s failure to stay above support at around $270 suggests that the altcoin is likely en route toward $200, where it could potentially reverse.\n\n“We need to reclaim the area of [$270] in order to prevent a market breakdown. We did have this market breakdown, and now we’re looking at potentially taking this liquidity beneath the low here for Binance Coin before we are most likely going to reverse. So I’m looking at bids in this range ($200) if we’re going to get that.”\n\nAt time of writing, BNB is worth $237.\n\nAs for the peer-to-peer payments network Litecoin, Van de Poppe says that LTC may be close to ending its correction.\n\n“I think if we are going to have a reversal taking place, this is the range that we’re looking at, perhaps towards $70 to $73. If that is going to be the case, then I think we’re going to have a swift rally back up.”\n\nAt time of writing, LTC is trading for $78.78.\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLXByaWNlLWZsYXNoZXMtc3Ryb25nLWJ1eS1zaWduYWwtc2VjLWNoYWlyLWdhcnktZ2Vuc2xlci1zYXlzLWJ0Yy1hbmQtZXRoLW5vdC1zZWN1cml0aWVzL9IBeWh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLXByaWNlLWZsYXNoZXMtc3Ryb25nLWJ1eS1zaWduYWwtc2VjLWNoYWlyLWdhcnktZ2Vuc2xlci1zYXlzLWJ0Yy1hbmQtZXRoLW5vdC1zZWN1cml0aWVzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction: Are $ETH And $BTC Securities? Here’s Trading Plan For ETH Price This Week - CoinGape",
        "content": "At the time of writing, Ethereum price is trading at $1,751 with support at $1,730 holding firmly. In a video shared widely across social media, the Securities and Exchange Commission Chair, Gary Gensler says that the two most prominent cryptocurrencies, Ethereum (ETH) and Bitcoin (BTC) are not securities.\n\nEvaluating Ethereum Price Profitability This Week\n\nEthereum, like many of its peers, started the week while consolidating losses after a gruesome week in the wake of the intensified crackdown on the crypto market by the US SEC. As Coinbase, Binance, and the foundations of selected cryptos like ADA, SOL, and MATIC start their respective legal battles, investors may want to know how to adjust their crypto portfolios.\n\nadvertisement\n\nHowever, Ethereum price must first deal with resistance at $1,760 to close the gap to $1,800. On the bright side, the Moving Average Convergence Divergence (MACD) indicator dons a vivid buy signal.\n\nTraders eyeing new long positions in Ethereum price would be encouraged to activate their orders as long as the MACD line in blue holds above the signal line in red.\n\nInsights from the on-chain analytics platform Santiment suggest that the crypto market could start to rise, now that the dust lifted by the SEC going after Binance and Coinbase has settled. The rebound is expected to continue “until the next development with the lawsuits.\n\n👨‍⚖️ With traders still very much aware of the #SEC going after #Binance and #Coinbase, the mass hysteria has at least settled down. Until the next developments with the lawsuits, we could see some gradual rising of prices back to pre-crash levels. https://t.co/Za7tchgeUx pic.twitter.com/BSZEHrjQNP — Santiment (@santimentfeed) June 12, 2023\n\nMoreover, most altcoins experienced extreme capitulation last week, leaving many traders and investors in losses. The sharp price drop will likely trigger increased accumulation among whales. If this accumulation trend continues, “there is reason to believe a strong rebound can occur,” Santiment states.\n\nOld Video Shows Gary Gensler Declare, $BTC And $ETH Are Not Securities\n\nAccording to a related report by Cointelegraph, back then, Gary Gensler held a faculty position at the esteemed Massachusetts Institute of Technology (MIT). The footage dates back nearly two years prior to his eventual ascension to the Chair of the Securities and Exchange Commission (SEC).\n\nIn a stark juxtaposition to his previous stance, Gensler’s subsequent actions at the SEC paint a different picture. The recent months have witnessed the regulatory body plunge into a wave of enforcement initiatives within the cryptosphere.\n\nLast week, Gensler listed 68 cryptos as securities, including Cardano (ADA), Solana (SOL), and Polygon (MATIC) in the most recent lawsuits. Moreover, the regulatory chair once declared that all cryptocurrencies apart from Bitcoin are securities, which contradicts his statement in the 2018 video.\n\nChair Gensler in 2018 at a Bloomberg conference in NYC: “Bitcoin. Ether. Litecoin. Bitcoin Cash. Why did I name those four? They’re not securities.” What’s Goldman Gary going to say about this one? Deep fake? pic.twitter.com/p7DJlYkJIt — Ryan Selkis 🪳 (@twobitidiot) June 12, 2023\n\nRelated Articles:"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS90ZXRoZXItY29udmVydHMtNzUwbS11c2R0LWZyb20tdHJvbi10by1ldGhlcmV1bS_SAU1odHRwczovL2NyeXB0b3BvdGF0by5jb20vdGV0aGVyLWNvbnZlcnRzLTc1MG0tdXNkdC1mcm9tLXRyb24tdG8tZXRoZXJldW0vP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Tether Converts 750M USDT From Tron to Ethereum - CryptoPotato",
        "content": "Tether announced it will coordinate with a third-party exchange to conduct a chain swap as it wants to convert 750 million USDT from Tron to Ethereum ERC20. The total supply of USDT will not change during this process, as per the firm.\n\nA chain swap process entails moving cryptocurrencies from one blockchain to another, which enables traders to obtain access to the various blockchains that support the cryptocurrency they are holding. In general, it allows the use of their digital assets on these other supporting blockchains.\n\n1B USDT Mint on Ethereum\n\nThe development follows Tether minting a fresh batch of $1 billion worth of its USDT on the Ethereum blockchain on Monday. Tether’s chief technology officer Paolo Ardoino explained on Twitter that the latest billion-dollar mint is part of the company’s inventory replenishment on the Ethereum Network. The transaction is authorized but “not issued,” meaning that this amount will be used as inventory for the next period of issuance requests and chain swaps.\n\nTether previously explained,\n\n“Inventory replenishment is the process of creating new USD₮ that are stored in Tether’s treasury inventory as “authorized but not issued” USD₮. These tokens are not part of the total market capitalization of USD₮, as they have not been issued or released into circulation yet.”\n\nUSDT has positioned itself as a crucial piece of infrastructure of the crypto ecosystem and is widely used for conducting trading on cryptocurrency exchanges. Its issuer, on the other hand, has been at the receiving end of endless scrutiny over its reserve assets and lack of transparency for years.\n\nBut this year’s banking sector debacle, as well as the increasing crackdown on the asset class, has resulted in investors fleeing to USDT, thereby significantly boosting its dominance.\n\nTether’s Growing Dominance\n\nUSDT’s circulation hit a peak above $83 billion this week. One of the major factors that have catalyzed the surge is the latest price deviation of rival dollar-denominated stablecoin TrueUSD (TUSD).\n\nThe shrinking investor confidence in fellow Circle-issued USDC stablecoin is yet another reason that has led to market participants fleeing to the world’s largest stablecoin, USDT.\n\nLast month, Tether announced expanding its footprint in Georgia with an investment in a payment processing company called, CityPay.io. The company also revealed plans to launch sustainable Bitcoin mining operations in Uruguay."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vdS50b2RheS9hcmJpdHJ1bS1hcmItYWlyZHJvcC1oYXMtc3VycHJpc2luZy1lZmZlY3RzLW9uLWRvbWluYW50LWV0aGVyZXVtLWV0aC1sMtIBW2h0dHBzOi8vdS50b2RheS9hcmJpdHJ1bS1hcmItYWlyZHJvcC1oYXMtc3VycHJpc2luZy1lZmZlY3RzLW9uLWRvbWluYW50LWV0aGVyZXVtLWV0aC1sMj9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Arbitrum (ARB) Airdrop Has Surprising Effects on Dominant Ethereum (ETH) L2 - U.Today",
        "content": "Advertisement\n\nTypically, for the majority of blockchains, all metrics of on-chain activity and value transfer decline sharply after the dust settles post-airdrop. When the \"tourists\" and \"airdrop hunters\" are gone, they only mirror the actual utility of L1 or L2. Here's what the Arbitrum (ARB) case can tell us about these processes.\n\nArbitrum (ARB) network metrics rocketing following airdrop\n\nAll key metrics of Arbitrum (ARB) network usage - daily active user count, transaction number and net on-chain value - stabilized at levels higher than they used to be at before ARB token distribution in March. Such results were unveiled by analysts at Nansen on-chain data provider.\n\nArbitrum after the airdrop 👀\n\n\n\nMany projects have failed to sustain traction after their airdrop, however, initial data points to @arbitrum breaking that trend, with users and txs averaging higher now! pic.twitter.com/5t7yToYNo4 — Nansen 🧭 (@nansen_ai) June 14, 2023\n\nGas spending data, together with Arbitrum-Ethereum bridge turnover, followed similar patterns. The last metric grows even amid the spiking popularity of competitor protocols zkSync and Starkware.\n\nIn this field, Arbitrum still retains the second position, being surpassed only by Polygon (MATIC), the largest EVM ecosystem blockchain.\n\nAs covered by U.Today previously, in May 2023, Arbitrum (ARB) also onboarded a Bitcoin-Ethereum interoperability solution called tBTC.\n\nAirdrop hunters responsible for 5-6% of transactions on top L2s\n\nNansen experts also tracked the role of airdrop recepients in the ongoing activity on Arbitrum (ARB) and Optimism (OP), two of the largest L2s on Ethereum (ETH).\n\nFor them both, \"airdrop hunters\" are only responsible for 1 out of 20 transactions. As such, the vast majority of users are attracted by the long-term value proposition of the networks, not by the airdrop's benefits.\n\nArbitrum (ARB) remains the largest solution for Ethereum (ETH) scaling by total value locked in its protocols. As of mid-June 2023, it is responsible for almost 65% of the entire L2 ecosystem.\n\nIts closest competitor, Optimism (OP), only accounts for 18.55%, L2Beat tracker says."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiH2h0dHBzOi8vbWlsa3JvYWQuY29tL2ZsYXNoYm90cy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "What Is Flashbots? - How To Use & MEV Protection - Milk Road",
        "content": "Flashbots is a research and development organization aimed at making the Maximum Extractable Value (MEV) market more efficient, distributed, and democratic. Not familiar with MEV? Check out our guide to learn what MEV is.\n\nFront-running tactics on the Ethereum network will likely always exist. Flashbots is working to channel that behavior and minimize the negative externalities of MEV.\n\nFlashbots operates as a for-profit entity headquartered in the Cayman Islands and was co-founded by Stephane Gosselin and Phil Daian in 2020. That same year (according to Crunchbase), the company received seed funding from Paradigm, a crypto venture capital firm.\n\nIn January 2023, it was widely reported that Flashbots was aiming to raise $30 to $50 million at a ~$1 billion valuation. No official funding announcements have been made to date.\n\nHow To Use Flashbots\n\nEthereum users can use Flashbots by adding support for the Flashbots Protect RPC in their wallet interface. The detailed steps for how to do this are outlined later in this below.\n\nEthereum validators can outsource block building by running the Flashbots MEV-Boost validator software. Steps for how to install the software and configure it can be found here.\n\nFor infrastructure providers, resources for how to become a Flashbots block builder can be found here. And resources for how to operate a Flashbots relay can be found here.\n\nHow To Set Up Flashbots Protect?\n\nFor those familiar with the MetaMask wallet browser extension, enabling Flashbots Protect is simple.\n\nYou’ll need to open the browser extension, choose “Ethereum Mainnet” as the network, and click on “Add Network” at the bottom of the dropdown …\n\n… this will redirect you to a browser window where you select “add a network manually” at the bottom …\n\n… when prompted, input the following information to add the Flashbots RPC:\n\nName: User can choose whatever name they prefer\n\nUser can choose whatever name they prefer RPC URL: https://rpc.flashbots.net\n\nhttps://rpc.flashbots.net Chain ID: 1\n\n1 Symbol: ETH\n\n… click save, and voila – you can now submit Ethereum transactions with the peace of mind that trades will not be front-run and fees will only be paid if transactions go through.\n\nWhat Products Does Flashbots Offer?\n\nFlashbots offers 4 products to Ethereum users, infrastructure providers (i.e., validators and block builders), and community members.\n\nFlashbots Protect (Ethereum users) is a remote procedure call (RPC) endpoint that any Ethereum user can use to prevent their trades from being front-run by MEV bots (like jaredfromsubway.eth). It also prevents users from paying transaction fees for failed transactions.\n\nis a remote procedure call (RPC) endpoint that any Ethereum user can use to prevent their trades from being front-run by MEV bots (like jaredfromsubway.eth). It also prevents users from paying transaction fees for failed transactions. Flashbots Auction (Ethereum infra providers) is a marketplace for optimal transaction ordering. It allows validators to outsource the work of block construction to a network of third-party block builders that maximize block profitability.\n\nis a marketplace for optimal transaction ordering. It allows validators to outsource the work of block construction to a network of third-party block builders that maximize block profitability. MEV-Boost (Ethereum infra providers) is open-source middleware built by Flashbots and run by Ethereum validators. Validators running MEV-Boost essentially sell their blockspace in the open market to increase their staking yields by sourcing blocks assembled via the Flashbots Auction process.\n\nis open-source middleware built by Flashbots and run by Ethereum validators. Validators running MEV-Boost essentially sell their blockspace in the open market to increase their staking yields by sourcing blocks assembled via the Flashbots Auction process. Flashbots Data (Ethereum community) is a suite of tools and dashboards aimed at providing transparent insight into Flashbots Auctions and, more broadly, MEV activity on Ethereum.\n\nFlashbots Auction\n\nThe Flashbots Auction architecture aims to employ three separate entities: searchers, builders, and relayers to construct blocks.\n\nSearchers and builders assemble blocks such that the transactions included in blocks and their ordering maximize profitability. As of May 2023, ~9 different entities were serving as builders on Flashbots.\n\nRelayers pass along these blocks to validators who propose them to be appended to the Ethereum Mainnet blockchain. As of May 2023, ~10 different entities were serving as MEV-Boost relays.\n\nHistorically, Flashbots has been the dominant relay – thus wielding significant influence over block construction and representing a centralization chokepoint. But since the company open sourced its relay software in November 2022, the relay market has become more competitive. There are now ~10 different entities which are serving as relays.\n\nMEV-Boost\n\nMev-Boost is open source software that connects Ethereum validators to this distributed base of relays. It is “middleware” in the sense that it allows validators to source the most profitable blocks assembled via the Flashbots auction process thus bolstering their revenue (i.e., staking yield).\n\nSince being launched on proof-of-stake Ethereum in September 2022, MEV-Boost has seen widespread adoption. As of May 2023, ~90% of all Ethereum blocks were proposed by validators that were running MEV-Boost.\n\nGiven that ~$350M worth of MEV has been generated on Ethereum since “The Merge,” that is not too surprising. Not running MEV-Boost is like leaving money on the table if you are a validator.\n\nFlashbots Data\n\nIn an effort to provide transparency on how much MEV is being generated on Ethereum, who is generating it, and how decentralized the MEV landscape is, Flashbots provides tooling (e.g., APIs and dashboards) which is freely accessible to the Ethereum community.\n\nFrequently Asked Questions\n\nWhat is MEV? MEV refers to the incremental revenue that blockchain validators can earn by including, excluding, or changing the order of transactions before blocks are finalized. Similar to transaction fees, MEV is a cost borne by users (even if they are unaware of it) that use public blockchains. Some refer to it as an “invisible tax.” What Is The Source Of MEV? Top examples of MEV sources include sandwich attacks, DEX arbitrage, and liquidation attacks: Sandwich Attacks: A mempool observer spots a large buy order for one asset, places an order ahead of that large buy order, and then sells the asset after the large buy order has pushed up the market price of the asset.\n\nA mempool observer spots a large buy order for one asset, places an order ahead of that large buy order, and then sells the asset after the large buy order has pushed up the market price of the asset. DEX Arbitrage: Buying an asset at a low price on one decentralized exchange and selling it atomically (i.e., within the same transaction) at a higher price on another decentralized exchange.\n\nBuying an asset at a low price on one decentralized exchange and selling it atomically (i.e., within the same transaction) at a higher price on another decentralized exchange. Liquidations: Transactions whereby observers intentionally try to manipulate or change the price of an asset such that a user sees their leveraged position liquidated and benefits by reaping the transaction fees. How Can Users Protect Themselves From MEV? Setting up the Flashbots Protect RPC will protect users from some of the negative externalities associated with MEV. Users can submit transactions through the Flashbots RPC by following the steps outlined above in this article. What Chains Does Flashbots Support? Flashbots is currently only live on Ethereum. What Do Flashbots Do? Flashbots refers to a suite of software products that allow Ethereum users and infrastructure providers to capture and mitigate MEV. Infrastructure providers that run Flashbots software ensure that Ethereum transactions are ordered in such a way that their profitability is maximized. How Many Miners Use Flashbots? Following Ethereum’s merge to proof-of-stake (PoS) in September 2022, Flashbots is used by PoS validators rather than proof-of-work (PoW) miners. The percentage of validators using Flashbots MEV-Boost can be found here. What Is Flashbots RPC? Flashbots RPC refers to the Flashbots Protect remote procedure call (RPC) endpoint. It allows users to submit their transactions to the Flashbots protocol for inclusion in blocks rather than the Ethereum Mainnet mempool. What Percentage Of Blocks Are Flashbots? The percentage of Ethereum blocks sourced via Flashbots MEV-Boost relays can be found here.\n\nData Analyst Andrew Cahill Andrew previously was a Research Director at The Block; a crypto media and research company. Prior to that, he was a Research Analyst at Fundstrat; an investment research firm. Read More"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjM0NjI3L2VpZ2VubGF5ZXItZ29lcy1saXZlLW9uLWV0aGVyZXVtLXdpdGgtaW5pdGlhbC0xNy1taWxsaW9uLWRlcG9zaXQtbGltaXTSAW5odHRwczovL3d3dy50aGVibG9jay5jby9hbXAvcG9zdC8yMzQ2MjcvZWlnZW5sYXllci1nb2VzLWxpdmUtb24tZXRoZXJldW0td2l0aC1pbml0aWFsLTE3LW1pbGxpb24tZGVwb3NpdC1saW1pdA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "EigenLayer goes live on Ethereum with initial $17 million LST deposit limit - The Block",
        "content": "Re-staking protocol EigenLayer launched on Ethereum today, enabling holders of liquid staking tokens to double down for additional yield — at the cost of extra risk.\n\nThe core idea behind EigenLayer is that the staking security provided by ether stakers can be used to secure other protocols on the network. To use it, holders of liquid staking tokens — like Lido staked ether (stETH) — can stake these tokens through EigenLayer. This means that the token holders will gain extra rewards from the newer protocols they’re supporting, but it opens them up to more risk of penalties through slashing.\n\n“This is a significant step forward for Eigenlayer and we are excited to build the future of shared security together to work to hyperscale Ethereum,” the project's team said in a press release.\n\nAt launch, EigenLayer will support native staking of ether plus liquid staking tokens stETH, Rocket Pool ether (rETH), and Coinbase's wrapped staked ether (cbETH).\n\nThe protocol commences operation with some capacity limits. For example, it will only allow 3,200 tokens for each liquid staking token, creating a total limit of 9,600 liquid staking tokens. At ether's current price, that's a limit of around $16.7 million. The protocol will only let each crypto wallet deposit a maximum of 32 tokens, resulting in at least 300 deposits from separate wallets.\n\nThose who are staking their ether directly can also choose to use EigenLayer. This approach is accomplished through the creation of what’s called an EigenPod. The number of pods will be capped but not the number of staked ether.\n\n“These limits will be raised progressively over the coming weeks and months, with the goal of reaching a totally open and uncapped state where any user can restake any amount of staked Ether,” said EigenLayer.\n\nEigenLayer previously raised $64.5 million, including a $50 million Series A in March. The startup said today that its Series A raise was at a $500 million valuation, confirming The Block’s reporting ahead of the raise. Its backers include Blockchain Capital, Coinbase Ventures, Polychain Capital, Hack VC and Electric Capital.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nThe startup was founded in 2021 by Sreeram Kannan, an assistant professor at the University of Washington, Seattle.\n\nConcerns about re-staking\n\nThe re-staking model has drawn criticism from some notable corners of the Ethereum ecosystem. Perhaps most notably, Ethereum co-founder Vitalik Buterin has expressed concern about the emergence of re-staking.\n\n“We should tread lightly when application-layer projects aim to extend the ‘scope’ of blockchain consensus beyond the validation of essential Ethereum protocol rules,” Buterin stated in a blog post.\n\nButerin noted that while re-staking can be used for low-risk purposes, there are situations where it could compromise the mainnet’s security, such as when Ethereum validators face slashing on third-party chains.\n\n“We should instead preserve the chain’s minimalism and support uses of re-staking that do not seem like slippery slopes towards extending the role of Ethereum consensus,” Buterin suggested.\n\nAt the time, EigenLayer co-founder Sreeram Kannan agreed with some of the concerns but argued that re-staking can be used in low-risk situations."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMikwFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3RvcC0zLWNyeXB0b2N1cnJlbmNpZXMtcmVjb3ZlcmluZy13aXRoLXNwaWtlLWluLXNvY2lhbC12b2x1bWUtZXRoZXJldW0teHJwLWJpbmFuY2UtY29pbi0yMDIzMDYxNDA4MzHSAZcBaHR0cHM6Ly93d3cuZnhzdHJlZXQuY29tL2FtcC9jcnlwdG9jdXJyZW5jaWVzL25ld3MvdG9wLTMtY3J5cHRvY3VycmVuY2llcy1yZWNvdmVyaW5nLXdpdGgtc3Bpa2UtaW4tc29jaWFsLXZvbHVtZS1ldGhlcmV1bS14cnAtYmluYW5jZS1jb2luLTIwMjMwNjE0MDgzMQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Top 3 cryptocurrencies seeing uptick in social volume: Ethereum, XRP, Binance Coin - FXStreet",
        "content": "Share:\n\nBitcoin network’s social volume has declined, making way for Ethereum, XRP and Binance Coin.\n\nAltcoins continued their recovery by varying degrees with rising confidence from crypto market participants.\n\nBNB price rallied 10% in response to the Binance hearing, which will be updated on Thursday.\n\nSocial media attention has recently turned to Ethereum (ETH), XRP and Binance Coin (BNB) at the expense of Bitcoin, a sign of increasing confidence in these altcoins among crypto traders even as the price of the most popular cryptocurrency holds above the $25,000 level.\n\nRecent news affecting these altcoins is the main reason behind the surge in social media mentions. Binance’s hearing on Tuesday marked an important milestone for holders of BNB, the exchange’s native token. Judge Amy Berman Jackson, of the D.C. District Court, asked the Securities and Exchange Commission (SEC) and Binance to continue negotiating and to submit a status update by Thursday.\n\nBNB price rallied 10.5% in response to the hearing.\n\nSimilarly, the release of the so-called Hinman emails, key documents for Ripple’s defense against the SEC, fueled a temporary bullish sentiment among XRP holders.\n\nAlso read: XRP volatility surges as Hinman documents support Ripple's case against the SEC\n\nEthereum, XRP and Binance Coin witness spike in social volume\n\nBitcoin’s social volume declined after the asset’s price rally in March, according to data from crypto intelligence tracker Santiment. Social volume is built on top of social data collected by the tracker. The platform combs text documents containing the asset name at least once, on Twitter, Telegram and Reddit.\n\nAs seen in the chart below, Bitcoin social volume increased sharply in mid-March, weeks before reaching its recent price peak of $30,899.76 in April.\n\nETH, XRP and BNB social volume\n\nA spike in social volume is typically followed by a rally in the asset’s price in the weeks following a spike in social volume.\n\nETH, XRP and BNB registered an increase in social volume after Tuesday’s events. The Hinman documents, key to Ripple’s defense against the SEC, were unveiled for public view. Their content fueled a bullish sentiment among XRP holders and the altcoin yielded 6% gains before pulling back. Find out more here.\n\nThe Hinman documents shed light on the regulator’s stance on Ethereum and why the asset was considered a non-security, putting the second-largest altcoin by market capitalization under the spotlight too. ETH price held above key support at $1,724, trading at $1,739.57 at the time of writing.\n\nSEC and Binance gear up for Thursday update\n\nOn Tuesday’s hearing, Judge Amy Berman Jackson asked the SEC and Binance to continue negotiating to arrive at a compromise. The Judge asked the two parties to submit a status update by Thursday.\n\nIn the court hearing, the Judge expressed skepticism about the US financial regulator’s move to enforce its powers on Binance and called it “inefficient and cumbersome,” according to a report from the hearing by The New York Times. These comments fueled hopes among Binance’s native token holders, pushing BNB price higher.\n\nBNB price climbed from $228.90 to $252.90, or 10.5%, since Tuesday’s hearing. The exchange’s native token is therefore on track to recoup its recent losses and yield gains for holders ahead of Thursday’s update."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiNGh0dHBzOi8vbWlsa3JvYWQuY29tL2RhaWx5LzMtcmVhc29ucy1ldGgtY291bGQtZmFpbC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "🥛 3 reasons ETH could fail... - Milk Road",
        "content": "Today’s edition is brought to you by eTukTuk – the first automobile project on Cardano that hopes to shake up the EV industry and support developing countries.\n\nGM. This is Milk Road, the Baby Bear’s bed of crypto newsletters – we’re just right.\n\nHere’s what we got for you today:\n\nETH will fail without these 3 moves – Vitalik 📝\n\nMeet the 4 crypto race contenders 🏇\n\nMilk Roaders Index: How are you feeling about the crypto market? 🤔\n\nA DAO is “a person” – the CFTC 🍪\n\nPrices as of 10:00 AM ET\n\nETH WILL FAIL WITHOUT THESE 3 MOVES – VITALIK 📝\n\nVitalik Buterin (co-creator of Ethereum and our lanky king) dropped a new blog post last week.\n\nIt’s called “The Three Transitions”.\n\nNow I’ll be honest, Vitaliks blog posts are a lot like the Fast & Furious movies – they’re long, confusing, and sometimes put me to sleep. (sorry, VDog)\n\nBut this one really caught my attention.\n\nVitalik believes there are 3 things that are crucial to Ethereum’s future. Without them, Ethereum will fail. Plain and simple.\n\nIt’s a 15-minute read, but here’s the 2-minute MilkNotes™ summary:\n\nThere are three “transitions” needed to turn Ethereum from an experimental tech → open, global, and permissionless tech.\n\nHere they are:\n\n1/ The L2 scaling transition – everyone moving to rollups.\n\nEthereum rollups are a type of Layer 2 scaling technology that processes a batch of transactions off-chain and then submits them all together on-chain.\n\nOptimism, Arbitrum, and zkSync are some of the most popular roll-ups. (But none are better than Fruit By The Foot.)\n\nWhy this transition needs to happen: Rollups make transactions A LOT cheaper.\n\nRight now,\n\nIt costs about $3.65 to swap tokens on the Ethereum mainnet\n\nIt costs ~$0.10 to do the same thing on other rollups\n\nAnd when Ethereum sees a lot of activity, those fees can get really high. (~$100)\n\nAccording to Vitalik – without cheap fees, Ethereum adoption will fail.\n\n2/ The wallet security transition – everyone moving to smart contract wallets.\n\nThere’s a big dilemma in crypto right now: where’s the safest place to store your assets?\n\nCentral exchanges are shutting down. Software wallets are getting hacked. Hardware wallets have more trust issues than Drake.\n\nVitalik’s answer: smart contract wallets.\n\nThese have:\n\nNo single point of failure : there is no single thing (and ideally, no collection of things that travel together) that, if stolen, can give an attacker access to your funds.\n\nLow mental overhead : it shouldn’t take rocket science to use it.\n\nMaximum ease of transacting: most normal activities should not require much more effort than they do in regular wallets (eg. Metamask)\n\nIt’s the Secure Trinity.\n\nTwo popular smart contract wallets are the Argent wallet and the Loopring wallet.\n\nWhy this transition needs to happen: Without a safe place to store crypto – users will keep losing funds, lose trust, and just end up moving back to centralized solutions.\n\n3/ The privacy transition – everyone moving to “privacy-preserving” tools.\n\nRight now the blockchain is an open book. Everyone can see everything.\n\nTransactions. Wallet balances. You name it.\n\nBut not everyone loves that concept. Imagine if your current bank account and all your daily purchases were made public…\n\nWhy this transition needs to happen: Vitalik believes that having all transactions available for anyone to see is far too high a privacy sacrifice for many users.\n\nBecause of this, he thinks most users would move onto centralized solutions that at least (somewhat) hide your data.\n\nAnd those are the three big things Vitalik thinks Ethereum needs: rollups, smart contract wallets, and privacy tools. He says all 3 need to happen too.\n\nNow, I know what you’re thinking: “Vitalik, my G, you created Ethereum – why don’t you just implement the transitions yourself?”\n\nSimple. It’s not up to him.\n\nYou see, unlike Zuck at Facebook, Vitalik isn’t the CEO of Ethereum. There is no CEO. It’s decentralized.\n\nBut he does have influence and a voice. So even though his blogs aren’t commandments, ​​it’s always cool to get his opinions and thoughts.\n\nUltimately, it comes down to the Ethereum community and if they want to make these moves.\n\nOnly time will tell…\n\nThe electric vehicle industry is firing on all cylinders. Between new models and competitors, innovation around batteries, and Elon’s focus returning to Tesla, the future's looking bright.\n\nAnd when it comes to new initiatives, the EV industry is full of them.\n\nThe latest? EV 🤝 Blockchain\n\nThat’s right, the first automotive project is arriving on Cardano. Introducing eTukTuk.\n\neTukTuk has BIG ambitions: To build an affordable network of charging stations and electric vehicles for the developing world.\n\nHere’s some more info on them:\n\nTheir initiative cuts carbon emissions and improves air quality, with a focus on developing nations that need it most\n\nTheir team is made up of seasoned professionals with a background in Finance, Tech, Automotive, and Blockchain\n\nUtilizing the blockchain allows them to create digital identities, provide wider access for users, and reward network participants through the $TUK token\n\nLearn more about eTukTuk and $TUK below!\n\nTHE U.S. IS LOSING THE CRYPTO RACE 🏇\n\nCountries want one thing: to be the crypto hub of the world.\n\nIt's a global race. And there’s gonna be winners… and losers.\n\nLet's take a look at the contenders:\n\n1/ The U.S.\n\nIt’s cracking down harder on crypto than my mom did on me after I stole from her vodka stash in the 10th grade.\n\nThe SEC sued Binance & Coinbase, everyone’s leaving for greener, foreign pastures, and 50% of BTC on U.S.-based exchanges has left for ones overseas. Folks are spooked…\n\n2/ The U.K.\n\nOur friends across the pond are reaping some of the benefits of that though – a16z just announced it’s setting up shop there.\n\nThat’s partly because the UK’s Prime Minister is pro-crypto – the Royal Mint, for example, dropped an NFT for sale in March.\n\n3/ Hong Kong\n\nChina may be on the fence about crypto, but Hong Kong’s going all in.\n\nJust opened crypto trading to retail investors\n\nInvited Coinbase to apply for an exchange license there\n\nHas had a bunch of crypto companies apply to set up shop there\n\nNot too shabby.\n\n4/ Dubai\n\nIt has (heads up, here comes the “R” word) regulations when it comes to the crypto space. Clear rules for companies that want to operate there = muy bueno.\n\nEveryone & their mother wants a slice of the market: Crypto.com and Coinbase have applied for a license. And Binance has been there for a while now.\n\nPlus, they are building a cool-ass Bitcoin tower there…\n\nThe Results: We don't know who's gonna win, but we do know who's losing…\n\nThe U.S.\n\nIt’s fixing to learn the hard way how a lack of clear crypto laws will put it behind.\n\nMILK ROADERS INDEX: HOW ARE YOU FEELING ABOUT CRYPTO? 🤔\n\nLast week, we asked you a question… how are you feeling about the crypto markets?\n\nWell, the results are in….\n\nMost Roaders are feelin’ like Switzerland – neutral.\n\nThen we asked you why you felt that way, here were some of our favorite responses:\n\nStefan: “No matter what will happen to exchanges and with regulators, Bitcoin, and crypto can't be controlled or manipulated. Sure, they might tank the price for a while (let's say that the US chooses to ban every crypto transaction, that'd cause a massive dump). At the same time, they can't ban crypto itself. They can't control it. That's the power of it.”\n\nJeremy: “No storm lasts forever.”\n\nMack: “There is a big discount in the market. But first to get back confidence, The fed is forcing a lot of pain and putting some kids on the naughty step from some needed \"time out\". Hopefully they will learn the lesson so it’s not the wild wild west where anything goes. Short-term pain, long-term gain. ”\n\nZinemoun: “I have been in the crypto realm since 2013 so I have seen all kinds of attempts to shake down the disruptive revolution from governments, banking institutions, and authorities around the world! The crypto world will prevail against the conventional financial system! 😉 ”\n\nBas: “Darwin at play in a high-risk industry/asset class. Likely this is a “mass extinction” cycle that will clear the way for new growth and life. If we’re honest, most of this is well deserved on the principals playing fast and loose – if not outright dishonest. ”\n\nJJ: “While the regulatory headwinds are strong, I’ve learned from past bear cycles. This is an opportunity to buy. Especially some L1s that are in the down ”\n\nP.S. – If you didn’t get a chance to vote last week, hit reply to this email and let us know how you’re feeling about the crypto market!\n\nMILK & COOKIES 🍪\n\nA federal judge ruled in favor of the CFTC’s belief that a DAO (decentralized autonomous organization) is “a person.” Watch out DAOs…\n\nSturdy Finance (DeFi lending protocol) got hacked for $800K. Another day, another attack\n\nTether issued 1B USDT tokens in the Ethereum blockchain. They’re permitted but unissued, meaning they’re for future swap requests.\n\nHouse Republicans filed a bill to fire Gary Gensler and restructure the SEC. This is textbook “f*ck around and find out”.\n\nMILKY MEMES 🤣\n\nHIT THE INBOX OF 250K+ CRYPTO INVESTORS\n\nAdvertise with Milk Road to get your brand in front of the Who's Who of crypto. The Roadies are high-income crypto investors who are always looking for their next interesting product or tool. Get in touch today.\n\nROADER REVIEW OF THE DAY\n\nVITALIK PIC OF THE DAY\n\nremember to hydrate, Roaders https://t.co/8mygTqwbfd — Milk Road Images (@MilkRoadImages)\n\nJun 13, 2023\n\nDISCLAIMER: None of this is financial advice. This newsletter is strictly educational and is not investment advice or a solicitation to buy or sell any assets or to make any financial decisions. Please be careful and do your own research."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vY29pbmdhcGUuY29tL3hycC1uZXdzLWV0aC12aXRhbGlrLWhpbm1hbi1zcGVlY2gtZG9jcy1sYXdzdWl0LWNyeXB0by_SAVBodHRwczovL2NvaW5nYXBlLmNvbS94cnAtbmV3cy1ldGgtdml0YWxpay1oaW5tYW4tc3BlZWNoLWRvY3MtbGF3c3VpdC1jcnlwdG8vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "XRP Lawsuit: Vitalik Involved In Process Of Hinman’s Infamous ETH Speech; Reveals Docs - CoinGape",
        "content": "XRP Lawsuit News: Ethereum founder, Vitalik Buterin was involved in the process leading to the infamous Hinman speech which provided ETH alone a special clarity of not being a “Security” revealed latest documents. The public release of Hinman Speech linked documents in the U.S. Securities and Exchange Commission Vs Ripple lawsuit was anticipated as a major event for the crypto industry.\n\nAlso Read: Hinman Docs Reveal In XRP Case To Congressional Hearing; Why This Week Is Crucial For Crypto?\n\nadvertisement\n\nHinman Drew Consultation From ETH’s Vitalik\n\nMany crucial documents linked to Hinman documents and speech including Ripple’s Rule 56.1 statement finally being made available for public view. The document revealed that the SEC took a consultation from Vitalik Buterin in the process leading to the controversial speech.\n\nAn extract from the document released states that, on May 31, 2018, opposition to the recommendation grew within the US SEC against including Ether with Bitcoin as examples of digital assets which are no longer a “security”.\n\nHowever, on June 4, then SEC director, Hinman shared a draft of the speech with the commission division heads. The doc mentions that he stated that there is a call with Buterin later in that week in order to confirm the US SEC’s understanding of how the Ethereum Foundation operates. It added that this move would suggest that the draft did not reflect Hinman’s understanding of how Ether works. Read More XRP Lawsuit News Here…\n\nOffice of General Counsel Didn’t Wanted To Add ETH\n\nIt is important to note that the SEC’s Office of General Counsel (OGC) suggested deleting the draft’s language around ETH. The OGC was concerned about the difficulty it would have to face in taking a different position on Ether in the future.\n\nAlso Read: SEC’s Strongest Argument In XRP Case At Risk Amid Hinman Docs Disclosure\n\nThe General Counsel added that Eth’s Buterin has far more details than retail buyers of Ethereum. This directed that the OGC proposed to remove language about Ether from the draft’s final version."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiJGh0dHBzOi8vbWlsa3JvYWQuY29tL2FsbC10aW1lLWhpZ2hzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Crypto All-Time High Prices & Market Cap: BTH, ETH, SOL - Milk Road",
        "content": "Key Takeaways The highest price that a cryptocurrency has traded for is known as the “all-time high.”\n\nAll-time high prices generally occur during crypto bull markets.\n\nThe price of every cryptocurrency fluctuates as it is traded, resulting in some all-time high prices for the token. Usually, this peak occurs during a bull market, when the prices of all cryptocurrencies are on an upward trend.\n\nAll-Time Highs By Cryptocurrency\n\nThe top cryptocurrencies are Bitcoin and Ethereum (even your grandma has heard of them…maybe.) There are plenty of other coins too. Some, in fact, that are worth billions of dollars, and may look pretty interesting to investors.\n\nBelow we’ll check out the top 10 cryptocurrencies by market capitalization and their all-time high prices. But first, a few definitions:\n\nAll-Time High: A cryptocurrency’s value is determined by the price that each token trades at. The all-time high price refers to the highest price at which a token has ever traded.\n\nA cryptocurrency’s value is determined by the price that each token trades at. The all-time high price refers to the highest price at which a token has ever traded. Market Cap: The “market capitalization” of a cryptocurrency is the value of all of that cryptocurrency’s tokens combined. This is generally the preferred method for ranking cryptocurrencies in order to determine which crypto projects are larger than others.\n\nToken All-Time High Price All-Time High Market Cap Date of All-Time High Bitcoin (BTC) $67,549 $1.27 Trillion 11/8/2021 Ethereum (ETH) $4,724 $558 Billion 11/11/2021 Ripple (XRP) $3.30 $127 Billion 1/4/2018 Binance Coin (BNB) $661 $101 Billion 5/9/2021 Cardano (ADA) $2.95 $94 Billion 9/2/2021 Solana (SOL) $258 $78 Billion 11/6/2021 Dogecoin (DOGE) $0.69 $75 Billion 5/6/2021 Polkadot (DOT) $53 $53 Billion 11/4/2021 Litecoin (LTC) $359 $23 Billion 5/8/2021 Polygon (MATIC) $2.87 $20 Billion 12/26/2021\n\nBitcoin (BTC) – $67,549\n\nBitcoin reached its all-time high price of $67,549 in November of 2021. At the time, the 2021 bull market was at its height, pushing top cryptocurrencies like Bitcoin, Ethereum, and Solana to price levels not seen before. Learn more about Bitcoin price trends.\n\nEthereum (ETH) – $4,724\n\nEthereum also reached its all-time high price in November 2021 as a result of the broader bull market. Ethereum and Bitcoin are the two most popular cryptocurrency investments, so they led the crypto market as it sailed to $3 trillion dollars in overall market capitalization. Learn more about Ethereum price trends.\n\nRipple (XRP) – $3.30\n\nXRP reached its all-time high early in January 2018 as a result of the first major crypto bull market. At the time, XRP was the second most valuable cryptocurrency after Bitcoin. The token has since fallen far behind its former #2 spot (which is now occupied by Ethereum) and XRP did not do well enough in the 2021 bull run to break its 2018 price record.\n\nBinance Coin (BNB) – $661\n\nThe Binance BNB token reached an all-time high of $661 in May of 2021. This rally was an early part of the larger bull market going on at the time. While most coins reached their peaks in November of 2021, BNB was an early beneficiary of that year’s price action.\n\nCardano (ADA) – $2.95\n\nCardano reached its all-time high price of $2.95 in September of 2021 as a part of the bull market at the time. In September, the crypto market was just months away from its peak for the 2021 bull run.\n\nSolana (SOL) – $258\n\nTouted by many as the “Ethereum-killer” due to its low fees, large transactions-per-second throughput, and a vibrant developer community, Solana was a very popular coin in 2021. SOL followed in the steps of Bitcoin and Ethereum to attain its $258 all-time high price in November of 2021. The bull market marked November as the top for popular coins like Solana.\n\nDogecoin (DOGE) – $0.69\n\nDogecoin also benefited from the bull market run in 2021, however, its peak was marked by a particular cultural event — Elon Musk’s appearance on the American comedy show Saturday Night Live. In the final days and hours leading up to the show, Dogecoin notched an all-time high of $0.69 cents before falling over 40% just days later.\n\nPolkadot (DOT) – $53\n\nPolkadot was also one of the coins to benefit from the November 2021 bull run. On November 4th, DOT hit an all-time high of $53 per token. The price was bolstered by the overall bull run, but there was also large demand for the DOT token at the time since Polkadot’s first parachain auction took place during the first week of November 2021. A “parachain” is a part of the Polkadot blockchain that can be used to build a specific blockchain project. There are only 100 parachains available on Polkadot and developers have to bid in an auction in order to win the rights to build on one of the parachains.\n\nLitecoin (LTC) – $359\n\nBitcoin’s little cousin, Litecoin, achieved an all-time high of $359 in May of 2021 as a result of the 2021 bull market run. This new price record barely beat out Litecoin’s previous all-time high of $314, which occurred in December of 2017.\n\nPolygon (MATIC) – $2.87\n\nThe MATIC token from the Polygon blockchain hit its all-time high right before the end of the 2021 bull run. On December 26th, 2021, MATIC was trading for $2.87, its highest price to date. The cryptocurrency has since remained a top-10 token in large part due to partnerships with legacy tech companies such as META, Reddit, and Stripe who are using Polygon to build their own blockchain solutions.\n\nCrypto Cycles\n\nCrypto prices, much like prices in the stock market, generally follow cyclical patterns. Periods when prices are going up and investors are optimistic are known as “bull” markets, while periods when prices are going down are known as “bear” markets.\n\nThe crypto world has experienced two major bull runs, as of early 2023. Bull markets happen for many reasons including, heightened developer activity across blockchains, more investor cash flow available for investing in risky assets, and greater media buzz around cryptocurrencies.\n\nThe first occurred at the end of 2017 and lasted through the beginning of 2018, when Bitcoin crossed $10,000 per coin. The second bull market occurred in 2021 when Bitcoin achieved its current all-time high of over $60,000.\n\nDuring bear markets, prices will fall and trading activity will drop. Many crypto traders and experts have predicted that the prices of crypto will start rising again soon and will achieve new all-time highs over the next few years. Ultimately, however, it’s not possible to know whether crypto will go up or down in price over time.\n\nFrequently Asked Questions\n\nWhat is an all-time high? An “all-time high” refers to the highest trading price that a cryptocurrency has attained so far. For example, while the average trading price of Bitcoin in 2022 was around $25,000 per BTC, Bitcoin achieved an all-time high when it was trading for over $67,000 per BTC in November of 2021. What cryptocurrencies are the most valuable? The most valuable cryptocurrencies are Bitcoin and Ethereum. When comparing cryptocurrencies, it’s important to compare them by market capitalization, rather than by the price of each token. This is because cryptocurrencies differ in the amount of tokens they have minted out, which means that token prices are not a good reflection of the size of the cryptocurrency. When will crypto hit all-time highs again? It’s difficult to say when, or if, crypto will hit all-time highs again. The past has shown that the crypto market moves in cycles and that investors can expect price rallies after protracted bear markets. When it comes to investing, however, past performance is no guarantee of future results.\n\nSome notable crypto figures have made price predictions in the past which may prove useful to retail investors. Ultimately, however, it is not possible to know whether crypto will go up or down in price over time.\n\nContributor George Hristov George is a tech writer interested in web3 startups and communities. In the dynamic world of crypto, he stays plugged into the day-to-day headlines, deep dives, and industry commentary. Read More"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9oaW5tYW4tZG9jcy11bnNlYWxlZC1zZWMtY29uY2VybmVkLW92ZXItZXRoZXItbm90LXNlY3VyaXR5LXN0YXRlbWVudNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Hinman docs unsealed: SEC concerned over 'Ether is not a security' statement - Cointelegraph",
        "content": "Newly released documents showing edits that were made to a 2018 speech given by former director of the Security and Exchange Commission’s corporate finance division Bill Hinman suggest the editors were concerned his statement might undermine the idea that Ether (ETH) is a security.\n\nThis could risk locking the agency into a position it would find hard to change at a later date, the SEC comments warn.\n\n“Even with the caveats in the sentence, it seems that it would be difficult for the agency to take a different position on Ether in the future,” the edits to the documents read. “Further, the rest of the paragraph strongly implies that the thinking applies to Ether.”\n\nThe Hinman documents refer to internal SEC messages concerning a 2018 speech given by Hinman in which he said that, while cryptocurrencies such as Bitcoin (BTC) and Ether may start off as securities, it’s possible for them to become something more akin to a commodity once they become sufficiently decentralized.\n\nRipple CEO Brad Garlinghouse said June 12 that the documents would prove to be “well worth the wait.”\n\nRelated: Ripple case: Pro-XRP lawyer tips outright SEC victory at ‘less than 3%’\n\nThe unsealing of the documents comes amid an extremely turbulent time for the crypto industry. June 13 also sees the federal court hear the SEC’s motion to freeze the assets of Binance.US, following on from a spate of legal action against the exchange.\n\nThe SEC first took legal action against Ripple in December 2020, alleging that the sale of its native XRP (XRP) token represented an unregistered securities offering. Since then, Ripple has denied XRP is a security, arguing it does not satisfy the Howey test.\n\nMagazine: Tornado Cash 2.0 — The race to build safe and legal coin mixers"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvdGV0aGVyLXNodWZmbGVzLXRoZS1kZWNrLTc1MC1taWxsaW9uLXVzZHQtc2hpZnRlZC1mcm9tLXRyb24tdG8tZXRoZXJldW0v0gFpaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy90ZXRoZXItc2h1ZmZsZXMtdGhlLWRlY2stNzUwLW1pbGxpb24tdXNkdC1zaGlmdGVkLWZyb20tdHJvbi10by1ldGhlcmV1bS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Tether Shuffles The Deck: 750 Million USDT Shifted From Tron To Ethereum - NewsBTC",
        "content": "The company behind the issue of USDT stablecoin, Tether Holdings, has announced that it will work with a third-party exchange to convert 750 million USDT from Tron to Ethereum ERC20 via a chain swap.\n\nWith a current market valuation of $83.37 billion, USDT is by far the most valuable stablecoin in existence. Stablecoin use has soared over the last few years, and Tether has been working hard to diversify its reserve holdings in response to the growing need for trust in the network.\n\nTo maintain the liquidity of the stablecoin, cryptocurrency exchange Binance said through Twitter on Monday that it will arrange a swap of 750 million Tether-Tron token pairs for Tether-Ether. Tether has assured that the overall supply of USDT will not increase or decrease as a result of this.\n\nAfter 12pm UTC today, #Binance will be swapping 750M USDT-TRX for USDT-ETH directly with the Tether team to ensure stablecoin liquidity across all chains for our users. If you see any significant movements of USDT from our wallets today, that’s why. Funds are SAFU. — Binance (@binance) June 12, 2023\n\nTether Locks On 1:1 USD Anchor\n\nTether, the most popular stablecoin, strives to keep a one-to-one exchange rate with the US dollar (USD) at all times. This token swap will involve Tron, the ninth largest cryptocurrency by market cap at $6.3 billion, and Ether, the second largest cryptocurrency by market cap at $210 billion, after Bitcoin.\n\nBy exchanging bitcoin from one blockchain to another, or “swapping chains,” investors can get access to all of the blockchains that back the digital money they possess. Their digital assets can be used on other blockchains that support them.\n\nThe move to rebalance the liquidity base of USDT on Ethereum by shifting from the region of surplus to the region of scarcity remains the most reasonable explanation of the various theories being put forward as to why the USDT is being switched.\n\nMeanwhile, the heightened regulatory scrutiny of Binance has been detrimental to the exchange, prompting this strategic shift. Binance is now engaged in litigation with the US Securities and Exchange Commission, highlighting the importance of taking preventative action in light of the current regulatory environment.\n\nETH market cap currently at $210 billion. Chart: TradingView.com\n\nRestocking The Ethereum Network Inventory\n\nBinance, its CEO Changpeng Zhao, and Binance.US were all named in a lawsuit brought by the SEC last week. Binance has been accused of engaging in alleged deceptive activities, manipulating trading volumes, diverting user funds, and keeping the identity of those in control of the company in the United States a secret.\n\nTether re-minted $1 billion in USDT on the Ethereum blockchain on Monday, prompting the swap. Tether’s CTO Paolo Ardoino tweeted that the recent $1 billion mint was part of the company’s effort to restock its Ethereum Network storage.\n\nIn a related development, as of March, both the Tron Foundation and its creator, Justin Sun, were hit with fraud charges by the SEC. As a result, Binance USA announced that it will be pulling the digital asset token tron from its exchange.\n\nAt the time of writing, Ether (ETH was trading at $1,744, down 6.33% in the last seven days, data from crypto market tracker CoinMarkeCap shows. Tether (USDT), on the other hand, is painted in red, and trading at $0.99.\n\nSource: CoinMarketCap\n\nFeatured image from The Cryptonomist\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL2RlY3J5cHQuY28vbmV3cy1leHBsb3Jlcj9waW5uZWQ9MTkxMzkyJnRpdGxlPWF3cy1vdXRhZ2UtaGFkLW5vLWltcGFjdC1vbi1ldGhlcmV1bS1uZXR3b3JrLW5vZGVzLWRlc3BpdGUtcmVsaWFuY2Utb24tYW1hem9uLWhvc3RpbmfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "News Explorer — AWS Outage Had no Impact on Ethereum Network Nodes Despite Reliance on Amazon Hosting - Decrypt",
        "content": "Jun 14, 11:16 am\n\nCointelegraph\n\nAWS Outage Had no Impact on Ethereum Network Nodes Despite Reliance on Amazon Hosting\n\nAmazon Web Services (AWS) experienced a brief outage, however, the Ethereum network nodes were not affected despite their reliance on Amazon’s hosting. Despite the outage, 64.5% of the Ethereum network is still reliant on Amazon hosting providers. AWS has the dominant market share among cloud hosting providers, at 34%."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zZWMtZ2FyeS1nZW5zbGVyLWluLTIwMTgtdmlkZW8tc2F5cy1idGMtZXRoLW5vdC1zZWN1cml0aWVz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "SEC's Gensler says BTC, ETH 'not securities' in a newly surfaced video - Cointelegraph",
        "content": "A newly surfaced video featuring Gary Gensler from 2018 has made the rounds on social media, showing the now-chair of the United States securities regulator again stating that multiple cryptocurrencies are “not securities.”\n\nOn June 12 multiple Twitter accounts shared the video, which is understood to come from a 2018 event hosted by Bloomberg for institutional investors.\n\n“Over 70% of the crypto market is Bitcoin, Ether, Litecoin, Bitcoin Cash. Why did I name those four? They’re not securities,” Gensler says in the video.\n\nChair Gensler in 2018 at a Bloomberg conference in NYC:\n\n\n\n“Bitcoin. Ether. Litecoin. Bitcoin Cash. Why did I name those four? They’re not securities.”\n\n\n\nWhat’s Goldman Gary going to say about this one? Deep fake? pic.twitter.com/p7DJlYkJIt — Ryan Selkis (@twobitidiot) June 12, 2023\n\nAt the time, Gensler was a professor at the Massachusetts Institute of Technology, with the video predating his appointment as chair of the Securities and Exchange Commission by approximately two years.\n\nIt appears to contrast with Gensler’s more recent actions at the SEC, which has seen the regulator initiate a flurry of enforcement action on the crypto space in the past few months.\n\nIn his capacity as SEC chair, he has suggested that all cryptocurrencies other than Bitcoin (BTC) are securities. In total, the SEC has labeled at least 68 cryptocurrencies as securities in various lawsuits, though none of the four cryptocurrencies mentioned in the 2018 video have made it on this list.\n\nThe comments in the video are, however, another contrast from Gensler's more recent views on Ether (ETH). The SEC chair was pressed for his answer on if ETH was security before a U.S. House Committee in April, but he refused to answer.\n\nGary Gensler and Representative McHenry arguing on whether $ETH is a commodity or a security, with Gensler unable to answer the question pic.twitter.com/DTMtazYmuS — Cointelegraph (@Cointelegraph) April 19, 2023\n\nRelated: Gary Gensler: Crypto market is like 1920s stock market, full of 'fraudsters'\n\nOther videos of Gensler taken around his time at MIT have also surfaced this year showing him making similar comments about crypto.\n\nIn a 2019 video that circulated in April, Gensler called Algorand (ALGO) “great technology.” The same week the video circulated, the SEC sued crypto exchange Bittrex and claimed ALGO was a security in its complaint, with many in the crypto space calling the SEC chair a hypocrite.\n\nIn another video dated 2018 that circulated in April, Gensler is seen teaching a class at MIT and claims that three-quarters of the market i“non-securities.”\n\nThe below clip is from a Fall 2018 Graduate MIT course called \"Blockchain and Money\"\n\n\n\nGary Gensler - the current President of the SEC, was the professor.\n\n\n\nThe Hypocrisy speaks for itself\n\n\n\n\"So we already know in the US and in many other jurisdictions that 3/4 of the market… pic.twitter.com/rjRWeq5P8X — zk- (@ZK_shark) April 25, 2023\n\n“It's just a commodity, cash, crypto,” Gensler goes on to say in the video.\n\nWhile Gensler’s comments came at a time before he chaired the SEC, many in the crypto space have claimed his actions are hypocritical. One U.S. lawmaker introduced a bill with the intention of firing Gensler, claiming that he’s abusing his power.\n\nHall of Flame: Crypto Wendy on trashing the SEC, sexism, and how underdogs can win"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vYXUuZmluYW5jZS55YWhvby5jb20vbmV3cy9ncmFwaC1zdGFydHMtbWlncmF0aW5nLXNldHRsZW1lbnQtbGF5ZXItMTYwMDAwNTkzLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "The Graph Starts Migrating its Settlement Layer to Arbitrum from Ethereum - Yahoo Finance Australia",
        "content": "The Graph – a decentralized protocol for indexing and querying blockchain data – began on Wednesday the final phase of its migration from Ethereum to the layer 2 scaling solution Arbitrum.\n\nWith the migration, The Graph becomes one of the largest Ethereum apps to transition to a layer 2 rollup – a move that Graph developers Edge & Node say will decrease barriers of entry for The Graph’s participants without compromising on security.\n\nThe Graph, through its web of “delegators” and “indexers,” allows web3 developers to view blockchain data without trusting centralized intermediaries for the data’s accuracy. Launched initially on Ethereum, its move to layer 2 platform Arbitrum is an effort to decrease gas costs and increase transaction speeds, according to Edge & Node CEO Tegan Kline.\n\nArbitrum, like other Ethereum layer 2 networks, operates as a separate blockchain that runs alongside Ethereum. To reduce fees for users without losing all of Ethereum’s security guarantees, Arbitrum bundles up large groups of transactions and then passes them back down to Ethereum for all-at-once settlement.\n\nADVERTISEMENT\n\nThe Graph’s migration involves transferring its “settlement layer” from one network to another – rather than recording and settling activity directly on Ethereum, The Graph will now settle transactions on Arbitrum.\n\nEvery time a user performs a transaction on The Graph like delegating and indexing, there is a cost to it. “With this transfer to Artbitrum, those costs are lower. So we expect that there will likely be more indexers that spin up on the network [and] more delegators that get involved because that barrier to entry is lower, the cost isn’t so high,” Kline told CoinDesk.\n\nGRT and ARB, the native tokens for The Graph and Arbitrum, have both remained stable in the past 24 hours amid The Graph’s transition to Arbitrum. GRT has ranged between as high as 99 cents and as low as 97 cents, while ARB has oscillated between 97 cents and $1.01, per CoinDesk data.\n\nThe Graph enables developers to query data from 40 networks and raised $50 million in a 2022 funding round, which saw participation from Tiger Global, Blockwall Digital, Fenbushi Capital, FinTech Collective and Reciprocal Ventures.\n\nCORRECTION (June 14, 2023, 18:23 UTC): Specifies in the piece's first sentence that the final stage of The Graph's migration started Wednesday. The original article stated that the migration itself started on Wednesday."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tMjAzMC1leHBlcnRzLXNheS1jb2xsYXRlcmFsLW5ldHdvcmstY291bGQtYmUtdGhlLW5leHQtY2FyZGFuby_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction 2030: Experts Say Collateral Network Could Be the Next Cardano - Analytics Insight",
        "content": "In the ever-evolving world of cryptocurrencies, the search for the next big project is never-ending. Cardano (ADA) and Ethereum (ETH) are among the most promising projects to deliver substantial gains. Additionally, the Collateral Network (COLT) presale has captured the interest of many investors.\n\n>>BUY COLT TOKENS NOW<<\n\nEthereum: Powering the Future of Decentralized Finance\n\nWhen it comes to blockchain technology and decentralized applications, Ethereum has emerged as a trailblazer. As the second-largest cryptocurrency by market capitalization, Ethereum has solidified its position as a fundamental pillar of the crypto ecosystem.\n\nWith its smart contract functionality and robust developer community, Ethereum has paved the way for the explosive growth of decentralized finance (DeFi).\n\nEthereum was conceptualized by Vitalik Buterin in 2013 and officially launched in 2015. Unlike Bitcoin, which primarily serves as a digital currency, Ethereum aims to be a decentralized platform that enables developers to build and deploy smart contracts and decentralized applications (dApps).\n\nEthereum introduced its native cryptocurrency, Ether (ETH), which serves as the fuel for executing transactions and interacting with smart contracts on the Ethereum network.\n\nThe Ethereum network operates on a proof-of-stake (PoS) consensus mechanism, known as Ethereum 2.0, which is being rolled out in phases to address scalability and energy efficiency concerns. This upgrade is expected to revolutionize the network, making it faster, more secure, and environmentally friendly.\n\nCardano: A Paradigm for Progress\n\nCardano, a project built on a scientifically backed approach, has gained recognition for its commitment to rigorous research and development. Powered by its native token ADA, Cardano has set out to establish a secure and scalable blockchain platform capable of supporting complex decentralized applications (dApps).\n\nCardano sets itself apart by combining peer-reviewed academic research with a meticulous approach to building blockchain solutions. This emphasis on scientific rigor has helped Cardano attract partnerships with governments and institutions, positioning itself as a reliable and trustworthy platform.\n\nThe Cardano project has recently achieved significant milestones, including the successful launch of its much-anticipated smart contract functionality. This development opens the door for a wide range of decentralized applications to thrive on the Cardano platform, providing increased opportunities for developers and users alike.\n\nCardano’s systematic approach to innovation and commitment to technological advancement has garnered admiration within the crypto community. This way, Cardano serves as a reference point for projects aspiring to achieve similar levels of success, such as the upcoming Collateral Network.\n\n>>BUY COLT TOKENS NOW<<\n\nCollateral Network: Pioneering Peer-to-Peer Lending on Ethereum\n\nIn the fast-paced world of decentralized finance, Collateral Network aims to revolutionize peer-to-peer lending by leveraging the Ethereum blockchain. This innovative platform allows users to borrow cryptocurrencies against physical assets, unlocking liquidity and providing a decentralized alternative to traditional lending institutions.\n\nThe platform accepts a diverse range of assets as collateral, including real estate, fine art, vintage cars, gold, fine wines, watches, diamonds, and collectibles. By leveraging the blockchain’s transparency and security, Collateral Network ensures the integrity of the collateral and the loans.\n\nThe Collateral Network platform functions by tokenizing physical assets into NFT and using them as collateral. Borrowers can unlock the value of their assets by depositing them into the platform’s smart contracts. Borrowers can then borrow cryptocurrencies against the value of their collateralized assets, providing them with immediate access to liquidity.\n\nAnalysts predict that the presale of COLT tokens could experience a significant price increase, with projections of up to 3,500% (35x). During the presale, the price of COLT tokens is expected to reach $0.35. Once listed on major exchanges, there is the anticipation of a further surge, potentially reaching a 100x increase.\n\nFind out more about the Collateral Network presale here:\n\nWebsite: https://www.collateralnetwork.io/\n\nPresale: https://presale.collateralnetwork.io/register\n\nTelegram: https://t.me/collateralnwk\n\nTwitter: https://twitter.com/Collateralnwk\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9tZXRpcy1pbXBsZW1lbnRzLXBhcnNpcS10c3VuYW1pLWFwaS0xNDAwMDA1ODcuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Metis Implements PARSIQ's Tsunami API to Address Blockchain's Biggest Data Challenges - Yahoo Finance",
        "content": "TORONTO, ON / ACCESSWIRE / June 13, 2023 / EVM-equivalent Ethereum Layer-2 scaling solution Metis has integrated PARSIQ's blazing-fast Tsunami API, which will provide users with unprecedented access to raw data from the entire Metis chain.\n\nThe integration will lift the entire Metis developer ecosystem, who will now be able to access the data they need more quickly and easily than ever before. Developers and projects will have instant access to both historical and real-time Metis blockchain data via filtered and indexed APIs. Utilizing Tsunami's library of functions will help Metis developers build more robust applications and scale.\n\nGood data is the foundation of a good project, but blockchain data is often messy and difficult to standardize and index. PARSIQ's Tsunami API works like a shortcut for developers, offering a plug-and-play solution to these complex data problems.\n\n\"We are delighted to add PARSIQ to our ecosystem as it is a full-suite data network for building the backend of all Web3 dApps and protocols. Projects like PARSIQ help Metis with its primary goal - facilitating business evolvement from web2 to web3. Now developers working on Metis will have an even easier experience accessing data they need,\" says Tom Ngo, Executive Lead of Metis.\n\n\"We at PARSIQ love working closely with teams that share our conviction that the future belongs to Web3. That's why we're so excited to be integrating Metis. With their dedication to improving the scalability of Ethereum, Metis has built a perfect platform for builders and innovators in the space. They're the real deal. Together, we're making it easier for developers to get the tools they need to get building,\" echoes Tom Tirman, PARSIQ CEO.\n\nMetis is currently the most cost-efficient Ethereum Layer-2, offering gas fees 200x lower than those on the mainnet. Having recently deployed Aave V3, and with other exciting DeFi platforms on the horizon, Metis is taking big steps towards becoming integral to the inner workings of Web3.\n\nStory continues\n\nAbout Metis\n\nMetis is an EVM-Equivalent Ethereum Layer-2 protocol focused on bridging the gap between Web2 and Web3. Metis provides users with a secure, decentralized, and scalable easy-to-use network. By combining a robust Layer 2 with on-chain credentials and Decentralized Autonomous Companies (DACs), Metis is building the perfect ecosystem to host open and trustless collaboration, secured by Ethereum.\n\nMetis.io | YouTube | Twitter | Reddit | Telegram | Telegram Announcement | Discord |\n\nAbout PARSIQ\n\nPARSIQ is a full-suite data network for building the backend of all Web3 dApps & protocols. The Tsunami API provides blockchain protocols and their clients (e.g. protocol-oriented dApps) with real-time and historical data querying abilities. ‘Data Lake' APIs allow complex data querying & filtering for any project; specifically designed and tailored for our customers' blockchain data needs.\n\nWebsite | Blog | Twitter | Telegram | Discord | Reddit | YouTube | Link3.to\n\nCONTACT:\n\nColin Landers\n\ncolin@energentmedia.net\n\nSOURCE: Metis\n\n\n\n\n\nView source version on accesswire.com:\n\nhttps://www.accesswire.com/760728/Metis-Implements-PARSIQs-Tsunami-API-to-Address-Blockchains-Biggest-Data-Challenges\n\n\n\n"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0LzUtY3J5cHRvLWFpLXByb2plY3RzLXRoYXQtYXJlLW91dHBlcmZvcm1pbmctYml0Y29pbi1hbmQtZXRoZXJldW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "5 Crypto AI Projects That Are Outperforming Bitcoin and Ethereum - Analytics Insight",
        "content": "In the ever-evolving world of cryptocurrency, investors are constantly on the lookout for projects that offer potential for high returns. While Bitcoin and Ethereum have been dominant players in the market, there are several AI-focused projects that have shown impressive performance and are outperforming these giants.\n\nThese projects harness the power of artificial intelligence to bring innovative solutions to various industries and attract investors’ attention. Let’s take a closer look at five such crypto AI projects that have been making waves:\n\n1. SingularityNET (AGI):\n\nSingularityNET is a decentralized marketplace for AI services that aims to democratize access to artificial intelligence. The platform enables developers to create, share, and monetize AI algorithms. With its unique approach, SingularityNET has gained significant traction and is backed by a strong community. The project’s token, AGI, has experienced remarkable growth, outperforming Bitcoin and Ethereum in terms of returns.\n\nInQubeta is an AI-driven crowdfunding platform that merges AI, NFTs, and crypto to provide investment opportunities in AI startups. The platform enables fractional ownership of AI projects and startups, allowing investors to participate in their growth and success.\n\nInQubeta’s presale has garnered significant attention, with strong community support and impressive fundraising results. The project’s QUBE token holds promising potential for investors looking to tap into the AI market. InQubeta incentivizes early investors by offering rewards and benefits. Investors can receive rewards based on the success and performance of the AI projects they have invested in. These rewards can come in various forms, such as additional tokens, exclusive access to project updates, or even equity-based incentives.\n\nVisit InQubeta Presale\n\n3. Fetch.ai (FET):\n\nFetch.ai is another AI-focused project that leverages decentralized AI and blockchain technology to build an autonomous economic ecosystem. The platform enables the creation of smart contracts, decentralized applications (dApps), and AI agents to facilitate various tasks. Fetch.ai has seen substantial growth and gained recognition for its innovative AI and blockchain integration approach.\n\n4. Ocean Protocol (OCEAN):\n\nOcean Protocol aims to unlock data and connect data providers with data consumers using blockchain technology. The project allows individuals and organizations to monetize and exchange data securely, while preserving privacy and control. With its emphasis on AI and data marketplaces, Ocean Protocol has attracted attention from investors and has demonstrated impressive growth potential.\n\n5. Numerai (NMR):\n\nNumerai is a unique AI-powered project that combines machine learning and crowdsourced data science for financial modeling. The platform allows data scientists to build predictive models and compete to earn rewards in the form of the project’s native token, NMR. Numerai has gained popularity for its innovative data science approach and outperformed traditional investment options like Bitcoin and Ethereum.\n\nVisit InQubeta Presale\n\nConclusion\n\nThese five crypto AI projects showcase the potential for impressive returns beyond Bitcoin and Ethereum. However, it’s important to note that investing in any cryptocurrency carries risks, and thorough research and due diligence are crucial before making any investment decisions. The crypto market is highly volatile, and past performance does not guarantee future results. Nevertheless, these projects have shown the potential to generate significant traction within the fast-growing AI industry\n\nVisit InQubeta Presale\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vd3d3LmJpdGNvaW5tYXJrZXRqb3VybmFsLmNvbS9wcm90b2NvbHMtb24tYm5iLWNoYWluL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "The Ultimate Guide to the Top 10 Protocols on BNB Chain - Bitcoin Market Journal",
        "content": "Executive Summary: Since 2021, BNB Chain has made significant strides in the decentralized finance (DeFi) sector, now holding a roughly 8.5% market share and standing as a formidable competitor to Ethereum and Tron. BNB’s user-friendly design, compatibility with the Ethereum Virtual Machine, and lower transaction fees position it as an attractive alternative to Ethereum.\n\nOur investing thesis is that Layer-1 blockchains are like operating systems. Just as most of the world runs on either macOS or Windows, so most blockchain apps will likely end up running on either Ethereum, or some competitor. If you believe in the long-term potential of BNB Chain as a top blockchain platform, then buying and holding BNB is the way to invest in it.\n\nWith over 500 DeFi applications, BNB Chain continues to attract robust investor interest, bolstered by Binance’s native token (BNB) being the fourth-largest cryptocurrency. That said, the recent SEC lawsuit against Binance has impacted the BNB token negatively, sending the price roughly 20% lower in a week. That could be signs of worse things to come, or a good way to buy the token at a discount.\n\nBefore 2021, Ethereum monopolized the blockchain applications market, thanks to its intuitive smart contract feature and user-friendly programming language. It accounted for 95% of all DeFi applications. However, the dynamic nature of the crypto space led to the emergence of fierce competition.\n\nBinance, the world’s largest cryptocurrency exchange, launched its own public blockchain as a competitor to Ethereum. Today, it holds roughly 8.5% of DeFi’s total value locked (TVL), making it the third most popular DeFi ecosystem, following Ethereum and Tron.\n\nWhat is BNB Chain?\n\nBNB Chain has had several rebrandings, but today is made up of two separate blockchains: BNB Smart Chain (originally called Binance Smart Chain), and BNB Beacon Chain (BC).\n\nBNB Chain uses a Proof of Staked Authority (PoSA) consensus mechanism, supported by 50 validators, to ensure short block times and lower fees. The most-bonded validators become block producers, guaranteeing security, stability, and chain finality. BNB Chain is compatible with the Ethereum Virtual Machine (EVM) and facilitates cross-chain transfers and communications.\n\nBNB Chain offers security and safety through its elected validators. It supports Ethereum tooling, ensuring faster finality and cheaper transaction fees. The native token, BNB, is used for executing smart contracts and staking. Currently, BNB is the 4th largest cryptocurrency, with a market cap exceeding $47 billion.\n\nBSC hosts over 500 dapps, and we’ll discuss the top 10 by total value locked.\n\nTop 10 Protocols on BSC by Total Value Locked\n\nPancakeSwap\n\nType of dapp: DEX\n\nBMJ Score: 4.0\n\nPancakeSwap is a decentralized exchange (DEX) built on BNB Chain. It enables users to swap Binance’s BEP-20 tokens seamlessly. Borrowing elements from Ethereum-based Uniswap and SushiSwap, PancakeSwap implements an automated market maker (AMM) system, eliminating the need for a centralized order book or facilitator. This means users trade against liquidity pools funded by other users instead of trading directly with counterparties.\n\nBesides trading, PancakeSwap users can become liquidity providers, earn a share of transaction fees, participate in yield farming to earn CAKE tokens, and even engage in a lottery. Moreover, it supports trading and staking of non-fungible tokens (NFTs).\n\nPancakeSwap accounts for about 44% of all total value locked (TVL) on BNB Chain, so it easily makes the list of the top 10 largest DeFi protocols.\n\nVenus\n\nType of dapp: Lending\n\nBMJ Score: 4.0\n\nVenus is a DeFi lending platform for the BNB ecosystem. It aims to provide secure and decentralized lending and borrowing of cryptocurrency. Anyone can access this algorithm-based money market by connecting compatible wallets like MetaMask.\n\nUsers can lend or borrow supported digital assets, earn token rewards, and participate in governance via Venus’ native token, XVS. The protocol integrates the functionalities of Compound and MakerDAO, enabling users to lend, borrow, and mint stablecoins within a single ecosystem.\n\nOn Venus, interest rates are set by the protocol, responding to market demands, but the minimum and maximum levels are determined by the governance process.\n\nThe protocol was founded in 2020 by the team behind Swipe. The team’s goal was to bridge traditional finance and DeFi on the BNB Chain. With a TVL figure of $800 million, Venus is the second-largest DeFi protocol on BSC.\n\nBiswap\n\nType of dapp: DEX\n\nBMJ Score: 3.5\n\nBiswap, launched in May 2021, is a DEX offering token swapping on BSC with trading fees starting from as low as 0.1%. Besides providing a platform for trading, farming, and staking, Biswap offers an innovative three-type referral program rewarding users for their referees’ activities in farming, launchpools, and swaps.\n\nThe ecosystem also hosts an NFT marketplace and NFT game. Utilizing an AMM model, Biswap ensures swift transactions while maintaining user control over funds. Its native token, BSW, facilitates incentivization across the platform. With a strategic investment from Binance Labs, Biswap enhances its innovative DEX services.\n\nRadiant V2\n\nType of dapp: Lending\n\nBMJ Score: 3.5\n\nRadiant is an Arbitrum-native omnichain money market protocol that is also supported on BSC. It aims to facilitate cross-chain deposit and borrowing of major assets.\n\nWith the recent launch of Radiant V2, the protocol addresses some of the issues encountered in V1, such as initial emissions, liquidity provision, and fixed unlock times. Enhancements include refined tokenomics, increased utility, the integration of cross-chain capabilities, launches on multiple new EVM chains, and the implementation of LayerZero Omnifungible Token (OFT). V2 is also designed to amass fair value for the DAO, positioning Radiant as a leading fee-generating protocol in DeFi. Notably, the upgrade underwent rigorous security audits by Peckshield, Zokyo, and BlockSec, affirming its robust security framework.\n\nAlpaca Finance\n\nType of dapp: Yield farming\n\nBMJ Score: 3.0\n\nAlpaca Finance is a decentralized finance (DeFi) platform launched on BSC in early 2021. It offers leveraged yield farming and supports undercollateralized loans for enhanced yield farming positions, improving capital efficiency.\n\nWith over $300 million in TVL, it has grown rapidly since its launch, diversifying into single-asset staking, LP staking vaults, and experimental synthetics while actively partnering with other protocols.\n\nAlpaca’s lending mechanism lets users earn yield through Alpaca tokens and popular cryptocurrencies like BTC, ETH, and BNB.\n\nNotably, Alpaca adopts a deflationary buyback and burn model for a percentage of platform fees, reducing total supply over time, which further strengthens the value proposition of the protocol.\n\nBinance Staked ETH\n\nType of dapp: Liquid Staking\n\nBMJ Score: 3.0\n\nTo compete with the popular Lido, Binance launched its own Ethereum-based liquid staking product. Like Lido, this service enables users to earn staking rewards on ETH without locking up their assets, providing enhanced liquidity and more yield opportunities in DeFi.\n\nLaunched initially in response to the Ethereum network’s shift to Ethereum 2.0 and its Proof of Stake mechanism, this product was shifted to a wrapped version of Ether (WBETH) after Binance was served with an SEC lawsuit. Naturally, it caters to the Ethereum community’s increasing demand for staking. Users can stake any amount of ETH and receive WBETH tokens in exchange, which can be eventually used for yield opportunities across the BSC ecosystem. These tokens can be traded, transferred, or used as collateral on Binance, multiplying the options for staked ETH.\n\nPinkSale\n\nType of dapp: Launchpad\n\nBMJ Score: 3.0\n\nPinkSale is a decentralized launchpad unveiled in July 2021. It enables token creation and presale funding for projects across various networks, including BSC, Ethereum, Fantom, Polygon, KuCoin Community Chain, and Avalanche. It stands apart with its minimalist toolkit for swift token development and Initial Dex Offering (IDO) sales.\n\nPinkSale integrates innovative features such as an anti-rug pull system, antibot feature, and various token types, ensuring platform safety through regular audits by Certik. With more than 6,000 projects launched, 650,000 participants, and $220 million in TVL, PinkSale has solidified its status as a leading decentralized crypto launchpad while actively preventing scams and maintaining platform decentralization.\n\nWarning: These IDOs are most likely to be considered unregistered securities in the eyes of the U.S. Securities and Exchange Commission.\n\nUNCX Network (formerly UniCrypt)\n\nType of dApp: Launchpad\n\nBMJ Score: 2.5\n\nLaunched in June 2020, UNCX Network, previously UniCrypt, is a one-stop DeFi solution providing five principal services to streamline project development and enhance investor security. With offerings such as Initial Liquidity Offering (ILO) services, liquidity lockers, token vesting, staking-as-a-service, and ENMT Token Minter, UNCX Network facilitates transparency and safety for both project creators and investors.\n\nDevelopers can create bespoke presales, lock liquidity to protect investors, vest tokens for price stability, and establish staking pools. For those lacking token or solidity skills, the network’s minter creates pre-audited tokens, boosting project credibility. UNCX Network’s integrated platform simplifies project launch and operation while promoting secure investment.\n\nWarning: These ILOs are most likely to be considered unregistered securities in the eyes of the U.S. Securities and Exchange Commission.\n\nCoinWind\n\nType of dapp: Yield\n\nBMJ Score: 2.0\n\nCoinWind is a smart yield farming platform supported by HECO and BSC. Launched in 2021, it is strategically designed to optimize user revenues by automatically matching pledged tokens (digital assets locked for rewards). As of May 2023, the protocol’s TVL is over $200 million.\n\nCoinWind effectively addresses the issues of low revenues from single-token mining and high risks from LP mining in the DeFi landscape. As a smart decentralized finance management platform, CoinWind aggregates funds from various token pools to participate in diverse liquidity mining opportunities. It combines this with price hedging strategies to lessen impermanent loss, aiming to maximize user returns while minimizing unpredictable losses.\n\nTHENA\n\nType of dapp: General\n\nBMJ Score: 1.0\n\nTHENA is a relatively new project that aims to become the go-to DeFi trading platform on BNB Chain. According to its roadmap, the ecosystem will include a wide range of DeFi products, including ALPHA, an advanced perpetual trading platform, WARP, a launchpad accelerator, and CORE, a social hub promoting user interaction. On top of that, RAMP will ensure seamless fiat transactions – something that other DeFi projects don’t offer.\n\nInvestor Takeaway\n\nSince 2021, BNB Chain has demonstrated significant growth and adoption in the DeFi space, capturing nearly 10% of the total market and vying with Tron for the spot as second-largest DeFi ecosystem. Despite Ethereum’s dominance, BSC’s lower transaction costs, shorter block times, and compatibility with the Ethereum Virtual Machine have made it an appealing alternative for many projects.\n\nThe BNB Chain hosts a multitude of DeFi applications, with a diverse range of protocols leading the way. Projects like PancakeSwap and Venus have left their mark on the ecosystem, with the former accounting for almost half of BSC’s total value locked.\n\nWhile BNB is currently maintaining its position among the top 5 largest cryptocurrencies by market cap, investor interest and confidence in the BNB ecosystem has taken a hit due to the lawsuit brought by the U.S. Securities and Exchange Commission against Binance and its founder and CEO Changpeng Zhao. Given the uncertainty surrounding the exchange it would be wise to remain cautious about investing in BNB, as well as any project building within the Binance ecosystem.\n\nSubscribe to Bitcoin Market Journal to discover more investment opportunities in blockchain!"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMizgFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWluLWluZGlhLWp1bmUtMTQtY2hlY2stbWFya2V0LWNhcC1iaXRjb2luLWV0aGVyZXVtLW1lcmdlLWRvZ2Vjb2luLXNvbGFuYS1saXRlY29pbi1yaXBwbGUteHJwLWJpbmFuY2UtdG9rZW4tcW50LXByaWNlcy1nYWluZXItbG9zZXItMTYwODk0MNIB0gFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWluLWluZGlhLWp1bmUtMTQtY2hlY2stbWFya2V0LWNhcC1iaXRjb2luLWV0aGVyZXVtLW1lcmdlLWRvZ2Vjb2luLXNvbGFuYS1saXRlY29pbi1yaXBwbGUteHJwLWJpbmFuY2UtdG9rZW4tcW50LXByaWNlcy1nYWluZXItbG9zZXItMTYwODk0MC9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin, Litecoin See Losses As Injective Becomes Top Gainer - ABP Live",
        "content": "Bitcoin (BTC) and Ethereum (ETH) — two of the most valued crypto coins — managed to rise above the $25,000 and $17,00 marks, respectively, on early Wednesday morning. However, in terms of percentage-wise performance, BTC witnessed a loss of 0.08 percent. Other popular altcoins — including the likes of Ethereum (ETH), Litecoin (LTC)— landed in the negative as overall prices saw minor losses across the board. Injective (INJ) emerged to be the biggest gainer, seeing a 24-hour jump of over 8.41 percent. WOO Network (WOO), on the other hand, turned out to be the biggest loser.\n\nAt the time of writing, the global crypto market cap stood at $1.06 trillion, registering a 24-hour gain of 0.37 percent.\n\nBitcoin (BTC) price today\n\nBitcoin price stood at $25,993.61 seeing a 24-hour loss of 0.08 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 23.26 lakhs.\n\nEthereum (ETH) price today\n\nETH price stood at $1,744.02, marking a 24-hour loss of 0.05 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 1.57 lakhs.\n\nDogecoin (DOGE) price today\n\nDOGE registered a 24-hour gain of 0.37 percent as per CoinMarketCap data, currently priced at $0.06198. As per WazirX, Dogecoin price in India stood at Rs 5.5434.\n\nLitecoin (LTC) price today\n\nLitecoin saw a 24-hour loss of 0.23 percent. At the time of writing, it was trading at $77.92. LTC price in India stood at Rs 6,965.03.\n\nRipple (XRP) price today\n\nXRP price stood at $0.5157, seeing a 24-hour loss of 1.96 percent. As per WazirX, Ripple price stood at Rs 46.0000.\n\nSolana (SOL) price today\n\nSolana price stood at $15.21, marking a 24-hour loss of 0.15 percent. As per WazirX, SOL price in India stood at Rs 1,410.00.\n\nTop crypto gainers today (June 14)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nInjective (INJ)\n\nPrice: $6.16\n\n24-hour gain: 8.41 percent\n\nBNB (BNB)\n\nPrice: $251.05\n\n24-hour gain: 8.06 percent\n\nFantom (FTM)\n\nPrice: $0.2637\n\n24-hour gain: 6.79 percent\n\nInternet Computer (ICP)\n\nPrice: $3.96\n\n24-hour gain: 5.63 percent\n\nPancakeSwap (CAKE)\n\nPrice: $1.44\n\n24-hour gain: 5.48 percent\n\nTop crypto losers today (June 14)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nWOO Network (WOO)\n\nPrice: $0.1651\n\n24-hour loss: 2.82 percent\n\nMonero (XMR)\n\nPrice: $135.98\n\n24-hour loss: 2.32 percent\n\nXDC Network (XDC)\n\nPrice: $0.03252\n\n24-hour loss: 2.17 percent\n\nRipple (XRP)\n\nPrice: $0.5153\n\n24-hour loss: 2.03 percent\n\nCronos (CRO)\n\nPrice: $0.05236\n\n24-hour loss: 1.94 percent\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC92aXRhbGlrcy10cmlwbGUtY2FsbC1jYW4tbWlsbGlvbmFpcmVnYW1lLW1nLWFuZC1ldGgtc2VpemUtdGhlLW9wcG9ydHVuaXRpZXMtb2YtZXRoZXJldW0tdHJhbnNpdGlvbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Vitalik's Triple Call! Can MillionaireGame (MG) and ETH Seize The Opportunities of Ethereum Transition? - Analytics Insight",
        "content": "Ethereum’s co-founder, Vitalik Buterin, has drawn a roadmap for what he believes to be the three main technical transitions required to ensure the success of the Ethereum blockchain. Will MillionaireGame (MG), rumored to be the next whale club on Ethereum, grasp this opportunity?\n\nMillionaireGame (MG) – The Next Whale Club on Ethereum\n\nMillionaireGame (MG) is an upcoming meme coin on Ethereum. Unlike other generic meme coins, MG focuses on fulfilling an investor’s dream – to become a millionaire. MG reflects the real wishes of investors who are hoping to hit the jackpot by investing small amounts in meme coins. As the MG game begins, a new millionaire will be randomly selected from the token holders every month.\n\nEmphasizing Technological Capabilities Like Ethereum\n\nLike Ethereum, MG is a project that emphasizes technological prowess. The MG game will be run by smart contracts, ensuring transparency and fairness. With a sustainable token economy designed such that as long as the token market cap is above $40 million with a 2% price increase, the Millionaire Game can continue for over 50 years, as claimed by the teams, making it the next dominating whale club.\n\nVitalik’s First Transition – Layer 2 Expansion\n\nThe first transition Vitalik mentions is expanding Layer 2. Over the past few years, Ethereum has quickly witnessed the emergence of a Layer 2 ecosystem comprising Optimistic Rollup and Zero Knowledge-Rollup solutions. These solutions help reduce transaction costs, but the L2 space still needs to mature and expand further, as most activities still happen on the mainnet. Buterin warns that without Layer 2 expansion, Ethereum could face rising transaction fees, especially during market expansion or “bull” phases.\n\nVitalik’s Second and Third Transitions – Wallet Security and Privacy\n\nIn his blog, Vitalik further stresses the importance of the second transition, wallet security. He emphasizes that potential security issues may deter users from storing funds on the Ethereum network, forcing them to opt for centralized exchanges. Vitalik also highlights the importance of privacy as the third transition. He expresses concern that without robust data privacy measures, users may be reluctant to use Ethereum.\n\nPrice Surge and Exciting Times Ahead for MG\n\nEthereum’s price experienced substantial volatility following Vitalik’s announcement, but has since attained stability, underscoring Ethereum’s enduring strength. Simultaneously, MG has unveiled the presale price for its impending second phase, forecasting an encouraging 18% ascent in the token value. Investors drawn to the Millionaire Game’s innovative approach should closely monitor these unfolding events. An early-stage investment in a meme coin like MG presents optimal opportunities for substantial returns. However, it’s crucial to remember that this comes intertwined with the inherent uncertainties characteristic of all cryptocurrency ventures.\n\nMillionaireGame (MG) Presale Information:\n\nhttps://www.millionairegame.org/claim-discount\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0LzctY3J5cHRvcy10by1oZWxwLWJlYXQtdGhlLWJlYXItbWFya2V0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "7 Cryptos To Help Beat The Bear Market - Analytics Insight",
        "content": "In this article, we will discuss the 7 cryptos to help beat the bear market. While the crypto bear market can be boring, it is a good time to look at old and new beginner cryptocurrency opportunities. Bitcoin can store value, Ethereum’s smart contract functionality, or innovative tokens such as InQuBeta’s QUBE and NFTs are all exciting examples. This article will explore various options for entering the cryptocurrency space, the tokens to watch, and how to strategically find the best crypto to invest in and understand which crypto to buy today for long-term growth.\n\nHow to Get Into Cryptocurrencies?\n\nTo get into cryptocurrency for beginners, start by educating yourself on the basics of blockchain technology and researching various coins like Bitcoin, Ethereum, Solana, and Polygon. Then, choose a reputable cryptocurrency exchange such as Coinbase to create an account, which is an essential step in how to get into cryptocurrency. For cryptocurrency trading for beginners, it is crucial to invest prudently, diversify your portfolio with different coins, and constantly monitor market trends. Remember to practice secure storage for your assets and be prepared for market volatility.\n\n7 Cryptos To Help Beat The Bear Market\n\nDiversify your portfolio with these seven cryptocurrencies: InQubeta (QUBE), DigiToads (TOADS), Bitcoin (BTC), Ethereum (ETH), Binance Coin (BNB), Solana (SOL), and Polygon (MATIC) to hedge against bear market downturns and seek potential profits.\n\nInQuBeta (QUBE) – Best ICO to Buy Now\n\n\n\nIn the flourishing sector of AI startups, InQubeta presents what could be considered one of the best new ICOs to buy with its innovative Web3 crowdfunding platform. It aims to change how AI startups engage with their communities and raise funds by leveraging blockchain technology and smart contracts. Through its platform, InQubeta enables a more transparent, secure, and democratic DeFi crypto ecosystem for investment in AI startups. The token symbol for InQubeta is QUBE, which operates on the Ethereum network (ERC-20).\n\nWhat makes InQubeta exceptionally alluring as one of the altcoins is its ability to fractionalize investment opportunities. AI startups can mint their investment opportunities into NFTs, which can be fractionalized, making them some of the top crypto coins and allowing investors to invest according to their budget. This lowers barriers to entry and provides an opportunity to be part of the following significant AI innovation, even with modest investment capital.\n\nFurthermore, InQubeta is slated to launch its custom-built NFT marketplace, further facilitating AI startups in raising funds by offering a reward and equity-based NFTs. QUBE token holders can seamlessly invest in projects of their preference, establishing a symbiotic ecosystem for investors and startups. QUBE serves not just as a medium of investment but also as a governance token. It is deflationary, meaning its value is expected to rise as tokens are gradually burnt over time. An exciting feature of QUBE is the ‘burn tax’, whereby 2% of all token sales and 1% of purchases will be permanently removed from circulation and burnt, creating a scarcity effect.\n\nFor those seeking a more passive income, QUBE has covered you with its staking rewards pool. Long-term QUBE holders who stake their tokens will be rewarded from buy/sell taxes. Additionally, tokens are vested over 12 weeks to foster a sustainable market for investors.\n\nVisit InQubeta Presale\n\nDigiToads (TOADS) – Best Crypto to Invest for Metaverse\n\n\n\nDigiToads is a remarkable collection residing on the Ethereum blockchain The DigiToads community, which is steadily expanding, is driven by passionate collectors and enthusiasts who deeply value the creativity embedded in each toad. Every DigiToad is distinctive due to a wide variety of features, ensuring that no two toads are alike. This individuality has catapulted DigiToads into a much-coveted collection within the NFT space and makes it one of the top NFT collections.\n\nIn addition, DigiToads is not just a static collection; it is an evolving ecosystem. Through a decentralized autonomous organization (DAO), DigiToad owners can participate in governance and shape the project’s trajectory. This sense of ownership and contribution further solidifies the community’s involvement and dedication to the DigiToads world. On top of that, this project has also built their own metaverse called The Swamp. This is where you can let your DigiToads play and use the TOADS token to buy potions, food or training equipment.\n\nIn a nutshell, DigiToads effortlessly combines artistry, community involvement, and exclusivity through its diverse toad characters, community-driven development, and real-world perks for holders.\n\nBuy DigiToads Now\n\nBitcoin (BTC) – Best Crypto to Invest in Now to Weather the Bear Market\n\nBitcoin (BTC), the original and most prominent cryptocurrency, remains an attractive investment option for seasoned and novice investors. Bitcoin for beginners is one of the easiest ways to get started within the cryptocurrency world. As the pioneer in cryptocurrency, Bitcoin holds a unique position and has consistently proven to be the best crypto to invest in due to its upward trend in value since 2009. Its decentralized nature, secured through blockchain technology, ensures that any government or financial institution does not control it. This makes it a go-to asset for individuals seeking an alternative to traditional fiat currencies. Additionally, Bitcoin has proven to be a reliable store of value, often called digital gold, especially during economic uncertainty. With a capped supply of 21 million coins, Bitcoin’s scarcity is another appealing factor, as it protects against inflation. The widespread adoption and integration of Bitcoin into mainstream financial systems and payment gateways have further solidified its dominance and utility. For investors looking to diversify their portfolios, gain exposure to an alternative asset class, and potentially achieve substantial returns, Bitcoin stands out as an exceptional choice in the dynamic cryptocurrency market.\n\n\n\nEthereum (ETH) – Best Altcoin To Watch\n\nEthereum (ETH) is one of the top 10 altcoins and even a top 5 cryptocurrency. Unlike Bitcoin, which is primarily a digital currency and store of value, Ethereum serves as a decentralized computing network built on blockchain technology and is a leading DeFi crypto. Launched in 2015 by Vitalik Buterin and Gavin Wood, Ethereum has grown exponentially and represents a significant portion of the global cryptocurrency market.\n\nWhat sets Ethereum apart is its versatility and functionality. Ether, the native token of Ethereum, can be used for financial transactions similar to Bitcoin. However, the Ethereum network allows developers to create decentralized applications (dApps) on its blockchain. This innovative feature enables the secure and transparent handling of complex transactions, including the execution of smart contracts, which automatically enforce themselves once certain conditions are met. Moreover, Ethereum’s blockchain is faster than Bitcoin’s, with a new block validated every 12 seconds as opposed to Bitcoin’s 10 minutes.\n\nBinance Coin (BNB) – Best Utility Crypto to Buy\n\n\n\nBinance Coin (BNB), the native cryptocurrency of the Binance exchange, presents itself as a utility token with multifaceted applications, making it a shield in bearish times for investors. Initially launched in July 2017 through an initial coin offering, BNB was primarily used for availing trading fee discounts on the Binance platform. However, with Binance’s evolution into an extensive ecosystem, BNB’s applications have diversified substantially.\n\nOne of the distinct aspects of Binance Coin is its token-burning mechanism. Every quarter, Binance uses a portion of its profits to buy back and permanently destroy BNB tokens, a practice known as burning. This reduces the BNB supply, which could affect its value positively. In market downturns, utility tokens like BNB are top crypto to buy as they tend to retain value better than purely speculative assets due to their intrinsic usefulness in various ecosystems. This renders BNB a viable option for investors seeking a protective hedge during bearish market conditions.\n\nSolana (SOL) – Best Crypto to Invest in for P2E\n\nSolana (SOL) has emerged as an investment-worthy cryptocurrency that continues to perform resiliently despite the turbulent waves of the bear market. Solana stands out because of its ultra-high-speed transaction processing capabilities, achieved without compromising decentralization through a combination of innovative technologies, including the “proof of history” consensus mechanism. With the ability to process approximately 50,000 transactions per second, Solana trounces Ethereum’s current throughput and is vying to compete with centralized payment processors like Visa.\n\nThe meteoric surge in the price of SOL, the native cryptocurrency of Solana, was partly fuelled by the launch of a primate-themed NFT collection called Degenerate Ape Academy, which drew mainstream attention. Furthermore, Solana’s low transaction fees and lack of congestion make it an attractive platform for developers and users alike, especially for DeFi projects and NFTs. Its native token, SOL, is used for transaction fees and staking, granting holders voting rights in governance proposals.\n\nGiven its technological innovations, scalability, and growing ecosystem of applications, Solana’s SOL appears as an alluring crypto asset with the potential to stay buoyant even in bearish market conditions.\n\nPolygon (MATIC) – Good Crypto to Buy for Cheap Fees\n\nPolygon (MATIC) is a robust choice for cryptocurrency investors, as it provides a much-needed stability anchor amidst the tumultuous tides of the bear market. Polygon is a multi-chain scaling solution that improves Ethereum’s scalability and interoperability. It efficiently addresses network congestion issues by processing transactions on an Ethereum-compatible blockchain before returning them to the main Ethereum chain. This framework allows for significantly faster transactions. With its native token, MATIC, Polygon offers various scaling solutions, including Plasma chains, PoS blockchain bridges, zk-rollups, and optimistic rollups, catering to diverse security, speed, and cost needs.\n\nNot merely an alternative, Polygon seeks to bolster Ethereum’s capabilities and foster mass adoption. By enhancing Ethereum’s performance without competing against it, Polygon (MATIC) appears as an astute investment for those looking for a stable, synergistic, and future-proof asset in the crypto sphere during the bear market.\n\nVisit InQubeta Presale\n\n7 Cryptos To Help Beat The Bear Market – Conclusion\n\nIn summary, the crypto space offers many possibilities for investors looking to diversify their portfolios. From understanding blockchain technology to researching and investing in diverse coins like Bitcoin, Ethereum, InQuBeta, or engaging in the NFT space with DigiToads, there is something for every investor. Investing wisely, diversifying, and staying informed is essential to navigate volatile cryptocurrency markets successfully. Remember to prioritize security and make calculated decisions based on research and market trends.\n\nVisit InQubeta Presale\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNyeXB0by1uZXdzLWZsYXNoLmNvbS9pcy1ldGhlcmV1bS1jbGFzc2ljLXN0aWxsLXJlbGV2YW50LWFmdGVyLWV0aGVyZXVtLW1lcmdlLWFpLWFuYWx5dGljcy1wcm92aWRlLWluc2lnaHRzL9IBfmh0dHBzOi8vd3d3LmNyeXB0by1uZXdzLWZsYXNoLmNvbS9pcy1ldGhlcmV1bS1jbGFzc2ljLXN0aWxsLXJlbGV2YW50LWFmdGVyLWV0aGVyZXVtLW1lcmdlLWFpLWFuYWx5dGljcy1wcm92aWRlLWluc2lnaHRzLz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Is Ethereum Classic still relevant after Ethereum Merge? AI Analytics provide insights - Crypto News Flash",
        "content": "As the Ethereum blockchain transitions from a proof-of-work protocol to a proof-of-stake system, the cryptocurrency market watches in anticipation. With the Ethereum Merge bringing about significant changes, the future of ETC remains uncertain, prompting questions whether it is still relevant after the Ethereum Merge. Fortunately, Avorak comes in handy with its advanced algorithms.\n\nEthereum Classic Price Prediction\n\nEthereum Classic (ETC) came as a hard fork from the original Ethereum blockchain after a hack on the DAO platform. While Ethereum developers chose to reverse the hack, part of the community continued with the original blockchain and created Ethereum Classic, which functions similarly to Ethereum but with a smaller market capitalization and developer community. Since Ethereum transitioned to Proof-of-Stake, some miners have migrated to ETC, but without organic demand, Ethereum Classic price prediction notes that ETC’s long-term prospects are uncertain. As such, AI analytics by AvoraK AI can provide valuable insights including the Ethereum Classic Price Prediction for investors and traders looking to make informed decisions.\n\nEthereum Merge\n\nThe Ethereum Merge is the transition of Ethereum’s consensus mechanism from proof-of-work to proof-of-stake, resulting in a 99.95% decrease in energy consumption. This upgrade is significant because it makes the framework more sustainable offering greater crypto-economic security, as well as making it easier for anyone to participate in securing the Ethereum network. The Ethereum Merge is a software upgrade that essentially changes the verification system of the blockchain, which establishes a decentralized method to validate transactions and eliminates the need for intermediaries like banks.\n\nSince the transition of Ethereum to a Proof-of-Stake (PoS) consensus mechanism, Ethereum Classic (ETC) has seen a massive surge in mean hash rate as some miners migrated to ETC. However, there has been no increase in on-chain activity on ETC, ETC mining profitability has plummeted. Without organic demand for ETC, it is likely to struggle from continued sell pressure from miners. ETCG shareholders own 8.5% of the ETC in circulation, which is a highly concentrated crypto by the top 100 address ownership. The lack of user demand for the network or the ETC coin, in general, makes the long bet on ETCG a bet that Grayscale will dissolve the trust and distribute the proceeds from the coin sales for a larger value than where the fund shares are currently trading.\n\nThe Ethereum Merge involves retiring miners and introducing stakers, which is expected to result in a significant drop in Ether’s value. This shift will impact Ethereum’s native coin’s economics by cutting back on its issuance, reducing its total supply through burn mechanisms, and introducing staking. The Merge’s impact on ETH, in terms of its dynamics, is likely the most significant aspect for investors and traders. The reduction in supply is equivalent to three Bitcoin halvings.\n\nAvorak AI\n\nAvorak (AVRK) provides investors with an investment and business opportunity with simplified AI solutions, including chatbots, trade bots, text generators, and image creators. The question of whether ETC will remain relevant after the Ethereum Merge remains unanswered. AI analytics can provide insights into the future of ETC. By analyzing market trends, on-chain activity, and social media sentiment, AI algorithms can identify patterns and predict potential outcomes for ETC after the Ethereum Merge.\n\nAVRK token is in ICO phase seven with a value increase of 325% to $0.255. Early investors can access bonus payouts and other rights after the ICO and listing. ICO holders can participate in Beta testing of various AI tools, Avorak Write, a content generation tool is making waves in the text generation space. The tool strives to eliminate plagiarism and repetitive content problems of existing tools.\n\nWrap Up\n\nWhile the long-term prospects of ETC are uncertain, AI analytics can provide valuable insights for investors and traders looking to make informed decisions. By analyzing large amounts of data and generating predictions based on complex algorithms, Avorak AI can be a useful tool in navigating the ever-changing cryptocurrency market and identifying potential investment opportunities.\n\nMore on Avorak AI here:\n\nWebsite: https://avorak.ai\n\nBuy AVRK: https://invest.avorak.ai/register\n\nThis article is provided for informational purposes only and is not intended as investment advice. The content does not constitute a recommendation to buy, sell, or hold any securities or financial instruments. Readers should conduct their own research and consult with financial advisors before making investment decisions. The information presented may not be current and could become outdated."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmJpdGNvaW5zZW5zdXMuY29tL2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tZGFpbHktMTQtanVuZS1ldGgtcmFuZ2luZy1tYXJrZXQtY29udGludWVzLXdoYXQtbm93L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction Daily (14-June): ETH Ranging Market Continues! What Now? - Bitcoinsensus",
        "content": "ETH price prediction from a previous analysis Urgent! ETH Building Up Momentum For Another Massive Move Soon!\n\nIn our previous Ethereum analysis Urgent! ETH Building Up Momentum For Another Massive Move Soon! we identified the bearish accumulation pattern currently building up in the 4-hour timeframe and also warned our readers of how this can be very bearish for the ETH price.\n\nWell since publishing that TA, we have seen the Altcoin price continue to range as the Altcoin bearish momentum continues to develop.\n\nIn this Ethereum analysis, we will be breaking down what pattern is currently developing on the 4-hour timeframe and breaking down the key pattern that is currently developing right now!\n\nTo trade ETH with leverage, sign-up to Bybit right now! Bybit’s BIGGEST Bonus Campaign is now live! You can get up to a $30,000 Bonus when you fund your Bybit account with our Bybit link\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nETH Ranging Channel Continues!\n\nETH Ranging Market Continues! What Now? Watch this ranging market playing out in the 4-hour timeframe\n\nThe accumulation phase in Ethereum is currently forming what seems to be a new pattern in the 4-hour timeframe. This pattern is a new Bearish Flag Pattern forming in the 4-hour timeframe.\n\nThis is a bearish pattern that indicates that the ETH price might continue to push lower in the coming days. So for now, we are waiting for the Altcoin price to complete the accumulation phase and resume\n\nOnce completed, we expect to see the Altcoin price resume its move to the downside in the coming days.\n\nThis potential sell-off about to happen could potentially push the Altcoin price down more than -15% in the coming days.\n\nFinal Verdict!\n\nThe Ethereum price is still very bearish right now! However, the Altcoin is right now accumulating for a further move down in the coming days.\n\nIn the coming days, we will be watching this ranging phase as it enters its final stages, Once completed, we expect to see the Altcoin begin to sell off aggressively in the coming days.\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nHow to Trade Bitcoin (BTC)?\n\nTo understand the basics of Bitcoin trading, you can read our How To Trade Bitcoin Guide. It can prove helpful for traders who are just getting started with Bitcoin trading. You can also check out our list of top Bitcoin Exchanges To Trade With.\n\nPrimeXBT Covesting: Trade Hassel Free\n\nSign-up on PrimeXBT today to trade Bitcoin hassle-free. You can copy experienced traders and access hundreds of different strategies on the platform! Don’t forget to claim your 25% bonus by using the promo code “bitcoinsensus50” when you sign-up with our link PrimeXBT Covesting"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMisgFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vYmlsbGlvbmFpcmUtZ2FyeS1nZW5zbGVyLXR1cm5pbmctdXMtaW50by1hLXRlY2hub2xvZ3ktd2FzdGVsYW5kLWNhbGxzLWZvci1uZXctc2VjLWNoYWlybWFuLWFuZC1yZWd1bGF0b3J5LWFwcHJvYWNoLWZvci1iaXRjb2luLWV0aGVyZXVtLWFuZC14cnAv0gG4AWh0dHBzOi8vd3d3LmNyeXB0by1uZXdzLWZsYXNoLmNvbS9iaWxsaW9uYWlyZS1nYXJ5LWdlbnNsZXItdHVybmluZy11cy1pbnRvLWEtdGVjaG5vbG9neS13YXN0ZWxhbmQtY2FsbHMtZm9yLW5ldy1zZWMtY2hhaXJtYW4tYW5kLXJlZ3VsYXRvcnktYXBwcm9hY2gtZm9yLWJpdGNvaW4tZXRoZXJldW0tYW5kLXhycC8_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Billionaire: Gary Gensler Turning US Into a Technology Wasteland, Calls for New SEC Chairman and Regulatory Approach for Bitcoin, Ethereum, and XRP - Crypto News Flash",
        "content": "Venture capitalist and billionaire Tim Draper says the SEC chair is crippling the American technology and crypto innovation progress with damaging policies.\n\nDraper thinks ‘America is going to be a technology wasteland in 40 years.’\n\nTim Draper, an American Venture capitalist, and billionaire, has responded to SEC Chair Gary Gensler calling the crypto industry ‘scam artists’ and ‘fraudsters’ in an interview on Fox Business show ‘The Claman Countdown.’\n\nThe Draper Venture Network founder said that the U.S. Securities and Exchange Commission (SEC) Chair, Gary Gensler, runs the US with policies that cripple crypto innovation.\n\nDraper said that Gary Gensler and the SEC have no right to oversee crypto technology and that crypto should be regulated in a new way. The billionaire said crypto firms do not expect zero crypto regulations and are willing to abide by clear guidelines. However, the SEC has issued confusing guidelines, upsetting and discouraging the crypto industry from growth.\n\nDraper criticizes SEC\n\nDraper, an early Bitcoin (BTC) investor, said if there is any fraud, as in FTX, the SEC chair has the job of protecting investors but should not randomly shoot down any firm with new technology.\n\nDraper continued to say, despite having a few characters going against the law, Gensler should not enforce random things as if the country does not have guidelines. These baseless enforcements will drive innovation out of the country, and America will be a technology wasteland in forty years. He gave an example of how Coinbase was willing to abide by the law, but the new SEC regulations weighed them down.\n\nIf there was a fraud [in FTX], and I think there probably was, then you have a job to do. But you don’t just start shooting randomly at any company with new technology. That makes absolutely no sense.\n\nDraper remarked and continued to say:\n\nAnd sure, there are certain people who are doing things that you clearly don’t want to have done in the US. We all have to play by a certain set of rules. We play by those rules. We always believed in those rules in the US. But now, it’s like we don’t know the rules, and [Gensler] can enforce whatever he wants and whenever he wants. That is going to drive all the innovation right out of the country. It makes no sense at all. He is damaging our country if he is going to do that.\n\nTim Draper also commended Coinbase CEO Brian Armstrong for doing everything as dictated by American law. Coinbase, the biggest crypto exchange by volume in the US, was charged by the SEC last week with allegations of security violations. Draper noted that Brian had done everything right and brought innovations that would transform the global economy. However, the American regulators can decide whether Coinbaase and Brian’s transformational innovations will happen in the US.\n\nThis article is provided for informational purposes only and is not intended as investment advice. The content does not constitute a recommendation to buy, sell, or hold any securities or financial instruments. Readers should conduct their own research and consult with financial advisors before making investment decisions. The information presented may not be current and could become outdated."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmNyeXB0b3BvbGl0YW4uY29tL2JpbmFuY2UtdW5kZXItZmlyZS1hY2N1c2VkLW9mLXVzaW5nLWV0aGVyZXVtLWFjY291bnQtdG8tY29taW5nbGUtY2xpZW50LWZ1bmRzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Binance under fire: accused of using Ethereum account to comingle client funds - Cryptopolitan",
        "content": "Binance, the prominent cryptocurrency exchange, continues to employ the Ethereum (ETH) account it was accused of using to commingle clients’ funds as the Securities and Exchange Commission (SEC) indictment against them lingers. The allegations against Binance involve the mingling of funds into accounts controlled by Changpeng Zhao (CZ), the CEO of Binance, namely Sigma Chain and Merit Peak.\n\nThe Ethereum account, initially brought to public attention by journalist Mike Burgersburg, alias “Dirty Bubble Media,” remains in use despite the ongoing controversy. Recent transaction data on Etherscan reveals that the account received approximately $7 million in Tether and 299,999 Uniswap tokens, with a combined value of around $1.3 million, from two separate Binance.com accounts. Intriguingly, they were swiftly transferred to Binance US accounts shortly after the funds arrived.\n\nThis Ethereum account, established in August of the previous year, has been consistently utilized for moving funds from Binance.com to Binance US. The total amount transferred through this account is $1.4 billion.\n\nBinance has yet to provide a comprehensive explanation for this activity. However, during a Twitter Space session organized after the crash of FTX, a cryptocurrency exchange, CZ admitted to being a shareholder in a market maker that serves Binance. Notably, he emphasized that this market maker does not generate profits.\n\nIn the same interview, CZ asserted that Binance is an exchange that operates transparently and honestly, denying any claims of trading against its clients. Nevertheless, the recent SEC indictment accuses CZ of using up to 300 personal accounts for trading on Binance.\n\nBinance’s response to the SEC’s allegations did not directly refute the claims made. Instead, the exchange stated that clients’ funds were never endangered and criticized the regulator’s actions, asserting they are detrimental to the US’ global financial innovation and leadership position.\n\nThe persistence of Binance in using the contentious Ethereum account raises further questions about the exchange’s operations and compliance with regulatory standards. The ongoing controversy surrounding Binance, coupled with the indictment by the SEC, has undoubtedly cast a shadow over the exchange’s reputation and intensified scrutiny from the cryptocurrency community and regulatory bodies alike.\n\nConsequently, Binance faces a critical juncture as it must navigate these allegations and provide a more transparent account of its actions. The impact of this controversy on the broader cryptocurrency ecosystem and the perception of regulatory compliance within the industry remains to be seen."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vdGltZXN0YWJsb2lkLmNvbS94cnAtbGF3c3VpdC1ldGhlcmV1bXMtdml0YWxpay1pbnZvbHZlZC1pbi1wcm9jZXNzLW9mLWhpbm1hbnMtaW5mYW1vdXMtZXRoLXNwZWVjaC1kZXRhaWxzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "XRP Lawsuit: Ethereum's Vitalik Buterin Involved In Process Of Hinman's Infamous ETH Speech: Details - Times Tabloid",
        "content": "The long-awaited documents related to the highly controversial “Ethereum is not a security” speech made by William Hinman in 2018 have been released for public view, as earlier ordered by the judge presiding over the United States Security and Exchange Commission (SEC) vs Ripple lawsuit.\n\nVitalik Buterin, the co-founder of Ethereum, appears to have been involved in the process that led to the infamous speech made by the former SEC Director of Corporation Finance William Hinman.\n\nAccording to the finally released Hinman Speech Documents and emails for public view — which the SEC had fought hard to conceal — the former SEC officer seemed to have taken consultations from Ethereum co-founder in the process leading to the inclusion of ETH as a non-security crypto asset in his 2018 speech.\n\nA part of the disclosure showed that controversies arose within the SEC in May 2018 when Hinman mentioned ether (ETH) as the only altcoin deemed to be a non-security crypto asset alongside Bitcoin (BTC) in his initial draft shared with SEC division heads.\n\nDue to this opposition from within the SEC, the released SEC documents revealed that “Hinman inserted an alternative to the proposed ether language which could be used on either if there arises a “need to hedge the issue a bit at the time of the speech.”\n\nConsequently, Hinman shared another draft with the SEC division heads on June 4, mentioning a scheduled meeting with the Ethereum co-founder for further information about the Ethereum foundation.\n\nA section of the released documents read, “On June 4, Hinman shared a draft of the speech with SEC division heads and wrote that the proposed language about ether “is in brackets and would be used if we all are in agreement” and adding “We also have a call with Buterin later this week to confirm our understanding of how the Ethereum Foundation operates,” suggesting that the draft did not reflect Hinman’s “understanding of how the Ethereum Foundation operates.”\n\n<\n\nThis coincides with the prevailing speculations from some members of the XRP community that the U.S. Securities Commission was compromised by Ethereum officials to favor ETH. As published, Cardano founder Charles Hoskinson has repeatedly disagreed with this claim, calling it a grand conspiracy.\n\nFollow us on Twitter, Facebook, Telegram, and Google News"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3Lm5hbWVjb2lubmV3cy5jb20vYml0Y29pbi1hbmQtZXRoZXJldW0tcG9zaXRpb25lZC1saXZlLW9uLW11bHRpdmVyc3gv0gFUaHR0cHM6Ly93d3cubmFtZWNvaW5uZXdzLmNvbS9iaXRjb2luLWFuZC1ldGhlcmV1bS1wb3NpdGlvbmVkLWxpdmUtb24tbXVsdGl2ZXJzeC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin and Ethereum positioned live on MultiversX - NameCoinNews",
        "content": "Bitcoin and Ethereum, undoubtedly the most sought-after digital assets, have now been positioned live on the MultiversX Bridge. This will help them to get connected with speedy, as well as cost-effective transaction fees, along with endless possibilities for carrying out innovations.\n\nThis will also allow BTC and ETH to communicate with a similar amount of ease in the case of EGLD and ESDTs. Where the DeFi protocols and various ecosystem products are concerned, it will be made possible to incorporate them, opening the doors for users to scour fresh avenues inside the ecosystem.\n\nWhat is highly significant at this point is that from here on, the portal will be coming with two varying types in the case of BTC, as well as ETH, which will be the conventional network and ESDT. In both cases, they will be identifiable with the help of their log and their name. Where the conventional ones are concerned, they can’t function on the MultiversX network, whereas in the case of the ESDT, which has been shifted with the help of the bridge, will be able to gain from the advantages provided in the form of the network’s abilities, as well as the options provided by the ecosystem.\n\nThe imminent future will be witnessing the overall growth of MultiverseX. This will also be in the case of all of the connected users, as well as the developers, the protocol scaling, along with the fresh products, in terms of having interoperability with multiple chains and assets, which the MultiversX Bridge duly provides."
    }
]