[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vd3d3LmxlZGdlci5jb20vYWNhZGVteS9ldGhlcmV1bS1zdGFraW5nLWhvdy10by1zdGFrZS1ldGjSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Staking: How To Stake ETH Securely - Ledger",
        "content": "Ethereum Staking: How To Stake ETH Securely\n\nBy Emily\n\nRead 13 min Beginner\n\nSHARE\n\nKEY TAKEAWAYS: — Crypto staking is a key aspect of how Proof-of-Stake blockchains like Ethereum stay secure: To validate transactions, users must lock up 32ETH which acts as collateral if they behave badly, but they also receive rewards as an incentive to behave honorably.\n\n\n\n— All methods of staking ETH involve earning crypto rewards, but some ETH staking methods offer higher rewards than others.\n\n\n\n— Whichever staking method you choose, it’s important to DYOR, as staking can involve centralization risks, smart contract risks and more.\n\nDid you know your cryptocurrency can do more than just rest in your digital wallet?\n\nWelcome to the realm of crypto staking, where you can generate passive income on your crypto funds.\n\nYou might be thinking “Great! Free ETH! What’s the catch?” and, while there isn’t exactly a catch, it’s not as simple as meets the eye. For starters, crypto staking isn’t just for passive income, it’s for actively contributing to the security and operations of a proof of stake blockchain network.\n\nStaking provides the security model for Proof-of-Stake (PoS) networks like Ethereum. Put simply, participants lock up a certain amount of their cryptocurrency holdings, known as a “stake”. Then these funds act as collateral allowing them to validate transactions. If they behave well, they receive rewards and if they behave badly, their stake is slashed. This keeps the network safe and secure. But there’s a bit more to it than that.\n\nBefore you dive into staking all your ETH, it’s essential to unravel the mechanics that power it. In this article, Ledger Academy will take you through exactly how staking on Ethereum works, the benefits and risks, and how to stake ETH securely.\n\nEthereum Staking: What Is it About?\n\nEthereum is the second most popular blockchain today. In fact, since its transition, it’s the most popular network using a Proof-of-Stake consensus. Plus, since the network is so popular and it supports smart contracts, it’s perfect for – not just native staking – but all sorts of staking apps and platforms. As such, Ethereum’s staking ecosystem is huge and multifaceted.\n\nThe Ethereum Proof-of-Stake system works like many others on the surface. To become a validator, you must stake 32ETH and the funds act as collateral. If you attempt to undermine the system or fail to validate accurately and reliably, you risk losing their staked ETH investment. The staking requirement encourages validators to act in the network’s best interests.\n\nThe reason so many people stake ETH is to earn a passive income. To explain, becoming a validator, or even just funding one, doesn’t require high-performance hardware. So you can start earning rewards with ease.\n\nBut before we get into the technicalities, let’s go back to the beginning and explore the origins of Ethereum staking.\n\nHistory of Staking on Ethereum\n\nStaking on Ethereum was not always possible. At its inception, Ethereum relied on a Proof-of-Work consensus mechanism, similar to how Bitcoin functions. However, in September 2022, it transitioned to its current mechanism; Proof-of-Stake.\n\nThis was no easy feat. To make the transition, it relied on the creation of a new chain; the Beacon chain. This new Proof-of-Stake chain started out by accepting blockchain transactions from the original proof-of-work Ethereum network. However, to achieve enough decentralization to support the entire network securely, it needed more validators. So, while the beacon chain amassed these new validators, it only allowed the validators to stake and not withdraw. This guaranteed an increase in validators.\n\nBy September 2022, the Proof-of-Stake chain had gathered enough validators to support the whole Ethereum network in a decentralized manner. So the existing Ethereum clients deactivated their mining, block propagation, and consensus logic and these tasks henceforth became the responsibility of the Beacon Chain. Meanwhile, this PoS chain joined together with the rest of the original Ethereum network in an event known as the Merge.\n\nWhile Ethereum used the Proof-of-Stake consensus mechanism from that point onwards, the transition was only finalized in April 2023 with the Shanghai upgrade. This important network event finally allowed validators to withdraw their staked ETH and cash out on the rewards.\n\nToday Ethereum works as a fully-fledged Proof-of-Stake chain, meaning you can stake and unstake ETH as you’d like.\n\nHow Does Staking Work On Ethereum?\n\nThere are a few key stages of staking on Ethereum: Staking, validating transactions, receiving rewards or punishments, and then unstaking your ETH. Here’s how it works:\n\nStaking Your ETH\n\nStaking on Ethereum involves participating in a process that helps secure the network and validate transactions. For starters, any user who wants to become a validator must generate a key pair, a private and public key. These are known as their “validator keys” and they are responsible for identifying the validator and handling reward collection. It’s these keys that any validator will need to sign messages and participate in consensus activities.\n\nFrom there, the user must lock up a minimum of 32ETH in a special smart contract called a “deposit contract”. This initiates the validator’s participation in the staking process.\n\nHere’s where it gets a little technical. Earning Ethereum staking rewards involves validating transactions. So how does that work exactly?\n\nValidating Transactions\n\nOn the Ethereum network, time is measured in Epochs, which typically last 6.4 minutes. Each epoch has its own validator set, determined by which validators stake the most ETH. Each of these epochs consists of smaller time increments called slots, which typically last around 12 seconds.\n\nWithin these 12-second periods (or slots) validators take turns in proposing blocks. When it’s a specific validator’s turn, they gather transactions under a new block header, then sign them with their validator key. If there are no blocks proposed within a specific slot, the validators attest to the validity of blocks proposed by other validators. To do so, they use their validator keys to sign their support for the block’s validity—just like they would propose a block.\n\nAt the end of each epoch, the validators receive their rewards (or punishments) and the active set rotates. This means new validators with enough stake get their chance to propose blocks and receive rewards, while poorly performing validators are removed from the set. This encourages decentralization, as it ensures no single validator has too much power.\n\nETH Staking Rewards and Punishments\n\nThe amount of ETH staking rewards isn’t fixed and can vary depending on the number of validators participating at any given time. When there are fewer validators, the protocol increases rewards to encourage more people to stake.\n\nThen slashing, on the other hand, is a severe penalty aiming to punish ineffective validators. To explain, if a validator’s stake is slashed, it means they lose a portion of their staked funds, and could even lose their role as a validator. These penalties are awarded to validators who propose and sign two different blocks for the same slot, attest to a block surrounding another one, or if they “double vote” two different candidates for the same block. In these instances, 1/32 of a validator’s staked Ether is immediately burned, and a 36-day removal period begins, during which their stake gradually reduces.\n\nUnstaking ETH\n\nSo, now you’ve been validating transactions and earning rewards, but what about withdrawing your staked ETH and rewards? If you want to actually use your rewards, you’ll have to withdraw your stake. So how does that work?\n\nWell, firstly, you must give the system an address to send your stake, and your rewards to. While some validators set this up when staking in the first place, others didn’t, so this is a key step if you actually want to reap those rewards.\n\nNext, you have to initiate the unstaking process, because unfortunately, you can’t just withdraw your stake then and there. A validator who would like to withdraw their stake on Ethereum, must first submit a withdrawal request to the network. Then, they must wait out the “withdrawal period”, consisting of a minimum of four epochs. After enduring this withdrawal period, validators may move into the exit queue, but this may take some time, as only 16 validators may exit within each epoch. That means if lots of validators want to withdraw their stake at once, they may wait a while in the exit queue.\n\nIt’s important to note that once you initiate this process, you will no longer have the power to process or validate transactions and you will stop receiving rewards. That said, once the process is complete, you’ll receive your stake back along with all of your rewards.\n\nWays to Stake ETH\n\nSo now you know all about how staking works on Ethereum, how about staking ETH yourself? Well, there are actually a few different ways to stake ETH and not all of them require a 32ETH investment either. If you want to earn passive income by securing the second most popular blockchain network of all time, there are a few different ways to do so.\n\nSolo Staking\n\nTaking part in solo staking (also known as native staking) means becoming a validator yourself. Essentially, it is a way to participate by helping to validate transactions and secure the network. Instead of relying on others to do this job, you take on the responsibility yourself, and earn all of the rewards that come with it.\n\nTo become a solo staker, you need to invest a minimum of 32 ETH. This acts like collateral to make sure you validate transactions effectively. But that’s not all you will need. You’ll also need a computer that is connected to the internet all the time. This computer must run the Ethereum client, which is essentially the software containing the whole blockchain’s information. If the computer you use doesn’t perform correctly, your stake could be slashed. This means solo staking comes with the burden of responsibility, plus, the barrier to entry is quite high.\n\nThat said, Solo staking on Ethereum represents the gold standard for staking. While it comes with more responsibilities than other methods, it also comes with much bigger rewards. Taking on the staking job yourself means you don’t have to share those precious rewards with any other participants.\n\nHowever, if ongoing responsibility sounds too much for you, it’s not your only option.\n\nStaking as a Service\n\nStaking as a Service allows you to delegate the staking process to a third-party provider, meaning you can earn rewards without managing your own validator node. This is also known as “funding a validator” and it allows you to leave the more technical aspects of staking to someone else, while enjoying the benefits of native block rewards. With this type of staking, you will still need to set up your validator credentials, generate your keys, and deposit your 32 ETH. However, from there, the service will validate transactions on your behalf.\n\nWhile it offers convenience, this type of staking also involves trusting a validator with your funds. If they behave badly, your rewards will be slashed too.\n\nOf course, fees are another aspect to take into account. To explain, the entity offering this service is doing so to make money themselves. Like any business, they will be using your funds to make a profit. This means you might not be getting proportional rewards to your stake.\n\nThat said, there are countless trusted staking as a service providers that help non-crypto natives earn passive income on their investments, and some are known to be rather lucrative. Rewards with these services are much better than using staking pools.\n\nWhile this method is much more hands-off than native (solo) staking, it still has a big barrier to entry, as not everyone has 32ETH to fund a validator with.\n\nSo what about methods of staking that don’t require as big an investment?\n\nPooled Staking\n\nLike funding a validator, pooled staking allows individuals to earn staking rewards without the need for extensive technical knowledge or running their own validator node. However, it also doesn’t require a 32ETH investment.\n\nInstead of staking alone, you can also team up with other individuals. With this method, the participants can contribute any amount of cryptocurrency to a staking pool. Then the pool’s operator uses the shared funds to participate in native staking. When the operator receives the rewards, it then distributes them to the staking pool participants relative to their initial stake.\n\nUnder the pooled staking umbrella comes another interesting sub-category; liquid staking. To explain, some pooled staking platforms offer users tokens in return for their investment. These ERC-20 tokens are known as liquid staking tokens (LSTs) and they are pegged to the value of the initial asset, meaning stakers can still use their locked-up funds in DeFi platforms and blockchain apps. This is a key benefit as most other types of staking require you to lock up funds in a way you can’t use them.\n\nWhichever pooled staking method you use, it’s important to consider the disadvantages. For example, pooled staking requires stakers to trust the pool’s operator. If the operator doesn’t validate transactions correctly, it impacts all of the participant’s rewards. Another aspect to consider is the pool’s trustworthiness. Many staking pools use smart contracts to pool users’ funds, however this poses a risk. If there is a bug in the contract, bad actors could exploit the weakness and potentially access the pool’s funds.\n\nCentralized Exchange Staking\n\nCentralized exchange staking involves the practice of depositing your cryptocurrency assets on a centralized exchange platform to participate in staking activities and earn rewards. This approach offers a convenient alternative to pooled staking, but it also comes with its own risks.\n\nOn centralized exchanges, you’re generally forced to use the platform’s custodial wallets. This means they retain ownership of the private keys attributed to your account, and therefore custody over your assets. This can cause a problem if the exchange shuts down or closes their staking operations. In this case, you’re trusting the platform to pay out your rewards and give you access to your funds—which may not always happen.\n\nBenefits of Staking Ether\n\nSo now you know all of the different methods of Staking on Ethereum, but what about the benefits?\n\nPotential for Passive Income\n\nThe primary advantage of staking Ether is the opportunity to earn passive income. When you stake Ether on the network, you contribute to the validation and security of transactions, and in return, you receive rewards. These rewards are an incentive for participants to actively support the Ethereum network, making staking a means of generating ongoing income without actively trading or investing in other assets.\n\nRelative Network Stability\n\nStaking Ether is also less risky than staking other crypto assets, as its popularity means it’s less volatile than some other cryptocurrencies. As the second most popular network, Ethereum boasts stability, global adoption, and robust security that sets it apart.\n\nRisks of Staking Ether\n\nStaking Ether comes with its fair share of considerations.\n\nFluctuation Is Inevitable\n\nEven the most stable cryptocurrencies still face market fluctuation, which can significantly impact your staking rewards. For example, if you decide to stake ETH and the price falls, the rewards you receive for staking might not cover the loss from the volatility.\n\nLimited Control of Your Crypto\n\nNext, as long as you’re not participating in liquid staking specifically, your liquidity is essentially locked-up for a period of time, meaning that you won’t have immediate access to those funds. This can be less than ideal when dealing with volatility or market uncertainty.\n\nTrust in Your Staking Platform\n\nFinally, the biggest risk of staking ETH is the platform you choose. Native (solo) staking on Ethereum is generally considered safe—its protocol is well and truly battle-tested. However, other methods of staking come with their own risks. As mentioned, centralized exchanges are controlled by a single entity and retain custody of your funds. Then more decentralized options, like pooled staking use smart contracts, which could potentially be exploited should they have a bug. As a result, it’s crucial to thoroughly research and choose reputable platforms that prioritize the features that align with your risk tolerance and investment goals.\n\nHow to Stake ETH\n\nStarting Your Ethereum Staking Journey\n\nBefore you start staking, one of the most important parts of the journey lies with research and analytics. It’s good practice to keep a record of how profitable your staking experience is, if at all. Remember—cryptocurrencies are volatile assets, and Ether is no exception.\n\nWhen taking so many variables into account, you might find a staking reward calculator handy. This valuable tool can give you insightful projections of the rewards you might accrue. All you have to do is input the numbers and these calculators will analyze the financial benefits associated with different staking scenarios.\n\nAfter that, all that’s left is choosing the method for you, so let’s explain how to stake ETH:\n\nHow to Solo Stake ETH\n\nGetting started with solo staking within the Ethereum network involves several key steps to ensure a smooth and secure process.\n\nFirst, you’ll need to buy some hardware. It is possible to run a validator node on a normal computer, but for peak performance, it’s recommended to dedicate one piece of hardware to validating transactions. From there you’ll have to install the Ethereum “client”, which is essentially the software that runs the Ethereum blockchain. If you have command line knowledge, you can set it up for yourself. Otherwise, you can use Dappnode to set it up for you.\n\nNext you need to sync both a consensus layer client (concerned with maintaining agreement on the state of the blockchain) and an execution layer client (one that deals with smart contract and app transactions on Ethereum Virtual Machine). This means your computer has to update to the most recent copy of the Ethereum blockchain. From there you’ll need to generate your validator keys and deposit 32 ETH to the deposit contract address. This activates your node, which you can monitor and control using your validator keys. For more information, make sure you check out the Ethereum.org docs on how to run a node.\n\nIf that seems a little complicated for you—fear not. It’s much easier to stake ETH directly through the Ledger Ecosystem.\n\nHow to Stake ETH with Ledger\n\nThe Ledger ecosystem offers several staking options for you to choose from. So, no matter if you have a lot of ETH or just a little, there’s an easy staking solution for you. Plus, when staking through the Ledger ecosystem you also get to keep custody of your keys, which is not currently possible via centralized staking platforms.\n\nWith Ledger Live, you have a few options to begin earning ETH rewards passively.\n\nYour first option is securely and effortlessly fund a validator Kiln. To get started, launch the Ledger Live app, connect your Ledger device, and head to the discover tab. You’ll be able to choose the amount of ETH you want to stake (just remember it needs to be a multiple of 32). Plus, Kiln will take you through all the necessary steps, including setting up your validator credentials and uploading your signing keys.\n\nIf you don’t have 32ETH to spare, you can also access a staking pool via the Ledger ecosystem. Through Lido, you can participate in liquid staking, meaning you can stake whatever you can spare and receive stETH, an LST, in return. This ERC-20 token is pegged to the price of ETH, but is also available for use in other protocols, DeFi apps or blockchain apps. Using this method, you can accrue rewards while using these tokens to continue exploring web3!\n\nBasically, whichever option you choose, staking ETH is completely secure within the ecosystem.\n\nYour ETH Staking Journey\n\nAlthough staking is exciting, it’s important to remember to DYOR. Doing this helps you make smart choices and avoid potentially expensive mistakes. Staking comes in many shapes and forms, and each of them have different requirements, risks and rewards. Choosing which method aligns with your strategy is imperative if you want to navigate the ETH staking space securely.\n\nOf course, if you’re accruing ETH rewards, keeping those safe is of the utmost importance too. Luckily, staking ETH through the Ledger ecosystem means you can benefit from the security of your Ledger device while knowing you can access staking apps directly from Ledger Live. This secure connection and the trusted display on your device allows you to check the validity of any staking transaction before you dive in. Plus, you can rest easy knowing that the keys that control your account will stay safe and offline within the Secure Element chip.\n\nEthereum staking opens up exciting opportunities and rewards, but only you have the power to control how you accrue them. Only you have the power to stake ETH however you see fit; because that’s what true self-custody is about."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA5LzEwLzEteWVhci1sYXRlci13aGF0LWhhdmUtd2UtbGVhcm5lZC1mcm9tLWV0aGVyZXVtLWFuL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Sep 2023 07:00:00 GMT",
        "title": "1 Year Later, What Have We Learned From Ethereum and The Merge? - The Motley Fool",
        "content": "On Sept. 15, Ethereum (ETH -1.02%) will celebrate the one-year anniversary of The Merge -- a technological tour de force that was easily one of the most hyped and anticipated events of 2022 for the crypto market. One year ago, investors salivated at the thought of what impact The Merge might have on Ethereum's future price.\n\nBut guess what? Ethereum is still trading under $1,650, at almost exactly the same price that it was 12 months ago. This raises an interesting question: What exactly have we learned from Ethereum and The Merge? And how can those lessons be applied when evaluating other cryptocurrencies? Let's take a closer look.\n\nTech upgrades\n\nPerhaps the biggest lesson here is that tech upgrades, no matter how big, do not always lead to huge price increases. This is an important point to keep in mind, based on how much hype many of these tech upgrades get. They are usually presented as major catalysts capable of sending a crypto soaring. But the truth might be quite different.\n\nWhat's interesting in the case of Ethereum is that The Merge was a truly transformational change and theoretically should have had a dramatic impact on Ethereum's price. The Merge transformed Ethereum from an old, energy-intensive, proof-of-work blockchain into a modern, energy-efficient, proof-of-stake blockchain. So, The Merge was a very different type of event than a typical annual upgrade that many blockchains undergo, and yet it still didn't have an appreciable impact on Ethereum's price.\n\nFrom my perspective, it means that the \"tech upgrade = growth catalyst\" investment thesis is no longer useful for evaluating cryptocurrencies. Going forward, you can pretty much assume that either the market is going to price in these upgrades as they are announced or the market is going to ignore the upgrade entirely. So, trying to time your investment decisions around key upgrades is not likely to be an effective strategy.\n\nRegulatory risk\n\nThe second big lesson from The Merge is that new business models can lead to new regulatory headaches. As soon as Ethereum became a proof-of-stake blockchain, it meant that there was going to be much more of a focus on crypto staking, which is the process of \"locking up\" your crypto in exchange for a financial reward. Until The Merge, crypto staking was a sleepy backwater of the crypto industry. But after The Merge, everyone was trying to figure out how to capture those financial rewards.\n\nAnd that included, unfortunately, the Securities and Exchange Commission (SEC). From the perspective of SEC chairman Gary Gensler, new crypto-staking products sounded a lot like securities, and he vowed to take a closer look. In February, the SEC ended up going after cryptocurrency exchange Kraken for its crypto-staking activities, and that immediately got the attention of the market. Right now, Coinbase Global (COIN 1.38%) is locked in an epic battle with the SEC over the future of crypto staking.\n\nIf you parse through all the filings, documents, and back-and-forth between market participants and regulatory authorities, it sounds a lot like the SEC is not so much opposed to the concept of staking as it is to the way staking is marketed to retail investors, who might think it's a no-brainer, no-risk guaranteed return of some kind. But still, if you're an investor in Ethereum, you have to be aware that some regulatory risk does exist here, and it was all brought about by a change in business model (i.e., the shift from mining to staking).\n\nMacroeconomic outlook\n\nThe third big lesson is that the macroeconomic outlook matters more for crypto than many of us would like to admit. Gone are the days when the crypto market was completely separate from traditional, mainstream financial markets. With a surge of new institutional money into crypto comes a surge of institutional thinking about the crypto market. And that means a 24/7 obsession with the macroeconomic outlook.\n\nThus, while 2023 should have been all about the new era of Ethereum 2.0, it has instead been all about regional bank crises, Federal Reserve policy, jobs data, and inflation data. Long story short, there is absolutely no way Ethereum is going to skyrocket in price if banks are failing, inflation is surging, and economic growth is anemic. This completely changes the game for many crypto investors, who need to take a much more holistic view of the financial markets into account when choosing where to invest.\n\nA framework for analyzing cryptocurrencies\n\nTaken together, these three lessons can offer the basic framework for evaluating just about any cryptocurrency. First, make sure you understand the underlying business model of a crypto. Next, layer in some macroeconomic analysis, with a focus on key events or metrics that are being watched by the biggest institutional investors. And only then can you start to focus on all the interesting features of a new tech upgrade. In short, the tech upgrade is just the cherry on top of the final dessert, not the main course.\n\nAnd Ethereum? I'm still bullish on this crypto, even if it hasn't taken off the way it was supposed to one year ago. It's still up 35% for the year, and recent developments seem to suggest that institutional investors are adding to their Ethereum positions. But I'm not trying to time the market around new tech upgrades. Instead, I'm investing in Ethereum because I have confidence in its long-term growth prospects."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1jb3VsZC1kZWNsaW5lLWhlYXZpbHktMTYwMC_SAU1odHRwczovL3d3dy5uZXdzYnRjLmNvbS9hbmFseXNpcy9ldGgvZXRoZXJldW0tY291bGQtZGVjbGluZS1oZWF2aWx5LTE2MDAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Sep 2023 07:00:00 GMT",
        "title": "This Confluence Of Bearish Factors Shows Ethereum Could Decline Heavily - NewsBTC",
        "content": "Ethereum price failed to settle above $1,650 and trimmed gains against the US Dollar. ETH is now trading in a bearish zone and could decline heavily.\n\nEthereum peaked near $1,670 and started a fresh decline.\n\nThe price is trading below $1,650 and the 100-hourly Simple Moving Average.\n\nThere is a key bearish trend line forming with resistance near $1,620 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could gain bearish momentum if there is a close below $1,600 and $1,580.\n\nEthereum Price Turns Red\n\nEthereum’s price attempted a fresh increase above the $1,620 pivot level. ETH even broke the $1,650 resistance but the bears were active near the $1,670 level.\n\nAs a result, the price failed to continue higher and started a fresh decline below $1,650, like Bitcoin. There was a downside break below the $1,620 level and the 100-hourly Simple Moving Average. The price even retested the $1,600 support zone.\n\nA low is formed near $1,600 and the price is now consolidating losses. Ether is now trading below $1,650 and the 100-hourly Simple Moving Average. Besides, there is a key bearish trend line forming with resistance near $1,620 on the hourly chart of ETH/USD. The trend line is close to the 23.6% Fib retracement level of the downward move from the $1,669 swing high to the $1,600 low.\n\nOn the upside, the price might face resistance near the $1,620 level and the trend line. The next resistance is near the $1,635 level or the 50% Fib retracement level of the downward move from the $1,669 swing high to the $1,600 low.\n\nSource: ETHUSD on TradingView.com\n\nThe first major resistance is near $1,650, above which the price could rise toward the $1,670 level. The next major hurdle is near the $1,700 level. A close above the $1,700 level might send Ethereum further higher toward $1,750.\n\nDownside Break in ETH?\n\nIf Ethereum fails to clear the $1,620 resistance, it could start another decline. Initial support on the downside is near the $1,600 level.\n\nThe first key support is close to $1,580. The next key support is $1,540. A downside break below $1,540 might start a major decline toward $1,450. If there is a downside break below $1,450, the price could test the $1,320 support level.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is slowly gaining momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 level.\n\nMajor Support Level – $1,600\n\nMajor Resistance Level – $1,650\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldmFsdWF0aW5nLXRoZS1zdGF0ZS1vZi10aGUtZXRoZXJldW0tbmV0d29yay1hbmQtZXRocy1jdXJyZW50LWRlbWFuZC1sZXZlbHMv0gFmaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2V2YWx1YXRpbmctdGhlLXN0YXRlLW9mLXRoZS1ldGhlcmV1bS1uZXR3b3JrLWFuZC1ldGhzLWN1cnJlbnQtZGVtYW5kLWxldmVscy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Sep 2023 07:00:00 GMT",
        "title": "Evaluating Ethereum’s network and ETH’s current demand levels - AMBCrypto News",
        "content": "Ethereum’s TVL continued bleeding as the market extended its uncertainty.\n\nETH’s ecosystem maintained some health and top whales have been buying the dip.\n\nThe crypto market just concluded another one of its most dormant weeks so far in 2023. Ethereum [ETH] and other top networks have experienced a significant slowdown in activity as is usually the case under such circumstances.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nThe impact of the current market conditions was evident in multiple facets of the Ethereum network. This includes its TVL, which was a long way from its historic high. It had a total value locked of $21.42 billion at the time of writing, which is a stark contrast compared to its historic peak above $108 billion in 2021.\n\nDespite the slightly improved conditions so far this year, the market is still in a state of caution. As such, we have seen significant outflows in TVL since April. An indication that investor confidence in ETH’s bullish potential is not there yet.\n\nRegardless of the slow and negative TVL growth in the last few months, there are some areas in ETH’s journey this year that inspire some more confidence. For example, Ethereum’s total value locked in ETH deposit contracts just achieved a new historic peak at over 28.7 million ETH.\n\n? #Ethereum $ETH Total Value in the ETH 2.0 Deposit Contract just reached an ATH of 28,734,846 ETH View metric:https://t.co/SzbMPqvhlb pic.twitter.com/eiDkE5DVw4 — glassnode alerts (@glassnodealerts) September 9, 2023\n\nThe total value locked also confirms that Ethereum’s ecosystem is still experiencing healthy network activity. But how is ETH fairing especially as the market appears to be stuck in limbo?\n\nETH supply distribution reveals something interesting about whale activity\n\nNow that ETH’s total value is up, let’s take a look at what has been happening with whale activity. According to its supply distribution metric, addresses holding over 10 million ETH (denoted in red) have been accumulating in the last 4 weeks. This category controls the largest share of ETH’s circulating supply at 23.55%.\n\nAddresses in the 10,000 to 100,000 ETH category have also been accumulating ETH since the start of September. However, the other top whale categories have been contributing some sell pressure which may explain why the sell pressure has been canceling out the prevailing demand.\n\nRead about ETH’s price prediction for 2024\n\nSo, what’s next for ETH?\n\nETH’s price action has been stuck at its current support level since the start of September. It exchanged hands at $1,633 at press time.\n\nETH’s money flow indicator already shows that liquidity has been flowing into ETH. In other words, there has been some accumulation within the current support zone, highlighting the gradual return of optimism. However, caution is still warranted since the market is not out of the woods yet."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvcGVvcGxlLWN1bHR1cmUvYWxtb3N0LTcwMDAwMC13YXMtc3RvbGVuLXRocm91Z2gtYS1tYWxpY2lvdXMtbGluay_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Sep 2023 07:00:00 GMT",
        "title": "Ethereum co-founder Vitalik Buterin's X account compromised as over $700000 drained via suspicious link - DLNews",
        "content": "Buterin’s account contained a link that claimed to celebrate a moment with a “commemorative NFT” that could be collected free for the next 24 hours.\n\nCrypto has continued to be plagued by hacks in 2023, as scammers have stolen more than $700 million.\n\nEthereum co-founder Vitalik Buterin’s account on the X, formerly Twitter, social media platform was compromised in a phishing attack, according to blockchain security and data analytics firm PeckShield.\n\nA post that included a phishing link was shared via Buterin’s X account. Users were encouraged to claim a “commemorative NFT” via the link, which said it could be collected free for a limited time — the next 24 hours. Once minted users accounts were hacked, causing them to lose funds and NFTs.\n\nThe post has since been deleted, but not before the link drained cryptocurrencies and NFTs worth over $700,000.\n\nIssues with the post were brought to light around midnight London time on Saturday, by PeckShield. The firm warned users not to click on the phishing link in the post, which claimed to celebrate proto-danksharing coming to Ethereum\n\nStay ahead of the game with our weekly newsletters Subscribe\n\nPlease do *NOT* click the phishing link pic.twitter.com/sPK7cTAwVw — PeckShield Inc. (@peckshield) September 9, 2023\n\nPseudonymous blockchain investigator ZachXBT said more than $691,000 was stolen from those who clicked on the link, including the CryptoPunk #3983 NFT, which was worth about $250,000. The wallet address associated with the hack has since been flagged as suspicious on the block explorer and analytics platform Etherscan.\n\nThe wallet made its first transaction several hours before the post was made on Buterin’s account. It interacted with a Pink Drainer wallet which has been reported on Etherscan as being involved with a wallet drainer.\n\nNow read: She lost $80,000 in a crypto romance scam. Now she’s fighting back\n\n“Vitalik’s Twitter account got hacked. Use common sense when reading content on social media, even from large key opinion leaders,” said Binance CEO Changpeng Zhao. “Twitter’s account security is not designed as financial platforms,” he added.\n\nJoin the community to get our latest stories and updates\n\nAccording to the X help center: “Phishing scammers send fraudulent messages to a large number of people, in an attempt to trick them into revealing private information, like a password. An email or website may be disguised to appear legitimate.”\n\nNow read: Top 10 crypto hacks of 2023 — Stake ranks fifth as hackers wipe $735m\n\nThe event comes just a few days after the latest major attack in the crypto space. On Monday, crypto’s biggest online casino, Stake.com, saw $41 million drained from the platform.\n\nHackers have made away with more than $700 million in 2023 across about 70 hacks.\n\nUpdated with additional context after publication, including links to wallet addresses.\n\nMike Millard is DL News’ Weekend Editor, he can be reached at mike@dlnews.com. Adam Morgan McCarthy is DL News’ London-based Markets Correspondent. Got a tip? Reach out at adam@dlnews.com."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vZGVjcnlwdC5jby8xNTU5NjQvZXRoZXJldW0taXMtbG9zaW5nLWZhdm9yLWFtb25nLWluc3RpdHV0aW9uYWwtaW52ZXN0b3JzLWNvaW5zaGFyZXPSAWFodHRwczovL2RlY3J5cHQuY28vMTU1OTY0L2V0aGVyZXVtLWlzLWxvc2luZy1mYXZvci1hbW9uZy1pbnN0aXR1dGlvbmFsLWludmVzdG9ycy1jb2luc2hhcmVzP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Is Losing Favor Among Institutional Investors: CoinShares - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nInstitutions have fallen out of love with Ethereum in 2023, selling upwards of nine digits of the asset in the year to date.\n\nAccording to the latest analysis by CoinShares, the number two cryptocurrency saw $4.8 million in outflows this past week, reaching $108 million in sales this year. That places it as the most sold digital asset by large entities, wrote James Butterfill, head of research for CoinShares.\n\nThe analyst labeled it the “least loved digital asset” for exchange-traded product (ETP) investors, trouncing its second-place holder, Tron, by more than $50 million.\n\nAD\n\nAD\n\nHowever, all that could change soon after Cathie Wood’s Ark Invest applied for the first spot Ethereum ETF last week—the first of its kind in the United States. And that news comes after the network turned inflationary and on-chain activity plummeted as the grueling bear market carries on.\n\nWhat Ethereum has felt this year is broadly based among digital assets, per CoinShares.\n\nSentiment regarding institutions purchasing crypto remains poor, according to their weekly report published this morning. It showed a fourth consecutive week of selling, with outflows totaling $59 million over the past seven days.\n\nThe current run of outflows, wrote James Butterfill, reaches $294 million, representing 0.9% of total assets under management (AUM).\n\nSelling came primarily from North America, with Canada and the United States offloading $17.6 million and $12.3 million in the past seven days. Germany led the way across the Atlantic and into Europe, with $20 million worth of selling.\n\nAD\n\nAD\n\nButterfill told Decrypt that the main reason behind the rampant selling is the U.S. dollar. It has shown strength as of late, driven by the “market’s belief we are in a soft landing scenario,” posting eight straight weeks of green candles.\n\nEven so, he reckons that as the year ends, it will “increasingly be seen that this isn’t the case,” especially if high-interest rates kick in.\n\nAlthough the previous report by CoinShares highlighted a bunch of under-the-surface trading, with volumes skyrocketing by 90% to $2.8 billion, this week's trading activity plummeted.\n\nVolumes “are super low,” revealed Butterfill, averaging “just” $2.3 billion daily over the past month, compared to the yearly average of $7 billion. The last seven days were an even further cry from these numbers, dropping by 73% to $743 million.\n\nThis suggests, the analyst told Decrypt, an “apathetic investor”—clarifying, however, that the market saw a very similar scenario prior to the last two Bitcoin halvings.\n\nBitcoin was the most damaged crypto asset last week, with large entities offloading a whopping $69 million worth of the asset despite being in the green the week prior.\n\nAdding to the bearishness, Bitcoin short products saw the largest weekly inflows since March, with $15 million pouring into these instruments. “Timing wise this is interesting as the inflows in March also came at a time of heightened regulatory uncertainty,” said Butterfill.\n\nWhat’s to come? Butterfill suspects that many investors are waiting to see what the Fed will do this month with interest rates, with any potential weakness in the dollar “likely to be supportive for Bitcoin.”\n\nAD\n\nAD\n\nThe analyst concluded, however, that CPI could come in above expectations due to the swift surge in gasoline prices. He also pointed to FTX, telling Decrypt, \"There are the FTX asset sales ‘stock overhangs’ potentially to deal with too.”"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA5LzExL2V4dHJlbWUtZXRoZXJldW0tY3Jhc2gtbm93LWluLXRoZS1jYXJkcy1hY2NvcmRpbmctdG8tYW5hbHlzdC1iZW5qYW1pbi1jb3dlbi1oZXJlcy1oaXMtdGFyZ2V0L9IBggFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOS8xMS9leHRyZW1lLWV0aGVyZXVtLWNyYXNoLW5vdy1pbi10aGUtY2FyZHMtYWNjb3JkaW5nLXRvLWFuYWx5c3QtYmVuamFtaW4tY293ZW4taGVyZXMtaGlzLXRhcmdldC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Sep 2023 07:00:00 GMT",
        "title": "Extreme Ethereum Crash Now in the Cards, According to Analyst Benjamin Cowen – Here’s His Target - The Daily Hodl",
        "content": "A widely followed crypto analyst says that a massive crash for the leading smart contract platform is within the realm of possibility.\n\nIn a new strategy session, crypto trader Benjamin Cowen tells his 787,000 YouTube subscribers that a freefall to the $400-$800 range is in the cards for Ethereum (ETH), the second-largest crypto asset by market cap.\n\n“There’s a good chance that [there will] be a lower low, and it might not be a much lower low, maybe it just goes down to just below $800. It could go lower. It could go to $600 or $500 or $400, but that is in the cards for Ethereum.”\n\nCowen also says that a move toward his downside targets would mark 2023 as the year when both ETH bulls and bears got “sufficiently wrecked.”\n\n“You could have a move where it sort of just slowly fades with some occasional pumps back up to the upside just to get everyone excited, and then down into the end of the year and then pop back up, right.\n\nIt could do something like that – where it puts in a low, it puts in a high it then sweeps the high, and then sweeps the low. That way, by the end of the pre-halving year, both the bulls and the bears are sufficiently wrecked.\n\nThen you went through the whole year and both sides thought they were right for the whole year, but they were really right for only half the year and the other side was right for the other half of the year, but by the end of the year, everyone’s wrecked.”\n\nThe crypto strategist goes on to say that for the rest of 2023, he expects Ethereum to post lower highs and lower lows.\n\nEthereum is trading for $1,609 at time of writing, a 1.2% decrease during the last 24 hours.\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney\n\nShutterstock/Tomasz Makowski"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA5LzExLzY5MWstc3RvbGVuLWFzLWhhY2tlcnMtdGFrZS1vdmVyLXZpdGFsaWstYnV0ZXJpbnMteC1hY2NvdW50L9IBbWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA5LzExLzY5MWstc3RvbGVuLWFzLWhhY2tlcnMtdGFrZS1vdmVyLXZpdGFsaWstYnV0ZXJpbnMteC1hY2NvdW50L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Sep 2023 07:00:00 GMT",
        "title": "Hack of Vitalik Buterin's X Account Leads to $691K Stolen - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmJpdHJhdGVzLmNvbS9uZXdzL3AvYml0Y29pbnMtaGFsdmluZy1hbmQtZXRoZXJldW0tMjAtbWF5LWNhdGFseXplLXRoZS1tb3N0LWV4cGxvc2l2ZS1idWxsLXJ1bi10by1kYXRl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin's Halving and Ethereum 2.0 May Catalyze the Most Explosive Bull Run to Date - Bitrates",
        "content": "If there's a truth about the crypto market that rookie and experienced investors can agree upon, it's confusing to grasp and full of surprises.\n\nWith external factors such as market sentiment and interest rates influencing how cryptocurrencies' trajectories evolve, more is needed than price predictions and a basic understanding of the area to make better-informed decisions.\n\nBull runs have always been long-debated, with camps being split into two categories. Some attest that bull runs are inevitable, always following bear markets. On the other hand, other investors are put off by remarkable price declines, shifting their focus towards other alternatives when cryptocurrency values drop. While the market was marked by falling prices last year and saw investors rush to get rid of their crypto holdings, the same can't be said about the current times.\n\nCryptocurrencies like Bitcoin and Ethereum got off to a strong start in 2023, and many are struggling to re-break psychological marks already reached since the beginning of the year.\n\nExperts consider the last year to be the worst bear market so far. While it may be difficult to believe that the next bull run will be the most explosive one so far, considering the market's poor performance last year, some signs and upcoming events may prove the opposite.\n\nMany experts believe the anticipated bull run will surpass the ones witnessed throughout history. Bitcoin halvings are generally connected to bull runs, while the launch of Ethereum 2.0 is poised to have a transformative impact on the market. Here's what one should anticipate and the insights underpinning this brave prediction.\n\nBitcoin halving\n\nGenerally, Bitcoin halvings have a history of preceding bull runs. They happened a year before remarkable bull markets emerged and tended to display different trends, with certain sectors overtaking others. So far, all three Bitcoin halvings, namely those in 2020, 2016, and 2012 have preceded bear markets in the following years, namely 2013, 2017, and 2021. If the pattern continues, we could expect another growth market by the end of 2024 and well into 2025, pushing investors and traders to accumulate cryptocurrencies and take a different approach than the one that's been reticent and negative towards the cryptocurrency market. This increase may bring the cryptocurrencies' values to staggering heights, improving market sentiment and rewarding those who have bought the dip in hopes of a market recovery.\n\nBear markets don't emerge out of the blue, and it's impossible to predict with complete accuracy whether they will retake place or when they may happen. Generally, they are a consequence of the fact that Bitcoin rewards are cut in half, which limits the selling pressure from miners and leads to supply scarcity. This may boost demand if investors think the minimized supply will bring prices up in the future. Additionally, halving events create a lot of buzz and are embraced by plenty of media coverage, which boosts the audience's interest in digital currencies.\n\nAre halvings vital for bull runs?\n\nWhile past bull markets are historically associated with the three Bitcoin halvings that have occurred so far, which have played a critical role in triggering significant price surges, these phenomena aren't imperative for bullish momentum. The four-year cycle theory may be widely recognized as a catalyst for bull runs. Still, it's critical to understand that more external factors regarding the market's progress are coming into play.\n\nThe market is nowadays abounding with different tokens and coins, each with distinctive features, use cases, and cycles that work regardless of how Bitcoin is doing. Such wide variety has paved the way for profits and growth beyond the leading coin and its four-year cycles, with different subcategories like NFTs and DeFi yield farming.\n\nSome cryptocurrencies may explode at the same time that others stagnate, so a bull run isn't guaranteed to cover every asset. For instance, the meme coin Pepe has witnessed impressive, bullish momentum while most other cryptocurrencies stood still. This example outlines how market dynamics move, enabling different projects to evolve independently of Bitcoin's evolution.\n\nTherefore, it's essential to stay up-to-date with changing regulatory landscapes, media coverage, investor sentiment, and other elements that impact how price trajectories are moving, as well as monitor the market and take advantage of the tools the DeFi world provides for better decision-making.\n\nEthereum 2.0\n\nWhile Ethereum 2.0 was projected to debut sometime now, the final technicalities are yet to be completed, postponing its launch to a later date expected in 2024 or by the end of 2023 in the best-case scenario. After sharding, Ethereum is expected to improve energy efficiency, security, and scalability significantly. Its roadmap includes adjustments and changes that will transform and make the network better performing and more accessible. On the contrary, despite all the enhancements, it is not anticipated that the transition will address the network's high gas fees right away. Some upgrades' effects are seen after a while, taking time to show results.\n\nAnalysts and pundits believe Ethereum 2.0 may kickstart a bull run and boost the coin's appeal as the existent supply will be cut, and it will adopt a \"net-deflationary\" nature. The debut of Ethereum 2.0 may attract the attention of more investors and traders, including financial institutions and large Ethereum holders (whales). Large amounts may be accumulated in the pre-launch period, boosting demand and fueling prices.\n\nThe upcoming network improvements will likely draw in more users, developers, and investors, positively impacting the coin's performance and the whole crypto market. Predictions are that Ethereum 2.0 may fuel a bull run similar to Bitcoin's halving and that the two poster coins will pave the way for what's expected to be the most remarkable bull runs in history.\n\nFinal words\n\nEthereum 2.0 represents a highly anticipated and transformative network upgrade aimed at solving long-standing scalability challenges while sending Ethereum into a new era of growth. Bitcoin's halvings, on the other hand, have to date been linked to bull markets, validating the principles of the four-year cycle theory.\n\nThe two top-performing cryptocurrencies are set to undergo significant transformations that may potentially enhance the overall market's dynamics, so keep an eye on the trends to better understand their performance."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vY29pbmNvZGV4LmNvbS9hcnRpY2xlLzMyMTgyL2V0aGVyZXVtLXByZWRpY3Rpb24tc2VwdGVtYmVyLTExLTIwMjMv0gFNaHR0cDovL2FtcC5jb2luY29kZXguY29tL2FydGljbGUvMzIxODIvZXRoZXJldW0tcHJlZGljdGlvbi1zZXB0ZW1iZXItMTEtMjAyMy8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Sep 2023 07:00:00 GMT",
        "title": "Ethereum is Trading -11.08% Below Our Price Prediction for Sep 16, 2023 - CoinCodex",
        "content": "Disclaimer: This is not investment advice. The information provided is for general purposes only. No information, materials, services and other content provided on this page constitute a solicitation, recommendation, endorsement, or any financial, investment, or other advice. Seek independent professional consultation in the form of legal, financial, and fiscal advice before making any investment decision.\n\nEthereum is down -3.63% today against the US Dollar\n\nEthereum is currently trading 11.08% below our prediction on Sep 16, 2023\n\nEthereum dropped -15.44% in the last month and is down -12.19% since 1 year ago\n\nEthereum price $ 1,566.97 Ethereum prediction $ 1,762.13 (9.24%) Sentiment Bearish Fear & Greed index 40 (Fear) Key support levels $ 1,606.73, $ 1,592.35, $ 1,574.19 Key resistance levels $ 1,639.28, $ 1,657.44, $ 1,671.82\n\nETH price is expected to rise by 9.24% in the next 5 days according to our Ethereum price prediction\n\nis trading at $ 1,566.97 after losing -3.63% in the last 24 hours. The coin underperformed the cryptocurrency market, as the total crypto market cap decreased by -3.82% in the same time period. ETH performed poorly against BTC today and recorded a -1.43% loss against the world’s largest cryptocurrency.\n\nAccording to our Ethereum price prediction, ETH is expected to reach a price of $ 1,762.13 by Sep 16, 2023. This would represent a 9.24% price increase for ETH in the next 5 days.\n\nETH Price Prediction Chart\n\nBuy/Sell Ethereum\n\nWhat has been going on with Ethereum in the last 30 days\n\nEthereum has been displaying a negative trend recently, as the coin lost -15.44% in the last 30-days. The medium-term trend for Ethereum has been bearish, with ETH dropping by -9.87% in the last 3 months. The long-term picture for Ethereum has been negative, as ETH is currently displaying a -12.19% 1-year price change. On this day last year, ETH was trading at $ 1,784.50.\n\nEthereum reached its all-time high price on Nov 10, 2021, when the price of ETH peaked at $ 4,867.17. The current ETH cycle high is $ 2,182.43, while the cycle low is at $ 897.01. ETH has been displaying low volatility recently – the 1-month volatility of the coin is at 4.50. Ethereum recorded 12 green days in the last 30 days.\n\nEthereum technical analysis for today - Sep 11, 2023\n\nThe sentiment in the Ethereum markets is currently Bearish, and the Fear & Greed index is reading Fear. The most important support levels to watch are $ 1,606.73, $ 1,592.35 and $ 1,574.19, while $ 1,639.28, $ 1,657.44 and $ 1,671.82 are the key resistance levels.\n\nBearish sentiment for Ethereum\n\n2 indicators are currently signaling a bullish prediction for Ethereum, while 29 indicators are showing a bearish forecast. With 94% of indicators favoring a negative prediction. This results in an overall Bearish sentiment for Ethereum.\n\nCrypto market is currently experiencing Fear\n\nCurrently, the Fear & Greed index is at 40 (Fear), which signals that investors have a negative outlook on the market. The Fear & Greed index is a measure of sentiment among cryptocurrency investors. A “Greed” reading suggests that investors are currently optimistic about the cryptocurrency market, but can also be an indication that the market is overvalued. A “Fear” reading, on the other hand, signals that investors are currently hesitant about the cryptocurrency market, which potentially represents a buying opportunity.\n\nEthereum moving averages & oscillators\n\nLet’s take a look at what some of the most important technical indicators are signaling. We’ll be going through key moving averages and oscillators that will allow us to get a better idea of how Ethereum is positioned in the market right now.\n\nPeriod Daily Simple Daily Exponential Weekly Simple Weekly Exponential MA3 $ 1,633.88 (SELL) $ 1,621.12 (SELL) - - MA5 $ 1,637.67 (SELL) $ 1,631.19 (SELL) - - MA10 $ 1,636.54 (SELL) $ 1,639.12 (SELL) - - MA21 $ 1,654.52 (SELL) $ 1,662.18 (SELL) $ 1,818.68 (SELL) $ 1,766.85 (SELL) MA50 $ 1,756.17 (SELL) $ 1,726.04 (SELL) $ 1,628.69 (SELL) $ 1,777.33 (SELL) MA100 $ 1,804.28 (SELL) $ 1,769.11 (SELL) $ 2,152.08 (SELL) $ 1,831.85 (SELL) MA200 $ 1,802.91 (SELL) $ 1,762.52 (SELL) $ 1,649.94 (SELL) $ 1,633.18 (SELL)\n\nPeriod Value Action RSI (14) 34.23 NEUTRAL Stoch RSI (14) 70.62 NEUTRAL Stochastic Fast (14) 9.74 BUY Commodity Channel Index (20) -66.67 NEUTRAL Average Directional Index (14) 49.89 SELL Awesome Oscillator (5, 34) -70.76 NEUTRAL Momentum (10) -27.59 NEUTRAL MACD (12, 26) 4.19 NEUTRAL Williams Percent Range (14) -90.26 BUY Ultimate Oscillator (7, 14, 28) 50.75 NEUTRAL VWMA (10) 1,636.84 SELL Hull Moving Average (9) 1,643.30 SELL Ichimoku Cloud B/L (9, 26, 52, 26) 1,712.12 NEUTRAL\n\nThe Relative Strength Index (RSI 14) is a widely used indicator that helps inform investors whether an asset is currently overbought or oversold. The RSI 14 for Ethereum is at 34.23, suggesting that ETH is currently neutral.\n\nThe 50-day Simple Moving Average (SMA 50) takes into account the closing price of Ethereum over the last 50 days. Currently, Ethereum is trading above the SMA 50 trendline, which is a bullish signal.\n\nMeanwhile, the 200-day Simple Moving Average (SMA 200) is a long-term trendline that’s calculated by taking an average of the ETH closing price for the last 200 days. ETH is now trading above the SMA 200, signaling that the market is currently bullish.\n\nThe bottom line about this Ethereum prediction\n\nAfter considering the above factors, we can conclude that the current forecast for Ethereum price prediction is Bearish. ETH would have to increase by 9.24% to hit our $ 1,762.13 target within the next five days. Moving forward, it will be important to monitor the ETH market sentiment, the key support and resistance levels, and other metrics. However, we have to keep in mind that the cryptocurrency markets are unpredictable, and even the largest crypto assets display a lot of price volatility. For long-term Ethereum price predictions click here.\n\nDisclaimer: This is not investment advice. The information provided is for general purposes only. No information, materials, services and other content provided on this page constitute a solicitation, recommendation, endorsement, or any financial, investment, or other advice. Seek independent professional consultation in the form of legal, financial, and fiscal advice before making any investment decision."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vYmxvY2tjaGFpbi5uZXdzL25ld3MvZnR4LXRvcC0xMC1jcnlwdG8taG9sZGluZ3MtcmV2ZWFsZWQtc29sLWJpdGNvaW4tZXRoZXJldW0teHJwLWFwdC1sZWFkLXRoZS1wYWNr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Sep 2023 07:00:00 GMT",
        "title": "FTX's Top 10 Crypto Holdings Revealed: SOL, Bitcoin, Ethereum, XRP, APT Lead the Pack - Blockchain.News",
        "content": "The top 10 digital assets held by FTX account for a dominant 72% of its total crypto holdings. Leading this list is Solana (SOL), with a valuation hovering around $1.2 billion. Following closely are Bitcoin (BTC) and Ethereum (ETH), valued at $560 million and $192 million, respectively. The list further includes significant assets such as APT, USDT, XRP, BIT, STG, WBTC, and WETH. Their respective values oscillate between $1.37 billion and a modest $37 million.\n\nSunil, recognized as the FTX Creditor Champion and a leading FTX Creditor Activist, has meticulously unveiled the digital asset holdings and customer claims associated with FTX. This includes its prominent entities FTX.com, FTX.US, and Alameda.\n\nAs of August 24, Sunil's detailed report indicates that FTX has registered a staggering 36,075 customer claims. These claims cumulatively amount to a total of $16 billion. This data not only provides a transparent insight into the vast financial implications but also underscores the expansive scale of operations overseen by the platform. For stakeholders and the crypto community at large, such revelations are crucial in understanding the financial health and operational robustness of platforms like FTX.\n\nDiving deeper into the digital asset landscape of FTX, Sunil's findings highlight that the top 10 digital assets held by the platform account for a dominant 72% of its total crypto holdings. Leading this list is Solana (SOL), with a valuation hovering around $1.2 billion. Following closely are Bitcoin (BTC) and Ethereum (ETH), valued at $560 million and $192 million, respectively. The list further includes significant assets such as APT, USDT, XRP, BIT, STG, WBTC, and WETH. Their respective values oscillate between $1.37 billion and a modest $37 million.\n\nIn a broader perspective, FTX's disclosed crypto assets aggregate to a value of approximately $3.4 billion. The top 10 cryptocurrencies, as detailed by Sunil, constitute 72% of FTX's total crypto holdings. Interestingly, the remaining 28% is distributed among a vast array of over 400 other tokens. This distribution showcases FTX's diversified approach to digital asset investment, ensuring a balance between mainstream cryptocurrencies and potential high-growth tokens.\n\nSunil's report also sheds light on FTX's venture portfolio, another significant aspect of the platform's financial endeavors. The portfolio comprises a whopping 438 investments, totaling an impressive $4.5 billion. Out of these, investments worth $673 million have been monetized, yielding a return of $588 million. This monetization includes notable entities such as Modulo, Mysten Labs, and the renowned Sequoia. The residual portfolio, valued at $3.8 billion, is categorized with equity investments forming 73%, limited partnerships (LP) at 4%, and tokens at a significant 13%.\n\nSuch disclosures by Sunil are not just numbers on a page. They represent FTX's strategic financial decisions, its risk appetite, and its vision for the future in the ever-evolving cryptocurrency domain. For investors, traders, and the global crypto community, these insights offer a clear window into FTX's operational strategies and its position in the global cryptocurrency market.\n\nIn conclusion, Sunil's meticulous unveiling of FTX's digital asset holdings and customer claims underscores the platform's significant footprint in the global cryptocurrency arena. It also emphasizes the importance of transparency and detailed reporting in fostering trust and confidence among stakeholders in the digital asset ecosystem.\n\nDisclaimer & Copyright Notice: The content of this article is for informational purposes only and is not intended as financial advice. Always consult with a professional before making any financial decisions. This material is the exclusive property of Blockchain.News. Unauthorized use, duplication, or distribution without express permission is prohibited. Proper credit and direction to the original content are required for any permitted use.\n\nImage source: Shutterstock"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY29pbmdhcGUuY29tL3RvcC1hbmFseXN0LXByZWRpY3RzLWV0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tYmVmb3JlLWJpdGNvaW4taGFsdmluZy_SAV9odHRwczovL2NvaW5nYXBlLmNvbS90b3AtYW5hbHlzdC1wcmVkaWN0cy1ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLWJlZm9yZS1iaXRjb2luLWhhbHZpbmcvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Sep 2023 07:00:00 GMT",
        "title": "Analyst Predicts Ethereum Price Prediction Before Bitcoin Halving - CoinGape",
        "content": "In the lead up to the countdown to Bitcoin Halving in the second quarter of 2024, it would be interesting to view the Ethereum price forecast, considering that the momentum carried by the second largest cryptocurrency could have a spillover effect on the rest of the crypto market.\n\nAlso Read: Tucker Carlson Gives Bitcoin Big Win Before Javier Milei Interview\n\nadvertisement\n\nBitcoin Halving – Not So Good For ETH?\n\nPrior to the Bitcoin Halving event in May 2020, the ETH price failed to gain momentum and only maintained lower highs, until it saw a higher high just around the Halving. Hence, analyst Benjamin Cowen has asserted that the second half of the pre-Halving year is likely not going to be favorable to Ethereum. Cowen predicted that the general direction should be down overall in the lead up to the event, although the cryptocurrency may likely see some upside during the time.\n\nThe analyst predicted that ETH could close the year 2023 below the yearly open of $1,195. Going by the analyst forecast, the ETH price may likely decline to below $1,400 by the end of October 2023. Does it mean that the cryptocurrency would stay around the same level more or less until the Bitcoin Halving? Despite the high volatility, since the last quarter of 2021, Ethereum had been mostly maintaining a share of just under 20% of the total crypto market capitalization.\n\nIn other news, CoinGape reported that the Twitter account belonging to Ethereum cofounder Vitalik Buterin has been hacked.\n\nAlso Read: Ethereum Co-founder Vitalik Buterin Twitter Account Hacked"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtYmVjb21lcy1pbmZsYXRpb25hcnktYWdhaW4taGVyZXMtd2h50gFFaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtLWV0aC1iZWNvbWVzLWluZmxhdGlvbmFyeS1hZ2Fpbi1oZXJlcy13aHk_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Sep 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Becomes Inflationary Again, Here's Why - U.Today",
        "content": "Advertisement\n\nAfter the activation of EIP 1559 (periodic burn of Ethereum (ETH) fees based on network activity dynamics), Ethereum (ETH) became deflationary, as the number of tokens issued is lower than number of ETH burned. However, the dramatically low on-chain activity puts an end to this status of second largest cryptocurrency.\n\nEthereum (ETH) becomes inflationary thanks to market exhaustion\n\nIn the last 30 days, Ethereum (ETH) registered a net increase in the number of coins in its supply. A total of 63,490 Ethers (ETH) were burned, while 65,548 Ethers (ETH) were issued. As such, 2,058 \"new\" coins were added to Ethereum's (ETH) circulating supply, per statistics tracked by Ultrasound Money analytical dashboard.\n\nImage by Ultrasound Money\n\nAfter the activation of Ethereum's EIP 1559 mechanism, such periods of \"inflationary\" status occur periodically. The ongoing \"dip,\" though, is a special one: the Ethereum (ETH) burn rate declines faster, so the delta between the \"ETH issued\" and \"ETH burned\" numbers increases aggressively.\n\nIn the past year, the Ethereum (ETH) supply has fallen by over 300,000 ETH thanks to the activation of EIP 1559. The ongoing anomaly should be attributed to super-low activity of Ethereum (ETH) accounts.\n\nAccording to multiple trackers, ETH gas metrics are close to 2023 lows or have even dropped below them. For instance, CoinMetrics sees a mean ETH fee below $2.5, which is the lowest level since January 2023.\n\nOne OpenSea sale can therefore be confirmed for as low as $3, while on-chain swaps via Uniswap (UNI) will be charged with $7.6.\n\nMEV bot became top Ethereum (ETH) gas spender\n\nAmid the apathetic performance of on-chain actors, MEV bot becomes the most productive spender of Ethereum (ETH) gas. As covered by U.Today previously, Jared From Subway, the operator of the most effective MEV bots, paid over $70 million in gas since being launched in February 2023.\n\nThe bot made over 1.1 million transactions but paid more in gas fees than the wallets of exchanges that used Ethereum (ETH) 10 times more frequently.\n\nPer the statistics, during periods of pale market performance, Ethereum (ETH) MEV bots — mechanisms for frontrunning transactions by paying extra gas fees — might be responsible for 80-90% of top DEXes' trading volumes."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vY3J5cHRvLm5ld3MvZXRoZXJldW0tZnV0dXJlcy1ldGYtYXBwcm92YWwtY291bGQtYmUtYS1nYW1lLWNoYW5nZXItZm9yLXBvbHlnb24tdW5pc3dhcC1hbmQtZXZlcmxvZGdlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Futures ETF approval could be a game-changer for Polygon, Uniswap, and Everlodge - crypto.news",
        "content": "There is excitement about the potential approval of an Ethereum Futures exchange-traded fund (ETF) by the United States Securities and Exchange Commission (SEC), possibly as soon as October. This decision could have a significant impact on crypto. Several tokens, including Polygon (MATIC), Uniswap (UNI), and Everlodge (ELDG), may have their growth potential but will likely respond positively to this development.\n\nPolygon addresses scalability on Ethereum\n\nPolygon, known for its solutions to improve Ethereum’s scalability, is crucial in addressing the network’s scalability challenges.\n\nIf Ethereum Futures ETFs are approved, it could underscore the importance of such scaling solutions, potentially benefiting MATIC.\n\nYou might also like: Shiba Inu’s Shibarium reemerges after initial setbacks\n\nRecently, Mihailo Bjelic, one of Polygon’s co-founders, suggested that Shiba Inu consider using its zkEVM to enhance the blockchain ecosystem.\n\nWhile Shibarium’s functionality has been restored, the co-founder recommended that mainnet applications consider transitioning to layer-2.\n\nWith more investors considering Ethereum thanks to ETF accessibility, Polygon’s infrastructure might find more adoption. As a result, analysts hold a positive outlook for MATIC, projecting prices to reach $0.87 by December 2023.\n\nUniswap could benefit\n\nUniswap, a popular decentralized exchange (DEX) on Ethereum, stands to gain from the potential Ethereum Futures ETF approval.\n\nAs more traders adopt Ethereum, Uniswap’s role in offering liquidity for these assets could become more critical. This could increase trading activity and boost UNI prices.\n\nYou might also like: Uniswap v4 code now available on GitHub\n\nUniswap has recently announced the development of Uniswap V4, which will soon be deployed. With this update, the DEX will introduce features like configurable liquidity, providing users with greater flexibility.\n\nAs Uniswap continues to improve its infrastructure, UNI holders can expect more utility and potential growth.\n\nConsequently, experts predict UNI to range between $7.69 and $8.44 by the end of 2023.\n\nEverlodge is digitizing real estate\n\nEverlodge, a player in the real estate market, has an interesting take on the potential impact of the Ethereum ETF approval.\n\nWhile not directly tied to Ethereum, the broader adoption of blockchain could spark greater interest in digital real estate assets. As a result, Everlodge’s property marketplace could attract more users.\n\nPresently, Everlodge is creating a property marketplace to solve real estate challenges. One significant issue in the real estate market is the high entry barrier for small investors.\n\nEverlodge addresses this by fractionalizing property-backed non-fungible tokens (NFTs), allowing anyone to own a share for just $100.\n\nYou might also like: Crypto insiders focusing on Monero, Aave, and Everlodge\n\nEverlodge also introduces liquidity to the traditionally illiquid real estate market. They digitize, tokenize, and fractionalize properties like villas and hotels into NFTs. This enables users to trade or sell their ownership shares at any time on the Everlodge secondary marketplace, providing increased liquidity and flexibility.\n\nAccess to benefits like free nightly stays, staking rewards, and discounts is granted to those holding ELDG, the native token of Everlodge.\n\nEverlodge is currently in stage 2 of its presale, priced at $0.016. With strong connections to the $280 trillion real estate market, ELDG has the potential for rapid growth, possibly outpacing Polygon and Uniswap.\n\nAnalysts are bullish on ELDG, expecting the token to rally on launch day and when it lists on tier-1 centralized exchanges.\n\nFind out more about the Everlodge (ELDG) Presale\n\nWebsite: https://www.everlodge.io/\n\nTelegram: https://t.me/everlodge\n\nDisclosure: This content is provided by a third party. crypto.news does not endorse any product mentioned on this page. Users must do their own research before taking any actions related to the company.\n\nFollow Us on Google News"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vZmluYm9sZC5jb20vMy1jb2lucy1zZXQtdG8tZG9taW5hdGUtdGhlLW1hcmtldC1pbi0yMDIzLWV0aGVyZXVtLWV0aC1wYW5jYWtlc3dhcC1jYWtlLWV2ZXJsb2RnZS1lbGRnL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Sep 2023 07:00:00 GMT",
        "title": "3 Coins Set To Dominate the Market in 2023 – Ethereum (ETH), PancakeSwap (CAKE), Everlodge (ELDG) - Finbold - Finance in Bold",
        "content": "Press Releases are sponsored content and not a part of Finbold's editorial content. For a full disclaimer, please click here. If you encounter any issues, kindly report them to [email protected]. Crypto assets/products can be highly risky. Never invest unless you’re prepared to lose all the money you invest.\n\nWhile thousands of cryptocurrencies are available, a select few stand out as potential leaders poised to dominate the market in 2023. Among them are Ethereum (ETH), PancakeSwap (CAKE), and Everlodge (ELDG). Each of them now offers unique features and solutions to address the evolving needs of the crypto ecosystem.\n\nSummary\n\nEthereum price prediction\n\nPancakeSwap gains attention after its Base launch\n\nEverlodge to soar by 118% soon\n\nJoin the Everlodge presale and win a luxury holiday to the Maldives\n\nEthereum (ETH): A Crypto Giant\n\nEthereum (ETH), often called the “king of smart contracts,” remains at the forefront of cryptocurrency.\n\nMoreover, recent developments like Greyscale Bitcoin Trust’s victory in a lawsuit against the SEC signal growing regulatory clarity for the broader crypto market. As a result, this could benefit the Ethereum blockchain and its ecosystem.\n\nThese factors and Ethereum’s continuous innovation solidify its position as a top choice for long-term crypto investors. Due to all these reasons, market analysts remain bullish for Ethereum. In fact, they predict that the Ethereum price may reach $2,335.71 within Q4 of 2023.\n\nPancakeSwap (CAKE): To Continue Ruling the DeFi Space\n\nPancakeSwap (CAKE) has established itself as a decentralized finance (DeFi) sector leader. Operating on the Binance Smart Chain (BSC), the PancakeSwap exchange offers fast and low-cost transactions compared to Ethereum. Its automated market maker (AMM) platform enables users to swap, stake, and farm various cryptocurrencies.\n\nIn recent PancakeSwap news, it announced it had launched v3 on the Base L2 blockchain. With the most recent network launch, DeFi users can access PancakeSwap’s numerous features and competitively low swap costs.\n\nAs a result, experts are confident PancakeSwap could see sustained growth down the line. Some even forecast that its price could be between $1.73 and $1.96 by December 2023.\n\nEverlodge (ELDG): A Hidden Crypto Gem\n\nEverlodge (ELDG) is poised to disrupt the real estate market in 2023. This innovative property marketplace will digitize and mint high-end villas and hotels into NFTs. Not only that, Everlodge will then fractionalize these NFTs. As a result, it enables anyone to fractionally own a property on the blockchain for prices as low as $100.\n\nAlso, real estate transactions are notorious for lacking transparency, complex processes, and vulnerability to fraud. Everlodge employs blockchain’s inherent transparency and immutability to create a secure and trustworthy environment for property transactions. Also, it stores all titles, deeds, and ownership details in the metadata of the smart contract.\n\nAnother exciting aspect of Everlodge is its Rewards Club, which allows you to earn free nightly stays across all its properties. Depending on your tier within the club, you can access a fixed number of free nights each year. Furthermore, anyone can resell the nights they do not mean to use for a passive income stream.\n\nHowever, only ELDG native token holders gain access to this club. For this reason, countless individuals are flooding the Everlodge presale, which is now in Stage 2. One ELDG token costs just $0.016 – a 60% rise from its beginning price. Additionally, market analysts are confident that Everlodge could surge by 118% and reach $0.035 before the presale ends.\n\nFind out more about the Everlodge (ELDG) Presale\n\nWebsite: https://www.everlodge.io/\n\nTelegram: https://t.me/everlodge"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS12aXRhbGlrLWJ1dGVyaW4teC1oYWNrZXJzLWRyYWlu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Sep 2023 07:00:00 GMT",
        "title": "Vitalik Buterin's X account hacked, over $691K drained from victims' wallets - Cointelegraph",
        "content": "Vitalik Buterin, Ethereum’s co-founder, allegedly had his X (formerly Twitter) account compromised. According to prominent blockchain investigator ZachXBT, the incident has led to victims collectively losing over $691,000 after clicking on a malicious link.\n\nIn a Sept. 9 post on X, Dmitry Buterin, the father of Vitalik, announced that his son’s account had been compromised:\n\n“Disregard this post, apparently Vitalik has been hacked. He is working on restoring access.”\n\nThe post he was referring to has since been deleted. It was published on Buterin’s account, claiming to celebrate the arrival of “Proto-Danksharding coming to Ethereum.“\n\nThe hacker shared a malicious link to an alleged free commemorative nonfungible token (NFT) available, enticing victims to connect their wallets before ultimately stealing all their funds.\n\nConsequently, this incident has led Ethereum developer Bok Khoo, better known as Bokky Poobah on X, to claim he has suffered losses in his CryptoPunk NFT collection.\n\nWARNING! I JUST LOST A FEW PUNKS!\n\n\n\nDON'T INTERACT! pic.twitter.com/lS4VvlHdVa — luckytimes.eth beautifuldaytobealive.eth (@BokkyPooBah) September 9, 2023\n\nAt the time of publication, the prevailing floor price for a CryptoPunk NFT stands at 46.99 Ether (ETH), which is approximately equivalent to $76,837.\n\nRelated: Blockchain Capital’s X account hacked to promote token claim scam\n\nZachXBT has been actively informing his 438,200 followers about the hacker’s activities. He recently shared that the most valuable NFT pilfered so far is CryptoPunk #3983, worth 153.62 ETH, equivalent to approximately $250,543.\n\nUpdate: $691k drained (another 33% in drainer fee address) pic.twitter.com/AVIShqDlMU — ZachXBT (@zachxbt) September 9, 2023\n\nA user with the alias Satoshi 767 suggested that Buterin might not have implemented sufficient security measures for his X account, noting that SIM-swap attacks are a \"common mistake\" for many crypto project founders.\n\nHowever, ZachXBT challenged these allegations, asserting that Buterin’s high profile makes him susceptible to various forms of hacking attempts:\n\n“You do not know yet whether it was a SIM swap. Vitalik is a big enough target to where an insider could have been paid off or panel was used,” ZachXBT stated.\n\nMagazine: How to protect your crypto in a volatile market: Bitcoin OGs and experts weigh in"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvZXRoLXByaWNlLXByZWRpY3Rpb24tc2hvdWxkLXlvdS1idXktZXRoZXJldW0tY29pbi1hdC0xNjAwL9IBW2h0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvZXRoLXByaWNlLXByZWRpY3Rpb24tc2hvdWxkLXlvdS1idXktZXRoZXJldW0tY29pbi1hdC0xNjAwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Sep 2023 07:00:00 GMT",
        "title": "ETH Price Prediction: Should You Enter Ethereum Coin at $1600 Dip? - CoinGape",
        "content": "The Ethereum price has maintained its position above the $1,600 mark, along with the ascending support trendlines for the past three weeks. Frequent dips to this level, swiftly met with buying interest, underscore the resolve of buyers to hold the fort. However, is this fortified support enough to usher in a bullish turnaround?\n\nAlso Read: Ethereum Discussions Spikes Amidst Spot ETF Filings, Is ETH Price Aiming Bulls?\n\nadvertisement\n\n$1600 Support Prevents ETH Price From Major Fall\n\nThe Ethereum chart continues to present demand pressure at the $1600 mark.\n\nA breakout above the overhead trendline will offer better confirmation of recovery\n\nThe intraday trading volume in Ether is $2.4 Billion, indicating a 14.5% loss.\n\nSource- Tradingview\n\nOn August 29, the Ethereum coin saw a dash of optimism as buyers propelled the price to $1,744. This move aimed to rekindle bullish hope among investors. Yet, this was short-lived, as prices swiftly retraced to the familiar territory of $1,600.\n\nAmidst the prevailing market uncertainty, ETH price presently stands at $1,620, showing a minor intraday loss of 0.77%. Notably, sellers made an attempt to pierce through the bottom trendline today.\n\nBut all is not bleak. Should buyers retain control and defend this crucial level, there’s a potential bullish reversal on the horizon. Such a move would directly challenge the descending resistance trendline that has been the bane for ETH price over the past couple of months.\n\nA successful break above this could signal a broader recovery, possibly driving altcoin towards $1,875.\n\nWill Ethereum Plunge to $1500?\n\nIt should be noted that the inability of buyers to mount a substantial recovery, despite numerous bounce-backs from the bottom trendline, suggests tepid bullish confidence. This could be a harbinger of a more prolonged downturn. If the coin price dips below the support trendline and with a daily candle closing beneath it, it could spell a bearish continuation, potentially dragging Ether down to the $1,500 level. The long-term support trend hovering above this support could offer a major dip opportunity for traders\n\nExponential Moving Average: The 100-and-200-day EMA slope nearing a bearish crossover could intensify supply pressure in the market.\n\nRelative Strength Index: The daily RSI slope must rise above the 40% market to enter sufficient momentum of bullish reversal."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZGVjcnlwdC5jby8xNTU3NjIvZXRoZXJldW0tdHVybnMtaW5mbGF0aW9uYXJ5LWFzLWdhcy1mZWVzLXBsdW1tZXQtdG8tMjAyMy1sb3dz0gFcaHR0cHM6Ly9kZWNyeXB0LmNvLzE1NTc2Mi9ldGhlcmV1bS10dXJucy1pbmZsYXRpb25hcnktYXMtZ2FzLWZlZXMtcGx1bW1ldC10by0yMDIzLWxvd3M_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Turns Inflationary as Gas Fees Plummet to 2023 Lows - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum transaction fees have slipped toward 2022 lows, data from Coin Metrics shows, amid a drop in on-chain activity from NFT sales, meme coin trading, and Telegram bots subsides.\n\nThe average fee for transfers on Ethereum now stands at $1.83, while the cost of token exchange via Uniswap is approximately $4.17, per Etherscan data—levels not seen since November last year in the wake of the collapse of FTX.\n\nAs the demand for gas on Ethereum goes down, Ethereum has turned inflationary in one of the few such periods since the Merge in September 2022.\n\nAD\n\nAD\n\nIn the past week, Ethereum’s supply increased by 4,092 ETH tokens worth around $6.6 million, per Ultrasound.money data.\n\nWaiting for the next on-chain narrative\n\nEthereum on-chain activity picked up at the start of 2023 with a spike in NFT trading volumes partly fueled by the Blur token airdrop frenzy, and an increase in ETH price.\n\nThe burn rate further accelerated amid a meme coin hype in the second quarter.\n\nHowever, Ethereum’s supply has flatlined since then as on-chain activity has cooled, with a slight increase recorded in September.\n\nEthereum supply since the Merge. Source: ultrasound money\n\nNansen analyst Martin Lee told Decrypt that “Daily active addresses and transactions have more or less been sideways for the past year. Active addresses hovering around ~400,000, and transactions ~1 million.”\n\nAD\n\nAD\n\nOne notable change over the past month, according to Lee, is that, “the largest gas consumers have been DeFi-related, with NFTs dropping off.”\n\nNFT sales volume has failed to pick up since the second quarter of this year. According to data from Crypto Slam, the number of unique wallets buying and selling NFTs have dropped more than three times since the years.\n\nEthereum NFT sales volume, number of buyers and sellers. Source: Crypto Slam\n\nTelegram bots such as Unibot and Banana Gun have also cooled down after a brief spike in activity during July and August, per Dune dashboards by pseudonymous data analyst Whale_hunter."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL21hcmtldHMuYnVzaW5lc3NpbnNpZGVyLmNvbS9uZXdzL2N1cnJlbmNpZXMvZXRoZXJldW0tdml0YWxpay1idXRlcmluLXR3aXR0ZXItaGFjay1uZnQtc3dpbmRsZS1jcnlwdG8tYmxvY2tjaGFpbi1ldGgtMjAyMy050gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Founder Vitalik Buterin's X Was Hacked, $700,000 NFT Swindle - Markets Insider",
        "content": "Ethereum co-founder Vitalik Buterin had his X account hacked, with hackers posting a malicious link.\n\nThe link resulted in the theft of $691,000 from some of his 4.9 million users who followed it on his page.\n\nThe post was a fake announcement of a new non-fungible token series.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nA hacker gained access to the X account of ethereum co-founder Vitalik Buterin and posted a malicious link to 4.9 million followers on Saturday.\n\nThe post was disguised as a free commemorative non-fungible token from software firm Consensys. Users who clicked on it and connected their digital wallets in a bid to mint an NFT instead had their funds drained.\n\nPopular blockchain sleuth ZachXBT found that the attacker swindled a total of about $691,000, though the exact number of victims is not known.\n\nZachXBT also pointed out that the hacker sent Buterin an NFT named \"Vitalik\" following the attack.\n\nAdvertisement\n\nThe post has since been deleted, and several X users flagged it to others on the platform, warning that it was a hacker. Buterin's father, Dmitriy, was among those who shared a word of caution in a post.\n\nAs for Buterin, he has not commented on the matter or posted anything on X since the hack happened.\n\nBig money swindles are nothing new in the digital asset space. In 2022, hackers made off with $3.8 billion, with North Korea-linked hacking groups leading the way with record theft volumes. Among the largest was Lazarus Group, which was a key player in the infamous $620 million Axie Infinity hack last year."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LnB5bW50cy5jb20vbmV3cy9zZWN1cml0eS1hbmQtcmlzay8yMDIzL2hhY2tlcnMtc3RlYWwtb3Zlci02OTEwMDAtZG9sbGFycy1waGlzaGluZy1hdHRhY2stc29jaWFsLW1lZGlhL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Sep 2023 07:00:00 GMT",
        "title": "Report: Hackers Steal Over $691000 in Phishing Attack on Social Media - PYMNTS.com",
        "content": "Hackers reportedly gained control of the X, formerly Twitter, account of Ethereum founder Vitalik Buterin and stole more than $691,000 from unsuspecting victims.\n\nThe attack was carried out through a phishing link that provided unauthorized access to people’s wallets, with a significant portion of the value that was taken from the individuals’ wallets being in the form of non-fungible tokens (NFTs), CoinDesk reported Monday (Sept. 11), citing blockchain analyst ZachXBT.\n\nThe attack was initiated through a tweet containing the malicious link, which has since been deleted, according to the report.\n\nThe exact method used by the hackers remains unclear, as ZachXBT refrained from speculating on whether Buterin fell victim to a “SIM swap” attack, the report said. SIM swapping, a method where control of a person’s phone number is taken to bypass two-factor authentication on websites like crypto exchanges and social media platforms, is one potential avenue through which the attack could have been executed.\n\nThis incident adds to the growing list of cryptocurrency-related security breaches, per the report. Earlier this year, it was reported that crypto investors lost $54 million in a single month due to rug pulls, scams and hacks.\n\nIn a similar vein, the official website of the Terra blockchain was recently compromised by hackers who posted a series of malicious links, according to the report. The extent of the stolen funds remains unclear.\n\nPYMNTS Intelligence found that nearly half of all organizations reported being targeted by fraud in 2022, with the fraud stemming from a wide variety of sources and aimed at a range of targets.\n\nBad actors are constantly developing new techniques and technologies to steal hard-earned revenue and data, according to “Fraud Technology Trends 2022,” a PYMNTS and DataVisor collaboration.\n\nOne study found that 97% of eCommerce fraud prevention decision-makers around the world had experienced some sort of fraud at their organizations within the past 24 months.\n\nIn an August hack, crypto lender Exactly Protocol lost as much as $12 million when targeted in a bridge exploit. The hacker used an exploiter contract on Ethereum to move deposits to Optimism and then bridged the stolen funds back to Ethereum.\n\nFor all PYMNTS crypto coverage, subscribe to the daily Crypto Newsletter."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtYW5kLXNvbGFuYS1zb2wtb3ZlcnNoYWRvd2VkLXNheXMtaW50b3RoZWJsb2Nr0gFOaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtLWV0aC1hbmQtc29sYW5hLXNvbC1vdmVyc2hhZG93ZWQtc2F5cy1pbnRvdGhlYmxvY2s_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Sep 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) and Solana (SOL) Overshadowed, Says IntoTheBlock - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a market that is often swayed by sentiment, Ethereum and Solana find themselves in a complicated spot. Despite a string of bullish news, including Visa's interest and the buzz around a potential spot ETH ETF, both digital assets seem to be grappling with a shadow cast by fear-driven market dynamics. The looming $3 billion liquidation on FTX is a case in point, steering the market's focus away from the positive strides these blockchains are making.\n\nAdvertisement\n\nAs of the latest data, Ethereum is priced at $1,623.49 USD, while Solana stands at $18.47 USD. These figures might not tell the whole story, but they do hint at a subdued market response to what should have been uplifting news.\n\nOver the past two weeks, both Ethereum and Solana have shown less than stellar price performance. This lackluster movement contradicts the positive news flow and suggests that the market is more attuned to potential risks, such as FTX's impending liquidation, rather than opportunities. It's as if the market has put on blinders, focusing solely on the pitfalls ahead.\n\nSo, what's the takeaway? Well, it is not that Ethereum and Solana lack promise; far from it. These platforms continue to innovate and attract institutional interest. However, the market seems to be in a state of selective hearing, tuning in only to news that feeds its anxieties. This restive behavior could be a temporary phase, but for now, it is dictating the tempo of the market.\n\nAs for now, the market needs to recalibrate its focus, shedding its tunnel vision to appreciate the broader landscape of possibilities that these blockchains offer. Until then, ETH and SOL will likely continue to dance in the shadows."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1wcmljZS1yZW1haW5zLXN0ZWFkeS1hcy12aXRhbGlrLWJ1dGVyaW4tZmFsbHMtdmljdGltLXRvLWhhY2tlcnPSAVxodHRwczovL3UudG9kYXkvZXRoZXJldW0tcHJpY2UtcmVtYWlucy1zdGVhZHktYXMtdml0YWxpay1idXRlcmluLWZhbGxzLXZpY3RpbS10by1oYWNrZXJzP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Price Remains Steady as Vitalik Buterin Falls Victim to Hackers - U.Today",
        "content": "Advertisement\n\nVitalik Buterin, the co-founder of Ethereum, has reportedly fallen prey to hackers who gained unauthorized access to his X account — X being the new name for Twitter following its acquisition by Elon Musk.\n\nBad actors posted some phishing links in an apparent attempt to scam Buterin's followers by luring them with a suspicious-looking \"commemorative\" non-fungible token (NFT) sham. Per social media reports, multiple NFTs were stolen following the incident.\n\nButerin himself has yet to address the incident.\n\nBuzz and banter\n\nThe hacking incident has triggered an immediate response from the online community, including speculation, memes and legitimate security concerns.\n\nOne user humorously mused about the fortunes the hacker could have amassed had they falsely tweeted about a massive Ethereum sell-off.\n\nObviously, a lot of users were puzzled by the fact that someone as tech-savvy as Buterin could fall victim to such an attack. Rumor has it that the incident was caused by a SIM swap attack.\n\nETH did not flinch\n\nThe ETH price remained remarkably steady in the wake of the major cyber-incident. At press time, it is trading at $1,626 following a minor 0.5% dip.\n\nThe coin's market cap hovers at about $195.5 billion, with a 24-hour trading volume of approximately $3.3 billion."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS92aWRlby9ldGhlcmV1bXMtdml0YWxpay1idXRlcmluLW91dGxpbmVzLXdheS1mb3ItYmxvY2tjaGFpbi1wcml2YWN5LXBvb2xzLXRvLXdlZWQtb3V0LWNyaW1pbmFscy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Sep 2023 07:00:00 GMT",
        "title": "Ethereum's Vitalik Buterin Outlines Way for Blockchain 'Privacy Pools' to Weed Out Criminals - CoinDesk",
        "content": "Let's talk about a new evolution on the privacy front that begs the question, can Blockchain protocols distinguish between honest folks and criminals? A recently published paper authored by the co-founder of Vital Bitter and four others say that they can by using a new technological feature called privacy Pools. Joining us now is one of the authors of the paper called Blockchain privacy and regulatory compliance towards a practical equilibrium analysis. Chief scientist Yacob Ilo, welcome to the show, Yacob. Thank you and thanks for having me. Thanks for being here with us. Now we're talking about this paper, it studies privacy pools which is a smart contract based privacy enhancing protocol that separates, like I said in my intro, honest users, good actors from bad actors explain to us like we're five years old, how this works. So the main idea here is to how do we achieve some sort of financial privacy on the Blockchain, right? The the Blockchain or many blockchains anyway are inherently um transparent. Um And there's been attempts for that uh for trying to achieve that if you have something like tornado cash, right? But um what happened with tornado cash was that it all of a sudden started allegedly being used for large amounts of money laundering, right? And so you have all these users that are using this to achieve some level of privacy and now they have no way of saying, hey, I'm not these actors that are sending funds to launder money through this protocol. And so what privacy pools can do is that it can actually allow you when you are pulling funds out of this smart contract, you can dissociate from any kind of activity that you want. So you can actually pick and choose and say, hey, I'm pulling out funds and I'm doing it with some degree of um anonymity and privacy, but I am not what some of these funds over here. And that's the main uh innovation that's here. So the, the part that I I I'm trying to grapple here is of course that we've always been told that crypto the whole thing is it's not anonymous, it's synonymous. Um So why would one need to have all of this? Uh you know, is it, what's the necessity, isn't, isn't there enough privacy already built in that? We don't need this extra layer? I think, I don't think so. I think, you know, it's, it's kind of like if you want to interact with your web banking, you also use encryption on the network, right? You're not just sending all your details when you're interacting with your bank so anybody can read what you, um, what you're doing and it's similar on the Blockchain, right? Even though we have the pseudonym, pseudonym that we have on the Blockchain. Um, like, let's say that you go, I'll take an example, like we use in the paper. Like, let's say you go to a restaurant and you decide to, to pay for some food. Right? You might take a picture of what you are eating. People can see kind of what that meals cost. And so if you already know the address of the restaurant on the Blockchain, you can actually go and do some kind of analysis and figure out well, what, what likely wallet did actually pay for your meal. And now all of a sudden somebody has access to all the financial transactions that you have ever done. And I don't think that that's a good space to be. I don't think that's what we are. Uh that's what we want. So we want some, some way of achieving some level of like privacy while you're, you know, uh shielding your financial transactions. Note to self, don't take photos of food and restaurants. Lawrence. Lawrence has a secret food blog somewhere that we'll, we'll find at some point. All right, before you do. Yes. Yeah, I, I want to talk about the, how this actually works because when we read the paper, it sounds like you need large sets of users who actually care about preserving their privacy for this to work. So how like is how do you are those people out there already? Are there people who care enough about this to participate in the pools to provide that anonymity for the group? I I believe so. I think that, you know, you can see there were a lot of users if you look at the activity of tornado cash ever since it got placed on the O A sanctions list, like the activity has gone down tremendously. I think there's a lot of people that wanted uh some kind of privacy but are now shying away from that kind of technology and are looking for alternatives. And so I do think that those users are there and I think that if there is some kind of technology that that gives you that way you can still dissociate from activity that you don't want to be associated with, then I think more people will pick it up. And that's mainly the goal is to try to bring forward technologies that can bring more people into the Blockchain space. Um So can you can you kind of walk us through exactly what, what, how this is implemented or how it will be implemented the time frames? Uh you know, how far along are people when it comes to this? And you know, what, what kind of timeline are we expecting? But I think first off, what exactly is it, how does it work? Yeah. So the technology is already around the technology relies on zero knowledge proof, which is like instrumental in many Blockchain technologies to try to achieve some level of privacy. So what that means is that basically in, in, in ordinary English, a zero knowledge proof means that you can prove something that everybody can verify is correct without actually revealing the information for people to know how, how you how you could make that proof. So basically what you are saying is that you're withdrawing funds, you are depositing funds into a protocol that everybody can see the funds flowing in. Now, when you pull out funds, you can prove in zero knowledge that you have access to pull some funds out of this pool, but you don't have to reveal exactly which funds the the s knowledge proof just says my funds are actually in the pool and I can pull them out legitimately. And now what we add on with private pools is that you can not just say I have funds in the pool, but you can say I have funds in the pool and they are part of this set. We call them an as an association set. So they are part of this association set or they are dissociated from these deposits over here. Um So all Zero knowledge technology, you know, you run up to it. I'm sorry, in terms of, in terms of uh time to implement like, you know, what, what's the process for, for people who aren't familiar with, with how things get done on Ethereum. Uh What's the, what's the timeline here and how would it work? Like there are already some people that are trying to build at least the technological foundation for then? I mean, who is one of the co-founders is already trying to build out some of this? Um So this, this is technology that could be implemented uh very on a very short time scale. The only thing that we argue in the paper that's required is that some people need to supply these association sets, right? We're not all Blockchain uh forensics experts, right? So we don't know who else is putting funds into these pools where they're coming from. Uh what's the source of those funds? So you need to partner with some either organizations or companies that have access to that kind of information that can build out these sets and say, hey, all these funds that are flowing into this privacy pool here are coming from say these five exchanges or something like that, right? Like, so that's now when you, when you are pulling funds out, you would be associating yourself with, say, hey, my funds did come from one of these five exchanges, but there's no one who can tell who uh which of the five is actually mine. And um so you need, you need to have some kind of collaboration. So that's, that's part of what's going to impact the timeline for rolling this out, this part partnership needs to be established. Um But I think the first point is just to build out the technology like I AM is doing and then, um you know, we can take it from there. You brought up tornado cash. It's also mentioned in the paper, the limitations associated with it are are unpacked. But when we talk about tornado cash, I think we, we think of, of course about the sanctions. We think of course about the subsequent lawsuits. Um, our privacy pools are there any concerns you have when it comes to regulatory compliance across various different jurisdictions? So, yeah. Well, I'm a technologist. I'm not a policy maker, right? So what this is, is a proposal from a technological perspective of things that we think can solve some of the issues that are out there now, whether it actually has these properties that we, we believe they could have is up to the policy maker. So I'll leave that to the experts that are, that know that matter to decide. Like, does this actually have, you know, does this, could this live up to certain regulatory requirements in different, in certain jurisdictions or if not, how do we need to change this technology? Maybe what kind of features do we need to add or remove in order to, to get there? So this is our offer to put something into that conversation. And what's different about this proposal is that we're coming, we're we're a bunch of people coming from different aspects of the Blockchain space to have this conversation, right? We're not people coming from individual silos trying to argue why it should be one way or another. We're trying to have a conversation and say, look, we understand that there are issues. If we want to bring more many people into the Blockchain space, it needs to be safe to operate in there. People need to know that if they use a privacy technology, they can pull out their funds and safely spend them. That's what it's gonna take to take Blockchain to the next level. And so we're saying here's a technology, let the policymakers look at this and assess whether this is something that can uh that can be used. Um at the end of the day. That's, yeah, that's not up to me. So yeah, it sounds like this is more about preserving privacy for the everyday user rather than separating out bad actors. You know, of course, cha analysis works with several different entities, identifying bad actors. We've seen your company do that very well. So is is this actually about finding bad actors or is it about preserving uh privacy for the larger um set of people who are interacting on blockchains? Uh For me, it's all about privacy preservation. I believe that people, individual users that want to use Blockchain safely should have access to do that in some way. And we need technologies to protect that. Just like how I was suggesting before, like if you go to a restaurant and everybody will then know everything about you. Like, nobody wants to live in that world. And I think as if that is the world, I don't think that Blockchain is gonna achieve the kind of adoption that I would like to see. I would like to see uh Blockchain being in the hands of everybody. And I like to say, I, I particularly wanted, I want to see the day where my dad is using Blockchain. Uh Maybe he knows it or maybe he doesn't, but he'll, it'll be part of his everyday life and we're not there. And I think privacy protection is one of those elements that have to be there and we need to keep finding ways of achieving that level of privacy. And that's what this is. Thank you very much for joining the show this morning and unpacking the paper for us. Absolutely. Thanks for having me. That was analysis chief scientist Jacob. I"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZ2l6bW9kby5jb20vdml0YWxpay1idXRlcmluLXR3aXR0ZXItaGFjay1ldGhlcmV1bS1zY2FtLTE4NTA4MjQ3NzTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Founder's Twitter Account Hacked to Shakedown Crypto Bros - Gizmodo",
        "content": "The crypto landscape has seen better days. Vitalik Buterin, the inventor of Ethereum, was apparently the subject of a hack that targeted his Twitter account and promoted a less-than-authentic scheme to drain people’s crypto wallets.\n\nEven Twitter Can’t Kill Twitter | Letter From the Editor CC Share Subtitles Off\n\nEnglish view video Even Twitter Can’t Kill Twitter | Letter From the Editor\n\n“To celebrate the Proto-Darksharding coming to Ethereum, @Consensys is marking the moment with a commemorative NFT. ‘Proto honors the work of the devs who made this possible. The collection is free for the next 24 hours,” the alleged hackers posted on Buterin’s account, followed by a link to a webpage where users were encouraged to claim the NFT.\n\nAdvertisement\n\nThe hack was reported by Web 3 Is Going Great, a blog dedicated to chronicling all the ways that the future of tech is imploding. Buterin’s account was hacked, and the tweet was posted and subsequently removed all over the course of 20 minutes. A limited edition NFT was seemingly too good to pass up for crypto bros across the internet, and according to Web 3 Is Going Great, the attached link would actually take you to a wallet drainer, effectively offering the hackers the chance to crypto-bankrupt you. The outlet says that the scheme actually worked, and roughly $650,000 worth of NFTs were stolen from unsuspecting victims.\n\nAdvertisement\n\nProto-danksharding is an upcoming update to Ethereum’s digital infrastructure, which developer Mario Havel told Decrypt was in its last stages of development before release, seemingly in the next few months. The new update will use so-called “data blobs,” allowing the Ethereum network to expand and handle up to 100,000 daily transactions.\n\nAdvertisement\n\nButerin’s hack is par for the course in the digital-only currency world. A report last fall found that hackers stole the equivalent of $718 million in crypto from January to October 2022. This past June, the Department of Justice announced that it identified the two hackers that targeted the Mt. Gox crypto exchange in 2011, making off with around 647,000 bitcoins along the way."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ibG9nL3doZXJlLXRvLXN0YWtlLWV0aGVyZXVtLWluLTIwMjQtMTUtYmVzdC1wbGFjZXMv0gFOaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2Jsb2cvd2hlcmUtdG8tc3Rha2UtZXRoZXJldW0taW4tMjAyNC0xNS1iZXN0LXBsYWNlcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Sep 2023 07:00:00 GMT",
        "title": "Where to Stake Ethereum in 2024? (15 Best Places) - AMBCrypto Blog",
        "content": "Ethereum (ETH), an open-source, decentralized blockchain, is fast becoming one of the most popular tokens. Transforming from proof of work (PoW) to proof of stake (PoS) consensus mechanism, Ethereum has opened a gateway to earning passive income through staking.\n\nIf you’re wondering where to stake Ethereum for the best returns, this article will guide you through the top 15 platforms for Ethereum staking in 2024.\n\nUnderstanding Ethereum staking\n\nEthereum staking is a process where you lock up or deposit your ETH in a wallet to participate in the network’s consensus mechanism. This is part of the Ethereum network’s shift post The Merge, known as Ethereum 2.0 or ETH2.\n\nStaking in Ethereum involves becoming a validator in the network. Validators are chosen at random to create blocks, and the probability of being chosen relates to the amount of Ether they hold and have staked. Moreover, validators need to run software connecting them to the network, propose and check new blocks, and store data.\n\nThe benefits of staking include earning passive income through staking rewards, contributing to the network’s security, and participating in the network’s governance by voting on proposals.\n\nWhile you’re here, read more about Ethereum 2.0 development and expand your horizons.\n\nTop 15 platforms for staking Ethereum in 2024\n\nNow that we’ve covered the basics of Ethereum staking, let’s explore the best platforms for staking ETH in 2024:\n\n1. Binance\n\nBinance is one of the leading crypto exchanges, known for its generous number of tokens and user-friendly platform. The platform introduced ETH2.0 staking to enable investors with less than 32 ETH to stake their tokens.\n\nBinance provides two types of staking terms, Fixed and Flexible, offering an annual percentage yield (APY) of up to 5.2% on ETH. Binance also distributes 100% of all on-chain rewards to customers, incentivizing them to stake their Ethereum. However, it’s worth noting that Ethereum staking is currently not supported on Binance.US.\n\n2. Coinbase\n\nCoinbase revolutionized the digital currency environment by offering a simple platform to buy, trade, store, and sell digital assets. The platform offers Ethereum 2.0 staking, allowing users to earn up to 3.16% APY while holding ETH in a Coinbase wallet. The platform has no minimum staking amount for ETH, but it does charge a 25% commission fee on staking profits.\n\n3. Kraken\n\nKraken is a well-known digital asset exchange that offers staking services for several digital assets, including Ethereum. The platform imposes an administration fee of 15% on all rewards earned, reflected in the estimated 4-7% APY staking return. However, Kraken’s staking service is not available in the United States or Canada.\n\n4. Lido\n\nLido democratizes Ethereum staking by eliminating the typical 32 ETH minimum requirement, making it accessible for investors with smaller holdings. By aggregating funds from various users into a single staking pool, Lido offers a simplified, secure, and user-friendly approach. This enables individuals to earn staking rewards without the high entry barrier or the need for significant upfront investment in Ethereum. 5. eToro eToro stands out as a highly secure platform for staking Ethereum, thanks to its global operations and stringent regulatory compliance. This makes it especially appealing for newcomers and those cautious about venturing into the unregulated world of decentralized finance (DeFi). The platform currently supports staking for Ethereum, Cardano, and Tron, with plans for further expansion. One of eToro’s standout features is its automatic staking process. Simply holding eligible cryptocurrencies in your account is enough to start earning rewards, eliminating the need for a lock-in period and making it perfect for passive investors. Depending on your membership tier, you can earn between 75-90% of the total rewards generated by the staking pool. Save your digital currencies safely with these top 15 crypto-saving accounts.\n\n6. Ledger Wallet\n\nLedger Wallet provides a high-security solution for storing and staking Ethereum, thanks to its hardware-based approach. By keeping your ETH offline and in a physical device, Ledger offers robust protection against online threats.\n\nThe APY for staking rewards varies depending on the decentralized app (dApp) you use. For example, Kiln offers around 7% APY, while Lido provides about 4% APY.\n\n7. Rocket Pool\n\nRocket Pool revolutionizes Ethereum staking by providing a decentralized platform built directly on the Ethereum network. Unlike traditional options requiring 32 ETH to stake independently, Rocket Pool lowers the entry barrier by allowing staking with just 16 ETH.\n\nIt offers dual staking methods, either as an individual node or by contributing to a pooled stake. Competitive commission fees make it a cost-effective choice. For those interested in higher APY, running a node via Rocket Pool is an enticing option that maximizes returns.\n\n8. Nexo\n\nNexo sets itself apart as an all-in-one crypto exchange with a focus on flexibility and profitability in Ethereum staking. Offering customizable yields ranging from 4% to a remarkable 12%, coupled with instant withdrawals, Nexo has quickly risen as a preferred platform for ETH staking. Staking ETH on Nexo rewards users with synthetic NETH, which can be used as collateral for crypto loans at a 50% loan-to-value (LTV) ratio. It offers innovative avenues to maximize staked assets. In addition to a high ETH yield, Nexo provides impressive APYs of up to 16% on other cryptocurrencies. This is achieved by combining staking rewards with Miner Extractable Value (MEV) and Ethereum network fees. Operating in over 200 jurisdictions and supporting staking for more than 35 crypto assets, Nexo also maintains industry-leading security measures backed by institutional-grade insurance to safeguard against potential losses.\n\n9. ByBit\n\nByBit is a low-cap cryptocurrency exchange offering modest but reliable APYs for Ethereum staking. It provides the flexibility for investors to choose between two staking options: a flexible term with a 1.2% APY or fixed-term staking, offering 1% to 1.8% APY for 30 or 60-day lock-ins.\n\nIt’s important to note that ByBit is one of the few platforms not supporting ETH 2.0 staking. This means that the platform’s staking rewards are off-chain, and returns are not compounded. For long-term staking, investors need to manually delegate new tokens to continue earning APY rewards on those assets. This approach might suit traders looking for non-compounded, straightforward staking returns.\n\n10. Bitfinex\n\nBitfinex offers a compelling staking option with as much as 3.5% APY in staking rewards for ETH. This platform stands out for its absence of a minimum ETH requirement and zero staking fees, making it accessible for investors with various portfolio sizes.\n\nEquipped with advanced trading tools and innovative technology, Bitfinex caters to a global audience. However, it’s important to note that the service is not available to residents of the United States or Canada. This could be a suitable choice for those outside these jurisdictions looking for high yields and low entry barriers.\n\n11. Huobi\n\nHuobi offers a user-friendly staking experience with its Huobi Earn feature, allowing both flexible and fixed lock-up terms to earn interest on Ethereum. With a low minimum deposit of just 0.1 ETH, Huobi presents an accessible option for small investors and beginners who may not have the 32 ETH typically required to become a validator. The platform currently offers up to 6.71% APY, with a 7-day average APY of 4.42%.\n\nLike Binance, Huobi users convert their ETH to BETH, representing staked ETH on a 1:1 ratio, and can trade BETH against USDT and ETH pairs. Additionally, Huobi offers an HPT airdrop bonus as part of the staking rewards, distributed the day after the BETH holdings snapshot. The platform does not appear to charge any staking fees, making it an attractive and cost-effective choice for Ethereum staking.\n\n12. StakeWise\n\nStakeWise offers a decentralized, non-custodial Ethereum staking solution through a unique dual-token system: staking ETH (sETH2) and reward ETH (rETH2), both backed 1:1 by ETH. Its standout feature is Liquid Staking Derivatives (LSDs), enabling users to participate in DeFi while earning staking rewards.\n\nDistributed daily, these rewards come with a 10% commission fee. The platform operates as a dApp and is supported by reputable validators, making it a secure and innovative choice for Ethereum staking.\n\n13. OKX\n\nOKX, the sixth-largest cryptocurrency exchange by volume, offers both centralized and decentralized trading options, expanding its reach globally. However, its ETH 2.0 staking feature is limited to countries where OKX is licensed to operate.\n\nWith a competitive 4.15% annual percentage rate (APR) and a low minimum staking requirement of 0.1 ETH, the platform is quite accessible. Like Binance, OKX employs a 1:1 staking ratio, meaning 1 ETH staked will yield 1 BETH, issued daily as staking proof.\n\nInvestors can convert their BETH back to ETH once the Shanghai upgrade is released, expected in the second half of 2023. The platform offers a straightforward staking experience, although its geographic limitations may be a drawback for some.\n\n14. Atomic Wallet\n\nAtomic Wallet offers a software-based, non-custodial solution for those interested in staking Ethereum. Being decentralized, it puts asset security in the hands of users. The wallet enables earnings of up to 5.5% APY on staked ETH. Similar to Ledger Wallet, staking with Atomic Wallet is simplified; users simply deposit their crypto and select a validator.\n\nThe platform also provides an earnings estimator on its official website, giving users a snapshot of potential returns. Atomic Wallet is an ideal choice for those who wish to actively participate in the Ethereum ecosystem without incurring the initial costs associated with hardware wallets.\n\n15. Allnodes\n\nFounded in 2017, Allnodes offers a seamless, one-click solution for staking and node hosting through its non-custodial cloud platform. Supporting over 33,000 nodes across more than 60 protocols, the platform manages assets valued at over $2 billion. Notably, Allnodes hosts thousands of Ethereum nodes valued at roughly $800 million.\n\nThe platform shines in its user experience, providing a simple interface to monitor nodes and staking products. Staking with Allnodes is hassle-free; you only need a wallet address, and your coins remain securely in your wallet.\n\nFor Ethereum 2.0, validators can anticipate about a 4% APR. Allnodes charges a modest $5 monthly fee with no upfront setup costs, making it a cost-effective and user-friendly choice for staking services.\n\nBottom line\n\nStaking Ethereum has emerged as a lucrative opportunity for investors to earn passive income while contributing to the security and stability of the Ethereum network. Whether you’re an experienced investor or a beginner, the platforms discussed above offer an array of options to suit your needs and preferences.\n\nMake sure to assess each platform’s features, security measures, and staking rewards to make an informed decision. Always remember, the world of crypto staking carries its own risks, and it’s crucial to stake responsibly."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9kYW5nZXJvdXMtcGF0dGVybi1lbWVyZ2luZy1mb3ItZXRoLXByaWNlLWNvdWxkLWNyYXNoLXRvLTEtNGstZXRoZXJldW0tcHJpY2UtYW5hbHlzaXNzZXAtMTAtZXRoL9IBfGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9kYW5nZXJvdXMtcGF0dGVybi1lbWVyZ2luZy1mb3ItZXRoLXByaWNlLWNvdWxkLWNyYXNoLXRvLTEtNGstZXRoZXJldW0tcHJpY2UtYW5hbHlzaXNzZXAtMTAtZXRoLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Sep 2023 07:00:00 GMT",
        "title": "Dangerous Pattern Emerging for ETH, Price Could Crash to $1.4K (Ethereum Price Analysis) - CryptoPotato",
        "content": "Ethereum’s price has taken a notably bearish turn, breaching several critical support levels and tilting on the verge of a concerning death cross.\n\nDespite these developments, there is a glimmer of hope as the price approaches a substantial support zone, hinting at the possibility of a temporary consolidation phase.\n\nTechnical Analysis\n\nBy Shayan\n\nThe Daily Chart\n\nEthereum’s price has recently experienced a significant downtrend, leading to a breach of multiple support levels, including the crucial 100 and 200-day moving averages. This rejection has also pushed the price below its previous major swing low at $1,625, marking a daily lower low. This shift strongly suggests transitioning from an uptrend to a potential downward trajectory.\n\nAdditionally, the 100-day moving average is on the verge of crossing below the 200-day moving average, forming a death cross pattern. If this breakout occurs, the market could anticipate a notable descent towards the $1.4K support region.\n\nHowever, amidst the bearish signals, the price has reached a critical support region characterized by the 61.8% Fibonacci retracement level. This range is often seen as the last line of support for Ethereum bulls. Should the price slip below this threshold, the likelihood of a sharp decline would increase.\n\nThe 4-Hour Chart\n\nExamining the 4-hour timeframe, a temporary pause in the aggressive downtrend can be observed when Ethereum found support around the significant $1.6K region.\n\nSubsequently, the price experienced a bounce-back but encountered strong resistance at the 61.8% Fibonacci level. This led to a consolidation phase, during which the price formed an ascending flag pattern—a recognized bearish continuation pattern.\n\nHowever, another impulsive retracement drove the price back toward the $1.6K range, bringing it close to the lower boundary of the flag pattern. As the $1.6K threshold aligns with the flag’s lower trendline, it carries considerable psychological significance. Consequently, if sellers push the price below this critical level, the market could witness another swift and steep decline toward lower price levels.\n\nOn-chain Analysis\n\nBy Shayan\n\nThe chart visually represents the Ethereum Coinbase Premium Index, a 30-day moving average added, and the price. This metric measures the price difference between Ethereum on Coinbase and its counterpart on Binance, two prominent global cryptocurrency exchanges. What makes this metric particularly relevant is its ability to serve as a barometer for gauging whether U.S. investors collectively lean towards buying or selling Ethereum compared to their global counterparts.\n\nWhat emerges as a compelling observation is the intriguing correlation between the price action of Ethereum and the Coinbase premium metric. The chart shows that this metric’s corresponding spike or plunge has mirrored every significant price surge or dip in Ethereum’s value.\n\nHowever, the more noteworthy development recently has been the noticeable shift in sentiment within the U.S. cryptocurrency market. This shift is made evident by the pronounced downward trajectory of the premium index, reaching a yearly low. This shift in sentiment is significant because many U.S. investors involved are either high-net-worth individuals or institutional entities whose actions can wield substantial influence in the cryptocurrency landscape. Hence, the market seems to be in total fear and uncertainty until a robust price surge and heightened buying pressure occur."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9ncmF5c2NhbGVzLWV0aGVyZXVtLWZ1bmQtbmVhcnMteWVhcmx5LWhpZ2gtYW1pZC1maWxpbmdzLWZvci1zcG90LWV0aGVyLWV0Zi1kYXRhL9IBbWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9ncmF5c2NhbGVzLWV0aGVyZXVtLWZ1bmQtbmVhcnMteWVhcmx5LWhpZ2gtYW1pZC1maWxpbmdzLWZvci1zcG90LWV0aGVyLWV0Zi1kYXRhLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Sep 2023 07:00:00 GMT",
        "title": "Grayscale’s Ethereum Fund Nears Yearly High Amid Filings for Spot Ether ETF: Data - CryptoPotato",
        "content": "The Grayscale Ethereum Trust (ETHE) has recorded significant gains since Cathie Wood’s asset management firm ARK Invest and investment manager VanEck filed applications with the United States Securities and Exchange Commission (SEC) to launch a spot Ethereum exchange-traded fund (ETF).\n\nAccording to a tweet by blockchain intelligence firm IntoTheBlock, the ETHE discount to net asset value (NAV) narrowed to 26% despite a drop in ETH price within the same period.\n\nFollowing Ark’s spot ETH ETF filing, Grayscale’s ETH fund is close to its yearly highs, even while Ether itself is down over 20%.\n\nHere’s what’s going on👇 ➡️ ETHE has increased by over 140% in 2023, significantly narrowing its discount to the underlying Ether it holds\n\n➡️ The… pic.twitter.com/PIROEgYVuT — IntoTheBlock (@intotheblock) September 8, 2023\n\nGrayscale’s ETHE Discount Narrows\n\nOn September 6, ARK Invest moved towards launching the first spot Ether ETF in the United States. In an S-1 filed with the SEC, the asset management firm said the ARK21Shares Ethereum ETF would track the performance of ETH.\n\nLeading American crypto exchange Coinbase would be the custodian of the product to hold all of the fund’s ETH, while crypto exchange-traded products issuer 21Shares is the trust’s sponsor. ARK Invest will serve as the sub-adviser of the ETF and handle the marketing of its shares.\n\nAlong with VanEck’s filing, the news caused an uproar in the crypto market, with bitcoin (BTC) and ETH recording a brief ascent before falling back to their pre-announcement levels. While the crypto assets experienced a short glee, ETHE continued to progress.\n\nIntoTheBlock said ETHE had narrowed the discount to its underlying ETH by a fair margin, recording a more than 140% increase in 2023. The discount started decreasing in June when the world’s largest asset manager, BlackRock, led several traditional finance giants to file for a spot Bitcoin ETF. The discount first moved from -56% to -36% that month and then dropped to -26% this month, reaching a level seen since October 2022.\n\nThe blockchain intelligence firm said the trend suggests that the crypto market is weighing the odds that Grayscale may convert ETHE into an ETF due to the push from other companies in the industry.\n\nLaunching the First U.S. Spot Ether ETF\n\nThe race to launch the first spot Ether ETF comes as the crypto community awaits the SEC’s approval of the set of applications seeking to launch a spot Bitcoin ETF.\n\nWhile the regulator’s next move remains unclear, Grayscale’s recent victory in the legal battle with the agency over its continued rejection of a spot Bitcoin ETF could influence the regulator’s decision.\n\nAnalysts have set May 23, 2024, as the estimated deadline for the SEC to approve the filings for a spot Ether ETF."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3RvcC0zLXByaWNlLXByZWRpY3Rpb24tYml0Y29pbi1ldGhlcmV1bS1yaXBwbGUtYnRjLWZhY2VzLWRvd25zaWRlLXJpc2stYmVsb3ctMjQtNTAwLTIwMjMwOTExMjAwMtIBkwFodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy90b3AtMy1wcmljZS1wcmVkaWN0aW9uLWJpdGNvaW4tZXRoZXJldW0tcmlwcGxlLWJ0Yy1mYWNlcy1kb3duc2lkZS1yaXNrLWJlbG93LTI0LTUwMC0yMDIzMDkxMTIwMDI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Sep 2023 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC likely to crash amid death cross forming - FXStreet",
        "content": "Share:\n\nBitcoin price breaks down, exposing BTC to the risk of sliding below the key $24,500 June lows.\n\nEthereum price could fall 10% to the $1,400 range if BTC price shows weakness below $25,586.\n\nRipple price eyes continued downtrend as XRP tests the descending parallel channel at $0.4600.\n\nBitcoin (BTC) price indicates signs of an impending slump after losing a critical support level. The gloom has extended to Ethereum (ETH) and Ripple (XRP) prices, as the broader market downtrend becomes clearer now more than ever before.\n\nAlso Read: Bitcoin price recovery bound to be delayed as Texas power crisis threatens miner reserves.\n\nBitcoin price faces risks of a downtrend\n\nBitcoin (BTC) price is down almost 3% over the last day, against a 99% increase in 24-hour trading volume. However, the odds favor the downside, with momentum indicators showing that buying pressure continues to reduce.\n\nFurthermore, a death cross hangs over Bitcoin price, indicated by the 50-day Moving Average (MA) almost crossing below the 200-day MA. A death cross pattern occurs when the short-term moving average of an asset crosses below its long-term moving average.\n\nWith the above, Bitcoin price could fall toward $24,500. This level is of particular significance as it marks the June 2023 lows and the last lowest high. Therefore, a solid break below it could extend the downtrend, possibly sending BTC to tag the $23,600 range, levels last tested on May 13. In a dire case, the downtrend could continue to $21,300, levels last seen in March. Such a move would constitute a 15% downswing from current levels.\n\nBTC/USDT 1-day chart\n\nOn the other hand, if the $24,500 support level holds, Bitcoin price could have a chance at a recovery. Increased buying pressure above this level could change the narrative for Bitcoin, sending BTC north to reclaim the $25,586 support level.\n\nIn a highly bullish case, the king of crypto could extend to breach the resistance confluence between the 50- and 200-MA at around $27,616 before a neck higher possible toward the $28,838 hurdle.\n\nIn highly ambitious cases, Bitcoin price could shatter past the $30,000 psychological level before a test of the range highs above $31,804.\n\nThe bullish convergence between Bitcoin price and two momentum indicators, RSI and MACD, adds weight to prospects of a recovery. This is indicated by BTC price recording lower lows which are not mirrored by either RSI or MACD.\n\nAlso Read: Bitcoin Weekly Forecast: BTC could revisit $21,000 as sell signals multiply ahead of US CPI.\n\nEthereum price risks 10% fall\n\nEthereum price (ETH) is $1,575 at press time, sliding south with a forecasted 10% slump to $1,407 if Bitcoin price tags $24,500.\n\nETH/USDT 1-day chart\n\nConversely, a recovery in Bitcoin price, would influence Ethereum price to correct north, possibly converting the $1,575 resistance level back to a support floor before breaching past $1,800 to tag the psychological $2,000 level.\n\nAlso Read: Grayscale Ethereum Trust discount shrinks to lowest level in a year, traders await spot ETH ETF approval.\n\nRipple price to fall back to the confines of a bearish pattern\n\nRipple (XRP) price tests the upper boundary of a descending parallel channel, with momentum indicators (RSI and AO) showing a possible breakdown back into the foothold of this bearish technical formation.\n\nA decisive flip of the $0.4600 support level back into a resistance would increase the odds for a downtrend, confirmed once XRP tests the midline of the descending parallel channel at $0.4191. In the dire case, the payments token could extend lower to the channel’s base at $0.3562, levels last seen in March.\n\nXRP/USDT 1-day chart\n\nA hold at the upper channel line and resurgence by the bulls, however, could reverse the trend for Ripple price, with a likely breach of the 200-day Exponential Moving Average (EMA) hurdle at $0.5224 before XRP can confront the resistance confluence between the 50- and 100-day EMA at around the $0.5505 and $0.5510 range. This would indicate a 15% ascent above current levels.\n\nAlso Read: XRP price reverses all gains since Judge Torres ruling as Ripple holders sentiment turns negative."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9hc3Nlc3NpbmctdGhlLWVmZmVjdC1vZi1iaXRjb2lucy1wcmUtaGFsdmluZy1vbi1ldGhlcmV1bS_SAVNodHRwczovL2FtYmNyeXB0by5jb20vYXNzZXNzaW5nLXRoZS1lZmZlY3Qtb2YtYml0Y29pbnMtcHJlLWhhbHZpbmctb24tZXRoZXJldW0vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Sep 2023 07:00:00 GMT",
        "title": "Assessing the effect of Bitcoin’s pre- halving on Ethereum - AMBCrypto News",
        "content": "ETH may form lower highs for the rest of the year, an analyst explained.\n\nThe short-term sentiment around the altcoin has moved from hope into capitulation.\n\nAnalyst Benjamin Cowen told his 778,000 YouTube subscribers that Ethereum [ETH] may be negatively affected by Bitcoin’s [BTC] pre-halving second leg. According to Cowen, the said season has hardly been favorable for ETH previously and he explained how this cycle may not be any different.\n\nRealistic or not, here’s ETH’s market cap in BTC terms\n\nIn the 29-minute-long session, Cowen highlighted that prior to the 2020 halving, ETH found itself in deplorable condition. He also mentioned that the altcoin only recovered much later after the four-year event had been completed at that time.\n\nLowering highs into capitulation\n\nAlthough he admitted that there was some upside for ETH at intervals, most were short-lived. As a result, ETH’s likely movement would be to form lower highs for the rest of the year, and possibly the first quarter of 2024.\n\nFor context, a lower high occurs If the price of an asset closes at a high price, but that high is lower than the high at the close of the previous trading day. Cowen said that,\n\n“That does not mean that Ethereum cannot at all move back up. It probably will at various phases. But the general direction should be down.”\n\nAt the time of writing, ETH’s price was $1,614, denoting a 12.61% decrease in the last 30 days. Regardless of the price action, several indicators suggest that the altcoin could be undervalued.\n\nHowever, Cowen’s projection meant that ETH may remain undervalued till year-end. But what is the short-term holder view of Ethereum?\n\nOne metric that answers this question is the Short-Term Holder-Net Unrealized Profit/Loss (STH-NUPL). As an indicator to assess the behavior of short-term investors, the STH-NUPL considers the UTXOs younger than 155 days.\n\nA UTXO refers to Unspent Transaction Output, and it reflects where each transaction starts and finishes. At press time, the STH-NUPL had slid from hope (orange) to capitulation (red). This transition implies that market players also share the view that ETH’s price would decrease further.\n\nRead Ethereum’s [ETH] Price Prediction 2023-2024\n\nFind an entry when ETH falls\n\nMeanwhile, pseudonymous trader Daan Crypto opined that ETH’s performance against BTC has been impressive this cycle. According to his post on X (formerly Twitter), Ethereum has been much more stable when compared to other altcoins despite its low volatility.\n\nBut like the general sentiment, Daan expects Ethereum to keep losing its dominance to Bitcoin. As of this writing, ETH’s value against BTC was 0.063. To buttress his point, Daan mentioned that the coin could drop 0.055. However, he also considered the said value as a good entry price."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9ldGgteHJwLWJuYi1wcmljZS1kcm9wcy1mdHgtbGlxdWlkYXRpb24v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Sep 2023 07:00:00 GMT",
        "title": "ETH, XRP, BNB Prices Suddenly Dive Ahead of FTX Liquidation - CCN.com",
        "content": "Key Takeaways\n\nThe prices of major cryptocurrencies dipped on September 11.\n\nBetween 10:20 and 10:30 UTC, Bitcoin, Ether, BNB, XRP and others all dropped sharply.\n\nInvestors are currently nervous ahead of the anticipated unlocking of a cache of crypto from FTX.\n\nThe failed exchange was preparing to request approval for liquidating $3.4B worth of cryptocurrencies on Wednesday, September 13.\n\nThe prices of major cryptocurrencies simultaneously took a dive shortly after 10:00 am (UTC) on Monday, September 11.\n\nWith BTC, BNB, ETH, and XRP all down, what caused the latest market slide? Fears over the impact of an expected multibillion-dollar liquidation of FTX assets could be behind the sudden price drop.\n\nMajor Cryptos Slide on Monday Morning\n\nBetween 10:20 and 10:30, the price of Bitcoin fell from $25,790 to $25,680. In the same ten minutes, Ether dropped more substantially from $1606 to 1590.\n\nOf course, a decline of around 1% is far from the most dramatic crash in the history of crypto. But markets are spooked nonetheless.\n\nThe global crypto market cap has declined 1.23% over the course of the past day. More worrying still, every one of the top fifty cryptocurrencies has clocked a loss in the previous 24 hours.\n\nFTX Prepares to Liquidate $3.4B Worth of Cryptocurrencies\n\nOne potential reason behind Monday’s market dip is the anticipated liquidation of cryptocurrencies locked up during FTX’s insolvency proceedings.\n\nLawyers for the company are set to appear in Delaware Bankruptcy Court on Wednesday, September 13, to request approval for liquidating $3.4B worth of cryptocurrencies.\n\nOnce approved, the assets have the potential to create downward price pressure as freshly liquidated cryptocurrency floods the market.\n\nBig selling pressure is potentially coming next week🚨 FTX will likely get approval to liquidate its assets on Sept. 13. FTX had $3.4B in crypto in April. The proposed plan is to sell assets worth up to $200M per week. pic.twitter.com/4aHnhOVKP1 — The DeFi Investor 🔎 (@TheDeFinvestor) September 9, 2023\n\nAnd while that might hardly dent Bitcoin’s market capitalization, lower market-cap altcoins could respond negatively to the increased supply.\n\nFor example, FTX holds Solana (SOL), valued at around $685 million.\n\nSuggesting a correlation between the volume of assets held by FTX and the respective tokens’ price performance, SOL has lost nearly 10% of its market value in the past week.\n\nThe silver lining for Solana investors is that the bulk of the SOL tokens held by FTX debtors can’t be sold immediately.\n\nOne thing that's worth noting about FTX's $SOL holdings: While FTX holds a very large % of $SOL supply, most of it is still locked and will be fully vested in 2028. SOL price can still be impacted in the short term. But not as bad as everyone expects. https://t.co/WZX4hL0UGx pic.twitter.com/NiDVns2qoT — The DeFi Investor 🔎 (@TheDeFinvestor) September 10, 2023\n\nWhile FTX does hold a large percentage of the total SOL supply, most of it is still locked and will be fully vested in 2028."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vY29pbmdhcGUuY29tL3ZpdGFsaWstYnV0ZXJpbi10d2l0dGVyLWFjY291bnQtaGFja2VkL9IBQGh0dHBzOi8vY29pbmdhcGUuY29tL3ZpdGFsaWstYnV0ZXJpbi10d2l0dGVyLWFjY291bnQtaGFja2VkL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Sep 2023 07:00:00 GMT",
        "title": "Vitalik Buterin Twitter Account Hacked - CoinGape",
        "content": "The official Twitter (X) account belonging to Ethereum cofounder Vitalik Buterin has reportedly been hacked, according to latest reports. Hackers are said to have dropped a harmful weblink in a new tweet, reports said, in what appears to be a phishing attack.\n\nAlso Read: Ripple CTO Says XRP Second Only To Bitcoin; Here’s Why\n\nadvertisement\n\nVitalik Buterin Twitter Account Recovered?\n\nWhile it is being claimed that the Twitter account has been compromised, it appears that the account was almost immediately recovered from the hackers. The hackers had reportedly shared a phishing link in the tweet that talked about Consensys offering a commemorative NFT to celebrate “Proto-Danksharding” coming to Ethereum. PeckShieldAlert had notified that the Ethereum cofounder’s X account has been hacked, and that it carries a phishing link.\n\n“It seems Vitalik Buterin Twitter account is hacked. And do *NOT* click the phishing link.”\n\nThe Buterin account hack comes in the context of several high profile crypto related account compromises in recent times. Earlier, in July 2023, the Twitter account belonging to Uniswap founder Hayden Adams has been compromised. With the account recovered, Buterin’s latest Twitter activity shows a blockchain privacy related paper he co-authored with Ameen Soleimani among others.\n\nAlso Read: Michael Saylor Highlights Futures ETFs Gap Vs Bitcoin Price"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vZGVjcnlwdC5jby8xNTU5MzEvZXRoZXJldW0tYml0Y29pbi1hbHRjb2luLXZhbHVlcy1kcm9wLWFzLWZ0eC1wdXJzdWVzLWNyeXB0by1saXF1aWRhdGlvbtIBZmh0dHBzOi8vZGVjcnlwdC5jby8xNTU5MzEvZXRoZXJldW0tYml0Y29pbi1hbHRjb2luLXZhbHVlcy1kcm9wLWFzLWZ0eC1wdXJzdWVzLWNyeXB0by1saXF1aWRhdGlvbj9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin Drops to 3-Month Low While Ethereum Takes Harder Hit - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin is down 3% in the past 24 hours—having dropped to its lowest level in three months—and has brought the rest of the digital asset market with it.\n\nCoinGecko data shows that the largest cryptocurrency by market cap is now trading for $25,048. The last time it was priced this low was back in mid June.\n\nEthereum, the second largest digital asset by market cap, has been hit even harder: it is currently trading hands for $1,543, its lowest level in six months.\n\nAD\n\nAD\n\nAltcoins also couldn't escape the sell-off, with ApeCoin, Sui, and Ripple all shedding significant amounts off their price.\n\nThe price slump is likely tied to failed crypto exchange FTX revealing that it's seeking regulatory approval to liquidate $3.4 billion in Solana, Bitcoin, Ethereum, and other digital assets.\n\nNot long ago, Bitcoin was soaring: a flurry of spot Bitcoin exchange-traded fund applications—including from the world's biggest asset manager BlackRock—had investors hopeful that the U.S. Securities and Exchange Commission would finally approve the long-awaited crypto product for Wall Street.\n\nBut the top regulator has dragged its heels and investors are still waiting, leading to low liquidity in the crypto market and a general wane in interest, according to experts.\n\nBitcoin is still well above the price it started the year with, when it was trading for less than $17,000 per coin. But it still has a long way to go before it touches its November 2021 all-time high of $69,044.\n\nAD\n\nAD"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL2NyeXB0b25ld3MuY29tL25ld3MvY3J5cHRvLWNhc2luby1sdWNreS1ibG9jay1vcGVucy1sYmxvY2stdjItdG9rZW4tZXRoZXJldW0tYnJpZGdlLWxhdW5jaGVzLWx1Y2t5LWJsb2NrLXRlbGVncmFtLWNhc2luby1zcG9ydHNib29rLmh0bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Sep 2023 07:00:00 GMT",
        "title": "Crypto Casino Lucky Block Opens LBLOCK V2 Token Ethereum Bridge, Launches Lucky Block Telegram Casino and ... - Cryptonews",
        "content": "Crypto Casino Lucky Block Opens LBLOCK V2 Token Ethereum Bridge, Launches Lucky Block Telegram Casino and Sportsbook\n\nHolders of the LBLOCK native crypto casino token of the fast-growing Lucky Block Casino and Sportsbook will be able to fully convert to its Ethereum variant from September 11.\n\nFollowing the April 2023 integration of the LBLOCK token into the Casino, this is the next major step on the roadmap to re-energize LBLOCK as the world’s premier native token of the gambling industry.\n\nIn a series of two staged openings, on 11-17 September and 25 September to 1 October, holders of the original LBLOCK V1 BNB Smart Chain (BEP-20) version of the token will be able to convert it to the LBLOCK V2 Ethereum-compliant (ERC-20) version.\n\nThe bridge opens at 3pm UTC and can be accessed by visiting https://www.luckyblock.com/en/how-to-buy-lucky-block .\n\nBridging cryptocurrencies is a complicated technological process that requires rigorous security testing. This is why the Bridge is not kept open outside of the two one-week windows.\n\nHowever, for users of the bridge, this complexity is hidden. Users will simply need to connect their wallet to the official bridging website to swap their tokens.\n\nThe team has released on Twitter and Discord a step-by-step LBLOCK bridging guide on how to use the bridge and comprehensive frequently asked questions (FAQs) to address all aspects of the bridging process.\n\nLucky Block’s LBLOCK V2 token is currently priced at $0.00009085.\n\nA new Lucky Block whitepaper pulling together roadmap changes and the way forward for the ecosystem will be published during the 60-day vesting period that applies to bridged assets.\n\nAdvantages of LBLOCK on Ethereum; Lucky Block crypto casino launches on Telegram\n\nLucky Block crypto casino is widely publicizing the opening of the bridge in order to make sure that the whole community is aware.\n\nConverting to Ethereum has many advantages for token holders, chief among them being the higher price of the ERC-20 token compared to the V1 BEP-20 token.\n\nHowever, the Ethereum blockchain is also the largest and most important network for hosting and running decentralized applications, so the migration opens up LBLOCK to a world of greater business development and interoperability.\n\nBridging involves making transactions on the Ethereum blockchain, which incurs costs. Because of this, the 12% transaction tax on LBLOCK V1 tokens will not apply.\n\nIn other related news – and a further boon for the community – this week, the Lucky Block Telegram Casino and Sportsbook bot launched on the Telegram app.\n\nCommunity manager Damian Jacobs: “Exciting and profitable time ahead”\n\nCommenting on the bridging and Telegram news, Damian Jacobs, community manager at Lucky Block, said: “After the delay that unfortunately followed our previous bridge announcement, I am extremely pleased to be able to confirm the bridge opening on September 11.\n\n“Long-term holders of the first version of the LBLOCK token can now rest assured that the value of their tokens has been safeguarded for the future. In fact, the growth plans we have for the token will place its holders at the cutting edge of our booming industry.\n\n“From the Platinum Rollers Club NFTs to the expanding utility of the LBLOCK Ethereum-based token, we can together look forward to an exciting and profitable time ahead.\n\n“And this week, we launched the Lucky Block Telegram Casino and Sportsbook bot. We are among the first fully regulated betting firms to set up shop on Telegram. Game on!”\n\nThere’s no tax when you bridge to LBLOCK V2 and vesting will dampen price volatility\n\nBecause of the price volatility inherent in swapping from one actively traded asset to another and the arbitrage opportunity it will attract, a 60-day vesting period will apply for all newly bridged tokens.\n\nAcross the 60-day period, 16.65% will be unlocked every 10 days, based on the principal bridged amount. By the end of the 60-day vesting period, 100% of the vested tokens will have been released.\n\nThe impact of the vesting period will be to reduce price volatility and provide a foundational basis for the price of the Ethereum-based token to appreciate.\n\nLBLOCK’s new improved value proposition: new tournaments, special jackpots Platinum Rollers Club NFT VIP Program, CEX listings… and much more to come\n\nLucky Block’s development team is currently working on bringing new utility features to the LBLOCK token, thereby enhancing its value proposition for token holders.\n\nDuring the vesting period, holders of the bridged assets will see the introduction of a variety of gamification and crypto-related features.\n\nAmong the new services will be revaps of existing products. So, for example, the owners of the Platinum Rollers Club NFTs will see the long-awaited implementation of the VIP Program. It will include preferential and exclusive entry to a range of product offerings in the Lucky Block Casino.\n\nThere will also be a special tier of the Lucky Block Loyalty Program for LBLOCK.\n\nOther products being planned include tournaments and special jackpots in which the LBLOCK token will unlock exclusive access and prize features.\n\n\n\nAs dual-coin confusion ends, plans for more LBLOCK CEX listings take shape\n\nCrucially, as part of the team’s commitment to the future success of the LBLOCK token, more centralized exchange listings will be sought. LBLOCK V2 token is already listed on a number of top centralized exchanges, including Gate.io , MEXC and LBank .\n\nThe end to the confusion surrounding the two versions of the coin will make it easier for the team to get LBLOCK listed on more centralized exchanges.\n\nPrior to the launch of the Lucky Block Casino and Sportsbook in November 2022, the main product of the platform was prize draws and lotteries.\n\nThe team has confirmed that the lottery feature will return in a different form, with a version specially designed for Lucky Block token holders.\n\nLucky Block is not limiting its LBLOCK V2 token to be just the native token of Lucky Block, as important as that is. The business development team is looking at the possibility of introducing the token to more casinos.\n\nThe list of coins customers can use on Lucky Block Casino and Sportsbook includes LBLOCK, Bitcoin, Ethereum, Litecoin, Dogecoin, Tether (USDT), Cronos, Monero, Dash, Zcash, Solana, Avalanche, Dai, Chainlink, Polygon, USD Coin, Polkadot, Uniswap, Shiba Inu and Wrapped Bitcoin.\n\nAs LBLOCK gains traction within and beyond the Lucky Block Casino and Sportsbook, it aims to grow its reputation and visibility as the leading gambling and gaming-focused cryptocurrency in the booming sector.\n\nAccording to data supplied by crypto analytics and information site CoinGecko, LBLOCK V2 is the 11th-ranked coin in the crypto gambling sector, with a fully diluted market capitalization value (FDV) of $9,489,804.\n\n\n\nGambling is a huge market opportunity for Lucky Block, plus Lucky Block Telegram Casino and Sportsbook launched this week\n\nProblems at Stake.com aside, online betting is a booming industry, last valued at $63.5 billion in 2022 , and is expected to grow at a compound annual growth rate of 11.7% between 2023 and 2030.\n\nWithin that space, crypto is the fastest growing segment, and it is innovators like Lucky Block who are sure to be the major beneficiaries.\n\nSpeaking of innovation, as mentioned earlier, Lucky Block recently stealth-launched its casino on the Telegram messaging app, laying down the gauntlet to the competition.\n\nThe Lucky Block Telegram Casino and Sportsbook allows users to quickly get up and running because it leverages the KYC of Telegram to make onboarding a breeze.\n\n\n\nTelegram bots make it super easy to use, providing access to Lucky Block’s fully featured service that includes all the online casino favorites such as slots, poker, live casino, and table games, including roulette and blackjack.\n\nLBLOCK is the must-have crypto casino asset to unlock the world of gaming – overnight, it turns token holders into VIP patrons with a front-row seat in the most exciting growth sector in crypto."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWV0aGVyZXVtLXNvbGFuYS14cnAtY3J5cHRvLWFzc2V0cy1leHBlcmllbmNlLWZvdXJ0aC1zdHJhaWdodC13ZWVrLW91dGZsb3dz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Sep 2023 07:00:00 GMT",
        "title": "XRP bucks trend as crypto assets experience 4th straight week of outflows - Cointelegraph",
        "content": "Cryptocurrency asset outflows for the week of Sept. 3 through 9 totaled $59.3 million, bringing the current run to $249 million over four consecutive weeks.\n\nBitcoin (BTC) experienced the bulk of activity last week, with its $68.9 million in outflows offset by Short Bitcoin inflows in the amount of $15.2 million and $0.7 million from XRP (XRP).\n\nAccording to CoinShares, regulatory and financial market insecurity are to blame for the streak:\n\n“We believe continued worries over regulation of the asset class and recent dollar strength are the most likely reasons for this. Trading volumes also dropped significantly, by 73% in comparison to the prior week to just US$754 million for the week.”\n\nLast week also brought an end to Solana’s (SOL) recent run. After nine weeks of inflows totaling $14.1 million prompted CoinShares to suggest that it was “the most loved altcoin amongst investors,” Solana saw $1.1 million in outflows.\n\nEther (ETH) also experienced outflows for the week, with its $4.8 million trailing a distant second behind Bitcoin. With its year-to-date outflows now totaling $108 million, CoinShares has labeled it the “least loved digital asset amongst ETP [exchange-traded product] investors this year.”\n\nCrypto flows. Source: CoinShares\n\nGeographically, only Brazil registered inflows with a modest $0.1 million. Germany, Canada, and the United States led activity with $20 million, $17.6 million and $12.3 million in outflows, respectively.\n\nSwitzerland and Sweden also experienced significant outflows, with the former losing $7.4 million and the latter another $2.3 million.\n\nExpert analysts are predicting a continuation of Bitcoin’s slump, with some expecting the coin to reach as low as $20,000. This negative sentiment could contribute to further outflows, as the current four-week run seems to indicate that altcoins are unlikely to upset the balance of flows one way or the other.\n\nRelated: Double top ‘likely’ confirmed — 5 things to know in Bitcoin this week"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1kaXBzLWFmdGVyLWZvdW5kZXItdml0YWxpay1idXRlcmlucy10d2l0dGVyLWFjY291bnQtZ2V0cy1oYWNrZWQv0gFjaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2V0aGVyZXVtLWRpcHMtYWZ0ZXItZm91bmRlci12aXRhbGlrLWJ1dGVyaW5zLXR3aXR0ZXItYWNjb3VudC1nZXRzLWhhY2tlZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Sep 2023 07:00:00 GMT",
        "title": "Ethereum dips after founder Vitalik Buterin’s Twitter account gets hacked - AMBCrypto News",
        "content": "In the guise of an NFT promotion, a hacker attached a phishing link to the tweet.\n\nIt was estimated that the hacker managed to steal funds exceeding $100,000 through this attack.\n\nIn a recent turn of events, Vitalik Buterin, the co-founder of Ethereum [ETH], fell victim to a hacking incident involving his Twitter account. This breach of security raised concerns within the cryptocurrency community and could potentially impact the sentiment surrounding Ethereum.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nWhat the hack\n\nThe hacking incident involved the unauthorized use of Vitalik Buterin’s Twitter account. The attacker, in the guise of promoting an NFT collection associated with the firm ConsenSys, attached a phishing link in the tweet.\n\nThe hacker’s activities on Vitalik’s account immediately raised alarms, prompting a warning from PeckhieldInc, a cybersecurity company specializing in the crypto sector.\n\nHowever, it’s worth noting that the swift response of the crypto community and cybersecurity experts resulted in the removal of the malicious tweets from Vitalik’s account. At the time of writing, it appeared that Vitalik’s Twitter account was back in safe hands.\n\nThe financial implications of this security breach were substantial. It is estimated that the hacker managed to steal funds exceeding $100,000 through this attack. An examination of the wallet’s holdings revealed a balance of $397,138.21 at the time of discovery.\n\nYou can trace the activity of the @VitalikButerin hacker here on @ArkhamIntel:https://t.co/3rsPFJsK3T So far more than $100,000 in stolen funds. The more you spread awareness messages, the less victims there will be. Hacker address:\n\n0x4eF6f0d3f94fF609ACef88068b1FC66a1184b3f3 https://t.co/VOnD6HcQov — Yazan (@YazanXBT) September 9, 2023\n\nThe majority of assets held by the hacker in the compromised wallet are in ETH, followed by other tokens like ATOR, wrapped ETH, USDC, and BNB.\n\nApparently, the hacker gained access to Vitalik Buterin’s Twitter account by a technique known as SIM swap. This technique involves transferring a phone number from one SIM card to another, often accomplished through cooperation or fraud with mobile carriers.\n\nUnauthorized SIM swaps can lead to identity theft and unauthorized access to online accounts, posing severe risks to individuals’ assets and personal information.\n\nHow is ETH doing?\n\nThis breach of safety could impact the sentiment around ETH as well. According to Santiment’s data, the weighted sentiment around ETH declined materially over the last few days.\n\nRealistic or not, here’s ETH’s market cap in BTC terms\n\nAdditionally, Ethereum’s price experienced a decline as well. At the time of writing, Ethereum was trading at $1623, signaling a drop in value.\n\nHowever, despite the price downturn, the number of Ethereum addresses holding non-zero balances continued to grow. Glassnode data revealed that the number of non-zero addresses reached an all-time high of 105,721,874."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vZmluYm9sZC5jb20vcG9tZXJkb2dlLXBvbWQtaXMtbWFraW5nLXdhdmVzLWFzLWJpZy1ldGhlcmV1bS1ldGgtaG9sZGVyLWJ1eXMtaW50by10aGUtcHJlc2FsZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Sep 2023 07:00:00 GMT",
        "title": "Pomerdoge (POMD) is making waves as big Ethereum (ETH) holder buys into the presale - Finbold - Finance in Bold",
        "content": "Press Releases are sponsored content and not a part of Finbold's editorial content. For a full disclaimer, please click here. If you encounter any issues, kindly report them to [email protected]. Crypto assets/products can be highly risky. Never invest unless you’re prepared to lose all the money you invest.\n\nPomerdoge (POMD) has taken over the world, and everybody is talking about this presale. One Ethereum (ETH) whale has participated, and these whales only buy a token they believe in. What convinced this whale to participate? And why do analysts think that Pomerdoge could be the best-performing altcoin of 2023?\n\n\n\nThis article dives into these questions and more, examining the blazing trail of Pomerdoge and why this memecoin could quickly become 2023’s hottest project.\n\nClick Here To Find Out More About The Pomerdoge (POMD) Presale\n\n\n\nPomerdoge (POMD) NFTs, Memecoins Tokenomics, and P2E\n\n\n\nPomerdoge continues its wildly successful presale and has nearly raised $2 million already. Whales have flipped bullish, and analysts believe that $POMD, the native token, could easily rally 3,500% in the coming weeks.\n\n\n\nIntroducing the new meta of P2E. Pomerdoge blends memecoin economics, the ability to rapidly soar, with utility in the form of the Pomergame, which gives the 3 billion users who actively play video games globally a platform to network and earn. Players level up their characters, and when they reach gold status, they can begin selling items in the Pomerplace!\n\n\n\nThe protocol has a collection of 7,777 unique NFTs. Although the team has not disclosed their function, analysts are hyper-bullish on this collection, believing it to be the key to the ecosystem. They are currently available to mint for just 0.2 $ETH for $POMD holders.\n\n\n\nPomerdoge’s token $POMD continues to rise in price throughout the presale as demand increases, and with no buy or sell taxes, investors get to keep 100% of their profits. Liquidity will be locked, and Cyberscope and Solidproof, two leading smart contract auditors, have released their audits showing that Pomerdoge passed with fly colors.\n\n\n\nOne of the most exciting altcoins on the market, Pomerdoge is poised to shatter records and leap straight into the top 100 projects. Joining ICOs has always been one of crypto’s most profitable endeavors, and joining the Pomerdoge presale today could be one of investors’ best decisions.\n\n\n\nEthereum (ETH) Futures Product Coming Soon?\n\n\n\nEthereum is arguably the king of altcoins and slowly becoming the internet’s value layer. Alternative layer one defined the last cycle, but layer twos will define the coming cycle. Why is this excellent for Ethereum? All layer twos ultimately settle on Ethereum and use $ETH as their native currency.\n\n\n\nMore bullish news comes from the increasing number of Ethereum ETF Futures products awaiting approval. Following the SEC’s defeat in court against Greyscale, its approvals will likely be more lenient. But the end goal for many supporters is an Ethereum Spot ETF, and a Futures approval is the first tangible step towards this goal.\n\n\n\nPrice predictions for $ETH remain incredibly optimistic, with analysts forecasting a potential range between $4,395.39 and $5,124.95. With the pendulum swinging back towards an Ethereum-centric landscape, investors should focus on $ETH and all the ERC20 coins under its broad umbrella, like $POMD, in the coming months.\n\n\n\nVisit the links below for more information about Pomerdoge (POMD):\n\nWebsite: https://pomerdoge.com/\n\nTelegram Community: https://t.me/pomerdoge"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vZGVjcnlwdC5jby8xNTU4MjkvZnR4LWRldGFpbHMtaXRzLTMtNC1iaWxsaW9uLWNyeXB0by1wb3J0Zm9saW8tb2Ytc29sYW5hLWJpdGNvaW4tYW5kLWV0aGVyZXVt0gFraHR0cHM6Ly9kZWNyeXB0LmNvLzE1NTgyOS9mdHgtZGV0YWlscy1pdHMtMy00LWJpbGxpb24tY3J5cHRvLXBvcnRmb2xpby1vZi1zb2xhbmEtYml0Y29pbi1hbmQtZXRoZXJldW0_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Sep 2023 07:00:00 GMT",
        "title": "FTX's $3.4 Billion Crypto Portfolio Includes Solana, Bitcoin and Ethereum - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA court filing on Monday revealed that failed crypto exchange FTX owns $1.16 billion worth of Solana (SOL) tokens – worth more than one-third of the company’s total $3.4 billion liquid crypto portfolio.\n\nIts next largest crypto stash, Bitcoin (BTC), is worth $560 million based on pricing as of August 31. Ether (ETH) comes in at a distant third worth $196 million, with Aptos (APT) – the 36th largest crypto asset by market capitalization – was accounted for $136 million.\n\nSolana also made FTX’s largest venture token investment worth $137 million, with NEAR token in second at $80 million.\n\nAD\n\nAD\n\nThe company also owns a separate stash of “Category B” crypto assets – lesser-known tokens that “fail to meet liquidity thresholds and/or are largely controlled by the estate.” These include approximately 10 billion Serum (SRM) tokens—the Solana decentralized exchange that went bust when it was revealed that FTX secretly had access to unilaterally change the protocol—and 269 million Mango (MNGO) tokens.\n\nMeanwhile, Solana Labs co-founder Anatoly Yakovenko seems intent to carry on despite signs that FTX's estate is preparing to liquidate its holdings.\n\nIf everyone is throwing shade, then we will code in the shade https://t.co/KsvadiZRAR — toly 🇺🇸 (@aeyakovenko) September 10, 2023\n\nToday's court document provides a detailed breakdown of the bankrupt crypto exchange's assets including crypto, cash, government-recovered assets, and other investments, alongside payments made to former boss Sam Bankman-Fried and other executives.\n\nSince filing for bankruptcy in November, FTX has secured another $1.5 billion in cash on top of the $1.1 billion it held at the time of the collapse.\n\nAD\n\nAD\n\nThe former CEO, his right-hand Gary Wang, and ex-Alameda CEO Caroline Ellison received $2.2 billion in “cash, crypto, equity and real estate,” alongside 46 others. Roughly $87 million in “political and charitable donations” to third parties were also identified.\n\nU.S. law may allow such payments to be clawed back and distributed to creditors. Thus far, executives including Wang, Ellison, Nishad Singh, and Ryan Salame have already pleaded guilty to various forms of fraud around misuse of client funds and campaign finance violations.\n\nThe estate also owns 38 condos in the Bahamas collectively worth $222 million by book value."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vdGVjaG5leHQyNC5jb20vMjAyMy8wOS8xMS92aXRhbGlrLWJ1dGVyaW4teC10d2l0dGVyLWFjY291bnQtaGFja2VkL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Sep 2023 07:00:00 GMT",
        "title": "Ethereum founder Vitalik Buterin X account hacked followers lose $690k - Technext",
        "content": "The crypto space has always been inundated with several hacks, breaches and exploits, but now one of the most prominent personalities in the industry, Vitalik Buterin, Ethereum co-founder has become a victim.\n\nAccording to reports over the weekend, Vitalik’s X (Twitter) account was targeted by a hacker, who managed to steal almost $700,000 from unsuspecting users after sharing malicious links through the hacked account.\n\nHow it happened\n\nOn Saturday, in a now-deleted post, the hacker who gained access to Vitalik Buterin’s account made an announcement about the launch of a new set of commemorative NFTs from software provider, Consensys.\n\nRead also:\n\nCrypto exchange founder sentenced to 11,196 years in prison for fraud\n\nThe link, which was visible to Vitalik Buterin’s 4.9 million followers on X, urged users to connect their wallets and mint the NFTs. Unbeknownst to the victims, it was a malicious link to entice them to connect their wallets before ultimately stealing all their funds.\n\nIn an X (Twitter) post on Sunday, Dmitry Buterin, the father of Vitalik Buterin, announced that his son’s account had been compromised:\n\n“Disregard this post, apparently Vitalik has been hacked. He is working on restoring access.”\n\nBut unfortunately, the deed had already been done.\n\nAccording to prominent blockchain investigator, ZachXBT, the incident led to victims collectively losing over $691,000 after clicking on the malicious link. Ethereum developer Bok Khoo, also known as Bokky Poobah on X, claims that he has suffered losses in his CryptoPunk NFT collection. At press time, the floor price for a CryptoPunk NFT stands at 46.99 ETH which is around $76,000.\n\nZachXBT later on Sunday shared that the most valuable NFT stolen so far is CryptoPunk #3983, worth 153.62 ETH (around $250,000).\n\nAlthough Vitalik Buterin hasn’t commented on the issue yet, speculators insist that his account must have been compromised because he might not have implemented sufficient security measures.\n\nIncessant hacks in the crypto space\n\nThis latest incident adds to an ever-increasing list of social media hacks that have resulted in the loss of millions of tokens. According to a report by Immunefi, Web3 platforms have lost over $1 billion in hacks and rug pulls in 2023 so far. The report highlighted 211 separate incidents and concluded that crypto investors lost a total of $54 million in a single month.\n\nRecall that in August, the Terra blockchain’s official website was taken over by hackers who posted a series of malicious links. This series of attacks has brought X (Twitter)’s security into question, with Binance CEO Changpeng Zhao stating that the platform’s security is not well designed compared to traditional financial accounts and platforms.\n\n“It needs quite a bit more features: 2FA, login ID should be different from handle or email, etc. In the past, I have had my Twitter account locked a few times due to hackers trying to brute-force it (trying different passwords repeatedly). This was before the ‘Elon era.’” – Changpeng Zhao, Binance CEO said.\n\nTwo-factor authentication is one of the most widely accepted and recommended defences against hackers. Users are required to set two sets of information that verify their identity before letting them access an account. Twitter supports two-factor authentication, but only for paid users.\n\nVitalik Buterin\n\nRead also: Sam Altman’s Worldcoin banned for one year in Kenya\n\nOn the flip side, some X (Twitter) users speculate that Vitalik Buterin’s account was compromised through a SIM swap attack. SIM swapping involves taking control of someone’s phone number in order to overcome some two-factor security measures on websites like crypto exchanges or social media sites.\n\nIt is however not certain yet as Buterin’s high profile makes him susceptible to various forms of hacking attempts. It is however important to be wary of clicking links, especially random ones on social media."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9hcmJpdHJ1bXMtZnJhdWQtcHJvb2ZzLWhhdmVudC1iZWVuLXVzZWQtc2luY2UtaXQtbGF1bmNoZWTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Sep 2023 07:00:00 GMT",
        "title": "Arbitrum's fraud proofs haven't been used in the two years since it launched - Cointelegraph",
        "content": "Not a single fraud proof has been submitted on Arbitrum since it first launched its mainnet with the built-in security feature in August 2021, according to Ed Felten, co-founder and chief scientist of the Arbitrum-building Offchain Labs.\n\nOperating as an Ethereum layer-2, Arbitrum’s interactive, multi-round fraud proofs work by allowing a layer-1 verifier contract to decide whether the challenger’s fraud-proof submission is valid. If so, the fraudulent validator’s stake is slashed.\n\nFraud proofs are submitted by challenging validators when they considers another validator to have fraudulently or otherwise incorrectly assembled an incoming batch of transactions into the next block.\n\nHowever, Arbitrum’s mainnet is yet to see a fraud-proof attempt let alone a successful challenge, Felten told Cointelegraph at Korean Blockchain Week on Sept. 4:\n\n“Not on mainnet. We did have one or two on Ethereum proof-of-work (PoW). After the Merge, [...] there was a version of Arbitrum running on the Ethereum PoW fork, and somebody did try to steal all the data, and there was a successful challenge which defeated that.”\n\nfraud-proofFelten said few fraud proof attempts had been made because malicious-intended validators risk losing their entire stake.\n\n“If any one person notices it and disputes your claim then you will surely lose your stake, so there’s a stronger disincentive to try,” Felten added.\n\nBoth Arbitrum and Optimism operate as optimistic rollups!\n\n\n\nHowever, Optimism and Arbitrum differ in their approaches to fraud-proof mechanisms.\n\n\n\nArbitrum: multi-round → longer confirmation times, more secure\n\nOptimism: single-round → faster\n\n\n\n4/ pic.twitter.com/mp0Nj86Fxz — The Smart Ape (@the_smart_ape) September 1, 2023\n\nFelten said there’s currently a permissioned set of validators — roughly 12 — that participate in the fraud-proof game.\n\nHe also added that Arbitrum is rolling out a new iteration of the fraud proofs called “BOLD” protocol — (Bounded Liquidity Delay) — which he says gives Arbitrum a faster guarantee for challenges.\n\n“In the current version [...] an adversary who’s willing to sacrifice multiple stakes can arrange to cause ‘N’ weeks of delay if they’re willing to sacrifice ‘N' stakes [...] But the BOLD protocol says no matter how many stakes they sacrifice, they’ll be defeated in about eight days.”\n\nRelated: Arbitrum founder says Stylus is a game changer for EVMs\n\nArbitrum’s BOLD protocol was rolled out by Offchain Labs on Aug. 4.\n\nAfter months in dev, we’re announcing BOLD (Bounded Liquidity Delay), a new dispute protocol that enables permissionless validation for Arbitrum chains, potentially removing the need for permissioned validation, dramatically improving decentralization. https://t.co/SHegVRGqXf — Offchain Labs (@OffchainLabs) August 3, 2023\n\nFelten said Arbitrum’s fraud proof feature will soon be permissionless, allowing anyone to push towards ensuring the correctness of the chain when challenges are made.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: DeFi Dad, Hall of Flame: Ethereum is ‘woefully undervalued’ but growing more powerful"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9ldGhlcmV1bS1hbmQtYml0Y29pbi1wcmljZS1zdHJ1Z2dsZXMtYnV0LXdoYWxlcy1maW5kLWhvcGUtaW4tdGhpcy1mYXN0LXJpc2luZy1nYW1lZmktc2Vuc2F0aW9uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Sep 2023 07:00:00 GMT",
        "title": "Ethereum and Bitcoin Price Struggles. But, Whales Find Hope in This Fast-Rising GameFi Sensation - Analytics Insight",
        "content": "The price struggles among various crypto projects following these last rocky couple of weeks haven’t exempted even the biggest projects. Ethereum and Bitcoin also had major tumbles, leaving their investors and whales in unfavorable conditions.\n\nHowever, the good news is crypto investors and whales have now found hope in this fast-rising GameFi sensation called, Pikamoon (PIKA). With an uptick set for new profitable heights and high returns, it’s about to be a turnaround for ETH and BTC whales as well as other investors once they switch to PIKA.\n\nEthereum Price Fall Might Not be Ending Soon\n\nEthereum price indicators continue to exhibit signs of a further bearish trajectory, backed up by the breach of the ascending trendline. This breach has also seen ETH fall below the critical support level of $1,687, paving the way for a possible 27% ETH price fall. Analysts believe ETH could potentially reach the psychological benchmark of $1,200, with intermediate support of $1,366.\n\nIn addition, the higher EMA 100 has just crossed with the lower EMA 50 from a downward viewpoint, symbolizing a bearish market momentum. Likewise, the histograms of the AO have transitioned to red, with powerful bodies placed below the zero line, showing signs of intensified selling pressure.\n\nConsidering this tricky situation, experts advise investors to seek alternatives in other promising altcoins as it will have a huge impact on a reversal in the ETH price trend.\n\nBitcoin Price Prediction Leaves BTC Investors Worried\n\nAccording to chart analysts, the 50-day Exponential Moving Average (EMA) set at around $27,300 has significantly influenced Bitcoin’s price trajectory. The recent candle closures confirm a strong bearish trend. Then, there’s a quick resistance at $26,200. Regardless, that there’s a bearish engulfing candlestick and a two-day candle pattern beneath this level implies the bearish pressure will continue.\n\nShould this trend continue, Bitcoin’s price could fall to $25,600, and possibly even lower to $25,200. Still, the breach of the $26,200 resistance could signal the subsequent resistance at $26,800, a momentum that could lead BTC’s price toward levels of $27,300 and eventually $27,600. On the flip side, a breach below $25,200 might signal the possibility of more profound losses, potentially going downward to as low as $24,800.\n\nPikamoon (PIKA) Provides Ethereum and Bitcoin Whales With Hopes of a Comeback\n\nEthereum and Bitcoin whales are in luck as savvy investors identify Pikamoon as the hope they seek.\n\nPikamoon is a hybrid meme coin project that combines an advanced play-to-earn metaverse game, Pikamoon Adventure, and a hybrid deflationary token equipped with features inspired by advanced technologies and innovations to offer investors and gamers an easy path to explosive returns.\n\nHere are some of these features:\n\nUnique GameFi Offering\n\nPikamoon (PIKA) delivers GameFi uniquely, from the immersive gameplay, to the money-making opportunities, and the fast-growing token.\n\nAlso, Pikamoon’s GameFi structure maximizes PIKA, positioning it for explosive ROIs by keeping it in demand. Furthermore, the addition of the exchange and in-game trading marketplace spices up the uniqueness of this GameFi setup for gamers and investors.\n\nPikamoon Makes Expansion Easier\n\nPikamoon ensures it grows easily by building on two powerful blockchains renowned for NFT and Metaverse excellence, MultiversX (formerly Elrond) and Ethereum. Therefore, the different parts of Pikamoon as a project get spread across both blockchains, allowing Pikamoon to expand and take on any level of user influx easier and faster.\n\nPIKA is Crucial to the Pikamoon Project\n\nPIKA is the project’s utility, reward, exchange, and purchase token. These use cases will boost the token’s demand, increasing the value of the token.\n\nInvestors are Already Making Profits in the Ongoing Pikamoon Presale\n\nPikamoon presale started on a high note right from the first phase recording a 100% price increase and six figures in sales. This drew in several investors and as experts predicted, that led to more profits in subsequent phases as PIKA completed a 300% ROI hitting $0.0006. This surge raised $4 million in PIKA sales.\n\nNow, experts predict more profits this year, foreseeing PIKA delivering a potential 10,000% ROI before 2023 ends. This is an opportunity you don’t want to miss!\n\nFind out more about Pikamoon (PIKA):\n\nBuy Now: https://pikamoon.io/buy\n\nWebsite: https://pikamoon.io\n\nTwitter: https://twitter.com/Pikamooncoin\n\nTelegram: https://t.me/pikamoonofficial\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vZGVjcnlwdC5jby8xNTU3MzgvaGFja2VyLXN0ZWFscy02OTAwMDAtYWZ0ZXItaGlqYWNraW5nLXZpdGFsaWstYnV0ZXJpbi14LWFjY291bnTSAV5odHRwczovL2RlY3J5cHQuY28vMTU1NzM4L2hhY2tlci1zdGVhbHMtNjkwMDAwLWFmdGVyLWhpamFja2luZy12aXRhbGlrLWJ1dGVyaW4teC1hY2NvdW50P2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Sep 2023 07:00:00 GMT",
        "title": "Hacker Steals Over $690,000 After Hijacking Vitalik Buterin's Twitter Account - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum creator Vitalik Buterin appears to have fallen victim to a hacker on Twitter, who went on to steal $691,000 from users who followed a corrupted link posted to his feed.\n\nThe hack was first noticed on Saturday when a post appeared on Buterin’s post announcing the launch of a set of commemorative non-fungible tokens (NFTs) from software provider Consensys. This malicious link—which could have been shown to many of his 4.9 million followers—prompted victims to connect their wallets to mint the NFT, but in reality, it simply created a vacuum for the hacker to make off with their funds.\n\nOn Crypto Twitter, users were quick to raise the alarm about the fake link, but the first apparent acknowledgment that Buterin was hacked came from his father, Dmitriy \"Dima\" Buterin.\n\nAD\n\nAD\n\nDisregard this post, apparently Vitalik has been hacked. He is working on restoring access. https://t.co/2fjM0GhvIa — dima.eth (@BlockGeekDima) September 9, 2023\n\nThe post has since been deleted, but the damage was done, as a number of victims reported losing access to funds from their wallets. Within the hour, the hacker appeared to make off with more than $147,000, but that quickly increased to $691,000, according to blockchain investigator @ZachXBT.\n\nIn the day since the hack was first reported, Buterin has not yet commented publicly on the incident, his most recent post again being a retweet of a Sept. 6 post. @ZachZPT reported that the hacker subsequently sent a stolen NFT to Buterin.\n\nthey hacker just sent Vitalik this NFT they drained 0x909c74236ded54ecea95ea1568e1abf67624ccae436d1b9d94cd0c163b11eec5 pic.twitter.com/Fx6ekDYyWR — ZachXBT (@zachxbt) September 10, 2023\n\nIt is unknown just how many users were affected, but this latest incident adds to a growing list of hacks over social media that have netted millions in tokens.\n\nAD\n\nAD\n\nAfter so many losses, there has been a debate on how victims should be compensated for their losses by developers themselves. Twitter’s own security also came into question, including by Binance CEO Changpeng Zhao, who wrote that the platform’s account security \"is not designed” well compared to traditional financial accounts.\n\n“It needs quite a bit more features: 2FA, login ID should be different from handle or email, etc.,” wrote Zhao, referring to two-factor authentication. “In the past, I have had my Twitter account locked a few times due to hackers trying to brute-force it (trying different passwords repeatedly). This was before the 'Elon era.'”\n\nTwo-factor authentication is a widely recommended defense method for users to require two sets of information to verify their identity before accessing an account. It is supported by Twitter, but only for users who pay for Twitter Blue. Brute forcing is a tactic where hackers bombard an account with access requests until one eventually breaks through."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vY2lvbmV3cy5jby5pbi9uZXVyb25pYWktZXRoZXJldW0tbm9kZS1uZXVyYWwtbmV0d29yay1nZXQtYWN0aXZhdGVkL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Sep 2023 07:00:00 GMT",
        "title": "NeuroniAi Ethereum Node & Neural Network get activated: Revolutionizing AI & Decentralization on the Ethereum ... - CIO News",
        "content": "Neuroni AI’s Ethereum Node and Neural Network: Unleashing a New Era of Decentralised AI on the Ethereum Blockchain\n\nGLOBAL, September 10, 2023/EINPresswire.com/: Neuroni Ai’s Founder, Adam Leroix-Sainz, Introduces the First AI Ethereum Node on the Mainnet\n\nNeuroni Ai, a prominent figure in the blockchain industry, is proud to announce a significant milestone in the world of Ethereum: the launch of the Neuroni Ethereum Node on Mainnet. This groundbreaking achievement marks a transformative moment for the Ethereum network, ushering in a new era of possibilities and advancements.\n\nThe Neuroni Ethereum Node, with its implementation of the Private Node, represents a pivotal development for Ethereum, introducing users to the concept of AIDeFi, a fusion of artificial intelligence and decentralised finance. This innovation promises an unparalleled transaction experience, characterised by exceptional speed, efficiency, and cost-effectiveness.\n\nNeuroni Ai Etherium Node is Like a… Teleport Technology When People Still Use Airplanes,” said Adam Leroix-Sainz.\n\nNeuroni Ai’s contribution extends beyond mere innovation; it represents a commitment to improving the Ethereum ecosystem’s core functionalities and setting new standards for performance, security, and governance.\n\nThe Neuroni Ethereum Node empowers Neuroni Ai with direct control over the blockchain data it interacts with, ensuring enhanced privacy and security. The node enables the validation of transactions, storage of blockchain data, and active participation in the consensus process. Neuroni and its community now have the opportunity to engage in Ethereum’s governance, allowing users to influence the network’s future through voting on critical decisions and proposals.\n\nThe integration of advanced AI processing capabilities within the Neuroni Node offers several avenues for enhancing the Ethereum Network:\n\nAnomaly Detection: Neuroni can analyse transaction patterns and network behaviour on the Ethereum blockchain. By leveraging machine learning algorithms, Neuroni identifies suspicious or anomalous activities, such as potential security threats like hacking attempts or fraudulent transactions.\n\nPredictive Analysis: Neuroni’s historical blockchain data analysis applies predictive techniques to identify future security risks or vulnerabilities. This proactive approach detects patterns and trends, providing insights to strengthen the Ethereum network’s overall security.\n\nNetwork Monitoring: Neuroni continuously monitors the Ethereum network for suspicious activities or network attacks. By analysing network traffic and transaction flows, Neuroni detects and mitigates potential threats, ensuring blockchain integrity and security.\n\nCollaboration with Validators: Neuroni collaborates with validators on the Ethereum network, sharing AI-driven insights and analysis. This partnership offers validators valuable information for informed decisions on transaction validation and consensus.\n\nThe combined capabilities of the private node and advanced AI processing establish Neuroni Ai as a valuable contributor to Ethereum’s security, mitigating risks and safeguarding user assets.\n\nIn the realm of decentralised finance (DeFi), where users seek to eliminate intermediaries through smart contracts, challenges such as high fees, slow transactions, unreliability, and security concerns persist. Neuroni Ai’s Ethereum Node emerges as a solution poised to address these issues, promising unparalleled performance. Key features include:\n\nOptimised Hardware: Equipped with specialised hardware, the Neuroni Ethereum Node ensures efficient transaction processing.\n\nReal-time responsiveness: It adapts swiftly to network demands, prioritising transaction processing in Ethereum’s fast-paced environment.\n\nElimination of Gas Fees on Failed Transactions: Users bid farewell to gas fees incurred by failed transactions.\n\nThrottling and Censorship Resistance: The Neuroni Ethereum Node ensures uninterrupted access to the Ethereum network, eliminating concerns about throttling or censorship.\n\nPrivacy and Security: Neuroni Ai maintains complete control over the node’s usage and security, guaranteeing unmatched privacy and transaction security.\n\nReal-Time Data Access: With the dedicated Ethereum node, users gain direct access to real-time data, empowering informed trading decisions.\n\nMEV Protection: The node prioritises security through the implementation of the latest MEV protection plugins, ensuring private, non-revertable transactions.\n\nFor more information about Neuroni Ai’s Ethereum node and its efficiency, please visit Beacon Chain\n\nhttps://by2.io/9999M\n\nIn closing, the introduction of the Neuroni Ethereum Node on the Mainnet represents a significant milestone in the Ethereum ecosystem. This advancement eliminates the era of DeFi as we know it and welcomes the dawn of a new era, AiDeFi, where intelligence harmonises with decentralization. With Neuroni Ai leading the way, the Ethereum blockchain is poised to reach unprecedented heights, offering limitless possibilities and driving innovation within the industry.\n\nAlso read: Learn new things about technology and the appliances that go with it, says Virendra Yaduvanshi CTO at SahiBandhu\n\nDo Follow: CIO News LinkedIn Account | CIO News Facebook | CIO News Youtube | CIO News Twitter\n\nAbout us:\n\nCIO News, a proprietary of Mercadeo, produces award-winning content and resources for IT leaders across any industry through print articles and recorded video interviews on topics in the technology sector such as Digital Transformation, Artificial Intelligence (AI), Machine Learning (ML), Cloud, Robotics, Cyber-security, Data, Analytics, SOC, SASE, among other technology topics."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDkvMTEvdG9kYXktcHJpY2UtYml0Y29pbi1ldGhlcmV1bS1kZWNyZWFzaW5nLXNsaWdodGx5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Sep 2023 07:00:00 GMT",
        "title": "Today the price of Bitcoin and Ethereum is decreasing slightly - The Cryptonomist",
        "content": "Today the price of Bitcoin and Ethereum is down slightly.\n\nThese are actually minimal movements, but probably indirectly related to what is happening in traditional financial markets.\n\nThe price of Bitcoin and Ethereum today\n\nToday the price of BTC fell below $25,600, but only for a few moments. What matters is that it fell below $25,700.\n\nIn fact, it had not fallen significantly below that threshold since 7 September.\n\nTaking the last few days as a reference, that was precisely the support that seemed to have always held, except for a few rare moments. However, today it did not hold.\n\nOn 7 September it had also fallen below $25,600 as well, but without going below $25,500. Today it seems to be doing much the same thing.\n\nBy contrast, on 1 September it had fallen as low as $25,300, so today’s slight drop for now turns out to be perfectly in line with what happened in September.\n\nThen again, this month up to now has seen very low volatility, because against a low at $25,300 the high was only $26,400, and eleven consecutive days within such a compressed range is not at all common.\n\nThe days of July seem to be back, after a slightly more eventful August, with volatility at lows for an asset that is usually quite volatile.\n\nThe price of ETH\n\nA slightly different matter is the price of ETH.\n\nIn fact, it fell as low as below $1,580 today, albeit only for a brief moment, and is still well below $1,600.\n\nTo find such low levels one has to go back to the sharp drop on 18 August, when within three days it lost nearly 14%.\n\nIn fact, it had previously remained consistently above $1,600 until 13 March, and that of today is a similar level to that of 12 January.\n\nIt is enough to say that compared to the beginning of the year BTC is still at +54%, while for ETH the gain has shrunk to 32%. In this respect it is also doing worse than XRP and TRX (Tron), but it is generally normal for Ethereum to perform worse than Bitcoin during crypto winters.\n\nBitcoin and Ethereum’s price lateralization before today\n\nIndeed, it is in fact continuing the lateralization triggered in mid-March.\n\nIn January and February, prices had risen again, only to fall in early March. In the second half of March they went up again, but only to begin a long lateralization that is still ongoing.\n\nFor example, Bitcoin‘s price exceeded $25,000 on 17 March, and it has almost always remained above this threshold since then, except for a couple of days in mid-June.\n\nIt has also never exceeded $31,800, which is currently the main resistance, the breaking of which could mean the end of the long period of lateralization.\n\nThe markets’ expectation\n\nMoreover, these days the markets are in frantic anticipation of the August US inflation data to be released on Wednesday.\n\nFor instance, today the price of Bitcoin had fallen just before the opening of the Asian exchanges, fearing a drop that subsequently occurred.\n\nHowever, the decline in the Asian exchanges, and Hong Kong’s in particular, stopped, and with the Dollar Index down slightly Bitcoin had recovered somewhat.\n\nSubsequently, the Dollar Index’s trend reversed, with DXY rising back above 104.7 points, and Bitcoin’s price went back down.\n\nIt is worth noting that markets are betting on the Fed ending its rate hike, so much so that they believe the figure released on Wednesday could be positive.\n\nIn reality the forecast is for a rise in overall inflation (from 3.2% to 3.6%), but for a net decline in core inflation (from 4.7% to 4.3%), and since it is mainly the latter that matters to the Fed it is assumed that at least in September rates will not be raised again.\n\nHowever, while markets’ forecasts of inflation data have often been quite correct lately, it is not certain that the actual data released on Wednesday will be in line with expectations. If they are significantly different, markets could react sharply, and even suddenly.\n\nAt times of such expectation, it is more than fair to expect markets to be stagnant, or nearly so, since the Fed’s monetary policy remains at this time the main single factor that can profoundly influence them."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL3d3dy5jcnlwdG9nbG9iZS5jb20vbGF0ZXN0LzIwMjMvMDkvY3J5cHRvLWFuYWx5c3QtYmVuamFtaW4tY293ZW4td2FybnMtb2YtcG90ZW50aWFsLXVwY29taW5nLXByaWNlLWNyYXNoZXMtZm9yLWV0aGVyZXVtLWFuZC1jYXJkYW5vL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Sep 2023 07:00:00 GMT",
        "title": "Benjamin Cowen Cautions on Potential Upcoming Ethereum and Cardano Price Drops - CryptoGlobe",
        "content": "In a recent YouTube video, Benjamin Cowen, a well-known crypto analyst, shared his thoughts on the future price movements of Ethereum. Cowen suggested that the cryptocurrency might not only experience a lower low but could potentially see its price fall below $800. He mentioned that while the decline might not be drastic, Ethereum could even touch price points as low as $600, $500, or $400.\n\nExpanding on Ethereum’s possible price trajectory, Cowen described a scenario where the cryptocurrency could undergo a series of fluctuations. According to him, Ethereum might witness periods of slow decline, punctuated by brief spikes in price, and this pattern could continue until the end of the pre-halving year, leaving both bullish and bearish investors in a state of financial disarray. Cowen explained that each faction might feel they were correct for a portion of the year, only to find out that their predictions were accurate for just half the time, resulting in financial setbacks for all involved by the year’s end.\n\nIn a separate video released late last month, Cowen shifted his focus to Cardano (ADA), another leading cryptocurrency. He warned that Cardano might be entering a “depression” phase, which could substantially decrease its price. Drawing parallels with the Nasdaq’s 50% drop, Cowen stated that a similar decline for Cardano, calculated from its then-level of $0.37, could push its price below $0.20.\n\nCowen also offered alternative methods for assessing Cardano’s potential price decline. He indicated that a 27% drop from a lower base could bring Cardano’s price to around $0.16, a level it last saw in August 2020. He further highlighted other significant price levels for Cardano, such as the $0.11 mark, which was its high in 2019, and the pre-pandemic high that hovered around $0.07 or $0.08.\n\nCowen emphasized the unpredictability of the cryptocurrency’s price if it enters a depression phase. He cautioned that Cardano could experience several consecutive weeks of price decline, with the possibility of brief recoveries that might tempt investors into taking greater risks. Specifically, Cowen mentioned that Cardano’s price could “pop back up for another couple of weeks just to make it so that people YOLO in one last time,” underlining the overall high risk and advising investors to remain vigilant.\n\nFeatured Image via Midjourney"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDkvMTEvY3J5cHRvLW5ld3Mtdml0YWxpay1idXRlcmluLWV0aGVyZXVtLWNvLWZvdW5kZXIteC1hY2NvdW50LWhhY2tlZC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Sep 2023 07:00:00 GMT",
        "title": "The X account of Ethereum co-founder Vitalik Buterin was hacked in a phishing attack with $700000 worth of crypto ... - The Cryptonomist",
        "content": "In a shocking twist, the X account (formerly Twitter) of Ethereum co-founder Vitalik Buterin was recently compromised, leading to a crypto theft of as much as $700,000 worth of non-fungible tokens (NFTs).\n\nThe article delves into the details of this audacious phishing attack, shedding light on the tactics employed by the attackers and the tools used to execute their nefarious plan.\n\nVitalik Buterin: the phishing attack of the co-founder of crypto project Ethereum\n\nThe attack took place when Buterin’s X account was covertly taken over by hackers.\n\nSubsequently, the compromised account was used to promote a fake NFT commemorative coin.\n\nThe bait was enticing, as the scam claimed to have a limited-time offer, inviting users to quickly mint these commemorative NFTs.\n\nHowever, the link provided led to a phishing website that posed a significant threat to unsuspecting victims.\n\nEstimates by cryptocurrency investigator ZachXBT and data on the chain indicate that the phishing attack resulted in the loss of approximately $700,000 in cryptocurrency and NFT assets.\n\nSpecifically, among the stolen assets was a valuable CryptoPunk NFT valued at 153 ETH, equivalent to $250,000. In addition, numerous individuals lost large amounts of Ether during the attack.\n\nThe modus operandi of the attack involved the use of a famous tool in the cryptocurrency world, known as “Pink drainer software.”\n\nThis software, which is used to drain NFTs and cryptocurrencies from unsuspecting victims, has gained notoriety for its involvement in several high-profile phishing attacks throughout the year.\n\nIt is essential to understand that Pink drainer software is often created and sold by malicious actors to people interested in conducting phishing attacks.\n\nIn exchange for using this software, attackers typically share a portion of the ill-gotten gains with its creator. In some cases, the creators themselves engage in attacks using their own software, adding a layer of complexity to these malicious activities.\n\nNoteworthy targets\n\nThe attackers who compromised Vitalik Buterin’s X account are not the first to use this method. They join a growing list of malicious actors who have targeted prominent individuals and organizations in the crypto space.\n\nThese attacks often involve perpetrators masquerading as journalists, claiming to be affiliated with crypto media. A common tactic is to persuade targets to insert a seemingly innocent document into their browsers, which ultimately enables the injection of malicious code.\n\nIn light of the persistent threat of phishing attacks, it is imperative that cryptocurrency enthusiasts and NFT holders take precautionary measures.\n\nOne effective strategy is to store valuable NFTs and larger cryptocurrencies in cold storage rather than hot wallets, which are more susceptible to attacks.\n\nEmerging tools such as Delegate Cash are also proving valuable, as they allow NFT owners to delegate the rights of their NFTs to other wallets.\n\nThis delegation allows access to exclusive areas of the NFT community, such as Discord servers, without the constant use of the wallet that holds the NFT.\n\nThe continuing battle against phishing attacks\n\nThe takeover of Vitalik Buterin’s X account is just one episode in a long series of phishing attacks that have targeted prominent figures and organizations in the cryptocurrency and NFT ecosystem.\n\nThe scale and sophistication of these attacks underscore the importance of ongoing efforts to combat and mitigate these threats.\n\nOne of the key pillars of defense against phishing attacks is user awareness. Cryptocurrency enthusiasts, investors, and NFT collectors must remain vigilant and skeptical when linking to online content and links, especially when it comes to financial transactions or transferring valuable assets.\n\nBeing cautious of unsolicited messages, checking the authenticity of websites, and verifying the legitimacy of offers can be very helpful to avoid falling victim to phishing schemes.\n\nMulti-factor authentication (MFA)\n\nImplementing multi-factor authentication (MFA) is another key step in strengthening defenses against unauthorized access to online accounts.\n\nMFA requires users to provide two or more forms of authentication before granting access, making it much more difficult for attackers to compromise accounts.\n\nUsers are strongly encouraged to activate MFA whenever possible, particularly for their cryptocurrency wallets and accounts on cryptocurrency exchanges.\n\nPhishing attacks are a collective concern within the crypto community, and collaboration among community members can be a powerful defense.\n\nReporting suspicious activity, sharing information about known threats, and collectively promoting stronger security measures within the industry can help reduce the overall impact of phishing attacks.\n\nRegulatory measures\n\nAs the crypto space matures, regulators increasingly recognize the need for robust security measures.\n\nRegulatory bodies and industry associations are collaborating to establish guidelines and standards that can help protect users from phishing attacks and other forms of fraud.\n\nCompliance with these regulations and adherence to industry best practices are essential to safeguarding both individual users and the cryptographic ecosystem at large.\n\nConclusion: the unfortunate incident involving Ethereum crypto co-founder Vitalik Buterin\n\nThe unfortunate incident involving the compromise of Vitalik Buterin’s X account serves as a reminder of the persistent threat posed by phishing attacks in the cryptocurrency and NFT space.\n\nThese attacks are becoming increasingly sophisticated and target high-profile individuals and organizations. However, by remaining vigilant, implementing security measures such as multi-factor authentication, and actively participating in the crypto community’s efforts to combat these threats, users can better protect themselves and their valuable assets.\n\nIn an industry that prides itself on decentralization and individual power, security awareness and proactive measures are key to maintaining the trust and integrity of the cryptocurrency and NFT ecosystem.\n\nThe cryptocurrency community continues to evolve, as does its commitment to the safety and security of its participants."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vd3d3LmNyeXB0b3BvbGl0YW4uY29tL3BoaXNoaW5nLWF0dGFjay12aXRhbGlrLWJ1dGVyaW5zLXR3aXR0ZXIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Sep 2023 07:00:00 GMT",
        "title": "Phishing attack targets Ethereum co-founder Vitalik Buterin's Twitter account - Cryptopolitan",
        "content": "In an unsettling development that has sent ripples through the cryptocurrency community, the Twitter account of Ethereum‘s co-founder, Vitalik Buterin, was reportedly compromised. This unexpected breach, believed to be the result of a sophisticated phishing attack, has raised eyebrows and amplified concerns in the crypto community, especially considering the increasing number of high-profile hacks in recent times.\n\nDetails of the attack\n\nThe official Twitter account of Vitalik Buterin, one of the most prominent figures in the cryptocurrency world, was reportedly hacked. According to emerging reports, the hackers gained unauthorized access to Buterin’s account and posted a malicious link. This link, which was disguised in a tweet, was said to be part of a phishing scheme.\n\nThe tweet spoke about Consensys, a blockchain technology company, offering a special NFT (Non-Fungible Token) to commemorate the introduction of “Proto-Danksharding” to Ethereum. For those unfamiliar, NFTs are unique digital assets verified using blockchain technology, and “Proto-Danksharding” refers to a potential upgrade in the Ethereum network. The hackers cleverly used this information to lure unsuspecting users into clicking the harmful link.\n\nPeckShieldAlert, a cybersecurity firm, quickly identified the breach and alerted the community about the phishing link associated with the compromised account. Their warning message was clear: “It seems Vitalik Buterin’s Twitter account is hacked. And do NOT click the phishing link.”\n\nRising concerns in the crypto community\n\nThis incident with Buterin’s Twitter account is not an isolated one. The crypto community has recently witnessed a surge in high-profile account breaches. To put things into perspective, just a couple of months ago, in July 2023, the Twitter account of Uniswap’s founder, Hayden Adams, was also compromised. Such incidents have raised alarms about the security measures in place for prominent figures in the crypto industry.\n\nThe nature of these attacks, especially phishing, is particularly concerning. Phishing attacks involve tricking individuals into providing sensitive information, like passwords or credit card numbers, by disguising them as trustworthy entities. In the context of the crypto world, this could lead to significant financial losses and damage to reputations.\n\nSwift recovery and moving forward\n\nDespite the initial shock and concern, Vitalik Buterin’s Twitter account was promptly recovered from the hackers. Post-recovery, Buterin’s recent Twitter activities seem to be back to normal. One of his latest tweets highlights a blockchain privacy-related paper he co-authored with Ameen Soleimani, among other contributors.\n\nWhile the quick recovery is a silver lining, the incident is a stark reminder of the vulnerabilities even high-profile individuals face in the digital age. It underscores the importance of robust cybersecurity measures and the need for continuous vigilance in the ever-evolving landscape of online threats.\n\nConclusion\n\nAs the crypto community continues to grow and gain mainstream attention, it becomes imperative for individuals and organizations alike to prioritize security. The recent hacks, including the unsettling breach of Buterin’s account, serve as a poignant reminder of the digital threats that lurk in the shadows. As technology advances, so do the techniques of malicious actors. It’s a wake-up call to fortify their digital assets and online presence against potential threats."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL2JpdGNvaW5pc3QuY29tL2NyeXB0b3MtbmV3LWdvbGQtcnVzaC10cmFkZWN1cnZlLW1hcmtldHMtdGNydi1hdHRyYWN0cy10aGUtZXllcy1vZi1iaXRjb2luLWJ0Yy1hbmQtZXRoZXJldW0tZXRoLWxveWFsaXN0cy_SAYUBaHR0cHM6Ly9iaXRjb2luaXN0LmNvbS9jcnlwdG9zLW5ldy1nb2xkLXJ1c2gtdHJhZGVjdXJ2ZS1tYXJrZXRzLXRjcnYtYXR0cmFjdHMtdGhlLWV5ZXMtb2YtYml0Y29pbi1idGMtYW5kLWV0aGVyZXVtLWV0aC1sb3lhbGlzdHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Sep 2023 07:00:00 GMT",
        "title": "Crypto's New Gold Rush: Tradecurve Markets (TCRV) Attracts the Eyes of Bitcoin (BTC) and Ethereum (ETH) - Bitcoinist",
        "content": "In the bustling landscape of cryptocurrency, a nascent digital asset is catching the attention of both Bitcoin (BTC) and Ethereum (ETH) enthusiasts. Tradecurve Markets, currently in its presale phase, is becoming a focal point of the latest crypto gold rush. This new token is not only generating quite a buzz but also outperforming the established cryptos in the current market.\n\n>>Register For The Tradecurve Markets Presale<<\n\nTradecurve Markets (TCRV): A Potential Surge from $0.025 to $1.00 on the Horizon\n\nTradecurve Markets excels in providing a comprehensive trading environment that seamlessly integrates a diverse range of assets. From cryptocurrencies to stocks and commodities, all can be accessed through a unified platform.\n\nThis all-in-one approach eliminates the fragmented trading experience often faced by Bitcoin and Ethereum enthusiasts when diversifying their portfolios. No longer does Binance have a monopoly over digital assets, as Tradecurve Markets’ intuitive exchange platform provides a one-stop shop for all investors’ needs.\n\nBut what truly seems to resonate with the Bitcoin and Ethereum communities is Tradecurve Markets’ dedication to democratizing financial access. The ease of onboarding—requiring just an email sign-up and a DeFi wallet connection—echoes the principles of decentralization and accessibility both Bitcoin and Ethereum staunchly advocate for.\n\n🟢Exciting news The #TradeCurve Demo Platform is NOW LIVE! Dive in, explore, and experience the future of trading. We value your insights – sign up, give it a whirl, and share your feedback with us. Let’s shape the future together! 👉🏽https://t.co/nuKSMkeh21#Cryptotrading pic.twitter.com/HuMKbBeI7D — Tradecurve (@Tradecurveapp) September 11, 2023\n\n\n\nAt the heart of Tradecurve Markets’ system is the TCRV token. This isn’t merely a currency but a tokenized representation of the platform’s innovative spirit, and it plays a pivotal role in a rewards ecosystem that has the potential to redefine crypto-based incentives.\n\nWith its presale price witnessing an impressive 150% ascent since the presale started, whispers within the Ethereum and Bitcoin forums suggest that TCRV could be the next crypto darling, given its potential and the innovative solutions it brings to the table.\n\nCurrently priced at a humble $0.025 per token, market analysts predict a remarkable surge in value to $1.00 once Tradecurve Markets enters mainstream trading platforms. This could be the start of a new gold rush for crypto enthusiasts, and it’s worth keeping an eye on.\n\nBitcoin (BTC) Enthusiasts Eyeing Tradecurve Markets (TCRV)’s Promising Presale\n\nIn the realm of cryptocurrency, Bitcoin has been the epitome of an exhilarating adventure, particularly during the recent second quarter. After experiencing a significant decline to $24,800 in mid-June, it defied expectations and swiftly surged to surpass $31,000 in just seven days.\n\nHowever, the celebration came to a halt when Bitcoin encountered a barrier at the $31,800 resistance level. Since then, it has been a challenging journey for Bitcoin, sliding down a slippery slope. After plummeting below the critical $29,500 – $30,000 range, Bitcoin has suffered a loss of over 20% and is currently trading around a rather subdued $25,850.\n\nPreviously, murmurs of potential Bitcoin ETF approvals brought a shimmer of hope, painting dreams of mainstream institutional influx. But with that shimmer fading, the big question looms: What’s the next spark for Bitcoin’s fireworks?\n\nAs Bitcoin continues its turbulent journey, Tradecurve Markets’ presale is capturing attention as the fresh face in the market. The current TCRV discounts and bonuses give Bitcoin holders a chance to make gains while the ETF decision awaits.\n\n>>Register For The Tradecurve Markets Presale<<\n\nEthereum (ETH): Awaiting a Break Through the $2,100 Resistance Zone\n\nEthereum is no stranger to volatility. After seeing a steady rise in Q2 from $1,377 to a peak of $2,135, the Ethereum price has retraced back to $1,629 after falling from an ascending trendline.\n\nHowever, the declining price doesn’t negate the positive developments in the Ethereum ecosystem. An impressive TVL of $21 billion underscores the growing momentum for Ethereum-based DeFi.\n\nEthereum holders, while happy with developments, are tired of holding Ethereum under the $2,100 resistance zone that has stopped growth for more than 15 months now. The Tradecurve Markets presale provides Ethereum holders a chance to make gains while they wait for the right moment.\n\nAnalysts note that surpassing the $2,100 is key to starting a new Ethereum bull run. Should this occur, a run to $10,000 is possible in the long run, but that is still a distant dream at the moment.\n\nFor more information about the Tradecurve Markets (TCRV) presale:\n\nWebsite: https://tradecurvemarkets.com/\n\nBuy presale: https://app.tradecurvemarkets.com/sign-up\n\nTwitter: https://twitter.com/Tradecurveapp\n\nDisclaimer: This is a paid release. The statements, views and opinions expressed in this column are solely those of the content provider and do not necessarily represent those of Bitcoinist. Bitcoinist does not guarantee the accuracy or timeliness of information available in such content. Do your research and invest at your own risk."
    }
]