[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V0aGVyZXVtLWRlZmxhdGlvbmFyeS0yLW1vbnRoc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Mar 2023 07:00:00 GMT",
        "title": "Ethereum Now Deflationary for 2 Months Straight - Blockworks",
        "content": "Ethereum has been deflationary for two months straight due to a surge in on-chain activity on protocols such as Uniswap and Blur.\n\nThe network pushed an upgrade (EIP-1559) in August 2021 that meant transaction fees would be burned instead of directed to the network’s miners — a precursor to Ethereum’s switch to proof-of-stake last September.\n\nEIP-1559 at times inspired Ethereum to produce deflationary blocks (more ETH burned than distributed). But the asset has now been solidly deflationary every day since late January, per network tracker ultrasound.money.\n\nPrior to that, Ethereum had briefly entered deflationary status in November 2022, about two months after Ethereum’s Merge cut issuance by more than 90%, before slipping back to inflationary by December.\n\nUltrasound.money only maps Ethereum’s deflationary status since the Merge — making its recent streak the longest on record for this particular tracker.\n\nResearch analysts at Compass Point Research and Trading said in a research report earlier this month that the increase in burned ETH has largely been driven by increased Uniswap usage in response to centralized exchange uncertainty, as well as continued usage of the Blur NFT marketplace.\n\nUniswap tops the ETH burned leaderboard in the past 30 days, with roughly 8,766 ETH ($16 million) burned in that span. NFT marketplace and aggregator Blur has burned about 6,535 ETH ($11.9 million) over the last month.\n\n“The amount of ETH burned has seen a steady climb over the past two months due to an increase in on-chain activity, with the largest surge occurring on March 10 as fear surrounding USDC’s backing caused a depeg,” Blockworks Research Analyst Sam Martin said.\n\n“On-chain users scrambled to dump USDC for USDT, which led to the largest daily burn since the Merge’s implementation.”\n\nRead More: Blur Still Sees Record NFT Volumes Even After Crypto Airdrop\n\nThe depegging of USDC followed the collapse of Silicon Valley Bank (SVB). It plunged to as low as $0.87 before ultimately returning to its $1 peg.\n\nThe failures of financial institutions in recent weeks, including Silvergate, SVB and Signature Bank, have prompted crypto industry participants to advocate for decentralized financial infrastructure as a more secure and reliable alternative.\n\nCompass Point’s March 9 report predicted that the introduction of layer-2 blockchains can take market share away from so-called “ETH killers” and bring users back to the Ethereum network.\n\n“We continue to believe that L2 scaling and liquid staking growth have the potential to be significant catalysts for Ethereum this year, and help drive on-boarding of users, adoption and overall demand and activity of the network,” analysts wrote.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY29pbmdlZWsuY29tL255YWctY2FsbHMtZXRoZXJldW0tYS1zZWN1cml0eS1hbmQtZGVzdHJveXMtZGVjZW50cmFsaXphdGlvbi1teXRoL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Mar 2023 07:00:00 GMT",
        "title": "NYAG calls Ethereum a security and destroys decentralization myth - CoinGeek",
        "content": "Ethereum’s developers have locked in a date for the network’s next big upgrade, dubbed ‘Shanghai’: April 12. While ETH fans will laud the update for introducing the ability to ‘unstake’ ETH, it couldn’t be happening at a worse time.\n\nSEC chair Gary Gensler indicated again this week that proof-of-stake models—like those used by Ethereum—are securities. Meanwhile, the NYAG filed charges against the KuCoin exchange for illegally selling securities and specifically named ETH as a security in large part due to the fact that Ethereum is not decentralized after all.\n\nAdd to that the fact that the past 12-24 months have seen legislators, regulators, and law enforcement all clamp down on illegalities within the industry in different ways. For instance, in January, the SEC took action against lend-to-earn programs jointly operated by Genesis and Gemini on the basis that they amounted to illegal securities offerings. Nexo Capital paid the SEC a $45 million dollar settlement over its lend-to-earn program around the same time.\n\nMost notable about these actions is that they confirm that the SEC is beginning to deconstruct the myth of decentralization and the role it plays in determining whether a given asset offering amounts to a security. Look at the language used by Gensler in an interview with The Block in 2021, right as the SEC began to look at lend-to-earn products:\n\n“I would note to your readers that if you’re investing on a centralized exchange or a centralized lending platform, you no longer own your token. You’ve transferred ownership to the platform. All you have is a counterparty risk. And that platform might be saying, as many of them do, we’ll give you a four percent or seven percent return if you stake your coins with us or you actually transfer ownership and we the platform will stake your tokens. That takes on all the indicia of what Congress is trying to protect under the securities laws.”\n\nThis should represent an enormous red flag for Ethereum and BTC—two projects that the SEC has long considered the rare exceptions to its general position that most digital assets are, in fact, securities. That’s because these exceptions arise from the SEC’s assumption that both projects are decentralized: without a centralized body governing projects like these, according to the SEC’s logic, it can’t be said that investors had a reasonable expectation of profits relying on the efforts of others, as is required by the Howey test for securities (their belief that BTC is not a security is also based on a misguided interpretation of that project’s history).\n\nThese exceptions were always highly tenuous and at odds with reality. As time has gone on, they have become increasingly difficult to justify. Now, it seems, regulators and law enforcement have finally seen the lie for what it is.\n\nEthereum was always a security—but now it’s obvious\n\nThe idea that Ethereum is anything but a security has always been a sham. This was obvious from Buterin’s own marketing at the time of the ETH ICO right through to the language used on Ethereum websites today. The point is made repeatedly: ETH production will slow dramatically over time, increasing scarcity and, as a consequence, value.\n\nwidth=\"562\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\">\n\nThe Ethereum foundation website also refers to the fact that ETH is viewed as an investment.\n\nBut the biggest lie of all was that Ethereum is or has ever been decentralized. This was obvious back in 2016 when a decentralized autonomous organization (DAO) holding almost 15% of all ETH in circulation was hacked. Ethereum’s developers, led by founder Vitalik Buterin, proposed, approved, and implemented the solution to fork the network and recover the stolen assets. There was the charade of a vote on the proposal, but just 6% of all ether holders participated, and 25% of the votes came from a single address, while the proposals at the heart of the vote were still authored by Ethereum’s core team. This can be seen again as recently as this week with the Shanghai update announcement: If Ethereum is decentralized, then who is designing, proposing, and implementing these radical upgrades? That would be the very same people that intervened after the DAO hack, of course. This is not decentralization by any realistic definition.\n\nThe notorious Ethereum 2.0 upgrade, which moved the network’s consensus mechanism from Proof-of-Work to Proof-of-Stake, did nothing to change this reality. If anything, the migration to Proof-of-Stake moved Ethereum even deeper into security territory. In contrast to Proof-of-Work, where miners are at least undertaking work of their own in solving hash puzzles, those staking under a Proof-of-Stake system are relying entirely on the work of others to deliver profits on whatever coins have been staked. In fact, this week, Gensler again indicated that Proof-of-Stake networks are likely to trigger U.S. securities laws, saying:\n\n“Whatever they’re promoting and putting into a protocol, and locking up their tokens in a protocol, a protocol that’s often a small group of entrepreneurs and developers are developing, I would just suggest that each of these token operators … seek to come into compliance, and the same with the intermediaries,” he said, reported by The Block.\n\nAuthorities are already taking action on the basis that ETH is a security\n\nThis sea change by authorities is not just a speculation over some hypothetical future enforcement drive. Instead, the enforcement drive is already here.\n\nLast week, the New York Attorney General filed charges against exchange KuCoin over failing to register as a securities and commodities broker-dealer: ETH, which is listed by the exchange, was expressly labeled a security in the charges. The language used by the NYAG couldn’t be clearer:\n\n“ETH’s development and management is largely driven by a small number of developers who hold positions in ETH and stand to profit from the growth of the network and the related appreciation of ETH.”\n\nFurther down:\n\n“Buterin and the Ethereum Foundation retain significant influence over Ethereum and are often a driving force behind major initiatives on the Ethereum blockchain that impact the functionality and price of ETH.”\n\nThe language could have been taken straight from Howey: ETH is not decentralized, and the continued development of the network is closely governed by a core group of developers who promote the asset on the basis that its value will increase over time. It is a classic security.\n\nThe NYAG’s action is against KuCoin rather than anyone directly connected to Ethereum, but between Ethereum’s recent upgrades, Gensler’s public statements on centralization and the SEC’s recent enforcement actions, it seems that the SEC charges against Ethereum and its developers directly can’t be far away. The ramifications of an SEC case against Ethereum can be much wider reaching: the SEC is empowered to levy fines and penalties against those violating the U.S.’ securities regime, including disgorgement of all profits made in connection with an unregistered securities offering and injunctions against carrying on further business. In short, it could spell the end of Ethereum altogether.\n\nAnd if the myth of decentralization with respect to ETH has finally been pierced, then you can bet that BTC is up for the same treatment.\n\nFollow CoinGeek’s Crypto Crime Cartel series, which delves into the stream of groups—from BitMEX to Binance, Bitcoin.com, Blockstream, ShapeShift, Coinbase, Ripple,\n\nEthereum, FTX and Tether—who have co-opted the digital asset revolution and turned the industry into a minefield for naïve (and even experienced) players in the market.\n\nNew to blockchain? Check out CoinGeek’s Blockchain for Beginners section, the ultimate resource guide to learn more about blockchain technology."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjIxNDUzL292ZXItMS1iaWxsaW9uLW9mLWV0aGVyLWxvc3QtZm9yZXZlci1idWdzLWh1bWFuLWVycm9y0gFdaHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjIxNDUzL292ZXItMS1iaWxsaW9uLW9mLWV0aGVyLWxvc3QtZm9yZXZlci1idWdzLWh1bWFuLWVycm9y?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Mar 2023 07:00:00 GMT",
        "title": "Over $1 billion of ether has been lost forever due to bugs and human error - The Block",
        "content": "More than $1 billion of ether has been lost forever due to bugs and human error, according to research by Conor Grogan, director of product strategy and business operations at Coinbase.\n\n\"I've categorized thousands of instances of Ethereum typos, user errors and buggy contracts,\" Grogan said on Twitter on Monday. He noted that he'd cataloged 636,000 ETH ($1.15 billion) that is lost, representing 0.5% of the coin's circulating supply.\n\nThe majority — some 514,000 ETH — is due to a 2017 bug in the Parity crypto wallet. Defunct crypto exchange Quadriga lost 60,000 ETH to a contract fault and the Akutars NFT collection lost 11,500 ETH in a failed Mint. On top of those, Ethereum users have cumulatively sent 24,000 ETH to a burn address, where the coins can no longer be accessed.\n\nIn most of these cases, the ether wasn't worth anywhere as near as much in dollars at the time of the loss.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nGrogan added that his estimate, if anything, is an understatement. \"This $1.1B+ number significantly undershoots the actual lost/inaccessible ETH amount — It just covers instances where Ethereum is locked forever,\" he said.\n\nThis is because access to many wallets will have been lost but there's no way of knowing which ones by looking at blockchain data alone.\n\nUpdate: Fixed the amount lost in the Parity bug."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vZGVjcnlwdC5jby9yZXNvdXJjZXMvd2hhdC1pcy1hcmJpdHJ1bS1zcGVlZGluZy11cC1ldGhlcmV1bS11c2luZy1vcHRpbWlzdGljLXJvbGx1cHPSAWFodHRwczovL2RlY3J5cHQuY28vcmVzb3VyY2VzL3doYXQtaXMtYXJiaXRydW0tc3BlZWRpbmctdXAtZXRoZXJldW0tdXNpbmctb3B0aW1pc3RpYy1yb2xsdXBzP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Mar 2023 07:00:00 GMT",
        "title": "What Is Arbitrum? Speeding Up Ethereum Using Optimistic Rollups - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe Ethereum network has a lot going for it—it’s decentralized, reliable, supports smart contracts written in a programming language familiar to many crypto developers, and is home to a thriving decentralized finance (DeFi) industry.\n\nHowever, Ethereum is also slow and expensive to use, and will remain so unless users opt to move to another blockchain (like Solana, Fantom or Avalanche), or until planned Ethereum upgrades speed things up within the next couple of years.\n\nWhile the world waits, a third fix has arisen: scaling solutions. These are pieces of software that sit atop the base layer of a blockchain, in this case Ethereum, to speed things up. Arbitrum is one such scaling solution, and it’s become a popular venue for Ethereum users to complete their transactions.\n\nAD\n\nAD\n\nOn March 23, 2023, Arbitrum plans to airdrop its new ARB token, allowing holders to vote in decisions related to the protocol. In so doing, Arbitrum is enacting its long-awaited transition to a DAO (decentralized autonomous organization).\n\nArbitrum is cheap and quick to use, and relays all transaction information back to the main Ethereum blockchain. While Ethereum manages a mere 14 transactions per second, Arbitrum races ahead at 40,000 TPS. Transactions cost several dollars to complete on Ethereum, while they cost about two cents on Arbitrum.\n\nAnd Arbitrum also supports the Ethereum Virtual Machine (EVM), meaning that Ethereum DeFi developers can integrate their decentralized applications (dapps) with Arbitrum without having to make any modifications.\n\nArbitrum was created by Offchain Labs. The company raised $120 million in a Series B funding round in September 2021.\n\nHow does Arbitrum work?\n\nArbitrum’s development documentation says that this is the most important graph to understand:\n\nAD\n\nAD\n\nArbitrum workflow. Image: Arbitrum\n\nPut simply, people and smart contracts ask Arbitrum’s blockchain to do something by placing transactions into the chain's ‘inbox’. Then Arbitrum processes it and outputs a transaction receipt. How Arbitrum processes that transaction—what determines its ‘chain state’—is decided by the transactions in its inbox.\n\nRight now, Arbitrum processes Ethereum transactions through a method called an optimistic rollup, and settles these on a sidechain before reporting back to Ethereum. Let’s break that down.\n\nWhat is an optimistic rollup?\n\nA rollup is a type of data compression technique for blockchain transactions. It involves ‘rolling up’ batches of transactions into a single transaction.\n\nThe benefit of this is that a blockchain need only process a single transaction—the rolled-up transaction—instead of confirming each individual transaction contained within the rollup. This saves time—multiple transactions are confirmed at once, so you do not have to wait until the blockchain gets around to your transaction—and money, since the blockchain only has to confirm one transaction.\n\nAn ‘optimistic’ rollup is a specific technique for rolling up transactions. To speed things up, optimistic rollups assume that the transactions contained within the rollup are valid. It is possible to contest transactions through a dispute resolution mechanism if a validator suspects fraudulent behavior. (Optimistic rollups are separate from ‘zero knowledge’ rollups, which bypasses a dispute resolution mechanism by validating transactions before they are added to the rollup).\n\nOptimistic rollups are the present *and future* of Ethereum scaling. We explain why here:https://t.co/FG0OGC8TJB — Arbitrum (💙,🧡) (@arbitrum) December 17, 2021\n\nArbitrum’s optimistic rollups are settled on a proprietary sidechain. A sidechain is a blockchain that is connected to a main chain; in this case, Ethereum. Arbitrum collects batches of transactions, settles them on its sidechain, and then feeds the transaction data back to the Ethereum blockchain ledger.\n\nArbitrum says that any transactions confirmed through this process are rubber stamped with the “AnyTrust Guarantee”—when all the validators agree with the validity of transactions contained within a block. Validators stake ETH before they can confirm transactions; by putting money on the line, they are incentivized to act honestly.\n\nAD\n\nAD\n\nUnlike other rollup networks, like Boba or Loopring, Arbitrum does not have a token. Offchain Labs claims the network does not need one, since all transactions on the sidechain are settled with ETH, the native cryptocurrency of the Ethereum blockchain.\n\nArbitrum has been integrated into several decentralized finance protocols, such as SushiSwap, Curve and Abracadabra. Data from DeFi Llama show that $2 billion worth of cryptocurrency is locked up within Arbitrum’s smart contracts. Approximately 30% is from decentralized exchange (DEX) SushiSwap.\n\nThe project’s blockchain, Arbitrum One, is in mainnet “beta”, which allows Arbitrum’s developers “various levels of control over the system”, including “the ability to pause the system”. Offchain Labs plans to eliminate these controls once it is certain the project is robust.\n\nHow to use Arbitrum\n\nYou can use Arbitrum through a decentralized application, like Aave, 1inch or Gnosis Safe, or directly on Arbitrum’s token bridge. For the token bridge, you can deposit funds to the Arbitrum network after you’ve connected your Web3 wallet. It takes about 10 minutes for deposits to clear.\n\nYou’ll have to pay an Ethereum gas fee—at Ethereum’s rates. To deposit under a cent of ETH to Arbitrum, MetaMask wallet quoted us $5.41 in gas fees."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAzLzIxL2V0aGVyZXVtLWJhc2VkLWNhcmJvbi10cmFja2VyLWNhcmJvbmFibGUtcmFpc2VzLTEybS10by10YWNrbGUtZ3JlZW53YXNoaW5nL9IBfGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAzLzIxL2V0aGVyZXVtLWJhc2VkLWNhcmJvbi10cmFja2VyLWNhcmJvbmFibGUtcmFpc2VzLTEybS10by10YWNrbGUtZ3JlZW53YXNoaW5nL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Mar 2023 07:00:00 GMT",
        "title": "Ethereum-Based Carbon Tracker Carbonable Raises $1.2M to Tackle Greenwashing - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9hcmJpdHJ1bS1zcGVlZGluZy1ldGhlcmV1bS11c2luZy1vcHRpbWlzdGljLTEzMzEwMjEzOS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Mar 2023 07:00:00 GMT",
        "title": "What Is Arbitrum? Speeding Up Ethereum Using Optimistic Rollups - Yahoo Finance",
        "content": "The Ethereum network has a lot going for it—it’s decentralized, reliable, supports smart contracts written in a programming language familiar to many crypto developers, and is home to a thriving decentralized finance (DeFi) industry.\n\nHowever, Ethereum is also slow and expensive to use, and will remain so unless users opt to move to another blockchain (like Solana, Fantom or Avalanche), or until planned Ethereum upgrades speed things up within the next couple of years.\n\nWhile the world waits, a third fix has arisen: scaling solutions. These are pieces of software that sit atop the base layer of a blockchain, in this case Ethereum, to speed things up. Arbitrum is one such scaling solution, and it’s become a popular venue for Ethereum users to complete their transactions.\n\nOn March 23, 2023, Arbitrum plans to airdrop its new ARB token, allowing holders to vote in decisions related to the protocol. In so doing, Arbitrum is enacting its long-awaited transition to a DAO (decentralized autonomous organization).\n\nWhat is Ethereum (ETH)? A Beginner's Guide to the Smart Contract Blockchain\n\nArbitrum is cheap and quick to use, and relays all transaction information back to the main Ethereum blockchain. While Ethereum manages a mere 14 transactions per second, Arbitrum races ahead at 40,000 TPS. Transactions cost several dollars to complete on Ethereum, while they cost about two cents on Arbitrum.\n\nAnd Arbitrum also supports the Ethereum Virtual Machine (EVM), meaning that Ethereum DeFi developers can integrate their decentralized applications (dapps) with Arbitrum without having to make any modifications.\n\nArbitrum was created by Offchain Labs. The company raised $120 million in a Series B funding round in September 2021.\n\nHow does Arbitrum work?\n\nArbitrum’s development documentation says that this is the most important graph to understand:\n\nArbitrum workflow. Image: Arbitrum\n\nPut simply, people and smart contracts ask Arbitrum’s blockchain to do something by placing transactions into the chain's ‘inbox’. Then Arbitrum processes it and outputs a transaction receipt. How Arbitrum processes that transaction—what determines its ‘chain state’—is decided by the transactions in its inbox.\n\nStory continues\n\nRight now, Arbitrum processes Ethereum transactions through a method called an optimistic rollup, and settles these on a sidechain before reporting back to Ethereum. Let’s break that down.\n\nWhat is an optimistic rollup?\n\nA rollup is a type of data compression technique for blockchain transactions. It involves ‘rolling up’ batches of transactions into a single transaction.\n\nThe benefit of this is that a blockchain need only process a single transaction—the rolled-up transaction—instead of confirming each individual transaction contained within the rollup. This saves time—multiple transactions are confirmed at once, so you do not have to wait until the blockchain gets around to your transaction—and money, since the blockchain only has to confirm one transaction.\n\nAn ‘optimistic’ rollup is a specific technique for rolling up transactions. To speed things up, optimistic rollups assume that the transactions contained within the rollup are valid. It is possible to contest transactions through a dispute resolution mechanism if a validator suspects fraudulent behavior. (Optimistic rollups are separate from ‘zero knowledge’ rollups, which bypasses a dispute resolution mechanism by validating transactions before they are added to the rollup).\n\nOptimistic rollups are the present *and future* of Ethereum scaling. We explain why here:https://t.co/FG0OGC8TJB — Arbitrum (💙,🧡) (@arbitrum) December 17, 2021\n\nArbitrum’s optimistic rollups are settled on a proprietary sidechain. A sidechain is a blockchain that is connected to a main chain; in this case, Ethereum. Arbitrum collects batches of transactions, settles them on its sidechain, and then feeds the transaction data back to the Ethereum blockchain ledger.\n\nArbitrum says that any transactions confirmed through this process are rubber stamped with the “AnyTrust Guarantee”—when all the validators agree with the validity of transactions contained within a block. Validators stake ETH before they can confirm transactions; by putting money on the line, they are incentivized to act honestly.\n\nUnlike other rollup networks, like Boba or Loopring, Arbitrum does not have a token. Offchain Labs claims the network does not need one, since all transactions on the sidechain are settled with ETH, the native cryptocurrency of the Ethereum blockchain.\n\nArbitrum has been integrated into several decentralized finance protocols, such as SushiSwap, Curve and Abracadabra. Data from DeFi Llama show that $2 billion worth of cryptocurrency is locked up within Arbitrum’s smart contracts. Approximately 30% is from decentralized exchange (DEX) SushiSwap.\n\nThe project’s blockchain, Arbitrum One, is in mainnet “beta”, which allows Arbitrum’s developers “various levels of control over the system”, including “the ability to pause the system”. Offchain Labs plans to eliminate these controls once it is certain the project is robust.\n\nHow to use Arbitrum\n\nYou can use Arbitrum through a decentralized application, like Aave, 1inch or Gnosis Safe, or directly on Arbitrum’s token bridge. For the token bridge, you can deposit funds to the Arbitrum network after you’ve connected your Web3 wallet. It takes about 10 minutes for deposits to clear.\n\nYou’ll have to pay an Ethereum gas fee—at Ethereum’s rates. To deposit under a cent of ETH to Arbitrum, MetaMask wallet quoted us $5.41 in gas fees."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMy8yMS9ldGhlcmV1bS1ldGgtc3RpbGwtaGFzLXJvb20tdG8tcnVuLWhpZ2hlci1hY2NvcmRpbmctdG8tY3J5cHRvLWFuYWx5dGljcy1maXJtLXNhbnRpbWVudC1oZXJlcy13aHkv0gGGAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzAzLzIxL2V0aGVyZXVtLWV0aC1zdGlsbC1oYXMtcm9vbS10by1ydW4taGlnaGVyLWFjY29yZGluZy10by1jcnlwdG8tYW5hbHl0aWNzLWZpcm0tc2FudGltZW50LWhlcmVzLXdoeS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Mar 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Still Has Room To Run Higher, According to Crypto Analytics Firm Santiment – Here’s Why - The Daily Hodl",
        "content": "The second-largest crypto asset by market cap, Ethereum (ETH), has more upside potential, according to analytics platform Santiment.\n\nThe crypto analytics firm says that Ethereum is likely to soar above the $2,000 price after hitting a high last reached seven months ago over the weekend.\n\n“Ethereum’s price hadn’t eclipsed $1,840 since August 18th. Despite this seven-month high, the network hasn’t appeared to heat up and create notable transaction barriers due to high demand. This is a good sign that ETH has a door open to $2,000 and beyond.”\n\nDespite the price jump, Santiment says that Ethereum’s transaction fees fell below $2 when ETH hit a seven-month high compared to rising above $8 earlier this month when the second-largest crypto fell to a two-month low.\n\nA Twitter survey conducted by Santiment over the weekend also indicated that there are more people who believe Ethereum will rise above $2,000 first than those who think it will drop below $1,600 first. Nearly 10% of the respondents said they see Ethereum soaring above $2,000 next while 5.2% said they see ETH falling under $1,600 next.\n\nOn Bitcoin (BTC), Santiment further says that March’s rally is legitimate. According to Santiment director of marketing Brian Quinlivan, Bitcoin’s rally has coincided with the banking sector’s meltdown.\n\n“With the calendar past the halfway mark in March, Bitcoin has gone on another tear, breaking above $27,800 for the first time since June, 2022.\n\nSo why did prices manage to soar? Well, there were a few different key events in the first half of March.\n\nThe most obvious appeared to be the collapse of one of the larger US banks, Silicon Valley Bank (SVB). And it appears this has caused massive ripple effects among the banking sector, in general.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9hZnRlci1zY2FsYWJpbGl0eS1wcml2YWN5LWlzLXRoZS1uZXh0LWJpZy10aGluZy1pbi10aGUtYmxvY2tjaGFpbi1zcGFjZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Mar 2023 07:00:00 GMT",
        "title": "After scalability, privacy is the next big thing in the blockchain space - Cointelegraph",
        "content": "Public blockchains provide decentralization and transparency, but they lack on the privacy side. The anonymity of transactions on blockchains like Bitcoin (BTC) and Ethereum (ETH) is steadily losing ground, as transactions and addresses are easily tracked. With KYC imposed on most crypto exchanges, the majority of blockchain transactions can be traced to their initiators, exposing user activity, holdings, and financial data.\n\nEven decentralized finance (DeFi) interactions can be easily monitored by advanced on-chain analysis systems. This is why privacy is just as important as speed and scalability for crypto to reach mainstream acceptance. Average consumers expect at least bank account level privacy to freely transact and RAILGUN is a ZK (Zero-Knowledge) based solution for existing blockchains that provides such wallet-level privacy.\n\nThe utility of digital assets comes with major downsides amid a lack of privacy. What happens when a crypto user pays for a coffee in crypto? They risk revealing their holdings, income and shopping preferences to merchants, peers and anyone who wants to extract value from their data. And taking it a step further, how many people would be comfortable receiving their salaries in crypto if it meant broadcasting all their financial information to the world? The necessity for increased privacy in the crypto space is essential to mainstream adoption.\n\nPrivacy gains more attention across the blockchain community\n\nPrivacy is an important goal for public blockchains, especially Ethereum, which accounts for about two-thirds of all DeFi activity. The need for privacy on Ethereum has increased after the adoption of the widespread adoption of layer-2 solutions like Arbitrum.\n\nIn January 2023, Ethereum co-founder Vitalik Buterin admitted the need for improved privacy on the blockchain. He proposed a “stealth address system” to increase the privacy degree of Ethereum transactions. Stealth addresses would be generated by wallets and would represent obfuscated public key addresses to receive funds in a private environment. Access to stealth addresses would require a special code referred to as a “spending key.” This would enable two parties to transact without being visible to the public. However, stealth addresses are an incomplete solution as they don’t account for full DeFi functionality.\n\nIt’s still too early to know when Ethereum will implement privacy features and to what extent, but the good news is that there are solutions that can already achieve a high degree of privacy. RAILGUN is a smart contract system that provides crypto and DeFi users with privacy through zero-knowledge proof (zk-SNARK) technology.\n\nRAILGUN is currently among the leading complete privacy solutions for the DeFi space, as it generates zk-SNARK encryption entirely within a smart contract. That enables users to store their funds anonymously and interact with decentralized applications (DApps) in an anonymous, noncustodial manner.\n\nSource: Railgun\n\nRAILGUN, which is governed by a decentralized autonomous organization (DAO), employs zk-SNARKs to encrypt transaction details, wallet balances and transaction history. Unlike other third-party, Layer-2 privacy solutions, RAILGUN works directly on-chain, enabling users to transfer, swap, lend, borrow and transact with all kinds of DApps anonymously.\n\nOn top of that, the RAILGUN smart contracts can be plugged into any Ethereum Virtual Machine DApp for shielded transactions using the RAILGUN Connect dev toolkit.\n\nRecently, RAILGUN was deployed to Arbitrum — a layer-2 rollup technology for Ethereum, bringing privacy combined with speed and high throughput to the second-largest decentralized network. RAILGUN DAO'S co-founder Alan Scott stated:\n\n“The Arbitrum deployment of RAILGUN is a massive accomplishment for privacy in DeFi. Arbitrum’s scaling and RAILGUN’s zk-SNARK-based privacy together are an exciting match. I’m looking forward to seeing how DeFi builders will use RAILGUN’s infrastructure to create interesting and new privacy-preserving DeFi solutions on Arbitrum.”\n\nBesides working on Ethereum and Arbitrum, RAILGUN enables on-chain privacy for BSC and Polygon. What’s more, contributors are working on adding support for Solana, Near and Metis as well.\n\nDevelopers and users are starting to pay more attention to privacy as blockchain adoption expands across multiple use cases. Therefore, if developers can crack the puzzle, privacy is poised to become one of the most important trends in blockchain in the coming years.\n\nMaterial is provided in partnership with RAILGUN DAO"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3Jlc2VhcmNoLXdoeS10aGUtZXRoZXJldW0tYml0Y29pbi1yYXRpby13aWxsLWNvbnRpbnVlLXRvLWZhbGwv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Mar 2023 07:00:00 GMT",
        "title": "Research: Why the Ethereum/Bitcoin ratio will continue to fall - CryptoSlate",
        "content": "What is CryptoSlate Alpha? A web3 membership designed to empower you with cutting-edge insights and knowledge, powered by Access Protocol. Learn more ›\n\nConnected to Alpha Welcome! 👋 You are connected to CryptoSlate Alpha. To manage your wallet connection, click the button below.\n\nImportant: You must lock a minimum of 20,000 ACS If you don't have enough, buy ACS on the following exchanges: Coinbase Kucoin Orca\n\nConnect via Access Protocol Access Protocol is a web3 monetization paywall. When users stake ACS, they can access paywalled content. Learn more ›\n\nDisclaimer: By choosing to lock your ACS tokens with CryptoSlate, you accept and recognize that you will be bound by the terms and conditions of your third-party digital wallet provider, as well as any applicable terms and conditions of the Access Foundation. CryptoSlate shall have no responsibility or liability with regard to the provision, access, use, locking, security, integrity, value, or legal status of your ACS Tokens or your digital wallet, including any losses associated with your ACS tokens. It is solely your responsibility to assume the risks associated with locking your ACS tokens with CryptoSlate. For more information, visit our terms page."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9ldGgtZXllcy0yMDAwLWFzLXVzLWludmVzdG9ycy1zdGVwLXVwLWJ1dC10aGVyZXMtYS1jcml0aWNhbC1vYnN0YWNsZS1ldGhlcmV1bS1wcmljZS1hbmFseXNpcy_SAXpodHRwczovL2NyeXB0b3BvdGF0by5jb20vZXRoLWV5ZXMtMjAwMC1hcy11cy1pbnZlc3RvcnMtc3RlcC11cC1idXQtdGhlcmVzLWEtY3JpdGljYWwtb2JzdGFjbGUtZXRoZXJldW0tcHJpY2UtYW5hbHlzaXMvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Mar 2023 07:00:00 GMT",
        "title": "ETH Eyes $2,000 as US Investors Step Up But There’s a Critical Obstacle (Ethereum Price Analysis) - CryptoPotato",
        "content": "Ethereum’s price is showing a very bullish signal right now, with a couple of key resistance levels getting broken to the upside. If the breakout is valid, things could look much better for the crypto market in the coming months.\n\nTechnical Analysis\n\nBy: Edris\n\nThe Daily Chart:\n\nOn the daily chart, the price has been rallying since a sharp rebound from the 200-day moving average around the $1400 mark. It has climbed above the 50-day moving average located around the $1600 level, before breaking through the higher boundary of the large symmetrical triangle pattern.\n\nCurrently, the key $1800 resistance level is also seemingly getting tested, and the price could soon target values above $2000, especially the $2300 level, in the coming weeks if the current breakout is valid.\n\nOn the other hand, in case a fake breakout occurs, a pullback towards either of the 50-day or 200-day moving averages or the $1300 support area could be expected.\n\nThe 4-Hour Chart:\n\nLooking at the 4-hour timeframe, the recent price rally becomes more clear. The cryptocurrency has been struggling with the higher boundary of the symmetrical triangle and the $1800 level over the last few days, with the latter yet to be broken to the upside.\n\nThe RSI indicator also demonstrates a bearish divergence between the recent price highs, which could point to a possible correction in the short term. The $1680 and $1500 levels could be possible turning points for the price in case a bearish move materializes.\n\nHowever, from a price action perspective, ETH is seemingly willing to continue higher, considering the last two 4-hour candles, which are breaking above the $1800 area.\n\nSentiment Analysis\n\nBy: Edris\n\nEthereum Coinbase Premium Gap\n\nWith a banking crisis seemingly on the horizon, investors are getting worried about the potential effects on the crypto market.\n\nInteresting signs regarding American investors’ recent behavior have emerged. The Coinbase premium gap chart shows a huge spike that recently occurred, demonstrating the gap between Coinbase’s ETH/USD pair and Binance’s ETH/USDT pair. Positive values indicate higher buying pressure in the U.S., while negative values are associated with selling pressure.\n\nIf this behavior continues, the market would likely sustain its uptrend in the mid-term, and a new bull market could begin. However, if the value declines in the coming days and falls below zero, investors should be cautious, as it could be an early sign of a bearish reversal."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMDMvMjEvNjM2MDAwLWV0aGVyZXVtLWV0aC13b3J0aC0xLTFiLWxvc3QtZm9yZXZlci_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Mar 2023 07:00:00 GMT",
        "title": "636,000 Ethereum (ETH) Worth $1.1B Lost Forever - The Crypto Basic",
        "content": "Coinbase Director Makes Shocking Revelation On $1.1B+ Ethereum (ETH) Lost Forever.\n\nCoinbase Director of Project Strategy & Business Operations Conor Grogan has taken to his official Twitter account to shed light on the vast amount of ETH coins lost forever. Conor revealed that up to 636,000 ETH worth $1.15B+, equal to 0.5% of all circulating supply, will not be recovered again.\n\nThe Coinbase director categorized these losses as Ethereum typos, user errors, and buggy contracts. Sharing his thoughts via a Twitter thread, Conor said the number is too much as they can’t be sold while admitting that crypto trading could be difficult sometimes.\n\nI've categorized thousands of instances of Ethereum typos, user errors, and buggy contracts Thus far I've found 636,000 ETH worth $1.15B+ that are lost forever: 0.5% of all circulating supply Crypto can be hard some times ?\n\nOn the flip side thats a lot of ETH that cant be sold pic.twitter.com/YvCh2KmME5 — Conor (@jconorgrogan) March 20, 2023\n\n- Advertisement -\n\nConor Grogan also listed some of the biggest losses he found. Conor started with the Web3 foundation loss of 306K ETH, worth $538M due to the Parity Multisig bug, and then Quadriga’s 60K ETH, worth $108M to a faulty contract.\n\n- Advertisement -\n\nAlso on the list is Akutars loss of 11.5k ETH because of a wrong NFT-mint, plus the 24k ETH collectively sent by people to a burn address for unknown reasons.\n\nHe further said the “$1.1B+ number significantly undershoots the actual lost/inaccessible ETH amount- It just covers instances where Ethereum is locked forever. For example, it doesn’t cover lost private keys or things like Genesis wallets that have presumably been forgotten.”\n\nEthereum Burns\n\nAccording to IntoTheBlock stats, 66,000 Ethereum have been burned from the supply.\n\nAccording to @intotheblock, in 2023 66k $ETH has been burned, causing a reduction in Ethereum's supply. This development has transformed Ethereum into a deflationary asset. #Ethereum #deflation pic.twitter.com/qyW534nBtN — Elite ?? (@eliteXBT) March 21, 2023\n\nETH currently trades at $1,810.33 with a 24-hour trading volume of $10,612,154,207 (10.6B)."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL3Jhb3VsLXBhbHMtcHJlZGljdGlvbi1mb3ItZXRoZXJldW0tMjAyMy11cGNvbWluZy1icmVha291dC1zaGFsbC1sZWF2ZS1iaXRjb2luLWJlaGluZC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Mar 2023 07:00:00 GMT",
        "title": "Raoul Pal's Prediction For Ethereum 2023: “Upcoming Breakout Shall Leave Bitcoin Behind!” - Coinpedia Fintech News",
        "content": "Qadir Ak is the founder of Coinpedia. He has over a decade of experience writing about technology and has been covering the blockchain and cryptocurrency space since 2010. He has also interviewed a few prominent experts within the cryptocurrency space.\n\nThe price of cryptocurrencies increased over the weekend as bitcoin and Ethereum reached their highest levels in months this week. While Ethereum trades close to the 2022 September highs, Bitcoin nearly reached $27,000, which is its highest level since early June. Both the leading assets of the cryptocurrency industry seem to be performing well.\n\nEthereum Could Outperform Bitcoin in Coming Cycle\n\nAccording to Real Vision CEO Raoul Pal, the technicals and fundamentals of Ethereum (ETH), the second-largest cryptocurrency, indicate that it could significantly outperform Bitcoin (BTC) in the upcoming cycle. Pal claims to be keeping a watch on the Ethereum against Bitcoin (ETH/BTC) chart in a recent interview on the cryptocurrency-focused YouTube channel Altcoin Daily.\n\nAccording to the macro expert, the ETH/BTC pair is coiling inside a wedge, and a breakout could drive ETH into a surge that puts Bitcoin in second place. According to him, the ETH/BTC pair needs to overcome resistance at about 0.077 BTC ($2,115) in order to verify the breakout.\n\nETH/BTC is currently trading at 0.0639 BTC ($1,755). On the fundamentals of Ethereum, the Real Vision CEO thinks that the entire addressable market is much larger than Bitcoin’s.\n\nSimilar Prediction Made Earlier\n\nIn 2021, a similar forecast that ETH would overtake Bitcoin was made. The explanation given was that Ethereum is a programmable blockchain, which implies that those who possess the necessary technical know-how can use it to trade not only ether tokens but also any other digital asset, including bitcoin. Furthermore, ETH offers the added benefit of being able to sell and buy NFTs.\n\nFollowing this in 2022, numerous analysts believed that ETH would unquestionably overtake BTC when they heard that the Ethereum Mainnet would merge with the Beacon Chain proof-of-stake system.\n\nHowever, all of these were just predictions and BTC continues to be the top dog among the crypto assets."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1jbGFzc2ljcy10dmwtcmVjb3ZlcnMtYW5kLWhlcmVzLXRoZS1rZXktZHJpdmluZy1mYWN0b3Iv0gFaaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2V0aGVyZXVtLWNsYXNzaWNzLXR2bC1yZWNvdmVycy1hbmQtaGVyZXMtdGhlLWtleS1kcml2aW5nLWZhY3Rvci9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Mar 2023 07:00:00 GMT",
        "title": "Ethereum Classic’s TVL recovers and here’s the key driving factor - AMBCrypto News",
        "content": "Ethereum Classic sees a surge in TVL fueled by increased activity from one of its DEXes.\n\nETC bulls make a comeback but market conditions will dictate its next move.\n\nEthereum Classic (ETC) just concluded a bullish week but its price action is not the only aspect that achieved a pivot. Its total value locked also registered some upside after previously experiencing outflows.\n\nIs your portfolio green? Check out the Ethereum Classic Profit Calculator\n\nETC had a $363.982 TVL, at the time of writing, which represented a significant improvement and pivot from its $279,884 low in February.\n\nBut despite this noteworthy improvement, Ethereum Classic’s TVL was immensely dwarfed by Ethreum’s impressive $28.93 billion TVL. ETC’s anemic TVL is a rough indicator of just how far behind the network is in the DeFi race.\n\nA major reason for Ethereum Classic’s TVL shortfall is that it has not been very successful in attracting DeFi projects to run on its network.\n\nNevertheless, there is one particular protocol running on the Ethereum Classic network that seeks to change that. The HebeSwap decentralized exchange currently accounts for most of Ethereum Classic’s TVL.\n\nThe amount of TVL that HebeSwap contributed to Ethereum Classic peaked at $236,928 after surging by 42.87% in the last 7 days.\n\nIt had the highest gains out of the DeFi projects currently running on the Ethereum Classic network.\n\nThe DEX recently expressed its commitment to improving ETC’s ecosystem through the latest addition, a farm APY pool.\n\nEthereum Classic (ETC) price action\n\nETC bounced back by as much as 25% from its weekly low to its weekly high. Its 40% gain from its current monthly low is even more impressive. It traded at $21.12 at press time.\n\nCan ETC sustain the rally for the next few days? Its latest upside has so far pushed above the 50% RSI level which means relative strength is now leaning in favor of the bulls. Multiple on-chain metrics also support this observation.\n\nHow many are 1,10,100 ETCs worth today?\n\nThe weighted sentiment metrics remained high after the rally it secured in the last 7 days. In other words, investors are still optimistic about ETC’s bullish prospects.\n\nInvestors should also note that the price volatility metric ended last week with a pivot. It remains to be seen whether this volatility surge will carry the momentum forward for the next few days.\n\nMore good news from the NFT side of things. Ethereum Classic’s total NFT trades volume registered a surge in the last few days. A confirmation that the demand for NFTs on the network was also enjoying improved health.\n\nAlthough these are favorable observations, Ethereum Classic’s development activity demonstrated signs of weakness during the weekend."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL21pY3Jvc29mdC1lZGdlLXRlc3RpbmctY3J5cHRvLXdhbGxldNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Mar 2023 07:00:00 GMT",
        "title": "Microsoft Edge Testing Built-In Ethereum Crypto Wallet, Screenshots Show - Blockworks",
        "content": "Microsoft is reportedly working on an Ethereum-based Web3 wallet for its flagship browser, allowing users to send and receive digital assets and NFTs.\n\nThe wallet is currently in a limited testing phase and is not yet available to the public, IT media outlet Bleeping Computer reported Friday.\n\nFirst reported by Microsoft sleuth Albacore, who shared screenshots of the wallet on Twitter, Microsoft is asking “testers” via its Edge browser to put up their own assets.\n\n“We encourage you to test our first Web3 wallet and provide candid feedback along the journey,” Microsoft said in one of the screenshots. “As the first testers, you have the unique opportunity to shape our foray into cryptocurrencies and NFTs.”\n\nThe wallet is non-custodial, meaning users are in control of their funds and the tech giant will not have access to their passwords or recovery keys. The wallet generates an Ethereum address that allows users to receive funds through the Ethereum network.\n\nUsers can also manage multiple Ethereum accounts and choose between the built-in Edge wallet or an extension.\n\nMicrosoft has partnered with Consensys to make available a swap feature supporting ETH, DAI, UNI, USDC, and USDT, according to Bleeping Computer.\n\nMicrosoft and Consensys did not immediately respond to requests for comment.\n\nIt remains to be seen if Microsoft will add support for other digital assets in the future.\n\nAccording to Albacore, the wallet may launch soon.\n\n“Enabling the crypto wallet ended up being less complex than I anticipated, which is also why I think that a launch might not be far away,” he told Blockworks.\n\nAccording to the screenshots, the beta version of the wallet also features a news section to keep track of industry developments, which includes the ability to connect to decentralized apps.\n\nSimon Kertonegoro, who previously helped usher in the implementation of a collaborative program between Microsoft and Enjin known as Azure Heroes, told Blockworks the tech giant’s Web3 wallet was a “savvy play” as it sought to “gain an upper hand” against rival Google Chrome.\n\n“This would be amazing for us as users too, we’ll no longer need to input our credit card information every time we make a payment,” the founder of MyMetaverse said.\n\nWhile the Edge crypto wallet is still in the testing phase, it could be a significant development for Microsoft, as it allows users to easily send and receive crypto without installing additional extensions or apps.\n\nThe move signals a pivot from its previous Web3 endeavors; Microsoft axed its metaverse unit in February, just four months after it had created a team tasked with building industrial networks.\n\nJane Ma, co-founder of zkLend, a layer-2 money-market protocol built on StarkNet, told Blockworks the emergence of Web3 technologies has spurred a growing trend of Web2 infrastructure companies looking to explore ways to integrate these decentralized solutions into their platforms.\n\n“Microsoft’s prototype crypto wallet for its Edge browser is a prime example of this trend, as it aims to simplify the onboarding process for new users,” Ma said. “With a massive user base of over 200 million, Microsoft Edge’s approach of providing a ready-made, packaged solution within its browser would break down technical barriers,” she said.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZGVjcnlwdC5jby8xMjQwNTYvcG9seWdvbi1pbW11dGFibGUtcGFydG5lci1uZXctemtldm0tZXRoZXJldW0tZ2FtaW5nLW5ldHdvcmvSAVtodHRwczovL2RlY3J5cHQuY28vMTI0MDU2L3BvbHlnb24taW1tdXRhYmxlLXBhcnRuZXItbmV3LXprZXZtLWV0aGVyZXVtLWdhbWluZy1uZXR3b3JrP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Mar 2023 07:00:00 GMT",
        "title": "Polygon, Immutable Partner for New zkEVM Ethereum Gaming Network - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nPolygon and Immutable, both heavyweights in the Ethereum scaling space, are teaming up to create a new network designed specifically for Web3 gaming powered by Polygon’s anticipated zkEVM technology.\n\nToday, Polygon Labs and Immutable announced a “strategic alliance” to collaborate on the creation of Immutable zkEVM, a new Ethereum scaling network that will pair the soon-to-launch Polygon zkEVM tech with the Immutable platform designed for blockchain-based games. The news was revealed amid the start of the annual Game Developers Conference (GDC).\n\nTo be clear, Polygon and Immutable aren’t merging, and they’ll continue their respective projects and initiatives. Polygon’s own zkEVM mainnet network is set to launch in beta on March 27, while the existing Immutable X scaling network—based on the StarkEx zk-Rollup tech—will also continue on alongside the new Immutable zkEVM network.\n\nAD\n\nAD\n\nImmutable co-founder and President Robbie Ferguson told Decrypt that the partnership was an “obvious move” that lets the core builders behind both existing networks combine their efforts in the service of Web3 video game adoption.\n\n“For us, this is the endgame,” Ferguson said. “This is how the next billion users will be onboarded into Web3.”\n\nBoth are Ethereum scaling networks: Polygon’s current primary network is a sidechain, while Immutable X is a layer-2 network. Although the approaches are different, both ultimately make Ethereum more useful for things like video games, large-scale NFT projects, and other decentralized apps (dapps) by enabling faster, cheaper transactions than Ethereum’s mainnet.\n\nA zkEVM solution like Polygon’s and others is expected to take Ethereum scaling to the next level, pairing transaction rollups based on zero-knowledge proof cryptography with full Ethereum Virtual Machine (EVM) support. In other words, it’s billed as a fast and secure solution that is natively compatible with Ethereum’s own smart contract capabilities.\n\nImmutable X and Polygon are competing scaling networks, however, and have previously competed to lure in developers, brands, and users alike.\n\nAD\n\nAD\n\nPolygon Labs President Ryan Wyatt admitted to Decrypt that it was a bit awkward at first to discuss a unified path forward when the two sides began chatting about nine months ago.\n\n“When we first came together—yeah, it was certainly hard to wrap our heads around it,” Wyatt said. “It took time for both sides to figure out: OK, how does this actually make sense for all of us? The more that we talked and the more time that we spent together, it’s actually very naturally aligned.”\n\nFerguson said that despite their history as competitors, both Polygon and Immutable X sought to scale Ethereum rather than try to compete against it as a layer-1 rival. That shared belief in expanding the capabilities of Ethereum, rather than try to beat it with a new, bespoke network, also gave them a shared foundation to work from.\n\n“[That] made it a very easy philosophical alignment,” Ferguson added, “once we looked past the intense competition we'd had on the gaming front over the past couple of years.”\n\nImmutable zkEVM is slated to start rolling out towards the end of Q2 2023, Ferguson said, which is when Immutable is “aiming for usable things to go live,” but developers can start building on software development kits (SDKs) today to explore the tech.\n\nThe network will use Immutable’s IMX token for gas fees and transaction sequencing. The current Immutable X network will continue operating, and Ferguson said his team’s goal is to develop cross-rollup liquidity between the networks.\n\nHe also expects there to be bridges built to help move assets between Immutable zkEVM and Polygon’s own zkEVM network, for example.\n\nUltimately, the pair said they see Immutable zkEVM as the best of both worlds—a network that will utilize Polygon’s next-generation scaling tech while tapping into the gaming infrastructure that Immutable has built, providing a potentially appealing place for developers to take root as the Web3 gaming market expands.\n\nAD\n\nAD\n\nWyatt believes that Web3 gaming is inching closer to a point of mainstream adoption, despite previous pushback from many traditional video game fans. He pointed to this weekend’s live event for the Polygon-powered shooter Deadrop—from a studio founded by Twitch personality Guy “Dr. Disrespect” Beahm—as an example of Web3 games that can appeal broadly.\n\nAs he also recently discussed on Decrypt’s gm podcast, Wyatt reiterated what he sees as an increasing push to “abstract away a lot of the crypto and tech jargon” around Web3 games, and just focus on “really fun games where I own assets that I pay for, I can trade them easily, and I can have this really seamless experience.”\n\n“That's ultimately what the combination of the partnership does,” he said."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMy8yMC90b3AtZXRoZXJldW0tcml2YWwtY291bGQtYmUtZ2VhcmluZy11cC1mb3ItZ2xvcmlvdXMtbW92ZS1zYXlzLWludmVzdG9yLXdoby1jYWxsZWQtMjAyMi1jcnlwdG8tYm90dG9tL9IBigFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMy8yMC90b3AtZXRoZXJldW0tcml2YWwtY291bGQtYmUtZ2VhcmluZy11cC1mb3ItZ2xvcmlvdXMtbW92ZS1zYXlzLWludmVzdG9yLXdoby1jYWxsZWQtMjAyMi1jcnlwdG8tYm90dG9tL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Mar 2023 07:00:00 GMT",
        "title": "Top Ethereum Rival Could Be Gearing Up for Glorious Move, Says Investor Who Called 2022 Crypto Bottom - The Daily Hodl",
        "content": "Venture capitalist Chris Burniske says that Ethereum (ETH) rival Solana (SOL) could be setting itself up for a massive move to the upside.\n\nBurniske, a former ARK Invest analyst and a current partner at venture capital firm Placeholder, says that a big rally may be in store for Solana if it can clearly break the 200-day simple moving average (SMA),\n\n“SOL definitively reclaiming its 200-day SMA should be a glorious move.”\n\nSOL’s 200-day moving average is currently hovering at about $23. At time of writing, SOL is trading for $22.42.\n\nBurniske has previously predicted that Solana could be the next “Ethereum-level” opportunity should another bull market happen.\n\nLast month, Burniske said,\n\n“I think if I had to pick an ecosystem that’s contentious and that you should pay attention to, and in its contentiousness is undervalued, it would be Solana. Placeholder, each bear market, tends to pick an ecosystem or two and build an aircraft carrier strategy around that ecosystem. And so the last bear [market], it was ETH and Bitcoin, because those were really the only things at scale and liquid enough to justify.\n\nAnd what I mean by aircraft carrier – if you take Ethereum, buy a bunch of the core ETH asset, but then venture invest around it and really get to know that ecosystem and who all the people are that are working on say, at that point in time, lending or DEXs [decentralized exchanges] or asset management or whatever. And then you can pick the best teams of the teams that most speak to you from a venture perspective. We’re doing that exact same aircraft carrier strategy around Cosmos and Solana right now.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Jorm S/Modvector"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMy8yMS9hbmFseXN0LWtub3duLWZvci1jYWxsaW5nLWNyeXB0by1ib3R0b21zLXByZWRpY3RzLWJyZWFrb3V0LWZvci1ldGhlcmV1bS1zYXlzLXNvbGFuYS1wcmltZWQtZm9yLW5ldy1yYWxsaWVzL9IBkAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMy8yMS9hbmFseXN0LWtub3duLWZvci1jYWxsaW5nLWNyeXB0by1ib3R0b21zLXByZWRpY3RzLWJyZWFrb3V0LWZvci1ldGhlcmV1bS1zYXlzLXNvbGFuYS1wcmltZWQtZm9yLW5ldy1yYWxsaWVzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Mar 2023 07:00:00 GMT",
        "title": "Analyst Known for Calling Crypto Bottoms Predicts Breakout for Ethereum, Says Solana Primed for New Rallies - The Daily Hodl",
        "content": "A popular crypto analyst known for calling the 2018 Bitcoin (BTC) bottom thinks Ethereum (ETH) is primed for a breakout.\n\nPseudonymous trader Smart Contracter shares a chart with his 221,700 Twitter followers that suggests Ethereum could shoot up past the $1,900 range in short order.\n\n“I believe there’s a strong chance low of the week is in on ETH, as it ran the highs and lows on hourly and pulled back after weekly close with no upside wick, plus structure looks like an ABC [wave].”\n\nSmart Contracter is a popular practitioner of the Elliott Wave theory, an advanced technical analysis approach that attempts to predict future price action by following crowd psychology that tends to manifest in waves. According to the theory, a bullish asset tends to resume its uptrend after going through an ABC corrective move.\n\nEthereum is trading at $1,736 at time of writing. The second-ranked crypto asset by market cap is down 2.9% in the past 24 hours.\n\nSmart Contracter also thinks Bitcoin’s recent price rally could mean a couple of different things, though he thinks they’re all bullish for the top crypto asset.\n\n“BTC rallying into all this mayhem and having a monster weekly breakout is telling us one of two things, but too early to tell which one yet.\n\n#1. It’s telling us that BTC is still a risk on asset and is simply moving before equities, like it always does and equities play catch up soon\n\n#2. It’s telling us that its finally decoupled from trad finance and is now a safe haven asset doing what it was originally intended to do.”\n\nBitcoin is trading at $27,812 at time of writing and is down 0.19% in the past 24 hours.\n\nSmart Contracter also thinks Ethereum competitor Solana (SOL) could rally against Bitcoin (SOL/BTC) after taking out its diagonal resistance on the hourly chart.\n\n“Nice SOL/BTC breakout brewing on the back of a beautiful SOL/USD weekly close.”\n\nSOL is worth $22.47 at time of writing. The 11th-ranked crypto asset by market cap is up 1.33% in the past 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney\n\nFeatured Image: Shutterstock/monkographic"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDMvMjAvY3J5cHRvLW1hcmtldC13aXRuZXNzZXMtb2RkLXJlbGF0aW9uc2hpcC1iZXR3ZWVuLWJpdGNvaW4tZXRoZXItdm9sYXRpbGl0eS1tZXRyaWNzL9IBggFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAzLzIwL2NyeXB0by1tYXJrZXQtd2l0bmVzc2VzLW9kZC1yZWxhdGlvbnNoaXAtYmV0d2Vlbi1iaXRjb2luLWV0aGVyLXZvbGF0aWxpdHktbWV0cmljcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Mar 2023 07:00:00 GMT",
        "title": "Crypto Market Witnesses Odd Relationship Between Bitcoin, Ether Volatility Metrics - CoinDesk",
        "content": "\"I do think there is real value in owning ETH variance into the Shanghai upgrade,\" Anderson said, referring to an upcoming software upgrade on the Ethereum blockchain. \"The event risk there is underpriced and options appear cheap.\""
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vY3J5cHRvLm5ld3MvZXRoZXJldW0tanVtcHMtd2hpbGUtYml0Y29pbi1tYWludGFpbnMtaXRzLXBhY2Uv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Mar 2023 07:00:00 GMT",
        "title": "Ethereum jumps while bitcoin maintains its pace - crypto.news",
        "content": "The price of ethereum (ETH) has increased tremendously, from $1,760 to $1,820 as of March 21, as bitcoin (BTC) remains steady after a surge in the last few days.\n\nEthereum surged to $1,820 and then slightly corrected. Bitcoin maintained its new high of $28,000 after it went bullish.\n\nEthereum to USD price chart | Source: CoinMarketCap\n\nEther’s value against bitcoin had decreased since March 12, when the TradFi scene started facing a crisis. Any specific event has not triggered the sudden surge of ETH.\n\nThe ratio rose from 0.072 bitcoin per ETH to 0.062, equivalent to $280. It changed to 0.064 today, which might be the beginning of a recovery phase.\n\nThe Ethereum token supply has decreased by almost 67,000 ETHs, equivalent to $122 million, for the first time since its launch in 2015. ETH went into deflation on Jan. 16, 2023, and its total supply has steadily declined by 1,000 to 2,000 per day. More than 2,100 ETH are getting burnt daily. However, around 2,000 are issued to perchers, making the supply deficit around 100 ETH.\n\nSo far, bitcoin has been the primary crypto asset for market speculators and investors running out of banking. Bitcoin’s high position might be because it is the most acknowledged crypto asset integrated into the general financial system.\n\nThe ETH surge might suggest a calmness in the banking system, but no solid evidence exists. However, with the ongoing government intervention, the banking crisis might end, and there is hope for improved market sentiment.\n\nThe placating of the banking crisis\n\nSignificant banks on the verge of collapsing have made incredible recoveries while the federal government and FDIC intervened for the ones that have been crushed completely.\n\nAs industry proponents speculated a possible crash, the First Republic Bank stock dived by 50% on Monday. However, with $212 billion in total assets as of December 2022, the bank bounced back today, with the price increasing by an average of 30%.\n\nTreasury Secretary Janet Yellen said the government might offer catchers to all banks speculating about a potential system contagion.\n\nIntervention by big banks such as the ECB, J.P. Morgan, and the Bank of England might save the banking scene and suggest that the crisis is ending. The falling behind of the bank collapse scene might make the Bitcoin price rise to slow down too.\n\nFollow Us on Google News"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldWxlci1maW5hbmNlLXJlY2VpdmVzLW1lc3NhZ2UtZnJvbS1oYWNrZXItdmlhLWV0aGVyZXVtLWJ1dC1uby1jbGFyaXR5LXlldC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Mar 2023 07:00:00 GMT",
        "title": "Euler Finance receives message from hacker via Ethereum, but no clarity yet - AMBCrypto News",
        "content": "Euler’s Finance’s hacker sent a message to an Ethereum address.\n\nEUL’s price rose after hacker’s transactions.\n\nOn 20 March, Euler Finance’s hacker sent a message to an Ethereum [ETH] address related to the DeFi platform. After Euler issued an on-chain ultimatum demanding the funds’ return, the hacker offered to start a dialogue.\n\nThe message, embedded in an Ethereum transaction, read:\n\n“We want to make this easy on all those affected. No intention of keeping what is not ours… Setting up secure communication. Let us come to an agreement.”\n\nAfter several hours, Euler responded with its own on-chain message, acknowledging the message and asking the exploiter to speak “in private.”\n\nOn March 13, the DeFi platform was attacked with a flash loan exploit, draining approximately $196.9 million in various cryptocurrencies.\n\nWe are aware and our team is currently working with security professionals and law enforcement. We will release further information as soon as we have it. https://t.co/bjm6xyYcxf — Euler Labs (@eulerfinance) March 13, 2023\n\nThis loot included $8.7 million in DAI stablecoin and $18.5 million in Wrapped Bitcoin [WBTC]. Around $135.8 million in Staked Ethereum [stETH] and $33.8 million in USD Coin [USDC] were also stolen.\n\nA few days later, Euler Finance offered the hacker 10% of the $200 million stolen in exchange for returning the rest within 24 hours. When that did not happen, Euler Finance formally announced a $1 million reward for information on the hacker and the return of all funds.\n\nToday the Euler Foundation is launching a $1M reward in the hope that this provides additional incentive for information that leads to the Euler protocol attacker’s arrest and the return of all funds extracted by the attacker. — Euler Labs (@eulerfinance) March 15, 2023\n\nHowever, on 16 March, the hacker transferred funds associated with the Euler exploit to the Tornado Cash mixing service. The 10 transactions totaled 1,000 ETH (worth $1.74 million at the time of writing).\n\nOther transactions from the exploiter’s wallet address also include 3000 ETH sent back to Euler Finance on 18 March, as well as funds sent to a possible apparent victim of the exploit.\n\nStrategy for @eulerfinance exploit.\n\nYesterday the Hacker returned 3k eth (~5 mio USD) of the stolen ~200 mio USD to Euler.\n\nTo be exact the first transfer took place at 6:53 AM and this is where things are getting interesting. pic.twitter.com/OFxb4d59ze — Johannes(?) (@0xJohannes_) March 19, 2023\n\nUnknown hacker mocking the system?\n\nJohannes, a crypto Twitter user, pointed out that just minutes after these transactions, EUL’s price went up by 70% from $2.3 to $3.95. He speculated that the hacker might be mocking the Euler team so others can profit if the funds are returned.\n\nThe language used by the exploiter indicates that more than one person is involved in the loot.\n\nIn an earlier tweet, blockchain analytics firm Chainalysis said that the wallet address to which 100 ETH was transferred was linked to North Korea. According to Chainalysis, this could be an intentional attempt to mislead investigators."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vbmV3c3dhdGNodHYuY29tLzIwMjMvMDMvMjAvZXRoZXJldW0tYW5kLWl0cy1pbXBhY3Qtb24tdGhlLWJsb2NrY2hhaW4tbGFuZHNjYXBlL9IBV2h0dHBzOi8vbmV3c3dhdGNodHYuY29tLzIwMjMvMDMvMjAvZXRoZXJldW0tYW5kLWl0cy1pbXBhY3Qtb24tdGhlLWJsb2NrY2hhaW4tbGFuZHNjYXBlLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Mar 2023 07:00:00 GMT",
        "title": "Ethereum and its impact on the blockchain landscape - NewsWatch",
        "content": "Blockchain technology has emerged as a game-changer in various industries due to its potential to create secure and decentralized systems for managing and exchanging data. One of the most significant blockchain platforms is Ethereum, which has gained popularity for its ability to support the development of decentralized applications and smart contracts. We aim to provide readers with a deeper understanding of Ethereum’s architecture, features, and use cases. We will explore the potential of Ethereum to disrupt various industries, such as finance and supply chain management, and its impact on the broader blockchain landscape. By the end of this article, readers will have a better understanding of Ethereum and its potential for innovation and disruption.\n\nUnderstanding Ethereum\n\nEthereum’s architecture and technical specifications are fundamental to its ability to support the development of decentralized applications and smart contracts. At its core, Ethereum is a decentralized, open-source platform that allows for the creation of smart contracts. Smart contracts are self-executing agreements between parties that are stored on the Ethereum blockchain, which enables them to be tamper-proof and transparent. The Ethereum Virtual Machine (EVM) is responsible for executing these smart contracts, and it is this innovative design that sets Ethereum apart from other blockchain platforms.\n\nThe key features that differentiate Ethereum from other blockchain platforms include its ability to support the development of decentralized applications and smart contracts. Ethereum allows developers to create decentralized applications that run on the Ethereum blockchain, giving them the ability to build trustless and transparent applications. Additionally, Ethereum’s use of smart contracts enables developers to create automated agreements that execute once certain conditions are met. These features have contributed to Ethereum’s popularity and its ability to drive innovation in various industries.\n\nSmart contracts and decentralized applications (DApps) are central to the Ethereum network, and they enable a wide range of use cases. DApps can be built to facilitate anything from online marketplaces to social media platforms, with the added benefits of security and transparency. The use of smart contracts allows for the automation of agreements between parties, making the entire process more efficient and trustworthy. The role of DApps and smart contracts on the Ethereum network is critical to its success and adoption in various industries.\n\nUse Cases for Ethereum\n\nDecentralized Finance (DeFi) is one of the most significant use cases for Ethereum, and it has the potential to revolutionize the financial industry. DeFi applications allow for the creation of decentralized financial products and services that operate without intermediaries, such as banks. These products and services include peer-to-peer lending, stablecoins, and decentralized exchanges, among others. The use of Ethereum’s smart contracts enables these services to be transparent, efficient, and secure, providing a new level of financial access and inclusion to those who were previously excluded from the traditional financial system.\n\nNon-Fungible Tokens (NFTs) are digital assets that are unique and cannot be exchanged for one another. Ethereum has played a significant role in the growth of the NFT market, providing the ability to create, buy, and sell NFTs in a secure and decentralized manner. NFTs have a wide range of use cases, from art and collectibles to gaming and virtual real estate. The growth of the NFT market has been driven by the ability to prove ownership and authenticity of digital assets, and Ethereum’s smart contracts enable this proof to be stored on the blockchain.\n\nThe gambling industry has seen significant growth in the use of digital assets, and Ethereum has played a role in enabling this trend. Ethereum casinos allow players to use cryptocurrencies to gamble, providing increased security and privacy compared to traditional online casinos. The use of Ethereum smart contracts also enables provably fair games, which ensures that the outcome of a game is not manipulated by the casino or any other third-party. The growth of the gambling industry using digital assets has been driven by the convenience and security of using cryptocurrencies, and Ethereum’s capabilities have made it a popular choice for this use case.\n\nSupply chain management is another area where Ethereum has the potential to drive innovation and transparency. By using Ethereum’s blockchain technology, supply chains can be made more transparent and secure, reducing the risk of fraud and counterfeiting. The use of smart contracts enables the automation of supply chain processes, reducing the need for intermediaries and improving efficiency. Additionally, by storing supply chain data on the Ethereum blockchain, it becomes tamper-proof and transparent, allowing for increased accountability and traceability throughout the supply chain.\n\nEthereum’s Impact on the Blockchain Landscape\n\nThe growth of the Ethereum network has had a significant impact on the broader blockchain landscape. Ethereum has become one of the most widely used blockchain platforms, with a large developer community and a wide range of use cases. Its popularity has contributed to the growth of other blockchain platforms as well, as the technology continues to gain mainstream acceptance. Additionally, Ethereum’s success has led to the development of new technologies and platforms that build on its architecture, such as Polkadot and Cardano.\n\nThe potential for Ethereum to drive innovation and disruption in various industries is significant. Ethereum’s ability to support the development of decentralized applications and smart contracts has opened up new possibilities for industries such as finance, supply chain management, and even social media. However, there are still challenges and limitations facing the adoption and scalability of the Ethereum network. The current gas fees required for transactions on the Ethereum network can be prohibitive, and the scalability of the network needs to be improved to handle the growing number of transactions. Despite these challenges, the potential for Ethereum to drive innovation and disruption in various industries is significant and will continue to be a driving force in the blockchain landscape.\n\nWhat We Learned\n\nEthereum has emerged as a significant player in the blockchain landscape, offering unique features that differentiate it from other blockchain platforms. Ethereum’s ability to support the development of decentralized applications and smart contracts has opened up new possibilities for industries such as finance, supply chain management, and even social media. While there are still challenges and limitations facing the adoption and scalability of the Ethereum network, its potential impact on various industries is significant. Moving forward, it is clear that Ethereum will continue to drive innovation and disruption in various industries, and its popularity will only continue to grow. We encourage readers to explore Ethereum and its possibilities for innovation and disruption, and to consider its potential impact on their industries and businesses."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1ldGgtaW52ZXN0b3JzLXJldHVybi10by1sMi1icmlkZ2VzLXprc3luYy1zdGFya25ldC1hZGRyZXNzZXMtc3dlbGwv0gFmaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2V0aGVyZXVtLWV0aC1pbnZlc3RvcnMtcmV0dXJuLXRvLWwyLWJyaWRnZXMtemtzeW5jLXN0YXJrbmV0LWFkZHJlc3Nlcy1zd2VsbC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Mar 2023 07:00:00 GMT",
        "title": "Ethereum [ETH]: Investors return to L2 bridges; zKSync, StarkNet addresses swell - AMBCrypto News",
        "content": "Addresses on layer two protocols without tokens yet increased interaction with projects.\n\nWhile StarkNet was planning a token distribution, zkSync remained unsure.\n\nOver the last few months, layer two (L2) protocols on the Ethereum [ETH] blockchain have gained noteworthy recognition. Needless to say, a project like Optimism [OP] sustained being the star among many. It dominated the last quarter of 2022 and also in early 2023.\n\nHowever, Arbitrum [ARB] has displaced OP from the top spot following its AirDrop distribution, and upcoming token listing on several exchanges. In turn, the hype that has surrounded the Arbitrum project seems to have triggered reactions to interactions with similar protocols.\n\nIn preparation for the unknown\n\nAccording to Nansen, token swaps and ETH bridges on protocols like zkSync and StarkNet tremendously increased last week.\n\nThese projects are similar in function to both Arbitrum and Optimism. However, StarkNet and zkSync differ from OP and ARB as the former are not Optimism rollups like the latter group.\n\nInstead, StarkNet and zkSync are zero-knowledge (zk) rollups whose aim is to enable any decentralized Application (dApp) to operate at an unlimited scale.\n\nInformation from the blockchain data and research platform showed that about 39,000 addresses bridged $871 million to zkSync within the said period.\n\nThe rise in interaction could be attributed to a possible AirDrop that users might get when they launch a token associated with the projects.\n\nHowever, zkSync has not confirmed that a token would come along with its several upgrades. But it would seem that these addresses are taking no chance if the projects announce a reward.\n\nBuilding the blocks\n\nInterestingly, zkSync has had quite a number of integrations in March. On-chain data services OKLink launched its explorer on the future-proof zk Ethereum Virtual Machine (zkEVM). Also, immersive gaming project Horizon Land collaborated with the project to build a decentralized metaverse platform.\n\nOn the other hand, it seemed that StarkNet will allocate distributed tokens to its users. On 20 March, the StarkNet Foundation tweeted that it was setting up a committee to ensure fair distribution of the ecosystem-powered tokens.\n\nThe Provisions Committee is critical to ensuring the fair, decentralized and transparent distribution of the token that will power the Starknet ecosystem. — Starknet ✨? (@Starknet) March 20, 2023\n\nThe project further mentioned that the function of the committee goes beyond AirDrop provision or token launch. In clearing this point, it noted,\n\n“The Ecosystem Onboarding Committee is responsible for empowering and integrating new developers and community members into the Starknet ecosystem.”\n\nNonetheless, airdrops are no guarantee of the short or long-term performance of assets. Note that other factors like use cases, adoption, and fundamentals also play a role. Although both zkSync and StarkNet seem to have viable use cases, there is no certainty their tokens, if and when launched, might perform like ARB and OP."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9lcy9idXNpbmVzcy8yMDIzLzAzLzIwL3JlbmRlci1uZXR3b3JrLWV5ZXMtc29sYW5hLW1pZ3JhdGlvbi1haGVhZC1vZi1uZXR3b3JrLWNoYW5nZXMv0gFyaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2VzL2J1c2luZXNzLzIwMjMvMDMvMjAvcmVuZGVyLW5ldHdvcmstZXllcy1zb2xhbmEtbWlncmF0aW9uLWFoZWFkLW9mLW5ldHdvcmstY2hhbmdlcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Mar 2023 07:00:00 GMT",
        "title": "Render Network Eyes Solana Migration Ahead of Network Changes - CoinDesk",
        "content": "The Render network currently builds on the Polygon blockchain but has received strong support among its users for a Solana migration. Roughly 55% of users favor making the switch to Solana, while 14% of users would prefer the network remain on Polygon, according to a community sentiment poll included in the proposal. The other 31% of users supported migrations to other blockchains, including Aptos, Ethereum and Algorand, among others."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDMvMjAvZW9zLW5ldHdvcmstdmVudHVyZXMtY29tbWl0cy0yMG0tdG8tYnVpbGQtZGFwcHMtYW5kLWdhbWVzLW9uLWVvcy1ibG9ja2NoYWluL9IBeWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDMvMjAvZW9zLW5ldHdvcmstdmVudHVyZXMtY29tbWl0cy0yMG0tdG8tYnVpbGQtZGFwcHMtYW5kLWdhbWVzLW9uLWVvcy1ibG9ja2NoYWluL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Mar 2023 07:00:00 GMT",
        "title": "EOS Network Ventures Commits $20M to Build Dapps and Games on EOS Blockchain - CoinDesk",
        "content": "Users are spoiled for choice in an increasingly competitive crypto market, however, as relatively newer networks such as Arbitrum, zkSync, Optimism and Solana, among several others, vie for developer talent and increase their own revenues via token incentives or airdrops."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMinQFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9iaXRjb2luLWV0aGVyZXVtLXByaWNlLXN1cmdlLXB1bXBzLWNyeXB0b2N1cnJlbmN5LW1hcmtldC1iaWctZXllcy1jb2luLWxpdmUtbGF1bmNoLWxvb21zLWFzLXZhdWx0LXBpbi0zMDAtYW1wbGlmaWVzLXByZXNhbGUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin & Ethereum Price Surge Pumps Cryptocurrency Market – Big Eyes Coin Live Launch Looms As Vault PIN '300 ... - Analytics Insight",
        "content": "The global cryptocurrency market capitalization reversed to an upward movement to $1.11 trillion, a 3.81% increase from the previous day while the 24-hour trading volume decreased by 17.91% to $66.4 billion. The market cap was just below the $1.08 trillion mark a day earlier which prompted the prices of several cryptocurrencies to trade in the red zone.\n\nHowever, a massive rally for Bitcoin (BTC) and Ethereum (ETH) in 24-hour and weekly trading reversed the downward momentum amidst heavy volatility in the market as it tries to overcome the crisis caused by the closures of Silvergate Capital, Silicon Valley Bank, and Signature Bank in the United States last week.\n\nExpert predictions have indicated that the industry’s market size is to grow annually by roughly 12% to $12 billion by the end of 2030, drawing massive potential for new currencies like Big Eyes Coin (BIG) which has been surging in its presale stage since its launch.\n\nBitcoin – Within Touching Distance of June 2022 High\n\nBitcoin (BTC) registered a sharp reversal in its price to post a 24-hour high of $26,234.39 after renewed confidence in Wall Street as efforts are being made to contain the US banking crisis. Overall the world’s largest cryptocurrency has climbed by 30.52% over the past week and about 57% so far this year and is within touching distance of the highest level since June 2022.\n\nAt the time of writing, Bitcoin was trading at $26,087.28 with a market capitalization of $504 billion, a 5.81% rise from the previous day while holding a 24-hour trading volume of $39 billion.\n\nEthereum – Price Surge After Shanghai Hard Fork Target Date News\n\nEthereum’s (ETH) price jumped overnight by 3.64% to a high of $1,726.62 after news broke out that developers have agreed upon a target date for Shanghai hard fork update that will allow staked Ethereum withdrawals. The target date of 12th April has been brewing for some time as the much-anticipated merge was done in September.\n\nAt the time of writing, Ethereum was trading at $1,723.05 with a weekly growth of 22.14% and a market capitalization of $210 billion, a rise of 3.86% from the previous day.\n\nBig Eyes Coin – Buy BIG, Use Vault PIN ‘300’ for 300% ROI\n\nBig Eyes Coin (BIG) is an ERC-20 meme token created on the Ethereum network with a cat-friendly layout that self-propagates using Non-Fungible Tokens (NFTs), which offers its community access to more content and events.\n\nSince its launch in August last year, the community-owned meme token has been named the most successful presale in recent history. The project is in its 12th stage of presale and has so far raised over $31.7 million in presale tokens and will launch on the market at the end of stage 15 and achieves its target of $50 million in presale tokens.\n\nRegarded as its biggest giveaway yet, Big Eyes Coin has launched the vault PIN ‘300’. A buyer simply has to use the ‘300’ PIN when purchasing $100 or more worth of BIG presale tokens or Big Eyes Coin Loot Boxes for a heavy return of 300% more in Big Eyes Coin Loot Boxes.\n\nBig Eyes Coin Loot Boxes offer buyers a 5000% ROI on a BIG purchase; the Saver Tin, Cute Box, Kitty Vault, Super Saiyan Box, and Excali-Paw Master Chest, each box drop carries a maximum ROI of $500, $5000, $25,000, $100,000, and $1,000,000 worth of BIG tokens, respectively.\n\nThe results are always random, and buyers are guaranteed their money back if a loot box does not generate any prize. The loot box drops will happen only during the presale stage and will end when the project goes live.\n\nFind out more about Big Eyes Coin (BIG):\n\nPresale: https://buy.bigeyes.space/\n\nWebsite: https://bigeyes.space/\n\nTelegram: https://t.me/BIGEYESOFFICIAL\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vY29pbmpvdXJuYWwubmV0L25ld3Mvdml0YWxpay1idXRlcmluLW5vdC1sZWF2aW5nLWV0aGVyZXVtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Mar 2023 07:00:00 GMT",
        "title": "Vitalik Buterin is Not Leaving Ethereum - CoinJournal",
        "content": "Ethereum’s Vitalik Buterin is recognisable in many ways: skinny, dressed in unicorn attire, bed-head, and a serene and faraway smile. Buterin is also the creator and de facto leader of one of the most promising technology networks in the world. Vitalik’s influence stretches well beyond the Ethereum blockchain. His work has informed the entire blockchain space, and he’s been identified as a global thought leader by Forbes and other international media outlets.\n\nIt’s impossible to think about Ethereum without considering its famous creator. And that’s why Ethereum fans seem a little panicked when he talks about the possibility of receding from the spotlight. But is Vitalik really leaving Ethereum? And what would happen if he did? Fortunately, we don’t think Ethereum buyers and fans have anything to worry about in this regard. Here’s what Vitalik means when he talks about leadership decentralisation.\n\nVitalik Doesn’t Plan to Leave Ethereum\n\nTo understand what Vitalik is talking about when he references “fading into the background”, you’ve got to understand his vision for decentralisation. To Vitalik Buterin, a blockchain is no better than a traditional corporation if it’s led by a centralised figure. Vitalik isn’t the CEO of Ethereum; he’s just the guy who started it. And sure, he may be more famous than any other person who works on Ethereum, but this doesn’t mean he’s inherently the most important.\n\nAt various times in his career, Vitalik has made it clear that he’s not the best coder in Ethereum. He’s not the most competent engineer. He doesn’t have the best ideas or the most original innovations. He’s hired people with this expertise over the past couple of years, and many of these are doing the most important technical work on the platform.\n\nEthereum has also been putting more and more of its daily tasks into the virtual hands of algorithms and smart contracts. Many aspects of Ethereum run themselves. If Vitalik disappeared tomorrow, these autonomous wings of the network would continue without his daily influence.\n\nButerin recognises that to be successful for years and decades, Ethereum must be able to survive and thrive without his direct oversight. He also knows where his expertise lies, and where to rely on the skills of others. For this reason, he’s allowing himself to fade into the background, rather than feed a cult of personality that won’t be good for the long-term health of his beloved platform.\n\nIn his own words from Twitter, “I am not leaving. No plans to stop or reduce blog posts/ethresearch posts/Github commits.” These tasks have been the most important that he has ever committed to the protocol, and these he will continue even if he doesn’t pursue the media’s attention like he did a couple of years ago. This is a good thing for Ethereum, and for the leader that the Ethereum community has grown to trust so deeply.\n\nFeatured image source: Flickr"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9kZXNwaXRlLWV0Yy1oYXNocmF0ZS1mYWNpbmctMjAyMy1sb3dzLWhlcmVzLXdoeS1kYXktdHJhZGVycy1yZW1haW4tYnVsbGlzaC_SAWVodHRwczovL2FtYmNyeXB0by5jb20vZGVzcGl0ZS1ldGMtaGFzaHJhdGUtZmFjaW5nLTIwMjMtbG93cy1oZXJlcy13aHktZGF5LXRyYWRlcnMtcmVtYWluLWJ1bGxpc2gvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Mar 2023 07:00:00 GMT",
        "title": "Despite ETC hashrate facing 2023 lows, here’s why day traders remain bullish - AMBCrypto News",
        "content": "Ethereum Classic’s hashrate dropped to its lowest level this year.\n\nDay traders remained bullish as they intensified accumulation.\n\nAt 106.59TH/s, Ethereum Classic’s [ETC] hashrate has hit its lowest point so far this year, data from 2miners.com revealed. Moreover, the chain’s network difficulty at 1.45P also declined to its lowest value since the year began.\n\nRead Ethereum Classic’s [ETC] Price Prediction 2023-24\n\nA network’s hashrate refers to the computing power used by miners to validate transactions and secure the network. On the other hand, network difficulty is a measure of how hard it is to find a block on the blockchain. As more miners join the network and the hashrate increases, the difficulty also increases to maintain a consistent block time.\n\nWhen a blockchain’s hashrate and network difficulty continue to drop, it suggests that the network is becoming less secure and potentially more vulnerable to attacks. It could also indicate a lack of interest or profitability for miners to continue mining the blockchain.\n\nThis might be the case for the ETC network, as data from Messari revealed stagnancy in miners’ revenue from fees paid to process transactions on the blockchain. On a year-to-date basis (YTD), this has oscillated between 0.02% and 0.03%. It rallied to a high of 0.16% on 13 March but declined soon afterward. At press time, this was a mere 0.015%.\n\nETC holders to see gains?\n\nAt press time, ETC traded at $20.61. Moreover, increased buying was spotted during a 12-hour window period. ETC’s price traded close to the upper band of the Bollinger Band indicator, suggesting that day traders have increasingly accumulated the alt.\n\nFurther, the asset’s Relative Strength Index (RSI) was 56.99, while its Money Flow Index (MFI) rested at 57.92 When both the RSI and MFI indicators of an asset are up, it suggests strong buying pressure in the market, which can drive higher prices.\n\nIs your portfolio green? Check out the ETC Profit Calculator\n\nETC’s On-balance volume was also spotted in an uptrend, sitting at 273.532 million at press time. An increasing OBV suggests that the asset volume is increasing over time, indicating that buyers are more active in the market than sellers.\n\nThe Directional Movement Index (DMI) confirmed increased buyers’ presence. At press time, the buyers’ strength (green) at 28.20 was solidly above the sellers’ (red) at 15.97. The Average Directional Index (ADX) showed that the buyers’ strength was a rock hard one that sellers might find impossible to revoke in the short term."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2lzLWJpZy1leWVzLWNvaW4tYmlnLWNvbnNpZGVyZWQtYW4tZXRoZXJldW0tY3J5cHRvY3VycmVuY3ktb3ItYS1zb2xhbmEtY3J5cHRvY3VycmVuY3kv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Mar 2023 07:00:00 GMT",
        "title": "Is Big Eyes Coin (BIG) Considered an Ethereum Cryptocurrency or a Solana Cryptocurrency? - Analytics Insight",
        "content": "Big Eyes Coin (BIG), is an irresistibly cute “Cat” themed cryptocurrency, drawing much attention within the crypto industry after having raised over 31 million$ upon its presale launch. Feature packed with many attractive perks like the ability to yield big profits within a short time, Big Eyes Coin (BIG) belongs to the meme coins family and is expected to surpass its competitive counterparts like Dogecoin (DOGE) and Shiba Inu (SHIB) in the near future.\n\nThis article explores the technology and mechanism behind this cryptocurrency alongside scalability and stateful nature to ascertain whether Big Eyes Coin (BIG) is more aligned with Ethereum cryptocurrency or Solana cryptocurrency.\n\nWhat are the Major Differences Between Ethereum Cryptocurrency and Solana Cryptocurrency?\n\nPossibly the biggest difference between the two blockchain technologies would be the fact that Ethereum 1.0 relies on a Proof-of-Work (PoW) mechanism similar to Bitcoin, whilst Solana\n\nCryptocurrency uses an underlying consensus mechanism known as Proof-of-History (PoH), which takes a series of computing procedures to cryptographically determine the time interval between two events.\n\nAnother major feature that makes Ethereum different from Solana is its “stateful” nature which records all transactions on the network. This implies that each node in the network must update its copy of the network whenever a new transaction takes place to reflect the new transaction. Solana, meanwhile, has a ‘stateless’ architecture and reduces the overall memory consumption, leading to increased performance. Solana’s ability to process a block every 400 millisecond is one of its strong selling points. This means Solana is able to process more than 50K transactions per second (TPS). However, Ethereum is currently progressing to Ethereum 2.0, which is capable of processing over 100K TPS.\n\nEthereum’s scalability is a significant concern for the landscape and worsens in times of high market activity. However, Ethereum is the gold standard of the blockchain landscape, and quite a number of decentralized apps and other blockchain solutions are built in and around the chain.\n\nIn essence, Ethereum offers a more mature and decentralized network, while Solana offers high-speed and low-cost transactions.\n\nConcluding Thoughts About Where Big Eyes Coin (BIG) Fits In?\n\nBig Eyes Coin (BIG) operates on the Ethereum blockchain and uses the ERC-20 standard for its cryptocurrency exchanges, hoping to capitalize on the network’s resources. Ethereum blockchain has the largest DeFi market, which translates to active users, which in turn makes sense for a cryptocurrency like Big Eyes Coin (BIG) to launch on a network where active users are, to allow the liquidity to help give life to the meme coin project.\n\nThe presale of Big Eyes Coin (BIG) began in the third quarter of 2022, and it has already managed to raise over 31 million $, with over a million dollars worth of BIG tokens sold in the first week of the presale alone.\n\nTo see more information or to buy Big Eyes Coin (BIG), check out the links below.\n\nPresale: https://buy.bigeyes.space/\n\nWebsite: https://bigeyes.space/\n\nTelegram: https://t.me/BIGEYESOFFICIAL\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZGVjcnlwdC5jby8xMjQxMTUvZXZlLW9ubGluZS1jcmVhdG9yLWNjcC1yYWlzZXMtNDBtLWNyZWF0ZS13ZWIzLWV2ZS1nYW1l0gFWaHR0cHM6Ly9kZWNyeXB0LmNvLzEyNDExNS9ldmUtb25saW5lLWNyZWF0b3ItY2NwLXJhaXNlcy00MG0tY3JlYXRlLXdlYjMtZXZlLWdhbWU_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Mar 2023 07:00:00 GMT",
        "title": "EVE Online Creator CCP Raises $40M to Create Web3 EVE Game - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEVE Online, a massively multiplayer online role-playing game (MMORPG) in outer space, boasts one of the most hardcore, engaged audiences in gaming. And today, developer CCP Games announced that it has raised money to expand the EVE universe with a new Web3 game.\n\nCCP revealed today that it has raised $40 million in financing in a round led by Andreessen Horowitz to develop what it’s calling “a new AAA title utilizing blockchain technology, set within the EVE universe.” The $40 million round also included participation from BITKRAFT, Nexon, Kingsway Capital, HASHED, among other investors.\n\nThe URL of the announcement website suggests a “Project Awakening” name for the initiative.\n\nAD\n\nAD\n\nIn a press release, the company explained that the new EVE game will feature on-chain systems, with an emphasis on “persistence, composability and truly open third-party development to create a new relationship between virtual worlds and players.”\n\nWe're excited to announce that we have secured $40M financing, led by @a16z, to create a new AAA game within the EVE Universe utilizing blockchain technology. Learn more here: https://t.co/IZJlPRcZ0z pic.twitter.com/y9cqZKtt2l — CCP Games (@CCPGames) March 21, 2023\n\n“Since its inception, CCP Games’ vision has been to create virtual worlds more meaningful than real life,” said CCP CEO Hilmar Veigar Pétursson, in a statement. “Now, with advancements made within blockchain, we can forge a new universe deeply imbued with our expertise in player agency and autonomy, empowering players to engage in new ways.”\n\nEVE Online is celebrating 20 years of existence this year and has cultivated a die-hard audience of players that have formed factions within its sci-fi world. The game has yielded an annual convention in Iceland, an array of spinoff games, and even books documenting historical in-game battles between its contentious rival crews.\n\nWhile this is CCP’s first move into Web3 gaming, Pétursson has long been interested in the potential for blockchain to revolutionize concepts like user ownership and open economies in the gaming world.\n\nAD\n\nAD\n\nBut he’s been realistic about it.\n\nIn 2020, Pétursson told Decrypt that he thought the addressable market for blockchain games was too small at the time for CCP to make any moves. He also noted the complexities around handling crypto, and said that it could be five to 10 years before a blockchain game had the potential to be a true “killer app.”\n\n\"I'm not sure necessarily that it will be a tipping point,” he said in 2020. “But you could foresee a time where there's a killer app, where you just really have to get involved regardless of whether you need to figure something out, and that pulls in a wave of people and kind of starts an avalanche.\"\n\nCCP Games isn’t the only major traditional game maker to enter the Web3 world.\n\nAssassin’s Creed publisher Ubisoft has been experimenting and investing in the space for years, for example, while Final Fantasy creator Square Enix is actively developing NFT games—such as the upcoming Symbiogenesis on Ethereum scaling network, Polygon."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3doYXRzLXRoZS1sYXRlc3QtdXBkYXRlLW9uLWRvZ2V0dGktZXRoZXJldW0tYW5kLWF2YWxhbmNoZS1iZWZvcmUteW91LWJ1eS10aGVtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Mar 2023 07:00:00 GMT",
        "title": "What's the Latest Update on Dogetti, Ethereum, and Avalanche Before You Buy Them? - Analytics Insight",
        "content": "Undoubtedly, cryptocurrencies represent some of the most innovative uses of digital technology in the 21st century. Crypto tokens allow users to do more than they can with traditional financial institutions. These tokens have also created a thriving ecosystem where different assets are traded against one another – called the coin or crypto market. You can make plenty of money from this market by gauging price differences and movement. The only downside to this ecosystem is that price changes could be rapid and detrimental.\n\nTo enjoy the best of the coin market, you need to make well-calculated purchase decisions. You should only invest in high-potential crypto tokens with strong utility and infrastructure. But what are they? This piece will introduce you to unique crypto tokens and reveal how these projects will benefit you.\n\nDogetti’s Battle to Get to the Top of The Meme Sector\n\nFor a long time, the coin market has been dominated by dog-themed meme coins. These coins, Dogecoin and Shiba Inu have dominated news headlines in the meme sector. And it’s almost as if there would be no worthy replacement. Dogetti(DETI) is set to change this stereotype.\n\nAccording to its whitepaper, Dogetti is a revolutionary meme coin that wants to create a close-knit community of users. It will refer to this community as a family to indicate their commitment to the growth of the project. They understand the importance of an active community to the long-term growth of a crypto token. And that’s why they wish to create an ecosystem where holders can communicate, contribute and share ideas to reward. Dogetti will encourage involvement from its users through its DAO. This DAO will keep holders in the driving seat, unlike other meme coins.\n\nThe main selling point of Dogetti is the project’s commitment to rewarding its users. It uses a 2% reflection model. This model ensures that 2% is deducted from all transactions. This will serve as the main source of income for those who have opted to join this project. There’s a sharing fee for all deductions from the platform. So, you can rest assured the money will go to the right place. It’s clear that the Dogetti team business. They have created a detailed outline of their token’s roadmap.\n\nDETI is the token that powers this ecosystem. Finally, there’s a maximum token supply of 100 billion DETI. This figure is considerably less than other meme coins.\n\nEthereum’s Ability to Host Decentralized Applications\n\nWhen Vitalik Buterin launched Ethereum, no one could predict that it would become the second-largest cryptocurrency in the world. But Ethereum’s success has been due to the innovativeness it introduced to the coin market. Ethereum was the project that showed coin market developers the true meaning of decentralization.\n\nEthereum serves as a cryptocurrency and blockchain. It can use its blockchain to host other decentralized applications, games, and crypto projects. Through the reliance on smart contracts, new projects increased exponentially on Ethereum. But this blockchain’s main utility turned out to be its major problem. As more projects were added to Ethereum, it didn’t take long before the project became slower and more expensive.\n\nEthereum’s development team is working on several solutions to restore the project to what it used to be. They will use layer-2 networks to boost the project’s network.\n\nAvalanche’s Capacity to Replace Ethereum\n\nAvalanche is one of the latest projects on the coin market. It belongs to a special category of crypto tokens developed to replace Ethereum. Avalanche can host decentralized applications on its smart contracts. However, Avalanche can handle its processes faster than Ethereum.\n\nBecause of Avalanche’s speed, many prefer hosting their project on this blockchain. More and more projects have gradually been added to this network. This network also supports scalability, making it attractive to different types of investors.\n\nIf you wish to jump on the Dogetti band, use the links below;\n\nPresale: https://dogetti.io/how-to-buy\n\nWebsite: https://dogetti.io/\n\nTelegram: https://t.me/Dogetti\n\nTwitter: https://twitter.com/_Dogetti_\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY29pbmpvdXJuYWwubmV0L25ld3MvZXRoZXJldW0td29ydGgtbW9yZS10aGFuLXR1cmtpc2gtbGlyYS1hbmQtbm9yd2VnaWFuLWtyb25lL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Mar 2023 07:00:00 GMT",
        "title": "Ethereum worth more than Turkish lira and Norwegian krone - CoinJournal",
        "content": "A little over two weeks ago, I wrote about the value of ETH versus fiat money, with an emphasis on the Russian ruble. ETH is up 35% during this period, so a good time to look back.\n\nEthereum in 27th place\n\nAs can be seen from Coinmarketcap's data, Ethereum is ranked number 27 by market value. This is 13 spots below bitcoin, which has not moved a single spot in the same time period. Ethereum is four spots higher than two weeks ago.\n\nEthereum is under the Polish zloty, which is still number 26. But ETH has gained territory against the Chilean peso, the Norwegian krone and the Turkish lira. These fiat currencies are now worth less than Ethereum, and that is a big win.\n\nRussian ruble is crawling back up\n\nIn total, there are 101 currencies on Coinmarketcap's list, with Bitcoin being the highest ranking crypto in the list at number 14, below the Swiss franc, but above the Thai baht. The comeback of the Russian ruble is however striking.\n\nTwo weeks ago, this coin was still in place 25. That is eleven places difference with bitcoin. Ethereum came pretty close at the time by six spots, but since then the ruble has risen in market value. Right now, the ruble is back on the heels of bitcoin, with only two spots in between.\n\nMarket cap back above 2 trillion\n\nEthereum, like Bitcoin, is on the rise again. The crypto market was booming last night, with Ethereum up 7% from the day before. The market seems to be slowly turning bullish again as fiat currencies are depreciating against BTC and ETH.\n\nThe market is thriving as the total market capitalization recaptures two trillion dollars (1.82 trillion euros). For the people who don't see this for themselves; a trillion is a number with twelve zeros. Of this, about 900 billion dollars (681 billion pounds) is bitcoin and about 400 billion dollars (302 billion pounds) Ethereum."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiswFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9zaGliYS1pbnUtc2hpYi10YWtlcy10b3Atc3BvdC1hcy1tb3N0LXBvcHVsYXItbWVtZS10b2tlbi1oZWxkLWJ5LWV0aGVyZXVtLWV0aC13aGFsZXMtZXhwZXJ0cy1zYXktaXRzLXNvb24tdG8tYmUtb3ZlcnRha2VuLWJ5LW9yYmVvbi1wcm90b2NvbC1vcmJuL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Mar 2023 07:00:00 GMT",
        "title": "Shiba Inu (SHIB) takes top spot as most popular meme token held by Ethereum (ETH) whales, experts say it's soon to ... - Analytics Insight",
        "content": "Shiba Inu may be a meme, but where it comes to wealth, it ain’t no joke! Data from WhaleStats shows that out of the top 100 Ethereum Whales, SHIB is the most popular of all altcoins, accounting for over 1/5th of all the (non ETH) crypto held by these ETH whales. Orbeon Protocol is an up and coming crowdfunding and community VC project, whose token is up by over 20x since last November, and is still in presale.\n\n>>BUY ORBEON TOKENS HERE<<\n\nShiba Inu swims with the Whales\n\nThe ocean has been full of Shiba Inus this week (not literally thank goodness!), as a few days ago, a huge ETH and SHIB whale purchased 118,058,494,947 SHIB, worth $1.34 million. That might seem a lot but to for crypto behemoth it merely seems to be ‘buying the dip’, since they already hold a staggering $214 million worth of SHIB.\n\n>>BUY ORBEON TOKENS HERE<<\n\nThe Story of Shiba Inu\n\nSHIB started as a small project on the Ethereum blockchain, with anonymous developers, capitalizing on the crypto and internet’s love of Shiba Inu dogs and Dogecoin. At first many thought it was merely a joke, but things began to change for the crypto after anonymous developer ‘Ryoshi’ sent 50% of the supply to Ethereum’s creator Vitalik Buterin. Buterin promptly sent 10% to a covid relief fund for India and burnt the rest, pumping the price and ensuring that he didn’t have further power to move the markets, something he said he didn’t want.\n\nThe team kept developing, and built an initially criticized dex and DeFi platform ‘ShibaSwap’. With time, though, the team got the bugs fixed and the Shiba Inu project became more decentralized, with various community projects, dapps and games being developed for the ecoystem.\n\nElon Musk famously has a pet Shiba Inu and takes pleasure in tweeting things that often send both SHIB and DOGE, if not to the moon, at least pumping to the clouds.\n\n>>BUY ORBEON TOKENS HERE<<\n\nThe Shibarium finally arrives\n\nThe long awaited news for SHIB holders, is the release of the Shibarium, a totally functional layer 2 blockchain, which has just gone live on beta mode on the Goerli and Puppynet test networks, (at time of writing I was unable to connect using Puppynet but Goerli was working). Similarly, the beta of the Orbeon Protocol staking dashboard has just gone live on Goerli.\n\nCurrently, in beta, the Shibarium mainly has robot looking dogs and forms to work or collaborate with them, though it does have what seems to be staking dashboards.. They are apparently recruiting people for web3 AND web4 now. Hope they let us know what that means.\n\nRyoshi reminded people that this is just a testnet, nothing on there has any real world value and therefore, not to fall prey to any scams.\n\n>>BUY ORBEON TOKENS HERE<<\n\nOrbeon Protocol to be the next big thing\n\nIt takes time to become a top 50 altcoin, and Orbeon Protocol, still in presale, has a long way to go. However if SHIB can capture the hearts of the people, then Orbeon Protocol can capture the budding venture capitalists of the people. Orbeon Protocol allows small and medium sized businesses to access a new way of funding, by using fractionalised NFTs and enabling the ordinary investor to get involved, no matter where from, who they are, or how much money they have.\n\nIn general, if you want to get in on really great investing deals, you need to be early. Even if SHIB increases dramatically in price, it still can’t go that high, due to its already high market cap. ORBN on the other hand, is still in presale, so those getting involved now are still very early. Experts predict that ORBN, now worth $0.0877 could reach $0.24, which is 173% gain for those getting in today.\n\nFind Out More About the Orbeon Protocol Presale:\n\nWebsite: https://orbeonprotocol.com/\n\nPresale: https://presale.orbeonprotocol.com/register\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3RvcC0xMC1jcnlwdG9jdXJyZW5jaWVzLXdpdGgtdGhlaXItaGlnaC10cmFuc2FjdGlvbi1zcGVlZHMtaW4tMjAyMy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Mar 2023 07:00:00 GMT",
        "title": "Top 10 Cryptocurrencies with Their High Transaction Speeds in 2023 - Analytics Insight",
        "content": "Top 10 cryptocurrencies with high transaction speeds in 2023 are enlisted and detailed below\n\nIf you are a crypto enthusiast, you might be curious as to which cryptocurrencies have the fastest or fastest transaction speeds. You won’t need to look any further because the information you require is right here. This article will focus on the top cryptocurrencies with the fastest transaction speeds and delve deeply into the world of Blockchain transaction speed. In addition, we will investigate the reason why speed is so important in the cryptocurrency industry. In this segment, we should investigate a portion of the highest-level 10 cryptocurrencies in 2023 with their high exchange speeds.\n\nThere are several cryptocurrencies, but bitcoin is the most well-known and costly one. However, bitcoin’s transaction speed is rather sluggish. Due to their high transaction speeds, some cryptocurrencies are regarded as the most efficient.\n\nIn 2023, these are the top 10 cryptocurrencies with high transaction speeds.\n\nRipple (XRP): Ripple (XRP) is a digital payment protocol that facilitates low-cost, near-instantaneous international transactions. Ripple’s rapid transaction speed is one of its key characteristics. The XRP Ledger settles transactions in 3-5 seconds, as stated on the Ripple website. Compared to other cryptocurrencies like Bitcoin and Ethereum, which can take several minutes or even hours to process transactions, this is significantly quicker.\n\nEOS: EOS is a 2018-launched Blockchain platform. It is intended to give a quick and versatile framework for decentralized applications (dApps). Transaction speed is one of EOS’s most important features. The maximum transaction speed of EOS is approximately 4,000 TPS. One of the most scalable Blockchain platforms currently available, the EOS Blockchain can process up to thousands of transactions per second (TPS).\n\nNEO: NEO is a Blockchain platform that first debuted in 2014 under the name Antshares before changing its name to NEO in 2017. Transaction speed is one of NEO’s most important features. As indicated by the Bitdegree article you gave, NEO has an exchange speed of around 15 exchanges each second (TPS). Even though this is significantly faster than Bitcoin’s transaction speed, it is still significantly slower than EOS and Ripple, and other Blockchain platforms.\n\nCardano (ADA): Cardano (ADA)’s transaction speed is one of its most important features. Cardano can process more than 1,000 transactions per second (TPS), which is comparable to other high-speed Blockchain platforms like EOS and is significantly faster than Bitcoin’s transaction speed.\n\nSolana (SOL): One of the most widely used payment processors, Solana (SOL), can process up to 24,000 transactions per second, while Ethereum, one of the largest Blockchain networks, can process approximately 15 transactions per second. Solana (SOL) Solana is a Blockchain platform that was launched in March 2020 to resolve the scalability issues faced by other Blockchain networks.\n\nSteller (XML): Steller (XML) According to Stellar’s official website, the Stellar Core software enables the platform to process up to 1,000 transactions per second. Compared to Bitcoin, Ethereum, and a few other well-known Blockchain platforms, this speed is significantly higher.\n\nTron (TRX): TRON professes to have an exchange speed of roughly 2,000 exchanges each second (TPS). Utilizing delegated proof-of-stake, a network with high bandwidth, and a quick block time of just three seconds are some of the optimizations that contribute to this high speed.\n\nCosmos (ATOM): Cosmos (ATOM) Cosmos boasts high transaction speeds, with a Tendermint consensus algorithm throughput of up to 10,000 transactions per second (TPS). However, the application and network congestion may affect the actual transaction speed.\n\nEthereum (ETH): Ethereum (ETH) The most recent version of Ethereum, known as Ethereum 1.0, can process approximately 15 transactions per second (TPS) of transactions. Ethereum has been working on Ethereum 2.0, or Eth2, a significant upgrade. The current proof-of-work (PoW) consensus mechanism will be replaced by a proof-of-stake (PoS) consensus mechanism as part of this upgrade. It is anticipated that this change will significantly boost the network’s transaction speed, with estimates indicating that Ethereum 2.0 could eventually process up to 100,000 TPS.\n\nWaves: Waves is a Blockchain platform for creating custom digital assets and developing decentralized applications (dApps). Up to 6,000 transactions per minute, or about 100 transactions per second, can be processed by the platform (TPS). This is made conceivable through the execution of Waves-NG, which utilizes a unique block size and focuses on exchanges in light of their expense rate.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vYml0Y29pbmlzdC5jb20vZXRoZXJldW0tZmVlLXJlbWFpbnMtbG93LWRlc3BpdGUtcHJpY2UtcmlzZS1tZWFucy_SAU1odHRwczovL2JpdGNvaW5pc3QuY29tL2V0aGVyZXVtLWZlZS1yZW1haW5zLWxvdy1kZXNwaXRlLXByaWNlLXJpc2UtbWVhbnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Mar 2023 14:04:39 GMT",
        "title": "Ethereum Fee Remains Low Despite Price Rise: What It Means - Bitcoinist",
        "content": "On-chain data shows the Ethereum transaction fee has remained low despite the recent price rise. Here’s what this may mean for the market.\n\nEthereum Fees Saw Huge Spike During The Local Bottom\n\nAs per data from the on-chain analytics firm Santiment, the ETH transaction fee has fallen below $2 per transfer now. The relevant indicator here is the “average fees,” which measures the total amount of fees (in USD) that investors have to attach to their Ethereum transaction in order for it to go through on the blockchain.\n\nThe value of this metric can fluctuate depending on the traffic that the network is receiving. Generally, when there are a large number of transfers happening at once, transactions may take more time to be executed. So, those that want their transfers to go through quickly during such times of congestion simply attach a higher fee with their transactions to make sure that they are prioritized by the network.\n\nOn the other hand, when there aren’t many users making moves on the chain, the average fees can plummet since there aren’t many investors competing against each other to get their transactions done quicker anymore.\n\nBecause of this relationship, the average fees indicator can provide insight into whether the Ethereum network is seeing a high amount of activity or not at the moment.\n\nNow, here is a chart that shows the trend in the ETH average fees over the last few months:\n\nLooks like the value of the metric has observed some decline in recent days | Source: CryptoQuant\n\nAs displayed in the above graph, the Ethereum average fees had seen some pretty high values earlier in the month when the ETH price had plunged and hit a local bottom.\n\nDuring this spike, the indicator had reached a peak of about $8.12, suggesting that holders were active back then. This high network traffic naturally came in part from those who were applying selling pressure on the coin, thus the decline in the price.\n\nHowever, that wasn’t all. The high fees would have also been a result of the buyers rushing in to buy the cryptocurrency at the low prices, hence why the asset’s value sharply shot up not too long after.\n\nEthereum has continued this fresh price surge recently, with the asset even managing to break above $1,800 briefly during the weekend, a level that the coin hadn’t previously reached since August 2022.\n\nAs this rise in the value of Ethereum has occurred, however, the average fees have only trended down. Now, the indicator’s value has dropped to just $1.75, implying that the network isn’t too hot right now despite the rally.\n\nSantiment thinks that this could be a good sign for ETH as it means the price wouldn’t encounter any notable transaction barriers currently, something that could help open the door to $2,000 for the asset.\n\nETH Price\n\nAt the time of writing, Ethereum is trading around $1,780, up 12% in the last week.\n\nETH seems to have shot up recently | Source: ETHUSD on TradingView\n\nFeatured image from DrawKit Illustrations on Unsplash.com, charts from TradingView.com, Santiment.net"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDMvMjEvZXRoZXJldW0taW5jcmVhc2Utc3Rha2luZy1jcnlwdG8tbGlkby_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Mar 2023 07:00:00 GMT",
        "title": "Ethereum: increase the staking crypto on Lido - The Cryptonomist",
        "content": "Very positive crypto news for the blockchain industry: the market capitalization of Lido’s staked Ether has increased to $10.3 billion, with the cryptocurrency posting significant gains over the past week and Ethereum’s price up 11.9%.\n\nThis recent increase has pushed the token’s overall market valuation to the eighth position, according to Coingecko data.\n\nSome data regarding the crypto market: staking of Ethereum on Lido grows\n\nAs anticipated, the value of liquid staking tokens associated with Ethereum (ETH) increased significantly over the past week after Ether’s 11.9% gains against the US dollar.\n\nNotably, Lido’s staked Ethereum token, STETH, now has a market capitalization above the $10 billion range, reaching $10.36 billion on Monday 20 March 2023.\n\nAccording to Coingecko’s statistics, STETH’s market valuation now ranks eighth, with Dogecoin‘s (DOGE) market capitalization ranking tenth. Above STETH is the market valuation of Polygon (MATIC) at $10.42 billion.\n\nCurrently, there is a circulating supply of about 5.8 million STETH and in the last 24 hours the token has registered global exchanges of $22.35 million. The most active exchanges dealing with STETH are Bybit, Gate.io, and Huobi.\n\nSTETH has gained 12.4% this week and 4.6% in the past 30 days. Currently, the Lido Finance website estimates that STETH stakers are receiving an annual percentage rate (APR) of about 5.9% by staking the token.\n\nDefiLlama’s statistics\n\nAt the moment, Lido is the largest decentralized finance (DeFi) protocol of the $49.01 billion total value locked (TVL) on Monday. Lido’s TVL accounts for 21.59% of the entire amount of value locked in DeFi.\n\nIn the past seven days, DefiLlama’s statistics show that the Lido’s TVL has increased by 8.9% and in 30 days it has increased by 17.07%. DefiLlama explains that as of Monday, 7.83 million ETH worth $13.98 billion are staked in liquid staking protocols.\n\nLido’s STETH accounts for 74.51% of the aggregate. Coinbase’s Wrapped Ether token protocol has a total blocked value of $2.1 billion, or 1.16 million Ethereum. It is the second largest liquid staking project in terms of TVL.\n\nWhile STETH is shown on Coingecko as the eighth largest coin by market capitalization, this is not the case for other cryptocurrency market aggregation websites such as CoinMarketCap.\n\nSince it is a synthetic version of Ether, some cryptocurrency market aggregation sites do not include STETH in the top ten, despite its capitalization.\n\nLido and the $30 million in Ethereum: selling or staking?\n\nThe Decentralized Autonomous Organization behind Lido, Ethereum’s largest staking pool, is considering whether to sell or stake the $30 million in Ether (ETH) from its treasury.\n\nA proposal was submitted on 14 February by DAO’s financial unit, Steakhouse Financial: four possible choices, one of which contemplates staking some or all of its ETH on Lido in the form of Lido Staked ETH (stETH).\n\nAnother choice would see LidoDAO selling some or all of its 20,304 ETH in exchange for stablecoins. Thanks to the Shanghai and Capella upgrades, both scheduled for the first half of the year, users will soon be able to withdraw their staked ETH.\n\nAlthough the conversion of ETH to Staked ETH could lead to higher profits in the long run, Steakhouse Financial is concerned that locking too much of the funds within the smart contract could cause the risk of not having enough ETH on hand when needed.\n\nSteakhouse Financial stated that it may be necessary to exchange Ether for a stablecoin to ensure greater liquidity should operating expenses increase.\n\nSteakhouse Financial also revealed that LidoDAO currently boasts an inflow of about 1,000 stETH per month. In other words, DAO earns between $1.3 million and $1.5 million per month, with the price of ETH fluctuating between $1,100 and $1,700.\n\nHowever, Steakhouse Financial is considering whether it is worth converting excess stETH into stablecoins so that it can more calmly deal with potential changes in market conditions that could cause an increase in operating expenses.\n\nAt the moment, it appears that most LidoDAO members favor the partial sale and staking of a slice of the 20,304 ETH currently stuck in its Aragon smart contract."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDMvMjAvbWljcm9zb2Z0LW1heS1pbnRlZ3JhdGUtZXRoZXJldW0td2FsbGV0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Mar 2023 07:00:00 GMT",
        "title": "Microsoft may integrate an Ethereum wallet into its browser - The Cryptonomist",
        "content": "A few days ago, screenshots surfaced on Twitter that appear to refer to an Ethereum wallet for Edge, Microsoft browser.\n\nNewest in the gauntlet of questionable upcoming Microsoft Edge features, a crypto wallet 💸\n\nNot really sure how to feel about this kind of thing being baked into the default browser, what are your thoughts?\n\nMore screenshots of the UI in the next tweet ➡️ pic.twitter.com/GAUPiZGLIY — Albacore (@thebookisclosed) March 17, 2023\n\nIt appears from the screenshots that this is supposed to be a non-custodial Ethereum wallet, but for now there is no official confirmation.\n\nThe speculation is that the company is testing this new feature, namely the possible integration of an Ethereum wallet within its Edge browser.\n\nIs Microsoft Edge about to integrate an Ethereum wallet?\n\nEdge is Microsoft browser that replaced the historic Internet Explorer as of 2015.\n\nIndeed, Internet Explorer, born in the very distant 1995, was finally abandoned this year, overtaken by more advanced alternatives such as Google’s Chrome, Apple’s Safari, or Mozilla’s Firefox.\n\nAs of today, with Internet Explorer still being used by 0.25% of web users, Edge has surpassed 4%, so it is among the little-used browsers although it is more widely used than Firefox. But Safari stands out with 19% and especially Chrome with almost 66%.\n\nMoreover, lately these percentages appear to be fairly stable, so much so that the use of Microsoft browser does not appear to be increasing significantly in recent times.\n\nAt one time, Internet Explorer dominated, and a decade or so ago it was still used by more than 30% of web users.\n\nThus it has been a real decline for Microsoft, from a dominant position to a totally marginal one in the space of some twenty years, with the new Edge failing to even remotely take the place of the old Explorer.\n\nHowever, it is worth pointing out that there has been a boom in smartphone browsing over the past two decades, and with Google’s Android and Apple’s iOS dominating the smartphone world, it is more than logical that the respective browsers have also taken over.\n\nIt is therefore not surprising that Microsoft is trying to evolve its new browser, for example by doing something that neither Chrome nor Safari have already done natively: integrate a crypto wallet.\n\nThe other browsers compared\n\nThere are actually two other browsers, Opera and Brave, that have already integrated a crypto wallet natively, but they are used very little, less than Edge.\n\nIn addition, there are third-party crypto wallets that can be easily integrated into Chrome, such as MetaMask, so Microsoft’s is not much of a novelty.\n\nTherefore, this is not an attempt to challenge other browsers on the cryptocurrency terrain, but probably just an attempt to keep Edge up-to-date with new technologies.\n\nCrypto and Ethereum ecosystem: the importance of Microsoft initiative\n\nDespite the fact that there is still no official confirmation that Microsoft is really integrating an Ethereum wallet on Edge, the fact that it apparently stands the concrete technical feasibility may be something important.\n\nAccording to screenshots posted on Twitter, the initiative would be related to Web3 and NFTs, and not so much to cryptocurrencies, and this actually could make sense.\n\nA company like Microsoft has already approached the world of NFTs years ago, and since it is very much in the gaming business, it inevitably has to deal with these new technologies.\n\nAn eventual integration of an Ethereum wallet into Edge could have positive repercussions for the crypto markets.\n\nIn fact, it would be for all intents and purposes a kind of endorsement of the US giant toward the entire crypto sector, and not just the NFT sector.\n\nIn fact, it is worth mentioning that to send NFTs on Ethereum one has to pay fees in ETH, so if that wallet is integrated it will inevitably lead to an increase in cryptocurrency usage.\n\nMoreover, it also appears from the published screenshots that the wallet integrated into Microsoft Edge would also in turn have integration with Coinbase to enable cryptocurrency buying and selling and swaps.\n\nWhile the actual use of this wallet might be marginal, given the low usage of Edge in the world, it could, nonetheless, lead the way for possible similar initiatives by Google and Apple.\n\nIt is worth not forgetting that with Xbox, Microsoft is one of the world leaders in online gaming, so an eventual integration with one of its crypto wallets within the browser could easily convince Google to do the same with Chrome.\n\nGoogle has also been in this industry for some time, and should crypto wallets integrated into the browser be successful, it is to be expected that some initiative of its own in this regard will be forthcoming.\n\nBrowser-integrated crypto wallets\n\nBrowser-integrated crypto wallets have a huge advantage: they allow direct and immediate interaction with websites.\n\nFor example, they allow in-browser crypto payments, but also logins without passwords or digital signatures.\n\nThe more widespread the use of cryptocurrencies and NFTs becomes, the more users will feel the need to have a crypto wallet integrated within the browser.\n\nThen again, the resounding success of MetaMask, which was born only in 2016, shows how much need there already is for such technology. It is enough to mention that by the end of 2021 MetaMask already had more than 21 million monthly active users.\n\nConsidering that a crypto wallet can be a profit-making service, especially through fees or spreads on trades and swaps, it is hard to imagine that Google and Apple will pass up this opportunity.\n\nEspecially should Microsoft seize the opportunity, not least because no one prohibits Microsoft from creating its own Chrome extension that integrates its crypto wallet within Google’s browser.\n\nMicrosoft other integrations\n\nRecently, another major integration made by Microsoft has caused a lot of buzz.\n\nAfter buying the company behind ChatGPT, Microsoft integrated the now-famous AI-based chat within its Bing search engine.\n\nNowadays the search engine market is dominated by Google, with 93% of searches, but in second place is Bing itself with just under 3%.\n\nThe integration of ChatGPT has brought a lot of interest in Bing, although so far it does not seem to have succeeded at all in undermining the almost absolute dominance of Google.\n\nNonetheless, this shows that Microsoft has by no means given up on competing with Google, and Apple, although so far none of its initiatives have produced big results in this respect. In terms of browsers and search engines Microsoft is still clearly behind Apple, but especially Google.\n\nIt could move forward with cryptocurrencies and NFTs thanks to a native Ethereum wallet that its two main competitors do not have.\n\nMoreover, theoretically speaking, the native crypto wallet could also turn a profit, so Microsoft could benefit twofold.\n\nIt is worth noting that in the stock market Microsoft still capitalizes more than Alphabet (formerly Google), and slightly less than Apple.\n\nIndeed, the company is still a leader not only in gaming, but also in office software (thanks to Microsoft Office, which is now pay-for-use), and in some industrial and professional areas, such as with its Azure cloud.\n\nIt is still a real giant with very few equals, even though it has long since lost its leadership in the web sector. Thus a public endorsement of Ethereum by it might be of significant importance to this network.\n\nEthereum Merge, common creative license"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3LnRyb253ZWVrbHkuY29tL29reC1mb3VuZGVyLXVudmVpbHMtdGhlLWZ1dHVyZS1vZi1va2JjaGFpbi_SAUpodHRwczovL3d3dy50cm9ud2Vla2x5LmNvbS9va3gtZm91bmRlci11bnZlaWxzLXRoZS1mdXR1cmUtb2Ytb2tiY2hhaW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Mar 2023 07:00:00 GMT",
        "title": "OKX Founder Unveils The Future Of OKBChain: A Promising Layer 2 Ethereum Sidechain - TronWeekly",
        "content": "Star Xu, the founder of the OKX exchange, has made an announcement on Twitter about the future of the exchange’s public blockchain. According to Xu, the new exchange public blockchain, OKBChain, will be a layer 2 (L2) chain of Ethereum, starting from side chain technology and eventually developing to ZK technology. However, the old OKT Chain will continue to be kept as L1.\n\nOKT Chain will continue be a L1 Chain,the closest launch will be OKTC WASM which allow us develop high performance Dapp through rust or c++. OKB Chain will be a L2 Chain of Ethereum, starting from side chain technology and will develop to ZK technology. Both OKTC and OKBC are on… https://t.co/pl35k9wQdY — Star (@star_okx) March 20, 2023\n\nIn response to a question from a community member about whether OKBChain and OKT will be different or under one umbrella, Xu clarified that OKT Chain would remain an L1 chain and that the closest launch would be OKTC WASM. It will allow developers to create high-performance Dapps through Rust or C++. Xu also stated that both OKTC and OKBC are on the OKX core chain strategy.\n\nXu’s tweet comes after a previous tweet in which he stated that the Testnet for the new public blockchain would launch soon without delay. With this announcement, it seems that the OKX exchange is making strides toward a more advanced and efficient blockchain infrastructure, promising exciting developments for users and investors alike.\n\nOKX’s Core Products: Driving Blockchain Solutions\n\nIn an announcement on social media by a Twitter account, OKC, it was reported that OKBchain would launch its testnet as planned in March. The company also provided some additional details regarding its other projects.\n\nAccording to a tweet, OKTChain will refer to the current OKC and will continue to operate as an L1 public chain. The platform will also support WASM virtual machines in the future, providing increased functionality for its users.\n\nOKB Chain, on the other hand, is positioned as an L2 of ETH and will take the ZK route. This will allow the platform to provide enhanced security and scalability, making it an attractive option for developers and users.\n\nBoth OKT Chain and OKB Chain are considered core products of OKX, a leading provider of blockchain solutions.\n\nHowever, as the company continues to expand its offerings and explore new technologies, it will be interesting to see how these projects develop and contribute to the overall growth of the blockchain ecosystem.\n\nRelated Reading | Bitcoin To $1 Million In 90 Days: Crypto Analyst Sparks Debate With Bold Prediction"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vd3d3LmNyeXB0b3BvbGl0YW4uY29tL2VyYy03MjEtdW5pcXVlLWRpZ2l0YWwtYXNzZXRzLWV0aGVyZXVtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Mar 2023 07:00:00 GMT",
        "title": "How is ERC-721 Used to Create Unique Digital Assets on the Ethereum Blockchain? - Cryptopolitan",
        "content": "Welcome to the world of non-fungible tokens, where digital assets are as unique as your fingerprints, and ownership is forever engrained on the blockchain. ERC-721 is a groundbreaking standard on the Ethereum blockchain that has paved the way for the creation and exchange of non-fungible tokens, also known as NFTs.\n\nWhat makes ERC-721 different from other token standards on the blockchain? This is a stark contrast to fungible tokens like ERC-20s, which are interchangeable with one another. This article aims to tell you everything you need to know about ERC-721.\n\nWhat is ERC-721?\n\nERC-721 is a technical standard on the Ethereum blockchain that defines the rules for creating and exchanging non-fungible tokens (NFTs). Unlike fungible tokens like ERC-20s, each ERC-721 token is unique and represents a specific asset, whether it be a piece of artwork, a collectible, or even a virtual plot of land.\n\nSo, how does ERC-721 differ from other NFT standards on the blockchain? One key difference lies in its simplicity. ERC-721 is a straightforward and easy-to-understand standard that allows developers to create and exchange NFTs with ease. This has led to the widespread adoption of ERC-721 in the blockchain industry and beyond.\n\nAnother important feature of ERC-721 is its flexibility. Users can use ERC-721 to create truly unique assets that cannot be replicated or duplicated, unlike other NFT standards like ERC-1155. This has opened up a whole new world of possibilities for digital asset creation and ownership, with countless use cases across industries.\n\nERC-721’s technical specifications are based on the Ethereum blockchain and implemented through smart contracts. Each ERC-721 token is stored on the blockchain and is associated with a specific owner, making it impossible to counterfeit or manipulate. The lifecycle of an ERC-721 token includes minting, transferring, and burning, all of which are governed by the smart contract rules defined in the ERC-721 standard.\n\nERC-721 was first proposed in 2017 by a developer named Dieter Shirley. The proposal outlined a new standard for creating and exchanging non-fungible tokens (NFTs) on the Ethereum blockchain. Unlike fungible tokens like ERC-20, each ERC-721 token is unique and represents a specific asset, whether it be a piece of artwork, a collectible, or even a virtual plot of land.\n\nThe Ethereum community officially adopted the ERC-721 standard in March 2018, after undergoing a rigorous review process. The blockchain community quickly embraced the standard, with developers using ERC-721 to create a wide range of unique digital assets, from virtual cats and monsters to rare digital artwork and virtual real estate.\n\nOne of the most notable early adopters of ERC-721 was the popular blockchain game CryptoKitties, which allowed players to buy, sell, and breed virtual cats using ERC-721 tokens. The game quickly became a sensation, with players spending millions of dollars on rare virtual cats and driving up the price of some of the game’s most valuable assets.\n\nCountless applications have used ERC-721 since then, from virtual real estate and collectibles to ticketing and even identity verification. Its unique properties and flexibility have made it a powerful tool for creating and exchanging unique digital assets on the Ethereum blockchain.\n\nHow Does ERC-721 Work?\n\nSmart contracts on the Ethereum blockchain create and manage ERC-721 tokens. These smart contracts established the rules for minting, transferring, and burning ERC-721 tokens, ensuring that each token is unique and non-fungible.\n\nMinting an ERC-721 token begins with a smart contract that defines the parameters of the token, such as its name, symbol, and metadata. By interacting with the smart contract through a user interface like a web application or mobile wallet, the creator can deploy the smart contract on the blockchain and mint new tokens.\n\nWhen one user transfers a token to another, the smart contract updates the ownership record on the blockchain. When one user transfers a token to another, the smart contract updates the ownership record on the blockchain, ensuring that the new owner is now the rightful owner of the token. This process is completely transparent and auditable, making it impossible to manipulate or counterfeit ERC-721 tokens.\n\nBurning ERC-721 tokens is another important function of the ERC-721 standard. When they burn a token, they reduce the total supply of that asset by permanently removing it from circulation. This can be useful for creating scarcity and increasing the value of certain assets, such as limited edition collectibles or rare digital artworks.\n\nUse Cases for ERC-721 Tokens\n\nThe potential uses for ERC-721 tokens are virtually limitless, with applications across a wide range of industries. Some of the most popular and innovative use cases for ERC-721 tokens include gaming, collectibles, real estate, ticketing, and even identity verification.\n\nIn the gaming industry, ERC-721 tokens have revolutionized the way we think about in-game assets. Instead of simply buying or earning in-game items, players can now truly own and trade unique assets that are verifiable and secure on the blockchain. This has opened up new opportunities for gaming companies to create rare and valuable in-game items, while also providing a more engaging and immersive experience for players.\n\nCollectibles are another popular use case for ERC-721 tokens. Whether it’s rare digital artwork, limited edition sports cards, or even virtual pets, ERC-721 tokens provide a secure and transparent way for collectors to own and trade unique assets. This has led to the emergence of new marketplaces for digital collectibles, such as OpenSea and Rarible, that are powered by the ERC-721 standard.\n\nIn the realm of real estate, ERC-721 tokens can represent unique properties or plots of land in a decentralized world. This has the potential to revolutionize the way we think about property ownership and management, with the possibility of creating new marketplaces for virtual real estate that are powered by blockchain technology.\n\nTicketing is another industry that stands to benefit from the use of ERC-721 tokens. By issuing tickets as ERC-721 tokens, event organizers can prevent fraud and scalping, while also providing a more streamlined and secure process for attendees. This has the potential to reduce costs and increase efficiency for event organizers, while also creating a better experience for attendees.\n\nWe can use ERC-721 tokens to revolutionize the way we think about online identity verification, with each token representing a unique digital identity. This has the potential to revolutionize the way we think about online identity and security, with the possibility of creating new decentralized identity systems that are verifiable and secure on the blockchain.\n\nFinal thoughts\n\nERC-721 is a remarkable standard on the Ethereum blockchain that has changed our idea of digital assets and ownership. Its non-fungibility and flexibility have opened up new opportunities for creating and exchanging unique digital assets, paving the way for a more decentralized and fair future. The potential applications of ERC-721 tokens are vast and varied, spanning industries from gaming and collectibles to real estate and ticketing."
    }
]