[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY3J5cHRvLm5ld3MvZXRoZXJldW0tY28tZm91bmRlci12aXRhbGlrLWJ1dGVyaW4tZXhpdHMtbWFrZXJkYW8tcG9zaXRpb24v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 03 Sep 2023 07:00:00 GMT",
        "title": "Ethereum co-founder Vitalik Buterin exits MakerDAO position - crypto.news",
        "content": "Vitalik Buterin, the co-founder of the Ethereum (ETH) network, has sold his remaining stake of MakerDAO tokens.\n\nOnchain data from Etherscan, shared by Lookonchain, shows that Buterin sold 500 MKR tokens, which he had held for the last two years.\n\nThe sale, made through CoW Protocol, netted Buterin a total of 353 ETH, which is approximately $580,000 at current rates.\n\nButerin initially invested in MakerDAO in April 2018, purchasing 1071 MKR tokens at $905 each. His recent sale implies a gain of about 27%. The Ethereum co-founder’s last interaction with his MKR tokens was in April 2021, when he donated 100 tokens to India’s Covid relief fund.\n\nHis action follows a Sept. 1 blog entry by Rune Christensen, MakerDAO’s co-founder and CEO. In the post, Christensen detailed ambitious plans for a new iteration of the project on a different blockchain, tentatively named NewChain.\n\nThe last phase of Endgame is the launch of a native blockchain for Maker with the codename NewChain\n\n\n\nIt will make the ecosystem more secure and efficient\n\n\n\nAfter some research, I believe the Solana codebase should be considered as the basis for NewChainhttps://t.co/KyGxBBGlVH — Rune (@RuneKek) September 1, 2023\n\nYou might also like: Vitalik Buterin throws shade at XRP centralization\n\nMakerDAO may move to Solana\n\nAccording to the MakerDAO frontman, the proposed blockchain could potentially be a fork of Solana (SOL), which is a significant development, especially considering MakerDAO’s current roots in Ethereum.\n\nIn the blog, Christensen explained that his choice to potentially explore Solana is driven by three key reasons. He cited the technical quality and enhancement of the Solana codebase, the ability to outlast hardships displayed by Solana following the collapse of FTX, and the success stories of previous Solana forks, such as the Pyth Network, which runs an adapted version of Solana as its backend.\n\nChristensen envisions a future where NewChain serves as a secure conduit between Ethereum and Solana. However, he did not limit his options to Solana. He also name-dropped Aptos, Sui, and Cosmos as alternatives.\n\nThe main benefits of Cosmos were its “large and high quality” pool of talent, as well as its wide range of independent developers, Christensen said.\n\nRead more: Solana Pay partners with Shopify to enable USDC payments\n\nFollow Us on Google News"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZGVmaS9uby12aXRhbGlrLW5vLXByb2JsZW0td2hhbGUtc2VsbHMtZXRoZXJldW0tZm9yLW1ha2VyL9IBW2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZGVmaS9uby12aXRhbGlrLW5vLXByb2JsZW0td2hhbGUtc2VsbHMtZXRoZXJldW0tZm9yLW1ha2VyL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "No Vitalik, No Problem: Whale Sells Ethereum (ETH) For Maker (MKR) - NewsBTC",
        "content": "Less than a week after Vitalik Buterin, one of the co-founders of Ethereum, sold his Maker (MKR) stash for ETH, one crypto whale has done the opposite. On-chain data on September 4 shows that one Ethereum holder sold 694 ETH, worth roughly $1.13 million when writing, for 1,010 MKR. At the time of the swap, MKR was changing hands at $1,122.\n\nWhale Swaps ETH For MKR\n\nAs of September 4, the address, “0x3737,” had over $20.37 million worth of assets. While the whale trades against Vitalik and doubles down on MKR, zooming in on the address’s portfolio shows that the largest holding is ETH.\n\nThe address holds 10,000 ETH worth $16.3 million at spot rates, representing over 75% of the total portfolio. Meanwhile, some of his other major holdings include Arbitrum (ARB), worth $2.9 million, and MKR, worth $1.1 million.\n\nMKR, the token issued by MakerDAO, the decentralized autonomous organization (DAO) that controls the minting of DAI, a stablecoin on Ethereum, has been ripping higher in the last few months.\n\nMKR plays a key role in stabilizing DAO and is used as a last resort. Holders participate in governance, voting on proposals that best stabilize the algorithmic stablecoin, deciding collateral types accepted, stability fee adjustments, and others.\n\nFrom June, MKR has more than doubled, rising 125% to peak at around $1,300 in early August. It is now trading at over $1,100, up 13% from August lows.\n\nMaker Presents Endgame\n\nThe token’s surge has been attributed to multiple factors, specifically the release of the “Endgame” roadmap. Under this plan, MakerDAO plans to, among other things, release their blockchain, rebrand, and introduce two more tokens.\n\nThis move is significant because MakerDAO is among the first decentralized finance (DeFi) protocols. According to DeFiLlama data, the protocol has a total value locked (TVL) of over $5 billion. It is the largest decentralized money market in the world.\n\nMeanwhile, DAI, its algorithmic yield-earning stablecoin, has been stable recently and is the largest in Ethereum. At press time, DAI had a market cap of $5.3 billion, perched at 12th on the leaderboard. At this pace, DAI is the third-largest stablecoin after USDT and USDC.\n\nVitalik Buterin, despite the stellar performance of MKR relative to the broader crypto market, liquidated $580,000 worth of MKR after MakerDAO’s co-founder, Rune Christensen, said it was considering launching a new blockchain bridging to Ethereum that’s based on Solana’s code. The new blockchain, dubbed NewChain, is part of MakerDAO’s roadmap, “Endgame”.\n\nFeature image from Canva, chart from TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtcHJpY2UtYW5hbHlzaXMtZm9yLXNlcHRlbWJlci0z0gE_aHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtLWV0aC1wcmljZS1hbmFseXNpcy1mb3Itc2VwdGVtYmVyLTM_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 03 Sep 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Analysis for September 3 - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nSellers maintain their pressure, according to CoinStats.\n\nAdvertisement\n\nTop coins by CoinStats\n\nETH/USD\n\nThe price of Ethereum (ETH) has almost not changed since yesterday.\n\nImage by TradingView\n\nOn the hourly chart, the price of Ethereum (ETH) has bounced off the local support level at $1,631. If buyers can hold the mark above it, the upward move may continue to the resistance around $1,640 tomorrow.\n\nImage by TradingView\n\nOn the daily time frame, the rate of ETH is trading sideways, which is confirmed by low volatility. The volume keeps falling, which means that neither side is ready for a sharp move.\n\nAll in all, consolidation in the area of $1,620-$1,660 is the more likely scenario for the next few days.\n\nImage by TradingView\n\nOn the bigger chart, traders should focus on the bar closure in terms of the nearest level at $1,571. If the candle closes near it, the drop can continue to the vital level of $1,500.\n\nEthereum is trading at $1,571 at press time."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3LmV0ZnN0cmVhbS5jb20vYXJ0aWNsZXMvd2lzZG9tdHJlZS1pbnRyb2R1Y2VzLXN0YWtpbmctdG8tZXRoZXJldW0tZXRw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "WisdomTree introduces staking to ethereum ETP - ETF Stream",
        "content": "WisdomTree has enabled staking on its ethereum exchange-traded product (ETP).\n\nThe $39m WisdomTree Physical Ethereum (ETHW) is physically-backed by ether and can now earn rewards by delegating its underlying to validate new transaction entries on the ethereum blockchain.\n\nAnnual staking yields on the ethereum blockchain currently range from 4-8%.\n\nETHW launched in 2021 and is listed on the Swiss Stock Exchange, Euronext Paris and Euronext Amsterdam with a total expense ratio (TER) of 0.95%.\n\nMirva Anttila, director of digital assets research at WisdomTree, said: “The shapella upgrade was a major advancement for the ethereum network, enabling the withdrawal of staked ether and related staking rewards, it also completed ethereum’s full transition to proof-of-stake.\n\n“There are many challenges in providing staking rewards to investors, however, these have been overcome and we are now able to deliver staking rewards to investors through a risk-managed approach.”\n\nThe addition of staking to ETHW marks the firm’s latest move in digital asset ETP exposures after it launched the WisdomTree Blockchain UCITS ETF (WBLK) last September.\n\nElsewhere, the firm has also been in active in the thematic space, launching the WisdomTree Renewable Energy UCITS ETF (WRNW) in June."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA5LzA0L2V0aGVyZXVtLWJ1eS10aGUtZGlwL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "Ethereum: Buy the Dip? - The Motley Fool",
        "content": "Almost exactly one year since it pulled off The Merge, Ethereum (ETH -1.20%) seems to be falling out of favor with crypto investors. After a fast start to the year, Ethereum is now down 10% over the past 30 days and more than 20% from its mid-April highs. Moreover, some investors are warning that Ethereum could have further to fall before it recovers to the $2,000 price level.\n\nFor investors thinking about \"buying the dip\" on Ethereum, there are two major points of concern to consider. Let's take a closer look.\n\nDrop in user activity and transaction volume\n\nFirst and most importantly, there has been a significant decline in transaction volume and overall activity taking place directly on the Ethereum blockchain. For example, transaction volume recently hit a nine-month low, while daily transaction fees recently hit an eight-month low. The growing consensus seems to be that users have lost interest in the Ethereum blockchain, and that they may be moving elsewhere.\n\nIf true, that could be worrisome, because it could mean a long-term decline in areas such as non-fungible tokens (NFTs), where Ethereum has historically been dominant. Using any type of valuation model, you would then need to downgrade Ethereum's future prospects, resulting in a lower long-term price target.\n\nHowever, there could be a plausible explanation for the drop-off in transaction activity: Users are simply choosing to execute their transactions on faster, cheaper Layer 2 blockchains that sit on top of the core Layer 1 Ethereum blockchain. As a result, all Ethereum-related activity is simply not being captured by traditional metrics.\n\nFor example, the buzziest blockchain of the summer was Base, the new blockchain project from Coinbase Global (COIN 1.38%). Well, Base just so happens to be a Layer 2 scaling solution for Ethereum. And there are several other Layer 2 blockchains that are performing well right now, suggesting the overall Ethereum ecosystem is still in good shape.\n\nSelling by insiders and whales\n\nThe other major factor to consider is the sudden turn in investor sentiment about Ethereum that started to take place around mid-April. At the time, Ethereum was trading around $2,140, and was up big for the year. But there has been a steady wave of selling by so-called Ethereum \"whales\" (those holding between 10 ETH and 10,000 ETH in their crypto wallets) over the past four months. Theoretically, these whales are the smart money in the crypto market. If they are selling, what do they know that we don't?\n\nPerhaps even more worrisome, Ethereum co-founder Vitalik Buterin could be among those who are selling off their Ethereum positions. After monitoring the multiple public wallets that Buterin uses, crypto tracking services have found that Buterin has transferred nearly $6 million in Ethereum to other crypto wallets over the past month. Some have interpreted this to be a red flag, similar to corporate insiders selling their shares when they know the price is headed down.\n\nBut, again, I think there's a plausible explanation here. The sell-off in mid-April also coincided with the Shapella tech upgrade, which made it possible for investors to remove their staked Ethereum for the first time. In March and April, there were numerous concerns that this could lead to selling pressure on Ethereum, as many early Ethereum backers locked in profits on their positions. That's probably what's happening now.\n\nAnd what about Buterin? I hardly think he's panicking about the price of Ethereum. Instead, a better explanation is that he's simply redistributing his funds among different crypto wallets in order to protect them from hackers and cyber criminals. This is standard practice in the crypto industry.\n\nIs the market overreacting?\n\nOverall, I think this could be a classic \"buy the dip\" opportunity for Ethereum. From my perspective, the crypto market seems to be overreacting to the downside, viewing each new piece of news as more proof that Ethereum has suddenly lost its mojo.\n\nBut guess what? Ethereum is still best-in-class in just about every business segment, including NFTs and decentralized finance (DeFi). It is still seeing a strong upswing in developer activity, and Buterin has already shared a long-term roadmap for Ethereum that contains even more upgrades, improvements, and performance tweaks. And while Bitcoin (BTC -1.05%) may be getting all the attention from institutional investors now due to the imminent launch of a spot Bitcoin exchange-traded fund, that doesn't mean that they have forgotten about Ethereum.\n\nAs a long-term investment play, then, Ethereum still makes a lot of sense. If you believe that the market is overreacting right now, buying the dip now could be a way to add to your Ethereum position at a lower price."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLXNvYXJzLWluLXVuaXF1ZS1hZGRyZXNzZXMtYWZ0ZXItc2VjLWhpbnRzLWF0LWV0aGVyLWV0Zi1hcHByb3ZhbC_SAWJodHRwczovL2NvaW5nYXBlLmNvbS9ldGhlcmV1bS1zb2Fycy1pbi11bmlxdWUtYWRkcmVzc2VzLWFmdGVyLXNlYy1oaW50cy1hdC1ldGhlci1ldGYtYXBwcm92YWwvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Up In Unique Addresses As SEC Hints Its ETF Approval - CoinGape",
        "content": "Ethereum’s network has witnessed an astonishing surge, with over 467,000 unique address interactions in a single day, marking the highest activity level since the frenzy of Exchange-Traded Funds (ETFs) announcements began back on June 16th, Santiment reported.\n\nETH Unique Addresses Rises After ETH ETF Filings\n\nThis surge in activity comes after the anticipation surrounding the potential approval of Ethereum ETFs by the U.S. Securities and Exchange Commission (SEC). ETFs, which show that cryptocurrencies are becoming widely accepted, have the potential to make it simpler for institutional and ordinary investors to purchase Ethereum (ETH) and other cryptocurrencies.\n\nadvertisement\n\nIncreased activity as a result of this extensive adoption frequently raises the asset’s worth. ETH is trading at $1,639.36, with a 0.36% increase in the last 24 hours.\n\nIn a recent SEC filing on August 24th, Ark Invest and 21Shares were listed as sub-advisors for a joint Ethereum ETF product. The filing highlighted that Ethereum’s future value hinges on its widespread adoption, emphasizing that any changes in this aspect could significantly impact its price.\n\nThe possibility that the SEC may approve the introduction of Ether ETFs as early as October has recently emerged, adding to the frenzy. A recent Bloomberg report further fuelled optimism, indicating that the SEC is leaning towards allowing the first exchange-traded funds based on Ether futures. This prospective action is viewed as a major triumph by numerous businesses who have long sought the chance to provide such products.\n\nNotably, nearly a dozen companies, including Volatility Shares Trust, Bitwise Ethereum Strategy ETF, Roundhill Ether Strategy ETF, VanEck’s Ethereum Strategy ETF, ProShares Short Ether Strategy ETF, and the Grayscale Ethereum Futures ETF, are all waiting for approval from the SEC. However, Bitwise has submitted a request to withdraw its ETF application for the Bitcoin and Ethereum Market Cap Strategy.\n\nAlso Read: Crypto Prices Today: Market Mostly Bullish With Pepe Coin, XLM And SNX Showing Gains\n\nGood Road Ahead For ETH\n\nThe surge in unique address interactions on the Ethereum network is not merely a statistical blip; it signifies a powerful indicator of heightened utility. In the realm of cryptocurrencies, the value of assets like Ethereum is intrinsically linked to their utility.\n\nThe cryptocurrency community anxiously anticipates a potential inflow of investors and more activity that could further lift the value of Ethereum and set the way for an exciting new chapter in the world of digital assets as the SEC’s decision on Ethereum ETFs approaches.\n\nAlso Read: Next Massive Shibarium Updates Teased by Top Developer"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9pbnRyb2R1Y2luZy1ndWlzZS1yZXZvbHV0aW9uaXppbmctY3J5cHRvLXRyYW5zYWN0aW9ucy0xODAwMDA2NzguaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "Introducing GUISE: Revolutionizing Crypto Transactions with Unmatched Privacy on the Ethereum Blockchain - Yahoo Finance",
        "content": "GUISE\n\nNEW YORK CITY, NY, Sept. 04, 2023 (GLOBE NEWSWIRE) -- Guiser.org proudly presents GUISE, a revolutionary cryptocurrency built on the Ethereum blockchain that redefines the way users engage with crypto exchanges. GUISE stands as an aggregator of various non-KYC crypto exchange providers, gaining recognition for its commitment to transactional privacy and security.\n\nThe Process:\n\nGUISE operates on a unique principle that prioritizes privacy above all else. The process involves a seamless sequence of steps that safeguard user privacy:\n\n1. Deposit: Users begin by depositing their chosen cryptocurrency on one exchange of their choice.\n\n\n\n\n\n2. Transfer: GUISE then facilitates the transfer of these funds to another exchange without compromising user identity or transaction details.\n\n\n\n\n\n3. Conversion: Finally, the cryptocurrency is converted back to the user's preferred currency on a different exchange, effectively breaking the link between the sending and receiving wallets.\n\n\n\n\n\nThe Primarily Function of GUISE:\n\n\n\n\n\nPrimarily, GUISE functions as a platform that aggregates the finest non-custodial exchanges, offering users an unmatched level of privacy in their crypto transactions. Here's how it works:\n\n\n\n\n\n1. User Swap Requests: GUISE receives User Swap Requests, ensuring that users' cryptocurrency transactions remain anonymous and secure.\n\n\n\n\n\n\n\n2. Non-Custodial Instant Exchanges: These User Swap Requests are directed to top-notch, non-custodial instant exchanges, ensuring speedy and secure transactions.\n\n\n\n\n\n\n\nUser-Centric Privacy:\n\nIt's crucial to emphasize that at no point does GUISE gain access to users' assets or sensitive information. GUISE remains uninvolved in user transactions, refraining from receiving user deposits or transferring user funds. Our commitment to user privacy is unwavering.\n\n\n\n\n\nBlockchain Revolution:\n\nGUISE is set to revolutionize the crypto landscape by providing a secure, private, and efficient platform for crypto transactions. As the world becomes increasingly aware of the importance of privacy and security in the digital age, GUISE stands as a beacon of trustworthiness and innovation.\n\nStory continues\n\nAbout Guiser:\n\nGuiser.org is a pioneering force in the cryptocurrency industry, dedicated to advancing the principles of privacy and security. With GUISE, we aim to empower users with a tool that protects their financial transactions in a world where privacy is paramount.\n\n\n\n\n\nTo learn more about GUISE and its groundbreaking features, visit official resources:\n\nWebsite: https://guiser.org\n\n\n\nTwitter: https://twitter.com/guiserapp\n\n\n\nTelegram: https://t.me/guiserofficial\n\n\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, or intended as investment advice, financial advice, or trading advice. It is strongly recommended that you practice due diligence (including consultation with a professional financial advisor) before investing in or trading securities and cryptocurrency.\n\n\n\nCONTACT: Guy Guiser GUISE support at guiser.org\n\n\n\n"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOS8wNC93aGFsZS13aXRoLWEtaGlzdG9yeS1vZi1wcm9maXRhYmxlLXRyYWRlcy1nb2VzLWxvbmctb24tZXRoZXJldW0tYmFzZWQtY2FzaW5vLWNvaW4tb24tY2hhaW4tZGF0YS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "Whale With a History of Profitable Trades Goes Long on Ethereum-Based Casino Coin: On-Chain Data - The Daily Hodl",
        "content": "A deep-pocketed investor with a profitable trade history is once again taking a large long position on one casino-related digital asset, according to on-chain data.\n\nBlockchain tracking firm Lookonchain says the “smart money” whale once again loaded up on crypto gambling platform Rollbit’s native token RLB at the start of September, after several profitable trades in the last couple of weeks.\n\n“A SmartMoney who was good at buying RLB at lows and selling at highs in August spent 1.25 million USDC to buy 7.1 million RLB again at $0.175 in September.”\n\nAccording to the firm, the entity has so far made $358,000 in profits trading RLB.\n\nPast August trades include buying at $0.106 selling at $0.112, buying at $0.107 and selling at $0.145, and buying at $0.155 and selling at $0.172, according to Lookonchain.\n\nRollbit is trading for $0.17 at time of writing, up 5.2% in the last 24 hours.\n\nLookonchain also noticed a big purchase of Rocketpool (RPL), a liquid staking protocol that allows Ethereum holders to stake their coins without holding the 32 ETH normally required to become a validator.\n\nAfter the massive purchase, the price of RPL bounced by more than 9%.\n\n“Who pumps the price of RPL?\n\nWe noticed that a safe multisig wallet spent a total of 450 ETH ($735,000) to buy 32,820 RPL at $22.40 in the past eight hours.”\n\nRocket Pool is worth $24.09 at time of writing, up 13.1% in the last 24 hours.\n\nLastly, the firm highlights one whale making big moves, and profits, by withdrawing crypto assets off of the world’s largest exchange Binance, including more than 11,000 Maker (MKR).\n\nMaker is a decentralized finance (DeFi) protocol that uses smart contracts to power stablecoin-based loans.\n\n“A smart whale has withdrawn 11,231 MKR ($12.3 million) from Binance in the past four hours.\n\nSince August 23, the whale has withdrawn a large amount of UNFI (Unifi Protocol DAO), LPT (Livepeer), and TRB (Tellor Tributes) from Binance.\n\nAnd the profit has exceeded $4 million according to the current price.”\n\nMaker is trading for $1,116 at time of writing, down 0.6% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on Twitter, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZGFpbHljb2luLmNvbS93aGF0LWlzLW9wdGltaXNtLWNyeXB0by1ldGhlcmV1bS1wcmVtaWVyLWxheWVyLTIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 03 Sep 2023 07:00:00 GMT",
        "title": "What Is Optimism Crypto? - DailyCoin",
        "content": "What is Optimism? Is it an innate sense of positivity; a belief that everything will turn out for the best?\n\nTo ordinary people, yes. That’s exactly what it is. For crypto enthusiasts, on the other hand, Optimism is something quite different.\n\nOptimism is an Ethereum Layer-2 scaling solution that aims to make Vitalik Buterin’s blockchain faster, affordable, and ultimately more accessible. As the Ethereum blockchain has grown in popularity and usage, it’s become clear that the network’s sluggish speeds and extortionate gas fees are ill-equipped for crypto mass adoption.\n\nWhat is Optimism (OP), and how does it work? In a crowded niche, what separates Optimism from the dozens of other Layer-2 blockchains like Arbitrum (ARB) or Polygon zkEVM?\n\nWhat is Optimism (OP)?\n\nOptimism, known by its native token symbol OP, is one of the Ethereum network’s leading Layer-2 scaling solutions. It resolves the litany of issues plaguing the Ethereum blockchain, namely scalability and high transaction fees.\n\nThe Optimism project is spearheaded by the Optimism Foundation, a passionate team of developers and decentralization enthusiasts dedicated to improving Ethereum (ETH) and ensuring its long-term growth and sustainability. The foundation’s work has given birth to one of the most promising Layer-2 solutions, with Optimism going from strength to strength since its launch.\n\nHow Does Optimism Work?\n\nCreatively named, Optimism is what crypto people call an Optimistic Rollup. In simple terms, Optimistic rollups are a method of batching groups of Layer-2 blockchain transaction data into one ‘rolled up’ transaction that can then be secured on the Ethereum mainnet, a Layer-1.\n\nProcessing transactions off-chain significantly reduces the load on the main network, meaning that Layer-2 users can enjoy all of Ethereum’s functionality without suffering its low speeds and crippling gas fees.\n\nA sequencer handles optimism block production. The sequencer is responsible for instant transaction confirmations and blockchain state updates, constructing and executing Layer-2 blocks, and submitting user transactions to Layer-1.\n\nWhy are they called Optimistic rollups, you ask? When it comes to blockchain security, Optimism operates on the principle of ‘fault proofs.’ This means that node operators operate on the ‘optimistic’ approach that the state of the blockchain is correct, secure, and doesn’t require proof of validity. It is removed and replaced if this state is challenged and found faulty.\n\nAs is always the case among Layer-2s, Optimism runs an EVM (Ethereum Virtual Machine). This makes it easy for Ethereum developers to redeploy their favorite EVM-based dApps and smart contracts directly on Optimism and gives users a sense of familiarity with the network.\n\nThe Optimism Token\n\nAt the heart of Optimism is the OP token, the native cryptocurrency token of the network. OP is an ERC-20 token that plays a crucial role in the governance and future development of the Optimism network, serving as the requirement for OP community members to join and contribute to decision-making processes. It may come as a surprise, but OP is not used to pay Optimism gas fees.\n\nOne of the largest crypto airdrops to date, the OP token was distributed to hundreds of thousands of Optimism wallets. Those lucky qualifying addresses were people who’d positively contributed to Optimism’s growth, whether they were DAO voters, multi-sig signers, or simple users who interacted with Optimism dApps.\n\nOP’s first airdrop shared over 200M OP tokens and marked the birth of Optimism’s governance model, known as the Optimism Collective. This governing body collective comprises two separate houses: The Token House and the Citizens’ House.\n\nComprised of OP token holders, The Token House handles protocol governance. Through decentralized governance proposals, the Token House manages everything from protocol upgrades to inflation adjustments, treasury appropriations, rights protection, and governance fund grants.\n\nOn the other hand, the Citizens’ House is an experimental attempt at a non-plutocratic governance model, which aims to draw power and influence away from crypto whales. The Citizen’s House manages retroactive public goods funding, which rewards builders and developers who create products and services that grow the Optimism ecosystem.\n\nOptimism Ecosystem\n\nAs you’d expect from a top Layer-2 network, the Optimism ecosystem is a vibrant and dynamic space with an excellent variety of dApps. Thanks to roll-up technology, Optimism is paving the way for a new era of Ethereum-based applications that are faster, cheaper, and more efficient than what’s available on the mainnet.\n\nDeFi\n\nDecentralized Finance, or DeFi, is undoubtedly one of the most transformative applications of blockchain technology. Optimism’s EVM compatibility and low fees have made it the perfect playground for creative DeFi applications.\n\nClassic decentralized exchanges like Uniswap and Sushiswap have both moved in and set up camp on Optimism, but they’re outclassed in TVL (Total Value Locked) and trading volume by Velodrome, Optimism’s native DEX.\n\nOther DeFi platforms on Optimism can offer financial services like lending, borrowing, and yield farming through popular platforms like AAVE and Optimism’s dedicated lending market, Sonne Finance. Synthetix (SNX), another popular application on the network, supports derivatives and synthetic asset trading.\n\nNFTs\n\nWhile Optimism DeFi is a force to be reckoned with, NFTs on the network have struggled to stay relevant. What’s more interesting is that this trend is consistent across all Layer-2 networks, not just Optimism.\n\nEven though Layer-2 networks, whether they’re optimistic rollups or zk-rollups (zero-knowledge), make it cheaper and easier to trade and mint NFTs, NFT culture still resides largely on Layer-1 networks like Ethereum and Solana (SOL).\n\nDespite iconic NFT marketplaces like Opensea integrating support for Optimism, NFT trading volume is almost non-existent.\n\nA quick look at the top collections page on Quix, Optimism’s top NFT marketplace, shows that the last week of trading volume barely tips over 0.1 ETH. Opensea doesn’t fare much better, with the world’s most recognizable NFT platform tipping the scales at around two ETH per week.\n\nThe Optimism Superchain\n\nTo expand Ethereum’s capabilities further than we’ve ever thought possible, Optimism has set out to build a horizontally scalable network of blockchains called the Optimism Superchain. With the vision of growing a wider network of standardized, open-source Layer-2 networks, the Superchain tackles Ethereum’s scalability crisis from a new angle.\n\nThe central engine of the Superchain is the OP Stack, an open-source development toolkit that unifies all Superchain networks and ensures they’re all beating to the same rhythm. It guarantees that all networks are built using the same security features and communication systems to maintain a cohesive ecosystem.\n\nMoreover, the Superchain introduces a new revenue model that rewards developers with fees from their respective chains and applications. Optimism’s Superchain has proven a popular choice for large-scale businesses, including Worldcoin (WLD) and Coinbase’s Base Chain.\n\nOptimism vs. Arbitrum\n\nTwo names reign supreme in the fierce and competitive race to become the ultimate Ethereum scaling solution. At face value, there’s not a huge difference between Optimism and Arbitrum. Both networks are optimistic rollups that improve Ethereum’s scalability.\n\nUnderneath the hood, the main difference is how they handle fraud proofing. While Optimism uses single-round fraud proofs, Arbitrum takes this one step further with multi-round proofs. The result? Optimism is a faster network, but it runs the risk of having higher gas fees than Arbitrum during periods of Ethereum congestion.\n\nDiving into the on-chain metrics, Arbitrum is king in the eye of DeFi users. According to DeFiLlama, Arbitrum has more than double Optimism’s TVL (Total Value Locked) and almost 3x as many protocols built on the network. But if you’re an Optimism fan, don’t lose heart.\n\nRecent trends indicate a change in the guard. Over the past few months, daily transactions and active addresses on Arbitrum have steadily declined, while the same metrics on Optimism show sustained growth.\n\nOptimism Pros and Cons\n\nShould we be feeling optimistic or pessimistic about Optimism? Let’s dive into the pros and cons.\n\nPros\n\nScalability – Optimism offers greater transaction speeds and throughput than the Ethereum mainnet, making it better suited to supporting a large user base.\n\n– Optimism offers greater transaction speeds and throughput than the Ethereum mainnet, making it better suited to supporting a large user base. Optimism Superchain – The Optimism Superchain provides a new approach to Ethereum scaling by expanding horizontally and vertically.\n\n– The Optimism Superchain provides a new approach to Ethereum scaling by expanding horizontally and vertically. Affordability – Along with improved scalability, Optimism boasts lower gas fees, making it cheaper to use and lowering the barrier to entry.\n\n– Along with improved scalability, Optimism boasts lower gas fees, making it cheaper to use and lowering the barrier to entry. Compatibility – Courtesy of the EVM, Optimism is designed to be fully compatible with the Ethereum ecosystem’s existing smart contracts.\n\n– Courtesy of the EVM, Optimism is designed to be fully compatible with the Ethereum ecosystem’s existing smart contracts. Security – Like most Layer-2s, Optimism leverages the security of the Ethereum network, providing a level of security that matches the mainnet.\n\n– Like most Layer-2s, Optimism leverages the security of the Ethereum network, providing a level of security that matches the mainnet. Decentralization & Community – With the introduction of the OP token and the Optimism Collective governance model, Optimism is decentralized and community-driven.\n\nCons\n\nWithdrawal Delay – Transferring assets from Optimism to the Ethereum mainnet often involves a seven-day withdrawal delay. This could be inconvenient for users who need to move their assets quickly.\n\n– Transferring assets from Optimism to the Ethereum mainnet often involves a seven-day withdrawal delay. This could be inconvenient for users who need to move their assets quickly. Early Stage Development – While Optimism has shown much promise, it’s important to remember that it’s still in the early stages of development.\n\n– While Optimism has shown much promise, it’s important to remember that it’s still in the early stages of development. Competition – Optimism faces stiff competition from other Layer 2 solutions, such as Arbitrum and zkSync. The network’s success depends not only on its own merits but also on how it stacks up against its rivals.\n\nOn the Flipside\n\nOptimism is just one Layer-2 provider among a sea of competitors. Dozens of Layer-2 networks are joining the race, some with greater resources and more modern infrastructure. While Optimism was one of the first Layer-2s to hit the market, there is a chance its competitors will outperform it.\n\nWhy This Matters\n\nEthereum is undeniably the largest Layer-1 blockchain in the industry. However, its scalability concerns make it unusable for most of the global population. Optimism resolves these problems while retaining a focus on decentralization that Ethereum can be proud of.\n\nFAQs"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9tYXR0ZXItbGFicy1mb3VuZGVyLXByb3Bvc2VzLWV0aGVyZXVtLXN1cHJlbWUtY291cnQtb24tY2hhaW4tZGlzcHV0ZXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "Matter Labs co-founder proposes 'Ethereum Supreme Court' for on-chain disputes - Cointelegraph",
        "content": "Matter Labs co-founder and CEO Alex Gluchowski has proposed an Ethereum court system resembling a hierarchical court system similar to the real world.\n\nIn a Sept. 2 post on X (Twitter), Gluchowski floated the idea for an “Ethereum Supreme Court” — which would work similarly to the United States Supreme Court — serving as a final stop for parties to dispute smart contract issues rather than needing to take matters to a traditional lawyer or court.\n\n“The most important function of such a system will be to protect protocols against political inference from the outside. It will serve as a great deterrence mechanism, and will elevate the role of Ethereum as a powerful network state,” said Gluchowski.\n\nSmart contract implementation risks remain the biggest unsolved problem of Defi. L2s are equally affected.\n\n\n\nLet me pitch an idea: L1 Fork as the Court of Final Appeal.\n\n\n\nFirst, why existing solutions don't work:\n\n\n\n1) Time-locked upgrades are great for scheduled changes, but… pic.twitter.com/EcaogkZBH9 — Alex G. ∎ (@gluk64) September 2, 2023\n\nAccording to Gluchowski’s concept, disputes and emergency upgrades would be handled by a hierarchical system of on-chain courts. The final stop, however, would be an Ethereum layer-1 soft fork as the “Court of Final Appeal.”\n\nGluchowski said that in this system, every protocol would have its own governance with normal and emergency upgrade mechanisms, and would also designate a special contract which can trigger an appeal.\n\nWhen there is an emergency upgrade to a protocol, there would be an appeal period, during which any user can submit a challenge to the higher court. However, they’ll have to put up a pre-defined bail deposit.\n\nEach court specifies the higher court to appeal to, with the Ethereum Supreme Court serving as the final destination for challengers, Gluchowski said.\n\nLet's chat. The main idea of the post: no human-driven court should be able to say the last word. The final appeal must always be an L1 fork. — Alex G. ∎ (@gluk64) September 2, 2023\n\nAn example court heirachy would see protocols like Aave and Uniswap would contest matters in a court such as CourtUnchained or JusticeDAO. After those courts reach a decision, a party can appeal to the Ethereum Supreme Court.\n\nHowever, there would need to be a strong social consensus for the on-chain court system to work, Gluchowski acknowledged.\n\nHe added that it would be expensive so that only “truly extraordinary” cases will be brought before it.\n\n“[It will need to be] worthy of the attention of the entire Layer-0 (the social consensus) of Ethereum. Think of a bug in @Uniswap, a major L2, a Defi protocol with a systemic risk, etc.”\n\nRelated: On-chain tool to seize crypto is a purist’s nightmare but a must, says CEO\n\nGluchowski noted there were several existing solutions to such disputes already but argued that they aren’t effective.\n\nFor example, enabling time-locked features on smart contracts isn’t suitable in emergency situations and introducing a security council can mitigate the problem, but won’t solve it, while carrying its own risks.\n\n“A security council could only freeze the contract temporarily, requiring a token governance approval for an emergency upgrade. But now a malicious majority of undercollaterized stakers could perform an evil take-over upgrade and steal all the assets,” he explained.\n\nGluchowski said that he and the team at zkSync — an Ethereum layer 2 scaling solution created by Matter Labs — will happily fund research into the proposal.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: ‘Moral responsibility’ — Can blockchain really improve trust in AI?"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZGVjcnlwdC5jby8xNTQ4MDIvcnVuZS1jaHJpc3RlbnNlbi1tYWtlcmRhby1zb2xhbmEtZXRoZXJldW0tbmV3Y2hhaW7SAVJodHRwczovL2RlY3J5cHQuY28vMTU0ODAyL3J1bmUtY2hyaXN0ZW5zZW4tbWFrZXJkYW8tc29sYW5hLWV0aGVyZXVtLW5ld2NoYWluP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 03 Sep 2023 07:00:00 GMT",
        "title": "‘Ethereum Is Awesome', Says Solana Co-Founder Amid Planned MakerDAO Migration - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nMakerDAO’s controversial endgame inches closer.\n\nA multi-year Maker protocol overhaul, dubbed \"Endgame,\" is reaching its final phase, according to protocol co-founder Rune Christensen—setting the stage for the resurgence of a timeless rivalry.\n\n“The last phase of Endgame is the launch of a native blockchain for Maker with the codename NewChain,” tweeted Christensen late Friday.\n\nAD\n\nAD\n\nThe crux of the controversy lies in the tweet’s final words: “After some research, I believe the Solana codebase should be considered as the basis for NewChain.”\n\nOutlining three main reasons, Rune explained that it is due to the technical quality of the blockchain, as well as its resilience after the FTX blow up, and proven examples of Solana’s codebase being forked for other successful projects.\n\nIf his preference comes to pass, it would mean that MakerDAO—which up until now has lived on Ethereum—will essentially migrate to a long-time rival.\n\nChristensen’s endorsement of Solana sparked backlash on Crypto Twitter, with many users questioning the decision.\n\n“For your information,” said one user, “your user base primarily has more allegiance to Ethereum,” adding that Christensen “should probably give that more weight” than he is.\n\nAD\n\nAD\n\nEthereum and Solana communities have been at each other's necks for years, with the latter’s co-founder once appearing on CNBC to declare that “Ethereum is way too slow for peer-to-peer payments.”\n\nThings have changed in 2023, however.\n\nAnatoly ‘Toly’ Yakovenko, Solana’s co-founder, preemptively took to Twitter to stave off a possible attack from his own protocol's community.\n\nMaker considering @solana’s tech is a win for open source, and has nothing to do with solana’s mainnet or sol vs eth. I really hope that people in the @solana community don’t use this as some cudgel to attack ethereum. — toly 🇺🇸 (@aeyakovenko) September 3, 2023\n\n“Maker considering Solana’s tech is a win for open source,” he posted, adding that he “really hope[s] that people in the community don’t use this as some cudgel to attack Ethereum.”\n\nYakovenko then went a step further and tweeted “Ethereum is awesome,” and that a lot of Solana’s tech stack was inspired by Ethereum’s research and development. “Solana wasn’t built in a vacuum.”\n\nSolana’s co-founder pointed to proto-danksharding, an upcoming Ethereum upgrade that he considers “a good design for a settlement layer.”\n\nSome were quick to counter that he had \"gone soft” on Ethereum. Another wrote, \"The mere utterance of Solana next to Maker is fascinating in itself. Excited to see their next steps.\"\n\nAD\n\nAD\n\nToly’s views were echoed by Matias Barrios, security researcher for Kudelski Security and a Solana programs auditor, who said he is surprised by the reaction of the Solana community. He claimed that he had not “seen any mocking” of Ethereum.\n\nAs he told Decrypt, “Christensen’s backing is an important validation [for Solana] coming from one of the strongest projects in the ecosystem.”\n\nBarrios said he agrees with Yakovenko’s peace-keeping efforts, adding that “tribalism is the worst we can do in innovation,” and that “Ethereum and Solana are simply two different roads.”\n\nNot to be sidelined by the possible reignition of rivalry, MakerDAO’s Christensen also heeded Yakovenko’s words of warning.\n\n“Ethereum is great, Solana is great. Cosmos is great,” he posted on Saturday.\n\n“All chains are increasingly interconnected and synergize to form a global multi chain network economy,” he wrote, concluding that “Tribalist incels (of every flavor) are in the wrong decade—go back to Bitcoin and let the rest of us build.\""
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmFsdGNvaW5idXp6LmlvL2NyeXB0b2N1cnJlbmN5LW5ld3Mvd2h5LWlzLW1ha2VyZGFvLW1pZ3JhdGluZy1mcm9tLWV0aGVyZXVtLXRvLXNvbGFuYS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "Why is MakerDAO Migrating from Ethereum to Solana? - Altcoin Buzz",
        "content": "MakerDAO is going to roll out their NewChain. It’s part of their Endgame, a long-term strategic project. So, Rune Christensen, the MakerDAO CEO, considers Solana codebase as the foundation.\n\nThis can be massive news for Solana. Christensen only sees Cosmos as another option. So, what is this NewChain from MakerDAO? And why would they choose Solana? Let’s find out more.\n\nWhat Is the MakerDAO NewChain and Why Solana?\n\nNewChain is part of the MakerDAO upgrade. This upgrade takes place in five parts. This is the final part and is part of their ‘Endgame’. However, this final part may well take another three years to complete. It will see MakerDAO in a new and stand-alone blockchain.\n\nThe last phase of Endgame is the launch of a native blockchain for Maker with the codename NewChain It will make the ecosystem more secure and efficient After some research, I believe the Solana codebase should be considered as the basis for NewChainhttps://t.co/KyGxBBGlVH — Rune (@RuneKek) September 1, 2023\n\nThis should become a fork on the Solana codebase. Christensen mentioned that he investigates a variety of chains. This included, for instance, Sui and Aptos. However, he didn’t find them compatible compared to what Solana and Cosmos have to offer.\n\nCurrently, Solana seems to have the best cards. Christensen gave three reasons why he picked Solana.\n\nTechnical quality – ‘ it is highly optimized for operating a singular, efficient blockchain ‘. Resilient ecosystem – Solana managed to deal with the FTX debacle. There’s still a thriving developer community. The Solana codebase proved itself – ‘ It has already forked. It also adapted to act as appchains ‘.\n\nChristensen sees these as the main reasons. That’s why he wants to explore Solana as the most promising codebase. He aims to build a symbiotic relationship with Solana’s current ecosystem.\n\nMore About MakerDAO’s Decision\n\nThis is a break with MakerDAO’s current ties with Ethereum and the EVM. Christensen sees the Solana backend as more in line with what NewChain needs. However, he still recognizes that EVM is crucial for user-facing applications.\n\nCosmos is another consideration. However, this doesn’t have a centralized foundation. At its core, it does not prioritize efficiency. This can result in higher maintenance expenses. On the back of this news, Vitalik Buterin sold off $500,000 worth of MKR tokens. It’s not clear if this news relates to each other.\n\nSource: MakerDAO Forum\n\nConclusion\n\nIn a rather surprising move, MakerDAO seems to be looking for a Solana fork for their NewChain. Co-founder Rune Christensen gave three compelling reasons why he picked Solana. Building the new chain may take another three years, though. It’s a significant break with Maker’s current Ethereum and EVM ties.\n\n– For more cryptocurrency news, check out the Altcoin Buzz YouTube channel.\n\n– Unlock the key to managing your crypto portfolio like a PRO! Our top analysts bring you exclusive insights and the latest updates on cryptocurrency trading. Join Altcoin Buzz Alpha on Youtube or Patreon for just $15/month!\n\nDisclaimer\n\nThe information discussed by Altcoin Buzz is not financial advice. This is for educational, entertainment and informational purposes only. Any information or strategies are thoughts and opinions relevant to accepted levels of risk tolerance of the writer/reviewers, and their risk tolerance may be different from yours.\n\nWe are not responsible for any losses that you may incur as a result of any investments directly or indirectly related to the information provided. Bitcoin and other cryptocurrencies are high-risk investments, so please do your due diligence.\n\nCopyright Altcoin Buzz Pte Ltd."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtcGFpbnRzLWhpZGRlbi1wcmljZS1zaWduYWzSATtodHRwczovL3UudG9kYXkvZXRoZXJldW0tZXRoLXBhaW50cy1oaWRkZW4tcHJpY2Utc2lnbmFsP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Paints Hidden Price Signal - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nEthereum's price has been doing this intriguing dance lately, and if you are not paying close attention, you might just miss the beat. The spotlight here is on a less-talked-about but potent indicator: the RSI divergence. Now, RSI or relative strength index tells you how fast or slow the price is moving. And right now, it is whispering something worth listening to.\n\nSo, let's get into the nitty-gritty. Ethereum is currently priced at around $1,631.95. Not too shabby, but here's where it gets interesting. The RSI is climbing up the ladder, while Ethereum's price is taking the elevator down. It's like they are at a crossroads, waving at each other from opposite directions. This divergence is a classic reversal pattern. If this plays out, Ethereum could be making a U-turn toward its next resistance level.\n\nBut investors should not get carried away. The RSI divergence is a strong hint, but it is not set in stone. So, while the RSI is giving us a hopeful wink, it is wise to keep both feet on the ground.\n\nXRP takes another chance\n\nJust when you think it's down for the count, XRP surprises you. Despite the recent plunge below the 200 EMA, XRP is showing signs of life. As of the latest data, it is trading at approximately $0.50, a modest but noteworthy uptick.\n\nNow, let's add some context. Remember the SEC v. Ripple case? XRP had a moment in the sun when the outcome swung in its favor. But fast-forward to today, and it's like that victory never happened. The asset has shed all its gains, painting a rather grim picture of both the market and itself. But here is the kicker: XRP is not throwing in the towel.\n\nThe current price level might not be headline-grabbing, but it is a start. It's like XRP is gathering its energy, eyeing the resistance level as if it is the final boss in a video game. And in a market that has been less than kind, even a small win counts.\n\nSo, what's the takeaway here? XRP is in a challenging spot, no doubt. But it is also showing the kind of resilience that you cannot ignore. It's like the asset is whispering, \"Hey, I'm still here, and I'm not going anywhere.\" Whether this is the beginning of a significant rally or just a brief respite is anyone's guess.\n\nShiba Inu's future invalidated\n\nShiba Inu (SHIB) is like that mysterious character in a thriller novel; just when you think you have figured it out, it throws a curveball. Case in point: the recent invalidation of its symmetrical triangle pattern. For those who have been tracking SHIB, this pattern was a road map, a guide to where the asset might head next. But now, it's like someone just ripped that page out of the book. As of the latest data, SHIB is trading at approximately $0.00000779.\n\nBut let's not get lost in the maze. The invalidation of the pattern is not the end of the story; it is more like a plot twist. While the price might seem stagnant, there is a pulse beneath the surface. The Shiba Inu network's burn rate has skyrocketed by 500%. That is not just a number; it is a heartbeat, a sign of growing network activity.\n\nNow, let's add another layer to this narrative. The crypto market is a fickle beast, swayed by everything from global events to investor sentiment. In such a volatile landscape, the invalidated pattern could either be a stumbling block or a stepping stone for SHIB. It's like the asset is at a crossroads, and it is anyone's guess which path it will take."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOS8wNC90aGlzLWV0aGVyZXVtLXJpdmFsLWlzLXRoZS1tb3N0LWxvdmVkLWFsdGNvaW4tYnktaW5zdGl0dXRpb25hbC1pbnZlc3RvcnMtdGhpcy15ZWFyLWFjY29yZGluZy10by1jb2luc2hhcmVzL9IBkAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOS8wNC90aGlzLWV0aGVyZXVtLXJpdmFsLWlzLXRoZS1tb3N0LWxvdmVkLWFsdGNvaW4tYnktaW5zdGl0dXRpb25hbC1pbnZlc3RvcnMtdGhpcy15ZWFyLWFjY29yZGluZy10by1jb2luc2hhcmVzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "This Ethereum Rival Is the ‘Most Loved Altcoin’ by Institutional Investors This Year, According to CoinShares - The Daily Hodl",
        "content": "Digital assets manager CoinShares says that one top Ethereum (ETH) rival is being cherished over all other altcoins this year.\n\nIn its latest Digital Asset Fund Flows Weekly Report, CoinShares finds that while the overall digital asset markets suffered minor outflows last week, Solana (SOL) saw minor inflows for the ninth consecutive week.\n\n“While Solana saw inflows for the 9th consecutive week totaling US$0.7m, the YTD (year-to-date) inflows of US$26m suggest it is the most loved altcoin amongst investors at present.”\n\nMeanwhile, the overall digital assets markets saw over $11 million in outflows, according to CoinShares.\n\n“Digital asset investment product flows cooled off, with relatively minor outflows totaling US$11.2. This run of negative sentiment over the last 7 weeks now totals US$342m. Year-to-date digital asset investment products remain in a net inflow position totaling US$165m, with the year so far beset with large gyrations of investor flows, very much driven by the hopes and concerns for regulation on digital assets.”\n\nBitcoin (BTC), Polygon (MATIC) and Ethereum investment products suffered $3.8 million, $8.6 million, and $3.2 million in outflows last week, respectively.\n\nHowever, despite the minor outflows, CoinShares says trading volumes are up.\n\n“Despite little activity on flows, trading volumes were much higher than average, totaling US$2.8bn for the week, 90% above the YTD average.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on Twitter, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Professional Bat/Tun_Thanakorn"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY29pbmdhcGUuY29tL3NvbGFuYS1mb3VuZGVyLWNhdXRpb25zLWFnYWluc3QtZGV0cmltZW50YWwtcml2YWxyeS13aXRoLWV0aGVyZXVtL9IBW2h0dHBzOi8vY29pbmdhcGUuY29tL3NvbGFuYS1mb3VuZGVyLWNhdXRpb25zLWFnYWluc3QtZGV0cmltZW50YWwtcml2YWxyeS13aXRoLWV0aGVyZXVtL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 03 Sep 2023 07:00:00 GMT",
        "title": "Solana Founder Cautions Against Rivalry With Ethereum - CoinGape",
        "content": "Solana (SOL) founder Anatoly Yakovenko has taken to the X social media platform, formerly known as Twitter to warn his community members against hurling hate statements and attacks on Ethereum (ETH). MakerDAO Co-founder and Chief Executive Officer Rune Christensen had to also take the same action.\n\nMakerDAO CEO on Solana Blockchain\n\nIt all started after Christensen announced plans to re-implement MakerDAO on a new blockchain identified as NewChain. According to the Decentralized Finance (DeFi) giant, this blockchain could be forked from the Solana (SOL) blockchain. In effect, this would mean that MakerDAO will be moving away from the Ethereum-based architecture which it currently utilizes.\n\nadvertisement\n\nExplaining further, the MakerDAO CEO claimed that the Solana codebase is the “most promising” to explore for NewChain due to its technical quality and optimization, resilience of the Solana ecosystem following the “FTX blowup,” and past examples of successful forks of the protocol, like the Pyth Network.\n\nIn response to this potential development, Yakovenko acknowledged that MakerDAO’s move is impressive, citing that it is a win for open source. At the same time, he warned that it should not be perceived as an endorsement of one blockchain over the other.\n\n“I really hope that people in the Solana community don’t use this as some cudgel to attack Ethereum,” Yakovenko said in a recent post. He even advocated for Ethereum noting that the protocol is “awesome.”\n\nEthereum is awesome. Solana wasn’t built in a vacuum, and tons and tons of things that make @solana special were built based on ethereum’s r&d. — toly 🇺🇸 (@aeyakovenko) September 3, 2023\n\nCrypto Leaders Advocate Collaborative Efforts\n\nUnlike the narrative that is being peddled by some community members, Christensen is confident that in the future, NewChain would serve as a bridge between Ethereum and Solana. He also shared that in the long run, this will provide “a useful boost to the network effect of the entire multichain economy.”\n\nHe went on to acknowledge Cosmos as a close alternative to the NewChain codebase.\n\nPaying close attention to Christensen’s tweet, one would see that he was clearly appreciating multiple blockchains including Ethereum, Solana and Cosmos.\n\n“All chains are increasingly interconnected and synergize to form a global multichain network economy.”\n\nHowever, enthusiastic community members seem to have taken him out of context and ultimately, it looks like crypto industry leaders are beginning to get more interested in collaborative technological advancements, rather than encourage rivalry."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiOmh0dHBzOi8vZGFpbHljb2luLmNvbS9hbmF0b2x5LXlha292ZW5rby1mb3VuZGVyLW9mLXNvbGFuYS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "Anatoly Yakovenko: The Solana Founder Behind the Ethereum Killer - DailyCoin",
        "content": "Anatoly Yakovenko, the co-founder of the Solana (SOL) network, could be considered your stereotypical ‘dude-programmer.’ Depending on who you talk to, ‘Toly’ is just as likely to be found catching waves off the coast of California than hunched over a desk, surfing the blockchain.\n\nBut make no mistake; cycling and surfing trips aren’t stolen afternoons of leisure for Anatoly Yakovenko. The Solana Labs co-founder credits these moments of distracted enjoyment with giving birth to his brightest and best ideas.\n\nWith a growing range of popular Solana dApps, the ecosystem is establishing itself as the most performant Layer One blockchain in the Web3 world. Let’s look at the software engineer who made it all possible.\n\nWho is Anatoly Yakovenko?\n\nWhile newcomers to the world of blockchain technology might recognize him better as an X shapeshifter who sports a different Solana NFT profile picture each week, Anatoly Yakovenko is more than just a name on a whitepaper.\n\nA Ukrainian computer engineer turned American entrepreneur, Solana Labs co-founder Anatoly Yakovenko is the mastermind behind the Solana blockchain and the Proof-of-History consensus mechanism. This unique approach to securing decentralized networks gives Solana its trademark transaction speeds and unmatched scalability.\n\nBut did a humble software engineer go from a small-time tech startup to sitting at the helm of the cryptocurrency’s leading Ethereum (ETH) Killer?\n\nEarly Life and Education\n\nBorn in what is now Ukraine in the late 1970s, Anatoly Yakovenko was a child of the Soviet era, a time when the mere thought of decentralized systems would’ve certainly ruffled a few feathers.\n\nYakovenko was a tech enthusiast from a tender age. He later moved to the United States, where he pursued his passion, completing a bachelor of computer science at the University of Illinois Urbana-Champaign. It might seem ridiculous now, but some professors advised against this line of study, given the unwinding collapse of the dot-com bubble.\n\nPre-Crypto Era\n\nBefore diving headfirst into the blockchain whirlpool, Anatoly Yakovenko was already dipping his toes in the tech industry. According to LinkedIn, he co-founded Alescere following his studies, a Voice over Internet Protocol (VoIP) service. The short-lived startup inspired a young Yakovenko hungry for building innovative technologies.\n\nYakovenko joined Qualcomm, a global leader in wireless tech innovation, to develop his skills faster and climb the tech world ranks. He began his Qualcomm tenure as a software engineer but quickly made a name for himself, eventually becoming the company’s Senior Staff Engineering Manager.\n\nWhile at Qualcomm, Yakovenko was deeply involved in hardcore engineering work, from operating systems to virtual and augmented reality products. But the blockchain bug had already bitten him. Around 2013, he became an early adopter of Bitcoin (BTC) and Ethereum, keeping a close eye on the burgeoning industry.\n\nThe Birth of Solana\n\nThe year was 2017, and Yakovenko had just left Qualcomm. He dabbled in a few other tech gigs, including stints at Mesosphere and Dropbox, but something was missing. The blockchain space was calling, and Yakovenko was captivated by its possibilities.\n\nAnatoly Yakovenko was fascinated by Bitcoin and Ethereum but couldn’t help pondering the limitations of existing blockchain technologies. While gas fees were less of an issue in 2017 than now, legacy networks were still excruciatingly slow.\n\nTo solve this lingering problem, the co-founder of Solana conceived the Proof-of-History consensus mechanism. This novel method of verifying blockchain transactions and data promises to optimize the scalability of decentralized networks, making blockchain technology a suitable platform for the masses.\n\nAlongside Raj Gokal and fellow Qualcomm alumni Greg Fitzgerald and Stephen Akridge, Yakovenko got to work and laid the necessary foundations for the world’s fastest blockchain and smart contract platform. All it needed now was a name, but the team didn’t need to look far for inspiration.\n\nTheir revolutionary network would be named after Solana Beach in California, where the team regularly surfed and worked through ideas together, away from the confines of their computer screens.\n\nYakovenko’s Stirring Defence of Solana\n\nDespite its meteoric rise, Solana has had its fair share of critics. Decentralization enthusiasts dragged The network through the mud, claiming that Solana’s predatory tokenomics, venture capitalist allocations, and expensive validator requirements would be a bloodbath for retail investors.\n\nAdding to Solana’s mounting woes during 2021-2022, the blockchain suffered several network outages. While this discredited a network supposedly designed for ‘high performance,’ it also showed that demand for the network and its rapidly growing DeFi and NFT ecosystems attracted huge numbers of users.\n\nThe straw that broke the camel’s back came in November 2022 during the collapse of the FTX cryptocurrency exchange. Sam Bankman-Fried was a strong advocate of Solana, and both FTX and Alameda Research still hold large amounts of SOL tokens.\n\nResponding to these criticisms, Yakovenko acknowledges some of these flaws. Speaking with Blockworks, he and Raj Gokal reflected that it was ‘a bittersweet thing’. While FTX’s unraveling caused significant damage to SOL’s price, it also freed the network from the influence of a large stakeholder.\n\nThe pair also reflected that every major network has had catastrophic moments like the Ethereum DAO Hack or Bitcoin’s Mt. Gox collapse. In an interview with Fortune, Yakovenko concluded that it felt ‘like ‘ripping the bandaid.’\n\nSince the collapse, Solana has enjoyed consistent growth in almost every metric. Yakovenko maintains Solana Breakpoint attendees are doubling yearly while on-chain transactions, validator nodes, and active wallet addresses continue to rise.\n\nWhat’s Next for Anatoly Yakovenko?\n\nWhile Solana continues to grow in market cap and ecosystem development, Anatoly Yakovenko is far from done. He’s actively involved in pushing the boundaries of what Solana can achieve.\n\nFiredancer, Solana’s next big infrastructure upgrade, is a new independent validator client expected to help Solana reach a maximum transaction throughput of 0.6-1.2 million TPS (Transactions per second).\n\nOn the Flipside\n\nThe crypto world loves cult icons like Vitalik Buterin, Charles Hoskinson, and Satoshi Nakamoto. It seems a shame to highlight Anytoly Yakavenko alone when celebrating Solana’s achievements since a collective of engineers and entrepreneurs co-founded Solana Labs.\n\nWhy This Matters\n\nThe Solana network is one of the largest and most popular Layer-1 blockchains and smart contract platforms in the cryptocurrency industry. With a vision of onboarding the masses through familiar products like Web3 smartphones, Solana is a leading contender to usurp Ethereum’s reign.\n\nFAQs"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOS8wMy9zb2xhbmEtc29sLXJlYWR5LXRvLW91dHBlcmZvcm0tZXRoZXJldW0tZXRoLWluLW5leHQtbWFya2V0LWV4cGFuc2lvbi1hY2NvcmRpbmctdG8tY2hyaXMtYnVybmlza2Uv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 03 Sep 2023 07:00:00 GMT",
        "title": "Solana (SOL) Ready to Outperform Ethereum (ETH) in Next Market Expansion, According to Chris Burniske - The Daily Hodl",
        "content": "A venture capitalist who correctly called the 2022 crypto bottom says that one Ethereum (ETH) rival appears primed to outperform the leading smart contract platform.\n\nChris Burniske, the founder of Placeholder Capital, tells his 263,000 followers on the social media platform X that Solana (SOL) looks poised to outperform the top altcoin during the next risk expansion in crypto markets.\n\nLooking at the SOL/ETH pair, Burniske points out that Solana has reclaimed the 0.01 ETH level already and may be on track to hit 0.02 ETH in the next impulse.\n\n“SOL: 0.01 ETH reclaimed first, 0.02 ETH on the next big risk expansion?”\n\nThe veteran crypto investor notes that his prediction is not a critique of Ethereum and that he’s bullish on both ETH and SOL simultaneously.\n\n“For those that will think this is an attack on ETH, think again. Very easy to hold and support both assets and networks – different risks, different visions, both net good. Been doing the same with Bitcoin and ETH for a long time, much to the chagrin of the once-powerful [Bitcoin maxis].”\n\nAccording to Burniske, Solana is showing signs of “coming to life from the ashes” due to its lower transaction fees and higher throughput.\n\n“Quiet product launches, upgraded functionality, lower fees, more throughput, no hype – all signs of a new product cycle coming to life from the ashes.”\n\nSolana has sharply decreased from its all-time high of $259.24 set in November 2021 to its current price of $19.45, a 92.5% devaluation.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOS8wNC9ldGhlcmV1bS1jcmVhdG9yLXZpdGFsaWstYnV0ZXJpbi1zZWxscy1hbGwtcmVtYWluaW5nLW1rci10b2tlbnMtYWZ0ZXItdHdvLXllYXJzLW9mLWluYWN0aXZpdHktb24tY2hhaW4tZGF0YS_SAZEBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDkvMDQvZXRoZXJldW0tY3JlYXRvci12aXRhbGlrLWJ1dGVyaW4tc2VsbHMtYWxsLXJlbWFpbmluZy1ta3ItdG9rZW5zLWFmdGVyLXR3by15ZWFycy1vZi1pbmFjdGl2aXR5LW9uLWNoYWluLWRhdGEvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Creator Vitalik Buterin Sells All Remaining MKR Tokens After Two Years of Inactivity: On-Chain Data - The Daily Hodl",
        "content": "Ethereum (ETH) co-founder Vitalik Buterin has sold off the rest of his Maker (MKR) tokens after not making any moves for two years, on-chain data shows.\n\nFirst spotted by blockchain tracking firm Lookonchain, Etherscan data shows Buterin’s Ethereum address trading 500 MKR for 353 ETH, worth about $580,000.\n\nThe trade came 861 days after Buterin’s last move, which was a 100 ETH donation to an Indian Covid Relief program.\n\nMKR is the governance token that supports the stablecoin DAI.\n\nButerin’s trade came just two days after Rune Christensen, the founder of MakerDAO and DAI, issued a statement proposing plans to build a new native chain for the Maker ecosystem on a Solana (SOL) fork.\n\nChristensen, who made the proposal as part of the “EndGame” for Maker, said that Solana offered high efficiency and resiliency with a history of being successfully forked.\n\nSaid Christensen,\n\n“The first reason is the technical quality of the Solana codebase, as it is highly optimized for the purpose of operating a singular, highly efficient blockchain, which is what NewChain requires. The Solana codebase is engineered well and benefits from being designed long after the bottlenecks and challenges of blockchains were already well understood, which fits nicely with the objective of NewChain itself in fixing the technical debt of Maker. Solana also already has two client implementations, which is crucial for resilience.\n\nThe second reason is that the Solana ecosystem has proven its resilience by having gone through the FTX blowup. Despite all of the issues and hardships, the project still has a thriving developer community. This means that it has a significant Lindy Effect and is likely to stick around long term and means that the costs for development and maintenance will be much lower and that there will always be a high-quality pool of talent available for Maker to access and contribute to.\n\nThe third reason is that there already exists examples of the Solana codebase being forked and adapted to act as appchains. Most notable is the Pyth project which runs its own adapted version of Solana to act as its backend.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtcG9wdWxhcml0eS1kcm9wcy10by1sYXRlLTIwMjAtbGV2ZWxzLWJhc2VkLW9uLXRoaXMtaW5kaWNhdG9y0gFdaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtLWV0aC1wb3B1bGFyaXR5LWRyb3BzLXRvLWxhdGUtMjAyMC1sZXZlbHMtYmFzZWQtb24tdGhpcy1pbmRpY2F0b3I_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Popularity Drops to Late 2020 Levels Based on This Indicator - U.Today",
        "content": "Advertisement\n\nAs volatility and price dynamics of major cryptocurrencies demonstrate pale performance, another important indicator, Google Trends' activity, reaches multiyear lows for a number of crypto-related search requests.\n\nSearches for Ethereum (ETH) dropped to November 2020 lows\n\nThe number of searches for the Ethereum (ETH) cryptocurrency tracked by the Google Trends instrument, plummeted to levels unseen since early November 2020. For the \"DeFi\" request, this indicator dropped below four-year lows, data shows.\n\nImage by Google Trends\n\nAs of the last seven days, the metric for \"Ethereum\" plunged to 8/100. The last time it was so low was in November 2020. This means that amid the hottest weeks of the crypto euphoria in 2021, internet users were searching for \"Ethereum\" 12x more often.\n\nFor \"DeFi,\" this indicator is sitting at 26/100, but it has not been so low since mid-July 2019.\n\nLocal low for \"Bitcoin\" search count was registered one month ago. For \"crypto\" and \"cryptocurrency\" requests, the indicators are also as low as they were in October 2020.\n\nGameFi-, NFT- and metaverse-related searches are also targeting multiyear lows.\n\nAs covered by U.Today previously, Glassnode analysts characterized sentiment on crypto markets as a \"stage of extreme apathy and exhaustion\" on Aug. 14, 2023.\n\nRipple searches decline as well, what about XRP?\n\nCryptocurrency bulls should brace themselves for even more pain ahead, analyst Miles Deutscher shared in his recent X announcement.\n\nMeanwhile, in the Ripple and XRP communities, the situation looks slightly different. For Ripple, the performance is even more dramatic. In Q1, 2023, Ripple-associated searches dropped to lows unseen since 2016 but then slightly recovered.\n\nHowever, XRP looks almost 3x as popular as it was year ago. In September 2022, the activity of searches dropped to 6/100, while today it is about 17/100.\n\nThe better performance of Ripple and XRP's searches can be attributed to the interim legal win of Ripple in its lawsuit against the SEC."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMivgFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtNC1zZXB0ZW1iZXItMjAyMy9hcnRpY2xlc2hvdy8xMDMzNDkxMzAuY21z0gHCAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZXMtdG9kYXktbGl2ZS1uZXdzLWJpdGNvaW4tZG9nZWNvaW4tZXRoZXJldW0tc2hpYmhhLWludS1jcnlwdG9jdXJyZW5jeS1sYXRlc3QtdXBkYXRlcy00LXNlcHRlbWJlci0yMDIzL2FtcF9hcnRpY2xlc2hvdy8xMDMzNDkxMzAuY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin falls below $26,000; Ethereum holds $1,600 level - The Economic Times",
        "content": "The crypto tokens were trading mixed in Monday's trade. Bitcoin, XRP , Cardano, and Solana were trading with gains, while Dogecoin , Polkadot, Litecoin , and Shiba Inu were trading with cuts.Meanwhile, the global cryptocurrency market cap was trading higher, around $1.05 trillion, rising 0.18% in the last 24 hours.The crypto market was range-bound over the weekend and continues to trade sideways. The crypto fear and greed index, too, remained steady over the weekend. The index is currently in the fear zone with a score of 40/100, said Parth Chaturvedi, Investments Lead at CoinSwitch Ventures.\"All major cryptos by market capitalization are trading marginally in the green. BTC and ETH continue to trade in a narrow range around their respective anchor levels of $26k and $1.6k. However, recent whale activity pertaining to BTC underlines optimism among investors,\" Parth said.The total volume in DeFi is currently $2.04 billion, 9.54% of the total crypto market 24-hour volume. The volume of all stablecoins is now $19.96 billion, which is 93.44% of the total crypto market 24-hour volumeThe market cap of Bitcoin, the world's largest cryptocurrency, was around $505 billion. Bitcoin's dominance is currently 48.36%, according to CoinMarketCap. Meanwhile, BTC volume stood at approximately $9.6 billion, rising 14.83% in the last 24 hours.Notably, both Bitcoin and Ether are trading below their 50-day moving averages, indicating a bearish trend, said the CoinDCX Research Team.BTC's exponential moving average (EMA) for 10-days and 200-days indicate strong Sell sentiment at 26226 and 27118, respectively. Similarly, the Simple Moving Average for 10-day and 200-day SMA indicates Sell at 26276 and 27580, respectively. Simple moving averages show strong Sell sentiments.The Ichimoku Base Line, valued at 27518, shows a Neutral sentiment for quite a long time, whereas the Hull Moving Average indicates a Buy signal at 25649. The Volume Weighted Moving Average at 26574 showed a Sell signal.The MACD Level (12, 26) at -644 indicates a Sell. The Stochastic RSI Fast (3, 3, 14, 14) is at 52 with a Neutral indicator, while the Williams Percent Range (14) at −78 signals Neutral.Quick Glance (Source: coinmarketcap.com , data as of 12.04 hours, IST on September 4, 2023)Bitcoin $25,969 0.20%Ethereum $1,638 0.02%Tether $0.9997 -0.02% BNB $215 0.16%XRP $0.5072 0.64%Cardano $0.257 0.30%Dogecoin $0.06326 -0.65%Solana $19.73 0.75%Polygon $0.5452 0.17%Litecoin $64.28 -0.46%Polkadot $4.27 -0.54%Tron $0.07706 0.29%Shiba Inu $0.000007734 -1.42%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3NvbGFuYS1jby1mb3VuZGVyLWJhY2tzLWV0aGVyZXVtLWFtaWQtbWFrZXJkYW8tZm9yay1jb25zaWRlcmF0aW9uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "Solana co-founder backs Ethereum amid MakerDAO fork consideration - CryptoSlate",
        "content": "Solana’s (SOL) co-founder, Anatoly Yakovenko, has cautioned the blockchain community against harboring resentment towards Ethereum (ETH) following recent praise from MakerDAO’s (MKR) CEO, Rune Christensen.\n\nMakerDAO is considering Solana\n\nIn a recent blog post, Christensen unveiled the MakerDAO Endgame plan’s final phase, revealing a comprehensive reimagining of the DeFi protocol on a novel forked version of Solana, which will be named NewChain.\n\nChristensen highlighted Solana’s technical prowess and optimization as factors that make it ideal for his platform’s blockchain network. Additionally, he noted that Solana has demonstrated impressive resilience despite the issues it faced due to FTX’s collapse, bolstering its position with a thriving developer community. This robust ecosystem reduces development and maintenance costs and guarantees a consistent pool of top-tier talent.\n\nChristensen further hinted that NewChain could serve as a vital bridge connecting Ethereum and Solana. He wrote:\n\n“Because we benefit from the core Solana ecosystem being resilient, it would be strategically beneficial to ensure there is a Two-Stage Gravity Bridge from NewChain to Solana alongside the bridge from NewChain to Ethereum.”\n\nYakovenko says Maker plan is a ‘win for open source’\n\nFollowing the revelation, some crypto community members interpreted Maker’s choice as a victory for Solana while simultaneously mocking Ethereum.\n\nHowever, Yakovenko urged caution, saying Maker’s consideration was a win for open-source technology and had “nothing to do with Solana’s mainnet or sol vs. eth.” He added:\n\n“Ethereum is awesome. Solana wasn’t built in a vacuum, and tons and tons of things that make Solana special were built based on Ethereum’s r&d.”\n\nButerin dumps all MKR tokens\n\nOn the other hand, Ethereum co-founder Vitalik Buterin sold all his MKR tokens for 353 ETH, around $581,000, through CoW protocol DEX, according to Arkham Intelligence’s dashboard.\n\nMany are pondering the underlying motive for the sale, with many speculating that this might be a retaliatory action. However, this seems unlikely, considering Buterin’s prior endorsements of the Solana network.\n\nNevertheless, the action has attracted attention from prominent figures in the crypto community, including Justin Sun, the founder of the Tron Network."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtZnJvbS1kZWF0aC10by1nb2xkZW4tY3Jvc3MtY2hhcnQtc2hvd3MtcG9zc2liaWxpdGllc9IBVWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtZnJvbS1kZWF0aC10by1nb2xkZW4tY3Jvc3MtY2hhcnQtc2hvd3MtcG9zc2liaWxpdGllcz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "Ethereum (ETH): From Death to Golden Cross, Chart Shows Possibilities - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum's recent journey through a death cross has left traders and investors with mixed feelings. Currently Ethereum is changing hands at approximately $1,634.86, a price point that has been scrutinized for its potential implications. But here's the twist: the death cross, despite its ominous name, is not necessarily the harbinger of doom it is often made out to be.\n\nAdvertisement\n\nThe death cross is often viewed as an ultimate bearish signal. It occurs when a short-term moving average crosses below a long-term moving average.\n\nYet, Ethereum's trading history suggests that both golden crosses (the opposite of death crosses) and death crosses can be misleading. They are not the be-all-end-all indicators many consider them to be. In fact, they often serve as mere blips in the grander scheme of market movements.\n\nNow, let's delve into the liquidity aspect. Ethereum, like many other cryptocurrencies, has been grappling with a lack of market traction. The volume and liquidity are not exactly painting a rosy picture. However, this is not a fundamental issue with Ethereum itself but rather a symptom of broader market conditions.\n\nOn the flip side, Ethereum has been showing signs of life in other areas. For instance, its Total Value Locked (TVL) has been on an upward trajectory, indicating that the network is far from stagnant. This suggests that the fundamentals are strong, even if the market indicators are currently less than ideal.\n\nSo, what's the takeaway here? Ethereum's recent death cross does not spell disaster. It is merely a chapter in a longer narrative that includes other factors like liquidity, volume and fundamental strength. While the market may be in a state of flux, Ethereum's underlying technology and adoption metrics are robust."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9ldGgtYnJva2UtY3J1Y2lhbC1zdXBwb3J0LWhlcmVzLXRoZS1uZXh0LXRhcmdldC1ldGhlcmV1bS1wcmljZS1hbmFseXNpcy_SAWVodHRwczovL2NyeXB0b3BvdGF0by5jb20vZXRoLWJyb2tlLWNydWNpYWwtc3VwcG9ydC1oZXJlcy10aGUtbmV4dC10YXJnZXQtZXRoZXJldW0tcHJpY2UtYW5hbHlzaXMvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 03 Sep 2023 07:00:00 GMT",
        "title": "ETH Broke Crucial Support, Here’s the Next Target (Ethereum Price Analysis) - CryptoPotato",
        "content": "Ethereum’s recent market performance has seen an unexpected and sharp rejection from the $1.8K resistance level, triggering a significant downward trend that broke down both the pivotal 100-day and 200-day moving averages. This development is a clear, bearish signal for Ethereum’s mid-term prospects.\n\nTechnical Analysis\n\nBy Shayan\n\nThe Daily Chart\n\nFollowing a notable drop from the critical $1.8K resistance zone, Ethereum’s price dipped below the critical 100-day and 200-day moving averages, roughly around the $1.8K mark. Yet, the price ultimately found support at a significant level of $1.6K, initiating a bounce.\n\nThis support zone holds precise significance as it’s also the 61.6% Fibonacci retracement level, corresponding to the recent impulsive upward move towards the $2.1K mark in early March.\n\nHowever, this initial rebound was followed by another impulsive downward movement, again touching the crucial support zone at $1.6K. While this price action does indicate a noticeable bearish sentiment in the market, it’s essential to recognize that the potential revival of support could set the stage for another possible bullish bounce.\n\nSuch a rebound could potentially shift the market into a consolidation phase. Contrarily, if the price drops below the $1.6K mark, the possibility of a bearish cascade becomes increasingly likely.\n\nThe 4-Hour Chart\n\nLooking at the 4-hour timeframe, it becomes evident that the downward trajectory was momentarily halted when Ethereum reached the substantial $1.6K support region. This indecision led to a brief consolidation phase marked by low volatility. However, the price experienced a sudden surge (the Grayscale pump), marked by the emergence of a substantial green candle.\n\nHowever, buying pressure weakened as the price ascended and approached the critical 61.8% Fibonacci retracement level, prompting a reversal. Consequently, the price embarked on another impulsive retracement, driving it back towards the $1.6K range. Furthermore, Ethereum has formed a bearish continuation flag pattern, and it is currently attempting to breach the lower boundary of this pattern.\n\nBecause the $1.6K threshold holds significant psychological importance, if sellers successfully push the price below this critical level, the market could potentially witness another quick and steep plummet toward lower price thresholds.\n\nOn-chain Analysis\n\nBy Shayan\n\nThe current Ethereum price action showcases a robust downtrend, a notable exit from the weeks of consolidation within a narrow price range. To gain deeper insights into the market sentiment, examining futures market metrics is essential.\n\nThis particular chart shows the 30-day moving average of the taker buy-sell ratio metric, a key indicator revealing the relative aggressiveness of buyers versus sellers in executing their orders. When this metric records values above 1, it signifies a bullish sentiment, whereas values below 1 indicate a bearish sentiment prevailing in the market.\n\nThe chart illustrates the downward trajectory of the taker buy-sell ratio over the past few months. It consistently fluctuates below the pivotal one mark, reaching a yearly low. This behavior underscores the dominant bearish sentiment among futures traders participating in Ethereum’s market.\n\nAs long as this prevailing trend remains unaltered, the probability of witnessing further bearish price movements remains high. For Ethereum’s price to initiate a new rally, it would necessitate a shift in behavior among futures traders, specifically characterized by a more aggressive buying stance. This shift would be noticeable when the metric rises above the critical 1 threshold."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1mb3VuZGVyLXZpdGFsaWstYnV0ZXJpbi1jbGVhcmx5LWtub3dzLXNvbWV0aGluZy13ZS1kb250LWhlcmVzLXdoedIBXmh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1mb3VuZGVyLXZpdGFsaWstYnV0ZXJpbi1jbGVhcmx5LWtub3dzLXNvbWV0aGluZy13ZS1kb250LWhlcmVzLXdoeT9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Founder Vitalik Buterin Clearly Knows Something We Don't: Here's Why - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nVitalik Buterin, the enigmatic cofounder of Ethereum, has been making some eyebrow-raising transactions lately. It is as if he is playing a high-stakes game of chess, moving pieces across the board, but his endgame remains unclear. Let's delve into the specifics.\n\nAdvertisement\n\nA Buterin-associated Ethereum address (0xD04d...8fd7) recently transferred around 999 ETH, roughly equivalent to $1.64 million, to another address (0x5567…31B1). This is not the first rendezvous between these two addresses. About 20 days ago, the same recipient address received approximately 1,701 ETH from Buterin's address and then funneled those funds into a Bitstamp deposit.\n\n#PeckShieldAlert Vitalik-related address (0xD04d...8fd7) recently transferred ~999 $ETH (equivalent to ~$1.64M) to address 0x5567…31B1 ~20 days ago, this address 0x5567 previously received ~1,701 $ETH from Vitalik-related address (0xD04d…8fd7) and subsequently moved these funds… pic.twitter.com/n7jrKotsXq — PeckShieldAlert (@PeckShieldAlert) September 4, 2023\n\nBut wait, there is more to this intricate web. Last year, the Buterin-related address in question received a staggering 70,000 ETH from another address labeled \"Vb 3.\" The deposits were split into two tranches: about 30,000 ETH on May 6, 2022, and another 40,000 ETH on Nov. 24, 2022. Since then, this address has been like a philanthropist, distributing 31,000 ETH across four different addresses, including a 300 ETH deposit to Bitstamp.\n\nSo, what is the narrative here? Why is Buterin moving these substantial sums? One theory could be portfolio diversification. It is as if Buterin is rearranging his financial furniture, perhaps to invest in other ventures or to cash out some of his holdings. Another angle could be strategic partnerships or funding rounds that are yet to be disclosed. It is as if he is planting seeds, but we do not yet know what kind of forest he is aiming to grow.\n\nHowever, these transactions also raise questions about market influence. When a figure as pivotal as Buterin makes such moves, it is like sending ripples across a still pond; the effects can be far-reaching. Is he aware of market trends that the average investor is not privy to? Or is this just routine financial housekeeping on a grand scale?"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8venljcnlwdG8uY29tL3JvYmluaG9vZC1lbWJyYWNlcy1iaXRjb2luLWFuZC1kb2dlY29pbi1mb3ItaXRzLXdhbGxldC1hcy1pdC1zZXQtc2lnaHRzLW91dHNpZGUtZXRoZXJldW1zLWVjb3N5c3RlbS_SAX1odHRwczovL3p5Y3J5cHRvLmNvbS9yb2Jpbmhvb2QtZW1icmFjZXMtYml0Y29pbi1hbmQtZG9nZWNvaW4tZm9yLWl0cy13YWxsZXQtYXMtaXQtc2V0LXNpZ2h0cy1vdXRzaWRlLWV0aGVyZXVtcy1lY29zeXN0ZW0vP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 03 Sep 2023 07:00:00 GMT",
        "title": "Robinhood Embraces Bitcoin And Dogecoin For Its Wallet As It Set Sights Outside Ethereum’s Ecosystem - ZyCrypto",
        "content": "Advertisement\n\nRobinhood Wallet has announced support for new virtual currencies nearly six months after its initial launch, offering users with a range of options.\n\nIn an Aug. 30 blog post, Robinhood confirmed support for Bitcoin (BTC) and Dogecoin (DOGE) for all classes of users. Going forward, users of the self-custody wallet can hold and send BTC and DOGE, with the firm hinting at support for more assets.\n\nApart from Bitcoin and Dogecoin, Robinhood users can interact with various networks, including Optimism, Polygon, Ethereum, and Arbitrum.\n\nFurthermore, Robinhood Wallet unveiled in-app Ethereum swaps for 200+ assets, open to only a select class of users. The company disclosed that the new swap feature is an attempt to introduce its customers to decentralized finance (DeFi) with network fees automatically deducted from token holdings.\n\n“With Robinhood Wallet, we stripped away many of the complexities of DeFi and the broader Web 3 ecosystem and reduced some of the challenges and barriers to entry for everyday people,” remarked Johann Kerbrat, head of Robinhood Crypto.\n\nAdvertisement\n\n“We’ve been really encouraged by the adoption so far and are excited to keep building for our customers around the world as we ship new features and expand support for new networks and tokens,” added Kerbrat.\n\nPrior to the introduction of the in-app swap feature, Robinhood Wallet users relied on ox API, a decentralized exchange aggregator, to make token swaps.\n\nBTC and DOGE are enjoying the highs of a price pump, with the largest digital currency trading well above the $27K mark after a correction scare early in the week. DOGE is up by 2% on the 7-day charts, while trading volumes have spiked by over $1 billion in the same window.\n\nRolling out features for its growing user base\n\nSince its launch, Robinhood says the Wallet has racked up hundreds of thousands of users in over 140 countries. In the six months of its existence, Robinhood has launched several features for the Wallet, including a Web3 browser to allow access to decentralized applications (DApps).\n\nEarly in the year, Robinhood Wallet announced that select users can make use of a new Connect Feature to purchase digital assets using a fiat onramp.\n\nWith an expanding rewards system, upgraded security systems, and support for new cryptocurrencies, the firm has expressed confidence in becoming an industry leader in the near future."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1mb3VuZGVyLXZpdGFsaWstYnV0ZXJpbi1tYWtlcy1teXN0ZXJ5LW1vdmUtd2l0aC1sYXJnZS1ldGgtdHJhbnNmZXLSAV9odHRwczovL3UudG9kYXkvZXRoZXJldW0tZm91bmRlci12aXRhbGlrLWJ1dGVyaW4tbWFrZXMtbXlzdGVyeS1tb3ZlLXdpdGgtbGFyZ2UtZXRoLXRyYW5zZmVyP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 03 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Founder Vitalik Buterin Makes Mystery Move With Large ETH Transfer - U.Today",
        "content": "Ethereum co-founder Vitalik Buterin has made some intriguing financial moves, according to blockchain monitoring platform Spot On Chain.\n\nAdvertisement\n\nThe famous Canadian programmer transferred 999 Ether ($1.63 million) between well-known Ethereum addresses 20 hours ago.\n\nThis transaction comes after a series of deposits and sales that have taken place over the past eight days, during which Buterin deposited 1,602 Ether ($2.68 million) to cryptocurrency exchange Bitstamp and converted 100 Ether into 173,000 USDC, a stablecoin pegged to the U.S. dollar.\n\nButerin's financial activity extends beyond Ethereum's native cryptocurrency. The data shows that he also liquidated 500 Maker (MKR) tokens, valued at around $580,000, for 353.4 Ether.\n\nThis marks the first time Buterin has sold Maker tokens in two years. After selling the MKR tokens, Buterin transferred all 350 Ether to another address. This string of transactions has led some to speculate on what Buterin might be planning.\n\nThe transactions come at a time when Ethereum is experiencing moderate price stability, trading at around $1,635 per Ether at the time of writing.\n\nSome community members view Buterin's moves as a regular activity given the size of his holdings. Still, others are keeping a cautious eye, pondering if this could be an indicator of future market moves.\n\nWithout specific information, it is difficult to determine the intention behind these moves. Whether these transactions are part of a larger investment strategy, a diversification effort, or simply routine financial management remains to be seen."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5uZXdzYnRjLmNvbS9wcmVzcy1yZWxlYXNlcy9jcnlwdG8tZXhwZXJ0LWhvdy10by1nZW5lcmF0ZS1wYXNzaXZlLWluY29tZS1pbi1jcnlwdG8td2l0aC1ldGhlcmV1bS1iaXRjb2luLXNwYXJrLWFuZC1zb2xhbmEv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 03 Sep 2023 07:00:00 GMT",
        "title": "Crypto Expert: How to Generate Passive Income in Crypto with Ethereum, Bitcoin Spark, and Solana - NewsBTC",
        "content": "With the advent of Cryptocurrencies like Ethereum, Bitcoin Spark, and Solana, there have been innovations in the space for generating passive income. We will explore how to mine Ethereum, examine the potential of Bitcoin Spark, and check the price prediction of Solana.\n\nGenerating Passive Income with Ethereum\n\nEthereum is one of the leading cryptocurrencies and also a platform for the creation of Decentralized apps and the automation of Smart contracts. One way to get passive income is through mining Ethereum.\n\nMining is a task that involves solving complex puzzles to validate transactions on the Ethereum blockchain. The reward for validating blocks in the Ethereum Blockchain is Ether (ETH), the native token of Ethereum. To start mining Ethereum, you will require specialized hardware known as mining rigs, which comprise potent graphics processing units (GPUs).\n\nBitcoin Spark (BTCS) and the Potential for Passive Income\n\nBTCS employs a “Proof of Process” method to ensure reward fairness. It’s similar to performing a particular type of transaction check. Bitcoin Spark has garnered attention for its unique approach to generating passive income. And here’s how you can generate passive income from Bitcoin Spark:\n\nYou can join the network by actively participating in the validation of transactions; you’ll gradually earn rewards.\n\nBitcoin Spark also distributes a portion of its earnings to network participants. Being an active network member will generate a passive income without requiring constant involvement.\n\nAs Bitcoin Spark expands and introduces more features, your chances of earning passive income increase.\n\nSolana Price Prediction and Staking\n\nSolana gained massive growth and popularity due to its transaction speed and low transaction fees. One way to generate passive income from Solana is through Staking.\n\nStaking involves holding a certain amount of Solana token, SOL, in a wallet to support the network’s operations. Stakes receive rewards in the form of additional SOL tokens.\n\nThe Solana price prediction has also piqued the interest of Investors and those looking to generate passive income in the crypto space. You should know that accurate price predictions are uncertain due to the market’s volatility. Solana is all set for future growth. Its massive collaboration and integration of decentralized apps make it a solid one.\n\nConclusion\n\nThe crypto market is highly volatile, and it is crucial to practice risk management and only invest what you can afford to lose. The crypto market offers passive income opportunities from Mining Ethereum, exploring Bitcoin Spark, to Staking Solana.\n\nUse these links to stay updated on Bitcoin Sparks’ uniqueness:\n\nWebsite: https://bitcoinspark.org/\n\nBuy BTCS: https://network.bitcoinspark.org/register\n\nDisclaimer: This is a paid release. The statements, views and opinions expressed in this column are solely those of the content provider and do not necessarily represent those of NewsBTC. NewsBTC does not guarantee the accuracy or timeliness of information available in such content. Do your research and invest at your own risk."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3LmZ1bmRzLWV1cm9wZS5jb20vd2lzZG9tdHJlZS1lbmFibGVzLXN0YWtpbmctZm9yLXNlY29uZC1ldGhlcmV1bS1ldHAv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "WisdomTree enables staking in Ethereum ETP - Funds Europe Magazine",
        "content": "WisdomTree has activated staking in its Ethereum exchange-traded product – WisdomTree Physical Ethereum (ETHW).\n\nStaking involves entrusting Ether – Ethereum’s native cryptocurrency – to a validator node, allowing for the validation of new transaction entries on the blockchain. This process not only secures the network but also enables investors to earn a staking reward, which is distributed by the network for supporting its functionality and validating transactions, said the asset manager.\n\nETHW – offering a total expense ratio of 0.95% – is listed on the German exchange trading platform Börse Xetra, the Swiss Stock Exchange SIX and Euronext exchanges in Paris and Amsterdam.\n\nAmong cryptocurrencies, Ethereum is second only to Bitcoin in market capitalisation, with annual percentage yield varying between 4% and 8%.\n\nETHW joined WisdomTree Physical Solana as WisdomTree’s second cryptocurrency product lineup to offer a staking reward.\n\nA “major advancement” has been the Shapella upgrade – the recent introduction of a set of rules that allows users to withdraw staked ether and related awards, highlighted Mirva Anttila, director of digital assets research, WisdomTree.\n\n“This completed Ethereum’s full transition to proof-of-stake. Challenges in providing staking rewards to investors have been overcome as we are now able to deliver staking rewards to investors through a risk-managed approach,” added Anttila.\n\nAccording to the asset manager, ETHW offers investors a way to gain exposure to ether’s price “without the necessity of directly owning the cryptocurrency, managing private access keys, or engaging with the blockchain or digital currency infrastructure in any manner.”\n\nAlexis Marinof, head of Europe, WisdomTree, added: “Staking has the potential to make investing in cryptocurrencies more attractive for investors. However, this should never be at the expense of security or risk management, and this is at the centre of our staking approach.”\n\n© 2023 funds europe"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtaW52ZXN0b3ItZXhwbGFpbnMtdGhyZWUtYmVuZWZpdHMtb2YtaW50ZXItbDItYnJpZGdlc9IBVWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtaW52ZXN0b3ItZXhwbGFpbnMtdGhyZWUtYmVuZWZpdHMtb2YtaW50ZXItbDItYnJpZGdlcz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Investor Explains Three Benefits of Inter-L2 Bridges - U.Today",
        "content": "Advertisement\n\nSeasoned Ethereum (ETH) enthusiast and investor Ryan Berckmans published a thread to stress the main opportunities unlocked by noncustodial bridge mechanisms between various second-layer solutions. They are resilient to unexpected hardforks and can be far more resource efficient.\n\nInter-L2 bridges are more reliable and cheaper than competitors from L1s, Ryan Berckmans says\n\nBridges between different Ethereum-based L2 scalers have already established themselves as less risky and more gas-optimized systems compared to cross-L1 bridges. In future, their supremacy is set to become even more obvious, Berckmans opined in his thread yesterday on X.\n\nInter-L2 bridges are already better than cross-L1 bridges and are guaranteed to continue improving vs. cross-L1, with no research risk.\n\n\n\nLet me try to explain why.\n\n\n\nIt's fair to say that today's L2s have heavy training wheels, including security councils and admin multisigs. Many… — Ryan Berckmans ryanb.eth🦇🔊 (@ryanberckmans) September 3, 2023\n\nFor instance, once the underlying L1 hard forks, both L2s on its top and their bridges are automatically migrated. Meanwhile, a bridge between two L1s need manual migration initiated. When a paternal L1 reorganizes, all of its L2s follow; there's no need for any additional action.\n\nAlso, systems of interconnected L2 protocols can be more gas efficient compared to bridges from previous generations thanks to the integration of zero-knowledge proofs (ZKPs):\n\nA third benefit is that inter-L2 bridges can have their messages bundled into the same aggregated verification that powers the L2s themselves. For example, bridging activity can be included in the same zk proof used to settle a zk L2's internal activity at no additional L1 gas cost.\n\nCross-L1 bridges can be considered immutable only if we assume that both start and target L1 blockchains will never undergo hardforks.\n\nBerckmans mentioned Hop Protocol, Across, Connext and Socket apps among the pioneering cross-L2 decentralized bridges.\n\nArbitrum strengthens its dominance in L2 scene with Stylus launched\n\nHowever, the teams of L2 bridges have a lot of work to do, Berckmans concluded. In future, they will be of paramount importance for the global value transfer system:\n\nIn short, inter-L2 bridges are guaranteed to be more reliable and cheaper than cross-L1 bridges. That's why the Ethereum Trade Network will be the primary vehicle for the multichain network economy.\n\nAs of today, 90% of Ethereum's L2s ecosystem is controlled by two blockchains, i.e., Arbitrum One (ARB) and Optimism (OP). As covered by U.Today previously, Arbitrum introduced Stylus, an instrument for programmers working in non-EVM languages.\n\nWith Stylus, developers can run smart contracts and tokens written in WASM languages (C, C++ and Rust) in EVM-compatible blockchains without limitations."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vdS50b2RheS9zb2xhbmEtZm91bmRlci1jYXV0aW9ucy1hZ2FpbnN0LWV0aGVyZXVtLWF0dGFja3PSAURodHRwczovL3UudG9kYXkvc29sYW5hLWZvdW5kZXItY2F1dGlvbnMtYWdhaW5zdC1ldGhlcmV1bS1hdHRhY2tzP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 03 Sep 2023 07:00:00 GMT",
        "title": "Solana Founder Cautions Against Ethereum Attacks - U.Today",
        "content": "Anatoly Yakovenko, the founder of Solana, and Rune Christensen, the founder of MakerDAO, have recently taken to X, formerly known as Twitter, to caution their respective communities against divisive behavior in what appears to be a rare display of unity among leaders in the often fractious cryptocurrency world.\n\nAdvertisement\n\nThis comes after Christensen's announcement that MakerDAO is considering using a fork of Solana's technology for its next development phase. \"I really hope that people in the Solana community don't use this as some cudgel to attack Ethereum,\" Yakovenko tweeted, acknowledging that MakerDAO's decision is a win for open source but should not be construed as an endorsement of one blockchain over another.\n\nAs reported by U.Today, Christensen named Solana's highly optimized codebase, resilient ecosystem with a thriving developer community and proven adaptability as key reasons for considering it as the foundation for their NewChain project, while also acknowledging Cosmos as a strong but less efficient alternative.\n\nChristensen's tweet echoed similar sentiments, praising multiple blockchain technologies like Ethereum, Solana and Cosmos. He emphasized that \"All chains are increasingly interconnected and synergize to form a global multichain network economy.\"\n\nAccording to Christensen, those clinging to tribalistic attitudes are \"in the wrong decade\" and should allow others to build on the foundations set by various blockchain technologies.\n\nThe tweets suggest a maturing stance among industry leaders, who appear more interested in shared technological progress than in fanning the flames of blockchain rivalry."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZGFpbHljb2luLmNvbS9idXRlcmluLWR1bXBzLW1ha2VyZGFvLXRva2Vucy1zbGFtbWluZy1zb2xhbmEtcGxhbi1hcy13ZWlyZC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "Buterin Dumps MakerDAO Tokens, Slamming Solana Plan as “Weird” - DailyCoin",
        "content": "Maker has revealed plans to move its backend to a new chain, likely based on Solana.\n\nEthereum co-founder Vitalik Buterin has expressed opposition to Maker’s new trajectory.\n\nDespite Buterin’s misgivings, the plan intends to make the Maker protocol more resilient.\n\nMaker appears to have fallen out of favor with Ethereum co-founder Vitalik Buterin. After MakerDAO CEO Rune Christensen outlined plans for a Solana-integrated future, the Ethereum co-founder dumped his MKR holdings and questioned the project’s direction.\n\nButerin Slams Christensen’s Plan\n\nIn a MakerDAO forum post on Friday, September 1, Christensen outlined his vision for Maker’s Endgame’s fifth and final stage. The long-term plan will see the backend of the Maker Protocol move to a new blockchain dubbed NewChain, with Christensen suggesting the Solana stack as the codebase, a significant shift from Maker’s Ethereum roots.\n\nThe Maker chief’s plan appears to have rubbed Ethereum’s Buterin the wrong way. After Christensen released the forum post, Buterin dumped the last of his MKR holdings, exchanging 500 MKR for 353 ETH (approximately $580k) on Saturday, September 2.\n\nMoreover, in a Discord message shared by Wu Blockchain on Sunday, September 3, Buterin bashed Maker’s planned trajectory as “weird.” Further, he appeared to champion Maker’s RAI over DAI due to minimized governance in light of Christensen’s new plans.\n\n\"If MakerDAO is torpedoing itself in weird directions Then it makes natural sense for RAI to move somewhat closer to that middle category IMO not all the way; I think there is value in maintaining some kind of norm of 'ETH is the collateral'\" Buterin argued.\n\nWith the Ethereum co-founder disavowing the Maker protocol, it becomes necessary to understand why Maker intends to move its backend to a separate chain and why Christensen has hailed Solana as a strong contender.\n\nThe Idea Behind NewChain\n\nAccording to Christensen, with NewChain, the Maker protocol is expected to become more resilient to governance attacks and technical failures using hard forks. At the same time, the move will also allow developers more freedom to rebuild Maker components to serve better the purposes they were designed.\n\nTo circumvent the complexities of building a blockchain from scratch, Maker intends to fork an existing Layer 1 chain, with Christensen tipping the Solana stack as “the most promising codebase.” The Maker co-founder cited three reasons for this choice: technical quality and optimization, the network’s resilience after the FTX collapse, and the success of existing Solana forks like the Pyth Network.\n\nAside from Solana, Christensen highlighted that Cosmos was a leading contender, touting the ecosystem’s large talent pool and multiple app chains. Nonetheless, he contended that Solana maintained the edge in efficiency, arguing that Cosmos chains required more capital to maintain.\n\nOn the Flipside\n\nChristensen’s plan remains in the proposal phase, and the Maker co-founder estimates that the project could take at least three years to finish.\n\nMaker’s front end will remain on Ethereum and Ethereum Layer 2 chains , connected to the backend through a bridge.\n\nVitalik Buterin’s stance does not appear to have impacted the price of MKR. At the time of writing, the asset is trading for about $1,120, representing a negligible 0.51% decline in the past 24 hours per CoinMarketCap data.\n\nWhy This Matters\n\nMaker is the second-largest protocol on the Ethereum blockchain by TVL, with $5.06 billion per Defi Llama data at the time of writing. Moves made by the protocol could have spillover effects on the leading blockchain.\n\nRead this to learn more about Maker’s recent strides:\n\nDeFi Pioneer MakerDAO (MKR) Enters Lending Market with New Spark Protocol\n\nFind out what expert analysts are saying about Bitcoin’s latest dip:\n\nDoes BTC’s Dip Below $26K Present a Buying Opportunity? Analysts Weigh In"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vZGVjcnlwdC5jby8xNTQ4MDQvbGlkby1sc2QtbGlxdWlkLXN0YWtpbmctZGVjZW50cmFsaXphdGlvbtIBSGh0dHBzOi8vZGVjcnlwdC5jby8xNTQ4MDQvbGlkby1sc2QtbGlxdWlkLXN0YWtpbmctZGVjZW50cmFsaXphdGlvbj9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 03 Sep 2023 07:00:00 GMT",
        "title": "Lido Dominance Prompts Warnings About Liquid Staking Derivatives - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nLiquid staking solution Lido Finance now accounts for about a third of all staked Ethereum (ETH), and that is making some community members worry. The increasing clout of Lido, they say, is undercutting the decentralized character of Ethereum as a whole.\n\n\"Lido may be the biggest attack on Ethereum's decentralization ('credible neutrality') in our entire history,\" said Evan Van Ness, an Ethereum developer, in a Twitter post on Friday.\n\nIn the last year, the amount of ETH staked has risen nearly 95% from just over $22 billion to about $41.6 billion, according to Dune Analytics. Of this amount, Lido accounts for 32.7% of all staked ETH on the market—nearly four times higher than the amount staked by runner-up Coinbase at 8.7%.\n\nAD\n\nAD\n\nLido may be the biggest attack on Ethereum's decentralization (\"credible neutrality\") in our entire history It's about to breach 33% Yet many are staying silent Why? pic.twitter.com/O7Y37FZrE0 — Evan Van Ness 🧉💸 (@evan_van_ness) September 1, 2023\n\nEthereum is designed as a platform for decentralized applications run on smart contracts, and it undergirds many of the ecosystems and tokens in the DeFi ecosystem. In this space, Lido is the leading decentralized platform for liquid staking ETH, allowing investors to stake ETH with the network’s validators and earn rewards. In exchange for doing so, they receive a token representation of their deposit called stETH.\n\nBut as it grows in size, critics caution that Lido and other liquid staking solutions could be amassing undue influence over Ethereum, and risk becoming overly centralized in how their decentralized autonomous organizations govern themselves. This could undercut what they characterize as the democratic ideal in the DeFi space, where users can use their tokens to vote on the direction of projects there.\n\nIndeed, some have posited that all liquid staking derivatives \"have inherent issues\" that, without well-designed controls, \"can ultimately destroy their product.\"\n\nEthereum investor Ryan Berckman also warned that Lido’s growing centralization could harm its acceptance reputation among corporations and governments, undercutting any hope of becoming a global settlement layer in the financial system.\n\nAD\n\nAD\n\nIn a Twitter post on Friday, Berckman said that Lido \"uniquely threatens\" Ethereum's reputation as a decentralized chain through its \"uncapped dominance\" and that this can also come at the cost of cutting ETH's long-term valuation. Berckman suggests that these goals would be knee-capped if this issue is left unaddressed.\n\n\"If this were to happen, it may affect the order of magnitude of our growth rate and, therefore, Ethereum's benefit to humanity and the number of zeroes on the long-term ETH valuation,\" wrote Berckman.\n\nLido has taken steps that aim to keep its DAO more democratic. In a July interview with Decrypt, LidoDAO’s business development contributor Marin Tvrdić said Lido is exploring a \"dual governance\" model that would allow holders of sETH veto power over governance proposals approved by holders of Lido's LDO governance token.\n\nThe current governance system for Lido is based on LDO, which means that only LDO holders can vote on proposals. Naturally, this gives LDO holders a degree of power over the protocol that stETH holders don’t have. This can have consequences if, for instance, LDO holders move to change something that could negatively impact liquid stakers.\n\nLido's DAO token is currently the 36th most traded token with a market capitalization of just over $1.35 billion, according to data from CoinGecko. In comparison, its sETH is the seventh most-widely traded token with a market cap of about $14 billion.\n\nEditor's note: this article was updated to properly identify Evan Van Ness."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L29ubHlmYW5zLWNlby1wdXRzLTIwbS1pbi1ldGhlcmV1bS1jb3VsZC10aGVzZS1hbHRjb2lucy1iZS1pdHMtbmV4dC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "OnlyFans' CEO Puts $20M in Ethereum; Could These Altcoins Be Its Next? - Analytics Insight",
        "content": "The world of crypto continues to attract attention from various industries, with Fenix, OnlyFans’ parent company, making the list. In a new development, Fenix announced a significant crypto holding—$20 million in Ethereum purchased between 2021 and 2022. This development has sent ripples through the market and shows the institutional attention digital assets are gaining. Amidst this, speculation has risen about the next altcoin to experience similar attention. In particular, Solana (SOL) and InQubeta (QUBE) have emerged as two altcoins to watch. This article will delve into the details of OnlyFans’ Ethereum investment and what makes Solana and InQubeta potential altcoins to be accumulated by this company. Continue reading to learn more.\n\nInQubeta (QUBE): The Next Altcoin to Experience Institutional Support\n\nInQubeta is another altcoin generating buzz in the crypto landscape despite being a new entrant. Its combination of two of the world’s most disruptive innovations, blockchain and AI, has earned it institutional and retail interest. As a result, there has been massive participation in its presale, with its fundraising event surpassing $2.5 million so far. This makes it one of the best cryptos to buy.\n\nInQubeta’s blend of AI and blockchain will see it become the world’s first blockchain-based crowdfunding platform for AI startups through cryptocurrency. This move seeks to reshape the fundraising scene within the AI industry, providing an alternative and seamless fundraising experience for startups.\n\nAt the heart of its ecosystem will be a custom-built NFT marketplace and its utility token, QUBE. AI-based startups can raise funds by minting investment opportunities as equity-based NFTs. These AI investment-backed NFTs will be fragmented into fractional NFTs, thereby allowing investors to hold stakes in promising AI ventures with as little as they can afford. This completely democratizes access to what’s arguably the most disruptive and profitable industry in the world, with investors set to earn immense profits.\n\nTo become an early investor in this trailblazing project, enthusiasts can participate in the ongoing presale. It is currently in presale stage three at a token price of $0.0112. Meanwhile, according to experts, the token is poised to skyrocket, with a forecast of a 25x increase before the end of 2023.\n\nA Growing Interest in Crypto: Ethereum (ETH) as a Case Study\n\nCryptocurrency has been finding its way into the mainstream, evident in recent accumulations from big players, with many yet to be known. In recent developments, OnlyFans, via its parent company, Fenix International, revealed the company’s adventure into cryptocurrency during its financial filing to the UK corporate registry. The company revealed that it invested almost $20 million in Ethereum between 2021 and 2022.\n\nThis development highlights the convergence of crypto with mainstream businesses, its growing adoption, and institutional attention. With crypto set to experience even more adoption as its potential becomes more prevalent, top altcoins like Ethereum, Solana, and InQubeta will likely experience significant accumulation and growth.\n\nSolana (SOL): A Top Altcoin\n\nSolana is an open-source project that leverages blockchain technology and its core values to provide DeFi (decentralized finance) solutions. The Solana protocol is designed to facilitate the creation of dApps (decentralized applications) and is widely known for its high throughput and low transaction costs.\n\nSolana is popularly known as Ethereum’s competitor. Hence, its growing popularity has raised questions about whether it could become the best cryptocurrency to invest in for investors seeking alternatives to Ethereum. Moreover, it is a top ten cryptocurrency, which makes it a viable investment opportunity.\n\nConclusion\n\nThe crypto landscape is evolving at a rapid pace, which the recent investment move by OnlyFan highlights. Amidst this, the spotlight has shifted to Solana and InQubeta after the substantial investment in Ethereum by OnlyFans. Their appeal has piqued the interest of institutions and retail investors alike, making them the best cryptos to buy now.\n\nVisit InQubeta Presale\n\nJoin The InQubeta Communities\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9ldGhlcmV1bS1ldGgtc2hpYmEtaW51LXNoaWItYW5kLWV2ZXJsb2RnZS1lbGRnLWVtZXJnZS1hcy10aGUtdGhyZWUtYnVsbGlzaC1jcnlwdG9jdXJyZW5jaWVzLXRvLWludmVzdC1pbi1ub3cv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "Ethereum (ETH), Shiba Inu (SHIB), and Everlodge (ELDG) emerge as the Three Bullish Cryptocurrencies to Invest in Now - Analytics Insight",
        "content": "After the decline of Bitcoin, which saw the popular cryptocurrency slump from $30,000 to $26,000 a few weeks ago, many cryptocurrencies have followed the bearish trends with a noticeable downtrend recorded. However, analysts are bullish on Ethereum (ETH), Shiba Inu (SHIB), and Everlodge (ELDG) and are adding them among the top cryptos to watch out for in Q4 of 2023. These three tokens are showing signs of bullish momentum. One of the tokens is seeing a huge inflow of investors based on its use case. Let’s see which token is that.\n\nSummary\n\nEthereum is predicted to reach $2000 before the end of 2023.\n\nShiba Inu sets for bullish trends.\n\nEverlodge tokens price is projected to rise to $0.035 by the end of the presale.\n\nJoin the Everlodge presale and win a luxury holiday to the Maldives\n\nEthereum (ETH) Remains Bullish Despite Market Inconsistencies\n\nWhile Bitcoin has pioneered the revolution of the financial system, Ethereum (ETH) goes one step further by serving as a network where developers can build a host of decentralized applications. Because of this excellent innovation, Ethereum has emerged as the go-to network for developers looking to build security-based applications.\n\nWith the recent victory of Grayscale over the SEC in a lawsuit allegation, ETH has pumped up in the last few days, crossing the $1700 threshold. Analysts are increasingly confident of the bullish performance of Ethereum and are backing it to reach the $2000 mark in the fourth quarter of 2023.\n\nThe technical analysis shows that ETH is experiencing an uptrend. Crypto prediction platforms are also predicting a bull run for the coin. Ambcrypto forecast the coin to trade at an average price of $2,244 before the end of the year. This makes ETH one of the top cryptos to watch out for in Q4 of 2023.\n\nShiba Inu (SHIB) Enjoys Bullish Trends After Overcoming the Bear Market\n\nNormalcy is returning to the crypto market after the recent downturn witnessed in the market. Many of the cryptos are currently showing bullish momentum. Having lost considerably to bear pressure in the last few months, Shiba Inu (SHIB) is back with bullish signals, with impressive price increases over the last few days.\n\nWhile it is too early to predict whether Shiba Inu is heading to the bull market, the present performance gives cause for optimism. The SHIB token has gained 2% in the last few days. Also, the green lines are very active in the market chart, which could be a signal of a bull run coming soon.\n\nWith the series of developments going on across the Shiba Inu ecosystem, the token is poised for a monumental surge. As a result, analysts like Javon Marks are predicting that SHIB potential surge may reach a new all-time high and a record-breaking SHIB price that would provide a big leap for investors. It is one of the tokens to watch out for in the last quarter of the year.\n\nEverlodge (ELDG) – Disrupting the Traditional Real Estate Industry\n\nAlthough Ethereum and Shiba Inu are experiencing an upsurge, they can’t catch up with the bullish momentum of Everlodge . Everlodge, the new platform that aims to open up the real estate industry to everyday people.\n\nTo invest in the real estate industry is usually costly, with investors expected to bring out huge amounts of money to be a real estate owner. Now, Everlodge is decentralizing the industry with the introduction of fractional ownership of real estate through property-backed NFTs. With just $100, investors can become fractional property owners of real estate on the blockchain.\n\nTo ensure the safety of investors’ funds, Everlodge has been deemed safe and secure by the audits conducted by InterFi Network and BlockAudit. The liquidity of the token will be locked for eight years, while the team token will be locked for two years.\n\nThe utility token of the Everlodge platform is sold for only $0.012. With its affiliation with real estate, crypto experts have projected the ELDG token price to reach $0.035 before the end of the presale.\n\nFind out more about the Everlodge (ELDG) Presale\n\nWebsite: https://www.everlodge.io/\n\nTelegram: https://t.me/everlodge\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDkvMDQvbWF0dGVyLWxhYnMtY28tZm91bmRlci1wcm9wb3Nlcy1ldGhlcmV1bS1zdXByZW1lLWNvdXJ0LWZvci1kZWZpL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "Matter Labs Co-founder Proposes Ethereum Supreme Court For DeFi - Crypto Times",
        "content": "Matter Labs co-founder, Alex Gluchowski has proposed an idea to implement onchain judiciary into the decentralized finance (DeFi) ecosystem.\n\nSmart contract implementation risks remain the biggest unsolved problem of Defi. L2s are equally affected.\n\n\n\nLet me pitch an idea: L1 Fork as the Court of Final Appeal.\n\n\n\nFirst, why existing solutions don't work:\n\n\n\n1) Time-locked upgrades are great for scheduled changes, but… pic.twitter.com/EcaogkZBH9 — Alex G. (∎, ∆) (@gluk64) September 2, 2023\n\nAlex Gluchowski is also the developer entity behind Ethereum layer 2 rollup zkSync. In his latest post, Alex addresses the issue of deploying risk-mitigating smart contracts for DeFi protocols and Layer 2 networks.\n\nThe DeFi developer identifies that existing solutions such as time-locked upgrades or converting applications into an alternative system is not an ideal solution while protocol is infected. Onchain security councils or governance are useful but it has certain limitations.\n\n“L1s don’t face the same problem because they are forkable. [ ]… This doesn’t work for L2s and Defi protocols, unfortunately, because we can’t fork underlying native assets bridged from L1 (such as ETH),” Alex said while describing the core of the problem.\n\nAs an ideal solution, Alex proposes an onchain judiciary between the DeFi ecosystem which will be similar to the real world judiciary system. It consists of higher courts and the Ethereum Supreme Court being at the top.\n\nIt is suggested that every protocol must have a smart contract for court appealing alongside governance controlled emergency upgrades. Whenever a protocol executes an emergency upgrade, anyone can appeal to the court to propose upgrade cancellation.\n\n“This court can then cancel the emergency upgrade (and do nothing else). Different courts will have different members, prices and reputation, in a completely decentralized manner,” said Alex.\n\nFurthermore, Alex explains that each court will have to specify to its higher court if the decision can be appealed until the final appeal reaches the Ethereum Supreme Court. The decision here is determined by the soft-fork of the network.\n\nTo prevent misuse of this novel idea, the developer said to form a social consensus around it while adding ‘canonical’ tags on courts to identify its authority.\n\n“The most important function of such a system will be to protect protocols against political inference from the outside.” Alex said, adding “It will serve as a great deterrence mechanism, and will elevate the role of Ethereum as a powerful network state.”"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3LnZlcmRpY3QuY28udWsvY29tbWVudC9ibG9ja2NoYWluLXBob25lcy1zb2xhbmEtc2FnYS12ZXJzdXMtZXRoZXJldW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "Two new blockchain phones aim to mobilize Web3 - Verdict",
        "content": "Plans for the Ethereum mobile OS and accompanying ethOS-based smartphone were both disclosed in a December 2021. Credit: DaLiu via Shutterstock.\n\nIn a tale of two fledgling blockchain phones, one, the Solana Saga, has slashed its selling price while the other, the Ethereum Phone, is preparing to begin shipping.\n\nBoth devices are generally aimed at fusing mobility with Web3, the third iteration of the internet that incorporates open-source software, blockchain transaction ledgers, decentralized governance, and native payments based on token-based economics.\n\nThe saga of the Saga\n\nSaga is a creation of Solana Labs, which created the Solana blockchain platform in 2020, and in June 2022 announced Solana Mobile as a subsidiary aimed at creating a Web3-focused smartphone, Saga, which debuted in the US market during April 2023.\n\nSaga is a flagship Android handset, created and built by development company OSOM, and is tightly integrated with the Solana blockchain in order to make cryptocurrency transactions and management of digital assets such as tokens and non-fungible tokens (NFTs) easily accessible via phone rather than computer, which is the more typical method. Saga represents an attempt to not only compete with established smartphone brands like Apple and Samsung but also to extend the influence of Solana, which competes with larger blockchains such as Ethereum. Both Solana and Ethereum also have their own cryptocurrencies – Solana (SOL) and ether (ETH), respectively.\n\nSolana Labs and its Solana blockchain platform are known primarily within the cryptocurrency community. Solana Mobile and the Saga phone have even less mass market name recognition. It seemed probable that Solana’s Saga would struggle to attract buyers, so it wasn’t a surprise that after launching at a cost of $1,000, Saga’s price was slashed to $599 in August 2023. Some Saga buyers who paid the original price only to see it slashed by 40% just four months after the phone’s debut have publicly expressed their displeasure, not exactly a good sign for a nascent product that needs to build goodwill.\n\nBlockchain and a Web3 ethOS\n\nSome observers attribute Saga’s price reduction to the impending arrival of new competition from a company based in Delaware (US), Freedom Factory. Like many blockchain and cryptocurrency projects, Freedom Factory is a community-led effort with global reach. Its small team developed both ethOS, a free, open-source native mobile operating (OS) system, and the new Ethereum Phone, also called ethOS.\n\nHow well do you really know your competitors? Access the most comprehensive Company Profiles on the market, powered by GlobalData. Save hours of research. Gain competitive edge. View profiles in store Company Profile – free sample Thank you! Your download email will arrive shortly Not ready to buy yet? Download a free sample We are confident about the unique quality of our Company Profiles. However, we want you to make the most beneficial decision for your business, so we offer a free sample that you can download by submitting the below form By GlobalData Submit Country * UK USA Afghanistan Åland Islands Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Democratic Republic of the Congo Cook Islands Costa Rica Côte d\"Ivoire Croatia Cuba Curaçao Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati North Korea South Korea Kuwait Kyrgyzstan Lao Latvia Lebanon Lesotho Liberia Libyan Arab Jamahiriya Liechtenstein Lithuania Luxembourg Macao Macedonia, The Former Yugoslav Republic of Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island Northern Mariana Islands Norway Oman Pakistan Palau Palestinian Territory Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Réunion Romania Russian Federation Rwanda Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Pierre and Miquelon Saint Vincent and The Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and The South Sandwich Islands Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Swaziland Sweden Switzerland Syrian Arab Republic Taiwan Tajikistan Tanzania Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates US Minor Outlying Islands Uruguay Uzbekistan Vanuatu Venezuela Vietnam British Virgin Islands US Virgin Islands Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Kosovo Industry * Academia & Education Aerospace, Defense & Security Agriculture Asset Management Automotive Banking & Payments Chemicals Construction Consumer Foodservice Government, trade bodies and NGOs Health & Fitness Hospitals & Healthcare HR, Staffing & Recruitment Insurance Investment Banking Legal Services Management Consulting Marketing & Advertising Media & Publishing Medical Devices Mining Oil & Gas Packaging Pharmaceuticals Power & Utilities Private Equity Real Estate Retail Sport Technology Telecom Transportation & Logistics Travel, Tourism & Hospitality Venture Capital Tick here to opt out of curated industry news, reports, and event updates from Verdict. I consent to GlobalData UK Limited collecting my details provided via this form in accordance with the privacy policy Submit and download\n\nPlans for the Ethereum mobile OS and accompanying ethOS-based smartphone were both disclosed in a December 2021 manifesto posted on Discord, which contended that Google’s Android and Apple’s iOS cannot serve Web3 needs due to their centralized platforms. Its backers assert that ethOS, designed to be decentralized and permissionless like the Ethereum blockchain, will foster novel economics and experiences through new apps, tokens based on ERC20 (the technical standard for fungible tokens created using the Ethereum blockchain), and NFTs.\n\nPeople can already load ethOS onto select unlocked Google Pixel 3, 3XL, or 5a smartphones, but the Ethereum Phone is designed to provide a turnkey option for side-loading ethOS onto a device. The Ethereum Phone is actually a flashed version of Google’s Pixel 7a using GrapheneOS 13, which is an Android fork with hardened security.\n\nPreorders for the first 50 Ethereum Phones began on August 22, 2023, and sold out in 24 hours. Particular NFTs worth 0.39 Ethers (ETH), or nearly $650, had to be minted to qualify for a preorder, which means the phone was selling at a premium, given that a regular Google Pixel 7A retails for $499 in the US. After preorders begin shipping, regular orders are slated to open in fall 2023.\n\nLooking ahead with blockchain\n\nThe promise of blockchain phones to fuse mobility and Web3 is captivating. Though it’s unclear whether there will ever be a substantial market for these niche devices, their Web3-oriented features and functionalities could migrate to smartphones that are marketed to a broader swath of the mass market."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vdGVjaGJ1aWxkLmFmcmljYS9oaWdobGlnaHRzLWV0aGVyZXVtLW5pZ2VyaWEtbWVldHVwLWxhZ29zL9IBQmh0dHBzOi8vdGVjaGJ1aWxkLmFmcmljYS9oaWdobGlnaHRzLWV0aGVyZXVtLW5pZ2VyaWEtbWVldHVwLWxhZ29zLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 03 Sep 2023 07:00:00 GMT",
        "title": "Highlights Of The Ethereum Nigeria Meetup In Lagos - Tech Build Africa",
        "content": "The Ethereum Nigeria community continued its Ethereum Road Show Workshop for the year 2023 across 4 cities as the journey kicked off in Abuja in mid-August with the theme, “Blockchain Security 101”.\n\nThe journey continued on Tuesday, August 29 at the NITDA IT Hub, University of Lagos, for ETH Lagos Workshop, where blockchain enthusiasts and experts gathered. The theme of the Lagos RoadShow Workshop was, “Layer2: Scaling Ethereum”.\n\nOpening the meetup, Enoch Mbaebie Ethereum Nigeria Lead, commented that Ethereum Nigeria will help to position Nigeria as a hub for blockchain and innovation in Africa.\n\n“Our key objectives include awareness and developers’ engagement, we come up with a series of boot camp and hackathon which comes with prizes that seek to unleash the potential in the blockchain ecosystem. We spun off the Filecoin conference in 2022, and we are poised to do the same with the Ethereum ecosystem as well.\n\nWe are into the innovation of products, and collaboration, and are open to advocacy and policy. The Ethereum Nigeria community also participated in the epic crossover from the proof-work to proof-of-stake network that happened globally.”\n\nAccording to Enoch, the Road Show continues in Anambra and Port Harcourt on the 17th and 23rd of September respectively.\n\nSpeaking on “Transition to Web3 Development”, Musa Mukhtar, a blockchain developer described the evolution from Web1 to Web2 through to Web3.\n\nAs explained by him, the Web3 phase provides decentralization which makes you own your data, unlike Web2 which is subjected to centralization.\n\nThe challenge of centralization according to him is the inability to own and control your data, thus having a high tendency to lose it, once any centralized system decides to shut down.\n\nAnother challenge is the unauthorized selling of users’ data by these centralized platforms.\n\nHowever, with Web3 this challenge is solved, giving ownership and control to users. And one of the ways of having control is the payment system that a decentralized web offers.\n\nAs explained by Musa, the Web3 payment system is powered by blockchain technology which is faster and safer compared to payment over the Web2 system. “Decentralization is the advantage of blockchain-powered payment system and that’s why it is secure”\n\nExplaining the Web3 development ecosystem, Musa noted that Web3 developers build applications on the blockchain system and it is required that they have frontend skills which involves them learning HTML, CSS and Javascript, in addition to acquiring knowledge about frameworks like React.\n\nMusa advised anyone going into Web3 development should start with the Ethereum blockchain using Solidity.\n\nIn all this, Musa reiterated the power of the community when building a blockchain product, according to him, the community is important as the product in the Web3 space.\n\nAlso speaking at the meetup, Oluwasegun Abisagbo, software engineer and founder of Passportmonie discussed,” Leveraging Layer 2 Scaling for Cross-Border Payments: Enhancing Efficiency and Accessibility”.\n\nIn his opening statements, he touched on the challenges and inefficiencies associated with traditional cross-border payment which include, high fees, slow processing times, limited accessibility and non-interoperability of African currencies.\n\nAccording to Oluwasegun, the layer 2 scaling will accelerate global payments as it will drive faster and more cost-effective transactions.\n\nAs explained by him, Passportmonie leverages layer 2 scaling solutions to enhance the cross-border payment experience for its users.\n\nLayer 2 scaling solutions represent a significant step forward in revolutionizing cross-border payments, enabling companies to offer efficient, low-cost, and accessible financial services to a global user base.\n\nOluwasegun noted the efforts of the Ethereum ecosystem to drive innovation in layer 2 scaling solutions.\n\n“We believe in partnerships and collaborations to make cross-border payments easy across Africa”, he concluded.\n\nAlso present at the meetup was Team Next Billion of the Ethereum Foundation. The team go around the globe scouting for enablers and blockers of Ethereum’s next billion users by seeking use cases, contexts, and communities that indicate how Ethereum might become a tool of and for the next billion.\n\nWhile discussing with Enoch, they expressed their excitement about the organization of the Lagos meetup and reiterated the Ethereum Foundation’s support for the Ethereum Nigeria community.\n\nDuring the course of the meetup, there was a breakout session that involved the participants being grouped into different clusters.\n\nAccording to Enoch, the purpose of the clusters is to create different teams that will start representing the Ethereum Nigeria developers community within and outside the country.\n\nEnoch tasked the cluster groups with coming up with creating innovative projects moving forward and assured them of full support from the global Ethereum network.\n\nDon’t miss important articles during the week. Subscribe to blockbuild weekly digest for updates."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LnRoZWNvaW5yZXB1YmxpYy5jb20vMjAyMy8wOS8wMy9ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLWV0aC1jcnlwdG8taW4tYW4taW50ZXJlc3RpbmctcGF0dGVybi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 03 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction: ETH Crypto in an Interesting Pattern - The Coin Republic",
        "content": "The Ethereum price prediction underscores the critical juncture at which ETH cryptocurrency currently finds itself, operating within a pivotal make-or-break scenario contained within an intriguing symmetrical triangle pattern. Ethereum has remained confined within this symmetrical triangle pattern, repeatedly attempting to break out but facing failure on multiple occasions. As of now, Ethereum’s price is navigating a crucial crossroads, approaching the lower trendline of the symmetrical triangle pattern on the daily time frame chart.\n\nThis presents a pivotal moment for Ethereum, as the decision it makes in this situation will likely dictate the direction of its future price movements. Traders and investors are keenly observing this pattern to determine whether Ethereum will break out of its constraints and embark on a significant price trajectory or continue to trade within the confines of the symmetrical triangle. The outcome of this make-or-break scenario will be instrumental in shaping Ethereum’s short-term and potentially long-term performance.\n\nEthereum price was at $1635.81 and lost 0.06% of its market capitalization during the day’s trading session. Trading volume has decreased by 53.48% during the intraday trading session. This demonstrates that sellers are trying for a pullback of ETH, the second largest cryptocurrency after Bitcoin. The volume to market cap ratio was 1.40%.\n\nAnalyzing Technical Indications For Ethereum Price\n\nSource: ETH/USD by TradingView\n\nEthereum price forecast shows the struggle of ETH crypto in breaking out from the symmetrical triangle pattern over the daily time frame chart. Meanwhile, Ethereum cryptocurrency needs to accumulate buyers in order to register its breakout. However, volume change can be seen below average and needs to grow during the day’s trading session. Nevertheless, ETH crypto has slipped below the 20, 50, 100, and 200-day daily moving average.\n\nIn order for ETH cryptocurrency to break out of its consolidation phase within the symmetrical triangle pattern and reach a recovery level of $1820, it needs to attract potential buyers. Notably, ETH crypto saw a modest decrease of 0.63% in the past week but also experienced a more substantial decline of approximately 10.82% over the past month.\n\nZooming out to a longer timeframe, Ethereum cryptocurrency has faced a notable setback, with a decline of 13.46% over the last three months, although it has managed a noteworthy upturn of 4.47% within the past six months. Furthermore, in the current year, ETH’s price has showcased a remarkable recovery, surging by around 36.86%. This highlights the significant progress the cryptocurrency has made on its path to recovery throughout 2023.\n\nTaking into account technical indicators, ETH cryptocurrency faces hurdles as it approaches the lower trendline. The relative strength index suggests that ETH crypto is presently consolidating at its current level. Moreover, the moving average convergence divergence indicates a downward trend in the price of ETH.\n\nThe RSI stands at 36 and maintains a stable position, signifying a neutral position below the neutral threshold. Additionally, the MACD line currently overlaps with the signal line, awaiting the potential occurrence of a crossover. Consequently, investors engaged in ETH cryptocurrency should practice patience and closely monitor the daily chart for any significant shifts in direction.\n\nSummary\n\nThe Ethereum price prediction underscores the critical juncture at which ETH cryptocurrency currently finds itself, operating within a pivotal make-or-break scenario contained within an intriguing symmetrical triangle pattern. However, volume change can be seen below average and needs to grow during the day’s trading session. Taking into account technical indicators, ETH cryptocurrency faces hurdles as it approaches the lower trendline.\n\nTechnical Levels\n\nSupport Levels: $1620.95 and $1600.00\n\nResistance Levels: $1655.00 and $1675.00\n\nDisclaimer\n\nThe views and opinions stated by the author, or any people named in this article, are for informational purposes only, and they do not establish financial, investment, or other advice. Investing in or trading crypto or stock comes with a risk of financial loss."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3LmNyeXB0b3BvbGl0YW4uY29tL21hdHRlci1sYWJzLXByb3Bvc2VzLWV0aGVyZXVtLXN1cHJlbWUtY291cnQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "Matter Labs co-founder proposes 'Ethereum Supreme Court' for On-Chain disputes - Cryptopolitan",
        "content": "In a groundbreaking move that could reshape the landscape of blockchain governance and security, Matter Labs co-founder and CEO Alex Gluchowski has unveiled a visionary concept: an “Ethereum Supreme Court.” This proposal envisions a hierarchical court system within the Ethereum network, mirroring real-world legal structures, and aims to provide a final recourse for parties embroiled in disputes related to smart contracts.\n\nGluchowski’s motivation behind this audacious idea is to create a formidable deterrent against malicious actors and external political interference while elevating Ethereum’s status as a robust network state. In this news article, we delve deeper into the concept of the Ethereum Supreme Court, exploring its mechanics, potential benefits, and the challenges it may face.\n\nThe Ethereum Supreme Court concept\n\nAt its core, the Ethereum Supreme Court concept revolves around establishing a series of on-chain courts responsible for adjudicating disputes and managing emergency upgrades within the Ethereum ecosystem. Like a traditional court system, these on-chain courts would operate hierarchically, with the ultimate authority vested in the “Court of Final Appeal” at the Ethereum layer-1 level. Here’s a breakdown of how this innovative proposal would function:\n\nHierarchical On-Chain courts\n\nGluchowski’s vision begins with introducing hierarchical on-chain courts. Each protocol within the Ethereum network would have its governance structure, complete with mechanisms for routine and emergency upgrades. Additionally, protocols would designate a unique contract capable of triggering an appeal process.\n\nEmergency upgrade appeals\n\nAn appeal period would be initiated when a protocol necessitates an emergency upgrade. Any Ethereum user could submit a challenge to the higher court relevant to the protocol during this window. However, submitting a challenge would require a predetermined bail deposit, ensuring that only serious and well-founded disputes make it through.\n\nThe on-chain court system would be designed as a chain of appeals, with each court specifying the higher court to which appeals can be made. For instance, protocols like Aave or Uniswap might first contest matters in courts like CourtUnchained or JusticeDAO. If dissatisfied with the outcome, a party could escalate the dispute to the Ethereum Supreme Court, serving as the final destination for challengers.\n\nThe rationale behind Ethereum Supreme Court\n\nGluchowski’s proposal is more than just a novel experiment in blockchain governance. It seeks to address several critical concerns within the Ethereum ecosystem while fostering a more secure and reliable network. The key motivations behind the Ethereum Supreme Court concept are as follows:\n\nOne of the primary objectives is to safeguard Ethereum protocols from external political interference. The network can insulate itself from undue influence by establishing a robust on-chain court system, thereby preserving its integrity and autonomy.\n\nThe Ethereum Supreme Court is a potent deterrence mechanism against bad actors. The threat of facing a comprehensive and impartial on-chain legal process is expected to discourage malicious intent and enhance overall network security.\n\nThis proposal aims to elevate Ethereum to a powerful network state. Ethereum can bolster its reputation as a dependable and resilient blockchain platform by providing a reliable mechanism for dispute resolution and emergency upgrades.\n\nChallenges and considerations\n\nWhile the Ethereum Supreme Court concept is undoubtedly ambitious and innovative, it has challenges and considerations. For the on-chain court system to be effective, there must be a strong social consensus within the Ethereum community. Achieving this consensus may prove challenging, as it would necessitate widespread support and adoption of the proposed framework.\n\nGluchowski acknowledges that the Ethereum Supreme Court would be expensive. Only exceptional cases warranting the attention of the entire Ethereum Layer-0 (the social consensus) would be brought before it to ensure its viability. Striking the right balance between accessibility and cost-effectiveness will be crucial.\n\nWhile the Ethereum Supreme Court represents a revolutionary idea, it’s essential to acknowledge existing solutions for dispute resolution and emergency upgrades within the Ethereum ecosystem. Gluchowski argues that these solutions are less effective than the proposed on-chain court system, but the debate around their efficacy persists.\n\nConclusion\n\nAlex Gluchowski’s audacious proposal for an “Ethereum Supreme Court” has the potential to redefine how blockchain networks handle disputes and governance. Ethereum could fortify its security, protect against external influence, and enhance its reputation as a robust network state by introducing a hierarchical on-chain court system. However, the path to implementation is riddled with challenges, including the need for strong social consensus and managing the cost implications of such a system."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDkvMDQvd2lzZG9tdHJlZS1lbmFibGVzLXN0YWtpbmctZXRwLWV0aGVyZXVtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "WisdomTree enables staking of its ETP on Ethereum - The Cryptonomist",
        "content": "WisdomTree, a pioneer in the global financial industry, recently announced a major update to its Exchange Traded Product (ETP) called WisdomTree Physical Ethereum (ETHW).\n\nThis innovative move now allows investors to actively participate in the staking process on the Ethereum blockchain and enjoy the associated rewards.\n\nIn this article, we will examine the implementation of staking in ETHW in detail, including the technical and financial implications.\n\nWisdomTree’s staking in Ethereum: a technical background to its new ETP\n\nTo fully understand the implications, it is important to have a solid understanding of what ‘staking’ means in the context of Ethereum.\n\nStaking refers to the act of delegating Ether (ETH), Ethereum’s native cryptocurrency, to a validator node on the Ethereum network. In return for this delegation, investors receive a reward, called a ‘staking reward’, which is provided by the Ethereum network itself.\n\nEthereum and Proof of Stake (PoS)\n\nMirva Anttila, Director, Digital Assets Research, WisdomTree, said:\n\n“The Shapella upgrade was an important step forward for Ethereum’s network, enabling the withdrawal of staking ethers and their rewards; it also enabled Ethereum to complete its transition to proof of stake.\n\nIn order to provide investors with staking rewards, we faced numerous challenges, and now that we have overcome them, we are able to offer them staking rewards through a risk-managed approach.”\n\nPoS is a consensus mechanism that allows ETH holders to participate in transaction validation and network security in exchange for rewards proportional to the amount of ETH staked.\n\nThis approach eliminates the need for the computationally intensive power typical of PoW, helping to reduce the environmental impact of mining.\n\nBenefits for investors\n\nThe introduction of staking in ETHW offers investors a number of significant benefits. Firstly, it allows them to participate in the staking process without having to directly manage an Ethereum node.\n\nThis greatly simplifies access to this form of investment, making it more accessible to those who may not be technical experts.\n\nIn addition, the fact that ETHW is listed on several major exchanges, including Xetra, SIX, the Swiss Exchange and Euronext in Paris and Amsterdam, makes it a practical and liquid solution for institutional and retail investors.\n\nThe ETP also offers a Total Expense Ratio (TER) of 0.95%, ensuring efficient cost management.\n\nWisdomTree’s Vision: Ethereum Participation Comes to its ETP\n\nWisdomTree Physical Ethereum is an example of WisdomTree’s approach to cryptocurrency and digital asset innovation. This product is designed to give investors direct exposure to the price of Ethereum without the need to hold ether or manage private access keys.\n\nAlexis Marinof, Head of Europe at WisdomTree, highlighted the importance of this step forward in offering cryptocurrency-related financial products.\n\nHe said that WisdomTree’s goal is to provide high-quality products that meet investors’ needs, while maintaining a strict focus on security and risk management.\n\nThe launch of WisdomTree Physical Ethereum (ETHW) is the result of a meticulous and focused approach by WisdomTree.\n\nThrough active collaboration with its custodian and a transparent strategy with a strong focus on risk management, WisdomTree has been able to successfully integrate this functionality into its Ethereum ETP.\n\nThis move is another step towards offering cryptocurrency-based financial products that meet the needs of both retail and institutional investors.\n\nThe ability to participate in Ethereum stakes through ETHW makes this solution even more attractive to those seeking exposure to the cryptocurrency sector without the burden of managing their digital assets directly.\n\nImpact on the crypto industry\n\nWisdomTree’s decision to enable staking in ETHW is indicative of the evolution of the cryptocurrency industry.\n\nThe transition from a Proof of Work (PoW) system to a Proof of Stake (PoS) system represents a significant change in the management of blockchain networks. This transition is driven by environmental, economic and energy efficiency considerations.\n\nThe ETHW ETP is positioned as a flexible instrument that allows investors to take advantage of this paradigm shift without having to deal with the technical challenges associated with self-staking. Its presence on major exchanges also makes this type of investment more accessible to a wider audience.\n\nConclusion\n\nIn conclusion, WisdomTree has taken a bold step by introducing staking in WisdomTree Physical Ethereum (ETHW).\n\nThis ETP represents a bridge between the worlds of cryptocurrency and traditional finance, offering investors an accessible and efficient way to participate in Ethereum staking.\n\nThe launch of this feature reflects WisdomTree’s commitment to financial innovation and offering products that keep pace with the evolution of the cryptocurrency industry.\n\nIn an ever-changing financial landscape, solutions such as ETHW demonstrate the versatility and adaptability of cryptocurrency and blockchain technologies.\n\nInvestors now have a new tool to harness the potential of Ethereum and participate in its future as a proof of stake network."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3LnRyb253ZWVrbHkuY29tL3NvbGFuYS10by1ldGhlcmV1bS1leG9kdXMtYW1pZC1mdHhzLWJhbmtydXB0Y3kv0gFOaHR0cHM6Ly93d3cudHJvbndlZWtseS5jb20vc29sYW5hLXRvLWV0aGVyZXVtLWV4b2R1cy1hbWlkLWZ0eHMtYmFua3J1cHRjeS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "Solana To Ethereum: A Multi-Million Dollar Crypto Exodus Amid FTX's Bankruptcy - TronWeekly",
        "content": "A wallet linked to the now-bankrupt cryptocurrency exchange FTX has initiated a substantial migration of digital assets, transferring them from the Solana network to Ethereum.\n\nThis move, detected by blockchain analytics firm Arkham Intelligence, has raised alarm bells within the cryptocurrency community, as it may signal the onset of a series of token selloffs amid FTX’s ongoing bankruptcy proceedings.\n\nSince August 31, this wallet has orchestrated the transfer of assets totaling a staggering $10.23 million, comprising $6.23 million in Ethereum and over $4 million in various altcoins.\n\nAmong the assets on the move, $1.2 million worth of FTX Token (FTT), $1.8 million in Uniswap (UNI), $1.3 million of HXRO (HXRO), $550,000 in SushiSwap (SUSHI), and $260,000 worth of Frontier Token (FRONT) have been shifted to another FTX wallet, employing the Wormhole Bridge for the transfer.\n\nThe sudden and sizable transfer of these assets has fueled speculations about the motivations and implications behind FTX’s actions as it grapples with financial turmoil. Market observers are closely monitoring the situation for further developments.\n\nSolscan data reveals that FTX, despite its bankruptcy nearly a year ago, still possesses approximately seven million SOL tokens stored in cold storage wallets. These tokens are currently valued at roughly $135 million.\n\nSolana Co-Creator Advocates For Fair SOL Token Redistribution from FTX\n\nSolana’s co-creator, Anatoly Yakovenko (commonly known as Toly), has advocated redistributing these SOL tokens to the former customers of the bankrupt crypto exchange.\n\nIn a Twitter exchange, Adam Cochran sought clarification, mentioning SBF’s statement about some of the locked Sol tokens being contractually restricted. Yakovenko responded by expressing his desire for the Solana tokens to be directly distributed to all FTX customers, considering it the most favorable outcome.\n\n.@adamscochran if you have any influence with the ftx estate, my wish would be to distribute the sol to all the ftx customers directly. Probably the least worse outcome for everyone. — toly 🇺🇸 (@aeyakovenko) August 31, 2023\n\nWhile acknowledging his lack of direct influence, Cochran suggested contacting relevant contacts to explore alternatives, pointing out that selling the tokens in liquidation might result in a suboptimal price.\n\nYakovenko further emphasized the potential benefits of distributing the tokens to a wider user base, estimating that this action could positively impact the network in the long run. He also argued that allowing each user to make individual decisions regarding their share could streamline the process and reduce legal complications.\n\nHowever, in a somewhat resigned tone, Yakovenko expressed his dissatisfaction with the alternative, alluding to the possibility of legal complications and unfavorable outcomes.\n\nRelated Reading | Stablecoins Market Cap Rises After 18 Months of Decline"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LnRoZWNvaW5yZXB1YmxpYy5jb20vMjAyMy8wOS8wMy93aXRoZHJhdy1ldGhlcmV1bS1mcm9tLW1ldGFtYXNrLXRvLXRoZS1iYW5rLWluLWZpdmUtZWFzeS1zdGVwcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 03 Sep 2023 07:00:00 GMT",
        "title": "Withdraw Ethereum for Metamask to the Bank in Five Easy Steps - The Coin Republic",
        "content": "MetaMask made it easy to store, manage, and swap different crypto assets running in the Ethereum network. It is a non-custodial decentralized wallet, offering backup phrases and private keys to secure the assets. MetaMask is geared towards digital assets, but withdrawing funds for first-time users will be difficult.\n\nLet’s explore the concept in detail along with discovering the procedure of cashing Ethereum from MetaMask to a bank account.\n\nA Glimpse of Ethereum and MetaMask\n\nEthereum is a digital technology and home to digital assets, applications, and global payments. A decentralized blockchain with smart contract functionality, powered by Ether (ETH) token, assisting users to make transactions and gain interest. ETH is the second-biggest digital asset by market cap after Bitcoin, holding strong value in the crypto marketplace. Focusing on history, the platform was created by Vitalik Buterin in 2015, holding a current price of $1,703.96 per ETH.\n\nMetaMask, a leading self-custodial wallet, offers a safe and simple way to access blockchain applications and Web3. The wallet is trusted by millions of users worldwide, helping individuals connect with the decentralized web. The wallet made it easy for the users to interact with the Ethereum blockchain. MetaMask supports a wide range of tokens including USD Coin (USDC), Ethereum (ETH), Tether (USDT), etc., ensuring easy management and interaction with the preferred assets.\n\nHow to Cash out Ethereum?\n\nIt is surprising that you can cash the Ethereum from MetaMask to the bank account in five easy steps. MetaMask is a software wallet that can be downloaded from mobile applications or browser extensions. The wallet is compatible with both Android and iOS devices. Once the application is installed, creating and restoring the old account is an easy process to follow. This is the easy step to open a MetaMask wallet.\n\nThe next step is to open the wallet and select the suitable or preferred crypto (ETH) to withdraw. Afterward, selecting the send icon will help in accessing the withdrawal page. The third step is to enter the withdrawal amount. Filling out the recipient’s wallet address in the ‘Send to’ box will help in making the transaction. In addition, the wallet address is a randomly created alphanumeric word that helps in making a safer transaction. Once the address is filled in, the next step is to enter the amount while examining the gas fees and the withdrawal will initiate.\n\nThe next step is to confirm and withdraw from the wallet to the respective bank account. Before finalizing the transaction, it will be good to cross-check the details, previewing the transaction amount, wallet address, and network. Choosing the confirm option will help in making the transaction successful.\n\nConclusion\n\nWith the MetaMask wallet, it becomes easy to withdraw Ethereum directly to the bank account. There are five easy steps to cash the ETH from the MetaMask wallet to the bank account. Downloading the wallet, selecting the crypto amount, and entering the address will help in making a transfer."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDkvMDQvYXJraGFtLWludGVsbGlnZW5jZS1maW5kcy1ncmF5c2NhbGUtZXRoZXJldW0tY3J5cHRvLXdhbGxldHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "Arkham Intelligence finds Grayscale's Ethereum crypto wallets - The Cryptonomist",
        "content": "On-chain analytics platform Arkham Intelligence has discovered 500 crypto wallets linked to the ‘Grayscale Ethereum Trust’.\n\nThe Trust, which offers its investors passive exposure to the price of ETH, is the second largest entity in the world by tokens held, with an AUM of $4.9 billion.\n\nThe trust is currently trading at a 30% discount to its net asset value (NAV). In June alone, the discount was 55%.\n\nSee full details below.\n\nArkham Intelligence and Grayscale discover Ethereum Trust crypto wallet\n\nLast week, Arkham Intelligence, one of the industry’s most advanced on-chain analysis platforms, made a sensational discovery by finding 500 crypto wallets linked to the Grayscale Ethereum Trust.\n\nThese are the words of Arkham’s insiders after the result:\n\n“We were able to identify the addresses by analysing activity and cross-referencing with Grayscale’s public balances.”\n\nThe fund, run by Michael Sonnenshein, is the second largest holder of ETH tokens, with a value of around $4.9 billion.\n\nArkham, in its tracking operations that led back to Grayscale‘s tokens, noted that a maximum of $30 million is held on each address, with a total of 2.987 million ETH in the 500 crypto wallets.\n\nThe reason for this extreme diversification is probably for security reasons, so that even if a wallet were hacked and emptied, the fund would only lose 1% of the assets managed in the trust.\n\nOther non-Ethereum ERC-20 tokens were also found in Grayscale’s various wallets, including 301,488 LINK, 263,888 UNI, 5.826 million BAT, 338.47 MKR, 4,999 AAVE, 91,488 SNX and 297,523 CRV.\n\nThe fund had only $65 million in ETH at the beginning of 2020, while by the end of the year it had grown to $2.2 billion.\n\nThe growth of the crypto market and the bullish outlook for Ethereum in 2020 attracted many investors who wanted to protect themselves from the adversities of the digital asset world and embrace a regulated and safe financial product.\n\nIn 2021, the fund continued to grow like crazy, with only a small dip in AUM in May, only to recover within a few months. The year ended with assets of USD 12 billion, although the all-time high of USD 15 billion was reached in November.\n\nOn the other hand, 2022, a bearish year for the entire crypto sector, led to a capital flight for Grayscale, which lost USD 8.3 billion.\n\nIn 2023, we see a brief recovery of $1.2 billion, supported by the rally in BTC and ETH at the beginning of the year and the latest market growth in June.\n\nGrayscale Ethereum Trust: Trading at a 30% discount to NAV\n\nThe Grayscale Ethereum Trust (ETHE), which offers passive exposure to the price of ETH, is currently trading at a 30.14% discount to its net asset value (NAV).\n\nTypically, an investment trust or exchange traded fund (ETF), while indirectly replicating the value of an asset, experiences a fluctuating price of its shares due to a variety of factors.\n\nIn general, if there is a belief that the market can explode upwards, the fund will trade at a premium, while if there is mistrust, it will trade at a discount.\n\nAt the moment, the Grayscale Trust is trading at a discount to its ‘fair value’ due to the obstacles in getting a spot ETF approved and the unstable conditions in the crypto sector.\n\nHowever, it should be noted that the discount was only 55% in mid-June, compared with 60% in January.\n\nProgress has therefore been made since the beginning of the year, reflecting increased investor confidence and a sentiment that, while still negative, is moving towards the positive.\n\nThe entry of BlackRock and other asset management funds into the sector and the various applications for a spot ETF on bitcoin and ethereum have certainly influenced the small rise in ETHE in 2023.\n\nMichael Sonnenshein’s fund, which currently trades at an ETH price to market ratio of USD 10.68, could see a NAV premium of more than 100% by the end of 2020.\n\nAt one point, the value was as high as 947% above the cryptocurrency’s market price.\n\nThe downside came in early 2021, when the first negative discounts to NAV were recorded as the trust’s AUM grew.\n\nThe reasons for this steep decline are varied, but certainly related in part to the trust’s difficulty in ‘transforming’ into a full-fledged Exchange Traded fund and investor fears due to regulatory pressures in the US.\n\nGrayscale’s Bitcoin Trust (GBTC), currently trading at a 20% discount to NAV, is following the same fate.\n\nIn December 2022, the trust’s managers had said they would look at various situations to return money to investors if they failed to get an ETF approved.\n\nIf the SEC approves the applications from BlackRock, VanEck, Wisdom Tree, Invesco and other hedge funds, we could expect to see a pumping up of the price of these funds, resulting in a discount to NAV and a possible return to a premium.\n\nIt is also worth noting that a few days ago Grayscale won a major court battle against the SEC, which is now obliged to reconsider Sonnenschein’s fund application.\n\nHowever, it is too early to declare victory: Gary Gensler and his team can postpone their decisions for a few more months and devise strategies to reject the various fund applications.\n\nThe war is still on."
    }
]