[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZGVjcnlwdC5jby8xMzgzMzQvZ2FyeS1nZW5zbGVyLXNlYy1ldGhlcmV1bS1ub3Qtc2VjdXJpdHktbWl0LTIwMTjSAU9odHRwczovL2RlY3J5cHQuY28vMTM4MzM0L2dhcnktZ2Vuc2xlci1zZWMtZXRoZXJldW0tbm90LXNlY3VyaXR5LW1pdC0yMDE4P2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Apr 2023 07:00:00 GMT",
        "title": "Gary Gensler Says SEC Believes Ethereum Is Not a Security—At MIT in 2018 - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nU.S. Securities and Exchange Commission Chair Gary Gensler may have appeared to sidestep questions recently on whether Ethereum and other crypto assets are securities—but he certainly seemed confident back in 2018.\n\nA video has emerged on Twitter showing the top regulator giving a lecture at the Massachusetts Institute of Technology. In it, he says that Ethereum is “not a security” in the eyes of the SEC.\n\nEthereum is the second biggest cryptocurrency, with a market cap of $227 billion at the time of writing. In the past, regulators have struggled with how to label the asset.\n\nAD\n\nAD\n\n“In 2018, the Securities and Exchange Commission has said regardless of what it might have been in [2014],” Gensler said, referring to when Ethereum launched and announced an ICO using Bitcoin to buy it, “it’s now sufficiently decentralized that we’ll consider it not a security.”\n\nAnd another one... - The below clip is from a Fall 2018 Graduate MIT course called \"Blockchain and Money\" Gary Gensler - the current President of the SEC, was the professor. Once again, I will let the below video speak for itself. Lecture 6: Smart Contracts and… pic.twitter.com/hsTvJ82XmM — zk-🦈 (@ZK_shark) April 28, 2023\n\nGensler, a civilian at the time and speaking only in his capacity as a professor, appeared to simply be relaying the opinions of the SEC back in 2018—specifically, the opinion expressed by former Director of Corporate Finance William Hinman in his much-cited \"sufficiently decentralized\" speech from June of that year.\n\nStill, the irony wasn't lost on Crypto Twitter—especially when juxtaposed against Gensler's recent duel with Rep. Patrick McHenry (R-NC) during an appearance before a House Oversight Committee. Repeatedly asked to give his opinion as to whether Ethereum should be classified a security, and even confronted with Hinman's comments from 2018, Gensler refuses to answer the question.\n\nAD\n\nAD\n\nThe clip of Gensler's lecture at MIT is one of many recently surfaced by Twitter user \"ZK_shark.\" Earlier this week, another clip shared by ZK_shark was retweeted by Coinbase CEO Brian Armstrong, whose company is currently in the SEC's crosshairs over its Ethereum staking product. In the clip, Genlser says he believes most of the crypto market is made up of \"non-securities.\" It's a statement that directly contradicts more recent comments as chair of the SEC in which he said he believes the \"vast majority\" of tokens in the crypto market are securities.\n\nMany have jumped in to criticize the regulator and former MIT teacher—but crypto lawyer Preston Byrne chimed in on Twitter by saying that Gensler speaking as a professor and then as a top regulator are two different things. “As a professor, he can talk about what things are in the abstract,” he wrote. “As a law enforcer, he’s required to enforce the laws as they’re written.”\n\nGensler's refusal to answer lawmakers on whether Ethereum is security or a commodity is nothing new: Last year, he also refused to give a clear-cut answer when pressed. And crypto industry bigwigs—from lawyers to CEOs—have poked fun at the fact that Gensler has failed to answer straightforward questions in the past.\n\nI see a lot of people giving Gary Gensler a hard time over this but it’s important to note the different capacities in which he’s speaking. As a professor, he can talk about what things are in the abstract. As a law enforcer, he’s required to enforce the laws as they’re written. https://t.co/mYhd7Hm8I9 — Preston Byrne (@prestonjbyrne) April 26, 2023\n\nA security is a tradable financial asset that has monetary value—like stocks or bonds—that meets a specific legal definition as outlined by the so-called Howey Test.\n\nUnder U.S. law, an asset meets the definition of a security if it is an investment of money in a common enterprise from which there is an expectation of profit based on the efforts of others.\n\nGensler has said that Bitcoin, the biggest cryptocurrency by market cap, is not a security—but rather a commodity. It's the only crypto asset for which he's currently willing to give a public opinion.\n\nAD\n\nAD\n\nThe SEC has launched an intense crackdown on the crypto industry during Gensler's tenure—most recently targeting three U.S.-based cryptocurrency exchanges in as many months: Kraken, Bittrex, and Coinbase.\n\nSome political leaders in the U.S.—especially Republican lawmakers—have criticized the regulator for his latest actions. They claim he is stifling regulation in the world’s largest economy and forcing American tech companies overseas."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5sZWRnZXIuY29tL2FjYWRlbXkvdG9waWNzL3NlY3VyaXR5L3N0cm9uZ2EtY29tcHJlaGVuc2l2ZS1ndWlkZS10by1ldGhlcmV1bS1leHBsb2l0cy1hbmQtc2VjdXJpdHktYmVzdC1wcmFjdGljZXNzdHJvbmfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Apr 2023 07:00:00 GMT",
        "title": "A Guide to Ethereum Exploits and Security Best Practices - Ledger",
        "content": "A Guide to Ethereum Exploits and Security Best Practices\n\nBy Boring Security\n\nRead 7 min Beginner\n\nSHARE\n\nAs a technology continues to evolve, it necessarily faces unique security challenges. Ethereum is no exception, and navigating this new world presents a host of pitfalls that can be intimidating for new users. Indeed, it seems every day we see another member of our community scammed.\n\nHowever, you don’t have to be a security expert to keep your assets secure. Operating safely can be boiled down to a few simple rules. In this article, we’ll talk about the scams that run rampant in the space today, and how to prevent yourself from becoming a victim.\n\nUnderstanding Self-custody\n\nThe beauty of Ethereum is that each user becomes the custodian of their own assets. There is no need for banks, debit cards, trading hours, or intermediaries. The chain runs 24/7, and remains available to anybody at any time, without bias. During peak hysteria, when centralized exchanges crash, the chain chugs along. You can always transact, though sometimes you may have to pay a pretty penny to do so.\n\nSelf-custody can be daunting. Because you control your own funds, you are also responsible for keeping them safe. Scammers know that less knowledgeable users can be exploited, and with no intermediaries to protect you, there’s little to no recourse after losing your assets.\n\nsetApprovalForAll: Explained\n\nFirst, let’s dispel a common misconception: a malicious smart contract can’t steal your NFTs. In order to move an NFT governed by Contract A, Contract B would first require you to approve it to do so by using Contract A’s setApprovalForAll function. This requires a separate transaction, and although setApprovalForAll is used in scams, it’s not executed in this manner. This is important because it means that no degen mint can steal your assets as long as you verify that the contract you’re interacting with is the degen mint contract, and not of some other asset you own.\n\nThough a contract can’t be used to submit a malicious SAFA request, a website can. If a site unexpectedly asks you to setApprovalForAll (SAFA), it is almost surely a scam. They’ll simply ask you to sign boredApeYachtClub.setApprovalForAll instead of degenMint.publicMint, and if you sign it, they are free to take all of your Bored Ape Yacht Club tokens. Most Ethereum wallets will provide a warning when you are about to sign a SAFA request, so always be extra cautious when you see one. If you aren’t expecting to sign a SAFA request, then you shouldn’t.\n\nThere are, of course, legitimate reasons to use SAFA. NFT Marketplaces like OpenSea or Blur require approval to move your NFT if somebody buys it. If you see a SAFA while listing an NFT on a marketplace you trust, you are safe to proceed. For the same reason, P2P trading sites like NFTTrader require approvals to execute a swap. However, there are a lot of scammers who utilize this transaction type to scam you. Let’s take a look at a few below.\n\nMost Popular Scam Methods That Utilize the “SAFA”\n\nNFT Trading Scams\n\nThese types of scams use social engineering techniques to convince you to take part in their private trade. Next, they will send you a fake trading site. Since marketplaces will ask you to setapprovalforall, the process might seem trustworthy. However, instead of approving a marketplace’s smart contract, a scammer will trick you into approving their wallet. At that point, the scammer can steal your NFTs and block your future messages.\n\nTo avoid this particular scam, bookmark reliable platforms such as OpenSea, LooksRare, X2Y2, NFTTrader, and SudoSwap. For some other similar tips, check out the Boring Security guide on how to trade securely.\n\nFake Revoke Sites: Another way that scammers might request a SAFA from you is to claim that there is a new exploit on a particular marketplace like Blur or OpenSea. Next they direct you to a fake site to revoke approvals. Since revoking approvals prompts a SAFA transaction, it can be difficult to tell if it is legitimate or not. Signing the wrong transaction approves the scammer’s address to steal your NFTs. To avoid this, bookmark your preferred revoke site, such as http://revoke.cash and https://approvals.xyz.\n\nAirdropped NFTs with WETH offers: If you’ve asked yourself, “can I accept that WETH offer on the junk NFT that appeared in my wallet?”, you’re not alone. The answer is yes, and no. The NFT itself can’t harm you – remember, contracts can’t steal your other NFTs. So what are they all about? First of all, the WETH offer is fake – if you try to accept it, the transaction will fail. The reason it’s there is to draw your eyes to something else: the item description. In the description, you’ll find a link to an external website where, you guessed it, they’ll ask you to sign a malicious transaction. You can read more on this technique in this twitter thread by Quit.\n\nAccusing You Of Being A Scammer: A popular method lately has been to make accusations that you are scamming people in discord, complete with (doctored) screenshots of you scamming in DMs. This is particularly nasty because you are naturally inclined to attempt to protect your reputation. The end goal here is to lure you into a fake discord server that uses an imitation of Collab.Land or Vulcan for verification. When you go to verify your identity, the imitation site requests a SAFA or a seaport signature (more on that below) from you! Keep yourself safe from these by ignoring any accusations of scamming.\n\n\n\nOther Methods: We’ve seen fake derivative sites, fake mints, staking sites, airdrop claims, hacked accounts on Twitter linking phishing sites, Function name collision obfuscation (too long to talk about in this article, but explained beautifully here), and many more. We couldn’t possibly get through them all, but you should know the components of an Approval transaction, what to look for, and what to watch out for with existing approvals. Check out this article written by Boring Security about approvals for more information. The bottom line is: be extremely careful where and what you give approvals to, what you sign, and where you sign it!\n\nSeaport Signatures\n\nNow that we know how to avoid SAFAs, let’s look at another, potentially more devastating SAFA-related scam: the Seaport Signature. This scam has risen in popularity over the past few months as SAFA awareness grows, and is now the culprit for the majority of scams we see every day.\n\nIt is commonly assumed that if a website requests a gasless signature, it’s safe to sign. That couldn’t be further from the truth. In fact, the most devastating scam out there leverages gasless signatures to steal bundles of NFTs all at once.\n\nRemember that marketplaces require approvals in order to move your NFTs, for example, when it must move a listed NFT to its new buyer. On the other end, these marketplaces use signatures to verify that the listing is valid before finalizing the sale.\n\nA valid signature contains specific data; the token(s) name, the listing deadline, the price of the assets, and more. Any number of tokens can be included in a listing. But it’s not just NFTs, setting approvals works for ERC-20 tokens such as $USDC and $APE as well.\n\nAll a scammer needs to do to take advantage of this is request a signature from you that includes all of your tokens as assets, and a price of 0. Once you sign it, they can submit that signature to Seaport to “buy” the new listing, transferring all of your assets to them. That leaves nothing for you.\n\nIt’s important to note that only tokens that you’ve approved to Seaport are at risk of this attack, and prevention is fairly simple. The OpenSea signature is verbose and hard to decipher. If a website you don’t trust prompts you for a signature and you can’t understand what it means, don’t sign it. This is the best way to keep safe – signatures are required to prove ownership on many sites, but legitimate use cases should always be human-readable messages like “Welcome to collab.land!”. If you want to get into the finer points of signature types, and some screenshot examples, head on over to Boring Security’s “Safe Signing 101” article shown here.\n\nOutside of being careful about what you sign, you should also practice good asset segregation. Since only the NFTs you’ve approved to OpenSea or other marketplaces are vulnerable to this type of attack, you don’t need to worry about it on wallet addresses that don’t carry any open approvals. You should always keep your most valuable NFTs in a vault wallet with no approvals. Then when you need to sell, transfer them to an intermediate wallet and list them for sale from there. Since your vault has not approved anything to any exchanges, you don’t have to worry about gasless signature scams. Using this method, you successfully close off the entryway for the most common and deadly attack.\n\nAlso note that while less common, Blur signatures and approvals are also subject to this type of scam. To explain, Blur signatures will appear as a random hex string. This is perhaps even more unreadable than a Seaport signature.\n\nETH_SIGN\n\nAlthough most major wallets have this setting disabled by default, it is worth mentioning. You may decide to enable it for things like Opensea Pro.\n\nThere is another type of gasless signature that can be dangerous: the eth_sign. At its core, a blockchain transaction is simply a signed message that when decoded, includes fields like Gas Price, Nonce, Value, To Address and more. So attackers using this method will assemble a valid transaction and then ask you to sign it. That’s because, once signed, anybody can submit the transaction. If all of the parameters are still valid (i.e. your nonce hasn’t changed), the transaction will be executed as if you submitted it yourself. . This raw transaction signing is called an eth_sign, and luckily it is now disabled by default using most major wallets.\n\nIf you do happen to sign one, there can only be a single transaction executed using that signature. Once the damage is done, you are safe to continue using your wallet as normal.\n\nAddress Poisoning\n\nAddress poisoning happens when an attacker sends fake tokens from your address to an address that resembles one from your transaction history. They can do this very effectively and cheaply using something called event spoofing. Rest assured that not only is your address still secure, but these tokens aren’t even actually moving. The scammer hopes that some time in the future, you will copy and past a destination you sent to in the past, and accidentally choose their lookalike address over the real one. Avoid falling victim by double checking your destination before confirming any transactions!\n\nPrivate Key Compromise\n\nThe most devastating attack of all is the private key compromise. Thankfully, this also happens to be the attack that is most easily avoided. If you are not using a hardware wallet, your private keys are saved somewhere (hopefully encrypted) on your device. A malicious program will be able to locate and extract these keys, giving an attacker full control of your wallet.\n\nPrivate key compromises are the hardest type to track down the source of, because there’s nothing on-chain that can hint at source. Any malware can be responsible for stealing your private keys. To explain, anything you download and run on your device can potentially be the culprit.\n\nSocial Engineering Scams\n\nThe most common method is a social engineering scam. The top three scams we’ve seen in 2023 have been:\n\nGame Beta Testing: A scammer will offer you money in exchange for beta testing a “game” that they’re building. Testing the game will require downloading and installing it, of course. To follow, the installer will attempt to hijack your wallet’s private key. If successful, they drain the wallet’s contents. Additionally, an automated sweeper will be attached to extract any assets sent to the address in future. IP Royalty Contract Scam: A scammer will offer you royalties and payments for the usage of your NFT’s IP. This is the dream, right? Passive income. Unfortunately, they will either get you to sign a scam transaction, or have you download a fake PDF that contains a private key stealing virus. Collaboration Request/Contract: Founders and those involved in projects with high-value NFTs are targeted by all types of companies attempting to appear legitimate. These are getting more prevalent, and use the same method as above. They may also even get on calls with you to buy credibility with you.\n\nIf your private key has been compromised, your only option is to abandon the wallet and start fresh. If there are assets remaining in the compromised wallet, for example, assets that were staked or otherwise not immediately apparent to an attacker, those assets can sometimes be rescued using a flashbots bundle by whitehat hackers in the Flashbots discord server.\n\nIf you use a hardware wallet, your keys are protected from the internet. This keeps them safe from things like malware, as long as you don’t manually store them somewhere online. Ledger devices use a secure element chip, meaning they are some of the most secure hardware wallets in existence. To be properly protected while using a hardware wallet, you should keep your seed phrase written down offline, on paper, or better yet, using metal. To learn more, make sure to check out the article on how to protect your recovery phrase.\n\nFinal Thoughts From Boring Security\n\nThe world of Ethereum and NFTs is an exciting and rapidly evolving space, but it is essential to remain vigilant and well-informed to avoid falling victim to scams and malicious actors. Safeguard yourself by thoroughly understanding the potential risks associated with malicious smart contracts, SAFA requests, Seaport signatures, ETH_SIGN, and private key compromises. Exercise caution when signing transactions, approving contracts, or downloading and installing new software, and always pay close attention to any warning signs.\n\nKeep your assets vaulted. If you value something, leave it in a wallet that has no open approvals.\n\nUtilize hardware wallets to provide an additional layer of security for your private keys, ensuring that they stay safely stored offline. Bookmark and rely on trusted platforms for conducting transactions and managing your assets to avoid inadvertently accessing malicious websites. By following these guidelines and consistently staying up-to-date on emerging threats and best practices, you can confidently engage with the Ethereum ecosystem and the world of NFTs while effectively safeguarding your valuable assets from potential risks.\n\nHave any questions or want to learn more about web3 security and stay up to date on the most current security information, scams, and tactics? Join Boring Security in our discord at https://discord.gg/boringsecurity"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA0LzI4L2JldHRlci1idXktZXRoZXJldW0tb3ItYml0Y29pbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Apr 2023 07:00:00 GMT",
        "title": "Better Buy: Ethereum or Bitcoin? - The Motley Fool",
        "content": "Despite a recent pullback in the crypto market, both Bitcoin (CRYPTO: BTC) and Ethereum (CRYPTO: ETH) continue to be two of the best-performing cryptos. Bitcoin is up about 80% for the year, while Ethereum is up about 60%. On the surface, it would appear that Bitcoin is clearly the superior investment in 2023.\n\nHowever, two market indicators paint a different picture of what's happening in the crypto market right now. Here's a closer look at how Ethereum stacks up with Bitcoin on a relative basis.\n\nBitcoin's correlation with Ethereum\n\nCorrelations are incredibly important in the crypto markets. For example, any time the correlation of Bitcoin with gold tightens, it usually signals that investors are about to pile into Bitcoin as a safe-haven investment. Investors also use the correlation of Bitcoin with broad market indexes such as the S&P 500 or the Nasdaq 100 to gauge how the market currently views crypto as a risky asset. The tighter the correlation between Bitcoin and the Nasdaq, the thinking goes, the more that investors are viewing Bitcoin as just a slightly riskier tech stock.\n\nBut there's another correlation that many investors are not talking about, and that's the correlation between Bitcoin and Ethereum. The conventional wisdom is that the correlation between the two is very close to 1.0, so it's not really worth tracking. However, Coinbase Global (NASDAQ: COIN) made waves earlier this month when it published a report showing how the correlation between Bitcoin and Ethereum appears to be declining, from a level of 0.95 in mid-March to a level of 0.82 in mid-April. That might not seem like a big deal, but it is for institutional investors. It directly impacts risk management and sophisticated hedging techniques.\n\nThere are a number of different factors that might be responsible for this shift, including Ethereum's recent tech upgrade in March. If this trend persists, it could signal that Ethereum is finally uncoupling from Bitcoin and going its own way. That would be a net positive for Ethereum because it would fundamentally challenge the simplistic \"Bitcoin is gold, Ethereum is silver\" investment narrative.\n\nThe Ethereum/Bitcoin currency pair\n\nSince both Bitcoin and Ethereum are digital currencies, it makes sense to evaluate them from the perspective of a foreign exchange trader. One way of doing this is by tracking the performance of the Ethereum/Bitcoin currency pair over time. By doing so, you can immediately see when Ethereum is \"strengthening\" against Bitcoin and when it is \"weakening\" against Bitcoin. In much the same way, a foreign exchange trader could see when the U.S. dollar is strengthening or weakening against the Euro (or some other currency).\n\nData by Trading View\n\nAs can be seen from the chart above, the current value of the Ethereum/Bitcoin currency pair is approximately 0.066. This is derived from dividing the current price of Ethereum ($1,915) by the current price of Bitcoin ($28,964). The value of the Ethereum/Bitcoin currency pair has traded, by and large, in a relatively narrow range of 0.06 to 0.08 since mid-2021. From a historical perspective, this value is actually quite high. In the period from 2019 to 2021, for example, the value typically ranged from 0.02 to 0.03. The big breakout came during the last crypto bull market rally when the number of possible use cases for Ethereum exploded. On the graph, it's possible to see a huge spike right around March 2021.\n\nPutting all this together, it's possible to create an investment thesis around Ethereum and Bitcoin. Ever since 2021, Ethereum seems to be gaining in value on a relative basis vs. Bitcoin. Another way to think about this is that as Ethereum continues to introduce new technological upgrades and expand its ecosystem, it is \"strengthening\" against Bitcoin and becoming a better investment. If you think about the Ethereum blockchain ecosystem as an economy, then this becomes intuitively clear. In the same way, one would expect the U.S. dollar to strengthen if the U.S. economy strengthens.\n\nDoes the data favor Ethereum?\n\nOverall, a case can be made that Ethereum is not just a better investment than Bitcoin right now, but that it's also becoming a better investment over time. Ethereum clearly has a more diversified blockchain ecosystem than Bitcoin and offers a whole range of products and offerings -- such as NFTs, blockchain gaming, metaverse worlds, and decentralized finance (DeFi) -- that Bitcoin simply can't match. Bitcoin is, first and foremost, a method of payment.\n\nThus, if you're a Bitcoin maximalist, you might want to take a closer look at the changing relationship between Bitcoin and Ethereum. Right now, it looks like Ethereum after The Merge is stronger, better, and more diversified than it has ever been, and investors are starting to recognize this. At some point, say some crypto investors, Ethereum could eventually \"flip\" Bitcoin and become the most valuable cryptocurrency in the world."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9nYXJ5LWdlbnNsZXItc2F5cy1zZWMtYmVsaWV2ZXMtMjE0NDIxOTQwLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Apr 2023 07:00:00 GMT",
        "title": "Gary Gensler Says SEC Believes Ethereum Is Not a Security—At MIT in 2018 - Yahoo Finance",
        "content": "U.S. Securities and Exchange Commission Chair Gary Gensler may have appeared to sidestep questions recently on whether Ethereum and other crypto assets are securities—but he certainly seemed confident back in 2018.\n\nA video has emerged on Twitter showing the top regulator giving a lecture at the Massachusetts Institute of Technology. In it, he says that Ethereum is “not a security” in the eyes of the SEC.\n\nEthereum is the second biggest cryptocurrency, with a market cap of $227 billion at the time of writing. In the past, regulators have struggled with how to label the asset.\n\n“In 2018, the Securities and Exchange Commission has said regardless of what it might have been in [2014],” Gensler said, referring to when Ethereum launched and announced an ICO using Bitcoin to buy it, “it’s now sufficiently decentralized that we’ll consider it not a security.”\n\nAnd another one... - The below clip is from a Fall 2018 Graduate MIT course called \"Blockchain and Money\" Gary Gensler - the current President of the SEC, was the professor. Once again, I will let the below video speak for itself. Lecture 6: Smart Contracts and… pic.twitter.com/hsTvJ82XmM — zk-🦈 (@ZK_shark) April 28, 2023\n\nGensler, a civilian at the time and speaking only in his capacity as a professor, appeared to simply be relaying the opinions of the SEC back in 2018—specifically, the opinion expressed by former Director of Corporate Finance William Hinman in his much-cited \"sufficiently decentralized\" speech from June of that year.\n\nStill, the irony wasn't lost on Crypto Twitter—especially when juxtaposed against Gensler's recent duel with Rep. Patrick McHenry (R-NC) during an appearance before a House Oversight Committee. Repeatedly asked to give his opinion as to whether Ethereum should be classified a security, and even confronted with Hinman's comments from 2018, Gensler refuses to answer the question.\n\nStory continues\n\nThe clip of Gensler's lecture at MIT is one of many recently surfaced by Twitter user \"ZK_shark.\" Earlier this week, another clip shared by ZK_shark was retweeted by Coinbase CEO Brian Armstrong, whose company is currently in the SEC's crosshairs over its Ethereum staking product. In the clip, Genlser says he believes most of the crypto market is made up of \"non-securities.\" It's a statement that directly contradicts more recent comments as chair of the SEC in which he said he believes the \"vast majority\" of tokens in the crypto market are securities.\n\nMany have jumped in to criticize the regulator and former MIT teacher—but crypto lawyer Preston Byrne chimed in on Twitter by saying that Gensler speaking as a professor and then as a top regulator are two different things. “As a professor, he can talk about what things are in the abstract,” he wrote. “As a law enforcer, he’s required to enforce the laws as they’re written.”\n\nGensler Says Proof-of-Stake Assets Could Be Securities: Report\n\nGensler's refusal to answer lawmakers on whether Ethereum is security or a commodity is nothing new: Last year, he also refused to give a clear-cut answer when pressed. And crypto industry bigwigs—from lawyers to CEOs—have poked fun at the fact that Gensler has failed to answer straightforward questions in the past.\n\nI see a lot of people giving Gary Gensler a hard time over this but it’s important to note the different capacities in which he’s speaking. As a professor, he can talk about what things are in the abstract. As a law enforcer, he’s required to enforce the laws as they’re written. https://t.co/mYhd7Hm8I9 — Preston Byrne (@prestonjbyrne) April 26, 2023\n\nA security is a tradable financial asset that has monetary value—like stocks or bonds—that meets a specific legal definition as outlined by the so-called Howey Test.\n\nUnder U.S. law, an asset meets the definition of a security if it is an investment of money in a common enterprise from which there is an expectation of profit based on the efforts of others.\n\nGensler has said that Bitcoin, the biggest cryptocurrency by market cap, is not a security—but rather a commodity. It's the only crypto asset for which he's currently willing to give a public opinion.\n\nThe SEC has launched an intense crackdown on the crypto industry during Gensler's tenure—most recently targeting three U.S.-based cryptocurrency exchanges in as many months: Kraken, Bittrex, and Coinbase.\n\nSome political leaders in the U.S.—especially Republican lawmakers—have criticized the regulator for his latest actions. They claim he is stifling regulation in the world’s largest economy and forcing American tech companies overseas."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiNGh0dHBzOi8vd3d3LmxjeC5jb20vaG93LXRvLXJlZHVjZS1ldGhlcmV1bS1nYXMtZmVlcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Apr 2023 07:00:00 GMT",
        "title": "How to Reduce Ethereum Gas Fees? - LCX",
        "content": "Ethereum gas fees have been an important issue for those who use the platform. Gas fees are the fees that consumers must pay for each Ethereum transaction. The greater the fee, the quicker the transaction will be processed. However, gas prices can be an obstacle for some users, particularly those with modest transactions.\n\nThe Ethereum gas fee is the cost incurred whenever a transaction is executed on the blockchain. The operation of the Ethereum blockchain requires a certain level of processing effort, which is performed by cryptocurrency miners using Ethereum-based mining software.\n\nUtilize Simulation Via DeFi Saver\n\nThe actual gas price is unknown until they complete the payment process and pay for the gas. However, to stimulate the transactions with the DeFi Saver app. First, develop an instruction for Ethereum activities, then virtually execute it. The real-world simulation will provide the anticipated and maximum ETH gas fee. It can then be modified to complete the instruction to reduce gas costs. Now, implement this instruction on the Ethereum network to reduce the gas fees.\n\nTransaction Timing Improvement\n\nOvercrowding is one of the main causes of higher gas prices. However, the volume of Ethereum transactions fluctuates throughout the day. Occasionally, the gas charge for the exact same transaction that cost an additional ETH a few hours ago will be lower.\n\nHowever, learning about such instances can be monotonous. It will also hinder productivity, as it will need to continually check gas prices at various times. Therefore, users can view a detailed graph of weekly gas prices on the Ethereum Gas Charts webpage. Users can also perform a trick by avoiding work on weekdays. Even if they must submit a transaction during the week, do so after midnight. They may wish to delay their trip until the weekend, when gas prices are typically lower.\n\nSort Transaction Types.\n\nDepending on the sort of transaction, the gas fee varies on the Ethereum blockchain. To save money on gas fees, users may wish to organize and implement similar transactions simultaneously. Consider that they have two Ethereum addresses, each containing 1,000 tokens. Now, if users intend to store all tokens in a new DApp’s crypt in order to earn higher returns. To avoid spending money on gas fees, it is possible to send every token to a single address and then secure 2,000 tokens in only one transaction.\n\nUtilize DApps Offering Rewards and Reduced prices on Ethereum Gas Fees.\n\nThere are Ethereum ventures and DApps with lower or subsidized gas compared to the market. Balancer is a platform of this type. It offers up to 90% gas fee reimbursement in the manner of the BAL token. Balancer significantly reduces the gas fee for high-frequency traders by performing trades without exiting the vault.\n\nSome DeFi applications, such as KeeperDAO and Yearn’s V2 Vaults, consolidate user transactions. Each user pays the gas fee collectively rather than individually. This strategy substantially reduces the price.\n\nUtilize Gas Tokens\n\nWhen users delete data elements on the Ethereum network, they can receive reimbursements in the form of ETH. It is the foundation for gas tokens. When the fee is low, a substantial quantity of gas tokens can be minted. When users need to conduct a transaction on the network, they must exchange their gas tokens for ether. Use the rewarded ETH to pay for the gas. GasToken.io is a well-known initiative that enables the minting of gas tokens.\n\nReduced Ethereum gas fee benefits\n\nReducing Ethereum’s gas fees has multiple benefits for consumers. It could make the system readily available to small-scale business users who were previously priced out due to high gas costs. This can boost the adoption of decentralized applications and encourage growth on the platform.\n\nReduced gas fees can make it less costly for users to conduct transactions on the platform, leading to an increase in usage and adoption. This can contribute to the development of an ecosystem that is stronger for designers, investors, and consumers.\n\nMoving to reduced gas fees can help enhance the platform’s overall user experience. By reducing gas fees, users can appreciate more rapid and affordable transactions, which can be an important obstacle for them.\n\nConclusion\n\nThe reduction of Ethereum’s gas fees is a crucial step in making the platform affordable, readily available, and user-friendly. Considering that Ethereum gas fees are the “fuel” of the Ethereum network, comprehending them is essential for executing transactions on the network. By following a few simple guidelines, such as waiting for weak-traffic instances before offering a transaction, adjusting the user wallet’s fee settings, comparing rates, and utilizing scaling solutions such as Polygon, they can save on gas fees and ensure that all the transactions undergo processing easily and swiftly."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3Lm5hbnNlbi5haS9yZXNlYXJjaC9ldGhlcmV1bS1zaGFuZ2hhaS11cGdyYWRlLWV4cGxhaW5lZC1rZXktbWV0cmljcy10by10cmFjay1hbmQtZnV0dXJlLXByZWRpY3Rpb25z0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Shanghai Upgrade Explained, Key Metrics to Track and Future Predictions - Nansen",
        "content": "On April 12th, at 22:27 UTC, one of the most highly anticipated upgrades in Ethereum's history, the Shapella upgrade, was triggered. This upgrade is a combination of two separate upgrades: the Shanghai and Capella upgrades. It marks the first simultaneous upgrade of both Ethereum's consensus layer (Shanghai) and execution layer (Capella). Among the two, the Shanghai upgrade garnered the most attention, with supporters and critics alike actively monitoring its impact.\n\nWhat is the Shanghai Upgrade?\n\nIn short, the upgrade enables the withdrawal of ETH that has been staked on the Beacon Chain.\n\nEthereum consists of two layers: an execution layer and a consensus layer. The execution layer processes transactions and is the layer that you interact with and analyze on analytics tools such as Nansen or block explorers like Etherscan. The consensus layer, also known as the Beacon Chain, is responsible for maintaining the network's overall consensus, or agreement, on the current state of the blockchain. Since the launch of the Beacon Chain in December 2020, ETH holders have been able to stake their ETH but had no ability to withdraw it until now.\n\nSo, have validators been waiting to sell?\n\nNot exactly. While token unlocks have been associated with holders dumping in the past, Ethereum's situation is different. What the Shanghai upgrade enables is more like a typical Proof-of-Stake (PoS) blockchain withdrawal mechanism than a vested token unlock.\n\nThree reasons why validators would want withdrawals enabled besides selling:\n\nValidators only earn yield on the principal 32 ETH that they’ve staked. Without withdrawals enabled, validators are not able to re-stake their accrued rewards and hence are unable to compound their yield. There has been significant innovation and progress in ETH staking methodologies, and validators may want to reallocate their staking positions based on their priorities. For instance, stakers who have been solo staking or using illiquid Staking-as-a-Service options may want to switch to liquid staking protocols to maximize their yield. Enabling withdrawals also reduces the liquidity risk associated with staking ETH. This reduction in risk is likely to lower the barrier that deterred holders from staking their ETH, which could result in an increase in participation.\n\nHow do Ethereum withdrawals work?\n\nProbably the most important thing to understand about Shanghai is how withdrawals work. Ethereum withdrawals function differently from other PoS systems. While other PoS chains have a fixed unbonding period, which is the duration before users can access their staked tokens after submitting their withdrawal request, Ethereum has a variable one.\n\nThere are two types of withdrawals: partial withdrawals and full withdrawals. Both types of withdrawals have different triggers, and full withdrawals take significantly longer to process. But before we dive into both mechanisms, there's one crucial step that validators need to take to be eligible for withdrawals.\n\nHow do validators enable withdrawals?\n\nIn order for validators to be eligible for withdrawals, they have to update their withdrawal credential, which tells the network which address to send the withdrawn ETH to. Withdrawal credentials include one of two potential prefixes: 0x00 or 0x01. Only validators that have updated their credentials to the 0x01 prefix will be eligible for withdrawals. The maximum number of validators that can switch their prefix is 16 per block (12 seconds).\n\nOn the day of the upgrade, only about 43% of validators had updated their credentials. That number has now risen to 83.3% and will likely reach 100% as time goes by.\n\nThe rationale behind this number eventually reaching 100% is that every validator would want their accrued rewards to be withdrawn since they are only earning yield on the principal 32 ETH. It is not an indicator of their desire to exit and sell their ETH.\n\nWhat are partial withdrawals and how do they work?\n\nPartial withdrawals are withdrawals of accrued rewards while leaving the minimum 32 ETH required to operate as a validator intact, keeping the validator active. They are processed via an automated process and validators can expect to see their withdrawals reflected in their withdrawal address every 2-5 days.\n\nA common misconception with partial withdrawals is that they only occur every 2-5 days, but that's not the case. The protocol constantly scans through the validators and processes withdrawals for eligible validators. Up to 16 validators are processed per block (12 seconds) and \"2-5 days\" is the amount of time to complete one round of withdrawals across all validators. Note that this automatic withdrawal process is the same procedure that full withdrawals go through to complete their withdrawals.\n\nWhat are full withdrawals and how do they work?\n\nFull withdrawals are withdrawals of the entire balance of a validator and happen voluntarily or if the validator has been slashed. Full withdrawals take longer than partial withdrawals and are a multi-step process:\n\nExit queue (minimally 5 epochs, or 32 mins)\n\nMinimum validator withdrawability delay - 256 epochs (27.3 hours)\n\nAutomatic withdrawal queue (2-5 days)\n\nExit queue\n\nValidators must first exit the consensus layer before going through the same automatic withdrawal process as partial withdrawals. Validators are entered into the exit queue when they declare their interest to exit or when they are slashed. The primary purpose of the exit queue is to maintain the security of the network, not to accommodate ETH transaction speeds. If too many validators exit too quickly, the network would become unstable and vulnerable to attack.\n\nIn the best-case scenario, it takes a minimum of 5 epochs (32 minutes) to clear the exit queue. The queue length is based on the number of validators exiting and the churn limit, which is the maximum number of validators that can exit per epoch (every 6.4 minutes).\n\nChurn Limit = max(4, [active_validators/65536])\n\nA minimum number of 4 validators can exit per epoch and the church limit increases by 1 for every 65,536 new validators in the network once there are 327,680 active validators. At the current validator count, the churn limit is 8 and a maximum of 1800 validators can exit per day.\n\nWithdrawal delay and automatic withdrawal queue\n\nAfter going through the exit queue, validators are put through a minimum validator withdrawability delay of 256 epochs (27.3 hours) before they are eligible for withdrawals under the same automated withdrawal process that partial withdrawals undergo. The 27.3 hours delay is put in place to give the network time to detect harmful activity, preventing bad actors from negatively impacting the network and exiting without penalties.\n\nKey Shanghai upgrade metrics to monitor\n\nThere’s a ton of potential data points to look at and each of them provide an additional layer of insight but in this article we’ll focus on the 4 main ones to monitor.\n\nETH deposits vs withdrawals\n\nNansen's data highlights changes to the liquid supply of ETH. Deposits are ETH sent to the beacon deposit contract, withdrawals are principal ETH deposited, and accrued rewards sent to wallets. The chart above is a good way to gauge the flow of ETH between a locked & unlocked state. Use the cumulative sum (purple line) to estimate changes to liquid supply of ETH and not solely the size of deposit/withdrawal bars. Decrease in the cumulative sum = increase in liquid supply.\n\nCommon mistake: Assuming withdrawals = selling.\n\nPartial withdrawals happen automatically and will occur regardless of a validator’s desire to remain active or exit. Full withdrawals are the more important factor to look at as these are full exits and have to be manually triggered by the validator or an implication of getting slashed.\n\nThe exit queue and who’s withdrawing ETH\n\nMonitoring these two data points allows you to get a holistic sense of unlocks in the coming days.\n\nThe exit queue\n\nThe number of validators waiting for full withdrawals on Nansen include validators currently in the exit queue and validators that have gone through the queue but have not had their withdrawals processed yet.\n\nWho’s withdrawing\n\nAs Nansen has labeled millions of wallet addresses, we are able to monitor who’s in the withdrawal queues and who has withdrawn. This allows us to get an idea of the potential motivation behind the withdrawals.\n\nCurrently, most of the ETH waiting for withdrawals and being withdrawn belong to centralized exchanges such as Binance, Coinbase, Kraken and Huobi and not large whales exiting the network. A large bulk of this is due to regulatory crackdown and pressures faced and not voluntary withdrawals. It’s likely that we see users of those exchanges restake their ETH using other platforms such as Lido or Rocket Pool.\n\nPotential long term implications of the Shanghai upgrade?\n\nThis segment contains the opinions of the author and not meant to be taken as fact or investment advice of any kind.\n\nIn the short run, there is likely to be a level of volatility around withdrawal amounts. Partial withdrawals have two years of accrued rewards to be withdrawn, and events such as Kraken being forced to wind down their staking practice in the US, along with general reshuffling and reallocation of staked ETH among staking platforms, will cause initial spikes in withdrawals.\n\nHowever, in the long run, it is likely that withdrawals will settle along a baseline number of partial and full withdrawals happening each day, with spikes in the event of any unforeseen circumstances. On top of that, there are other potential implications that arise from the Shanghai upgrade.\n\nIncrease in the amount of ETH staked\n\nIt would not be surprising to see the percentage of ETH's total supply being staked increase over time.\n\nSource: Stakingrewards.com\n\nCompared to other major layer-1 blockchains, Ethereum has one of the lowest staking ratios. The lack of a withdrawal function has been one of the reasons for the low staking ratio, despite the prominence of liquid staking protocols. Although liquid staking protocols allowed users to swap their liquid staking tokens (LSTs) for ETH on DEXes, LSTs often traded at a discount due to the lack of withdrawals. As we approached the expected upgrade date, we saw a rapid increase in the amount of ETH staked, suggesting that the lack of withdrawals indeed reduced the attractiveness of staking.\n\nHowever, ETH’s staking ratios may not reach the levels of the other chains. This is due to the large NFT ecosystem, for which ETH is a currency of exchange, and the large and ever-growing DeFi ecosystem which presents alternative yield farming opportunities. The varied use cases and the presence of alternative opportunities to utilize ETH set it apart from other major L1 tokens. There is a case where liquid staking protocols and the liquidity they offer allow the vast majority of ETH to be staked without holders incurring much opportunity cost. In that scenario, we could very well see the vast majority of ETH’s total supply being staked, with liquid staking protocols being the main driver of that.\n\nIncrease in rate of innovation and competition amongst staking services\n\nThe increase in the portability of staked ETH means that staking services are in constant competition amongst themselves to offer the best possible service to the end user. Users will easily be able to vote with their ETH by switching their staked allocation as better solutions arise. Illiquid staking services will likely see the biggest increase in competition as this is the first time that users are able to withdraw their ETH. Liquid staking protocols are not spared from this change either. Now that LST de-pegs are almost non-existent, there’s little to no switching cost. Liquid staking protocols will have to continue to improve and embody the ethos of Ethereum holders for their market share to grow.\n\nIncrease in utilization of liquid staking tokens in DeFi\n\nAs highlighted in a previous article on liquid staking tokens, the vast majority of LSTs are not currently being utilized in DeFi protocols. While LSTs served their purpose of creating a pseudo-withdrawal mechanism for ETH stakers, their utility has not been maximized due to low utilization in DeFi. This lack of utilization is potentially due to frequent de-pegs between the LST and ETH, which makes liquidation a real concern during volatile times. As LSTs continue to grow and take center stage in the Ethereum ecosystem, we can expect to see more DeFi protocols integrating LSTs into their platforms, thereby increasing opportunities for LST holders to utilize their tokens.\n\nWrapping up\n\nIn conclusion, the Shapella upgrade, which includes both the Shanghai and Capella upgrades, was a much-needed update to Ethereum. The Shanghai upgrade has provided validators with the ability to withdraw their staked ETH, enabling them to re-stake their rewards, compound their yield, reallocate their staking positions, and reduce liquidity risks.\n\nThe ability to withdraw staked ETH has significant positive implications for Ethereum's DeFi ecosystem and will usher in a new era for staked ETH. We anticipate increased staking participation among ETH holders and greater innovation in staking solutions. By monitoring key data points, we will gain a deeper understanding of the upgrade's impact and the future of ETH staking over time."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vdS50b2RheS9jYXJkYW5vcy1kamVkLWRlcGxveXMtb24tZXRoZXJldW0tY29tcGF0aWJsZS1zaWRlY2hhaW4tZGV0YWlsc9IBUmh0dHBzOi8vdS50b2RheS9jYXJkYW5vcy1kamVkLWRlcGxveXMtb24tZXRoZXJldW0tY29tcGF0aWJsZS1zaWRlY2hhaW4tZGV0YWlscz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Apr 2023 07:00:00 GMT",
        "title": "Cardano's Djed Deploys on Ethereum-Compatible Sidechain: Details - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nDjed Alliance, the steward of Djed stablecoin protocol, has announced that a new deployment of the Djed stablecoin protocol is now live on Milkomeda-C1, the EVM-compatible sidechain of Cardano.\n\nAdvertisement\n\nA new deployment of the Djed stablecoin protocol is now live on Milkomeda-C1!\n\n\n\nKeep reading this thread to learn more about it…\n\n\n\n(@Milkomeda_com @NicoArqueros @SebastienGllmt @sir_mimok) (1/17) pic.twitter.com/bIUHf0tN3t — Djed Alliance (@DjedAlliance) April 28, 2023\n\nThis would mark its third deployment and, more significantly, its first deployment on Solidity, the main programming language for writing smart contracts for the Ethereum blockchain. The new deployment is expected to create room for its expansion to several additional EVM-compatible blockchains.\n\nIn January of this year, the Djed stablecoin went live on the mainnet and has since shown growth in its utility.\n\nAnother significant development is that Dead Pxlz, a non-fungible token (NFT) project, will soon launch a new game in the Cardano ecosystem.\n\nDead Pxlz is using the Paima Engine, according to a tweet from Paima Studios, the company that created it, to produce the upcoming PXL Wars game.\n\nRecent developments in Cardano ecosystem\n\nCardano builder IOG has published its most current weekly report, which highlights ecosystem developments.\n\nThe Hydra team investigated adding Hydra support to Kupo, worked on resolving state machine continuity on-chain and considered voting project possibilities. To prepare for the 0.10.0 release, the team also updated some dependencies and rectified a few problems in the test suites.\n\nThe Conway ledger era development and CIP-1694 have both seen additional progress over the past two weeks from the ledger team. Conway now supports Plutus v3 in particular, and CIP-1694 is the first version of Cardano's on-chain governance. Achieving widespread consensus is essential as Cardano looks to the future, given its significance."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vY29pbmdhcGUuY29tL3BvcHVsYXItYW5hbHlzdC1wcmVkaWN0cy1sb29taW5nLWV0aGVyZXVtLXByaWNlLWFuZC1hbHRjb2lucy1jcmFzaC_SAVxodHRwczovL2NvaW5nYXBlLmNvbS9wb3B1bGFyLWFuYWx5c3QtcHJlZGljdHMtbG9vbWluZy1ldGhlcmV1bS1wcmljZS1hbmQtYWx0Y29pbnMtY3Jhc2gvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Apr 2023 07:00:00 GMT",
        "title": "Popular Analyst Predicts Looming Ethereum Price and Altcoins Crash - CoinGape",
        "content": "Bitcoin price witnessed sharp volatility this April as the bear market comes to an end and Bitcoin prepares for the Bitcoin halving event. While traders anticipate upcoming bullish run amid the banking crisis, U.S. debt-ceiling crisis, and weakening macro, the outlook for Ethereum price and altcoins remains weak.\n\nEthereum price has mostly been under pressure after the Shanghai (Shapella) upgrade as all platforms slowly opened staked ETH withdrawals. The largest liquid staking platform Lido is expected to open withdrawals at the end of May.\n\nadvertisement\n\nEthereum Price and Other Altcoins Under Selling Pressure\n\nPopular analyst Michael van de Poppe shared his new analysis on altcoins on April 29 as the month comes to an end, with Bitcoin and Ethereum prices need to break key levels in order to maintain upside momentum.\n\nHe believes the bear market looming for Ethereum and altcoins as altcoins loses momentum against BTC and continues to fall. The collapse of First Republic Bank amid the brink of depression and recession will be huge trigger adoption of DeFi.\n\nOther news impacting the crypto prices includes the U.S. Fed rate hike decision, if Fed hike rates it will put addition pressure on the government and banks as they have to give more interest on the money they borrow. US Treasury Secretary Janet Yellen warned an economic catastrophe if the U.S. debt ceiling is not raised. The US House has passed the debt ceiling bill, and it now faces the Democratic-led US Senate hurdle.\n\nIn the weekly timeframe, Ethereum (ETH) against Bitcoin (BTC) is showing weakness and altcoins are in correction. ETH/BTC needs to break the 0.069 level for a bullish move and start an altcoin season. The resultant rally in Bitcoin above $30,000 will bring strength in the market and altcoins will follow suit, but BTC price needs to consolidate for ETH price to rally higher.\n\nMichael van de Poppe predicts BTC price reaching $50,000 in the next quarter as positive sentiment in the market considering macro weakness and bitcoin halving.\n\nAlso Read: Bitcoin Price To Hit $35000 As First Republic Starts Second Wave Of Banking Crisis"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0LzUtcmVhc29ucy13aHktZXRoZXJldW0tcHJpY2UtY2FuLXJlYWNoLTVrLWluLTIwMjMtYW5kLWxvdmUtaGF0ZS1pbnUtd2lsbC1yYWlzZS0xMC1taWxsaW9uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Apr 2023 07:00:00 GMT",
        "title": "5 reasons Why Ethereum Price Can Reach $5k in 2023, and Love Hate Inu Will Raise $10 Million - Analytics Insight",
        "content": "As the world becomes increasingly digitized, investing in cryptocurrencies like Ethereum (ETH) and Love Hate Inu ($LHINU) is becoming more popular than ever. Business people today have taken the opportunity to invest in cryptocurrency either as a way to increase their annual profits or as a means of savings. Both of these coins (ETH and LHINU) are projected to experience significant growth in the coming years, with Ethereum expected to surpass the $5,000 mark, and Love Hate Inu projected to raise $10 million in presales.\n\nFor an investor planning to invest in these coins but still needs clarification as to what benefits are present in investing in them, this is the article to read as brief explanations on these coins, and their potential to attain maximum growth would be given.\n\n>>>Buy LHINU Now<<<\n\nEthereum (ETH) – The Decentralized Token\n\nEthereum is a cryptocurrency and the most prominent blockchain platform. It is a blockchain where planning and decision-making regarding the cryptocurrency are distributed away from the central unit to the smaller factions (decentralized).\n\nThe native token of the platform is the ETHER coin. The coin gained its all-time highest value of about $4,800 in 2021, “the year of cryptocurrency,” where most cryptocurrencies gained their maximum value. Although the coin got a massive drop in value the following year due to the poor performance of cryptocurrencies all-around to a value of about $1,300, experts still believe the coin can gain its highest value ever since its creation before the year 2023 concludes, to be valued at $5,000 or even more after it managed to rise to above $2,000 in just the first quarter of the year.\n\n>>>Buy LHINU Now<<<\n\n5 Major Reasons ETH Price Can Reach $5,000\n\nPotential to grow high : It is no news that Ethereum is the second most popular cryptocurrency after Bitcoin. This fame is because of the high growth potential the coin has shown over the years since its creation.\n\n: It is no news that Ethereum is the second most popular cryptocurrency after Bitcoin. This fame is because of the high growth potential the coin has shown over the years since its creation. Social awareness : For a cryptocurrency to grow, people must know its features, benefits, and use cases. The more people know about the coin, the more they are likely to invest in it and use it to exchange or store value. Ethereum is one of the most popular cryptocurrencies and has high social awareness.\n\n: For a cryptocurrency to grow, people must know its features, benefits, and use cases. The more people know about the coin, the more they are likely to invest in it and use it to exchange or store value. Ethereum is one of the most popular cryptocurrencies and has high social awareness. Limited supply : One significant factor that affects the value of a cryptocurrency is the supply. This affects the value of cryptocurrency when the supply of the token is limited compared to its demands; hence, the value of such cryptocurrency will increase. Amongst cryptocurrencies that possess limited supply is Ethereum.\n\n: One significant factor that affects the value of a cryptocurrency is the supply. This affects the value of cryptocurrency when the supply of the token is limited compared to its demands; hence, the value of such cryptocurrency will increase. Amongst cryptocurrencies that possess limited supply is Ethereum. Interest from institutional investors : The social awareness created by Ethereum has gained interest from institutional investors looking to maximize their annual profits. These investors are known as big investors, who tend to invest significantly in the market.\n\n: The social awareness created by Ethereum has gained interest from institutional investors looking to maximize their annual profits. These investors are known as big investors, who tend to invest significantly in the market. Future potentials: Cryptocurrencies such as Ethereum have been speculated to be the next form of currency to be accepted worldwide. Unlike fiat currencies, this cryptocurrency would not be controlled by a government, leading to massive adoption.\n\nAlthough Ethereum seems to be heading for the $5,000 threshold soon, significant price drops in recent years can be unsettling for investors. During times of market volatility, some investors may look for a “safe haven” investment that can provide more stability and protection against market fluctuations. One such opportunity is Love Hate Inu, a relatively new cryptocurrency that has gained popularity.\n\n>>>Buy LHINU Now<<<\n\nLove Hate Inu ($LHINU) – Revolutionary V2E Project\n\nLove Hate Inu is a vote-2-earn meme coin that has gained popularity amongst investors since its creation in the crypto world. It is a meme coin based on people who want to give opinions on social platforms. It encourages and rewards people who share their opinions on different topics, either political, social, or entertainment based, provided by the platform. It is also a safe platform that protects its users and their opinions against criticism.\n\nSince the cryptocurrency is socially based, it attracts the interest of many people who are also likely to promote it on other social platforms, making it a more fun platform and an ideal project to invest in. Although the cryptocurrency is still in its presale stage, the project raised more than $4.5 million just a few days after its launch.\n\n>>>Buy LHINU Now<<<\n\nThis is an impressive feat for a relatively new token, which shows how the market has reacted positively towards the project. Market analysts have predicted that the token will raise $10 million in the coming weeks, so now is the best time for investors to load their bags with $LHINU tokens.\n\n>>>Buy LHINU Now<<<\n\nHow you can purchase the $LHINU token\n\nTo purchase $LHINU tokens, you can follow a simple process. First, visit the Love Hate Inu website and click the “BUY NOW” button. This will open a popup window prompting you to connect your Metamask or any other compatible cryptocurrency wallet to the website. To buy $LHINU tokens, ensure that your wallet is funded with USDT, which you will use to purchase the tokens, and Ethereum to pay for gas fees.\n\nAfter completing the purchase, you will need to wait until the presale period ends. At this point, you will receive your tokens automatically, or you may need to return to the website to claim them.\n\n>>>Buy LHINU Now<<<\n\nConclusion\n\nInvesting in cryptocurrencies like Ethereum and Love Hate Inu ($LHINU) can be profitable for investors. Ethereum, the second most popular cryptocurrency after Bitcoin, has shown high growth potential over the years and is expected to reach the $5,000 mark in 2023 due to limited supply, social awareness, interest from institutional investors, and future potential.\n\nOn the other hand, Love Hate Inu, a relatively new token, has gained popularity in the market due to its social-based approach, and the project has raised more than $3.5 million during its presale stage. Market analysts predict that the token will raise $10 million in the coming weeks, making it an attractive investment option for those who want to maximize their profits.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDQvMjgvc29sYW5hLWNyeXB0b2N1cnJlbmN5LW91dHBlcmZvcm1zLWJpdGNvaW4tYW5kLWV0aGVyZXVtLXl0ZC1tYWQtbGFkcy_SAW5odHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzA0LzI4L3NvbGFuYS1jcnlwdG9jdXJyZW5jeS1vdXRwZXJmb3Jtcy1iaXRjb2luLWFuZC1ldGhlcmV1bS15dGQtbWFkLWxhZHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Apr 2023 07:00:00 GMT",
        "title": "Solana has outperformed Bitcoin and Ethereum since January thanks in part to Mad Lads NFTs - Fortune",
        "content": "While all eyes are on Bitcoin’s creep toward $30,000 and Ether’s double-digit year-to-date jump, another cryptocurrency has quietly surpassed the gains of both since the start of the year.\n\nSolana, or SOL, the native token of the Solana blockchain, has shot up 133% since trading at just $10 on Jan. 1, continuing to shrug off any reputational hit from being associated with Sam Bankman-Fried. Meanwhile, Bitcoin is up 78% and Ether is up just over 50% over the same period.\n\nWhile Solana’s market capitalization sank to $5.3 billion the day after FTX declared bankruptcy, it has since recovered 72% to $9.1 billion. It was up 3% over 24 hours on Friday afternoon, trading at $22.86. Bitcoin and Ether were both down about 1%, at $29,300 and $1,800, respectively, according to CoinMarketCap.\n\nThe number of successful transactions on the Solana blockchain rose to 713 million in March—the most since October—according to data tracker FlipSide. The total number of transactions is still down year over year largely due to a lagging bear market.\n\nThe Solana blockchain, which backs the Solana cryptocurrency, pitches itself as a faster and cheaper alternative to the Ethereum blockchain, still the most popular for decentralized apps such as NFT marketplaces and financial applications.\n\nBut Solana’s pitch as an “Ethereum killer” has hit some snags, including a number of recent outages and slowdowns. In February, a performance disruption resulted in issues with transactions and caused validators, who verify transactions on the blockchain, to restart the network to resolve the problem. Solana also faced a setback in the NFT space earlier this year when two of its most popular collections, y00ts and DeGods, left the blockchain.\n\nAustin Federa, head of strategy for the Solana Foundation, previously told Fortune he wasn’t concerned about the projects leaving.\n\nJust a month after losing those collections, a new project, Mad Lads, is bringing some excitement back to Solana NFTs. The collection, created by the Web3 company Coral—cofounded by Solana developer Armani Ferrante—launched this week and has already become the most traded NFT with the highest sales volume over the past seven days, according to Crypto Slam.\n\nCompared with $11.4 million for Yuga Labs’ Bored Ape Yacht Club collection, Mad Lads generated $17 million in sales over the last seven days, according to Crypto Slam. The Mad Lads trading frenzy also helped the Solana blockchain stay just above Polygon in number of transactions over the past week, according to Crypto Slam, even as Starbucks and other big companies flocked to the latter blockchain.\n\nMad Lads is one of the first of a new type of non-fungible token called executable NFTs, or xNFTs. While most NFTs are tied to centralized websites to provide the experiences they promise, xNFTs allow for built-in functionality. It could allow a game developer, for example, to mint an entire game as limited-edition xNFTs. For Mad Lads, the pictures act as a chat room for users that’s rendered entirely within the NFT, thanks to Coral’s new crypto wallet, Backpack, Federa wrote in a blog post.\n\nFedera said Mad Lads’ launch is proof that Solana’s more flexible NFT technology is a boon for entrepreneurs and creators.\n\n“NFTs on Solana has always been a little bit different than other chains,” Federa told Fortune. “There’s this sort of relentless innovation and a drive to experiment.”"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1ldGgtc2hhcmtzLWFuZC13aGFsZXMtYXJlLW5vdC1iYWNraW5nLWF3YXktZnJvbS10aGUtY29pbi1oZXJlcy13aHkv0gFmaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2V0aGVyZXVtLWV0aC1zaGFya3MtYW5kLXdoYWxlcy1hcmUtbm90LWJhY2tpbmctYXdheS1mcm9tLXRoZS1jb2luLWhlcmVzLXdoeS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Apr 2023 07:00:00 GMT",
        "title": "Ethereum [ETH] sharks and whales are not backing away from the coin, here’s why - AMBCrypto News",
        "content": "Addresses holding more than 1,000 ETH accumulated more of the altcoin.\n\nETH nears $2,000 but overall activity on the network reduced.\n\nDespite being 33.93% down in the last year, Ethereum [ETH] whales and sharks seem to have found no good reason to deter from accumulating the coin. According to on-chain data, the number of addresses holding 1,000, or more ETH increased to 7091, representing a 5.7% rise.\n\nRealistic or not, here’s ETH’s market cap in BTC terms\n\nFurthermore, this action suggested that this group of holders has a long-term bullish outlook, even amid short-term price fluctuations.\n\nUp to the daunting task\n\nAlthough the price remained relatively stable over the past few months, the Ethereum blockchain itself was involved in a series of significant upgrades.\n\nAnd usually, when investors perceive that a particular development depicts remarkable improvement, they tend to stick with the project and contribute more. So, this could have also enabled the decision to accumulate.\n\nHowever, data from Santiment showed that Ethereum’s development activity has subdued. At press time, the metric was down to 53.\n\nFor context, the development activity measures the commitment of developers to polish the working system of a project. Therefore, the value mentioned above implies that major innovation around the Ethereum blockchain has slowed down.\n\nBut it was an entirely different scenario with the Market Value to Realized Value Ratio (MVRV). At press time, the 365-day MVRV ratio of Ethereum was at 22.79%. This means that the sharks who were committed to buying ETH made more in profits over the last year.\n\nAt the same time, the current metric condition could serve as an obstruction to a further hike if ETH pushes upwards. However, there were talks of a bull market resumption which could negate speculation around ETH being overvalued at the MVRV spot.\n\nSometimes, appearances are deceptive\n\nWhile whales have turned to spot buying opportunities, the overall market did not share the same sentiment. This was because the active addresses in the last 30 days dropped from 7.9 million to 5.8 million.\n\nActive addresses indicate the daily level of participation and speculation around a token. Therefore, the decrease is a reliable indication that activity has slowed down on the Ethereum network. Often time, this serves as a signal that the general interest in a cryptocurrency is low.\n\nRead Ethereum’s [ETH] Price Prediction 2023-2024\n\nWith respect to circulation, it was not surprising that ETH tremendously fell for most of 2022. However, the condition at the time of writing showed an improvement.\n\nAt 46.8 million, the rise in circulation signifies an increase in the use of ETH. The coin exchanged hands at $1,800, a 4.41% increase in the last 24 hours."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vbWFya2V0cy5idXNpbmVzc2luc2lkZXIuY29tL25ld3MvY3VycmVuY2llcy9iaXRjb2luLXByaWNlLW91dGxvb2stdXMtZGVmYXVsdC1kZWJ0LWNlaWxpbmctY3Jpc2lzLWV0aGVyZXVtLXByaWNlLTIwMjMtNNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Could Jump Nearly 70% If the US Defaults: Standard Chartered - Markets Insider",
        "content": "Bitcoin could climb by $20,000 if a US default happens, Standard Chartered's Geoff Kendrick said.\n\nNot every crypto would act similarly, with some behaving more like equities, he told Insider.\n\n\"So actually, the optimal trade would probably be long bitcoin, short ethereum.\"\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nWith the looming debt ceiling crisis showing no signs of a resolution, both bond and equity markets have become jittery.\n\nBut while some investors are fearful of a historic default, one asset could potentially rise through such a situation: Bitcoin.\n\nDescribing a US default as a \"low-probability, high-impact event,\" Geoff Kendrick, head of FX research at Standard Chartered, said it may cause the bitcoin to jump by about $20,000, representing an increase of 68% from current levels.\n\nHe told Insider that's because the top cryptocurrency by market cap has a reputation for performing well in periods of stress and is often seen as a safe haven, especially as it is a decentralized asset.\n\nAdvertisement\n\nBut Kendrick doesn't think bitcoin would rally in a straight line in the event of a US default, saying \"it probably comes a bit lower on day one or day two or week.\" In that case, bitcoin could dip by $5,000 initially, then jump by $25,000, he estimated.\n\nAnd not every cryptocurrency would follow bitcoin's behavior, he added, with others like ethereum trading more like stocks, which would likely fall in a default.\n\n\"So actually, the optimal trade would probably be long bitcoin, short ethereum. That sort of mix would probably be a good expression of this,\" Kendrick said.\n\nIf Congress fails to lift the $31.4 trillion federal debt limit, a default could come sometime in the summer — an event that could cause seismic ruptures global markets. On Tuesday, Treasury Secretary Janet Yellen warned a default would be catastrophic for the US economy, sparking mass unemployment, payment failures, and higher rates \"into perpetuity.\"\n\nAdvertisement\n\nWith House Republicans and the White House still far from a deal to raise the debt ceiling, yields on three-month Treasurys recently jumped to a 22-year high, as they would mature around a potential default date.\n\nMeanwhile, bitcoin is still recovering from a massive sell-off that began in late 2021 and continued through much of 2022 as the Federal Reserve embarked on an aggressive tightening cycle.\n\nBut bitcoin has rallied nearly 80% so far in 2023 and recently neared $30,000 as First Republic Bank's woes reignited fears over the financial sector.\n\nFor his part, Kendrick is already bullish on bitcoin, saying in a note on Monday that it could surge to $100,000 by the end of 2024 due to bank turmoil, bitcoin halving, and the expected end of Fed rate hikes, among other things, though it didn't mention the risk of a US default.\n\nAdvertisement\n\n\"While sources of uncertainty remain, we think the pathway to the USD 100,000 level is becoming clearer,\" he wrote."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vdGhlZ3d3LmNvbS9wb2x5Z29uLWxhYnMtYW5kLWdvb2dsZS1jbG91ZC1qb2luLWZvcmNlcy10by1ib29zdC1ldGhlcmV1bS1lY29zeXN0ZW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Apr 2023 07:00:00 GMT",
        "title": "Polygon Labs and Google Cloud Join Forces to Boost Ethereum Ecosystem - Geeks World Wide",
        "content": "Executive Summary: Polygon Labs and Google Cloud have formed a multi-year partnership to enhance the development of Ethereum scaling protocol infrastructure and tools, aiming to simplify the development process for Web3 products and DApps and advance the growth of the Ethereum ecosystem.\n\nPartnership Overview\n\nGoogle Cloud and Polygon Labs have announced a strategic partnership to bolster the development of Ethereum scaling protocol infrastructure and tools, benefiting the Ethereum ecosystem. Revealed at Consensus 2023, the collaboration will focus on leveraging Google Cloud’s framework and developer tools to improve Polygon’s core protocols, including Polygon PoS, Polygon zkEVM, and Polygon Supernets, ultimately simplifying the development process for Web3 products and decentralized applications (DApps) on Polygon.\n\nGoogle Cloud’s Blockchain Node Engine Integration\n\nThe partnership will utilize Google Cloud’s Blockchain Node Engine to assist the Polygon ecosystem with time-consuming and costly processes associated with acquiring, maintaining, and operating dedicated blockchain nodes. This will eliminate the need for Polygon developers to configure and run Polygon PoS nodes. Additionally, the partnership is expected to advance Polygon’s zero-knowledge development and further promote the adoption of blockchain technology by helping developers create more efficient, cost-effective, and scalable decentralized applications.\n\nAdvancements in Polygon zkEVM Beta\n\nLaunched in March 2023, the Polygon zkEVM beta is an Ethereum Virtual Machine (EVM) scaling solution designed to reduce transaction costs and increase smart contract deployment throughput. Google Cloud’s collaboration with Polygon is anticipated to result in faster and cheaper transactions compared to existing infrastructure.\n\nPolygon’s Role in the Ethereum Ecosystem\n\nAs a leading Layer 2 in the Ethereum ecosystem, Polygon offers scaling solutions and infrastructure to assist developers in building and launching DApps. The partnership with Google Cloud will enable Polygon to expand its offerings and deliver even greater value to its users.\n\nWrappingUp\n\nTo sum it all up, the alliance between Polygon Labs and Google Cloud marks a significant milestone for the Ethereum ecosystem and Polygon in particular. With Google’s support, Polygon is well-positioned to lead blockchain technology development and adoption as more mainstream companies make the leap to Web3."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNC8yOC9nb29nbGUtY2xvdWQtcGFydG5lcnMtd2l0aC1wb2x5Z29uLW1hdGljLXRvLWhlbHAtZGV2ZWxvcGVycy1idWlsZC1vbi10aGUtZXRoZXJldW0tc2NhbGluZy1zb2x1dGlvbi_SAYgBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDQvMjgvZ29vZ2xlLWNsb3VkLXBhcnRuZXJzLXdpdGgtcG9seWdvbi1tYXRpYy10by1oZWxwLWRldmVsb3BlcnMtYnVpbGQtb24tdGhlLWV0aGVyZXVtLXNjYWxpbmctc29sdXRpb24vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Apr 2023 07:00:00 GMT",
        "title": "Google Cloud Partners With Polygon (MATIC) To Help Developers Build on the Ethereum Scaling Solution - The Daily Hodl",
        "content": "Google Cloud and Polygon (MATIC) developer Polygon Labs are teaming up for a new initiative that could boost the expansion of the world’s largest blockchain ecosystem.\n\nPolygon says that the partnership will make it easier for developers to build, launch and grow Web3 products and decentralized applications on the protocols of the layer-2 scaling platform.\n\n“Today at Consensus 2023, Google Cloud and Polygon Labs announced a multi-year strategic alliance to accelerate adoption of core Polygon protocols, including Polygon PoS (point of sale), Polygon Supernets, and Polygon zkEVM, with Google Cloud infrastructure and developer tools.”\n\nThe new agreement will see Google Gloud bringing its fully managed node hosting service Blockchain Node Engine to the Polygon ecosystem. When this happens, developers will no longer need to configure or run their own nodes.\n\nPolygon says the development will diversify cloud services across its network.\n\n“Google Cloud will help accelerate adoption of core Polygon protocols w/ enterprise infrastructure & tools. Strategic alliance to increase transaction throughput enabling use cases in gaming, supply chain & DeFi (decentralized finance) on Polygon.”\n\nPolygon Labs president Ryan Watt is also optimistic that Google Cloud’s support of Polygon will onboard more people into Web3.\n\n“Thrilled as a Google alumni to share that Google Cloud is going all in with Polygon! This accelerates the adoption of core Polygon protocols using Google’s infrastructure and tools, transforming the blockchain landscape forever.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiImh0dHBzOi8vdGhlZGVmaWFudC5pby93aGF0LWlzLWNvcmXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Apr 2023 13:02:26 GMT",
        "title": "What Is Core? [Sponsored] - The Defiant - DeFi News",
        "content": "Sponsored\n\nMore Than Just Your Average Crypto Wallet & Portfolio\n\nBy: Rahul Nambiampurath • Loading...\n\nDeFi Explainers\n\nAfter the FTX meltdown, everyone had a crash course on self-custodial wallets. But not all are created equal. Core wallet emerged from the Avalanche ecosystem, offering full Bitcoin, Ethereum, and EVM chain support in addition to Bitcoin and Ethereum bridging. And this is just the beginning of Core’s holistic approach to the fusion of legacy coins and a seamless Web3 experience.\n\nCore’s Three Facets\n\nCore wallet. Source: Official website\n\nMetaMask gained popularity by counting on the convenience of browser extensions. As such, it made DeFi’s dApps within reach of a few clicks, alongside regular internet browsing. But the experience is not full unless all bases are covered.\n\nThis is why Core employs a tri-part approach to accessing DeFi and viewing portfolios, the precious online treasures:\n\nCore web: For users who want the broadest view of their assets, including NFTs, access to dApps, Web3 educational content and developer tools, start here. Core web is an all-in-one Web3 command center that abstracts away typical obstacles.\n\n\n\nThe best part? Core web connects with ALL wallets and lets you seamlessly swap, send, and receive crypto and NFTs alongside a beautiful dashboard view of your portfolio. However, to access additional features like the Avalanche Bridge (where you can bridge Bitcoin for BTC.b and Ethereum for WETH.e on the Avalanche network), users are encouraged to download Core wallet on mobile or Chrome extension.\n\nCore extension: Going beyond the regular self-custodial wallet, this browser extension also boasts an in-built blockchain explorer and bridge. It uses native ERC-20 and BTC bridging just as well as bridging assets across the Avalanche Subnets. Likewise, Core extension allows direct token swaps thanks to ParaSwap integration.\n\n\n\nUsers can buy AVAX directly from Core, via credit card through MoonPay or with their Coinbase account. Core makes it easier to transact across multiple chains by eliminating the need to switch networks every time you change chains, setting a new standard for transaction signing UX. Unlike other EVM only compatible browser extensions, Core is Bitcoin compatible, so you can HODL and participate in DeFi at the same time.\n\n\n\nLastly, Core extension can be plugged into Ledger hardware wallets, in addition to creating multiple addresses under the same seed/recovery phrase.\n\nCore mobile: What would be a Web3 wallet without a smartphone app? Core is available both on Android and iOS, providing the same features as Core extension. Keep track of price movements with Core’s watchlist, send and receive NFTs and the Avalanche Bridge on-the-go. Plus, Core mobile also has integrated WalletConnect for easy dApp access.\n\nCore Is All About Bridging\n\nThe Avalanche Bridge, available exclusively on Core, is a cross-chain solution enabling seamless asset transfers between blockchain networks such as Ethereum for WETH.e and Bitcoin for BTC.b. Its user experience features, such as the post-transaction flow, allow users to track every moment of the transfer process.\n\nThe bridge’s advantages over Wrapped Bitcoin (WBTC) and Wrapped Ethereum (WETH) include:\n\nSeamless bridging: The Avalanche Bridge offers a more efficient and cost-effective solution for transferring tokens between networks compared to WBTC and WETH.\n\nThe Avalanche Bridge offers a more efficient and cost-effective solution for transferring tokens between networks compared to WBTC and WETH. Minuscule cost: Users can bridge between Bitcoin and Avalanche at a low cost, making it attractive for earning yield through DeFi on BTC holdings.\n\nUsers can bridge between Bitcoin and Avalanche at a low cost, making it attractive for earning yield through DeFi on BTC holdings. Enhanced liquidity: BTC.b on Avalanche eliminates fragmented liquidity, enabling users to interact with dApps and easily convert BTC.b back to native Bitcoin.\n\nThe Avalanche Bridge facilitates asset transfers between different blockchain networks, promoting cross-chain collaboration and interoperability.\n\nCore and Avalanche Subnets\n\nIn addition to Avalanche Bridge transfers, Core wallet is the only product to support Avalanche Subnets. Subnets are application-specific blockchains that live in parallel to the Avalanche C-Chain, each with its own set of validators, transaction fees, and governance rules.\n\nAvalanche’s horizontally scaling architecture creates an enterprise-grade network with both high-performance and ultra-low fees.\n\nBy natively supporting Avalanche Subnets, Core can interact with each one, executing transactions without needing additional software or third-party integrations. Taken as a whole, this makes Core highly flexible, with unparalleled (pun intended) interoperability with dApps across the Avalanche ecosystem.\n\nLastly, Core has preloaded Subnets. This is an extra convenience layer, as the user doesn’t have to manually configure the connections. As a result, Core wallet provides easy access to DeFi protocols, effectively breaking barrier-to-entry and increasing the adoption of Avalanche Subnets.\n\nCore: The Next Gen Web3 Wallet\n\nNavigating through the fragmented Web3 complexities can be off putting and tiresome. Certainly, not something to be called ready for mass adoption.\n\nCore taps into that demand by allowing users to focus on what they want to do, not how and where to do it. Computer enthusiasts from the 1990s era may already know the feeling. Built with this user empathy in mind, Core unifies and optimizes the Web3 journey.\n\nAs consumers become less willing to share personal data, the crypto wallet becomes the gateway for sovereign ownership of identity. Core is the digital operating system for the next generation, leading the way in decentralized technology for finance, DeFi, art, and more, from government to enterprise. The best part of Core web is that it is compatible with ALL crypto wallets. For users who are ready to take control of their assets and unlock the full potential of the platform, create a wallet with Core mobile or extension. Whether you’re a crypto enthusiast, NFT collector, or a newbie, Core has something for you.\n\nTo start utilizing Core, simply visit Core.app and link your preferred wallet. If you require a wallet, Core is available for download on the Apple App Store, Google Play Store, or Chrome Web Store.\n\nNote: This explainer was sponsored by Core\n\nSeries Disclaimer:\n\nThis series article is intended for general guidance and information purposes only for beginners participating in cryptocurrencies and DeFi. The contents of this article are not to be construed as legal, business, investment, or tax advice. You should consult with your advisors for all legal, business, investment, and tax implications and advice. The Defiant is not responsible for any lost funds. Please use your best judgment and practice due diligence before interacting with smart contracts."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmJpdGNvaW5zZW5zdXMuY29tL2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tZGFpbHktMjktYXByaWwtdXJnZW50LWV0aC1pbnZhbGlkYXRpb24tcG9pbnQtZm9yLXRoaXMtYmVhcmlzaC1zY2VuYXJpby_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction Daily (29-April): Urgent! ETH Invalidation Point For This Bearish Scenario. - Bitcoinsensus",
        "content": "Ethereum price prediction from a previous analysis Urgent! This Could Be The Final Move For The ETH Head and Shoulders Pattern\n\nIn our previous Ethereum analysis Urgent! This Could Be The Final Move For The ETH Head and Shoulders Pattern We identified the potential Head and Shoulders Pattern that was forming in the 4-hour timeframe and broke down what we needed to see happen in the coming days to confirm the start of the Altcoin price sell-off.\n\nWell, that bearish Head and Shoulders Pattern is still playing out exactly! However, in this Ethereum analysis, we will be breaking the invalidation point the ETH bears need to protect at all costs if they want to see this ETH sell-off play out in the coming days.\n\nTo trade ETH with leverage, sign-up to Bybit right now! Bybit’s BIGGEST Bonus Campaign is now live! You can get up to a $30,000 Bonus when you fund your Bybit account with our Bybit link\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nETH $2,152 Invalidation Point!\n\nUrgent! Watch this ETH Invalidation Point For This Bearish Scenario. Can the bears defend this 4-hour resistance?\n\nThe invalidation point for this bearish Head and Shoulders Pattern currently playing out in the 4-hour timeframe is the $2,152 previous highs!\n\nFor the Ethereum price to remain bearish and for this Head and Shoulders pattern to remain valid, we need to see the Ethereum bears continue to defend this $2,152 price level at all costs.\n\nA bullish price break above this $2,152 resistance level in the 4-hour timeframe only means a possible change in the direction of the Ethereum market from bearish to bullish.\n\nIn the coming days, we will be keeping a close eye on this $2,152 key resistance level to see if the ETH bears can continue to defend it.\n\nFinal Verdict!\n\nUrgent! Watch this ETH Invalidation Point For This Bearish Scenario. Can the bears defend this 4-hour resistance?\n\nFor now, we are still bearish on Ethereum and believe there is a very high probability for us to see an ETH sell-off play out in the coming days.\n\nThe key pattern we are tracking to support this bearish bias is the Head and Shoulders Pattern currently playing out in the 4-hour timeframe.\n\nThis bearish pattern will continue to remain valid as far as the ETH price respects and continues to trade below the $2,152 key resistance in the 4-hour timeframe.\n\nIf the Ethereum price breaks above this previous high, this would create a higher-high price action and mean the end of the bearish bias for Ethereum.\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nHow to Trade Bitcoin (BTC)?\n\nTo understand the basics of Bitcoin trading, you can read our How To Trade Bitcoin Guide. It can prove helpful for traders who are just getting started with Bitcoin trading. You can also check out our list of top Bitcoin Exchanges To Trade With.\n\nPrimeXBT Covesting: Trade Hassel Free\n\nSign-up on PrimeXBT today to trade Bitcoin hassle-free. You can copy experienced traders and access hundreds of different strategies on the platform! Don’t forget to claim your 25% bonus by using the promo code “bitcoinsensus50” when you sign-up with our link PrimeXBT Covesting"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LnNlY3VyaXRpZXMuaW8vcmVuZGVyLXJuZHItY29udGludWVzLWhvdHN0cmVhay1hcy1wcmVwYXJhdGlvbnMtYmVnaW4tZm9yLXRyYW5zaXRpb24tZnJvbS1ldGhlcmV1bS10by1zb2xhbmEv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Apr 2023 07:00:00 GMT",
        "title": "Render (RNDR) Continues Hotstreak as Preparations Begin for Transition from Ethereum to Solana - Securities.io",
        "content": "Over the past week, few projects have performed as well as Render (RNDR). With powerful GPUs more commonplace now than ever before, Render provides owners with the ability to contribute processing power when not in use. This provides owners with a modest means of passive income, made possible through the RNDR token, while simultaneously giving content creators access to rendering services through the distributed network – saving time, and money along the way.\n\nWith the rise of the metaverse and rendering needs across a variety of industries, this has unsurprisingly resulted in Render garnering quite a bit of attention as of late; which brings us to why RNDR has been spiking – community agreeance on preparation for future demand.\n\nSolidity Out, Rust In\n\nFor Render to scale its network, and prepare for its anticipated future demand, developers behind the project noted that a shift away from Solidity and the Ethereum network was needed. With this in mind, developers put forth a proposal to the Render community that would see the project transition towards building its network with Rust atop the Solana network instead.\n\nWhen it put forth this proposal, stated to have been generated after an ‘exhaustive review' of options, the developers explained that,\n\n“The Render Network has been built with a goal towards providing real-time, rendered, interactive holographic streams. This will require states to be updated dynamically, in real-time and on-chain. To do so, the network needs to be able to write high-performance code both on-chain and on GPUs. Rust can provide the Render Network greater speed and flexibility than Solidity, ultimately permitting the use of the same code for GPU render work and smart contracts. Further, the Solana virtual machine can process both C++ or Rust code and turn that into a smart contract.”\n\nIt was recently announced that the voting period for this proposal, known as ‘RNP-002', had come to an end. The result? An overwhelming ~4,800,000 voting yay, with a mere ~36,000 voting nay.\n\nIt should be noted that while nearly 5,000,000 eligible voters took part in the process, a whopping 167,000,000 did not.\n\nMarket Response\n\nBeing burdened by growth is a good problem to have. It shows both interest and demand for what Render has to offer, and with the passing of recent proposals (ie. RNP-002), it appears as though those responsible for the project are up to the task of scaling its services. The Render community appears to have recognized this, with RNDR trading accordingly.\n\nNot only is RNDR up 6% on the day, at time of writing, it is boasting gains north of 40% on the week. As it stands, the majority of trading volume for RNDR takes place on two exchanges – Binance, and Hotcoin Global.\n\nThe Front Runner\n\nWhile Render has been around for years now, having launched in 2017, it was not actually the first project to hit the market offering access to distributed computation. Another, which seasoned market participants may recognize, goes by the name of Golem.\n\nHowever, in the years since, a clear front runner between the two has emerged – Render. While Golem had its time in the spotlight years ago, it has slowly faded from prominence, retreating to the 141st largest project by marketcap, while Render has continue to rise to 59th at time of writing.\n\nTo learn more about this project, make sure to visit our Investing in Render guide."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL3RlY2hwb2ludC5hZnJpY2EvMjAyMy8wNC8yOC90b2tlbi1wcmljZS1wcmVkaWN0aW9ucy1mb3ItZXRoZXJldW0tY2xhc3NpYy1ldGMtYW5kLW5lYXItcHJvdG9jb2wtbmVhci1jYW4tdXdlcngtd2VyeC1wcmVzYWxlLW92ZXJ0YWtlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Apr 2023 07:00:00 GMT",
        "title": "Token Price Predictions for Ethereum Classic (ETC) and NEAR Protocol (NEAR) – Can Uwerx (WERX) Presale ... - Techpoint Africa",
        "content": "Meta: Deciding on Ethereum Classic, Near Protocol and Uwerx? Read on to know crypto analysts predictions for the two. Learn why Uwerx presale is the perfect opportunity to invest for potential profits and how you can invest in it too.\n\n2023 is turning out to be productive for Ethereum Classic (ETC) and NEAR Protocol (NEAR). But with many investors looking for better opportunities, they are increasingly searching for future jackpots.\n\nAs such, Uwerx has captured the attention of crypto investors due to its price predictions. Its presale is already in progress and gaining traction.\n\nUwerx (WERX) Powering Presale\n\nOpen to all, the WERX is a hot token in the trading and freelancing community. Analysts expect it to grab a fair share of the gig economy. Many are confident that WERX will break the $1 barrier in Q3 this year.\n\nConsidering the ongoing presale of WERX is for just $0.0075,, traders are expecting a 9,900% profit, which is probably going to be the best-performing asset this year.\n\nEthereum Classic (ETC) in the $30s Range\n\nEthereum Classic (ETC) has risen quickly this year from $19.47 to $22.43. The performance for Ethereum Classic (ETC) is expected to rise more, but swing in the $30s range. Ethereum Classic (ETC) price prediction says it will fluctuate between $33.24 and $37.27.\n\nNot much gain for Ethereum Classic (ETC) but still, a price prediction that gives a 48% to 66% rise is not bad.\n\nNEAR Protocol (NEAR)’s Better Performance\n\nNEAR Protocol (NEAR) is an in-demand crypto, thanks to its faster transactions and higher throughput. Not as big as Ethereum Classic (ETC), but NEAR Protocol (NEAR) price predictions say it will be a better token. Already the NEAR Protocol (NEAR) has gone up 25% in one month.\n\nTraders are expecting it to reach around $4.39 in 2023, but NEAR Protocol (NEAR) can fall short and not surpass $3.79. Even then, the minimum price prediction is 44% growth, with the optimistic forecast shelling 67% profits for NEAR Protocol (NEAR) holders.\n\nUwerx (WERX) Liberating Freelancers\n\nThe gig economy seems unstoppable. Nearly half of all new freelancers say they view this move as a long-term career choice (As per Velocity Global report).\n\nWith the growth that defies the current global economic slowdown, freelancing is showing a constant increase in size. This is despite issues that freelancers are forced to endure.\n\nPlatforms like Upwork and Fiverr are known for their high commissions (up to 20%), slow payment release, and no concern for freelancer copyrights protection. Uwerx on the other hand liberates freelancers from these and other issues.\n\nThanks to its blockchain basis, it extends the same benefits of the technology to freelancers. Significantly efficient and no intermediaries help Uwerx reduce fees down to 5%. Decentralized, Uwerx doesn’t hold payments and these are instantly transferred to user wallets. This also includes eventual plan to remove transaction taxes.\n\nUwerx also has ensured the security of the platform, with dual but independent audits by InterFi Network and SolidProof. An important step has also been decided, where the taxes on transactions will be removed permanently.\n\nThough payments are in its WERX token, the highly anticipated value increase in conjunction with a token lock for 25 years by the development team (immediately after presale), gives strong fundamentals for it to stand amongst the largest cryptos.\n\nUwerx (WERX) Presale is Ongoing!\n\nWith the presale offering the lowest price for WERX, this is the best time to diversify and grab a future mainstream crypto token. The expected massive gains offer an opportunity that is hard to ignore, easily beating Ethereum Classic (ETC) and NEAR Protocol (NEAR).\n\nIf you are looking to benefit from WERX’s predicted rise from $0.0075, check out the links below to find out how you can benefit from a 25% purchase bonus :\n\nPresale: invest.uwerx.network\n\nTelegram: https://t.me/uwerx_network\n\nTwitter: https://twitter.com/uwerx_network\n\nWebsite: https://www.uwerx.network/"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY29pbmdhcGUuY29tL3dlYi1zdG9yaWVzL2NyeXB0b2N1cnJlbmN5LW1hcmtldC1zdXJnZXMtYXMtYml0Y29pbi1hbmQtZXRoZXJldW0tbGVhZC10aGUtd2F5L9IBY2h0dHBzOi8vY29pbmdhcGUuY29tL3dlYi1zdG9yaWVzL2NyeXB0b2N1cnJlbmN5LW1hcmtldC1zdXJnZXMtYXMtYml0Y29pbi1hbmQtZXRoZXJldW0tbGVhZC10aGUtd2F5Lw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Apr 2023 07:00:00 GMT",
        "title": "Crypto Market Surges as Bitcoin and Ethereum Lead the Way - CoinGape",
        "content": "Bitcoin's value rose by over 1.5 per cent to $29,479.. The market capi stood at $572 Billion, with a trade volume of $24.8 billion."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiOmh0dHBzOi8vd3d3LmNjbi5jb20vYml0Y29pbi1oYWx2aW5nLWJ1bGxpc2gtY3J5cHRvLW1hcmtldC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Apr 2023 07:00:00 GMT",
        "title": "Why the Bitcoin Halving is Bullish for Every Single Cryptocurrency - CCN.com",
        "content": "By CCN.com: The old adage “a rising tide lifts all boats” appears to be more applicable to the crypto market than perhaps any other asset class. Need proof? Just look at the resounding impact the looming bitcoin halving is having on virtually every major cryptocurrency.\n\nThe Halving is Bullish for the Bitcoin Price\n\nFor those who are not familiar, the bitcoin halving is a much-anticipated event in which BTC block rewards are reduced by 50 percent. One halving happens every four years.\n\nFrom an economic standpoint, the bitcoin halving is a bullish event because it significantly reduces the inflation rate of the asset that has a fixed supply of 21 million. The third halving will drop BTC’s annual issuance rate from 3.70 percent down to 1.79 percent, which is lower than the inflation rate of some wealthy nations. For instance, the inflation rate in the US is 1.90 percent.\n\nMarket participants have responded by frantically buying the asset after every halving event, as inflation rate decreases intensify demand pressure.\n\nIn the first halving, bitcoin’s price rose from $12.31 at the time of the halving to $994.21 a year later for a 7,976 percent rise. In the second halving, the price soared from $650 to $19,535 over a year later for a 2,902 percent surge.\n\nAlmost Every Cryptocurrency Benefits From Bitcoin Halvings\n\nWe looked at the altcoin market cap to see if other crypto tokens also benefited from the bitcoin halving. Unsurprisingly, other cryptocurrencies enjoyed significantly higher gains than BTC.\n\nDuring the first bitcoin halving, the altcoin market cap rose from $45.89 million in June 2013 to $2.02 billion by December 2013 for an increase of 4,302 percent. In the second halving, the altcoin market cap appreciated from $1.74 billion in December 2016 to an all-time high of $555.91 billion in January 2018 for a meteoric rise of over 31,849 percent.\n\nThere were other reasons for the market cap increases, and correlation does not mean causation. However, there is strong evidence to suggest that BTC halvings catalyze massive price increases across the overall crypto market.\n\nThe link between the bitcoin halving and the overall cryptocurrency market is strong. In fact, a 2019 analysis revealed that the prices and volume of cryptocurrencies are highly correlated. In other words, if bitcoin skyrockets, other cryptocurrencies are likely to follow suit. This led to the conclusion that “if you own one cryptocurrency, you own them all.”\n\nOther Factors That Drive Crypto Growth\n\nFurther research shows that cryptocurrency growth is also driven by two factors: media coverage and investor attention. One study on bitcoin and media hype concluded that returns are likely to be elevated when media outlets mention the cryptocurrency more frequently and when Google searches increase.\n\nThis phenomenon happened in 2017. Media coverage soared as bitcoin surged. As more articles chronicled bitcoin, more people searched for it on Google. The chart below shows how the weekly number BTC-related articles spiked while the cryptocurrency’s price climbed.\n\nIn addition, the number of searches for the term “bitcoin” on Google also spiked during the 2017 bull run, coinciding with the rising weekly number of articles.\n\nThe Bottom Line\n\nHistorically, bitcoin halvings ignite a strong upward cycle that lifts the overall cryptocurrency market. With the price of bitcoin climbing, media hype and investor attention balloon. The surge in investor attention likely leads to more people buying BTC and other cryptocurrencies. As prices increase, more articles are written, and the cycle continues.\n\nIn short, the bitcoin halving is a massive tide that lifts all boats.\n\nAnd the clock is ticking ."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZW4uZXRoZXJldW13b3JsZG5ld3MuY29tL3BheXBhbC1hbm5vdW5jZXMtdmVubW8tY3J5cHRvLXRyYW5zZmVyL9IBTGh0dHBzOi8vZW4uZXRoZXJldW13b3JsZG5ld3MuY29tL3BheXBhbC1hbm5vdW5jZXMtdmVubW8tY3J5cHRvLXRyYW5zZmVyL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Apr 2023 07:00:00 GMT",
        "title": "PayPal Announces New Venmo Crypto Transfer Feature Starting May 2023 - Ethereum World News",
        "content": "Summary:\n\nVenmo users in America will be able to send out crypto transactions to other users, on-chain wallets, and hardware wallets, PayPal’s digital currency general manager Jose Fernandez da Ponte said on Friday.\n\nPayPal, which acquired Venmo in 2013, released a similar feature for its users last year around June.\n\nOver 60 million users in America can expect the feature to roll out by May 2023, da Ponte noted today while speaking on a Consensus panel in Austin, Texas.\n\nPaypal, Venmo’s parent company, said on Friday at Consensus 2023, that cryptocurrency users will be able to make digital coin transfers to third-party wallets very soon. The four accepted cryptocurrencies on Venmo are Bitcoin, Ethereum, Litecoin, and Bitcoin Cash.\n\nPayPal Activates More Crypto Channels On Venmo\n\nAccording to the news shared today in Austin Texas, it will be available in the coming weeks starting in May 2023 and clients will be able to send cryptos to family and friends on the Venmo platform and other wallets in the crypto world. A similar feature has been available on Paypal since June 2022.\n\nNo matter where you are in your cryptocurrency journey, crypto on Venmo will help our community to learn ad explore cryptocurrencies on a trusted platform and directly in the app they know and love. Our goal is to provide our customers with an easy-to-use platform that simplifies the process of buying and selling cryptocurrencies and demystifies some of the common questions and misconceptions that consumers may have. – Darrell Esch, SVP and GM of Venmo.\n\nThe statement issued by the company notes that external transfers will be subject to network fees. The decision to open this service to its more than 90 million users, comes at the same time the crypto industry is being strictly regulated in the US. PayPal halted its stablecoin plans as the crackdown on crypto in America intensified.\n\nPayPal also has an inclination for making crypto-related announcements at Consensus."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vZGFpbHljb2luLmNvbS90cm9uLXRyeC1qdXN0aW4tc3VuLWRlY2VudHJhbGl6ZWQtaW50ZXJuZXQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Apr 2023 07:00:00 GMT",
        "title": "Tron (TRX): Justin Sun's Decentralized Internet - DailyCoin",
        "content": "The Tron crypto ecosystem continues to fly somewhat under the radar in the eternally competitive race to be the top Layer-1 blockchain. The cornerstone of Justin Sun’s cryptocurrency empire, the Tron blockchain holds more funds than Cardano (ADA), Solana (SOL), and Avalanche (AVAX) combined, but attracts far less hype and attention.\n\nWith over 150 million unique accounts, the Tron blockchain claims to be the world’s fastest-growing public blockchain. On paper, the Tron network is a perfect candidate to lead a decentralized internet revolution. The network is fast, affordable, and supports smart contract and dApp development, fitting the bill as a potential Ethereum (ETH) killer.\n\nWhat is Tron, and how does it work? Led by the Tron Foundation, can this scalable network separate itself from the fierce competition and fulfill its destiny to become a truly decentralized internet?\n\nWhat Is Tron (TRX)?\n\nTron is a Layer-1 blockchain network that aims to provide a frictionless and accessible decentralized internet for the masses. Like most blockchains, Tron features an account-based structure, meaning anyone can create a wallet and store their digital assets on a public ledger.\n\nThe Tron network was initially designed to provide a global entertainment platform where content creators could easily share their work worldwide. While Tron still supports these features, the network has also grown to offer a range of blockchain-based applications, like DeFi apps and NFT functionality.\n\nHow Does Tron Work?\n\nWhat’s interesting about Tron is that from the get-go, the team never promised to bring any wildly new innovations or progressions in blockchain technology. Everything from Tron’s consensus mechanism to its programming language was recycled from other networks, drawing criticism from experts.\n\nDespite this, Tron has become one of the largest blockchains in the crypto industry, both in terms of user count and market cap.\n\nThe Tron Blockchain’s Consensus Mechanism\n\nA delegated-Proof-of Stake consensus secures the Tron blockchain. In this DPoS chain, Tron token holders delegate their tokens to validator node operators. These validators, called Super Representatives, are responsible for producing new blocks on the network and representing their stakers in matters of protocol governance.\n\nEvery six hours, 27 Super Representatives (SRs) are chosen from a selection pool of over 100 SR Partners, who are in turn shortlisted from over 300 SR Candidates. The 27 chosen Super Representatives earn TRX tokens as a reward for creating new blocks and securing the Tron blockchain.\n\nNew blocks are created every three seconds and added to the circulating supply, with each new block rewarding the chosen Super Representative with 32 TRX coins.\n\nTron Network Architecture\n\nThe Tron blockchain operates a TVM (Tron Virtual Machine), which records all accounts and transactions on the network and enables developers to build and deploy smart contracts on the Tron Mainnet.\n\nWhile similar to an EVM (Ethereum Virtual Machine), the Tron network is not EVM-compatible. Cryptocurrency tokens on the Tron network follow the rules set by the TRC-20 token standard, unsurprisingly similar to Ethereum’s ERC-20 standard.\n\nAs outlined in the Tron whitepaper, the main infrastructure of the Tron blockchain is broken down into three layers. Separating network responsibilities into different layers helps ease congestion and scale the blockchain.\n\nCore Layer – The Tron core layer handles computational instructions written in Java or Solidity. Transactions are then sent to the Tron Virtual Machine, which executes code logic.\n\nApplication Layer – Users and developers interact with this layer to execute on-chain transactions and deploy decentralized applications, products, and services.\n\nStorage Layer – As the name suggests, the storage layer records blockchain data and keeps a live register of the state of the network and all Tron-based smart contracts.\n\nTron Blockchain Performance\n\nDespite not boasting any revolutionary new technologies or innovative features, the Tron network achieves high levels of scalability and decentralization. Tron claims that its network can reach a maximum transaction throughput of around 2,000 TPS (transactions per second).\n\nOn top of that, transaction fees on the network are typically low, with users expecting to pay around $0.000005 per transaction. In this respect, the Tron blockchain is comparable to Ripple (XRP).\n\nThese are impressive figures compared to certain Layer-1 networks like Ethereum and BNB Chain, which respectively struggle to hit 15 TPS and 150 TPS. However, Tron still falls short of networks like Solana and Aptos, which theoretically handle over 100,000 transactions per second while maintaining low transaction fees.\n\nThe Tronix token\n\nThe native token of the Tron blockchain, Tronix, is used to pay transaction fees and secure the network through Tron’s DPos consensus mechanism.\n\nTRX tokens are also used as the main currency of exchange for Tron NFTs and can be used in DeFi apps within the Tron ecosystem.\n\nThe Tron Ecosystem\n\nDeFi is booming on Tron thanks to a variety of decentralized applications and products. What many people don’t know is that the Tron network is the king of Tether (USDT), the largest stablecoin in the crypto market. More Tether coins are stored on the Tron blockchain than on any other network. This adds to Tron’s impressive stablecoin dominance over all chains that aren’t Ethereum.\n\nThe Tron network also hosts several DeFi apps exclusive to the Tron ecosystem, including JustLend, JustStable, and SunSwap, a decentralized exchange. DeFi users can also trade wrapped versions of other popular coins, like Bitcoin (BTC), in liquidity pools on the Tron blockchain.\n\nAdmittedly, it seems ironic that a blockchain so committed to decentralization would name its main dApps after one person, Tron founder Justin Sun.\n\nTron Partnerships\n\nLed by Justin Sun and the Tron Foundation, the Tron blockchain is no stranger to blockbuster partnerships. In October 2019, the Tron network confirmed a partnership with Samsung, one of the world’s largest tech companies. Tron tokens are integrated directly into Samsung’s built-in blockchain wallet, while the Samsung App Store has a section exclusively dedicated to Tron applications.\n\nTron also acquired one of the world’s largest online file-sharing platforms, BitTorrent, in 2018. The acquisition brought over 100 million users to the Tron ecosystem, making BitTorrent the largest decentralized application.\n\nTron History\n\nJustin Sun founded the Tron Foundation in 2017 to create a blockchain-based platform to share digital files and data and fairly reward content creators. Tron hosted an ICO (initial coin offering) on the Ethereum blockchain, successfully raising $70M.\n\nThe platform proved a great success but was initially limited by Ethereum’s scalability issues. Sun set a course of action to deploy a dedicated blockchain to host the platform and launch the Tron blockchain just one year later.\n\nIn 2021, Justin Sun stepped down as the CEO of Tron. This marked a significant moment for the Tron blockchain, which became truly decentralized. The network is now governed by its community of token holders and the Tron Foundation, a non-profit organization.\n\nTron’s Controversial Founder: Justin Sun\n\nThe founder of Tron, Justin Sun, is a polarizing personality in the crypto community. He never shies away from an online argument, even with industry thought-leaders like Vitalik Buterin, who insinuated that Sun plagiarized content from Ethereum when writing the Tron white paper.\n\nSome believe that Justin Sun has more money than sense. He once paid over $4M to have lunch with legendary investor Warren Buffet. He also spent over $500,000 on an Etherrock NFT, laughing about his purchase on Twitter.\n\nTron Pros and Cons\n\nThe Tron blockchain has plenty to offer. It’s fast and cheap, with over 100 million unique accounts stored on the network. Despite this, the Tron network still has a lot of work to do if it wants to compete with other top Layer-1 blockchains.\n\nPros\n\nHigh Transaction throughput – The Tron network claims to execute up to 2,000 transactions per second, making it significantly faster than Ethereum.\n\nLow fees – Transaction fees of the Tron blockchain cost less than a cent, making it affordable and accessible to users from all kinds of backgrounds.\n\nHigh TVL – Second only to Ethereum, the Tron network has a higher TVL (Total Value Locked) than all its other competitors. This means more funds are stored on Tron than on most other networks.\n\nCons\n\nLow comparative volume – Despite hanging high TVL, the network sees comparatively low trading volume. This suggests that even if plenty of people store their cryptocurrency on the Tron blockchain, most DeFi users aren’t trading there.\n\nOutperformed by other chains – The competition between Layer 1 blockchains is fierce. While Tron’s scalability is superior to legacy chains like Ethereum, more powerful networks like Solana and Aptos blow it out of the water.\n\nLow developer activity – Tron has a high user count and plenty of value stored on-chain. However, there are few dApps on the network compared to other chains. What’s more, this doesn’t look to be changing anytime soon. Electric Capital’s developer report suggests that fewer than 100 developers are building on Tron, compared to Ethereum’s 5,000+.\n\nOn the Flipside\n\nThe cryptocurrency industry is rapidly evolving, with new technology being discovered and implemented every day to improve blockchains. Even when Tron was launched, it didn’t provide any innovative developments. With so many emerging chains pushing the boundaries of blockchain technology, there is a chance that Tron will be left behind if it cannot adapt.\n\nWhy You Should Care\n\nTron is one of the largest crypto projects in the blockchain industry and holds the largest supply of Tether on its network. Tether plays an immense role in the health and reputation of the crypto space; if the Tron network were to suffer an outage, it would have a significant impact on the entire crypto market.\n\nFAQs"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY3J5cHRvZGFpbHkuY28udWsvMjAyMy8wNC9waGFudG9tLXRvLWxhdW5jaC1ldGhlcmV1bS1hbmQtcG9seWdvbi1tdWx0aWNoYWluLWludGVncmF0aW9u0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Apr 2023 07:00:00 GMT",
        "title": "Phantom To Launch Ethereum and Polygon Multichain Integration - CryptoDaily",
        "content": "Phantom, a Solana-based crypto wallet, is set to expand its support to include Ethereum and Polygon blockchains, opening its doors to a broader range of crypto users.\n\nAccording to Phantom, the feature for multichain support will have a public launch on May 1st. The public launch will place on May 1. The Web3 wallet has published an initial guide on how to import and manage multiple wallets natively on its web and mobile apps.\n\nWith the integration, Phantom's multichain wallet will simplify the management of multiple Secret Recovery Phrases and private keys across Solana, Ethereum, and Polygon. Users may then import and use existing multichain addresses from popular wallets like MetaMask, Coinbase Wallet, and Rainbow, eliminating the need for multiple wallets. Phantom allows for the creation and management of up to 100 accounts, enabling easy management of all Secret Recovery Phrases and private keys within a single platform.\n\nOriginally scheduled for launched in Q1 2023, the addition of Ethereum and Polygon support enables Phantom's 3 million users to transfer assets across different blockchains and interact with decentralized applications (dApps) such as Uniswap and Aave, as well as NFT marketplaces like Blur and OpenSea. Phantom wallet users can now also import existing assets from MetaMask, Solana, or Ethereum Virtual Machine (EVM) wallets.\n\nPhantom's multichain support follows a successful funding round in January 2022, during which the wallet company reached a valuation of $1.2 billion. The round included participation from Paradigm, Andreessen Horowitz, Jump Capital, Solana, and other investors. The firm started with a $9 million Series A.\n\nWhile there are other multichain crypto wallets like Pillar in the market, the majority of crypto wallets typically cater to single layer-1 blockchains, with Ethereum-focused wallets being the most prevalent. MetaMask, for instance, supports Ethereum and ERC-20 tokens, but its team has expressed interest in a multichain future.\n\nWeb3 wallets play a crucial role in scaling the crypto ecosystem, as they provide users with a seamless, secure, and accessible interface for managing their digital assets. One of the main factors contributing to the growth of the crypto ecosystem is the rise of decentralized applications (dApps) and non-fungible tokens (NFTs), which have expanded the use cases for cryptocurrencies beyond just being a store of value or a medium of exchange.\n\nWeb3 wallets are thus critical in the ecosystem in that they enable users to interact with these dApps and NFT marketplaces, thus facilitating their participation in decentralized finance (DeFi), gaming, and other sectors that are gaining traction within the crypto space.\n\nPhantom Wallet CEO Brandon Millman has opined along the same trajectory, claiming that the nature of wallets in the crypto space is rapidly changing amid newly-discovered technical difficulties and regulatory concerns. Millman previously helped build Matcha.xyz, an Ethereum-based DEX aggregator, as well as APIs for 0x.\n\nPhantom is also implementing new security features to mitigate phishing risks, including hiding spam sent to crypto wallets. The wallet simulates transactions before approval, allowing users to verify the transaction details and detect potential concerns. To date, Phantom has a user base of over 3 million.\n\nDisclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vZm9ydHVubHkuY29tL25ld3MvaW52ZXN0bWVudHMvY3J5cHRvLW1hcmtldC1zdHJ1Z2dsaW5nLWFzLWJpdGNvaW4tYW5kLWV0aGVyZXVtLXNoZWQtdmFsdWUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Apr 2023 07:00:00 GMT",
        "title": "Crypto Market Struggling as Bitcoin and Ethereum Shed Value - Fortunly News",
        "content": "The crypto market has been in a tailspin over the past few days, with Bitcoin and Ethereum leading the way down. Prices have fallen sharply, with the market meltdown catching many investors by surprise.\n\nWithin just 24 hours, between April 10 and April 11, the price of Bitcoin decreased 15%, dropping below $40,000 for the first time since March 15. Ethereum followed suit, declining 14% and going below $3,000 for the first time since March 23.\n\nThis is all part of a broader trend that saw the crypto market tumble 8.5% over 24 hours, hitting a $1.84 trillion market cap. So, what caused this market nosedive? There are a few theories floating around, but the most likely culprit is a combination of several factors.\n\nThe price of Bitcoin has historically been connected to the price of other cryptocurrencies, but as of recent, it has been correlated with the stock market as well. When these markets take a turn down, so does the price of Bitcoin.\n\nThe stock prices have recently been affected by various factors, including the ongoing conflict in Ukraine, growing inflation concerns, and a fresh round of COVID-19 lockdowns. The S&P 500 closed down 1.7%, while the Nasdaq dropped 2.2% in its value, and the Dow Jones Industrial Average ended Monday’s session down 1.2%.\n\nWhen the stock market takes a dip, this often pushes investors to sell off their assets, which is likely what happened with Bitcoin and Ethereum as well.\n\nThe crypto market is in a rough state right now, and it’s hard to say where things will go from here. Bitcoin and Ethereum have both been hit hard. However, price volatility is hardly a new phenomenon in the world of cryptocurrencies."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMikgFodHRwczovL3d3dy5iaXRjb2luc2Vuc3VzLmNvbS9ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLWRhaWx5LTI4LWFwcmlsLXVyZ2VudC10aGlzLWNvdWxkLWJlLXRoZS1maW5hbC1tb3ZlLWZvci10aGUtZXRoLWhlYWQtYW5kLXNob3VsZGVycy1wYXR0ZXJuL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction Daily (28-April): Urgent! This Could Be The Final Move For The ETH Head and Shoulders ... - Bitcoinsensus",
        "content": "Ethereum price prediction from a previous analysis Must Read! Potential Head and Shoulders Pattern Forming on ETH!\n\nIn a previous Ethereum analysis Must Read! Potential Head and Shoulders Pattern Forming on ETH! we analyzed the bearish scenario for Ethereum and warned our readers of the possible Head and Shoulders Pattern that was forming in the 4-hour timeframe.\n\nThis Head and Shoulders Pattern is a unique price pattern used by professional traders to spot market reversals. And if completed could easily mean a more than -15% dump in the value of Ethereum in the coming days.\n\nWell, that pattern is still valid and we might be getting ready to make the final move that confirm the beginning of the sell-off for Ethereum.\n\nIn this Ethereum analysis, we will be talking about the key levels we are currently watching as well as what we expect to happen soon!\n\nTo trade ETH with leverage, sign-up to Bybit right now! Bybit’s BIGGEST Bonus Campaign is now live! You can get up to a $30,000 Bonus when you fund your Bybit account with our Bybit link\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nETH Bearish Price Scenario!\n\nThe Bearish pattern we are currently tracking is the Head and Shoulders Pattern currently forming in the 4-hour timeframe.\n\nThe image above is what this key pattern looks like once it is completed. And in the coming days, we expect to see a similar price action like this play out.\n\nSo for now, we are still monitoring the development of this key pattern to see if the bears are really ready to push the Altcoin price lower.\n\nKey Levels To Watch For!\n\nUrgent! This Could Be The Final Move For The ETH Head and Shoulders Pattern. Watch this price prediction in the 4-hour timeframe\n\nThe most important key level for Ethereum right now is the $1,668 support zone. This price level also serve as the Neckline Support of the Head and Shoulders Pattern.\n\nSo for the bearish sell-off to be confirmed by Ethereum, we need to see the Altcoin price break through and close below this $1,668 key support zone in the 4-hour timeframe.\n\nOnce the bearish break down happens, we can expect to see more push lower play out for Ethereum as more sellers step into the market.\n\nFinal Verdict!\n\nThe Ethereum price is right now forming a Head and Shoulders Pattern in the 4-hour timeframe. If this key pattern plays out, there is a very high probability that we might see am more than -15% dump in the value of Ethereum in the coming days.\n\nBut for this bearish prediction to play out, we need to see the ETH price break through and close below the $1,668 key support level in the 4-hour timeframe.\n\nUntil this bearish break down occurs, we will continue to stand aside and wait for this bearish confirmation to play out!\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nHow to Trade Bitcoin (BTC)?\n\nTo understand the basics of Bitcoin trading, you can read our How To Trade Bitcoin Guide. It can prove helpful for traders who are just getting started with Bitcoin trading. You can also check out our list of top Bitcoin Exchanges To Trade With.\n\nPrimeXBT Covesting: Trade Hassel Free\n\nSign-up on PrimeXBT today to trade Bitcoin hassle-free. You can copy experienced traders and access hundreds of different strategies on the platform! Don’t forget to claim your 25% bonus by using the promo code “bitcoinsensus50” when you sign-up with our link PrimeXBT Covesting"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3LmJsb2NremVpdC5jb20vZXRoZXJldW0tZ3Jvd3RoLWNoZWNrLW91dC10aGUtdG9wLTctdXBjb21pbmctbDJzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Growth: Check Out The Top 7 Upcoming L2s - Blockzeit",
        "content": "Ethereum has come a long way in terms of the development of its ecosystem. From mainnet to layer 1s, L2s, and now L3s, the network is growing at an accelerated pace. Are you looking to take your Ethereum experience to the next level?\n\nKeep your eyes on these 6 test net L2s that are poised to revolutionize the ecosystem!\n\n1. Base\n\nBASE\n\nCoinbase recently introduced Base, an optimistic-style L2 roll-up built on the Optimism OP Stack, with plans for main net release later this year. With over 110M users, Coinbase is poised to make this L2 a major web3 gateway!\n\nBecause it is built on Optimism, Base will be a secure and low-cost network. The test net launched on February 23, 2023, and the main net is planned to take place sometime this year.\n\nCoinbase expressly stated they “have no plans to issue a new network token.” So airdrop hunters can steer clear of this one.\n\n2. Fuel\n\nL2 Fuel Network\n\nFuel network is an L2 by Fuel Labs that aims to be the fastest execution layer for the modular blockchain stack. The Modular Execution Layer (MEL) refers to a flexible and adaptable framework designed to support the development of blockchain networks.\n\nWith MEL, developers can create customizable modules that can be easily integrated into existing blockchain systems, making it easier to build and scale decentralized applications.\n\nThis UTXO-based L2 is built on three central pillars: parallel transaction execution, the FuelVM, and user-friendly dev UX via the Sway programming language.\n\nTherefore, Fuel Network delivers the highest flexible throughput and security among L2 networks.\n\nTestnet Airdrop: The developers have not denied nor confirmed the possibility of there being a test net airdrop. Airdrop farmers are welcome to test out this powerful network.\n\n3. Linea\n\nLinea\n\nConsenSys recently launched a public test net of its zkEVM, now renamed ‘Linea’. Linea aims to power a new generation of decentralized apps built on Ethereum and will be natively integrated with the MetaMask wallet., Truffle toolkit, Hyperledger Infura, and Hyperledger Besu.\n\nLinea will rock low fees in order to unlock user engagement, and will also be compatible with all existing popular DeFi infrastructure. It will also enjoy the security of Ethereum’s 500K+ validators.\n\nInfura guarantees 99.99% uptime while Besu guarantees optimal execution for zkEVM transactions. Linea will be used for everything including DeFi, NFTs, payments, Infrastructure, and even Gaming and Metaverse.\n\nTestnet Airdrop: There is no known airdrop for testing out Linea Network. However, Consensys may yet surprise the masses since they previously handed out NFTs for the Merge, and for the Ethereum Shanghai upgrade. These may be used as qualifiers for a potential airdrop.\n\n4. Scroll\n\nzk Scroll\n\nScroll is a zkEVM that consists of 3 main infra components: the Scroll Node, the Roller Network, and Rollup/ Bridge Contracts. With Scroll, devs will be able to execute native EVM bytecode in an L2 environment while maintaining strong security guarantees.\n\nScroll Network is currently in the third phase of its test net development. The development roadmap has 6 phases in total. The next phases include the zkEVM Mainnet launch, the launch of a decentralized Prover Network, and the launch of Decentralized Sequencers.\n\nTestnet Airdrop: You can test out the Scroll network on the Goerli Testnet which went live on February 27, 2023.\n\n5. Taiko\n\nTaiko is another in-development zkEVM that aims to eventually support all EVM opcodes in its L2 architecture. This would make the L2 essentially indistinguishable from Ethereum wrt to UX! (Type 1 zkEVM).\n\nType 1-4 zkEVM\n\nAs L2 networks move away from being a Type 1 ZkEVM, they sacrifice Ethereum compatibility for increased prover performance. What this means is that a Type 4 zkEVM, for instance, would be exceedingly cheap in terms of cost since due to increased prover performance, the cost of generating proofs reduces greatly.\n\nGenerally, all Type 2+ zkEVMs focus on:\n\nChanging gas costs for ZK-unfriendly operations\n\nChanging the Keccak hash function to a more ZK-friendly one\n\nTestnet Airdrop: Taiko Alpha-2 Testnet went live on mrch 22, 2023. Hurry and test their network, in case they have a potential airdrop planned in the future.\n\n6. ModulusZK\n\nModulus ZK\n\nModulus is the first zkEVM powered by a DAO. It is a privacy-driven zkEVM made from and for decentralization. Modulus leverages the power of zero-knowledge technology to reduce complexity and cost while increasing privacy and decentralization. Secured by Ethereum.\n\nThe network will have faster transactions, lower costs, and more security.\n\nOne of the most unique features of the Modulus chain is the ability to opt-in or out of private transactions with just the click of a button\n\nAbout Cult DAO\n\nCult DAO\n\nCULT DAO is a decentralized investment organization that is funding the next revolutionaries of crypto. The CULT DAO community has developed three projects already, CULT provides investment in decentralization, RVLT focused on rewarding community members, and TRG focused on providing gamified experiences through high-level game theory.\n\nTestnet Airdrop: CULT does not have an airdrop. However, you can buy CULT from several DEXes and CEXes. CULT will be the official gas token of the Modulus chain and the fees will be burnt, reducing the supply of CULT and raising its price.\n\nConclusion\n\nThe level of building and growth in the blockchain industry is one of the highest in all of human industrialization history. In just 10 short years, Blockchain has moved from the Dark Web to the Senate. These networks represent a fraction of the new breed emerging from the rapid evolution of blockchain technology. Be sure to try them out."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3LmNyeXB0b3BvbGl0YW4uY29tL3dlYi1zdG9yaWVzL3doeS1pcy1ldGhlcmV1bS1hY2NvdW50LWFic3RyYWN0aW9uLWltcG9ydGFudC_SAVhodHRwczovL3d3dy5jcnlwdG9wb2xpdGFuLmNvbS93ZWItc3Rvcmllcy93aHktaXMtZXRoZXJldW0tYWNjb3VudC1hYnN0cmFjdGlvbi1pbXBvcnRhbnQv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Apr 2023 22:15:06 GMT",
        "title": "Why is Ethereum Account Abstraction Important? - Cryptopolitan",
        "content": "Ethereum account abstraction aims to separate the execution logic of a smart contract from the user’s account balance. There are two main ways in which account abstraction can be achieved, these are EIP-4337 and EIP-2938. Out of these, EIP-4337 has already been implemented, and its entry point was deployed to the mainnet on the 1st of March, 2023. That is because it does not change the Ethereum protocol."
    }
]