[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDcvMzEvY2Vsby1wcm9wb3NhbC10by1taWdyYXRlLXRvLWV0aGVyZXVtLWxheWVyLTItcGFzc2VzL9IBYWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDcvMzEvY2Vsby1wcm9wb3NhbC10by1taWdyYXRlLXRvLWV0aGVyZXVtLWxheWVyLTItcGFzc2VzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Celo Proposal to Migrate to Ethereum Layer 2 Passes - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS10dXJucy1laWdodC1iaXJ0aGRheS1jcnlwdG8tY29tbXVuaXR50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Ethereum's 8th birthday: Crypto industry shares its top moments - Cointelegraph",
        "content": "The crypto community has come together to celebrate the 8th birthday of the Ethereum network, marking eight years since the Ethereum Foundation first sent the network live.\n\nOn July 30, 2015, former Ethereum Foundation CCO Stephan Tual penned a blog post, officially announcing that the network had been rolled out.\n\n\"The vision of a censorship-proof ‘world computer’ that anyone can program, paying exclusively for what they use and nothing more, is now a reality,\" he wrote.\n\nScreenshot of blog post from Stephan Tual. Source: Ethereum Foundation\n\nEight years later, Ethereum and its native currency Ether (ETH) has grown to become the second-largest crypto asset in existence, boasting a market capitalization of $225 billion and more than 1,900 monthly active developers.\n\n8 years of growth\n\nCommunity members marked the occasion by sharing fond memories and looking back at its prices, development and overall growth since inception.\n\nBankless co-host Ryan Sean Adams noted that Ethereum reportedly boasts $400 billion in secured value, $3.6 billion in annualized profits and a total of 17.8 million blocks of digital assets.\n\nHappy birthday Ethereum!\n\n\n\n$400 billion in secured value, $3.6 billion in annualized profits, and a total of 17.8 million blocks of uncensorable digital property.\n\n\n\nNot bad for an 8 year old. — RYAN SΞAN ADAMS - rsa.eth (@RyanSAdams) July 30, 2023\n\nUsing the networks’ eth birthday as an opportunity to reminisce, Binance CEO Changpeng Zhao posted a tweet on X recounting the time that Ethereum co-founder Vitalik Buterin stayed with him in Tokyo in the months leading up to the launch of Ethereum.\n\nCZ said Buterin was speaking about ETH “non-stop” at the time and joked about missing out on buying Ethereum at inception. “If I had bought ETH then, I might not have had the need or drive to start Binance. Who knows?” he quipped.\n\nOn this 8th birthday of #Ethereum, a little throw back to May 2, 2015, in Tokyo, just before #ETH was officially born. @VitalikButerin stayed in my apartment in Tokyo during this trip. He was already working on and talking about ETH non-stop. And I still missed (didn't buy)… pic.twitter.com/84B6KN73Qf — CZ Binance (@cz_binance) July 30, 2023\n\nReformed Bitcoiner Udi Wertheimer celebrated the occasion with a dash of humor, referring to the Ethereum network as his “favorite Bitcoin sidechain.”\n\nHappy birthday Ethereum!\n\n\n\nMy favorite bitcoin sidechain — Udi Wertheimer (@udiWertheimer) July 30, 2023\n\nRelated: Ethereum is about to get crushed by liquid staking tokens\n\nEthereum was co-founded by a number of prominent figures, most notably Buterin, along with Charles Hoskinson, Gavin Wood, Joseph Lubin and Anthony Di Iorio.\n\nBy allowing developers to create smart contracts and build new blockchain-based applications, Ethereum became integral to the initial coin offering boom in late 2017 and the explosion of decentralized finance (DeFi) protocols and development — dubbed “DeFi summer” — in 2020.\n\nIt was 8 years ago today, we launched #ethereum from a small office in Waldemarstraße 37A in Berlin\n\n\n\nWhat a journey its been since then?\n\n\n\nIt became the most widely used cryptocurrency network, switched to PoS and spawned many alt-L1s and L2s\n\n\n\nExcited for what the future brings! pic.twitter.com/bmgcjTVLbE — Lefteris Karapetsas | Hiring for @rotkiapp (@LefterisJP) July 30, 2023\n\nA little more than a year after DeFi summer, Ether notched its all-time-high of $4,878 on Nov. 10, 2021. At the time of writing ETH was changing hands for $1,869.\n\nEthereum all-time price chart. Source: CoinGecko\n\nMost recently, crypto enthusiasts witnessed the successful implementation of the Merge upgrade on Sept. 15, 2022, which saw the network transition from aproof-of-work to a proof-of-stake consensus mechanism — driving down its energy usage and unlocking staking incentives for validators and investors.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Here’s how Ethereum’s ZK-rollups can become interoperable"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvZXRoZXJldW0tcHJpY2UtYW5hbHlzaXMtd2lsbC1tZWdhcGhvbmUtcGF0dGVybi1yZWNvdmVyeS1jeWNsZS10by0yMjAwL9IBZ2h0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvZXRoZXJldW0tcHJpY2UtYW5hbHlzaXMtd2lsbC1tZWdhcGhvbmUtcGF0dGVybi1yZWNvdmVyeS1jeWNsZS10by0yMjAwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Price Analysis: Will Megaphone Pattern Trigger a New Recovery Cycle to $2200? - CoinGape",
        "content": "Ethereum Price Analysis: Amid the increasing FUD in the crypto market, the Ethereum price correction phase stalled at the support of the megaphone pattern near the $1830 mark. This support was expected to bolster buyers for a bullish reversal, but the price trend turned sideways. The consolidation reflects a weakness in bullish momentum as buyers fail to push the altcoin higher despite obtaining strong support. Will ETH price rebound to $2000 or the correction phase may prolong below $1800?\n\nAlso Read: Ethereum Price Charts Signal Buy The Dip Opportunity Ahead\n\nadvertisement\n\nEthereum Price Daily Chart\n\nThe price range between $1890 and $1830 creates a no-trading zone.\n\nA bullish breakout from the $1890 resistance would trigger a new recovery cycle within the megaphone pattern\n\nThe intraday trading volume in Ether is $4.8 Billion, indicating a 48% gain.\n\nSource- Tradingview\n\nOn July 24th, the Ethereum price witnessed a 2% intraday fall and reached the bottom trendline of the megaphone pattern at $1830. Since then the price trend turned sideways and remained within the range of the aforementioned red candle.\n\nThe $1890 resistance and $1830 support are the crucial levels that can influence the near future trend of ETH coins. Currently, the second-largest cryptocurrency Ethereum trades at $1868, with a bullish candle of 0.3% gain.\n\nIf the overhead supply continues to pressure the market participants, a breakdown below the pattern support trendline and $1830, will increase the selling momentum. The breakdown may. pull the price to $1800 support, registering a potential 4% drop.\n\nThe anticipated pullback to $1800 can allow interested traders to accumulate at the support trendline carrying the current uptrend.\n\nHere’s How ETH Price May Regain $2000 Mark\n\nFor Ethereum price to regain its bullish recovery, the buyers need to break the overhead resistance of $1890. This breakout will indicate the microphone pattern is still intact and the bull cycle within this structure could lead Ethereum price near $2200.\n\nBollinger band: The lower support of Bollinger band moving sideways could offer strong support for crypto buyers.\n\nMoving average convergence divergence: the MACD (blue) and signal(Orange) lines going flat at the median level indicate uncertainty traders."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vdW5jaGFpbmVkY3J5cHRvLmNvbS9ldGhlcmV1bS1uYW1lLXNlcnZpY2UtZW5zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Name Service (ENS): A Guide to .ETH Domains - Unchained",
        "content": "Ethereum Name Service (ENS) domains make web3 more accessible and easier to use by providing a human-readable wallet address for Ethereum users.\n\nUsing lengthy addresses for transactions or smart contracts helps secure blockchain networks but isn’t user-friendly, especially for beginners and non-tech-savvy enthusiasts. Ethereum Name Service (ENS) aims to simplify the user experience with Ethereum addresses and make the network more accessible.\n\nRead on to learn more about ENS and how to get an ENS domain.\n\nWhat Is the Ethereum Name Service?\n\nEthereum Name Service (ENS) is a decentralized, open naming system on the Ethereum blockchain. It maps machine-readable identifiers, which are long public addresses such as (0x40qp126b…), to human-readable names that are easy to remember, like unchained.eth.\n\nENS shares a similar purpose to Domain Name System (DNS), which simplifies Web2 IP addresses to human-readable names.\n\nENS and DNS have key architectural differences where ENS is a distributed domain name provider while DNS depends on centralized servers. You can register domain names for decentralized websites on ENS and import DNS names you own to ENS.\n\nHow Does ENS Work?\n\nLike DNS, Ethereum Name Service uses hierarchical names (domains) that give you complete control over subdomains.\n\nThe ENS has three principal components: registry, resolver, and ENS name.\n\nThe registry is the core smart contract that has the list of domains and subdomains and maps them to Ethereum addresses. When you create a name, the contract registers a new entry that associates the new name with your Ethereum address.\n\nResolvers permit updates of domain names to Ethereum addresses. They are responsible for resolving names on ENS through inquiries to the registry to find records of the name.\n\nThe ENS name is registered after you get a confirmation of your entry to the registry with the domain name and Ethereum address. The smart contract will store the domain name mapped to your address on the Ethereum blockchain , where it is tamper-proof and visible to the public.\n\nYou can also register domain names for decentralized websites (dApps) by creating an entry with your website’s InterPlanetary File System (IPFS) hash. IPFS is a peer-to-peer file system supported by web browsers, including Brave, MetaMask, or Opera.\n\nHow to Get an ENS Domain\n\nBefore you can get your hands on a personalized ENS domain, you will need a crypto wallet and some ETH.\n\nSpecifically, you need a non-custodial Ethereum wallet that supports ENS. The wallet address will link to your domain name on ENS. You should choose a wallet that is accessible through browser extensions and can access Web3-based sites. The wallet will aid in purchasing your ENS domain.\n\nAdditionally, you need ether (ETH) in your wallet to pay for domain registration and cover transaction fees (gas fees). There are several options for you to buy ETH so you can send it to your non-custodial wallet.\n\nYearly renewal fees on ENS are $5 for domain names five characters or longer, names with four characters cost $160 per year, and names with three characters cost $640 per year. These costs don’t include gas prices.\n\nNow, let’s look at the steps to get an ENS domain.\n\n1. Connect your non-custodial wallet to ENS\n\nGo to https://app.ens.domains/ and connect your preferred wallet to the site through the ‘connect’ option. Follow the pop-up instructions on connecting the dApp to your wallet.\n\n2. Search for your .eth name\n\nThe ENS domain platform has a search bar where you can see if the name you want is still available. If the name is in use, you can check who its current owner is and when its registration expires. If available, you can pick a period (in years) you’ll register for it and move to the next step.\n\n3. Purchase your domain name\n\nYou will get the estimated registration and gas fees for your selected name, depending on its character length. Sign the transactions once you request to register and wait for confirmation that no one else is registering the name.\n\n4. Complete registration and set resolver\n\nOnce your transaction is confirmed, complete registration and get your ENS domain. Lastly, set the resolver to allow dApps to use your ENS name instead of your wallet address.\n\nENS makes Ethereum more accessible to cryptocurrency beginners and reduces the chances of error when performing transactions using addresses."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY3J5cHRvLm5ld3MvZXVzLW1pY2EtcnVsZXMtY291bGQtcHJvaGliaXQtbWV2LWFjdGl2aXRpZXMtb24tZXRoZXJldW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "EU's MiCA rules could prohibit MEV activities on Ethereum - crypto.news",
        "content": "Patrick Hansen, a Circle executive, is concerned that entities involved in Maximal Extractable Value (MEV) activities on Ethereum and other smart contract platforms might be banned from operating in the European Union (EU) once the Markets in Cryptoassets (MiCA) regulation comes into effect.\n\nMiCA, adopted by the European Parliament on April 20, 2023, marks a significant milestone as the first clear legislation governing the issuance and provision of services related to crypto-assets and stablecoins. Its enforcement is scheduled between mid-2024 and early 2025.\n\nAlthough progressive, MiCA’s Article 92, which aims to prevent and prohibit market abuse involving crypto-assets, is particularly interesting. Specifically, lawyers and industry stakeholders have drawn attention to this provision, as it holds potential implications for MEV participants operating within the EU.\n\nFlashbots & everyone else involved in MEV should pay close attention to MiCA Art. 92 that could deem MEV to be illegal market abuse (transaction ordering).\n\n\n\nESMA will publish technical standards on the topic in Q1 24. I highly encourage people involved to engage early-on. pic.twitter.com/zDa5E9BY7L — Patrick Hansen (@paddi_hansen) July 29, 2023\n\nTitle VI of MiCA highlights the “prevention and prohibition of market abuse involving crypto-assets” and applies to all transactions, orders, or behaviors related to any crypto-asset traded on exchanges. Notably, this regulation covers activities regardless of whether they occur on a trading platform like Kraken, for example, or within the on-chain ecosystem like Uniswap or PancakeSwap.\n\nYou might also like: PancakeSwap aims to enhance platform availability with Google Cloud integration\n\nBased on this interpretation, MEV, the practice of extracting the maximum value from block production by manipulating transaction order, is now under scrutiny due to MiCA. The regulation allows agencies to examine certain MEV practices that could be construed as market manipulation, mainly if they involve artificial price inflation or deceptive transactions.\n\nBeyond market manipulation, MiCA also addresses wash trading, another form of illegal market abuse that deliberately inflates trading volumes. Observers say this may present challenges for Crypto-Asset Service Providers (CASPs) and platforms, including exchanges approved to operate in the region, ensuring market liquidity for leading tokens while concurrently complying with the stringent MiCA requirements.\n\nYou might also like: Stablecoin issuers in Europe advised to start complying before 2024\n\nTaking account of this broad interpretation, though enforcement is still months away, experts predict heightened scrutiny for MEV teams within the EU. If MiCA bans MEV practices in Europe, its effect might be filled across the decentralized finance (defi) and crypto ecosystem, possibly impacting liquidity.\n\nStill, MiCA’s proactive approach to regulating market abuse in the crypto sphere underscores the EU’s commitment to managing the rapidly evolving digital asset landscape. Therefore, as the global community watches the impact of MiCA’s implementation, other jurisdictions will likely draw insights and adapt their regulatory frameworks accordingly.\n\nIn a recent Series B funding round led by Paradigm, Flashbots, a research and development startup focused on Ethereum, secured $60 million. The funding will be used to continue developing their Single Unifying Auction for Value Expression (SUAVE) network, which aims to reduce the negative impact of MEV.\n\nFollow Us on Google News"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiL2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3NvcmFyZS1wYXktd2l0aC1maWF00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Sorare is no longer an Ethereum-only platform — users can now pay with fiat - Blockworks",
        "content": "Sorare, a platform that infuses crypto and fantasy sports, is now offering an option for players to make purchases in the app with fiat currencies.\n\nThis new functionality follows a partnership with Mangopay, a payments infrastructure provider. With Cash Wallet, Sorare’s 3 million users will be able to pay not just in Ethereum but in the US dollar, the euro and the British pound, GamesBeat reported on Monday.\n\nThe French startup’s lineup of games has caught on the most in Europe — mainly for its NFT-based fantasy soccer game. But last year, Sorare partnered with Major League Baseball (MLB) and the National Basketball Association (NBA) in a bid to expand into the US.\n\nSorare CEO Nicolas Julia stressed that the platform remains a blockchain-based product, but touted fiat integration as enhancing accessibility.\n\n“Sorare is built using blockchain technology because we believe it can deliver unique benefits to sports fans and fantasy gamers in the form of proven authenticity, scarcity, and portability,” Julia said. “The launch of Cash Wallet is key to our goal of making Sorare as simple and user-friendly as possible for all sports fans.”\n\nSorare was founded in 2018. It started out as a trading and fantasy sports game, where users would buy digital cards of soccer players in the form of NFTs.\n\nThat vision attracted plenty of venture capital in 2021. Sorare raised $50 million in its Series A in February. Seven months later, it got a considerably larger investment — $680 million — with Softbank at the helm. With that latest round, Sorare achieved a $4.3 billion valuation.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA3LzMxL2V0aGVyZXVtcy1iZXN0LW1vbnRocy1zdGlsbC15ZXQtdG8tY29tZS1hY2NvcmRpbmctdG8tY3J5cHRvLWFuYWx5c3QtYmVuamFtaW4tY293ZW4taGVyZXMtd2h5L9IBggFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNy8zMS9ldGhlcmV1bXMtYmVzdC1tb250aHMtc3RpbGwteWV0LXRvLWNvbWUtYWNjb3JkaW5nLXRvLWNyeXB0by1hbmFseXN0LWJlbmphbWluLWNvd2VuLWhlcmVzLXdoeS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Ethereum’s Best Months Still Yet To Come, According to Crypto Analyst Benjamin Cowen – Here’s Why - The Daily Hodl",
        "content": "Widely followed crypto analyst Benjamin Cowen says that Ethereum (ETH) still isn’t ready for its moment to truly shine, based on historical data.\n\nIn a new video update, Cowen takes a look at Ethereum’s historical average monthly return on investment (ROI), which suggests that Q3, or summer months, are generally not the best times to accumulate or hold ETH.\n\nOn the other hand, the analyst says that late Q4 or early Q1 have historically been the best times to accumulate Ethereum.\n\n“The one-year timeframe shows you that December and January are best, on average. So on average, going back throughout all of ETH’s history, if you bought ETH with a goal to sell it one year later, December and January have historically been the best.\n\nThe worst month was July. If you think about it, think about where ETH was last July. It wasn’t at a very different price than what it is today, I mean you’re talking pretty much the same price, maybe plus or minus a couple of hundred dollars but that’s where we were last July. And you can see there’s this sort of lull in even the one-year ROI buying in that April, May, June July timeframe but as you get further out into Q4, it tends to go up.\n\nIf you go out to two years (ROI), you’ll see the same type of thing: June and July are the worst, and January and December are the best.”\n\nCowen says there’s clear seasonality associated with Ethereum, one that suggests that investors who accumulate ETH at the end of the year to January have performed better than others on average.\n\nAt time of writing, Ethereum is trading at $1,858.\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZGVjcnlwdC5jby8xNTA3MTMvaG93LWV0aGVyZXVtLXVuaXN3YXAtc2F2ZS01LTQtbWlsbGlvbi1jdXJ2ZS1leHBsb2l00gFTaHR0cHM6Ly9kZWNyeXB0LmNvLzE1MDcxMy9ob3ctZXRoZXJldW0tdW5pc3dhcC1zYXZlLTUtNC1taWxsaW9uLWN1cnZlLWV4cGxvaXQ_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "How an Ethereum Bot Used Uniswap to Save $5.4 Million From Curve Exploit - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAs crypto’s decentralized finance ecosystem quaked on Sunday amid $52 million stolen from Curve Finance, one trading bot jumped into the fray. Its mission: copy the attackers-at-large, secure millions of dollars in crypto before it’s gone, and then give it all back in an apparent white-hat intervention.\n\nAn issue with the programming language Vyper, used for writing smart contracts on the Ethereum blockchain, provided a window of opportunity for exploits involving liquidity pools on Curve Finance, one of DeFi’s go-to exchanges.\n\nAt the time of writing, Curve has $1.6 billion in total value locked, down 42% over the past day, yet still a significant slice of Ethereum’s $23-billion DeFi landscape, according to DefiLlama.\n\nAD\n\nAD\n\nAttackers manipulated the price of tokens in several liquidity pools, where one token can be exchanged for another. Recent reports from the blockchain security firm PeckShield estimate that $52 million has been lost. But the attackers didn't get away with the entire stash.\n\nSomeone used the exploit in Curve’s CRV-ETH liquidity pool—where Ethereum can be swapped for the exchange’s governance token, Curve DAO (CRV)—to, in a sense, exploit the exploiters. The transaction cost about $32 worth of crypto in transaction fees but yielded 2,879 Ethereum—a profit of around $5.4 million.\n\nThe 2,879 Ethereum was ultimately returned to Curve by a bot bearing the name “c0ffeebabe.eth,” according to Etherscan. Ethereum addresses are a long string of alphanumeric characters by default, but the bot’s owner gave it a human-readable name using the Ethereum Name Service. PeckShield also attributes the bot with having nabbed another $1.6 million from synthetic asset protocol Metronome, and a representative of the security firm told Decrypt that 90% of those funds have also now been returned.\n\nThe bot's action was a lucrative, split-second arbitrage play, involving flash loans and the decentralized exchange Uniswap, Yixin Cao, lead data scientist at the DeFi analysis platform EigenPhi told Decrypt.\n\n“Not a lot of actors can do this type of thing,” she said. “There are a lot of sophisticated attackers out there, but this kind of arbitrage requires very in-depth knowledge.”\n\nAD\n\nAD\n\nUniswap and Balancer\n\nEigenPhi’s breakdown of the transaction outlines 16 distinct steps taken by the bot—but the play hinged on two distinct DeFi projects.\n\nC0ffeebabe.eth’s split-second trade first tapped Balancer, a liquidity protocol, for a flash loan of 100 Ethereum. Flash loans are uncollateralized and require debtors to pay them back within the same transaction.\n\nThen, Uniswap was essential, Cao said, because it allowed c0ffeebabe.eth to capitalize on the discrepancy between CRV’s price on Uniswap and Curve it planned to create by using the Vyper bug. The bot swapped 70 Ethereum for over 190,000 CRV using Uniswap.\n\nAn initial burst of 30,000 CRV directed at Curve’s CRV-ETH pool caused the Vyper bug to throw it out of balance. The pool’s unbalanced state allowed c0ffeebabe.eth to exchange its remaining CRV for 2,949 Ethereum—317 times what it would have otherwise been able to get without the exploit.\n\nAfter the flash loan was repaid, that left c0ffeebabe.eth with a sizable profit.\n\nThe Vyper exploit turned what would’ve been a small play into a massive one, Cao said. Without leveraging the vulnerability, c0ffeebabe.eth would’ve walked away with only 9.3 Ethereum based on a simulation conducted by EigenPhi.\n\nOn-chain Hope\n\nNot long after the deed was done, c0ffeebabe.eth broadcast a message using Internal Data Messages (IDM), which allows messages to be sent on Ethereum’s blockchain.\n\n“Moving funds to cold wallet for now, affected protocols can contact via etherscan chat,” the person behind the bot said on-chain, signaling they would hold the stolen funds in a digital wallet securely that has private keys isolated from the internet.\n\nAD\n\nAD\n\n“Deployer from Curve,” one Ethereum account responded on-chain, identifying itself as part of the Curve team. “One tx you front-ran was a hack of CRV/ETH pool. Can refund?”\n\nSeveral blockchain security experts told Decrypt that c0ffeebabe.eth’s trade did not appear to be an example of front-running. Regardless, the bot eventually parted with what would’ve been its biggest payday ever.\n\nPrior to Sunday, c0ffeebabe.eth had amassed around $29,000 in profit across different arbitrage transactions, according to EigenPhi’s account profiler. Even though Sunday’s takeaway overshadowed the bot's performance to date, it didn’t prevent c0ffeebabe.eth from fulfilling its selfless, white-hat service.\n\nEditor's note: This story was updated after publication to include comment from PeckShield."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vdS50b2RheS9sb25nLWRvcm1hbnQtZXRoZXJldW0tZXRoLXdhbGxldC1hd2FrZW5z0gE8aHR0cHM6Ly91LnRvZGF5L2xvbmctZG9ybWFudC1ldGhlcmV1bS1ldGgtd2FsbGV0LWF3YWtlbnM_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Long-Dormant Ethereum (ETH) Wallet Awakens - U.Today",
        "content": "A previously inactive Ethereum wallet has recently shown signs of life, according to Lookonchain, a blockchain analytics firm that monitors crypto wallet activities.\n\nAdvertisement\n\nCoinciding with Ethereum's eighth anniversary, an initial coin offering (ICO) participant who has remained dormant for eight years transferred a substantial sum of 641 Ethereum (ETH), approximately $1.19 million at current prices, and began staking.\n\nAccording to data from CoinGecko, Ethereum is ranked second among cryptocurrencies, with its price currently pegged at $1,865.34.\n\nThe market cap stands at a hefty $224.17 billion, showing its significant presence in the crypto economy. Ethereum, the second largest cryptocurrency by market capitalization after Bitcoin, began life with an ICO price of around $0.31, showcasing its astronomical growth over the past eight years.\n\nThis event marks yet another time in recent months that an Ethereum whale has stirred from slumber. In late May, another Ethereum holder, dormant since the ICO eight years ago, suddenly transferred all of their 8,000 Ether (approximately $14.7 million) into a new account.\n\nThese large-scale transactions by early Ethereum participants have ignited speculations and conversations within the crypto community.\n\nDespite their significant holdings, it is highly unlikely that these whales could introduce significant volatility into the market if they decided to sell large amounts of ETH.\n\nIt remains to be seen whether these early Ethereum adopters' activities will have any substantial impact on the broader crypto market."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kva3Jha2VuLWZpeGVzLWV0aGVyZXVtLWZ1bmRpbmctZ2F0ZXdheS1pc3N1ZXMv0gFgaHR0cHM6Ly93d3cuZmluYW5jZW1hZ25hdGVzLmNvbS9jcnlwdG9jdXJyZW5jeS9rcmFrZW4tZml4ZXMtZXRoZXJldW0tZnVuZGluZy1nYXRld2F5LWlzc3Vlcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Kraken Fixes Ethereum Funding Gateway Issues - Finance Magnates",
        "content": "The cryptocurrency exchange, Kraken has reportedly solved an issue with its funding gateway for Ethereum, which caused a delay in deposits and withdrawals. The exchange indicated on its status page that all of its systems were operational without providing details.\n\nOn Sunday, the exchange announced that it was examining an issue on the Ethereum funding gateway that could cause a delay in deposits and withdrawals. Kraken reported similar disruptions for several crypto funding gateways, including those of major cryptocurrencies, like Bitcoin and Ethereum, in June.\n\nAdditionally, Kraken suspended trading on its futures platform in June for maintenance. Founded in 2011 and based in the US, Kraken is currently ranked the third-largest digital asset exchange by daily trading volumes.\n\nKraken’s Jesse Powell under Probe\n\nAbout three weeks ago, Kraken’s Co-Founder, Jesse Powell was investigated by Federal law enforcement agencies for allegedly hacking a non-profit entity he founded. Powell’s home in Los Angeles was reportedly searched by the FBI, and his electronic devices were seized.\n\nSpecifically, according to a report by Finance Magnates, Powell is being probed for allegedly blocking access to the emails and computer accounts of the Verge Center for the Arts. Besides that, the US Attorney’s Office for the Northern District of California has reportedly been investigating Powell.\n\nAccording to the New York Times, Powell, who stepped down as Kraken’s CEO last year, was removed from the Board of Directors of Verge. However, he filed a lawsuit against the non-profit organization contesting his dismissal.\n\nIRS Targets Kraken\n\nMeanwhile, earlier this month, Kraken was ordered by the federal court to submit information related to historical transactions and users’ accounts to the Internal Revenue Service (IRS). The tax agency is reportedly examining whether there are any underreported taxes by the exchange.\n\nIn February, the IRS filed a petition before a federal court in the Northern District of California seeking customer data that transacted more than USD $20,000 between 2016 and 2020 on Kraken. Additionally, the tax agency accused the crypto exchange of failing to comply with the sermons issued earlier."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vY3J5cHRvYnJpZWZpbmcuY29tL3dvbWJhdC1leGNoYW5nZXMtZXRoZXJldW0tZXhwYW5zaW9uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Wombat Exchange's Ethereum Expansion: A New Burrow Begins August 4 - Crypto Briefing",
        "content": "Share this article URL Copied\n\nWombat Exchange, known for its multichain stableswap on BNB Chain, will officially expand to the Ethereum network on August 4, 2023. The expansion aims to leverage Ethereum’s extensive liquidity and capitalize on Wombat’s success on BNB Chain and Arbitrum.\n\n🔥 Breaking News: The long-awaited @ethereum launch is set for August 4, 2023! We're excited to showcase our innovations to the #ETH ecosystem, bringing our capital-efficient stableswap experience and helping propel #DeFi to new heights. Don't blink. This is only the start. 🚀 pic.twitter.com/shVtUVBsoN — Wombat Exchange 🐻🔁 (@WombatExchange) July 31, 2023\n\nWombat’s upcoming expansion builds upon its achievements on BNB Chain, where it reached an all-time high of over $100 million in 24-hour trading volume.\n\nIts unique algorithms, combining the symmetry of traditional invariant functions with the efficiency of the ALM model, allowed Wombat to achieve faster equilibrium in liquidity pools and maintain balance longer than many stableswap protocols.\n\nNow, upon its launch on Ethereum, Wombat will provide its advanced stableswap functionalities that include minimal slippage for swaps, single-sided provisions, and rapid calculations to save on gas fees and time.\n\nWombat’s proprietary closed-form quadratic solution ensures lightning-fast calculations, a feature that distinguishes it in the competitive DeFi landscape.\n\nSpecial rewards and incentives have also been planned for the launch week, thanks to partnerships with leading protocols such as Lido. Further collaborations with stablecoin and liquid staking partners are expected in the subsequent weeks.\n\nSwaps and pools will be activated immediately upon release, allowing Ethereum users to experience core Wombat functionalities:\n\n“More collaborations and campaigns with prominent stablecoin and liquid staking partners are also planned in the coming weeks post-launch.”\n\nWombat Exchange’s vision of advancing DeFi growth aligns with its commitment to greater capital efficiency, increased accessibility and scalability across a multichain world:\n\n“This launch marks a monumental moment in our mission to build the premier multi-chain stableswap ecosystem. Ethereum’s thriving landscape and extensive liquidity make it the perfect next home for Wombat.”"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vYmxvY2tjaGFpbi5uZXdzL25ld3Mvc2VjLXJlcXVpcmVkLWNvaW5iYXNlLXRvLXRyYWRlLW9ubHktYml0Y29pbi1leGNsdWRlLWV0aGVyZXVtLWFuZC1hbGwtb3RoZXItY3J5cHRvcy1yZXBvcnRzLWZ00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "SEC Required Coinbase to Trade Only Bitcoin, Exclude Ethereum and All Other Cryptos, Reports FT - Blockchain.News",
        "content": "On July 31, a report by the Financial Times reported that the U.S. Securities and Exchange Commission (SEC) had requested Coinbase to cease all cryptocurrency trading, including Ethereum, with Bitcoin being the only exception, before taking legal action against the company.\n\nOn July 31, a report by the Financial Times reported that the U.S. Securities and Exchange Commission (SEC) had requested Coinbase to cease all cryptocurrency trading, including Ethereum, with Bitcoin being the only exception, before taking legal action against the company.\n\nCoinbase CEO Brian Armstrong disclosed the SEC's stance, stating that we believe all assets except Bitcoin are securities, but the regulatory body did not clarify how this conclusion was reached.\n\nArmstrong further explained that the SEC had proposed this course of action the previous month, prior to filing a lawsuit against the Nasdaq-listed company. The basis for the lawsuit was Coinbase's failure to register as a broker. Armstrong expressed his belief that compliance with the SEC's request might have established a precedent, potentially compelling most U.S. crypto companies to operate outside legal boundaries unless registered with the commission.\n\nThe SEC's allegations against Coinbase include engaging in an unregistered securities offering through its staking-as-a-service program since 2019. On June 6, 2023, the SEC formally charged Coinbase with operating its crypto asset trading platform as an unregistered national securities exchange, broker, and clearing agency.\n\nAdditionally, the SEC accused Coinbase of failing to register the offer and sale of its crypto asset staking-as-a-service program, a platform that enables customers to profit from the \"proof of stake\" mechanisms of specific blockchains. The SEC's complaint seeks a range of legal remedies, including injunctive relief, disgorgement of ill-gotten gains plus interest, penalties, and other equitable relief. The announcement of the lawsuit led to a 12% decline in Coinbase's stock on that day.\n\nIn its case against Coinbase, the SEC identified 13 smaller cryptocurrencies traded on the platform as securities. These include SOL, ADA, MATIC, FIL, SAND, AXS, CHZ, FLOW, ICP, NEAR, VGX, DASH, and NEXO. The SEC contends that by offering these cryptocurrencies, the trading platform falls under regulatory jurisdiction, further complicating the legal landscape for cryptocurrencies in the United States.\n\nImage source: Shutterstock"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1yZWNvdmVyeS1mYWRlLTE5MDAtMi_SAU1odHRwczovL3d3dy5uZXdzYnRjLmNvbS9hbmFseXNpcy9ldGgvZXRoZXJldW0tcHJpY2UtcmVjb3ZlcnktZmFkZS0xOTAwLTIvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Price Recovery Could Soon Fade If ETH Fails To Surpass $1,900 - NewsBTC",
        "content": "Ethereum price is struggling to clear the $1,880 zone against the US Dollar. ETH could start a fresh decline if it stays below $1,880 and $1,900.\n\nEthereum is facing major resistance near $1,880 and $1,900.\n\nThe price is trading below $1,875 and the 100-hourly Simple Moving Average.\n\nEarlier, there was a break below a key bullish trend line with support near $1,870 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair is now struggling to rise above the same trend line and $1,880.\n\nEthereum Price Faces Key Resistance\n\nEthereum’s price failed to clear the $1,885 resistance and started a fresh decline. ETH declined below the $1,875 and $1,870 levels within a range, similar to Bitcoin.\n\nBesides, there was a break below a key bullish trend line with support near $1,870 on the hourly chart of ETH/USD. The pair tested the $1,850 support and recently started a fresh increase. There was a move above the $1,865 level. The bulls pushed the price above the 50% Fib retracement level of the downward move from the $1,885 swing high to the $1,850 low.\n\nEther is now struggling to rise above the same trend line and $1,880. It is trading below $1,875 and the 100-hourly Simple Moving Average. On the upside, immediate resistance is near the $1,875 level and the 100 hourly SMA. It is close to the 61.8% Fib retracement level of the downward move from the $1,885 swing high to the $1,850 low.\n\nSource: ETHUSD on TradingView.com\n\nThe first major resistance is near the $1,885 level. The next key resistance is near the $1,900 level, above which the price might rise toward the $1,950 zone. Any more gains might send the price toward the $2,000 hurdle.\n\nFresh Decline in ETH?\n\nIf Ethereum fails to clear the $1,875 resistance, it could start another decline. Initial support on the downside is near the $1,860 level.\n\nThe first major support is near the $1,850 zone, below which the price might test the $1,820 support zone. The next major support is near the $1,780 support level.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 level.\n\nMajor Support Level – $1,850\n\nMajor Resistance Level – $1,885\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1jcnVzaGVkLWxpcXVpZC1zdGFraW5nLXRva2Vuc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Ethereum is about to get crushed by liquid staking tokens - Cointelegraph",
        "content": "Before we know it, liquid staking tokens (LSTs) are going to replace Ethereum’s native cryptocurrency, Ether (ETH). The LST market is already worth approximately $17 billion, and it has grown continuously since Ethereum’s Merge.\n\nWhile LSTs are just beginning to hit their stride, their advantages over traditional ETH will soon become clear to liquidity providers (LPs), toppling ETH from its throne and ushering in a new era of LST domination.\n\nSince the Merge, ETH can now be staked to produce a roughly 4% annual yield, depending on factors of network activity, total ETH staked, number of validators and the value captured by maximum extractable value. This development is significant because of the nature of ETH as a generally stable asset. Many cryptocurrencies are more volatile, so owners have to consider both yield and whether the price of that asset will appreciate or depreciate. Alternatively, ETH now offers yields from both staking and gradual price stability and appreciation.\n\nRelated: Lower costs, higher speeds after Ethereum’s Merge? Don’t count on it\n\nThe new capacity to stake ETH and earn yield means that those who hold ETH today must decide: Should they provide liquidity with their ETH and hope to earn fees, or would they be better off staking that ETH and earning a surefire yield?\n\nLSTs solve this dilemma for LPs. Unlike regular staked ETH, which is illiquid in the Ethereum staking contract, LSTs unlock the inherent value of staked tokens, giving LPs a liquid “receipt” token that can be freely traded and utilized as collateral within decentralized finance (DeFi) protocols. Because LSTs make staked assets liquid, they offer flexibility for tokenholders to engage in other activities across different networks while still earning ETH staking rewards.\n\nThis means that LPs can now earn the yield from staked ETH while simultaneously using LSTs to provide liquidity in automated market makers (AMMs). Critically, LSTs also offer a much lower cost to entry than regular ETH staking, which is appealing for reaching new audiences and smaller dollar investors.\n\nThe argument that LSTs will replace ETH in DeFi is evident: Any LP who chooses to supply ETH to an AMM instead of an LST is sacrificing roughly 4% APR. What kind of sense would that make for folks looking to maximize their yield?\n\nThere are undoubtedly some in this space who would argue that ETH is ETH — that it’s the second biggest token in the cryptocurrency landscape and that it’s not going anywhere. But crypto is quick to evolve. This community is always looking for the next technical development that makes earning yield easier and more efficient, and when it comes down to it, LSTs offer a more effective way to earn yield.\n\nRelated: Ethereum’s Merge will affect more than just its blockchain\n\nThe transition to LSTs will come swiftly, but right now, it’s still very early days. Ethereum’s Shanghai upgrade, which enabled ETH to be unstaked for the first time, only happened in April. But LSTs have a much larger market potential than their current market share represents. As people become more comfortable with staking ETH now that it can be easily unstaked, I believe that we will see a rapidly growing adoption of liquid staking platforms.\n\nThe beginning of this transition can already be seen in staking trends in the post-Shanghai world. In 2023 alone, the ETH deposited with the Lido protocol has increased from 4.9 million to 8 million, representing more than 30% of all staked ETH. The Swell Network, which launched in mid-April, already has more than 43,000 ETH staked on its platform.\n\nETH staked on Swell as of July 30, 2023. Source: DeFiLlama\n\nThis shift could mean LSTs will take over as the dominant asset in decentralized exchanges and eventually replace ETH entirely as the go-to token in crypto. The sweeping growth of “LSTFi” could usher in an age in which all ETH will be staked through liquid staking protocols and users will do all trading and other activities using LSTs.\n\nYes, ETH is the more familiar asset. But familiar doesn’t necessarily mean “best.” Before settling into purchasing ETH and then having to make decisions about what financial opportunity to forfeit via providing liquidity vs. staking, folks in DeFi should take a spin through the up-and-coming LST ecosystem. Right now may be the last real chance to get in on the ground floor and maximize the impact of their investments.\n\nUltimately, an LST takeover would be a positive thing for the industry. Many crypto users left during our “crypto winter,” and there’s been a noticeable slowdown in garnering interest from new users. LSTs are a more accessible option to attract new users and could be the new breath of life this industry needs.\n\nBob Baxley is a core builder for the Maverick Protocol. He was previously the CTO and co-founder of Bastille Network, a cybersecurity fund that protects large commercial and federal entities from radio frequency-based cyber attacks. He holds a Ph.D. in electrical engineering from Georgia Tech and has won numerous programming competitions, including the DARPA Spectrum Collaboration Challenge.\n\nThe opinions expressed are the author’s alone and do not necessarily reflect the views of Cointelegraph. This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZGVjcnlwdC5jby8xNTA2NDcvYmFsZC1jb2luLWJhc2VkLWV0aGVyZXVtLWJhc2UtbGF5ZXItMi1jb2luYmFzZdIBTmh0dHBzOi8vZGVjcnlwdC5jby8xNTA2NDcvYmFsZC1jb2luLWJhc2VkLWV0aGVyZXVtLWJhc2UtbGF5ZXItMi1jb2luYmFzZT9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jul 2023 07:00:00 GMT",
        "title": "Meme Coin Mania Drives Degens to Base, the Ethereum Level-2 Chain from Coinbase - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\n“If you build it, they will come,” a mysterious voice whispered to Kevin Costner in Field of Dreams—yet the phrase seems to ring equally true for degens in search of lucrative gains on Coinbase’s Ethereum layer-2 network Base.\n\nThe network, which Coinbase launched for developers on July 13, has seen an influx of recent activity related to meme coins. Traders are snapping up obscure tokens like BALD, COIN, and BASED on the network using the decentralized exchange LeetSwap.\n\nLeetSwap has recorded nearly $200 million in trading volume over the past day across 377,000 transactions, according to DEX Screener. Aside from RocketSwap, LeetSwap is the only other decentralized exchange on Base where tokens can trade without reliance on financial intermediaries.\n\nAD\n\nAD\n\nMore than half of LeetSwap’s daily trading volume was comprised of BALD transactions. The token, possibly a reference to Coinbase CEO Brian Armstrong’s shaved head, has surged close to 3,100% over the past day to $0.06718.\n\nBASED had bounced more than 1,000,000% over the same period, and it currently trades hands at $0.02916. The token, despite being around for less than a day, has already notched a market capitalization of $291 million.\n\nOther nascent tokens have notched dizzying gains. Not to be confused with Coinbase’s stock ticker name on the Nasdaq, COIN eclipsed $0.17 on around $1.1 million in daily trading volume, posting gains of 15,400% over the past 24 hours.\n\nBase’s public launch is slated for August. And at the moment, there’s no official way for traders to bridge Ethereum from its mainnet over to Base. However, a so-called Portal Proxy Contract allows developers to do just that.\n\nOn Sunday alone, $54 million of Ethereum had been bridged to Base, according to a Dune Analytics dashboard. The day before, less than $750,000 worth of Ethereum was ported over to Base.\n\nAD\n\nAD\n\nHowever, withdrawing tokens from Base before its public launch is less straightforward than sending Ethereum to a smart contract. Coinbase provides a link to a GitHub repository for developers with details on how to achieve that.\n\nCoinbase built Base in collaboration with Optimism, the Ethereum scaling solution that uses Optimistic Rollups to process transactions in batches and reduce fees.\n\nDecentralized exchanges are a common venue for meme coin mania to take hold. Anyone can create a token, and without strict parameters for which ones get listed, decentralized exchanges are perhaps about as Wild West as crypto gets.\n\nNoted crypto influencer Lady of Crypto said on Twitter that degens were effectively gambling with their hard-earned Ethereum. While she said she’d bridged over some funds to partake in the mania, she also warned followers to be vigilant against scammers and rug pulls.\n\n“I fully expect to lose it all,” she said. “If you are going to gamble on BASE, make sure it's money you can afford to lose.”\n\nYou hear some people made 40,000% or whatever buying $BALD. You google how to bridge your ETH to $BASE and you move it over. You are going to be so rich. You know it. You are going to turn $100 into $1 million, retire, buy that Lambo and finally get a gf. It's all so easy... 👇… — Lady of Crypto (@LadyofCrypto1) July 30, 2023"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vdW5jaGFpbmVkY3J5cHRvLmNvbS9jdXJ2ZS1leHBsb2l0LXJlc3VsdHMtaW4tbGFyZ2VzdC1tZXYtYmxvY2stcmV3YXJkcy1pbi1ldGhlcmV1bXMtaGlzdG9yeS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Curve Exploit Results in Largest MEV Block Rewards in Ethereum's History - Unchained - Unchained",
        "content": "MEV bots front running exploiters on Curve pools generated some of the largest reward blocks ever seen on Ethereum.\n\nEthereum core developer Eric Connor revealed that a Maximal Extractable Value (MEV) bot received 584 ETH, worth over $1 million, from front running an incoming hack in the transaction mempool.\n\nToday has produced some of the largest MEV reward blocks in Ethereum’s history. Slot 6,992,273: 584 ETH\n\nSlot 6,993,342: 345 ETH\n\nSlot 6,992,050: 247 ETH\n\nSlot 6,993,346: 51 ETH — eric.eth (@econoar) July 30, 2023\n\nSeveral other significant MEV block rewards were recorded around the same time, with the recipients earning 345 ETH, 247 ETH and 51 ETH. The rewards stem from front running transactions sent by exploits that took place on Curve Finance’s liquidity pools on Sunday.\n\nNotably, these MEV rewards are the largest recorded in the history of Ethereum, incidentally falling on the network’s eighth official year in existence.\n\nIn order to earn these rewards, MEV bots reproduce and front run transactions by paying the block producers a significant amount of ETH to move their transactions up to the front of the line.\n\n“They’re paying money that was stolen from victims as kickback bribes to Ethereum validators,” wrote one user on Twitter.\n\nWhile several market participants questioned the morality of block producers keeping these rewards that came from hacked funds, Connor opined that returning the funds is likely more complex than it appears on the surface, while noting it is “probably a legal grey area.”\n\n\n\nMeanwhile, at least one MEV bot deployer has returned funds after front running a hacker’s transaction. Blockchain data shows that “c0ffeebabe.eth” returned 2,879 ETH worth $5.3 million to the Curve deployer contract."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1taWxsaW9uLWRvbGxhci1tZXYtYmxvY2stcmV3YXJkLWFtaWQtY3VydmUtZmluYW5jZS1leHBsb2l00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Ethereum logs $1M MEV block reward amid Curve Finance exploit - Cointelegraph",
        "content": "The recent Curve Finance exploit has reportedly led to one of the largest ever maximal extractable value (MEV) reward blocks of 584.05 Ether (ETH).\n\nOn July 31, Ethereum core developer “eric.eth” reported that “today has produced some of the largest MEV reward blocks in Ethereum’s history,” adding it was caused by the exploit of Curve Finance stable pools on July 30.\n\nData shows a larger MEV reward block of 692 ETH was recorded in March.\n\n“A bot notices an incoming hack in the mempool, reproduces the tx [transaction] and front runs it”, he explained before adding, “To do so they pay the block producer a lot of ETH to be front of the line.”\n\nToday has produced some of the largest MEV reward blocks in Ethereum’s history.\n\n\n\nSlot 6,992,273: 584 ETH\n\nSlot 6,993,342: 345 ETH\n\nSlot 6,992,050: 247 ETH\n\nSlot 6,993,346: 51 ETH — eric.eth (@econoar) July 30, 2023\n\nA MEV bot is designed to generate extra revenue by reordering and/or inserting transactions in an otherwise normal block to generate arbitrage opportunities.\n\nMEV bots can also see pending liquidation transactions and front-run them to buy the liquidated assets first at a discount.\n\nThe validator gets to propose a block using a relay that outsources their block production to entities specialized in extracting this extra revenue. They will get a cut of this revenue in exchange for allowing the MEV bot to front-run the transaction.\n\nThis is known as the “block reward” and some huge ones have been logged over the past few hours.\n\nThe highest MEV bot block reward was 584.05 ETH, valued at around $1 million, confirmed at 1.34 am UTC on July 31, according to Beaconcha.in. There were also block rewards for 345 ETH and 247 ETH around that time.\n\nRelated: Vyper vulnerability exposes DeFi ecosystem to stress tests\n\nMoral questions were raised among the responses to the tweet and the implications of potentially illicit funds being used to pay validators to allow the front-running of transactions.\n\n“And this is where the morality of MEV rewards going to miners gets pretty shady. These are effectively hacked funds.”\n\nIn April, a Subway-themed trading bot made millions in extractable value by using “sandwich attacks” during the memecoin trading frenzy.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Should crypto projects ever negotiate with hackers? Probably"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9hbGliYWJhLXNpbHZlci1nb2xkLWJpdGNvaW4tZXRoZXJldW0tbWlrZS1ub3ZvZ3JhdHotaWRlYWwtcG9ydGZvbGlv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jul 2023 07:00:00 GMT",
        "title": "Alibaba, silver, gold, Bitcoin, Ethereum: Mike Novogratz's ideal portfolio - Cointelegraph",
        "content": "Galaxy Digital founder Mike Novogratz shared what an ideal investment portfolio would look like for a young and high-risk tolerance investor during an interview with Bloomberg Wealth, saying that he’d invest in the Chinese giant Alibaba, silver, gold, Bitcoin (BTC) and Ethe(ETH).\n\n“If they were young and had a high-risk tolerance, I’d be buying Alibaba stock. I’d be buying silver, gold, Bitcoin and Ethereum. That’d be my portfolio,” he said in allusion to someone investing $100,000. For those with lower risk tolerance, he recommended allocating only 30% of a portfolio in the example, with the remaining 70% in bonds and perhaps index funds.\n\nNovogratz’s bullish stance on Bitcoin received a boost from BlackRock's application for a spot Bitcoin exchange-traded fund (ETF) in June. In his opinion, the application was the biggest Bitcoin development of 2023.\n\n“The most important thing that happened this year in Bitcoin is Larry Fink.”\n\nRelated: Grayscale urges SEC to approve all Bitcoin ETFs simultaneously\n\nFink, the billionaire CEO of BlackRock, was initially a “nonbeliever,” Novogratz said.\n\n“Now he says, ‘Hey, this is going to be a global currency. People around the world all trust it.’ He got ‘orange-pilled,’ as we say. Orange pill is when you take a nonbeliever, and you make them a believer in Bitcoin.”\n\nBlackRock's push into Bitcoin is part of an adoption cycle, according to Novogratz, which could lead the price of Bitcoin to reach new highs, especially if the Federal Reserve starts cutting interest rates.\n\nAlso commenting on the recent decision in Ripple's case vs. the Securities and Exchange Commission, in which Ripple’s XRP (XRP) token has been partially classified as a security, Novogratz stated that the decision was a victory for the crypto industry as it proves that “the rules are nothing close to clear.”\n\nMagazine: Should you ‘orange pill’ children? The case for Bitcoin kids books"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vZGVjcnlwdC5jby8xNTA2NjkvZGVmaS1leGNoYW5nZS1jdXJ2ZS1maW5hbmNlLWNvbmZpcm1zLXZhcmlvdXMtZXRoZXJldW0tcG9vbHMtaGFja2Vk0gFiaHR0cHM6Ly9kZWNyeXB0LmNvLzE1MDY2OS9kZWZpLWV4Y2hhbmdlLWN1cnZlLWZpbmFuY2UtY29uZmlybXMtdmFyaW91cy1ldGhlcmV1bS1wb29scy1oYWNrZWQ_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "DeFi Exchange Curve Finance Confirms Various Ethereum Pools Hacked - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThis morning, Curve Finance said that apart from several Ethereum pools, an Arbitrum-based liquidity pool may have also been \"potentially affected\" over the weekend.\n\nCurve Finance is a popular decentralized exchange (DEX), letting users swap like-assets such as Ethereum for Staked Ethereum, or Tether's USDT for Circle's USDC. It can be a helpful arbitrage tool for many traders should those assets decouple in price from one another.\n\nPer initial reports, the platform was exploited on Sunday for over $24 million. However, blockchain security firm PeckShield has updated the stolen amount to $52 million as the hack unfolds in real-time.\n\nAD\n\nAD\n\nThe decentralized exchange’s team wrote in the tweet that four liquidity pools for tokens paired with Ethereum (ETH) and Curve governance token CRV, and several ERC-20 tokens issued on Alchemix (alETH), Metronome Synth (smETH), JPEG’d (pETH) “were hacked” due to an “issue in Vyper compiler” versions.\n\nVyper is a programming language for writing smart contracts on the Ethereum blockchain. The programming language’s core team tweeted this morning some older versions of the Vyper programming language were vulnerable to exploitation.\n\nPSA: Vyper versions 0.2.15, 0.2.16 and 0.3.0 are vulnerable to malfunctioning reentrancy locks. The investigation is ongoing but any project relying on these versions should immediately reach out to us. — Vyper (@vyperlang) July 30, 2023\n\nA lead contributor for the programming language also took to Twitter, saying that the hackers likely spend \"weeks to months to find\" the vulnerability.\n\nThe latest tweet by Curve's team highlighted another knock-on effect on the Vyper-based liquidity pool on its deployment on the layer-2 solution Arbitrum. The team said that Tricrypto, made of three tokens: USDC, wBTC, and ETH was “potentially affected.”\n\nAD\n\nAD\n\nThe tweet read that while security experts like auditors and Vyper devs have not yet found a way for a “profitable exploit,” the pools remain vulnerable and advised liquidity providers to “exit that one.”\n\nElsewhere, another BNB Chain-based DEX Ellipsis has reported an exploit of stable swap pools on BNB Chain.\n\nA small number of stablepools with BNB using an old Vyper compiler have been exploited. We are assessing the situation and will update the community on any further findings. https://t.co/pxkhRRSr5w — Ellipsis (@Ellipsisfi) July 30, 2023\n\nSouth Korean crypto exchange Upbit announced the temporary suspension of deposits and withdrawals of CRV tokens as a precautionary measure.\n\nThe exchange wrote in the press release that, “Upbit will continue to monitor this situation, and members are advised to pay attention to the increase in price volatility of Curve.”"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZmluYm9sZC5jb20vbWFjaGluZS1sZWFybmluZy1hbGdvcml0aG0tc2V0cy1ldGhlcmV1bS1wcmljZS1mb3ItZW5kLW9mLWF1Z3VzdC0yMDIzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Machine learning algorithm sets Ethereum price for end of August 2023 - Finbold - Finance in Bold",
        "content": "After a remarkable journey of eight years since its inception, Ethereum (ETH) stands steadfast as the second-largest cryptocurrency in terms of market capitalization.\n\nIts flexible blockchain infrastructure continues to underpin a myriad of applications, ranging from DeFi platforms to robust supply chain systems. Moreover, the transition to a Proof-of-Stake (PoS) consensus model holds promise in addressing scalability concerns and environmental impact.\n\nCurrently, Ethereum is eyeing a crucial milestone at the $1,900 level, considering its recent trading activity characterized by a tight consolidation over the past week. In light of this, Finbold has sought insights from the widely-used price prediction tool on PricePredictions.com, which harnesses the power of cutting-edge machine learning algorithms to assess the digital asset’s potential value by the end of August.\n\nNoteworthy findings from the tool indicate a projected trading price of $1,785 for ETH on August 31, 2023, based on the data retrieved by Finbold on July 31.\n\nMachine algorithm’s ETH price prediction for August 31, 2023. Source: PricePredictions\n\n\n\n\n\nThe above forecast is based on several key technical indicators, including the moving average convergence divergence (MACD), relative strength index (RSI), Bollinger Bands (BB), and more.\n\nETH price analysis\n\nETH is currently trading at $1,866, experiencing a marginal decline of 0.4% for the day, mirroring a similar trend observed throughout the previous week.\n\nThe cryptocurrency encounters a support level at $1,811, which is essential in preventing further downward movements, while facing resistance at $1,926, acting as a barrier to potential upward surges. Notably, ETH is positioned above its 200-day simple moving average, indicating a positive long-term trend in its price movement.\n\nETH 1-day price chart. Source: Finbold\n\n\n\n\n\nIn the past 30 days, Ethereum has witnessed only 12 green days, representing 40% of the time, signifying a relatively moderate bullish momentum during this period.\n\nAdding further insight to the analysis, the 1-week technical analysis (TA) demonstrates a mixed sentiment towards Ethereum, suggesting a ‘neutral’ rating of 10 in their summary. This is derived from oscillators currently residing in the ‘sell’ zone at 2, implying a balanced view of the asset’s price action. Additionally, the moving averages (MA) exhibit a ‘buy’ signal at 10, reinforcing some positive outlook for ETH’s future performance.\n\nETH technical analysis 1-Week gauges. Source: TradingView\n\nConsidering these indicators and the broader market context, Ethereum appears to be attracting favorable sentiment from analysts and traders, indicating the potential for further price appreciation.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3RvcC0zLXByaWNlLXByZWRpY3Rpb24tYml0Y29pbi1ldGhlcmV1bS1yaXBwbGUtc29nZ3ktYnRjLXRvLW1vdmUtc29vbi0yMDIzMDczMTE5MDLSAYUBaHR0cHM6Ly93d3cuZnhzdHJlZXQuY29tL2FtcC9jcnlwdG9jdXJyZW5jaWVzL25ld3MvdG9wLTMtcHJpY2UtcHJlZGljdGlvbi1iaXRjb2luLWV0aGVyZXVtLXJpcHBsZS1zb2dneS1idGMtdG8tbW92ZS1zb29uLTIwMjMwNzMxMTkwMg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC produces fresh lows at the start of new week - FXStreet",
        "content": "Share:\n\nBitcoin price consolidation appears drenched and at risk of breaking below the $28,930 support as overhead pressure builds.\n\nEthereum price could fall 5% to $1,791 amid increasing volatility and growing BTC influence.\n\nRipple price could pivot around $0.684 before the next move north as uncollected liquidity beckons.\n\nBitcoin (BTC) price ended its rangebound movement as it slipped nearly 3% between late July 31 and early August 1. The sweep of key lows could trigger a rally in later in the week, but investors need not hold their breath. The aura of this dormancy that penetrated altcoins, including Ethereum (ETH) and Ripple (XRP), could likely end if BTC makes a strong recovery rally to $30,000.\n\nAlso Read: Bitcoin teases $29.5K, Ether drops as 'accumulator season' begins\n\nBitcoin price shows saturation as momentum falls\n\nBitcoin (BTC) price is edging west, with neither bulls nor bears showing the upper hand. The king of crypto is showing signs of diminishing volatility that puts it at a standstill tethered to the 100-day Exponential Moving Average (EMA) at $29,349.\n\nNevertheless, trending markets can only hold out for so long, and the next move could present soon. With the Relative Strength Index (RSI) lower than 50 and tipping south, and the histograms of the Awesome Oscillators (AO) in the negative, Bitcoin price is more likely to head lower as momentum continues to fall.\n\nPossible inflection points for Bitcoin price are the $28,930 level or in the dire case the 200-day EMA at $28,464 on the 12-hour chart below. Failure to turnaround at these buyer congestion levels could expose BTC to a cliff, potentially toward the $27,000 range.\n\nBTC/USDT 12-hour chart\n\nConversely, bulls coming in at the aforementioned levels could revitalize Bitcoin price, fueling a breach from the 100-day EMA foothold at $29,349. An increase in buyer momentum beyond the 50-day EMA at $29,646 would be ideal, as a flip of this supplier congestion level into support would clear the path for a possible move to $31,462.\n\nA decisive move past this level would solidify an uptrend for Bitcoin price.\n\nAlso Read: Bitcoin hovers below $30,000 as Coinbase CEO recalls SEC's request before the lawsuit\n\nEthereum price mimics BTC\n\nEthereum (ETH) price is moving in harmony as BTC, consolidating sideways as domination under the 50-day EMA at the $1,870 level continues. As the Bitcoin influence weighs down on ETH, the largest altcoin by market capitalization could be due for a fall as volatility grows.\n\nWith the RSI momentum indicator below the 50 level, Ethereum price could lose the immediate support offered by the 100-day EMA at $1,842. A fall through this support level could see ETH revisit the June 21 lows marked by the support confluence between the horizontal line and the 200-day EMA at $1,782. Such a move would constitute a 5% drop from current levels.\n\nETH/USDT 1-Day chart\n\nConversely, if bullish momentum builds above the 100-day EMA, Ethereum price could ascend to flip the 50-day EMA back to support. An increase in buyer momentum could push ETH above the $1,953 resistance level, but for a confirmed uptrend, ETH must decisively breach the $2,019 hurdle.\n\nAlso Read: Ethereum logs $1M MEV block reward amid Curve Finance exploit\n\nRipple price to drop before the next climb\n\nRipple (XRP) price eyes a 3% drop to collect buy side liquidity that remains uncollected under the $0.684 support level. Such a move could then see XRP turnaround to the north, with the developed price action providing a possible reentry point for willing investors.\n\nHowever, an uptrend would only be confirmed upon a strong move above the $0.826 resistance level. Notably, both the RSI and AO still favor the bulls, and with the 50-, 100-, and 200-day EMAs at $0.615, $0.556 and $0.506 respectively heading north, the odds favor the bulls.\n\nXRP/USDT 1-Day Chart\n\nNot ignoring the consequences of early profit-taking, there is also a likelihood of Ripple price falling below the $0.684 support and giving back all the ground covered in the July 13 rally.\n\nAlso Read: Pro-XRP attorney John Deaton considers XRP ruling the most significant non-fraud SEC enforcement action"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vOC15ZWFyLWRvcm1hbnQtZXRoZXJldW0td2FsbGV0LWp1c3QtbW92ZWQtMS0yLW1pbGxpb24taW4tZXRoLWhlcmVzLXRoZS1kZXN0aW5hdGlvbi_SAX1odHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2V0aGVyZXVtLzgteWVhci1kb3JtYW50LWV0aGVyZXVtLXdhbGxldC1qdXN0LW1vdmVkLTEtMi1taWxsaW9uLWluLWV0aC1oZXJlcy10aGUtZGVzdGluYXRpb24vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "8-Year Dormant Ethereum Wallet Just Moved $1.2 Million In ETH, Here’s The Destination - NewsBTC",
        "content": "The Ethereum ecosystem has continued to see fascinating developments in the past weeks. Among the most notable is the sudden movement from a participant in Ethereum’s initial coin offering (ICO), who, after a roughly eight-year slumber, has sprung into action due to a reason.\n\nThe Ethereum ICO participant, whose address remained inactive for 2,922 days, stirred up by transferring 641 ether, an amount currently valued at nearly $1.2 million.\n\nAn Unexpected Move In The Ethereum Ecosystem\n\nThe intent behind these transactions was revealed through on-chain analytics X (Twitter) account Lookonchain, noting that the Ethereum ICO participant had moved the funds to stake them. This reason has raised speculation among the crypto community as some suggest that the whale behind this move might know something they don’t.\n\nRelated Reading: Ethereum Price Recovery Could Soon Fade If ETH Fails To Surpass $1,900\n\nAn Ethereum ICO participant woke up after 8 years of dormancy, transferred 641 $ETH out, and started staking. He received 2K $ETH($3.7M currently) at Ethereum Genesis, the ETH ICO price is ~$0.31.https://t.co/hGoCb22LVr pic.twitter.com/ZO09r9uFMd — Lookonchain (@lookonchain) July 31, 2023\n\nJust over eight years ago, the same address received exactly 2,000 ETH from Ethereum’s Genesis. This amount of ETH at the time was worth $620 as the Ethereum network arranged an exceptional sale event then that made ETH sell for $0.31 per ETH.\n\nThis event was before the network commenced its own token generation, providing a platform for early participants and co-founders to accrue pre-mined ETH. However, fast forward to nearly a decade later today, this same amount of 2,000 ETH is currently valued at over $3.72 million, showcasing the meteoric rise in the value of ETH since its inception.\n\nNotably, the awakening of this long-dormant Ethereum participant is not an isolated incident. It falls into a recent trend, observed over the summer, where several early ICO participants have begun transferring their ETH holdings.\n\nICO Participants Stirring After A Long Hiatus\n\nThis pattern of dormant Ethereum ICO participants springing into action isn’t new. Two weeks prior to the latest transaction, a pre-mined stash of Ethereum, which had been lying dormant for nearly eight years, was abruptly moved. At current rates, this stash is estimated to be worth more than $100 million.\n\nThis particular ‘whale’ move grabbed the attention of the crypto community, stirring speculation and interest in equal measure. Interestingly, the motives behind this transfer remain largely unknown, adding an element of mystery to the whale movement.\n\nRegardless of these ICO participants’ movement on the blockchain, Ethereum has seen a continuous downtrend in the past few weeks. Particularly, the asset is currently down by 3.2% in the past 14 days. ETH has declined from a high of trading above $1,900 to a trading price of $1,866, at the time of writing.\n\nFeatured image from Unsplash, Chart from TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY3J5cHRvdGlja2VyLmlvL2VuL2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tYXMtY3J5cHRvcy1jb25zb2xpZGF0ZXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction as Cryptos Consolidates...ETH at $2,500 in sight? - CryptoTicker.io - Bitcoin Price, Ethereum Price & Crypto News",
        "content": "The Ethereum price has moved almost exclusively sideways in the last few days and has seen little movement. The Ethereum course follows the development of the Bitcoin course. In the coming month of August, however, there could be a major breakout in the ETH price. What is the Ethereum price prediction for the coming month?\n\nEthereum Price Analysis for end of July 2023\n\nThe Ethereum price recently fell back below the $1,900 mark in response to the Bitcoin price drop to $29,000. However, the price has risen slightly again in the last few days from below $1,850.\n\nFrom $1,840, the Ethereum price rose slightly towards $1,880. Nevertheless, the trend continues to point sideways over the last 1 to 2 weeks. The Ethereum forecast for August is therefore not easy to make.\n\nWill Ethereum Price go up in August?\n\nThe Ethereum forecast for the coming weeks is not easy to make due to the price movement of the last few days and weeks. However, given the external factors, we can make informed assumptions.\n\nThe Ethereum price has mostly moved within a range between 1,850 and 1,950 dollars in the last few weeks. This sideways movement appears to be a “time bomb” that could soon burst with a massive rise or fall. We could see a sharp rise or fall in price soon.\n\nThe Blackrock Bitcoin ETF approval process has many investors holding their breath right now. If the application is approved soon or the first rumors of a successful application appear, not only could the Bitcoin price rise, but also the Ethereum price.\n\nEthereum Price Prediction: How high will Ethereum Price reach?\n\nThe Ethereum price could rise significantly in the coming weeks if the market breaks out to the upside. The resistance at $2,000 would have to be broken. If this happens, the Ethereum price could rise towards the $2,500 level in the forecast.\n\nWe anticipate that there should be a major increase in Ethereum price in August and the price will move towards this mark. We therefore assume an Ethereum forecast of $2,150 to $2,350 for the end of August.\n\n\n\n\n\nYou might also like\n\nMore from Altcoin"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3Mvc2hpYmEtaW51LW1vcmUtcG9wdWxhci10aGFuLWV0aGVyZXVtLWRvZ2Vjb2luLWluLXRoZS11LXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Shiba Inu More Popular Than Ethereum, Dogecoin in the U.S. - Watcher Guru",
        "content": "According to a study conducted by Cryptobetting.com, Shiba Inu (SHIB) is more popular than Ethereum (ETH) and Dogecoin (DOGE) in the United States. According to the study, the popular dog-themed crypto is the second most popular project in the U.S., only behind Bitcoin (BTC).\n\nThe study used search volume data to compare the top 100 cryptocurrencies by market cap and revealed that Bitcoin had a search volume of 1,910,000, while SHIB had 484,000. Dogecoin came in at third place with 280,000, while Ethereum took fourth place with 238,000.\n\nAlso Read: Shiba Inu or Dogecoin: Which Token Can Make You a Millionaire First?\n\nIt is not surprising to see such high search volumes for SHIB. The crypto token is not only popular in the U.S., but all around the globe. However, one should take note of the stark difference between BTC’s search volume and the other projects. The numbers clearly show that the original crypto is still king. However, that does not take anything away from SHIB and DOGE, the two most popular memecoins.\n\nWill Shiba Inu’s popularity drive up demand?\n\nSource: The Coin Republic\n\nSHIB has struggled to perform in 2023. Although the token is extremely popular, buying demand has been scarce. Moreover, the project’s upcoming layer-2 network, Shibarium, does not have an exact launch date. The launch is one of the only things that may help drive up demand, and consequently the asset’s price.\n\nHowever, the repeated delays and the lack of a launch date has hurt investor confidence. Nonetheless, users expect the network to make a debut sometime in August. According to the blockchain infrastructure provider NOWNodes, Shibarium is undergoing its final tests.\n\nAlso Read: Shiba Inu: How Much Can You Make If SHIB Deletes Two Zeroes?\n\nShiba Inu (SHIB) has finally crossed the $0.000008 level, which it had struggled to do for many months. At press time, SHIB was trading at $0.00000832, up by 6.9% over the previous week. However, its price has fallen by 3.8% in the last 24 hours."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDcvMzEvZXRoZXJldW0tcmVjb3Jkcy1sYXJnZXN0LW1ldi1yZXdhcmQtYmxvY2tzLWFtaWQtY3VydmUtZXhwbG9pdC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Records Largest MEV Reward Blocks Amid Curve Exploit - Crypto Times",
        "content": "The recent exploit on Curve has led Ethereum blocks to be filled with some of the largest MEV transactions. As such a single block generated 584 ETH in rewards.\n\nCurve Finance, one of the biggest DeFi protocols, was targeted in a recent exploit on Sunday. Following this exploit, the front-running transactions surged leading to generate substantial rewards for block producers.\n\nEthereum developer, eric.eth highlighted the event citing that it has produced some of the largest MEV reward blocks in Ethereum’s history.\n\nToday has produced some of the largest MEV reward blocks in Ethereum’s history.\n\n\n\nSlot 6,992,273: 584 ETH\n\nSlot 6,993,342: 345 ETH\n\nSlot 6,992,050: 247 ETH\n\nSlot 6,993,346: 51 ETH — eric.eth (@econoar) July 30, 2023\n\nWhile explaining the scenario, Eric.eth said, “A (MEV) bot notices an incoming hack in the mempool, reproduces the tx and front runs it. To do so they pay the block producer a lot of ETH to be at front of the line.”\n\nThe MEV bots are designed to make profits from arbitrageurs trades. It do so by analyzing mempool transactions and inserting its own transaction in between to generate post-execution profitable trades.\n\nAmong the latest MEV block rewards, the highest was 584.05 ETH – accounting for approximately $1 million – while others were 345 ETH and 247 ETH. In March, similar has happened when memecoins were trending earlier this year.\n\nOn late Sunday, several DeFi protocols including Curve were exploited due to a critical vulnerability in Vyper, a programming language used to code smart contracts."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vdGhlZGVmaWFudC5pby9wcm9wb3NlZC1ldGhlcmV1bS11cGdyYWRlLWNvdWxkLWFsbG93LWxheWVyLTItZGV2ZWxvcGVycy10by1zaGFyZS1mZWUtcmV2ZW51ZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 03:56:44 GMT",
        "title": "Proposed Ethereum Upgrade Could Allow Layer 2 Developers To Share Fee Revenue - The Defiant - DeFi News",
        "content": "EIP-6968 Would Introduce ‘Contract Secured Revenue,’ Allowing DApps To Earn A Share Of Transaction Fees Generated By Their Users\n\nBy: Samuel Haig • Loading...\n\nDeFi News\n\nEthereum developers are proposing an upgrade that would let popular dApps earn a share of the transaction fees they generate on Layer 2.\n\nEIP-6968 proposes a new type of token providing “contract secured revenue” (CSR), allowing developers to claim a percentage of the transaction fees generated by users interacting with their smart contracts.\n\n“With CSR, now projects can band together, create an L2 around their shared memes/values, [and] share sequencer fee revenue based on who drives the most usage,” tweeted Kevin Owocki, one of the proposal’s co-authors. “If adopted, this would allow smart contract developers who deploy on L2s to access a potentially lucrative revenue stream.”’\n\nNew revenues generated could fund dApp development, public goods, or enable incentives for developers to join a network.\n\nWhile Owocki first outlined EIP-6968 in May, the proposal has gained renewed traction following a presentation by Owocki at the recent EthCC conference in Paris.\n\nFunding Development With Transaction Fees\n\nEIP-6968 seeks to shake up the highly competitive Ethereum scaling sector, with CSR providing a new type of incentive for developers.\n\nWhile Layer 2 rollups are presently the leading scaling solution, top L2 teams including Arbitrum, Polygon, and zkSync are already investing resources into building infrastructure for Layer 3 networks.\n\nL3s typically comprise “app-chains” that host a single dedicated decentralized application. Owocki described EIP-6968 as enabling “ecosystem-chains,” described as a step forward from app-chains.\n\nThe proposed upgrade is a modified version of EIP-1559, which went live in August 2021 and introduced Ethereum’s burn mechanism. The authors note that EIP-6968 could be used by any network using EIP-1559.\n\n“Using protocol rewards of an L1 to fund smart contract development would be a big change to the way the current market works,” the proposal reads.\n\nDeFi Alpha Premium Content DeFi Daily | Weekdays\n\nDeFi Alpha Letter | Weekly\n\nDefiant Podcast Transcript | Weekly\n\nInbox Dump | Saturday\n\nWeekly Recap | Sunday Looking for Alpha? Become a premium member of The Defiant and join our DeFi Alpha community. Start for free\n\n“I’m excited to see what kind of traction this creates within the L2 ecosystem, and envision a virtuous flywheel where we see smart contract developers receive revenue for the value they bring to L2s,” Owocki wrote on the Ethereum Magicians forum."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9hcy1ldGhlcmV1bS10dXJucy04LWhlcmVzLWEtbG9vay1hdC1pdHMtc3BlY3RhY3VsYXItam91cm5leS_SAVZodHRwczovL2FtYmNyeXB0by5jb20vYXMtZXRoZXJldW0tdHVybnMtOC1oZXJlcy1hLWxvb2stYXQtaXRzLXNwZWN0YWN1bGFyLWpvdXJuZXkvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "As Ethereum turns 8, here’s a look at its spectacular journey - AMBCrypto News",
        "content": "Ethereum Foundation celebrated the anniversary of the rollout of the network.\n\nPopular figures chimed in to share the network’s top moments.\n\nEthereum[ETH] has been one of the most prominent networks in the crypto market and has established itself as blue-chip cryptocurrency over the last 8 years. Despite various ups and downs and differences amongst the Ethereum community, the network has made steady improvements and has continued to show growth.\n\nIs your portfolio green? Check out the Ethereum Profit Calculator\n\n8 trips around the sun\n\nFormer Ethereum Foundation CCO Stephan Tual announced the official network rollout in a blog post on July 30, 2015. Since then, Ethereum and its native currency ETH have become the second-largest crypto asset globally, with a market capitalization of $225 billion.\n\nIn the past 8 years, the price of ETH has experienced a remarkable journey, soaring from less than $1 to its current trading value of $1,865.82 at the time of writing.\n\nDuring its initial phase, Ethereum had around 10,000 holders, but as time progressed, the number of holders surged significantly to reach an impressive 103.96 million. This tremendous growth in both its price and holder base underscores the widespread adoption and success of the Ethereum network over the years.\n\nCrypto celebrities chime in with wishes\n\nMany prominent figures in the crypto space shared their thoughts on Ethereum’s 8th birthday. Sandeep Nailwal, the founder of Polygon, shared photos of him and Vitalik Buterin in India, celebrating Ethereum’s milestone.\n\nCelebrating Ethereum’s eighth birthday with @VitalikButerin with Indian “Ghever” as cake ? in Bengaluru Happy Birthday Ethereum! Also getting Vitalik do a bit of Bharat Darshanam ? pic.twitter.com/CEBtoSzQZB — Sandeep Nailwal | sandeep. polygon ? (@sandeepnailwal) July 30, 2023\n\nChangpeng Zhao, CEO of Binance, also penned a note for Ethereum. In his tweet, CZ shared a photo from 2015 that was taken during Vitalik Buterin’s stay in Tokyo. He revealed that Vitalik was already fully immersed in working on and discussing ETH at that time.\n\nInterestingly, CZ also expressed regret for not purchasing Ethereum during that period.\n\nOn this 8th birthday of #Ethereum, a little throw back to May 2, 2015, in Tokyo??, just before #ETH was officially born. @VitalikButerin stayed in my apartment in Tokyo during this trip. He was already working on and talking about ETH non-stop. And I still missed (didn't buy)… pic.twitter.com/84B6KN73Qf — CZ ? Binance (@cz_binance) July 30, 2023\n\nMoreover, he contemplated the possibility that had he invested in Ethereum early on, he might not have been motivated or felt the need to establish Binance, given the potential gains from investing in the cryptocurrency.\n\nFounders of Avalanche and Solana, also joined in and wished the cryptocurrency network a happy birthday on Twitter.\n\nStake instead of Cake\n\nIn the past year, the Ethereum network underwent two significant updates. Among these updates, the implementation of the Merge on September 15, 2022, stands out as one of the most pivotal moments.\n\nWith the successful execution of the Merge upgrade, the network made a crucial transition from a proof-of-work to a proof-of-stake consensus mechanism. This transition resulted in a reduction in energy consumption, addressing concerns about environmental impact, and also introduced staking incentives for validators and investors.\n\nThe other update was the Shapella upgrade which occurred on 12 April, 2023. This allowed users to unlock their staked ETH from the beacon chain. Following this upgrade, the interest in staking skyrocketed. Even though the interest in staking slowly faded after the fact, an old Ethereum holder’s behavior could soon re-ignite the staking flame.\n\nDuring Ethereum’s 8th Birthday celebration, an individual who participated in the Ethereum ICO reappeared after 8 years of inactivity. Astonishingly, the participant transferred 641 ETH from his dormant account and promptly engaged in staking.\n\nHow much are 1,10,100 ETHs worth today?\n\nAt the time of the Ethereum Genesis, this participant had obtained 2,000 ETH, which now amounts to $3.7 million. It was noteworthy that the initial price of ETH during the ICO was just around $0.31.\n\nAn Ethereum ICO participant woke up after 8 years of dormancy, transferred 641 $ETH out, and started staking. He received 2K $ETH($3.7M currently) at Ethereum Genesis, the ETH ICO price is ~$0.31.https://t.co/hGoCb22LVr pic.twitter.com/ZO09r9uFMd — Lookonchain (@lookonchain) July 31, 2023\n\nThis optimism was also showcased by Ethereum validators. According to staking rewards’ data, the number of validators on the network grew by 8.96% over the last month. At press time, the total number of validators on the Ethereum network was 698,924."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL3d3dy5iZW56aW5nYS5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS8yMy8wNy8zMzQ4MzU5Ni9iaXRjb2luLWV0aGVyZXVtLWRvZ2Vjb2luLXR1bWJsZS1hZnRlci1zZWMtbGF3c3VpdC1hZ2FpbnN0LWludGVybmV0LW1hcmtldGVyLXJpY2hhcmQtaGVhcnTSAS1odHRwczovL3d3dy5iZW56aW5nYS5jb20vYW1wL2NvbnRlbnQvMzM0ODM1OTY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, Dogecoin Tumble After SEC Lawsuit Against Internet Marketer Richard Heart: Analyst Say - Benzinga",
        "content": "Major cryptocurrencies experienced a decline on Monday evening after the Securities and Exchange Commission (SEC) launched a lawsuit against internet marketer Richard Heart, along with his projects Hex, PulseChain, and PulseX. Additionally, the market grappled with the consequences of the recent exploit on the stablecoin exchange Curve.\n\nCryptocurrency Gains +/- Price (Recorded 9:30 p.m. EDT) Bitcoin BTC/USD -0.80% $29,186 Ethereum ETH/USD -0.94% $1852 Dogecoin DOGE/USD -1.31% $0.077\n\nWhat Happened: CRV, the token associated with Curve Finance’s DAO, has experienced a decline of 10.3%, reaching 56 cents.\n\nAnother contributing factor is the lending position held by founder Michael Egorov on the Aave lending protocol. Egorov currently has a substantial $168 million lending position secured by CRV, which is approaching the liquidation point. If the position is liquidated, the consequent rapid price declines could trigger a series of cascading liquidations, leading to a flood of liquidated assets in the market.\n\nTop Gainer (24 Hour)\n\nCryptocurrency Gains +/- Price (Recorded 9:30 p.m. EDT) Bitcoin Gold +12.83% $18.45 Bone Shibaswap +5.90% $1.54 XDC Network +2.88% $0.05927\n\nCurrently, the global crypto market capitalization stands at $1.18 trillion, a 0.78% decrease in the last day.\n\nStocks saw a modest increase on Monday as Wall Street began a busy earnings week, capping off a successful month. The S&P 500 inched up by 0.15%, while the Nasdaq Composite experienced a 0.21% rise.\n\nSee More: Best Crypto Day Trading Strategies\n\nAnalyst Notes: Edward Moya, Senior Analyst at OANDA believes that Curve Finance hack is \"a blow for Ethereum's DeFi ecosystem, but not likely to trigger a massive selloff for Bitcoin.\"\n\nCrypto analyst Benjamin Cowen said Ethereum may not be ready to shine just yet, supported by historical data.\n\nCowen analyzes Ethereum’s historical average monthly return on investment (ROI) and finds that Q3, or the summer months, are generally not the most favorable times to accumulate or hold ETH.\n\n\n\n\"The one-year timeframe shows you that December and January are best, on average. The worst month was July. If you think about it, think about where ETH was last July. It wasn't at a very different price than what it is today, I mean you're talking pretty much the same price, maybe plus or minus a couple of hundred dollars but that's where we were last July. And you can see there's this sort of lull in even the one-year ROI buying in that April, May, June July timeframe but as you get further out into Q4, it tends to go up.\"\n\nPhoto Courtesy: Shutterstock.com\n\nRead Next: Jim Cramer Advises Against Using Binance, Provokes Strong Reactions From Twitter Users"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1sMi13YXItaGVyZXMtaG93LW9wdGltaXNtLW9wLWlzLWZhcmluZy1ub3fSAUdodHRwczovL3UudG9kYXkvZXRoZXJldW0tbDItd2FyLWhlcmVzLWhvdy1vcHRpbWlzbS1vcC1pcy1mYXJpbmctbm93P2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Ethereum L2 War: Here's How Optimism (OP) Is Faring Now - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nThe Ethereum (ETH) Layer 2 scaling war is far from over, with top competing protocols doing all they can to outpace their immediate rivals. Optimism (OP) is currently in the spotlight as it is leading the L2 price resurgence after inking forward by 7.15% in the past 24 hours to $1.70. The current bullish momentum has helped OP extend its growth in the trailing seven-day period, with the coin up 10% in this time span.\n\nOptimism in L2 ecosystem\n\nOptimism has a number of competitors, including but not limited to, Polygon zkEVM, Arbitrum and zkSync. Optimism has been doing all it can to distinguish itself as the right venue for developers looking to get into the Web3.0 ecosystem through Ethereum.\n\nAccording to data from L2Beat, Optimism notably boasts of a maximum Transaction Per Second (TPS) of 10.93, a figure that pales in relation to its peers zkSync Era at 12.85 and Arbitrum at 31.64 but higher than Polygon zkEVM at 1.04.\n\nOptimism is a popular Ethereum scaling protocol, and its popularity is even more pronounced since the introduction of Base, the scaling tool launched earlier this year by Coinbase exchange. The Base protocol was built on the OP Stack, showcasing the attractiveness of the Optimism protocol with respect to its competitors across the board.\n\nMainstream adoption\n\nBesides the growth of Web3.0 developers on the most popular Ethereum scaling solutions and their overall attractiveness in terms of transaction efficiency, the embrace by the general public points to the relevance of each L2 around today.\n\nWhile protocols like Polygon have a very robust profile with respect to its alliances with mainstream brands, Optimism is not faring badly in this regard as well. The protocol has recorded several partnerships surrounding enhancing its functionalities across the board."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvbWFya2V0cy9jbWVzLWxhdGVzdC1iaXRjb2luLWFuZC1ldGhlci1iYXNlZC1wcm9kdWN0LXNldC10by1nby1saXZlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jul 2023 07:00:00 GMT",
        "title": "CME's latest crypto product set to go live as traders flock to Bitcoin, Ethereum derivatives - DLNews",
        "content": "The derivatives exchange will now offer Ether/Bitcoin ratio futures.\n\nVolumes and open interest in crypto derivatives on the CME reached all-time highs this year.\n\nThe recent bullishness of the crypto market has whet investors’ appetites to bet on it, and the CME Group is giving them another opportunity by adding Ether/Bitcoin ratio futures to its suite of crypto products.\n\nThe Chicago-based exchange is one of the world’s leading derivatives exchanges by contracts traded. It recently reported revenue of $1.4 billion and an operating income of $839 million for the second quarter.\n\nFrom Sunday, local time, the new product will allow traders exposure to both Bitcoin and Ethereum in a single and less volatile trade, according to Giovanni Vicioso, head of cryptocurrency products at the CME.\n\nThe new contract is cash-settled to the value of the Ethereum futures price at the settlement date, divided by the corresponding Bitcoin futures price at settlement.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\nHistorically, the ratio has had lower volatility than trading just Bitcoin or Ethereum, Vicioso told DL News. Both assets can now be traded without the need for directional views.\n\nTraders could create a similar trade themselves, but at an added risk. The spread could be done with several legs, the individual components or transactions that make up a trading strategy, but this creates more risk.\n\nEach individual leg has its own risk, and price slippage would become an issue. Pre-packaging the product for traders makes it more effective, Vicioso said.\n\nDerivatives pop on regulatory woes\n\nTraders have increasingly turned to derivatives amid growing regulatory uncertainty and to limit the risk of exposure to unregulated counterparties, especially after the collapse of FTX in November.\n\nJoin the community to get our latest stories and updates\n\nBitcoin and Ethereum have reclaimed lost ground since the beginning of the year after a rough ride in 2022 — though both are still way off record highs. Bitcoin is up more than 70%, while Ethereum has risen 51%.\n\n“The resiliency of the leading two cryptocurrencies by market capitalisation has attracted additional institutional interest for our suite of trusted cryptocurrency products leading to record volume and open interest across our futures and options,” the CME’s second-quarter insights report noted.\n\nOpen interest refers to the total number of outstanding derivative contracts for an asset that haven’t settled.\n\nBitcoin futures volume on the CME just clocked its busiest month of the year. Volumes are approaching $55 billion for July, according to Coinglass data. The average daily volume of cryptocurrency futures and options has risen to record highs this year.\n\nBitcoin and Ethereum derivatives open interest (CME Group)\n\nVicioso told DL News the uptick in activity is a function of the “maturity” of the space.\n\nThe number of large open interest holders has also increased, Vicioso said. LOIHs averaged a record 107 in the second quarter. These are entities that hold at least 25 contracts.\n\n“Traders of all kinds are using our cryptocurrency products to manage risk/exposure around-the-clock and protect and benefit from price movements in Bitcoin and Ether,” the CME’s second quarter crypto insights report noted.\n\nFutures open interest for Bitcoin has been stable in July, David Duong, head of institutional research at Coinbase, wrote on Friday. Almost 472,000 Bitcoin ($13.8 billion) in volume has been done this month, after picking up at the end of June, with “institutional players increasing their participation on CME,” he noted.\n\nCBOE, another derivatives exchange based in the Midwest, received regulatory approval to launch leveraged crypto derivatives products in June.\n\nWith more regulated derivatives venues, institutional investors have typically favoured exposure through options and futures. This also eliminates any need for custody of crypto assets."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMikgFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2NyeXB0by90b2tlbi9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1iZWxvdy0yOTUwMC1ldGhlcmV1bS1ob2xkcy0xODUwLXRyb24tc2hpYmEtaW51LWZhbGwtNi0zOTE5NjYtMjAyMy0wNy0zMdIBlgFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2FtcC9jcnlwdG8vdG9rZW4vc3RvcnkvY3J5cHRvLXByaWNlLXRvZGF5LWJpdGNvaW4tYmVsb3ctMjk1MDAtZXRoZXJldW0taG9sZHMtMTg1MC10cm9uLXNoaWJhLWludS1mYWxsLTYtMzkxOTY2LTIwMjMtMDctMzE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin below $29,500; Ethereum holds $1,850; Tron & Shiba Inu fall 6% - Business Today",
        "content": "Bitcoin and other top crypto tokens were trading mixed on Monday. The digital token market moved sideways in August due to the global vacation season and lack of major key economic events. However, the phase of consolidation may trigger some gains in the token space.\n\n\n\nBitcoin moved slightly higher as the largest crypto token added about half-a-per cent but remained below 29,500-mark. However, Its largest peer, Ethereum also posted gains on the similar lines and managed to hold $1,850-levels. Price action in the altcoins was mixed.\n\n\n\nFollowing an eventful weekend, the value of Bitcoin experienced a slight increase, reaching the $29,461 mark. Bitcoin has been trading within a range of $29,000 to $29,500 for the past week. The market appears to have absorbed the news of Curve Finance falling victim to an exploit, said Edul Patel, Co-founer and CEO at Mudrex.\n\n\n\n\"Ethereum successfully breached the $1,850 level in the last seven days and is currently being traded at approximately $1,871. Meanwhile, the banking crisis in the U.S. persists, with the FDIC closing Kansas Heartland Tri-State Bank. The failure of this bank might be attributed to the impact of rising U.S. interest rates and inadequate risk management practices,\" he said.\n\n\n\nAll top crypto tokens were trading mixed on Monday. On the downside, Tron and Shiba Inu shed 4 per cent each, while Dogecoin and Solana shed 2 per cent each during the day. Among the gainers, Bitcoin Cash surged about 6 per cent, while Polygon gained about 2 per cent.\n\n\n\nThe global cryptocurrency market cap was trading slightly higher, risiing up to $1.19 trillion-mark as it gauned less than a per cent in the last 24 hours. However, the total trading volumes surged more than 45 per cent to $25.85 billion.\n\n\n\n\n\nTech View by Giottus Crypto Platform\n\nBNB is within a horizontal channel in the medium term. The price action has started registering short line candles in the daily chart, indicating that BNB is currently entering a consolidation. BNB can consolidate between the range of $236 and $244, and is facing immediate resistance at $250. If the price successfully surpasses this level, it could potentially lead to the resistance level of $265 and $280.\n\n\n\n\n\nThe 200-day EMA is currently at $239 and BNB is barely above this level. Its RSI has marginally recovered from past week’s decline and is currently in neutral territory.If BNB is unable to break through the $250 barrier, $235 serves as an early support level, with the $220 zone providing the next line of defence.\n\n\n\nMajor Levels:\n\nSupport: $235, $220\n\nResistance: $250, $265, $280\n\n\n\n(Views and recommendations given in this section are the analysts' own and do not represent those of Business Today. Please consult your financial adviser before taking any position in the asset/s mentioned.)"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY3J5cHRvZGFpbHkuY28udWsvMjAyMy8wNy9laXAtNjk2OC1zZXQtdG8tZW5hYmxlLXJldmVudWUtc2hhcmluZy1mb3ItZXRoZXJldW3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "EIP-6968 Set To Enable Revenue Sharing For Ethereum - CryptoDaily",
        "content": "An Ethereum Improvement Proposal (EIP), dubbed EIP-6968, has been proposed by Ethereum developers to facilitate decentralized application (dApp) creators to earn a share of transaction fees generated on Layer 2 (L2).\n\nOn the outset, EIP-6968 aims to introduce a new type of token, the \"Contract Secured Revenue\" (CSR), which would allow developers to claim a percentage of transaction fees generated when users interact with their smart contracts.\n\nKevin Owocki, one of the co-authors of the proposal, envisages this development as an opportunity for projects to band together, form an L2 around shared ideas, and share sequencer fee revenue based on who drives the most usage.\n\nMechanism and Scaling\n\nLayer 2 solutions play a crucial role in enhancing the scalability of the Ethereum network. By conducting transactions off the main Ethereum blockchain (Layer 1 or L1), they mitigate network congestion and reduce transaction costs, whhich can skyrocket during peak periods. Layer 2 solutions use various methods like state channels, sidechains, and rollups, enabling faster and more efficient transaction processing. They significantly boost the tranbsaction throughput, thereby facilitating a smoother, more scalable experience for users and developers.\n\nIn terms of the relation between L2s and the EIP-6968 proposal, the former allows smart contract developers to tap into potentially lucrative revenue streams. By introducing the concept of \"Contract Secured Revenue\" (CSR), Layer 2 can incentivize developers to create and deploy their dApps on these networks, fostering innovation and community growth. It creates a positive feedback loop - the more a developer's smart contracts are used, the more transaction fees they can potentially earn. This not only motivates developers but also accelerates the overall development and scaling of the Ethereum ecosystem.\n\nAdoption and Potential Impact\n\nThe revenue generated from CSR could be utilized for multiple purposes, such as funding dApp development, public goods, or incentivizing developers to join a network. While Owocki initially proposed EIP-6968 in May, it has garnered increased attention following his presentation at the recent EthCC conference in Paris.\n\nEIP-6968 promises to revolutionize the fiercely competitive Ethereum scaling sector by introducing a novel type of incentive for developers. The proposal posits using protocol rewards of L1 to fund smart contract development, a significant change from what is the current state of market mechanisms in place.\n\nEIP-6968, viewed as a step ahead from app-chains, is designed to enable \"ecosystem-chains\" that host multiple decentralized applications. It is essentially a modified version of EIP-1559, which implemented Ethereum’s burn mechanism back in August 2021.\n\nThe proposed upgrade could be adopted by any network that uses EIP-1559. Owocki expressed optimism about the potential traction within the L2 ecosystem, predicting a beneficial cycle where smart contract developers receive revenue for the value they contribute to L2s.\n\nDisclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vdS50b2RheS9jei1zYXlzLWhlLXdvdWxkLW5vdC1oYXZlLXN0YXJ0ZWQtYmluYW5jZS1oYWQtaGUtYm91Z2h0LWV0aC1lYXJsedIBVWh0dHBzOi8vdS50b2RheS9jei1zYXlzLWhlLXdvdWxkLW5vdC1oYXZlLXN0YXJ0ZWQtYmluYW5jZS1oYWQtaGUtYm91Z2h0LWV0aC1lYXJseT9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "CZ Says He Would Not Have Started Binance Had He Bought ETH Early - U.Today",
        "content": "Advertisement\n\nNow that the eighth anniversary of the Ethereum launch has arrived, the head of Binance Changpeng Zhao (CZ) has shared a rare photo where he and Vitalik Buterin can be seen together in the company of others.\n\nCZ admits that not buying Ethereum back then motivated him to undertake the biggest task of his lifetime — building and launching the Binance exchange.\n\nNot buying Ethereum early — \"miss of a lifetime,\" CZ says\n\nThe photo shared by CZ where he is standing next to Buterin in his own flat in Tokyo was taken on May 2, 2015, per the tweet. CZ wrote that, back then, Buterin was staying at his place during the trip to Japan and \"was already working on and talking about ETH non-stop.\"\n\nChangpeng Zhao confessed that he did not buy Ethereum when it launched and called it the \"miss of a lifetime.\" However, this presented him with a great opportunity and the motivation to create Binance, which later turned into a crypto trading platform with the largest trading volume in the world.\n\nOn this 8th birthday of #Ethereum, a little throw back to May 2, 2015, in Tokyo🇯🇵, just before #ETH was officially born. @VitalikButerin stayed in my apartment in Tokyo during this trip. He was already working on and talking about ETH non-stop. And I still missed (didn't buy)… pic.twitter.com/84B6KN73Qf — CZ 🔶 Binance (@cz_binance) July 30, 2023\n\n\"Binance would not exist without Ethereum\"\n\nIt sounded as if CZ hinted that if he had bought ETH at an early stage, he would be a billionaire now without having to create Binance, which was launched in 2017 — two years after the Ethereum ICO — and it was based on the Ethereum blockchain too, as were many other platforms back then.\n\nAccording to a response from CZ to a Twitter user under his post, he has known Buterin since 2013: \"Coming up to 10 years in Dec, I think.\"\n\nIn an earlier tweet, on Sunday, CZ sent congratulations on the birth of Ethereum to Buterin. He stressed that Ethereum made possible ICOs and, if it had not been for that, Binance would never have been born.\n\nHappy Birthday #Ethereum! @VitalikButerin\n\n\n\nAmong many things, Ethereum made ICOs possible, which in turn, made many other projects possible, including Binance. 🙏 — CZ 🔶 Binance (@cz_binance) July 30, 2023\n\nSHIB's birthday just one day away from Ethereum's\n\nOn July 31, another popular cryptocurrency celebrates its birthday; popular meme coin Shiba Inu (SHIB) emerged into the market on July 31, 2020, created by the pseudonymous Ryoshi and Shytoshi Kusama (the latter remains the project's lead developer).\n\nThe initial price of the coin was $0.000000001009, according to CoinMarketCap. Per the video shared by Lucie, the marketing specialist of SHIB, there were Shiba Inu tokens owned by the founders initially by default, and Ryoshi bought all his SHIB from the free market to stress the principle of equality on which, among others (such as decentralization), SHIB was founded. The video also claims that zero funds were spent on the creation and promotion of Shiba Inu into the crypto community by Ryoshi.\n\nHappy Birthday, $Shib! 🎉🎂\n\n\n\nWishing you a fantastic day filled with joy and wonderful memories.\n\n\n\nNow, let's watch this exciting video about the journey to decentralization! 🚀📽️ Enjoy!https://t.co/kBsrrPIHUL — 𝐋𝐔𝐂𝐈𝐄 | Summer of Shibarium (@LucieSHIB) July 31, 2023\n\nShiba Inu was also launched on the Ethereum chain. At the end of May 2022, Ryoshi deleted all of his social media accounts and went under the radar, similar to the move made by Bitcoin creator Satoshi Nakamoto in 2010.\n\nShytoshi Kusama now remains at the head of the SHIB team, which is about to launch the Layer 2 network Shibarium. After that, according to his recent tweets, Shytoshi will also step down from his role of the leader as SHIB will be totally run by the community."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9vcGVuc2VhLXNhbGVzLW9mLWV0aGVyZXVtLXBvbHlnb24tbmZ0cy1wbHVtbWV0LXRvLW5ldy1sb3dzL9IBhgFodHRwczovL2FtYmNyeXB0by5jb20vb3BlbnNlYS1zYWxlcy1vZi1ldGhlcmV1bS1wb2x5Z29uLW5mdHMtcGx1bW1ldC10by1uZXctbG93cy8_dXRtX3NvdXJjZT1mbGlwYm9hcmQmdXRtX2NvbnRlbnQ9dG9waWMlMkZicml0cG9wJmFtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jul 2023 07:00:00 GMT",
        "title": "OpenSea: Sales of Ethereum, Polygon NFTs plummet to new lows - AMBCrypto News",
        "content": "The sales of Ethereum and Polygon-minted NFTs on OpenSea have fallen to their lowest level this year.\n\nBlur continues to overshadow OpenSea in terms of monthly trading volume.\n\nThe monthly sales volume of Ethereum and Polygon-based non-fungible tokens (NFTs) on the leading marketplace OpenSea has plummeted to its lowest point this year as July draws to a close, data from Dune Analytics revealed.\n\nInformation from the on-chain data provider revealed that the monthly sales of Ethereum-minted NFTs on the marketplace reached an impressive peak of $659.02 million in February before experiencing a subsequent downturn.\n\nWith one day left in July, the total sales volume at press time was $120.79 million. This represented an 82% drop in monthly sales volume on OpenSea since the February high.\n\nSimilarly, following a record-breaking NFT sales volume of $109.12 million in February, Polygon-based NFTs on OpenSea have received decreased patronage from OpenSea’s users. In fact, following the February high, the NFTs in this category proceeded to close the first quarter of the year with a whopping 98% decline in sales volume.\n\nIn the last 30 days, the sales volume of Polygon-minted NFTs on the marketplace totaled $8.35 million, a 92% decline in under six months.\n\nNaturally, the fall in NFTs sales count in July culminated in the decline in sales volume. According to data from Dune Analytics, only 258,798 Ethereum-minted NFTs have been sold on OpenSea this month. This was a 43% drop from the 450,325 total NFTs sold by the end of June.\n\nThe marketplace recorded its highest monthly count of Ethereum NFTs sold in January. Per data from Dune Analytics, OpenSea ended the 31-day trading period with an NFT sales count of 1.14 million. This has since trended downward.\n\nInterestingly, despite the shortfall in sales volume, the count of Polygon NFTs sold on OpenSea this month has surpassed the total count from June. In the past 30 days, 296,343 Polygon-minted NFTs have been traded on OpenSea. This was a 29% jump from the 228,859 total NFTs sold in June.\n\nBlur leaves OpenSea in a daze\n\nBlur continues to dominate OpenSea regarding monthly NFT trading volume, data from DappRadar revealed. According to the data provider, NFTs trading volume on Blur totaled $378.41 million. OpenSea trailed behind it with a trading volume of $126 million, registering a 25% drop during that period.\n\nHowever, during the period under review, OpenSea recorded an influx of traders than Blur did. According to DappRadar, traders that completed NFTs transactions on OpenSea in the last month totaled 305,295. Blur saw a mere 35,304 traders."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy92eXBlci1jb3B5Y2F0LWV4cGxvaXQtb24tYnNjLWJuYi1zbWFydC1jaGFpbi1jdXJ2ZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "BNB Smart Chain hit with copycat Vyper attack, $73K exploited - Cointelegraph",
        "content": "The BNB Smart Chain (BSC) has reportedly suffered copycat attacks due to a vulnerability in the Vyper programming language, following a similar vein to the exploit on the decentralized finance (DeFi) protocol Curve Finance.\n\nAmid the exploits carried out on Ethereum, Blockchain security firm BlockSec tweeted on July 30 that around $73,000 worth of cryptocurrencies on BSC across three exploits had also been stolen.\n\nIt comes as similar exploits targeting liquidity pools on Curve Finance have racked up losses exceeding $41 million, according to current BlockSec estimates.\n\nThe vulnerability was caused by a malfunctioning reentrancy lock on Vyper versions 0.2.15, 0.2.16 and 0.3.0, which is used by a number of DeFi pools.\n\nThe programming language is believed to be one of the most widely used for Web3 projects. It was designed for the Ethereum Virtual Machine and could affect other protocols that use the afflicted Vyper versions.\n\nSince news of the exploit broke, white hat and black hat hackers have been duking it out on-chain attempting to disrupt each other's exploit attempts or efforts to recover funds.\n\nRelated: Pond0X token launch snafu leads to millions of dollars in losses\n\nOne potential whitehat, known as “c0ffebabe.eth,” was seemingly able to grab some funds to store for safekeeping. On July 30 they sent an on-chain message asking affected protocols to contact them to organize returning funds.\n\nExcellent news!!! hopefully we can get it backhttps://t.co/sElKdYniT1 pic.twitter.com/AEldRorQaq — Addison (@0xaddi) July 30, 2023\n\nSo far, the wallet has returned nearly 2,900 Ether (ETH) worth over $5 million to Curve according to one transaction.\n\nAnother transaction saw c0ffebabe.eth move 1,000 ETH to what appears to be a newly-created wallet — likely the cold wallet that they mentioned earlier.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nHall of Flame: Wolf Of All Streets worries about a world where Bitcoin hits $1M"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vdGVjaHBvaW50LmFmcmljYS8yMDIzLzA3LzMxL2NoYXRncHQtcGlja3MtY29zbW9zLWV0aGVyZXVtLWNsYXNzaWMtYW5kLXBvbWVyZG9nZS1hcy1iZXN0LWludmVzdG1lbnRzLWZvci0yMDIzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "ChatGPT Picks Cosmos, Ethereum Classic, and Pomerdoge As Best Investments for 2023 - Techpoint Africa",
        "content": "The Best Crypto Investments for 2023 You Can Choose From According to ChatGPT Are Cosmos, Ethereum Classic, and Pomerdoge, Thanks to Their Strong Fundamentals and Incredible Growth Potential\n\nChatGPT has recently announced its top three crypto investment picks for 2023, and there are no major surprises. The best investments for 2023 by ChatGPT based on their fundamentals and growth potential are Cosmos (ATOM), Ethereum Classic (ETC), and Pomerdoge (POMD).\n\nThis article will delve into ChatGPT’s selections and what makes them stand out.\n\nClick Here To Find Out More About The Pomerdoge (POMD) Presale\n\nCosmos (ATOM) Is Identified as a Top Investment Pick\n\nCosmos (ATOM) is an interoperable and scalable blockchain. For this reason, it is one of the most popular blockchain platforms. Cosmos aims to create an interconnected ecosystem of blockchains, thereby allowing interoperability.\n\nChatGPT identifies Cosmos crypto as a top investment pick because of the incredible role it plays in the blockchain ecosystem. The increasing demand for interoperable blockchain solutions will see Cosmos skyrocket.\n\nEthereum Classic (ETC) Predicted To Soar Amidst Increasing Adoption\n\nAlthough Ethereum Classic (ETC) emerged as a hard fork of Ethereum (ETH), it has now become a popular blockchain. While it isn’t as popular as its parent blockchain, it nonetheless remains a popular destination for smart contract execution. Meanwhile, in recent Ethereum Classic news, we asked ChatGPT about its future viability, and it was bullish.\n\nChatGPT predicted that Ethereum Classic's price would appreciate in the second half of the year. The reason cited for this is the increasing adoption of Ethereum Classic for DeFi solutions.\n\nPomerdoge: The Best Investment for 2023 by ChatGPT\n\nPomerdoge is an innovative project that combines fun and lightheartedness with an exciting play-to-earn game (P2E). As a result, it has a meme appeal, which gives it enormous growth potential. Additionally, as a P2E token, it will have a utility that spans its gaming ecosystem, which will contribute to its growth.\n\nAs a play-to-earn platform, Pomerdoge will connect players across the world. They will be able to network, compete, and earn through this exciting game. Additionally, players can build their digital characters to their taste or at an elite level. They can take it further by creating custom items for their avatars.\n\nAlso, top players can participate in its Pomerplace, which is a gaming marketplace and arena. On the one hand, as a gaming marketplace, players can buy, sell, and trade valuable game items. On the other hand, as a gaming arena, players can battle with their Pomerdoge against other players.\n\nPomerdoge is currently an emerging token, meaning it has enormous growth potential. The presale is in stage 1, with 1 token at $0.007.\n\nFind out more about the Pomerdoge (POMD) Presale Today\n\nWebsite: https://pomerdoge.com/\n\nTelegram Community: https://t.me/pomerdoge"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiNGh0dHBzOi8vbGVhcm4uYnliaXQuY29tL2ludmVzdGluZy9ibHVlLWNoaXAtY3J5cHRvcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "What Are Blue Chip Cryptos, and Are They Safe Bear Market Options? - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiMWh0dHBzOi8vd3d3LmxjeC5jb20vbGF5ZXItMS1ibG9ja2NoYWluLWV4cGxhaW5lZC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Layer-1 Blockchain Explained - LCX",
        "content": "Key Features of Layer-1 Blockchain\n\nConsensus Mechanism: Layer-1 blockchains employ various consensus mechanisms to validate transactions and achieve agreement among network participants. Popular consensus algorithms used in Layer-1 blockchains include Proof-of-Work (PoW), Proof-of-Stake (PoS), and Delegated Proof-of-Stake (DPoS), among others.\n\nSecurity: Layer-1 blockchains prioritize security by utilizing cryptographic algorithms and decentralized network structures. The immutability of the blockchain, achieved through cryptographic hashing, ensures the integrity and tamper-resistance of transactions recorded on the network.\n\nScalability: Layer-1 blockchains face the challenge of scalability, as they need to accommodate a large number of transactions without compromising efficiency. Several Layer-1 protocols employ innovative techniques such as sharding, sidechains, and state channels to enhance scalability and throughput.\n\nSmart Contracts: Many Layer-1 blockchains support the execution of smart contracts, which are self-executing contracts with the terms of the agreement directly written into the code. Smart contracts enable the automation of contractual agreements, reducing the need for intermediaries and enhancing transparency.\n\nWhat Is the Main Limitation of Layer 1?\n\nLayer 1 blockchains seek to provide the fundamental blockchain functions. Any blockchain’s primary objective is to optimize decentralization, security, and scalability. The concept of accomplishing all three is referred to as the blockchain trilemma due to the difficulty of striking a balance between them.\n\nEarly L1 chains (specifically Bitcoin and Ethereum) prioritized decentralization and security at the expense of their networks’ scalability. This has prompted L1 developers to modify their designs to prioritize scalability or to work on alternative solutions “off-chain.” There are a few ways in which L1 chains can improve scalability by modifying their native architecture. These consist of:\n\nIncreasing block size: With larger blocks, more transactions can “fit” into each block, thereby enhancing network speed. The disadvantage is that network-securing computers (nodes) must increase their hardware requirements, which increases the risk of centralization.\n\nChanging the consensus mechanism: Proof of Stake (PoS) consensus mechanisms are typically quicker and less resource-intensive than Proof of Work (PoW) consensus mechanisms. Nonetheless, some contend that this comes at the expense of inadequate security and centralization.\n\nSharding: Sharding enables Layer 1 chains to divide their data into a predetermined number of distinct data components (called shards), thereby assisting to decongest the network and increase transaction speeds. However, communication between sharded chains can be complicated, resulting in compromised blockchain security.\n\nNotable Layer-1 Blockchain Protocols\n\nBitcoin (BTC): Bitcoin, the first and most well-known cryptocurrency, operates on a Layer-1 blockchain. It utilizes the PoW consensus mechanism, allowing for secure peer-to-peer transactions without the need for intermediaries. Bitcoin’s Layer-1 blockchain is primarily designed for value transfer.\n\nEthereum (ETH): Ethereum is a Layer-1 blockchain renowned for its ability to support smart contracts and decentralized applications. It introduced the concept of programmable money, revolutionizing the blockchain landscape. Ethereum’s Layer-1 blockchain employs the PoW consensus algorithm, although it is transitioning to a PoS-based mechanism with the introduction of Ethereum 2.0.\n\nPolkadot (DOT): Polkadot is a Layer-1 blockchain protocol that focuses on interoperability between different blockchains. It enables the seamless transfer of assets and data across multiple chains. Polkadot utilizes a unique shared security model and the Nominated Proof of Stake (NPoS) consensus algorithm.\n\nSolana: Solana, a blockchain of the third generation, aims to resolve the scalability issues of L1 blockchains. Solana employs proof of History (PoH) consensus to achieve transaction speeds of up to 65,000 per second, unlike Bitcoin and Ethereum.\n\nConclusion\n\nLayer-1 protocols represent the foundational layer of the blockchain revolution, providing the necessary infrastructure for secure and scalable decentralized systems. By leveraging consensus mechanisms, scalability solutions, and programmability, Layer-1 blockchains offer unparalleled opportunities for industries and individuals alike. As scalability challenges are overcome and interoperability becomes the norm, we can expect a proliferation of innovative use cases and widespread adoption. As this technology continues to evolve, there is a possibility that in the near future, Layer-1 protocols might underpin a multitude of transformative applications, reshaping the global economic and social landscape."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2V0aGVyZXVtLWV0aC1wcmljZS1nYWlucy1zdHJlbmd0aC1hbWlkLXNpZGV3YXlzLWJpdGNvaW4tYnRjLWNob3Av0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Gains Strength Amid Sideways Bitcoin (BTC) Chop - Analytics Insight",
        "content": "Ethereum (ETH) price is gaining strength again after a significant pullback. Despite a sideways BTC price action, the ETH/BTC pair continues to extend its gains. There are multiple fundamental and technical factors behind this strength which I will be discussing in this article.\n\nBTC price has been stuck within a very narrow range since last week. The pioneering cryptocurrency is struggling to break above the $29,500 level. This has increased the selling pressure in altcoins, as many analysts anticipate a drop after the ongoing accumulation phase. However, on Friday, ETH to USD price once again outperformed BTC. At press time, the native asset of the biggest L1 was trading at $1877 during its New York session after rising by 0.93%.\n\nETH/BTC Rebounds From Fresh 52-Week Lows\n\nMany traders prefer to trade Ethereum in ETH/BTC pair, which shows its strength against Bitcoin. The following chart reveals that ETH price plunged to its lowest level of the year against BTC on 29th June. The pair slid to $0.0608, which was last tapped in July 2022.\n\nThe lack of volatility in Bitcoin has created some buying opportunities in other cryptocurrencies, such as Ethereum. As Bitcoin consolidates, some investors are rotating their profits into Ethereum, which is helping to drive up the ETH/BTC pair.\n\n\n\n\n\nEthereum TVL Is Down 77% From Its All-Time High\n\nCurrently, Ethereum is by far the biggest smart contract platform in terms of daily active users and the total locked value (TVL). However, there has been a massive decrease in the TVL on the top Layer 1 protocol in the past two years. According to the DeFi Llama, the network TVL has plummeted to $25.1 billion from its 2021 peak of $108 billion. This sharp decline in the locked funds can be attributed to multiple factors.\n\nEthereum TVL seems affected by the recent downtrend in crypto markets. As the Ethereum price has fallen, so has the amount of value locked in its DeFi protocols. Another reason is that the network is currently facing scaling issues, leading to higher gas fees and slower transaction speeds. This has made it less attractive for users to use Ethereum DeFi protocols, contributing to the decline in TVL.\n\nEthereum Price Prediction\n\nThe following ETH price chart is quite self-explanatory. It is evident from this chart that there is a massive resistance above the major psychological level of $2,000. In fact, there have already been two price rejections from $2017-2140 since the start of this year.\n\nA closer look at the chart also reveals that the price is also respecting an upward trendline. Currently, the digital asset is retesting this trendline. As long as the price remains above this trendline, Ethereum price prediction will remain bullish. In case of a strong bounce from this trendline, I expect the price to retest the 2,000 level again.\n\nA significant line in the sand for many traders is the 200-day moving average, which currently lies at $1768. A breakdown below this key moving average will flip my outlook on Ethereum bearish once again.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3BvcHVsYXItZXRoZXJldW0tYmFzZWQtbmZ0LWNvbGxlY3Rpb25zLWluLTIwMjMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jul 2023 07:00:00 GMT",
        "title": "Popular Ethereum-Based NFT Collections in 2023 - Analytics Insight",
        "content": "Here is the ultimate guide to the popular Ethereum-based NFT collections in 2023\n\nNFTs, or non-fungible tokens, are one of the hottest trends in the crypto space. NFTs are unique digital assets representing anything from art, music, and games to sports. NFTs are powered by blockchain technology, which ensures their authenticity, scarcity, and ownership.\n\nEthereum is the leading blockchain platform for NFTs, hosting thousands of NFT collections and projects. Ethereum-based NFTs benefit from the network’s security, interoperability, and innovation. However, Ethereum also faces high gas fees, scalability issues, and environmental concerns. This article will explore some of the most popular and promising Ethereum-based NFT collections to invest in in 2023. These collections are based on various criteria such as market cap, trading volume, community size, rarity, utility, and future potential.\n\nBored Ape Yacht Club (BAYC)\n\nBored Ape Yacht Club is one of the most successful and influential NFT collections ever created. Launched in April 2021 by Yuga Labs, BAYC comprises 10,000 unique pixel art apes with various traits and accessories. Each ape also grants its owner access to the exclusive Bored Ape Yacht Club community and perks.\n\nBAYC is the most valuable NFT collection on Ethereum by market cap, reaching over US$3 billion as of January 2023. The floor price for a BAYC ape is around 100 ETH (US$300k), while the highest sale was 740 ETH (US$2.2 million) for a gold fur trippy ape. BAYC also has a high monthly trading volume of over US$200 million.\n\nCryptoPunks\n\nCryptoPunks are the OGs of the NFT space. Created in 2017 by Larva Labs, CryptoPunks are 10,000-pixel art characters with different attributes and rarities. CryptoPunks were given away for free to anyone with an Ethereum wallet but have since become highly sought-after collectibles. CryptoPunks are widely regarded as the first NFT project on Ethereum and have inspired many other NFT collections and projects.\n\nCryptoPunks are the second most valuable NFT collection on Ethereum by market cap, reaching over US$1.4 billion as of January 2023. The floor price for a CryptoPunk is around 50 ETH (US$150k), while the highest sale was 4,200 ETH (US$12.6 million) for an alien punk with a headband. CryptoPunks also have a high monthly trading volume of over US$100 million.\n\nArtBlocks Curated\n\nArtBlocks Curated is a unique and innovative NFT collection showcasing generative blockchain art. Launched in 2020 by Erick Calderon (aka Snowfro), ArtBlocks Curated features artworks created by algorithmic code that are minted on demand by collectors. Each artwork is one-of-a-kind and immutable.\n\nArtBlocks Curated is the third most valuable NFT collection on Ethereum by market cap, reaching over US$1 billion as of January 2023. The floor price for an ArtBlocks Curated artwork varies depending on the project but ranges from 5 ETH (US$15k) to over 100 ETH (US$300k). The highest sale was 1,000 ETH (US$3 million) for a Fidenza #313. ArtBlocks Curated also has a monthly trading volume of over US$50 million.\n\nDoodles\n\nDoodles are a cute and colorful NFT collection that celebrates creativity and fun. Launched in September 2021 by a team of anonymous artists and developers, Doodles consists of 10,000 randomly generated cartoon characters with various traits and personalities. Each Doodle also has a backstory and a name that reflects its character.\n\nDoodles are the fourth most valuable NFT collection on Ethereum by market cap, reaching over US$500 million as of January 2023. The floor price for a Doodle is around 15 ETH (US$45k), while the highest sale was 250 ETH (US$750k) for a Doodle named Boba. Doodles also have a high monthly trading volume of over US$20 million.\n\nAxie Infinity\n\nAxie Infinity is a popular and profitable NFT game that combines blockchain, gaming, and social elements. Launched in 2018 by Sky Mavis, Axie Infinity is a game where players can collect, breed, battle, and trade cute digital creatures called Axies. Each Axie is an NFT with unique genes and abilities that affect its performance in the game.\n\nAxie Infinity is the fifth most valuable NFT collection on Ethereum by market cap, reaching over US$400 million as of January 2023. The floor price for an Axie is around 0.2 ETH (US$600), while the highest sale was 300 ETH (US$900k) for an Axie named Angel. Axie Infinity also has a high monthly trading volume of over US$10 million.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL3d3dy5tb25leWNvbnRyb2wuY29tL25ld3MvdHJlbmRzL3ZpdGFsaWstYnV0ZXJpbi1jZWxlYnJhdGVzLWV0aGVyaXVtcy1iaXJ0aGRheS1pbi1iZW5nYWx1cnUtd2l0aC1naGV2YXItY2FrZS1tYXNhbGEtZG9zYS0xMTA2NTk3MS5odG1s0gGSAWh0dHBzOi8vd3d3Lm1vbmV5Y29udHJvbC5jb20vbmV3cy90cmVuZHMvdml0YWxpay1idXRlcmluLWNlbGVicmF0ZXMtZXRoZXJpdW1zLWJpcnRoZGF5LWluLWJlbmdhbHVydS13aXRoLWdoZXZhci1jYWtlLW1hc2FsYS1kb3NhLTExMDY1OTcxLmh0bWwvYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Ethereum boss in Benglauru: 'Ghevar' cake, masala dosa on 8th anniversary - Moneycontrol",
        "content": "Etherium founder Vitalik Buterin visited Bengaluru on the cryptocurrency's eight anniversary. (Image credit: @sandeepnailwal/Twitter)\n\nEtherium founder and Russian-Canadian computer programmer Vitalik Buterin celebrated the cryptocurrency's eighth birthday in Bengaluru with some 'ghevar' cake, masala dosa, and a bit of 'Bharat darshanam'.\n\nGhevar is a Rajasthani disc-shaped sweet made with flour, ghee, and milk, soaked in sugar syrup.\n\nStory continues below Advertisement Remove Ad\n\n\"Celebrating Ethereum’s eighth birthday with Vitalik Buterin with Indian 'Ghever' as cake in Bengaluru. Happy Birthday, Ethereum!\" Polygon COO Sandeep Nailwal and founder of CryptoRelief tweeted.\n\nEthereum went live on July 30, 2015, and the cryptocurrency has grown rapidly to become the second only to bitcoin in market capitalisation.\n\n\n\nLiterally had a fanboy moment earlier tonight / met @VitalikButerin in person with @sandeepnailwal and @manishdiesel Story continues below Advertisement Remove Ad Got a chance to briefly explain the social impact in gaming being created by @IndiGG_DAO pic.twitter.com/vYz7qFEDPu\n\n— Ishank | IndiGG (@ishank20) July 30, 2023\n\nVitalik Buterin's connection with India, however, stretches beyond the delicacies as the programmer had in 2021 made a legendary donation of $1bn in Shiba Inu cryptocurrency coin to support Covid efforts in the country via Nailwal's CryptoRelief. But, only 5 per cent of the original donation made it to Covid relief efforts in India, as per a report in Cryptonews.\n\nMoreover, CryptoRelief returned $100 million (roughly Rs 747 crores) in cryptocurrency to Buterin to avoid conflict with Indian laws and the distribution of relief funds, News18 reported. “CryptoRelief sending $100m of the $SHIBA funds back to me. I plan to personally deploy these funds with the help of science advisors to complement CryptoRelief’s existing excellent work with some higher-risk higher-reward COVID science and relief projects worldwide,\" the world’s youngest cryptocurrency billionaire had said in a tweet.\n\nRead more: Elon Musk, Ethereum co-founder Vitalik Buterin, Sahil Lavignia discuss ways to boost population, moot 'synthetic wombs'"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMizgFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWluLWluZGlhLWp1bHktMzAtY2hlY2stbWFya2V0LWNhcC1iaXRjb2luLWV0aGVyZXVtLW1lcmdlLWRvZ2Vjb2luLXNvbGFuYS1saXRlY29pbi1yaXBwbGUteHJwLWJpbmFuY2UtdG9rZW4tcW50LXByaWNlcy1nYWluZXItbG9zZXItMTYxOTMzMdIB0gFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWluLWluZGlhLWp1bHktMzAtY2hlY2stbWFya2V0LWNhcC1iaXRjb2luLWV0aGVyZXVtLW1lcmdlLWRvZ2Vjb2luLXNvbGFuYS1saXRlY29pbi1yaXBwbGUteHJwLWJpbmFuY2UtdG9rZW4tcW50LXByaWNlcy1nYWluZXItbG9zZXItMTYxOTMzMS9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jul 2023 07:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Remains Above 29,000 Mark As Shiba Inu Becomes Top Gainer - ABP Live",
        "content": "Bitcoin (BTC) and Ethereum (ETH) — two of the most valued crypto coins — managed to rise above the $29,000 and $18,000 marks, respectively, on early Sunday morning. However, in terms of percentage-wise performance, BTC saw some losses. Other popular altcoins — including the likes of Litecoin (LTC), Dogecoin (DOGE) — landed in the positive as overall prices saw minor gains across the board. Shiba Inu (SHIB) emerged to be the biggest gainer, seeing a 24-hour jump of over 5.38 per cent. Toncoin (TON), on the other hand, turned out to be the biggest loser.\n\nAt the time of writing, the global crypto market cap stood at $1.19 trillion, registering a 24-hour gain of 0.09 percent.\n\nBitcoin (BTC) price today\n\nBitcoin price stood at $29,317.48 seeing a 24-hour loss of 0.18 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 25 lakhs.\n\nEthereum (ETH) price today\n\nETH price stood at $1,878.69, marking a 24-hour gain of 0.25 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 1.62 lakhs.\n\nDogecoin (DOGE) price today\n\nDOGE registered a 24-hour gain of 3.00 percent as per CoinMarketCap data, currently priced at $0.08018. As per WazirX, Dogecoin price in India stood at Rs 6.9639.\n\nLitecoin (LTC) price today\n\nLitecoin saw a 24-hour gain of 3.80 percent. At the time of writing, it was trading at $94.67. LTC price in India stood at Rs 8,060.10.\n\nRipple (XRP) price today\n\nXRP price stood at $0.7106, seeing a 24-hour loss of 0.14 percent. As per WazirX, Ripple price stood at Rs 61.9800.\n\nSolana (SOL) price today\n\nSolana price stood at $25.05, marking a 24-hour loss of 0.35 percent. As per WazirX, SOL price in India stood at Rs 2,190.00.\n\nTop crypto gainers today (July 30)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nShiba Inu (SHIB)\n\nPrice: $0.000008659\n\n24-hour gain: 5.38 percent\n\nUniswap (UNI)\n\nPrice: $6.36\n\n24-hour gain: 5.27 percent\n\nMaker (MKR)\n\nPrice: $1,271.06\n\n24-hour gain: 4.29 percent\n\nQuant (QNT)\n\nPrice: $113.43\n\n24-hour gain: 4.13 percent\n\nImmutable (IMX)\n\nPrice: $0.7756\n\n24-hour gain: 4.11 percent\n\nTop crypto losers today (July 30)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nToncoin (TON)\n\nPrice: $1.20\n\n24-hour loss: 6.60 percent\n\nCasper (CSPR)\n\nPrice: $0.03931\n\n24-hour loss: 2.61 percent\n\nGate Token (GT)\n\nPrice: $4.14\n\n24-hour loss: 2.38 percent\n\nStellar (XLM)\n\nPrice: $0.1573\n\n24-hour loss: 2.01 percent\n\nUNUS SED LEO (LEO)\n\nPrice: $3.94\n\n24-hour loss: 1.98 percent\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMisgFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2xhdGVzdC90cmVuZHMvc3RvcnkvaGFwcHktYmlydGhkYXktZXRoZXJldW0tdml0YWxpay1idXRlcmluLWNlbGVicmF0ZXMtZXRoZXJldW1zLWJpcnRoZGF5LWluLWJlbmdhbHVydS13aXRoLWdoZXZhci1jYWtlLW1hc2FsYS1kb3NhLTM5MjAzMS0yMDIzLTA3LTMx0gG2AWh0dHBzOi8vd3d3LmJ1c2luZXNzdG9kYXkuaW4vYW1wL2xhdGVzdC90cmVuZHMvc3RvcnkvaGFwcHktYmlydGhkYXktZXRoZXJldW0tdml0YWxpay1idXRlcmluLWNlbGVicmF0ZXMtZXRoZXJldW1zLWJpcnRoZGF5LWluLWJlbmdhbHVydS13aXRoLWdoZXZhci1jYWtlLW1hc2FsYS1kb3NhLTM5MjAzMS0yMDIzLTA3LTMx?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "‘Happy Birthday, Ethereum!’: Vitalik Buterin celebrates Ethereum's birthday in Bengaluru with 'ghevar' cake, masala dosa - Business Today",
        "content": "Ethereum founder and Russian-Canadian computer programmer Vitalik Buterin on July 30 celebrated the eighth birthday of Ethereum, the world's second-largest cryptocurrency by market capitalization. Buterin conceived Ethereum back in 2013.\n\nButerin was seen relishing a 'ghevar' cake and a Darshini style masala dosa. Ghevar, a disc-shaped sweet made with flour, ghee, and milk, soaked in sugar syrup, is a traditional Rajasthani dessert associated with the festivals of Teej and Raksha Bandhan.\n\nPolygon COO Sandeep Nailwal, who was present at the celebration took to Twitter to share the glimpse of Buterin enjoying this Indian delicacy.\n\n\"Celebrating Ethereum’s eighth birthday with Vitalik Buterin with Indian 'Ghever' as a cake in Bengaluru. Happy Birthday, Ethereum!\" Polygon COO Sandeep Nailwal, one of the entrepreneurs Buterin met during his visit to the city, tweeted.\n\nCelebrating Ethereum’s eighth birthday with @VitalikButerin with Indian “Ghever” as cake 🤗 in Bengaluru\n\n\n\nHappy Birthday Ethereum!\n\n\n\nAlso getting Vitalik do a bit of Bharat Darshanam 🛺 pic.twitter.com/CEBtoSzQZB — Sandeep Nailwal | sandeep. polygon 💜 (@sandeepnailwal) July 30, 2023\n\nButerin, along with other Ethereum founders Gavin Wood, Charles Hoskinson, Anthony Di Iorio, and Joseph Lubin, has seen Ethereum grow exponentially since its inception. It is only in second position to Bitcoin in terms of market capitalization. On July 31, Ethereum price stands at Rs 153,578.57\n\nEthereum is not just a cryptocurrency but a platform that allows anyone to deploy permanent and immutable decentralized applications onto it. It has given birth to decentralized finance (DeFi) applications, providing financial instruments that do not directly rely on intermediaries like brokerages, exchanges, or banks.\n\nButerin had earlier discussed the future of Ethereum, particularly the upcoming Ethereum 2.0 upgrades. These upgrades promise a more scalable, secure, and sustainable Ethereum, with the Beacon Chain, one of Ethereum 2.0's distinct sections, allowing users to be Eth2 validators by staking Ethereum.\n\nRecently, OpenAI’s CEO, Sam Altman, came up with his new cryptocurrency project, Worldcoin, which aims to resolve the issues of proof of personhood by creating a system that uses biometrics to confirm identities. Buterin released a long form response about his thoughts on Worldcoin and said that as artificial intelligence increases with time, it will be really tough to distinguish between humans and machines.\n\nIn 2021, Buterin made an unprecedented donation to support India's fight against the Covid-19 pandemic. He donated $1 billion worth of Shiba Inu cryptocurrency coins to CryptoRelief, a Covid relief fund established by Sandeep Nailwal, co-founder of crypto organization Polygon.\n\nHowever, a report from Cryptonews indicates that only 5 percent of Buterin's original donation was utilized for Covid relief efforts in India. This was due to the volatile nature of the meme coins, which saw their value fluctuate dramatically following the donation.\n\n“CryptoRelief sending $100m of the $SHIBA funds back to me. I plan to personally deploy these funds with the help of science advisors to complement CryptoRelief’s existing excellent work with some higher-risk higher-reward COVID science and relief projects worldwide,\" the world’s youngest cryptocurrency billionaire had said in a tweet.\n\nAlso Read: Birth of Threads: Mark Zuckerberg called up Instagram head Adam Mosseri late at night to discuss the 'Twitter-killer'\n\nAlso Watch: Upcoming cars & SUVs in India in August 2023: Mercedes Benz-GLC, Tata Punch, Audi Q8 e-tron, Citroen C3 Aircross and more"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMipQFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2V0aGVyZXVtLWwyLW1lbWUtY29pbi1iYWxkLXVuZGVyLWNvaW5iYXNlLWluY3ViYXRpb24tcnVnLXB1bGxzLTY4LW1pbGxpb24tZnJvbS1pbnZlc3RvcnMtYXQtcHJlc2FsZS1zdGFnZS0yMDIzMDczMTIxMzDSAakBaHR0cHM6Ly93d3cuZnhzdHJlZXQuY29tL2FtcC9jcnlwdG9jdXJyZW5jaWVzL25ld3MvZXRoZXJldW0tbDItbWVtZS1jb2luLWJhbGQtdW5kZXItY29pbmJhc2UtaW5jdWJhdGlvbi1ydWctcHVsbHMtNjgtbWlsbGlvbi1mcm9tLWludmVzdG9ycy1hdC1wcmVzYWxlLXN0YWdlLTIwMjMwNzMxMjEzMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Ethereum L2 meme coin BALD, under Coinbase incubation, rug-pulls $68 million from investors at “presale stage” - FXStreet",
        "content": "Share:\n\nBALD, an Ethereum Layer-2 meme coin has turned out to be a rug pull causing $68 million in losses.\n\nThe fraud caught unsuspecting investors by surprise while they enjoyed massive gains made overnight.\n\nProject founder has since vanished, committing to refund investors after multiplying profits from the loot.\n\nEthereum Layer-2 meme coin BALD has turned out to be a rug pull, leaving victims with massive losses. The heartbreaking news comes while unsuspecting investors were still enjoying triple digit gains as recently reported.\n\nAlso Read: BALD meme coin on Coinbase Layer 2 Base chain yields massive gains for traders overnight\n\nEthereum L2 BALD rug-pulls on still-nesting blockchain BASE\n\nBALD, a viral meme coin running under Coinbase’s BASE blockchain and built atop the OP Stack software has rug pulled approximately $68 million from investors as they continued to celebrate triple-digit gains made in just over 24 hours.\n\nBALD/ETH 15-min chart\n\nAs BASE is still incubating under Coinbase, traders could only send funds through a one-way bridge to the blockchain. This means that one could convert their Ether (ETH) to cbETH when they sent it to the Base contract, allowing them to buy/sell/swap money on the BASE layer. Nevertheless, it is impossible to bridge it back as there are no bridges to facilitate a “return trip” just yet.\n\nStill, they sent their ETH in the millions, with obvious expectations for lucrative returns cognizant of the fact that the blockchain was still nascent and yet to make an official premiere.\n\nand people legitimately ask us why we’re in this space sometimes pic.twitter.com/VcbW9IP9pp — Prince of Unibot | Manifesting | Gh0Stly (@DextMoon) July 30, 2023\n\nFor the layperson, a bridge is a blockchain-based tool through that a user can transfer tokens from one network to another. Noteworthy, the bait was enticing considering the historical surge of projects in their early stages, just like PEPE did and many others like it.\n\nOverview BALD Project Timeline\n\nBALD ran on the BASE chain, which had been developed and availed to developers earlier in July, giving them an avenue to develop their own applications and blockchain-based products in readiness for a scheduled launch later in the year. The BALD developer leveraged this offering to sell his project.\n\nThe project was launched on July 29 on LeetSwap decentralized exchange (DEX), rolling out with a blast to record upwards of 4,000,000% gains as investors locked large volumes of assets in BASE, a blockchain that is yet to go live.\n\nand people legitimately ask us why we’re in this space sometimes pic.twitter.com/VcbW9IP9pp — Prince of Unibot | Manifesting | Gh0Stly (@DextMoon) July 30, 2023\n\nThe project presented as one of the most lucrative, so much so that one investor made upwards of $800,000 in profits within 18 hours after investing only $9,800.\n\nIn just 18 hours, this #crypto wallet went from $9,8k to $815k ‍♂️\n\n\n\nInsider’s first to uncover $BALD & boosted his balance by 8173% !\n\n\n\nLet’s dive in his trades I’ll show his next x100 gem pic.twitter.com/b8IhY0vWG7 — Reflection (@0xReflection) July 30, 2023\n\nAnother trader raked in $1.4 million after seeding in only $500. These millionaire-making events came as the BALD market capitalization sprinted to $85 million within hours. With these success stories trending on crypto X, capital inflow to the program multiplied a hundredfold, catapulting the trading volume to upwards of $100 million in under 24 hours.\n\nAs unsuspecting investors bridged their funds on the Base chain, some knowing there was only a unilateral bridge; fortunes were made as traders capitalized on the hype. Overflows from BALD boded well for other tokens running on BASE blockchain, with the likes of brian (BRIAN), toshi (TOSHI), and basedbot (BOT), among others, jumping a thousand fold with early entrants multiplying their seed money in monumental proportions.\n\nThe ensuing demand pressure saw BALD record an all-time high of around $0.1000 as indicated in the chart above, giving it mainstream attraction. As of July 31, BALD market liquidity was still increasing, with the token developer progressively adding more ETH to a liquidity pool that was steadily trading BALD against Ethereum. Data shows that on at one point on July 31, the BALD/ETH trading pair held more than $32 million in liquidity with upwards of $100 million in volume.\n\nAccording to the Lookonchain blockchain aggregator, the liquidity influx came in the form of four transactions, likely by accomplices, moving a total of 0.534 ETH, or just over $1,000, to buy 50 million BALD within 4 minutes of the token’s issuance. The addresses proceeded to sell 37 million BALD for 554 ETH, which translates to approximately $1.04 million.\n\nThese 4 addresses spent 0.534 $ETH($1K) to buy 50M $BALD (50% of the total supply) within 4 mins of $BALD starting trading.\n\n\n\nThen sold 37M $BALD for 554 $ETH($1.04M).\n\n\n\nEarned $1M with $1K in 1 day! pic.twitter.com/gXIDRjbhic — Lookonchain (@lookonchain) July 30, 2023\n\nAll these culminated to an unfortunate incident, when the developer pulled the rug from underneath the investors by removing nearly 70% of the liquidity.\n\nBALD project developer leaves goodbye message\n\nThe project developer has since left a goodbye message to their victims, explaining why he executed the rug pull. In his own words:\n\nThe developer has deleted their account.\n\nWhat investors ought to have investigated\n\nIn the heat of the surge, investors failed to cross-examine the project’s fundamentals including tokenomics, roadmap, utility, and developing community. As it turned out, BALD was devoid of proper fundamentals, making it a classical pyramid scheme where only “early investors and influencers made the most gains,” as Coindesk puts it. The rest suffered catastrophic losses on the back of exit liquidity.\n\nThe incident has provided a loophole for other bad actors, comprising developers who launched their own imitations that could not be sold in the open market.\n\nImitations that cannot be sold to the open market\n\nIt remains to be seen whether investors will be able to cash in their gains given the unidirectional bridge."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vYml0Y29pbmlzdC5jb20vZWlnaHQteWVhcnMtb2YtZXRoZXJldW0tYS13YWxrLWRvd24tbWVtb3J5LWNoYWluL9IBTGh0dHBzOi8vYml0Y29pbmlzdC5jb20vZWlnaHQteWVhcnMtb2YtZXRoZXJldW0tYS13YWxrLWRvd24tbWVtb3J5LWNoYWluL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Eight Years of Ethereum: A Walk Down Memory Chain | Bitcoinist.com - Bitcoinist",
        "content": "In July 2015, the Ethereum blockchain was launched by Vitalik Buterin and his team of co-founders. With its native cryptocurrency Ether (ETH) and smart contract functionality, Ethereum aimed to become a decentralized world computer that could execute peer-to-peer agreements and applications.\n\nOver the past eight years, Ethereum has cemented itself as the leading smart contract platform, enabling a new wave of decentralized applications across finance, gaming, collectibles and more. It’s also established itself as the second-largest cryptocurrency by market cap, behind only Bitcoin in terms of importance.\n\nTo celebrate eight years of Ether, let’s take a walk down memory chain and revisit some of king of altcoins’ major milestones along the way.\n\nThe Origins of Ethereum\n\nEthereum was first proposed in late 2013 by programmer Vitalik Buterin, then just 19 years old. Buterin envisioned it as a blockchain-based computing platform that could execute decentralized applications and smart contracts. It was announced in January 2014 at the North American Bitcoin Conference in Miami.\n\nIn 2014, Buterin partnered with other co-founders including Gavin Wood, Jeffrey Wilcke, Charles Hoskinson, and Anthony Di Iorio to start developing Ethereum. The non-profit Ethereum Foundation was created in Switzerland to oversee open-source development. The Genesis block launched and went live on July 30, 2015. At launch, the initial Ether supply was 72 million coins, with an initial price around $0.311 per ETH. Since then, it has become the leading smart contract blockchain platform and the second largest cryptocurrency after Bitcoin.\n\nThe ICO Boom of 2017\n\nIn 2017, Ethereum became the platform of choice for launching initial coin offerings (ICOs) – a novel way for crypto startups to crowdfund by selling tokens. That year saw over $6 billion raised through ICOs as investors rushed to fund emerging blockchain projects.\n\nHowever, lack of regulation around ICOs led to many sham offerings, eventually leading to a partial collapse of the ICO market. Nevertheless, Ethereum provided the fundamental infrastructure that enabled the ICO mania and funded many legitimate projects in the space.\n\nThe Rise of Decentralized Finance (DeFi)\n\nStarting in 2018, Ethereum became the foundation for the emerging DeFi – an alternative financial system built on blockchain technology and decentralized networks rather than centralized intermediaries.\n\nDeFi protocols like MakerDAO, Aave, Compound and Uniswap utilize Ethereum’s smart contracts to recreate traditional financial instruments like loans, savings accounts and exchanges in a transparent, global and permissionless way.\n\nThe growth of DeFi has been astounding, with over $20 billion worth of assets locked into Ethereum DeFi protocols today. DeFi has expanded the utility of Ethereum and showcased the potential of decentralized applications.\n\nNFTs Take Off\n\nIn 2017, the ERC-721 standard was proposed as a way to create unique, blockchain-based non-fungible tokens (NFTs) on Ethereum. But NFTs saw mainstream breakout only in 2021, as Ethereum NFT marketplaces like OpenSea, Rarible, and SuperRare hosted multi-million dollar sales of digital art and collectibles.\n\nNFTs represented a new application for Ethereum – helping digital creators monetize their work through scarcity and proof of ownership on the blockchain. While NFTs have received their share of criticism, they undeniably expanded the cryptocurrency’s appeal to new demographics in art, gaming and pop culture.\n\nThe Merge: Transition to Proof-of-Stake\n\nIn September 2022, Ethereum completed its much-awaited Merge upgrade, transitioning from energy-intensive proof-of-work consensus to the greener and scalable proof-of-stake consensus mechanism.\n\nThis monumental technological shift promises to make Ethereum more sustainable and ready for further upgrades like sharding. While the Merge doesn’t automatically reduce gas fees, it lays the foundation for the blockchain to keep pace with its growing adoption.\n\nLooking Ahead: More Use Cases on the Horizon\n\nEthereum has come a long way from its inception as a “world computer” for decentralized applications. Even as Ethereum faces stiff competition from chains like Solana, there’s still tremendous potential for Ethereum to expand its capabilities.\n\nHere are some emerging use cases that could drive adoption over the next few years:\n\nDecentralized identity and reputation systems that could replace online accounts, credentials and reduce spam.\n\nDecentralized data storage networks like Filecoin and Arweave for hosting internet content in a permissionless way.\n\nDecentralized cloud computing resources that could rival centralized cloud service providers.\n\nInternet of Things integration for automation and machine-to-machine transactions using oracles.\n\nFully decentralized autonomous organizations (DAOs) with transparent governance and operations.\n\nTokenization of assets like stocks, bonds, real estate and other contracts to enable fractional ownership and trading on blockchain.\n\nAfter eight years of growth, Ethereum is no longer an experiment – but a battle-tested smart contract platform with a vibrant ecosystem. As Ethereum continues maturing, its decentralized vision could have profound implications for finance, technology and beyond over the next decade. The true capabilities of Web3 are still just beginning to take shape."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMirwFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vZXRoZXJldW0tY2VsZWJyYXRlcy04dGgtYW5uaXZlcnNhcnktY3J5cHRvLXR3aXR0ZXItcmVhY3RzLXRvLXRoZS1yb2xlLXRoZS1wcm9qZWN0LXBsYXllZC1pbi10aGUtaW5kdXN0cnktY2FuLWV0aC1jb250aW51ZS1sZWFkaW5nLXRoZS1tYXJrZXQv0gG1AWh0dHBzOi8vd3d3LmNyeXB0by1uZXdzLWZsYXNoLmNvbS9ldGhlcmV1bS1jZWxlYnJhdGVzLTh0aC1hbm5pdmVyc2FyeS1jcnlwdG8tdHdpdHRlci1yZWFjdHMtdG8tdGhlLXJvbGUtdGhlLXByb2plY3QtcGxheWVkLWluLXRoZS1pbmR1c3RyeS1jYW4tZXRoLWNvbnRpbnVlLWxlYWRpbmctdGhlLW1hcmtldC8_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Celebrates 8th Anniversary – Crypto Twitter Reacts to The Role The Project Played in The Industry – Can ETH Continue Leading The Market? - Crypto News Flash",
        "content": "Ethereum is turning 8 since the Ethereum Foundation launched the network.\n\nBinance CEO Changpeng Zhao has remarked on Twitter, sharing a story about his time with Ethereum’s co-founder, Vitalik Buterin.\n\nThe crypto community has united in celebration of the Ethereum network’s 8th anniversary, commemorating eight years since the Ethereum Foundation launched the network.\n\nOn July 30, 2015, Stephan Tual, the former CCO of the Ethereum Foundation, expressed his admiration in a blog post on the milestone the network has covered and the transformation it entangled with it. In the blog post, he said:\n\nThe vision of a censorship-proof ‘world computer’ that anyone can program, paying exclusively for what they use and nothing more, is now a reality.\n\nAfter eight years, Ethereum and its native cryptocurrency Ether have experienced significant growth, becoming the second-largest cryptocurrency globally, with a market capitalization of $225 billion and an Impressive thriving community of over 1,900 developers actively contributing to the platform monthly.\n\nEthereum’s 8 Years of Progress\n\nTo celebrate the event, community members shared nostalgic moments and reflected on Ethereum’s journey since its inception, including its historical prices, development milestones, and overall expansion.\n\nAccording to Bankless co-host Ryan Sean Adams, Ethereum’s remarkable achievements include an astounding secured value of $400 billion, resulting in annualized profits of $3.6 billion. Moreover, the Ethereum blockchain currently comprises an extensive collection of 17.8 million blocks, holding a diverse array of digital assets within its ecosystem.\n\nHappy birthday Ethereum! 🎂 $400 billion in secured value, $3.6 billion in annualized profits, and a total of 17.8 million blocks of uncensorable digital property. Not bad for an 8 year old. — RYAN SΞAN ADAMS – rsa.eth (@RyanSAdams) July 30, 2023\n\nSeizing the occasion of Ethereum’s birthday as a chance to indulge in nostalgia, Binance CEO Changpeng Zhao on Twitter shared a story about his time with Ethereum’s co-founder, Vitalik Buterin. He recounted the period when Vitalik stayed in Tokyo with him months before the Ethereum launch.\n\nOn this 8th birthday of #Ethereum, a little throw back to May 2, 2015, in Tokyo🇯🇵, just before #ETH was officially born. @VitalikButerin stayed in my apartment in Tokyo during this trip. He was already working on and talking about ETH non-stop. And I still missed (didn't buy)… pic.twitter.com/84B6KN73Qf — CZ 🔶 BNB (@cz_binance) July 30, 2023\n\nCZ mentioned that during that time, Buterin was constantly talking about ETH, and he humorously lamented missing the opportunity to purchase Ethereum during its early days. He playfully remarked, “Had I invested in ETH back then, I might not have felt the urge or motivation to create Binance. Who knows?“\n\nUdi Wertheimer, a former Bitcoin enthusiast who has reformed his views, joined the celebration with a touch of humor, playfully referring to the Ethereum network as his “favorite Bitcoin sidechain.”\n\nHappy birthday Ethereum! My favorite bitcoin sidechain 🧡 — Udi Wertheimer (@udiWertheimer) July 30, 2023\n\nEthereum’s creation was the outcome of a collaborative effort involving several notable figures, most notably Vitalik Buterin, Charles Hoskinson, Gavin Wood, Joseph Lubin, and Anthony Di Iorio. By providing a platform for developers to design smart contracts and create innovative blockchain applications, Ethereum played a crucial role in fueling the initial coin offering boom during late 2017.\n\nMoreover, it played a significant part in the explosive growth of decentralized finance (DeFi) protocols and development, known as “DeFi summer” in 2020.\n\nEthereum’s Journey: From Inception to Unstoppable Progress\n\nUpon its introduction, Ethereum entered the scene six years after the inception of Bitcoin (BTC), the pioneering blockchain in the cryptocurrency space. Bitcoin solely served as a payment network for simple monetary transactions which brought the need for a more diverse blockchain. The primary objective behind the launch of Ethereum was to unlock and realize the full potential of blockchain technology.\n\nEthereum revolutionized the crypto community by being the first blockchain to support smart contracts, paving the way for various use cases that are widely appreciated today. These encompass decentralized finance (DeFi), non-fungible tokens (NFTs), Web 3, and tokenization.\n\nSince its inception, Ethereum has continuously surged forward. According to data from OkLink, the total number of transactions on the Ethereum network has surpassed 2.05 billion Txns. The number of currency-holding addresses has reached 66.12 million, with a total circulation of 47.22 million.\n\nEthereum’s foundation and innovations in the smart-contract space have inspired platforms like Solana, Avalanche, Binance Smart Chain (BSC), Tezos, and Algorand. These projects have drawn upon Ethereum’s success and advancements to build their smart-contract blockchains.\n\nThis article is provided for informational purposes only and is not intended as investment advice. The content does not constitute a recommendation to buy, sell, or hold any securities or financial instruments. Readers should conduct their own research and consult with financial advisors before making investment decisions. The information presented may not be current and could become outdated."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vYml0Y29pbmlzdC5jb20vZXRoZXJldW0tbWV2LWJvdHMtcHJvZml0YWJsZS1kYXlzL9IBPWh0dHBzOi8vYml0Y29pbmlzdC5jb20vZXRoZXJldW0tbWV2LWJvdHMtcHJvZml0YWJsZS1kYXlzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jul 2023 07:00:00 GMT",
        "title": "Ethereum MEV Bots See One Of The Most Profitable Days Due To Exploit | Bitcoinist.com - Bitcoinist",
        "content": "Ethereum MEV Bots have recorded one of their most profitable days due to the Curve Finance exploit. Ethereum’s core developer Eric Connor made this revelation in a couple of tweets on the X platform.\n\nToday has produced some of the largest MEV reward blocks in Ethereum’s history. Slot 6,992,273: 584 ETH\n\nSlot 6,993,342: 345 ETH\n\nSlot 6,992,050: 247 ETH\n\nSlot 6,993,346: 51 ETH — eric.eth (@econoar) July 30, 2023\n\nHow These MEV Bots Work\n\nAs revealed by Connor, one Maximable Extractable Value (MEV) bot received over $1 million in ETH from reproducing and front-running an incoming hack in the Curve stablepools. Three other MEV bots earned 345 ETH ($641,000), 247 ETH ($459,000), and 51 ETH ($94,600) respectively from the transactions.\n\nIn total, MEV bots earned $11.1 million in the 24-hour period, making it the most profitable day for MEV bot deployers since Ethereum completed the move to Proof of Stake (PoS).\n\nFor more insight as to how these works; MEV bots help traders discover large transactions and exploit the opportunity to generate extra revenue through arbitrage. In order to be successful, these traders have to front-run these incoming transactions, and to do this, they pay block producers a significant amount of ETH so their transactions can gain priority, helping them to be validated first.\n\nETH price still trailing at $1,860 | Source: ETHUSD on Tradingview.com\n\nMorality Of Validators Called Into Question\n\nIn this case, the same strategy was applied, and after these MEV bots had discovered the incoming exploit on Curve’s stablepools, ETH validators were paid to give these MEV transactions priority. This event has led many to question the morality of these validators into question with many noting that the money paid to these validators is the proceeds of hacked funds.\n\n“And this is where the morality of MEV rewards going to miners gets pretty shady. These are effectively hacked funds,” A user (@apedev) tweeted.\n\nSeeing the outrage from different users, Connor went as far as conducting a poll to get people’s thoughts on block producers receiving MEV rewards that came as a result of a hack. At the time of writing, 44.9% of respondents believe that these bot deployers should keep the rewards against those calling for these deployers to return the rewards.\n\nConnor noted this situation as “probably a legal grey area,” likely in reference to what the liability of deployers will be if they were to make money from the proceeds of a crime (hack). He also stated that deployers returning these funds is not as straightforward as it appears.\n\nOne MEV bot deployer has, however, acted in good faith and in the spirit of ethical hacking by returning revenue generated from frontrunning the hacker’s transaction.\n\nAccording to on-chain data, a wallet “c0ffeebabe.eth” returned 2,879 ETH ($5.3 million) to Curve’s contract address.\n\nFeatured image from CoinMarketCap, chart from Tradingview.com"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMixQFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vZWxvbi1tdXNrLXJldmVhbHMtMjIteWVhci1wbGFuLXRvLXRyYW5zZm9ybS14LWludG8td29ybGRzLW1vc3QtdmFsdWFibGUtZmluYW5jaWFsLWluc3RpdHV0aW9uLWlzLWludGVncmF0aW9uLW9mLWJpdGNvaW4tZG9nZWNvaW4teHJwLWFuZC1ldGhlcmV1bS1wYXJ0LW9mLXRoZS1wbGFuL9IBywFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vZWxvbi1tdXNrLXJldmVhbHMtMjIteWVhci1wbGFuLXRvLXRyYW5zZm9ybS14LWludG8td29ybGRzLW1vc3QtdmFsdWFibGUtZmluYW5jaWFsLWluc3RpdHV0aW9uLWlzLWludGVncmF0aW9uLW9mLWJpdGNvaW4tZG9nZWNvaW4teHJwLWFuZC1ldGhlcmV1bS1wYXJ0LW9mLXRoZS1wbGFuLz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Elon Musk Reveals 22-Year Plan to Transform X into World’s Most Valuable Financial Institution – Is Integration of Bitcoin, Dogecoin, XRP, and Ethereum Part of The Plan? - Crypto News Flash",
        "content": "Elon Musk is set to transform Twitter into a comprehensive platform for payments and financial services.\n\nCryptocurrencies like Bitcoin, Dogecoin, XRP, and Ethereum may be integrated into this ambitious plan.\n\nSimilar to the report, Elon Musk’s audacious plan to reshape Twitter into the comprehensive platform “X” seems set to revolutionize the world of financial services and payments. This bold vision, nurtured for over 22 years, could turn Twitter into the most valuable financial institution globally. But what piques the interest of cryptocurrency enthusiasts is the possibility of integrating digital assets like Bitcoin, Dogecoin, XRP, and Ethereum into this transformative venture.\n\nAs tweeted by The Spectator Index, Elon Musk recently revealed his long-standing ambition to make “X” the leading financial institution worldwide. This announcement has captivated the attention of industry experts and crypto enthusiasts alike, who eagerly anticipate the potential integration of cryptocurrencies into the platform.\n\nhttps://twitter.com/spectatorindex/status/1685767284638511104?t=0dGMLrnk8RyaVBu8ROo_Qg&s=35\n\nMusk’s interest in digital assets has been well-documented, with Tesla already holding a significant amount of Bitcoin. Furthermore, his playful affection for Dogecoin has been evident in various instances, suggesting that it might find a place within the integrated payment system of “X.” The recent surge in Dogecoin’s value following Twitter’s rebranding only adds fuel to the speculation surrounding its potential incorporation.\n\nThis grand vision for “X” traces its origins back to Musk’s earlier days at PayPal when “X.com” was the platform’s original name. The fact that Musk now owns the “X.com” URL, which redirects to Twitter’s current domain, adds an intriguing dimension to this ambitious endeavor. Furthermore, Twitter has already taken steps to secure money transmitter licenses in certain U.S. states, indicating its commitment to building a robust payment infrastructure.\n\nWhile skeptics may question the impact of integrating cryptocurrencies into Twitter, there is no denying Musk’s massive following, which could prove instrumental in driving broader crypto adoption. The integration of digital assets could open a gateway to crypto transactions not only for the active crypto community on Twitter but also for the wider public, facilitating the use of fintech applications and blockchain solutions like Ethereum and Solana.\n\nTwitter’s previous partnership with payments startup Strike, which introduced a Bitcoin tipping feature, hinted at the platform’s initial foray into the world of cryptocurrencies. Now, with Musk’s long-term vision finally coming to fruition, Twitter’s transformation into a financial powerhouse seems increasingly plausible.\n\nElon Musk’s strategic vision and relentless pursuit of innovation have the potential to redefine Twitter as a financial institution with global significance. If successful, “X” could stand as a symbol of disruption, altering the financial landscape and ushering in a new era of digital finance.\n\nThis article is provided for informational purposes only and is not intended as investment advice. The content does not constitute a recommendation to buy, sell, or hold any securities or financial instruments. Readers should conduct their own research and consult with financial advisors before making investment decisions. The information presented may not be current and could become outdated."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDcvMzEvZXJjLTIyMy1sYW5kcy1hbW9uZy1ldGhlcmV1bS1zdGFuZGFycy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "ERC-223 lands among the Ethereum standards - The Cryptonomist",
        "content": "A few days ago, the ERC-223 token standard, first proposed by well-known hacker Dexaran in 2017, was finally added to Ethereum’s official standards list.\n\nERC-223 solves some security and usability issues of the classic ERC-20, simplifying the end-user-side experience.\n\nLet’s take a look at all the details together.\n\nA dive into the past: the Dexaran hacker and involvement in the Ethereum hard fork\n\nBefore delving into technical issues related to Ethereum’s token standards, it is appropriate to look back at the history of Ethereum’s DAO hack and the subsequent hard fork that saw Dexaran as one of the main players in the affair.\n\nBack in June 2016, an unknown hacker attacked Ethereum’s DAO, known to be the world’s first decentralized autonomous organization committed to supporting and funding the ecosystem of the chain.\n\n3,641,694 ETH worth about $60 million (now more than $7 billion) were stolen by exploiting a native “fallback” function of the Solidity programming language.\n\nThe attacker even sent an encrypted message to the Ethereum team to render the manner in which he had executed the token claim and to clarify that his attack had not violated any US federal law by acting in line with the terms of the DAO smart contract.\n\nHe added in the letter that he would defend himself legally if his stolen assets were illegally freed or blocked by Ethereum’s top management.\n\nThe hack shocked the entire Ethereum community, which hung by a thread for the next two months, waiting to find out how things would unfold for the DAO and how the private investors who had funded the project would be liquidated.\n\nAfter several debates, the Cryptographic Network Foundation chose the hard fork route to “go back in time” and pretend that the hack had never happened.\n\nMore precisely, a new chain ( what we know today as the real Ethereum) was created that was identical to the initial one but resumed address balances at the time before the 3.6 million ether hack.\n\nThis fork was the result of internal disagreement that emerged from the decentralized community, which was divided between those who supported the “code is law” philosophy and those who took a less extreme view and believed that artificial tampering with the code was the right thing to do on such occasions.\n\nOne individual in particular, known by the nickname Dexaran, shared the idea of the immutability of transactions and that even in the face of incidents of this character, the code and history of the blockchain should be respected.\n\nDexaran occupied the faction of those who did not upgrade to the software and remained in the original chain, now known under the name Ethereum Classic.\n\nThe same individual personally committed $500,000 of his personal funds to finance some work on Callisto Network, a decentralized protocol aimed at creating experimental improvements for Ethereum and Ethereum Classic.\n\nThe figure of Dexaran is well known among the Ethereum community, both for his philosophical stance and for inventing the ERC-223 token standard that solves some bugs and transaction efficiency issues related to the classic ERC-20 standard.\n\nThe security and efficiency issues related to ERC-20 tokens\n\nThe token standard proposed in 2017 by the supporter of Ethereum Classic Dexaran, was not intended to solve security issues related to the Ethereum DAO hack, whose flaw in the code was fixed soon after the incident.\n\nThe ERC-223 standard was designed to put a patch over another critical problem that plagued the ERC-20 standard that caused the loss of $3 million in Ether to users in just a few years.\n\nIn detail, we are talking about the fallacy that sees as “lost forever” all those ERC-20 tokens that are mistakenly transferred to a contract address rather than a wallet address.\n\nIn fact, if a user mistakenly sends their tokens to the address of a contract, there is no mechanism that blocks this transaction or returns the assets to the sender (this is because it is not possible to handle incoming token transactions on a contract).\n\nBecause of this programming “flaw,” until 31 December 2017, about $1.3 million in QTUM, $1 million in EOS, $250,000 in GNT, $217,000 in STORJ, and many other small losses have been lost.\n\nAnother problem with the ERC-20 standard relates to an issue of efficiency in ERC-20 address-contract communication: when, for example, a user intends to execute an asset deposit on a decentralized platform such as Aave, they must first approve the transaction and then execute it.\n\nThis happens because the traditional Ethereum standard sees no difference between the interaction between two addresses or between an address and a contract, invoking the “transfer” function in both cases.\n\nWhen you execute the smart contract in question by making the deposit, what is actually performed is a “transferfrom” callback of a previously approved amount of assets.\n\nThis, in addition to being undesirable in terms of “ease of use,” requires the payment of gas fees on two separate occasions as well as clogging the blockchain with transactions with associated risk of “bloating” situations.\n\nEthereum’s ERC-223 token standard\n\nThe ERC-223 standard represents a superset for ERC-20 that allows the use of tokens as first-class value transfer resources in the development of smart contracts.\n\nA few days ago, the ERC-223 was added on the official Ethereum website in the section dedicated to token standards, officially sealing the entry of this category of tokens into the family of the decentralized smart contract development network.\n\nThis was announced by Dexaran, which had already introduced this topic in EIP-223 dated 5 March 2017.\n\nAs mentioned, it serves as a more secure standard in that it does not allow token transfers to contracts that do not explicitly support receiving tokens, hence avoiding mishaps for users less navigated in the field.\n\nGoing more specifically, the benefits of ERC-223 are the following:\n\neliminates the problem of accidentally lost tokens with deposit on contract addresses;\n\nsimplifies the user experience by allowing assets to be sent via a single transfer function;\n\nallows developers to manage incoming token transactions on contracts;\n\nreduces unnecessary spending of gas fees , helping the network reduce congestion;\n\n, helping the network reduce congestion; makes transactions similar to those that occur with Ether;\n\nIt is worth noting that the ERC-223 standard is backward compatible with ERC-20 tokens, hence every feature of the primary standard is applicable to the secondary standard.\n\nAll contracts or services that work with ERC-20 hence can also be used with ERC-223.\n\nIn addition, there is a converter that allows ERC-20 tokens to be converted to ERC-223 1:1 at any time without cost or restriction. ERC-223 tokens can also be converted back to the ERC-20 origin.\n\nA series of tutorials and guidelines exploring the workflow and operation of ERC-223 tokens will be presented by Dexaran in the coming days.\n\nAll the details have been published in a post on Reddit.\n\nWe hope that Dexaran’s proposed standard will play a central role in the Ethereum framework, going on to improve the user experience and eliminate unnecessary risks for users, with a push toward mass adoption of cryptocurrencies."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vY2FwdGFpbmFsdGNvaW4uY29tL2hvdy10by1icmlkZ2UtY29pbnMtYmFjay1mcm9tLWJhc2UtdG8tZXRoZXJldW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "How To Bridge Coins Back From Base To Ethereum: A Comprehensive Guide - Captain Altcoin",
        "content": "Home » De-Fi How To Bridge Coins Back From Base To Ethereum: A Comprehensive Guide De-FiJournal How To Bridge Coins Back From Base To Ethereum: A Comprehensive Guide Rene Peters\n\nThere’s been a common misconception that bridging into the Base chain is a one-way process with no way to withdraw funds. However, this is not the case. It is indeed possible to use the native withdrawal process to get your funds back on the Ethereum mainnet, albeit with a waiting period of 7 days.\n\nTwitter user Cygaar shared a detailed guide on on how to do it. The Base chain is essentially a 1-1 fork of Optimism, which means it can leverage all the features that Optimism has. This includes a native withdrawal process that allows users to move ETH from Base back to the Ethereum mainnet. The downside is that it takes 7 days due to the challenge period.\n\nThis 7-day period is necessary because optimistic rollups need a long enough period to challenge potentially fraudulent claims. Due to this waiting period, most people opt to use third-party bridges to bridge back to the mainnet quicker. However, the native withdrawal method should always work.\n\nThe Withdrawal Process\n\nTo start the withdrawal process, users need to visit the L2StandardBridge contract on the Base chain. From there, they can choose either “withdraw” or “withdrawTo”, with the only difference being that the latter allows users to choose the destination address that receives the ETH on the mainnet.\n\nThe fields need to be filled out as follows:\n\nwithdraw : This is the amount of ETH you want to bridge back. _l2Token : Use the value 0xDeadDeAddeAddEAddeadDEaDDEAdDeaDDeAD0000 . This is the ETH token address on Base. _amount : This should be the same value you used for part 1, but converted to wei. _minGasLimit : Put 0 _extraData : Put 0x\n\nAfter submitting the transaction, users should save the transaction hash for later reference.\n\nThe Role of Optimism\n\nOptimism handles withdrawals by requiring users to post a proof to L1 that they did a withdrawal on the L2 (Base in this case). After this, the user must wait 7 days to pass so any external party has the opportunity to challenge the proof. If no challenge happens, the user can finalize their withdrawal on L1.\n\nFor Base, users can use a command-line tool for withdrawals written by the Base team. This tool requires the necessary inputs – transaction hash from above, RPC URL, and the private key of the account that withdrew.\n\nExplosion in Meme Coin Market; How to find potential successors to $BONK, $PEPE, and $WIF?🤫 The key? Getting in early, especially during the ICO phase. Check out NuggetRush today! This pioneering memecoin combines play-to-earn gaming with authentic gold mining ventures. Seize the opportunity with ongoing presale prices! Plus, prepare for $NUGX’s upcoming launch on major exchanges. Show more + Show less –\n\nAfter running this command, users will get a transaction hash. They can confirm that their proof went through by looking up this transaction hash on Etherscan (for mainnet). They’ll then have to wait 7 days before proceeding. Once this challenge period is over, they can run the second command for finalizing the withdrawal.\n\nWithdrawing from the Base chain back to Ethereum isn’t particularly hard, but it does require some technical savviness for now. This guide is meant for people that absolutely need to bridge back right now and don’t want to wait for the official bridge UI to come out. The Optimism stack was always built with a way to bridge back from L2 to L1, they just happened to make a UI to make this process easier. This guide works for all Optimism-stack chains."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vZ2xhbXNoYW0uY29tL3dvcmxkL3RlY2hub2xvZ3kvZXRoZXJldW0tZm91bmRlci1yZWxpc2hlcy1naGV2YXItbWFzYWxhLWRvc2EtaW4taW5kaWHSAWFodHRwczovL2dsYW1zaGFtLmNvbS93b3JsZC90ZWNobm9sb2d5L2V0aGVyZXVtLWZvdW5kZXItcmVsaXNoZXMtZ2hldmFyLW1hc2FsYS1kb3NhLWluLWluZGlhP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Ethereum founder Vitalik Buterin relishes ‘Ghevar’, ‘Masala Dosa’ in India - Glamsham",
        "content": "New Delhi, July 31 (IANS) Vitalik Buterin, the Russia-based co-founder of the world’s second-largest cryptocurrency Ethereum, has celebrated the cryptocurrency’s eighth birthday in Bengaluru with some ‘Masala Dosa’ and ‘Ghevar’ cake.\n\nHe was seen celebrating the birthday with Ethereum-based Blockchain platform Polygon COO Sandeep Nailwal and founder of CryptoRelief. “Celebrating Ethereum’s eighth birthday with Vitalik Buterin with Indian ‘Ghever’ as cake in Bengaluru. Happy Birthday, Ethereum!” Nailwal tweeted along with the pictures of Buterin relishing Ghevar and Masala Dosa.\n\n“Also getting Vitalik do a bit of Bharat Darshanam,” he added.\n\nGhevar is a Rajasthani disc-shaped sweet made with flour, ghee, and milk, soaked in sugar syrup, while Masala Dosa is a South-Indian dish.\n\nFounded on July 30, 2015, Ethereum has grown quickly to become the second-largest cryptocurrency after Bitcoin.\n\nSeveral users in the comment section also wished the crypto firm a happy birthday.\n\n“Happy 8th Birthday Ethereum! As Ethereum’s founder graces India, so does the Ethereum blockchain extends its grace to the entire Web3 community!” a user commented.\n\n“Hope this meet up fruitful n hope you guys discussed more about Public Goods and creating impact via blockchain. Happy 8th Birthday to Ethereum,” another user said.\n\nMoreover, Buterin’s connection with India, however, stretches beyond the delicacies as the programmer had in 2021 made a legendary donation of 500 coins and over 50 trillion SHIB meme coin worth around $1.14 billion to the India Covid-Crypto Relief Fund.\n\nButerin became involved with cryptocurrency early in its inception, co-founding Bitcoin Magazine in 2011.\n\nIn 2013, he visited developers in other countries who shared his enthusiasm for code.\n\nHe returned to Toronto later and published a white paper proposing Ethereum.\n\nHe dropped out of university in 2014 when he was awarded with a grant of $1,00,000 from the Thiel Fellowship, a scholarship created by venture capitalist Peter Thiel and went to work on Ethereum full-time. One Ethereum is currently priced at around Rs 1.53 lakh.\n\n–IANS\n\nshs/pgh"
    }
]