[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDUvMTcvZXRoZXJldW1zLWxvc3Mtb2YtZmluYWxpdHktd2hhdC1oYXBwZW5lZC_SAVZodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA1LzE3L2V0aGVyZXVtcy1sb3NzLW9mLWZpbmFsaXR5LXdoYXQtaGFwcGVuZWQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Ethereum Briefly Stopped Finalizing Transactions. What Happened? - CoinDesk",
        "content": "“Today’s incident has been a great fire drill. It looks like two or three issues came together (as is often the case). The chain recovered gracefully and we discovered a few other issues that could be improved to make Ethereum more resilient,” tweeted Marius van der Wijden, a developer at the Ethereum Foundation."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMisAFodHRwczovL2ZyZWRlcmlja3NidXJnLmNvbS9icmFuZGF2ZXN0dWRpb3MvdW5kZXJzdGFuZGluZy1ldGhlcmV1bS1ob2xkaW5nLWV4cGxvcmluZy1wb3RlbnRpYWwtYmVuZWZpdHMtYW5kLXJpc2tzLWZvci1pbnZlc3RvcnMvYXJ0aWNsZV8yM2Y3MzBlZC1mMmU4LTVlZWItODdkOC1kMDUzNDMzZDJmM2IuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 May 2023 07:00:00 GMT",
        "title": "Understanding Ethereum holding: Exploring potential benefits and risks for investors - Fredericksburg.com",
        "content": "Before buying Ethereum (ETH), or any cryptocurrency for that matter, it is always a good idea to do your research to be sure of the potential risks and benefits. This guest post will provide an overview of investing in Ethereum, including an exploration of the basics of Ethereum, the power of HODLing, the benefits of Ethereum HODLing, best practices, risks and considerations, and how you can start investing in Ethereum.\n\nUnderstanding Ethereum: The basics\n\nEthereum is a decentralized blockchain platform that helps in developing smart contracts and decentralized applications (dApps). Its native cryptocurrency, Ether (ETH), is the second-largest cryptocurrency by market capitalization after Bitcoin. Ethereum differs from Bitcoin in that it not only serves as a digital currency but also provides a platform for creating and executing programmable smart contracts, which allows for various applications beyond simple transactions.\n\nThe power of holding: Why Ethereum?\n\nHODLing, a term popularized in the cryptocurrency community, refers to holding onto your cryptocurrency investments for the long term, regardless of short-term market fluctuations.\n\nEthereum's smart contract functionality and position in decentralized application development make it a potential long-term investment option for some investors. It has also been shown to be growing in adoption by businesses and developers.\n\nBenefits of Ethereum holding\n\nSome investors view Ethereum HODLing as a potential way to earn financial returns. Ethereum's historical performance has included significant price increases, and some market projections suggest the potential for long-term appreciation. However, as with any investment, there are risks to consider.\n\nFurthermore, Ethereum HODLing can be a strategic investment for diversifying your portfolio. As traditional investment options may be subject to inflation and other economic factors, holding Ethereum can provide a hedge against these risks. Additionally, Investors can potentially earn passive income through staking their Ethereum holdings and participating in the network's consensus mechanism.\n\nBest practices for Ethereum holding\n\nTo effectively HODL Ethereum, it is recommended to follow some best practices. First, it can be essential to set clear investment goals and have a long-term investment mindset. Avoid being swayed by short-term market fluctuations and resist the urge to make impulsive decisions based on emotions. Conduct thorough research and stay informed about the cryptocurrency market, Ethereum's development and any regulatory changes that may impact its value.\n\nIn addition, make sure to choose the right storage options for your Ethereum holdings.\n\nMany investors prefer hardware wallets or cold storage options as they are often considered more secure than keeping Ethereum on exchanges or online wallets. Implement proper security measures, such as using strong passwords and enabling two-factor authentication, to safeguard your Ethereum holdings.\n\nRisks and considerations\n\nAs with any investment, Ethereum HODLing can also come with risks and considerations.\n\nThe value of Ethereum, like other cryptocurrencies, can be highly volatile and may fluctuate significantly in a short period of time. Regulatory changes or technological risks could also impact the value and adoption of Ethereum. Therefore, it's crucial to carefully assess the risks and consider your risk tolerance before investing in Ethereum.\n\nIt's also important to note that cryptocurrency investments should not constitute your entire investment portfolio. Diversify your investments across different asset classes to manage risks effectively and ensure a well-rounded investment strategy. Consider your overall financial goals, investment timeline and risk tolerance before allocating a portion of your portfolio to Ethereum.\n\nConclusion\n\nEthereum HODLing may be a potential strategy for long-term financial growth and investment opportunities. By understanding the basics of Ethereum, adopting a long-term investment mindset, diversifying your portfolio, managing risks and implementing proper security measures, you can start your journey toward financial security with Ethereum. Remember to always do your research, consult with a financial advisor if needed and stay informed about the ever-evolving cryptocurrency market. Get started with Ethereum HODLing today and unlock the exciting possibilities for your financial future.\n\nThis content is for informational purposes only and should not be construed as financial advice.\n\nLee Enterprises newsroom and editorial were not involved in the creation of this content."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA1LzE2L2JldHRlci1idXktY2FyZGFuby1vci1ldGhlcmV1bS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 May 2023 07:00:00 GMT",
        "title": "Better Buy: Cardano or Ethereum? - The Motley Fool",
        "content": "Every year, it seems, there's a new blockchain rival that investors think might eventually take Ethereum's (CRYPTO: ETH) place as the top Layer-1 blockchain. In years past, these blockchain rivals have included the likes of Solana (CRYPTO: SOL) and Avalanche (CRYPTO: AVAX). But, due to its strong track record of innovation, Ethereum has retained its market-leading position.\n\nThis year, the blockchain that everyone is talking about as a potential Ethereum rival is Cardano (CRYPTO: ADA). Year to date, Ethereum is up 53%, and Cardano is up 50%, so it's almost a dead heat. Let's take a closer look at how the two blockchains stack up to see which one is the better investment right now.\n\nEthereum's first-mover advantage\n\nEthereum has the first-mover advantage in just about every sector of the blockchain world. It literally invented the concept of smart contracts, so it's perhaps no surprise that it is still the clear leader in everything from non-fungible tokens (NFTs) to decentralized finance (DeFi). If you take a look at the top-selling NFT collections, for example, almost all of them are Ethereum-based, and it remains the top blockchain by overall NFT sales volume.\n\nBut the one drawback of Ethereum has always been its performance. There are blockchains that are faster and cheaper to use, and that has left openings for new rivals to emerge. This is the reason Solana and Avalanche first emerged as potential \"Ethereum killers.\" Even after The Merge, Ethereum still relies on a complex network of Layer-2 scaling solutions to process transactions quickly and keep fees in check. The main Ethereum blockchain can still only process 10 to 20 transactions per second. Meanwhile, Solana routinely handles 5,000 transactions per second, and has plans to boost its capacity to 600,000 transactions per second.\n\nNew Cardano innovations\n\nThat's why some investors are sitting up and taking notice now that Cardano has finally introduced its long-promised Layer-2 scaling solution, Hydra. According to some Cardano developers, Hydra is the key to 1 million transactions per second. That's a performance benchmark that Ethereum has been promising (but failing to deliver) for years. At 1 million transactions per second, the Cardano blockchain would be nearly 15 times faster than Visa's credit card network, which claims to be capable of processing 65,000 transactions per second.\n\nAnd Cardano has suddenly boosted its profile in the DeFi world, where for years it was a non-player. DeFi is a new priority for Cardano in 2023, and thus far, the blockchain has delivered. It has a new stablecoin, new decentralized exchanges, and new DeFi protocols. Combined, all of these innovations could make it possible for Cardano to create a robust DeFi ecosystem. It's too early to say that Cardano is a serious rival to Ethereum, given that it still ranks No. 18 among all blockchains in DeFi. However, the case can now be made that it's no longer a so-called ghost chain where nothing ever happens.\n\nWho is innovating faster?\n\nAt the end of the day, the blockchain sector is just like any other part of the tech industry. Innovation matters, and investors are willing to pay a premium for tokens on blockchains that appear to be innovating faster. Right now, Ethereum is still riding high after pulling off The Merge last year -- a technological feat that some have compared to changing the engine of an airplane in mid-flight. So the innovation bar is high these days. Investors are looking for truly breakthrough innovations, not just incremental improvements.\n\nUltimately, the answer to the question of which blockchain is innovating faster might come down to performance in newly emerging areas such as artificial intelligence (AI). The blockchain that secures a clear first-mover advantage in AI, for example, could be the one to invest in for long-term growth. Thus far, neither Cardano nor Ethereum has emerged as the obvious market leader, although Cardano does seem to have the makings of an AI strategy.\n\nAnd the winner is...\n\nRight now, I'm bullish on both Ethereum and Cardano. Both blockchains have seen stellar gains thus far in 2023. But, given Ethereum's track record of delivering performance over a longer period of time and its entrenched status as the market leader, the nod goes to Ethereum as the better buy."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy8zLXJlYXNvbnMtd2h5LWV0aGVyZXVtLXByaWNlLWNvdWxkLXN0cnVnZ2xlLWF0LXRoZS0xLTlrLWxldmVs0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 May 2023 07:00:00 GMT",
        "title": "3 reasons why Ethereum price could struggle at the $1.9K level - Cointelegraph",
        "content": "Since May 12, Ether’s price has been struggling to sustain its $1,800 support level, as investors face pressures from a worsening crypto regulatory environment and the Ethereum network’s high gas fees. Also negatively impacting Ether’s (ETH) price are three indicators signaling reduced demand for its decentralized applications (DApps) and a lack of leverage buying demand from professional traders.\n\nRegulators signal their plan to further limit crypto intermediaries\n\nAccording to court documents filed on May 15, the United States Securities and Exchange Commission (SEC) has given a formal response in court in relation to Coinbase’s petition for clear crypto regulation. The SEC stated that any rulemaking may take years and that enforcement actions will continue in the meantime.\n\nOn May 16, the Economic and Financial Affairs Council of the European Union — comprising finance ministers of all member states — approved the highly anticipated Markets in Crypto-Assets (MiCA) regulation, which will come into effect by mid-2024.\n\nSome argue that MiCA facilitates business growth in the region. Others focus on the privacy risks for personal users’ data and the risks imposed on non-custodial solutions, including decentralized finance applications.\n\nThe drop in DApp deposits is concerning\n\nThe Ethereum network is experiencing problems caused by surging gas fees — the cost associated with transactions, including those performed by smart contracts. For the past four weeks, the average transaction fee has stood above $9, which severely limited the demand for DApp usage.\n\nTotal deposits on the Ethereum network in Ether terms plunged to their lowest levels since August 2020. Such an analysis excludes the effects of native Ethereum staking, which recently started to allow withdrawals.\n\nEthereum network applications' total deposits in ETH. Source: DefiLlama\n\nAccording to DefiLlama data, Ethereum DApps reached 14.9 million ETH in total value locked (TVL) on May 16. That compares with 16.5 million ETH two months prior, a 10% decline. As a comparison, TVL on BNB Smart Chain in BNB (BNB) terms was essentially flat in the same period, while Polygon (MATIC) deposits on the Polygon network increased by 29%.\n\nBNB Smart Chain attempts to take a lead in DEX volume\n\nEthereum might have been the absolute leader in decentralized exchange (DEX) volume since its inception, but this position is being challenged. Ethereum’s market share by volume on DEXs peaked at 75% in the week ending March 5 but steadily declined to its lowest level ever, 39.6%, in the week ending May 14.\n\nWeekly DEX volume by chain. Source: DefiLlama\n\nGainers since March 5 on DEX trading volume were Arbitrum, increasing to 14% from 7%, and BNB Smart Chain, growing to 31% from 5.6%. One might argue that the success of the Ethereum network’s scaling solutions reflects bullishness for Ether’s price, but that relationship is not so direct.\n\nRelated: Updated European tax directive requires reporting on all crypto asset transfers\n\nData shows pro traders turning bearish\n\nEther quarterly futures are popular among whales and arbitrage desks. However, these fixed-month contracts typically trade at a slight premium to spot markets, indicating that sellers are asking for more money to delay settlement.\n\nAs a result, ETH futures contracts in healthy markets should trade at a 5 to 10% annualized premium — a situation known as contango, which is not unique to crypto markets.\n\nEther 3-month futures annualized premium. Source: Laevitas\n\nEther professional traders have avoided leverage longs (bullish bets) since early April. Moreover, the current 1% ETH futures premium is on the edge of becoming negative, known as backwardation — if confirmed, this is an alarming red flag, as bearish demand dominates the scene.\n\nIn short, these three indicators — namely, the reduced TVL, record-low DEX market share and lack of leverage buying demand — signal the $1,900 resistance will be hard to break in the short term. For now, Ether bears are in control, favoring the odds of a price correction.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V0aGVyZXVtLWRlZmxhdGlvbmFyeS1tb2RlbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "High Gas Fees Worth the Pain? Ethereum's Deflationary Model in Action - Blockworks",
        "content": "Using Ethereum is expensive.\n\nWhether it’s from trading on DeFi, flipping NFTs, or gambling with memecoins, transaction fees have been driven upward for months on the network. The rise extends to simply sending tokens from one wallet to another.\n\nWhile recent memecoin buffoonery has exacerbated the problem, ether (ETH) gas fees have been gradually climbing long before the more recent get-rich-quick PEPE craze, with previous perpetrators Uniswap and Blur elevating costs.\n\nBut it’s not all bad. New mechanisms introduced by EIP-1559 in 2021 brought in the burning of base fees, causing deflationary conditions for the network.\n\nThis fee model contributes to the narrative of Ethereum as “ultrasound money,” reducing the supply of ETH as on-chain activity drives demand. Adam Smith might have been on to something.\n\nIn theory, a reduction in supply should increase Ethereum’s value as an asset in the long term. Avi Felman, head of digital asset trading at GoldenTree Asset Management, and Jonah Van Bourg, Cumberland’s global head of trading, spoke to Blockworks on the 1000x podcast about their evolving investment thesis for Ethereum.\n\n“Even though 16 gwei is neutral gas levels for Ethereum,” Van Bourg says, “we’re consistently averaging 50 to 150 gwei.” As a result, ETH is highly deflationary at the moment, he says.\n\n“And even if it does eventually die down,” he says, “the ETH that’s being burned as a result of this activity is never coming back.”\n\nVan Bourg asks Felman, “What does it mean for price, and what does it mean for supply and demand of block space? Is there an investment thesis there?”\n\nEIP-1559 opened the monetary door\n\nFelman says the “best thing” Ethereum ever did for itself was the implementation of EIP-1559, which made ETH as an asset more attractive for investment.\n\n“It opened the door for so much institutional capital to come into this space,” he says.\n\n“I gave a talk last week at a conference that was filled with a lot of pension fund allocators, a lot of institutional allocators. I got an obscene amount of questions on it,” Felman says.\n\n“My job,” he says, was to “teach these guys about what crypto is, cuz these guys knew, when I say nothing, I mean literally nothing, about crypto.”\n\nFelman suggests Ethereum fee burns behave like traditional finance stock buybacks. Just as a company can buy back their own equity to indirectly increase value for shareholders, a fee burn can indirectly drive price action for anyone holding ETH. “If ETH annualizes out to $5 billion a year in burn fees, that’s a pretty substantial ‘buyback,’ right?”\n\n“And this is all during a bear market,” he adds.\n\n“That really hit home for a lot of people.”\n\nEthereum stands apart from other layer-1 protocols because of this formula, Felman says.\n\nOther layer-1s like Solana, he says, do not generate fees in the same way — and, importantly, do not burn fees to reduce supply. Alternative layer-1s as such do not “generate revenue for their shareholders in the same way that Ethereum does,” so “allocators are just way less likely to come in and buy it.”\n\n“Because all eyes are on Ethereum, because that’s where the speculative money is, because that’s where the market participants are, they’re able to charge those fees,” he says.\n\nFelman compares the current attractiveness of Ethereum to the appeal of living in New York. “Yes, Manhattan’s expensive, but it’s expensive for a reason — because everybody’s there, and everybody that you want to be around is already there.”\n\nAnd the beauty of proof of stake is that all of those fees that are burned and all the fees that are generated, Felman says, “are now paid back to owners of the asset.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vY29pbmNvZGV4LmNvbS9hcnRpY2xlLzIyODI1L3ZpdGFsaWstYnV0ZXJpbi1uZXQtd29ydGgv0gFBaHR0cDovL2FtcC5jb2luY29kZXguY29tL2FydGljbGUvMjI4MjUvdml0YWxpay1idXRlcmluLW5ldC13b3J0aC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Vitalik Buterin Net Worth 2023: How Rich Is the Founder of Ethereum? - CoinCodex",
        "content": "Ethereum co-founder Vitalik Buterin has an estimated net worth of more than $400 million, which takes into account one of his publicly known crypto wallets. However, Vitalik Buterin’s net worth could be much higher, as his investments and other crypto holdings are not publicly known.\n\nWho is Vitalik Buterin?\n\nVitalik Buterin is a Russian-Canadian computer programmer best known as a co-founder of the Ethereum network. Image source: Michael Ciaglo/Getty Images\n\nVitalik Buterin is a co-founder of Ethereum and one of the leading figures in the cryptocurrency and blockchain industry. He was born in 1994 in Russia, but spent most of his early life in Canada. Buterin developed an interest in Bitcoin at a young age and became involved in the cryptocurrency community while still in high school. In 2011 he co-founded Bitcoin Magazine, which has often been referred to as the first serious crypto publication.\n\nIn the 2013 whitepaper – called A Peer-to-Peer Electronic Cash System – he proposed the creation of Ethereum, a decentralized platform that would allow for the creation of smart contracts and decentralized applications (dApps).\n\nButerin's vision for the Ethereum blockchain was to create a decentralized platform that would allow developers to build and deploy dApps on top of it. He believed that this would allow for greater transparency and security, as well as the ability to build applications that were not controlled by any single entity. The Ethereum team raised 31,500 BTC in their ICO, and the mainnet officially launched in 2015. It has since become one of the leading blockchain platforms in the world, with a market capitalization of roughly $150 billion as of December 2022.\n\nButerin is a highly influential figure in the cryptocurrency and blockchain community and is frequently sought out for his insights and opinions on the industry. He has received numerous awards and accolades for his work, including the World Technology Award for Information Technology in 2014 and the Peter Thiel Fellowship in 2014. Buterin has also been recognized as one of the top 100 most influential people in the world by Time Magazine.\n\nWhat is Vitalik Buterin's net worth in 2023? Examining the Ethereum founder’s crypto wallet\n\nVitalik Buterin’s crypto wallet.\n\nVitalik Buterin has a crypto wallet that holds $440,259,570 in different types of coins and assets, as of May 17, 2023. There are also 4,163 NFTs in the wallet, although their exact value is unknown.\n\nETH is the only significant crypto holding in Vitalik Buterin’s wallet.\n\nIn total, Buterin’s wallet has 682 different types of coins and tokens. The vast majority of the wallet’s total funds is in Ethereum (ETH), with over $440 million.\n\nCryptocurrency Quantity Value in USD % of Tot. Assets Ethereum 244,001 ETH $440,282,744 ~99.9% 0xBitcoin 210,050 0xBTC $23,380 ~0.01% yfarm.finance 25 YFM $1,552 ~0.0004% Jetcoin 100,000 JET $261 ~0.0003% Pomi 2,000,000,000 POMI $120 ~0.0003%\n\nThe reason for the vast number of different types of digital currencies lies in the fact that random crypto holders are sending crypto funds to Buterin’s publicly known wallet address. This explains extremely low holdings for certain tokens, like less than one penny of Constitution DAO, or a couple of dollars of Meta Doge, for instance.\n\nAs mentioned earlier, pinpointing Vitalik Buterin’s net worth is virtually impossible due to the nature of private investments. However, an interesting exchange that happened on social media in November seems to suggest that Buterin’s crypto wallet holdings and real fortune seem to be aligned.\n\n$1b is still much more than I have — vitalik.eth (@VitalikButerin) November 9, 2022\n\nIn the immediate collapse of FTX, a Twitter user pointed out that Sam Bankman-Fried’s networth plunged to $1 billion, to which Buterin responded: “$1b is still much more than I have.”\n\nHow much Ethereum (ETH) does Vitalik have?\n\nButerin has 244,001 ETH in his wallet as of May 17, 2022, worth over $440 million. The highest number of Ethereum in Buterin’s wallet was 325,001 and was recorded in July 2021, per Etherscan data.\n\nVitalik Buterin held as much as $1.5 billion worth of ETH in his wallet last November.\n\nThe recent crypto downturn has had a notably negative impact on Vitalik’s net worth. At Ethereum’s peak value last November, Buterin had more than $1.5 billion worth of ETH in his cryptocurrency wallet.\n\nVitalik’s crypto ventures\n\nIn addition to Ethereum itself, Vitalik has been involved in a number of blockchain projects. Some of these include the L4 research group, which focuses on the scalability of blockchain technology, and the Plasma Group, which is working on ways to improve the scalability and security of Ethereum.\n\nButerin is also involved in other projects and initiatives, such as the Ethereum Foundation, which supports the development of Ethereum, and the Zcash Foundation, which supports the development of the Zcash (ZEC) privacy-focused cryptocurrency. On the whole, Buterin is a major contributor to the blockchain industry and is an advocate of decentralization, smart contracts, and open-source code.\n\nFinal thoughts: Vitalik Buterin controls the 31st-largest ETH address\n\nButerin is a well-known figure in the crypto space and is respected for his technical and philosophical contributions to the industry. He is widely regarded as one of the leading voices in the industry and his direct and deep involvement with Ethereum has made him one of the richest individuals in crypto.\n\nAccording to Etherscan’s list of the largest Ethereum account balances, Buterin is placed number 31st and accounts for roughly 0.203% of all ETH in circulation. This makes him one of the largest individual ETH owners, at least in terms of the amount of funds deposited into a single account.\n\nButerin’s crypto wallet holdings closely edge out the net worth of Justin Sun, another prominent crypto figure and the founder of the TRON cryptocurrency.\n\nOn a related note, give our article on Elon Musk's net worth a read if you want to find out how he became the first person in history to lose $200 billion."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vdWsuZmluYW5jZS55YWhvby5jb20vbmV3cy93b3JsZGNvaW4tY2hhdGdwdC1zYW0tYWx0bWFuLWV0aGVyZXVtLWNyeXB0by0xNDE3MzUwNjcuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 May 2023 07:00:00 GMT",
        "title": "Worldcoin: ChatGPT's Sam Altman's Ethereum-based crypto venture - Yahoo Finance UK",
        "content": "CHATGPT's Sam Altman is behind Worldcoin. Photo: Drew Angerer/Getty (Drew Angerer via Getty Images)\n\nWorldcoin, the controversial iris-scanning cryptocurrency venture led by ChatGPT's Sam Altman has teamed up with Ethereum Layer 2 Optimism.\n\nThe San Francisco-based project, established in 2019 as a prototype for powering universal basic income, has announced an operational shift by transitioning from Polygon to Ethereum's Layer 2 Optimism.\n\nWorldcoin's applications, including the World App wallet and World ID — a privacy-focused decentralised identity protocol enabling sign-ins to various platforms like websites, mobile apps, and web3 dApps — are slated for migration from Polygon (MATIC-USD) to Optimism.\n\nADVERTISEMENT\n\nRead more: Japan vies to be 'number one again through web3 innovation' | The Crypto Mile\n\nThis move is a part of a larger partnership with the Ethereum-based Optimism Collective. Ethereum Layer 2 Optimism (OP-USD) is a technology that increases Ethereum's transaction speed and lowers transaction fees.\n\n\"With more than 1.6 million sign-ups in beta and 500,000+ monthly active World App users, the deployments on the Optimism mainnet will expand access and help Worldcoin reach a values-aligned ecosystem of developers and users,\" the Worldcoin Foundation said in an announcement.\n\nWorld ID & World App are coming to the @OptimismFND Mainnet 🪩 🔴https://t.co/0utgzeWihY — Worldcoin (@worldcoin) May 11, 2023\n\nWhat is Worldcoin?\n\nWorldcoin is backed by venture capital firm Andreessen Horowitz and co-founded by OpenAI chief executive Sam Altman. It is meant to help the world adjust to the possibility of mass-unemployment brought about by AI automating away millions of jobs.\n\nIt aims to create a global digital currency that is distributed to everyone in the world as a universal basic income.\n\nStory continues\n\nHowever, to gain access to the new cryptocurrency and its monetary system, users must scan their iris — controversially giving Worldcoin access to potentially billions of individual biometric data profiles from across the planet.\n\nRead more: Memecoins debut on Bitcoin blockchain causing congestion and record high transaction fees\n\nThe iris scan is meant to ensure that people only receive their designated distribution.\n\n“Worldcoin is building the world’s largest identity and financial network as a public utility, giving ownership to everyone,” he project said.\n\nThe Worldcoin Foundation added: \"We aim to create universal access to the global economy regardless of country or background, accelerating the transition to an economic future that welcomes and benefits every person on the planet.\n\nWorldcoin is not available to use at present, it is still in its development phase.\n\nWatch: Japan vies to be 'number one again through web3 innovation' | The Crypto Mile\n\nDownload the Yahoo Finance app, available for Apple and Android."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA1LzE3L2V0aGVyZXVtLWdhbWluZy1hbHRjb2luLXJhbGxpZXMtYWZ0ZXItcHJvamVjdC1nZXRzLXNwb3QtaW4tYXBwbGUtYXBwLXN0b3JlL9IBcGh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA1LzE3L2V0aGVyZXVtLWdhbWluZy1hbHRjb2luLXJhbGxpZXMtYWZ0ZXItcHJvamVjdC1nZXRzLXNwb3QtaW4tYXBwbGUtYXBwLXN0b3JlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Ethereum Gaming Altcoin Rallies After Project Gets Spot in Apple App Store - The Daily Hodl",
        "content": "An Ethereum-based (ETH) gaming altcoin is outshining crypto markets after being listed on tech giant Apple’s app store.\n\nIn a new announcement, prominent gaming metaverse Axie Infinity (AXS) says it’s expanding its global reach by joining forces with Apple to bring over its strategy-based card game to iPhone users in Latin America and East Asia.\n\n“We’re thrilled to announce that Axie Infinity: Origins is now available on iOS in select countries across [Latin America] and Asia!\n\nThis is [an] important step towards a world where anyone, anywhere can experience the magic of Axie on their preferred device. If you live in Argentina, Colombia, Peru, Mexico, Venezuela, Indonesia, Malaysia, or Vietnam, you can now download Origins for iOS from the AppStore.”\n\nThe game features digital pets called axies which players can collect in NFT (non-fungible token) form. According to Axie Infinity, this marks the first time ever that Apple has ever allowed outside NFTs to be usable in the Apple store.\n\n“Significantly, iOS Players will be able to use their NFT axies in this release. We believe this is the first time that Apple has agreed to make an externally-purchased NFT usable on the App Store.”\n\nNews of the collaboration sent AXS flying. The 56th-ranked crypto asset by market cap went from its 24-hour low of $6.76 up to $8.11, a 20% increase. AXS has since retraced and is trading for $7.25 at time of writing, a 6.1% increase during the last day, while most of the crypto markets are trading in the red.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/FOTOGRIN"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9saWRvLWxhdW5jaGVzLXYyLWFuZC1yZWxlYXNlcy1zdGFrZWQtZXRoZXJldW0tZm9yLXdpdGhkcmF3YWxzL9IBW2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9saWRvLWxhdW5jaGVzLXYyLWFuZC1yZWxlYXNlcy1zdGFrZWQtZXRoZXJldW0tZm9yLXdpdGhkcmF3YWxzLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 May 2023 07:00:00 GMT",
        "title": "Lido Launches V2 and Releases Staked Ethereum for Withdrawals - CryptoPotato",
        "content": "Market-leading liquid staking platform Lido has enabled staked ETH withdrawals. The move came as Lido launched the V2 upgrade live to mainnet on May 15.\n\nThe upgrade is the largest yet for the protocol, and it has two major components:\n\n“Lido V2 introduces two major components, with the most user-facing aspect being Ethereum withdrawals. This allows Ethereum stakers with Lido to directly unstake ETH through the protocol.”\n\nLido now has a withdrawals page where users can deposit their stETH tokens to get ETH in return.\n\nFollowing a successful on-chain vote, Lido V2 is officially here.https://t.co/36EmuagToD 🏝️ pic.twitter.com/sl4kjNpUYw — Lido (@LidoFinance) May 15, 2023\n\nLido Staking Withdrawals Live\n\nLido noted that under normal circumstances, the stETH or wstETH withdrawal period can take anywhere between 1-5 days. Furthermore, the stETH injected back into the protocol will be burnt in order to release the ETH at a 1:1 ratio.\n\nThe announcement added that the upgrade lowers a number of previous inconveniences surrounding Lido on Ethereum staking experience. Additionally, it “allows for a more efficient use of Lido’s staked ETH throughout the Ethereum DeFi ecosystem.”\n\nThe token unlocks dashboard is projecting a spike in withdrawals on May 16. It reports 45,830 ETH currently in the pending withdrawal queue, which is likely to grow once Lido stakers start withdrawing.\n\nIt estimates that almost 7,000 ETH worth around $12.6 million will be withdrawn over the next eleven hours.\n\nNansen’s dashboard is still reporting that there are more deposits than withdrawals on the Beacon Chain. It also claims a total of 20 million ETH are staked though this is likely to be on the high side since the Beaconcha.in explorer claims 18.3 million.\n\n6,274,752 ETH is staked with @LidoFinance. That’s over 29% of total deposits! And later today, Lido will enable ETH withdrawals for the very first time What will happen? Nobody knows, but you can track it here with our dashboard: https://t.co/DFbiirSdxmhttps://t.co/1EvVjbDznm — Nansen 🧭 (@nansen_ai) May 15, 2023\n\nV2 also includes an upgrade called a staking router. This new modular component allows for the development of on-ramps for new Node Operators. It promotes staking diversity by allowing solo stakers, DAOs, and Distributed Validator Technology (DVT) clusters.\n\nETH Price Reaction\n\nEthereum prices are marginally down on the day, trading at $1,812 at the time of writing. ETH has retreated 13% over the past month as crypto markets continue to correct.\n\nLido has 29% of all staked Ether, so withdrawals may add some selling pressure to markets in the short term.\n\nIts native LDO token has gained 7.2% on the day, climbing to $2.09 at the time of writing. Furthermore, Lido DAO tokens are up 15% over the past week."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZGVjcnlwdC5jby8xNDAzNzcvY29pbmJhc2UtZXRoZXJldW0tZXRoLXN0YWtpbmctcmV3YXJkcy1wYXVzZWQtc3VzcGVuZGVk0gFWaHR0cHM6Ly9kZWNyeXB0LmNvLzE0MDM3Ny9jb2luYmFzZS1ldGhlcmV1bS1ldGgtc3Rha2luZy1yZXdhcmRzLXBhdXNlZC1zdXNwZW5kZWQ_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 May 2023 07:00:00 GMT",
        "title": "Coinbase Pauses Ethereum Staking Reward Withdrawals for Up to Three Days - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCoinbase – the largest cryptocurrency exchange in the United States – temporarily paused payouts of ETH staking rewards on Tuesday, citing a “minor technical issue.”\n\nWhile the exchange promised that user rewards are “still being earned and will be paid out,” the company said the issue might take up to three days to fully resolve.\n\nWe’ve temporarily paused ETH staking reward payouts to address a minor technical issue. Rest assured, ETH staking is not impacted and rewards are still being earned and will be paid out. We anticipate to resolve this issue in the next 72 hours. https://t.co/2Cn8K6ZZ1i — Coinbase Support (@CoinbaseSupport) May 16, 2023\n\nAD\n\nAD\n\n“This minor technical issue has been identified and our teams are working to implement a fix,” Coinbase told Decrypt via email. “We indicate a 48-72 hour resolution estimate.”\n\nCoinbase’s staking service lets users deposit ETH and other proof of stake cryptocurrencies with their platform, where they can then be put to work securing their respective blockchains, and earning more crypto as a reward.\n\nCoinbase’s product provides a more accessible path for most people to start staking ETH, since it doesn’t require a minimum deposit of 32 ETH ($58,300) to participate as direct, individual staking does.\n\nStaking services in the United States have been under fire from the Securities and Exchange Commission (SEC) this year, however, for allegedly violating securities laws. The agency fined Kraken $30 million in February for failing to register its own staking service, and forced it to shut down before ETH staking withdrawals were even enabled.\n\nWhile Coinbase hasn’t been officially charged yet, the company received a Wells Notice from the SEC in March warning of possible securities violations. Coinbase said it believed the commission was likely taking issue with multiple Coinbase products, including its staking service.\n\nAD\n\nAD\n\nCoinbase argued that staking does not constitute a securities offering, and has signaled a willingness to fight the SEC in court on the issue if necessary. It later asked a court to force the SEC to clarify rules surrounding crypto assets, a request that the agency requested to have struck down on Tuesday.\n\nCoinbase clarified with Decrypt that its suspension of ETH staking on Tuesday “has no relation whatsoever to any regulatory or legal issues.” When asked, the exchange would not disclose the nature of the technical issue nor why it would take 48-72 hours to fix.\n\n\n\n“We'll share an update as soon as this issue is resolved,” said the company."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2V4LWV0aGVyZXVtLWRldmVsb3Blci1jYWxscy1vcGVuLWFpLWZvdW5kZXJzLXdvcmxkY29pbi1wcm9qZWN0LXVucmVhbGlzdGljLWFuZC1zY2FyeS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 May 2023 07:00:00 GMT",
        "title": "Ex-Ethereum developer calls OpenAI founder's Worldcoin project 'unrealistic and scary' - CryptoSlate",
        "content": "Piggybacking off the success of OpenAI’s ChatGPT, its founder Sam Altman is reportedly close to snagging $100 million in funding for his crypto project Worldcoin. The project had already raised $100 million at a valuation of $3 billion last year from marquee investors including Andreessen Horowitz and the venture capital arm of Coinbase.\n\nBut former Ethereum core developer Hudson Jameson — who currently works with Polygon Labs — thinks that Worldcoin’s plans are “unrealistic and scary.”\n\nThe crypto project uses a device called an orb that scans the irises of individuals to determine if they are human. People who participate and sign up by scanning their irises are rewarded with Worldcoin. The idea is to use iris-scanning technology to create a global ID system that will provide access to its global currency, Worldcoin.\n\nJameson said he is uncertain about the rollout of Worldcoin since the project ambitiously plans to onboard tens of millions of users by 2025. Jameson also raised concerns about the transparency of the project.\n\nIn a Twitter thread, he noted:\n\n“Last I checked, I’ve seen 0 indications they have publicly accessible plans to deal with the huge socio-economic issues that are going to vary region to region. There also isn’t a working group where they are inviting experts on this. If there is, there is 0 advertising of it.”\n\nJameson went on to question the tokenomics of the project, calling it “suspicious.” As per Jameson, 80% of the Worldcoin supply is meant for the public while the investors and the team will each own 10% of the supply. He added:\n\n“How is that going to create a fair worldwide currency? Is there any analysis from them on preventing wealth gaps in certain areas?”\n\nAdditionally, Jameson said that the project is trying to solve a global problem “while being ignorant of the factors to solving that problem besides building cool tech.” On a grim note, he concluded that he does not foresee success for Worldcoin.\n\nA research engineer at Worldcoin, however, said that the project’s token distribution is “pretty good” compared to other popular tokens.\n\nJameson is far from being the only one questioning the future of Worldcoin. Ethereum core developer Tim Beiko also expressed his doubts, saying “cheap + open access FaceID” could potentially make Worldcoin “obsolete.”\n\nMentioned in this article"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA1LzE2L29wdGltaXNtLXNjYWxpbmctc29sdXRpb24tZm9yLWV0aGVyZXVtLXNldHMtanVuZS1kYXRlLWZvci1iaWdnZXN0LWV2ZXItdXBncmFkZS1iZWRyb2NrL9IBhAFodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA1LzE2L29wdGltaXNtLXNjYWxpbmctc29sdXRpb24tZm9yLWV0aGVyZXVtLXNldHMtanVuZS1kYXRlLWZvci1iaWdnZXN0LWV2ZXItdXBncmFkZS1iZWRyb2NrL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 May 2023 07:00:00 GMT",
        "title": "Optimism, Scaling Solution for Ethereum, Sets June Date for Biggest Ever Upgrade, ‘Bedrock’ - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbWFnYXppbmUvb3JkaW5hbHMtdHVybmVkLWJpdGNvaW4taW50by1hLXdvcnNlLXZlcnNpb24tb2YtZXRoZXJldW0tY2FuLXdlLWZpeC1pdC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 May 2023 07:00:00 GMT",
        "title": "Ordinals turned Bitcoin into a worse version of Ethereum: Can we fix it? - Cointelegraph",
        "content": "The launch of BRC-20 tokens and Ordinals NFTs on Bitcoin has transformed the No. 1 blockchain overnight into a clunkier version of Ethereum.\n\nThe core developers and miners who signed off on the network’s Taproot upgrade in November 2021 never envisaged this would be the result. Bitcoin now suffers from many of the same problems that have bedeviled Ethereum for years, including scammy memecoins and shitcoins, NFTs of monkey pictures hogging block space and skyrocketing transaction fees.\n\n\n\nThe network is even having to deal with incidences of miner extractable value (MEV), whereby miners profit by reordering pending transactions.\n\nMati Greenspan\n\n“I’m kind of upset at myself for not realizing,” says Quantum Economics founder Mati Greenspan, a Bitcoiner since 2013.\n\n“It took these guys starting to hype up JPEGs on Bitcoin until I was like: ‘Oh shit, what did we just do?’” He laughs ruefully.\n\nSome Bitcoiners on Bitcointalk and Twitter refer to the impact of Ordinal NFTs and BRC-20 tokens as an attack on Bitcoin, an exploit of Taproot, or simply as spam clogging up the network.\n\n\n\nIt’s sparked a fierce debate over whether unexpected outcomes are precisely the sort of outcomes you should expect from a permissionless protocol, or whether something needs to be done to get rid of them.\n\n\n\nWhy are Bitcoin fees so high?\n\nBRC-20 tokens were only launched by anonymous developer Domo back on March 8. They use Ordinal inscriptions of JavaScript Object Notation (JSON) data to deploy token contracts, mint tokens and transfer tokens. Some argue this is horribly inefficient and costs four times as much in transaction fees as if they just used binary.\n\n\n\nAlongside the inefficiencies, there’s also a gold rush for minting memecoins. Someone will deploy a contract with a ticker for a new token and a max supply, and then traders rush in to mint as many as possible in the series, on a “first come, first served” basis, at whatever fee rate gets them priority. These tokens have already surpassed $1 billion in market cap — even though Domo argues they will be worthless.\n\n\n\nBut they are here to stay — at least in the short term — with major wallets already adding support for BRC-20 tokens. And newer developments, such as the launch of a Uniswap fork that amassed $500,000 in trading of “smart BRC-20” tokens (SBRC-20) in just a few days, suggest that the building of a permissionless new ecosystem on Bitcoin is set to continue.\n\nFees too high to bank the unbanked\n\nGreenspan points out that while the flurry of interest has seen Bitcoin transactions hit an all-time high, the number of unique addresses plummeted, meaning fewer people are accessing the network. And while transaction fee revenue has overtaken the block reward — seen by many as the only way to ensure Bitcoin’s security after another couple of halvings — it comes with a lot of issues.\n\n“I spoke to one miner yesterday who said his revenue has doubled, which is nice, especially ahead of the halving, so it’s good for miners, but it’s terrible for the countries of Nigeria and El Salvador, for example, where, suddenly, the average cost to send a transaction is $30,” he says. “The dream of financial inclusion on Bitcoin has been temporarily postponed.”\n\nRead also: What it’s actually like to use Bitcoin in El Salvador\n\nInterestingly, this isn’t the first time someone has put a token or NFTs onto Bitcoin. Counterparty led the way with NFTs on Bitcoin, with Spells of Genesis and Rare Pepes in 2015 and 2016. And stablecoin Tether also launched a token on Bitcoin back in 2014 via the Mastercoin protocol (which later became Omni).\n\nJoseph Hall tries using Bitcoin to get by in El Salvador for Magazine.\n\nBan the spam, say Bitcoin maxis\n\nOn Bitcointalk, there is much discussion of fighting off the “attack on Bitcoin,” with some claiming it’s the work of malicious Bitcoin SV devs. Users are talking about a soft fork to “enforce strict Taproot validation script size,” ways the protocol can filter out what they see as “spam” or even a hard fork to reverse Taproot.\n\nBitcoin developer Luke Dashjr stated that “action should have been taken months ago. Spam filtration has been a standard part of Bitcoin Core since Day 1. It’s a mistake that the existing filters weren’t extended to Taproot transactions […] since this is a bugfix, it doesn’t really even need to wait for a major release.”\n\nIf Ethereum devs ever did anything remotely close to the below email, there would be absolute hysterics. People say ETH devs are too centralized with too much power. Look in the mirror. https://t.co/yBVNk2kixW — Hal Press (@NorthRockLP) May 9, 2023\n\nGlassnode’s lead on-chain analyst, Checkmate, tells Magazine that he believes this sort of censorship is against the entire ethos of Bitcoin and notes there are already optional mempool rules enabling node operators to filter ordinals if they choose.\n\nCheckmate’s Twitter profile pic.\n\n“From my view, any attempt to ban or censor these transactions is far more of an attack on Bitcoin than leaving them be. They are within consensus rules, and when a loud minority of individuals want to change the rules to stop something they don’t like, that is the real attack.”\n\nBut podcaster Chris Blec made the case on Twitter that limiting transaction types to ensure the health of the network wasn’t censorship.\n\n“If it doesn’t depend on the content of the message or the sender of the message, then it’s not censorship,” he said.\n\nHass McCook, a former member of the Bitcoin Mining Council and a Bitcoin true believer, is no fan of Ordinals but thinks trying to get rid of them is a step too far, saying:\n\n\n\n“The only thing more important than Bitcoin is freedom. My general take is I personally don’t like it and don’t see value in it. But I don’t want to censor it. I think that could go down a very dark path.”\n\n“If the protocol allows for something and somebody is happy to pay to do that thing, then it is what it is.”\n\nI haven't heard one coherent argument yet as to how limiting spam on Bitcoin (including that which enables ordinals) equates to \"censorship\".\n\n\n\nIf there is one, please provide it here. — Chris Blec (@ChrisBlec) May 9, 2023\n\nImpossible to ban Ordinals anyway\n\nAndrew Poelstra, director of research for Blockstream, is one of the inventors of Taproot. He doesn’t like the upgrade’s “toxic” offspring either but doesn’t see any practical way to stop them.\n\n“As near as I can tell, there is no sensible way to prevent people from storing arbitrary data in witnesses without incentivizing even worse behavior and/or breaking legitimate use cases,” he wrote.\n\nRead also: Is Bitcoin a religion? If not, it soon could be\n\n“It’s not going to be possible just to ban ‘useless data,’” he said, noting that people could just hide useless data like NFTs inside of useful data like “dummy signatures or public keys.”\n\n\n\n“Doing so would incur a 2x cost to them, but if 2x is enough to incentivize storage, then there’s no need to have this discussion because they will be forced to stop due to fee market competition anyway.”\n\nBitcoin transaction fees are back down to $5. I'm so glad that Ordinals fad is finally over. pic.twitter.com/8gl4kwcXTC — Mati Greenspan (@MatiGreenspan) May 14, 2023\n\nIgnore them, and they’ll go away\n\nThe best-case scenario — and the most likely, according to interviewees for this piece — is that interest in the tokens and NFTs will die down as the memecoin fad plays out.\n\n“Network congestion on Bitcoin is not a new thing, right?” says Greenspan. “It usually comes with hype. But also it leaves when the hype is over.”\n\n“What’s most likely to happen is people are gonna run out of money.”\n\nBut if Ordinals continue to have an outsized impact on the network, there’s always the nuclear option of forking Bitcoin to modify or remove Taproot. Blec and many others have raised the possibility, though it seems mostly hypothetical at this stage.\n\nIf enough Bitcoin ecosystem participants (users, node operators, miners) reach a consensus that Bitcoin should be forked in a way that reduces spammy txs, that's not censorship.\n\n\n\nYou can still mine & use the current fork and mint your dumb jpgs there. — Chris Blec (@ChrisBlec) May 9, 2023\n\nFork Bitcoin to get rid of Ordinals\n\nGreenspan says, while it’s always possible to implement a hard fork, “it’ll split the network. And nobody wants that.”\n\nMcCook says the market chose Bitcoin, rather than Bitcoin Cash or Bitcoin SV during the scaling wars in 2017, and he predicts the current version would win over a fork with Taproot.\n\n“I’d take the Ordinals one. So, even though I don’t find any value in Ordinals, maybe I need to inscribe something in the future that I need to have absolute censorship resistance,” he says.\n\n“This could potentially have pretty powerful implications. Let’s say Julian Assange decided to do his WikiLeaks info dump as an inscription, this is a very useful thing.”\n\nGreenspan also believes the benefits of using Bitcoin to store data have only just begun to be explored.\n\n\n\n“People are now aware that Bitcoin has the ability to store files. And I’m excited to see what, you know, forward-thinking developers will do with this new tool. More than just creating memes.”\n\nMake the tokens better\n\nWhen he released BRC-20, Domo added, “I believe there are almost certainly better design choices and optimization improvements to be made.”\n\nPlenty of people agree. One of the easiest improvements would be to use binary rather than the JSON format, which developer John W. Ratcliff argues is “one of the most inefficient data formats anyone could use.” He believes this would reduce BRC-20 tokens from 89 bytes to 19.\n\n\n\n“This means that they are paying over four times as much in fees to commit these BRC-20 tokens than necessary,” he said.\n\nHashrate Index researcher Colin Harper says that using binary code “could reduce bandwidth by as much as 80%.” However, this wouldn’t entirely solve the problem, as Bitcoin influencer Udi Wertheimer points out, given the spike in fees is due to token minting degens bidding up fees to get their transaction prioritized into order to mint or snatch up low serial number tokens before the supply runs out.\n\nThere’s also another way to issue assets on Bitcoin called Taro, which Domo says is “a better solution. Taproot Asset Representation Overlay is a proposed protocol that will allow people to issue digital assets on Bitcoin that can be transferred to Lightning for fast and cheap transactions.\n\n\n\nRead also: Attack of the zkEVMs! Crypto’s 10x moment\n\nBuild a virtual machine on top of Bitcoin\n\nA much more radical and experimental approach is being taken by Trustless Computer, which is behind a Uniswap v2 fork called Trustless Market that enabled $500,000 worth of swaps in its first three days.\n\nThe project’s documentation states it’s working toward a Turing-complete virtual machine called BVM built on top of Bitcoin to enable a DeFi ecosystem.\n\n\n\nCore team member @punk3700 tells Magazine it “is not a layer 2, it’s a ‘protocol within layer 1’” that works like Ordinals but uses SBRC-20s.\n\n\n\nInstead of writing “text files to Bitcoin, Trustless Computer writes smart contract transactions to Bitcoin. Raw files vs. programs/logic/apps.” He claims this cuts down the bandwidth required for the tokens by 80%–90%.\n\nStick-figuring out how a Bitcoin Virtual Machine would work.\n\n“I think the BRC-20 in their current form (using text files) are a flash in the pan,” he says. “You can’t use paper and pen to build an alternative scalable financial instrument.”\n\n“Our SBRC-20 implementation is different. We use smart contracts, the same ERC-20 smart contract on Ethereum. It works exactly as programmed.”\n\n\n\n“Ordinals is v0.1 of what is possible on Bitcoin. Trustless Computer shows that you can build a full DApp ecosystem on Bitcoin.”\n\nHe expects that we’ll see MakerDAO, Aave, Compound and other smart contracts deployed soon, which, if it works as he claims it will, would be a huge change for Bitcoin.\n\n\n\nWhile the project has recieved coverage in other major crypto news outlets, Magazine hasn’t verified their tech works as promised, and the extent to which you can integrate smart contracts with Bitcoin is debatable, so tread carefully.\n\nCan we scale Bitcoin with ZK-rollups?\n\nThe influx of NFTs and token minting on Bitcoin has shown the blockchain remains unable to scale to deal with increased demand, meaning the more popular it gets, the worse it works.\n\n\n\nThe Lightning Network is usually touted as the solution, but Nostr creator Fiatjaf noted it has been unable to cope with the recent fee spike. “Channels are too fragile, it costs a lot to open a channel under a high fee environment, to run a routing node and so on,” he wrote, stating that users instead had to rely on the centralized Lightning providers.\n\nGreenspan believes that gradual progress toward scaling is the only safe solution to ensure Bitcoin remains bulletproof.\n\n“We’ve seen Segway; we’ve seen Taproot. I mean, these are, these are good progressions and steady scaling. Which is what’s best usually for a decentralized network of this size. You don’t want to rush things because you might break them. As we’ve seen.”\n\n\n\nRead Also: Reformed ‘altcoin slayer’ Eric Wall on shitposting and scaling Ethereum\n\n\n\nVarious parties, including StarkWare and blockchain researcher Eric Wall, have been investigating scaling Bitcoin using zero-knowledge (ZK) rollups, which is Ethereum’s plan to solve its very similar challenges.\n\n\n\nBut ironically, while the surge in demand caused by Ordinals has shown that further scaling is required, it’s also made it much less likely the community would agree to a new hard fork to enable ZK-rollups. After all, they voted for Taproot and look what happened?\n\n“I doubt that will ever happen,” says Checkmate.\n\n\n\n“I am also skeptical of even a soft fork since the unintended consequences of the witness discount have woken everyone up to the risks of change.”"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZGVjcnlwdC5jby8xNDA0MjQvY3J5cHRvLWxlbmRlci1jb21wb3VuZC1kZXBsb3lzLWV0aGVyZXVtLWxheWVyLTItYXJiaXRydW3SAVhodHRwczovL2RlY3J5cHQuY28vMTQwNDI0L2NyeXB0by1sZW5kZXItY29tcG91bmQtZGVwbG95cy1ldGhlcmV1bS1sYXllci0yLWFyYml0cnVtP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Crypto Lender Compound Deploys on Ethereum Layer-2 Arbitrum - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIt’s getting cheaper to lend and borrow your idle cryptocurrencies.\n\nCompound Finance has announced that it’s deploying its latest iteration on the popular scaling solution Arbitrum.\n\nOne of the original decentralized finance (DeFi) products, Compound lets users lend and borrow various cryptocurrencies. The platform was also one of the first to experiment with so-called yield farming, distributing its native COMP token to the platform’s users back in 2020. The token currently trades at $34.7 at press time.\n\nAD\n\nAD\n\nArbitrum is the industry’s largest layer-2 scaling solution by total value locked (TVL), per data from L2 Beat. TVL refers to how much money is sloshing around in a given project or chain.\n\nCompared to other popular Ethereum scalers, like Optimism or zkSync, Arbitrum takes the cake at a whopping $5.8 billion.\n\nCompound III is live on @arbitrum! You can now use ARB, GMX, WETH, and WBTC as collateral to borrow USDC on Arbitrum. To view the new market, select Arbitrum from the market selector in the Compound interface or click the link below: https://t.co/uzVunF4qBT pic.twitter.com/DuBUqzpHWl — Compound Labs (@compoundfinance) May 16, 2023\n\nCompound’s deployment on Arbitrum is limited to just a few cryptocurrencies, such as Ethereum (ETH), Arbitrum, Wrapped Bitcoin (WBTC), and GMX (the token powering the eponymously-named decentralized exchange).\n\nThat’s because the project’s latest iteration, called V3, is optimized to manage risk by reducing the amount of long-tail crypto assets that can be lent and borrowed.\n\nAD\n\nAD\n\nEthereum layer-2 wars heat up\n\nThis year has turned into something of a layer-2 season with the launch of various governance tokens, and the first instance of zero knowledge-powered rollup solutions entering the scene.\n\nCompared to “optimistic” rollup solutions, like those on offer from Arbitrum and Optimism, zk-rollups leverage a much more complex bit of cryptography. Members of this market niche include Starknet, Polygon’s zkEVM, and zkSync. The collective TVL for just those three projects is $320 million.\n\nBoth solutions leverage rollups, which batch transactions off of the Ethereum mainnet (hence the term layer-2) and then convert those batched transactions into a small piece of data.\n\nThis smaller piece of data, called a proof, is what Ethereum ultimately validates. In this way, the mainnet remains relatively uncongested, keeping gas prices on the network low."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA1LzE2L3RvcC10cmFkZXItcHJlZGljdHMtcmFsbGllcy1mb3ItZXRoZXJldW0tYW5kLWJyb2FkZXItYWx0Y29pbi1tYXJrZXRzLWJ1dC10aGVyZXMtYS1jYXRjaC_SAX1odHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNS8xNi90b3AtdHJhZGVyLXByZWRpY3RzLXJhbGxpZXMtZm9yLWV0aGVyZXVtLWFuZC1icm9hZGVyLWFsdGNvaW4tbWFya2V0cy1idXQtdGhlcmVzLWEtY2F0Y2gvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 May 2023 07:00:00 GMT",
        "title": "Top Trader Predicts Rallies for Ethereum and Broader Altcoin Markets – But There’s a Catch - The Daily Hodl",
        "content": "A closely followed crypto strategist is predicting a burst to the upside for Ethereum (ETH) and the altcoin markets in general.\n\nPseudonymous analyst Credible tells his 340,600 Twitter followers that he believes Ethereum is gearing up for a strong rally.\n\nAlthough Credible is currently bullish on ETH, he says that the top altcoin will likely witness a significant retracement after hitting his target.\n\nAccording to Credible, his view on Ethereum reflects his outlook on the broader altcoin markets.\n\n“Since my last tweet, we did see some relief on ETH but fell short a bit from my upside target.\n\nLots of alts testing key support levels, so I think the ETH chart is a good representation of what I expect on other alts in general over the coming days – some relief to the upside followed by another leg lower as BTC continues to slowly but surely drain liquidity out of alts in preparation for the next leg up on it’s road to new all-time highs this year.”\n\nLooking at the trader’s chart, he appears to predict an Ethereum surge to above $2,000 before it corrects all the way down to around $1,500.\n\nAt time of writing, ETH is trading for $1,809.\n\nAs for Bitcoin (BTC), Credible still holds the contrarian view that the crypto king will likely print fresh all-time highs this year.\n\n“There’s a gap at $20,000 that a lot have been eyeing up and using as justification for a deeper pullback from current levels.\n\nIf I’m right about my thesis for new all-time highs in 2023 – that gap should go unfilled.\n\nIf you were to ask me which comes first – $20,000 or $70,000+, I’d say $70,000+.”\n\nAt time of writing, Bitcoin is trading for $26,944.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMTcvZXRoZXJldW0tc3Rha2luZy1uZWVkcy1pdHMtaG9uZXN0LWxpYm9yL9IBWGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMTcvZXRoZXJldW0tc3Rha2luZy1uZWVkcy1pdHMtaG9uZXN0LWxpYm9yL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Ethereum Staking Needs Its (Honest) LIBOR - CoinDesk",
        "content": "A new staking rate could unlock the next generation of financial products while serving as a building block of Ethereum’s monetary policy. As such, CESR represents an important development in the evolution of the Ethereum ecosystem and a new frontier for innovation in the world of decentralized finance and beyond."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy8zLXJlYXNvbnMtd2h5LWxpZG8tZGFvLXByaWNlLWp1bXBlZC00MC1pbi1hLXdlZWstb3V0cGVyZm9ybWluZy1iaXRjb2luLWV0aGVyZXVt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 May 2023 07:00:00 GMT",
        "title": "3 reasons why Lido DAO price jumped 40% in a week — Outperforming Bitcoin, Ethereum - Cointelegraph",
        "content": "The price of Lido DAO (LDO) has rebounded to its three-week high of $2.21 as of May 16, up 40% when measured from its local low of $1.57, established four days ago.\n\nThis impressive double-digit recovery appeared in tandem with other top-ranking crypto assets, including Bitcoin (BTC) and Ether (ETH). However, LDO has greatly outperformed the broader crypto market (TOTAL), which is up only 4.5% since May 12.\n\nLDO/USD daily price returns vs. BTC/USD, ETH/USD and TOTAL. Source: TradingView\n\nBut what are the reasons why Lido DAO is outperforming the rest of the cryptocurrency market right now? Let’s take a closer look at the three biggest factors likely driving up LDO’s price.\n\nEther depositors’ return after Shapella\n\nThe LDO price recovery coincides with the net positive inflows into Ethereum’s proof-of-stake (PoS) contract in recent days.\n\nLido DAO is primarily an Ethereum liquid staking platform. It enables users to pool their funds to become validators on Ethereum, thus bypassing the network’s requirement of depositing at least 32 ETH.\n\nIn April, Ethereum underwent a network upgrade called Shapella, which supports reward withdrawals from its staking contract. As a result, its PoS contract witnessed days when the amount of ETH withdrawals outnumbered deposits.\n\nFor instance, the net ETH staked with its PoS contract was 19.27 million ETH on April 11, a day before the Shapella upgrade. The number fell to 90,704 a week later, followed by a consistent recovery, according to data tracked by Nansen.\n\nEther deposits and withdrawals into/from its PoS contract. Source: Nansen\n\nAs of May 16, the Ethereum PoS contract had over 20 million ETH, underscoring the growing demand for liquid staking service providers like Lido DAO. The price of its governance token, LDO, likely benefited from the narrative.\n\nFor instance, Lido DAO’s nearest competitor, RocketPool (RPL), has also soared 15% to around $50 when measured from its May 12 low.\n\nLido v2 mainnet launch\n\nIt should be noted that Lido DAO did not support full ETH withdrawals. Instead, it issued staked Ether (stETH), theoretically pegged to ETH by 1:1, to users that could be exchanged freely for other crypto assets across exchanges.\n\nBut that was until recently.\n\nOn May 15, Lido DAO launched the mainnet version of “Lido v2,” which enables Ether stakers to burn their stETH and exit the protocol at a 1:1 ratio. Since the upgrade, LDO’s price has climbed 20%, or half of its 40% rebound thus far.\n\nRelated: Celsius moves $781M in stETH just as Lido withdrawals open\n\nLido DAO whales have also supported LDO’s upside move in the days leading up to the Lido v2 launch. And, according to data resource Lookonchain, this may suggest that the “buy the rumor” scenario may have contributed to the LDO price rally.\n\nDue to the launch of Lido V2, we noticed 3 whales accumulating $LDO in the past week.\n\n\n\n- 0x9EA7 withdrew 724,822 $LDO($1.52M) from #Binance at $2.01.\n\n\n\n- 0x4E4e withdrew 655,641 $LDO($1.38M) from #Binance at $1.83.\n\n\n\n- 0x9eda bought 570,883 $LDO with 974K $USDC at $1.71 on May 12. pic.twitter.com/S0cNUxpLw0 — Lookonchain (@lookonchain) May 16, 2023\n\nLDO’s price rising wedge bounce\n\nFrom a technical standpoint, LDO’s 40% bounce started near the lower trendline of a prevailing falling wedge setup. Traditional analysts see a falling wedge as a bullish reversal pattern.\n\nLido DAO daily price chart. Source: TradingView\n\nThe LDO/USD pair has recovered similarly in recent history, with each rebound taking its price to the wedge’s upper trendline. Now with the price treading around the upper trendline again, LDO could enter a breakout stage or pull back to retest the lower trendline.\n\nLDO’s breakout scenario will have the price rally toward $3.35 by June 2023, up around 50% from current price levels. This target appears after adding the maximum wedge height to the potential breakout point near $2.70.\n\nConversely, the pullback scenario could bring the LDO price near $1.56 by June 2023, down 30% from current price levels. This level has served as support and resistance in the past.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA1LzE2L2JpdGNvaW4tZXRoZXItY29ycmVsYXRpb24td2Vha2Vucy10by1sb3dlc3Qtc2luY2UtMjAyMS1oaW50cy1hdC1yZWdpbWUtY2hhbmdlLWluLWNyeXB0by1tYXJrZXQv0gGPAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMTYvYml0Y29pbi1ldGhlci1jb3JyZWxhdGlvbi13ZWFrZW5zLXRvLWxvd2VzdC1zaW5jZS0yMDIxLWhpbnRzLWF0LXJlZ2ltZS1jaGFuZ2UtaW4tY3J5cHRvLW1hcmtldC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 May 2023 07:00:00 GMT",
        "title": "Bitcoin-Ether Correlation Weakest Since 2021, Hints at Regime Change in Crypto Market - CoinDesk",
        "content": "\"Post the transition to a proof-of-stake governance mechanism, it is possible that Ether is seen as a different asset class in the same sphere and this might change but for the time being, Bitcoin is more governed by macroeconomic factors and institutional investment while Ethereum although affected, might just be less correlated to the macroeconomic conditions for the better or worse,\" analysts at Bitfinex said in an email."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50LzI5MzMzYmQ1LTdiNjktNDg4Ny1hMWQ4LTA1NzE4ZjYxOGY4MNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 May 2023 07:00:00 GMT",
        "title": "Fund groups race to launch first US ether futures ETF - Financial Times",
        "content": "Print this page\n\nSimply sign up to the Exchange traded funds myFT Digest -- delivered directly to your inbox.\n\nLatest news on ETFs Visit our ETF Hub to find out more and to explore our in-depth data and comparison tools\n\nFive ETF issuers filed to launch ether futures ETFs last week, in what could become a “winner-take-most” scenario, analysts say.\n\nGrayscale was the first issuer to act, filing on May 9 to launch the Grayscale Ethereum Futures ETF, based on the world’s second-largest cryptocurrency, behind bitcoin.\n\nDirexion, Roundhill Investments and Bitwise followed on May 10 with their own versions, filings show, while Valkyrie lodged an application on May 12.\n\nThe Securities and Exchange Commission has not yet approved any ether futures ETFs. At least one firm — Kelly Strategic Management — filed for an ETF that would have invested in ether futures. Soon after, however, the firm withdrew its application.\n\nThe SEC, however, has given the green light to ETFs that invest in bitcoin futures. The now-$928mn ProShares Bitcoin Strategy ETF (BITO) was the first to launch in October 2021.\n\nThis article was previously published by Ignites, a title owned by the FT Group.\n\nThe SEC has rejected bids for physical bitcoin ETFs due to the potential for fraud and manipulation. SEC chair Gary Gensler has called bitcoin a “Wild West” market that leaves investors less protected than stock and bond markets.\n\nIf approved by the SEC, the five ETFs will invest primarily in ether futures traded on the Chicago Mercantile Exchange, the filings show.\n\nEther is the native cryptocurrency of the ethereum network, a “decentralised network of computers that operates on cryptographic protocols”, Grayscale’s filing notes. The funds will not invest directly in ether or any digital assets.\n\nThe five ETFs’ investment strategies are largely the same, prospectuses show. They will invest in wholly owned subsidiaries organised under the laws of the Cayman Islands.\n\nRepresentatives from the issuers did not respond to requests for comment.\n\n“No news is good news for bitcoin futures ETFs, and it’s a good sign for the prospect of futures-based ether ETFs, as well,” said Bryan Armour, director of passive strategies research for North America at Morningstar. “There isn’t any evidence that bitcoin ETFs were a failed experiment for the SEC, so this may be the right time for these funds to be approved.”\n\nShortly after it launched, the ProShares Bitcoin Strategy ETF amassed $1bn in assets at a faster pace than any previously launched ETF. However, its net asset value plunged 63.7 per cent in 2022. Since its inception, market depreciation has erased $1.3bn in investor assets.\n\nOther bitcoin futures ETFs, such as ones from VanEck and Valkyrie, have struggled to keep up. The VanEck ETF has just $41mn in assets and Valkyrie’s has $30mn, respectively, according to FactSet data.\n\nThere was a “good case” for the SEC to approve the ether futures ETFs for the same reason that they approved the bitcoin futures ETFs in the first place, noted Matt Apkarian, associate director for product development at Cerulli Associates.\n\n“The fact that these are digital asset futures doesn’t really change what the SEC needs to see relative to any other futures-based exchange-traded products,” Apkarian said.\n\nGrayscale might also be calling the SEC’s bluff in regard to its statements in favour of futures-based crypto ETFs, Armour noted.\n\nIn June Grayscale sued the SEC after the regulator rejected its bid to convert its Bitcoin Trust into an ETF. The firm claimed in the lawsuit that the SEC had no grounds to reject a spot bitcoin ETF after approving futures ETFs. The suit is ongoing.\n\nLatest news on ETFs Visit the ETF Hub to find out more and to explore our in-depth data and comparison tools helping you to understand everything from performance to ESG ratings\n\nThe “rest of the pack” might just be jumping in line, in case the SEC approved these ETFs, rather than signalling increased optimism that they would be given the go-ahead, Armour said.\n\nRoundhill and Direxion do not currently offer any crypto-related products. Bitwise, meanwhile, runs a $477mn 10 Crypto Index Fund and $70mn Crypto Industry Innovators ETF (BITQ), which invests in companies that derive most of their revenue from the crypto ecosystem, not crypto directly.\n\nIn March, Bitwise launched the Bitwise Bitcoin Strategy Optimum Roll ETF (BITC), a futures ETF designed for long-term investors.\n\n“I wouldn’t be surprised to see this become somewhat of a winner-take-most scenario like we saw with BITO,” Apkarian said, referring to ProShares’ Bitcoin futures ETF. “I think the first-mover advantage is likely why we are seeing so many firms trying to launch so quickly right now.”\n\n*Ignites is a news service published by FT Specialist for professionals working in the asset management industry. Trials and subscriptions are available at ignites.com."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvbWFya2V0cy9ldGhlcmV1bS1nYXMtZmVlcy1kcm9wLWFzLW1lbWVjb2luLWZyZW56eS1zdWJzaWRlcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 May 2023 07:00:00 GMT",
        "title": "Ethereum gets cheaper to use as memecoin frenzy subsides: 'Is the meme narrative finished?' - DLNews",
        "content": "Ethereum’s “gas fees” were propelled by an influx of users trading memecoins including Pepe\n\nA 64% plunge in DeFi transaction costs on Ethereum offers a reprieve for traders\n\n‘The question is: Is the meme narrative finished now? or is this a small pullback?’\n\nA 64% plunge in DeFi transaction costs on Ethereum offers a reprieve for traders after a memecoin frenzy drove such fees to a more than one-year high.\n\nSince late April, Ethereum’s “gas fees,” a measure of the cost of executing transactions on the network, were propelled by an influx of users trading memecoins including Pepe, a token derived from the internet meme Pepe the Frog.\n\nDuring the height of this activity, a basic Ethereum transaction — such as transferring tokens between wallets — escalated to over $20, a stark contrast from the sub-$5 fees typical for much of the past year. More complex transactions involving higher gas fees, such as token trades on decentralised exchanges, incurred even steeper costs.\n\nPepe at $1 billion\n\nBut after a period of unprecedented gains which saw Pepe surpass a $1 billion market capitalisation, the memecoin madness that defined Ethereum in recent weeks “seems to slowly be dying down,” Hildobby, a pseudonymous data analyst at crypto venture fund Dragonfly, told DL News.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\nDune data compiled by Hildobby, shows that median gas fees on Ethereum have dropped 64% from an early May peak. On May 15, the median gas fee for transactions returned to 50 gwei, down from 142 gwei on May 5.\n\nEthereum’s gas fees are typically expressed in gwei, a unit equivalent to one-billionth of an Ether.\n\nEthereum median daily gas price (Hildobby)\n\nHildobby explained that the median gas fee is a proxy for Ethereum blockspace demand and represents what users should expect to pay to get their transactions processed.\n\nLike most blockchains, Ethereum employs a dynamic fee system designed to thwart malicious actors from inundating the network with transactions, obstructing other users.\n\nJoin the community to get our latest stories and updates\n\nWhen Ethereum’s activity level rises, the network correspondingly increases the base fee — the minimum amount of gwei users must pay to initiate transactions.\n\nIf the volume of transactions remains high, gas fees continue to escalate. However, a decrease in demand for transaction submission triggers a corresponding reduction in the base gas fee.\n\nNOW READ: MiCA is here. There are nine other EU crypto laws you should know about\n\nIn the context of trading memecoins like Pepe, traders must take into account the cost of submitting transactions to Ethereum. If traders can’t offset the high gas fees with profits, they’ll trade less.\n\n‘Insanely high’\n\n“Gas gets so high that most people get priced out or it no longer becomes worth it for a lot of people to do smaller transactions,” Ryan Myher, co-founder of crypto analytics platform LORE, told DL News.\n\n“The return on investment would have to be insanely high just to cover the gas.”\n\nWhile the current drop in activity on Ethereum is providing a respite from high transaction fees, not everyone is convinced the memecoin hype is over.\n\nAlex Strong, a trader at crypto trading firm Scimitar Capital, told DL News that the main reason gas costs were down was because fewer people are speculating on-chain in the past week.\n\nThis drop in activity “might be temporary,” he said, leaving open the possibility for another memecoin resurgence.\n\nTypically, during periods when investors are willing to take on risk, they tend to pile into more volatile assets like stocks or crypto. And memecoins are risky even by crypto standards.\n\nAt least one market move suggests a memecoin surge is a sign of the top:\n\nNOW READ: Aragon’s $200m activist battle ignites DAO debate: ‘Lining up soldiers doesn’t mean an attack’\n\nIn May 2021, Dogecoin, often described as the original memecoin, hit an all-time high of $0.73, while Bitcoin traded above $55,000. But a month later, the total crypto market capitalisation had dropped 36% from its highs, with Dogecoin down more than 56%.\n\n“Gas prices are dropping significantly and coming back to pre-meme craze levels, almost,” Crypto Koryo, a pseudonymous crypto trader and writer, told DL News.\n\n“The question is: Is the meme narrative finished now? or is this a small pullback?”\n\n“Let’s see how it goes this time,” he said."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMDUvMTYvZGVhdG9uLXF1ZXN0aW9ucy1kaXNtaXNzYWwtb2YtY3J5cHRvLWV4dG9ydGlvbi1jaGFyZ2VzLWFnYWluc3QtZm9ybWVyLWV0aGVyZXVtLWFkdmlzZXIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 May 2023 07:00:00 GMT",
        "title": "Deaton Questions Dismissal of Crypto Extortion Charges Against Former Ethereum Adviser - The Crypto Basic",
        "content": "Attorney Deaton asked why the government dismissed the charges against former Ethereum adviser Nerayoff despite going through the pains of securing an indictment.\n\nAttorney John E. Deaton, CryptoLaw founder, and pro-XRP lawyer, has taken to Twitter to question the reason behind the recent dismissal of criminal extortion charges against former Ethereum adviser Steven Nerayoff.\n\nIn a tweet today, attorney Deaton, who revealed himself as a former federal prosecutor, asked why prosecutors would go through the trouble of securing an indictment only to dismiss the case later.\n\n- Advertisement -\n\nDeaton also wondered what would have prompted the prosecutors to dismiss the charges against Nerayoff, especially after the defendant took an offensive approach, accusing the government of prosecutorial misconduct.\n\nSome of Nerayoff’s allegations against U.S. investigators, as cited by Deaton, include the fact that he was placed in a van and asked to provide evidence against Ethereum co-founder Vitalik Buterin, Caitlin Long, founder and CEO of Custodia Bank.\n\n“Nerayoff alleges that he pled not guilty, refused to let the Feds intimidate him, and demanded a trial. Why would the government dismiss?” Deaton quizzed.\n\nDeaton Highlights Possible Reason Behind the Dismissal\n\nNotably, Deaton suggests that the prosecutors may have dismissed the case against Nerayoff due to the validity of his claims.\n\n- Advertisement -\n\n“My experience tells me that some of his claims had teeth to them, and the Government did not want to engage in discovery. When you add his claims with Chokepoint 2.0 and the Administration’s current war on Crypto, it makes you [Think],“ he added.\n\nCourt Dismisses Case Against Nerayoff\n\nFor context, Nerayoff and one of his employees, Michael Hlady, were initially accused of extorting an unnamed crypto firm. The Seattle-based company hired Nerayoff and Hlady to provide guidance for its 2017 initial coin offering (ICO).\n\nHowever, prosecutors allege that both Nerayoff and Hlady threatened to destroy the company if it failed to pay them millions of dollars for their services. While Hlady pled guilty in August 2021, Nerayoff maintained his innocence.\n\nAccording to reports, U.S. District Judge Margo Brodie dismissed the charges against Nerayoff on May 5, ending a three-and-a-half-year legal battle between the former Ethereum adviser and federal prosecutors.\n\nThe lawsuit was struck out six weeks after prosecutors requested to drop the case due to their inability to prove the charges against Nerayoff."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vZGFpbHljb2luLmNvbS93aGF0LWlzLWVyYy02NTUxLWV0aGVyZXVtcy1uZXctbmZ0LXN0YW5kYXJkL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 May 2023 07:00:00 GMT",
        "title": "What Is ERC-6551? Ethereum's New NFT Standard - DailyCoin",
        "content": "Although ERC-721 introduced NFTs to the world, it still has many limitations.\n\nSo, Ethereum has released a new standard that addresses all the issues of ERC-721 .\n\n. ERC-6551 looks to usher in a new era of NFTs.\n\nThe ERC-721 standard made history by introducing NFTs to the world. Since their inception, NFTs have revolutionized industries by introducing new applications in the form of static images, breedable cats, generative artwork, tickets, and more.\n\nAs NFT adoption grows, developers uncover new use cases for NFTs. However, the standard they’re built on has limitations that could hinder NFTs from realizing their true potential. This is where Ethereum’s new standard, ERC-6551, comes into play.\n\nERC-6551 is specially designed to propel every NFT on the network to become more dynamic, hence ushering in a new era.\n\nWhat is ERC-6551?\n\nERC-6551 is Ethereum’s new standard for NFTs that aims to make them more dynamic and interactive. It gives ERC-721 NFTs the full capabilities of an Ethereum account using token-bound accounts (TBA).\n\nThe new standard allows standard NFTs to go beyond static assets and assume enhanced functionality and interactivity. It deploys unique smart contracts or wallets for each ERC-721 NFT and then uses a permissionless registry to record the account’s on-chain activity.\n\nERC-6551 is a new standard that allows an NFT to have its own wallet. In other words, The NFT itself acts as a wallet with its own wallet address.\n\n\n\nThese wallets are called \"Token Bound Accounts\", aka TBA.\n\n\n\nLet's illustrate this and see what are the advantages.\n\n\n\n(2/15) pic.twitter.com/0O8NM9CzcN — Zak³⚱️ (@ZakaiMill) May 15, 2023\n\nAdditionally, thanks to the ERC-4337 standard, a smart contract deployed by ERC-6551 will function like a wallet that can store assets and make transactions. Moreover, the new standard is backward-compatible with all ERC-721 tokens, meaning existing NFTs can implement the new standard without going through any hassles of wrapping assets or more.\n\nWhile ERC-721 NFTs have paved the way for mainstream adoption of NFTs and unlocked new use cases for blockchain-based assets, they’re swarming with issues such as limited provenance, lack of composability, and being too static. The new NFT standard addresses all the problems in the prior standard and brings new opportunities to the table.\n\nWhat Does ERC-6551 Bring to the Table?\n\nERC-6551 is set to change the NFT industry by allowing every NFT to be more dynamic and functional. In hindsight, the new standard could revolutionize many industries, especially web3 gaming and on-chain identification.\n\nBefore the new standard, players who owned in-game NFTs would have their assets sit separately in their wallets. With ERC-6551 and its token-bound accounts in the mix, game developers can introduce new use cases such as inventories, gear, and other mechanics requiring multiple assets to interact with each other.\n\nERC-6551 also opens up opportunities for on-chain identification in various areas, such as loyalty programs, allow-listing, reward, and credit rating. Implementing on-chain identification could enhance the reliability and security of protocols, leading to more robust systems.\n\nThe sky’s the limit for NFTs with ERC-6551, and it would be interesting to see what new diverse applications will pop up.\n\nOn The Flipside\n\nRecently, Ethereum gas prices went to levels not seen since May 2022 because of the ongoing meme coin PEPE mania. Network gas prices have been averaging at over 100 gwei.\n\nOne user paid 64 ETH in gas fees for a single transaction, equivalent to $120,000, due to recent Ethereum network congestion.\n\nWhy You Should Care\n\nEthereum’s new standard has the potential to take Web3 to another level by evolving the very nature of static NFTs to be more dynamic, composable, and interactive.\n\nCardano Developer shuts down rumors of Hydra high TPS:\n\nCardano Dev Dismisses Hydra TPS Rumors: “It Is Misleading”\n\nZeebu is bringing the telecom carrier industry to web3:\n\nZeebu to Enable Instant Global Transactions for Telecom Companies"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA1LzE3L3R5cGVzLW9mLWNyeXB0b3MtdGhhdC1jb3VsZC1vdXRwZXJmb3JtLWJpdGNvaW4v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "The 3 Types of Cryptos That Could Outperform Bitcoin This Year - The Motley Fool",
        "content": "Even with its recent pullback from the $30,000 price level, Bitcoin remains one of the top-performing cryptos of 2023. It is up 65% this year, and it's hard to find any large market-cap coins that can top this.\n\nBut savvy investors know it's best not to put all your eggs into one basket. If you are looking to diversify your crypto portfolio, here are three types of digital coins that could outperform Bitcoin this year.\n\n1. Potential Ethereum replacements\n\nWhile Ethereum (CRYPTO: ETH) continues to be the dominant Layer 1 blockchain in the crypto world, there are plenty of up-and-comers that hope to dethrone it. Three rivals that stand out are Solana, Aptos, and Fantom. Both Solana and Aptos are up more than 100% this year, and Fantom is not too far behind, at 93%.\n\nJudging from their performance, investors are not entirely convinced that Ethereum is going to retain its dominant role in so many key blockchain sectors, ranging from non-fungible tokens (NFTs) to decentralized finance (DeFi). While The Merge helped to improve the speed, efficiency, and scalability of the core Ethereum blockchain, these blockchain rivals are still much faster and cheaper. That has huge implications in areas such as DeFi, where users are looking for near-zero fees and near-instantaneous settlement of transactions.\n\nOf these Ethereum rivals, my personal pick is Solana, which has been out-innovating Ethereum of late. For example, Solana recently launched the first-ever mobile phone for a major blockchain network (the Saga) and has been exploring new initiatives to leverage all the hype and excitement around artificial intelligence, including a new plug-in for ChatGPT. For Solana to outperform Bitcoin, it will need to show that mobile crypto and crypto AI are sustainable, long-term growth catalysts.\n\n2. Scaling solutions for Ethereum\n\nIf you are looking for a less risky way to outperform Bitcoin, then blockchain scaling solutions for Ethereum could be the answer. Simply stated, these scaling solutions sit on top of the main blockchain and help Ethereum process transactions faster and cheaper.\n\nFor that reason, they are referred to as Layer 2 solutions (i.e., they are the second layer on top of the base Ethereum layer). Each scaling solution uses its own form of proprietary technology to accomplish its goals, so it can sometimes be difficult to differentiate among these different solutions.\n\nIf you buy into the idea that these Layer 2 coins are essential to the future success of Ethereum, then there are a few key prospects to target, including Immutable, Optimism, and Polygon. The name that's probably most familiar to investors will be Polygon, which has been making waves recently with new NFT initiatives, including a high-profile partnership with Nike to create an entirely new NFT marketplace for digital sneakers. However, if you are craving maximum upside potential, a better pick might be Immutable, which is up a mind-blowing 99% this year.\n\n3. Cryptos that help people stake on Ethereum\n\nLastly, there are a growing number of cryptos that help people stake on Ethereum. Now that Ethereum has transformed from a proof-of-work blockchain into proof of stake, this is tremendously important. Crypto staking is suddenly big business, and investors are always looking for ways to earn the highest staking rewards possible.\n\nThe two big names to watch here are Lido DAO, which is up 95% this year, and Rocket Pool, which is up 157% this year. Both emerged from relative obscurity after The Merge due to the popularity of staking, and both now currently rank in the Top 50 cryptos in terms of market capitalization.\n\nWhich of these is the best buy?\n\nThe common theme of all three categories of cryptos detailed above is that they somehow involve Ethereum. The first category, for example, includes all those capable of displacing Ethereum one day as the preeminent Layer 1 blockchain. The second category includes all digital currencies helping Ethereum scale bigger and faster. And the third category includes all cryptos that involve staking on Ethereum.\n\nSo if the prospect of picking winners and losers in niche areas of the blockchain space seems too daunting, the classic buy-and-hold crypto is Ethereum, which is up a not-too-shabby 52% this year.\n\nBut if you're looking for a little extra turbocharging for your portfolio, then my best picks would be Solana and Polygon. I'm long-term bullish on both of them, and I still regard both as best-in-class for their respective blockchain categories."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMimAFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMDUxNjAwNTM2Mi9lbi9Bc3ltbWV0cnktRmluYW5jZS1SYWlzZXMtM00tU2VlZC1Sb3VuZC10by1Tb2x2ZS1DZW50cmFsaXphdGlvbi1UaHJlYXQtdG8tdGhlLUV0aGVyZXVtLUVjb3N5c3RlbdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 May 2023 07:00:00 GMT",
        "title": "Asymmetry Finance Raises $3M Seed Round to Solve Centralization Threat to the Ethereum Ecosystem - Business Wire",
        "content": "NEW YORK--(BUSINESS WIRE)--Asymmetry Finance, a liquid staking tokens (LST) protocol, today announced its seed round totaling $3 million in conjunction with the official launch of its platform. The raise was led by Ecco Capital, a venture capital fund focused on frontier crypto innovation. Asymmetry Finance’s liquid staking tokens protocol is a custom-built solution to the centralization of the staked Ether market.\n\nWhile the $13.6 billion LST market continues to blossom into one of the most attractive sectors of DeFi due to its liquidity and flexibility, the LST market remains highly centralized. Currently, 88% of the LST market is staked on Lido Finance – creating a single point of failure and posing significant security vulnerabilities. The centralized custodianship of staked assets on Ethereum will only grow more concerning as more users flock to the network to stake assets following the recent Shapella upgrades.\n\nNew and veteran DeFi users, as well as institutions, are in need of a liquid staking solution that promotes decentralization, while retaining the benefits of LSTs and optimal capital efficiency. Asymmetry offers an immediate solution to the scalability and centralization challenges facing the Ethereum LST market.\n\n“Staking on Ethereum is essential for securing, scaling, and sustaining the network,” said Justin Garland, co-founder of Asymmetry Finance. “The percentage of ETH staked relative to other chains is significantly lower which we believe presents a unique opportunity to onboard users and reshape the highly centralized staking market. We want to encourage all Ethereum holders to stake and help secure the network itself while also earning yield. The challenge is incentivizing users to simultaneously contribute towards decentralization as well, rather than compounding on the centralization that we currently see in the market.”\n\n“Substantial centralization not only inherently conflicts with the core fundamentals of DeFi, but also has potential knock-on effects for the entire ecosystem,” added Hannah Hamilton, co-founder of Asymmetry Finance. “Asymmetry’s vision is not to directly challenge Lido or Rocketpool, but to advance the core tenets of decentralization on the Ethereum network, and empower DeFi users with a novel liquid staking alternative.”\n\nThe successful seed raise drew support from some of the most notable venture funds, including: Ecco Capital, Republic Capital, and GMJP. Additionally, Asymmetry received investment from one of the leading LST providers, Ankr, highlighting Asymmetry’s symbiotic relationship with all LST providers. Asymmetry Finance will use the resources to further develop its liquid staking protocol, add top talent to the team, and onboard decentralized finance (DeFi) enthusiasts and institutions to its platform.\n\n“​​Republic Capital sees the liquid staking market as one of the leading sectors in the current crypto industry and we’re thrilled to see tech providers and developers that not only seek to increase decentralization but also create an easier experience for the act of staking,” commented Graham Friedman, Head of Venture of Republic Crypto. “We see the Asymmetry team as fitting this vision by nailing both items. Blended with their experience in crypto native teams we look forward to their continued launch of products that augment and enhance the staked asset markets in order to help it thrive and grow.”\n\n“Ecco Capital views the growing staking economy as DeFi's fixed income equivalent. We have partnered with Asymmetry Finance because of their dedication to decentralizing the Ethereum liquid staking ecosystem. The team continues to ship major milestones in their roadmap, and aims to build the best tools for retail users and institutions to access highly competitive DeFi yield on one seamless platform,” said Daniel Abrahamian, CIO of Ecco Capital.\n\nCentral to the Asymmetry Finance protocol is its flagship project, Simple Asymmetry Finance Ethereum (safETH), which aims to deliver consistent yield to users in a safe and efficient manner. The core elements of safETH include:\n\nFee-Free Decentralized Asset Basket: The use of a decentralized basket of assets – with no additional user fees – directly mitigates risks such as the central point of failure, and a singular dominant custodian, at risk of possible regulation.\n\nThe use of a decentralized basket of assets – with no additional user fees – directly mitigates risks such as the central point of failure, and a singular dominant custodian, at risk of possible regulation. Simplicity and Accessibility: Lowering the point of entry to all DeFi users in an effort to ‘make DeFi more boring’.\n\nLowering the point of entry to all DeFi users in an effort to ‘make DeFi more boring’. Indexed Products: Indexed products are traditionally popular across markets due to their diversification by nature and reduced risk, particularly in the case of passive yield.\n\nTo learn more about Asymmetry Finance, please visit: asymmetry.finance. Follow Asymmetry Finance on Twitter, and stay up-to-date on Medium.\n\nAbout Asymmetry Finance\n\nAsymmetry Finance is a groundbreaking DeFi protocol designed to decentralize Ethereum by making complex strategies with market leading yield and asymmetric upside accessible to the next billion Web3 users."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9vcHRpbWlzbS1tYWlubmV0LWJlZHJvY2stdXBncmFkZS1qdW5lLTbSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 May 2023 07:00:00 GMT",
        "title": "Optimism's major 'Bedrock' upgrade set for June 6 - Cointelegraph",
        "content": "Layer 2 scaling solution Optimism is set to undergo its highly anticipated Bedrock upgrade on June 6. The move is expected to result in significantly reduced transaction fees, provide greater network security and enhanced compatibility with Ethereum.\n\nThe Optimism team stated via a May 15 Twitter thread that the network would be down for two to four hours on June 6 as the upgrade goes through.\n\n“On upgrade day, transactions, deposits, and withdrawals will be unavailable for the duration of the downtime, and the OP Mainnet chain will not be progressing,” an accompanying blog post reads.\n\nThe official date of OP Mainnet’s upgrade to Bedrock has been set: June 6, 2023 at 16:00 UTC!\n\n\n\nThe upgrade will require 2-4 hours of downtime for OP Mainnet.\n\n\n\nVisit Mission Control for full details on what to expect:https://t.co/o6UjKZaVKy — Optimism (✨_✨) (@optimismFND) May 15, 2023\n\nBedrock was announced back in May 2022, and it marks the first major network upgrade that was voted through by the Optimism governance council’s Token House.\n\nOptimism is slated to benefit from lower transaction fees, which OP Labs — the network’s protocol development unit — estimates will drop by 47%.\n\n“Bedrock improves on its predecessor by reducing transaction fees using optimized batch compression and Ethereum as a data availability layer; shortening delays of including L1 transactions in rollups by handling L1 re-orgs more gracefully,” the Optimism community’s Bedrock explainer reads.\n\nThe Bedrock upgrade will bring a 47% reduction in protocol costs and security fees to Optimism Mainnet\n\n\n\nEngineer extraordinaire @trianglesphere explains how in the latest dev blog post https://t.co/MvcG04shEB — OP Labs (@OPLabsPBC) March 2, 2023\n\nAdding to that, the network will also see shorter deposit times, with Optimism going from roughly 10 minutes to confirm a deposit to just three minutes, the explainer states.\n\nWhile node software performance will be “significantly improved by enabling execution of several transactions in a single rollup ‘block’ as opposed to the prior ‘one transaction per block’ model in the previous version.”\n\nAnother key improvement concerns the network’s compatibility with the Ethereum Virtual Machine (EVM), the core piece of software that executes Ethereum smart contracts.\n\nWith Bedrock, the network will remove “multiple deviations” from Ethereum and the EVM that are currently present with Optimism, such as differing code, design patterns and transaction per block models. “Bedrock also adds support for EIP-1559, chain re-orgs, and other Ethereum features present on L1,” the explainer reads.\n\nThe Bedrock upgrade will bring a 47% reduction in protocol costs and security fees to Optimism Mainnet\n\n\n\nEngineer extraordinaire @trianglesphere explains how in the latest dev blog post https://t.co/MvcG04shEB — OP Labs (@OPLabsPBC) March 2, 2023\n\nZK Sync era overakes Optimism?\n\nThe upcoming move to Bedrock comes at a time in which EVM-compatible zero-knowledge rollups (ZkEVMs) have been taking the spotlight from Optimistic Rollup solutions such as Optimism.\n\nRelated: Ethereum’s Beacon Chain updated after finality issues\n\nAccording to data from L2beat, Matter Labs’ recently launched ZkEVM, ZKSync Era, has overtaken Optimism in terms of network activity.\n\nOver the past 30 days, ZKSync Era had seen 7.85 million transactions, compared to Optimism’s 7.66 million. Over the past 24 hours, ZKSync Era had also outpaced Optimism in average transactions per second (TPS), at 6.80 TPS compared to 2.98 TPS.\n\nThe only interesting trend in this boring middle May on ethereum is the growth of @zksync Era, which is now steadily doing more transactions than @optimismFND and will soon threaten @arbitrum.\n\n\n\nchart from: @l2beat pic.twitter.com/9dSNHtZMEC — funnyking.eth zkHODLER (@PaoloRebuffo) May 15, 2023\n\nMagazine: ZK-rollups are ‘the endgame’ for scaling blockchains, Polygon Miden founder"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3LmNvaW50cmlidW5lLmNvbS9lbi9ldGhlcmV1bS1hbmFseXN0LXByZWRpY3RzLWEtNTAtcHJpY2UtZXhwbG9zaW9uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 May 2023 07:00:00 GMT",
        "title": "Ethereum: Analyst predicts a 50% price explosion - Cointribune EN",
        "content": "Tue 16 May 2023 ▪ 3 min of reading ▪ by La Rédaction C.\n\nThe crypto analyst, known by the pseudonym Kaleo, has 586,700 Twitter followers. In a recent tweet, he claimed that Ethereum could rise to $2,400. However, he specifies that the price will first drop to $1,600 before bouncing back. If the prediction comes true, the price of Ethereum will reach the level it last reached in May 2022 before the collapse of the Terra (LUNA) ecosystem.\n\nEthereum To Explode by 50% in ‘Best-Case Scenario,’ Predicts Popular Crypto Analyst – But There’s a Catch https://t.co/bssCDy7JYT — The Daily Hodl (@TheDailyHodl) May 13, 2023 DailyHodl tweeted the remarks of a crypto analyst stating that Ethereum will explode by 50% in the “best-case scenario”\n\nA maximum increase of 50% is predicted for Ethereum\n\nKaleo is a crypto analyst and trader who has a considerable audience on social media, primarily Twitter. In a tweet published on May 12, he stated, “This is still my best case scenario play for $ETH. Dip to $1600s, then run it back up to ~$2400 to retest the pre LUNA / UST liquidation breakdown level.”\n\nBluntz, another cryptocurrency strategist and colleague of Kaleo, shares his view on the future of ETH. According to Bluntz, Ethereum, which is the second-largest crypto asset by market capitalization, could drop to a minimum of $1,600 before potentially ending its current corrective movement.\n\nAccording to DailyHodl, Bluntz stated, “ETH is getting absolutely mauled right now. Not too sure where I would be looking for longs, probably somewhere between $1,600 – $1,700 and even then I would want to see a very significant reversal candle.”\n\nPredictions supported by a crypto analysis firm\n\nSantiment, a recognized company specialized in crypto analysis, notes that the supply of ETH on crypto exchanges is decreasing. It has even plunged to its lowest level in eight years.\n\n“As Ethereum has dipped to $1,780 today, we’ve seen exchange supply continue to decrease. The percentage of ETH on exchanges is at its lowest (10.1%) since public trading began in 2015. This is essentially the all-time high for non-exchange holdings.”\n\nLike all major cryptocurrencies, Ethereum has suffered from the bear market that has been prevailing for over a year. Many times, there have been announcements of a general price increase. Could we finally see it happen in the near future?\n\nMaximize your Cointribune experience with our 'Read to Earn' program! Earn points for each article you read and gain access to exclusive rewards. Sign up now and start accruing benefits.\n\nClick here to join 'Read to Earn' and turn your passion for crypto into rewards!\n\nA A Lien copié"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiLmh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvaG93LXRvLXVzZS1ldGhlcnNjYW7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "How to Use Etherscan? - Watcher Guru",
        "content": "Unlocking the Power of Etherscan: A Step-by-Step Guide to Navigating the Platform\n\nAs the popularity of Ethereum continues to grow, so does the need for reliable and efficient tools to manage its transactions. One such tool is Etherscan, a powerful platform that allows users to explore and interact with the Ethereum blockchain in various ways.\n\nIn this step-by-step guide, we’ll take you through the basics of Etherscan, including how it works, how to use it, and how to unlock its full potential for your Ethereum transactions.\n\nSource: CNBC\n\nWhat is Etherscan, and How Does it Work?\n\nEtherscan is a blockchain explorer—a tool that allows users to explore and interact with the Ethereum blockchain. It provides a wide range of features, including the ability to search for transactions, view wallet addresses, and track the progress of smart contracts.\n\nThe platform is a window into the Ethereum network, providing users with a wealth of information about the blockchain and its transactions.\n\nAt its core, Etherscan works by querying the Ethereum network for information and displaying it in an easy-to-understand format. Users can search for transactions, wallet addresses, and smart contracts using a variety of search parameters, including transaction hash, contract address, and block number. Etherscan then retrieves the relevant data from the blockchain and presents it in a way that is easy to understand.\n\nHow Do I Learn to Use Etherscan?\n\nLearning to use Etherscan is relatively simple, and plenty of resources are available to help you get started.\n\nThe first step is to navigate to the Etherscan website and familiarize yourself with the different features and functions. The homepage provides a search bar that allows you to search for transactions, addresses, and contracts.\n\nOne of the best ways to learn how to use Etherscan is to explore the blockchain. Search for transactions and wallet addresses to see how they are recorded on the blockchain, and try to understand the different fields and parameters associated with each transaction.\n\nAnother helpful resource is the Etherscan API, which allows developers to build applications that interact with the Ethereum network. By using the API, developers can retrieve data on the Ethereum blockchain, such as transaction histories and contract information.\n\nSource: Phemex\n\nHow Do I Get My Money?\n\nIf you have Ethereum stored on Etherscan, you can withdraw it to an external wallet using the platform’s “Withdraw” function. To do this, you must have an Ethereum wallet address that you control. Navigate to your wallet on Etherscan and click the “Withdraw” button. Enter the amount of Ethereum you wish to withdraw and the address of your external wallet.\n\nOnce you have confirmed the withdrawal, Etherscan will send the Ethereum to your external wallet. Note that transaction fees may be associated with the withdrawal, which will be deducted from the total amount of Ethereum you receive.\n\nHow do I send ETH using Etherscan?\n\nSending Ethereum using Etherscan is also relatively simple. You must have an Ethereum wallet connected to Etherscan, such as MetaMask, to do this. Once you have connected your wallet, navigate to the “Send Ether and Tokens” page on Etherscan.\n\nInput the recipient’s Ethereum address, desired amount, and gas price to determine transaction speed on the network.\n\nOnce you have confirmed the transaction details, submit the transaction and wait for it to be confirmed on the Ethereum network. You can track the progress of your transaction using the transaction hash, which is a unique identifier for each transaction on the blockchain.\n\nSetting up an Account\n\nTo fully unlock the potential of this tool, it is recommended that you set up an account. This will allow you to save and track your favorite addresses and transactions and receive alerts when new transactions occur on the blockchain.\n\nTo set up an account, navigate to the Etherscan homepage and click the “Sign Up” button. Enter your email address and a secure password, and verify your account by following the instructions in the confirmation email.\n\nAfter setting up your account, explore Etherscan’s features: track smart contracts, view transactions, and monitor gas prices.\n\nUnderstanding the Different Features of Etherscan\n\nFirst, it provides diverse features for users to explore and interact with the Ethereum blockchain. Some of the most important features include the search engine, transaction ID, contract address, wallet address, and smart contracts.\n\nIts search engine lets users find transactions, addresses, and contracts easily. Transaction IDs and contract addresses provide unique identification on the blockchain.\n\nWallet addresses in Etherscan let users check balances and transaction histories for specific Ethereum wallets. Smart contracts are another key feature, enabling developers to build decentralized applications (dApps) on the Ethereum network.\n\nConclusion\n\nThis powerful tool provides users with a wealth of information about the Ethereum blockchain. Mastering Etherscan unveils Ethereum’s inner workings and maximizes transaction potential through insightful understanding.\n\nWhether you are a developer looking to build dApps on the Ethereum network or a casual user looking to explore the blockchain, Etherscan is an essential tool for anyone working with Ethereum. So why not try it today and see for yourself what this powerful platform can do?"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiImh0dHBzOi8vd3d3Lm9reC5jb20vbGVhcm4vZXJjLTY1NTHSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "ERC-6551: The new Ethereum standard unlocking fresh possibilities for NFTs - OKX",
        "content": "What is ERC-6551?\n\nERC-6551 Token Bound Accounts (TBA) is a new and innovative Ethereum standard that expands the functionality of NFTs by allowing them to operate as their own smart contract accounts. This exciting development, created by the Future Primitive team with contributions from Manifold and the token-bound developer community, brings newfound versatility and utility to NFTs, transforming them into powerful digital assets.\n\nIn 1992 JPEGs allowed us to view and transmit images to each other; in 2017, NFTs let us buy, sell and trade, but what's next for 2023? The answer could be ERC-6551, which will provide seamless interactions and functionality.\n\nERC-6551 was created to address a limitation on ERC-721 tokens. Before, ERC-721 tokens couldn't act as owners of other on-chain assets or perform actions like an Ethereum account. This limited their usefulness in the real world.\n\nTo overcome this, ERC-6551 introduces token-bound accounts (TBA) — unique smart contract accounts associated with each ERC-721 token. These accounts are created through a permissionless registry and come with all the capabilities of an Ethereum account, allowing for more practical and user-friendly interactions.\n\nStart now\n\nThe benefits of ERC-6551\n\nWhile the token standard is still new, since its release on May 7, 2023, it has offered a much-needed rewrite to NFTs, making them more dynamic and interactive.\n\nImproved capabilities: TBA can be used to engage with other smart contracts and dApps, opening up near endless possibilities for NFTs.\n\nTBA can be used to engage with other smart contracts and dApps, opening up near endless possibilities for NFTs. Greater interoperability: TBA is compatible with other Ethereum standards, which makes it easier for NFTs to be used across different platforms.\n\nTBA is compatible with other Ethereum standards, which makes it easier for NFTs to be used across different platforms. Enhanced user friendliness: The key to mass adoption is to keep both crypto natives and the crypto curious in mind. TBA makes it easier for users to manage their NFTs and can be accessed from any web3 wallet.\n\nThe limitations of ERC-6551\n\nWhile getting caught up in the excitement of a new token standard is normal, doing your own research to get the full picture is also essential. With that in mind, there are some limitations with ERC-6551.\n\nHigh gas fees: The gas fees associated with ERC-6551 can increase, especially during periods of network congestion. This can make it expensive to use ERC-6551 NFTs.\n\nThe gas fees associated with ERC-6551 can increase, especially during periods of network congestion. This can make it expensive to use ERC-6551 NFTs. Limited compatibility: While this new token standard is exciting, it's essential to know not all wallets and platforms support ERC-6551.\n\nWhile this new token standard is exciting, it's essential to know not all wallets and platforms support ERC-6551. Lack of awareness: ERC-6551 is a new standard and is not yet widely known. Only some users know of it and how to use it. What's next for ERC-6551\n\nERC-6551 unlocks new possibilities for NFTs, going beyond their conventional uses. For example, NFTs can now become repositories for in-game wearables and digital items, enhancing user immersion and familiarity. Additionally, PFP (Profile-for-Proof) projects can incentivize collectors by rewarding token bound account holders. Finally, having multiple token bound accounts and support for multiple chains further enhances the utility and stimulates innovation in the NFT ecosystem.\n\nStart now\n\nDisclaimer: THIS ARTICLE IS PROVIDED FOR INFORMATIONAL PURPOSES ONLY. IT IS NOT INTENDED TO PROVIDE ANY INVESTMENT, TAX, OR LEGAL ADVICE, NOR SHOULD IT BE CONSIDERED AN OFFER TO PURCHASE OR SELL OR HOLD DIGITAL ASSETS. DIGITAL ASSET HOLDINGS, INCLUDING STABLECOINS, INVOLVE A HIGH DEGREE OF RISK, CAN FLUCTUATE GREATLY, AND CAN EVEN BECOME WORTHLESS. YOU SHOULD CAREFULLY CONSIDER WHETHER TRADING OR HOLDING DIGITAL ASSETS IS SUITABLE FOR YOU IN LIGHT OF YOUR FINANCIAL CONDITION. PLEASE CONSULT YOUR LEGAL/TAX/INVESTMENT PROFESSIONAL FOR QUESTIONS ABOUT YOUR SPECIFIC CIRCUMSTANCES."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vbWlsa3JvYWQuY29tL2RhaWx5L3RoZS1uZnQtcm95YWx0eS1nYW1lLWp1c3QtY2hhbmdlZC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 May 2023 07:00:00 GMT",
        "title": "🥛The NFT royalty game just changed 😳 - Milk Road",
        "content": "GM. This is Milk Road, the telescope of crypto news. Our updates can help give you a clearer view of the digital currency world.\n\nHere’s what we got for you today:\n\nWtf is an ERC721-C? 🧐\n\nETH staking returns highest since Shapella🫰\n\nFrom $0 → $7M in one weekend 📈\n\nBinance is leaving Canada 🍪\n\nPrices as of 8am EDT\n\nToday’s edition is brought to you by Origin Protocol, whose newest offering OETH is changing up the ETH staking game and bringing user’s additional yield.\n\nWHAT’S AN ERC721-C? 🧐\n\nLook, we like cartoon jpegs as much as the next person.\n\nBut there’s 1 pesky problem with the NFT world: royalties. They’re the extra fees (5-10%) you pay on marketplaces like OpenSea when you buy an NFT.\n\nThe upside: the NFT artist gets paid (woo!)\n\nThe downside: more fees = NFT traders get less money (boo!)\n\nThat’s where ERC721-C comes in.\n\nIt’s the new remix to the ERC721 standard for Ethereum-based NFTs. It’s designed to help NFT artists earn more royalties from their work (the “C” stands for “Creator.”)\n\nHere’s how:\n\nProgrammable royalties. Creators can distribute NFT collection royalties directly to holders that buy their NFTs?\n\nOpenSea/Blur can’t set royalties to 0%. Marketplaces will do this to compete against each other, even though that means creators don’t get paid. Tsk tsk\n\nSo…what next? Well, first an NFT collection needs to actually start using this – no one really has yet.\n\nBut this is a pretty cool way to implement royalties (more $$ for creators), while also benefiting traders (creators can share royalties with buyers).\n\nWanna read more? Check out our Milk Road Guide to ERC721-C below.\n\nEver since Ethereum’s Shanghai Upgrade, liquid staking has been the talk of the town. The battle between providers has been fierce.\n\nAnd now, a new challenger has entered the arena. And it’s not just any contender, it’s the veteran DeFi protocol, Origin Protocol.\n\nThey just launched Origin Ether (OETH) – an innovative approach to staking your ether to earn that juicy yield.\n\nHere’s the breakdown:\n\nIt aggregates yield across liquid staking derivatives such as Lido, Rocketpool and Frax\n\nIn addition to earning rewards from only staking, OETH earns significantly higher APY by providing liquidity in DeFi\n\nYield is provided passively so you don’t have to pay any gas fees\n\nAnd they’re serious about security. The protocol is audited by OpenZeppelin, the same folks that audit Coinbase, The Ethereum Foundation, and Aave.\n\nStart earning yield on your Ether with OETH today, or boost the yield from your stETH, rETH, or frxETH by depositing them with Origin!\n\nETH’S STAKING RETURNS ARE HIGHEST SINCE SHAPELLA 🫰\n\nEthereum stakers are earning BANK. That’s because the annualized rate of return just hit a whopping… *checks notes*…. 8.76%.\n\nThis is the yearly return for staking ETH to help validate transactions on the network.\n\nThat’s the highest it’s been since the network’s Shapella update. AKA when Ethereum started letting people unstake their holdings.\n\n⚠️ The current annualized rate of return for #ETH staking stands at 8.6%, which is a historical peak. Since the Shanghai upgrade, ETH2.0 contracts have seen 3.4 million $ETH deposits and 2.67 million ETH withdrawals, resulting in a net pledge of 734.92k ETH (worth $1.4… https://t.co/8gtcBRtlio https://t.co/mJjRBBNzFp — BecauseBitcoin.com (@BecauseBitcoin)\n\nMay 15, 2023\n\nSo what? This is good! More staking & returns = more people are confident in the Ethereum network.\n\nThere’s one caveat though…\n\nThe line to stake ETH is longer than 7/11’s free slurpee line on July 11 every year.\n\nAt the moment, there are about 50K validators waiting in line. And you’ll have to wait about a month to become an Ethereum validator and start earning yield. Womp womp\n\nEthereum’s quite literally the coolest kid on the block right now.\n\nFROM $0 → ~$7M IN ONE WEEKEND 📈\n\nWow, do we have a story for you. It involves an NFT personality (ben.eth), two trending meme coins and $6.9M…\n\nBuckle up, Roadies. Here’s the story in 5 parts:\n\nPART 1: CREATE A SH*TCOIN\n\nOne cool thing about sh*tcoins is they don’t do anything, so you can name them whatever you want. In this case, ben.eth took the easy route and named his after himself, $BEN.\n\nPART 2: LAUNCH SH*TCOIN WITH A PRESALE\n\nben.eth didn’t go the traditional presale route, he started collecting ETH directly to his wallet. He was able to raise 55 ETH from over 300 contributors – around $100K at the time.\n\nPART 3: GIVE AWAY OWNERSHIP TO YOUTUBER\n\n$BEN was on a fast track to 0 until another Ben jumped in to save the day. An unlikely “hero” who seems to always find himself in the midst of Twitter controversies.\n\nThe infamous Bitboy Crypto.\n\nGuys $BEN is live. People all want to invest in themselves and now Bens can do that. The facts:\n\n– The coin has my name\n\n– We have a Ben DAO on telegram\n\n– Bens are better than Jeffs so we should easily take over JeffCoin as the number one name on the blockchain — Ben Armstrong (@Bitboy_Crypto)\n\nMay 8, 2023\n\nWhile he joined as a team member, he ended up taking over the whole damn thing a day later. A classic case of the student becoming the teacher.\n\nAnd even though ben.eth abandoned his prized creation within 72 hours, Bitboy’s tweets were enough to pump the price more than 10x in a day.\n\nHUGE $BEN Announcement I did not launch the project. But I am now taking it over 100%. @eth_ben and I have agreed in principle to an agreement where all of the assets and liquidity for @bencoin_eth will be transferred to me within a week. @eth_ben will become an advisor. — Ben Armstrong (@Bitboy_Crypto)\n\nMay 11, 2023\n\nPART 4: ANNOUNCE A NEW SH*TCOIN\n\nSo what do you do when a Youtuber buys out your sh*tcoin right after launch? You create another one.\n\nben.eth called it $PSYOP.\n\nTwitter\n\nWithin an hour he had already raised $1M. And at the end of the presale, his wallet was holding ~$6.9M (nice).\n\nPART 5: REPEAT STEPS 1 AND STEP 2\n\nAnd steps 3 and 4, if you’re lucky enough to come across someone as passionate about their name as Ben Armstrong is.\n\nThe craziest part of all this? People don’t care know about what they are buying. And some were sending over multiple ETH. As of writing, $PSYOP hasn’t even launched.\n\nSo what? This says a lot about the current crypto landscape.\n\nWhile we wait for true value to be created and adoption to continue, the space is dominated by attention and FOMO.\n\nMILK & COOKIES 🍪\n\nNFTfi just launched a brand-new phase in their popular loyalty program. In EARN SEASON 1 you can earn exclusive, non-transferable reward points for NFT borrowing/lending on their platform. (Sponsored)\n\nBinance leaves Canada amid increased regulation. The latest victim of the regulatory crackdown sweeping North America.\n\nQuadriga CX customers finally receive their payout. Creditors are only receiving 13% of their claim after waiting for ~5 years… Pour one out.\n\nCrypto attacks and cyberattacks fund about 50% of North Korea’s missile program. They’ve stolen over $2.3B total, with 30% of stolen funds coming from Japan.\n\nBinance CEO CZ recently unfollowed Elon Musk on Twitter. An interesting follow up to Binance investing $500M in the Twitter takeover. There’s speculation CZ isn’t happy with Elon’s plans to launch a crypto wallet within the app.\n\nMILKY MEMES 🤣\n\nHIT THE INBOX OF 250K+ CRYPTO INVESTORS\n\nAdvertise with the Milk Road to get your brand in front of the Who's Who of crypto. The Roadies are high-income crypto investors who are always looking for their next interesting product or tool. Get in touch today.\n\nROADER REVIEW OF THE DAY\n\nVITALIK PIC OF THE DAY\n\nGM. https://t.co/CwbYuhFicT — Milk Road (@MilkRoadDaily)\n\nMay 16, 2023\n\nDISCLAIMER: None of this is financial advice. This newsletter is strictly educational and is not investment advice or a solicitation to buy or sell any assets or to make any financial decisions. Please be careful and do your own research."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvbGl0ZWNvaW4vd2h5LWxpdGVjb2luLW1vc3QtdW5kZXJ2YWx1ZWQtYXNzZXQtY3J5cHRvL9IBVWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvbGl0ZWNvaW4vd2h5LWxpdGVjb2luLW1vc3QtdW5kZXJ2YWx1ZWQtYXNzZXQtY3J5cHRvL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 May 2023 07:00:00 GMT",
        "title": "Why Litecoin Is The Most Undervalued Asset in Crypto - NewsBTC",
        "content": "Litecoin momentum is potentially changing, network usage is skyrocketing, and the cryptocurrency’s halving is ahead.\n\nYet the asset remains drastically undervalued relative to Bitcoin, Ethereum, and other factors. Here is a closer look at why Litecoin could be the most undervalued asset in crypto.\n\nLTC Vs BTC Vs ETH Compared\n\nLitecoin was once a top ten or higher cryptocurrency that has since fallen from that lofty pedestal. A nine-month-long up-only bull run and more than 10,000% ROI left the coin ranging for going on its fifth full year.\n\nUnlike other top coins like Bitcoin and Ethereum, LTC never made dramatic new all-time highs in 2021. On some exchanges, the record high is still set for 2017. After the 2017 bull market peak, Litecoin has lagged behind the two largest coins by market cap.\n\nBut this is common in the final stages of a bull market, after which Litecoin wildly outperforms both BTC and ETH in a flash. That sort of situation could return, according to the charts below, starting with the below comparison of LTC versus Bitcoin and Ether.\n\nLTC is drastically underperforming BTC and ETH | LTCUSD on TradingView.com\n\nCrypto Market Moment Ready To Change\n\nAnother sign that LTC is due to outperform the market can be found in the one-month LMACD crossing bullish. The signal is at least a two months ahead of Bitcoin and Ether and suggests a larger move in Litecoin first.\n\nAccording to Investopedia, momentum “refers to the inertia of a price trend to continue either rising or falling for a particular length of time.” The LMACD is a momentum measuring tool, and it could be indicating that Litecoin’s inertia just made a major swing in the positive direction.\n\nThe LMACD has crossed bullish on only one of these charts | LTCUSD on TradingView.com\n\nLitecoin Elliott Wave And The Final Advance\n\nLitecoin technicals, according to Elliott Wave Principle, could also point to much higher prices. The current wave count and Fibonacci retracement levels are characteristic of an expanding diagonal pattern.\n\nThese patterns appear at the beginning or the end of a motive wave. Considering the larger wave count, this would suggest an ending expanding diagonal and perhaps the last major rally in Litecoin in some time.\n\nIs this an ending diagonal pattern? | LTCUSD on TradingView.com\n\nLTC Fundamentals Support Soaring Higher\n\nFinally, LTC transactions are currently skyrocketing. From a fundamental perspective, this is as bullish as it gets for any cryptocurrency. Litecoin is benefiting from an explosion of ordinals on the LTC-20 standard, congestion on Bitcoin and Ethereum, and more.\n\nNetwork transactions are off the charts | LTCUSD on TradingView.com\n\nEssentially, the Litecoin ecosystem is booming again. When network usage skyrockets, LTCUSD spikes in price. We also have yet to mention Litecoin’s halving, which is less than 80 days away.\n\nA mega thread 🧵on why I am more bullish on #Litecoin than any other asset in the space starting with what I believe is cyclical perfection using Hurst Cyclical theory Internal 1/3 harmonics match up with a larger cycle, which also has 1/3 harmonics I see the grand finale next pic.twitter.com/cAh5CrnlUZ — Tony \"The Bull\" (@tonythebullBTC) May 16, 2023\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vYnJhbmQtc3Rvcmllcy90aGlzLWlzLXdoYXQtYWktYW5kLWNoYXRncHQtaGF2ZS10by1zYXktYWJvdXQtZXRoZXJldW0tcGF0LXdhcnMtc29sYW5hLTEwMTY4NDIzNTU0NDU4Mi5odG1s0gGMAWh0dHBzOi8vd3d3LmhpbmR1c3RhbnRpbWVzLmNvbS9icmFuZC1zdG9yaWVzL3RoaXMtaXMtd2hhdC1haS1hbmQtY2hhdGdwdC1oYXZlLXRvLXNheS1hYm91dC1ldGhlcmV1bS1wYXQtd2Fycy1zb2xhbmEtMTAxNjg0MjM1NTQ0NTgyLWFtcC5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 May 2023 07:00:00 GMT",
        "title": "This Is What AI and ChatGPT Have to Say about Ethereum, PAT WARS, Solana - Hindustan Times",
        "content": "A new force has arrived on the scene, threatening to change the world and disrupt many industries — Artificial Intelligence (AI). The seamless integration of cutting-edge AI technology into the dynamic cryptocurrency industry holds the promising potential to catapult both domains to remarkable heights of innovation and success.\n\nAI-powered trading bots could be armed with machine learning algorithms that analyse vast amounts of data, make lightning-fast decisions, and execute trades with precision. But there's one potential feature of AI that could be a great help to investors - predictive analysis. AI algorithms can crunch historical data, market analysis, and a multitude of other variables to forecast crypto trends and price movements. Cryptocurrencies are notoriously volatile and unpredictable, but these AI-powered crystal balls can provide valuable insights for traders, investors, and enthusiasts alike. In this article, we'll look at what the popular AI chatbot ChatGPT has to say about two well-performing cryptocurrencies — Solana (SOL) and PAT WARS (PAWS).\n\nHindustan Times - your fastest source for breaking news! Read now.\n\nCan ChatGPT Predict the Future of Solana (SOL)?\n\nSolana is an open-source, decentralised finance (DeFi) project\n\nThe author of this article asked ChatGPT what lies ahead for Solana (SOL). In their own words, the results were intriguing.\n\nIn recent months, Solana experienced some turbulent times, facing unexpected outages that tested the patience of its users and raised concerns about the platform's stability. Investor confidence took a hit as questions arose regarding the network's resilience and ability to handle growing demand. The author asked a jailbroken version of ChatGPT what it makes of Solana and if it can recover after its recent setbacks. The chatbot seemed optimistic, thinking Solana to be the Ethereum killer. \"Solana is faster and more efficient than Ethereum, with lower transaction fees, higher transaction throughput, and better scalability,\" it says.\n\nSolana is an open-source, decentralised finance (DeFi) project, born from the fertile minds of visionaries in 2017 and sprouted in March 2020. With its headquarters nestled in the enchanting city of Geneva, Switzerland, Solana harnesses the boundless potential of blockchain's permissionless nature to deliver high-functioning DeFi solutions.\n\nCan ChatGPT Predict the Future of New Coins Like PAT WARS (PAWS)?\n\nPAWS has just launched its presale\n\nPAT WARS (PAWS) combines two unlikely forces - cat memes and Star Wars. PAWS has just launched its presale, but could ChatGPT predict its future based on the journey of other meme coins?\n\nI fed ChatGPT information about PAT WARS, including its strong community focus, its NFT collection featuring its four Jedi cats, its native token PAWS, and its plans to explore the gaming and DeFi spaces. The chatbot acknowledged that predicting the future of cryptocurrency is challenging, but it provided some potential scenarios for the future of PAT WARS.\n\nChatGPT thinks PAWS’ value could increase if it delivers on its promises to build a strong and vibrant community. \"Increased demand, limited token supply, and successful marketing efforts could contribute to its growth. Additionally, if the project explores and executes successful ventures in gaming and DeFi, it could attract further interest and potentially increase the value of PAWS,\" it says.\n\nHowever, the chatbot acknowledges the crypto market is highly volatile and unpredictable. \"Many meme coins experience initial excitement during their presale or launch but struggle to maintain momentum in the long run.\"\n\nAI is reshaping the landscape of decentralised platforms, and it will be interesting to see where the technology goes from here.\n\nFind out more about PAT WARS (PAWS):\n\nWebsite:https://www.patwars.com\n\nTwitter:https://twitter.com/PATWARSOfficial\n\nTelegram:https://t.me/PATWARSOfficial\n\nDisclaimer: This article is a paid publication and does not have journalistic/ editorial involvement of Hindustan Times. Hindustan Times does not endorse/ subscribe to the contents of the article/advertisement and/or views expressed herein.\n\nThe reader is further advised that Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions.\n\nHindustan Times shall not in any manner, be responsible and/or liable in any manner whatsoever for all that is stated in the article and/or also with regard to the views, opinions, announcements, declarations, affirmations etc., stated/featured in same. The decision to read hereinafter is purely a matter of choice and shall be construed as an express undertaking/guarantee in favour of Hindustan Times of being absolved from any/ all potential legal action, or enforceable claims. The content may be for information and awareness purposes and does not constitute a financial advice."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vZGFpbHljb2luLmNvbS9jb2luYmFzZS1oYWx0cy1ldGgtc3Rha2luZy1yZXdhcmQtd2l0aGRyYXdhbHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Coinbase Halts ETH Staking Reward Withdrawals: Is SEC Action Related? - DailyCoin",
        "content": "Coinbase said on Tuesday that it had suspended ETH staking reward withdrawals.\n\nThe exchange said that the reason for the halt was a “technical issue.”\n\nThe U.S. SEC is likely to file an enforcement action against Coinbase in the coming weeks.\n\nThe current crypto bear market is one of the toughest in history. It’s especially tough for centralized crypto exchanges, which have seen tremendous regulatory pressures.\n\nThe environment is so fragile that centralized exchanges face scrutiny for everything they do. For example, Coinbase has just suspended ETH staking reward withdrawals amid its beef with the SEC.\n\nCoinbase Halts ETH Staking Reward Withdrawals\n\nCoinbase, the second-largest centralized crypto exchange in the world, announced on Tuesday that it had suspended ETH staking reward withdrawals.\n\nThe exchange said the halt was due to a “technical issue” the team had already identified. A fix will be deployed in the next 48-72 hours, and ETH staking reward withdrawals will be re-enabled.\n\nCoinbase status page. Source: status.coinbase.com.\n\nIt’s unclear what bug Coinbase is referring to. Moreover, bugs that prevent regular activity are usually solved as soon as possible. In Coinbase’s case, it will take up to three days.\n\nWhile it’s most likely that Coinbase is indeed experiencing a bug, it’s also possible that the exchange is preparing for potential regulatory action from the U.S. Securities and Exchange Commission (SEC).\n\nCan SEC Be Blamed for Halt?\n\nCoinbase received a Wells Notice from the SEC in March. Receiving a Wells Notice means the regulatory body plans to file an enforcement action against the receiver.\n\nOn Tuesday, Berenberg Capital Markets, a broker-dealer in the U.S., said that the SEC will likely file an enforcement action in the coming weeks. The enforcement action will probably be related to Coinbase’s staking services.\n\nThis is because other centralized exchanges like Kraken have already been ordered to shut down their staking services for selling unregistered securities.\n\nHowever, if Coinbase received such an order, the exchange pledged to go to court and fight back.\n\nOn the Flipside\n\nThe technical issues Coinbase is talking about might as well be actual technical issues that have nothing to do with upcoming SEC action.\n\nWhy You Should Care\n\nCoinbase is the second-largest crypto exchange in the world. However, users should always be aware of potential issues centralized exchanges might face and consider self-custody.\n\nRead more about Lido enabling stETH withdrawals:\n\nLido Enables stETH Withdrawals: See Who’s Withdrawing How Much\n\nRead more about Optimism’s upcoming Bedrock upgrade:\n\nOptimism Reveals Date for Bedrock Upgrade: Here’s What It Changes"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vdS50b2RheS95YWNodGlmeS15Y2h0LXByZS1zYWxlLWdhaW5zLXN0ZWFtLXRhcmdldHMtd2hhbGUtaG9sZGVycy1vZi1ldGhlcmV1bS1ldGgtc2hpYmEtaW51LXNoaWItY3J5cHRvc9IBc2h0dHBzOi8vdS50b2RheS95YWNodGlmeS15Y2h0LXByZS1zYWxlLWdhaW5zLXN0ZWFtLXRhcmdldHMtd2hhbGUtaG9sZGVycy1vZi1ldGhlcmV1bS1ldGgtc2hpYmEtaW51LXNoaWItY3J5cHRvcz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Yachtify (YCHT) Pre-Sale Gains Steam, Targets Whale Holders of Ethereum (ETH), Shiba Inu (SHIB) Cryptos - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nYachtify (YCHT), an innovative platform revolutionizing the yacht investment landscape, has all chances to trigger mass adoption amidst the recent turmoil in the crypto markets.\n\nThe platform's unique approach to fractional yacht ownership and attractive presale incentives are drawing investors to Yachtify (YCHT) for a more secure and promising investment experience.\n\nYachtify (YCHT) introduces alternative for altcoin fans\n\nAs the cryptocurrency market experiences turbulence with Ethereum whales panic selling and meme coins like SHIB facing price crashes, Yachtify (YCHT) emerges as a promising investment alternative. Offering unique benefits and features, YCHT is garnering significant attention in the crypto community.\n\nOne of the key advantages of Yachtify (YCHT) is its fractionalization of yacht ownership. This innovative approach allows investors to own a share of a luxury yacht without having to bear the full costs of ownership. Fractionalization democratizes access to the yachting lifestyle and provides a potential source of passive income through yacht chartering.\n\nCurrently, Yachtify (YCHT) is in its presale stage, offering an enticing pricing of just $0.12 per token. Investors who seize this early opportunity can enjoy a 30% bonus on their token purchases, making it an even more attractive proposition.\n\nSupporters of Yachtify (YCHT) can take part in pre-sale and buy tokens here .\n\nEthereum (ETH) whales are still confident\n\nRecently, Ethereum whales have initiated a massive sell-off, causing turmoil within the Ethereum community and concerns among investors. Two prominent Ethereum whales, identified as 0x6071 and 0x7641, sold a combined total of 19,090 ETH, amounting to roughly $35.7 million. This massive sell-off comes after the Ethereum Foundation offloaded 15,000 ETH ($29.7 million) to Kraken.\n\nThe considerable sales have triggered a wave of selling activity, resulting in a notable effect on Ethereum's price, which dropped from $1,900 to $1,850 in a matter of hours. As Ether currently hovers around the 50-day moving average, investor uncertainty and conjecture are on the rise. The latest moves by Vitalik Buterin and the Ethereum Foundation have left numerous individuals pondering the future of the cryptocurrency and the consequences of such extensive selling on the market.\n\nShiba Inu (SHIB) holders benefit from another phase of meme coin euphoria\n\nDespite the recent purchase of over 10.25 trillion Shiba Inu (SHIB) tokens by large buyers, the price of Shiba Inu (SHIB) continues to decline. The substantial volume of purchases failed to prevent an 8% drop in Shiba Inu (SHIB) price over the past week, marking the third consecutive week of decline.\n\nOne possible explanation for this paradox is the rise of the Pepe (PEPE) meme token, which gained incredible momentum and reached a $1.66 billion market cap within the same three weeks.\n\nIt appears that PEPE may have diverted liquidity from Shiba Inu (SHIB), contributing to its ongoing price drop.\n\nJoin Presale: https://buy.yachtify.market\n\nWebsite: https://yachtify.market\n\nTelegram: https://t.me/yachtify"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9zY2FsYWJpbGl0eS1tYWdpYy1vZi1ldGhlcmV1bS1lbmlnbWEtdW5sb2NraW5nLWZpbmFuY2lhbC13aXphcmRyeS1hbmQtZW5oYW5jaW5nLWRvZ2V0dGlzLWNyeXB0by1hZHZlbnR1cmUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Scalability Magic of Ethereum Enigma: Unlocking Financial Wizardry and Enhancing Dogetti's Crypto Adventure - Analytics Insight",
        "content": "Can Ethereum Enigma’s novel scaling solutions assist the fintech sector in navigating cryptocurrency issues and providing respite from rising costs?\n\nIn the constantly shifting arenas of fintech and cryptocurrency, Ethereum Enigma stands out as a light of hope, providing breakthrough scaling solutions to address the industry’s critical concerns. With its forward-thinking attitude and commitment to innovation, Ethereum Enigma has established itself as an industry leader in the cryptocurrency space.\n\nIn this article, we will look at the distinctive traits and achievements of Ethereum Enigma, as well as how its offers may assist crypto professionals and users looking for up-to-date information. We will also discuss the success of the meme market, notably its leader Dogetti, its presale, and how Ethereum Enigma may impact it.\n\nEthereum Enigma: Unrevealing Scalability for Lightning-Fast and Cost-Efficient Ethereum Transactions\n\nEthereum Enigma is an organisation devoted to resolving the general scalability concerns that have plagued blockchain networks, specifically Ethereum. Ethereum Enigma has created solutions to improve scalability, increase transaction speeds, and minimise costs within the Ethereum ecosystem by leveraging cutting-edge technology and a team of professionals.\n\nEthereum Enigma improves the efficiency of Ethereum’s infrastructure by utilising sophisticated layer-2 technologies like state channels and plasma chains. These technologies enable off-chain processing, lessening the burden on the main blockchain and enabling quicker and more cost-effective transactions. Ethereum Enigma enables the finance sector to realise the full potential of decentralised apps and smart contracts by reducing congestion and enhancing scalability.\n\nEthereum Enigma’s solutions have been steadily applied, and their effect on the crypto community is growing. Ethereum Enigma, available internationally, has gained recognition for its effective implementation of layer-2 solutions, allowing users to experience quicker transaction speeds and lower prices. As the platform evolves, its solutions will likely reach a wider audience, revolutionising how we interact with cryptocurrencies.\n\nGet Ready to Meme Your Way to Crypto Gains with Dogetti\n\nDogetti, the crypto sensation that started as a meme, is here to bring fun and uniqueness to cryptocurrencies! This decentralised gem has quickly gained a passionate community of followers, adding a touch of playfulness to the often serious crypto market. With its lighthearted nature and growing popularity, Dogetti offers a refreshing break from the norm and invites users to enjoy a wild ride of memes, laughter, and potential gains, so if you’re ready to release your inner meme-loving investor, board in the Dogetti family and join the fun.\n\nDogetti’s presale is still going on and will end on June 20, 2023. Isn’t it a relief?\n\nYou have the opportunity of a lifetime to join the presale but wait, take advantage of the coupon code LAUNCHDETI to receive a 400% bonus on all your DETI purchases.\n\nEthereum Enigma’s Game-Changing Scalability Solutions: Unlocking Dogetti’s Potential in the Crypto Universe\n\nThe interoperability of Ethereum Enigma with popular cryptocurrencies like Dogetti is one of its most exciting features. Ethereum Enigma expands the potential of cryptocurrencies through seamless integration and interconnection, providing a holistic solution for customers seeking optimised experiences across different platforms. However, one can wonder how Ethereum Enigma could influence Dogetti.\n\nThe incorporation of Ethereum Enigma’s scaling solutions has the potential to have a significant influence on Dogetti and its consumers. Dogetti may benefit from increased scalability, faster transaction speeds, and lower costs by utilising Ethereum Enigma’s powerful layer-2 technologies.\n\nThese enhancements will lead to a more seamless and efficient user experience, attracting more people to engage with Dogetti’s cryptocurrency. Dogetti users now enjoy simplified experiences across numerous platforms thanks to Ethereum Enigma’s seamless integration capabilities, significantly increasing the scope and possibilities of this popular cryptocurrency.\n\nAs Ethereum Enigma continues to revolutionise the finance sector, the collaboration between Ethereum Enigma and Dogetti creates a symbiotic connection that accelerates Dogetti’s development and acceptance in the volatile crypto market.\n\nDogetti (DETI)\n\nPresale: https://dogetti.io/how-to-buy\n\nWebsite: https://dogetti.io/\n\nTelegram: https://t.me/Dogetti\n\nTwitter: https://twitter.com/_Dogetti_\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vY3J5cHRvZGFpbHkuY28udWsvMjAyMy8wNS9pb3RleC1jb21tdW5pdHktdm90ZXMtbWFzc2l2ZWx5LWluLWZhdm9yLW9mLWJyaWRnaW5nLWl0cy10b2tlbi10by1ldGhlcmV1bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 May 2023 07:00:00 GMT",
        "title": "IoTeX community votes massively in favor of bridging its token to Ethereum - CryptoDaily",
        "content": "In a significant development for the blockchain industry, IoTeX's community has overwhelmingly voted in favor of Improvement Protocol 21 (IIP-21), paving the way for bridging IOTX, the native coin of the IoTeX network, to Ethereum.\n\nThe proposal received overwhelming support from the IoTeX community, with a final tally of 306 million IOTX (73.77%) voting in favor of the bridge, while 109 million IOTX (26.23%) opposed the proposal.\n\nA total of 334 wallets participated in the vote, whose successful outcome reflects the community's enthusiasm for expanding the utility and reach of IOTX through cross-chain interoperability.\n\nEnormous potential for Ethereum and IoTeX\n\nBlockchain bridges have gained increasing attention as they offer numerous benefits to the blockchain ecosystem. By enabling tokens to move seamlessly between different blockchains, bridges address scalability challenges, reduce network congestion, and enhance user experiences.\n\n“One of the primary motivations behind IIP-21 is to leverage Ethereum's robust DeFi ecosystem, increase IoTeX token liquidity within Ethereum, and build a vibrant developer and user community,” said IoTeX CEO and Co-Founder Raullen Chai. “The proposed bridge between IoTeX and Ethereum holds immense potential for both platforms and the broader blockchain community,” he added.\n\nPresently, IOTX exists on the IoTeX network and is bridged to Binance Smart Chain and Polygon.\n\nAddressing limitations\n\nHowever, the legacy ERC-20 version of IOTX on Ethereum, known as IOTX-E, has limited supply and circulation, restricting its usage in DeFi protocols and availability on major centralized exchanges.\n\nThe proposal aims to address these limitations by implementing CIOTX (Cross Chain IOTX), a wrapped version of IOTX on the Ethereum blockchain. CIOTX will be fully backed by the circulating IOTX on IoTeX, ensuring a sufficient supply for utilization in any Ethereum-based DeFi application and circulation on centralized exchanges.\n\nThis strategic move enables IoTeX to tap into the thriving DeFi ecosystem on Ethereum, including on popular protocols like Uniswap, Curve, Aave, and Compound.\n\nSeamless token swapping\n\nIntroducing CIOTX on Ethereum will facilitate the seamless swapping of tokens between CIOTX and IOTX-E. By listing CIOTX alongside IOTX-E on decentralized exchanges like Uniswap and Curve, users can exchange the two tokens at market prices, with the market determining their respective values based on demand. This feature enhances liquidity and provides greater flexibility for users in managing their IOTX assets.\n\nThe benefits of blockchain bridges extend beyond IoTeX and Ethereum. With IoTeX diverting some network traffic away from Ethereum, the bridge helps alleviate congestion and scalability challenges the Ethereum network faces. By dispersing transactions to other less congested blockchains, bridges contribute to the overall improvement of blockchain scalability and user experience.\n\nA fantastic step forward\n\nThe successful passage of IIP-21 signifies a significant step forward for IoTeX and the broader blockchain community. With the bridging of IOTX to Ethereum and the introduction of CIOTX, IoTeX aims to create a comprehensive ecosystem of IOTX-backed tokens that can be utilized across multiple blockchains.\n\nThis integration of IoTeX and Ethereum opens new possibilities for DeFi applications, enhancing the utility and value of IOTX while promoting interoperability within the blockchain landscape.\n\nAs the blockchain industry continues to evolve, bridges like the one proposed in IIP-21 play a crucial role in unlocking the full potential of different blockchain platforms. By enabling seamless token transfers, bridges enhance scalability, reduce congestion, and foster collaboration between blockchain ecosystems, ultimately driving innovation and adoption in the decentralized finance space.\n\nLeveraging IoTeX’s speed and efficiency\n\nWith the bridging of IOTX to Ethereum, businesses can now explore the possibility of enabling instant payments using IOTX or CIOTX tokens, leveraging the speed and efficiency of the IoTeX network while benefiting from Ethereum's vast user base and DeFi infrastructure.\n\nThe successful implementation of IIP-21 and bridging IOTX to Ethereum represent a significant milestone in the blockchain industry. As blockchain bridges continue to gain prominence, we expect to witness the emergence of new use cases and innovative applications across various sectors, ultimately driving the widespread adoption of blockchain technology and fostering a more interconnected and efficient decentralized ecosystem.\n\nDisclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZW4uZXRoZXJldW13b3JsZG5ld3MuY29tL3NlYy1qdW1wLXRyYWRpbmctcHJvcHBlZC1kby1rd29uLXRlcnJhdXNkL9IBT2h0dHBzOi8vZW4uZXRoZXJldW13b3JsZG5ld3MuY29tL3NlYy1qdW1wLXRyYWRpbmctcHJvcHBlZC1kby1rd29uLXRlcnJhdXNkL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 May 2023 07:00:00 GMT",
        "title": "SEC Says Jump Trading Secretly Propped Up Do Kwon’s TerraUSD - Ethereum World News",
        "content": "Court filings by the U.S. SEC claim that Jump Trading entered a secret deal with Do Kwon in 2021.\n\nJump Trading allegedly propped up Terraform Labs’ TerraUSD stablecoin a year before it collapsed.\n\nThe deal allowed TerraUSD to regain its dollar peg in 2021 in exchange for a discount on Luna purchases by Jump.\n\nChicago-based Jump Trading is once again in the crosshairs of the U.S. Securities and Exchange Commission (SEC) as recent court filings by the securities regulator highlight a secret deal between the high-frequency trading firm and the now defunct Terraform Labs involving the latter’s TerraUSD stablecoin.\n\nJump Trading Made Over $1 Billion After Secret Deal With Do Kwon\n\nAccording to a report by the Wall Street Journal, recent court filings made by the SEC as part of its ongoing fraud lawsuit against Terraform Labs co-founder Do Kwon confirmed that Jump Trading was the unnamed U.S. trading firm that was listed in the initial complaint. The complaint alleged that when the TerraUSD stablecoin lost its peg to the US Dollar in May 2021, Kwon and Terraform Labs entered into a secret deal with Jump Trading to prop up its price. As per said deal, Jump purchased large amounts of TerraUSD which drove up the stablecoin’s price and helped it regain its peg.\n\nIn exchange for helping restore TerraUSD’s peg, Terraform Labs allowed Jump to buy its Luna token at 30, 40, and 50 cents over the next three years. The agreed-upon price allowed Jump Trading to scoop up Luna tokens at a massive discount, which ultimately netted more than $1 billion for the trading firm. Reports of Jump’s involvement with Terraform Labs’ started circulating earlier this year after the SEC filed charges against Do Kwon and his crypto firm.\n\nJump Trading’s role in helping TerraUSD regain its dollar pegs contradicts the claims made by Do Kwon about the stablecoin’s self-healing capability. The SEC has accused Kwon of making misleading statements about the capabilities of the stablecoin’s underlying algorithm while keeping investors in the dark about secret deals that actually propped up TerraUSD. As of now, Jump Trading has not been accused of any wrongdoing in connection with the stablecoin or Terraform Labs’ collapse in May last year."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC90cmFkZWN1cnZlLXRjcnYtYmxvd3MtYXdheS1jb21wZXRpdG9ycy1saWtlLXRoZS1wcm90b2NvbC10aGUtYW5kLWV0aGVyZXVtLWV0aC13aXRoLWl0cy1wcmVzYWxlLWdyb3d0aC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 May 2023 07:00:00 GMT",
        "title": "Tradecurve (TCRV) Blows Away Competitors Like THE Protocol (THE) And Ethereum (ETH) With Its Presale Growth - Analytics Insight",
        "content": "Since the crypto market has started to give bullish signals, whales have become active too. The presale of Tradecurve has become the biggest recipient of whales’ investments. Experts are confident that Tradecurve will become a blue-chip project in 2023, therefore many investors want to join the project from its presale phase to maximize their benefits. Meanwhile, projects like THE Protocol (THE) and Ethereum (ETH) have struggled to grab the attention of investors.\n\nTHE Protocol (THE) Collabs For Charitable Cause\n\nThe crypto market has seen a flurry of meme coins lately, with THE Protocol (THE) being one of them. But in the absence of any strong fundamentals and use cases, THE Protocol (THE) has failed to grow. The value of THE Protocol (THE) has plummeted by more than 65% in the past month. Hence, THE Protocol (THE) is currently trading at $0.000545. However, THE Protocol (THE) tried to become different from other meme coins by launching THE Charity Protocol. The collaboration between THE Protocol (THE) and THE Charity Protocol aims to harness the benefits of Web3 to support charitable causes. With this partnership, THE Protocol (THE) helps donors contribute to a range of charitable initiatives.\n\nEthereum (ETH) Network Suffers Challenges\n\nEthereum (ETH) network recently suffered transaction finality challenges for two consecutive days. While the Ethereum (ETH) network first malfunctioned on May 11 for about 25 minutes, it again faulted on May 12 for more than an hour. However, the Ethereum (ETH) network did not suffer a total outage, and only the block-finalizing process was hampered. Although the exact cause of the network outage has not been revealed yet, the investors have become jittery about Ethereum’s (ETH) capacity. These bearish sentiments have negatively influenced the price movement of Ethereum (ETH). Notably, Ethereum’s (ETH) market value has plummeted by 15% in the past month. As a result, Ethereum (ETH) is currently trading at $1,804.95.\n\nTradecurve (TCRV) Leads The Market With 5000% Growth Projection\n\nTradecurve is a perfect blend of Centralized and Decentralized trading exchanges. It allows users to trade cryptocurrencies as well as traditional investment instruments, including forex, ETFs, equities, commodities, OTC derivatives, and bonds.\n\nTradecurve’s platform traders’ anonymity, and does not make them go through the arduous KYC verification process. This is in stark contrast to platforms like OKB, Robin Hood App, Kraken, Bittrex, Huobi, and others, which mandate users to disclose their personal data. On the platform, everything is built on-chain to ensure the highest level of security. Traders just need to connect their wallets, deposit any cryptocurrency to use as collateral, and begin trading.\n\nThe native utility token of Tradecurve is $TCRV, this token powers the entire Tradecurve ecosystem and provide holders with a multitude of benefits including; automated trading, copy trading, access to trading academies via the metaverse, staking to generate a passive income, VIP account status, lower subscription and trading fees.\n\nTradecurve’s native utility token $TCRV has also been audited by Cyber Scope, whilst a team KYC was carried out by AssureDeFi further providing security and transparency to investors. Currently in it’s second stage pressle $TCRV is trading at $0.012, analysts predict that Tradecurve will surge 40x-50x once the token launches, providing investors and traders with a unique opportunity to generate fast profits from a transparent crypto project.\n\nFor more information regarding Tradecurve’s presale see links below:\n\nWebsite: https://tradecurve.io/\n\nBuy presale: https://app.tradecurve.io/sign-up\n\nTwitter: https://twitter.com/Tradecurveapp\n\nTelegram: https://t.me/tradecurve_official\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0LzI1LW1pbi1ldGhlcmV1bS1jb2xkLXdhbGxldC1pc3N1ZS1wZWVrcy1icmllZmx5LWFzLWJpZy1leWVzLWNvaW5zLXN0YWdlLTMtcHJpY2UtcmV0dXJucy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "25-Min Ethereum Cold Wallet Issue Peeks Briefly As Big Eyes Coin's Stage 3 Price Returns - Analytics Insight",
        "content": "On May 11, panic filled the air as the Ethereum mainnet pressed pause for about 25 minutes. Though brief, it left users and developers on the edge of their virtual seats. Amidst the brief chill, Big Eyes Coin emerges with a mischievous wink. The Big Eyes team has unveiled a delightful surprise for their devoted token holders: the return of its affordable $0.00017 price from Stage 3!\n\nEthereum’s Mainnet Briefly Froze For 25 Minutes!\n\nThe Ethereum mainnet, Beacon Chain, unexpectedly decided to take a breather on Friday. During this time, blocks were in the process but failed to go through. Users and developers were on edge, afraid of the risk of transactions being altered due to the issue.\n\nEthereum core developers swiftly took to the Twitterverse to announce that the blockchain wasn’t finalizing. After about 25 minutes, the Ethereum mainnet was finalizing blocks again. A clear reason behind the malfunction is still unknown.\n\nThe Beacon Chain is Ethereum’s original proof-of-stake blockchain, officially breaking ground on September 15, 2022.\n\nEthereum’s Enduring Popularity\n\nA similar issue to the recent mainnet crash arose on March 15, causing a delay in the Goerli Testnet version of Ethereum’s “Shapella” upgrade. However, the upgrade was successfully executed on the mainnet on April 12.\n\nDespite this, and a few other mishaps before this, how is Ethereum still so popular? Simple: Ethereum has the network effect and first-mover advantage hallmarks in its arsenal. The network effect essentially ensures Ethereum’s power as more cryptocurrency firms use its blockchain and follow its smart contract protocols. Meanwhile, the first-mover advantage refers to Ethereum’s edge by being the first to introduce a programmable blockchain that enables the development of decentralized applications (DApps) and smart contracts.\n\nBig Eyes Coin — Ethereum-Based Crypto\n\nEthereum has been the shining savior of crypto startups, including Big Eyes Coin. This decentralized meme project uses the Ethereum Request for Comment 20 (ERC-20) protocol, which solidifies its stance in the crypto industry, where it can promote affordability, transparency, and interoperability on its own.\n\nWhat is Big Eyes Coin?\n\nBig Eyes Coin (BIG), the emerging Ethereum-based meme project, has been hitting big goals since its first presale. Now on its 13th one, the BIG presale funds are at about $36.8 million. Due to this exceptional milestone and the plea of its community, Big Eyes Coin will officially close its presale journey on June 3! Less than a fortnight from that, this meme project will launch on Uniswap on June 15, 2023.\n\nIn a bold move to cement its position as more than just a passing meme coin, Big Eyes Coin reveals that it will launch its own Online Casino and Play-to-Earn (P2E) Games, scheduled for August 29, 2023. This groundbreaking initiative allows users to convert their crypto assets into Big Eyes tokens and enjoy an extensive selection of over 4,000 thrilling games.\n\nAnd, just recently, it announced that token holders can now trade and invest in BIG for only $0.00017. This generous offer lets users enjoy $BIG at a lower price!\n\nEthereum is an incredibly powerful cryptocurrency that houses a library of digital assets. But, as evidenced by its mainnet issue, it is not without challenges. Nevertheless, its slew of upgrades and potent community make it a powerful cryptocurrency. Inarguably, it helps lay a sturdy groundwork for platforms like Big Eyes Coin to soar high and unveil ingenious solutions to their cherished users.\n\nFor All Things Big Eyes Coin (BIG)\n\nPresale: https://buy.bigeyes.space/\n\nWebsite: https://bigeyes.space/\n\nTelegram: https://t.me/BIGEYESOFFICIAL\n\nInstagram: https://www.instagram.com/BigEyesCoin/\n\nTwitter: https://twitter.com/BigEyesCoin\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2hvdy10by10cmFuc2Zvcm0tcGh5c2ljYWwtYXJ0LWludG8tbmZ0LWFydC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "How To Transform Physical Art into NFT Art? - Analytics Insight",
        "content": "NFTs, or non-fungible tokens, are digital representations of unique and scarce assets that can be bought, sold, and traded on the blockchain. NFTs have become a popular way for artists to showcase and monetize their work and for collectors to own and appreciate digital art. But what if you have physical art that you want to turn into NFTs? How can you transform your paintings, sculptures, or drawings into digital assets that can be verified and valued on the blockchain?\n\nDigitize the artwork: Begin by digitizing the physical art using a high-resolution scanner or a professional photographer. Ensure that the digital image captures all the details and colors accurately.\n\nEdit and enhance the digital image: Use image editing software like Adobe Photoshop or GIMP to make any necessary adjustments to the digital image. This may include adjusting the brightness, contrast, and colors, and removing any imperfections or blemishes.\n\nChoose an NFT platform: Select a suitable NFT platform where you can mint and sell your NFTs. Popular NFT platforms include OpenSea, Rarible, SuperRare, and Foundation. Each platform has its guidelines and requirements, so familiarize yourself with the platform of your choice.\n\nSet up a digital wallet: Create a digital wallet compatible with the chosen NFT platform. Most NFT platforms operate on Ethereum, so you will need an Ethereum-compatible wallet like MetaMask or Trust Wallet. Follow the wallet provider’s instructions to set up and secure your wallet.\n\nMint the NFT: Once you have your digital wallet set up and connected to the NFT platform, you can proceed to mint your NFT. This typically involves providing details about the artwork, such as its title, and description, and attaching the digital image file. You may also set the desired price or choose an auction-style listing.\n\nPay the minting fees: Minting NFTs on most platforms requires paying a transaction fee, known as “gas fees,” in the native cryptocurrency (usually Ethereum). Confirm the transaction and pay the fees from your connected wallet. The fees cover the cost of storing the NFT on the blockchain.\n\nConfirm the minting process: Once the transaction is processed, the NFT will be minted and assigned a unique token ID on the blockchain. You’ll receive confirmation from the NFT platform, and the artwork will be publicly available for viewing and purchase.\n\nMarket and sell your NFT: Promote your NFT art through social media, art communities, and various online platforms. Utilize the features provided by the NFT platform, such as creating collections or participating in community events, to attract potential buyers. Engage with collectors and art enthusiasts to build interest in your NFT art."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmJpdGNvaW5zZW5zdXMuY29tL2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tZGFpbHktMTctbWF5LWZpbmFsbHktZXRoLWJlYXJpc2gtZmxhZy1wYXR0ZXJuLWlzLWluLXBsYXktdGltZS10by1zZWxsL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction Daily (17-May): Finally! ETH Bearish Flag Pattern is in Play. Time To Sell? - Bitcoinsensus",
        "content": "The ETH pattern we are tracking right now in the 15-minute timeframe is a bearish Flag Pattern.\n\nThe image above is a clear example of what a completed bearish Flag Pattern looks like. And in the coming days, we will be expecting the ETH price to begin to sell off as aggressively as this.\n\nIn this Ethereum analysis, we will be breaking down the key levels we are watching as well as the key resistance the ETH price must stay below for this bearish prediction to remain valid.\n\nNew KYC bonus campaign from Bybit! From now till 21st of May 2023\n\nSign up and fund your Bybit account with our Bybit link to get this offer!\n\nFor new Users: Deposit $100, complete your KYC, and get $40. For existing Users, who have not completed KYC yet: Have a balance of $50, complete your KYC and get $20\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nHas The ETH Sell-Off Started?\n\nFinally! ETH Bearish Flag Pattern is in Play. Time To Sell? watch this key resistance level in the 15-minute timeframe\n\nThe Ethereum price has confirmed the start of a bearish flag sell-off in the 15-minute timeframe.\n\nIf this pattern plays out, there is a very high probability that we might see a more than -8% drop in the value of Ethereum in the coming days.\n\nThis bearish move can easily push the Altcoin price back to the $1,733 previous support level or even lower. So for now, are very bearish on the Ethereum price and we are currently looking for a price sell-off.\n\nThe Key Resistance To Watch For!\n\nFinally! ETH Bearish Flag Pattern is in Play. Time To Sell? watch this key resistance level in the 15-minute timeframe\n\nThe most important key resistance for this Bearish Flag Pattern playing out right now is the $1,836 previous highs in the 15-minute timeframe.\n\nAs far as the ETH price can respect and continue to trade below this $1,836 price level, we will remain bearish on Ethereum.\n\nHowever, if the ETH price manages to break above this $1,836 resistance level in the 15-minute timeframe, this would invalidate our bearish flag pattern.\n\nSo for now, we are watching this $1,836 key resistance closely to see how the ETH price reacts to it and if it would hold strong in the coming days.\n\nFinal Verdict!\n\nThe Ethereum bearish flag pattern is in play right now in the 15-minute timeframe. This is a bearish indication for Ethereum and there is a very high probability that we see a more than -8% dump in the value of ETH sooner or later.\n\nHowever, for this bearish prediction to remain valid, we need to see the ETH price continue to respect and trade below the $1,836 key resistance level.\n\nA price break above this 15-minute key resistance invalidates our bearish flag pattern.\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nHow to Trade Bitcoin (BTC)?\n\nTo understand the basics of Bitcoin trading, you can read our How To Trade Bitcoin Guide. It can prove helpful for traders who are just getting started with Bitcoin trading. You can also check out our list of top Bitcoin Exchanges To Trade With.\n\nPrimeXBT Covesting: Trade Hassel Free\n\nSign-up on PrimeXBT today to trade Bitcoin hassle-free. You can copy experienced traders and access hundreds of different strategies on the platform! Don’t forget to claim your 25% bonus by using the promo code “bitcoinsensus50” when you sign-up with our link PrimeXBT Covesting"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vYml0Y29pbi1hbmQtZXRoZXJldW0taGFyZHdhcmUtd2FsbGV0LWdpYW50LXJlbGVhc2VzLW5ldy11cGRhdGUtdGhhdC1taWdodC1leHBvc2Utc2VlZC1waHJhc2VzLWJld2FyZS1hbmQtc3RheS12aWdpbGFudC_SAZ8BaHR0cHM6Ly93d3cuY3J5cHRvLW5ld3MtZmxhc2guY29tL2JpdGNvaW4tYW5kLWV0aGVyZXVtLWhhcmR3YXJlLXdhbGxldC1naWFudC1yZWxlYXNlcy1uZXctdXBkYXRlLXRoYXQtbWlnaHQtZXhwb3NlLXNlZWQtcGhyYXNlcy1iZXdhcmUtYW5kLXN0YXktdmlnaWxhbnQvP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Hardware Wallet Giant Releases New Update That Might Expose Seed Phrases – Beware and Stay Vigilant! - Crypto News Flash",
        "content": "While the Ledger Recover is completely optional, the company noted that those who opt-in will have their key phrases stored by 3 different parties on cryptographically-secure Hardware Security Modules.\n\nThe community was outraged by the update since Ledger has in the past been compromised leading to phishing attacks on users.\n\nThe Ledger hardware wallet is under harsh scrutiny after enabling a software update that could leak crucial security data. In the latest firmware update dubbed version 2.2.1, the Paris-based company announced a new feature called Ledger Recover to ostensibly help users backup their seed phrases with a third party through an ID-based system.\n\nAvailable in several markets – including the European market, Canada, the United States, and the United Kingdom -the software update has been dubbed controversial as Ledger had previously marketed its services as a non-sharing private key platform.\n\nAs a result, most of the Ledger Wallet users have been outraged by the firmware update, which could cause losses of billions of dollars. The Ledger hardware wallet has in the past been compromised exposing crucial customers’ data. The Ledger data breach led to a phishing attack on the affected users.\n\nWith the latest update, which is touted as optional, most Ledger users are skeptical of storing high amounts of digital assets in fear of backdoor attacks. Furthermore, it is only a matter of time before the third party sees phrase recovery companies are compromised leading to losses in billions of dollars.\n\nOne Twitter user @oklahodl1 shared a video of a Ledger Nano X being destroyed after the firmware update announcement. Several similar videos have emerged on different social media platforms as Ledger users urge others to ditch the hardware wallet.\n\nLedger in Defense\n\nAfter a huge uproar by the crypto community, Ledger has defended the firmware upgrade stating that it is optional. According to Ledger CTO, Charles Guillemet, the company remains focused on self-custody and will never have or create a backdoor on users’ wallets.\n\nLedger Recover is an optional subscription for users who want a backup of their Secret Recovery Phrase. You don’t have to use it, and can continue managing your recovery phrase yourself if that’s why you bought a Ledger,\n\nFurthermore, Guillemet noted that the sharing of users’ secret key phrases happens in a secure channel to the three different companies. Notably, the encrypted fragments are stored by three different parties on cryptographically-secure Hardware Security Modules.\n\nIf you choose to subscribe, Ledger Recover encrypts a version of your private key and splits it into three fragments (using Shamir Secret Sharing) – all of this happens on the Secure Element chip, so your Secret Recovery Phrase is not at risk. — Ledger (@Ledger) May 16, 2023\n\nThe company has fragmented the key phrases into three different third parties to help strengthen self-custody. Furthermore, the individual encrypted fragments are completely useless since they cannot access a wallet without users’ verification. “When you want to restore your keys, 2 of these 3rd parties will send back their fragments to your Ledger device (and not us as an organization), which will be able to reconstitute your Secret Recovery Phrase,” Ledger added.\n\nThis article is provided for informational purposes only and is not intended as investment advice. The content does not constitute a recommendation to buy, sell, or hold any securities or financial instruments. Readers should conduct their own research and consult with financial advisors before making investment decisions. The information presented may not be current and could become outdated."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDUvMTcvY29pbmJhc2UtbGF1bmNoZXMtbGF5ZXJzd2FwLXprc3luYy1lcmEv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Coinbase launches Layerswap for zkSync Era - The Cryptonomist",
        "content": "With the new Layerswap solution, users of Coinbase and other leading crypto-exchanges will now be able to transfer funds to zkSync Era, the Layer-2 protocol that scales Ethereum with cutting-edge ZK technology.\n\nCoinbase, Kraken, KuCoin: traders can access zkSync Era thanks to Layerswap\n\nLayerswap announced its integration with zkSync Era, which will allow users to transfer funds from a variety of sources, including Coinbase, to zkSync Era in minutes.\n\nIn addition to Coinbase, Layerswap’s list of crypto-exchanges also includes KuCoin, Kraken, Binance.US, Huobi, Bittrex, Bitfinex, and others.\n\nHence, thanks to Layerswap’s new seamless solution, users will be able to make frictionless transfers of tokens such as ETH, USDC, LRC, from 17 exchanges to 16 networks, and transfers from 9 networks to CEXs, as well as cross-chain transfers.\n\nMoreover, with the new integration with zkSync Era, Layerswap aims to join the huge growth being experienced by the Layer 2 protocol scaling Ethereum with cutting-edge ZK technology.\n\nCoinbase and the connection to the zkSync Era ecosystem\n\nOverall, the zkSync Era project has been funded to the tune of $458 million by the Ethereum Foundation and other venture capitalists such as a16z, Dragonfly, Coinbase Ventures, Blockchain Capital, and others.\n\nSince its launch, zkSync Era has seen a huge surge in network activity, the highest that any Ethereum scaling solution has ever experienced in such a short period.\n\nAs Messari points out, zkSync Era’s growth in Q1 2023 was greater than even Polygon’s zkEVM in terms of TVL (or Total Value Locked in DeFi).\n\nIn the few weeks since the launch of@zksync's Era and @0xPolygon's zkEVM, the zkSync ecosystem has been growing at a rapid pace.\n\n\n\nAt the end of Q1, zkSync had nearly $200M in TVL across its ecosystem while Polygon’s zkEVM had seen little adoption in comparison. pic.twitter.com/FT5aGf1CQg — Messari (@MessariCrypto) May 14, 2023\n\nzkSync’s new Layer 2 scaling solution can scale Ethereum without compromising network security, offering fast, low-power transactions.\n\nNot only that, zkSync is also part of the rollup category, which are those blockchain innovations that allow a group of transactions that occur off-chain to be wrapped, validating only one transaction made in the main substrate.\n\nThe future airdrop of zkSync Era\n\nRecently, there has been an analysis of everything there is to know about a future airdrop of zkSync Era.\n\nFirst, it is worth mentioning that the zkSync technology was invented by Matter Labs, the company that set out to scale Ethereum through Zero-Knowledge proofs, so as to maintain the principles of freedom and decentralization.\n\nCurrently, there are two versions of zkSync, the 1.0 version called zkSync Lite and the 2.0 version called zkSync Era, which, unlike the former, offers the ability to implement smart contracts.\n\nThat said, in order to achieve a future airdrop of zkSync Era, it is deemed appropriate, for those who have not already done so, to transfer some of their ETH onto the two blockchains. Using MetaMask’s self-custodial crypto-wallet, it will be possible to transfer one’s ETH to zkSync Lite and zkSync Era."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3LmJsb2NremVpdC5jb20vaG93LWVpZ2VubGF5ZXItaXMtZ29pbmctdG8tcmV2b2x1dGlvbml6ZS1ibG9ja2NoYWluLXNlY3VyaXR5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "How EigenLayer Is Going To Revolutionize Blockchain Security - Blockzeit",
        "content": "Blockchain technology has transformed the way we conduct transactions online. With the rise of decentralized finance, the security of these networks has become more important than ever. Enter EigenLayer or Eigen, a restaking protocol that is poised to change the way we think about blockchain security.\n\nWe've led the $50M Series A financing of @eigenlayer!\n\n\n\nFounder @sreeramkannan is a technical visionary who's revolutionizing our ecosystem.\n\n\n\nMore on our thesis. ↓ pic.twitter.com/ozO9F8PbDw — Blockchain Capital (@blockchaincap) March 28, 2023\n\nWhat is EigenLayer?\n\nAccording to its maker, EigenLabs, EigenLayer is a blockchain utilizing a protocol based on the security-as-a-service (SECaaS) concept. It rehypothecates or puts back to work staked Ethereum to provide security for other, newer projects. This means that the Ethereum network is being used to secure other projects, providing an added layer of security to the entire blockchain ecosystem.\n\nHow Does EigenLayer Work?\n\nThe Ethereum network uses a proof-of-stake consensus mechanism to secure the network. This means that validators can join the network by staking 32 ETH and they can earn an ETH-denominated yield as a reward according to Decrypt. However, if a validator fails to do its job or behaves maliciously, it will be penalized, and a portion of its staked ETH will be taken away.\n\nEigenLayer goes beyond staking Ethereum by reusing staked ETH to enhance security for other blockchain projects. This also enables stakers who participate to earn a higher yield and benefit from the success of multiple projects. Likewise, it makes it more convenient for developers to deploy their projects with the confidence that they are backed by a secure and reliable network.\n\nFor added context, there’s a total of 20 million Ethereum staked right now to keep its blockchain secure. This involves the participation of over 625,000 validators. As of writing, a unit of ETH is trading over $1,800.\n\nStatus of EigenLayer\n\nAs of March this year, the team behind this platform, EigenLabs, has already raised $50 million in a Series A round. The funding round was facilitated by Blockchain Capital, which is a venture firm focused on the blockchain industry.\n\nThe new protocol was praised by none other than Joseph Lubin, the co-founder of Ethereum. In his tweet, he stated that the work that EigenLabs is doing now puts them at the forefront of the “most exciting work” happening in the Ethereum blockchain. Additionally, he expressed his support to Sreeram Kannan, the founder of EigenLayer, and the rest of the team behind the new platform.\n\nThe Eigen Labs team is at the forefront of some of the most exciting work happening in Ethereum. @etherealvc is proud to have supported @sreeramkannan and the @eigenlayer team since inception. https://t.co/WP6qu5rW5z — Joseph Lubin (@ethereumJoseph) March 29, 2023\n\nBenefits of Restaking Early with EigenLayer\n\nSo far, there’s no definite timeframe for the launch of the EigenLayer Mainnet, but there are indications that it’s drawing near. With that, EigenLabs promises the following benefits to those who choose to restake their ETH to EigenLayer before its launch:\n\n1. Secured Spot\n\nBy restaking early, users can secure their place within the EigenLayer ecosystem and gain an advantage over those who wait to restake. This can help them maximize their staking opportunities and potentially earn greater rewards over time.\n\n2. Skip the Withdrawal Queue\n\nNative restakers identified by their 0x00 prefixes get to bypass the withdrawal queue and directly connect their validators to EigenLayer’s contracts, which could potentially streamline the process of withdrawing staked tokens.\n\n3. Maximize Staking Opportunities\n\nIt allows users to enjoy the earliest possible access to restaking on services that launch on EigenLayer. Some services may cap their initial restake amounts, so restaking early can help early adopters to take advantage of these more flexible opportunities.\n\n4. Access to Premium Services\n\nThose who choose to restake early with EigenLayer can take advantage of a variety of exclusive benefits, including access to curated working groups with EigenLabs, operators, modules, and other restakers. This will enable them to stay informed about the latest developments and network with other important players in the EigenLayer ecosystem.\n\nFinal Thoughts\n\nEigenLayer is an innovative protocol that promises to revolutionize the blockchain industry. By utilizing a restaking mechanism, it aims to provide an added layer of security to the entire blockchain ecosystem.\n\nWith its promising benefits, such as a secured spot, skipping the withdrawal queue, maximizing staking opportunities, and accessing premium services, early restakers can enjoy greater rewards over time. As the EigenLayer Mainnet launch draws near, restaking early could prove to be increasingly advantageous.\n\nOverall, EigenLayer is a project to watch out for, and it could potentially transform the way we think about blockchain security."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiI2h0dHBzOi8vY29pbmxpYi5pby9lbi9uZXdzL0V0aGVyZXVt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 May 2023 19:31:40 GMT",
        "title": "Ethereum News - Coinlib",
        "content": "Personalized features ×\n\nYou need an account in order to star coins, keep track of your portfolio, set up alerts, vote on coins as well as use all the other advanced features."
    }
]