[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvZGVmaS9yZXN0YWtpbmctbGlrZS1haS1ldGhlcmV1bS10cmVuZC1uZXR3b3JrLXN0YWJpbGl0eS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 May 2023 07:00:00 GMT",
        "title": "'Treat restaking like AI': Ethereum's emerging trend sparks concerns about network stability - DLNews",
        "content": "Restaking is an upcoming blockchain feature that will allow users to double-stake their Ether on other protocols or even different chains.\n\nEthereum co-founder Vitalik Buterin has expressed concerns about restaking’s potential impacts on the network’s stability.\n\nEigenLayer, the company behind restaking, shares Buterin’s concerns and says its restaking models are safe.\n\nThe eagerly-awaited protocol of “restaking”, led by a company called EigenLayer, has stirred concerns over the practice’s potential impact on Ethereum’s stability. While EigenLayer says its restaking models will pose low risks, the company also acknowledges broader concerns surrounding the upcoming innovation.\n\nStaking is the practice of committing funds to secure the Ethereum network while earning rewards. Restaking is a novel “primitive” — a blockchain feature — that will allow users to recommit their staked Ether — using the so-called liquid staking tokens like Lido’s stETH — on other decentralised applications on Ethereum and other blockchains.\n\nBut in a recent post, Ethereum’s co-founder Vitalik Buterin has raised concerns about “overloading” Ethereum with complex and poorly-designed restaking models.\n\nNOW READ: Ether staking surge helps small players chip at Lido’s dominance: ‘A good thing’ for DeFi\n\nStay ahead of the game with our weekly newsletters Subscribe\n\n“We should [...] preserve the chain’s minimalism, support uses of restaking that do not look like slippery slopes to extending the role of Ethereum consensus” Buterin said in his post.\n\nRestaking as a fully-fledged protocol is currently being developed by US company EigenLayer, which raised $50 million in a Series A round in March. It has recently deployed the protocol on Ethereum’s testnet, the mock version of the blockchain.\n\nEthereum's total value locked, a metric for investor deposits in DeFi\n\nRestaking presents a tantalising prospect for investors, as it not only offers users Ethereum’s standard staking yields but also additional rewards upon restaking.\n\nIt can also open up opportunities for developers. Restaking allows for “easier creation of bridges, oracles and other services backed by the same primitives as staked Ether,” Marc-Thomas Arjoon, research associate at crypto asset management firm CoinShares, told DL News.\n\nJoin the community to get our latest stories and updates\n\n“A new blockchain can even tap into this marketplace instead of bootstrapping its own validator set, which is difficult and expensive,” Arjoon said.\n\nNOW READ: VanEck sees Ether soaring 27-fold to $51,000. Or, it could sink to $300\n\nBut there is also a growing concern that restaking could introduce significant risks.\n\nSpinning up new price oracles, bridges, and even chains that depend on the security of restaked Ether could potentially weaken Ethereum’s security. Any issue within one part of the system could cause a ripple effect on these added layers that are built on restaking, especially if they’re not meticulously designed.\n\n“I would advocate for EigenLayer to treat restaking like AI and develop a strong internal ‘alignment’ culture and team,” Justin Drake, a researcher at Ethereum Foundation, told DL News. Drake is one of the two researchers who reviewed Buterin’s post prior to publication.\n\n“Like AI, restaking has the potential to unlock awesome services and reshape the ecosystem. Also like AI, restaking likely introduces systemic risks that are hard yet essential to tackle.”\n\nEigenLayer’s founder Sreeram Kannan told DL News that he “fully agrees” with Drake’s assessment and said he’s “glad Vitalik is urging caution in restaking protocols so that the low-risk use cases are cultivated without going over to the high risk ones.”\n\nHigh risks of subjective slashing\n\nButerin’s primary concern, which he labels as “high risk”, revolves around the possibility that the deposits of restakers might be “slashed” if they breach the rules of another protocol. Such an event — if it impacts too many stakers — could have serious cascading effects on Ethereum.\n\n“Slashing” refers to taking away some Ether from validators who either act maliciously, like trying to cheat the system, or don’t do their job correctly, like being offline when they should be checking transactions. It’s a way Ethereum keeps its system safe by punishing those who don’t follow the rules.\n\nArjoon said that in cases of mass slashing, the security of the Ethereum network could be at jeopardy since stakers may be “force-exited due to having less than the minimum required,” which is 32 Ether.\n\nNOW READ: DeFi protocol in $3m scam was ‘Certik audited’\n\nSuch a mass exit would require a major action to mitigate the risks of reduced network security.\n\n“The risk of subjective slashing is that if the large group of other nodes lie, then honest stakers may be slashed. This may require forking of Ethereum to save honest nodes,” Kannan told DL News. Forking refers to creating a new version of the blockchain, which requires consensus of the Ethereum community.\n\nThe @eigenlayer trust flow: how does EigenLayer drive open innovation beyond the smart contract layer? pic.twitter.com/LviWZ7pCiZ — Brianna (bri.eth/acc) 🦇🔊 (@zkBri) May 25, 2023\n\nBut Kannan told DL News that EigenLayer doesn’t pose such high risks since “the set of use-cases we have been considering compatible for EigenLayer are all based on either objective attributability or no slashing.”\n\n“All of them will be low risk in Vitalik’s classification,” he said.\n\nEthereum’s social layer and ‘bailouts’\n\nIf the high risks come to pass, Buterin and others suggest, Ethereum’s community — social layer or layer 0 as it’s often called — may need to mobilise to address a major crisis, echoing past events — a situation that many would prefer not to see repeated.\n\nEthereum’s design as an open-source project affords its community a critical role in its governance and development through social consensus.\n\n“I see Vitalik’s post as an invitation for the community to recalibrate the cost-benefit analysis around the use of the social layer for application layer interventions,” Drake told DL News.\n\nSo the question is, how much of Ethereum’s social consensus — the people power — must be expended for technical troubles?\n\nThat question became especially relevant in the DAO hack in 2016, which saw $50 million in Ether stolen. The response efforts culminated in a hard fork — creating a new version of the Ethereum blockchain in which the hack was reversed.\n\nNOW READ: MakerDAO members set to approve controversial ‘whistleblower bounty’ to enforce anonymity\n\nMany view that move as a bailout because it intervened in what would otherwise have been the natural consequences of the hack, restoring funds to DAO token holders as if the hack had never occurred.\n\n“A bailout — as done for The DAO in 2016 — provides a one-off short-term relief,” Drake said. But avoiding such situations can benefit us more in the long run, as it builds trust and fairness, he added.\n\nThe DAO hack, and the subsequent action taken by leading Ethereum figures, led to a split in the Ethereum community, with those opposed to the hard fork continuing to support the original, un-forked chain, which came to be known as Ethereum Classic.\n\nEthereum Classic's total value locked, a metric for investor deposits in DeFi\n\nThere’s little appetite left among the community to engage in another bailout of that sort.\n\n“Social consensus is necessary to fix consensus bugs and vulnerabilities. It is also useful to incorporate consensus-layer innovations like proof-of-stake, EIP-1559, and dankscaling,” Drake told DL News.\n\n“Despite its necessity and utility, it is wise to minimise dependency on social consensus,” he said. “Indeed, social consensus is an expensive tool.”"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tYW5kLWV0aGVyZXVtLXR3by10aXRhbnMtYmF0dGxlLWZvci1uZnQtc3VwcmVtYWN5L9IBUmh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tYW5kLWV0aGVyZXVtLXR3by10aXRhbnMtYmF0dGxlLWZvci1uZnQtc3VwcmVtYWN5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 May 2023 07:00:00 GMT",
        "title": "Bitcoin and Ethereum: Two titans battle for NFT supremacy - Forkast News",
        "content": "This past weekend, two major cryptocurrency/non-fungible tokens events happened, Veecon Indianapolis 2023 and the BTC Miami/Ordinals Conference 2023.\n\nI chose to go to Indianapolis to meet my colleagues whom I’ve worked with for almost three years without meeting them in real life.\n\nAt one point, as I was walking back to the hotel on the streets of Indianapolis, it became apparent to me that there was a split in the NFT community. One was the “status quo” ETH-based community that’s in the pre-teen stage meeting up at Veecon, and the other was a newly birthed baby in Miami at BTC Miami/Ordinals 2023.\n\nAt Forkast Labs , we work on CryptoSlam.io to “unite the NFT community.” Ever since our co-founder Randy Wasinger added Loom (Sorare), Flow and WAX chains, alongside Ethereum in early 2021, we have always strived to include all new and relevant chains that we can.\n\nI also met loads of NFT industry celebs, including Richerd Chan from Manifold.xyz , who has created some of the most used Ethereum smart contracts in the NFT industry. He had actually reached out to me in 2020 through a client at the time and we had only talked online, but never met in person, and now he had so many folks around him that I could only briefly speak with him.\n\nAs an epic Ethereum NFT celebrity and developer, I decided to ask him a very telling question: “Are you developing for Bitcoin?”\n\nHis response made it clear that he wasn’t and had no intention of doing so at the moment. He posed a great question in return: “Is the BTC community even supporting Ordinals?”\n\nIt’s a great question, to be honest.\n\nIn Miami, it seems that the main theme revolves around the “laser-eyed maxis” who view Bitcoin as having a single use case: being “better money” and a store of value that shouldn’t be tampered with.\n\nOn the other hand, the new Ordinal crew, represented by individuals like @rodarmor , @TO , @LeonidasNFT and @udiwertheimer , are leading the charge on alternative use cases such as digital artifacts (NFTs) and BRC-20s, which are the bitcoin equivalent of fungible tokens like ETH and BTC.\n\nThe latest rankings on CryptoSlam.io show that $OXBT and $ORDI are in the top 10, indicating the rapid rise of Bitcoin in the scene.\n\nPersonally, I have never seen an ecosystem boot up this fast, except for NFTs in 2020-2021, and I would argue that it’s even moving faster this time around.\n\nThe Bitcoin market cap of over US$500 billion is more than double the Ethereum currency market cap of over US$200 billion. The Bitcoin protocol may be better suited to certain types of NFTs, ones that see immutability and scarcity as features instead of weaknesses.\n\nFundamentally, there is a big difference forming between what we are seeing on ETH and what we are seeing on BTC. The community is splitting into people who value UX, and corporate partners and one who values ultimate security/scarcity and immutability. While I think there are strengths to each, there IS a place for both.\n\nNet new people are coming into the “NFT” ecosystem, even if they will only trade Ordinals on BTC or BRC-20s, and they are really small in numbers, they are net new people. What will happen when the Michael Saylors of the world see the value in Ordinal theory, and its burgeoning use cases on BTC?\n\nSaylor talks about why Ordinals & Inscriptions are an important conversation, saying 👇\n\n\n\n\"If I were to discourage application development, I would be destroying the Bitcoin mining network.\" pic.twitter.com/i2xAayWREz — trevor.btc @ NYC (@TO) May 21, 2023\n\nThe NFT ecosystem, while can be seen as splitting, is actually growing and innovating, and while Taylor Swift fans are not coming in en masse, the core set of people who see the future of this technology is more excited about the growth of this industry than ever before."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vbGVhcm4uYnliaXQuY29tL2FsdGNvaW5zL2xpdGVjb2luLXZzLWJpdGNvaW4tdnMtZXRoZXJldW0tZGlmZmVyZW5jZXMtY29tcGFyaXNvbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 May 2023 07:00:00 GMT",
        "title": "Litecoin vs. Bitcoin vs. Ethereum: What are the Differences? - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA1LzI4LzUxMDAwLWV0aGVyZXVtLWV0aC1ub3ctb24tdGhlLXRhYmxlLWFjY29yZGluZy10by12YW5lY2staGVyZXMtdGhlaXItb3V0bG9vay_SAXFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNS8yOC81MTAwMC1ldGhlcmV1bS1ldGgtbm93LW9uLXRoZS10YWJsZS1hY2NvcmRpbmctdG8tdmFuZWNrLWhlcmVzLXRoZWlyLW91dGxvb2svYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 May 2023 07:00:00 GMT",
        "title": "$51,000 Ethereum (ETH) Now on the Table, According to VanEck – Here’s Their Outlook - The Daily Hodl",
        "content": "Global investment manager VanEck says Ethereum (ETH) could hit $51,000 in less than seven years if certain conditions align.\n\nIn a new research report, VanEck lays out its base, bear and bull cases for Ethereum’s performance going into the end of the decade.\n\nVanEck explains its methodology in finding its estimates:\n\n“We base these estimates on the thesis that Ethereum becomes the dominant open-source global settlement network that hosts substantial portions of the commercial activity of business sectors with the highest potential to gain from moving their business functions to public blockchains. In a portfolio of similar smart contract platforms, we assume to own a collection of call options, with the dominant platform likely to take a majority market share.”\n\nAssuming that Ethereum is no longer the top settlement system or smart contract platform with only 15% dominance, VanEck says ETH could disintegrate as low as $343.29 by 2030 in its bear case.\n\nHowever, if things go well for Ethereum, VanEck lays out a base case price target of $11,848.62 and a bull case of $51,006.\n\nThe firm says that Ethereum is likely en route to becoming a store-of-value asset, similar to Bitcoin but perhaps in a slightly different manner.\n\n“Finally, we assert that ETH is evolving beyond a transactional currency or a consumable commodity like oil or natural gas. We believe that ETH, while not a complete store of value like Bitcoin due to Ethereum’s demonstrated mutability of code and an evolving social consensus focused on utility, will nevertheless become a store-of-value asset for state actors looking to maximize human capital (vs. Bitcoin, which maximizes for stranded energy).”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiMmh0dHBzOi8vd3d3Lm9reC5jb20vbGVhcm4vZXRoZXJldW0tZGlmZmljdWx0eS1ib21i0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 May 2023 07:00:00 GMT",
        "title": "What's Ethereum Difficulty Bomb? - OKX",
        "content": "Vitalik Buterin, the mastermind behind Ethereum, envisioned a genuinely decentralized global computer for everyday use using blockchain technology. Inspired by the Bitcoin network but seeing its limitations, he created Ethereum. Buterin built the Ethereum blockchain with a ticking time explosive called the Ethereum Difficulty Bomb.\n\nThere are many stages in the roadmap to building a supercomputer. Even though the end goal is clear, sometimes, Ethereum developers need to develop new tech from scratch to advance to the next stage. The Ethereum Difficulty Bomb was an internal mechanism to encourage ETH core developers to push through to the Merge. The Merge is where Ethereum finally progressed from a proof of work (POW) consensus mechanism to proof of stake (POS). This article explains the Ethereum Difficulty Bomb, how it benefitted the ETH blockchain, and the future of Ethereum upgrades post the Merge. But before we dive into our main topic, we need to cover the origins of Ethereum.\n\nOrigins of the Ethereum blockchain\n\nIn 2013, Buterin launched the Ethereum whitepaper. He proposed an alternative blockchain to Bitcoin that goes beyond transaction-only capabilities. Branding Ethereum as the first ¨altcoin¨. From conception to launching the genesis block took two years. Ethereum officially launched in July 2015.\n\nIn between, the project attracted a series of crypto legends to the founding team. One was Charles Hoskinskins, who served as a Chief Executive before leaving in 2014 to start Cardano (ADA). Another was Gavin Wood, who served as the Chief Technology Officer for the Ethereum network. Gavin left Ethereum in 2016 to start Polkadot (DOT).\n\nWhile the above may describe some interpersonal issues between the founding forefathers of Ethereum, the network's blockchain also faced technical issues.\n\nProblems with Ethereum 1.0 network\n\nThe first version of the Ethereum design was similar to Bitcoin, except that it could execute smart contracts. The network used PoW consensus mechanisms to validate transactions. Proof of work consensus mechanics is energy intensive and requires a lot of hash rate to process transactions. The network soon ran into several scaling issues as it gained popularity.\n\nIn its initial simplistic design, the Ethereum mainnet nearly buckled under the pressure. Enthusiastic users piled on smart contract activities such as initial coin offerings (ICOs), decentralized finance (DeFi) platforms, and NFTs, which led to significant network congestion.\n\nTwo years later, by the end of 2017, Ethereum faced the following challenges: High gas fees, Low transactions per second (TPS), and high energy consumption (see the chart below). These challenges in scaling the Ethereum blockchain bring us to the discussion of our main topic.\n\nThe Ethereum difficulty bomb\n\nReturning to the vision of building a global supercomputer, the cofounders of Ethereum anticipated the challenges the network would face when onboarding more users. By folly or ingenuity, they ingrained the Ethereum Difficulty Bomb protocol in block no.200000 of the network.\n\nThe Ethereum difficulty bomb had the sole purpose of exponentially increasing the difficulty of mining Ethereum. Since proof of work requires solving computational puzzles to process transactions, the difficulty bomb protocol would make these puzzles nearly impossible.\n\nEthereum developers engineered the protocol so that mining a block would eventually become too expensive and consume so much energy that no one would want to mine it. Hence bringing forth the Ethereum' ice-age. The idea was to start a chain reaction that would accelerate the developers to speed up the network's transition to proof of stake.\n\nWhile this may seem counterintuitive at first glance, triggering the difficulty bomb presented several benefits for the network.\n\nBenefits of the Ethereum difficulty bomb\n\nBesides purposefully lighting up a fire under Ethereum developers to speed up the transition to proof of stake, the difficulty bomb also had the following intended consequences:\n\nIncreasing the difficulty in solving puzzles encouraged cryptocurrency miners to move away from energy-intensive proof of work consensus mechanisms.\n\nIt also discouraged Ethereum blockchain forks. As a result of puzzles ultimately becoming impossible to solve, no miner could profitably continue using the proof of work network once the whole blockchain had transitioned to proof of stake.\n\nUltimately, the protocol sped up the transition process, forcing miners to upgrade their nodes on time. However, achieving the feat required overcoming a few hurdles.\n\nDelaying the Ethereum difficulty bomb\n\nTransitioning to proof of stake took Ethereum a total of seven years to achieve. According to its initial set-up, around September 2015, at block 200,000, the difficulty bomb triggered, increasing the difficulty exponentially. However, its effects only became apparent about a year later, in November 2017.\n\nEthereum developers scrambled as the time frame to proof of stake narrowed. As proof of work mining became more complex, processing transaction fees on the network also required higher gas fees. Responding to the ETH communities’ complaints about expensive transaction fees, they conducted a series of updates which improved the network. These upgrades pushed back the date of the Merger and delayed the difficulty bomb.\n\nEthereum underwent a total of six upgrades, and they are as follows:\n\n2017: Byzantium update\n\nThe Byzantium hard fork implementation, made Ethereum lighter, faster, and more secure. Additionally, it created the framework for the eventual switch to the proof of stake consensus mechanism.\n\n2019: Constantinople update\n\nLike the Byzantium update, the Constantinople hard fork implementation increased efficiency and speed. It also lowered the gas fees on the network.\n\n2020: Muir Glacier update\n\nThe Muir Glacier network upgrade effectively delayed the difficulty bomb for another 4,000,000 blocks or approximately 611 days, buying Ethereum developers another year.\n\n2021: London update\n\nThe London Hard Fork introduced new improvements to the network. Similarly to the Byzantium and Constantinople upgrades, its purpose was to make some preparations before the release of Ethereum 2.0.\n\n2021: Arrow Glacier update\n\nArrow Glacier delayed the network's difficulty bomb, allowing developers more time to prepare Ethereum 2.0.\n\n2022: Gray Glacier\n\nThe Gray Glacier was the last delay. Its sole purpose was to postpone the bomb's detonation by another 100 days.\n\nThe Merge: transitioning from PoW to PoS\n\nIn September 2022, the much-anticipated event of transitioning from proof of work to a proof of stake network finally occurred. ETH developers successfully brought about the new version of Ethereum, also referred to as Ethereum 2.0. Ethereum 2.0 uses proof of stake consensus mechanisms to validate transactions.\n\nThe staking process entails locking up 32 Ethereum tokens in return for participating in the network's consensus and validation measures. Users who stake their tokens are known as validators and receive rewards through fees paid in ETH.\n\nThe transition could not have come at a better time, as the focus on global climate change intensified. By doing away with the proof of work consensus mechanism, Ethereum 2.0 will result in a 99.95% reduction in Ethereum's energy consumption. The transition to proof of stake also removed the need for the Ethereum difficulty bomb, as computational power is no longer needed to process transactions.\n\nThe Ethereum Merge was a huge stepping stone for the Ethereum blockchain to become the supercomputer that Buterin imagined. But while it accomplished a lot, it is only the beginning of the blockchain's roadmap.\n\nFuture of Ethereum upgrades\n\nSo now that the Ethereum blockchain is free from the existential threat of the difficulty bomb, what comes next post-Merge? Last year, Buterin commented that the network would only be 55% completed after the Merger. He also shared the roadmap for the upcoming upgrades that stand in the way of the blockchain becoming the first global supercomputer. They are as follows:\n\nThe Shanghai upgrade\n\nThe Shanghai upgrade’s most notable change is to allow validators to withdraw their staked ETH tokens. It will also upgrade some network parts to improve scaling, efficiency and speed. Speculators predict that this event could prompt a mass liquidation or lead to a surge in new users.\n\nThe Surge\n\nAfter the Shanghai upgrade, the Surge will occur. It entails implementing ¨sharding¨. Sharding is splitting the blockchain into smaller chains called shards. The upgrade will improve the network’s scalability, gas costs, and transaction speeds.\n\nThe Verge\n\nAfter the Surge, the Verge will occur. The Verge upgrade aims to optimise storage on the Ethereum blockchain. It will implement ¨Verkle Trees¨, a structure that seeks to reduce the amount of data network validators must keep on their machines. Ultimately, this will also help make Ethereum more scalable.\n\nThe Purge\n\nAfter the Verge, the Purge will occur. As implied by its name, this upgrade will help ¨purge¨ or reduce the space required to store ETH on a hard drive. This stage aims to support freeing up space so more developers can easily build on the blockchain.\n\nThe Scourge\n\nAfter the Purge, the Scourge will occur. The Scourge is aimed at providing censorship resistance and avoiding centralisation. The upgrade will ensure reliable and fair credibility-neutral transaction inclusion on the Ethereum blockchain.\n\nThe Splurge\n\nFinally, the Splurge will occur. This upgrade will comprise a series of smaller updates to ensure the Ethereum network functions properly after the previous four significant updates. It will combine several upgrade suggestions that didn't fit the other upgrades and put the finishing touches on the plan for enhancing the blockchain.\n\nThe new Ethereum\n\nIn the last few years, Ethereum has upgraded its blockchain multiple times. Protocols that used to plague the network, such as the Ethereum difficulty bomb, are no longer relevant in the new network. With all of these upgrades, Buterin says that Ethereum will be able to process 100,000 transactions per second (TPS).\n\nThat will put Ethereum miles ahead of Visa and Mastercard, which can only process around 24000 TPS and 5000 TPS. As of now, there’s no concrete schedule for these upgrades, but we can expect completion by about 2025.\n\nFAQs\n\nWhy is ETH difficulty increasing?\n\nETH difficulty has stopped increasing. Since the Ethereum blockchain moved from POW to POS in 2022, the difficulty rate has remained 1.00.\n\nWhat is the Ethereum difficulty bomb?\n\nThe Ethereum difficulty bomb is a protocol ingrained in the blockchain’s network to exponentially increase the difficulty in mining ETH when using a proof of work mechanism. Its purpose was to speed up the network’s transition to proof of stake and discourage the forking of the network.\n\nWhy Ethereum needed a difficulty bomb?\n\nEthereum needed a difficulty bomb for several reasons, but the main one was to force miners to switch over to proof of stake by disincentivising the proof of work mechanism.\n\nWhat is the use of a difficulty bomb?\n\nIn the Ethereum network, the difficulty bomb was programmed to increase mining difficulty starting at block 200,000. It increased the block time necessary for completing puzzle solutions. It also caused lower ETH payouts for proof of work miners."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vZGVjcnlwdC5jby8xNDI2MjcvdGhpcy13ZWVrLWluLWNvaW5zLWJpdGNvaW4tZXRoZXJldW0tZm91cnRoLWZsYXQtd2Vlay10cm9uLXRldGhlci1zdXJnZdIBZmh0dHBzOi8vZGVjcnlwdC5jby8xNDI2MjcvdGhpcy13ZWVrLWluLWNvaW5zLWJpdGNvaW4tZXRoZXJldW0tZm91cnRoLWZsYXQtd2Vlay10cm9uLXRldGhlci1zdXJnZT9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 May 2023 07:00:00 GMT",
        "title": "This Week in Coins: Bitcoin and Ethereum See Fourth Flat Week as TRON and Tether Surge - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIt was the fourth consecutive week of flat prices. A generally slow news cycle meant that market leaders Bitcoin and Ethereum remained where they were last weekend.\n\nBitcoin depreciated a nominal 0.5% and currently trades at $26,815, while Ethereum rose 1% over the seven days and now enters the weekend at $1,829.\n\nOn Monday, an AI-generated photo depicting a fabricated explosion at the Pentagon briefly caused a selloff in stocks and Bitcoin.\n\nAD\n\nAD\n\nMarkets were decidedly flat across the board, with no top thirty cryptocurrency posting significant gains except TRON, which rallied 8% to $0.076778.\n\nTRON’s rally this week appears to have been driven by the climbing market capitalization of the U.S. dollar-pegged stablecoin Tether (USTD), as the latter inches towards overtaking its all-time high of $83.2 billion, set in May last year.\n\nAccording to CoinGecko, Tether may set a new high watermark any day now.\n\nTRON and USDT’s joint rally appears to be linked to the fact that the majority of USDT, approximately $46 billion, is issued on Tron, surpassing the $36 billion on Ethereum. Recent data shows a steep rise in USDT on the TRON network throughout 2023 so far.\n\nThe biggest losses among cryptocurrencies this week were posted by Internet Computer (ICP), which fell 6% to $4.88, and Lido DAO (LDO), which dropped 7.1% to $1.96.\n\nAD\n\nAD\n\nCoin politics\n\nCrypto is already a major talking point in Bitcoin-friendly Florida Governor Ron DeSantis’s campaign as he gets ready to run as the GOP’s candidate in next year’s U.S. presidential elections.\n\nDeSantis headlined an otherwise disastrous Twitter Spaces the day he announced his candidacy and told his host, Twitter/Tesla CEO Elon Musk, that Biden’s administration “[has] it out for Bitcoin, and if it continues for another four years, they’ll probably end up killing it.”\n\nOn Tuesday, The International Organization of Securities Commissions (IOSCO) released a report outlining policy recommendations for global crypto regulation as part of the public consultation process.\n\nIn a nod to the fall of FTX, the IOSCO recommendations warn regulators about crypto companies \"combining certain functions in a single legal entity or group of affiliated entities,” such as one entity running exchanges, trading firms, and custody businesses under one roof.\n\nOn Thursday, watchdog the European Systemic Risk Board (ESRB) released a report concluding that the industry’s economic impact is minimal, but advising vigilance and policymaking that monitors leveraged trading and the industry’s financial contagion risks.\n\nThat same day, the European Securities and Markets Authority (ESMA) and National Competent Authorities (NCAs) issued a statement saying that cryptocurrencies must be clearly labeled as unregulated and both investors and investment firms should understand the financial risks involved in trading them."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtcHJpY2UtYW5hbHlzaXMtZm9yLW1heS0yONIBOmh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtcHJpY2UtYW5hbHlzaXMtZm9yLW1heS0yOD9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 May 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Analysis for May 28 - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nBulls are holding the gained initiative, according to CoinMarketCap's ranking.\n\nAdvertisement\n\nTop coins by CoinMarketCap\n\nETH/USD\n\nEthereum (ETH) has gained less than Bitcoin (BTC), going up by 0.93%.\n\nImage by TradingView\n\nThe last day of the week has started with a price blast for Ethereum (ETH). At the moment, one should pay attention to the recently formed resistance at $1,860.\n\nIf closure happens near it, there is a chance to see a breakout followed by a further rise to the $1,880 zone.\n\nImage by TradingView\n\nOn the daily time frame, the price of Ethereum (ETH) keeps trading sideways, accumulating power for a further sharp move. A continued rise is only possible if the candle fixes above the important zone of $1,880.\n\nImage by TradingView\n\nOn the bigger chart, the price has consolidated above the support level at $1,737. If the situation does not change by the end of the day, one can expect a test of the $2,000 mark by mid-June.\n\nEthereum is trading at $1,844 at press time."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS13aWxsLWxpcXVpZGF0aW9ucy1tYWtlLTIwMDAtYS1waXBlLWRyZWFtL9IBTGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS13aWxsLWxpcXVpZGF0aW9ucy1tYWtlLTIwMDAtYS1waXBlLWRyZWFtL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 May 2023 07:00:00 GMT",
        "title": "Ethereum: Will liquidations make $2000 a pipe dream - AMBCrypto News",
        "content": "Ethereum’s long positions face record-high liquidations, surpassing $58 million in May.\n\nDespite a slight price increase, Ethereum remains in a bearish trend around the $1,830 price range.\n\nEthereum’s [ETH] price has been trapped within the $1,800 price range for quite some time, but lately, we’ve witnessed a glimmer of hope with a modest surge. Unfortunately, even this slight upward movement hasn’t proven sufficient to safeguard certain traders’ positions from being forcefully liquidated.\n\nRead Ethereum’s [ETH] Price Prediction 2023-24\n\nEthereum long liquidations hit monthly high\n\nGlassnode Alerts reported that the Mean Liquidated Volume in Ethereum Futures Contracts’ Long Positions peaked on 27 May. According to the observed chart, the average amount of Ethereum Futures Long Liquidations exceeded 32,000 ETH, equivalent to over $58 million at the press time valuation. This made it one of the highest ETH Futures Liquidations in May.\n\nIn futures contracts, the mean liquidated volume signifies the average number of contracts forcefully closed or liquidated due to traders’ inability to fulfill margin requirements. When engaging in long positions for Ethereum futures contracts, traders are speculating on the price of ETH increasing.\n\nHowever, if ETH falls below a specific threshold, traders’ accounts may lack sufficient funds to cover the losses, resulting in the unfortunate event of liquidation.\n\nEthereum’s 24-hour liquidation map\n\nExamining the Ethereum liquidation within a 24-hour timeframe revealed a notable amount of liquidation activity. According to CoinGlass, ETH experienced liquidations totaling $8.42 million in the past 24 hours.\n\nFurther analysis indicated that long positions witnessed liquidations amounting to $2.48 million, whereas short positions faced liquidations totaling $5.94 million.\n\nAs of this writing, long positions accounted for over $600,000 in liquidations, while short positions stood at over $500,000. Taking a broader perspective by examining the ETH liquidation chart, it becomes evident that long positions experienced more liquidations in May when compared to short positions.\n\nHow much are 1,10,100 ETHs worth today?\n\nObserving price swings in a daily timeframe\n\nAnalyzing Ethereum’s daily timeframe chart revealed a 1.26% increase in value at the close of trade on May 26. As of this writing, Ethereum was trading around $1,830, exhibiting a minor upward trend of less than 1%. Although ETH remained within a bearish trend, it was showing signs of weakening due to the recent modest growth it has experienced.\n\nNotably, the Relative Strength Index (RSI) line indicated that ETH was approaching the threshold of transitioning to a bullish trend."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vY3J5cHRvdGlja2VyLmlvL2VuL2JyaWRnZS1hc3NldHMtZXRoZXJldW0tbWFpbm5ldC16a3N5bmMtZXJhL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 May 2023 07:00:00 GMT",
        "title": "How to Bridge Assets from Ethereum mainnet to zkSync Era? - CryptoTicker.io - Bitcoin Price, Ethereum Price & Crypto News",
        "content": "The Ethereum mainnet is a widely used blockchain network for a variety of decentralized applications. The mainnet, on the other hand, has been engulfed by problems such as high gas fees and slow transaction times. To address these issues, the zkSync Era network was developed as a layer 2 solution that provides faster and less expensive transactions. This article will go over how to bridge assets from the Ethereum mainnet to the zkSync Era network.\n\nWhat is zkSync Era?\n\nZkSync Era is an Ethereum Layer-2 scaling solution that employs zero-knowledge (ZK) proofs to achieve high throughput and low fees. It is a general-purpose zk-rollup platform with virtually full EVM compatibility implemented in its zk-friendly proprietary virtual machine. It employs standard Web3 API and retains important EVM capabilities like as smart contract composability while offering novel notions such as native account abstraction.\n\nBecause it is the first public release of an EVM-compatible rollup protected by zero-knowledge proofs, ZKSync Era is a huge step when it comes to Ethereum scalability. Although ZKSync Era is still in its formative stages, it has the potential to become a major player in the Ethereum scaling ecosystem.\n\nWhat is the difference between zkSync and zkSync Era?\n\nBoth zkSync and zkSync Era are Layer 2 protocols that leverage zero-knowledge rollups to deliver scalable and low-cost Ethereum transactions. There are, however, some distinctions between the two:\n\nMatter Labs’ zkSync Era is a user-centric zk rollup platform, whereas zkSync is a ZK rollup protocol.\n\nWhile zkSync has been around since 2020, zkSync Era is already active on the Ethereum mainnet.\n\nzkSync Era is the first zkEVM-compatible protocol to hit mainnet, which means it supports smart contracts written in Solidity, Ethereum’s most popular programming language. zkSync also supports smart contracts, however, it is not intended particularly for the EVM.\n\nzkSync Era is designed to resemble Ethereum but with reduced costs. zkSync is similarly intended to minimize Ethereum’s congestion and scale its essential ideals to unlock the full potential of blockchain technology, but it is not intended to look and feel like Ethereum.\n\nzkSync Era is a layer 2 protocol that uses zero-knowledge cryptography to scale Ethereum’s security and values. zkSync is a layer 2 solution for exchanging Ether and ERC20 tokens that bills itself as an Ethereum scaling and privacy engine.\n\nBenefits of zkSync Era\n\nBefore we get into the process of bridging assets, let’s go over the advantages of using the zkSync Era network. The zkSync Era network is a layer 2 solution that uses zero-knowledge proofs to make transactions faster and cheaper.\n\nTransactions on the zkSync Era network frequently cost less than a penny in gas fees, making it an appealing option for users looking to save money on transactions. Furthermore, the zkSync Era network is more scalable than the Ethereum mainnet, supporting thousands of transactions per second.\n\nBridge Assets from Ethereum mainnet to zkSync Era: Choosing a Bridge\n\nA cross-chain bridge is required to connect assets from the Ethereum mainnet to the zkSync Era network. There are several bridges available. For example, Orbiter Finance is a decentralized exchange (DEX) that allows users to transfer ETH, USDC, USDT, and DAI to the zkSync network from Ethereum and other networks. Their platform provides quick and inexpensive cross-chain swaps and is one of the few DEXs that supports stablecoin transfers.\n\nHow to Bridge Assets from Ethereum mainnet to zkSync Era\n\nFollow these steps to bridge assets from the Ethereum mainnet to the zkSync Era network using Orbiter Finance:\n\nConnect your MetaMask wallet to the Orbiter Finance website.\n\nSelect the network to which you wish to send tokens (Ethereum, Polygon, Arbitrum, Loopring, Optimism, and ten more).\n\nChoose the token to bridge from your network to zkSync and enter the amount.\n\nExamine and approve the transaction.\n\nOther Options\n\nWhile Orbiter Finance is the most well-known zkSync cross-chain bridge, there are other options. The zkSync Era Bridge, for example, is an official bridge that enables users to transfer funds between the Ethereum mainnet and the zkSync Era network. Other DEXs, such as Synapse and Stargate, also provide traditional bridges.\n\nConclusion\n\nBridging assets from the Ethereum mainnet to the zkSync Era network is a straightforward process that can be accomplished with the help of a secure cross-chain DEX such as Orbiter Finance or any other. The zkSync Era network is faster and cheaper than the Ethereum mainnet, making it an appealing option for users looking to save money on transactions. You can easily bridge your assets to the zkSync Era network and reap its benefits by following the steps outlined in this how to bridge assets from Ethereum mainnet to zkSync Era article.\n\n\n\n\n\nYou might also like\n\nMore from Altcoin"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9hcmJpdHJ1bS1iYXNlZC1qaW1ib3MtcHJvdG9jb2wtaGFja2VkLWxvc2luZy03bS1pbi1ldGhlcmV1bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 May 2023 07:00:00 GMT",
        "title": "Arbitrum-based Jimbos Protocol hacked, losing $7.5M in Ether - Cointelegraph",
        "content": "Adding to the growing number of decentralized finance (DeFi) protocol hacks in the crypto industry, Jimbos Protocol is the latest to suffer an attack resulting in a significant loss of funds.\n\nAccording to blockchain security firm PeckShield, Jimbos Protocol — the liquidity protocol of the Arbitrum system — was hacked on the morning of May 28. The attack resulted in the loss of 4,000 Ether (ETH), worth approximately $7.5 million at the time.\n\nSpecifically, the attacker took advantage of the lack of slippage control on liquidity conversions. The protocol’s liquidity is invested in a price range that doesn’t need to be equal, creating a loophole where attackers can reverse swap orders for their own gain.\n\nAlthough launched less than 20 days ago, Jimbos Protocol aimed to address liquidity and volatile token prices through a new testing approach. However, the protocol’s mechanism was not adequately developed, leading to a logical vulnerability creating favorable conditions for attackers. As a consequence, the price of the underlying token, Jimbo (JIMBO), has plummeted by 40%.\n\nAccording to PeckShield’s findings, the attackers extracted 4,090 ETH from the Arbitrum network. Subsequently, they utilized the Stargate bridge and the Celer Network to transfer approximately 4,048 ETH from the Ethereum network.\n\nHacking incidents in DeFi protocols is not a novel phenomenon. While reports indicate a significant decline in the number of attacks compared with previous years, the community continues to be exposed to numerous exploits.\n\nRelated: The Sandbox CEO’s Twitter was hacked, used to promote alleged ‘airdrop’ scam\n\nDespite efforts to enhance security measures, the DeFi ecosystem grapples with the persistent challenge of safeguarding against potential vulnerabilities and unauthorized access. An example is the recent flash loan attack on the 0VIX protocol, resulting in a substantial loss of nearly $2 million.\n\nAnother recent noteworthy occurrence involved the hijacking of Tornado Cash, a prominent privacy-focused protocol. Unknown attackers successfully compromised the system and extracted significant quantities of Tornado Cash (TORN) tokens, leading to substantial financial losses.\n\nMagazine: Should crypto projects ever negotiate with hackers? Probably"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LnRyYWRpbmd2aWV3LmNvbS9jaGFydC9FVEhVU0RULzZBRjA5NXpDLVVzaW5nLU9uLUNoYWluLU1ldHJpY3MtZm9yLUV0aGVyZXVtLUFuYWx5c2lzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 May 2023 07:00:00 GMT",
        "title": "Using On-Chain Metrics for Ethereum Analysis for BINANCE:ETHUSDT by LeafAlgo - TradingView",
        "content": "The world of cryptocurrency is highly dynamic and ever-evolving, and Ethereum, with its smart contract capabilities and expansive ecosystem, has emerged as one of the leading platforms in the blockchain space. As traders and investors seek to navigate the volatile markets of cryptocurrencies, they rely on various tools and techniques for technical analysis to make informed decisions.One such powerful tool gaining prominence is the use of on-chain metrics, which provide valuable insights into the underlying fundamentals and behavior of a blockchain network. In the case of Ethereum, on-chain metrics offer a unique perspective on the network's activities and can be instrumental in understanding market dynamics.By harnessing the power of on-chain data, traders can access a wealth of information about Ethereum's network activity, user behavior, token dynamics, and decentralized finance (DeFi) ecosystem. This data can provide critical insights that supplement traditional price analysis, offering a more comprehensive view of the market and potentially uncovering new opportunities.For the purposes of this article, I will be using the “J1 Glassnode Metrics Toolkit” designed by Tradingview user Jmorgado89 ( www.tradingview.com/v/QBstirSI/ ).It is important to note that on-chain metrics serve as a complement to other technical analysis techniques and should not be used in isolation. By combining on-chain insights with traditional indicators and market trends, traders can enhance their understanding of Ethereum's price movements and make more informed trading decisions.On-chain metrics refer to the data and statistics derived from the activity happening directly on a blockchain network. These metrics provide valuable insights into various aspects of the network, including transaction volume, address activity, token circulation, smart contract interactions, and more. In the context of Ethereum, on-chain metrics offer a comprehensive view of the network's dynamics and can help traders gain a deeper understanding of market trends and sentiment.--: Transaction volume is one of the fundamental on-chain metrics that measures the total number of transactions occurring on the Ethereum network over a specific period. High transaction volume indicates increased network activity, which can be an indicator of market interest and demand for Ethereum and its associated tokens. Traders often monitor transaction volume to gauge the overall health and popularity of the network.--: Active addresses refer to the number of unique addresses that interact with the Ethereum network within a given timeframe, typically measured daily or monthly. Tracking active addresses can provide insights into the level of user participation and adoption of Ethereum. Higher numbers of active addresses suggest a vibrant ecosystem with increased user engagement, while a decline in active addresses may indicate a potential shift in market sentiment.--: Monitoring the growth of new addresses can offer insights into the adoption and expansion of the Ethereum ecosystem. Increasing numbers of new addresses suggest growing interest and participation, indicating a healthy network. On the other hand, a decline in the creation of new addresses may indicate reduced interest or potential challenges within the Ethereum community. By tracking and analyzing the trend of new addresses over time, traders can gain a better understanding of Ethereum's user base and make more informed decisions regarding market trends and potential investment opportunities.--: Token circulation refers to the movement of tokens within the Ethereum network. By analyzing the flow of tokens across different addresses, traders can gain insights into the buying and selling activity of specific tokens. Token circulation data can help identify trends, such as accumulation or distribution patterns, and provide indications of market sentiment and investor behavior.--: Another important on-chain metric used in Ethereum analysis is the Spent Output Profit Ratio (SOPR). SOPR is a metric that measures the profitability of coins being moved on the Ethereum blockchain. It is calculated by dividing the realized value of the coins being spent by the value at which they were last moved. SOPR is a valuable tool for understanding market sentiment and identifying potential trend reversals. When the SOPR is above 1, it indicates that coins are being sold at a profit, suggesting a higher probability of market participants taking profits and potentially leading to a market correction. Conversely, when the SOPR is below 1, it suggests that coins are being sold at a loss, which may indicate increased selling pressure and a potential market bottom.--: Ethereum is home to a thriving DeFi ecosystem, comprising various protocols and platforms that enable decentralized financial activities such as lending, borrowing, and yield farming. On-chain metrics specific to DeFi, such as total value locked (TVL) and protocol-specific metrics like borrowing and lending rates, can help traders assess the growth and activity within the DeFi space. Monitoring these metrics can provide insights into emerging trends and opportunities within the DeFi landscape.Understanding these on-chain metrics allows traders to go beyond traditional price analysis and gain a deeper understanding of Ethereum's underlying network dynamics. By monitoring these metrics, traders can identify trends, assess market sentiment, and potentially anticipate market movements before they are reflected in price data.Next, we will explore some of the popular tools and platforms that traders can utilize to access on-chain metrics and enhance their Ethereum analysis.--: Etherscan is one of the most widely used block explorers for Ethereum. It provides a user-friendly interface for exploring the Ethereum blockchain and accessing a wealth of on-chain data. Traders can use Etherscan to track transaction details, monitor smart contract interactions, view token transfers, and analyze other critical on-chain metrics. This can be accessed at ( etherscan.io/ ).--: Dune Analytics is a powerful data analytics platform specifically designed for Ethereum. It allows users to create custom queries and visualize on-chain data in the form of interactive dashboards. Traders can leverage Dune Analytics to explore on-chain metrics, build custom metrics, and gain deeper insights into Ethereum's ecosystem. This can be accessed at ( dune.com/browse/dashboards ).--: Glassnode is a comprehensive on-chain data analytics platform that provides insights into various blockchain networks, including Ethereum. It offers a wide range of on-chain metrics, including transaction volume, network activity, token flows, and more. Glassnode's advanced analytics and customizable charts enable traders to identify trends, track investor behavior, and make data-driven trading decisions. This can be accessed through a few scripts on Tradingview, including the one I have used for this article; otherwise, go to ( glassnode.com/ ).--: CoinGecko is a popular cryptocurrency data platform that provides on-chain metrics and market information for multiple cryptocurrencies, including Ethereum. Traders can access a wide range of on-chain data, including transaction volume, active addresses, token circulation, and DeFi metrics. CoinGecko's user-friendly interface and comprehensive data make it a valuable resource for analyzing Ethereum's on-chain activity. This can be accessed at ( www.coingecko.com/ ).--: Many trading platforms, such as Binance, Coinbase Pro, and Kraken, offer on-chain data and metrics alongside their trading services. These platforms provide access to real-time market data, including on-chain transaction information, network statistics, and token data. Traders can leverage these platforms to access on-chain metrics while executing their trades, allowing for a seamless integration of on-chain analysis with their trading activities.Now, let's discuss how to integrate these metrics into a comprehensive trading strategy to enhance decision-making and maximize trading effectiveness.--: On-chain metrics can provide valuable insights into the fundamental health and activity of the Ethereum network. By combining these metrics with traditional technical analysis tools such as chart patterns, trend lines, and indicators, traders can gain a holistic view of market dynamics. For example, by analyzing on-chain transaction volume alongside price trends, traders can identify potential price reversals or confirm the strength of a prevailing trend.--: On-chain metrics related to network activity, such as the number of active addresses, daily transaction volume, and gas usage, can provide insights into the overall demand and usage of the Ethereum network. Monitoring these metrics can help traders identify periods of increased network congestion or heightened user engagement, which may impact price movements and trading opportunities.-- Track Token Movements and Flows: On-chain metrics related to token movements and flows can offer valuable information about investor behavior and market sentiment. Traders can monitor metrics such as token circulation, large transactions, and token velocity to gauge the buying or selling pressure on specific tokens. Unusual token movements or significant changes in token velocity can signal potential market shifts and present trading opportunities.--: Ethereum has become a hub for decentralized finance applications, and on-chain metrics specific to DeFi can provide insights into the health and activity of this ecosystem. Traders can monitor metrics such as total value locked (TVL), lending and borrowing volumes, and liquidity pool sizes to identify trends and potential trading opportunities within the DeFi space.--: Incorporating on-chain metrics into risk management strategies is essential for prudent trading. Traders can use metrics such as gas prices and transaction confirmation times to optimize fee management and execution timing. By considering on-chain metrics alongside risk management principles, traders can better manage their exposure to market risks and protect their capital.--: The field of on-chain metrics is continually evolving, with new metrics and analysis techniques emerging over time. Traders should stay informed about the latest developments and research in this area to enhance their understanding and refine their trading strategies. Following reputable sources, participating in online communities, and engaging with other traders can provide valuable insights and foster continuous learning.In conclusion, incorporating on-chain metrics into a comprehensive trading strategy can provide traders with a deeper understanding of Ethereum's market dynamics and enhance decision-making. By combining on-chain metrics with technical analysis, monitoring network activity, tracking token movements, and considering DeFi metrics, traders can gain valuable insights and identify potential trading opportunities. Integrating on-chain metrics into risk management strategies further enhances trading effectiveness and helps protect capital.As with any trading strategy, it is important to practice proper risk management, thoroughly test strategies, and adapt to changing market conditions. By leveraging the power of on-chain metrics alongside other market indicators, traders can strive for more informed and profitable trading in the dynamic world of Ethereum."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMilQFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9ldGhlcmV1bS1ldGgtY291bGQtYmUtcmVwbGFjZWQtYnktbGl0ZWNvaW4tbHRjLWJ1dC1pbnZlc3RvcnMtcHJlZmVyLWNvbGxhdGVyYWwtbmV0d29yay1jb2x0LWZvci10aGUtYmlnZ2VzdC1yZXR1cm5zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 May 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Could Be Replaced by Litecoin (LTC), but Investors Prefer Collateral Network (COLT) for the Biggest ... - Analytics Insight",
        "content": "Ethereum (ETH) might be replaced by Litecoin (LTC). However, the Collateral Network (COLT) is gaining recognition due to its promise of high returns. This network is both emerging and innovative. With Collateral Network currently in phase one of its presale, investors are keen to participate in this exciting opportunity.\n\n>>BUY COLT TOKENS NOW<<\n\nLitecoin (LTC): Could It Replace Ethereum?\n\nLitecoin (LTC) has made considerable progress in the crypto world, with recent developments sparking interest among investors. As a faster and more scalable alternative to Bitcoin, Litecoin has long been considered a robust investment. The Litecoin foundation has many benefits. However, they face intense competition from other projects, like the Collateral Network (COLT) which is growing quickly.\n\nDespite its numerous advantages, The Litecoin foundation faces stiff competition from other projects in the market, such as the rapidly growing Collateral Network (COLT). While the Litecoin network has a loyal following, it remains uncertain whether it can genuinely unseat Ethereum as the go-to platform for developers and users or outshine the potential returns of Collateral Network (COLT).\n\nThat being said, Litecoin has been working diligently to stay ahead of the ethereum blockchain and other competition by improving its technology and forging partnerships with prominent players in the industry. These efforts are aimed at bolstering the Litecoin ecosystem and ensuring that it remains an attractive option for investors and users alike and grows market capitalization.\n\nEthereum’s (ETH) Latest Developments Could Solidify its Position\n\nEthereum (ETH) remains a dominant force in the cryptocurrency space, even as new challengers like Litecoin and Collateral Network emerge. Its latest developments, including the ongoing transition to Ethereum 2.0, promise increased growth, efficiency, and security, which could potentially solidify its position as the leading platform for smart contracts and decentralized applications.\n\nHowever, Ethereum is not without its challenges. High gas fees and network congestion issues have led some users to seek out alternatives like Litecoin and the promising Collateral Network. In response, the Ethereum network is working tirelessly to address these issues and maintain its largest cryptocurrency market dominance.\n\nFailure to address these issues could lead to a decrease in market share and a loss of popularity. Therefore, it is important for Ethereum to continue innovating and responding to the needs of its users in order to maintain its relevance and keep competitors like Litecoin (LTC) and Collateral Network (COLT) at bay. For those looking to invest in the future of Ethereum, now is the time to purchase COLT tokens before they become too expensive.\n\n>>BUY COLT TOKENS NOW<<\n\nCollateral Network (COLT): a Disruptive Lending Project\n\nCollateral Network (COLT) is an avant-garde decentralized finance (DeFi) platform that aspires to transform the lending industry. With its on-chain approach using smart contracts, the platform enables users to borrow cryptocurrency against their physical assets without intermediaries or cumbersome paperwork. This is the first and only lending protocol currently on the blockchain that is bringing off-chain assets onto the blockchain to utilize them in this manner.\n\nThese assets are then tokenized into tangible NFTs and then fractionalized. Lenders on the platform can then mint portions of the NFTs to provide funding for the borrower’s loan and get paid an agreed interest for doing so. This unique approach to asset-backed lending has generated a lot of excitement in the industry, prompting several crypto investors and blockchain enthusiasts to invest heavily in the platform.\n\nThe native token of Collateral Network is $COLT, and this token has dual tokenomics features. It serves as a governance token that gives holders the right to vote and participate in important decisions and updates regarding the network. Also, it is a utility token that will be used to perform transactions on the platform.\n\nCOLT is currently in stage 1 of its presale, and over 125 million tokens have already been sold. The price of COLT has been projected to increase by 3500% during its presale, reaching a price of $0.35. With these projections, industry experts have said now is the best time to buy into the Collateral Network ecosystem.\n\nFor more information on Collateral Network visit the website, join the presale or join the community for regular updates.\n\nFind out more about the Collateral Network presale here:\n\nWebsite: https://www.collateralnetwork.io/\n\nPresale: https://presale.collateralnetwork.io/register\n\nTelegram: https://t.me/collateralnwk\n\nTwitter: https://twitter.com/Collateralnwk\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMizQFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWluLWluZGlhLW1heS0yOC1jaGVjay1tYXJrZXQtY2FwLWJpdGNvaW4tZXRoZXJldW0tbWVyZ2UtZG9nZWNvaW4tc29sYW5hLWxpdGVjb2luLXJpcHBsZS14cnAtYmluYW5jZS10b2tlbi1xbnQtcHJpY2VzLWdhaW5lci1sb3Nlci0xNjA1MjY20gHRAWh0dHBzOi8vbmV3cy5hYnBsaXZlLmNvbS9idXNpbmVzcy9jcnlwdG8vY3J5cHRvY3VycmVuY3ktcHJpY2UtdG9kYXktaW4taW5kaWEtbWF5LTI4LWNoZWNrLW1hcmtldC1jYXAtYml0Y29pbi1ldGhlcmV1bS1tZXJnZS1kb2dlY29pbi1zb2xhbmEtbGl0ZWNvaW4tcmlwcGxlLXhycC1iaW5hbmNlLXRva2VuLXFudC1wcmljZXMtZ2FpbmVyLWxvc2VyLTE2MDUyNjYvYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 May 2023 07:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Remains Above $27,000 Mark As Neo Becomes Top Gainer - ABP Live",
        "content": "Bitcoin (BTC) and Ethereum (ETH) — two of the most valued crypto coins — managed to rise above the $27,000 and $18,00 marks, respectively, on early Sunday morning. Other popular altcoins — including the likes of Ripple (XRP), Solana (SOL) — landed in the positive as overall prices saw minor gains across the board. Neo (NEO) emerged to be the biggest gainer, seeing a 24-hour jump of over 11.53 percent. Render Token (RNDR), on the other hand, turned out to be the biggest loser.\n\nAt the time of writing, the global crypto market cap stood at $1.13 trillion, registering a 24-hour gain of 1.18 percent.\n\nBitcoin (BTC) price today\n\nBitcoin price stood at $27,146.92 seeing a 24-hour gain of 1.53 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 23.66 lakhs.\n\nEthereum (ETH) price today\n\nETH price stood at $1,847.67, marking a 24-hour gain of 0.80 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 1.60 lakhs.\n\nDogecoin (DOGE) price today\n\nDOGE registered a 24-hour gain of 2.21 percent as per CoinMarketCap data, currently priced at $0.07282. As per WazirX, Dogecoin price in India stood at Rs 6.3111.\n\nLitecoin (LTC) price today\n\nLitecoin saw a 24-hour gain of 2.21 percent. At the time of writing, it was trading at $89.79. LTC price in India stood at Rs 7,653.53.\n\nRipple (XRP) price today\n\nXRP price stood at $0.4734, seeing a 24-hour gain of 0.80 percent. As per WazirX, Ripple price stood at Rs 41.0101.\n\nSolana (SOL) price today\n\nSolana price stood at $20.42, marking a 24-hour gain of 4.96 percent. As per WazirX, SOL price in India stood at Rs 1,809.00.\n\nTop crypto gainers today (May 28)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nNeo (NEO)\n\nPrice: $10.88\n\n24-hour gain: 11.53 percent\n\nConflux (CFX)\n\nPrice: $0.3234\n\n24-hour gain: 6.44 percent\n\nVeChain (VET)\n\nPrice: $0.02039\n\n24-hour gain: 5.39 percent\n\nMask Network (MASK)\n\nPrice: $4.17\n\n24-hour gain: 5.33 percent\n\nSolana (SOL)\n\nPrice: $20.42\n\n24-hour gain: 4.98 percent\n\nTop crypto losers today (May 28)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nRender Token (RNDR)\n\nPrice: $2.66\n\n24-hour loss: 4.02 percent\n\nNexo (NEXO)\n\nPrice: $0.6662\n\n24-hour loss: 2.08 percent\n\nKlaytn (KLAY)\n\nPrice: $0.1874\n\n24-hour loss: 0.46 percent\n\nFlare (FLR)\n\nPrice: $0.02556\n\n24-hour loss: 0.34 percent\n\nImmutable (IMX)\n\nPrice: $0.7391\n\n24-hour loss: 0.23 percent\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tMjAyNS1jb2xsYXRlcmFsLW5ldHdvcmstcHJlZGljdGVkLXRvLXJpdmFsLWV0aC1pbi1ncm93dGgv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 May 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction 2025: Collateral Network Predicted To Rival ETH In Growth - Analytics Insight",
        "content": "Following its recent upgrade, analysts are extremely bullish on Ethereum’s (ETH) future. No project in the industry has as much influence as Ethereum, and now it’s easier than ever for investors to stake their Ether.\n\nWith this in mind, many investors believe that Ethereum could hit an all-time high by 2025. At the same time, Collateral Network (COLT) could rival Ethereum, with price predictions suggesting COLT tokens will surge by 3500% in the next six months.\n\n>>BUY COLT TOKENS NOW<<\n\nEthereum (ETH) Activity On the Rise But Its Price Crashes\n\nEthereum is used as the foundation for thousands of projects throughout the DeFi market. It’s a popular mining option, and its popularity among stakers has grown exponentially since the Shapella update. However, despite its recent success, Ethereum’s price has declined.\n\nAfter a temporary rally, Ethereum has decreased in value by 5.81%, with one Ethereum (ETH) trading at $1,776.33 at the time of writing. Additionally, Ethereum mining has become significantly less profitable.\n\nGiven the rising cost of electricity worldwide, miners’ profits have decreased, and smaller miners are beginning to make a loss. As a result, Ethereum mining could become monopolized, much like Bitcoin (BTC). While this could be bad for smaller miners, large mining operations will almost definitely capitalize.\n\nAs the DeFi market continues to expand, analysts believe that Ethereum will increase in value, potentially hitting an all-time high during the next bull market. However, given its high price, some investors may be unable to profit from this growth.\n\nCould Collateral Network (COLT) Offer Better Returns Than Ethereum?\n\nBy 2025 the crypto industry will have changed significantly, with more real-world applications than ever. One project that plans to pioneer this development is Collateral Network (COLT). Collateral Network is currently in stage one of its presale and has a long-term roadmap designed to disrupt the trillion-dollar lending industry.\n\nWith industry experience in both DeFi and lending, the Collateral Network development team spotted a huge gap in the market. Most lending processes are outdated, and few institutions will let individuals take loans against their assets. This forces individuals to sell their assets, often at below-market rates. Collateral Network lets individuals unlock liquidity against their physical assets by bringing them on-chain as fractionalized NFTs.\n\nOnce minted, investors can buy NFT fractions to loan money to borrowers. As a lender, investors will earn an interest rate, which is paid out weekly until the borrower fully repays the loan. Not only is this process easier, but it prevents the need for excess paperwork and unnecessary credit checks.\n\nCollateral Network has been doxxed and audited to give investors peace of mind. Furthermore, security features such as 2FA are implemented on the platform to prevent any risk of a scam.\n\nIn the circumstance that a borrower defaults on their loan, their asset will be sold at a private auction to Collateral Network token holders, who will be able to purchase the asset at a below-market rate. This ensures lenders always recoup their investments.\n\nWith less than 35% of stage one’s tokens still available, Collateral Network is expected to sell out in the next two weeks, after which COLT tokens will increase in price to $0.0168. Furthermore, the price of the token is expected to increase up to $0.35 before the presale ends and surge by 100x once it hits major exchanges. Therefore, the best time to acquire COLT tokens is now.\n\nFor more information on Collateral Network, visit the website, join the presale, or join the community for regular updates.\n\nFind out more about the Collateral Network presale here:\n\nWebsite: https://www.collateralnetwork.io/\n\nPresale: https://presale.collateralnetwork.io/register\n\nTelegram: https://t.me/collateralnwk\n\nTwitter: https://twitter.com/Collateralnwk\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2J1aWxkaW5nLWEtc3Ryb25nLWNyeXB0by1wb3J0Zm9saW8tc3RhcnRzLXdpdGgtYml0Y29pbi1ldGhlcmV1bS1hbmQtYXZvcmFrLWFpL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 May 2023 07:00:00 GMT",
        "title": "Building a strong crypto portfolio starts with Bitcoin, Ethereum, and Avorak AI - Analytics Insight",
        "content": "In crypto, as is with any investment, it is important to diversify your portfolio. Several analysts suggest that building a strong crypto portfolio starts with Bitcoin (BTC), Ethereum (ETH), and Avorak AI (AVRK).\n\nWhy you should hold Bitcoin\n\nWith several banks collapsing and the FED raising interest rates, the traditional financial systems are clearly unstable, and this could lead to cryptocurrencies becoming increasingly popular. Bitcoin (BTC) is the largest and most valuable cryptocurrency by market cap. It is also the first-ever cryptocurrency and has already seen massive worldwide adoption. Bitcoin (BTC) has a maximum supply of 21 million, and more than 19 million are already in circulation. And by laws of demand and supply, BTC is expected to increase in value over time. Additionally, Bitcoin is nearly a year away from its halving event, which is usually a catalyst for a spike in its value.\n\nWhat’s next for Ethereum?\n\nAfter Ethereum’s recent Shapella upgrade, many in the crypto community wonder what is next for the world’s second-largest cryptocurrency. It can seem like Ethereum is always in a state of development, and that is because its team is working on what they call Ethereum 2.0. Opponents of Ethereum have often criticized the network’s scalability, pointing to its high transaction costs, slow speeds, and energy usage. Ethereum 2.0 aims to provide a more scalable network by offering safer, faster, cheaper, and more energy-efficient transactions. Analysts suggest that Ethereum’s developmental success could see its value increase significantly.\n\nAvorak AI (AVRK): Better for 100x\n\nAvorak is a new AI crypto project running on the BNB Smart Chain. The project includes a suite of AI products and services that can streamline human-led processes. For example, Avorak’s digital assistants and chatbots can enhance customer service by providing accurate and immediate answers to customers’ queries. The Avorak Trade bot can optimize the trading of any asset, including crypto, fiat, and stocks. The bot uses AI algorithms to analyze market trends, provide predictions on future prices, and find the best possible trades. The trade can be easily programmed to automate trades on multiple exchanges.\n\nAvorak’s suite of AI solutions can be used in many fields, including content creation, data analytics, online shopping, and security. AVRK is Avorak’s native utility token and functions as a credit for accessing the Avorak AI services. AVRK can be staked or traded on various centralized and decentralized exchanges once the project goes live. Avorak also distributes a share of its profits to AVRK holders through its revenue feedback system. There is a maximum supply of 40 million AVRK, and Avorak AI has burn mechanics that ensure continuous deflation of the AVRK token.\n\nEvery cryptocurrency investor seeks to find a 100X gem, that is, a coin that will skyrocket in value and turn a small investment into a fortune. Well, AVRK provides just that. Avorak has an ongoing ICO (initial coin offering) event, selling AVRK at a comparatively low price and offering a number of advantages to its investors. AI crypto is expected to generate substantial profits in 2023, and several analysts believe Avorak AI could lead this bull run once it’s launched.\n\nFor more information on Avorak AI:\n\nWebsite: https://avorak.ai\n\nBuy AVRK: https://invest.avorak.ai/register\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2Nhbi1ibG9ja2NoYWluLXRlY2hub2xvZ3ktYmUtdXNlZC1mb3ItcnVyYWwtZGV2ZWxvcG1lbnQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 May 2023 07:00:00 GMT",
        "title": "Can Blockchain Technology be Used for Rural Development? - Analytics Insight",
        "content": "Explore the impact of leveraging blockchain technology for empowering rural development\n\nIn recent years, blockchain technology has gained significant attention for its potential to revolutionize various sectors. While often associated with cryptocurrencies, the underlying technology offers much more. One promising application lies in rural development, where blockchain can empower marginalized communities by enhancing transparency, efficiency, and trust. This article explores the transformative potential of blockchain technology for rural development and presents a compelling example of its successful implementation.\n\nBlockchain for Transparent Land Governance:\n\nLand governance is a critical aspect of rural development, as it directly impacts access to resources and livelihoods. Unfortunately, many rural areas suffer from insecure land tenure systems, leading to disputes, corruption, and exclusion. Blockchain technology can address these challenges by providing transparent and immutable land registries. Through decentralized finance and tamper-proof databases, land ownership records can be securely stored, ensuring trust among stakeholders. For instance, Bitland, a blockchain-based land registry in Ghana, has successfully enabled small-scale farmers to secure their land rights, reducing disputes and unlocking access to credit and other development opportunities.\n\nEnhancing Supply Chain Management\n\nBlockchain technology can transform the supply chain management of agricultural products, benefiting both farmers and consumers. By creating a transparent and immutable record of every stage of the supply chain, from production to distribution, blockchain ensures that the quality and authenticity of products can be verified. This is particularly crucial for rural communities that heavily rely on agriculture as their primary source of income. For example, coffee farmers in remote regions can use blockchain to track the journey of their coffee beans, ensuring fair prices and minimizing the risk of fraud throughout the supply chain. This not only improves the farmers’ income but also assures consumers of the product’s origin and quality.\n\nSmart Contracts and Agricultural Insurance\n\nSmart contracts, powered by blockchain technology, enable the automation and execution of agreements without intermediaries. In the context of empowering rural development, smart contracts can streamline agricultural insurance processes. By using predefined conditions and triggers, smart contracts can automatically trigger insurance payouts when specific events, such as crop failure due to adverse weather conditions, occur. This eliminates the need for manual claims processing and reduces administrative costs, making agricultural insurance more accessible and affordable for farmers in rural areas. Such initiatives have the potential to safeguard farmers’ livelihoods and foster sustainable agricultural practices.\n\nFinancial Inclusion and Microfinance:\n\nAccess to financial services is a crucial driver of rural development, yet many rural communities lack formal banking infrastructure. Blockchain technology can facilitate financial inclusion by enabling secure and low-cost transactions without the need for traditional banks. By leveraging mobile devices and digital identities, blockchain-based platforms empower rural populations to access microfinance services, make payments, and build credit histories. The BanQu project in Kenya exemplifies this potential, offering a blockchain-based platform that enables smallholder farmers to create a verifiable economic identity, access loans, and improve their economic prospects.\n\nCase Study: Blockchain-based Supply Chain for Rwandan Coffee\n\nOne notable example of blockchain technology’s impact on rural development is the partnership between the Rwandan government, technology company Bext360, and the coffee industry. Through a blockchain-based supply chain platform, coffee farmers in Rwanda can trace the entire journey of their beans, from harvest to export. This has significantly improved transparency and accountability in the supply chain, ensuring fair prices for farmers and enhancing the reputation of Rwandan coffee in international markets. By directly connecting farmers to buyers and facilitating instant payments, blockchain technology has empowered rural coffee farmers, contributing to poverty reduction and sustainable economic growth in the region.\n\nIn Conclusion\n\nBlockchain technology holds immense promise for rural development, offering innovative solutions to address the challenges faced by marginalized communities. By providing transparent and immutable records, blockchain can enhance land governance, empowering farmers with secure land rights. Furthermore, blockchain can revolutionize agricultural supply chains, enabling fair compensation for farmers and connecting them directly with consumers. Lastly, by promoting financial inclusion and microfinance, blockchain can empower rural populations to access vital financial services. As we explore the vast potential of blockchain technology, it is crucial to ensure its responsible implementation, bridging the digital divide and creating a more equitable future for rural communities worldwide.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDUvMjgvd2hhdC1ldGhlcmV1bS1tZXYtYm90cy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 May 2023 07:00:00 GMT",
        "title": "What are Ethereum MEV bots? - The Cryptonomist",
        "content": "This article will discuss the topic of MEV bots, which are a series of individuals who exploit powerful hardware and specially designed techniques to make a profit in the business of producing blocks in the Ethereum blockchain.\n\nThis is a very complex topic, and an initial introduction to the topic of block validation in Ethereum is necessary again to be able to understand what MEV bots are and why it is interesting to talk about them.\n\nAll the details below.\n\nAn initial premise: the role of the validator and searchers\n\nAs anticipated, before talking about MEV bots on Ethereum it is essential to have a 360-degree view of how block validation and publishing works on the blockchain devised by Vitalik Buterin.\n\nWhile it is understood that MEV techniques can also be used on other networks, in this article we will focus exclusively on the Ethereum chain so as not to create confusion.\n\nOn it, all transactions are initially grouped in the mempool, waiting to be grouped and added to a block, before actually being published.\n\nUp to that point, the transactions remain pending and the crypto assets are not made available to the user who is to receive them.\n\nThe task of producing the final block is up to the validator (with proof-of-work it was the miner) who can independently choose which transactions to include first.\n\nAt this point it is IMPORTANT to understand that the figure of the validator gains from this activity in two ways: from the block reward (in the case of Ethereum, 2 ETH per block) and from the TX fees of users who want to have priority of execution.\n\nHence, it is in the validator’s interest to choose the transactions that “pay the most” and create a block that rewards it the most in terms of tx fees.\n\nConsider that sometimes these exceed the amount of the block reward.\n\nThe essence of the EVM, which we will discuss in more detail in the next section, is based on this very concept, namely, the fact that the block producer can sort the transactions in a block at will, making them execute according to a certain chronology that will then have certain effects on the market.\n\nAnother very important figure in this process is that of searchers, i.e., individuals who provide a “package” to the validator with a possible ordering of transactions, so as to simplify the work for it.\n\nThis is an already preset transaction combination that validators can exploit to earn as much from TX fees as possible, while rewarding the searchers with a commission for their work.\n\nHowever, the gain for searchers lies not so much in the commission they are entitled to, but in the effects that are caused when a validator chooses to publish their proposed block version.\n\nIn fact, by doing so, the searcher can take advantage of arbitrage opportunities on the DEX by choosing to order transactions in such a way as to create slippage on the price of an asset and take advantage of this price difference.\n\nThen there are other techniques that searchers and validators can exploit, sometimes trying to rip each other off by following the profit motive exclusively\n\nThe operation of Ethereum MEV bots in detail and the value creation process\n\nAfter the initial preamble, we can finally talk about MEV bots on Ethereum.\n\nThe term “MEV” refers to “Maximum Extractable Value,” which is that set of techniques that seek to maximize the profit of an individual (whether a validator, searcher, or relayer) by choosing to include, omit, or reorder certain transactions in a blockchain.\n\nSince the Ethereum blockchain is subject to the use of smart contracts and is full of decentralized marketplaces ranging from simple DEX to lending platforms, we understand well that choosing the ordering with which multiple transactions can be executed totally changes the end result, especially when large amounts of cryptocurrency are involved.\n\nIt is not always the validator who gains based on the sorting of tx in a block: although this party earns the block reward and user tx fees, sometimes other players benefit leading to multimillion-dollar profits even at the expense of the validators themselves.\n\nIt is good to understand that the person who exploits these EVM techniques is not just any user, but an expert who uses very complex hardware and specialized software in identifying the best strategy and carrying this out in an automated way.\n\nWe can summarize all EVM techniques in the following cases:\n\nasset price arbitrage on different decentralized markets;\n\nfrontrunning or sandwich attacks;\n\nloan liquidations in DeFi.\n\nLet’s try to delve into the second case, that is, frontrunning attacks: by exploiting the capabilities of the individuals involved in block publishing, it is possible to anticipate a significant purchase order (previously left pending in the mempool) to create an increase in the price of an asset, and always exploit the logic of transaction ordering to place a sell order in the next instant and sell the same asset at a higher price than the initial one.\n\nThis is more specifically referred to as a sandwich attack when a buy tx is placed before a major order (e.g., a purchase of 1000 ETH) and a sell tx is placed immediately after.\n\nThe slippage caused by the whale order represents the profit of the MEV strategy.\n\nThe world of EVMs is extremely complex, and these examples we have provided represent only the tip of the iceberg of a much more complicated set of strategies and techniques that have been carefully crafted to try to make a profit.\n\nIn any case, it is important to remember that when a validator or searcher profits from such a trade, for example by “artificially” creating a price slippage on a DEX, there is always a counterparty that loses the same dollar value.\n\nHere too, as is the case in trading, the game is zero-sum: when it comes to money, there is no ethics.\n\nThe pros and cons of the MEV techniques used by bots on Ethereum\n\nYou are probably wondering what the advantage is of having a structure of bots on Ethereum that exploit MEV strategies, sometimes playing dirty, to get rich behind someone else’s back simply by managing the sorting of tx in a blockchain.\n\nThere are different currents of thought that praise or criticize the essence of MEVs and these strategies.\n\nThose in favor of MEV bots mainly believe that this kind of on-chain activity and competition promotes stable asset prices in DeFi protocols and makes lending platforms less dangerous.\n\nIt is precisely because of the MEV bots that on Sushiswap and Uniswap, for example, the price of ETH is more or less always the same and no major variations occur that would harm trading on these protocols.\n\nIn fact, arbitrage opportunities are also and mainly generated by MEV strategies, but they are in fact exploited and concluded within the same block i.e. a few thousandths of a second later.\n\nOn the other hand, those who are against these maximum value extraction techniques argue that the user experience is definitely more unpleasant given the gas price increase caused by MEVs on Ethereum.\n\nIn the struggle to get the tx sorting preferred, individuals involved in this process increase tx fees to the point of forcing even simple users who want to make a simple cryptocurrency transfer to pay disproportionate fees.\n\nIn addition, some whale in carrying out on-chain crypto buying or selling transactions might suffer greater than normal slippage if he or she were targeted by a MEV, who for his or her part would earn the price difference caused.\n\nIn conclusion, MEV strategies represent an interesting insight into Ethereum’s blockchain architecture and the roles inherent in blockchain organization.\n\nTo date, this set of techniques is looked upon favorably by the Ethereum community, but as the ecosystem is constantly evolving, insiders are constantly monitoring the situation to prevent MEVs from threatening the consensus and integrity of the network, which has always been preserved so far.\n\nWe will see what the future of these bots on Ethereum will be and whether Vitalik and his own foundation will allow them to evolve or create solutions to destroy them."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL3d3dy5vdXRsb29raW5kaWEuY29tL2J1c2luZXNzLXNwb3RsaWdodC9iaWctZXllcy1jb2luLWlzLW9uZS1vZi10aGUtYmVzdC1tZW1lLWNvaW5zLW9mLTIwMjMtb3V0c2hpbmluZy1ldGhlcmV1bS1wZXBlY29pbi1uZXdzLTI4OTg1M9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 May 2023 07:00:00 GMT",
        "title": "Big Eyes Coin, The Best Meme Coin of 2023, Surpassing Ethereum, Pepecoin - Outlook India",
        "content": "Big Eyes Coin, with its adorable cat-themed design, has captured the attention and affection of many crypto enthusiasts in this exciting meme season. As the clock ticks down to the end of its presale on June 3rd, investors are rushing to secure BIG tokens, particularly with the coin selling at its Stage 3 price of $0.00017, a revert from its current price of $0.00053 from Stage 13. The token is set to launch on June 15th, primarily on Uniswap, but there are speculations that it might also be available on other prominent crypto exchanges such as KuCoin, OKX, or Binance."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LnRoZWNvaW5yZXB1YmxpYy5jb20vMjAyMy8wNS8yOC9sYXllci0yLWRhdGEtZmVlcy1oaXQtYWxsLXRpbWUtaGlnaC1vbi1ldGhlcmV1bXMtYmxvY2tjaGFpbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 May 2023 07:00:00 GMT",
        "title": "Layer 2 Data Fees Hit All-Time High on Ethereum's Blockchain - The Coin Republic",
        "content": "The layer 2 solutions of the Ethereum Blockchain have gained some exposure since they can address the blockchain network’s sustainability and high transaction fees. As a result of the traction L2 data fees on the Ethereum blockchain have hit an ATH. the data was revealed by The Block recently.\n\nIncrease in Layer-2 Fees on Ethereum\n\nLayer-2 data is basically the data fees related to the cost of transferring and executing data on L2 networks built on the Ethereum L1 mainnet. Due to the high usage of L2 solutions because of their benefits, demand for off-chain transactions has surged, which indirectly resulted in increased usage and demand for such solutions.\n\nSource: The Block\n\nThe above chart shows that Optimisim and ZK rollups have contributed to the high transaction fees milestone. However, if a closer look at the chart would reveal that Arbitrum and Optimism, which fall under the same optimistic rollup, have contributed more than ZK.\n\nArbitrum contributed a whopping 47.3% in the month of May while Optimism trailed with 23.04% of the spoils for the same month. While ZK rollups couldn’t beat the Optimistic roll-up numbers, zkSync stole the second spot ahead of Optimism with 25.38% of the total $16.2 million registered.\n\nOne of the major things the chart and the data fees indicates is that the adoption and use of these networks have been huge. It can be connected to the spike in Ethereum Mainnet’s transaction fees.\n\nOne of the most noteworthy observations from the publishing record is Polygon (MATIC) zkEVM. Despite the hype surrounding its launch even during the Beta phase, the project has cooled off significantly with only 1.03% of the total fees.\n\nDecrease in TVL\n\nSource: DefiLlama\n\nDue to the cool-off it, impacted its Total Value Locked performance. Despite DefiLlama data showing the metric increasing, one should note that it is way below its major competitors at $13.27 million.\n\nTotal value locked is majorly used for liquidity pool purposes for smart contract lending and staking in that respective blockchain. An increase in TVL indicates excellent health of the protocol and a decrease in TVL indicates threat and drying up of liquidity.\n\nzkSync with its total value locked at $127.63 million, is way ahead of Polygon zkEVM. The landscape in Optimism is however very different. Optimism has maintained its TVL stability at $889.36 million. Arbiturm has gained the first spot here as well with a TVL of $2.34 billion.\n\nEssentially, Optimistic rollups have captured the majority of the investors and the market shares as well. To beat Optimistic, ZK has to do a lot to impress investors."
    }
]