[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3RyYWRlci1qb2UtZXRoZXJldW0tbWFpbm5ldNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Avalanche DEX favorite Trader Joe is launching on Ethereum - Blockworks",
        "content": "Trader Joe, the largest decentralized exchange (DEX) on proof-of-stake blockchain Avalanche, has launched on Ethereum mainnet.\n\nThe pseudonymous Fish, co-founder of Trader Joe, told Blockworks that the DEX’s decision to launch on Ethereum now was driven by the opportunity to capture the stablecoin markets on the network amid the upheaval around Curve.\n\nCurve, a well-known stablecoin DEX, suffered an exploit this week that saw over $70 million in various digital assets attacked due to a bug in Vyper, the coding language used by Curve.\n\nThis latest exploit has led many liquidity providers to sell their holdings of CRV, Curve’s native token. At the time of writing, CRV currently has a token liquidity of $6.75 million, a significant dip from $70.42 million before the hacks.\n\n“LPs (liquidity providers) are moving to other pools, so you’re seeing a lot of volume go to other DEXes,” Fish told Blockworks. “We want to join and put ourselves into that mix.”\n\nCapturing the stablecoin market\n\nFish notes that Trader Joe’s initial plan was to deploy on Ethereum in a month or two, around the beginning of Q4, after working on improving its auto pool technology.\n\n“But this opportunity came up, and we felt this is the best time to deploy,” he said.\n\nAuto pools are designed to help automate the balance of liquidity for users passively.\n\n“Ethereum runs a little bit slower, it is gas intensive, and our AMMs also use a lot of gas,” Fish explained. “If you’re managing positions in a concentrated liquidity AMM, which requires you to rebalance often, and make a lot of transactions every day, then for the average Joe it’s going to be very uncomfortable for him to market make.”\n\nLuckily, managing positions in a stable stablecoin market is relatively simple, Fish said.\n\n“The price of USDC and USDT isn’t going to vary that much,” he said. “So in most cases, people can just deploy in that range and then earn fees from within that range.”\n\nTrader Joe’s initial launch on Ethereum will include stablecoin pools USDC/USDT and USDC/DAI.\n\nHow Trader Joe compares to Uniswap\n\nLike Uniswap v3, Trader Joe is a concentrated liquidity AMM, providing constrained liquidity within a tight range for its users.\n\nCompared to its competitor, its unique edge is that it offers dynamic fee components, Fish noted.\n\nOn Uniswap v3, liquidity providers are offered three fee tiers, ranging from 0.05%, 0.3% and 1%.\n\nBy contrast, on Trader Joe, there is a base fixed fee and a variable component which is dependent on the volatility within the past few seconds to minutes.\n\nTrader Joe is currently deployed on Avalanche, Arbitrum and BNB chains.\n\nAccording to data on DeFiLlama, Trader Joe has a $57.45 million TVL on Avalanche, making it the largest DEX on the network.\n\nOn Arbitrum, however, it sports a TVL of $31.9 million, a significantly less amount compared to Uniswap v3, which currently reports volumes of $261.7 million.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1hbmQtYml0Y29pbi1mdXR1cmVzLWV0Zi1jb3VudC1ncm93cy10by10d2VsdmUtd2l0aC1iaXR3aXNlcy1uZXctZW50cmllc9IBZGh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1hbmQtYml0Y29pbi1mdXR1cmVzLWV0Zi1jb3VudC1ncm93cy10by10d2VsdmUtd2l0aC1iaXR3aXNlcy1uZXctZW50cmllcz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Ethereum and Bitcoin Futures ETF Count Grows to Twelve with Bitwise's New Entries - U.Today",
        "content": "The count of Ethereum and Bitcoin futures exchange-traded funds (ETFs) applications has increased to twelve following recent filings by Bitwise, a leading provider of index and beta crypto funds.\n\nAdvertisement\n\nThe company filed for two ETFs, with equal weight and market weight versions of their dual Bitcoin and Ethereum futures ETFs.\n\nBitwise's Bitcoin and Ether Market Cap Weight Strategy ETF, the most recent product, aims to offer market capitalization-weighted exposure to Bitcoin and Ether futures contracts, without directly investing in Bitcoin or Ether. Managed by Bitwise Investment Manager and Vident Advisory, the ETF's allocation between Bitcoin and Ether futures contracts is determined by their respective market capitalization and rebalanced monthly.\n\nThe ETF invests mainly in cash-settled, front-month futures contracts, which are contracts with the shortest time to maturity, and may also include back-month, or longer maturity contracts. Both Bitcoin and Ether Futures Contracts are standardized, cash-settled futures contracts traded on the Chicago Mercantile Exchange (CME).\n\nWhen a futures contract is about to expire, the holder, in this case, the ETF, must sell the contract and purchase new ones with a later expiration date, a process known as \"rolling\". The continuous buying and selling could lead to higher portfolio turnover for the ETF.\n\nThis brings the total number of Ether futures ETF filings to a full dozen, with a strong indication that the count will continue to rise.\n\nAs reported by U.Today, ETF analysts James Seyffart and Eric Balchunas have revised the probability of a Bitcoin ETF approval to a promising 65%. A few months prior, the odds were pegged near an almost impossible 1%.\n\nThis revised estimate has been influenced by multiple factors, notably including the perceived softening stance of Gary Gensler, chairman of the U.S. Securities and Exchange Commission (SEC)."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tZXRmLXJhY2UtZ2V0cy1ob3R0ZXIv0gFIaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy9ldGhlcmV1bS9ldGhlcmV1bS1ldGYtcmFjZS1nZXRzLWhvdHRlci9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 05 Aug 2023 07:00:00 GMT",
        "title": "Ethereum ETF Race Gets Hotter As SEC Receives 11 Filings In One Week - NewsBTC",
        "content": "The United States Securities and Exchange Commission (SEC) has been flooded with many applications for Ethereum (ETH) Exchange-Traded Funds (ETFs) in just one week. The applications currently stand at 12, with the latest addition coming from ProShares, a popular fund manager.\n\nThe platform filed four applications for Ether-based ETFs, including a dual Ether and Bitcoin futures strategy ETF, an Ether Strategy ETF, and a short Ether Strategy ETF.\n\nWill The SEC Approve An Ethereum Futures ETF?\n\nThe recent surge in applications started on the 28th of July this year after Volatility Shares filed its application. Ever since, other asset management companies, including ProShares, Roundhill Financial, Bitwise, Van Eck, and Grayscale Investment, have filled submissions, with some bringing multiple applications.\n\nThe most recent application, filed on August 3 by ProShares, proposes an equal-weight Bitcoin and Ether ETF to measure the performance of holding long positions in the nearest maturing monthly Ether and Bitcoin contracts.\n\nAccording to renowned Financial Expert at Bloomberg Intelligence, James Seyffart, ProShare filed four separate applications with the SEC. Bitwise also submitted three applications, while Grayscale Investments filed two applications.\n\nHowever, despite the growing optimism, it remains to be seen if the Securities and Exchange Commission will approve these filings. The SEC has never approved an ETF that tracks Ether Futures contracts, unlike Bitcoin Futures ETFs that have been around since October 2021.\n\nMany market experts have argued that these applications are a mere gamble by these asset management companies, who do not want to miss out on being the first Ethereum ETF in the United States.\n\nETH price holds steady above $1,830 amid ETF race | Source: ETHUSD on Tradingview.com\n\nThe likelihood of receiving the SEC’s approval remains slim as the regulatory body has never approved an Ethereum futures ETF filing. Add to the mix the consistent refusal of SEC’s Chair, Gary Gensler, consistent refusal to answer if the agency considers ETH a security. This has further compounded regulatory uncertainty around the network.\n\nIf none of the applications before the SEC get denied, the Ether ETFs will launch 75 days from their respective filing dates. Analysts expect the Volatility Shares ETF to lead the charge on 12th October.\n\nUnderstanding The Difference Between Futures And Spot ETF Products\n\nThe primary difference between futures and spot ETF products lies in the fact that while the former tracks the price of futures contracts, the latter requires the issuers to purchase the underlying assets. Spot ETFs are generally considered more valid since they require the fund manager to purchase and hold underlying assets.\n\nThe current spike in Ether-based applications comes amidst a wave of filings from leading asset management companies, including BlackRock, the world’s largest asset manager, among others. These companies are looking to offer the first spot in Bitcoin ETF in the US.\n\nInvestors and members of the crypto community remain expectant of the outcome of the SEC’s consideration of the applications lying before it. Whatever decision the agency takes is likely to affect the attractiveness and accessibility of crypto investments, especially for larger institutional investors.\n\nFeatured image from iStock, chart from Tradingview.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3NlYy1mbG9vZGVkLXdpdGgtMTItZXRoZXJldW0tZXRmLWFwcGxpY2F0aW9ucy1pbi1sZXNzLXRoYW4tYS13ZWVrL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "SEC flooded with 12 Ethereum ETF applications in less than a week - CryptoSlate",
        "content": "As of Aug. 3, the U.S. Securities and Exchange Commission (SEC) has received a total of 12 Ethereum (ETH) exchange-traded fund (ETF) applications.\n\nThe latest additions came from Bitwise, submitting new applications for equal-weight and market-weight versions of its Bitcoin and ETH futures ETFs.\n\nThis continues the flurry of Ethereum-related ETF applications that started on July 28 when Volatility Shares filed its submission. Since then, other asset managers, including Grayscale, Proshares, etc., have submitted new applications, with some having multiple filings.\n\nJames Seyffart, a financial expert with Bloomberg Intelligence, reported that ProShares had filed four Ethereum ETF applications with the SEC. Information on the regulator’s website shows that Bitwise has made three applications, while Grayscale made two.\n\nOthers like Roundhill, VanEck, and Volatility Shares have submitted one application apiece. Meanwhile, a new name in the mix is Direxion, which filed a dual Bitcoin and Ethereum futures ETF on Aug. 2.\n\nWill the SEC approve?\n\nMarket experts have previously argued that the applications are more of a gamble by the asset managers who don’t want to miss out on being the first Ethereum ETF in the U.S. However, the possibility of getting approval is slim as the SEC has never approved an Ethereum futures ETF filing.\n\nAdditionally, chair Gary Gensler consistently declined to answer if the Commission considers Ethereum a security, thereby increasing the regulatory uncertainty surrounding the blockchain network.\n\nSEC still has Bitcoin ETF applications to deal with\n\nMeanwhile, the wave of Ethereum ETF applications is coming on the heels of a deluge of Spot Bitcoin (BTC) ETF applications submitted by numerous traditional financial institutions, including BlackRock, the largest asset manager globally, to the SEC.\n\nBloomberg’s analysts Eric Balchunas and James Seyffart opined that there was a 65% chance the financial regulator could approve the Bitcoin ETF applications before it. Seyffart explained that:\n\n“The lynchpin for this current thesis is a Grayscale victory over the SEC in Federal court. Which COULD set things up for a wave of SEC approvals sometime in the 4th quarter? All depends on how much Gensler wants to fight here.”\n\nMentioned in this article"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMikgFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOC8wNS91cy1ldGhlcmV1bS1mdXR1cmVzLWV0Zi1oYXMtYS03NS1jaGFuY2Utb2YtYXBwcm92YWwtaW4tMjAyMy1hZnRlci1yZWNlbnQtZmxvb2Qtb2YtYXBwbGljYXRpb25zLWFuYWx5c3RzLWVzdGltYXRlL9IBlgFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOC8wNS91cy1ldGhlcmV1bS1mdXR1cmVzLWV0Zi1oYXMtYS03NS1jaGFuY2Utb2YtYXBwcm92YWwtaW4tMjAyMy1hZnRlci1yZWNlbnQtZmxvb2Qtb2YtYXBwbGljYXRpb25zLWFuYWx5c3RzLWVzdGltYXRlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 05 Aug 2023 07:00:00 GMT",
        "title": "US Ethereum Futures ETF Has a 75% Chance of Approval in 2023 After Recent Flood of Applications, Analysts Estimate - The Daily Hodl",
        "content": "A pair of Bloomberg exchange-traded fund (ETF) analysts think there’s a 75% chance an Ethereum (ETH) futures ETF gets approved in the US this year.\n\nJames Seyffart and Eric Balchunas say the odds of approval spiked amid a flood of Ethereum futures ETF application submissions to the U.S. Securities and Exchange Commission (SEC).\n\n“The odds of Ethereum futures ETFs hitting exchanges this year have risen dramatically to 75%, in our view, after a spurt of 12 applications to the SEC in recent days. The SEC appears to be changing its posture toward crypto, based on reports of its back-channel messaging to ETF issuers. Also, we believe the SEC would have a hard time in court defending the denial of Ethereum futures ETFs after approving standard and leveraged Bitcoin futures ETFs.”\n\nBalchunas predicts the SEC will approve an Ethereum futures ETF in October, two years after the approval of the first Bitcoin (BTC) futures ETF.\n\nNo US Bitcoin spot ETF applications have been greenlit thus far, though the crypto world eagerly awaits the SEC’s decision on a June application from BlackRock, the world’s largest asset manager.\n\nA spot Bitcoin ETF would give investors exposure to the crypto asset through a brokerage firm, much like commodities such as gold.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA4LzA0L3RyYWRlci1qb2UtZGVidXRzLW9uLWV0aGVyZXVtLWpvZS1qdW1wcy0zL9IBW2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA4LzA0L3RyYWRlci1qb2UtZGVidXRzLW9uLWV0aGVyZXVtLWpvZS1qdW1wcy0zL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Trader Joe Debuts on Ethereum; JOE Jumps 3% - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY29pbmdhcGUuY29tL3VzLXNlY3MtYXBwcm92YWwtb2YtZXRoZXJldW0tZXRmLW1vcmUtbGlrZWx5LXRoYW4tYml0Y29pbi10aGlzLXllYXItYmxvb21iZXJnL9IBZ2h0dHBzOi8vY29pbmdhcGUuY29tL3VzLXNlY3MtYXBwcm92YWwtb2YtZXRoZXJldW0tZXRmLW1vcmUtbGlrZWx5LXRoYW4tYml0Y29pbi10aGlzLXllYXItYmxvb21iZXJnL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "US SEC Approval Of Ethereum ETF More Likely Than Bitcoin This Year: Bloomberg - CoinGape",
        "content": "The U.S. Securities and Exchange Commission (SEC) flooded with new Bitcoin and Ethereum exchange-traded funds (ETFs), indicating approval of multiple ETFs by the end of this year. Especially, ProShares and Bitwise are filing for various types of ETFs tracking both BTC and ETH prices, with Ethereum-related ETFs reaching 12 now.\n\nProShares And Bitwise Files 7 Bitcoin and Ethereum ETF Together\n\nProShares and Bitwise have filed three applications with the U.S. Securities and Exchange Commission (SEC) for ETFs focused on Bitcoin (BTC) and Ethereum (ETH).\n\nadvertisement\n\nProShares filed an application for the Bitcoin & Ether Equal Weight Strategy ETF. It will track the performance of the Bitcoin & Ether Equal Weight Index. ProShares has filed in total four applications for Ethereum-focused ETFs this week.\n\nIn addition, Bitwise also filed applications for the Bitcoin and Ether Market Cap Weight Strategy ETF and the Bitcoin and Ether Equal Weight Strategy ETF. Bitwise has filed three Ethereum-based ETFs applications this week.\n\nBloomberg ETF analysts James Seyffart and Eric Balchunas noted that the number of Ether futures ETF filings reaching 12 now.\n\n“We’re at 12. it’s late but I missed one today. Bitwise actually filed for two ETFs. Equal weight and market weight versions of their dual Bitcoin and Ethereum futures ETFs. We’re up to a full dozen Ether futures ETF filings now. Feel like we will get another tomorrow.”\n\nBloomberg analysts increased the odds of the US SEC approving a spot Bitcoin ETF this year to 65% from 50% a few weeks ago. However, the odds for an Ethereum ETF approval is 75%, but Balchuna believes 95% on Ether futures.\n\nRead More: Bitcoin Price Calm Before The Storm, Selling Now to Buy Later?\n\nBitcoin and Ethereum Price To Rally?\n\nBlackRock and other traditional finance firms pushing SEC to approve spot Bitcoin ETF, with Grayscale lawsuit against US SEC becoming a key factor for spot Bitcoin ETF this year.\n\nBTC price jumped 0.5% in the last 24 hours, with the price currently trading at $29,183. The 24-hour low and high are $28,959 and $29,375, respectively. Furthermore, the trading volume has decreased by 17% in the last 24 hours.\n\nMeanwhile, ETH price trades at $1835, up just 0.35%. The 24-hour low and high are $1825 and $1856, respectively.\n\nAlso Read:"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9wcm9zaGFyZXMtZmlsZXMtZXRoZXItZnV0dXJlcy1ldGYtYXBwbGljYXRpb24tc2Vj0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Ether ETF applications flood the SEC as ProShares files the 11th - Cointelegraph",
        "content": "The United States Securities and Exchange Commission has been recently inundated with applications for Ether (ETH) futures exchange-traded funds (ETFs), with a grand total of 11 Ether-based filings being submitted in less than a week.\n\nThe latest ProShares ETF application was filed on Aug. 3 and proposes an equal weight Bitcoin (BTC) and Ether ETF. According to the filing, the fund will track “the performance of holding long positions in the nearest maturing monthly bitcoin and ether futures contracts.”\n\nUPDATE: Another one.... 11 ETFs Filed... Proshares filed for a 4th ETF with Ethereum futures. This one is an equal weight #Bitcoin & #Ethereum ETF just like Bitwise's filing which dropped an hour ago. https://t.co/vB05Wvt33e pic.twitter.com/u3I3LzznGZ — James Seyffart (@JSeyff) August 3, 2023\n\nAccording to Bloomberg ETF analyst James Seyffart, fund manager ProShares has now lodged a total of four separate filings for Ether-based ETFs within the last few days, including a dual Bitcoin and Ether futures strategy ETF, a short Ether strategy ETF and an Ether strategy ETF.\n\nThe last seven days has seen a total of 11 Ether-related ETF filings, all of which have been for futures ETFs. The wave of Ether-based ETF applications was kicked off by Volatility Shares lodging its filing for the Volatility Shares Ether Strategy ETF on July 28.\n\nFollowing hot on Volatilty’s heels came Bitwise Asset Management, Roundhill Financial, Van Eck, ProShares and Grayscale Investments, which all filed new Ether futures applications on Aug. 1.\n\nWe have 7 #Ethereum Futures ETF filings from 6 Issuers. All of them are behind Volatility Shares. Key aspect here is that they are the same firm that managed to get a 2X #Bitcoin Futures ETF ( $BITX) through this SEC. https://t.co/dVpBkmtWwv pic.twitter.com/m615PS8Ssc — James Seyffart (@JSeyff) August 2, 2023\n\nNotably, the SEC has never approved an ETF that tracks Ether futures contracts. On the other hand, Bitcoin futures ETFs have been around since October 2021.\n\nIf the SEC does not deny any of the applications, the Ether ETFs will launch 75 days from their respective filing dates, with Volatility Shares ETF being the first to launch on Oct. 12.\n\nRelated: Ether ETFs pending — Grayscale, VanEck and others file SEC applications\n\nThe key difference between futures and spot ETF products is that the former tracks the price of futures contracts while the latter actually involves the issuer purchasing the underlying asset. Spot ETFs are widely viewed as more valid as they involve the fund manager buying and holding the underlying asset.\n\nThe flurry of Ether-focused applications comes in the wake of a frenzy of filings from major asset management firms seeking to launch spot Bitcoin ETFs. The world’s largest asset manager, BlackRock, is among those looking to offer what would be the first spot Bitcoin ETF in the United States.\n\nMagazine: Chinese police vs. Web3, blockchain centralization continues: Asia Express"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZGVjcnlwdC5jby8xNTE0MjQvdGhpcy13ZWVrLWluLWNvaW5zLXNpeC13ZWVrcy13ZWFrLWJpdGNvaW4tYW5kLWV0aGVyZXVtLXByaWNlc9IBXWh0dHBzOi8vZGVjcnlwdC5jby8xNTE0MjQvdGhpcy13ZWVrLWluLWNvaW5zLXNpeC13ZWVrcy13ZWFrLWJpdGNvaW4tYW5kLWV0aGVyZXVtLXByaWNlcz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 05 Aug 2023 07:00:00 GMT",
        "title": "This Week in Coins: Sparse News Extends Streak of Underwhelming Bitcoin and Ethereum Prices - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt.\n\nIt was the sixth consecutive week of underwhelming price performance by leading cryptocurrencies. There was a dearth of adoption or regulation stories, which for crypto fans and holders made this one of the slowest weeks in recent memory.\n\nMarket leader Bitcoin (BTC) fell 1.1% over the last seven days and currently trades at $28,972. Its closest rival, Ethereum (ETH), fell 2.3% to change hands at $1,829, according to CoinGecko.\n\nAD\n\nAD\n\nTether’s dollar pegged USDT is currently missing its mark and trades for $0.998247 despite the fact that the issuer’s recent quarterly report showed Q2 profits of $850 million, strengthening its total excess reserves to $3.3 billion.\n\nSeveral big altcoins posted notable losses, including XRP, which fell 12% to $0.624960, Solana (SOL) dropped 9.8% to $22.64, TRON (TRX) dipped 8.1% to $0.077501, Litecoin (LTC) depreciated 9.5% to $82.37, Toncoin (TON) dropped 8.3% to $1.19, and Stellar (XLM) fell 14.4% to $0.136595.\n\nOnly one of the top thirty cryptocurrencies by market cap posted notable gains: Dogecoin rival Shiba Inu (SHIB), which blew up 14.7% over the week to trade at $0.00000965.\n\nShiba Inu’s price movement appears to have been catalyzed by news that the coin’s makers are shedding their memecoin reputation and introducing a new identity protocol to all apps on the ecosystem for increased security and privacy.\n\nThe only major industry gossip in regulatory news this week broke on Monday, when a Financial Times report featuring Coinbase CEO Brian Armstrong revealed that the U.S. Securities and Exchange Commission had previously asked the exchange to delist all cryptocurrencies except Bitcoin.\n\nAnd in major institutional crypto news, software company MicroStrategy—the largest institutional holder of Bitcoin—reported a $24 million Bitcoin impairment charge in Q2.\n\nAD\n\nAD\n\nIn contrast, Jack Dorsey’s Bitcoin-friendly payments company Block reported that $2.4 billion of its total $5.5 billion Q2 net revenue came from Bitcoin."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMipAFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3RvcC0zLXByaWNlLXByZWRpY3Rpb24tYml0Y29pbi1ldGhlcmV1bS1yaXBwbGUtcGVudWx0aW1hdGUtbW92ZXMtZm9yLWJ0Yy1ldGgtYXMtdm9sYXRpbGl0eS1ncm93cy1mb3IteHJwLTIwMjMwODA0MjA1OdIBqAFodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy90b3AtMy1wcmljZS1wcmVkaWN0aW9uLWJpdGNvaW4tZXRoZXJldW0tcmlwcGxlLXBlbnVsdGltYXRlLW1vdmVzLWZvci1idGMtZXRoLWFzLXZvbGF0aWxpdHktZ3Jvd3MtZm9yLXhycC0yMDIzMDgwNDIwNTk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Penultimate moves for BTC, ETH as volatility grows for XRP - FXStreet",
        "content": "Share:\n\nBitcoin price is bearishly heading into the weekend and could break below the $29,182 support level as volatility wanes.\n\nEthereum price downtrend could continue amid falling momentum and the aura of a bearish BTC.\n\nRipple price eyes further break down as bears capitalize on increasing volatility to seize the market.\n\nBitcoin price is trading with a bearish bias on the 15-minute timeframe, an outlook that has been mimicked by both Ethereum (ETH) and Ripple (XRP) price as crypto markets slide into the weekend with modesty and calm. Accordingly, experts do not expect any quick movements for the next couple of days, even as triangles form on intraday charts.\n\nAlso Read: Binance approving SHIB as a collateralized asset causes 10 billion in open interest as Shiba Inu price rises.\n\nBitcoin price slides into the weekend with calm\n\nBitcoin (BTC) price is testing the lower boundary of a triangle pattern forming on the 15-minute chart, with an overall bearish outlook after flipping the 200-, 100- and 50-day Exponential Moving Averages (EMA) at $29,224, $29,218, and $9,223 levels respectively from a support to a resistance level.\n\nAs the weekend settles in, Bitcoin price may not record a striking move, as is characteristic of weekend volatility, except for the current bearish pull that continues to force BTC southward. The Relative Strength Index (RSI) is heading south as the histograms of the Awesome Oscillators also drop, suggesting falling momentum.\n\nAn increase in selling pressure could see Bitcoin price test the early August lows at around $29,038 to collect liquidity before a possible uptrend.\n\nBTC/USDT 15-min chart\n\nConversely, an increase in buying pressure above current levels could see Bitcoin price bounce north, first shattering past the resistance confluence between the three EMAs before a possible tag of the upper boundary of the technical formation. However, for a confirmed uptrend, Bitcoin price must record a decisive 15-minute candlestick close above $29,359.\n\nAlso Read: Bitcoin price holds above $29,000 after below-expectations US NFP data.\n\nEthereum price mimics BTC\n\nEthereum (ETH) price is following on the heels of BTC, heading south in the 15-minute timeframe with its price action consolidating into a triangle. Noteworthy, such technical formations are often penultimate (second from last) and moving in a trend. In the case of BTC and ET, the overall trend is a bearish correction that began after the July peak.\n\nAs momentum continues to fall, indicated by the southbound RSI and the reducing AO histograms, the bearish grip for Ethereum price could increase, sending the PoS token lower, potentially breaching the $1,836 support. In the dire case, ETH could extend lower to find support at around the $1,831 support level. This would be the most likely turnaround point for ETH.\n\nETH/USDT 15-min chart\n\nConversely, a resurgence by bulls could see Ethereum price bounce from the lower trendline of the triangle and head north to flip the three EMAs back to support. However, the gloomy outlook would only be invalidated upon a strong move above the $1,849 resistance level.\n\nAlso Read: Ether ETF applications flood the SEC as ProShares files the 11th\n\nRipple price volatility increases\n\nRipple (XRP) price is also sliding, with an overall bearish outlook that could extend if bulls continue sitting on their hands. As overhead pressure continues to build, XRP could soon breach the immediate support at $0.657 to collect the liquidity underneath.\n\nThis liquidity could help stabilize the market and give bulls a possible reentry point, but delayed entry could see Ripple price extend further south before finding a turnaround point. Noteworthy, as XRP heads south, it continuously writes off the July 13 gains.\n\nXRP/USDT 15-min chart\n\nIf sidelined and late investors come in, Ripple price could be headed north, with a successful escape from the foothold of the 50-,100-, and 200-day EMA at $0.663, $0.665, and $0.671, respectively, confirming the uptrend.\n\nAlso Read: Ripple plan to re-engage with US market could trigger XRP price recovery."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL2NvaW5wZWRpYS5vcmcvcHJpY2UtYW5hbHlzaXMvZXRoZXJldW0tY2xhc3NpYy1wcmljZS1hbmFseXNpcy13aWxsLXRoaXMtbGF1bmNoLWhlbHAtZXRjLXByaWNlLWV4Y2VlZC0yMC1vci1jcmFzaC11bmRlci0xNy_SAYUBaHR0cHM6Ly9jb2lucGVkaWEub3JnL3ByaWNlLWFuYWx5c2lzL2V0aGVyZXVtLWNsYXNzaWMtcHJpY2UtYW5hbHlzaXMtd2lsbC10aGlzLWxhdW5jaC1oZWxwLWV0Yy1wcmljZS1leGNlZWQtMjAtb3ItY3Jhc2gtdW5kZXItMTcvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Ethereum Classic Price Analysis: Will This Launch Help ETC Price Exceed $20 Or Crash Under $17? - Coinpedia Fintech News",
        "content": "Qadir Ak is the founder of Coinpedia. He has over a decade of experience writing about technology and has been covering the blockchain and cryptocurrency space since 2010. He has also interviewed a few prominent experts within the cryptocurrency space.\n\nStory Highlights ETC price action shows a prolonged downtrend in the channel of the bullish flag pattern.\n\nThe recent correction tests the bullish dominance at the 50% Fibonacci level at $17.83.\n\nThe bullish reversal chances increase with a Doji candle formation at the support trendline.\n\nThe ETC coin price has been on a downward trend for the past week, completing a negative trend within a falling channel. The price was rejected at the resistance trendline, leading to a 5% drop in the price of ETC over the last five days.\n\nThe falling price of Ethereum Classic warns of a prolonged selling spree if it breaks below the channel pattern.\n\nCurrently, the ETC prices struggle to take second support at the 50% Fibonacci level at $17.83. However, the price action still depicts a bullish flag pattern and maintains the positive reversal theory. The price action also depicts a double bottom forming at $17.83, increasing the reversal chances.\n\nAdditionally, the RSI and MACD indicators fail to display any bullish divergence to support a reversal theory. The RSI line falls trends lower than the halfway line with an uptick. Meanwhile, the MACD indicator shows a remarkable growth in bearish histograms.\n\nCurrently, the ETC price forms a doji candle at the support confluence of the 50% Fibonacci level and the support trendline. This projects a possibility of a morning star pattern formation, leading to a bull cycle within the channel to $18.75.\n\nOn an optimistic side note, the flag breakout rally can pump the ETH prices by 15% to challenge the overhead supply at $20.\n\nOn the flip side, a fall below the 50% Fibonacci level will plunge the ETC prices to $17."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vY29pbmNvZGV4LmNvbS9hcnRpY2xlLzMwOTU1L2xlYXJuLXdoeS1ldGhlcmV1bS1jbGFzc2ljLWFuZC1tb25lcm8tbWluZXJzLXN3aXRjaGluZy10by1iaXRjb2luLXNwYXJrL9IBb2h0dHA6Ly9hbXAuY29pbmNvZGV4LmNvbS9hcnRpY2xlLzMwOTU1L2xlYXJuLXdoeS1ldGhlcmV1bS1jbGFzc2ljLWFuZC1tb25lcm8tbWluZXJzLXN3aXRjaGluZy10by1iaXRjb2luLXNwYXJrLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Learn why Ethereum Classic and Monero Miners switching to Bitcoin Spark - CoinCodex",
        "content": "A new project fast attracting miners' attention as it demystifies the mining difficulty is now here. Ethereum Classic (ETC) and Monero (XMR) miners are showing an increasing interest in the latest addition to the crypto world, Bitcoin Spark (BTCS). Let’s explore why Bitcoin Spark is an appealing option for Ethereum Classic and Monero miners.\n\nBitcoin Spark (BTCS)\n\nBitcoin Spark is a Bitcoin hard fork providing alternatives to the energy-intensive Bitcoin mining process. This emerging cryptocurrency attracts attention due to its unique features appealing to miners seeking rewarding mining opportunities. Unlike Bitcoin’s Proof-of-work mechanism, Bitcoin Spark uses an all-new blockchain technology called \"Proof-Of-Process\" (PoP). PoP combines PoS and PoW for a streamlined process that moderates entry barriers to mining, allowing anyone to mine. The Bitcoin Spark PoP mechanism strives for equitable distribution of mining rewards irrespective of computational power and application of the proof-of-work system by renting out mining device processing power to various entities. The proprietary proof-of-work/proof-of-stake approach allows processing power to be rented out for different purposes.\n\nA Bitcoin Spark application makes mining accessible to all, regardless of the stake, and computational power, as miners are algorithmically selected. The BTCS team is developing a user-friendly mining program compatible with various devices, ensuring secure virtual access. The app, doubling up as a wallet, is compatible with Linux, Mac OS, iOS, Windows, and Android.\n\nThis platform fosters security and true decentralization, preventing any single entity from dominating the network. Bitcoin Spark mitigates the risk of single miners gaining excessive control and compromising network security by avoiding linear reward computation. Using multiple devices and miners for transaction finality further enhances network security. Mining rewards are distributed through a revenue-based system, ensuring profitability and self-sustainability for a stable network.\n\nBitcoin Spark's ICO phase one is set to kick off in August, offering one BTCS token at $1.50. Early adopters will be rewarded with a 20% bonus. With such affordability, imagine buying Bitcoin when it was only 1$. The enticing opportunity to purchase Bitcoin Spark at such a low price evokes thoughts of its early days. BTCS potentially yields impressive 800% returns when the token launches at $10.\n\nHow to mine Ethereum Classic?\n\nEthereum Classic (ETC) is the original Ethereum blockchain that did not undergo a hard fork after the 2016 DAO hack. It supports layer 2 scaling solutions, aiming to make blockchain transactions faster and cheaper. ETC relies on Proof-of-Work (PoW) mining, making it a decentralized and open-source platform. Miners use GPUs and ASIC mining rigs to participate in creating ETC tokens, and mining through a pool is currently profitable. ETC and Ethereum use the same Ethash algorithm, but ETC's lower hash rate allows for faster block generation. Miners play a crucial role in securing the network and preventing double-spending attacks. To mine ETC, one needs an ETC wallet, suitable hardware, mining software, and the choice between solo, cloud mining, or joining a mining pool.\n\nHow to mine Monero?\n\nMonero cryptocurrency uses proof-of-work mining with the RandomX algorithm to achieve distributed consensus. It aims to maintain egalitarian mining, making it ASIC-resistant and allowing everyone to mine using consumer-grade hardware. Miners can choose between solo mining or mining in a pool, with each method having pros and cons. Solo mining increases network security but may take longer to find blocks, while pool mining offers frequent payouts but requires trusting a centralized pool. P2Pool is another option, providing the benefits of both solo and pool mining. Monero can be mined on CPUs and GPUs, and various mining software options are available. However, the Monero Project does not endorse a specific pool, software, or hardware.\n\nConclusion\n\nBitcoin Spark offers a sweet deal for Ethereum Classic and Monero miners to consider. With its unique PoP consensus mechanism, efficient use of processing power, and focus on fair reward distribution, Bitcoin Spark addresses the limitations of other cryptocurrencies.\n\nLearn more on Bitcoin Spark here:\n\nDisclaimer: This is a sponsored article. The views and opinions presented in this article do not necessarily reflect the views of CoinCodex. The content of this article should not be considered as investment advice. Always do your own research before deciding to buy, sell or transfer any crypto assets."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2Jsb2NrY2hhaW4tc2Fsc2FsLWFydGlmYWN0LXJlY29yZHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Could Ethereum help stop museums from hoarding stolen artifacts? These researchers think so - Blockworks",
        "content": "Researchers are developing an Ethereum-based blockchain tool called Salsal to help museums and cultural institutions organize and keep track of valuable historical collections.\n\nMark Altaweel, a professor in the archeology department at the University College of London, has been working on Salsal alongside colleagues at Abu Dhabi University for roughly two years.\n\nAltaweel said putting history on the blockchain would be the first step toward “decolonizing museums” and taking back the past.\n\n“Blockchain…allows a decentralized way in dealing with and managing heritage. So if I have expertise about something, and you have expertise about something, we can all participate in these networks,” he told Blockworks in an interview.\n\nExpertise is the key thing Salsal needs to achieve wide adoption. Museums and collectors would submit their collections of historical objects to the Salsal blockchain. Experts, such as archaeologists, would then examine each artifact to determine their condition, provenance, and whether they were legally obtained.\n\nExperts on the Salsal network, which will be a partially-private version of Ethereum, will use the Museum Association’s sliding scale rating standard. A rating of one means the collection and/or items were legally and ethically obtained with plenty of documentation. A rating of five means the items “have clear evidence that they were obtained illegally,” according to Salsal’s white paper.\n\nIf a collection is shown to be ethically and legally legitimate with enough documentation to reasonably prove where the items came from, “the collector can then turn their collection into NFTs.”\n\nThe NFT portion of the Salsal network will be the public aspect of the blockchain, so people will be able to see and purchase them. This has the added benefit of monetarily supporting museums and collectors.\n\n“Cultural institutions tend to have struggles with things like fundraising. So giving some carrots for people to be involved is what the NFTs are for,” Altaweel said.\n\nObviously, concerns brewed among Altaweel and his colleagues that illegitimate collections could profit with this incentive in place, so they have removed the option for items that don’t meet experts’ standards to be fashioned into NFTs.\n\nAdditionally, Altaweel wants to show all the collections they receive — even the ones with a ‘five’ rating — on the blockchain for transparency’s sake. It’s also his strategy for holding museums with shady ethical practices accountable in terms of holding items of historical significance that were stolen from other cultures.\n\nMany have accused the British Museum in London of retaining pilfered items, some of which were taken during colonial conquests by the British Empire. Some examples of these include the Benin Bronzes from Nigeria, the Parthenon Marbles from Greece, and the Rosetta Stone from Egypt.\n\nThe governments of Nigeria and Greece have requested these priceless items back at one point or another. A group of prominent Egyptian archaeologists called for the return of the Rosetta Stone in October 2022.\n\nAltaweel wants to discourage situations like this in the future with his tool.\n\nRead more: Sandbox, British Museum shepherding history into ‘new online era’ with metaverse exhibits\n\nThe other inherent use case for Salsal is to have a running, immutable record of the collections stored in museums around the world.\n\nAltaweel brought up how the Baghdad Museum in Iraq was looted during the US invasion of the city in 2003 as part of the US’ war on terror. Anticipating chaos, museum staff vacated the premises two days before the invasion, which allowed thieves to roam the halls and take whatever they wanted.\n\nIn all, 15,000 objects were stolen from the museum, according to a 2018 analysis by the University of Sydney.\n\n“While 7,000 items have been recovered, more than 8,000 remain unaccounted for, including artifacts thousands of years old from some of the earliest sites in the Middle East,” the university wrote.\n\nAltaweel likes to imagine that a tool like Salsal, with enough adoption by museums around the world, could prevent future acts of cultural vandalism.\n\nIf records of all the items in the Baghdad Museum had been in a blockchain, Altaweel argues that “you would not only know what’s missing, but the community would be involved in looking for these objects.”\n\nHaving a record on chain makes it so attestation of ownership and authenticity can’t be destroyed or lost. On-chain storage also allows anyone with an internet connection to view records, which in this case would decentralize control away from museums and better enable the public to help identify and report stolen items, should they reappear in the future.\n\nAltaweel and his colleagues have been pitching Salsal primarily to museums in Abu Dhabi, including the Louvre located in the emirate. They’re also looking to attract funding, something Altaweel said has been tough during the summer.\n\nSalsal is still in its test version, but the overall goal is to launch it on Ethereum within six months, he said.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtdXBkYXRlLW9uLXN0YXR1cy1vZi11cGNvbWluZy1kZW5lYi11cGdyYWRl0gFLaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtLWV0aC11cGRhdGUtb24tc3RhdHVzLW9mLXVwY29taW5nLWRlbmViLXVwZ3JhZGU_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Ethereum (ETH): Update on Status of Upcoming Deneb Upgrade - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe Ethereum blockchain's upcoming Cancun-Deneb (also known as Dencun) upgrade will improve the network's scalability and security.\n\nAdvertisement\n\nDeneb is the upgrade name for the Ethereum Consensus Layer (CL), while Cancun refers to the update for the Ethereum Execution Layer (EL).\n\nThe Cancun upgrade, according to Ethereum developers, comprises 5 EIPs that are intended to increase data storage and lower costs.\n\nThe eagerly awaited EIP-4844, commonly known as Proto-DankSharding, is included in this version and will set the groundwork for the full implementation of DankSharding.\n\nOther EIPs considered are EIP-1153 (which decreases the cost of storing data on-chain, thereby enhancing block space), EIP-4788 (which enhances the design of cross-chain bridges and stake pools), EIP-5656 (which adds minor code alterations of the Ethereum Virtual Machine) and EIP-6780 (which eliminates code that could terminate smart contracts).\n\nThe Deneb Cancun upgrade is expected to happen by the end of 2023; however, there is no set date as of yet. According to researcher Alex Stokes from the Ethereum Foundation, October 2023 is a feasible goal date for Cancun's activation.\n\nHere's latest update per Ethereum ACDE call\n\nTim Beiko, an Ethereum developer, provided a quick summary of yesterday's biweekly ACDE call, which focused on testing efforts and preparations for the Deneb upgrade.\n\nAll Core Devs – Execution (ACDE) call recap by @TimBeiko\n\n\n\nScreenshot from Eth R&D Discord pic.twitter.com/HERlPQDBrQ — abcoathup.eth 🐡 🛡️🦇🔊 (@abcoathup) August 3, 2023\n\nDevelopers have decided to use a standard contract rather than a precompile for EIP-4788. Going forward, developers will attempt to come up with a deployment scheme and accept a first contract implementation to utilize.\n\nOnce this is agreed to, an audit /formal verification process will be started. According to Beiko, the devnet 8 launch will be put on hold until implementations for the new 4788 spec are received. Devnet 7 was released in late June to raise the blob limit from two to three and the maximum blob limit from four to six.\n\nBeiko also highlighted that clarifications for EIP 6780 will be merged as well as execution APIs Engine API. At the meeting, two abstraction EIPs, 5806 and 7377, were presented and discussed."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOC8wNS9ldGhlcmV1bS1jb21wZXRpdG9yLWF2YWxhbmNoZS1zZWVzLXN1cmdlLWluLWRhaWx5LXRyYW5zYWN0aW9ucy1hbmQtYWN0aXZlLWFkZHJlc3Nlcy1pbi1zZWNvbmQtcXVhcnRlci1uYW5zZW4v0gGSAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA4LzA1L2V0aGVyZXVtLWNvbXBldGl0b3ItYXZhbGFuY2hlLXNlZXMtc3VyZ2UtaW4tZGFpbHktdHJhbnNhY3Rpb25zLWFuZC1hY3RpdmUtYWRkcmVzc2VzLWluLXNlY29uZC1xdWFydGVyLW5hbnNlbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 05 Aug 2023 07:00:00 GMT",
        "title": "Ethereum Competitor Avalanche Sees Surge in Daily Transactions and Active Addresses in Second Quarter: Nansen - The Daily Hodl",
        "content": "Ethereum (ETH) competitor Avalance (AVAX) witnessed an uptick in on-chain activity in the second quarter of 2023, according to the crypto data firm Nansen.\n\nAvalanche’s C-Chain, the project’s default smart contract blockchain, saw between 200,000-550,000 daily transactions throughout the second quarter.\n\nAccording to the analytics firm, the figures represent nearly double the volume of daily transactions in Q1.\n\nThe data firm also notes that Avalanche’s daily active address count steadily increased across Q2, hitting a high of 117,304 on June 14th.\n\nSays Nansen,\n\n“The steady increase of active addresses, coupled with the rise in daily transactions, is indicative of healthy growth within the ecosystem and showcases the flourishing community supporting Avalanche.”\n\nQ2’s surge in on-chain activity wasn’t reflected in AVAX’s price, however. The 19th-ranked crypto asset by market cap dropped from trading around $17.79 at the beginning of the quarter in April to $13.02 at the end of June, a decrease of nearly 27%.\n\nAvalanche’s native token is trading at $12.40 at time of writing.\n\nDecentralized finance tracker DeFi Llama also notes that Avalanche’s total value locked (TVL) dropped from $867 million on April 1st to $693.94 million on June 30th, a decrease of nearly 20%. The platform’s TVL sits at $608.82 million at time of writing.\n\nThe TVL of a blockchain represents the total capital held within its smart contracts. TVL is calculated by multiplying the amount of collateral locked into the network by the current value of the assets.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1pcy10aWNraW5nLWJvbWItYW5hbHlzdC1leHBsYWlucy13aGF0LWl0LW1lYW5z0gFLaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtLWlzLXRpY2tpbmctYm9tYi1hbmFseXN0LWV4cGxhaW5zLXdoYXQtaXQtbWVhbnM_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Ethereum Is 'Ticking Bomb,' Analyst Explains What It Means - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe cryptocurrency market is an ever-evolving landscape, with each asset having its own dynamics. Ethereum, the leading altcoin, is currently generating considerable attention, with analysts referring to it as a \"ticking bomb.\" This phrase, intriguing as it is, signals the potential for explosive growth in Ethereum's future.\n\nAdvertisement\n\nThe primary focus here is on the ETH/BTC trading pair, suggesting it might be the right time for investors to shift their investments from Bitcoin to Ethereum. This notion stems from the recent market behavior in which Bitcoin has shown some short-term weakness. On the contrary, Ethereum, despite experiencing a slump below $1,900, is signaling impending bullish momentum.\n\nAt this point, Ethereum is trading between the 50 and 200 EMAs (Exponential Moving Averages), indicating that it is in a phase of consolidation. Both the volume and the RSI (Relative Strength Index), a metric used to assess overbought or oversold conditions, are descending. This could be an early sign of a potential trend reversal.\n\nThe term \"high-beta plays\" refers to investments that are more volatile than the overall market. These assets have a beta greater than one, meaning they are expected to exhibit larger price swings. The advice to avoid high-beta plays suggests that the focus should be on establishing a strong core portfolio of stable investments rather than taking high risks in pursuit of quick gains.\n\nThe general consensus among market analysts is that Ethereum might be on the brink of a \"spectacular run.\" While Bitcoin may enjoy a brief rally, Ethereum's potential for growth appears to be higher. The primary message to investors is to bide their time and focus on building a resilient, diversified portfolio capable of weathering potential storms and taking advantage of the upcoming bull market."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vdS50b2RheS9oZXJlcy13aHktYXJiaXRydW0tYmVjYW1lLTEtZXRoZXJldW0tbDItc2NhbGVyLW9waW5pb27SAUpodHRwczovL3UudG9kYXkvaGVyZXMtd2h5LWFyYml0cnVtLWJlY2FtZS0xLWV0aGVyZXVtLWwyLXNjYWxlci1vcGluaW9uP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 05 Aug 2023 07:00:00 GMT",
        "title": "Here's Why Arbitrum Became #1 Ethereum L2 Scaler: Opinion - U.Today",
        "content": "Advertisement\n\nAmid aggressive competition in the Ethereum (ETH) L2s segment, it remains pretty concentrated. Almost 90% of its aggregated total value locked (TVL) is controlled by three networks. Here's how Arbitrum (ARB) keeps its supremacy in this field.\n\nArbitrum succeeds since it remains \"credibly neutral,\" Patrick McCorry says\n\nCryptocurrency researcher Patrick McCorry, former assistant professor at King's College London, is sure that \"credible neutrality\" is one of the reasons behind Arbitrum (ARB), Ethereum-based network's success. Its team has never launched \"official\" decentralized applications on Arbitrum (ARB), leaving space for open competition.\n\nIn my opinion as an observer, one of the reasons why Arbitrum has been successful to date is that the ecosystem did not pick a favourite and remained credibly neutral.\n\n\n\nWithout favourites, it allows anyone to feel like they can deploy on the chain and compete as an equal. https://t.co/fcM5IMVQ55 — Patrick McCorry (💙,🧡) (@stonecoldpat0) August 5, 2023\n\nWith no \"favorite\" applications officially supported by Arbitrum DAO and Offchain Labs, any team can come to the blockchain and start deploying \"like an equal.\"\n\nMcCorry's position echoes that of the Arbitrum (ARB) community head, who slammed the L1s and L2s that created their own applications on corresponding blockchain networks:\n\nThe worst thing a chain team can do is start creating their own native dApps or products on top of it. You just end up being in direct competition with teams building on your chain within that vertical\n\nArbitrum (ARB) has never endorsed any applications as its \"native\": All crucial protocols using it as a technical basis are created by third-party teams.\n\nAs covered by U.Today, there is strong evidence that Arbitrum's (ARB) growth is fueled by real usage in DeFi: Airdrop hunters are only responsible for 5-6% of its transactions.\n\nArbitrum vs Optimism rivalry gains traction\n\nBy press time, Arbitrum (ARB) remains the largest Ethereum-based network by TVL: It has accumulated $5.93 billion in liquidity across all of its verified protocols. This is equal to 56.16% of the whole Ethereum L2s ecosystem. Its closest competitor Optimism (OP) is responsible for $2.95 billion, or 27.8% of liquidity.\n\nHowever, in the past week, Optimism (OP) has surpassed its rival in a number of crucial metrics, starting from the number of daily on-chain transactions.\n\nIt was also closer to surpassing Arbitrum (ARB) in the net number of daily active addresses. However, both metrics might only be rallying due to the hype around Worldcoin (WDC), a controversial eye-scanning project by OpenAI's Sam Altman.\n\nThat is why analysts are sure that nothing poses a threat to Arbitrum's (ARB) dominance in the L2s segment it has kept for a couple of months."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vdS50b2RheS9vZGRzLW9mLWV0aGVyZXVtLWV0Zi1hcHByb3ZhbC1zdXJnZS1hbmFseXN0c9IBQGh0dHBzOi8vdS50b2RheS9vZGRzLW9mLWV0aGVyZXVtLWV0Zi1hcHByb3ZhbC1zdXJnZS1hbmFseXN0cz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Odds of Ethereum ETF Approval Surge: Analysts - U.Today",
        "content": "Advertisement\n\nThe odds of approval for Ethereum futures ETFs have jumped to 75%, according to a recent note by ETF analysts James Seyffart and Eric Balchunas. This is the same rate they attributed to Bitcoin futures ETFs in September 2021.\n\nMeanwhile, the number of applications for Ethereum and Bitcoin futures ETFs has increased to twelve, thanks in part to recent submissions by Bitwise, a top firm in the field of index and beta cryptocurrency funds.\n\nCryptocurrency futures ETFs provide investors with exposure to cryptocurrency futures contracts rather than offering direct investment in the mercurial asset class.\n\nThe first bitcoin-linked exchange-traded fund (ETF) from ProShares, which tracks the bitcoin futures market made its debut in October 2021. It helped to revive the Bitcoin bull run after marking a significant regulatory milestone for the cryptocurrency industry.\n\nDespite not allowing investors to buy crypto directly, this futures-based ETF could pave the way for the approval of spot ETFs in the future.\n\nIs a Bitcoin spot ETF about to get approved?\n\nIt is worth mentioning that Seyffart and Balchunas have also revised the approval odds for a spot Bitcoin ETF upwards to 65% from 50% a few weeks ago.\n\nThe increased likelihood of Bitcoin ETF approval is influenced by SEC Chairman Gary Gensler's potentially more receptive stance and strategic moves by leading crypto investment firms like Grayscale and BlackRock\n\nThe first leveraged Bitcoin ETF\n\nOn a historic note, the SEC greenlighted the first leveraged Bitcoin ETF last month. This trailblazing product has attracted a tide of over $4 million in trading volume during the first day, with approximately half a million dollars worth of shares being scooped up within the first quarter of an hour."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9ldGhlcmV1bS1ldGYtaW5jb21pbmctb2Rkcy1vZi1ldGgtZXRmcy1za3lyb2NrZXQtNzUv0gFRaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL2V0aGVyZXVtLWV0Zi1pbmNvbWluZy1vZGRzLW9mLWV0aC1ldGZzLXNreXJvY2tldC03NS8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Ethereum ETF Incoming? Odds of ETH ETFs Skyrocket 75% - CryptoPotato",
        "content": "While anticipation over a potential Bitcoin (BTC) spot ETF has gripped investors, an Ethereum (ETH) ETF approval may also be waiting in the wings.\n\nBloomberg analysts are now assigning 75% odds of one such product being approved in the United States this year.\n\nEthereum ETF On The Horizon\n\nAs tweeted by Bloomberg ETF analyst James Seyffart on Friday, the organization’s approval odds are the same as those it assigned for a Bitcoin futures ETF in early September 2021.\n\nThe very first U.S.-based fund of the kind – the ProShares Bitcoin Strategy ETF (BITO) launched in late October of that year, pulling in $1 billion within two days of its launch.\n\nAt the time, many companies were vying to list the product after Gary Gensler – Chairman of the Securities and Exchange Commission (SEC) – stated that he was confident in the investor protections that a futures ETF framework could provide.\n\nToday there are 13 Ethereum ETF applications knocking on the SEC’s door, from 8 different applicants including Bitwise, Proshares, and Grayscale. Based on the SEC’s deadlines, the first in line for approval or denial is Volatility Shares’ Ethereum Strategy ETF, by October 11.\n\n“The SEC appears to be changing its posture towards crypto, based on reports of its back channel messaging to ETF issuers,” wrote the analysts. “We believe the SEC would have a hard time in court defending the denial of Ethereum futures ETFs after approving standard and leveraged Bitcoin futures ETFs. “\n\nBitcoin Spot ETF Approval Odds\n\nAs of August 4, there are 9 active Bitcoin spot ETF applications pending review by the SEC, with the latest applicant being from CBOE on behalf of the Global X Bitcoin Trust.\n\nLike all other applications, CBOE’s latest filing selects Coinbase as a surveillance-sharing partner for detecting market manipulation – a crucial issue for the SEC for which its denied every major spot ETF application so far.\n\nShares for a Bitcoin spot ETF are backed by actual BTC held under custody by the trust and its partners. By contrast, futures ETFs are backed by Bitcoin futures contracts, which may not perfectly track the price of BTC at any particular time.\n\nUnlike competitors, Grayscale is vying to convert its Bitcoin trust into a spot ETF by battling the SEC in court. The company argues that the regulator’s approval of futures ETFs, but not spot ETFs, demonstrates “arbitrary and capricious” treatment of the latter.\n\nRecently, Bloomberg analysts raised their odds of a Bitcoin spot ETF approval this year to 65%, which they expect will come on the back of a Grayscale court victory."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLXByaWNlLWRvbGRydW1zLWhvdy10by1zdXJ2aXZlLXNlY29uZC1zdGFnZS1jYXBpdHVsYXRpb24v0gFaaHR0cHM6Ly9jb2luZ2FwZS5jb20vZXRoZXJldW0tcHJpY2UtZG9sZHJ1bXMtaG93LXRvLXN1cnZpdmUtc2Vjb25kLXN0YWdlLWNhcGl0dWxhdGlvbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Ethereum Price Doldrums: How to Survive Second Stage Capitulation - CoinGape",
        "content": "Ethereum price is struggling to keep support at $1,830 intact, while the entire crypto market continues with its longstanding lull. Since the rejection from $2,000 around mid-July, recovery attempts have been minimal, with the least resistance path mainly downward.\n\nBased on the prevailing technical picture, bears have the upper hand, especially with Ethereum price below all the major moving averages such as the 50-day EMA (red), the 100-day EMA (blue), and the 200-day EMA (purple).\n\nadvertisement\n\nSupport at $1,830 is critical for the resumption of the uptrend, but if declines intensify, the buyer congestion at $1,800 will come in handy.\n\nEthereum Price Final Capitulation\n\nThe crypto winter has lasted well over two years with attribute to many attacks on the blockchain ecosystem, including the Terra crash “through which governments are stepping in with a regulatory framework… to protect investors,” Michaël van de Poppe, a popular analyst told investors on Friday.\n\nThis push to regulate the market, although understandable, is exerting a lot of pressure to the extent of risking the survival of the crypto ecosystem.\n\nIn addition to the recently resolved matter between Ripple and the SEC, the regulator is suing Coinbase and Binance, and the DoJ has been investigating the latter exchange platform. In all this, proposals for Ethereum and Bitcoin exchange-traded funds (ETFs) have surged in the past couple of months, bringing institutions like Blackrock and Valkyrie into the industry.\n\nEthereum and most other altcoins, according to Poppe, “have been trending downwards for 18-24 months straight.\n\nHowever, one notable fundamental factor is that the supply on exchange continues to shrink to the lowest levels while staking both on the Ethereum protocol and liquid staking platforms like Lido soar to the highest levels since the implementation of the Shanghai upgrade.\n\nThe mundane market structure represents “the second stage of capitulation, which is time.” Investors will continue to feel like markets are unresponsive, with some shunning crypto for other industry sectors.\n\nAs for investors, perhaps excluding traders, it is wise to keep calm and be patient with the market. Accumulation, according to Poppe the best strategy at the moment, with institutions like Blackrock jumping in.\n\nWhat’s Next for Ethereum Price in The Short Term?\n\nThe bearish outlook in both the Moving Average Convergence Divergence (MACD) and the Money Flow Index (MFI) hints at declines continuing to $1,800 in the short term. In addition to the sell signal, the MACD holds below the mean line (0.00), further reinforcing the bearish grip.\n\nIf bulls manage the arrest the bearish situation at $1,830 traders can prepare to seek fresh exposure to ETH longs after the price steps above the 100-day EMA. The subsequent break above the 50-day EMA at $1,866 would serve as confirmation for a stronger uptrend to be validated by recovery past the descending trendline for gains above $2,000.\n\nRelated Articles"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ob3ctY2FyZGFuby1rZWVwcy1kb21pbmF0aW5nLWV0aGVyZXVtLWRlc3BpdGUtcHJpY2UtZGVjbGluZS_SAVZodHRwczovL2FtYmNyeXB0by5jb20vaG93LWNhcmRhbm8ta2VlcHMtZG9taW5hdGluZy1ldGhlcmV1bS1kZXNwaXRlLXByaWNlLWRlY2xpbmUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 05 Aug 2023 07:00:00 GMT",
        "title": "How Cardano keeps dominating Ethereum despite price decline - AMBCrypto News",
        "content": "Cardano’s development activity was substantially higher compared to Ethereum.\n\nADA’s price dropped by 6% last week, but there was a possibility of a trend reversal.\n\nCardano [ADA] has outperformed the king of altcoins, Ethereum [ETH], by a huge margin in terms of development activity. In fact, data suggested that ADA’s development activity consistently remained three times higher than Ethereum.\n\nRead Cardano’s [ADA] Price Prediction 2023-24\n\nThis metric has been reflected in the blockchain’s efforts to push out new updates over the last few months, the latest being the Mithril mainnet upgrade.\n\nCardano’s development activity remains high\n\nIt was interesting to note that Cardano’s development activity rose substantially over the last month. Its development activity contributor count also remained high.\n\nA major reason for this uptrend can be attributed to the recent Mithril mainnet launch, which aimed to reduce the time required for nodes to sync with the blockchain.\n\nAfter the mainnet update was pushed, Cardano’s multiple teams continued to work on other projects, which were highlighted in the blockchain’s latest edition of its weekly development report.\n\nAs per the report, Mithril mainnet has been consistently producing new certificates and snapshots. The Mithril team also worked on upgrading the Cardano node to v.8.1.2, fixing the release-preprod network that stopped producing certificates.\n\nThis week’s #Cardano development update is live on #EssentialCardano! Read the report to learn about the latest on core technology, wallets and services, smart contracts, scaling, governance, #ProjectCatalyst, and #Cardano education. https://t.co/6DOQ2DXVMQ pic.twitter.com/P2MUJNmOMi — Input Output (@InputOutputHK) August 4, 2023\n\nApart from the BASHO team, the Plutus core team worked on adding decentralized governance support, as defined in CIP-1694, to Plutus v3. The Lace team continued the implementation of Posthog analytics and dedicated efforts to add Trezor support and implement the multi-delegation feature.\n\nThe report also mentioned updated statistics of the Cardano blockchain. The blockchain’s total transactions reached 72.7 million, while its native tokens exceeded 8.6 million.\n\nMoreover, the number of projects building on ADA reached 1,271, while the number of projects launched touched 136.\n\nADA investors aren’t content\n\nWhile development activity remained high, the native token’s price action turned bearish. As per CoinMarketCap, ADA’s price declined by more than 6% over the last week. At press time, it was trading at $0.2915 with a market capitalization of over $10 billion.\n\nThe price drop caused its MVRV Ratio to plummet. Additionally, negative sentiment around Cardano also remained relatively high. However, the whales continued to show interest in ADA, as evident from its high whale transaction count.\n\nIs your portfolio green? Check out the Cardano Profit Calculator\n\nThe good news was that the bearish price trend might come to an end in the coming days. This possibility was pointed out by Coinglass. According to the chart, Cardano’s Open Interest was declining.\n\nA drop in the metric usually means that the on-going market trend might change, giving hope for a price uptick."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vd3d3LmNvaW5zcGVha2VyLmNvbS9wcm9zaGFyZXMtYml0d2lzZS1iaXRjb2luLWV0aGVyZXVtLWV0ZnMv0gFIaHR0cHM6Ly93d3cuY29pbnNwZWFrZXIuY29tL3Byb3NoYXJlcy1iaXR3aXNlLWJpdGNvaW4tZXRoZXJldW0tZXRmcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "ProShares and Bitwise Join Race for Bitcoin and Ethereum ETFs - Coinspeaker",
        "content": "Bloomberg’s ETF analyst believes that ProShares’ multiple Ether-based ETF applications within a short period may indicate a favorable stance from the SEC.\n\nThe race for cryptocurrency exchange-traded funds (ETFs) is heating up, as ProShares, a leading global asset manager, recently filed applications with the US Securities and Exchange Commission (SEC) to launch exchange-traded funds (ETFs) focusing on bitcoin (BTC) and ether (ETH). The application, submitted on August 3, includes a proposal for the Bitcoin and Ether Equal Weight ETF, designed to measure “the performance of holding long positions in the nearest maturing monthly bitcoin and ether futures contracts.”\n\nBitwise filed its application on the same date in a parallel move, seeking approval for an ETF that equally weights exposure to Bitcoin and Ether. The fund aims to track “the performance of holding long positions in the nearest maturing monthly bitcoin and ether futures contracts.”\n\nProShares Becomes the 11th Company to File for Ethereum ETF\n\nIt is important to note that ProShares and Bitwise have taken different steps in expanding their crypto-related funds. ProShares has already been active in the digital asset space, having previously filed applications for other cryptocurrency-related ETFs, including one focused on the metaverse.\n\nOn the other hand, Bitwise joins the fray with a series of ETF applications for Ethereum. Notably, the SEC has received a total of 11 Ether-related ETF filings in less than a week, all of which are centered on futures ETFs. The wave of applications began with Volatility Shares filing for the Ether Strategy ETF on July 28. ProShares is now adding its own Ether ETF proposals to the mix, making the company the 11th to join the race. The fund manager filed for a total of four Ether-related ETFs within a few days, including a dual Bitcoin and Ether futures strategy ETF, a short Ether strategy ETF and an Ether strategy ETF.\n\nUPDATE: Another one…. 11 ETFs Filed… Proshares filed for a 4th ETF with Ethereum futures. This one is an equal weight #Bitcoin & #Ethereum ETF just like Bitwise's filing which dropped an hour ago. https://t.co/vB05Wvt33e pic.twitter.com/u3I3LzznGZ — James Seyffart (@JSeyff) August 3, 2023\n\nWhile Bitcoin futures ETFs have been available since October 2021, the SEC has yet to approve any ETF that tracks Ether futures contracts, making these applications a focal point of market attention.\n\nA Favorable Stance from the SEC\n\nMarket analysts and experts hold varying opinions on the potential outcomes of these filings. Bloomberg’s ETF analyst, James Seyffart, believes that ProShares’ multiple Ether-based ETF applications within a short period may indicate a favorable stance from the SEC. However, he also acknowledged the regulatory challenges related to approving ETFs based on Ether futures contracts, which the SEC has been cautious about in the past.\n\nIn contrast, Lark Davis, a well-known crypto influencer, expressed skepticism about the prospects of spot crypto ETFs. He is critical of futures-based ETFs, citing concerns about potential market manipulation and calling for a focus on spot ETF approvals.\n\nThe recent influx of ETF applications comes amid speculation about the SEC’s stance toward digital assets. Retail investors have shown increasing interest in ETFs, and market observers believe that the approval of ETFs could pave the way for the mainstream adoption of cryptocurrencies.\n\nAs the SEC reviews these applications, the cryptocurrency community eagerly awaits the regulatory decisions that could shape the future of digital asset investments and broaden the accessibility of virtual assets to retail investors."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiLGh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvaG93LXRvLWJ1cm4tYW4tbmZ00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "How to Burn an NFT? - Watcher Guru",
        "content": "Mastering the Art of NFT Annihilation: Unraveling the Mystery of How to Burn an NFT\n\n‍The non-fungible token (NFT) marketplace has become a bustling hub of digital art, innovation, and investment.\n\nBut what happens when you want to obliterate an NFT from existence? Enter the intriguing world of NFT burning.\n\nAlso read: Dogecoin Army Buzzing with Anticipation After Elon Musk’s Tweet\n\nThis comprehensive guide will walk you through How to Burn a non-fungible token, including its purpose, steps on various blockchains, and implications for your digital asset’s future.\n\nSource: Information Age\n\nThe Art of NFT Destruction: Can NFTs Be Obliterated?\n\nNon-fungible tokens, once minted on the blockchain, become immutable digital assets.\n\nHowever, you can destroy or “burn” them through a process similar to sending the token into a digital black hole.\n\nThis act, known as “burning,” sends the token to an inaccessible, unspendable address, effectively wiping it from existence.\n\nAlso read: Shiba Inu: $1000 Investment on ShibaSwap Debut, Profit Revealed\n\nBurning an NFT: What Does It Entail?\n\nThe act of burning a non-fungible token is synonymous with completely deleting it. It involves the transfer of a token to an address that remains inaccessible to all.\n\nOnce a non-fungible token is burned, it is impossible to retrieve it. Hence, it is crucial to be sure that burning is your desired course of action.\n\nInterestingly, as the digital asset dissolves, its history and record remain imprinted on the blockchain, providing evidence of its existence and subsequent annihilation.\n\nThe Void Address: Understanding the Token Burn Address\n\nSource: Cointurk\n\nAn NFT burn address is a specialized wallet address that acts as a digital incinerator for tokens. Also known as an “address eater,” this null address is inaccessible and holds no keys.\n\nIt is the ultimate lock without a key.\n\nOn the Ethereum blockchain, the burn address is often represented as 0x0000000000000000000000000000dEaD.\n\nPolygon’s burn address appears as 0x0000000000000000000000000000, while Solana employs the burn address ‘ remove.sol.’\n\nDispatching an NFT to these addresses permanently eliminates it from circulation.\n\nThe Price of NFT Annihilation: Does Burning an NFT Cost Anything?\n\nYes, the process of burning an NFT incurs a cost.\n\nThis transaction fee, colloquially referred to as a “gas fee,” is required to process the burning of your non-fungible token.\n\nThe fee can fluctuate based on the current supply and demand on the blockchain.\n\nThe cost of burning an NFT can range anywhere from $0.00025 to $100.\n\nThe Step-by-Step Guide: How to Burn an NFT\n\nThe burning process is straightforward. Below is a step-by-step guide to burning your NFT on popular blockchains like Ethereum, Solana, and Polygon.\n\nIncinerating an Ethereum NFT\n\nHere’s your guide on How to Burn an NFT on Ethereum:\n\nAccess the wallet or marketplace holding your NFT. Choose the NFT you wish to burn and hit the “Transfer” button. Direct your NFT to Ethereum’s official burn address, which is 0x00000000000000000000000000000000dEaD. Settle the required gas fees to transfer your NFT and click “Confirm.”\n\nWith these steps, your NFT will be permanently dissolved and removed from the marketplace. Remember, gas fees can vary based on supply and demand on the Ethereum blockchain.\n\nBurning a Polygon NFT\n\nThe process of burning an NFT on the Polygon blockchain mirrors that of Ethereum, except for the burn address.\n\nHere’s how:\n\nNavigate to the item page for the NFT you wish to burn. Click on the transfer button. Enter the Polygon burn address: 0x000000000000000000000000000000000000. Hit “Transfer,” confirm the transaction with your wallet, pay the gas fees, and you’re done!\n\nObliterating a Solana NFT\n\nBurning an NFT on Solana differs slightly from other NFT blockchains.\n\nThe Phantom Wallet, a popular Solana wallet, has built-in burning features that reward users with SOL for burning certain NFTs.\n\nFor NFTs that aren’t supported by the built-in burning features, use the following steps:\n\nOpen your Solana wallet and locate the NFT you wish to burn. Add the ‘ remove.sol ‘ wallet address in the recipient field. Confirm the transaction and pay the associated gas fees.\n\nThe ‘remove.sol’ address is a graveyard for unwanted NFTs.\n\nOnce you send your NFT there, there’s no turning back; the burning process becomes irreversible.\n\nMonetary Compensation for Burning an NFT: Is It Possible?\n\nMonetary compensation for burning an NFT is platform-dependent.\n\nWhile Ethereum and Polygon offer no return, platforms like the Phantom Wallet provide a unique mechanism that rewards users with SOL for burning certain NFTs.\n\nHence, it’s advisable to check the specifics of the platform used to determine if it offers a reward.\n\nReasons to Burn an NFT: Why Would You Do It?\n\nThe act of burning an NFT serves several purposes.\n\nIt can be a strategic tool to control the value of an asset. Since NFTs appreciate when demand surpasses supply, reducing the supply via burning can potentially increase the price of the remaining tokens.\n\nBurning can also expunge flawed or redundant tokens from circulation, which is particularly useful when an excess number of tokens devalues individual tokens.\n\nMoreover, burning NFTs can help build trust and credibility, especially during the early phases of a token’s lifecycle.\n\nCreators often burn unsold tokens post-launch to demonstrate accountability and safeguard the interests of token buyers, enhancing their credibility.\n\nCertain token collections also incentivize holders to burn their tokens. For instance, Gary Vaynerchuk recently launched Burn Island, a burn-to-redeem program that rewards VeeFriends holders for burning their tokens.\n\nSecurity Measures: Can Someone Else Burn My NFT?\n\nNo one can burn your non-fungible token without your consent.\n\nUnless they have access to your wallet keys, your NFT is safe.\n\nHowever, some smart contracts might incorporate a “burn mechanism,” enabling you to destroy your token.\n\nThis implies that you can design a smart contract to permit burning your non-fungible token or even allow others to do so.\n\nThe Permanence of Burning: Can a Burned, Non-Fungible Token Be Recovered?\n\nThe burning is a permanent process.\n\nOnce you dispatch a unit to an unspendable address, it becomes irretrievable.\n\nHowever, it’s possible to mint a new one with similar properties and attributes, although it won’t be identical to the original one.\n\nThe Aftermath: What Happens to Tokens?\n\nBurning a token doesn’t physically destroy the token. Instead, it sends the NFT to a null address, rendering the token unattainable.\n\nOnce you send your token to a null address, it’s lost to the ether because private keys don’t exist for it.\n\nConclusion\n\nBurning a token might seem counterintuitive at first. However, it’s a strategic tool for managing the value of your tokens and your non-fungible token community.\n\nWhether you’re a creator seeking accountability or a non-fungible token buyer looking to capitalize on increasing values, understanding How to Burn a token can be a game-changer.\n\nOur comprehensive guide equips you to navigate the NFT inferno with confidence.\n\nSo torch those tokens, and let’s see what happens!"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vY2EubW92aWVzLnlhaG9vLmNvbS90cmFkZXItam9lLWRlYnV0cy1ldGhlcmV1bS1qb2UtMTEyMTA2MzQ0Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Trader Joe Debuts on Ethereum; JOE Jumps 3% - Yahoo Movies Canada",
        "content": "Decentralized crypto exchange Trader Joe has introduced its stablecoin pools on the Ethereum blockchain, the exchange said on Friday.\n\nThe DEX's Liquidity Pool, an automated market maker (AMM), is now on Ethereum. Trader Joe's AMM was present on Arbitrum, BNB Chain and Avalanche. AMM is the underlying protocol that powers all DEXs.\n\nTrader Joe is now live on Ethereum\n\n\n\nIntroducing Liquidity Book, the innovative and highly efficient concentrated liquidity AMM, to Ethereum ecosystem. pic.twitter.com/sW12IV0db3 — Trader Joe - Live on Mainnet (@traderjoe_xyz) August 4, 2023\n\nAt launch, the exchange will offer only stablecoin pools to prove the efficiency of its liquidity pool.\n\nTrader Joe upgraded its Liquidity Book earlier this year. Liquidity Book V2.1 introduced “auto-pools” that automatically manage depositors’ active positions in high-yield liquidity pools to mitigate risk.\n\nTokens of Trader Joe (JOE) jumped nearly 3% to 31 cents after the announcement.\n\nRead more: Crypto Exchange Trader Joe Nears Launch of Upgraded Trading Engine\n\nUPDATE (Aug. 4, 11:30 UTC): Adds additional details, links.\n\n\n\n"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMikQFodHRwczovL3d3dy5iZW56aW5nYS5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS8yMy8wOC8zMzU3NDM4MC9iaXRjb2luLWV0aGVyZXVtLWVkZ2UtaGlnaGVyLWZvbGxvd2luZy1qb2JzLWRhdGEteGRjLW5ldHdvcmstZW1lcmdlcy1hcy10b3AtZ2FpbmVy0gEtaHR0cHM6Ly93d3cuYmVuemluZ2EuY29tL2FtcC9jb250ZW50LzMzNTc0Mzgw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin, Ethereum Edge Higher Following Jobs Data; XDC Network Emerges As Top Gainer - Benzinga",
        "content": "Bitcoin BTC/USD edged higher, with the cryptocurrency prices trading above the key $29,000 level on Friday.\n\nEthereum ETH/USD also moved slightly higher, trading above the key $1,800 mark this morning.\n\nThe U.S. economy added 187,000 jobs in July, compared to market estimates of 200,000 and compared to a revised 185,000 gain in June. The unemployment rate fell to 3.5% in July from 3.6% in June and versus market estimates of 3.6%.\n\nXDC Network XDC/USD was the top gainer over the prior 24 hours, while Conflux CFX/USD turned out to be the biggest loser.\n\nAt the time of writing, the global crypto market cap rose to $1.17 trillion, recording a 24-hour gain of 0.1%. BTC was trading higher by 0.2% at $29,170 while ETH rose by around 0.2% to $1,836 on Friday.\n\nHere are the top ten crypto gainers and losers over the past 24 hours:\n\nGainers\n\nXDC Network XDC/USD\n\nPrice: $0.08452\n\n24-hour gain: 10.2%\n\nOKB OKB/USD\n\nPrice: $44.72\n\n24-hour gain: 7%\n\nShiba Inu SHIB/USD\n\nPrice: $0.000008598\n\n24-hour gain: 4.5%\n\nGMX GMX/USD\n\nPrice: $51.69\n\n24-hour gain: 4.4%\n\nOptimism OP/USD\n\nPrice: $1.72\n\n24-hour gain: 3.8%\n\nLosers\n\nConflux CFX/USD\n\nPrice: $0.1836\n\n24-hour drop: 4.3%\n\nCompound COMP/USD\n\nPrice: $56.86\n\n24-hour drop: 3.6%\n\nStacks STX/USD\n\nPrice: $0.5898\n\n24-hour drop: 3.4%\n\nLitecoin LTC/USD\n\nPrice: $83.13\n\n24-hour drop: 3.4%\n\nKava KAVA/USD\n\nPrice: $0.8357\n\n24-hour drop: 3%\n\nRead This Next: Top 5 Financial Stocks That May Implode This Quarter"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMikwFodHRwczovL3d3dy5iZW56aW5nYS5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS8yMy8wOC8zMzU4Mzk5NC9hLWxvb2stYXQtYml0Y29pbi1ldGhlcmV1bS1hbmQtZG9nZWNvaW4taW50by10aGUtd2Vla2VuZC1hcy1zdG9jay1tYXJrZXQtdHVybnMtbG93ZXLSAS1odHRwczovL3d3dy5iZW56aW5nYS5jb20vYW1wL2NvbnRlbnQvMzM1ODM5OTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "A Look At Bitcoin, Ethereum And Dogecoin Into The Weekend As Stock Market Turns Lower - ProShares Trust U - Benzinga",
        "content": "Loading... Loading...\n\nBitcoin BTC/USD was trading near flat during Friday's 24-hour trading session, while Ethereum ETH/USD and Dogecoin DOGE/USD were trading in tandem with the apex crypto following jobs data released by the U.S. Labor Department.\n\nNon-farm payrolls showed a gain of 187,000 jobs last month, below the expected 200,000 figure, while the unemployment rate dropped back to 3.5%. The numbers and how they compare to data for August will help the Federal Reserve to decide whether to continue hiking interest rates in September after reinstating its tightening campaign in July.\n\nThe S&P 500 rose at one point on Friday, reacting positively to the data, before bearish pressure came in and dropped the market ETF down under Thursday’s low-of-day. In comparison, the crypto market remained muted, mostly consolidating sideways. The consolidation could continue over the weekend, but if Bitcoin breaks up or down from Wednesday's mother bar, a larger move to the upside or downside could be on the horizon.\n\nIf the general market continues to slide next week, volatility in the stock market is likely to increase.\n\nTraders wishing to trade the potential volatility have multiple options, including the ConvexityShares Daily 1.5x SPIKES Futures ETF SPKY.\n\nSPKY is a 1.5x leveraged fund, which tracks the SPIKES Futures Short-Term Index and measures volatility in broad-based equities in a similar way to the ProShares Ultra VIX Short Term Futures ETF UVXY, which tracks the movement of the S&P 500 VIX Short-Term Futures Index.\n\nFor every 1% daily movement in the SPIKES Futures Short-Term Index, the SPKY fund seeks to move 1.5%, meaning that it's structured for short-term trades and should not be held for a long period of time.\n\nWant direct analysis? Find me in the BZ Pro lounge! Click here for a free trial.\n\nThe Bitcoin and Ethereum Charts: Bitcoin and Ethereum have settled into double inside bar patterns on the daily chart, with all of Thursday's and Friday's price action taking place within Wednesday's trading range. Traders can watch for the apex cryptos to eventually break up or down from the mother bar on higher-than-average volume to gauge future direction.\n\nBitcoin and Ethereum are trading in fairly consistent but shallow downtrends, making a series of lower and lower highs. If big bearish volume eventually enters the cryptos and they continue the downward trajectory, each could eventually test support at the 200-day simple moving average (SMA).\n\nIf the cryptos break up from their respective mother bars, the downtrends are likely to be negated and the cryptos could enter into new uptrends.\n\nBitcoin has resistance above at $30,050 and at $31,418 and support below at $28,690 and at $27,133.\n\nEthereum has resistance above at $1,937 and at $2,020 and support below at $1,825 and at $1,717.\n\nLoading... Loading...\n\nThe Dogecoin Chart: On Wednesday, Dogecoin fell through the bottom horizontal trend line of a descending triangle pattern and lost support at the 200-day SMA, which is bearish. On Thursday, Dogecoin fell lower and on Friday, the crypto was consolidating with an inside bar pattern.\n\nIn Dogecoin’s case, the inside bar leans bearish because the crypto has been trading steeply lower, but like with Bitcoin and Ethereum, traders can watch for a break up or down from Thursday's mother bar on higher-than-average volume to determine future direction,\n\nDogecoin has resistance above at $0.075 and $0.083 and support below at $0.07 and $0.065.\n\nRead Next: Revolut Pulls Plug On Crypto Trading In US, Blames ‘Changing Regulatory Climate’\n\nPhoto: Unsplash"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vYXUubmV3cy55YWhvby5jb20vdHJhZGVyLWpvZS1kZWJ1dHMtZXRoZXJldW0tam9lLTExMjEwNjM0NC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Trader Joe Debuts on Ethereum; JOE Jumps 3% - Yahoo News Australia",
        "content": "Decentralized crypto exchange Trader Joe has introduced its stablecoin pools on the Ethereum blockchain, the exchange said on Friday.\n\nThe DEX's Liquidity Pool, an automated market maker (AMM), is now on Ethereum. Trader Joe's AMM was present on Arbitrum, BNB Chain and Avalanche. AMM is the underlying protocol that powers all DEXs.\n\nTrader Joe is now live on Ethereum\n\n\n\nIntroducing Liquidity Book, the innovative and highly efficient concentrated liquidity AMM, to Ethereum ecosystem. pic.twitter.com/sW12IV0db3 — Trader Joe - Live on Mainnet (@traderjoe_xyz) August 4, 2023\n\nAt launch, the exchange will offer only stablecoin pools to prove the efficiency of its liquidity pool.\n\nTrader Joe upgraded its Liquidity Book earlier this year. Liquidity Book V2.1 introduced “auto-pools” that automatically manage depositors’ active positions in high-yield liquidity pools to mitigate risk.\n\nTokens of Trader Joe (JOE) jumped nearly 3% to 31 cents after the announcement.\n\nRead more: Crypto Exchange Trader Joe Nears Launch of Upgraded Trading Engine\n\nUPDATE (Aug. 4, 11:30 UTC): Adds additional details, links.\n\n\n\n"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZW4uZXRoZXJldW13b3JsZG5ld3MuY29tL21hdHRlci1sYWJzLWRlbnktcG9seWdvbi1jb2RlLXBsYWdpYXJpc20v0gFOaHR0cHM6Ly9lbi5ldGhlcmV1bXdvcmxkbmV3cy5jb20vbWF0dGVyLWxhYnMtZGVueS1wb2x5Z29uLWNvZGUtcGxhZ2lhcmlzbS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Matter Labs Denies Polygon's Allegations Of Open-Source Code Plagiarism - Ethereum World News",
        "content": "Matter Labs has denied allegations of source code plagiarism made by Polygon.\n\nPolygon previously accused Matter Labs of copying part of its open-source code without giving due credit.\n\nIn response, Matter Labs claimed it had sufficiently attributed the copied code to Polygon.\n\nMatter Labs, the crypto firm behind zkSync, has responded to the recent plagiarism allegations made by fellow Ethereum layer-2 scaling solution Polygon. Earlier today, Polygon accused Matter Labs’ developers of copying parts of its open-source code without giving due credit for the plagiarized code. Matter Labs has denied the allegations and argued that it had sufficiently attributed the copied part to Polygon.\n\nMatter Labs: Polygon Is Making “Untrue Claims”\n\nEarlier today, Polygon published a blog post titled “Protect the Open Source Ethos”, which accused Matter Labs of copying a “significant amount” of source code from the Plonky2 library to its recently unveiled proving system called Boojum. According to Polygon, the code was copied with copyrights or attribution to its original authors.\n\nPolygon also called out Matter Labs’ founder Alex Gluchowski for claiming that Boojum is more efficient than Plony2. Polygon questioned the authenticity of Gluchowski’s claim, given that Boojum’s code concerning performance was directly copied from Plonky2. Polygon further cited Boojum’s introductory post, which failed to mention the layer-2 scaling solution or its developers.\n\nIn response to Polygon’s allegations, Matter Labs clarified that its Boojum proof system derived 5% of its code from Plonky2, which was “prominently attributed” in the first line of its library. In a statement to CoinDesk, a Matter Labs spokesperson said that Polygon’s blog post made untrue claims about Boojum’s code.\n\nCEO Alex Gluchowski followed up with a detailed tweet where he expressed his disappointment with Polygon’s allegations. Gluchowski reiterated that only 5% of the Boojum code was based on the Plonky2 code. He added that Boojum and Plonky2 were both implementations of the Redshift, which he claimed was introduced by Matter Labs 3 years before Polygon published the Plonky2 paper.\n\nEvery decision we make as a team towards building @zksync is driven by our ethos, which is based on integrity and transparency. We have made honest mistakes in the past, but we always did our best to openly acknowledge them and take responsibility. And will always do so in the… https://t.co/4yjpSCHC2d — Alex G. ∎ (@gluk64) August 4, 2023\n\nIf the Polygon Zero team wanted additional credit, the easiest way would have been to submit a pull request which we would have happily accepted. Going ahead with public accusations of a complete lack of attribution is anything but the spirit of the Open Source movement.” Alex Gluchowski, Co-founder and CEO of Matter Labs\n\nThe tension between Polygon and Matter Labs comes as both firms rush to deliver the first zero-knowledge Ethereum Virtual Machine (zkEVM) to offer cheaper and more efficient transactions on the Ethereum network. Earlier this year, Polygon’s Mihailo Bjelic and Matter Labs’ Alex Gluchowski were involved in a heated exchange over the latter’s zkSync Era, particularly its security audits."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZW4uZXRoZXJldW13b3JsZG5ld3MuY29tL2FsY2hlbWl4LWN1cnZlLWV4cGxvaXRlci1yZXR1cm4tNGtldGgv0gFLaHR0cHM6Ly9lbi5ldGhlcmV1bXdvcmxkbmV3cy5jb20vYWxjaGVtaXgtY3VydmUtZXhwbG9pdGVyLXJldHVybi00a2V0aC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Alchemix Curve Exploiter Returns $9 Million In ETH - Ethereum World News",
        "content": "The Curve Finance team confirmed contact with the Alchemix alETH pool exploiter via on-chain messages.\n\nCurve, Metronome, and Alchemix previously asked the exploiters to return 90% of the drained funds for a 10% bounty in return.\n\nAn address holding assets stolen from JPEGd, another affected DeFi protocol, also returned funds amid recovery efforts from affected projects and white hat hackers.\n\nMeanwhile, founder Michael Egorov has sold 106 million CRV tokens in OTC deal to rebalance debts on DeFi lenders like Aave and Fraxlend.\n\nThe Alchemix/CurveFinance Exploiter returned nearly $9 million in funds drained from the DeFi protocol following on-chain negotiations spotted via Etherscan on Friday.\n\nAlchemix Finance received a blockchain transaction note asking the protocol to confirm its wallet address. The exploiter then transferred 4,820 ether over three transactions to Alchemix’s multi-sig wallet. At current prices, the assets are worth $8.9 million.\n\nFriday’s transaction represents a portion of around $61 million drained from decentralized exchange Curve Finance. The attacker reportedly exploited a code bug in Vyper’s compiler, a smart contract programming language used by Curve across its platform.\n\nThe code bug allowed malicious attackers to drain liquidity pools affecting Metronome, Alchemix, and JPEGd. So far, exploiters have returned some of the looted assets to Alchemix and JPEGd.\n\nCurve, Metronome, and Alchemix previously asked the exploiters to return 90% of the drained funds for a 10% bounty in return. CRV gained 5% in price on Friday following news of Alchemix’s recovery.\n\nCurve Founder Offloads CRV To Balance Debt\n\nCRV, Curve native token and a cryptocurrency widely used across Ethereum’s DeFi lending ecosystem dipped in price following exploits on the exchange’s in-house pools.\n\nThe drop in CRV’s price spelled danger for loans taken by founder Michael Egorov. Egorov deposited million of CRV tokens as collateral on DeFi lending protocols like Aave and Fraxlend. These loans risked liquidation if CRV’s price fell below $0.30.\n\nIn response to the CRV’s declining price amid last weekend’s exploit, Egorov spurred a deluge of over-the-counter (OTC) deals with some 13 investors including Tron founder Justin Sun.\n\nEgorov’s CRV sales from OTC trades total 106 million CRV tokens and he received $42 million USDT in return. This liquidity has seemingly gone into balancing debts on Aave and other lenders amid concerns of a DeFi implosion.\n\nDeFi analyst Ignas opined that a CRV nosedive looked unlikely due to an increase in Curve’s 3Crypto pool featuring crvUSD+ETH+CRV."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2xlYXJuLXRvLWZpbmQtb25jZS1pbi1hLWxpZmV0aW1lLW9wcG9ydHVuaXRpZXMtbGlrZS1iaXRjb2luLXNwYXJrLWFuZC1ldGhlcmV1bS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 05 Aug 2023 07:00:00 GMT",
        "title": "Learn To Find Once In a Lifetime Opportunities Like Bitcoin Spark and Ethereum - Analytics Insight",
        "content": "Great investments bear more fruits when investors chip in early. When investing in financial markets, timing is critical to making significant gains. This is why investors look for incoming ICO projects that are yet to hit mainstream adoption and massive popularity. Although Ethereum has been around for some time, and great potential for the network’s digital asset ETH to surge exists, upcoming ICO projects like Bitcoin Spark have more potential to reward investors.\n\nThe Rise Of Bitcoin Cash\n\nBitcoin Cash is classified among the crypto assets that offer an alternative platform to the Bitcoin network, hence the name Bitcoin Alternatives. The project was developed as a significant Bitcoin hard fork upgrade in 2017 to address the challenges and limitations of the first-generation blockchain. Unlike Bitcoin, Bitcoin Cash can host a larger volume of transactions in an isolated block while reducing transaction fees concurrently.\n\nIs Ethereum a good investment?\n\nEthereum has progressed immensely since its inauguration. The platform pioneered smart contracts, a technology that has reshaped the decentralized finance industry by deploying decentralized applications. The network capitalizes on the proof of stake consensus mechanism to promote decentralization and growth of the ecosystem.\n\nBitcoin Spark is a Once in a Lifetime opportunity\n\nFinding crypto gems that have the potential to give massive returns on investment is relatively tricky. Bitcoin Spark is the top Bitcoin hard fork ICO that has great utility. The project intends to solve the shortcomings associated with Bitcoin network functionalities. These challenges include high transaction fees, slow transactions, and centralization in the mining process.\n\nBitcoin mining is quite profitable. However, it has a massive entry barrier involving sophisticated mining equipment, large volumes of electricity, and high expenses. Bitcoin Spark utilizes the proof of process consensus mechanism that blends Proof of Work and Proof of Stake methodologies. This means that the network has both miners and validators. Bitcoin Spark’s mining is not as complicated as that of Bitcoin. Bitcoin Spark’s team is working on software mining applications to support mining BTCS tokens on handheld electronic devices such as mobile phones, laptops, and tablets.\n\nThe project is on the verge of beginning its presale. Bitcoin Spark‘s ICO phase 1 is scheduled to start on 1st August 2023, where investors will purchase BTCS tokens at a discounted price of $1.50. These early adopters will also get a 20% bonus on purchases from 1st August to 11th August.\n\nBitcoin Spark is also unique because participants will earn passive income, unlike the case of Bitcoin and Ethereum, where investors rely solemnly on staking/mining and capital gains. The Bitcoin Spark team is setting up two revenue streams. First, participants will be lent processing power to individuals or companies. This processing power is vital in virtual high-end activities such as video rendering. Miners will earn 97% from this income stream, while the remaining 3% will be allocated to the development team.\n\nSecondly, the platform’s website and mobile applications will have an advertisement slot governed by community members. Advertisers will pay for the service in BTCS tokens. 50% of the income generated from this stream will be directed to the team behind the project’s development. The remaining 50% will be distributed to the network’s participants.\n\nFor more information:\n\nWebsite: https://bitcoinspark.org/\n\nBuy BTCS: https://network.bitcoinspark.org/register\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZmluYm9sZC5jb20vZXRoZXJldW0taXMtYS10aWNraW5nLWJvbWItcHJpbWVkLWZvci1zcGVjdGFjdWxhci1ydW4tc2F5cy1leHBlcnQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Ethereum is a 'ticking bomb' primed for 'spectacular run', says expert - Finbold - Finance in Bold",
        "content": "This year, Ethereum (ETH) has been notably underperforming in comparison to Bitcoin (BTC), with its year-to-date gains lagging roughly 20% behind the leading cryptocurrency.\n\nNonetheless, a potential shift in circumstances offers a glimmer of hope. As market dynamics evolve and new developments emerge, Ethereum’s trajectory may be poised for a transformation, according to crypto market experts.\n\nIn fact, ETH is a ‘ticking bomb,’ Glassnode co-founder known as Negentropic said on Twitter on August 3. The crypto guru acknowledged short-term risks for Ethereum; however, in the medium term, he sees the cryptocurrency as a golden opportunity.\n\nTime to shift from BTC to altcoins\n\nAccording to Negentropic, the ETH/BTC chart signals that better days may be coming for alternative assets, advising traders to make the shift.\n\n“According to the ETHBTC trading pair, it’s time to shift from BTC to altcoins.” – Negentropic wrote.\n\nWhile Bitcoin may show strength in the short run, the expert explained, Ethereum is “gearing up for a spectacular run!”\n\nHis analysis of the ETH/BTC shows that the pair has been inking a series of lower highs since, and currently stands close to a 1-year low. This could serve as a potential reversal signal for Ethereum, and a possible breakout may be on the horizon.\n\nETHBTC chart. Source: Negentropic\n\nThe Ethereum to Bitcoin pair, often denoted as ETH/BTC, represents the exchange rate between ETH and BTC. In other words, it shows how many units of Bitcoin are needed to buy one unit of Ethereum.\n\nWhen ETH/BTC is trading low, it means that Ethereum’s value is relatively weaker compared to Bitcoin, and it takes fewer units of Bitcoin to acquire one unit of Ethereum. This situation might indicate that Ethereum is underperforming or facing weaker demand compared to Bitcoin in the market.\n\nEthereum price analysis\n\nAt the time of publication on August 4, ETH was changing hands at $1,835, up 0.36% in the past 24 hours.\n\nOn a weekly chart, the crypto token is down more than 1.3% and over 5% on the month, similar to Bitcoin’s 30-day drop.\n\nETH 1-month price chart. Source: Finbold\n\nYear-to-date, Ethereum gained around 53%, while BTC surged 75%.\n\nAnother metric that may suggest a resurgence in ETH is the recent growth in the blockchain network. Notably, the number of Ethereum addresses soared to 450,000 at the end of July, hitting the highest level in 2 years.\n\nThe blockchain witnessed 80,000 new address additions at the end of last month, according to Santiment data.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5jcnlwdG9nbG9iZS5jb20vbGF0ZXN0LzIwMjMvMDgvY3J5cHRvLWFuYWx5c3QtYmVuamFtaW4tY293ZW4tcHJlZGljdHMtcG90ZW50aWFsLTUwLWRyb3AtaW4tZXRoZXJldW0tcmVsYXRpdmUtdG8tYml0Y29pbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 05 Aug 2023 07:00:00 GMT",
        "title": "Ethereum Could See 50% Drop Against Bitcoin: Crypto Analyst Benjamin Cowen's Forecast - CryptoGlobe",
        "content": "Prominent crypto analyst Benjamin Cowen has recently suggested that a single event could trigger a significant drop in Ethereum’s (ETH) value relative to Bitcoin (BTC).\n\nAccording to a report by The Daily Hodl published earlier today, in a recent discussion with Crypto Banter host Ran Neuner, Cowen speculated that the ETH/BTC pair could experience a drop of over 50% from its current value of 0.063 BTC, equivalent to $1,828.\n\nCowen’s prediction is based on his observation that the ETH/BTC pair appears to form a bearish double-top pattern on the monthly chart. This pattern suggests that investors will likely trade their ETH for BTC during any rally. Cowen described the current situation as a “massive distribution phase,” similar to patterns observed in previous cycles.\n\nCowen notes that historically the ETH/BTC pair has shown a tendency to decline from June through December. Cowen anticipates a potential drop to as low as 0.03 BTC ($871):\n\n“So what I would think is going to happen is that Ether/Bitcoin could plummet to around that 0.03 (BTC) to 0.04 (BTC) level and once the Ethereum/Bitcoin valuation gets there, I think that it could mark the end of the altcoin reckoning.“\n\nAccording to Cowen, the catalyst for this significant ETH/BTC decline could be a retracement in the stock market. He drew parallels with the late 2017 scenario when the ETH/BTC pair dropped to .022 BTC. A second drop to this level in 2018 marked the end of many altcoins’ reckoning. Cowen suggests that a similar pattern could be unfolding now, with a secondary drop to the level of 0.049 BTC potentially on the horizon.\n\nHowever, Cowen also cautioned that even after reaching this level, the ETH/BTC pair could experience further drops before finding a bottom. He believes that a potential seasonal correction in the S&P 500 could be the trigger for this scenario.\n\nFeatured Image Credit: Photo / illustration by vjkombajn via Pixabay"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3LmNyeXB0b3BvbGl0YW4uY29tL2Jhc2UtYW5ub3VuY2VzLW1ham9yLW9uY2hhaW4tZGV2ZWxvcG1lbnRzLWFuZC1pbml0aWF0aXZlcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 05 Aug 2023 07:00:00 GMT",
        "title": "Ethereum layer 2 scaling solution Base announces major onchain developments and initiatives - Cryptopolitan",
        "content": "Base, the Ethereum L2 (layer 2) scaling layer backed by Coinbase, has revealed an important milestone in its mission to bring more users and builders onchain. Also, Base declared that it has opened bridging for selected Ethereum assets and will launch its mainnet on August 9, offering unrestricted access for developers to deploy their applications on the platform.\n\nThis launch will include bridging of Ethereum, Coinbase staked Ethereum, dai, and USDC to Base, with withdrawals of the same assets to Ethereum also enabled. While initially limited to these options, there are indications that more may be added in the future. Since opening the Ethereum bridge, Base’s total value locked (TVL) reached its peak value, registering more than $92 million.\n\nAccording to L2beat, a protocol aggregator, Base ranks within the top ten scaling solutions based on value locked. The recent initiation of Ethereum bridging escalated Base to its apex value, documenting over $92 million in total value locked (TVL). An intriguing spike in TVL was observed with the issue of the meme token bald on June 30. The token’s valuation skyrocketed by 40,000% within a mere 48 hours, although it did retrace to its inception levels soon after.\n\n‘Onchain Summer’ and grants for builders\n\nCommemorating the momentous occasion of its L2 chain launch, Base is championing “Onchain Summer.” As detailed by Base, this initiative is a month-long onchain festival orchestrated by a diverse ensemble of 50 illustrious builders, brands, products, artists, and creators. The festivity aims to offer many on-chain activities spotlighting art, music, gaming, advocacy, and more. The entire roster of collaborators for this event remains under wraps, slated for revelation on August 9. However, teasers include notable names such as Coca-Cola, Atari, Opensea, Pixelmon, and Optimism.\n\nTo catalyze innovation on its platform, Base is earmarking 100 ETH to disburse as grants to prospective builders and creators. These grants are being facilitated in collaboration with Prop House, a pioneering infrastructure platform capacitating capital allocation to creators. The grants are tailored to stimulate a spectrum of Base-related endeavors, from creating art and advanced applications to spearheading crypto advocacy and championing sensible legislation.\n\nThe upcoming Base initiatives, including the ‘Onchain Summer’ and grants for developers, mark a pivotal chapter in the L2 solution’s journey. With its mainnet launch imminent, Base is poised to become a formidable player in the Ethereum ecosystem, ushering in a new era of onchain innovation."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDgvMDQvZGV2ZWxvcGVyLWJsb2NrZWQtOTAwMC1ldGhlcmV1bS1ldGgv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Developer: blocked $9000 in Ethereum (ETH) - The Cryptonomist",
        "content": "On Twitter, a bizarre story is circulating about an Ethereum developer who allegedly “accidentally” blocked 5 ETH (the equivalent of $9,000 at the time of writing) for 100 years in order to create his first TEST token. However, according to some, the story is being made public just to attract attention.\n\nEthereum: a developer accidentally blocks 5 ETH for 100 years\n\nTwitter is buzzing about the bizarre story of the Ethereum developer who allegedly accidentally blocked 5 ETH (or $9,000) for 100 years while working on the creation of his new TEST token.\n\nOn the 4chan forum, in fact, the developer allegedly created a post asking for help in creating his first ERC-20 token and blocking it. From there, then, the actual creation of TEST on the Ethereum mainnet took place.\n\nSoon after, a user would have suggested that the developer use UNCX Network, a protocol for blocking liquidity tokens.\n\nAnd so the developer allegedly decided to add 5 ETH and 1 billion TEST tokens as liquidity on Uniswap’s DEX, receiving 70,700 LP tokens in return. These LP tokens can be redeemed for the underlying liquidity.\n\nAfter that, following the suggestion, the Ethereum developer would have locked his LP tokens, using the UNCX Network protocol, but putting 31 December 2123 as the expiration date.\n\nThis means that for 100 years, the tokens are no longer accessible and cannot be used to redeem the original ETH or the locked TEST tokens on Uniswap.\n\nEthereum: the story of the developer locking 5 ETH for 100 years crafted to attract attention\n\nAfter revealing that he had locked $9,000 in ETH for 100 years by posting related links, other 4chan forum users pointed out that the TEST token was growing.\n\nAnd indeed, TEST soared initially to $0.006, reaching a market cap of $6 million.\n\nSoon after, its price dropped to as low as $0.0014 with a market cap of $1.5 million.\n\nHowever, not all users are convinced of the “accidental mistake” of the developer of TEST. On the contrary, some reportedly questioned the whole affair, claiming that it was a move to attract attention.\n\nFirst among them, on 4chan, is a user who commented “This is not testnet ser,” probably based on the idea that funds have been locked for too long. Then came the tweets that continued to spread skepticism about the story.\n\nThe price of ETH and its predictions\n\nThe spread of these stories among Ethereum developers, contribute in some way to talk about the smart contract crypto par excellence.\n\nAnd so, taking a look at the price of ETH, the monthly chart, shows that there is a slight bear market of the second largest crypto by market capitalization.\n\nAt the time of writing, ETH is worth $1830. Far from the $2,022 touched on 14 July. Despite this slight drop in price, there are those who argue that for this second part of 2023, the situation will be different.\n\nIn fact, Finder recently published its prediction on the price of Ethereum, revealing that in 2023, ETH is expected to peak at $2,700, and then end the year around $2,400."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vYml0Y29pbmlzdC5jb20vdmFsa3lyaWUtZmlsZXMtY29udmVydC1idGYtdG8tYml0Y29pbi1hbmQtZXRoZXItZXRmL9IBT2h0dHBzOi8vYml0Y29pbmlzdC5jb20vdmFsa3lyaWUtZmlsZXMtY29udmVydC1idGYtdG8tYml0Y29pbi1hbmQtZXRoZXItZXRmL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 04 Aug 2023 07:00:00 GMT",
        "title": "Double Impact: Valkyrie Files To Convert BTF To Bitcoin And Ether ETF | Bitcoinist.com - Bitcoinist",
        "content": "Asset management firm Valkyrie has moved to convert its Bitcoin Strategy exchange-traded fund (BTF) into a Bitcoin and Ether Strategy ETF.\n\nAccording to the firm’s website, BTF is an actively managed exchange-traded fund (ETF) available through Nasdaq. BTF, which primarily invests in BTF futures contracts, represents one of Valkyrie’s first endeavors in the Bitcoin derivative product markets.\n\nValkyrie Files 497 For Bitcoin, Ether Futures ETF: Bloomberg Analyst\n\nInvestopedia defines form 497 as a regulatory document that allows investment companies and mutual funds to submit their definitive materials in the Securities and Exchange Commission’s (SEC’s) EDGAR (electronic data gathering, analysis, and retrieval) filing system.\n\nOn Friday, August 4, Bloomberg senior ETF analyst Eric Balchunas disclosed on X (formerly Twitter) that Valkyrie filed a form 497 to convert its BTF to a Bitcoin and Ether Futures ETF on October 3, 2023. This means that BTF – which was initially a Bitcoin Futures ETF only – would also include an Ether Futures ETF.\n\nBalchunas tagged the Valkyrie submission as the 14th Ether ETF application so far. He also noted that Valkyrie may be trying to outleap competition, as the firm’s proposed date – October 3rd – is two weeks ahead of other applicants’ scheduled launch.\n\nFurthermore, Balchunas likened this application to that of the first pot ETF, MJ, in 2017. At the time, ETF Managers Group (ETFMG) combined a new marijuana ETF with an existing ETF, the Tierra XP Latin America Real Estate ETF (LARE).\n\nAnother Bloomberg intelligence analyst James Seyffart called it a “massive” move while admitting that it is still unclear how the ETF would work.\n\nIf approved, this would come as another advancement for Valkyrie, especially after the recent positives recorded on its spot Bitcoin ETF application.\n\nIn July, Bitcoinist reported that the United States Securities and Exchange Commission listed the asset management company in the Federal Register as an applicant for a spot Bitcoin ETF alongside seven other firms.\n\nValkyrie Joins 13 Other Ethereum ETF Filings For SEC Approval\n\nAs mentioned earlier, Valkyrie’s latest filing represents the 14th Ether Futures ETF application. More than a dozen applications from major players, like ProShares, VanEck, Grayscale, and Bitwise, have already been submitted to the Securities and Exchange Commission.\n\nProShares specifically has exhibited great interest in the Ethereum Futures ETF, with four filings awaiting the SEC’s approval. Notably, the company filed for an equal weight Bitcoin & Ethereum ETF in its 4th application.\n\nWhile there has been rising interest in Ethereum Futures ETF lately, many crypto analysts are not seeming too optimistic about its chances of being approved by the SEC.\n\n“My base case is that these are withdrawn by the end of next week. These firms probably had these on the shelf ready to go and just needed to re-submit them,” James Seyffart mentioned in one of his posts.\n\nHowever, he also speculated that the applicants may have received some sort of signal from the SEC, as he believed most firms won’t bother applying if they knew their chances were “zero or near zero”.\n\nETHUSDT trading at $1,831.44 | Source: daily ETHUSDT chart from TradingView\n\nFeatured image from Bernard Marr, chart from TradingView"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmNyeXB0by1uZXdzLWZsYXNoLmNvbS9uZXctaGlubWFuLWRvY3VtZW50cy1hbmQtZXRoZXJldW1zLWpvZS1sdWJpbi1yYWlzZS1vdXRyYWdlLWZyb20teHJwLWNvbW11bml0eS_SAXZodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vbmV3LWhpbm1hbi1kb2N1bWVudHMtYW5kLWV0aGVyZXVtcy1qb2UtbHViaW4tcmFpc2Utb3V0cmFnZS1mcm9tLXhycC1jb21tdW5pdHkvP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 05 Aug 2023 07:00:00 GMT",
        "title": "New Hinman Documents and Ethereum’s Joe Lubin Raise Outrage from XRP Community - Crypto News Flash",
        "content": "Newly released documents show Joseph Lubin brought William Hinam and Vitalik Buterin together before the SEC director’s speech in 2018.\n\nOutrage sparked within the XRP community with some stating that the Hinman speech was actually “The Ether Speech”.\n\nIn the latest controversial revelation, oversight watchdog group Empower Oversight released a new batch of documents for a Freedom of Information Act (FOIA) request. The documents highlight the deeper involvement of Ethereum co-founder Joseph Lubin and his blockchain firm ConsenSys in the crypto speech by former SEC Director of Corporation Finance, William Hinman, on June 14, 2018.\n\nThis speech has been a source of disagreement in the Ripple case, particularly because the SEC has stated that other cryptocurrencies, like XRP, were also considered unregistered securities. Ripple attorneys stressed much on the Hinman speech of 2018 during its fight with the SEC, as it noted that assets like Ethereum aren’t securities. However, the latest details of Lubin’s involvement have sparked major outrage in the XRP community.\n\nThe documents released by the watchdog group reveal that “Lubin also appears to have been responsible for bringing Hinman and Ethereum creator Vitalik Buterin together as the speech drafting advanced”. Moreover, investors and lawyers closely linked to Ethereum were notably present at a meeting on March 28, 2018, regarding a proposal for a crypto safe harbor.\n\n4. Lubin also apparently brought Hinman and Ethereum creator Vitalik Buterin together as the speech was drafted.https://t.co/e1l1q4posg — Empower Oversight (@EMPOWR_us) August 3, 2023\n\nThe documents also show that Hinman had a meeting with Chris Lin, a partner at Simpson Thacher, which goes against advice on conflicts of interest rules. The SEC Ethics Office had warned Hinman multiple times because he was receiving millions of dollars from Simpson Thacher while working at the SEC.\n\nEmpower Oversight has been leading the fight for more transparency at the SEC. They have filed many requests and lawsuits under the Freedom of Information Act (FOIA) to make the SEC release documents related to their decisions about cryptocurrency matters.\n\nOutraged XRP Community Reacts\n\nThe news has sparked reactions among XRP supporters. In a tweet yesterday, Crypto-Law.US pointed out that the newly disclosed emails show how Lubin influenced Hinman’s decision to title his speech “The Ether Speech.”\n\nJUST ADDED to our Document Library:\n\n✅The Hinman-Lubin Emails, detailing how @ethereumJoseph and @Consensys initiated contact with Hinman & his staff, and drove Hinman's thinking on what he would later call \"the Ether speech\" 👇https://t.co/DJRcWUZb41 — CryptoLaw (@CryptoLawUS) August 3, 2023\n\nAs a response, Attorney John Deaton, the founder of Crypto-Law.US, shared how Hinman lied during his deposition in the Ripple lawsuit. Hinman had claimed that he never discussed the content of his speech with anyone outside the SEC before June 14. However, the Hinman documents revealed that he had a meeting with Buterin a week before his speech on cryptocurrencies.\n\nFred Rispoli, a lawyer at HODLaw, praised the efforts of Empower Oversight, tweeting, “Great job Empower Oversight. SEC never expected these documents to be made public…”\n\nSimilarly, Digital Asset Investor.XRP also questioned the double standards noting: “Why was Bill Hinman doing backflips to accommodate Joseph Lubin and Vitalik Buterin while at the same time giving Brad Garlinghouse the run-around with the help of Jay Clayton and even coming back to the SEC after he left to make sure the Ripple lawsuit went through?”\n\nThis article is provided for informational purposes only and is not intended as investment advice. The content does not constitute a recommendation to buy, sell, or hold any securities or financial instruments. Readers should conduct their own research and consult with financial advisors before making investment decisions. The information presented may not be current and could become outdated."
    }
]