[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vdGhlZGFsZXNyZXBvcnQuY29tL2NyeXB0by1uZnRzL2V0aGVyZXVtLWV0aC1zdXBwbHktaW4tZGVmbGF0aW9uLWFzLWNpcmN1bGF0aW9uLWhhcy1kZWNyZWFzZWQtZXZlcnktZGF5LXNvLWZhci1pbi0yMDIzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Feb 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) Supply In Deflation, As Circulation Has Decreased Every Day So Far In 2023 - The Dales Report",
        "content": "Ethereum (ETH) Supply In Deflation, As Circulation Has Decreased Every Day So Far In 2023\n\nEthereum Ether (ETH) cryptocurrency, and the burning of the crypto asset with each mined block, has led to a reduction in supply in every day in 2023 today date—52 days total.\n\nThe Ethereum blockchain, which supports smart contracts and is now the world’s largest blockchain in terms of the scale to connected ecosystem of decentralized applications, is powered by the Ether token. By market capitalization, Ether is the second-largest cryptocurrency.\n\nAccording to data derived from the website ultrasound.money, circulation has decreased by almost 31,500 ETH since The Merge, which occurred in September 2022. This effectively shifted the network’s move to the proof-of-stake (PoS) consensus from its current proof-of-work. The concept of staking was introduced via the new Ethereum consensus engine, The Beacon Chain, a PoS chain released in 2020 that coexists with the Ethereum Mainnet, which is still a proof-of-work network.\n\nHad The Merge not occurred, the amount of ETH in circulation would have actually increased by approximately 1.8 million—over and above the current supply 120,489,978 ETH units.\n\nIn addition to having reduced its issuance, Ethereum benefits from EIP-1559, which determines that the base rate of commissions in each block of the network is burned. Since its implementation in August 2021, a total of 2,928,514 ethers have been burned, with an average of 3.6 ETH per minute.\n\nThis network activity is a key point to reach deflation. The more transactions there are on Ethereum, the more ETH will be burned.\n\nReduced Supply Intended To Prop-Up ETH Value\n\nOne of the main purposes for developers who came up with The Merge is for ether to become a deflationary, rather than inflationary, asset. The idea is to withdraw the amount of ethers in circulation to promote and increase in value of the cryptocurrency. This is opposite in the way that modern fiat currency systems work.\n\nThis also differs from the monetary policy of Bitcoin (BTC) , the only cryptocurrency above ETH in terms of market capitalization. Bitcoin has a rising supply of BTC being mined, although at some point in the future mined supply will reach zero.\n\nKeep in mind, the rate of issuance since its genesis in 2015 has been greater than that of Bitcoin, reflected in its circulating volume of 120 million ETH. This is approximately 578% more than the 19 million BTC that have already been mined."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1wcmljZS1yYWxseS1oaXQtY3J1Y2lhbC1yZXNpc3RhbmNlLWFzLWluc3RpdHV0aW9uYWwtaW52ZXN0b3JzLWFyZS1pbi13YWl0LWFuZC1zZWUtbW9kZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Feb 2023 08:00:00 GMT",
        "title": "Ethereum price rally hit crucial resistance as institutional investors are in 'wait and see' mode - Cointelegraph",
        "content": "Ether (ETH) fell short of a bullish breakout based on technical and on-chain analysis, suggesting that the consolidation below the $2,000 price level could continue in the medium term. At the same time, a lack of sellers and strong fundamentals will likely protect Ether from steep declines.\n\nEther encounters resistance at long-term bullish reversal points\n\nETH/USD has increased by 42.80% since the start of 2023 thanks to a short squeeze in the altcoin market, negative investor sentiment and low liquidity conditions. Based on on-chain and technical levels, the rally has paused at a crucial bull-bear pivot.\n\nGlassnode’s Relative Unrealized Loss metric measures the loss scale on Ether holders’ books. The orange line represents the bull-bear pivot line, where consolidation above this level signifies bear trends and vice versa. Usually, the market begins bullish trends after a breakout from previous all-time highs or consolidation over long periods, signified by a steep decline in the Unrealized Loss metric.\n\nEthereum unrealized loss metric. Source: glassnode\n\nSimilarly, from a technical perspective, Ether bulls failed to overcome the resistance at 0.082 Bitcoin (BTC), bringing the price back to the parallel trading range between 0.053 BTC and 0.082 BTC.\n\nETH/BTC weekly price chart. Source: TradingView\n\nWill this time be different?\n\nBased on historic levels, Ether missed the previous bottom levels by a huge margin; the minimum percentage of supply in profit extended to 42.1% compared to the 20%–30% tapped during previous bear markets. It suggests the likelihood of more pain ahead for ETH holders. However, on-chain trends show robust activity and buying, reducing the downside risk significantly.\n\nEthereum’s percentage supply in profit. Source: glassnode\n\nThe net position change of Ether on exchanges shows a stark difference between the current and previous bear markets. Between 2018 and 2020, Ether inflows to exchanges were significantly higher than outflows, indicating that many holders moved their coins to exchanges to sell. However, during the negative period of 2022, although the price dropped, exchange outflows remained strong, suggesting that the selling pressure is weaker in the current bear market.\n\nETH net exchange position change. Source: glassnode\n\nThe percentage supply of Ether locked in smart contracts tells a similar story, with no significant declines in Ether locked in smart contracts. The uptrend that began in late 2020 held strong through the downturns of 2022, suggesting that withdrawals are unlikely anytime soon.\n\nThe percentage supply of ETH locked in smart contracts. Source: glassnode\n\nEther has a lot going on as the network continues to evolve to support sustainable usage and yields for Ether holders. Ethereum’s shift from proof-of-work to proof-of-stake in September 2022 was a momentous event for the network, as it became environmentally friendly and, more importantly, reduced inflation.\n\nMoreover, the Ethereum Improvement Proposal 1559 proposal implemented earlier in 2022 introduced burning of Etherum fees, which, combined with reduced issuance after the Merge, contributed to making the asset deflationary. The total Ether supply is down around 0.015% since the Merge.\n\nHowever, CoinShares’ data of institutional flow into digital asset investment products shows that more sophisticated investors have yet to warm up to Ether, sticking primarily to Bitcoin. The year-to-date investment in Ether in 2023 has been only $8 million, compared to $158 million in Bitcoin and $23 million in Bitcoin shorts.\n\nInstitutional flows into digital asset investment products. Source: CoinShares\n\nRegulatory clarity and Ethereum’s scalability challenges are likely the key reasons behind reluctance among institutional investors. The United States Securities and Exchange Commission recently fined Kraken $30 million for offering ETH staking, which the regulatory body deemed as being a security.\n\nAs centralized service providers like Kraken and possibly Coinbase are prohibited from offering these services, institutions may be reluctant to try decentralized liquid staking platforms, such as Lido and Rocket Pool.\n\nThe exuberant gas fees on Ethereum remains a prolonged challenge that is limiting mass adoption. The average transfer fee for ERC-20 assets on Ethereum ranges between $2 and $5, with simple swaps costing around $5–$20.\n\nThese charges are considerably high compared to other chains and centralized exchange fees. While development has happened across the layer-2 space, the institutions appear to be in a “wait and see” mode as they analyze the development of the crypto space.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wMi8yMS9jcnlwdG8tbWluZXItaGl2ZS1ibG9ja2NoYWlucy1wb3N0cy1xMy1sb3NzLWFzLWV0aGVyZXVtLW1lcmdlLWN1dHMtcmV2ZW51ZS1taW5pbmctbWFyZ2luL9IBigFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wMi8yMS9jcnlwdG8tbWluZXItaGl2ZS1ibG9ja2NoYWlucy1wb3N0cy1xMy1sb3NzLWFzLWV0aGVyZXVtLW1lcmdlLWN1dHMtcmV2ZW51ZS1taW5pbmctbWFyZ2luL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Feb 2023 08:00:00 GMT",
        "title": "Crypto Miner Hive Blockchain Posts Q3 Loss as Ethereum Merge Cuts Revenue, Mining Margin - CoinDesk",
        "content": "The Vancouver-based firm reported a net loss of US$90 million, or $1.09 a share, for the quarter ended Dec. 31, compared with profit of US$51.2 million, or 66 cents a share, the year before, it said in a Tuesday release. It had a loss of US$37 million, or 45 cents per share, in the previous three months. The net was mainly attributed to impairment from depreciation of mining rigs and chips due to lower crypto currency prices, the statement said."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9jcnlwdG9jdXJyZW5jaWVzL25ld3MvZXRoZXJldW0tcHJpY2UtcG9pc2VkLWZvci0yMC1yYWxseS1kdWUtdG8tdGhlc2UtcmVhc29ucy0yMDIzMDIyMDA4MjXSAXdodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy9ldGhlcmV1bS1wcmljZS1wb2lzZWQtZm9yLTIwLXJhbGx5LWR1ZS10by10aGVzZS1yZWFzb25zLTIwMjMwMjIwMDgyNQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Feb 2023 08:00:00 GMT",
        "title": "Ethereum price poised for 20% rally due to these reasons - FXStreet",
        "content": "Share:\n\nEthereum price shows a bullish pennant formation with a theoretical forecast of $2,055.\n\nSecond confirmation of uptrend will arrive after ETH flips breakout line at $1,801.\n\nInvalidation of ETH’s bullish thesis will occur on flipping the $1,554 support level into a resistance barrier.\n\nEthereum (ETH) price shows a clear sign of consolidation around a significantly important monthly resistance level. Although ETH has flipped this hurdle into a support floor on the lower timeframes, investors need to wait for a decisive breakout from the pennant to confirm the start of the second leg.\n\nEther is at the center of popularity due to its upcoming network upgrade - the Shanghai hard fork. According to CoinStats, the smart contract token has a total market capitalization of $204 billion, and this number is only going to increase due to the bullish outlooks seen both in its fundamentals and technicals.\n\nCoinStats\n\nEthereum price prepares for its next bullish phase\n\nEthereum price rallied nearly 20% between February 13 and 23. As ETH entangled with the monthly resistance level at $1,677, the consolidation kick-started. During this sideways movement, Ether has produced two higher lows and two lower highs, denoting a pennant formation.\n\nTogether, the Ethereum price action between February 13 and 20, shows a bullish pennant formation. This setup forecasts a 20% upswing, which is obtained by measuring the distance of the initial run-up and adding it to the breakout point on the pennant.\n\nAssuming a breach of the pennant occurs around $1,720, a 20% move would put the Ethereum price target at $2,055.\n\nSupporting this optimistic outlook for Ethereum price is the hidden bullish divergence seen between the Ether price move and the Relative Strength Index (RSI). This technical formation is spotted when the price forms higher lows, but the momentum indicator produces lower lows.\n\nThis setup often leads to an explosive surge in bullish momentum that propels the underlying asset’s price.\n\nWhile a decisive break of the pennant would be the initial confirmation of an upswing, market participants can wait for a four-hour candlestick close above the breakout line at $1,801.\n\nETH/USDT 1-day chart\n\nAlthough the bullish outlook for Ethereum price makes logical sense, investors need to be cautious as a fatal crash in Bitcoin price would undo everything for ETH. A decisive flip of the $1,554 support level on the four-hour and the daily timeframe would invalidate the bullish thesis.\n\nSuch a development would see Ethereum price crash to the $1,329 support floor.\n\nEthereum network grows but so do scams\n\nThe number of investors holding Ethereum (ETH) grew from 25 million to 87 million in 2022. With many new upgrades to the Ethereum blockchain set to debut in 2023 and the resumption of the 2023 bull run is likely going to boost the network further. Investors can also see a swift growth in Layer 2 solutions like Arbitrum and Polygon. Additionally, the implementation of the zkSnark (Zero-knowledge) technology has also brought a renewed interest among investors.\n\nIn a recent tweet, the Ethereum Denver Twitter account noted that hackers targeted their Ethereum Denver website. Soon after Blockfence tweeted and tagged this website as \"high risk.\" Interestingly, the involved bad actors have also promoted the fake ETH Denver website on Google. To make matters worse, the website appeared before the original website, which could attract a lot of unbeknownst investors.\n\nAlthough the cryptocurrency scams have decreased in recent months, scammers or hackers are finding new and improved ways to steal money."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vZGVjcnlwdC5jby8xMjE3NjgvYmx1ci1vcGVuc2VhLWV0aGVyZXVtLW5mdC10cmFkaW5nLXNreXJvY2tldHPSAUxodHRwczovL2RlY3J5cHQuY28vMTIxNzY4L2JsdXItb3BlbnNlYS1ldGhlcmV1bS1uZnQtdHJhZGluZy1za3lyb2NrZXRzP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Feb 2023 08:00:00 GMT",
        "title": "Blur Overtakes OpenSea as Ethereum NFT Trading Skyrockets - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nFollowing two straight months of sales growth, NFT trading rapidly accelerated over the past week as Ethereum NFT volume more than doubled during that span. It’s due to an evolving market in which upstart marketplace Blur has overtaken leader OpenSea, with traders rapidly flipping valuable NFTs like they’re DeFi tokens.\n\nAccording to data from DappRadar, Blur has generated $460 million worth of Ethereum NFT trades over the past seven days—a 361% increase over the previous span. OpenSea, meanwhile, saw a 12% increase in trading volume to $107 million during that period. The third-place marketplace, X2Y2, tallied barely $11 million in trades in that time.\n\nOverall, CryptoSlam points to a 155% week-over-week increase in Ethereum NFT trading volume. The surge in volume comes during a week in which Blur airdropped its BLUR governance token to NFT traders who earned rewards through the marketplace, and also by trading elsewhere ahead of Blur’s own launch last fall.\n\nAD\n\nAD\n\nThe BLUR token has a market cap of $466 million, at its current price of $1.20 per token, and it appears that at least some NFT collectors poured their airdropped funds back into buying NFTs. And they’re primarily using Blur to buy and sell NFTs, as the market data shows.\n\nHowever, the surge in trading volume at Blur doesn’t appear to be primarily driven by traders simply selling off their BLUR tokens and buying and holding high-value NFTs. Instead, whale traders with significant NFT holdings appear to be flipping NFTs with even greater frequency than before, in an effort to boost potential future token reward allocations.\n\nFor example, the largest NFT project (market-wide) over the past week in terms of trading volume is Otherside, Yuga Labs’ upcoming metaverse game. The NFT land plots generated some $63 million in trades this past week, per CryptoSlam, marking a 318% week-over-week increase.\n\nThe largest seller during that span is the wallet of MachiBigBrother, a well-known pseudonymous NFT trader, who was involved with nearly 1,300 Otherside NFT trades yielding $4.3 million worth of sales in the process. A look at his trading activity shows a constant flood of inbound and outbound trades, and this is just one example of many.\n\nIt’s facilitated by Blur’s unique marketplace model, which not only broadly incentivizes heavy activity with the promise of token rewards, but specifically rewards traders for using bidding pools that enable bulk trading for NFTs.\n\nAD\n\nAD\n\nBlur Bidding Pools have reached a new ATH of $132.65M TVL, or, around 2.4x Aptos TVL and 0.5x Solana TVL. Blur also became the #1 protocol on Ethereum by gas usage as well, surpassing both Uniswap and Seaport. 🚨TURN NOTIFICATIONS ON🚨 for details about Season 2, coming soon! https://t.co/89DONJ6K8z pic.twitter.com/GCqGHDQBcq — Blur (@blur_io) February 20, 2023\n\nBlur is teasing its next “Season 2” token airdrop, and specifically notes that traders that “bid on top collections closer to the floor get more rewards.” In other words, traders that put in a bid close to the floor price—that is, the cheapest available NFT for a certain project—of a popular project will maximize their eventual rewards. They’re both buying and selling in bulk as a result.\n\nThat’s why projects like Otherside, the Mutant Ape Yacht Club, and Moonbirds are all flying this week, and why many of the NFTs in those projects are trading hands over and over again. And MachiBigBrother, the aforementioned whale trader, currently sits at the top of Blur’s Season 2 leaderboard for trading rewards.\n\nDeFi, a catch-all term for non-custodial trading and lending services, took the Ethereum space by storm in 2020 and has played a significant role in the growth of the ecosystem since. Now, through token rewards and gamification techniques, Blur has incentivized traders to treat NFTs more like DeFi tokens, flipping frequently and attempting to maximize every potential benefit through liquidity mining. Some traders have even posted guides on how best to mine Blur’s token rewards without making potentially costly mistakes in the process.\n\nDeFi and NFTs are merging. Ape and ape hard. — Machi Big Brother (@machibigbrother) February 18, 2023\n\nThe NFT-meets-DeFi approach isn’t entirely new. We’ve seen DeFi-like implementations for NFTs in recent months, such as Sudoswap and Hadeswap embracing liquidity pools versus traditional marketplace listings, plus BendDAO using that kind of format for NFT-based loans. Other NFT-based loan protocols have risen in recent months and flourished.\n\nLast August, amid earlier debates around NFT flipping and creator royalties, Crypto Twitter personality Cobie tweeted that NFTs are “altcoins with pictures.” It was a controversial take then, but Blur’s DeFi-like approach to NFT trading has executed that concept at a scale previously unseen—and the impact has been profound.\n\nOpenSea, long the market leader in terms of trading volume, has been eclipsed by Blur’s trading frenzy—and as a result, OpenSea announced Friday that it has temporarily cut its own 2.5% marketplace fee, and will cut back on some creator royalty enforcement protections. This means OpenSea, in an attempt to remain competitive with Blur, is effectively going \"zero fee,\" forgoing the fees that drive its own primary source of revenue as well the fees that finance most NFT projects.\n\nAD\n\nAD\n\nAs when OpenSea publicly considered changes to its creator royalties model last fall, many NFT artists and creators have vocally pushed back against the move. But Blur, which does not fully honor creator royalties across projects, apparently forced OpenSea’s hand last week as the longtime leader attempts to adjust to a new normal.\n\nOpenSea still serves more unique wallets than Blur—about 106,000 for OpenSea over the past week, with about 66,000 for Blur. But Blur has shot ahead in terms of number of transactions, along with the widening gap in trading volume.\n\nLike more exaggerated examples of wash trading, the flood of NFT flipping and rewards “farming” on Blur muddles the market data—and the surging trading volume from the past week doesn’t suggest that the NFT market is growing and onboarding scores of new collectors. It’s mostly whales trading among themselves.\n\n“We aren’t growing the pie,” tweeted Web3 project founder Naveen Jain. “It’s the same folks circulating assets and ETH around and around.”\n\nThat apparently is true, but the entire market is still forced to grapple with the shifting tides—from Blur and OpenSea battling it out for market share to project creators watching their revenue streams dry up as platforms cater more to NFT flippers and pro traders."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZmluYm9sZC5jb20vbWFjaGluZS1sZWFybmluZy1hbGdvcml0aG0tc2V0cy1ldGhlcmV1bS1wcmljZS1mb3ItbWFyY2gtMS0yMDIzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Feb 2023 08:00:00 GMT",
        "title": "Machine learning algorithm sets Ethereum price for March 1, 2023 - Finbold - Finance in Bold",
        "content": "The cryptocurrency sector has found itself under increased regulatory pressure in the past weeks, but despite the difficult times, that didn’t prevent its representative assets from recording some strong gains, including Ethereum (ETH).\n\nCrypto traders and investors are now looking for indicators of further advances or declines with the market’s second-largest asset at the start of next month.\n\nIn this context, the machine learning algorithms at the cryptocurrency tracking platform PricePredictions have projected that Ethereum would be changing hands at the price of $1,747 by March 1, 2023, as per data accessed by Finbold on February 21.\n\nEthereum 30-day price prediction. Source: PricePredictions\n\nShould the predictions of the machine algorithm, which deploys indicators like relative strength index (RSI), Bollinger Bands (BB), moving averages (MA), moving average convergence divergence (MACD), and others, prove correct, this would mean that Ethereum would be trading 3.1% higher from its price at press time.\n\nMeanwhile, the sentiment on the 1-week gauges over at the finance and crypto tracking website TradingView is generally positive and suggests ‘buy’ at 12 – as summarized from the oscillators pointing towards ‘neutral’ at 8 and moving averages sitting in the ‘buy’ zone at 10.\n\nEthereum 1-week sentiment gauges: Source: TradingView\n\nEthereum price analysis\n\nAs things stand, the price of Ethereum currently stands at $1,694, which represents a modest increase of 0.13% over the last 24 hours but, at the same time, a more significant gain of 12.4% across the previous week and a 4.17% growth on its monthly chart.\n\nEthereum 7-day price chart. Source: Finbold\n\nWhether the second-largest decentralized finance (DeFi) succeeds in reaching the price set by the machine learning algorithms remains to be seen and will largely depend on the developments surrounding the Ethereum ecosystem, such as the long-awaited Shanghai upgrade set to go live in March, that will enable the phased release of staked ETH.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiOmh0dHBzOi8vZGFpbHljb2luLmNvbS9hcmJpdHJ1bS1kb21pbmF0ZXMtZXRoZXJldW0tbGF5ZXItMi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Feb 2023 08:00:00 GMT",
        "title": "Arbitrum Dominates Ethereum Layer-2: Daily Transactions and Volume Hit New Highs - DailyCoin",
        "content": "Arbitrum, the leading Ethereum Layer-2 scaling solution, has seen a huge increase in activity on its network in the past week.\n\nThe optimistic rollup hit two new all-time highs. First, Arbitrum processed 927,023 transactions on Monday. That’s almost the same number of transactions Ethereum did on that same day – 1,059,640.\n\nOn top of that, Arbitrum saw $2.7 billion in weekly volume last week, according to data from DefiLlama. On February 16 alone, Arbitrum saw $502.22 million flowing through various decentralized exchanges (DEX), a daily high for the network."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMirAFodHRwczovL3d3dy5hdGFsYXlhci5jb20vZW4vYXJ0aWN1bG8vZWNvbm9teS1hbmQtYnVzaW5lc3MvZXRoZXJldW0tYmFzZWQtbWVtZS1jb2lucy1ob3ctd2lsbC1zaGliYS1pbnUtYW5kLWRvZ2V0dGktZmFyZS1jcnlwdG8tbWFya2V0LXRocm91Z2gtMjAyMy8yMDIzMDIyMDE0MzI0MzE4MTg0NS5odG1s0gGwAWh0dHBzOi8vd3d3LmF0YWxheWFyLmNvbS9lbi9hcnRpY3Vsby9lY29ub215LWFuZC1idXNpbmVzcy9ldGhlcmV1bS1iYXNlZC1tZW1lLWNvaW5zLWhvdy13aWxsLXNoaWJhLWludS1hbmQtZG9nZXR0aS1mYXJlLWNyeXB0by1tYXJrZXQtdGhyb3VnaC0yMDIzLzIwMjMwMjIwMTQzMjQzMTgxODQ1LmFtcC5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Feb 2023 08:00:00 GMT",
        "title": "Ethereum-Based Meme Coins: How Will Shiba Inu and Dogetti Fare In The Crypto Market Through 2023? - Atalayar EN",
        "content": "2023 has shown what the crypto market is capable of. Through the majority of 2022, the market was in a state of decline, with Bitcoin (BTC), the crypto market pioneer, dropping from $68,000 to $20,000. So, how will cryptocurrencies like Ethereum (ETH) fare through 2023? And more specifically, how will Ethereum-based meme coins fare through 2023?\n\nThe two Ethereum-based meme coins we will examine today are Shiba Inu (SHIB) and Dogetti (DETI). Shiba Inu is a household name among meme tokens, residing in the top fifteen cryptocurrencies by market capitalisation. Dogetti is a newcomer to the crypto market, aiming to transform the way we view meme coins. Let’s find out how Ethereum, Shiba Inu, and Dogetti will fare in the crypto market through 2023.\n\nDogetti’s NFT Collection Turns Heads Among Crypto Enthusiasts\n\nThe NFT collection proposed by Dogetti could see the platform take meme tokens to the next level. Dogetti will implement a breeding mechanism for its NFTs in the fifth stage of its roadmap, allowing Dogetti NFT holders to create new digital companions to either hold or sell for crypto or fiat currency.\n\nSo, what else can we expect from the Dogetti platform? Dogetti will host a DAO within its ecosystem, allowing DETI holders to vote on proposals concerning the platform’s future. This allows Dogetti community members to actively shape the direction of Dogetti throughout its history.\n\nAdditionally, Dogetti users will be treated to two major services on the platform, the NFT marketplace and the Decentralised Exchange (DEX). Due to Dogetti building on the Ethereum network, users can swap any ERC20 token with another on the DEX!\n\nEthereum Continues Good Form Into February\n\nAs many know, Ethereum switched its outdated Proof-of-Work (PoW) consensus for a Proof-of-Stake (PoS) consensus. This switch in consensus meant that Ethereum’s energy consumption dramatically fell, resulting in a 99.95% decrease in the network's carbon footprint.\n\nThe change also meant that Ethereum was able to increase its transaction speed. While Ethereum utilised a PoW consensus, the network was only capable of handling 15-30 transactions per second. However, at Ethereum’s peak performance, the network is capable of handling 100,000 transactions per second.\n\nEthereum is performing extremely well through February. The network has increased its market capitalisation by 8.40% in the past seven days at the time of writing. This positive trend brings hope for the rest of 2023 for Ethereum and Ethereum-based cryptocurrencies.\n\nShiba Inu Hits $7 Billion Market Capitalisation\n\nShiba Inu introduced itself to the crypto market as a direct competitor to Dogecoin (DOGE). Although the meme token platform is currently below Dogecoin in terms of market capitalisation, Shiba Inu has still made a significant impact on the crypto market.\n\nThe meme token giant has recently proposed a blockchain named Shibarium. The Shibarium blockchain will be Layer-2, utilising Ethereum’s technology. The blockchain is currently in the beta stage of development and will launch in 2023 if the beta phase is successful.\n\nAs mentioned above, Shiba Inu has hit a $7 billion market capitalisation. The platform is currently experiencing a positive trend, increasing its market capitalisation by 5.35% in the past seven days at the time of writing.\n\n\n\nFinal Thoughts\n\nSo, how will Ethereum and Ethereum-based cryptocurrencies fare through 2023? According to current trends, Ethereum, Shiba Inu and Dogetti’s 2023 crypto journey will be positive. Each platform has a special set of characteristics that could help it maintain positive trends.\n\nAdditionally, Dogetti offers 25% bonus tokens with each presale purchase. All you have to do is enter the ‘WISEGUY25’ code at the checkout to receive yours.\n\nFor more information on Dogetti (DETI), please visit the following links:\n\nPresale: https://dogetti.io/how-to-buy\n\nWebsite: https://dogetti.io/\n\nTelegram: https://t.me/Dogetti\n\nTwitter: https://twitter.com/_Dogetti_"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LnRyYWRpbmd2aWV3LmNvbS9uZXdzL25ld3NidGM6ZmM5YjY4YTNlMDk0YjowLWV0aGVyZXVtLXByaWNlLXJldmlzaXRzLWtleS1yYW5nZS1zdXBwb3J0LXdpdGgtcmlzay1vZi1tb3JlLWRvd25zaWRlcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Feb 2023 08:00:00 GMT",
        "title": "Ethereum Price Revisits Key Range Support With Risk of More Downsides - TradingView",
        "content": "Ethereum price failed to clear the $1,720 resistance against the US Dollar. ETH corrected lower and remains at a risk of more losses below $1,620.\n\nEthereum is now showing a few bearish signs below $1,720 and $1,740.\n\nThe price is trading below $1,680 and the 100 hourly simple moving average.\n\nThere was a break below a key bullish trend line with support near $1,680 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could decline heavily if the bulls fail to protect $1,620 and $1,600.\n\nEthereum Price Dips Again\n\nEthereum price made another attempt to clear the $1,720 resistance zone. However, ETH struggled to gain pace above $1,700 and started a fresh decline, similar to bitcoin.\n\nThe price reacted to the downside and traded below the $1,680 support. Besides, there was a break below a key bullish trend line with support near $1,680 on the hourly chart of ETH/USD. The pair even moved below the $1,640 support.\n\nA low is formed near $1,621 and the price is now recovering losses. Ether price is trading below $1,680 and the 100 hourly simple moving average.\n\nOn the upside, the price is facing resistance near the $1,670 level. It is near the 50% Fib retracement level of the recent decline from the $1,719 swing high to $1,621 low. The first major resistance is near the $1,685 level and the 100 hourly simple moving average.\n\nNewsBTC\n\nSource: ETHUSD on TradingView.com\n\nThe 61.8% Fib retracement level of the recent decline from the $1,719 swing high to $1,621 low is also near $1,682. The next major resistance is near the $1,720 zone. A clear move above the $1,720 resistance zone start a steady increase towards the $1,800 level. Any more gains might open the doors for a move towards the $1,880 level.\n\nMore Losses in ETH?\n\nIf ethereum fails to clear the $1,685 resistance, it could continue to move down. An initial support on the downside is near the $1,620 level.\n\nThe next major support is near the $1,600 zone. If there is a break below $1,600, the price might continue to drop towards the $1,535 support. Any more losses might call for a test of the $1,500 level.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is now losing momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 level.\n\nMajor Support Level – $1,620\n\nMajor Resistance Level – $1,685"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMilQFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wMi8yMi8yNjEyNzkyLzAvZW4vVGhlLVdhaXQtaXMtRmluYWxseS1PdmVyLUNSWVBULVRva2VuLXRvLWJlLUxhdW5jaGVkLW9uLUV0aGVyZXVtLUJsb2NrY2hhaW4uaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Feb 2023 08:00:00 GMT",
        "title": "The Wait is Finally Over, CRYPT Token to be Launched on Ethereum Blockchain - GlobeNewswire",
        "content": "METRO, PHILIPPINES, Feb. 21, 2023 (GLOBE NEWSWIRE) -- Using social media is a great way to spend leisure time. According to statistics the daily average screen time in the world has increased by 50 minutes since 2013 to 6 hours 58 minutes. This increase in screen time is primarily due to social media platforms like Facebook, Instagram, Twitter, and Snapchat. These social media platforms have recently been amalgamated with the ever-growing crypto sector. The merging of these two has not only revolutionized the crypto sector but also furthered the usage of social media platforms to new levels.\n\nA Quick Look at Crypter\n\nCrypter is an innovative cryptocurrency project that brings together social media platforms into the crypto sphere. Not only this but Crypter exploited the hobby of the masses to create great earning opportunities. It allows users to earn through the mere act of scrolling these sublime social media platforms.\n\nA Memorable Launch on Binance Smart Chain in 2021\n\nThe advent of Crypter in 2021 was a memorable time for investors throughout the globe. Crypter token offered to the general population through private and presales skyrocketed, turning them rich within the blink of an eye. The disbursal of great BUSD rewards among investors was another reason why investors of this currency become rich in no time.\n\nCurrent Market Capitalization and Number of Users on Binance Smart Chain\n\nThe project has witnessed an all-time high market capitalization of $58 million and nearly 15,000 users hold this promising currency in their wallets.\n\nTime for a Change\n\nAs of today, influxes of investors are allured toward meme coins. Crypter aims to put an end to this tradition. The project was founded with the object of providing an investment that has the best interest of investors and the average person feels secure about investing in it. Crypter aspires to reach the same heights as meme coin through the provision of live utilities.\n\nNot Just an Average Social Media Platform\n\nCryptocurrencies are being widely used by a number of people, businesses, and companies. However, the absence of a social media platform where crypto enthusiasts from around the globe can interact is seriously limiting the growth of this sector. The arrival of Crypter puts an end to this problem. Crypter is a sublime social media platform that was devised exclusively for crypto adorers. Visit Crypter’s social media platform at https://crypter.com.\n\nCrypter Pay\n\nThe project has introduced Crypter Pay, a state-of-the-art online payment channel for businesses and corporations throughout the world. Companies that use Cryptocurrencies as a form of payment can make the most out of Crypter Pay. Businesses using this exhilarating payment solution do not have to worry about the volatility of the market with the solutions that it offers. Users can easily convert their tokens to fiat currency and have them cashed.\n\nA Revolutionary NFT Marketplace\n\nThe NFT marketplace of Crypter instantly went live after the firm was launched. It provides exciting opportunities for both traders and investors of digital assets. Traders enjoy low transaction fees on NFTs. Creators on the other hand can benefit from the passive earning opportunity and incentives that the project has to offer. By setting up royalties on the NFTs that they have created, an NFT designer can earn a sizable amount on each resale of their creation. NFT creators also do not have to pay gas fees on the NFTs that they have minted. This gas fee will be paid by the user who purchases the NFT.\n\nChain Quest\n\nChain Quest is a superlative play-to-earn game that will use Crypter tokens within its ecosystem. Anyone who wishes to take a demo can download the game from the Crypter website.\n\nCrypter Staking\n\nThe project offers users high-yielding sources of residual income. By staking CRYPT tokens. The tokens are deposited into liquidity pools and stakers earn USD in return.\n\nEthereum Launch\n\nThe project will launch its CRYPT token on Ethereum on February 24, 2023.\n\nAbout the Project - Crypter\n\nCrypter is the first-ever social media platform dedicated entirely to crypto enthusiasts. Individuals looking to go big should purchase the CRYPT token that will be available on Ethereum.\n\nFurthermore, potential investors and cryptocurrency enthusiasts interested in Crypter can visit the project’s official website, or read the whitepaper for more details.\n\nWebsite | Twitter | Telegram | Discord | Instagram | Facebook\n\n\n\nDisclaimer:\n\nThe information provided in this release is not investment advice, financial advice, or trading advice. It is recommended that you practice due diligence (including consultation with a professional financial advisor) before investing or trading securities and cryptocurrency.\n\n\n\n"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZWdhbWVycy5pby8xOTkwcy1taWxrLWNhcHMtZ2FtZS1wb2dzLW1ha2UtYS1jb21lYmFjay1pbi1ldGhlcmV1bS1uZnQtZm9ybS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Feb 2023 08:00:00 GMT",
        "title": "1990s Milk Caps Game Pogs Make a Comeback in Ethereum NFT Form - egamers.io",
        "content": "Do you remember Pogs? Those circular cardboard pieces that were a hit in the 90s? Well, they’re back in a new form as Ethereum NFTs, attracting attention from blockchain gamers. Additionally, multiple Pogs Web3 games are being developed.\n\nWhat are Pogs, and how did they become NFTs?\n\nPogs were originally a children’s game that became a popular collectible in the 90s. The game involves players stacking cardboard discs, then taking turns to throw a larger disc at them, trying to knock them over and win the ones that land face-up.\n\nPogs are being reimagined as non-fungible tokens (NFTs) on the Ethereum blockchain, allowing them to be owned, bought, and sold digitally. The project is led by a startup called Pogs Digital, which is creating NFT versions of classic Pogs designs and new designs featuring popular NFT collections.\n\nOn April 6, the company behind Pogs will launch 3,800 Ethereum NFTs, all created with a unique artwork each, at a price of 0.049 $ETH (Almost $90)\n\nIn addition, the company plans to release multiple mobile games, allowing players to use their Pog NFTs to compete against each other and win more NFTs. These games are set to be released this summer, with the first game, called Stack and Slam, being scheduled to debut this week on the Solana blockchain.\n\nThe History of Pogs Game\n\nAccording to Wikipedia, Milk caps is a children’s game played with flat circular cardboard milk caps. Players make a stack of these caps and take turns dropping a heavier “slammer” object onto it, causing the caps to be disrupted.\n\nEach player keeps any face-up caps and is to restack the face-down caps, repeating the process until none land face-down, at which point the player who collected the most caps wins the game of milk caps.\n\nThe game is also known as Pogs, under which name it was sold commercially in the 1990s. The name originates from Pog, a brand of juice made from passionfruit, orange, and guava; the use of the juice caps to play the game preceded the game’s commercialization."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1kZXJpdmF0aXZlcy1kYXRhLXN1Z2dlc3RzLTEtNzAwLW1pZ2h0LW5vdC1yZW1haW4tYS1yZXNpc3RhbmNlLWxldmVsLWZvci1sb25n0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Feb 2023 08:00:00 GMT",
        "title": "Ethereum derivatives data suggests $1,700 might not remain a resistance level for long - Cointelegraph",
        "content": "The price of Ether (ETH) rallied 18% between Feb. 13 and Feb. 16 but has since been range trading near the $1,700 level. Despite the recent price improvement, Ether derivatives metrics remain neutral-to-bullish as investors ponder the tighter regulatory environment and the potential impact of Ethereum’s Shanghai upgrade.\n\nInvestors’ biggest concern right now is regulation, especially after the United Kingdom’s Financial Stability Board recently stated that most stablecoins fail to meet international standards. The FSB was created by the G20 and is affiliated with the Bank of International Settlements. FSB chair Klaas Knot stated that the appropriate regulation of crypto-assets should be “based on the principle of same activity, same risk, same regulation.”\n\nIn more positive news, there has been some improvement in China after the government is reportedly taking a softer approach to Hong Kong’s crypto hub aspirations. According to a Feb. 20 Bloomberg report, representatives from China have been frequenting Hong Kong crypto gatherings seeking to understand local crypto business operations.\n\nA recent Binance report detailed the status of Ether staking and explored why the Shanghai upgrade may not result in the ETH sell pressure that some traders have predicted. Their rationale is based on liquid staking derivatives, which allow users to benefit from staked Ether while retaining the ability to sell the derivative token.\n\nLet's look at Ether derivatives data to understand if the $1,700 price rejection has impacted crypto investors’ sentiment.\n\nETH futures show higher demand for leverage longs\n\nThe two-month futures annualized premium should trade between 4% to 8% in healthy markets to cover costs and associated risks. However, when the contract trades at a discount versus regular spot markets, it shows a lack of confidence from traders and is a bearish indicator.\n\nEther 2-month futures annualized premium. Source: Laevitas\n\nThe chart above shows that derivatives traders are no longer neutral-to-bearish after the Ether futures premium exceeded the 4% threshold. More importantly, it shows resilience even as ETH failed to sustain the $1,700 support on Feb. 21.\n\nThe lessened demand for leverage shorts (bears) does not necessarily translate to an expectation of positive price action. Traders should analyze Ether’s options markets to understand how whales and market makers are pricing the odds of future price movements.\n\nOptions risk metrics move away from bearish sentiment\n\nThe 25% delta skew is a telling sign when market makers and arbitrage desks are overcharging for upside or downside protection.\n\nIn bear markets, options investors give higher odds for a price dump, causing the skew indicator to rise above 10%. On the other hand, bullish markets tend to drive the skew metric below -10%, meaning the bearish put options are in less demand.\n\nEther 30-day options 25% delta skew: Source: Laevitas.ch\n\nThe delta skew flirted with the bearish 10% level on Feb. 14, signaling stress from professional traders. However, the situation improved through the week as the index moved close to 0 — indicating similar upside and downside risk appetite.\n\nCurrently, options and futures markets point to pro traders moving to a neutral-to-bullish sentiment, displaying higher odds of ETH breaking above the $1,700 resistance. Consequently, the odds favor Ether bulls as investors remained calm despite the regulatory pressure and negative emotions associated with the upcoming Shanghai upgrade.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMikwFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2NyeXB0b2N1cnJlbmNpZXMtcHJpY2UtcHJlZGljdGlvbi1heGllLWluZmluaXR5LWJpdGNvaW4tZXRoZXJldW0tYXNpYW4td3JhcC0yMC1mZWJydWFyeS0yMDIzMDIyMDAwMDnSAZcBaHR0cHM6Ly93d3cuZnhzdHJlZXQuY29tL2FtcC9jcnlwdG9jdXJyZW5jaWVzL25ld3MvY3J5cHRvY3VycmVuY2llcy1wcmljZS1wcmVkaWN0aW9uLWF4aWUtaW5maW5pdHktYml0Y29pbi1ldGhlcmV1bS1hc2lhbi13cmFwLTIwLWZlYnJ1YXJ5LTIwMjMwMjIwMDAwOQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Feb 2023 08:00:00 GMT",
        "title": "Cryptocurrencies Price Prediction: Axie Infinity, Bitcoin & Ethereum — Asian Wrap 20 February - FXStreet",
        "content": "Ethereum price has been consolidating within an overall uptrend, but there are signs of a potential trend reversal. Traders should exercise caution and implement effective risk management strategies before entering any trades on the ETH price.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1zLWRlZmxhdGlvbi1hY2NlbGVyYXRlcy1hcy1zaGFuZ2hhaS11cGdyYWRlLWxvb21zLWNhbi1ldGgtcHJpY2UtYXZvaWQtYS0zMC1kcm9w0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Feb 2023 08:00:00 GMT",
        "title": "Ethereum's deflation accelerates as Shanghai upgrade looms — Can ETH price avoid a 30% drop? - Cointelegraph",
        "content": "The price of Ethereum’s native token, Ether (ETH), has surged by more than 40% year-to-date to around $1,750, the highest level in seven months. However, ETH’s price is not out of the woods yet despite several bullish cues in the pipeline, such as the Shanghai upgrade.\n\nEthereum price bull trap?\n\nEther’s rise aligns with similar upside moves elsewhere in the crypto market, responding to lowering inflation that reduces the Federal Reserve’s likelihood of continuing to raise interest rates.\n\nAt the same time, warnings about an imminent bull trap in the markets have emerged, which may wipe out recent profits. Due to its long-term correlation with stocks and Bitcoin, Ether faces similar risks.\n\nBull Trap About to confirm on $ETH and $BTC along with shooting stars on both. Failed breaks usually trigger the biggest opposing moves. You have been warned. If stocks do dump, reversal signal on crypto can follow. Close > that shooting star candle invalidates the trap. pic.twitter.com/tJ9c5N0M3J — Cameron Fous (@Cameronfous) February 16, 2023\n\nLet’s take a closer look at several potential bullish and bearish catalysts for the price of Ethereum below.\n\nETH becomes most deflationary since Merge\n\nThe issuance rate of Ether has dropped to its lowest level since the network’s transition to proof-of-stake (PoS) via “the Merge” in September, 2022.\n\nEther’s annual supply has reduced by 0.056% since the Merge. In other words, the Ethereum network has minted fewer ETH tokens than were removed from the supply in the past five months.\n\nEther supply since the Merge. Source: Ultrasound Money\n\nInvestors typically perceive a cryptocurrency with a fixed supply or deflationary issuance rate as bullish in the longer term.\n\n#Ethereum's #deflation #rate is accelerating by the day. This has very positive impact on the supply/demand dynamics, and should send the price a lot higher as demand increases. I think this is happening very soon. #ETH #ETHE pic.twitter.com/dnHVKBabuf — Jesse Dow (@JesseLeeDow1) February 16, 2023\n\nEthereum’s supply is currently around 120.50 million, but there is technically no max supply. However, the London hard fork in August 2021 introduced a fee-burning mechanism that added deflationary properties to Ether’s tokenomics.\n\nAs a result of this upgrade, the higher the Ethereum network’s transaction fees at any given time, the more Ether will be “burned” or removed from the supply forever.\n\nInterestingly, Ethereum’s median gas price has rebounded to a seven-month high of 27.13 gwei (the smallest ETH unit) in the week ending Feb. 17.\n\nEthereum seven-day median transaction gas price. Source: Glassnode\n\nShanghai hard fork\n\nETH demand must not drop against a deflationary supply rate for the price to climb. One potential bullish catalyst in the pipeline for Ethereum is its upcoming network upgrade dubbed Shanghai, slated for mid-March.\n\nThe Shanghai hard fork enables users who have locked their Ether into Ethereum’s PoS smart contract to withdraw their assets. According to Kennan Mell, an independent market analyst, this increased liquidity could encourage more people to hold and stake Ether tokens.\n\nIn his SeekingAlpha article, Mell argues:\n\n“It’s possible that the successful implementation of staking withdrawals will boost Ethereum’s price as new investors decide to buy in right afterward, either because they were waiting to buy until the network successfully went through a risky hard fork to implement withdrawals or because they are lured by a more liquid staking yield.“\n\nMeanwhile, the total value locked in the Ethereum PoS contract continues to rise to new record highs, with the latest data showing deposits of almost 16.63 million ETH.\n\nEthereum 2.0 total value staked. Source: Glassnode\n\nCrypto staking crackdown\n\nHowever, any bullish catalysts for ETH’s price could be offset by regulatory crackdowns and unfavorable technicals in the near term.\n\nIn February, the United States Securities and Exchange Commission (SEC) fined crypto exchange Kraken $30 million for not registering its staking-as-a-service program, which includes Ethereum staking.\n\nRelated: Ethereum’s Shanghai fork is coming, but it doesn't mean investors should dump ETH\n\nCoinbase exchange CEO Brian Armstrong also warned that the SEC might ban crypto staking services for retail investors altogether. If true, such a prohibition could hurt Ether’s demand among U.S. investors.\n\nResembles poor financial advice to diversify into stocks in an economy of high FFR and inflation\n\n\n\nBut, SEC wanting to ban staking is valid\n\n\n\nMajor exchanges like #Binance can no longer offer in-app staking\n\n\n\nAND\n\n\n\nPoS protocols like #Ethereum will be subject to security laws & taxes https://t.co/1YxpVNxD0B — oracledaddy (@oracIedaddy) February 20, 2023\n\nETH price hits bearish inflection level\n\nFrom a technical perspective, Ether’s price is testing a key resistance confluence for a potential pullback.\n\nThe confluence comprises a multimonth descending trendline resistance and a 50-week exponential moving average (50-week EMA; the red wave), as shown below.\n\nETH/USD weekly price chart. Source: TradingView\n\nA pullback from the confluence could have ETH’s price test the 200-week EMA (the blue wave) near $1,550 as its short-term downside target.\n\nFurthermore, an extended correction could push the price toward the black ascending trendline support near $1,200 by March 2023, down about 30% from the current levels.\n\nHowever, a decisive breakout above the descending trendline resistance could activate a bullish reversal setup toward the $2,000–$2,500 area.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9mYWtlLWV0aGVyZXVtLWRlbnZlci13ZWJzaXRlLWxpbmtlZC10by1ub3RvcmlvdXMtcGhpc2hpbmctd2FsbGV00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Feb 2023 08:00:00 GMT",
        "title": "Fake Ethereum Denver website linked to notorious phishing wallet - Cointelegraph",
        "content": "A fake website of the popular Ethereum Denver conference is the latest phishing target of a red-flagged smart contract that has stolen over $300,000 worth of Ether (ETH).\n\nThe popular conference saw its website duplicated by hackers this week in order to trick users into connecting their MetaMask wallets. According to Blockfence, which identified the fraudulent website, the smart contract has accessed more than 2,800 wallets and stolen over $300,000 over the past six months.\n\nAnother day, another scam.\n\nThis time the scammer targeted the @EthereumDenver website. Blockfence is here to protect you and fight scammers together: The scam contract was marked as \"High Risk\" by our ML algorithm and our partners at @GoplusSecurity pic.twitter.com/Jdtoz2Bgu4 — Blockfence (@blockfence_io) February 20, 2023\n\nETHDenver also issued a notice to its followers on Twitter warning of the malicious website.\n\nHello Fellow Bufficorns!!\n\n\n\nPlease be aware that there is a FAKE ETHDenver website that is asking for you to connect your wallet.\n\n\n\n“Go-ETHDenver” is not us. Please report the site! pic.twitter.com/1dt4hYmfvO — ETHDenver (@EthereumDenver) February 20, 2023\n\nBlockfence CEO Omri Lahav told Cointelegraph that users were prompted to connect their MetaMask wallets via the usual “connect wallet” button. The website prompts a transaction that, if approved, carries out the malicious function and steals the users’ funds.\n\nBlockfence’s research team identified the incident while tracking different trends in the industry. Lahav said that the smart contract executing the scam had stolen over 177 ETH since its deployment midway through 2022:\n\n“Since the smart contract was deployed almost six months ago, it’s possible that it was used on other phishing websites.”\n\nHackers had gone as far as paying for a Google advertisement to promote the malicious website’s URL, banking on search trends being high, with ETHDenver taking place on Feb. 24 and 25. The fake website appeared second on a Google search, above the actual ETHDenver website.\n\nAs Cointelegraph previously reported, hacks and scams continue to be commonplace in the cryptocurrency ecosystem. 2022 saw over $2.8 billion of cryptocurrency stolen through a variety of hacks and exploits."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9tb2R1bGFyLWJsb2NrY2hhaW5zLWNvdWxkLWJlLXRoZS1uZXh0LWhvdC1jcnlwdG8tbWFya2V0LXRyZW5kLWluLTIwMjPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Feb 2023 08:00:00 GMT",
        "title": "Modular blockchains could be the next hot crypto market trend in 2023 - Cointelegraph",
        "content": "The public blockchain sector grew from less than a few million dollars in the last decade to a $1 trillion industry. However, one thing that the space has yet to achieve is a decentralized, secure interoperable solution.\n\nLet’s take going from Ethereum to Bitcoin, the largest blockchain network, as an example. Historically, centralized exchanges have been one of the few safe, viable solutions for shifting from one chain to another.\n\nBitGo, a centralized solution provider, provides the largest pool of liquidity for Ethereum users to gain Bitcoin (BTC) exposure via Wrapped Bitcoin (WBTC). The BitGo IOU accounts for over 93.6% of the Bitcoin bridged to Ethereum. Users must rely on BitGo partner platforms like centralized exchanges or CoinList to exchange BTC and WBTC.\n\nThe dominance of WBTC exposes it to evident centralization and regulatory risks. RenBTC, a platform managed by Alameda Research, dissolved in December 2022 after FTX’s collapse, and the same might happen with BitGo. The recent regulatory crackdown on Paxos for issuing the U.S. dollar-backed Binance USD (BUSD) stablecoin could also eventually bring services like BitGo into the U.S. Securities and Exchange Commission’s crosshairs.\n\nThe interoperability between smart contract platforms and other application-specific blockchains must also be developed. Sidechains and rollups on Polygon, Arbitrum and Optimism comprise 90% of the cross-chain bridge volume from Ethereum. Near’s Rainbow and Fantom bridges are the only independent blockchains with a notable total value locked on bridges with Ethereum.\n\nEthereum market share of bridges by TVL. Source: Dune\n\nSeveral major crypto projects, such as Polkadot and Cosmos, implemented modularity from the ground up to build a secure, scalable cross-chain platform, with the ultimate goal being to establish an interoperable “network of networks.” However, Cosmos and Polkadot have yet to attract sufficient liquidity to its ecosystem.\n\nThe issue of bridge centralization\n\nThe 2021 hype cycle witnessed the emergence of a “multichain future” where various blockchain host specific functions but are joined together through interoperable solutions. The first generation of bridges was highly primitive and centralized, eventually making them hot targets for exploits.\n\nThe next generation of interoperable solutions operate as separate blockchains to include decentralization and enhance security. These include intermediate transfer tokens like THORchain’s RUNE (RUNE). However, the daily volume of transfers via THORchain has stayed below $20 million, suggesting that it has failed to pick up usage.\n\nThreshold, which introduces a trustless and private portal for Bitcoin on Ethereum, will launch in Q1 2023. It will look to replace centralized providers like BitGo in bridging liquidity between Bitcoin and Ethereum.\n\nSome other protocols focus on the interoperability between smart contract platforms.\n\nLayerZero is an omnichain interoperability protocol that allows the development of applications like decentralized exchanges and lending protocols on top of it. These protocols can interact with monolithic chains like Ethereum, Cosmos Hub and Solana. Stargate is the first DEX built using LayerZero and has a liquidity of $324 million across Ethereum, Polygon, BNB Smart Chain and Avalanche.\n\nCelestia is a layer-1 blockchain built using the Cosmos SDK. The platform supports smart contract execution but is only responsible for ordering transactions and making a blockchain’s data more accessible.\n\nIt aims to act as an intermediate layer between Ethereum rollups and the mainnet by compressing the rollup data for faster execution on the Ethereum layer 1. Celestia does not verify the block data but helps optimize the gas cost and speed of execution. This capability will extend to layer-1 blockchains like Cosmos, Solana and Avalanche.\n\nThe team will run an incentivized test in Q1 2023 to start public testing and reward testnet validators with a potential airdrop of native tokens.\n\nCelestia testnet incentives announcement. Source: Celestia’s Discord\n\nRelated: ‘Multichain future is very clear’ — MetaMask to support all tokens via Snaps\n\nFuel Labs, the team building Fuel Network, also developed the Fuel Virtual Machine and Sway programming language, which enhances transaction speed. The team launched its second beta testnet in November 2022, and the public testnet is expected to go live sometime in 2023.\n\nWhile the interoperable space remains underdeveloped and exposed to centralization risks, various teams are working on decentralized solutions that will launch in 2023. These protocols will securely bridge the liquidity across decentralized finance protocols and other layer-1 blockchains. On top of that, they will also help build a multichain future, where the user experience will be blockchain agnostic and protocols will interact with each other seamlessly.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vYmxvZy5rcmFrZW4uY29tL2NyeXB0by1lZHVjYXRpb24vbmZ0cy0xMDEtaWRlbnRpdHktZXhwcmVzc2lvbi13aXRoLXBmcHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Feb 2023 08:00:00 GMT",
        "title": "NFTs 101: Identity expression with PFPs - Kraken Blog Kraken Blog - Kraken Blog",
        "content": "There was once a time when displaying an image of your real face on social media was standard practice. A holiday photo, a mugshot, a pic of you and your pug; these were all commonplace ways of showcasing yourself to the world. But that time has passed, and a new era of social signaling has begun.\n\nNon-fungible tokens (NFTs) are one of the crypto industry’s most innovative creations. Here, artists and communities are constantly pushing the boundaries of art and ownership. One popular use case for higher-ticket NFTs that has emerged in this space is profile picture NFTs, or PFPs.\n\nWhat is a PFP NFT?\n\nThe PFP NFT all started when a collection of 10,000 pixelated characters called CryptoPunks. The collection first launched on Ethereum in 2017. At the time, Ethereum holders could get them by paying a small gas fee to generate a single punk.\n\nEach person who did so received an algorithmically generated NFT character, each with its own randomized set of traits of varying rarity. If you want to learn more about how the rarity of different NFTs can be measured, you can check out the Kraken Learn Center article What is an NFT rarity ranking?\n\nAs the NFT craze peaked in 2021, everyone wanted their own CryptoPunk NFT because of their immutable prestige as the first Ethereum PFP collection.\n\nThe rampant surge in demand for the collection’s limited supply sent CryptoPunk prices skyrocketing. Presently, the floor price for CryptoPunk NFT is 65 ETH (~$106,000). Only a few crypto enthusiasts own one and therefore, they carry a unique level of prestige.\n\nIt wasn’t long before people started substituting their Twitter profile pictures with their CryptoPunk NFT characters to cement themselves as an early adopter and express their punk personalities. This trend set the stage for holders of other popular NFTs to follow suit, and before long, PFPs became mainstream.\n\nClockwise, starting bottom right: CryptoPunks, SlimHoods, Doodles, BAYC, 0N1 Force, Lazy Lions.\n\nThese days, a variety of NFT collections fall within the PFP category. Bored Ape Yacht Club is another prominent collection featuring portraits of apes sporting unique facial expressions, accessories and clothing items. The creators later produced two additional spin-off collections – Mutant Ape Yacht Club and Bored Ape Kennel Club. All three collections are often featured as profile pictures on social media platforms.\n\nDoodles is another popular collection of colorful, cartoon characters that are easy to spot on social media platforms. Some OG NFT collectors choose to feature smaller collections such as SlimHoods, Lazy Lions, and 0N1 Force as their social profile pictures.\n\nHow to use an NFT as a PFP\n\nTwitter is the leading social media platform that supports PFP NFTs. Any NFT can be used as a PFP, the options are limitless!\n\nTo officially feature your NFT onto your Twitter profile as a PFP, you’ll first need to:\n\nPay for a Twitter Blue subscription (~ $8-$11 per month). Download the Twitter mobile application (free).\n\nThen, you’ll need to head to your profile on the mobile app, tap your profile picture > “Edit.” Three options will appear including “Choose NFT.” Clicking this option will take you to a screen prompting you to connect your crypto wallet that stores the NFT. Please be very careful when connecting a crypto wallet to any third-party website or app and double check the URL and security certificate before proceeding.\n\nThe social media platform currently supports multiple wallets, such as:\n\nMetaMask\n\nRainbow\n\nLedger Live\n\nTrust Wallet\n\nOnce connected, you’ll be able to select the NFT you wish to feature as your new profile picture.\n\nTwitter crops all PFP NFTs hexagonally to differentiate them from normal profile pictures.\n\nBeware of fakes\n\nWhile blockchain technology allows you to prove to the world that you are the true owner of an original media file, it doesn’t stop people from copying PFP NFT images and minting their own NFTs for themselves.\n\nSome may pose as legitimate NFT holders to gather followers, mislead people, or commit fraud — something to bear in mind when navigating the minefield that is “Crypto Twitter.” If you want more tips on how to keep your crypto and NFTs safe, be sure to check out our Crypto Security 101 video series.\n\n\n\nWhy buy a PFP NFT?\n\nNot only can a PFP serve as a visual extension of the digital identity you want to create for yourself, but they can also demonstrate your commitment to the cryptocurrency movement, and your appreciation of digital art.\n\nHolders are also finding new ways of increasing the utility of their PFP NFTs by setting up exclusive communities, selling physical merchandise sporting their NFTs, and providing early access to new NFT collection launches. When it comes to the practical benefits of owning an NFT, things are changing – and improving – every day.\n\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, or hold any digital asset or to engage in any specific trading strategy. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your crypto assets and you should seek independent advice on your taxation position."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmNvaW5iYXNlLmNvbS9pbnN0aXR1dGlvbmFsL3Jlc2VhcmNoLWluc2lnaHRzL3Jlc2VhcmNoL3Rva2Vub21pY3MtcmV2aWV3L3NvbGFuYS1zb2wtbmF0aXZlLXNjYWxhYmlsaXR50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Feb 2023 08:00:00 GMT",
        "title": "Solana (SOL): Native scalability - Coinbase",
        "content": "Introduction Solana rose to prominence after launching its blockchain in March 2020, surpassing US$77B in market capitalization at its peak on November 6, 2021. Since then, a confluence of headwinds have impaired the value of the ecosystem, reducing its market cap by ~87% and total value locked by ~97%. Some of these challenges (such as network outages and bugs) could be considered growing pains of an early stage technology platform still technically in beta, while others (such as tightening financial conditions and crypto-specific insolvencies) are better characterized as exogenous factors. Perhaps most notably, the sentiment shockwaves emanating from the recent collapse of FTX have had an outsized impact on Solana, given the network’s historical association with (and funding from) the now-defunct exchange. While the Solana community was rightfully surprised by these events, this former association has nonetheless contributed to dampened perceptions of the network. Taking a step back, the fundamental characteristics which make Solana an architecturally differentiated layer-1 blockchain remain intact. While many of its competitors – including Ethereum – have been forced to scale their networks’ transactional capacity through second- and third-layers, Solana was intentionally designed for native scalability at the base layer. By augmenting its proof-of-stake (PoS) consensus mechanism with a unique timestamping function called proof-of-history (PoH), Solana has been able to process as many as 65,000 transactions per second (TPS)(achieved on testnet), making it one of the highest throughput blockchains in the industry. Because these technical capabilities are possible within a single global state (as opposed to multiple layers), Solana offers enhanced composability to developers building applications on the protocol. These sources of differentiation represent important catalyzing forces that can attract and retain developer talent, an area where the protocol has historically shown strength (a sentiment recently echoed by Vitalik Buterin, co-founder of Ethereum). In this report, we assess the mechanics of the Solana protocol and its competitive positioning in the layer-1 blockchain space. Despite a significant decline in value from its prior peak, user activity on Solana and its pipeline of development initiatives remain relatively robust. Further, Solana has maintained a focus on improving the resiliency of its infrastructure, implementing upgrades targeted at reducing spam transactions and eliminating network outages. In our view, the technological differentiation exhibited by Solana will continue to act as a foundational element of the protocol’s value proposition. The ecosystem’s focus on performance for users and composability for developers may play an important role in driving future adoption and network growth.\n\nTokenomics The native asset of Solana is SOL. Validators can participate in network security by staking SOL in order to receive rewards in the form of newly issued SOL as well as a portion of transaction fees (50% of transaction fees are burned, with the remaining 50% awarded to the leading validator processing the given transaction). While Solana has recently introduced local fee markets allowing for transaction prioritization, the standard fee is fixed at a low rate (0.000005 SOL per signature, or ~1/100th of a cent in USD). In terms of new issuance, Solana set the initial annualized inflation rate at 8% in February 2021, scheduled to decline by 15% every 180 epochs (roughly one calendar year) until it reaches its long-term inflation target of 1.5% (estimated to occur in 2031). The initial supply of SOL (detailed in Chart 1) was 500M tokens and since inception, new issuance awarded to validators has grown the total outstanding supply of SOL to 540M tokens at current. The annualized issuance rate of SOL is currently ~6.36% and will vary depending on network performance. Because of the low static fee structure, the vast majority of a given validator’s staking rewards come from new issuance, meaning the potential staking yield is primarily a function of the (1) current issuance rate and (2) total amount of staked SOL as a percentage of total supply. Staking yields will also vary depending on commission rates (charged by validators to delegators) as well as a given validator’s uptime during the period. At current, ~70.36% of all eligible SOL is staked, equating to an average annualized staking yield of ~6.92% (per Staking Rewards ). As the rate of new issuance continues to decline according to the aforementioned schedule, validators will increasingly rely on transaction fees for compensation which suggests network activity will need to increase meaningfully over time in order to foster a more robust fee market. Chart 1. Initial SOL supply Prior to the public auction in March 2020, Solana held four separate funding rounds (as detailed in Table 1). Since inception (inclusive of fundraising rounds subsequent to the public auction) Solana has raised a total of ~US$376M from private investors. While Solana has historically garnered a reputation for being a heavily “VC-backed” blockchain, the reality is that there are not many legally-compliant alternative fundraising mechanisms for this type of early stage protocol. Moreover, some layer-1 competitors have raised even more money than Solana, including NEAR, which has raised a total of ~US$524M from private investors since inception. Table 1. Solana fundraising summary (pre-public auction) It is worth mentioning that ~31% of the SOL supply is not yet circulating. It consists of SOL to be unlocked according to various vesting schedules associated with early investors as well as SOL owned by Solana Labs and the Solana Foundation (which are not subject to lockups but are not considered circulating). Perhaps most notably, the largest holder of locked SOL is the now-defunct Alameda Research, which holds over 47M SOL (~28% of all non-circulating supply) that is scheduled to be unlocked between March and July of 2025.\n\nLayer-1 landscape In a certain sense, the advent of the Solana protocol helped catalyze the proliferation of alternative layer-1 smart contract platforms observed in recent years. A technically ambitious project, Solana was able to gain initial traction by offering a differentiated environment for both users and developers that could theoretically challenge the network effects of established incumbents, namely Ethereum. During the bull run of 2021, for example, the network’s capacity for cheap and fast transactions attracted new users as other blockchains became prohibitively expensive to use. Ultimately, while it is possible that a “multi-chain” future for crypto will consist of several interoperable, specialized blockchains that can effectively co-exist from a market share perspective, the current state of affairs is more directly competitive. Layer-1 blockchains are currently competing to capture as much mindshare as possible from a common, albeit growing, pool of capital and users. While the intensity of this competition may be less apparent in the midst of an ongoing bear market, Solana has seemingly captured a surprisingly sticky amount of mindshare since its inception and the ecosystem is aptly focused on bolstering their technological advantages. It is worth reiterating that the Solana community was just as stunned by the collapse of FTX as the broader market. Founder Anatoly Yakovenko believes Solana’s perceived linkages with FTX have historically been overstated, recently noting that their largest contribution to Solana was the development of the decentralized order book called Serum, which has since been forked and is now a community-led effort called OpenBook . That said, we believe that the network’s historical growth and subsequent decline in market capitalization and total-value-locked (TVL) are perhaps less relevant to the forward-looking analysis of Solana than they otherwise would be. Accordingly, the competitive positioning of Solana is better understood by focusing on activity-driven metrics such as transactions and active users, in relation to aggregate network value (note that these metrics are not resistant to Sybil attacks which can result in multiple fake addresses and thus may overstate activity). Chart 2. Ratio of market capitalization to daily transactions (rolling 30D average, US$) Chart 3. Ratio of market capitalization to daily active users (rolling 30D average, US$) As shown in Charts 2 and 3, the activity on Solana in terms of transactions and active users (adjusted for market capitalization) compares favorably to that of Ethereum at current. This data suggests that Solana may be undervalued relative to Ethereum with respect to the level of underlying activity on the network. Said another way, while Solana’s current market capitalization is just ~4.3% of Ethereum’s current market capitalization, the amount of daily active users on the network represents ~43.7% of Ethereum’s daily active user base (~150k for Solana versus ~344k for Ethereum). Furthermore, Solana processes roughly ~17x the amount of daily transactions as processed by Ethereum (~17.7M for Solana versus ~1.0M for Ethereum), which may be largely attributable to its overtly low-cost fee structure which creates a more frictionless environment for user activity. Zooming out, it is important to recognize that the overarching investment thesis for Solana is largely predicated on the technological merit of the protocol. Unparalleled transaction throughput (at very low cost) combined with an architectural design allowing for native scalability on the base layer represents a legitimate alternative to the layered approach taken by Ethereum and its EVM clones. In order to be successful over the long-term, however, we believe the Solana ecosystem must maintain a focus on the technical capabilities of the platform and aim to offer products and services that simply cannot be executed on other blockchains due to higher latency or less composability. By leaning into the differentiation of their technologies, Solana may be better positioned to attract and retain developer talent which could help drive future user adoption and network activity.\n\nDeveloper activity Outside of metrics related to network activity, another important barometer for gauging the forward-looking potential of Solana is the level of developer activity across the ecosystem. Chart 4 details a comparison of developer activity between Solana and Ethereum, based on data from Github. Following a period of outsized growth for Solana in late 2021/early 2022 (that meaningfully surpassed that of Ethereum), developer activity on Solana subsequently declined back below that of Ethereum in May 2022. Currently, Github data suggests there are 63 active developers working on Solana, versus 133 active developers working on Ethereum (according to The Tie, where “active” is defined as developers who commit code 5+ days of a month). That being said, Solana itself has recently disputed this data , making the argument that the entirety of the developer community working within the ecosystem is not captured by Solana-specific Github repositories. By their calculations, the number of active developers working on Solana full-time (defined as developers who commit code 5+ days of a month) is 120. They also noted that certain repositories and organizations on Github are private, and thus would not be captured by these metrics. Additionally, a recent developer activity report released by Electric Capital takes a broader approach and suggests higher totals for both networks – 383 full-time developers for Solana versus 1,873 for Ethereum as of mid-December (full-time defined as developers who commit code 10+ days of a month). Nevertheless, even the potentially conservative lower bound of 63 active developers for Solana would again suggest relative strength versus Ethereum after adjusting for the large discrepancy in market capitalization of the networks. Chart 4. Developer activity trends (Solana versus Ethereum)\n\nKey protocol initiatives As previously mentioned, the technological differentiation of Solana is at the core of its forward-looking value proposition. To the ecosystem’s credit, they have continued to build innovative products, services and pieces of infrastructure to support the capabilities of the protocol despite a plethora of headwinds and negative sentiment. Some of Solana’s key protocol initiatives which could help bolster the network’s technical advantages are detailed below. Deployed QUIC : a new version of Solana’s data transfer protocol (previously the user datagram protocol, UDP) which provides validators greater flexibility in organizing transaction data and promises to reduce the frequency of spam transactions Local fee markets : allows users to prioritize transactions with higher fees paid to validators and could help foster a more robust fee market, which could disincentivize spam transactions Stake-weighted Quality of Service : ensures validators will be able to transmit transaction data in proportion to their share of stake Jito-Solana : a modified validator client created by Jito Labs, analogous to Flashbot’s MEV-boost on Ethereum (also introduced a liquid staking derivative called JitoSOL)\n\nIn testing Token-22 : a new token standard that will facilitate enhanced functionality like embedded royalties for NFTs and confidential payments Firedancer : an independent, C++ validator client created by Jump Crypto aimed at increasing the efficiency of the Solana network and creating a more redundant/diverse validator environment (to be deployed gradually throughout 2023) Concurrent Merkle trees / account compression : an account data compression method developed by Solana Labs that aims to decrease data storage requirements and costs\n\nProposed Runtime v2 : a new version of Solana’s runtime (the environment where smart contracts are executed) that will support the Move programming language and help foster a more efficient, auditable and cost-effective programming environment for developers\n\nAnother notable initiative for Solana is their forthcoming mobile phone, Solana Saga. The development of a crypto-specific mobile stack promises to allow users to securely store private keys and seamlessly navigate decentralized applications, all from a singular device. Importantly, this infrastructure will allow developers to build applications outside the purview of incumbents that extract value from the web2 application environment. Early versions of the device were sent to interested developers in mid-December for testing, ahead of the public release anticipated for 1Q23."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vZW4uZXRoZXJldW13b3JsZG5ld3MuY29tL2ZyaWVuZHNpZXMtbmZ0LXJ1Zy1wdWxsZWQtNS1taWxsaW9uL9IBSWh0dHBzOi8vZW4uZXRoZXJldW13b3JsZG5ld3MuY29tL2ZyaWVuZHNpZXMtbmZ0LXJ1Zy1wdWxsZWQtNS1taWxsaW9uL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Feb 2023 08:00:00 GMT",
        "title": "Friendsies NFT Collection Rug Pulled After Raising $5 Million - Ethereum World News",
        "content": "Friendsies founders have abruptly shut down the NFT collection and all associated projects.\n\nThe rug pull was confirmed after the project’s Twitter account was deleted.\n\nThe collection had raised $5 million at Christie’s auction on OpenSea less than a year ago.\n\nFounders of the NFT collection blamed their decision to shut down on volatility and challenges in the market.\n\nFounders of the Friendsies (fRiENDSiES) NFT collection have pulled the rug on the project. The rug pull, which was announced on the project’s official Twitter account earlier today, comes less than a year after the Ethereum-based collection raised a whopping $5 million at an auction hosted by popular auction house Christie’s on OpenSea.\n\nFriendsies founders blame market volatility for pulling the rug\n\nIn a now-deleted Twitter thread, the founders of Friendsies blamed the volatility and challenges of the crypto market for their decision to pull the rug. They claimed that the current market conditions prevented them from developing the project in a way that they could be “proud of”.\n\nFor now, we have decided that it’s best to allow the space to further mature. The fRiENDSiES IP is important to the team and we will be waiting for the right time and opportunities to see the full vision become reality.” Friendsies founders\n\nI was quite outspoken about friendsies.\n\n\n\nDutch Auction except they didn’t sell it at the lowest price for everybody. Started at 4.2eth and quite a few ppl paid absurd prices like this.\n\n\n\nThen after raking in millions they collected royalties for months until rugging yesterday.\n\n\n\ngg pic.twitter.com/Gu3as5hhf3 — 0xBiZzy.eth 👾 (@0xBiZzy) February 21, 2023\n\nThe early signs of trouble emerged when community members started alleging last year that the project’s founders had turned their back on the roadmap that was initially laid out. According to on-chain sleuth ZackXBT, there have been no announcements from the project since September 2022. Furthermore, several aspects of the roadmap, including a community treasury and a play-to-earn game, remain undelivered.\n\nZachXBT further revealed that the founders of the project had not distributed 1.25% of all royalties (47 ETH) to holders, as claimed in the project’s official Discord server in March 2022. The rug pull has caused uproar in the NFT community on Twitter, with many victims calling out the crypto influencers who aggressively promoted the Friendsies collection last year.\n\nMastercard Product Lead Satvik Sethi has publicly offered to take over Friendsies. According to him, the project’s IP has good potential and by installing a new team and leading with a different vision, the holders could be made whole."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vd3d3LmFsdGNvaW5idXp6LmlvL3Jldmlld3MvdG9wLTQtYnJpZGdlcy1mb3ItY3Jvbm9zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Feb 2023 08:00:00 GMT",
        "title": "Cronos and Its Top 4 Bridges - Altcoin Buzz",
        "content": "Cronos is a layer 1 blockchain built in the Cosmos ecosystem. As a result, it connects to the IBC (the Inter-Blockchain Communication Protocol). These are quite a few blockchains that are also built on Cosmos. However, Cronos is also EVM compatible.\n\nAs a result, it connects the Ethereum and Cosmos ecosystems. To achieve this, it needs bridges. So, we are going to look at the top 4 bridges for Cronos.\n\n3 more days till Cronos mainnet launch where multiple DeFi protocols will go live. Are you ready? 🌉Bridging assets into a new chain is always tricky. We have prepared a guide on the multiple ways you can safely bridge your assets into Cronos on Day 1 – https://t.co/cWpaHBK2en pic.twitter.com/vuZ6AlpRPg — Cronos (@cronos_chain) November 5, 2021\n\n1) Cronos Bridge\n\nThe Cronos bridge can transfer digital assets between selected chains. Currently, these are the Crypto.org chain, Cosmos, Akash, and Cronos. The bridge to Terra is currently paused, and an Ethereum bridge option is coming soon.\n\nSo, the cronos bridge is a decentralized bridge built on IBC and the Gravity Bridge. As we just saw, the Cronos bridge works in the IBC ecosystem. On the other hand, Gravity Bridge is a blockchain. It bridges between the Ethereum and Cosmos ecosystems.\n\nTo use the Cronos Bridge, you use the CRO token to pay all related fees. However, for your first transaction from Cronos to another chain, you get a free token. There’s a faucet that airdrops on the destination chain. Cronos currently supports three tokens and three wallets. For instance:\n\nTokens : CRO, ATOM, and AKT. Wallets : Metamask, Keplr, Crypto.com DeFi Wallet.\n\nSource: Cronos Bridge app\n\n2) Multichain\n\nMultichain used to be Anyswap. This project has backing from well-known industry leaders. For example, Binance invested $350,000 as part of their accelerator program. Furthermore, Binance Labs led a $60 million investment round.\n\nCurrently, Multichain connects over 70 chains. Of course, Cronos is one of them. Other chains are, for example, Aptos, Cardano, Fantom, Litecoin, Near, or Solana.\n\nFor native tokens, Multichain uses liquidity pools and swaps cryptocurrencies across chains. When there is no native token, Multichain locks the token in a smart contract. At the destination chain, it will mint a pegged token. This is a wrapped token. Multichain can also bridge NFTs.\n\nThe bridging can take up to 30 minutes. However, Multichain boasts that there’s no slippage. This is the difference between the expected and real price of a trade. The team keeps on top of new developments and recently released a new whitepaper. They based this on zero knowledge proof.\n\n👁‍🗨#zkRouter Whitepaper Released\n\nA trustless, general cross-chain infrastructure is born! As #Multichain's latest development, #zkRouter based on zero-knowledge proof would be the next evolution in bridging area. Whitepaper ➡️https://t.co/tUBsJ12c2i pic.twitter.com/akEmdAvVq7 — Multichain (Previously Anyswap) (@MultichainOrg) January 13, 2023\n\n3) XY Finance\n\nXY Finance aggregates not only DEXes but also bridges. Their XY token fuels their protocol. The protocol looks for the best possible route, for your assets. Furthermore, it looks for the best rate, speed, and security. Using the XY Finance bridge, you can bridge 15 chains and all their tokens to Cronos. For instance:\n\nArbitrum.\n\nAvalanche.\n\nBinance Chain.\n\nEthereum.\n\nFantom.\n\nOptimism.\n\nPolygon.\n\nYou can use a variety of wallets to bridge tokens with XY Finance. As you can see, by the supported chains, you will need an Ethereum compatible wallet. Rabby, Trust Wallet, Rainbow Wallet, or MetaMask will work fine. Multichain uses two features for bridging:\n\nX Swap: Uses the fastest and cheapest route to swap tokens. Y Pool: Is the bridge.\n\n#XYFinance lowered the #crosschain transaction fee 🔥 ✅ 14 Supported #Blockchain\n\n✅ 270+ Supported #DEXs\n\n✅ 120K+ Supported Tokens\n\n✅ Best routing\n\n✅ Best price\n\n✅ Lower risk to price impact\n\n✅ Swap tokens across 14 chains More details 👇 https://t.co/eXeulDaOF8 pic.twitter.com/68q5lEwtO6 — XY Finance | DEX & Bridge | (@xyfinance) December 23, 2022\n\n4) Cosmos IBC Hub\n\nThe Cosmos Hub are all the interconnected blockchains in the Cosmos ecosystem. Cosmos has the ATOM token, but each chain has its own token. It’s the Internet of Blockchains. There are many blockchains in the IBC system that cover different grounds, for example:\n\nOsmosis is a DEX.\n\nSecret Network emphasizes privacy.\n\nAxelar offers cross-chain communication.\n\nStargaze is an NFT marketplace.\n\nKava is a DeFi landing platform.\n\nGravity Bridge connects the Ethereum and Cosmos ecosystems.\n\nCronos connects EVM chains with the Cosmos ecosystem.\n\nWith Cosmos IBC Hub, you can transfer the ATOM token cross-chain now. Because Cronos has a built-in IBC module, it can connect with other IBC chains. On the other hand, it also supports EVM chains.\n\nAs a result, it supports both IBC tokens and ERC20 tokens. It has a built-in module that converts the two tokens. You can use the Keplr wallet for the Cosmos side and MetaMask for the Cronos side. The Crypto.com DeFi wallet works for both sides. Below is a picture of the Cosmos zones. These are the hubs and zones of the Cosmos Network.\n\nSource: Map of Zones\n\nConclusion\n\nWe showed you four different bridge options for the Cronos blockchain. These are the Cronos Bridge, Multichain, XY Finance, and the main Cosmos IBC Hub.\n\nThe current price of the Cronos token is $0.086294. CRO has a market cap of $2.17 billion. Out of the 30 billion total supply of CRO tokens, 25 billion already circulate.\n\n⬆️ For more cryptocurrency news, check out the Altcoin Buzz YouTube channel.\n\n⬆️ Our popular Altcoin Buzz Access group generates tons of alpha for our subscribers. And for a limited time, it’s Free. Click the link and join the conversation today."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vZGFpbHljb2luLmNvbS9tYXR0ZXItbGFicy1sYXVuY2hlcy1uZXh0LXBoYXNlLW9mLWl0cy16a2V2bS1yZWJyYW5kcy16a3N5bmMtMi0wLXRvLXprc3luYy1lcmEv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Feb 2023 08:00:00 GMT",
        "title": "Matter Labs Launches Next Phase of Its zkEVM, Rebrands zkSync 2.0 to zkSync Era - DailyCoin",
        "content": "The phase, dubbed Fair Onboard Alpha, now allows developers to deploy their registered dApps on the zkSync zkEVM platform. Matter Labs will also enable token bridging, run security audits, contests, and bug bounty programs, and improve developer tools.\n\n“We want to take a moment to thank our community for their unwavering support in helping us make it to this milestone. We’re proud and humbled that you’ve been with us every step of the journey.”\n\nWhile zkSync’s zkEVM will remain closed during this stage, it’s now open source, allowing anyone to view, modify, and fork the code.\n\n“We believe anything but full open source is a form of censorship, and that open sourcing the technology will help accelerate mass adoption of our ZK-rollup and establish zkSync Era’s zero-knowledge prover as the gold standard.”\n\nHowever, Matter Labs recommended not to fork the network until the launch of the next phase.\n\nBesides launching the new zkEVM phase and going open source, Matter Labs has also announced rebranding zkSync 2.0 to zkSync Era and sharing details about its updated roadmap."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiogFodHRwczovL3d3dy5pbmRpYXRvZGF5LmluL2NyeXB0b2N1cnJlbmN5L3N0b3J5L2JpdGNvaW4tZXRoZXJldW0tc29sYW5hLWFuZC1vdGhlci1tZW1lLWNvaW5zLW1ldGF2ZXJzZS10b2tlbnMtcmVtYWluZWQtcHJvZml0YWJsZS1vbi0yMS1mZWJydWFyeS0yMzM3NDYyLTIwMjMtMDItMjHSAaYBaHR0cHM6Ly93d3cuaW5kaWF0b2RheS5pbi9hbXAvY3J5cHRvY3VycmVuY3kvc3RvcnkvYml0Y29pbi1ldGhlcmV1bS1zb2xhbmEtYW5kLW90aGVyLW1lbWUtY29pbnMtbWV0YXZlcnNlLXRva2Vucy1yZW1haW5lZC1wcm9maXRhYmxlLW9uLTIxLWZlYnJ1YXJ5LTIzMzc0NjItMjAyMy0wMi0yMQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Feb 2023 08:00:00 GMT",
        "title": "Cryptocurrency price in India 21 February 2023: Bitcoin increases 2%, Ethereum up by 1%, meme coins mark gain - India Today",
        "content": "Top cryptocurrencies on Tuesday noticed gains. The largest cryptocurrency by market value, Bitcoin was up by 2 percent over the last 24 hours to trade at $24,923.42. At the time of writing this article (0930 IST), the value of Ethereum was up by 1.09 percent to currently trade at $1,703.47.\n\nThe value of XRP and Solana marked gains of 1.77 percent and 0.19 percent, respectively. The price of Toncoin witnessed a growth of 0.35 percent, followed by an increase in Cosmos by 1.86 percent. The value of Avalanche rose by 3.73 percent, along with a decline marked in Chainlink by 0.47 percent. However, other top crypto tokens like Litecoin and Polkadot fell by 2 percent and 0.90 percent, respectively.\n\nadvertisement\n\nOn 21 February, the global crypto market cap went up by 1.36 percent to $1.13 trillion in the past 24 hours. Contrastingly, the total crypto market volume stood at $62.34B billion, having witnessed a fall of 0.21 percent over the last day.\n\nGainers and decliners of the day\n\nAccording to CoinMarketCap, the top gainers were Conflux, Neo, Klaytn, and Huobi Token. Contrarily, the top losers were, Monero, Rocket Pool, Filecoin, and Blur.\n\n“I would argue that what you’re most likely going to see this year is a recovery year, where you spend about half the time moving higher, and half the time moving lower. You can break that up in different months, so you know 2018, 2014, 2022, we had like eight or nine red months, but in the recovery years, it’s split more or less into half and half,\" said Benjamin Cowen, founder & CEO at Into The Cryptoverse.\n\nMeme coins notice gains\n\nOn Tuesday, the value of meme coins remained profitable. Shiba Inu traded higher by 0.35 percent to $0.000014. The boost in values positively impacted the price of Dogecoin by a 0.40 percent increase to $0.087977. The value of Bone ShibaSwap advanced by 2.86 percent.\n\nMetaverse tokens in the green\n\nA majority of the top metaverse tokens showed price growth today. The price of ApeCoin was up by 2.76 percent, which continued in Axie Infinity by a 3.30 percent rise and Decentraland by a 1.78 percent boost."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZGVjcnlwdC5jby8xMjE4ODcvYmx1ci10by1haXJkcm9wLTMwMG0taW4tZXh0cmEtdG9rZW5zLXRvLWxveWFsLW5mdC10cmFkZXJz0gFZaHR0cHM6Ly9kZWNyeXB0LmNvLzEyMTg4Ny9ibHVyLXRvLWFpcmRyb3AtMzAwbS1pbi1leHRyYS10b2tlbnMtdG8tbG95YWwtbmZ0LXRyYWRlcnM_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Feb 2023 08:00:00 GMT",
        "title": "Blur to Airdrop $300M In Extra Tokens to 'Loyal' NFT Traders - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAscendant NFT marketplace Blur announced Tuesday that it will soon airdrop some $300 million worth of additional tokens to loyal users, days after overtaking once-untouchable competitor OpenSea as the most popular Ethereum NFT trading platform by trading volume.\n\nBlur will release 300 million of its native BLUR tokens to traders over the course of the platform’s “Season 2,” which has already begun. BLUR is currently trading at $0.99, according to CoinGecko.\n\n“Season 1,” which culminated with the debut of its native token BLUR last week, saw Blur dole out “care packages” of BLUR to traders who transitioned to the platform from a competing NFT marketplace, listed NFTs on the platform immediately following its October launch, or used Blur to bid on NFTs.\n\nAD\n\nAD\n\n“Season 2” will see tokens distributed to traders in a more fixedly gamified program, according to the company. Blur customers will be assigned a “loyalty score” based on their interaction with and commitment to the trading platform, and buyers and sellers who refrain from using any other NFT marketplace will receive a 100% loyalty score, for example.\n\nA user’s loyalty score, in combination with the quantity of NFTs they list, will determine how many BLUR tokens they will ultimately gain in a later airdrop.\n\n300M+ BLUR will be distributed to the community in Season 2. What’s the secret to maximizing rewards? Loyalty. Users with 100% loyalty have the highest chances of Mythical Care Packages, which are worth 100x Uncommon Care Packages. Here are 3 ways to maximize your loyalty👇 pic.twitter.com/Cgiemrvpxh — Blur (@blur_io) February 21, 2023\n\nUnder this new loyalty system, even minor actions can potentially boost a user’s odds of receiving more BLUR. The company implied Tuesday that even quote-tweeting its Twitter announcement regarding Season 2 could increase a user’s loyalty score.\n\nP.S. You can contribute to the Blur community in many ways, including quote tweeting this thread with a reason for why you use Blur 🙂 https://t.co/Lxy3mOjdPt — Blur (@blur_io) February 21, 2023\n\nAD\n\nAD\n\nIt is unclear, though, what technical mechanisms Blur has in place to link activity on separate platforms like Twitter with metrics on its own site. The company did not immediately respond to Decrypt’s request for clarification.\n\nTuesday’s announcement marks the latest escalation in an all-out war that has erupted between NFT platforms to attract and hold customers. $13.3 billion behemoth OpenSea, long considered the sole dominant Ethereum NFT marketplace, has in recent months bled users to Blur, largely thanks to the latter’s lucrative token-backed incentives program. Both companies have offered perks to users who blocklist the other.\n\nLast week, likely prompted by Blur’s sharp ascension and lack of marketplace fees, OpenSea eliminated its own 2.5% fee—the company’s primary source of revenue—for a “limited time.” It also cut down creator royalty protections, once a hallmark of the NFT model, which previously guaranteed creators a royalty fee—typically 5-10%—on secondary NFT sales. Such royalty fees are how NFT projects generate ongoing revenue following an initial drop or sale.\n\nWhile the sustainability of Blur’s aggressive incentives program is unclear, its immediate impact on competitors like OpenSea is all but certain to reinforce current trends.\n\nThough Blur does currently boast markedly higher trading volumes than OpenSea, the majority of that activity appears to have been generated by a smaller number of whale traders flipping NFTs to game Blur’s rewards program to accrue as much BLUR as possible.\n\nThe popularity of that rewards program is contingent on the value of Blur’s native token, however. In the last 24 hours, BLUR has shed some 24% in value, down from $1.28."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vY29pbmdlZWsuY29tL2FjY291bnQtYWJzdHJhY3Rpb24tb24tYml0Y29pbi1zaW5jZS1kYXktMS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Feb 2023 08:00:00 GMT",
        "title": "Account abstraction on Bitcoin since day 1 - CoinGeek",
        "content": "This post was first published on Medium.\n\nAccount abstraction has for a long time been a dream of Ethereum and has become a hot topic recently.\n\nWe demonstrate Bitcoin has shipped with account abstraction/unification since its genesis. Thus, all the salient features promised by AA can be and have been developed on Bitcoin, without any protocol changes and with little added complexity. Ethereum’s flawed initial design requires constant and complex retrofits to realize AA, which is still yet to be delivered, over 14 years later than Bitcoin.\n\nAccount Abstraction (AA)\n\nTo understand AA, we need to understand how accounts work on Ethereum first. An Ethereum account is similar to a bank account, but holds ethers or ETH rather than fiat. There are two types of accounts on Ethereum, both identified by a unique address.\n\n1. Externally Owned Account (EOA)\n\nEOAs are accounts owned by something external to the blockchain: users. They are the traditional accounts that users create with a wallet like MetaMask. An EOA has a public address controlled by the user’s private key, which can sign and initiate transactions. The validation of signature is hardcoded into the base layer and runs outside of the Ethereum Virtual Machine (EVM).\n\n2. Contract Account (CA)\n\nThese accounts are commonly known as smart contracts and are controlled by their smart contract code, not a private key. The smart contract is run in the EVM. Also a CA has storage and code, neither of which an EOA has.\n\nMotivations for AA\n\nEOA suffers from an one-size-fits-all issue. Whether an EOA has a balance of 1 ether or ethers worth billions of dollars, it is secured by a single private key. If a user loses the private key (or seed phrase) due to a small mistake, she can lose everything. This makes self-custody non-viable for mainstream audience.\n\nAA seeks to improve user experience and eliminate the existence of two types of accounts by unifying EOA and CA. It makes EOA programmable by moving the validation logic of signed transactions into the EVM, as in CA. An EOA can be tailored to each user’s needs.\n\nThe History and Current State of AA\n\nThere have been many proposals over the years on how to achieve AA on Ethereum.\n\nSome requires significant protocol changes such as EIP-2938. Others does not require protocol changes but fundamentally changes the workflow of a user wallet, such as the latest EIP-4337. It introduces a new mempool, a new actor called bundlers, and multiple new layers, among other changes. Given the enormous complexities introduced, it is not surprising EIP-4337 has not seen any meaningful adoption.\n\nAccount Abstraction on Bitcoin\n\nThe Bitcoin equivalent of an account is a so-called Unspent Transaction Output (UTXO). The bitcoins in a UTXO are controlled/locked by the smart contract code in it. To spend them, a user has to provide the matching “key”, which typically requires some kinds of secret information.\n\nCrucially, there is no distinction between a UTXO controlled by a private key and a UTXO not controlled by one. The spending condition of a UTXO is always validated in the Bitcoin Virtual Machine (BVM). The most popular types of UTXO has an address used by all Bitcoin wallets and is controlled by the corresponding private key¹. However, its validation of signature is still done at BVM and NOT baked into the base layer and thus requires no special handling, in contrast to Ethereum.\n\nUse cases\n\nBitcoin has AA from the beginning since it unifies all account/UTXO processing. To corroborate this, we list some of the most prominent AA features that have been implemented on Bitcoin. Other AA features can be achieved similarly.\n\nSponsored transactions\n\nIt allows third parties (such as a paymaster and an application) to pay transaction fees on behalf of their users. This is needed to onboard users without any bitcoins. One way to enable it is using the ANYONECANPAY sighash flags. It allows anyone to add inputs to a partially signed transaction, which can be used to pay miner fees.\n\nDifferent signature schemes\n\nBitcoin uses a specific signature scheme called ECDSA on a specific elliptic curve called secp256k1 by default, the same as Ethereum. Since a UTXO is controlled by a programmable smart contract, we can use any alternative signature schemes. For example, we have implemented Schnorr and BLS signatures.\n\nWe have also implemented ECDSA on alternative curves like secp256r1, which enables hardware signing using the secure enclave of iOS and Android devices.\n\nVault\n\nA non-custodial Bitcoin vault has been built, where bitcoins locked inside can only be transferred after a user defined time delay. A user can also set a spending limit per day and whitelists/blacklists, among other things.\n\nRecurring payments\n\nA Patreon-like service on Bitcoin has been implement to allow recurring payments.\n\nMultisig\n\nBitcoin has built-in support for multisig out of the box.\n\nNOTE:\n\n[1] The smart contract is called Pay to Public Key Hash (P2PKH).\n\nWatch: Blockchain: Data Power-Ups and NFTs for eSports & Online Games\n\nwidth=\"562\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\">\n\nNew to blockchain? Check out CoinGeek’s Blockchain for Beginners section, the ultimate resource guide to learn more about blockchain technology."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMivwFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWluLWluZGlhLWZlYnJ1YXJ5LTIwLWNoZWNrLWdsb2JhbC1tYXJrZXQtY2FwLWJpdGNvaW4tYnRjLWV0aGVyZXVtLWRvZ2Utc29sYW5hLWxpdGVjb2luLWJsdXItc3RhY2tzLXN0eC1nYWluZXItbG9zZXItMTU4MzI3NdIBwwFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWluLWluZGlhLWZlYnJ1YXJ5LTIwLWNoZWNrLWdsb2JhbC1tYXJrZXQtY2FwLWJpdGNvaW4tYnRjLWV0aGVyZXVtLWRvZ2Utc29sYW5hLWxpdGVjb2luLWJsdXItc3RhY2tzLXN0eC1nYWluZXItbG9zZXItMTU4MzI3NS9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Feb 2023 08:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin, Ethereum Remain Stable STX Gains Over 87 Percent - ABP Live",
        "content": "Bitcoin (BTC) and Ethereum (ETH), arguably two of the most popular crypto coins in the world, managed to remain above the $24,000 and $1,600 marks, respectively, over the weekend. While other popular altcoins — including the likes of Dogecoin (DOGE), Litecoin (LTC), and Ripple (XRP) — saw minor losses, Solana (SOL) gainer over 10 percent in the last 24 hours. Speaking of gainers, the price of Stacks (STX) saw a 24-hour jump of over 87 percent, making it the biggest gainer of the lot.\n\nThe global crypto market cap stood at $1.11 trillion at the time of writing, registering a 24-hour dip of 0.68 percent.\n\nBitcoin (BTC) price today\n\nBitcoin price stood at $24,346.95, registering a 24-hour loss of 1.38 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 20.47 lakhs.\n\nEthereum (ETH) price today\n\nETH price stood at $1,683.06, marking a 24-hour loss of 0.71 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 1.42 lakhs.\n\nDogecoin (DOGE) price today\n\nDOGE registered a 24-hour dip of 1.56 percent, as per CoinMarketCap data, currently priced at $0.0873. As per WazirX, Dogecoin price in India stood at Rs 7.40.\n\nLitecoin (LTC) price today\n\nLitecoin saw a 24-hour loss of 2.29 percent. At the time of writing, it was trading at $97.70. LTC price in India stood at Rs 8,250.\n\nRipple (XRP) price today\n\nXRP price stood at $0.3881, seeing a 24-hour dip of 0.99 percent. As per WazirX, Ripple price stood at Rs 32.40.\n\nSolana (SOL) price today\n\nSolana price stood at $25.77, marking a 24-hour jump of 10.32 percent. As per WazirX, SOL price in India stood at Rs 2,052.23.\n\nTop crypto gainers today (February 20)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nStacks (STX)\n\nPrice: $0.7648\n\n24-hour gain: 87.40 percent\n\nConflux (CFX)\n\nPrice: $0.2213\n\n24-hour gain: 46.72 percent\n\nNeo (NEO)\n\nPrice: $10.86\n\n24-hour gain: 12.97 percent\n\nFilecoin (FIL)\n\nPrice: $8.65\n\n24-hour gain: 10.99 percent\n\nSolana (SOL)\n\nPrice: $25.79\n\n24-hour gain: 10.51 percent\n\nTop crypto losers today (February 20)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nBlur (BLUR)\n\nPrice: $1.24\n\n24-hour loss: 8.59 percent\n\nMina (MINA)\n\nPrice: $0.9928\n\n24-hour loss: 6.94 percent\n\nRender Token (RNDR)\n\nPrice: $1.70\n\n24-hour loss: 6.75 percent\n\nThe Graph (GRT)\n\nPrice: $0.1695\n\n24-hour loss: 6.33 percent\n\nLido DAO (LDO)\n\nPrice: $3.01\n\n24-hour loss: 6.12 percent\n\nWhat crypto exchanges are saying about the current market scenario\n\nMudrex co-founder and CEO Edul Patel told ABP Live, “This morning, Bitcoin saw a slight dip, dropping from $25,000 to $24,000. Despite this, the BTC has maintained its weekly gains, indicating continued buyer activity. If buyers push the price back up to $25,250, there is no major resistance until $31,000. The support level for BTC currently sits at $23,800. Ethereum has followed a similar pattern, with its current trading near its resistance level of $1,700. Breaking through this could lead to an uptrend soon.”\n\nWazirX Vice President Rajagopal Menon said, “Bitcoin has seen a slight dip compared to the previous day because the US observed a President’s Day. Similarly, Ether has also been trading low in the past 24 hours for the same reason.”\n\nSathvik Vishwanath, CEO and co-founder of Unocoin said, “The BTC/USD pair had limited trading activity on Sunday, hovering between $24,400 and $25,250. A potential breach of the $25,250 resistance level could see Bitcoin rise towards $26,000 or $26,450, but a break below $23,300 could lead to a further decline towards $22,850.”\n\nKunji founder Anurag Dixit offered his take, “Bitcoin (BTC) has recently made multiple attempts to break through the significant resistance level of $26,000, but has been met with consistent retracements. However, despite this, certain sub-sectors within the cryptocurrency market have continued to perform strongly over the weekend, indicating the emergence of notable outperformance trends.\"\n\nShivam Thakral, the CEO of BuyUCoin, said, “It’s a great start for the week as Bitcoin is ready to test the crucial $25,000 mark. BTC is up by almost 12 percent in just seven days while the second largest digital asset Ethereum is up by over 10 percent during the same period. If Bitcoin finds strong support at the $24,000 level then it will provide much-needed momentum for BTC to test $30,000 in near future. Coinbase results and Hong Kong’s new licensing regime for VASPs will have a significant impact on the market in the coming weeks.”\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vYml0Y29pbmlzdC5jb20vd2h5LWV0aGVyZXVtLWRvbWluYW5jZS1jb3VsZC1iZS1pbi1ncmF2ZS1kYW5nZXIv0gFLaHR0cHM6Ly9iaXRjb2luaXN0LmNvbS93aHktZXRoZXJldW0tZG9taW5hbmNlLWNvdWxkLWJlLWluLWdyYXZlLWRhbmdlci9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Feb 2023 00:31:10 GMT",
        "title": "Why Ethereum Dominance Could Be In “Grave” Danger | Bitcoinist.com - Bitcoinist",
        "content": "Ethereum is the second-largest cryptocurrency ranked by market cap. A recent Merge “upgrade” to a proof-of-stake consensus mechanism and other changes raised discussion of a possible “flippening” — a situation where Ethereum unseats Bitcoin as the top cryptocurrency in the market.\n\nInstead, Ethereum’s dominance could be in “grave” danger, if an ominous-sounding Japanese candlestick pattern is a prelude of what’s to come across the crypto market.\n\nLagging Performance Against Crypto Leaves ETH.D Exposed To Danger\n\nWhile Ethereum might be up by 90% from its bear market low compared to Bitcoin’s 50%, when comparing year-to-date returns BTC’s 50% gain against USD beats ETH’s mere 40%. From this metric alone, it’s obvious that Ethereum has been lagging behind Bitcoin.\n\nAs of the last couple of weeks in crypto, the reason for the laggard behavior was revealed: the SEC began targeting cryptocurrency businesses, specifically for offering staking to customers.\n\nRather than the Merge causing Ethereum to outperform the market, it’s caused an opposite effect. Fears over ETH potentially being labeled a security have also raised concerns.\n\nWhether the fears end up being valid or not remains to be seen, continued lagging performance while the rest of the cryptocurrency market takes off into a bull run could take a major dent out of Ethereum dominance.\n\nA Gravestone Doji Could Damage Ethereum Dominance\n\nETH.D, representing Ether’s dominance compared to the rest of the market, closed the January monthly with an ominous-sounding Japanese candlestick pattern called a gravestone doji.\n\nA gravestone dojo appears | ETH.D at TradingView.com\n\nThe Japanese candlestick pattern is a potential bearish reversal signal, formed when there is an open, low, and close in the same general level, with a long upper wick. The formation shows bulls pushing prices higher, only to met with a strong rejection by bears back down to the open and low of the candle.\n\nThis type of behavior, and the candlestick signal, tend to appear before an extended down move. The opposite signal is called the shooting star and involves inverse formation dynamics. A small, bottom wick is acceptable, but the pattern often appears with a completely flat bottom.\n\nBearish momentum is increasing | ETH.D at TradingView.com\n\nLike any Japanese candlestick pattern, the signal is stronger when technicals and other chart patterns support what the gravestone doji tells the market. For example, a potential failure to reclaim a long-term trend line and strengthening bearish momentum add to credence to the signal. The gravestone doji is also appearing at long-term resistance that thus far Ethereum has been unable to break through.\n\nThe bullish alternative | ETH.D at TradingView.com\n\nAs a bullish alternative, even with further correction in ETH dominance, the chart could be forming a massive inverse head and shoulders pattern, possibly pointing to a future price target that would set new all-time highs against Bitcoin, and renew talk of a “flippening” in crypto."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3LnRyb253ZWVrbHkuY29tL3dlZWtseS1tYXJrZXQtd2F0Y2gtYml0Y29pbi1ldGhlcmV1bXMtZ2Fpbi_SAUpodHRwczovL3d3dy50cm9ud2Vla2x5LmNvbS93ZWVrbHktbWFya2V0LXdhdGNoLWJpdGNvaW4tZXRoZXJldW1zLWdhaW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Feb 2023 08:00:00 GMT",
        "title": "Weekly Market Watch: Bitcoin & Ethereum's Bulls Gain Momentum, Low Cap Tokens Experience Growth - TronWeekly",
        "content": "The previous week showed a more positive outlook for the crypto markets, with both Bitcoin and Ethereum seeing upward momentum. Although smaller market-cap coins initially saw notable growth at the beginning of the week, any progress made was ultimately wiped out by the week’s end.\n\nDuring the previous week, the cryptocurrency community was abuzz with talk about two low cap coins, BLUR and FLOKI, which had garnered significant attention. However, as the week drew to a close, both coins experienced substantial losses, reversing their double-digit gains and ending up in the red on the daily chart.\n\nFLOKI, a token themed around dogs, saw a surge in price on February 16th, reaching its highest levels since January 2022. On that day, the price of FLOKI rose by 65.43% in the last 24 hours and 75% in the previous seven days, with a 176% increase in trading volume over the past 24 hours.\n\nSource: CoinMarketcap\n\nAdditionally, the market cap grew by 65%. Currently, the coin has experienced a downturn, with about a 6% decrease in the last 24 hours, but it’s still up by 108.9% on the weekly chart.\n\nThe BLUR non-fungible token (NFT) marketplace launched its native token last week, and users who were awarded token allotments received “care packages.” Blur tokens began trading on February 14th, reaching a high of $5.02 per token. However, the coin has since dropped more than 97.16% from its all-time high and 5% on the daily chart.\n\nSource: CoinMarketcap\n\nHowever, several altcoins with also low-cap coins on the list of weekly gainers have shown substantial growth, with Conflux (CFX) leading the pack, followed by Filecoin (FIL) and The Klaytn (KLAY) in third place. Other tokens have also experienced significant gains.\n\nThe native cryptocurrency of the Conflux network, CFX, has been making waves in the crypto market, experiencing a surge of 294.54% over the past week and showing unique bullish signs.\n\nThe rise in price was sparked by Conflux’s announcement on February 15th that it plans to build blockchain-based SIM cards (BSIM cards) in partnership with China’s Telecom, the second-largest wireless carrier in China.\n\nAs of Monday, CFX was trading at $0.2132, experiencing a 25% increase in the past 24 hours and a remarkable 114.67% surge in the 24-hour trading volume. The token reached its peak of $0.2378 and ended the week at $0.2263 after starting at $0.05184, displaying a robust and impressive performance.\n\nSource: CoinMarketcap\n\nHowever, some market analysts caution that the token’s current rally may not be sustainable, with the support level at $0.090 considered unstable. A potential break below this mark could lead to a drop to $0.050 in the coming days.\n\nMeanwhile, as the Filecoin network continues to progress in the crypto market, it has garnered the community’s attention as a weekly gainer. Filecoin’s native cryptocurrency, FIL, has seen a significant surge of about 70% in the past week as it rallies ahead of the launch of the Filecoin Virtual Machine (FEVM) on the Filecoin mainnet.\n\nCurrently trading at $8.49, FIL reached its peak of $9.40 and ended the week at $8.44 after starting at $4.92, showing a strong and impressive performance. Despite experiencing a 3% decrease in the last 24 hours, the token’s trading volume has gone up by 50%.\n\nSource: CoinMarketcap\n\nMoreover, some popular coins are experiencing gains in weekly charts, including Klaytn (KLAY) at 35%, Solana SOL at 25%, and Polkadot DOT, with an increase of 20%, according to the data from CoinMarketcap.\n\nBitcoin (BTC) & Ethereum (ETH) Weekly Review\n\nAfter experiencing three consecutive weeks of consolidation without any significant gains, Bitcoin has made a strong comeback this week by surpassing the key resistance level of $25,000, marking a robust performance.\n\nSource: CoinMarketcap\n\nBitcoin recently reached an 8-month high on February 16th, but according to data analyst Santiment’s tweet, this bullish trend was accompanied by a significant amount of euphoria that may have caused a temporary peak in value.\n\nThe tweet suggests that the positive sentiment on social media platforms may have been overdone, leading to a local top. Additionally, negative commentary earlier in the month caused a temporary dip in Bitcoin’s value, with many investors losing faith in its long-term prospects.\n\nSimilar to Bitcoin, Ethereum has experienced a significant surge in value in the past week, reaching an impressive 5-month high on February 16th, according to another tweet by data analyst Santiment.\n\nThe rise in Ethereum’s value is notable as it follows the significant #merge event that merged Ethereum’s mainnet with the Ethereum 2.0 beacon chain. Additionally, the data indicates that a high concentration of ownership remains in the market, with shark and whale addresses holding nearly 47% of the supply.\n\nCoinMarketCap data shows that Bitcoin is currently trading at $24,473.30, with a slight decrease of 0.50% over the past 24 hours but a 12.49% increase over the past seven days. While ETH is being traded at $1,692.55, experiencing a 0.07% decrease in the past 24 hours and a 12.14% increase in seven days. Additionally, both leading coins are experiencing a 50% growth in the 24-hour trading volume."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3Lm91dGxvb2tpbmRpYS5jb20vb3V0bG9vay1zcG90bGlnaHQvNy1iZXN0LWV0aGVyZXVtLWFsdGVybmF0aXZlcy10by1idXktaW4tMjAyMy1uZXdzLTI2NDAyNdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Feb 2023 08:00:00 GMT",
        "title": "Here Are 7 of the Best Ethereum Alternatives to Buy in 2023 - Outlook India",
        "content": "In addition, C+Charge is providing a lot of transparency to an industry that desperately needs it. Before now, it was hard for EV drivers to know what charging stations were available and working in advance of pulling in – or even what the price of the charges would be. This great new crypto app is helping to provide that transparency and information to EV drivers."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDIvMjEvYWxnb3JhbmQtYW1vbmctYmVzdC1sYXllci0xLWJsb2NrY2hhaW5zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Feb 2023 08:00:00 GMT",
        "title": "Algorand among the best Layer 1 blockchains - The Cryptonomist",
        "content": "Algorand stands as one of the most functional Layer 1 blockchains in the crypto world.\n\nAnalysis of the Layer 1 Algorand and how it compares with leading competitors\n\nLayer 1 blockchains in the amazing world of crypto have a special place and these are all those chains that are very similar to Ethereum.\n\nThere are many competitors who would like to claim the title “Ethereum killer,” but to date none has succeeded.\n\nIt is a segment full of competitors trying to offer ever-improving speed and efficiency.\n\nEthereum is the most widely used and emblazoned chain, but even Vitalik Buterin himself knows that it is a slow network and more expensive than others.\n\nResearch firm CoinCodex tried to analyze six Layer 1 blockchains including Ethereum, Cardano, Solana, Avalanche, Algorand and Internet Computer to understand their differences and merits.\n\nAlgorand placed well, in third place in the special ranking, and one of its strengths was certainly its speed.\n\nAlgorand manages to process as many as 20 TPS every 4.5 seconds and has a processing of 1,200 TPS with instantaneous finality that it wants to increase to 3,000 TPS.\n\nIn terms of speed the company placed third just behind Avalanche with 4500 TPS in 2.5 seconds and Internet Computer, 11500 TPS per second.\n\nAlgorand: PPOS\n\nAlgorand is based on Pure Proof-of-Stake; those who propose blocks and those who verify them are selected by the VRF (Verifiable Random Function) algorithm.\n\nIn contrast to classical Proof-of-Stake protocols doing so speeds up the computational process and Algorand is in fact more scalable.\n\nAlgorand boasts more or less 2,000 nodes on a central server and relies on AWS to scale its network.\n\nOn chain, on the other hand, the company uses the InterPlanetary File System (IPFS) as its data storage.\n\nThe same problem of Avalanche and Cardano occurs with Algorand, which is forced to manage its own keys leading to problems with wallets.\n\nIn the overall ranking, as mentioned above, Algorand ranks third tied with Avalanche.\n\nOne of Algorand’s strengths is the certification of its components so as to attract institutional investors, which is taken care of specifically by researcher Silvio Micali.\n\nInvestors Observer gives the crypto company a fairly low volatility rating (32) among the 30% of crypto assets that are less volatile.\n\nALGO is considered low volatility, as a result of risk and return analysis that revealed low fluctuations and difficult to attack by speculation.\n\nThe trend of the ALGO crypto\n\nAlgorand (ALGO) starts to slow its growth on Thursday but analysts say it is only a momentary setback.\n\nIn November 2021, ALGO’s price touched its All Time High (ATH) of $2,990.\n\nFrom the day of the peak two years ago to today, the token has been on an inexorably downward parabola.\n\nOnce it touched $0.16, Algorand began to climb back up.\n\nThe value falls but if the resistance at 0.410 is breached, the token will go on to test the next resistance at $0.170.\n\nToken value fell from a negative parabola and then validated it as resistance.\n\nThe loss in value had been somewhat predictable from the bearish difference in the RSI.\n\nIf we were to rely on probability calculations the bearish movement is given 3 to 1.\n\nAt that point, the resistances set as targets would be those at 0.5-0.618 Fib.\n\nBasically, most analysts believe that Algorand this month-end will continue its descent right towards the above areas.\n\nIf the token succeeds in making the ascending support line its own in the short term then the correction may have ended and ALGO could target $0.410."
    }
]