[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2FkZHJlc3Nlcy1oZWxwaW5nLWV0aGVyZXVtLXNjYWxl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 May 2023 07:00:00 GMT",
        "title": "100000 Addresses Are Helping Ethereum Scale — You Can Too - Blockworks",
        "content": "To scale Ethereum, researchers came up with a plan to make storing data from layer-2 rollups much cheaper. The first phase entails the introduction of EIP-4844 — known as proto-danksharding — to Ethereum mainnet, anticipated to happen with the Dencun upgrade by year’s end.\n\nBut to do that, they needed some entropy — random data, or “secrets” if you will — and preferably lots of it.\n\nEIP-4844 will introduce a new “blob-carrying transaction” — a temporary data storage mechanism for layer-2’s to pass data to Ethereum mainnet validators.\n\nBlockspace on Ethereum is at a premium, so to cut down on the requirements for verifying layer-2 data, Ethereum will use a polynomial commitment scheme known as KZG commitments, which is necessary for data availability sampling under proto-danksharding.\n\nKZG commitments, in turn, require a “trusted setup” — a way to generate a common set of parameters that provers and verifiers use to function. For the setup to be trusted, there needs to be a set of random values used as inputs that nobody knows. When done improperly, it can compromise the proof system, as famously happened to Zcash in 2018.\n\nWithout getting too deep into the technical nuances of Merkle Trees and Kate proofs (the “K” in “KZG”), it’s important to know just one thing:\n\nYou only need one honest participant to guarantee the validity of the trusted setup for everyone.\n\nEthereum researchers devised a way to let anyone with an Ethereum address participate, with some history of using the network required to join in. It’s a goodwill gesture — you get nothing in return except for peace of mind.\n\nAs a participant, you only need to trust yourself and no one else, because each contribution contributes to the randomness of the system — effectively guaranteeing that there can be no collusion in the trusted setup. It’s easy and takes just a minute of work and some waiting at ceremony.ethereum.org.\n\nWhen opened to the public on April 17, contributions were limited to Ethereum users with a lot of transaction history to cut down on the wait time. But those limits were gradually reduced such that today you can contribute with only 16 transactions.\n\nThat lowered bar is one reason why the number of total contributions has been on the up and up, recently passing 100,000 unique contributions.\n\nThat doesn’t necessarily mean 100,000 individuals — one person can have more than one address — but only one contribution per address is allowed, and each one contributes a small measure of security to the rollup-centered future of Ethereum.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9kb3JtYW50LWV0aGVyZXVtLWljby13YWxsZXQtYXdha2VuLXllYXJz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 May 2023 07:00:00 GMT",
        "title": "Another dormant Ethereum wallet reawakens after 8 years, moving millions - Cointelegraph",
        "content": "An Ether (ETH) wallet that has been inactive in 2015 has suddenly awoken after eight years of dormancy, moving a total of 8,000 ETH in just two minutes.\n\nThe wallet received 8,000 ETH after participating in Ethereum’s ICO (initial coin offering) in 2015 and remained inactive until May 27. On that day, its owner began with a cautionary transfer of 1 ETH to a new wallet. One minute later, they transferred the remaining 7,999 ETH to the new wallet address.\n\nAt the time of writing, the ETH stash is worth approximately $14.7 million.\n\nThis transaction was first noticed by blockchain analytics service Lookonchain, which informed its 219,000 Twitter followers of the transfer.\n\nAn Ethereum ICO participant who has been dormant for 8 years woke up today.\n\n\n\nHe transferred all 8000 $ETH($14.7M) to a new address.https://t.co/1griKB9Te9 pic.twitter.com/1bvQh3zsqY — Lookonchain (@lookonchain) May 28, 2023\n\nIn the comments section of the post, there was some community speculation around the reason for the transfer. One commenter suggested that the owner had just been released from prison, while another made a humorous remark that they were transferring funds from an old Ledger — a pointed comment about the company’s controversial new Recover upgrade.\n\nAt the time, the 8,000 ETH was purchased at a price of just $0.31 per token, which places the initial investment amount at around $2,500.\n\nAt today’s prices of $1,917, this marks a staggering 590,000% gain for the owner.\n\nThis isn’t the only ICO-era Ether wallet to re-awaken in recent months. On April 24, another wallet that received 2,365 ETH ($4.5 million) made its first transaction in nearly eight years, with the owner transferring 2,360 ETH to a new wallet address.\n\nOn March 5, another ETH wallet transferred 10,226 ETH ($19.6 million) out to new wallet address after remaining dormant for five years.\n\nThe new wallet address is also one with little in the way of any significant transaction history. The only other ETH transaction recorded in the new wallet is a 207 ETH ($380,000) incoming transaction that was made just a few minutes prior to the most recent transfer. Notably, the additional 207 ETH were sent from another wallet that had remained completely inactive since June 12, 2017.\n\nRelated: Arbitrum-based Jimbos Protocol hacked, losing $7.5M in Ether\n\nInterestingly, the new wallet also contains $46 worth of a memecoin called Gensler (GENSLR), and just $0.24 worth of a dragon-inspired token called Dejitaru Tsuka (TSUKA), according to data from Web3 wallet tracker DeBank.\n\nTotal allocation of token holdings in the owner’s new wallet. Source: DeBank\n\nThe Ethereum ICO occurred raised $18 million in two stages between July and September of 2014. The going exchange rate for the pre-sale was 1 Bitcoin for 2,000 ETH. The Ethereum blockchain was not launched until July 30, 2015, meaning that investors had to wait for more than a year to be able to redeem and use their Ether.\n\nDormant wallets with vast sums of crypto can awaken for a variety of reasons. Sometimes dormant wallets reawaken because they’ve been hacked. Other times, it's simply because the owner may have forgotten about it and upon its re-discovery, have decided that it's possibly a good time to sell.\n\nCrypto City: Guide to Osaka, Japan’s second-biggest city"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vZm9ya2FzdC5uZXdzL2V0aGVyZXVtLW5mdHMtdHJhbnNmZXJhYmxlLWJpdGNvaW4v0gE8aHR0cHM6Ly9mb3JrYXN0Lm5ld3MvZXRoZXJldW0tbmZ0cy10cmFuc2ZlcmFibGUtYml0Y29pbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 May 2023 07:00:00 GMT",
        "title": "Ethereum NFTs now transferable to Bitcoin - Forkast News",
        "content": "A trio of key players in the Bitcoin non-fungible tokens (NFT) ecosystem have rolled out the BRC-721E token standard on Monday, a feature that allows traders to move their ERC-721 tokens, a standard that enables ownership of Ethereum-based NFTs, to the Bitcoin network.\n\nSee related article: Ordinals inscriptions slow down but Bitcoin congestion lingers\n\nFast facts\n\nThe initiative launched on Monday as a collaboration between Ordinals.market, Bitcoin Miladys NFT collection and the Xverse Bitcoin wallet.\n\nThe new token standard permanently burns the ERC-721 NFTs on Ethereum and allows users to claim the recreated version of the digital asset on Bitcoin as a BRC-721E inscription. This transfer process is irreversible.\n\nThe launch of the BRC-721E standard occurred on the same day as a significant milestone for Ordinals, an iteration of NFTs on the Bitcoin network, as it surpassed its 10 millionth inscription, according to data from analytics platform Dune Analytics.\n\n“The enabling of non-fungibility on Bitcoin with Ordinal theory is opening up a wide array of NFT use cases that we have seen develop on Ethereum from 2018-2022,” said Yohann Calpu, chief marketing officer of Forkast Labs. “Many Ethereum NFT holders buy into the Bitcoin concept of increased decentralization, immutability and scarcity.”\n\nNFT sales on Bitcoin fell 18.50% to US$4.09 million, in the 24 hours leading up to 8:50 p.m. in Hong Kong, according to CryptoSlam.\n\nEthereum NFT sales surged 16.7% in the same period.\n\n\n\nThe sales spike has not translated into an overall uplift for the Ethereum NFT market. The Forkast ETH NFT Composite, an index designed to track the performance of the Ethereum NFT market, is down 0.26% over the past day and 6.21% on the month. The index encompasses up to 250 eligible smart contracts, providing a comprehensive snapshot of the market’s status.\n\nSee related article: Hong Kong Solidifies Crypto Regulations even as Malaysia bears down on Huobi"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vbW9kZXJuZGlwbG9tYWN5LmV1LzIwMjMvMDUvMjkvZXRoLXByaWNlLXByZWRpY3Rpb25zLWFuZC11cGdyYWRlcy1mb3ItZXRoZXJldW0taW4tdGhlLWZ1dHVyZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 May 2023 07:00:00 GMT",
        "title": "ETH Price Predictions and Upgrades for Ethereum in the Future - Modern Diplomacy",
        "content": "Excerpt: If one assumes a steep, monotonic increase in price for Ethereum, along with a natural expansion of the network across several other countries, the price of Ethereum will likely touch $16,024.42 by the end of 2030.\n\nEthereum, which is the second-largest cryptocurrency by market cap, has become a vital part of the decentralized finance (DeFi) and Non-Fungible Tokens (NFT) environments. Ethereum, with its indigenous currency Ether (ETH), has suffered massive instability and growth over the years.\n\nDeFi and NFTs have earned significant traction and have massively contributed to Ethereum’s valuation. DeFi proposes several financial services while NFT is a class of digital collectibles that represent exclusive ownership of assets. Both DeFi and NFT significantly depend on Ethereum’s smart contract feature, making Ethereum a vital component of the digital markets.\n\nSeveral factors can change the price of Ethereum. For example, factors such as market demand, regulatory developments, technological advancements, and macroeconomic trends. Below are some of the price predictions for the upcoming years.\n\nEthereum (ETH) Price Prediction from 2023 -2030\n\nThe entire of 2023 will be spent recovering from the crypto winter. Ethereum is estimated to touch $3,277.72, and the minimum price can be predicted at $2,185.15. The average price for the years should hover around $2,731.44. Ethereum is predicted to achieve newer heights in 2024 and present an average price of $4,552.39. In 2025, Ethereum is expected to increase to an average of $6,373.35.\n\nIf one assumes a steep, monotonic increase in price for Ethereum, along with a natural expansion of the network across several other countries, the price of Ethereum will likely touch $16,024.42 by the end of 2030. Moreover, the average price of the token will steady itself at $15,478.14. The major bull run over the past five-six years is likely to uphold the market sentiment and hence, the price of Ethereum will rise accordingly.\n\nSeveral other price predictions for Ethereum in the future are provided below.\n\nEthereum prediction by Raoul Pal\n\nThe Chief Executive Officer of Real Vision Group, Raoul Pal says all things positive about Ethereum. In a recent interview, he estimated that Ethereum would reach $20,000 by the end of 2023, and would be a significant hike from its present price.\n\nEthereum Prediction by Michael Van de Poppe\n\nAccording to crypto analyst and trader Michael Van De Poppe, Ethereum could achieve a price between $2700 and $3000 in the next couple of months. His estimates are based on the increasing adoption of DeFi and NFTs along with Ethereum’s incoming upgrades.\n\nEthereum’s Upgrade and its Impact\n\nEtereum 2.0 is a network upgrade that is focused on enhancing the platform’s scalability, privacy, and energy efficiency. This upgrade is highly anticipated by the blockchain community and hence, can have a massive impact on Ethereum’s price.\n\nEthereum 2.0 is a series of upgrades curated to make Ethereum more scalable and secure. Essentially, the Ethereum network’s upgrade revolves around transitioning from the current Proof of Work (PoW) consensus mechanism to the Proof of Stake (PoS) model. PoS, which is a way to validate transactions on the blockchain, makes the network more energy-efficient and environment-friendly than the PoW model. This transition has gained traction from several investors and crypto enthusiasts who are environment-conscious and want to use a network that is easy on the planet.\n\nSince the most recent Ethereum upgrade uses lesser gas fees, it shall be assumed as the next blockchain of choice. Moreover, the network upgrades enhance the network’s scalability via the application of sharding and several other optimizations. This will enable more transactions per second while lessening the congestion.\n\nIn the future, the price predictions are estimated to be bullish, however, the crypto market has shown its instability over the past few years and nothing can be estimated with utmost guarantee."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA1LzI5L2RvZXMtdGhpcy1uZXctZXRoZXJldW0tcml2YWwtcmVhbGx5LWhhdmUtNDAweC11cHNpL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 May 2023 07:00:00 GMT",
        "title": "Does This New Ethereum Rival Really Have 400x Upside Potential? - The Motley Fool",
        "content": "Ethereum (ETH 0.03%) remains one of the great all-time crypto investments. If you had invested in Ethereum way back in 2015 when things were just getting started, you'd be up a head-spinning 63,500% today.\n\nSo it's perhaps no surprise that the arrival of what some are calling the next Ethereum is cause for celebration in the crypto world. We've seen that already with the likes of Solana and Avalanche -- both were tagged as potential Ethereum killers almost as soon as they launched. And we are starting to see the same phenomenon with Sui (CRYPTO: SUI), a highly touted Layer-1 blockchain that just launched in May.\n\nWhat is Sui?\n\nSui is a super-fast, super-scalable proof-of-stake Layer-1 blockchain with a nearly impeccable pedigree. Many of the developers at Sui worked on Diem, the big blockchain project from Meta Platforms. And the founders of Sui have already lined up more than $330 million in venture capital from some high-profile names, including Coinbase Ventures.\n\nThe big draw right now seems to be Sui's transaction processing speed. The blockchain claims to be able to process up to 300,000 transactions per second (TPS), which is way beyond what even Solana (65,000 TPS) can offer. Moreover, the developer team behind Sui claims the blockchain is optimized for digital assets and the brave new world of Web3, due in large part to the programming language they use.\n\nHow high can Sui go?\n\nA little market cap comparison will give you a good idea of how high Sui could soar. Right now, it has a market cap of slightly over $500 million. So if it does a 10 times return on investment, it would give Sui a market cap of approximately $5 billion -- that's Solana and Avalanche territory. Currently, Solana has a market cap of $7.7 billion, and Avalanche's is $4.7 billion.\n\nBut let's say Sui eventually replaces Ethereum simply based on its superior performance characteristics. That's when things will really get interesting. Ethereum has a market cap of more than $200 billion right now, so if Sui ever catches up to Ethereum, that would be a 400-fold return on investment. You can start to see why investors love the concept of the next Ethereum -- the numbers get very big quickly.\n\nIn many ways, this same logic has already played out with Aptos (APT -1.04%), which was introduced in October 2022. Aptos was the other major blockchain project spun out of Diem, and like Sui, it came with an impeccable pedigree, top developer talent, and high-profile venture capital backing. Despite practically launching into the eye of a tornado (the FTX debacle in November 2022), Aptos is now up a staggering 125% year to date and is already one of the top 40 cryptos in the world by market capitalization.\n\nBut do we really need another Ethereum?\n\nThe big question, of course, is whether the blockchain world needs another Ethereum. At one time, we did, because Ethereum was still a slow, old-fashioned proof-of-work blockchain. But then came The Merge last year, and as a result, I'm not convinced we really need another Ethereum. Many speed and performance issues have now been addressed, and Ethereum pulled off The Merge without a hitch.\n\nSo for Sui to hit all its grandiose growth targets, many things would have to go right. For one, developers would have to perceive a real need to abandon Ethereum and switch to another blockchain for all their future development projects. I don't think that's going to happen. Moreover, Sui would have to beat out not just Ethereum but also a long list of previous Ethereum-killers, including (but not limited to) Solana, Avalanche, and now Aptos. That's a big ask.\n\nIt's still Ethereum, and it's not even close\n\nFor now, I cannot recommend Sui as a long-term investment. It's certainly interesting because of its price (still trading for around $1) and pedigree. But I just don't think faster speeds are enough to win over developers, users, and investors.\n\nAt the end of the day, people want to see what's built on top of the platform, and right now, you just can't beat Ethereum, which is dominant in many key areas of the blockchain world. Ethereum is still the world's premier Layer-1 blockchain. As a result, I remain bullish on Ethereum, both short-term and long-term."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9mbGlwcGVuaW5ncy1iZWFyLWJ1bGwtbWFya2V0LWV0aGVyZXVtLTE5MDQyNTY3Ni5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 May 2023 07:00:00 GMT",
        "title": "The Flippenings: Bear to Bull Market and Ethereum NFTs to Bitcoin Ordinals - Yahoo Finance",
        "content": "Change is in the air. Crypto and non-fungible tokens (NFT) have been in a pretty brutal bear market for almost exactly a year now, which many, myself included, had projected to last for years.\n\nBut now, there are signs of life springing up all around, being driven by Bitcoin NFTs, and recent news of China opening the door for citizens to engage the blockchain again. The bear market may be over sooner than we had thought, so let’s get into what’s making me think that NFTs might just be back.\n\nNoteworthy Happenings\n\nChina is coming into NFTs and crypto, and Russia will use crypto to settle payments across borders. These two major announcements are bringing excitement back to the NFT and crypto markets and lead many to believe that these alone can turn the market around.\n\nCollectors are eying high-priced NFTs ahead of a potential incoming pump from Chinese investors looking to snatch NFT grails like CryptoPunks, BAYC and Azuki. An x-factor that not enough people are talking about yet is, what if they decided to dive into the mostly unexplored world of Bitcoin NFTs where opportunities may be even greater than the already expensive Ethereum ecosystem?\n\n9c5633eec1494d4082106924f68b42e7\n\n6cb7e0d5822d4f94890b7c0403522c78\n\nBitcoin NFTs are really starting to cook, and just yesterday the 10 millionth Ordinal was inscribed . This massive milestone many thought improbable just a few months ago, but believers in Bitcoin NFTs never had a doubt. At this point, no one can deny that Bitcoin’s NFTs are here to stay, but the question of ‘Will Bitcoin NFTs flip Ethereum NFTs?’ is another story. I think they will.\n\nA new token standard was created on Bitcoin yesterday called BRC-721E . This will let traders bridge their Ethereum NFT over to Bitcoin by “burning” the Ethereum NFT and re-creating it on Bitcoin. Now we’ll get to see traders’ convictions on the Bitcoin ecosystem play out in real time.\n\nA new meta is emerging in NFTs which is to drop a new cryptocurrency (an ERC-20 or BRC-20 token) and then build an ecosystem around it, likely with NFTs. $OXBT is the new hottest BRC-20 collection on Bitcoin, and there are teases of upcoming utility for this token. Fun fact , $OXBT is now held by more wallets than any other individual digital asset on the Bitcoin blockchain other than BTC itself and its smaller denomination, Satoshis.\n\nStory continues\n\na4599e0a4dd145aeb61cc2d24f2dd35b\n\nThis hot new meta recently took off with new meme coins like $PEPE, $TURBO, $BEN, and $PSYOP looking for ways to drive more users to the token, and the concept now seems destined to shape the NFT scene for the foreseeable future.\n\nGaming on the cusp of taking over Web3\n\nGaming is on the cusp of taking over Web3. Epic Games, the creator of Fortnite, now has over 20 blockchain games listed on their store with some like Defimons now entering a closed beta.\n\nIf Mythos Chain’s DMarket, and ImmutableX’s Gods Unchained are any indication of what’s to come (they are), we’re in for a meteoric rise in NFT adoption. Just look at how the buyers/sellers and transactions compare to a typical PFP project.\n\n\n\n2a9870b110894ef6afe55c2126bd4afc\n\nSales from these two projects have propelled them into the top five for the past seven days, foreshadowing what’s to come as blockchain games begin to enter the mainstream.\n\nd8d1482d3ccc4c458ecb33ecf14db76e\n\nPeep the charts\n\nI don’t know about you, but I’m fascinated to see who Bitcoin’s growth impacts more, Ethereum and its layer 2s, or Solana? Take notice of which chains aren’t in the top 10 NFT Collection Rankings by Sales Volume for the past 7 days, and you’ll see who it may be.\n\nNakamigos have had a sudden surge, as have Jack Butchers’ art project Openens, pushing both ahead of Milady Maker and into the Top 10. Milady Maker continues to hang around with the big dogs, now with extra action that revolves around the new BRC-721E bridge that originated in the Milady project.\n\n\n\n\n\n5c6fad5d8fee4767872aa5e437fb3e7f\n\nBitcoin continues to fall from its previous seven-day highs, but other ecosystems like Solana and Ethereum are on the upswing. I expect this tug-of-war to continue until new users come into the space, and bring liquidity to be able to push both up at the same time.\n\n(Disclosure: The author of this commentary holds $OXBT)"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9jcnlwdG9jdXJyZW5jaWVzL25ld3MvZXRoZXJldW0tbmVhcnMtdmlzYS1pbi1wcm9jZXNzZWQtdHJhbnNhY3Rpb24tdm9sdW1lLXdoYXQtdGhpcy1tZWFucy0yMDIzMDUyOTIxMzXSAYMBaHR0cHM6Ly93d3cuZnhzdHJlZXQuY29tL2FtcC9jcnlwdG9jdXJyZW5jaWVzL25ld3MvZXRoZXJldW0tbmVhcnMtdmlzYS1pbi1wcm9jZXNzZWQtdHJhbnNhY3Rpb24tdm9sdW1lLXdoYXQtdGhpcy1tZWFucy0yMDIzMDUyOTIxMzU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 May 2023 07:00:00 GMT",
        "title": "Ethereum nears Visa in processed transaction volume, what this means - FXStreet",
        "content": "Share:\n\nEthereum almost caught up with Visa in processed transaction volume, recording $3.01 trillion vs. $3.08 trillion respectively.\n\nThe popular blockchain is already the network of choice for many established players looking to utilize the novel technology, Visa included.\n\nNotably, Ethereum is far younger than the traditional payments giant.\n\nThe report attests to growth in mainstream adoption of crypto and blockchain, despite association with scammers, drug dealers, and cybercriminals.\n\nEthereum (ETH), though younger than traditional payment moguls like Visa, has shown that blockchain has become a formidable force in the financial market for the second time in three years. The news comes after a Coingraph report indicating that the Ethereum blockchain recorded a trading volume of $3.01 trillion against Visa's $3.08 trillion.\n\nJUST IN: $ETH almost caught up with Visa in processed transaction volume - $3.01 trillion vs. $3.08 trillion, respectively. — Coingraph | News (@CoingraphNews) May 29, 2023\n\nEthereum premiered in 2016, 58 years after Bank of America (BofA) founded Visa as the BankAmericard credit card program.\n\nAlso Read: Ethereum ZK rollups eye Arbitrum's market share as adoption rises\n\nEthereum almost caught up with Visa in processed transaction volume\n\nEthereum (ETH) blockchain has recorded a massive $3.01 trillion trading volume, only about 0.07 trillion less than Visa. The competition is remarkable, especially for Ethereum, because of the bearish market since mid-2022.\n\nWith this information, Ethereum testifies to the growth in blockchain technology so much that it can now rival established players within the payments technology space. It also evidences the growth in mainstream adoption of a budding technology often associated with an enabler of crime. This is because scammers, drug dealers, and cyber criminals are now more inclined to digital assets than traditional finance.\n\nBased on Etherscan data, Ethereum daily transactions hit 968,996 on May 28, with the all-time high being 1,932,711 transactions on December 9, 2022.\n\nAlso Read: Ethereum worth $7.5M stolen in Arbitrum-based Jimbos Protocol exploit\n\nAs the second-largest blockchain in the world, Ethereum powers a wide range of financial technology solutions committed to revolutionizing the finance market on a global scale. These solutions include staking, lending, flash loans, and decentralized finance (DeFi).\n\nFurther, the Ethereum blockchain has become a wealthy, agile, and dynamic environment with a wide provision for further development. This is another advantage of Ethereum over traditional financial layers.\n\nEthereum foray into TradeFi\n\nThe famous blockchain is already the choice network for most established traders and investors like Visa, who want to use the novel technology. A May report about Ethereum's economics indicated that Visa employed Ethereum's Goerli testnet to try transaction-free payments using account abstraction.\n\nIt leveraged a smart contract christened 'Paymaster,' which allowed the company to capitalize on account abstraction to perform complex tasks on behalf of accounts and manage transaction costs. Citing Head of Crypto Cuy Sheffield at Visa at the time:\n\nExcited to see Visa deploy our first paymaster smart contract on testnet as we continue to research and experiment with account abstraction and ERC-4337.\n\nERC-4337 is an Ethereum standard that performs account abstraction without a consensus-layer alteration. This allows users to bundle and automate transactions on the network.\n\nEthereum previous triumph over visa: A deep dive into the factors\n\nThis is not the first time Ethereum has shown its gusto against Visa. The blockchain network had outperformed the payments giant in 2021, recording $11.6 trillion against Visa's $10.4 trillion trading volume.\n\nIn 2021, VISA moved $10.4 trillion in payments volume, Ethereum moved $11.6 trillion. — Blockworks (@Blockworks_) January 19, 2022\n\nThis was attributed to the second largest crypto recording 4.5X as many daily transactions as Visa and was corroborated by Ethereum Foundation's Josh Stark.\n\nFUN FACT: #Ethereum processed 4.5x times more transactions than Visa in 2021. — Watcher.Guru (@WatcherGuru) May 6, 2022\n\nDespite the difficult conditions in the crypto market, Ethereum survived through regulatory clampdowns, a myriad of bank crises amidst turbulences in traditional finance, and the ensuing Fear, of Uncertainty and Doubt (FUD). The role of developments and upgrades cannot be ignored as these are the major reasons for ETH high volume transactions. The Merge upgrade and Shanghai/Capella (Shapella) upgrade are among the major upgrades, as they reduced the gas fees and spiked the number of transactions between 2022 and 2023."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZGVjcnlwdC5jby8xNDI4NzAveW91LWNhbi1ub3ctbWlncmF0ZS1ldGhlcmV1bS1uZnRzLWJpdGNvaW4tYnV0LXRoZXJlcy1jYXRjaNIBWmh0dHBzOi8vZGVjcnlwdC5jby8xNDI4NzAveW91LWNhbi1ub3ctbWlncmF0ZS1ldGhlcmV1bS1uZnRzLWJpdGNvaW4tYnV0LXRoZXJlcy1jYXRjaD9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 May 2023 07:00:00 GMT",
        "title": "Ethereum NFTs Can Be Migrated to Bitcoin, But There's a Catch - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nWhile Ethereum remains the dominant NFT platform in terms of trading volume and overall value, Bitcoin has undoubtedly swallowed up much of the buzz in the NFT space via the recent rise of the Ordinals protocol. And for Ethereum NFT holders who’d rather be on Bitcoin, there’s now a migration solution—but it’s a one-way trip.\n\nBitcoin Miladys, an NFT project that offers derivatives of the Ethereum-based Milady Maker profile picture (PFP) project, launched a bridge in partnership with marketplace Ordinals Market and the Xverse Bitcoin wallet. The BRC-721E token standard, as it’s called, enables the bridge to migrate artwork and data over to Bitcoin via Ordinals.\n\nThe bridge lets holders of Ethereum NFTs—defined by the ERC-721 token standard—effectively move the asset to the Bitcoin blockchain via a burn-and-mint process. The original Ethereum NFT is sent to an inaccessible “burn” address, which means it’s essentially destroyed on the chain, but then the asset is recreated on Bitcoin via the Ordinals protocol.\n\nAD\n\nAD\n\nBitcoin Miladys were initially minted on Ethereum, so the bridge was initially designed to let its holders bring them over to Bitcoin. But as the Ordinals Market page describes, the BRC-721E token standard and bridge can work with any compatible Ethereum NFT.\n\nSome cross-chain bridges use an escrow wallet in the middle and hold the original NFT or asset, then create a new version on the target chain. That makes it possible to reclaim the original asset on the original chain by burning the secondary version.\n\nIt’s a one way bridge by the way🤭 pic.twitter.com/vTCj8paFV6 — Bitcoin Miladys💞🍊💫🌸 (@BitcoinMiladys) May 28, 2023\n\nBut that’s not possible with NFTs migrated to Bitcoin via the BRC-721E process. As mentioned, it’s a one-way journey, and the original NFT is essentially destroyed in the process.\n\nAD\n\nAD\n\nThe process may still prove appealing to Bitcoin aficionados, or perhaps NFT holders who believe that the buzzy rise of Ordinals will give their migrated NFT more value. However, there are potential risks to switching blockchains.\n\nFor example, back in February, a Bored Ape Yacht Club owner burned his original Ethereum NFT and minted a new version on Bitcoin via Ordinals. Soon after, one of the Bored Ape co-creators at Yuga Labs tweeted that the holder had “effectively given up” the license to the myriad benefits and perks tied to Bored Ape NFT ownership.\n\nThe Ordinals protocol, launched in January, creates a way for people to “inscribe” digital media like artwork, PFPs, and even functional apps and games to the Bitcoin blockchain. Each “digital artifact” is inscribed to a single satoshi, which is 1/100,000,000 of a full Bitcoin.\n\nMore than 10 million inscriptions have been made to date, with that milestone reached on Monday. The month began with just 3 million total inscriptions, and the latest surge has been fueled primarily by the rise of the BRC-20 standard, which uses Ordinals inscriptions to let users mint fungible tokens on Bitcoin—such as meme tokens."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vd3d3LmxlZGdlci5jb20vYWNhZGVteS90b3BpY3MvYmxvY2tjaGFpbi93aGF0LWlzLWFyYml0cnVt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 May 2023 07:00:00 GMT",
        "title": "What Is Arbitrum (ARB)? - Ledger",
        "content": "What Is Arbitrum (ARB)?\n\nBy Lipsa Das\n\nRead 9 min Medium\n\nSHARE\n\nKEY TAKEAWAYS: — Layer 2 solutions like Arbitrum offer faster and cheaper transactions to solve Ethereum’s scaling problem.\n\n\n\n— Arbitrum uses the optimistic rollup technology to batch transactions, execute them off the main Ethereum chain, and store the confirmation on the main chain.\n\n\n\n— Compared to other Layer 2 solutions like zkSync, it offers a more established ecosystem of dApps and complex smart contracts due to its Virtual Machine.\n\nWhile the Ethereum network is the smart contract network of choice for many, it can be slow and expensive at specific times and for certain uses. In cases of high activity, the limitations of Ethereum become apparent, with transactions getting stuck and news headlines featuring 3-figure gas fees. Furthermore, when attempting to solve the problem of scalability, a blockchain’s decentralization and security are impacted too. This is what’s known as the “blockchain trilemma”.\n\nLayer 2 scaling solutions are the solution to this problem. Without getting too technical, layer two solutions offer ways to use Layer 1 blockchains in a way the mainnet’s technology would not allow. Basically, they help users enjoy the security of Ethereum without paying an arm and a leg to use it. One such solution is Arbitrum.\n\nIn this article, Ledger Academy will unpack what Arbitrum is: From its ARB token and how it works to how it differs from their Layer 2 solutions like Optimism. Let’s get started.\n\nWhat Is Arbitrum?\n\nArbitrum is a Layer 2 scaling solution for the Ethereum blockchain that powers fast smart contract transactions while reducing transaction costs.\n\nLayer 2 solutions can scale the base Layer 1 blockchain by delegating complex computational tasks, such as transaction processing and data storage to the second chain. In short, the Layer 2 blockchain executes the smart contract, and the Layer 1 blockchain stores the data. If you want to know more about how the mainnet works, check out our article on what is Ethereum.\n\nIn the context of Ethereum, Arbitrum handles blockchain transaction processing and batching, reducing congestion and cost from the main network.\n\nFor instance, DeFi projects like Sushiswap and Aave use Arbitrum in the hood to offer efficient swaps with lower gas fees.\n\nHow Does Arbitrum Work?\n\nAbritrum’s Layer 2 solution uses blockchain rollups to achieve efficient transaction processing. Rollups use a 2-layer architecture to process transactions off-chain before settling them on-chain. The benefit is that the blockchain no longer needs to validate separate transactions – it can directly confirm a “rolled up” batch of transactions.\n\nThis scaling solution differs from other Layer 2s, such as sidechains, since rollups typically derive their security from the main blockchain.\n\nArbitrum’s scaling solution uses a particular type of roll-up called optimistic rollups.\n\nWhat Is an Optimistic Rollup?\n\nOptimistic rollups process transactions off-chain like other roll-ups but add compression techniques while bundling the transactions. This compression helps reduce gas fees and optimizes block space, by storing only necessary data on the Ethereum blockchain. Thus, optimistic rollups allow the main chain to process more transactions while requiring less space.\n\nOptimistic rollups rely on an optimistic assumption that most transactions are valid. They only execute a costly verification process when there is a dispute. Network participants can raise disputes for faulty blocks in a week. If any faulty blocks are present, the validator that approved them loses their collateral. However, this complex fraud detection process also means processing withdrawals from the chain needs a week.\n\nArbitrum Ecosystem’s Features\n\nAccording to the 2023 Developer Report, the Arbitrum chain is one of the fastest-growing Layer 2 solutions, with over 50% YoY growth in developer headcount. Due to this exponential growth in development, the Arbitrum ecosystem now comprises many different elements. Let’s look at the major products — Arbitrum, Nitro, and Nova — and how they differ.\n\nWhat is Arbitrum One?\n\nLaunched on August 31st, 2021, Arbitrum One is the official mainnet of the Arbitrum crypto ecosystem. It powers the entire ecosystem and processes transactions on the Arbitrum Virtual Machine (AVM), an extension compatible with the Ethereum Virtual Machine (EVM).\n\nThe team behind Arbitrum, Offchain Labs, is a New-York based Ethereum startup, co-founded in 2018. To further it;s growth, it secured $120 million in a Series B funding round in September 2021. Some of their notable investors include Alameda Research, Pantera Capital, and Lightspeed Venture Partners.\n\nWhat Is Arbitrum Nitro?\n\nArbitrum Nitro is a major technical upgrade to the underlying tech of Arbitrum One’s ecosystem. With Nitro, it becomes faster, more EVM-compatible, and cheaper. Nitro achieves this by introducing interactive proofs that run over the WASM code used by Arbitrum.\n\nWith Nitro, developers can also use standardized EVM-compatible languages and run unmodified EVM contracts. This has opened up the development scope on it and attracted more developers.\n\nArbitrum One officially migrated to Nitro on August 31st 2022, one year after its public launch.\n\nWhat Is Arbitrum Nova?\n\nArbitrum Nova is a new chain focusing on reducing individual transaction costs by reducing the data storage on the Ethereum blockchain. Transaction data is available with third parties on the “data availability committee” — a handful of storage providers such as Infura and Google Cloud.\n\nIn contrast to Arbitrum One, which stores full transaction data on Ethereum, Nova only uses Ethereum to store data signatures from these companies. This, of course, makes Nova more centralized. Thus, Nova sacrifices some of the security of the Ethereum blockchain to reduce transaction fees and increase scalability.\n\nArbitrum Nova is especially useful for games and social dApps with higher volume of transactions but low individual transaction value. One example is Reddit’s community points program which uses Nova to reward community participation.\n\nArbitrum Token: What is ARB?\n\nThe Arbitrum token, $ARB, is the native ERC-20 compatible governance token for the Arbitrum blockchain. You can use $ARB to transfer value, as an investment, or to vote on governance decisions.\n\nOne of the most anticipated airdrops of 2023, $ARB had strict eligibility criteria to qualify “active” users. You had to fulfill at least 3 of these 6 conditions to claim $ARB ERC token:\n\nBridge assets to either Arbitrum One or Nova Perform transactions on Arbitrum regularly at least two months before the snapshot in February 2023 Interact with at least 4 Arbitrum smart contracts or perform 4 transactions on the network Overall transaction value should be least $10,000 Deposit a minimum of $10,000 on Arbitrum One Use the social chain, Arbitrum Nova for at least 3 transactions\n\nTo find out more about airdrops, check out the Ledger Academy article on what is an airdrop.\n\nARB Tokenomics\n\nThe initial supply for the $ARB launch is 10 billion, with a 2% yearly inflation rate. In March 2023, 12.75% of this total supply was split between eligible users and DAOs. This equates to a rough circulating supply of about 1.275 billion $ARB.\n\nHere’s the complete breakdown of the current token allocation for $ARB:\n\nInvestors receive 17.53%\n\nDAOs in the Arbitrum Ecosystem receive 1.13%\n\nIndividual Wallets receive 11.62%\n\nDAO Treasury receives 42.78%\n\nTeam and Future Team + Advisors receive 26.94%.\n\nNote: The Arbitrum DAO, or the decentralized governance body for it, can change these allocation numbers by voting on them.\n\nToken Utility\n\nApart from being used to transfer value on the Arbitrum blockchain, $ARB token grants you a seat at the governance table of the Arbitrum DAO. The DAO makes crucial decisions on the protocols’ working, such as how they should allocate funds, investments in the ecosystem, and even technical changes.\n\nThe network makes these decisions through proposals on an open forum like Snapshot.org where users can connect their wallets and cast their votes. For instance, treasury proposals outline exactly when and why the team needs the funds and their entire plan. Then, if the proposal passes, on-chain smart contracts automatically execute the necessary transactions.\n\nApart from governance decisions, $ARB holders can also vote on electing members for the Security Council — a 12-member team in charge of the treasury wallet.\n\nHow Does Arbitrum Compare To Other Chains?\n\nThe race to build the best scaling solution for Ethereum is heating up — with Layer 2 solutions like Arbitrum, Optimism, and Metis emerging as top contenders. Although most of these solutions operate with the same goal — reducing transaction fees and times — they accomplish it with different mechanisms. In this section, let’s look at what makes it unique from other solutions.\n\nArbitrum vs. Other Layer 2s: What’s the difference\n\nTwo of the most popular Ethereum layer two scaling solutions so far include optimistic roll-ups and ZK-rollups. Developers and ecosystem projects currently prefer optimistic roll-ups like Arbitrum but ZK-rollups like zkSync are quickly catching up.\n\nArbitrum offers a more established ecosystem of dApps and complex smart contracts due to its Virtual Machine.\n\nOn the other hand, ZK rollups use zero-knowledge cryptographic proofs. With these proofs, you can guarantee the validity of all cryptocurrency transactions without any optimistic assumptions. In other words, the network verifies every block hash to confirm it is right. While the up-front computation is more with zk-rollups, confirmation times are way faster. Popular ZK rollup projects include ZkSync and Starkware.\n\nZkSync offers stronger privacy guarantees and faster withdrawal times. Other zk-rollups like Starkware, have similar benefits, such as ZkSync but differ in proof size, verification or prover time etc.\n\nArbitrum Vs Optimism: What’s the Difference?\n\nWhile Arbitrum and Optimism are optimistic rollups focusing on finding faulty blocks, they implement the technology slightly differently. Optimistic rollups mainly depend on the Ethereum chain for security while Arbitrum has its own. It has its own Virtual Machine, while Optimism uses Ethereum’s Virtual Machine partly.\n\nAnother key difference is that Optimism relies on a single “fraud proof” which makes it fast but can be easier to fake. Arbitrum, on the other hand, requires multiple proofs to confirm valid transactions.\n\nHow To Use Arbitrum Network Securely\n\nNow, you can safely send and recieve ARB directly through Ledger Live. This makes transferring your ARB assets easy and secure.\n\nHowever, to use many apps in Arbitrum’s ecosystem, you’ll need to connect via a third-party wallet such as Metamask. For the full guide, read this support article on how to use Arbitrum One via a Ledger. But these are the steps in shorthand:\n\nIf you don’t have a wallet, install Metamask to your browser and create a new wallet. Connect your physical Ledger wallet to your Metamask account through the “connect hardware wallet option” Make sure you follow the steps correctly, as if you accidentally import your Ledger wallet into metamask, your funds will be at stake. Go to your Ledger wallet on Metamask and click “Add Network” Select Arbitrum One. Approve it and you’re ready to interact with the network!\n\nHowever, before interacting with the network, you might want some ARB.\n\nHow to Buy ARB\n\nBuying ARB on a decentralized exchange is pretty straightforward.\n\nThe first step is to send your $ETH from the Layer 1 blockchain, Ethereum to Arbitrum via a bridge. Once you bridge your assets to it, you can use Sushiswap, an Arbitrum-based exchange, to convert your Ethereum to $ARB via its user-friendly swap interface.\n\nNote: You can technically bridge any cryptocurrency present on the Arbitrum network to buy $ARB, such as $USDC etc, but you’ll still need some $ETH to pay the transaction fees.\n\nHowever, you need to understand that buying new cryptocurrencies like $ARB (well, actually any cryptocurrency) can be volatile.\n\nNew cryptocurrencies typically have fewer backers — which means a single person with a large amount of $ARB can greatly impact the price. Further, newer cryptocurrencies are prone to speculation and uncertainty — causing sudden price changes that can be difficult to predict.\n\nIt’s important to do your research while buying any cryptocurrency — pay close attention to the team’s track record, use cases of the currency, and the risk-to-reward ratio for buying a newer currency.\n\nStaying Secure While Navigating the Arbitrum Network\n\nWhile Layer 2 solutions like Arbitrum are very exciting, remember they are also very new. Bridging from one network to another introduces more blockchain and third-party touchpoints — which hackers can target.\n\nTherefore, it’s a good idea to always add an extra layer of safety for your funds with a hardware wallet like Ledger. Ledger’s devices ensure that your private key is always protected while you explore the exciting world of Layer 2 blockchains.\n\nChoose security, choose Ledger."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vY3J5cHRvd2FsbGV0LmNvbS9hY2FkZW15L2V0aGVyZXVtLXZzLWV0aGVyZXVtLWNsYXNzaWMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 May 2023 07:00:00 GMT",
        "title": "Ethereum vs. Ethereum Classic - CryptoWallet.com",
        "content": "The Ethereum blockchain is the second-largest cryptocurrency worldwide and is home to a diverse collection of dApps, NFTs, and passionate community members. However, many years ago, a major hack resulted in huge controversy within the community. From this controversy, the network split in two, forming two separate chains—Ethereum and Ethereum Classic.\n\nIn this article, we’re going to dive into the history, the controversy, and the fundamental differences between the networks.\n\nEthereum vs. Ethereum Classic\n\nEthereum, a decentralized open-source blockchain platform with smart contract capabilities, is the second-largest cryptocurrency by market capitalization. It is the birthplace of Decentralized Finance (DeFi) and has its own cryptocurrency, Ether (ETH).\n\nConceived by programmer Vitalik Buterin in 2013, Ethereum aimed to create a decentralized and trustless ecosystem that facilitated more than just token trading. With the launch of the Ethereum Virtual Machine (EVM) in 2015 and an Initial Coin Offering that raised $17.3 million, Ethereum became a hugely popular platform due to the ability to run self-executing smart contracts.\n\nSmart contracts enable permissionless transactions, eliminating the need for intermediaries. They facilitate cryptocurrency trading, dApps (Decentralized Applications), and the creation of DAOs (Decentralized Autonomous Organizations).\n\nEther (ETH) serves as the fuel for deploying smart contracts and dApps on Ethereum. Users pay a “gas” fee, determined by network resources and congestion levels. Ethereum also allows for the creation of other tokens, such as ERC-20 tokens adhering to Ethereum’s standards, as well as non-fungible tokens (NFTs) using smart contracts.\n\nEthereum’s innovation fueled the rise of DeFi and the concept of Web 3.0, a decentralized ecosystem free from traditional banking and government regulations. However, in 2016, a DAO called “The DAO” fell victim to a hack of over $60 million. This hack led to the splitting of Ethereum into Ethereum and Ethereum Classic.\n\n2016 Hack\n\nThe DAO was one of the earliest Decentralized Autonomous Organizations founded. It was set up to act as an investor-directed venture capital (VC) fund. The DAO launched a fundraiser to create a decentralized marketplace, one where users could trade anything from houses to cars to services. It garnered a huge amount of hype and raised over $150 million. However, on June 17th, a hacker exploited a security flaw and siphoned 3.6 million ETH (about $60 million at the time) into his own accounts.\n\nThe Ethereum community was shaken badly, and market confidence dipped alongside the price of ETH. Discussions began about the best way to move forward with minimal impact on both the investors and the network while still staying true to the ethos of Web3 and cryptocurrency. Some suggested blacklisting the funds stolen or changing past transactions to return the ethers to the previous owners. Part of their reasoning was that the hack could shake market confidence and that Ethereum could be “too big to fail.”\n\nHowever, other crypto idealists protested, claiming that this ran counter to everything crypto was all about—”code is law”—and to reverse transactions would undermine the entire project and the wider crypto ecosystem. In the end, these two irreconcilable viewpoints resulted in a hard fork.\n\nWhat is a Hard Fork?\n\nA hard fork is a radical and permanent change to the protocol of a blockchain that results in the chain splitting off into two branches. One blockchain continues on with the original rules, while the other adopts a new set of rules and forms a new blockchain. It’s normally the result of a disagreement within the community or the development team. Hard forks are sometimes planned well in advance after long discussions or can happen rapidly due to unexpected events.\n\nEthereum vs. Ethereum Classic Hard Fork\n\nAfter much debate, the Ethereum blockchain underwent a hard fork on July 20th. It essentially rolled back the transaction history to before the hack—returning funds to the original holders. This was extremely contentious as blockchains are meant to be immutable—it shouldn’t be possible to reverse transactions.\n\nThose who refused to support this hard fork formed Ethereum Classic—a blockchain where the hack still happened (although the value was much less). This network was composed of a much smaller community, and the value of the token, ETC, has remained much lower than ETH since its inception.\n\nEthereum vs Ethereum Classic Comparison\n\nWhile the two chains were once the same, they have gone in quite different directions since the hard fork. Ethereum Classic has prioritized immutability and adhering strictly to the original rules. Ethereum, on the other hand, has focused on growth and development with a little bend to the rules when required. The table below shows some of the core differences. We’ll also dive into some of the fundamental differences in how each blockchain operates and the roadmaps they have planned.\n\nEthereum Ethereum Classic Token ETH ETC Supply Unlimited (4.5% max per year) Fixed Supply (230million) Mining Method Proof-of-Stake (PoS) Proof-of-Work (PoW) Immutability Possible to change transactions with a consensus No changes can be made to transactions Governance EIP ECIP Price (May 2023) $1,843.46 $18.24 All-Time High $4,891.70 $176.16\n\nBlockchain Technology and Architecture\n\nBoth Ethereum and Ethereum Classic share a common foundation. They use the Ethereum Virtual Machine (EVM) and are built upon the principles of decentralization, transparency, and immutability. Until recently, they also both used a Proof-of-Work mining method for settling transactions.\n\nHowever, since the fork, Ethereum has undergone significant upgrades and improvements, such as the implementation of Ethereum 2.0 and its transition from Proof-of-Work (PoW) to Proof-of-Stake (PoS). This was done to tackle high gas fees, scalability, and environmental concerns.\n\nEthereum Classic, on the other hand, has stayed true to the original rules and has remained extremely conservative when it comes to implementing any changes. In the eyes of the Ethereum Classic community, the blockchain and code will always be immutable.\n\nSecurity\n\nEthereum has since implemented many new security upgrades and third-party audits to protect the integrity of the network. Ethereum Classic has made concerted efforts; however, as a smaller network with a lower hash rate, it is inherently more vulnerable to network attacks such as a 51% attack.\n\nGovernance\n\nBoth follow a similar governance model where the community discusses and votes on any potential changes and the roadmap. Ethereum uses the Ethereum Improvement Proposal (EIP), while Ethereum Classic uses the Ethereum Classic Improvement Proposal (ECIP) process. Overall, the governance model is the same; however, the Ethereum Classic community tends to be more conservative when it comes to making changes, preferring to uphold the immutability of the blockchain.\n\nCommunity and Use Cases\n\nEthereum has a highly active and vibrant community of developers, investors, and creatives. This active community has propelled Ethereum’s dominance in the blockchain industry, and the ecosystem has a wide array of dApps and projects. Ethereum has seen widespread adoption in various industries, serving as the go-to platform for dApps, decentralized finance, and tokenization of assets. Its flexibility and scalability have enabled the development of innovative solutions across multiple sectors.\n\nIn contrast, Ethereum Classic’s community is smaller, yet it remains dedicated to the original Ethereum vision, attracting those who value the preservation of immutability. With its more limited community, Ethereum Classic finds niche applications and adoption in specific industries or communities that align with its principles.\n\nPrice History and Roadmap\n\nAs a result of the hard fork, investor confidence was mostly restored, and the price of Ethereum (ETH) continued to appreciate over the years reaching a high of $4,891.70. Although the price has reduced considerably following last year’s crash, it has been recovering steadily. Ethereum Classic (ETC) has experienced small spikes but has never come close to the price of ETH. This is partly due to the smaller community and lower adoption rates.\n\nRoadmap\n\nEthereum has always been an ambitious project with an innovative community continually working on improvements and changes. Now that the network has moved to a PoS mining method, the community is focused on further addressing scalability, reducing energy consumption, and improving overall security.\n\nEthereum Classic has a small network and has struggled with broader adoption. However, it continues to attract investors who value its core ideals. While there is no traditional roadmap, changes are discussed by the community. Changes are made slowly and steadily.\n\nEthereum vs Ethereum Classic: Key Takeaways\n\nEthereum and Ethereum Classic represent two distinct philosophical paths stemming from the same foundations. Ethereum has achieved widespread adoption and market success through continuous development and upgrades. It has become a prime example of the potential of DeFi and crypto. Ethereum Classic remains rooted in the original principles of immutability and decentralized governance. It showcases the dedication and ideals of the community members who truly believe that code is law.\n\nWhich network is better ultimately depends on your priorities and ideals. As time goes by, the two chains should evolve even further as the crypto landscape grows and expands."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMDUvMzAveHJwLXRvLWhpdC01LWJlaW5nLXRoZS1vbmx5LWFzc2V0LXRvLXN1cnBhc3MtZXRocy1tYXJrZXQtY2FwL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 May 2023 07:00:00 GMT",
        "title": "XRP to Hit $5 Being the Only Asset to Surpass ETH's Market Cap - The Crypto Basic",
        "content": "XRP could reach a $5 price in the foreseeable future, according to Versluis who highlighted that it is the only asset to have surpassed ETH in market cap.\n\nMason Versluis, notable crypto podcaster and the founder of Gold Squad, remains bullish on XRP. The crypto influencer recently implied that the asset has the potential to hit $5 in the foreseeable future. Versluis’ confidence in this assertion is compounded by the fact that XRP remains the only asset to have ever surpassed Ethereum in terms of market cap.\n\nIn a recent tweet, Versluis acknowledged that it is easy to ridicule crypto proponents who forecast a $5 price target for XRP. This is likely because XRP would need to surge by 900% from its current price in order to hit $5. Some investors may harbor doubts about the asset’s capacity to rally by such an extent.\n\nIt’s easy to laugh at someone when they say $XRP will hit $5. Do NOT underestimate one of the only coins to ever surpass $ETH in market cap ?‍??? — MASON VERSLUIS ?? (@MasonVersluis) May 29, 2023\n\n- Advertisement -\n\nHowever, the crypto influencer emphasized that the community should not underestimate the potential of XRP, as it remains the only asset to have surpassed Ethereum’s market capitalization. This feat is a testament of XRP’s capacity to register astronomical gains. The asset is also known for staging periodic solo rallies.\n\nNotably, XRP has surpassed Ethereum’s market cap on numerous occasions in the past. The first time this happened was on May 8, 2017 when XRP hit a valuation of $8.347 billion with ETH standing at $8.341 billion. This made XRP the second largest crypto asset. The asset achieved this feat two more times in December 2017 and also in September 2018.\n\nIs XRP Undervalued?\n\nPresently, most investors believe XRP is immensely undervalued at its current price. These investors point to the long-standing litigation between Ripple and the US SEC as the major factor behind the pressure on XRP’s price. They assert that an end to the legal dispute would lead to a price surge, with the asset potentially hitting $5.\n\n- Advertisement -\n\nCertain individuals have presented several models for determining XRP’s fair market value, as they believe the asset’s current market price is way below its intrinsic value. As The Crypto Basic recently reported, Matt Hamilton, a former Ripple Director, cast doubts on the latest of these models.\n\nIn January, Versluis also highlighted XRP’s hidden potential due to its utility as an efficient bridge currency for fast and effective cross-border transactions. “XRP solves a MULTI-TRILLION dollar problem,” Versluis said. He noted that the asset should at least be trading at $5.\n\nIt is important to note that several analysts have forecasted a looming XRP pump. Particularly, Egrag, a notable chartist, recently emphasized that the asset’s next trajectory could either take it to $3.3 or $250. Meanwhile, XRP is currently trading for $0.5005, up 3.67% in the past 24 hours."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3RyYW5zZmVyLWV0aGVyZXVtLW5mdHMtdG8tYml0Y29pbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 May 2023 07:00:00 GMT",
        "title": "Transfer Your Ethereum NFTs to Bitcoin With New Token Standard - Blockworks",
        "content": "Bitcoin Ordinals have received fresh utility with the introduction of a new token standard aimed at facilitating the migration of Ethereum-based NFTs onto Bitcoin.\n\nDubbed BRC-721E, the new standard permits the transformation of Ethereum’s ERC-721 NFTs into Ordinals — which allow for text, images and code to be “inscribed” on a single satoshi.\n\nLoading Tweet..\n\nIn other words, users can send their favorite digital collectibles straight to Bitcoin from Ethereum by initiating a bridging contract acting as a single on-chain inscription request.\n\nBRC-721E is a collaboration between NFT collection Milady Maker and Ordinals Market — a marketplace dedicated to the buying and selling of Ordinals.\n\nThe process involves transferring a user’s NFT to a burn address, effectively rendering their NFT unusable on Ethereum thereafter. Once burned, users can inscribe valid BRC-721E data onto Bitcoin.\n\nThe burn process prompts an on-chain inscription request where Ethereum transaction data is then parsed to find and record any uninscribed burns, according to the marketplace’s webpage.\n\nAfter a successful burn and inscription, the migrated NFT appears on the Ordinals Market collection page with its accompanying metadata.\n\nWhile the BRC-721E standard does not initially store metadata directly on the Bitcoin network, it does have the capacity for this to change and evolve over time, the creators said.\n\nStill, the point regarding the NFTs provenance is an important one. As such, Milady Maker and Ordinals Market offer solutions while the protocol adapts.\n\nAccording to the creators that involves either:\n\nPreserving a less detailed version of the image directly on the blockchain, and incorporating a link to the original Ethereum token within the primary image data\n\nEmploying a combined structure of BRC-721 and BRC-721E to provide on-chain information, complete with evidence of the asset’s ‘burning’ or transfer process\n\nPreserving data with multiple components directly on the blockchain, where one of these components is a valid BRC-721E JSON format data\n\nLeveraging established methods like ‘teleburn’, which requires users to record information beforehand and direct it to an unconventional ‘burn’ address\n\nIn other words, these strategies suggest ways to embed lower-quality images and key information about digital items on Bitcoin’s public ledger, attempting to shore up their accessibility and visibility while preserving a link to their original details.\n\nBRC-721E’s execution follows the launch of the Ordinal Inscriptions protocol on Jan. 21, amid fanfare, that sought to introduce digital art use cases for the first time to the aging Bitcoin network.\n\nThe approach has been well-received so far. Earlier this month, the Bitcoin network hit a record by processing the highest number of transactions in a single day, largely due to Ordinals.\n\nOthers still are attempting to emulate that success across different blockchains.\n\nLast week, the Interchain Foundation in collaboration with blockchain development company Bianjie introduced the ICS-721 NFT token standard on Cosmos. The hope is that the application will enhance interoperability across chains without the need for a bridge.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1zLXNoYW5naGFpLXVwZ3JhZGUtbWFkZS1pdC1lYXNpZXItdG8tZGV0ZWN0LWNyaW1pbmFsc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 May 2023 07:00:00 GMT",
        "title": "Ethereum's Shanghai upgrade made it easier to detect criminals - Cointelegraph",
        "content": "With its historic Merge event in September, Ethereum has become a proof-of-stake blockchain. The mechanism now used to confirm transactions relies on validators staking their Ether (ETH). Ethereum’s March upgrade, codenamed Shanghai, finally enabled stakers to withdraw their locked Ether.\n\nThe Ethereum ecosystem’s “investment themes” have included a) decentralized finance (DeFi) b) stablecoins c) Bitcoin (via wrapped versions of BTC) and d) non-fungible tokens (NFTs). With the upgrade, the network also began providing fixed-income assets.\n\nThere are currently several ways people make money on or using Ethereum. Broadly, they can be grouped into “investment themes,” including: a) decentralized finance (DeFi); b) stablecoins; c) Bitcoin (BTC) (via wrapped versions of BTC); and d) nonfungible tokens (NFTs). Following Shanghai, the network began to offer fixed-income assets.\n\nRisk-free rate\n\nYield is one of the core pillars of traditional finance (TradFi). A rise or fall in yield leads to an increase or decrease in the perceived risk of other financial assets. Thus, movements in the benchmark rate set by the United States Federal Reserve provide the rationale behind investment decisions, in general.\n\nRelated: Ethereum is going to transform investing\n\nAccordingly, compliance professionals use trends in the risk-free rate to detect irrational movement of funds in capital markets, as such fund flows might be attempts to launder money. The reasoning here is that launderers of illicit funds do not actively chase financial gains like regular investors, as the sole purpose of money laundering is to obfuscate the trail of dirty money.\n\nWith Ethereum’s staking yield denoting the “risk-free rate” of the crypto ecosystem, the Shanghai upgrade may have enhanced the state of crypto forensics.\n\nTradFi forensics focuses on activity — crypto forensics focuses on entities\n\nFinancial crime risk in TradFi is managed using automatic systems that alert institutions to probable illicit use of financial assets. While data scientists design and deploy models to raise red flags over suspicious transactions, investigation teams still must assess resultant leads and evaluate if Suspicious Activity Reports (SARs) need to be filed.\n\nAn interesting point of contrast between forensics for TradFi and crypto is that the latter focuses more on the criminal entity than the activity itself. In other words, investigators analyze networks of crypto wallets to identify transfers of criminal assets.\n\nMoney laundering occurs in three stages: a) Placement: proceeds of crime enter the financial system; b) Layering: complex movement of funds to obscure the audit trail and sever the link with the original crime; and c) Integration: criminal proceeds are now fully absorbed into the legal economy and can be used for any purpose.\n\nFor crypto assets, it is convenient to design solutions to detect the placement of illicit assets. This is because most laundered money originates from crypto-native crimes such as ransomware attacks, DeFi bridge hacks, smart contract exploits and phishing schemes. In all such offenses, a perpetrator’s wallet addresses are readily available. Consequently, once a crime has been committed, relevant wallets are monitored to analyze asset flows.\n\nIn contrast, forensic experts working for, say, a bank do not have any visibility into the offense — such as human or drug trafficking, cybercrime or terrorism — when criminal proceeds are being injected into a bank’s ecosystem. This makes detection extremely difficult. Hence, most Anti-Money Laundering (AML) solutions are designed to identify layering.\n\nEthereum’s staking rewards make it easier to detect unusual activity\n\nTo design solutions to detect layering, it is imperative to think like criminals, who craft complex flows of funds to obfuscate the money trail. The time-tested approach to exposing such activity is to spot the irrational movement of assets. This is because money laundering does not have the goal of generating profit.\n\nWith Ether’s post-Shanghai staking yields providing benchmark interest rates for crypto, we can formulate baseline risk-reward structures. Armed with this, investigators can systematically spot financial behavior running counter-intuitive to trends in the benchmark rate.\n\nRelated: Thanks to Ethereum, ‘altcoin’ is no longer a slur\n\nTo illustrate, there might be a pattern where an address or a group of addresses that points toward an entity that consistently takes on high risk while earning below the risk-free rate. A situation like that would almost certainly be investigated at a bank.\n\nCase in point, such a transaction surveillance architecture can be used to detect the wash trading of NFTs. Here, multiple market participants collude to carry out numerous NFT trades with the goal of layering criminal assets or manipulating prices. Since earning profits is not the intention behind the vast bulk of these transactions, such activity will raise a red flag.\n\nSimilarly, in a situation where proceeds of terrorism are being layered via DeFi protocols, detection of irrational asset movements can provide substantial leads to investigators, even without knowledge of the actual crime.\n\nFinancial crime and DeFi\n\nTraditional capital markets are often used to covertly move funds to circumvent sanctions and finance terrorist activity. Analogously, DeFi ecosystems present an attractive target for financial crime due to the ability to move vast sums of assets between jurisdictions using blockchain.\n\nFurther, there has been a significant shift in activity from centralized exchanges to decentralized exchanges due to recent fiascos like the collapse of FTX. This increase in DeFi volumes has made it easier for illegal flows to remain obscure.\n\nEven more compelling is the introduction of better compliance controls by centralized crypto service providers – often mandated by regulators – which are likely driving criminals to seek out new channels for money laundering.\n\nConsequently, illicit flows to DeFi could originate from an expanded set of crimes. This paradigm shift in crypto markets will require forensics teams to increase their capabilities of investigating complex fund flows across diverse protocols without prior knowledge of the source of criminal assets.\n\nAccordingly, compliance efforts need to pivot around the discovery of layering typologies. In fact, with the rapid progress in blockchain interoperability, systematic surveillance to detect criminal transfers has become even more crucial.\n\nOur ability to detect suspicious activity in crypto is less than ideal, partly due to crypto’s extreme price volatility. The volatility renders static risk thresholds ineffective and can enable money laundering to go undetected. In this sense, if and when Ethereum sets a benchmark rate, it will provide a means of establishing baseline rationality for fund flows and thus spotting outliers.\n\nDebanjan Chatterjee has more than 17 years of experience analyzing trends in financial crime using data science, including more than 13 years at HSBC. He holds a master’s in economics from India’s Delhi School of Economics.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vdWsuZmluYW5jZS55YWhvby5jb20vbmV3cy9jcnlwdG8tYml0Y29pbi1ldGhlcmV1bS1wcmljZXMtcmlzZS11cy1kZWJ0LWNlaWxpbmctMDgzMTI1Mzg1Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 May 2023 07:00:00 GMT",
        "title": "Crypto: Bitcoin and ethereum prices rise after US debt ceiling deal announcement - Yahoo Finance UK",
        "content": "Bitcoin rallied as legislation to address the US debt ceiling and avoid a potential default could eliminate a proposed tax on cryptocurrency miners' energy consumption. Photo: Anna Rose Layden/Getty (Anna Rose Layden via Getty Images)\n\nBitcoin (BTC-USD) neared the $28,000 mark on Tuesday, rallying on news that a proposed 30% tax on crypto mining in the US could be shelved as part of a bipartisan debt ceiling deal.\n\nBitcoin was trading at $27,810 (£22,175) on Tuesday, up 1.8%.\n\nThe global cryptocurrency market cap stood at $1.21tn, down 0.5%, according to Coingecko data.\n\nSince November 2022, bitcoin reserves have on cryptocurrency exchanges have decreased steadily, suggesting a drying up of supply.\n\nRead more: Crypto live prices\n\nAnalysts who adhere to the four-year cycle theory suggest that this is part of the pre-halving accumulation period for bitcoin and the crypto market.\n\nADVERTISEMENT\n\nEthereum (ETH-USD) stood at £1,902, a rise of 2.5%.\n\nEthereum balances on exchanges have also fallen to 17.8 million ETH — a five-year low.\n\nThe supply of Ethereum has seen a decrease of more than 80,000 ETH since the \"Merge\" update, which has set the annual deflation rate at 0.11%.\n\nCrypto mining tax could be averted in proposed US debt ceiling deal\n\nLegislation to address the US debt ceiling and avoid a potential default could eliminate a proposed tax on cryptocurrency miners' energy consumption.\n\nA draft bill, issued by US lawmakers on Sunday, proposed a two-year debt ceiling suspension, without including president Biden's desired tax hikes for corporations and wealthy individuals.\n\nThis draft reportedly blocks \"proposed taxes,\" such as a 30% tax on electricity used by crypto miners from Biden's FY2024 budget.\n\nRead more: AI film apps could see 'blockbusters created in bedrooms by end of the year', claims web3 adviser\n\nDespite the tentative agreement serving as a compromise to avoid a debt default, the bill still requires approval from a divided House of Representatives, with the vote expected on Wednesday 31 May, ahead of a potential June default deadline.\n\nAsset managers increase their bitcoin long positions\n\nA Commitment of Traders (COT) report indicates that asset managers have halted their two-week reduction in bitcoin open long positions, instead adding 24 contracts.\n\nStory continues\n\nAdding to the bullish signals, the report showed that asset managers have also lowered their bitcoin short positions by 194 contracts.\n\nWatch: Japan vies to be 'number one again through web3 innovation' | The Crypto Mile\n\nDownload the Yahoo Finance app, available for Apple and Android."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMimgFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3RvcC0zLXByaWNlLXByZWRpY3Rpb24tYml0Y29pbi1ldGhlcmV1bS1yaXBwbGUteHJwLWJlY29tZXMtYW4tb3V0bGllci1hcy1vdXRsb29rLXR1cm5zLWJ1bGxpc2gtMjAyMzA1MjkwNjU10gGeAWh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9hbXAvY3J5cHRvY3VycmVuY2llcy9uZXdzL3RvcC0zLXByaWNlLXByZWRpY3Rpb24tYml0Y29pbi1ldGhlcmV1bS1yaXBwbGUteHJwLWJlY29tZXMtYW4tb3V0bGllci1hcy1vdXRsb29rLXR1cm5zLWJ1bGxpc2gtMjAyMzA1MjkwNjU1?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 May 2023 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: XRP becomes an outlier as outlook turns bullish - FXStreet",
        "content": "Share:\n\nBitcoin price shows a classic Power of Three (PO3) setup in play, forecasting a potential decline to $25,296.\n\nEthereum price could attempt a rally to $2,028 if the bullish outlook persists.\n\nRipple price has set up an inverse head-and-shoulders setup, forecasting a 10.76% increase to $0.515.\n\nBitcoin (BTC) price has surprised investors with a quick uptick over the weekend, but it is unclear if this is a spurt in buying pressure or a reentry of sidelined buyers. Judging by the price action, the cause of the uptick is unclear and the bearish outlook explained in previous articles is still valid.\n\nAlso read: Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC set to punish greedy bulls\n\nBitcoin price ready to collapse\n\nBitcoin (BTC) price breached its two-week consolidation on May 28 and collected the buy-stop liquidity resting above May 10 swing high at $28,293. This liquidity run was soon followed by a retracement, which is underway and signals a Power of Three (PO3) setup in play.\n\nThis technical formation has three phases – accumulation, manipulation and distribution. As the name indicates, the asset usually moves sideways in the first phase and is often followed by a sweep of a critical level, which is termed manipulation.\n\nThe third or the last phase is distribution, which leads to volatile rallies in the opposite direction of manipulation. In Bitcoin’s case, BTC swept a local top at $28,293 and is trading at $27,879, signaling the next move should favor bears.\n\nIf this setup plays out, Bitcoin price could reach the $25,764 support level to collect the sell-stop liquidity. Should the selling pressure persist even after this 7.6% decline, BTC price could hit the next critical support level at $25,296.\n\nThese levels are key accumulation levels, as seen in previous articles.\n\nRead more: Bitcoin Weekly Forecast: BTC delays inevitable crash to $25,000\n\nBTC/USD 4-hour chart\n\nOn the other hand, if Bitcoin price continues to tread above the $28,051 level, it could attempt an extension of this weekend's rally. If the move leads to a flip of the $30,000 psychological level, it would invalidate the bearish thesis.\n\nIn such a case, BTC could attempt a retest of the $32,450 hurdle.\n\nEthereum price needs to stay above this level\n\nEthereum price has overcome the $1,817 hurdle and shot up 7% over the weekend. ETH trades at $1,898 at the time of writing but it needs to hold above the $1,853 support level to resume its uptrend.\n\nIf successful, ETH could eye a retest of the $2,028 hurdle followed by a sweep of the April 16 high at $2,147.\n\nETH/USD 1-day chart\n\nOn the contrary, if Ethereum price breaches the $1,853 support level, investors should pay attention to $1,817. If this level fails to hold, ETH will invalidate the bullish thesis and could trigger a correction to $1,703.\n\nRipple price flips bullish amid confusing times\n\nRipple price has set up an inverse head-and-shoulders set up on the four-hour chart. This technical formation contains three swing lows, with the central one lower than the other two. The ones on each side are defined as the shoulders, while the central one is the head. Connecting the peaks using a trend line reveals a declining resistance level known as the neckline.\n\nThis setup forecasts a 10.76% upswing to $0.515, determined by measuring the distance between the right shoulder’s peak and the head’s lowest point, adding it to the breakout point at $0.465 (see chart below).\n\nSo far, Ripple price has not only breached the neckline but has also rallied nearly 4%, currently trading at $0.481. If the bullish trend continues, XRP price could rally another 7.30% before it hits the theoretical target.\n\nXRP/USD 4-hour chart\n\nInvalidation of the inverse head-and-shoulders setup will occur if Ripple price slices the neckline at $0.465. If this bearish outlook continues, XRP price could slide towards the May 24 low at $0.442."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9oeWJyaWQtcm9sbHVwcy10aGUtc2lsdmVyLWJ1bGxldC1mb3Itc2NhbGFiaWxpdHktYW5kLXNlY3VyaXR5LW9uLWV0aGVyZXVt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 May 2023 07:00:00 GMT",
        "title": "Hybrid rollups: The silver bullet for scalability and security on Ethereum - Cointelegraph",
        "content": "Graphic designers have an old saying: “Your project can be fast, cheap or good — pick two.” It’s a classic trilemma. Rushing to create something might mean it’ll be delivered quickly, and therefore less expensive. Then again, the end product could be disappointing. If customers go the “cheap and good” route instead, they’re willing to wait a while — it’s going to take time, and projects that pay better will be prioritized.\n\nFor years, there’s also been a lot of talk in the blockchain world about a trilemma in terms of decentralization, security and scalability: decentralized networks can only provide two of the three benefits at any given time.\n\nExperts argue that scalability requires a trade-off with security. In this case, a network can handle more transactions, but the risk of an exploit increases.\n\nBut this doesn’t necessarily have to be the case. Right now, developers are working on layer-2 solutions to help increase the capacity of the Ethereum network following its ambitious upgrade to a proof-of-stake (PoS) consensus mechanism.\n\nIntroducing hybrid rollups\n\nThere is one solution allowing developers to build decentralized applications (DApps) — and this is hybrid rollups, which combine two different architectures and can cope with high levels of traffic, making Ethereum a compelling blockchain for building the next generation of the internet.\n\nThe first element involves optimistic rollups, where transactions are processed off-chain to reduce network congestion and cut gas costs — another key hurdle on the road to adoption. According to the developers, this has the potential to increase scalability by up to 100 times, while records are then updated on the mainnet.\n\nThe second ingredient is zero-knowledge rollups, which provide security and fast finality. This technology can reduce the time it takes to complete transactions from seven days to as little as four hours — all without the need for additional data processing. In the real world, this is the equivalent of packing more clothes in a suitcase. Even better, trustless cryptographic mechanisms ensure the blockchain is resilient against exploits.\n\nBringing both types of rollups together makes sense, as each of these architectures has its limitations. A hybrid approach takes advantage of both, while providing the best possible experience for users and developers alike.\n\nOther advantages\n\nHybrid rollups are the brainchild of Metis, an Ethereum-based layer-2 solution provider. According to the project, the benefits don’t end there.\n\nSource: Metis\n\nFull compatibility with the Ethereum Virtual Machine (EVM) means developers get an easy-to-code-in blockchain. There are also benefits for users, especially considering they have the freedom to withdraw funds from layer-2 protocols without delay.\n\nWhile there have long been concerns about the creeping tide of centralization, Metis says its model encourages decentralization, with transactions processed in parallel.\n\nThe team behind Metis shared:\n\n“One of our goals is to solve the scalability trilemma by combining the transcendent scalability of optimistic rollups with the security and fast finality of zero-knowledge rollups. Thus, we create a developer-friendly layer-2 allowing Ethereum developers to deploy all kinds of decentralized applications. The deeper Web3 dives into DeFi, the deeper builders must go to enable the highest security standards possible — and zero-knowledge proofs will do precisely that.”\n\nMetis says it’s determined to increase the potential use cases for blockchain technology, and reducing finality times is key. Optimistic rollups derive their name from the fact that it’s assumed that all transactions are valid, with a seven-day window in place to prevent fraud. Meanwhile, zero-knowledge proofs significantly reduce this time and could be the silver bullet for enticing businesses to join the Web3 revolution.\n\nWhy this technology is needed\n\nScalability concerns on the Ethereum network have been long documented and affect gas fees. Vitalik Buterin himself has admitted that costs need to come down for crypto transactions to be economically viable for consumers in emerging economies.\n\nInnovation is key to bridging the gap between scalability and security and delivering long-term growth for this thriving sector. A robust blockchain that can process transactions quickly and cheaply has the potential to transform businesses around the world and‌ lead to the creation of a new wave of decentralized autonomous companies (DACs), where a corporation can be self-governed and controlled by shareholders through democratic votes.\n\nMetis’ argument is crystal clear: The Ethereum blockchain can be fast, cheap and good, and hybrid rollups — which are being built right now and open-sourced for the benefit of all crypto users — are set to make this a reality.\n\nLearn more about Metis"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW9yZGluYWxzLXRvLWJyaWRnZS1ldGhlcmV1bS1uZnQtd2l0aC1uZXctc3RhbmRhcmTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 May 2023 07:00:00 GMT",
        "title": "Bitcoin Ordinals to bridge Ethereum NFTs with the launch of BRC-721E - Cointelegraph",
        "content": "Bitcoin Ordinals are the latest layer-2 solution enabling decentralized storage of digital art on the Bitcoin blockchain. Ordinals will now allow users to migrate their Ethereum ERC-721-based nonfungible tokens (NFTs) to the Bitcoin blockchain with the launch of the BRC-721E standard.\n\nThe BRC-721E standard was jointly launched by the Ordinals market — an Ordinals-based marketplace — and the Bitcoin Miladys NFT collection. The new BRC-721E standard enables the conversion of immutable, verifiable ERC-721 NFTs to Ordinals. Initially, metadata is not stored on-chain, but users can store a lower-quality preview image and include a reference to the Ether (ETH) burn in the raw image data.\n\nThe migration process starts by burning the ERC-721 NFT with an ETH call function. The burning of the NFT is an irreversible process and acts as an on-chain inscription method. To claim the ETH burn on Bitcoin, the user must inscribe valid BRC-721E data, after which the bridged NFT will appear on a custom Ordinals market collection page with complete metadata.\n\nThe indexers that check the burned NFT data inscriptions ensure that a token has no more than one valid inscription and that the genesis address matches the burn transaction call data.\n\nRelated: Bitcoin Ordinals surpass 10M inscriptions as creator Rodarmor steps down\n\nThe Ordinals market claimed the fundamental principles of BRC-721E and the flexibility of the indexers allow for the protocol to evolve over time, despite the fact that metadata is initially not stored on-chain.\n\nBitcoin Ordinals has attracted widespread reaction from the crypto community since its launch in January 2023. The launch of the BRC-20 token standard in March created an experimental fungible token standard designed specifically for the Bitcoin blockchain. The combination of BRC-20 with Ordinals opened new gates for minting tokens on the Bitcoin blockchain, with the crypto community seeing the emergence of many popular BRC-20 tokens, such as Ordinals (ORDI), Vmpx (VMPX) and Pepecoin (PEPE).\n\nThe number of BRC-20 tokens has skyrocketed from a few hundred in its first week to over 25,000 at the time of publication. However, the rise of Ordinals and the new token minting era has not been unanimously well-received, with many Bitcoin (BTC) proponents criticizing the new method as inefficient and wasteful.\n\nMagazine: $3.4B of Bitcoin in a popcorn tin — The Silk Road hacker’s story"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZGFpbHljb2luLmNvbS9iaXRjb2luLW9yZGluYWxzLXRocmVhdGVuLWV0aGVyZXVtLW5mdHMtd2l0aC1uZXctYnJjLTcyMWUtc3RhbmRhcmQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 May 2023 07:00:00 GMT",
        "title": "Bitcoin Ordinals Threaten Ethereum NFTs with New BRC-721E Standard - DailyCoin",
        "content": "As Bitcoin Ordinals are gaining traction, developers created the BRC-721E standard.\n\nEthereum’s NFT dominance may come into question.\n\nOwners of individual high-profile NFTs already migrated to Bitcoin.\n\nAs Bitcoin Ordinals gain traction, a new development puts Ethereum’s NFT market squarely in its sights. A new protocol allows users to transfer Ethereum NFTs to Bitcoin’s Network.\n\nOn Monday, May 29, the Ordinals market and the Bitcoin Miladys NFT project jointly launched the BRC-721E standard. The technology enables the conversion of ERC-721 NFTs to Bitcoin Ordinals.\n\nA Potential Shift in NFT Dominance\n\nThe advent of Bitcoin Ordinals and the BRC-721E standard could signal a seismic shift in the NFT landscape. So far, Ethereum has been the go-to platform for NFTs, but if high-profile NFT collections move to Bitcoin, Ethereum’s dominance could be in jeopardy.\n\nFor instance, in February 2023, one Bored Ape (BAYC) owner burned his Ethereum-based Ape to transfer it to Bitcoin’s network. Specifically, the BAYC owner called Bitcoin “the world’s scarcest and most secure chain” and said it brought true scarcity to NFTs.\n\nThe NFT community is moving to BTC, where Ordinals have brought true scarcity to collectibles.\n\n\n\nI forever inscribed “The Blonde Don” BAYC #1626 on the world's scarcest and most secure chain burning him off ETH forever using TeleBurn.\n\n\n\nIt's done. Over. Not coming back to ETH. pic.twitter.com/jmKpSSPybm — Jason A. Williams (@GoingParabolic) February 12, 2023\n\nIf more Ethereum NFT owners move to Bitcoin, this will make Bitcoin a more attractive platform for creating new NFTs, threatening Ethereum’s position in the market.\n\nWhat Is BRC-721E?\n\nThe BRC-721E standard is a protocol for creating non-fungible tokens (NFTs), known as Ordinals, on the Bitcoin blockchain. The protocol allows users to convert their Ethereum-based ERC-721 NFTs into Bitcoin Ordinals.\n\nThe process involves sending ERC-721 NFTs to a burn address, which remains inaccessible. The users must then pay the gas fees to inscribe the NFT onto the Bitcoin blockchain.\n\nInitially, the BRC-721E standard doesn’t store metadata directly on the Bitcoin blockchain. Instead, users can store a lower-resolution preview image on-chain and include a reference to the original Ethereum NFT.\n\nThis approach represents a potential game-changer for the NFT space, enabling assets to transition between Ethereum and Bitcoin while maintaining their unique properties and provenance.\n\nOn the Flipside\n\nWhile the BRC-721E standard is an exciting development for Bitcoin, it is still in its early stages. The long-term feasibility of extensive NFT operations on Bitcoin remains to be tested.\n\nOrdinals have already led to a major spike in fees on the Bitcoin Network. This fact highlights potentially insurmountable scalability issues for the Bitcoin blockchain.\n\nWhy This Matters\n\nThe BRC-721E standard signifies an exciting development for Bitcoin’s NFT landscape. However, it also raises serious concerns about the scalability of the network.\n\nRead about the BAYC holder moving his Ape to Bitcoin’s blockchain:\n\nBored Ape (BAYC) Holder Tries Out Bitcoin NFTs, Burns BAYC 1626 in the Process\n\nRead more about Bitcoin ordinals:\n\nBitcoin NFTs: What Makes BTC JPEGs so Extra-Ordinal?"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vYW1iY3J5cHRvLmNvbS90cm9uLWNhbi1lYXNpbHktb3ZlcnRha2UtZXRoZXJldW0tYnV0LWZvci_SAURodHRwczovL2FtYmNyeXB0by5jb20vdHJvbi1jYW4tZWFzaWx5LW92ZXJ0YWtlLWV0aGVyZXVtLWJ1dC1mb3IvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 May 2023 07:00:00 GMT",
        "title": "Tron can easily overtake Ethereum, but for… - AMBCrypto News",
        "content": "Tron’s TVL increased by 1.5% in the last 24 hours.\n\nTRX’s RSI was overbought, and several indicators were bearish.\n\nTron [TRX] outperformed the rest of the crypto market in terms of revenue generated. Token Terminal’s 28 May tweet revealed that Tron was only behind Ethereum [ETH] on the list of blockchains by revenue in the last seven days.\n\nprotocols that made the most money over the past 7 days: pic.twitter.com/8ZNfDOYDXc — Token Terminal (@tokenterminal) May 28, 2023\n\nWhile Tron grabbed the second spot, Lido [LDO] sat in the third position. Though this looked encouraging, investors might have reasons for concern, as a few metrics suggested that TRX’s price pump could soon come to a halt.\n\nWhat caused the rise\n\nA few on-chain metrics revealed the reason behind Tron’s meteoric rise. Notably, as per Artemis’ data, TRX’s daily active addresses spiked and reached 2.3 million earlier in May.\n\nThe network’s daily transactions also surpassed 9.6 million in the same time frame.\n\nInvestors seemed to have been actively trading the token, as its DEX volume also registered an uptick. Additionally, TRONSCAN’s data revealed that TRX’s total addresses crossed 162 million, reflecting increased adoption of the blockchain across the globe.\n\nApart from these, another positive update was related to Tron’s DeFi performance. DeFiLlama’s data revealed that TRX’s TVL had increased by more than 1.5% in the last 24 hours.\n\nMarket sentiment was unaffected\n\nThough the aforementioned metrics looked promising, they could not turn market sentiment in TRX’s favor. The last week witnessed a massive decline in TRX’s weighted sentiment. Similarly, the token’s popularity registered a decline, as evident from its social volume.\n\nTron investors have concerns\n\nTron’s price was not volatile last week, as it only moved marginally. According to CoinMarketCap, TRX’s price moved in less than single digits both during the last seven days and the last 24 hours. At the time of writing, it was trading at $0.07766 with a market capitalization of over $7 billion.\n\nBut the days might get colder, as a few datasets were bearish. CryptoQuant’s data revealed that at press time, TRX’s Relative Strength Index (RSI) was in an overbought position, thus increasing selling pressure.\n\nRead Tron’s [TRX] Price Prediction 2023-24\n\nShould investors expect a price dip?\n\nAs per TRX’s daily chart, its Chaikin Money Flow (CMF) had registered a downtick. Though the bulls were still ahead, the MACD displayed the possibility of a bearish crossover soon.\n\nTron’s Money Flow Index (MFI) was also resting right near the overbought zone, which further suggested a price correction. Nonetheless, the Exponential Moving Average (EMA) Ribbon continued to support the bulls."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2RvZ2Vjb2luLXRyYW5zYWN0aW9uLXZvbHVtZS1mbGlwcy1ldGhlcmV1bS10aGFua3MtdG8tZHJjLTIwLXRva2Vucy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 May 2023 07:00:00 GMT",
        "title": "Dogecoin transaction volume flips Ethereum amid DRC-20 token fever - CryptoSlate",
        "content": "Dogecoin (DOGE) recorded a significant surge in its network activity over the last two days, processing more than 4 million transactions between May 27 and 28, according to BitInfoCharts.\n\nThe increase surpassed the number of transactions processed by its more storied rivals like Ethereum (ETH) and Bitcoin (BTC). ETH recorded 1.9 million transactions during the reporting period, while BTC saw less than 1 million transactions.\n\nThe data shows that the trend has been consistent for the last seven days. Between May 22 and 28, Dogecoin completed over 9 million transactions, while the Ethereum network recorded around 6 million transactions. Bitcoin completed 3.3 million transactions during the same period.\n\nDogecoin’s network activity surge driven by DRC-20 tokens\n\nFollowing the increasing popularity of Bitcoin’s BRC-20 tokens, DOGE enthusiasts implemented a similar model, namely DRC-20 tokens, which contributed to the surge in Dogecoin’s transaction volume.\n\nThe DRC-20 model facilitates the creation and trading of tokens on the Dogecoin blockchain, similar to how ERC-20 tokens function on the Ethereum network but using the BRC-20 standard as inspiration.\n\nThe hype surrounding these new assets has led to the proliferation of these tokens within the crypto community. A Dogecoin enthusiast, Mishaboar said:\n\n“DRC20 tokens are minted on the Dogecoin chain because of the low fees, and for a kind of “fetish” of minting meme tokens on top of the meme coin blockchain that started it all.”\n\nThe increasing network activity has raised concerns among some community members, who argue that it could lead to network congestion and negatively impact Dogecoin’s primary goal of providing an efficient, low-cost, and accessible means of everyday transactions.\n\nDOGE’s climbing hashrate\n\nMeanwhile, Dogecoin’s rising transaction volume coincided with a period of increasing hashrate — up 38% in May.\n\nAccording to Minerstat data, Dogecoin’s hashrate jumped to 934.03 TeraHash per second (TH/s) from 660.61TH/s recorded on May 1.\n\nUsually, an increasing hash rate suggests that the number of miners on a network is rising. It can also measure the strength of blockchain health and security.\n\nDespite the increase in network activity and hashrate, Dogecoin’s price has remained relatively unaffected, with the digital asset experiencing only a 2% gain in the past week and a 10% decrease in the last 30 days. As of the time of writing, Dogecoin trades at $0.0732, according to CryptoSlate’s data."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA1LzMwL3NvbGFuYS1zb2wtcHJpY2Utc2hvdWxkLWJlLWJhcmUtbWluaW11bS0zeC1oaWdoZXItYWNjb3JkaW5nLXRvLWludmVzdGFuc3dlcnMv0gFyaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDUvMzAvc29sYW5hLXNvbC1wcmljZS1zaG91bGQtYmUtYmFyZS1taW5pbXVtLTN4LWhpZ2hlci1hY2NvcmRpbmctdG8taW52ZXN0YW5zd2Vycy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 May 2023 07:00:00 GMT",
        "title": "Solana (SOL) Price Should Be ‘Bare Minimum’ 3x Higher, According to InvestAnswers - The Daily Hodl",
        "content": "A popular crypto analyst thinks that the Ethereum (ETH) competitor Solana (SOL) is dramatically undervalued.\n\nIn a new update, the anonymous host of InvestAnswers tells his 444,000 YouTube subscribers that the number of daily active addresses on Solana rivals that of Ethereum, yet it is currently only worth 1/25th of ETH’s market cap.\n\n“[Solana] does way more transactions. And the people who are active on the chain are a lot more active and the breadth of DApps (decentralized applications) is broader, etc., etc. And this is a crazy thing that’s going on – it’s mind-boggling, but sometimes markets are irrational.”\n\nThe analyst notes that Solana should, at the “bare, bare minimum,” be worth 1/10th the market cap of Ethereum.\n\nEthereum’s market cap hovers around $227.5 billion at time of writing, meaning 1/10th of that would be around $22.75 billion. Solana’s market cap is currently $8.1 billion, meaning reaching 1/10th of Ethereum’s market cap would equate to a nearly 3x jump.\n\nSays the InvestAnswers host,\n\n“It’s hard to say exactly where this can go, because there’s no solid trading pattern between both, because literally, as I mentioned before, SOL has been bleeding against ETH for the last year with the FTX debacle, etc., etc. It’s just been doing badly. And it needs to break out, and that means it needs to get above $30 and then [it’ll be] off to the races.”\n\nSOL is trading at $20.57 at time of writing. The 11th-largest crypto asset by market cap is down more than 1% in the past 24 hours.\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tYmxvY2stc2l6ZS1zdXJnZXMtdG8tMS1tb250aC1oaWdoL9IBVWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tYmxvY2stc2l6ZS1zdXJnZXMtdG8tMS1tb250aC1oaWdoL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 May 2023 07:00:00 GMT",
        "title": "Ethereum’s Block Size Surges To 1-Month High – What This Means For ETH - NewsBTC",
        "content": "Ethereum, the world’s second-largest cryptocurrency by market capitalization, has witnessed a significant surge in its mean block size, reaching a new 1-month high. This milestone was recently announced by Glassnode, a renowned on-chain analysis platform.\n\nThe increase in block size indicates a notable improvement in Ethereum’s network capacity and transaction throughput, potentially bringing positive implications for the ecosystem.\n\nBreaking Down The Block Size Surge\n\nThe mean block size of Ethereum has skyrocketed, surpassing the previous 1-month high recorded on May 27, 2023. Glassnode’s data reveals that the current mean block size stands at 121.4 million.\n\nThis surge highlights a substantial increase in the average data volume accommodated within individual blocks of the Ethereum blockchain.\n\nLarger block size is indicative of Ethereum’s ability to handle more data and transactions per block, effectively enhancing the network’s capacity. With a higher average data volume in recent blocks, ETH showcases its potential for improved scalability and transaction throughput.\n\nEthereum’s surge in block size signifies a positive development for the ETH ecosystem, as it accommodates the growing demands and usage of the network.\n\nWhat This Means For Ethereum\n\nThe surge in Ethereum’s mean block size holds several implications for ETH and its community. Firstly, it signifies the network’s continued growth and adoption. As more participants engage with the Ethereum blockchain, the increased block size demonstrates the platform’s ability to handle a higher volume of transactions, leading to enhanced efficiency and reduced congestion.\n\nMoreover, the surge in block size also contributes to improved transaction throughput. With larger block sizes, more transactions can be included in each block, resulting in faster confirmation times and smoother user experiences.\n\nThis development is crucial for applications built on the Ethereum network, such as decentralized finance (DeFi) protocols, non-fungible token (NFT) marketplaces, and various other decentralized applications (dApps). It enables them to process a greater number of transactions within a given timeframe, fostering better scalability and usability.\n\nAdditionally, Ethereum’s increased block size may have a positive impact on gas fees. Gas fees, which are transaction fees on the Ethereum network, can be influenced by block size. A larger block size allows for the inclusion of more transactions, potentially alleviating congestion and reducing gas fees. This could lead to a more cost-effective and accessible environment for users and developers utilizing the Ethereum ecosystem.\n\nMeanwhile, Ethereum has shown a possible brewing uptick in the past week. The second crypto asset by market capitalization has surged 2.3% in the past week. Over the past 24 hours, ETH has seen a 1.1% gain.\n\nAt the time of writing, Ethereum currently trades at $1,851. Ethereum’s trading volume has, however, ranged between $3 billion and $5 billion in the past seven days indicating a possible accumulation. Regardless, in the past 24 hours, ETH has had a trading volume of $5.5 billion.\n\n-Featured image from Shutterstock, Chart from TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL3d3dy5iZW56aW5nYS5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS8yMy8wNS8zMjYzMTQwMC9pZi15b3UtaW52ZXN0ZWQteW91ci0zLXN0aW11bHVzLWNoZWNrcy1pbi1iaXRjb2luLWRvZ2Vjb2luLWFuZC1ldGhlcmV1bS1oZXJlcy1ob3ctbXVjaC15b3XSAS1odHRwczovL3d3dy5iZW56aW5nYS5jb20vYW1wL2NvbnRlbnQvMzI2MzE0MDA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 May 2023 07:00:00 GMT",
        "title": "If You Invested Your 3 Stimulus Checks In Bitcoin, Dogecoin And Ethereum, Here's How Much You'd Have Now - Benzinga",
        "content": "The COVID-19 pandemic hit businesses and consumers with items like business closings, job cuts and layoffs. The aftershocks continue today, with higher inflation and a tight job market coming on the back end of the pandemic.\n\nThe U.S. government gave out several stimulus payments during the height of COVID to help individuals and families deal with rising costs and job losses.\n\nThose who received the stimulus checks were free to do with the money as they wished, including potentially investing it if they did not need the money for bills or savings.\n\nWhat Happened: In 2020, the Coronavirus Aid, Relief and Economic Act (CARES Act) was signed into law. Under the law, Americans received three rounds of stimulus payments. While some used the money for bills and to boost their savings, others chose to invest in stocks and cryptocurrencies.\n\nThe CARES Act paid out $1,200 to eligible adults and $500 more for those with qualifying children for its first stimulus payment.\n\nThe subsequent Tax Relief Act of 2020 paid out an additional $600 per eligible adult and up to $600 more for those with qualifying children in December 2020. The American Rescue Act of 2021 provided an additional $1,400 payment to eligible adults and up to $1,400 for those with qualifying children.\n\nHere's a look at the return a consumer would have if they put their stimulus checks ($1,200, $600 and $1,400) into leading cryptocurrencies like Bitcoin BTC/USD, Dogecoin DOGE/USD and Ethereum ETH/USD.\n\nThe hypothetical results are based on the dates of April 11, 2020; December 29, 2020; and March 12, 2021 for the stimulus checks.\n\nRelated Link: 2021 Was The Year Of Dogecoin: A Month By Month Retrospective With Top Stories\n\nStimulus Checks in Bitcoin: Investing in Bitcoin with a portion of the stimulus checks may have been a popular option for investors and people looking to store some of the payment away from the U.S. government.\n\nBitcoin traded at $6,926 on April 11, 2020, $27,370 on December 29, 2020 and $57,996 on March 12, 2021. A person who put all $3,200 from the stimulus checks into Bitcoin would have been able to purchase a total of 0.219 BTC.\n\nBased on a price of $27,719.72 for Bitcoin today, that $3,200 would now be worth $6,070.62.\n\nStimulus Checks in Dogecoin: The meme cryptocurrency known as Dogecoin gained interest and value in 2021 thanks to retail investors and vocal public supporters like Mark Cuban and Tesla CEO Elon Musk. Here’s how stimulus checks in Dogecoin would have fared.\n\nDogecoin traded at $0.0020 on April 11, 2020, $0.0046 on December 29, 2020 and $0.0570 on March 12, 2021. A person who put all $3,200 from the stimulus checks into Dogecoin would have been able to purchase 754,996 DOGE. Based on a price of $0.07243 today, that $3,200 would now be worth $56,043.35.\n\nStimulus Checks In Ethereum: One of the fastest-growing cryptocurrencies in 2021 was Ethereum, thanks to its connection to non-fungible tokens. Here’s a look at how stimulus checks invested in the second largest cryptocurrency would have fared.\n\nEthereum traded at $161.17 on April 11, 2020, $737.95 on December 29, 2020 and $1,839.50 on March 12, 2021. A person who put the $3,200 into Ethereum would have been able to purchase 9.02 ETH. Based on a price of $1,905.18 for Ethereum today, that $3,200 investment would now be worth $17,184.72 today.\n\nStimulus Check In All 3 Cryptocurrencies: A more diversified approach from an investor could have seen investments in Bitcoin, Dogecoin and Ethereum. Splitting the $3,200 into equal investments of the three cryptocurrencies on the respective stimulus payout days would have given an investor 0.0731 BTC, 251,665 DOGE and 3 ETH. The three cryptocurrencies would be worth $25,969.95 today based on equal investments from the three stimulus checks.\n\nRead Next: How To Buy Cryptocurrencies\n\nPhoto: Wikimedia Commons, freepngimg.com."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vZGFpbHlwcmljZWFjdGlvbi5jb20vY3J5cHRvL2V0aGVyZXVtLWxpcXVpZGF0aW9ucy1wb2ludC10by1yYW5nZS10cmFkZS1vcHBvcnR1bml0eS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 May 2023 07:00:00 GMT",
        "title": "Ethereum Liquidations Point To Range Trade Opportunity - Daily Price Action",
        "content": "Like Bitcoin, Ethereum had a nice rally over the weekend after reclaiming $1,835.\n\nYou can see where ETH tested that level as support on the 28th before continuing toward $1,887.\n\nYou should be very familiar with these levels if you follow me on Twitter, as I’ve posted them a few times in May.\n\nSo far, Ethereum is holding above $1,887 on a 4-hour closing basis, which exposes the $1,960 resistance area.\n\nThere’s also a large cluster of short liquidations in the $1,960 region.\n\nLiquidation clusters like this often serve as magnets for price.\n\nThat alone could trigger another rally from Ethereum, making the recent consolidation a continuation pattern.\n\nTo be fair, there’s also a decent block of ETH long liquidations at $1,830.\n\nSo really this could go either way, especially as we enter the final 24 hours of the month.\n\nBut the determining factor in whether we see $1,960 or $1,835 first will be the $1,887 level.\n\nAs long as ETH holds above that on a 4-hour closing basis, the next resistance and liquidation pool is $1,960.\n\nConversely, a sustained break on the 4-hour time frame below $1,887 would confirm this consolidation as a deviation and open up $1,835.\n\nEither way, expect erratic price action from the crypto market as we enter the final 24 hours of May."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZGVjcnlwdC5jby8xNDI1MzAvbWVldC1jcnlwdG8tcmljaC13aG8td2FudC1saXZlLWZvcmV2ZXItaW5zaWRlLXZpdGFsaWtzLXp1emFsddIBXWh0dHBzOi8vZGVjcnlwdC5jby8xNDI1MzAvbWVldC1jcnlwdG8tcmljaC13aG8td2FudC1saXZlLWZvcmV2ZXItaW5zaWRlLXZpdGFsaWtzLXp1emFsdT9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 May 2023 07:00:00 GMT",
        "title": "Meet the Crypto Rich Who Want to Live Forever: Inside Vitalik's Zuzalu - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAround 200 key players in the fields of crypto, big pharma, politics, and academia flew home this past weekend after spending upwards of two months at Zuzalu: an experimental “pop-up city community” conceived by Ethereum co-founder Vitalik Buterin.\n\nSince March, Zuzalu attendees (Zuzalans, they call themselves) temporarily abandoned their respective lives and identities to become the first citizens of a new civilization—one founded among the resort hotels and Airbnbs of Lustica Bay, Montenegro, and tasked with envisioning what they consider to be a new future for humanity.\n\nAlong the way, attendees discussed the role of cryptocurrency, blockchain networks, and, of course, AI—all the rage these days in tech circles. But the experience also focused on topics like human longevity and the concept of a \"network state\" popularized by former Coinbase CTO Balaji Srinivasan. (He appeared remotely for a Zuzalu panel discussion that one attending engineer called the \"Doomer presentation.\")\n\nAD\n\nAD\n\nZuzalu was incredible 🙂 I’m gonna miss everyone !! pic.twitter.com/sCZ4Rk7ygk — rodney (@0xRodney) May 25, 2023\n\nThe novel conference has been described by some as a Burning Man for futurists, by others as a sleepaway camp for the crypto elite, and by many attendees as a life-altering experience with historic implications for the biological, political, and social potential of our species.\n\nSo what was it actually like to be there?\n\n“Every single person here believes that they can change the world,” Hannah Hamilton, co-founder of decentralized finance protocol Asymmetry, told Decrypt. “Normally, you meet one person who believes they can change the world—but it's everyone.”\n\nOn Hamilton’s second night at Zuzalu, she was approached at an apartment party by a man who asked her if she thought she could change the arc of human history. That’s typical Zuzalan small talk; a popular icebreaker at the conference is asking an acquaintance at what age they think they’ll die. Answers usually range from 80 to “never.”\n\nAD\n\nAD\n\nHamilton initially scoffed at the man, telling him that no, she didn’t think she could single-handedly change the world. The man informed her that she was wrong.\n\n“You are already,” he told her. Hamilton’s finance protocol is shaping Ethereum, in his view, and Ethereum is itself shaping the world economy and a global decentralized information network. Hamilton now believes she can, and will, have a direct impact on humanity’s fate.\n\n“Zuzalu has changed my life,” she said, “in literally a few days.”\n\nLife at Zuzalu was itself decentralized, with impromptu conversations and breakout seminars planned among participants that drive the conference’s cadence.\n\nThe two primary social hubs for Zuzalan society appear to be breakfast—served every day, vegetarian, at a local Montenegrin restaurant taken over by the event—and the sauna at the Chedi Lustica Bay, the five-star hotel most Zuzalans have called temporary home.\n\nFor a time, the Chedi’s sauna played host to a Zuzalan-organized, philosophy-driven conversation series aptly titled “Sauna Philosophers.” After more than 30 people began showing up for it regularly, Chedi Hotel management requested its immediate discontinuation.\n\n“The hotel staff doesn't like when you have events in the sauna,” developer and entrepreneur Philippe Dumonet, another Zuzalan, told Decrypt.\n\nAD\n\nAD\n\nIf most Zuzalu events were informal to some degree, that also means that any moment, even a house party, was ripe for optimizing human potential. One group of Zuzalans brought a large stack of bolivars—the hyperinflated Venezuelan currency—with them to Montenegro; they then handed out the near-worthless bills as non-fungible, secure invites to a party.\n\nSome laughed off the move as shtick. But when would-be partygoers arrived at the gathering later that night, they were turned away immediately if they could not produce a bolivar, and forced to permanently relinquish their own bolivar if they brought a guest unable to produce a bill themselves.\n\nBolivars soon became a hot commodity among Zuzalans, and ran out shortly thereafter. Their distributors developed an app via which bolivar holders can input their bills’ serial numbers, and create authenticated virtual IDs that could one day (or so their creators hope) be used create a vouching system to grow social groups.\n\nExcept for such instances of exclusivity designed in the name of expanding the human potential for trust, Zuzalu has felt very open and welcoming, according to attendees that Decrypt spoke with. And in such a small pool of people, like-minded Zuzalans have naturally gravitated towards each other.\n\nZuzalu hackathon presentations in progress! Based af award goes to: 153^3, bidirectional vouching to create a web of trust for parties by @ManuAlzuru @adrian_eth @notalddo @d3portillo 🏆 🏆 pic.twitter.com/8UBYTRVmOO — stuti |📍 zuzalu (@stutireal) May 14, 2023\n\nOne such clique that has gained notoriety in Lustica Bay is a group of Zuzalans who are confident that they will achieve immortality. They’ve garnered a reputation on Zuzalu’s Balkan campus for the sheer force of their entrepreneurial confidence in the face of humanity’s greatest design flaw: death.\n\n“That's one of the ones that think they're not gonna die,” Asymmetry’s Hamilton said she and her friends would whisper on the streets of Lustica when such Zuzalans walked by.\n\nAD\n\nAD\n\nBut to many of the minds present at Zuzalu, cheating death is just the next frontier in humanity’s development—and one that could bring its own problems.\n\nFun final parkour class in #zuzalu montenegro! Grateful for a time of well being, productivity, and inspiration@QJ_ECF pic.twitter.com/e3VXLS9CT2 — Noah Chon Lee (@noahchonlee) May 26, 2023\n\nA friend of Hamilton’s expressed to her that some humans achieving immortality will inevitably lead to bitterness and resentment among the mortal underclasses.\n\n“There will be a war against the people that are living forever, and they will all die,” they believe, as relayed by Hamilton.\n\nLuckily, Zuzalu has a backup plan in case of such an event. According to sources that Decrypt spoke with, some Zuzalans think the creation of a nation state reserved exclusively for people who live forever could address security concerns for that rarified population.\n\nBut there’s further concern among Zuzalans that if an immortals-only nation were created, it may then be vulnerable to targeting by a virus engineered to attach itself to medicines essential to the immorality-sustaining process.\n\nStrategies for navigating that particular scenario have not yet been devised. But Zuzalu is expected to return next year."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy50cmFkaW5ndmlldy5jb20vbmV3cy9uZXdzYnRjOmM1NTkzN2IzNjA5NGI6MC1ldGhlcmV1bS1wcmljZS1rZXktaW5kaWNhdG9ycy1zdWdnZXN0LWEtc3RyZW5ndGhlbmluZy1jYXNlLWZvci1zdXJnZS10by0yay_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 May 2023 07:00:00 GMT",
        "title": "Ethereum Price Key Indicators Suggest A Strengthening Case For Surge To $2K - TradingView",
        "content": "Ethereum price corrected gains from the $1,920 resistance against the US Dollar. ETH is currently supported and might soon aim for a move toward $2,000.\n\nEthereum is currently eyeing a fresh increase above the $1,920 resistance zone.\n\nThe price is trading above $1,880 and the 100-hourly Simple Moving Average.\n\nThere is a major bullish trend line forming with support near $1,880 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could gain bullish momentum if it clears the $1,920 resistance.\n\nEthereum Price Remains Supported\n\nEthereum’s price started a decent increase above the $1,800 resistance. ETH even broke the $1,880 level before the bears appeared near $1,920 and pushed the price lower, similar to Bitcoin.\n\nThere was a downside correction below the $1,900 and $1,885 levels. The price spiked below the 50% Fib retracement level of the upward move from the $1,836 swing low to the $1,929 high. However, the bulls were active above the $1,870 level.\n\nThere is also a major bullish trend line forming with support near $1,880 on the hourly chart of ETH/USD. The trend line is close to the 61.8% Fib retracement level of the upward move from the $1,836 swing low to the $1,929 high.\n\nEther is still trading above $1,880 and the 100-hourly Simple Moving Average. Immediate resistance is near the $1,910 zone. The next major resistance is near the $1,920 level. A close above the $1,920 resistance could send Ether toward $2,000.\n\nNewsBTC\n\nSource: ETHUSD on TradingView.com\n\nThe next resistance sits near $2,040, above which Ethereum could gain pace toward $2,120. Any more gains above the $2,120 resistance zone might send the price toward the $2,200 resistance.\n\nMore Losses in ETH?\n\nIf Ethereum fails to clear the $1,920 resistance, it could continue to move down. Initial support on the downside is near the $1,885 level.\n\nThe next major support is near the $1,870 zone or the trend line. If there is a close below the $1,870 support, the price could decline toward the 100 hourly SMA. Any more losses may perhaps send the price toward the $1,815 level in the coming sessions, below which it could test $1,800.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is above the 50 level.\n\nMajor Support Level – $1,870\n\nMajor Resistance Level – $1,920"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGgtaW5jaGVzLXRvd2FyZC1zdHJvbmctY29ycmVsYXRpb24td2l0aC1uYXNkYXEtYXMtdGhlLWFsdGNvaW4v0gFaaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2V0aC1pbmNoZXMtdG93YXJkLXN0cm9uZy1jb3JyZWxhdGlvbi13aXRoLW5hc2RhcS1hcy10aGUtYWx0Y29pbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 May 2023 07:00:00 GMT",
        "title": "ETH, Nasdaq correlation grows closer as the altcoin… - AMBCrypto News",
        "content": "Though the correlation between the traditional entity and ETH remained negative, they closed in on each other.\n\nThe altcoin might maintain its recent recovery.\n\nThe correlation between Ethereum [ETH] and the Nasdaq composite index continues to exit the distant position they have had in recent times.\n\nWith a maximum value of 1, the correlation between entities in the crypto sector, and the traditional counterpart is determined by assessing the price movement and performance over a period of time.\n\nHow much are 1,10,100 ETHs worth today?\n\nTwo on the same path\n\nWhen the correlation coefficient is positive, it means that both assets are moving in a very similar direction. But a close correlation to the negative region indicates that the two assets are moving in opposite directions.\n\nAccording to the IntoTheBlock Capital Markets data, ETH’s 90-day correlation coefficient with Nasdaq was -0.25.\n\nAlthough negative, the data showed that the correlation had improved. Lately, ETH, like Bitcoin [BTC] significantly outperformed the Nasdaq equity index earlier in the year.\n\nWhile the crypto market landscape has changed, the closeness in correspondence could be connected to ETH’s recent performance which has left his 30-day performance in a 0.31% uptick.\n\nBullseye yet?\n\nMeanwhile, ETH’s Market Value to Realized Value (MVRV) ratio has been able to recover from its previous journey into the red zone. At press time, the metric was 4.308%.\n\nThe MVRV ratio serves as a measure of the undervalued or overvalued state of an asset. It also indicates the rate of profits gained by holders.\n\nTherefore, the increase suggested that ETH holders have had some recovery lately, especially with the 3.18% uptick in the last 24 hours.\n\nOn the technical side, the Moving Average Convergence Divergence (MACD) showed that the altcoin could soon overthrow the dominance of sellers.\n\nAt the time of writing, the trend-following momentum indicator revealed that the blue dynamic line had risen above the orange line. A situation like this infers that buyers had gained command of the jurisdiction.\n\nSo, there is a chance that ETH maintains the bullish streak for some time. In terms of the Chaikin Money Flow (CMF), the daily chart showed that the indicator had increased to 0.16.\n\nRealistic or not, here’s ETH’s market cap in BTC terms\n\nThe indicator uses a 21-day period to measure the volume-weighted average accumulation and distribution.\n\nSince the CMF was positive and nearing the closing price, it suggested that more accumulation had taken place. Therefore, there could be more strength backing the ETH uptick."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1hbmQtbGlkby1maW5hbmNlLWxlYWQtaW4tcmV2ZW51ZS1nZW5lcmF0aW9uLWFzLXByaWNlcy_SAVlodHRwczovL2FtYmNyeXB0by5jb20vZXRoZXJldW0tYW5kLWxpZG8tZmluYW5jZS1sZWFkLWluLXJldmVudWUtZ2VuZXJhdGlvbi1hcy1wcmljZXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 May 2023 07:00:00 GMT",
        "title": "Ethereum, Lido Finance lead in revenue generation as prices… - AMBCrypto News",
        "content": "Ethereum and Lido Finance shone as top revenue generators, with Ethereum surpassing $1 billion in revenue.\n\nPositive price trends were observed for Ethereum, while Lido Finance showed signs of weakening bearish trend.\n\nIn the most recent revenue ranking unveiled by Token Terminal, Ethereum [ETH] and Lido Finance [LDO] made their impressive mark as two of the leading revenue generators. Analyzing the data covering the past 30 days, Ethereum triumphed in the top position, accumulating a staggering $374.9 million in revenue. Lido Finance secured the third spot with an impressive revenue of $86.9 million.\n\nRead Ethereum’s [ETH] Price Prediction 2023-24\n\nA look at the cumulative revenue generated over the last 180 days, Ethereum’s dominance was even more evident, as it exceeded the remarkable milestone of $1 billion. While not reaching the same astronomical heights, Lido Finance still showcased a commendable performance. It secured the fifth position with a revenue of approximately $24.9 million.\n\nFurthermore, according to Crypto Fees data, Ethereum’s success extended beyond revenue figures alone. The platform collected over $6.1 million in fees, with a weekly average surpassing $9 million.\n\nLido and Ethereum contribute to the total TVL\n\nConsidering the Decentralized Finance (DeFi) ecosystem, the Total Value Locked (TVL) stood impressively at over $47 billion, as indicated by DefiLlama. Notably, Lido Finance emerged as a significant contributor to this thriving DeFi landscape, accounting for nearly 27% of the total TVL. As of this writing, Lido Finance’s TVL stood at a substantial $12.75 billion, with an encouraging upward trend depicted on the charts.\n\nFurthermore, directing our attention towards Ethereum, a dominant player in the DeFi space, its TVL amounted to approximately $27.4 billion. Lido Finance held a considerable stake in Ethereum’s TVL, contributing over 46% of the total TVL, underscoring its influential presence and impact within the Ethereum ecosystem.\n\nDaily timeframe price trend\n\nWhile it may not be directly linked to the generated revenue, Ethereum’s price has been experiencing positive trends recently. At the time of writing, ETH was trading at approximately $1,845, exhibiting a modest 1% increase on the daily timeframe.\n\nMoreover, there were indications of a gradual shift toward a bull trend, as evidenced by the movement of its Relative Strength Index (RSI).\n\nIs your portfolio green? Check out the Lido Finance Profit Calculator\n\nIn contrast, as indicated by its RSI, Lido Finance’s price movement remained trapped in a bearish trend. However, there were signs of this bearish trend weakening, accompanied by a slight increase in its price. As of this writing, LDO was trading at around $1.9, with a modest gain of over 1% in value.\n\nWith prominent positions on the revenue-generating list and positive price movements, both Lido Finance and Ethereum seem favorably positioned."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3Lm5mdGdhdG9ycy5jb20vbWlsYWR5cy1uZnQtY29sbGVjdGlvbi1hbmQtb3JkaW5hbHMtbWFya2V0LXBhcnRuZXItdG8tYnJpbmctZXRoZXJldW0tbmZ0cy10by1iaXRjb2luL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 May 2023 07:00:00 GMT",
        "title": "Miladys NFT Collection and Ordinals Market Partner to Bring Ethereum NFTs to Bitcoin - NFT News and Insights from the Industry - NFTgators",
        "content": "Quick take:\n\nThree companies have teamed up to bring Ethereum NFTs to Bitcoin.\n\nThe Miladys NFT collection, Ordinals Market and Xverse Bitcoin Wallet on Monday launched the BRC-721E Standard.\n\nThis standard allows ERC-721 NFT holders to inscribe their NFTs on the Bitcoin blockchain.\n\nThe Miladys NFT collection, Ordinals Market and Xverse Bitcoin Wallet, three Ordinals-based projects have teamed up to launch the BRC-721E token standard. The new standard allows individual ERC-721 NFT holders to inscribe their NFTs on the Bitcoin blockchain.\n\nBitcoin Ordinals have become some of the most popular NFTs amid the bear market. Since launching in January 2023, more than 10.2 million NFTs have been inscribed on Ordinals.\n\nSource: @dataalways/Dune Analytics\n\nSubsequently, the fees spent inscribing have risen to about $44.2 million cumulatively, after spiking earlier this month after Binance launched its marketplace for Bitcoin NFTs.\n\nPreviously, Solana-based NFT marketplace Magic Eden also launched its Ordinals NFT marketplace, expanding its multichain ecosystem to the Bitcoin blockchain, while leading NFT company Yuga Labs jumped on the Bitcoin NFT train with a limited edition TwleveFold NFT collection, which raised $16.5 million from the auction.\n\nNFTs on Ordinals marketplaces use the BRC_20 token standard, which allows token transfers between buyers and sellers within the Ordinals network.\n\nHowever, with the BRC-721E standard individuals will be able to transfer their ERC-721 tokens to Ordinals. The migration process starts by permanently burning ERC-721 tokens on Ethereum, making it irreversible. It concludes with users reclaiming the recreated version of the tokens on Bitcoin as BRC-721E.\n\nBurned NFTs appear on marketplaces automatically and traders can inscribe as few as 100 bytes (JSON) when fees are low.\n\nThe Bitcoin Miladys NFT collection has 91 items listed on Ordinals while the original ETH version on OpenSea indicates it is comprised of 10,000 generative PFP NFTs.\n\n****\n\nStay up to date:\n\nSubscribe to our newsletter using this link – we won’t spam!"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZGFpbHljb2luLmNvbS9ldGgtd2FsbGV0LWRvcm1hbnQtc2luY2UtMjAxNS1tb3Zlcy04MDAwLWV0aC1pbi1taW51dGVzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 May 2023 07:00:00 GMT",
        "title": "ETH Wallet Dormant Since 2015 Moves 8000 ETH in Minutes - DailyCoin",
        "content": "The whale wallet made two transactions and moved 8,000 ETH in total.\n\nThe wallet has been holding the ETH since 2015.\n\nThere was another whale wallet that woke up after 7.7 years of dormancy.\n\nEthereum (ETH) investors are known to be one of the most disciplined ones in the crypto industry. After all, ETH is the second-largest cryptocurrency and can be staked for around 5% reward.\n\nAwake and Moving\n\nA large ETH whale has just moved thousands of ETH to another wallet. According to data from Lookonchain, a wallet dormant since 2015 has transferred 8,000 ETH to a different wallet. The wallet first did a transaction of 1 ETH and then moved the remaining 7,999 after a few minutes.\n\nThe 8,000 ETH is worth around $15.14 million at the current ETH price of $1,892. However, the investor that holds the ETH bought it when the price of one token was around $0.31.\n\nThis means that the wallet paid $2,480 for 8,000 ETH.\n\nAn Ethereum ICO participant who has been dormant for 8 years woke up today.\n\n\n\nHe transferred all 8000 $ETH($14.7M) to a new address.https://t.co/1griKB9Te9 pic.twitter.com/1bvQh3zsqY — Lookonchain (@lookonchain) May 28, 2023\n\nThis is not the first time that in the past few months an ETH wallet woke up for the first since ETH ICO in 2015. At the end of April, a wallet holding 2,365 ETH made a similar move.\n\nThe ETH bought back in 2015 was also worth $0.31. In total, the investor paid around $730 for 2,365 ETH.\n\nOn the Flipside\n\nIt’s unclear why or where the 8,000 ETH moved. Some speculate that the investor moved its ETH to a different hardware wallet because of the recent Ledger controversy. However, there’s no proof to substantiate this claim.\n\nWhy This Matters\n\nIt’s interesting to see how early ETH investors are moving with their investments. While it’s unclear whether they know something others don’t, monitoring old whale wallets can help better understand the investment climate at the time.\n\nRead more about the wallet that moved 2,365 ETH after 7.7 years:\n\nWallet That Bought 2,365 ETH for $730 Wakes Up After 7.7 Years\n\nRead more about why Polygon zkEVM and zkSync Era TVLs are climbing:\n\nPolygon zkEVM and zkSync Era TVL Keeps Climbing Amid Airdrop Speculation"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMitwFodHRwczovL3RoZWNyeXB0b2Jhc2ljLmNvbS8yMDIzLzA1LzI5L3RoZS1uZXh0LWV0aGVyZXVtLXNlYXJjaGluZy1mb3ItdGhlLW5leHQtYnVsbC1ydW4tbW9vbnNob3QtaGlnaC1wb3RlbnRpYWwtY3J5cHRvLWNvaW5zLXdpdGgtYXBlbWF4LW9yYm9maS1iaWctZXllcy1haWRvZ2UtbG92ZS1oYXRlLWludS1hbmQtbW9yZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 May 2023 07:00:00 GMT",
        "title": "The Next Ethereum. Searching For The Next Bull Run Moonshot High Potential Crypto Coins With ApeMax, Orbofi, Big ... - The Crypto Basic",
        "content": "The cryptocurrency market undergoes noticeable cycles characterized by variations in price, adoption, and overall market sentiment. These cycles are commonly known as bull runs when prices and market sentiment is up, and bear markets when there is a cooling-off phase.\n\nKeen investors who can search for and find high return coins before a bull run often achieve significant gains and ROIs from the rising bull market tides. For example, buyers who had the foresight to buy and hold Ethereum in 2016 when 1 ETH was worth a mere $1 have reaped massive benefits when the same coin price hit $4,815 during the last bull market peak in November 2021.\n\nWith the growing interest and increasing momentum in the cryptocurrency market, buyers are diligently exploring the terrain in pursuit of profitable and high APR prospects. Their objective is to discover undiscovered new crypto coins that possess considerable potential prior to the forthcoming bull run and ensuing market upswing and high APYs.\n\n- Advertisement -\n\nDrawing from meticulous market research and expert opinions, this article presents readers with a comprehensive overview of crypto bull runs, and gives some examples of coins which may have high potential in the next bull market upswing.\n\nIt is important to exercise caution and prudence when considering buying cryptocurrency, and to evaluate your personal goals and risk tolerance before diving into the purchase of cryptocurrencies. That being said, for buyers well versed in the space, there are many exciting new coins worth studying in the market.\n\nLeading our highlighted coin selection is ApeMax, an intriguing new token that introduces an innovative staking mechanism, enabling users to earn rewards by participating in staking activities.\n\nWhen is the next crypto bull run market?\n\nRecognizing a cryptocurrency bull market necessitates a thorough examination of multiple factors and indicators. While no approach can ensure complete precision, experts believe that these are some essential factors to consider that can aid in identifying a potential bull market:\n\n- Advertisement -\n\nBuyer Sentiment and the Fear and Greed Index\n\nIncreases in trading volumes, market capitalizations, and coin prices\n\nGreater institutional adoption\n\nIncrease utility and new user adoption rates\n\nList of 10 moonshot high potential crypto coins:\n\nApeMax Big Eyes Chainlink Polkadot Cardano Shiba Inu Tamadoge Love Hate Inu AiDoge Orbofi\n\nMoonshot high potential crypto coins:\n\nApeMax\n\nThe eagerly awaited presale stage of ApeMax has commenced, offering an enticing opportunity for buyers to obtain ApeMax coins at exceptional rates. Regarded as one of the standout cryptocurrency presales to monitor in 2023, ApeMax introduces pioneering tokenomics that empower users to earn rewards through staking activities across various entities. This groundbreaking approach establishes a solid groundwork for future expansion and advancement.\n\nEmbark on a savings adventure with ApeMax’s captivating Early Birds Loot Boxes, crafted for early adopters seeking to optimize their ApeMax experience. By acquiring tokens through these exclusive loot boxes, presale participants can unlock substantial discounts of up to 50% on ApeMax tokens. This presents a remarkable opportunity to amplify the advantages of the ApeMax presale and make the most out of this exciting opportunity.\n\nAmidst a cryptocurrency landscape filled with replicas and copycats, ApeMax stands out as a true trailblazer, introducing a crypto coin that challenges traditional conventions. Boasting unique tokenomics, practical real-world use cases, and a powerful brand image featuring a smiling ape riding a rocket, ApeMax is in a league of its own. This exceptional coin captivates the imagination of crypto enthusiasts, carving its distinct path forward.\n\nBig Eyes\n\nBig Eyes captivates the altcoin sector, raising $45.7 million in presale. $BIG tokens on Ethereum allow users to explore NFTs and create engaging digital content.\n\nChainlink\n\nChainlink revolutionizes cryptocurrency by bridging smart contracts and real-world data. Chainlink focuses on information reliability, security, and accurate data integration in blockchain networks.\n\nPolkadot\n\nPolkadot, a highly desired cryptocurrency, facilitates scalability and interoperability across distinct blockchains, fostering a connected and decentralized ecosystem with smooth data exchange.\n\nCardano\n\nCardano, a novel cryptocurrency, prioritizes research-led advancements, aiming to establish a resilient foundation for decentralized applications and smart contracts.\n\nShiba Inu\n\nShiba Inu coin rose to prominence as a notable cryptocurrency due to its association with the Shiba Inu dog breed and Dogecoin. Shiba Inu’s market cap hovers over $5 billion according to data from CoinGecko.\n\nTamadoge\n\nTamadoge, a prominent presale coin, distinguishes itself as a recently launched meme coin introducing a play-to-earn concept within the Tamadoge GameFi ecosystem.\n\nLove Hate Inu\n\nLove Hate Inu, a popular meme coin, sets itself apart thanks to its innovative utilization of a blockchain-based voting system, enabling users to engage in polls and earn.\n\nAiDoge\n\nAiDoge serves as the native token for a novel AI-generated meme platform and tool. It provides users with an engaging meme creation experience powered by artificial intelligence.\n\nOrbofi\n\nOrbofi coin ($OBI), the native token of the Orbofi ecosystem, is tied to the platform’s vision of being the Amazon of AI-generated content for web3.\n\n10 moonshot high potential crypto coins – Conclusion\n\nOffering a thorough analysis, this comprehensive guide unravels the early indicators that most experts look at to identify a crypto bull run, providing valuable insights into its fundamental nature. Additionally, it showcases a collection of interesting crypto coins that have garnered considerable attention from buyers who are eagerly looking to acquire them in anticipation of the next bull run and the ensuing market surge.\n\nApeMax revolutionizes the cryptocurrency arena with its pioneering tokenomics, reshaping the landscape by offering token holders the chance to earn rewards through “Boost-to-Earn” staking. The ApeMax presale provides an opportunity to acquire tokens at advantageous prices. Nevertheless, it is essential to exercise caution and acknowledge that buying cryptocurrencies demands careful deliberation, as they may not align with everyone’s risk appetite. Thorough evaluation and extensive research are crucial in order to make informed decisions within this realm.\n\nApeMax Official Website"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC92aXNhLWlzLXV0aWxpemluZy1ldGhlcmV1bXMtZXJjLTIwLWZvci10cmFuc2FjdGlvbi1mZWVzLXRyYWRlY3VydmUtdG8tb2ZmZXItbG93LXRyYWRpbmctZmVlcy1vbi1pdHMtcGxhdGZvcm0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 May 2023 07:00:00 GMT",
        "title": "Visa Is Utilizing Ethereum's ERC-20 For Transaction Fees, Tradecurve To Offer Low Trading Fees On Its Platform - Analytics Insight",
        "content": "Visa is the latest real-world business to accept Ethereum for payments. This collaboration has huge implications for the wider DeFi environment and could significantly speed up DeFi adoption.\n\nHowever, with Ethereum being known for its high and somewhat unpredictable fees, some investors believe that it may struggle to gain widespread traction. Meanwhile, Tradecurve offers extremely low fees on its platform which makes it a more viable option for mainstream crypto adoption.\n\n>>Register For The Tradecurve Presale<<\n\nCould The Visa Development Speed Up Ethereum Adoption?\n\nFrom May 25th, Visa will start to use ERC Ethereum tokens for transactions. Using a Visa card, individuals will be able to spend Ethereum and any ERC20 token is 30 countries and 45 million destinations.\n\nThis collaboration will be supported by an app, which will work like most banking apps. Individuals will be able to change their pin, freeze and order new cards, as well as chat to support teams if required.\n\nAlthough Ethereum’s value is yet to replicate its new potential, we could see cryptocurrency become a normal means of payment in just a few years.\n\nWhat Does This Mean For Ethereum?\n\nUntil now Ethereum was normally used to pay for DeFi goods and services and trade cryptocurrency. With the Visa collaboration, Ethereum can be used to buy everyday goods from stores, greatly increasing its potential utility.\n\nHowever, for Ethereum to gain mass adoption outside of the DeFi space, its issue of high fees will first need to be resolved. In some circumstances Ethereum users are still paying over $100 in gas fees just to make a transaction. As a result, Ethereum transactions may not be suitable for buying everyday products for the foreseeable future.\n\nTradecurve’s Second Presale Round On Track To Sell Out In May\n\nTradecurve is built on the ​​Ethereum blockchain and looks to become a top three exchange in the next few years. While this is an ambitious goal, Tradecurve has the utility to potentially dominate the market. With investor confidence being rocked following the collapse of FTX, many investors are now looking for decentralized alternatives. However, many alternatives don’t offer the assets they’re looking for.\n\nAs a decentralized hybrid exchange, Tradecurve lets investors buy DeFi assets and derivatives without the need for KYC checks. Instead, users can trade global asset classes whilst protecting their privacy through DeFi capabilities.\n\nTrading is fully anonymous, with traders using external wallets to connect, buy assets and disconnect as they please. This option of a self-custody wallet lets investors maintain full control of their assets and prevents unethical trading on behalf of an exchange.\n\nJust one account is needed to trade traditional and DeFi assets, and can be created with an email. Once created, investors will be able to access one of the widest range of assets on any platform and will have access to Tradecurves lucrative educational features. These will include AI and copy trading subscriptions, as well as a trading academy for new investors.\n\nTradecurve’s second presale round has sold out. TCRV tokens have increased from $0.012 to $0.015, with analysts predicting further price increases could occur weekly. This growth has helped Tradecurve attract thousands of daily new investors, as well as Ethereum whales looking for great returns.\n\nFor more information about the Tradecurve presale:\n\nClick Here For Website\n\nClick Here To Buy TCRV Presale Tokens\n\nFollow Us Twitter\n\nJoin Our Community on Telegram\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMipQFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9oaWdoLWdyb3d0aC1jcnlwdG8tY29pbnMtYW5kLWFwZW1heC0xMC1jcnlwdG8tY29pbnMtd2l0aC0xMDAweC1wb3RlbnRpYWwtd2l0aC1hcGVtYXgtYmlnLWV5ZXMtZXRoZXJldW0tc2hpYmEtaW51LWNoYWlubGluay1hbmQtbW9yZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 May 2023 07:00:00 GMT",
        "title": "High Growth Crypto Coins and ApeMax: 10 Crypto Coins with 1000x Potential with ApeMax, Big Eyes, Ethereum, Shiba ... - Analytics Insight",
        "content": "As the quest for the next cryptocurrency with high growth potential gains momentum, the crypto market has witnessed a renewed surge in interest. In the past, substantial growth in the cryptocurrency market has been propelled by established tokens like Ethereum and Bitcoin. Ethereum, founded by Vitalik Buterin, achieved an astonishing growth of 38,299% from 2017 to 2021. In recent times, newer and younger coins such as Shiba Inu, and most recently Pepe have unlocked significant growth opportunities, with Pepe surpassing a market capitalization of $1 billion in record time after its launch.\n\nIn this article, we will analyze in detail the top cryptocurrency coins with the highest growth potential. In this definitive guide, we gather data collected from expert opinions, analyst predictions, and relevant historical data.\n\nConsequently, there is a growing trend among crypto buyers to explore fresh and enticing cryptocurrency tokens, particularly those available during presale events. These presales offer the opportunity to learn about and potentially acquire a new coin before its official launch. In this article, we will showcase several potentially high growth crypto coins which might have the ability to achieve high growth, and also highlight the distinctive features of ApeMax. This new token boasts cutting-edge tokenomics that enable holders to engage in boost-to-earn activities.\n\nWith the ApeMax presale now underway, it presents a favorable moment to acquire ApeMax tokens at great presale rates. However, it is crucial to acknowledge that investing in cryptocurrencies may not be suitable for everyone, as it comes with inherent risks. Prior to considering buying cryptocurrencies, individual research into the specific token, consulting experts for advice, and thorough review of one’s own risk appetite are paramount. For seasoned crypto enthusiasts who possess a thorough understanding of the potential rewards and risks involved, the current market offers numerous interesting options.\n\nList of 10 Crypto Coins with 1000x Potential:\n\nApeMax – New crypto coin with revolutionary Boost-to-Earn staking tokenomics. Chainlink – Blockchain bridge connecting smart contracts with real-world data sources. Big Eyes – Cute crypto coin with one of the most successful crypto presales of the year. Shiba Inu – Meme-inspired cryptocurrency with a strong online community presence. Ethereum – Decentralized platform fueling smart contracts and decentralized applications. Dogecoin – Popular meme-inspired cryptocurrency with a strong online community and Elon Musk as a fan. Bitcoin – Pioneering and widely accepted cryptocurrency, driving the digital revolution. Polkadot – Interoperable blockchain network fostering connectivity and scalability. Tamadoge – Play-to-earn meme coin with a GameFi ecosystem concept. Love Hate Inu – Rising meme coin with an advanced blockchain-based voting system\n\nWhat are the characteristics of a high growth potential crypto coin?\n\nHigh growth potential crypto coins often exhibit certain attributes that make them attractive to buyers, which can include having innovative technology, strong community support, and real market demand due to the coin’s ability to cater to specific use cases. Although a coin’s future price or growth cannot be perfectly guaranteed or predicted, these above characteristics are interesting factors to consider.\n\nWhat makes ApeMax Coin so unique and groundbreaking?\n\nApeMax, a fresh cryptocurrency token, introduces an innovative staking mechanism called Boost-to-Earn and features advanced tokenomics. The start of the ApeMax presale presents an enticing opportunity for buyers to purchase ApeMax coins at exceptionally advantageous rates.\n\nApeMax introduces a revolutionary concept called Boost-to-Earn, marking a significant advancement in the realm of cryptocurrencies. Through staking on diverse entities, such as popular influencers, successful DeFi protocols, and more, ApeMax enables both token holders and staking entities to earn rewards. By embracing the dynamic realm of ApeMax boosting, users can unlock the potential for earning rewards and embark on a journey of possibilities with this pioneering cryptocurrency.\n\nWith the ApeMax presale, a valuable opportunity emerges to obtain ApeMax tokens at exceptionally competitive prices within a limited time frame. Mentioned as one of the new best crypto presales worth monitoring, ApeMax offers an alluring proposition. Delve into the details of the ApeMax presale today and seize the moment to acquire tokens that hold practical utility and the potential for earnings via staking.\n\nAccording to data and research conducted by analysts, timing holds significant importance in the realm of cryptocurrencies. During the ApeMax presale, the presale price of ApeMax tokens experiences daily increases throughout the presale phase. Hence, to make the most of this opportunity, it may be best to promptly explore the ApeMax presale. In the ever-evolving landscape of cryptocurrencies, being an early adopter can yield substantial advantages if a token gains momentum and captures wider mainstream attention in the future.\n\nProspective buyers can also stay one step ahead by taking advantage of the ApeMax Early Birds Loot Boxes, designed for early buyers. By being an early adopter, you can acquire ApeMax tokens at discounted rates of up to 50% through these appealing loot boxes. Make sure not to overlook this opportunity to gain an extra advantage in the ApeMax presale.\n\nCrypto Coins with 1000x Potential – Conclusion\n\nUltimately, the crypto market’s impressive expansion has been propelled by visionary coins that stayed ahead of the pack. Initially, pioneering coins such as Bitcoin sparked enthusiasm, while later, utility-driven stars like Ethereum took the spotlight. As internet meme culture and social media gained momentum, coins like Doge, Shiba Inu, and Pepe skyrocketed in value.\n\nIn the current climate, buyers are actively seeking out new coins and tokens that challenge the established norms and aim to revolutionize the crypto space with intriguing tokenomics and a unique value proposition.\n\nApeMax, with its innovative Boost-to-Earn tokenomics and cutting-edge approach, possesses the potential to create significant ripples in the crypto community, capturing the attention of enthusiastic crypto enthusiasts. It is crucial to acknowledge that cryptocurrency may not be suitable for everyone, but for buyers who comprehend the potential rewards and risks, there is a multitude of captivating new coins in the market today that warrant close observation.\n\nOfficial ApeMax Website: https://apemax.io/\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9iaXRjb2luLWFuZC1ldGhlcmV1bS1jb250aW51ZWQtdG8tc2x1bXAtYXMtY29uY2VybnMtYWJvdXQtdGhlLXVzLWRlYnQtY2VpbGluZy05LWFsdGNvaW5zLWZvci14MTAwLWdhaW5zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 May 2023 07:00:00 GMT",
        "title": "Bitcoin And Ethereum Continued to Slump as Concerns About the Us Debt Ceiling - 9 Altcoins for X100 Gains - Analytics Insight",
        "content": "As the US debt ceiling crisis casts a shadow over global markets, leading cryptocurrencies Bitcoin and Ethereum have taken a hit.\n\nBitcoin’s value fell by 1.8%, reaching its lowest point in over two months, while Ethereum experienced a similar decline, plunging by over 2%.\n\nThis downturn, resulting from the uncertainty surrounding the debt ceiling and the Fed’s hawkish stance, also impacts other risk assets including cryptocurrencies.\n\nHowever, as these market leaders falter, it paves the way for altcoins like Wall Street Memes ($WSM), AiDoge (AI), SpongeBob Token (@SPONGE), Ecoterra (ECOTERRA), yPredict (YPRED), DeeLance (DLANCE), Launchpad (LPX), and Copium ($COPIUM) to take center stage.\n\nLet’s dig deeper.\n\n>>>Get the Best Presale Token Now<<<\n\n9 Altcoins With 100X Chance – Quick Overview\n\nTake a quick look at the eight best altcoins that experts predict can deliver astounding gains of up to 100X.\n\n9 Altcoins With 100X Chance– Detailed Analysis\n\nWith the basics covered, let’s move on to a more detailed look at the altcoins that can promise 100X returns.\n\nWall Street Memes ($WSM) – Branded as the “King Of Meme Coins”\n\nMeme coins have been riding a wild wave of popularity, exemplified by the surge of PEPE coin. Now, $WSM – the Wall Street Memes token is poised to soar even higher.\n\nBoasting over a million followers across social platforms and having caught the attention of Elon Musk, $WSM’s potential seems limitless. This wide recognition also hints at a strong possibility of a Binance listing soon.\n\nAdd to this the speed at which their first NFT collection, Wall St Bulls, sold out in 2021, and you have a true meme crypto contender.\n\nDon’t miss out – visit their website and secure your $WSM tokens now.\n\n>>>Buy WSM Now<<<\n\nAiDoge (AI) – Overall the Best Presale Asset Available\n\nIn the vanguard of the meme-creation landscape, AiDoge (AI) injects the art of humor with a dose of high-end AI technology.\n\nThis impressive project spins out viral, laugh-inducing memes while rewarding users with its digital currency.\n\nNot just that, the secure blockchain foundation of the platform ensures an end to copyright woes. AiDoge’s ongoing presale has already caught the attention of investors worldwide, raking in a staggering $14.5 million.\n\nSeize the chance to be part of this phenomenal project.\n\n>>> Buy AiDoge Now<<<\n\nSpongeBob Token ($SPONGE) – Marked as the Next PEPE Coin\n\nEmerging amidst the ripple effect of Pepe Coin and several potent meme coins, SpongeBob Token presents an intriguing narrative in the meme coin discourse this year.\n\nWithin days of its debut, it secured a massive following, propelled by an impressive price surge and key exchange listings.\n\nNotably, $SPONGE stands apart from its rivals, manifesting transparency through the publication of vital certificates that dispel common fears of rug pulls.\n\nThis demonstration of credibility is a major draw for investors, instilling faith in the token’s long-term prospects.\n\n>>> Buy SpongeBob Token Now<<<\n\nEcoterra (ECOTERRA) – Promoting Green Choices Through Blockchain\n\nEcoterra’s unique Recycle2Earn mechanism motivates users to make eco-friendly choices, turning recycling efforts into instant token rewards.\n\nCurrently in its 7th presale phase, Ecoterra presents an accessible entry point for newcomers, with tokens priced at a meager $0.0085 USDT.\n\nThe platform’s easy-to-use app accelerates this environmentally conscious journey, fostering the mass adoption of greener habits.\n\nBy bridging the gap between cryptocurrencies and sustainable choices, Ecoterra is truly paving the way for a greener future.\n\n>>> Buy Ecoterra Now<<<\n\nyPredict (YPRED) – Empowering Crypto Trading with AI Predictions\n\nIn the expansive realm of crypto, yPredict emerges as an unparalleled predictive model platform.\n\nThe brainchild of proficient AI developers, yPredict utilizes robust mathematical techniques to craft industry-specific forecasts.\n\nYPRED, the platform’s native token, serves as the key to these high-quality analytics, enabling users to tap into powerful trading signals.\n\nEven for the inexperienced, yPredict’s intuitive interface streamlines token purchase and model subscriptions.\n\nWith a DAO voting system to safeguard quality, staking opportunities for extra returns, and a capped supply of 100 million YPRED tokens, yPredict presents itself as an enticing investment prospect.\n\n>>> Buy yPredict Now<<<\n\nDeeLance (DLANCE) – Innovative Freelancing with Blockchain\n\nIn the dynamic world of freelancing, DeeLance stands out, harnessing the power of blockchain to craft a transparent ecosystem for both sides\n\nThe platform’s utilization of smart contracts, NFT tokenization, and an escrow payment service establishes a trustful environment.\n\nLow fees make DeeLance an attractive proposition, with $DLANCE tokens now available in presale, currently priced at $0.057. The future of freelancing is here, blending decentralization, fair practices, and seamless transactions.\n\n>>> Buy DeeLance Now<<<\n\nLaunchpad (LPX) – Pioneering the Web3 Revolution\n\nOn the crypto horizon, Launchpad XYZ, a soon-to-launch web3 platform, has generated notable interest.\n\nIts native token, $LPX, has accrued over $600,000 in its presale. Given the token’s price increase from $0.035 to $0.0445, quick acquisition might be wise before a potential future hike.\n\nLaunchpad XYZ’s mission?\n\nTo provide a user-friendly portal for top blockchain projects, encompassing NFTs to play-to-earn games. Staking $LPX offers advantages like discounted fees and presale whitelisting.\n\nAs Launchpad XYZ aims to simplify the transition from Web2 to Web3, it presents an exciting opportunity in the crypto landscape.\n\n>>> Buy Launchpad XYZ Now<<<\n\nCopium ($COPIUM) – Turns Your Mistakes into Profits\n\n$COPIUM, a community-oriented crypto token, offers a unique proposition. This token capitalizes on resilience and camaraderie among those who have weathered the volatility of the crypto world, turning regrets into potential profits.\n\nAttracting investors for its distinct nature and a lucrative NFT airdrop feature, $COPIUM promotes a sense of belonging in the digital currency realm.\n\nNotably, a recent announcement of a substantial token burn, reducing the supply by 30%, raises anticipation of potential price increases.\n\nAs part of the meme token trend, $COPIUM brings humor into crypto investing, offering a vibrant blend of community and profit.\n\n>>> Buy $COPIUM Here<<<\n\nSolana (SOL) – High Scalability & Decentralization\n\nSolana, has caught the market’s eye with its high scalability, becoming an optimal platform for dApp developers.\n\nIts distinct ‘Proof-of-History’ consensus allows for a whopping 65,000 transactions per second, maintaining decentralization with minimal transaction costs.\n\nThis high-speed, low-cost formula has positioned Solana as a preferred hub for NFT creation and trading, blockchain gaming, and DeFi protocols.\n\nOffering strong competition to Ethereum, Solana’s SOL tokens, owing to their affordability and broad access, are a promising choice for beginners in the crypto market.\n\nThe Conclusion\n\nAs Bitcoin and Ethereum grapple with the uncertainties of the US debt ceiling crisis, they continue their downward journey, challenging investor confidence.\n\nThis volatile environment, however, presents a golden opportunity to explore the untapped potential of altcoins.\n\nInnovative assets like Wall Street Memes, AiDoge, SpongeBob Token, Ecoterra, yPredict, DeeLance, Launchpad, and Copium are not only resilient to market fluctuations, but they also hold the promise of significant gains.\n\nThey represent diverse areas of technology, sustainability, and meme culture, offering a rich selection for investors seeking alternatives to the traditional crypto heavyweights.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMikQFodHRwczovL2ZpbmFuY2VmZWVkcy5jb20vcGlvbmVlcmluZy1hLW5ldy1lcmEtaW4tZ2FtaW5nLXRoZS1xd2FuLXRva2VuLWxhdW5jaGVzLW9uLWV0aGVyZXVtLWJsb2NrY2hhaW4tdW5sZWFzaGluZy1hLWRlY2VudHJhbGl6ZWQtZ2FtaW5nLWVjb25vbXkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 May 2023 07:00:00 GMT",
        "title": "Pioneering a New Era in Gaming: The QWAN Token Launches on Ethereum Blockchain, Unleashing a Decentralized ... - FinanceFeeds",
        "content": "Pioneering a New Era in Gaming: The QWAN Token Launches on Ethereum Blockchain, Unleashing a Decentralized Gaming Economy\n\nThe QWAN token launch on the Ethereum blockchain heralds a new era of decentralized gaming, empowering players and shaping the industry’s future through community-led governance and a unified gaming economy.\n\nBrace yourself for a game-changing moment in gaming as The QWAN, an innovative decentralized token, gears up for its highly anticipated launch on the Ethereum blockchain on May 31st. With the unwavering support of influential Web3 leaders, this groundbreaking token is poised to redefine the gaming landscape as we know it. Banger is the inaugural gaming platform leading the charge to integrate The QWAN token into its ecosystem.\n\nPrepare to immerse yourself in a new gaming experience as The QWAN takes center stage. This pioneering native gaming token paves the way for a decentralized economy that transcends geographical boundaries, empowering gamers across the globe. Fueling this revolution is The QWAN Foundation, committed to championing a community-driven governance model that places control back in gamers’ hands. By utilizing The QWAN as a shared currency, a unified gaming economy is forged, set to shape the future of the industry and its culture in unprecedented ways. Moreover, any platform or application can seamlessly integrate The QWAN, amplifying its appeal and transforming the gaming landscape.\n\nBeneath its innovative exterior lies a dynamic gaming ecosystem designed to empower players, unlocking new avenues for engagement and rewarding their active participation. The QWAN introduces a paradigm shift in gaming incentives, enticing players with opportunities to earn, trade, and truly own their digital assets. By immersing themselves in diverse gaming experiences, players unlock a realm of rewards within the ecosystem while actively participating in the decision-making processes that shape the community through a unique system of governance.\n\nShaking off the traditional top-down approach, The QWAN revolutionizes the gaming industry from the ground up, ensuring all stakeholders have a voice. By fostering collaboration and embracing a bottom-up philosophy, The QWAN unlocks untapped value across all segments of the gaming world. Furthermore, this inclusive approach ignites a sense of ownership and shared purpose, aligning the interests of gamers, developers, and industry participants.\n\nGuiding this momentous launch is the expertise and strategic counsel of Horizon Labs Ventures (HLV), the foremost Web3 advisory and solutions provider. With an outstanding track record of supporting industry titans such as Yuga Labs, The Sandbox, and Animoca Brands, HLV recognizes the transformative potential of The QWAN to attract existing Web2 gamers and propel the gaming industry into a new era of innovation and prosperity.\n\nBanger, the innovative gaming platform and marketplace blazes the trail as the first to embrace The QWAN token and fully embody the vision of The QWAN Foundation. By integrating The QWAN, Banger enriches the gaming experience for its users, offering unparalleled opportunities that cannot be found elsewhere. Furthermore, the QWAN’s open and permissionless nature invites more gaming industry players to embark on this transformative journey as they also seize this game-changing token’s potential.\n\nExcitement mounts as The Qwan (QWAN) prepares to debut on multiple exchanges starting at 10:00 EST on May 31st, boasting a listing price of $0.15. Savvy traders can access the QWAN token on esteemed exchanges such as MEXC, AscendEX, BTSE, and many others, ensuring widespread accessibility and liquidity.\n\nTo better understand The QWAN and The QWAN Foundation’s mission, visit the official website at www.theqwan.io.\n\nThe QWAN represents a global gaming token at the forefront of decentralized community-led governance. Its visionary architecture empowers gamers and reshapes the gaming industry’s trajectory by fostering a culture of decentralization and community-driven decision-making. By integrating The QWAN DAO, users can access spending opportunities and rewards within The QWAN Ecosystem, a vibrant network comprising gaming platforms, cutting-edge Web2 and Web3 games, and other key industry players. As an open-source and permissionless digital token, The QWAN invites seamless integration into any outlet, application, or game, catering to a passionate, ever-growing community of boundary-pushing gamers."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3Byb21vdGluZy1maW5hbmNpYWwtaW5jbHVzaW9uLXdpdGgtZG9nZW1peWFnaS1iaXRjb2luLWFuZC1ldGhlcmV1bS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 May 2023 07:00:00 GMT",
        "title": "Promoting Financial Inclusion with DogeMiyagi, Bitcoin, and Ethereum - Analytics Insight",
        "content": "“Finance For All!” Unleashing Financial Inclusion With Bitcoin, Ethereum, And DogeMiyagi\n\nOver the years, we’ve witnessed amazing technological advancements in almost every sector, from medicine to finance. Yet, globally, some 1.4 billion adults remain unbanked, with little to no access to useful and affordable financial products and services that meet their needs.\n\nCryptoevangelists believe digital currencies are a revolutionary way of advancing financial inclusion, and it is easy to see why they do. Cryptocurrency can offer a variety of other financial services in addition to giving users access to conventional banking services.\n\nDogeMiyagi (MIYAGI), the new coin on the block, is looking to push the limits of what can be done for individuals in need of financial relief. While Bitcoin (BTC) and Ethereum (ETH) have paved the way for blockchain technology, DogeMiyagi adds a playful twist to the mix.\n\nThe Power Of DogeMiyagi’s Accessibility\n\nOne of the defining characteristics of DogeMiyagi (MIYAGI) is its accessibility. Unlike Bitcoin or Ethereum, which can require technical knowledge and significant investment, MIYAGI has a low barrier to entry.\n\nIts user-friendly interface and community-driven ethos make it an ideal digital currency for individuals in underbanked regions who may lack access to traditional banking services. DogeMiyagi’s inclusive nature allows people to participate in the global economy and transact with ease, fostering financial empowerment.\n\nDogeMiyagi’s Social Impact And Community-Driven Initiatives\n\nDogeMiyagi’s unique branding, inspired by the popular Doge meme and pop culture reference of Mr Miyagi from the 80s classic, The Karate Kid, has propelled it to the forefront of social media conversations. This playful approach has helped DogeMiyagi gain a massive following, including a passionate community of users who actively engage with the currency.\n\nLeveraging this momentum, DogeMiyagi has the potential to facilitate grassroots movements and community-driven initiatives focused on financial inclusion. By harnessing the collective power of its supporters, it can address specific challenges faced by underbanked communities and drive positive change.\n\nThe Role Of Bitcoin In Financial Inclusion\n\nBitcoin, as the pioneer of cryptocurrencies, has undoubtedly made significant contributions to financial inclusion. Its decentralized nature and borderless transactions have enabled individuals in underserved regions to access financial services and participate in the global economy.\n\nHowever, Bitcoin’s volatility and limited scalability have posed challenges to widespread adoption in underbanked areas. Additionally, the technical complexity associated with Bitcoin can act as a barrier for those without technical expertise.\n\nEthereum’s Impact On Financial Inclusion\n\nEthereum, renowned for its smart contract capabilities, has introduced innovative possibilities for financial inclusion. Its programmable nature allows for the development of decentralized applications (DApps) and the creation of financial services tailored to specific needs.\n\nEthereum’s vast ecosystem has fostered the emergence of microfinance platforms, decentralized lending protocols, and crowdfunding initiatives.\n\nHowever, similar to Bitcoin, Ethereum faces challenges of scalability and high transaction fees, which can limit its accessibility in underbanked regions.\n\nWhile Bitcoin and Ethereum have paved the way for financial inclusion by revolutionizing the concept of digital currencies, DogeMiyagi brings a fresh perspective with its accessibility and playful approach. By lowering the entry barriers and leveraging its vibrant community, DogeMiyagi has the potential to reach underbanked regions and empower individuals economically.\n\nAs the landscape of digital currencies evolves, embracing the inclusive and fun-loving spirit of DogeMiyagi can unlock new avenues for financial empowerment across the globe.\n\nFor More Information On DogeMiyagi:\n\nWebsite: https://dogemiyagi.com\n\nTwitter: https://twitter.com/_Dogemiyagi_\n\nTelegram: https://t.me/dogemiyagi\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNyeXB0by1uZXdzLWZsYXNoLmNvbS9tYWtlLWEtZm9ydHVuZS13aXRoLWV0aGVyZXVtLWFzLWl0LWhpdHMtNTEwMDAtaW4tNy15ZWFycy12YW5lY2tzLW1hc3RlcnBsYW4v0gF0aHR0cHM6Ly93d3cuY3J5cHRvLW5ld3MtZmxhc2guY29tL21ha2UtYS1mb3J0dW5lLXdpdGgtZXRoZXJldW0tYXMtaXQtaGl0cy01MTAwMC1pbi03LXllYXJzLXZhbmVja3MtbWFzdGVycGxhbi8_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 May 2023 07:00:00 GMT",
        "title": "Make a Fortune with Ethereum as it Hits $51,000 in 7 Years – VanEck’s Masterplan - Crypto News Flash",
        "content": "Ethereum (ETH) could have a base case price target of $11,848.62 and a bull case of $51,000 according to VanEck.\n\nHowever, the asset could fall to as low as $343.29 in a bear case.\n\nEthereum (ETH), the second largest crypto by market cap, has been tipped to go as high as $51,000 in seven years. In a new research report that focuses on the base, bear, and bull case of the digital asset, Global investment manager VanEck observed the performance of Ethereum when certain conditions are met.\n\nThis prediction was made based on the possibility that Ethereum becomes the largest open-source global settlement platform.\n\nWe base these estimates on the thesis that Ethereum becomes the dominant open-source global settlement network that hosts substantial portions of the commercial activity of business sectors with the highest potential to gain from moving their business functions to public blockchains. In a portfolio of similar smart contract platforms, we assume to own a collection of call options, with the dominant platform likely to take a majority market share.\n\nOnce it becomes the top settlement system or smart contract platform, there is a high possibility that the base case price target would be $11,848.62. In a bull case, the price would target $51,006.\n\nHowever, things could go bad if it no longer becomes the top settlement system. The report estimates that a 15 percent dominance of Ethereum in this regard could send the price down to $343.29 in the bear case.\n\nEthereum is beyond transactional currency\n\nOne interesting observation by the researchers is that Ethereum has evolved over the years to establish itself beyond a transactional currency or a consumable commodity to become a store of value assets. This makes it similar to Bitcoin, however, operates a little differently.\n\nWe believe that ETH, while not a complete store of value like Bitcoin due to Ethereum’s demonstrated mutability of code and an evolving social consensus focused on utility, will nevertheless become a store-of-value asset for state actors looking to maximize human capital (vs. Bitcoin, which maximizes stranded energy).\n\nThis prediction is quite interesting, but far lower than Ark Invest’s Cathie Wood’s prediction. Last year, she predicted that Ethereum could reach a $20 trillion market cap by the year 2030. Decentralized finance is gaining traction, and could be a catalyst for Ethereum to displace many traditional financial services according to Cathie Wood as reported by Markets Insider.\n\nThe second-largest cryptocurrency, according to Ark Invest, will meet or surpass a $20 trillion market capitalization by 2030. Each coin would be priced at around $170,000-$180,000. Based on its current price of about $2,480, ether would have to jump by about 7,200% to meet the firm’s target. As financial services move on-chain, decentralized networks are likely to take share from existing financial intermediaries.\n\nJust recently, Ethereum announced one of its biggest upgrades, the Shapella upgrade, which enables users to unstake or withdraw their staked ETH. However, its constantly rising gas fee is becoming a major challenge and would need to be addressed for the asset to surge to these predicted price points.\n\nThe market sentiment around ETH is currently bullish and has surged by 5.61 in the last seven days to trade at $1,903.45.\n\nThis article is provided for informational purposes only and is not intended as investment advice. The content does not constitute a recommendation to buy, sell, or hold any securities or financial instruments. Readers should conduct their own research and consult with financial advisors before making investment decisions. The information presented may not be current and could become outdated."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vdGltZXN0YWJsb2lkLmNvbS9jcnlwdG8tZXhwZXJ0LXNheXMteHJwLXdpbGwtaGl0LTUtYmFzZWQtb24tdGhpcy1ub3RhYmxlLWV0aGVyZXVtLWV0aC1jb21wYXJpc29uLWRldGFpbHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 May 2023 07:00:00 GMT",
        "title": "Crypto Expert Says XRP Will Hit $5 Based On This Notable Ethereum (ETH) Comparison: Details - Times Tabloid",
        "content": "Mason Versluis, a closely followed crypto podcaster, who founded Gold Squad, has showcased his bullishness in the embattled digital token XRP.\n\nAs recently asserted by the crypto influencer, the $5 market price is on the cards for XRP. The reason for his confidence is that it’s the only asset to ever surpassed Ethereum (ETH) in terms of market capitalization.\n\nRead Also: Attorney John Deaton Addresses XRP Doubters, Says “FOMO Won’t Likely Kick in Until $2”\n\nAccording to Versluis in a tweet a couple of hours ago, this price point might seem impossible and can easily be taken as a joke. But there used to be a time when XRP was outperforming Ethereum (ETH), the second largest cryptocurrency by market cap.\n\nSo, for the popular podcaster, a $5 future price is not an impossible feat for XRP, the digital token that was occupying the third position in the crypto market ranking table before the SEC filed a class action lawsuit against Ripple, its major distributor.\n\nMason Versluis tweeted, “It’s easy to laugh at someone when they say XRP will hit $5. Do NOT underestimate one of the only coins to ever surpass ETH in market cap.”\n\nIt’s easy to laugh at someone when they say $XRP will hit $5. Do NOT underestimate one of the only coins to ever surpass $ETH in market cap 😮‍💨🤷🏽 — MASON VERSLUIS 🏆🔮 (@MasonVersluis) May 29, 2023\n\nAnother Analyst Shares a Similar Opinion\n\nXRP has to print a relatively 900% price surge from its current prices to hit the $5 price target. This may seem ridiculous, but not impossible as started by another pseudonymous analyst popularly known in Crypto Twitter as Crypto Assets Guy.\n\nAccording to the analyst, once the longstanding lawsuit is finally brought to an end, XRP will start a bull run that could make its price hit $5.\n\nCrypto Assets Guy stated, “I need to say this again: Once the lawsuit ends $XRP won’t hit $1000, $100 or $50 It could reach $5. Which is great in my opinion.”\n\nI need to say this again: Once the lawsuit ends $XRP wont hit $1000, $100 or $50 It could reach $5. Which is great in my opinion — Crypto Assets Guy (@cryptoassetsguy) May 29, 2023\n\nRead Also: Gym Positivity CEO Declares Support for Ripple and XRP. Here’s what he said\n\n<\n\nXRP in the Market\n\nOver the past couple of hours, XRP has been showcasing a bullish trend, which is obviously not initiated by Bitcoin (BTC) or any other top asset. XRP has been in this positive trend alone and has surpassed the $0.5 resistance level in the process.\n\nAt the time of press, XRP is trading at $0.5222, with a relatively 6% price upsurge in the last 24 hours and 12.35% in the last seven days, according to CoinMarketCap.\n\nFollow us on Twitter, Facebook, Telegram, and Google News"
    }
]