[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiLWh0dHBzOi8vYmxva3QuY29tL2d1aWRlcy93aGF0LWlzLWV0aGVyZXVtLWV0aNIBMWh0dHBzOi8vYmxva3QuY29tL2d1aWRlcy93aGF0LWlzLWV0aGVyZXVtLWV0aD9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "What is Ethereum? Read the ULTIMATE Research-Backed ETH Guide - Blokt",
        "content": "Ethereum is the leading blockchain app platform that was proposed in 2013 by Vitalik Buterin and went live on July 30, 2015.\n\nThere are many different strands to this project and getting your head around it all can be quite the challenge. That’s why we have put together this comprehensive guide for those of you wondering “What is Ethereum?” and “How does Ethereum Work?”\n\nAs the harbinger of the second generation of blockchains and home to the second largest digital currency in the world, Ether (ETH), the Ethereum project has started a new era of blockchain development that enables a global community of developers to unleash their creativity in the space.\n\nThe ability to craft smart contracts gave developers a chance to think about new use cases for blockchain technology that previously remained largely connected to cryptocurrencies.\n\nEthereum also gave enterprises, organizations, and startups the ability to issue their own tokens, and build their own unique blockchain ecosystem using the Ethereum framework.\n\nTill date, Ethereum-based ERC20 tokens have been the most popular means for launching Initial Coin Offerings.\n\nOf course, Ethereum is still in development and has faced some hurdles. It has faced problems related to scalability, which was highlighted when the popular game dedicated to internet-bred cats called CryptoKitties managed to clog its network in December 2017.\n\nHowever, with a unique concept, upcoming developments, a strong developer community and the first-mover advantage (second only to the mighty Bitcoin), Ethereum is one blockchain project that continues to remain at the forefront of DLT and crypto development.\n\nSo… What is Ethereum?\n\nIn a nutshell, Ethereum is an open source Smart contract and Decentralized Application Platform.\n\nThe Ethereum whitepaper describes the project as the next generation distributed computing platform, that provides a decentralized virtual machine known as the Ethereum Virtual machine EVM.\n\nThe latter is able to execute Peer-to-Peer contracts by means of Ether (ETH), its proprietary crypto fuel.\n\nBlockchain technology is used as a tool of shared consensus, while Ether is the digital asset that is used to pay for transaction fees and computational services.\n\nWhat’s the Difference Between Bitcoin and Ethereum?\n\nSince the advent of the Ethereum project in late 2014 and its explosion of popularity within the confines of the nascent crypto space and beyond, Ethereum has always been compared to Bitcoin.\n\nAll being similar to the use of Blockchain as the underpinning technology, both projects are fundamentally different. The main difference between them is the purpose of each one.\n\nIn fact, Bitcoin was built as an alternative to regular money. Bitcoin can be used as a medium of value exchange, a means of payment and a store of value with no central authority to issue or control it and no intrinsic value or physical existence.\n\nOn the other hand, Ethereum is rather a platform for developers to build and run Peer-to-Peer executable contracts and decentralized applications.\n\nBlock time generation (seconds in the case of Ethereum and minutes in the case of Bitcoin), the rate at which new coins are mined (constant in Ethereum and halves every 4 year in the case of Bitcoin), the proof of work hashing algorithm (Ethhash in Ethereum, and Sha 256 in Bitcoin), and the total supply (capped to 21 millions in the case of Bitcoin and uncapped in that of Ethereum) are the other differences that set both projects apart.\n\nEthereum Bitcoin Release Date July 30, 2015 January 9, 2008 Release Method Presale Genesis Block Mined Founder Vitalik Buterin Satoshi Nakamoto Blockchain Proof of Work (Will transition to Proof of Stake) Proof of Work Purpose Blockchain app platform, smart contracts & digital currencies Digital Money & store of value Native Cryptocurrency Ether (ETH) Bitcoin (BTC) Algorithm Ethash SHA-256 Block Time 12 – 14 seconds 10 minutes\n\nThe Ethereum Virtual Machine\n\nThe Ethereum Virtual Machine (EVM), is a 256-bit quasi-turning-complete virtual state machine that forms the runtime environment for smart contracts and specifies the execution model for such contracts.\n\nNote: “quasi” in here comes from the fact that computation is intrinsically bounded by a parameter, which is gas. The latter limits the amount of computation done\n\nThe machine is stack based, altogether separate from the main Ethereum Network, and has its own independent storage model.\n\nIn fact, all the nodes on the Ethereum Network run the EVM in addition to validating transactions.\n\nThe EVM could be seen as a testing ground for Smart contracts because once these contracts are deployed to the mainnet, such a step can’t be reversed.\n\nAny developer that wants to build on Ethereum, could deploy his/her untested code on this network of computers and see how it muddles along.\n\nThe most powerful aspect of the EVM is that it can be implemented into various different programming languages. So far, EVM iterations have been deployed in C++, Java, JavaScript, Python, Ruby, Haskell, Rust, Erlang, WebAssembly and more – promoting adoption and ensuring all developers can have fair access.\n\nThis is particularly important for interoperability with other blockchains, as it means that any other blockchain could essentially run and iteration of the EVM which could power smart contracts and DApps on their chain, without building a specific virtual machine for their own chain.\n\nBlockchains which currently use or offer versions of the EVM include Telos, Hyperledger Fabric, EOSIO, and others – and blockchains like Tron use virtual machines which are based on or compatible with EVM.\n\nEther (ETH) and Gas\n\nIn Ethereum each operation or work performed by the network has a cost assessed by the network which is known as a gas limit.\n\nIn order to execute a smart contract, for example, developers need to pay for all the operations featured in their code.\n\nSending Ether from one wallet to another one involves four gas units.\n\nThese gas units are checking your balance, transferring ETH to a receiving address, subtracting ETH from your balance and adding ETH to the receivers.\n\nSo gas units refer to the smallest measurement of work needed to settle a given operation but don’t have a monetary value.\n\nThe cost is paid in Ether. Gas is that unit that translates into Ether.\n\nSince Ethereum can only compute a limited number of gas units at any given time, miners are sort of bribed by network users to pace up the stream of request that is being sent over to the network.\n\nTo pay miners, small fractions of ETH named Gwei are attached to each gas unit, which sets the gas price.\n\nWhat everyone should remember is that the gas price is how much you pay per gas unit, and the gas limit is how much work you are requesting from the network.\n\nSmart Contracts – What Are They and How Do They Work?\n\nSmart contracts refer to computer codes that facilitate the exchange of value whether it is money, property or content.\n\nThey are called contracts because they translate the terms of an agreement, and smart because they automatically execute themselves once specific triggers are met.\n\nThe notion of smart contracts was around way before the advent of Bitcoin or Ethereum.\n\nQuick Fact: Nick Szabo a computer scientist, cryptographer, and law scholar, started pioneering work on the concept in 1977, with the aim to establish a distributed ledger for storing contracts.\n\nSimply put smart contracts are just like regular contracts in the real world, where two parties or more agree to specific terms of an arrangement and commit to sticking to it once signed.\n\nThe main difference is that Smart contracts are fully digital.\n\nFurthermore, when running on a Blockchain like the Ethereum Network, a smart contract acts as a self-operating computer code that automatically executes itself once specific conditions are met.\n\nBlockchain-based smart contracts are immutable and would run exactly as programmed once deployed without any possibility of censorship, downtime, reversing, or third-party interference.\n\nOther Blockchains Which Utilize Smart Contracts\n\nSmart contract enabling Blockchains are regarded by many as the “real deal,” this whole Blockchain revolution came up with since its rise to prominence.\n\nPut by Nick Szabo, the blockchain pioneer, himself:\n\n“New institutions and new ways to formalize the relationships that make up these institutions are now made possible by the digital revolution. I call these new contracts “smart” because they are far more functional than their inanimate paper-based ancestors. No use of artificial intelligence is implied. A smart contract is a set of promises, specified in digital form, including protocols within which the parties perform on these promises.”\n\nWe crafted a list of ten blockchains, other than Ethereum, that support Smart Contract programming and deployment.\n\nCardano: a project that caught a lot of media attention, and that is allegedly developing a smart contract platform that seeks to deliver more advanced features than its competitors do.\n\na project that caught a lot of media attention, and that is allegedly developing a smart contract platform that seeks to deliver more advanced features than its competitors do. EOS: a Smart Contract platform for industrial scale dApps deployments through a DAO model, commonly referred to as the alternative to Ethereum.\n\na Smart Contract platform for industrial scale dApps deployments through a DAO model, commonly referred to as the alternative to Ethereum. NEM: written in Java, the NEM platform is arguably one of the simplest to use since no specific platform programing language is required to code and deploy smart contracts on it.\n\nwritten in Java, the NEM platform is arguably one of the simplest to use since no specific platform programing language is required to code and deploy smart contracts on it. Waves: the underdog of this list, it is an open source smart contract platform that focuses on scalability and speed of settlements.\n\nthe underdog of this list, it is an open source smart contract platform that focuses on scalability and speed of settlements. Other interesting blockchain projects that could play an important role in the future of smart contracts, are Hyperledger Fabric, Lisk, NEO, Qtum, Stellar Lumens, and Tezos.\n\nEthereum Use Cases\n\nSmart contracts make Ethereum flexible, providing it with more real-world use cases than its predecessor Bitcoin.\n\nA combination of smart contracts and dApps keep developers intrigued and users interested in the network.\n\nAccording to ConsenSys, some industries and sectors where use cases for Ethereum can be found include:\n\nBanking and Financial Services:\n\nLarge banks routinely spend more than $200 million per year on cybersecurity. If the servers of a central bank were to go down, you would see the collapse of a country’s payment clearing system.\n\nHowever, if every bank within a payment network instead transacted through a blockchain, there would be no single point of failure.\n\nTherefore, a country’s interbank payment network could be maintained even if multiple servers were to go down.\n\nAlso, because the basic idea behind blockchains- creating a distributed, public and immutable ledger with a never-to-be-tampered with the record of transactions remains the same, the data behind the credit score of a user becomes more reliable for financial companies.\n\nRelated industries like insurance can also be hugely benefitted as they can disburse payments more easily to their customers.\n\nStartups and ICOs:\n\nEthereum empowers startups by letting them launch their own Initial Coin Offerings (ICOs).\n\nThese tokens, usually created using the ERC20 protocol, help startups in raising the funds needed to realize their goals.\n\nInterestingly, one of the largest crypto exchanges and companies in the world, Binance, used funding generated through the sale of BNB, a coin that follows the ERC20 standards.\n\nEven Tron, one of the largest blockchain projects in the world started out with an ERC20 token offering.\n\nDigital Identities:\n\nSince data and identity theft is such a menace, a smart contract solution is a good fit for this problem.\n\nUsing information hidden behind a dedicated smart contract, users could not only take their identities digital but rest assured that they do not reveal more than what they are comfortable sharing.\n\nServices like uPort allow users to take back control of their identities and share only the information they choose through their mobile devices.\n\nInformation can only be shared upon authentication from the user and the data is always stored safely on the Ethereum blockchain.\n\nSupply Chain:\n\nA major application for Ethereum smart contracts looks set to be in supply chain management where it could benefit both consumers and suppliers through more efficient tracking.\n\nWhether you want to know about the freshness of produce or the origins of the diamonds you bought for your wedding, blockchain-based smart contracts can help to deliver this. The supply chain system of the world is currently broken but not beyond repair.\n\nUsing an extensive network of smart contracts, companies can track their raw materials and the transportation of goods. They can accurately measure their manufacturing processes, related logistics and the process through which a product reaches a consumer.\n\nThe consumer, on the other hand, is provided with reliable information that instantly proves whether a product is fresh, authentic, fair trade, locally produced and more.\n\nOther major industries and applications where Ethereum could find many uses include Real Estate, Law, Oil and Gas, Energy Grid, Government, and Commodity Trade Finance and more as stated by ConsenSys.\n\nEthereum’s Most Popular dApps\n\nHere are some of the most popular dApps that run on the Ethereum blockchain:\n\nCryptoKitties:\n\nThe internet’s obsession with cats knows no bounds and when CryptoKitties was launched, it was evident that there would be more than a handful of interested players.\n\nThe game allows players to buy, sell, collect, and breed digital cats. Each cat is unique and has its own value.\n\nCryptoKitties received widespread attention from the media, the crypto community and the “uninitiated” people who may have never heard about cryptocurrencies and blockchains before when cats on the game started selling for thousands of dollars.\n\nCryptoKitties remains one of the most popular dApps and should be credited for evolving the scope of dApps from “work” to “play” while adding value to “digital asset ownership.”\n\nLocalEthereum:\n\nThe second-generation blockchain cousin of LocalBitcoins, LocalEthereum solves one BIG problem for buyers- removing middlemen from the crypto ecosystem.\n\nYou buy ETH over the counter using smart contracts and escrow services available on the platform.\n\nThe seller’s Ethereum is locked via a smart contract and is released only when they receive the agreed fiat currency from the buyer.\n\nIDEX:\n\nThe IDEX decentralized exchange is considered by some a thing of beauty, especially as it introduces Ethereum users to the idea of giving up on “centralized exchanges.”\n\nSome of the most popular dApps on Ethereum are decentralized exchanges- they are new, innovative and remove a big hurdle from the world of digital currencies, providing more power to the users.\n\nThe first adopters of IDEX were speculators, and the exchange enables a huge range of Ethereum and ERC20 tokens to be traded and exchanges.\n\nHowever, popular cryptocurrencies such as XRP, Litecoin, Bitcoin and Tron is not possible.\n\nEthlance:\n\nGiving other freelancing job platforms a run for their money, Ethlance allows users to work on gigs or projects of their choice without paying a hefty fee.\n\nThis could mark the beginning of the end of freelancers having to give away over 20% of their earnings to centralized platforms such as Upwork in “fees” and part with even more dollars to get the money in their local currency.\n\nEthlance, the decentralized freelance hiring platform allows you to work for zero fees. The only payment here is the gas utilized on Ethereum.\n\nUniswap Protocol Part decentralized application and part decentralized protocol, Uniswap provides automated liquidity on Ethereum, for Ethereum-based tokens – such as ERC20 tokens and certain ERC721 non-fungibles.Uniswap has quickly become one of the most popular apps on Ethereum, and many developers and liquidity providers use the protocol to make trading low market cap tokens easy and simple. Users can integrate Uniswap with Ethereum wallets such as MetaMask, which automatically links users tokens with the Uniswap protocol and lets traders easily swap their tokens for others.\n\nPart decentralized application and part decentralized protocol, Uniswap provides automated liquidity on Ethereum, for Ethereum-based tokens – such as ERC20 tokens and certain ERC721 non-fungibles.Uniswap has quickly become one of the most popular apps on Ethereum, and many developers and liquidity providers use the protocol to make trading low market cap tokens easy and simple. AAVE One of the most popular decentralized finance (Defi) lending protocols, AAVE has taken the crypto finance world by storm. AAVE is an open-source money market protocol build atop Ethereum, which lets users borrow assets, and lend out their assets in order to gain fixed interest back.AAVE, which means Ghost in Finnish to show the protocol’s transparency, has over $1.8 billion staked with it in assets which include DAI, USDC, TUSD, USDT, BUSD, ETH, BAT, LINK, REP, and a whole host of other popular assets. Users have either a ‘Deposit APY’, which is the interest that they will earn on their deposited assets and ‘Variable APY’ which is the amount borrowers pay back into the lending protocol. Many users leverage the AAVE protocol to borrow assets for short-term trading opportunities and to take advantage of market swings.\n\nOne of the most popular decentralized finance (Defi) lending protocols, AAVE has taken the crypto finance world by storm. AAVE is an open-source money market protocol build atop Ethereum, which lets users borrow assets, and lend out their assets in order to gain fixed interest back.AAVE, which means Ghost in Finnish to show the protocol’s transparency, has over $1.8 billion staked with it in assets which include DAI, USDC, TUSD, USDT, BUSD, ETH, BAT, LINK, REP, and a whole host of other popular assets. Other popular Ethereum dApps include FCK, Kyber, ForkDelta, Etheroll, and more.\n\nPros and Cons of dApps\n\nThe pros – Here are some of the key benefits of decentralized applications:\n\nFault tolerance – Systems use redundancy to remove the risk of accidental failure. If one element goes down the network still works, this means applications can run with zero downtime. Attack resistance – There is no single point of failure, as the applications run on the blockchain. This makes them impervious to denial-of-service (DDoS) attacks. Tamper & corruption proof – Applications run precisely as programmed removing the possibility of fraud, censorship or third-party interference. This makes it more difficult for an individual or group to act for its own benefit at the expense of everyone else. No middlemen – This removes exuberant fees and allows users to interact directly with each other (peer-to-peer). This can lead to greater transparency, trust, and privacy. Open source – An open-source protocol enables anyone interested in the dApp to collectively contribute to its development for the benefit of everyone.\n\nThe Cons – Here are some of the negatives of decentralized applications:\n\nSpeed – Currently the dApps can be quite slow with transactions also taking a long time. Scalability – The limit on how many transactions can be processed per second might be quite low which limits the dApps scalability. Fees – While in some ways the ‘compensating system’ is a benefit, it also means users have to pay each time they use the dApp.\n\nIt’s worth noting that solutions and new innovations are constantly occurring in the nascent dApp and blockchain industries, so the current ‘cons’ may well be overcome in the future.\n\nThe DAO Hack\n\nThe DAO was a project that crystallized most of what blockchain technology stood for since its inception, in both its business model and management structure.\n\nIt was created in 2016 by members from within the Ethereum community, notably the Slock.it developer team.\n\nThe DAO was conceived as a form of investor-oriented, stateless, decentralized venture capital firm after raising a record-breaking crowdfund sale of around $150 million worth of Ether in May 2016.\n\nUnfortunately, when things were looking up for the project, it turned out that there was a flaw in its source code, and that flaw was eventually preyed on.\n\nOn June 17, 2016, some hacker(s) exploited a loophole in the DAO smart contract and drained as much as 3.6 million ETH (around $70 million at the time) to a subsidiary account in just a few hours of the attack.\n\nIn fact, the attack was found to be made possible when the hacker(s) realized that the smart contract was mistakenly coded to check the internal balance after sending coins not the other way around.\n\nThe attacker(s) proceeded by requesting funds from the smart contract several times before the smart contract could update its balance.\n\nThe hack marked the beginning of the end for the DAO and had far-reaching consequences on the Blockchain space that are still tangible today.\n\nBesides delisting the DAO token off major exchanges in the months following the hack, and hard forking the Ethereum main chain, the incident caught the eye of regulatory watchdogs all over the world, and put a special emphasis on the necessity of placing the crypto sphere under close scrutiny.\n\nEthereum Classic Fork\n\nIn the wake of the DAO hack, the Ethereum community gathered and debated on the proper actions the foundation should take in order to handle the disastrous situation the hacking incident has cast over the project.\n\nThe community split into two fundamentally opposed groups.\n\nWhile one side suggested a hard fork to contain the hack, reverse it, and send the stolen funds back to their original wallets, the other side strongly opposed the move invoking ideological reasons, and arguing that prevailing with the code and trusting the smart contract under all circumstances, is the philosophy behind Blockchain, and failing to commit to it, could open the door for similar actions in the future.\n\nA vote took place in July 2016 and the decision to implement a hard fork to the Ethereum code and move the stolen Ether away to a new smart contract was agreed upon by a vast majority of the community including co-founders Gavin Woods and Vitalik Buterin.\n\nConsequently, a hard fork occurred on the main Blockchain at height 1,920,000, right before the hacking incident took place.\n\nThe offshoot kept the name Ethereum and named its fuel Ether, ETH.\n\nHowever, the other group, or “the code is law” advocates, decided to stick with the original chain, which became known as Ethereum Classic.\n\nEthereum Mining\n\nDid you know that Google CEO Sundar Pichai’s 11-year-old son mines Ethereum? The young one, Pichai says, understands a lot about cryptocurrency and has corrected him on occasion.\n\nDo you know as much about Ethereum mining as Pichai’s son?\n\nWell if not, don’t worry as we have all the information you need here to boost your knowledge on the subject.\n\nIn a nutshell, Ethereum mining is similar to Bitcoin mining.\n\nThe concept of mining, i.e., giving rewards to “miners” who create new blocks in the network in the form of a native cryptocurrency of the blockchain, is the same.\n\nHowever, the Ethereum blockchain is faster than Bitcoin’s, which means that blocks are created at a faster rate.\n\nIn the Bitcoin Network, a new block is created every 10 minutes while Ethereum achieves the same in 15 seconds.\n\nMiners on the Ethereum network receive ETH tokens along with all the gas contained within their block (gas is the fuel of all Ethereum transactions which manifests as code-processing and transaction fees on the blockchain).\n\nCan You Mine Ethereum With ASIC?\n\nYes, it is currently possible to mine Ethereum with ASIC.\n\nHowever, an Ethereum Core Development meeting recently pushed forward a proposal called ‘ProgPoW‘ that would make Ethereum ASIC resistant.\n\nHow Many Ethereum Nodes Are There?\n\nAccording to Ethernodes.org, the Ethereum mainnet hosts about 8,752 nodes at the moment. However, this figure changes on a daily basis.\n\nOf these, the largest majority of nodes are based in the USA while China, Canada, Germany, the UK, Russia, and more trail quite far behind.\n\nAre These Nodes Full Nodes?\n\nA full node is any computer that enforces all the rules of consensus on the Ethereum network and is connected to it.\n\nA full node must have the entire Ethereum blockchain downloaded on its computer.\n\nBy definition, all miners in the Ethereum network have to be full nodes. However, all full nodes do not have to mine the currency.\n\nThe nodes have a few important functions.\n\nThey have to ensure that all the miners are given the correct block rewards. They must ensure all transactions have the right signatures. They must check that all blocks and transactions are in the right data format. They must make sure there is no double-spending in the blocks.\n\nHow Can I Use Ether (ETH)?\n\nEther is one of the most versatile coins available in the cryptocurrency space today.\n\nAs the second-largest cryptocurrency in the world, Ether has many holders.\n\nPer the most recent CoinMarketCap data, Ether is valued at over $15 billion with 104 million coins in circulation currently.\n\nHere are a few of the common uses of ETH:\n\nFor making transactions:\n\nEther can be used as an alternative to using credit cards and wire transfers. However, to make a transaction with Ether both the sender and receiver must have an Ether wallet set up. For cross-border payments, Ether could work to be much cheaper and faster than traditional methods.\n\nFor buying ICO tokens:\n\nWhen participating in token sales, Ethereum is often a popular cryptocurrency of choice. As a large number of Initial Coin Offerings are offered using the Ethereum blockchain, it means that buying tokens from these projects using ETH becomes easier.\n\nFor making purchases in the real world:\n\nSeveral cryptocurrency startups are pushing for the adoption of digital currencies and helping in the installation of PoS machines and other methods that enable purchases using ETH.\n\nFor making digital purchases:\n\nMany websites now accept payment in Ether, and your dApps could also accept ETH payments, enabling you to purchase anything from extra lives in games to subscriptions of a magazine.\n\nFor trading/investing:\n\nEther is one of the most commonly available trading pairs for digital currencies used in exchanges around the world. You can purchase Ether and hold it as an investment or exchange it directly for other cryptocurrencies.\n\nHow Can I Store Ether (ETH)?\n\nOnce you have bought Ether, you will need an Ethereum wallet to store it securely.\n\nYou have the option to use hot wallets, cold wallets, hardware wallets, paper wallets, desktop or mobile wallets. There is one for all platforms; some options will be better suited in comparison to others.\n\nNote: Hot Wallets are connected to and can be accessed on the internet, whereas, cold wallets are very rarely or never connected to the internet. Due to this many consider cold wallets to be more secure than hot wallets.\n\nLet’s look into each option:\n\nHot wallets- exchange wallets:\n\nYou will most likely buy ETH on an exchange like Coinbase or Binance. These exchanges will provide you with a wallet where you can store your ETH.\n\nExchange hot wallets are easy to use, very simple and it’s usually easy to liquidate your holdings since your coins can be accessed on the exchange’s website.\n\nTherefore, exchange wallets can usually be accessed from multiple devices as long as you have a connection to the internet.\n\nThe problem with these wallets is that they could be more vulnerable to theft than others depending on the security of the exchange and your account.\n\nIf you trade regularly, then this is likely the best and most convenient option.\n\nCold wallets- hardware wallets:\n\nHardware wallets can offer their users extremely strong security when used correctly.\n\nThey are usually USB devices, and the market-leading provider of hardware wallets currently is Ledger.\n\nYou can store your Ether holdings on a hardware wallet for as long as you wish and rest assured that they cannot be reached by a hacker.\n\nJust make sure that you do not lose the device or tell anyone else your passwords.\n\nCold wallets- paper wallets:\n\nPaper wallets are considered the most secure way of storing your Ether safely away from malware and cyber-attackers.\n\nWith a paper wallet, you print your private keys, and Ether addresses and store them in a safe location.\n\nHowever, to many, this can seem like a big inconvenience when compared to using an exchange wallet for example.\n\nAgain, like with hardware wallets, it’s important to keep your paper wallet somewhere safe and never share the information with anyone else.\n\nDesktop and mobile wallets:\n\nAs the name suggests, desktops and mobile wallets can be distinguished based on the devices where they are being used.\n\nDesktop wallets can be more functional, while mobile wallets provide more convenience.\n\nMobile and desktop wallets can usually only be used on the device where they are installed. Therefore, if you lose the device, this will put your funds at risk.\n\nSome mobile/desktop wallets will be specifically designed for storing Ether and ERC20 tokens, whereas some will allow you to hold a wide range of cryptocurrencies together.\n\nWhich Is the Best Ethereum Wallet?\n\nGiven that there is such a wide range of wallet options out there, it begs the question, which ones are best?\n\nWell, to help answer that question, here are some of our handpicked favorites:\n\nHardware wallet – Ledger Nano S\n\nThe Ledger Nano S squeezes both advanced security and ease of use into one package.\n\nOur guide to storing cryptocurrencies securely on a Ledger Nano S can be found here.\n\nDesktop wallet – MetaMask\n\nThis simple, easy to install and easy to use browser-based wallet lets you connect to Ethereum and a host of dApps hosted on the blockchain instantly.\n\nMetaMask is a highly popular wallet which has also received funding and support from ConsenSys and Ethereum.\n\nFake versions of this wallet are out there so be sure to download a legit version.\n\nBasic Wallet – Mist Wallet\n\nIf you are looking for nothing but the bare basics, then the Mist Wallet is the right choice for you.\n\nIt was created by the Ethereum Foundation for a no-frills, no-distraction experience and is listed as the most basic wallet available on ethereum.org.\n\nMulticurrency Wallet – Exodus\n\nIf you hold numerous cryptocurrencies and want a well-designed wallet that eliminates the need for multiple crypto wallets, then Exodus could be a good choice.\n\nExodus is is fairly popular amongst crypto users and some cool features, including the portfolio feature where you can track your holdings.\n\nWeb Wallet – MyEtherWallet\n\nMyEtherWallet is one of the most popular Ether wallets out there.\n\nAs a web wallet, it allows you to log in from any device, which does bring some security risks.\n\nHowever, these risks can be mitigated if it’s paired with a hardware wallet such a the Ledger Nano S.\n\nMobile Wallet – Trust Wallet\n\nTrust Wallet is now Binance’s official cryptocurrency wallet, and the app is available to download on both iOS and Android devices.\n\nIt supports Ether and all Ethereum network tokens such as ERC20 tokens, as well as many other leading cryptocurrencies such as Dash, Tron, Litecoin, Bitcoin, and more.\n\nWhere Can I Buy or Sell Ethereum?\n\nCryptocurrency exchanges are the most common choice for buying or selling Ethereum.\n\nCryptocurrency exchanges can be centralized or decentralized.\n\nThe world’s three largest cryptocurrency exchanges are:\n\nBinance OKeX Huobi\n\nOther prominent exchanges include:\n\nCoinbase\n\nBitfinex\n\nUpbit\n\nKraken\n\nDigifinex\n\nEther is available to buy, sell, and trade on all of these exchanges. As Ether is a leading digital coin, it is available on most cryptocurrency exchanges.\n\nDifferent payment methods for purchasing Ether on exchanges include by credit/debit card, with fiat currencies, and with cryptocurrencies or stablecoins. The fees charged by different exchanges will vary and will also depend on the payment method.\n\nOther options include cryptocurrency ATMs where you can buy Ether with cash, trading Ether peer-to-peer on LocalEthereum, and using conversion exchanges like Changelly and Shapeshift to swap fiat-to-ether or crypto-to-ether instantly.\n\nIs Coinbase Safe?\n\nCoinbase is a leading and popular cryptocurrency exchange based in the US. Currently, over 18% of the platform’s volume comes from ETH/USD trades.\n\nFor people using the exchange’s services, Coinbase provides a hot wallet which can be used to store currencies.\n\nCoinbase holds over 98% of its user’s funds offline and takes other security measures, which prevents thefts and hacks from damaging user’s holdings.\n\nAny funds stored online by Coinbase are covered by insurance.\n\nCoinbase also enables two-factor authentication for the users, further protecting them from unauthorized access of accounts.\n\nCoinbase also runs a bug bounty program with an active community of security researchers that help to keep the platform safe.\n\nNone the less, some users still may want to take full control of their security rather than rely on an exchange. If so, using one of the secure methods mentioned above such as a hardware wallet or paper wallet would be a good option.\n\nHow Much Is Ethereum Worth?\n\nAs of December, 2021, the price of Ether currently stands at $2248 with a market capitalization of $274 billion.\n\nIn November and December 2015, Ether traded below the $1 mark.\n\nHowever, a year later, between October and December 2016, Ether’s price was nearing $10.\n\nIn June 2017, prices went as high as $377.56 with market capitalization reaching over $34 billion.\n\non January 13, 2018, the price of Ether reached an all-time high near $1,400, with a market capitalization of $133 billion.\n\nSince then, Ethereum has witnessed a massive sell-offs and tumbling prices in an unwavering bear market.\n\nHowever, like with all markets, a boom and bust cycle exists, and now everyone is waiting for a new bull market, with hopes that Ether could one day make an all-time high again.\n\nEthereum Price Predictions From Big Names\n\nEthereum has caught the attention of many crypto enthusiasts as well as prominent personalities from the traditional finance sector. Some have also made predictions about Ethereum’s price. Let’s look at what they had to say.\n\nJeff Reed considers Ethereum more valuable than Bitcoin:\n\nCrypto author Jeff Reed believes that Bitcoin and Ethereum have little in their way to stop them from becoming alternative currency systems. He said:\n\n“You can conceivably trade anything using Ethereum, but this is not Ethereum’s strength in comparison to other cryptocurrencies – they can all do this. It’s rather the computing language that allows the smart contracts to exist that makes Ethereum more valuable than BTC (in my opinion).”\n\nSteven Nerayoff predicted $3,000:\n\nCo-creator of Ethereum, Steven Nerayoff noted that billions of dollars were being poured into the Ethereum ecosystem in Jan 2018, through ICOs. He was vouching for a $3000 price tag on Ether by the end of 2018, but unfortunately, this did not materialize.\n\nNigel Green sticks to $2,500:\n\ndeVere Group CEO Nigel Green suggested that Ethereum could reach $2500 by the end of 2018, followed by further increases in 2019 and 2020.\n\nHe said:\n\n“The price of Ethereum is predicted to increase significantly this year, and could hit $2,500 by the end of 2018 with a further increase by 2019 and 2020. This general upswing will be fueled by three mains drivers. First, more and more platforms are using Ethereum as a means of trading. Second, the increased use of smart contracts by Ethereum. And third, the decentralization of cloud computing.”\n\nWho Is the Founder of Ethereum?\n\nRussian-Canadian programmer Vitalik Buterin is the co-founder of Ethereum.\n\nBREAKING NEWS: I hereby announce that I, Vitalik Buterin, am the founder of ethereum. — vitalik.eth (@VitalikButerin) May 2, 2016\n\nVitalik conceived the idea of Ethereum and released a white paper in 2013 describing in detail its design and rationale.\n\nVitalik had already been interested in Bitcoin and cryptocurrencies since 2011. He co-founded the news website named ‘Bitcoin Magazine’ where he published hundreds of articles and was also involved with the privacy-focused Dark Wallet project.\n\nIt was during this time that Vitalik came up with the idea of a single blockchain that could be reprogrammed to create custom decentralized applications rather than having to develop a whole new blockchain.\n\nIn January 2014 Vitalik formally announced Ethereum at the North American Bitcoin Conference in Miami and started working with Dr. Gavin Wood who he went on to co-found Ethereum with.\n\nIn July 2014 they launched a 42-day public sale of Ethereum tokens known as ‘Ether’ raising more than $18 million, which was the most successful ever crowd sale at the time.\n\nThe Ethereum platform went live and launched a year later on June 30, 2015, allowing developers to start creating and running decentralized applications.\n\nThe Founding Team\n\nApart from Vitalik Buterin, other people were also involved in designing and perfecting the concept of Ethereum.\n\nThe most prominent among them is doctor Dr. Gavin Wood who wrote the “technical bible” called Ethereum yellow paper, which outlines the details of the Ethereum Virtual Machine (EVM).\n\nDr. Joseph Lubin is another prominent name who later built ConsenSys, a Brooklyn-based startup focusing on the Ethereum ecosystem.\n\nWhen the project was publicly announced in 2014, the core team consisted of Vitalik Buterin, Mihai Alisie, Anthony Di Lorio and Charles Hoskinson.\n\nHow Can Programmers Use Ethereum?\n\nEthereum is a single blockchain with a built-in programming language. It serves as a platform where programmers can create, use and run many different types of decentralized applications.\n\nThis has led to Ethereum being described as ‘The World Computer’ where just like with conventional computers the potential uses depend in part on the creativity of its users.\n\nTo get started, programmers can start learning more about the foundational concepts of blockchains- decentralization and cryptography.\n\nThey must familiarize themselves with the key feature of the Ethereum blockchain, smart contracts, as well as other components like GAS, Ether (ETH), and the Ethereum Virtual Machine.\n\nProgrammers will also need to learn Solidity, the programming language used for Ethereum.\n\nWhat is Solidity?\n\nSolidity is the programming language used for creating smart contracts on Ethereum.\n\nAccording to Blockchain Council, Solidity is a high-level programming language, and the syntax is similar to the JavaScript scripting language.\n\nSolidity was initially proposed by Gavin Wood in August 2014.\n\nIt was then developed by Gavin Wood, Alex Beregszaszi, Christian Reitwiessner, Yoichi Hirai, Liana Husikyan, and other former Ethereum core contributors.\n\nIt was designed to enable the writing of smart contracts on platforms like Ethereum.\n\nFor programmers who are well versed in JavaScript or C, Solidity will seem relatively proverbial.\n\nWhile Solidity is a fairly new language, there are numerous experts working on it, and there is ample documentation available to help new programmers who want to learn the basics.\n\nEthereum has struggled with some scalability issues which could be a hurdle to the widespread adoption of the platform and Ether.\n\nEthereum wants to overcome these hurdles with Ethereum 2.0, also called the ‘Casper’ Upgrade. The upgrade was originally expected to arrive in 2019, although there are still many technical hurdles to overcome.\n\nIn August 2020, Ethereum 2.0 developers outlined several issued with the Medalla testnet, which was the first testnet that Ethereum 2.0 community members could use. The first issue was staking participation, which was fairly low – especially with Nimbus and Lodestar clients failing to verify some blocks and causing a 10% gap in expected staking – with a 57% staking participation. This number was also lower because some staking participants were offline when the network went live.\n\nIt will include concepts like sharding which is expected to make the blockchain faster and more efficient. We will examine more on sharding later in this article. Once successfully upgraded, Ethereum 2.0 will then start on its journey moving towards Ethereum 3.0 which will provide the network with security against the power of quantum computers.\n\nScaling\n\nScaling could be considered the Achilles’ heel of the Ethereum network; however, a lot of work is being done in the background to try and overcome this.\n\nAs Ethereum is not just a single blockchain, it also allows users to create their own blockchain-based projects on the original Ethereum blockchain.\n\nFurthermore, over 1400 dApps are running on Ethereum currently which means that the network already has a large number of users and processes millions of transactions.\n\nThe problem begins when the number of apps, projects, and users increases to a level where the Ethereum blockchain nodes are unable to handle the ever-increasing amount of transactions.\n\nIn fact, when the CryptoKitties game on the Ethereum network went viral in late 2017, the network became congested and saw a 600% increase in pending transactions. This surge resulted in the network slowing down and expensive transactions fees, therefore, reducing the usability/viability of Ethereum applications.\n\nThe solutions currently being developed to overcome the scaling issue include:\n\nCasper – The upgrade that will set to bring about Ethereum 2.0 and move Ethereum to a Proof-of-Stake protocol. It is expected to occur in 2019.\n\n– The upgrade that will set to bring about Ethereum 2.0 and move Ethereum to a Proof-of-Stake protocol. It is expected to occur in 2019. Sharding – Splits up the entire network into separate ‘shards’. Each independent shard and its allocated nodes can process certain transactions, rather than the entire network processing each transaction, therefore, increasing throughput.\n\n– Splits up the entire network into separate ‘shards’. Each independent shard and its allocated nodes can process certain transactions, rather than the entire network processing each transaction, therefore, increasing throughput. Serenity – A new blockchain system that would be connected to Ethereum. The goal would be to move all the existing Ethereum applications here where they would be “sort of folded into a contract on one shard of the new system.”\n\nProof of Stake vs. Proof of Work\n\nProof of Stake (PoS) and Proof of Work (PoW) are two popular types of blockchain consensus mechanisms.\n\nA consensus mechanism is used to verify and validate the information that’s being added to the blockchain ledger. This ensures that there is no double-spending or other invalid data is being added to the blockchain. It also prevents the networks from being harmed through constant forking.\n\nThere are pros and cons to each consensus mechanism, but, they all aim to serve the same purpose. A primary difference between consensus mechanisms is how the verification of transactions are delegated and rewarded.\n\nEthereum currently uses a Proof of Work system, but the Casper upgrade will start the transition of Ethereum to a Proof of Stake system. The new system will also have a penalty system built in to punish malicious actors.\n\nGood Audience state that:\n\n“The penalty system has the additional benefit of deterring 51% attacks. In a PoW system, a 51% attack is costly but repeatable as long as enough hashing power has been collected. With PoS, the attackers run the risk of losing their stake should the attack fail. In such a case, the only way to relaunch an attack would be to acquire new Ether.”\n\nCasper, Sharding & Ethereum 2.0\n\nThe roadmap to Ethereum 2.0 consists of two combined upgrades, which are Casper and Sharding, as is designed to bring scalability and security benefits to Ethereum. It may take several years for these both to be implemented fully and form Ethereum 2.0.\n\nDespite that Casper and Sharding will be combined to form Ethereum 2.0, both are separate projects that will have different phases and implementation and completion times.\n\nThe Casper protocol is a proof of stake consensus mechanism that forms a major part of Ethereum 2.0 roadmap. With Casper, validators will have to set aside part of their Ether as a stake.\n\nWhen blocks are discovered by validators which they think should be added to the Ethereum blockchain (validated), they will make a bet on it in Ether. If the block is appended to the chain then the validators are rewarded based on their bet sizes.\n\nAs mentioned above it will have built-in mechanisms for punishing malicious actors on the protocol which will ensure that they cannot game the system and that the system remains trustless. Validators acting badly will have their stakes removed.\n\nSharding, on the other hand, will divide the network into separate shards. Each shard will be designated to process specific transactions, which it can do so on its own.\n\nCurrently, the entire network is needed to process each transaction, which is likely an excessive use of the network’s resources. That’s why implementing sharding could significantly increase throughput on Ethereum and enable greater scaling.\n\nThis is how Vitalik Buterin explains sharding:\n\n“Imagine that Ethereum has been split into thousands of islands. Each island can do its own thing. Each of the islands has its own unique features, and everyone is belonging on that island, i.e., the accounts, can interact with each other AND they can freely indulge in all its features. If they want to contact other islands, they will have to use some sort of protocol.”\n\nConclusion\n\nEthereum’s contribution to the blockchain/crypto world is enormous. Ethereum has opened up new possibilities with blockchain through the introduction of smart contracts, decentralized applications, and tokenized economies.\n\nThere is no doubt that Ethereum is still a work in progress. It has some issues, especially those related to scaling and the solutions needed will not just come overnight.\n\nThe future of Ethereum depends on how widely adopted and powerful the network becomes as well as the creativity and talent of the developers who use the platform. Ethereum indeed appears to be heading in the right direction, gaining the attention of many large corporations and institutions.\n\nThe Enterprise Ethereum Alliance currently has over 386 members that support and back Ethereum related developments. Members include heavy hitters like Intel, JPMorgan, Microsoft, BP, and even the Indian Government.\n\nNo one can predict for sure what impact Ethereum will have, just like in the 1990’s no one knew how much the internet would impact the world. It’s still early days for Ethereum, but it certainly has the potential to be a revolutionary platform."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zZWMtZGVsYXlzLWdyYXlzY2FsZS1zcG90LWV0aGVyZXVtLTA1MTIzMjM5NC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "SEC Delays Grayscale Spot Ethereum ETF Decision, Extends Review to January 2024 - Yahoo Finance",
        "content": "SEC Delays Grayscale Spot Ethereum ETF Decision, Extends Review to January 2024\n\nThe United States Securities and Exchange Commission (SEC) announced it will delay its decision on Grayscale's proposed Ethereum spot ETF. The SEC needs more time to assess a proposed rule change that would allow NYSE Arca to list and trade shares of the Grayscale Ethereum Trust.\n\nThe SEC has allocated a longer period to evaluate the proposed rule change and has set January 25, 2024, as the deadline for its decision or the initiation of proceedings to determine its disapproval. The SEC emphasized the importance of having sufficient time to thoroughly consider the proposal and the concerns raised.\n\nWhile the SEC has approved investment vehicles tied to crypto futures in the past, it has not yet given approval for a spot BTC or ETH ETF on a U.S. exchange. Bloomberg ETF analyst James Seyffart speculated that if the commission approves a spot BTC ETF, it could potentially proceed with approving funds from multiple firms simultaneously.\n\nGrayscale submitted its filing in October, seeking to convert shares of its Grayscale Ethereum Trust into an Ether ETF. The company is among other firms, including BlackRock, Hashdex, ARK 21Shares, Invesco Galaxy, VanEck, and Fidelity, awaiting a decision from the SEC regarding their spot crypto ETF applications.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZW5nLmFtYmNyeXB0by5jb20vZXRoZXJldW0tY2FuLXJlYWNoLTM1MDAtYnV0LW9ubHktb24tdGhpcy1jb25kaXRpb24v0gFRaHR0cHM6Ly9lbmcuYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1jYW4tcmVhY2gtMzUwMC1idXQtb25seS1vbi10aGlzLWNvbmRpdGlvbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Ethereum can hit $3500, but only on this condition - AMBCrypto English",
        "content": "An analyst predicted ETH’s rise towards $2,600, and further up to $3,500.\n\nHolders stand to gain 7.73% if they sell their holdings at the prevailing price.\n\nDecember started on a rollicking note for Ethereum [ETH]. Over the weekend, the second-largest digital asset by market cap surged nearly 10%, extending the momentum it gained over the last month.\n\nAs of this writing, ETH was exchanging hands at $2,248.11, up 3.91% in the last 24 hours, according to CoinMarketCap.\n\nIn a quote shared with AMBCrypto, Ryan Lee, Chief Analyst of Bitget Research, ascribed the latest upswing to strong expectations of interest rate cuts by the Federal Reserve in 2024.\n\nHe said:\n\n“Given the potential for a recession in the U.S. economy, fund managers are predicting an 80% consensus level for a trend of interest rate reduction in 2024, marking the highest consensus level ever recorded. The crypto market has already factored in this positive news.”\n\nAdd to this, the enthusiasm around spot exchange-traded funds (ETFs) was reaching a fervor pitch. The number of spot Ether ETF applications submitted to the U.S. Securities and Exchange Commission (SEC) rose to seven in November.\n\nBig expectations from ETH\n\nIt was but natural for investors to be optimistic about ETH.\n\nIn a post on X (formerly Twitter) dated the 3rd of December, crypto technical analyst Ali Martinez predicted that ETH could move to $3,500, provided the weekly candlestick closed at $2,150.\n\n#Ethereum | If $ETH secures a sustained weekly candlestick close above $2,150, the path might be set for an exciting uptrend. Targets in sight? We could be looking at #ETH marching towards $2,600, and possibly even soaring to $3,500! pic.twitter.com/EWg3mtZeo6 — Ali (@ali_charts) December 3, 2023\n\nFurthermore, he emphasized the relevance of the $1,900-$2,100 range in another of his posts. Previously, as many as 5.85 million addresses bought 43.8 million ETH in this range, indicating a probable surge in purchasing in the days ahead.\n\nWill profit-taking interrupt the flow?\n\nHaving said that, the momentum could be stemmed if traders decide to lock in gains. According to AMBCrypto’s analysis of Glassnode’s NUPL metric, all holders would make profits if they sold their assets at the time of writing.\n\nRealistic or not, here’s ETH’s market cap in BTC’s terms\n\nAMBCrypto digged in further using Santiment’s MVRV ratio. It came to light that all holders stand to gain 7.73% if they sell their holdings at the prevailing price.\n\nIt would be interesting to see if holders allow ETH to ascend or make some money after a challenging bear market."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMTIvMDYvZXRoZXJldW1zLWNlbnNvcnNoaXAtcHJvYmxlbS1pcy1nZXR0aW5nLXdvcnNlL9IBW2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMTIvMDYvZXRoZXJldW1zLWNlbnNvcnNoaXAtcHJvYmxlbS1pcy1nZXR0aW5nLXdvcnNlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Ethereum's 'Censorship' Problem Is Getting Worse - CoinDesk",
        "content": "But even some of those solutions raise problems. For instance, some users who wish for their transactions to remain uncensored have opted to use \"private mempools\" – issuing transactions directly to builders, rather than Ethereum's mempool, to guarantee their inclusion. While this can help circumvent the censorship problem, it's not hard to see how the normalization of private order flow might introduce different problems to the network – like higher fees, less transparency and the same sorts of middlemen that blockchains were built to avoid."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1idWxsLXJ1bi0yNTAwL9IBRmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1idWxsLXJ1bi0yNTAwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price Bull Run Could Extend By 5%, Why ETH Could Rally To $2,500 - NewsBTC",
        "content": "Ethereum price is gaining pace above the $2,200 resistance. ETH is up over 8% and might continue to rise toward the $2,500 resistance in the coming days.\n\nEthereum is gaining pace and recently surpassed the $2,250 resistance.\n\nThe price is trading above $2,200 and the 100-hourly Simple Moving Average.\n\nThere is a key bullish trend line forming with support near $2,225 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could extend its rally if it clears the $2,275 resistance zone.\n\nEthereum Price Follows Bitcoin\n\nEthereum price started a strong increase above $2,000, like Bitcoin. ETH cleared many hurdles near $2,120 to enter a positive zone. The price even surged above the $2,200 level to set the tone for a larger increase.\n\nA new multi-month high was formed near $2,275 and the price is now consolidating gains. There was a minor move below the 23.6% Fib retracement level of the upward move from the $2,148 swing low to the $2,275 high. However, Ethereum is still trading above $2,200 and the 100-hourly Simple Moving Average.\n\nThere is also a key bullish trend line forming with support near $2,225 on the hourly chart of ETH/USD. On the upside, the price is facing resistance near the $2,250 zone.\n\nSource: ETHUSD on TradingView.com\n\nThe next key resistance is near the $2,275 level. A clear move above the $2,275 zone could send the price toward the $2,320 level. The next resistance sits at $2,350. Any more gains could start a wave toward the $2,500 level.\n\nAre Dips Limited in ETH?\n\nIf Ethereum fails to clear the $2,250 resistance, it could start a downside correction. Initial support on the downside is near the $2,220 level and the trend line.\n\nThe next key support is $2,175 or the 76.4% Fib retracement level of the upward move from the $2,148 swing low to the $2,275 high. The main support is now near $2,150 or the 100-hourly Simple Moving Average. A downside break below $2,150 might start a steady decline. The key support is now at $2,080, below which there is a risk of a move toward the $2,020 level in the near term.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 level.\n\nMajor Support Level – $2,175\n\nMajor Resistance Level – $2,250\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS12ZXRlcmFuLXRyYWRlci1wZXRlci1icmFuZHQtcHJlc2VudHMtdGhyZWUtbmFycmF0aXZlcy1mb3ItZXRoLXByaWNl0gFgaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtLXZldGVyYW4tdHJhZGVyLXBldGVyLWJyYW5kdC1wcmVzZW50cy10aHJlZS1uYXJyYXRpdmVzLWZvci1ldGgtcHJpY2U_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Ethereum: Veteran Trader Peter Brandt Presents Three Narratives for ETH Price - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nVeteran trader Peter Brandt comments on Ethereum price action as the market embarks on a fresh crypto rally.\n\nAdvertisement\n\nBitcoin, the largest cryptocurrency by market capitalization, surged to $44,000 for the first time since April 2022. Ethereum, the coin linked to the Ethereum blockchain network, also soared in response to the bullish impulse, touching highs of $2,312 in today's trading session.\n\nIn a new tweet, Brandt asks his 705,100 followers if Ethereum will emerge from the shadows anytime soon. He says that at least three narratives are possible, about which he launched a poll for his followers to participate in.\n\nVisual for reference pic.twitter.com/16YP1sZMQL — Peter Brandt (@PeterLBrandt) December 6, 2023\n\nBrandt's three narratives include a classic wedge that targets the $900 price for ETH. The second narrative is a running wedge pattern, which, if verified, has a price target of $3,300.\n\nThe famed trader's third narrative is \"Morphology ahead,\" which could imply that the Ethereum price action is still brewing and in the process of taking a particular form or structure. Brandt provides a visual representation of these price patterns.\n\nThe first option, the classic wedge, received 24% of votes in favor. The amount of 60.7% of respondents voted for the more likely option of a running wedge with a target of $3,300 given the current market standing. A total of 15.3% of the respondents voted for the 'Morphology ahead' option.\n\nTypically, a wedge pattern can indicate either bullish or bearish price reversals. A rising wedge (which indicates a bearish reversal) or a descending wedge (which indicates a bullish reversal) are the two types of wedge patterns.\n\nAt the time of writing, ETH had gained 2.16% in the previous 24 hours and was trading at $2,264.\n\nIn ETF-related news, the Securities and Exchange Commission (SEC) has announced that it will take more than 45 days to review a rule change that would allow Grayscale to transform its Ethereum trust into an Ethereum spot ETF. The new deadline has been set for Jan. 25, 2024."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3NhZmUtd2ViM2F1dGgtZXRoZXJldW0tc21hcnQtYWNjb3VudHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Safe wants Ethereum users to create wallets with emails — not seed phrases - Blockworks",
        "content": "Developers have a new way to build social logins into blockchain applications following a partnership between smart contract wallet Safe and Web3Auth.\n\nThe tool, SafeAuth, combines Web3Auth’s social login technology with Safe’s Account Abstraction software development kit (SDK)\n\nSmart accounts were introduced via the ERC-4337 standard, built to improve the general Ethereum user experience through more intuitive and customizable crypto wallets.\n\nSafeAuth enables users to set up smart wallets using an existing email address, removing the need to remember lengthy seed phrases.\n\nThese smart accounts will also be interoperable, meaning that users will be able to link and interact with different blockchain applications through a single smart account.\n\nThe ERC-4337 standard was deployed to Ethereum mainnet in March and data shows adoption has remained relatively slow, with weekly retention of smart wallets that use ERC-4337 dropping to as low as 1% for accounts older than five weeks.\n\nLukas Schor, a Safe co-founder, told Blockworks this should not be surprising as adoption often takes longer than people wish.\n\n“The ERC-4337 standard is still in ‘draft mode’ and occasional changes … are still happening, making it harder for in-production solutions to adopt it,” Schor said.\n\nSchor said that ERC-4337 also introduced additional smart contract risk, meaning it may take time for larger applications and wallets to opt in.\n\n“Currently, the primary use-case for ERC-4337 is sponsored transactions for ‘free NFT drops’ or similar applications; we are still missing applications to leverage more complex features of accounts abstraction like recovery or sessions keys,” he said.\n\nRead more: Ethereum’s ERC-4337 Account Abstraction Smart Contract is Live\n\nTobias Schubotz, Safe’s product lead, shared optimism about the future of smart accounts. He said Safe itself has seen a 201% increase in monthly average users, now totaling more than 376,000.\n\n“This indicates that Safe is being adopted faster than the overall crypto space, suggesting a growing interest and potential for smart accounts in the broader blockchain ecosystem,” Schubotz said.\n\n“At the core of this solution is adaptability, users can choose additional authentication, such as multiple email addresses, as they deem necessary,” he said. “Similar to how one might employ a social login or email for various online platforms, SafeAuth offers a unified access method.”\n\nSchubotz added that developer tooling such as SafeAuth can also assist in increasing the adoption of smart account standards such as ERC-4337.\n\n“By offering an SDK that enables developers to seamlessly integrate a social login feature into their platform, Safe is further encouraging the adoption of smart accounts,” he said.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9ncmF5c2NhbGVzLWV0Zi1zZWMtZXRoZXJldW0tZGVjaXNpb24v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Grayscale's ETF Game Against SEC Fails as Agency Delays Ethereum Decision - CCN.com",
        "content": "Key Takeaways\n\nGrayscale’s hopes of launching a spot Bitcoin ETF were boosted by a legal victory over the SEC.\n\nThe firm has attempted to play the same move in its parallel Ethereum ETF bid.\n\nHowever, the Commission has nonetheless stalled a decision on Grayscale’s application.\n\nIn its efforts to list crypto exchange-traded funds (ETFs) on the NYSE Arca stock exchange, Grayscale is engaged in a strategy game with the U.S. Securities and Exchange Commission (SEC).\n\nThe prize? Permission to launch the first spot crypto fund in the U.S. But the SEC’s stall and delay tactics might have Grayscale trumped.\n\nGrayscale Attempts Multipronged ETF Attack\n\nAlthough asset managers’ efforts to launch spot Bitcoin ETFs have dominated the headlines, many of the same contenders are pursuing parallel bids to list equivalent Ethereum funds.\n\nAfter the SEC shut down its application to convert an existing BTC trust into an ETF, Grayscale won a key legal victory that has dramatically improved its chances of approval. In that case, the firm argued that it was unfair to forbid ETFs from investing in Bitcoin spot markets when they had permission to invest in crypto futures.\n\nOn the surface, it appears as if the same logic should apply to Grayscale’s ETH trust. However, a technical difference in the way of filing existing Ethereum futures ETFs could undermine any such legal argument.\n\nIn its lawsuit against the SEC, Grayscale presented a 19b-4 futures ETF approval letter as evidence. However, current Ethereum funds received approval through a different process, and there is no equivalent letter the firm could present to make the same case again.\n\nI was initially unsure why they would even file for this. But my thoughts have evolved over the last few weeks and they are basically this:\n\nGrayscale is playing Chess, not checkers here. They're likely hoping to force the SEC into issuing a 19b-4 decision on an ETH futures ETF.… — James Seyffart (@JSeyff) November 15, 2023\n\nAccordingly, when Grayscale filed its own 19b-4 ETH futures application in September, analysts lauded the move for its strategic genius, which could potentially force the SEC to accept spot Ethereum ETFs or risk another defeat in court.\n\nSEC Continues To Delay\n\nSo, has Grayscale checkmated its opponent, or does the SEC have one last ace up its sleeve?\n\nAt the very least, the agency has bought itself more time, announcing its intention to postpone a decision on the Grayscale Ethereum Trust on Tuesday, December 05.\n\nHere was the most recent list I put out. You can see 12/6 as the next date. pic.twitter.com/uZ6fOmPwFV — James Seyffart (@JSeyff) December 5, 2023\n\nIn its response to the proposed conversion, the commission said it needed more time to consider and extended the deadline for approval or disapproval until January 25, 2024.\n\nBy that time, the agency could have approved one or more spot Bitcoin ETFs, which it is currently bashing out the fine details of with Grayscale and others.\n\nOf course, nothing will be certain until the first spot crypto fund hits the market, but if Bitcoin ETFs do arrive soon, they will likely set the mold for any Ethereum-based funds that follow."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vYmxvY2tjaGFpbi5uZXdzL25ld3Mvc2VjLXBvc3Rwb25lcy1kZWNpc2lvbi1vbi1ncmF5c2NhbGUtZXRoZXJldW0tdHJ1c3RzLWV0Zi1hcHBsaWNhdGlvbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "SEC Postpones Decision on Grayscale Ethereum Trust's ETF Application - Blockchain.News",
        "content": "The SEC has extended its review period for Grayscale's Ethereum ETF application to January 2024, reflecting a careful evaluation approach towards cryptocurrency ETFs.\n\nRecently, the Securities and Exchange Commission (SEC) of the United States of America made an announcement that they will be extending the decision-making time for the Grayscale Ethereum Trust's application for a spot exchange-traded fund (ETF). In the past, the SEC had planned to reach a decision by December 6, 2023; however, they have now decided to postpone this until January 25, 2024. With this step, the regulatory body is demonstrating that it is taking a careful and comprehensive approach to the fast developing world of bitcoin exchange-traded funds (ETFs).\n\nA significant participant in the investing of digital currencies, Grayscale Investments, submitted a Form 19b-4 in October with the intention of converting its Grayscale Ethereum Trust into a spot exchange-traded fund (ETF). A significant amount of assets, totaling $5 billion, are managed by this trust, which has been active since March 2019 and has been conforming to SEC reporting criteria since October 2020. Grayscale's strong position in the Ethereum investment scene is shown by this statistic, which shows that it accounts for a hefty 2.5% of all ETH that is currently in circulation.\n\nIt is not an unusual occurrence that the SEC has decided to defer the decision. It is in line with their recent decision to postpone a decision about the Hashdex Nasdaq Ethereum ETF, which intends to combine spot ether and futures contracts. That decision was made. The SEC's pattern of deferrals demonstrates that it takes a cautious approach to new and complicated investment vehicles such as exchange-traded funds (ETFs) that deal with cryptocurrencies . The Securities and Exchange Commission (SEC) has consistently delayed the approval of any spot ether or bitcoin fund, which reflects its emphasis on full review in the middle of the complex dynamics of cryptocurrency markets. This cautious posture is reflected in the SEC's continuous delays.\n\nGrayscale and other companies, including BlackRock, Hashdex, ARK 21Shares, Invesco Galaxy, VanEck, and Fidelity, are now waiting for the SEC to make a judgment on their applications for spot crypto exchange-traded funds (ETFs). The cryptocurrency investing community is actively monitoring the situation. Regardless of whether the verdict is favorable or unfavorable, it will have a huge impact on the future of cryptocurrency exchange-traded funds (ETFs) and their incorporation into mainstream finance. With its extended review timeframe, the Securities and Exchange Commission (SEC) demonstrates its dedication to conducting a thorough review process, with the goal of ensuring market stability and protecting investors.\n\nImage source: Shutterstock"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS9ldGhlcmV1bS1wcmljZS1mb3JlY2FzdC1ldGhlcmV1bS1jb250aW51ZXMtdG8tY29uc29saWRhdGUtYWZ0ZXItYmxhc3QtaGlnaGVyLTEzOTM3MDfSAXBodHRwczovL2FtcC5meGVtcGlyZS5jb20vZW4vZXRoZXJldW0tcHJpY2UtZm9yZWNhc3QtZXRoZXJldW0tY29udGludWVzLXRvLWNvbnNvbGlkYXRlLWFmdGVyLWJsYXN0LWhpZ2hlci8xMzkzNzA3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price Forecast – Ethereum Continues to Consolidate After Blast Higher - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjY2MzExL2V0aGVyZXVtLXNjYWxpbmctc3RhcnR1cC12ZXJzYXR1cy1zZWVkLWZ1bmRpbmfSAVZodHRwczovL3d3dy50aGVibG9jay5jby9hbXAvcG9zdC8yNjYzMTEvZXRoZXJldW0tc2NhbGluZy1zdGFydHVwLXZlcnNhdHVzLXNlZWQtZnVuZGluZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Ethereum scaling startup Versatus raises seed round at $50 million valuation - The Block",
        "content": "Versatus Labs, a blockchain scaling startup currently focused on Ethereum ETH +0.90% , has raised $2.3 million in a seed funding round at a valuation of $50 million.\n\nInvestors in the round include NGC Ventures, Republic Crypto and Hyperithm. There was no lead investor in the round, and it was an equity plus token warrant round, Andrew Smith, founder and CEO of Versatus, told The Block.\n\nVersatus, formerly known as VRRB Labs, began raising for the round in June and closed it in August, Smith said.\n\nThe seed round brings Versatus's total funding to $3.7 million after a $1.4 million pre-seed round at a $20 million valuation in February. At the time, Versatus was working on a Layer 1 blockchain network, but it has now pivoted to a blockchain scaling platform due to a \"lack of market demand\" for an alternative Layer 1, Smith said.\n\nBuilding a 'stateless rollup'\n\nVersatus is now building a \"stateless rollup\" called LASR. The rollup chain doesn't maintain the entire state or data, which can lead to enhanced scalability. A stateless rollup takes \"only the absolutely necessary data\" of transactions and settles it on the base layer.\n\nLASR, which will settle on Ethereum for now, is layer agnostic and can work with any layer or blockchain, Smith noted. \"LASR can be a Layer 2 on top of a Layer 1, or it can be a Layer 3 on top of a Layer 2, and it can be an off-chain execution environment for Layer 1s,\" Smith said. As LASR is currently focused on Ethereum scaling, Smith added that it aims to reduce \"cost and inefficiencies of Ethereum, eliminate the friction and centralization associated with optimistic rollups, all while delivering a 100x better developer experience.\"\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nPartnering with EigenLayer and Stader Labs\n\nVersatus has partnered with several projects, including Ethereum restaking protocol EigenLayer and liquid staking platform Stader Labs. EigenLayer founder Sreeram Kannan said stateless verifiers, like Versatus LASR, \"are a key milestone in the future of the Ethereum scaling roadmap.\"\n\nLASR is currently in the alphanet stage and is expected to launch on the Ethereum testnet in the first week of January, with the mainnet launch scheduled for mid-March, Smith said. There are currently 15 people working for Versatus, and Smith plans to keep the team lean in the near future.\n\nLASR will be the first product of Versatus, and the startup plans to launch more products that will help bring more web2 developers into the web3 space, Smith said.\n\nBesides working for Versatus, Smith still serves on the board of and owns equity in his first startup OWL ESG, a tech-driven environmental, social and governance data provider, but he said he hasn't worked there day to day since founding Versatus."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLWFzLWJ1bGwtcnVuLWNvbnRpbnVlcy1iZXlvbmQtMjIwMC1pcy1hLTEwMDAwLWV0aC1wb3NzaWJsZS1pbi0yMDI0Lmh0bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction as Bull Run Continues Beyond $2,200 – Is a $10,000 ETH Possible in 2024? - Cryptonews",
        "content": "Ethereum Price Prediction as Bull Run Continues Beyond $2,200 – Is a $10,000 ETH Possible in 2024?\n\nThe Ethereum price has dipped by 2% in the past 24 hours, falling down to $2,207 as the wider crypto market slips by 0.5% today.\n\nYet ETH has had a good week overall, with the altcoin remaining up by 9% in the last seven days and also by 17% in the last 30.\n\nThese gains provide it with enough ongoing momentum to produce further rallies in the next few days and weeks, with ETH likely to be one of the main beneficiaries of an expected end-of-year rally.\n\nAnd when combined with its enviable fundamentals, ETH could potentially reach new highs in 2024.\n\nEthereum Price Prediction as Bull Run Continues Beyond $2,200 – Is a $10,000 ETH Possible in 2024?\n\n\n\nAtheneum’s chart continues to look bullish, even with today’s little misstep.\n\nIts 30-day average (yellow) is still racing further above its 200-day (blue), implying that the altcoin remains in the middle of a medium-term uptrend.\n\nSimilarly, its relative strength index (purple) remains close to 70, a level which indicates ongoing buying pressure that’s likely to keep pushing up the coin’s price.\n\nJust as bullishly, ETH’s support level (green) has been climbing steadily ever since the middle of October, meaning that if the coin is to lose ground at any point during the current rally, any dips are likely to be small.\n\nAnd compared to September and early October, ETH’s trading volume is extraordinarily healthy, standing at about $30 billion, in contrast to levels as low as $3 billion.\n\nThis makes ETH the most-traded non-stablecoin alt in the market, implying that it’s likely to benefit from an expected end-of-year rally more than most other altcoins.\n\nSomeone has to say it. ETH price at $2.2k is hilarious. Everyone out here trading \"what ifs\" this cycle when Ethereum has fundamentals. Let my tell you why $2.2k ETH is stooopid. Ethereum now makes $2.7 billion in annualized profits – the only profitable chain – a P/E ratio… — RYAN SΞAN ADAMS – rsa.eth (@RyanSAdams) December 4, 2023\n\nIndeed, ETH’s fundamentals remain unparalleled among the vast majority of tokens, with the Ethereum blockchain accounting for 56% of the entire sector’s total value locked in.\n\nOn top of this, Ethereum has enjoyed some highly significant adoption news this year, with PayPal launching its own Ethereum-based stablecoin and with Coinbase releasing its own Ethereum layer-two.\n\nThis all points to a steadily rising Ethereum price over time, with the altcoin set to hit $3,000 in the next couple of months.\n\nOther Altcoins With High Growth Potential\n\n\n\nAs reliable as ETH remains as a major token in the market, it isn’t the only coin with potential right now, with some traders even likely to prefer newer coins set to enjoy early growth spurts.\n\nSuch coins include presale tokens, which can often generate enough momentum during their sales to enjoy big listings on exchanges.\n\nOne new coin likely to do this is Bitcoin ETF Token (BTCETF), an ERC-20 cryptocurrency that has raised $2.5 million in its presale.\n\nWhat's the aim of the #BTCETF #Token? This #BitcoinETF token, operating as an ERC-20 token, commemorates the anticipated introduction of #Bitcoin ETFs into the American financial markets. 🎉 pic.twitter.com/nybwFgMwwH — BTCETF_Token (@BTCETF_Token) December 5, 2023\n\nAs the tweet above indicates, Bitcoin ETF Token has distinguished itself with some novel tokenomics, which are linked to the progress of Bitcoin ETFs.\n\nIn particular, the coin will burn 25% of its total supply over time, with 5% tranches being burned whenever Bitcoin or Bitcoin ETFs reach certain milestones.\n\nAccordingly, Bitcoin ETF Token will process its first 5% burn when an SEC-approved Bitcoin ETF reaches a volume of $100 million.\n\nIts final burn will come when the BTC price reaches $100,000, with the token also featuring a transaction burn tax that will decline over time.\n\nTo join the coin’s presale, investors can simply go to the official Bitcoin ETF Token website and connect their software wallets, such as MetaMask.\n\nThey can currently buy BTCETF at a price of $0.0062 per token, although the sale will up this price in just under a day.\n\nAnd it’s likely to rise even higher once the token lists on trading platforms, especially when its deflationary mechanisms kick in.\n\nVisit Bitcoin ETF Token NowDisclaimer: Crypto is a high-risk asset class. This article is provided for informational purposes and does not constitute investment advice. You could lose all of your capital."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY29pbmdhcGUuY29tL2JpdGNvaW4tYnRjLWFuZC1ldGhlcmV1bS1ldGgtcmFsbHktYm9vc3RzLW5mdC1tYXJrZXQtc3VyZ2Uv0gFUaHR0cHM6Ly9jb2luZ2FwZS5jb20vYml0Y29pbi1idGMtYW5kLWV0aGVyZXVtLWV0aC1yYWxseS1ib29zdHMtbmZ0LW1hcmtldC1zdXJnZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin and Ethereum Rally Boosts NFT Market Surge - CoinGape",
        "content": "The recent upswing in the values of Bitcoin and Ethereum has led to a significant boost in various NFT markets. Notably, collections on Ethereum and Solana are experiencing a surge in value and interest. Pudgy Penguins, an Ethereum-based collection, has seen a 77% increase in its USD floor price over the past week, while trading volume has escalated by 397%. This surge indicates a strong recovery and growing investor confidence in NFTs linked to these blockchain networks.\n\nSignificant Rises in Major NFT Collections\n\nOther Ethereum NFT collections are also riding the wave of this revival. Azuki’s floor price has risen by 25%, and stalwarts like Bored Ape Yacht Club and CryptoPunks have seen increases of 30% and 15%, respectively. Even the controversial Milady Maker collection has enjoyed an over 70% increase in floor price. These trends underscore a broader market revival, transcending beyond individual projects and signaling a possible end to the prolonged NFT winter.\n\nadvertisement\n\nSolana Collections Joining the Upswing\n\nThe positive trend isn’t confined to Ethereum alone. Solana’s NFT collections are also witnessing considerable growth. Mad Lads, a prominent Solana project, has seen its floor price jump by 52.6%, now valued at an impressive $10,219. This growth is not solely attributed to the recent Solana rally but also the unique benefits offered to the holders, such as connections to the Backpack app and an upcoming crypto exchange.\n\nOther Solana collections like Claynosaurz and Chads have also recorded significant gains in floor price and trading volume. Significantly, the recent developments in the NFT market, buoyed by the uptick in major cryptocurrencies like Bitcoin and Ethereum, point towards a rejuvenated interest and confidence in digital collectibles.\n\nRead Also: Crypto Champion Patrick McHenry Ends 20-Year Congressional Run"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zb2NnZW4taXNzdWVzLWV0aGVyZXVtLWJhc2VkLWRpZ2l0YWwtMTI0NDA4OTMxLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "SocGen Issues Ethereum-Based Digital Green Bond - Yahoo Finance",
        "content": "SocGen Issues Ethereum-Based Digital Green Bond\n\nFrench financial service giant Societe Generale announced yesterday that it has issued a 10 million euro digital green bond directly on the public Ethereum blockchain. This marks the first time SocGen has leveraged blockchain technology for bond issuance.\n\nThe three-year senior unsecured bond was fully subscribed by institutional investors AXA Investment Managers and Generali Investments via private placement. Societe Generale stated that using a public blockchain provides increased transparency and traceability compared to traditional bonds.\n\nSpecifically, the bond's smart contract publishes real-time carbon emissions data linked to the digital infrastructure. This innovation enables issuers and investors to continuously monitor the environmental impact of financial securities.\n\nSocGen's blockchain subsidiary SG-FORGE registered the security tokens. Back in April, SG-FORGE launched its own euro-stablecoin dubbed EUR CoinVertible to provide flexible settlement options. Investors in this latest bond had the choice to redeem their tokens for fiat currency or exchange them for EUR CoinVertible directly on-chain.\n\nAs one of France's largest banks, Societe Generale has positioned itself at the forefront of blockchain adoption in capital markets. The group previously participated in the first-ever digital bond issuance by the European Investment Bank in 2021."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZW5nLmFtYmNyeXB0by5jb20vZXRoZXJldW0td2hhbGUtbWFrZXMtYS1zdXJwcmlzZS1tb3ZlLXNwYXJrcy1pbmZsb3dzL9IBUmh0dHBzOi8vZW5nLmFtYmNyeXB0by5jb20vZXRoZXJldW0td2hhbGUtbWFrZXMtYS1zdXJwcmlzZS1tb3ZlLXNwYXJrcy1pbmZsb3dzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Ethereum: Whale makes a surprise move, sparks inflows - AMBCrypto English",
        "content": "A whale deposited over 39,000 ETH to the Kraken exchange.\n\nThis marked Ethereum’s first positive flow in a month.\n\nAfter experiencing several days of continuous outflows, Ethereum [ETH] has just observed its first significant influx of the month.\n\nThe increase in the volume of inflow into exchanges could be attributed to a recent transaction made by a prominent whale.\n\nEthereum whale shakes up exchange flow\n\nOn the 5th of December, an Ethereum whale that had remained inactive for five years initiated a significant transaction. The whale transferred its entire holdings to the Kraken exchange.\n\nRecords from Lookonchain showed that this whale had acquired 47,260 ETH at an average price of $240 per token between June and August 2017.\n\nAfter selling a portion of its holdings previously, the whale has now deposited the remaining 39,260 ETH tokens onto the exchange.\n\nAt the press time market rate, these tokens amount to around $87.5 million. The anticipated total earnings for the whale from selling all the tokens are expected to reach around $78 million.\n\nThis recent move has caused a notable disruption in the Ethereum exchange flow.\n\nEthereum inflow rises for the first time in the month\n\nAMBCrypto’s examination of the Ethereum Exchange Netflow on CryptoQuant showed a consistent negative trend over the past few days. The trend signaled a prevalence of outflows from exchanges.\n\nHowever, there has been a noteworthy reversal in this pattern within the last 24 hours. AMBCrypto observed that the net flow turned positive at the close of trading on the 4th of December, registering an influx of over 15,800 ETH.\n\nAlso, as of press time, this positive momentum has intensified, showcasing the impact of the recent whale movement. The inflow has surged to over 39,400 ETH and could increase further by the day’s end.\n\nThis shift suggested not only the influence of the recent whale transaction but also an overall increase in the amount of the token being deposited into exchanges.\n\nETH remains above $2,000\n\nEthereum has exhibited a positive trend for five consecutive days, propelling its price significantly beyond the $2,000 mark. However, at the time of this update, it had experienced a minor setback, with a decline of around 1.5%.\n\nNevertheless, it has managed to sustain its upward trajectory, remaining above the $2,200 price level.\n\nRealistic or not, here’s ETH market cap in BTC’s terms\n\nAdditionally, on the 4th of December, Ethereum recorded a substantial trading volume of over 16 billion. This marked the highest volume in the past few weeks.\n\nAs of press time, the trading volume had slightly decreased to around 14 billion."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtb24tdmVyZ2Utb2YtbWFzc2l2ZS1zdXJnZS11bnVzdWFsLW1hcmtldC1kYXRhLXNob3dz0gFUaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtLWV0aC1vbi12ZXJnZS1vZi1tYXNzaXZlLXN1cmdlLXVudXN1YWwtbWFya2V0LWRhdGEtc2hvd3M_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) on Verge of Massive Surge, Unusual Market Data Shows - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nEthereum's (ETH) market indicators are presenting a rare confluence of bullish signals, suggesting the second-largest cryptocurrency by market capitalization may be poised for a significant price surge. There are three key data points that might become a foundation for a new rally.\n\nInstitutional pivot: ETH Futures gain traction\n\nThe first sign comes from the futures market, where ETH's performance on the Chicago Mercantile Exchange (CME) is turning heads. Ethereum futures are now trading at a 5% premium compared to Bitcoin's basis, a notable shift in institutional focus.\n\nInteresting to see the futures basis for ETH on CME is now trading at a 5% premium to the basis for BTC and open interest for ETH on CME is now starting to pick up after lagging BTC.\n\n\n\nEarly signs of tradfi starting to rotate into the ETH ETF trade? pic.twitter.com/o12EXjWsmZ — Will (@WClementeIII) December 4, 2023\n\nMoreover, open interest in ETH on the CME has seen an uptick, starting to outpace BTC after a period of lagging. This shift could indicate growing interest from traditional finance (TradFi) investors in Ethereum, potentially as a reaction to the burgeoning ETF market for ETH.\n\nBullish technical outlook on ETH charts\n\nThe provided price chart offers a bullish technical outlook for Ethereum. A closer analysis reveals a strong uptrend, with ETH's price action forming higher highs and higher lows – a classic indicator of bullish momentum. The moving averages have aligned in a way that typically precedes bullish conditions: the 50-day moving average is well above the 200-day moving average, and the price is currently trading above both, confirming a \"golden cross\" formation. This technical pattern often attracts further buying from momentum traders, reinforcing the positive trend.\n\nDeFi as catalyst amid BTC's potential correction\n\nLastly, the potential for a correction in Bitcoin's (BTC) price may drive investors toward Ethereum, particularly as the decentralized finance (DeFi) sector gains more traction. Ethereum is the foundational platform for DeFi applications, and as this industry grows, ETH is likely to benefit from increased utility and demand. This, combined with a possible redistribution of capital from Bitcoin to Ethereum, could provide the necessary fuel for Ethereum's price growth."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS9ldGhlcmV1bS1wcmljZS1mb3JlY2FzdC1ldGgta2lsbGluZy10aW1lLWFmdGVyLXJhbGx5LTEzOTM5ODfSAVhodHRwczovL2FtcC5meGVtcGlyZS5jb20vZW4vZXRoZXJldW0tcHJpY2UtZm9yZWNhc3QtZXRoLWtpbGxpbmctdGltZS1hZnRlci1yYWxseS8xMzkzOTg3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price Forecast – ETH Killing Time After Rally - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLTIzMjAv0gFIaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vYW5hbHlzaXMvZXRoL2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tMjMyMC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction- After 10% Surge, Is ETH Rally Just Getting Started? - NewsBTC",
        "content": "Ethereum price extended its rally above the $2,250 resistance. ETH is up over 10% and might continue to rise toward the $2,500 resistance.\n\nEthereum is showing positive signs and recently surpassed the $2,300 resistance.\n\nThe price is trading above $2,250 and the 100-hourly Simple Moving Average.\n\nThere is a major bullish trend line forming with support near $2,250 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could extend its rally if it clears the $2,320 resistance zone.\n\nEthereum Price Extends Rally\n\nEthereum price remained in a positive zone above $2,120, like Bitcoin. ETH extended its rally above the $2,200 and $2,250 resistance levels. The bulls remained action and the price spiked above $2,300.\n\nA new multi-month high was formed near $2,316 and the price is now correcting gains. There was a move below the $2,300 level. The price is now testing the 23.6% Fib retracement level of the upward move from the $2,188 swing low to the $2,316 high.\n\nEthereum is now trading above $2,250 and the 100-hourly Simple Moving Average. Besides, there is a major bullish trend line forming with support near $2,250 on the hourly chart of ETH/USD.\n\nSource: ETHUSD on TradingView.com\n\nOn the upside, the price is facing resistance near the $2,320 zone. The next key resistance is near the $2,350 level. A clear move above the $2,350 zone could send the price toward the $2,420 level. The next resistance sits at $2,450. Any more gains could start a wave toward the $2,500 level.\n\nAre Dips Supported in ETH?\n\nIf Ethereum fails to clear the $2,320 resistance, it could start a downside correction. Initial support on the downside is near the $2,265 level.\n\nThe next key support is $2,250 and the trend line. It is near the 50% Fib retracement level of the upward move from the $2,188 swing low to the $2,316 high. The main support is now near $2,200 or the 100-hourly Simple Moving Average. A downside break below $2,200 might start an extended decline. The key support is now at $2,120, below which there is a risk of a move toward the $2,080 level in the near term.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 level.\n\nMajor Support Level – $2,200\n\nMajor Resistance Level – $2,320\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZW5nLmFtYmNyeXB0by5jb20vZXRoZXJldW0tZGVjb3VwbGVzLWZyb20tYml0Y29pbi1leGFtaW5pbmctdGhlLWNhdXNlcy_SAVNodHRwczovL2VuZy5hbWJjcnlwdG8uY29tL2V0aGVyZXVtLWRlY291cGxlcy1mcm9tLWJpdGNvaW4tZXhhbWluaW5nLXRoZS1jYXVzZXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Ethereum decouples from Bitcoin: Examining the causes - AMBCrypto English",
        "content": "The decoupling was most likely due to an increase in spot ETH ETF launches.\n\nA lower BTC-ETH correlation made a case for portfolio diversification.\n\nBitcoin’s [BTC] correlation with Ethereum [ETH] dropped to multi-year lows, signaling a major divergence in the growth trajectories of the two blue-chip cryptocurrencies.\n\nBased on a 60-day rolling window, the correlation dipped to 75% in November, according to crypto market data provider Kaiko. This was a marked departure from the all-time highs (ATH) of 97% seen during the end of 2022.\n\nEthereum weakens its relationship with Bitcoin\n\nAMBCrypto spotted a vertical drop in the relationship since November. While there was no telling evidence, the decoupling seemed to be caused by an increase in spot ETH exchange-traded fund (ETF) launches.\n\nThe broader market bullishness was led by excitement over likely approvals of a dozen-odd spot Bitcoin ETF applications. This led to the start of the mid-October rally and by the time the month ended, BTC had accumulated gains of 26%.\n\nHowever, ETH was slow to match this pace, finishing October with 17% gains.\n\nHowever, the announcement of spot ETH ETFs by TradFi giants such as BlackRock and Fidelity turned it around for ETH in November. The second-largest crypto bounced above the crucial barrier of $2,000 for the first time since May 2022.\n\nTo put it simply, ETH reacted more to developments in its own ecosystem rather than a trickle-down effect.\n\nIt is important to understand that both assets function very differently from each other.\n\nNotably, Ethereum is used as a platform for the development of decentralized applications (dApps) and smart contracts. Meanwhile, Bitcoin is primarily used as a store of value and a means of payment.\n\nWhat is the takeaway for investors?\n\nAs per a 21 April report by Coinbase, the lower BTC-ETH correlation makes a case for portfolio diversification, as holding both assets can result in higher returns.\n\nSmart investors spread their investments across different cryptos, reducing their exposure to any one category.\n\nRead Bitcoin’s [BTC] Price Prediction 2023-24\n\nAs for institutional investors, the trend could impact their trading strategies like cross-hedging. For the curious, cross-hedging is a practice of managing risk by investing in two assets that have similar price movements but are not perfectly correlated.\n\nHaving said that, traders and investors should not take these as investment advice, and instead perform their due diligence."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMTIvMDUvZXRoZXJldW0tZXRoLWluZGljYXRvcnMtc2lnbmFsLWltbWluZW50LXByaWNlLXJhbGx5LWRldGFpbHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) Indicators Signal Imminent Price Rally: Details - The Crypto Basic",
        "content": "Ethereum (ETH) could be looking to register a more substantial price rally, as signals from its daily and monthly indicators suggest an imminent price upswing.\n\nThe asset’s latest uptrend began on the back of Bitcoin’s price appreciation, as the leading asset moves to conquer the $42,000 psychological price territory. ETH, whose price action correlates with Bitcoin’s, has recorded similar price gains, helping it to reclaim the $2,200 price level for the first time since last May.\n\nThe journey to the reclamation of this lofty price position was not without hurdles. Notably, Ethereum’s latest price momentum picked up the pace at the end of November after it recovered the $2,000 level in mid November. ETH had continued to face resistance at $2,000 until it flipped it into support on Nov. 30.\n\n- Advertisement -\n\nThe asset then began December with a favorable outlook, looking to conquer the resistance points above $2,000. Its mission has been largely successful with less than a week into the new month. ETH turned $2,100 into support on Dec. 2 and used this point as a launchpad to reclaim $2,200.\n\nIndicators Signal a Potential ETH Surge\n\nNow, it looks to solidify its position above $2,200, currently changing hands at $2,204. Amid these bullish prospects, ETH’s technicals are looking good, adding weight to sentiments surrounding a continuation of the bull run and an imminent price surge.\n\nOne of these indicators is the 21-day EMA, which Ethereum recently broke above. Notably, breaking above the 21-day EMA is a sign of a looming price upswing. The last time ETH broke and closed above the 21-day EMA was on March 11.\n\nThe asset eventually soared 51% to $2,140 in April, a new yearly peak at the time. With Ethereum now trading above the pivotal moving average for the second time this year, it has never been in a better price position.\n\n- Advertisement -\n\nA second indicator of Ethereum’s favorable position is its price above the 50-day EMA ($1,958) and 200-day EMA ($1,807). Currently trading for $2,204, ETH is way above these moving averages, signaling bullish momentum in the short and long terms. In addition, the 50-day EMA recently crossed above the 200-day EMA, marking a golden cross.\n\nGrowing Buying Interest\n\nMoreover, on the monthly timeframe, things are also looking good for Ethereum. Despite the recent price surge, the monthly Relative Strength Index (RSI) remains in a fairly stable position, currently at 55.\n\nAn RSI of 55 during an uptrend suggests a potential continuation of the bullish momentum. It indicates that the upward price movement is steady without being excessively overbought, providing room for further upside potential. This reading suggests a healthy trend with the possibility of sustained buying interest in ETH.\n\nMeanwhile, Ethereum whales have shown an affinity toward the asset of late, with buying interest on the high side. IntoTheBlock recently confirmed that the percentage of ETH supply held by whales has increased to 35%. This rate was 22% in January."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3NlYy1leHRlbmRzLWNvbW1lbnQtcGVyaW9kLW9uLWdyYXlzY2FsZS1zcG90LWV0aGVyZXVtLWV0Zi1pbnRvLTIwMjQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "SEC extends comment period on Grayscale spot Ethereum ETF into 2024 - CryptoSlate",
        "content": "The Securities and Exchange Commission (SEC) has extended the 45-day comment period on a proposed rule change that would allow NYSE Arca to list and trade shares of the Grayscale Ethereum Trust as an exchange-traded fund (ETF), according to an SEC filing released on Dec. 5th.\n\nNYSE Arca originally submitted the proposed rule change to the SEC on October 10th of this year. Typically, the SEC has 45 days from the publication of the proposal in the Federal Register to make a decision, but the regulator has opted to extend this timeline to January 25th, 2024, in order to take more time to consider the implications.\n\nThe proposed rule change would allow the $5 billion Grayscale Ethereum Trust, one of the largest institutional investment vehicles for Ether, to convert into a spot ETF. Unlike the current trust structure, which does not allow redemptions, an ETF would provide more liquidity and could eliminate the long-standing discount at which the trust has historically traded compared to the net asset value of its underlying Ether holdings.\n\nGrayscale has stated that they see conversion to an ETF as “the natural next step in the product’s evolution,” bringing Ethereum further into the regulated financial system. However, the SEC has yet to approve a spot crypto ETF in the U.S., having delayed decisions on several Bitcoin ETF applications earlier this year.\n\nETF mania\n\nThe extended timeline for an SEC decision comes as other major financial institutions like Fidelity and BlackRock have filed their own proposals for spot Ethereum ETFs over the past month. The SEC also recently opened a comment period to solicit public feedback on Fidelity’s filing.\n\nWhile institutional interest continues to grow, the SEC has maintained a cautious stance, pushing back decisions and calling for more comments to fully assess market manipulation risks, surveillance mechanisms, custodial qualifications, and other factors related to the crypto asset class.\n\nWith the Grayscale decision likely to come in early 2024, all eyes are on the SEC to see whether it finally gives the green light to accessible, regulated crypto investment vehicles in the U.S. markets."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZGVjcnlwdC5jby8yMDg3MDcvc2VjLXB1c2hlcy1ncmF5c2NhbGUtZXRoZXJldW0tZXRmLWRlY2lzaW9uLWludG8tMjAyNNIBVGh0dHBzOi8vZGVjcnlwdC5jby8yMDg3MDcvc2VjLXB1c2hlcy1ncmF5c2NhbGUtZXRoZXJldW0tZXRmLWRlY2lzaW9uLWludG8tMjAyND9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "SEC Delays Grayscale Ethereum ETF, Confirms Receipt of BlackRock ETH Fund - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe Security and Exchange Commission today said that it will need more than 45 days to evaluate a rule change that would allow Grayscale to convert its Ethereum trust into an Ethereum spot ETF. The new deadline is January 25, 2024.\n\nThe news comes as the regulatory body received notice from investing giant BlackRock that its pending Bitcoin spot ETF has already drawn $100,000 in seed funding from an undisclosed investor.\n\nFor Grayscale, the decision comes two weeks after the SEC delayed a separate request from the crypto asset manager to evaluate its proposal for an Ethereum futures ETF. That application was submitted in September.\n\nAD\n\nAD\n\nThe reason given in both cases was the same.\n\n\"The commission finds it appropriate to designate a longer period within which to take action on the proposed rule change so that it has sufficient time to consider the proposed rule change and the issues raised therein,\" reads the SEC's official notice today.\n\nThat is, word for word, the same explanation the SEC provided last month.\n\nAs for BlackRock, its amended Form S-1 registration for its iShares Bitcoin Trust includes disclosure of a \"seed capital investor\" that's affiliated with BlackRock. The unnamed investor purchased 4,000 shares at a per-share price of $25 on October 27, for total proceeds of $100,000."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWV0aGVyZXVtLWRvZ2Vjb2luLXNwaWtlLWFtaWQtMTYyMTU0MzI5Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin, Ethereum, Dogecoin Spike Amid 'Panic Buying', ChatGPT-Drafted Legislation Unanimously Passed In Brazil ... - Yahoo Finance",
        "content": "US Markets\n\nCrypto\n\nUS Politics\n\nWorld Economy\n\nTech\n\nStory continues\n\nElectric Vehicle\n\nConsumer\n\nCommunication\n\nIndustrial\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nThis article Bitcoin, Ethereum, Dogecoin Spike Amid 'Panic Buying', ChatGPT-Drafted Legislation Unanimously Passed In Brazil - Top Headlines Today While US Was Sleeping originally appeared on Benzinga.com\n\n.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zb2NpZXRlLWdlbmVyYWxlLWZpcnN0LWdyZWVuLWJvbmQtZXRoZXJldW3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Societe Generale issues its first green bond on Ethereum - Cointelegraph",
        "content": "The third-largest bank in France, Societe Generale, reported issuing its first digital green bond as a security token on the Ethereum public blockchain. The bond, registered by Forge, a subsidiary of Societe Generale, went public on Nov. 30.\n\nThe bond has a value of 10 million euros (around $11 million) and a maturity of three years. Its “green” status means that its net proceeds will be used to finance or refinance products and companies classified under the eligible green activities category.\n\nRelated: Tether’s ‘new era for capital raises’ Bitfinex bond stutters\n\nThe digital infrastructure of the bond grants 24/7 open access to the data on its carbon footprint through the bond’s smart contract. According to the bank:\n\n“This enables issuers and investors to measure the carbon emissions of their securities on the financial infrastructure.”\n\nAnother innovation of the bond is a technical option for investors to settle securities on-chain through the EUR CoinVertible, a euro-pegged stablecoin issued by Forge in April 2023. Societe Generale keeps in mind the upcoming wave of the central bank digital currencies (CBDCs) with this option:\n\n“While Central Bank Digital Currencies (CBDC) solutions are being experimented, this panel of settlement methods demonstrates the large capabilities of SG-FORGE in providing full spectrum of on-chain services.”\n\nSociete Generale has been active in the crypto sector, issuing euro bonds on the Ethereum blockchain and security tokens on the Tezos blockchain, as well as proposing Dai (DAI) stablecoin loans in exchange for bond tokens. In July 2023, Forge became the first company to obtain the highest access license for crypto services in France.\n\nMagazine: Real AI & crypto use cases, No. 4. Fight AI fakes with blockchain"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi1hcy1ldGgtZXhpdHMtMTktbW9udGgtY2hhbm5lbC0zNDAwL9IBXmh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi1hcy1ldGgtZXhpdHMtMTktbW9udGgtY2hhbm5lbC0zNDAwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction As $ETH Exits 19-Month Channel to Pursue $3400 - CoinGape",
        "content": "The transition from November to December has brought a bullish wave to the crypto market, primarily driven by the Bitcoin price recovery. Ethereum (ETH), the second-largest cryptocurrency, has also gained momentum, particularly over the last week When the ETH price rebounded from the significant psychological level of $2,000. In the past six days, the Ether value has increased by approximately 11%, now trading around $2,251. Despite this positive trend, the buyers are currently confronting a long-standing resistance trendline, which poses the risk of a bearish reversal.\n\nAlso Read: Ethereum Breaks Above $2200 As ETH Open Interest Surges Above $8 Bln\n\nadvertisement\n\nIs ETH Price Ready for $3000?\n\nThe upper boundary of the wedge pattern could stand as a strong supply pressure\n\nA bullish breakout from the wedge pattern would intensify the buying pressure for a rally past $3000.\n\nThe intraday trading volume in Ether is $10.2 Billion, indicating a 78% gain.\n\nThe ETH price has demonstrated an impressive recovery in the last two months, with its price soaring from a low of $1,522 to the current level of $2251, marking a 47.8% increase. This growth has been largely attributed to the anticipated approval of a Bitcoin spot ETF and applications by large asset management firms for Ethereum spot ETFs.\n\nHowever, From a technical standpoint, this recovery can be viewed as a bullish swing within a wedge pattern carrying a modest recovery path for the past 19 months. Historical data suggests that when the Ethereum price retests the upper trendline of this pattern, it often faces increased selling pressure, leading to a substantial correction back to the lower trendline.\n\nShould the current resistance level push the altcoin price below the new support level of $2,133, this could signal a shift in favor of sellers and potentially initiate a bearish reversal.\n\nConversely, a breakout above the wedge pattern could further accelerate the ETH recovery, potentially driving prices toward targets of $2,500 and then $3,000.\n\nETH Staked Realized Price Surpasses $2K\n\nThe Ethereum network recently witnessed a significant development as the average unit price of $ETH staked surged past $2,000. This milestone is particularly noteworthy as it represents a crucial support and resistance level for long-term investors. According to Julio, the Head of Research at CryptoQuant, this price point is pivotal because it reflects the average unit price for those committed to holding $ETH for extended periods. Surpassing the $2,000 mark indicates that most long-term investors are now in a profitable position. This shift is expected to solidify $2,000 as a key support level, potentially influencing future market dynamics and investor sentiment toward Ethereum\n\nBollinger Band: An uptick in the upper boundary of the Bollinger Band indicator reflects the buyers currently dominating this asset .\n\nAverage Directional Index: the ADX slope at a high of 34%, reflects the BTC price may witness minor pullbacks to replenish bullish momentum."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tYXQtMjIwMC1pcy1oaWxhcmlvdXMtaXMtYS0xMHgtaW5jb21pbmcv0gFaaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy9ldGhlcmV1bS9ldGhlcmV1bS1hdC0yMjAwLWlzLWhpbGFyaW91cy1pcy1hLTEweC1pbmNvbWluZy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Ethereum At $2,200 Is “Hilarious”; Is A 10X Incoming? - NewsBTC",
        "content": "Crypto investor Ryan Sean Adams argued on December 4 that Ethereum’s (ETH) current valuation of around $2,200 is almost “hilarious” given the strengthening on-chain activity and the blockchain’s role in the sphere.\n\nVenture Capitalist: Here’s Why Ethereum Is Grossly Undervalued\n\nAdams cited data like the first smart contract platform generating billions annually in “gas” fees, transitioning to becoming deflationary after merging in September 2021, and the over one million validators staking earning over 5% as rewards. Moreover, the venture capitalist pointed out the potential of the United States Securities and Exchange Commission (SEC) approving spot Ethereum ETFs in the long run.\n\nFor now, BlackRock and Fidelity, two of the world’s most prominent traditional finance players, have applied to issue these derivative products. Though the SEC has yet to approve any spot crypto ETFs, the agency will authorize one or multiple, likely in early Q1 2024.\n\nOverall, the crypto market expects any spot ETF, including that of Ethereum, to attract billions in institutional capital. Beyond external factors like the SEC and ETFs talk, Adams also pointed out the rising demand for mainnet block space from the multiple layer-2 solutions running off-chain rollups parallel to Ethereum.\n\nETH Value Draws From On-Chain Activities\n\nAccording to L2Beat, Ethereum layer-2 solutions have over $14.9 billion as total value locked (TVL), with the most prominent platforms, including Arbitrum One, OP Mainnet, Starknet, and Base, commanding billions and processing tens of thousands of transactions daily. In the past week, Adams observed that leading layer-2 rollups were the top 10 consumers of Ethereum block space.\n\nComparing Ethereum using traditional metrics like price-earnings (P/E) ratios that compare favorably to technology companies like Amazon and Zoom, Adams suggested that Ethereum’s upside is almost mathematically unavoidable this cycle.\n\nThe venture capitalist, based on the above factors, thinks Ethereum could likely be 10x, pushing the coin to over $22,000 per coin. Even so, the investor can’t precisely gauge how long the markets will “stay irrational,” grossly undervaluing the second most valuable coin.\n\nIn response, Uniswap founder Hayden Adams agreed Ethereum fundamentals would fuel appreciation. Even so, the founder thinks Ethereum derives strength not from speculation attributes, as Ryan Sean Adams laid out. The Uniswap founder is confident that demand from active protocols launching on the mainnet and competing for scarce block space will directly pump prices.\n\nAccording to Ultra Sound Money, Uniswap helps Ethereum burn the most coins. In the last month alone, Uniswap took over 14,900 ETH out of circulation, helping the network become more deflationary.\n\nFeature image from Canva, chart from TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMi8wNi9lYXJseS1ldGhlcmV1bS13aGFsZS1hZGRyZXNzLXNlbmRzLW5lYXJseS05MDAwMDAwMC10by1rcmFrZW4tYWZ0ZXItYmVpbmctZG9ybWFudC1mb3ItZml2ZS15ZWFycy1vbi1jaGFpbi1kYXRhL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Early Ethereum Whale Address Sends Nearly $90,000,000 to Kraken After Being Dormant for Five Years: On-Chain Data - The Daily Hodl",
        "content": "An early Ethereum (ETH) whale appears to have woken up from a multi-year slumber.\n\nData from crypto tracker Lookonchain reveals that the deep-pocketed investor deposited 39,260 ETH worth $87.5 million to the crypto exchange Kraken on Monday after being dormant for five years.\n\nThe whale received 47,260 Ethereum worth $11.34 million (at a price of approximately $240 per ETH) between June and August 2017. It sold 8,000 ETH the following year and hasn’t moved any since.\n\nIf the whale sold its holdings on Kraken, it would have generated a profit of roughly $78 million, according to Lookonchain.\n\nETH is trading at $2,295 at time of writing. The second-ranked crypto asset by market cap is up almost 3% in the past 24 hours.\n\nLookonchain also notes that an address associated with the failed crypto lending platform Celsius transferred 7,500 ETH worth $16.7 million to the institutional crypto trading platform FalconX on Monday.\n\nCelsius has sent a total of 37,260 ETH worth $83 million to FalconX and the crypto exchanges Coinbase and OKX in the past three weeks, according to the crypto tracker.\n\nCelsius filed for bankruptcy in July 2022 after its token plummeted by 99% and it was unable to fulfill withdrawals.\n\nLast month, a US judge approved a bankruptcy plan for Celsius that will generate funds for a new mining and staking corporate spinoff designed to repay creditors.\n\nThe company, dubbed “NewCo,” will have a $1.25 billion balance sheet, $450 million of which will be liquid crypto.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMi8wNS90aW1lLWZvci1ldGhlcmV1bS10by1maW5hbGx5LWhhdmUtbW9tZW50LWluLXRoZS1zdW4tYXMtZXRoLWJyZWFrcy1vdXQtb2YtNTMwLWRheS1yYW5nZS1zYXlzLXRvcC10cmFkZXIv0gGMAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzEyLzA1L3RpbWUtZm9yLWV0aGVyZXVtLXRvLWZpbmFsbHktaGF2ZS1tb21lbnQtaW4tdGhlLXN1bi1hcy1ldGgtYnJlYWtzLW91dC1vZi01MzAtZGF5LXJhbmdlLXNheXMtdG9wLXRyYWRlci9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Time for Ethereum To Finally Have Moment in the Sun As ETH Breaks Out of 530-Day Range, Says Top Trader - The Daily Hodl",
        "content": "An analyst who nailed the bottom of the 2018 Bitcoin (BTC) bear market thinks that Ethereum (ETH) is about to take center stage.\n\nPseudonymous analyst Bluntz tells his 230,300 followers on the social media platform X that Ethereum has closed above its multi-month accumulation range for the first time last week.\n\nAccording to the analyst, Ethereum’s strong weekly close is reminiscent of Chainlink’s (LINK) price action when it rallied big after breaking out of its accumulation range in October.\n\n“ETH finally got a strong weekly close above a 530+ day range. For perspective, I think there’s a very strong chance it starts marking up considerably like LINK and others that had similar structures.”\n\nThe crypto strategist also says that Ethereum is starting to flash signs of strength against Chainlink and Solana (SOL).\n\n“A lot of pairs that have been in monster uptrends like LINK and SOL are finally starting to look bearish against ETH.\n\nI think it’s ETH’s turn to finally have its moment in the sun.”\n\nBluntz is not the only analyst who’s bullish on Ethereum. Pseudonymous analyst Inmortal notes that Ethereum recorded its highest weekly close in more than a year last week.\n\n“This [is] the highest weekly close in ETH since May 2022, 570 days ago. Ah, this is a new macro higher high and a new yearly high. Something you don’t see every day.”\n\nInmortal previously predicted that the latest ETH breakout will stick this time around.\n\nAt time of writing, ETH is trading for $2,236, well above Bluntz’s accumulation range.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYmxvb21iZXJnLWV4cGVydHMtdGltZWxpbmUtZXRoZXJldW0tZXRmL9IBSWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYmxvb21iZXJnLWV4cGVydHMtdGltZWxpbmUtZXRoZXJldW0tZXRmL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Bloomberg Experts Forecast Timeline For Spot Ethereum ETF Approval - NewsBTC",
        "content": "The journey towards the approval of an Ethereum ETF in the United States has seen a new development yesterday as the US Securities and Exchange Commission (SEC) has announced a delay in the decision for Grayscale’s Ethereum trust conversion into a spot Exchange Traded Fund (ETF). The SEC has stated the need for an extended period to evaluate the proposed rule change, pushing the new deadline Grayscale to January 25, 2024.\n\nIn its reasoning, the SEC has reiterated, “The commission finds it appropriate to designate a longer period within which to take action on the proposed rule change so that it has sufficient time to consider the proposed rule change and the issues raised therein.” Notably, the delay comes at a time where the US agency is working with now 13 spot Bitcoin ETF applicants on presumably the final amendments before a January 10 approval.\n\nTimeline For A Spot Ethereum ETF Approval\n\nDespite the latest delay, the crypto community remains optimistic about the future of spot Ethereum ETFs. Bloomberg ETF analyst James Seyffart has suggested that delays are par for the course, tweeting, “Update: As expected Grayscale’s Ethereum trust filing just got delayed. It was due by 12/6/23 so this is completely normal.”\n\nSeyffart also shared a table of all seven spot Ethereum ETF applicants: VanEck, 21Shares & ARK, Hashdex, Grayscale, Invesco & Galaxy, BlackRock, Fidelity and their deadlines. He further hinted at potential approvals by mid-2024, responding to criticisms from Adam Back, CEO of Blockstream, with “Unfortunately I think you’re gonna be really upset by June of next year.”\n\nIn response to queries about the probability of an Ethereum ETF approval following a Bitcoin ETF, Eric Balchunas of Bloomberg has indicated that the first filers, Ark and VanEck, have strong odds of approval by their final deadline on May 23, 2024, as they are expected to use the same mechanics as spot Bitcoin ETFs, and due to the fact that Ether futures have already received the green light from the US SEC.\n\nQueried about for the odd of a spot Ethereum ETF approval, he remarked, “Not formally yet, but final deadline for the first filers Ark and VanEck is May 23rd so strong odds they approved by then given they’d be using same design as btc etfs and ether futures were Ok’d.”\n\nThe Next Deadlines\n\nThe table by Seyffart shows that the next Ethereum ETF deadlines are from December 23 to 26 for VanEck, Ark Invest and Invesco & Galaxy, followed by Hashdex on January 1. Since a spot Bitcoin ETF is very unlikely to be approved by then, delays by the SEC are more than likely for this batch of filings.\n\nBoth iShares by BlackRock and the Fidelity Ethereum Fund have their next deadlines on January 25 and January 21, 2024 respectively. These dates are crucial as they could involve either an extension, a request for more information, or a final decision.\n\nBut things only get really tense towards the final deadlines for all Ethereum ETF filers, as outlined by both Bloomberg ETF experts. With VanEck poised for May 23, 2024, and ARK Invest for May 24, 2024 and other notable filers like Hashdex Nasdaq Ethereum ETF and Grayscale’s Ethereum Trust Conversion (ETHE) scheduled for decisions by May 30, 2024, and June 18, 2024, respectively, the timeline for potential approvals is taking shape.\n\nAt press time, ETH traded at $2,271.\n\nFeatured image from Shutterstock, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZW5nLmFtYmNyeXB0by5jb20vaXMtZXRoZXJldW0tcGlnZ3liYWNraW5nLW9uLWJpdGNvaW5zLXByaWNlLXJpc2Uv0gFOaHR0cHM6Ly9lbmcuYW1iY3J5cHRvLmNvbS9pcy1ldGhlcmV1bS1waWdneWJhY2tpbmctb24tYml0Y29pbnMtcHJpY2UtcmlzZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Will Ethereum’s price prediction piggyback on Bitcoin’s rise? - AMBCrypto English",
        "content": "Ethereum’s price saw an 18-month high at press time.\n\nWith the recent price uptick, ETH’s price has become more prone to fluctuations.\n\nSharing a statistically significant correlation with the leading coin Bitcoin [BTC], whose price has rallied above $40,000, Ethereum’s [ETH] price has climbed to an 18-month high.\n\nOn the 4th of December, BTC briefly traded above the $42,000 price mark for the first time since April 2022.\n\nThis positive sentiment undoubtedly spilled over into the ETH market, as the altcoin exchanged hands at a high of $2,250 on the same day, a price level it last recorded in May 2022.\n\nNew highs, new troubles\n\nApart from its price rally, ETH’s Open Interest has also risen significantly in the past few days. By the 4th of December, this had grown to over $4.5 billion, representing its highest level since February 2023.\n\nRising Open Interest alongside rising prices suggested that new money was coming into the market, fueling the bullish momentum. This signaled that the upward trend was likely to continue.\n\nHowever, with price volatility making a gradual comeback, the rally might be short-lived, as traders increasingly occupied leveraged positions.\n\nETH’s Bollinger Bands indicator (BB), assessed on a daily chart, confirmed the possibility of significant price swings soon. At press time, the altcoin’s price traded above the upper band of this indicator.\n\nLikewise, the gap between the upper and lower bands of the BB indicator has widened consistently since the 30th of November.\n\nA gradual widening of these bands typically indicated an increase in market volatility. The coin’s Bollinger Bandwidth, which has grown since then, confirmed the rising volatility.\n\nDue to the recent price surge, ETH’s estimated leverage ratio has risen. This indicated that, at press time, traders were borrowing more money to trade the leading crypto asset.\n\nETH’s climbing leverage ratio is often seen as a bullish signal. Notably, it suggests that traders are confident that the coin’s price will continue to rise.\n\nHowever, it is also risky, as traders with high leverage are more vulnerable to liquidations if the market moves against them.\n\nRealistic or not, here’s ETH’s market cap in BTC’s terms\n\nAMBCrypto found that ETH’s funding rates have been only positive since the October rally, meaning that traders have continuously opened trade positions in expectation of a price rally.\n\nHowever, with the market approaching an overheated region, a drawback might result in the liquidation of some of these positions."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmJpdGNvaW5zZW5zdXMuY29tL2V0aGVyZXVtLXByaWNlLWNsaW1icy1vdmVyLTIyMDAtaGl0dGluZy1sZXZlbHMtbGFzdC1zZWVuLTE5LW1vbnRocy1hZ28v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 06:53:35 GMT",
        "title": "Ethereum Price Climbs Over $2,200, Hitting Levels Last Seen 19 Months Ago - Bitcoinsensus",
        "content": "Crypto Markets Surge in Bitcoin’s Wake as Ethereum Resiliently Bounces Back\n\nEthereum experienced an 11% surge in value over the last six days, reaching a current high of $2,251.\n\nFactors driving Ethereum’s growth include anticipation of Bitcoin spot ETF approval and applications for Ethereum spot ETFs by major asset management firms.\n\nDespite the positive momentum, Ethereum faces challenges with a looming resistance trendline, signaling a potential risk of a bearish reversal. Investors urged to remain cautious amid historical indicators.\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nThe crypto market has witnessed a recent surge, buoyed by Bitcoin’s recovery. Ethereum (ETH), the second-largest cryptocurrency, has notably rebounded in the past week, surpassing the psychological barrier of $2,000.\n\nEthereum’s positive momentum is attributed to factors such as Bitcoin’s recovery. However, a looming challenge exists in the form of a longstanding resistance trendline, posing a potential risk of a bearish reversal.\n\nFactors Driving Ethereum’s Growth\n\nThe impressive recovery of Ethereum over the last two months can be attributed to several factors contributing to its growth. Notably, Ethereum’s value as seen on coinmarketcap has surged from a recent low of $1,522 to the current level of $2,251, marking a 47.8% increase.\n\nThe anticipation of a Bitcoin spot ETF approval has played a pivotal role in driving Ethereum’s price growth. Additionally, major asset management firms seeking approval for Ethereum spot ETFs have further fueled this upward trajectory.\n\nA technical analysis reveals Ethereum’s recovery as a bullish swing within a wedge pattern. Historical data indicates that when retesting the upper trendline of this pattern, Ethereum often faces increased selling pressure, potentially leading to a substantial correction back to the lower trendline.\n\nAlso Read: Crypto Industry Execs See $100k Price Target for Bitcoin in Newly Ignited Bull Run\n\nPotential Challenges Ahead for Ethereum\n\nWhile Ethereum’s recent surge is promising, there are potential challenges and risks associated with its current price levels. Understanding historical data is crucial for predicting market movements and navigating potential pitfalls.\n\nThe historical significance of Ethereum facing increased selling pressure when retesting the upper trendline cannot be overlooked. This pattern suggests a possibility of a substantial correction back to the lower trendline based on past market behaviors. Investors are advised to remain vigilant in light of these historical indicators.\n\nEnhance Your Crypto Trading Skills With Our Legends’ Trading Masterclass\n\nEmpower your crypto trading skills with our Legends Masterclass. Sign up now and take advantage of our limited-time discount offer! Join the class today."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZW5nLmFtYmNyeXB0by5jb20vZXRoZXJldW0tbmZ0LW1hcmtldC1zZWVzLXJlc3VyZ2VuY2Utd2hhdC1wcm9tcHRlZC10aGUtYm9vbS_SAVlodHRwczovL2VuZy5hbWJjcnlwdG8uY29tL2V0aGVyZXVtLW5mdC1tYXJrZXQtc2Vlcy1yZXN1cmdlbmNlLXdoYXQtcHJvbXB0ZWQtdGhlLWJvb20vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Ethereum NFT market sees resurgence – What prompted the boom? - AMBCrypto English",
        "content": "There has been an increase in demand for Ethereum-based NFTs.\n\nGeneral NFT trading activity has picked up pace in the last month.\n\nThe Ethereum [ETH] non-fungible token (NFT) market experienced a significant surge in trading activity on 3rd December, reaching a daily transaction volume of $34.786 million.\n\nThis marks the highest daily volume for NFTs minted on the Ethereum network since 29th June, according to data from a Dune Analytics dashboard by Hildobby.\n\nInvestors are picking up more digital collectibles\n\nFollowing an extended period of low interest in this asset class category, the last month has seen a significant uptick in NFT trading activity.\n\nAs of this writing, the general NFT market capitalization was $8.7 billion. Data from NFTGo showed it has grown by over 48% in the last 30 days due to the surge in demand for NFTs.\n\nInformation from the data provider showed that the last time the NFT market capitalization was this high was in June.\n\nLikewise, NFT sales volume has totaled $585 million in the last month, growing by 110%.\n\nTherefore, the uptick in daily trading volume recorded on Ethereum mirrors the general growth in NFT trading activity in the last month.\n\nIn November, the sales volume of Ethereum-based NFTs was $348 million. This represented a 108% month-over-month (MoM) growth from the $167 million recorded in October.\n\nAMBCrypto found that this was the first time since February that Ethereum would record an MoM uptick in NFT sales volume.\n\nIn February, the chain recorded a monthly sales volume of $949.49 million. However, as sentiments grew poorer in the first and second quarters of the year and investors moved away from speculative asset classes, NFT trading activity plummeted.\n\nBetween February and October, NFT sales volume on Ethereum fell by 82%, data from CryptoSlam showed.\n\nThere is a catch\n\nInterestingly, despite the surge in general NFT trading activity on the Ethereum network, the floor prices of its leading projects, Bored Ape Yacht Club (BAYC) and CryptoPunks, have declined in the last month.\n\nAt press time, an NFT from the BAYC collection cost 30.15 ETH, having declined by 6% since 10th November.\n\nRealistic or not, here’s ETH’s market cap in BTC terms\n\nMarket participants have taken advantage of the steady fall in BAYC’s floor price, with sales volume increasing by more than 50% in the past month.\n\nRegarding the CryptoPunks collection, its floor price has also registered a 3% decline since 13th November, per data from NFT Price Floor."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vZmluYm9sZC5jb20vaXMtaXQtdG9vLWxhdGUtdG8taW52ZXN0LWluLWV0aGVyZXVtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Is it too late to invest in Ethereum? - Finbold - Finance in Bold",
        "content": "Amid the massive bullish move by the vast number of assets in the cryptocurrency industry, Ethereum (ETH), as the second-largest cryptocurrency by market capitalization, is no exception, having rallied over 10% in the last seven days alone. So, is it too late to invest in it?\n\nAs it happens, renowned crypto trading expert Ali Martinez recently argued that Ethereum above $2,000 might just be a “prime buying moment” for the digital asset, considering that traders purchased a large volume of ETH around this price level, as Finbold reported on December 4.\n\nETH holders in/out of money. Source: Ali Martinez\n\nOver $3,500 in cards?\n\nEarlier, the professional crypto trader highlighted that Ethereum securing a “sustained weekly candlestick close above $2,150” could pave the way “for an exciting uptrend,” setting the price targets at $2,600 and at $3,500 afterward, as he explained in his chart pattern analysis.\n\nEthereum price action analysis. Source: Ali Martinez\n\nMore recently, the crypto analyst CoinsKid observed Ethereum’s corrective flag from April to September, arguing it indicated that the asset “should be trying to tap the upper red line in time,” referring to the price level at $3,602 in his analysis shared in an X post on December 6.\n\nEthereum price analysis and prediction. Source: CoinsKid\n\nIt is also worth pointing out that the crypto analytics platform Santiment has witnessed signs of ‘fear of missing out’ (FOMO) on Ethereum as open interest and longs increase, leading to its market value eclipsing $2,250 for the “first time since May 11, 2022,” or nearly 19 months.\n\nEthereum open interest and longs. Source: Santiment\n\nEthereum price analysis\n\nAs things stand, Ethereum is currently trading at the price of $2,280.76, recording a 3.40% gain on the day, as well as increasing 10.24% across the previous week and making a 20.88% advance on its monthly chart, according to the most recent data on December 6.\n\nEthereum 30-day price chart. Source: Finbold\n\nIn conclusion, considering its historical price action and analyses, there might still be time to invest in Ethereum. However, the asset looks to be making strong bullish attempts that could go even stronger in the near future under the right market sentiment, so the price might not stay at these levels for long.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vY3J5cHRvLm5ld3MvZXRoZXJldW0tY2xhc3NpYy1zdGFnbmF0ZXMtYXMtaW52ZXN0b3JzLWV4cGxvcmUtcmViZWwtc2F0b3NoaS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Classic stagnates as investors explore Rebel Satoshi - crypto.news",
        "content": "Disclosure: This article does not represent investment advice. The content and materials featured on this page are for educational purposes only.\n\nEthereum Classic ranges around $19\n\nRebel Satoshi offers a rebel-driven meme token\n\nThe recent stagnation in Ethereum Classic (ETC) has prompted some investors to explore alternatives. Rebel Satoshi (RBLZ) is gaining attention as a potential investment before the end of 2023. The project focuses on financial decentralization with rebel-themed memes. It is currently in the second phase of its presale.\n\nEthereum Classic stalls around $19 zone despite Ethereum gains\n\nEthereum Classic operates in the shadow of Ethereum despite sharing a positive correlation.\n\nNews surrounding exchange-traded funds (ETFs) has primarily centered around Ethereum. BlackRock initiated the ETF discussions for Bitcoin in June 2023.\n\nYou might also like: Cardano Founder Speaks On Ethereum Classic (ETC) Twitter Account Ban\n\nAfter applying for an Ethereum ETF in November 2023, Fidelity followed suit. This institutional interest has kept Ethereum close to its November 2023 high of $2,136.\n\nIn contrast, Ethereum Classic’s price has remained steady at around $19 in recent weeks, pointing to stagnation in on-chain metrics.\n\nFor instance, the current average transaction value for Ethereum Classic is $221, lower than in July 2022.\n\nDespite this, analysts expect ETC to reach $30 in the coming sessions.\n\nRebel Satoshi resonates with defiant investors\n\nRebel Satoshi aims to revolutionize the financial landscape by redistributing wealth to ordinary people.\n\nDrawing inspiration from iconic figures like Satoshi Nakamoto and Guy Fawkes, Rebel Satoshi seeks to empower a community of rebels to challenge the status quo.\n\nRebel Satoshi has a fixed token supply of 250 million RBLZ, ensuring scarcity and fostering long-term value growth. This approach starkly contrasts traditional finance’s inflationary currencies.\n\nYou might also like: Rebel Satoshi draws Dogecoin holders\n\nThe project offers several features that reward and engage its community:\n\nStaking Hub: Users can earn passive income by staking their RBLZ, contributing to the security of the Rebel Satoshi blockchain.\n\nUsers can earn passive income by staking their RBLZ, contributing to the security of the Rebel Satoshi blockchain. Rebel Artefacts Vault: A treasure trove of 9,999 NFTs based on symbolic digital art characters, offering holders exclusive benefits and ownership rights.\n\nEarly adopters of Rebel Satoshi enjoy additional perks, including governance power, insider updates, and induction into the Rebel Meme Hall of Fame.\n\nThe Rebel Satoshi presale commenced on Bonfire Night (Nov. 5, 2023) in honor of Guy Fawkes’ spirit.\n\nThe Early Bird Round sold out in three weeks. Afterward, prices rose from $0.010 to $0.013.\n\nThe token is projected to reach $0.025 at the end of the presale.\n\nVisit the official Rebel Satoshi Presale Website or contact Rebel Red via Telegram for more details.\n\nDisclosure: This content is provided by a third party. crypto.news does not endorse any product mentioned on this page. Users must do their own research before taking any actions related to the company.\n\nFollow Us on Google News"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMi8wNS90b3AtdHJhZGVyLXNheXMtb25lLWxvdy1jYXAtYWx0Y29pbi1hYm91dC10by1zZW5kLXRocm91Z2gtdGhlLXJvb2YtcHJlZGljdHMtY2FwaXRhbC1mbG93cy1iYWNrLXRvLWV0aGVyZXVtL9IBkAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMi8wNS90b3AtdHJhZGVyLXNheXMtb25lLWxvdy1jYXAtYWx0Y29pbi1hYm91dC10by1zZW5kLXRocm91Z2gtdGhlLXJvb2YtcHJlZGljdHMtY2FwaXRhbC1mbG93cy1iYWNrLXRvLWV0aGVyZXVtL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Top Trader Says One Low-Cap Altcoin About To ‘Send Through the Roof,’ Predicts Capital Flows Back to Ethereum - The Daily Hodl",
        "content": "A widely followed crypto analyst says that one low-cap decentralized finance (DeFi) altcoin is setting the stage for a massive rally.\n\nPseudonymous crypto trader The Flow Horse tells his 189,600 followers on the social media platform X that key metrics indicate Pendle (PENDLE), which allows users to tokenize and sell future yields, is about to soar.\n\n“Ok PENDLE looks like it is about to absolutely send through the roof.\n\n• Complete recovery.\n\n• New yearly highs s/r flip (support/resistance) successful.\n\n• Low float.”\n\nPendle is trading for $1.24 at time of writing, up 11.5% in the last 24 hours.\n\nNext up, the trader predicts that capital will begin to flow into Ethereum (ETH) on a massive scale after the rallies for Bitcoin (BTC) and ETH competitor Solana (SOL) slow down.\n\n“The fact that most people have their attention on Solana, most people have their attention on BTC, and ETH is kind of being mocked because it’s not following through with the same intensity that everything else is, I think is setting up for a big catch up play. So from a technical standpoint, ETH looks like it is just beginning to break out and in a similar way that BTC has already done a while ago.\n\nSo, I’m confident that this is going to catch up. And I’m confident that when BTC cools down, and after January 10th, ETFs (exchange-traded fund) approved, fingers crossed, that we’re going see a lot of capital flow back into ETH. I think you can expect that some capital that’s in Solana will flow back to ETH as well.”\n\nEthereum is trading for $2,232 at time of writing, up 1.4% in the last 24 hours.\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMipAFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3RvcC0zLXByaWNlLXByZWRpY3Rpb24tYml0Y29pbi1ldGhlcmV1bS1yaXBwbGUtYnRjLWV5ZXMtNTAtMDAwLWFzLWJsb29tYmVyZy1zcGVsbHMtbmV3LWNyeXB0by1zdXBlcmN5Y2xlLTIwMjMxMjA1MTkwMNIBqAFodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy90b3AtMy1wcmljZS1wcmVkaWN0aW9uLWJpdGNvaW4tZXRoZXJldW0tcmlwcGxlLWJ0Yy1leWVzLTUwLTAwMC1hcy1ibG9vbWJlcmctc3BlbGxzLW5ldy1jcnlwdG8tc3VwZXJjeWNsZS0yMDIzMTIwNTE5MDA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC headstrong as Spot ETF talks reach technical stage - FXStreet",
        "content": "Share:\n\nBitcoin price could flip $43,860 into a support floor, bringing the $50,000 psychological level into view.\n\nEthereum price could climb 7% to the $2,500 level as bulls show determination.\n\nRipple price could extend 10% north as bulls make a comeback in the XRP market.\n\nBitcoin (BTC) price remains steadfast on the higher timeframe, amid news that spot BTC exchange-traded funds (ETF) discussions are now at the technical stage of approval. Specifically, talks with Spot BTC ETF issuers have advanced to key technical details, with Reuters indicating that it could signal a shift toward a potential approval.\n\nAlso Read: This is the level to beat as Bitcoin eyes $50,000 next\n\nBitcoin price could overcome $43,860\n\nBitcoin (BTC) price is confronting the $43,860 critical support, marking the midline of a weekly supply zone extending from $40,698 to $46,999. A decisive candlestick close above this mean threshold on the weekly timeframe would confirm the continuation of the primary trend, flipping the supply barrier into a bullish breaker and using it as the springboard for a race to the $50,000 psychological level.\n\nThe Relative Strength Index (RSI) remains northbound despite BTC being overbought, indicating momentum continues to rise. Meanwhile, the histogram bars of the Awesome Oscillator (AO) remain in positive territory, flashing green to show that bulls are leading the BTC market. These bolster the case to the upside.\n\nBTC/USDT 1-week chart\n\nOn the flipside, if the supply zone holds as a resistance level, Bitcoin price could face a rejection, deflecting south to lose the support offered by the $40,000 psychological level. In a worse case, the fall could extend to the $30,000 psychological level, with a weekly candlestick close below this level invalidating the bullish thesis.\n\nAlso Read: Bitcoin price hits $44,000 as Coinbase CEO speculates BTC could be key to extending Western civilization\n\nEthereum price could climb 7%\n\nEthereum (ETH) price action remains bullish since mid-October, consolidating within an ascending parallel channel. This is a bullish technical formation, promising more growth as long as the asset’s price remains within its confines.\n\nWith both the RSI and AO indicators supporting the bullish outlook, Ethereum price could rise 7% to the $2,500 level last tested in May 2022.\n\nETH/USDT 1-day chart\n\nConversely, should profit-taking kick in, Ethereum price could fail to realize the $2,500 target. The ensuing selling pressure could see ETH dwindle to lose the $2,147 support.\n\nEthereum price could then extend a leg down, converting the midline of the April 18 supply zone extending from $2,049 to $2,107 from a resistance area into a support area by breaking and closing below its midline at $2,075. A daily candlestick close below this level would not only invalidate the bullish thesis but also confirm the continuation of the downtrend.\n\nAlso Read: Ethereum Price Prediction: ETH attempts to flip $2,300 into support"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vZmluYm9sZC5jb20vcnVtb3JzLW9mLWV0aGVyZXVtLXNlbGwtb2ZmLWJ5LTMtaW5zdGl0dXRpb25hbC1naWFudHMtZ2Fpbi10cmFjdGlvbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Rumors of Ethereum sell-off by 3 institutional giants gain traction - Finbold - Finance in Bold",
        "content": "Ethereum (ETH) reached its yearly high of $2,310 per token on December 6. Amidst this surge, institutional giants deposited 19,822 ETH ($45.2 million) to cryptocurrency exchanges.\n\nNotably, Galaxy Digital, Celsius, and FTX have signaled their intention to sell a relevant part of their stacks. SpotOnChain gathered this data from known crypto wallet addresses of these giant institutional investors.\n\nMoreover, Celsius and FTX have been constantly selling Ethereum and other tokens in 2023. Both companies filed for bankruptcy during the cryptocurrency bear market, which demanded these liquidations.\n\nHowever, Galaxy Digital is still operational under Mike Novogratz’s leadership. Novogratz became known for his support of the collapsed Terra (LUNA) and a remarkable LUNA body tattoo.\n\nInstitutional Giants’ ETH activity\n\nGalaxy Digital made three separate transactions, depositing 9,179 ETH to Binance at an average rate of $2,278, resulting in $20.9 million moved. Despite this sizable transfer, Galaxy Digital’s wallets continue to hold 10,038 ETH, valued at approximately $22.8 million.\n\nGalaxy Digital on-chain portfolio. Source: SpotOnChain\n\nCelsius Network’s activity was also notable, as it transferred 7,500 ETH at $2,273 each to a Coinbase intermediate address identified as 0xc45, cumulating $17.05 million.\n\nSince November 14, Celsius has moved a total of 44,769 ETH, tallying up to $94.7 million. Of this total, 37,269 ETH have already reached platforms, including Coinbase, FalconX, and OKX, averaging a transfer price of $2,084, amounting to $77.6 million.\n\nFinally, FTX, shifting 3,143 ETH to Coinbase priced at $2,294 each, accounted for $7.21 million of the collective outflow. Cumulatively, FTX and associated entity Alameda Research have moved assets worth $573 million to exchanges since October 24, 2023, including 28,427 ETH with a value of $54.3 million.\n\nThese movements from key giant institutional investors to crypto exchanges may imply a readiness to sell. Essentially, this could potentially exert downward pressure on Ethereum‘s market value.\n\nInterestingly, the timing coinciding with Ethereum’s one-year high suggests that these institutions are seeking to capitalize on the recent price spike."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTIvMDYvdHdvLWtleS1tZXRyaWNzLXNob3ctY3J5cHRvLXRyYWRlcnMtdHVybmluZy10by1ldGhlci1mcm9tLWJpdGNvaW4v0gFyaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMi8wNi90d28ta2V5LW1ldHJpY3Mtc2hvdy1jcnlwdG8tdHJhZGVycy10dXJuaW5nLXRvLWV0aGVyLWZyb20tYml0Y29pbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Key Metrics Show Crypto Traders Turning to Ether From Bitcoin - CoinDesk",
        "content": "Per Amberdata, the one-month ether call-put skew, which measures the spread between implied volatility premium or demand for call and put options expiring in four weeks, has doubled to over 4% this month, a sign of strengthening call bias. Meanwhile, BTC's one-month skew has declined from 5% to 2%, a sign that traders are beginning to lean toward puts relative to calls."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vd3d3LmJlbnppbmdhLmNvbS9tb25leS9jYW4tZXRoZXJldW0taGl0LTEwMDAwLWluLTIwMjTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Can Ethereum Hit $10000 in 2024? - Benzinga",
        "content": "Ethereum has become the most used blockchain and the largest in size, with a TVL of $57.23 billion. The currency used to process transactions on the Ethereum blockchain, ETH, has become the second most valuable cryptocurrency in the world, trailing only Bitcoin. As the market begins to stabilize, ambitious price predictions are being made. Could the price of ETH hit $10,000 in 2024?\n\nEthereum has become the most used blockchain and the largest in size, with a TVL of $57.23 billion. The currency used to process transactions on the Ethereum blockchain, ETH, has become the second most valuable cryptocurrency in the world, trailing only Bitcoin. As the market begins to stabilize, ambitious price predictions are being made. Could the price of ETH hit $10,000 in 2024?\n\nClaim Now Get up to $200 in rewards with Coinbase! Coinbase users can earn up to $200 on average just by taking advantage of our rewards. Claim Now Disclosure: ²Sum of median estimated savings and rewards earned, per user in 2021 across multiple Coinbase programs (excluding sweepstakes). This amount includes fee waivers from Coinbase One (excluding the subscription cost), rewards from Coinbase Card, and staking rewards. ³Crypto rewards is an optional Coinbase offer. Upon purchase of USDC, you will be automatically opted in to rewards. If you’d like to opt out or learn more about rewards, you can click here. The rewards rate is subject to change and can vary by region. Customers will be able to see the latest applicable rates directly within their accounts Show More\n\nCan Ethereum Hit $10,000?\n\nThe question of whether Ethereum can reach a price point of $10,000 is not just a matter of market speculation; it hinges on the underlying technology, the evolution of the platform and its role in the broader digital economy. To forecast Ethereum's potential to hit this target, let’s examine its technological infrastructure and historical market performance.\n\nEthereum stands apart from other cryptocurrencies through its foundational technology – it's a decentralized platform, built for decentralized applications dApps). At its core, Ethereum operates on a blockchain that supports smart contracts – self-executing contracts with the terms of the agreement directly written into code.\n\nThis functionality has opened a wide range of possibilities, from decentralized finance (DeFi) to non-fungible tokens (NFTs) to decentralized autonomous organizations (DAOs). Acronyms aside, there’s a ton of potential in these innovative new products, the key being decentralization. This quality makes Ethereum the backbone of the current crypto-ecosystem, as the most popular applications in crypto are built on Ethereum.\n\nWhy Did Ethereum Crash?\n\nEthereum, like many cryptocurrencies, experiences intense market cycles characterized by rapid price increases followed by sharp declines. For instance, during the 2018-2019 period, Ethereum witnessed a significant crash following the 2017 crypto boom. After reaching a peak price of $1400, ether crashed below $100 in the subsequent years.\n\nThis pattern reflects a typical boom and bust cycle where the initial excitement and overinvestment (often fueled by FOMO) leads to inflated prices, which are unsustainable in the long run. The COVID black swan event in 2020, followed by increased money printing and record-low interest rates, demonstrates this trend.\n\nWhen Will Ethereum Hit All-time Highs?\n\nFor Ethereum to hit all-time highs depends on its technical progression and user adoption, as well as large macro trends. Two upcoming events could play a big role in moving the price of ETH upwards, which are slated to happen in 2024.\n\n\n\nThe Fed may pivot to risk-off with looser monetary policies in 2024. When money flows back into the economy, crypto historically acts like a sponge for the excess liquidity, benefiting Ethereum.\n\n\n\nThe second key event is the Bitcoin halving next year, which decreases the amount of BTC rewarded to Bitcoin miners by 50%, an action that has historically caused the crypto market to rally.\n\nHistory of Ethereum Prices\n\nEthereum's (ETH) price shows a pattern of volatility with significant peaks and troughs. For instance, after its launch in 2015, Ethereum saw a surge in 2017 during the ICO boom followed by a sharp decline in 2018.\n\nHowever, its recovery and subsequent growth, especially with the rise of DeFi and NFTs, indicates a growing confidence in its utility and value. Despite the crash in 2022, these trends may justify a price target of $10,000. While ambitious, it does not seem implausible in the next few years.\n\nCould Ethereum Hit $20,000?\n\nThe likelihood of Ethereum hitting $20,000 in 2024 is quite low, although some people believe in its potential and are willing to bet it will hit this mark next year. More realistically, ETH bulls who believe in the technology are holding for the long term.\n\nThe $20,000 mark is more believable if you are willing to hold for many years. If you zoom out on the ETH chart, you can see a 10x in ETH price has happened before, so you shouldn’t rule it out of happening again.\n\nWhere to Buy Ethereum (ETH)\n\nYou can buy ETH on most trading platforms. One popular platform is Kraken, which offers many other cryptocurrencies, including Ethereum layer 2s. The alternative to a trading platform is to use a non-custodial wallet and purchase from a decentralized exchange (DEX).\n\nIs Ethereum a Good Investment?\n\nInvestment in crypto is almost certain to be volatile. Many altcoins (cryptocurrencies that are not Bitcoin) have crashed to $0. However, Ethereum has shown staying power and has begun to provide enough utility that a lot of the speculatory risk has been lifted.\n\nIndividuals looking to get exposure to crypto outside of Bitcoin tend to hold ETH. The best way to understand if this is a good investment for you is to use the blockchain and get a better understanding of the decentralization philosophy. Then, you can decide for yourself whether this is something you want to trade or hold.\n\nFrequently Asked Questions"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2V0aGVyZXVtLW5ld3MvZXRoZXJldW0tcHJpY2UtMjAyMy1icmVha3Rocm91Z2gtc3VycGFzc2luZy1iaXRjb2luLWFsdGNvaW4tc3VyZ2UtbmV4dC_SAXFodHRwczovL3d3dy5uZXdzYnRjLmNvbS9ldGhlcmV1bS1uZXdzL2V0aGVyZXVtLXByaWNlLTIwMjMtYnJlYWt0aHJvdWdoLXN1cnBhc3NpbmctYml0Y29pbi1hbHRjb2luLXN1cmdlLW5leHQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price 2023 Breakthrough: Surpassing Bitcoin, Altcoin Surge Next? - NewsBTC",
        "content": "For the first time in 2023, the Ethereum price has outperformed Bitcoin across several metrics, hinting at a fundamental shift in market structure. The second cryptocurrency by market capitalization follows the general sentiment in the sector, setting new yearly highs.\n\nAs of this writing, the Ethereum price trades at $2,300 with a 4% profit in the last 24 hours. Over the previous week, the cryptocurrency recorded a 10% profit, with most of the altcoin sector still lagging the current price action.\n\nEthereum Price Signals Strength For Altcoin Sector?\n\nA report from BlockScholes posted by the options platform Deribit indicates a spike in the Ethereum price volatility back to its levels above Bitcoin’s. ETH’s shift in market structure hints at traders and institutions gearing up for early 2024.\n\nThe report claims that the potential approval of a spot in the US ETH Exchange Traded Fund (ETF) is behind the current price action. This new dynamic suggests that the bullish sentiment above this event slipped from Bitcoin to Ethereum.\n\nAs seen in the chart below, Ethereum records a higher return than Bitcoin for the first time since July 2023. The surge in returns, BlockSholes said, allowed ETH to buck a persistent downtrend, but overall, the cryptocurrency’s performance remains in its yearly range.\n\nIn other words, the Ethereum price is doing better than in other periods across 2023 but has yet to resume a bullish momentum concerning Bitcoin. However, the report noted:\n\nThis reversal is not yet strong enough for us to be confident in a return to the market structure that we had previously come to expect, but does indicate that the effects of speculative bets around the application of a spot ETF are not limited to BTC. This is echoed by the implied volatilities for both assets across the term structure, which forecast similar volatility levels for both assets.\n\nWhat Favors An Altcoin Rally\n\nIn addition, the report noted a decline in the US dollar as measured by the DXY Index. Risk assets can thrive as the currency trends lower, potentially hinting at a loose monetary policy by the Federal Reserve (Fed).\n\nIf Ethereum continues gaining bullish momentum from its current levels, the entire altcoin sector could see further profits. The report indicates that most entities and traders are pricing in a “risk event” by the end of January 2024.\n\nThus, Bitcoin and Ethereum may see a more significant rally by that time. Whichever coin prevails might reveal more information on the subsequent trend; if Ethereum outperformed, then altcoins are more likely to follow.\n\nCover image from Unsplash, chart from Tradingview\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vdGhlZGVmaWFudC5pby9zZWMtcG9zdHBvbmVzLWRlY2lzaW9uLW9uLWdyYXlzY2FsZS1zLWV0aGVyZXVtLXRydXN0LWxpc3RpbmctcHJvcG9zYWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 20:44:47 GMT",
        "title": "SEC Postpones Decision on Grayscale's Ethereum Spot ETF Listing - The Defiant - DeFi News",
        "content": "The new deadline for a decision is Jan. 25.\n\nBy: Camila Russo • Loading...\n\nCrypto News\n\nThe U.S. Securities and Exchange Commission has announced an extension for its decision on NYSE Arca's proposed rule change to list shares of the Grayscale Ethereum Trust as an exchange-traded product.\n\nNYSE published the proposal for public comment on Oct. 27, after which the SEC was mandated to approve, disapprove, or initiate proceedings to determine the viability of the proposal within a set timeframe.\n\nOriginally, a 45-day window was set, which would have concluded on Dec. 11. The SEC has now opted to extend this period to Jan 25.\n\nNYSE Arca's proposal to list Grayscale Ethereum Trust shares represents a potential milestone in the acceptance and integration of crypto into traditional financial rails. An Ethereum ETF would facilitate institutional investors' access to the second-largest crypto by market cap .\n\nThe extension, the SEC explains, is to allow ample time for a thorough consideration of the proposed rule change and the issues it raises.\n\n\"The Commission finds it appropriate to designate a longer period within which to take action on the proposed rule change so that it has sufficient time to consider the proposed rule change and the issues raised therein,\" the SEC filing said.\n\nWith the new deadline set, the SEC will have to make a decision to either approve or disapprove the proposed rule change, or begin proceedings to determine whether to disapprove it."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY3J5cHRvLm5ld3Mvc2VjLXBvc3Rwb25lcy1kZWNpc2lvbi1vbi1ncmF5c2NhbGVzLWFwcGxpY2F0aW9uLWZvci1zcG90LWV0aGVyZXVtLWV0Zi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "SEC postpones decision on Grayscale's application for spot Ethereum ETF - crypto.news",
        "content": "The U.S. Securities and Exchange Commission (SEC) has delayed the decision date for Grayscale Investments’ spot Ethereum ETF by 45 days, to Jan. 25, 2024.\n\nAccording to the document, Commission may designate if it finds such longer period to be appropriate and publishes its reasons for so finding or as to which the self-regulatory organization consents.\n\n“The Commission finds it appropriate to designate a longer period within which to take action on the proposed rule change so that it has sufficient time to consider the proposed rule change and the issues raised therein.” SEC statement\n\nYou might also like: Bloomberg: BlackRock and Grayscale meeting with SEC about Bitcoin ETF issuance\n\nBloomberg Intelligence analyst James Seyffart said the delay was expected and “completely normal.”\n\nUpdate: As expected @Grayscale's Ethereum trust filing just got delayed. It was due by 12/6/23 so this is completely normal. pic.twitter.com/I6LXMZIGGN — James Seyffart (@JSeyff) December 5, 2023\n\nIn November, representatives from the agency’s trading and markets department met with Grayscale Investments staff to review the proposed conversion of Grayscale’s publicly traded Bitcoin Trust into a Bitcoin spot ETF. The meeting was attended by David Shillman, deputy director of the SEC’s Division of Trading and Markets, who oversees the US equity, options, and fixed-income markets.\n\nIn November, the SEC also postponed its decision on Hashdex’s application to launch a Bitcoin spot ETF to Jan. 1, 2024. At the same time, the Commission also postponed its decision on Grayscale’s application to launch an ETF based on Ethereum futures.\n\nYou might also like: SEC extends comment window for Franklin Templeton and Hashdex Bitcoin ETFs\n\nFollow Us on Google News"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vY29pbmdhcGUuY29tL2p1c3QtaW4tc2VjLWRlbGF5cy1ncmF5c2NhbGUtZXRoZXJldW0tdHJ1c3QtZXRmLWRlY2lzaW9uLXRvLWphbi0yNS_SAVxodHRwczovL2NvaW5nYXBlLmNvbS9qdXN0LWluLXNlYy1kZWxheXMtZ3JheXNjYWxlLWV0aGVyZXVtLXRydXN0LWV0Zi1kZWNpc2lvbi10by1qYW4tMjUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Ethereum ETF: SEC Delays Grayscale Ethereum Trust ETF Decision to Jan 25 - CoinGape",
        "content": "The U.S. Securities and Exchange Commission (SEC) has announced a 45-day extension for its decision on the Grayscale Ethereum Trust’s application for a spot exchange-traded fund (ETF). Initially set for a verdict by December 6, 2023, the SEC has shifted the deadline to January 25, citing the need for additional time to assess the proposal thoroughly.\n\nGrayscale’s Ethereum Endeavor\n\nGrayscale Investments, a leading name in digital currency investment, submitted a Form 19b-4 in October to transform its Grayscale Ethereum Trust into a spot ETF. Since its inception in March 2019, the trust has voluntarily adhered to SEC reporting standards from October 2020. With an impressive $5 billion in assets under management, it represents a significant 2.5% of all circulating ETH, positioning itself as a dominant player in the ETH investment landscape.\n\nadvertisement\n\nThis decision delay by the SEC is not an isolated event. The regulatory body also recently postponed its decision on the Hashdex Nasdaq Ethereum ETF, which aims to incorporate spot ether and futures contracts into its portfolio. This pattern of deferrals suggests a cautious approach by the SEC towards the nascent but rapidly evolving world of cryptocurrency ETFs. Meanwhile, other financial giants like BlackRock are also in the queue, awaiting regulatory green lights to launch their versions of a spot ether ETF.\n\nNo Room for Spot Bitcoin ETF Yet\n\nIn parallel, the quest for the first U.S. spot Bitcoin ETF continues. Grayscale and other entities like BlackRock and Bitwise have pursued this goal keenly. Despite their efforts and multiple applications, the SEC has consistently delayed its decisions, yet to approve any spot ether or bitcoin fund. This cautious stance reflects the regulator’s emphasis on thorough evaluation amidst the complex dynamics of cryptocurrency markets.\n\nAs Grayscale and its peers await the SEC’s verdict, the world of cryptocurrency investment watches closely. Whether in favor or against, the decision will undeniably have significant implications for the future of cryptocurrency ETFs and their role in mainstream finance. The extended timeline indicates the SEC’s commitment to a comprehensive review process, ensuring that any decision is well-informed and in the best interest of market stability and investor protection.\n\nRead Also: Elon Musk Gets Open Invitation to “Talk” From Argentina’s New President"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vd3d3LmNvaW50cmlidW5lLmNvbS9lbi9ldGhlcmV1bS1hbi11bmRlcnZhbHVlZC1nZW0tYXQtMjIwMC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "The Ethereum Bull Run: Waiting for the Big Takeoff - Cointribune EN",
        "content": "Wed 06 Dec 2023 ▪ 3 min of reading ▪ by Fenelon L.\n\nWhile Bitcoin started 2023 with an explosive surge of over 140% since January, Ethereum remains lagging behind. However, despite solid fundamentals, ETH is still trading 54% below its all-time high. Undervalued, it could soon catch up and take off.\n\nEthereum in Bitcoin’s Shadow\n\nSince the rally began in mid-October, Ethereum has seen a growth of about 30%, significantly less than the astronomical gains of Bitcoin which has jumped by 55%. Observers have noted that Ethereum has not benefited as much as its counterpart from the hype surrounding Bitcoin spot ETFs.\n\nNevertheless, the fundamentals of the Ethereum network remain impressive, as Ryan Sean Adams of Bankless reminded us yesterday: with its annualized profits of $2.7 billion and its price-to-earnings ratio of 98 – even surpassing Amazon’s 75 – the current price of $2200 appears “laughable”.\n\nMoreover, since the merge in September 2022, ETH has embarked on a deflationary trajectory, with a supply reduction of over 293,000 units according to Ultra Sound Money.\n\nIn addition, the attractive remuneration of 5.3% promised to validators for staking makes Ether the “internet bond”. The asset also ticks the ESG boxes with its energy-efficient proof-of-stake mechanism.\n\nUpcoming Growth Drivers on the Horizon\n\nBeyond these solid fundamentals, Ethereum can also soon count on new catalysts. An Ether-backed ETF is likely in 2024, potentially attracting billions of dollars.\n\nSome are even already predicting a rally towards $10,000. It is thus the ideal time to buy before the actual rise begins.\n\nTherefore, with impressive fundamentals and bullish catalysts on the horizon like a possible spot ETF, Ethereum has great potential. Its current price reflects a clear undervaluation. A surge to new heights seems feasible in 2024.\n\nMaximize your Cointribune experience with our 'Read to Earn' program! Earn points for each article you read and gain access to exclusive rewards. Sign up now and start accruing benefits.\n\nClick here to join 'Read to Earn' and turn your passion for crypto into rewards!\n\nA A Lien copié"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vdS50b2RheS9iaXRjb2luLWJ0Yy1rZWVwcy1nYWluaW5nLWdyb3VuZC1hZ2FpbnN0LWV0aGVyZXVtLWV0aNIBSWh0dHBzOi8vdS50b2RheS9iaXRjb2luLWJ0Yy1rZWVwcy1nYWluaW5nLWdyb3VuZC1hZ2FpbnN0LWV0aGVyZXVtLWV0aD9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin (BTC) Keeps Gaining Ground Against Ethereum (ETH) - U.Today",
        "content": "Advertisement\n\nBitcoin (BTC) has continued to strengthen its position against Ethereum (ETH), with the ETH/BTC ratio falling to a new low of 0.052, levels not seen since June 2022. This comes amid the flagship cryptocurrency's massive rally.\n\nBTC clears the $44,000\n\nBitcoin's recent surge has not only bolstered its standing against Ethereum but has also seen it break past the $44,000 mark on the Bitstamp exchange.\n\nThis rally has caught many by surprise and led to a precarious situation for bearish investors. According to data provided by CoinGlass, $159.61 million worth of short positions has been liquidated over the past 24 hours.\n\nA short squeeze, where investors who have bet against the price of an asset are forced to buy back into the market to cover their positions as prices rise, could be on the horizon.\n\nThis phenomenon could propel Bitcoin's price even higher as demand from these covering positions adds to the buying pressure.\n\nBitcoin's dominance keeps climbing\n\nBitcoin has outshone other digital assets, recording superior performance on a 24-hour basis. Ethereum saw a modest 1.9% increase. Meanwhile, Bitcoin's price jumped by 4.0%. This has pushed its market dominance to an impressive 51.3%.\n\nThis outperformance is reflective of the market's current confidence in the crypto king, which is enjoying the spotlight because of the ETF hype."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3RoZXJlLWlzLWEtMjUtcHJvYmFiaWxpdHktb2Ytc29sYW5hLWZsaXBwaW5nLWV0aGVyZXVtLXNhbnRpYWdvLXNhbnRvcy0yMDIzMTIwNTEyMDbSAYUBaHR0cHM6Ly93d3cuZnhzdHJlZXQuY29tL2FtcC9jcnlwdG9jdXJyZW5jaWVzL25ld3MvdGhlcmUtaXMtYS0yNS1wcm9iYWJpbGl0eS1vZi1zb2xhbmEtZmxpcHBpbmctZXRoZXJldW0tc2FudGlhZ28tc2FudG9zLTIwMjMxMjA1MTIwNg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "There is a 25% probability of Solana flipping Ethereum: Santiago Santos - FXStreet",
        "content": "Share:\n\nFormer ParaFi Capital partner Santiago Santos said Solana could flip Ethereum in the next crypto market cycle.\n\nThe web3 investor said there is a 25% probability that SOL flips Ethereum.\n\nSolana trades at $59.90, losing around 3% on the day.\n\nIn a recent episode of the Empire podcast, Santiago Santos, former Partner at ParaFi Capital, shares his views on how Solana’s market capitalization could exceed Ethereum’s in the next market cycle.\n\nSantos’ views are shaped by expectations of higher capital inflows in the crypto ecosystem, and a larger share for Solana funds.\n\nAlso read: Ripple transaction count exceeds 1.38 million, XRP price likely to extend gains\n\nSolana could flip Ethereum if these conditions are met\n\nSantos recalls his investment in Ethereum and says that when he first purchased ETH, he did not imagine the altcoin’s market capitalization would climb to billions. At the time of writing, ETH market capitalization is $274.51 billion, and Solana is at a $25.51 billion market cap, according to CoinGecko data. ETH price slowly and consistently increased as capital inflows to altcoin climbed and Ethereum funds received capital from institutional investors.\n\nSantos’ argument is that an increase in funding in Solana could help the altcoin flip Ethereum’s market capitalization. The former ParaFi Capital partner explains that the overall crypto market capitalization does not need to increase necessarily. Instead, capital rotation from Ethereum and the ETH ecosystem’s Layer 2 protocols to Solana and the SOL ecosystem could help drive the change.\n\nEthereum’s market cap doesn’t need to shrink for Solana to flip Ethereum, he said. With its various use cases and boost in utility, SOL and its ecosystem could emerge as a relatively profitable avenue for investment and draw capital from retail and institutional investors in the next crypto market cycle.\n\nSantiago Santos said that the probability of SOL flipping ETH is at 25%. Santos has entertained the idea of selling all his Ether and buying SOL tokens in exchange. The Web3 investor is firm in his thesis of Solana flipping Ethereum in the near future."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vY3J5cHRvLm5ld3MvYW5hbHlzdC1idWxsaXNoLW9uLWV0aGVyZXVtLWFzLXhycC1tb21lbnR1bS1idWlsZHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Analyst bullish on Ethereum as XRP momentum builds - crypto.news",
        "content": "Disclosure: This article does not represent investment advice. The content and materials featured on this page are for educational purposes only.\n\nInvestors consistently seek high-growth projects and closely monitor the top 10 list to identify altcoins with potential. XRP and Ethereum (ETH) recently posted vital milestones.\n\nEthereum broke above $2,000 and XRP maintained its position above the $0.62 price range despite broader market decline.\n\nXRP stays above $0.62\n\nXRP is up 53% in the past year, surging above $0.5 and $0.56.\n\nAfter several failed attempts, it regained momentum and broke out again, rising to $0.62.\n\nYou might also like: Analyst likens upcoming XRP run to Bitcoin\n\nIn November, XRP soared 13% but faced rejection at $0.71.\n\nAnalysts expect XRP to reach $0.9482 by the start of 2024.\n\nEthereum could surge above $3,000\n\nEthereum recently broke above key resistance levels at $1,982 and $2,044.\n\n1.7 million wallets acquired 38.7 million ETH, valued at over $81.4 billion.\n\nYou might also like: Ethereum reaches 20-month high amid rising investor optimism\n\nOne analyst notes that ETH has strong support and minimal resistance.\n\nWith a market cap above $250 billion, ETH prices, analysts say, might surge above $3,000 in early Q1 2024.\n\nExploring alternatives\n\nWhile long-term investors are considering XRP and Ethereum, their projected price upswings may take time to materialize. As such, others are exploring alternatives for immediate gains.\n\nPullix (PLX) offers a fresh approach to traditional finance. As a community-backed exchange, Pullix aims to reshape how individuals interact with the global market.\n\nYou might also like: 28 cryptocurrency firms in India register with national anti-money laundering agency\n\nThe platform will provide everyday access to global markets, including crypto, from any location. PLX holders will also benefit from a share of the platform’s daily revenues.\n\nThe exchange fosters real-time community engagement, ensuring secure and encrypted transactions while adhering to relevant regulations and licensing requirements.\n\nIn its early release stage, PLX is available for $0.04, but analysts expect more gains once it is listed on tier-1 exchanges.\n\nSite: https://pullix.io/\n\nTwitter: https://x.com/pullixmarkets\n\nDisclosure: This content is provided by a third party. crypto.news does not endorse any product mentioned on this page. Users must do their own research before taking any actions related to the company.\n\nFollow Us on Google News"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zcG90LWJpdGNvaW4tZXRmLWJlZ2luLXRyYWRpbmctc2Vjb25kLXF1YXJ0ZXItaGFzaGRleNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Hashdex tips spot Bitcoin ETFs to trade by Q2, followed by Ethereum - Cointelegraph",
        "content": "Hashdex, one of the 13 asset managers vying for a spot Bitcoin (BTC) exchange-traded fund, expects to see the first spot Bitcoin ETF in the United States land by the second quarter of 2024, followed by a spot Ether (ETH) ETF.\n\n“The exact timing of a spot Bitcoin ETF in the U.S. remains unclear, but in 2023, the narrative around this product switched from a question of ‘if’ to a matter of ‘when,’” said Hashdex’s U.S. and Europe head of product Dramane Meite in a 2024 outlook report, published on Dec. 4.\n\n“We believe U.S. investors will have access to a spot Bitcoin ETF by the second quarter of the new year and that a spot Ether ETF is likely to follow.”\n\nHashdex is one of 13 asset managers with a spot Bitcoin ETF application before the U.S. Securities and Exchange Commission (SEC). It has also pitched a hybrid Ether ETF with futures and spot contracts to the regulator.\n\n⚡️ In our latest Hash Insider\n\n\n\nHashdex releases our 2024 #Crypto Investment Outlook\n\n#SEC continues its work on #spot #bitcoin ETFs\n\nUK asset managers given go-ahead to launch ‘tokenized’ funds\n\n\n\n& more!https://t.co/O8uESoYJ03 — Hashdex (@hashdex) December 4, 2023\n\nWhile Bloomberg ETF analysts James Seyffart and Eric Balchunas have pinned 90% odds that spot Bitcoin ETFs will be approved in the days leading up to Jan. 10, 2024, Seyffart has previously noted that this refers only to the 19b-4 applications and that the separate Form S-1 must also be approved for an ETF to launch.\n\nSeyffart noted in November that “there could be weeks or even months between approval and launch.”\n\nWhat Scott said: There are TWO paths that need to be completed for an ETF launch. Even if 19b-4 is approved, S-1s still need sign off from division of Corp Fin. No sign that's done yet. Possible and even likely that there could be weeks or even months between approval & launch https://t.co/LZSdutmlT8 pic.twitter.com/7OLj5HjSDy — James Seyffart (@JSeyff) November 8, 2023\n\nCompanies use Form S-1 to notify the SEC of proposed rule changes and require sign-off from the agency’s Division of Corporation Finance.\n\nRelated: Bitcoin the ‘main beneficiary’ as crypto funds notch 10-week streak\n\nIn Hashdex’s report, Meite said spot Bitcoin and Ether ETFs would see “legacy asset managers with thousands of staff and trusted brands” offer their customers a crypto product for the first time.\n\nHe believed this would unlock a $50 trillion market, larger than Europe, Canada and Brazil combined — the only three global markets with spot crypto exchange-traded products.\n\nMeite expected most of the interest in single-asset ETFs will focus on Bitcoin and Ether, “given their name recognition and little differentiation among incumbents.”\n\nMagazine: How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMimgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL29reC12ZW50dXJlcy1qb2lucy1ldGhlcmV1bS1jbGltYXRlLXBsYXRmb3JtLWFzLWEtbGF1bmNoLXBhcnRuZXItdG8tYWR2YW5jZS1zdXN0YWluYWJpbGl0eS1pbi13ZWIzLTMwMjAwNzEwMi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "OKX Ventures Joins Ethereum Climate Platform As a Launch Partner to Advance Sustainability in Web3 - PR Newswire",
        "content": "SINGAPORE, Dec. 6, 2023 /PRNewswire/ -- OKX Ventures, the investment arm of leading crypto exchange and Web3 technology company OKX , today announced that it has joined the Ethereum Climate Platform (ECP) as a launch partner, underscoring its commitment to sustainability and decarbonization in the Web3 ecosystem.\n\nThe ECP is an innovative platform created after the transformative Ethereum Merge, leveraging the best of Web3 and traditional climate finance, technology, structures, and services. The platform is designed to galvanize climate solutions with Web3 innovation and address Ethereum's carbon emissions since its launch in 2015.\n\nOKX Ventures, with the support of the OKX Web3 team, joined a coalition of companies dedicated to expediting decarbonization and amplifying climate action through the deployment of cutting-edge technology and the cultivation of digital environmental assets. These are instrumental in reducing greenhouse gas emissions and fostering enduring environmental and societal benefits. OKX's rigorous approach to \"proof of reserves\" demonstrates a commitment to the unique properties of blockchains as a tool to track and validate critical metrics, a principle that is also essential for effective climate investment.\n\nFacilitated by Consensys and climate tech firm Allinfra, other launch partners of the ECP include industry leaders like Microsoft, Polygon and NEAR Foundation.\n\nOKX Ventures Partner Jeff Ren said: \"As an active member of The Nature Conservancy, I'm thrilled that the OKX Ventures and OKX Web3 teams are collaborating with the Ethereum Climate Platform. This partnership underscores our shared commitment to integrating social responsibility and environmental stewardship into Web3 systems globally. We embrace this opportunity and responsibility to pioneer sustainable blockchain innovation to create lasting value for both people and the planet.\"\n\nECP Executive Director Anna Lerner said: \"Through this partnership, the OKX Ventures and Web3 teams are demonstrating their leadership in sustainable innovation across Web3. Its partnership with the Ethereum Climate Platform and support of Gitcoin demonstrate a dedication to ESG principles, open-source collaboration and community support. This partnership also signals a new era of eco-conscious blockchain advancement.\"\n\nOKX Ventures' participation in the ECP sets a new standard for environmentally conscious blockchain advancement in the Web3 space. It is also an important step toward its vision of an open, equitable and sustainable future of Web3.\n\nAbout OKX Ventures\n\nOKX Ventures is the investment arm of the leading crypto exchange and Web3 technology company OKX. It focuses on exploring the best blockchain projects globally, supporting cutting-edge blockchain technology innovation, promoting the healthy development of the global blockchain industry, and investing in long-term structural value.\n\nThrough its commitment to supporting entrepreneurs who contribute to the development of the blockchain industry, OKX Ventures helps build innovative companies and brings global resources and historical experience to blockchain projects.\n\nFind out more about OKX Ventures here .\n\nAbout OKX\n\nA leading global technology company driving the future of Web3, OKX provides a comprehensive suite of products to meet the needs of beginners and experts alike, including:\n\nOKX Wallet: The world's most powerful, secure and versatile crypto wallet which gives users access to over 70 blockchains while allowing them to take custody of their own funds. The wallet includes MPC technology which allows users to easily recover access to their wallet independently, removing the need for traditional, 'written down' seed phrases. In addition, OKX Wallet's account abstraction-powered Smart Account enables users to pay for transactions on multiple blockchains using USDC or USDT, and interact with multiple contracts via a single transaction.\n\nwallet which gives users access to over 70 blockchains while allowing them to take custody of their own funds. The wallet includes MPC technology which allows users to easily recover access to their wallet independently, removing the need for traditional, 'written down' seed phrases. In addition, OKX Wallet's account abstraction-powered Smart Account enables users to pay for transactions on multiple blockchains using USDC or USDT, and interact with multiple contracts via a single transaction. DEX: A multi-chain, cross-chain decentralized exchange aggregator of 300+ other DEXs and approximately 15 bridges, with 200,000+ coins and more than 20 blockchains supported.\n\nexchange aggregator of 300+ other DEXs and approximately 15 bridges, with 200,000+ coins and more than 20 blockchains supported. NFT Marketplace : A multi-chain, zero-fee NFT marketplace that gives users access to NFT listings across seven top-tier marketplaces including OpenSea, MagicEden, LooksRare and Blur.\n\nOKX partners with a number of the world's top brands and athletes, including English Premier League champions Manchester City F.C., McLaren Formula 1, The Tribeca Festival, Olympian Scotty James, and F1 driver Daniel Ricciardo.\n\nAs a leader building innovative technology products, OKX believes in challenging the status quo. The company recently launched a global brand campaign entitled The System Needs a Rewrite, which advocates for a new paradigm led by Web3 self-managed technology.\n\nTo learn more about OKX, download our app or visit: okx.com\n\nAbout ECP\n\nInspired by the Ethereum Merge, a group of technology companies—aligned around the mission of accelerating decarbonization and scaling climate action—the ECP was founded to accelerate climate action at scale by funding high-quality carbon mitigation projects and accelerating Paris-aligned climate investments. The platform is also committed to redressing and counteracting the historical Ethereum-based carbon footprint, dating back to the network's launch in 2015, and accelerating the ECP launch partners' own decarbonization strategies.\n\nDisclaimer\n\nSOURCE OKX Ventures"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zZWMtZGVhZGxpbmUtZ3JheXNjYWxlLXNwb3QtZXRoZXJldW0tZXRm0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "SEC pushes deadline to decide on Grayscale spot Ether ETF - Cointelegraph",
        "content": "The United States Securities and Exchange Commission has delayed its decision on whether to approve or disapprove of a spot Ether (ETH) exchange-traded fund, or ETF, offering from asset manager Grayscale.\n\nIn a Dec. 5 notice, the SEC said it would designate a longer period on whether to approve or disapprove of a proposed rule change that would allow NYSE Arca to list and trade shares of the Grayscale Ethereum Trust. The commission’s announcement was one of the first following an appellate court ordering the SEC to review Grayscale’s Bitcoin (BTC) ETF offering in October.\n\n“The Commission finds it appropriate to designate a longer period within which to take action on the proposed rule change so that it has sufficient time to consider the proposed rule change and the issues raised therein,” said the SEC. “Accordingly, the Commission [...] designates January 25, 2024, as the date by which the Commission shall either approve or disapprove, or institute proceedings to determine whether to disapprove, the proposed rule change.”\n\nUpdate: As expected @Grayscale's Ethereum trust filing just got delayed. It was due by 12/6/23 so this is completely normal. pic.twitter.com/I6LXMZIGGN — James Seyffart (@JSeyff) December 5, 2023\n\nRelated: Grayscale Bitcoin Trust aims for ETF shift to narrow discount\n\nThe SEC has never approved a spot BTC or ETH exchange-traded fund for listing on a U.S. exchange, though it has given the green light to investment vehicles tied to crypto futures. Bloomberg ETF analyst James Seyffart speculated that should the commission decide to approve a spot BTC ETF, it could move forward with simultaneous approvals of funds from multiple firms.\n\nGrayscale first filed with the SEC to convert shares of its Grayscale Ethereum Trust into a spot Ether ETF in October, adding its name to the list of companies awaiting a decision from the regulator. At the time of publication, applications from firms on spot crypto ETFs included BlackRock, Hashdex, ARK 21Shares, Invesco Galaxy, VanEck and Fidelity.\n\nMagazine: Bitcoin ETF race has a new player, Binance ends support for BUSD, and more: Hodler’s Digest: Nov. 26 – Dec. 2"
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vdW5jaGFpbmVkY3J5cHRvLmNvbS9uZnQtdHJhZGluZy1hY3Rpdml0eS1vbi1ldGhlcmV1bS1zdXJnZXMtcmVhY2hpbmctYS1zaXgtbW9udGgtaGlnaC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "NFT Trading Activity on Ethereum Surges, Reaching a Six-Month High - Unchained - Unchained",
        "content": "NFTs are not dead, these are instead experiencing a resurgence in trading volume following a two-year low.\n\nNon-fungible tokens (NFTs) on the Ethereum blockchain are resurging, hitting their highest trading activity across all marketplaces in six months, following a recent two-year low.\n\nTotal NFT trading volume for the week ending on Monday, Dec. 4 exceeded 105,000 ETH, a more than 250% increase since the week ending on Oct. 9, Nansen data shows. A local trough in early October saw the lowest recorded level since July 2021, right before the first explosion in NFT trading.\n\nThese trends may be indicating an end to NFT winter.\n\nData\n\nfrom CoinGecko shows CryptoPunks, one of the earliest major NFT collections, have experienced an almost 45% jump in floor price over the past 30 days to 57.24 ETH. That figure remains well shy of its all-time high of 125 ETH, however.\n\nThe boom since October suggests that the “market basically agrees that NFTs bottomed,” blockchain analytics firm Parsec CEO Will Sheehan wrote to Unchained on Telegram. “The Punks rally was equivalent to a BTC rally for the NFT market. Now you see pockets of net buying in NFTs, Pudgies the most notable, but in general liquidity and attention in NFTs has inflected,” said Sheehan.\n\nThe surge in NFT trading coincides with ETH rising to around $2,200, a price point that hasn’t been seen since May 2022. “Much of the spike in NFT trading volume has to do with the price movement of ETH,” wrote Cameron Thompson, community manager and editor for NFT gallery Tonic, in an email to Unchained. “ETH’s 20% increase in the past month has not only driven the buying and selling of NFTs, but has also reinforced positive sentiments around tokenized collectibles — sentiments that have not been felt among the Web3 community in many months.”\n\nThe majority of NFT trading volume these days takes place on Blur, the leading marketplace tailored for high-frequency traders, which launched in October 2022, with former market leader OpenSea coming in second.\n\nRenewed Interest and General Appeal Outside the Crypto Ecosystem\n\nCarlos Mercado, a data scientist at blockchain analytics firm Flipside Crypto, expressed two noteworthy reasons for the increased trading volumes for NFTs. The first is renewed interest in “meme” NFTs, like Pixelmon and Milady. “These often serve as proxies for leveraged ETH, so as ETH rises the store of value narrative rises,” Mercado wrote to Unchained via Telegram. In the past 30 days, the floor prices of Pixelmon and Milady have increased 210% and 48%, respectively, per CoinGecko.\n\nThe second, wrote Mercado, is the “noticeable success (led by Nouns & Pudgy Penguins) in breaking out of crypto into the broader culture.” In September, Pudgy Penguins debuted its toy collection across 2,000 Walmart stores in the United States. OpenSea’s Pudgy Penguins page showed that in the past 30 days, volume increased 114% to 15,770 ETH, while its number of sales jumped 58% to 2,267 and floor price grew 83% to 9.7 ETH.\n\nData from blockchain analytics firm Nansen shows that Blur’s lending smart contract holds the most Pudgy Penguins, with 477 NFTs, a roughly 9% increase in the past 24 hours. The second biggest holder of Pudgy Penguins is a smart contract associated with Flooring Protocol, which fractionalizes NFTs to lower barriers to entry for new participants.\n\nPseudonymous Blur co-founder Pacman did not return a request for comment as of press time."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL2NyeXB0b3BvdGF0by5jb20vZXRoZXJldW0tcHJpY2UtaW4tZGFuZ2VyLWRvcm1hbnQtd2hhbGUtc3BhcmtzLXNlbGwtb2ZmLWNvbmNlcm5zLWFmdGVyLW1vdmluZy05MG0td29ydGgtb2YtZXRoLXRvLWtyYWtlbi_SAYUBaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL2V0aGVyZXVtLXByaWNlLWluLWRhbmdlci1kb3JtYW50LXdoYWxlLXNwYXJrcy1zZWxsLW9mZi1jb25jZXJucy1hZnRlci1tb3ZpbmctOTBtLXdvcnRoLW9mLWV0aC10by1rcmFrZW4vP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price in Danger? Dormant Whale Sparks Sell-Off Concerns After Moving $90M Worth of ETH to Kraken - CryptoPotato",
        "content": "TL;DR\n\nMassive ETH Whale Movement: A dormant ETH whale moved $90 million worth of ETH to Kraken, signaling potential selling pressure on the market.\n\nA dormant ETH whale moved $90 million worth of ETH to Kraken, signaling potential selling pressure on the market. Market Impact: The transfer could affect ETH’s market by at least 2%, with implications for Kraken’s trading depth and broader market dynamics.\n\nThe transfer could affect ETH’s market by at least 2%, with implications for Kraken’s trading depth and broader market dynamics. Crypto Market Trends: The event aligns with increased whale activity and a bullish trend in altcoins, indicating a possible shift in market behavior.\n\nMassive Crypto Whale Wakes Up, Chooses Violence\n\nThe crypto community was alerted this week of a massive ETH whale that has moved nearly $90 million worth of ETH to Kraken, Lookonchain first reported.\n\nWhat set the alarms off is that the whale remained dormant for at least five years and is most likely looking to sell, which could put significant downward pressure on the second-largest crypto-asset, which recently tested $2.2k.\n\nLookonchain said the whale deposited 39,260 ether to Kraken during the Asian morning hours. The address previously received 47,260 ether in a single transaction in 2017, valued at over $11 million.\n\nAn early $ETH whale appears to be selling ETH again after being dormant for 5 years. The whale deposited all 39,260 $ETH($87.5M) to #Kraken 30 mins ago. The whale received 47,260 $ETH($11.34M) at ~$240 from June to August 2017. If sold the whale would make a profit of ~$78M. pic.twitter.com/v0PI4LNTKO — Lookonchain (@lookonchain) December 5, 2023\n\nMoreover, it doesn’t seem like the address is linked to an exchange’s cold storage. However, further analysis from Arkham suggests one transaction might be connected to a trading firm called Cumberland, a crypto trading firm and liquidity provider for institutional clients.\n\nHow Much Could This Sell-off Affect ETH?\n\nAs of Tuesday morning, data indicates Kraken’s current market depth for ETH trading pairs exceeds $5 million. If the whale executes a buy or sale order of this magnitude, it could impact the market by at least 2% in either direction.\n\nWhale activity has increased significantly as the crypto market shows bullish signs. Besides Bitcoin, most altcoins have performed exceptionally well during Q3. Some of the most traded tokens in November were XRP, LINK, and SOL, which saw significant price gains that month as BTC’s dominance waned.\n\nWhile some whales could be taking profits, others position themselves for a potential altcoin season. As CryptoPotato reported, A popular crypto analyst has identified a Golden Cross —a bullish pattern that has historically coincided with altcoin rallies."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9yYW91bC1wYWwtY29tcGFyZXMtc29sYW5hLWFuZC1ldGhlcmV1bS10cm9uLXByaWNlLXByZWRpY3Rpb24tYW5kLWV2ZXJsb2RnZS1vdXRsb29rL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Raoul Pal Compares Solana and Ethereum, Tron Price Prediction and Everlodge Outlook - CryptoPotato",
        "content": "Renowned cryptocurrency expert Raoul Pal has stated that he prefers Solana to Ethereum. He mentioned Solana’s remarkable quickness and efficiency as justification for his choice.\n\nIn other news, the market has regained bullish momentum, with Tron and Everlodge leading the charge. This suggests that prices will trend higher in the near future.\n\nSolana (SOL) Faster Than Ethereum, According To Raoul Pal\n\nRaoul Pal, a renowned crypto trader and investor, recently joined the discussion about the supremacy battle between Ethereum and Solana. Pal argued that the Solana blockchain offers a unique and user-friendly experience, making it a strong contender.\n\nIn addition, he explained that Solana is fast, smooth, and user-friendly. This praise for Solana aligned with the overall perception held by many industry leaders after its recovery post-FTX bankruptcy.\n\nCurrently, SOL CoinMarketCap data shows that the Solana coin traded between $53.99 and $61.28 in the past week.\n\nTron (TRX) Price Forecast Bullish\n\nSo far, in 2023, Tron (TRX) has experienced a significant recovery driven by strong growth. Tron competed with top coins like Ethereum and is currently the 10th largest token with a market capitalization of $9.2 billion.\n\nIt has shown bull activity in the last week of November. According to CoinMarketCap, Tron coin moved from a 7-day low of $0.100575 to a 7-day high of $0.109823.\n\nSurprisingly, Tron has recorded 19 green (63%) out of 30 days with 4.04% price volatility over the last 30 days.\n\nEverlodge (ELDG) Revolutionizes the Real Estate Sector With AI Monitoring Technology\n\nEverlodge (ELDG) has made significant strides in revolutionizing the real estate industry, introducing a fresh approach to property trading. In the past, ownership of luxurious villas was confined to only the rich.\n\nEverlodge’s pioneering platform has disrupted this long-standing tradition. It has opened luxury property investments to a broader audience using NFT fractional ownership. In addition, Everlodge has used AI technology to enhance the real estate sector. Now, users can monitor property prices globally.\n\nThis AI tool is designed to provide real-time property value insights for specific locations and timeframes. It can also predict favorable markets for real estate investments. Everlodge has a native token called ELDG. The token gives its holders various benefits discounts on fees, governance rights, and VIP membership.\n\nThe ELDG token can also be staked to earn passive income. Currently priced at $0.025, some experts have forecasted a potential growth in the future. This price is driven by Everlodge’s integration with the vast $280 trillion global real estate market.\n\nFor more information about Everlodge (ELDG) please visit their website.\n\nDisclaimer: The above article is sponsored content; it’s written by a third party. CryptoPotato doesn’t endorse or assume responsibility for the content, advertising, products, quality, accuracy, or other materials on this page. Nothing in it should be construed as financial advice. Readers are strongly advised to verify the information independently and carefully before engaging with any company or project mentioned and do their own research. Investing in cryptocurrencies carries a risk of capital loss, and readers are also advised to consult a professional before making any decisions that may or may not be based on the above-sponsored content.\n\nReaders are also advised to read CryptoPotato’s full disclaimer."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vdS50b2RheS9zb2xhbmEtY29mb3VuZGVyLWp1c3QtY29tcGFyZWQtZXRoZXJldW0tdG8td2luZG93cy05NS1jb21tdW5pdHktcmVhY3Rz0gFaaHR0cHM6Ly91LnRvZGF5L3NvbGFuYS1jb2ZvdW5kZXItanVzdC1jb21wYXJlZC1ldGhlcmV1bS10by13aW5kb3dzLTk1LWNvbW11bml0eS1yZWFjdHM_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Solana Cofounder Just Compared Ethereum to Windows 95, Community Reacts - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nSolana (SOL) cofounder Anatoly Yakovenko has muddled the Ethereum (ETH) hype after he compared the smart contract pioneer to Windows 95 operating software. Speaking on the Unchained Podcast with Laura Shin, Yakovenko argues that Solana is ahead of Ethereum and can be called Windows 2000, which in the evolution of computers is a proper operating system that can process multiple applications at a time.\n\nAdvertisement\n\nThe Ethereum versus Solana debate is a volatile and unending one because the former pioneered the industry and set the pace for Solana. Anatoly Yakovenko himself has often come out to recuse himself from any inflammatory comparison between Solana and Ethereum, as he believes both can coexist.\n\nHowever, in the podcast, the Solana cofounder said the move to build Windows 2000 is necessary as the current bottleneck in the blockchain world, where a single NFT buzz can lead to a gas fee spike in an unrelated transaction, somehow negates what the proponents of the industry are pitching.\n\nDespite his clear position that is far from disdain for Ethereum, the community showed division in the comment, with one party supporting Ethereum and the other supporting Solana.\n\nWho laughs last? Solana or Ethereum\n\nThere is one underlying similarity between both blockchain networks, and that is the ability to host decentralized applications (DApps). The difference lies in their respective speed, cost and general public perception.\n\nDespite its woes, Ethereum is currently the most favored of the lot and boasts of a decentralized finance (DeFi) total value locked (TVL) of $28.661 billion against the $703.46 million of Solana. Only recently did Solana’s trading volume exceed those of Ethereum L2s for the first time.\n\nWhile these figures are significant, both protocols are building for the future, and Solana’s goal remains to become the Apple of the crypto ecosystem.\n\nThe next years will determine a lot about which of the two, or other Ethereum-killers, will stand the test of time."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvZXRoZXJldW0tcHJpY2UtYXMtZ2FsYXh5LWRpZ2l0YWwtbW92ZXMtOTE3OS1ldGgtdG8tYmluYW5jZS1zZWxsLW9mZi1pbmNvbWluZy_SAW5odHRwczovL2NvaW5nYXBlLmNvbS9tYXJrZXRzL2V0aGVyZXVtLXByaWNlLWFzLWdhbGF4eS1kaWdpdGFsLW1vdmVzLTkxNzktZXRoLXRvLWJpbmFuY2Utc2VsbC1vZmYtaW5jb21pbmcvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price As Galaxy Digital Moves 9,179 ETH To Binance, Sell-Off Incoming? - CoinGape",
        "content": "The volatility in the crypto market has intensified since last week, with bulls being on the offensive. Ethereum price extended the breakout above $2,000 reaching highs at $2,300 on Monday alongside the Bitcoin price rally above $44,000.\n\nWith 2.8% gains accrued in the last 24 hours, 11% in seven days, 12% in a fortnight, and 18% over the last 24 hours, ETH price is hovering at $2,260 while bulls search for higher support to keep the uptrend unscathed.\n\nadvertisement\n\nWill Galaxy Digital Transfers To Binance Hold Ethereum Price Rally?\n\nBlockchain data monitoring company Lookonchain highlighted that Galaxy Digital, one of the leading digital fund managers in the industry, had transferred 9,179 ETH to Binance exchange.\n\nAccording to an image from Etherscan shared on X (Twitter), Galaxy Digital made three transactions comprising 3,079, 3,100, and 3,000 ETH with a combined dollar exchange value of $20.9 million.\n\nGalaxy Digital still holds 10,038 ETH worth approximately $22.8 million. Since the transfers to Binance could dampen the uptrend and push ETH price down, traders must plan accordingly and be alert to avoid falling into a bull trap.\n\nRecommended for you: XRP Price Prediction: Will XRP Pump To $1 Before 2024?\n\nFor now, there is a high probability Ethereum will springboard from support at $2,200. Several indicators reinforce the bullish theory starting with the fact that ETH holds above all three MAs—the 21-day Exponential Moving Average (EMA), the 50-day EMA, and the 200-day EMA.\n\nDespite the resistance at $2,300, Ethereum’s position above the Ichimoku Cloud is a significant bullish signal. While traders may be uncertain whether they should buy now or wait for a bigger correction, chances seem to be high that dips would be profitable. Besides, bull markets tend to have trend reversals which allow other sidelined investors to buy into ETH ahead of the next potential breakout.\n\nThat said, it would be prudent to wait until Ethereum resumes the uptrend either from higher support at $2,250 or the grey region marked on the chart before entering new long positions, considering the Relative Strength Index (RSI) is falling back into the neutral area.\n\nFOMO could kick in as Ethereum price blasts through the resistance marked in red at $2,300. A sustained breakout would assure investors of the next major move to $2,500 and subsequently to $3,000.\n\nRelated Articles"
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZGVjcnlwdC5jby8yMDg4NzYvZmF6ZS1jbGFuLWZvdW5kZXItYmFua3Mtc2F5cy1ldGhlcmV1bS1sYXJnZS1wZXJjZW50YWdlLW5ldC13b3J0aNIBYGh0dHBzOi8vZGVjcnlwdC5jby8yMDg4NzYvZmF6ZS1jbGFuLWZvdW5kZXItYmFua3Mtc2F5cy1ldGhlcmV1bS1sYXJnZS1wZXJjZW50YWdlLW5ldC13b3J0aD9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "FaZe Clan Founder Banks Says Ethereum Is 'Large Percentage' of His Net Worth - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIt’s no secret that prominent gaming influencer FaZe Banks loves crypto. Now, he’s buying more.\n\nRichard \"FaZe Banks\" Bengtson is the CEO and co-founder of esports organization and lifestyle brand FaZe Clan. The gamer took to Instagram this week to report his latest crypto purchases and double down on his pro-crypto stance amidst a broader gaming industry where crypto remains a controversial topic.\n\n“Don’t be my typical normie homie and call me asking for plays a year from now when the mainstream media and your mom [are] talking about crypto again,” Banks urged his 2.8 million Instagram followers Tuesday along with a note of Ethereum’s price reaching $2,300, a yearly high.\n\nAD\n\nAD\n\n“Expose yourself now,” Banks continued in a post evangelizing crypto and arguing that potential buyers should look at Bitcoin, Ethereum, and Solana.\n\n“BTC is the safest, ETH is about as safe with slightly more upside in my opinion. My personal favorite. A large percentage of my net worth is in Ethereum,” Banks wrote, adding that in his view, Solana is the “riskiest” of the three cryptocurrencies.\n\n“My money is definitely where my mouth is on this one. Buy it and leave it alone. Chill,” he added.\n\nLike many financial assets and purchases, though, it’s important to note that buying or trading cryptocurrencies comes with risk—and fans should be careful not to take financial advice from influencers or celebrities they follow online. It's often not clear what an influencers motivations may be in promoting a cryptocurrency, NFT project, or any financial asset.\n\nBanks also claimed that he recently spent $200,000 on four altcoins: Prime, Pepe, Mog, and Clouds, the last of which has not yet been officially released.\n\nAD\n\nAD\n\nPrime is the sci-fi NFT card game Parallel’s official token, Pepe is a frog-inspired meme coin which recently rose to a $666 million market cap, and Mog is a meme coin that’s been swirling on Twitter among fans who have paired it with memes of people and animals wearing a specific pair of colorfully-tinted glasses. Clouds is an upcoming token from the Endless Clouds crypto startup that is developing the Treeverse gaming platform.\n\n“These are the first real plays I’ve made since the big market crash,” Banks said, who over the summer also hopped onto the “SocialFi” trend and made over $70,000 by signing up for Friend.tech.\n\nBanks did not immediately respond to Decrypt’s request for comment on his latest crypto purchases.\n\nIt’s worth noting that FaZe Clan’s newly-appointed CEO has been in crypto for years now. Back in 2021, Banks was accused of allegedly pumping and dumping an altcoin he promoted, BankSocial.\n\nAnd a quick glimpse at a wallet connected to Banks called “Banksfucks” currently holds some NFTs from Azuki’s collections, two Bored Apes, four Mutant Ape NFTs, a staggering 72 Otherdeed NFTs for Yuga Labs’ Otherside metaverse game, two Clone X NFTs, and one Doodles NFT, among others. He has also recently boasted of CryptoPunks holdings.\n\nWhile Banks is a crypto and NFT enthusiast, not everyone in FaZe Clan shares this view. The org’s only current female member, Kalei Renay, previously told Decrypt in an interview at TwitchCon that she isn’t a fan of NFTs.\n\n“As a community, everybody hates NFTs,” FaZe Kalei said of gamers. “It’s your money, do whatever, but I don’t care for NFTs. I don’t do crypto, I don’t do any of that. I stay so far away from it.”\n\nAD\n\nAD\n\nEdited by Andrew Hayward"
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vY3J5cHRvLm5ld3MvZXRoZXJldW0tY2FuLXN1cmdlLXRvLTMxMDAtaW5xdWJldGEtb24tYnVsbGlzaC1wYXRoL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Ethereum can surge to $3,100; InQubeta on bullish path - crypto.news",
        "content": "Disclosure: This article does not represent investment advice. The content and materials featured on this page are for educational purposes only.\n\nEthereum (ETH) is up 73% this year and remains the second most popular crypto after Bitcoin (BTC). Speculation surrounds ETH, with many envisioning it surpassing BTC in the future.\n\nMeanwhile, InQubeta (QUBE) is gaining attention due to its growth potential. The project provides access to artificial intelligence (AI) investments.\n\nLaunched on Ethereum, InQubeta utilizes smart contracts, the ERC-20 standard, and fractionalization, enhancing accessibility in crypto investment.\n\nLooking at InQubeta\n\nEthereum has been firm lately, with prices reaching their highest point this year. As the second most popular crypto after Bitcoin, many investors believe it has the potential to become the most popular crypto in the future.\n\nYou might also like: Chainlink slips despite oracle adoption, InQubeta offers an alternative\n\nInQubeta, on the other hand, is a relatively new decentralized finance (defi) project that has been in focus lately due to its approach to artificial intelligence (AI) investments.\n\nWith its features and growth potential, QUBE is increasingly being explored.\n\nDefi meets AI\n\nOn the InQubeta network, companies use non-fungible tokens (NFTs) or ERC-20 coins instead of stocks to raise funds.\n\nThese tokens are created and sold on the NFT marketplace, which provides investors with all the necessary information to make informed investment decisions.\n\nAll trades on the marketplace are in QUBE, the platform’s native token.\n\nLiquidity is high as investors can resell any tokens they purchase on the NFT marketplace anytime.\n\nHolding QUBE also allows individuals to participate in the ecosystem’s democratic governance. Moreover, holders can stake and earn rewards.\n\nEthereum can break above $3,100\n\nCrypto analyst Michael van de Poppe predicts ETH to range between $3,100 and $3,600 if a crucial resistance level at $2,150 is breached.\n\nETH remains on an upward trend, the highest level this year.\n\nThe approval of a spot Bitcoin or Ethereum ETF by the Securities and Exchange Commission (SEC) could propel prices even higher than Poppe’s estimate.\n\nSummary\n\nInQubeta and Ethereum are options investors can consider. QUBE supporters are bullish, expecting more gains in the coming months. Meanwhile, ETH may double in the sessions ahead.\n\nVisit InQubeta Presale\n\nJoin The InQubeta Communities\n\nYou might also like: Bitcoin targets $40k, GMX and InQubeta bullish\n\nDisclosure: This content is provided by a third party. crypto.news does not endorse any product mentioned on this page. Users must do their own research before taking any actions related to the company.\n\nFollow Us on Google News"
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vdGhldG9rZW5pemVyLmlvLzIwMjMvMTIvMDUvc29jaWV0ZS1nZW5lcmFsZS1waW9uZWVycy1kaWdpdGFsLWdyZWVuLWJvbmQtb24tZXRoZXJldW0tYmxvY2tjaGFpbi_SAWtodHRwczovL3RoZXRva2VuaXplci5pby9hbXAvMjAyMy8xMi8wNS9zb2NpZXRlLWdlbmVyYWxlLXBpb25lZXJzLWRpZ2l0YWwtZ3JlZW4tYm9uZC1vbi1ldGhlcmV1bS1ibG9ja2NoYWluLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Societe Generale Pioneers Digital Green Bond on Ethereum Blockchain - The Tokenizer",
        "content": "Societe Generale has successfully issued its inaugural digital green bond as a Security Token, directly registered by SG-FORGE on the Ethereum public blockchain. The digital green bond, valued at EUR 10 million, marks a significant move towards leveraging blockchain’s unique features, offering increased transparency, traceability, and streamlined transaction processes.\n\nThe security tokens associated with the green bond were fully subscribed by two leading institutional investors, AXA Investment Managers and Generali Investments, through a private placement. The transaction, structured as a EUR 10 million senior preferred unsecured bond with a 3-year maturity, will exclusively fund or refinance Eligible Green Activities, as outlined in Societe Generale’s Sustainable and Positive Impact Bond framework.\n\nThis groundbreaking operation demonstrates Societe Generale’s commitment to integrating blockchain for enhanced transparency in ESG (Environmental, Social, and Governance) data. The digital format not only facilitates transparency and traceability but also ensures greater fluidity and speed in transactions and settlements.\n\nKey Innovations:\n\nCarbon Footprint Transparency: Information on the carbon footprint associated with the digital bond infrastructure is accessible 24/7 in open access directly within the bond’s smart contract. This innovative feature allows issuers and investors to measure the carbon emissions of their securities on the financial infrastructure, promoting transparency in ESG considerations. On-Chain Settlement Options: Investors now have the option to settle securities on-chain through the EUR CoinVertible, a digital asset issued by SG-FORGE in April 2023. This complements traditional cash settlement solutions and showcases the versatile capabilities of SG-FORGE in providing a full spectrum of on-chain services.\n\nThis issuance represents Societe Generale’s latest foray into digital instruments, showcasing the innovative services developed by the financial institution. It also reinforces the Group’s debt capital markets capabilities, meeting the rising demand from corporate and institutional clients for digital assets, with a particular emphasis on ESG considerations.\n\nThe move highlights Societe Generale’s dedication to leveraging its financial structuring expertise and SG-FORGE’s technological capabilities to contribute to the development of an innovative and sustainable bond market.\n\nPhoto by J Venerosy on Unsplash\n\nRead other stories: Singapore FinTech Festival 2023 Attracts Record 66,000 Participants\n\nZodia Custody integrates on Metaco network"
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZGVjcnlwdC5jby8yMDg2OTAvZXRoZXJldW0tbmZ0LWNyZWF0b3JzLXNjcmFtYmxlLXNlY3VyZS1wcm9qZWN0cy10aGlyZHdlYi1leHBsb2l00gFfaHR0cHM6Ly9kZWNyeXB0LmNvLzIwODY5MC9ldGhlcmV1bS1uZnQtY3JlYXRvcnMtc2NyYW1ibGUtc2VjdXJlLXByb2plY3RzLXRoaXJkd2ViLWV4cGxvaXQ_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Ethereum NFT Creators Scramble to Secure Projects From Thirdweb Vulnerability - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nSome creators of Ethereum NFT projects are scrambling to secure their collections after Thirdweb, a prominent crypto development platform, disclosed issues with its smart contracts late Monday.\n\nThirdweb wrote that a security vulnerability in a “commonly used open-source library for Web3 smart contracts” was discovered, and that it affects pre-built contracts offered by Thirdweb among others. Smart contracts hold the code that power autonomous decentralized apps (dapps) and NFT collections.\n\nDue to the apparent seriousness of the vulnerability, Thirdweb is not disclosing which open-source library was the root of the exploit, or details on what the issue entails. OpenZeppelin, a widely used open-source library for smart contracts, has since come out to say that the issue isn’t tied to its repository.\n\nAD\n\nAD\n\n“Based on our investigation, the issue is inherent to a problematic integration of specific patterns, and not particular to the implementations contained in the OpenZeppelin Contracts library,” it tweeted—but added that it would still “lead the effort to assess who in the community is affected and provide them with mitigation strategies.”\n\nIMPORTANT On November 20th, 2023 6pm PST, we became aware of a security vulnerability in a commonly used open-source library in the web3 industry. This impacts a variety of smart contracts across the web3 ecosystem, including some of thirdweb’s pre-built smart contracts.… — thirdweb (@thirdweb) December 5, 2023\n\nThirdweb said that it does not believe that any smart contracts have yet been exploited, but it recommends that projects undertake a mitigation process that includes locking down their current smart contract and migrating to a new one, then airdropping tokens to current holders. The company said that it would help cover network fees associated with migrating holders from an affected smart contract.\n\nAccording to Thirdweb, it became aware of the contract vulnerability on November 20 and rolled out a fix to its pre-built smart contract templates on November 22. As a result, any Thirdweb smart contracts deployed after 10 p.m. ET on November 22 are believed to be safe, but those deployed prior to then may be affected.\n\nThe exploit is tied to NFT smart contracts that use the Ethereum ERC-721 and ERC-1155 standards, but also fungible tokens minted via the ERC-20 standard. A full list of affected contract types is available via Thirdweb’s blog post, along with a mitigation tool that can identify any impacted contracts.\n\nAD\n\nAD\n\nMany major industry players have come out to weigh in on how the issue may impact their users, NFT holders, and NFT project creators.\n\nWe are in touch with @thirdweb about the security vulnerability impacting some NFT collections. Stay tuned for more info on how we can assist affected collection owners with any changes on OpenSea tied to contract migration. Please read @thirdweb’s post below for more detail. https://t.co/HU6bmXWU7U — OpenSea (@opensea) December 5, 2023\n\nMajor NFT marketplace OpenSea tweeted that users should “stay tuned for more info on how we can assist affected collection owners with any changes on OpenSea tied to contract migration.” Rarible, another NFT marketplace, said that some NFT drops on its platform are also affected across Ethereum and sidechain scaling network Polygon.\n\nCoinbase said that some collections created on its NFT platform are impacted, while smart contract startup Manifold said that its own contracts are unaffected. Base, the Ethereum layer-2 scaling network that Coinbase incubated, also said that some project contracts utilized on Base are affected, but the network itself is secure.\n\nMoca Transparency Tuesday - TL;DR: Mocas are SAFU, Funds are SAFU, Wallets are SAFU On Dec 2 at 11:17am HKT, we were made aware by @thirdweb, our smart contract development partner for the Mocaverse collections, that there was a need for a security update to the smart contracts… — Mocaverse💼🪐 (@MocaverseNFT) December 5, 2023\n\nEthereum profile picture (PFP) project Cool Cats said that while its main NFTs are safe, it will migrate its Avatar System packs to a new contract. Meanwhile, Animoca Brands’ Mocaverse gaming platform said it has migrated its various NFT collections to new contracts, and will let holders claim the new versions.\n\nIn addition to covering fees for migrated projects, Thirdweb wrote that it has doubled its bug bounty payments from $25,000 to $50,000, and will utilize “a more rigorous auditing process” going forward.\n\nEdited by Ryan Ozawa\n\nAD\n\nAD\n\nEditor's note: This story was updated after publication to clarify language around the nature of the vulnerability."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9pbnN0aXR1dGlvbmFsLWZ1bmRzLXRvLWV0aGVyZXVtLXByb2R1Y3RzLWZsaXBzLWdyZWVuLWFzLWFzc2V0LXRyYWRlcy1hYm92ZS0yMjAwLmh0bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Institutional Funds to Ethereum Products Flip Green as ETH Trades Above $2,200 - Cryptonews",
        "content": "Institutional Funds to Ethereum Products Flip Green as ETH Trades Above $2,200\n\nThe bullish drive of institutional investors in recent weeks can be seen across several market metrics as digital assets soar to levels not recorded in months.\n\nEthereum (ETH) traded sideways for most of the year before soaring above $2,000 following the recent market uptick which has sent the wider market capitalization over $1.5 trillion and ignited bullish sentiments.\n\nAt press time, institutional investors’ funds in Ethereum products stand at $10 million year-to-date (YTD), turning the tide after several weeks in the woods while its assets under management (AUM) is over $8.8 billion.\n\n💰 Digital Asset Funds Record $1.76 Billion Inflows in 10 Weeks, Highest Since 2021: Report Digital asset investment products recorded $176 million in inflows last week extending the positive run to 10 consecutive weeks. #CryptoNewshttps://t.co/fcK19i66sj — Cryptonews.com (@cryptonews) December 4, 2023\n\nThe CoinShares Weekly assets flows recorded outflows from the altcoin giant for several weeks despite positives recorded on the main network in terms of developments.\n\nMost analysts viewed the poor run of Ethereum as the massive slide recorded last year following wider economic factors and industry collapses. ETH plunged over 55% in 2022 alongside Bitcoin (BTC) as Federal Reserve policies, inflation factors, and the collapse of the Terra Network and FTX sent prices tumbling.\n\nThis year marked a renewed surge of institutional investors in the market but the majority of the growth was seen around Bitcoin as anticipation for a spot ETF grew following the application of BlackRock and other institutional giants with strong optimism that the Securities and Exchange Commission (SEC) will approve a filing.\n\nAs a result, while Bitcoin products recorded inflows for weeks which now stand at over $1.6 billion YTD, Ethereum products have struggled with several weeks of outflows leading to net inflows of $10 million YTD.\n\nEthereum leads altcoin gains\n\n\n\nSeveral analysts opined an uptick in the performance of ETH at the start of the year as a result of the network’s Merge which saw its transition of Proof-of-Stake consensus mechanism. A recent survey showed that most wealth managers backed the asset as the crypto with the highest growth potential.\n\n📈 Global wealth fund managers have backed $ETH as the asset with the highest growth projection despite a slow price increase in recent months, a new survey shows.#CryptoNews #Ethereumhttps://t.co/x4CvuftS4R — Cryptonews.com (@cryptonews) November 1, 2023\n\nLast week, Ethereum saw inflows of $31 million extending the recent run of consecutive inflows to five weeks totaling $134 million outshining Solana (SOL) which was described as an altcoin favorite after weeks on consecutive inflows.\n\nWhile ETF demand fueled the run of Bitcoin, the launch of several future Ethereum failed to drive the growth as predicted along many circles.\n\nAt press time, ETH trades above $2,200 with bulls locking sights on another run to end the year.\n\nBitcoin has continued to drive the market this year with surging investment fund figures with anticipation of an ETF approval and a bull run. Last week, institutional investors poured in $132 million igniting a positive momentum pushing DeFi figures above $46 billion and altcoins to yearly highs."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3Lm9reC5jb20vbGVhcm4vb2t4dmVudHVyZXMtam9pbnMtZXRoZXJldW0tY2xpbWF0ZS1wbGF0Zm9ybS1hcy1sYXVuY2gtcGFydG5lci10by1hZHZhbmNlLXN1c3RhaW5hYmlsaXR5LWluLXdlYjPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "OKX Ventures Joins Ethereum Climate Platform As a Launch Partner to Advance Sustainability in Web3 - OKX",
        "content": "SINGAPORE, December 6, 2023 -- OKX Ventures, the investment arm of leading crypto exchange and Web3 technology company OKX , today announced that it has joined the Ethereum Climate Platform (ECP) as a launch partner, underscoring its commitment to sustainability and decarbonization in the Web3 ecosystem.\n\nThe ECP is an innovative platform created after the transformative Ethereum Merge, leveraging the best of Web3 and traditional climate finance, technology, structures, and services. The platform is designed to galvanize climate solutions with Web3 innovation and address Ethereum's carbon emissions since its launch in 2015.\n\nOKX Ventures, with the support of the OKX Web3 team, joined a coalition of companies dedicated to expediting decarbonization and amplifying climate action through the deployment of cutting-edge technology and the cultivation of digital environmental assets. These are instrumental in reducing greenhouse gas emissions and fostering enduring environmental and societal benefits. OKX’s rigorous approach to “proof of reserves” demonstrates a commitment to the unique properties of blockchains as a tool to track and validate critical metrics, a principle that is also essential for effective climate investment.\n\nFacilitated by Consensys and climate tech firm Allinfra, other launch partners of the ECP include industry leaders like Microsoft, Polygon and NEAR Foundation.\n\nOKX Ventures Partner Jeff Ren said: \"As an active member of The Nature Conservancy, I'm thrilled that the OKX Ventures and OKX Web3 teams are collaborating with the Ethereum Climate Platform. This partnership underscores our shared commitment to integrating social responsibility and environmental stewardship into Web3 systems globally. We embrace this opportunity and responsibility to pioneer sustainable blockchain innovation to create lasting value for both people and the planet.\"\n\nECP Executive Director Anna Lerner said: \"Through this partnership, the OKX Ventures and Web3 teams are demonstrating their leadership in sustainable innovation across Web3. Its partnership with the Ethereum Climate Platform and support of Gitcoin demonstrate a dedication to ESG principles, open-source collaboration and community support. This partnership also signals a new era of eco-conscious blockchain advancement.\"\n\nOKX Ventures' participation in the ECP sets a new standard for environmentally conscious blockchain advancement in the Web3 space. It is also an important step toward its vision of an open, equitable and sustainable future of Web3."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9iaXRjb2luLXRyYW5zYWN0aW9uLWZlZXMtb3V0cGFjZS1ldGhlcmV1bS1kZWZpLXR2bC1zdXJnZXMtMTEtaW4tbm92ZW1iZXItYmluYW5jZS5odG3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin Transaction Fees Outpace Ethereum, DeFi TVL Surges 11% in November: Binance - Cryptonews",
        "content": "Bitcoin Transaction Fees Outpace Ethereum, DeFi TVL Surges 11% in November: Binance\n\nThe digital asset market recorded an 11% uptick last month with Solana (SOL) and Chainlink (LINK) becoming the top-performing assets as decentralized finance (DeFi) volumes surge, a new report shows.\n\nA recent Binance Monthly Market Insight report shows a growth in the general outlook as most cryptocurrencies surge in value pushing the total market cap over $1.5 trillion.\n\nAccording to the report, November started with bulls dictating the pace of the market with a 12% increase in the first half before making a slight correction as described as an oscillation between bullish and bearish sentiments.\n\nIn October and November, the market gained 19% and 11% respectively signalling a strong finish to the year recovering losses from previous months occasioned by wider macroeconomic factors. Only Junaury’s 30% surge beats the last two in growth metrics.\n\n“All the top 10 coins ended November with positive gains, with SOL and LINK followed with a 29.11% increase. Solana’s resurgence in the crypto Solana Breakpoint, drew over 13,000 attendees to one of its four venues, highlighting the growing community interest.”\n\nBitcoin fees outpace Ethereum\n\n\n\nLast month, Bitcoin (BTC) recorded more transaction fees than Ethereum (ETH), a deviation from the regular pattern recorded in several years due to higher network activity on Ethereum hinged on the higher concentration of decentralized applications on the blockchain.\n\nNotably, the new trend stayed constant for nearly two-thirds of the month hitting its widest point in two years. The disparity was fueled by the increasing demand of Bitcoin Ordinals, the popularly described non-fungible token of the market leader which boosted activities on the network clogging the mempool earlier this year.\n\nAccording to recent data from CryptoSlam, Ordinal transactions were at the highest in November with about $367 million culminating in the high number outpacing Ethereum.\n\nDeFi volumes soar\n\n\n\nThe bull run has led to an uptick in DeFi volumes including the rapid movement of institutional funds into digital asset products. Overall, total value locked (TVL) across DeFi platforms has surged 11% in the past 30 days with Solana (SOL) registering a 56% increase.\n\nThis year, Solana has been described as an institutional investor favorite after weeks of record inflows even when altcoin figures were at a record low. Altcoin leader Ethereum also notched an increase in institutional inflow in recent weeks as its asset price broke through the $2,000 mark.\n\nOptimism and Avalanche also recorded gains in DeFi TVL of 17% and 16% respectively. NFT volumes posted a turnaround from plunging volumes in previous months. Last month, NFT volumes stood at $0.91 billion marking a 200% growth."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMTIvMDUvc2VjLXBvc3Rwb25lcy1ydWxpbmctb24tZ3JheXNjYWxlLWV0aGVyZXVtLWV0Zi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "SEC Postpones Ruling on Grayscale Ethereum ETF - Crypto Times",
        "content": "The U.S. Securities and Exchange Commission (SEC) has delayed its verdict on Grayscale’s proposal for a spot in the Ethereum exchange-traded fund (ETF). The SEC now targets January 25, 2024, to finalize its decision. This development comes after an appellate court directed the SEC to reevaluate Grayscale’s Bitcoin ETF proposal earlier in October.\n\nsec delays grayscale etf\n\nThis postponement by the SEC indicates a comprehensive and cautious approach in assessing the proposal, which could allow the listing and trading of Grayscale Ethereum Trust shares on the NYSE Arca.This extended timeframe underscores the complexities and potential repercussions of the decision on the burgeoning cryptocurrency market.\n\nGrayscale’s approval of this Ethereum ETF is poised to be a watershed moment for the cryptocurrency industry. An affirmative decision would pave the way for broader institutional participation and mainstream acceptance of Ethereum.\n\nConversely, a negative outcome could significantly affect market confidence and investor sentiment. As the new deadline approaches, the anticipation within the crypto community and among investors is palpable, with all eyes on the SEC’s eventual decision and its implications for the future of digital assets."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL2NyeXB0b25ld3MuY29tL25ld3MvZXRoZXJldW1zLWRlY2VudHJhbGl6YXRpb24tcXVlc3Rpb25lZC1hcy1ibG9jay1idWlsZGVycy1jZW5zb3ItdHJhbnNhY3Rpb25zLXRpZWQtdG8tdXMtc2FuY3Rpb25zLmh0bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Censorship Climbs on Ethereum as Block Builders Bar US-Sanctioned Transactions - Cryptonews",
        "content": "Ethereum’s Decentralization Questioned as Block Builders Censor Transactions Tied to US Sanctions\n\nA pillar of Ethereum’s original vision was decentralization—the idea that its blockchain would operate outside constraints from centralized entities like governments and corporations. Recent data indicates this ideology is being tested, however, as key Ethereum players increasingly censor transactions linked to US sanctions.\n\nThe Turn Toward Censorship\n\n\n\nA major turning point came last year when the US Treasury Department’s Office of Foreign Assets Control (OFAC) sanctioned Tornado Cash, an Ethereum mixing service that enabled private transactions. OFAC claimed the tool was utilized by terrorists and other illicit actors.\n\nIn response, Tornado Cash’s code was added to the same US blacklist containing bad actors like North Korea and Hamas. Supporters decried the targeting of Tornado Cash as government overreach and censorship. Ethereum has not proven immune, however.\n\nIn recent months, censorship of transactions tied to US sanctions has markedly increased on Ethereum, according to new research from Ethereum Foundation researcher Toni Wahrstätter. A metric measuring “censored” blocks on Ethereum surged from around 25% in November 2022 to approximately 72% currently.\n\nThis spike stems largely from block builders, who assemble transactions into blocks and provide them to validators to add to Ethereum’s blockchain. Five major block builders now contribute over 90% of Ethereum blocks. Of those, only one major builder, Titan Builder, claims it does not filter transactions in this manner.\n\nThe lone block builder still processing all transactions claims over 20% of blocks. If Titan began engaging in censorship as well, per Wahrstätter’s analysis, overall Ethereum censorship could immediately jump to over 90%. Such reliance on a few builders contradicts the decentralized ethos blockchain promised.\n\nImpacts on Ethereum’s Core Values\n\n\n\nFor many in the Ethereum community, such censorship represents a betrayal of the network’s founding principles. The technology’s decentralized appeal rests on it being uncontrolled and unfettered by real-world biases. Yet block builders now hold immense power over which transactions end up on Ethereum, granting them the power to selectively exclude addresses flagged by OFAC.\n\nSome builders defend this censorship as merely prudent compliance with US regulations. However, critics argue it sets a dangerous precedent of centralized entities overriding Ethereum’s core coding to meet external rules. It also limits full access to the blockchain for individuals sanctioned by the US government.\n\nF2Pool was filtering (censoring) OFAC Bitcoin transactions recently and everyone got mad and then they stopped almost immediately. Can Ethereum do the same with censoring builders? As in, just ask that they stop. Like is this a corollary would you say or no? pic.twitter.com/6NUBmoEWuF — Gwart (@GwartyGwart) November 29, 2023\n\nCentralization Creeping In\n\n\n\nBeyond censorship, the centralization of key transaction functions into a few dominant block builders could pose security risks, according to experts. Further, these players gain privileged access to pending transaction data, potentially allowing them to maximize profits through trading strategies before transactions are added to the blockchain. This raises additional questions about fairness and transparency.\n\nEthereum was designed as a decentralized network not beholden to external constraints. Block builders processing transactions increasingly censor addresses tied to US sanctions, however, calling Ethereum’s decentralization into question. While some view this censorship as prudent legal compliance, critics see it as contradicting Ethereum’s core values.\n\nIn response to these concerns, Ethereum’s leadership is exploring ways to curb censorship trends. Vitalik Buterin has proposed updates that inhibit transaction blocking by validators and builders.\n\nThis challenge to Ethereum’s decentralized ethos may prove to be a defining one, forcing the community to confront difficult questions about the limits and future direction of the technology. The answers could shape Ethereum’s ability to evolve while retaining the core principles on which it was founded."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2JpbmFuY2UtbG9va3MtdG8tYm9vc3QtZmR1c2QtYWRvcHRpb24td2l0aC1mZWUtZnJlZS10cmFkaW5nLWZvci1ldGhlcmV1bS14cnAtb3RoZXJzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Binance looks to boost FDUSD adoption with fee-free trading for Ethereum, XRP, others - CryptoSlate",
        "content": "Binance has expanded its free trading options for the spot and margin trading pairs of the First Digital USD (FDUSD) stablecoin pairing with six digital assets, including BNB, Dogecoin, Chainlink, Ethereum, Solana, and XRP, according to a Dec. 5 statement.\n\nBinance users will see zero maker and taker fees for these pairs starting Dec. 8 for an undisclosed period. The exchange explained that the free trading option would exclude these pairs from BNB fee discounts, rebates, and other adjustments.\n\nHowever, the firm stated that it “reserves the right to disqualify trades deemed to be wash trades or illegally bulk account registrations, as well as trades that display attributes of self-dealing or market manipulation.”\n\nBinance is actively pushing FDUSD.\n\nThe free transaction promotion is part of Binance’s ongoing efforts to encourage its users to use the FDUSD stablecoin.\n\nLast week, the crypto platform said it would phase out support for Binance USD (BUSD) by Dec. 15. Binance urged users to convert their BUSD holdings into the new stablecoin before the end of the year, saying it would end BUSD withdrawals by Dec. 31 and that BUSD balances would be automatically converted to FDUSD.\n\nBinance’s decision relates to the BUSD stablecoin’s regulatory issues. Earlier in the year, the BUSD issuer, Paxos, suspended the stablecoin issuance following scrutiny from U.S. regulators. At the time, the company received a Wells Notice from the U.S. Securities and Exchange Commission (SEC), which classified the stablecoin as a security.\n\nWhile Binance and Paxos have vehemently rejected this classification, the crypto community promptly deserted the stablecoin, with its circulating supply dropping to less than $2 billion as of press time, according to CryptoSlate’s data.\n\nConcurrently, Binance has been heavily pushing FDUSD as a viable alternative, introducing new products for the digital asset and incentivizing its use. However, FDUSD’s circulating supply remains less than 1 billion and is only available on less than five crypto exchanges."
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9zb2NpZXRlLWdlbmVyYWxlLWlzc3Vlcy1maXJzdC1kaWdpdGFsLWdyZWVuLWJvbmQtYXMtc2VjdXJpdHktdG9rZW4tb24tZXRoZXJldW0tYmxvY2tjaGFpbi5odG3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Societe Generale Issues First Digital Green Bond as Security Token on Ethereum Blockchain - Cryptonews",
        "content": "Societe Generale Issues First Digital Green Bond as Security Token on Ethereum Blockchain\n\nSociete Generale, the third-largest bank in France, has marked a significant milestone by issuing its inaugural digital green bond on the Ethereum public blockchain.\n\nSociete Generale announced Monday that it issued its first green bond on the Ethereum blockchain. The bond, valued at 10 million euros (approximately $11 million), was executed in late November and carries a three-year maturity. This initiative was facilitated through Forge, a subsidiary of Societe Generale.\n\nThis pioneering digital green bond is dedicated to financing or refinancing products and companies falling under the eligible green activities category. The “green” status underscores Societe Generale’s commitment to environmentally responsible financing. The net proceeds generated from the bond will be directed towards financing or refinancing products and companies falling within the eligible green activities category.\n\nOne of the key innovations accompanying this digital bond is its transparent and accessible digital infrastructure. Through the bond’s smart contract, stakeholders, including issuers and investors, gain 24/7 open access to data pertaining to its carbon footprint.\n\nThe bank aims to leverage the Ethereum blockchain as a data repository and certification tool for issuers and investors, particularly in the context of environmental, social, and governance (ESG) considerations. The issuance of tokenized bonds aligns with the bank’s commitment to enabling greater transparency on ESG matters.\n\nThis empowers market participants to measure the carbon emissions associated with their securities directly on the financial infrastructure. The smart contract governing the green bond includes comprehensive carbon footprint information accessible to the public.\n\nSociete Generale Embraces Blockchain for Tokenized Bonds to Boost Transparency and Efficiency\n\n\n\nIn a bid to enhance transparency, traceability, and efficiency in financial transactions and settlements, Societe Generale emphasized the tokenized nature of these bonds. The move towards blockchain technology is a strategic initiative by the bank’s crypto team to harness the advantages of decentralized ledger technology.\n\nBy leveraging the Ethereum blockchain to provide increased transparency and traceability, it also improves fluidity and speed in transactions. Additionally, the bond introduces a technical option for investors to settle securities on-chain using the EUR CoinVertible, a stablecoin pegged to the euro that Forge issued in April 2023.\n\nThis approach not only enhances efficiency in settlement processes but also positions the bank to navigate the evolving landscape of central bank digital currencies (CBDCs). The bank acknowledges the ongoing experimentation with CBDC solutions and positions itself as a provider of a comprehensive range of on-chain services.\n\nThe Third-Largest Bank in France Continues Crypto Initiatives with Tokenized Bond and Focuses on Environmental Impact\n\n\n\nBeyond its collaborative efforts, Societe Generale has been an active participant in the cryptocurrency space. Prior to this digital green bond on Ethereum, the bank had successfully issued Eurobonds on the Ethereum blockchain and security tokens on the Tezos blockchain.\n\nMoreover, Societe Generale has proposed Dai stablecoin loans in exchange for bond tokens. The team’s proactive approach resulted in the acquisition of the highest access license to operate as a digital asset service provider in France in July.\n\nIn November, Societe Generale-FORGE, in collaboration with the Lamarck Group, Institut Louis Bachelier, and the Crypto Carbon Ratings Institute, released a report focusing on the lifecycle of security tokens. The report aimed to establish a methodology for calculating the carbon footprint of financial products issued in token form on the Ethereum public blockchain infrastructure.\n\nThe report specifically focused on Ethereum’s network due to its relatively low greenhouse gas emissions following the merge in September of the previous year.\n\nIn June, the European Investment Bank (EIB) issued a tokenized bond using Credit Agricole CIB and SEB’s blockchain-based bond platform. The EIB’s bond was denominated as a Swedish Krona 1 billion bond, equivalent to approximately $95 million, with a maturity period of 2 years.\n\nWhile this is SocGen’s first tokenized bond, the bank had previously collaborated with the EIB on its inaugural digital bond issuance in 2021."
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vZmluYm9sZC5jb20vY3J5cHRvLWV4cGVydHMtc3VnZ2VzdC1vcHRpbWFsLXRpbWUtZm9yLWJuYi1zcGN0LWFuZC1ldGhlcmV1bS1pbnZlc3RtZW50cy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Crypto Experts Suggest: Optimal Time for BNB, SPCT, and Ethereum Investments - Finbold - Finance in Bold",
        "content": "Press Releases are sponsored content and not a part of Finbold's editorial content. For a full disclaimer, please click here. If you encounter any issues, kindly report them to [email protected]. Crypto assets/products can be highly risky. Never invest unless you’re prepared to lose all the money you invest.\n\nThe DOJ says CZ is a flight risk. Ethereum (ETH) could get a spot ETF. Meanwhile, VC Spectra (SPCT) presents a golden opportunity for investors.\n\nHow does the DOJ’s verdict on CZ affect BNB (BNB)? How does a spot ETF application affect the Ethereum price prediction? And how can investors take advantage of VC Spectra’s (SPCT) opportunity? Let’s find out!\n\n>>BUY SPCT TOKENS NOW<<\n\nSummary\n\nBNB (BNB) could have a good year once regulatory issues are solved.\n\nVC Spectra (SPCT) is the best crypto to invest in now.\n\nThe Ethereum price prediction for 2024 is $6,369.08.\n\nBNB Price Prediction: US Department Of Justice Designates Binance Ex-CEO A Flight Risk\n\nOn November 27, 2023, the US DOJ argued that former Binance CEO Changpeng Zhao is a flight risk. DOJ prosecutors challenged the judge’s pronouncement that CZ was not a flight risk even while in UAE.\n\nThe DOJ’s challenge comes despite CZ voluntarily presenting himself in court and also agreeing to a $175 million bond. The DOJ wants CZ to remain in the US to minimize the flight risk, especially as UAE does not have an extradition agreement with the US.\n\nSo far, the judge has stayed the decision permitting him to return to the UAE.\n\nThe decision to block the initial ruling has sent BNB coin price tumbling. BNB lost 1.4%, decreasing from $231.98 to $228.73.\n\nHowever, analysts say BNB coin price might reach $1,361.70 in 2024 if the authority’s case with Binance is settled soon. Negotiations are ongoing between Binance and the authorities on the amount of fine the exchange will pay as punishment for its rule-breaking.\n\nVC Spectra (SPCT) Investors Prepare For More Surges\n\nSince VC Spectra (SPCT) began its presale, the price of the token has soared to unimaginable levels. The VC Spectra (SPCT) token has gained an astounding 862.5% in just five presale stages.\n\nImportantly, there are more surges ahead for VC Spectra (SPCT). Experts say VC Spectra (SPCT) will surge over 1000% during the presale. This means that investors who join the train now can still enjoy substantial gains.\n\nTo enjoy the gains, these investors have to purchase SPCT from the VC Spectra website at the current price of $0.077. Other benefits of holding SPCT include quarterly dividends and buybacks, voting rights, and access to exclusive pre-ICOs.\n\nHowever, VC Spectra (SPCT) offers more than price increases. It is a platform for investors to enjoy the best blockchain investment services. With VC Spectra (SPCT), they can invest in early-stage blockchain startups, growth-potential Web3 companies, and specific niches and trades. They can also stake and lend their tokens and trade arbitrage.\n\nVC Spectra (SPCT) ensures its users are investing in profitable ventures and trades. The protocol utilizes AI, trusted trading strategies, and a sustainable investment approach to achieve this.\n\nAll these make VC Spectra (SPCT) the top crypto to buy ahead of BNB and ETH.\n\nEthereum Price Prediction: BlackRock Readies ETH ETF Application\n\nA November 9 report revealed that the top asset manager in the world, BlackRock, was taking steps to offer a spot Ethereum (ETH) ETF. According to the report, BlackRock registered the iShares Ethereum Trust in Delaware. This Trust is a forerunner to the ETF application because BlackRock took this same route before filing for its spot BTC ETF.\n\nAnalysts say the same excitement surrounding the Bitcoin ETF could also infect Ethereum if BlackRock eventually files for a spot Ethereum ETF.\n\nInterestingly, the news about the Ethereum Trust registration has pushed Ethereum (ETH) price past $2,000. The premier altcoin has surged from $1,888.94 to $2,091.94. This is a 10.7% increase.\n\nIf BlackRock’s imminent spot Ethereum ETF filing is approved soon, ETH could soar to $6,369.08 in 2024. Experts believe approval of the spot Bitcoin ETF applications will pave the way for the acceptance of the Ethereum ETF.\n\nShould I buy Ethereum? Experts say ETH might be a good crypto to buy.\n\nTo learn more about VC Spectra (SPCT), visit:\n\nBuy Presale: https://invest.vcspectra.io/login\n\nWebsite: https://vcspectra.io\n\nTelegram: https://t.me/VCSpectra\n\nTwitter: https://twitter.com/spectravcfund"
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY3J5cHRvYnJpZWZpbmcuY29tL3NvY2lldGUtZ2VuZXJhbGUtZmlyc3QtYmFuay1naWFudC1pc3N1ZS1zdGFibGVjb2luLWV0aGVyZXVtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Societe Generale becomes first bank giant to issue a stablecoin on Ethereum - Crypto Briefing",
        "content": "Share this article URL Copied\n\nSociete Generale FORGE, a subsidiary of the 159-year-old French banking group Societe Generale, is launching EUR CoinVertible (EURCV) a stablecoin tied to the Euro issued on the Ethereum blockchain, according to a new post by crypto exchange Bitstamp.\n\n📢 NEW! We're the first exchange to list $EURCV! EUR CoinVertible is Societe Generale-FORGE's innovative stablecoin, aiming for stability and safety in the volatile world of digital assets. 🌐 You can start trading it on Bitstamp today. Dive in for more details:… pic.twitter.com/Lt98ysjfeo — Bitstamp (@Bitstamp) December 6, 2023\n\nEURCV is an ERC20 token, designed to provide a low volatility cryptocurrency that maintains a stable value equivalent to the Euro. The stablecoin is backed by cash deposits and cash equivalents denominated in EUR.\n\nSociete Generale states that robust legal structures are in place to ensure the segregation and availability of reserve assets to token holders.\n\nCrypto exchange Bitstamp is opening order books for the EURCV/USDT and EURCV/EUR trading pairs. Flowdesk, a crypto market maker, has been selected to provide liquidity and active market-making for EURCV on Bitstamp and other exchanges.\n\n“We are thrilled to partner with SG-FORGE as a designated market maker, a pivotal role in realizing our shared vision of a tokenized financial future. Looking ahead as we approach 2024, we envision a transformative impact where compliant blockchain-based operations by institutions will drastically increase in volume,” said Guilhem Chaumont, CEO of Flowdesk.\n\nInitially, EURCV deposits and withdrawals will only be enabled for investors whitelisted by Societe Generale. The bank states that its existing KYC and AML compliance procedures will apply to onboarding digital token holders.\n\nWhile not the first Euro stablecoin, EURCV is the first to have the backing of a major regulated European bank. A state-owned bank in Brazil called the Brazilian National Social Development Bank issued a stablecoin backed 1-for-1 by the Brazilian real in 2018. Circle and Tether have also launched similar euro-pegged tokens aimed at retail investors.\n\nThe EURCV launch comes soon after Societe Generale’s first bond issuance on the public blockchain Ethereum. The €100 million digital green bond was fully subscribed to by institutional asset managers AXA and Generali."
    },
    {
        "id": 76,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmRhaWx5Zm9yZXguY29tL2ZvcmV4LXRlY2huaWNhbC1hbmFseXNpcy8yMDIzLzEyL2V0aGVyZXVtLWZvcmVjYXN0LTYtZGVjZW1iZXItMjAyMy8yMDQ3MzjSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Forecast: Looks Strong - DailyForex.com",
        "content": "Ethereum's recent performance has raised many questions about its potential for further upward movement. Over the weekend, Ethereum experienced a significant surge, indicating that the $2200 level, possibly extending down to the $2100 level, is now providing short-term support. This development suggests a growing inclination among investors to adopt a \"buy on the dips\" strategy, reflecting confidence in Ethereum's upward trajectory. The cryptocurrency has been consistently bullish, bolstered by expectations regarding the United States' monetary policy, which is a crucial factor influencing its value. Currently, traders are speculating that the Federal Reserve is going to start cutting rates in March.\n\nForex Brokers We Recommend in Your Region See full brokers list\n\nCheap Money Drives Market, Or At Least the Idea of It\n\nEthereum's growth is closely tied to the availability of inexpensive money and low interest rates in the United States. These economic conditions create an environment conducive to Ethereum's ascent.\n\nEthereum plays a foundational role in blockchain applications, although its broader utilization within blockchain technology is still evolving.\n\nThe speculative nature of Ethereum is a key aspect of its appeal to investors, with the primary objective being the potential for profit.\n\nCurrently, the trajectory for making profits in the Ethereum market appears to be on the upside. A decisive break above the $2300 level could pave the way for Ethereum to reach the $2500 mark over time. The 50-Day Exponential Moving Average is located at the lower boundary of Ethereum's recent consolidation zone, suggesting that it could provide a robust short-term foundation for the market. This level might also represent the base of the uptrend, especially if Ethereum faces significant selling pressure. This is going to be a potential buying opportunity, assuming you even get it. This is a market that will also follow Bitcoin as well – so pay attention to that market at the same time.\n\nOverall, Ethereum's market dynamics are influenced by several factors, including global monetary policies, its role in blockchain technology, and its speculative nature. Investors are closely monitoring these aspects, as they are fundamental to Ethereum's value and its potential for future growth. The market sentiment is currently bullish, with key technical levels offering insights into potential support and resistance points. As Ethereum continues to evolve within the digital currency landscape, staying informed and adaptable will be vital for investors navigating this volatile and opportunity-rich market.\n\nReady to trade our Ethereum forecast? We’ve shortlisted the best MT4 crypto brokers in the industry for you."
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2Nhbi1ldGhlcmV1bS1wcmljZS1yaXNlLWRlc3BpdGUtbWlsbGlvbnMtb2YtZXRoLWZsb29kaW5nLWludG8tZXhjaGFuZ2VzLTIwMjMxMjA1MDYyMdIBhwFodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy9jYW4tZXRoZXJldW0tcHJpY2UtcmlzZS1kZXNwaXRlLW1pbGxpb25zLW9mLWV0aC1mbG9vZGluZy1pbnRvLWV4Y2hhbmdlcy0yMDIzMTIwNTA2MjE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Can Ethereum price rise despite millions of ETH flooding into exchanges? - FXStreet",
        "content": "Share:\n\nEthereum worth $16.7 million was sent to crypto exchange FalconX, which could be positioned to sell.\n\nIndividual investors are also seen depositing ETH to centralized platforms, likely to book profits.\n\nEther currently trades at $2,230 and could trigger a potential reversal, especially if Bitcoin price fails to move higher.\n\nEthereum price has been in a multi-year consolidation and recently “broke out” according to some analysts who forecast a bullish future for ETH. However, taking a closer look at on-chain flows suggests that investors might be looking to sell.\n\nRead more: Ethereum Price Prediction: ETH attempts to flip $2,300 into support\n\nEthereum investors send ETH to exchanges\n\nThe bankrupt crypto lending and borrowing platform Celsius sent 7,500 ETH worth nearly $16.7 million ETH to exchanges on December 5, according to data from Spot On-chain. A look at the history of Celsiu’s wallets shows a whopping 37,269 ETH has been sent to centralized entities since November 14, 2023. The recent transfer is the second-highest inflow after the $19.47 million deposit on November 30.\n\nAdditionally, a popular crypto investor with the screenname “smartestmoney.eth” has reportedly begun selling their ETH. This entity deposited $10.08 million worth of ETH to Binance at the time of writing, according to data from Lookonchain.\n\nWhile these two deposits are not large enough to trigger a sell-off for the ongoing rally, investors should be cautious of what Bitcoin will do next. The 2% drop in BTC price caused altcoins to crash 15% to 30% on December 4. Hence, a continuation of the downside movement in pioneer crypto could cause serious damage to altcoins, including ETH.\n\nMore on Bitcoin price: Week Ahead: Altcoin plays for traders as Bitcoin crosses $42,000\n\nETH price in a wedge formation not ascending triangle\n\nMany investors point out that Ethereum price action over the past months has led to the formation of an ascending triangle. These analysts forecast that the recent move was a breakout and that ETH is primed for a further move north. While this outlook is not wrong, investors need to take another look at Ether’s price action.\n\nRead more on ETH’s ascending triangle: Ethereum price dilemma or buy signal before 60% rally\n\nConsidering the steady build-up of selling pressure and Bitcoin price slowdown, a short-term reversal could be in place. Instead of looking at Ethereum price action over the past few months as an ascending triangle, a different approach could be a rising wedge.\n\nEthereum price is currently trading at $2,230, which is the upper limit of this setup. This area coincides with the range’s midpoint at $2,230, making it a tough level to crack. Hence, rejection here seems likely, especially considering the inflows to exchanges. Therefore, ETH could slide lower in the short-term while remaining bullish on the long-term.\n\nA bearish breakout of the rising wedge is unlikely, considering the current market conditions. Hence, the ideal level for accumulation is the weekly support level of $1,935. If this level gives in, then the weekly bullish breaker, extending from $1,562 to $1,759, is the best place for long-term holders to step in.\n\nETH/USDT 1-week chart\n\nInvalidation of this move will occur if Ethereum price flips the $2,230 hurdle into a support floor. In such a case, ETH could revisit the $2,784 level, which was last seen in May 2022."
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tZm9yLWRlY2VtYmVyLTIwMjMtY2FuLWV0aC1yZWFjaC0yNTAwLWJlZm9yZS0yMDI0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction for December 2023 - Can ETH Reach $2500 Before 2024? - Analytics Insight",
        "content": "Ethereum ($ETH) has once again come into the spotlight of crypto investors, especially after the analysis of Markus Thielen, who has high hopes for the future success of this popular cryptocurrency. Markus Thielen believes that during 2024, $ETH could reach up to $3000, but what interests crypto investors is how the Ethereum Price Prediction looks like for December 2023, can $ETH reach $2500 before 2024, or some other coins may achieve greater success.\n\nIt seems that the explosion of the value of Ethereum ($ETH) will take much more time and that we will sooner witness the explosion of the value of young and fresh tokens: Bitcoin ETF Token ($BTCETF), Bitcoin Minetrix ($BTCMTX), Meme Kombat ($MK) and T.G. Casino ($TGC)!\n\n>>> Buy The Best Coin Now<<<\n\nEthereum ($ETH) Price Prediction for December 2023: Invest in $ETH or choose some other crypto?\n\nDuring 2024, according to Markus Thielen, of course, provided that a significant number of factors coincide, Ethereum could explode and reach a value of even $3000. However, we are talking about the year 2024, and what crypto investors are interested in now is what the Ethereum Price Prediction is for December 2023, and therefore, how this popular crypto will end the year.\n\nThe current value of Ethereum is around $2,100 ($2,093 to be precise) and by the end of the year, in the best case, this popular crypto could increase its value to a maximum of $2,232. However, experts warn that this is still a best-case scenario and that before investing you should be careful and keep in mind both the minimum and average predicted value.\n\n>>> Buy The Best Coin Now<<<\n\nEthereum Price Prediction for December 2023\n\nMONTH Minimum Price Average Price Maximum Price December 2023 $2,000.78 $2,116.48 $2,232.18\n\nAs you can see, the predictions show that Ethereum could pump in price and reach $2,232, but it could also happen that its value falls to around $2,000 which is a significant failure considering its current value of around $2,100. The chances of $ETH reaching $2,500 by the end of the year are, as you can see, non-existent, so it’s no wonder that few investors are even considering $ETH at this moment. Investors are now massively deciding to put $ETH “oh hold” and invest in coins that show the chance to explode much faster: Bitcoin ETF Token ($BTCETF), Bitcoin Minetrix ($BTCMTX), Meme Kombat ($MK) and T.G. Casino ($TGC).\n\n>>> Buy The Best Coin Now<<<\n\nBitcoin ETF Token ($BTCETF) is a crypto that is an incomparably better option than Ethereum!\n\nThe first among the coins that stands out with its results so far, but also with fantastic predictions, as an incomparably better choice for investing than Ethereum ($ETH) is the amazing Bitcoin ETF Token ($BTCETF).\n\nAn early investment in $BTCETF will help you “fill your bags before SEC approval”, and as things stand, investors do not want to miss this offer! At the time of writing, $BTCETF can be bought at a unique price of only $0.062, and considering that this fantastic Bitcoin alternative is predicted to grow enormously (up to 100x), it is clear why investors prefer this coin to Ethereum!\n\n>>> Buy Bitcoin ETF Now<<<\n\nBitcoin Minetrix ($BTCMTX) is a crypto that will explode in value much more than Ethereum!\n\nBitcoin Minetrix ($BTCMTX) is a cryptocurrency that is in a phase of accelerated growth and should be monitored until the end of the year. One of the main reasons for the huge success of this young coin so far is that $BTCMTX provides an opportunity for small investors to profit from Bitcoin mining.\n\nThe main motto, “Bitcoin Minetrix mines Bitcoin so you don’t have to” certainly influenced the huge presale success of this token so far (more than $4.7 million raised), but what continues to attract investors are the fantastic predictions that indicate that this coin will explode to a much greater extent than the well-known Ethereum. So take the last opportunity to invest in $BTCMTX at $0.012 and grab it ASAP!\n\n>>> Buy Bitcoin Minetrix Now<<<\n\nMeme Kombat ($MK) is a meme coin that will probably perform better than $ETH!\n\nAnother crypto, by recording outstanding presale results, shows chances to surpass $ETH, and that is the young meme coin, Meme Kombat ($MK)!\n\nIn addition to offering users fantastic entertainment options, this meme coin offers early investors an opportunity for an impressive return on investment, and for good reason, it is already positioned as one of the best crypto presales for 2023! So, if you want to take advantage of the opportunity to stake, play, and get amazing rewards, hurry up and invest in $MK while the price is only $0.225!\n\n>>> Buy Meme Kombat Now<<<\n\nT.G. Casino ($TGC) is a coin set for bigger gains than $ETH!\n\n$ETH may not be able to achieve some explosive success, but that’s what is expected from the best Telegram Casino: T.G. Casino ($TGC), a gambling crypto project that has already managed to raise more than an amazing $3.3 million!\n\nThe fact is that there are more and more users who want to participate in this fantastic and 100% safe online casino, primarily because of the excellent offer of different betting options. However, predictions indicating that $TGC could explode in value, further increase the interest of users.\n\nConsidering that the current price of the $TGC token is only $0.175, it would be wise to invest in this high-potential coin as soon as possible, before the presale is completed.\n\n>>> Buy TG Casino Now<<<\n\nConclusion\n\nJudging by the available Ethereum Price Prediction for December 2023, there is no chance that this popular crypto will reach the desired $2,500 by the end of the year. There are higher chances that the value of this crypto will drop significantly, and that’s why investors prefer to opt for cryptos that have a high chance of success- $BTCETF, $BTCMTX, $MK, and $TGC. Each of these young coins is already achieving impressive results, and each of them will likely surpass $ETH!\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vZGVjcnlwdC5jby8yMDg1ODYvZXRoZXJldW0tZGV4LW1hdGNoYS1haW1zLXRvLW1ha2UtaXQtZWFzaWVyLXRvLXRyYWRlLWFzc2V0cy1hY3Jvc3MtY2hhaW5z0gFoaHR0cHM6Ly9kZWNyeXB0LmNvLzIwODU4Ni9ldGhlcmV1bS1kZXgtbWF0Y2hhLWFpbXMtdG8tbWFrZS1pdC1lYXNpZXItdG8tdHJhZGUtYXNzZXRzLWFjcm9zcy1jaGFpbnM_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Ethereum DEX Matcha Aims to Make It Easier to Trade Assets Across Chains - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCrypto traders who like a little variety in their lives now have a new and potentially simpler way to trade assets across Ethereum-compatible networks.\n\nEthereum DeFi exchange Matcha released cross chain swaps today, which allows users to trade tokens from one ETH-compatible chain, such as Polygon, to another, like Avalanche.\n\nThis will matter for the token-flipping degens and investors who are experienced in DeFi, since such trades are generally messy business for the 3.7 million digital wallets juggling multiple chains.\n\nAD\n\nAD\n\nUsers typically handle moving assets from chain to chain with bridges, but most bridges don’t have the greatest user experience—and it’s hard to know which bridges are legitimate—plus long wait times and hefty fees. It’s a pain.\n\nMatcha hopes to alleviate some of this pain with built-in cross chain swaps on their exchange, which now support seven networks: Ethereum, Optimism, Polygon, Arbitrum, Avalanche, Base, BNB Chain, and Fantom.\n\nAbstracting bridges\n\nAs a decentralized exchange (DEX) aggregator on Ethereum, Matcha aggregates liquidity from various other exchanges, which enables users to find the best prices for their trades across different liquidity sources. Other such aggregators include 1inch, KyberSwap, and OpenOcean.\n\nAccording to Matcha co-founder Will Warren, Matcha’s goal is to create a frictionless experience for accessing and trading tokens in a crypto landscape where the number of tokens is exploding.\n\nThe way it accomplishes this is similar to how Matcha currently handles swaps across different DEXs. Matcha looks for the most efficient route for your swap and executes it—with their cross chain swaps, it adds bridges to the list of potential routes your tokens can take. This allows users to move assets from chain to chain, and know they have the cheapest or most efficient route available.\n\nAD\n\nAD\n\nThe cross chain swap landscape\n\nAt the moment, your options for moving assets across different chains are: aggregators (like Matcha), in-wallet transfers through Metamask, traditional bridges, and centralized exchanges (like Coinbase or Binance).\n\nEthereum wallet Metamask supports cross chain swaps—and it’s probably the most convenient option out there. However you pay a fee for the convenience in the form of a hefty fee taken by Metamask.\n\nCentralized exchanges (CEX) like Coinbase are also a popular option. Users can send crypto assets to a CEX and withdraw different assets to a wallet address on whatever chain they please. This also accrues some fees (varying based on which CEX is used), and requires the user to KYC (i.e. provide personally identifiable information), which isn’t the case on a DEX like Matcha.\n\nWith traditional bridges, they work but are a bit clunky. You often need to wrap tokens in order to bridge, and figure out what token is needed for gas on your destination chain. There’s also the concern of knowing whether you’re using a legitimate bridge and you’re not about to send your tokens into the void. Matcha’s swaps will use only “battle-tested official bridges,” according to the company.\n\nSushiswap offers a cross-chain swap feature similar to Matcha. Sushi launched its feature in August 2022, and since then it’s generated $72.9 million in volume.\n\nCross chain swaps, according to Warren, go beyond being technical bridges; they're a comprehensive product layer that simplifies the process for users—no more juggling different websites, swap platforms, or opening multiple browser tabs.\n\nMatcha also doesn’t apply a fee for its new service, so traders can make use of cross chain swaps on the platform without incurring extra costs."
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY29pbmdhcGUuY29tL3NvY2lldGUtZ2VuZXJhbGUtZW1icmFjZXMtYmxvY2tjaGFpbi13aXRoLWdyZWVuLWJvbmQtaXNzdWFuY2Uv0gFXaHR0cHM6Ly9jb2luZ2FwZS5jb20vc29jaWV0ZS1nZW5lcmFsZS1lbWJyYWNlcy1ibG9ja2NoYWluLXdpdGgtZ3JlZW4tYm9uZC1pc3N1YW5jZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Societe Generale Embraces Blockchain with Green Bond Issuance - CoinGape",
        "content": "French banking giant Societe Generale (SocGen) marks a significant shift in traditional finance’s approach to digital assets with its recent green bond issuance on the Ethereum network. This move highlights the growing interest among mainstream financial institutions in the potential of blockchain technology for enhancing transparency, efficiency, and sustainability in financial transactions.\n\nBlockchain Technology Gaining Ground in Finance\n\nSocGen’s €10 million issuance of digital green bond tokens, managed by its digital asset-focused arm SG-FORGE, represents a growing trend in the finance industry. This initiative captures the essence of how traditional financial (TradFi) institutions are increasingly adopting blockchain-based solutions. Last month, JPMorgan and Apollo, alongside several crypto firms, showcased the potential of blockchain in tokenizing funds, indicating a broader industry shift.\n\nadvertisement\n\nSocGen’s decision to use blockchain technology for issuing green bonds aligns with the global push towards sustainable finance. The digital format of these bonds allows for enhanced transparency and traceability, along with faster transaction and settlement processes. The issuance serves not only as a financial instrument but also as a stepping stone towards using blockchain as a data repository. This approach aids in the certification and transparency of Environmental, Social, and Governance (ESG) impact data globally.\n\nPartners in Progress: AXA and Generali’s Involvement\n\nAXA Investment Managers and Generali Investments, two leading financial institutions, played a pivotal role in this initiative by purchasing these tokenized bonds. Particularly noteworthy is AXA IM’s acquisition of €5 million worth of bonds using the euro-pegged stablecoin EURCV, facilitated by SG-FORGE. This transaction is part of a broader experiment to explore the use of stablecoins in settling digital bond purchases.\n\nThe bond issuance by SocGen is more than just a financial transaction since it signals the evolving landscape in traditional finance. With investment management firm 21.co projecting the market value of tokenized assets to potentially reach $10 trillion, the future looks promising for the integration of blockchain technology in mainstream financial operations. This development could begin a new era in which real-world assets are increasingly migrated to blockchain platforms, revolutionizing how we perceive and interact with financial assets.\n\nRead Also: Bitcoin (BTC) Price Performance Spark Critic-Proponent War of Words"
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9idXNpbmVzcy9kaWdpdGFsLXRyYW5zZm9ybWF0aW9uLXNvY2lldGUtZ2VuZXJhbGUtdG8taW50cm9kdWNlLWEtZ3JlZW4tYm9uZC1vbi1ldGhlcmV1bS0zMzI4OTM0L9IBhQFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9idXNpbmVzcy9kaWdpdGFsLXRyYW5zZm9ybWF0aW9uLXNvY2lldGUtZ2VuZXJhbGUtdG8taW50cm9kdWNlLWEtZ3JlZW4tYm9uZC1vbi1ldGhlcmV1bS0zMzI4OTM0L2xpdGUv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Societe Generale to introduce a green bond on Ethereum - The Financial Express",
        "content": "According to Cointelegraph, the third-largest bank in France, Societe Generale, reported issuing its first digital green bond as a security token on the Ethereum public blockchain. The bond, registered by Forge, a subsidiary of Societe Generale is expected to have gone public on November 30, 2023.\n\nSources revealed that the bond has a value of about 10 million euros (around $11 million) and a maturity of three years. Its “green” status is believed to mean that its net proceeds will be used to finance or refinance products and companies classified under the eligible green activities category, added Cointelegraph.\n\n“While Central Bank Digital Currencies (CBDC) solutions are being experimented, this panel of settlement methods demonstrates the large capabilities of SG-FORGE in providing full spectrum of on-chain services,” Societe Generale explained.\n\nAlso Read T-Hub launches startup incubation program\n\nFurthermore, it is believed that the bond will also include a technical option for investors to settle securities on-chain through the EUR CoinVertible, a euro-pegged stablecoin issued by Forge in April 2023, Cointelegraph concluded.\n\n(With insights from Cointelegraph)\n\nFollow us on Twitter, Facebook, LinkedIn"
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LnRoZWNvaW5yZXB1YmxpYy5jb20vMjAyMy8xMi8wNS9ldGhlcmV1bS1jbGFzc2ljZXRjLWNhbi1ldGMtY3J5cHRvLXByaWNlLXJlYWNoLTI1LXNvb24v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Classic(ETC): Can ETC Crypto Price Reach $25 Soon? - The Coin Republic",
        "content": "Ethereum Classic (ETC) is a hard fork of Ethereum (ETH). It was launched in 2016. The main functions of ETC are smart contract networks with the ability to host and support decentralized applications (dApps).\n\nETC is the native token of Ethereum Classic. Since its launch, ETC has made efforts to distinguish it from Ethereum. The technical roadmaps of both networks are expected to diverge further with the passage of time.\n\nIt was first set to preserve the integrity of the existing Ethereum blockchain and prevent its hacking. A previous hacking event led to the theft of 3.6 Million ETH.\n\nIn fact, Ethereum Classic is the legacy chain of Ethereum. So, the creators or developers of the Ethereum Classic are the same as the original Ethereum developers. Vitalik Buterin and Gavin Wood are the developers of Ethereum Classic as well.\n\nIt is the outcome of disagreement between participants about the reversion of blockchain to cancel out the effects of the major hack. This hack impacted the DAO, which had raised approximately $150 Million in an ICO several months earlier.\n\nETC came into existence as the network that did not reverse the chain. Developers claim that there is no official team for the ETC project. Its global development community is permissionless.\n\nWhat the ETC Chart Shows\n\nSource: ETC/USD.1.D. BITFINEX TradingView\n\nThe ETC crypto experienced a dip of 1.16% in the last 24 hours, trading at $19.709. However, if the demand for the ETC remains high, the ETC price could bounce back from the current level. The next goal for the ETC price is to reach $21.\n\nIt looks like ETC crypto could smash resistance levels and zoom to new altitudes from the current base zone. However, if the crypto price fails to stay above the $18 level, it could decline further.\n\nSource: ETC/USD.1.D. BITFINEX TradingView\n\nThe ETC price is higher than the 20-day and 50-day exponential moving averages.\n\nThis shows that the EMAs are providing strong support for the ETC price, as they are following the price and stopping it from falling more. Therefore, the ETC price trend is positive and rising.\n\nSummary\n\nThe ETC crypto is ready for a significant rise ahead, as it gains strength to overcome the obstacles and reach new levels from the current support zone. Moreover, if the ETC continues to attract buyers, the ETC price could recover from the current level. The next target for the ETC price is the $21 mark\n\nTechnical Levels\n\nSupport Levels: $18\n\nResistance Levels: $21\n\nDisclaimer\n\nIn this article, the views, and opinions stated by the author, or any people named are for informational purposes only, and they don’t establish the investment, financial, or any other advice. Trading or investing in cryptocurrency assets comes with a risk of financial loss."
    }
]