[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vd3d3LmJhbmtyYXRlLmNvbS9pbnZlc3RpbmcvaG93LXRvLWJ1eS1ldGhlcmV1bS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "How To Buy Ethereum - Bankrate.com",
        "content": "Advertiser Disclosure\n\nWe are an independent, advertising-supported comparison service. Our goal is to help you make smarter financial decisions by providing you with interactive tools and financial calculators, publishing original and objective content, by enabling you to conduct research and compare information for free - so that you can make financial decisions with confidence.\n\nOur articles, interactive tools, and hypothetical examples contain information to help you conduct research but are not intended to serve as investment advice, and we cannot guarantee that this information is applicable or accurate to your personal circumstances. Any estimates based on past performance do not a guarantee future performance, and prior to making any investment you should discuss your specific investment needs or seek advice from a qualified professional.\n\nHow We Make Money\n\nThe offers that appear on this site are from companies that compensate us. This compensation may impact how and where products appear on this site, including, for example, the order in which they may appear within the listing categories, except where prohibited by law for our mortgage, home equity and other home lending products. But this compensation does not influence the information we publish, or the reviews that you see on this site. We do not include the universe of companies or financial offers that may be available to you.\n\nEditorial disclosure\n\nAll reviews are prepared by our staff. Opinions expressed are solely those of the reviewer and have not been reviewed or approved by any advertiser. The information, including any rates, terms and fees associated with financial products, presented in the review is accurate as of the date of publication."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDQvMTgvZXRoZXJldW0tdW5zdGFraW5nLXJlcXVlc3RzLW5vdy1mYWNlLWFib3V0LWEtMTctZGF5LXdhaXQv0gFmaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wNC8xOC9ldGhlcmV1bS11bnN0YWtpbmctcmVxdWVzdHMtbm93LWZhY2UtYWJvdXQtYS0xNy1kYXktd2FpdC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Unstaking Requests Now Face About a 17-Day Wait - CoinDesk",
        "content": "Concurrently, stakers over the last 24 hours have deposited more ETH into the chain than there have been withdrawal requests, creating a net 86,000 ETH staked, or 0.3% increase in staked ETH – despite all the withdrawals that have already taken place. This shows that since the upgrade, stakers have gained confidence in Ethereum’s staking process."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3JlZ3VsYXRvcnktY2xhcml0eS1ldGhlcmV1bS1nZW5zbGVy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Regulatory Clarity? Gensler Can't Give a Simple Yes or No on Ethereum - Blockworks",
        "content": "Gary Gensler, the chair of the SEC appeared before Congress today to answer questions regarding his controversial tenure.\n\nAmong the questioners: Chair of the Financial Services Committee, Patrick McHenry.\n\nRegulators and prosecutors have been asserting, variously, that ether is a security (the attorney general of New York) or a commodity (the CFTC), or that it was a commodity in the past, but now they won’t say (the SEC’s director of corporate finance, William Hinman, said that neither ether nor bitcoin were securities in 2018).\n\nGiven that Gensler has spent considerable energy telling the digital asset industry that they have all the regulatory clarity they need, it’s worth transcribing the interchange between the two men word-for-word, so that you can judge for yourself if Gensler was clear.\n\nMcHenry asked Gensler some very specific questions, including this one, regarding Ether (ETH), the native token of the Ethereum blockchain.\n\n“Clearly an asset cannot be both a commodity and a security. Do you agree?”\n\n“Ummm, I… I… it’s… actually all securities are commodities under the Commodity and Exchange Act, it’s that we’re excluded commodities, but I would agree that a security cannot also be an excluded commodity and an included commodity, I’m sorry chair, just to talk about the Commodity Exchange Act, more precisely.”\n\nMcHenry did not appear to think this answer was an answer at all.\n\nHe followed up: “I’m asking you, sitting in your chair now, to make an assessment under the laws that exist: Is ether a commodity, or a security?”\n\n“Without speaking to any one…” began Gensler.\n\n“You’ve repeatedly said you won’t speak to one,” interrupted McHenry, “But you’ve spoken to one: bitcoin. So I’m asking you to speak to a second one, with the second largest market cap.”\n\n“In speaking to the tokens,” Gensler replied, “There’s ten to twelve thousand, if there’s a group of entrepreneurs…”\n\n“I’m asking about one,” interjected McHenry. “I’m asking you a specific question, Chair Gensler. I said this in private, this should be no shock to you that I’m asking this question. Is ether a commodity, or a security?”\n\nGensler: “And again, it depends on the facts and the law on if there’s a group of individuals…”\n\nMcHenry: “I’m asking about the facts and the law, sitting in your seat, and the judgment you are making.”\n\nGensler: “And so, Mr. Chair, I think you would not want me to prejudge…”\n\nMcHenry wasn’t having it. “But you have prejudged on this. You’ve taken 50 enforcement actions. We’re finding out as we go, as you file suit, as people get Wells notices on what is a security in your view and your agency’s view. I’m asking you a very simple question about the second-largest digital asset. What is your view?”\n\nOnce again, Gensler refused to answer. “And my view is, if there’s a group of individuals in the middle of it, the public is entitled…”\n\nMcHenry gave up and moved on.\n\nThere’s your regulatory clarity.\n\nNow come in and register.\n\nYouTube / GOP Financial Services\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1pcy11cC0xNS12ZXJzdXMtYml0Y29pbi1zaW5jZS1zaGFwZWxsYS1tb3JlLWV0aC1wcmljZS1nYWlucy1haGVhZNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Ethereum is up 15% versus Bitcoin since Shapella — More ETH price gains ahead? - Cointelegraph",
        "content": "Ether (ETH) entered a sharp price recovery a week after hitting a six-month low versus Bitcoin (BTC).\n\nOn April 18, the widely-tracked ETH/BTC pair reached 0.0709 BTC, up about 15% from its local bottom of 0.0602 BTC six days ago. Now, the pair eyes a run-up toward 0.075 BTC by June, based on the fractal setup previously discussed here.\n\nETH/BTC daily price chart. Source: TradingView\n\nEthereum’s Shapella FOMO\n\nInterestingly, Ether’s local bottom formation versus Bitcoin occurred on the day of Ethereum’s long-awaited Shapella upgrades.\n\nThe hard fork enables Ether stakers to withdraw their rewards — around 1.1 billion ETH — from Ethereum’s proof-of-stake smart contract. This update may have boosted ETH’s appeal compared to BTC, beating anticipations that a freshly unlocked Ether supply would increase sell pressure.\n\nStakers have withdrawn 574,700 ETH — worth about $1.21 billion — since the Shapella upgrades on April 12, according to data fetched by Nansen. Interestingly, Ether’s price in U.S. dollar terms has increased by 14.25% in the same period.\n\nETH deposits vs. withdrawals. Source: Nansen\n\nIt means that many stakers have decided to hold onto their Ether rewards. On the other hand, Bitcoin has failed to log a decisive breakout above its technical resistance of $30,000, possibly making ETH a more attractive short-term bet for traders.\n\nWeak institutional inflows versus Bitcoin\n\nInstitutional investors have shown more interest in Bitcoin than Ether in the past week, according to CoinShares’ weekly report.\n\nFor instance, Bitcoin-based investment vehicles witnessed $103.8 million in inflows in the week ending April 14. In comparison, Ethereum funds attracted $300,000, showing that mainstream investors may have followed the “sell the news” strategy after the Shapella upgrades.\n\nNet flows into crypto funds. Source: CoinShares\n\nEther’s price, meanwhile, is also at risk of a possible bearish reversal move due to its overbought daily relative strength index.\n\nRelated: Shapella could bring institutional investors to Ethereum despite risks\n\nIf ETH price retreats from its current resistance level of around $2,140, its immediate downside target appears at around $1,984, which acted as resistance in May 2022 and August 2022.\n\nETH/USD daily price chart. Source: TradingView\n\nAn extended sell-off could push Ether price down to its 50-day exponential moving average (50-day EMA; the red wave) near $1,800, down about 15% from its current price levels.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL2F3cy5hbWF6b24uY29tL2Jsb2dzL2RhdGFiYXNlL3NlY3VyZWx5LWdlbmVyYXRlLWV0aGVyZXVtLXZhbGlkYXRvci1rZXlzLWF0LWxvdy1jb3N0LXVzaW5nLWEtc2VydmVybGVzcy1hcmNoaXRlY3R1cmUtb24tYXdzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Apr 2023 07:00:00 GMT",
        "title": "Securely generate Ethereum validator keys at low cost using a serverless architecture on AWS | Amazon Web Services - AWS Blog",
        "content": "The new proof-of-stake consensus mechanism on Ethereum blockchain network allows network participants to earn rewards without spending a lot of computational power for playing a part in securing the network. Unlike miners, validators don’t need to spend many CPU cycles to produce new blocks. They stake 32 ETH (the native cryptocurrency on Ethereum) to be allowed to attest user transactions and that way generate income through rewards. They also may lose a portion of their funds (slashed) for incorrect behavior, or for their node being unavailable. To avoid penalties, validators need to keep the availability of their infrastructure as high as possible, and it is a good reason why to run it on the cloud. Each validator has a public-private keypair associated with it. The validator keys (the public and private keys) are used to collect, and withdraw the 32 ETH collateral and any rewards that have been collected. The withdrawal feature is available in Ethereum’s Shapella update. Generating and storing validator keys in an unsecure manner poses risks of leaked keys. Other than withdrawal of the collateral by malicious parties, leaked keys can also be used to perform long-range attacks, putting the entire Ethereum network at risk of a history rewrite. Long-range attacks work by creating and maintaining a parallel chain, thus rewriting the entire history of the blockchain. To reconstruct a parallel chain, the keys of past validators are needed. Therefore, in this blog post we will focus on safeguarding the validator keys since their inception.\n\nSolution overview\n\nWhen generating new Ethereum validator keys, the common practice is to use code written and tested by the community. But in addition to the code itself, the overall solution should:\n\nMake sure the private key will never be exposed right after generation and always stays encrypted at rest.\n\nSet the process to get assurance that the code generating the key pair is properly reviewed before deployment, and only the reviewed version can be deployed.\n\nBe as cost-effective as possible because key generation is a relatively rare process and we don’t need always-on resources to support it.\n\nIn the proposed solution, we run staking-deposit-cli tool from the official Ethereum GitHub account in AWS Lambda. staking-deposit-cli tool is used generate EIP-2335 format BLS12-381 keystores (the public and private key-pair) and a corresponding deposit data JSON file. The deposit data JSON file is to be uploaded to Ethereum Staking Launchpad to signify registration of the validator to the Ethereum network. The aforementioned items are generated in-memory in AWS Lambda. We also introduce two personas: release manager and developer, to facilitate the code review process. The release manager is authorized to sign the code shared by developer with a signing profile from AWS Signer. The code signing feature of Lambda ensures that the source code package of the secure key-generation function is signed with the signing profile controlled by the release manager.\n\nThe following diagram depicts the key components and how they are used for code deployment and key generation. The accompanying GitHub repository contains the code and instructions for deploying this solution into your own account.\n\nThe diagram includes the following high-level steps to deploy the function code, review it, and then use that function to generate keys:\n\nDeveloper packages the source code for the staking-deposit tool and uploads it to the deployment Amazon Simple Storage Service (Amazon S3) bucket. The release manager triggers the code signing process with AWS Signer. AWS Signer creates the signed version of the source code. The release manager triggers the deployment of the signed code package to Lambda. An automated trigger or an individual authorized user triggers the key-generation Lambda function. The Lambda function generates the secrets in-memory and encrypts them using data encryption key within AWS Key Management Service (AWS KMS). In our sample application we pre-generate the KMS data encryption key during the deployment of the solution. The secret generated by the function is JSON-formatted data which consists of the following: An encrypted BLS12-381 keystore\n\nA randomly generated password to decrypt the keystore\n\nA mnemonic from which the private key is derived from The Lambda function sends the encrypted secrets and the deposit data in base64 format to Amazon DynamoDB. It can be retrieved from the DynamoDB table, decoded, and finally uploaded to the staking launchpad.\n\nFinally, upload the deposit data JSON object to the staking launchpad to finish the staking process. The deposit data JSON object is not encrypted – that’s because it doesn’t contain any sensitive information, so it can be It can be retrieved from the DynamoDB table (see the details in the README of the accompanying GitHub repository)\n\nAfter our secrets are encrypted and stored safely, we can use it to sign attestations, which we will discuss next.\n\nKey decryption and usage\n\nIn our solution, the AWS KMS key policy shouldn’t grant the Lambda function access to perform decryption of the encrypted validator key because the Lambda will never sign attestations. Instead, the key policy should be modified to allow only the protected compute, such as isolated Amazon Elastic Compute Cloud (Amazon EC2) instance or even more isolated AWS Nitro Enclaves, to decrypt the encrypted validator keys in order to sign attestations. The code on those instances performs the following actions:\n\nRetrieve the validator private key from DynamoDB as cyphertext. Decrypt the cyphertext with the corresponding data encryption key in AWS KMS. Pass the decrypted validator key to Web3Signer code to sign attestations.\n\nIn the following series of blog posts we show the example of how such system will work, so will omit the details here.\n\nThe isolated Lambda execution environment for secure key generation\n\nIn Lambda, execution environments are isolated from one another and may only be used for one concurrent invocation at a time. Customers and other users can initiate inbound or ingress network communications with an execution environment only through the Lambda’s Invoke API, which triggers the invocation of a Lambda function (services’ data plane). This helps ensure that communications to your execution environment are authenticated and authorized, and that users can interact with its storage or memory only through the code that you deployed. In addition, all customer data stored within the management APIs of Lambda (its control plane) is encrypted at rest through the use of AWS KMS, which is designed to protect it from unauthorized disclosure or tampering. At the same time, Lambda execution environments may be reused across multiple invocations of the same function version for performance reasons. Therefore, the function code in the accompanying sample app regenerates the secrets for every new invocation to make sure they are not reused by subsequent calls.\n\nFor audit purposes, you can also enable AWS CloudTrail logs on the AWS account with the deployed Lambda function and use AWS Config to track your function configuration changes.\n\nFor more information on Lambda security, refer to Security Overview of AWS Lambda.\n\nConclusion\n\nIn this post, we learned about the new role of validators in the Ethereum network that participate in the proof-of-stake consensus mechanism. We reviewed the requirements for safe key generation on cloud and walked through a sample solution architecture and the process it helps facilitate. We also reviewed the security aspects that Lambda brings into the picture, and how it encompasses security best practices using Lambda.\n\nTo learn more about using the encrypted validator keys in a secure environment using AWS Nitro Enclaves read this series of blog posts: part 1, part 2.\n\nAbout the Authors\n\nNikolay Vlasov is a Senior Solutions Architect with AWS Worldwide Specialist Solutions Architect organization focused on blockchain-related workloads. He helps clients to turn their ideas into Pilots, Minimally Viable Products, and Production-ready systems based on blockchain technology.\n\nAldred Halim is a Solutions Architect with AWS Worldwide Specialist Solutions Architect organization. He works closely with customers in designing architectures and building components to ensure success in running blockchain workload on AWS."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vZm9ya2FzdC5uZXdzL2V0aGVyZXVtLWluZmxvd3Mtc2xvdy1mb2xsb3dpbmctc2hhbmdoYWktdXBncmFkZS1leGNoYW5nZXMtc2VlLWV0aGVyLWluZmx1eC_SAWVodHRwczovL2Zvcmthc3QubmV3cy9ldGhlcmV1bS1pbmZsb3dzLXNsb3ctZm9sbG93aW5nLXNoYW5naGFpLXVwZ3JhZGUtZXhjaGFuZ2VzLXNlZS1ldGhlci1pbmZsdXgvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Ethereum inflows slow following Shanghai upgrade, exchanges see Ether influx - Forkast News",
        "content": "Ethereum-linked products saw little investment interest with inflows of around US$300,000 in the week ending April 14, accounting for a tiny portion of the total US$114 million weekly inflow into digital assets and despite the blockchain’s milestone upgrade last week, according to a report from European cryptocurrency investment firm CoinShares.\n\nSee related article: Kraken to withdraw US$1.17 bln of staked Ether in line with SEC ruling, settlement\n\nFast facts\n\nTotal investment in digital asset products reached US$114 million last week, with Bitcoin getting the lion’s share of US$104 million, according to the report. It was the fourth week in a row of inflows.\n\n“This four-week run of inflows now total US$345 million, almost fully correcting the prior six-week run of outflows that totalled US$408 million,” the CoinShares report said. “We believe this is a flight to safety by investors fearful of the ongoing traditional finance challenges.”\n\nDevelopers of the Ethereum blockchain on April 12 updated the network with new features including allowing the withdrawal of staked Ether. Such tokens were deposited to support the operations of the Ethereum blockchain, the world’s second-biggest, in return for a passive income, usually in the form of more tokens.\n\nHowever, data from on-chain analysis company CryptoQuant showed during the period between April 13 and 17, cryptocurrency exchanges saw a net inflow of about 131,395 Ether (US$273.3 million), compared to the more than 1.46 million Ether in total transferred to the exchanges, a move typically indicating selling intention from crypto holders.\n\nAnalysts at crypto research firm Kaiko said on Monday that the ETH-USD pair on crypto exchange Coinbase has seen more sell orders than buys since the upgrade.\n\nAs of Tuesday noon in Hong Kong, around 1.06 million Ether have been withdrawn since the Wednesday upgrade with 465,940 Ether deposited, according to data from Token Unlocks.\n\nEther edged down 0.88% in the past 24 hours to change hands at US$2,080, but rose 8.24% in the past seven days, according to data from CoinMarketCap. Bitcoin fell 1.73% in the last 24 hours to trade at US$29,464, logging a 2.1% weekly drop.\n\nSee related article: Ethereum Shanghai upgrade prompts Ether withdrawals, but no stampede for exits"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZGVjcnlwdC5jby8xMzcxNjcvaGFja2VyLXN0b2xlbi0xMC1taWxsaW9uLWV0aGVyZXVtLW5vLW9uZS1rbm93cy1ob3fSAVJodHRwczovL2RlY3J5cHQuY28vMTM3MTY3L2hhY2tlci1zdG9sZW4tMTAtbWlsbGlvbi1ldGhlcmV1bS1uby1vbmUta25vd3MtaG93P2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "A Hacker Has Stolen $10 Million in Ethereum and No One Knows How - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA $10 million hack targeting sophisticated crypto users has top security experts baffled.\n\nTaylor Monahan, former CEO and founder of Ethereum wallet manager MyCrypto, said on Twitter Tuesday that over 5,000 in ETH had been stolen since December.\n\nThat’s over $10.4 million-worth of crypto at today’s prices.\n\nAD\n\nAD\n\nThe worrying part? It hit hardware wallets of users who prioritized security, according to Monahan.\n\n“For the past 48 hrs I’ve been unwinding a massive wallet draining operation,” wrote Monahan, who joined MetaMask after MyCrypto was acquired by the crypto wallet’s parent company ConsenSys last year. “Folks are those who are more crypto native than most” and “reasonably secure” were hit by the draining of funds, she tweeted.\n\nFor the past 48hrs I've been unwinding a massive wallet draining operation 😳😭 I don't know how big it is but since Dec 2022 it's drained 5000+ ETH and ??? in tokens / NFTs / coins across 11+ chains. Its rekt my friends & OGs who are reasonably secure. No one knows how. pic.twitter.com/MafntG7RkP — Tay 💖 (@tayvano_) April 18, 2023\n\nIn other words, these aren’t crypto newbies clicking on obvious phishing links that are being drained. The attack is far more sophisticated than that, and it’s OGs who are being “rekt,” Monahan explained. “No one knows how.”\n\nThe security team behind popular crypto wallet MetaMask told Decrypt that the “unidentified exploit” hit crypto users “including, but not limited, to MetaMask users.”\n\nAD\n\nAD\n\n“The on-chain behavior heavily suggests a private key compromise,” they said.\n\n“What current investigations are showing is that it seems that this specific attack vector is pointing towards these users’ secret recovery phrases being compromised somewhere down the line, likely due to unintentionally insecure storage of said phrase.”\n\nPrivate keys are used by crypto users to access their funds stored in a wallet—be it digital or physical—and authorize transactions.\n\nMonahan also said that the attack targeted funds held on wallets created from 2014-2022. “My best guess [right now] is that someone has got themselves a fatty cache of data from 1+ [years] ago [and] is methodically draining the keys as they parse them from the treasure trove,” Monahan tweeted. She emphasized that, however, that this is only a guess, and no one yet has been able to “determine the source of their compromise.”\n\nHer best advice? “Please don’t keep all your assets in a single key or secret phase for years,” she said.\n\nMetaMask’s security team added that in order to protect funds, users must not store their private keys anywhere online or on any “internet-enabled device.”\n\n“If you ever get to the point where your wallet is so old that you can’t remember if you’ve been 100% diligent with its keys at all times, then consider creating a new wallet,” they added."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA0LzE3L2Zvcm1lci1nb2xkbWFuLXNhY2hzLWV4ZWN1dGl2ZS1kZXRhaWxzLWJpZy1jcnlwdG8tb3Bwb3J0dW5pdHktaW4tZXRoZXJldW0tZXRoLW1lZ2EtdHJlbmQv0gF-aHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDQvMTcvZm9ybWVyLWdvbGRtYW4tc2FjaHMtZXhlY3V0aXZlLWRldGFpbHMtYmlnLWNyeXB0by1vcHBvcnR1bml0eS1pbi1ldGhlcmV1bS1ldGgtbWVnYS10cmVuZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Apr 2023 07:00:00 GMT",
        "title": "Former Goldman Sachs Executive Details Big Crypto Opportunity in Ethereum (ETH) ‘Mega Trend’ - The Daily Hodl",
        "content": "Former Goldman Sachs executive Raoul Pal says that there’s one big overlooked opportunity in the Ethereum (ETH) ecosystem.\n\nThe macro guru tells his nearly one million Twitter followers that CryptoPunks, one of the biggest non-fungible token (NFT) projects in existence, are starting to look appealing.\n\nThe Real Vision founder shares the floor price chart of CryptoPunks depicting declining prices, which he says could be an opportunity for bulls.\n\n“Punks are starting to get very interesting… They have held up in dollar terms at around $100,000 but in ETH. The tax season plus Blur farming has led to near-distressed prices.\n\nAs ETH rises over time, excess gains get recycled into trophy assets, with a lag. Same as traditional art when stock markets have been strong.\n\nLow prices seem to be an opportunity if you think crypto rises a lot over the next few years, which I believe.”\n\nWhile some have trouble grasping how seemingly silly images could be so valuable, Pal says that ETH holders often like to take their profits and put them into NFTs to diversify and send social signals to the rest of the space.\n\nIn a recent interview with NFT artist FVCKRENDER, Pal says NFTs are changing the game and allowing creators and artists to act as a new avenue for mass blockchain adoption.\n\n“[Artists and creators] have engaged millions of people in blockchain. To be honest, artists are the people who really lead movements, whether it’s musical artists or physical artists themselves…\n\nThis nexus between physical and digital, those two worlds are merging. So that’s one learning. The other learning is the metaverse [and] how it becomes the future digital representation of everything. How you can build brands from the ground up based around culture… To give their artists their control back, I think that’s probably another mega trend that we can see in the future.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/A. Solano"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA0LzE3L2V4Y2hhbmdlcy1yZWNlaXZlLTM3NW0taW5mbHV4LW9mLWV0aGVyLXNpbmNlLXNoYW5naGFpLXVwZ3JhZGUtYXMtcHJpY2UtaGl0cy0xMS1tb250aC1oaWdoL9IBigFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA0LzE3L2V4Y2hhbmdlcy1yZWNlaXZlLTM3NW0taW5mbHV4LW9mLWV0aGVyLXNpbmNlLXNoYW5naGFpLXVwZ3JhZGUtYXMtcHJpY2UtaGl0cy0xMS1tb250aC1oaWdoL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Shanghai Upgrade Leads to Huge Influx of ETH at Exchanges - CoinDesk",
        "content": "Coinbase was one of the first exchanges that let users immediately unlock and withdraw their staked ETH via its platform. Binance, the world’s largest crypto exchange by volume, will follow suit on April 19, which “could result in more sell pressure for ETH,” Kaiko wrote."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3JvY2tldC1wb29sLWF0bGFzLWV0aGVyZXVtLXN0YWtpbmfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Rocket Pool Upgrade Lowers Ethereum Staking Cap to 8 ETH - Blockworks",
        "content": "Rocket Pool, the Ethereum-based DeFi staking protocol, has just pushed a major update granting users instant access to ETH staking rewards moving forward.\n\nAtlas, which launched without issue Monday evening, brings changes and features following the successful rollout of Ethereum’s Shapella upgrade last week. Shapella enabled ETH stakers to withdraw their crypto for the first time.\n\nThis meant Rocket Pool could lower Ethereum staking amounts for its so-called “minipools.” These tailored validator nodes now accept ETH stakes as small as 8 ETH ($16,800), down from 16 ETH ($33,600).\n\nStaking individually to the Ethereum blockchain demands at least 32 ETH ($67,100). Rocket Pool also supports pooling of ETH to boost chances of earning greater rewards.\n\n“Atlas has two themes, withdrawals and scaling Rocket Pool,” the team said in an Atlas live stream. “Node operators can now access their rewards they’ve generated over the last 14 months … if they want to, they can exit completely.”\n\nAtlas brings with it automatic rewards distributions, a unified Grafana dashboard and support for an Ethereum consensus client known as Lodestar.\n\nRocket Pool users can separately stake any amount of ETH to receive a liquid staking derivative token, rETH. Similar to other staking services such as Lido, Rocket Pool’s minipools and rETH let investors with less capital participate in the staking process to earn rewards otherwise out of reach.\n\nFurther changes made it easier to engage with the Ethereum blockchain by providing greater flexibility in Beacon Chain management, the team said.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ob3ctdG8tdXNlLWdhbmFjaGUtZm9yLWJsb2NrY2hhaW4tcHJvamVjdC1kZXZlbG9wbWVudNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Apr 2023 07:00:00 GMT",
        "title": "How to use Ganache for blockchain project development - Cointelegraph",
        "content": "Programming languages like Solidity, which is used to build smart contracts on the Ethereum blockchain network, are frequently used in blockchain development. Ganache helps developers test and debug their applications before deploying them on a live blockchain network. Also, developers must be well-versed in blockchain technology, including its underlying architecture and concepts like consensus algorithms, cryptography and decentralized governance.\n\nThis article will discuss what Ganache is, and how you can use it in decentralized application (DApp) development.\n\nWhat is Ganache in blockchain technology?\n\nGanache is a software tool developers widely use to create a local blockchain network for testing and development purposes. Developers may effectively test different scenarios and troubleshoot their blockchain apps by simulating a blockchain network on their local PC with Ganache. Ganache supports the quick development of distributed applications using Ethereum and Filecoin.\n\nThe tool is first installed on the developer’s computer, and a new workspace must be created before using Ganache for blockchain project development. Developers can link their blockchain project to Ganache once the workspace has been built, enabling them to test and debug their application on the simulated blockchain network.\n\nGanache provides a range of useful features, including the creation of new accounts, the ability to send transactions and the capability to debug smart contracts. By effectively locating and fixing bugs in their smart contract code, developers can use Ganache as a debugging tool to speed up the development process. The debugger feature allows developers to comb through their code line-by-line and see the values of variables at each step, making it easier to find and fix bugs.\n\nTwo versions of Ganache are available: a user interface (UI) and a command line interface (CLI). Thanks to the user-friendly Ganache UI, developers can quickly communicate with the local blockchain. In addition to offering real-time data on accounts, balances, transactions and events, it also has tools for testing and debugging smart contracts. In addition, the interface includes a built-in block explorer tool that lets users examine the specifics of each block and transaction.\n\nOn the other hand, developers can communicate with the local blockchain via the terminal using the Ganache CLI. It is a more versatile and compact choice for people who prefer using command-line tools. Developers may automate testing and deployment operations by integrating the CLI with other development tools and scripts.\n\nRegardless, the essential functionality of the Ganache UI and CLI is the same, and developers can choose the version that best suits their tastes and workflow.\n\nIs Ganache blockchain free?\n\nYes, Ganache is a free, open-source blockchain development tool. The personal blockchain network can be launched and managed using Ganache’s user-friendly interface. To make it simple for developers to test their smart contracts in a secure environment, it also produces private keys for the accounts generated in the network.\n\nRelated: The importance of open-source in computer science and software development\n\nIn the Ethereum development community, Ganache is a popular tool for creating, evaluating and deploying smart contracts. It is ideal for developers to incorporate it into their workflows because it is interoperable with other Ethereum development tools like the Truffle Suite framework. Truffle Suite is an Ethereum development framework for building, testing and deploying smart contracts on the blockchain.\n\nAre Truffle and Ganache the same blockchain?\n\nTruffle and Ganache are not the same blockchains, but they are closely related tools used in blockchain development. Truffle can be used with various blockchain networks, but as a local development network, it is most often used with Ganache.\n\nBefore releasing their smart contracts to a live network, developers can use Truffle to design, compile and test them on the Ganache network. This makes it possible to design and test software fast and affordably, and iterate on and modify the code of smart contracts.\n\nHow to install and use Ganache\n\nGanache is an essential tool for blockchain developers, as it allows them to test and debug their applications on a simulated blockchain network before deploying them on a live network. Here’s a step-by-step guide on how to install and use Ganache for personal Ethereum blockchain development:\n\nStep 1: Download and install Ganache\n\nDownload the application for your operating system from the official Ganache website. Run the installation file after downloading it, then install the application on your computer by adhering to the on-screen prompts. Ganache is available for Windows, Mac and Linux operating systems in all its versions.\n\nStep 2: Create a new workspace\n\nTo create a new workspace, open the Ganache application and select “New Workspace.” Users can set up the network parameters for their unique Ethereum blockchain in the workspace settings, including the number of accounts, the gas limit and the starting balance of each account.\n\nAn Ethereum workspace is a set of settings and user accounts that establish the parameters for a customized Ethereum blockchain network built using Ganache. Developers may quickly set up a private Ethereum network for testing and development purposes using workspaces.\n\nStep 3: Start the personal Ethereum blockchain network\n\nAfter configuring the network settings, click “Start” to begin your own private Ethereum blockchain network. For each of the accounts you set up in the workspace settings, Ganache will generate a set of private keys. Then, copy the remote procedure call (RPC) server address from the top of the screen, as you’ll need this to connect your development tool.\n\nUsing the RPC communication protocol, client software can invoke a server-side process from a distance. As a result, it is feasible to activate a procedure or function in another address space or process without the programmer worrying about the specifics of the underlying network transport or communication protocols. It enables programs to communicate with other systems on a network.\n\nStep 4: Connect your development tool to the Ganache network\n\nIt is necessary to link one’s development tool, such as Truffle Suite, to the Ganache network to deploy and test smart contracts on the private Ethereum blockchain. To do so, follow these steps:\n\nOpen your development tool and find the settings or configuration menu.\n\nSearch for a provider or network selection option, then type the RPC server address you copied from Ganache.\n\nTo ensure your development tool uses the new network, save your modifications and restart it.\n\nStep 5: Test and deploy smart contracts\n\nAfter configuring the network, users can deploy and test their smart contracts on the private Ethereum blockchain. Using the Truffle command line interface, they can compile and deploy their contracts to the Ganache network. Once the contracts are deployed, the Truffle CLI can interact with them and test their functionality.\n\nIt allows developers to interact with their smart contracts and the underlying blockchain network using various commands. Using the Truffle CLI, developers can automate the building and deployment of smart contracts, making it easier to develop and deploy DApps.\n\nWhen a smart contract is deployed to the mainnet, it must be submitted to the network, and a fee in cryptocurrency is paid to cover the cost of running the contract on the blockchain. When a contract is deployed, it becomes unchangeable and immutable. To guarantee that the smart contract works as intended and is secure, testing it properly before deployment is crucial.\n\nAn example of a simple contract deployment using Truffle CLI\n\nStep 1: Go to the directory where one wishes to build a project by opening the terminal or command prompt.\n\nStep 2: To start a new Truffle project, enter the following command:\n\n“Truffle init” is a command that initializes a new Truffle project with a basic directory structure and configuration files.\n\nStep 3: Under the contracts directory, add a new Solidity contract file. Here’s an example of a simple contract that stores a string:\n\nThe above code is a smart contract written in the Solidity programming language. One declared variable, a public string variable called “myString,” is present in the contract named “MyContract.” Everybody on the blockchain can access the string variable, which is initialized to “Hello, world!”\n\nWith a tool like Ganache, this contract can be set up on a private blockchain or an Ethereum network. Once installed, it can be used to interact with transactions sent to its blockchain address.\n\nStep 4: A contract can be compiled by running the following command:\n\n“Truffle compile” is a command that compiles the contract code and generates an application binary interface (ABI) and bytecode. The ABI serves as the interface between smart contracts and applications, while bytecode is a smart contract’s compiled version that may be run on the Ethereum Virtual Machine (EVM).\n\nStep 5: Run the following command to deploy the contract to a local blockchain network like Ganache:\n\n“Truffle migrate” is a command used to deploy the contract to the local network and create a new migration script in the “migrations” directory.\n\nStep 6: Run the following command to interact with the deployed contract using the Truffle console:\n\n“Truffle console” opens up a console with the web3.js library and contract artifacts loaded, allowing interaction with a blockchain network.\n\nStep 7: By establishing an instance of their contract and calling its functions once they are on the console, users can communicate with their contract. For instance, the following commands can be used to retrieve the value of myString:\n\nThe value of a string variable (myString) is then retrieved from the deployed instance of a smart contract (MyContract) using the above code. The output “Hello, world!” is printed to the console using “console.log(result).”\n\nAdvantages of using Ganache\n\nUsing Ganache as a blockchain development tool has several benefits. One of the key advantages is that it gives users access to a private Ethereum blockchain network with an intuitive UI for testing and development. As a result, programmers can test their smart contracts in a safe and private setting before using them on a live network. By offering a local network, developers can also avoid the high costs and prolonged transaction times linked to public networks.\n\nFor testing and development, Ganache also produces private keys for the accounts formed in the network, adding another level of protection. Moreover, creating, testing and deploying smart contracts on the blockchain is made simpler due to Ganache’s compatibility with the Truffle Suite framework.\n\nThe creation of DApps, such as blockchain-based games, and the testing of smart contracts for blockchain-based supply chain management systems are examples of how Ganache can be used.\n\nChallenges of using Ganache for blockchain development\n\nWhile Ganache is a powerful tool for blockchain development, there are still some challenges that developers may encounter. The fact that Ganache is a local development network and not directly connected to the Ethereum mainnet presents one of the main difficulties. Because of this, there may be differences in how smart contracts behave when deployed to a live network between the Ganache network and the mainnet, which may cause unforeseen problems.\n\nThe fact that Ganache might not always reflect the same conditions as a live network presents another difficulty with using it. Ganache, for instance, lets developers establish their own gas rates, which might not match those on a real network. When implementing smart contracts on a live network, this can cause problems because the gas price might not be enough to complete the transaction.\n\nFinally, issues with Ganache’s interoperability with other Ethereum development tools may arise. Although Ganache and the Truffle Suite framework are pretty compatible, there can be problems if developers use other programs or libraries that are not made to function with Ganache."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wNC8xOC9yb2NrZXQtcG9vbC1tYWRlLWl0LWNoZWFwZXItdG8tc3Rha2UtZXRoLXRocm91Z2gtaXRzLXBsYXRmb3JtLWZvbGxvd2luZy1ldGhlcmV1bS1zaGFuZ2hhaS11cGdyYWRlL9IBkwFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wNC8xOC9yb2NrZXQtcG9vbC1tYWRlLWl0LWNoZWFwZXItdG8tc3Rha2UtZXRoLXRocm91Z2gtaXRzLXBsYXRmb3JtLWZvbGxvd2luZy1ldGhlcmV1bS1zaGFuZ2hhaS11cGdyYWRlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Rocket Pool Made It Cheaper to Stake ETH Through Its Platform Following Ethereum Shanghai Upgrade - CoinDesk",
        "content": "RPL has rallied almost 30% to $55.37 in the six days since Shapella, per CoinGecko. Rocket Pool’s total value locked (TVL) increased more than 20% to $1.47 billion in the same period, making it the third-largest liquid staking entity, trailing only Lido and Coinbase, data from DefiLlama shows."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2F1cm94LXdhbGxldC1ldGhlcmV1bS10cmFuc2FjdGlvbnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Aurox Makes it Simpler to Transact on Ethereum - Blockworks",
        "content": "Aurox wallet users will no longer need to hold ether to make transactions on the blockchain.\n\nOn Ethereum today, token swapping involves users having to hold ether (ETH) in their wallets so that they can pay for gas fees which will execute the transactions. This can be a confusing experience for users who are not yet familiar with the DeFi ecosystem.\n\nTo resolve this pain point, web brower extension-based Aurox Wallet has partnered with Chainlink to enable its users to pay gas fees in any ERC-20 token instead of paying for the cost in ETH.\n\nIn an interview with Blockworks, Aurox CEO Giorgi Khazaradze explains that one of the biggest challenges he came across when he first dabbled into the blockchain technology space was not understanding that he needed to hold certain tokens in order to make transactions on-chain.\n\n“I wanted to send USDC to my developer and I couldn’t because I didn’t have any ETH — I think a big holdup on people that are entering into DeFi is they don’t realize that one tiny thing can basically make your wallet useless,” Khazaradze said. “So we developed a version where even if you set up a brand new wallet, you deposit your USDC into it, you can swap that USDC in the wallet…you don’t ever have to touch ETH at all.”\n\nUnlike many of its competitors, Aurox Wallet will not be following the ERC-2771 token standard Khazaradze notes.\n\nERC-2771 requires users to approve transactions for the ERC20 token, which means they are still required to cough up ETH for network fees.\n\nAs it currently stands, only tokens such as DAI allow users to execute transactions without paying an approval transaction fee, Khazarade said.\n\nInstead, Aurox Wallet will be using Flashbots to bundle and approve transactions.\n\nFor example, if a user is trying to swap USDC for USDT, a bundled transaction will be sent to the Flashbots ​​Remote Procedure Call (RPC) and the transactions will be executed within the same block in three separate transactions:\n\nTransfer: ETH would be transferred from Aurox’s hot wallet to the user’s wallet if they do not hold any ETH.\n\nApproval: if necessary.\n\nSwap: The input token will be converted to ETH and paid back to Aurox for enabling the initial ETH transaction.\n\nPrices will be executed based on Chainlink Price Feeds to ensure users are getting accurate rates sourced from multiple different exchanges.\n\nAlthough multiple swaps will likely increase transaction fees, an Aurox GitHub post notes that these fees are offset by benefits such as Flashbots protecting users from being frontrun by MEV bots and is still relatively cheaper than paying trading and withdrawal fees on centralized exchanges.\n\nIt also notes that transactions are instant, meaning it is much faster than bridging tokens from another blockchain. Transferring ETH from another Web3 wallet is the only method that could be cheaper — albeit by a small margin.\n\nUltimately, Khazarade believes this new Aurox wallet feature will be able to eliminate “a pretty serious user experience problem for retail users.”\n\nA mobile version of the wallet along with hardware wallet support is planned.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1sYXllci0yLWJyaWRnaW5nLXVwLXNpeGZvbGQteWVhci1vbi15ZWFyLWluLXExLWFsY2hlbXnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Ethereum layer 2 bridging up sixfold year-on-year in Q1 — Alchemy - Cointelegraph",
        "content": "Ethereum layer 2s, such as Optimism, Arbitrum and Polygon, increased in popularity in the first quarter of 2023, according to a report from Web3 development platform Alchemy. Over 635,000 Ethereum users bridged crypto assets to these networks from January to March, an increase of 44% over the fourth quarter of 2023 and 518% over the first quarter of 2022.\n\nThe report, titled simply “Web3 Development Report,” cited Dune Analytics as its source for this data. It showed that only 103,000 users made bridging transactions to layer 2s in the first quarter of 2022, whereas the same three months saw over 635,000 users perform these transactions.\n\nAlchemy suggested that this increased activity may have been reinforced by successful airdrops from Optimism and Arbitrum in Q1, 2023.\n\nIn addition to increased asset bridging from users, layer 2s also showed greater activity from developers. Although the deployment of smart contracts related to layer 2s decreased by 30% relative to Q4 2022, it still increased by 160% when compared to Q1, 2022, the report said.\n\nThe crypto industry is coming off the back of a steep downturn in trading volume and crypto prices during 2022, with scandals like the UST depegging and FTX collapse causing many investors to shy away. But despite this negative sentiment, users still flocked to these new scalability solutions.\n\nRelated: 3 signs Arbitrum price is poised for a new record high in Q2\n\nThe Ethereum ecosystem as a whole also showed increased developer interest. Ethereum software development kits (SDKs) such as Ethers.js, Web3.js, Hardhat and Web3.py were downloaded 1.3 million times in Q1 2022. This became 1.9 million in the first quarter of 2023, an 8% increase. In addition, downloads of the MetaMask SDK, a tool used to develop apps that can interact with Ethereum wallet MetaMask, increased in each month of the first quarter.\n\nEthereum layer 2s have been offered as a solution to Ethereum’s scalability problem, which has been periodically causing high gas fees since as early as 2020. Some experts have argued that sharding the Ethereum network will also help to cut down on gas fees.\n\nThis story was updated on April 18 to clarify that the number of users bridging has increased by 518%, not the amount of assets bridged."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA0LzE4L2N1YmlzdC1sYXVuY2hlcy1iYW5rLWdyYWRlLWV0aGVyZXVtLWtleS1tYW5hZ2VtZW50LXNlcnZpY2Uv0gFsaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDQvMTgvY3ViaXN0LWxhdW5jaGVzLWJhbmstZ3JhZGUtZXRoZXJldW0ta2V5LW1hbmFnZW1lbnQtc2VydmljZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Cubist Launches Bank-Grade Ethereum Key Management Service - CoinDesk",
        "content": "“HSMs are the gold standard in the banking industry, and for a good reason,” said Wahby. “Conceptually an HSM means your key is bound to a physical object. That’s very different from a case where somebody puts malware on your computer and silently copies your keys, and then a few weeks later the hack happens.”"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDQvMTkvZXRoZXJldW0tZmVlcy1zcGlrZS1hcy1ib3RzLXNwZW5kLW1pbGxpb25zLXRvLWZyb250cnVuLXB1bnRlcnMtb2YtcGVwZS1jaGFkL9IBeWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDQvMTkvZXRoZXJldW0tZmVlcy1zcGlrZS1hcy1ib3RzLXNwZW5kLW1pbGxpb25zLXRvLWZyb250cnVuLXB1bnRlcnMtb2YtcGVwZS1jaGFkL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Fees Spike as Bots Spend Millions to Front-Run Punters of PEPE, CHAD - CoinDesk",
        "content": "A sandwich attack, traps a user's transaction between two transactions, which is then further manipulated to gain profits. This is done by front-running the victim's trade by buying the same asset, and then selling tokens to the victim in the same trade for a slightly higher price."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wNC8xNy9ldGhlcmV1bS16a2V2bXMtc2Nyb2xsLW5ldHdvcmstc2NhbGFiaWxpdHkv0gFmaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDIzLzA0LzE3L2V0aGVyZXVtLXprZXZtcy1zY3JvbGwtbmV0d29yay1zY2FsYWJpbGl0eS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Apr 2023 07:00:00 GMT",
        "title": "Scroll Aims to Be the Turtle That Wins the Ethereum Scaling Race - CoinDesk",
        "content": "To make these matters harder (worse?) it's all being done in the open. Every Scroll pull request, comment, line of code and so forth is playing out in real time on its Github repository. That means anyone with an internet connection – anywhere in the world – can track the progress of Scroll’s codebase. It’s a little flourish of transparency that Zhang said is “a step above” the commonplace practice (even among open-source projects) of building code behind closed doors and then throwing them open at some point in time."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wNC8xNy9yYWluYm93LWV0aGVyZXVtLXdhbGxldC1tb2JpbGUtZmlyc3QtZGVzaWduL9IBZ2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wNC8xNy9yYWluYm93LWV0aGVyZXVtLXdhbGxldC1tb2JpbGUtZmlyc3QtZGVzaWduL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Apr 2023 07:00:00 GMT",
        "title": "Rainbow Helps Users Slide Into the Crypto Economy - CoinDesk",
        "content": "Rainbow, founded in 2018, wants to be the general public’s portal to the new crypto economy. It has a sleek user interface – closer to CashApp than to Chase bank – and an easy onboarding process. Although there was a technical hiccup when Soulja Boy was trying to set up the Ethereum Name Service name Demarais gifted him (the rapper initially tweeted out a Coinbase deposit address he did not fully control), Demarais thinks the situation spoke to Rainbow's strengths and the reason for dead-simple sign-on processes his team is trying to make the norm in crypto."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tZXRoLWF0LXJpc2stYXMtc3Rha2VyLXNlbGwtb2ZmLWNvbmNlcm5zLWVtZXJnZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction: ETH At Risk As Staker Sell-Off Concerns Emerge - Analytics Insight",
        "content": "Ethereum (ETH) has been oscillating around the $2,100 level for the past four days as the Shapella upgrade excitement fades away. There are emergent signals of stakers positioning themselves for sell-action, as revealed by on-chain metrics. Traders are now concerned about the ability of the buyers to defend the immediate support level at $2,000.\n\nEthereum Stakers Are Ready To Offload\n\nFollowing an initial positive reaction to the successful Ethereum Shapella upgrade, the second largest altcoin by market capitalization now faces an uncertain short-term future. According to data from Glassnode, the supply of ETH deposited on exchanges has increased by more than 100,000 Ether since April 10. This is an indication that holders are seeking to sell their tokens, which can happen faster and easier when it is on the trading platforms.\n\nThe chart below shows that Ethereum balance on exchanges increased by 0.6% from 18.09 million ETH on April 13 (a day after stETH withdrawal was enabled) to 18.20 million ETH on April 17.\n\nNote that when crypto assets are held on exchanges, it makes them readily available for trading, and with Ethereum stakers pulling out their coins from the Beacon Chain, they could accumulate overhead pressure. Such an outcome could provoke a potential pullback in the next few days.\n\nAdditionally, an evaluation of the aggregate order books from different exchanges shows that the number of Ether available for sale at the moment is far more than the demand at the current market rates. On-chain data by IntoTheBlock reveals that there are open sell-orders for 6 million ETH around the +/-30% price boundaries. However, as it stands, buyers have only placed orders for around 5.2 million ETH.\n\nWhen exchange order books record more sell orders than buy orders, it usually means there is higher supply than demand for the asset.\n\nTherefore, the influx of Ethereum coins on exchanges, a sign of selling momentum accumulated possibly due to newly unstaked coins, and unbalanced exchange order books could all play out, triggering a sell-off in Ethereum price.\n\nEthereum Price At Risk Of 9% Losses\n\nETH was trading at $2,101, up 0.34% on the day, with a 24-hour trading volume of $9.23 billion. The largest altcoin was trading within a significant supply stretching from $1,900 to $2,150. If the price volatility remains the same, the Ethereum price could remain within this area for some time.\n\nThis means, a daily candlestick close below the $2,000 psychological level could see ETH drop toward the $1,900 defense level. This would represent a 9.4% drop from the current price. This could be where Ethereum’s downside is capped for the short-term.\n\nHowever, incase of immense selling, Ethereum could drop below $1,900 to revisit the 50-day Simple Moving Average (SMA) at $1,768, the 100-day SMA at $1,678, and the 200-day SMA at $1,486.\n\nETH/USD Daily Chart\n\nOn the other hand, Ethereum was trading above these SMAs, suggesting that it sat on relatively strong support that could absorb any selling pressure. In addition, the RSI was pointing upward and was positioned in the positive region at 70, reinforcing the buyers’ grip on the price.\n\nAs such, a daily candlestick close above the upper limit of the supply zone at $2,150 would confirm a bullish breakout for ETH. Such a move would bolster Ethereum toward $2,500 representing a 19.5% uptick from the current levels.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wNC8xNy9zdGFya25ldC1pbnRlZ3JhdGVzLWFjY291bnQtYWJzdHJhY3Rpb24v0gFjaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDIzLzA0LzE3L3N0YXJrbmV0LWludGVncmF0ZXMtYWNjb3VudC1hYnN0cmFjdGlvbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Apr 2023 07:00:00 GMT",
        "title": "StarkNet Aims to Enhance Scalability, Privacy and Security on Ethereum - CoinDesk",
        "content": "Another use case that is natively available on StarkNet is what Ben-Sasson calls the “deadman switch.” Thanks to AAn on StarkNet, users can have features and coded logic built in that can transfer financial assets to others (that are pre-approved) in the event something happens. “If I just get run by a bus, then I can have the funds transferred automatically to some other address,” said Ben-Sasson. In a real world example, this would mimic that of a will and the transferring of traditional assets – which would be costly because lawyers and procedures are involved. This “switch” skips the middleman and transfers digital assets in the event that something major happens, which can be programmed through code."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9ldGhlcmV1bS1ldGgtdGFwcGVkLW5ldy0xMS1tb250aC1oaWdoLWJpdGNvaW4tYnRjLXNsaXBzLWJlbG93LTMway1tYXJrZXQtd2F0Y2gv0gFsaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL2V0aGVyZXVtLWV0aC10YXBwZWQtbmV3LTExLW1vbnRoLWhpZ2gtYml0Y29pbi1idGMtc2xpcHMtYmVsb3ctMzBrLW1hcmtldC13YXRjaC8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Tapped New 11-Month High, Bitcoin (BTC) Slips Below $30K: Market Watch - CryptoPotato",
        "content": "After several days of trading above the coveted $30,000 line, bitcoin has slipped below that level, charting a 5-day low.\n\nIn contrast, ETH pumped a bit higher today to register its new highest price level since May last year. BNB, DOGE, and SOL are up by impressive percentages, meanwhile.\n\nBitcoin Falls Below $30K\n\nAfter regaining the $30,000 level last week, the primary cryptocurrency remained mostly above it for the next several days, and even the US CPI numbers couldn’t really shake it. The most significant price increase came on Friday when the asset touched $31,000 for the first time since June 2022.\n\nHowever, the bears intercepted the move and pushed BTC south. Hours later, it found itself dumping to $30,000 but managed to maintain that level during the weekend amid low trading volumes.\n\nAs Sunday was coming to an end, BTC initiated a leg up but was stopped ahead of $30,600. The subsequent rejection drove it south hard, and bitcoin went to a 5-day low of $29,800.\n\nAlicia Bakery CMO - A really good agency Did you like this market update?\n\nThis is all you need not to miss any price action in the raging crypto markets. Start receiving this recap, for free, every day: Invalid email address Your privacy is guranteed. Thanks for subscribing, you will get your first report in the next hours!\n\nAs of now, the asset has recovered around $100 but still stands below $30,000. Its market capitalization has retraced to under $580 billion, while its dominance over the alts has taken another hit and is now down to 45.7% after exceeding 47% a week ago.\n\nETH’s New Local Peak\n\nEthereum stole bitcoin’s spotlight last week upon the completion of the long-anticipated Shapella update. Its native token has massively outperformed BTC, resulting in increasing its dominance. Amid the substantial moves in staked ETH, the asset spiked once more hours ago to over $2,130 to chart its latest 11-month high before retracing to just under $2,100 as of now.\n\nBinance Coin, Dogecoin, Solana, and Litecoin have all added somewhere between 3-4% in a day. As a result, BNB trades at $345, DOGE is above $0.9, SOL is at $25, and LTC is inches away from $100.\n\nAvalanche has soared by 6% in a day and over 15% in a week to exceed $20.\n\nThe total crypto market cap has remained at essentially the same spot as yesterday at $1.265 trillion on CMC."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNC8xOC9jYXJkYW5vLWRlZmktZWNvc3lzdGVtLWV4cGxvZGVzLWFzLWV0aGVyZXVtLXJpdmFscy10dmwtZ29lcy11cC0xNzItc2luY2UtbGFzdC15ZWFyLWNyeXB0by1pbnNpZ2h0cy1maXJtL9IBjQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNC8xOC9jYXJkYW5vLWRlZmktZWNvc3lzdGVtLWV4cGxvZGVzLWFzLWV0aGVyZXVtLXJpdmFscy10dmwtZ29lcy11cC0xNzItc2luY2UtbGFzdC15ZWFyLWNyeXB0by1pbnNpZ2h0cy1maXJtL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Cardano DeFi Ecosystem Explodes As Ethereum Rival’s TVL Goes Up 172% Since Last Year: Crypto Insights Firm - The Daily Hodl",
        "content": "New data from crypto insights firm Messari shows the Cardano (ADA) ecosystem’s rapid expansion over the last year.\n\nIn a new report, Messari says that Cardano’s total value locked (TVL), or the amount of assets sitting within its protocols, has gone up 172% quarter over quarter (QoQ).\n\nAccording to Messari, the recent launch of Cardano-stablecoins were the main drivers behind the growth.\n\n“Total value locked (TVL) denominated in USD on Cardano grew 172% QoQ from $50.8 million to $138.3 million. The recent adoption of new stablecoins was a catalyst for this growth, as they are a cornerstone of DeFi but were missing from the ecosystem.”\n\nMessari says that Minswap, an automated market maker (AMM) on Cardano, remains the chain’s leading decentralized exchange (DEX) as far as TVL, but decreased in dominance over the first quarter due to the emergence of several DeFi (decentralized finance) protocols, including ADA-backed stablecoin Djed.\n\n“The shift in dominance from incumbent DEXs to emerging DeFi applications is due to:\n\nDjed, an overcollateralized ADA-backed stablecoin minting protocol, ending Q1 with a TVL of $13.1 million and a dominance of 9.5%.\n\nLiqwid, a borrowing and lending protocol, ending Q1 with a TVL of $8.4 million and a dominance of 6%.\n\nIndigo, an issuer of synthetic assets and stablecoins, ending Q1 with a TVL of $24.1 million and a dominance of 17.4%.”\n\nMessari says that in Q1 of this year, Cardano saw significant progress in technological developments such as advancements in scalability and VM (virtual machine) compatibility.\n\nLast week, Cardano developers Input Output Global announced the launch of Lace, a new Cardano-native crypto wallet that supports hardware wallet integration and access to NFT (non-fungible token) marketplaces, decentralized apps (DApps) and DeFi services. Users can also stake ADA directly from the platform.\n\nThe developers say they are already working on new features that will be added to future releases as they promise to give Lace a slew of regular updates and enhancements.\n\n“The Lace team is already hard at work developing a DApp Store, a desktop app and digital identity solutions. Meanwhile, fiat on/off ramps, in-wallet swaps, a richer staking experience with multi-delegation, and a portfolio view are all in the pipeline.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/VectorBar/Mingirov Yuriy"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vZGFpbHljb2luLmNvbS9nb2toc2h0ZWluLXByZWRpY3RzLWV0aGVyZXVtLWZsaXAtYml0Y29pbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Apr 2023 07:00:00 GMT",
        "title": "Gokhshtein Predicts Ethereum Will Flip Bitcoin. How Likely Is It? - DailyCoin",
        "content": "Entrepreneur David Gokhshtein claims ETH will eventually top BTC.\n\nBitcoin hovers around the $30,000 price range with 5.5% weekly gains.\n\nEthereum broke through $2,100 with 12.5% weekly gains.\n\nCrypto entrepreneur David Gokhshtein revealed to his Twitter audience that he expects Ethereum (ETH) to flip Bitcoin (BTC) some time in the future. Not being threatened by getting roasted by his Bitcoin Maximalist friends, the Half-Baked Hero received some surprising answers from crypto aficionados.\n\n$ETH will eventually flip $BTC. I don’t know for how long, but it will. — David Gokhshtein (@davidgokhshtein) April 16, 2023\n\nCrypto Twitter Does the Math\n\nAs per usual, David Gokhshtein’s bald statements didn’t go unnoticed. “It already did, brother,” asserts Julian Kent, a crypto enthusiast who argues that adding all the ERC-20 tokens in the TOP 50 by global market capitalization does the trick. “It has been surpassed for a while now,” Mr. Kent claims, while another crypto trader Sprack Burger remarks “Already has. Look at all the ERC-20 tokens with good liquidity.”\n\nLet’s look deeper at these claims: the leading digital asset Bitcoin has a global market capitalization of $578,508,586,135. On the other hand, the leading altcoin and NFT favorite blockchain Ethereum sits at $249,842,988,311. Bitcoin’s market dominance is 43.9%, while Ethereum’s is 19%.\n\nOn top of that, the global cryptocurrency market rank has many ERC-20 tokens, which are based on Ethereum, including Shiba Inu (SHIB), Uniswap (UNI), top stablecoins Tether (USDT) and USD Coin (USDC), along with the scaling solutions that come from forked versions of Ethereum’s code, like Polygon (MATIC).\n\nEthereum Kneels Before Bitcoin?\n\nAdding up all of the Ethereum-related altcoin with at least $5 billion, the global market cap of the TOP 20, stopping at decentralized crypto exchange Uniswap (UNI), equals to $402.5bn at the time of publication, which refutes these claims for the time being.\n\nHowever, it’s important to note that popular altcoins with large market capitalization like BNB (BNB), XRP (XRP), and TRX (TRX) have been excluded from the count since these altcoins originally started as ERC-20 tokens but later developed their own blockchains.\n\nUltimately, the swift growth of Ethereum-based tokens is evident in the numbers, but it’s yet to top Bitcoin. The ongoing squabble on Twitter between Ethereum enthusiasts and Bitcoin Maximalists gave birth to many heated discussions and a flurry of sarcastic memes.\n\nBTC and ETH Maxis are fighting it out on Twitter\n\nOn the Flipside\n\nMany crypto enthusiasts in the Twitter thread argue that Bitcoin will remain “the mother of all crypto,” comparing Bitcoin’s long-term value to gold.\n\nMany also argue that “Bitcoin would have to crash big time” for that to happen.\n\nWhy You Should Care\n\nThe two largest digital assets are enjoying solid bull runs, as BTC and ETH both recently achieved yearly highs.\n\nExplore trending crypto stories on DailyCoin:\n\nGokhshtein Shocked: Dogecoin Surges 7.7% After Twitter Move\n\nTestnets in Crypto: How To Use Test Networks to Earn Cryptocurrency"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LnRoZWFydG5ld3NwYXBlci5jb20vMjAyMy8wNC8xNy9oYXJvb24tbWlyemEtbWF0LWNvbGxpc2hhdy1uZnQtcHJvamVjdHMtZXRoZXJldW0tZWNv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Apr 2023 07:00:00 GMT",
        "title": "Haroon Mirza and Mat Collishaw launch NFT projects in the wake of Ethereum's eco-upgrade - Art Newspaper",
        "content": "In circles both artistic and environmental, the very mention of NFTs (non-fungible tokens) often causes lips to curl. These digital units, which use blockchain technology to record the ownership of an artwork (or any other asset), are widely decried as vehicles for financial speculation with little intrinsic artistic value. Then there’s the environmental impact. NFTs are criticised for their heavy carbon footprint, residing as they do on the notoriously power-intensive blockchain and requiring huge amounts of energy to be minted. A 2021 analysis of around 18,000 NFTs by the digital artist Memo Akten found that the average footprint of a single NFT was equivalent to a month’s electricity usage by an average EU resident.\n\nBut now the tide seems to be turning. Many of the biggest NFT marketplaces operate on the Ethereum blockchain, which cut carbon emissions by more than 99% in an upgrade known as “the Merge” in September 2022. The network switched to a different “proof of stake” system that requires only a fraction of energy per transaction compared to the previous “proof of work” system. Other blockchains such as Tezos, Cardano and Kusama also use the “proof of stake” mechanism which looks like it is becoming the norm for minting and trading more energy-efficient NFTs.\n\nStill of Haroon Mirza's Solstice Star NFT Courtesy of the artist and Lisson gallery\n\nWhat’s more, the crypto crash last year has reduced the hype surrounding NFTs and artists are starting to feel less squeamish about exploring the potential of blockchain as a creative space. Case in point is Haroon Mirza, an artist who works with sound, light and electricity to create kinetic sculptures, performances and immersive installations, who launched his first NFT project during his recent show at London’s Lisson Gallery. Solstice Star released the first 200 of 1,000 minted NFTs​​—featuring a GIF of a red-and-white fly agaric mushroom framed by a star of eight rotating solar panels—for free to anyone logging on to solsticestar.xyz and verse.works .\n\n“I was immediately into cryptocurrencies and I’ve always thought that blockchain was an incredible technology that’s going to revolutionise how we do things,” Mirza says. But while intrigued by the initial emergence of NFTs, he was quickly put off by the feeding frenzy around the $69m Beeple sale at Christie’s in March 2021. “It became like a Ponzi scheme within a Ponzi scheme and I didn’t want anything to do with that part of it,” he states. “It just became a way to invest in often dirty crypto and the type of art that went with it just made you want to throw up.”\n\nThe subsidence of speculative interest in NFTs along with the switch to a more sustainable system encouraged Mirza—whose work often revolves around the technological pursuit of energy—to revisit the blockchain. “The Merge has made Ethereum a completely different platform to what it was before,” he says, adding that for him the appeal of NFTs is conceptual rather than aesthetic.\n\n“Nothing about the NFT interests me other than the fact that the artwork is also the certificate and completely transparent, with everything inherent in the work itself,” he states. “NFTs are completely decentralised—I like the idea of an artwork being a non-hierarchical community that can engage with itself in a productive way. It’s like having an artwork that is inherently collaborative: it’s what I do in my work anyway, and that’s the thing that really excites me.”\n\nFor Mirza, Solstice Star is simply “a first step, an entry point” into a larger interactive project that will unfold over time. The next iteration will incorporate sound, a key part of his practice. All the owners of Solstice Star NFTs will be invited to select a frequency within the human hearing range of 20 Hz to 20,000 Hz, which will then be used by the artist to create a new sound work.\n\n“The potential is that you can evolve a project that has a feedback loop with the people that are collecting it,” the artist says. “It’s a living thing, a live project that can grow and develop into a non-hierarchical network.” Down the line, the project also promises to reap environmental benefits, with Mirza aiming to put in place a smart contract that will direct some of the proceeds towards research into renewable energies.\n\nThe communal, participatory aspect of NFTs is also a major draw for Mat Collishaw who, like Mirza, is making his first foray into the field. “I’m always looking for new media and if there is a new form for making an artwork, with a new vocabulary attached to it, then I want to be in there,” says Collishaw. In the past the artist has used VR, animatronics and CGI as well as oil paint, mosaic, and blown glass to make stunning and sometimes shocking artworks that explore ideas around death, decay and the darker side of human nature.\n\nThe \"greenhouse\", part of Mat Collishaw's Heterosis NFT project Courtesy of the artist\n\nDrawing parallels between the craze for NFTs and 17th-century “tulip mania”, when entire fortunes were made and lost speculating on tulip bulbs in the Netherlands, Collishaw created Heterosis , an NFT project which allows users to cultivate bespoke animated digital flowers. Each one of these unique NFT blooms combines computer algorithms with floral genetic coding, thus enabling collectors to collaborate with one another on new hybrid species. The result is an infinite range of ever more exotic and elaborate creations. Collectors can manipulate their specimens just for pleasure or for the financial rewards of reselling them—or both.\n\n“It’s absolutely down to the collectors what they do,” Collishaw says. “The first iteration of the flower is fairly simple and the colours are pretty straightforward. They can get a lot more elaborate… we wanted to give people the incentive to breed.” To spice things up, the artist has introduced a number of recessive genes that will throw up new characteristics impossible to control or predict. “There are several secret species that will be unlocked when certain breeding patterns are done,” he declares. How these surprise features will affect a flower’s resale value remains to be seen.\n\nSince they were released on the OpenSea NFT platform last month, all 2,500 of these infinitely mutate-able blooms have been snapped up at the initial cost of around £120 each in cryptocurrency. Collishaw is pleased that collectors have already begun to interact with each other to hybridise their flowers. Apparently some are even making additional revenue by setting competitive prices for anyone wanting to breed from theirs. The more sought-after the individual flower, the higher the price.\n\nThe \"greenhouse\", part of Mat Collishaw's Heterosis NFT project Courtesy of the artist\n\nThese hybridising transactions take place in a centralised digital space called “the Greenhouse” where collectors can adopt an avatar, contact other participants and view all the Heterosis flowers growing in their most recent state. Here all the properties of a specimen can be assessed, including its market value. In keeping with Collishaw’s track record of finding beauty in entropy, this interactive environment simulates the form of London’s National Gallery if it were abandoned to decay. The flowers are set against a backdrop of mildewed Old Master paintings, while vegetation sprouts from the floor and the ceilings play host to a mass of dangling vines.\n\nViewing this ghostly setting where the great works of art history are reclaimed by nature, and where nature also co-exists with manipulated digital blooms, raises all manner of questions around value, beauty, desirability, natural and artificial selection. “It’s quite shocking to me that you’ve got the cream of 400 years of European art but nobody is looking because the only organic life is plant life,” the artist observes.\n\nCollishaw also draws analogies between the traditional role of the National Gallery as a networking hub “where citizens could gather and share intelligence” and the circulation of knowledge around natural science, art and commerce exchanged amongst the tulip merchants and speculators in 17th-century Holland. These ideas around informational networks come full circle with the way in which Heterosis encourages its collectors to form an online community to trade data pertaining to their holdings as they bring the project to its full fruition.\n\nGiven the botanical theme of the project and its multifaceted exploration of how humankind has shaped the natural world for financial gain, it was especially important for Collishaw to wait for the “proof of stake” blockchain system to be in place before any NFT drop. “I was keeping a close eye on the situation,” he confirms, adding that he is also glad that the intrinsic immateriality of NFTs avoids the shipping, storage and other energy-hungry requirements of analogue art.\n\nThe fact that minting NFTs is no longer an environmental hazard has enabled both Collishaw and Mirza, in their very distinct but also overlapping ways, to demonstrate the rich and inclusive potential of the non-fungible token as an interactive artistic endeavour. Never mind that neither artist has yet made much money from their sortie into NFTs—profits were never the point.\n\nAs Collishaw puts it, “In making an NFT I created an artwork that exists in a way not possible in any other context. Its value has been as an experiment, and a very interesting one. I’ve learnt a lot doing it—but I could have earned more by cleaning windows.”\n\nHowever things play out in the crypto market, it looks as if NFT art is very much here to stay in its new, greener form.\n\n• Haroon Mirza: Solstice Star\n\n• Mat Collishaw: Heterosis\n\n• Mat Collishaw will have a solo exhibition, All Things Fall, at the Bomb Factory Art Foundation, London, 20 April-21 May"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGgtc3Rha2luZy1wYXNzZXMtd2l0aGRyYXdhbHMtZm9yLXRoZS1maXJzdC10aW1lLWFmdGVyLXNoYXBlbGxhLXVwZ3JhZGXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "ETH staking passes withdrawals for the first time since Shapella upgrade - Cointelegraph",
        "content": "The Ethereum blockchain underwent a successful Shapella upgrade on April 12, allowing validators to withdraw their staked Ether (ETH) from the Beacon Chain after three years. After seeing over 1 million ETH in withdrawals in the first week, the amount of staked ETH has now surpassed the number of ETH being withdrawn for the first time since the Shapella upgrade.\n\nData from the on-chain analytics firm Nansen suggests that more ETH is currently being staked than withdrawn. As of April 17, the ETH staking volume of 124,000 ETH exceeded the withdrawal volume of 64,800 ETH for the first time. In the last 24 hours, the amount of staked ETH was 94,968 against 27,076 in withdrawals. The first round was primarily partial withdrawals from Lido and old validators. It takes approximately three days to get into the withdrawal queue.\n\nVolume of staked ETH vs withdrawals. Source: Nansen\n\nThe Shapella upgrade was projected as a make-or-break situation for the Ethereum blockchain as millions in unlocked ETH posed a risk of mass selling. However, the majority of the validators are restaking their unlocked Ether. Crypto exchange Binance will open withdrawals on April 19.\n\nRelated: Ethereum price metrics hint that ETH might not sell off after the Shapella hard fork\n\nOut of the 1 million withdrawn ETH, three addresses restaked a total of 19,844 ETH. Three addresses transferred ETH to centralized exchanges (CEXs) after withdrawal, with 71,444 ETH sent to different exchanges. Other whales did the same, with some sending it to Huobi staking addresses and a few others to CEXs, according to data shared by Lookonchain.\n\nMost early withdrawals are staking rewards, and a few validators, like Kraken, had to exit to comply with a United States Securities and Exchange Commission ruling. Currently, 22,231 validators have signed up for a complete exit out of 574,624, while 910,930 ETH of the 18.6 million staked ETH is slated to be withdrawn.\n\nAnother prominent reason for the diminishing withdrawals could be ETH’s price, as the average price of staked ETH is about $2,137.\n\nMagazine: 2023 is a make-or-break year for blockchain gaming: Play-to-own"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2V0aGVyZXVtLXByaWNlLXB1bXBzLTEwLWJ1dC10YW1hZG9nZS1pcy1zZXQtdG8tcmlzZS0yMDAtYWZ0ZXItYS1uZXctZXhjaGFuZ2UtbGlzdGluZy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Ethereum price pumps 10%, but Tamadoge is set to rise 200% after a new exchange listing! - Analytics Insight",
        "content": "The long-awaited Ethereum’s Shanghai update finally happened. The final step of Ethereum’s transition from proof of work to proof of stake pushed Ethereum’s price up by $2,000.\n\nThis is the first time Ethereum’s price has pumped this much in eight months, reaching the highest level since March 2022. Now, Ethereum price predictions say this second-largest crypto could reach a maximum of $3,380.14 this year.\n\nWhether or not these real increases will happen is yet to be seen, but experts agree this price pump will affect other Ethereum-based cryptos too.\n\nIn particular, Tamadoge, as one of the well-known Ethereum-based cryptos, could face exponential growth.\n\nExperts think this meme crypto could even outperform Ethereum and become one of the best cryptos to invest in this year. Moreover, the project is on a fast track to dethroning Shiba Inu and Dogecoin as the most successful meme coin, thanks to its cutting-edge technology and powerful tokenomics.\n\nHere is a short overview of everything happening in the Tamadoge universe lately. Also, we will name a few reasons why you should choose Tamadoge over other meme coins and Ethereum-based projects.\n\n>>>Buy Tamadoge Now<<<\n\nTamadoge to rise 200% after a new exchange listing\n\nTamadoge will list on a top 5 crypto exchange on April 27th, the Tamadoge team announced. Tamadoge will confirm the name of the exchange on April 24th, a few days before the listing.\n\nThe announcement will set the Tamadoge’s price to a bullish movement. Crypto experts believe this new listing will push TAMA’s price above $0.0133.\n\nThis listing would make this meme project available to millions of new investors worldwide. TAMA’s price could break the $0.22 level and jump by over 120%, looking mid-term.\n\n>>>Buy Tamadoge Now<<<\n\nPotential new high on the horizon\n\nZooming in on TAMA’s long-term price, there are three potential price targets: $0.0225 (66% gain), $0.034 (156% gain), and $0.042 (234% gain).\n\nTamadoge had the first price pump after the OKX listing. Then, TAMA’s price hit an all-time high of $0.196. But since then, Tamadoge has established itself as the best P2E platform.\n\nThis leads to price sustainability and new price pumps, especially after the positive news about the project.\n\nThe listing on the top-tier exchange is just the first step in the process of making Tamadoge the meme coin of the future. The exchange listing, combined with investors’ loyalty to the project and positive project fundamentals, can take TAMA to a new price high.\n\n>>>Buy Tamadoge Now<<<\n\n22k users are enjoying Tamadoge P2E Arcade\n\nTamadoge recently released Play 2 Earn Arcade with five games players can access to earn rewards:\n\nRocket Doge – A game in which you navigate your Tamadoge through obstacles using rockets.\n\nSuper Doge – Your Tamadoge pets must collect in-game coins while battling enemies.\n\nTo the Moon – You must take your Tamadoge to the moon or new heights.\n\nTamadoge Run – Set in the graveyard, Tamadoge pet must fight ghosts and doge devils.\n\nTama Blast – Your Tamadoge must score as many goals as possible\n\nAs of April 13th, 22k users played on the Tamadoge Arcade and spent over 84,000 credits in the ecosystem.\n\n>>>Buy Tamadoge Now<<<\n\nWhat makes Tamadoge a terrific investment option?\n\nTamadoge is the first meme coin with utility that provides real value for users.\n\nThis is the token of the future. Tamadoge builds on the success of Doge and uses the tried and tested principles that allow you to breed your pet.\n\nTamadoge is the NFT pioneer. The project uses the latest NFT technology, helping you to inject life into Tamadoge pets.\n\nThe system is structured to create demand.\n\nTamadoge is designed to have a large user base because it is created for non-P2E gamers, too.\n\n>>>Buy Tamadoge Now<<<\n\nWhy should you invest in Tamadoge?\n\nYou get the token that will increase its value. The newest exchange listing will pump TAMA’s price by 200%, increasing its price on other exchanges.\n\nYou get the token with utility. Meme coins with utility are the only ones to survive the changing crypto market, and Tamadoge will overthrow Shiba Inu and Dogecoin.\n\nYou don’t have any transaction costs on your purchase.\n\nYou earn great rewards while playing fun games and showing your skills.\n\nYou invest in the token of the future.\n\n>>>Buy Tamadoge Now<<<\n\nFinal thoughts\n\nNow is the best time to buy Tamadoge and enjoy great rewards. Different exchanges listed TAMA, from OKX to LBANK, Uniswap, MEXC, and BKEX.\n\nThe tremendous potential of Tamadoge has attracted numerous investors who are enjoying many benefits the project offers. Join them now and get the token of the future!\n\n>>>Buy Tamadoge Now<<<\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNC8xOC90b3AtZXRoZXJldW0tYWx0Y29pbi1leHBsb2Rlcy00Ny1pbi1vbmUtd2Vlay1hcy13aGFsZXMtc2VuZC1taWxsaW9ucy1vZi10b2tlbnMtdG8tY3J5cHRvLWV4Y2hhbmdlL9IBhwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNC8xOC90b3AtZXRoZXJldW0tYWx0Y29pbi1leHBsb2Rlcy00Ny1pbi1vbmUtd2Vlay1hcy13aGFsZXMtc2VuZC1taWxsaW9ucy1vZi10b2tlbnMtdG8tY3J5cHRvLWV4Y2hhbmdlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Top Ethereum Altcoin Explodes 47% in One Week As Whales Send Millions of Tokens to Crypto Exchange - The Daily Hodl",
        "content": "A couple of crypto whales unloaded millions of Arbitrum (ARB) after the popular Ethereum (ETH) scaling solution witnessed significant gains this week.\n\nBlockchain tracker Lookonchain notes that the largest buyer of Arbitrum on its first day of listing back in March transferred a large stack of nearly 10,000 ARB, worth about $17 million, to top crypto exchange Binance a few days ago.\n\nA separate ARB whale also transferred its entire Arbitrum bag, worth $18 million, to Binance on Friday, according to Lookonchain.\n\n“The whale with 11 million ARB ($18 million) transferred all ARB to Binance…\n\nThe buying cost was $13.55 million and the average buying price was ~$1.24.\n\nIf he sells at $1.64, he will make a profit of $4.54 million, an ROI (return on investment) of 33%.”\n\nThe 33rd-ranked crypto asset by market cap rallied from a seven-day low of $1.16 to a high of $1.71, marking gains of over 47%. ARB has slightly given up some of its gains and is trading for $1.63 at time of writing.\n\nArbitrum currently ranks fourth among all chains in terms of total value locked (TVL) with $2.27 billion, behind Ethereum, Tron (TRX) and BNB Smart Chain, according to the decentralized finance tracker DeFi Llama.\n\nThe TVL of a blockchain represents the total capital held within its smart contracts. The metric is calculated by multiplying the amount of collateral locked into the network by the current value of the assets.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vdW5jaGFpbmVkY3J5cHRvLmNvbS93aHktbWV2LXdpbGwtYWx3YXlzLWJlLWNvbnRyb3ZlcnNpYWwv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Why MEV Will Always Be Controversial - Unchained - Unchained",
        "content": "Episode 482\n\nMaximal extractable value, or MEV, is a mainstay of the Ethereum landscape. But the process of validators reaping profits from handling new blocks is not without controversy. Ethereum Foundation researcher Justin Drake and bloXroute Labs CEO Uri Klarman assess the current state of MEV. Hear them disagree about the path forward for making Ethereum fairer for all its economic actors.\n\nListen to the episode on Apple Podcasts, Spotify, Overcast, Podcast Addict, Pocket Casts, Stitcher, Castbox, Google Podcasts, TuneIn, Amazon Music, or on your favorite podcast platform.\n\nShow highlights:\n\nwhat MEV is and how it has evolved over time\n\nthe nuances of the newly proposed MEV Blocker and why it’s important for users\n\nwhether it’s possible to enable “back-running” while preventing front-running\n\nhow to give power back to blockchain users\n\nwhat the differences and similarities are among several projects trying to solve MEV\n\nhow “MEV Burn” will be like the EIP-1559 to what Justin calls contention\n\nwhether EigenLayer can help solve MEV problems\n\nwhether wallets and DEXs could be doing something different to prevent MEV and generate more revenue\n\nhow “exclusive order flow” could be detrimental to DeFi users\n\nwhat proposer-builder separation (PBS) is and whether it will change MEV distribution\n\nwhy Uri doesn’t think PBS is the right step forward for Ethereum\n\nThank you to our sponsors!\n\nGuests:\n\nJustin Drake, researcher at the Ethereum Foundation\n\nUri Klarman, CEO of bloXroute Labs\n\nLinks\n\nMEV Blocker\n\nMEV Distribution\n\nMEV Smoothing\n\nMEV Burn\n\nProposer-Builder separation"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlci1oaXRzLTExLW1vbnRoLWhpZ2gtYXMtcG9zdC1zaGFwZWxsYS13aXRoZHJhd2Fscy1wYXNzLTFtLWV0aNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Apr 2023 07:00:00 GMT",
        "title": "Ether hits 11-month high as post-Shapella withdrawals pass 1M ETH - Cointelegraph",
        "content": "Over 1 million Ether (ETH) worth $2.1 billion has now been withdrawn from Ethereum’s Beacon Chain within the first four days of the Shapella hard fork and Ether has pushed over $2,100 for the first time in 11 months.\n\nThe 1.03 million ETH withdrawals have come from 473,7000 withdrawal requests, with Saturday, April 15 the largest withdrawal day at 392,800 ETH, according to data from beaconcha.in.\n\nOf the active validators, nearly 87% or 469,000 of the 540,000 are now able to withdraw their staked Ether.\n\nApril 15 to 16 saw the largest Ether withdrawals processed so far, with 392,800 and 280,400 Ether withdrawn, respectively. Source: beaconcha.in\n\nWhile members of the Ethereum community were split on what impact Shapella would have on the price of Ether, the first four days have produced close to a 10% rise.\n\nETH has increased about 9% since the Shapella upgrade took effect late on April 12. Source: CoinGecko\n\nThe figures are of little “surprise” to Lachlan Feeney, chief executive of blockchain consulting and development firm Labrys, who told Cointelegraph that many validators are re-staking Ether back onto the Beacon Chain:\n\n“Much of the stake that has been withdrawn over the last few days is actually going straight back into The Beacon Chain as validators are looking to compound their interest. So much so that net stake is currently increasing.”\n\nGiven the current macroeconomic climate, Feeney said that many early stakers wanted to liquidate after what has been nearly a 30-month wait for some.\n\nOver the mid to long-term, Feeney believes the Shapella hard fork will only increase the amount of Ether staked, which of course will only strengthen Ethereum at the consensus level:\n\n“Because Shapella is a massive de-risking event, over the medium to long-term more, not less, ETH will be staked. We anticipate that in the not too distant future, we will reach a record high of Ether being staked.”\n\nMarkus Thielen, the head of research at digital asset platform Matrixport, told Cointelegraph that the closure of crypto exchange Kraken’s staking services may have contributed to the higher figures:\n\n“It appears largely due to the Kraken's staking business being unwound. This will only have a temporary effect as we are also seeing a significant demand from investors who now are able to stake with more visibility on the liquidity of staked positions.”\n\nThielen said he expects a large amount of un-staked Ether from Kraken to be “recycled” back into the Beacon Chain through other entities.\n\nWhile Thielen anticipates the positive price action to cool off this week amid increased selling pressure, he thinks Shapella will ultimately attract more institutional investors to stake on Ethereum.\n\nRelated: 4 strategies for staking Ethereum\n\nThe 1 million milestone is a 500% increase from an April 11 prediction by blockchain intelligence firm Glassnode, which estimated only 170,000 Ether would be un-staked after the first week of Shapella.\n\nOn-chain analytics firm Nansen slightly overshot the mark, predicting 1.4 million Ether would be withdrawn after the first few days of Shapella.\n\nMagazine: ‘Account abstraction’ supercharges Ethereum wallets: Dummies guide"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMikwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9hLXNtYWxsLWNoYW5nZS1vZi1jb2RlLWEtZ2lhbnQtbGVhcC1mb3Itd2ViMy1ldGhlcmV1bXMtc2hhcGVsbGEtdXBncmFkZS9hcnRpY2xlc2hvdy85OTU4MTE0NS5jbXPSAZcBaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvYS1zbWFsbC1jaGFuZ2Utb2YtY29kZS1hLWdpYW50LWxlYXAtZm9yLXdlYjMtZXRoZXJldW1zLXNoYXBlbGxhLXVwZ3JhZGUvYW1wX2FydGljbGVzaG93Lzk5NTgxMTQ1LmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "A small change of code, a giant leap for Web3: Ethereum's Shapella upgrade - The Economic Times",
        "content": "(What's moving Sensex and Nifty Track latest market news stock tips and expert advice , on ETMarkets . Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .)\n\nDownload The Economic Times News App to get Daily Market Updates & Live Business News.\n\nSubscribe to The Economic Times Prime and read the Economic Times ePaper Online.and Sensex Today.\n\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vY3J5cHRvY3VycmVuY2llcy10by13YXRjaC13ZWVrLW9mLWFwcmlsLTE3LTc0ODEzNzHSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Apr 2023 07:00:00 GMT",
        "title": "Cryptocurrencies To Watch: Week of April 17 - Investopedia",
        "content": "Keep an Eye on These Coins\n\nNothing is certain in the cryptocurrency market, but the prices of most major assets have been maintaining their positions above important support levels in recent weeks. Next, traders will watch whether these tokens can break above their resistance levels, which seems possible for some.\n\nThis week, we examine WOO Network (WOO), Render Token (RNDR), Arbitrum (ARB), Rocket Pool (RPL), and Solana (SOL). In selecting these assets, we have considered several factors, including positive technical developments, significant news events, and noticeable changes in price.\n\n\n\nKey Takeaways WOO Network (WOO)'s price increased by 53%, possibly because of the shift toward decentralized exchanges (DEXs), like the one it offers, after the collapse of FTX in late 2022.\n\nRender Token (RNDR) jumped by 47%, perhaps because of the project's migration to the Solana network.\n\nproject's migration to the Solana network. Ethereum scaling solution Arbitrum (ARB) posted a 38% increase in price, amid accumulation by big holders, or \"whales,\" and a gain in market share taken from scaling solution Optimism.\n\nRocket Pool (RPL) went up by about 32%, likely because of Ethereum’s successful Shapella upgrade.\n\nSolana (SOL) gained more than 25% after the announcement of the launch date of the Solana Android mobile phone.\n\n\n\nWOO Network (WOO)\n\nWOO Network (WOO) was this week’s biggest gainer, rallying by 53%. This was likely due to two major trends: traders generally moving toward DEXs like the one offered by WOO Network following the collapse of FTX, which was a centralized exchange, and an increase in the use of WOO Network's protocol. Its team last week reported a substantial increase in the number of active users.\n\nWOO Network is a crypto trading platform that offers both centralized and decentralized trading options. It also provides deep liquidity and tools and analytics dashboards for traders. WOO is trading at around 31 cents and was priced at about 21 cents last week (see chart below).\n\n\n\nWOO Price: TradingView\n\nRender Token (RNDR)\n\nRender Token (RNDR) was the next biggest gainer for the week, increasing by 47%, most likely because of a migration to the Solana network. Render Token experienced significant developments during 2022, and the Solana migration adds to an ongoing increase at the start of the second quarter of 2023.\n\nRender Token provides a decentralized GPU rendering system that allows broader access to complex rendering processes. The project has utility in such industries as media, gaming, virtual reality, and medicine. RNDR is currently priced at around $1.92 and was $1.30 last week (see chart below).\n\n\n\nRNDR Price: TradingView\n\nArbitrum (ARB)\n\nEthereum scaling solution Arbitrum (ARB) also recorded a substantial increase in price, going up by 38%, possibly because of accumulation by Arbitrum whales and increased market share. Whales—an industry term for large holders of tokens—bought large amounts of ARB over the latest week. Arbitrum also experienced better performance across the board than Optimism, another scaling solution, and gained some of Optimism's market share, according to crypto research firm Messari.\n\nArbitrum is a Layer-2 scaling solution for Ethereum that provides better performance for users. Layer-2 networks sit on top of the first network, leading to cheaper and faster transactions. Arbitrum is changing hands at around $1.63 and was trading at $1.18 last week (see chart below).\n\n\n\nARB Price: TradingView\n\nRocket Pool (RPL)\n\nEthereum staking solution Rocket Pool (RPL)'s token price advanced by more than 32%, possibly because of the success of Ethereum's Shapella upgrade. This upgrade to the Ethereum network The Shapella upgrade combines changes to its execution layer (via the Shanghai upgrade), consensus layer (Capella), and the Engine API. The changes allow users to unstake their ETH from the network.\n\nRocket Pool is a staking solution for Ethereum and has grown in popularity over the past year. It provides easier access to Ethereum staking, as it circumvents the need to hold 32 ETH to participate in the staking process. RPL is priced at around $58.50, rising from about $45.40 last week (see chart below).\n\n\n\nRPL Price: TradingView\n\nSolana (SOL)\n\nSolana (SOL) rose by more than 25% after its team disclosed the launch date for the Solana Android mobile phone. The phones have been highly anticipated since being announced in the middle of 2022.\n\nThe phones will sell for about $1,000, and new-order registrations will begin on May 8. Pre-orders will begin shipping on April 20. SOL is trading at around $25.20; it was priced at around $20.30 last week (see chart below).\n\n\n\nSOL Price: TradingView\n\nAs of the date this article was written, the author does not own any of the assets discussed here.\n\nThe comments, opinions, and analyses expressed on Investopedia are for informational purposes online. Read our warranty and liability disclaimer for more info."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3Mvc2VjLWNoYWlyLWdhcnktZ2Vuc2xlci1yZWZ1c2VzLXRvLWFuc3dlci1pZi1ldGhlcmV1bS1ldGgtaXMtYS1zZWN1cml0eS1kdXJpbmctY29uZ3Jlc3Npb25hbC1oZWFyaW5n0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "SEC Chair Gary Gensler Refuses to Answer if Ethereum (ETH) is a Security During Congressional Hearing - Watcher Guru",
        "content": "While testifying before Congress today, SEC Chair Gary Gensler refused to answer if Ethereum (ETH) was a commodity or a security. Moreover, the hearing before the House Financial Services Committee regarded potential SEC oversight in regulatory action taken against the digital asset industry.\n\nWithin his pre-hearing testimony, Gensler restated his opinion that crypto assets are compatible with existing securities laws. Conversely, Gensler refused to offer a straight answer to questions on the security status of Ethereum.\n\nJUST IN: 🇺🇸 SEC Chair Gensler refuses to answer if Ethereum $ETH is a commodity or a security while testifying before congress. pic.twitter.com/IkDTgNrfix — Watcher.Guru (@WatcherGuru) April 18, 2023\n\nGensler Confronted on Crypto Security Claim\n\nThe chairman of the US Securities and Exchange Commission was called before Congress today. Specifically, the hearing was centered around action taken by the regulator regarding the digital asset industry.\n\nWithin that hearing, SEC Chair Gary Gensler refused to say if Ethereum (ETH) is a commodity or a security. Indeed, Gensler faced questions from House Committee Chairman Patrick McHenry. Subsequently, in answering the question regarding this, Gensler replied, “It depends on the facts of the law.”\n\nSource: Pensions & Investments\n\nAmidst the hearing, Chairman McHenry noted that the SEC took 50 different enforcement actions against the digital asset industry. Furthermore, they did so without laying out clear rules of operation for stakeholders.\n\nSpecifically, McHerny stated, “Punishing crypto market companies when not clearly mentioning rules as to how they should comply is not ideal. Regulation by enforcement is not sustainable. Moreover, Republican lawmakers opposed Gensler’s approach to crypto regulation in a new letter arriving ahead of today’s testimony."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy91cy1ob3VzZS1jb21taXR0ZWUtY2hhaXItcmVwZWF0ZWRseS1wcmVzc2VzLXNlYy1jaGFpci1pcy1ldGhlci1hLWNvbW1vZGl0eS1vci1hLXNlY3VyaXR50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Gary Gensler refuses to answer if ETH is a security: SEC hearing - Cointelegraph",
        "content": "Patrick McHenry, chair of the United States House Financial Services Committee, jumped right into criticism of the Securities and Exchange Commission and its leadership over digital assets at an oversight hearing.\n\nIn an April 18 hearing on oversight of the SEC, Representative McHenry used his opening statement to bring up the commission’s “punishing” of digital asset firms through regulation by enforcement without a clear path to compliance. The member of Congress reiterated calls for U.S. lawmakers to provide “clear rules of the road” for crypto through legislation. In addition, he pressed SEC Chair Gary Gensler to give a definitive answer on whether Ether (ETH) qualified as a security under the SEC’s purview or a commodity under the Commodity Future Trading Commission’s.\n\nMcHenry repeatedly talked over Gensler’s responses that did not include specifics, citing the SEC chair’s willingness to label Bitcoin (BTC) as a commodity and hinting at private discussions on ETH prior to the hearing.\n\nGary Gensler and Representative McHenry arguing on whether $ETH is a commodity or a security, with Gensler unable to answer the question pic.twitter.com/DTMtazYmuS — Cointelegraph (@Cointelegraph) April 19, 2023\n\n“Clearly an asset cannot be both a commodity and a security,” said McHenry. “I’m asking you, sitting in your chair now, to make an assessment under the laws as exist, is Ether a commodity or a security?”\n\nHe added:\n\n“You have pre-judged on this: You’ve taken 50 enforcement actions. We’re finding out as we go, as you file suit, as people get Wells notices, on what is a security in your view, in your agency’s view.”\n\n.@GaryGensler's tenure has been defined by recklessness. His agenda runs roughshod over process, precedent, & the #SEC’s statutory authority. I look forward to speaking with him today.\n\n\n\nTune in at 10:00am https://t.co/qNdJ4wDkw5 — Patrick McHenry (@PatrickMcHenry) April 18, 2023\n\nRepresentative Maxine Waters, ranking member of the House committee, did not press Gensler on ETH but focused her questioning on the SEC’s enforcement capabilities. According to the SEC chair, the commission had the means, the authority and the will to bring crypto firms into regulatory compliance.\n\nMany in and out of the crypto space have criticized the SEC under Gensler for taking enforcement actions against firms involved with digital assets and blockchain technology. On April 17, the SEC charged crypto asset trading platform Bittrex and its co-founder William Shihara for offering unregistered securities, and a Wells notice issued to Coinbase in March suggests the major exchange could be next.\n\nGensler claimed the crypto market was “rife with noncompliance”, in many cases firms willfully doing so. His written testimony said compliance with the SEC extended to decentralized finance platforms — an indication of the commission proposing changing its rules to include DeFi in exchanges under its purview.\n\nRelated: Video of SEC chair praising Algorand resurfaces after recently deeming it a security\n\nThe April 18 hearing was the first time Gensler had directly addressed the House committee since October 2021 — prior to the collapse of FTX, Celsius, BlockFi and crypto-friendly banks including Signature, Silicon Valley Bank and Silvergate. The Financial Services Committee will also meet to discuss stablecoin regulation in an April 19 hearing.\n\nMagazine: Crypto regulation: Does SEC Chair Gary Gensler have the final say?"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiJWh0dHBzOi8vdGhlZGVmaWFudC5pby9tZW1lY29pbi1zZWFzb27SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "PEPE Rallies 500x As Investors Pile Into New Wave Of Memecoins - The Defiant - DeFi News",
        "content": "Single MEV Bot Accounts For 7% Of Daily Ethereum Gas Usage\n\nBy: Owen Fernau • Loading...\n\nCrypto News\n\nMemecoins are pumping like it’s 2021.\n\nPEPE, a new Ethereum-based token named after the cartoon character turned memetic icon Pepe the Frog, has ascended to a market capitalization of $86M in less than five days, making it the sixth-most valuable memecoin, going by a list from CoinGecko.\n\nPepe the Frog\n\nThe PEPE rally has spurred enterprising developers to spin up tangential projects — WOJAK, named after another popular memetic character, launched on April 17 and has already jumped to a $10M market capitalization in just over a day.\n\nWojak, also known as Feels Guy\n\nSpeculators who caught these tokens early are sitting on astronomical profits reminiscent of 2021’s dog coin mania, when DOGE and SHIB rallied to their all-time highs.\n\n‘Double-edged Sword’\n\nRyan Watkins, the co-founder at Syncracy Capital, a crypto-focused hedge fund, thinks memecoins’ success has a mixed effect on the digital asset space. “It’s a double-edged sword,” he told The Defiant over Telegram. “On one hand, memecoins make crypto more fun and accessible. On the other, they reaffirm many skeptics’ criticisms that the industry’s only use case is gambling.”\n\nIndeed, many in the crypto community find memecoins fun, all the more so when they are making money. The Pepe and Wojak characters pop up daily in crypto Discord and Telegram channels, imbuing tokens associated with them with added allure to the blockchain-savvy.\n\nDeFi Alpha Premium Content DeFi Daily | Weekdays\n\nDeFi Alpha Letter | Weekly\n\nDefiant Podcast Transcript | Weekly\n\nInbox Dump | Saturday\n\nWeekly Recap | Sunday Looking for Alpha? Become a premium member of The Defiant and join our DeFi Alpha community. Start for free\n\nConversely, to crypto-outsiders, it’s difficult to discern any real difference between DOGE and PEPE. They’re both tokens with questionable utility — it’s easy to write off investing time and effort into hot potato games as the most wasteful aspects of the crypto industry.\n\nRegardless of whether the new memecoins’ success is good for crypto as a whole, they’ve certainly caught investors’ attention, with a new token dropping seemingly every few hours.\n\nZ, a well-known pseudonymous trader who has been posting seemingly non-stop about PEPE over the past three days, told The Defiant they first bought the token when it had a $30,000 market capitalization. At the token’s current market capitalization of over $80M — the trader’s PEPE is worth over 2000 times what they paid for it.\n\n“The PEPE pump is ringing the bell and waking everyone up to speculate,” Z said. “Seeing the memes that have always been around us and that we see daily become the top memecoins feels healing, cleansing.” The trader said they first heard about PEPE through a private Twitter group.\n\n‘Dogs Have Had Their Day’\n\nThe creators of the website for PEPE, who didn’t immediately respond to a request for comment from The Defiant, are looking to take on canine-themed tokens like DOGE and SHIB, which have dominated the memecoin space. “The dogs have had their day,” the PEPE site reads. “It’s time for Pepe to take reign.”\n\nSome entrepreneurs haven’t gotten the notice that dog coins are done for — AIDOGE, which launched on April 10 on Layer 2 network Arbitrum as a free claim for ARB airdrop recipients, has already hit a $35M market capitalization as of April 18.\n\nEthereum Gas Spikes\n\nThe action around memecoins is starting to affect other users of the Ethereum blockchain. Gas fees, the amount of ETH it costs to make a transaction, spiked to their second-highest level in the last six months, according to a dashboard by pseudonymous analyst Hildobby.\n\nEthereum Median Gas Price\n\nThis means Ethereum users are paying over $30 to trade a token on a decentralized exchange like Uniswap or Balancer.\n\nMEV Bot Dominates Ethereum Gas Usage\n\nAccording to information provider SeaLaunch, one entity using the Ethereum domain jaredfromsubway.eth, is running an MEV bot responsible for using 7% of the gas on Ethereum at one point. MEV bots profit by inserting orders ahead and behind unsuspecting traders, resulting in worse execution prices for users\n\nJaredfromsubway.eth was still the top gas consumer as of 10pm ET on April 18.\n\nTop Gas Consumers. Source: Etherscan\n\nTo be sure, it’s not only general Ethereum users who bear the cost of memecoin season. The hype-laden world of memecoins comes with its ups and downs. BONK, a token on the Solana blockchain, was red hot in January but is now down nearly 80% from its peak.\n\nUnproven Meme Value\n\nAnd the idea of a token’s value actually being tied to a meme’s usage is unproven.\n\nPunk6529, a pseudonymous influencer, developed an NFT project geared around owning memes. After peaking in mid-January with a 59,000 ETH market capitalization, The Memes, as the project is called, have dropped nearly 75% to roughly 15,000 ETH, according to data provider NFTGo.\n\nStill, for some avid traders, memecoins provide the spark to get them through the bear market. Or maybe it provides some hope that the bear market may truly be ending.\n\nIn the long run, Syncracy’s Watkins doesn’t think the memecoin phenomenon does too much harm. “It does get tiring after a while, but speculation attracts capital to the industry necessary to fund new and interesting projects,” he said. “I don’t think memecoins are meaningfully stealing energy from ‘real’ projects.”"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMilAFodHRwczovL3d3dy5idXNpbmVzcy1zdGFuZGFyZC5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9leHBsYWluZWQtYWxsLXlvdS1uZWVkLXRvLWtub3ctYWJvdXQtZXRoZXJldW0tcy1sYXRlc3QtdXBncmFkZS1zaGFwZWxsYS0xMjMwNDE4MDA2NTlfMS5odG1s0gGYAWh0dHBzOi8vd3d3LmJ1c2luZXNzLXN0YW5kYXJkLmNvbS9hbXAvbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9leHBsYWluZWQtYWxsLXlvdS1uZWVkLXRvLWtub3ctYWJvdXQtZXRoZXJldW0tcy1sYXRlc3QtdXBncmFkZS1zaGFwZWxsYS0xMjMwNDE4MDA2NTlfMS5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Explained: All you need to know about Ethereum's latest Shapella upgrade - Business Standard",
        "content": "Last week, the developers of Ethereum announced that they have completed an upgrade called \"Shapella\". Called the final milestone in Ethereum's multi-year transition from Proof-of-Work (PoW) to Proof-of-Stake (PoS) consensus, it will make earlier staked Ethereum more liquid.\n\nWhat is \"Shapella\"?\n\nThe term \"Shapella\" is derived from the words \"Shanghai\" and \"Capella\". These are two of five Ethereum Improvement Proposals (EIPs) that will be upgraded in the process. The upgrade will change the way Ethereum works. EIP-2565, EIP-2929, and EIP-2718 are the other protocols which will be upgraded.\n\nThe upgrade was completed on April 12.\n\nWhat changed after Shapella?\n\nIn September last year, Ethereum underwent a major upgrade called \"The Merge\", in which the network transitioned from a proof-of-work to a proof-of-stake consensus. Users were rewarded for \"staking\", and not selling, their Ether and participation in the validation of the network.\n\nIn staking, the investors can freeze their tokens on the cryptocurrency's network. In return, they can earn rewards. The staked tokens are used to develop a system to validate the transactions on the database, unlike PoW, where data has to be entered by miners.\n\nHowever, it was a one-way street. To date, 18 million Ethereum tokens have been staked on the network, valued at $33 billion. The users were not able to withdraw their holdings.\n\nShapella has enabled \"unstacking\" Ether. Shanghai will create a new transaction type that will allow stakers to withdraw their balances, while Capella will enable the network to accept a withdrawal request.\n\nUsers were immediately allowed to withdraw their Ether token. Some 57,600 Ether tokens per day can be withdrawn through full withdrawals and partial withdrawals.\n\nMoreover, as it reduces the need to enter data by miners, staking brings down energy consumption. Now with Shapella, more investors will be encouraged to stake their holdings as it will be easier to withdraw.\n\nWhat happened after the Shapella upgrade?\n\nAfter the upgrade, Indian crypto investors flocked to invest as well as withdraw Ethereum. Major Indian crypto exchanges like WazirX and CoinDCX saw significant spikes in Ethereum trading.\n\nIn the past seven days, Ethereum has jumped 9.28 per cent and was trading at $2,097 on Tuesday, according to coinmarketcap."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmJpdGNvaW5zZW5zdXMuY29tL2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tZGFpbHktMTctYXByaWwtaXMtZXRoLXNldHRpbmctdXAtZm9yLWFub3RoZXItcHVzaC1oaWdoZXItc29vbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction Daily (17-April): Is ETH Setting Up For Another Push Higher Soon? - Bitcoinsensus",
        "content": "Is ETH Setting Up For Another Push Higher Soon? Watch this key pattern forming in the 4-hour timeframe\n\nThe Ethereum price is just coming out from a massive rally that played out all through last week. This bullish rally was caused by the Triangle Pattern we tracked to completion in the 4-hour timeframe.\n\nRight now, we are seeing another bullish pattern form in the 4-hour timeframe. In this Ethereum analysis, we will be talking about the bullish Flag Pattern currently forming right now, what it means for the price, and what we should be expecting next.\n\nTo trade ETH with leverage, sign-up to Bybit right now! Bybit’s BIGGEST Bonus Campaign is now live! You can get up to a $30,000 Bonus when you fund your Bybit account with our Bybit link\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nEthereum Bullish Flag Pattern\n\nIs ETH Setting Up For Another Push Higher Soon? Watch this key pattern forming in the 4-hour timeframe\n\nThe Ethereum price is currently forming a bullish flag pattern in the 4-hour timeframe. This pattern is very important right now because it helps us understand what the ETH price is doing right now and what it might be getting ready to do in the coming days.\n\nThe image below is what a completed Flag Pattern looks like.\n\nIf this bullish Flag Pattern plays out exactly in the coming days, there is a very high probability that we might see another +15% rally in the Ethereum price again!\n\nSo for now, we are closely watching this Bullish Flag pattern to see if it would play out.\n\nFinal Verdict!\n\nRight now, Ethereum is currently in a ranging market in the 4-hour timeframe. This ranging market is forming what looks like a Bullish Flag Pattern in the 4-hour timeframe.\n\nIf this bullish pattern remains valid and plays out, there is a very high probability that we might see another +15% rally in the ETH price again.\n\nHow to Trade Bitcoin (BTC)?\n\nTo understand the basics of Bitcoin trading, you can read our How To Trade Bitcoin Guide. It can prove helpful for traders who are just getting started with Bitcoin trading. You can also check out our list of top Bitcoin Exchanges To Trade With.\n\nPrimeXBT Covesting: Trade Hassel Free\n\nSign-up on PrimeXBT today to trade Bitcoin hassle-free. You can copy experienced traders and access hundreds of different strategies on the platform! Don’t forget to claim your 25% bonus by using the promo code “bitcoinsensus50” when you sign-up with our link PrimeXBT Covesting"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vdW5jaGFpbmVkY3J5cHRvLmNvbS93aGF0LWlzLXByb3RvLWRhbmtzaGFyZGluZy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "What is proto-danksharding? - Unchained - Unchained",
        "content": "Proto-danksharding is the first in a series of proposed Ethereum upgrades that aim to split up the network into lots of little chains, known as shards. The hope is that running lots of shards in parallel will allow the entire Ethereum network to grow without slowing down, even if many more individuals start to use the network.\n\nIt will take several years for danksharding to be fully realized on Ethereum. Yet, once implemented, sharding could increase the throughput of the blockchain, make transactions far cheaper, and prevent bottlenecks.\n\nAccomplishing all this would solve several of the major pain points of Ethereum, namely slow and expensive transactions that can cause congestion in times of network stress. Sharding will also reduce the cost of running a validator over time, thereby decentralizing the network.\n\nProto-Danksharding\n\nThe flowery name for the upgrade, which also goes by “Shard Blob Transactions,” conceals a more prosaic technical name: EIP-4844. EIP stands for Ethereum Improvement Proposal, the title given to any recommendation to upgrade the blockchain.\n\nDanksharding is the name of the sharding design that Ethereum’s developers propose to use on the network. “Dank,” in addition to referencing slang that means something like “cool” or “good,” is a hat tip to Ethereum Foundation researcher Dankrad Feist.\n\nProto-danksharding, i.e., EIP-4844, is the first step toward implementing full danksharding. It would implement most of the logic and craft the rules that would be required for danksharding to go ahead. Consider it “danksharding-lite.”\n\nThe upgrade would also introduce a new type of transaction called a “blob-carrying transaction.” These look just like regular transactions but hold a relatively large and inexpensive piece of data known as a blob. The benefit of these blob-carrying transactions, explained in greater detail below, is greater efficiency, particularly for existing scaling solutions like rollups. That will cut costs and improve speeds.\n\nHow Danksharding Works\n\nSo how does danksharding propose to scale Ethereum? Put simply, instead of verifying everything in a block, danksharding aims to have the Ethereum blockchain merely verify that these data-efficient “blobs” contain the right kind of information and carry out any orders contained therein.\n\nThis cuts down the amount of work required by the execution layer of Ethereum, the part of the network that is responsible for carrying out the instructions set by the other side of Ethereum, known as the consensus layer.\n\nThe execution layer of Ethereum is busy enough as it is, and making things more efficient speeds up the blockchain. Blob transactions are supposedly cheaper to execute, too, ultimately reducing transaction costs for users.\n\nThese blobs of data are likely to contain information relevant to layer-2 protocols, like Arbitrum or Optimism. Layer-2 protocols, which wrap up bundles of Ethereum transactions and process them elsewhere, are also important for scaling Ethereum. It is expected that danksharding and layer-2 protocols will work hand in hand.\n\nIn addition to the above, danksharding also reimagines how transaction fees are paid on Ethereum. One class of actor, known as the proposer, determines which transactions should fit into a block. A second class—so-called block builders—bids on the right to determine the transactions that are contained within a block.\n\nHow Will Proto-Danksharding Affect You?\n\nProto-danksharding only introduces a very limited version of danksharding; it’s mostly throat-clearing for the real thing. However, it should make transacting on some layer-2 protocols, which will be able to access these new blob transactions, a lot cheaper.\n\nBut even these layer-2 transactions will pale in comparison to the genuine article: proto-danksharding will provide a single megabyte of data availability for each transaction, while actual danksharding will hit 16 megabytes.\n\nDanksharding doesn’t have a release date, and the peanut gallery of Twitter pundits expects that even proto-danksharding could take years.\n\nIn late 2022, Ethereum officially switched from proof of work to proof of stake (known as the Merge), reducing its environmental impact by a factor of 99%. The Merge was Ethereum’s biggest upgrade to date. It took about six years to implement, and came following innumerable delays.\n\nWhile you wait, note that upgrades to the Ethereum blockchain itself will be complemented by advances to layer-2 technologies, such as zk-SNARKs and rollups."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vd3d3LmFsdGNvaW5idXp6LmlvL3Jldmlld3MvdG9wLTMtYnJpZGdlcy1mb3ItYWxnb3JhbmQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Apr 2023 07:00:00 GMT",
        "title": "Top 3 Bridges for Algorand - Reviews - Altcoin Buzz",
        "content": "The birth of Ethereum has guided crypto towards a different trajectory. Yet, Ethereum is slow and costly to transact with. This has brought about the growth of other L1 projects, such as Algorand.\n\nIndeed, projects that are smart contract-enabled now dominate the space. Many of them claim to be able to solve the blockchain trilemma. Simply put, they claim to be already:\n\nScalable. Secure. Decentralized.\n\nAlgorand is one such project. Apart from the above three points, Algorand is also environmentally sustainable. It is also much cheaper to use, with transactions as low as 0.001 $ALGO.\n\n“Wow, that sounds great! But, how do I get started with Algorand?” Now if that’s what you’re wondering, then stay tuned. We’ve got a good answer for you!\n\nBridging to Algorand\n\nOne of the easiest ways to get started with Algorand is to use a bridge. A bridge is a tool which allows you to port assets from one blockchain to another. Hence, the term “bridge.” So, if you already have assets on another blockchain, you’re in luck! This article is just for you. Today, we’re going to look at the top three bridges for Algorand.\n\nBridge #1 – Messina One\n\nFirst of the top three bridges for Algorand is Messina One. Its mission is to promote blockchain interoperability. In terms of safety, Messina One has valid audits from Kudelski Security. It also has put in place 24/7 monitoring and counter-measures. These help to sieve out malicious activity on the bridge.\n\nAs of now, Messina One supports the following chains:\n\nAlgorand\n\nEthereum\n\nCronos\n\nThe newest addition – Polygon\n\nBut, Messina One isn’t stopping just here! The team is also looking to add on many other chains. These include Binance Chain, Avalanche, Arbitrum, Optimism, and so forth.\n\nNow, what we like about the Messina One bridge is its simple user interface (UI). On its webpage, there are two columns – “Source” and “Destination.” Connect your wallets for both these chains. Then, select your assets and the amount to bridge. Check that you’ve got enough gas to pay for bridging. Voila! You’re all set to bridge.\n\nSo, what happens if you bridge over a token like $USDC or $USDT to Algorand? You’re pretty much stuck there if you’re new to Algorand. This is because you don’t have any $ALGO for gas to perform any transactions. Fret not! Messina One has this cool feature to “rescue” you. It automatically detects such accounts with low to zero $ALGO balances. Then, it airdrops a small amount of $ALGO to you. It’ll be just enough for you to make a few transactions.\n\nFor an in-depth guide on Messina One’s bridge, you can refer to the link here. Next, let’s move on to Bridge #2.\n\nBridge #2 – Milkomeda\n\nNext of the top 3 bridges for Algorand is Milkomeda. This bridge links the Milkomeda blockchain with Algorand. To elaborate further, Milkomeda is:\n\nA sidechain of Cardano. Milkomeda C1 sidechain aims to integrate the Ethereum Virtual Machine (EVM) onto Cardano.\n\nA roll-up chain for Algorand. Similarly, Milkomeda A1 roll-up chain aims to bring EVM capabilities to Algorand.\n\nWith its sleek UI, it’s pretty easy to bridge to Algorand. But, you’re only able to do so from the Milkomeda A1 roll-up chain. To use this bridge, follow the steps below:\n\nConnect to your Milkomeda and Algorand wallets.\n\nSelect “Milkomeda to Algorand” under the “Network Origin” field.\n\nNext, select the asset to bridge over under the “Token” field.\n\nKey in the amount of the asset you want to bridge.\n\nOnce that’s done, follow the prompts from your wallets. You’ll be on your way to Algorand in no time! Do note that by bridging your $ALGO using Milkomeda, you’re “unwrapping” your $ALGO. You can refer to the link here to learn more on how this process works.\n\nWithout further ado, let’s move on to the final bridge for today!\n\nBridge #3 – Wormhole Bridge\n\nLast, but not least, of the top 3 bridges for Algorand is Wormhole’s Portal bridge. Said bridge helps to move assets across many chains. These include:\n\nEthereum\n\nAvalanche\n\nArbitrum\n\nBinance Chain\n\nAlgorand (of course!) – and 17 other chains.\n\nAlgorand is now supported in Wormhole Portal Bridge and pNetwork. Here's what it means for $ALGO and #crypto ecosystem. — Ulam Labs (@ulamlabs) May 20, 2022\n\nBut, how does the Wormhole bridge work so well across so many chains? Let’s discuss this using an example. Assuming you’re looking to send $ETH from Ethereum chain to Algorand. Wormhole bridge will take your original $ETH and lock it into a smart contract. It will then issue wrapped $ETH onto Algorand. The opposite will happen when you decide to bridge from Algorand to Ethereum.\n\nWhen it comes down to safety, Wormhole bridge ensures its contracts can stand up to scrutiny. That’s because Wormhole suffered a hack back in February 2022. This led to losses amounting over $320 million! But today, Wormhole has risen from the ashes. It has put in place many safety features. These comprise:\n\nStrict smart contract audits.\n\nSocial media monitoring.\n\nUsing “Guardian” nodes to validate transactions, and so forth.\n\n“Great! Sounds like Wormhole bridge is much safer now. How do I get to using it?” If that’s what’s on your mind now, read on! We’ll have a simple guide to bring you through.\n\nFirst, refer to the “1. Source” tab. Choose your “Source” and “Target” chains. Then, connect your wallet. Next, choose the asset you want to bridge, and the amount to bridge. Then, click “Next.”\n\nSecondly, refer to the “2. Target” tab. Connect your Algorand wallet here. Ensure that you’ve got $ALGO to pay for gas fees in this wallet. At the moment, you can connect using Ledger, My Algo Wallet, and Pera wallet. Then, click on the “Manual Payment” option, and then the “Next” button.\n\nMoving on, refer to the “3. Send Tokens” tab. Approve the token limits for transfer. Then, approve the transfer of the tokens itself.\n\nLastly, refer to the “4. Redeem Tokens” tab. Click on the “Redeem” button. Approve the following prompts from you wallet. You should now be able claim your tokens on Algorand!\n\nConclusion\n\nSo far, we’ve run through the top 3 bridges for Algorand. Indeed, your bridging choice should depend much on which source chains your funds reside. But, do keep an eye out for the bridge’s security too. Ask yourself these questions:\n\n“Does the bridge have audits or safety features in place to prevent hacks?”\n\n“Is the bridge battle-tested?” In other words, has the bridge processed many transactions without issues?\n\nOn top of that, the last criteria would be the bridge’s user interface. Choose a bridge that you feel is most convenient. That’ll make your cross-chain experience a more pleasant one!\n\nNow, let’s not delay any further. Hop onto one of these bridges and head over to Algorand now!\n\n⬆️ For more cryptocurrency news, check out the Altcoin Buzz YouTube channel.\n\n⬆️ Check out our most up-to-date research, NFT and Metaverse buy, and how to protect your portfolio in this market by checking out our Altcoin Buzz Access group, which for a limited time, is FREE. Try it today."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNC8xOC90cmFkZXItdW52ZWlscy1wcmljZS10YXJnZXQtZm9yLXNvbGFuYS1zb2wtc2F5cy1oZXMtYnVsbGlzaC1vbi1kb2dlY29pbi1kb2dlLWFuZC1vbmUtZXRoZXJldW0tcml2YWwv0gGJAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA0LzE4L3RyYWRlci11bnZlaWxzLXByaWNlLXRhcmdldC1mb3Itc29sYW5hLXNvbC1zYXlzLWhlcy1idWxsaXNoLW9uLWRvZ2Vjb2luLWRvZ2UtYW5kLW9uZS1ldGhlcmV1bS1yaXZhbC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Trader Unveils Price Target for Solana (SOL), Says He’s Bullish on Dogecoin (DOGE) and One Ethereum Rival - The Daily Hodl",
        "content": "A popular crypto trader thinks Ethereum (ETH) competitor Solana (SOL) could see sizeable gains in the next two weeks.\n\nThe pseudonymous analyst Cantering Clark, tweeting from his new Man o’ War Twitter account, says he believes SOL could rally by as much as 23% in the short term.\n\n“I think if we can handle $27, $30 is a reasonable target in the next two weeks.”\n\nSOL is trading at $24.33 at time of writing.\n\nCantering Clark also tells his 165,100 Twitter followers that he’s bullish on the top meme asset Dogecoin (DOGE) and layer-1 protocol Aptos (APT).\n\n“Have been long DOGE.\n\nAdded SOL and APT.”\n\nDOGE is trading at $0.0905 at time of writing and is up 1.17% in the past day. Aptos is trading at $12.21 and is down 2.28% in the last 24 hours.\n\nDespite the gains of the past months, Cantering Clark says he still feels cautious about the overall prospects of Bitcoin (BTC). According to the trader, he believes Bitcoin could potentially witness a big sell-off event as long as it is trading below a key resistance level at $34,000.\n\n“When followers get perplexed as to why I started getting cautious around $28,000 and managing positioning more, hedging some or all at points etc.\n\nThe entire area of $28,000-$32,000 had the potential to be a pretty reasonable sticky point. There is a reason why I never give much back to the market.\n\nI bought before the FTX nuke in November and ate that, added at the lows, and bought again at $20,500.\n\nUntil we are back in the 2021 range meaningfully, I will sleep with one eye open.”\n\nAt time of writing, Bitcoin is trading for $29,509.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney\n\nShutterstock/MrArtHit"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMizQFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9jcnlwdG8tYnJlYWtpbmctbmV3cy1zaGliYS1pbnUtc2hpYi1idXJuLXJhdGUtdXAtMzAwMDAtZXRoZXJldW0tZXRoLWdldHMtcmVhZHktZm9yLXNoYXBlbGxhLXVwZ3JhZGUtcmVucS1maW5hbmNlLXJlbnEtcmFpc2VzLTEwLW1pbGxpb24td2Vla3MtZmFzdGVyLXRoYW4tZXhwZXJ0cy1wcmVkaWN0ZWQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Apr 2023 07:00:00 GMT",
        "title": "Crypto Breaking News: Shiba Inu (SHIB) burn rate up 30000%, Ethereum (ETH) gets ready for Shapella Upgrade ... - Analytics Insight",
        "content": "The world of cryptocurrency is always abuzz with breaking news, and the past few weeks have been no different. From the soaring popularity of Shiba Inu (SHIB) to the upcoming Shapella upgrade for Ethereum (ETH) and the successful $10 million fundraising by RenQ Finance (RENQ), there’s a lot to catch up on in the crypto world. In this article, we’ll dive into the latest crypto-breaking news and what it means for the industry.\n\nShiba Inu Burn Rate Up 30000%\n\nShiba Inu (SHIB) has been making waves in the cryptocurrency world, with its popularity skyrocketing in recent months. One of the latest developments with SHIB is its burn rate, which has gone up by an astounding 30000%.The burn rate of Shiba Inu ($SHIB) has experienced a massive surge of over 30,000% in the last 24 hours, thanks to the Koyo token project. Data from the Ethereum blockchain indicates that Koyo burned a whopping 1.49 billion SHIB tokens, helping to reduce the meme-inspired cryptocurrency’s vast supply.\n\nThis is not the first time that Koyo has burned a significant amount of SHIB, as it moved 1.1 billion tokens to a dead wallet earlier this year. Koyo debuted exclusively on the ShibaSwap DEX last month, and through various transactions, it has helped to reduce Shiba Inu’s supply by 8.75 billion SHIB tokens.\n\nThe surge in the burn rate suggests that there is increasing demand for the token.\n\nEthereum Gets Ready for Shapella Upgrade\n\nEthereum (ETH), the world’s second-largest cryptocurrency, is preparing for the highly anticipated Shapella upgrade.\n\nThe impending software upgrade of Ethereum dubbed the Shanghai or Shapella upgrade, is poised to cause a significant shift in the ecosystem as Ether holders prepare for what they believe will be a major shake-up. This upgrade marks the biggest change to the blockchain’s protocol since the “Merge” in 2020.\n\nThe upgrade, which brings a proof-of-stake consensus mechanism to Ethereum, will allow Ether holders to earn rewards by staking their tokens. However, since users have been unable to retrieve their staked Ether since December 2020, many are eagerly anticipating the implementation of the Shanghai upgrade, which will finally allow them to withdraw their staked Ether.\n\nThe anticipated withdrawal of staked Ether is expected to lead to a massive reshuffle in the ecosystem, as users switch between service providers or move to stake on their own. Analysts predict that within the first five days after the Shanghai upgrade, users will withdraw 1.2 million Ether, valued at nearly $2.3 billion. This massive withdrawal is expected to be followed by a flurry of re-staking activity as users seek out new service providers.\n\nRenQ Finance Raises $10 Million Weeks Faster Than Experts Predicted\n\nRenQ Finance (RENQ), a decentralized finance (DeFi) platform, has successfully raised $10 million in its presale stage, weeks faster than experts predicted. The presale stage was oversubscribed, with investors eager to get their hands on RENQ tokens.\n\nRENQ offers a range of DeFi services, including staking, yield farming, and lending/borrowing. Its unique features, such as the NFT launchpad and the user-friendly platform, have attracted a growing community of investors and users. The successful presale is a testament to the strength of the project and the confidence that investors have in its potential for growth and adoption.\n\nConclusion\n\nThe world of cryptocurrency is always evolving, and the breaking news in the past few weeks has shown that the industry is continuing to gain momentum.\n\nFrom the soaring popularity of Shiba Inu (SHIB) to the upcoming Shapella upgrade for Ethereum (ETH) and the successful fundraising by RenQ Finance (RENQ), there’s a lot to keep an eye on in the crypto world. It will be interesting to see how these developments unfold and what other exciting news is yet to come.\n\nClick Here to Buy RenQ Finance (RENQ) Tokens.\n\nVisit the links below for more information about RenQ Finance (RENQ):\n\nWebsite: https://renq.io\n\nWhitepaper: https://renq.io/whitepaper.pdf\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2NyeXB0by12ZXRlcmFucy10YXJnZXRlZC1pbi1teXN0ZXJpb3VzLW1ldGFtYXNrLWhlaXN0cy01ay1ldGgtc3RvbGVuL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Crypto veterans targeted in mysterious wallet heists – up to 5k ETH allegedly stolen - CryptoSlate",
        "content": "More than 5,000 Ethereum (ETH) and an undetermined quantity of tokens and NFTs have been stolen across multiple chains in an ongoing hack since late last year, said MetaMask dev @tayvano_.\n\n“I don’t know how big it is but since Dec 2022 it’s drained 5000+ ETH and ??? in tokens / NFTs / coins across 11+ chains.“\n\nThe dev added that they had been investigating for the last two days but cannot determine how the attacker is carrying out the thefts. Moreover, the victims are all “OGs who are reasonably secure.”\n\nOGs targeted in sophisticated wallet heist\n\n@tayvano_ pointed out that this is a sophisticated attack deliberately targeting OGs, reiterating that no one can work out where the exploit lies.\n\n“This is NOT a low-brow phishing site or a random scammer. It has NOT rekt a single noob. It ONLY rekts OGs.”\n\nForensic device examination has led nowhere — further stumping investigations into the method used to access the victims’ wallet.\n\nThe commonalities between cases were the keys were created between 2014 and 2022, and victims are “crypto native,” such as possessing multiple addresses and working within the crypto industry.\n\nThe hacker will commit “primary” thefts, with “secondary” thefts following hours later to collect assets and dust missed during the initial heist — sometimes weeks or months later.\n\nIn the case of large thefts, the attacker will swap assets into ETH inside the wallet, then send the tokens to a centralized swapper, including SimpleSwap and ChangeNOW — always swapping into Bitcoin (BTC).\n\nSitting on the swapped BTC for a week, the funds are sent to a mixer for address obfuscation.\n\nTips on staying safe\n\n@tayvano_ speculates that the attacker has acquired a data cache from the victims’ device. Using this, they can abstract the wallet keys — but the dev stresses that this is “just a guess.”\n\n“My best guess rn is that someone has got themselves a fatty cache of data from 1+ yr ago & is methodically draining the keys as they parse them from the treasure trove.“\n\nThe dev cautioned users to avoid storing all their digital assets on a single wallet key. Instead, people should split their crypto across multiple keys or hold assets on a hardware wallet.\n\n“PLEASE DON’T KEEP ALL YOUR ASSETS IN A SINGLE KEY OR SECRET PHRASE FOR YEARS. THE END.“\n\nConsenSys contacted CryptoSlate to clarify that multiple chains and wallets have been affected by the ongoing hack. MetaMask’s role in this is in taking the investigative lead.\n\nMentioned in this article"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiKmh0dHBzOi8vZGVjcnlwdC5jby9yZXNvdXJjZXMvd2hhdC1pcy16a2V2bdIBMGh0dHBzOi8vZGVjcnlwdC5jby9yZXNvdXJjZXMvd2hhdC1pcy16a2V2bT9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Apr 2023 07:00:00 GMT",
        "title": "What Is zkEVM? The Zero-Knowledge Proof's Role in Smart Contracts - Decrypt",
        "content": "In brief Rollups are a scaling solution that can lower transaction costs and increase throughput on a blockchain protocol.\n\nRollups are a popular Layer-2 scaling solution for Ethereum.\n\nA zkEVM is a new type of zk-Rollup that is EVM compatible.\n\nThe first two zkEVM options were released in March 2023. More zkEVM alternatives are in development (at the time of writing).\n\nYour Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\ntl;dr (Don't worry if you don't understand, a full explainer follows): A zkEVM is an EMV-compatible rollup that is secured by a ZKP. Zero-Knowledge Rollups (zk-Rollups) are a type of rollup that uses Zero-Knowledge Proofs (ZKPs). A ZKP is a cryptographic proof that verifies the transaction data within a zk-Rollup is accurate.\n\nThe ZKP in a zk-Rollup enhances both the privacy and security of a rollup as this proof verifies the transactions in it — no trust or “optimism” is required. It is called “zero-knowledge” in the sense that you can verify the truth of all the data and transactions in a zk-Rollup — without needing to know the details of every transaction contained within it.\n\nBackground on zkEVMs\n\nIn order to understand zkEVMs, we need to go back a few blocks and explain this dense portmanteau of acronyms (zk-Rollups and EVMs). The Ethereum Virtual Machine (EVM) is the computing environment of the Ethereum blockchain. The EVM could be thought of as a decentralized virtual computer; this is why Ethereum is sometimes referred to as “the global supercomputer.” The EVM is where smart contracts and decentralized applications (dApps) on Ethereum interact with each other. Ethereum’s EVM is one of the core protocol features that has made it a pillar of the blockchain ecosystem.\n\nWhat do rollups do?\n\nRollups bundle transactions in order to improve a blockchain’s throughput (data or transaction processing capability over a specific time frame) while lowering transaction costs at the same time. In essence, a rollup “rolls up” (combines) a number of transactions from a Layer-1 protocol (a blockchain like Ethereum) and executes them off-chain (not on the primary blockchain) using a Layer-2 protocol such as a sidechain or an EVM-compatible blockchain.\n\nSome rollups are “optimistic,” meaning they are assuming (optimistically) that all the transactions in a rollup are valid and not fraudulent. For this reason, there is a period (typically several days) where one can challenge the validity of a transaction. Examples of Optimistic Rollup (ORs) for Ethereum include Optimism, Arbitrum, and Boba Network. While ORs significantly lower costs and increase transaction throughput, faulty transactions can get through if they are not challenged in a timely manner.\n\nPopular zk-Rollup solutions include dYdX and Loopring. While these have security advantages, zk-Rollups tend to be a little more computationally expensive than ORs.\n\nComparing these two Ethereum rollup types, they both have some downsides. While ORs tend to be EVM compatible, they come with some concerns about fraud and security. While zk-Rollups tend to be praised for having better security, they generally can only used in specific transactions as they typically lack EVM compatibility; this means that zk-Rollups are limited to being used for bespoke processes that limit their adoption and use cases.\n\nFor these reasons, many have expressed the desire for a rollup that combines the best features of these alternatives into one solution; that solution is now here.\n\nAD\n\nAD\n\nWhat are zkEVMs?\n\nA zkEVM is an EMV-compatible rollup that is secured by a ZKP. This gives it the enhanced functionality of some of the Optimistic Rollup solutions that are EVM-compatible while also giving it the security of earlier zk-Rollup options that didn’t offer compatibility with Ethereum’s EVM. These new zkEVMs allow for enhanced Ethereum process functionality (smart contracts and dApps) while also lowering gas costs and increasing Ethereum network throughput.\n\nWhy Ethereum Needs zkEVMs\n\nEthereum as a blockchain has suffered at times from high transaction fees and transaction confirmation delays. Further, the Ethereum blockchain itself can not natively process more than approximately 30 transactions per second (TPS). Each rollup solution can increase transaction throughput by up to 2,000 TPS — or more. While Ethereum’s recent upgrade (called The Merge) will increase scalability, many expect Layer-2 scaling solutions such as rollups to remain popular for some time in order to ameliorate Ethereum transaction congestion issues. Scalability is one major benefit of zkEVMs.\n\nWhile scalability had already been enhanced via earlier rollup iterations, zkEVMs combine this scalability with privacy, security, and enhanced interoperability. By combining ZKPs with EVM compatibility, zkEVMs keep the security and privacy-preserving features of zk-Rollups — while enhancing Ethereum interoperability by preserving EVM compatibility. This allows zkEVMs to be interoperable with smart contracts and dApps used on Ethereum. Further, these zkEVMs should also work on EVM-compatible blockchains such as Avalanche, Solana, and Fantom.\n\nLike other rollup solutions, zkEVMs significantly lower transaction costs. At the time of writing, Ethereum transaction costs were approximately $0.90/transaction (when converted to USD). As zkEVMs can process hundreds — or thousands — of transactions in a batch off-chain, this transaction cost can be split amongst all the transactions in a rollup by simply verifying the proof of the rollup on Ethereum in a single transaction. This can lower the cost per transaction to less than $0.01 for simple solitary transactions — and a bundle of around 100 transactions could be executed for less than $0.10 worth of crypto.\n\nAnother big benefit of zkEVMs is their interoperability. Existing smart contracts and dApps can easily be migrated to a zkEVM to take advantage of rollup benefits — without requiring any coding changes. And because zkEVMs are verified on Ethereum just like other rollups, they have largely the same level of security as the native Ethereum blockchain protocol.\n\nPolygon and zkSync’s zkEVMs\n\nLaunched just days apart in late March 2023, the first two zkEMVs to be released to the public were from zkSync and Polygon (on March 24th and 27th, respectively). In development since 2019, zkSync’s solution called zkSync Era went live to much fanfare and is the first zkEVM to be publicly available. The Polygon zkEVM is open source and Ethereum creator Vitalik Buterin was given the privilege of sending the first transaction following its public release.\n\nBoth options already have long lists of crypto projects that have indicated they plan to use one — or both — of these zkEVM solutions. It should be noted that while these zkEVMs have undergone significant security testing, both teams have cautioned that these are early versions that should initially be used carefully. Like the first iterations of other blockchain breakthroughs, they may go through some developmental growing pains and security upgrades over the coming years.\n\nThe Future of zkEVMs on Ethereum\n\nWhile these are the first two zkEVMs to be available for public use, there are numerous other zkEVM projects in development with a public release on the horizon, including alternatives from Consensys, Scroll, and Taiko. While Ethereum continues to work towards on-chain scaling through future upgrades to its protocol, these upgrades can often be delayed significantly due to their requirements and technical complexity. Layer-2 solutions like zkEVMs are continuing to solve pain points for Ethereum as it continues its developmental goals of scalability, security, throughput, decentralization, and enhanced functionality.\n\nAD\n\nAD"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vdGVjaC90ZWNobm9sb2d5L2luZGlhbi1jcnlwdG8taW52ZXN0b3JzLWZsb2NrLXRvLWV0aGVyZXVtLWFmdGVyLXNoYXBlbGxhLXVwZ3JhZGUvYXJ0aWNsZXNob3cvOTk1NjUxMTYuY21z0gGJAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS90ZWNoL3RlY2hub2xvZ3kvaW5kaWFuLWNyeXB0by1pbnZlc3RvcnMtZmxvY2stdG8tZXRoZXJldW0tYWZ0ZXItc2hhcGVsbGEtdXBncmFkZS9hbXBfYXJ0aWNsZXNob3cvOTk1NjUxMTYuY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Indian crypto investors flock to Ethereum after 'Shapella' upgrade - The Economic Times",
        "content": "Elevate Your Tech Prowess with High-Value Skill Courses Offering College Course Website IIM Kozhikode IIMK Advanced Data Science For Managers Visit MIT MIT Technology Leadership and Innovation Visit Indian School of Business ISB Professional Certificate in Product Management Visit\n\nIndian crypto investors have started showing interest in Ethereum (ETH) following the highly anticipated Shapella upgrade, which resulted in a surge in transaction volumes in the digital asset last week across major local cryptocurrency exchanges.At Wazir X , the transaction volume for ETH grew from $52,000 on April 9 to $3,75000 on April 14, recording a near-eight-fold increase.Another top exchange, CoinDCX, said that its ETH volumes had spiked significantly - by 55% - on the INR trading pair over the last few weeks.According to the exchanges, the transaction volumes of ETH decreased over the weekend, but this is a common trend in the crypto markets, which usually experience lower volumes during weekends.“We anticipate an increase in momentum starting from this week,” said Minal Thukral, EVP-Growth, CoinDCX.Ethereum has been up 11.73 % in the last 7 days, touching $2,076 on Coinmarketcap at 5 PM Mumbai time on Monday.On April 12, the Ethereum blockchain underwent simultaneous \"Shanghai\" and \"Capella\" upgrades while operational. The Shanghai upgrade primarily impacted Ethereum's (ETH) Execution Layer, while Capella targeted the Consensus Layer. The implementation dubbed \"Shapella,\" is expected to enhance the network's performance, security, and efficiency.The upgrade allowed users to withdraw billions of dollars in Ether, the native token of the Ethereum network, and the network recorded a hefty inflow of deposits, touching a yearly high of $2,129.Staking in crypto involves holding and locking up a certain amount of cryptocurrency to participate in the network and earn returns akin to a traditional bank FD.Investors were fearing that Ether holders would quickly withdraw their staked tokens, but fresh deposits helped sustain the staking balance for a couple of days. But lately, withdrawals from Ethereum staking contracts have exceeded deposits.Indian investors said that Ethereum holders now have more confidence to stake their tokens after the Shanghai upgrade as it will allow them to unstake their ETH after a 14-day lock-in period from that day.\"Unlike other Smart Contract Blockchains, the percentage of staked tokens is only 15% in Ethereum, which is expected to rise from here on. Cardano has 69% of ADA tokens staked, Avalanche has 54% AVAX staked, Solana has 71% of SOL staked,\" said Ashwini Nadar, a Mumbai-based software professional and avid crypto enthusiast.Ethereum, a decentralized blockchain platform founded by Vitalik Buterin in 2015, allows developers to create decentralised applications (dApps) and smart contracts. It ranks as the second-largest cryptocurrency platform by market capitalisation, following Bitcoin.Ethereum upgrades, often called \"hard forks\" or \"network upgrades,\" entail modifications to the Ethereum protocol or the Ethereum Virtual Machine (EVM), which operates smart contracts.At CoinDCX, Ethereum gained more than 6% a day after the upgrade.The exchange said that its on-chain data showed that there was a significant increase of nearly 100,000 ETH tokens staked on the Ethereum blockchain on April 14, marking the largest one-day increase in almost two months.\"This suggests that rather than withdrawing staked ETH to cash out, a significant portion of investors view the successful Shapella upgrade as an indication to stake their Ether tokens,\" said Thukral of CoinDCX.The upgrade sets the stage for a transition to a proof-of-stake (PoS) consensus mechanism, replacing the existing proof-of-work (PoW) system."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2NyeXB0by10cmFuc2Zlci05Ny1jaGVhcGVyLWhlcmVzLWhvdy1iaXRjb2luLWV0aGVyZXVtLXNpZ251cHRva2VuLWNvbS1jb3VsZC1sb3dlci1jaGFyZ2VzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Apr 2023 07:00:00 GMT",
        "title": "Crypto Transfer 97% Cheaper: Here's How Bitcoin, Ethereum & Signuptoken.com Could Lower Charges - Analytics Insight",
        "content": "According to a new report by Coinbase, a cryptocurrency exchange platform, cryptocurrencies reduce international money transfer fees by 96% and speed up the transaction time by 99%. Apart from Bitcoin and Ethereum another new cryptocurrency name Signuptoken.com is also expected to play a vital role in lowering the cost of remittance fees in the future.\n\nCrypto Reduces Cross-Border Remittance Fees\n\nSending out hard-earned money to beloved ones across the oceans gives many expatriates a sense of satisfaction. The IMF data shows that about one billion people in the world depend on cross-border remittances. But, a recent research by Coinbase has shown that people around the world spend up to $48 billion on commissions just to transfer money. US citizens alone spend $12 billion annually on fees for cross-border transactions. In the United States, the fees for international money transfer range from 5.5%-10.8%. And the transaction time for a traditional money transfer can take from 1-10 days.\n\nBut according to Coinbase’s research, cryptocurrencies reduce the cost of sending money internationally by 96.7% compared to the current system. And it only takes 10 minutes to process the transaction compared to the traditional money transfer system. The average fee for sending Bitcoin(BTC) to another wallet costs just $1.50 regardless of the transfer amount. Similarly, Ethereum(ETH) costs an average of 0.75% per transaction. Hence, sending money in Bitcoin(BTC), Ethereum(ETC) or any other crypto makes the cross-border transaction nearly 97% cheaper and 99% faster than the traditional transfer method.\n\nSignuptoken.com: The People’s Crypto\n\nSignuptoken.com is a new cryptocurrency built on the Ethereum blockchain. The project team aims to simplify crypto investment and provide efficient crypto services by incorporating new technologies.\n\nTo achieve its first aim, Signuptoken.com has skipped the presale stage. The project team has set a target of receiving one million email signups from potential investors. As no fee is charged for the signup process, crypto enthusiasts are more interested in it.\n\nPeople who want to invest in Signuptoken.com can visit the official website and signup with their mail id for free. Once registered, users will be added to Signuptoken.com’s millionaire club.\n\nThe token will be launched after reaching one million sign-ups. The project team will notify the registered users about the launch by mail. Therefore, registered users will get early access to buy tokens on the Uniswap crypto exchange platform.\n\nSignuptoken.com is also looking to make a great impact in the remittance industry. With its innovative platform, Signuptoken.com aims to provide a seamless and cost-effective way for individuals and businesses to send money across borders.\n\nThe benefits of using Signuptoken.com for cross-border transactions go beyond just cost savings. It can offer greater transparency and security than traditional money transfer services, ensuring that funds reach their intended destination without any issues.\n\nAccording to a research report by Accenture, about 20% of the world’s population owns some form of crypto assets. This rise of decentralized finance (DeFi) has opened up new possibilities for crypto-based remittance services. By leveraging the power of DeFi protocols, these services can offer even lower fees and faster transaction times, making them even more attractive to users.\n\nGet Started with Signuptoken.com:\n\nWebsite: https://www.signuptoken.com\n\nTwitter: https://twitter.com/_SignUpToken_\n\nTelegram: https://t.me/SignUpTok\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vYml0YnV5LmNhL2d1aWRlcy9ldGhlcmV1bS1tZXJnZS10b3AtMTAtdGhpbmdzLXRvLWtub3fSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Merge – Top 10 Things to Know - Bitbuy",
        "content": "Ethereum, the second largest cryptocurrency by market value has conducted its final test run for the long-awaited upgrade that will be a pivotal moment in the history of crypto. This upgrade is being called the ‘Merge’ and is said to be happening in mid-September. Before we go deeper into the details of this merge, we need to understand what exactly it is. Here are the top 10 things you need to know about the Ethereum ‘Merge’:\n\n1. What is the Merge?\n\nThe ‘Merge’ refers to the event when the Ethereum blockchain changes from using Proof-of-Work (PoW) to Proof-of-Stake (PoS). Because two independent blockchains that are now operating in parallel will be merged, it is known as \"the Merge’ due to the \"Beacon Chain,\" a specialized blockchain, and the main Ethereum blockchain being combined, or \"merged.\"\n\nThe beacon chain is empty of transactions. There are no DeFi applications or tokens. It is an empty blockchain that exists just to support the Proof of Stake consensus algorithm. Since the Beacon Chain is a \"empty chain,\" it may join the Ethereum blockchain and replace the role of Ethereum's PoW system without having to worry about any other factors. A brand-new PoS consensus method will take the place of Ethereum's PoW validation once these two chains are combined.\n\n‍\n\n2. Why is this so Important?\n\nIn the history of cryptocurrency, no blockchain has seen such a profound transformation. A crucial aspect of a blockchain's operation is not changed very frequently, and none have undergone modifications with an economy as significant and well-developed as Ethereum's. TheMerge is a long-awaited moment in the crypto world, and it will likely change the industry tremendously, paving the way for future Ethereum upgrades and setting a precedent for other blockchain and DeFi upgrades in the future.\n\n‍\n\n3. What are the benefits?\n\nEthereum's transition to a PoS consensus will bring numerous benefits, including improved efficiency, scalability, and security, as well as reduced centralization. One of the main outcomes of the Merge and transition to PoS is that it will reduce Ethereum’s energy consumption drastically. Ethereum, will consume about 99.5%less energy post-merge. Investors and authorities who care about the environment are concerned about the energy use associated with crypto currency mining. For instance, US legislators frequently criticize Bitcoin mining because of the network's significant carbon impact.\n\n‍\n\n4. Will The Merge reduce gas fees?\n\nA common misconception is that the Merge will materially lower Ethereum’s transaction fees (gas fees).It was highlighted that the Merge does not increase network capacity but rather alters the consensus procedure. The relationship between network capacity and demand determines gas pricing. While switching from a PoW to a PoS consensus, the Merge does not significantly impact any aspects that directly affect network throughput or capacity. In future upgrades, Ethereum’s gas price may decrease but for now, it will remain unchanged following theMerge.\n\n‍\n\n5. What does this mean for Eth?\n\nThe economics of ETH have been significantly impacted by TheMerge. This element of the Merge is the most important to investors. Because of the Merge's reduced ETH supply and transformation into a native yield-bearing asset, ETH's economics are fundamentally altered.Because there is less of a need to compensate PoW miners, Ethereum may lower its annual ETH issuance from 4.3% to 0.43%, making Ethereum a deflationary asset. Most people view the decrease in additional ETH issuance as exceedingly positive.\n\n‍\n\n6. How will this affect the price of ETH?\n\nEthereum recently traded in the mid-$1,800 range, up more than 80% from its mid-July lows of under $1,000. While most of this has coincided with a general uptick in the cryptocurrency market with improved macro mood (Bitcoin is up over 25% from its mid-July lows), experts have noted that anticipation for the merger has been a key factor pushing ETH’s price higher.\n\nETH really seemed to take notice of the upcoming Merge when senior developer Tim Beiko tentatively put forth an official date for the Mainnet merge to take place this September. Anything that pushes that date back may weigh on ETH in the short-term. After the recent successful Goerli merge, combined with softer than expected US inflation figures for July that were just released, ETH prices could be in within a shot of hitting $2,000 in the very near future.\n\n‍\n\n‍7. How do I prepare for the Merge?\n\nGiven that this is one of the largest occasions in the whole history of the cryptocurrency sector, it is expected that many dishonest persons would try to take advantage of it in hopes of defrauding trusting individuals of their money. It is crucial to understand that prior to theMerge, users and holders of ETH do not need to make any changes to their accounts or wallets.\n\nAfter the switch to PoS, Ethereum's complete history, going all the way back to its creation, will be preserved. After the Merge, all balances in wallets will remain accessible, and users and holders are not forced to update.\n\n‍\n\n8. Are there risks involved?\n\nEthereum critics, who are usually bitcoin maximalists relate the merge to replacing an airplane's engine in the middle of a passenger flight. Not just the aircraft but also the $183 billion worth of ether in circulation are under jeopardy. Undoubtedly, there are many risks involved in making a mistake, which is one of the primary reasons why theMerge has taken so long. As a result, there is plenty of testing and polishing going on behind the scenes.\n\n‍\n\n9. Will this be it for Ethereum Upgrades?\n\nNo! A successful \"Merge\" also prepares the ground for the rest of the Ethereum roadmap which includes upgrades, known as\"Surge,\" \"Verge,\" \"Purge,\" and\"Splurge.\" Ethereum co-founder Vitalik Buterin discussed the upgrade path, which would make Ethereum \"a far more scalable system,\" at the recent Ethereum Community Conference (EthCC) in Paris.\n\nFuture upgrades include supporting thousands of transactions per second to make applications faster and more affordable to use, improving its protocol's security against all types of attack as use of it rises, and being more environmentally friendly.\n\n‍\n\n10. Wen Merge\n\nThe merge is currently set to occur on September 15. Exciting potential and innovations are presented by the Merge and the rest of Ethereum's roadmap. Many followers of Ethereum anticipate positive outcomes, but it's yet unclear how these changes will affect the ecosystem.\n\nSince cryptocurrency is still in its infancy, there is extreme potential for it to develop. There will be advancements in the future that no one can currently conceive but which will unquestionably be very important in this booming business.\n\n‍\n\n‍\n\nBitbuy now offers Ethereum staking for Canadians in a safe and regulated environment. Learn more on how you can effortlessly start earning staking rewards here."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vYW1iY3J5cHRvLmNvbS93aHktYnRjLWFuZC1ldGgtc2Vhc29uLXRvLWNvb2wtb2ZmLW1heS1iZS1uZWFyLTMway1hbmQtMmsv0gFUaHR0cHM6Ly9hbWJjcnlwdG8uY29tL3doeS1idGMtYW5kLWV0aC1zZWFzb24tdG8tY29vbC1vZmYtbWF5LWJlLW5lYXItMzBrLWFuZC0yay9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Apr 2023 07:00:00 GMT",
        "title": "Why BTC and ETH season to cool off may be near $30K and $2K - AMBCrypto News",
        "content": "– Investors are cashing out, decreasing the possibility of further bullish direction.\n\n– Whales have been obligatory in making large transactions but ETH and BTC could now be overvalued based on the present cycle.\n\nThe recent meteoric rise of Bitcoin [BTC] and Ethereum [ETH[ to the $30,000 and $2,000 price levels respectively has captured the attention of investors and cryptocurrency enthusiasts alike.\n\nHowever, it could be time to bid farewell to these remarkable rallies as market observers were already speculating about the possibility.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nOne factor that could potentially contribute to a cooling-off period is profit-taking by traders and investors who have benefited from the recent price gains. And according to Santiment’s April mid-month update, such occurrences were back alive.\n\nIs it time for au revior?\n\nThe on-chain analytic platform mentioned that there has been an incredible hike in the social dominance of stablecoins like Tether [USDT]. Social dominance helps to identify assets that are getting hyped.\n\nAnd since the USDT dominance reached 3.01% on 17 April, it implies that investors could be locking profits as the price hits new highs. Therefore, this could lead to a temporary slowdown in buying pressure and a potential price correction.\n\nAnother notable facet in terms of market sentiment is how optimism had reduced among investors. One metric that justifies this is the social volume, which describes the number of search terms related to an asset.\n\nAs of this writing, the Bitcoin social volume had dropped to 9078. With Ethereum, it was a minimal slide to 603. This implied that overall discussions around both cryptocurrencies were no more heavy. Hence, the exit of complacency could lead to a period of consolidation.\n\nBTC & ETH: The lack of short-term opportunity\n\nFurthermore, the Market Value to Realized Value (MVRV) ratio showed that BTC might have hit an overvalued point. Same as ETH which saw the 30-day ratio rise to 14.45% on 14 April.\n\nBy comparing the market capitalization and realized capitalization, the MVRV ratio is responsible for assessing market profitability and fair value.\n\nRead Bitcoin’s [BTC] Price Prediction 2023-2024\n\nAlthough the metric for both assets had decreased, it still did not present a solid opportunity zone for accumulation. To take a cue from Santiment’s insights:\n\n“It does appear that they are a bit overvalued based on the fact that traders have been profiting in them so heavily since markets began to go on a tear in mid-January”\n\nBut in other cheery development, whales have been making impressive moves on the Bitcoin network. And an increase in these large transactions could help stabilize the BTC and ETH returns.\n\nHowever, the effects of the market sentiment were already in motion as ETH had lost its hold on $21,000. BTC, following in the same route, had dropped below $30,000. But in the long-term, the cause for a sustained rally remains, especially as the Bitcoin 2024 halving approaches."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMizAFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWluLWluZGlhLWFwcmlsLTE3LWNoZWNrLWdsb2JhbC1tYXJrZXQtY2FwLWJpdGNvaW4tYnRjLWV0aGVyZXVtLWRvZ2Utc29sYW5hLWxpdGVjb2luLXJpcHBsZS14cnAtZG9nZWNvaW4tcm5kci1yZW5kZXItZ2FpbmVyLWxvc2VyLTE1OTYwNTbSAdABaHR0cHM6Ly9uZXdzLmFicGxpdmUuY29tL2J1c2luZXNzL2NyeXB0by9jcnlwdG9jdXJyZW5jeS1wcmljZS10b2RheS1pbi1pbmRpYS1hcHJpbC0xNy1jaGVjay1nbG9iYWwtbWFya2V0LWNhcC1iaXRjb2luLWJ0Yy1ldGhlcmV1bS1kb2dlLXNvbGFuYS1saXRlY29pbi1yaXBwbGUteHJwLWRvZ2Vjb2luLXJuZHItcmVuZGVyLWdhaW5lci1sb3Nlci0xNTk2MDU2L2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Apr 2023 07:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Dips Below $30,000 As Ethereum Remains Stable - ABP Live",
        "content": "Ethereum (ETH), the second-most popular coin after Bitcoin (BTC), managed to rise above the $2,000 mark for the first time since May last year, riding high on the success of the Shanghai Upgrade. BTC managed to remain stable within the $30,000 mark early Friday morning. Other popular altcoins — Dogecoin (DOGE), Ripple (XRP), Solana (SOL), and Litecoin (LTC) — saw notable gains across the board. Arbitrum (ARB) emerged to be the top gainer, with a 24-hour jump of over 27 percent.\n\nThe global crypto market cap stood at $1.27 trillion at the time of writing, registering a 24-hour gain of 0.19 percent.\n\nBitcoin (BTC) price today\n\nBitcoin price stood at $29,996.48, registering a minor 24-hour dip of 0.87 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 26.08 lakh.\n\nEthereum (ETH) price today\n\nETH price stood at $2,097.63, marking a 24-hour gain of 0.49 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 1.80 lakh.\n\nDogecoin (DOGE) price today\n\nDOGE registered a 24-hour jump of 0.09 percent, as per CoinMarketCap data, currently priced at $0.0893. As per WazirX, Dogecoin price in India stood at Rs 7.68.\n\nLitecoin (LTC) price today\n\nLitecoin saw a 24-hour gain of 2.97 percent. At the time of writing, it was trading at $98.87. LTC price in India stood at Rs 8,340.02.\n\nRipple (XRP) price today\n\nXRP price stood at $0.514, seeing a 24-hour loss of 0.65 percent. As per WazirX, Ripple price stood at Rs 44.25.\n\nSolana (SOL) price today\n\nSolana price stood at $25.79, marking a 24-hour gain of 6.06 percent. As per WazirX, SOL price in India stood at Rs 2,200.\n\nTop crypto gainers today (April 17)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nRender Token (RNDR)\n\nPrice: $1.95\n\n24-hour gain: 16.49 percent\n\nRocket Pool (RPL)\n\nPrice: $59.42\n\n24-hour gain: 12.37 percent\n\nInjective (INJ)\n\nPrice: $9.42\n\n24-hour gain: 9.67 percent\n\nCasper (CSPR)\n\nPrice: $0.05538\n\n24-hour gain: 8.98 percent\n\nAvalance (AVAX)\n\nPrice: $20.80\n\n24-hour gain: 8.76 percent\n\nTop crypto losers today (April 17)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nOKB (OKB)\n\nPrice: $52.61\n\n24-hour loss: 4.30 percent\n\nWOO Network (WOO)\n\nPrice: $0.3182\n\n24-hour loss: 4.14 percent\n\nKlaytn (KLAY)\n\nPrice: $0.2574\n\n24-hour loss: 3.35 percent\n\nNeo (NEO)\n\nPrice: $13.39\n\n24-hour loss: 2.01 percent\n\nShiba Inu (SHIB)\n\nPrice: $0.00001143\n\n24-hour loss: 1.94 percent\n\nWhat crypto exchanges are saying about the current market scenario\n\nMudrex co-founder and CEO Edul Patel told ABP Live, “Over the weekend, Bitcoin remained consolidated around the $30,000 mark, after peaking at $31,005 on Friday, its highest level since June 2022. This led to bullish investors securing their profits. Conversely, Ethereum, the second most popular cryptocurrency, attained a fresh 11-month high of $2,141, arousing renewed optimism among investors after the successful Shanghai upgrade. ETH is now trading at $2,101, representing a 134 percent surge from its low point in June 2022. Overall, the market appears to be bullish.”\n\nWazirX Vice President Rajagopal Menon said, “Ethereum retained its $2,000+ levels while Bitcoin slid slightly below $30,000 levels which it had retained in the last few days. Potential interest rate hike contributed to the same. Shiba Inu saw a price increase following the launch of the beta version of its Layer 2 network. On WazirX, Cartesi and Celer Network tokens have been the top gainers. Cartesi has introduced a set of new features on its network such as mainnet for Web3 dApps and new initiatives for developer communities across the world.”\n\nSathvik Vishwanath, CEO and co-founder of Unocoin said, “Bitcoin is trading sideways between $29,800 and $30,500, while an upside move above $30,500 could lead to another resistance area of ​​$30,700 or $31,000. Ethereum hit a one-year high of $2,123.”\n\nShivam Thakral, the CEO of BuyUCoin, said, “In a rare development, Ethereum outperformed Bitcoin after witnessing a jump of over 13 percent in the last 24 hours and trading at $2,100.57 level. BTC, on the other hand, is holding strong above the $30,000 mark with a jump of 5.98 percent during the same period. The crypto market continued its upward trend with most of the crypto assets trading in green. In 2023, crypto heavyweights like BTC and Ether are up by 80 percent and 75 percent, respectively, delivering unmatched ROI.”\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9jb3VsZC1iaXRjb2lucy13aGl0ZS1wYXBlci1iZWluZy1mb3VuZC1pbi1tYWNvcy1zcGVsbC1nb29kLXRoaW5ncy1mb3ItY3J5cHRvcy1saWtlLWV0aGVyZXVtLWFuZC1kb2dldHRpL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Apr 2023 07:00:00 GMT",
        "title": "Could Bitcoin's White Paper Being Found In MacOS Spell Good Things For Cryptos Like Ethereum And Dogetti? - Analytics Insight",
        "content": "In an interesting revelation, a blog post by the technologist Andy Baio on the 5th of April unearthed that the original white paper of Bitcoin (BTC) was embedded in every modern version of Apple’s macOS operating system. The cryptocurrency industry is always searching for signs of relevance and importance, so when assessing cryptos like Ethereum (ETH) or Dogetti (DETI), it poses the question of what this means and if it means anything at all.\n\nCryptocurrency’s quest for mainstream acceptance remains an enduring struggle for the industry. But the news that Bitcoin’s white paper has been lurking in plain sight on the operating systems of Apple could be the pendulum-swinger as far as the industry is concerned. Bitcoin is a well-established name but for the rest of the industry, could this mean a growing acceptance? Does Apple’s inclusion of Bitcoin’s white paper signal good things in the future for Ethereum, a widely used coin for its fantastic blockchain technology, or Dogetti (DETI), a new meme-based cryptocurrency that is garnering attention?\n\nBitcoin Found In Every Modern Version Of Apple’s Mac OS\n\nOn the 5th of April, Andy Baio found the original white paper for Bitcoin’s network that had been authored by Satoshi Nakamoto. Baio said that a PDF version of the BTC white paper was included in every copy of MacOS since the release of Mojave in 2018. It was the strangest and most accidental of discoveries as Baio had been attempting to fix his printer and scan a document using a wireless scanner.\n\nBaio used the information to find the file’s location and create easier access to the white paper for others. Baio claimed that the white paper could be found on every version of macOS from Mojave to the current version but not anything that preceded Mojave. He speculated that it might have been included for testing purposes and not end-users.\n\nWhat Does This Mean For Cryptocurrency?\n\nThe temptation to frame this as an endorsement of Bitcoin and other cryptocurrencies by Apple is understandable. It would be a seismic affirmation of cryptocurrency’s importance but this is not necessarily the case. The Bitcoin white paper is available online and has been widely circulated for a long time. Its location within macOS will not necessarily have much of a practical impact such as major price surges.\n\nWhat Are The Upsides Of It?\n\nApple’s inclusion of the Bitcoin white paper, however, does highlight a growing mainstream recognition of cryptocurrency. The inclusion of Bitcoin’s white paper in Apple might not result in much practically immediately for crypto investors, but it does highlight that their industry is increasingly gaining a foothold in key sectors.\n\nIn the future, could we see crypto like Dogetti (DETI) attaining a similar level of mainstream acceptance? It’s possible that it could happen as cryptocurrency gains popularity. Dogetti (DETI) is a meme coin, a popular subcategory within cryptocurrency, that is a decentralised platform belonging to those who hold its DETI tokens. Basing itself on being run as a family, which it evokes through hilarious mafia literature, Dogetti (DETI) could be one of those that benefit from the growing popularity of cryptocurrency.\n\nFor More Information On Dogetti, See Below:\n\nDogetti (DETI)\n\nPresale: https://dogetti.io/how-to-buy\n\nWebsite: https://dogetti.io/\n\nTelegram: https://t.me/Dogetti\n\nTwitter: https://twitter.com/_Dogetti_\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9hbGwtYWJvdXQtZW9zLWV2bS1pdHMtc3RhbmRpbmctYWdhaW5zdC16a2V2bS1hbmQtemtzeW5jLWVyYS1hbmQtbW9yZS_SAV9odHRwczovL2FtYmNyeXB0by5jb20vYWxsLWFib3V0LWVvcy1ldm0taXRzLXN0YW5kaW5nLWFnYWluc3Qtemtldm0tYW5kLXprc3luYy1lcmEtYW5kLW1vcmUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "All about EOS EVM, its standing against zkEVM and zkSync Era, and more - AMBCrypto News",
        "content": "EOS has claimed that its EVM is considerably faster than Polygon and Solana.\n\nThe token’s price increased after the launch, but later registered a decline.\n\nEOS Network Foundation [EOS] recently launched its EOS EVM, an emulation of the Ethereum Virtual Machine, deployed as a smart contract on the blockchain. Ignas, a popular Twitter account that posts insights about DeFi and other crypto spaces, highlighted EOS EVM’s features and capabilities in a 17 April tweet.\n\n1/6 EOS launched the EOS EVM chain. It offers $EOS performance with the resources of the Ethereum community. EOS EVM claims to be 25x faster than AVAX and 3x faster than Solana or Polygon. — Ignas | DeFi Research (@DefiIgnas) April 17, 2023\n\nHow much are 1,10,100 EOSs worth today?\n\nA-Z about EOS EVM\n\nThe EOS EVM runs decentralized applications written in Solidity, the native programming language of Ethereum [ETH]. The solution was developed to tackle the challenges faced by Ethereum developers, such as scalability.\n\nThe blockchain’s new EVM aims to solve this problem by successfully combining the strong performance of the EOS Network with the easily accessible resources of the Ethereum community. The newly launched EVM is designed to complement Ethereum and accelerate the network’s mass adoption.\n\nEOS EVM vs. competitors\n\nIgnas’ tweet mentioned that EOS EVM claims to be 25 times faster than Avalanche [AVAX] and three times faster than Solana [SOL] or Polygon [MATIC]. Better speed can be a key factor in attracting new users. Apart from the speed, ENV committed to investing $20 million in GameFi and EOS EVM projects to further the growth and adoption of EOS. But will it be enough to entice the community?\n\nThe question can be better answered after checking the performance of its competitors, such as Polygon’s zkEVM. As per Dune’s data, zkEVM’s unique depositors have declined sharply, which can be good news for EOS EVM. A similar decline was also noted on zkSync Era’s unique wallet counts, giving EOS EVM an opportunity to grow.\n\nEOS network since EVM launch\n\nIt was interesting to see that on the day of the EVM launch, the blockchain’s network value spiked as its TVL increased. However, the uptrend was short-lived, as it declined over the following days.\n\nDespite the EVM launch, the network’s development activity remained low in April 2023. Nonetheless, EOS remained a topic of discussion in the crypto community as its social volume remained relatively high throughout the last 30 days.\n\nRealistic or not, here’s EOS market cap in BTC’s terms\n\nThe network’s token reaction was positive\n\nSoon after the EVM was released on 13 April, the blockchain’s native token’s price action turned bullish. However, the upward momentum halted soon as its price went down over the coming days.\n\nWhile its price increased, positive sentiments around EOS also spiked. Another good news for the token was its green funding rate, reflecting its demand in the futures market. At the time of writing, the token was trading at $1.21, with a market capitalization of more than $1.3 billion."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2RvZ2V0dGktdG8tam9pbi10aGUtcmFua3Mtb2YtdGhlLXRvcC1jcnlwdG8tcHJlc2FsZXMtYWxvbmdzaWRlLWV0aGVyZXVtLWNhcmRhbm8tYXJrLWFuZC1hbGlhcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Apr 2023 07:00:00 GMT",
        "title": "Dogetti To Join the Ranks of the Top Crypto Presales Alongside Ethereum, Cardano, Ark and Alias. - Analytics Insight",
        "content": "The crypto market has been growing rapidly in recent years, with new coins and projects launching regularly. Some of the top crypto presales include Ethereum (ETH), Cardano (ADA), Ark (ARK) and Alias (ALIAS). Dogetti (DETI) is a new meme coin that’s joining these ranks with one of the most impressive crypto presales ever.\n\nPresale can be the best time to invest, as coins are usually offered below market value, and investors can make a substantial return on their investments. Read on to find out more about these top crypto presales!\n\nNew Meme Coin Dogetti Makes an Impact\n\nDogetti (DETI) is a brand new meme coin approaching the end of its presale. It has already made a big impression in the crypto market and it is set to rival other meme coins. The token planned to launch at stage five of presale, but due to very popular demand from the community it will now launch on June 20th.\n\nDogetti’s whole ecosystem is designed to help users make money with NFTs, a DAO and a community driven approach. Another key feature is the reflection protocol which redistributes 2% of the 6% transaction fee to the community.\n\nThe DAO feature also allows users to have ownership over the project by voting and making proposals to the direction of the project. With a fun mafia theme, everyone’s voice will be heard in the Dogetti family and they’ll generate wealth.\n\nEthereum – Top Platform for dApps\n\nEthereum has one of the most successful crypto launches of all time. Launched in 2015, it has now become the second largest crypto by market capitalization. Ethereum is a leading platform for decentralised applications (dApps) that use smart contracts.\n\nIt captured the interest of the corporate world with an initial coin offering (ICO) of $0.31. Today Ethereum trades for over $1,900 and is nearing $2k, with a market capitalization of over $240 billion, so those who invested early saw an amazing return on their investment.\n\nCardano – Sustainability First\n\nCardano launched in 2017 with a lot of attention as the co-founders of Ethereum founded it. Its native token ADA debuted with a market capitalization of $600 million. Today Cardano is known as one of the largest cryptocurrencies and is best known for using a proof-of-stake blockchain, making it more energy efficient.\n\nToday ADA has a market cap of $14.33 billion and trades for $0.4121.\n\nAlias – Top for Privacy\n\nAlias launched in November of 2016, and is a privacy focused crypto asset. One of the top features is that it can be transferred and received globally with complete anonymity. Alias strives to push the boundaries of what governments around the world are willing to tolerate from digital currencies, but it hasn’t broken into the mainstream.\n\nIt is one of the top crypto presales of all time as they raised $15,500 with an ICO price of $0.001. Alias currently trades for $0.01608, after an all time high of $6.74.\n\nArk – Lightning Fast Network\n\nArk launched in 2016 with the aspiration of giving passionate users a foundation and growing ecosystem. Ark’s platform offers several features including SmartBridge, which makes the ecosystem lightning fast and allows for quick integration of other cryptos into its blockchain.\n\nArk’s ICO launched in November 2016 and finished December 2016 after raising $22 million. Ark currently trades for $0.3326 while the ICO price was $0.00995394.\n\nDogetti is one of the best presales to watch this season as it prepares for launch. With a user-friendly and utility focused ecosystem, all users will be able to access crypto. Head to the website for more information.\n\nFor more information on Dogetti (DETI):\n\nPresale: https://dogetti.io/how-to-buy\n\nWebsite: https://dogetti.io/\n\nTelegram: https://t.me/Dogetti\n\nTwitter: https://twitter.com/_Dogetti_\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmNpdHlhbS5jb20vbWFqb3ItZXRoZXJldW0tdXBncmFkZS1nb2VzLWxpdmUtYW5kLXR3aXR0ZXItc3RhcnRzLWxldHRpbmctdXNlcnMtdHJhZGUtc3RvY2tzLXdpdGgtZXRvcm8tcGFydG5lcnNoaXAv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Apr 2023 07:00:00 GMT",
        "title": "Major Ethereum upgrade goes live, and Twitter starts letting users trade stocks with eToro partnership - CityAM - City A.M.",
        "content": "Major Ethereum upgrade goes live, and Twitter starts letting users trade stocks with eToro partnership\n\nData from CryptoCompare shows that Bitcoin’s price moved significantly at the start of last week, from around $28,000 to a $31,000 high. The cryptocurrency’s price has since corrected to $29,560.\n\nEthereum’s Ether, the second-largest cryptocurrency by market cap, moved steadily up throughout the week, from around $1,850 to reach a $2,1000 high. The cryptocurrency is currently still trading close to that high, at $2,090.\n\nThis week, headlines in the cryptocurrency space were dominated by Ethereum’s highly-anticipated Shapella upgrade, which successfully went live on the cryptocurrency’s mainnet. The upgrade allows for the withdrawal of locked staked ETH, and completes the network’s transition to a Proof-of-Stake system.\n\nThe upgrade has positively impacted the network’s native token Ether. Its major feature was Ethereum Improvement Proposal (EIP) 4895, which brought in staked Ether withdrawals. Along with the withdrawal mechanism, Shapella improved the network’s gas fees for some transactions, as the core team had explained on GitHub before.\n\nStaked ETH can now be withdrawn in two ways: partial and full. Partial withdrawals keep the validators running by automatically distributing the ETH to them, so they have the required 32 ETH balance. Full withdrawals stop the validator and take out the whole staked amount.\n\nEthereum’s upgrade dominated headlines in a week in which it was revealed that last month, the United States experienced its lowest inflation rate in almost two years, as the Consumer Price Index (CPI) declined to 5%, down from 9.1% in June.\n\nDuring the week, Twitter partnered with social trading platform eToro to allow its users to access stocks, cryptocurrencies, and other financial assets. The new feature lets users access these assets through Twitter’s “cashtags” feature, which already gives them real-time trading data access.\n\nThe collaboration adds an option to click a button labeled “view on eToro” that directs them to eToro’s site for buying and selling assets.\n\nNEWS: Twitter partners with eToro to let users trade stocks, crypto. pic.twitter.com/DHvrp6hhqF — T(w)itter Daily News  (@TitterDaily) April 13, 2023\n\nCrypto made another significant step on social media over the week, after the price of Bitcoin started appearing in search results on Douyin, China’s equivalent of TikTok. This could indicate that Beijing is becoming more friendly to crypto and easing its grip on the digital asset space.\n\nDouyin is the most popular short video-sharing app in China, with 700 million people using it every day. The app shows the cryptocurrency price at a time in which Hong Kong started opening its door to crypto and China’s state-owned banks.\n\nBitfinex secures El Salvador’s first digital asset service provider license\n\nWhile cryptocurrencies have been gaining more traction on social media, El Salvador inaugural digital asset service provider license has been granted to popular cryptocurrency trading platform Bitfinex.\n\nThe move follows the January legislation passed by the country’s Legislative Assembly creating a framework for El Salvador to launch Bitcoin-backed “Volcano Bonds.” In September 2021, under President Nayib Bukele’s leadership, El Salvador became the first country to recognize Bitcoin as legal tender.\n\nEl Salvador’s acceptance comes when Binance.US is having trouble finding a new banking partner to enable fiat transactions for its customers in the country. The exchange lost its banking services with the recent collapse Silvergate and Signature Bank, and now relies on intermediary banks to hold funds for it.\n\nMeanwhile, the Bank of England is reportedly looking to establish a team of up to 30 experts to develop a central bank digital currency (CBDC). In February, the UK’s central bank and finance ministry declared their intention to undertake further research and development on a digital version of the pound sterling and called on the public to offer input on the initiative.\n\nIt’s also worth noting that Montenegro’s Central Bank announced a collaboration with fintech company Ripple to explore the feasibility of creating a digital currency for the nation. Montenegro has used the euro as its currency since its introduction in 2022, even though it’s not a part of the Eurozone.\n\nFTX’s legal bills show progress\n\nOver the week, legal bills have revealed that collapsed cryptocurrency exchange FTX, under the leadership of newly appointed CEO John J Ray III, is contemplating reviving the trading platform to recover for its customers and creditors. Legal bills show progress on that task.\n\nWith the assistance of legal counsel from the prestigious law firm Sullivan & Cromwell LLP, FTX is examining the tax implications, cybersecurity concerns, and user experience aspects associated with a potential relaunch. The firm’s February invoice for these exploratory efforts totaled $13.5 million.\n\nFrancisco Memoria is a content creator at CryptoCompare who’s in love with technology and focuses on helping people see the value digital currencies have. His work has been published in numerous reputable industry publications. Francisco holds various cryptocurrencies.\n\nFeatured image via Unsplash."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZmluYm9sZC5jb20vZXRoZXJldW0tcmFpbmJvdy1jaGFydC1zZXRzLWV0aC1wcmljZS1mb3ItZW5kLW9mLTIwMjMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Rainbow chart sets ETH price for end of 2023 - Finbold - Finance in Bold",
        "content": "After the Shanghai and Capella upgrades, jointly called Shapella, enabled Ethereum (ETH) unstaking for the first time since ETH staking was introduced in December 2020, its price surpassed the $2,000 psychological threshold and remained stable, leaving investors to try and gauge its future movements.\n\nIn doing so, some cryptocurrency traders use BlockchainCenter’s rainbow price chart for Ethereum to follow the digital asset’s historical movements in relation to various moving averages (MA), which may help in recognizing certain trends and allow people to make investing decisions.\n\nCurrently, the rainbow chart suggests that Ethereum is in the ‘Fire Sale’ phase, which is indicated by the purple color and ranges between $0 and $2,320, as it is trying to break upwards into the ‘Undervalued’ zone (blue), which stands between $2,320 and $3,282, according to the data retrieved by Finbold on April 18.\n\nEthereum rainbow price chart. Source: BlockchainCenter\n\nAs opposed to the Bitcoin (BTC) rainbow chart, which suggests trends up to 2035, Ethereum’s (for now) only allows users to observe possible trends for the next several months – until October 2023 – but one can still make educated guesses based on its earlier chart patterns.\n\nEnd-of-year projections\n\nSpecifically, Ethereum was last in the ‘Fire Sale’ zone in July 2020, from which it took almost a year (until May 2021) to peak in the ‘But have we *earned* it’ zone at $4,354. Today, this zone for ETH ranges between $14,625 and $21,231, and it may not happen until February 2024 if the chart patterns repeat themselves.\n\nBefore that, Ethereum was in the ‘Fire Sale’ area only once – in October 2015, soaring to the ‘Go back to BTC?’ zone four months later. That said, this bullish rally was followed by a drop toward the ‘Undervalued’ area, which it reached in January 2017. However, ETH crossed the barrier for ‘Maximum Bubble Territory’ in May 2017, staying there interchangeably with the ‘Go Back to BTC?’ until August 2018.\n\nIf this pattern is to happen again, it would mean that Ethereum could soar to the ‘Go back to BTC?’ in August 2023 (currently between $21,231 and $30,654), then drop to the ‘Undervalued’ in September 2024 (currently between $2,320 and $3,282), before skyrocketing in January 2025 in the ‘Maximum Bubble Territory’ ( $30,654 and beyond).\n\nEthereum price analysis\n\nAs things stand, Ethereum is currently changing hands at the price of $2,104.50, which demonstrates an increase of 0.56% on the day, adding up to the positive weekly change of 10.19% and an 18.94% gain in the last month, as the asset is holding on to the nearly 80% increase it achieved since the year’s turn.\n\nEthereum year-to-date (YTD) price chart. Source: Finbold\n\nAll things considered, the most bullish rainbow chart scenario for Ethereum sees it surpassing $21,231 in August. On the other hand, $14,625 is possible, but not before February 2024. However, it is important to keep in mind that the situation in the crypto sector can change quickly and depends on more outside factors than just chart patterns.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    }
]