[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDUvMTIvZXRoZXJldW0tcmVzdW1lcy1maW5hbGl6aW5nLWJsb2Nrcy1hZnRlci1zZWNvbmQtcGVyZm9ybWFuY2UtaGljY3VwLWluLTI0LWhvdXJzL9IBfGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDUvMTIvZXRoZXJldW0tcmVzdW1lcy1maW5hbGl6aW5nLWJsb2Nrcy1hZnRlci1zZWNvbmQtcGVyZm9ybWFuY2UtaGljY3VwLWluLTI0LWhvdXJzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Ethereum Resumes Finalizing Blocks after Second Performance Hiccup in 24 Hours - CoinDesk",
        "content": "The incident – the cause of which remains a matter of speculation – sparked major security concerns for users of the second-largest blockchain by market capitalization. According to the Ethereum Foundation, when blocks are not being finalized, it is possible that pending transactions might be re-ordered or dropped from the network."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiMmh0dHBzOi8vY29pbmpvdXJuYWwubmV0L2V0aGVyZXVtL3doYXQtaXMtZXRoZXJldW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "What is Ethereum & How Does it Work? ETH for Beginners - CoinJournal",
        "content": "What Teams Are Working on Ethereum Development\n\nCurrently, the largest project for the Ethereum blockchain is ETH 2.0 which is being led by Raul Jordan. It’s going to make fundamental changes to the blockchain itself including the shift from Proof of Work (PoW) to the Proof of Stake (PoS) protocol. Including Raul’s team, there are a total of 8 teams working on different projects across the globe.\n\nPegaSys\n\nLed by Faisal Khan, the primary goal of this team is to bring enterprises to the blockchain by developing powerful and compelling software that’s more affordable, easier, and convenient to adapt for different types of businesses.\n\nChainSafe\n\nWorking out of Toronto, ChainSafe is a research and development firm that offers blockchain consultation to projects that are based on Ethereum such as Polymath, Aion, Shyft, and Bunz. It is led by Mikerah Quintyne-Collins.\n\nParity Technologies\n\nIt’s a blockchain infrastructure firm with the aim to maintain the second most popular client Parity Ethereum on the blockchain. It is considered to be one of the most advanced and fastest clients by many.\n\nHarmony\n\nThis team has been subsidised by the Ethereum Foundation to create the complete specification for the 2.0 update. The team is functioning under GPL or General Public License to ensure all the code implementations remain free.\n\nPrysmatic Labs\n\nUsing the programming language Go, this team created the first variant of Ethereum 2.0 and is currently providing the required help to the blockchain to acquire sustainable scalability. The team is led by Raul Jordan.\n\nTrinity\n\nIt is the current Python-based Ethereum client featuring six developers who are in contract with the foundation. The team is also working on building support for 2.0 specifications.\n\nStatus\n\nAnother team that’s funded by Ethereum Foundation to develop a mobile browser and messaging platform to increase user engagement. The main objective is to ensure mass adoption by optimising performance on less resourceful devices.\n\nSigma Prime\n\nSubsidised by Ethereum Foundation, Sigma Prime is a blockchain technology and information security consultation company that has been tasked with developing an Ethereum 2.0 client named Lighthouse."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V0aGVyZXVtLWZpbmFsaXR5LWhpY2N1cC1kZWNlbnRyYWxpemF0aW9u0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Ethereum Finality Hiccup a 'Fire Drill' That 'Could Have Been Avoided' - Blockworks",
        "content": "The Ethereum network suffered a hiccup Thursday; one that developers are still parsing for clues. But as a user, you would hardly have noticed.\n\nAt worst, it would have taken slightly longer for a transaction to be included in a block, and there was a somewhat lower certainty that a given action would be considered final — for about 25 minutes.\n\nThe blockchain’s developer community saw the incident as a strong test of the network’s resilience. It also served as further impetus to increase diversity of the independent software clients that make Ethereum run.\n\nThe extent of Ethereum’s client diversity is unique among major blockchains, and a cause championed by members of the community such as the pseudonymous Superphiz — known as the “Ethereum community health consultant” — who was one of the first to notice the issue.\n\n“Barely a blip happened, but it was so uncharacteristic for the Ethereum network that it was a big deal anyway,” he tweeted Friday.\n\nThe same issue resurfaced again Friday, which Superphiz called, “not surprising,” adding, these things tend to happen in waves.\n\nWhat happened?\n\nThe precise cause is not yet known, but the effect was a failure to finalize blocks. It’s likely to have involved a coincidence of “two or three issues,” according to Irina Timchenko, Ethereum blockchain manager at Everstake.\n\n“During the incident, validators experienced issues with Prysm and Teku nodes. Some of these issues were resolved after a restart, while others returned to normal without requiring a restart,” Timchenko told Blockworks.\n\n“Subsequently, validators noticed a spike in CPU usage, which appears to be a second-order effect rather than the root cause of the problem,” she added.\n\nAccording to a Prysm developer known as Potuz, “several valid, but untimely attestations were broadcast in the network. This typically happens when a node that is struggling to be synced, attests with an old view of the chain.”\n\nLoading Tweet..\n\nA fix is already in the works, which has become more urgent since the problem has recurred.\n\nLoading Tweet..\n\nTimchenko and others say the loss of finality could have been avoided entirely if less than a third of all validators ran the same consensus layer software client. Currently, two clients, Prysm and Lighthouse, are estimated to be operating on greater than a third of Ethereum nodes, according to clientdiversity.org.\n\nFreddy Zwanzger, Ethereum ecosystem lead at Blockdaemon agrees.\n\n“The fact that Ethereum does have multiple client implementations actually seemed to have prevented the blockchain from halting, and if all consensus clients would have less than 33% of the network, the finalization delay would also have been avoided,” Zwanzger told Blockworks.\n\nSince blocks were still being produced, transactions were processed continuously, which is why end users didn’t see much, if any, effect, he added.\n\nLiveness over safety\n\nIn designing blockchains with proof-of-stake consensus, developers have to make choices over how to prioritize one of two properties: safety and liveness.\n\nColloquially, safety is thought of as “avoiding bad things.” That means every node in the network agrees consistently on the state of the chain.\n\nEthereum prioritizes liveness, which is thought of as “good things happen eventually.” The blockchain is designed to be very difficult to halt.\n\nLoading Tweet..\n\nIt could have been worse if Prysm were still installed on upwards of 66% of nodes, which has been the case in the past.\n\nWhen a consensus layer client causes a loss of finality — which is what happened Thursday — the network averts a fork (a “bad thing” in this case) so long it doesn’t have a supermajority client. But liveness was impacted because Prysm remains above the 33% threshold.\n\nEthereum’s specific consensus algorithm, called Gasper, saved the day, according to Gaetan Semp, a blockchain and DeFi consultant at Alyra.\n\n“Gasper is truly an amazing consensus algorithm,” he tweeted, noting that even without a supermajority of nodes, the blockchain continued to be validated by LMD-Ghost, a “weaker ‘short-term consensus’ as venture firm Paradigm has called it. LMD is short of “Latest Message Driven” and LMD-Ghost is part of Ethereum’s “fork-choice rule.”\n\nThis is a trade-off, however, and one which not all users would approve of, Matt Fiebach of Blockworks Research noted.\n\n“Without the ability for nodes to reach consensus and achieve transaction finality, a user cannot be sure that their transaction will be included in the Ethereum canonical chain,” Fiebach said.\n\nAlternative architectures from Solana and Cosmos favor a chain halt to preserve safety. “A 30-minute loss of finality is unacceptable for end users because it puts transactions at risk of being reverted,” Richard Patel, a software developer for Firedancer, tweeted in response to the Ethereum glitch.\n\nFiredancer, developed by Jump Crypto, will soon become the first independent client for Solana.\n\nVance Spencer, co-founder at Framework Ventures described the failure to finalize as “a significant event,” but one with “a lot of nuance.”\n\n“Finalization is especially important for entities like exchanges which need to ensure on-chain transactions aren’t reverted after they process them off-chain,” Spencer told Blockworks.\n\nA resilience test\n\nMarius van der Wijden, who develops the Go Ethereum (or Geth) execution layer client for Ethereum, called the incident “a great fire drill” and explained that having client diversity was key to the ability of the network to heal itself.\n\n“The different implementations react slightly [differently] to extreme scenarios which provides a huge boost in reliability,” van der Wijden told Blockworks. “Having different implementations means we can test [them] against each other, which can help us quickly pinpointing issues and determining the root cause of an issue,” he added.\n\nVan der Wijden was confident that proof-of-work consensus algorithms would have performed “much worse” under the circumstances.\n\nIndustry observers, such as Fabrice Cheng, co-founder and CEO at Quadrata, sounded an optimistic note about the long-term prospects of the Ethereum network, coming out of this affair.\n\n“Even when over 60% of all nodes went offline, the longest time you had you wait for your transaction to be included was [1 minute and] 24 seconds,” he said.\n\nFriday’s recurrence was more severe, but developers note that block production continues unabated.\n\nLoading Tweet..\n\nUpdated May 12, 2023, at 5:11 pm ET: Additional detail and comments.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vYmxvZy5rcmFrZW4uY29tL25ld3MvZXZlcnl0aGluZy15b3UtbmVlZC10by1rbm93LWFib3V0LXRoZS1ldGhlcmV1bS1jYW5jdW4tdXBncmFkZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Everything you need to know about the Ethereum Cancun upgrade - Kraken Blog",
        "content": "Ethereum Cancun-Deneb (Dencun) is the next planned upgrade to the Ethereum blockchain. The upgrade will improve the scalability, security, and usability of the Ethereum network.\n\nCancun represents an additional upgrade to Ethereum’s execution layer following the recent activation of Shanghai. This first step went live at epoch 194048, on April 12. Deneb represents the upgrade to Ethereum’s consensus layer.\n\nThe Cancun fork includes the highly anticipated Ethereum Improvement Proposal (EIP) 4844 , “Proto-Danksharding.” This feature is a milestone that lays the important groundwork for full Danksharding implementation.\n\nCommenting on the importance of Proto-Danksharding, Ethereum core developer Péter Szilágyi stated, “I kind of feel that 4844 should be the thing that everybody focuses on, and the rest is ‘nice to have.'”\n\nThis latter part will take several years before it’s ready to ship. Proto-Danksharding will act as an intermediate upgrade to help scale rollups on the network.\n\nNo specific date has been given for the Cancun upgrade, but it’s anticipated to go live in the second half of 2023.\n\nOther EIPs that may or may not appear in the Cancun upgrade include :\n\nEIPs 4758 , 6046 , 6190 : SELFDESTRUCT removal\n\n, , : SELFDESTRUCT removal EIP-663 : Unlimited SWAP and DUP instructions\n\n: Unlimited SWAP and DUP instructions EIP-5920 : PAY opcode\n\n: PAY opcode EIP-1153 : Transient storage\n\n: Transient storage EIP-2537: Precompile for BLS12-381 curve operations\n\nPrecompile for BLS12-381 curve operations EIP-4788 : Beacon state root in EVM\n\n: Beacon state root in EVM EVMMAX EIP-6601 & EIP-6690\n\n& Simple Serialize (SSZ) changes: EIP-6493 SSZ signature scheme EIP-6465 EIP-6404 / EIP-6466\n\n\n\nWhat is Danksharding?\n\nDanksharding is the third and final part of the ETH2/ Serenity upgrade, after the successful roll out of the Beacon chain and The Merge. The newly-designed, simplified sharding architecture will completely replace the project’s initially proposed idea of introducing 64 shard chains.\n\nInstead of allowing for more transactions, Danksharding focuses on increasing data availability for rollups.\n\nRollups are a Layer 2 technology that bundles together blockchain transactions and processes them off-chain. Any rollup operator can process a batch of transactions and submit the results or a proof to the main chain.\n\nDepending on the specific rollup technology used—Optimistic or Zero Knowledge (ZK)— other validators in the network or a smart contract review the results.\n\nOptimism, Arbitrum, zkSync Era, and Loopring are examples of popular Ethereum Layer 2 scaling protocols that use rollups.\n\nTo help kickstart the network’s long transition over to full Danksharding, EIP-4844 will introduce many of its key execution layer components this year.\n\nWhat is Proto-Danksharding?\n\nProto-Danksharding is an interim upgrade to the Ethereum network proposed by Ethereum developers Protolambda and Dankrad Feist.\n\nOn the EIP-4844 FAQ page, Ethereum co-founder Vitalik Buterin describes Proto-Danksharding as a “stopgap” solution that will dramatically reduce rollup gas fees ahead of full sharding implementation.\n\nShard blob transactions\n\nEIP 4844 introduces a transaction type called “blob-carrying transactions.”\n\nA blob is an abbreviated term for “binary large objects” and represents a 125 Kilobyte payload of data.\n\nTo create a blob-carrying transaction, rollups submit their data to blobs and attach them to blocks.\n\nA single blob-carrying transaction can contain up to two blobs. To encourage the uptake of these transactions, the upgrade will implement a multi-dimensional EIP-1559 fee market. This feature will introduce a variable gas fee for blob-carrying transactions based on supply and demand.\n\nThe main benefit of blob-carrying transactions is cost-effectiveness.\n\nRollups currently store transaction data permanently on Ethereum’s blockchain via Calldata. Blob data, however, works out much cheaper than Calldata because it isn’t committed to the execution layer (the Ethereum Virtual Machine). Nor does it exist on the execution layer forever. Instead, Beacon nodes store them at the consensus layer, and after one month to a year, the blobs are deleted. You can think of it as clearing cached data from your laptop or device.\n\nA polynomial commitment scheme called a KZG (named after its creators Kate, Zaverucha, and Goldberg) will verify transaction data posted in blobs. Like other zero knowledge proof systems, KZG allows for verification without revealing the entire contents of a blob.\n\nWhat does the Cancun upgrade achieve? The overarching goal of the Cancun upgrade is to continue preparing the network for full data sharding, while scaling rollups in the interim. The introduction of blob-carrying transactions will increase data availability for rollups and make them considerably cheaper. EIP 4844 will also include most of the execution layer logic and groundwork for full sharding. This step will greatly reduce the implementation work needed later down the line. After Cancun activates, Ethereum users should expect faster, cheaper payments when using the ecosystem’s native cryptocurrency, applications, and ERC-based tokens."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ldGhlcmV1bS1uZXR3b3JrLXN1ZmZlcnMtZmluYWxpdHktaXNzdWVzLTIyMDMzNjI3Mi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Ethereum Network Suffers Finality Issues—Here's What That Means - Yahoo Finance",
        "content": "Ethereum, the world’s second largest blockchain by cryptocurrency market cap, suffered a technical issue on Friday, causing its network to halt finalizing blocks for more than an hour.\n\nFinality takes roughly 15 minutes, and refers to the guarantee that a block cannot be altered or removed from the blockchain without burning at least 33% of the total staked ETH, according to the Ethereum Foundation.\n\nThe network lost finality for roughly an hour midday Friday, in what appears to be the second issue of its kind in 24 hours. On Thursday, blocks were being proposed but not validated during a 25-minute window on Thursday.\n\nEthereum Staking Deposits Outpace Withdrawals by $189M in ETH\n\nThe cause of these outages still remains unclear, which has spurred many in the crypto community to take to social media to discuss and try to figure out what went wrong.\n\nProminent venture capitalist and Ethereum supporter Adam Cochran tweeted out: “ETH beacon chain finality has now failed for over an hour, we’re at inactivity leak time and there is no denying this is now a liveness fault. Hoping that this is just an implementation issue for a single client to fix and not a larger protocol issue… either way, not good.\"\n\n1/2 Eth beacon chain finality has now failed for over an hour, we’re at inactivity leak time and there is no denying this is now a liveness fault. Hoping that this is just an implementation issue for a single client to fix and not a larger protocol issue… either way not good https://t.co/b8EBi972NJ — Adam Cochran (adamscochran.eth) (@adamscochran) May 12, 2023\n\nOthers, however, aren’t so concerned. Ethereum core developer Eric Conner said on Twitter that the network “did not go down,” but rather that there was a bug in some clients that has already been fixed.\n\nStory continues\n\nThe finality issue, regardless of its origin or duration, remains controversial. Despite transactions appearing to process, the fact they don’t get finalized can mean they can potentially be re-ordered or simply ignored.\n\nPseudonymous Ethereum builder Superphiz tweeted a contradictory warning claiming that the second wave was over, but for users to expect a third.\n\n“But don’t worry too much,\" he said. \"As bad as this looks, the chain keeps going and eventually finalizes.”\n\nAs of this writing, the network is up and running again at full capacity, with blocks being finalized, although users and developers remain on alert."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjMwNjgwL2V0aGVyZXVtLWJlYWNvbi1jaGFpbi1maW5hbGl0eS1pc3N1ZdIBTGh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL2FtcC9wb3N0LzIzMDY4MC9ldGhlcmV1bS1iZWFjb24tY2hhaW4tZmluYWxpdHktaXNzdWU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Ethereum's beacon chain suffers another finality issue - The Block",
        "content": "The Ethereum network appears to have suffered another technical snag that kept transaction finality from happening for about an hour on Friday. The issue drew fresh concerns about the stability of the network, as it came less then 24 hours after a similar event yesterday.\n\nLike on Thursday, data sources for Ethereum network activity show that the issue was experienced by validators, which propose attestations as the network processes transactions. Ethereum epochs 200,750 thru 200,758 saw a significant reduction in the number of attestations received, according to Data provider Beaconcha.in.\n\n\"Ethereum’s Beacon Chain stopped finalizing transactions for roughly an hour,\" The Block research director Steven Zheng said. \"It is currently unclear what the reason is behind the halts but some people think it was due to some bugs in staking clients or MEV infrastructures.\"\n\n\"While transactions did not stop on Ethereum they were not finalized which meant the chance of transactions being reverted were higher than if things worked as intended,” Zheng continued.\n\n'Ethereum did not go down yesterday'\n\nPrysmatic Labs co-founder Preston van Loon said that the issue on Thursday appeared to involve something that \"happened to cause several client implementations to work really hard to keep up with the chain.\"\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nAs the outage seemed to reappear on Friday, he tweeted that \"we've tagged v4.0.4-rc.0 for Prysm which has the fix, but we haven't had time to test it thoroughly.\"\n\n\"We have identified a few areas where Prysm could perform better in a scenario like we saw yesterday in Ethereum mainnet and we are preparing to release these improvements as fast as safely practical,\" he said on Friday, before the issue seemed to reappear.\n\nHe pushed back against worry that the entire protocol had failed.\n\n\"To clarify: Ethereum did not go down yesterday,\" he wrote on Twitter. \"Blocks weren't even close to being full, despite limited block capacity. You could have transacted during the epochs struggling to finalize, there was plenty of block space when blocks were produced.\""
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2V0aGVyZXVtLWZhaWxlZC10by1maW5hbGl6ZS10cmFuc2FjdGlvbnMtZm9yLTI1LW1pbnV0ZXMtYnV0LWF2b2lkZWQtZnVsbC1vdXRhZ2Uv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Ethereum failed to finalize transactions for 25 minutes but avoided full outage - CryptoSlate",
        "content": "The Ethereum blockchain failed to finalize transactions for slightly less than half an hour, developers said on May 11.\n\nThe incident lasted for approximately 25 minutes, and Ethereum contributor terence.eth said that the issue has now been solved. He wrote:\n\n“Mainnet has been finalized, and we are investigating the incident now. More to come!”\n\nEthereum contributor Superphiz said that although Ethereum’s beacon chain stopped finalizing, the blockchain is “designed to be resilient” against such issues. The chain continued to partially process transactions during the incident.\n\nThough the cause is still unknown, Superphiz suggested that the issue may have resulted from a lack of diversity of clients. He said that loss of finality could have been avoided if no client had more than one-third dominance over the network. He added that the blockchain avoided forking because no client had a supermajority.\n\nCurrently, two consensus clients — Lighthouse and Prsym — dominate Ethereum, each with 38% dominance. Only three other clients have a notable presence.\n\nEthereum has experienced other outages in the past: it experienced a DDOS attack in 2016 and saw partial Infura-related outages in November 2020. In 2016, an attack on The DAO also greatly affected Ethereum.\n\nusechatgpt init success"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vZGVjcnlwdC5jby8xMzk5NjEvZXRoZXJldW0tbmV0d29yay1zdWZmZXJzLWZpbmFsaXR5LWlzc3Vlcy1oZXJlcy13aGF0LXRoYXQtbWVhbnPSAV5odHRwczovL2RlY3J5cHQuY28vMTM5OTYxL2V0aGVyZXVtLW5ldHdvcmstc3VmZmVycy1maW5hbGl0eS1pc3N1ZXMtaGVyZXMtd2hhdC10aGF0LW1lYW5zP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Ethereum Network Suffers Finality Issues—Here’s What That Means - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum, the world’s second largest blockchain by cryptocurrency market cap, suffered a technical issue on Friday, causing its network to halt finalizing blocks for more than an hour.\n\nFinality takes roughly 15 minutes, and refers to the guarantee that a block cannot be altered or removed from the blockchain without burning at least 33% of the total staked ETH, according to the Ethereum Foundation.\n\nThe network lost finality for roughly an hour midday Friday, in what appears to be the second issue of its kind in 24 hours. On Thursday, blocks were being proposed but not validated during a 25-minute window on Thursday.\n\nAD\n\nAD\n\nThe cause of these outages still remains unclear, which has spurred many in the crypto community to take to social media to discuss and try to figure out what went wrong.\n\nProminent venture capitalist and Ethereum supporter Adam Cochran tweeted out: “ETH beacon chain finality has now failed for over an hour, we’re at inactivity leak time and there is no denying this is now a liveness fault. Hoping that this is just an implementation issue for a single client to fix and not a larger protocol issue… either way, not good.\"\n\n1/2 Eth beacon chain finality has now failed for over an hour, we’re at inactivity leak time and there is no denying this is now a liveness fault. Hoping that this is just an implementation issue for a single client to fix and not a larger protocol issue… either way not good https://t.co/b8EBi972NJ — Adam Cochran (adamscochran.eth) (@adamscochran) May 12, 2023\n\nOthers, however, aren’t so concerned. Ethereum core developer Eric Conner said on Twitter that the network “did not go down,” but rather that there was a bug in some clients that has already been fixed.\n\nThe finality issue, regardless of its origin or duration, remains controversial. Despite transactions appearing to process, the fact they don’t get finalized can mean they can potentially be re-ordered or simply ignored.\n\nAD\n\nAD\n\nPseudonymous Ethereum builder Superphiz tweeted a contradictory warning claiming that the second wave was over, but for users to expect a third.\n\n“But don’t worry too much,\" he said. \"As bad as this looks, the chain keeps going and eventually finalizes.”\n\nAs of this writing, the network is up and running again at full capacity, with blocks being finalized, although users and developers remain on alert."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vdW5jaGFpbmVkY3J5cHRvLmNvbS9ldGhlcmV1bS1zdG9wcGVkLWZpbmFsaXppbmctdHJhbnNhY3Rpb25zLWZvci0yNS1taW51dGVzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Ethereum Stopped Finalizing Transactions for 25 Minutes - Unchained - Unchained",
        "content": "The Beacon Chain recovered after an unidentified issue led to transactions not being fully confirmed.\n\nEthereum core developers are yet to pinpoint the root cause behind the network’s failure to confirm transactions.\n\nOn Thursday evening, several users of the Ethereum blockchain reported that their transactions were only partially processed on the Beacon Chain. The network’s core developers tweeted shortly after confirming that the network was having trouble finalizing transactions and the issue was being investigated.\n\nFinality has been restored. We do not know the root cause yet, but something happened to cause several client implementations to work really hard to keep up with the chain. — prestonvanloon.eth (@preston_vanloon) May 11, 2023\n\nAround 25 minutes later, the mainnet resumed finalizing blocks, but the reason behind the brief disruption remained unknown. In this instance, the issue seemingly fixed itself without any developer intervention.\n\nTerence Tsao, co-founder of Ethereum Proof-of-Stake client Prysm, issued an update on Twitter, saying the team had identified areas where state caching could be improved so that nodes perform better during periods of degradation, like the one witnessed earlier in the day.\n\n“Given the chain has stabilized, as a staker / node operator, there’s no action required moment,” he said.\n\nMarius van der Wijden, another Etheruem developer, described the event as a “great firedrill” for the network.\n\n“It looks like two or three issues came together (as its often the case). The chain recovered gracefully and we discovered a few other issues that could be improved to make Ethereum more resilient,” he said on Twitter.\n\nOne of the dangers of the chain not finalizing is that the network could enter a so-called “inactivity leak” mode, where validators are penalized for not participating. Fortunately, the issue was resolved before it got to this stage, which was likely one or two epochs of non-finality away, according to Ethereum developer Ben Edgington."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiMWh0dHBzOi8vdGhlZGVmaWFudC5pby9ldGhlcmV1bS1nYXMtZmVlcy1sb3ctbGV2ZWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Ethereum Gas Fees Fall to Lowest Level in Two Years - The Defiant - DeFi News",
        "content": "Sharp Decline May Cast Doubt on Summer Rally\n\nBy: Samuel Haig • Loading...\n\nDive\n\nWith network activity plunging, Ethereum’s transaction fees are now at their lowest level since the heady days of ‘DeFi Summer’ in mid-2020, according to data from Ycharts.\n\nEthereum’s average fees are at their lowest level in two years, with transactions executing for less than 13 gwei a pop.\n\nSummer Rally\n\nThe sharp decline in on-chain activity may also cast doubt on the bullish signal that’s been driving a summer rally in Ethereum and other DeFi names: The Merge.\n\nInvestors may have to reckon with the likelihood that more Ether may not be destroyed than new coins are issued after the network shifts to Proof-of-Stake consensus in September.\n\nIn August 2021, Ethereum’s EIP-1559 upgrade went live, introducing the burning of base transactions fees. From then on, a portion of each Ethereum transaction fee is permanently destroyed.\n\nThe Merge\n\nCoupled with the rapidly approaching Eth2 Proof of Stake chain-merge, many analysts tipped the network to become deflationary — meaning more Ether is removed from supply through burning than is created as validator rewards — after The Merge is executed next month.\n\n\n\nBut with network activity plummeting amid the bear trend, Ethereum’s deflationary narrative is currently looking uncertain. Demand for block space must increase by roughly one-third from current levels in order for the burn rate to keep pace with post-merge Ether issuance.\n\nEthereum’s transaction fees are now at their lowest level since decentralized finance began to attract a significant user base during the ‘DeFi Summer’ of mid-2020. According to Ycharts, average daily transaction fees are currently around 12.5 gwei, its lowest level since April 2020.\n\nEthereum average transaction fees. Source: Ycharts\n\nDeFi Alpha Premium Content DeFi Daily | Weekdays\n\nDeFi Alpha Letter | Weekly\n\nDefiant Podcast Transcript | Weekly\n\nInbox Dump | Saturday\n\nWeekly Recap | Sunday Looking for Alpha? Become a premium member of The Defiant and join our DeFi Alpha community. Start for free\n\nGas fees are also falling to low single-digits during off-peak hours, with transactions executing for as little as 4 gwei.\n\nThe recent drop in on-chain activity has dramatically driven down Ethereum’s burn rate with it. According to Ultra Sound Money, a website tracking Ethereum’s burn rate, just 7,440 ETH was destroyed over the past seven days — its lowest level since EIP-1559 went live last year.\n\nBy contrast, the burn-rate peaked in January amid the top of the NFT bubble, when more than 12 ETH was burned every minute, equating to 121,000 per week.\n\nEthereum weekly burn-rate. Source: Ultra Sound Money\n\nThe Merge will unify the Eth2 Proof of Stake Beacon Chain with the current Ethereum mainnet execution layer next month. The upgrade has been tipped to usher in a more than 99% improvement in the network’s energy efficiency and a 90% decrease in new Ether issuance.\n\nWhile many analysts are still tweeting that Ethereum will become deflationary when the upgrade goes live, the recent drop in network activity is challenging this hypothesis.\n\nBurn Rate\n\nThe current burn-rate would offset two-thirds of Ether issuance after The Merge, according to Justin Drake, a researcher at the Ethereum Foundation. In a recent appearance on The Defiant Podcast, Drake predicted that 1,600 ETH will be issued daily once Ethereum has transitioned to Proof of Stake, equal to 11,200 Ether each week.\n\nEthereum’s burn rate will change over time, steadily increasing as stakers lock up ETH to run a node and become a network validator.\n\nSpeaking during the fifth EthCC conference in July, Vitalik Buterin, Ethereum’s co-founder and chief scientist, said that new Ether will be issued annually at the complicated rate of 166 times the square root of the number of staked ETH.\n\nThis means that if 1M ETH is staked, 166,000 new Ether will enter into circulation each year, but if 100M ETH is staked, issuance will only be increased to 1.66M Ether.\n\nAccording to Staking Rewards, nearly 13,15M ETH or 10.8% of circulating Ether is currently locked up for staking, According to Buterin’s equation, 1,649 new ETH would be issued daily under Proof of Stake, equal to 11,543 Ether weekly.\n\nDespite The Merge not yet taking effect, Ethereum has already produced 26 days of deflationary issuance since transaction fee burning was introduced.\n\nNFT Activity\n\nEthereum has posted two full weeks of deflationary issuance so far, according to data from Watch The Burn. The first week occurred at the end of October towards the peak of the broader digital asset markets, with surging NFT activity driving the second week of negative issuance in January.\n\nThe largest daily burn on record occurred on May 1 as fees soared amid the extreme gas wars surrounding Yuga Labs’ Otherdeeds NFT land sale. More than 58,000 Ether were destroyed in a single day, worth nearly $160M at the time.\n\nEthereum’s deflationary days. Source: Watch The Burn\n\nEthereum’s most recent deflationary day was posted on May 12, when 5,391.66 ETH was permanently removed from supply."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA1LzExL2V0aGVyZXVtLWNvdWxkLWJlLWhlYWRpbmctdG8tb3Bwb3J0dW5pdHktem9uZS1hbWlkLW9uZS1oaXN0b3JpY2FsbHktYmVhcmlzaC1zaWduYWwtc2FudGltZW50L9IBggFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNS8xMS9ldGhlcmV1bS1jb3VsZC1iZS1oZWFkaW5nLXRvLW9wcG9ydHVuaXR5LXpvbmUtYW1pZC1vbmUtaGlzdG9yaWNhbGx5LWJlYXJpc2gtc2lnbmFsLXNhbnRpbWVudC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Ethereum Could Be Heading to ‘Opportunity Zone’ Amid One Historically Bearish Signal: Santiment - The Daily Hodl",
        "content": "One metric indicates Ethereum (ETH) could be heading into an “opportunity zone,” according to the crypto analytics firm Santiment.\n\nThe firm notes in a new analysis that ETH’s 30-day market value to realized value (MVRV), which traders use to detect overbought or oversold conditions, is now out of the “danger zone” and headed towards the “opportunity zone,” an area where ETH prices have historically bottomed out.\n\nMVRV is the ratio of an asset’s current market cap divided by its realized capitalization – i.e. the value of all measured ETH at the price they were bought. MVRV 30-Day is a timebound metric that only analyzes that ratio among tokens that have moved at least once in the past 30 days.\n\nSantiment also notes that ETH’s recent local price top coincided with the Ethereum Foundation moving 14,999 ETH to the crypto exchange Kraken over the weekend.\n\n“With the ETH foundation moving 14,999 coins to Kraken, an argument can be made that this move perfectly coincided with Ethereum’s local price top. Our insight covers the massive surge in active deposits & potential dip buy opportunities coming up.”\n\nThe last three times a significant amount of ETH left the Ethereum Foundation wallet, it marked local price tops, according to the analytics firm. Santiment does clarify, however, that Ethereum Foundation transactions prior to that did not indicate price tops.\n\nEthereum is trading at $1,831 at time of writing. The second-ranked crypto asset by market cap is up 1.86% in the past 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDUvMTEvbWVldC1kZW5jdW4tZXRoZXJldW0tZGV2ZWxvcGVycy1hcmUtYWxyZWFkeS1wbGFubmluZy1uZXh0LWhhcmQtZm9yay_SAXFodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA1LzExL21lZXQtZGVuY3VuLWV0aGVyZXVtLWRldmVsb3BlcnMtYXJlLWFscmVhZHktcGxhbm5pbmctbmV4dC1oYXJkLWZvcmsvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Meet ‘Dencun.’ Ethereum Developers Are Already Planning Next Hard Fork - CoinDesk",
        "content": "As for the full scope of what Dencun will look like? That’s to be determined over the next few weeks. The developers are testing out other EIPs before they solidify what other proposals will make it into the next big hard fork."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JlYWNvbi1jaGFpbi10ZW1wb3JhcmlseS1zdG9wcy1maW5hbGl6aW5n0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Ethereum's Beacon Chain Temporarily Stops Finalizing: Chain Consultant - Blockworks",
        "content": "Ethereum’s Beacon Chain temporarily stopped finalizing Thursday, according to a community health consultant of the blockchain.\n\nThe incident occurred at roughly 4 pm ET, according to tweets by the pseudonymous superphiz.eth.\n\n“I don’t know why yet, but in general the chain is designed to be resilient against this, transactions will continue as usual and finalization will kick in when the problem is resolved,” they tweeted.\n\nEthereum had a hard time reaching consensus, resulting in a brief, but drastic, downtick in validator participation on the consensus layer, according to Blockworks Research Senior Analyst Sam Martin.\n\n“This led to a period of time where Ethereum blocks were not being finalized, but blocks were still being validated as normal on the execution layer,” he added. “This is yet another instance that highlights the importance of client diversity amongst Ethereum’s validator set.”\n\nClient diversity refers to the need to have multiple independent clients to ensure the decentralization of a network.\n\nA follow-up tweet at about 4:50 pm ET suggested blocks were being finalized again.\n\nIf a consensus client has over 33% of its Ethereum nodes compromised, the Beacon Chain could stop finalizing.\n\nThis means that user transactions could be tampered with or changed, threatening the security of the Ethereum blockchain as a whole.\n\nHistorical precedent shows that having a diverse set of validators can prevent denial-of-service attacks. During the Shanghai denial-of-service attacks in 2016, attackers tricked the dominant client at the time (Geth) into slowing down block operations. Alternative clients who were not affected by the vulnerability were online at the time, and able to prevent Ethereum from being compromised.\n\nSuperphiz.eth said the loss of finalization might be “the first real-world test of our consensus client diversity work,” and called the incident “big, but inconsequential.”\n\n“Decentralization on all levels limits the impact of these events, regardless of what caused this we must continue hardening every vector,” superphiz.eth added.\n\nSuperphiz didn’t immediately return a request for comment.\n\nThe incident is currently being investigated by Ethereum developers and more information is expected to be revealed.\n\nLoading Tweet..\n\nUpdated May 11, 2023 at 5:54 pm ET: Added additional context and comments throughout.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jYXRlY29pbi1ldGhlcmV1bS1uZXR3b3JrLWxhdW5jaGVzLXNldC0xOTAwMDA3MTguaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Catecoin Ethereum Network Launches, Set Sights On Becoming Next PEPE - Yahoo Finance",
        "content": "LONDON, UK / ACCESSWIRE / May 12, 2023 / Catecoin is the first Cat-theme token with multiple decentralized applications (dapps). Catecoin's recent launch on the Ethereum network has garnered attention from other meme coins like Pepe Coin and China Inu Whales, leading to an exciting and dynamic ecosystem.\n\nCatecoin, Friday, May 12, 2023, Press release picture\n\nCatecoin: Bridging the Gap Between Non-Crypto and Crypto Users\n\nCatecoin , launched in 2021, distinguishes itself from other meme coins by offering a range of innovative features and dapps. The project's primary aim is to introduce non-crypto users to the world of cryptocurrencies, making it accessible and user-friendly. With its well-designed platform, Catecoin provides a simplified experience that supports earning, staking, and trading tokens.\n\nDiverse Range of Products and Services\n\nCatecoin has developed a multitude of products and services that cater to various user needs and preferences. One of their notable offerings is a Play to Earn Game, allowing users to earn rewards in the form of tokens while enjoying an engaging gaming experience. This concept combines the popularity of gaming with the potential for financial gains, attracting a wide audience.\n\nMoreover, Catecoin has also developed a defi crypto wallet that supports storage for over 10+ blockchain cryptocurrencies. This feature provides convenience and security for users, allowing them to manage their assets efficiently within a single platform.\n\nIn addition, Catecoin offers a Web3 payment URL, enabling direct payments from any cryptocurrency user. This functionality facilitates seamless transactions and encourages the adoption of cryptocurrencies in everyday transactions.\n\nBuilding Community and Users Interest\n\nCatecoin has quickly garnered a strong and passionate community, with over 170,000 hodlers supporting the project. This large and dedicated community adds to the network's stability and potential for growth.\n\nFurthermore, Catecoin's market performance has been noteworthy. With an initial market cap of $18,033,181 and a launch price of $0.0000000033, it has generated substantial liquidity, currently standing at $3.5 million.\n\nStory continues\n\nAttracting of Pepe Coin and China Inu Whales\n\nThe launch of Catecoin on the Ethereum network has caught the attention of other meme coins, namely Pepe Coin and China Inu Whales. These whales, referring to individuals or groups with substantial holdings, recognize the potential of Catecoin and the network it operates on.\n\nThe presence of such influential players within the crypto space adds further credibility and exposure to Catecoin. The collaboration between these meme coins can create a synergy that benefits all parties involved, potentially driving increased adoption and usage.\n\nThe Next Big Meme Coin on the Ethereum Network\n\nCatecoin's launch on the Ethereum network has marked a significant milestone in the world of meme-themed tokens. With its focus on introducing non-crypto users to the industry and a range of innovative products and services, Catecoin aims to capture the attention of investors and crypto enthusiasts.\n\nThe attraction of Pepe Coin and China Inu Whales further adds to its appeal and potential for growth. As the cryptocurrency landscape continues to evolve, Catecoin stands as an example of how meme-themed tokens can offer more than just a fleeting trend, bringing new users into the crypto ecosystem and creating lasting value.\n\nMedia Contact:\n\nCatecoin\n\nWebsite: https://catecoin.com\n\nEmail: hodl@catecoin.club\n\nSOURCE: Catecoin\n\n\n\n\n\nView source version on accesswire.com:\n\nhttps://www.accesswire.com/754567/Catecoin-Ethereum-Network-Launches-Set-Sights-On-Becoming-Next-PEPE\n\n\n\n"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vZGVjcnlwdC5jby8xMzk3NDcvYml0Y29pbi1hbmQtZXRoZXJldW0tZG93bi0zLXBlcmNlbnTSAUNodHRwczovL2RlY3J5cHQuY28vMTM5NzQ3L2JpdGNvaW4tYW5kLWV0aGVyZXVtLWRvd24tMy1wZXJjZW50P2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Down 3%, Top Altcoins Fall as Market Sees Red - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin (BTC) is down 2.8% over the past 24 hours, falling from a high of $28,280 to its recent low of $27,058, and settling on $27,368 at the time of writing, according to data from Coingecko.\n\nThe past seven days have seen a clear downtrend for the top cryptocurrency by market cap, with a high of $29,724 on May 5th, losing 6% on the week, and wiping out $45 billion from its market cap. The BTC market cap is currently sitting at $530 billion.\n\nEthereum, the market’s second largest cryptocurrency has also seen negative price action, with its value dropping 3.3% in the last 24 hours, trading at $1,818 at the time of writing.\n\nAD\n\nAD\n\nThese drops come amid a wider crypto market selloff, with red candles hitting major and minor altcoins. Larger cryptocurrencies such as Cardano (ADA), Dogecoin (DOGE) and Polygon (MATIC) among others are seeing losses within the 2-5% range.\n\nLitecoin (LTC) and Monero (XMR), however, are among the few that have not seen drops in their prices.\n\nAlthough the majority of losses are under 5% for major BTC, ETH and major altcoins, the past week has seen larger drops, with several of the aforementioned cryptocurrencies reaching the double digits.\n\nAccording to Coingecko, the global cryptocurrency market cap today sits at $1.2 trillion, which marks a 2.5% drop over the past 24 hours.\n\nThe sudden drop in prices could be due to several reasons. On one hand, after a few days of sky high Bitcoin fees, that saw Binance pause withdrawals, fees have dropped prompting delayed selling from market participants.\n\nAD\n\nAD\n\nDespite a momentary push higher from Bitcoin and Ethereum after April’s inflation numbers came in lower than expected, the news might have also marked a precipitous sell off from investors.\n\nAs for the broader cryptocurrency market’s losses, the majority follows Bitcoin’s lead, mimicking its price action albeit with larger price swings due to their smaller market cap."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiMGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V0aGVyLXN1cHBseS1jYXAtbGF0ZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Ethereum's Vitalik Buterin May Get His Way on Ether Supply Cap — 5 Years Late - Blockworks",
        "content": "Ethereum has no formal cap on the supply of ether, but it looks to be getting an informal one thanks to the burn.\n\nThe total ether supply is now projected to have peaked in March at 120.5 million ETH, and has declined by about 100,000 ETH since then, according to data from Ultrasound Money.\n\nSome observers note the historical irony of that 120 million number; Ethereum co-founder Vitalik Buterin proposed it as a hard cap back in April 2018. To be fair, it was the first day of April, and Buterin confessed the following day that his suggestion was an April Fools’ prank of sorts — though he did intend to encourage a very real debate on the subject.\n\nStill — joke or not — Buterin’s suggestion was generally dismissed on the merits, as unhelpful and unworkable.\n\nAt the time, the circulating supply of ether — due to its genesis allocations and subsequent proof-of-work issuance — stood at about 98.5 million. It would be 32 more months before long-term holders could start locking 32 ETH in the Beacon Chain’s validator deposit contract, and longer still before the London hard fork introduced the concept of burning a portion of Ethereum transaction fees with EIP-1559.\n\nA year later, the Merge further bent the curve of ether supply towards deflation, as it instantly reduced the rate of issuance — the supply previously required, under proof-of-work, for the network to operate.\n\nSource: Ultrasound.Money\n\nThe purpose of EIP-1559 was not to reduce transaction fees, but for them to become “more predictable and thereby make the fee estimation problem — the problem of choosing the optimal gas price for a transaction — as straightforward as possible,” according to the December 2020 research paper by Tim Roughgarden detailing the concept.\n\n\n\nFor many ether holders, the more long-term ramification, however, may be the de facto supply cap, which was considered a “side benefit” at the time of its introduction.\n\nBuried on page 52 of the 58-page paper, Roughgarden wrote, “because burned fees are effectively a lump sum refund to ETH holders, the value of ETH would be tied directly to the intensity of network usage.”\n\nThree and a half years later, the price is about half what it was when the network’s London hard fork took effect near the height of the previous bull market euphoria. But ether’s supply has been undergoing deflation for 5 months straight, fueled by all kinds of network usage, from rollups to meme tokens.\n\nOn top of that, the amount of ether staked has been trending steadily higher, reaching an all-time high Thursday, with upwards of 566,000 validators.\n\nAround 3,100 metric tons of gold will be mined in 2023, resulting in between 2-3% supply inflation.\n\nBitcoin’s inflation rate stands at 1.74%. Ether’s supply, meanwhile, has fallen 1.07% since the burn began.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDUvMTEvZXRoZXJldW0tbWFpbm5ldC13YXMtdW5hYmxlLXRvLWZ1bGx5LWZpbmFsaXplLXRyYW5zYWN0aW9ucy1mb3ItMjUtbWludXRlcy_SAXdodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA1LzExL2V0aGVyZXVtLW1haW5uZXQtd2FzLXVuYWJsZS10by1mdWxseS1maW5hbGl6ZS10cmFuc2FjdGlvbnMtZm9yLTI1LW1pbnV0ZXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Ethereum Mainnet Was Unable to Fully Finalize Transactions for 25 Minutes - CoinDesk",
        "content": "After roughly 25 minutes, the mainnet was finalizing blocks again. The developers said they are still investigating what caused this outage, and would report back to the community soon."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMinAFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2FjY3VtdWxhdGlvbi1vZi0xLWJpbGxpb24td29ydGgtb2YtZXRoLXByZXZlbnRzLWV0aGVyZXVtLXByaWNlLWZyb20tZmFsbGluZy1iZWxvdy10aGlzLWtleS1sZXZlbC0yMDIzMDUxMjAyMjXSAaABaHR0cHM6Ly93d3cuZnhzdHJlZXQuY29tL2FtcC9jcnlwdG9jdXJyZW5jaWVzL25ld3MvYWNjdW11bGF0aW9uLW9mLTEtYmlsbGlvbi13b3J0aC1vZi1ldGgtcHJldmVudHMtZXRoZXJldW0tcHJpY2UtZnJvbS1mYWxsaW5nLWJlbG93LXRoaXMta2V5LWxldmVsLTIwMjMwNTEyMDIyNQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Accumulation of $1 billion worth of ETH prevents Ethereum price from falling below this key level - FXStreet",
        "content": "Share:\n\nEthereum price is trading at $1,800 after averting a potential decline to the critical support level of $1,700.\n\nThroughout May, more than 600,000 ETH has been accrued by the investors, which has helped offset the price drop.\n\nWhales, however, seem to be reluctant to bear any losses, shedding more than $1.7 billion worth of ETH in the last 12 days.\n\nEthereum price has been setting the path for most of the major and minor altcoins in the market, just as ETH investors are doing for it. The mixed behavior from different cohorts suggests that there is still some uncertainty regarding where the market could go. However, investors are doing their best to prevent a downfall.\n\nEthereum price hovers around monthly lows\n\nEthereum price trading at $1,795 is currently at a monthly low, following a decline of more than 10% in the last few days. The concern of losses among the investors could have actually driven the price down further, but the optimism outweighed the fear, preventing a drastic drawdown.\n\nMost of this fear was visible only in the large wallet holders who seemed to have bolted at the first sign of a potential decline. The addresses holding between 100,000 to 1 million ETH shed their balance by almost 1 million ETH worth $1.7 billion since the beginning of May, bringing it to 20.6 million ETH. Similarly, the cohort with a balance of 1 million to 10 million ETH in their wallet sold off over 200 million ETH in the same duration.\n\nEthereum whales’ balance\n\nThis selling began first after Ethereum price posted two back-to-back red candles towards the end of April, noting a 4% drop, which could’ve convinced these cohorts that a decline was on the way. This resulted in the selling noted above. However, some others saw it as an opportunity to churn some gains and accumulated ETH before the market recovered. (ref. ETH/USD 1-day chart)\n\nAs per the total supply present on cryptocurrency exchanges, at the beginning of the month, exchange wallets held about 13 million ETH. However, at the time of writing, this supply came down to 12.4 million ETH, suggesting about 600,00 ETH worth $1.07 billion was picked up by investors.\n\nEthereum supply on exchanges\n\nInterestingly, intentional or not, this accumulation ended up preventing a further decline in Ethereum price. Although the second-generation cryptocurrency is slightly below the $1,800 mark, it is still holding its own, keeping above $1,700.\n\nThis price level coincides with the 200-day Exponential Moving Average (EMA), which acts as the critical resistance for the cryptocurrency. Although it cannot be said with absolute certainty, looking at the market, there is a chance that ETH might recover before falling further.\n\nETH/USD 1-day chart\n\nNevertheless, a decline to the $1,700 mark only warrants a 5.5% drawdown and losing this level could result in the Ethereum price falling to March lows of $1,430. As it is, the Relative Strength Index (RSI) is in the bearish zone below the 50.0 neutral mark, further increasing the odds of a decline."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0va2V5LXN1cHBvcnQtbGV2ZWxzLXRvLW1vbml0b3ItYXMtZXRoZXJldW0tcHJpY2Utc2xvd3MtZG93bi_SAWVodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2V0aGVyZXVtL2tleS1zdXBwb3J0LWxldmVscy10by1tb25pdG9yLWFzLWV0aGVyZXVtLXByaWNlLXNsb3dzLWRvd24vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Key Support Levels To Monitor As Ethereum Price Slows Down - NewsBTC",
        "content": "The Ethereum price consolidation weakened as the bulls lost momentum, resulting in a nearly 4% loss in the last 24 hours and a 7% decline on the weekly chart. The technical analysis indicates considerable bearish pressure.\n\nThe coin’s value remained stagnant at around $1,800, leading to waning interest from buyers and a significant decrease in demand and accumulation. As Bitcoin dropped below $26,000, major altcoins also experienced significant declines on their daily charts.\n\nTo break its resistance, Ethereum requires substantial buyer participation, as failure to do so could lead to the loss of a crucial support level.\n\nAdditionally, Bitcoin must recover and reach the $27,000 zone to initiate a short-term recovery for ETH. The declining market capitalization of Ethereum suggests a gradual departure of buyers from the market.\n\nEthereum Price Analysis: One-Day Chart\n\nAt the time of writing, ETH was priced at $1,770. After struggling around the $1,800 range, selling pressure eventually took over. The coin’s resistance levels were identified at $1,798 and $1,821. Conversely, if the price continues to decline, the bulls will attempt to defend ETH at $1,740.\n\nHowever, a failure to hold above $1,740 would push Ethereum down to $1,690. A further drop would breach the $1,540 support line. Additionally, the recent session saw a significant increase in selling strength, reflected by the red volume of Ethereum traded.\n\nTechnical Analysis\n\nFollowing the decline from the $1,800 range, ETH has experienced a significant sell-off with a lack of recovery in buying strength. The Relative Strength Index (RSI) dipped below 40, suggesting a decrease in accumulation and nearing oversold territory.\n\nAdditionally, ETH dropped below the 20-Simple Moving Average (SMA) line, indicating that sellers have been driving the market momentum. If ETH successfully surpasses the immediate resistance level, there is a possibility of moving above the 20-SMA line.\n\nSeveral technical indicators on the daily chart of Ethereum began showing sell signals. One of these indicators is the Awesome Oscillator, which not only reflects price momentum but also identifies potential trend reversals.\n\nIn this case, the indicator displayed growing red histograms below the half-line, indicating sell signals for the altcoin. This suggests a potential decline in price before any recovery takes place.\n\nAnother indicator, the Bollinger Bands, which reveal price fluctuation and volatility, started widening. This widening suggests that Ethereum could experience increased price volatility and fluctuations in the upcoming trading sessions.\n\nThis heightened volatility indicates the potential for significant price movements in either direction. Ethereum has to topple over its immediate resistance in order to stall the bears. In addition to that, broader market strength will also prove to be crucial for ETH.\n\nFeatured Image From UnSplash, Charts From TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vZGVjcnlwdC5jby9uZXdzLWV4cGxvcmVyP3Bpbm5lZD0xNjUwNjYmdGl0bGU9ZXRoZXJldW0tZmFpbGVkLXRvLWNvbXBsZXRlLXRyYW5zYWN0aW9ucy1mb3ItMjUtbWludXRlc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 03:01:21 GMT",
        "title": "News Explorer — Ethereum Failed to Complete Transactions for 25 Minutes - Decrypt",
        "content": "May 11, 9:42 pm\n\nCoindesk\n\nEthereum Failed to Complete Transactions for 25 Minutes\n\nEthereum's mainnet experienced a 25-minute period of block proposal but not finalization on Thursday. Users were at risk of transaction alteration during this time. Ethereum core developers announced the issue and are currently investigating the cause. After 25 minutes, the mainnet resumed finalizing blocks."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvaG93LXRvLWJ1eS1ldGhlcmV1bS1vbi1tZXRhbWFzay13aXRoLXBheXBhbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "How to Buy Ethereum on MetaMask with Paypal - Watcher Guru",
        "content": "The MetaMask crypto wallet now offers US users to purchase Ethereum, according to an announcement by developers today. MetaMask is the first web3 wallet to enable users to buy ETH using PayPal.\n\nIn addition to purchasing ETH directly, the integration also supports the transfer of ETH from PayPal to MetaMask, a developer blog says. Here’s how to buy Ethereum on MetaMask with PayPal, step by step.\n\nHow to Purchase ETH on MetaMask with Paypal\n\nMetaMask offers a step-by-step tutorial on buying Ethereum with PayPal. Here’s how to do it:\n\nLogin into the MetaMask browser extension, mobile app, or MetaMask Portfolio. Click or tap “BUY” to get started. Select country (US only) and state (Note: PayPal crypto service is not available in Hawaii) Choose “PayPal” as your payment method. Select ETH, then enter the amount you want to purchase Sign in to your PayPal account. Select payment option of choice: PayPal balance, eligible bank, or debit card. Review the purchase, then click “Confirm”.\n\nMetaMasks’ adoption of PayPal is still relatively new, so ETH is the only cryptocurrency currently available for purchase through PayPal on the crypto wallet. MetaMask will likely announce more soon."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtdHJlbWVuZG91c2x5LXVuZGVydmFsdWVkLWF0LWN1cnJlbnQtcHJpY2VzLXByb21pbmVudC10cmFkZXItc2F5c9IBYWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtdHJlbWVuZG91c2x5LXVuZGVydmFsdWVkLWF0LWN1cnJlbnQtcHJpY2VzLXByb21pbmVudC10cmFkZXItc2F5cz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Tremendously Undervalued at Current Prices, Prominent Trader Says - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nProminent trader Bob Loukas thinks the second largest cryptocurrency by market capitalization, Ethereum, is tremendously undervalued. He draws his deduction, citing that given the usage, adoption, dominance and comparison to market caps across the crypto space as well as its technology, ETH might be tremendously undervalued.\n\nAdvertisement\n\nThis might imply that ETH's current market price is lower than its perceived true value.\n\nGiven the usuage, adoption, dominance, and comparison to caps across the space (as well as tech), $ETH is tremendously undervalued. IMO obv. — Bob Loukas (@BobLoukas) May 11, 2023\n\nAt the time of writing, ETH was trading down at $1,804, according to data from CoinMarketCap, after shedding 3.68% of its value in the past day.\n\nETH remains below the key $2,000 level it briefly broke through in April following the Shapella upgrade. In the past day, following the release of lower-than-expected CPI data, it rose briefly to highs of $1,888 on May 10 before declining.\n\nThe Ethereum network continues to see greater demand as market participants make moves to bringing meme mania back to crypto. The mania around meme coin PEPE recently drove a remarkable increase in profitability for validators running the Ethereum network.\n\nEthereum might retest $1,550\n\nA crypto analyst who goes by @TheMoonCarl on Twitter paints the possibility of Ethereum retesting the $1,550 level if the current correction continues. He spotted a Descending Triangle pattern on the Ethereum chart, and if this breaks down, ETH might retest $1,550.\n\nCHART: #Ethereum Descending Triangle. If it breaks down, we can retest $1,550. pic.twitter.com/eyDUxmR0RR — Carl From The Moon (@TheMoonCarl) May 10, 2023\n\nA descending triangle is a bearish chart pattern formed by a series of lower highs and a lower resistance level.\n\nIn other news, Binance.US, the subsidiary of top crypto exchange Binance says it now supports Ethereum (ETH) unstaking and withdrawals. Following the successful completion of the Ethereum Shapella upgrade, users can now stake and request the unstaking of ETH on the crypto exchange."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3ZpcmdpbC1ncmlmZml0aC1leHBvcnQtcHJpdmlsZWdlLWJhctIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Imprisoned Ethereum Developer Virgil Griffith Faces 10-year Export Privilege Bar - Blockworks",
        "content": "Ethereum developer Virgil Griffith, who is currently serving five years in prison, received a 10-year-long export privilege bar, according to the Department of Commerce.\n\nGriffith, even after he is released from prison, “may not directly or indirectly participate in any way in any transaction involving any commodity, software or technology…exported or to be exported from the United States that is subject to the Regulations.”\n\nEssentially, Griffith faces a bar on his export privileges as a US citizen.\n\n“Based upon my review of the record, including Griffith’s submission, and consultations with BIS’s Office of Exporter Services, including its Director, and the facts available to BIS, I have decided to deny Griffith’s export privileges under the Regulations for a period of ten years from the date of Griffith’s conviction,” John Sonderman, the director of the Office of Export Enforcement, said.\n\nThe order is in effect until April 12, 2032.\n\nLast year, Griffith was sentenced to 63 months in prison – or five years – after he pled guilty to conspiracy to violate the International Emergency Economic Powers Act.\n\nThe act bars US citizens from exporting goods, services or technology to countries such as North Korea without a license from the Treasury Department’s Office of Foreign Assets Control.\n\nHe also paid a $100,000 fine as part of his sentencing.\n\nIn 2018, Griffith put together plans to provide services in North Korea, he developed and funded cryptocurrency infrastructure with the alleged knowledge that North Korea could then use the technology to bypass US sanctions.\n\n“Watching Ukraine sanctions has shown me their value. I have been cured of my stubborn arrogance, and my obsession with North Korea. My career has been damaged. I’m sorry,” Griffith said in court last year.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2NhcmRhbm9zLWh5ZHJhLXNjYWxpbmctc29sdXRpb24tZ29lcy1saXZlLW9uLW1haW5uZXQtYXMtZXRoZXJldW0tZ2FzLWZlZXMtc3VyZ2Uv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Cardano's hydra scaling solution goes live on mainnet as Ethereum gas fees surge - CryptoSlate",
        "content": "The first Hydra node compatible with the Cardano mainnet was launched on May 11, according to developer Sebastian Nagel.\n\nHydra is a layer2 scaling solution designed to improve scalability on the Cardano blockchain. Its launch came after several months of testing. According to its technical documentation, the protocol aims to increase transaction speed through low latency and high throughput and minimize transaction costs.\n\nNagel noted that the launched Hydra node API was updated to accommodate users’ requests.\n\nMeanwhile, the newly launched Hydra head is the first of many heads, each serving as an off-chain mini-ledger for a small group of users. The tools will effectively reduce fees and improve transaction speed on the network.\n\nCardano developers can deploy complex decentralized applications on the blockchain network with this solution.\n\nOther developments on Cardano\n\nMeanwhile, the Hydra head launch is just another one in the series of developments on Cardano since the year started. The network has already added a decentralized stablecoin, DJED, and will have the fifth upgrade on its roadmap later this year.\n\nDeFi activities on the network have steadily risen during the past months. According to DeFillama data, the total value of assets locked on the network is currently $140.53 million.\n\nDespite the developments, its token ADA has not seen a significant rise in value. ADA is trading at $0.362 after increasing 2.6% in the last 24 hours. However, it is down 10% in the previous 14 days, according to CryptoSlate data.\n\nEthereum gas fees issues\n\nEthereum (ETH) is experiencing a massive rise in gas fees — due to the recent meme coin frenzy holding the crypto market.\n\nThe network gas fees surged to a 12-month high of 87 gwei before dropping to around an average of 80 gwei, according to Etherscan data.\n\nOne trader recently spent 64 ETH — around $120,000 — on gas to buy 13.8 billion FOUR tokens worth $155,000 on Uniswap decentralized exchange. Several industry players point to scenarios like this as an impediment to the mass adoption of the industry.\n\nusechatgpt init success\n\nMentioned in this article"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDUvMTIvbm93LWJ1eS1ldGhlcmV1bS13aXRoLXBheXBhbC1vbi1tZXRhbWFzay_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Now Buy Ethereum with PayPal on MetaMask - Crypto Times",
        "content": "MetaMask, the popular cryptocurrency wallet, has announced a new integration with PayPal that will allow users in the United States to buy Ethereum (ETH) directly with their PayPal balance, linked bank account, or debit card.\n\nWith over 426 million users worldwide and $77 billion in assets, PayPal’s move into the cryptocurrency space is rapidly growing, with crypto holdings approaching $1 billion in Q1 2023. The new partnership with MetaMask is poised to bring more mainstream adoption to Ethereum and cryptocurrency as a whole.\n\nMetaMask, a popular browser-based interface to the Ethereum blockchain, has become a one-stop-shop for users looking to buy Ethereum with fiat currency. With 30 million users, the wallet has become a vital tool for accessing Ethereum-based second layers and other chains, like Binance Chain.\n\nHowever, it faces stiff competition from other browser-based extensions. MetaMask offers a range of options for purchasing Ethereum within its platform, but PayPal is a rare addition.\n\nDespite concerns around chargebacks, which can be easily disputed on PayPal, the integration with MetaMask is seen as a game-changer.\n\nBy using the blockchain as proof, MetaMask could help to mitigate disputes and open up new possibilities for PayPal in the crypto space."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9kZWNvZGluZy1ldGhlcmV1bXMtZXRoLWNoYW5jZXMtb2YtYWNoaWV2aW5nLWEtMzUtc3VyZ2UtaW4tc3Rha2luZy1kZW1hbmQv0gFjaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2RlY29kaW5nLWV0aGVyZXVtcy1ldGgtY2hhbmNlcy1vZi1hY2hpZXZpbmctYS0zNS1zdXJnZS1pbi1zdGFraW5nLWRlbWFuZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Decoding Ethereum’s [ETH] chances of achieving a 35% surge in staking demand - AMBCrypto News",
        "content": "A staking service provider predicted the hike and backed it up with reasons.\n\nEther deposits have increased on the Beacon Chain, changing the course of stake effectiveness.\n\nStaking has become a critical element of Ethereum’s [ETH] ecosystem since undergoing the transition from Proof-of-Work (PoW). And more recently, the Shanghai upgrade. According to the Staked Q2 report, the ETH stake rate could increase by 20% to 35% in the next 12 to 18 months.\n\nHow much are 1,10,100 ETHs worth today?\n\nHigher than the former\n\nStaked, the research subsidiary of the Kraken exchange, noted that a lot of factors were considered before its projection. First, the report mentioned that the average Ethereum staking yield increased from 5.2% to 5.8% on a Quarter-To-Quarter (YoY) basis.\n\nStaking yield is defined as the estimated reward that validators get from committing their assets in order to maintain the security of a blockchain. Thus, implying an increase in participation in the activity.\n\nAlthough Staked admitted that Kraken was one of the first platforms to allow un-staking, the notable decreases in withdrawal queue could set Ethereum in motion for increased traction. The report noted:\n\n“Average daily deposits are now 6.5x higher than in April. There were more ETH staked in the six days after Shapella (750k) than the entire month of March (600k).”\n\nHowever, it seems that the prediction by the leading provider of staking services to consumers and institutions could be well on track. This was because the validator rewards withdrawals on the Beacon Chain has significantly decreased.\n\nFor the unaccustomed, Ethereum created the Beacon Chain to ensure that the Proof-of-Stake (PoS) consensus was effective enough to operate on the Mainnet. It is also the ledger responsible for coordinating the validation of\n\nstaked Ether [stETH]\n\non the network.\n\nPledges on the Beacon Chain\n\nIt was, however, a different case with Ether deposits on the consensus layer. At press time, this metric was as high as 58,800. Therefore, this means a large percentage of stakers were not yet willing to act in accordance with the withdrawal cycle conditions.\n\nFurthermore, the stake effectiveness also appeared to align with the projection.\n\nThis metric is the ratio of the total effective balance to the total staked balance. It also acts as a measure of the proportion of stETH actively participating in the consensus.\n\nSince its genesis, the stake effectiveness was on a consistent downward trend. But when the Ethereum Foundation announced Shanghai’s success, the tides changed. At press time, the metric was 0.98.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nThis indicated that there has been a regular transfer of validator rewards to the Ethereum Mainnet and increased activity on the Beacon Chain.\n\nIn a case where the current momentum is sustained, then demand might increase. But whether it would be as high as predicted or not, depends largely on the participation rate."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vaW5keXBlbmRlbnQub3JnLzIwMjMvMDUvZnJvbS1iaXRjb2lucy10by1zaGl0Y29pbnMtbWVldC10aGUtbGF0ZXN0LWNyeXB0by1jdXJyZW5jeS1jcmF6ZS1hbmQtdGhlLXNjYW1zLWl0LWlzLXNwYXduaW5nL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "From Bitcoins to “Shitcoins,” Meet the Latest Crypto-Currency Craze and the Scams It Is Spawning - The Indypendent",
        "content": "What was promised as an important technical innovation has instead become the most extensive platform for fraud, gambling and scams the world has ever seen.\n\nThe latest craze in crypto is a token on the Ethereum blockchain celebrating the meme “Pepe the Frog” and intended to challenge the Dogecoin favored by Elon Musk. The ticker $PEPE has become a rabid mania on Musk’s Twitter, and, despite being created by an anonymous team who likely intended to snatch a quick buck, it reached $1.5 billion in market capitalization in less than a month. It embodies the ultimate degenerate rush of the ever-shifting crypto endeavor: so-called “shitcoins.”\n\nWhile a seemingly trivial and jovial fight for memetic supremacy, the raging one-off shitcoin and “memecoin” run-ups encapsulate the attention economy of frenetic insanity that Ethereum enables. What was promised as an important technical innovation to protect free speech and universal access to computing has instead become the most extensive platform for fraud, gambling and scams the world has ever seen, leaving innumerable victims suffering in silence and without sympathy.\n\nWhat investment could be easier than betting on the madness of crowds?\n\nEvery single day on the Ethereum blockchain, thousands of computer programs, called “smart contracts,” are launched that intend to deceive and harm their users. Sometimes they involve NFTs as programs that assign “ownership” to various image files but are often used to make false or overzealous promises about their value. Sometimes they are DeFi protocols, unregulated bank accounts or savings and loans that earn their own token which can be traded like a stock, yet which often are scams or are hacked. Sometimes they are so-called “shitcoins,” technically primitive tokens that in some almost mystical way represent a proxy for the overall Ethereum network. In some sense, their only value comes from the memetic power of the ticker symbol, although the same names can be used over and over again. Hundreds of other “devs” have already tried to launch a Pepe coin with much less success.\n\nThe Pepe meme’s well-known association with the online alt-right also raises questions about why this particular meme now strives for cultural hegemony on the blockchain. While it does seem that the memecoin is being propelled by pure speculation and nostalgia for Pepe in general, there is something uncomfortable and risky about focusing on this particular — and rather played out — meme, especially given the serious allegations that Ethereum’s most popular NFT project, Bored Ape Yacht Club, is inspired by esoteric fascism.\n\nEventually most “projects” on Ethereum end in a fast or a slow “rug,” proving that most activity on so-called Web3 is no different from confidence games of old. $PEPE may not “rug” quite yet, but we already know that its early investors are openly planning to unload their million-dollar bags to the naive “exit liquidity” of cartoon frog fans betting on a dream.\n\nThus, it is at the level of the Ethereum blockchain where we should interrogate $PEPE, and the hundreds of other tokens, like $MUSK and $SEC, minted every day like candy. Every single transaction has fees ranging from $20 to $50 that go straight to the largest Ethereum holders who stake their tokens. They benefit all of the time, even as they are “validating” transactions intended quite clearly to defraud. In one sense, the current “shitcoin meta,” a term that describes the most lucrative area of speculation at any given moment, more accurately represents the mass marketing of a new gambling opportunity for customers of the maniacal Ethereum casino.\n\nThe Pepe meme’s well-known association with the online alt-right also raises questions about why this particular meme now strives for cultural hegemony on the blockchain.\n\nBoosters act like Ethereum is a new and free online metaverse, where pure internet demand determines activity. The truth is much different. The token distribution of ETH is highly centralized, giving big holders the ability to manage and orchestrate Ponzi schemes at ease, using every illegal practice, especially pumping-and-dumping and wash trading, that is — at least in theory — disallowed on Wall Street. Pepe promoters point to the $6 billion valuation of the Ethereum Doge alternative, $SHIB, as evidence that $PEPE can go much higher, yet there are serious questions about the centralized nature of $SHIB ownership, which puts its accurate valuation in doubt.\n\nMoreover, gambling over the value of memes says something profound about the frothiest financial capital that is moving increasingly into speculation and quantitative trading on the probable success of new ponzi schemes, rather than productive investment. What investment could be easier than betting on the madness of crowds? And, after riding Gamestop and AMC, young investors in particular have brought a certain predictable level of logic and discipline to their madness.\n\nWhen one steps back and considers it, however, you have to ask why these primitive programs, or “smart contracts,” on a primitive distributing computing platform should be valued so highly. In my mind, it is like being overly protective of your saved score on an early Atari video game. It may be a remarkable achievement, but will anyone care after the Nintendo Entertainment System comes out?\n\nOn the other hand, Ethereum may still triumph as a “settlement layer” for a new digital economy. By not investigating and prosecuting the open scams and crimes on Ethereum, the federal government has given its clique of owners, or “whales,” unimaginable amounts of wealth to use to finance and propel their endeavor, alongside more and more creative cons. SEC regulators have dithered at accurately describing Ethereum activity, and it is obvious that the FBI does not have the resources (nor perhaps the expertise) to keep track of the scams orchestrated.\n\nNow that serious crypto regulation is on the table, Ethereum must be part of the conversation since its leadership refuses to assert any moral authority. Stepped-up enforcement of existing laws by an invigorated and quick-moving FBI, rather than pure security and commodities regulation, should be the focus. Starving fraud and financial crimes enforcement when the U.S. government needs to take control and fundamentally reform a rotten system from top to bottom — addressing the root cause of crypto’s popularity — is insane. Ethereum is now the most vicious corner of the cryptocurrency space, and its victims should not be forgotten.\n\nTodd Fine is a PhD candidate in History at the CUNY Graduate Center. He also writes about NFTs for arts and crypto publications."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmJpdGNvaW5zZW5zdXMuY29tL2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tZGFpbHktMTItbWF5LWV0aC1icmVha2luZy1iZWxvdy10aGlzLWtleS1zdXBwb3J0LWFzLXByZWRpY3RlZC13aGF0LW5vdy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction Daily (12-May): ETH Breaking Below This Key Support As Predicted! What Now? - Bitcoinsensus",
        "content": "Ethereum price prediction from a previous analysis Urgent! ETH Bearish Prediction Playing Out! Time To Sell?\n\nThe Ethereum price has finally broken through this $1,800 key support in the 4-hour timeframe. This bearish breakdown signifies the start of a potential -15% dump in the value of Ethereum in the coming days.\n\nIn this Ethereum analysis, we will be giving you an update on what the ETH price is doing now as well as the key Head and Shoulders Pattern that is currently in play in the 4-hour timeframe.\n\nNew KYC bonus campaign from Bybit! From now till 21st of May 2023\n\nSign up and fund your Bybit account with our Bybit link to get this offer!\n\nFor new Users: Deposit $100, complete your KYC, and get $40. For existing Users, who have not completed KYC yet: Have a balance of $50, complete your KYC and get $20\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nEthereum In Bearish Territory!\n\nETH Breaking Below This Key Support As Predicted! What Now? Watch this price analysis in the 4-hour timeframe\n\nBy breaking through the $1,800 key support level, the ETH price has moved into bearish territory, and in the coming days, we expect to see more selling pressure begin to pour into the chat.\n\nThis bearish bias also plays out well with our bearish Head and Shoulders Pattern that is also indicating a sell-off in price in the coming days.\n\nIf this Head and Shoulders pattern plays out, there is a very high probability that we might the Altcoin price sell off to the $1,462 price region in the coming days.\n\nSo for now, we keep on watching the ETH price and this bearish Head and Shoulders pattern to see how it develops\n\nWhat Now?\n\nWe believe Ethereum is still very bearish and we might see the price sell off to the downside in the coming days. However, this bearish price prediction can only remain valid if Ethereum continues to respect and trade below the $2,019 key resistance level.\n\nWe talked about this key resistance level and why it is so important to the Ethereum bears in a previous analysis Watch This Invalidation Point For This Bearish Pattern\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nHow to Trade Bitcoin (BTC)?\n\nTo understand the basics of Bitcoin trading, you can read our How To Trade Bitcoin Guide. It can prove helpful for traders who are just getting started with Bitcoin trading. You can also check out our list of top Bitcoin Exchanges To Trade With.\n\nPrimeXBT Covesting: Trade Hassel Free\n\nSign-up on PrimeXBT today to trade Bitcoin hassle-free. You can copy experienced traders and access hundreds of different strategies on the platform! Don’t forget to claim your 25% bonus by using the promo code “bitcoinsensus50” when you sign-up with our link PrimeXBT Covesting"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2V0aGVyZXVtLWdhcy1mZWVzLWF0LTEwLW1vbnRoLWhpZ2gtaW52ZXN0b3JzLWV4Y2l0ZWQtYWJvdXQtMTAweC1tZW1lLWNvaW5zLWRpZ2l0b2Fkcy1hbmQtcGVwZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Ethereum gas fees at 10-month high! Investors excited about 100x Meme Coins DigiToads and Pepe - Analytics Insight",
        "content": "Ethereum’s gas fees recently surged up to a 10-month high, mainly off the back of increased buyer demand for ER20 tokens like PEPE, which saw 21,000% gains in just a few days. While nobody wants increased gas fees, we do want gains for our portfolio, and the altcoin growth season looks to be well underway. Other tokens like DigiToads are gaining momentum and could be about to explode like PEPE. That’s why investors are licking their lips at the potential they see with the TOADS ecosystem. It could soon rival some of the bigger altcoins on the market. Here’s why:\n\nDigiToads (TOADS)\n\nDigiToads has already been impressing industry onlookers in its early presale stages. And the good news is that there’s still plenty of time left if you want to be part of TOADS’ top ico, with price increases built in to guarantee you profits before it officially launches thanks to a presale model that’s hard to beat.\n\nBut that’s not all: the TOADS ecosystem will become the go-to P2E meme coin in the crypto world thanks to multiple ways to earn as part of a fun and rewarding environment that continues to attract more investors every day. So if you want to train, battle, and win with your unique DigiToad companions as part of the swamp battle arena, look no further than TOADS. Funds to help support the TOADS model are raised via a sales tax on transactions and then paid out to competitors every season in the form of TOADS tokens. You can also stake popular NFTs as part of the ecosystem for an extra way to earn long-term passive income. Investors continue to flock to the DigiToads world, and now is the perfect time to invest if you want to enjoy all these benefits and more while TOADS becomes the biggest meme coin player in town.\n\n>> Buy DigiToads Now <<\n\nPepe (PEPE)\n\nPEPE’s recent massive surge in price shocked the market, as people haven’t seen this level of price gains since the likes of Doge and Shib. While increased buyer demand has caused an upswing in ETH gas fees, this is seen as a positive for the wider alt coin world, and provides a new level of confidence that we could be entering the next bull season. Pepe is perfectly placed to lead the way at the front of any bull run, but there might be more room for profits with tokens like TOADS, since it has more room to grow.\n\nEthereum (ETH)\n\nLast year’s merge to ETH 2.0 was supposed to fix high gas-fee issues, and while it went a long way in addressing them—recent buyer demand has shown that they can still become expensive. While ETH might not be the best investment right now when it comes to price action, it’s still the backbone of the defi token world and home to countless innovative projects on its blockchain. That’s why there will always be a place for ETH in the crypto world, and there should arguably always be a place for it as part of a diversified portfolio.\n\nConclusion\n\nPEPE’s rise to glory caused Ethereum fees to surge, but this was good news for the crypto world: it shows massive gains are still possible. And TOADS is perfectly placed to be the next big meme coin breakout star, which is why you should seriously consider it for your portfolio immediately. Many experts believe it could be the next big thing in the crypto space, and discounts are still available during the groundbreaking TOADS presale.\n\nFor more information on DigiToads visit the website, join the presale or join the community for regular updates.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0LzMtYmVzdC1jcnlwdG8tdG8tYnV5LW5vdy1jYXJkYW5vLWFkYS1ldGhlcmV1bS1ldGgtYW5kLWNvbGxhdGVyYWwtbmV0d29yay1jb2x0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "3 Best Crypto To Buy Now: Cardano (ADA), Ethereum (ETH), And Collateral Network (COLT) - Analytics Insight",
        "content": "After its recent Shapella Upgrade, Ethereum (ETH) has become more popular than ever. Investors are staking Ethereum (ETH) at record rates, and the number of Ethereum investors has grown on both centralized and decentralized exchanges. Now, Cardano (ADA) and Collateral Network (COLT) are expected to follow this trend, with Collateral Network (COLT) on track for a 3500% increase in value.\n\n>>BUY COLT TOKENS NOW<<\n\nCollateral Network (COLT) Stage One Is Close To Selling Out\n\nWith 60% of Collateral Network’s stage one presale already sold out, tokens are being purchased at record rates before COLT increases from $0.014 to $0.0168. This would mark a return of 68% for investors who purchased early and is just a fraction of the 3500% ROI predicted by analysts.\n\nCollateral Network removes many of the unnecessary barriers and complexities of the crowdlending process. Instead of requiring extensive credit checks and copious amounts of paperwork, individuals looking to unlock cash from physical assets can bring them on-chain using Collateral Network and unlock liquidity against them, with the asset acting as collateral.\n\nEach asset is brought on-chain as a fractionalized NFT and sold to the Collateral Network community, which becomes lenders to fund the loan. In return, lenders receive a weekly passive income. Once funded, borrowers can receive cash in just 24 hours without impacting their credit rating.\n\nSmart contracts and AI are used throughout Collateral Network (COLT) to provide flexible and competitive rates as well as transparency and security, with 2FA security features being used for transactions.\n\nCollateral Network has a long-term roadmap and has been fully vetted and doxxed, with token liquidity locked for 33 years to prevent a rug pull.\n\nThe platform will accept a number of assets, including fine art, private jets, rare whiskers, diamonds, premium timepieces, and more. Just 38% of the Collateral Network (COLT) token supply will be available during its presale, with early investors being granted access to exclusive auctions for distressed assets, voting rights, and trading discounts. Following its 3500% rise, industry experts predict that Collateral Network (COLT) could rise an additional 100x after hitting mainstream exchanges worldwide.\n\nEthereum Dips Below $1.9, But Trading Volume Continues To Boom\n\nEthereum trading activity has boomed following its recent upgrade, which allowed Ethereum stakers to withdraw their assets. While some analysts believe this could have triggered turbulence, the upgrade has done quite the opposite. In just two weeks, over 100,000 Ethereum (ETH) was staked, with more investors staking Ethereum than withdrawing it.\n\nThat being said, recent memecoin activity caused the price of Ethereum trading fees to rocket, which has caused Ethereum (ETH) to drop in price by 1.03% in the last week. One Ether (ETH) is currently available for $1,847.01, at the time of writing, with over $5.8 billion worth of Ethereum transactions taking place daily.\n\n>>BUY COLT TOKENS NOW<<\n\nCardano (ADA) Drops To $0.35 Though Analysts Predict A Bounce Back\n\nCardano is quickly becoming a key player in the crypto space. It recently introduced its Hydra Scaling Solution and has also started to influence the P2E gaming space with a number of Cardano-based games. In April alone, over 65 million Cardano transactions took place, with Cardano continuing to dominate transaction volume in May.\n\nAt the time of writing, one Cardano (ADA) was selling for $0.3582, a 7.72% decrease in the last month. Market experts believe this Cardano decline has been caused by the recent crash in Bitcoin (BTC); however, they expect Cardano to bounce back in the next few weeks, potentially surging in value as Cardano’s influence on DeFi continues to grow.\n\nFor more information on Collateral Network visit the website, join the presale or join the community for regular updates.\n\nFind out more about the Collateral Network presale here:\n\nWebsite: https://www.collateralnetwork.io/\n\nPresale: https://app.collateralnetwork.io/register\n\nTelegram: https://t.me/collateralnwk\n\nTwitter: https://twitter.com/Collateralnwk\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vZGFpbHljb2luLmNvbS9ldGgtaG9sZGluZ3Mtb24tZXhjaGFuZ2VzLWhpdC1hbGwtdGltZS1sb3cv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "ETH Holdings on Exchanges Hit All-Time Low Despite Recent ETH Slump - DailyCoin",
        "content": "Ethereum investors are increasingly choosing to self-custody their ETH.\n\nExchange ETH holdings have low numbers not seen since genesis.\n\nETH is down 7.2% in the past week.\n\nCentralized crypto exchanges are one of the most popular places to trade and hold digital assets. However, the FTX blowup last year spurred an exodus from centralized exchanges to self-custody.\n\nThe migration to self-custody has been so strong that ETH held on exchanges has reached low levels that haven’t been since genesis.\n\nETH Holdings on Exchanges Hit All-Time Low\n\nETH is one of the most popular crypto assets in the industry. The second largest cryptocurrency has a $214 billion market cap and has recently entered a deflationary period.\n\nETH is also an asset that investors value and choose to self-custody instead of holding it on centralized exchanges. In fact, according to data from Santiment, ETH held on centralized exchanges has just hit an all-time low.\n\nCurrently, only 10.1% of all ETH in circulation is being held on centralized exchanges. This means that the remaining 89.9% of ETH is held by investors in self-custody wallets.\n\n👛 As #Ethereum has dipped to $1,780 today, we've seen exchange supply continue to decrease. The percentage of $ETH on exchanges is at its lowest (10.1%) since public trading began in 2015. This is essentially the #AllTimeHigh for non-exchange holdings. https://t.co/WVmeAJhhMM pic.twitter.com/eMXoRh9R76 — Santiment (@santimentfeed) May 11, 2023\n\nWhat’s more interesting is that 10.1% of ETH held on exchanges is the lowest since public trading of ETH began in 2015. That’s despite the fact that ETH has been experiencing a slump in the past week.\n\nETH Goes Down\n\nETH has been one of the best-performing assets since the start of the year. However, in the past week or so, the native currency of the Ethereum blockchain has gone down significantly.\n\nAccording to data from CoinGecko, ETH is down 3.1% on the day and 7.2% in the past week. ETH is currently trading at $1,766.\n\nETH price chart. Source: CoinGecko.\n\nETH is trading below the levels before the Shapella upgrade was activated on mainnet on April 12. Shapella is the upgrade that enabled staked ETH withdrawals for the first time since 2020.\n\nMany saw Shappela as bearish for the price of ETH. However, ETH skyrocketed more than $200 on the successful upgrade and even broke the $2,100 mark.\n\nSince then ETH was trading sideways until the last few days. ETH, together with the whole crypto market, has gone down significantly. The total market cap of all cryptocurrencies now is $1.15 trillion, according to CoinGecko.\n\nOn the Flipside\n\nETH has been deflationary ever since The Merge last August. However, in the past week or so, amid the memecoin mania, ETH has been super deflationary. For example, in the past seven days, over 66,000 ETH has been burned.\n\nWhy You Should Care\n\nETH is one of the most used cryptocurrency assets. The drama surrounding centralized exchanges has shown the importance of self-custody at all times.\n\nRead more about Polygon being pushed out of the top 10 cryptocurrencies:\n\nPolygon (MATIC) Pushed Out of Top 10 Cryptocurrencies by Solana (SOL)\n\nRead more about Ethereum OFAC-compliant blocks:\n\nEthereum’s OFAC-Compliant Blocks Drop to 27%: What Does It Mean?"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYml0Y29pbi9ldGhlcmV1bS1taW5lci1yZXZlbnVlLXZzLWJpdGNvaW4v0gFLaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy9iaXRjb2luL2V0aGVyZXVtLW1pbmVyLXJldmVudWUtdnMtYml0Y29pbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Ethereum Miner Revenue Outpaces Bitcoin In 2021 - NewsBTC",
        "content": "Ethereum has so far put up a tremendous run in 2021. Its price has hit multiple all-time highs this year, cementing it as one of the best digital assets to be invested in for the year. Major upgrades to the network like the London hard fork have seen the project move towards a deflationary mechanism, creating scarcity in the asset by burning one-third of the fees issued on the network.\n\nThe ETH mining industry also felt the heat when the Chinese government had begun its crackdown on crypto mining in the middle of the year. Like bitcoin, its mining revenue had been affected by the crackdown. However, ETH did not suffer as much as bitcoin did from this move. Hence, miners of the asset have seen good returns on their activity. The difference has been evident in the mining revenue between bitcoin and ethereum miners.\n\nEthereum Outpaces Bitcoin Mining\n\nMining revenues between Ethereum and bitcoin mining show a discrepancy in their figures. For one, Ethereum miners have definitely had the more profitable year out of the two. Although not a very wide gap, it is still a notable difference in the returns from both assets. While ETH miners saw a total of $17 billion in revenue from their mining activities, bitcoin miners only saw $13.6 billion.\n\nRelated Reading | Goldman Sachs Analysts Shoot For Ethereum At $8,000 With Expected 80% Rally\n\nVolatility between the two assets has also played into how the figures have turned out. Bitcoin mining is associated with high volatility. Yet, ETH has it beat as the asset with the most volatility. ETH mining volatility sat at a staggering 47% compared to bitcoin’s 28%. This volatility in daily revenues plays a big role in the revenue figures for ETH miners.\n\nETH outpaces BTC mining metrics | Source: Arcane Research\n\nThe average daily revenue for BTC mining is $45 million. For ETH, this figure is $56 million. In metrics like average fee percentage of daily revenue and revenue correlation with fees, ETH also recorded higher figures.\n\nETH price trading above $4,500 | Source: ETHUSD on TradingView.com\n\nETH Fees Go UP\n\nSince Ethereum miners’ revenues are largely dependent on fees, the rate of sending transactions on the network greatly affects the mining revenue. As such, ETH’s volatile fee nature can play a positive or negative role in the revenue returns of miners. When fees go up, so do the revenue returns for miners go up, and vice versa. Furthermore, ETH miners usually have a short window where they can collect the revenues, represented by the 0.55% fee correlation shown above.\n\nRelated Reading | PayPal Co-Founder Says Bitcoin Price Points To Crisis In The Economy\n\nThis correlation has played in the favor of ETH miners this year. The growing popularity and adoption of decentralized finance and NFTs have seen fees skyrocket on the network. Being largely dependent on fee revenue, miners have benefitted the most from this spike. Despite the fee burn, rewards for miners on the blockchain are up for the year.\n\nETH mining revenue from fees sits at 53% | Source: Arcane Research\n\nCompared to Ethereum, transaction fees on the bitcoin network have remained mostly low since the bull rally ended in April. ETH miner revenues were made up of 53% of fees for the year. Meanwhile, transaction fees only contributed 1% to the total miner revenue for bitcoin.\n\nFeatured image from Crypto News Flash, chart from TradingView.com"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL3d3dy5jbmJjdHYxOC5jb20vcGhvdG9zL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZS10b2RheS0xMS1tYXktYml0Y29pbi1ldGhlcmV1bS1kb2dlY29pbi1zb2xhbmEtc2hpYmEtaW51LXBvbHlnb24tMTY2MjY1MDEuaHRt0gGMAWh0dHBzOi8vd3d3LmNuYmN0djE4LmNvbS9waG90b3MvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXByaWNlLXRvZGF5LTExLW1heS1iaXRjb2luLWV0aGVyZXVtLWRvZ2Vjb2luLXNvbGFuYS1zaGliYS1pbnUtcG9seWdvbi0xNjYyNjUwMS5odG0vYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin, Ethereum fall, other tokens slide lower after a brief upside - CNBCTV18",
        "content": "1 / 7\n\nBitcoin | The world's largest and most popular virtual currency, Bitcoin, fell 0.6 percent to $27,533.3. Its market value stood at $533.5 billion. The trade volume was at $20.6 billion.\n\n2 / 7\n\nEthereum | The second largest virtual currency, Ethererum or Ether, fell 0.9 percent to $1,832.9 with a market capitalisation of $220.6 billion. The trade volume of Ethereum was $21.7 billion in the last 24 hours.\n\n3 / 7\n\nDogecoin | Meme-based virtual currency, Dogecoin, slipped 0.8 percent on Thursday. Its market value stood at $10.1 billion. The trade volume was at $343.6 million.\n\n4 / 7\n\nSolana | Solana fell half a percent to $20.7 with a market capitalisation of $8.2 billion. The trade volume of Solana was $490.6 million in the last 24 hours.\n\n5 / 7\n\nShiba Inu | Shiba Inu fell 1.4 percent with a market capitalisation of $5.3 billion. The trade volume was $155.2 million in the last 24 hours.\n\n6 / 7\n\nPolygon | Polygon slid 1.2 percent to $0.9 with a market capitalisation of $8.1 billion. The trade volume was $483.3 million in the last 24 hours."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL3d3dy5jbmJjdHYxOC5jb20vY3J5cHRvY3VycmVuY3kvY3J5cHRvLXByaWNlLXRvZGF5LWJpdGNvaW4tZmFsbHMtYmVsb3ctMjdrLWV0aGVyZXVtLWZhbGxzLW92ZXItMi1vdGhlci10b2tlbnMtc2xpZGUtMTY2Mzg4NTEuaHRt0gGMAWh0dHBzOi8vd3d3LmNuYmN0djE4LmNvbS9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1mYWxscy1iZWxvdy0yN2stZXRoZXJldW0tZmFsbHMtb3Zlci0yLW90aGVyLXRva2Vucy1zbGlkZS0xNjYzODg1MS5odG0vYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin falls below 27k, Ethereum falls over 2%, other tokens slide - CNBCTV18",
        "content": "Bitcoin\n\n| The world's largest and most popular virtual currency, Bitcoin, fell 3.01 percent to $26,614.3. Its market value stood at $516.8 billion. The trade volume was at $17.01 billion.\n\nEthereum | The second largest virtual currency, Ethererum or Ether, fell 3.51 percent to $1,763.5 with a market capitalisation of $212.9 billion. The trade volume of Ethereum was $8.51 billion in the last 24 hours. | The second largest virtual currency, Ethererum or Ether, fell 3.51 percent to $1,763.5 with a market capitalisation of $212.9 billion. The trade volume of Ethereum was $8.51 billion in the last 24 hours.\n\nDogecoin | Meme-based virtual currency, Dogecoin, slipped 2.29 percent on Thursday. Its market value stood at $9.87 billion. The trade volume was at $335.2 million. | Meme-based virtual currency, Dogecoin, slipped 2.29 percent on Thursday. Its market value stood at $9.87 billion. The trade volume was at $335.2 million.\n\nSolana | Solana fell 3.39 percent to $19.9 with a market capitalisation of $7.93 billion. The trade volume of Solana was $375.02 million in the last 24 hours. | Solana fell 3.39 percent to $19.9 with a market capitalisation of $7.93 billion. The trade volume of Solana was $375.02 million in the last 24 hours.\n\nShiba Inu | Shiba Inu fell 3.61 percent with a market capitalisation of $118.12 million. The trade volume was $155.2 million in the last 24 hours. | Shiba Inu fell 3.61 percent with a market capitalisation of $118.12 million. The trade volume was $155.2 million in the last 24 hours."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZW4uZXRoZXJldW13b3JsZG5ld3MuY29tL21lbWVjb2luLWNvaW5iYXNlLWFwb2xvZ3ktcGVwZS1uZXdzbGV0dGVyL9IBT2h0dHBzOi8vZW4uZXRoZXJldW13b3JsZG5ld3MuY29tL21lbWVjb2luLWNvaW5iYXNlLWFwb2xvZ3ktcGVwZS1uZXdzbGV0dGVyL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Memecoin Army Extracts Coinbase Apology After Botched Pepe Newsletter - Ethereum World News",
        "content": "Summary:\n\nDeleteCoinbase trended globally on Twitter following intense backlash from Memecoin Pepe holders.\n\nPepe bulls threatening to close their Coinbase accounts trooped out in the thousands on social media.\n\nThe reactions charged out after the company’s newsletter called Pepe a “hate symbol” championed by far-right groups, citing a portion of the Anti-Defamation League’s opinion on Pepe The Frog.\n\nSpeculative traders continue to bask in memecoin mania.\n\nCoinbase apologized to the Pepe memecoin community following roaring social media backlash after a company newsletter painted the frog-themed-meme as a “hate symbol”.\n\nThe email to users quoted an Anti-Defamation League’s publication on Pepe the Frog and internet symbols propagated by far-right groups.\n\nThe [PEPE] token is based on the Pepe the Frog meme, which first surfaced on the internet nearly 20 years ago as a comic-strip character. Over time it has been co-opted as a hate symbol by alt-right groups, according to the Anti-Defamation League,” – From Coinbase’s newsletter\n\nThousands of Pepe bulls flooded crypto Twitter with #DeleteCoinbase posts after the newsletter dropped. Coinbase stock COIN bled as aggrieved Pepe supporters threatened to withdraw their assets and close their accounts on the crypto exchange. Some users also said they would switch to Gemini which supports PEPE trading.\n\nOne user highlighted another portion of the same ADL post that contradicts the platform’s presentation of Pepe meme culture.\n\nWhy you lying @coinbase ?\n\nLooks like the only people practicing defamation are you guys by twisting the words of the ADL and I can't fathom why https://t.co/UR2AXSpoQE pic.twitter.com/VNx2Gnm0yI — Agent PEPE 🪙 (@agentgottlieb) May 11, 2023\n\n‘We screwed up and we are sorry’ – Coinbase Chief Attorney\n\nChief Legal Officer Paul Grewal tweeted to the Pepe community on behalf of the company. “This did not provide the whole picture of the history of the meme and we apologize to the community.”, said Grewal about the company’s newsletter.\n\nThe crypto exchange has been the subject of similar backlash on at least two other occasions.\n\nFor meme-coiners, the apology is another notch on the belt after a blitzing memecoin mania that has spiked gas fees on Bitcoin and Ethereum."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9ldGhlcmV1bS1kb2dlY29pbi1iaXRjb2luLWRyb3AtaG93LXBhdC13YXJzLXByZXNhbGUtY2FuLWJlbmVmaXQtaW52ZXN0b3JzLWR1cmluZy1jcnlwdG8tbWFya2V0LXR1cmJ1bGVuY2Uv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Ethereum, Dogecoin, Bitcoin Drop: How PAT WARS' Presale Can Benefit Investors During Crypto Market Turbulence - Analytics Insight",
        "content": "The crypto market has been experiencing significant turbulence recently, with insiders selling off Ethereum (ETH) and Bitcoin (BTC) and transactions slowing down. This has caused the prices of these major cryptocurrencies to plummet, leaving seasoned investors wondering how to safeguard their investments. In this article, we will explore how investing in presale projects during market uncertainties can be beneficial, specifically in the case of PAT WARS (PAWS).\n\nETH And BTC Drop: How And Why\n\nOver the weekend and into Monday, the crypto market experienced a drop in prices, with insiders selling Ethereum and Bitcoin and transactions slowing down. Bitcoin fell due to Binance temporarily closing withdrawals, causing a backlog of transactions, while Ethereum prices fell after the Ethereum Foundation transferred nearly $30 million of tokens to the Kraken exchange.\n\nOther altcoins also experienced losses, with some down by double digits. The rapid recovery of cryptocurrency assets seen in recent months may have contributed to profit-taking. However, the high gas fees on Ethereum and Bitcoin are becoming an issue, making them almost unusable for smaller transactions. The crypto industry has seen improvements, but investors remain concerned about future drops in the market.\n\nA New Hope For Crypto: PAT WARS’ Presale\n\nEver since its presale was launched, PAT WARS (PAWS) has been rapidly gaining popularity. This particular meme coin is designed specifically for cat lovers and Star Wars fans, much like other memecoins that target specific audiences such as Dogecoin and Shiba Inu. The PAT WARS clan consists of Jedi warrior cats that serve as the project’s mascots. These cute feline creatures are one with the force of crypto, offering sage advice for those who come to them and using their great knowledge to construct their platform.\n\nDespite the intimidating world of crypto, PAT WARS is – first and foremost – committed to empowering its community by fostering strong bonds through its DAO and NFT collection, the first of which enables members to carry out votes and make decisions regarding the trajectory of PAT WARS, and the second offers exclusive content and opportunities for the community to bond over. The project is also focused on constant innovation and improvement, with its security and speed being enhanced by being built on the Ethereum network.\n\nPepe Coin Threatens Dogecoin’s Status\n\nCrypto analyst LilMoonLambo recently suggested in a tweet that Pepe Coin (PEPE) could replace Dogecoin (DOGE) as a market sentiment indicator. LilMoonLambo proposed that a surge in the price of PEPE would signal a bullish trend in the broader market. Over the past few days, some large-scale investors or “crypto whales,” including “Machi Big Brother,” have reportedly been purchasing significant amounts of PEPE, with its price standing at $0.00000193 as of now. However, some analysts have expressed concerns that the current frenzy surrounding meme coins like PEPE could be harmful to Bitcoin’s performance. Despite this, PEPE still holds a market cap of over $809 million, even after it recently decreased from its all-time high.\n\nAs larger and more established coins struggle to keep their status and value, one might turn towards investing in smaller and newer projects. PAT WARS’ presale can be a buoy in this market turbulence and can be an effective way to diversify one’s portfolio and hedge against losses in other crypto assets. Plus, when a project is this new, the price of a token is so low that any loss would be minuscule, while gains can be quite high.\n\nLet the feline force flow through you and join the PAT WARS presale now:\n\nPresale: https://www.patwars.com/how-to-buy\n\nWebsite: https://www.patwars.com/\n\nTelegram: https://t.me/PATWARSOfficial\n\nTwitter: https://twitter.com/PATWARSOfficial\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vZmluYm9sZC5jb20vY3J5cHRvLWNvbW11bml0eS13aXRoLTkwLWhpc3RvcmljYWwtYWNjdXJhY3ktc2V0cy1ldGhlcmV1bS1wcmljZS1mb3ItbWF5LTMxLTIwMjMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Crypto community with 90% historical accuracy sets Ethereum price for May 31, 2023 - Finbold - Finance in Bold",
        "content": "Disclaimer: The CoinMarketCap cryptocurrency community price estimate is based only on the votes of its users. Estimates do not guarantee end-of-month prices.\n\nWhile the largest part of the cryptocurrency market has been going through a rough patch in recent weeks, trading sideways at best, its second-largest asset by market capitalization – Ethereum (ETH) – has been no exception, and the crypto community does not seem to expect much improvement in the near future.\n\nSpecifically, according to the aggregated 1,388 votes from members of the cryptocurrency monitoring website CoinMarketCap, the average price of Ethereum for May 31, 2023, is currently set at $1,834.52, the information retrieved by Finbold on May 11 reveals.\n\nIndeed, if the CoinMarketCap community’s current projections do come about, this predicted average price would represent a modest increase of +$13.61 or +0.75% to the price of Ethereum at the time of publication.\n\nETH end-of-May price estimation. Source: CoinMarketCap\n\nMeanwhile, the community at the crypto tracking platform has had a historical accuracy of 90.24% in guessing the digital asset’s average price. In other words, it makes it a useful tool for investors to try and gauge the market sentiment and future price trends.\n\nETH 6-month estimation accuracy. Source: CoinMarketCap\n\nEthereum price analysis\n\nAs things stand, Ethereum is currently changing hands at the price of $1,821, down 0.95% on the day, as well as 4.28% across the previous week, adding up to the cumulative losses of 5.11% on its monthly chart, according to the latest data on May 11.\n\nEthereum 7-day price chart. Source: Finbold\n\nIt is also worth noting that Ethereum had earlier breached an important demand wall at $1,850 – $1,905, as observed by crypto trading analyst Ali Martinez. As he concluded, the digital asset needed to regain this critical support level to avoid declining further, Finbold reported on May 10.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDUvMTIvYmluYW5jZS1iaWctbmV3cy1iZXRoLWNyeXB0by_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Binance: big news on BETH crypto - The Cryptonomist",
        "content": "Binance has just made an important announcement: from 18 May, all BETH crypto redeems within the exchange will be processed in just 5 days, significantly reducing the wait for users to redeem their ETH.\n\nBETH represents a liquid version of Ethereum stakes on Binance, where users can use it as liquidity while waiting to redeem ETH from the Beacon chain.\n\nBinance and the decision to reduce the wait time to redeem BETH crypto\n\nAs previously announced, Binance announced yesterday that as of 18 May at 08:00 UTC, all redemption requests for the BETH crypto, the liquid staking version of Ethereum, will be processed in just 5 days.\n\nThis is great news for users of the crypto exchange, as the average wait time to redeem stacked ETHs is currently around 15 days.\n\n#Binance will reduce the processing time for $ETH Staking withdrawals to 5 days from the original 15 days.https://t.co/2cLwhAHp1m — Binance (@binance) May 11, 2023\n\nThe decision to shorten the withdrawal processing timeframe is based on a commitment to providing the best end-user experience in a service where wait times are not only dependent on Binance, but also and most importantly on the traffic and participants within the Beacon Chain.\n\nIt is curious to note that, in fact, new validator activations far outnumber exit requests these days.\n\nSpecifically, there are 41,455 validators waiting to join the Beacon Chain, in a queue that will be cleared in approximately 23 days, while on the other side there are only 40 validators who will have completed the exit process within the next half hour.\n\nIn recent days, the number of outgoing validators has also dropped to zero.\n\nThis fact, along with the ability of the user side to withdraw their staked ETHs more quickly, either directly on the ETH 2.0 platform or through intermediaries such as Binance, reinforces the narrative of the longevity and resilience of the Ethereum network.\n\nAt the time of writing, the number of locked coins within the Beacon chain has reached a new all-time high of 19,767,969 ETH, easing selling pressure in the markets and creating scarcity.\n\nCrypto BETH and other liquid versions for ETH staking\n\nThe crypto BETH is just one of the liquid versions in circulation to support the staking of ETH and the transition from POW to POS that took place with the Shapella hard fork on 12th April.\n\nThis type of token can be redeemed at a 1:1 ratio with the amount of coins previously staked, now that the staking of ether on the Beacon Chain has been legitimised.\n\nBETH was launched by Binance in April 2021, and for two years served as a way for users to enjoy alternative liquidity while their ETHs were locked into the ETH 2.0 platform.\n\nThe crypto is actually priced the same as ETH (with a minimum spread) and can be traded for other assets on Binance’s internal market and other exchanges such as Okx, Huobi and PancakeSwap.\n\nSome of the most popular liquid versions that have a parity relationship with ETH staked on the Beacon chain include Lido, Coinbase wrapped staked ETH, Rocket Pool and StakeWise.\n\nIn total, the liquid staking market for ETH is worth $15.56 billion, which is approximately 40 percent of the value deposited by users to support the blockchain’s proof-of-stake. Lido has a dominant position with 74.35% of the market.\n\nThese tokens not only give users additional liquidity that they would not have had if they had decided to deposit their coins on ETH 2.0 themselves, but also allow those who do not have large amounts of capital to participate in the stakes.\n\nIn fact, in order to activate the validator software without relying on third-party intermediaries such as those mentioned above, it is necessary to have as much as 32 ETH at one’s disposal, which is currently equivalent to $56,300.\n\nIt will be interesting to see how this niche market develops and whether there will be more or less of an influx towards liquid staking services in the coming years, both with regard to Ethereum’s staking validators and for other protocols and blockchains.\n\n​​ETH TVL chart in liquid betting logs\n\n15 May opens for Lido withdrawals: volatility on the way?\n\nAs the Beacon Chain attracts more and more inbound validators and fewer and fewer outbound validators, all eyes are on one date in particular: 15th May.\n\nOn that day, Lido, the largest liquid wagering platform on the market, will allow the release of no less than 270,000 ETHs, equivalent to around $500 million, which will most likely be poured into the cryptocurrency markets.\n\nThis is a large amount, but it is not the same as the remaining 6.29 million ETHs, which will gradually be released for an equivalent of $11 billion.\n\nVolatility is therefore expected in the price of the second largest cryptocurrency by market capitalisation and the crypto market in general.\n\nAs the news was announced by Lido itself and spread by the various crypto influencers, traders could anticipate trades by going short ETH even over the weekend.\n\nEthereum may experience serious pressure on the price in the near future:\n\n\n\nThe largest staker of ETH coins, Lido Finance, announced the release of an update on May 15, in which the withdrawal of coins from staking pools will become available. The developers claim that the… pic.twitter.com/NOeiNwiFyv — CCC.io (@CryptoCoinCoach) May 10, 2023\n\nHowever, more than the number of ETHs to be taken by Lido per se, the fear of market declines is related to the mainstream narrative of ‘potential selling pressure’.\n\nIf we take a close look at the average trading volumes on Ethereum, we see that there have been $9.7 billion worth of trades in the last 24 hours.\n\nThe 270,000 ETH that MAY (not necessarily) be sold represent only 5% of the coins traded daily.\n\nBe careful because in such complex situations there are often manipulation attempts and up or down fakes that force the forced liquidation of leveraged positions.\n\nIt is much better to trade on the spot market or use low leverage to prevent the whales from getting the upper hand over small traders.\n\nBe on your guard!"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vYmxvY2tjaGFpbnJlcG9ydGVyLm5ldC9idGMtYW5kLWV0aC1kcm9wLWZ1cnRoZXItYXMtY2Fwby1kb21pbmF0ZXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "BTC and ETH Drop Further as CAPO Dominates - Blockchain Reporter",
        "content": "Today’s market session has kicked off on a rather bearish note with the global market cap recording a 2.69% drop within a day of trading taking the total cap to $1.11T as of press time. BTC, the crypto king continues to face turbulence as it now drops back to the $26K level as of today’s trading session. Trading at $26.6K, BTC had recorded a drop of over 3% within a day of trading as it now sits on a weekly loss in valuation of 8.9%. Bitcoin’s trading volume has faced a 15% within the same period as the total cap also dropped by 3% within the same period.\n\nBitcoin’s volatility levels are rather stable with the Bollinger bands now moving closer to each other. The MACD indicator is moving below the average line, signalling a bearish trend on Bitcoin’s network. The relative strength index indicator is also moving below its average line as bears look to drive the asset to the oversold region.\n\nBTC 1-day chart | Source: TradingView\n\nAltcoin analysis\n\nEthereum’ the altcoin king, is also on for a bear market recording a drop of 3.4% within 24 hours. ETH has now dropped back to the $1.7K level as the asset sat on a weekly drop of 6.98%. Trading at $1764 as of press time, ETH’s trading volume had recorded a decrease of 13% within 24 hours.\n\nRipple has however defied today’s bear market as it now trades at %0.436 as of press time, representing a 1.7% increase within 24 hours. Ripple is looking to recover from a weekly loss of 5.7% as its trading volume recorded a surge of 7.5% within a day of trading.\n\nXRP 1-day chart | Source: CoinMarketCap\n\nOther altcoins are however in a turbulent market session with Dogecoin and Litecoin recording drops of 1% within 24 hours, as Solana, DOT, and Tron dropped their valuations by more than 2% as Polygon lost 3% as of press time.\n\nToday’s most notable gainer is bagged by CAPO, trading at $0.0166, representing a 24-hour gain of 115% as well as a weekly gain of 777%. CAPO’s trading volume has also surged by a tremendous 233% as its total cap also went up by over 100%. CAPO is ranking at 6th on CoinMarketCap’s trending list.\n\nCAPO 1-day chart | Source: CoinMarketcap\n\nSuipad has also surged massively recording a 24-hour gain of 49%. Trading at $0.2602 as of press time, the asset’s market cap has also raised by over 50% within the same period."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi9idXNpbmVzcy9maW5hbmNlL3VuZGVyc3RhbmRpbmctZXRoZXJldW0tZm9ya3MtaGFyZC1mb3Jrcy12cy1zb2Z0LWZvcmtzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Understanding Ethereum Forks: Hard Forks Vs Soft Forks - Inventiva",
        "content": "Understanding Ethereum Forks: Hard Forks vs Soft Forks\n\nEthereum is a decentralized blockchain platform that has undergone several forks throughout its history. Forks are upgrades or changes to the underlying protocol of a blockchain network, and they can be either hard forks or soft forks. Understanding the difference between these two types of forks is crucial for anyone interested in Ethereum and its development. In this article, we will explore the differences between hard forks and soft forks and their impact on the Ethereum community. So, if you are a newbie in ETH investment, here is a Guide for Investing in Ethereum.\n\nHard Forks\n\nA hard fork occurs when there is a significant change to the rules of the blockchain, resulting in a split from the original blockchain. This means that nodes that do not upgrade to the new rules will be unable to validate transactions on the new chain. Hard forks are usually initiated to introduce new features, fix critical bugs or address issues of network security.\n\nOne notable hard fork in Ethereum’s history is the DAO fork. In 2016, the Decentralized Autonomous Organization (DAO), a venture capital fund on the Ethereum network, was hacked, resulting in the loss of millions of dollars worth of Ether. To recover the lost funds, a hard fork was proposed, which would essentially revert the blockchain to before the hack occurred. This hard fork was successful and resulted in the creation of a new chain, now known as Ethereum (ETH), while the original chain continued as Ethereum Classic (ETC).\n\nAnother example of a hard fork in Ethereum’s history is the Constantinople fork, which was implemented in 2019 to address issues related to network efficiency and gas prices. The hard fork introduced several upgrades, including changes to the block rewards and improvements to the network’s data storage capacity.\n\nHard forks can have a significant impact on the Ethereum community, as they can result in the creation of two separate chains with different rules and features. However, hard forks can also bring about improvements and enhancements to the network. It is important for members of the community to carefully consider the implications of a hard fork before deciding to support or oppose it.\n\nSoft Forks\n\nA soft fork, unlike a hard fork, is a backward-compatible upgrade to the blockchain, meaning that nodes that have not upgraded to the new rules can still validate transactions on the network. This is because the new rules are a subset of the old rules, meaning that older nodes can still participate in the network.\n\nOne example of a soft fork in Ethereum’s history is the Homestead fork, which was implemented in 2016 to introduce new features and improve network security. The Homestead fork introduced changes to the protocol, including improvements to the gas pricing system and the addition of new opcodes to the Ethereum Virtual Machine.\n\nAnother example of a soft fork in Ethereum’s history is the Byzantium fork, which was implemented in 2017 to introduce improvements related to network efficiency and security. The Byzantium fork introduced several changes, including a reduction in the block reward and the introduction of the “replay attack” protection mechanism.\n\nSoft forks are generally less disruptive than hard forks, as they do not result in a split in the network. However, they can still have a significant impact on the network and its users, particularly if the changes introduced are critical to the functioning of the network. It is important for members of the community to stay informed about soft forks and their implications.\n\nForks and Consensus\n\nIn Ethereum, forks are ultimately determined by the consensus of the network. Consensus is the process by which nodes on the network agree on the state of the blockchain. Consensus can be achieved through different mechanisms, including proof-of-work (PoW), proof-of-stake (PoS), or a hybrid of the two.\n\nIn the case of a hard fork, achieving consensus can be challenging, as some nodes may choose not to upgrade to the new rules. This can result in a split in the network, with some nodes continuing to validate transactions on the original chain and others validating transactions on the new chain.\n\nIn the case of a soft fork, achieving consensus is generally easier, as the new rules are a subset of the old rules, meaning that older nodes can still participate in the network. This makes it less likely that a split in the network will occur.\n\nConclusion\n\nTo sum up, Ethereum forks are a crucial part of the platform’s development and evolution. Depending on the modifications they make, hard forks and soft forks have distinct ramifications and can be more or less divisive. Keeping up with forks and their possible effects on the network is crucial for community members. People can help the Ethereum ecosystem continue to expand and evolve by recognizing forks and their importance."
    }
]