[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtcmVnYWlucy0xODIwLWZ1ZWxlZC1ieS10aGVzZS10cmlnZ2Vycy1kZXRhaWxz0gFOaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtLWV0aC1yZWdhaW5zLTE4MjAtZnVlbGVkLWJ5LXRoZXNlLXRyaWdnZXJzLWRldGFpbHM_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Regains $1,820 Fueled by These Triggers: Details - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nOver the past 24 hours, the second most popular cryptocurrency, Ethereum, has added nearly 6%, rising to the $1,821 level. A recent tweet published by the Santiment analytics team hints at the reasons that have suddenly pushed ETH up.\n\nEthereum jumps 5.93%: reasons behind it\n\nThe main reason, per Santiment, for the Ethereum price surge is that it has been following the growth of Bitcoin, just like the rest of the crypto market. The flagship cryptocurrency recaptured the $28,000 level (surging by 7.71% within 24 hours) after the news of main Wall Street companies — Fidelity, Charles Schwab and Citadel Securities — launching a crypto exchange dubbed EDX.\n\n📈 Powered by #Bitcoin's jump back above $28.8k & #Ethereum's return above $1,820, price pumps are being seen market-wide. Based on @santimentfeed's coverage of 2,648 #crypto assets, volume is 30.2% higher than the past week & discussion rates are up big. https://t.co/ZB9dcl8Tvv pic.twitter.com/TFIZha0ylk — Santiment (@santimentfeed) June 21, 2023\n\nThe news of these top players entering the crypto space has apparently fueled the sudden spike of Bitcoin followed by Ethereum and other cryptos jumping in price as well. Prior to that, the world's largest wealth manager, BlackRock, announced that it filed for a Bitcoin spot ETF, with rumors about Fidelity having similar plans following almost immediately.\n\nBesides, as reported by U.Today earlier, global wealth management company Invesco also filed for a spot BTC exchange-traded fund, according to a recently published SEC document.\n\nAside from the new Wall Street-backed exchange, a lot of dormant BTC whales have begun moving their Bitcoins back into the market, according to another tweet by Santiment.\n\nSantiment also stated that Ethereum was pushed up not only by Bitcoin but also by a massive surge in trading volume on the crypto market — $222 billion last week, which was 30% more than the week before that seen.\n\nWall Street enters crypto, while SEC sues major exchanges\n\nLast week, the crypto market experienced a wave of shock as the SEC filed charges against the two largest crypto exchanges in the U.S., Binance and Coinbase. The regulator claimed that these platforms violated U.S. securities laws.\n\nThis happened after SEC first sued Ripple Labs in late 2020 and has recently been clamping down on various crypto platforms, including, again, Coinbase (when it forbade them to launch a crypto lending service last year) and Kraken.\n\nHowever, at the same time, large Wall Street companies are entering the crypto space as was mentioned above, including the largest bank in Germany, Deutsche Bank, now seeking a license to start offering crypto custodial services to its clients.\n\nSome thought leaders in crypto believe that the SEC is sweeping out major crypto companies from the U.S., so that Wall Street giants can take their place and grab up their income. However, many Bitcoin maxis believe that Wall Street entering crypto is a great sign for Bitcoin adoption and for BTC's future."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LmNyeXB0by1yZXBvcnRlci5jb20vbmV3cy9ldGhlcmV1bS11c2UtY2FzZXMteW91LW1pZ2h0LW5vdC1rbm93LTQ3NDQ5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Use Cases You Might Not Know - Crypto Reporter",
        "content": "Ethereum, a decentralized blockchain platform, has gained significant attention for its role in powering cryptocurrencies like Ether (ETH). However, Ethereum’s potential extends beyond just being a digital currency. In this article, we will explore some lesser-known use cases of Ethereum that highlight its versatility and transformative capabilities. From decentralized finance to supply chain management and even digital identity solutions, Ethereum is revolutionizing industries in ways you might not have imagined. So, let’s dive into this listicle and discover the diverse applications of Ethereum.\n\nDecentralized Finance (DeFi)\n\nOne of the most prominent use cases of Ethereum is its role in the decentralized finance sector. Ethereum enables the creation of smart contracts, which are self-executing agreements that eliminate the need for intermediaries. DeFi platforms built on Ethereum allow users to access various financial services, such as lending, borrowing, decentralized exchanges, and yield farming, without relying on traditional banking institutions. The transparency and security provided by Ethereum’s blockchain make DeFi applications more efficient, accessible, and inclusive.\n\nTokenization of Assets\n\nEthereum’s smart contract capabilities enable the tokenization of real-world assets, such as real estate, artwork, or even rare collectibles. By representing these assets as tokens on the Ethereum blockchain, ownership and transfer become more efficient, transparent, and accessible to a broader audience. Tokenization has the potential to revolutionize traditional asset ownership models, unlocking liquidity and fractional ownership opportunities.\n\nOnline Betting with Ethereum\n\nEthereum’s blockchain technology has paved the way for decentralized online betting platforms. By utilizing smart contracts, Ethereum enables secure and transparent betting experiences. Ethereum sports betting, in particular, has gained popularity, allowing users to place bets on sporting events using Ether. These platforms eliminate the need for intermediaries, provide fair odds, and ensure prompt payouts, enhancing the overall betting experience.\n\nSupply Chain Management\n\nEthereum’s blockchain technology can enhance supply chain management by providing transparency, traceability, and immutability. By recording each step of a product’s journey on the Ethereum blockchain, stakeholders can verify its origin, authenticity, and compliance with regulations. This technology has the potential to combat counterfeiting, improve inventory management, and build trust between suppliers, manufacturers, and consumers.\n\nDecentralized Governance\n\nEthereum’s decentralized nature makes it an ideal platform for experimenting with decentralized governance models. Through the use of smart contracts and decentralized autonomous organizations (DAOs), Ethereum allows communities to govern themselves and make collective decisions. These governance models can be applied to various domains, such as voting systems, project funding, or even decentralized social networks, empowering individuals and fostering more inclusive decision-making processes.\n\nDigital Identity Solutions\n\nEthereum can revolutionize digital identity management by providing individuals with control over their personal data. Using Ethereum’s blockchain, individuals can create self-sovereign identities that are secure, portable, and verifiable. This eliminates the need for centralized identity providers and puts individuals in charge of their personal information. Digital identity solutions built on Ethereum can enhance privacy, reduce identity theft, and enable seamless verification across different platforms.\n\nGaming and Non-Fungible Tokens (NFTs)\n\nEthereum’s blockchain has been at the forefront of the booming NFT market. NFTs are unique digital assets that can represent ownership of in-game items, virtual real estate, digital art, and more. Ethereum’s smart contracts enable the creation, ownership, and transfer of NFTs, providing a secure and transparent infrastructure for the gaming and digital art industries. NFTs have the potential to revolutionize ownership and monetization in the virtual world, creating new opportunities for creators, collectors, and gamers.\n\nDecentralized File Storage\n\nTraditional file storage systems are centralized, making them vulnerable to data breaches and censorship. Ethereum’s blockchain can be utilized to create decentralized file storage solutions, where files are distributed across a network of nodes rather than being stored in a central server. This enhances data security, reduces reliance on centralized platforms, and enables users to have greater control over their data.\n\nEnergy Trading and Grid Management\n\nEthereum’s blockchain technology can facilitate peer-to-peer energy trading and improve grid management. By leveraging smart contracts, individuals and businesses can trade excess energy directly with each other, eliminating the need for intermediaries. Additionally, Ethereum’s blockchain can enable more efficient management of energy grids by tracking energy production and consumption in a transparent and secure manner.\n\nIntellectual Property Rights\n\nIntellectual property rights management can be improved using Ethereum’s blockchain. Smart contracts can automate the licensing, distribution, and royalties of digital content, ensuring that creators are properly compensated for their work. Blockchain-based solutions on Ethereum offer a transparent and tamper-proof mechanism for tracking and enforcing intellectual property rights, revolutionizing the creative industries.\n\nMusic and Royalty Management\n\nThe music industry faces challenges in terms of royalty distribution and copyright management. Ethereum’s blockchain can provide a transparent and efficient solution for music rights management. Smart contracts can automate royalty payments, ensuring that artists receive their fair share of revenue. Additionally, blockchain-based platforms can enable direct peer-to-peer music sharing and monetization, allowing artists to connect directly with their audience and bypass traditional record labels.\n\nHealthcare Data Management\n\nEthereum’s blockchain has the potential to revolutionize healthcare data management by providing a secure and interoperable platform. Patient records, medical research, and clinical trial data can be stored on the blockchain, ensuring privacy, integrity, and accessibility. This can facilitate seamless data sharing between healthcare providers, enhance medical research, and improve patient outcomes.\n\nWind Up\n\nEthereum’s impact goes beyond just being a cryptocurrency platform. Its smart contract capabilities have opened up a world of possibilities, revolutionizing industries ranging from finance and supply chain management to gaming and digital identity. Ethereum’s decentralized nature, transparency, and security make it an ideal platform for transforming traditional systems into more efficient, inclusive, and trustworthy solutions. As Ethereum continues to evolve and innovate, its potential use cases will only expand further, leading to a more decentralized and interconnected future."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vYXdzLmFtYXpvbi5jb20vYmxvZ3MvZGF0YWJhc2UvYXdzLW5pdHJvLWVuY2xhdmVzLWZvci1ydW5uaW5nLWV0aGVyZXVtLXZhbGlkYXRvcnMtcGFydC0xL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "AWS Nitro Enclaves for running Ethereum validators – Part 1 | Amazon Web Services - AWS Blog",
        "content": "In this series of posts, we provide prescriptive guidance in secure operation of Ethereum validator keys using AWS Nitro Enclaves for node operators who provide staking pools and staking-as-a-service.\n\nIn this post (Part 1), we explain why AWS Nitro Enclaves are well suited to run Ethereum validators in a secure fashion and we provide a high-level architecture of such a Nitro Enclaves-based validator signing service.\n\nIn the code sample GitHub repository, we provide a step-by-step walkthrough of how to deploy a Nitro Enclaves-based validator signing service.\n\nIn Part 2, we conduct a technical deep dive into the Nitro Enclaves-based validator architecture.\n\nEthereum proof-of-stake and validators\n\nPublic blockchains differ in their protocol and consensus design, implementation language, and smart contract capabilities.\n\nDetermining how external participants can be incentivized to join a network and run their own node is key in economic design principles rooted in game theory, where you’re designing the network to be more decentralized while improving robustness.\n\nEthereum transitioned its consensus mechanism from proof-of-work to proof-of-stake in September 2022 to achieve better security, lower energy consumption requirements, and further enable scaling solutions built on top of it. In a proof-of-stake network, the network participants, called validators, are responsible for checking and attesting that new blocks proposed by other validators are valid, and occasionally creating and proposing (propagating) new blocks themselves. As an economic incentive, validators earn rewards in the form of Ether for performing these tasks.\n\nTo ensure that validators behave honestly, each validator must stake 32 Ether (ETH) as collateral into a smart contract. If the validator behaves dishonestly, such as attempting to propose an invalid block, their collateral will be slashed. There are also minor slashing penalties for being offline, but these are far less significant than penalties for dishonest behavior. Each validator has a public-private keypair associated with it, which we explore in more depth later in this post. For more information on proof-of-stake, refer to PROOF-OF-STAKE (POS).\n\nThere are multiple ways for users to participate in Ethereum staking:\n\nRun their own validator nodes – Users run and maintain validator nodes and have 32 ETH per validator to deposit as collateral. The user has full control of the node and the validator key. Use a staking-as-a-service provider – Users still provide 32 ETH per validator, but offload the operational aspects to a node provider who runs the validator nodes, and maintains the validator keys for the user. Join a staking pool – Users can stake any amount of ETH. The ETH staked by the users are pooled and validator nodes are run by an entrusted third party. This option is attractive to users who don’t have 32 ETH or are not comfortable staking that amount.\n\n\n\nIn the first scenario, the user realizes all of the rewards, whereas in the other two scenarios, the providers may take a percentage of the rewards as payment for their services.\n\nImportance of securing validator keys\n\nRunning Ethereum validator nodes is crucial for the health of the Ethereum network but poses a potential security risk. The validator keys (the public and private keys) are used to collect and withdraw the 32 ETH collateral and any rewards that have been collected. The withdrawal feature is available in Ethereum’s Shapella update. Generating and storing validator keys in an unsecure manner poses risks of leaked keys. Other than withdrawal of the collateral from malicious parties, leaked keys can also be used to perform long-range attacks, putting the entire Ethereum network at risk of a history rewrite. Long-range attacks work by creating and maintaining a parallel chain, thereby rewriting the entire history of the blockchain. To reconstruct a parallel chain, the keys of past validators are needed.\n\nYou can use services like AWS Key Management Service (AWS KMS) to mitigate some of the risks associated with the handling of private keys that need to be programmatically accessible (hot wallets or warm wallets). For additional information on how to use AWS KMS for regular Ethereum account keys, refer to How to sign Ethereum EIP-1559 transactions using AWS KMS.\n\nDue to the BLS12-381 elliptic curve introduced for the Ethereum consensus layer, services like AWS KMS can’t be used to protect validator keys as of this writing. Therefore, there is a need for a secure run environment to use the validator keys.\n\nThe following solution is primarily aimed at node operators who provide staking pools and staking-as-a-service. Individual stakers can also adopt the solution, but might find the cost of running the solution prohibitive if they only stake the minimum amount of ETH.\n\nSolution overview\n\nThe following diagram illustrates the architecture for our Nitro Enclaves-based validator signing service.\n\nNitro Enclaves use the Nitro Hypervisor to provide an isolated compute environment to protect and securely process highly sensitive data like personally identifiable information (PII) or private keys.\n\nThe hypervisor isolates the CPU and memory of the enclave from the parent instance and just exposes a secure local channel (vsock) for the communication between the parent instance and the enclave. That way, no user, application, or library of the parent instance is able to get access to critical information processed inside the enclave.\n\nEvery 12 seconds, a new block is proposed to the Ethereum network. This is referred to as a slot. Validator clients such as Lighthouse and Teku attest the proposed block. Occasionally, instead of attesting, a validator is randomly selected to propose a block. Both attestations and block proposals have to be signed by a validator private key. In our solution, the validator client has been configured to perform remote signing—in other words, offloading the signing process to Web3Signer, an open-source blockchain signing service. It does this by invoking Web3Signer’s HTTPS REST API.\n\nWeb3Signer will sign attestations and block proposals, using the plaintext validator private keys that are loaded into the enclave. The encrypted validator private keys are stored in Amazon DynamoDB. In a staking-as-a-service provider, there can be hundreds of validator private keys mapped to multiple Web3Signer instances, therefore it’s operationally simpler and more cost-efficient to use DynamoDB instead of AWS Secrets Manager. The validator private keys are encrypted using a KMS key.\n\nIn our architecture, Web3Signer runs in the Nitro Enclave. It’s important to point out that in terms of security, the Web3Signer runtime is provided by a Nitro Enclave and therefore is protected from attacks or risks like memory dumps or insufficient file system privileges. Nevertheless, by exposing Web3Signer’s HTTPS REST API via vsocket to the VPC, new potential attack vectors are being introduced associated with the application itself, which can’t be mitigated by a secure runtime environment like Nitro Enclaves. These attack vectors require a different set of measurements, like preventing public API access or advanced authentication mechanisms like client certificate based authentication.\n\nThe next section in this post provides details on how the private keys are decrypted and loaded into Web3Signer in Nitro Enclave.\n\nTo ensure high availability, the Web3Signer Amazon Elastic Compute Cloud (Amazon EC2) instances are deployed in an Auto Scaling group across multiple Availability Zones. These instances load the same validator keys from DynamoDB. A Network Load Balancer (NLB) forwards the signing request to one of the instances. Multiple validator clients can connect to the same NLB.\n\nEC2 instances hosting Nitro Enclaves should not be publicly accessible and therefore are located in private subnets. EC2 instances have secure outbound internet access via a NAT gateway to download operating system updates and other packages. In a production environment, updates and other dependencies can be provided by custom Amazon Machine Images (AMIs). That way, no outbound internet connectivity is required.\n\nCommunication with AWS services like AWS KMS or DynamoDB should not traverse the internet and therefore is kept private via interface VPC endpoints that have been placed inside the subnets in each Availability Zone.\n\nAlso, the provided AWS Cloud Development Kit (AWS CDK) source just covers the area in the architecture diagram marked in red. Validator clients and beacon-chain or consensus layer clients have to be deployed separately. The high-availability design and slashing protection for validator and beacon-chain clients are outside the scope of this series of posts.\n\nBootstrapping and signing flow\n\nThe following diagram depicts the components deployed inside the EC2 instances and the general communication flow with external AWS services like DynamoDB and AWS KMS.\n\nIn general, there are two prerequisites:\n\nOne or more Ethereum validator keys have been encrypted and stored inside DynamoDB. To securely generate and encrypt Ethereum validator keys, refer to Securely generate Ethereum validator keys at low cost using a serverless architecture on AWS. For testing purposes, a similar functionality is provided in the walkthrough section of the accompanying AWS CDK code.\n\nA TLS key-pair for Web3Signer has been encrypted and stored inside DynamoDB. Instructions on how to generate the TLS keypair are provided in the README section of the accompanying AWS CDK code.\n\nThe following steps explain at a high level how Ethereum attestations and block proposals are signed inside Nitro Enclaves. The numbers correspond with the numbers shown in the preceding diagram.\n\nIf all config artifacts are present, the enclave can start. All artifacts are passed into the enclave in encrypted fashion. kmstool-enclave-cli, a tool provided by the Nitro Enclave service team, is used from inside the enclave to decrypt the config artifacts using cryptographic attestation. The decrypt request augmented with the cryptographic attestation document is routed to AWS KMS via vsock-proxy provided by AWS. All decrypted config artifacts are stored on the enclaves in memory file system. The Web3Signer process starts. After the enclave has successfully been bootstrapped with the provided TLS keypair and the Ethereum 2 private key, https_proxy will act as an HTTPS endpoint for Web3Signer running inside the enclave. The Web3Signer API endpoint is now exposed to outside of the EC2 instance and able to process incoming signing requests, for example, originating from an Ethereum 2 validator node. Signing requests are forwarded inside the enclave via the vsock connection, in an encrypted way. The TLS connection between the validation client and Web3Signer is stopped inside the enclave, resulting in an end-to-end encrypted transport.\n\nAdditional details about the HTTPS over vsocks tunnel and the bootstrapping process can be found in Part 2 of this series.\n\nIn terms of configuration, you shouldn’t configure more than one validator client to the same validator keys. Doing so poses a high risk of signing attestations for different block proposals, or proposing different blocks in the same slot. These activities will lead to slashing and result in losing some of the validator’s staked ETH. Web3Signer offers a slashing protection feature to protect against these scenarios. To simplify the deployment, Web3Signer in the accompanying AWS CDK code doesn’t have slashing protection. However, this could be included in future revisions of the code.\n\nConclusion\n\nIn this post, we provided a high-level introduction to Nitro Enclaves and explained why Nitro is well suited to run Ethereum validators. We also explained the high-level bootstrapping and signing process using Nitro Enclave.\n\nYou can deploy the solution by following the instructions in the end-to-end walkthrough located in the GitHub repository. You can also dive deep into the Web3Signer integration pattern, secure bootstrapping of processes inside Nitro Enclaves, and HTTPS over vsock tunnels in Part 2.\n\nAbout the Authors\n\nDavid-Paul Dornseifer is a Blockchain Architect with the AWS Worldwide Specialist Solutions Architect organization. He focuses on helping customers design, deploy, and scale end-to-end blockchain solutions.\n\nAldred Halim is a Solutions Architect with the AWS Worldwide Specialist Solutions Architect organization. He works closely with customers in designing architectures and building components to ensure success in running blockchain workloads on AWS."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vbmZ0bm93LmNvbS9uZXdzL3doYXQtYXJlLWV0aHNjcmlwdGlvbnMtaW5zY3JpcHRpb25zLW9uLXRoZS1ldGhlcmV1bS1ibG9ja2NoYWluLWV4cGxhaW5lZC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "What are Ethscriptions? Inscriptions on the Ethereum Blockchain, Explained - nft now",
        "content": "Bitcoin Ordinal Inscriptions have significantly impacted the Web3 space since the Ordinals protocol was introduced in January 2023. Millions upon millions of Inscriptions have been minted, inspiring established projects to expand from Ethereum and Solana to Bitcoin.\n\nOrdinals also seem to have inspired Ethscriptions — a recently launched (and quickly adopted) protocol that enables the creation and sharing of digital entities on the Ethereum blockchain (as long as they’re under 96 kilobytes).\n\nCreated by Tom Lehman, co-founder of Genius.com, the innovation has sparked considerable interest since its June 17 launch, with over 130,000 Ethscriptions generated to date. To add to the excitement, Lehman also introduced Ethereum Punks, a collection consisting of 10,000 Punks that were all claimed within hours.\n\nSo what exactly are Ethscriptions? We dive into the new protocol, how it works, and why Lehman believes it’s needed.\n\nHow do Ethscriptions work?\n\nEthscriptions work by harnessing Ethereum “calldata” — the data passed along in a token that allows us to send messages to other entities or interact with smart contracts — to inscribe non-financial data directly onto the Ethereum main chain. According to Lehman, this allows for a more affordable and decentralized alternative to contract storage.\n\nIt's cheaper and more decentralized than using contract storage.\n\n\n\nAlso protocol guarantees global uniqueness of the content of all valid Ethscriptions!\n\n\n\nPlus it's skating to where the puck is going in an L2 world. — Middlemarch (@dumbnamenumbers) June 17, 2023\n\nEthscriptions operate on the Ethereum platform in the following manner:\n\nAn Ethscription is created whenever an Ethereum transaction is successful, and its input data (interpreted as UTF-8) forms a valid data URI. This URI must be unique, meaning duplicate content is disregarded. Ethscriptions support all valid mimetypes. The URI’s uniqueness is guaranteed by ensuring that no prior block or transaction within the same block has identical content as the Ethscription. The input data of any Ethereum transaction can also serve as a valid Ethscription transfer, as long as the data is the transaction hash of a valid Ethscription and the sender of the transaction is the rightful owner of the Ethscription. When an Ethscription is created, the recipient becomes the initial owner, while the sender is designated as the Ethscription’s creator.\n\nRight now, Ethscriptions can only be images, but Lehman says this will change in the future.\n\nCredit: Ethereum Punks\n\nThe future of Ethscriptions\n\nLehman believes that Ethscriptions are essential to the Web3 space. He detailed his reasoning in a June 20 tweet, where he essentially explained that they provide an affordable solution to those seeking decentralized solutions and unlocking Ethereum’s full potential.\n\nSince Lehman announced the protocol in a June 16 Twitter space, most of the Web3 community has reacted with excitement and interest, with many questioning whether Ethscriptions will see the same success as Ordinals. However, some have criticized the new protocol, with others pointing out that it’s really nothing novel.\n\nRegardless of the initial reception of the launch, which Lehman sees as a “huge success,” he plans to keep innovating on Ethscriptions. “I also have lots of plans for extending the protocol that I can’t wait to share, but the foundation must come first,” Lehman shared on Twitter.\n\nEthscriptions represent a promising frontier in the crypto landscape. As a unique protocol that navigates the balance between decentralization and functionality, Ethscriptions open a new avenue for accessible, affordable, and secure data transactions on Ethereum. Despite being in its early stages, the relevance and potential of Ethscriptions are only just beginning."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA2LzIxL3dpbGwtZXRoZXJldW0tYmUtYS10cmlsbGlvbi1kb2xsYXItY3J5cHRvY3VycmVuY3kv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Will Ethereum Be a Trillion-Dollar Cryptocurrency by 2024? - The Motley Fool",
        "content": "Ethereum, as the world's second-biggest cryptocurrency behind Bitcoin, already is a billion-dollar player. This cryptocurrency and blockchain is a market leader, attracting developers and users to its platform -- and investors to buy and stake coins.\n\nBut the past year hasn't been easy for cryptocurrency in general. The market's value tumbled last year. Amid economic woes, people turned away from cryptocurrency and favored the safest investments. This year, the crypto market has been on the rise -- but it's slipped from its 2023 peak reached in April. Could this hold back Ethereum? Or could this market leader become a trillion-dollar cryptocurrency by 2024? Let's find out.\n\nDevelopers love Ethereum\n\nIf you ask developers which blockchain they're building on, many of them would say Ethereum. In fact, the blockchain has the most total developers of any other player, according to the latest Electric Capital developer report. And the number has increased 52% from two years ago to more than 5,800.\n\nWinning over developers is key because they are the ones building content -- and that, in turn, adds to the use cases for a particular blockchain.\n\nAnd that's part of why Ethereum also is a leader when it comes to hosting decentralized applications (dApps). This big player is No. 1 in the sales of non-fungible tokens, too, CryptoSlam data show.\n\nStill, people have had one complaint about Ethereum since its early days. That's its slow transaction speed and the costs associated with this. But the good news is Ethereum is working on this problem, and thanks to a series of planned updates, the blockchain should become much faster and cheaper down the road.\n\nEthereum has already started that process. An update last year helped the blockchain reduce its energy consumption by 99%. That's as it switched to the proof-of-stake validation method from proof of work. While proof of work relies on intense computational power to validate blocks of data, proof of stake doesn't. Instead, it grants the right to validate to those holding a significant stake.\n\nThe role of rollups\n\nEthereum also is scaling up by using a layer 2 solution known as a rollup. Rollups involve handling transactions in batches and then sending output back to the mainnet. Already, rollups are as much as eight times cheaper than using the mainnet -- and in the future, fees could become at least 40 times cheaper.\n\nThe blockchain also is working on improving security and even \"future proofing\" the system. For example, eventually quantum computing may represent a risk for the cryptography used to secure Ethereum today. Even though the threat probably is far down the road, right now Ethereum is exploring two forms of quantum-safe cryptography.\n\nAll of this means the Ethereum of tomorrow is likely to be even better than the Ethereum of today. Now, let's consider whether that could push Ethereum from its $208 billion market value of today into trillion-dollar territory. If we use today's circulating supply of Ethereum -- about 120 million coins -- we can see that to reach a market value of $1 trillion, Ethereum would have to more than quadruple from today's price.\n\nThe economic backdrop\n\nAgainst a strong economic backdrop, that could happen rather quickly. But I'm not convinced we're there yet. The Federal Reserve is modeling for a recession later this year. Even though it's expected to be mild, this still could weigh on demand for crypto. Ethereum has increased more than 40% this year. And it still may continue to climb -- but it may not do so at a pace that will catapult it to $1 trillion in value by next year.\n\nThat said, this isn't bad news. Ethereum's outlook remains bright. And planned upgrades should help the network excel over the long term. And that's great news for investors who buy this leading cryptocurrency now."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vZm9ya2FzdC5uZXdzL29yZGluYWxzZi1ldGhlcmV1bS1jb2xsZWN0aWJsZS1ldGhzY3JpcHRpb25zL9IBRmh0dHBzOi8vZm9ya2FzdC5uZXdzL29yZGluYWxzZi1ldGhlcmV1bS1jb2xsZWN0aWJsZS1ldGhzY3JpcHRpb25zL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Ordinals inspire a new type of Ethereum collectible called Ethscriptions - Forkast News",
        "content": "Earlier this year, developers on Bitcoin were inspired by Ethereum’s non-fungible tokens and created their own spin on blockchain collectibles with Bitcoin’s Ordinals. Five months and over 12 million ordinals later, developers on Ethereum are feeling similarly inspired by Ordinals to create another new collectible called Ethscriptions.\n\nNamed after the inscription process that is used to create Ordinals, Ethscriptions allow images, files, or text under 96 kilobytes to be stored on-chain using almost any type of Ethereum transaction type. It’s a heck of a lot cheaper than storing on-chain data using smart contracts’ storage.\n\nWhile there are no major use cases for it yet, this is one of those types of innovations that usually pays off down the road, and if you consider that Bitcoin’s inscriptions were part of the blockchain well before ordinals were invented, you can see that sometimes potential isn’t realized until a later time.\n\nNoteworthy Happenings\n\nHere’s what is making news in NFTs this week\n\nEthscriptions came out of the gates swinging, both with new tech and also its first 10k collection called Ethereum Punks. The 10,000 collection of “ethscribed” punks quickly sold out, and then wrapped using Emblem Vaults’ wrapper to make them tradable on OpenSea. So far over 260 ETH (US$461,216) has been traded for Ethscriptions, with a majority of that being for the Ethereum Punks.\n\nIntroducing Ethscriptions: a new way of creating and sharing digital artifacts on Ethereum using transaction calldata.https://t.co/XfQ7RdtblD\n\n\n\nALSO: Introducing Ethereum Punks. Because why should all non-contract Punk collecting happen on Bitcoin?https://t.co/d3Ycwbdc2Z… — Middlemarch (@dumbnamenumbers) June 16, 2023\n\nThe anonymous wallet that was buying up millions of dollars worth of NFTs has been revealed to be one of DeGods biggest whales, FreeLunchCapital. After spending over $10m across BAYC, Azuki, Pudgy Penguins, and other big-dollar projects, he’s now a whale across the entire ecosystem.\n\nto be one of DeGods biggest whales, FreeLunchCapital. After spending over $10m across BAYC, Azuki, Pudgy Penguins, and other big-dollar projects, he’s now a whale across the entire ecosystem. CryptoPunk #8611 found a new home this weekend when it was purchased for 55 ETH. It shockingly was then burned and minted on Bitcoin as an Ordinal, when 150 members of the Bitcoin Bandits contributed to the purchase and burn of the grail NFT. This CryptoPunk will never be in an Ethereum trader’s hands again and is now lost in the Ethereum wastelands. RIP lil guy.\n\nfound a new home this weekend when it was purchased for 55 ETH. It shockingly was then burned and minted on Bitcoin as an Ordinal, when 150 members of the Bitcoin Bandits contributed to the purchase and burn of the grail NFT. This CryptoPunk will never be in an Ethereum trader’s hands again and is now lost in the Ethereum wastelands. RIP lil guy. Last week’s Sotheby’s Grails Part II auction saw 37 generative art NFTs sell for nearly US$11 million, showcasing collectors’ love of the ever-growing art form. In total, Sotheby’s Part I and II auctions sold 44 NFTs for over US$13 million.\n\nsaw 37 generative art NFTs sell for nearly US$11 million, showcasing collectors’ love of the ever-growing art form. In total, Sotheby’s Part I and II auctions sold 44 NFTs for over US$13 million. This may be a huge week for NFTs after Nike’s tease about an incoming in-game sneaker event in Fortnite. Targeted to release today is a Fortnite sneaker hunt, and many speculate that it’s Nike’s .Swoosh shoes that may be the prize at the end of the hunt, titled Airphoria. With Fornite’s over 242 million strong user base, this could end up being another mass onboarding event for NFTs.\n\nabout an incoming in-game sneaker event in Fortnite. Targeted to release today is a Fortnite sneaker hunt, and many speculate that it’s Nike’s .Swoosh shoes that may be the prize at the end of the hunt, titled Airphoria. With Fornite’s over 242 million strong user base, this could end up being another mass onboarding event for NFTs. BRC-20’s OXBT finally launched their REDACTED Discord server, and are teasing an ecosystem built around their token. Project creator BitGod has explained the technical challenges and urged patience as they build in uncharted territory.\n\nPeep the charts\n\nMostly familiar faces make up the seven days leaderboard.\n\nBitcoin’s Ordinals are the king of the NFT collection rankings by sales volume again.\n\nSotheby’s auction of Three Arrow Captial’s grails, including the now iconic ‘The Goose’ is easily in the second spot following the massive day of generative art sales.\n\nIt’s hard to keep Bored Ape Yacht Club down, but their prices sure are falling. Average sales prices earlier this month typically ranged from US$80,000 to US$95,000, but have fallen in the past seven days to US$67,000 to US$80,000. May and June saw Bored Ape’s monthly average sales price fall to lows not seen since July 2021\n\nprice fall to lows not seen since July 2021 Mutant Ape Yacht Club, Azuki, The Captains, and Boring Punks are still helping profile pictures dominate the top 10, but sales are down from last week, ranging from 19% – 31% less than this time last week.\n\nSimilar to the top collection rankings, blockchains by NFT sales volume had a rough week in the red.\n\nEthereum is in the green, primarily from the inclusion of the big Sotheby’s auction sales"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy8zLXJlYXNvbnMtd2h5LWV0aGVyZXVtLW1hcmtldC1jYXAtZG9taW5hbmNlLWlzLXJpc2luZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "3 reasons why Ethereum's market cap dominance is on the rise - Cointelegraph",
        "content": "Ethereum has been the dominant smart contract and decentralized application (DApp) network since its inception. An analysis of Ether’s price (ETH) and market capitalization shows indisputable evidence that the blockchain has been gaining market share.\n\nEther market capitalization dominance (%). Source: TradingView\n\nAs shown above, Ether’s dominance in market capitalization terms has grown over the past couple of years, from an 18% average in July 2021 to the current 20%. Excluding Bitcoin (BTC) from the analysis, Ether’s market share presently stands at 40.6%, while its next competitor, BNB (BNB), holds a 7.2% share.\n\nThe disparity between Ethereum and others is also evident when analyzing the total value locked (TVL) on each network’s smart contracts. Ethereum is the absolute leader with $24.6 billion in TVL, followed by Tron’s $5.4 billion and BNB Chain’s $3.3 billion.\n\nTotal value locked market share (%). Source: DefiLlama\n\nThe above chart depicts how Ethereum’s TVL market share declining from 70.5% in June 2021 to 49.5% in May 2022 as Terra and Avalanche gained a combined 20% market share. However, following the Terra ecosystem collapse in May 2022 — which culminated in developers halting network activity — Ethereum quickly regained a 58% market share.\n\nDespite the emergence of DApps on the BNB and Tron blockchains, Ethereum’s leadership has remained uncontested over the past 12 months. This data shows the irrelevance of the total number of unique active wallets (UAW) interacting with smart contracts per chain.\n\nFor instance, according to DappRadar, WAX has 363,600 active users, followed by BNB Chain’s 517,300 30-day UAW. These figures are way higher than the Ethereum network’s 66,300 unique active addresses, but they reflect much lower transaction fee, opening room for manipulation.\n\nDecentralization matters, and Ethereum stands out among its competitors\n\nThe Ethereum ecosystem has the highest number of active developers, surpassing 1,870, which is more than the next three competitors — Polkadot (752), Cosmos (511) and Solana (383) — combined.\n\nCurrently, the Ethereum network has over 700,000 validators, with 99% of the balances locked in staking participating in the process. The 32 ETH threshold limit per validator undoubtedly inflates this number, but Lido, the largest known staking pool, controls 32% of the staking, with Coinbase coming in second with 9.6%.\n\nConsequently, it is safe to say that Ethereum is far less centralized in terms of development and validation compared with Tron, BNB Chain and Solana.\n\nOther reasons Ether’s dominance has been on the rise, even as Bitcoin reached a 50% market share on June 19, include derivatives activity and its dominance of the NFT market\n\nDerivatives markets are essential to institutional investors\n\nEther’s future contracts are essential for institutional trading practices like hedging and trading with leverage. Ether’s cash-settled futures were added to the Chicago Mercantile Exchange in February 2021. To date, no other cryptocurrency, apart from Bitcoin, has reached the world’s largest derivatives exchange.\n\nIn futures markets, longs and shorts are balanced at all times, but having a larger number of active contracts — open interest — allows the participation of institutional investors who require a minimum market size. Ether futures aggregated open interest stands at $5.4 billion, while competitor BNB hold $380 million and Solana a mere $178 million.\n\nEthereum is still the market leader in NFTs\n\nNonfungible tokens are a perfect example of how cheaper, faster transactions do not always translate to increased adoption. Nothing is stopping NFT projects from shifting between blockchains, whether for new listings or existing collections. In fact, y00ts and DeGods moved to Polygon earlier in 2023.\n\nDespite facing gas fees that often break above $10, Ethereum remains the absolute leader in the number of buyers and total sales. According to CryptoSlam, the leading network reached $380 million in sales over the past 30 days, while Solana, Polygon and BNB Chain totaled a combined $93 million.\n\nUltimately, the data favors Ethereum versus its competing smart contract-focused blockchains. The positive trend in Ether’s dominance might fade over time if the promised network upgrade to allow parallel processing (sharding) does not come to fruition, but for now, Ether’s 20% market capitalization share remains unchallenged.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDYvMjEvYml0Y29pbi1jdXN0b2R5LWZpcm0tY2FzYS1yb2xscy1vdXQtZXRoZXJldW0tc3VwcG9ydC_SAWJodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA2LzIxL2JpdGNvaW4tY3VzdG9keS1maXJtLWNhc2Etcm9sbHMtb3V0LWV0aGVyZXVtLXN1cHBvcnQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Custody Firm Casa Rolls out Ethereum Support - CoinDesk",
        "content": "“We've seen all the problems that come from using centralized custodians,” Neuman said. “We've seen how important it is to get the average person holding their own keys. We're just providing the software to make it easier to use those keys.”"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ldGhlcmV1bS1mb3VuZGVyLXZpdGFsaWstYnV0ZXJpbi10aWVzLTE4MTUzNTA4Ni5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Founder Vitalik Buterin Has Ties to SEC Darling Prometheum—Here's How - Yahoo Finance",
        "content": "The connection between Ethereum co-founder Vitalik Buterin and Wanxiang Blockchain Labs, although it’s been public for years, is suddenly a very big deal. That’s because as the industry pores over Prometheum, now the SEC’s poster child for regulatory compliance, Crypto Twitter has realized that the startup is partly owned by Shanghai Wanxiang Blockchain.\n\nCrypto Twitter is in shock that Vitalik Buterin was the Chief Scientist for Wanxiang. I don't think they realize yet that it was Wanxiang that setup and funded the wallets for both the Ethereum Foundation, & Vitalik Buterin. Yes CT, it goes much much Deeper. https://t.co/PzG45UE7Ys — TruthLabs 💄 (@BoringSleuth) June 16, 2023\n\nEyebrows were raised among the digital assets community following testimony from Prometheum co-CEO Aaron Kaplan on Capitol Hill, where his sentiments on regulatory compliance contrasted talking points from countless crypto firms and mirrored statements made by the SEC.\n\nPrometheum touts that it's the first crypto firm ordained by the SEC and a member of FINRA, the finance-focused self-regulatory organization. Upheld by Gary Gensler as an example of how regulatory compliance for crypto companies is indeed possible, the firms' connection to Shanghai Wanxiang Blockchain drew scrutiny.\n\nWanxiang Blockchain Labs is a non-profit organization and China-based research institution started in 2015 by China Wanxiang Holding. The Labs’ resources were integrated into Shanghai Wanxiang Blockchain, a firm established in 2017.\n\nWhy Vitalik Buterin is Known as the 'V God' in China\n\nButerin’s connection to the nonprofit can be traced back to Ethereum’s early days. In 2015, then-CEO of Wanxiang Blockchain Labs Feng Xiao formed a relationship with Buterin and purchased $500,000 worth of Ethereum. The funds helped Buterin pay developers, according to a report from Global Coin Research.\n\nStory continues\n\nButerin was one of several guest speakers at Blockchain Week 2016, a conference co-hosted by the Ethereum Foundation and Wanxiang Blockchain Labs, which also featured talks from Circle CEO Jeremy Allaire and Ripple Labs co-founder Jed McCaleb, according to the event’s website.\n\nAt the time Buterin was described on the event’s website as Wanxiang Blockchain Labs’s chief scientist. That assertion is backed by a description of Buterin’s role on the non-profits’ website now. Separately, Buterin is described as a co-founder of the non-profit on Facebook.\n\nEthereum co-founder @VitalikButerin is listed as a co-founder of @WXblockchain, a part owner of @PrometheumInc which was recently given rights to operate a #crypto exchange in the U.S. Other filings show Buterin is also Chief Scientist at Wanxiang Blockchain Labs. pic.twitter.com/ywdl4u97RM — Eleanor Terrett (@EleanorTerrett) June 21, 2023\n\nNeither Wanxiang Blockchain Labs nor the Ethereum Foundation immediately responded to a request for comment from Decrypt.\n\nPrometheum established a strategic partnership and joint development agreement with Shanghai Wanxiang Blockchain years later in 2018, according to an SEC filing. The deal gave Prometheum access to Wanxiang’s “technology resources, industry contacts, [and] intellectual capital,” adding that the organizations are committed to sharing resources.\n\nPrometheum eventually terminated its agreement with Shanghai Wanxiang Blockchain in October 2021, Kaplan of Prometheum wrote in written testimony prepared for the House Financial Services Committee last week. After a year, it was apparent that “joint development was not viable,” according to Kaplan.\n\n“Wanxiang and its affiliates have no access to any Prometheum code, technology, software, or to the Prometheum ecosystem,” he wrote, adding the company’s code has been developed internally. “Prometheum is proud to be an American-born, bred, and controlled company.”"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vcHJvdG9zLmNvbS91bmNvdmVyaW5nLWV0aGVyZXVtcy1jbG9zZS10aWVzLXRvLWNoaW5lc2UtbW9uZXkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Uncovering Ethereum's close ties to Chinese money - Protos",
        "content": "Most information about Ethereum is in English and, as a result, appeals to Western investors. However, evidence uncovered by Freedom of Information Act (FOIA) requests, court cases, and online archives points to a heavy Chinese influence.\n\nAlthough early Etherians remember some Chinese backers, modern investors could be forgiven for barely recalling the blockchain’s Chinese ties. Here’s a refresher for newer users.\n\nEthereum’s whitepaper published in Chinese\n\nVitalik Buterin personally ensured that the Ethereum Wiki published a Chinese language version of the Ethereum whitepaper by January 22, 2015 — more than six months before the Ethereum mainnet went live at the end of July.\n\nVitalik Buterin’s interest in speaking Chinese\n\nAccording to Laura Shin’s book The Cryptopians, as early as January 2014, when the Ethereum team met in Miami to announce Bitcoin 2.0, Vitalik Buterin seemed preoccupied with learning the Chinese language using a phone app.\n\nEthereum hosted a conference in China\n\nThe Ethereum Foundation hosted a conference in Shanghai in September 2016. Ethereum Foundation board member Ming Chan sang the praises of China to attendees, saying: “Shanghai is both a global financial hub and home to many of Asia’s blockchain pioneers, where the blockchain community continues to grow and is eager to share what China has to offer the greater ecosystem.”\n\nDuring that conference, Enterprise Ethereum Alliance founder Victor Wong further opined that China could become one of the biggest blockchain markets on Earth.\n\nEthereum’s ex-Alibaba partners\n\nAn old version of the official Ethereum website on Archive.org’s Wayback Machine names Chinese partners, including ex-Alibaba engineer Bin Lu and senior product expert Jerry Liu. Liu also worked at IBM China.\n\nThe Ethereum team shortly before the launch of the ICO. Now a serious question, what are \"Chinese partners\"? Or rather, why name the nationality at all? What does it mean to be a Chinese Partner? Are they representatives of the Chinese government or the CCP? Again, what does… pic.twitter.com/ALTpMKilk3 — Mr. Huber🔥🦅🔥 (@Leerzeit) June 18, 2023\n\nChinese miner Chandler Guo\n\nFrom 2015 through 2022, Ethereum used proof-of-work (PoW) and paid miners to secure its blockchain. Some of the largest Ethereum miners were Chinese. One particularly notable miner was Chandler Guo who played an important role in The Dao hack reversal (Ethereum Classic). Guo remained an active participant in Ethereum’s consensus decision-making.\n\nEthereum Foundation executive director Ming Chan\n\nButerin also brought Ming Chan on board as the Ethereum Foundation’s executive director. Ming had previously worked on the University of Michigan’s China Mirror Project and a Chinese-language educational app called iWrite Wenzi. The Ethereum Foundation eventually fired her after she clashed with several board members over her influence over Buterin.\n\nCompleting The Merge thanks to Shanghai\n\nIt’s no coincidence that Vitalik Buterin chose ‘Shanghai’ as the capstone of Ethereum’s monumental transition from PoW to proof-of-stake (PoS). Ethereum’s Shanghai update enabled withdrawals of staked ETH.\n\nWanxiang Blockchain CEO Dr. Xiao explained how the city of Shanghai played a major role in Ethereum’s history. Xiao met Vitalik Buterin to discuss Ethereum near Shanghai in China. She offered a $500,000 donation with the potential of further funding to help fund development.\n\nAccording to Shin, that $500,000 donation became a purchase of 416,666 ETH at $1.19 per ETH. This meeting took place before Ethereum’s mainnet went live in 2015.\n\n🇨🇳🚨🚨🚨🚨🚨🚨🚨🚨🚨🇨🇳@digitalassetbuy @JohnEDeaton1\n\n\n\n(1/6)\n\nFrom Vitalik to Devcon:\n\n“How Shanghai came into the fold of the Ethereum story.”\n\n\n\n“How an Army of Crypto-Hackers is Building the Next Internet with Ethereum”\n\n\n\n“A couple of months after “the Merge”, Ethereum will go… pic.twitter.com/of8EKKiW3H — Cowboy.Crypto ☀️ (@cowboycrypto313) June 18, 2023\n\nThe Bank of China chooses Ethereum\n\nEthereum’s ties to China are undeniable. The Bank of China itself chose the Ethereum blockchain — over myriad competitors and even its own permissioned blockchains — when it issued $28 million in tokenized structured notes.\n\nSpecifically, the Bank of China’s investment bank, Hong Kong-based Bank of China International (BOCI), issued 220 million Chinese Offshore Yuan in digitally structured notes, making BOCI the first major Chinese financial institution to issue a tokenized security in Hong Kong.\n\nChina, of course, has a history of cracking down on blockchains that it cannot easily control. However, this move may indicate that it is willing to make an exception for Ethereum.\n\nRead more: Here’s what CZ says about Binance definitely not being Chinese\n\nSEC director’s connection to Chinese, pro-Ethereum money\n\nFOIA requests have unveiled some evidence of China’s influence on Ethereum. Online archives and court cases helped reveal more evidence that China impacted Ethereum.\n\nFor example, watchdog Empower Oversight filed a lawsuit to force the SEC to release email exchanges between its former division of corporate finance director William Hinman and parties that included law firm Simpson Thacher & Bartlett and the SEC Ethics Office.\n\nWilliam Hinman is most well-known for having made a 2018 speech in which he opined that ETH was not a security because it had become “sufficiently decentralized.”\n\nThe Ethics Office had pressured Hinman to divest from any financial stake he held in Simpson Thacher. However, he continued to draw a pension. He also met or communicated with parties related to mining hardware firm Canaan, which was about to conduct an IPO and made mining hardware for Ethereum.\n\nHe also met Chris Lin, an employee of Simpson Thacher’s Hong Kong division (Simpson Thacher operates its Hong Kong explicitly to serve ‘Greater China’). An email exchange between Hinman and Lin indicates that he planned to “say hello,” and Hinman suggested that they meet over coffee. No known record of the topics they discussed exists. However, Ethereum could have come up in the conversation.\n\nThis included meeting his China Office partner on the very same day that a letter went out from Hinman’s division regarding the Canaan IPO – an IPO handled by Hinman’s law firm. Btw, what did Canaan make: BTC & ETH mining hardware (I wonder if his speech helped in anyway). pic.twitter.com/7IdzeZpTzI — John E Deaton (@JohnEDeaton1) June 13, 2023\n\nRead more: The US dollar isn’t close to losing world reserve currency status to China\n\nAfter making the most pro-Ethereum speech in SEC history, Hinman returned to work for Simpson Thacher and collected even more money.\n\nObservers like CryptoLaw founder John E. Deaton suggested that Hinman may have violated financial conflict laws.\n\nAfter the Empower emails, I said a 🙊 could prove Hinman violated the criminal financial conflict laws. You can be found violating 18 USC 208 if you allow even only an appearance of impropriety w/o being told you’re violating the law. Here, he was told multiple times but did it. — John E Deaton (@JohnEDeaton1) June 13, 2023\n\nMore Chinese influence over Ethereum\n\nAs also noted in Shin’s book, some Chinese Ethereum supporters created a site called Carbonvote.com after the infamous exploit of The Dao.\n\nThis website tallied votes on a proposed solution that proved controversial: hard-forking the Ethereum blockchain at a point just before the exploit started to restore stolen funds to their original owners. Go Ethereum lead developer Jeff Wilcke announced that the vote on Carbonvote.com would be considered official.\n\nGot a tip? Send us an email or ProtonMail. For more informed news, follow us on Twitter, Instagram, Bluesky, and Google News, or subscribe to our YouTube channel."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1tb3JlLXVwc2lkZXMtMTc1MC_SAUpodHRwczovL3d3dy5uZXdzYnRjLmNvbS9hbmFseXNpcy9ldGgvZXRoZXJldW0tcHJpY2UtbW9yZS11cHNpZGVzLTE3NTAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Price Indicators Suggest Strengthening Case For More Upsides - NewsBTC",
        "content": "Ethereum price is showing positive signs above $1,700 against the US Dollar. ETH could gain bullish momentum if it clears the $1,750 resistance zone.\n\nEthereum is slowly moving higher above the $1,700 and $1,720 resistance levels.\n\nThe price is trading above $1,720 and the 100-hourly Simple Moving Average.\n\nThere is a key bullish trend line forming with support near $1,718 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could rise further above the $1,750 and $1,765 resistance levels.\n\nEthereum Price Steadies Above $1,700\n\nEthereum’s price started a steady recovery wave above the $1,650 level. ETH was able to settle above the $1,700 resistance zone, similar to Bitcoin.\n\nRecently, the price saw a minor downside correction from the $1,768 high. The price traded below the $1,720 level but the bulls were active near $1,700. A low is formed near $1,698 and the price is again attempting a fresh increase.\n\nThere was a break above the $1,720 resistance. The price climbed above the 50% Fib retracement level of the downward move from the $1,768 swing high to the $1,698 low.\n\nEther is now trading above $1,720 and the 100-hourly Simple Moving Average. There is also a key bullish trend line forming with support near $1,718 on the hourly chart of ETH/USD. Immediate resistance is near the $1,750 level. The next major resistance is near the $1,765 level.\n\nSource: ETHUSD on TradingView.com\n\nA successful move above the $1,750 and $1,765 resistance levels might start a steady recovery wave. The next resistance sits near $1,800, above which Ethereum could rise toward the $1,850 level. Any more gains above the $1,850 resistance zone might send the price toward the $1,920 resistance.\n\nAe Dips Supported in ETH?\n\nIf Ethereum fails to clear the $1,750 resistance, it could start another decline. Initial support on the downside is near the $1,720 level and the trend line.\n\nThe next major support is near the $1,700 level or the recent low. If there is a break and close below the $1,700 support, the price could drop toward the $1,675 support. Any more losses may perhaps send the price toward the $1,620 zone.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 level.\n\nMajor Support Level – $1,700\n\nMajor Resistance Level – $1,765\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA2LzIwL3RvcC1hbmFseXN0LXByZWRpY3RzLWJpZy1ldGhlcmV1bS1jb3JyZWN0aW9uLW91dGxpbmVzLXdvcnN0LWNhc2Utc2NlbmFyaW8tZm9yLWV0aC_SAXdodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNi8yMC90b3AtYW5hbHlzdC1wcmVkaWN0cy1iaWctZXRoZXJldW0tY29ycmVjdGlvbi1vdXRsaW5lcy13b3JzdC1jYXNlLXNjZW5hcmlvLWZvci1ldGgvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "Top Analyst Predicts Big Ethereum Correction, Outlines Worst-Case Scenario for ETH - The Daily Hodl",
        "content": "Widely followed crypto analyst Benjamin Cowen is warning that Ethereum (ETH) could correct in a big way as he believes the leading altcoin is poised to retest a long-term trend indicator before it could give birth to a new bull market.\n\nIn a new strategy session, Cowen tells his 785,000 YouTube subscribers that Ethereum has been respecting the fair-value logarithmic regression band as support since 2017.\n\nAccording to the analyst, the logarithmic regression band is designed to track the fair value of an asset using “non-bubble data.”\n\nCowen says that in an optimistic scenario, Ethereum may retest the upper bound of the trend indicator, which he notes coincides with ETH’s bear market low at around $875.\n\n“Now, an interesting development is that the fair value according to this fit to non-bubble data of Ethereum is at $875, but the prior low was actually at $880. So they’re essentially the same.\n\nIf Ethereum went back down to its prior low, that would get it back home. And we talked about this a year ago. I said, ‘Look guys, what I think is going to happen is we either go down to the regression band or we go sideways until it catches up.’ Now, if we were to dump now, if we were to dump to what I’ve called home before, it would actually correspond to the prior low.”\n\nIn a worst-case scenario, Cowen says that ETH could briefly trade below the logarithmic regression trendline, similar to what happened in March 2020.\n\n“That doesn’t mean that you can’t go below that level. As you can see, we did go entirely below the entire regression band back in March 2020. And in fact, it went about 34% below the regression band during that drop.\n\nIf we were to have another drop, similar to that, like 34% below this level, that would correspond down to about a $400 Ethereum, which is why I’ve thrown that number out there in the past as a potential outcome in a worst-case scenario environment.”\n\nEthereum is trading for $1,736 at time of writing, a fractional increase in the last 24 hours.\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney\n\nShutterstock/Tomasz Makowski"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vbWlsa3JvYWQuY29tL2RhaWx5LzMtYmlnLWJvbWJzLWRyb3BwaW5nLW9uLWV0aGVyZXVtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "🥛 3 BIG bombs dropping on Ethereum... - Milk Road",
        "content": "Today’s edition is brought to you by eTukTuk – the first automobile project on Cardano that hopes to shake up the EV industry and support developing countries.\n\nGM. This is Milk Road, the crypto newsletter that's as electrifying as getting a high score on Dance Dance Revolution.\n\n(Warning: cool dance moves not included inside.)\n\nHere’s what we got for you today:\n\nNew upgrades coming to Ethereum ⚡\n\nHow school kids are stealing millions from crypto investors 🕵️\n\nMilk Road: Crypto Cribs 🏰\n\nDo Kwon’s going to jail 🍪\n\nPrices as of 9:30 AM ET.\n\n3 THINGS COMING TO ETHEREUM ⚡\n\nA blockchain network is a lot like a video game – as in both have hella new levels to unlock the more you play.\n\nWell, 3 big levels are unlocking on the Ethereum network. And like a good video game, the Milk Man’s gonna tell you the rules plain & simple.\n\nLet’s dive in…\n\n1/ You can inscribe NFTs on Ethereum now\n\nYep, a project inspired by the protocol (Ordinals) that brought NFTs to Bitcoin launched over the weekend.\n\nThey’re called “Ethscriptions.” Original…\n\nInstead of using smart contracts (like the OG Ethereum-based NFTs), you can mint them via so-called “calldata.” That’s the data within a smart contract.\n\nSo…meta…\n\nEthscriptions are supposed to be:\n\nA lot cheaper\n\nMore decentralized\n\nWho knows if they’ll be as popular as Inscriptions. But there were 30K Ethscriptions created in the protocol’s first 18 hours.\n\nNot the worst debut.\n\n2/ You might be able to stake a lot more as an ETH validator\n\nLike, 64X more.\n\nEthereum developers are planning to raise the maximum amount from 32 ETH (~$55,644) to 2,048 ETH (~$3.6M.)\n\nDamn inflation. First my eggs…now this…\n\nWhy would they do that? Because there are a sh*tton of Ethereum validators (~700K.) Especially since the network switched to proof-of-stake.\n\nProponents say: Raising the staking limit would = fewer validators = make the network more efficient\n\nCritics say: That’d make the network more centralized since fewer people would have that validating power\n\nThe devs are also thinking of compounding validator rewards. That means validators could A) yes, stake a lot more ETH, but they would B) earn a lot more interest.\n\n3/ The Cancun (or Dencun) Upgrade is coming…\n\nSadly, Vitalik is not shipping everyone out to an all-inclusive resort in Mexico.\n\nBut the network’s developers are shipping proto-danksharding sometime this year.\n\nIt’s a prototype for danksharding, which will split the blockchain into a bunch of different shard chains to keep it unclogged and cheaper to use.\n\nThis will be a big W for rollups like Layer 2s.\n\nPlus (sorry, Shapella) this upgrade has the coolest name so far. Don’t @ me.\n\nThe electric vehicle industry is due for a repair. While progress is being made, more access and affordability is needed for the industry.\n\nEnter eTukTuk – Access is their middle name.\n\nTheir goal? To build an affordable network of charging stations and electric vehicles for the developing world.\n\nHere’s some info on them:\n\nUtilizing the blockchain allows them to create digital identities, provide wider access for users and reward network participants\n\nTheir initiative cuts carbon emissions and improves air quality, with a focus on developing nations who need it most\n\nTheir team is made up of seasoned professionals with a background in Finance, Tech, Automotive and Blockchain\n\nAnd it’s all powered by the $TUK token, whose whitelist just opened up to their community of 40,000+. Learn more about them below!\n\nHOW SCHOOL KIDS ARE STEALING MILLIONS FROM CRYPTO INVESTORS 🕵️\n\nThere are a lot of people who can steal your money. Here are the updated rankings:\n\nBrad Pitt, George Clooney, and the Oceans 11 North Korean hackers Xfinity charging $100/mo for crappy internet service\n\nWell, there’s a new group to look out for… school kids.\n\nThat’s right, it’s being reported that school kids have been leading the recent crypto phishing frenzy.\n\nThey use what’s called an NFT drainer. It’s a piece of code that can be put into a fake website and, once another person connects their wallet, it drains the wallet of all NFTs and tokens.\n\nIn total:\n\n~$73M has been stolen from wallets\n\n~45,000 wallets have been compromised\n\n~900 Discord servers have been hacked\n\nBig companies like Blur, Orbiter Finance, and LiFi have been targeted\n\nAnd turns out that the majority of the people carrying out these attacks are under the age of 18.\n\nSource: Tenor\n\nHow? Apparently, there’s a “black market” for this kind of stuff.\n\nThe kids will talk to developers that create the drainers via Discord, buy the drainer (plus agree to give 20% of the stolen money back to the dev), and then use the drainer code in their own fake websites.\n\nCrazy, I know…\n\nKids have gone from prank-calling Blockbusters and ding-dong-ditching neighbors → buying drainers from the black market and stealing millions.\n\nMILK ROAD: CRYPTO CRIBS 🏰\n\nThe early 2000s called, and guess what: no, they can’t have MTV Cribs back.\n\nBecause we’ve taken it and made it better.\n\nWelcome to Milk Road Cribs, Roaders.\n\nToday let’s look at… Jeffrey Huang’s new $25M L.A. mansion.\n\nAKA Machi Big Brother. He went from hip hop group member → blockchain/crypto hypeman & entrepreneur → the new owner of this badass megahome.\n\nCheck it out:\n\nIt has five bedrooms, eight bathrooms, a sauna, an elevator, a killer outdoor pool that the Milk Man is thoroughly enjoying, and sick views of the downtown city center. I feel poor just looking at it…\n\nMachi Big Bro is also in the news for another reason: suing crypto sleuth ZachXBT.\n\nHe wasn’t a fan of what the guy wrote in a Medium article about a year ago – ZachXBT cited on-chain data and accused him of embezzling millions worth of ETH.\n\nLooks like Huang went out and stress-bought a giant mansion. As one does.\n\nMILK & COOKIES 🍪\n\nTerra founder Do Kwon was sentenced to 4 months in prison for using a fake passport. He’ll be passing the time in a Montenegrin jail.\n\nCrypto exchange Crypto.com reportedly has an internal trading team that acts as a market maker. It confirmed that it did and said that’s “not a controversial practice.”\n\nFTX’s bankruptcy estate paid $120M+ in advisor fees between Feb. 1 and April 30. Sullivan & Cromwell lawyers billed the most (~30%.)\n\nMILKY MEMES 🤣\n\nHIT THE INBOX OF 250K+ CRYPTO INVESTORS\n\nAdvertise with Milk Road to get your brand in front of the Who's Who of crypto. The Roadies are high-income crypto investors who are always looking for their next interesting product or tool. Get in touch today.\n\nROADER REVIEW OF THE DAY\n\nVITALIK PIC OF THE DAY\n\nhappy Tuesday https://t.co/nUR3VTTPah — Milk Road Images (@MilkRoadImages)\n\nJun 20, 2023\n\nDISCLAIMER: None of this is financial advice. This newsletter is strictly educational and is not investment advice or a solicitation to buy or sell any assets or to make any financial decisions. Please be careful and do your own research.T"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDYvMjEvYXJwYS1uZXR3b3Jrcy1nb2VzLWxpdmUtb24tZXRoZXJldW0tbWFpbm5ldC_SAVlodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA2LzIxL2FycGEtbmV0d29ya3MtZ29lcy1saXZlLW9uLWV0aGVyZXVtLW1haW5uZXQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Arpa Network Goes Live on Ethereum Mainnet - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vYXdzLmFtYXpvbi5jb20vYmxvZ3MvZGF0YWJhc2UvYXdzLW5pdHJvLWVuY2xhdmVzLWZvci1ydW5uaW5nLWV0aGVyZXVtLXZhbGlkYXRvcnMtcGFydC0yL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "AWS Nitro Enclaves for running Ethereum validators – Part 2 | Amazon Web Services - AWS Blog",
        "content": "In Part 1 of this series, we gave a high-level introduction to an AWS Nitro Enclaves-based Web3Signer blockchain validation and signing service. We explained the purpose of running blockchain validators and also why Nitro Enclaves are well suited to run security sensitive cryptographic workloads.\n\nWe furthermore covered the high-level application architecture and briefly explained the secure bootstrapping and secure signing flow.\n\nIn the walkthrough on GitHub, we gave an end-to-end example of how to deploy and configure a Nitro Enclave-based Web3Signer solution.\n\nIn this post, we dive deep into three areas:\n\nWeb3Signer integration pattern – How different Ethereum validator nodes can be integrated with a single Web3Signer node\n\nSecure bootstrapping of Web3Signer inside a Nitro Enclave – How security sensitive configuration files like private keys can be injected into a Nitro Enclave in a secure fashion and how these config artifacts can be used for an HTTPS endpoint\n\nExposing Web3Signer HTTPS API over vsock – How Transport Layer Security (TLS) traffic can be tunnelled over a vsock connection in a transparent way to establish secure communication with the Web3Signer service running inside a Nitro Enclave\n\nIntegration with Web3Signer for Ethereum validation\n\nTo be able to integrate with Web3Signer, validator clients need to support connection to BLS remote signers (EIP-3030). Popular validator clients such as Lighthouse, Prysm, and Teku already support remote signing. Multiple validator clients can connect to the same Web3Signer instances behind a load balancer. It’s critical that the validator clients not be configured to use the same validator keys, which can result in the validator being slashed. Validator client slashing protection is not effective when multiple validator clients are running simultaneously. For instance, the following diagram shows Validator Client 1 using the validator keys 0xa957cf9 and 0xb821c31 , which means Validator Client 2 can no longer use those two keys. Instead, Validator Client 2 uses the key 0x8f1942c , which isn’t used by any of the validator clients.\n\nIn the accompanying AWS Cloud Development Kit (AWS CDK) code, Web3Signer isn’t configured to use client authentication. However, for production deployments, Web3Signer should be configured to use client authentication with one of the following methods:\n\nGenerate a certificate for each validator client – Create a known clients file with the certificates and load it into Web3Signer. This method is operationally complex but revocation is possible because we only need to modify the known clients file in Web3Signer.\n\nCreate a known clients file with the certificates and load it into Web3Signer. This method is operationally complex but revocation is possible because we only need to modify the known clients file in Web3Signer. Configure Web3Signer to allow validator clients with a trusted CA certificate to connect – This method is operationally easier; however, there is a need to maintain a private certificate authority (CA) server to issue the certificates for each validator client. At the time of writing, the revocation feature is still under development.\n\nFor more information on client authentication, refer to Configure-TLS.\n\nSecure bootstrapping of Web3Signer inside a Nitro Enclave\n\nTo run a Web3Signer service inside a Nitro Enclave in a secure fashion, the following two config artifacts are required:\n\nA TLS key pair to secure the Web3Signer HTTPS API\n\nEIP-2335 specified keystore files, containing encrypted BLS12-381 validator private keys\n\nBoth config artifacts need to be encrypted via a symmetric AWS Key Management Service (AWS KMS) key.\n\nThe KMS key that is being used for the symmetric encryption of the config artifacts needs to have the key policy configured in a way that KMS:decrypt operations, originating from inside the enclave using cryptographic attestation, are being authorized. For additional details how to configure the KMS key policy for this solution, refer to the solution walkthrough on GitHub.\n\nIn this solution, we use two Amazon DynamoDB tables to store the config artifacts: a table for TLSKeys ( TLSKeyTable ) and a separate table for validator keys ( ValidatorKeyTable ).\n\nTLSKeyTable uses the following schema:\n\n{ \"key_id\": \"<>\", “cert_pem”: \"<base64 encloded x509 certificate>\", “encrypted_tls_key_b64”: \"<encrypted private key>\" }\n\nValidatorKeyTable enforces the following schema:\n\n{ “Web3Signer_uuid”: “<stack uuid>”, “pubkey”: “<public key>”, “active”: \"<true/false>\", “chain”: “<ethereum network>”, “datetime”: “<time of creation>”, “deposit_json_b64”: “<>”, “encrypted_key_password_mnemonic_b64”: “<>” }\n\nAs we pointed out before, to be able to start the bootstrapping process, the TLS key pair and the EIP-2335 keystore file need to be encrypted via the symmetric KMS key and the resulting ciphertexts need to be stored in the DynamoDB table.\n\nBy aligning on the schema definitions, different secure Web3Signer processes can be started, each with a unique TLS key and different (>=1) validator keys associated by just passing a single TLS key_id and array of Web3Signer_uuid keys as parameters for the bootstrap process.\n\nThe following diagram depicts the bootstrapping flow.\n\nThe flow consists of eight steps:\n\nThe nitro-signing-server systemd service the starts watchdog.py process. The watchdog process reads the encrypted Web3Signer config assets (TLS keys, validator keys) from the DynamoDB tables. The watchdog process starts the Web3Signer enclave. As soon as the enclave is up and running, the watchdog process calls the init operation of the enclave by sending the following payload. encrypted_tls_key and encrypted_validator_keys contain the config artifacts downloaded from the DynamoDB tables. credential represents temporary AWS security credentials gathered by the watchdog process. payload = { \"operation\": \"init\", \"credential\": credential, \"encrypted_tls_key\": encrypted_tls_key, \"encrypted_validator_keys\": encrypted_validator_keys, } The enclave_init process running inside the Web3Signer enclave validates the incoming init request, ensuring that all required parameters have been enclosed. If all required parameters are present, kmstool-enclave-cli is used to decrypt the TLS and validator keys that are passed to the Web3Signer enclave. kmstool-enclave-cli establishes a secure outbound connection to AWS KMS via vsock-proxy, using cryptographic attestation to be authorized to decrypt the configuration artifacts. If the KMS:decrypt operation using cryptographic attestation was successful, the decrypted files are converted into the right file format and written to the enclave’s in-memory file system. The enclave_init process starts the Web3Signer process. The Web3Signer process reads the config files, decrypts the encrypted private key in the keystore file, and starts the HTTPS listener on the enclave’s localhost interface. The validator client must have Web3Signer configured as its remote signing solution, for example Lighthouse remote signing, as explained earlier in this post. When configured correctly, the validator client can connect to the Web3Signer HTTPS endpoint exposed via https_proxy . For additional details on how to tunnel HTTPS traffic over a vsock connection, refer to the next section in this post.\n\nDue to the transient nature of the Nitro Enclave’s in-memory file system, the bootstrapping process is run every time the enclave or the parent Amazon Elastic Compute Cloud (Amazon EC2) instance is stopped and rebooted.\n\nExposing the Web3Signer HTTPS API over vsock\n\nVsock is a local communication channel between an EC2 parent instance and its enclaves. It is the only channel of communication that an enclave can use to interact with external services.\n\nTo establish a secure connection, for example using TLS, with the Nitro Enclave from inside the parent instance or from an AWS Lambda function running in the same Amazon VPC as the EC2 parent instance, it’s required to forward encrypted traffic over the vsock connection.\n\nThe following two sections explain in detail how HTTPS (TLS) inbound and outbound connections can be established using the vsock proxy processes. The numbers are associated with the different states in the following diagram.\n\nThe diagram also depicts the listener/port configuration of all involved components configured during the AWS CDK deployment process.\n\nRepresentations like 16:5000 refer to the vsock listener where the 16 represents the 32-bit Context Identifier (CID) and 5000 specifies the port. A tuple like 0.0.0.0:443 refers to the internet socket listener where 0.0.0.0 refers to an IPv4 address and 443 specifies the port.\n\nHTTPS inbound flow\n\nThe HTTPS inbound flow has the following steps:\n\nIn the given solution, https_prox y acts like a TCP proxy that translates between AF_INET and AF_VSOCK. It accepts incoming internet socket requests from the validator client on 0.0.0.0:443. https_proxy establishes a vsock connection with a separate vsock_proxy process running inside the enclave listening on 16:5000. It then forwards all received TCP packets via this connection. For each incoming vsock connection, vsock_proxy establishes an internet TCP connection with Web3Signer HTTPS API, which listens on 127.0.0.1:9000. Web3Signer responds via the established TCP connection. After receiving the Web3Signer response, vsock_proxy forwards the TCP packets via the established vsock connection to https_proxy running on the parent instance. https_proxy closes the vsock connection and forwards the TCP packages back to the requesting client.\n\nHTTPS outbound flow\n\nOutbound HTTPS connections originating from the kmstool-enclave-cli binary pointing to AWS KMS use a similar mechanism as explained earlier. The steps are as follows:\n\nkmstool-enclave-cli established a vsock connection with the vsock_proxy process running on the EC2 parent instance listening on 3:8000. vsock_proxy establishes a TCP connection with AWS KMS. AWS KMS responds to vsock_proxy via the established TCP connection. vsock_proxy forwards AWS KMS’s response via the open vsock connection to the enclave. kmstool-enclave-cli closes the vsock connection.\n\nWith this mechanism, HTTPS requests can be securely proxied into and out of the enclave.\n\nIt’s important to point out that the X509 certificate used to verify the Web3Signer endpoints needs the hostname of the parent EC2 instance to be set as CN, otherwise the hostname validation will fail.\n\nAdditionally, using this HTTPS tunnel mechanism and having Web3Signer stop the TLS session inside the Nitro Enclave can lead to additional CPU load due to cryptographic operations.\n\nBesides protecting the sensitive configuration payload like validator private keys, required by Web3Signer inside a Nitro Enclave, new potential attack vectors are being introduced by exposing the Web3Signer HTTPS API. Authentication becomes critical because the HTTPS endpoint is being exposed to the private subnet. We already elaborated earlier in this post on the two different authentication options supported by Web3Signer. Also, it’s important to be aware of downstream dependencies used to build Web3Signer, for example, to avoid the exploitation of issues like the Heartbleed OpenSSL bug.\n\nDifferent tools and open-source libraries are available that you can use to tunnel TLS connections over vsock:\n\ntraffic-forwarder.py – The script used in the AWS Nitro Enclaves Workshop\n\nviproxy – An open-source Go(lang) library on GitHub\n\nsocat – a versatile Linux networking utility\n\nConclusion\n\nIn this post, we provided in-depth explanation of how to integrate Web3Signer with validator clients. We also dived deep into the secure bootstrapping process and ended with a detailed explanation of how to expose the Web3Signer HTTPS API via vsock.\n\nYou can customize the solution and deploy your own Nitro Enclave-secured validator node on AWS!\n\nAbout the Authors\n\nDavid-Paul Dornseifer is a Blockchain Architect with the AWS Worldwide Specialist Solutions Architect organization. He focuses on helping customers design, deploy, and scale end-to-end blockchain solutions.\n\nAldred Halim is a Solutions Architect with the AWS Worldwide Specialist Solutions Architect organization. He works closely with customers in designing architectures and building components to ensure success in running blockchain workloads on AWS."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1yZXZlcnNlZC0xOTIwL9IBRmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1yZXZlcnNlZC0xOTIwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Price Just Reversed and $1,920 is Imminent, Here’s Why - NewsBTC",
        "content": "Ethereum price is showing positive signs above $1,770 against the US Dollar. ETH could gain bullish momentum if it clears the $1,820 resistance zone.\n\nEthereum is moving higher above the $1,750 and $1,770 resistance levels.\n\nThe price is trading above $1,770 and the 100-hourly Simple Moving Average.\n\nThere is a major bullish trend line forming with support near $1,735 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could rise further above the $1,820 and $1,850 resistance levels.\n\nEthereum Price Jumps 4%\n\nEthereum’s price formed a support base above the $1,700 level. ETH started a decent increase after Bitcoin rallied above the $27,000 resistance zone. It broke the $1,720 resistance to move into a positive zone.\n\nThere was a break above the $1,770 resistance zone. It even spiked above $1,800. A high is formed near $1,826 and the price is now consolidating gains. It is still above the 23.6% Fib retracement level of the recent increase from the $1,715 swing low to the $1,826 high.\n\nEther is now trading above $1,770 and the 100-hourly Simple Moving Average. There is also a major bullish trend line forming with support near $1,735 on the hourly chart of ETH/USD.\n\nSource: ETHUSD on TradingView.com\n\nImmediate resistance is near the $1,820 level. The next major resistance is near the $1,850 level. A successful move above the $1,820 and $1,850 resistance levels might send the price further higher. The next resistance sits near $1,920, above which Ethereum could rise toward the $2,000 level. Any more gains above the $2,000 resistance zone might send the price toward the $2,120 resistance.\n\nAre Dips Limited in ETH?\n\nIf Ethereum fails to clear the $1,820 resistance, it could start a downside correction. Initial support on the downside is near the $1,770 level.\n\nThe next major support is near the $1,740 level or the recent low. It is close to the 76.4% Fib retracement level of the recent increase from the $1,715 swing low to the $1,826 high. If there is a break and close below the $1,740 support, the price could drop toward the $1,700 support. Any more losses may perhaps send the price toward the $1,650 zone.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is in the overbought zone.\n\nMajor Support Level – $1,740\n\nMajor Resistance Level – $1,820\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNi8yMC9jcnlwdG8tYW5hbHlzdC1mbGlwcy1idWxsaXNoLW9uLWV0aGVyZXVtLXByZWRpY3RzLXN0ZWFkeS1yYWxseS1mb3ItZXRoLWluLWNvbWluZy1tb250aHMtaGVyZXMtaGlzLXRhcmdldC_SAY4BaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDYvMjAvY3J5cHRvLWFuYWx5c3QtZmxpcHMtYnVsbGlzaC1vbi1ldGhlcmV1bS1wcmVkaWN0cy1zdGVhZHktcmFsbHktZm9yLWV0aC1pbi1jb21pbmctbW9udGhzLWhlcmVzLWhpcy10YXJnZXQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "Crypto Analyst Flips Bullish on Ethereum, Predicts Steady Rally for ETH in Coming Months – Here’s His Target - The Daily Hodl",
        "content": "A closely followed crypto strategist believes that Ethereum (ETH) is poised to surge as it continues to show relative signs of strength despite the recent correction in the altcoin markets.\n\nPseudonymous analyst Rekt Capital tells his 346,700 Twitter followers that Ethereum has managed to successfully retest the $1,719 level as support.\n\nAccording to the crypto strategist, the bullish retest suggests that ETH could rally by more than 23% in the coming months.\n\n“ETH retest is still successful.\n\nETH is enjoying price stability at the base of this orange box.\n\nHold here and ETH is well-positioned to follow the blue path in an effort to revisit the top of the orange box.”\n\nLooking at the trader’s chart, he appears to predict a steady Ethereum rally en route to the $2,275 level by September. At time of writing, ETH is trading for $1,737, up over 1% in the last 24 hours.\n\nWhile Rekt Capital has flipped bullish on Ethereum, fellow analyst Justin Bennett says that ETH is still under a lot of pressure as it continues to trade below key resistance levels.\n\n“Crypto bulls have their work cut out this week.\n\nMarkets like ETH look vulnerable.”\n\nThe trader’s chart shows that ETH bulls must reclaim the $1,800 level to successfully negate both its horizontal and diagonal resistances.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/YanaBu/monkographic"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMDYvMjEvZm94LWpvdXJuYWxpc3QtdW5jb3ZlcnMtZXRoZXJldW0tZm91bmRlci1idXRlcmlucy1jb25uZWN0aW9uLXdpdGgtcHJvbWV0aGV1bS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Founder's Connection with Prometheum Uncovered - The Crypto Basic",
        "content": "A recent investigation by Fox Journalist Terrett revealed that Ethereum founder Buterin has close ties with a firm with part ownership in Prometheum.\n\nIn what came up as an unexpected revelation, Ethereum founder Vitalik Buterin has been revealed as a co-founder of Wanxiang Blockchain Labs, a non-profit research institute funded by Wanxiang Holdings. Wanxiang Holdings is one of the owners of Prometheum, with a major stake in the company.\n\nProminent Fox Journalist Eleanor Terrett disclosed this information in a recent tweet.\n\nEthereum co-founder @VitalikButerin is listed as a co-founder of @WXblockchain, a part owner of @PrometheumInc which was recently given rights to operate a #crypto exchange in the U.S. Other filings show Buterin is also Chief Scientist at Wanxiang Blockchain Labs. pic.twitter.com/ywdl4u97RM — Eleanor Terrett (@EleanorTerrett) June 21, 2023\n\n- Advertisement -\n\nA Web of Connections\n\nEssentially, China Wanxiang Holdings is a holding company that manufactures auto parts through its subsidiary firms. Wanxiang’s Executive Director is Dr. Feng Xiao. Terrett’s recent disclosure suggests that Wanxiang Holdings is behind the funding of Wanxiang Blockchain Labs, a non-profit organization.\n\nFurthermore, Ethereum founder Buterin and Dr. Feng Xiao are two of the three founders of the non-profit Wanxiang Blockchain Labs. In addition, Dr. Xiao is one of the earliest sponsors of Ethereum.\n\nA Medium article by Wanxiang Blockchain reveals that Dr. Xiao proposed to donate $500,000 to the Ethereum Foundation in April 2015 to support the Ethereum mainnet launch. This proposal was made to Buterin in Wanxiang headquarters, and the donation was made under Wanxiang.\n\n- Advertisement -\n\nThe disclosure further reveals that Wanxiang Holdings is one of the owners of Prometheum, with a major stake in the company. An SEC filing by Prometheum shows that HashKey, a partner of Wanxiang, bought 68.8 million Prometheum shares and others for $12 million in 2018.\n\nHashKey also entered a negotiation to acquire 10% of Prometheum for $12.5 million. The deal was to go through after the SEC and FINRA approved Prometheum as a broker-dealer.\n\nInterestingly, Dr. Xiao, Executive Director of Wanxiang, is also the Chairman of HashKey. Following the purchase of Prometheum shares, Dr. Xiao became a member of Prometheum’s board of directors.\n\nConnecting the Dots\n\nThe disclosure has garnered attention from the broader crypto community, given the fact that Prometheum is the only crypto-focused company lauding the SEC’s crackdown on the crypto industry. Prometheum has received a license to operate as a digital asset securities platform, positioned by the SEC as the ideal compliant company.\n\nThe recent discovery unlocks the connection between Prometheum and Ethereum co-founder Buterin at a time when SEC Chairperson Gary Gensler has refused to label Ethereum a security despite asserting that all assets using the proof-of-stake mechanism are securities.\n\nMoreover, the recently released Hinman documents reveal that Bill Hinman, former SEC Director, aimed to make his infamous 2018 speech about Ethereum. The documents disclosed that Hinman would later go on to speak with Buterin following the speech. This raised speculations of a collusion between the SEC and Ethereum.\n\nThe latest revelation has fueled these speculations, especially as it has uncovered that the SEC appears to have been protecting two crypto entities with close ties to Buterin: Ethereum and Prometheum.\n\nRecall that reports of Ethereum being “Chinese-controlled” emerged two years ago following a report from Ripple in the wake of the SEC lawsuit. The Ripple report claimed that Bitcoin and Ethereum were “susceptible to Chinese control.” Buterin dismissed these claims and alleged that Ripple was out to throw Ethereum under the bus in an attempt to save its “sh*tcoin.”\n\nFurthermore, the XRP community speculated that the SEC and Ethereum insiders colluded to attack XRP which was perceived as a competition to Ethereum then. Cardano founder Charles Hoskinson previously dismissed these claims as “conspiracy theories.”"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vdW5jaGFpbmVkY3J5cHRvLmNvbS9ldGhlcmV1bS1kZXZlbG9wZXJzLWNvbnNpZGVyLXJhaXNpbmctdmFsaWRhdG9yLWxpbWl0LXRvLTIwNDgtZXRoL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Developers Consider Raising Validator Limit to 2,048 ETH - Unchained - Unchained",
        "content": "Ethereum core developers proposed increasing the maximum amount of staked ETH to become a validator from 32 ETH to 2,048 ETH amid growing wait times in the activation queue.\n\nIn a developer call last week, Ethereum Foundation researchers proposed raising the validator staking limit to 2,048 ETH per validator, while keeping the minimum amount required to stake ETH at 32 ETH.\n\nEthereum developers Mike Neuder, Francesco D’Amato, Aditya Asgaonkar and Justin Drake first put forth the proposal earlier this month. Whether or not it will be implemented, is still up for debate.\n\nRead more: If Vitalik Is the Pope of Crypto, Is Justin Sun the Inverse Pope?\n\nThe current limit to run a validator stands at 32 ETH, meaning that larger staking service providers like Lido have created numerous validator nodes to offer liquid staking solutions to users. Ultimately, this has resulted in a significant increase in the number of validators on the Ethereum network.\n\nWhile a larger validator set arguably makes the network more decentralized, it has invariably made the entry queue to run a validator node considerably longer. Data shows that the current wait time in the activation queue is more than 44 days, up from a wait time of just under a month last month.\n\nThe activation queue peaked on 9 Jun with 96k Validators in the Pending Queue. If the daily deposit is < then daily activation (2025\n\nvalidators / 64800 $ETH), we will be seeing a reduction in the activation queue. Despite the decline, the queue is still ~45 Days to activate https://t.co/3IZYpfLvC1 pic.twitter.com/qD29a60Roj — Tom Wan (@tomwanhh) June 20, 2023\n\nAccording to Cyber Capital CIO Justin Bons, what matters for true decentralization should be the distribution of power as opposed to the number of nodes.\n\nRead more: JPMorgan Forecasts Ether to Outperform Bitcoin in 2024 Amid Crypto Market Uncertainties\n\n“This proposal only increases the maximum stake allowed on a single node. Not the minimum stake of 32 ETH, which stays the same… Avoiding the inefficient circus of singular parties running hundreds of nodes,” said Bons on Twitter."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmFsdGNvaW5idXp6LmlvL2JpdGNvaW4tYW5kLWNyeXB0by1ndWlkZS9ob3ctbWFueS1ldGgtdG8tYmVjb21lLWEtbWlsbGlvbmFpcmUtYnktMjAyNS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "How Many ETH to Become a Millionaire by 2025 - Altcoin Buzz",
        "content": "The bull market is around the corner. This means there’s a chance to be a millionaire if you hold the right token. Very few tokens qualify as “right” as much as Ethereum. So ETH is one of your best chances to be a millionaire.\n\nBut how much ETH do you need to achieve this? That’s what we want to show you.\n\nHistorical Performance of ETH\n\nBefore I come to an exact number of ETH you need to become a millionaire, you and I need to understand where Ethereum could go from here. But we first need to understand where it’s been. Most of us are not whales holding hundreds of thousands of ETH. So this means we will need to see a big price move to become an Ethereum millionaire.\n\nBut it could happen. Ethereum isn’t a stranger in the crypto community. It is currently ranked #2 by market cap, just behind Bitcoin.\n\nSo, the current ETH price is $1,810.11. It has a circulating supply of 120,206.250. Ethereum has a market cap of $217,555,405,540. This means it makes up a significant portion of the $1 trillion crypto sector as a whole.\n\nEthereum is your best bet in crypto, right after Bitcoin. Its all-time high was $4,815.00 on November 9, 2021. ETH took a hit from the bear market, like everything else. But, it still has a promising future. Ethereum is arguably the altcoin with the biggest potential. Ethereum has several factors that guarantee its long-term success.\n\nSmart contracts\n\nAlso, Ethereum is the first smart contract platform. Smart contracts are the pillar behind the rise of decentralized finance (DeFi). So, Ethereum is home to some of the best DeFi projects.\n\nNFTs\n\nEthereum is the most widely used platform for NFT marketplaces. I agree that NFTs’ popularity has gone down. But if it were to pick up, Ethereum would have a leading position.\n\nThe Metaverse\n\nEthereum is arguably one of the most popular blockchains for metaverse projects. Top metaverse projects like The Sandbox and Decentraland are built on Ethereum’s blockchain.\n\nEthereum hosts several other cryptocurrencies on its network. Projects like Polygon and Shiba Inu rely on Ethereum. So, Ethereum has all it takes to succeed and exceed its past glory. Do you think Ethereum can hit a new all-time high? Let us know in the comments below.\n\nWhat Does Ethereum’s ETH Chart Say?\n\nWe asked our Technical Analysis team to look at Ethereum. And here’s what they had to say:\n\n“ETH is currently trading at a crucial support zone. Failure to hold this support at $1673 could lead to a drop towards $1478, $1194, and $1081, which seems more likely. If ETH manages to stay above $1673, we could start seeing a continuation of bullish momentum towards $2133, $2684, and $3561, which is a less likely scenario.”\n\nSo can ETH hit a new ATH? I definitely think it can in the next bull run.\n\nETH’s lowest point before the start of the last bull market was 89.66 on March 9, 2020. But it picked up in the 2021 bull market and hit an ATH of $4,815.00 on November 9, 2021. That’s about 54.01X.\n\nEthereum has an even more developed ecosystem now than it did then. There have also been a lot of updates and upgrades, such as\n\nThe Merge\n\nShanghai Hard Fork.\n\nWe’ve seen how crazy ETH gets in previous bull runs. I doubt if anything is going to change that in the next bull run.\n\nHow Much ETH = $1 Million?\n\nSo you’ve seen our bull arguments based on:\n\n\n\nMarket value growth.\n\nMarket value dominance.\n\nTechnical analysis.\n\nThriving ecosystem.\n\nSo how much ETH do you need to be a millionaire? We see ETH surpassing its ATH in the next bull run. Our analysis places it somewhere around $6000. If that’s the case, you’ll need about 166.67 ETH tokens to be a millionaire.\n\nEthereum could definitely go above $6k in the next bull run. But I think that’s a more comfortable probability. For 2023, I’ll place Ethereum’s near-term high at $2,100. What’s your take on all of these? Let us know in the comment section below.\n\n⬆️ For more cryptocurrency news, check out the Altcoin Buzz YouTube channel.\n\n⬆️ Our popular Altcoin Buzz Access group generates tons of alpha for our subscribers. And for a limited time, it’s Free. Click the link and join the conversation today."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vdS50b2RheS92aXRhbGlrLWJ1dGVyaW4tcmVsZWFzZXMtZnVuZGFtZW50YWwtbmV3LXRleHQtYWJvdXQtZXRoZXJldW1zLWZ1dHVyZdIBWGh0dHBzOi8vdS50b2RheS92aXRhbGlrLWJ1dGVyaW4tcmVsZWFzZXMtZnVuZGFtZW50YWwtbmV3LXRleHQtYWJvdXQtZXRoZXJldW1zLWZ1dHVyZT9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Vitalik Buterin Releases Fundamental New Text About Ethereum's Future - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum co-founder Vitalik Buterin recently penned an insightful article that delves into the technical challenges associated with enhancing the interoperability between Ethereum Layer 1 (L1) and Layer 2 (L2) solutions. As the adoption of Ethereum's L2s increases, the need for easier cross-layer interactions is becoming more pressing.\n\nAdvertisement\n\nButerin's writings outline two major issues. First, as users begin to hold assets across various L2s and L1s, a method is needed for users to change their access keys across multiple accounts without the need for a high number of transactions. Secondly, Buterin notes the need to handle counterfactual addresses; these are addresses not yet registered on-chain, but they need to securely hold funds.\n\nSource: Vitalik Buterin\n\nTo address these issues, Buterin proposes a unique architecture known as asset/keystore separation. Under this model, users would maintain a keystore contract that houses their verification key and the rules for its modification. In addition, wallet contracts on L1 and several L2s would read cross-chain to fetch the verification key.\n\nTwo implementations of this system are proposed. The \"light version\" would necessitate each wallet storing the verification key locally and updating it with a cross-chain proof of the keystore's current state. The \"heavy version\" would require cross-chain proof for each transaction, making keystore updates cheaper but raising per-transaction costs.\n\nButerin identifies five types of proof schemes that could be used, ranging from Merkle proofs to Verkle proofs, each with its own strengths and weaknesses. Importantly, he emphasizes the need for cross-chain proofs, which should be highly optimized.\n\nIn the long term, the aggregation of proofs through bundling operations submitted by users can help reduce costs. Additionally, Layer 2 solutions should minimize the latency of reading the Layer 1 state. Wallets can also be placed on systems with lower Ethereum connections, such as Layer 3s or separate chains. However, the keystore should be kept either on Layer 1 or on high-security zero-knowledge rollup Layer 2s.\n\nAccording to Buterin, right now, Ethereum is actively moving toward better cross-chain interactions, asset/keystore separation and a stronger focus on privacy."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiM2h0dHBzOi8vbGVhcm4uYnliaXQuY29tL25mdC93aGF0LWFyZS1ldGhzY3JpcHRpb25zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Ethscriptions: Ethereum's Take on Bitcoin Inscriptions - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vdGhlZGVmaWFudC5pby9hcnBhLW5ldHdvcmtzLW1haW5uZXQtaXMtbm93LWxpdmUtb24tZXRoZXJldW3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "ARPA Network’s Mainnet Is Now Live on Ethereum - The Defiant - DeFi News",
        "content": "External - Press Release\n\nBy: Chainwire • Loading...\n\nExternal PR\n\nSingapore, Singapore, June 21st, 2023, Chainwire\n\n\n\n\n\nMajor Q2 milestone achieved following two months of dedicated work since TestNet launch\n\nSingapore, June 21 2023 — ARPA Network, a leading decentralized secure computation network, has launched on the Ethereum mainnet. This achievement comes after two months of unwavering dedication following ARPA’s TestNet launch and is a testament to its relentless commitment to innovating cryptographic systems and promoting the versatility, reliability, and interconnectivity of blockchain technology. Now, with the API available on Ethereum's mainnet, developers can effortlessly build decentralized applications (dApps) using the power of ARPA Network including:\n\nRandom Number Generator for projects of lotteries, gaming, or token distributions;\n\nMulti-party computation tools;\n\nDecentralized voting systems;\n\nDecentralized access control tool for shared resources;\n\nDecentralized and privacy-preserving identity management systems;\n\nSignature middleware for secure atomic swap.\n\nThe MainNet launch marks the culmination of ARPA Network's unwavering commitment to fair, secure, and privacy-preserving blockchain ecosystems. Leveraging the achievements and lessons learned during the MPC MainNet era, ARPA Network has made significant strides by transitioning to the sophisticated TSS-BLS network. Through rigorous DevNet testing and the introduction of the feature-rich TestNet, they have showcased their dedication to innovation, leading to today's fully operational MainNet. This achievement not only highlights ARPA Network's technological advancements but also serves as an invitation for a broader ecosystem of stakers and nodes to join ARPA Network on its ongoing journey of evolution and growth.\n\nFurthermore, on June 22rd, ARPA Network will initiate the minting of the remaining 500 million tokens that have been reserved for staking rewards out of its max supply. These tokens will be dedicated to staking rewards and will also serve as a reserve to fuel the ongoing growth of ARPA Network's ecosystem. These ARPA tokens will be released incrementally over time, ensuring a gradual vesting process for stakers, validating nodes, and other ecosystem participants. This strategic move reflects ARPA’s commitment to long-term sustainability and the steady development of the ARPA Network.\n\nARPA Network is now finalizing a 6-month community pool staking program, with plans to allocate 1.5 million tokens as monthly rewards. The primary goal of this program is to enhance community participation, which is critical for further decentralizing ARPA Network. Community members can stake tokens to earn rewards and monitor the network’s performance. As community staking grows, node operator traction will continue to grow, enhancing the security and efficiency of the network and fostering a more prosperous ecosystem.\n\nDevelopers still deciding what to build with ARPA’s secure and scalable TSS-BLS computation network are encouraged to check out ARPA Network’s code on GitHub and join in the upcoming bug bounty. ARPA’s core tech team is also available on Discord to engage and collaborate with fellow developers.\n\n“The launch of ARPA Network's MainNet on Ethereum marks the initial stride toward realizing an inclusive and interconnected Web 3.0. Our team has been working tirelessly to materialize ARPA's vision of fostering fair, secure, and privacy-preserving blockchain ecosystems. However, this milestone is merely the beginning, and there is much more ground to cover. We extend our heartfelt gratitude to our community for their enduring support as we embark on this thrilling next chapter,\" says ARPA Network CEO Felix Xu.\n\nThough ARPA’s MainNet launch on Ethereum marks a significant milestone, it’s just the beginning for achieving the multi-chain future ARPA envisions. ARPA is actively pursuing integration with other EVM-compatible chains like BNB Chain and exploring the potential of Layer-2 chains.\n\nDeFi Alpha Premium Content DeFi Daily | Weekdays\n\nDeFi Alpha Letter | Weekly\n\nDefiant Podcast Transcript | Weekly\n\nInbox Dump | Saturday\n\nWeekly Recap | Sunday Looking for Alpha? Become a premium member of The Defiant and join our DeFi Alpha community. Start for free\n\nStay current with the latest updates by following ARPA Network on Twitter, or sign up to be a developer with ARPA Network, and use Randcast, the verifiable random number generator (RNG). The Randcast alpha launch will add another layer of innovation to the network, pushing the boundaries of various applications like blockchain games and lotteries, NFT distribution, wallet management, DAO governance, and much more.\n\nAbout ARPA Network\n\nARPA Network (ARPA) is a decentralized secure computation network built to improve the fairness, security, and privacy of blockchains. ARPA threshold BLS signature network serves as the infrastructure of a verifiable Random Number Generator (RNG), secure wallet, cross-chain bridge, and decentralized custody across multiple blockchains.\n\nARPA was previously known as ARPA Chain, a privacy-preserving Multi-party Computation (MPC) network founded in 2018. ARPA Mainnet has completed over 224,000 computation tasks in the past years. Our experience in MPC and other cryptography laid the foundation for our innovative threshold BLS signature schemes (TSS-BLS) system design and led us to today’s ARPA Network.\n\nRandcast, a verifiable Random Number Generator (RNG), is the first application that leverages ARPA as infrastructure. Randcast offers a cryptographically generated random source with superior security and low cost compared to other solutions. Metaverse, game, lottery, NFT minting and whitelisting, key generation, and blockchain validator task distribution can benefit from Randcast’s tamper-proof randomness.\n\n\n\n\n\nContact\n\nElliot Ledley\n\nARPA Network\n\ncontact@arpanetwork.io\n\n"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL2NvaW50ZWxlZ3JhcGguY29tL25ld3MvdGhpcy1sMS1uZXR3b3JrLWNyZWF0ZXMtYS1zZWN1cmUtYW5kLWVmZmljaWVudC1pbnRlcm9wZXJhYmxlLW5ldHdvcmstd2l0aC1iaXRjb2luLWV0aGVyZXVtLWFuZC1tb3Jl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "This L1 network creates a secure and efficient interoperable network with Bitcoin, Ethereum and more - Cointelegraph",
        "content": "In a world of different blockchains, interoperability is becoming an increasingly important issue. While many solutions are already connecting the numerous chains, they don’t come without risks.\n\nDifferent layer-1 blockchains aim to solve this interoperability problem by creating a network with integrated bridges between chains and asynchronous message passing. Using a cross-chain bridge, it’s possible to move value from one chain to another. However, this raises several issues for developers and users. One major issue is the potential for bridge hacks, which have caused billions of dollars in damage in recent years.\n\nIn addition, a fragmented blockchain landscape leads to inefficiencies and complexity, exposing additional vulnerabilities. Trading across chains can be costly with rising gas prices and slippage risks. What’s more, bridging solutions can take anywhere from minutes to hours to get a transaction through.\n\nAttacks on bridges account for 69% of total funds stolen in 2022. Source: Chainalysis\n\nOne blockchain to connect them all\n\nZetaChain, a decentralized layer-1 chain, compatible with the Ethereum Virtual Machine (EVM), aims to make the blockchain industry more interoperable by natively supporting cross-chain bridging of assets, data and liquidity.\n\nZetaChain’s approach makes it possible to build omnichain decentralized applications (DApps) that allow users to access all of their assets and data from a single platform, regardless of the blockchain they were created or stored on. The increased interoperability and ability to create omnichain DApps could improve user experience, which could, in turn, benefit the adoption of blockchain technology in general.\n\nFurthermore, ZetaChain not only supports smart contract chains like Ethereum but can also integrate non-smart contract blockchains like Dogecoin and Bitcoin using the cross-chain toolkit for developers. The network effectively allows for Bitcoin smart contracts giving developers the tools and infrastructure to merge their BRC-20 projects, for example. Overall, however, the network is blockchain agnostic.\n\nSource: ZetaChain\n\nGaining momentum\n\nZetaChain is a new project and therefore is working hard to gain a foothold within the crypto industry. The project recently published its white paper, available in 17 different languages. The document highlights the focus on interoperability between chains and developers worldwide.\n\nThe blockchain’s testnet has attracted more than 1.5 million users from over 100 countries while its community continues to grow. In addition, ZetaChain’s social media channels have built a follower base of over 1.7 million people in the short time they have been live.\n\nOn the developer side, the momentum is visible as well. The project has partnered with many big names in the crypto industry, including an infrastructure provider for the BNB Chain ecosystem Ankr, blockchain security company Halborn, and bug bounty and security services platform Immunefi. DApp development ranges from decentralized exchanges (DEXs) to NFTs and universal and private identity platforms, all to expand the reach of the ecosystem.\n\nDevelopers interested in building DApps on top of ZetaChain can apply for funding through the ZetaChain Grants Program. Hundreds of developer teams have already applied for this funding, hoping to receive a kick-start from the project.\n\n📢 Announcing $5 million in ZetaChain grants to power the next generation of Omnichain dApps. Learn about the program and apply here:https://t.co/ISA1vorcbP — ZetaChain (@zetablockchain) April 13, 2023\n\nNot stealing from other chains, but growing with them\n\nA key aspect of ZetaChain’s mission is to grow with other networks rather than at their expense. Brandon Truong, chief product officer at ZetaChain, emphasized this aspect: “ZetaChain is in a unique position as a new L1 that connects other chains agnostically. Instead of trying to steal liquidity and users from other ecosystems and chains, it can grow with them. The growth of ZetaChain goes hand in hand with the growth of crypto in general.”\n\nThe project’s founders began their journey by exploring the different types of architecture that exist to connect other chains. They quickly discovered many issues, from the aforementioned vulnerabilities to async messaging-based and centralized approaches. By developing an EVM-compatible layer-1 blockchain, ZetaChain aims to be a solution that works for users and developers while keeping security concerns in mind.\n\nZetaChain empowers developers to create easy-to-use DApps that onboard non-crypto natives to the crypto space. Moreover, the network allows developers to create DApps that are cross-chain by default and take out the unnecessary burden of reworking code to make a product work on several chains. With its comprehensive omnichain interoperability features, ZetaChain connects all blockchains, including non-smart contract chains, lowering the barriers to building cross-chain applications to interact with any chain.\n\nLearn more about ZetaChain"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vZmluYm9sZC5jb20vYml0Y29pbi1wcmljZS1wcmVkaWN0aW9uLXRyYWRlY3VydmUtYS1zYWZlLWhhdmVuLWFzLWV0aGVyZXVtLXNlbGwtb2ZmLWNvbnRpbnVlcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Price Prediction: Tradecurve a safe haven as Ethereum sell off continues - Finbold - Finance in Bold",
        "content": "DISCLAIMER: This article is a SPONSORED Press Release and does not constitute Finbold's editorial content nor undergo monitoring. Crypto assets/products involve significant risks. Do not invest unless you are prepared to lose your entire investment. For a full disclaimer, please click here.\n\nWith Ethereum (ETH) and Bitcoin (BTC) facing a selling spree, investors are in dire need of a secure alternative. Say hello to Tradecurve: the perfect savior in the current investment landscape. Comparatively, this new project is estimated for higher returns and unparalleled financial stability. Check out more details below.\n\n>>BUY TCRV TOKENS NOW<<\n\nBitcoin (BTC) gets support from a Cuban advocate; price predictions suggest the token to reach $31,005.61\n\nErich Garcia Cruz, a Bitcoin (BTC) enthusiast and business person in Cuba, has been vocal about the crypto’s adoption in the country. He suggests private businesses can benefit from implementing Bitcoin (BTC) as a currency.\n\nIn fact, Cruz has been supporting Bitcoin (BTC) adoption since 2020. Cruz will also participate in a documentary where he will explain to Cuban people how they can use Bitcoin (BTC) to get rich.\n\nFurthermore, Cruz addresses Cuba as a communist economy where the country’s communist party will oppose Bitcoin (BTC). However, he believes that Bitcoin (BTC) can bring the country’s independence from the central parties. Currently, Bitcoin (BTC) is trading at $25,824.28.\n\nSuch a high price can also become an obstacle to its adoption. Moreover, experts predict it to reach $31,005.61 by the year-end.\n\nEthereum (ETH) brings Shapella upgrade to attract lost investors; token reaches $1,681.74\n\nRecently, Ethereum (ETH) brought two new upgrades to re-engage its past investors. One of the upgrades is called Shapella. Ethereum (ETH) developers created Shapella to enable holders to unstake their tokens.\n\nThe idea was to give Ethereum (ETH) holders control over their stakes, hoping to encourage them to re-stake.\n\nThe upgrade came after Ethereum (ETH) suffered continuous withdrawals from users. The upgrade recorded a high Ethereum (ETH) token net inflow. It was also reported that Ethereum’s (ETH) upgrade grew liquid staking tokens/derivatives (LSD).\n\nHowever, the upgrade hasn’t caused any drastic change in Ethereum’s (ETH) price. Currently, it is trading at $1,688.08, a 2.99% rise in a day. Experts have predicted Ethereum (ETH) to reach a mere $1,691.96 by the year-end.\n\nUnleash your trading potential with Tradecurve\n\nTradecurve is here to redefine the world of online trading by seamlessly blending the best aspects of centralized and decentralized exchanges into one powerful platform. Tradecurve eliminates the hassle of juggling multiple accounts on different platforms.\n\nWith just a single account, investors gain access to an extensive array of markets, including forex, stocks, commodities, and cryptocurrencies. Last year crypto investment assets’ trading volume increased by 127%, which can be boosted this year by the new platform’s excellent accessibility.\n\nUnlike other exchanges, including Coinbase, Binance, etc., this platform believes in simplicity and accessibility. For example, only the user’s email address is required to register an account with no intrusive KYC procedures. Users get ultra-competitive fees and spreads, ensuring higher maximized profits and unnecessary expenses.\n\nIt leverages cutting-edge technology to deliver low-latency, and ultra-fast order execution. Capitalize on market opportunities as they arise, with orders executed swiftly and accurately. Join its 4th live presale today, and discover a trading experience transcending boundaries.\n\nTCRV empowers traders of all backgrounds to take control of their financial futures. The token price has already soared from $0.015 to $0.018, and experts predict it will skyrocket to $0.025.\n\nBrace yourself for its projected 100x growth in just a few months. Invest today and reap unimaginable returns!\n\nFor more information about the Tradecurve presale:\n\nClick Here For Website\n\nClick Here To Buy TCRV Presale Tokens\n\nFollow Us Twitter\n\nJoin Our Community on Telegram"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZGFpbHljb2luLmNvbS9oZXJlcy13aHktcGFyYWRpZ21zLW5ldy1ldGhlcmV1bS1ub2RlLWlzLXNwZWNpYWwv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Here's Why Paradigm's New Ethereum Node Is Special - DailyCoin",
        "content": "Paradigm released a new Ethereum client called Reth.\n\nReth offers a few surprising benefits over its competitors.\n\nReth contributes to Ethereum’s client diversity efforts.\n\nEthereum client diversity is one of the most important things the Ethereum community has to maintain to keep the network as secure as possible.\n\nThat has become a bit easier because Paradigm just rolled out a new Ethereum client called Reth.\n\nParadigm Releases Reth\n\nParadigm, a research-based investment firm, has released Reth, a new Ethereum client written in Rust.\n\nWe are excited to release Reth v0.1.0-alpha! 🎉🎉🎉\n\n\n\nReth is a modular, contributor-friendly, and blazing-fast Ethereum node, in Rust, using the Apache/MIT license.\n\n\n\nLet's unpack what is behind today's release. pic.twitter.com/WU6794uZte — Georgios Konstantopoulos (@gakonst) June 20, 2023\n\nThe new client does what any other Ethereum client does: Syncs up with Ethereum and stores transaction data, among other things. Paradigm specified that Reth is an archive node that stores all Ethereum’s blocks.\n\n“Reth today is a performant Ethereum archive node implementation and toolkit for building EVM-centric infrastructure. We are excited to continue shipping blazing-fast, well-tested and contributor-friendly code, and contribute to the Ethereum ecosystem’s long-term success.”\n\nReth joins a group of already existing Ethereum clients like Geth, Nethermind, and Erigon. However, Reth has a few advantages over all of the mentioned clients.\n\nReth’s Advantages Over Other Ethereum Clients\n\nReth brings a few benefits to the table. For instance, Paradigm claims that Reth is capable of syncing the chain from genesis to the latest block in 50 hours with around 1.92 TB in database size.\n\nFor comparison, the most popular Ethereum clients, Geth and Nethermind, can do a full sync in over a month and use 14.5 TB.\n\nReth currently supports Ethereum-based chains such as Ethereum mainnet, Goerli, Sepolia, and the Ethereum Foundation’s testnets.\n\nOn the Flipside\n\nGeth still dominates the Ethereum client space. It’s going to be tough for Reth to win market share.\n\nThough users can already run Reth, it’s currently unaudited software and is still in its early stages.\n\nWhy This Matters\n\nEthereum client diversity is very important to ensure the network’s robustness. New clients only add to the diversity node runners can choose from.\n\nRead more about Ethereum Layer-2 TVLs soaring:\n\nEthereum Layer-2 zkSync Era’s TVL Soars Over $500M as Rollup Race Continues\n\nRead more about Binance’s opBNB:\n\nHow opBNB Doubles BNB Smart Chain’s Throughput and Drives Down Costs"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMipgFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3RvcC0zLXByaWNlLXByZWRpY3Rpb24tYml0Y29pbi1ldGhlcmV1bS1yaXBwbGUtYnRjLWNvbmZpcm1zLXRoZS1zaGlmdGluZy1zZW50aW1lbnQtaW4tdGhlLWNyeXB0by1lY29zeXN0ZW0tMjAyMzA2MjExODUz0gGqAWh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9hbXAvY3J5cHRvY3VycmVuY2llcy9uZXdzL3RvcC0zLXByaWNlLXByZWRpY3Rpb24tYml0Y29pbi1ldGhlcmV1bS1yaXBwbGUtYnRjLWNvbmZpcm1zLXRoZS1zaGlmdGluZy1zZW50aW1lbnQtaW4tdGhlLWNyeXB0by1lY29zeXN0ZW0tMjAyMzA2MjExODUz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC confirms the shifting sentiment in the crypto ecosystem - FXStreet",
        "content": "Share:\n\nBitcoin price is attempting a reach for the $31,000 high after a 12.29% rally this week, analysts speculate a $35,000 target.\n\nEthereum price could reach $1,941 if ETH leverages the BTC rally for a 5% climb to complete the V-shaped recovery.\n\nRipple price eyes the $0.50 target, but a highly bullish case proposes 10% gains to the $.055 range high.\n\nBitcoin (BTC) price ended its two-month-long downtrend when it broke above the $30,000 mark on Wednesday before a brief pullback. The uptick has inspired a general boom among cryptocurrencies, with Ethereum (ETH) and Ripple (XRP) prices tagging along. Experts have explained the mega rally as a market reaction to spot Bitcoin ETF filings by giant financial institutions like BlackRock and Wisdom Tree.\n\nAlso Read: Bitcoin price breaches $30,000 on Binance, three catalysts power mega rally\n\nBitcoin price gains momentum as $35,000 comes into sight\n\nBitcoin (BTC) price is up 22% from mid-June lows around $24,900 and 12.29% this week. The rising momentum comes amid institutional investors showing a growing interest in and recognition of BTC. Moreover, the subsequent filings by two of the biggest institutional investors underscore the increasing recognition of the potential of Bitcoin in traditional finance. These applications acknowledge the industry's demand for regulated investment vehicles and could pave the way for broader adoption.\n\nAfter crossing the $30,000 mark, Bitcoin price is aiming for the range high of $31,000, a reach that could see the flagship crypto reclaim the mid-April highs. A decisive candlestick close above the $31,000 level could clear the path for a 15% rally to analysts' ambitious target of $35,000.\n\nThe Relative Strength Index (RSI) pointing north shows a rising momentum among buyers. Similarly, the steady rise of the green histograms to the positive zone above the midline shows that bulls are leading the BTC market.\n\nBTC/USDT 1-Day Chart\n\nConversely, the RSI position at 72 shows that BTC is overbought, a situation often preceding a pullback. If this happens, Bitcoin price could repel the $31,000 high akin to what happened on April 14.\n\nAlso Read: Bitcoin dominance hits two-year high at 51%, jeopardizing altcoin gains\n\nEthereum price could rise 5% if the BTC rally sustains\n\nEthereum (ETH) price is reaping the gains from the BTC rally, recording a daily rise of 5% and a weekly rise of 15%. Based on the ETH/USDT daily chart below, the PoS token is headed north and could reach $1,941 soon in a move constituting a 5% ascent.\n\nThis optimistic outlook is supported by the RSI pointing north, suggesting a rising momentum. Notably, its position at 58 was promising as it indicated there was more room upward for ETH to rise. Also, the AO indicator was soaked in green and edging toward the midline, showing bullish muscle that could soon overpower the bears.\n\nETH/USDT 1-Day Chart\n\nOn the flipside, if Bitcoin price shows exhaustion, it could interrupt the ETH rally causing Ethereum price to fall. Such an outcome could see the largest altcoin fall below the 50-day Exponential Moving Average (EMA).\n\nIn the dire case, Ethereum price could fall below the 100-and 200-day EMA at $1,785 and $1,728, respectively, before a possible leg south to the June 15 low of around $1,650.\n\nAlso Read: Ethereum Layer 2 Optimism beats MATIC to the curb, sees massive spike in active addresses\n\nRipple price must flip the supply zone into a breaker to reach its target\n\nRipple (XRP) price is trading with a bullish bias, recording 6% gains on the day. Nevertheless, while the broader market enjoys the overflows of the BTC rally, XRP shows indecisiveness, with neither buyers nor sellers acting out. This is because of the dark clouds above presented by the supply zone between $0.528 and $0.520.\n\nA supply zone is a large area of resistance defined by a population of sellers. Notably, XRP bulls keeping their selling appetite in check could transform this seller congestion zone into a breaker block, interpreted as a failed order block (failed supply or demand zone).\n\nRipple price could ascend toward the said zone, bolstered by the call to buy XRP that the RSI was gearing up for, authenticated once the momentum indicator crosses above the signal line (yellow).\n\nXRP/USDT 1-Day Chart\n\nHowever, selling pressure from the supply zone could repel Ripple price, causing it to flip the 50-day EMA at 0.487 from support into resistance. In the dire case, XRP could lose the 100- and 200-day EMA supports at $0.469 and $0.452, respectively.\n\nAlso Read: Pro Ripple attorney John Deaton finds legal provision that could have avoided SEC lawsuit"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY3J5cHRvdGlja2VyLmlvL2VuL2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tYXMtZXRoLWJvb21zLTYtd2hhdC1oYXBwZW5lZC10by1ldGgv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction as ETH BOOMS 6%...What happened to ETH? - CryptoTicker.io - Bitcoin Price, Ethereum Price & Crypto News",
        "content": "The cryptocurrency market recently underwent a considerable crash that led to a period of consolidation. Amidst the turmoil, prices steadied as they awaited a catalyst, which soon emerged in the form of strong buying power entering the market. Historically, periods of market consolidation followed by a surge of buying accumulation around support prices often pave the way for robust uptrends. Why is Ethereum price up? Let’s analyze in this Ethereum price prediction article.\n\nWhy is Ethereum price up Today?\n\nEthereum is experiencing a surge in price due to the consolidation phase that saw a significant accumulation of buying power at support levels. This robust buying pressure is indicative of an increased interest from investors, who have demonstrated confidence in the coin’s potential, leading to a bullish sentiment.\n\nEthereum price analysis: What happened?\n\nEthereum’s price saw a considerable rise of 7% in the past 24 hours, bringing the current price to around $1,865. This boost is a direct reflection of the strong buying pressure that has been growing in recent times.\n\nEthereum Price Prediction: Where will Ethereum price reach next?\n\nGiven Ethereum’s bullish momentum and the overall uptrend in the crypto market, it is feasible that an Ethereum price prediction could take ETH to the $2,000 mark once again. This prediction, however, hinges on Bitcoin’s price continuing its rise towards the $35,000 range.\n\n\n\n\n\nYou might also like\n\nMore from Altcoin"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3RvcC0zLXByaWNlLXByZWRpY3Rpb24tYml0Y29pbi1ldGhlcmV1bS1yaXBwbGUtY3J5cHRvLW1hcmtldHMtdGFrZS1hLWJyZWF0aGVyLTIwMjMwNjIwMDk1N9IBjQFodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy90b3AtMy1wcmljZS1wcmVkaWN0aW9uLWJpdGNvaW4tZXRoZXJldW0tcmlwcGxlLWNyeXB0by1tYXJrZXRzLXRha2UtYS1icmVhdGhlci0yMDIzMDYyMDA5NTc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Crypto markets take a breather - FXStreet",
        "content": "Share:\n\nBitcoin price attempts to break out of consolidation and retest the $30,000 psychological level again.\n\nEthereum price could aim for $1,853 if bulls take control.\n\nRipple price remains at a better position compared to BTC and ETH and could tag the $0.515 and $0.548 targets.\n\nBitcoin price remains ambiguous, with no clear directional bias. As a result, Ethereum (ETH), Ripple (XRP) and other altcoins are stuck consolidating. But things are likely to change quickly as BTC nears a breakout.\n\nRead Bitcoin's big-picture outlook here: Is Bitcoin’s 2023 bull rally at an end?\n\nBitcoin price attempts a breakout\n\nBitcoin price has been sliding lower since April 19 and has produced three distinctive lower lows and lower highs. Connecting these swing points reveals a falling wedge setup from which BTC attempts to break out in the short term.\n\nA failure to push through could lead to a revisit of the $25,209 support floor. The ideal scenario would include a fake out to the downside, namely a sweep below the $25,209 support level and a potential retest of $23,905 followed by a recovery into the failing wedge and a breakout.\n\nThis move would trigger massive pain for buyers and sellers, and the breakout from this manipulative move could see Bitcoin price retest the $30,000 psychological level.\n\nBTC/USD 1-day chart\n\nHowever, a breakdown of the $20,000 psychological level could hamper the bullish outlook and trigger a selling spree among investors. Such a development could see Bitcoin price revisit the $19,251 and $17,676 support floors.\n\nEthereum price at an inflection point\n\nEthereum price has recovered above the $1,703 support level, but it is unsure if this is the start of a recovery rally. If ETH fails to sustain above the aforementioned support, then the smart contract token is likely to retest the daily inefficiency, which extends from $1,478 to $1,563.\n\nThis move in Ethereum price would represent a 9.30% loss from the current price level.\n\nETH/USD 1-day chart\n\nOn the other hand, if Ethereum price maintains its position above $1,703, it will mean that the bulls are in control. In such a case, ETH could further ascend to retest the $1,817 and $1,853 resistance levels.\n\nRipple price needs to conquer critical hurdles\n\nRipple price completed its inverse head-and-shoulders setup on June 13 and has since dropped more than 14%. XRP price trades at $0.485 at the time of writing and is awaiting directional bias from Bitcoin.\n\nA surge in bullish momentum could see Ripple price tag the immediate hurdle at $0.515. In a highly bullish case, XRP could even retest the $0.548 resistance level.\n\nXRP/USD 1-day chart\n\nWhile the outlook is also ambiguous for Ripple price, a swift and decisive breakdown of the $0.468 support level will confirm a bearish regime. In such a case, XRP price could revisit the $0.442 and $0.408 support floors."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvaGlnaGVyLWJpdGNvaW4tZXRoZXJldW0tY29ycmVsYXRpb24taXMtbm90LWhlbHBpbmctZXRoZXItaGVyZXMtd2h50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "Higher Bitcoin-Ethereum Correlation Is Not Helping Ether: Here's Why - Watcher Guru",
        "content": "In 2021, there was a constant sense of exhilaration for Altcoins to rally, whenever Bitcoin took a step up. It is an obvious observation that during bear markets, BTC’s influence does not propagate to the same extent; at least not in 2023. At the moment, all eyes are currently on Ethereum, as it continues to hover above $1700. According to Coinmetrics, Bitcoin and Ethereum continue to share a high correlation.\n\nAs illustrated in the chart, both assets share a correlation level of 0.88. The correlation dropped to a low of 0.735 on May 26, and a downtrend was observed from March. However, the decrease in correlation doesn’t really match up with both assets’ price action. Let us take a better look into both asset side by side.\n\nBitcoin, and Ethereum: Different But Same?\n\nAs observed in the data set, the correlation dropped sharply from 0.93 on March 26th, to 0.735 on May 26th. Now, a reduced correlation would mean that both assets possibly registered different rallies or corrections. However, that was not the case.\n\nComparing both assets’ price actions during that period, rather than independent, a cohesive downtrend can be observed. Both the tokens are forming lower highs on the daily chart. On three occasions, BTC and ETH tested the descending trendline, with Bitcoin close to its resistance at the moment. Ethereum (lower high 4) still has to bridge the gap on the upside.\n\nOn further analysis, Bitcoin and Ether registered similar upswing ranges, and consolidation periods(highlighted by the boxes). Hence, it is clear that neither Ether nor Bitcoin commanded the upper hand during the uncorrelation period. Inference can be drawn that correlation might not be an appropriate metric to understand the market dependability of certain assets.\n\nAt the moment, analysts in the industry are expecting Ethereum to rally above $1800 and follow Bitcoin’s laid-out bullish path. But the above analysis indicated that Ether might be on its own for now.\n\nFinding Factors\n\nFor Ethereum, the decreasing reliance on Bitcoin correlation is also somewhat positive. It allows Ether to sustain a strong rally whenever the market turns positive for the largest Altcoin. Staking on Ethereum and the recent withdrawals completely changes the market dynamics for ETH. After the Shanghai update, Ethereum’s expansion is much more comprehensive in the broader DeFi ecosystem. The rise of lending and LSD protocols should technically allow increasing liquidity for the ETH industry. Over time, increased liquidity on staked ETH should also lead to increased users and wider retail investors."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vY3J5cHRvdGlja2VyLmlvL2VuL2V0aGVyZXVtLXZhbGlkYXRvcnMtbGltaXQtaW5jcmVhc2Uv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Validators: Limit Increase on the Horizon – Assessing the Impact on Staking and Ethereum Price - CryptoTicker.io - Bitcoin Price, Ethereum Price & Crypto News",
        "content": "Ethereum developers propose a substantial increase in the Ethereum validators limit to 2,048 ETH from 32 ETH\n\nThe Ethereum development community has made a groundbreaking announcement that could significantly alter the Ethereum ecosystem’s structure and dynamics. The proposed change would increase the validator limit from the current 32 ETH to 2,048 ETH, marking an approximate 64-fold increase. This decision is anticipated to reshape the staking landscape and potentially influence Ethereum’s price. Lets take a look at this Ethereum Validators limit increase article in more detail.\n\nThe Current State of Ethereum Staking\n\nUntil now, the threshold to become a validator in the Ethereum network was set at 32 ETH. The validators are responsible for proposing and verifying new blocks within the Ethereum 2.0 proof-of-stake (PoS) system. The amount was deliberately kept low to ensure widespread participation and decentralization of the network.\n\nEthereum Staking involves committing 32 ETH to initiate validator software. As a validator, your duties encompass data storage, transaction management, and appending new blocks to the blockchain. This not only fortifies Ethereum’s security for all users, but it also generates additional ETH as a reward for your contribution.\n\nWhy stake your ETH?\n\nBy staking your ETH, you can earn rewards for activities that aid the network in achieving consensus. These rewards are granted for operating software that correctly groups transactions into new blocks and verifies the work of other validators, contributing to the chain’s secure operation.\n\nAs more ETH is staked, the network’s resilience to attacks strengthens, as it would necessitate a larger amount of ETH to seize control over the majority of the network. To pose a significant threat, one would need to control most of the validators, thereby owning the majority of the system’s ETH – a hefty requirement indeed!\n\nWhat the Proposed Changes Mean?\n\nThe proposition to raise the validator limit to 2,048 ETH is a monumental one, with far-reaching implications. This limit increase means that validators will need to stake a significantly higher amount of ETH to participate in the network’s security and consensus mechanism.\n\nImplications for Ethereum Staking\n\nA New Power Dynamic\n\nThe proposed change could reshape the power dynamic within the Ethereum ecosystem. As the staking limit increases, the pool of potential validators will likely shrink to a more elite group who can afford to stake larger amounts of ETH. This shift could lead to centralization, an outcome that runs counter to the ethos of the decentralized blockchain movement.\n\nIncreased Security and Network Integrity\n\nOn the positive side, a higher staking requirement might lead to a more secure network. Validators, having more capital at risk, would be more incentivized to act honestly and maintain the network’s integrity.\n\nThe Impact on Smaller Stakers\n\nThe significant increase in the staking limit may discourage smaller investors from becoming validators due to the increased financial commitment. Instead, they might opt to join staking pools, where several investors combine their resources to reach the new threshold.\n\nInfluence on Ethereum Price\n\nPotential Price Surge\n\nThe validator limit increase could potentially cause a surge in Ethereum’s price. The demand for Ethereum might increase as validators compete to accumulate enough ETH to meet the higher staking requirements.\n\nMarket Stability\n\nThe proposal might also contribute to market stability. With more ETH locked away in the staking process, there would be less ETH circulating in the market, potentially reducing volatility.\n\nPossible Negative Impact\n\nHowever, this decision could also negatively affect the price if it’s perceived as a move towards centralization. Ethereum’s appeal partly lies in its decentralized nature. Any move towards centralization could decrease its attractiveness to investors, potentially negatively impacting the price.\n\nPros and Cons of Raising Validator Threshold\n\nAt present, the 32 ETH cap prevents validators from accruing interest on any staked ether beyond this figure. The modification suggested by Neuder seeks to eliminate this restriction, potentially unlocking several advantages for validators. Anticipated benefits include simplifying the staking infrastructure for major validators and enhancing the user experience if successfully applied. However, critics suggest that increasing the validator limit might contribute to network centralization, as it could enable substantial entities to wield an imbalanced share of power.\n\nConclusion\n\nThe Ethereum developers’ proposal to increase the validator limit is a major step that could significantly change the staking landscape and affect Ethereum’s price. While the potential benefits include increased security and price stability, concerns remain about centralization and the impact on smaller stakers. As the Ethereum community reviews this proposal, these issues will undoubtedly be at the forefront of the discussion.\n\n\n\n\n\nYou might also like\n\nMore from Ethereum"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZGVjcnlwdC5jby8xNDU2NTAvem9yYS1sYXVuY2hlcy1sYXllci0yLW5mdC1uZXRvd3JrLWJhdHRsZS1ldGhlcmV1bS1nYXMtZmVlc9IBWmh0dHBzOi8vZGVjcnlwdC5jby8xNDU2NTAvem9yYS1sYXVuY2hlcy1sYXllci0yLW5mdC1uZXRvd3JrLWJhdHRsZS1ldGhlcmV1bS1nYXMtZmVlcz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Zora Launches Layer-2 NFT Network to Battle Ethereum Gas Fees - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nZora, an NFT minting platform, launched its own Ethereum layer-2 scaling network today after weeks of testing. It’s designed to lower costs and improve the user experience for artists and creators alike.\n\nDubbed Zora Network, it was introduced in May on a mysterious website proclaiming it to be “pure internet. Free and valuable. Resonance and connection. Open and shared. Independence and expansion. For all creation.”\n\nIt is secured by the Ethereum blockchain, built on the tech stack of layer-2 scaling network Optimism, and already supported by more than 35 platforms—including on-chain music platform Sound, wallet provider Rainbow, and Web3 app toolkit Thirdweb.\n\nAD\n\nAD\n\n“Over the past six months, we’ve been reaching the upper limit of Ethereum mainnet,” Jacob Horne, CEO and co-founder of Zora, told Decrypt. “We’ve had 880,000 collectors and millions of NFTs minted, and have found that gas price is a systemic inhibitor to adoption.”\n\nHorne added that this is a pain point for both collectors and creators alike. In fact, many of the NFTs featured on Zora’s scrolling homepage sell for under $10, and may even be free to mint. An Ethereum network gas fee of a few bucks, or potentially much more during peak moments, could significantly raise the overall transaction cost.\n\nit’s always “wen L2” and never “when scalable infrastructure for artists” — jacob (@js_horne) May 30, 2023\n\nZora’s layer-2 network was created with the idea of subsidizing and abstracting away these costs. Horne said that the network makes minting 25 times cheaper compared to Ethereum.\n\nAD\n\nAD\n\n“L2s have been around for a year now—mainnet Optimism has existed, Arbitrum has existed—but have skewed towards DeFi and a financial use case,” he said. “I think the ecosystem and the market is ready for a network that’s purpose-built for art and media, and really leaning into all the interesting experimental things you can do when you have a network like that.”\n\nZora is one of several NFT platforms that have set out to challenge industry incumbents with new features and products.\n\nFounded by three Coinbase alumni in 2020, Zora started out as a service that offered musicians and other artists the means to sell digital tokens tied to physical artifacts such as cassettes. Since then, the startup has pivoted to focus on building an open-source protocol that allows anyone to stand up an NFT marketplace.\n\nIn May 2022, the company raised $50 million in a round led by Haun Ventures that valued it at $600 million. Zora has previously likened itself to a Shopify or WordPress—companies that offer easy-to-use tools for building online stores and websites—but for NFTs and the emerging Web 3 economy. Horne said Zora has had around 130,000 users so far in June.\n\nHorne previously told Decrypt that the company generates revenue via sales of development tools to help companies customize its free protocol for their particular purposes—a model used by the likes of Linux provider RedHat.\n\nTo date, Zora has been the base for a number of high profile NFT drops, including a $4 million sale of the Doge meme NFT, as well as one for the Warhol Foundation. In April, the company put out a print magazine—a publication with a 2,500 item print run—which was redeemable via NFT. At the time, each NFT cost around $150.\n\nMeanwhile, Zora still has the long-term ambition to create a DAO—or an online community with token-based membership—that could one day raise money through the sale of governance tokens."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9jaGF0Z3B0LXByZWRpY3RzLWFpLWNyeXB0by1pbnF1YmV0YS1vbmUtb2YtZXRoZXJldW0tbmV0d29ya3MtbGVhZGluZy1wcm9qZWN0cy5odG3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 08:05:50 GMT",
        "title": "ChatGPT Predicts AI Crypto InQubeta is one of Ethereum Networks Leading Projects - Cryptonews",
        "content": "ChatGPT Predicts AI Crypto InQubeta is one of Ethereum Networks Leading Projects\n\nDisclaimer: The text below is a press release that is not part of Cryptonews.com editorial content.\n\nIn the year 2023, the world’s attention has shifted towards rapid advancements in artificial intelligence (AI).\n\nAmong the popular AI platforms making waves in the crypto space is the renowned ChatGPT.\n\nHowever, it is the recent surge of InQubeta within the Ethereum network that has sparked discussions about its potential to become one of the leading projects.\n\nTo gain insights into the future of this token, we turn to ChatGPT, a reliable predictor of market trends.\n\nExploring the InQubeta Ecosystem: Overview and Features\n\nInQubeta represents a groundbreaking ecosystem operating at the intersection of AI and crypto crowdfunding.\n\nBy leveraging fractionalized non-fungible tokens (NFTs), InQubeta provides a unique opportunity for individuals to participate in AI projects by owning fractional shares represented by these NFTs.\n\nThis fractionalized ownership model democratizes access to the AI sector, enabling wider participation and investment opportunities.\n\nThe InQubeta ecosystem introduces QUBE, a deflationary and unique cryptocurrency that plays a pivotal role in the platform. QUBE holders benefit from a 5% sell tax, which is directed to a rewards pool.\n\nThis mechanism incentivizes token holders to stake their assets, contributing to the stability and growth of the ecosystem.\n\nIn addition, InQubeta’s token has undergone rigorous security audits conducted by reputable firms such as Hacken and Block Audit, instilling trust and confidence in its integrity.\n\nJOIN INQUBETA PRESALE\n\nBullish Potential: InQubeta’s Growth in Recent Weeks\n\nInQubeta’s recent performance has been nothing short of impressive, with the token price increasing by 25% during the new presale phase.\n\nThis significant growth demonstrates the increasing demand and positive sentiment surrounding the project.\n\nInvestors and market participants recognize the potential of InQubeta’s fractionalized NFTs structure to revolutionize AI crypto crowdfunding.\n\nThe presale phase of InQubeta has already raised over $460,000, indicating a surge in investor interest.\n\nThe enthusiasm surrounding the token stems from its value proposition in the AI space, where fractionalized ownership provides investors with diversified exposure to promising AI projects.\n\nThe minimum investment requirement of $50 and the availability of multiple payment options, including BTC, USDT, and BNB, make participation accessible to a wide range of investors.\n\nChatGPT’s Predictions for InQubeta\n\nAs an AI language model with the ability to analyze market trends and predict potential outcomes, ChatGPT offers valuable insights into the future prospects of InQubeta.\n\nBased on its analysis, ChatGPT suggests that InQubeta has the potential to become one of the leading projects within the Ethereum network.\n\nThe combination of its innovative fractionalized NFTs structure, the deflationary nature of QUBE, and the growing demand for AI crypto crowdfunding positions InQubeta for continued growth and success.\n\nJOIN INQUBETA PRESALE\n\nConclusion\n\nInQubeta’s rise within the Ethereum network has caught the attention of investors and enthusiasts alike, prompting discussions about its potential to become one of the leading projects in the AI crypto space.\n\nWith its fractionalized NFTs structure and the growth witnessed during the new presale phase, InQubeta showcases the transformative power of AI crypto crowdfunding.\n\nChatGPT’s predictions further validate the bullish sentiment surrounding the token, suggesting that InQubeta has a promising future within the Ethereum network.\n\nAs the year 2023 progresses, keeping an eye on InQubeta and its advancements can provide valuable insights for those seeking the best crypto to invest in now or the top crypto coins for long-term growth.\n\nWith the increasing importance of AI and the intersection of AI and blockchain technology, InQubeta stands as a leading player at the forefront of innovation and opportunity.\n\nJOIN INQUBETA PRESALE"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMimAFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2NyeXB0by90b2tlbi9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi10b3BzLTI4NTAwLWV0aGVyZXVtLWFib3ZlLTE4MDAtY2FyZGFuby1wb2x5Z29uLXJpc2UtdXAtdG8tOC0zODY0NDQtMjAyMy0wNi0yMdIBnAFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2FtcC9jcnlwdG8vdG9rZW4vc3RvcnkvY3J5cHRvLXByaWNlLXRvZGF5LWJpdGNvaW4tdG9wcy0yODUwMC1ldGhlcmV1bS1hYm92ZS0xODAwLWNhcmRhbm8tcG9seWdvbi1yaXNlLXVwLXRvLTgtMzg2NDQ0LTIwMjMtMDYtMjE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin tops $28,500; Ethereum above $1,800; Cardano, Polygon rise up to 8% - Business Today",
        "content": "Crypto majors are beginning the trading day in the green as a short squeeze pushes up the price of bitcoin. Positive news flow from global institutions is pushing the markets higher. However, traders will keenly be awaiting US Fed chair Jerome Powell's comment later in the day.\n\n\n\nBitcoin extended its gains, leading the pack, as the largest crypto token surged as much as 7 per cent to top $28,500 mark. Its largest peer, Ethereum, was also up as it jumped about 5 per cent and reclaimed the $1,750-level. Price action in other altcoins was on the higher side.\n\n\n\nMost cryptocurrencies saw a surge following Deutsche Bank's application for a license to provide crypto custody services. Bitcoin, in particular, showed strength as it surpassed the $28,500 mark, a level not seen in the past two weeks. On Tuesday, BTC broke through a significant resistance level, indicating a positive trend, said Edul Patel, Co-founder and CEO at Mudrex.\n\n\n\n\"The primary driving force behind this rally seems to be the increasing institutional interest in Bitcoin, as evidenced by recent filings for a spot Bitcoin ETF by BlackRock and Fidelity Investments. Presently, BTC finds support around $28,450, while resistance levels are situated at $29,000 and subsequently $30,000. Overall, the market exhibits a bullish outlook,\" he said.\n\n\n\nTop crypto tokens were trading with big gains on Wednesday as all top crypto tokens seen in green Cardano surged 8 per cent, while Polygoin and Litecoin were up 6 per cent each. Polkadot and Solana surged 5 per cent each, while BNB added 4 per cent in the early trade.\n\n\n\nThe global cryptocurrency market cap was trading sharply higher, rising to $1.13 trillion-mark as it surged more than 5 per cent in the last 24 hours. However, the total trading volumes rallied about 60 per cent to $44.37 billion.\n\n\n\n\n\nTech View by Giottus Crypto Platform\n\nPolkadot (DOT) has broken the ceiling of the falling trend in the medium term. The asset has reached a significant support region, rising above the lower boundary of the descending channel and the static support zone of $4.5.\n\n\n\n\n\nThe price action indicates thatDOT remains within a descending channel and is presently heading toward its upper boundary. Additionally, the RSI indicator is leaning towards neutral territory with values inching towards 50(currently at44). If DOT manages to cross its 20-day moving average at $4.8, it can quickly rally towards $5.5 levels.\n\n\n\nMajor Levels:\n\nSupport: $4.6, $4.25\n\nResistance: $5.5, $6.0\n\n\n\n\n\n(Views and recommendations given in this section are the analysts' own and do not represent those of Business Today. Please consult your financial adviser before taking any position in the asset/s mentioned.)\n\nAlso read: Tata Steel shares recover, up 9% in 1 month; Motilal Oswal sees limited upside potential"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9uaWtlLXRlYXNlcy1haXJwaG9yaWEtbmZ0LXNuZWFrZXItb24tZm9ydG5pdGUtbmlmdHktbmV3c2xldHRlci1qdW5lLTE0LTIw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Nike teases 'Airphoria' NFT sneaker on Fortnite: Nifty Newsletter, June 14–20 - Cointelegraph",
        "content": "In this week’s newsletter, read about how a project provided a new way to mint nonfungible tokens (NFTs) on Ethereum. Check out Nike’s new collaboration with the popular online game Fortnite, and how rapper Snoop Dogg plans to use NFTs to bring fans with him on tour. In other news, Dmitri Cherniak’s “The Goose” NFT sold for $6.2 million, and artist Kenny Schachter talks to Cointelegraph about blockchain art.\n\nWatch out, Ordinals — 30,000 ‘Ethscriptions’ land on Ethereum\n\nEthscriptions, a project inspired by the Bitcoin Ordinals protocol, is bringing a new way to mint NFTs to Ethereum. Similar to Ordinals, the project lets users “ethscribe” images to the Ethereum blockchain.\n\nAccording to the project’s co-founder Tom Lehman, assets on Ethscriptions use data within a smart contract called “calldata.” The executive claimed this presents a “more decentralized” minting process compared to the old method.\n\nContinue reading\n\nNike teases upcoming ‘Airphoria’ NFT sneaker hunt on Fortnite\n\nFootwear manufacturer Nike gave hints on an upcoming sneaker NFT drop on the popular video game Fortnite. In a social media post, the company shared a short video teasing a collaboration with Fortnite, followed by the logo of its NFT arm .Swoosh.\n\nAs the company did not provide many details, community members turned to speculation. Some believe that Nike may have used Fortnite Creative 2.0, the game’s island map builder, to create an NFT-related game.\n\nContinue reading\n\nSnoop Dogg NFT passport lets fans tour with the rapper in digital form\n\nRapper Snoop Dogg has recently released an NFT that will allow his fans to follow him on tour. The rap icon announced the Snoop Dogg Passport Series, which will provide fans access to behind-the-scenes videos and images uploaded by the rapper while he’s on tour.\n\nAccording to the rapper, he hopes that other artists will notice what he is doing and “innovate” on their own. He said he believes that digital merchandise is a part of the future.\n\nContinue reading\n\nSotheby’s auctions off Dmitri Cherniak’s “The Goose” NFT from 3AC collection for $6.2 million\n\nSotheby’s auction house has recently sold an artwork by Dmitri Cherniak called “The Goose.” The NFT was a part of the collection that belonged to the collapsed crypto hedge fund Three Arrows Capital (3AC).\n\nBack in August 2021, 3AC purchased “The Goose” for 1,800 Ether (ETH), worth around $5.8 million at the time. In the recent auction by Sotheby’s, the NFT was sold for $6.2 million.\n\nContinue reading\n\nSlow Food: Kenny Schachter reflects on blockchain art’s past, present and future\n\nArtist and NFT supporter Kenny Schachter has celebrated the end of his first New York City art exhibition in 25 years, titled “Slow Food.” In an interview with Cointelegraph, the artist said that NFTs might not boom in the same way that they once did. However, he added that this is a good thing.\n\nAccording to Schachter, this may bring the focus back to the many applications of blockchain that go beyond the hype. This includes having a record of provenance, which provides transparency on the previous owners of an artwork.\n\nContinue reading\n\nCHECK OUT COINTELEGRAPH’S NFT STEEZ PODCAST"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vZGFpbHljb2luLmNvbS9wb2x5Z29uLXRvLXRyYW5zaXRpb24tcG9zLWNoYWluLXRvLXprZXZtLXZhbGlkaXVtLWhlcmVzLWhvdy1pdC13b3Jrcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Polygon to Transition PoS Chain to zkEVM Validium: Here's How It Works - DailyCoin",
        "content": "Polygon announced that it would transform Polygon PoS into Polygon zkEVM validium.\n\nPolygon zkEVM validium will have numerous benefits that Polygon PoS didn’t have.\n\nPolygon PoS validators will play an unexpected role in Polygon zkEVM validium.\n\nChanging how a blockchain works from the ground up is incredibly tough. For example, Ethereum developers worked for multiple years to move the blockchain from Proof-of-Work to Proof-of-Stake.\n\nSimilarly, Polygon has just announced that it is transforming its Proof-of-Stake blockchain to a zkEVM validium. Here’s how it works.\n\nPolygon to Transition PoS Chain to zkEVM Validium\n\nPolygon, the Ethereum Layer-2 powerhouse, is going to carry out a major upgrade to its existing Proof-of-Stake chain.\n\nThe development team behind the project revealed on Tuesday that the PoS chain, one of the most popular blockchains, is going to be transformed into a zero-knowledge Ethereum Virtual Machine (zkEVM) validium.\n\n1/ Today a proposal was published to upgrade Polygon PoS to a zkEVM validium, a first-of-its-kind, decentralized ZK Layer 2.\n\n\n\nAs a zkEVM validium, Polygon PoS would inherit Ethereum's unmatched security, while preserving low fees & high scalability.\n\n\n\n👉🏽 https://t.co/5fsMOqLqRy pic.twitter.com/9r9VILxdvu — Polygon (Labs) (@0xPolygonLabs) June 20, 2023\n\nPolygon said that the main motivation to transform the PoS chain was the goal to integrate zero-knowledge technology into it since Polygon 2.0, announced last week, revealed that ZK will power all Polygon chains.\n\nHow Polygon zkEVM Validium Works\n\nPolygon zkEVM validium is the first of its kind. In essence, Polygon zkEVM validium can be thought of as a “sibling” to the Polygon zkEVM rollup.\n\nThe only difference between, say, a zk-rollup like Polygon zkEVM and Polygon zkEVM validium, is that the latter posts transaction data off-chain rather than to Ethereum.\n\nHow Polygon zkEVM validium works. Source: polygon.technology.\n\nThis, in turn, presents multiple benefits, including lower fees because posting transaction data to Ethereum is cheaper and a higher throughput because Polygon zkEVM validium is not bounded to Ethereum.\n\nAs for tradeoffs, Polygon zkEVM validium will use Polygon PoS’s 100+ validators as the data availability layer. Polygon PoS’s validators will also be the entities deciding which transactions to include in a block and in which order.\n\nAs for users and developers, Polygon said that the transition to Polygon zkEVM validium would have little to no impact on their daily experience of using Polygon. MATIC tokenomics will also not change.\n\nOn the Flipside\n\nRollups are considered more secure than validiums because they rely on data availability on Ethereum mainnet.\n\nIt’s not clear why users should use Polygon zkEVM validium instead of Polygon zkEVM and whether those two chains are going to joined together.\n\nWhy This Matters\n\nPolygon zkEVM validium is another step towards greater adoption of crypto technology. For Polygon and the Ethereum community, the new design of the Polygon PoS chain is another milestone in the journey towards scaling Ethereum.\n\nRead more about Ethereum layer 2 TVLs soaring:\n\nEthereum Layer-2 zkSync Era’s TVL Soars Over $500M as Rollup Race Continues\n\nRead more about Binance’s opBNB:\n\nHow opBNB Doubles BNB Smart Chain’s Throughput and Drives Down Costs"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2V0aGVyZXVtLWV0aC1wcmljZS1hbmFseXNpcy1hbmQtc3Bhcmtsby1zcHJrLWludmVzdG1lbnQtcmVjb21tZW5kYXRpb24v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Analysis and Sparklo (SPRK) Investment Recommendation - Analytics Insight",
        "content": "In today’s Ethereum (ETH) price analysis, technical indicators and moving averages suggest a ‘STRONG BUY’ for the ETH/USD pair. As of 17 June 2023, on Binance, the price of Ethereum (ETH) is $1,748.39, showing a significant increase of $77.43 (+4.63%) from the previous close. With a trading volume of 366,649, ETH has experienced a high of $1,770.00 and a low of $1,649.86 in the last 24 hours.\n\nWhile Ethereum (ETH) performance looks promising, experts also recommend considering Sparklo (SPRK) as a potential investment option. Sparklo aims to revolutionize metal investments, focusing on popular metals like gold, silver, and platinum. Let’s delve into the analysis and explore the investment opportunities both Ethereum (ETH) and Sparklo offer.\n\nSparklo (SPRK) Investment Recommendation\n\nSparklo, a unique investment platform, presents an exceptional opportunity for long-term cryptocurrency investors. It introduces a specialized fractionalized trading and investing platform, enabling individuals to purchase silver, gold, and platinum within the crypto market. With its focus on precious metals, Sparklo stands out as a distinctive project in the industry.\n\nInvestors can have confidence in Sparklo’s security measures as the team has committed to locking liquidity for an impressive duration of 100 years. Moreover, the project has obtained KYC certification from Block Audit Report, further instilling trust and credibility in the platform. Operating on the Ethereum blockchain, Sparklo has developed its native ERC-20 cryptocurrency, SPRK.\n\nWithin the Sparklo ecosystem, SPRK serves as the medium of exchange for on-chain purchases and sales of precious metals. It also provides holders with governance rights, allowing them to participate in decision-making processes. Interested participants can take advantage of the Sparklo presale, currently offering SPRK tokens at a price of only $0.04 per token. During presale stage two, users are rewarded with a bonus on all purchases, providing an attractive opportunity for potential investors.\n\n>>>> BUY SPARKLO TOKENS <<<\n\nEthereum (ETH) Price Analysis: ‘STRONG BUY’ Suggested by Technical Indicators and Moving Averages\n\nIn today’s Ethereum (ETH) price analysis, we examine the performance of ETH/USD based on technical indicators and moving averages. As of 17 June 2023, on Binance, Ethereum (ETH) is currently priced at $1,748.39, marking a significant increase of $77.43 (+4.63%) from the previous close. The trading volume stands at 366,649, with a 24-hour high of $1,770.00 and a low of $1,649.86. The bid and ask prices are $1,748.40 and $1,748.41, respectively.\n\nEthereum (ETH) strong performance and positive indications from technical indicators highlight its potential for further growth. The Relative Strength Index (RSI) suggests a buy position, while the Stochastic Oscillator (STOCH) indicates a neutral condition. Additionally, the Moving Average Convergence Divergence (MACD) shows a buy position, and the Average Directional Index (ADX) also signals a buy position. Considering the moving averages, such as the 5-day, 10-day, 20-day, 50-day, 100-day, and 200-day, all indicate buy positions. These indicators collectively support the ‘STRONG BUY’ sentiment for Ethereum (ETH), signaling favorable market conditions for potential investors.\n\nFind out more about the presale with the links below;\n\nClick here to buy presale\n\nCheck out the website\n\nCheck out the telegram channel\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2JpdGNvaW4tZXRoZXJldW0teHJwLXNoaWJhLWludS1kb2dlY29pbi1ob2xkZXJzLWZsb2NrLXRvLWRpZ2l0b2Fkcy1oZXJlcy13aHkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, XRP, Shiba Inu, Dogecoin Holders Flock to DigiToads. Here's why? - Analytics Insight",
        "content": "From the primeval swamps of the crypto landscape, a new king has been crowned: the DigiToad. As investors diversify their portfolios, they are leaping into the DigiToads (TOADS) ecosystem with unparalleled enthusiasm. The presale of this deflationary meme-coin was a roaring success, raising more than $4.8 million and selling over 306 million tokens, translating to a staggering 89.92% of the available TOADS.\n\nWhat draws investors to the DigiToads? The allure lies in the unique blend of gamification, community-building, and forward-thinking economics, designed to empower holders and enrich the ecosystem as a whole. At the heart of the DigiToads initiative is the commitment to resourcefulness, symbolized by the resilient toad.\n\nToad Economics plays an essential role in the project’s appeal. The total supply of 585 million $TOADS tokens has been meticulously allocated to ensure the sustainable growth and long-term prosperity of the ecosystem. This includes a provision for community bonuses, project launch, liquidity pool, development, and team tokens.\n\nThe DigiToads platform incentivizes long-term holding through a novel tax system, which applies to transactions entering and leaving the ecosystem. A 7% buy and sell tax contributes to a token burn, an NFT staking pool, a liquidity pool, and the treasury, creating a constant stimulus for the ecosystem’s circulation.\n\nThe staking of DigiToads NFTs presents a lucrative opportunity for investors. Staking allows holders to earn a percentage of the staking pool, fostering both dedication and loyalty among toad ‘aficionados’. The token price currently stands at $0.042, an attractive entry point for both seasoned and novice investors seeking to ride the wave of this burgeoning ecosystem.\n\nThe token burn integrated into DigiToads introduces an innate deflationary factor. This means that the fixed max supply becomes a perpetually reducing circulating supply, creating a scarcity effect on the number of TOADS tokens. Such a system offers a significant upside for long-term holders of the token, potentially leading to significant returns on investment.\n\nMoreover, DigiToads extends beyond the financial realm into environmental responsibility. They are pledging 2.5% of all profits to charities that help in the replantation of trees and homes for Amazonian species, tying in financial prosperity with global conservation.\n\n>> Buy DigiToads Now <<\n\nDigiToads (TOADS) vs Crypto Incumbents\n\nBitcoin, Ethereum, Ripple, SHIB, and Dogecoin have been crypto frontrunners for years, but even they carry significant weaknesses that DigiToads has successfully addressed. Bitcoin’s high energy consumption, transaction fees, and slow processing speeds can often deter potential investors. Ethereum, despite its smart contract capabilities, suffers from scalability issues and high gas fees. Ripple has faced legal issues and lacks decentralization. SHIB, while popular, has limited utility, and Dogecoin’s unlimited supply introduces inflationary risks.\n\nIn contrast, DigiToads’ deflationary model addresses these issues head-on, offering a sustainable alternative. The DigiToads ecosystem is designed to be self-sustaining and self-propagating, fueled by a deflationary tokenomics model that ensures a constantly decreasing circulating supply.\n\n>> Buy DigiToads Now <<\n\nWrapping Up\n\nDigiToads is proving to be a force to be reckoned with in the crypto world. Its successful presale, innovative economic model, engaging NFT staking system, and commitment to environmental conservation put it on a promising trajectory. It seamlessly intertwines financial growth with community-building and ecological responsibility, thus outshining Bitcoin, Ethereum, Ripple, SHIB, and Dogecoin.\n\nWith over 89.92% of its tokens already sold, this outstanding level of initial support demonstrates a vibrant and enthusiastic community that believes in the mission and potential of DigiToads. This is not just a digital currency or an NFT collection – it’s a promising ecosystem underpinned by a compelling narrative, high potential for returns, and a community-driven approach, well poised to disrupt the crypto landscape. This is the dawn of the Toad’s reign in the crypto swamp, and you don’t want to be left out!\n\nFor more information on DigiToads visit the website, join the presale or join the community for regular updates.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5iaXRjb2luc2Vuc3VzLmNvbS9ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLWRhaWx5LTIwLWp1bmUtZXRoLWJlYXJpc2gtcHJlc3N1cmUtaW50ZW5zaWZ5aW5nLWlzLXRoaXMtYS1zaWduLWZvci1tb3JlLXNlbGwtb2ZmL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction Daily (20-June): ETH Bearish Pressure Intensifying! Is This A Sign For More Sell-Off? - Bitcoinsensus",
        "content": "Ethereum price prediction from a previous analysis Warning! ETH Testing This Key Zone. Get Ready\n\nIn our previous Ethereum analysis Warning! ETH Testing This Key Zone. Get Ready We identified the $1,800 major resistance zone in the 4-hour timeframe as the most important key price level that determines the trend of the ETH price in the coming days.\n\nAnd since publishing that TA, we have seen more bearish pressure pile into the market, with ETH sellers coming in to defend this $1,800 price level.\n\nIn this Ethereum analysis, we will be breaking down what this increased bearish pressure means for the ETH price and what we can expect in the coming days.\n\nTo trade ETH with leverage, sign-up to Bybit right now! Bybit’s BIGGEST Bonus Campaign is now live! You can get up to a $30,000 Bonus when you fund your Bybit account with our Bybit link\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nETH Bearish Price Prediction!\n\nETH Bearish Pressure Intensifying! Is This A Sign For More Sell-Off? Watch this price prediction in the 4-hour timeframe\n\nThe most important key level we are still watching right now in the ETH 4-hour timeframe is the $1,800 resistance region.\n\nWe are seeing more bearish pressure get pushed into this level as sellers are struggling to defend it and stop the ETH price from rallying higher any further.\n\nIf the Ethereum bears can continue to defend this key level, there is a very high probability that we might see a massive price move lower in the coming days.\n\nSo for now, we are keeping a close eye on this key region to see how the ETH price reacts to it.\n\nAnd this is very important because how ETH reacts to this key resistance region will affect the trend of the Altcoin for a while.\n\nFinal Verdict!\n\nThe Ethereum price is not bullish yet! For the Altcoin to be bullish, we need to see the ETH price breakthrough and close above this $1,800 key resistance zone in the 4-hour timeframe.\n\nAs far as the Altcoin price remains below this key zone, we can only expect to continue seeing more bearish pressure pile up in the Ethereum price.\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nHow to Trade Bitcoin (BTC)?\n\nTo understand the basics of Bitcoin trading, you can read our How To Trade Bitcoin Guide. It can prove helpful for traders who are just getting started with Bitcoin trading. You can also check out our list of top Bitcoin Exchanges To Trade With.\n\nPrimeXBT Covesting: Trade Hassel Free\n\nSign-up on PrimeXBT today to trade Bitcoin hassle-free. You can copy experienced traders and access hundreds of different strategies on the platform! Don’t forget to claim your 25% bonus by using the promo code “bitcoinsensus50” when you sign-up with our link PrimeXBT Covesting"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDYvMjEvdml0YWxpay1zaGFyZXMtdmlld3Mtb24taW50ZXJvcGVyYWJpbGl0eS1iZXR3ZWVuLWwtMi1hbmQtbC0xL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Vitalik Shares Views on Interoperability Between L-2 and L-1 - Crypto Times",
        "content": "Vitalik Buterin, the co-founder of Ethereum, has recently shared a groundbreaking vision for Ethereum’s future, highlighting innovative approaches to wallet securities, interoperability between Layer 1 and Layer 2, and privacy.\n\nDeeper dive on L2->L1 and cross-L2 reading. Much more technical than the previous post, but gets into some ideas on how it could be implemented.\n\n\n\nThere's a lot of value in identifying better strategies for L1 <-> L2 interactions and standardizing them.https://t.co/oGUlHqiU0E — vitalik.eth (@VitalikButerin) June 20, 2023\n\nIn March, Vitalik proposed the utilization of multisig wallets, specifically social recovery wallets, as a reliable and user-friendly solution to enhance fund security. The proposed workflow for cross-chain social recovery wallets revolves around a central keystore location and multiple wallets in different locations. Wallets can update their local view of the verification key by reading the keystore during the transaction verification process.\n\nTo enable this functionality, Buterin emphasizes the need for cross-chain proofs, suggesting options such as ZK-SNARKs, Verkle proofs, or a custom-built KZG solution for optimal performance.\n\nIn the long term, Buterin suggests integrating aggregation protocols into the ERC-4337 ecosystem to minimize costs.\n\nThese protocols would generate aggregate proofs while bundling UserOperations submitted by users. To reduce latency, Buterin advises optimizing Layer 2 solutions to allow direct reading of Layer 1 state or state root. By doing so, proof space can be saved, enhancing the overall efficiency of the Ethereum network.\n\nButerin envisions wallets not only on Layer 2 solutions but also on systems with lower levels of connection to Ethereum, such as L3s or separate chains that synchronize state roots and align with Ethereum’s reorganizations and hard forks.\n\nHowever, he emphasizes the importance of placing keystores either on Layer 1 or on high-security ZK-rollup Layer 2 solutions, with Layer 1 offering simplicity and potential cost advantages.\n\nWhile prioritizing privacy preservation may introduce additional challenges, Buterin encourages the Ethereum community to move towards privacy-preserving solutions and ensure that any proposed developments are forward-compatible with maintaining privacy.\n\nWith these visionary proposals, Buterin aims to propel Ethereum’s evolution by addressing crucial aspects of security, scalability, privacy, and interoperability.\n\nAs Ethereum continues to innovate and adapt, these advancements hold the potential to revolutionize various industries and solidify Ethereum’s position as a leading blockchain platform."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC81MDAweC1wcm9maXQtZXhwbG9zaW9uLWV0aGVyZXVtLXdoYWxlLWF3YWtlbnMtYXMtbWlsbGlvbmFpcmUtZ2FtZS1jb2luLW1nLXNldC10by1taW50LW1vbnRobHktbWlsbGlvbmFpcmVzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "5000x Profit Explosion! Ethereum Whale Awakens As Millionaire Game Coin (MG) Set to Mint Monthly Millionaires - Analytics Insight",
        "content": "An Ethereum whale with an 8-year-old wallet suddenly woke up. This whale purchased 8,000 ethers in 2015 during the ICO at an approximate cost of $0.31 each. According to reports from the Twitter account @lookonchain, the initial investment of $2,480 is now worth over $14 million, representing an astonishing 5,000x increase. Investors who missed the chance to become wealthy in 2015 have discovered a new opportunity to become the next Ethereum giant: by participating in the MillionaireGame.\n\nWhat is MillionaireGame?\n\nMillionaire Game Coin (MG) is a novel millionaire-creating meme coin. The gameplay of MG involves “minting a millionaire every month”. Still in its presale events, this project has seen a price increase of 18% in recent days, as it enters stage two.\n\nHow It Works?\n\nOnce the presale ends and the MillionaireGame kicks off, one fortunate token holder will be randomly selected each month to receive the millionaire prize. Therefore, purchasing MG can potentially be a direct route to becoming a cryptocurrency millionaire.\n\nThe Biggest Ethereum Millionaire’s Club\n\nSimilar to Ethereum, MG is a project that emphasizes technological excellence. The MillionaireGame Coin (MG) game will be operated by smart contracts to ensure transparency and fairness. A sustainable tokenomics model has been formulated, which, according to the team, will keep the MillionaireGame running for more than 50 years. MG is set to become the next influential millionaire’s club in the Ethereum network.\n\nEarly Access to Life-Changing Wealth\n\nMillionaireGame Coin (MG) has just announced the price for stage two of its presale. This announcement has naturally sparked interest and curiosity within the crypto community. Some investors, looking to replicate this success, are seeking a token that’s still in its early stages but shows significant growth potential.\n\nMillionaireGame (MG)\n\nWebsite: https://www.millionairegame.net/\n\nPresale: https://www.millionairegame.net/claim-discount\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZW4uZXRoZXJldW13b3JsZG5ld3MuY29tL3BvbHlnb24tcHJvcG9zYWwtcG9zLWNoYWluLXprLWNvbXBhdGlibGUv0gFOaHR0cHM6Ly9lbi5ldGhlcmV1bXdvcmxkbmV3cy5jb20vcG9seWdvbi1wcm9wb3NhbC1wb3MtY2hhaW4temstY29tcGF0aWJsZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "New Polygon Proposal Seeks To Make PoS Chain ZK Compatible - Ethereum World News",
        "content": "Polygon co-founder Mihailo Bjelic unveiled a new Polygon improvement proposal earlier today.\n\nThe proposal seeks to upgrade Polygon’s proof of stake chain to zkEVM Validium.\n\nThe proposal addresses several concerns, including security, gas spike issues, and reorg issues.\n\nIf approved, the zk compatibility would bring scalability, faster transactions, and greater decentralization to the network.\n\nPolygon co-founder Mihailo Bjelic has proposed a major upgrade to the network’s proof of stake (PoS) architecture. The proposal seeks to upgrade the PoS chain to a zkEVM Validium. Polygon, whose zk rollup went live earlier this year, would still be compatible with the Ethereum Virtual Machine as per the latest proposal.\n\nMATIC Would Remain Polygon’s Native Staking Token\n\nAccording to the pre-Polygon Improvement Proposal (PIP) discussion started by Mihailo Bjelic on the network’s governance forum, the proposed upgrade to a zkEVM validium would address the network’s current problems including the security issues, its reliance on Cosmos SDK and Geth, and gas spikes as well as reorg issues. The proposal added that MATIC would continue to serve as Polygon’s staking token.\n\n1/ Today a proposal was published to upgrade Polygon PoS to a zkEVM validium, a first-of-its-kind, decentralized ZK Layer 2.\n\n\n\nAs a zkEVM validium, Polygon PoS would inherit Ethereum's unmatched security, while preserving low fees & high scalability.\n\n\n\n👉🏽 https://t.co/5fsMOqLqRy pic.twitter.com/9r9VILxdvu — Polygon (Labs) (@0xPolygonLabs) June 20, 2023\n\nzkEVM Validium has been presented as a viable, beneficial, and straightforward solution for Polygon’s ongoing issues. Direct benefits of the upgrade would include increased security by leveraging Ethereum’s high security, and future-proof tech stack rather than legacy blockchain architecture. If approved the proposal would also eliminate reorgs, speed up transaction confirmations, increase stability and fee estimation, and bring greater decentralization while making it compatible with Polygon 2.0.\n\n“Upgraded Polygon PoS (zkEVM validium) would offer very high scalability and very low fees, with the tradeoff of storing transaction data locally instead of on Ethereum. It would be a great fit for applications that have high transaction volume and require low transaction fees, e.g. Web3 gaming and social.” Mihailo Bjelic, co-founder, Polygon\n\nAs per the timeline laid out in accordance with the governance process, the pre-PIP discussion and consensus are expected to be done before the end of July 2023. PIP publishing, discussion, and consensus would take place between October as well as November 2023. That would be followed by PIP implantation and testing between November and January 2024. Lastly, the upgrade and PIP activation on the mainnet would take place between February 2024 and March 2024."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vd3d3Lm9reC5jb20vbGVhcm4vb2t4LXZlbnR1cmVzLWNvbnRyaWJ1dGVzLXRvLXNodXR0ZXItbmV0d29ya9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "OKX Ventures Contributes to Ethereum MEV Solution Shutter Network - OKX",
        "content": "HONG KONG, JUNE 22, 2023 - OKX Ventures, the investment arm of the second-largest crypto platform by trading volume and Web3 technology company OKX, is pleased to announce its strategic contribution to Shutter Network, an open-source project that aims to prevent malicious MEV and front running on Ethereum.\n\nMalicious miner-extractable value (MEV) describes revenue that block producers extract by manipulating transactions. A subset of MEV is front-running, in which an attacker attempts to have their own transaction executed ahead of the one broadcast by users. MEV and front-running are recognized as some of the final unsolved fundamental problems in the blockchain space.\n\nShutter Network aims to solve for malicious MEV and front-running by allowing users to send encrypted transactions that are opaque to front runners. Shutter Network is additionally decentralized and gas-efficient.\n\nOKX Ventures Founder Dora Yue said: “At OKX Ventures we are committed to building a sound and secure on-chain environment through considered investments in high-impact projects. We are confident that Shutter Network will continue to contribute to network stabilization and add further value amid the exponential growth of MEV.”\n\nIn May of 2023, Shutter Network launched Shutter protoDAO, which represents a significant step towards decentralization of Keypers nodes.\n\nOKX Ventures will continue to support projects that seek to overcome obstacles to the mainstream adoption of blockchain technology."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LnRla2VkaWEuY29tL2Jlc3QtZXRoZXJldW0tcG9rZXItc2l0ZXMtY29tcGFyZS10b3AtZXRoLXBva2VyLXBsYXRmb3Jtcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "Best Ethereum Poker Sites – Compare Top ETH Poker Platforms - Tekedia",
        "content": "With the Ethereum merge, many people have been looking at ways to use their ETH beyond investing and trading. In this guide we review crypto Ethereum casinos – a form of casino that operates nearly entirely on cryptocurrency that has been slowly sweeping the online casino space.\n\nWith many Ethereum casinos out there now, it can be difficult to select one to grind at. This guide ranks and reviews the best Ethereum poker sites to help you find the best place to play poker with ETH.\n\nWe’ll go over all of the industry giants and pit them against one another, looking at their poker offerings, pros, cons, and showing you everything you need to know.\n\nBest Ethereum Poker Sites for 2023\n\nWhat our review team looked for on the top Ethereum poker sites was an impeccable poker experience, simple and quick withdrawals, and excellent bonuses to get grinders engaged and incentivize a high volume of hands. In our testing, we’ve found the following ETH casinos to be the cream of the crop:\n\nBC.Game – Overall Best Ethereum Poker Site CoinPoker – Top Ethereum Poker Site Cloudbet – Popular Ethereum Poker Site with Generous Bonuses Winz.io – Best Bitcoin Poker Site For Fiat Deposits Ignition – Great Choice for Tournament Play BetOnline – Great For Tournament Play Bitslot – Great Site For Free Crypto Poker Blizz Casino – One of the Best Ethereum Video Poker Sites BitSpinCasino – Newcomer with solid video poker offering Bitcoin Games – Top Ethereum Poker Sites by Bitcoin.com Fortune Jack – Promising Casino With Experts Behind It Mirax – Poker Gaming With Ethereum & Fiat Options Bovada – Popular Among US Poker Players\n\n>>>Claim Your Bonuses Now<<<\n\nBest Ethereum Poker Sites Reviewed\n\nNow, let’s go over each of these sites in detail so you can compare them to your needs and decide if they’re the right fit for you.\n\n1. BC.Game – Overall Best Ethereum Poker Site\n\nBC.Game is one of the biggest names in the crypto casino industry, after its launch back in 2017 it has amassed a user base of over 3 million, with over $1 billion in total bets.\n\nAs our number 1 pick for the best Bitcoin casino site, it’s no surprise that BC.Game is one of the best places to play online poker with Ethereum. It offers thousands of games among which you can find highly advanced slots games, baccarat, roulette, blackjack, and some of the best video poker the world has in store.\n\nWhile these games are relatively few in number, they fully make up for it with their extremely high quality. The visual and sound design has been polished to perfection, with the games feeling almost like they’re played on a real table.\n\nOutside of this, they’ve got a thriving live dealer scene, you can demo almost any game and play free Ethereum poker, plus- they’ve got an excellent welcome bonus. With BC.Game, you get a 180% match on your first deposit, going up to 240% on your fourth. It also takes over 150 different cryptocurrencies as well as their own- BCD.\n\nPros\n\nGreat live dealer scene\n\nHighly polished video poker\n\nGame-made, provably fair offerings\n\nWithdrawals faster than 1 hour\n\nTransparent house edge\n\nYou can play Ethereum poker on android with its app\n\nSports and eSports sportsbook\n\nCons\n\nLimited number of digital poker games\n\nImpossible to change account email without contacting support\n\n>>>Claim Your Bonuses Now<<<\n\n2. CoinPoker – Top Ethereum Poker Site\n\nFirst, we’ll be looking at CoinPoker – the only fully decentralized poker site in the world. CoinPoker released in 2017 as a community-owned crypto poker platform and has since then added a sportsbook. The main currency on the site is CoinPoker (CHP) and ETH-based crypto that functions as a player’s chips.\n\nCoinPoker is one of the few platforms focused almost exclusively on poker play. Their site has regular poker tournaments and Ethereum poker freeroll to keep any poker fanatic busy for months. One of its biggest selling points is its provably fair shuffling RNG. If you’ve ever felt the shuffling algorithm be off in an online poker game, you’ll be happy to know that CoinPoker uses a true random, provably fair algorithm to shuffle decks, they’re so confident in it that they offer a massive prize to anyone that can find even the smallest bug.\n\nAll of the bets made on the platform are fully anonymous, and all of the poker is played fully on chain, meaning there’s no room for cheating or stealing information. Outside of this, CoinPoker provides all of its users with swift and easy deposits and withdrawals, letting you take out your winnings with hardly any wait.\n\nFinally, CoinPoker offers a solid sportsbook with good odds and an extremely intuitive UI, making anything you do on the site a breeze. All of these factors make CoinPoker not only first-class, but the best Ethereum poker site available.\n\nPros\n\nLaser-focused on poker\n\nEthereum poker freerolls\n\nFully community-owned\n\n20% Rakeback offers\n\nAmazing promotions\n\nDedicated tournament scene\n\nQuality sportsbook\n\nCons\n\nRelatively small in size (player traffic)\n\nDoesn’t offer a welcome bonus\n\n>>>Claim Your Bonuses Now<<<\n\n3. Cloudbet – Best All-Rounder Ethereum Casino\n\nMost casinos on this list specialize in a few things – accomplishing them to nigh-perfection. However, sometimes you just want the casino equivalent of a buffet- a little bit of something for everyone, and that’s exactly what Cloudbet provides.\n\nCloudbet has everything you could ask for from a crypto casino- countless standard games, live games, a sportsbook, and excellent bonuses to keep you going. It prides itself in its newcomer experience, providing a slick, modern UI, simple, anonymous deposits and withdrawals, as well as excellent welcome bonuses. They’ll match your first deposit up to 5BTC by 100%, and offer many promotions for loyal users such as all crypto deposits on Thursdays getting a bonus based on your loyalty tier.\n\nFinally, Cloudbet hosts a huge tournament, called the Spinomenal Grand Holidays Tournament with massive cash and NFT prizes. All in all, if you’re looking for an all-rounder casino to dedicate your time and crypto to, you can hardly go wrong with Cloudbet.\n\nPros\n\nCustomer support available 2/7\n\n17 different languages\n\nWell-rounded sportsbook\n\nA great quantity of all sorts of games\n\nOperates completely on cryptocurrencies\n\nGreat promotions\n\nCons\n\nNot available in some countries\n\nNo mobile app\n\n>>>Claim Your Bonuses Now<<<\n\n4. Winz.io – Best Ethereum Poker Site For Fiat Deposits\n\nAlthough we all see that crypto is the way of the future, many of us still have a significant chunk of our funds held up in fiat. Winz.io lets you use both your fiat and crypto funds to play in one of its 6300 games.\n\nWith that being said, Winz.io has relatively few poker titles, albeit the ones they do have are rather solid. It also features excellent welcome bonuses, with one of them giving you a total of 300 spins on their premiere spin game- Winz to the Moon. Alternatively, if you’ve been looking for a casino that offers a welcome bonus extremely compatible with online poker- their second welcome bonus provides you with a 1% return on all of your bets over a period of 2 weeks.\n\nBesides this, one of Winz.io’s biggest benefits is that none of their bonuses have rollovers or a winnings limit. This means no more insane wagering requirements or having to leave your winnings on the table because they’re too large. Being quite a large casino.\n\nPros\n\nA massive number of games\n\nZero rollovers\n\n1% back on all of your bets that can be used on poker\n\nGreat live gaming platform\n\nAccepts a variety of crypto and fiat\n\nCons\n\nLacks a sportsbook\n\nThere’s no mobile app\n\n>>>Claim Your Bonuses Now<<<\n\n5. Ignition – Best Ethereum Poker Site for Tournament Play\n\nIgnition boasts a loaded poker suite complete with solid bonuses, simple, anonymous crypto transactions, and superb customer service. It’s one of very few Ethereum poker casinos online to provide anonymous tables, meaning it’s a great place to learn the craft away from “sharks,” enabling players to better manage their bankrolls while they figure things out.\n\nWhen it comes to making deposits and withdrawals, Ignition offers standard fiat-based options as well as several cryptocurrencies: Bitcoin, Bitcoin Cash, Tether, Litecoin, and, of course, Ethereum.\n\nIgnition serves up a great selection of poker games to play, including Texas Hold’Em. Caribbean Stud, Omaha, guarantee tournaments, and Jackpot Sit & Go are also available, plus a huge selection of video poker games and a wide range of Tournaments.\n\nPlayers that sign up with Ignition using Ethereum can get up to $3,000 cashback split between the casino and poker suite. Poker Points loyalty rewards can also be earned by playing real money games, which can then be used to enter tournaments, including the Sunday $100k guaranteed.\n\nPros\n\nExcellent crypto welcome bonus\n\nHuge selection of video poker titles\n\nTournament play available\n\nPoker loyalty rewards\n\nCons\n\nOnly offers basic poker variants\n\n>>>Claim Your Bonuses Now<<<\n\n6. BetOnline – Best Ethereum Poker Site For Tournament Play\n\nAlthough BetOnline is most renowned for their sportsbook, they are one of the biggest crypto casinos for poker. If you’re a hardcore poker grinder, this might be the perfect site for you.\n\nWhat makes BetOnline one of the best Ethereum poker sites is its competitive integrity. In their latest yearly poker championship in 2023 had players compete for a grand total of $2.3 million in prizes. This is far greater than you could find at most traditional casinos- let alone online ones. If you’re looking for a place to play poker with Ethereum at a competitive level, BetOnline might just be your best bet. However, they also feature excellent facebook and sportsbooks, featuring some of the highest-profile horseraces of today.\n\nThe welcome bonus isn’t half-bad either, with your first crypto deposit getting a 100% match that can be cleared extremely quickly.\n\nPros\n\nBest Ethereum poker site for competitive play\n\nMassive prizepools\n\nRegular tournaments every day, week, and month\n\nSuperb welcome bonus\n\nHas a facebook and sportsbook\n\nCons\n\nWithdrawal fees can be steep\n\nSlightly lacking in terms of non-poker casino games\n\n>>>Claim Your Bonuses Now<<<\n\n7. Bitslot – Great Site For Free Ethereum Poker\n\nIf you’re looking for a beginner-friendly casino with demos to play free Ethereum poker, Bitslot might be the place for you. Started in 2022, Bitslot is a modern, constantly-updating platform you can use to play poker with Ethereum.\n\nThe platform features a welcome bonus of 100% up to 2 BTC , as well as a 23% cashback bonus for existing players. Although there are more efficient promotions out there, Bitslot has shown a willingness to grow its promotions alongside the platform. What makes it one of the best Ethereum video poker sites is its large breadth of video poker games you can demo for free.\n\nWith over 3000 games on the platform, you’ll be spoiled for choice, alongside having access to some of the most technically advanced live-dealer games on the market.\n\nPros\n\nLightning-fast payouts\n\nFirst-class demos for most games\n\nQuite a lot of variety\n\nRoutinely updated\n\n>>>Claim Your Bonuses Now<<<\n\n8. Blizz Casino – One of the Best Ethereum Video Poker Sites\n\nBlizz Casino is one of the newest platforms on this list, and is still receiving very regular updates. It has an excellent portfolio of video poker titles, excellent welcome bonuses, and one of the biggest progressive jackpot prizepools out there.\n\nIf you’re a dedicated player, you might be interested in their VIP program, where the casino itself will invite their highest-performing players and they’ll reap massive benefits. It also features $3000 weekly races where regular high-profile players race for cashbacks.\n\nPros\n\nExcellent promotions including weekly races\n\nGreat progressive jackpot prizepool\n\nExcellent selection of video poker\n\nReceives regular updates\n\nCons\n\nLimited outside of video poker\n\nx50 Rollover\n\n>>>Claim Your Bonuses Now<<<\n\n9. BitSpinCasin – With a Solid Video and Live Poker Offering\n\nA relative newcomer to the ever growing popular Bitcoin casino industry, BitSpinCasino sure is a contender. Backed by one of the biggest names in the Bitcoin news media space, Roger Ver’s Bitcoin.co, this casino platform has quickly built up a similar positive reputation.\n\nPoker enthusiasts are not to be disappointed here, it may not have a poker room but you can still play the classics like Oasis Poker, Caribbean Poker – and you can play Royal Poker in the live casino which is pretty close to the mark.\n\nWith well over 1,500 games on offer, a live chat that is ready 24/7 and a smashing welcome offer to boot you are all set for some fun entertainment. You can work yourself up the ladder in their VIP loyalty program to gain more perks, but even so – you get 20 free spins for only 50 loyalty points. The next offer a steady 2% cashback which is not to be sneezed at.\n\nPros\n\nThe team behind it has a huge amount of experience\n\nWell put-together UI\n\nProvably fair offerings\n\nSportsbook with esports\n\nCons\n\nFew poker games\n\nYou can either get the casino welcome bonus or the sportsbook one\n\n>>>Claim Your Bonuses Now<<<\n\n10. Bitcoin Games – Top Ethereum Poker Sites by Bitcoin.com\n\nMoving on, in the 11th spot, we have Bitcoin Games — a platform backed by Bitcoin.com, but also one that accepts Ethereum payments. The website offers a variety of games, including poker, supplied by NetEnt, Playson, Evolution Gaming, Belatra Games, Pragmatic Play, and other providers. Apart from poker, it also offers blackjack, video poker, roulette, slots, keno, craps, baccarat, and more.\n\nThe website was licensed and established under the laws of Costa Rica, and it is both Bitcoin and Ethereum-friendly, in addition to accepting several other cryptocurrencies. Its design is also very user-friendly, which makes it easy for new users to quickly and easily navigate the platform. Of course, if you ever encounter any issues or have questions that the FAQ cannot answer, the site has a 24/7 customer support available, which can help with anything you need.\n\nPros\n\n15% cashback for newly registered users\n\n25% cashback if you are a VIP\n\nUnlimited withdrawals per month\n\n24/7 live chat\n\nLow minimum deposit\n\nCons\n\nWith zero bonus\n\n>>>Claim Your Bonuses Now<<<\n\n11. Fortune Jack – Promising Casino With Experts Behind It\n\nFortune Jack is a fully licensed crypto casino held by the Nexus Group, a group with over 20 years in the field. The platform has a variety of video poker and live poker games, as well as an incredibly interesting selection of their own provably fair titles.\n\nThe platform also has a full-fledged sportsbook with a 2x welcome bonus on your first bet lower than 10mBTC. On the casino side of things, the welcome bonus is a 110% matched bonus up to 1.5 BTC and comes with 250 free spins.\n\nPros\n\nThe team behind it has a huge amount of experience\n\nWell put-together UI\n\nProvably fair offerings\n\nSportsbook with esports\n\nCons\n\nFew poker games\n\nYou can either get the casino welcome bonus or the sportsbook one\n\n>>>Claim Your Bonuses Now<<<\n\n12. Mirax – Best For Modern Games With Fiat Options\n\nMirax is another casino offering fiat deposits alongside crypto, having started just recently in 2022, it’s a great place to play poker with Ethereum if you’re looking for excellent futuristic graphics.\n\nWhile its welcome bonus is relatively modest at a 100% match up to 1.5BTC with 50 free spins, it’s a budding casino and it’ll take time for its offerings to be up to par with the greats. However, it shows a lot of promise in the scrutiny it has toward game quality and already has the high quality required to be one of the best Ethereum video poker sites. Furthermore, its bonuses for existing players aren’t half bad.\n\nPros\n\nReceives regular updates\n\nSolid welcome bonus for a newer casino\n\nGreat video poker titles\n\nFiat deposits in addition to crypto\n\nCons\n\nNo live chat feature\n\nLacks a sportsbook\n\n>>>Claim Your Bonuses Now<<<\n\n13. Bovada – One of the Places to Play Online Poker with Ethereum With Sportsbook\n\nAlthough Bovada is most renowned for its sportsbook, it has been moving heavily into the competitive poker space. In addition to giving you access to one of the best crypto sportsbooks, you’ll be able to play a variety of casino games on the site.\n\nIt has a growing competitive poker scene, and its welcome bonus is worth up to $3000 on your first three deposits. There are quite a few competitive poker tournaments on the site, including turbo, sit-and-go, and knockout tournaments. If you’re someone that enjoys the competitive side of poker, or want to move up the ladder as a player, Bovada might be a great place to start.\n\nPros\n\nLots of sports available\n\nHigh competitive integrity\n\nLots of poker games available\n\nExcellent live dealer offerings\n\nCons\n\nThe sportsbook odds can be shaky\n\nFew crypto are accepted\n\n>>>Claim Your Bonuses Now<<<\n\nHow We Select the Best Ethereum Poker Sites\n\nSecure Crypto Payments\n\nCrypto payments are famously more secure than card payments, and a site accepting a wide range of crypto means that your money will be safer with them. Crypto is also much harder to steal, so once your money is with the casino, there’s hardly any chance it’ll get lost. Because of this, we evaluate sites that accept more cryptos better, as you’ll have less reason to use fiat. Also see our guide to Bitcoin poker sites.\n\nRange of Poker Games\n\nThe more distinct poker games a site has, the higher the chances you’ll find your perfect game. We’ve prioritized sites that offer a balance between the different kinds of online poker games out there. Naturally, we’ve looked at the quality, payouts, and popularity of these games. After all, the best multiplayer poker games might as well not exist if nobody’s playing.\n\nFast Deposits & Withdrawals\n\nWhen you win at a game, you want to be able to collect your winnings as quickly as possible. Similarly, nobody wants to wait hours for a deposit to clear, because of this, we gave priority to sites known for quick withdrawals and deposits.\n\nCrypto Bonuses & Promos\n\nOne of the benefits of crypto betting is getting to reap all kinds of benefits and promotions that come with depositing crypto. These include welcome bonuses, special cryptocurrency promotions, and more. Naturally, sites that rewarded its users with more digital currency and better benefits placed higher on our list.\n\nLow Crypto Banking Fees\n\nSome sites will charge relatively high fees for crypto deposits. Since crypto is an all-round superior and more efficient way to pay than fiat, we’ve prioritized sites with little to no crypto banking fees.\n\nEthereum Video Poker vs Live Poker\n\nNewer players might be confused on what the difference is in playing on one of the best Ethereum video poker sites or playing a live game. Truth be told, there are fairly few similarities between the two. Let’s break it down:\n\nMost video poker games are more similar to poker-themed slots than live poker. As a singleplayer endeavor, video poker is designed so that the house will win over the long haul. This means that machines are configured to a so-called “payback percentage” of your expected returns with perfect play, so a 10 ETH deposit at a 95% playback percentage will return 9.5 ETH.\n\nWhile there’s a lot of variation in video poker games, most of them consist of the machine dealing 5 cards to the player and then discarding any number of them to make their hand better. However, most games are tuned to a sub-100% payback percentage, meaning you’ll be losing money with perfect play. However, certain kinds like Deuces Wild will sometimes have a payback percentage over 100%, meaning you’ll make money with perfect play.\n\nThe skills used in either game are also different. Live poker relies heavily on bluffing, reading other players etc. and your method of making money is to outskill them. Meanwhile, in video poker, the main skill you need to have is the ability to gauge the mathematically optimal play, as there are no other live players. All in all, live poker and video poker are entirely different beasts, although both of them are extremely fun to play.\n\n>>>Claim Your Bonuses Now<<<\n\nBest Ethereum Poker Games\n\nNow that you know the difference between video poker and live poker, let’s go over some of the most popular video poker variations you can play on the best Ethereum video poker sites.\n\nJacks or Better\n\nJacks or Better is the simplest and most beginner-friendly form of video poker. Its payback percentage is usually around 99.5%, and the lowest paid hand is its namesake- Jacks or Better, meaning a set of at least 2 Jacks, Queens, Kings, or Aces. Bets are paid out evenly, meaning that if your hand has jacks or better at the end, you get winnings equal to your bet.\n\nOftentimes, Jacks or Better variations will let you participate in a bonus game at the end of each hand, giving you 5 cards, 1 of which is face up, and the rest face down. If you guess which of the 4 face down cards has a higher value than the revealed one, you double your winnings.\n\nDeuces Wild\n\nDeuces Wild is one of the most common video poker options you can play profitably. Much like Jacks or Better, it comes in a lot of different forms and takes advantage of a 52-card single deck. The most interesting gimmick with this style of video poker game is well, the Deuces or two. They can be used to complete any winning hand by replacing any card dealt. The lowest hand in this kind of video poker is three of a kind, and is paid out evenly, a four of a kind is paid out at 5 times the bet, and a five of a kind gets you 15 times your bet.\n\nProgressive Jackpot Video Poker\n\nProgressive jackpot poker is another interesting kind of video poker. Here, a winning hand doesn’t have a fixed payout, but rather a raising jackpot. A percentage of each bet is added to the jackpot pool, and the pool is reset once the jackpot is won. This is one of the harder kinds of video poker to calculate a payback percentage for and play optimally, however, if you’re able to do it, payback percentages over 100% aren’t too rare.\n\nBonus Poker\n\nBonus poker is a Jacks or Better variation where payouts for some four of a kind hands, like four Aces, gets a higher payout. The lowest paying hand is still two Jacks, and the rest are ranked similarly to Jacks or Better, with some four of a kind hands getting paid out at 4x or even 8x. Usually, the payback percentage for this kind of game is around 99%, however, occasionally you’ll find variations paying over 100%.\n\nJoker Poker\n\nJoker poker is fairly similar to deuces wild, in that there’s a wildcard, however, it comes in addition to your hand, making it possible to form five of a kind hands. The lowest paying hand is adjusted accordingly, being a pair of Kings or better. This kind of video poker usually has a payback percentage around 98-99%, however, some variations pay out over 100% with completely optimal play.\n\nEthereum Poker Site Betting Bonuses\n\nThere are a variety of different betting bonuses you can get on the best Ethereum poker sites. Let’s go over the biggest ones.\n\nMatch Bonuses\n\nMatch bonuses are present at many online casinos, and some of the best Ethereum poker sites will use this kind of bonus. A match bonus is one of the best kinds of bonuses for poker players, as you don’t have to spend time playing slots or similar games, and can just focus on poker.\n\nFree Bets\n\nIf you’re looking to play some free Ethereum poker, then you’ll be best off looking to play at casinos offering free bets as part of their welcome bonus. Some would also consider Ethereum poker freeroll tournaments to be a form of free bets, as you can get into freeroll tournaments for free and earn money. Our best Ethereum poker site – CoinPoker, hosts these on the regular.\n\nFree Spins\n\nOne of the most common forms of bonus are free spin bonuses, these bonuses will give you several free spins on a casino’s slots games of choice. Occasionally, these free spins will have a limit on the earnings you can collect form them, and might expire after some time, so make sure to check the casino’s terms and conditions before using them.\n\nPoker Chips\n\nSome crypto casinos might offer poker chips directly as a welcome bonus. However, this is fairly rare, and is in many cases inferior to a match bonus, as a match bonus is flexible with how much you want to invest into poker. On the other hand, poker chip bonuses are fairly rigid, with you getting the same amount of chips for 1 mBTC and 1 BTC.\n\nNo Deposit Bonuses\n\nTo redeem bonuses at most crypto casinos, you’ll need to deposit crypto into the casino. This way, the casino only gives you a bonus once you’ve deposited your funds into it. No deposit bonuses are, like the name suggests, a kind of bonus where you don’t need to deposit anything before getting access to your bonus. Sometimes, casinos will even let you use this bonus before depositing to gamble on their games.\n\n>>>Claim Your Bonuses Now<<<\n\nBest Ethereum Wallet for Poker\n\nTo play Ethereum poker, you’ll need to have a wallet that can hold your Ethereum. There are a variety of crypto wallets available today, however, many of them face UI issues. If you don’t want to wrestle with your wallet to access your funds, or find out that some of the best Ethereum poker sites aren’t compatible with your wallet – use eToro.\n\neToro is one of the biggest global crypto platforms, and in addition to its wallet services, will let you directly purchase Ethereum taking a minuscule 1% fee. It also provides custodial storage, meaning you won’t need to faff about with keys to your wallet- simply log into your eToro account and all of your ETH will be immediately available.\n\nWhen playing Ethereum poker, you’ll want your wallet to be easy to access and quickly give out funds. eToro enables you to quickly send and receive ETH from different wallets, and is supported by all of the best Ethereum poker sites, as well as with Android and iOS to help you play Ethereum poker on Android or iPhone. If you’re into trading, it’ll also let you trade from the same account. This helps minimize the hassle introduced by most wallets where you have to integrate them with different trading platforms.\n\nIf you also use other crypto, you’ll be glad to know eToro supports hundreds of cryptos, ensuring that you’ll always be able to use all of your funds to play poker. The platform is regulated by the FCA, ASIC, SEC, and CySEC. In terms of security, it’ll also let you enable 2FA, and provides DDoS protection and standardization protocols. All in all, eToro is simply a cut above the rest in terms of performance and security.\n\n>>>Buy Cryptos<<<\n\nYour capital is at risk.\n\nHow to Get Started with a Ethereum Poker Site\n\nIf you think you’re ready to start playing Ethereum poker, follow this simple guide to get started on Lucky Block.\n\nStep 1: Get a Crypto Wallet\n\nThe first thing you’ll need to do is get a crypto wallet to hold your crypto. In this guide, we’ll be using the eToro Money App – our crypto wallet of choice. Click the button below, create an account, and install the app on your device of choice.\n\n>>>Buy Cryptos<<<\n\nYour capital is at risk.\n\nStep 2: Buy Ethereum\n\nGo to the eToro website, and using the same login details as with the eToro Money App, make a $10 or more deposit through card, Neteller, or Skrill, or a $500 deposit through bank transfer.\n\nOnce you’ve completed that, all you need to do is search for Ethereum and click Open Trade for the amount you’d like to buy. Finally, send Ethereum to your wallet by providing your wallet address found in the eToro Money app.\n\nStep 3: Create a BC.Game Account and Deposit ETH\n\nVisit the BC.Game website and create an account by inserting your credentials. You’ll need to pick a username and password in addition to giving them your email.\n\nOnce you’re done with that, follow the deposit process to deposit your ETH.\n\nStep 4: Deposit ETH into BC.Game Account\n\nClick ‘Deposit’, select ETH and then copy the address into the eToro wallet. Send ETH from the eToro wallet.\n\nStep 5: Start Gambling\n\nOnce your deposit from the eToro app is processed, you can immediately start playing on the best Ethereum poker site out there, BC.Game.\n\n>>>Claim Your Bonuses Now<<<\n\nConclusion – Best Ethereum Poker Sites\n\nCountless Ethereum poker sites are claiming to be the best, today, we’ve gone through our top 13 list, each of which we’ve subjected to intensive testing. In our experience, BC.Game is the best overall crypto casino and sportsbook, offering more than 2,700 games, sports wagering and a variety of classic casino games.\n\nThere are now 12 poker games available with more being added, and live tables to be added in the coming weeks.\n\nBC.Game also offers excellent bonuses – such as 300% bonuses – low deposits on ETH and fast withdrawal times with no limits or fees.\n\nFAQs\n\nWhere can I play poker with Ethereum?\n\nThere are many sites that’ll allow you to play poker with Ethereum, the best ones in our testing are BC.Game, CoinPoker, and Cloudbet.\n\nWhat are the best Ethereum poker sites?\n\nThe best Ethereum poker sites from our testing are CoinPoker, BC.Game and Cloudbet with their wide variety of poker offerings and excellent gameplay experience.\n\nShare this: Facebook\n\nTwitter\n\nWhatsApp\n\nLinkedIn\n\nEmail\n\nPrint\n\n"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmZpbmFuY2lhbGV4cHJlc3MuY29tL2J1c2luZXNzL2Jsb2NrY2hhaW4tZXRoZXJldW0tZm91bmRhdGlvbi10by1pbmNyZWFzZS1pdHMtZXRoZXItc3Rha2luZy1saW1pdC0zMTM0MzcwL9IBemh0dHBzOi8vd3d3LmZpbmFuY2lhbGV4cHJlc3MuY29tL2J1c2luZXNzL2Jsb2NrY2hhaW4tZXRoZXJldW0tZm91bmRhdGlvbi10by1pbmNyZWFzZS1pdHMtZXRoZXItc3Rha2luZy1saW1pdC0zMTM0MzcwL2xpdGUv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Foundation to increase its Ether staking limit - The Financial Express",
        "content": "The developer team of Ethereum Foundation, a non-profit organisation supporting Ethereum, plans to execute a 64-fold increase in most of the staked Ether (ETH $1,728)in order to become a validator, stated Cointelegraph. The minimum staking amount is expected to be about 32 ETH and a maximum of 2048 ETH.\n\nSources revealed that the proposal was made on June 15, 2023, during the Ethereum core developer consensus meeting organised by Michael Neuder, researcher, Ethereum Foundation. Supposedly, Michael mentioned that in spite of the current limit of 32 ETH more validators will be allowed to join the Ethereum network, Cointelegraph added.\n\nAlso Read Tezos collaborates with Blockbank for management of digital assets\n\nFurthermore, Neuder expects that the current proposal would also help large node operators, such as exchanges, which currently manage thousands of validators, Cointelegraph concluded.\n\n(With insights from Cointelegraph)\n\nFollow us on Twitter, Facebook, LinkedIn"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vZmluYm9sZC5jb20vY2hhdGdwdC1oYXMtZ2l2ZW4tdGhpcy1ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLWFsc28tdGhpbmtzLXRoZXNlLXRva2Vucy1jb3VsZC1wdW1wL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "ChatGPT Has Given This Ethereum Price Prediction & Also Thinks These Tokens Could Pump - Finbold - Finance in Bold",
        "content": "DISCLAIMER: This article is a SPONSORED Press Release and does not constitute Finbold's editorial content nor undergo monitoring. Crypto assets/products involve significant risks. Do not invest unless you are prepared to lose your entire investment. For a full disclaimer, please click here.\n\nEthereum ($ETH) is up over 44% since the turn of the year, with investors now hopeful that the token can hit the fabled $2,000 level before the end of 2023.\n\nChatGPT has had its say on Ethereum’s price prospects, and while predicting the path of the token’s price remains complex, it has highlighted where it believes $ETH could go before the year is out.\n\nHowever, it’s not just Ethereum that has caught ChatGPT’s eye – with the model also highlighting three altcoins it believes could pump in the coming months.\n\nChatGPT Expects Ethereum to Finish 2023 Strongly After Bullish Rebound\n\nAfter a difficult few weeks, things are looking up for $ETH holders – with the token’s price rising over 6% since last Thursday.\n\nCurrently, $ETH is hovering around the $1,722 level, where price struggled back in mid-March.\n\nBullish momentum has recently picked up after $ETH was beaten down following the SEC’s decision to sue both Binance and Coinbase.\n\nAlthough these lawsuits weren’t directly related to Ethereum, the uncertainty caused by them prompted a broad sell-off in the crypto market, which hurt the $ETH price.\n\nFortunately for Ethereum bulls, there has been some excellent news recently which could provide a platform for consistent growth.\n\nThe most critical news item involves the Fed’s decision to pause interest rate hikes – viewed as a hugely positive signal for “risky” asset classes like cryptocurrencies.\n\nThis decision has buoyed the investment community, with ChatGPT now extremely optimistic about $ETH’s prospects for the remainder of 2023.\n\nPer ChatGPT, the price of Ethereum could hit $2,100 by the end of the year – which would represent a 21% increase from today’s price.\n\nWith this potential price increase in sight, many investors are opting to bolster their crypto portfolios with $ETH, believing that the positive market sentiment could lead to significant returns by year-end.\n\nWall Street Memes Unleashes the Power of Memes to Raise $8.8m – ChatGPT is Bullish\n\nHowever, it’s more than just Ethereum catching ChatGPT’s eye.\n\nGroundbreaking meme coin Wall Street Memes ($WSM), which has now raised over $8.8 million through its presale phase, has also piqued interest due to its unique value proposition and potential for growth.\n\n$WSM aims to be much more than just a simple token; instead, the developers aim to create a massive community of investors and internet enthusiasts using the power of memes and social media culture.\n\nThis aim has already created an enormous buzz around Wall Street Memes, with thousands of people joining the official Telegram channel to learn more about the project.\n\nChatGPT is also buzzed about Wall Street Memes’ prospects, speculating that the $WSM token could hit $0.065 by the end of 2023.\n\nShould this occur, it would represent a 120% increase from the current presale price of $0.0295.\n\nThis potential for growth underscores the dynamic nature of the crypto market and the exciting opportunities presented by projects like Wall Street Memes.\n\nVisit Wall Street Memes Presale\n\nMAGIC Transforms NFT Landscape and Catches ChatGPT’s Attention\n\nAnother crypto that ChatGPT is heavily bullish on is MAGIC ($MAGIC).\n\n$MAGIC is the native token of the Treasure ecosystem, which is commonly referred to as a “decentralized games console.”\n\nThis ecosystem is built around NFTs and crypto gaming, with $MAGIC used to turn NFTs into yield-bearing assets within the Treasure world.\n\nMoreover, members of the Treasure ecosystem can earn $MAGIC tokens by participating in various gameplay elements, providing an immersive way to generate a recurring crypto income stream.\n\nThis setup has prompted a wave of interest in $MAGIC – and ChatGPT believes this interest could catapult the token forward in the coming months.\n\nAccording to ChatGPT, $MAGIC could increase to around $1.10 by the end of the year, driven by the vast potential of NFTs and Web3 tokens.\n\nAs more users join the Treasure ecosystem, the demand for $MAGIC will continue growing – helping propel its value to ChatGPT’s forecasted heights.\n\nAvalanche Poised for Promising Future According to ChatGPT\n\nFinally, Avalanche ($AVAX) is the third token that ChatGPT believes could pump in the coming months, alongside Ethereum.\n\nAvalanche is a blockchain network that aims to solve the “blockchain trilemma” through a unique Proof-of-Stake (PoS) mechanism.\n\nThe network was launched in 2020 and supports smart contracts, meaning decentralized application (dApp) developers can build and run their creations on Avalanche.\n\nSince Avalanche focuses on speed and scalability, many believe it’s a better option than Ethereum for high-throughput dApps.\n\nPer CoinMarketCap, the price of $AVAX, Avalanche’s native utility token, is now just $11.24 – down over 20% in the past 30 days.\n\nHowever, the good news for $AVAX holders is that ChatGPT believes things could be about to take a positive turn.\n\nAs predicted by ChatGPT, the $AVAX price could head to $16.50 by the end of the year – which would be 47% higher than it currently is.\n\nIf this growth trajectory occurs, Avalanche could become one of the most prominent gainers in the latter half of 2023."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vYml0Y29pbmlzdC5jb20vd2h5LWV0aGVyZXVtLW1hcmtldC1jYXAtaGlnaGVyLXRoYW4tYWxsLWFsdGNvaW5zL9IBTGh0dHBzOi8vYml0Y29pbmlzdC5jb20vd2h5LWV0aGVyZXVtLW1hcmtldC1jYXAtaGlnaGVyLXRoYW4tYWxsLWFsdGNvaW5zL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 00:03:50 GMT",
        "title": "Ethereum Market Cap Higher Than All Altcoins For The First Time in Over 2 Years - Bitcoinist",
        "content": "The Ethereum market capitalization has surpassed that of all the altcoins in the crypto market for the first time since February 2021. In a screenshot shared by a Twitter user, the Ethereum market cap, currently at $213.8 billion, exceeds all that of altcoins, including major crypto projects like Solana, Cardano, Dogecoin, etc. This is happening for the first time in over 28 months.\n\nEthereum Outperforms Altcoins\n\nAs of June 20, Bitcoin dominated the cryptocurrency scene with a market cap of over $541.9 billion, representing nearly 50% of the total crypto market cap, currently at $1.1 trillion, according to CoinMarketCap data.\n\nEthereum’s market capitalization can be attributed to several factors. A key is that Ethereum enjoys a first-mover advantage in its sector, like Bitcoin. The platform is the first to implement smart contracts and the longest-standing platform operating with high reliability, nearing 100%.\n\nConsequently, it has been adopted broadly and continues to anchor projects, including Aave and Maker, that manage billions of crypto assets.\n\nBesides, the platform’s decentralization and security mean the platform anchors most decentralized finance (DeFi) and non-fungible token (NFT) activity. As of June 20, data from DeFiLlama shows that Ethereum’s DeFi protocols cumulatively manage over $25.2 billion of assets, representing over 50% of DeFi’s total value locked (TVL).\n\nThe high level of community engagement, through validator count, means Ethereum is secured by nodes operated across the globe. For instance, on-chain data shows that there are 623,096 live validators who, on average, have staked 32.18 ETH to secure the network and only stand a chance to validate Ethereum blocks and receive ETH rewards.\n\nThe distribution of validator nodes across the globe enhances the network’s security, thereby adapting users who must pay ETH when transacting on-chain.\n\nBitcoin Dominates Crypto\n\nWhile Ethereum’s market share increases, Bitcoin’s is pushing higher and becoming more valuable. As the coin edges higher, pushing above the $27,500 level on June 20, its dominance stands at around 49.9%, highlighting its role in the crypto scene. Earlier today, on June 20, Bitcoin’s dominance rose above 50% for the first time in 2 years.\n\nBitcoin is the only cryptocurrency asset declared property and, thus, a commodity in the United States. This endorsement validates Bitcoin and has seen its prices supported in the past few days when altcoins, including Polygon (MATIC) and Cardano (ADA), have seen double-digit losses following the Securities and Exchange Commission’s allegation that they are examples of “unregistered securities.”\n\nFeature Image From Canva, Chart From TradingView"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmJpdGNvaW5zZW5zdXMuY29tL2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tZGFpbHktMjEtanVuZS11cmdlbnQtZXRoLWp1c3QtYnJva2UtdGhyb3VnaC10aGlzLWtleS1sZXZlbC13aGF0LW5vdy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction Daily (21-June): Urgent! ETH Just Broke Through This Key Level. What Now? - Bitcoinsensus",
        "content": "Ethereum price prediction from a previous analysis ETH Bearish Pressure Intensifying! Is This A Sign For More Sell-Off?\n\nIn our previous Ethereum analysis ETH Bearish Pressure Intensifying! Is This A Sign For More Sell-Off? we identified the $1,800 key resistance zone as the most important level the Ethereum bears had to defend if we want to see this Altcoin sell-off continue in the coming days.\n\nHowever, the bulls have finally been able to push the Altcoin price past this key level in the 4-hour timeframe. And in this Ethereum analysis, we will be breaking down what this bullish rally means for ETH price and what we can expect to see in the coming days.\n\nTo trade ETH with leverage, sign-up to Bybit right now! Bybit’s BIGGEST Bonus Campaign is now live! You can get up to a $30,000 Bonus when you fund your Bybit account with our Bybit link\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nPrevious Resistance Now New Support!\n\nUrgent! ETH Just Broke Through This Key Level. What Now? Watch this price prediction in the 4-hour timeframe\n\nBy breaking through the $1,800 key zone, the ETH bulls have successfully converted this previous resistance into new support. The question now is can this new support hold?\n\nFor the ETH bulls to hold on to this market or even attempt to continue pushing the Altcoin higher, we need to see this $1,800 price level hold at all costs.\n\nSo in the coming days, we will be keeping a close eye on this level to see how the ETH price reacts to it. Will we see more bullish pressure begin to step into the market as buyers try to defend this zone?\n\nFinal Verdict!\n\nUrgent! ETH Just Broke Through This Key Level. What Now? Watch this price prediction in the 4-hour timeframe\n\nThe ETH bulls are struggling to wrestle back control of the market in the 4-hour timeframe. But for this to happen, we need to see the Ethereum price hold on to the $1,800 key support and continue to trade above it.\n\nIf the ETH bulls can defend this key level successfully, there is a very high probability that we might see a more aggressive push to the upside in the coming days.\n\n[bybti]\n\nHow to Trade Bitcoin (BTC)?\n\nTo understand the basics of Bitcoin trading, you can read our How To Trade Bitcoin Guide. It can prove helpful for traders who are just getting started with Bitcoin trading. You can also check out our list of top Bitcoin Exchanges To Trade With.\n\nPrimeXBT Covesting: Trade Hassel Free\n\nSign-up on PrimeXBT today to trade Bitcoin hassle-free. You can copy experienced traders and access hundreds of different strategies on the platform! Don’t forget to claim your 25% bonus by using the promo code “bitcoinsensus50” when you sign-up with our link PrimeXBT Covesting"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3Lmdyb292eXBvc3QuY29tL2hvd3RvL2ltcG9ydC1jcnlwdG9jdXJyZW5jeS1wcmljZXMtaW50by1nb29nbGUtc2hlZXRzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "How to Import Cryptocurrency Prices Into Google Sheets - groovyPost",
        "content": "How-To How to Import Cryptocurrency Prices Into Google Sheets By\n\nDo you want to keep on top of the latest crypto price rises (and falls)? Learn how to import cryptocurrency prices into Google Sheets using this guide.\n\nIf you own any cryptocurrency or you’re thinking about buying some, you’ll want to keep track of the current prices. That way, you’ll know if it’s the right time to buy or sell. There are plenty of websites that can provide this information, but you might prefer to use a spreadsheet to keep track of prices over time, or to do other calculations.\n\nIf you’re a fan of Google Sheets, it’s possible to get cryptocurrency price data into your spreadsheets and then use them how you wish. Learn how to import cryptocurrency prices into Google Sheets below.\n\nHow to Import Cryptocurrency Prices using GOOGLEFINANCE in Google Sheets\n\nThe GOOGLEFINANCE function allows you to pull live information on a wide range of traditional currencies directly from Google. It also allows you to pull prices for some of the most popular cryptocurrencies, including Bitcoin, Ethereum, Litecoin, Cardano, and Binance Coin, but it doesn’t work with others such as Dogecoin.\n\nTo import cryptocurrency prices using GOOGLEFINANCE:\n\nOpen a Google Sheets document. Select the cell where you want the price to appear. For the price of Ethereum, enter the following formula: =GOOGLEFINANCE(“ETHUSD”) For the price of Ethereum, enter the following formula: =GOOGLEFINANCE(“BTCUSD”) If you want to import other cryptocurrencies, you’ll need to include CURRENCY in the formula. For example, for Litecoin, enter the following formula: =GOOGLEFINANCE(“CURRENCY:LTCUSD”) You can replace LTC with many of the more popular cryptocurrency codes, such as ADA and XRP, but it won’t work with four-letter codes such as DOGE and LINK. Press Enter and the price will calculate.\n\nYour spreadsheet will automatically update periodically as the price of your selected cryptocurrency changes. This usually happens after 20 minutes or so.\n\nHow to Import Cryptocurrency Prices Using IMPORTXML in Google Sheets\n\nIf you want to import cryptocurrency prices that the GOOGLEFINANCE function doesn’t handle, then one option is to scrape the data directly from a cryptocurrency website. The IMPORTXML function allows you to pull the data from the webpage and bring it into your Google Sheets document.\n\nTo import cryptocurrency prices using IMPORTXML:\n\nIn an empty cell, paste the URL for the webpage containing your cryptocurrency price data. For example, for the Ethereum page of CoinMarketCap.com, you would paste the URL https://coinmarketcap.com/currencies/ethereum/\n\nNavigate to that page in Chrome, and right-click on the price you want to import. Select Inspect.\n\nThe value you selected should be highlighted. If not, click on the price in the left-hand pane. Just above the price, you should see a div name.\n\nRight-click on this line and select Copy Element. Paste this somewhere into your spreadsheet and highlight and copy just the class name, such as class=”priceValue “ In the cell next to the URL, type: //div[@\n\nPaste the class name that you just copied and type a closed square bracket. Your cell should now read something like: //div[@class=\"priceValue \"] Now select the cell where you want your cryptocurrency price data to appear and type the following: =IMPORTXML( Click in the cell containing your URL, type a comma, click in the cell containing your div class, and finally type a closed bracket. Your formula should look something like this: =IMPORTXML(G10,H10) Press Enter and the cryptocurrency price data should be scraped from the website.\n\nHow to Refresh Scraped Cryptocurrency Prices in Google Sheets\n\nThe data you have scraped will update once per hour. To keep the value updated more frequently, you can force the cell to recalculate. One fairly simple way to do so is to create a macro that copies the cell, deletes it, and pastes it back in again. This will cause the cell to recalculate which should pull the most recent data from the cryptocurrency website.\n\nTo refresh scraped cryptocurrency prices using a macro:\n\nOpen the Google Sheets spreadsheet containing your scraped data. In the menu, click Extensions.\n\nHover over Macros and select Record Macro.\n\nOnce the macro is recording, click the cell with your scraped data. Press Ctrl+C on Windows or Cmd+C on Mac to copy the cell. Press Delete or Backspace to delete the cell. In the same cell, press Ctrl+V on Windows or Cmd+V on Mac to paste the formula back into the cell. Click Save at the bottom of the screen to save your macro.\n\nGive your macro a name. If you wish, you can also add a keyboard shortcut.\n\nClick Save. To run your macro, press your keyboard shortcut, or go to Extensions > Macros and click on your macro name.\n\nYour cell should now refresh and the data inside it should update.\n\nHow to Import Cryptocurrency Prices Using IMPORTDATA\n\nYou can also import cryptocurrency data using a website specifically designed for this purpose. The IMPORTDATA function allows you to pull price information directly from this website. The data will refresh once an hour.\n\nTo import cryptocurrency prices using IMPORTDATA:\n\nClick in the cell where you want the price data to appear. Enter a formula in the following format: =IMPORTDATA(https://cryptoprices.cc/ETH/) You can change ETH to the code of a variety of different cryptocurrencies. See https://cryptoprices.cc/sitemap.txt for the full list of options. Press Enter and you should see the current price.\n\nHow to Import Cryptocurrency Prices Using the CoinMarketCap API\n\nAnother way to get cryptocurrency prices from CoinMarketCap is to use its API. By creating an account and generating your own API key, you can poll the site directly and import a huge amount of cryptocurrency information into your Google Sheets document.\n\nIn order to get the data into Google Sheets, you’ll need to use an add-on called API Connector.\n\nTo import cryptocurrency prices using the CoinMarketCap API:\n\nOpen your Google Sheets document and click the Extensions menu.\n\nHover over Add-ons and click Get Add-ons.\n\nIn the search field, type API Connector and press Enter.\n\nSelect API Connector in the search results.\n\nClick Install.\n\nSign in to your Google account and allow the required permissions. To set up your CoinMarketCap API, navigate to https://coinmarketcap.com/api/ Click Get Your API Key Now.\n\nEnter your details, select Basic as your plan type, and click Create My Account.\n\nYou’ll be emailed to verify your account. Click the link, and you’ll be redirected to the API dashboard. Hover over the API Key and click Copy Key.\n\nReturn to your Google Sheets document and click Extensions.\n\nHover over API Connector and click Open.\n\nClick Create Request.\n\nUnder Application select CoinMarketCap from the drop-down box.\n\nClick in the API Key field and paste your copied API key.\n\nUnder Endpoint, select /v2/cryptocurrency/quotes/latest from the drop-down.\n\nClick the Plus (+) symbol next to Aux and select any of the options from the drop-down—the request won’t run without a selection in this field.\n\nClick the Plus (+) symbol next to Slug and select the coin or coins you want to pull data for.\n\nSelect a cell in your spreadsheet where you want the first cell of the pulled data to appear, and click Set Current.\n\nGive your request a name and click Save.\n\nClick Run and your request will run.\n\nThe column USD.price contains the current price information.\n\n\n\nHow to Update Cryptocurrency Prices Using API Connector\n\nThe price generated by the CoinMarketCap API will not automatically update. However, it is possible to get API Connector to refresh your data at regular intervals from once an hour up to once a month. This will help you to ensure that your cryptocurrency prices are up-to-date.\n\nTo update cryptocurrency prices using API Connector:\n\nClick the Extensions menu.\n\nHover over API Connector and select Open.\n\nSelect the Schedule tab.\n\nClick Create Trigger.\n\nUnder API Request, select the name of the request you created in the section above.\n\nUnder Run Request, select your refresh time.\n\nEnter a name under Trigger Name and click Save. Your cryptocurrency data will now refresh at the frequency that you selected.\n\nChecking Your Portfolio in Google Sheets\n\nLearning how to import cryptocurrency prices into Google Sheets means you can use that price data in whatever calculations you wish. You’ll be able to monitor prices, and even set up some conditional formatting to alert you when the cryptocurrency hits a certain price.\n\nThere are plenty of other useful Google Sheets tricks you can learn. You might want to learn how to use timestamps in Google Sheets, for example. Or you may want to know how to remove dollar signs in Google Sheets if some of your scraped data has included them. You might also want to learn how to merge sheets in Google Sheets to help you organize your data."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMilgFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vMTQtdHJpbGxpb24tYXNzZXQtbWFuYWdlci1kZXV0c2NoZS1iYW5rLWFwcGxpZXMtZm9yLWNyeXB0by1jdXN0b2R5LWxpY2Vuc2UtdG8tc3RvcmUtYml0Y29pbi1ldGhlcmV1bS1hbmQtcmlwcGxlLXhycC_SAZwBaHR0cHM6Ly93d3cuY3J5cHRvLW5ld3MtZmxhc2guY29tLzE0LXRyaWxsaW9uLWFzc2V0LW1hbmFnZXItZGV1dHNjaGUtYmFuay1hcHBsaWVzLWZvci1jcnlwdG8tY3VzdG9keS1saWNlbnNlLXRvLXN0b3JlLWJpdGNvaW4tZXRoZXJldW0tYW5kLXJpcHBsZS14cnAvP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "$1,4 $ trillion asset manager Deutsche Bank Applies for Crypto Custody License to Store Bitcoin, Ethereum and Ripple (XRP) - Crypto News Flash",
        "content": "Deutsche Bank seeks regulatory license to provide custody services for digital assets, including cryptocurrencies.\n\nThe bank’s decision aligns with its strategy to expand income from digital asset offerings, following the footsteps of other financial institutions in the industry.\n\nDeutsche Bank, one of the largest financial institutions with $1.4 trillion in assets under management, is embracing the world of cryptocurrencies. The German bank has recently applied for a regulatory license that would enable it to provide custody services for digital assets, including cryptocurrencies.\n\nDuring a conference, David Lynne, the Global Head at Deutsche Bank’s Corporate Bank, confirmed the bank’s plans, stating that they are actively developing their digital assets and custody business. The application for a digital assets license has been submitted to BaFin, Germany’s securities watchdog responsible for overseeing financial activities.\n\nThis strategic move by Deutsche Bank aligns with its broader strategy to increase fee income and follows in the footsteps of its investment arm, DWS Group, which has been focusing on digital asset-related offerings. Recognizing the tremendous potential of the cryptocurrency market, the bank aims to meet the growing demand for custody services for digital assets.\n\nThe application for a digital assets license demonstrates Deutsche Bank’s commitment to expanding its presence in the crypto industry. It’s worth noting that despite previous research reports expressing concerns about the volatility of Bitcoin and its reliability as a store of value, the bank is now actively pursuing the provision of custodial services for digital assets.\n\nDeutsche Bank’s decision falls in line with the trend of established financial institutions venturing into the crypto custody space. Major players such as Ripple, Standard Chartered, Nasdaq, BNY Melon, Fidelity, and BNP Paribas have also recognized the increasing demand for regulated custodial solutions in the cryptocurrency market.\n\nAs institutional participation in the crypto space continues to rise, the demand for secure and regulated custodial services is growing. Deutsche Bank’s application for a regulatory license positions the bank to cater to this demand and compete with other industry players. Notably, this move comes at a time when renowned financial giants like BlackRock and Fidelity are also expressing their intent to enter the crypto market.\n\nWith regulatory clarity and easing rules in Germany facilitating crypto adoption, Deutsche Bank’s entry into the cryptocurrency custody service space showcases the bank’s confidence in the future of digital assets. It also underscores the bank’s commitment to meeting the evolving needs of its clients in this rapidly expanding industry.\n\nThis article is provided for informational purposes only and is not intended as investment advice. The content does not constitute a recommendation to buy, sell, or hold any securities or financial instruments. Readers should conduct their own research and consult with financial advisors before making investment decisions. The information presented may not be current and could become outdated."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vaW5zaWRlYml0Y29pbnMuY29tL25ld3MvZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi1nb2xkZW4tY3Jvc3MtZm9ybXMtb24tZXRoLWNoYXJ0LW9wdGltYWwtdGltZS10by1idXnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction: Golden Cross Forms on ETH Chart – Optimal Time to Buy? - Inside Bitcoins",
        "content": "Don’t invest unless prepared to lose all the money you invest. This is a high-risk investment, you shouldn’t expect to be protected if something goes wrong.\n\nJoin Our Telegram channel to stay up to date on breaking news coverage\n\nDespite facing recent challenges due to enforcement actions by the U.S. Securities and Exchange Commission (SEC), the crypto market has demonstrated resilience by recording a 0.69% gain in the last 24 hours.\n\nMajor cryptocurrencies, including Ethereum, have capitalized on the current bullish trend. This is evidenced by the emergence of a golden cross between Ethereum’s 50-week and 200-week moving averages.\n\nCould this be an optimal time to buy the asset, as the forms suggest that Ethereum may experience a significant surge in the coming months?\n\nEthereum Price Surges Along With the Market Rally\n\nAt press time, the $ETH token is trading at $1,729.42, with a rise of 0.38% in the last 24 hours.\n\nWith a trading volume of $5 billion in the last 24 hours, the Ethereum network’s coin is currently experiencing a bullish trend. The asset shows a slight 0.02% upward movement in the last hour, signaling an ongoing rally.\n\nHowever, a closer look at $ETH’s performance over a shorter period reveals some weaknesses as it strives to recover from recent declines.\n\nIn the past seven days, its price has experienced a decrease of 0.71%, and within the last month, it has witnessed a 4.90% decline.\n\nNevertheless, Ethereum’s year-to-date (YTD) performance remains positive, with a healthy increase of 44.65%.\n\nBased on the technical charts, the recent uptrend has not yet had a significant impact on the price of $ETH.\n\nThe current price of the digital asset falls slightly below its 50-day simple moving average (SMA) of $1,729.67 for the short term, while its 200-day simple moving average (SMA) of $1,731.14 for the long term.\n\nWhile there is a possibility of a continued decline in the value of $ETH, investors should anticipate price fluctuations between the 50-day and 200-day SMA.\n\nTechnical analysis shows that $ETH encountered resistance at the 50% Fibonacci retracement level of $1,729.24. However, if the bullish trend persists, there is potential for the asset to surpass this point and move toward new price levels.\n\nDespite this resistance, $ETH demonstrates strength in its oscillators. The relative strength index (RSI), currently at 27.26, indicates an oversold position, suggesting a potential recovery in the near future.\n\nUnsurprisingly, the moving average convergence divergence (MACD) displays a weak sell view.\n\n$ETH Chart Reveals Golden Cross Formation\n\nAnalysts have observed a recent bullish signal in the market, with Ethereum ($ETH) forming a weekly golden cross.\n\nThis signifies a positive trend where the short-term moving average surpasses the long-term average, a situation not witnessed since 2019.\n\nNotably, this golden cross follows a previous death cross, reversing a long-term sell signal into a buy signal.\n\nA golden cross occurs in a two-moving average system when a buy signal emerges due to the intersection of the shorter timeframe with the longer timeframe. On the contrary, when the opposite crossover occurs, it is referred to as a death cross.\n\nWith all the noise in the market right now, everyone has entirely missed the fact #Ethereum has formed a weekly golden cross pic.twitter.com/ylNwp3DEUI — Tony \"The Bull\" (@tonythebullBTC) June 12, 2023\n\nIn a chart shared by crypto analyst Tony “The Bull on Twitter, the golden cross formation clearly illustrates a significant development, with the short-term average of $ETH surpassing its long-term average after a prolonged period.\n\nThis occurrence indicates that the altcoin is in the early stages of a new bullish cycle. However, considering the ongoing regulatory turbulence affecting the market, it might take several months before this anticipated cycle becomes evident.\n\nAs a result, investors currently have an opportunity to purchase $ETH at a substantial discount before it enters another phase of consistent growth.\n\nGiven Ethereum’s strong fundamentals, significant surges in its price are expected soon.\n\nHistorical data shows that the appearance of the golden cross has led to Ethereum’s price soaring by an additional 680% before reaching its peak.\n\nFor instance, when $ETH last surpassed both moving averages in 2020, it experienced a rally of over 1,700%.\n\nExplore Utility-Driven $ECOTERRA Token as $ETH Alternative\n\nFollowing the legal conflicts between the SEC and popular cryptocurrencies, investor attention is shifting towards $ECOTERRA, the ecoterra platform’s utility token, as a viable substitute for $ETH.\n\nEcoterra is a green initiative that utilizes the recycle-to-earn (R2E) system, providing opportunities for individuals and businesses to earn rewards through recycling activities.\n\nThe platform encompasses various components, including a carbon offsetting marketplace, a marketplace for recycled materials, and a traceable impact profile.\n\nBy leveraging the Ethereum blockchain, ecoterra ensures the secure and transparent implementation of the Recycle 2 Earn concept on a large scale.\n\nWe have successfully reached the impressive milestone of $5.2 MILLION! 🎉🚀 Thank you to everyone who has supported us, and let's continue to make a positive impact together 💪💚https://t.co/1fYkPOsPYG#MilestoneAchieved #Presale #CryptoPresale #Presale #CryptocurrencyNews pic.twitter.com/84ThCoH8Sm — ecoterra (@ecoterraio) June 20, 2023\n\nIts $ECOTERRA token serves multiple purposes, such as distributing rewards, facilitating staking, and more.\n\nThe digital asset has reached a milestone in its presale of the native, surpassing over $5.23 million. The presale has now entered its eighth stage, and investors can purchase the $ECOTERRA token at $0.00925.\n\nBuy $ECOTERRA Now\n\nRelated News"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vYmxvY2t6ZWl0LmNvbS9ldGhzY3JpcHRpb25zLWJyaW5naW5nLWRpZ2l0YWwtaW5zY3JpcHRpb25zLXRvLXRoZS1ldGhlcmV1bS1ibG9ja2NoYWluL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Ethscriptions: Bringing Digital Inscriptions To Ethereum Blockchain - Blockzeit",
        "content": "A new protocol has emerged on the Ethereum blockchain, captivating the interest of enthusiasts and developers alike. Ethscriptions, introduced by Genius.com co-founder Tom Lehman, allow users to inscribe and share digital objects on the Ethereum main chain. With their potential to revolutionize the way non-financial data is recorded and accessed on the blockchain, these have already generated significant buzz within the Ethereum community.\n\nWhy Does The World Need Ethscriptions?\n\n\n\nFirst, let's discuss why the world needs Ethereum. Ethereum is a cloud computing platform like AWS; however, while AWS is controlled by Amazon, Ethereum is decentralized and controlled by no one.\n\n\n\nThe world needs Ethereum not because AWS is… — Middlemarch (@dumbnamenumbers) June 20, 2023\n\nThe Rise of Ethscriptions\n\nEthscriptions is a play on the term “Ethereum” and “Inscriptions”. The moniker takes inspiration from Ordinal inscriptions on the Bitcoin network.\n\nThe new protocol was launched to immense success with nearly 30,000 Ethscriptions created within a remarkably short span of 18 hours according to reports. This protocol empowers users to write arbitrary data onto the Ethereum blockchain, opening up new possibilities for creative expression and data storage.\n\nInitially limited to images, the protocol will soon expand its capabilities to include various file types.\n\nThe Power of Ethereum “Calldata”\n\nAt the heart of Ethscriptions lies the innovative use of Ethereum “calldata” – the data provided when interacting with a smart contract. By leveraging on it, Ethscriptions offer a cheaper and more decentralized alternative to conventional contract storage methods.\n\nThis approach ensures the uniqueness of all valid Ethscriptions, guaranteeing the integrity and immutability of the inscribed content. In a world increasingly focused on Layer 2 scaling solutions, these position themselves at the forefront of blockchain innovation.\n\nA Playground for Innovation\n\nOne aspect that sets Ethscriptions apart is the Ethereum community’s embrace of innovation and experimentation. This openness has paved the way for developers to explore the potential of blockchain technology.\n\nAdam McBride, a self-proclaimed NFT archaeologist, enthuses that the new protocol will drive innovation and adoption by pushing the boundaries of what blockchain can achieve much like Ordinals.\n\nThe Crypto Punks Frenzy\n\nTo gain prominence and ignite interest, Lehman called for the renowned NFT collection, Crypto Punks, to be ethscribed. This call sparked a frenzy, resulting in the inscription of copies of all 10,000 Crypto Punk images within a matter of hours.\n\nThe enthusiastic response showcased the immense potential and demand for Ethscriptions in the NFT space.\n\nIntroducing Ethscriptions: a new way of creating and sharing digital artifacts on Ethereum using transaction calldata.https://t.co/XfQ7RdtblD\n\n\n\nALSO: Introducing Ethereum Punks. Because why should all non-contract Punk collecting happen on Bitcoin?https://t.co/d3Ycwbdc2Z… — Middlemarch (@dumbnamenumbers) June 16, 2023\n\nChallenges and Existing Technology\n\nDespite its impressive debut, Ethscriptions faced intermittent periods of downtime due to the overwhelming surge of new users. Some critics argue that similar technologies have existed for years, with certain artists already utilizing them in their work. However, it is through the recent widespread awareness and adoption that their true potential is being recognized.\n\nThe Future of Ethscriptions\n\nThe fate of Ethscriptions as either a fleeting trend or a transformative force within the Ethereum community lies in the hands of its users and stakeholders. As developers continue to experiment and push the boundaries of blockchain technology, the impact of these on digital objects and data inscription is poised to evolve and expand.\n\nFinal Thoughts\n\nEthscriptions have emerged as a revolutionary protocol, enabling the creation and sharing of digital objects on the Ethereum blockchain. With its utilization of Ethereum calldata and its open embrace of innovation, these are poised to shape the future of non-financial data inscription and drive further adoption within the Ethereum community. Their true potential and impact, however, will undoubtedly be determined by the collective efforts of developers and users alike going forward."
    }
]