[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjYyNjI2L25lYXItZm91bmRhdGlvbi1wYXJ0bmVycy13aXRoLWVpZ2VuLWxhYnMtZm9yLW1vcmUtZWZmaWNpZW50LWV0aGVyZXVtLXJvbGx1cC10cmFuc2FjdGlvbnPSAYABaHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjYyNjI2L25lYXItZm91bmRhdGlvbi1wYXJ0bmVycy13aXRoLWVpZ2VuLWxhYnMtZm9yLW1vcmUtZWZmaWNpZW50LWV0aGVyZXVtLXJvbGx1cC10cmFuc2FjdGlvbnM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Near Foundation partners with Eigen Labs for more efficient Ethereum rollup transactions - The Block",
        "content": "Near Foundation, the organization building out the Near protocol, has partnered with Eigen Labs, the startup developing the restaking protocol Eigen Layer.\n\nThe collaboration aims to create cheaper transactions for Ethereum ETH +2.77% rollups, according to a statement. Transactions will occur within three to four seconds while using low-latency cross rollup communication. Additionally, liquidity fragmentation will be reduced between Layer 2s.\n\n\"For Eigen Layer, this collaboration will provide fast settlement for cross-rollup transactions and showcases adoption of restaking across the Ethereum ecosystem and beyond. For Near, the collaboration will also extend to transitioning the Near-Ethereum Rainbow Bridge to an actively validated service (AVS). This will create a better bridging experience between Near and Ethereum. Transactions will reach finality faster, with stronger security guarantees and decentralization,\" Near Foundation said.\n\nEigen Labs\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\n\"NEAR Foundation is proud to partner with such an excellent team as Eigen Labs to offer a fast finality layer for ETH rollups. The fast finality layer showcases the strengths of NEAR's technology while making the Open Web more usable, which has always been the core goal for NEAR,\" Near protocol co-founder Illia Polosukhin said. \"It will also help defragment liquidity for Ethereum rollups and make all of web3 more interoperable as a result.\"\n\nEigen Layer allows users to restake ETH and tinker with the consensus layer without requiring a new blockchain, The Block previously reported. Eigen Labs raised $50 million in Series A funding after announcing intentions to do so a month earlier."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzExLzEwL3doeS1iaXRjb2luLWV0aGVybS1hbmQtZG9nZWNvaW4td2VyZS11cC10b2RheS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Why Bitcoin, Ethereum, and Dogecoin Were Up Today - The Motley Fool",
        "content": "The crypto industry is once again moving higher, and three of the biggest cryptocurrencies are leading the way. As of 2 p.m. ET Friday, Bitcoin (BTC 5.28%) was up by 3% from where it traded when the stock market closed Thursday, Ethereum (ETH 2.29%) was up 4%, and Dogecoin (DOGE 0.84%) was up 5.3%.\n\nCryptocurrencies have been volatile over the past year, but have been charging higher since mid-October.\n\nBehind the rise in cryptocurrencies\n\nThe biggest news out relating to crypto Friday is that BlackRock (BLK -0.68%) is pursuing an Ethereum exchange-traded fund (ETF), just as it has been trying to get permission to launch a Bitcoin ETF. There are already ways for investors to buy crypto on traditional exchanges, but they're not as efficient as ETFs, which is why BlackRock and others are trying to get ETFs approved.\n\nIn theory, more options for investing in crypto will lead to more money pouring into tokens, which will drive prices higher. That's why traders are getting out in front of any ETF approvals, and they could bid values higher.\n\nRight now, the barrier preventing such ETFs from reaching the market is the Securities and Exchange Commission (SEC), which has neither approved crypto ETFs nor laid out rules around cryptocurrencies in general. That has left the industry in limbo, and Congress has yet to agree on a regulatory framework for crypto either. Based on BlackRock's involvement, many investors speculate that ETFs could be the one way to make crypto more mainstream as the SEC and Congress wait to act.\n\nThe interesting thing is, it's not just Bitcoin and Ethereum that are moving higher on the speculation about Bitcoin and Ethereum ETFs -- all of the major cryptocurrencies are moving higher as investors expect there will eventually be a flood of crypto ETF products.\n\nGrowth on the blockchain\n\nDespite the drop in crypto prices over the last couple of years, the industry continues to develop, and businesses and developers are creating more meaningful projects on blockchains. Visa is testing using blockchains to complete payments, and so are Shopify and MercadoLibre. There are dozens, if not hundreds, of other projects underway at companies around the world.\n\nThis is the kind of activity that's going to drive value to cryptocurrencies and the blockchain, but investors are currently just speculating about possible future value creation. I tend to think there will be value, but the moves recently aren't necessarily indicative of long-term value.\n\nWhat I would watch for is where developers are building on the blockchain. It's not Bitcoin or Dogecoin that are getting activity -- it's blockchains like Ethereum and Solana that are built for utility and more activity that will ultimately benefit.\n\nI would also expect to see the jump in value subside even if ETFs are approved, based on the \"buy the rumor, sell the news\" pattern. That's why I'm not jumping in on the crypto bounce right now. But I will hold on for the ride as this industry matures."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvZXRoZXJldW0tcHJpY2Utb24tYmxhY2stZnJpZGF5LTIwMjLSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Price on Black Friday 2023 - Watcher Guru",
        "content": "The Ethereum network has made the switch from proof-of-work mining to proof-of-stake mining. The transition was completed successfully on September 15, 2022. Additionally, the blockchain went through some major changes as validators replaced miners.\n\nRecently, the much-awaited Shapella upgrade went live, allowing these speakers to withdraw their staked Ethereum 2.0. Additionally, with numerous developments on the Ethereum blockchain, let us learn about ETH a bit more.\n\nEthereum in a nutshell\n\nVitalik Buterin built the decentralized blockchain platform Ethereum in 2015, along with the Ethereum Foundation, to support the development and execution of smart contracts and decentralized applications (dApps). Additionally, it has developed to become one of the biggest and most popular cryptocurrencies in the world. Ethereum is distinguished from Bitcoin by its programmability.\n\nAlso read: Ben Armstrong Sues Ex-Colleagues Over Alleged Stolen Lamborghini\n\nThe blockchain has grown to accommodate a wide range of applications. Developers on the ETH network can design decentralized applications by using smart contracts, which are self-executing contracts with predefined rules. Additionally, over time, ETH has grown to be the second-largest cryptocurrency in the world.\n\nEthereum Price on Black Friday 2022\n\nAccording to historical data, Ethereum was trading lower than its current market price of $2000 on Black Friday 2022. On November 25, 2022, the price of ETH touched $1203. Additionally, the price surged following Black Friday on the next day to $1227.\n\nCryptocurrency experts at Changelly have predicted the price of Ethereum for Black Friday 2023. Analysts expect ETH to reach a minimum of $1,887 and a maximum of $2,089. Experts also predict Ethereum’s average cost to sit around $2,089.\n\nAlso read: Nearly Half of CFTC Cases in 2023 Targeted Crypto\n\nExamining the historical pricing of an asset can provide crucial context for understanding both current valuation and future performance potential. By analyzing past price actions and trends, investors can identify key support and resistance levels that may continue to be relevant.\n\nHistorical prices also allow investors to compute useful metrics like trading volume and volatility over different periods of time. This can aid in assessing risk and forecasting potential future moves.\n\nWhether the Ethereum price can go up during Black Friday 2023 can vary greatly depending on market sentiment. However, if the market proves to be bullish moving forward, ETH’s price can shoot up."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy8xLWJsYWNrcm9jay1wbGFucy1ldGhlcmV1bS10cnVzdC0yMjExNTQ1MzAuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "BlackRock plans for ethereum trust fuel speculation about ETF filing - Yahoo Finance",
        "content": "(Adds Nasdaq proposal to list and trade shares in paragraph 2, updates prices in paragraph 3)\n\nBy Suzanne McGee\n\nNov 9 (Reuters) - Asset management giant BlackRock registered to create an ethereum trust, a potential first step toward asking regulators to approve an exchange-traded fund tied to ether, the second-largest digital token.\n\nBlackRock registered the iShares Ethereum Trust as a Delaware statutory trust on Thursday. Nasdaq also filed a proposal on Thursday to list and trade shares of the trust.\n\nThe price of ethereum was last up 9.18% at around $2,062.8, its highest level since April. Bitcoin, the largest cryptocurrency, was up 2.56% at $36,553, hovering around an 18-month high.\n\nEarlier this year, BlackRock registered a bitcoin trust in the same manner and a week later filed an application with the SEC to launch a spot bitcoin ETF. BlackRock declined to comment on the trust's creation or on any plans for an ETF filing.\n\nTo date, roughly a dozen ETF providers have filed to create spot bitcoin ETFs, or convert existing products into spot ETFs, helping fuel the recent rally in the cryptocurrency.\n\nThe U.S. Securities and Exchange Commission has so far not approved any other than ETFs tied to futures contracts, with SEC Chair Gary Gensler arguing that the spot bitcoin market is prone to fraud and manipulation.\n\nSeveral other ETF providers that have applied for spot bitcoin ETFs also have sought SEC approval for spot ether ETFs, including Ark Investment Management, Invesco and VanEck. (Reporting by Suzanne McGee; additional reporting by Hannah Lang in Washington; Editing by Ira Iosebashvili, David Evans and Daniel Wallis)"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMTEvMTAvZXRoZXJldW0tYmxhY2tyb2NrLWxhdW5jaGVzLWV0Zi_SAUpodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzExLzEwL2V0aGVyZXVtLWJsYWNrcm9jay1sYXVuY2hlcy1ldGYvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Ethereum gets a BlackRock boost, but the real test lies ahead - Fortune",
        "content": "Happy Friday. The week is ending on a high note for Ethereum, which is back in the news after financial giant BlackRock filed to launch an ETF backed by Ether, the blockchain’s native currency. This led the price to jump 10%, back over the $2,000 mark, for the first time in months as investors bet that BlackRock’s entry will attract billions of dollars in new capital.\n\nThis development brings renewed attention to the world’s second-largest cryptocurrency, which has largely been overshadowed by Bitcoin and even Solana during the long-awaited rally of the last two months. But while Ethereum boosters are rightfully enjoying the price surge, the return of the spotlight has also raised some familiar concerns.\n\nThese include griping about Ethereum’s transactions costs, known as gas fees, which have soared along with the burst of activity on the blockchain that has come with more trading. For long-time crypto watchers, this will bring back unpleasant memories of 2017 and 2021 when hype over Ethereum’s smart contract promise led to a surge in price—followed by the blockchain slowing to a crawl, which in turn forced those who wanted to transact to pay outrageous fees.\n\nEthereum’s momentous shift last year to a proof-of-stake system was supposed to alleviate the price and congestion issues, along with so-called layer-2 solutions—sub-layers on the network that process transactions in batches and then record them on the main blockchain.\n\nThe trouble is that while the layer-2 systems do indeed lower costs dramatically, they add complexity and make the Ethereum user experience—already an ordeal for those who aren’t crypto diehards—even more of a headache. They are also less secure. This has led some to gripe that Ethereum should have devoted its energy to making its main network cheaper and efficient rather than outsourcing the task to other projects.\n\nFinally, the switch to proof of stake has also raised concerns over centralization as a relatively small amount of validators are now responsible for maintaining the network—a fact that Bitcoin purists, never gracious at the best of times, have lampooned mercilessly as part of the crypto world’s eternal infighting.\n\nNone of this means that Ethereum is facing major trouble—the network is the leading smart contract for a reason, with by far the most users and a robust and dedicated developer community. But as a new crypto bull market emerges, it will be harder for the platform to blame familiar headaches on growing pains. Ethereum is now almost a decade old, and the time has come for it to show it can deliver on its enormous potential.\n\nJeff John Roberts\n\njeff.roberts@fortune.com\n\n@jeffjohnroberts\n\nDECENTRALIZED NEWS\n\nChainlink's LINK token is up 175% since January as the oracle provider has branched out from pure crypto pricing to tie-ups with the TradFi sector. (Fortune)\n\nThe notorious \"Cryptoqueen\" who oversaw legal and compliance for Ponzi-like OneCoin pled guilty in the $4 billion fraud. (WSJ)\n\nEconomist Nouriel Roubini, a.k.a Dr. Doom, has long been a fierce critic of Bitcoin and crypto, but in a surprise move is launching his own stablecoin. (The Defiant)\n\nIn a first-of-its-kind crypto bankruptcy exit, a restructuring plan will give Celsius customers 37 cents on the dollar and shares in a new company dedicated to staking and mining. (WSJ)\n\nBitcoin brushed $38,000 on Thursday, the highest the token has traded in 18 months. (Fortune)\n\nMEME O’ THE MOMENT\n\nTFW you learn one-third of Ethereum nodes are 20 miles from CIA headquarters:"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmNjbi5jb20vYW5hbHlzaXMvYmxhY2tyb2NrLWV0aGVyZXVtLWV0Zi1wdXNoZXMtZXRoL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "BlackRock Ethereum ETF Pushes ETH toward Yearly High -- Where Can it End 2023? - CCN.com",
        "content": "Key Takeaways\n\nBlackRock’s ETF move boosts Ethereum beyond $2,000.\n\nEthereum-spot ETF applications signal rising institutional interest.\n\nETH price nears completion of ascending structure.\n\nIn a landmark development shaking the cryptocurrency landscape, BlackRock, the globe’s largest asset manager, has officially registered its iShares Ethereum Trust as an exchange-traded fund (ETF), as revealed in a recent Nasdaq 19b-4 filing .\n\nUPDATE: BlackRock #Ethereum ETF confirmed. They just submitted a 19b-4 filing with Nasdaq pic.twitter.com/pLhuhhK7jo — James Seyffart (@JSeyff) November 9, 2023\n\nThis pivotal move signals a possible imminent introduction of Ethereum-spot ETFs and has sparked a notable rally in the crypto market. Ethereum (ETH) has notably surged after the news, topping the $2,000 mark, hitting a significant milestone in its market journey.\n\nThis development reflects a deepening institutional interest in cryptocurrencies, especially Ethereum, hinting at the possibility of even higher valuations. With the United States Securities and Exchanges Commission (SEC) closely monitoring these events, the approval of Ethereum-spot ETFs could play a crucial role in shaping Ethereum’s market performance in the coming months.\n\nMeanwhile, Ethereum’s price has rebounded, revisiting its highest point of the year, last observed in mid-April. Could this development spark a new annual high by year-end?\n\nETH Price Analysis\n\nEthereum’s price has been underperforming compared to the rest of the market in the year’s second half. Unlike Bitcoin and many other altcoins, that have achieved new yearly highs since mid-April, ETH has revisited $2,100 only today.\n\nThere was a possibility that the recovery since June last year was corrective, but the uptrend from October 12 invalidated that idea. This move can now be considered the starting impulse in a larger bull cycle, possibly forming a slightly ascending triangle, which could be seen as a leading diagonal.\n\nIf this holds true, the recent uptrend from October 12 may be its final wave. There is room for further interaction with the slightly ascending resistance level around $2250. But the five-wave pattern suggests it may have already completed or is close to doing so.\n\nEarly signs of selling pressure are apparent with a red candle on the daily chart. The RSI is at 80%, indicating overbought conditions, making a downturn more likely than a significant uptrend continuation.\n\nThe leading diagonal that began last June may conclude soon, likely leading to the first bull market correction and establishing the first macro higher low, preferably above the $1350 range.\n\nThe target will depend on the endpoint of the ascending pattern, so close monitoring of the price in the coming period is advisable.\n\nDisclaimer\n\nPlease note that the contents of this article are not financial or investing advice. The information provided in this article is the author’s opinion only and should not be considered as offering trading or investing recommendations. We do not make any warranties about the completeness, reliability and accuracy of this information. The cryptocurrency market suffers from high volatility and occasional arbitrary movements. Any investor, trader, or regular crypto users should research multiple viewpoints and be familiar with all local regulations before committing to an investment."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMS8xMS9hcnRodXItaGF5ZXMtc2F5cy1ldGhlcmV1bS1jb3VsZC1leHBsb2RlLWJ5LW92ZXItNDYwMC1kb3VibGVzLWRvd24tb24tMS1taWxsaW9uLWJpdGNvaW4tcHJlZGljdGlvbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Arthur Hayes Says Ethereum Could Explode by Over 4,600%, Doubles Down on $1 Million Bitcoin Prediction - The Daily Hodl",
        "content": "BitMEX co-founder Arthur Hayes is doubling down on his massively bullish Bitcoin (BTC) predictions while forecasting that Ethereum (ETH) could hit a six-figure price.\n\nHayes says that the time to turn bullish on crypto is “now” while unveiling a target of $100,000 for Ethereum – an increase of about 4,669% from the current level.\n\nThe BitMEX founder also reiterates his prediction that Bitcoin will hit $1 million.\n\nIn a new blog post, Hayes further says that as currencies debase across the globe, the “smartest trade” would be “going long crypto.” According to the BitMEX founder, Bitcoin and Ethereum are “crypto’s reserve assets” while “everything else is a sh*tcoin.”\n\nBesides Bitcoin and Ethereum, Hayes says there are other opportunities that exist in the crypto space offering the potential of higher returns at a greater risk.\n\n“Then, we get to other layer-one blockchains that claim to be an improvement on Ether. Solana is an example. These all got beaten up real bad during the bear market. As such, they will levitate off extreme lows and provide great returns for intrepid investors. But, they are still all overhyped, me-too, pieces of sh*t that won’t overtake Ethereum in terms of active developers, decentralized applications (DApps) activity, or Total Value Locked.\n\nFinally, all manner of DApps and their respective tokens will pump. This is the most fun, because down here is where you get the 10,000x returns. Of course, you’re also more likely to get rugged, but where there is no risk there is no return.”\n\nEthereum is trading at $2,097 at time of writing while Bitcoin is worth $37,083.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGYtcmFjZS1ncmF5c2NhbGUtdHJ1c3RzLWRpc2NvdW50LWRyb3BzLXRvLTE20gFLaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtLWV0Zi1yYWNlLWdyYXlzY2FsZS10cnVzdHMtZGlzY291bnQtZHJvcHMtdG8tMTY_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Ethereum ETF Race: Grayscale Trust's Discount Drops to 16% - U.Today",
        "content": "Advertisement\n\nGrayscale's Ethereum Trust (ETHE) has seen its discount narrow significantly, dropping to 16%. This marks a substantial change from its nearly 30% discount a month ago and close to 60% earlier this year.\n\nNate Geraci, an industry analyst, suggests that this trend could be interpreted as a gauge of market expectations regarding the approval of a spot ether ETF.\n\nCurrently, ETHE stands at an impressive $6 billion in assets under management (AUM).\n\nGrayscale's new conversion effort\n\nAs reported by U.Today, Grayscale, the leading crypto asset manager, has applied to the Securities and Exchange Commission (SEC) to convert its ETHE into a spot Ethereum ETF.\n\nETHE, launched in early 2019, has become the foremost Ether investment vehicle globally, accounting for 2.5% of the chief altcoin's total circulating supply.\n\nThis followed Grayscale's recent legal victory against the formidable regulator. A federal appeals court has ruled in their favor regarding their Bitcoin trust's ETF conversion application, thus adding momentum to their Ethereum efforts.\n\nConverting the trust into a spot ETF would be a significant development for the company and the crypto market. ETFs are well-known and widely used investment vehicles that are familiar to both retail and institutional investors. This familiarity could attract a broader investor base to Ether. This would enhance liquidity and potentially stabilize the market. Additionally, ETFs generally offer lower fees and greater transparency compared to trusts, making them more appealing to cost-conscious investors.\n\nBlackRock's Ethereum ETF plan\n\nIn parallel, BlackRock, the world's largest asset manager, has revealed its intention to bet big on Ethereum. Recently, the financial titan registered the iShares Ethereum Trust and partnered with Nasdaq, intending to list and trade shares of this trust.\n\nFollowing this announcement, Ethereum's price experienced a surge, reaching a high of nearly $2,150.\n\nBlackRock is also attempting to launch a spot Bitcoin ETF. Analysts believe that the SEC is very likely to greenlight such a product in the near future.\n\nLarry Fink, CEO of BlackRock, has notably shifted from skepticism to becoming a vocal crypto proponent."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiMGh0dHBzOi8vd3d3LnNlY3VyaXRpZXMuaW8vaW52ZXN0aW5nLWluLWV0aGVyZXVtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Investing In Ethereum (ETH) - Everything You Need to Know - Securities.io",
        "content": "Ethereum stands out as a transformative force in the blockchain world, extending beyond just cryptocurrency. It's a versatile, open-source platform that revolutionized the creation and functionality of decentralized applications (DApps) through smart contract scripting. Ethereum's framework has opened up new horizons for blockchain functionality, leading it to become a cornerstone in the crypto market.\n\nHow Does Ethereum (ETH) Work?\n\nWhile sharing some foundational principles with Bitcoin, Ethereum introduces unique features and a different approach, particularly in its consensus mechanism. Unlike Bitcoin's pure Proof of Work (PoW) system, Ethereum has transitioned towards a Proof of Stake (PoS) model with its Ethereum 2.0 update. This shift aimed to enhance network efficiency and scalability.\n\nFurthermore, Ethereum incorporates elements from peer-to-peer networks to foster a genuinely decentralized environment, ideal for developing decentralized applications (DApps).\n\nEthereum: Platform vs. Cryptocurrency\n\nA common misconception is to conflate Ethereum with a cryptocurrency. In reality, Ethereum is an extensive blockchain platform, and Ether (ETH) is its native cryptocurrency.\n\nEther plays a crucial role in the ecosystem, primarily used to remunerate validators for executing operations and securing the network, especially in the context of the Ethereum Virtual Machine (EVM) computations.\n\nEthereum Virtual Machine (EVM): The Core of Ethereum\n\nAt the core of Ethereum's functionality lies the Ethereum Virtual Machine (EVM). EVMs are embedded in every node of the Ethereum network and are instrumental in simplifying the development of decentralized applications. They serve as a robust and secure runtime environment for executing smart contracts.\n\nEvery node within the Ethereum network operates an instance of the EVM, enabling a decentralized consensus on the execution of code. This setup ensures that all nodes in the network can independently and reliably execute the same instructions, facilitating a trustless ecosystem where code can be run without centralized control.\n\nThe EVM is a Turing-complete system, meaning it has the capability to execute a wide array of computational operations, similar to languages like JavaScript. This Turing completeness allows for the creation and execution of complex smart contracts and decentralized applications.\n\nSupport for Multiple Programming Languages\n\nOne of the standout features of the EVM is its compatibility with various programming languages. Developers can write smart contracts and DApps using popular languages such as C++, Java, JavaScript, Python, and Ruby. Ethereum also introduced its unique programming language, Solidity, specifically designed to create smart contracts. Solidity is object-oriented and high-level, tailored to the Ethereum blockchain's nuances. Regardless of the language used, the code is ultimately compiled into EVM bytecode, making it executable on the Ethereum network.\n\nEthereum's innovative approach, especially with its evolving consensus mechanism and the versatility of the EVM, distinguishes it from other blockchain platforms. It's not just a cryptocurrency but a comprehensive platform enabling a decentralized digital economy and diverse applications.\n\nConsensus Mechanism\n\nFor years, Ethereum had planned a transition from a Proof of Work (PoW) to a Proof of Stake (PoS) consensus mechanism – an update known as Ethereum 2.0. This shift brought considerable improvements in terms of energy efficiency, as PoS systems require substantially less electricity than their PoW counterparts. The transition also aimed to address scalability and energy consumption concerns associated with the traditional mining model.\n\nStaking in PoS: In PoS, network participants “stake” their ETH tokens in a network wallet, contributing to the network's security and transaction validation process. The likelihood of a participant being chosen to validate a block correlates with the amount of Ethereum they have staked. This method not only reduces the need for extensive computational power but also adds a layer of security; potential attackers would need to own and stake a significant amount of ETH, making any attack economically disadvantageous.\n\nSecurity and Sustainability: The PoS model is viewed by many experts as a natural evolution in the blockchain space, offering a more sustainable alternative to the traditional PoW approach. By requiring participants to have skin in the game, PoS also encourages more responsible participation in the network's maintenance.\n\nWhat is GAS?\n\nGas in the Ethereum network is a fundamental concept representing a unit for measuring the computational effort required to execute operations, such as transactions and smart contract executions. It functions as an internal pricing mechanism, crucial for maintaining the network's integrity and efficiency.\n\nGas: The Fuel for Ethereum's Engine\n\nRole of Gas: Gas serves as a metering unit for computational work on the Ethereum blockchain. It's used to allocate resources of the Ethereum Virtual Machine (EVM) so that every operation, from simple transactions to complex smart contract executions, is adequately compensated. Quality Control: By quantifying operations in terms of gas, Ethereum ensures the quality of code executed on its network. This system discourages inefficient or malicious code, as such code would require a prohibitive amount of gas, making it uneconomical to execute.\n\nSetting Gas Prices and Limits\n\nGas Limit: This refers to the maximum amount of gas a user is willing to spend on a transaction or smart contract execution. It acts as a safeguard against running into unexpected execution costs. More complex operations require a higher gas limit due to the increased computational work. Gas Price: Users specify the gas price in gwei (1 billionth of an Ether). It's the amount a user is willing to pay per unit of gas for their transaction to be processed. Miners prioritize transactions with higher gas prices, as it's more lucrative for them. Transaction Cost Calculation: The cost of an Ethereum transaction is determined by multiplying the gas used by the gas price. Although gas quantities are calculated internally, the actual transaction fees are paid in Ether.\n\nEconomic Incentives and Network Efficiency\n\nThe gas system in Ethereum creates a market-driven, self-regulating ecosystem. Users are incentivized to offer competitive gas prices to have their transactions processed promptly, while validators are incentivized to process transactions with higher gas prices for greater rewards. This mechanism ensures that resources are allocated efficiently within the network.\n\nBalancing Network Load\n\nBy requiring gas for transactions and smart contract executions, Ethereum balances the network load. Transactions consuming excessive computational resources are naturally limited by higher gas costs, preventing network congestion and abuse. This balance is crucial for maintaining Ethereum's performance and scalability.\n\nOverall, Gas in Ethereum is a critical component that ensures the smooth operation of the Ethereum network. It provides a flexible and efficient way to measure and compensate for computational efforts, aligns the interests of users and validators, and maintains the quality and security of the network. As Ethereum continues to evolve, the role of gas will remain pivotal in its ecosystem.\n\nHistory of the Network\n\nEthereum began its journey in the early days of the crypto market. In 2013, programmer and Bitcoin enthusiast Vitalik Buterin introduced Ethereum through a whitepaper. This document detailed a novel concept: a decentralized, global computer operating on blockchain technology akin to Bitcoin. Buterin's idea was revolutionary at the time, proposing a platform that could run programmable smart contracts and applications beyond mere financial transactions.\n\nThe Inception and Evolution of Ethereum\n\nEarly Development: Buterin, with assistance from the Swiss development firm GmbH, completed Ethereum's initial version by 2014. This development phase culminated in a highly successful Initial Coin Offering (ICO), raising $18 million and establishing a robust network of Ethereum miners and investors.\n\nButerin, with assistance from the Swiss development firm GmbH, completed Ethereum's initial version by 2014. This development phase culminated in a highly successful Initial Coin Offering (ICO), raising $18 million and establishing a robust network of Ethereum miners and investors. Initial Launch – Frontier: 2015 marked the release of Ethereum's first beta version, known as “Frontier.” This release significantly influenced Ethereum's market value and laid the foundation for future upgrades.\n\n2015 marked the release of Ethereum's first beta version, known as “Frontier.” This release significantly influenced Ethereum's market value and laid the foundation for future upgrades. Homestead – The First Major Upgrade: In 2016, Ethereum underwent its first major upgrade, dubbed “Homestead.” This period also saw the emergence of Decentralized Autonomous Organizations (DAOs), innovative entities leveraging Ethereum's technology to automate decision-making and operations entirely via smart contracts.\n\nThe DAO: Ambition and Challenge\n\nLaunch and Record-Breaking Crowdfunding: Ethereum's first DAO was launched on April 30, 2016, quickly becoming a landmark in blockchain crowdfunding by raising over $150 million, a record at the time, with participation from over 11,000 investors globally.\n\nEthereum's first DAO was launched on April 30, 2016, quickly becoming a landmark in blockchain crowdfunding by raising over $150 million, a record at the time, with participation from over 11,000 investors globally. The DAO Hack: The initial success was short-lived as a critical vulnerability was exploited by hackers in June 2016, leading to the theft of 3.6 million ETH. This event caused a significant drop in Ethereum's value and exposed the risks associated with smart contract-based systems.\n\nEthereum's Fork: A Controversial Decision\n\nDealing with the Hack: Ethereum's community and developers debated solutions to reclaim the stolen funds in response to the DAO hack. A key proposal was to implement a ‘soft fork' that would blacklist the hacker's address. However, this idea was soon overshadowed by a more radical approach – a ‘hard fork'.\n\nEthereum's community and developers debated solutions to reclaim the stolen funds in response to the DAO hack. A key proposal was to implement a ‘soft fork' that would blacklist the hacker's address. However, this idea was soon overshadowed by a more radical approach – a ‘hard fork'. Soft Fork vs. Hard Fork: In the crypto world, a soft fork is a backward-compatible upgrade, whereas a hard fork is a non-compatible upgrade that can result in a split blockchain. Ethereum's team proposed a hard fork to revert transactions to a state before the hack, an unprecedented move in blockchain history.\n\nIn the crypto world, a soft fork is a backward-compatible upgrade, whereas a hard fork is a non-compatible upgrade that can result in a split blockchain. Ethereum's team proposed a hard fork to revert transactions to a state before the hack, an unprecedented move in blockchain history. Community Split and Ethereum Classic: The hard fork proposal was contentious, challenging the blockchain principle of immutability. Despite opposition, the hard fork was executed on July 20, 2016, effectively splitting Ethereum into two blockchains: the original (now Ethereum Classic) and the new version (Ethereum).\n\nThe Aftermath and Ethereum's Resilience\n\nMarket Recovery: Despite the controversy and challenges post-fork, Ethereum managed to recover and strengthen its market position. By 2017, the value of Ether surged, reaching an all-time high in January 2018.\n\nDespite the controversy and challenges post-fork, Ethereum managed to recover and strengthen its market position. By 2017, the value of Ether surged, reaching an all-time high in January 2018. ERC Protocols and Token Standards: Ethereum's introduction of ERC protocols, particularly ERC-20, was a game-changer, simplifying the process of creating new tokens and smart contracts on its platform. This development led to a surge in Initial Coin Offerings (ICOs) in 2017, substantially contributing to the cryptocurrency sector's growth.\n\nToday's Ethereum Landscape\n\nAs it stands, Ethereum is a dominant force in the crypto market, known for its innovative approach to decentralized applications and smart contracts. The platform's adaptability, demonstrated through its evolving technology and response to challenges like the DAO hack, continues to keep it at the forefront of the blockchain space. Ethereum's influence is evident in the widespread use of its ERC token standards, underpinning a vast array of digital assets and decentralized applications.\n\nHow to Buy Ethereum (ETH)\n\nCurrently, Ethereum (ETH) is available for purchase on the following exchanges:\n\nUphold – This is one of the top exchanges for United States & UK residents that offers a wide range of cryptocurrencies. Uphold also offers Ethereum staking. Germany & Netherlands are prohibited.\n\nPaybis – This truly global company offers services to residents from 180+ countries, including Canada, Europe, UK, & USA.\n\nKraken – Founded in 2011, Kraken is one of the most trusted names in the industry, with over 9,000,000 users and over $207 billion in quarterly trading volume. This exchange offers trading access to over 190 countries, including Australia, Canada, and Europe, and is our most recommended exchange for USA residents. (Excluding New York & Washington state)\n\nHow to Store Ethereum (ETH)\n\nSecuring Ethereum investments, especially for long-term holding or substantial amounts, necessitates a robust storage solution.\n\nHardware wallets, known for their enhanced security, are a top choice for safeguarding Ethereum holdings. These devices store cryptocurrency offline in “cold storage,” effectively insulating them from online vulnerabilities and hacking threats. A look at some of the best solutions can be found HERE.\n\nFor those unsure of hardware wallets, Ethereum is also widely supported by non-custodial software wallets. A look at some of the best software wallet solutions can be found HERE.\n\nFor Ethereum users, choosing the right storage option is crucial, with hardware and non-custodial software wallets providing a secure solution for substantial investments and long-term holding.\n\nA Pillar in the Market\n\nEthereum's role in the cryptocurrency market is both prominent and foundational, making it hard to envision the sector without it. Known for being a secure and reliable platform for launching decentralized applications (DApps), Ethereum continually demonstrates its commitment to innovation, particularly with significant upgrades like the transition to Ethereum 2.0 and adopting a Proof of Stake (PoS) consensus mechanism.\n\nWhile Bitcoin is often recognized as the pioneer digital currency, Ethereum stands out for its multifaceted utility, not just as a medium of exchange but as a platform enabling a decentralized, programmable financial ecosystem. Its contributions, such as catalyzing the rise of Initial Coin Offerings (ICOs), the proliferation of ERC-20 tokens, and the explosive growth of Decentralized Finance (DeFi), have solidified its position as a pillar of the crypto economy.\n\nLooking forward, Ethereum's trajectory seems poised for continued influence and leadership, shaping the future of decentralized applications and smart contract technology in the ever-evolving landscape of blockchain technology."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY3J5cHRvLm5ld3MvZXRoZXJldW0tY28tZm91bmRlci12aXRhbGlrLWJ1dGVyaW4tbWFrZXMtNTdtLWluLW9uZS1kYXktb24tZXRmLW5ld3Mv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Ethereum co-founder Vitalik Buterin makes $57m in one day on ETF news - crypto.news",
        "content": "Ethereum co-founder Vitalik Buterin saw his cryptocurrency holdings surge in value by over $57 million in a single day, according to data gathered from blockchain analytics platform Arkham Intelligence.\n\nThe platform reported that the assets held in Buterin’s publicly known addresses grew from $468 million on November 9 to $525 million on November 10, an increase of over 12% in 24 hours.\n\nOf Buterin’s $525 million in holdings, $518 million is in Ethereum (ETH). This means the one-day growth is almost entirely attributed to the appreciation of ETH.\n\nThis Ethereum rally was presumably fueled by major ETF news from asset management giant BlackRock. On Nov. 9, filings revealed BlackRock is laying the groundwork for a potential spot Ethereum ETF.\n\nYou might also like: BlackRock prepares to file spot Ether ETF\n\nThe filings, posted on the Delaware Department of State’s website, indicate BlackRock is considering proposing an Ethereum ETF to the U.S. Securities and Exchange Commission (SEC). This would allow investors to trade an ETF that directly holds Ether.\n\nBlackRock, which oversees $9 trillion in assets, already filed for a spot Bitcoin ETF in June. The timing of this latest Ethereum filing coincides with Ether reaching around $2,030, up over 8% in 24 hours.\n\nOther major financial firms like Ark Invest, 21Shares, VanEck and Grayscale have been seeking approval for similar Ethereum ETF products. But BlackRock’s massive size means an ETF from the asset manager could bring significant new institutional investment.\n\nFollow Us on Google News"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tZGFpbHktcmV2ZW51ZS1zb2Fycy10by00LW1vbnRoLWhpZ2gv0gFXaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy9ldGhlcmV1bS9ldGhlcmV1bS1kYWlseS1yZXZlbnVlLXNvYXJzLXRvLTQtbW9udGgtaGlnaC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Daily Revenue Soars To A 4-Month High Of $10 Million - NewsBTC",
        "content": "When Ethereum (ETH) exploded past $2,000 on November 9, Erik Smith, the Chief Investment Officer of 401 Capital, observed that the platform’s average daily revenue surged to the highest level in four months.\n\nAccording to data, Ethereum generated $10 million in daily revenue, extending gains registered on the previous day and pushing the metric to the highest point since July.\n\nEthereum Prices Above $2,000, Revenue Rising In November\n\nFor now, ETH prices remain muted but are trading around November 9 highs and remain within a bullish formation backed by decent trading volumes. Prices are still trending above the $2,000 psychological support, a critical reaction level.\n\nA look at the Ethereum candlestick arrangement in the daily chart shows that while there is a notable spike in daily revenue, prices are still below July 2023 highs. Then, the coin soared to as high as $2,100 before pulling back as the momentum triggered by the broader crypto’s expectation of a Bitcoin Exchange-Traded Fund (ETF) approval faded. However, prices have since sharply recovered, adding roughly 40% from October lows and shaking off the weakness registered on August 17 when the coin plunged by 14%.\n\nToken Terminal data shows that Ethereum’s daily revenue has steadily risen in the first ten days of November. Looking at trends, the average daily income has doubled from $5 million in the first five days of the month. Usually, an uptick in daily average revenue in a network points to increasing on-chain activity either through smart contract deployment or simple transfers, which necessitates the payment of gas fees.\n\nImproving Scalability In The Long Term\n\nHow the widespread adoption of Ethereum layer-2 and sidechain scaling solutions will impact the network revenue is not immediately apparent. }\n\nWhat’s clear is that the more protocols leverage the protocol, deploying multiple solutions, the more revenue the network will generate for validators and stakers. Staking rewards are drawn partly from transaction fees paid as gas, new issuance, and burned miner extractable value (MEV).\n\nStill, the dollar value of ETH minted as revenue depends on spot rates. If the uptrend is sustained, this figure will continue expanding. Even so, there might be more demand for the network, which is still struggling to scale on-chain.\n\nEthereum 2.0 aims to resolve these challenges in the coming years by increasing the general throughput via solutions like Sharding. Sharding will split Ethereum into small but interconnected networks called shards. Each shard will independently process each set of transactions and maintain its state, allowing the mainnet to scale.\n\nFeature image from Canva, chart from TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL21hcmtldHMuYnVzaW5lc3NpbnNpZGVyLmNvbS9uZXdzL2N1cnJlbmNpZXMvZXRoZXJldW0tZmVlcy1icmllZmx5LWp1bXBlZC10by0xMDAtYWZ0ZXItYmxhY2tyb2Nrcy1ldGgtZXRmLWZpbGluZy0xMDMyODA1NzU50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Fees Briefly Jumped to $100 After BlackRock's ETH ETF Filing - Markets Insider",
        "content": "Heightened demand for block space on the Ethereum network has made transactional activity significantly more expensive for ether [ETH] users in the past 24 hours, data from Dune Analytics show.\n\nFees, as measured by median gas prices, spiked to as high as 270 gwei late on Thursday, temporarily touching a level last seen in June 2022. That pushed up costs of trading swaps to anywhere from $60 to $100 for a few hours. Gwei is a small unit of ether (ETH) equal to one-billionth of an ETH and is used to denominate gas prices. Gas refers to the fees Ethereum users pay to ensure their transactions are included in the earliest block by network validators.\n\nAs of writing, gas fees, used to pay for any activity on Ethereum, were 33 gwei, the highest since May. Ether transfers between wallets cost an average of $30 as of Asian morning hours on Friday.\n\nThe surge in fees came as investors discovered financial behemoth BlackRock had filed for an exchange-traded fund (ETF) that holds ether (ETH), months after its bitcoin ETF filing. This likely buoyed investor sentiment – as prices jumped as much as 10% to cross the $2,000 mark.\n\nEthereum validators are incentivized to include transactions that pay the highest fees instead of a first-come-first-serve basis – meaning fees on popular tokens can often run to thousands of dollars.\n\nNansen data suggests that on-chain activity has remained tepid relative to a more bullish period in 2022 – indicating retail audiences have been largely absent from on-chain trading.\n\n“There is no inclination of on-chain activity increasing alongside it in terms of DAUs and newly funded addresses entering the Ethereum ecosystem,” Nansen analyst Jake Kennis shared in a Thursday message.\n\n“This suggests that on-chain activity may be lagging price action here or that we are not seeing the on-chain follow-through that is normally seen with this type of increased market activity as of yet,\" Kennis added.\n\n\n\n\n\nThis story originally appeared on Coindesk"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ibGFja3JvY2stZmlsZXMtc3BvdC1ldGhlcmV1bS1ldGYtMjMyNTEzMTcxLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "BlackRock Files for Spot Ethereum ETF - Yahoo Finance",
        "content": "The price of ethereum jumped about 10% on Thursday on news that BlackRock, the world’s largest asset manager, filed to launch an ETF that tracks the spot price of the cryptocurrency.\n\nEthereum rose above $2,000 and reached its highest price since April. The token was trading at $2,095 on Friday afternoon.\n\nNasdaq filed a 19b-4 form with the SEC on Nov. 9 to launch the ETF. The fund would be called the iShares Ethereum Trust if approved. BlackRock registered the ETF's ethereum trust in Delaware earlier Thursday.\n\nWhile investors have been anticipating a potentially imminent spot bitcoin ETF approval, many see a spot ether fund as the next step after the SEC greenlights bitcoin, if it does.\n\nThe Securities and Exchange Commission allows exchange-traded funds that track bitcoin and ether futures contracts, but has rejected applications for spot bitcoin ETFs on the grounds that the vehicles would be susceptible to market manipulation and fraud.\n\n“Given the SEC had approved both bitcoin- and ethereum futures-based ETFs, it makes sense that following any approval of a spot bitcoin ETF by the SEC, approval of a spot ethereum ETF would follow closely,” said Bradley Duke, chief strategy officer at ETC Group.\n\nWhen BlackRock first filed for a spot bitcoin ETF in June, the price of bitcoin rose. Because BlackRock is a long-established Wall Street player, the firm’s interest in cryptocurrency ETFs is a pathway to the asset class reaching a market of traditional finance investors if approved.\n\nEthereum ETFs\n\nFor digital-asset investors, ethereum has a unique set of use cases independent from bitcoin.\n\n“You could point to applications built on ethereum that have hundreds of thousands of users on a daily basis; that just resonates with financial advisors at a level,” said Matt Hougan, chief investment officer of Bitwise.\n\nYet ether futures-based ETFs have garnered far less enthusiasm from investors than bitcoin funds have. The ProShares Ether Strategy ETF (EETH) has pulled in $7.7 million, according to etf.com data. The combined six ETFs that started trading on Oct. 2 garnered only $1.9 million on their first day of trading.\n\nStory continues\n\nA spot product, however, is what many investors have their eye one. As the SEC continues its talks with the firms that are filing for a spot bitcoin ETF, a consensus is building among people familiar with the matter that the SEC could give preliminary approval to multiple spot bitcoin ETFs by the end of this year.\n\nBitcoin was trading at $37,224 on Friday afternoon, up 2.3% in the past 24 hours.\n\nContact Lucy Brewster at lucy.brewster@etf.com.\n\n\n\n\n\nPermalink | © Copyright 2023 etf.com. All rights reserved"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vdS50b2RheS92aXRhbGlrLWJ1dGVyaW4tc2VuZHMtZXRoZXJldW0tb24tY29pbmJhc2UtYXMtZXRoLWhpdHMtMjAwMNIBT2h0dHBzOi8vdS50b2RheS92aXRhbGlrLWJ1dGVyaW4tc2VuZHMtZXRoZXJldW0tb24tY29pbmJhc2UtYXMtZXRoLWhpdHMtMjAwMD9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Vitalik Buterin Sends Ethereum on Coinbase as ETH Hits $2,000 - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum has witnessed a notable price movement, breaching the $2,000 threshold. The significant market activity coincides with Ethereum cofounder Vitalik Buterin's recent transfer of 50 ETH, valued at approximately $106,000, to Coinbase Custody. It is important to note that such a transfer does not inherently indicate an intent to sell the assets; instead, it might reflect a strategic move for security or part of a broader financial strategy.\n\nAdvertisement\n\nCoinbase Custody is a service offered by Coinbase, which is specifically designed to provide secure storage for cryptocurrency assets. It is targeted at institutional clients and offers a range of features, including insurance coverage and third-party auditing. The service is built on the premise of providing a secure haven for large cryptocurrency holdings, away from the risks associated with exchange wallets.\n\nSource: TradingView\n\nThe transfer of funds by notable figures such as Buterin often garners attention, potentially influencing market sentiment. However, attributing Ethereum's price surge solely to these transfers would be an oversimplification. A myriad of factors contribute to the price dynamics of cryptocurrencies, including investor sentiment, market trends and significant developments within the ecosystem.\n\nOne such development is the news that BlackRock, the world's largest asset manager, is exploring the creation of an exchange-traded fund (ETF) that would include Ethereum's ether. This move underscores the growing interest and acceptance of cryptocurrencies among institutional investors. BlackRock's engagement with Ethereum could be seen as a vote of confidence, potentially attracting more institutional money into the cryptocurrency space and contributing to the bullish momentum of ETH.\n\nEthereum's growth also comes amid a broader trend of increasing institutional interest in cryptocurrencies. As traditional financial entities seek exposure to digital assets, the market is likely to continue to expand and evolve."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vY3J5cHRvLm5ld3MvZXRoZXJldW0taGl0cy01Mi13ZWVrLWhpZ2gtYW5hbHl6aW5nLXRoZS1zdXJnZS1iZXlvbmQtMjAwMC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Ethereum hits 52-week high: analyzing the surge beyond $2,000 - crypto.news",
        "content": "Ethereum’s latest surge to over $2,098 signals a bullish market trend. What’s driving the price, and how far will ETH go?\n\nEthereum (ETH), the second-largest digital asset by market capitalization, experienced a noteworthy surge on Nov. 9, reaching its 52-week high of $2,137.\n\nAs of this writing, Ethereum is well above the $2000 mark, trading at approximately $2,098, marking a nearly 10% increase within a 24-hour period​​.\n\nOverall, since the beginning of the year, Ethereum has seen an impressive uptick, increasing by more than 75% year to date (YTD)​​. However, despite these gains, Ethereum is still considerably below its all-time high of $4,891 in November 2021​​.\n\nLet’s delve deeper into Ethereum’s recent price action, explore the underlying factors driving this surge, and provide insights into where Ethereum could be headed in the coming days.\n\nWhy the ETH price is up\n\nThe recent surge in Ethereum’s price can be attributed to a combination of factors. One of the significant triggers for Ethereum’s price increase on Nov. 9 was BlackRock‘s registration of an iShares Ethereum Trust in Delaware.\n\n🚨BREAKING: The iShares Ethereum Trust has just been registered in Delaware.\n\n\n\nBlackRock did the same thing before filing for a $BTC spot ETF. $ETH spot ETF incoming?\n\n\n\nh/t: @SummersThings pic.twitter.com/e4kxAZrcOG — Miles Deutscher (@milesdeutscher) November 9, 2023\n\nIndustry observers believe that Blackrock is preparing to launch a spot Ethereum exchange-traded fund (ETF) following the potential approval of its spot Bitcoin ETF proposal.\n\nYou might also like: Understanding Bitcoin’s recent market dynamics and price predictions\n\nBlackrock applied for a spot Bitcoin ETF on June 15, 2023, and is now awaiting a verdict from the SEC.\n\nBloomberg Intelligence analysts have indicated that the U.S. Securities and Exchange Commission (SEC) might soon decide on the approval of 12 Bitcoin ETFs filed by major Wall Street firms, which has contributed to the bullish sentiment in the crypto market​​.\n\nNew Research note from me today. We still believe 90% chance by Jan 10 for spot #Bitcoin ETF approvals. But if it comes earlier we are entering a window where a wave of approval orders for all the current applicants *COULD* occur pic.twitter.com/u6dBva1ytD — James Seyffart (@JSeyff) November 8, 2023\n\nThis window for all 12 ends by 11/17. But theoretically SEC could make a decision on the first 9 on this list at any point from now until Jan 10, 2024.\n\n\n\nI've added a column for those that have provided amended S-1's/prospectuses (ive been repeatedly asked about this on here) pic.twitter.com/OlGajPkhZA — James Seyffart (@JSeyff) November 8, 2023\n\nETH on-chain metrics\n\nETH on-chain volume\n\nOn-chain volume refers to the total value of transactions conducted on the Ethereum blockchain. In September 2023, Ethereum’s on-chain volume was around 1.5 billion, which has increased to 2.62 billion as of Nov. 10.\n\nETH on chain volume | Source: The Block\n\nThis metric is crucial as it indicates the level of activity and usage of the Ethereum network. A higher on-chain volume often suggests increased adoption and utilization of the network for transactions.\n\nGenerally, a higher on-chain volume can signify heightened investor and user interest in Ethereum, which can positively influence its price. As more transactions occur, it implies a robust demand for ETH, potentially leading to a rise in its value.\n\nETH deposited to the Beacon Chain\n\nThis refers to the amount of ETH staked in the Ethereum 2.0 Beacon Chain and the number of validators participating in the network. The staked ETH in the Beacon Chain increased from 786,000 in August 2023 to 885,000 as of Nov. 10.\n\nDeposited ETH on the Beacon Chain | Source: The Block\n\nDepositing ETH into the Beacon Chain for staking is vital for the security and operation of the Ethereum 2.0 network. More staked ETH and validators mean a more secure and decentralized network.\n\nAn increase in staked ETH and validators can boost confidence in Ethereum’s long-term stability and demonstrate a commitment from stakeholders to the network’s success, which can be a bullish signal for investors.\n\nEthereum (ETH) price prediction\n\nWhile exploring Ethereum price predictions, it’s crucial to acknowledge the inherent uncertainties in such forecasts. These predictions are speculative and subject to market volatility.\n\nAn ETH price prediction for Nov. 25 projects a value of $2,199.93, showing a 5.17% increase. For December 2024, the ETH prediction is around $3,555.88.\n\nAn ambitious ETH price analysis suggests Ethereum might reach $4,487.64 in 2023 and potentially $6,809.84 by 2025.\n\nRemember, cryptocurrency investments are risky, and market predictions can be inaccurate. Never invest more than you can afford to lose, and consider seeking professional financial advice. Stay informed and cautious, especially in the volatile crypto market.\n\nDisclosure: This article does not represent investment advice. The content and materials featured on this page are for educational purposes only.\n\nFollow Us on Google News"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1taWNyby13YWxsZXRzLWhpdC0xMDBrLXNhbnRpbWVudNIBPWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1taWNyby13YWxsZXRzLWhpdC0xMDBrLXNhbnRpbWVudD9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Micro Wallets Hit 100K: Santiment - U.Today",
        "content": "Advertisement\n\nEthereum's micro addresses holding less than 0.1 ETH have surpassed the 100,000 wallet mark for the first time, according to data from Santiment.\n\nThis milestone highlights the growing adoption and diversification of Ethereum holdings, even as larger wallet categories, including those holding between 0.1-10 ETH and over 10,000 ETH, also see an uptick in numbers.\n\nOwnership distribution\n\nWhales, or large holders of Ethereum, currently account for a 32.94% concentration, holding about 40.83 million ETH, according to data provided by IntoTheBlock.\n\nSmaller investors boast combined holdings that account for 12.48% of the market, equivalent to 15.47 million ETH.\n\nThe recent trends in Ethereum's address holdings indicate a growing interest from small-scale investors (as evidenced by the increase in the smallest wallet categories).\n\nIn contrast, larger wallet categories are experiencing a decrease, suggesting a strategic redistribution or liquidity-seeking behavior\n\nThe BlackRock ETF hype\n\nAdding to the excitement in the Ethereum market is the news that asset management behemoth BlackRock plans to launch an Ethereum exchange-traded fund.\n\nThis move is widely speculated as a precursor to filing for an Ethereum-based exchange-traded fund (ETF). Following BlackRock's registration of the iShares Ethereum Trust, the price of Ethereum soared above the $2,000 level, marking its highest level since April.\n\nThis development echoes a similar pattern observed earlier in the year when BlackRock registered a Bitcoin trust, followed by a proposal for a spot Bitcoin ETF."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtZmVlcy1zdXJnZS10by1yaWRpY3Vsb3VzLWxldmVscy1hZ2FpbtIBRmh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtZmVlcy1zdXJnZS10by1yaWRpY3Vsb3VzLWxldmVscy1hZ2Fpbj9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) Fees Surge to Ridiculous Levels, Again - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nTransaction fees can serve as a vital indicator of network activity and congestion. Recently, Ethereum, the blockchain at the heart of the DeFi and NFT revolutions, has seen its fees surge to levels that many users find exorbitant. This uptick in gas fees has several implications for the network and its users.\n\nAdvertisement\n\nAs the network becomes congested with transactions, users must pay higher fees to have their transactions prioritized by miners. Currently, the Ethereum network is experiencing such high congestion that the average gas fee has reached 226 gwei, with high fees touching 227 gwei.\n\nThis surge in fees has a direct impact on the cost of network operations. Simple token swaps can cost upwards of $160, while more complex contract interactions, such as those involved in NFT sales, can exceed $270. These costs become prohibitive for smaller transactions, effectively pricing out a significant portion of the user base.\n\nFor developers and projects, these high fees can stifle innovation and slow down the development of new applications, as testing and deployment become more expensive.\n\nThe effects of high fees ripple out to the broader market, impacting the price of Ethereum itself. While high fees can indicate a healthy demand for block space, they can also lead to a decrease in network activity as users and developers seek more cost-effective alternatives. This can create a negative feedback loop, where reduced activity leads to lower network value and could potentially impact the price of ETH negatively.\n\nFurthermore, these fees can slow down the overall growth of the network. The high cost of transactions on Ethereum makes it less competitive compared to other blockchains that offer lower fees. Users and developers might migrate to these alternative platforms, which can offer similar functionalities at a fraction of the cost."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LmJpdGNvaW5zZW5zdXMuY29tL2V0aGVyZXVtLXZzLXNvbGFuYS1kZXRhaWxlZC1jb21wYXJpc29uLW9mLTItYmxvY2tjaGFpbnMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 13:06:19 GMT",
        "title": "Ethereum vs Solana: Detailed Comparison of 2 Blockchains - Bitcoinsensus",
        "content": "Unveiling the Technological Showdown, Ecosystem Battles, and Future Trajectories\n\nExplore the critical distinctions between Ethereum and Solana, delving into consensus mechanisms, costs, and security to understand their roles in the evolving cryptocurrency landscape.\n\nEvaluate the mature and expansive ecosystem of Ethereum against Solana’s rapid growth and innovation, analyzing the roles of native tokens (ETH and SOL) and smart contract capabilities.\n\nPeek into the future with Ethereum 2.0’s promises and Solana’s initiatives, deciphering which blockchain might hold the edge based on strengths, weaknesses, and evolving market dynamics.\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nThe cryptocurrency landscape has witnessed dynamic shifts, marked by the emergence of blockchain platforms competing for dominance. In this context, Ethereum and Solana have risen to prominence, sparking a notable competition in the decentralized space.\n\nThe cryptocurrency realm is characterized by constant evolution and technological advancements. Decentralized applications (DApps) and non-fungible tokens (NFTs) fueled a frenzy in 2021, shaping the competitive landscape among blockchain platforms.\n\nThe rivalry between Ethereum and Solana became pronounced as they aimed to address challenges and capitalize on emerging opportunities. Ethereum, a longstanding player, faced competition from Solana, which gained traction in 2021 by promising higher transaction speeds at lower costs.\n\nHistorical Background:\n\nEthereum: Launched in 2015, Ethereum was groundbreaking, introducing smart contracts and DApps to the world. It quickly became the primary platform for such applications and boasted a rich ecosystem.\n\nSolana: Founded in 2017, Solana gained momentum more recently, positioning itself as a fast and scalable alternative. Developed by former Qualcomm employees, Solana’s architecture was designed from the ground up for high performance.\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nTechnological Differences\n\nDistinct Technological Aspects: Ethereum and Solana, as prominent blockchain platforms, exhibit distinct technological features that underpin their functionalities and performance.\n\nEthereum’s Consensus Mechanism Transition: Ethereum’s initial reliance on Proof-of-Work (PoW) presented limitations in transaction processing speed and network congestion. However, Ethereum 2.0 seeks to address these challenges by transitioning to a Proof-of-Stake (PoS) mechanism. This shift aims to enhance scalability and alleviate congestion issues.\n\nSolana’s Unique Proof of History (PoH): Solana employs a unique consensus mechanism known as Proof of History (PoH). PoH involves a sequence of cryptographic steps that determine the time passage between events, enhancing the efficiency of transaction processing. Combined with Proof of Stake (PoS), Solana achieves an impressive transaction speed of 65,000 transactions per second, positioning itself as one of the fastest blockchains.\n\nEthereum’s Stateful Architecture: Ethereum’s architecture is characterized by its stateful nature. All transactions are recorded into one state, requiring the entire network or all miners to update their records when a new transaction occurs. While this design ensures decentralization, it comes with the drawback of increased processing costs and slower transaction speeds, especially during periods of network congestion.\n\nSolana’s Stateless Architecture: In contrast, Solana adopts a stateless architecture. Transactions can be carried out sequentially without the need to update the entire network for each transaction. This stateless approach reduces memory consumption and contributes to Solana’s scalability. The combination of Proof of History and a stateless architecture positions Solana as a high-throughput and efficient blockchain.\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nKey Differences and Features\n\nExamination of Consensus Mechanisms, Costs, Fees, and Security:\n\n1. Consensus Mechanisms:\n\nEthereum: Transitioning from Proof-of-Work (PoW) to Proof-of-Stake (PoS) with Ethereum 2.0. PoS aims to improve scalability, addressing limitations in transactions per second (TPS) and network congestion.\n\nSolana: Utilizes a unique combination of Proof of History (PoH) and PoS. This distinctive approach allows Solana to achieve an impressive 65,000 TPS, making it one of the fastest blockchains.\n\n2. Costs and Fees:\n\nEthereum: Criticized for high gas fees, especially during network congestion, which can render smaller transactions impractical.\n\nSolana: Offers minimal transaction costs, with fees often just a fraction of a cent. The low fee structure attracts projects and users frustrated by Ethereum’s higher costs.\n\n3. Security:\n\nEstablished and tested security through years of decentralized operation. Ethereum 2.0’s transition introduces new security considerations. While promising, Solana’s security model hasn’t undergone the same level of scrutiny as Ethereum. Its unique consensus mechanism aims to prevent forks and maintain consistent transaction history.\n\nDiscussion of Blockchain Features:\n\n1. Ethereum’s Solidity Language: Ethereum revolutionized the crypto world with its introduction of smart contracts. Solidity, Ethereum’s programming language, facilitates the creation of robust and diverse smart contracts. Its flexibility makes Ethereum a go-to platform for developers.\n\n2. Solana’s Tower BFT and Gulf Stream: Solana employs this Byzantine Fault Tolerance (BFT) mechanism, an enhanced version of pBFT, to improve overall efficiency. It eliminates the need for real-time communication between nodes. Solana’s mempool-less transaction forwarding standard, enabling validators to execute transactions ahead of schedule. This contributes to Solana’s remarkable transaction processing speed of over 50,000 TPS.\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nEcosystem, Token Utility, and Smart Contract Capabilities\n\nEvaluation of Ecosystems and Development Communities:\n\n1. Ethereum Ecosystem: Ethereum, with its head start, boasts a vast ecosystem hosting numerous DApps, DeFi projects, and NFT platforms. The extensive development community around Ethereum contributes to consistent innovations and a mature ecosystem.\n\n2. Solana Ecosystem: Although newer, Solana is rapidly building its ecosystem, attracting projects due to its scalability features. The Solana ecosystem, while smaller than Ethereum’s, is vibrant and growing rapidly, supported by initiatives like hackathons and bug bounty programs.\n\nExploration of Native Token Roles:\n\n1. Ethereum (ETH): ETH plays a critical role in the Ethereum ecosystem beyond being a cryptocurrency. It acts as “gas” for the network, compensating participants for computations and transaction validations.\n\n2. Solana (SOL): SOL powers Solana’s operations, acting as a reward for stakers and used to pay for transaction fees. It is intricately tied to Solana’s unique Proof of History consensus, ensuring network security.\n\nAnalysis of Smart Contract Capabilities:\n\n1. Ethereum’s Flexibility: Ethereum introduced smart contracts, automated self-executing contracts, revolutionizing the crypto world. Ethereum’s Solidity language allows for robust and diverse contract creation, making it a preferred platform for developers seeking flexibility.\n\n2. Solana’s Performance Focus: Solana offers a high-performance environment for smart contracts, aiming to reduce overheads seen in Ethereum. While supporting multiple programming languages, Solana’s focus is on ensuring contracts execute with speed and efficiency, aligning with its performance-oriented approach.\n\nComparing the ecosystems, token utility, and smart contract capabilities of Ethereum and Solana reveals a choice between Ethereum’s mature and flexible environment and Solana’s rapidly growing ecosystem with a focus on performance. The decision depends on specific project needs and goals in the evolving landscape of blockchain technology.\n\nWhich is Better, Future Outlook\n\nComparative Assessment of Ethereum and Solana:\n\n1. Ethereum’s Strengths and Weaknesses: Ethereum boasts a proven track record, a vast ecosystem, and the promise of Ethereum 2.0. Its adaptability and maturity make it a trusted choice. Ethereum faces criticism for high gas fees, and its scalability solutions depend on layer-two implementations.\n\n2. Solana’s Strengths and Weaknesses: Solana shines with blazing speed, scalability, and cost-efficiency. It attracts projects desiring high-throughput capabilities. While promising, Solana’s security model hasn’t faced the same scrutiny as Ethereum. Its ecosystem, while growing, is still catching up to Ethereum’s.\n\nExploration of Future Outlook:\n\n1. Ethereum’s Future: The much-anticipated Ethereum 2.0, with its transition to a PoS mechanism, aims to address existing problems, potentially reinforcing Ethereum’s position in the market.\n\n2. Solana’s Future: Solana’s future looks promising with its impressive performance metrics and growing adoption. Initiatives like the Solana Program Library (SPL) aim to enhance its functionalities.\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nConclusion\n\nChoosing between Ethereum and Solana isn’t a one-size-fits-all decision. Ethereum, as a pioneer, offers a mature ecosystem with a vast array of tools, DApps, and a rich developer community. Its extensive track record and adaptability make it a trusted choice.\n\nOn the other hand, Solana stands out with its blazing speed, scalability, and cost-efficiency. For projects craving high-throughput capabilities, Solana might be the more appealing pick.\n\nUltimately, the “better” platform hinges on specific needs and goals. Whether prioritizing a robust ecosystem and flexibility with Ethereum or rapid, efficient transactions with Solana, both blockchains have substantial merit in the crypto landscape.\n\nIn the ever-evolving landscape of blockchain technology, Ethereum’s legacy and Solana’s innovation contribute significantly, shaping the future of decentralized applications and smart contracts. The choice between Ethereum and Solana should align with the unique requirements of developers, investors, and stakeholders in the dynamic world of cryptocurrencies.\n\nEnhance Your Crypto Trading Skills With Our Legends’ Trading Masterclass\n\nEmpower your crypto trading skills with our Legends Masterclass. Sign up now and take advantage of our limited-time discount offer! Join the class today."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2NvaW5iYXNlLXJvbGxzLW91dC1vbi1jaGFpbi1jcmVkZW50aWFsLXZlcmlmaWNhdGlvbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Coinbase rolls out on-chain credential verification using the Ethereum Attestation Service - CryptoSlate",
        "content": "Coinbase announced a feature on Nov. 9 that allows users to attest their account and country credentials on-chain and access additional benefits.\n\nCoinbase’s help pages indicate that issued verifications are meant to serve as a “trusted badge” that grants access to on-chain apps and benefits. Coinbase said that verification will initially provide users with a badge in Base’s Guild — the membership program for its second-layer network, Base — plus access to a private Discord channel.\n\nCoinbase added that verification will soon provide access to gasless (i.e., feeless) transactions, plus access to other participating apps on the Base network. Those upcoming apps include three DeFi platforms: Index Coop, Perennial, and Volmex.\n\nCommunity data from Dune Analytics suggests that Coinbase has issued over 9,700 attestations to more than 6,200 unique recipients since late October.\n\nCoinbase explains participation requirements\n\nThe remainder of the help page provides more details. It notes that verifications can be tied to any self-custodial Ethereum (EVM) wallet address but cannot be transferred to other addresses. A separate section notes that the verification can be associated with up to three addresses, including MetaMask and Coinbase Wallet addresses.\n\nCoinbase said that attesting one’s country of residence is optional but noted that gaining access to certain apps may be necessary. It also assured users that their information will not be published on-chain without their consent.\n\nTo verify an account on-chain, users must have a Coinbase account that is not subject to buying, selling, and trading restrictions, Coinbase said.\n\nCoinbase added that it ultimately aims to allow third parties to issue verifications using the service and expand the ways in which users can be verified.\n\nVerifications are issued through the Ethereum Attestation Service (EAS), an Ethereum community project also used by other projects, including Optimism."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vdS50b2RheS9iaXRjb2luLWV0aGVyZXVtLXRvLWV4cGxvZGUtYXJ0aHVyLWhheWVzLXRyb2xscy1jb21tdW5pdHktd2l0aC1ib2xkLWJ0Yy1ldGgtcHJpY2UtcHJlZGljdGlvbnPSAXFodHRwczovL3UudG9kYXkvYml0Y29pbi1ldGhlcmV1bS10by1leHBsb2RlLWFydGh1ci1oYXllcy10cm9sbHMtY29tbXVuaXR5LXdpdGgtYm9sZC1idGMtZXRoLXByaWNlLXByZWRpY3Rpb25zP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin, Ethereum to Explode: Arthur Hayes Trolls Community With Bold BTC, ETH Price Predictions - U.Today",
        "content": "Advertisement\n\nThe cocreator of the BitMex crypto exchange and CIO of the Maelstrom family office, Arthur Hayes, has told the community about his recent trip to Rapa Nui (better known as Easter Island).\n\n\"Bitcoin to $1 million, Ethereum – to $100,000\"\n\nThis seems like a partly joking X post since Hayes said that \"the ancestors in Rapa Nui\" tipped him off about when the bull market would finally arrive. Hayes is not known to have any roots there.\n\nThe time is now, they allegedly told him, as the bull market started. Who knows whether Hayes (former CEO of BitMex) indeed believes that Bitcoin and Ethereum can reach these price levels or was just trolling his followers, but he wrote that Bitcoin will reach $1 million and Ethereum will surge to hit $100,000.\n\nHayes frequently shares his expectations of Bitcoin soaring to $1 million in the future.\n\nThis summer I visited the ancestors in Rapa Nui and I asked them when the bull market would arrive?\n\n\n\nThey told me to be patient, read the words of the Lord, and I would know when to YOLO.\n\n\n\nThe time is now!$BTC = $1mm$ETH = $100k\n\n\n\nYachtzee bitches!!! pic.twitter.com/ufV9nthSDg — Arthur Hayes (@CryptoHayes) November 10, 2023\n\nEarlier today, Hayes shared an ETH/USD chart from BitMex as the second largest cryptocurrency Ethereum briefly soared above the 2,100 level, thus attracting attention to ETH's rise.\n\nBitcoin surpassing $37,000 briefly, almost hits $38,000\n\nOn Thursday, Nov. 9, the world's leading digital currency Bitcoin briefly surged above the $37,000 level, almost hitting $38,000. That price jump took place for the first time over the past 18 months.\n\nThe staggering growth of 5.69% in less than a day (and the addition of $2,000 to the price) was attributed to Bloomberg analysts expecting the U.S. regulator, the SEC, to face a \"brief window\" for giving the green light to 12 Bitcoin spot ETFs, including those of BlackRock and Grayscale for 12 days, starting on Thursday.\n\nAnother analyst of Bloomberg, James Seyffart, shared that he expected the regulator to approve the first BTC ETF by early January and said that there was a 90% probability of that.\n\nEthereum followed Bitcoin's growth soaring to the $2,133 level. By now, both leading cryptos have lost momentum. Bitcoin is trading at $36,943, and Ethereum is exchanging hands at $2,071."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vbnltYWcuY29tL2ludGVsbGlnZW5jZXIvMjAyMy8xMS9iaXRjb2luLWV0aGVyZXVtLWJsYWNrcm9jay1nZW5zbGVyLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Here's Why Bitcoin and Ethereum Are Back From the Dead - New York Magazine",
        "content": "Is bitcoin back? Photo-Illustration: Intelligencer\n\nFor the entirety of crypto’s existence, a large part of digital currency’s appeal was how strange it all was. From its 2008 inception, bitcoin was this new kind of anti-government money, perfect for someone to buy drugs with online anonymously, even as it was susceptible to getting lost or thrown out on garbage day. There were the copycat fads — the “initial coin offering” bubble of 2017, the shitcoin mania of 2021 — as well as the truly weird and dumb stuff, like the NFTs of monkeys that were, briefly, fodder for the art world. Whatever your opinion of all these things, they made many people very, very rich — at least for a little while, on paper. This year, though, has been different. After last year’s market collapse and last week’s conviction of crypto-fraud kingpin Sam Bankman-Fried, what’s weird about it all isn’t some new trend or some new offense to good taste. On Thursday, crypto had one of its best days in 18 months, and it has everything to do with abandoning its rebel origins and getting approval from Wall Street giants and government regulators.\n\nA single bitcoin rose briefly to nearly $38,000 on Thursday, the highest that it’s been since the early days of the total market collapse triggered by the vaporization of two of the world’s largest cryptocurrencies, terraUSD and luna, in early 2022. Why did it rise from the dead all of a sudden? Crypto investors have a big new story to tell — and since the price of bitcoin isn’t tied to a physical asset, like oil, or the economic might of a country, like the U.S. dollar, it lives and dies by how persuasive its story is on any given day. This time, the narrative seems to be about crypto growing up and getting a haircut, a suit, and a real job — on Wall Street. Specifically, the Securities and Exchange Commission appeared to be getting closer to green-lighting an exchange-traded fund from investment behemoth BlackRock that would allow investors to buy bitcoin as easily as they buy the S&P 500. (An ETF trades just like a stock but can represent an index or commodity or a nearly endless variety of other financial bets.) And it wasn’t just bitcoin. Ethereum, the world’s second-most-popular crypto, was also reaching highs not seen since April, topping $2,000 per token, after BlackRock registered a corporate entity in Delaware for an ethereum ETF.\n\nBitcoin is at $37,000 and no one is talking about it. Nobody is saying anything!\n\n\n\nHas anyone checked the price?\n\n\n\nWhy is no one tweeting about crypto?\n\n\n\nHello?\n\n\n\nBitcoin is up a lot!\n\n\n\nDoesn’t anyone see it? — Zack Voell (@zackvoell) November 9, 2023\n\nFor Wall Street to finally start trading ETFs of bitcoin or ethereum would truly begin a new era in the world of cryptocurrencies. ETFs are part of the finance industry’s lifeblood, and an industry unto itself that, as of last year, was worth $6.5 trillion. At its core, a crypto ETF would make it easier for financial institutions (your pensions, mutual funds, hedge funds, and the like), and the average 401(k) holder, to easily trade and profit from the digital currencies without having to worry about encryption keys, or getting hacked, or anything like that. (At least, not directly. If BlackRock got its bitcoin hacked, though, that would be very bad.) Bitcoin ETFs have largely been a pipe dream for the last ten years, since the Winklevoss twins first tried to get government approval for one. (The SEC rejected it four years later.) What changed recently was a lawsuit from Grayscale, a company owned by Barry Silbert’s Digital Currency Group, a big (if currently troubled) player in the crypto space. In August, an appeals court ruled that the SEC had arbitrarily denied Grayscale’s application for its own ETF, which would have used many of the same market-surveillance and safety protocols that other funds used. Last month, the SEC said it wouldn’t appeal the decision, making the appearance of an ETF all but assured. “This was fully expected in my eyes and was just a matter of when, not if,” Bloomberg Intelligence analyst James Seyffart said. “But BlackRock’s name is obviously huge and just seeing this registration in Delaware sent ether prices skyrocketing.”\n\nAll this appears to fly in the face of what made crypto so … crypto-y. This was, after all, the money that was most closely associated with Occupy Wall Street and that Jamie Dimon has called a “fraud.” The spike in prices is of the kind that would typically come from secret, anonymous Telegram “pump” groups that would disappear just as soon as they made their profits. That its value is getting pumped because regulators are now okay with it and the likes of BlackRock, which manages over $10 trillion in assets, are getting in on it, is deeply weird and hilarious — not only because it’s the opposite of what it symbolized for so long, but because … what’s the difference? For most people who own a bitcoin, what matters is that the price is going to go higher (a.k.a. “number go up”), not any of the high-flying rhetoric about its ability make each holder a sovereign wealth fund unto themselves. Maybe this is why Gary Gensler, the SEC chair and chief antagonist of the crypto markets, came out recently and suggested that FTX could soon get relaunched as a crypto exchange, now that Bankman-Fried is no longer a threat. After his remarks, the price of FTX’s digital currency, long assumed to be dead by most investors, spiked by 90 percent — one of its best days ever."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbi1yZWNsYWltcy0kMzcwMDAtcHVsbHMtZXRoZXJldW0taGlnaGVyLWFzLWRvZ2Vjb2luLWNvbnNvbGlkYXRlczotYS1sb29rLWF0LWNyeXB0b9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Reclaims $37000, Pulls Ethereum Higher As Dogecoin Consolidates: A Look At Crypto Into The Weekend - Nasdaq",
        "content": "Bitcoin (CRYTO: BTC) was popping up almost 2% higher, reclaiming $37,000 during Friday’s 24-hour trading session. The crypto continued its climb north as hopes grow the U.S. Security and Exchange Commission will approve a spot Bitcoin ETF and more analysts become bullish on the likelihood the approval comes soon.\n\nEthereum (CRYPTO: ETH) heavily outpaced Bitcoin on Thursday, surging about 13% compared to Bitcoin’s 3.24% move north. On Friday, Bitcoin and Ethereum were trading in slightly opposite directions, with both cryptos consolidating.\n\nMust Read: Welcome To 'The Acceleration Phase': Analyst Predicts An 88% Increase For Bitcoin\n\nWhile Bitcoin and Ethereum spiked significantly higher recently, Dogecoin (CRYPTO: DOGE) continued to consolidate mostly sideways above the 200-day simple moving average (SMA), which was healthy. If Bitcoin and Ethereum continued to trek higher following a period of consolidation, Dogecoin was likely to break bullishly from its horizontal pattern.\n\nWant direct analysis? Find me in the BZ Pro lounge! Click here for a free trial.\n\nThe Bitcoin and Ethereum Charts: Bitcoin and Ethereum were trading slightly higher and lower, respectively on Friday, with each forming an inside bar pattern on declining volume. The formation leaned bullish in both Bitcoin’s and Ethereum’s case because the inside bars were forming at the top of the mother bars and both cryptos are in uptrends.\n\nThe sideways consolidation was helping Bitcoin and Ethereum’s eight-day exponential moving averages (EMAs) to catch up to the cryptos’ prices. If the two apex cryptos continue to trade sideways over the weekend, it would also help to lower their relative strength index (RSI), as both Bitcoin and Ethereum were in overbought territory.\n\nWhile a golden cross formed on Bitcoin’s chart on Oct. 29, the 50-day SMA was trending below the 200-day SMA on Ethereum’s chart. If Ethereum continued to trend above the 200-day, the 50-day would eventually cross above the 200-day, which would cause a golden cross to form and give bullish traders more confidence going forward.\n\nBitcoin has resistance above at $38,105 and at $39,600 and support below at $35,593 and at $31,862.\n\nEthereum has resistance above at $2,150 and at $2,317 and support below at $2,020 and at $1,937.\n\nThe Dogecoin Chart: Unlike Bitcoin and Ethereum, which surged Thursday, Dogecoin was highly volatile, losing 8% and climbing over 3% at one point before settling to close the session slightly lower.\n\nDogecoin has been trading mostly sideways between about 7 cents and $0.075 since Sunday, which helped drop the crypto’s RSI down to the 64% mark.\n\nDogecoin’s horizontal consolidation has taken place above the 200-day SMA, which was a likely scenario after a stock or crypto regained that level. Like Ethereum, if Dogecoin continued to trade above the 200-day, the 50-day would cross above the 200-day SMA, which would cause a golden cross to form.\n\nBullish traders want to see Dogecoin continue to trade sideways and then for big bullish volume to come in and break the crypto up above Thursday’s high-of-day. Bearish traders want to see big bearish volume drop Dogecoin back under the 200-day SMA.\n\nDogecoin has resistance above at $0.075 and at $0.083 and support below at $0.069 and at $0.065.\n\nRead Next: EXCLUSIVE: Bitcoin Rally Ahead? Bitget's Gracy Chen Weighs In On Spot ETFs And Cathie Wood's 'Crazy' $1M Target\n\nPhoto: Shutterstock\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nGet insight into trading platforms. Compare the best online stock brokerages.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5meGVtcGlyZS5jb20vbmV3cy9hcnRpY2xlL2ZpdmUtdGhpbmdzLXRvLWtub3ctaW4tY3J5cHRvLXRoaXMtd2Vlay1ibGFja3JvY2stYW5kLWV0aGVyZXVtLWV0Zi1uZXdzLXN0ZWFscy10aGUtc2hvdy0xMzg4MDI50gF7aHR0cHM6Ly9hbXAuZnhlbXBpcmUuY29tL2VuL2ZpdmUtdGhpbmdzLXRvLWtub3ctaW4tY3J5cHRvLXRoaXMtd2Vlay1ibGFja3JvY2stYW5kLWV0aGVyZXVtLWV0Zi1uZXdzLXN0ZWFscy10aGUtc2hvdy8xMzg4MDI5?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Five Things to Know in Crypto This Week: BlackRock and Ethereum ETF News Steals the Show - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS9jcnlwdG8tbmV3cy1iaXRjb2luLWFuZC1ldGhlcmV1bS1oaXQtaGlnaHMtb24tc3BvdC1ldGYtbmV3cy0xMzg3NzQ30gFfaHR0cHM6Ly9hbXAuZnhlbXBpcmUuY29tL2VuL2NyeXB0by1uZXdzLWJpdGNvaW4tYW5kLWV0aGVyZXVtLWhpdC1oaWdocy1vbi1zcG90LWV0Zi1uZXdzLzEzODc3NDc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Crypto News: Bitcoin and Ethereum Hit Highs on Spot ETF News - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMS8xMS9hbmFseXN0LWJlbmphbWluLWNvd2VuLWlzc3Vlcy1ldGhlcmV1bS1hbGVydC1zYXlzLWV0aC10by1jb250aW51ZS11bmRlcnBlcmZvcm1pbmctYWdhaW5zdC1iaXRjb2luLWhlcmVzLXdoeS_SAZEBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMTEvMTEvYW5hbHlzdC1iZW5qYW1pbi1jb3dlbi1pc3N1ZXMtZXRoZXJldW0tYWxlcnQtc2F5cy1ldGgtdG8tY29udGludWUtdW5kZXJwZXJmb3JtaW5nLWFnYWluc3QtYml0Y29pbi1oZXJlcy13aHkvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Analyst Benjamin Cowen Issues Ethereum Alert, Says ETH To Continue Underperforming Against Bitcoin – Here’s Why - The Daily Hodl",
        "content": "A widely followed crypto analyst is warning that Ethereum (ETH) will likely underachieve relative to Bitcoin (BTC) for a while.\n\nIn a new video update, crypto trader Benjamin Cowen tells his 788,000 YouTube subscribers that he believes that Bitcoin dominance (BTC.D) will continue to rise, suggesting that Ethereum will lag behind.\n\nBTC.D tracks the percentage of the total market cap that belongs to Bitcoin. A bullish BTC.D chart indicates that altcoins in general, including Ethereum, are printing smaller gains than BTC.\n\nSays Cowen,\n\n“My crypto portfolio for the last couple of years has been predominantly just Bitcoin because I suspect that it will outperform most of the rest of the market – not all of the market, but most of the rest of the market – and that’s why the dominance has gone higher.”\n\nCowen says that Ethereum against Bitcoin (ETH/BTC) is facing significant resistance after dipping below a trendline and attempting to retest it.\n\n“It’s Bitcoin rallies that break Ether-Bitcoin down. And look at this [ETH/BTC] breakdown. It finally broke this wedge to the downside…\n\nIt’s the same thing that it did last cycle… And now we find ourselves in a position where if I connect the dots where the Ether-Bitcoin pair is potentially backtesting this trendline, the trendline that it held as support in October of 2022, in March of 2023, and in June of 2023 and in September of 2023. It’s now testing it from beneath in November of 2023. Now, I contend that this could offer a significant resistance level.”\n\nCowen warns that even if ETH/BTC does make a move above the trendline, the pair will still face a number of resistance levels to the upside that it would need to flip as support to convincingly reverse the downtrend.\n\n“There’s all these resistance levels. I mean you could draw them horizontally if you prefer and just sort of look at some of these resistance levels that Ether-Bitcoin tried to hold. It’s got a lot to get through in order to prove something.”\n\nETH/BTC is trading for 0.0560 BTC ($2,093) at time of writing.\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vcGFuZWwtb2YtbWFya2V0LWV4cGVydHMtcHJlZGljdHMtd2hlbi1ldGhlcmV1bS1wcmljZS13aWxsLWNyb3NzLTE0MDAwL9IBcGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vcGFuZWwtb2YtbWFya2V0LWV4cGVydHMtcHJlZGljdHMtd2hlbi1ldGhlcmV1bS1wcmljZS13aWxsLWNyb3NzLTE0MDAwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Panel Of Market Experts Predicts When Ethereum Price Will Cross $14,000 - NewsBTC",
        "content": "Finder’s board of crypto market experts has predicted a positive long-term increase in the price of Ethereum in 2023, 2025, and 2030.\n\nEthereum To Surpass $14,000 By 2030?\n\nThe price of Ethereum has been on a fairly positive sentiment since the news of BlackRock’s Ethereum Spot ETF filing news. The cryptocurrency saw a spike that took its price above $2000 this week.\n\nIndustry specialists from Finder, an independent comparison platform and information service have stated that Ethereum will continue experiencing a price increase in the coming years.\n\nThe comparison platform has predicted that Ethereum would drop to $1,840 by the end of 2023 and Ethereum’s price at the time of writing is $2,060.8. Crypto specialists at Finder also expect Ethereum’s value to increase to $5,824 by 2025 and $14,411 by 2030.\n\nThe financial information service platform has stated that the reason for this price prediction is due to Ethereum’s huge growth potential and the increasing demand for Ethereum staking.\n\nEthereum (ETH) is currently trading at $2,060. Chart: TradingView.com\n\nLead Market Analyst at Swyftx, Pav Hundal has supported Ethereum’s price increase prediction. Hundal stated that the upcoming Bitcoin halving in 2024 may push the cryptocurrency’s price up, as historical patterns have suggested a potential upward movement for Ethereum’s value during past Bitcoin halving events.\n\n“Historically, as we approach a Bitcoin halving, Ethereum tends to revisit its price valuations from earlier that year. This trend aligns with the repeated observation that Bitcoin’s dominance (proportion of the total [crypto] market capitalization) swells as we near the halving event. We can anticipate that there will be a potential shift from altcoins [like ETH] back into Bitcoin in the lead-up to the halving,” Hundal stated.\n\nFinder Experts Say BTC Still Holds Upper Hand\n\nDespite the positive outlook of Ethereum’s price in the future by Finder’s crypto experts, a large majority of Finder’s specialists have expressed skepticism about Ethereum’s market capitalization surpassing that of Bitcoin.\n\nWhen asked if they saw ETH’s market cap “flipping” BTCs, 43% of the expert panelists remained unconvinced that Ethereum would overtake Bitcoin.\n\nCreator of Seasonal Tokens, Ruadhan O. has stated that he believed that Ethereum’s utility surpassed Bitcoin’s however he does not see ETH’s market cap surpassing BTC’s. He explained that his reasons were due to Ethereum’s high competition with other altcoins in the crypto market.\n\n“Ethereum remains expensive to use [and] it will lose market share to cheaper alternatives. Bitcoin isn’t useful. Nobody needs a Bitcoin. There’s no demand for Bitcoin’s utility at a lower price because there’s no utility. This is why Bitcoin isn’t losing market share to other proof-of-work coins,” O stated.\n\nFeatured image from Shutterstock\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LmJpdGNvaW5zZW5zdXMuY29tL2JsYWNrcm9jay1vZmZpY2lhbGx5LWZpbGVzLWZvci1hLXNwb3QtZXRoZXJldW0tZXRmL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 13:51:43 GMT",
        "title": "BlackRock Officially Files for a Spot Ethereum ETF - Bitcoinsensus",
        "content": "The $9 trillion asset manager, BlackRock, has taken a big step towards crypto with an official SEC filing for a spot-based Ethereum ETF.\n\nNews of BlackRock’s move already impacts the market, with positive indicators and a notable 9% surge in Ethereum’s price within the last 24 hours.\n\nSpeculation arises around the SEC’s potential response to BlackRock’s Ether ETF filing, considering the regulator’s past stance on Spot Bitcoin ETFs.\n\nBlackRock, the asset management giant with over $9 trillion in assets has taken another big step towards crypto. On November 9, the firm’s iShares division submitted an application to the U.S. Securities and Exchange Commission (SEC) for a spot exchange-traded fund (ETF) linked to Ethereum (ETH), the second-largest cryptocurrency globally.\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nThe Filing Process\n\nBlackRock’s iShares had previously registered the iShares Ethereum Trust as a Delaware corporation, signaling its intent. Now, with the official SEC filing, the regulatory process begins, as the SEC reviews the proposed rule change for listing the ETF on the Nasdaq exchange.\n\nHow Will the SEC Respond?\n\nSpeculations abound in the crypto community regarding the SEC’s response. Some foresee the SEC maintaining its stance against Spot Bitcoin ETFs, potentially impacting BlackRock’s Ether Spot ETF filing. The approval of the latter could introduce a paradox, contradicting past decisions on Spot Bitcoin ETFs.\n\nMarket Reaction and Altcoin Rally\n\nDespite uncertainties, market indicators suggest a positive sentiment within the crypto community. BlackRock’s Ethereum Spot ETF confirmation has led to a surge in market metrics, hinting at a potential rally for altcoins. Notably, the price of ETH surged by 9% within the last 24 hours, currently trading at $2091, reflecting a 17% increase in the past seven days and a market cap of $251 billion.\n\nUnleash the potential of leverage trading! Join Bybit today with our link, complete KYC, and earn up to a $40 bonus on a $100 deposit. Don’t miss out on this exclusive offer; claim your bonus now!\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nBlackRock’s Broader Crypto Strategy\n\nThis move by BlackRock is not isolated. The asset manager’s recent filing follows its plans to launch a similar product for Bitcoin. Confidence is reportedly high, with expectations of approval for the spot Bitcoin ETF early next year. What sets the Ether ETF filing apart is its implication. It suggests BlackRock’s broader interest in the entire crypto asset industry, extending beyond Bitcoin.\n\nInstitutional Confidence and Market Impact\n\nBlackRock CEO Larry Fink, in a recent interview, characterized the surge in crypto prices as a flight to quality. The Ether ETF filing aligns with this sentiment, reinforcing the growing evidence that institutional demand for crypto assets is indeed on the rise. This statement shows how the institutional confidence has been on the rise.\n\nFinal Takeaway\n\nBlackRock’ again stepping into the crypto space with the filing of a Spot Ethereum ETF is a big move. The potential approval and subsequent listing on Nasdaq could reshape the landscape of crypto investment products. As the SEC reviews BlackRock’s application, the crypto community awaits with bated breath, anticipating the regulator’s decision. Approval of this decision will mean big things for the crypto market.\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nEnhance Your Crypto Trading Skills With Our Legends’ Trading Masterclass\n\nEmpower your crypto trading skills with our Legends Masterclass. Sign up now and take advantage of our limited-time discount offer! Join the class today."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMS8xMS93aGFsZS1hY3Rpdml0eS1zcGlrZXMtb24tYml0Y29pbi1ldGhlcmV1bS1jYXJkYW5vLWFuZC1jaGFpbmxpbmstbmV0d29ya3MtY3J5cHRvLWFuYWx5dGljcy1maXJtLXNhbnRpbWVudC_SAY4BaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMTEvMTEvd2hhbGUtYWN0aXZpdHktc3Bpa2VzLW9uLWJpdGNvaW4tZXRoZXJldW0tY2FyZGFuby1hbmQtY2hhaW5saW5rLW5ldHdvcmtzLWNyeXB0by1hbmFseXRpY3MtZmlybS1zYW50aW1lbnQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Whale Activity Spikes on Bitcoin, Ethereum, Cardano, and Chainlink Networks: Crypto Analytics Firm Santiment - The Daily Hodl",
        "content": "Leading analytics firm Santiment says the recent digital asset market uptick has been accompanied by a spike in crypto whale activity.\n\nSantiment notes that whales on the Bitcoin (BTC), Ethereum (ETH), Cardano (ADA) and Chainlink (LINK) networks have all hit their highest activity levels in the past six months.\n\nExplains the analytics firm,\n\n“There may be a bit of profit-taking happening to end the week, but this doesn’t necessarily signal that tops are imminent.”\n\nBTC is trading at $37,388 at time of writing. The top-ranked crypto asset is up by nearly 8% in the past seven days.\n\nETH, the second-largest crypto asset, is trading at $2,084 at time of writing and is up nearly 14% in the past week.\n\nADA is trading at $0.379 at time of writing. The ninth-ranked crypto asset by market cap is up by more than 16% in the past seven days.\n\nLINK is trading at $15.43 at time of writing. The 12th-ranked crypto asset by market cap is up more than 35% in the past week.\n\nSantiment also notes that Ethereum competitor Solana (SOL) is receiving a lot of attention online as the crypto asset prints an 18-month high.\n\n“Discussion rates on SOL have again spiked, indicating the mainstream crowd recognizes the asset’s decoupling from other assets. Funding rates are high, but not in a ‘danger zone’ yet.”\n\nSOL is trading at $56.59 at time of writing. The seventh-ranked crypto asset by market cap is up more than 43% this week.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMTEvMTAvZXRoZXJldW0tYWRkcmVzc2VzLWluLXByb2ZpdC1zb2FyLXRvLTc1LWFzLWV0aC1mYWNlcy1wb3RlbnRpYWwtZnJlZS1mbG93LXRvLTI1MDAv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Addresses in Profit Soar to 75% as ETH Faces Potential Free Flow to $2,500 - The Crypto Basic",
        "content": "The majority of addresses holding Ethereum (ETH) are now in profit, offering a positive outlook for the future of the asset amid a potential surge to $2,500.\n\nAccording to the “In/Out of the Money” metric from the crypto analytics platform IntoTheBlock (ITB), these profitable holders account for 75% of wallets with Ethereum on the network.\n\nIs Ethereum getting ready for new highs?\n\nThe In/Out of the money situation shows 75% of holders in profit with no serious resistance zones until it moves above $2500. Does this mean it's a clean run to a new ATH? Not necessarily. Historically, profit-taking at these levels is… pic.twitter.com/gZbr7ByR0W — IntoTheBlock (@intotheblock) November 10, 2023\n\n- Advertisement -\n\nFor context, the data shows 77.72 million addresses are in profit, leaving 21.91 million holders at a loss. In addition, the traders marked by the grey ball in the ITB post are at a break-even point, and there are 3.98 million addresses in this zone.\n\nETH Profitability: What to Expect\n\nPresenting the result on X, IntoTheBlock shows there’s no major resistance ahead for the Ethereum price until it reaches the $2,500 level.\n\nThis impressive outlook is currently driving a bullish optimism for Ethereum’s price. Despite the promises presented by this metric, the data analytics provider issued a note of caution to traders who might expect a full ride toward a new All-Time High (ATH).\n\n- Advertisement -\n\nITB acknowledged that Ethereum traders historically take profits now that the majority are in profit. This trend, if it repeats itself, might fuel some pullbacks, but ITB expects this will not impact Ethereum’s longer-term prospects.\n\nAnother interesting perspective on Ethereum’s prospects emerged from top market analyst Ali Martinez. Drawing on the coin’s latest run above the psychologically important level at $2,000, Martinez highlighted how intriguing this milestone is, seeing whales have not started accumulating the coin.\n\n#Ethereum has reclaimed the $2,000 threshold, and intriguingly, this is all happening before whales have even started buying $ETH! pic.twitter.com/wrgESGXoU6 — Ali (@ali_charts) November 10, 2023\n\nThe Ethereum ETF Intrigue\n\nThough Ethereum’s YTD growth of 73% trails behind that of Bitcoin (BTC) at 123%, it remains a high performer. While retail holders can take accolades for the current rally, the prospect of a potential Ethereum spot ETF complements the growing optimism.\n\nIn a not-so-shocking twist, prominent asset manager BlackRock applied to list its iShares Ethereum Trust, a move welcomed with many expectations. The possibility the market might get this product through BlackRock and other applicants like Grayscale underscores the push to create a regulated pathway for corporate or institutional investors to gain exposure to Ethereum.\n\nIf achieved, the long-term prospects of Ethereum look bright, as inferred by IntoTheBlock and other market experts. Ethereum is trading for $2,087, up 2.86% over the past 24 hours and a whopping 33% over the past seven days."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZGVjcnlwdC5jby8yMDU1MDgvZXRoZXJldW0tZ2FtaW5nLXRva2Vucy1za3lyb2NrZXQtaWxsdXZpdW0tcm9uaW4taW1tdXRhYmxl0gFZaHR0cHM6Ly9kZWNyeXB0LmNvLzIwNTUwOC9ldGhlcmV1bS1nYW1pbmctdG9rZW5zLXNreXJvY2tldC1pbGx1dml1bS1yb25pbi1pbW11dGFibGU_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Gaming Tokens Skyrocket: Illuvium, Ronin, and Immutable Up 50% or More - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCrypto tokens tied to gaming-centric networks and high-profile games in the Ethereum ecosystem are among the biggest gainers in a broadly green market, with tokens like Illuvium (ILV), Ronin (RON), and Immutable (IMX) marking massive double-digit percentage gains over the past week.\n\nIlluvium, an anticipated NFT game that runs on Immutable X, marked an 86% price jump over the past week at the current price above $95, per data from CoinGecko, and has more than doubled in price over the past month with an 141% increase.\n\nMuch of that gain came on Wednesday after the creators of Illuvium announced that the game will launch on the Epic Games Store, a prominent marketplace for mainstream PC games, and that the next beta test for the game will release later this month.\n\nAD\n\nAD\n\nImmutable’s own token has also surged, with IMX up 50% this week to a current price of $1.04 per token. IMX has also doubled in the past month, with a nearly 103% price bump during that time. The gaming-centric Ethereum scaling network has made numerous recent announcements, none bigger than a partnership with Assassin’s Creed maker Ubisoft on Thursday.\n\nAnother big winner this week is RON, the token of the Ronin network, an Ethereum sidechain. Ronin’s token popped 53% this week to a current price of $0.78, and is up 88% over the past month. The network, best known for hosting Axie Infinity, has seen surging active users thanks to the recent buzzy launch of Pixels, another play-to-earn title.\n\nGALA, the token of the Gala Games ecosystem, pumped 33% this week and 87% over the past month. Meanwhile, Axie Infinity’s AXS token is up 12% this week and nearly 46% this past month, while The Sandbox’s SAND token marked a 12% weekly jump and 45% rise over the last 30 days.\n\nSuch gains are outpacing the crypto market’s most valuable coins. Bitcoin, for example, is up nearly 8% this week and 39% over 30 days, while Ethereum surged 16% this week and is up almost 35% during the past month."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtcHJpY2UtYW5hbHlzaXMtZm9yLW5vdmVtYmVyLTEwLTDSAUFodHRwczovL3UudG9kYXkvZXRoZXJldW0tZXRoLXByaWNlLWFuYWx5c2lzLWZvci1ub3ZlbWJlci0xMC0wP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) Price Analysis for November 10 - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe prices of coins keep rising; however, there are some exceptions from the rule.\n\nAdvertisement\n\nETH chart by CoinStats\n\nETH/USD\n\nThe rate of Ethereum (ETH) has increased by 3.08% over the past 24 hours.\n\nImage by TradingView\n\nOn the hourly chart, the price of Ethereum (ETH) has bounced off the local support level of $2,071.\n\nHowever, if the daily bar closes not far from it, bears may seize the initiative, which can lead to a drop to the $2,040 zone.\n\nImage by TradingView\n\nOn the daily chart, the rate of ETH has made a false breakout of yesterday's bar peak. If the candle closes below the important zone of $2,100, the correction may continue to the $2,000-$2,050 area in the next week.\n\nImage by TradingView\n\nOn the bigger chart, one should focus on the bar closure in terms of the level of $2,029. If it happens above that mark, the ongoing rise may continue to the $2,100 area and above.\n\nEthereum is trading at $2,086 at press time."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtcHJpY2UtYXQtMzAwMC10YXJnZXQtZm9yLW5leHQtZmV3LXdlZWtzLWluZGljYXRlZC1ieS10cmFkZXLSAVxodHRwczovL3UudG9kYXkvZXRoZXJldW0tZXRoLXByaWNlLWF0LTMwMDAtdGFyZ2V0LWZvci1uZXh0LWZldy13ZWVrcy1pbmRpY2F0ZWQtYnktdHJhZGVyP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) Price at $3,000: 'Target for Next Few Weeks' Indicated by Trader - U.Today",
        "content": "Advertisement\n\nTop-tier trader and analyst Jacob Canfield will not be surprised by another 50% upsurge of the second largest cryptocurrency. However, it needs to break through one more major resistance line to expand the rally.\n\nEthereum (ETH) price can \"probably\" reach $3,000 in next few weeks, Jacob Canfield says\n\nThe amount of $3,000 looks like a reasonable target that can probably be reached by the Ethereum (ETH) price the in next few weeks. Such a statement was shared by prominent crypto trader and entrepreneur Jacob Canfield with his 92,000-strong Twitter audience today, Nov. 10, 2023.\n\nThere we go. Testing the $2100 resistance zone now.\n\n\n\n$3k is probably target over the next few weeks https://t.co/IHBYXXQ4sA pic.twitter.com/0glULRTnkb — Jacob Canfield (@JacobCanfield) November 9, 2023\n\nAt the same time, he stressed that Ethereum (ETH) is struggling to stay above $2,100, which is a crucial resistance level for the ongoing phase of the market.\n\nToday Ethereum (ETH) touched a local high at $2,132 on major spot exchanges. It is the highest level for Ethereum (ETH) since the Terra (LUNA) collapse in mid-May 2022.\n\nThe Ethereum (ETH) price added over 33% in just one month on the news of Ethereum Spot ETF prospects and overall market optimism.\n\nOver the last 24 hours, $80 million in Ethereum (ETH) positions, 65.9% shorts, were liquidated on centralized exchanges. Yesterday, the trading session was the most brutal one for bears in months, CoinGlass data says.\n\nDeFi coins' market cap back above $60 billion, ETH price run to blame\n\nThe upsurge of Ethereum (ETH) catalyzed all segments in crypto associated with smart contracts. For instance, the net capitalization of DeFi tokens jumped over $60 billion for the first time in year-and-a-half.\n\nThe total volume of value locked in L2 protocols on Ethereum (ETH) jumped to a new all-time high. Per the L2Beat tracker, over $13.6 billion in various cryptos are locked in L2s on Ethereum (ETH).\n\nThe aggregated TVL of Ethereum-based DeFis is lagging behind previous metrics: it only surged to mid-July levels over $25 billion."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS92aWRlby9ldGhlci10b3BzLWRvbGxhcjJrLWFzLWJsYWNrcm9ja3MtZXRoZXJldW0tZXRmLXBsYW4taXMtY29uZmlybWVkLWluLW5hc2RhcS1maWxpbmcv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Ether Tops $2K as BlackRock's Ethereum ETF Plan Is Confirmed in Nasdaq Filing - CoinDesk",
        "content": "Now, the world's largest asset manager seems to be diving deeper into the crypto space. A new filing reveals that Blackrock wants to create an E AN ETF that holds Ether joining us now to discuss this Coin desk, global policy and regulation managing editor Nick Day, who's also the editor of Coin desk's state of crypto newsletter. Good morning to you, Nick. Good morning. Happy Friday. Happy Friday. All right, we're talking about this Black Rock News. So earlier Thursday, Blackrock registered is shares Ethereum Trust in the State of Delaware. Uh Back up for us, explain why this is significant and why we're seeing this market reaction. Yeah. So, you know, um first off Blackrock, obviously, uh we've been saying this for months but speculation is that it's applying for a Bitcoin ETF because it feels that the, you know, current situation around Bitcoin, the, you know, the market, everything is right for an approval for such product. Uh You know, I think we're seeing a similar assessment around this E three TF application that we saw yesterday where Blackrock is not necessarily gonna file for one of these. If it thinks it's a pools errand, it's gonna file if it's confident that, you know, the market is in a place where such product will be approved uh coming on top of the fact that, you know, it's been a, uh there's been a lot of, you know, I think, heightened uh excitement over the possibilities of Bitcoin ETF being approved and it really does seem like, you know, Blackrock if anything uh is um you know, just really kind of adding to this excitement. So, yeah, I imagine markets uh reacting at least in part to just this idea. Ok. Well, you know, the world's biggest asset manager, which is a company that has, you know, serious ties to regulators because it has to do so much business with regulators, uh you know, whatever feedback you're getting seems to suggest that, ok, this is something that is worth pursuing. I I it might be worth pursuing but are, are, are they just taking a again? I mean, this is kind of like a gamble if you will, right? Because of course, we don't know for certain that it will be approved. Um And first of all that, the ones that are up, the nine or so that are up for uh approval are Bitcoin. So even even if those get approved and uh Ether Spot ETF might take some time. Correct? Yeah, yeah, this is uh you know what we saw yesterday was, I think 19 4, which is just the first form. It hasn't even been sent to the SEC itself yet. So, uh this is just Blackrock kind of announcing its intention to send this filing to the SEC. So any process is gonna take a while, certainly, we're not gonna see this in the next few months. But, you know, at the same time, if you look at the filing itself, Blackrock seems to have designed it in such a way to just try and, you know, get a lot of arguments for it and out front, you know, immediately. So it addresses surveillance sharing agreements that has as an agreement with coin base. Uh There's a part of it that seems to kind of harken back to the SEC uh you know, legal fight against Grayscale where uh Grayscale appealed the rejection of its own. ETF and the appeals court said, uh it agreed with Grays skill's position that the SEC acted, you know, arbitrarily and graciously in denying that. So there is an entire part of the new ETF application for Ether that says like, ok, well, these Ether futures ETS are out there and just the exact same market operating under the exact same, you know, whatever. And so if an Ether futures ETF is allowed a spot, Ether ETF should also be allowed. So, you know, clearly they're paying attention to what's going on in this uh you know, broader, you know, ETF battle. And they're saying, ok, well, you know, these are the arguments we seem to deny previous ETF applications and we disagree with uh whatever, like we think that the market is right. All right, Nick. And we, we know that Blackrock Ceo Larry Fink has maybe changed his tune when it comes to crypto within the past year. Have you been following what Larry Fink has been saying about crypto ahead of these two? Well, the one application we know for sure. And the, the spot Ether ETF, well, you know, before he found a way to make money off of it, he seemed pretty skeptical now, uh I forget what exactly the words was. I'm not sure if he was the one who use like change catalyst or whatever the phrase was. But uh yeah, absolutely. He does seem to have changes to, I'm sure it's just a coincidence though, you know, clear, definitely nothing to do with the fact that now they're trying to, you know, file for ETS on top of these crypto products that, you know, will obviously bring his company, uh you know, more money. But you know, that, that's just the case. We're just here to point out the coincidences. All right, Nick, we are going to leave it there. Have a great weekend and we'll see you next week e that Coin Desk Global Policy and regulation managing editor Nick Day and don't forget to sign up for the state of crypto newsletter on coindesk dot com."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMinwFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tZWlnaHRlZW4tbW9udGhzLWFzY2VuZGluZy10cmlhbmdsZS1wYXR0ZXJuLWFwcHJhaXNlcy00LTAwMC10YXJnZXQtZm9yLWV0aC0yMDIzMTExMTA3MzDSAaMBaHR0cHM6Ly93d3cuZnhzdHJlZXQuY29tL2FtcC9jcnlwdG9jdXJyZW5jaWVzL25ld3MvZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi1laWdodGVlbi1tb250aHMtYXNjZW5kaW5nLXRyaWFuZ2xlLXBhdHRlcm4tYXBwcmFpc2VzLTQtMDAwLXRhcmdldC1mb3ItZXRoLTIwMjMxMTExMDczMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Eighteen-months ascending triangle pattern appraises $4,000 target for ETH - FXStreet",
        "content": "Share:\n\nEthereum price has been consolidating along an ascending trendline for the past eighteen months, with the $2,035 level holding as resistance.\n\nThe overall price action has formed an ascending triangle pattern, which forecasts a $4,736 price target for ETH.\n\nThe bullish thesis will be invalidated once the altcoin breaks and closes below the ascending trendline at the $1,500 psychological level.\n\nEthereum (ETH) price is bullish on lower and higher timeframes alike, as token holders ride the wave of what already seems to be the making of a bull market. On the higher timeframe, however, the target objective for the largest altcoin by market capitalization looks overly ambitious, but not impossible as community members turn faces toward the exchange-traded fund (ETF) narrative and the much-anticipated Bitcoin (BTC) halving, together with their combined effect on asset prices.\n\nAlso Read: Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC rages on, $40,000 may not be hopium after all\n\nEthereum price 18-month ascending triangle forecasts $4,736 target\n\nEthereum (ETH) price consolidating above an ascending triangle, combined with the effect of the formation of multiple local tops around the$2,035 level has led to the formation of an ascending triangle pattern.\n\nSuch a technical formation is created when the asset’s price lead to the formation of a horizontal line connecting the swing highs, while a rising trendline trails it from below connecting the swing lows. Together, the trendlines form a triangle, with traders watching for breakouts from the horizontal trendline. The target objective for such a technical formation is determined by measuring the height of the triangle and superimposing it at the breakout point.\n\nFor Ethereum price, the height of the triangle is around 134%, from $865 to $2,035 on the weekly timeframe. Superimposing this percentage difference on the weekly chart puts a target objective of $4,736.\n\nThe Relative Strength Index (RSI) spurs optimism, moving north to signify rising momentum while its position at 64 shows there is still more room to the north. Effectively, the Awesome Oscillators (AO) histogram bars are also flashing green to show the bulls maintain a strong presence in the ETH market.\n\nETH/USDT 1-week chart\n\nOn the flip side, profit-taking could nullify the projection by sending Ethereum price south, potentially losing the support offered by the ascending trendline at the $1,500 psychological level. This would invalid the bullish thesis."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS9pdHMtZXRoZXJldW1zLXR1cm4tdG8tanVtcC0xMzg3ODI30gE-aHR0cHM6Ly9hbXAuZnhlbXBpcmUuY29tL2VuL2l0cy1ldGhlcmV1bXMtdHVybi10by1qdW1wLzEzODc4Mjc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "It’s Ethereum’s Turn to Jump - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYm9sZC5jb20vd2hhdHMtbmV4dC1mb3ItZXRoZXJldW0tcHJpY2UtYXMtZXRoLXNvYXJzLTEwLWluLW9uZS1kYXkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "What's next for Ethereum price as ETH soars 10% in one day? - Finbold - Finance in Bold",
        "content": "As a highly bullish week for many assets in the cryptocurrency market draws to its end, Ethereum (ETH) has stood out as one of the sector’s best performers, making more significant strides than others and leaving the psychologically important $2,000 price resistance level behind.\n\nIndeed, Ethereum’s high network growth, particularly that of micro addresses with less than 0.1 ETH, has pushed its market value by 10% in a single day and more than 30% over four weeks, according to the data shared by crypto and blockchain analytics platform Santiment in an X post on November 10.\n\nSpecifically, these micro Ethereum wallets have recently surpassed the number of 100,000 for the first time in history, and the 0.1-10 ETH and 10K+ ETH tiers have witnessed growth as well in the past two weeks, leading Ethereum to the highest price since May 2022, as the crypto platform’s chart indicates.\n\nEthereum network and price growth. Source: Santiment\n\nOther bullish indicators\n\nAt the same time, crypto trading expert Ali Martinez pointed out an interesting fact that Ethereum reclaiming the $2,000 threshold was taking place before +10K ETH whales had even started buying the second-largest cryptocurrency by market capitalization, as illustrated by the Glassnode chart he shared on X.\n\nEthereum mega-whale addresses. Source: Ali Martinez\n\nAdditionally, crypto expert Trader Tardigrade earlier highlighted Ethereum’s breaking out of the 200-day resistance trendline, while its moving average convergence divergence (MACD) and signal line both turned into position values, and the MACD histogram showed an increase in the upside momentum.\n\nEthereum breakout. Source: Trader Tardigrade\n\nEthereum price analysis\n\nMeanwhile, Ethereum was at press time changing hands at the price of $2,105.62, recording a significant increase of 10.49% on its daily chart, which has added up to the 17.88% gain accumulated across the previous week and the even higher advance of 33.65% over the past month.\n\nEthereum 30-day price chart. Source: Finbold\n\nAll things considered, ETH might be on a strong bullish trend that could actually see it reach a price between $3,000 and $10,000 in 2024, earlier predicted by the artificial intelligence (AI) tool ChatGPT based on the asset’s expanding institutional adoption, as Finbold reported on November 4.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi1hcy1yZWNvdmVyeS1oaXRzLTctbW9udGgtaGlnaC_SAVlodHRwczovL2NvaW5nYXBlLmNvbS9tYXJrZXRzL2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tYXMtcmVjb3ZlcnktaGl0cy03LW1vbnRoLWhpZ2gvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Is $ETH Heading to $3000 by November End? - CoinGape",
        "content": "Ethereum Price Prediction: The Ethereum coin price continues to maintain its aggressive bullish momentum even in November. On the 9th of this month, ETH price witnessed a massive surge of 12.3% intraday gain which reached a seven-month high of $2,130. This sudden surge in buying pressure is likely aligned with the recent news that BlackRock, the world’s largest asset management company, has applied for Ethereum spot ETF. Will development prolong the ongoing recovery to $3000?\n\n\n\nAlso Read: BlackRock Files First Ethereum Spot ETF\n\nadvertisement\n\nIs ETH Sustainable Above $2000?\n\nWith the supply pressure at $2136 resistance, the ETH price may witness a minor pullback\n\nCompletion of flag pattern sets a potential target of $2340, followed by $3000\n\nThe intraday trading volume in Ether is $20.2 Billion, indicating a 5.2% gain.\n\nSource- Tradingview\n\nOver the past 30 days, the Ethereum price trajectory has been impressive, climbing from a low of $1,522 to a recent high of $2,136 – a 40% increase. A key moment in this rally was on November 5th, when coin buyers successfully pushed the price beyond the resistance trendline of a bullish flag pattern.\n\nThis move led to a surge past the significant $2,030 barrier, culminating in the recent 7-month high. With strong accumulations across various Ethereum addresses and BlackRock filling applications for spot Ethereum ETF, the crypto market witnessed positive boasts among traders.\n\nAs of the latest trading sessions, the ETH price at $2,063. Although there is a slight intraday loss of 0.75%, this minor pullback might lead to revisiting the $2,030 level in search of potential support.\n\nShould the coin price stabilize at these higher price levels, the momentum could carry it further up, potentially by another 12% to reach the $2,340 mark, aligned with the first target of the flag pattern, followed by $3000.\n\nEthereum Holders in Profit\n\nSource- intotheblock\n\nThe Global In/Out of the Money (GIOM) metric for Ethereum indicates that currently, 62.13% of ETH addresses are ‘in the money’ (profiting), while 34.19% are ‘out of the money’ (at a loss). With the prevailing market recovery sentiment and a majority of holders in profit, there is a reduced likelihood of a panic sell-off, suggesting that investors might continue to support the ongoing bullish rally.\n\nExponential Moving Average (EMA): The positive crossover between the 100-day and 200-day EMA slopes is likely to encourage buyers to maintain the current recovery trend.\n\nDirectional Moving Index (DMI): The significant gap between the DI+ and DI- slopes, currently in a bullish crossover, underscores the prevailing bullish sentiment in the market"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY3J5cHRvLm5ld3MvYml0Y29pbi1wcmljZS13aWxsLWNvbnRpbnVlLWR3YXJmaW5nLWV0aGVyZXVtLXRvcC1jcnlwdG8tYW5hbHlzdC1zYXlzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin price will continue dwarfing Ethereum, analyst says - crypto.news",
        "content": "Into The Cryptoverse CEO Benjamin Cowen recently discussed Ethereum’s (ETH) performance in relation to Bitcoin’s (BTC) dominance as the flagship digital asset.\n\nIn a recent YouTube video, Cowen suggests a continued rise in Bitcoin dominance (BTC.D), indicating that Ethereum may lag behind and show smaller gains compared to BTC.\n\nCowen explains that his crypto portfolio has predominantly held more Bitcoin because he anticipates that BTC will outperform numerous assets, though not all.\n\nAdditionally, Cowen notes that Ethereum against Bitcoin (ETH/BTC) is encountering substantial resistance after falling below the trendline and attempting a retest.\n\nYou might also like: Bitcoin and Ethereum outperform traditional assets in 2023\n\nA BTC rally would result in the breakdown of Ether-Bitcoin, he explained. He pointed out how the ETH/BTC pair finally broke the wedge to the downside, highlighting that it’s akin to what happened in the last cycle.\n\nAs he connects the dots, the Ether-Bitcoin pair is potentially backtesting the trendline that served as support in October 2022, March 2023, June 2023, and September 2023. Since the ETH/BTC pair is now testing from beneath the wedge in November 2023, it could offer a significant resistance level.\n\nHowever, Cowen cautions that even if ETH/BTC manages to move above the trendline, the pair will encounter several resistance levels to the upside. These levels must be successfully flipped as support to convincingly reverse the downtrend.\n\nHe further explained, stating that, there are numerous resistance levels. Whether one opts to depict them horizontally or analyze them differently, ETH/BTC still faces a significant challenge. It must have to overcome these resistance levels to indicate a meaningful reversal.\n\nAt the time of writing, ETH/BTC is valued at 0.05578 BTC, equivalent to $2,068.80 on Tradingview. Meanwhile, BTC/USDT is valued at $37,112, according to Coingecko.\n\nETF expectations\n\nThe recent surge in Bitcoin and Ethereum has significantly influenced the cryptocurrency market.\n\nBitcoin has reached $37,000, marking highs not seen since May 2022. This may be driven by the ongoing expectation that U.S. regulators approve a spot Bitcoin exchange-traded fund (ETF).\n\nSimultaneously, Ethereum has rallied close to $2,100, reclaiming the $2,000 level for the first time since mid-July. The rise in digital assets, especially XRP, may also be attributed to Bitcoin surpassing $35,000.\n\nAdditionally, news about BlackRock planning to file for an ETH-based ETF may have also fueled Ethereum’s upward momentum.\n\nFollowing the anticipation of the ETF approval, which has propelled cryptocurrency prices and related stocks, This rally could be part of a broader uptrend in the crypto sector, recognized as a significant $17.7 trillion opportunity by market strategists.\n\nHowever, altcoins like XRP, DOGE, UNI, and XLM have experienced declines, possibly due to a pause in capital rotation towards smaller tokens.\n\nFed chair Jerome Powell recently delivered a policy address to the Economic Club of New York, providing insights into the current state of the US economy and monetary policy.\n\nThis statement is significant given the critical juncture of the U.S. economy, marked by improving inflation figures alongside surging Treasury yields, creating conflicting signals about the direction of monetary policy.\n\nInterpreted as a signal, Powell’s statement suggests that the Fed might persist with its tightening cycle, contrary to recent market expectations of a more dovish approach.\n\nRead more: Bitwise withdraws bitcoin and ethereum ETF application\n\nFollow Us on Google News"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vdW5jaGFpbmVkY3J5cHRvLmNvbS9zb2xhbmEtaXMtb24tYS10ZWFyLXNvLXdoeS1kby1ldGhlcmV1bS1uZnRzLXJlbWFpbi10b3AtZG9nL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Solana Is on a Tear. So Why Do Ethereum NFTs Remain Top Dog? - Unchained - Unchained",
        "content": "SOL more than doubled in the last month. But here’s why Ethereum NFTs continue to outperform Solana NFTs by a mile.\n\nSolana is ripping. Not only has general crypto market sentiment turned more positive, which has boosted assets beyond just bitcoin, but Solana also just completed another one of its attention-grabbing conferences, Breakpoint. That’s all led to SOL more than doubling in the past month.\n\nDespite developer interest in Solana, the jump in its token price, and the fact that the speedy chain is known for NFT activity, as of yet, the leading blockchain for NFTs remains Ethereum.\n\nRead more: NFT Trading Activity on Ethereum Surges, Reaching a Six-Month High\n\nAccording to data from CryptoSlam, in the past 30 days, Ethereum led the NFT market in sales volume with $245 million in sales. Ethereum’s activity underscores its dominance, with a vast number of transactions totaling 745,175 and engaging 70,423 buyers.\n\nComparatively, Solana, which stands fourth in the ranking, reported $30.1 million in sales, just 12% of Ethereum’s volume, even after considering the fact that SOL has outperformed ETH by 127% in the last 30 days.\n\nWith Solana struggling to grab market share in the NFT ecosystem, Hildebert Mouiliere, aka Hildobby, a data scientist at VC firm Dragonfly, told Unchained that “a lot of things that appear on [Solana] are just copying what happened on Ethereum, which isn’t very innovative.”\n\nSolana is also battling the fact that Ethereum’s longer history makes it a hub for many types of activity beyond just NFTs. “I think Ethereum has become a center of liquidity for a lot of things,” said gmoney, NFT collector and founder of 9dcc. “And not just NFTs, but also certain tranches of DeFi and what have you. And so I think that’s going to be hard to displace even though there are narratives that build up around other chains.”\n\nHowever, Solana could still become a contender if it builds on the particular advantages of its technology over Ethereum. “I hope that we see in the future some teams actually using what this tech can do to leverage what is lower fees and higher frequency transaction,” said Hildobby.\n\nRead more: Anatoly Yakovenko on Solana’s Astounding Recovery and Its Future Plans\n\nOver a year has passed since marketplaces like Magic Eden sparked a seismic shift in the NFT industry by making creator royalties optional—a move that continues to influence market dynamics.\n\nHildobby noted the complex nature of enforcing such payments and suggested that creators may need to consider additional incentives to encourage voluntary compliance. “It’s impossible to enforce those things,” he said.\n\nAs for where the market could go, Hildobby said he’s looking to the rise of NFT derivatives and lending platforms, which could diversify NFTs as financial instruments. “The vast majority of volume now is around lending, which allows for those high prices to now land at a much discounted rate,” Hildobby explained, emphasizing the potential for these platforms to broaden market participation.\n\nLearn more: What Are NFT dApps?\n\nGmoney also thinks future innovation in NFTs will come in their financialization and bringing real world assets on chain. As an example, he said, “the sneaker resell market is huge,” noting that with NFTs, “you can give them access to credit that they otherwise wouldn’t have.” Once that is a proven application, he said that could show the potential for NFTs to unlock value in other collectors’ items such as watches and handbags. “To me, one of the most interesting things is obviously, definitely the real world asset side of things, because I just think that you need to see the melding of those two worlds at some point, and I think that starts to happen over the next three to five years.”"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMTEvMTAvYmxhY2tyb2NrLW9mZmljaWFsbHktZmlsZXMtZm9yLWEtc3BvdC1ldGhlcmV1bS1ldGYv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "BlackRock Officially Files for a Spot Ethereum ETF - The Crypto Basic",
        "content": "The world’s largest asset manager has filed with the U.S. SEC to launch a spot-based Ether (ETH) ETF.\n\nBlackRock, the world’s largest asset management company with over $9 trillion in assets, is diving deeper into crypto. On November 9, BlackRock’s iShares division submitted an official application with the United States Securities and Exchange Commission (SEC) to launch a spot exchange-traded fund (ETF) tracking ETH, the second largest crypto asset by market capitalization.\n\nIf approved, the fund would trade on the Nasdaq exchange and offer traders exposure to ETH. Notably, the fund will purchase and sell ETH on behalf of investors with exposure reflected as publicly traded shares on the exchange.\n\n- Advertisement -\n\nBefore its SEC filing, iShares had registered the planned iShares Ethereum Trust as a Delaware corporation, a first step signaling its intent to launch such a product. However, an official filing means that the SEC has now received the company’s request for the proposed rule change to list the product and will initiate a review process as required by law.\n\nMeanwhile, news of BlackRock’s Ether ETF filing has positively impacted the price of ETH, with the asset rising by 9% in the past 24 hours. ETH is currently trading around $2090, representing a 17% increase in the past seven days and a market cap of $252 billion.\n\nBlackRock Doubling Down on Crypto\n\nBlackRock’s spot ETF application follows its widely publicized move to launch a similar product for Bitcoin (BTC). Per a Fox News report, BlackRock remains increasingly confident of securing approval for the spot Bitcoin ETF early next year.\n\nYet, the fund manager’s move to file for an Ether ETF catches the eye for another reason. It may be considered an indication that BlackRock is eyeing exposure to the broader crypto asset industry and not just Bitcoin.\n\n- Advertisement -\n\nIn a recent interview, BlackRock CEO Larry Fink described the surge in crypto prices as a “flight to quality.” The company’s latest Ether ETF backs up that claim and further backs growing evidence that institutional demand for crypto assets is on the rise."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmNvaW50cmlidW5lLmNvbS9lbi9tYXNzaXZlLWFjY3VtdWxhdGlvbi1vbi1ldGhlcmV1bS1oZWFkaW5nLXRvd2FyZHMtbmV3LWhlaWdodHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Ethereum: Towards New Heights? Massive Accumulation - Cointribune EN",
        "content": "Fri 10 Nov 2023 ▪ 3 min of reading ▪ by Fitah\n\nThe crypto market has revived optimism among investors for some time now. Most major cryptocurrencies, such as Bitcoin, Ethereum, and XRP, have recorded significant gains over the past four weeks. For Ether (ETH), on-chain and technical indicators suggest the imminent arrival of a major bullish wave.\n\nPositive signals from on-chain indicators\n\nAfter hitting critical support around $1520 in October, Ethereum (ETH) has bounced back by over 30% so far. Currently, the price of Ethereum is at $2,020 on Binance.\n\nThis increase is part of a major crypto market recovery, led by Bitcoin, which is now reaching $38,000. For Ethereum, the current rise appears to be the beginning of the long-awaited bull run, as on-chain indicators suggest further upward movement.\n\nAccording to data from IntoTheBlock, the amount of crypto sent to exchanges for selling purposes is lower than the outflows over the past 7 days. Let’s look at the chart below:\n\nChart showing net inflow on Ethereum – source: IntoTheBlock / Coin-Turk\n\nWe can see that investors have transferred 263,520 ETH from crypto exchange wallets to cold wallets between November 3rd and November 9th. These transactions thus suggest accumulation by long-term investors.\n\nThis indicates that, as the price of Ethereum rises, some investors choose to accumulate more. The total value of these purchases is around half a billion dollars, calculated at the average price. With a cumulative trading volume of about 50 billion, this is particularly exciting accumulation.\n\nEthereum Crypto Price Predictions\n\nOn October 8th, the total value of ongoing investments in Ethereum was $4.2 billion. Today, it has reached more than $5.42 billion, indicating a steady increase in prices in the short and medium term.\n\nAfter consolidating in the range between $1867 and $1766, Ethereum has finally made a major breakthrough. On the daily chart, a significant increase in price can be observed, nearing the annual high of $2138. This level could play a major resistance role for the second-largest cryptocurrency by market capitalization.\n\nTechnical analysis on Etherem D1 – source: TradingView\n\nIf Bitcoin maintains its current trajectory, Ether (ETH) could possibly reach a new annual high of $3000. However, caution should be exercised due to potential profit-taking from investors who bought in since $1520. IntoTheBlock also indicates that 73% of Ether holders are in profit at the current price.\n\nHowever, positive signals from on-chain indicators and technical analysis suggest further upward movement for this cryptocurrency. What will be the next target for Ethereum (ETH)?\n\nMaximize your Cointribune experience with our 'Read to Earn' program! Earn points for each article you read and gain access to exclusive rewards. Sign up now and start accruing benefits.\n\nClick here to join 'Read to Earn' and turn your passion for crypto into rewards!\n\nA A Lien copié"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZGVjcnlwdC5jby8yMDU0NTMvc3Rha2luZy10b2tlbnMtcmlkZS1oaWdoLWN1cnRhaWxzLWJsYWNrcm9jay1ldGhlcmV1bS1ldGYtaHlwZdIBXWh0dHBzOi8vZGVjcnlwdC5jby8yMDU0NTMvc3Rha2luZy10b2tlbnMtcmlkZS1oaWdoLWN1cnRhaWxzLWJsYWNrcm9jay1ldGhlcmV1bS1ldGYtaHlwZT9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Staking Tokens Post Double-Digit Gains on BlackRock Ethereum ETF Hype - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nHot on the heels of BlackRock's newest ETF filing are popular Ethereum-staking tokens.\n\nThe governance token behind Lido Finance has soared more than 20% overnight, per CoinGecko, reaching $2.49 at time of publication. Over the last week, the figure has ballooned even further, hitting 37% since last Friday. Beyond satisfying speculators, LDO also serves as a voting token for the liquid staking protocol Lido Finance. Holders can vote yay or nay on changes to protocol parameters or how Lido should spend its treasury.\n\nLido Finance is the industry's largest liquid staking provider, letting users, notably ETH holders, stake their Ethereum. In exchange, they get a \"stETH\" token which tracks the price of Ethereum and can be used elsewhere in DeFi, keeping users liquid.\n\nAD\n\nAD\n\nRocketPool's native token, the industry's second-largest staking provider, is also on a serious rally, rising over 20% in the past 24 hours to its current value of $32.83. Like Lido, it also gives users access to a staked version of Ethereum called \"RETH.\"\n\nStaking tokens soar on Ethereum ETF hopes\n\nThe price surge for staking tokens appears to be driven by recent news from BlackRock filing a new entity called \"iShares Ethereum Trust\" in Delaware—suggesting plans for an ETF for the cryptocurrency. The news has propelled Ethereum itself to over $2,000 for the first time since July.\n\nIt's not an official ETF filing for Ethereum, but analysts yesterday pointed out how BlackRock executed a similar move ahead of officially filing for its Bitcoin ETF back in June. The asset manager declined to comment on the matter.\n\nThough it's joining a long list of ETF hopefuls for both assets, BlackRock's arrival to the race is notable given its track record for successful application approvals."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9iZXN0LWNyeXB0by10by1idXktbm93LW5vdmVtYmVyLTEwLWxpZG8tZGFvLWV0aGVyZXVtLWNsYXNzaWMtaW1tdXRhYmxlLmh0bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Best Crypto to Buy Now November 10 – Lido DAO, Ethereum Classic, Immutable - Cryptonews",
        "content": "Best Crypto to Buy Now November 10 – Lido DAO, Ethereum Classic, Immutable\n\nLido DAO’s LDO price has jumped over 22% in the past week, positioning it as potentially one of the best crypto to buy now.\n\nLikewise, Ethereum Classic’s ETC price also jumped 12% at yesterday’s close to reach a new multi-month high, exhibiting similarly strong upside price momentum.\n\nIn related news, Immutable gained widespread attention after unveiling a collaboration with leading game publisher Ubisoft to pursue blockchain integration.\n\nAmong crypto presales, Bitcoin ETF Token and Meme Kombat also present themselves as noteworthy Bitcoin alternatives.\n\nBest Crypto to Buy on The News\n\n\n\nLido DAO (LDO) has exhibited impressive growth this month, with its price jumping over 22% over the past week.\n\nThe token reached a resistance level of $2.5, close to its July high of $2.523.\n\nThis performance builds on Lido DAO’s 16% recovery for the past two months and underscores its strong upside potential.\n\nThe Lido community also demonstrated its active involvement recently, as 92% of token holders voted to shut down the Solana project after determining insufficient funds.\n\nThis decision and the overwhelming support for an unspecified recent proposal highlight Lido users’ influence in driving the project forward.\n\n📁 Blackrock files for a spot Ethereum ETF. Ethereum price broke through $2000.https://t.co/Pz3PprUETk — EasyDEX (@EasyDEXorg) November 10, 2023\n\nExternal factors are also affecting Lido’s price as major asset manager BlackRock moves to file for spot Ether ETF. Ethereum’s price has reached over $2,100 – its highest price since April.\n\nThis is also driving Lido’s governance tokens up, showcasing the project’s responsiveness to market conditions.\n\nWith staking capabilities across Ethereum, Solana, Polygon, and other chains, Lido DAO remains well-positioned as a leading staking platform.\n\nEthereum Classic (ETC) has also seen bullish momentum this month. Its price spiked 12.88% to a four-month high of $21.84.\n\nThis aligns with Ethereum’s price rise following the ETF news. The potential for an Ethereum investment product has boosted sentiment around ETC.\n\nWith the Fear & Greed Index at 70, the market mood remains positive. As more users interact with Ethereum, Ethereum Classic stands to benefit from its connected roots.\n\nImmutable (IMX) achieved a nearly 17% price recovery yesterday after bouncing off its 20-day EMA. It is up by an additional 19.85% so far today as it currently trades at $1.0837.\n\nImmutable 🤝 Ubisoft's Strategic Innovation Lab Immutable, the leading web3 gaming platform, is joining forces with Ubisoft's Strategic Innovation Lab to create a new gaming experience to further unlock benefits for players through the power of web3. This is another significant… pic.twitter.com/x3XvHwP0Zd — Immutable (@Immutable) November 9, 2023\n\nBullish news came when Immutable and Ubisoft announced a collaboration to pursue blockchain-based gaming.\n\nBlending Web3 with a top studio like Ubisoft signals a milestone for mainstream crypto adoption.\n\nAmong established cryptocurrencies, crypto presales Bitcoin ETF Token and Meme Kombat are introducing Bitcoin alternatives into the cryptocurrency market.\n\nWhile still evolving, these projects are drawing attention thanks to their potential in the cryptocurrency sector.\n\nWith their impressive price jumps, proactive communities, and mainstream adoption, Lido DAO, Ethereum Classic, Immutable, Bitcoin ETF Token, and Meme Kombat are cementing their status as some of the best crypto to buy now.\n\nLido DAO (LDO) Price Retracement: What Lies Ahead?\n\n\n\n\n\nAfter posting strong gains over the past month, Lido DAO (LDO) price is showing signs of potential weakness, declining over 4% so far today.\n\nWith the LDO price hovering precariously near crucial support levels, traders are debating whether this selloff will mark a local bottom or if the crypto still has room to fall further in the coming days.\n\nThe 20-day EMA for the LDO price currently stands at $1.927, marginally above the 50-day EMA of $1.780.\n\nWhile the crossing of these short and long-term EMAs is typically seen as a bullish indicator, the minimal difference here suggests uncertainty around the LDO price.\n\nInvestors should be cautious about relying solely on this EMA crossover signal.\n\nThe RSI dropped from 75.34 yesterday to 68.15 today. While not yet in oversold territory, this downward momentum indicates fading upside strength that could foreshadow additional LDO price declines.\n\nMeanwhile, MACD continues trending upwards but its histogram narrowed from 0.028 to 0.031, highlighting slowing bullish momentum.\n\nThe LDO price has immediate support at the Fib 0.786 level of $2.279, a break below this level could turn it into resistance and open the door for a steeper drop towards the zone between $2.145 to $2.187.\n\nHowever, if the $2.279 support holds, LDO could stabilize and potentially retest upside resistance between $2.407 to $2.523.\n\nOverall, Lido DAO sits at a pivotal juncture between key support and resistance.\n\nPrudent risk management is recommended while awaiting confirmation of the next major price trend.\n\nA decisive breakout past $2.523 resistance or breakdown under $2.145 support should set the tone for LDO’s near-term outlook.\n\nETC Price Prediction: Will Ethereum Classic’s Rally Withstand the Weakness?\n\n\n\n\n\nAfter posting a strong rally over the past few weeks, Ethereum Classic (ETC) experienced its first signs of weakness today, with the ETC price pulling back from multi-month highs amidst declining momentum.\n\nWith ETC stabilizing above key support levels, technical indicators remain at a crossroads, leaving traders to ponder if this is just a temporary blip or the start of a deeper correction.\n\nThe 20-day EMA for the ETC price currently stands at $17.74, crossing above the 50-day EMA of $16.75 for the first time this year.\n\nTypically, this golden cross is seen as a strongly bullish signal. However, with the crossover occurring so recently and the ETC price already extended, caution may be warranted.\n\nThe RSI has pulled back from yesterday’s overbought reading of 80.46 down to 78.85. While still in overbought territory, this shows bullish momentum is slowing.\n\nThe MACD histogram has risen to 0.33, up from 0.27 yesterday. However, the slowing trajectory suggests upside drive may be fading.\n\nETC is currently trading at $20.56, down 0.58% so far today.\n\nThis places ETC just below horizontal resistance between $20.23 and $20.79, which aligns with the Fib 0.236 level at $20.79. Getting rejected in this area could signal a temporary top is in place.\n\nOn the downside, initial support comes in at the Fib 0.382 level of $19.23. If this fails to hold, ETC could quickly descend towards the 20-day EMA around $17.74 which would equate to a 14% drop from current levels.\n\nWhile the multi-week uptrend remains intact for now, early signs of exhaustion suggest Ethereum Classic may be due for a pullback.\n\nKey levels to watch will be the initial support around $19.23 and resistance at $20.79.\n\nA break above resistance could resume the uptrend, while a drop below the $19.23 support warns of a deeper correction ahead.\n\nTrading within defined risk limits is advised over the near term until ETC’s next move becomes apparent.\n\nIMX Price Skyrockets by 19.85% on Ubisoft Collaboration\n\n\n\n\n\nThe IMX price has seen a dramatic surge today, jumping 19.85% amidst news of a major collaboration with video game publisher Ubisoft.\n\nThis has propelled the price to attempt to break through multiple resistance levels as bullish momentum accelerates.\n\nThe 20-day EMA for the IMX price stands at $0.7763, now well below the 50-day EMA of $0.6784.\n\nWith the faster moving average crossing above the slower moving average, this golden cross is a decidedly bullish sign for the IMX price going forward.\n\nMeanwhile, the RSI has skyrocketed to 81.87, up strongly from yesterday’s 73.79 reading.\n\nThis shows IMX is heavily overbought right now after the huge single-day gain, but still has room to climb before hitting extremely overbought territory.\n\nThe MACD histogram is printing at 0.0298, a sizable increase from the previous day’s 0.0207 value.\n\nThis expanding positive momentum points to building bullish sentiment that could continue pushing the IMX price higher in the very near term.\n\nIn terms of key price levels, IMX faced resistance between $0.9841 to $1.0210, near the Fib 0.382 level at $0.9836.\n\nAfter breaking through this zone, it now faces resistance between $1.0606 to $1.0975, close to the Fib 0.236 level at $1.0969.\n\nOn support, IMX has backing between $0.8925 to $0.9308, aligning with the Fib 0.5 level at $0.8921. As long as the IMX price holds above this zone, the path of least resistance remains up.\n\nWith today’s IMX price surge on big news volume, bulls are clearly in control. However, the big one-day jump also means IMX is overextended on the shorter timeframes.\n\nThis signals traders should wait for a pullback or consolidation before looking for additional entries on the long side.\n\nAny retracement that holds the $0.89 support area could offer a buying opportunity.\n\nOtherwise, remaining patient for IMX to establish a new trading range seems prudent.\n\nAs seasoned cryptocurrencies capture the spotlight, new presale tokens like Bitcoin ETF and Meme Kombat look to make a name for themselves among investors seeking the next moonshot.\n\nChecking Crypto Presales as Bitcoin Alternatives\n\n\n\nBitcoin has dominated the crypto market for years, but investors are starting to look beyond it to find other potential breakout cryptocurrencies.\n\nWhile Bitcoin will likely remain the pillar of the crypto space, its reign may slowly give way to upstart competitors.\n\nBy diversifying your cryptocurrency portfolio beyond Bitcoin, you open yourself to higher reward possibilities, albeit with higher risk.\n\nBitcoin’s relatively stagnant price action recently has spurred interest in finding the next big crypto before it takes off.\n\nOne way to gain early exposure is through presales of new cryptocurrencies.\n\nAlso known as presales, these early bird offers allow you to buy tokens at discounted rates compared to their eventual listing price.\n\nTwo presale tokens aspiring to reach Bitcoin-like adoption one day are Bitcoin ETF Token and Meme Kombat.\n\nBitcoin ETF Token: Capitalizing on the Growing Interest in Bitcoin ETFs – Is This the Best Crypto to Buy Now?\n\nThe cryptocurrency market has seen a resurgence in recent months, with the price of Bitcoin rising above $37,000 on Thursday.\n\nThis recovery has sparked renewed interest in crypto-assets, including a new token called Bitcoin ETF Token.\n\nThe initial coin offering for Bitcoin ETF Token launched just days ago but has already raised over $280,000 so far.\n\nThe token intends to provide exposure to the potential approval of a bitcoin exchange-traded fund (ETF) by the U.S. Securities and Exchange Commission.\n\nUncovering the secrets behind #BTCETF, as it not only readies itself for the #Bitcoin #ETF surge but also introduces staking incentives, fostering network resilience and steadfastness. ✨ pic.twitter.com/9UDNGsOOud — BTCETF_Token (@BTCETF_Token) November 10, 2023\n\nBitcoin ETF Token incorporates features common in decentralized finance (DeFi), including staking rewards.\n\nNearly 33 million tokens have already been staked, earning staking yields of up to 873% APY.\n\nThe staking rewards are dynamic based on the percentage of the staking pool held by each user.\n\nThe possibility of a bitcoin ETF has gained traction recently amid evolving sentiment at the SEC.\n\nWhile firm deadlines are set for proposals by ARK Invest and others, a parallel process for Grayscale Bitcoin Trust has reportedly opened conversations with the SEC.\n\nThe difference between a closed-end fund like Grayscale and an ETF is substantial.\n\nThe potential conversion to an open-ended structure has stoked further speculation of an imminent approval.\n\nThe introduction of a bitcoin ETF would allow mainstream investors easier access to gain exposure to the cryptocurrency.\n\nThis could significantly impact trading volumes and prices given the trillions currently invested in the ETF market.\n\nBitcoin ETF Token provides targeted exposure to a potential ETF approval, while its staking rewards and deflationary token burn offer additional incentives.\n\nThe presale pricing at $0.005 per token has fueled interest in getting in early on one of the best crypto to buy now before its next price increase.\n\nVisit Bitcoin ETF Token Now\n\nMeme Kombat: The Best Crypto to Buy Now for Memes, Gaming, and Gains\n\nMeme Kombat ($MK) seeks to shake up the meme coin market with a one-of-a-kind gaming and betting platform.\n\nThe project has raised over $1.45 million so far in its $MK token presale and introduced a staking feature earning yields of up to 1,518% APY.\n\nMeme Kombat offers a unique blend of blockchain technology and off-chain transactions to facilitate efficient, low-cost staking and gaming.\n\nUsers only pay network fees when staking and unstaking tokens, with all reward claims and gaming interactions gas-less.\n\n📣 Major Update 📣 The Meme Kombat Staking Dashboard is officially live and ready to be used by you! Take a break from Kombat and visit the staking dashboard here: https://t.co/nNFEYESjPs pic.twitter.com/yswl0esb4G — Meme Kombat (@Meme_Kombat) November 9, 2023\n\nThe platform plans to launch its first season of battles after the presale sells out, featuring popular meme coins like Doge, Shiba Inu, and Pepe facing off against each other.\n\nPlayers can bet on the outcome using staked $MK tokens, with winners earning more.\n\nMeme Kombat comes as investors seek greater utility from meme coins beyond funny characters and social media hype.\n\nWith its seamless integration of staking, gaming, and wagering, the project offers real-world use cases in the hot crypto sectors of GameFi and GambleFi.\n\nThe presale price of $MK currently sits at $0.189, rising 10% on November 16.\n\nWith 50% of tokens reserved for the presale, Meme Kombat intends to kickstart a community of engaged users.\n\nThe project passed a smart contract audit and fully doxxed its founder.\n\nAs crypto gaming and gambling surge in popularity, Meme Kombat remains well-positioned to capitalize on this growth with its unique value proposition.\n\nFor meme coin enthusiasts and casual gamers alike, $MK represents an engaging new option worth exploring.\n\nVisit Meme Kombat NowDisclaimer: Crypto is a high-risk asset class. This article is provided for informational purposes and does not constitute investment advice. You could lose all of your capital"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2V0aGVyZXVtLXByaWNlLWV4cGVjdGVkLXRvLWZhY2UtY29ycmVjdGlvbnMtYXMtZXRoLWZ1bmRpbmctcmF0ZS1oaXRzLWEteWVhcmx5LWhpZ2hzLTIwMjMxMTExMDQzMdIBkwFodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy9ldGhlcmV1bS1wcmljZS1leHBlY3RlZC10by1mYWNlLWNvcnJlY3Rpb25zLWFzLWV0aC1mdW5kaW5nLXJhdGUtaGl0cy1hLXllYXJseS1oaWdocy0yMDIzMTExMTA0MzE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Ethereum price expected to face corrections as ETH funding rate hits a yearly highs - FXStreet",
        "content": "Share:\n\nEthereum price trading at $2,050 slid slightly over the past two days, still maintaining gains on a weekly basis.\n\nETH funding rate is presently at a yearly high, which suggests the market is overheated and could correct.\n\nAt the moment, nearly 75% of all ETH holders are in profit, which historically has resulted in profit-taking, bolstering the projected outcome of ETH.\n\nEthereum price followed in the footsteps of Bitcoin and rose to trade above $2,000 in the past month. But the consistent rally seems to be reaching its saturation as the potential of profit-taking and correction is seemingly at its highest at the moment.\n\nEthereum price is nearing a decline\n\nEthereum price, trading at $2,050 at the time of writing, has risen by more than 8.5% in the past three days, nearing the 18-month-old barrier marked at $2,124 that has only been tested once since May 2022.\n\nWith ETH breaching the $2,000 mark, it has inched closer to $2,124, but the chances of a breach are unlikely, given the market is overheated at the moment. Thus, a failed breach would result in a drawdown, bringing Ethereum price back to $2,000, which would send it towards $1,800.\n\nETH/USD 1-day chart\n\nBut if the broader market cues remain bullish or Ethereum witnesses a bullish development, such as BlackRock filing for a spot ETH ETF last week, the cryptocurrency could witness a further rise. This would push ETH beyond the $2,124 mark, invalidating the bearish thesis and sending Ethereum price to tag the resistance level at $2,296.\n\nThe chances of a reversal are high\n\nHigh funding rates generally signal that traders are holding more long positions than short positions and expecting a price rise. However, sustained high rates point to overheated markets, which usually are followed by slight corrections in price. Such is the case with Ethereum as well, given its funding rates are presently at a yearly high.\n\nThe funding rates peaked on November 9 when, according to analytics platform Coinglass, the OI-weighted rate hit a high of 0.0657%.\n\nEthereum funding rate\n\nFurthermore, the investors are also likely to begin profit-taking given at the moment 75% of all ETH holders are at a profit at the moment. According to the Global In/Out of the Money (GIOM), about 37 million ETH worth over $75.8 billion bought at an average price of $1,936 is at the cusp of turning profitable.\n\nEthereum GIOM\n\nThese levels have historically witnessed profit-taking from investors and tend to result in short-term pullbacks. However, as noted by analytics platform IntoTheBlock, this does not significantly impact the long-term outlook for Ethereum, which remains bullish, unless ETH fails a breach of $2,124."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3Lnh0Yi5jb20vaW50L21hcmtldC1hbmFseXNpcy9uZXdzLWFuZC1yZXNlYXJjaC9jaGFydC1vZi10aGUtZGF5LWV0aGVyZXVtLTExLTEwLTIwMjPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Chart of the day - Ethereum (11.10.2023) - XTB",
        "content": "Yesterday, BlackRock has submitted a 19b-4 filing with Nasdaq for the iShares Ethereum Trust, indicating plans to trade shares on the Nasdaq exchange. This move follows a similar process used for the iShares Bitcoin Trust earlier this year and suggests BlackRock might soon propose an Ethereum ETF to the U.S. Securities and Exchange Commission. This development comes amid recent actions by BlackRock, including registering the iShares Ethereum Trust in Delaware and proposing a bitcoin fund in June. Ethereum's price rose following these developments, signaling market anticipation for potential new offerings from the asset management giant.\n\nFrom a technical perspective on the Ethereum chart, following the news of BlackRock registering an entity, the second-largest cryptocurrency surged over 10%. The price momentarily approached its previous peak from the first half of this year at the 2130-2140 USD level. Considering Bitcoin's recent breakout of nearly 20% from its latest highs, there is still potential for Ethereum's growth to continue. Currently, a pullback from these highs is observed, but if the narrative intensifies and capital shifts from BTC to ETH, further growth could continue. The maximum extent of the current upward wave appears to be around the 2500 USD level, which coincides with the support level from the last bull run in 2021 and the 38.2% Fibonacci retracement of the downward move from the 2021 highs to the 2022 low. However, if bulls fail to surpass the current level, we might see a retest of the 1930 USD levels as well.\n\nSource: xStation 5"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vY29pbnBlZGlhLm9yZy9wcmljZS1hbmFseXNpcy9ldGhlcmV1bXMtcHJpY2Utc29hcnMtYW1pZHN0LWJsYWNrcm9ja3MtZXRmLWZpbGluZy1hbmQtZ3Jvd2luZy1uZXR3b3JrLXNlbnRpbWVudHMv0gF7aHR0cHM6Ly9jb2lucGVkaWEub3JnL3ByaWNlLWFuYWx5c2lzL2V0aGVyZXVtcy1wcmljZS1zb2Fycy1hbWlkc3QtYmxhY2tyb2Nrcy1ldGYtZmlsaW5nLWFuZC1ncm93aW5nLW5ldHdvcmstc2VudGltZW50cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Ethereum’s Price Soars Amidst BlackRock’s ETF Filing and Growing Network Sentiments - Coinpedia Fintech News",
        "content": "Zameer is a financial analyst and writer with a particular interest in cryptocurrency markets. He has been studying cryptocurrencies and their market behavior for several years and deeply understands the factors that affect the price of cryptocurrencies. His expertise lies in his ability to use both technical and fundamental analysis to make informed predictions about the future direction of cryptocurrency prices. He has a strong understanding of market sentiment and uses this to inform his trading decisions and price predictions.\n\nEthereum (ETH) price experienced one of its best performing days on Thursday as Bitcoin (BTC) price teased $38k for the first time since the crypto capitulation induced by Terra Luna UST implosion. As of Friday during the early Asian market, Ethereum price has been hovering around $2,120, after an impressive 10 percent rally in the past 24 hours. Consequently, Ethereum investors have seen their portfolios grow by about 65 percent year-to-date (YTD).\n\nEthereum ETF at the Horizon\n\nAmid the heightened altcoin speculations in the past few weeks, the recent Ethereum rally was triggered by the revelation that $9 trillion asset manager blackrock blackrock Fintech SolutionAdvisoryInvestment platform filed to offer an Ethereum exchange-traded fund (ETF). It is worth noting that BlackRock CEO Larry Fink had previously stated he is bullish on crypto as investors flee to quality smart products. The diversification into Ethereum indicates rising demand for the leading intelligent contracts and DeFi ecosystem that will unlock more investments from traditional fund managers, including retirement accounts, in the coming years.\n\nRising Network Sentiments\n\n📈 #Ethereum's market value has jumped +38% in 4 weeks, powered by high network growth. Particularly micro addresses (<0.1 $ETH), which recently surpassed over 100K wallets for the first time. Even the 0.1-10 $ETH and 10K+ $ETH tiers are finally rising. https://t.co/O8kQXJkMxG pic.twitter.com/hvKBepNnDJ — Santiment (@santimentfeed) November 10, 2023\n\nAccording to market intelligence platform santiment santiment On-Chain , the Ethereum ecosystem has recorded a notable spike in network growth in the past few weeks. Specifically, Ether’s micro addresses holding less than 0.1 ETH reached an all-time high (ATH) of around 103k wallets. Similarly, Ethereum addresses holding between 0.1 and 10 ETH jumped by about 12.5k in the past two weeks. As for whale addresses, the Ethereum network added two more large investors with more than 10k ETH balances in their accounts."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjYyNTU1L2JsYWNrcm9jay1maWxpbmctbnVjbGVhci13aW50ZXItZm9yLWV0aGVyZXVtLWRvdWJ0ZXJz0gFdaHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjYyNTU1L2JsYWNrcm9jay1maWxpbmctbnVjbGVhci13aW50ZXItZm9yLWV0aGVyZXVtLWRvdWJ0ZXJz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "BlackRock filing means 'nuclear winter' for Ethereum doubters: analyst - The Block",
        "content": "The price of ether surged over 10% yesterday after BlackRock registered an Ethereum Trust in Delaware and a spot Ethereum ETF with Nasdaq a few hours later, leading to a “nuclear winter for everybody who doubted Ethereum ETH +2.68% ,” according to investment firm Matrixport's Head of Crypto Research and Strategy Markus Thielen.\n\n“A massive short squeeze occurred overnight in ether. The funding rate is the highest ever and signals total panic for shorts,” Thielen said in his DeFi Research report today. “This is nuclear winter for everybody who doubted Ethereum. Market-neutral crypto hedge funds are making a killing with these funding rates. Inflows into crypto hedge funds will be high on the agenda for allocators.”\n\nTrading firm QCP Capital also attributed ether’s outperformance over bitcoin overnight to the BlackRock filing in its latest market report, adding it expects a similar playbook to when the asset management giant applied for a spot bitcoin ETF.\n\nCryptocurrencies traded over $100 billion in volume during the last 24 hours, according to The Block’s price data. Bitcoin BTC +5.83% witnessed $34 billion in trading volume, ether $47 billion and tether $69 billion. Ether rallied to a high of $2,134 overnight and currently trades at $2,098. Bitcoin dropped around 4% from a high of nearly $38,000 yesterday before the BlackRock news, but continues to trade above the $36,000 level at $36,931.\n\nWith ether having lagged behind bitcoin in recent weeks, Thielen argued on Monday that sentiment indicators on the ether/bitcoin ratio indicated that higher beta trades could potentially offer great returns — adding that the Ethereum ecosystem was showing signs of a resurgence as revenues began to recover from previously low levels, suggesting a potential bottom for ether's price.\n\nThat shift was accompanied by an increase in ether's trading volume and a rise in the perpetual futures funding rate for both bitcoin and ethereum, reflecting growing optimism among traders, Thielen noted at the time.\n\nCME bitcoin futures open interest overtakes Binance, but spot ETF approval expected to be delayed until January\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nBitcoin futures open interest on the CME has also overtaken Binance for the first time — a sign that institutions are getting increasingly serious about the space, according to QCP’s analysts.\n\nThere has been a flurry of activity across trading venues as participants continue to bet on Securities and Exchange Commission approval for spot bitcoin ETFs, QCP wrote, compounded by a fear of missing out starting to kick in.\n\n“While we expect the approval for a spot bitcoin ETF to be delayed until Jan. 2024, a new narrative surrounding a spot ether ETF should be enough fuel for animal spirits to take hold once again with crypto prices steadily grinding higher towards the end of the year,” QCP added, arguing that macro developments were also supportive of risk assets.\n\nHowever, “caution is still warranted as we are at crucial resistance levels, and bitcoin is printing a triple bear divergence with the RSI which has been a reliable signal for momentum stalling,” QCP warned.\n\n“Some people still appear skeptical about approving a spot bitcoin ETF, but based on our calculations, the probability is 86%, with the market pricing signaling that the approval is coming soon,” Thielen wrote in his report.\n\n“But most people don’t realize that once the ETF is approved, there will be several weeks before it starts trading, and this window will only see buyers front running the launch. This could be the biggest squeeze,” Thielen added, reiterating his estimation that a BlackRock spot bitcoin ETF could lead to a 48% surge in price."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vYmxvY2tvbm9taS5jb20vZXRoZXJldW0tdHJhZGVycy1leWUtMzAwMC1ldGgtcHJpY2UtYXMtYnVsbHMtdGFyZ2V0LTUwLXByaWNlLXN1cmdlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Traders Eye $3,000 ETH Price as Bulls Target 50% Price Surge - Blockonomi",
        "content": "Ethereum (ETH) bulls are setting their sights on $3,000 for the second largest cryptocurrency by market capitalization as positive momentum continues to build.\n\nAccording to analyst Jacob Canfield, Ethereum could rally over 50% to hit $3,000 within the next few weeks if bulls can firmly break through resistance at $2,100.\n\nKeypoints\n\nTop trader Jacob Canfield believes ETH could reach $3,000 within the next few weeks, but it needs to break past resistance at $2,100 first. ETH hit $2,132 recently, its highest since the May 2022 crash.\n\nETH is up over 33% in the past month on Ethereum ETF prospects and overall crypto market optimism. Over $80 million in shorts were liquidated in the past day.\n\nThe ETH rally has boosted related crypto sectors like DeFi, with total DeFi market cap topping $60 billion again. Ethereum L2 TVL also hit an all-time high above $13.6 billion.\n\nOn-chain analysis shows ETH has little major resistance until $2,500 based on investor cost bases. Most ETH holders are now in profit below current prices.\n\nHistorically, some profit-taking is common around these levels which can lead to pullbacks. But this is unlikely to impact ETH’s long-term trajectory.\n\nThe ETH rally so far has occurred without much involvement from mega ETH whales holding over 10,000 ETH.\n\nETH has already gained over 33% in the past month alone, fueled by a confluence of bullish factors including optimism around a potential Ethereum ETF approval and improving sentiment across the broader crypto sector.\n\nThis week, ETH tagged the crucial $2,100 resistance level before surging to highs around $2,132 – its best level since the devastating market crash in May 2022 induced by Terra’s collapse.\n\nNow, analysts say Ethereum has space to continue running if $2,100 flips to support. This would open the door to a test of $2,500 as the next major hurdle based on on-chain investor distribution metrics. According to data from IntoTheBlock, Ethereum currently has very little resistance from investors that bought around current levels. This suggests limited selling pressure exists between the price now and $2,500.\n\nThere we go. Testing the $2100 resistance zone now. $3k is probably target over the next few weeks https://t.co/IHBYXXQ4sA pic.twitter.com/0glULRTnkb — Jacob Canfield (@JacobCanfield) November 9, 2023\n\nAdditionally, around 75% of ETH holders are now in profit, reducing risks of a mass capitulation. However, some minor pullbacks due to profit-taking at these highs are still likely according to analysts. Historically, assets often consolidate or retrace slightly after such a strong runup before continuing their uptrend.\n\nWhile the mega ETH whales holding over 10,000 tokens have not participated much in the latest advance, Ethereum’s gains have provided a lift to related sectors like decentralized finance (DeFi).\n\nTotal value locked across Ethereum Layer 2 scaling solutions has hit all-time highs above $13.6 billion as ETH demand drives usage of L2 platforms. The combined market cap of DeFi tokens has also surged back above $60 billion.\n\nIf the bulls can maintain their momentum and finally overcome the pivotal $2,100 resistance zone, Ethereum’s path to $3,000 will look increasingly viable over the coming weeks. The on-chain data remains supportive of further gains as long as ETH holds above $2,100.\n\nHowever, as with any rapid rally, the asset remains vulnerable to bouts of volatility and potential profit-taking tests. Traders may want to closely watch how ETH handles the $2,100 level as the next major signal of where the trend is headed."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vZGVjcnlwdC5jby8yMDU1MDEvYml0Y29pbi1ldGhlcmV1bS1kZW1hbmQtcHVzaC0yMDIzLWNyeXB0by1mdW5kLWludmVzdG1lbnQtb3Zlci0xLWJpbGxpb27SAWdodHRwczovL2RlY3J5cHQuY28vMjA1NTAxL2JpdGNvaW4tZXRoZXJldW0tZGVtYW5kLXB1c2gtMjAyMy1jcnlwdG8tZnVuZC1pbnZlc3RtZW50LW92ZXItMS1iaWxsaW9uP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin, Ethereum Demand Pushes 2023 Crypto Fund Investment Over $1 Billion - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nFresh off Bitcoin’s climb past $37,000, CoinShares Head of Research James Butterfill told Decrypt on Friday that investors have poured over $1.07 billion into digital asset investment products so far this year.\n\nThe recent activity represents a notable jump from the $847 million in annual inflows that CoinShares relayed Monday. The report covers allocations to products like Grayscale’s Bitcoin Trust (CBTC) and Bitwise’s 10 Crypto Index Fund (BITW).\n\n“This year is the third largest year on record in terms of just pure inflows,” Butterfill said, noting that CoinShare’s data goes back to 2015. “It's just a lot of demand, a lot of interest, and I've not experienced this level of interest since 2021.”\n\nAD\n\nAD\n\nThe industry weathered a steep drop in digital asset prices last year amid the blowup of several high-profile firms. At the time, Bitcoin fell as low as $15,649 and inflows were relatively subdued at just $389 million, Butterfill said. However, he believes the recent deluge of inflows is representative of a change in sentiment among investors, especially institutions.\n\nDigital Assets, as of yesterday, just surpassed US$1bn of inflows this year so far, as sentiment continues to improve. pic.twitter.com/7qJLPnULrD — James Butterfill (@jbutterfill) November 10, 2023\n\n“When you see very large chunks, then you know institutions really are buying,” he said, acknowledging that the source of inflows into investment products like ETFs is typically hard to tell because allocations are anonymous by nature.\n\nAnticipation for a spot Bitcoin ETF on Wall Street has been the main driver of Bitcoin’s recent rally, analysts say. So far, products associated with crypto’s largest coin have seen $1.03 billion in inflows, representing 96% of allocations this year, according to CoinShares.\n\nThere’s less of a stigma associated with moving capital into digital asset investments now than in times past, Butterfill said, when you have “some of the largest asset managers in the world” like Franklin Templeton and BlackRock wading deeper into crypto waters.\n\nAD\n\nAD\n\nOn Thursday, filings with the Securities and Exchange Commission and NASDAQ suggested that BlackRock is laying the groundwork for an Ethereum-based ETF, analysts said. Over the past week, crypto’s second-largest coin has increased 16% to around $2,100, according to CoinGecko.\n\nAt the same time, Ethereum turned deflationary again as activity associated with altcoins on the network rose. Since CoinShare’s report on Monday, annual outflows associated with Ethereum have decreased by $30 million, shrinking from $107 million to $77 million.\n\n“Investors will slowly realize Ethereum is the only asset which is deflationary and offers a yield,” Butterfill said. “It’s actually quite different than Bitcoin—more like a high-yield tech stock.”\n\nEdited by Stacy Elliott and Andrew Hayward"
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vdWsuZmluYW5jZS55YWhvby5jb20vbmV3cy9kaWFnZW8tdHJhZGUtZGVzay1ldGhlcmV1bS10ZXNsYS10cmVuZGluZy10aWNrZXJzLWZ0c2UtMTEyODM0ODk0Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Trending tickers: Diageo | Trade Desk | Ethereum | Tesla - Yahoo Finance UK",
        "content": "Drinks company Diageo is at the bottom of the FTSE after a profit warning. Photo: Getty (Nguyen Huy Kham / reuters)\n\nShares in drinks company Diageo have tumbled over 14% to the bottom of the FTSE 100 (^FTSE), after it issued a profits warning.\n\nThe spirits giant said it has suffered a steep slowdown in growth in its Latin America and Caribbean division as customers there buy less and trade down to cheaper brands.\n\nThe company said it expects lower growth and profits in the second half of the year.\n\nVictoria Scholar, head of investment at Interactive Investors said: \"Trading down among consumers is a key risk to Diageo’s strategy which has been to focus on quality over quantity. The economic downturn is likely to mean fewer consumers are willing or able to pay more for expensive high margin premium spirits.\"\n\nRead more: LIVE: FTSE and European stocks lower as Powell's comments spark stock sell-off\n\nDiageo makes Johnnie Walker whiskey, Tanqueray gin, Smirnoff vodka, Captain Morgan rum, Guinness stout and Baileys, among other drinks.\n\nThe Trade Desk (TTD)\n\nThe Trade Desk shares plunged 30% in after-hours trading on Thursday after the digital ad company provided guidance that missed analyst expectations.\n\nRevenue in the quarter ending in December will be at least $580m (£474.5m), California-based Trade Desk said in a statement. Analysts, on average, projected $610m, according to data compiled by Bloomberg.\n\nRead more: Stocks that are trending today\n\n\"Q3 was a strong quarter for The Trade Desk as we delivered revenue of $493m, accelerating growth to 25%. This performance underlines the premium that advertisers are placing on precision, agility and transparency as they seek to maximise returns from their campaigns,\" said Jeff Green, co-founder and CEO of The Trade Desk.\n\nThe ad-buying platform works with some of the world’s biggest advertisers and brands, including Warner Bros Discovery Inc (WBD), Walmart Inc (WMT) and NBCUniversal.\n\nEthereum crossed $2,000 as ETF (exchange traded fund) fever continues to buoy the crypto market.\n\nStory continues\n\nThe cryptocurrency surged after BlacRock (BLK) made a filing with Nasdaq (^IXIC) to list an ETF that holds Ethereum’s ether.\n\nIt has also emerged that the corporate entity \"iShares Ethereum Trust\" has already been registered in the state of Delaware. Ishares is the name of BlackRock's ETF division.\n\nRead more: How to spot crypto scams\n\nThe US regulator is currently reviewing multiple spot bitcoin ETF applications, including the one from BlackRock.\n\nThe iShares Ethereum Trust has just been registered in Delaware.\n\n\n\nFor context, BlackRock's iShares Bitcoin Trust was registered in a similar manner 7 days before they filed the ETF application with the SEC. Details below.\n\n\n\n[announcement: I’m moving to @SynopticCom soon] pic.twitter.com/IYafIaxMzA — Summers (@SummersThings) November 9, 2023\n\nTesla (TSLA)\n\nTesla slumped in pretrading as after analysts at HSBC started coverage of the EV car maker with a muted rating and a discounted price estimate.\n\nHSBC analyst Michael Tyndall initiated coverage of Tesla on Thursday with a Reduce (or Sell) rating and $146 price target, implying a 33% drop in Tesla’s stock price.\n\nTyndall also highlighted the company's goal of reaching 20 million deliveries by 2030 as the key medium-term challenge.\n\n“We see considerable potential in Tesla’s prospects and ideas, but we think the timeline is likely to be longer than the market and valuation is reflecting. Hence the Reduce rating,” Tyndall wrote.\n\nWatch: Yahoo Finance Invest 2023\n\nDownload the Yahoo Finance app, available for Apple and Android."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8venljcnlwdG8uY29tL2V0aGVyZXVtLWV5ZWluZy0yNTAwLXByaWNlLWFtaWQtNzUtb2YtaG9sZGVycy1iZWluZy1pbi1wcm9maXQv0gFXaHR0cHM6Ly96eWNyeXB0by5jb20vZXRoZXJldW0tZXllaW5nLTI1MDAtcHJpY2UtYW1pZC03NS1vZi1ob2xkZXJzLWJlaW5nLWluLXByb2ZpdC8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Eyeing $2,500 Price Amid 75% of Holders Being in Profit - ZyCrypto",
        "content": "Advertisement\n\nAfter breaching the psychological price of $2,000, Ethereum (ETH) seems to be going full throttle for the $2,500 price level.\n\nETH had been trying to hit the $2,000 price for a couple of months in vain, but the second largest cryptocurrency based on market cap saw light at the end of the tunnel recently.\n\nAccording to IntoTheBlock’s “In/Out of the Money” parameter, Ethereum does not face any significant resistance until the $2,500 area, with 75% of ETH holders already smiling to the bank.\n\nThe leading on-chain metrics provider disclosed that even though profit-taking is expected at these levels, which could trigger pullbacks, this is currently unlikely because Ethereum is looking at the long-term picture.\n\nTherefore, based on IntoTheBlock’s data, stakes are high that ETH will soar to the $2,500 zone based on the positive outlook being showcased.\n\nAdvertisement\n\nNotably, the number of Ethereum addresses in profit sits at 77.72 million, whereas those in losses are 21.91, according to IntoTheBlock’s statistics.\n\nAn Interesting Tale is Happening Despite Ethereum Hitting $2,000\n\nAli Martinez, a leading market analyst, recently took to X, formerly Twitter, to highlight that despite Ethereum reclaiming the $2,000 threshold, whales were not in the mix because they had not even started buying.\n\nSource: Glassnode\n\nTherefore, this paints a bullish picture on the Ethereum network because if whales buy, the ETH price is destined for greater heights.\n\nThe $2,000 price level illustrates that Ethereum is enjoying a 4-month high because the second largest crypto was in this trajectory in July this year.\n\nZyCrypto recently stipulated that ETH was currently in the $2,000 zone thanks to the world’s largest asset manager, BlackRock, filing for an iShares Ethereum Trust in Delaware, which is similar to the popular spot Bitcoin exchange-traded fund (ETF).\n\nFurthermore, a holding culture was showcased in the Ethereum ecosystem, given that ETH supply on exchanges recently hit historic lows.\n\nETH was up by 12% to hit $2,079 at press time, according to CoinGecko. Therefore, time will tell whether Ethereum will scale to the new high of $2,500."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMivgFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMTAtbm92ZW1iZXItMjAyMy9hcnRpY2xlc2hvdy8xMDUxMTc0NzUuY21z0gHCAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZXMtdG9kYXktbGl2ZS1uZXdzLWJpdGNvaW4tZG9nZWNvaW4tZXRoZXJldW0tc2hpYmhhLWludS1jcnlwdG9jdXJyZW5jeS1sYXRlc3QtdXBkYXRlcy0xMC1ub3ZlbWJlci0yMDIzL2FtcF9hcnRpY2xlc2hvdy8xMDUxMTc0NzUuY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin holds above $36,600, Ethereum jumps 10% as BlackRock files a spot ETH ETF with - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nMajor crypto tokens were trading mixed in Friday's trade with a positive bias. Bitcoin (-0.3%), XRP (-5%), Dogecoin (-2.8%), and Toncoin (-7%) were trading in the red, while Ethereum (9.7%), Solana (5.5%), Polygon (3.6%), Cardano, and BNB were trading in the green.Meanwhile, the global cryptocurrency market cap increased by 1.8% to around $1.4 trillion in the last 24 hours. At the same time, the market cap of Ethereum, the world's second-largest cryptocurrency, surged to $253 billion.On Friday, Ethereum experienced a significant surge, surpassing the $2,000 resistance level with a more than 10% increase. This growth was driven after the asset management giant BlackRock registered to create an Ethereum trust, a potential first step toward asking regulators to approve an exchange-traded fund tied to ether, the second-largest digital token.BlackRock registered the iShares Ethereum Trust as a Delaware statutory trust on Thursday. Nasdaq also filed a proposal on Thursday to list and trade shares of the trust.\"Ethereum has experienced remarkable growth of over 10% in the past 24 hours, surpassing the $2,100 level. This surge is attributed to asset manager Blackrock filing for its iShares Ethereum Trust, paving the way for a potential Ethereum spot ETF,\" said Edul Patel, CEO of Mudrex.At 12.08 p.m., BTC was trading 0.3% lower at $36,628. In the last 24 hours, the market cap of Bitcoin, the world's largest cryptocurrency, declined to $715 billion. Bitcoin's dominance is currently 51.14%, according to CoinMarketCap. BTC volume in the last 24 hours surged 48.65% to $34.1 billion.Bitcoin recently surpassed the $37,000 mark before stabilizing around $36,800 within the last 24 hours amidst positive sentiments surrounding the approval of a US Bitcoin ETF. To sustain its momentum, Bitcoin must now breach the $37,100 level or risk finding support around $36,200, Edul said.BTC's Exponential Moving Average for 10-day EMA indicates “Buy” at 35492 and the 200-day EMA indicates “Buy” at 28497. The Simple Moving Average for 10-day SMA indicates “Buy” at 35481 and 200-day SMA indicates “Buy” at 28606.The Relative Strength Index (14) sits at 83, indicating “Neutral”. The Stochastic %K (14, 3, 3) at 75 and the Average Directional Index (14) at 68 indicate a Neutral outlook.The MACD Level (12, 26), at 1732, indicates “Sell”. The Stochastic RSI Fast (3, 3, 14, 14) at 66 and William's Percentage at -29 indicate “Neutral”."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vZmluYm9sZC5jb20vZXRoMjAteW91ci1zZWNvbmQtY2hhbmNlLXRvLXJpZGUtdGhlLWV0aGVyZXVtLXdhdmUtYW5kLW1ha2UtYS1mb3J0dW5lLWF0LTAtMS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "ETH20: Your Second Chance To Ride The Ethereum Wave And Make A Fortune At $0.1 - Finbold - Finance in Bold",
        "content": "Press Releases are sponsored content and not a part of Finbold's editorial content. For a full disclaimer, please click here. If you encounter any issues, kindly report them to [email protected]. Crypto assets/products can be highly risky. Never invest unless you’re prepared to lose all the money you invest.\n\nHold on to your seats, crypto enthusiasts, because Ethereum (ETH) just made history once again! On November 9th, the world’s second-largest cryptocurrency soared past the $2,000 mark, sending shockwaves through the digital asset space. This momentous achievement marks the first time since mid-2023 that Ethereum has reached such dizzying heights, reminding us all of its unstoppable potential.\n\nBut what exactly fueled this remarkable feat, you ask? It’s none other than BlackRock, the titan of asset management companies, stirring up the crypto world with its plans to create an Ether-based exchange-traded fund (ETF). This groundbreaking development has set tongues wagging and investors scrambling to get their piece of the Ethereum pie.\n\nBut Wait, What’s This About ETH20?\n\nBrace yourselves, because history is repeating itself, and a golden opportunity awaits those who missed out on the initial Ethereum frenzy. Introducing ETH20, the game-changer in the crypto realm. This unique ERC-20 token seeks to recreate the magic of Ethereum’s early days, allowing everyone to snatch up Ethereum at its jaw-dropping initial price of just $0.1. Yes, you read that right!\n\nPrepare to be amazed as ETH20 unveils its master plan. With a total supply of 120 million tokens, it’s time to secure your share of this extraordinary digital asset. During the presale, a staggering 30 million tokens will be up for grabs at the irresistible price of $0.1 each. And that’s not all – an additional 12 million tokens are reserved for LP, while a whopping 78 million tokens are dedicated to staking.\n\nVisit ETH20 Presale\n\nBut What Makes ETH20 Even More Enticing?\n\nGet ready for the staking rewards extravaganza! By staking your ETH20 tokens, you’ll unlock a whole new world of earning potential. The more tokens you stake, the greater your rewards. It’s a win-win situation where you not only benefit from the intrinsic value of ETH20 but also reap the dividends distributed through the ingenious staking contract.\n\nETH20 takes user-friendliness to a whole new level, surpassing Ethereum and other platforms with its superior ease of use. Thanks to Ethereum’s position as the most utilized blockchain after Bitcoin, ETH20 capitalizes on its smart contract capabilities and unmatched flexibility, offering you an unparalleled crypto experience.\n\nNow, let’s talk about how you can acquire these extraordinary tokens. You have the freedom to purchase $ETH20 tokens using ETH, BNB, or USDT (ERC-20, BEP-20). And the best part? ETH20 operates on multiple chains, including Binance Chain, Arbitrum, Base, and OP mainnet, making it accessible to eager buyers worldwide. With a minimum purchase requirement of just 100 ETH20 tokens ($10), everyone can partake in this thrilling opportunity.\n\nHold on tight, because we’re about to reveal an exclusive treat for early birds. Brace yourself for the ETH20 Avatar NFT Collection – a visually stunning series of 10,000 unique NFTs that seamlessly blend pixel art representation of the ETH20 logo with hand-drawn pencil strokes. And here’s the cherry on top: if you purchase a minimum of $200 worth of ETH20 tokens, you’ll be eligible for free minting of one or even multiple NFTs. Talk about an irresistible offer!\n\nLet’s delve into the roadmap of ETH20, shall we? This visionary token has charted an ambitious course with five distinct phases, starting from its foundation and deployment, all the way to scaling, advanced features, and ultimate decentralization. The end goal? To transform ETH20 into a fully decentralized token, with ownership and control widely distributed among the vibrant community.\n\nWhy Should You Buy ETH20?\n\nNow, let’s address the burning question on everyone’s mind: why should you buy ETH20? As the market gears up for a resurgence, investors are on the hunt for the next big thing, and ETH20 is primed to be a major contender in the next market rally. Here’s why:\n\n1. Advantage of Early Entry – Just like the early days of Ethereum, ETH20’s launch phase presents an exhilarating opportunity for investors. Picture this: each token is priced competitively lower, reminiscent of Ethereum’s humble beginnings back in 2014. This means you can join the ETH20 revolution at an attractively low cost, a chance that many deeply regret missing during Ethereum’s initial rise.\n\n2. Green Investment with Passive Returns – ETH20 is all about sustainability. By embracing the eco-friendly Proof-of-Stake protocol, ETH20 allows you to contribute to reducing the environmental impact of cryptocurrencies while reaping lucrative rewards. It’s a win for you and a win for the planet!\n\n3. Far-reaching Prospects – ETH20 is not just a short-term investment strategy; it’s a gateway to long-term opportunities. With a vision of ongoing token release and integration with decentralized applications, ETH20 is poised for substantial expansion. Early involvement in the platform positions investors to reap the rewards of these advances, offering a valuable head-start in the ever-evolving crypto landscape.\n\n4. Staking Mechanism – Here’s where the magic happens. ETH20’s innovative staking rewards system, based on the Ethereum ERC-20 standard, allows token holders to deposit their tokens into the staking pool and earn ETH20 rewards. As of now, over 25 million tokens have been staked in the pool, boasting an impressive projected APY of 167%. That’s some serious potential for sustainable growth, especially when compared to other new coins that often falter within a week.\n\n5. Attractive Pricing – Let’s talk numbers. The $ETH20 token is currently priced at $0.1 in the presale, and with a fundraising effort exceeding $2.5 million and growing anticipation, analysts predict a significant price surge post-IEO. The stage is set for a thrilling journey ahead.\n\nETH20 Price Prediction\n\nNow, let’s turn our gaze to the future. What does the crystal ball say about $ETH20’s price prediction? The early momentum of ETH20 is nothing short of impressive, with a successful fundraising effort driven by robust community support. The platform’s architecture mirrors the original Ethereum model, kicking off at a low cost and progressively releasing tokens. Couple that with its commitment to transparency and decentralization, and you’ve got a recipe for potential growth that’s hard to ignore.\n\nThe plot thickens as potential listings in the next quarters could ignite exponential growth. With fresh liquidity likely to flow into the market in anticipation of the upcoming Bitcoin ETF, Ethereum ETF and 2024 Bitcoin halving event, the stage is set for a thrilling ride. Enthusiasm is abound, and the $ETH20 price prediction suggests a surge, potentially reaching a peak of $10 by the end of 2023 to ring in a Happy Christmas and New Year. That’s a whopping increase of 10,000% from its current price – talk about fireworks!\n\nIs $ETH20 A Good Investment?\n\nBut here’s the million-dollar question: is $ETH20 a good investment? While the future trajectory of ETH20 is still shrouded in mystery, its inception has been nothing short of remarkable, resonating with investors and analysts alike. With a modest hard cap of $3 million, the liquidity of ETH20 may be a drop in the ocean compared to Ethereum’s colossal current market cap of $254 billion. However, ETH20 isn’t just an alternative to Ethereum; it represents a second chance for those who missed out on acquiring Ethereum at $0.1.\n\nSo, for investors eyeing the ETH20 presale, here’s a word of advice: act swiftly, because the price is set to climb steadily until the IEO. ETH20 has the potential to emerge as one of the most promising cryptocurrencies of the moment, and it’s an opportunity that’s not to be missed.\n\nConclusion\n\nAs the crypto world continues to evolve, ETH20 stands at the forefront of innovation, offering a fresh perspective on the digital asset landscape. Now, it’s up to you to seize this electrifying opportunity and become a part of history in the making. With the winds of change at your back, ETH20 invites you to join the revolution and ride the wave of the future. Buckle up, because the journey is just getting started!\n\nVisit ETH20 Presale"
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMimgFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3RvcC0zLXByaWNlLXByZWRpY3Rpb24tYml0Y29pbi1ldGhlcmV1bS1yaXBwbGUtYnRjLXJhZ2VzLW9uLTQwLTAwMC1tYXktbm90LWJlLWhvcGl1bS1hZnRlci1hbGwtMjAyMzExMTAxOTAw0gGeAWh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9hbXAvY3J5cHRvY3VycmVuY2llcy9uZXdzL3RvcC0zLXByaWNlLXByZWRpY3Rpb24tYml0Y29pbi1ldGhlcmV1bS1yaXBwbGUtYnRjLXJhZ2VzLW9uLTQwLTAwMC1tYXktbm90LWJlLWhvcGl1bS1hZnRlci1hbGwtMjAyMzExMTAxOTAw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC rages on, $40,000 may not be hopium after all - FXStreet",
        "content": "Share:\n\nBitcoin (BTC) price is trading with a bullish bias on Friday, bringing the broader market with it, save for Ethereum (ETH) and Ripple (XRP) prices. Both ecosystems are choosing to pursue narratives on their own respective paths.\n\nFor ETH, the spot Ether exchange-traded funds (ETF) narrative is driving its price action, while the XRP market is navigating the waves of regulatory pressure with the ongoing tussle with the US Securities & Exchange Commission (SEC).\n\nAlso Read: BTC rallies to $37,900, fuels bullish outlook among Bitcoin traders\n\nBitcoin, altcoins, stablecoins FAQs What is Bitcoin? Bitcoin is the largest cryptocurrency by market capitalization, a virtual currency designed to serve as money. This form of payment cannot be controlled by any one person, group, or entity, which eliminates the need for third-party participation during financial transactions. What are altcoins? Altcoins are any cryptocurrency apart from Bitcoin, but some also regard Ethereum as a non-altcoin because it is from these two cryptocurrencies that forking happens. If this is true, then Litecoin is the first altcoin, forked from the Bitcoin protocol and, therefore, an “improved” version of it. What are stablecoins? Stablecoins are cryptocurrencies designed to have a stable price, with their value backed by a reserve of the asset it represents. To achieve this, the value of any one stablecoin is pegged to a commodity or financial instrument, such as the US Dollar (USD), with its supply regulated by an algorithm or demand. The main goal of stablecoins is to provide an on/off-ramp for investors willing to trade and invest in cryptocurrencies. Stablecoins also allow investors to store value since cryptocurrencies, in general, are subject to volatility. What is Bitcoin Dominance? Bitcoin dominance is the ratio of Bitcoin's market capitalization to the total market capitalization of all cryptocurrencies combined. It provides a clear picture of Bitcoin’s interest among investors. A high BTC dominance typically happens before and during a bull run, in which investors resort to investing in relatively stable and high market capitalization cryptocurrency like Bitcoin. A drop in BTC dominance usually means that investors are moving their capital and/or profits to altcoins in a quest for higher returns, which usually triggers an explosion of altcoin rallies.\n\nBitcoin price eyes $40,000 with BTC bulls still in play\n\nBitcoin (BTC) price remains on a bullish streak, with the latest breakout sending the king of cryptocurrency out from above the boundaries of an ascending parallel channel. Depending on how the bulls play their hand, BTC could realize more gains as $40,000 is now in sight.\n\nIncreased buying pressure from the bulls could see Bitcoin price extend to clear the range high at $37,972. In a highly bullish case, the gains could extend to the desirable $40,000, with the move constituting a 7% climb above current levels.\n\nThe Relative Strength Index (RSI) remains northbound despite BTC being massively overbought, hinting at a possible continuation of the trend as momentum continues to rise. Bulls have a strong presence in the BTC market, indicated by the position of the Awesome Oscillator (AO) and the Moving Average Convergence Divergence (MACD) in positive territory, which adds credence to the bullish thesis.\n\nBTC/USDT 1-day chart\n\nConversely, increased selling pressure could pull Bitcoin price back into the fold of the ascending channel with the possibility of losing support due to the midline of the channel at $35,500. A break and close below the lower boundary of said channel could see Bitcoin price spiral to the $31,190 level, where the bullish outlook would be invalidated.\n\nNotably, the MACD crossing below the signal line while both bands are above the midline is a warning sign, suggesting a possible sell signal as longs close their positions.\n\nAlso Reads: Bitcoin Weekly Forecast: BTC crashes ahead of ETF approval window, but bull run is not under threat\n\nEthereum price confronts $2,139\n\nEthereum (ETH) price is confronting the $2,139 resistance level, a formidable barrier that could mark the transition of ETH to the side of the fence last tested in May 2022, prior to the collapse of the Terra (UST) ecosystem. The AO is in positive territory with its histogram bars flashing green to show the bulls are in the front row seats.\n\nA break and close above the $2,139 resistance level would set the Ethereum price on a path to more gains, starting with clearing the range high at $2,141.\n\nETH/USDT 1-day chart\n\nOn the flipside, the RSI position above 70 shows ETH is massively overbought. Its deviation south shows momentum is already falling. Both of these stances threaten the upside potential for Ethereum price.\n\nIf seller momentum increases, Ethereum price could fall back into the supply zone, which extends from $1,861 to $2,004. A break and close below its midline at $1,935 would confirm the continuation of the downtrend.\n\nAlso Read: Ethereum price breaks past $2,000 as BlackRock hints at filing for spot Ether ETF\n\nRipple price could slump further after losing $0.66\n\nRipple (XRP) price could shed more ground after losing critical support at $0.66. The RSI is showing that momentum is falling fast. The RSI has already called two sell signals, first crossing the signal line to the downside and second slipping below the 70 level. The overall bullish outlook will be invalidated once the price breaks and closes below $0.59.\n\nXRP/USDT 1-day chart\n\nConversely, if sidelined investors join the party, Ripple price could pull north, restoring optimism above $0.66. However, to confirm the continuation of the uptrend, XRP must break and close above $0.79.\n\nAlso Read: XRP price extends losses as Ripple CEO Garlinghouse calls Gensler's SEC a “political liability”"
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL2NyeXB0b25ld3MuY29tL25ld3MvYmxhY2tyb2NrLWV0aGVyZXVtLWV0Zi1wbGFucy1zcHVyLW9uLWJpdGNvaW4tZXRmLXRva2VuLWludmVzdG9ycy10by10YWtlLWxhc3QtY2hhbmNlLXRvLWJ1eS1hdC1sb3ctMC0wMDUtcHJpY2UuaHRt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "BlackRock Ethereum ETF Plans Spur On Bitcoin ETF Token Investors to Take Last Chance to Buy at Low $0.005 Price - Cryptonews",
        "content": "BlackRock Ethereum ETF Plans Spur On Bitcoin ETF Token Investors to Take Last Chance to Buy at Low $0.005 Price\n\nFriday, November 10, 2023 – The emergence of BlackRock’s Ethereum ETF plans has sent the ETH price surging through the $2,000 mark and has injected even more FOMO into the race to invest in the Bitcoin ETF Token ($BTCETF).\n\nMeanwhile, Bitcoin is trading at $37,400 with bulls targeting $40,000 well before the month is out, while the Bitcoin ETF Token has already attracted $271,000 from eager investors.\n\nBlackRock is the largest asset manager in the financial industry and where it goes others follow. The financial giant has already laid down the gauntlet with its application for a spot Bitcoin ETF. Now it has emerged, following its registration of a corporation in Delaware called the iShares Ethereum Trust, that it wants to bring a spot Ethereum ETF to market too.\n\nLate yesterday Nasdaq filed a listing for the iShares Ethereum Trust, confirming the BlackRock news. iShares is the brand of the BlackRock ETF business.\n\nTo get an idea about why everyone in crypto is so excited about the possibility of a spot ETF, be it Bitcoin or Ethereum, the US ETF market is valued at around $7 trillion. By comparison, the total US equity market is sized at $44 trillion.\n\nExchange-traded funds already exist for crypto assets but in the US they are confined to the regulated futures market, where funds such as the ProShares Bitcoin Strategy ETF (BITO) dominate.\n\nA spot product would provide retail and institutional investors with direct exposure to Bitcoin in a way that futures do not. ETFs will provide all types of investors with cheap and easy exposure to Bitcoin (and Ethereum) using a regulated vehicle. Analysts expect the approval of ETFs to open the floodgates of new money coming into the asset class.\n\nBitcoin ETF Token buyers are getting FOMO\n\n\n\nBitcoin ETF Token’s raise rate for the ICO is speeding up against the backdrop of growing excitement and anticipation for the launch of the first fund on January 10th, or possibly even sooner after an eight-day window for application approval was opened earlier this week.\n\nThe US Securities and Exchange Commission could choose to approve all 12 spot Bitcoin ETFs that have submitted applications, although that is probably unlikely.\n\nNevertheless, analysts at Bloomberg Intelligence believe there is a 90% probability of a spot Bitcoin ETF being approved by the January 10 deadline for the ARK 21 Shares Bitcoin ETF. No wonder the Bitcoin ETF FOMO is reaching a frenzied pitch.\n\nSpot Bitcoin ETF approval will be a thunderbolt signaling new highs ahead for crypto assets – which is why investors want to buy the Bitcoin ETF Token\n\n\n\nThe entrance of a spot crypto collective investment vehicle will unleash a torrent of billions of dollars flooding into the market. The US ETF market is currently valued in the region of $7 trillion when equities and fixed income are combined.\n\nThe first asset class to get the ETF treatment was commodities such as gold. Before ETFs came along, gold was a difficult asset for retail investors to get exposure to. There were liquidity and custody issues to navigate, which meant the bullion market remained the preserve of institutions and government.\n\nThe first gold ETF was launched in 2003 and the exchange-traded fund industry has not looked back ever since.\n\nA Bitcoin ETF and an Ethereum ETF could have an equally consequential effect on financial markets, and that’s why investors are flocking to buy the Bitcoin ETF Token. If the launch of a gold ETF was anything to go by, a spot Bitcoin ETF will be transformational.\n\nSpot crypto ETFs will at a stroke provide retail and institutional market participants with a regulated way to gain exposure to the asset class without having to directly hold Bitcoin or Ethereum.\n\nThe SEC's closing approval window prompts a 90% chance by Jan 10, 2024, per #Bloomberg. As #BTC nears $36K, the #CryptoCommunity anticipates a potential game-changer. In addition to that #BitcoinETF has also hit another milestone, raising over $200K! 🏆 pic.twitter.com/KWoDWm5pF1 — BTCETF_Token (@BTCETF_Token) November 10, 2023\n\nWith only a limited number of Bitcoin in circulation and demand set to rocket, the sky’s the limit on how high the price of crypto assets could go.\n\nAdd into the ETF theme the Bitcoin halving of block rewards that takes place in April 2024, and we could be on the threshold of the biggest Bitcoin bull run ever.\n\nAlong with the ETF tailwind, Bitcoin ETF Token facilitates staking, making it an attractive proposition in the hunt for yield. Although it is true that yields are on the rise in the fixed-income world of bonds, they do not match the heady brew on offer from Bitcoin ETF Token, where APY is still in the hundreds of percent.\n\nWhat is more, the risks associated with yield farming are not present in the Bitcoin ETF Token ecosystem, as the source of the yield is the tokens allocated from supply specifically for distributing rewards.\n\n$BTCETF has a deflationary burn mechanism yield to real-world Bitcoin ETF approval, launch and performance milestones\n\n\n\nBitcoin ETF Token is deflationary – it has a burn mechanism that is price-supportive because it reduces the total token supply.\n\nAt launch, the Bitcoin ETF Token will have a 5% burn on all transactions, while up to 25% of the total token supply is eligible to be burned.\n\nAll the burn mechanism events are triggered by real-world events related to spot Bitcoin ETF milestones, such as the first approval and launch dates, among other things.\n\nThere are also triggers related to the performance of the $BTCETF token. For example, when the trading volume of $BTCETF hits $100 million the transaction tax is reduced from 5% to 4%. Other milestones include the approval date of the first spot Bitcoin ETF, at which point the sales tax is reduced from 4% to 3%.\n\nCrypto YouTuber Micheal Wrubel with 310,000 subscribers is supper bullish on $BTCETF, as he explains in his day-old video which has already amassed 20,000 views:\n\nAustin Hilton with 235k subscribers on YouTube is another $BTCETF fan. He tells his audience that $BTCETF is “like nothing you have ever seen,” as he encourages his viewers to find out more.\n\nThoughtful design decisions are crafted with the intention of maximizing FOMO and tokenholder returns as the crypto ETF frenzy builds.\n\nIf you are looking to position your investment portfolio to profit from the coming price explosion in crypto before the rest of the crowd, then buying Bitcoin ETF Token is the best opportunity on the market today."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZGVjcnlwdC5jby8yMDU1NDAvcGV0LXJvY2stanBlZ3MtYml0Y29pbi1ldGhlcmV1bS1zZWxsLW92ZXItMTAwa9IBTmh0dHBzOi8vZGVjcnlwdC5jby8yMDU1NDAvcGV0LXJvY2stanBlZ3MtYml0Y29pbi1ldGhlcmV1bS1zZWxsLW92ZXItMTAwaz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Here We Go Again: Pet Rock JPEGs on Bitcoin, Ethereum Sell for Over $100K - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThis week, half-giddy, half-cautious optimism spread across crypto circles as Bitcoin surged past $37,000 for the first time in 18 months on excitement regarding the approval a spot Bitcoin ETF, and Ethereum pumped past $2,100 on similar news of a pending ETH ETF application from BlackRock.\n\nThere’s clearly an emergent hope within crypto that the bottom—finally—is in. But to those who protest that it could never be a true bull market without obscenely expensive, seemingly pointless JPEGs trading hands: there’s now reason to rejoice on that front as well.\n\nOn Friday, two separate on-chain images of illustrated rocks—one hosted on Ethereum as an NFT, the other inscribed on Bitcoin as an Ordinal—sold for six-figure respective sums on secondary markets.\n\nAD\n\nAD\n\nAn NFT from the EtherRocks collection, EtherRock #95, traded hands this morning for 100 ETH, or just over $209,000. Just hours prior, an Ordinal from the visually identical Bitcoin Rock collection sold for 2.99 BTC, worth just over $111,000 at writing.\n\nThe JPEGs do not come with any affiliated memberships or perks, or anything that doesn’t meet the eye. They are, quite simply, lightly illustrated images of nearly indistinguishable gray boulders that don’t even feature backgrounds.\n\nBitcoin Rock #75 has sold for 3btc on the secondary market. Congratulations to @Scobra9000 on the sale. A warm welcome to @GrantWSchneider, already a legendary collector in the ordinals community, who has now taken it to the highest level. pic.twitter.com/wkqkk8Kbn9 — BITCOIN ROCKS ◉ (@ordrocks) November 10, 2023\n\nDumb as rocks?\n\nEtherRocks first launched in 2017 to little fanfare. Only during the height of the NFT bull run, in late 2021, did the 100-piece collection catch fire—largely as a means to poke fun at the absurdity of value and the crypto market. Individual EtherRocks regularly sold at the time for hundreds of thousands of dollars a piece; one sold for the equivalent of $1.3 million.\n\nAD\n\nAD\n\n“Monetary value of art is all an illusion,” an EtherRocks buyer wrote at the time. “The pet rocks present the perfect shock value, it’s so stupid that it’s perfect. Fate loves irony.”\n\nIn January, an apparently unaffiliated Ordinals user inscribed a set of 100 images almost identical to the EtherRocks onto small denominations of Bitcoin, creating a new collection: Bitcoin Rocks. While that Ordinals collection has not enjoyed the same success as its Ethereum predecessor, it has generated five-figure secondary market sales in recent months.\n\nIn the context of recent market trends, though, Friday’s sales appear to be hitting differently. Numerous Twitter users saw the news as a harbinger of the return of the type of obscenity, absurdity, and flagrant financial foolishness that defined the previous crypto bull run.\n\nLol that scam again.\n\nWe're so back — Dr.M₳ryJ⚡I buy Shitcoins,I hold ₿itcoin ❤₳d₳ᴺᶠᵀ𓊽 (@mary_el83) November 10, 2023\n\nMembers of the crypto community appear divided about whether that’s a good thing or a bad thing.\n\nThis space never fails to amaze me — sugarspicysauce (@sugarspicysauce) November 10, 2023\n\nBut despite the return of bull market antics, crypto activity is nowhere close to the levels enjoyed when EtherRocks were last ascendent. Though Bitcoin Ordinals trading did indeed hit a six-month high earlier this week, and NFT trading volume posted its best numbers since August, those numbers still pale in comparison to the type of volume witnessed during the 2021/2022 NFT bull run.\n\nLast week’s apparently encouraging NFT figures, for example, marked a 93% decrease in trading volume from the market’s peak in April 2022. But these pricey digital rock purchases point to at least a desire for the same kind of frothy, frenzied excitement that defined that earlier era.\n\nAD\n\nAD\n\nEdited by Andrew Hayward"
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL3RoZS1jcnlwdG8tc2hvd2Rvd24taXMtc29sYW5hLXRoZS1uZXh0LWV0aGVyZXVtL9IBT2h0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL3RoZS1jcnlwdG8tc2hvd2Rvd24taXMtc29sYW5hLXRoZS1uZXh0LWV0aGVyZXVtL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "The Crypto Showdown: Is Solana The Next Ethereum? - Coinpedia Fintech News",
        "content": "Qadir Ak is the founder of Coinpedia. He has over a decade of experience writing about technology and has been covering the blockchain and cryptocurrency space since 2010. He has also interviewed a few prominent experts within the cryptocurrency space.\n\nIn recent years, the solana solana Blockchain Network blockchain witnessed a series of challenges from network halts to the crypto winter and the downfall of the FTX exchange.\n\nHowever, it’s making a comeback with 100% uptime this year and a significant increase in total value locked (TVL) in decentralized finance (DeFi), reaching $415 million from $210 million at the start of 2023. Perhaps some believe that Solana could be the Next Ethereum.\n\nSolana Catching Up with Ethereum\n\nSolana is making a comeback, catching the eye of sceptics who are now cheering for SOL. After a recent price surge that saw $SOL jump almost 400% from its lows in late 2022, critics are turning into supporters. But, when stacked against Ethereum, many believe that it could be the next Ethereum or surpass it.\n\nOPINION: IS SOLANA THE NEXT ETHEREUM?\n\n\n\n– @Solana has experienced a resurgence in interest in recent weeks, with those who previously condemned the project miraculously pivoting to become #SOL-maxis.\n\n\n\n– But take the hype with a pinch of salt…\n\n\n\nSolana Still Well Behind\n\n\n\n– The… pic.twitter.com/SdbHU4RlgX — BSC News (@BSCNews) November 9, 2023\n\nEven though Solana’s TVL has aggressively climbed, reaching $415 million at the beginning of 2023, it’s important to note that it still has quite a journey ahead to hit its all-time highs. Comparatively, it’s nowhere near Ethereum’s impressive $24.4 billion.\n\nMeanwhile, in terms of developer activity Solana rank 5th among the most developed ecosystem, but it trails behind Ethereum, Polkadot, and Cosmos, sitting 50% lower than a year ago.\n\nInstitutional Adoption\n\nNotable companies have already taken this step, with Visa announcing in September 2023 that it would incorporate Solana as a settlement layer to enhance cross-border USDC stablecoin payments.\n\nAdditionally, global e-commerce giant Shopify revealed its integration of the Solana Pay system in collaboration with Mastercard. These strategic moves by major players signal a growing acceptance of Solana’s capabilities and potential impact on the broader financial landscape.\n\nRevealing Daily Activity\n\nSolana shines in daily transactions, surpassing Ethereum by 15-20 times, thanks to low fees and fast transaction times. However, when focusing on actual users, Solana needs more users to catch up with Ethereum.\n\nEven with Layer2 networks on Ethereum, the scale of activity and transaction value remains higher in Ethereum’s favor.\n\nAs Solana keeps going, it’s showing it can handle challenges and grow. But calling it “the next Ethereum” means it has to fill some big gaps in different things. The surge in support and positive metrics signals potential, but a balanced perspective is essential when assessing its progress."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY29pbmdhcGUuY29tL2V0aC1wcmljZS1zaG9vdHMtMTAtYW1pZC1tYXNzaXZlLXN1cmdlLWluLWV0aGVyZXVtLWFkZHJlc3Nlcy1uZXh0LTI1MDAv0gFgaHR0cHM6Ly9jb2luZ2FwZS5jb20vZXRoLXByaWNlLXNob290cy0xMC1hbWlkLW1hc3NpdmUtc3VyZ2UtaW4tZXRoZXJldW0tYWRkcmVzc2VzLW5leHQtMjUwMC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Ethereum ETF: ETH Price shoots 10% After BlackRock Ethereum ETF Filing, Next $2500? - CoinGape",
        "content": "The world’s second-largest cryptocurrency Ethereum (ETH) joins the mega rally in the altcoin space with the ETH price shooting by a staggering 10%. As of press time, ETH is trading 10.36% up at a price of $2113 with a market cap of $254 billion.\n\nETH Addresses Shoot\n\nThe recent Ethereum price rally comes amid a strong accumulation of ETH addresses across all cohorts. On-chain data provider Santiment reported that in the past four weeks, Ethereum has experienced a significant surge in its market value, witnessing a remarkable increase of +38%.\n\nadvertisement\n\nThis surge is attributed to substantial growth in the network. Notably, the number of micro addresses holding less than 0.1 ETH has exceeded 100,000 wallets for the first time. Additionally, there is a notable upward movement in the 0.1-10 ETH and 10,000+ ETH tiers.\n\nAmid the recent ETH price rally, ETH has managed to overcome a major supply wall at $2,030. As per popular crypto analyst Ali Martinez, the ETH price has not further stopped until $2,500.\n\nBlackRock Ethereum ETF\n\nThe biggest trigger to the Ethereum price rally today is the filing of the spot Ethereum ETF by the world’s largest asset manager BlackRock.\n\nDelaware’s Division of Corporations website displayed the registration of an iShares Ethereum Trust on Thursday. This development mirrors a pattern observed in June when BlackRock filed for a Bitcoin ETF shortly after a similar notice for the iShares Bitcoin Trust.\n\nUPDATE: BlackRock #Ethereum ETF confirmed. They just submitted a 19b-4 filing with Nasdaq pic.twitter.com/pLhuhhK7jo — James Seyffart (@JSeyff) November 9, 2023\n\nNote that BlackRock is not the first to file for a spot Ethereum ETF. So far there have been seven applications submitted to the US SEC by players such as VanEck, ArkInvest, 21Shares, Invesco, Hasdex, and Grayscale.\n\nAlong with Ethereum, several altcoins have joined the recent rally. Oracle service provider Chainlink has recorded 100% gains over the past three weeks. On the other hand, Ethereum’s layer-2 platform Polygon is also seeing a sharp rally in its native token MATIC eyeing $1.\n\nAmid the current developments, popular crypto analyst Lark Davis said: “Blackrock will get Bitcoin, Ethereum, and yes eventually Chainlink, Solana, etc ETFs. This cycle is when the institutional money shows in big time. It also means it could be the last cycle for insane life changing generational wealth”."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL3d3dy5ibG9ja2NoYWluLWNvdW5jaWwub3JnL2Jsb2NrY2hhaW4vcG9seWdvbi10ZWNobm9sb2d5LXRvcC0xMC1wYXJ0bmVyc2hpcHMtZGVwaWN0aW5nLXRoZS1yaXNlLW9mLWxheWVyLTItZXRoZXJldW0tc2NhbGluZy1zb2x1dGlvbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Polygon Technology: Top 10 Partnerships Depicting The Rise Of Layer-2 Ethereum Scaling Solution - Blockchain Council",
        "content": "Polygon Technology: Top 10 Partnerships Depicting The Rise Of Layer-2 Ethereum Scaling Solution\n\nAyushi Abrol\n\nSummary\n\nPolygon Technology, a leading Blockchain-based service provider, is expanding globally despite the bearish crypto market and rising popularity of NFTs.\n\nPolygon has formed partnerships with major brands like Nike, Starbucks, Reddit, Mastercard, Adobe, Disney, Meta, Adidas, Mercedes, and Google Cloud.\n\nNike collaborates with Polygon to create a digital marketplace for NFTs and digital fashion items, aiming to revolutionize fashion, gaming, and technology intersections.\n\nStarbucks’ partnership with Polygon introduces a novel loyalty program incorporating digital assets, enhancing customer interaction and loyalty rewards.\n\nMastercard’s Artist Accelerator Program on Polygon mentors artists, empowering them to utilize Web3 technologies like NFTs for music distribution and fan engagement.\n\nAdobe plans to transform Behance into an NFT marketplace, listing NFTs minted on Polygon, expanding its reach for NFT artists and creators.\n\nDisney uses Polygon’s Blockchain to develop Disney+, offering secure digital collectibles experiences to fans, potentially transforming fan engagement.\n\nMeta collaborates with Polygon to launch their NFT platform within the Metaverse, creating secure spaces for users to collect and trade digital assets.\n\nAdidas partners with Polygon to explore digital ownership and customer engagement through NFTs, aligning with their digital innovation strategy.\n\nReddit integrates with Polygon to enhance user interaction by providing a more efficient way to manage community points, demonstrating Blockchain’s potential in social media.\n\nPolygon’s technology benefits businesses by offering scalability, low transaction costs, interoperability with Ethereum, smart contract support, DApp development, community support, and ecosystem growth.\n\nThe rise of Web3, Metaverse, NFTs, and Blockchain technologies prompts businesses to adapt, with Polygon playing a key role in NFT marketplaces and related applications.\n\nThe bearish mode of the crypto market, development in Blockchain technology, and increasing popularity of NFT in the global market are some buzz news. Despite all these, Polygon Technology, the leading Blockchain-based service provider, is making aggressive moves worldwide. Several industrial leaders from different domains, from finance to games, have partnered with Polygon Technology to transform their web architecture.\n\nThe concept of non-fungible tokens (NFTs) is one of the most popular polygon solutions in the market and paves the way for scalability in the Ethereum industry. The leadership at Polygon still considers the technology to be in the early development stages, and according to them, the best days are still yet to come.\n\nThis article discusses the reason behind the change in the strategy of Polygon Technology and its top partnerships that are leading the path toward mainstream Blockchain & crypto adoption. We will also present the Blockchain Council’s take on the aggressive growth of Polygon Technology with some insights on how it benefits you and millions of Blockchain believers.\n\nTop 10 Partnerships of Polygon with Global Brands\n\nPolygon has become one of the top Blockchain service providers around the globe that has partnered with more than ten top-tier brands. Companies like Nike, Starbucks, Reddit and others have launched their non-fungible tokens as an introductory web 3 product. We have brought together the top 10 polygon partnerships that brought polygon technologies among the top-rated Blockchain technology service providers. Ready to go?\n\nLet’s get started:\n\nNike\n\nNike’s partnership with Polygon centers around their Swoosh platform, which is conceptualized as a digital marketplace. This marketplace is not just a trading space but an innovation hub where Nike aims to offer NFTs and digital fashion items. By leveraging Polygon’s Blockchain, Nike intends to create a seamless and interactive virtual experience that could potentially revolutionize the intersection of fashion, gaming, and technology. This collaboration is particularly significant as it brings a major fashion and sports brand into the fold of Blockchain and Web3 technologies, which could encourage other brands to explore similar avenues.\n\nStarbucks\n\nStarbucks’ collaboration with Polygon was brought to life with the Starbucks Odyssey experience, a part of their larger Web3 project. This partnership is transformative for the customer experience, as it introduces a novel loyalty program that incorporates the collection and trading of digital assets. Through Starbucks Odyssey, customers can engage with the brand in a more immersive way, earning NFTs as rewards that can unlock unique experiences and benefits. Polygon’s technology facilitates a more interactive and community-focused platform, aiming to enhance the way consumers interact with loyalty programs.\n\nMastercard\n\nMastercard initiated the Artist Accelerator Program on the Polygon Blockchain, with a vision to empower new musical talent. The program is designed to mentor artists, aiding them in leveraging Web3 technologies to build their brands and fan engagement. Artists get to learn about and utilize NFTs and other Blockchain functionalities to innovate in music distribution, fan experiences, and brand partnerships. This program marks an important step in bringing the music industry into the Blockchain era, providing tools and knowledge for artists to thrive in a digital ecosystem.\n\nAdobe\n\nAdobe has a community hub of elite artists around the globe. It also has its separate platform, namely Behance. Behance was launched in 2005 as a platform for developers, creators and artists to showcase their talent to potential collaborators and fans worldwide. Currently, the platform has a massive active user base of 10 million. The company is excited to level up Behance as an NFT marketplace to transition its presence for NFT artists and creators. The collaboration between Polygon and Adobe allows them to list their NFTs minted on Polygon. Adobe actively plans to scale its reach by partnering with Polygon\n\nDisney\n\nThe collaboration with Disney involves the entertainment giant using Polygon’s Blockchain to develop its own NFT platform called Disney+. This allows Disney to offer a digital collectibles experience to its audience, ensuring security and efficiency in the collection and trade of these assets. With its broad intellectual property portfolio, Disney’s foray into NFTs could mean a new way for fans to engage with their favorite characters and franchises. Polygon’s scalable infrastructure is critical to accommodating the potentially high demand and transaction volume that a company like Disney can generate.\n\nMeta\n\nMeta’s partnership with Polygon is focused on launching their NFT platform within the Metaverse. The aim is to create a secure, efficient ecosystem for Meta’s users to collect and trade digital assets, possibly including digital art, virtual real estate, or other Metaverse components. This could significantly impact how social media and virtual interactions occur, transforming Meta’s platforms into spaces where digital goods are not just showcased but actively traded and authenticated via Blockchain. Polygon’s role is to provide the technological foundation for these transactions, ensuring they are conducted smoothly and with minimal transaction fees.\n\nAdidas\n\nIn the sports apparel domain, Adidas entered the Blockchain space by partnering with Polygon to launch its own NFT platform, Adidas Originals. The collaboration aims to explore the possibilities of digital ownership and new forms of customer engagement through NFTs. With Polygon’s Blockchain technology, Adidas can provide a secure and scalable platform for its customers to buy, sell, and trade digital assets tied to apparel and possibly exclusive experiences or products. This move aligns with Adidas’ strategy to innovate in the digital space and offer more value to its brand enthusiasts.\n\nMercedes\n\nWhile the specific details of the partnership between Polygon and Mercedes were not detailed in the initial search results, the luxury automobile manufacturer’s foray into the Blockchain space with Polygon suggests an interest in exploring the use of NFTs or other Blockchain-based initiatives. This could involve unique digital collectibles, enhancing the customer experience, or leveraging Blockchain for supply chain transparency. Given the stature of Mercedes in the automotive industry, their partnership with Polygon is likely to be watched as a bellwether for Blockchain adoption in the sector.\n\nReddit\n\nReddit has been actively experimenting with community points and tokens on Blockchain platforms, and their partnership with Polygon indicates a focus on utilizing Blockchain for decentralized community engagement. By integrating with Polygon, Reddit can provide its users with a more efficient and cost-effective way to manage community points, which serve as a measure of reputation and contribution within Reddit’s various sub-communities. The collaboration is pivotal in demonstrating how social media platforms can leverage Blockchain to enhance user interaction and value exchange.\n\nGoogle Cloud\n\nThe partnership with Google Cloud signifies a major step for Polygon in the enterprise Blockchain space. This multi-year partnership is geared towards accelerating the adoption of Blockchain technology within enterprise solutions. Google Cloud’s infrastructure combined with Polygon’s Blockchain technology enables enterprises to deploy and manage Blockchain applications more efficiently. This collaboration has the potential to bring Blockchain’s benefits, such as transparency and security, to a variety of business applications across industries.\n\nWhy Are Businesses Investing In Web 3.0 Space?\n\nWeb 3, Metaverse, NFTs, Blockchain, and Decentralization have been trending for some time now. The increased demand for Blockchain technology and Facebook renamed Meta, has compelled businesses to adapt to web 3.\n\nHowever, despite a broad portfolio, most businesses are using Polygon’s technology to build NFT marketplaces or NFT-related applications. Apart from NFTs, Polygon also deals in decentralized applications and finance solutions. These services include helping a business from payments to basic mobile and web applications and safer and more secure data sharing to more efficient data management and storage.\n\nAs statically reported, the NFT marketplace also has an impressive compound annual growth rate of 33.9% and projects a market value of $211.72 billion by 2030. The market size of Web3, encompassing Blockchain, NFTs, and the Metaverse, is estimated to reach a staggering $81.5 billion by 2030.\n\nIn 2021, the banking and financial sector accounted for 33.0% of the total Web3 Blockchain market. These sectors benefit from the scalability and efficiency of Web3 technologies. Furthermore, other industries such as IT, media, retail, and e-commerce are increasingly embracing Web3, contributing to its expanding market. Notably, the Metaverse, a part of Web3, is projected to have a value of $678 billion by 2030.\n\nLeading companies in the Web3 space include Binance, Polkadot, Braintrust, OpenSea, Immutable, Helium Systems, and Spatial. For instance, OpenSea alone was valued at $13.3 billion as of January 2022.\n\nA recent survey found that 54% of participants expressed a desire for more companies to accept cryptocurrencies, indicating a growing interest in digital currencies for transactions. This trend is reinforced by the significant advertising spending by the Web3 community during events like the US Super Bowl, demonstrating increased mainstream exposure.\n\nApart from it, here are a few benefits of shifting to the web 3 architecture:\n\nDecentralization: Web 3.0 is all about decentralization. Unlike the current Web 2.0, where big companies control most things, Web 3.0 aims to give more power to users. This means users can become owners and have more control over the content and services they use.\n\nShared Economic Model: In Web 3.0, the idea is to have a “winners-share-all” approach. This means that everything is built and managed collectively, and the benefits are shared among all the people involved. This encourages innovation and user-focused products and services.\n\nImproved Security and Transparency: Web 3.0 promises better security and a focus on being transparent and accountable. This is crucial because people are increasingly concerned about their data privacy and want to trust the services they use.\n\nEconomic Activity and Financial Innovation: Web 3.0 is not just a concept; it’s happening right now. It’s already facilitating trillions of dollars in economic activity. The use of Blockchain technology and decentralized finance is changing how we do transactions, making them more secure and efficient.\n\nWhy Do Businesses Choose Polygon?\n\nPolygon is beneficial for businesses for several reasons:\n\nScalability: Polygon allows businesses to scale their operations without worrying about high transaction fees and slow transaction times, which are common issues on the main Ethereum network.\n\nLow Transaction Costs: Transactions on Polygon are faster and cheaper compared to the main Ethereum network. This low transaction cost is especially important for businesses that conduct numerous transactions daily.\n\nInteroperability: Polygon is compatible with Ethereum, which means businesses can seamlessly move assets and data between the two networks. This interoperability opens up a wide range of possibilities for businesses in terms of partnerships and collaborations.\n\nSmart Contracts: Polygon supports smart contracts , which are self-executing contracts with the terms of the agreement directly written into code. This automation can streamline various business processes, reducing the need for intermediaries and saving both time and money.\n\nDApp Development: Businesses can build decentralized applications (DApps) on the Polygon network. These DApps can provide unique services or products, and the decentralized nature ensures security and transparency, which can attract more users.\n\nCommunity Support: Polygon has a vibrant and active community of developers and enthusiasts. Being part of this community can provide businesses with valuable insights, support, and potential collaborations.\n\nEcosystem Growth: As more projects and businesses adopt Polygon, the ecosystem continues to grow. This growth leads to more opportunities for businesses, including partnerships, investments, and customer acquisition.\n\nWhat’s In It For You?\n\nYou might be questioning the profitability angle from the popularity of Polygon’s Ethereum scaling solutions and their partnerships with top global brands leading the mass adoption of Web3, Metaverse and NFT space. The increased demand for the end product will primarily affect the supply scale. A career in the NFT domain to develop and create quality NFTs can be a better alternative than the most nuanced career options globally.\n\nConclusion\n\nProfessionals worldwide are interested in upskilling to join the NFT creator space. Non-fungible tokens are the key to a new era of digitization in a virtual space. Since this new generation of the internet is more intended towards ownership and ‘for the people, by the people; generating career opportunities is now more straightforward, accessible and quicker than ever. Check out our Certified NFT Expert and Certified Polyon Expert certification courses and get one step closer to your career in the Web3 & Blockchain industry.\n\nFrequently Asked Questions\n\nWhat brands are on Polygon?\n\nPolygon has partnered with various well-known brands, including Nike, Starbucks, Mastercard, Adobe, Disney, Meta (formerly Facebook), Adidas, Mercedes, Reddit, and Google Cloud.\n\nWho are the big investors in Polygon?\n\nPolygon has received investments from prominent venture capital firms and investors, including Binance, Coinbase Ventures, Mark Cuban, and Galaxy Digital, among others.\n\nWhy do brands choose Polygon?\n\nBrands choose Polygon for its scalability, low transaction costs, interoperability with Ethereum, support for smart contracts, decentralized application (DApp) development, active community support, and growing ecosystem.\n\nThese features make it attractive for businesses looking to enter the NFT space and explore Blockchain technologies.\n\nDoes Polygon have a good future?"
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vZmluYm9sZC5jb20vdGhlLXBvc3NpYmlsaXR5LW9mLWFjaGlldmluZy13ZWFsdGgtdGhyb3VnaC1pbnZlc3RtZW50cy1pbi1ldGhlcmV1bS1vcHRpbWlzbS1hbmQtdmMtc3BlY3RyYS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "The Possibility of Achieving Wealth Through Investments in Ethereum, Optimism, and VC Spectra - Finbold - Finance in Bold",
        "content": "Press Releases are sponsored content and not a part of Finbold's editorial content. For a full disclaimer, please click here. If you encounter any issues, kindly report them to [email protected]. Crypto assets/products can be highly risky. Never invest unless you’re prepared to lose all the money you invest.\n\nA popular trader predicts an Ethereum (ETH) rally. Optimism (OP) is making a huge private sale. Meanwhile, VC Spectra (SPCT) is chasing a 900% surge.\n\nWhat is this trader’s Ethereum price prediction? How has the huge sale impacted Optimism’s (OP) price? How is VC Spectra (SPCT) more profitable than the top altcoins? Let’s answer the questions.\n\n>>BUY SPCT TOKENS NOW<<\n\nSummary\n\nThe Ethereum price prediction for 2024 is $6,381.87.\n\nOptimism (OP) could surge to $2.44 in 2024.\n\nVC Spectra (SPCT) offers token holders mouth-watering benefits.\n\nAnalyst Predicts Ethereum (ETH) Surge\n\nOn November 3, 2023, a popular trader on X @Bluntz_Capital predicted that Ethereum (ETH) would soon rally. He said: “I think “the dip” is done, and we at least go for one more high above 1880 from here.”\n\neven though $eth has been the bane of my existence because ethbtc has been a perpetual bag of shit i still think there's a nice flat setup here on the usd pair with 5 down now done and a nice LTF div to confirm it.\n\n\n\ni think \"the dip\" is done and we atleast go for one more high… pic.twitter.com/wloysp0Pma — Bluntz (@Bluntz_Capital) November 3, 2023\n\nThis analyst, who correctly predicted Bitcoin’s 2018 floor price, said that Ethereum (ETH) is done with its last price correction. He said Ethereum (ETH) will cross $1,900 in the short term.\n\nBluntz used the Elliot Wave Theory to come up with this prediction. This technical indicator uses crowd psychology, which it measures in waves, to make forecasts.\n\nAfter Bluntz’s X post, Ethereum (ETH) has soared 4.8% from $1,800.92 to $1,888.12. The short-term rally to $1,900 he predicted seems to be in motion.\n\nSwitching to the long-term Ethereum price prediction, ETH could reach $6,381.87 in 2024. The predicted 2024 bull run is predicted to drive this surge.\n\nShould I buy Ethereum? Analysts say buying ETH now might be a good decision.\n\n$160 Million Worth Of Optimism (OP) Tokens Sold In Private Sale\n\nOn September 20, Optimism (OP) announced on X that it was beginning the sale of 116 Optimism (OP) tokens. The tokens, worth about $160 million then, were sold to seven investors for treasury management purposes.\n\nHowever, this move has generated concern that the Optimism (OP) team is dumping its tokens. However, analysts say the action will not affect Optimism coin price because it is a private sale. Also, the tokens are being withdrawn from the unallocated segment of the treasury, which is not part of the circulating supply.\n\nSince the announcement, Optimism coin price has surged 8.6% from $1.39 to $1.51. This surge resulted from the ongoing crypto rally, as Optimism coin price fell 6.5% to $1.30 immediately after the announcement.\n\nAnalysts predict Optimism crypto might reach $2.44 during the 2024 crypto bull run.\n\nVC Spectra (SPCT) Can Complete 900% Surge Soon\n\nVC Spectra (SPCT) has taken the crypto world by storm in the second half of 2023. This new crypto, with the potential to be one of the best DeFi projects, has sent investors smiling to the bank with massive profits. VC Spectra (SPCT) price has surged by 587.5% during its ongoing public presale.\n\nThere is still an opportunity for more surges. VC Spectra (SPCT) is expected to reach $0.080 when the presale ends. This will complete the 900% presale surge predicted at the beginning. Currently, SPCT price is $0.055, and you can buy it from the VC Spectra (SPCT) website.\n\nVC Spectra (SPCT) is more than the surges. It is a decentralized investment and trading platform that provides the best blockchain investment experience. With VC Spectra (SPCT), you can invest in highly-rated blockchain startups and crypto market niches, trade arbitrage, and stake and lend your tokens.\n\nSPCT token holders also get access to exclusive pre-ICOs, earn quarterly dividends and buybacks, and gain voting rights.\n\nAll these fantastic surges and benefits make VC Spectra (SPCT) the best new crypto to invest in.\n\nTo learn more about VC Spectra (SPCT), visit:\n\nBuy Presale: https://invest.vcspectra.io/login\n\nWebsite: https://vcspectra.io\n\nTelegram: https://t.me/VCSpectra\n\n\n\nTwitter: https://twitter.com/spectravcfund"
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vY3J5cHRvdHZwbHVzLmNvbS8yMDIzLzExL2JsYWNrcm9jay1maWxlcy1mb3Itc3BvdC1ldGhlcmV1bS1ldGYtb24tbmFzZGFxLWFzLWV0aC1leGNlZWRzLTIxMDAv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "BlackRock files for spot Ethereum ETF on Nasdaq as ETH exceeds $2,100 - CryptoTvplus",
        "content": "Asset management giant BlackRock moves forward with plans to launch an exchange-traded fund (ETF) for Ethereum. In a filing with the Nasdaq stock exchange on Thursday, BlackRock stated its proposal for an “iShares Ethereum Trust.” BlackRock plans an ETF that allows investors to invest in Ethereum through the stock market.\n\nFollowing the news of BlackRock’s application, Ethereum’s price skyrocketed more than 9%. According to CoinGecko, Ethereum has not experienced a threshold like this since April. The last time ETH was this high was in May 2022. This followed a crash that started in November 2021. ETH’s price is now up more than 30% for the month and 85% over the past year.\n\nBlackRock’s filing for an Ethereum Spot ETF follows a registration for an Ethereum trust in Delaware. Analysts say this could indicate plans to seek regulatory approval for the ETF\n\nAn Ethereum spot ETF would allow retail investors to gain access to a highly liquid cryptocurrency market. Moreover, it would allow for potential billions of dollars of new investment if it’s approved.\n\nBlackRock plans to offer an ETF with the ticker “ETH” that tracks the price of Ethereum held by a trust sponsored by iShares.\n\nIn June 2023, BlackRock applied for a Bitcoin Spot ETF with the SEC. The application included an investment management partnership with Coinbase, a major cryptocurrency exchange. BlackRock hoped to offer exposure to Bitcoin without the need to buy or hold it directly. However, the SEC has not yet approved the ETF.\n\nIt’s unclear when BlackRock will formally apply to the SEC for approval of the ETF, seeing that the SEC previously rejected proposals for spot Bitcoin ETFs, citing manipulation concerns.\n\nWhile the SEC has rejected applications for Bitcoin spot ETFs, it has approved Bitcoin futures ETFs. It also recently allowed Ethereum futures ETFs to trade. This could indicate a more welcoming stance toward crypto ETFs.\n\nRead also: CEO of NYM discusses how NYM Mixnet will transform online privacy"
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vY3J5cHRvZGFpbHkuY28udWsvMjAyMy8xMS9zb2xhbmEtYS1iZXR0ZXItYmV0LXRoYW4tZXRoZXJldW3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Solana a better bet than ethereum - CryptoDaily",
        "content": "Table of Contents\n\nEthereum has just broken out of a long standing ascending triangle and is looking ready to take the limelight from bitcoin. However, Solana is potentially a much better bet over the longer term.\n\nEthereum breakout\n\nEthereum has finally moved into the limelight after breaking out of an ascending triangle that has been in the making since June of 2022. After such a bullish move it is only right that $ETH should be gaining the plaudits. The crypto market needs $ETH to power on up given that this will supply the impetus that the entire crypto market needs so that it can get out of the shade of bitcoin, albeit even for brief interludes.\n\nThis latest $ETH breakout has already started to unleash certain coins in the ethereum ecosystem and this will be good news for ethereum dominance.\n\nMajor hurdles to overcome\n\nBe that as it may, ethereum still has major hurdles to overcome if it is to take the undisputed place as the world’s foremost blockchain for the building upon of most of the future crypto projects.\n\nAs far as the ‘trilemma’ goes (the balance of the 3 most important elements of a blockchain network in scalability, decentralisation, and security), ethereum has certainly nailed it on security. However, transaction speed is still a big issue, and layer 2s are needed in order to address this.\n\nSolana is developing an answer\n\nOn the other hand, continually surging skyward in the background, Solana is fast developing the answer to the trilemma issues. Solana is also a layer 1 blockchain and it appears to have solved the issue of speed.\n\nSource: Trading View\n\nAlways a blazingly fast blockchain, Solana developers have been working intensely through the bear market despite the huge beating that the $SOL token took. Already theoretically able to achieve 65,000 transactions per second (TPS), the introduction of another Solana validator client called Firedancer by late 2024 is likely to be an absolute game changer.\n\nSolana has no layer 2 blockchains to help it with speed and scalability, and the introduction of Firedance will potentially allow the blockchain to produce speeds similar to those needed for a stock market such as the Nasdaq, with almost zero latency.\n\nSo as ethereum and its ecosystem possibly has a good run, at least over the short term, the token to watch over the longer term is likely to be $SOL. Hang on to your hats.\n\nDisclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2NyeXB0by1naWFudHMtc29sYW5hLWV0aGVyZXVtLWFuZC1iaXRnZXJ0cy1tZXRlb3JpYy1yaXNlLWFuZC1sYXRlc3QtZGV2ZWxvcG1lbnRzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Crypto Giants: Solana, Ethereum, and Bitgert's Meteoric Rise and Latest Developments - Analytics Insight",
        "content": "The cryptocurrency market has been witnessing a surge in activity and interest in recent weeks, with several major coins reaching new highs or breaking records of the year. Among them are Solana, Ethereum, and Bitgert, three projects that have different features and advantages for investors. Here is a brief overview of the latest performance and developments of Solana, Ethereum, and the hot buzz, Bitgert.\n\nSolana (SOL):\n\nSolana (SOL) is a blockchain platform that aims to provide fast, scalable, and low-cost solutions for decentralized applications (DApps). Solana uses a novel consensus mechanism called Proof of History, which allows Solana to process thousands of transactions per second. Solana has recently recorded a significant milestone this year as Solana hit a high for 2023. On November 10, Solana reached $55.47, which was a 150% increase from the previous month and the highest price since May 2022.\n\nThe surge in Solana’s price occurred amid the continuous selling of Solana (SOL) tokens by FTX’s bankruptcy estate, which had 55.75 million SOL in its assets. However, the impact of the sales was limited by a weekly sale limit of $100 million and the possibility that some tokens were locked or vested. Solana also benefited from the growing demand for leverage longs. Solana’s also witnessed increasing deposits and usage of DApps within the Solana ecosystem.\n\nEthereum (ETH):\n\nAlongside Solana, we have the mighty Ethereum (ETH). Ethereum is the second-largest cryptocurrency by market capitalization and the most popular platform for smart contracts and DApps. Ethereum also saw a 14% weekly spike and rallied to levels above $2,000 on November 11. Ethereum has become the most talked-about token, evident from the notable increase in social volume. The main reason behind Ethereum breaking the 2k resistance was the Nasdaq filing that highlighted the intentions of BlackRock to turn its iShares Ethereum Trust into a spot Ethereum Exchange-Traded Fund (ETF). This would be the first ETF of its kind in the US and would boost the liquidity and accessibility of Ethereum (ETH) for investors. Ethereum has witnessed the highest day of whale transactions in 3 months. Ethereum’s social dominance seems to set the course for a positive sentiment in the market.\n\nBitgert (BRISE):\n\nNow that we have looked at Solana and Ethereum, let’s look at the news hot buzz in town. Bitgert (BRISE), a full-suite crypto platform and blockchain, aims to revolutionize the electric vehicle (EV) industry by creating a blockchain-based platform that connects EV manufacturers, dealers, buyers, and service providers. Bitgert has announced the launch of its own EV car in Dubai in December 2023, which will be powered by solar energy and integrated with smart features. Bitgert’s own native token, BRISE, will be used for transactions and rewards within the Bitgert ecosystem. Bitgert has been gaining momentum in the crypto market, reaching a peak of 0.0000001736 on November 11, which was a 37% increase from the previous month. This increase was driven by the anticipation of its EV launch and the growing adoption of its platform by various partners and customers.\n\nIf you are interested in buying Bitgert (BRISE), you will need to follow these steps:\n\n– Create an account on a crypto exchange that supports Bitgert’s BRISE, such as PancakeSwap.\n\n– Deposit some funds into your account using fiat currency or another cryptocurrency.\n\n– Swap your funds for Bitgert’s BRISE tokens at the current market rate.\n\n– Transfer your Bitgert tokens to a compatible wallet for safekeeping.\n\nYou can also buy Bitgert’s BRISE directly from the Bitgert website using Binance Smart Chain (BSC) or Ethereum.\n\nThe upcoming EV launch in Dubai is expected to boost the demand and price of Bitgert’s BRISE, as it will showcase the potential and innovation of Bitgert’s platform. According to some analysts, BRISE could reach $0.00001, too.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMTEvMTAvZXRoZXJldW0tZXRoLXByaWNlLXVzZC15ZWFybHktaGlnaHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "USD price of Ethereum (ETH) at annual highs - The Cryptonomist",
        "content": "Since Bitcoin’s price rose above 32,000 in late October, it has continuously set new annual records. Ethereum (ETH), on the other hand, has not.\n\nYesterday it suddenly woke up, and in a single day it rose from 1,900 USD to over 2,100 USD, coming close to a new annual record.\n\nTo be fair, the highest price Ethereum has touched in this 20203 remains that of 16 April, when it also surpassed 2,140 USD, while yesterday it stopped just above 2,130 USD, but today it looks like it could surpass even these levels and perhaps set a new annual high.\n\nThe reasons for the boom in the price of Ethereum (ETH) in USD\n\nThe reason for the boom this time is very easy to identify.\n\nIn fact, yesterday news came out that BlackRock had registered an Ethereum Trust in Delaware, and at that point the price of ETH started to rise.\n\nJUST IN: 🇺🇸 $9 trillion asset manager BlackRock registers Ethereum Trust in Delaware. — Watcher.Guru (@WatcherGuru) November 9, 2023\n\nActually even before that news was made public the price of ETH had already risen from under $1,920 to over $1,940, but that was a minor movement. Instead as soon as the news was made public it sprang to nearly $2,050 within half an hour.\n\nThe speculation at that point was that BlackRock was preparing to file an application with the SEC to issue an ETF on spot ETH as well, and that confirmation came a few hours later.\n\nJUST IN: $9 trillion asset manager BlackRock officially files for Spot Ethereum ETF with Nasdaq. — Watcher.Guru (@WatcherGuru) November 9, 2023\n\nAt that point the price went back up, rising from $2,040 to $2,130 within an hour and a half.\n\nThe missed annual record\n\nIn theory yesterday there would have been every reason for Ethereum‘s price to set a new annual record.\n\nInstead, although it really came very close, it failed to break April’s $2,140.\n\nIt is possible that this is because that 2,140 USD has become a real resistance, since everyone who has bought ETH in 2023 is in profit at that figure.\n\nIn other words, it is possible that many of those who bought ETH this year with the specific purpose of speculating on it are selling at that figure in order to monetize gains over the medium/short term.\n\nIt should not be forgotten that it was since July 15 that the price of ETH had been steadily below 2,000 USD, and at that point for short-term speculators to sell at a figure above 2,100 USD is an opportunity to be taken advantage of.\n\nFuture trend\n\nIf the price of Ethereum were to react to the news of BlackRock’s ETF in a similar way to that of Bitcoin we could expect a period of stagnation, or even a retracement, followed in a while by renewed growth to new annual highs.\n\nHowever, in recent months Ethereum’s price trend has diverged somewhat from Bitcoin’s, so it is hard to imagine that it could really replicate such a similar trend.\n\nOn the contrary, the fact that after surpassing 2,130 USD yesterday the price of ETH then fell all the way below 2,100 USD, but only to rise again above 2,130 USD, makes one believe that today it might have the strength for one last leap even above 2,140 USD, so as to make new yearly highs already immediately.\n\nMoreover, since yesterday all crypto markets have been in positive territory, and the decidedly positive mood these days could help. However, one should not make the mistake of believing that it will only go up from here on, because a retracement is always possible.\n\nThe comparison with Bitcoin\n\nThere is also another decidedly interesting fact.\n\nYesterday, before the ETH boom, it was Bitcoin that had made a small boom, with the price rising in a very short time from about $35,000 to almost $38,000. Later the ETH boom took some interest away from BTC, so that its price dropped to around $36,000.\n\nPrior to the ETH boom there had been new highs in the ratio of BTC to ETH even since May 2021, about two and a half years ago.\n\nIn fact, yesterday the ratio of Bitcoin’s market capitalization to that of Ethereum had risen to 3.07 times, and between 2 and 3 in November it was as high as 3.15 times.\n\nThe previous record for the past two and a half years was in June last year, after the implosion of Terra/Luna and the failure of Celsius, also at 3.15.\n\nSuffice it to say that in September last year, when there was the Merge of Ethereum with the move to Proof-of-Stake, it had also fallen below 1.9 times.\n\nMoreover, even as recently as early October this year it was below 2.6 times, but starting on 4 October it began to surge until it hit new records for the past two and a half years in early November.\n\nYesterday, however, it suddenly fell to 2.8, undoing in this respect all the gains made in the second half of October.\n\nIn other words, the news of BlackRock’s ETF rebalanced the balance of power between Ethereum and Bitcoin."
    }
]