[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi1hcy1idXllcnMtZXNjYXBlLWNvbnNvbGlkYXRpb24v0gFaaHR0cHM6Ly9jb2luZ2FwZS5jb20vbWFya2V0cy9ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLWFzLWJ1eWVycy1lc2NhcGUtY29uc29saWRhdGlvbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "ETH Price | Ethereum Price Prediction As Buyers Escape Two-Months Consolidation - CoinGape",
        "content": "Ethereum Price Prediction: Fueled by optimism over the potential approval of a Bitcoin spot ETF, the crypto market has seen a surge in buying activity over the past week. As Bitcoin touched the $35,000 mark for the first time in 2023, the ripple effect extended to altcoins which resulted in an extended recovery sentiment. Thus, the second largest cryptocurrency Ethereum broke through its last swing high resistance at $1,745, signaling more room for an upward journey.\n\nAlso Read: 80% of Bitcoin Holders in Profit, What’s Next? Caution or BTC Price Rally?\n\nadvertisement\n\nIs ETH Price Heading to $2000?\n\nAn upside breakout from the $1745 barrier prepares the ETH price for a 12.5% jump\n\nA bullish crossover between the 20-and-50-day EMA could boost the market buying pressure.\n\nThe intraday trading volume in Ether is $6.6 Billion, indicating a 34% gain.\n\nSource- Tradingview\n\nThe ETH price has been on a seven-day ascent, climbing from an October 19 low of $1,643 to its current trading price of $1,786—a notable 14.10% gain. This upswing enabled Ether to shatter a crucial two-month resistance at $1,745 on October 23, liberating the coin from a sideways range and completing a bullish reversal pattern known as a double bottom.\n\nDespite the rally, the presence of supply pressure near the $1,800 level suggests a possible short-term pullback to retest the $1,745 support. Should the Ethereum price successfully validate this level as new support, it would pave the way for an extended rally targeting the $1,970 to $2,000 range.\n\nAccording to Dow Theory, breaking past the last high resistance of $1,745 could indicate an early sign of a trend reversal for Ethereum.\n\nGlobal In/Out of the Money Metric\n\nSource- intotheblock\n\nAs for on-chain analytics, the Global In/Out of the Money (GIOM) metric reveals that 62.13% of Ethereum addresses are currently in the money, realizing profits, while 34.19% are out of the money and experiencing losses. This suggests that a significant majority of ETH holders are in a profitable position, reducing the likelihood of fear selling in the near term.\n\nRelative Strength Index: the daily RSI above 70% marks reflects the active bullish momentum in the crypto market.\n\nExponential Moving Average: For the anticipated pullback, the 200 EMA slope wavering around the $1730 mark could offer strong support."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3JvbGx1cHMtZXRoZXJldW0tc2NhbGluZy1zb2x1dGlvbnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "Do rollups actually scale Ethereum or are we fooling ourselves? - Blockworks",
        "content": "In the quest to scale Ethereum, developers have been busily building mechanisms called “rollups” that operate more efficiently “on top” of the base chain.\n\nBut what exactly is a rollup? When asked the loaded question, Jon Charbonneau laughs.\n\n“Oh, this is gonna be tough,” he says. “This has been, like, a whole big debate with everyone over the last few months.”\n\nIt’s important to get the mental model right, he says, in order to determine the true purpose of a rollup — and whether it’s a genuine scaling solution for Ethereum. After all, if it’s just building “on top” of the chain, is it really scaling the chain?\n\nOn the Lightspeed podcast (Spotify/Apple), the co-founder and partner at crypto investment firm DBA gives a simple definition before elaborating: “A rollup is just some state that you derive off of some data, basically, that is posted on another blockchain, another data layer.”\n\n“So there’s data posted on Ethereum and I can run some state transition function over that data that says, ‘Hey, this is the state of my rollup.’”\n\n“That is all you really need to have a rollup at a fundamental level.” Everything else, while important, is just a matter of implementation, he says.\n\nThe concept can get a little more convoluted when it comes to bridging — or not — back to Ethereum, Charbonneau explains. “If it lacks this bridge from the base layer to the rollup, well, then what the hell is the point of this thing?”\n\nThe researcher notes that a rollup doesn’t necessarily have to bridge back to the original data layer if it is strictly using the base network for its security properties. He suggests that a developer might decide to use another chain’s consensus and other security benefits instead of bootstrapping their own validators, for example, allowing for a much easier setup.\n\nBut the use cases for such a rollup are “unclear,” Charbonneau says. “You want to be able to bridge assets around,” he says. “That is what we are using most of these things for.”\n\nDefining scaling\n\nThe discussion centers on the question: Do rollups actually contribute to scaling Ethereum or are they ultimately just offloading the activity elsewhere?\n\nThe crux of the matter is the meaning of “scaling,” Charbonneau explains. He defines it as “trying to get more throughput through a system relative to whatever the resource requirements are.”\n\nWith rollups, he says “it’s possible to create more efficient execution environments that, for comparable amounts of resources, do get you a lot more throughput.”\n\nIn regards to the question of whether rollups actually scale Ethereum, Charbonneau admits he doesn’t have “the perfect answer.”\n\nRead more: Blockchain tech narrative is ‘lightyears ahead of reality,’ says Dudas\n\nThe answer lies within a “fuzzy line,” he says, “which is why a lot of people very reasonably say, ‘okay, rollups aren’t scaling Ethereum — you just have to consider the base layer itself.’”\n\n“You’re generally scaling it if you are using the properties of the underlying system in some way and retaining a lot of the underlying security properties of the system.”\n\nScaling with rollups on Ethereum “lets you do a lot more interesting things with your [ether] [ETH] that you couldn’t do on the base layer,” he says.\n\n“If I send my [ETH] to Coinbase, and now I can do whatever I want with Coinbase, that’s not really scaling in my mind at that point,” he says, “because you effectively just have no security properties derived from it.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmV0ZnRyZW5kcy5jb20vY3J5cHRvLWNoYW5uZWwvZXRoZXJldW0tZXhjZWxsZW5jZS1jb3VsZC1wcm9wZWwtbmV3LWV0Zi_SAVZodHRwczovL3d3dy5ldGZ0cmVuZHMuY29tL2NyeXB0by1jaGFubmVsL2V0aGVyZXVtLWV4Y2VsbGVuY2UtY291bGQtcHJvcGVsLW5ldy1ldGYvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Excellence Could Propel This New ETF - ETF Trends",
        "content": "Ethereum serves as the platform for transactions conducted in the digital currency known as ether. It is widely known as the second-largest crypto asset behind bitcoin.\n\nThat’s not necessarily a bad place to be. With a burgeoning usage case for smart contracts and more, ethereum has its own bull thesis that could match or exceed that of bitcoin. Additionally, as is the case with its larger rival, it has a penchant for drawing eye-catching price forecasts.\n\nPut it all together and there’s a budding case for ethereum in the exchange traded funds wrapper. This a concept being met by new ETFs, including the Bitwise Ethereum Strategy ETF (AETH) . The ETF is less than a month old. It invests in CME-listed ethereum futures contracts with an emphasis on front-month contracts.\n\nAETH Could Be a Well-Timed Ethereum ETF\n\nNew ETFs, regardless of underlying asset class, can benefit from good timing. That perk may be enjoyed by AETH. That is because the fund debuted when an increasing number of cryptomarket participants are forecasting sizable gains for ether.\n\nSome ether bulls believe the digital currency will rise to $10,000, a more than fivefold increase from current levels. That outlook is supported by both attractive fundamentals and bullish technicals.\n\n“For almost its entire history of price action, ETHUSD has been filling out what appears to be a massive rising wedge pattern. Such patterns are predominantly bearish, breaking down roughly 60% of the time,” reported Tony Severino for NewsBTC. “That leaves 40% of the time that these patterns break upward. Descriptions of the pattern reveal that wedges are notoriously prone to false breakouts and/or false breakdowns, where price violates one trend line, only to reverse and target the other.”\n\nHow long it takes for ether to make good on the promise of its bullish technical setup remains to be seen. But $10,000 is likely a long way off. Some crypto experts believe that if ethereum can conquer $2,100, a significant near-term rally could be in the offing. Fortunately, there is a fundamental case to support ether’s technical objectives and it could make AETH more appealing.\n\n“Ethereum is unlike many other crypto assets in that its value is driven directly by the use of the Ethereum blockchain. Every time people use an application built on Ethereum, they have to pay a fee using the Ethereum asset. This fee is returned to Ethereum investors in a manner similar to stock buybacks and dividends, providing an important starting point for valuations,” according to Bitwise."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3LmNjbi5jb20vYW5hbHlzaXMvZXRoZXJldW0tc3RydWdnbGVzLW5ldy15ZWFybHktaGlnaC1haGVhZC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 24 Oct 2023 07:00:00 GMT",
        "title": "Market Pumps, But Ethereum Struggles To Keep Up - Is New Yearly High Ahead? - CCN.com",
        "content": "Key Takeaways\n\nEthereum is up by 20% from October 11\n\nBreakout has been seen from a descending channel but today’s high is still a lower one\n\nMore upside potential stands but ETH needs to go above $2,000\n\nThe overall cryptocurrency market has witnessed a significant surge, with its capitalization soaring by 30% from its September 11 low, touching a new yearly high of $1.26 trillion. This slight edge over its previous peak in April underscores the market’s bullish momentum.\n\nBitcoin, leading the charge, has set a fresh yearly record, outpacing its previous best by 11%. Altcoins, too, have been on a tear, with some, like MINA, registering eye-popping gains of up to 120%.\n\nIn contrast, Ethereum‘s performance, while commendable, hasn’t quite matched the fervor seen in other coins. Since October 11, it has appreciated by 21%, a respectable figure but somewhat muted compared to the broader market’s exuberance. Currently trading around $1,800, it remains 15% shy of its yearly peak of $2,100.\n\nETH Price Analysis\n\nEthereum’s trajectory since its June 18 low last year has been relatively more optimistic than many of its peers. It embarked on a recovery journey, marking a higher low in November and subsequently achieving a higher peak in April compared to its August high.\n\nPost its $2,100 zenith, Ethereum managed to maintain its value above the $1,500 threshold, charting its course within a descending channel. This resilience stands in stark contrast to several altcoins that plummeted to new bearish lows post-April.\n\nThis descending trajectory Ethereum found itself in likely represented a corrective phase, characterized by a five-wave pattern. However, the tide seems to be turning. Starting from October 11, Ethereum has been exhibiting bullish signals, culminating in a breakout from this channel.\n\nThe rise of Ethereum from November 21 to mid-April presents an analytical conundrum. The movement, characterized by a five-wave impulse, is somewhat ambiguous in its interpretation due to the higher low on November 21.\n\nThis could mean that the surge is merely an extension of the previous ascending structure, rendering it a corrective phase rather than a new bullish cycle.\n\nHowever, there’s an alternative, more optimistic perspective. If we consider this rise as a smaller segment within a broader framework, it could be interpreted as just the initial sub-wave of a more extensive five-wave impulse.\n\nUnder this assumption, the descending channel that followed would represent the second wave of this larger cycle. If this interpretation holds, Ethereum could be poised for a significant upward trajectory. Wave 3, in this context, could propel the price to around $3,310. And if the momentum sustains, wave 5 could push the price even further, breaking previous boundaries.\n\nGiven the undeniable corrective nature of the descending channel, the odds currently favor a continuation of the upward trend for Ethereum. But does this imply an imminent new yearly high?\n\nThe current high, just a touch above $2,000, remains shy of the July 14 peak. By the tenets of technical analysis, this positions Ethereum in a downtrend since mid-April.\n\nHowever, a breach above the $2,000 mark, resulting in a higher high, would disrupt this bearish narrative. Such a move would not only signify a reversal of the downtrend but also set the stage for a potential new yearly high. Conversely, if the current surge falters and pivots into a decline, Ethereum might be subjected to further losses before it can embark on a genuine bull run.\n\nDisclaimer\n\nPlease note that the contents of this article are not financial or investing advice. The information provided in this article is the author’s opinion only and should not be considered as offering trading or investing recommendations. We do not make any warranties about the completeness, reliability and accuracy of this information. The cryptocurrency market suffers from high volatility and occasional arbitrary movements. Any investor, trader, or regular crypto users should research multiple viewpoints and be familiar with all local regulations before committing to an investment."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vY3J5cHRvLm5ld3MvYW4taW4tZGVwdGgtbG9vay1hdC10aGUtZXRoZXJldW0tbWFya2V0LWluLTIwMjMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 24 Oct 2023 07:00:00 GMT",
        "title": "An in-depth look at the Ethereum market in 2023 - crypto.news",
        "content": "Dive deep into Ethereum’s 2023 market journey, focusing on its NFT dynamics, pivotal metrics, and the emerging world of spot ETFs.\n\nIn 2022, the crypto world witnessed an unexpected downturn, with Ethereum (ETH) facing a sharp 68% decline in value.\n\nAlthough 2023 brought a glimmer of hope, with ETH clawing back nearly 35% of its losses amidst a market-wide resurgence, its price of $1,620 as of Oct. 20 still pales in comparison to its once lofty highs.\n\nEthereum has also grappled with a series of challenges recently, dampening its once meteoric rise. A testament to its struggles is the drastic dip in ETH’s total value locked (TVL) — plummeting from a whopping $108 billion in November 2021 to a mere $20 billion by October, marking an almost 82% drop.\n\nLet’s delve into the dynamics surrounding Ethereum and try to understand the current market sentiments, key metrics, and insights into what lies ahead for this crypto.\n\nDeclining NFT market\n\nIn Jan. 2023, Ethereum’s NFT space witnessed significant headwinds. The bustling activity that saw more than 28,000 NFTs being minted daily on Ethereum at the beginning of the year took a sharp downturn.\n\nETH NFT mints | Source: The Block\n\nAs of Oct. 20, that enthusiasm has waned, with daily mintings dropping below 3,500. This significant 88% decline can be attributed to increased competition from other blockchain networks, a possible oversupply, and the general volatility of the crypto market.\n\nTrading hasn’t been spared either. Platforms like OpenSea, once brimming with sales, observed a slowdown, particularly after the first quarter, hitting their lowest ebb by Sep. Moreover, from Q1 to Q2 2023, Ethereum’s NFT trading volume shrank by 39.6%, according to CoinGecko.\n\nParallel to the ebb in NFT momentum, 2023 also marked the entry of Ethscriptions. Launched in June, this platform aimed to transform the NFT space by allowing users to inscribe “non-financial data” on Ethereum’s network.\n\nHowever, its journey was riddled with hurdles. A major setback occurred when a prominent collection named Ethereum Punks had to be withdrawn from Ethscriptions’ official platform.\n\nAt the request of Yuga Labs, the owner of CryptoPunks, I am taking down the Ethereum Punks website, removing all Ethereum Punks images from https://t.co/ZcR9HKlexS, and deleting my Tweets that reference Ethereum Punks, including my Tweet introducing the Ethscriptions Protocol. — Middlemarch (@dumbnamenumbers) July 11, 2023\n\nThis action was taken upon a request from Yuga Labs, the entity behind CryptoPunks. The ripple effect of this removal was evident as it led to the deletion of numerous tweets by the creator of Ethscriptions, Middlemarch, including the pivotal one introducing the Ethscriptions Protocol.\n\nThese challenges faced by Ethereum’s NFT and Ethscriptions hint at broader concerns within the Ethereum ecosystem, shedding light on competitive, regulatory, and inherent protocol-based challenges.\n\nWhat do the metrics suggest?\n\nSeveral critical metrics can gauge Ethereum’s health and vibrancy. Let’s delve into these to unravel their story about Ethereum in 2023.\n\nETH daily transactions\n\nThese represent the number of transactions processed on the Ethereum blockchain within a day. In May 2023, this number averaged around 1.14 million, but by Oct. 20, it had diminished to 980,000, marking a 14% decline.\n\nEthereum daily transactions | Source: The Block\n\nWhy does this matter? A high transaction count typically indicates robust network usage and utility, making it a bellwether of network health.\n\nYou might also like: Vitalik Buterin discusses Ethereum’s future and innovative projects in AMA\n\nThe reduction hints at a reduced activity level, possibly due to competition from other blockchains or waning enthusiasm from users and developers.\n\nDaily active addresses\n\nThis metric denotes the number of unique addresses that actively send or receive Ethereum on a given day. In April 2023, the daily active addresses averaged 471,000, but this number dwindled to 369,000 by Oct. 20, showcasing a 21.7% drop.\n\nEthereum active addresses | Source: The Block\n\nIts significance lies in its ability to act as a pulse check for user engagement and network popularity. A declining trend in active addresses might imply that fewer users or entities are interacting with the Ethereum network, possibly signaling a shift of interest or a consolidation phase.\n\nDaily onchain volume\n\nRepresenting the total value (in USD) of all transactions on the Ethereum blockchain in a day, the daily onchain volume has witnessed a steady decline. From a substantial $3.92 billion in March, it shrank to $1.41 billion by Oct. 20, reflecting a 64% reduction.\n\nEthereum daily on-chain volume | Source: The Block\n\nThis metric is crucial because it sheds light on the monetary value of assets moving within the network. A decline might suggest that fewer high-value transactions are taking place or that the value of assets on Ethereum has decreased.\n\nETH transaction fee\n\nTransaction fees are payments made by users to compensate for the computational energy required to process and validate transactions on the Ethereum network. These fees had reached a staggering annual peak of $21.89 in May but have since nosedived to a mere $1.99 by Oct. 20, indicating a 90.9% decline.\n\nEthereum transaction fee | Source: The Block\n\nWhile high fees can be discouraging for users, leading to decreased network usage, the sharp decline might indicate improved network efficiency or reduced demand.\n\nNonetheless, it’s a double-edged sword. While it’s more cost-effective for users, it might be less profitable for miners, possibly leading to decreased network security in the long run.\n\nEthereum’s layer 2 evolution in 2023\n\nIn 2023, Ethereum’s layer 2 solutions (L2s) saw increased activity. As Ethereum faced various challenges, L2s emerged as an alternative solution, particularly in addressing scalability.\n\nThe TVL of Ethereum’s L2 platforms reached $10.62 billion as of Oct. 2023. Of these platforms, Arbitrum One recorded a market share of 54.76%. This TVL growth suggests a heightened activity within the L2 platforms.\n\nMeanwhile, centralized exchanges have begun to integrate L2 solutions. Coinbase‘s introduction of layer 2 Base indicates a growing interaction between centralized platforms and L2s.\n\nYou might also like: Coinbase launches Ethereum L2 network, Base\n\nIn terms of transaction activity, L2s recorded a higher transaction count than Ethereum’s mainnet during the year. This shift might be attributed to factors such as scalability issues and transaction costs on Ethereum’s mainnet.\n\nOn the financial front, Ethereum’s network revenue experienced a decline, decreasing by 33.3% from $1.27 billion in Q2 2022 to $847 million in Q2 2023. The value of ETH burned also saw a reduction of 35% over the same period. These changes align with the fluctuations observed in the broader crypto market.\n\nEthereum’s position in the decentralized finance sector, however, continues to be notable. The platform constitutes a considerable portion of DeFi’s TVL and is used for multiple on-chain stablecoins.\n\nIn summary, 2023 observed varied dynamics in Ethereum’s ecosystem, with L2 solutions gaining traction amid the platform’s overarching challenges.\n\nEthereum and the influence of spot ETFs\n\nMeanwhile, ETFs have taken center stage recently, with their potential to impact the price and adoption of cryptocurrencies significantly.\n\nGalaxy Digital Fund and Invesco have recently joined forces to delve into the Ethereum spot ETF market in the U.S. This makes them the fifth major player to do so, following in the footsteps of renowned entities like VanEck, ARK Invest, Hashdex, and Grayscale.\n\nHowever, it’s crucial to note that the road ahead for Ethereum spot ETFs is not without hurdles. In many ways, these spot ETFs’ fate is tied to that of Bitcoin spot ETFs.\n\nBefore Ethereum can enjoy the green light for its spot ETFs, Bitcoin spot ETFs are awaiting clearance from the Securities and Exchange Commission (SEC). Essentially, Ethereum’s move is pegged to Bitcoin’s lead in this dance of financial products.\n\nTheir introduction could play a pivotal role in influencing Ethereum’s price, adoption, and mainstream acceptance in the financial market.\n\nEthereum price prediction\n\nStandard Chartered’s Geoff Kendrick is optimistic about Ethereum, predicting it could surge past $8,000 and possibly reach between $26,000 and $35,000 by 2025-2026. He cites Ethereum’s growing use cases and the support from layer 2 blockchains as drivers for this growth.\n\nContrarily, analyst FieryTrading expects Ethereum to dip to around $900.\n\nWith such varied forecasts, traders should tread cautiously. It’s vital to remember: never invest more than you can afford to lose.\n\nThe road ahead\n\nAs we approach the end of 2023, Ethereum’s journey has been a roller coaster of highs and lows. From a peak TVL of $108 billion in 2021 to a significant dip to $20 billion this year, it reflects the volatility and uncertainty surrounding the crypto realm.\n\nMeanwhile, Ethereum’s once-booming NFT market has also faced headwinds, with daily mintings witnessing a sharp decline.\n\nLayer 2 solutions, like Arbitrum, have provided a silver lining, offering scalable alternatives and showing promise for Ethereum’s scalability concerns.\n\nEthereum’s next significant catalyst might lie in the realm of spot ETFs. With major players like Galaxy Digital Fund and Invesco entering the fray, the potential for Ethereum spot ETFs to drive price, adoption, and mainstream acceptance is palpable.\n\nYet, amidst optimistic forecasts of Ethereum reaching dizzying heights, caution is crucial. The crypto market remains unpredictable, and prudent decision-making remains the order of the day.\n\nYou might also like: Fake news on Bitcoin ETF approval: How rumors can sway the crypto market\n\nFollow Us on Google News"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMTAvMjUvcG9sLWNvbnRyYWN0cy1nby1saXZlLW9uLWV0aGVyZXVtLW1haW5uZXQtYXMtcGFydC1vZi1wb2x5Z29uLTIwL9IBbWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMTAvMjUvcG9sLWNvbnRyYWN0cy1nby1saXZlLW9uLWV0aGVyZXVtLW1haW5uZXQtYXMtcGFydC1vZi1wb2x5Z29uLTIwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "POL Contracts Go Live on Ethereum Mainnet as Part of Polygon 2.0 - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1hY2NlbGVyYXRlcy10b3dhcmQtMjAwMC_SAUpodHRwczovL3d3dy5uZXdzYnRjLmNvbS9hbmFseXNpcy9ldGgvZXRoZXJldW0tYWNjZWxlcmF0ZXMtdG93YXJkLTIwMDAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 24 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Accelerates Toward $2,000 But Can The Bulls Make It? - NewsBTC",
        "content": "Ethereum price started a decent increase after Bitcoin rallied 15% against the US dollar. ETH is rising, but it might struggle to clear the $1,850 resistance.\n\nEthereum started a steady increase above the $1,750 resistance.\n\nThe price is trading above $1,780 and the 100-hourly Simple Moving Average.\n\nThere is a key bullish trend line forming with support near $1,750 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could struggle to clear the $1,850 and $1,880 resistance levels.\n\nEthereum Price Jumps 10%\n\nEthereum remained in a positive zone above the $1,650 support zone. The recent pump in Bitcoin above the $34,000 resistance sparked more upsides in ETH. There was a steady increase above the $1,720 and $1,750 resistance levels.\n\nThe price even cleared the key $1,800 resistance zone. A high is formed near $1,849 and the price is now consolidating gains. It is trading well above the 23.6% Fib retracement level of the upward move from the $1,660 swing low to the $1,849 high.\n\nEthereum is now trading above $1,780 and the 100-hourly Simple Moving Average. There is also a key bullish trend line forming with support near $1,750 on the hourly chart of ETH/USD. The trend line is near the 50% Fib retracement level of the upward move from the $1,660 swing low to the $1,849 high.\n\nOn the upside, the price is facing resistance near the $1,850 level. The first major resistance is near the $1,880 zone. A close above the $1,880 resistance could send the price further higher. The next key resistance is $1,920, above which the price could accelerate higher.\n\nSource: ETHUSD on TradingView.com\n\nIn the stated case, Ether could start a strong increase toward the $2,000 resistance. Any more gains might open the doors for a move toward $2,200.\n\nDownside Correction in ETH?\n\nIf Ethereum fails to clear the $1,850 resistance, it could start a downside correction. Initial support on the downside is near the $1,800 level.\n\nThe next key support is $1,750 and the trend line zone. A downside break below the $1,750 support might send the price further lower. In the stated case, the price could drop toward the $1,700 level. Any more losses may perhaps send Ether toward the $1,650 level and the 100-hourly Simple Moving Average.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 level.\n\nMajor Support Level – $1,750\n\nMajor Resistance Level – $1,850\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vdS50b2RheS9uZXctZXRoLXdoYWxlcy1ncmFiYmluZy1hc3RvbmlzaGluZy1udW1iZXItb2YtZXRoZXJldW0tYXMtcHJpY2Utc29hcnPSAVlodHRwczovL3UudG9kYXkvbmV3LWV0aC13aGFsZXMtZ3JhYmJpbmctYXN0b25pc2hpbmctbnVtYmVyLW9mLWV0aGVyZXVtLWFzLXByaWNlLXNvYXJzP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 24 Oct 2023 07:00:00 GMT",
        "title": "New ETH Whales Grabbing Astonishing Number of Ethereum As Price Soars - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nAccording to the data shared by the blockchain sleuth @OnchainDataNerd on the X social media app, over the past few hours, four new whales have purchased substantial ETH chunks on the leading US-based Coinbase exchange.\n\nBesides, Whale Alert crypto tracker has spotted a massive ETH chunk withdrawn from the Binance exchange to an anonymous wallet.\n\n86,700 ETH withdrawn from exchanges\n\nPer tweet of the aforementioned source, three new whales together purchased 47,760 ETH in total over the past 24 hours. This amount of Ethereum was worth $82.97 million at the time of the purchases.\n\nAnother new wallet bought and withdrew 8,310 ETH from Coinbase worth $15.09 million, paying $1,816 per coin for that.\n\n1 hour ago, Fresh Whale withdrew 8.31K $ETH ($15.09M) from #coinbase at $1816.\n\n\n\nThere have been 3 Fresh Wallets jointly accumulated a total of 47.76K $ETH ($82.97M) in the last 24H.\n\n\n\nBullish 🚀 pic.twitter.com/sIzlMci76V — The Data Nerd (@OnchainDataNerd) October 24, 2023\n\nAnother whale, according to Whale Alert, shifted a total of 30,709 ETH from Binance half an hour ago.\n\nEthereum price adds 7.5%\n\nOver the last 24 hours, the second largest cryptocurrency Ethereum has surged by a substantial 7.5%, surging from $1,717 range to the $1,846 level. A marginal decline of 1.13% followed, pushing Ethereum down to $1,828 per coin on the Bitstamp exchange.\n\nEthereum and the rest of the crypto market have been on the rise, following the flagship cryptocurrency Bitcoin – within the last 24 hours, BTC spiked by 9.73%, soaring from $31,446 to $34,505. The price rise has been driven by the growing hype about the potential approval of the Bitcoin spot ETF this year by the SEC regulator."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMinAFodHRwczovL3d3dy5meGVtcGlyZS5jb20vZm9yZWNhc3RzL2FydGljbGUvZXRoZXJldW0tY2hhaW5saW5rLXNvbGFuYS1wcmljZS1mb3JlY2FzdC1zdGFraW5nLWJlbmVmaXRzLWJvb3N0LWNoYWlubGluay1hbmQtc29sYW5hLWV0aGVyLWF3YWl0cy1ldGYtbm9kLTEzODM3MDnSAY0BaHR0cHM6Ly9hbXAuZnhlbXBpcmUuY29tL2VuL2V0aGVyZXVtLWNoYWlubGluay1zb2xhbmEtcHJpY2UtZm9yZWNhc3Qtc3Rha2luZy1iZW5lZml0cy1ib29zdC1jaGFpbmxpbmstYW5kLXNvbGFuYS1ldGhlci1hd2FpdHMtZXRmLW5vZC8xMzgzNzA5?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "Ethereum, ChainLink, Solana Price Forecast: Staking Benefits Boost Chainlink and Solana, Ether Awaits ETF Nod - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzEwLzI0L3doeS1iaXRjb2luLWV0aGVyZXVtLWFuZC1kb2dlY29pbi1yYWxsaWVkLXRvZGF5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 24 Oct 2023 07:00:00 GMT",
        "title": "Why Bitcoin, Ethereum, and Dogecoin Rallied Today - The Motley Fool",
        "content": "The prices of several major cryptocurrencies jumped on Tuesday amid increased speculation over the imminent approval of the first spot Bitcoin (BTC 7.61%) exchange-traded fund (ETF) by the U.S. Securities and Exchange Commission (SEC). As of the regular markets' close on Tuesday, Bitcoin was up more than 9%, Ethereum (ETH 4.67%) had gained nearly 7%, and Dogecoin (DOGE 25.97%) had risen 5.5%.\n\nFresh signs of the first spot Bitcoin ETF approvals\n\nLate Monday, Bloomberg ETF analyst Eric Balchunas pointed out on social media platform X that BlackRock's (BLK 1.14%) iShares Bitcoin Trust had been listed on the Depository Trust & Clearing Corporation (DTCC) website (the organization that clears all Nasdaq trades) with the planned ticker symbol IBTC. The news subsequently garnered so much attention that the DTCC website briefly crashed due to overwhelming traffic.\n\nIndeed, Tuesday's optimism followed a significant rally in cryptocurrency prices last week, which was spurred by the SEC's reported decision not to appeal a federal court's August reversal of its order preventing crypto asset manager Grayscale from converting its widely popular Grayscale Bitcoin Trust (GBTC 5.86%) into an ETF.\n\nSure enough, late Monday the D.C. Circuit of Appeals formalized Grayscale's court win over the SEC, indicating no appeal was filed and putting the onus back on the SEC to move forward with its approval process. The court described the SEC's order preventing Grayscale from converting its bitcoin trust into an ETF -- while simultaneously allowing bitcoin futures funds to launch -- \"arbitrary and capricious.\"\n\n\"This is pretty much checking every box that you need to check before you launch an ETF,\" Balchunas added, noting the timing of the ticker's appearance on the site was \"surprising\" considering any formal approval of a spot bitcoin ETF by the SEC was widely expected to happen sometime over the next several weeks.\n\nWhy the first Bitcoin ETFs are likely still several weeks away\n\nYou shouldn't hold your breath waiting for an imminent approval of the first spot Bitcoin ETFs. Eagle-eyed investors noticed early Tuesday that BlackRock's iShares Bitcoin Trust was no longer present on the DTCC's list this morning -- a change Balchunas speculated may have happened after BlackRock was \"told to or want[ed] to wait until they are days, not weeks or months away\" from the SEC's formal approval.\n\nIt's hard to blame BlackRock, of course, for ensuring all the pieces are in place to move forward as soon as that approval hits the wires. For perspective, the SEC's final deadline to respond to BlackRock's application is March 15, 2024. According to a research report released last week by JPMorgan, however, the first approvals of spot Bitcoin ETFs will most likely arrive before January 10, 2024 -- the final deadline by which the SEC is required to respond to ARK Invest's open application for its \"21Shares\" bitcoin ETF. At that time -- rather than responding to individual applications separately over the course of several months -- the SEC will most likely approve multiple applications at once to level the playing field and prevent any single bitcoin ETF from gaining a so-called \"first-mover\" advantage.\n\nSo why is this a big deal for cryptocurrencies in general? Exchange-traded funds are a much more investor-friendly medium compared to creating separate investment accounts through cryptocurrency trading firms, enabling people to buy and sell shares throughout each trading day through any brokerage firm. Any approval of a spot Bitcoin ETF would significantly broaden investors' access to cryptocurrencies as a widely accepted asset class and source of portfolio diversification.\n\nAs a result, tens of billions of dollars of incremental liquidity would almost certainly flow into cryptocurrencies in short order, likely driving prices even higher in the near term. According to a report from data analytics firm CryptoQuant last week, the overall cryptocurrency market capitalization could ultimately increase by a total of more than $1 trillion after Bitcoin ETFs are approved and become mainstream.\n\nIn any case, it now seems a matter of if, not when we see the SEC finally give its stamp of approval to the first Bitcoin ETFs. Cryptocurrency investors are rightly enthused by the news."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzEwLzI1L3RoaXMtZXRoZXJldW0tZXRoLXBsYXktY291bGQtZnJvbnQtcnVuLWJsYWNrcm9jay1hY2NvcmRpbmctdG8tY3J5cHRvLXZldGVyYW4tYXJ0aHVyLWNoZW9uZy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "This Ethereum (ETH) Play Could Front Run BlackRock, According to Crypto Veteran Arthur Cheong - The Daily Hodl",
        "content": "Venture capitalist Arthur Cheong says that Ethereum (ETH) could go on a massive rally if one possible scenario plays out.\n\nThe DeFiance Capital founder and CEO tells his 151,900 followers on the social media platform X that if BlackRock succeeds with its application for a spot Bitcoin (BTC) exchange-traded fund (ETF) the financial giant may apply for a spot Ethereum ETF next.\n\nHe predicts a BlackRock application for a spot ETH ETF could happen within the year and that it would send Ethereum soaring.\n\n“ETH is probably the best six to 12 month long among large-cap assets now when BlackRock applies for spot ETH ETF six to 12 months down the road.\n\nEthereum’s ESG (environmental, social, and governance) friendliness and native staking yield will be appealing to institutional investors should BTC spot ETF turn out to be a success.”\n\nHowever, he says that the ETH/BTC trading pair is likely to remain in a correction for at least six months before Ethereum starts to make gains against the king crypto.\n\n“Does that mean ETH/BTC have bottomed? Probably not yet as all short-term focus will be on BTC combined with halving April next year. This is something that might pick up post BTC halving.”\n\nETH/BTC is trading for 0.0526 BTC ($1,771) at time of writing.\n\nHe notes that crypto is potentially one of the best investments due to its global reach.\n\n“The biggest lesson from the past 10-15 years of financial market is the best investments to own are generally assets that attract global demand in nature and ideally US dollars denominated. What other assets attract global demand and USD denomination besides US equities and fixed incomes? Crypto.”\n\nLastly, he suggests that Solana (SOL) is poised for a correction after a big rally and he suggests other altcoins may start breaking out next.\n\n“Most of the market attention is on SOL but there are some names that are not that far behind with way less attention and not as overbought. Will we see follow-through? Definitely feel some of the animal spirits are back to the market though.”\n\nSolana is trading for $30.21 at time of writing, retracing from the day’s high of $32.27.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE-3"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvc2VjLXRvLXJldmlldy1ncmF5c2NhbGVzLXNwb3QtZXRoZXItZXRmOi13aWxsLWV0aGVyZXVtLXByaWNlcy1icmVha291dC1hYm92ZS0kMjAwMNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 24 Oct 2023 07:00:00 GMT",
        "title": "SEC To Review Grayscale's Spot Ether ETF: Will Ethereum Prices Breakout Above $2000? - Nasdaq",
        "content": "The U.S. Securities and Exchange Commission (SEC) will review Grayscale’s Bitcoin Trust ETF filing once more.\n\nMeanwhile, BlackRock’s iShares Bitcoin Trust was recently listed on Nasdaq-traded ETFs maintained by DTCC. The two instances have pushed Bitcoin (CRYPTO: BTC) and the broader crypto asset board significantly higher.\n\nThe BTC Fear and Greed Index, a metric that measures the overall sentiment towards Bitcoin, reportedly stands at 66 indicating its presence in the so-called \"Greed\" territory.\n\nWith Bitcoin breaching all-time high levels, what is in store to see until Benzinga’s Benzinga's Future of Digital Assets conference in New York on Nov.14. Attend and learn more about what industry experts believe to be the threshold for cryptocurrency prices. The gathering is seen as pivotal for the digital assets community. The event will spotlight the latest trends, innovations, and challenges in the digital asset realm.\n\nAcross the board, cryptocurrencies Cardano (10%), Ripple XRP (9.2%), Polygon (8.9%), and Solano (8.3%) were leading the pack with significant gains in the past 24 hours while Dogecoin (7%), BNB Coin (5.3%), followed the list.\n\nEther In Focus: Ethereum (CRYPTO: ETH) witnessed a surge of 117.02% in its past 24-hour trading volume while the market cap swelled 9.7%, based on CoinMarketCap data. Prices have seen a jump of 9.6% in their single-day trade. The layer-2 network’s co-founder Vitalik Buterin’s crypto portfolio has increased by $57 million over the past week, based on blockchain analytics platform Arkham Intelligence, reported by CoinMarketCap. Vitalik holds almost 247,000 ETH spread across various publicly known wallet addresses.\n\nAlso Read Ethereum Tops $1,800 Following US PMI Data; Mina Emerges As Top Gainer\n\nThe SEC has also acknowledged Grayscale's spot ether ETF filing which will convert Ethereum Trust (ETHE) into a spot Ethereum ETF.\n\nSEC has acknowledged Grayscale's spot ether ETF filing...\n\nThis would be conversion of $ETHE into ETF. pic.twitter.com/JMmutgbakZ\n\n— Nate Geraci (@NateGeraci) October 23, 2023\n\nThe SEC filing indicates that Grayscale Investments believes that allowing Shares of the Trust to list and trade on the Exchange as an ETP (converting the Trust to a spot Ethereum ETP) would unlock over $1.6 billion of value.\n\nCoinGape reports that as per the technical chart, Ethereum's price has given a breakout above the $1,745 level after making a double bottom formation. Other technical indicators indicate a rally continuation going forward. If traders maintain their open buy orders it may lead to a potential 12.25% breakout to reach $1,958. If prices cross the $2,000 mark, the cryptocurrency will see a significant turning point.\n\nFind out what the experts have to say on Ethereum price trends. Meet and engage with other transformative Digital Asset and Crypto business leaders and investors at Benzinga's exclusive event: Future of Digital Assets. Tickets are flying: Get yours!\n\nU.Today reported that a pre-mine Ethereum wallet woke up after 8.2 years of dormancy. It reports 2,000 Ether coins in its address which are currently valued at $3.2 million. A Whale Alert tweet reported that the address moved all its 2,000 ETH to four different blockchain addresses.\n\nRead Next: Ethereum's 'Billionaire Tier' Accounts For Over 32% Of Its Total Available Supply\n\nImage: Shutterstock\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nGet insight into trading platforms. Compare the best online stock brokerages.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiNGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3BvbHlnb24tdG9rZW4tZXRoZXJldW0temvSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "Polygon's new zk-powered token is live on Ethereum mainnet - Blockworks",
        "content": "The new native token of Ethereum scaling solution Polygon has gone live on Ethereum mainnet.\n\nPolygon first revealed its intention to revamp its native MATIC token in July this year. This new token is designed to be “hyper-generational” and support a vast ecosystem of various zero knowledge layer-2 chains through a native re-staking protocol.\n\nThis means that POL holders will be able to use the token to validate various chains across Polygon, including Polygon PoS and Polygon zkEVM.\n\nPolygon PoS is currently one of the largest blockchain ecosystems today. It has a $758.28 million total valued locked (TVL) and a stablecoin market cap of almost $1.7 billion, according to information available on DeFiLlama. There are 480 dapps currently deployed on the network.\n\nThe transition from Polygon (MATIC) to POL is part of Polygon’s 2.0 plans, where the project aims to become the “value layer” of the internet.\n\nRead more: Polygon’s MATIC is getting a makeover: Founders release white paper for POL\n\nA Polygon representative did not respond to a request for comment by press time.\n\nSince the announcement of the news on X, Polygon’s existing native token, MATIC, has seen its price dip by 0.84%. POL, which has just launched, has seen its price increase to 2.6%, according to information available on CoinGecko.\n\nAt the time of writing, the POL token has seen a 24-hour trading volume of $97,795 and a fully diluted valuation of over $6.4 billion.\n\nUsers will have up to four years to transition their tokens from MATIC to POL, though the implementation has no specific deadline. Users who wish to transfer their tokens can do so by sending MATIC tokens to a designated POL smart contract that will automatically convert the deposited tokens.\n\nUpdated Oct. 26, 2023 at 10:05 am ET: Added quote from Polygon PR representative stating that POL is designed to be “hyper-generational.”\n\nUpdated Oct. 25, 2023 at 3:59 pm ET: Clarified context provided by Polygon PR representative. A previous version of this article described POL as “zk-based” instead of “zk powered.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9jcnlwdG8tcmFsbHktZXRoZXJldW0tZ2FzLWZlZXMtc3Bpa2UtcGVwZS1tZW1lY29pbnMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 24 Oct 2023 07:00:00 GMT",
        "title": "The Price of the Crypto Rally: Ethereum Gas Fees Spike Alongside PEPE and Memecoins - CCN.com",
        "content": "Key Takeaways\n\nEthereum-based memecoins including PEPE have been among the biggest gainers of the recent crypto market rally.\n\nThe price of Pepe coin has climbed over 37% in 24 hours.\n\nIn tandem with the flood of memecoin transactions, Ethereum gas fees have also spiked.\n\nWith Bitcoin currently trading at its highest price since the spring of 2022, it has lifted the entire crypto market. Among the top-gainers of the past 24 hours, several ERC-20 memecoins stand out for their Bitcoin-beating performance.\n\nAs the price of prominent meme tokens has increased, trading activity has exploded. But with an increase in the volume of transactions, Ethereum gas fees spiked to as high as 80 gwei on Tuesday, October 24, and have remained above average since.\n\nMeme Token Transaction Counts Surge\n\nIn the last 24 hours, ERC-20 the number of memecoin transactions has surged in tandem with significant price gains for some of the most popular tokens.\n\nLeading the charge, the volume of Pepe transactions increased by 220% over the course of a day, thanks to more than 14,000 individual transfers. During the same period, the token’s price increased by over 37%, helped along by news that the PEPE administrators had burned 6.9 trillion PEPE coins worth around $6M.\n\n6.9T $PEPE Tokens worth ~$6,000,000 have been burned. https://t.co/aN5LRUFz8u A new team of advisors have been brought on to guide Pepe forward. Uses for the remaining 3.79T tokens attributed to the original team CEX multi-sig wallet for strategic partnerships and marketing… pic.twitter.com/JN3ssvH0XL — Pepe (@pepecoineth) October 24, 2023\n\nMeanwhile, over 8,700 Shiba Inu transfers have seen the token’s transaction volume increase by more than 86%, while the coin’s price jumped around 6%.\n\nAway from the usual suspects, HarryPotterObamaSonic10Inu, which uses the ticker BITCOIN, could be on course to beat its August all-time high price of $0.19, having pumped nearly 40% in a day, clocking a 24-hour increase in transaction volumes of 188%.\n\nCrypto Rally Pushes Up Ethereum Gas Prices\n\nWhile it would be a stretch to pin a spike in Ethereum gas fees on any single meme coin, collectively, an increase in ERC-20 transactions is almost certainly behind the recent increase in gas prices. Moreover, a notable overlap between previous periods of high fees and past memecoin frenzies points to a positive correlation between fee gas prices and memecoin trading activity.\n\nPeaking just after 11 pm (UTC) on Monday, October 23, median gas fees briefly hit 80 gwei and have averaged 34.9 gwei during the past 24 hours.\n\nIn contrast, just 3 weeks ago, on October 8, the average Ethereum transaction fees dropped to 8.8 gwei, their lowest price since October 2022.\n\nHow Memecoins Affect Ethereum Gas Fees\n\nWith the exception of Dogecoin, the most popular memecoins today utilize the ERC-20 token standard, and therefore incur Ethereum gas fees each time they are transferred from one address to another.\n\n🚀 Meme coins pump, #Ethereum gas fees spike 400% $PEPE , $BITCOIN, and $SPX meme coins surge as much as 40% in the past 24 hours, driving #Ethereum gas fees to a high of over 45 #gwei . pic.twitter.com/4XgrrhoA4Z — Satoshi Talks (@Satoshi_Talks) October 24, 2023\n\nBut gas fees aren’t fixed at a set rate. Instead, their price fluctuates dynamically according to the level of network activity. When the number of transactions being processed by the Ethereum mainnet increases, so do gas fees. Conversely, when network activity declines, gas prices get cheaper.\n\nConsidering that memecoins make up some of the most actively traded ERC-20 tokens, it follows that a spike in meme coin transactions could bump gas fees for the entire Ethereum network."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tY3J5cHRvLWFuYWx5c3QtMTkwMC_SAUdodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2V0aGVyZXVtL2V0aGVyZXVtLWNyeXB0by1hbmFseXN0LTE5MDAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 24 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Set To Outperform: Crypto Analyst Predicts 18% Rise To $1,900 - NewsBTC",
        "content": "Ethereum (ETH) has so far relatively underperformed in comparison to the flagship cryptocurrency Bitcoin. However, that could change soon enough as a crypto analyst has predicted the second-largest crypto token by market to gain some momentum soon enough.\n\nEthereum To Hit $1900\n\nIn a post shared on his X (formerly Twitter) platform, prominent crypto analyst Ali Martinez mentioned that Ethereum could rise to as high as $1,900. His prediction was based on data that he had pulled up from the chart which he shared in his post.\n\nThe chart (a 3-day timeframe) featured an ascending triangle pattern, which usually represents a bullish formation. According to Ali, Ethereum is “poised” to rebound off the hypotenuse of the ascending triangle. Most importantly, for Ethereum to go as high as $1,900, the analyst noted that It has to experience a “firm close” above the 18-day SMA (Simple Moving Average).\n\nETH getting ready to breakout | Source: X\n\nIf that happens, Ethereum could hit $1,800 and further rise to $1,900 based on Ali’s predictions. It is worth mentioning that the last time Ethereum hit $1,900 was back in July 2023. A rise to that price again will represent about an %18 increase from its current price of $1,600.\n\nAli also had something to say about the flagship cryptocurrency, Bitcoin. In a subsequent post, he noted that the crypto token could see a correction to $28,800; a prediction he made based on the TD Sequential from a 4-hour chart.\n\nBitcoin rose to as high as $30,000 on October 20, with many speculating that a Spot Bitcoin ETF approval could be on the way, something that represents a bullish momentum for Bitcoin and the crypto market in general.\n\nETH price holding $1,600 | Source: ETHUSD on Tradingview.com\n\nBitcoin’s Dominance Is On The Rise\n\nData from TradingView shows that Bitcoin’s dominance has been on the rise this year, with the token currently boasting over 52% coin dominance in the crypto market. Interestingly, it has steadily risen since the Ethereum Merge occurred.\n\nThis is significant considering that many speculated that ‘the Flippening’ could happen after the Merge, where Ethereum overtakes Bitcoin to become the most dominant crypto token. However, that hasn’t happened so far, with Ethereum’s move from proof-of-work to proof-of-work being seen as ‘disastrous’ for the crypto token.\n\nBitcoin and Ethereum, however, share the podium when it comes to the best-performing assets of the year. Both crypto tokens are said to have outperformed the NASDAQ, S&P500, and Gold. Bitcoin has seen an %80 increase year-to-date (YTD), while Ethereum has seen a %35 increase YTD.\n\nFeatured image from Analytics Insight, chart from Tradingview.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMTAvMjUvdGhpcy1jeWJlcnNlY3VyaXR5LXByby1nZXRzLXBhaWQtdG8taGFjay1ldGhlcmV1bS1mb3ItdGhlLWdvb2Qtb2YtdGhlLW5ldHdvcmsv0gF7aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8xMC8yNS90aGlzLWN5YmVyc2VjdXJpdHktcHJvLWdldHMtcGFpZC10by1oYWNrLWV0aGVyZXVtLWZvci10aGUtZ29vZC1vZi10aGUtbmV0d29yay9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "This Cybersecurity Pro Gets Paid to Hack Ethereum – for the Good of the Network - CoinDesk",
        "content": "This Cybersecurity Pro Gets Paid to Hack Ethereum – for the Good of the Network\n\nOne of the techniques that his team deploys to protect the blockchain is “fuzzing,” a term borrowed from the software-development industry that’s become a common way of checking to make sure a system is secure and resilient.\n\nBy Margaux Nijkerk Oct 25, 2023 at 3:00 p.m. UTC"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMjQvZXRoZXJldW0tZmVlcy1zcGlrZS1hcy1tZW1lLWNvaW4tZnJlbnp5LXJldHVybnMtcGVwZS1iaXRjb2luLXNweC1wb3AtNDAv0gF4aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMC8yNC9ldGhlcmV1bS1mZWVzLXNwaWtlLWFzLW1lbWUtY29pbi1mcmVuenktcmV0dXJucy1wZXBlLWJpdGNvaW4tc3B4LXBvcC00MC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 24 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Fees Spike as Meme Coin Frenzy Returns; PEPE, HarryPotterObamaSonic10Inu, SPX6900 Pop 40% - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0tZW5kLW9mLW1vbnRoLWNoYWxsZW5nZS1jYW4tZXRoLXJlYWNoLTIwMDAtYW1pZC0yMS1iaWxsaW9uLWRlZmktdHZsL9IBbWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0tZW5kLW9mLW1vbnRoLWNoYWxsZW5nZS1jYW4tZXRoLXJlYWNoLTIwMDAtYW1pZC0yMS1iaWxsaW9uLWRlZmktdHZsL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 24 Oct 2023 07:00:00 GMT",
        "title": "Ethereum End Of Month Challenge: Can ETH Reach $2,000 Amid $21 Billion DeFi TVL? - NewsBTC",
        "content": "Ethereum (ETH) is poised for a significant breakthrough as it inches closer to the critical psychological barrier of $2,000, mirroring the bullish sentiment sweeping through the cryptocurrency market, largely led by Bitcoin (BTC).\n\nMarket analysts are optimistic about Ethereum’s potential breakout before October ends, with buy orders anticipated to fuel a substantial 12.25% surge, propelling the price to $1,958.\n\nIn addition, investors have steadfastly held onto their investments in DeFi assets within the Ethereum ecosystem, demonstrating unwavering confidence even in the face of the enduring crypto market challenges.\n\nDespite the tumultuous nature of the crypto market, these investors remain committed to the potential and promise of DeFi, believing in its ability to revolutionize traditional financial systems.\n\nAs per insights provided by DefiLlama, these assets collectively represent an impressive total value locked at $21.27 billion, reflecting the substantial trust and financial commitment placed in the Ethereum DeFi landscape by the investor community. This data solidifies its position as a cornerstone of the broader crypto financial landscape.\n\nEthereum TVL. Source: DeFiLlama\n\nAs traders eagerly await this upswing, trading volume is projected to witness a notable spike, reflecting growing investor interest in securing exposure to Ether beyond the current resistance levels.\n\nReinforcing the positive outlook, the Relative Strength Index (RSI) stands at 75, indicating that Ethereum’s upward trajectory is poised to persist. Nevertheless, caution prevails as oversold conditions may trigger profit-taking among traders keen on safeguarding their capital.\n\nThis dual sentiment of optimism and caution sets the stage for a crucial juncture in Ethereum’s price action.\n\nETH Signs Of Struggle Amidst A Resistance\n\nA separate analytical report underscores Ethereum’s recurring struggle with a key resistance level, evident from the persistent price fluctuations converging around this threshold. Historical data points to the ramifications of prolonged resistance, often resulting in sharp price retracements.\n\nFor Ethereum, this could imply a more pronounced market correction, particularly considering the broader market dynamics currently at play. Investors and traders are advised to closely monitor these resistance levels, which could significantly impact short-term market sentiment and price movements.\n\nETH market cap currently trading at $218.356 Billion on the daily chart: TradingView.com\n\nUnveiling Ethereum: Low Network Activity\n\nUnderlying Ethereum’s price fluctuations, an alarming trend emerges concerning the platform’s subdued network activity. Despite its reputation as a thriving ecosystem for decentralized applications, the recent dip in on-chain operations raises concerns about waning interest or a potential shift of focus towards alternative blockchain platforms.\n\nAn active network isn’t solely reliant on transaction volumes; it signifies ongoing development, upgrades, and the launch of new projects. The recent decline in network activity suggests a potential lull in these critical endeavors, prompting market participants to reevaluate the long-term sustainability of Ethereum’s dominance within the blockchain space.\n\nETH seven-day price action. Source: Coingecko\n\nAs Ethereum’s price hovers at $1,813, notching a 7.0% surge within 24 hours and a 14% upward trend over the past seven days, market observers remain vigilant as the cryptocurrency continues to navigate through critical resistance levels and grapples with network activity concerns.\n\nAs the cryptocurrency market continues to mature, Ethereum’s future trajectory is intricately linked to its ability to address these challenges and uphold its position as a leading blockchain platform, vital for the broader ecosystem’s growth and stability.\n\n(This site’s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk).\n\nFeatured image from Distinct Today\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMC8yNC9zb2xhbmEtYW5kLW9uZS1ldGhlcmV1bS1iYXNlZC1hbHRjb2luLWxpa2VseS10by1vdXRwZXJmb3JtLW5leHQtYnVsbC1tYXJrZXQtYWNjb3JkaW5nLXRvLWNyeXB0by1hbmFseXN0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 24 Oct 2023 07:00:00 GMT",
        "title": "Solana and One Ethereum-Based Altcoin Likely To Outperform Next Bull Market, According to Crypto Analyst - The Daily Hodl",
        "content": "A popular crypto trader is predicting that Solana (SOL) and another altcoin will be top performers in the next bull cycle for one key reason.\n\nPseudonymous analyst Bluntz tells his 224,800 followers on the social media platform X that the recent rallies by SOL and Chainlink (LINK) indicate the two alts will outperform other cryptos based on history.\n\n“So it seems of all the ‘majors,’ SOL and LINK are the two standout outperformers right now that I can see.\n\nIn my experience, the first runners usually continue to outperform all through the bull market.\n\nNaturally, people feel they missed the boat and want to chase other coins instead in hopes they are lagging. I’ve also done this myself from time to time, but it’s worth remembering that there usually isn’t ‘the next LINK’ or ‘the next SOL.’\n\nThe next LINK and SOL are going to keep being LINK and SOL IMO (in my opinion).”\n\nThe trader also weighs in on Ethereum (ETH) against Bitcoin (BTC) and predicts ETH/BTC may be at the start of an uptrend based on several indicators, including an engulfing candle.\n\nTraders watch for a bullish engulfing candle since it may suggest an asset’s downtrend is about to undergo a reversal.\n\n“Not only did ETH manage to close the weekly as an engulfing [candle], but also a confirmed weekly bull divergence.\n\nCouple that with the first test of the weekly 200 MA (moving average) on ETH/BTC and I think it’s setting up for quite a nice move up. A very welcome change after months of chop which feels like it might finally have come to an end.”\n\nA bullish ETH/BTC chart suggests that Ethereum will likely outperform Bitcoin.\n\nETH/BTC is trading for 0.0511 BTC ($1,753) at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE-3"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vYmxvY2tvbm9taS5jb20vZXRoZXJldW0tYnVsbHMtcHVzaC1ldGgtcHJpY2UtdG93YXJkLTIwMDAtYXMtdXB0cmVuZC1hY2NlbGVyYXRlcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 24 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Bulls Push ETH Price Toward $2,000 as Uptrend Accelerates - Blockonomi",
        "content": "Ethereum’s price has found renewed momentum this week, with bulls attempting to extend the uptrend towards the key $2,000 level.\n\nAfter consolidating under $1,700 for multiple weeks, Ethereum saw a bounce as Bitcoin rallied 15% higher in recent days. This allowed ETH to clear crucial resistance levels at $1,750 and $1,800.\n\nKeypoints\n\nEthereum price has started a decent increase after Bitcoin’s 15% rally, now trading above $1,780.\n\nETH price cleared the $1,750 and $1,800 resistance levels to reach a high of $1,849 before consolidating.\n\nKey support lies at $1,750 where a bullish trendline has formed on the hourly chart.\n\nResistance is seen at $1,850 and $1,880 levels. Breaking $1,880 could accelerate gains toward $2,000.\n\nThe hourly MACD is gaining momentum in the bullish zone, supporting the uptrend.\n\nHowever, failure to clear overhead resistances could lead to a downside correction. Strong support lies at $1,700 and $1,650.\n\nEther hit a weekly high of $1,849 before pulling back slightly. However, the bullish sentiment is evident by the rally clearing the 100-hour SMA and a rising trendline forming on the hourly chart.\n\nThe hourly MACD indicator also flipped bullish, supporting the building upside momentum. Analysts say ETH needs to break above the resistors at $1,850 and $1,880 to sustain the uptrend.\n\nThis could open the doors for an accelerated rally toward the $2,000 mark if buyers can flip these levels into support. Further gains above $2,000 would bring the 2022 high of $2,200 into play.\n\nOn the flip side, failure to hold the $1,750 trendline support could lead to a downward move toward $1,700 and $1,650 in the near-term. Traders expect strong defense of these levels from the bulls.\n\nBut for now, buyers seem to be back in control after weeks of bearish sentiment. The recent surge also comes as Bitcoin reclaimed $34,000, lifting the overall crypto market sentiment.\n\nIf the Ethereum bulls can build on this momentum, we could be in the early stages of a new uptrend after months of depressed prices across crypto assets."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9ldGhlcmV1bS1wcmljZS1vdXRsb29rLWNhbi1ldGgtaGl0LTJrLXRoaXMteWVhci1hcy10aGlzLXRva2VuLWFsc28tbG9va3MtcG9pc2VkLXRvLXN1cmdlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Price Outlook: Can ETH Hit $2k This Year as This Token Also Looks Poised to Surge - CryptoPotato",
        "content": "Ethereum (ETH) has showcased strong performance over the past week, with the token’s price up 15% since Thursday.\n\nWith growing retail and institutional interest, many ETH holders are optimistic about it reaching the $2,000 level before the end of the year.\n\nMeanwhile, the newly launched Bitcoin Minetrix (BTCMTX) project is also making waves, offering investors an intriguing opportunity to get in on the ground floor before the token hits the open market.\n\nEthereum Poised to Hit $2,000 Amid Renewed Bullish Momentum\n\nETH is trading around the $1,787 level after posting six bullish daily closes in a row.\n\nThis sharp surge has taken ETH above the 50-day and 200-day Exponential Moving Averages (EMAs) on the daily time frame, indicating that the token’s trend has definitively shifted.\n\nETH has also breached the strong resistance level at $1,740, which had capped price twice since August.\n\nZooming out, the token has emerged from the tight trading range it was trapped in for over two months, signaling newfound bullish momentum that could pave the way toward $2,000 in the near term.\n\nIf ETH were to hit $2,000, it would represent a further 12% push from today’s price and take the token to its highest value since July.\n\nWith spot trading volumes exceeding $11.7 billion in the past day and investor sentiment positive, Ethereum is in a solid position to sustain its trajectory and potentially reach this key milestone in the weeks ahead.\n\nConfluence of Factors Propels Ethereum’s Price Rally\n\nEthereum’s bullish momentum can be attributed to a confluence of positive factors.\n\nFirst, the recent Bitcoin price surge to $35,000 for the first time in over a year is lifting the broader crypto market.\n\nAs the world’s second-largest coin, Ethereum often benefits from Bitcoin’s price rallies.\n\nSecond, Ethereum is surging in part thanks to renewed optimism around a potential spot Bitcoin ETF approval.\n\nIf approved, a spot BTC ETF is expected to bring significant new institutional investment into the crypto space, likely benefiting Ethereum.\n\nLastly, recent outflows from major crypto exchanges, such as over $500 million from Binance in 24 hours, signals that traders are moving assets into secure storage in anticipation of rising crypto prices.\n\nWith all these factors at play, many crypto community members believe Ethereum is poised to continue its surge to $2,000 – and possibly even higher.\n\nBitcoin Minetrix Also Bullish, Project Offers Exciting New Way to Earn as Crypto Bull Run Accelerates\n\nAs Ethereum and the broader crypto market continue to build momentum, another emerging token that looks well-positioned to surge is Bitcoin Minetrix (BTCMTX).\n\nStill, in the early stages of its presale, Bitcoin Minetrix aims to disrupt the world of Bitcoin mining by tokenizing cloud mining credits on the Ethereum blockchain.\n\nBy doing this, Bitcoin Minetrix enables everyday investors to gain exposure to BTC mining rewards, not just the coin’s price movements.\n\nGiven Bitcoin’s recent resurgence and the growing expectations of a prolonged bull run, the timing looks ideal for Bitcoin Minetrix to launch and allow users to earn recurring BTC payouts.\n\nNot only that, but Bitcoin Minetrix allows users to stake their BTCMTX tokens to earn yields of 259% per year – with over 161 million tokens staked already.\n\nEarly investors can buy BTCMTX tokens for just $0.0112 during Stage 3 of the ongoing presale event.\n\nHowever, the presale price will increase by 10% once the stage’s funding goal of $3.1 million has been met – a milestone expected to be hit in the coming days, given the current investment momentum.\n\nOnce Bitcoin Minetrix’s presale ends, the developers plan to launch BTCMTX on numerous top exchanges, creating additional liquidity and potentially driving up demand.\n\nWith over 4,100 people following the project’s Twitter page and the official Telegram channel seeing robust growth, Bitcoin Minetrix looks primed to capitalize on this engagement and make a strong market entrance.\n\nVisit Bitcoin Minetrix Presale\n\nDisclaimer: The above article is sponsored content; it’s written by a third party. CryptoPotato doesn’t endorse or assume responsibility for the content, advertising, products, quality, accuracy, or other materials on this page. Nothing in it should be construed as financial advice. Readers are strongly advised to verify the information independently and carefully before engaging with any company or project mentioned and do their own research. Investing in cryptocurrencies carries a risk of capital loss, and readers are also advised to consult a professional before making any decisions that may or may not be based on the above-sponsored content.\n\nReaders are also advised to read CryptoPotato’s full disclaimer."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLXByaWNlLWFzLWRlZmktdHZsLWhpdHMtMjEtYmlsbGlvbi1jYW4tZXRoLWxpZnQtdG8tMmstaW4tb2N0b2Jlci_SAWJodHRwczovL2NvaW5nYXBlLmNvbS9ldGhlcmV1bS1wcmljZS1hcy1kZWZpLXR2bC1oaXRzLTIxLWJpbGxpb24tY2FuLWV0aC1saWZ0LXRvLTJrLWluLW9jdG9iZXIvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 24 Oct 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Price On The Move To $2,000 As DeFi TVL Hits $23 Billion - CoinGape",
        "content": "Ethereum price is on the verge of breaking out and closing in the coveted psychological resistance at $2,000. Interest in the largest smart contracts token has continued to increase with Bitcoin price reclaiming resistance/support at $31,000.\n\nMost traders anticipate a continued bullish action across the market, with ETH following closely in the footsteps of the bellwether cryptocurrency and starting the second recovery phase beyond $2,000 and targeting areas around $2,500 and $3,000 respectively.\n\nadvertisement\n\nEthereum Price Prediction: ETH On The Cusp of Validating 12% Move\n\nEthereum completed the formation of a double-bottom pattern following a rebound from support at $1,530, which currently awaits validation at $1,745 (neckline resistance).\n\nThe presence of two golden cross patterns formed when the 21-day Exponential Moving Average (EMA) (red) crossed above the 1000-day EMA (blue) and subsequently above the 200-day EMA (purple), hints at the uptrend’s continuation.\n\nIf traders keep their buy orders open, they are likely to build momentum for a 12.25% breakout to $1,958. Following the breakout, trading volume is expected to surge significantly as traders seek fresh exposure to Ether above the neckline resistance.\n\nThe Relative Strength Index (RSI) with a strength of 75 reveals that Ethereum price is in a position to keep the uptrend intact. However, caution is advised due to the oversold conditions likely to encourage traders to sell ETH to book profits, or protect their capital.\n\nBased on the money floor index (MFI), bulls have the upper hand. This indicator tracks the inflow and outflow of money, hence a persistent increase implies that buyers are in control of the uptrend.\n\nThe MFI with a strength of 76 is not yet oversold implying that there is still room for growth. With Ethereum price at $1,690 on Monday, a break above $1,700 is required to secure the uptrend and affirm the bullish outlook to $2,000.\n\nTrading above $2,000 would be a game changer for Ethereum bulls and might be the catalyst the token has been waiting for to start the bull run. On the downside, failure to retain support at $1,670 and $1,630 could trigger another sell-off to $1,550. However, as long as Ethereum holds above all the moving averages, the path with the least resistance will remain to the upside.\n\nEthereum DeFi TVL Grows To $23 Billion\n\nThe transition to the proof-of-stake (PoS) consensus mechanism from a proof-of-work (PoW) protocol opened Ethereum to a whole new decentralized finance (DeFi) world backed by the rise of liquid staking tokens like Lido and Rocket Pool.\n\nDespite the lengthy crypto winter, investors have maintained exposure to DeFi products within the Ethereum ecosystem, which according to data by Defi Llama has a total value locked of $21.27 billion. The ecosystem’s 24-hour inflows increased to $45 million with with $1.49 million recorded as revenue.\n\nRelated Articles"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvbWFya2V0cy9ldGhlcmV1bS1iaXRjb2luLXJhdGlvLW1ha2VzLW5ldy15ZWFybHktbG93cy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 24 Oct 2023 07:00:00 GMT",
        "title": "ETH/BTC ratio makes new yearly lows amid hype over spot Bitcoin ETF approval - DLNews",
        "content": "Anticipation of a spot Bitcoin ETF being approved has driven up the price of Bitcoin in the past week.\n\nMeanwhile, Ethereum’s lack of a “compelling long-term narrative” and concerns related to Ethereum staking and its implications for the network have moderated its gains.\n\nEthereum’s price in Bitcoin, as tracked by a trading pair called ETHBTC, continues to lose ground amid hype around potential Bitcoin spot ETF approval in the US.\n\nETHBTC fell to 0.051 yesterday, falling to its lowest level this year and slipping close to its June 2022 lows of around 0.049, per TradingView. Traders monitor ETHBTC to gauge the strength of Ethereum against the benchmark cryptocurrency, Bitcoin.\n\nThe last time this ratio dipped below 0.049 was prior to May 2021.\n\nOver the past week, Bitcoin has gained nearly 20% to reach a new yearly peak of $35,157 on Coinbase, likely due to optimism around Bitcoin ETF approval in the US.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\nOn the other hand, Ethereum’s price had a more modest increase of 13.4% during the same period. The asset was last trading 15% lower from its 2023 peak of $2,140.\n\nBitcoin and Solana-based investment products saw inflows of around $112 million and $43 million, respectively, compared to $4.7 million in outflows from Ethereum-based funds this month to date, per a report from digital asset management firm CoinShares published on Monday.\n\nIn fact, Ethereum has experienced the highest outflows this year, totaling $119 million, followed by Tron, per the CoinShares’ report.\n\nJames Butterfill, the head of research at CoinShares, attributed the positive flows in Bitcoin to “anticipation of a spot Bitcoin ETF” and “continued concerns over Ethereum.”\n\nJoin the community to get our latest stories and updates\n\nRecently, the market has grown hopeful around an approval by the US securities regulator in light of the recent court victory by Grayscale over a previous rejection and a flurry of applications for Bitcoin spot ETF by traditional finance heavyweights such as BlackRock, Fidelity, and Ark Invest.\n\nBitfinex analysts told DL News that the “primary bullish narrative for the market has been ETF products” while Ethereum has lacked a “compelling long-term narrative.”\n\nThey added “every bullish narrative for Ethereum has resulted in less significant spikes for the Bitcoin-Ethereum ratio.”\n\nBenjamin Jarvis, co-founder of analytics outlet JLabs Digital told DL News that, “Institutions might feel more comfortable investing in a Bitcoin spot ETF because they perceive it as less risky compared to Ethereum futures.”\n\nEarlier this month, six Ethereum-futures-based ETFs launched in the US. However, their opening trading was sluggish, and they haven’t garnered significant demand since their introduction.\n\nMoreover, the Bitfinex analysts added that “we are in the early phases of a bull market where it is normal for Bitcoin to move up first and then allow a rotation of capital as investors search for lagging beta plays” like Ethereum.\n\nConcerns over Ethereum\n\nCoinShares analyst Luke Nolan discussed various concerns related to Ethereum staking and its implications for the network in a recent report.\n\nEthereum staking refers to securing the network’s proof-of-stake consensus mechanism by depositing Ether into the staking contract and earning rewards in return.\n\nNolan raised centralisation concerns over Lido, the leading liquid staking derivative platform on Ethereum, which commands a dominant share of 31.5% of all the staked Ether, or 8.7 million Ether— worth $15.6 billion — per a Dune dashboard by Hildobby, the pseudonymous head of data at crypto venture fund Dragonfly.\n\nHe also addressed the concern of the growing number of validators. More validators mean more load on the existing validators, which can impact the network’s performance and require significant hardware upgrades.\n\nAn increase in the number of validators also reduces the yields for individual validators, which can lead to an exodus of Ether stakers.\n\nAdditionally, Nolan suggested the possibility of an “untested economic regime” where the staked Ether market cap becomes larger than the unstaked Ether market cap, which could raise unfounded risk.\n\nLastly, the recent drop in fees and Ethereum turning inflationary also contribute to the lack of demand.\n\nEthereum’s supply has grown at a rate equivalent to 0.37% per annum over the last 30 days as the staking rewards exceeded the amount of Ether burnt in transaction fees, according to Ethereum data tracker ultra sound money.\n\nCorrection: The article has been updated to reflect that 8.7 million Ether was staked via Lido."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzEwLzI0L29uZS1ldGhlcmV1bS1yaXZhbC1nYWluZWQtc3RlYW0taW4tcTMtMjAyMy1hY2NvcmRpbmctdG8tYmluYW5jZS1yZXNlYXJjaC_SAW5odHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMC8yNC9vbmUtZXRoZXJldW0tcml2YWwtZ2FpbmVkLXN0ZWFtLWluLXEzLTIwMjMtYWNjb3JkaW5nLXRvLWJpbmFuY2UtcmVzZWFyY2gvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 24 Oct 2023 07:00:00 GMT",
        "title": "One Ethereum Rival Gained Steam in Q3 2023, According to Binance Research - The Daily Hodl",
        "content": "A new report from Binance Research claims that one Ethereum (ETH) competitor ignored the greater crypto market trend and witnessed a surge in activity in the third quarter of this year.\n\nResearchers at the top global crypto exchange by trading volume note that the smart contract platform NEAR Protocol (NEAR) clocked 120% quarter-on-quarter growth in terms of average monthly transactions.\n\nExplains Binance Research,\n\n“Blockchain activity generally declined across the board in Q3 with a fall in the number of transactions across most blockchains. Notwithstanding that NEAR is starting from a low base, it has witnessed increasing usage driven by top-down partnerships and grassroots initiatives.”.\n\nThe researchers also note that NEAR Protocol registered an increase in daily active addresses in a quarter where most smart contract platforms suffered a decrease. The project reached an average of 650,000 daily active addresses and passed both Ethereum and Solana (SOL) in terms of that metric in September.\n\nUSDC, the second-largest stablecoin by market cap, launched on NEAR in September, which helped fuel the protocol’s surge in active addresses, according to Binance Research.\n\nNEAR Protocol is focused on scalability and stability. The project aims to allow developers to build decentralized applications at low cost.\n\nThe protocol’s native asset, NEAR, is trading at $1.12 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vY29pbnBlZGlhLm9yZy9wcmljZS1hbmFseXNpcy9ldGhlcmV1bS1wcmljZS1icmVha3Mtb3V0LW9mLWl0cy1rZXktcmVzaXN0YW5jZS13aGF0cy1uZXh0LWZvci1ldGgtcHJpY2Uv0gFyaHR0cHM6Ly9jb2lucGVkaWEub3JnL3ByaWNlLWFuYWx5c2lzL2V0aGVyZXVtLXByaWNlLWJyZWFrcy1vdXQtb2YtaXRzLWtleS1yZXNpc3RhbmNlLXdoYXRzLW5leHQtZm9yLWV0aC1wcmljZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Price Breaks Out Of Its Key Resistance! What’s Next For ETH Price? - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nFollowing the news of Bitcoin ETF, the crypto market has gained significant value movement. The information has attracted more institutional traders, resulting in the price experiencing a massive jump in value.\n\nBitcoin price has recorded a surge of over 19% in value in the past week, breaking the price out of its important resistance level of $31,000.\n\nThe Ethereum price has displayed a massive price action in its value and has followed the footsteps of the market leader as it has jumped over 14% within the past week, resulting in the altcoin breaking out of its key resistance at $1,745.26 for the first time in over 50 days, further indicating a bullpower in the market.\n\nTradingView: ETH/USDT\n\nETH price had witnessed a significant fall in its value from $1,850 to $1,650 during mid-August, following which the star altcoin lost momentum and started trading in a closed range of $1,600 and $1,686. The coin attempted to break out and start a bullish jump, but the price repeatedly got rejected at $1,745.26, making it a key resistance level.\n\nFurther, the ETH coin was seen trading under a bearish influence, resulting in the coin breaking down its crucial support level at $1,600. Ethereum then started trading close to its lower support level at $1,539.01 for a short period, following which the market gained momentum.\n\nThe ETH price broke out of multiple resistance levels to test its important resistance level at $1,800 and successfully managed to cross it, but the rally was short-lived as the bears pulled back the price below the $1,800 mark, forming a long wick in the chart.\n\nThe MACD displays a robust rising green histogram in its chart, indicating a massive ongoing price action for the Altcoin. Further, the averages show a rising pattern, suggesting the price to continue rising in the coming days.\n\nWill ETH Price Rise Again?\n\nIf the bulls continue to hold the price and push it above the $1,800 mark, the ETH price will regain momentum and prepare to test the upper resistance level of $1,916.13 soon.\n\nFurther, if the bulls continue to dominate the market, the price will make a run to reclaim its $2,000 mark in the coming month.\n\nConversely, suppose the bears regain power over the bulls, and a trend reversal occurs. In that case, the ETH price will experience a drop below its support level at $1,745.26 and continue to plunge and test its lower support level of $1,686.77 in the coming days.\n\nMoreover, if the bulls fail to hold the price at that level, the price will continue to dip and test its crucial support level at $1,600 in the coming days."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vY29pbnBlZGlhLm9yZy9wcmljZS1hbmFseXNpcy9iaXRjb2luLWFuZC1ldGhlcmV1bS1wcmljZS1zdXJnZS1hcy1idWxsaXNoLW1vbWVudHVtLWdhaW5zLXN0ZWFtL9IBamh0dHBzOi8vY29pbnBlZGlhLm9yZy9wcmljZS1hbmFseXNpcy9iaXRjb2luLWFuZC1ldGhlcmV1bS1wcmljZS1zdXJnZS1hcy1idWxsaXNoLW1vbWVudHVtLWdhaW5zLXN0ZWFtL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 24 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Price Surge as Bullish Momentum Gains Steam - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nCryptocurrencies, including Bitcoin, experienced an upswing on Monday as the recent bullish trend in the crypto market extended through the weekend. The prospect of a potential approval for a spot Bitcoin exchange-traded fund (ETF) in the United States added to the positive momentum, resulting in interest from investors.\n\nBitcoin maintained its upward trajectory, climbing over 3% and hovering around the $31,000 mark. Meanwhile, Ethereum also recorded a similar gain with a more than 3% increase, approaching the $1,700 level. Many other altcoins also saw gains.\n\nAccording to analyst Rekt Capital, breaking past the critical resistance level of approximately $31,000 is the last step in negating a bearish Bitcoin pattern. Should it reclaim this level as support or achieve a weekly close above it, this would likely confirm a breakout from the current trading range.\n\nHowever, until that happens, there remains a possibility of a pullback to around the $27,000 level. It’s interesting to note that, historically, Bitcoin retraced around -25% in 2015 and -38% in 2019 during similar points in its market cycle, less than 190 days before the Halving event.\n\nCrypto Tony, another market analyst, highlighted the cyclical nature of the cryptocurrency market, noting that Bitcoin tends to lead the way with liquidity moving in its direction. This explains the drop in the Ethereum-to-Bitcoin ratio as investors divert their funds towards Bitcoin.\n\nRegarding Ethereum, he stressed the significance of breaking above the $1,745 price level. In terms of Bitcoin, he expects a level of resistance and a minor pullback at around the range highs of $31,500. This point is where bears may challenge the bullish momentum."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2V0aGVyZXVtLW5ld3MvdGhpcy1wYXR0ZXJuLXBvaW50cy10by0xMDAwMC1ldGhlcmV1bS1wcmljZS1idXQtd2hlbi_SAV9odHRwczovL3d3dy5uZXdzYnRjLmNvbS9ldGhlcmV1bS1uZXdzL3RoaXMtcGF0dGVybi1wb2ludHMtdG8tMTAwMDAtZXRoZXJldW0tcHJpY2UtYnV0LXdoZW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 24 Oct 2023 07:00:00 GMT",
        "title": "This Pattern Points To $10,000+ Ethereum Price, But When? - NewsBTC",
        "content": "This week, Bitcoin and other altcoins livened up the crypto market, potentially lifting up Ethereum price and saving it from further collapse.\n\nWith ETH now moving away from the bottom trend line of a massive long-term price pattern, the next possible target is the upper trend line of the same pattern. That target points to $10,000 per Ether, but how long might it take to reach the lofty price objective?\n\nEthereum Rising Wedge Targets $10,000 Or More\n\nFor almost its entire history of price action, ETHUSD has been filling out what appears to be a massive rising wedge pattern. Such patterns are predominantly bearish, breaking down roughly 60% of the time.\n\nThat leaves 40% of the time that these patterns break upward. Descriptions of the pattern reveal that wedges are notoriously prone to false breakouts and/or false breakdowns, where price violates one trend line, only to reverse and target the other.\n\nIn the latest case, however, Ethereum is holding the bottom line. This makes the next logical target the upper trend line, with at least some probability that it can break upward still. The trend line, happens to be located at around $10,000 per ETH currently and rises with each passing day.\n\nWhen ETHUSD touches the upper trend line is still up for question, but considering the length of past rallies lasting anywhere between six months to a year, it may be less of a wait than many expect.\n\nIs $10,000 per ETH next? | ETHUSD on TradingView.com\n\nIs This The Beginning Or End of ETH?\n\nEver wonder why a rising wedge pattern can break upward if it is a bearish pattern? In Elliott Wave Principle, wedges fall into the diagonal family of patterns. Diagonals can be leading or ending, expanding on contracting.\n\nA leading diagonal kicks off a sustained move. It’s wedge-like appearance is deceiving as traders expect the pattern to break down, yet instead it breaks upward. In contrast, an ending diagonal finishes off a sustained move. In this case, the bearish breakdown that should be expected in a rising wedge plays out.\n\nEthereum is potentially in a massive diagonal pattern, not the rising wedge that it appears. What we also don’t know is if this is the beginning of a larger sustained move and a leading diagonal, or the end of the largest altcoin’s dominance capped off by an ending diagonal.\n\nBoth patterns form in a five-wave pattern. Unlike standard Elliott Wave patterns, diagonals have unique rules. For example, wave 1 must be the longest, wave 4 must enter wave 1 territory, and wave 5 is the shortest of the waves. Since this is the last wave and potentially the shortest of them all, the touch of the upper trend line could be on the way soon.\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vdGhlZGVmaWFudC5pby9wb2x5Z29uLWRlcGxveXMtcG9sLXRva2VuLW9uLWV0aGVyZXVt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "Polygon Deploys POL Token On Ethereum - The Defiant - DeFi News",
        "content": "New POL token will facilitate restaking for multi-chain Polygon ecosystem\n\nBy: Samuel Haig • Loading...\n\nDeFi News\n\nPolygon's new POL token is live on the Ethereum mainnet.\n\nPolygon announced the news on Oct. 25, comprising a major milestone in the project’s ongoing “2.0” overhaul. The roadmap seeks to establish Polygon’s various scaling solutions as an interoperable ecosystem, launch a new staking layer, and unify its PoS Chain and ZkEVM networks.\n\nPOL will power Polygon's upcoming revamped staking layer. The layer will support restaking, allowing stakers to simultaneously perform multiple tasks for different Polygon networks — including transaction sequencing, proof generation, and committee participation. POL will also comprise the network token for Polygon chains.\n\n“The launch of POL is a major milestone on the Polygon 2.0 roadmap, but it’s only the beginning,” said Mihailo Bjelic, the co-founder of Polygon. “It paves the way for a number of upgrades, including launching a new staking layer to power Polygon L2s, upgrading Polygon PoS to zkRollup, and implementing an... interoperability and shared liquidity protocol for all these L2s.”\n\nThe launch follows months of development and a successful testnet deployment. Polygon previously said it aims to enable migrations from its existing MATIC token to POL by the end of the year.\n\nPolygon 2.0\n\nPolygon first unveiled its 2.0 roadmap in June before outlining plans for a governance overhaul in July. The upgrades seek to consolidate and unify Polygon’s various scaling solutions into an interconnected ecosystem secured by a shared staking layer.\n\nPolygon’s ecosystem currently spans its Layer 2 rollup, ZkEVM, its long-standing Ethereum sidechain, PoS Chain, and its Layer 3 architecture, Supernets. Polygon also continues to develop Miden, a ZK-STARK-based L2.\n\nPolygon’s new staking layer will leverage “restaking” to allow validators to secure its various chains using a single token.\n\nRestaking was pioneered with the launch of EigenLayer on Ethereum in June. EigenLayer allows Ethereum stakers to validate third-party services while also securing the Ethereum blockchain to earn additional yields on top of staking rewards. However, the mechanism also comes with increased slashing risks, meaning restakers could be penalized if the services they secure misbehave.\n\nPolygon designed its restaking mechanism to exclusively service chains within its own ecosystem, reducing the threat of slashing penalties.\n\nDeFi Alpha Premium Content DeFi Daily | Weekdays\n\nDeFi Alpha Letter | Weekly\n\nDefiant Podcast Transcript | Weekly\n\nInbox Dump | Saturday\n\nWeekly Recap | Sunday Looking for Alpha? Become a premium member of The Defiant and join our DeFi Alpha community. Start for free\n\nOn Oct. 19, the project unveiled the Polygon Protocol Council, a 13-person council tasked with executing system smart contract upgrades on the Ethereum mainnet. The council spans prominent web3 community members and service providers."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMC8yNS93aGFsZXMtc2hvd2luZy1tb3JlLWludGVyZXN0LXRoYW4tZXZlci1pbi1ldGhlcmV1bS1iYXNlZC1hbHRjb2luLWFtaWQtODMyLXJhbGx5LWluLXR3by1tb250aHMtc2FudGltZW50L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "Whales Showing More Interest Than Ever in Ethereum-Based Altcoin Amid 832% Rally in Two Months: Santiment - The Daily Hodl",
        "content": "The crypto analytics firm Santiment says that whales are showing significant interest in a red-hot Ethereum (ETH)-based Chainlink (LINK) rival.\n\nThe native asset of decentralized oracle protocol Tellor (TRB) clocked 51 unique $100,000+ transactions on Monday, a new all-time high.\n\nTRB is trading at $91.66 at time of writing, up from around $9.83 two months ago, a staggering increase of more than 832%. Despite the massive gains, however, the asset remains more than 43% down from its all-time high of $161.12, which it hit in May 2021.\n\nSantiment also notes that TRB’s unique active addresses and newly created addresses are both surging.\n\n“Tellor’s price has now jumped ~+750% since July, and whales are showing more interest than ever before while new addresses continue to pour in. TRB is now the #192 market cap asset (and rising) as it leads the altcoin charge here in October.”\n\nAdditionally, the analytics firm notes that LINK, blockchain scaling solution Polygon (MATIC), layer-1 blockchain Aptos (APT), and lending platform Aave (AAVE) are all witnessing their “best-performing de-couplings” of the year.\n\n“Unlike Bitcoin’s previous two brief visits to $30,000, this latest resistance level break to end the weekend has occurred as altcoins surge, rather than falling behind BTC’s price.”\n\nLINK, the 14th-ranked crypto asset by market cap, is trading at $10.31 at time of writing. MATIC, the 13th-ranked, is worth $0.625. APT, ranked 35th, is currently changing hands at $6.23. The 41st-ranked AAVE is trading for $83.31.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMjUvYXJlLXJpc2luZy15aWVsZHMtcHV0dGluZy10aGUtc3F1ZWV6ZS1vbi1kZWZpL9IBXmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMjUvYXJlLXJpc2luZy15aWVsZHMtcHV0dGluZy10aGUtc3F1ZWV6ZS1vbi1kZWZpL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "Are Rising Yields Putting the Squeeze on DeFi? - CoinDesk",
        "content": "Why did people get so excited about bitcoin ETFs and their odds of winning U.S. approval? A normally boring website for the normally boring Depository Trust & Clearing Corp. I've told more than one young financial journalist over the years that clearing is a vital part of financial markets, yet it's generally a dull topic, so it's important when writing about clearing to stress the former to overcome the latter. But it turns out DTCC can spark excitement! BlackRock's proposed ETF showed up on a DTCC webpage, complete with a CUSIP and ticker symbol. Crypto folks thought that was good news, maybe even a sign BlackRock's application had been approved. It definitely didn't mean that, though it's not exactly bad news that BlackRock is completing this prep work, getting a CUSIP and ticker, etc. This possibly misguided optimism likely fueled some, or maybe even most, of Monday's big bitcoin rally. But boring websites giveth and boring websites taketh away. By Tuesday, BlackRock's ETF had vanished from the DTCC site. Bitcoin fell . Later in the day, DTCC revealed something to CoinDesk that meant people probably shouldn’t have gotten so worked up this week: The BlackRock ETF has been on that page since August."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMikQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMC8yNC90b3AtdHJhZGVyLXNheXMtYml0Y29pbi1ub3ctaW4tcHJvbWlzaW5nLXBvc2l0aW9uLWZvci1sb25nLXRlcm0tcmFsbHktdXBkYXRlcy1vdXRsb29rLW9uLWV0aGVyZXVtLWJhc2VkLWFsdGNvaW4v0gGVAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzEwLzI0L3RvcC10cmFkZXItc2F5cy1iaXRjb2luLW5vdy1pbi1wcm9taXNpbmctcG9zaXRpb24tZm9yLWxvbmctdGVybS1yYWxseS11cGRhdGVzLW91dGxvb2stb24tZXRoZXJldW0tYmFzZWQtYWx0Y29pbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 24 Oct 2023 07:00:00 GMT",
        "title": "Top Trader Says Bitcoin Now in Promising Position for Long-Term Rally, Updates Outlook on Ethereum-Based Altcoin - The Daily Hodl",
        "content": "A trader who accurately called Bitcoin’s (BTC) May 2021 crash believes that the crypto king is now in a position to ignite a fresh uptrend.\n\nPseudonymous analyst Dave the Wave tells his 140,700 followers on the social media platform X that Bitcoin’s weekly moving average convergence divergence (MACD) indicator just flipped bullish at the zero level, indicating that BTC may be gathering steam.\n\nThe MACD is a momentum indicator that can signal the reversal of an asset’s trend.\n\nSays Dave the Wave,\n\n“Weekly BTC MACD re-crossing from a promising position low on the zero-line.\n\nA less volatile price action as compared to last time.”\n\nDave the Wave also says that Bitcoin will likely move above the 200-month moving average (MWA) and rally above the “buy zone” of his logarithmic growth curve (LGC) model.\n\nThe LGC aims to plot the highs and lows of Bitcoin’s long-term market cycles while filtering out short-term volatility and noise.\n\nSays the trader,\n\n“Prediction going forward: the 200 MWA will remain in the BTC LGC buy zone [though of course price will not].”\n\nAt time of writing, BTC is worth $34,600.\n\nThe trader is also keeping an eye on the price action of the decentralized oracle Chainlink (LINK). Dave the Wave notes that LINK looks bullish after breaching multiple diagonal resistances and breaking out of its accumulation zone.\n\n“Remember folks, the name of the game is opportunity, which comes with volatility.\n\nYou can obsess all you like ad nauseam over an abstract truth, or think about how to actually take real profit in the real world.”\n\nThe trader also says that it is within the realm of possibility for LINK to revisit its all-time high of $52.70.\n\nAt time of writing, LINK is worth $10.43.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE-3"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vZGVjcnlwdC5jby8yMDMyMjYvcG9seWdvbi1sYXVuY2hlcy1uZXctcG9sLXRva2VuLWV0aGVyZXVt0gFHaHR0cHM6Ly9kZWNyeXB0LmNvLzIwMzIyNi9wb2x5Z29uLWxhdW5jaGVzLW5ldy1wb2wtdG9rZW4tZXRoZXJldW0_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "Polygon Deploys New POL Token Contracts on Ethereum - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nNew Polygon, new token.\n\nAs the multi-chain scaling solution continues to roll out its updated roadmap, Polygon today finally deployed the token contracts for its new POL token on Ethereum.\n\nA token contract is a type of smart contract that has the records and utilities powering a token, like its supply and who holds what balance.\n\nAD\n\nAD\n\nPOL will replace the network's current MATIC token; the network will not support two tokens. MATIC holders will have four years to migrate their holdings to the new token.\n\nThe POL token was first announced back in July and is expected to play a critical role in the network's wider upgrade.\n\nOriginally launched as a proof-of-stake network to help Ethereum scale, Polygon has become a sprawling series of different tech solutions, including application-specific blockchains and zero-knowledge Ethereum Virtual Machine-based (EVMs) networks.\n\nThe former refers to networks optimized for a specific use case, like gaming or stablecoins, for instance, and may even have their own native cryptocurrency.\n\nThe latter is a broader spectrum scaling solution and joins a host of zk-specific scaling solutions like zkSync Era, Starknet, and Linea.\n\nAD\n\nAD\n\nTo help secure all these networks, the POL token will reportedly let users stake their holdings across as many compatible chains as they wish.\n\nThis means that as soon as they deposit their holdings, they start earning protocol rewards and transaction fees on each staked chain.\n\nIn terms of what's next on the roadmap, Polygon has hinted at moving its PoS chain to a pure-play zkRollup as well as introducing a new interoperability standard for its various chains.\n\nEdited by Stephen Graves"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvbm9jdHVybmUtbGFicy10by1hZGQtcHJpdmF0ZS1hY2NvdW50cy1vbnRvLWV0aGVyZXVtLWF0dHJhY3RzLXZpdGFsaWstYnV0ZXJpbi1pbnRlcmVzdC1pbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "Nocturne Labs To Add Private Accounts Onto Ethereum, Attracts Vitalik Buterin Interest In Seed Funding Round - Nasdaq",
        "content": "U.S.-based crypto startup company Nocturne Labs raised $6 million in seed funding with Bain Capital Crypto and Polychain Capital co-leading the round. Ethereum co-founder Vitalik Buterin, Bankless Ventures, Hack VC and Robot Ventures are among the other participants.\n\nNocturne Labs wants to bring private accounts to the Ethereum ecosystem and enable anonymous transactions.\n\nFind out more on how crypto startups are attracting funds. Meet and engage with other transformative Digital Asset and Crypto business leaders and investors at Benzinga's exclusive event: Future of Digital Assets. Tickets are flying: Get yours!\n\nThe seed funding started in January 2023 and ended in August 2023. The protocol is expected to launch on the Ethereum mainnet in November 2023.\n\n“Users will have 'internal' accounts within Nocturne where receiving/spending funds from these accounts works in a way that is anonymous (not all tied back to the same address),” Nocturne Labs co-founder and CEO Luke Tchang commented as reported by The Block.\n\nRead Next: Vitalik Buterin Hints At Major Changes For Ethereum, Especially Staking\n\nRecently, Blockaid raised $27 million in funding — lead investors included Sequoia Capital and Ribbit Capital — for offsetting crypto industry challenges.\n\nMore About Nocturne Labs: Nocturne Labs is developing a protocol wherein users can also use zero-knowledge proof technology to prove ownership of these funds and use them for payments, transactions, and other activities such as gambling.\n\nNocturne Labs highlights privacy as an important factor for the broader adoption of cryptocurrencies, as reported by The Block. In the company’s opinion, individuals should have the ability to receive their salaries on the blockchain without disclosing their earnings, make purchases without any disclosure of spending habits and store assets on the blockchain without revealing their total holdings.\n\nThe company is taking a step-by-step approach to ensure compliance as regulatory concerns surround privacy-focused crypto platforms.\n\n“We are starting with a two-step, permission deposit process that involves filtering out illicit deposits using tools such as TRM and other data analytics providers,” Tchang added.\n\nAlso Read: Ethereum Co-Founder Vitalik Buterin Sets Record Straight On Crypto Transfers: 'Not Actually Me Selling.. Donating To Some Charity'\n\nBenzinga’s Future of Digital Assets conference is scheduled in New York on Nov.14 Attend and learn more about how the optimism in the crypto sector is leading to crypto startups garnering funds. The gathering is seen as pivotal for the digital assets community. The event will spotlight the latest trends, innovations, and challenges in the digital asset realm.\n\nPhoto: Shutterstock\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nProfit with More New & Research. Gain access to a streaming platform with all the information you need to invest better today. Click here to start your 14 Day Trial of Benzinga Professional\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZGVjcnlwdC5jby8yMDI5NDQvYml0Y29pbi1ldGhlcmV1bS1zb2FyLWNyeXB0by1tYXJrZXRzLWFkZC0xMDAtYmlsbGlvbtIBVGh0dHBzOi8vZGVjcnlwdC5jby8yMDI5NDQvYml0Y29pbi1ldGhlcmV1bS1zb2FyLWNyeXB0by1tYXJrZXRzLWFkZC0xMDAtYmlsbGlvbj9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 24 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin, Ethereum Soar Double Digits as Crypto Markets Add $100 Billion - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIt's all eyes on Bitcoin (BTC) as the industry’s largest cryptocurrency is up 12.6% over the day, trading above the $34,000 mark.\n\nThe largest cryptocurrency by market cap surged above $35,000 late on Monday before backtracking to $34,540 at the time of writing, data from CoinGecko shows.\n\nThis is the highest value for Bitcoin since May last year, with the move resulting in a total of over $310 million in liquidated short positions in the past 24 hours, per CoinGlass.\n\nAD\n\nAD\n\nInterestingly, the BTC Fear and Greed Index—a popular metric that measures the overall sentiment towards Bitcoin—spiked to 66, meaning that it is now in the “Greed” territory.\n\nEthereum (ETH) has also enjoyed a significant upswing, reaching its highest point since August.\n\nAt press time, the second-largest cryptocurrency is trading hands at $1,830, up 10% over the day.\n\nThe total market capitalization of all digital assets has meanwhile swelled more than $100 billion over the span, soaring 9.3% above the $1.3 trillion mark—the peak value since April, according to CoinGecko.\n\nMore than a half of that now accounts for Bitcoin, as several important events unfolded on Monday, sparking a new wave of optimism about the potential launch of a spot Bitcoin ETF.\n\nAD\n\nAD\n\nBitcoin ETF on the horizon?\n\nSeveral ETF applications have taken the spotlight of late.\n\nFirst is Grayscale's Bitcoin Trust (GBTC), which gives holders exposure to Bitcoin via shares. Those shares, however, have traded at a hefty discount of late as holders aren't able to redeem the underlying. Grayscale aims to fix that by filing to convert the Trust into a full-blown Bitcoin ETF.\n\nThe filing was first rejected by the SEC, but earlier this month a court ruled against the SEC's rejection, and yesterday the Commission was ordered to review the filing once more.\n\nAnother key driver of this recent surge in Bitcoin's value is the appearance of BlackRocks’s iShares Bitcoin Trust on a list of Nasdaq-traded ETFs, which is maintained by the world’s leading financial clearinghouse, the Depository Trust and Clearing Corporation (DTCC).\n\nJust last week. BlackRock filed an amended prospectus for its spot Bitcoin ETF application, which included detailed explanations on the proposed product’s pricing and reporting mechanism, and the news of the DTCC listing its ticker before the actual trading commenced certainly fuels speculation of the imminent launch.\n\n“Rumors are flying since the appearance of BlackRock’s Bitcoin spot ETF ticker on a list at the Depository Trust & Clearing Corporation (DTCC), including that the world’s largest asset manager has already started purchasing Bitcoin for the fund,\" Stefan Rust, CEO of independent inflation data aggregator Truflation said in an emailed statement. \"It could be we are seeing the early signs of the long-awaited 'Crypto Spring.' There is a sense that this U.S. ETF is actually real now—after years and years of waiting.\"\n\nEdited by Liam Kelly.\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMikQFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2NyeXB0by90b2tlbi9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1ob2xkcy0zNDAwMC1ldGhlcmV1bS1uZWFycy0xODAwLWNoYWluLWxpbmstc3VyZ2VzLTExLTQwMzE1NC0yMDIzLTEwLTI10gGVAWh0dHBzOi8vd3d3LmJ1c2luZXNzdG9kYXkuaW4vYW1wL2NyeXB0by90b2tlbi9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1ob2xkcy0zNDAwMC1ldGhlcmV1bS1uZWFycy0xODAwLWNoYWluLWxpbmstc3VyZ2VzLTExLTQwMzE1NC0yMDIzLTEwLTI1?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin holds $34,000; Ethereum nears $1,800; Chain Link surges 11% - Business Today",
        "content": "Bitcoin and other crypto dropped on Wednesday morning after the ticker for BlackRock's (BLK) spot bitcoin ETF – IBTC – was removed from the Depository Trust & Clearing Corporation's (DTCC) website, only to be included later. However, the profit booking an impulsive buying in crypto is nothing new.\n\n\n\nBitcoin saw some profit booking after a strong secular rally as the largest crypto token declined over a per cent but managed to hold about 34,000-levels. However, its largest peer, Ethereum, dropped almost 2 per cent but remained below $1,800-level. Majority of the altcoins were trading lower.\n\n\n\nBitcoin's value recently crossed the $35,000 threshold following the sudden appearance of BlackRock's spot bitcoin ETF (IBTC) ticker on the US Depository Trust & Clearing Corporation's website. However, within the last 24 hours, prices settled back around $34,000 after the ticker's temporary disappearance and subsequent reappearance, said Edul Patel,Co-Founder & CEO at Mudrex.\n\n\n\n\"This bullish momentum may also be linked to Grayscale's legal triumph over the US SEC, as the DC Circuit Court of Appeals ordered the agency to reconsider its rejection of Grayscale's spot bitcoin ETF application. These combined factors have fostered optimism among market participants, who are hopeful about the imminent approval of the Bitcoin spot ETF applications,\" he said.\n\n\n\nBarring a few exceptions, the majority of top crypto tokens were trading lower on Wednesday. Dogecoin and Polkadot tumbled over 3 per cent each, while Toncoin, Polygon, Solana and BNB were down 2 per cent each. Among the gainers, Chainlink rallied over 11 per cent, while XRP added about a per cent.\n\n\n\nThe global cryptocurrency market cap was trading significantly lower, falling down to $1.25 trillion-mark, as it declined about a per cent in the last 24 hours. However, the total trading volumes dropped over 13 per cent to $69.61 billion.\n\n\n\nOver the past 24 hours, both Bitcoin (BTC) and Ethereum (ETH) have experienced a decline, which could be linked to the temporary removal of BlackRock's (BLK) spot Bitcoin ETF ticker, IBTC, from the Depository Trust & Clearing Corporation's (DTCC) website. However, it's important to note that the ticker was relisted after a few hours, said CoinDCX Research Team.\n\n\n\n\"From a technical perspective, both BTC and ETH are trading above the 50-day and 200-day Exponential Moving Averages (EMA-D) and are currently consolidating after their recent upward momentum. While ETH faces a few resistance levels to clear for its uptrend, BTC is showing strength as it reaches a 52-week high,\" he said.\n\n\n\nImage: Crypto-chart-price\n\n\n\nTech View by Giottus Crypto Platform\n\nAptos (APT), trading above its 50-day exponential moving average, is in an ascending trend. The asset has broken above the previous key resistance of $5.5 and is currently experiencing a rally, due to wider positive sentiment in the market. After successfully breaching the upper limit of the flat bottom pattern APT was able to sustain support and has entered the accumulation phase.\n\n\n\nImage: Chart-Aptos\n\n\n\nIt faces immediate resistance at $6.65 with next resistance at $7.61. Its 14-day RSI remains overbought, and is currently around 75. These values suggest that the bullish break may continue in the near term. On the down side, $5.27 is the key support level.\n\nMajor Levels:\n\nSupport: $5.27, $4.68\n\nResistance: $6.65, $7.61\n\n\n\n\n\n(Views and recommendations given in this section are the analysts' own and do not represent those of Business Today. Please consult your financial adviser before taking any position in the asset/s mentioned.)"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZmluYm9sZC5jb20vZXRoZXJldW0tc2V0LWZvci1odWdlLXJhbGx5LWFzLXdoYWxlLWFjdGl2aXR5LWhpdHMtNi1tb250aC1oaWdoL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "Ethereum set for huge rally as whale activity hits 6-month high - Finbold - Finance in Bold",
        "content": "As bullish sentiment returned to the wider cryptocurrency market, so did the fear of missing out (FOMO) among the holders of the sector’s most prominent assets, particularly Ethereum (ETH), which has recorded the highest amount of whale transactions in the last six months.\n\nIndeed, Ethereum whale transactions, specifically those above $100,000, have skyrocketed to a six-month high, while the supply of ETH on exchanges has hit a record low since its genesis in 2015, according to the data shared by blockchain analytics platform Santiment on October 25.\n\nEthereum whale transactions and exchange supply. Source: Santiment\n\nSpecifically, the number of Ethereum transactions valued at $100,000 and higher reached 6,049 on October 24, making it the highest day since April 2023, whereas the supply of ETH on crypto exchanges has dropped to 8.41%, the lowest amount since July 2015.\n\nAt the same time, Bitcoin (BTC), Cardano (ADA), and Dai (DAI) are witnessing massive increases in whale activity themselves, with Bitcoin recording 14,833 of $100,000+ transactions on October 24, the most since June’s news of the multiple filings for a spot Bitcoin exchange-traded fund (ETF), according to the blockchain platform’s analysis.\n\nBitcoin, Ethereum, Cardano, and Dai whale accumulation. Source: Santiment\n\nEthereum price analysis\n\nElsewhere, the price of Ethereum at press time stood at $1,785.93, suggesting a decline of 3.35% in the last 24 hours but still holding onto the 13.04% gain accumulated in the previous seven days, as well as the increase of 13.79% over the past month.\n\nEthereum 7-day price chart. Source: Finbold\n\nMeanwhile, renowned pseudonymous crypto expert CoinsKid observed that Ethereum might be “gearing up for the last leg, the blow-off top of this cycle,” which refers to a sudden increase in price and volume, typically followed by a sharp drop in price and volume, in an analysis shared on October 25.\n\nEthereum technical analysis. Source: CoinsKid\n\nNotably, a rise in whale transfers often signifies increased investor interest, but caution is necessary as things can change rapidly in this sector, which is why one should carry out their own research and risk analysis before buying any cryptocurrency.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMinAFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3RvcC0zLXByaWNlLXByZWRpY3Rpb24tYml0Y29pbi1ldGhlcmV1bS1yaXBwbGUtY3J5cHRvLW1hcmtldHMtdHVybi1idWxsaXNoLW9uLWV0Zi1hcHByb3ZhbC1ob3Blcy0yMDIzMTAyNDEwNTHSAaABaHR0cHM6Ly93d3cuZnhzdHJlZXQuY29tL2FtcC9jcnlwdG9jdXJyZW5jaWVzL25ld3MvdG9wLTMtcHJpY2UtcHJlZGljdGlvbi1iaXRjb2luLWV0aGVyZXVtLXJpcHBsZS1jcnlwdG8tbWFya2V0cy10dXJuLWJ1bGxpc2gtb24tZXRmLWFwcHJvdmFsLWhvcGVzLTIwMjMxMDI0MTA1MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 24 Oct 2023 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Crypto markets turn bullish on ETF approval hopes - FXStreet",
        "content": "Share:\n\nBitcoin price rallied nearly 15% as it overcame the $30,000 psychological level.\n\nEthereum price has shot up 12% in the last two days, clearing $1,727, a key resistance level.\n\nRipple price has risen above the $0.540 resistance level, but it is uncertain whether bulls will defend this barrier.\n\nBitcoin (BTC) price has kick-started a massive rally in the third week of October, dragging Ethereum (ETH), Ripple (XRP) and other altcoins to follow its lead. The rally seems to be driven by a potential spot Bitcoin ETF approval.\n\nRead more: Bitcoin price nears $35,000 after BlackRock’s iShares BTC trust listing on DTTC and Grayscale victory upheld\n\nBitcoin price sustains 2023 bull rally\n\nBitcoin (BTC) price has sustained the 2023 bull rally by producing a fourth higher high. This bullish move has propelled BTC past the $30,000 psychological level, currently trading around $34,152.\n\nThe next hurdle that Bitcoin price will encounter is $36,294, where a potential top might form, especially if the circumstances around the spot ETF approval remain the same. On the other hand, if a spot ETF is officially approved, it could catalyze a massively bullish ascent that could propel BTC to the $40,000 psychological level.\n\nBTC/USD 3-day chart\n\nOn the off chance that this rally is a fluke, Bitcoin price could retrace to the immediate support levels of $31,777 and $30,616. These barriers are key to producing another lower high, but a breakdown of these levels could send BTC down by 15% to $25,941.\n\nIf Bitcoin price produces a three-day or weekly candlestick close below $25,941 support level, it will create a lower low on a higher time frame. This move would put an end to the 2023 bull rally and potentially send BTC down to $19,294.\n\nEthereum price shoots up\n\nEthereum (ETH) price cleared the key hurdle of $1,727 as it rallied 11.48% in the last two days. This move has caused the Relative Strength Index (RSI) to increase above the 50 mean level, showcasing the spike in bullish momentum.\n\nBulls need to sustain above this $1,727 level, after which investors can expect the extension of the uptrend to the next critical level of $2,030.\n\nETH/USD 3-day chart\n\nOn the other hand, if Ethereum price fails to sustain above $1,727, it would denote a bearish outlook. In such a case, investors can expect the bearish trend to take over and trigger a correction to $1,551.\n\nRipple price at crossroads\n\nRipple price has cleared the $0.500 and $0.540 resistance levels after a 12% rally in the last five days. This move has been successful in partially collecting the buy-side liquidity resting above the $0.547 level.\n\nGoing forward, investors need to exercise caution as XRP price is likely to pull back to retest the $0.540 level. Another bounce from here could see the remittance token extend its rally to retest the next key hurdle at $0.668. This move would constitute a 22% upswing.\n\nRead more: Ripple price could kickstart 140% rally to $1.23 after SEC's “surrender”\n\nXRP/USD 3-day chart\n\nOn the other hand, if Ripple price breaks below the $0.540 barrier, it would signal that the bullish momentum is not strong enough. In such a case, XRP price is likely to fall back to find support at the $0.500 and $0.469 levels."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9ldGhlcmV1bS12YWxpZGF0b3ItcXVldWVzLWZvci1lbnRyeS1leGl0LXBvc2l0aW9ucy1kcm9wLW5ldy1yZWNvcmQtbG93cy1yZXBvcnQuaHRt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Validator Queues for Entry and Exit Positions Drop to New Record Lows: Report - Cryptonews",
        "content": "Ethereum Validator Queues for Entry and Exit Positions Drop to New Record Lows: Report\n\nSource: Pexels\n\nThe Ethereum network’s validator queue is empty for the first time since the Shanghai update in May, signaling that investor demand for Ether staking is plummeting.\n\nAccording to blockchain data report from Validator Queues, merely a few validators are in the Ethereum network entry and exit queue, and their initiation process is almost instant.\n\nSource: ValidatorQueue\n\nThe report revealed that there were about 96,508 validators in the queue to stake ETH on its PoS network as of June 10.\n\nHowever, there are currently no validators in the entry queue, a significant decrease from its peak earlier this year. This shows an increasing impact on the broader staking landscape.\n\nSource: ValidatorQueue\n\nThe average wait time (queue) for validators to join the blockchain network is zero minutes, compared to the 45 days and 22 hours validators had to queue in for in early June.\n\nAt press time, the activation and exit limit for validators, known as Churn Limit, has increased from 12 to 13 epochs. This means a daily limit of 2,925 validators can join or exit the Ethereum network.\n\nEthereum Staking Rewards Continues To Plummet\n\nThe dwindling rate of Ethereum’s entry and exit queues for validators is the first for the network since it launched “ Shanghai ,” also referred to as Shapella upgrade, in April.\n\nThe upgrade signaled Ethereum’s upcoming transition to an anticipated and fully functional proof-of-stake network (PoS) and propelled the rise of institutional investors depositing large amounts of ETH.\n\nValidators maintain and secure Ethereum’s proof-of-stake blockchain by locking up their Ether. In exchange, they earn staking rewards.\n\nValidators were granted the ability to withdraw their staked ETH for the first time, eliminating risk factors for investors concerned about not getting their funds back. Unfortunately, things have now started to cool off.\n\nAccording to Glassnode’s Ethereum on-chain data metrics , staking rewards have dropped significantly to nearly 3.3% from the previous 7% earlier this year.\n\nDespite the slump in yields, ETH supply increased by $47M last week. Many analysts attributed this increase in supply to the decline in transaction activity in the past few days.\n\nNevertheless, while the demand for staking ETH has dropped, the number of active validators has also increased.\n\nValidator Queues report shows that there are currently 861,938 active validators on the Ethereum network, with 22.79% of the cryptocurrency’s supply staked.\n\nSource: ValidatorQueue"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2luc2lnaHRzL2V0aGVyZXVtLWJpdGNvaW4tcmF0aW8taW5jaGVzLWNsb3Nlci10by0wLTA1L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "Ethereum dominance against Bitcoin takes sharp dive - CryptoSlate",
        "content": "Quick Take\n\nThe evolving dynamics in the cryptocurrency market are clearly reflected in the Ethereum-Bitcoin ratio, which is inching closer to 0.05, a level not seen since mid-2021. Ethereum’s (ETH) position against Bitcoin (BTC) has been in a steady decline. Notably, it was above 0.07 in early 2023, but the persistent momentum has significantly impacted it, leading to a drop to 0.06 in September of that year.\n\nEven as Bitcoin’s dominance surges to 54%, a fascinating trend is the endurance of Ethereum’s dominance against Bitcoin, albeit fast diminishing. Historical data, represented by the pink line, showcases Ethereum’s peak dominance at -0.085, typically seen during bull markets when Ethereum outperforms. However, the tables turn in bear markets, with Bitcoin taking the lead.\n\nAs current trends suggest, we might be on the verge of a market shift with Bitcoin potentially regaining its dominance in terms of market cap."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmJsb2NrY2hhaW5nYW1lci5iaXovbmV3cy8yODEyNi9tdWx0aXZlcnNleC1pbi1jYXItdnItZWNvc3lzdGVtLWhvbG9yaWRlLWJyaWRnZXMtZXRoZXJldW0v0gFpaHR0cHM6Ly93d3cuYmxvY2tjaGFpbmdhbWVyLmJpei9hbXAvbmV3cy8yODEyNi9tdWx0aXZlcnNleC1pbi1jYXItdnItZWNvc3lzdGVtLWhvbG9yaWRlLWJyaWRnZXMtZXRoZXJldW0v?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "MultiverseX in-car VR ecosystem Holoride bridges to Ethereum - Blockchain Gamer",
        "content": "Sign up to our Substack, follow us on Twitter and connect with us on Linkedin.\n\nGerman in-car entertainment developer Holoride has launched a cross-chain bridge, allowing its platform users to transfer assets between the MultiverseX blockchain (previously Elrond) and Ethereum.\n\nHolders of RIDE tokens on MultiverseX can continue to stake on Ethereum and trade and store their tokens and NFTs on either blockchain.\n\nCEO and co-founder of Holoride Nils Wollny commented on the announcement, “We are thrilled to unlock more freedom for RIDE holders no matter how they choose to engage with the Holoride ecosystem. For Holoride, MultiversX is and will always be our home base from which we were able to launch our adventure and continue to offer new and exciting opportunities to our ever growing community.”\n\nBy combining virtual reality, blockchain technology and real-time data from in-motion vehicles, the holoride platform aims to create an entirely new media format. As such, it claims to offer groundbreaking virtual reality experiences including streaming, educational content and games to car passengers.\n\nAs part of the company’s vision of a sustainable ecosystem, its utility token RIDE is designed to connect platform subscribers, creators and business partners, including its shareholder Audi, by delivering customizable and user-authored experiences.\n\nMoreover, following a partnership deal with German race driver Laura-Marie Geissler, Holoride recently launched its LMG GT No.2 NFT collection, of which half was minted on Ethereum and the other half on MultiverseX. Recently it also announced a collaboration with MultiverseX native NFT marketplace XOXNO.\n\nIn addition to enable asset transfers, the launch of the cross-chain bridge on 31st October, also means RIDE will become available on Uniswap on Ethereum.\n\nFor more details, visit Holoride’s website."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9wb2x5Z29uLWxhdW5jaGVzLXBvbC10b2tlbi1jb250cmFjdC1ldGhlcmV1bS1ldmVudHVhbGx5LXJlcGxhY2UtbWF0aWPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "Polygon launches POL token contract on Ethereum to eventually replace MATIC - Cointelegraph",
        "content": "Polygon Labs has launched the Ethereum contract for the new Polygon token, POL, according to an Oct. 25 announcement. The new token is intended to replace the ecosystem’s current token, MATIC (MATIC). However, the team said users presently don’t need to exchange their MATIC for POL.\n\nThe POL token upgrade is now live on Ethereum mainnet.\n\n\n\nPolygon 2.0, released this summer, is a roadmap for scaling Ethereum to build the Value Layer of the Internet. POL unlocks that future.\n\n\n\nPOL is a next-generation token that can power a vast ecosystem of ZK-based L2 chains.… pic.twitter.com/gmrsu0ZqLz — Polygon (Labs) (@0xPolygonLabs) October 25, 2023\n\nAccording to blockchain data, the new token was created on Oct. 25 at 9:06 am UTC. Its full name is the “Polygon Ecosystem Token.” In the announcement, the Polygon team claimed that POL would “power a vast ecosystem of zero knowledge-based Layer 2 chains” by implementing a “re-staking protocol” that allows tokenholders to stake it on multiple chains, performing multiple functions in the process.\n\nThe token’s launch will now pave the way for other aspects of the Polygon 2.0 roadmap to be implemented, including the launch of a new staking layer for the Polygon ecosystem, upgrading the current proof-of-stake (PoS) network to zkEVM layer-2, and creating a shared liquidity protocol for all Polygon networks, the post stated.\n\nRelated: ZK-focused Manta Pacific opts out of OP Stack for Polygon CDK\n\nThe team emphasized that POL is not currently being used for any systems in the Polygon network. Staking on both Polygon PoS and Polygon zkEVM is still being performed via the old token, MATIC, and gas fees on the PoS network are still being paid for with MATIC. So, users, validators,and app developers do not need to exchange their MATIC for POL at present.\n\nPolygon Labs first announced it was developing a new layer-2 ecosystem on June 29. It called the new ecosystem “Polygon 2.0.” On Sept. 14, the team announced that Polygon 2.0 would use a new token, POL. But at the time, the token was just a proposal and had not been deployed to Ethereum.\n\nPolygon’s proposed layer-2 ecosystem will use zero-knowledge proofs to validate transactions between networks. It will face competition from the Optimism ecosystem proposed by Optimism Labs, which will use optimistic rollup technology to secure messages between networks."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vY3J5cHRvZGFpbHkuY28udWsvMjAyMy8xMC9kb2dlY29pbi1hbmQtZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi1ldmVybG9kZ2UtYnVsbGlzaC1tb21lbnR1bS1jb250aW51ZXMtd2l0aC0xMzAtcmlzZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 24 Oct 2023 07:00:00 GMT",
        "title": "Dogecoin and Ethereum Price Prediction: Everlodge Bullish Momentum Continues With 130% Rise - CryptoDaily",
        "content": "Table of Contents\n\nDespite the recent downward performance of the broader crypto market, there are cryptocurrencies that are heading in an upward direction. For example, Dogecoin (DOGE) and Ethereum (ETH) recently saw a price increase, and analysts are bullish on their future. Furthermore, the presale-stage project Everlodge (ELDG) can soon reach Stage 6, as investors are accumulating the crypto rapidly.\n\nSummary\n\n● Dogecoin will rise to $0.098 by the end of Q4\n\n● Ethereum to spike in value as high as $2,335.71 by the end of 2023\n\n● Everlodge is projected to grow by 45x at launch\n\nJoin the Everlodge presale and win a luxury holiday to the Maldives\n\nDogecoin (DOGE) Future Outlook\n\nDogecoin (DOGE) is once again getting accumulated by investors on a global scale following its most recent upswing in value. During the previous week, the Dogecoin crypto made the jump from a low point of $0.057 to $0.060\n\nIn addition, the Dogecoin crypto also has a market cap of $8,323,587,328, placing it 10th on the crypto top 100 list. As a result, analysts are now bullish on the future performance of the cryptocurrency. Based on the Dogecoin price prediction, it can rise as high as $0.098 by the end of 2023.\n\nEthereum (ETH) Price Prediction\n\nEthereum (ETH) also showcased significant updates within its ecosystem. Specifically, we saw the launch of the Scroll network. This is a zero-knowledge Ethereum Virtual machine (zkEVM) space that can scale the network. Blockchain data from Etherscan indicates that it launched a week ago, but the team made the official announcement on October 17. Existing Ethereum applications and developer tool kits can migrate to the new solution.\n\nAs for the ETH price during the past week, it traded between $1,528.77 and $1,601.75. Based on the Ethereum price prediction made by analysts, it can surge as high as $2,335.71 by the end of 2023.\n\nEverlodge (ELDG) to Spike in Value As High As 45x at Launch\n\nAside from Dogecoin and Ethereum, another crypto that’s getting a lot of attention is Everlodge. It's building the world's first real estate blockchain marketplace. It operates within the hospitality sector and will digitize luxury apartments, hotels, and vacation homes.\n\nThe marketplace will list all of these properties as NFTs. This model will create real-estate-backed NFTs. They will hold all of the ownership details, like the deeds, for example. The prices of the NFTs will move in tandem with the value of the properties.\n\nThrough the usage of NFT fractionalization, Everlodge will operate its unique co-ownership model. This means that they can be divided into smaller fragments, and each represents a share of the property. As a result, anyone can begin making investments with as little as $100.\n\nPortfolio optimization is also important, and on Everlodge, anyone can build a diversified portfolio, as costs are kept as accessible as possible. During Stage 6 of the presale, the ELDG crypto trades at $0.023. At launch, analysts project that it can surge by 45x.\n\nFind out more about the Everlodge (ELDG) Presale\n\nWebsite: https://www.everlodge.io/\n\nTelegram: https://t.me/everlodge\n\nDisclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8xMC8yNS8yNzY2NDU0LzAvZW4vTm9jdHVybmUtUmFpc2VzLTZNLVNlZWQtUm91bmQtdG8tQnJpbmctUHJpdmF0ZS1BY2NvdW50cy10by1FdGhlcmV1bS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "Nocturne Raises $6M Seed Round to Bring Private Accounts to Ethereum - GlobeNewswire",
        "content": "NEW YORK, Oct. 25, 2023 (GLOBE NEWSWIRE) -- Nocturne , a protocol enabling on-chain private accounts, today announced its $6 million seed funding round co-led by Bain Capital Crypto and Polychain Capital with participation from Vitalik Buterin and other members of the Ethereum community. Other investors include Bankless Ventures, HackVC and Robot Ventures. The company plans to launch on mainnet within the next month.\n\n\n\nBy default, all transactions and user data on Ethereum are completely transparent. Nocturne unveils a pioneering solution that combines the best of stealth addresses, zero-knowledge proofs, and account abstraction to enable private accounts on public blockchains. These accounts seamlessly function like conventional Ethereum accounts but with built-in asset privacy. This initiative marks a first in the Ethereum landscape, representing a stride toward broader accessibility of usable and compliant privacy on-chain.\n\n“Nocturne is pushing the boundaries, tackling one of the most foundational problems facing Ethereum,” said Luke Tchang, CEO and co-founder of Nocturne. “Onchain privacy solves a key pain point for many existing users, enables new use cases, and allows new players to enter our industry. Using and integrating privacy into applications will be easier than it’s ever been before.”\n\nThis seed round will accelerate the production and deployment of Nocturne’s protocol across various ecosystems. In addition, the round will help fund legal work as the team continues to navigate and accommodate the changing regulatory environment. The initial launch will provide a usable and compliant non-custodial privacy option to retail users while allowing for integrations with wallets, payment companies, and other strategic partners.\n\n“It’s hard to imagine satiating consumer or institutional demand for permissionless, composable applications without privacy. But it’s also hard to imagine most users adopting new platforms purely for privacy’s sake,” said Alex Evans, Partner at Bain Capital Crypto. “Nocturne seeks to close this gap by bringing privacy to existing applications and assets while striving for feature parity as a minimum requirement. We believe that approach is valuable.”\n\nTo learn more about Nocturne, visit https://nocturnelabs.xyz/ .\n\nAbout Nocturne Labs\n\nNocturne Labs is a forward-thinking blockchain technology company committed to addressing the most critical privacy and user experience challenges within the Ethereum ecosystem. With a pioneering protocol for private accounts, Nocturne enables users to transact safely with built-in privacy. This marks a substantial stride in advancing the usability of public blockchains. Backed by notable investors such as Bain Capital Crypto, Polychain Capital, Bankless, and Vitalik, Nocturne is led by a team of experienced developers dedicated to enabling a more secure and accessible Ethereum. For more information, visit https://nocturnelabs.xyz/ .\n\nMedia Contact\n\nbccmedia@serotonin.co"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMTAvMjQvZHlkeC1kZWNlbnRyYWxpemVkLWNyeXB0by1leGNoYW5nZS1vcGVuLXNvdXJjZXMtdjQtY29kZS1mb3ItdXBjb21pbmctY29zbW9zLWNoYWluL9IBf2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMTAvMjQvZHlkeC1kZWNlbnRyYWxpemVkLWNyeXB0by1leGNoYW5nZS1vcGVuLXNvdXJjZXMtdjQtY29kZS1mb3ItdXBjb21pbmctY29zbW9zLWNoYWluL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "DYdX, Decentralized Crypto Exchange, Open Sources ‘V4’ Code for Upcoming Cosmos Chain - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY29pbmdhcGUuY29tL2FsdGNvaW5zLWpvaW4tdGhlLWJpdGNvaW4tcGFydHktZXRoZXJldW0tZXRoLW1vdmVzLWNsb3NlLXRvLTIwMDAv0gFaaHR0cHM6Ly9jb2luZ2FwZS5jb20vYWx0Y29pbnMtam9pbi10aGUtYml0Y29pbi1wYXJ0eS1ldGhlcmV1bS1ldGgtbW92ZXMtY2xvc2UtdG8tMjAwMC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 24 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Price: Altcoins Join the Bitcoin Party, Ethereum (ETH) Moves Close to $2,000 - CoinGape",
        "content": "The broader cryptocurrency market is experiencing a new phase of euphoria today! Altcoins has joined the Bitcoin party pushing the entire crypto market up by 7.5% while adding over $150 billion to investors.\n\nEthereum leads the Altcoins Party\n\nAs the Bitcoin price hit its new 2023 high at $23,000, top altcoins like Ethereum (ETH) have gained 8% moving past the $1,8000 level and eyeing the next move to $2,000. With its current move, Ethereum too has extended its year-to-date gains to more than 50%.\n\nadvertisement\n\nAnother interesting development is that the US SEC has acknowledged Grayscale’s application of converting its Ethereum Trust (ETHE) into a spot Ethereum ETF.\n\nAs per the technical chart, the Ethereum price has given a breakout above the $1,745 level after making a double bottom formation. Other technical indicators also hint at the continuation of the rally going ahead.\n\nIf traders maintain their open buy orders, they may propel a potential 12.25% breakout to reach $1,958. Once the breakout occurs, an accompanying surge in trading volume is likely, as traders look for fresh opportunities with Ether above the neckline resistance.\n\nThe Relative Strength Index (RSI) currently at 75 signals that Ethereum’s price is positioned to uphold the uptrend. However, investors need to warrant caution as overbought conditions could tempt traders to take profits or protect their investments.\n\nAs indicated by the money flow index (MFI), the advantage lies with the bulls. This metric monitors the flow of money in and out of the market, with a consistent increase indicating buyer dominance in the uptrend.\n\nSurpassing the $2,000 mark could prove to be a significant turning point for Ethereum bulls. It will potentially act as the catalyst initiating the next bull run.\n\nCardano (ADA) and Dogecoin (DOGE) aka Big Moves\n\nAmong the list of top ten cryptocurrencies, Dogecoin and Cardano have followed a similar trajectory to Ethereum, with both gaining 8% each. BNB Coin and Ripple XRP have gained 4% each.\n\nOn the other hand, Solana – which has been the star performer – remains flattish and seems to be entering consolidation after registering 30% weekly gains."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1yaXNlcy0xMC1pbi00OC1ob3Vycy1hcy13aGFsZXMtbWFrZS1hLXNwbGFzaC_SAVBodHRwczovL2FtYmNyeXB0by5jb20vZXRoZXJldW0tcmlzZXMtMTAtaW4tNDgtaG91cnMtYXMtd2hhbGVzLW1ha2UtYS1zcGxhc2gvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "Ethereum rises 10% in 48 hours as whales make a splash - AMBCrypto News",
        "content": "Ethereum whales have accumulated over $70 million in the last three days.\n\nETH has added almost 10% to its price in the last 48 hours.\n\nIn recent days, a group of whales has made substantial investments and displayed optimistic indicators. These whales have been moving their Ethereum [ETH] holdings out of storage and opening long positions.\n\nRead Ethereum’s [ETH] Price prediction 2023-24\n\nHow has this influenced the overall trend of the king of altcoins?\n\nEthereum whales gulp up more Ethereum\n\nAccording to Lookonchain and data from Etherescan, six Ethereum whales have amassed a total of more than 42,000 ETH. This equated to approximately $71 million in value and has been accumulated over the past three days.\n\nAccording to Etherescan’s data, one of these whales obtained more than 20,000 ETH. It acquired 17,000 ETH through a decentralized exchange (DEX) and withdrew an additional 3,000 ETH from a centralized exchange.\n\nIn addition, another whale withdrew over 10,000 ETH from Binance [BNB], subsequently depositing these funds and taking a long position on the asset within several DeFi platforms.\n\nThese strategic moves made by these whales coincide with the positive uptrend in the price of ETH that has been observed over the last couple of days.\n\nEthereum sees a continued uptrend\n\nEthereum’s recent price surge has been in progress for nearly seven consecutive days, bringing good news to its investors. At the time of writing, it was trading at approximately $1,800, reflecting a price increase of over 3%.\n\nThis uptick built upon the already impressive 6% uptrend observed on 24 October. Notably, this ongoing surge has propelled Ethereum into a strongly bullish territory.\n\nAs of the latest data, the Relative Strength Index (RSI) has indicated that ETH has entered the overbought zone. This suggested a bullish trend, though it may also hint at the potential for a price correction in the near future.\n\nAdditionally, the continued accumulation of ETH by the whales in the market may be viewed as a sign of a sustained upward trajectory.\n\nFunding rates reflect whales’ optimism\n\nCoinciding with the rise in Ethereum’s price and the accumulation by whales, the Funding Rate for ETH has surged in a positive direction. At the time of this report, the Funding Rate per Coinglass had elevated to approximately 0.02%.\n\nHow much are 1,10,100 ETHs worth today?\n\nNotably, this surge in funding rate is a noteworthy occurrence as it hasn’t been observed in over two months, signifying a sudden increase in optimism among market participants.\n\nThe press time Funding rates strongly suggested that traders were anticipating a further price increase in Ethereum, given their willingness to pay a premium for holding long positions."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vZGVjcnlwdC5jby8yMDMyNjIvZnR4LW1vdmVzLTgtNi1taWxsaW9uLWV0aGVyZXVtLWNoYWlubGluay1hYXZlLW1ha2VyLXRvLWJpbmFuY2XSAV5odHRwczovL2RlY3J5cHQuY28vMjAzMjYyL2Z0eC1tb3Zlcy04LTYtbWlsbGlvbi1ldGhlcmV1bS1jaGFpbmxpbmstYWF2ZS1tYWtlci10by1iaW5hbmNlP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "FTX Selling the Pump? Estate Moves $8.6M Ethereum, Chainlink, Aave and Maker to Binance - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCollapsed crypto exchange FTX is sending funds to Binance in what analysts say is the beginning of a sale to repay creditors.\n\nCrypto analytics company Nansen highlighted on Twitter the movement of $8.6 million in Ethereum, Chainlink, Aave, and Maker from FTX and Alameda Research wallets.\n\nThe transfer to Binance is “to either sell or to prepare to sell these funds,” Nansen said. Binance is the world’s biggest crypto exchange and was FTX’s rival before the company went bankrupt. FTX did not immediately respond to a request for comment from Decrypt.\n\nAD\n\nAD\n\nFTX and Alameda funds are on the move! 🏃 - 2.2M USD LINK\n\n- 1M USD AAVE\n\n- 2M USD MKR\n\n- 3.4M USD ETH These funds moved to 0xde9 then 0xaee which is a Binance address We don't track offchain movements, but presumably, this is to either sell or to prepare to sell these funds pic.twitter.com/n6jfyghDmk — Nansen 🧭 (@nansen_ai) October 25, 2023\n\nFTX, once one of the most popular crypto brands, went bust last November due to alleged criminal mismanagement. Around $9 billion in client money went missing but the company’s new management is in the process of returning the funds.\n\nA lot of the cash is in the form of digital coins and tokens such as Ethereum and Chainlink. Earlier this month, FTX’s new management started to stake—or lock up a cryptocurrency to earn interest—Solana tokens held in wallets.\n\nSam Bankman-Fried, FTX’s ex-CEO and co-founder, is currently on trial facing seven criminal charges related to the collapse of the exchange.\n\nFTX allowed its customers to buy, sell and bet on the future price of cryptocurrencies. But it quickly and unexpectedly went bankrupt. Bankman-Fried was arrested one month later.\n\nAD\n\nAD\n\nBankman-Fried, who rubbed shoulders with the rich and powerful, has denied any wrongdoing but prosecutors allege he criminally mismanaged the exchange and commingled funds.\n\nHe is expected to testify at his trial, his own defense lawyers announced today. The trial at a Manhattan court is expected to last another three weeks.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vY29pbmdhcGUuY29tL3BvbHlnb24tcG9sLXRva2VuLWNvbnRyYWN0cy1nb2VzLWxpdmUtb24tZXRoZXJldW0v0gFLaHR0cHM6Ly9jb2luZ2FwZS5jb20vcG9seWdvbi1wb2wtdG9rZW4tY29udHJhY3RzLWdvZXMtbGl2ZS1vbi1ldGhlcmV1bS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "POL Token: Polygon's POL Token Contracts Goes Live On Ethereum - CoinGape",
        "content": "Polygon Labs on Wednesday announced that the POL token upgrade is now live on the Ethereum mainnet as part of the Polygon 2.0 roadmap. The POL token will replace the MATIC token as Polygon’s next-generation hyperproductive ecosystem which includes the main Polygon blockchain, the Polygon zkEVM network, and various supernets.\n\nPOL Token Contacts Is Live On Ethereum Mainnet\n\nPolygon Labs in a press release on October 25 revealed that POL token upgrade is now live on the Ethereum mainnet. As part of the Polygon 2.0 roadmap, the new POL token will replace the MATIC token as the ecosystem’s native token.\n\nadvertisement\n\n“Today marks a major milestone on the Polygon 2.0 journey toward building the Value Layer of the Internet. The upgrade to POL has been initiated on Ethereum mainnet, after months of development, community consultation and a successful testnet launch.”\n\nPOL token will power all Polygon networks — the main Polygon blockchain, the Polygon zkEVM network, and various supernets.\n\nPOL upgrade also prepares for the next milestones in the Polygon 2.0 roadmap. It includes the launch of a new staking layer to power Polygon L2, upgrade Polygon PoS to zkRollup, and implement an advanced, ZK-powered interoperability and shared liquidity protocol.\n\nAlso Read: Judge Torres Terminates Ripple Vs SEC Hearings, Orders New Deadline\n\nPolygon Plan To Switch From MATIC To POL\n\nIn September, Polygon initiated the migration of MATIC to POL token with the release of three Polygon Improvement Proposals (PIPs). PIP-18 had Phase 0 plans to build a network of interconnected zero knowledge-powered L2 chains that scale Ethereum to the size of the Internet.\n\nIt will make significant changes including upgrades from MATIC to POL token as the native token for Polygon PoS and staking token for Polygon PoS.\n\nMATIC price jumped 21% in a week, with the price currently trading at $0.62. The price is down 4% in the past 24 hours.\n\nAlso Read: Binance Set Up HKVAEX To Gain Crypto License In Hong Kong"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvZXRoZXJldW0td2hhbGUtbW92ZXMtNTUtbWlsbGlvbi1ldGgtdG8tYmluYW5jZS13aWxsLWl0LXNlbGzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Whale Moves $55 Million ETH to Binance, Will it Sell? - Watcher Guru",
        "content": "According to Etherscan.io, an Ethereum (ETH) whale has moved 30,710 ETH, worth around $54.9 million, to the crypto exchange Binance. The whale had recently withdrawn 42,311 ETH from Binance, leading many to speculate if it made a profit on the 30,710 ETH and hence is moving to sell them, leaving it with 11,601ETH.\n\nAlso Read: Ethereum (ETH) Price Prediction: October End 2023\n\nThe whale began withdrawing its Ethereum (ETH) on Sept. 20. The total withdrawn amount has come to over $75.67 million, with an average price per ETH of around $1,667. The whale might have sent its holdings to Binance to realize profits as ETH closes in on $1.8k.\n\nThe large transfer to Binance could spell trouble for ETH investors. The transfer of tokens to an exchange increases the chances of them being sold, which could bring down the asset’s price. ETH has surged by over 14% in the weekly charts. However, the altcoin is down by 1.1% in the last 24 hours.\n\nWill Ethereum’s price take a hit if the whale sells its holdings?\n\nSource: Investopedia\n\nAny sale of such a magnitude will likely impact ETH price. However, Bitcoin (BTC) is currently leading the markets, and a sell-off of ETH will most likely not make a dent in the larger crypto market. Moreover, recently investors with over $1 billion worth of ETH took control of 32% of the token’s current supply. If some of these billionaires decide to sell, it may have dire consequences for the project.\n\nAlso Read: Ethereum Billionaires Now Hold 32% of Supply\n\nAs long as BTC continues to rally, ETH may enjoy a similar pattern. Moreover, several bullish developments for BTC could sustain its rally, including a spot BTC ETF (Exchange-Traded Fund) approval in the U.S. and BTC’s next halving cycle. Both of these events could spark a new bull run for the crypto market."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vdG90YWwtdmFsdWUtbG9ja2VkLTc0ODY4MjHSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 24 Oct 2023 07:00:00 GMT",
        "title": "Total Value Locked (TVL) in Cryptocurrency: Everything You Need to Know - Investopedia",
        "content": "What Is Total Value Locked (TVL)?\n\nTotal value locked (TVL) is a metric used in the cryptocurrency sector to determine the total U.S. dollar value of digital assets locked, or staked, on a particular blockchain network via decentralized finance (DeFi) platforms or decentralized applications (dApps). The higher the TVL of a project, the more secure and valuable it is perceived to be.\n\nKey Takeaways Total value locked (TVL) measures the U.S. dollar value of assets locked on a blockchain.\n\nIt is an important indicator of investor and developer interest in a blockchain or decentralized application (dApp).\n\nTVL is similar to bank deposits for decentralized finance (DeFi) projects.\n\nHow Total Value Locked (TVL) Works\n\nCryptocurrency arrived in 2009 with the creation of Bitcoin, which was designed to be a peer-to-peer currency using digital ledger technology that would operate outside of centralized control. Early projects focused on being a replacement currency for the financial system until the arrival of Ethereum in 2015, which has smart contract functionality and allowed developers to build permanent dApps on its network.\n\nThat led to a DeFi boom in 2020–2022, with a host of dApps offering digital financial services, such as lending, which don’t rely on traditional financial intermediaries like brokerages, exchanges, or banks.\n\nTo get access to a loan, for example, users must stake digital assets or tokens with the application in the same way that a mortgage borrower would place a down payment with a lender. In cryptocurrency, this staked deposit is “locked” on that particular network, or still in circulation but not usable while it is staked.\n\nThis led to the creation of the term “total value locked,” which can give users a snapshot of the importance of an application or network based on the value of staked assets locked on its chain.\n\n\n\nHow Total Value Locked (TVL) Is Calculated\n\nThe total value locked on a chain is calculated by summing the total value of digital assets locked on a specific DeFi platform or dApp. Digital assets are cryptocurrencies or stablecoins that are being used as collateral for loans or to add liquidity to a platform.\n\n\n\nDeFi platforms can potentially provide their own data for investors to calculate their TVL. For example, if a DeFi platform said it had $1 billion worth of ether, $1 billion worth of bitcoin, and $500 million of tether locked, that would mean it has $2.5 billion of digital assets in TVL.\n\nThe largest cryptocurrencies and stablecoins by market capitalization usually will account for the majority of TVL, as these are the most trusted assets. Bitcoin, ether, and tether are the most common.\n\nInvestors tend to use third-party DeFi analytics platforms, such as DefiLlama, for the numbers. These platforms will use application programming interfaces (APIs) and other computing technologies to gather data from crypto applications; users can simply search the site for their desired information.\n\nFor example, DefiLlama said Aave had $5.4 billion total value locked on Oct. 24, 2023. Looking at the breakdown of those total assets, Ethereum was listed as the largest, at about $4.6 billion. The Polygon and Avalanche blockchains are the next two largest, at about $287 million and $193 million, respectively.\n\nWhat Total Value Locked (TVL) Can Tell Investors\n\nTVL became a critical metric in cryptocurrency because it gave investors a measuring stick to help define the risks and potential benefits of investing in a particular DeFi platform. If a platform has a large amount of assets locked on its network, then it gives the impression that it is a secure platform, trusted by crypto investors.\n\nThis is similar to traditional banks, where investors analyze the level of deposits held by an institution. If a bank is attracting deposits, it can earn money by lending or investing that money. If deposits are declining, then the opposite is true—the bank can’t lend as much, leading to less income.\n\nThe DeFi boom from 2020 to 2022 happened because the finance platforms used their decentralized nature to offer large annual percentage rate (APR) interest rate yields for staking and lending. This also happened at a time when global central banks were pursuing a collective monetary policy that relied on interest rates near zero to spur growth.\n\nA platform with a high TVL level may not necessarily be a secure platform. Investors interested in DeFi projects should dig deeper to gauge the project’s reputation.\n\nAt a peak in December 2021, decentralized applications had a TVL of more than $179 billion. Over the following months, a peak in technology stocks reduced investors’ appetite for risk, and speculative capital was drawn from the crypto sector. The central banks also went on an aggressive interest-rate-tightening cycle to combat inflation, and investors moved to the safety of government deposits. On Oct. 24, 2023, the TVL for the crypto sector was around $40 billion.\n\n\n\nDrawbacks of Total Value Locked (TVL)\n\nTVL will only provide a snapshot of the total value of assets that are locked, or staked, in a platform; it doesn’t highlight activity levels. If a platform has a high TVL but low user-activity levels, this may mean that a small number of investors account for the TVL on that platform—generally, this is a red flag and would require more investigation. Investors should also look at the data practices of third-party analytics platforms to ensure that all the TVL figures are up to date.\n\nThe DeFi industry isn’t immune to the collapse of trusted institutions, as was evident with the $60 billion collapse of the Terra (LUNA) lending protocol in 2022. This highlighted another problem with TVL: The assets involved in the calculation may not be as secure as believed.\n\nThere also have been cases in which TVL numbers can be artificially inflated by bad actors who want to attract attention to their platform or project.\n\nThat can make it harder for users to accurately gauge the true value of a project, but shouldn’t be a problem when assessing DeFi projects or dApps with a strong reputation.\n\nTVL is a handy metric for assessing the quality of a decentralized finance project or application, but it shouldn’t be the only measure used for an investment. Investors can perform due diligence in other areas, such as the experience of the founders, the platform’s governance model, tokenomics, or the size of the platform’s community.\n\n\n\nWhat Is the Difference Between TVL and Market Capitalization? The difference between TVL and market capitalization is that the former calculates the value of digital assets parked on an application, while the latter is the market value of the project that develops and operates the DeFi platform or dApp.\n\nWhich Cryptocurrency Has the Highest TVL? On Oct. 24, 2023, Ethereum had the highest TVL. There was $22.32 billion in ether locked, according to DefiLlama.\n\nIs Total Value Locked a Good Metric? Crypto fans use TVL to gauge interest in a cryptocurrency app or platform. For this purpose, it is a good metric, but it should also be used with other metrics in an analysis.\n\nThe Bottom Line\n\nTotal value locked (TVL) is an important metric used in the cryptocurrency sector that allows investors to gauge the popularity and activity of a decentralized finance platform or application.\n\nLending platforms will aim to attract investors by offering an attractive APR yield, and any digital assets locked on the network to earn that yield will boost the network’s TVL figure. Locking is generally done by staking tokens on a blockchain, which also serves to give the token staker the ability to earn fees by validating transactions."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvcG9seWdvbi0yLjAtd2l0bmVzc2VzLW1pbGVzdG9uZTotcG9sLWNvbnRyYWN0cy10by1yZXBsYWNlLW1hdGljLW9uLWV0aGVyZXVtLW1haW5uZXTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "Polygon 2.0 Witnesses Milestone: POL Contracts To Replace MATIC On Ethereum Mainnet - Nasdaq",
        "content": "Polygon Labs (CRYPTO: MATIC) wants an updated roadmap with the new POL token replacing the MATIC token.\n\nThe company clarifies that this has no relation to the recent events in the regulatory environment related to the MATIC legal status.\n\nWhat Happened: Polygon deployed its next-gen cryptocurrency POL on a testnet in early October. Now, it's deploying contracts on the Ethereum mainnet. This token is an evolution of MATIC, and it looks to align with the architecture of the upcoming Polygon 2.0 upgrade.\n\nPrice Action: MATIC in the past 24 hours has seen a drop of 33.9% in its trading volume while the price of the token is down around 1% at the time of writing.\n\nThe upgrade involves the following steps, launching a new staking layer to fuel Polygon Layer 2 chains, transitioning Polygon proof-of-stake to zkRollup, and implementing a ZK-powered interoperability and shared liquidity protocol for all the Layer 2s.\n\nAlso Read: Google Cloud Joins The List of 100-Plus Validators On Polygon's Network\n\nFind out more about the Polygon network and its token Meet and engage with other transformative Digital Asset and Crypto business leaders and investors at Benzinga's exclusive event: Future of Digital Assets. Tickets are flying: Get yours! The token will not replace MATIC immediately. Replacement needs to have governance approval and will be synchronized with the rollout of the Polygon 2.0 upgrade. MATIC holders will have four years to migrate their holdings to the new token.\n\nThis development comes on the heels of a series of approved Polygon Improvement Proposals in September which detailed POL token specifications.\n\nWhy It Matters: POL will now serve as the main cryptocurrency for the Polygon 2.0 ecosystem, supporting an ecosystem of zero-knowledge-based Layer 2 chains and including features such as staking, community ownership, and governance.\n\n“POL, a next-generation hyperproductive token, will power a vast ecosystem of zero knowledge-based Layer 2 chains via a native re-staking protocol that allows POL holders to validate multiple chains and perform multiple roles on each of those chains,” Polygon Labs said in a statement on its blog.\n\nThis step will enable POL to function as a single token for all Polygon-based networks including the main Polygon blockchain, the Polygon zkEVM network, and various supernets like application-specific blockchains that run over the main Polygon network.\n\nBenzinga's Future of Digital Assets conference is scheduled in New York on Nov.14. Attend and learn more about the Ethereum mainnet and the various tokens operating on it. The gathering is seen as pivotal for the digital assets community. The event will spotlight the latest trends, innovations, and challenges in the digital asset realm.\n\nRead Next: Polygon Co-Founder Steps Down After 6 Years, Embarks On 'New Adventures'\n\nImage: Shutterstock\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nGet insight into trading platforms. Compare the best online stock brokerages.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY3J5cHRvYnJpZWZpbmcuY29tL3NlYy1hY2tub3dsZWRnZXMtZ3JheXNjYWxlcy1zcG90LWV0aGVyLWV0Zi1maWxpbmcv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 24 Oct 2023 07:00:00 GMT",
        "title": "SEC Acknowledges Ethereum ETF Filing by Grayscale - Crypto Briefing",
        "content": "Share this article URL Copied\n\nThe US Securities and Exchange Commission (SEC) has acknowledged receipt of an application by Grayscale Investments to convert its Grayscale Ethereum Trust (ETHE) into a spot Ethereum exchange-traded fund (ETF), according to Nate Geraci, president of The ETF Store.\n\nThe conversion of the $4.8 billion ETHE trust into an SEC-registered ETF would allow more mainstream investors to gain exposure to Ethereum’s native token, Ether, without having to directly hold crypto assets. ETHE currently trades over-the-counter as a private trust.\n\nSEC has acknowledged Grayscale's spot ether ETF filing… This would be conversion of $ETHE into ETF. pic.twitter.com/JMmutgbakZ — Nate Geraci (@NateGeraci) October 23, 2023\n\nAn SEC filing shows that NYSE Arca, which would list the proposed ETF, submitted an application for Grayscale’s spot Ether ETF on October 2. The proposal seeks to convert Grayscale’s existing Ethereum trust into an ETF that holds Ether directly rather than through futures contracts.\n\nThe move comes after the SEC greenlit several Bitcoin futures ETFs in 2021 and Ethereum futures ETFs more recently. However, the regulator has yet to approve any spot crypto ETFs that hold digital assets directly.\n\nCrypto advocates hope that the conversion of existing trusts like ETHE into SEC-registered ETFs will open up digital asset investing to more investors. ETFs face stricter regulation than trusts but can be more easily traded by both retail and institutional investors.\n\nThe SEC will now begin a formal review process of Grayscale’s Ethereum ETF application, with a final decision likely months away. Crypto investors anxiously await the regulator’s ruling as it could determine whether digital assets move further into the investment mainstream."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiJ2h0dHBzOi8vYmxvY2tvbm9taS5jb20vYnV5LWV0aGVyZXVtcG93L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "Where to Buy Ethereum PoW (ETHW) Crypto: Beginner's Guide 2023 - Blockonomi",
        "content": "Ethereum, the second-biggest crypto blockchain project in the world, recently concluded the process of combining the proof-of-work platform with the Beacon Chain called The Merge.\n\nAs a result, Ethereum has moved from being a highly carbon-intensive platform into a clean proof-of-stake (POS) network. While many developers have welcomed the shift, some believe that proof-of-work (PoW) is a more secure platform. This led to the creation of the Ethereum Proof-of-Work, otherwise known as Ethereum PoW.\n\nThis article discusses what the Ethereum POW is and where and how to buy the ETHW crypto token.\n\nKraken: Top Crypto Platform with High Liquidity Founded in 2011, Kraken is one of the oldest and most popular cryptocurrency exchanges currently in operation. The exchange has built a reputation as being a secure destination for anyone interested in trading cryptocurrencies and it is also a popular choice for both traders and institutions across a variety of locations. Read: Our Full Kraken Review Here Kraken retains an international appeal and provides efficient trading opportunities in numerous fiat currencies. Kraken is also the current world leader in terms of Bitcoin to Euro trading volumes. Kraken is most well known for its Bitcoin and Ethereum to cash (EUR and USD) markets; however a wide range of both fiat and cryptocurrencies are tradable on the platform Pros Dedicated service for institutions\n\nGreat for beginners to use\n\nHigh trading liquidity Cons The lengthy ID verification process Visit Kraken\n\nPoloniex: Easy Platform With Lots of Listings Poloniex is one of the oldest Bitcoin exchanges in the cryptocurrency industry. The platform started operating in 2014 and has enjoyed a checkered trading history. Despite this, Poloniex has continued to attract customers due to its low trading fees and is a gateway into Tron blockchain’s series of decentralised services.\n\nRead: Our Full Poloniex Review Here The platform’s popularity grew due to its low trading fees, sizable support of crypto assets, and zero requirement for verification. The lack of a proper know-your-customer (KYC) framework was due to less regulatory pressure to verify the real-world identities of customers at the time. The platform is suitable for beginners and advanced users as it is easy to use and offers multiple trading options – including crypto-to-crypto trades, crypto-to-fiat trades, and margin and futures trading. The platform comes with one of the lowest trading fees in the emerging crypto market. Pros Lots of Listings\n\nLow Trading Fees\n\nStaking Rewards\n\nCrypto Futures\n\nWell Established Cons Not for USA Users Visit Poloniex\n\nBitfinex: A Trusted Exchange Based in Hong Kong, Bitfinex is owned and operated by iFinex Inc - a financial services company that also owns Tether Limited, the issuer of the USDT stablecoin. The broker is popular for having one of the most liquid order books in the market, ensuring that users looking to buy and sell crypto have no trouble getting it done. Like many other top brokers, Bitfinex offers a versatile platform for anyone looking to enter the crypto market. Investors can buy and trade crypto, stake cryptocurrencies, and lend their coins to earn returns. Read: Our Full Bitfinex Review Here Ease of use is impressive on Bitfinex, with the broker combining an intuitive platform with a low deposit threshold. Deposits on Bitfinex can be made through direct crypto transfers, wire transfers, and card payments. Card payments are processed through a third party, so investors might have to pay more fees. Besides its trading interface, Bitfinex provides easy access to services like margin trading, derivatives offerings, and lending. Investors looking to make high-volume purchases can use Bitfinex’s OTC trading service, while those looking for low-risk gains can use the broker’s staking protocol. Bitfinex uses a maker-taker fee structure for its trades. The fees range between 0% and 0.2%, with fees reducing as investors' order volumes increase. Also, the exchange doesn’t charge any fees for large orders through its OTC desk. Bank wires incur a 0.1% fee for deposits and withdrawals - although expedited withdrawals carry a charge of 1%. Crypto withdrawals incur a small fee, depending on the coin being withdrawn. The exchange protects user funds and data using 2FA, advanced API key permissions, and the storage of 99% of funds in cold storage. Pros Easy-to-use interface\n\nImpressive staking protocol for PoS coins\n\nHighly liquid order book\n\nHigh leverage for derivatives trading\n\nUnlimited withdrawals Cons Higher costs for card transactions Visit Bitfinex\n\nWhat is EthereumPoW (ETHW)?\n\nEthereumPoW is a clone of the proof-of-work (PoW) blockchain used by the Ethereum network before the switch to a proof-of-stake (PoS) consensus algorithm.\n\nThe platform preserves the functionality of the Ethereum network before its switch to PoS. Some members of the mining communities who cannot profit from Ethereum’s new protocol support EthereumPoW.\n\nThe native token of the blockchain, ETHW, can be used to buy products and services from decentralised applications (dApps) created on the platform. The token is also useful to cover network transaction costs and receive rewards for mining to secure the protocol.\n\nInfo On Project\n\nEthereum switched from a so-called proof-of-work system to a proof-of-stake mechanism to conserve energy and secure the network. However, a section of the blockchain’s legacy computing operations declined to take part in the software update known as the Merge.\n\nA team of miners led by Chandler Guo opposed Ethereum’s transition to a more energy-efficient network security method, claiming that Ethereum 2.0 will make crypto miners obsolete. Guo is a seasoned Ether miner and major supporter of Ethereum Classic, another PoW fork of Ethereum.\n\nHolders of ETHPoW are certain that the coin and its ecosystem will stay out of any legal trouble the new Ethereum will encounter. According to Gary Gensler of the SEC, the staking features of the latest version of Ethereum could qualify it as a security under the Howey Test.\n\nFor now, only a few exchanges support ETHW, the native token for the EthereumPoW network. On these exchanges, individuals can trade, and the token is offered for spot trading on platforms like FTX, ByBit, Kraken, and BitMart.\n\nAlong with the mainnet launch, the EthereumPoW team sent an update advising users of some adjustments and updates. There have been more than 1.7 billion transactions since the launch. Also, the total number of addresses holding ETHW now stands at about 254 million.\n\nUse Cases\n\nMany projects have declared support for the EthereumPOW network since its introduction. Uniswap V3, MetaMask, DefiEdge, other decentralised wallets, decentralised exchanges, and other Web3 systems are some of these projects.\n\n.\n\nMining pools that had previously mined on other networks when Ethereum transitioned to a proof-of-stake algorithm have now started mining ETHW. With the mining pool accounting for 41.7% of the known hash rate, F2pool and others have begun directing resources toward the token.\n\nHow Does EthereumPoW Work?\n\nA few hours after Ethereum successfully migrated to the PoS consensus method algorithm, anonymous developers forked the Eth blockchain and introduced the EthereumPoW token. It utilises the Proof-of-Work mechanism (mining) and functions similarly to how Ethereum did previously.\n\nThe underlying algorithm used by proof-of-work blockchains determines mining operations’ rules and difficulty level. The “work” itself is mining. It involves adding legitimate blocks to the chain. Computers must solve cryptographic puzzles as proof of work to be compensated with the capacity to validate blockchain transactions. It’s similar to competition and is known as bitcoin mining. It operates on the concept that one can fend off a malicious attack and confirm the authenticity of a transaction by using a lengthy string of letters and numbers, known as hashes.\n\nThe proof-of-work algorithm that Ethereum’s mainnet has used since its creation will be maintained in ETHPoW. Although the scheduled difficulty bomb was intended to make it impossible to mine on the PoW chain, ETHPoW has continued to be mined by mining pools.\n\nThe ETHPoW fork, which has a similar transaction background as the main Ethereum network, will begin producing its blocks upon activation of the Merge upgrade. The pre-Merge state of the Ethereum network acts as the initiation point for the PoW merge, meaning all token smart contracts and balances will also be brought over.\n\nTherefore, everyone who now has ETH on-chain will end up with an identical amount of ETHW on the ETHPoW chain. Only the PoW fork will have native ETHW, a completely distinct asset from the original Ethereum token (ETH).\n\nWith ETHW originally forking the Ethereum blockchain, the chain would start with the same circulating supply as proof-of-stake Ethereum. The currency supply of the two chains would diverge, though, because the post-Merge Ethereum will have a considerably lower inflation rate than its current PoW version. As a result, the supply of EthereumPoW will increase more quickly than Ethereum on PoS if mining continues.\n\nIs ETHW a Good Investment?\n\nThe creation of ETHW by the community ensured that miners could continue to operate and prevent it from becoming outdated. Ethereum founder Vitalik Buterin claimed that those promoting the hard fork are only “trying to make a quick buck.” However, some notable personalities in the cryptocurrency ecosystem, like Justin Sun and Chandler Guo, have expressed support for the fork chain.\n\nBefore making an ETHW investment, keep the following in mind:\n\nSpeculative Value: Reputable crypto projects have backed the new PoS chain and the Ethereum Foundation. While ETHW is not yet widely accepted like the classic Ethereum, several projects already support the chain, which could lead to more value increases.\n\nReputable crypto projects have backed the new PoS chain and the Ethereum Foundation. While ETHW is not yet widely accepted like the classic Ethereum, several projects already support the chain, which could lead to more value increases. Volatility: Ethereum is the second-largest cryptocurrency by market capitalization; this liquidity promotes a stable market. The market value and trading volume of ETHW are much lower. Any coin with a low trading volume is vulnerable to manipulating the market and experiencing higher volatility.\n\nEthereum is the second-largest cryptocurrency by market capitalization; this liquidity promotes a stable market. The market value and trading volume of ETHW are much lower. Any coin with a low trading volume is vulnerable to manipulating the market and experiencing higher volatility. Exchange Listings: Digital assets are listed on exchanges according to their demand and security. If coins and tokens are regarded as secure and make money from heavy trade, they are more likely to stay listed. However, the exchange may delist the asset if the trading activity falls below a necessary profit margin. However, ETHW is currently tradable on several crypto exchanges, including Kraken, FTX, Poloniex, Gate.io, MEXC, Huobi, etc. This shows there is a growing demand for the digital asset.\n\nHow to Buy EthereumPOW on Kraken\n\nInvestors’ interest in buying EthereumPOW will continue to rise as more people understand how it works. Buying ETHW is straightforward and can be completed with these few steps:\n\nRegister an Account\n\nFirst, users should visit the Kraken site, click “Create Account,” and register by providing a username, email address, and password. Next, click on the verification email sent as part of the registration process.\n\nVerify\n\nOnce users have signed up, they must go through account verification in adherence to the platform’s KYC requirements. For example, to get “Starter Level” verification status, a trader will need to provide a name, email address, physical address, and phone number.\n\nThe “Starter” verification procedure is automated and normally takes less than one hour.\n\nOnce traders are verified, they can access the overview section of their trading dashboard to click on “Buy” to make their first crypto purchase. First, however, they will have to fund their account before they can buy any digital asset.\n\nDeposit Funds\n\nTraders can fund their Kraken account using a credit or debit card, bank account, and cryptos.\n\nThe navigation bar lets traders move between features on the Kraken account dashboard. Traders must click “funding” to make a deposit into their account and select their preferred payment method.\n\nBuy ETHW\n\nCustomers should return to the website and place their first order after receiving notification from Kraken that their cash has arrived. Select “Trade” then click “New Order” from the menu. Users can create customised orders by choosing “Simple” or “Advanced.”\n\nOnly two input fields are available for users if they select the “Simple” option: volume and Amount. Purchasing cryptocurrency at market value is the simplest method. Enter the desired amount for buying the “ETHW/USD” pair. An estimate of the total cost of the order is shown on the right side of the page.\n\nEthereumPOW FAQs\n\nWill Coinbase support ETHW?\n\nETHW is not supported by Coinbase right now. However, the crypto exchange stated that following The Merge, if an ETH PoW fork occurs, this asset will be reviewed with the same scrutiny as any other asset listed on their exchange. Therefore, there might still be future support for the digital asset.\n\nWhat is Ethereum PoW?\n\nEthereumPoW is a clone of the proof-of-work (PoW) blockchain used by the Ethereum network before switching to a proof-of-stake (PoS) consensus algorithm. The mining communities that cannot profit from Ethereum’s new protocol support EthereumPoW because it preserves the functionality of the Ethereum network before its switch to PoS.\n\nCan you mine proof-of-stake?\n\nProof of stake cannot be mined. For proof of stake, validators are chosen at random to verify blocks of information and confirm transactions. Instead of employing a competitive rewards-based approach like proof-of-work, this system randomly selects who is eligible to receive fees. Proof-of-stake blockchains enable networks to run with significantly reduced resource consumption since they do not require miners to expend electricity on redundant processes (competing to solve the same puzzle).\n\nWhich coins use proof-of-stake?\n\nProof-of-stake (PoS) is a consensus mechanism for blockchain networks, and some coins that use this mechanism include Ethereum (ETH), Cardano (ADA), Solana (SOL), Tezos (XTZ), Algorand (ALGO), etc."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJpdGNvaW5zZW5zdXMuY29tL2V0aGVyZXVtLW5ldHdvcmstZ2FzLWZlZXMtZHJvcC10by1uZXctbG93LWR1ZS10by1kZWNsaW5pbmctYWN0aXZpdHktaW4tZGVmaS1hbmQtbmZ0cy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Network Gas Fees Drop to New Low Due to Declining Activity in DeFi and NFTs - Bitcoinsensus",
        "content": "Ethereum gas fees hit a historic low at 8.8 Gwei on October 8, 2023, creating significant interest within the cryptocurrency community.\n\nReduced engagement in decentralized finance (DeFi) applications, non-fungible tokens (NFTs), layer-2 networks, and Telegram bots played a crucial role in driving down Ethereum’s gas fees.\n\nThe drop in Ethereum gas fees led to a shift from a deflationary to an inflationary state for Ethereum in September, influencing the overall supply of the cryptocurrency.\n\nOn October 8, 2023, the cryptocurrency community witnessed a remarkable event as Ethereum’s average gas fees dropped to a low of 8.8 Gwei. This marked a historic moment, as gas fees hadn’t reached such levels since October 2, 2022.\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nThe decline in Ethereum’s gas fees generated intense interest and debate throughout the blockchain ecosystem. Gas fees on the Ethereum network are measured in Gwei, which is a unit equivalent to 10^9 Wei – the smallest denomination of Ethereum (ETH).\n\nSeveral factors contributed to the unprecedented drop in Ethereum’s gas fees. For instance, major players on the Ethereum network, such as Uniswap, 1inch, and MetaMask, added to the reduced gas fees. These Ethereum networks had a double-digit decrease in their gas consumption within a single week.\n\nThis shows a changing landscape in Ethereum as these entities adjusted their strategies in response to market conditions. Top gas spenders, including exchanges like Binance and Coinbase, as well as layer-2 networks, spent 30% less compared to the previous week.\n\nCurrently, FTX proposes customer fund return plan, potentially returning up to 90% of funds. Read here.\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nThis marked a notable change, especially for low-fee layer-2 networks, which had seen consistent growth over the past year. These changes demonstrate the adaptability of the Ethereum ecosystem in response to evolving market dynamics.\n\nAnother key contributor was the decreased engagement in decentralized finance (DeFi) applications, non-fungible tokens (NFTs), layer-2 networks, and even Telegram bots. NFTs experienced a substantial dip in their weekly trading volumes.\n\nNFT trading volumes dropped to levels not seen in two years. This shift is indicative of evolving trends and priorities within the cryptocurrency space. Telegram bots, which enjoyed a surge in popularity in the second quarter of the year, also witnessed a decline in activity as October began.\n\nEthereum Turns Inflationary Due to Reduced Gas Fees\n\nThe decrease in Ethereum gas fees had a big impact beyond just the cost of transactions. In September, Ethereum went from being in a deflationary state to an inflationary one, and this was mainly due to the lower gas fees.\n\nAdditionally, ETH experienced its lowest rate of “burn,” where only 7,084 ETH was used up, which was quite different from earlier times.\n\nEnhance Your Crypto Trading Skills With Our Legends’ Trading Masterclass\n\nEmpower your crypto trading skills with our Legends Masterclass. Sign up now and take advantage of our limited-time discount offer! Join the class today.\n\nBecause of these changes, the supply of Ethereum started increasing at a daily rate of about 1,450 ETH, which is roughly equivalent to $2.2 million worth of Ethereum.\n\nThis shift in how Ethereum’s supply works resulted in an annual inflation rate of 0.44%. This gives some insight into what it means for Ethereum to move towards an inflationary model and how sustainable it might be in the long run."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMTAvMjUvcG9seWdvbi1sYXVuY2hlcy1uZXctcG9sLXRva2VuLWNvbnRyYWN0LW9uLWV0aGVyZXVtLW1haW5uZXQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "Polygon Launches New POL Token Contract On Ethereum Mainnet - Crypto Times",
        "content": "In the latest development, Polygon Labs has launched an Ethereum contract for its new POL token, intended to power the Polygon zkEVM layer-2 ecosystem.\n\nPOL token, ‘a next-generation hyperproductive token’, will eventually replace MATIC, Polygon’s original staking and gas token, according to the October 25 announcement.\n\nThe POL token upgrade is now live on Ethereum mainnet.\n\n\n\nPolygon 2.0, released this summer, is a roadmap for scaling Ethereum to build the Value Layer of the Internet. POL unlocks that future.\n\n\n\nPOL is a next-generation token that can power a vast ecosystem of ZK-based L2 chains.… pic.twitter.com/gmrsu0ZqLz — Polygon (@0xPolygon) October 25, 2023\n\nHowever, Polygon emphasized that MATIC holders do not need to immediately swap their tokens for POL. MATIC will continue to be used for staking, transaction fees, and other operations on Polygon’s proof-of-stake network.\n\nThe POL token will only be utilized once additional layer-2 networks launch on Polygon 2.0 next year.\n\nPOL token will boost the ecosystem of zk-based Layer 2 chains through Polygon’s native re-staking protocol. The protocol allows POL holders to sail across various chains for various purposes, including sequencing, ZK proof generation, participation in data availability committees, etc.\n\nThe POL token was created on the Ethereum blockchain earlier today at 9:06 am UTC under the name “Polygon Ecosystem Token.” Polygon first unveiled plans for a new token and layer-2 ecosystem called Polygon 2.0 in June. At the time, specific details were not made available.\n\nLast month, the team revealed that a zero-knowledge proof-based network called the Polygon zkEVM would serve as the flagship layer-2 chain in Polygon 2.0.\n\nThe zkEVM will offer faster and cheaper transactions while ensuring a high degree of privacy and security.\n\nZero-knowledge proofs allow transactions to be validated without revealing any underlying data. Polygon believes this technology will greatly expand its layer-2 ecosystem while avoiding bottlenecks and congestion issues faced by rival platforms.\n\nThe launch of the POL token is a significant milestone along Polygon’s roadmap for phasing in Polygon 2.0 over the coming year.\n\nOther planned upgrades include a new staking layer, transitioning the existing proof-of-stake chain to a zkEVM-based layer-2, and creating a modular liquidity protocol.\n\nPolygon Co-Founder Mihailo Bjelic stated that POL unlocks “an exponential increase in flexibility and modularity that will power Web3 to scale new heights.”"
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMingFodHRwczovL2NyeXB0b2RhaWx5LmNvLnVrLzIwMjMvMTAvY2FuLWV0aGVyZXVtLWV0aC1yaXBwbGUteHJwLWFuZC1jYXJkYW5vLWFkYS1yZWFjaC1uZXcteWVhcmx5LWhpZ2hzLWFmdGVyLWV4cGxvZGluZy1pbi10aGUtbGFzdC01LWRheXMtZXhwZXJ0cy1hcmUtb3B0aW1pc3RpY9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "Can Ethereum (ETH), Ripple (XRP) and Cardano (ADA) Reach New Yearly Highs After Exploding In The Last 5 days ... - CryptoDaily",
        "content": "Table of Contents\n\nThe cryptocurrency market has been experiencing a whirlwind of activity lately. Following a fiery trading session, US crypto stocks saw a slight dip in their earlier gains. Bitcoin, the primary catalyst for these stock surges, experienced a dip from its $35,000 peak to around $33,800. Mining companies, despite the fluctuations in Bitcoin's price, managed to stay in the green. Amidst the market's ups and downs, Ethereum (ETH), Ripple (XRP), and Cardano (ADA) maintain their presence, each contributing to the market's complex dynamics. The market's current dynamics suggest that while there are bullish tendencies, caution is advised due to potential volatility. In this vibrant scenario, ScapesMania (MANIA) is emerging as a notable force, adding a layer of excitement and anticipation among traders and market watchers alike.\n\nThroughout 2023, ScapesMania (MANIA) has been rising at an even more impressive rate than Ethereum (ETH), Ripple (XRP), and Cardano (ADA), raising the question of whether traders should even try and hold these coins, hoping for them to potentially reach new yearly highs, someday. Let's examine the current indicators!\n\nScapesMania: Rising Phenomenon\n\nMany crypto experts pick ScapesMania as the best new project of 2023 and beyond. It manages to separate itself from the competition by offering holders a multitude of revenue streams and high potential ROIs during presale.\n\nCompanies and individual crypto traders looking for fast potential gains should definitely look into ScapesMania's proposition. Once the presale finishes, the price will soar, securing possible returns in the range of 400-500%. Right now, there's an active discount of close to 85%, but it won't last forever - the clock is ticking and all interested in leveraging this offer need to act fast.\n\nWhen dissecting the tokenomics and other features of ScapesMania, it becomes clear that it's the best altcoin to hold now. The innovative gaming-related core idea, impressive presale numbers, $150,000 giveaway, undying social media hype, and other positive aspects can guarantee that ScapesMania will continue on its winning journey, so it makes sense to get involved as soon as possible.\n\n>>> Join Presale at a Discount on the Official Site <<<\n\nEthereum (ETH): Challenges and Potential\n\nEthereum (ETH) recently marked a significant milestone with over 100 million addresses holding at least a minimal amount of Ethereum (ETH). This growth is attributed to increased accumulation by market players since mid-October. However, despite this achievement, on-chain data suggests that new entrants aren't flocking to the Ethereum (ETH) network as expected. This indicates that the surge in addresses might be due to previous holders returning, rather than fresh adoption.\n\nEthereum (ETH) price has been fluctuating within the range of $1,570 to $1,732. Despite a 6.93% growth in the past week, Ethereum (ETH) performance has been lackluster compared to other leading cryptocurrencies. Technical indicators show that Ethereum (ETH) has faced resistance levels at $1,794 and $1,955, making it challenging for the cryptocurrency to break out. On the flip side, support levels are identified at $1,308 and $1,470, suggesting that Ethereum might find some stability around these price points.\n\nGiven Ethereum (ETH) current market dynamics, there's potential for further price corrections. While Ethereum (ETH) has been at the forefront of the decentralized finance (DeFi) movement and has pioneered smart contracts, it faces several challenges. Network congestion and high transaction fees have been persistent issues, causing users to seek alternatives. These challenges have raised concerns about Ethereum (ETH) long-term viability, especially with emerging competitors in the space.\n\nRipple (XRP): Celebrations and Cautions\n\nRipple (XRP) has been in the spotlight due to the U.S. Securities and Exchange Commission (SEC) unexpectedly dismissing its charges against Ripple (XRP) executives. This decision led to a temporary surge in Ripple (XRP) price by over 8%. However, the celebration might be short-lived, as legal experts speculate that the SEC's move could be a strategy to expedite an appeal.\n\nRipple (XRP) underlying technology offers faster and more affordable cross-border transactions, making it appealing to financial institutions. However, regulatory challenges and the ongoing legal battle with the SEC have cast a shadow over its prospects.\n\nRipple (XRP) price has seen fluctuations within the range of $0.466 to $0.556. Following the SEC's decision, there was an 8% surge in its price. However, the broader market sentiment remains cautious. The 10-Day Moving Average for Ripple (XRP) stands at $0.521, with the 100-Day Moving Average at $0.562. These averages, combined with resistance levels at $0.597 and $0.688, suggest that Ripple (XRP) might face challenges in achieving significant price gains in the near term.\n\nWhile the recent legal victory has provided some respite for Ripple (XRP), the future remains uncertain. The SEC's decision to dismiss charges might be a double-edged sword, with potential implications for Ripple (XRP) long-term legal standing. Additionally, Ripple (XRP) adoption by financial institutions could be hampered by regulatory uncertainties. Investors should remain vigilant and consider the potential risks associated with Ripple (XRP), given the unpredictable legal and regulatory landscape.\n\nCardano (ADA): Restructuring on the Horizon?\n\nCardano (ADA) has been in the spotlight due to concerns about potential restructuring. There are indications that Cardano (ADA) might need to undergo urgent restructuring under certain circumstances. While the specifics of these circumstances are not detailed here, it's evident that the Cardano (ADA) community and investors are closely monitoring the situation.\n\nCurrently, Cardano (ADA) price is oscillating between $0.240 and $0.263. The 10-Day Moving Average stands at $0.260, slightly below the 100-Day Moving Average of $0.269. This suggests that Cardano (ADA) is experiencing a period of consolidation, with the price struggling to break out of its current range. Technical analysis indicates that Cardano (ADA) has established support levels at $0.205 and $0.227. On the upside, resistance levels are set at $0.272 and $0.294. These levels provide insights into potential price movements and can be crucial for traders and investors to watch.\n\nCardano (ADA) future seems to be at a crossroads. While the project has a strong foundation and a dedicated community, external factors and internal challenges could influence its trajectory. The potential need for restructuring adds another layer of uncertainty to Cardano (ADA) outlook. Investors and stakeholders should remain vigilant, keeping an eye on developments and making informed decisions based on comprehensive research and analysis.\n\nConclusion\n\nThe cryptocurrency market remains a dynamic and ever-evolving landscape. While established players like Ethereum (ETH), Ripple (XRP) and Cardano (ADA) navigate through challenges, newer entrants like ScapesMania (MANIA) are making their mark.\n\nRight now, the ScapesMania can easily eclipse all the other coins mentioned in the article due to the fact that it offers steady growth, pre-sale bonuses of different kinds, multi-level discounts, and so, so much more!\n\nDisclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8venljcnlwdG8uY29tL21ham9yLW1pbGVzdG9uZS1hcy1wb2x5Z29ucy1wb2wtdG9rZW4tZGVwbG95cy1vbi1ldGhlcmV1bS1jYW4taXQtZHJpdmUtbWF0aWMtdG8tYXN0cm9ub21pY2FsLWhpZ2hzL9IBfGh0dHBzOi8venljcnlwdG8uY29tL21ham9yLW1pbGVzdG9uZS1hcy1wb2x5Z29ucy1wb2wtdG9rZW4tZGVwbG95cy1vbi1ldGhlcmV1bS1jYW4taXQtZHJpdmUtbWF0aWMtdG8tYXN0cm9ub21pY2FsLWhpZ2hzLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "Major Milestone As Polygon’s POL Token Deploys On Ethereum — Can It Drive MATIC to Astronomical Highs? - ZyCrypto",
        "content": "Advertisement\n\nPolygon Labs has taken a huge step toward realizing Polygon 2.0. The scaling technology firm has successfully launched smart contracts of the project’s next-generation token, POL, on Ethereum.\n\nThe Polygon 2.0 roadmap entails a token switch from MATIC to POL.\n\nPOL Token Contracts Debut On Ethereum\n\nPolygon Labs revealed in an October 25 press release that the POL token has gone live on the Ethereum mainnet.\n\nCrucially, POL is an upgrade from the MATIC token, which will be deprecated as part of the move. MATIC token holders will have roughly four years to transfer their holdings to the new token.\n\n“Today marks a major milestone on the Polygon 2.0 journey toward building the Value Layer of the Internet. The upgrade to POL has been initiated on the Ethereum mainnet, after months of development, community consultation, and a successful testnet launch,” Polygon Labs stated in the official announcement.\n\nAdvertisement\n\nPolygon Labs first announced POL in July 2023, and it expects it to work as a multipurpose token and play a key role in the network’s broader 2.0 upgrade.\n\nIn September, Polygon released three inaugural Polygon Improvement Proposals (PIPs) for community consideration and voting. The PIPs outline technical details for “Phase 0, which includes a proposal for the transition and specifications that will see MATIC become POL.\n\nThe Polygon 2.0 vision paints a picture of multiple Polygon-based chains, bridges, and the implementation of privacy-enhancing zero-knowledge (ZK) proofs to validate all transfers. POL, a next-generation hyperproductive token, will power all Polygon-based networks: the main Polygon blockchain, the Polygon zkEVM network, and various supernets.\n\nTo help secure all these layers, POL will reportedly allow users to stake their holdings across as many compatible chains as they want. This suggests that users start accruing protocol rewards and transaction fees on each staked chain as soon as they deposit their holdings.\n\nIt’s worth mentioning that the POL token will not immediately replace MATIC despite the deployment on the Ethereum mainnet.\n\nIs MATIC Set For Major Surge?\n\nIn terms of what comes next on the Polgyon 2.0 roadmap, Polygon has hinted at transitioning its proof-of-stake chain to a zkRollup as well as implementing a new ZK-powered interoperability and shared liquidity protocol for its multiple chains.\n\nIt is my pleasure to report that POL contracts are live on Ethereum mainnet! 🤩💫\n\n\n\nThe launch of POL is a major milestone on the Polygon 2.0 roadmap, but it’s only the beginning. It paves the way for a number of upgrades, including launching a new staking layer to power Polygon… pic.twitter.com/9qdY6Bv5Lp — Mihailo Bjelic (@MihailoBjelic) October 25, 2023\n\nThe price of MATIC gained 25.3% in the last week, indicating investors are ready to snap up tokens with positive fundamental developments that promise increased use cases. The token is up 2.8% on the day, currently trading hands at $0.6456, according to CoinGecko data.\n\nMATIC is still down 77.92% from its December all-time high of $2.92, although the team has been consistently delivering the necessary updates and improvements to the Polygon network. It’s worth noting that mainnet and protocol updates tend to cause bullish price action.\n\nInvestors will be closely monitoring the progress of the Polygon 2.0 roadmap following the launch of POL."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMiqwFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0by1wcmljZS10b2RheS1vY3RvYmVyLTI1LWNoZWNrLWdsb2JhbC1tYXJrZXQtY2FwLWJpdGNvaW4tYnRjLWV0aGVyZXVtLWRvZ2Utc29sYW5hLWxpdGVjb2luLXBlcGUtY2hhaW5saW5rLWFicC1saXZlLXR2LTE2MzgxNDDSAa8BaHR0cHM6Ly9uZXdzLmFicGxpdmUuY29tL2J1c2luZXNzL2NyeXB0by9jcnlwdG8tcHJpY2UtdG9kYXktb2N0b2Jlci0yNS1jaGVjay1nbG9iYWwtbWFya2V0LWNhcC1iaXRjb2luLWJ0Yy1ldGhlcmV1bS1kb2dlLXNvbGFuYS1saXRlY29pbi1wZXBlLWNoYWlubGluay1hYnAtbGl2ZS10di0xNjM4MTQwL2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Remains Stable, Ethereum Drops Below $1,800 - ABP Live",
        "content": "Bitcoin (BTC), which managed to climb above the $34,000 mark yesterday, managed to hold on to its newfound high early Wednesday morning. However, Ethereum (ETH) lost its $1,800 mark and was found dwelling within the $1,700 range. It is usual to see a bout of dip in coin prices right after a sudden rally. Hence, most of the popular altcoins — including the likes of Dogecoin (DOGE), Ripple (XRP), Solana (SOL), and Litecoin (LTC) — saw minor dips across the board. Memecoin Pepe (PEPE), which was the biggest gainer on Tuesday, emerged to be the biggest loser of the lot, with a 24-hour dip of over 7 percent. The MINA token, on the other hand, became the biggest gainer, with a whopping 24-hour jump of over 50 percent.\n\nThe global crypto market cap stood at $1.25 trillion at the time of writing, registering a 24-hour dip of 1.67 percent.\n\nBitcoin (BTC) Price Today\n\nBitcoin price stood at $34,016.72, registering a 24-hour dip of 1.40 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 28.59 lakh.\n\nEthereum (ETH) Price Today\n\nETH price stood at $1,788.11, marking a 24-hour loss of 1.78 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 1.51 lakh.\n\nDogecoin (DOGE) Price Today\n\nDOGE registered a 24-hour dip of 3.09 percent, as per CoinMarketCap data, currently priced at $0.06612. As per WazirX, Dogecoin price in India stood at Rs 5.57.\n\nLitecoin (LTC) Price Today\n\nLitecoin saw a 24-hour loss of 2.09 percent. At the time of writing, it was trading at $69.67. LTC price in India stood at Rs 5,856.75.\n\nRipple (XRP) Price Today\n\nXRP price stood at $0.5537, seeing a 24-hour jump of 0.78 percent. As per WazirX, Ripple price stood at Rs 46.76.\n\nSolana (SOL) Price Today\n\nSolana price stood at $31.03, marking a 24-hour loss of 1.81 percent. As per WazirX, SOL price in India stood at Rs 2,722.95.\n\nTop Crypto Gainers Today (October 25)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nMina (MINA)\n\nPrice: $0.731\n\n24-hour gain: 51.65 percent\n\nConflux (CFX)\n\nPrice: $0.15\n\n24-hour gain: 19.98 percent\n\nChainlink (LINK)\n\nPrice: $11.34\n\n24-hour gain: 8.72 percent\n\ndYdX (DYDX)\n\nPrice: $2.30\n\n24-hour gain: 6.49 percent\n\nCasper (CSPR)\n\nPrice: $0.03436\n\n24-hour gain: 6.07 percent\n\nTop Crypto Losers Today (October 25)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nPepe (PEPE)\n\nPrice: $0.0000009373\n\n24-hour loss: 7.63 percent\n\nStacks (STX)\n\nPrice: $0.6758\n\n24-hour loss: 7.52 percent\n\nMaker (MKR)\n\nPrice: $1,471.83\n\n24-hour loss: 7.42 percent\n\nBitcoin SV (BSV)\n\nPrice: $51.31\n\n24-hour loss: 5.79 percent\n\nGMX (GMX)\n\nPrice: $40.34\n\n24-hour loss: 5.60 percent\n\nWhat Crypto Exchanges Are Saying About Current Market Scenario\n\nMudrex co-founder and CEO Edul Patel told ABP Live, “Bitcoin's value soared above the $35,000 mark after the appearance of BlackRock's spot bitcoin ETF (IBTC) ticker on the US Depository Trust & Clearing Corporation's (DTCC) website. However, over the past 24 hours, prices settled at the $34,000 range as the ticker disappeared and then reappeared. This bullish upturn may also be attributed to Grayscale's legal victory against the US SEC after the D.C. Circuit Court of Appeals ordered the SEC to reconsider its prior rejection of Grayscale's spot bitcoin ETF application. These developments have raised optimism among market participants, fueling expectations of an impending approval for Bitcoin spot ETF applications. Meanwhile, Ethereum has continued to trade above the $1,700 level.”\n\nRajagopal Menon, Vice President, WazirX, said, “Bitcoin’s breakaway from consolidation has been phenomenal with prices increasing to the levels of last year April. The increase in fund inflows and the short squeeze on the network last week added to the surge. The SEC’s softening stance towards Crypto ETFs as per prominent institutional investors, has also ignited hopes of an early bull market which might be too soon to predict. Bitcoin’s market dominance was prominent as key tokens such as Ether, Solana, etc. increased in price following BTC’s price rally.”\n\nSathvik Vishwanath, CEO and co-founder of Unocoin, said, “Bitcoin's meteoric 10 percent rise this week to an all-time high of $35,900 has had a ripple effect on related stocks. MicroStrategy, known for its sizable bitcoin holdings, saw its shares rise a remarkable 12 percent, bringing unrealized bitcoin gains close to $1 billion. Coinbase shares rose 7.33 percent, reflecting the cryptocurrency's success. Bitcoin mining companies Riot Blockchain and Marathon Digital Holdings surged more than 10 percent and 12 percent, respectively, beating Bitcoin in both daily and year-to-date gains. Companies like Cipher Mining, Riot Platforms, and Bitfarms have exceeded 100 percent growth this year. This increase can be attributed to a variety of factors, including anticipation of a bitcoin halving event in 2024 and a legal ruling in favour of Grayscale's application for a bitcoin ETF, which was previously rejected by the SEC. This decision, reiterating the approval of the Bitcoin futures ETF, underscores the continued importance of Bitcoin in the financial landscape.”\n\nCoinDCX Research Team told ABP Live, “Over the past 24 hours, both BTC and ETH have experienced approximately a 2 percent decline. This dip could be linked to the temporary removal of BlackRock's (BLK) spot Bitcoin ETF ticker, IBTC, from the Depository Trust & Clearing Corporation's (DTCC) website. However, it's important to note that the ticker was relisted after a few hours. The presence of the ticker on the DTCC site had led investors to speculate about the imminent approval of a spot Bitcoin ETF, which contributed to BTC's significant surge from the $30,000 range to over $35,000.”\n\nSubscribe And Follow ABP Live On Telegram: t.me/officialabplive\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiOmh0dHBzOi8vaW5mbHVlbmNlcm1hcmtldGluZ2h1Yi5jb20vdG9wLWNyeXB0by1pbmZsdWVuY2Vycy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "Top 15 Crypto Influencers You Should Be Following on Social Media - Influencer Marketing Hub",
        "content": "Cryptocurrency has become more than just a buzzword for the tech- and business-savvy. While it may have only gained the traction that it has over the past couple of years, cryptocurrency, or crypto, has been around since 2009.\n\nThe technology powering cryptocurrency and attempts to create digital currencies have been around since the 1980s and the 1990s. In fact, one of the earliest attempts to establish a digital currency took place in the 1990s with DigiCash.\n\nTry our FREE Crypto Profit Calculator to see what your Crypto would be worth today if you invested in the past\n\nFast forward to 2009 with the creation of Bitcoin, which would be considered the first cryptocurrency, and we’re now seeing the birth of a multitude of different cryptocurrencies every month.\n\nToday, we have more than 22,000 different cryptocurrencies, with an estimated total value of $1 trillion. Some of the top cryptos, with billions of dollars in market capitalization, include Bitcoin, Ethereum, Tether, Binance Coin, and Dogecoin.\n\nIn fact, a new cryptocurrency called \"Love Hate Inu\" (LHINU) has emerged recently. Operating on the Ethereum blockchain, this digital currency is designed to engage users in a unique way through staking, voting on meme polls, and earning rewards. As cryptocurrencies continue to gain popularity, more and more individuals are trying to join the action. While news and articles explain the basics of crypto, how it works, and market trends, they may not provide the valuable insights needed to truly understand the industry. Thankfully, thought leaders and crypto pioneers have taken to the internet to share market insights and perspectives with a global audience, helping both investors and those who plan to join the crypto space stay up-to-date on everything related to cryptocurrency.\n\nTop Crypto Influencers You Should Be Following on Social Media:\n\nTop Crypto Thought Leaders to Follow on Social Media\n\nCryptocurrencies such as Bitcoin and Dogecoin have become very popular lately due to a number of reasons. From investors who see crypto as the currency of the future and individuals who like the idea of decentralized control and processing to people who like the technology that’s powering crypto, we find no shortage of individuals who are engaging in the industry.\n\nWith so many crypto thought leaders who use various social media platforms to share their insights, it was tough to narrow down the list to just 15. We managed to accomplish the task by focusing not only on the number of their followers, but also on how they have used different social media platforms to promote a holistic view of the blockchain industry.\n\nWe’ve selected thought leaders who are on platforms such as Twitter and YouTube, and we’ve likewise included a number of crypto websites and blogs on the list for those who want a more in-depth look at the industry. We’ve also deviated slightly from the more traditional definition of what an influencer is to include individuals who, while not influencers per se themselves, are respected and looked up to in the industry.\n\n1. Vitalik Buterin - @VitalikButerin\n\nProtocol and staking pool changes that could improve decentralization and reduce consensus overhead: https://t.co/PvdKeYmObj — vitalik.eth (@VitalikButerin) October 7, 2023\n\nWhat better way to start any crypto influencer list than with Vitalik Buterin, Ethereum co-founder and one of the world’s youngest crypto billionaires. Known for his work in Ethereum, Buterin has also been involved in the Bitcoin community as a writer and developer. He’s also the co-founder of Bitcoin Magazine, a website that’s also included on our list.\n\nHe currently has around 5 million followers on Twitter where he is active. On Twitter, you can find him sharing insightful commentaries about crypto and blockchain. On the platform, he shares reviews, articles, and other valuable resources on crypto that are especially helpful for anyone who’s looking to gain a better understanding of how crypto and blockchain work.\n\n2. Roger Ver - @rogerkver\n\nThe man I first heard about #Bitcoin from is facing 20 years in prison for things that shouldn’t be crimes at all. (He sold #Cryptocurency to people who wanted to buy it) #cryptosix #FreeRoss @CoinDesk @Cointelegraph @BTCTN https://t.co/O8gB9mOV1H — Roger Ver (@rogerkver) October 1, 2023\n\nKnown as “Bitcoin Jesus,” Roger Ver was one of the earliest promoters of Bitcoin back in 2011. He was one of the early adopters of blockchain technology and has invested large sums of money for crypto-related startups including Bitcoin, Ripple, Kraken, and Purse.io. He’s also known as one of the first entrepreneurs to start accepting crypto as a form of payment.\n\nOn Twitter, he has approximately 741,5K followers, and his feed has become a valuable source of the latest news and information on Bitcoin and crypto, including issues surrounding Bitcoin and Bitcoin Cash, ethical considerations, and even the occasional bits of worldly wisdom. What else can you expect from the man known as Bitcoin Jesus?\n\n3. Andreas M. Antonopoulos - @aantop\n\nMany years ago I \"coined\" the phrase #NotYourKeysNotYourCoins to teach people the concept of self-custody for #bitcoin& other #cryptoassets. My workshop \"Path to Self-Custody\" teaches you how to put it in practice, step by step. Knowledge is power: https://t.co/xseygIq4Yi — Andreas (aantonop) (@aantonop) December 15, 2022\n\nAndreas Antonopoulos is a Greek-British tech entrepreneur who’s also known for being a Bitcoin and blockchain advocate. He’s also an author who has written books that help explain Bitcoin and the blockchain industry, such as Mastering Bitcoin: Unlocking Digital Currencies, Mastering Ethereum, and The Internet of Money.\n\nHe’s active on different social and digital platforms. Aside from having a Twitter account with more than 754.3K followers, he also runs a popular YouTube channel, aantonop, where he posts videos about Bitcoin, blockchain, and cryptocurrency, among others. These videos give an in-depth look at the industry, making them a great jump-off point for beginners who want to have a better understanding of blockchain and crypto and how they work. On the channel, he also shares interviews, Q-and-As, and livestreams. On his website, he offers workshops and other resources that’ll help bolster your crypto education. On top of all these platforms, Antonopoulos also runs two podcasts, the Unscrypted Podcast and the Speaking of Bitcoin Podcast.\n\n4. Charlie Lee - @SatoshiLite\n\nAs we are approaching the 10th anniversary of Litecoin, I figured it's a good time to do a long Twitter ? on the history of Litecoin from my perspective. My memory of events can be hazy at times, so for those mentioned, feel free to add or correct anything I say. Here goes... — Charlie Lee Ⓜ️?️ (@SatoshiLite) October 7, 2021\n\nLitecoin founder and former Coinbase Director of Engineering, Charlie Lee has a 1M followers on Twitter, making him one of the more popular thought leaders and crypto authorities. On his Twitter account, Lee shares the latest Litecoin and Litecoin Foundation news, as well as the latest articles related to crypto. He occasionally shares memes and comic strips that paint crypto news and issues in a more accessible and humorous way. In 2021, Lee joined BTCS Inc. as one of its Board of Directors.\n\n5. Anthony Pompliano - @APompliano\n\nMy rules of business: Build shit people want, never give up, avoid assholes, question assumptions, learn new ideas & always reward ambition — Pomp ? (@APompliano) November 13, 2016\n\nAnthony Pompliano is one of the more active crypto influencers across a number of platforms, not just on Twitter, where he has more than 1,6M followers. He’s known as one of the pioneer Bitcoin supporters and is a founder and partner at a hedge fund that specializes in blockchain technology and digital assets.\n\nHe also runs a YouTube channel, Anthony Pompliano, where he posts videos on Bitcoin and crypto discussions, podcasts, interviews, and explanations about business, tech, and finance. Pompliano also has a Substack newsletter called The Pomp Letter, which is a daily newsletter that shares his analysis on various industries including finance and tech.\n\n7. Erik Voorhees - @ErikVoorhees\n\nLarge trades of stables <> #Bitcoin now served better by @Thorchain than @binance ...and one of them is open-source, decentralized, and permissionless ✨ (Defispot is a front-end for Thorchain) https://t.co/bL9rBDYQIN — Erik Voorhees (@ErikVoorhees) October 18, 2023\n\nKnown as the founder and CEO of ShapeShift, one of the world’s leading crypto exchange platforms, Voorhees is also the co-founder of Coinapult, a Bitcoin wallet. With his experience in Bitcoin and crypto, he is heralded as one of the leading voices when it comes to Bitcoin and crypto entrepreneurship. He actively shares his insights on Twitter with his 663,8K followers. He’s also on Medium, where he writes articles about Bitcoin and ShapeShift.\n\n8. Changpeng Zhao - @cz_binance\n\nWill try to keep 2023 simple. Spend more time on less things. Do's and Don'ts. 1. Education\n\n2. Compliance\n\n3. Product & Service 4. Ignore FUD, fake news, attacks, etc. In the future, would appreciate if you can link to this post when I tweet \"4\". ? — CZ ? Binance (@cz_binance) January 2, 2023\n\nChangpeng Zhao, or simply \"CZ,\" is the founder and CEO of Binance, one of the world's leading cryptocurrency exchanges. With a staggering 8.6 million followers on Twitter, CZ is a key figure in the crypto space. He shares a wealth of information on the crypto markets, Binance's latest developments, and his unique perspective on the evolving world of digital currencies.\n\n9. Michael Saylor - @saylor\n\nMichael Saylor, CEO of MicroStrategy, is a prominent advocate for Bitcoin as a long-term investment. With a Twitter following of 3.1 million, Saylor's views on the digital currency have influenced many to adopt a similar outlook. He's also known for steering MicroStrategy to invest heavily in Bitcoin, making it one of the first publicly-traded companies to do so.\n\n10. Raoul Pal - @RaoulGMI\n\nThe lastest episode of \"Raoul Pal - The Journeyman\" is out on YouTube and this one is a truly epic conversation! Make sure you subscribe to the YT channel to get notified. Dee Smith: The Collapse of World Order https://t.co/DXf57JHfyK via @YouTube — Raoul Pal (@RaoulGMI) October 23, 2023\n\nAs the founder and CEO of Real Vision Group, a financial media company, Raoul Pal has attracted nearly 1 million followers on Twitter. He regularly shares his thoughts on the future of finance, including the role of digital currencies and the potential impact of blockchain technology. Pal's expertise and thought leadership make him a must-follow for those seeking a deeper understanding of the financial landscape.\n\n11. Brian Armstrong - @brian_armstrong\n\n1/ I'm sharing the 10 ideas I'm most excited about in crypto right now. If you're building something in crypto or thinking about doing so - check it out. We’re building lots at Coinbase, but we don't have time to tackle everything. So I figured I'd share these. Bear markets are… pic.twitter.com/XKzCkMaOOT — Brian Armstrong ?️ (@brian_armstrong) August 30, 2023\n\nBrian Armstrong, the co-founder and CEO of Coinbase, one of the world's leading cryptocurrency exchanges, is a prominent figure in the crypto community. With around 1.2 million followers on Twitter, Armstrong shares his opinions on regulatory events in the US and around the globe, as well as news related to Coinbase. His insights into the industry are invaluable for anyone interested in the world of cryptocurrencies.\n\n12. Sandeep Nailwal - @sandeepnailwal\n\nI’m thrilled to announce our Chain Development Kit (CDK) – a software suite that empowers builders to launch their own fully-featured ZK-powered L2s. Polygon CDK is the evolution of Supernets. Now builders can easily customise and deploy their own appchains, with added features… pic.twitter.com/bxphLzZCIc — Sandeep Nailwal | sandeep. polygon ? (@sandeepnailwal) August 29, 2023\n\nSandeep Nailwal, co-founder and COO of Polygon, a blockchain platform that focuses on scalability, is an up-and-coming influencer in the crypto space. With over 262.7K followers on Twitter, Nailwal shares updates on Polygon's latest developments, as well as his views on the broader crypto market. As Polygon continues to grow, Nailwal is definitely one to watch.\n\n13. BitBoy Crypto - @Bitboy_Crypto\n\nEverything you need to know about Chainlink, one of the most important blockchains in the space. ??https://t.co/JUuruDQxGi — Bitboy Crypto (@Bitboy_Crypto) August 31, 2023\n\nBitBoy Crypto is a popular crypto influencer with 1 million followers on Twitter. His engaging content covers trading strategies, market analysis, and the latest cryptocurrency news. BitBoy Crypto's charismatic personality, combined with his knack for breaking down complex topics, makes his channel a favorite among crypto enthusiasts.\n\n14. Arthur Hayes - @CryptoHayes\n\nThe bond vigilantes are yelling “down with the dollar.” Look out for my spicy essay “The Periphery” dropping this week where I discuss the Hamas vs. Israel war, the US Treasury market, and $BTC. YCC = $1mm $BTC is in full effect. Yachtzee!!! pic.twitter.com/1ABcW1esaf — Arthur Hayes (@CryptoHayes) October 23, 2023\n\nArthur Hayes, CEO and co-founder of BitMEX, one of the leading cryptocurrency exchanges, is a respected thought leader in the crypto world. With a Twitter following of over 403K people, Hayes shares his unique insights into market trends, trading strategies, and the overall direction of the industry. His tweets are a must-read for anyone looking to stay on the cutting edge of crypto knowledge.\n\nAre you ready for April 2024 bitcoin halving?\n\nOr do you think this time is different? pic.twitter.com/IlrPVErmuw — PlanB (@100trillionUSD) September 19, 2023\n\nPlanB, a prominent crypto analyst and the creator of the widely-followed stock-to-flow price prediction model, has garnered a significant following of 1.8 million people on Twitter. His model, which has accurately predicted Bitcoin's price movements in the past, has made him a go-to source for many investors seeking a deeper understanding of the market's dynamics. Besides sharing updates on his model, PlanB also provides valuable insights on the broader crypto landscape.\n\nTop Crypto Blogs and Websites\n\nIndividuals aren’t the only valuable resources for information and updates on crypto and blockchain technology. Here, we’re sharing some of the most notable websites and blogs that deliver updated information on all things blockchain and crypto, from updates to current issues.\n\nConsidered one of the oldest and most established sources of news on Bitcoin and blockchain technology, Bitcoin Magazine has been providing a global audience with analysis, research, and valuable crypto- and Bitcoin-related resources. It has established itself as a hub where thought leaders gather to share timely and relevant material on the crypto industry.\n\nOne of the great things about the website, aside from offering the latest news and updates, is that it lets you purchase Bitcoins, thanks to its partnership with Simplex. It also provides you with an avenue to earn Bitcoins via Carrot. The magazine likewise shares the latest news on business, culture, and events within a crypto context.\n\nRanking as one of the leading websites on crypto and blockchain technology, with more than 5.1 million unique visitors, CoinDesk features a variety of resources for both novices and pros. Aside from news, it also offers podcasts and lessons that serve as great introductions to topics such as Bitcoin, blockchain, Ethereum, and crypto trading. It also covers technical analysis and news and updates on Bitcoin mining.\n\nCointelegraph is fast becoming one of the leading authorities on cryptocurrency, blockchain technology, decentralized applications, and more. It delivers news that covers a number of cryptocurrencies including Bitcoin, Ripple, Ethereum, Litecoin, and Altcoin. It also covers blockchain, business, and technology, as well as policies and regulations concerning cryptocurrencies. What’s great about Cointelegraph is it has a mobile app that can be downloaded on the App Store or via Google Play.\n\nA hub for everything and anything Bitcoin-related, Bitcoin News delivers the latest news and updates. Aside from the news that covers politics, crypto regulations, and the occasional DIY tips and reviews, you can also play Bitcoin games and purchase Bitcoins on the site. It also has a Bitcoin Forum that allows visitors to engage with the community.\n\nU.Today is a great source for news and updates involving blockchain and crypto. It also covers price analyses for cryptocurrencies such as Bitcoin, Ethereum, Ripple, Tron, and EOS, as well as guides on mining, wallets, trading bots, and more.\n\nOther notable mentions include:\n\nAside from blogs and websites, you can also look into investing sites, which also run their own blogs or share informational resources for crypto (guides, podcasts, and more) and market updates. You can look into the following sites for additional resources:\n\nThe future of digital assets is already here, and it has carved its presence in our daily lives. But whether or not it will come to replace traditional assets still remains to be seen.\n\nAs crypto continues to grow, so too will its use cases, investors, supporters, and yes, even detractors. And while it has become hugely popular, enticing many to join and invest in crypto, there’s a bigger barrier to entry that prevents many individuals to go right into it, and that’s lack of knowledge.\n\nThere’s a wealth of articles, guides, and reviews that cover almost every aspect imaginable when it comes to crypto and blockchain technology, giving them a more open, and thus, seemingly more accessible, air.\n\nHowever, this research highlighted that younger generations show significant interest in digital assets, but many face barriers to active participation in the cryptocurrency or NFT market due to insufficient knowledge and a lack of national and international market regulations that would improve investor trust and transaction security.\n\nAdditionally, a substantial portion of respondents cited security concerns, specifically data privacy, as a significant obstacle. Other barriers include government regulations, reservations about the technology itself, and strong habits involving the use of physical cash.\n\nOne of the best things you can do, whether you’re a long-time crypto advocate or a novice, is to arm yourself with updated knowledge on crypto and blockchain technology to stay ahead of the game.\n\nLike any other financial and investment endeavor, delving into crypto can either make you more money or cause you to lose money. It’s a gamble that may be worth taking, especially if you’re looking to grow your assets and you’re equipped with sufficient knowledge and insights from some of the industry’s thought leaders.\n\nHave you ever tried going into crypto? Which digital currency did you invest in and who among these thought leaders have made an impact on your decisions?\n\nFrequently Asked Questions Who is the best crypto analyst? The best crypto analysts are Anthony Pompliano and Vitalik Buterin. Anthony is one of the most popular and iconic crypto analysts. Vitalik Buterin is the Ethereum co-founder and one of the world’s youngest crypto billionaires. What is the best cryptocurrency to invest in 2024? Bitcoin (BTC), Ethereum (ETH), Tether (USDT), Binance Coin (BNB), U.S. Dollar Coin (USDC). What is the number 1 cryptocurrency? Bitcoin is the original cryptocurrency and it remains the number 1 option for investors in 2024. It is the number 1 cryptocurrency and remains stable. Bitcoin costs more than $28,455 per coin. What is the difference between crypto and bitcoin? The difference between crypto and bitcoin is that bitcoin is a type of digital currency, and crypto refers to all digital currency. Bitcoin is controlled by the decentralized authority, unlike government-issued currencies. Cryptocurrency refers to the technology that facilitates the conduct of different financial transactions. Will etherium overtake bitcoin? Etherium will likely overtake Bitcoin in the future, as Ethereum will better attract innovation and developer interest, according to the co-founders of blockchain software company Edge & Node. Any cryptocurrency investor will allocate funds to boat Etherium and Bitcoin."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LnNhbWFhLnR2LzIwODczMzE3OC1jcnlwdG8tcHJpY2VzLXRvZGF5LWJpdGNvaW4tZXRoZXJldW0tc29sYW5hLWJuYi1hbHRjb2luLXJhdGVz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 24 Oct 2023 07:00:00 GMT",
        "title": "Crypto prices today: Bitcoin, Ethereum, altcoin - 24 October, 2023 - latest rates - SAMAA",
        "content": "Photo: File\n\nThe total cryptocurrencies market capitalization currently sits at $1.27 trillion. Let's have a look at the latest movements in the prices of some of the most popular digital assets:\n\nBitcoin's rally\n\nIn a surprising turn of events, Bitcoin has surged by 11% on October 24, reaching a price of $33,623. This significant milestone marks the highest value for Bitcoin in 16 months, and it's fuelled by growing optimism surrounding the potential approval of Bitcoin exchange-traded funds (ETFs) in the United States.\n\niBTC listing sparks altcoin surge\n\nEric Balchunas, a prominent ETF analyst at Bloomberg, made a noteworthy announcement regarding the listing of BlackRock's iShares Bitcoin Trust under the ticker symbol iBTC on the Depository Trust and Clearing Corporation's website.\n\nThis has had a ripple effect, causing prices of various altcoins to skyrocket.\n\nEthereum follows suit\n\nEthereum, the second-largest cryptocurrency by market cap, also experienced a substantial price surge of 7.61% on the same day, reaching a value of $1,813.\n\nOver the course of 24 hours, ETH's value increased by $125.\n\nAltcoins on the rise\n\nBitcoin and Ethereum's positive momentum has sparked a wave of price surges among other cryptocurrencies.\n\nAltcoins such as Binance Coin, Ripple, Cardano, Dogecoin, Litecoin, and Polygon have all seen notable gains.\n\nAdditionally, Polkadot, Shiba Inu, Avalanche, Stellar, and Monero are among the cryptocurrencies trading in the green today.\n\nMarket cap reaches new heights\n\nThe overall cryptocurrency market capitalization has soared by 8.57% in the past 24 hours, reaching a total of $1.27 trillion.\n\nThis is a clear indication of the growing enthusiasm in the crypto space.\n\nNotable exceptions in the market\n\nDespite the overall positive trend, certain altcoins, including Tether, USD Coin, Solana, Leo, Cronos, and Binance USD, did not witness any gains on this particular day.\n\nThe road ahead: BTC ETF approval potential\n\nThe cryptocurrency landscape could see a substantial boost in adoption if the United States decides to approve Bitcoin ETFs.\n\nThis would provide a more accessible avenue for individuals to invest in Bitcoin without the need for direct purchases through exchanges.\n\nHowever, it's worth noting that the US authorities have yet to make a definitive decision regarding Bitcoin ETF approvals."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmNyeXB0b3BvbGl0YW4uY29tLzMtYWx0Y29pbnMtc2V0LXRvLXNreXJvY2tldC1pZi1ldGhlcmV1bS1iYXNlZC1ldGYtaXMtcmVsZWFzZWQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 24 Oct 2023 07:00:00 GMT",
        "title": "3 Altcoins Set to Skyrocket if Ethereum-Based ETF Is Released - Cryptopolitan",
        "content": "The altcoin market is abuzz with anticipation, with coins like Memeinator raising $4.4m in its presale, and other altcoins looking equally promising in terms of price action. This surge in interest mirrors the broader crypto market’s excitement, especially after the U.S. approved Bitcoin ETFs.\n\nNow, with Ethereum ETFs on the horizon, experts predict a significant market shift. This anticipation presents a compelling case for investors looking for the next big opportunity in cryptocurrency.\n\nHere are the top 3 altcoins set to skyrocket if an Ethereum-based ETF is released.\n\nMemeinator: Reshaping the very fabric of meme coin culture\n\nBorn from the narrative of a futuristic entity venturing from 2077 to “terminate” underperforming meme coins, Memeinator stands out with its unique mission.\n\nThe allure of Memeinator goes beyond its technology; it’s a cultural force. It taps into the nostalgia of the 90s, appealing to a generation that is now actively investing in altcoins. Memeinator’s loyal community has already grown to over 115K followers on X (Twitter) and over 13K on Telegram. Unlike the typical ‘cute and cuddly’ meme coins, Memeinator brings a gritty, edgy vibe that resonates with many young investors. This coin is not just a financial asset; it’s a statement.\n\nMemeinator’s well-thought-out tokenomics lend to its growing reputation as a standout investment opportunity. It includes quarterly token burns, which started in the presale when the development team followed the community’s advice to burn tokens to increase the value of the offer. Additionally, Memeinator offers staking, with an APY of up to 45%, and a generous referral program.\n\nAnother aspect of Memeinator’s platform that is sure to be a community favorite is its Meme Warfare game. This classic shoot-em-up-style game will allow users to kill off useless meme coins with a variety of different Terminator-inspired weapons. Adding an extra layer of dynamism, its AI-driven Memescanner will hunt the corners of the internet, looking for weak, pathetic meme coins to feed into the game, representing them as characters for players to destroy.\n\nThe Memeinator team has recently announced that they’ll be partnering with Red Apple Tech, an award-winning gaming studio that specializes in blockchain, metaverse, AR, and VR. With 40 million downloads to its name and the likes of Disney on its client list, Red Apple will certainly bring some powerful thinking to the Memeinator vision.\n\nEven though Memeinator isn’t a GameFi project, given its shared characteristics, it is primed to ride the wave of a burgeoning GameFi market, which is projected to skyrocket to $90 billion by 2031, according to Business Research Insights.\n\nIts combination of an engaging narrative, an interactive AI-backed game, and the overall growth of GameFi, presents a massive opportunity for growth. Analysts say that Memeinator could potentially surge 50x or even 100x. Its rapid presale stages and the dwindling number of available tokens are creating a sense of urgency among investors.\n\nMoreover, the meme coin market has exploded from a niche novelty to a sector worth $20 billion, according to CoinMarketCap. Take examples like Pepe and BONK; despite being low on utilities, they have seen tremendous market growth. BONK, gained over 4000% in the final months of 2023. And Pepe hit a $1.5 billion market cap earlier in the year, despite the bear market. This underscores the potential for significant returns in meme coins.\n\nOverall, Memeinator’s presale is a golden opportunity to invest in a promising meme coin before it hits the public exchanges. The fear of missing out is real, especially given the presale’s imminent conclusion in Q1.\n\nFor those who understand the power of pop culture in the crypto space, Memeinator represents not just an investment but a chance to be part of a movement that’s reshaping the very fabric of meme coin culture.\n\nChainlink: Poised for growth in an Ethereum ETF era\n\nChainlink (LINK), a fundamental component of the Ethereum ecosystem, stands out as a prime example of the transformative potential of the crypto market.\n\nIntricately woven into Ethereum’s fabric, Chainlink provides an essential service: oracles. These oracles are vital for importing real-world data into blockchain environments, a necessity for the functionality of many Ethereum-based projects.\n\nThe potential approval of an Ethereum ETF could significantly amplify Chainlink’s visibility and attract further investment into its infrastructure. This could potentially lead to a substantial increase in its market value, with some speculating gains of several times its current worth.\n\nPolygon (MATIC) advantage: Scaling new heights in an Ethereum ETF future\n\nAnother altcoin that stands at the brink of significant growth is Polygon (MATIC). Seamlessly connected to Ethereum as a Layer 2 scaling solution, Polygon is at the forefront of enhancing Ethereum’s capabilities, offering faster transactions and reduced costs.\n\nThe potential approval of an Ethereum ETF could herald a new era of increased investment and attention towards Ethereum, which, in turn, could escalate the demand for Polygon’s scaling solutions. As Ethereum grows, the need for efficient transaction processing becomes more critical, positioning Polygon as a key player in managing this surge.\n\nIndustry experts and enthusiasts alike speculate that in such a scenario, Polygon might experience a surge in its market value, some saying that it could reach as high as $10 in 2024.\n\nSummary\n\nThe potential approval of an Ethereum ETF stands to be a watershed moment for the crypto market, with promising tokens like Memeinator, Chainlink, and Polygon positioned for significant growth.\n\nWith its unique narrative of time-traveling to eliminate weak meme coins, Memeinator presents an exciting investment opportunity, blending nostalgia with innovative technology. Chainlink’s indispensable role in providing real-world data to Ethereum’s blockchain and Polygon’s critical function as a scaling solution highlights their potential for substantial growth in this new era.\n\nThe excitement around these tokens, particularly Memeinator, is palpable. Recently, Memeinator has gained some considerable PR, trending with #Memeinator on X (Twitter). This came after the project targeted Elon Musk with a billboard, close to the SpaceX offices.\n\nAs we approach the end of Q1, the urgency to participate in Memeinator’s presale grows. There are only 129,310,345 tokens left to purchase before Memeinator’s presale ends. With listings on major exchanges looming large, now could be the best time to buy into Memeinator."
    }
]