[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wNy8yOC93aHktZXRoZXJldW0tZGl0Y2hpbmctbWluaW5nLWlzbnQtYmV0dGVyLWZvci10aGUtZW52aXJvbm1lbnQv0gF4aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDIzLzA3LzI4L3doeS1ldGhlcmV1bS1kaXRjaGluZy1taW5pbmctaXNudC1iZXR0ZXItZm9yLXRoZS1lbnZpcm9ubWVudC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jul 2023 07:00:00 GMT",
        "title": "Why Ethereum Ditching Mining Isn't as Green as Advertised - CoinDesk",
        "content": "The second, also alluded to above, is MEV, which represents money captured from unsophisticated, everyday network users. When the network spends more on security, miners consolidate, MEV opportunities diminish and everyday users pay more in the form of inflation. By contrast, with lower spending under PoS, everyday users pay instead in the form of hidden transaction fees due to MEV. Over $1 billion worth of MEV is estimated to have been extracted on the Ethereum network alone over the past two to three years, to say nothing of the various side chains and layer 2s, and cross-domain MEV between and among them."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNy8yOS9ldGhlcmV1bS1jb3VsZC1leHBsb2RlLWJ5LXVwLXRvLTE1NTYtaW4tYW4tYWktcG93ZXJlZC1lY29ub215LXNheXMtYXJ0aHVyLWhheWVzLWhlcmVzLXRoZS10aW1lbGluZS_SAYgBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDcvMjkvZXRoZXJldW0tY291bGQtZXhwbG9kZS1ieS11cC10by0xNTU2LWluLWFuLWFpLXBvd2VyZWQtZWNvbm9teS1zYXlzLWFydGh1ci1oYXllcy1oZXJlcy10aGUtdGltZWxpbmUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Could Explode by Up to 1,556% in an AI-Powered Economy, Says Arthur Hayes – Here’s the Timeline - The Daily Hodl",
        "content": "BitMEX co-founder Arthur Hayes says the price of Ethereum (ETH) stands to benefit immensely from artificial intelligence (AI) technology.\n\nPainting a scenario where AI applications create decentralized autonomous organizations (DAOs) in order to execute smart contracts, Hayes says in a new blog post that Ethereum is the logical base of such a scenario since it is the most widely used decentralized virtual machine.\n\nAccording to Hayes, the tokens issued by the AI DAOs will trade on decentralized exchanges (DEXs), and mostly those built on top of Ethereum.\n\n“A DEX is naturally suited to support the trading of any type of equity, debt, utility, participation, etc. token issued by an AI-powered DAO…\n\nDAOs will fundraise and issue tokens on-chain. A plethora of new DAO tokens will trade on DEXs.\n\nAs DAOs capture more economic value than companies, DEXs will trade more than traditional CEXs.\n\nI believe the largest driver of on-chain activity will be an explosion of trading volume on DEXs hosted on Ethereum.”\n\nThe BitMEX founder says that if the above scenario plays out as he envisions, Ethereum could run up to 1,556%, from its current price of $1,875 to hit $31,063 if the DEX trading volumes were to reach 20% of traditional stock exchange volumes recorded in 2022.\n\nHayes says Ethereum could reach a five-figure price about half a decade from now.\n\n“Given the market is forward-looking, I want to guestimate the percentage that will be reached 5 years into the future. I am not concerned about getting this number exactly right. I want to be directionally correct and profit as the narrative shifts from “won’t happen” to “might happen”.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on Twitter, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DreamStudio"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tcHJpY2Utc2t5cm9ja2V0LWFpLWRhby1yZXZvbHV0aW9uL9IBVWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tcHJpY2Utc2t5cm9ja2V0LWFpLWRhby1yZXZvbHV0aW9uL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Price Will Skyrocket Due To AI-Driven DAO Revolution: Arthur Hayes - NewsBTC",
        "content": "In a thought-provoking blog post titled “Moai,” Arthur Hayes, co-founder of the renowned crypto exchange BitMEX, delves into the potential impact of Artificial Intelligence (AI) on the future of economic organization and the role of Ethereum. Hayes argues that the rise of AI-driven Decentralized Autonomous Organizations (DAOs) will revolutionize the global economy and propel Ethereum to new heights.\n\nThe Critical Role Of DAOs In The AI Era\n\nHayes contends that the current economic progress and per capita wealth of global civilization can be attributed to the efficient self-organization of human societies. He emphasizes that traditional company structures, empowered and regulated by the state, have been the primary vehicles for economic development. However, he highlights the limitations of these structures when it comes to AI-driven entities.\n\nHe states, “An AI has no reason to follow any laws. It cannot be coerced by the state, and therefore, exchanges that trade tokens issued by AI-powered DAOs will likely become natural monopolies.”\n\nHayes lays out a compelling argument for why DAOs, relying on smart contracts executed on public blockchains like Ethereum, are the ideal organizational structure for AI-driven entities. These smart contracts provide transparency, immutability, and cryptographic verification of transactions and agreements. Consequently, DAOs can operate efficiently and securely without the need for third-party intermediaries or costly auditing processes.\n\nHe envisions a future where AI-powered DAOs will raise capital and trade their tokens on decentralized exchanges (DEXs) on Ethereum rather than traditional centralized exchanges. This will create truly global capital markets accessible to anyone with an internet connection. Hayes predicts that DEXs will become natural monopolies due to the advantages they offer in terms of trust, security, and ease of use.\n\nThe BitMEX founder presents a hypothetical example of “PoetAI,” an AI-powered DAO that aims to fundraise and produce original poetry for profit. He envisions how PoetAI could issue its tokens, called “POET,” through a smart contract with specific attributes, such as revenue sharing and voting mechanisms. Investors can confidently invest in PoetAI DAO knowing that its financial statements are continuously available on the public blockchain, eliminating the need for traditional auditors.\n\nMoreover, Hayes explains that DAOs can raise capital by issuing debt, enabling economic time travel by borrowing from the future to stimulate present economic activity. The enforceability of contracts in DAOs can be facilitated through smart contracts on public blockchains, ensuring that investors are protected.\n\nHayes’ Bull Case For Ethereum\n\nHayes concludes, “Ethereum transactions will grow exponentially as DAOs proliferate. As a result, the price of ETH should skyrocket in anticipation if this AI DAO hypothesis is widely believed.”\n\nHe also suggests that identifying and investing in Ethereum based governance tokens of DEXs facilitating AI-driven DAO trading will lead to significant profits. Furthermore, Ethereum middleware layers that enable visualization of AI DAO accounts will become essential for the smooth functioning of these capital markets.\n\nWhile these ideas represent bold predictions about the future of AI and the role of Ethereum, Hayes presents a compelling case for the potential disruptive power of AI-driven DAOs. Hayes is one of the great thinkers of crypto space and his thesis a narrative to watch.\n\nAt press time, the Ether (ETH) price was at $1,863, just below the mid-range resistance.\n\nFeatured image from rc.xyz NFT gallery / Unsplash, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vY3J5cHRvLm5ld3MvbGVhcm4vZXRoZXJldW1zLWFjY291bnQtYWJzdHJhY3Rpb24tZXhwbGFpbmVkL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jul 2023 07:00:00 GMT",
        "title": "Ethereum’s account abstraction explained - crypto.news",
        "content": "Ethereum’s (ETH) account abstraction uses smart contract wallets to manage users’ account activity and blockchain transactions. It hides the complex processes of blockchain interaction and could finally make web3 apps easier for users.\n\nBlockchain technology has long promised a decentralized future, but its notoriously complex inner workings have severely hampered widespread mainstream adoption. Now, Ethereum developers are leveraging a feature called “account abstraction” to completely simplify and streamline blockchain interactions for everyday users. But how does this new abstraction model actually work under the hood?\n\nYou might also like: What Is Ether (ETH)?\n\nEOAs vs. smart contract wallets\n\nTo understand what account abstraction is, we first need to examine the two primary account types that exist on Ethereum today:\n\nExternally owned accounts (EOAs) consist of public-private key pairs that users must securely manage themselves. The public key is the account address you share, while the private key proves ownership and allows you to sign your transactions.\n\nTo perform any action on the blockchain, users need to install browser extensions like MetaMask, copy long cryptographic addresses, approve every transaction prompt, and manually sign each transaction with their private key. This cumbersome process can frustrate new users. And if you ever lose your private key, you lose access to your account and funds forever with no recovery options.\n\nYou might also like: Vitalik Buterin shares insights on Ethereum’s account abstraction journey\n\nSmart contracts are advanced programmable accounts where developers can program customized logic, rules, and capabilities right into the contract code itself. For example, a smart contract wallet could enable social recovery features, daily transaction limits, access controls, account freezing, batch sending, and many other capabilities not possible with a basic private key-based account. Smart contracts are accounts controlled by code rather than private keys.\n\nThe core innovation of Ethereum’s new account abstraction protocol is utilizing smart contract wallets to completely manage users’ account activity and blockchain transactions behind the scenes. This abstracts away many of the complexities of blockchain interaction from the user experience.\n\nHow does account abstraction work?\n\nThe technical design is outlined in an Ethereum Improvement Proposal called EIP-4337:\n\nWhen a user wants to perform any action through a web3 application, they simply submit something called a “User Operation” into a pool known as the alt mempool. This User Operation contains instructions like “send 0.05 ETH to Address1″ or “purchase NFT #2456” without requiring direct blockchain signatures.\n\nValidators on the network called “bundlers” periodically pick up User Operations from the mempool, bundle groups of them together into packaged transactions called “Bundle Transactions”, and submit these bundles to a central global smart contract called the EntryPoint.\n\nThe EntryPoint contract acts as a router, forwarding each User Operation to the relevant smart contract wallet it pertains to. It calls validateUserOp(), which verifies the user’s signature, pays gas fees, and approves/rejects the operation. Next, execute() runs to perform the operation on-chain.\n\nThis sequence allows users to simply submit User Operations, while their smart contract wallet handles validating, bundling, paying gas, and executing Ethereum transactions behind the scenes. All blockchain complexity is abstracted away from users.\n\nBenefits of Ethereum account abstraction\n\nThe implications are profound in terms of unlocking web3 for the mainstream. Regular users could participate in DeFi, NFTs, and blockchain applications without crypto wallets or understanding public-key cryptography, addresses, gas fees, and signatures.\n\nAccount abstraction also enables user-friendly features not possible otherwise, like social recovery, spending limits, batched transactions, and approvals. This brings smart contract wallets significantly closer to the usability standards people expect from traditional finance.\n\nWhile highly complex under the hood, account abstraction finally provides the simplified user experience necessary for decentralized apps to achieve mass adoption. By abstracting away blockchain complexity, Ethereum’s new protocol brings web3’s user-owned vision closer to reality.\n\nWhat are the disadvantages of account abstraction?\n\nStill, this approach has one major drawback. While the smart contracts involved in Ethereum’s account abstraction implementation have been reviewed extensively, they still introduce more complexity to a critical system compared to a simple private-public key pair-based account.\n\nComplexity results in more potential security vulnerabilities and a greater attack surface. For this reason, it is only recommended to use this kind of account when intending to actually use its exclusive feature and the most recommended wallet for most users is still a hardware wallet."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vdS50b2RheS9ob3ctbWFueS1ldGhlcmV1bS1ldGgtYWRkcmVzc2VzLXNob3ctcmVhbC1hY3Rpdml0eS15b3Utd291bGQtYmUtc3VycHJpc2Vk0gFdaHR0cHM6Ly91LnRvZGF5L2hvdy1tYW55LWV0aGVyZXVtLWV0aC1hZGRyZXNzZXMtc2hvdy1yZWFsLWFjdGl2aXR5LXlvdS13b3VsZC1iZS1zdXJwcmlzZWQ_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jul 2023 07:00:00 GMT",
        "title": "How Many Ethereum (ETH) Addresses Show Real Activity? You Would Be Surprised - U.Today",
        "content": "Advertisement\n\nUsing a customized Dune Analytics dashboard, Jack Gorman tracked the paradigm of new Ethereum (ETH) wallets that were activated in the last 12 months. Simply put, it looks like the \"we are still very early\" motto of crypto veterans is still valid in late Q3, 2023.\n\nIn past year, 27 million new wallets were activated on Ethereum (ETH)\n\nIn the last 12 months, over 26.69 million wallets were created. As such, every 30 days, over 2 million new Ethereum (ETH) addresses started showing activity on the network. Such calculations were made by Jack Gorman, a data scientist at Variant Fund, a VC team that was among early backers of Uniswap (UNI), Polygon (MATIC), Aptos (APT), Worldcoin (WDC) and Matter Labs.\n\nEthereum Address Stats in Past Year\n\n\n\n-Monthly active addresses ranges from ~4.5M - 7M on Ethereum.\n\n\n\n-In the past year, more than 26.69 million wallets were created, averaging around 2 million new wallets per month.\n\n\n\n-The retention rate of new wallets is relatively modest, with… pic.twitter.com/c8DmYhHQUX — J.Hackworth (@jphackworth42) July 28, 2023\n\nHowever, only 4.5-7 million of Ethereum (ETH) addresses authorize at least one transaction every month. Over 70% of wallets are dropped after 30 days of activity, analyst says.\n\nThree out of five Ethereum (ETH) addresses on the network only completed one transaction. On the other hand, 400,000 wallets show notable activity as they authorized over 100 transactions in the last 12 months.\n\nThis domination of wallets with low activity (66% of active transacting addresses were only active for one day, while 95.5% were active for less than 10 distinct days within the last year) should likely be attributed to euphoria around retroactive airdrops.\n\nAs covered by U.Today previously, top \"airdrop hunters\" managed to have their accounts qualified for 12 NFT and token airdrops.\n\nOnly 1.9 million wallets show sustainable activity\n\nHowever, in order to optimize their strategies, \"airdrop hunters\" create hundreds of Ethereum (ETH) accounts with minimum activity. Sophisticated software is leveraged by the \"abusers\" of retroactive airdrops.\n\nDuring the ARB airdrop, the most overhyped campaign of the last year, thousands of accounts were controlled by manipulators; over 2,400 wallets were hacked.\n\nWhen the dust settles, activity on Ethereum (ETH) remains low. The total number of wallets that were active for over 10 days in the last year is around 1.9 million, the report says."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vZGVjcnlwdC5jby8xNTA0OTUvc2hpYi1kZXZzLXNoaWJhcml1bS1ldGhlcmV1bS1icmlkZ2XSAUNodHRwczovL2RlY3J5cHQuY28vMTUwNDk1L3NoaWItZGV2cy1zaGliYXJpdW0tZXRoZXJldW0tYnJpZGdlP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jul 2023 07:00:00 GMT",
        "title": "SHIB Devs Begin Testing Shibarium to Ethereum Bridge - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nShibarium, an upcoming SHIB-based, layer-2 network that's being built on top of the Ethereum blockchain, now has a testnet bridge that allows tokens to be transferred between the two networks. But for now, at least, only dummy assets are being supported.\n\nPseudonymous \"marketing specialist\" Lucie, who represents the Shiba Inu ecosystem, tweeted today that the public testing phase will allow enthusiasts to \"be among the first to try out this revolutionary cross-chain solution.\"\n\n🔥 Shibarium Beta Bridge has gone live for public testing! 🎉 Be among the first to try out this revolutionary cross-chain solution. Remember, always exercise caution and verify authenticity before connecting your wallet to any website. PLEASE DO NOT USE YOUR REAL ASSETS!… pic.twitter.com/7yfhX8gQc6 — 𝐋𝐔𝐂𝐈𝐄 (@LucieSHIB) July 26, 2023\n\nAD\n\nAD\n\nShiba Inu (SHIB), the 15th-biggest crypto asset by market cap, is a meme coin based on the same internet meme as Dogecoin. And the launch of the Shibarium-to-Ethereum testnet bridge appears to giving doge-themed tokens a boost.\n\nSHIB, Dogecoin, and even ShibaSwap (BONE) have seen big gains.\n\nData from CoinGecko shows BONE has rallied by 9% over the past 24 hours. Meanwhile, SHIB, with a market cap of nearly $5 billion, has surged by nearly 6% over the same timeframe—making it the fifth-best performer among the 100 biggest cryptocurrencies by market capitalization.\n\nDespite the enthusiasm, bridges have become a common attack vector for cybercriminals. Perhaps the worst example relates to the $622 million hack of the Ronin Network in 2022, an Ethereum sidechain used by play-to-earn game Axie Infinity. North Korean hackers were linked to that exploit, along with several others.\n\nNonetheless, this could help the Shiba Inu ecosystem unlock far greater utility—and help the project move away from being castigated as a \"meme coin\" where price rises are driven by speculation and greed rather than anything tangible.\n\nAD\n\nAD\n\nBut even if Shibarium takes off, affiliated tokens are unlikely to match the heady days of the last bull market. Both BONE and SHIB remain 90% below all-time highs set in 2021, per CoinGecko.\n\nThere's been renewed interest in dog-themed tokens of late, with Dogecoin also performing fairly well at certain points this week.\n\nThat likely has something to do with the never-ending speculation that Elon Musk may make the altcoin an official payment method on X, formerly known as Twitter. The billionaire began pumping the coin on the social network back in 2020, and had an instrumental role in the 14,700% surge that Dogecoin enjoyed in the first four months of 2021.\n\nAfter unsuccessful campaigns to drive DOGE to one dollar and SHIB to one cent, potential use as widespread payment methods could herald the start of a new chapter—and mean there's life in the old dogs yet."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLXByaWNlLXJhbGx5LWF3YWl0cy10aGlzLWJ1bGxpc2gtcGF0dGVybi1jb25maXJtYXRpb24v0gFXaHR0cHM6Ly9jb2luZ2FwZS5jb20vZXRoZXJldW0tcHJpY2UtcmFsbHktYXdhaXRzLXRoaXMtYnVsbGlzaC1wYXR0ZXJuLWNvbmZpcm1hdGlvbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Price Rally Awaits This Bullish Pattern Confirmation - CoinGape",
        "content": "Ethereum price has steadied above $1,800 for nearly two months and traded at $1,864 on Friday. On the upside, price action has been capped under $2,000, amid a general slump in the trading volume.\n\nFollowing the Ripple ruling in early July, investors focused less on Bitcoin (BTC) and Ethereum, favoring other leading altcoins like XRP, Cardano (ADA), Polygon (MATIC), Solana (SOL), and most recently Dogecoin (DOGE).\n\nadvertisement\n\nThe biggest task among Ethereum is holding the price above $1,800 – a move likely to prevent possible declines to $1,700 and $1,600.\n\nIf a recovery ensues from the current market value, the token powering the largest smart contracts token might trigger a surge in investor interest, who are still waiting on the sideline for an uptrend confirmation above $2,000.\n\nHere’s What It Will Take Ethereum to Rally?\n\nEthereum price is in the middle of nurturing a potentially massive breakout that could propel it not only above $2,000 but allow bulls to close the gap to $2,400 for the first time since May 2022.\n\nThe daily chart shows the formation of an inverse head-and-shoulders (H&S) pattern, promising a 19% bullish move to $2,385.\n\nThe inverse H&S pattern shows a downtrend ending and an uptrend starting. It has three lows: the middle one is the lowest (head) and the outer ones are higher (shoulders).\n\nThis pattern is validated when the price breaks above a line joining the highs of the shoulders (neckline), located around $2,000 for Ethereum price.\n\nTraders are always advised to buy when this happens or wait for a pullback to the neckline to be certain that the breakout is sustainable and not a bull trap. Note that the price target is the distance from the head to the neckline (19%) added to the breakout point.\n\nOther indicators must be consulted when trading the H&S, especially the Money Flow Index (MFI), which monitors the inflow and outflow of funds in Ethereum markets. That said, the MFI as presented on the daily chart, has a bullish outlook, which implies that a breakout is in the offing.\n\nEvaluating the Bullish Case in Ethereum Price\n\nAdding credence to the bullish outlook on the daily chart is the Moving Average Convergence Divergence (MACD) indicator – likely to send a buy signal over the weekend.\n\nTraders seeking fresh exposure to ETH long positions should be on the lookout for bullish crosses in the momentum indicator, marked by the MACD line in blue crossing below the signal line in red.\n\nTo be on the safe side, Ethereum price must break and hold above the immediate hurdle, as highlighted by the 50-day Moving Average (EMA) at $1,870. Profit booking can start at $2,000 but extremely bullish traders may want to hold on for the H&S pattern breakout to $2,385.\n\nRelated Articles"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8venljcnlwdG8uY29tL3NoaWJhLWludS1ydW4tdG93YXJkcy0wLTAwMS1zaGliLXByaWNlLWluLXBsYXktYXMtZXRoZXJldW0tdG8tc2hpYmFyaXVtLWJyaWRnZS1nb2VzLWxpdmUtaW4tYmV0YS_SAXpodHRwczovL3p5Y3J5cHRvLmNvbS9zaGliYS1pbnUtcnVuLXRvd2FyZHMtMC0wMDEtc2hpYi1wcmljZS1pbi1wbGF5LWFzLWV0aGVyZXVtLXRvLXNoaWJhcml1bS1icmlkZ2UtZ29lcy1saXZlLWluLWJldGEvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jul 2023 07:00:00 GMT",
        "title": "Shiba Inu Run Towards $0.001 SHIB Price In Play As Ethereum-To-Shibarium Bridge Goes Live In Beta - ZyCrypto",
        "content": "Advertisement\n\nThe development team behind Shiba Inu has announced a major advancement in the SHIB ecosystem. A bridge between the soon-to-be-launched Shiba Inu-based layer-2 solution Shibarium and Ethereum is now live for public testing.\n\nThis addition to the Shibarium network was first announced in April and has since progressed from being partially functional to being available for public use.\n\nRevolutionary Shibarium Bridge Is Now Online For Testing\n\nAccording to SHIB marketing specialist Lucie, the bridge between Shibarium and Ethereum has been launched in beta for public testing.\n\nThe Shibarium bridge, which uses both Plasma and proof-of-stake technology, will initially support testnet ETH and is expected to take up to 30 minutes for each transfer. The bridge is also envisioned to serve as a solution for scaling, an indispensable aspect for any blockchain network striving to handle huge transaction volumes without compromising speed or efficiency.\n\n“Moving between two large-scale blockchain networks requires a secure and robust cross-chain bridge, and Shibarium has achieved this by utilizing both Plasma and PoS security to create a trustless and bi-directional transaction environment between Shibarium and Ethereum.”\n\nAdvertisement\n\nAs it is currently in Beta, Lucie has warned investors against using real tokens on the cross-chain bridge. Lucie also reminded users to always exercise caution and verify authenticity before connecting their crypto wallets to any website to avoid getting scammed and losing all their real digital assets.\n\nShiba Inu Price: Major Boom Ahead?\n\nLucie highlighted the advantages of Shibarium last month, including its effect on the project’s gas fee token Bone ShibaSwap (BONE), as well as the SHIB token. The slashed gas fees on Shibarium could propel the prices of these tokens as demand and potential value increase.\n\nUnlike another popular meme coin Dogecoin, which runs on its blockchain, Shiba Inu is an ERC-20 token built atop Ethereum. This implies the Dogecoin killer is also subject to the Ethereum network’s development decisions.\n\nWith a market cap of over $4.8 billion, Shiba Inu is currently the world’s 14th biggest cryptocurrency. The SHIB price is expected to blast off after Shibarium goes live on the mainnet as the layer-2 network will transform the meme coin into a comprehensive ecosystem. Shiba Inu bulls anticipate the day SHIB will see a meteoric rise to the elusive $0.001 mark and eventually topple Dogecoin."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3Lnplbmdlci5uZXdzLzIwMjMvMDcvMjkvYml0bWV4LWNvLWZvdW5kZXItYXJ0aHVyLWhheWVzLXByZWRpY3RzLWV0aGVyZXVtLWNvdWxkLXN1cmdlLTE1NTYtdG8tMzEwNjMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jul 2023 07:00:00 GMT",
        "title": "BitMEX Co-Founder Arthur Hayes Predicts Ethereum Could Surge 1,556% To $31,063 - Zenger.News",
        "content": "Arthur Hayes, co-founder and former CEO of crypto derivatives trading platform BitMEX, is forecasting a massive rally for Ethereum (CRYPTO: ETH), asserting that it could run up 1,556% from its current price of $1,875 and hit $31,063.\n\nIn a blog post on Thursday, Hayes wrote that the price of Ethereum stands to benefit immensely from artificial intelligence (AI) technology.\n\nHayes said he envisions AI applications establishing decentralized autonomous organizations (DAOs) to carry out smart contracts. He added that Ethereum is the most suitable foundation for this scenario, given its extensive adoption as a decentralized virtual machine.\n\nAccording to Hayes, tokens issued by the AI DAOs will trade on decentralized exchanges (DEXs) primarily built on top of Ethereum.\n\n“A DEX is naturally suited to support trading any type of equity, debt, utility, participation, etc. token issued by an AI-powered DAO. DAOs will fundraise and issue tokens on-chain. A plethora of new DAO tokens will trade on DEXs,” he wrote.\n\nArthur Hayes speaks on stage during Bitcoin Conference 2023 at Miami Beach Convention Center on May 19, 2023 in Miami Beach, Florida. Arthur Hayes, co-founder and former CEO of crypto derivatives trading platform BitMEX, is forecasting a massive rally for Ethereum (CRYPTO: ETH), asserting that it could run up 1,556% from its current price of $1,875 and hit $31,063. PHOTO BY JASON KOERNER/GETTY IMAGES\n\n“As DAOs capture more economic value than companies, DEXs will trade more than traditional CEXs. I believe the largest driver of on-chain activity will be an explosion of trading volume on DEXs hosted on Ethereum,” Hayes said, adding that Ethereum could reach a five-figure price about half a decade from now.\n\n“Given the market is forward-looking, I want to guestimate the percentage that will be reached 5 years into the future. I am not concerned about getting this number exactly right. I want to be directionally correct and profit as the narrative shifts from ‘won’t happen’ to ‘might happen,’” he explained.\n\nAt the time of writing, ETH was trading at $1,874.33, down by 1% in the last week.\n\nProduced in association with Benzinga"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vbW9uZXltYWRlLmlvL2xlYXJuL2FydGljbGUvZXRoLXN0YWtpbmctcmV3YXJkc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jul 2023 07:00:00 GMT",
        "title": "Best Ways to Earn ETH Staking Rewards - MoneyMade",
        "content": "You're about to embark on an exploratory journey where ETH staking rules the roost. Are you sitting on some ETH and wondering ‘How much ETH do I need to stake? Will it transform my ETH holdings into a passive income paradise?’ Fear not, you're in the right place.\n\nStaking Ethereum is like strapping your ETH to a rocket and watching it soar—minus the dangerous heights and flames. It's all about owning validator credentials and becoming a key player in the Ethereum ecosystem. Oh, and did we mention the prospect of earning rewards? Plenty of them—if you play your cards right.\n\nAs Ethereum moved from a Proof of Work to a Proof of Stake protocol, the staking world became the native token holders’ new playground. Every ETH holder can now secure the Ethereum network and validate transactions by staking their Ethereum.\n\nSo buckle up, future stakers, we're about to unveil the golden ways to earn ETH staking rewards. We're talking staking pools, validators, and even the fabled solo home staking. Let's also not forget the shiny new beacon chain, where Ethereum transactions—every time you send or swap tokens—earns native block rewards for validators.\n\nFrom the newbie staking Ethereum, desperately clinging onto their Ethereum wallet, to the ETH staking pros already swimming in their full participation rewards, there's a place in this exciting world of staking services for everyone. Get your regular ETH ready for staking ETH as we reveal the top six ways to scoop up those heavenly ETH staking rewards."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vY29pbmNvZGV4LmNvbS9hcnRpY2xlLzE0MTk4L2xheWVyLTEtcGVyZm9ybWFuY2UtY29tcGFyaW5nLTYtbGVhZGluZy1ibG9ja2NoYWlucy_SAVtodHRwOi8vYW1wLmNvaW5jb2RleC5jb20vYXJ0aWNsZS8xNDE5OC9sYXllci0xLXBlcmZvcm1hbmNlLWNvbXBhcmluZy02LWxlYWRpbmctYmxvY2tjaGFpbnMv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jul 2023 07:00:00 GMT",
        "title": "Layer-1 Performance: Comparing 6 Leading Blockchains - CoinCodex",
        "content": "Layer 1 blockchain performance comparison can help you decide which L1 network is best for your needs. Characteristics like transaction speed, finality, scalability, node count, storage costs, and energy efficiency underline the performance of a Layer 1 network and paint a picture of its blockchain performance.\n\nSatoshi Nakamoto’s development of Bitcoin and blockchain signaled the potential to revolutionize global finance. Then the introduction of Ethereum smart contracts enabled the growth of decentralized applications (dApps) beyond the control of centralized corporations. But Bitcoin and Ethereum are both limited in their performance, leading many to believe that blockchains are inherently slow, expensive, and difficult to scale.\n\nAn array of layer-1 protocols have emerged that aim to improve these shortcomings across different use cases. Though it can be difficult to compare blockchain protocols owing to differences in performance metrics and data, elements like transactions, scalability, nodes, and energy efficiency can help assess their relative merits.\n\nWith this in mind, let's compare six blockchains — Ethereum, Cardano, Solana, Avalanche, Algorand, and Internet Computer — based on these parameters.\n\nPlease keep in mind that some other data presented in the graphic changed since the image was first made. For example, Ethereum's energy efficiency has improved greatly since the PoS transition in 2022 and now stands at 0.03 kWh. Check the sections below for more information.\n\nLayer 1 blockchain comparison: An in-depth performance analysis\n\nIn the sections that follow, we are going to analyze the blockchain performance of the leading Layer 1 networks in the industry based on their transaction speed, time to finality, scalability, node count, storage costs, cloud service dependency, energy efficiency, and end-use key management.\n\nLayer 1 TPS comparison: Transaction speed\n\nOne of the key metrics determining the efficiency of a blockchain network depends on how fast it can process transactions. This involves two specific aspects: transactions per second (TPS) and block finality or transaction finality. TPS refers to how many transactions the blockchain can successfully process in a second; block finality represents the duration between a block's initiation and its final, irreversible settlement on the distributed ledger.\n\nCardano: 2 TPS / 10-60 minutes finality\n\nCardano can purportedly process 250 TPS, with a reported block finality time of 10 minutes to an hour, depending on network congestion. Its layer-2 scaling solution, Hydra, is said to theoretically enable up to one million TPS and instantaneous block finality. But third-party measurements have shown Cardano currently supporting only roughly 2 TPS.\n\nEthereum: 15-20 TPS / 14 minutes finality\n\nEthereum generally handles 15-20 TPS, with a block finality time of 14 minutes. This rate is much higher during periods of extreme network congestion, and finalizing transactions can take over 14 minutes. Users generally have to pay “gas” fees per transaction that vary depending on traffic and which peaked at a whopping $1,000 in 2021 due to network congestion. Ethereum is trying to correct this, with upcoming sharding and layer-2 scaling solutions expected to improve transaction speeds.\n\nAlgorand: 20 TPS / 4-5 seconds finality\n\nAlgorand theoretically reports processing 1,200 TPS and intends to increase it to 3,000 TPS with instant finality. According to its metrics page, it actually processes 20 TPS in practice. Algorand boasts of a block finality time of 4-5 seconds.\n\nSolana: 2,000-3,000 TPS / 21-46 seconds finality\n\nSolana theoretically boasts of processing 65,000 TPS, but in practice, it processes around 2,000-3,000 TPS. It suffered an outage when the transactions peaked at 400,000 TPS in September 2021, raising concerns about its instability. However, the network managed to improve upon its stability, experiencing just one outage in 2023 so far. Solana’s theoretical transaction finality time is 400-500 milliseconds, but it actually takes 21-46 seconds for “optimistic confirmation.”\n\nAvalanche: 4,500 TPS / 2-3 seconds finality\n\nAvalanche reported that its testnet could process 4,500 TPS, with the production-ready version eventually aiming for 20,000 TPS. But at the moment, it can process only around 9 TPS for the EVM-compatible C-Chain. Avalanche has a reported transaction finality time of less than one second but it may take about 2-3 seconds.\n\nInternet Computer: 11,500 TPS / 1 second finality\n\nInternet Computer is currently configured to process up to 51,666 TPS, but recent performance tests demonstrated 11,500 TPS with a finality rate of one second for dApps. This high rate results from the blockchain’s distinction of update calls (state-augmenting) from query calls (state-neutral). Internet Computer can process over 250,000 read-only query calls with execution in milliseconds.\n\nScalability\n\nBlockchains are scalable when they support high transaction throughput and can grow to accommodate new users. A scalable blockchain is one where network traffic doesn't significantly hamper overall performance.\n\nEthereum: Not Very Scalable\n\nEthereum has greatly improved upon its scalability following the Proof-of-Stake (PoS) transition in 2022. It plans to have 64 shard chains with a Beacon Chain for further scalability. However, that's still a far cry compared to other more scalable chains.\n\nCardano: Not Very Scalable\n\nCardano had been similarly limited in its ability to scale and increase capacity as Ethereum. However, with the introduction of the Layer-2 Hydra upgrade in 2022, the processing of the same code, both on-chain and off-chain, has increased drastically. It is worth noting that Hydra is not as widely used as some other Layer 2s in the market, so we'd say that Cardano is not very scalable as things currently stand.\n\nSolana: Not Very Scalable\n\nSolana suffered from a major “resource exhaustion” in 2021 and six outages in January 2022 alone, demonstrating its limited scalability. Solana’s Proof-of-History consensus protocol, combined with PoS, also generates an enormous amount of data (two terabytes) per year. Solana stores the data in Arweave, thereby outsourcing sensitive user data to secondary sources relying on centralized Web2 technologies. However, Solana has plans to greatly increased its TPS count in the future, with some predictions speculating a 600,000 TPS limit.\n\nAvalanche: Not Very Scalable\n\nAvalanche has three chains: Exchange Chain (X-Chain), Platform Chain (P-Chain), and Contract Chain (C-Chain), with each chain managing mini-networks. Like Solana, Avalanche also uses Arweave and Ceramic to store data off-chain via centralized Web2 technologies, as it doesn’t have its own storage facilities.\n\nAlgorand: More scalability\n\nAlgorand uses a variation of Proof-of-Stake consensus called Pure Proof-of-Stake, through which the protocol selects block proposers and verifiers. Leveraging a cryptographic process called Verifiable Random Function (VRF), Algorand uses a self-selection algorithm to choose block creators. Different from standard Proof-of-Stake protocols, this method fast-tracks the computation process and helps Algorand to scale.\n\nInternet Computer: Indefinite scalability\n\nInternet Computer’s infrastructure has independent node machines at the base layer that combine to form standalone subnet blockchains. The subnets host “canister” smart contracts that combine code and data, and divide execution into update and query calls. Each subnet can process update/query calls without relying on other subnets, allowing the network to scale as needed by adding nodes and forming new subnets.\n\nNode Count and Cloud Service Dependency\n\nThe number of blockchain nodes and their distribution is a robust indicator of a network's relative decentralization. Because the cost of storing smart contract data on-chain can be exorbitantly high, most dApps typically rely on centralized servers and cloud providers such as AWS, Google Cloud, Microsoft Azure, and Alibaba Cloud to store data and host their client-server interfaces.\n\nInternet Computer: 1,300 nodes / $5 per GB\n\nInternet Computer has onboarded 443 nodes running in independent data centers worldwide. None are centralized cloud providers. Node operators have hardware requirements that ensure that the blockchain can respond to HTTP requests and deliver web content without intermediaries. The cost of storing on-chain smart contract data is $5 for 1 GB of data per year.\n\nAvalanche: 1,243 nodes / $988,000 per GB\n\nAvalanche has documentation for setting up a node with AWS, suggesting that a significant percentage of its 1,243 nodes might be hosted on AWS. It costs $988,000 to store 1 GB of data on-chain.\n\nSolana: 2,919 nodes / $1,000,000 per GB\n\nMost Solana nodes are hosted on centralized servers like AWS. Its outages have raised concerns that if 33% of nodes were to go offline, Solana would stop validating new transactions. It costs roughly $1 million to store on-chain data on Solana.\n\nAlgorand: 1,720 nodes / IPFS off-chain storage\n\nAlgorand reports having roughly 1,720 nodes, but they are hosted on centralized servers. Although an exact number is not available, Algorand relies on AWS to scale its network. Instead of on-chain storage, Algorand uses the InterPlanetary File System (IPFS) to store data.\n\nCardano: 6,000 nodes / inadequate data storage\n\nThe Cardano Foundation, along with IOHK and Emurgo, initially established the nodes to run the network. They handed over the block production process to the network’s stake pool operators, which now number 6,000. It is unclear how many are cloud. Cardano is an append-only ledger that records asset ownership and transfers, and is impractical for permanently storing files.\n\nEthereum: 11,800 nodes / $73,000,000 per GB\n\nEthereum has around 11,800 nodes around the world, with a majority of them running on centralized servers. In 2020, Decrypt reported that 70% of Ethereum nodes ran on AWS. The cost of storing 1 GB of data on Ethereum mainnet fluctuates, but currently costs more than $100 million.\n\nEnergy efficiency\n\nBlockchain technology must reduce its carbon footprint to become sustainable. Energy-intensive Proof-of-Work consensus adversely impacts the climate as miners need enormous energy to power their equipment.\n\nWhen still on the PoW system, estimates showed that each Ethereum-based transaction consumed 238 kWh (kilowatt-hours) of energy. (For reference, 100,000 VISA transactions consume 149 kWh of energy.) Ethereum miners consumed around 45 TWh (terawatt-hours) of energy per year. Ethereum’s transition to Proof-of-Stake has decreased its energy consumption substantially, by some estimates by more than 99.9%.\n\nInternet Computer consumes 1.3 kWh of energy per transaction running on-chain, rather than outsourcing to centralized cloud providers.\n\nExisting Proof-of-Stake blockchains consume small amounts of energy for individual transactions. Cardano consumes just 0.5 kWh for a single transaction, while a transaction on Solana consumes 0.00051 kWh of energy. A Crypto Carbon Ratings Institute report shows that Avalanche consumes 0.00476 kWh per transaction, and Algorand consumes 0.0027 kWh per transaction. Each of these blockchains outsources storage and hosting to centralized servers, however, signaling a hidden carbon footprint.\n\nInter-chain bridges\n\nBlockchain bridges support the transfer of data packets and digital assets between two separate chains. Cardano relies on the Force Bridge to transact with the Nervos blockchain and partnered with Bondly to connect Ethereum and Cardano NFTs. Avalanche uses the Avalanche Bridge to execute asset transfers with Ethereum.\n\nAlgorand will eventually use the London Bridge to connect with Ethereum. Similarly, Swingby is developing Skybridge to connect Bitcoin with Algorand, and Solana uses Wormhole to connect with Ethereum. Hackers recently stole $320 million worth of crypto from Wormhole, and various exploits have shown how bridges are susceptible to hacks from malicious actors. Hackers have stolen more than $1 billion in cryptocurrency over the past year across seven incidents, according to research by Chainalysis.\n\nInternet Computer has the Terabethia bridge to connect with Ethereum. It also supports bridge-less inter-chain integrations, relying solely on the trustless properties of the blockchains. It is integrating with the Bitcoin network, with an API available for developers to build Bitcoin smart contracts. Integrations with Ethereum and Dogecoin will follow.\n\nEnd-user key management\n\nBlockchain adoption is still quite slow because users are wary of security key management that requires safe storage options. Web2 applications like Facebook and Google rely on easy single-sign-on (SSO) solutions. Whereas for most Web3 dApps, users have to use complex private keys and set up a crypto wallet to access the platforms.\n\nOn Internet Computer, users can set up an Internet Identity locally, using their mobile devices’ fingerprint sensor, facial recognition, security pin, lock pattern, and so on. The Internet Identity helps users authenticate themselves anonymously, without worrying about private keys. It also works on a “reverse-gas” model where developers charge smart contracts with cycles, so users don’t need to hold tokens to pay for gas.\n\nEthereum relies on centralized corporations like AWS to store keys and manage accounts, while Solana relies on solutions like Torus that leverage Facebook or Google accounts to provide access to the platform. Unfortunately, this compromises the decentralized ethos of blockchain technology.\n\nAvalanche users need to manage their own keys, similar to Cardano users and Algorand users, which can involve complicated keys and token wallets.\n\nThe bottom line: Blockchain performance largely determines how useful a crypto network really is\n\nUltimately, the best-performing blockchain is the one that offers the most value for developers and users across a variety of use cases — namely, things like DeFi, NFTs, games, and various dApps. To that end, it’s a matter of understanding what a given layer-1 protocol offers in terms of developer and user experience and the promise of its ecosystem and relative capabilities.\n\nIt will be interesting to look beyond the performance metrics to see what the near future holds in store for each of the blockchain networks discussed above.\n\nIn the meantime, you can check our selection of the cheapest cryptocurrency networks for transfers, which allow you to save on transaction costs and engage with DeFi and NFT products and services at an accessible cost."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA3LzI4L3NoaWJhcml1bS1ibG9ja2NoYWlucy1ldGhlcmV1bS1icmlkZ2UtZ29lcy1saXZlLWZvci10ZXN0aW5nLWFzLXNoaWItdHJpZXMtdG8tc2hlZC1tZW1lLWNvaW4tdGFnL9IBjQFodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA3LzI4L3NoaWJhcml1bS1ibG9ja2NoYWlucy1ldGhlcmV1bS1icmlkZ2UtZ29lcy1saXZlLWZvci10ZXN0aW5nLWFzLXNoaWItdHJpZXMtdG8tc2hlZC1tZW1lLWNvaW4tdGFnL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jul 2023 07:00:00 GMT",
        "title": "Shibarium Blockchain's Ethereum Bridge Goes Live for Testing as SHIB Tries to Shed Meme Coin Tag - CoinDesk",
        "content": "Developers have previously said Shibarium would have a focus on metaverse and gaming applications especially as the non-fungible token (NFT) sector is expected to heat up in the coming years."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZGVjcnlwdC5jby8xNTA1MjEvdGhpcy13ZWVrLWluLWNvaW5zLXdlYWstd2Vlay1iaXRjb2luLWV0aGVyZXVtLXdvcmxkY29pbi14cnDSAVtodHRwczovL2RlY3J5cHQuY28vMTUwNTIxL3RoaXMtd2Vlay1pbi1jb2lucy13ZWFrLXdlZWstYml0Y29pbi1ldGhlcmV1bS13b3JsZGNvaW4teHJwP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jul 2023 07:00:00 GMT",
        "title": "This Week in Coins: Weak Week for Bitcoin and Ethereum—and Worldcoin - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt.\n\nThe beginning of the week saw the underwhelming launch of Worldcoin Protocol, along with its native cryptocurrency, WLD.\n\nWorldcoin is co-founded by Open AI CEO Sam Altman and the premise is at once utopian and dystopian: anyone wanting some WLD has to visit an ”Orb”—these can currently be found in Berlin, Dubai, London, Mexico City, Miami, New York City, San Francisco, Seoul, and Tokyo— and get a snapshot of their eyeballs taken.\n\nAD\n\nAD\n\nThis biometric data is used alongside verification of their government-issued ID to confirm someone’s personhood before distributing a set number of coins to them.\n\nWorldcoin believes it’s building the infrastructure to bank the world’s unbanked, enabling everyone “to broadly share the coming technological prosperity ” says its website. but many are skeptical, including Ethereum creator Vitalik Buterin who listed “major issues” of privacy, accessibility, centralization and security and said it could take years for the protocol to work.\n\nBritish privacy watchdog the Information Commissioner's Office (ICO) agrees, at least on privacy and security concerns and told Decrypt that it \"[the organization notes] the launch of Worldcoin in the U.K. and will be making enquiries.\"\n\nWLD currently trades for $2.30, about 30% down from its high on launch day of $3.30, according to crypto data aggregator CoinGecko.\n\nThe market leaders\n\nIt was the fifth consecutive week of underwhelming price performance for market leaders Bitcoin and Ethereum.\n\nBitcoin (BTC) lost 1.7% and now starts the weekend at $29,291, while Ethereum (ETH) lost 0.9% and changes hands at $1,872.\n\nAD\n\nAD\n\nThe market leaders had a pretty static week overall and their prices haven’t moved much since Monday. This week’s news that the Fed was hiking interest rates yet again did not immediately move the leading coins.\n\nLast year, the U.S. central bank hiked interest rates by 75 basis points four times and finished the year with a 50 basis point hike. This year there have so far been two hikes—including Wednesday’s—of only 25 basis points each, but interest rates are now the highest they’ve been for 22 years.\n\nXRP’s recent growth spurt, which was prompted by a small but significant courtroom victory against the SEC a fortnight ago, appears to have settled. Ripple’s cryptocurrency—which is definitely not a security—is down 7.7% for the week and currently trades at $0.70786.\n\nThe only other notable price movement this week came from Toncoin (TON), which fell almost 15% this week to trade at $1.24 at the time of writing.\n\nCrypto politics in Russia, Korea and the U.S.\n\nOn Monday, Russian President Vladimir Putin signed into law a bill granting legal tender to a digital ruble, the issuance of which will be overseen by the country’s central bank—although officials say it could take years before the central bank digital currency (CBDC) is widely adopted.\n\nOn Wednesday, South Korea rolled out a new interagency investigation unit to tackle crypto crime and take a leading role in investor protection before regulations are implemented.\n\nOperating from the Seoul Southern District Prosecutors’ Office, The Joint Investigation Centre for Crypto Crimes will consist of 30 investigators drawn from several government agencies and bodies, including the prosecutor's office, the Financial Supervisory Service, the National Tax Service, and the Korea Customs Service.\n\nThat day, over in the states, Democrats and Republicans locked horns over the Financial Innovation and Technology (FIT) for the 21st Century Act. Rep. Maxine Waters (D-CA), the ranking Democrat on the House Financial Services committee, assailed the bill as a “wish list” for the crypto industry, and said it undermined the role of the SEC and existing legislation.\n\nAD\n\nAD\n\nDemocrats also accused the bill of having weak consumer protections, though this point was parried by Republicans like Committee chairman Patrick McHenry (R-NC), who argued that, while not perfect, the bill is “better at worst case” than the current regulatory regime.\n\nThe Committee members also debated a stablecoin bill called the “Clarity for Payment Stablecoins Act of 2023.” Democrats accuse Republicans of rushing to pass the bill, and Waters said the proposed legislation lacks clarity over the reserves underpinning stablecoins that are pegged to the U.S. dollar."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vdS50b2RheS9zb2xhbmEtc29sLWZvdW5kZXItc2xhbXMtZXRoZXJldW0tY29tbXVuaXR5LWhlcmVzLXJlYXNvbtIBTGh0dHBzOi8vdS50b2RheS9zb2xhbmEtc29sLWZvdW5kZXItc2xhbXMtZXRoZXJldW0tY29tbXVuaXR5LWhlcmVzLXJlYXNvbj9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jul 2023 07:00:00 GMT",
        "title": "Solana (SOL) Founder Slams Ethereum Community, Here's Reason - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe rivalry between the Solana (SOL) ecosystem and the Ethereum community is taking an ugly turn and has degenerated to the founder of the former protocol, Anatoly Yakovenko, calling the former out on Twitter for spreading falsehoods about one of the most important aspects of its operational performance.\n\nAdvertisement\n\nAccording to the alarm raised by Toly, as he is known on Twitter, the Ethereum community claimed that Solana has run out of Transactions Per Second (TPS), a claim which, if left unaddressed, can spark fear, uncertainty and doubt (FUD) that can impact the protocol in a significant way.\n\nThe Solana founder said in the tweet, \"It's disappointing that members in and out of the Ethereum community spread many false rumors about Solana Labs. One of them is that Solana Labs has run out of tps. This is comical but one that has required me to address it for some team members who now know that we have hundreds of millions of tps and plenty more of compute units.\"\n\nWhile Solana was launched with one unofficial mantra to help displace the Ethereum blockchain, Toly said he loves competition and will love to play but with strict adherence to the facts binding players in the industry.\n\nRivalry in place of collaboration\n\nIt is not uncommon for the members of a competing protocol to banter with one another in the quest for supremacy. This rivalry characterized the relationship between members of the XRP community and the founder of the Cardano protocol, Charles Hoskinson.\n\nThe state of affairs between Cardano and XRP is milder now as Hoskinson extended the olive branch to the rival community as reported by U.Today a few weeks back.\n\nIndustry stakeholders have often advocated that communities and developers are meant to work together against a common challenge, which is the unclear regulation in the American crypto ecosystem, a push that will be more beneficial in place of rivalry."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMikAFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3NoaWJhLWludS1wcmljZS1hbG9uZy13aXRoLWJvbmUtcmFsbHktYXMtc2hpYmFyaXVtLWV0aGVyZXVtLWJyaWRnZS10ZXN0bmV0LWtpY2tzLW9mZi0yMDIzMDcyOTAxMTfSAZQBaHR0cHM6Ly93d3cuZnhzdHJlZXQuY29tL2FtcC9jcnlwdG9jdXJyZW5jaWVzL25ld3Mvc2hpYmEtaW51LXByaWNlLWFsb25nLXdpdGgtYm9uZS1yYWxseS1hcy1zaGliYXJpdW0tZXRoZXJldW0tYnJpZGdlLXRlc3RuZXQta2lja3Mtb2ZmLTIwMjMwNzI5MDExNw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jul 2023 07:00:00 GMT",
        "title": "Shiba Inu price along with BONE rally as Shibarium-Ethereum bridge testnet kicks off - FXStreet",
        "content": "Share:\n\nShiba Inu price as well as Bone ShibaSwap price shot up by 5% and 8%, respectively, in the last 24 hours.\n\nThe Testnet bridge will allow the transfer of tokens between Ethereum and SHIB-based layer-2 chain Shibarium.\n\nThis bullish move may revive the receding interest from new investors, which has resulted in the network growth declining by 44%.\n\nShiba Inu price made some gains as the week came to an end on the back of its ecosystem development. The SHIB world seems to be changing become more serious with the development of Shibarium, an Ethereum based layer-2 solution. This brought gains to key tokens associated with the project, including BONE.\n\nShiba Inu price rise could attract investors again\n\nShiba Inu price noted a 4.7% increase over the past day but more than the meme coin rose another cryptocurrency within its ecosystem. Bone ShibaSwap, which is more famously known by its ticker BONE, shot up by more than 8% to trade at $1.42.\n\nBONE/USDT 1-day chart\n\nThe rally, interestingly, was limited only to these two cryptocurrencies and was not reflected in the rest of the meme coins. The reason behind this was the recent launch of the Shibarium-Ethereum bridge testnet, which led to a surge in the use of SHIB and BONE. Since the bridge is still in the testnet phase, no significant implications on price were observed.\n\nHowever, the investors’ bullishness was enough to still trigger a rise in the cryptocurrencies despite the transactions being conducted on the bridge holding no real-world value. It does suggest a potential increase in the use case of BONE and SHIB going forward when the bridge mainnet launches. The transfer of assets would consequently boost the Shiba Inu price as well.\n\nBut more than the price, the network needs a recovery of investors, which have been disappearing after the disappointing run of Shiba Inu price posted these last couple of weeks. While the Relative Strength Index (RSI) on BONE suggests that the coin is on the verge of being overbought, SHIB barely managed to close above the December 2022 lows of $0.00000791, trading at $0.00000826.\n\nSHIB/USD 1-day chart\n\nA quicker recovery is necessary to revive the arrival of new users, which has been declining rapidly this past week. The network strength, which measures the rate at which new addresses are formed, dipped by more than 44% in just five days, suggesting investors are pulling back.\n\nShiba Inu network strength\n\nThus their return would help not only boost the uptrend in Shiba Inu price but also prevent any significant drawdown."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9hbm90aGVyLXdlZWstb2YtZGVmaS1oYWNrcy1idXQtemstcHJvb2YtZGV2ZWxvcG1lbnQtaGVhdHMtdXAtZmluYW5jZS1yZWRlZmluZWTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jul 2023 07:00:00 GMT",
        "title": "Another week of DeFi hacks, but ZK-proof development heats up: Finance Redefined - Cointelegraph",
        "content": "Welcome to Finance Redefined, your weekly dose of essential decentralized finance (DeFi) insights — a newsletter crafted to bring you the most significant developments from the past week.\n\nThe past week in DeFi was dominated by exploits and hacks, with three DeFi platforms losing nearly $39 million. Alphapo’s hot wallets were exploited for over $32 million, Era Lend was drained for $3.4 million, and the decentralized finance protocol Conic Finance was exploited for almost $3.5 million.\n\nIn better news, the DeFi ecosystem was buzzing with developments in zero-knowledge-proof (ZK-proof) scaling solutions as the layer-2 sector heats up despite the bear market.\n\nThe exploits and bearish market condition took their toll on DeFi protocols, with the total value locked in DeFi protocols seeing a significant drop over the past week.\n\nAlphapo hot wallets hacked for over $31 million\n\nCrypto payment platform Alphapo had roughly $31 million drained from its Ether (ETH), TRON (TRX) and Bitcoin (BTC) hot wallets, security experts reported on July 22. Since the amount of Bitcoin stolen is uncertain, the figures may be even higher.\n\nAccording to on-chain sleuth ZachXBT, the funds have been stolen on the Ethereum network, then swapped for ETH before being bridged to the Avalanche and Bitcoin blockchains. DeDotFi’s security team said a leak of private keys may have caused the hack. Investigations are still in progress.\n\nContinue reading\n\nEra Lend on zkSync exploited for $3.4 million in reentrancy attack\n\nThe lending zkSync lending app, Era Lend, has been exploited for $3.4 million in crypto, according to a July 25 report from blockchain security firm CertiK. The attacker used a “read-only reentrancy attack” to drain the funds, which is an attack that interrupts a multistep process and then causes it to continue after a malicious action has been performed. Specifically, a “read-only” reentrancy does not update the state of a contract.\n\nAccording to the report, the attacker drained funds in two transactions using the externally owned account 0xf1D076c9Be4533086f967e14EE6aFf204D5ECE7a. The attacker relied on a vulnerability in “the callback and _updateReserves function” to manipulate a contract into reporting old values that had not yet been updated.\n\nContinue reading\n\nZero-knowledge tech development heats up amid bear market\n\nZK-proofs are cryptographic methods allowing one party to prove to another party that something is true without revealing any sensitive underlying private information. The technology has been a hot topic of discussion among crypto veterans in recent times. On July 19, at the zkDay event — part of the Ethereum Community Conference in Paris — over 2,000 attendees arrived at a small venue by Rue l’Aubrac to catch a glimpse of the latest ZK projects on display. P0x Labs, the developer behind ZK protocol Manta Network, even announced a $25 million raise during the event.\n\nCurrently, the technology is playing a critical role in powering layer-2 scaling solutions. By computing a simple cryptographic proof on layer 2, transactions can be finalized nearly instantly, and the record is sent back to the underlying blockchain as a succinct proof. At the same time, ZK-proofs can enable private transactions that do not relay sensitive information to observers.\n\nContinue reading\n\nOptimism transaction volumes surpass Abitrum’s for the first time in six months\n\nThe Optimism network has surpassed Arbitrum in transaction volume for the first time in six months, according to July 27 data from blockchain analytics platform Artemis. Both networks are Ethereum layer 2s that use optimistic rollup technology, which compresses and batches transactions before submitting them to Ethereum, potentially lowering transaction fees.\n\nVolume on Optimism fell behind Arbitrum in January, as season one of its “quest” feature ended. However, it recovered the top spot on July 25 as Worldcoin launched.\n\nContinue reading\n\nDeFi market overview\n\nDeFi’s total market value saw a bullish surge after three bearish weeks. Data from Cointelegraph Markets Pro and TradingView shows that DeFi’s top 100 tokens by market capitalization had a bullish week, with most tokens trading in the green. The total value locked in DeFi protocols remained below $50 billion.\n\nThanks for reading our summary of this week’s most impactful DeFi developments. Join us next Friday for more stories, insights and education regarding this dynamically advancing space."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMilQFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC91bmxvY2stMzAwLWRheS1wYXNzaXZlLWluY29tZS1vcHBvcnR1bml0eS13aXRoLXN0YWtpbmctcmV3YXJkcy1hbHRjb2lucy1jaGFpbmxpbmstbGluay1kaWdpdG9hZHMtdG9hZHMtZXRoZXJldW0tZXRoL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jul 2023 07:00:00 GMT",
        "title": "Unlock $300/Day Passive Income Opportunity with staking rewards altcoins: Chainlink (LINK), DigiToads (TOADS ... - Analytics Insight",
        "content": "DeFi has been overwhelmingly successful due to the removal of intermediaries. This allows for more value to be retained between the transacting parties. For example, instead of a centralized institution providing liquidity to markets, ordinary investors become market makers by creating LP (Liquidity Provider) tokens.\n\n\n\nIn financial terms, the decentralization in the crypto market has opened up multiple opportunities to investors in the form of residual income. And anybody can unlock $300 a day passive income opportunities with staking rewards from altcoins. This article dives into the top three picks to begin earning passively today: Chainlink (LINK), DigiToads (TOADS) , and Ethereum (ETH).\n\n\n\nDigiToads (TOADS) Introduces NFT Staking\n\n\n\nDigiToads is one of the best altcoins when it comes to the provision of passive income. And this is all thanks to the self-propagating ecosystem (The Swamp) that does the heavy lifting on the investor’s behalf.\n\n\n\nThe Swamp opens up a new staking opportunity with its NFT Staking program that turns all 3,500 DigiToads NFTs into revenue-creating assets. These stakers earn consistent payouts funded by the protocol’s taxation system. This link between taxes and payouts causes the funds received by stakers to increase in tandem with ecosystem activity.\n\n\n\nAnalysts have forecast the floor price of these NFTs rocketing on the secondary market when payouts materialize on August 21st. This means as well as receiving dividend payments in line with ecosystem activity, stakers will also hold an appreciating asset.\n\n\n\nThe taxation system, Toad Tax, which funds the staking payout pool, directs 2% of every transaction to these holders. Additionally, it burns 2% meaning that users receive rewards in $TOADS, a hyper deflationary token.\n\n\n\nThe protocol’s treasury fund will also periodically top up the NFT Staking payout pool, and the active treasury management strategy employed by DigiToads, known as the Platinum Toads initiative, grants the best on-chain raiders remote control of the treasury.\n\n\n\nIn practical terms, it means stakers will earn rewards from taxes and rewards from trading activity in DeFi, hence analysts’ classification of DigiToads as a pioneering project and one of the best passive income plays of 2023.\n\nChainlink (LINK) Staking & CCIP\n\nChainlink (LINK) has seen a rush of economic activity due to the release of its CCIP (Cross-Chain Interoperability Protocol), which seeks to make an internet of smart contracts. This new tech stack will allow cryptos to travel freely across chains, enable developers to create cross-chain applications, and connect private and public blockchains. The final application of CCIP could see direct on-ramps between TradFi banks and DeFi.\n\n\n\n$LINK staking has caught the eye of many investors. Users can lock up their $LINK and earn staking rewards by providing economic security guarantees for Chainlink’s (LINK) oracle services. The staking program sees 7% APR rewards for node operators and nearly 5% for ordinary stakers. Analysts’ price predictions estimate $LINK trading between $13.62 and $15.62 in 2024, meaning stakers can currently stack up undervalued Chainlink (LINK) through the staking program.\n\nEthereum (ETH) Eclipses 20% Staked\n\n\n\nEthereum (ETH) has always been one of the best altcoins to buy, and recently the total volume of $ETH staked crossed 20%. Ethereum (ETH) staking has become the de facto risk-free rate within DeFi, with investors earning nearly 4% APR on a blue chip asset.\n\n\n\nThousands of new DeFi projects have launched, integrating liquid staking derivatives, sparking what analysts have called LSDFi Summer. The enabling of Ethereum (ETH) withdrawals acted as an enormous derisking event, and institutional inflows into the $ETH staking have been steadily increasing since.\n\n\n\nPrice forecasts predict a range between $3,051.80 and $3,754.46 for Ethereum (ETH) in 2024, meaning all investors accruing stakers rewards have a great upside on their dividends.\n\nClosing Thoughts: Staking and the Power of Passive Income\n\n\n\nThe top altcoins to hold in the run-up to the bull market and throughout the bear market have always been altcoins with staking rewards. Investors steadily build their stack and enjoy all the upside when the market starts rallying.\n\n\n\nComparing $TOADS, $ETH, and $LINK, although all three provide excellent passive income opportunities, the winner has to be TOADS because of the link between economic activity and staking rewards. Join the DigiToads presale, mint an NFT, and start earning deflationary rewards today!\n\n\n\nVisit DigiToads Presale\n\nMint DigiToads NFTs Here\n\nBuy DigiToads NFTs on OpenSea\n\nJoin the community\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDcvMjgvZ29sZC1iYWNrZWQtY3J5cHRvY3VycmVuY2llcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jul 2023 07:00:00 GMT",
        "title": "5 Most Popular Gold Backed Cryptocurrencies - Crypto Times",
        "content": "The world of cryptocurrencies has emerged as a compelling alternative to traditional finance, democratizing investments and shifting power from institutions to individuals. As digital assets like Bitcoin, Ethereum, and thousands of others continue to shape and disrupt economies, a new class of cryptocurrencies has risen to offer a unique proposition.\n\nGold backed cryptocurrencies – a fascinating blend of old and new, merging the reliability of the world’s oldest store of value with cutting-edge blockchain technology. This fusion creates an asset class that offers the best of both worlds: the potential for growth and innovation found in cryptocurrencies and the stability and reliability inherent in gold.\n\nWhat is Gold Backed Cryptocurrency?\n\nA gold-backed cryptocurrency is a type of digital or virtual currency that is tied to the value of gold. In essence, every unit of such cryptocurrency represents a certain amount of physical gold, typically measured in grams or ounces. This gold is usually stored in secure and insured vaults, with each unit of the crypto asset or token representing a claim on a specific quantity of gold.\n\nGold backed cryptocurrencies aim to add a layer of stability to the notoriously volatile crypto market, providing a hedge against market downturns and establishing a connection to a tangible asset. They marry the advantages of digital currencies – such as easy transferability, divisibility, and borderless transactions – with the inherent value, longevity, and stability of gold, making them a compelling choice for investors seeking a balance of risk and reward.\n\nif you are looking to make safe investment in cryptocurrencies, we have complied a list of the best gold backed cryptocurrencies from around the world.\n\n1. Tether Gold: XAU₮\n\nWhat better way to start the list than with the name of a gold backed crypto token that belongs to the house that owns the largest stablecoin in the crypto market. Tether Gold (XAU₮) is a gold-backed digital asset pegged to the value of one troy ounce of gold. It was launched by Tether, the company behind the USDT stablecoin, in January 2020. However it is issued by TG Commodities Limited.\n\nThe purpose of XAU₮ is to provide a stable and secure way for individuals and institutions to invest in gold without possessing it physically. This makes it a more accessible option for non-institutional investors, who may not have the resources to purchase large amounts of gold.\n\nEach XAUT token represents ownership of one troy ounce of gold, which is stored in a vault in Switzerland. The tokens are issued by TG Commodities Limited, a new entity created by the Tether team.\n\nIn addition to providing exposure to the gold price, XAUT tokens also give investors the ability to access ETFs and other traditional financial assets. This is because the tokens are backed by physical gold, which can be used as collateral for loans or other financial transactions.\n\nTether Gold is backed by physical gold that is stored in Brink’s vaults in London. The company claims that for every XAU₮ token issued, there is one troy ounce of gold held in reserve.\n\nFeatures:\n\nUsers need to open an account at app.tether.to and have it verified to buy the tokens.\n\nOnly US dollars can be used to buy the tokens.\n\n1 XAU₮ token equals or represents one troy fine ounce of gold on a London Good Delivery bar.\n\nIt is transferrable from one on-chain Tether wallet to another.\n\nXAU₮ token is an ERC-20 token held on an Ethereum-based wallet and as a TRC20 token on the TRON blockchain.\n\nXAU₮ Tokens redeemable back to physical gold for verified users and for a certain minimum number of XAUt tokens. The gold is delivered to any location in Switzerland.\n\nTokens can be redeemed to gold and then the user request for it to be sold and cash sent to them minus fees.\n\n2. Paxos Gold: PAXG\n\nThe toughest competition to XAU₮ is Paxos Gold, with both always in a cat and mouse chase around the clock to be top the list of gold backed crypto tokens. Paxos Gold (PAXG) is a digital token that is backed by physical gold and is issued by Paxos, a regulated custodian. Each PAXG token is equivalent to one fine troy ounce of gold, which is stored in professional vault facilities.\n\nPAXG is an ERC-20 token, which means users can can own, transfer, store, and bet on gold easily and faster – of course, without the limitations of the size and weight of the large gold bars that are not easier to store, transfer ownership, or even subdivide.\n\nThere are a few reasons why someone might want to invest in PAXG. First, it offers a way to own physical gold without the need to physically store it. This can be a good option for people who want to invest in gold but don’t have the space or resources to store it themselves. Second, PAXG is a digital asset, which means that it can be traded quickly and easily. This makes it a good option for people who want to trade gold on a regular basis.\n\nFeatures:\n\n1 PAXG is backed by one fine troy ounce of gold at a ratio of 1:1.\n\nMinimum purchase: $20 or 0.01 PAXG or t oz of gold. For Major Gold ETF futures, it is 1 share. The minimum purchase for LBMA 400 t oz gold bar is $800.\n\nNo custody fee is charged for tokens. For the Major Gold ETF, it is 19-40 bps per year, physical gold coins and other products is 10-100 bps per year, unallocated gold is 1-10 bps per year, and other gold tokens is up to 100 bps per year. LBMA 400 t oz gold bar has a fee of 5-25 bps per year.\n\nAccess to Major Gold ETFs, Gold Futures (COMEX), other gold tokens, and the ability to redeem with physical gold\n\nRegulated by the NYDFS. Futures are not regulated.\n\n3. Gold Coin (GLC)\n\nThe next gold backed crypto on the list is believed to bring economic freedom to the world. Gold Coin (GLC) is a peer-to-peer cryptocurrency that aims for decentralization and economic liberty.\n\nInvestors are attracted to the gold backed crypto GLC as the transactional confirmation speed is just two minutes, beating many of the cryptocurrencies out their in the market. The ERC-20 coin can be stored and used through any Ethereum wallet. It is backed at a ratio of 1000 GoldCoin per ounce of gold, which makes it less volatile than Bitcoin and other altcoins not pegged to any stable asset.\n\nIt has all of the advantages of a digital asset over gold or fiat money, such as greater divisibility, portability, and transferability. Users can redeem the cryptocurrency for physical gold at any time they want.\n\nBesides buying the coin from various crypto exchanges, interested investors can also buy it from the issuer or Goldcoin.com. It is also available through the issuer’s ATM network, which makes it easy to pay via popular methods like debit or credit cards.\n\nFeatures:\n\nGLC is buckled in a ratio of 1:1000 GoldCoin per ounce of gold.\n\nThe platform also scales through on-chain and off-chain scaling methods.\n\nIt is mined through the proof of work algorithm, just like Bitcoin. The blockchain also supports SegWit and Lightning.\n\nMinimum Purchase: Not specified\n\nAlso Read: Top 10 Cryptocurrencies to invest in 2023\n\n4. DigixGlobal (DGX)\n\nThis one is on the list of the most popular gold backed cryptos for people who are always short on money but still wish to invest like pros. DigixGlobal (DGX) is for individuals who are interested in investing in gold but have limited funds. Meanwhile, if you are interested in investing in gold or silver, check out the best place to buy gold here!\n\nDGX also enables anyone to micro-accumulate gold and properly manage it on a 24/7 basis with few restrictions. Users can invest in Gold ETFs bearing fractional tokens using DGX. Obviously, the gold backed tokens can be traded on cryptocurrency exchanges.\n\nThe physical gold backing the crypto is kept by the firm in Singapore (The Safe House Singapore vault) and Canada, with members of the Bullion Association acting as custodians.\n\nFeatures\n\n1 token, or DGX, is equal to or represents 1 gram of gold. Backed by 100-gram Swiss gold bars from Valcambi, Produits Artistiques Metaux Precieux (PAMP), Metalor, and other refineries.\n\nIt is based on Ethereum blockchain and stored on Metamask, and other ETH wallets.\n\nTokens have no demurrage (storage) fee. ETF fee is a storage fee that is 0.4% pa. The physical gold bar storage fee is 0.6%, and the transaction fee for sending the tokens is 0.13% per transaction. The recast or token conversion fee to physical gold is 1%.\n\nMinimum purchase: $0.50 for the tokens, $150 for the gold ETF, and $50 to $600,000 for a gold bar.\n\n5. Meld Gold by Algorand\n\nMeld Gold, like other gold backed crypto tokens, makes gold available to all investors. They can transact gold in real-time with the tokens, eliminating the volatility associated with gold acquisition.\n\nThe Meld Gold token also protects investors from severe inflation, which occurs in conventional cryptocurrency marketplaces. It also eliminates investment risks for investors and delays transaction times.\n\nThe token is used to digitize the Meld Digital Gold Certificates, which are backed by physical gold in a ratio. The tokens can be stored on the Algorand Wallet, which allows users to track the value of their tokens. It, like other gold-backed currencies, provides for worldwide decentralized storage and holding at any location and time.\n\nFeatures:\n\nAvailable on OTC markets and Meld partners.\n\nThe Algorand on which the tokens are issued supports atomic swaps and standard asset tokenization features.\n\nThe gold backed token can be converted to any fiat or crypto on an exchange, and back to gold certificates or physical gold.\n\nMinimum purchase: Not specified.\n\nTo Conclude:\n\nAs the world continues to witness the rise of cryptocurrencies, the allure of gold backed tokens will likely grow, attracting both seasoned investors and newcomers seeking a secure and innovative way to preserve and grow their wealth.\n\nGold backed cryptocurrencies are likely to play a significant role in shaping the future of finance and investment. Gold backed cryptocurrencies provide a bridge between the age-old appeal of gold as a store of value and the modern advancements of blockchain technology.\n\nDisclaimer:\n\nRemember, when exploring the world of gold backed cryptocurrencies, it’s crucial to conduct thorough research, understand the specific features of each project, and assess your own investment goals and risk tolerance. With a carefully considered approach, you can embrace this exciting evolution of digital assets and embark on a journey towards a more diversified and secure financial future."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMimAFodHRwczovL3d3dy5uZXdzMTguY29tL2J1c2luZXNzL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZXMtdG9kYXktYml0Y29pbi1ldGhlcmV1bS1tYXRpYy1jaGVjay1wcmljZXMtb2YtbWFqb3ItY3J5cHRvY3VycmVuY2llcy1vbi1qdWx5LTI4LTg0NDU1ODkuaHRtbNIBnAFodHRwczovL3d3dy5uZXdzMTguY29tL2FtcC9idXNpbmVzcy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWJpdGNvaW4tZXRoZXJldW0tbWF0aWMtY2hlY2stcHJpY2VzLW9mLW1ham9yLWNyeXB0b2N1cnJlbmNpZXMtb24tanVseS0yOC04NDQ1NTg5Lmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jul 2023 07:00:00 GMT",
        "title": "Crypto Prices Today: Bitcoin, Ethereum, MATIC, Check Prices of Major Cryptocurrencies On July 28 - News18",
        "content": "Crypto Prices Today, July 28: Cryptocurrencies on Friday were trading lower on weakening in buying strength. Experts said the US Federal Reserve’s interest rate hike, followed by a higher-than-expected US GDP, raises concerns about prolonged high rates.\n\nBitcoin was trading lower by 0.98 per cent to Rs 25,48,052 as on 10 am on Friday, July 28. Polygon (MATIC), Dogecoin, Litecoin, Cardano and Binance Coin were down by up 2.43 per cent. However, Ethereum and Ripple were trading higher by 0.13 per cent and 0.29 per cent, respectively.\n\nThe crypto market has traded in a tight range in the last 24 hours. The global crypto market capitalisation continues to remain at $1.23 trillion. The fear and greed index, up by a point from yesterday, continues to remain in the neutral zone with a score of 52/100.\n\nParth Chaturvedi, investments lead at CoinSwitch Ventures, said, “BTC (-0.6%) is holding steady at around $29.2k and traded within a tight range of $29k-29.5k in the last 24 hours. The top 10 cryptos by market capitalization seem to be trading in the red, except for Solana. SOL (+0.9%) has been trading below a strong resistance level due to the weakening in its buying strength.”\n\nHe added that simultaneously, the Federal Reserve’s interest rate hike, followed by a higher-than-expected U.S. GDP, raises concerns about prolonged high rates. This may impact the market’s future price action, as investors may begin to move towards “risk-off” asset classes.\n\nMeanwhile, he also said the House Agriculture Committee has advanced the Financial Innovation Technology for the 21st Century Act, which would create a federal regulatory framework for crypto in the US. The bill would give the Commodity Futures Trading Commission (CFTC) primary regulatory authority over crypto exchanges and other trading platforms. After being approved by a voice vote, it will now go to the full House of Representatives for a vote.\n\nCrypto prices on CoinSwitch as of 10 am, July 28\n\nBitcoin (BTC): INR 25,48,052.00 (-0.98%)\n\nEthereum (ETH): INR 1,61,580.00 (+0.13%)\n\nPolygon (MATIC): INR 62.50 (-3.07%)\n\nDogecoin (DOGE): INR 6.71 (-1.91%)\n\nTether (USDT): INR 86.80 (-0.28%)\n\nRipple (XRP): INR 62.88 (+0.29%)\n\nCardano (ADA): INR 26.85 (-2.43%)\n\nSolana (SOL): INR 2,170.71 (-1.52%)\n\nLitecoin (LTC): INR 7,865.00 (-1.37%)\n\nBinance Coin (BNB): INR 20,869.55 (-1.49%)."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMirQFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC8yMDIzLWNyeXB0by1ndWlkZS1hbmFseXppbmctdGhlLXRvcC1jcnlwdG9jdXJyZW5jaWVzLXRvLXdhdGNoLWluLTIwMjMtYW5kLWJleW9uZC1pbmNsdWRpbmctZXRoZXJldW0tYXBlbWF4LXdvcmxkY29pbi1kb2dlY29pbi1hbmQtc2hpYmEtaW51L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jul 2023 07:00:00 GMT",
        "title": "2023 Crypto Guide | Analyzing the Top Cryptocurrencies to Watch in 2023 and Beyond, Including Ethereum, Apemax ... - Analytics Insight",
        "content": "Navigating the dynamic and often complex world of cryptocurrencies can be daunting. This comprehensive guide offers an analytical exploration of the top cryptocurrencies to watch in 2023 and beyond, including well-established coins and exciting newcomers such as Ethereum, ApeMax, WorldCoin, Dogecoin, and Shiba Inu.\n\nList of the top 10 cryptocurrencies to watch\n\nThis carefully assembled list spotlights the top cryptocurrencies that are drawing attention in the world of digital currency. Featuring both the market leaders and upcoming stars, the list provides a snapshot of the current market landscape.\n\nApeMax Bitcoin Ethereum WorldCoin Dogecoin Shiba Inu Cardano Polkadot Ripple (XRP) Chainlink\n\nWhat are the newest cryptocurrencies to watch?\n\nAs of 2023, Ethereum, ApeMax and WorldCoin have distinguished themselves as some of the most innovative cryptocurrencies in the market. ApeMax, with its recent presale launch, and WorldCoin, with its unique approach to cryptocurrency distribution, are capturing significant interest in the crypto space. Meanwhile, Ethereum continues to dominate the smart contract space.\n\nWhat are the new emerging cryptocurrencies?\n\nHere are four emerging cryptocurrencies to keep an eye on:\n\nApeMax : This innovative cryptocurrency has introduced unique features and tokenomics, marking it as an exciting newcomer in the market.\n\n: This innovative cryptocurrency has introduced unique features and tokenomics, marking it as an exciting newcomer in the market. WorldCoin : An ambitious project that seeks to distribute cryptocurrency to as many people as possible using a unique iris-scanning device.\n\n: An ambitious project that seeks to distribute cryptocurrency to as many people as possible using a unique iris-scanning device. Shiba Inu : While not entirely new, Shiba Inu continues to develop its ecosystem and hopes to become a significant player in the meme coin market.\n\n: While not entirely new, Shiba Inu continues to develop its ecosystem and hopes to become a significant player in the meme coin market. Polkadot: Polkadot aims to facilitate a fully functional and user-friendly decentralized web where users control their internet experience.\n\nThese cryptocurrencies are garnering more attention due to their unique offerings.\n\nWhat new crypto coins to buy in 2023?\n\nIn the realm of new cryptocurrencies, ApeMax is a new and exciting crypto coin available to purchase by eligible buyers in 2023. ApeMax has introduced innovative tokenomics, where users earn rewards by staking on their favorite creators, influencers, or crypto projects that they are fans of. However, it’s important to conduct thorough research, check eligibility, and consult unbiased expert advisors before buying crypto coins.\n\nWill 2023 be a good year for crypto?\n\nPredicting the future of the crypto market is inherently challenging due to its volatility and susceptibility to various economic and regulatory influences. Nevertheless, in the first half of 2023, the crypto market’s overall trend has been one of consistent growth, despite the periodic dips and minor setbacks. The increasing mainstream adoption of blockchain technology, the rise of DeFi (Decentralized Finance), and the proliferation of NFTs (Non-Fungible Tokens) suggest that the crypto space will continue to expand and innovate in 2023. It’s critical to remember, however, that the cryptocurrency market is fraught with risks and despite periods of growth, there is also the risk of substantial losses when the market slows down or undergoes bearish trends.\n\nWhat crypto to keep an eye on 2023?\n\nFor 2023, it will be worthwhile to keep an eye on both established cryptocurrencies and emerging ones. Bitcoin and Ethereum, despite their maturity, continue to innovate and remain the leading cryptocurrencies, influencing the overall direction of the market. In terms of emerging new cryptocurrencies, ApeMax and WorldCoin are exciting newcomers with their unique concepts and tokenomics. Shiba Inu and Polkadot are also noteworthy due to their evolving ecosystems and expanding use cases. However, given the unpredictable nature of the crypto market, monitoring these cryptocurrencies should be accompanied by comprehensive research and consultation with experts.\n\nIt is important to note that prior to taking cryptocurrency decisions, thorough independent due diligence and research and consulting unbiased experts are paramount. Moreover, it is crucial to fully grasp and understand the high levels of risk, uncertainty, and volatility that exist with all cryptocurrencies. Buying crypto is not suitable for all individuals. Individuals from the United States, Canada, sanctioned nations, and other blocked nations are not permitted to acquire ApeMax tokens. The complete list of blocked nations is available on the official ApeMax website.\n\nOfficial ApeMax Website: https://apemax.io/\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vZm9ydHVubHkuY29tL3N0YXRpc3RpY3MvaG93LW1hbnktZXRoZXJldW0tYXJlLXRoZXJlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jul 2023 07:00:00 GMT",
        "title": "How Many Ethereum Are There? 25+ Ethereum Stats and Facts for 2024 - Fortunly News",
        "content": "Ethereum is the next evolution of cryptocurrencies and blockchain technology. The project has come a long way since Vitalik Buterin initially envisioned it in 2013.\n\nNow it’s the second-largest coin in the industry, provides a platform for many other crypto projects, and has paved the way for the second generation of cryptocurrencies.\n\nSince the project has continued to receive updates over the years, there have been many changes. Some of the recent ones directly affect how many Ethereum are there. We’re going to examine how Ethereum is faring so far and what changes Ethereum developers have deployed on its network.\n\nWhat Is Ethereum?\n\nEthereum is much more than a platform powered by Ether (ETH), its native cryptocurrency. It’s a decentralized global network with a software platform that integrates blockchain technology.\n\nThanks to smart contracts, anyone versed in Solidity, the platform’s programming language of choice, can create applications, decentralized organizations, financial platforms, and more. These are the building blocks that make Ethereum unique and the next evolvement step in the cryptocurrency industry.\n\nSuch technology makes Decentralized Finance (DeFi) and decentralized applications possible. The Ethereum Virtual Machine (EVM) executes these autonomous programs that, in turn, complete certain functions if the conditions have been met.\n\nKey Ethereum Stats for 2024 - Editor's Choice\n\nToday, there are over 121 million ETH tokens, and the supply is dropping.\n\nMore than 2.7 million ETH have been permanently destroyed.\n\nEthereum uses less electricity than PayPal.\n\nEthereum has been verifying transactions by using proof of stake since September 2022.\n\nEthereum isn’t the original project’s blockchain; instead, that’s Ethereum Classic.\n\nThe price of ETH in the ICO phase was $0.31.\n\nThe foundation raised 31,500 BTC to fund the Ethereum project.\n\nThe highest market cap of ETH was $558.9 billion.\n\nThe all-time highest ETH price was $4,860 in 2021.\n\nEthereum will process 100,000 transactions per second after the Sharding upgrade.\n\nFacts and Figures about Ether - Token Powering Ethereum Network\n\nEther is often called Ethereum’s coin or token, and it’s used interchangeably with the platform’s name. It is used to execute and deploy smart contracts on the network. It’s also used for payments, and its price is often a subject on many investors’ minds. So, how many Ethereum coins are there, and what is their value?\n\nThere are currently over 121 million ETH tokens in circulation.\n\n(CoinMarketCap)\n\nEthereum was initially designed as a currency that won’t have a hard cap like Bitcoin. The total amount of ETH is still fluid, as recent network upgrades have made it possible to see changes in both directions.\n\nAs part of the London upgrade, Ethereum took its first steps towards becoming deflationary.\n\n(Ethereum.org, OriginStamp)\n\nEIP-1559 changed how mining rewards are distributed for verifying transactions before new Ethereum blocks are added to the blockchain. The transaction fee that usually went to miners is now burned, meaning it’s permanently destroyed. This process slowed down the issuance of new ETH tokens.\n\nSince EIP-1559 was introduced, more than 2.7 million ETH have been burned.\n\n(ultra sound money)\n\nThe upgrade was just one in a series that was supposed to prepare the Ethereum network for The Merge upgrade, where the consensus algorithm, the method used for verifying transactions, was to undergo significant changes.\n\nEthereum Mining and Consensus Algorithm\n\nHow much Ethereum is there for mining? This was one of the most important questions for miners investing in expensive computer rigs to ensure the network's safety and security.\n\nThe proof of work (PoW) consensus algorithm used to ensure network integrity was power intensive. It also wasn’t as accessible to everyone because of high computer hardware prices, which were further exacerbated by the crypto mining boom.\n\nMiners verified transactions on the Ethereum network using significant amounts of electricity.\n\n(Ethereum.org)\n\nAnticipating some of the problems that PoW brings, Ethereum always included in its development roadmap a plan for changing the consensus algorithm to proof of stake (PoS).\n\nAfter implementing PoS, the Ethereum blockchain uses 100 times less electricity than PayPal.\n\n(Ethereum.org)\n\nCurrently, computers verifying transactions on Ethereum’s network by staking ETH spend 0.0026 TWh of electricity, significantly less than miners spent previously. At its peak, ETH miners consumed almost 94 TWh per year. PoS reduced electricity consumption by 99.997% or about 36,154 times.\n\n(Ethereum.org)\n\nSo, how long has Ethereum been around, and how long was the PoW system used? The project launched in 2015 and used PoW exclusively till 2021. With the introduction of the Beacon chain, the Ethereum network effectively had both PoS and PoW operational simultaneously.\n\nSince September 15, 2022, the Ethereum mainnet has merged with the Beacon chain, and new ETH could be created through the staking process.\n\n(Ethereum.org, ultra sound money)\n\nSince the merge, the growth of new tokens has been reduced significantly.\n\nAccording to projections at the time of writing, the amount of ETH generated every year will drop by between 0.06 and 0.006% based on the past 30-day data. Bear in mind that this is a highly fluid process, and predictions can be inaccurate as data changes on a daily basis.\n\nETH became deflationary for the first time on November 9, 2022.\n\n(ultra sound money)\n\nFor the first time since the launch of the Ethereum project, there are fewer ETH tokens issued as rewards than the amount burned.\n\nWhile it’s still a tiny amount compared to Ethereum’s total supply, having a reduction of approximately 4,000 ETH since merging with Beacon Chain is still a significant adjustment for the market.\n\nIf the current trend continues, according to projections, there could be 10 million fewer ETH in 2030. The trend is to continue for the foreseeable future until the new token issuance and burn rate reach an equilibrium.\n\nAt this point, ETH is one of the rare cryptocurrencies in the industry that has such a system besides projects such as CAKE, BNB, and MATIC.\n\nBy the end of 2021, there were 114 million issued ETH tokens.\n\n(ultra sound money, Coindesk)\n\nThe potentially unlimited supply of Ether could have presented a serious inflationary issue. However, with the merger, it fell from 3.5% annually to below zero. The supply will drop with increased usage as more ETH gets burned with each transaction.\n\nInteresting Ethereum Facts\n\nThe Ethereum project brought exciting innovations to the cryptocurrency industry. It was the first cryptocurrency that aimed to implement more than simple trade of value and offer a software platform that is open source and free to use by anyone.\n\nThe implementation of ERC-20 tokens on Ethereum opened wide possibilities for different projects.\n\nThe ERC-20 standard implemented on Ethereum allows users to create their own tokens. Now it’s used by stablecoins such as Tether USD (USDT), USD Coin (USDC), Basic Attention Token (BAT), Uniswap (UNI), Aave (AAVE), Wrapped Bitcoin (WBTC), and many others.\n\nBesides creating new tokens, Ethereum supports creating decentralized autonomous organizations (DAOs). However, one of the first such projects on the Ethereum platform has proven rather unsuccessful.\n\nThe DAO hack was behind Ethereum’s first hard fork and the creation of Ethereum Classic (ETC).\n\n(WSJ, The New York Times)\n\nIn 2016, The DAO was governed by a set of smart contracts which had a bug allowing malicious parties to drain $50 million in funds from the decentralized organization.\n\nTo disrupt the damage done by hackers, most of the Ethereum community agreed on a hard fork, splitting the cryptocurrency.\n\nThe total Ethereum supply didn’t change; instead, it split the community into those who believed that the code of the platform shouldn’t be changed and those that agreed to roll back transaction history to the time before the hack.\n\nFunds stolen by the attackers were returned to the investors, but the hackers didn’t end up empty-handed, as they had $8.5 billion worth of ETC after the hard fork.\n\nIn hindsight, the actions that Ethereum developers, mainly Vitalik Buterin, took have saved the project in the long run and helped cement the cryptocurrency as a highly tested, secure, and stable platform.\n\n(CNBC)\n\nThere are five testnets currently in use by Ethereum, and they are called Sepolia, Pinkeby, Ropsten, Kovan, and Goerli. One of the more interesting facts about Ethereum is that the testnets got their names from metro and train stations worldwide.\n\nKovan is a station in Singapore, while Ropsten and Rinkeby are red and blue lines of the metro in Stockholm. Goerli is the name of the train station in Berlin, and the Athens metro line is called Sepolia.\n\nEthereum can be divided into 18 decimal points.\n\n(Ethereum.org)\n\nLike with Bitcoin, which is divisible into smaller fractions.\n\nWhile one satoshi, the smallest BTC unit, is the 100 millionth part of a BTC, the smallest ETH unit goes even further to one trillionth part of an ETH, called a wei. There is also a gigawei or gwei, which is worth 0.000000001 or ETH or one billionth of an ether.\n\nVitalik Buterin is the last of eight co-founders still directly involved with the development of Ethereum.\n\n(CNBC, Decrypt)\n\nThe project had eight co-founders, and besides Vitalik, there were also Anthony Di Iorio, Mihai Alisie, Charles Hoskinson, Amir Chetrit, Jeffrey Wilcke, Gavin Wood, and Joseph Lubin. Some of them are still working on projects in the cryptocurrency sphere:\n\nMihai Alisie is working on Akasha, a social framework for Ethereum.\n\nCharles Hoskinson moved on to co-found Cardano.\n\nGavin Wood is involved in Polkadot.\n\nJoseph Lubin launched Consensys.\n\nHow High Will Ethereum Go?\n\nInvestors and the general public are most interested in how much they can earn back from investing in Ether and primarily focus on financial gains rather than on how technology will improve.\n\nEven with the successful launch of Ether 2.0 (PoS integration), people still focus on why ETH hasn’t doubled or tripled in value, even though such a significant change came with the global recession and other hardships, which heavily affected the crypto and stock markets.\n\nEven if you bought ETH in 2016 at its highest price, you would still have 6,000% returns by the end of 2022.\n\n(Live Coin Watch)\n\nThe price of ETH first surged in June 2016, going over $20 after starting the year at just over $2. Even though it crashed in 2022 compared to 2021, even the smallest investment back in 2016 would have produced huge returns as Ether is currently sixty times more expensive.\n\nIn January 2018, ETH's price surged above the $1,000 mark for the first time.\n\n(Live Coin Watch)\n\nAfter that important landmark price for Ethereum, the price stagnated until the first signs of recovery in early 2021.\n\nEther reached an all-time high price of about $4,860 in November 2021.\n\n(Live Coin Watch)\n\nAfter the economy started to recover from the COVID-19 pandemic, there was much optimism from investors in all markets, including the crypto industry.\n\nMany cryptocurrencies, including Ether and Bitcoin, have reached record-breaking prices. The total market cap has reached about $3 trillion in value for the first time.\n\nEther is the second largest cryptocurrency according to its market capitalization.\n\n(CoinMarketCap, Live Coin Watch)\n\nAccording to crypto stats in the past, Bitcoin has consistently been the cryptocurrency with the highest total market cap. This is helped by the fact that on most exchanges, you can directly buy or sell Bitcoin using other cryptocurrencies.\n\nEther has the same exchange value, which is further increased if you consider that USDT, Ethereum’s ERC-20 token, is also a popular currency to pair up ETH with.\n\nEther’s crypto market share in 2022 is around 17%.\n\n(Live Coin Watch)\n\nEven though Ethereum’s price took a dive in 2021, most cryptocurrencies also took a hit, along with other markets. Bitcoin’s market dominance is below 40%.\n\nInterestingly, two stablecoins on Ethereum’s platform, USDC and USDT, make up around 6.5% and 7.5% of the total market cap.\n\nIf you invested $1,000 in Ether in January 2016, you would have been a millionaire in 2022.\n\n(Live Coin Watch)\n\nETH was worth less than $2 at the start of 2016, and early investors that held on to the cryptocurrency at least until 2018 could have cashed out with more than $1 million.\n\nIf they instead decided to sell at the cryptocurrency price peak of 2021, they would have $4.5 million in their bank account. That’s, of course, without calculating the taxes on their crypto earnings.\n\nEther’s all-time highest market cap was $558.9 billion in November 2021.\n\n(CoinMarketCap)\n\nAt the time of record prices, Ethereum’s circulating supply was 117.8 million tokens. The 24-hour volume recorded that day was $18.3 billion, which wasn’t an all-time high for ETH.\n\n$78.4 billion is the highest daily trading volume for ETH.\n\n(CoinMarketCap)\n\nEther reached this record-breaking figure on May 13, 2021, with a trading price of $3,828. Trading volumes on the day before and after were about 30% lower. In 2022, ETH’s 24-hour volume is at around $30 billion.\n\nAt the ICO (initial coin offering) stage, ETH was worth $0.31.\n\n(CoinCodex)\n\nTo fund and develop the project, the Ethereum Foundation had to hold a public ICO, similar to how companies hold initial public offerings (IPOs) before listing on a stock exchange.\n\nThere were more than 60 million Ether coins for sale, meaning that the project raised $18.3 million in funding from the ICO. Such info about Ethereum puts into perspective just how big its launch was.\n\nThe return on investment on ETH at the all-time high price in 2021 would be about 15,600 times.\n\n(CoinCodex)\n\nWith the price at the time of writing at $1,160, it’s still a return of more than 3,700 times on the initial investment. If you supported Ethereum’s ICO with Bitcoin, you would have more than 100 times the returns on your BTC.\n\nThe actual ICO did work through Bitcoin investments, and the project received 31,500 BTC at the time.\n\nEthereum and the NFT Market\n\nAs the ERC-20 standard allowed for the creation of fungible tokens that can be used for various purposes, the ERC-721 did the same for non-fungible tokens.\n\nThese tokens have created an entirely separate market for creating and selling unique digital items online. The NFT market is fascinating, but it’s still somewhat of a niche product.\n\nThere are more than 80,000 collections of NFTs on the Ethereum blockchain.\n\n(IntoTheBlock)\n\nThe number of NFT collections on Ethereum has increased by more than 100% in 2022. BoredApeYachtClub and CryptoPunks are the most popular and valuable collections on the market. Currently, there are more than 5.9 million addresses used for NFTs.\n\nEthereum Price Prediction and Project Future\n\nMaking any price prediction for ETH is a thankless task. We’ve already covered what gains you could have made had you invested early in the project.\n\nWith the current state of the financial market, though, there is no room for any cryptocurrency project to grow and make any returns for investors. However, even with these low prices, there are some positive outlooks to be had.\n\nIn 2022, at the current prices, 47% of investors are making money on ETH.\n\n(IntoTheBlock)\n\nThis percentage represents the number of addresses that received ETH at prices lower than the current one. Unfortunately, there are also 49% of ETH investors are currently losing money.\n\nAbout 67% of addresses have been holding ETH for over one year.\n\n(IntoTheBlock)\n\nMost investors are in for the long haul with Ethereum. However, it’s interesting to see that 29% of users invested during the worst financial period for the crypto industry in 2022, and another 4% joined within one month from when we wrote this article.\n\nThe Ethereum network has almost 1 million transactions to process per day.\n\n(YCharts)\n\nAlthough it was known to process even more in the past, currently, the network can only handle around ten Ethereum transactions per second. That’s why Ethereum developers are preparing another upgrade for the network that will exponentially increase the network’s processing capacity.\n\nSharding is the next phase in Ethereum’s development, which will increase the number of transactions per second to 100,000.\n\n(Ethereum.org, CoinShares)\n\nThis solution is designed to handle large amounts of data, and it’s named after a common computer science concept. In the process, the upgrade can more easily split the workload across the network and reduce congestion.\n\nWith this update, the Ethereum blockchain would be able to handle more transactions than Visa, which currently is at around 65,000 transactions per second."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMikQFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi0yMDIzLTIwMjUtYW5kLTIwMzAtZXRoLXBvaXNlZC10by1yZWFjaC0xNjQwMC1kcml2ZW4tYnktYW4tZXRoZXJldW0tZXRmLWxhdW5jaC1yZXBvcnQv0gGXAWh0dHBzOi8vd3d3LmNyeXB0by1uZXdzLWZsYXNoLmNvbS9ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLTIwMjMtMjAyNS1hbmQtMjAzMC1ldGgtcG9pc2VkLXRvLXJlYWNoLTE2NDAwLWRyaXZlbi1ieS1hbi1ldGhlcmV1bS1ldGYtbGF1bmNoLXJlcG9ydC8_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction 2023, 2025 and 2030: ETH Poised to Reach $16,400 Driven by an Ethereum ETF Launch – Report - Crypto News Flash",
        "content": "Many experts have laid out their year-end Ether price predictions, most of which see Ether surging past $2,000 before the close of the year.\n\nIn the long term, other market players expect Ether bulls to push prices up to as high as $16,000 and $30,000.\n\nThe year 2024 is only 5-months away, and price predictions for leading assets are pouring in. While many key players are focused on Bitcoin and its long-term potential, others are anticipating a massive price run for Ether, the second largest cryptocurrency by market cap.\n\nIn April, Finder rolled out some notable expert predictions for Ethereum for each quarter of the year. Notably, according to the average prediction from Finder’s panel of fintech specialists, ETH is expected to hit $2,741 before the end of 2023. The altcoin is then expected to close out the year at a price of $2,451.\n\nCome 2025, ETH is expected to soar even higher. According to these experts, ETH will hit $5,845 by the end of 2025, and soar to as high as $16,414 by the end of 2030.\n\nBen Ritchie, another key player who laid out a bullish price prediction for Ether, is aiming a little higher. Ritchie, who is the Managing director at Digital Capital Management, predicts that Ether will close the year at a price value of $3,200.\n\nEther’s performance this year has been attributed to a single factor, by many market experts. Ritchie, who shares a similar sentiment as these experts, agrees that Ether’s success this year can be credited to its transition to a proof-of-stake network.\n\nExperts credit Ether’s bullish performance to its transition from PoW to PoS\n\nDue to the fundamental changes brought to the network because of this transition, Ether is seeing significant growth and adoption from the wider cryptocurrency market.\n\n“There is a potential for a future supply squeeze, supported by a gradual emission rate, staking, and the network effect, which could drive the price of Ethereum to approximately US$3,200 within the current year – and even exceed US$12,000 in the long run.” Ben Ritchie asserted.\n\nAnother expert who sees Ether soaring is Yves Renno, the head of trading at Wirex. Yves Renno is also betting big on ETH, and predicts that the asset will be valued at $6,000 by the end of 2025. He further asserts that there is a “strong basis for short lived rallies in 2023, and a strong rally before the end of 2024.”\n\nRenno, along with another prominent figure Tommy Honan, the Head of Product Strategy at crypto exchange Swyftx, strongly believe that yield staking has also included Ether’s mainstream adoption rate. Honan is convinced that the yield on offer for staking ETH is in “the sights of institutions.”\n\nAt the time of this report, Ether is still in the red zone, as it trades at a price of $1,875.\n\nThis article is provided for informational purposes only and is not intended as investment advice. The content does not constitute a recommendation to buy, sell, or hold any securities or financial instruments. Readers should conduct their own research and consult with financial advisors before making investment decisions. The information presented may not be current and could become outdated."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZmluYm9sZC5jb20vMjktZmluYW5jZS1leHBlcnRzLXNldC1ldGgtcHJpY2UtZm9yLXRoZS1lbmQtb2YtMjAyMy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jul 2023 07:00:00 GMT",
        "title": "29 finance experts set ETH price for the end of 2023 - Finbold - Finance in Bold",
        "content": "In 2023, the crypto markets witnessed a blazing rally, largely boosted by improving global economic conditions and a surge in investors’ risk appetite. Bitcoin (BTC), the pioneering digital asset, has been at the forefront, attracting massive attention due to its soaring value and increasing institutional acceptance.\n\nMeanwhile, despite a notable surge, Ethereum’s (ETH) performance this year has been overshadowed by Bitcoin’s dominance, leaving many to ponder the reasons behind its underperformance.\n\nTo seek professional views on this matter, finance platform Finder consulted 32 fintech and crypto experts to offer their year-end price predictions for Ethereum, with the results showing notably bullish expectations for the world’s second-largest cryptocurrency.\n\nAccording to information shared with Finbold, ETH is expected to end the year at $2,451, indicating a potential price increase of more than 30% from the crypto asset’s current price. In the meantime, Ethereum is projected to reach its 2023 peak of $2,700, the finance specialists predicted.\n\nETH end-of-year price prediction. Source: Finder\n\nGoing forward, the projections for Ethereum were even more optimistic. In particular, the panel of experts expects ETH to hit $5,845 by the end of 2025, and a whopping $16,414 before the end of 2023, suggesting a potential upside of more than 780% for the remainder of this decade.\n\nExperts’ remarks on ETH\n\nAmong 29 finance professionals that were consulted by Finder were Omnia Markets founder and CEO Mitesh Shah, Swyftx head of product Tommy Honan, and Digital Capital Management managing director Ben Ritchie.\n\nNotably, Shah’s end-of-year prediction for ETH was in line with the panel’s consensus estimates, while Swyftx’s Tommy Honan was slightly more bullish on Ethereum’s near-term prospects.\n\n“Ethereum remains as the standout second choice investment for both the retail and institutional investor alike. Following the successful upgrade to proof of stake, which has been akin to “changing a jet plane engine, mid-flight”, ETH has become more efficient and deflationary to mention a few,” he said. – said Shah.\n\nOn the flip side, Ben Ritchie was among those who were more cautious in their ETH predictions, primarily due to the rising growth of centralized staking solutions in the crypto space.\n\n“The decentralised nature of Ethereum could potentially work in its favour; however, our concerns arise as the prominence of centralised staking solutions increases, posing a threat to the decentralisation of the network.” – Ritchie noted.\n\nOverall, the majority of the panel, 56%, think now is a good time to purchase ETH, while 41% and 4% advised holding and selling the cryptocurrency, respectively.\n\nEthereum price analysis\n\nAt the time of writing, ETH was changing hands at $1,861, down 0.54% on the day.\n\nETH 1-day price chart. Source: Finbold\n\nThe crypto asset fell around 1.6% in the past week, while its monthly price remained relatively flat.\n\nStill, ETH is up over 55% since the start of the year, driven by a broader crypto market rebound.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LnRoZWNvaW5yZXB1YmxpYy5jb20vMjAyMy8wNy8yOS9ldGhlcmV1bS1jbGFzc2ljLXByaWNlLXByZWRpY3Rpb24td2lsbC1ldGMtcHJpY2UtcmVhY2gtMjUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Classic Price Prediction: Will ETC Price Reach $25? - The Coin Republic",
        "content": "Ethereum Classic price prediction suggests a rise in the long run and that the bulls seem to be active at the lower levels.\n\nETC price faced rejection from the 200 day EMA which means the positional trend downward facing. However, the short term trend is bullish and buyers are buyers trying their best to defend the 50 day EMA.\n\nEthereum Classic price recovered 23% from the recent swing low and showed signs of bullish trend reversal. However, the momentum halted near the $22.00 level witnessing minor profit booking.\n\nPresently, ETC price is stuck in the narrow range between $17.00 to $22.00. If the buyers succeed in defending the lower range, a short term bounce is possible.\n\nIn mid June, ETC crypto witnessed sharp buying from the $14.00 support showing that strong buyers are active at the lower levels. Therefore, the possibility of the downside is low.\n\nEthereum Classic price is trading at $18.43 with an intraday decline of -0.22%. The 24 hour volume to market cap is 3.20%. The pair of ETC/BTC is trading at $0.000630 with an intraday decline of -0.16%.\n\nWill Ethereum Classic Price Regain the $20.00 Mark?\n\nETC/USDT daily chart by TradingView\n\nEthereum Classic price prediction favors the bulls and suggests rise in coming months. ETC prices performed well in June but due to the strong presence of sellers prices lacked the momentum near the supply zone.\n\nAs long as ETC crypto price sustains above $17.00, the possibility of the bounce back remains high. However, prices will gain momentum when buyers succeed to break out of the $20.00 hurdle.\n\nOn the other hand, if the price drops below $17.00, then bears may try to drag it down to the yearly lows. The technical analysis suggests ETC price is near a crucial support and the possibility of a bounce is high.\n\nETC Price Formed a Bullish Hammer Candle\n\nETC price formed a bullish hammer candle on the weekly time frame. It shows that the correction is over and the bulls are returning back on track. The crypto leader, BTC, is also recovering, which might positively impact ETC.\n\nThe MACD curve took support near the zero line and is reversing upward indicating mild bullishness. The RSI at 48 sloping sideways denotes neutral territory and a tight tug of war between the buyers and sellers.\n\nConclusion\n\nEthereum Classic price prediction suggests significant increase in the value is possible. ETC price is near a crucial support level. Therefore, the possibility of bouncing back is high. If buyers succeed in breaking out of the $20.00 level, then it will begin the journey to reach $25.00.\n\nTechnical levels\n\nResistance levels: $21.00 and $24.00\n\nSupport levels: $17.00 and $15.00\n\nDisclaimer\n\nThe views and opinions stated by the author, or any people named in this article, are for informational purposes only. They do not establish financial, investment, or other advice. Investing in or trading crypto assets comes with a risk of financial loss."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vY29pbmNoYXB0ZXIuY29tL2V0aGVyZXVtLWV0aC1wcmljZS1wcmVkaWN0aW9uLTIwMjMv0gE_aHR0cHM6Ly9jb2luY2hhcHRlci5jb20vZXRoZXJldW0tZXRoLXByaWNlLXByZWRpY3Rpb24tMjAyMy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction 2023: Will ETH Price Hit $2.5K by Year's End? - CoinChapter",
        "content": "Key Takeaways:\n\nEthereum’s (ETH) price has been under $2,000 for over a year.\n\nExperts at Finder believe the ETH price could hit $2,400 by the end of the year.\n\nWhat are the factors propelling the altcoin?\n\nYoung man trader meditating under rising crypto or stock market exchange chart. Business trader, finance stock market graph concept. Rising green profit stock Market. Balance feeling\n\nYEREVAN (CoinChapter.com) — Ethereum’s token, Ether (ETH), the largest altcoin with a nearly $225 billion market cap, rose about 0.4% to $1,860 on July 28.\n\nEthereum (ETH) daily price action chart. Source: TradingView.com\n\nEthereum could hit $5.8K by 2025 — Survey\n\nAccording to a survey of 29 industry specialists conducted by Finder, the ETH price will reach $2,400 by the end of 2023 after possibly peaking at over $2,700.\n\nThese experts also predict ETH prices will hit $5,800 by the end of 2025 and over $16,400 by the end of 2030.\n\nEthereum (ETH) price prediction by Finder. Source: finder.com\n\nNotably, the token has not effectively conquered the $2,000 ceiling since May 2022.\n\nBut one of the respondents, the managing director at Digital Capital Management, Ben Ritchie, has an above-average end-of-year prediction of US$3,200. He attributed the expected success to the Merge and Ethereum’s consequential full shift to proof-of-stake consensus.\n\nThere is a potential for a future supply squeeze, supported by a gradual emission rate, staking, and the network effect, which could drive the price of Ethereum to approximately US$3,200 within the current year – and even exceed US$12,000 in the long run. asserted the expert.\n\nAlex Svanevik, the CEO of Nansen’s data analytical platform, also gave an optimistic prediction of $3,400.\n\nEthereum has the most active developer ecosystem among blockchains. Economic activity Ethereum is the closest thing we have to a digitally native GDP. And as this GDP grows, with the soundest monetary policy of any economy, ETH will outperform most other major assets. he said.\n\nRegulatory factors could propel ETH\n\nThe possible approval of BlackRock’s Bitcoin spot ETF could propel the approval of a similar Ethereum-based fund. 70% of the Finder survey respondents were positive on the matter, while 15% were unsure, and another 15% did not believe an ETH spot ETF is a possibility.\n\nUS Securities and Exchange Commission’s (SEC) recent scrutiny of altcoins turned beneficial for Ethereum, given its relative “immunity” to being categorized as a “security.” However, the question remains, will that immunity continue? Experts had different answers.\n\nMight SEC consider Ethereum security? Source: finder.com\n\nAt the moment, the SEC has not ruled out considering ETH security. However, the altcoin has relative protection due to the “Hinman speech.” William Hinman is the former Director of the Corporation Finance Division at the SEC. In his June 2018 speech, Mr. Hinman voiced his position on defining digital assets.\n\nPutting aside the fundraising that accompanied the creation of Ether, based on my understanding of the present state of Ether, the Ethereum network and its decentralized structure, current offers and sales of Ether are not securities transactions. said the former official.\n\nMeanwhile, not all the factors in the market point to a bullish continuation.\n\nNegative factors for Ethereum\n\nThe macroeconomic conditions remain challenging for the crypto market, as the Federal Reserve went forward with another interest rate hike in the latest Federal Open Market Committee meeting on Wednesday.\n\nMoreover, data from TheBlock reveals a decline in on-chain activity on Ethereum. For example, the transaction volumes have declined by 27% year-over-year, standing at roughly 27 million on July 28, 2023.\n\nThe number of transactions on the Ethereum blockchain. Source: theblock.co\n\nAdditionally, the platform detected a decline in the number of daily active addresses. As the graph below demonstrates, the number went from approximately 514,000 in July 2022 to an average of 368,000 in July 2023, a 28% drop."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY29pbmNoYXB0ZXIuY29tL21vcmUtaW52ZXN0b3JzLWJhY2tpbmctZXRoZXJldW0td2lsbC1xdWJlLWFuZC1lcmMtMjAtdG9rZW5zLXJpcC1oaWdoZXIv0gFjaHR0cHM6Ly9jb2luY2hhcHRlci5jb20vbW9yZS1pbnZlc3RvcnMtYmFja2luZy1ldGhlcmV1bS13aWxsLXF1YmUtYW5kLWVyYy0yMC10b2tlbnMtcmlwLWhpZ2hlci9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jul 2023 07:00:00 GMT",
        "title": "More Investors Backing Ethereum, Will QUBE and ERC-20 Tokens Rip Higher? - CoinChapter",
        "content": "The InQubeta (QUBE) presale has now generated more than $1.8 million in tokens early on and investors still stand to grow their investments by up to 300% if they join in now. Ethereum has also enjoyed a substantial increase in investor backing in 2023 with prices rising by up to 70%. Ethereum-based projects like InQubeta, Polygon (MATIC), and Chainlink (LINK) have all played a role in the increase in investor interest in Ethereum as its functionality gives it the potential to someday take Bitcoin’s spot as the cryptocurrency with the highest market capitalization.\n\nInQubeta focuses on making investment opportunities in artificial intelligence (AI) easier to access while funneling more funds to startups that need them. It skirts the barriers that prevent countless people from using traditional investing avenues, opening up prospects to anyone with a cryptocurrency wallet.\n\nInQubeta (QUBE) and other ERC-20 tokens boosting Ethereum trading volume\n\nThe InQubeta project hosts an Ethereum-based blockchain that utilizes the power of ERC-20 tokens to create an alternative way to invest in AI startups. These companies can raise funds on the InQubeta ecosystem by making non-fungible tokens (NFTs) that represent equity in their operations. These tokens are posted on the InQubeta marketplace where investors can learn more about the companies behind them or purchase NFTs with $QUBE tokens.\n\nThe NFTs are transferred to buyers once sales are finalized, giving them full ownership of the tokens, which they can hold on to long-term or sell whenever they choose. Think of these NFTs as the blockchain version of stocks. Some tokens come with additional bonuses like a piece of profits and smart contracts ensure investors get all bonuses promised to them.\n\nThe InQubeta ecosystem solves two real-world problems simultaneously: it opens up investment opportunities in artificial intelligence while directing more capital to AI firms that need cash to advance their projects.\n\nAI investments 10x as world braces for next tech revolution\n\nAI is no longer just some cool idea entertained in sci-fi media. Major milestones have been made in the past decade and the technology is now expected to transform the world in the next several years. Vehicles with self-driving features are now mass-produced, while search engines use AI to improve search results.\n\nTechnological breakthroughs always create opportunities for investors to earn exponential profits and the same will be the case for the AI revolution. Those who back AI startups that end up reshaping industries set themselves up to earn unprecedented returns on their investment. The InQubeta project makes such investment opportunities more accessible than they’ve ever been.\n\nEthereum (ETH) continues to generate investor interest\n\nEthereum has been viewed by many as Bitcoin’s inevitable replacement because of its improved functionality by allowing for the creation and deployment of decentralized applications and smart contracts.\n\nEthereum has enjoyed a little more growth than Bitcoin in 2023 and some cryptocurrency experts credit the success of some of the cryptocurrency projects launched on its blockchain like InQubeta, Chainlink, and Polygon for its price movement. All three have generated lots of investor interest recently, helping to push Ethereum prices upward as they showcase how much of an impact Ethereum will have in the cryptocurrency space in the future.\n\nIt’s quite possible that many of the top cryptocurrencies in the future will be Ethereum-based projects like the InQubeta network which is projected to enjoy up to 100x growth after its launch.\n\nSummary\n\nThe InQubeta presale is currently one of the hottest events in the cryptocurrency space with over $1.8 million in tokens sold early on in the event. The InQubeta project harnesses the functionality of the Ethereum network to create a more accessible way to invest in AI startups than traditional options. InQubeta will play a major role in helping to direct the $1.5 trillion expected to pour into artificial intelligence in the next seven years to startups that need funding.\n\nVisit InQubeta Presale\n\nJoin The InQubeta Communities\n\nDisclaimer: The statements, views and opinions expressed in this press release are solely those of the content provider and do not necessarily represent those of CoinChapter. CoinChapter will not be responsible in any way for the content of the same. Do your research and invest at your own risk."
    }
]