[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDMvMjMvZXRoZXJldW0tY28tZm91bmRlci1zYXlzLWV0aGVyLW5vdC1hLXNlY3VyaXR5LWNvbXBhcmVzLWl0LXRvLW9pbC5odG1s0gFpaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjMvMDMvMjMvZXRoZXJldW0tY28tZm91bmRlci1zYXlzLWV0aGVyLW5vdC1hLXNlY3VyaXR5LWNvbXBhcmVzLWl0LXRvLW9pbC5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Mar 2023 07:00:00 GMT",
        "title": "Ethereum co-founder says ether not a security, compares it to oil after regulator claims - CNBC",
        "content": "The co-founder of Ethereum, Joseph Lubin, hit out at regulators likening the ether cryptocurrency to a security, saying it was more akin to a commodity like oil.\n\nIn an interview with CNBC's Arjun Kharpal at Paris Blockchain Week Thursday, Lubin said he was \"very confident\" ether was not a security.\n\nIf it were treated as such, ether would need to be registered with regulators and subjected to much stricter requirements around pre-clearance and reporting.\n\n\"Anyone can say anything, it doesn't make it true,\" Lubin told CNBC.\n\nThe concerns that ether may be deemed a security stem from a lawsuit filed by the New York Attorney General Letitia James against Seychelles-based cryptocurrency exchange Kucoin, which alleged the firm failed to register as a securities and commodities broker-dealer and falsely represented itself as an exchange.\n\nIn the lawsuit, the NYAG's office listed ether among several tokens listed on Kucoin that the regulator viewed as securities, stating it was a \"speculative asset\" that relies on the efforts of third-party developers to provide holders with a profit.\n\n\"It's unfortunate that that sort of side swipe was made, but I don't think it's all that relevant,\" James said.\n\nEther is different from bitcoin in that it fuels an ecosystem of applications where users can make trades, loans, or buy nonfungible tokens."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3Rva2VuaXplZC1ob21lLW5ldHMtdGhvdXNhbmRz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Mar 2023 07:00:00 GMT",
        "title": "Atlanta Home Tokenized on Ethereum, Nets $214882 in Under 3 Minutes - Blockworks",
        "content": "With US single-family home values hovering in a middle-of-the-road range on a year-over-year basis, crypto companies are looking to carve out a slice of the US real estate pie — even as digital assets themselves remain deeply depressed over that same period.\n\nIn the latest instance, fintech and single family-focused sales company Roofstock has sold off a Georgia home to RealT via a tokenized Ethereum-based NFT, representatives for both companies told Blockworks on Tuesday. It marked the first collaboration between the two companies.\n\nThe first round of the transaction was facilitated by OpenSea, with RealT imposing “heavy restrictions” around the float of the initial fractionalization offering, according to Remy Jacobson, the co-founder at RealT and one of two chief executives at the businesses. A second round will follow later.\n\nRead more: The Crypto Native’s Guide to Real Estate Investing\n\nIt’s not the first such instance of an NFT-enabled property sale for Roofstock, which has a Web3-focused division that aims to make inroads into the property sector.\n\nThe process is similar to Roofstock’s previous tokenized real estate sale of a home in Alabama last month.\n\n“RealT acquires properties sourced by Roofstock into C-Corps which then sell tokenized shares to investors,” the spokesperson said in an additional statement. The idea is to use the tokenized equities originated in the US to provide blockchain-based exposure to investors in other countries.\n\nA spokesperson disclosed metrics behind the fractionalization of the NFT by RealT:\n\n670 unique token holders snapped up a total of 722 orders\n\nThe blockchain transaction process took two minutes and 46 seconds\n\nThe average ETH-based purchase equated to about $298.\n\nThe partnership relies upon creating a separate Wyoming LLC tied to each single-family asset the company has available for sale in its inventory, which acts as a shell for a corresponding wallet holding the buyer’s NFT on Ethereum “that has [its] token ID associated with the smart contract,” said Sanjay Raghavan, vice president of Web3 initiatives at Roofstock.\n\n“The property in question can then be bought and sold on various NFT marketplaces, resulting in instantaneous sale and settlement,” the statement said.\n\nEach buyer holds a “soulbound” NFT, according to Raghavan, a non-transferrable token, meaning that the underlying blockchain mechanics are permissioned in nature.\n\nEach property NFT, as a result, “gets marked with a KYC flag,” Raghavan said, and the prospective owner “can go to OpenSea or any other marketplace where the asset is listed and purchase the NFT.”\n\nEther collected through RealT’s tokenization offering this week partially divides ownership of the property acquired for 218,000 USDC on OpenSea.\n\nThe process facilitating the sale of the Atlanta-area home — which has two bedrooms, 2.5 bathrooms and a total of 1,524 square-feet — is being billed as the beginning of a partnership between the two companies, which is kicking off at a time when US regulators are keeping a close eye on crypto. And when murmurs of a real estate bubble waiting to burst have been percolating.\n\nBoth executives said they’re putting in place measures to ensure compliance with the relevant US authorities as the outlook for digital asset oversight remains largely mixed.\n\n“Blackrock is saying tokenization is the future, and you can be sure the SEC is listening,” Jacobson said.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDMvMjMvZXRoZXJldW0tbmV0d29yay1kcnBjLWFpbXMtdG8tcXVlbGwtY2VudHJhbGl6YXRpb24tcmlza3MtYWhlYWQtb2Ytc2hhbmdoYWktdXBncmFkZS_SAYABaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wMy8yMy9ldGhlcmV1bS1uZXR3b3JrLWRycGMtYWltcy10by1xdWVsbC1jZW50cmFsaXphdGlvbi1yaXNrcy1haGVhZC1vZi1zaGFuZ2hhaS11cGdyYWRlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Mar 2023 07:00:00 GMT",
        "title": "Ethereum Network DRPC Aims to Quell Centralization Risks Ahead of Shanghai Upgrade - CoinDesk",
        "content": "The launch comes ahead of Ethereum's much-awaited Shanghai upgrade, which will allow ether stakers to withdraw tokens from the network. Such users rely mostly on centralized RPC providers for activities, which serves as a counterparty risk in case of any bugs or exploits."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vZXhwbGFpbmVkL2V0aGVyZXVtLWFzLWEtZGVmbGF0aW9uYXJ5LWFzc2V0LWV4cGxhaW5lZNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Mar 2023 07:00:00 GMT",
        "title": "Ethereum as a deflationary asset, explained - Cointelegraph",
        "content": "What is a deflationary cryptocurrency? Although cryptocurrencies are often promoted as investment opportunities, their primary purpose was originally to serve as an alternative form of currency. Considering this narrative, the rules of supply and demand apply to cryptocurrencies as to fiat currencies. An undergraduate economics student might say the basics of money, economy and market forces is balancing supply and demand. How much of an asset is in circulation versus the demand — how many people want that particular asset — helps decide its price. This equation between supply and demand underlies the fundamentals of all economies and also applies to cryptocurrencies. Deflationary cryptocurrency is one where the value of the crypto increases due to a reduction or stagnation in supply. This ensures that the coin’s market value is attractive for more people to invest in and can be used as a store of value. While deflationary cryptocurrencies look more attractive, not all are designed that way. Many well-known cryptocurrencies are not deflationary. In addition, there is often no supply limit to them. Some are disinflationary because inflation gradually reduces over time due to its tokenomics. Bitcoin (BTC), for instance, won’t be deflationary until all 21 million coins have been mined. Ether (ETH) was not deflationary until the “Merge” happened in September 2022. Related: Inflationary vs. deflationary cryptocurrencies, Explained\n\nHow does Ethereum fare against other deflationary tokens? Developers of tokens create deflationary mechanisms during the design of the economic model behind the token. The economic model — tokenomics — can be fundamental to how stakeholders add and accrue value in a Web3 ecosystem. The supply and demand dynamics of a token are decided at the level of development. Deflationary characteristics like burn mechanisms are decided as the economic model underlying the token is being developed. This can be a point-in-time process like with Bitcoin or an evolving mechanism like with Ethereum. When creating Bitcoin, Satoshi Nakamoto ensured there would only be a finite supply of 21 million. Once 21 million Bitcoin are mined, no new BTC can be created. This limited supply has helped the narrative that Bitcoin is a true store of value compared with fiat currencies that increase supply due to central bank monetary policies. In contrast, Ethereum had an inflationary supply at its inception. Ether supply was increasing at an annual rate of 4.5%. However, after the Ethereum Merge that saw it move from proof-of-work to proof-of-stake, it is now a non-inflationary asset due to its burn rate. The number of Ether burned in maintaining the network activity is more than the amount of Ether entering circulation. Implementing the EIP-1559 protocol has altered the economic nature of the Ethereum token by incorporating the burning of a fraction of the gas fees per transaction. As a result, some experts argue that Ethereum has become more deflationary than Bitcoin. As deflationary tokens are considered a better store of value, new tokens created for both protocol and application tiers may be designed to be deflationary.\n\nHas Ethereum’s transition to a deflationary token made it a more desirable asset? Investments in deflationary cryptocurrencies can yield growth and returns for investors. But being deflationary alone may not be a criterion to be identified as a better investment. Due to their supply cap, deflationary tokens are typically perceived as more valuable by holders and investors. This was also demonstrated by the rise of nonfungible tokens (NFTs), where the rarity of the NFTs often decided the prices. Limited supply driving prices higher was also true with the Ethereum Name Service (ENS), where some three-digit ENS names were sold for even more than 100 ETH. Ethereum may not necessarily be classified as a better asset after it became deflationary. Ethereum has a rich ecosystem that drives transactions on the chain, and as more Ether gets burned in the process, it causes deflation. An unused Ethereum blockchain wouldn’t be able to achieve this economic feat. The underlying chain fundamentals must remain strong for Ethereum to thrive as an investment. A chain with strong fundamentals typically has a developer ecosystem to create many applications that users widely adopt. As users flock to these applications, developers are encouraged to continue innovating. The resulting network effect would make Ethereum deflationary, making it a more attractive investment asset."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvaW5ub3ZhdGlvbi9ldGgtMjAtdW5kZXJzdGFuZGluZy10aGUtYmVhY29uLWNoYWluLXByb29mLW9mLXN0YWtlLWFuZC1zaGFyZGluZy_SAYABaHR0cHM6Ly93d3cuZmluYW5jZW1hZ25hdGVzLmNvbS9jcnlwdG9jdXJyZW5jeS9pbm5vdmF0aW9uL2V0aC0yMC11bmRlcnN0YW5kaW5nLXRoZS1iZWFjb24tY2hhaW4tcHJvb2Ytb2Ytc3Rha2UtYW5kLXNoYXJkaW5nL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Mar 2023 07:00:00 GMT",
        "title": "ETH 2.0: Understanding the Beacon Chain, Proof-of-Stake, and Sharding - Finance Magnates",
        "content": "Ethereum, the world's second-largest cryptocurrency in terms of market capitalization, is undergoing a significant upgrade known as Ethereum 2.0. This upgrade is intended to address some of the current Ethereum network's scalability and security issues.\n\nIn this article, we will look at Ethereum 2.0's key components, such as the Beacon Chain, Proof-of-Stake, and Sharding.\n\nThe Beacon Chain\n\nThe Beacon Chain is Ethereum 2.0's first phase, and it is already operational. It is a new blockchain that will be used to coordinate the activities of other shards that will be added in subsequent phases. The Beacon Chain employs a new consensus algorithm known as Proof-of-Stake (PoS), which replaces the current Ethereum network's Proof-of-Work (PoW) algorithm.\n\nProof-of-Stake\n\nThe Beacon Chain uses Stake as a consensus algorithm to validate transactions and create new blocks. In contrast to PoW, which requires miners to solve complex mathematical problems in order to validate transactions, PoS requires validators to stake a certain amount of Ethereum in order to participate in the validation process.\n\nValidators are chosen based on the amount of Ethereum staked, and their participation is rewarded with newly created Ethereum.\n\nOne advantage of PoS is that it consumes less energy than PoW. PoW necessitates the use of significant amounts of energy by miners to solve complex mathematical problems, whereas PoS only necessitates validators to stake Ethereum. As a result, PoS is a more environmentally friendly option than PoW.\n\nSharding\n\nSharding is a key component of Ethereum 2.0, and it is intended to improve the Ethereum network's scalability. Currently, every transaction must be processed by all nodes in the Ethereum network, which can cause congestion and slow transaction times.\n\nSharding addresses this issue by dividing the network into smaller, more manageable shards.\n\nEach shard can process its own transactions, reducing network load and increasing transaction throughput. This increases the network's scalability and allows it to handle a greater number of transactions.\n\nThe Advantages of Ethereum 2.0\n\nEthereum 2.0 has a number of advantages over the current Ethereum network. One of the primary advantages is increased scalability. Ethereum 2.0 can process more transactions per second than the current Ethereum network thanks to sharding.\n\nThis is critical for Ethereum's growth and adoption because it will allow it to handle more users and applications.\n\nIncreased security is another advantage of Ethereum 2.0. The use of PoS in the Beacon Chain increases network security by lowering the likelihood of 51% attacks. A 51% attack occurs in a PoW network when a single miner or group of miners controls more than 50% of the network's mining power.\n\nThis allows them to manipulate transactions and possibly double-spend coins. Validators in PoS are chosen based on the amount of Ethereum staked, making it more difficult for a single entity to gain control of the network.\n\nFinally, Ethereum 2.0 is less harmful to the environment than the current Ethereum network. PoS reduces the amount of energy required to validate transactions, making it a more sustainable alternative to PoW.\n\nEthereum 2.0 Challenges\n\nWhile Ethereum 2.0 has several advantages, it also has some implementation challenges. The transition from the current Ethereum network to Ethereum 2.0 is one of the most difficult challenges. This will necessitate extensive coordination and testing to ensure that the transition goes smoothly and that the network remains secure.\n\nAnother issue is the possibility of centralization. Validators in PoS are chosen based on the amount of Ethereum they possess.\n\nThis means that those with more Ethereum have a better chance of being chosen as validators, which may lead to network centralization. To address this issue, Ethereum 2.0 is introducing the Slashing Condition, which penalizes validators who act maliciously or go offline for extended periods of time.\n\nFinally, interoperability is a concern. Because Ethereum 2.0 is a distinct blockchain from the current Ethereum network, applications and smart contracts built on the current network will be incompatible with Ethereum 2.0. Adoption may be hampered as a result of the need for developers and users to rebuild their applications and contracts to work with the new network.\n\nWhat Is the Future of Ethereum 2.0?\n\nThe first phase of Ethereum 2.0, the Beacon Chain, is already operational, and the development team is currently working on implementing the subsequent phases, which will include the addition of shards and the migration of the current Ethereum network to Ethereum 2.0.\n\nThe development team is working in stages to ensure that each phase is thoroughly tested before proceeding to the next.\n\nEthereum 2.0 has the potential to revolutionize the blockchain industry once it is fully implemented. With improved scalability, security, and energy consumption, it could very well become the go-to platform for decentralized applications and smart contracts.\n\nWill ETH 2.0 Topple Bitcoin?\n\nAs two of the most prominent cryptocurrencies in the market, Bitcoin (BTC) and Ethereum (ETH) have been long-time competitors in the cryptocurrency space. However, with the recent launch of Ethereum 2.0, many have begun to wonder how the two compare.\n\nBitcoin, the world's first cryptocurrency, was created in 2009 and has been the market leader ever since. It was designed to be a decentralized currency, allowing users to send and receive payments without the need for intermediaries like banks or financial institutions. Bitcoin's primary use case has been as a store of value and a medium of exchange.\n\nEthereum, on the other hand, was created in 2015 as a decentralized platform for building decentralized applications (dApps). It introduced the concept of smart contracts, which are self-executing contracts with the terms of the agreement between buyer and seller being directly written into lines of code. This made it possible to build decentralized applications that could execute complex logic and automate processes without the need for intermediaries.\n\nWith the launch of Ethereum 2.0, the Ethereum network is undergoing a major upgrade. This upgrade aims to solve some of the scalability and security issues that have plagued the Ethereum network, making it more efficient and secure. Ethereum 2.0 introduces a new consensus algorithm called Proof of Stake (PoS), which replaces the existing Proof of Work (PoW) consensus algorithm.\n\nBitcoin, on the other hand, still uses the PoW consensus algorithm. This means that Bitcoin mining requires a massive amount of computing power, making it extremely energy-intensive. Bitcoin's transaction throughput is also limited by the block size and block time, which can lead to slow and expensive transactions during times of high demand.\n\nWith Ethereum 2.0, the network is expected to become much more scalable, with the ability to process thousands of transactions per second. This will make it more competitive with traditional payment systems and position it as a serious contender in the global financial system.\n\nHowever, Bitcoin still holds its position as the dominant cryptocurrency and the store of value of choice for many investors. Its fixed supply of 21 million BTC has led to its reputation as a \"digital gold,\" and its popularity has only increased in recent years with the rise of institutional adoption.\n\nOne of the biggest differences between Ethereum and Bitcoin is ETH’s ability to facilitate smart contracts. Smart contracts are self-executing contracts with the terms of the agreement between buyer and seller being directly written into lines of code. This allows for trustless transactions and eliminates the need for intermediaries. Bitcoin, on the other hand, is primarily used as a store of value and a means of exchange.\n\nIn terms of their respective communities, Bitcoin has a more established and passionate community of supporters, while Ethereum has a more diverse ecosystem of developers, users, and applications.\n\nIn conclusion, while both Bitcoin and Ethereum have their strengths and weaknesses, Ethereum 2.0's launch marks a significant step forward in the evolution of the cryptocurrency space. As the two continue to compete, it will be interesting to see how they develop and how they continue to shape the future of finance.\n\nConclusion\n\nEthereum 2.0 is a significant upgrade to the current Ethereum network that is intended to address scalability and security concerns. The Beacon Chain, Proof-of-Stake, and Sharding are key components of Ethereum 2.0, and each provides distinct advantages to the network.\n\nWhile Ethereum 2.0 has significant advantages over the current network, there are also implementation challenges, such as the transition from the current network and the possibility of centralization.\n\nDespite these obstacles, Ethereum 2.0 has the potential to revolutionize the blockchain industry and become the decentralized application and smart contract platform of choice."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vZGVjcnlwdC5jby8xMjQxMDAvbWFraW5nLWNyeXB0by13YWxsZXRzLXNtYXJ0ZXItZXRoZXJldW3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Mar 2023 07:00:00 GMT",
        "title": "Making Ethereum Wallets Smarter Is the Next Challenge—and Visa Is Among Those Working on It - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIt’s no secret that crypto wallets need a makeover, and fast. But as the pieces and players leading this makeover emerge, so too is a fight over what to call the effort.\n\nSome call it account abstraction, others call it EIP-4337.\n\n“We call it a smart wallet,\" Argent cofounder and CEO Itamar Lesuisse told Decrypt. \"It’s as simple as that.”\n\nAD\n\nAD\n\nArgent, along with Safe (formerly Gnosis Safe), is at the forefront of the account abstraction movement, making crypto wallets easier, and smarter, to use.\n\nThe story of account abstraction, or smart wallets, dates back as far as 2016 with Ethereum Improvement Proposal (EIP)-86, and there have been many other related EIPs along the way.\n\nIt's a movement that's attempting to change the current wallet standard, called Externally Owned Accounts (EOAs) like Metamask, to a smart contract-based one. Whenever you go about your crypto business, you currently need to sign your EOA wallet each and every time you execute a transaction. It's also risky, due to the unique demands of private key management.\n\nAccount abstraction provides far more flexibility for crypto wallets. Instead of individually signing 10 different transactions, for example, a smart contract wallet could batch all of these transactions into one click.\n\nThese new types of wallets could also mean adding features like recurring payments or, in the case of crypto, recovering lost private keys. Argent solved for this in 2018 with something called social recovery. Wallet users would tap friends or family members to help get back their wallets back should they lose the keys.\n\nAD\n\nAD\n\nLike the smartphone, Lesuisse and his team mean to bring crypto wallets out of the landline era and into the world of programmable money. Another analogy that the Argent chief uses is (ironically) when people first began moving the cash in their wallets into bank accounts.\n\n“Suddenly, there was a piece of software that could do stuff for us to make it easier to transfer or make it more secure,” he said.\n\nLike banking, smart wallets refer to just about anything that we can program our money and accounts to do without needing our intervention.\n\nVisa turns to smart wallets\n\nThe trend is also turning heads at payments giant Visa.\n\nIn a new deep dive report on self-custodial crypto wallets, Visa wrote that “Ethereum is designed for push payments” rather than the more intuitive and automated “pull payments.”\n\nThe former refers to manual payments made by the account holder and the latter to payments by which money leaves an account automatically, like auto-payments for student loans or paying your mortgage every month.\n\nSmart wallets would essentially usher in more of those programmable pull payments to crypto, and make it look a lot more like how we use money in the bank.\n\n“It's like blockchains took all these sensibilities away that we were fully expecting and using non-stop in the world. Blockchain sort of ripped off all that from the developer's toolbox,” StarkWare co-founder and CEO Uri Kolodny told Decrypt. “Account abstraction is saying, ‘guys, can we please have those very sensible tools back in our hands?’”\n\nAD\n\nAD\n\nKolodny’s team is behind StarkNet, a speedy layer-2 network built on Ethereum, and rolled out a wallet browser extension back in 2021 with Argent called Argent X.\n\nAs part of its tinkering in the smart wallet space, Visa also turned to the layer-2 solution to experiment with so-called delegable accounts.\n\n“The most beautiful thing about the Visa project is that we only became aware of it when they first posted their amazing research,” StarkWare co-founder and president Eli Ben-Sasson told Decrypt. “They looked around, and realized that they needed to start from a place both where they will have a global scale needed for their customer base and also has the account abstraction or, as we like to call it, smart wallets, out of the box.”\n\nA delegable account, per Visa’s research, would essentially integrate auto-payments into a crypto wallet and could come with a series of constraints, such as making the payments monthly or putting a limit on how much can be pulled from the wallet.\n\nBeyond the traditional use cases like those that Visa has in mind, smart wallets would also be supremely useful in the world of on-chain gaming.\n\n“If you play games, you probably wouldn't want to sign a transaction every five seconds, every time you are killing a player, winning new updates, and then paying for the transaction,” said Lesuisse. “With account abstraction, you can program what we call a ‘session key’ and say, ‘hey, I will let that game sign for me for the next hour.’”\n\nIt’s still early days, of course, and custodial wallets like Coinbase Wallet or the original crypto wallet MetaMask still dominate the space.\n\nBut as the idea of account abstraction (or simply smarter wallets) gains more attention among users as a viable alternative, the Web3 heavyweights could face some serious competition.\n\nAD\n\nAD"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL29wLWVkLXRoZS11bnNwb2tlbi1ldGhlcmV1bS1yZXZvbHV0aW9uLWFyZS1lb2FzLWJlY29taW5nLW9ic29sZXRlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Mar 2023 07:00:00 GMT",
        "title": "Op-ed: The unspoken Ethereum revolution: Are EOAs becoming obsolete? - CryptoSlate",
        "content": "Under the radar, one of the most significant changes to the Ethereum ecosystem has been announced with little to no community reaction. Account abstraction is a core advancement in web3 account management, but the current roadmap brings a new goal — to remove Externally Owned Accounts (EOAs) entirely from the Ethereum ecosystem.\n\nThe term account abstraction refers to the process of abstracting away the complexity of a web3 account to create a more user-friendly experience for the end user. Initially, the goal was to generalize the web3 account model so that all accounts are treated similarly — regardless of whether they are EOAs or smart contract accounts. However, the Ethereum Foundation appears to have decided that there is no room for EOAs in the ecosystem’s future, favoring smart contract wallets as the default account model for users.\n\nEIP-4337 & Account Abstraction\n\nSecurity Fellow for the Ethereum Foundation, Yoav Weiss, announced the launch of EIP-4337 while speaking at ETHDenver. The update to the Ethereum network upgrades the capabilities of smart contract wallets with elements of account abstraction, including decentralized bundlers, token fee payment, an alternative mempool, and other account abstraction features.\n\nEthereum co-founder Vitalik Buterin originally introduced the EIP in September 2021 when he shared a concept on the Ethereum message board with the following message:\n\n“An account abstraction proposal which completely avoids the need for consensus-layer protocol changes, instead relying on a separate mempool of UserOperation objects and miners running either custom code or a bundle marketplace.”\n\nHowever, one key aspect of EIP-4337 that has seemingly gone unnoticed by many is the move toward removing EOAs entirely. The documentation for the EIP on the Ethereum Foundation website states that a core motivation for the upgrade is to “completely remove any need at all for users to also have EOAs.”\n\n“Achieve the key goal of account abstraction: allow users to use smart contract wallets containing arbitrary verification logic instead of EOAs as their primary account. Completely remove any need at all for users to also have EOAs.”\n\nCryptoSlate reached out to several wallet providers, but none were willing to discuss the potential elimination of EOAs entirely, given the lack of timeframe from the Ethereum Foundation. As of press time, the Ethereum Foundation has not responded to attempts for comment.\n\nWhat is an EOA?\n\nAn EOA on Ethereum is a specific kind of account managed by a user who holds the private key, unlike a smart contract account. Essentially, an EOA serves as a user’s cryptographic identity on the Ethereum blockchain, enabling them to hold, send, and receive ETH, NFTs, or other tokens and interact with smart contracts.\n\nAn EOA is identified by a unique public address from its private key. Unlike a smart contract account, an EOA has no code or logic associated with it. However, it can still sign transactions to initiate transfers, deploy smart contracts, or interact with existing smart contracts on the Ethereum network.\n\nThe main distinction between an EOA and a smart contract account lies in their control. An EOA is managed by an external entity using a private key, while a smart contract account is controlled by the smart contract’s code and follows the rules specified within that code.\n\nDo we need EOAs?\n\nEOAs are the most tried and tested type of blockchain account. Popular software wallets such as MetaMask and hardware wallets like Ledger, Tezor, and SafePal are all founded in EOA accounts. Removing EOAs would dramatically impact such projects and require large-scale code updates.\n\nWhile the issue of onboarding new users into web3 — by requiring them to safely record and store a complex private key or long seed phrase — is a widely accepted problem, removing a core component of the Ethereum ecosystem poses a drastic solution to the problem.\n\nFurthermore, removing EOAs would bring countless potential issues that need to be addressed — including the loss of simplicity, increased complexity, higher transaction costs, compatibility issues, security concerns, EVM fragmentation, and even a potential decrease in adoption due to increased friction.\n\nI am not suggesting that all of the above issues are insurmountable. However, the path to removing EOAs will include problems that have yet to be conceived. Furthermore, as Ethereum sits at the heart of the web3 ecosystem, removing EOAs from the Ethereum network will likely lead to compatibility issues across the entire EVM landscape.\n\nProblems removing EOAs\n\nIn a bear market, it is easy to advocate for the use of smart contracts — which use, on average, more gas than EOAs due to the complex logic used in the execution of the code. As of press time, the cost of gas on Ethereum is 12 GWEI ($0.40), including the network base fee.\n\nThe chart below shows the change in the average gas price paid per transaction since the network was launched. Throughout the bull run 2021 – 2022, gas rose to a high of 305 GWEI and averaged around 120 GWEI, some ten times higher than it is now. Should EOAs be removed entirely, the cost of transacting on the Ethereum layer-1 blockchain network would almost certainly increase.\n\nHowever, the advancing progress of Ethereum scaling solutions — such as Polygon and dedicated industry-specific layer-2s like Immutable — will be even more vital to the network should transacting on the base layer become prohibitive.\n\nConcerning the other issues identified, the changing landscape of regulatory guidance also needs to be considered. Recently, the European Parliament passed an act on the Internet of Things (IoT) industry — requiring all smart contracts to contain a ‘kill switch’ and therefore include ‘proxy upgradeability.’ Article 30 of the legislation has the following requirement:\n\n“The deployment of smart contracts for others in the context of an agreement to make data available shall comply with the following essential requirements[…] Safe termination and interruption: ensure that a mechanism exists to terminate the continued execution of transactions: the smart contract shall include internal functions which can reset or instruct the contract to stop or interrupt the operation to avoid future (accidental) executions.”\n\nThis means that any smart contract wallet would have to contain a function that would allow the developer to remove the account — eliminating the self-sovereign nature of the account if this were implemented by anyone other than the account owner.\n\nFurthermore, if Ethereum moves away from EOAs entirely, any EVM chain would need to implement the same functionality — or risk losing compatibility with Ethereum Mainnet. The implementation across other chains would unlikely be synchronized, resulting in a fragmented ecosystem and potentially incompatible dApps.\n\nProjects that currently have full compatibility with multiple EVM chains could lose access to some networks during the transition.\n\nEOA Innovation\n\nSo why remove EOAs? The Ethereum Foundation appears to have given up the potential to innovate in the EOA space with the call to remove EOAs entirely. However, I advised a project called Intu in 2022 that is doing precisely this, and it is unlikely to be the only one. For total transparency, I was paid for my time advising the project, but I have no incentive for Intu to succeed other than believing in the team’s vision.\n\nThe point of this article is not to shill any solution or create FUD within the Ethereum ecosystem. Instead, I wish to raise awareness for this problem and facilitate debate and coordination within the space.\n\nI do not believe we should have statements from the Ethereum Foundation declaring the removal of EOAs without there first being a proper public process. Such a process would ensure that EOAs need to be removed, what the timeframe looks like, and how all potential security, compatibility, and usability issues would be solved prior to the transition.\n\nIt is also critical to emphasize that the removal of EOAs is not confirmed. Ethereum is a decentralized ecosystem without any centralized controlling party. However, the Ethereum Foundation holds a lot of sway within the developer community. Therefore, I believe it’s important to continue this conversation for the health of the ecosystem.\n\nI understand the Ethereum Foundation’s point of view. I simply wish for the conversation to be more openly held to ensure we move toward account abstraction with our eyes fully open. As Paul Saffo so wisely said, “Strong convictions, weakly held.”\n\nMentioned in this article"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vaGFja2Vybm9vbi5jb20vY3JlYXRpbmctYS1zaW1wbGUtZGVmaS1wcm90b2NvbC1vbi1ldGhlcmV1bS13aXRoLWhhcmRoYXQtYS1zdGVwLWJ5LXN0ZXAtZ3VpZGXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Mar 2023 07:00:00 GMT",
        "title": "Creating a Simple DeFi Protocol on Ethereum with Hardhat: A Step-by-Step Guide - hackernoon.com",
        "content": "440 reads\n\nCreating a Simple DeFi Protocol on Ethereum with Hardhat: A Step-by-Step Guide\n\nMarch 22nd 2023 6 m by @ luisacerv 440 reads"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzAzLzIyLzYtZXRoZXJldW0tYWx0Y29pbnMtdGFyZ2V0ZWQtYnktc2VjLWFoZWFkLW9mLWNvaW5iYXNlLXdlbGxzLW5vdGljZS_SAWhodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMy8yMi82LWV0aGVyZXVtLWFsdGNvaW5zLXRhcmdldGVkLWJ5LXNlYy1haGVhZC1vZi1jb2luYmFzZS13ZWxscy1ub3RpY2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Mar 2023 07:00:00 GMT",
        "title": "6 Ethereum Altcoins Targeted By SEC Ahead of Coinbase Wells Notice - The Daily Hodl",
        "content": "The U.S. Securities and Exchange Commission has specifically targeted several Ethereum-based altcoins on Coinbase before sending today’s Wells Notice to the leading crypto exchange.\n\nBack in July, in its insider trading case against a former Coinbase employee, the SEC called out nine crypto assets that it believes are securities – and six of those assets remain on the exchange today.\n\nThe coins in question are Amp (AMP), LCX (LCX), Power Ledger (POWR), Rally (RLY), XYO Network (XYO) and DerivaDAO (DDX).\n\nAt the time, Coinbase strongly rejected the claim that the above crypto assets are securities, citing its “rigorous” and “SEC-reviewed” process for determining which assets are listed on the exchange.\n\nToday, the SEC sent a Wells Notice to Coinbase, asserting the agency has made a preliminary determination that recommends the agency file an enforcement action against Coinbase.\n\nCoinbase says the notice targets an “undefined portion” of its listed digital assets, as well as the company’s staking service Coinbase Earn, its institutional arm Coinbase Prime, and its non-custodial Coinbase Wallet.\n\nThe exchange says it welcomes the opportunity to defend its products in court if need be, and notes it continues to operate as usual on all fronts.\n\nThe news comes amid a volatile day for Bitcoin and the crypto markets following a fresh quarter point rate hike from the Federal Reserve.\n\nBitcoin (BTC) is trading at $27,397 at time of publishing, down 2.7% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/GrandeDuc"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDMvMjIvbGF0ZXN0LWV0aGVyZXVtLWJsb2Nrcy1zdWdnZXN0LXZhbGlkYXRvcnMtYXJlLXJldmVyc2luZy1jZW5zb3JzaGlwL9IBcGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDMvMjIvbGF0ZXN0LWV0aGVyZXVtLWJsb2Nrcy1zdWdnZXN0LXZhbGlkYXRvcnMtYXJlLXJldmVyc2luZy1jZW5zb3JzaGlwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Mar 2023 07:00:00 GMT",
        "title": "Latest Ethereum Blocks Suggest Validators Are Reversing Censorship - CoinDesk",
        "content": "According to the site MEV Watch, during the past weekend and into the beginning of this week, roughly one in three blocks that made it onto the Ethereum blockchain was OFAC compliant. This means that about 30% of blocks excluded transactions sanctioned by the OFAC, including Tornado Cash."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1mYWNlcy02LW1vbnRoLWxvd3MtdmVyc3VzLWJpdGNvaW4td2lsbC1ldGgtcHJpY2UtcmVib3VuZNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Mar 2023 07:00:00 GMT",
        "title": "Ethereum faces 6-month lows versus Bitcoin — Will ETH price rebound? - Cointelegraph",
        "content": "Ethereum’s native token, Ether (ETH), continues its multimonth downtrend against Bitcoin (BTC) in March, rising 5.5% versus the latter’s 19.5% gains on a month-to-date timeframe.\n\nBitcoin overshadows Ethereum amid banking crisis\n\nAs of March 23, the ETH/BTC pair was down about 9% month-to-date to 0.0633 while staying on course to record its worst month since September 2022, when it fell 11.75%.\n\nETH/BTC monthly price chart. Source: TradingView\n\nFrom a fundamental perspective, traders preferred Bitcoin over Ether, hoping it would protect them from the ongoing banking turmoil in the U.S. and other parts of the world. The narrative gained momentum in recent weeks as Wall Street investors like Cathie Wood see Bitcoin as a potential “flight to safety” asset.\n\n‼️CATHIE WOOD: #Bitcoin's response to the banking crisis is the most dramatic example that innovation solves problems. #Bitcoin was a flight to safety. pic.twitter.com/1lTD2Drto3 — Bitcoin Archive (@BTC_Archive) March 21, 2023\n\nAs a result of the growing speculation, Bitcoin outperformed traditional assets after March 8, when signs of trouble appeared at Silicon Valley Bank. In doing so, BTC also fared better than the altcoin market combined, including Ethereum.\n\nBitcoin, S&P 500, gold and altcoin market performances in March. Source: TradingView\n\nETH paints bullish fractal vs. BTC\n\nHowever, from a technical perspective, Ethereum is positioned for a comeback versus Bitcoin.\n\nAt least two technical indicators pose the possibility that ETH/BTC will rebound sharply in the coming weeks.\n\nRelated: Ethereum price at $1.4K was a bargain, and a rally toward $2K looks like the next step\n\nFirst, the pair’s three-day relative strength index has dropped below 30, which technical analysts consider an “oversold” area.\n\nSecond, Ether’s drop versus Bitcoin has landed its price near its ascending support level (buy zone in the chart below).\n\nETH/BTC three-day price chart. Source: TradingView\n\nA similar scenario in the June–July 2022 session preceded an approximately 60% rally toward ETH/BTC’s descending trendline resistance (sell zone in the chart above). If the fractal plays out, the pair could rally toward the same resistance level by June 2023.\n\nIn other words, Ether has a decent chance of rebounding by more than 15% to around 0.075 BTC. Conversely, a break below the ascending trendline support will invalidate the bullish fractal.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmNuYmMuY29tL3ZpZGVvLzIwMjMvMDMvMjMvZXRoZXJldW0tY28tZm91bmRlci1zYXlzLWV0aGVyLWlzLW5vdC1hLXNlY3VyaXR5Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Mar 2023 07:00:00 GMT",
        "title": "Ethereum co-founder says ether is not a security - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nEthereum co-founder says ether is not a security\n\nJoseph Lubin, co-founder of the Ethereum Foundation, discusses the crypto market environment, regulators' crackdown on the space, and the hotly contested debate over whether ether should be classed as a security."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZGVjcnlwdC5jby8xMjQzNzIvYXJiaXRydW0tdHJhbnNhY3Rpb24tYWN0aXZpdHktb3V0cGFjZXMtZXRoZXJldW0tYXJiLWFpcmRyb3DSAVtodHRwczovL2RlY3J5cHQuY28vMTI0MzcyL2FyYml0cnVtLXRyYW5zYWN0aW9uLWFjdGl2aXR5LW91dHBhY2VzLWV0aGVyZXVtLWFyYi1haXJkcm9wP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Mar 2023 07:00:00 GMT",
        "title": "Arbitrum Transaction Activity Outpaces Ethereum Ahead of ARB Airdrop - Decrypt",
        "content": "Create an account to save your articles.\n\nCreate an account to save your articles.\n\nYour Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nArbitrum, a layer-2 rollup on Ethereum, has hit an all-time high in daily transactions and unique wallets interacting with the network ahead of its airdrop.\n\nDune analytics show that close to 240,000 unique wallets interacted with Arbitrum on March 21, nearly twice its previous peak in February 2023.\n\nOn March 21 and March 22, the network hosted roughly 1.66 million and 1.56 million transactions, respectively.\n\nAD\n\nAD\n\nOver those same two days, there were also more transactions on Arbitrum than on the Ethereum mainnet. Etherscan reports that Ethereum hosted just over 1 million transactions each day.\n\nIt’s likely these metrics will continue to surge after users can begin claiming their airdropped tokens. There are more than 625,000 eligible addresses.\n\nNumber of daily active wallets interacting with the Arbitrum Network. Source: Dune\n\nArbitrum first announced the launch of its along with an airdrop of ARB governance tokens to early users and developers on March 16.\n\nThe airdrop is slated for 9 am EST today, with a live countdown appearing on Arbitrum’s site.\n\nFollowing the airdrop announcement last week, the network also saw a massive spike in its DeFi liquidity. The total deposits on DeFi platforms on Arbitrum reached a new peak of nearly $2 billion, per DeFi Llama.\n\nAD\n\nAD\n\nThe layer-2 network is ranked fourth in DeFi liquidity after Ethereum, Binance Chain, and Tron.\n\nThe total value locked in DeFi applications on Arbitrum. Source: DefiLlama\n\nARB derivatives on the rise\n\nThe futures contract for the ARB token started trading on BitMEX on March 20. The contract last traded for $1.38, aligning with the popular ARB token market estimations.\n\nThe peak exchange price of ARB futures on BitMEX was $1.5.\n\nTop crypto exchanges in Binance, Bybit, BitMEX, Kucoin, and many others will enable trading on the platforms right at launch time to benefit from the trading volumes that the token will bring.\n\nAnalysts expect the ARB token to rake in over $1 billion in trading volume on launch day."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiL2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2FyYml0cnVtLWFpcmRyb3AtZmFx0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Mar 2023 07:00:00 GMT",
        "title": "Arbitrum Airdrop: What You Need To Know About This Ethereum Layer-2 - Blockworks",
        "content": "The Arbitrum ARB governance token airdrop is one day away and will mark the beginning of its transition into decentralization.\n\nPrior to its token launch, the Ethereum layer-2 network had been governed by New York startup Offchain Labs — the developer behind the protocol.\n\nArbitrum is an optimistic rollup scaling solution on Ethereum. Scaling solutions are designed to ease congestion and prices of gas fees on the Ethereum network.\n\nRather than executing a transaction on Ethereum, the transaction is instead sent to Arbitrum, whose throughput capacity is seven to 10 times greater than that of Ethereum.\n\nFollowing Arbitrum’s Nitro upgrade, there has been an uptick in transactions on-chain, recently overtaking Ethereum in daily transactions.\n\nThere’s currently $2 billion locked inside Arbitrum-powered protocols compared to Optimism’s $1 billion, per DeFiLlama. Decentralized derivatives platform GMX and exchange Uniswap command the most value. Ethereum native dapps Aave and Curve have also launched on the network, among others.\n\nRising usage only amplifies the need for decentralization. According to Blockworks Research, ARB will allow for decentralized governance over the Arbitrum protocol, similar to Optimism’s OP token.\n\nARB holders will vote on all aspects of the protocol including upgrades, inflation adjustments, as well as capital allocations (including grants).\n\nAlmost 12% of the total airdrop supply will be distributed to Arbitrum users and a tad over 1% of will be given to DAOs building on top of the network.\n\n43% to the Arbitrum DAO treasury overseen by the protocol’s community governance.\n\n27% to the Offchain Labs team and future advisers.\n\n17.5% to Offchain Labs investors.\n\nA security council will also be established to make swift decisions when a normal governance process may be too slow.\n\n“The security council, while removing some element of decentralization, is meant as a backstop in case of emergencies,” Blockworks Research said. “Since Arbitrum, and rollups in general, are still in their infancy it’s not enough to say they are truly 100% secure especially as new upgrades get added.”\n\nToken holders will elect two groups of six security council members (totaling 12) every six months, each who will have private keys to a multsig that will control the protocol’s primary smart contract.\n\nAn eligible candidate for the council must be a member of the DAO and receive support from 0.2% of votable tokens. Chosen members will receive a $5,000 stipend in the form of ARB tokens.\n\nHow much trust is baked into Arbitrum?\n\nMain trust concerns around Arbitrum are in its state validation and upgradability. Arbitrum did not respond to Blockworks’ request for comment.\n\nState validation refers to the proofs used or how the network decides which transactions (network state) are valid.\n\n“In Arbitrum’s case, they have fraud proofs enabled, but only by whitelisted validators and used interactive proofs which take many transactions to solve,” Blockworks Research said.\n\nAlthough enabling fraud proofs is much better than having none at all — as in the case of Arbitrum’s competitor Optimism — it would be more ideal to have permissionless proofs.\n\nAnother risk is the upgradability of Arbiturm’s smart contract, as seen with Jump Crypto’s counter-exploit of the Wormhole hacker last month. A smart contract is considered to be most secure if it can not be upgraded, which is not the case for both Arbitrum and Optimism.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9tZXRhbWFzay1pbnN0aXR1dGlvbmFsLXVubG9ja3Mtc29sby1ldGgtc3Rha2luZy1tYXJrZXRwbGFjZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Mar 2023 07:00:00 GMT",
        "title": "MetaMask Institutional unlocks solo ETH staking marketplace - Cointelegraph",
        "content": "MetaMask Institutional is set to be an avenue for the creation of new Ethereum validators after announcing a new staking marketplace for its institutional clients.\n\nInstitutions that make use of MetaMask’s institutional-grade wallet and custody service will be able to manage Ether (ETH) staking through four vendors — ConsenSys Staking, Allnodes, Blockdaemon and Kiln. The marketplace aims to simplify access and management of solo staking, allowing institutions to become Ethereum network validators.\n\nMetaMask Institutional (MMI) has been live since October 2021, providing a platform that offers a wider set of controls and functionality more suited to organizations and businesses. As Cointelegraph previously explored, MetaMask’s retail wallet was no longer suited for users or institutions that were managing millions of dollars in cryptocurrencies.\n\nThe service’s new staking marketplace will look to simplify the complexity of institutional staking, which features varying fees, terms and conditions, rebates and reporting standards.\n\nJohann Bornman, MMI product lead at ConsenSys, told Cointelegraph that the firm had seen a shift from liquid staking to 32-ETH staking, which he believes is not only driven by Ethereum’s Merge upgrade in 2022 but the looming Shanghai/Capella upgrade.\n\nShanghai will unlock deposit withdrawals for Ethereum validators, allowing solo stakers who have staked the required 32 ETH to withdraw their tokens and have access to accrued staking rewards. Up until this point, only liquidity provider pools allowed users to deposit and withdraw smaller amounts of ETH.\n\nRelated: ‘Multichain future is very clear’ — MetaMask to support all tokens via Snaps\n\nBornman said the upgrade has the potential to prove the “rewards profile and time horizon” for staking ETH, which influences confidence in Ethereum staking:\n\n“We believe this staking rate has the potential to increase rapidly in the ensuing years. Over the near term, we have seen a marked increase in Eth2 staking by institutions over the last several months, and this trend will only continue, given the recent upgrade.”\n\nAs a result, MetaMask Institutional rolled out its staking marketplace to provide institutions with a direct avenue to becoming Ethereum validators by staking 32 ETH.\n\n“Our focus is to solve for Eth2 staking, given how important we believe data validation of Ethereum is today and will be in the future. We have designed the service to be able to simply and seamlessly expand onto on-chain ETH staking solutions.”\n\nThe launch of the staking marketplace will coincide with the roll-out of an advanced MMI dashboard, including institutional controls, portfolio management, digital asset monitoring with built-in profit-and-loss and performance analytics as well as transaction reporting.\n\nMetaMask Institutional rolled out access to ETH LP pool staking through the popular Lido and Rocket Pool protocols in January 2023, giving institutions initial access to decentralized finance (DeFi) pool staking.\n\nMagazine: ‘Account abstraction’ supercharges Ethereum wallets: Dummies guide"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9sZWFybi93aGF0cy10aGUtcG9pbnQtb2Ytc3RhYmxlY29pbnMtdW5kZXJzdGFuZGluZy13aHktdGhleS1leGlzdC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Mar 2023 07:00:00 GMT",
        "title": "What's the Point of Stablecoins? The Reasons, Risks and Types to Know - CoinDesk",
        "content": "You can think of an algorithmic stablecoin as a bucket of water left outside with a water level marked on the inside. To keep the water inside the bucket at exactly the same level, you set up a mechanism that adds or removes water depending on how far the water level has deviated from the mark. This is controlled by a computer algorithm such that if it rains and the bucket begins to fill up, the algorithm instructs the mechanism to release water out of the bottom of the bucket until it reaches the water level mark. Conversely, if it’s a hot day and water evaporates out of the bucket, the computer algorithm would instruct the mechanism to add more water to the bucket until the correct level is regained."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1wcmljZS1hdC0xLTRrLXdhcy1hLWJhcmdhaW4tYW5kLWEtcmFsbHktdG93YXJkLTJrLWxvb2tzLWxpa2UtdGhlLW5leHQtc3RlcNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Mar 2023 07:00:00 GMT",
        "title": "Ether price at $1.4K was a bargain, and a rally toward $2K looks like the next step - Cointelegraph",
        "content": "Ether's (ETH) price reached $1,400 on March 10, which proved to be a bargain as the cryptocurrency rallied 27.1% until March 21. However, the three reasons that supported the price gain, including correlation with tech stocks, its increasing total value locked and its deflationary token economics, all suggest that the path to $2,000 is set in stone.\n\nThere are numerous explanations for Ether's 19.4% decline over the past six months. Ethereum's Shanghai hard fork upgrade was delayed from March to early April and after Shanghai, Ethereum's roadmap includes the “Surge” “Verge,” “Purge,” and “Splurge” updates. In reality, the longer these intermediate steps to achieve scalability take, the greater the likelihood that competing networks will demonstrate efficacy and possibly establish a competitive advantage.\n\nAnother potentially concerning issue on the minds of investors is the real chance of price impact when validators are finally able to unlock their 32 ETH deposits following the completion of the Shapella hard fork. While it is impossible to predict how many of the 16 million ETH currently staked on the Beacon Chain will be sold on the market. There is a compelling argument in favor of the transition to liquid staking platforms, as they can use liquid staking derivatives on other decentralized finance networks without sacrificing their staking yield.\n\nTraders could construct a narrative based on regulatory uncertainty, especially after U.S. Securities and Exchange Commission (SEC) Chairman Gary Gensler's September 2022 statement that proof-of-stake cryptocurrencies could be subject to securities laws. In February 2023, the SEC reached an agreement compelling the cryptocurrency exchange Kraken to cease offering crypto staking services to U.S.-based clients, and the exchange also paid $30 million in disgorgement.\n\nCorrelation versus application-focused tech companies\n\nTo understand why Ether gained 15% in less than three days after briefly trading below $1,400 on March 10, traders must switch from a price-based analysis to a market capitalization comparison. On March 10, Ethereum’s market cap closed at $175 billion.\n\nOracle, SAP, and Salesforce are similar to Ethereum in that their software enables users to access shared computing resources. This is in contrast to chipmakers Nvidia and TSMC, infrastructure providers Microsoft and Oracle, and technology companies Apple and Cisco that all heavily rely on equipment.\n\nETH vs. Oracle (ORCL), SAP (SAP), Salesforce (CRM). Source: TradingView\n\nThe market capitalizations of Oracle, Salesforce and SAP are comparable to Ether's at $233 billion, $188 billion and $149 billion, respectively. Ultimately, centralized and decentralized solutions permit businesses to integrate their proprietary software so that all third parties and relevant departments can consult, process, share and store data.\n\nConsidering the past six months of data, Ether's price has performed similarly to those companies. The drop below $1,400 on March 10 was illogical if the correlation between application-focused tech stocks and the price of Ether remains valid.\n\nETH’s total value locked sticks at $30 billion\n\nThe total value locked (TVL) of the Ethereum network was $24 billion on November 24, 2022, and increased by 30% to $30 billion by March 21, 2023. Therefore, if no other factors influence the price, one could anticipate a 30% price increase during that six-month period. Except, that was not the case on March 10, when Ether traded at $1,400, representing a mere 8% increase from six months prior and indicating a disconnect between the value deposited in the network's smart contracts and the ETH price.\n\nThis 22% difference between the 30% increase in TVL and the 8% increase in ETH price indicated that Ether's true value should have been near $1,700, a level that was reached three days later on March 13, 2023. This simple model excludes a number of variables that influence supply and demand and the resulting price level, but it does provide an indication based on historical data.\n\nRelated: Coinbase submits petition to SEC explaining that staking is not securities\n\nEther's deflationary mechanism is in full force\n\nOn November 10, 2021, the price of Ether was $4,869, a record high for the cryptocurrency. However, a great deal has changed since then, including the burning of 3,016,607 ETH via Ethereum Improvement Proposal 1559. This equates to an additional $5.4 billion in capitalization that would have otherwise been created, thereby adding to the supply side and restraining price appreciation.\n\nCurrently, market leader Bitcoin (BTC) is trading down 59% from its $69,000 all-time high. That does not necessarily mean Ether should reduce the gap versus Bitcoin, but it shows how discounted ETH currently stands at $1,780. The deflationary standard paves the way for Ether’s perception as a scarce digital asset, which is particularly promising during inflationary periods in the global economy.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbmdhcGUuY29tL29uLWNoYWluLW1ldHJpY3MtaW5kaWNhdGUtcG90ZW50aWFsLWNvcnJlY3Rpb24taW4tYml0Y29pbi1ldGhlcmV1bS1wcmljZS_SAWJodHRwczovL2NvaW5nYXBlLmNvbS9vbi1jaGFpbi1tZXRyaWNzLWluZGljYXRlLXBvdGVudGlhbC1jb3JyZWN0aW9uLWluLWJpdGNvaW4tZXRoZXJldW0tcHJpY2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Mar 2023 07:00:00 GMT",
        "title": "On-Chain Metrics Indicate Potential Correction In Bitcoin, Ethereum Price - CoinGape",
        "content": "The U.S. Federal Reserve is expected to raise the fed funds rate by 25bps to 4.75%-5% during the FOMC meeting on Wednesday. It will be the second consecutive 25bps rate hike, pushing borrowing costs to new highs since 2007. Traders anticipate a further increase in Bitcoin and Ethereum prices due to the banking crisis.\n\nBillionaires Elon Musk and Bill Ackman, economists, and investors believe the central bank should pause the monetary tightening to bring financial stability after the collapse of three US banks and the takeover of Credit Suisse. Investors must keep a close watch on new economic forecasts and dot plot possible further rate hikes this year.\n\nadvertisement\n\nOn-Chain Data Indicating Potential Correction in Bitcoin Price\n\nBitcoin is in the early bull market cycle and the recent rally above $28,000 clearly proves it. Moreover, on-chain indicators such as CryptoQuant’s On-chain P&L Index and inter-exchange flows indicated a bullish Bitcoin narrative.\n\nThe Bitcoin Bull/Bear Market Cycle metric indicates a possibility of a price correction as it reaches near the Overheated Bull area. Thus, investors must exercise caution due to the sudden increase in Bitcoin price in a considerably short period.\n\nThe Bitcoin Short-Term Holders SOPR metric has jumped above 1.5. It indicates investors are booking profits at a remarkable profit margin of 7.6%. It is the highest since November 2021, when Bitcoin was trading at $64K. Typically, values over ‘1’ indicate more short-term investors are selling at a profit.\n\nBitcoin Exchange Inflow metric indicates a significant increase in Bitcoin inflows into crypto exchanges as the BTC price rallied above $28,000, reaching the highest levels in 2023. Generally, a high value indicates higher selling pressure in the spot exchange. Thus, a correction in Bitcoin price is expected.\n\nThe Bitcoin Miner to Exchange Flow metric shows that miners have been contributing to these inflows amid the banking crisis, especially after the shut down of crypto-friendly Silicon Valley Bank. The miner reserves have fallen again in March after selloff in January.\n\nBitcoin Exchange Inflow – Spent Output Value Bands (%) metric indicates massive whale activity. A considerable proportion (33%) of Bitcoin flowing into exchanges has been from whales. This suggests that whales have been dominating exchange inflows recently.\n\nEthereum Price Correction\n\nMeanwhile, Ethereum Exchange Inflow indicates possible ETH price correction and other on-chain metrics remain mixed. ETH price is expected to witness selling pressure amid the Shanghai upgrade and Bitcoin downfall.\n\nSome analysts predicted a move toward $2000 in the short-term, but will continue to face resistance near the psychological level.\n\nAlso Read: Bitcoin Price Set For $35,000 After US Fed Rate Hike Decision: Bloomberg"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzAzLzIyL3BvbHlnb24tdGVhbXMtdXAtd2l0aC1ldGhlcmV1bS1iYXNlZC1jcnlwdG8tcHJvamVjdC10by1jcmVhdGUtYmxvY2tjaGFpbi1kZWRpY2F0ZWQtdG8tZ2FtaW5nL9IBggFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMy8yMi9wb2x5Z29uLXRlYW1zLXVwLXdpdGgtZXRoZXJldW0tYmFzZWQtY3J5cHRvLXByb2plY3QtdG8tY3JlYXRlLWJsb2NrY2hhaW4tZGVkaWNhdGVkLXRvLWdhbWluZy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Mar 2023 07:00:00 GMT",
        "title": "Polygon Teams Up With Ethereum-Based Crypto Project To Create Blockchain Dedicated to Gaming - The Daily Hodl",
        "content": "Blockchain scaling solution Polygon (MATIC) is teaming up with the Ethereum (ETH)-based gaming project Immutable (IMX) to build a blockchain focused on gaming.\n\nThe project, titled Immutable zkEVM, is a zero-knowledge (ZK) roll-up that is “slated for launch in the coming months,” according to a new Polygon press release.\n\nSays Robbie Ferguson, Immutable president and co-founder,\n\n“By combining the #1 web3 gaming platform – currently serving hundreds of game studios and millions of players – with Polygon’s best-in-class zkEVM technology, we are building an Ethereum-centric gaming ecosystem that is poised to take Web3 mainstream and bring digital ownership to millions of people around the world.”\n\nThe blockchain gaming industry represented 49% of all daily blockchain activity last year, according to a report from DappRadar. The data acquisition and analysis firm also notes that the blockchain gaming transaction count increased by 94.17% in 2022 compared to the previous year.\n\nImmutable’s native token, IMX, will be used as the gas currency for Immutable zkEVM. The 52nd-ranked crypto asset by market cap is down more than 2% in the past 24 hours. IMX is trading at $1.25 at time of writing.\n\nPolygon’s native token, MATIC, is trading at $1.15 at time of writing. The 10th-ranked crypto asset by market cap is up nearly 2% in the past 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvY29uc2Vuc3lzLWxhdW5jaGVzLWZpcnN0LWluc3RpdHV0aW9uYWwtc3Rha2luZy1tYXJrZXRwbGFjZS_SAW5odHRwczovL3d3dy5maW5hbmNlbWFnbmF0ZXMuY29tL2NyeXB0b2N1cnJlbmN5L2NvbnNlbnN5cy1sYXVuY2hlcy1maXJzdC1pbnN0aXR1dGlvbmFsLXN0YWtpbmctbWFya2V0cGxhY2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Mar 2023 07:00:00 GMT",
        "title": "ConsenSys Launches First Institutional Staking Marketplace - Finance Magnates",
        "content": "ConsenSys, an Ethereum and decentralized protocols software company, has launched what it called the first marketplace for institutional cryptocurrency staking Staking Staking is defined as the process of holding funds in a cryptocurrency wallet to support the operations of a blockchain network. In particular, staking represents a bid to secure a volume of crypto to receive rewards. In most case however, this process relies on users participating in blockchain-related activities via a personal crypto wallet.The concept of staking is also closely tied to the Proof-of-Stake (PoS). PoS is a type of consensus algorithm in which a blockchain network aims to achieve Staking is defined as the process of holding funds in a cryptocurrency wallet to support the operations of a blockchain network. In particular, staking represents a bid to secure a volume of crypto to receive rewards. In most case however, this process relies on users participating in blockchain-related activities via a personal crypto wallet.The concept of staking is also closely tied to the Proof-of-Stake (PoS). PoS is a type of consensus algorithm in which a blockchain network aims to achieve Read this Term. The marketplace was launched under MetaMask Institutional, the multi-custodial institutional web3 wallet developed by ConsenSys.\n\nConsenSys disclosed in a blog update published on Wednesday noted that the marketplace was launched in partnership with non-custodian staking and blockchain node infrastructure provider, Allnodes, blockchain infrastructure firm, Blockdaemon, and enterprise-grade staking platform, Kiln. The institutional staking marketplace is supported by ConsenSys Staking, the software company’s technology for staking.\n\nIn addition, ConsenSys noted that the marketplace has been integrated with 11 custody and self-custody platforms across the world in order to provide institutional investors with “seamless and unrivalled access to staking providers.”\n\nConsenSys Seeks to Break Barriers to Institutional Staking\n\nSpeaking on its motive for introducing MetaMask Institutional, ConsenSys explained that institutional investors have been discouraged from participating in stalking as a result of varying fees, terms and conditions, rebates and reporting standards offered by vendors. On top of that, various staking service providers offer different benefits to institutions in areas such as infrastructure and certification, among others. However, the company says its marketplace was designed to address these issues.\n\n“MetaMask Institutional’s staking marketplace will reduce this complexity by streamlining access to top-tier staking providers; offering standardized terms and conditions, institutional-grade reporting; and a simplified staking experience — to facilitate broader institutional web3 participation,” ConsenSys explained.\n\nFurthermore, ConsenSys noted its plans to launch features, such as institutional controls, portfolio management and digital asset monitoring on its MetaMask Web3 Portfolio dashboard on March 27th.\n\nConsenSys Eyes Upcoming Shanghai Upgrade\n\nAccording to ConsenSys, the Ethereum Merge which happened in September last year shot up the total amount of staked Ether (ETH) on the Ethereum Ethereum Ethereum is an open source, blockchain-based distributed computing platform and operating system featuring smart contract functionality. Created in 2014, Ethereum now stands as the second largest cryptocurrency by market cap at the time of writing.As a decentralized cryptocurrency network and software platform, Ethereum represents the most prominent altcoin. Ethereum also enables the creation Distributed Applications, or dapps. Understanding EthereumEthereum boasts its own programming language, Ethereum is an open source, blockchain-based distributed computing platform and operating system featuring smart contract functionality. Created in 2014, Ethereum now stands as the second largest cryptocurrency by market cap at the time of writing.As a decentralized cryptocurrency network and software platform, Ethereum represents the most prominent altcoin. Ethereum also enables the creation Distributed Applications, or dapps. Understanding EthereumEthereum boasts its own programming language, Read this Term Blockchain by four million. Currently, the number stands at 17.7 million, the software company noted. The Merge moved the Ethereum blockchain from a Proof-of-Work to a Proof-of-Stake system.\n\nConsenSys believes that the Shanghai upgrade to the decentralized, open-source blockchain expected sometime this month or next month can boost institutional participation in Ethereum staking. Industry stakeholders expected the upgrade or hard fork to enable ETH holders to un-stake their assets for the first time. This upgrade “will offer greater flexibility and control over assets,” ConsenSys noted."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vYW1iY3J5cHRvLmNvbS93aWxsLWV0aGVyZXVtLWV0aC1mb2xsb3ctYml0Y29pbnMtYnRjLWxlYWQtYXMtdGhlLW1hcmtldC1yYWxsaWVzL9IBW2h0dHBzOi8vYW1iY3J5cHRvLmNvbS93aWxsLWV0aGVyZXVtLWV0aC1mb2xsb3ctYml0Y29pbnMtYnRjLWxlYWQtYXMtdGhlLW1hcmtldC1yYWxsaWVzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Mar 2023 07:00:00 GMT",
        "title": "Will Ethereum [ETH] follow Bitcoin’s [BTC] lead as the market rallies? - AMBCrypto News",
        "content": "Analyst suggested that Ethereum could soon follow Bitcoin’s rally.\n\nNFT trades and lowering gas fees may impact network activity in the long run.\n\nBitcoin [BTC] has been seeing quite a rally over the last few days, inspiring a lot of positive speculation around the king coin. However, it appears that Ethereum [ETH] will also soon be joining the rally and see a surge in its prices.\n\nIs your portfolio green? Check out the Ethereum Profit Calculator\n\nWhere BTC goes ETH follows?\n\nAccording to analyst crypto sunmoon on CryptoQuant, the drop in prices of Bitcoin and Ethereum from 9 – 13 March resulted in a swift decrease in exchange reserves. It is possible that investors took advantage of the situation by depositing more Bitcoin into exchanges than they purchased during the subsequent rebound.\n\nIn comparison to Bitcoin, Ethereum has not experienced a significant surge and the number of withdrawals has remained low. However, sunmoon believes that once Bitcoin’s upward trend is fully realized, there may be a substantial increase in Ethereum’s value.\n\nAnother positive indicator for Ethereum would be the rising number of addresses on the network. According to Glassnode’s data, addresses holding more than 0.01 of ETH have reached an eight-month high.\n\nHowever, the overall activity on the network could soon slow down. This would be because of the falling NFT trades on the Ethereum network. This suggested that users were losing interest in Ethereum-based NFTs.\n\nAnother indicator of the same would be the falling gas usage, implying that the activity on the Ethereum network has fallen.\n\nEven though ETH NFT interest has started to decline, Open Interest had started to surge at press time.\n\nAs the Shanghai Upgrade approaches, many traders would be interested in making bets on the future of Ethereum. However, it is important to note that high Open Interest also implies that there could be high volatility in the future.\n\n? #Ethereum $ETH Futures Contracts Open Interest just reached a 6-month high of $625,263,663 on #Deribit Previous 6-month high of $623,061,491 was observed on 20 March 2023 View metric:https://t.co/uXJN8QUW5D pic.twitter.com/LduET6sFll — glassnode alerts (@glassnodealerts) March 21, 2023\n\n________________________________________________________________________________________________\n\nRealistic or not, here’s ETH’s market cap in BTC\n\n________________________________________________________________________________________________\n\nAt press time, the trader sentiment is mostly bearish. This can be seen through Coinglass’ data, which showcases that short positions against Ethereum increased over the last few days."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9hcmJpdHJ1bS1haW1zLXRvLWVtcG93ZXItaXRzLWNvbW11bml0eS10aHJvdWdoLWdvdmVybmFuY2UtdG9rZW4tbGF1bmNo0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Mar 2023 07:00:00 GMT",
        "title": "Arbitrum aims to empower its community through governance token launch - Cointelegraph",
        "content": "It’s official — there’s a new Layer-2 token on the block.\n\nArbitrum, a leading contender in the field of Layer-2 scaling solutions for Ethereum (ETH) has recently unveiled the launch and airdrop of its native governance token, ARB.\n\nSince its launch in 2021, the network has become one of the largest projects without a token, fueling excitement and anticipation for its impending launch.\n\nARB to drive Arbitrum governance\n\nArbitrum is an Optimistic Rollup solution that shifts network operations away from the Ethereum mainnet while still maintaining Ethereum-level security. It runs on its own blockchain and allows developers to deploy smart contracts that can process a higher number of transactions per second, thus lowering overall fees.\n\nAccording to the latest data from L2 Beat, Arbitrum currently dominates the L2 wars, holding 55% of the market share in terms of total value locked (TVL). Arbitrum’s total value of assets locked has risen by more than 20% in the last seven days to $3.85 billion, coinciding with high-network activity on the network as well potential upside of the scheduled airdrop.\n\nThe growth of Arbitrum’s TVL and its dominance is a good indicator of its thriving ecosystem, with leading protocols such as GMX, Uniswap, Camelot and many other DEXs operating on the network. In contrast, alternative Layer-2 competitors such as Optimism’s and Polygon’s TVLs are comparatively lower. This broad adoption and trust from projects as well as the wider community have been a positive sign for the growth and success of the Arbitrum ecosystem.\n\nJoining other L2 projects such as Optimism, the launch of ARB will be a pivotal milestone in the network’s journey toward a decentralized autonomous organization (DAO). Unlike other tokens such as Ether — Ethereum’s native token that’s utilized to pay transaction fees on the network — ARB will serve exclusively for protocol governance on Arbitrum.\n\nPrior to the announcement, Offchain Labs, the developer behind the Arbitrum ecosystem, was the sole entity responsible for making decisions and adjustments to the network. Following the announcement and the upcoming token launch, the reigns of control will be handed over to its community.\n\nThe network will grant holders the ability to vote on changes to both Arbitrum One and Arbitrum Nova networks. These networks allow users to carry out transactions on the Ethereum blockchain at greater speeds and reduced fees.\n\nThe governance process implemented will be self-executing: votes placed will directly impact and execute on-chain decisions without involving intermediaries. The voting procedure will require a minimum of 21 to 37 days to pass before a proposal is executed, thus ensuring users are given ample time to react to any changes.\n\nARB airdrop and eligibility\n\nThe Arbitrum Foundation has announced that ARB will be airdropped to early eligible community members on Thursday, March 23, 2023.\n\nIn collaboration with crypto analytics firm Nansen, Arbitrum monitored user behavior in February to determine eligibility for ARB tokens. Factors that determined eligibility included:\n\nNumber of transactions performed.\n\nNumber of applications used.\n\nDuration of usage on both Arbitrum One and Nitro.\n\nBased on a statement released by Nansen, out of the 2.3 million wallets bridged on the Arbitrum One chain, a total of 625,142 addresses are eligible, with 28% of them having been bridged to Arbitrum One before Feb. 6, 2023.\n\nAccording to Offchain Labs’ co-founder and CEO Steven Goldfeder, eligible users will be determined by an internal eligibility criterion. Interested users can check their eligibility for the airdrop on the website.\n\nToken allocation\n\nSource: Token Unlocks\n\nARB will have a total circulation of 10 billion tokens. Out of these, the Arbitrum community will have control over 56% of the tokens, of which:\n\n11.5% will be distributed to the Arbitrum community.\n\n1.1% will be given to DAOs operating in the Arbitrum ecosystem.\n\nThe Arbitrum DAO will distribute the remaining community tokens through a treasury.\n\nThe remaining 44% of ARB tokens will go to Offchain Labs. Both investor and team tokens will be subject to a vesting period of four years, with the first unlocking scheduled to occur in a year’s time, followed by periodic unlocking over the next three years.\n\nFinal thoughts\n\nWhile the launch of ARB has taken longer than expected in comparison to direct competitors such as Optimism, Goldfeder reassured the community that Arbitrum had reached certain technical milestones such as working fraud proofs (the tech underpinning Arbitrum One’s unrivaled security), surpassing its primary competitor by a significant margin.\n\nNevertheless, the launch of ARB is a crucial milestone for Arbitrum and the L2 ecosystem as a whole. As more and more projects explore Layer-2 scaling solutions, the launch of a governance token for one of the leading solutions, such as Arbitrum, is a clear indication of the ecosystem’s maturity.\n\nMaterial is provided in partnership with XGo"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9hcmJpdHJ1bS1zLWFyYi10b2tlbi1zaWduaWZpZXMtdGhlLXN0YXJ0LW9mLWFpcmRyb3Atc2Vhc29uLWhlcmUtYXJlLTUtdG8tbG9vay1vdXQtZm9y0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Mar 2023 07:00:00 GMT",
        "title": "Arbitrum's ARB token signifies the start of airdrop season — Here are 5 to look out for - Cointelegraph",
        "content": "Arbitrum developers announced an airdrop of its governance token, ARB, to eligible users and DAOs on the Ethereum layer-2 platform. The average user received around 625 ARB tokens, which corresponds to around $625 to $1,250, according to pre-launch trading prices and popular estimations.\n\nThe prospect of earning free money has instilled excitement around users looking to hunt the next airdrop opportunity. The airdrop farming activity also benefits the protocols by attracting liquidity and usage to the platform. The strategy is working well for both protocol developers and users.\n\nMoreover, a team’s sale of a protocol’s token invokes securities laws, inducing significant legal risk for the developing teams. Thus, it is reasonable to assume that future protocols will use the same strategy to decentralize their protocols.\n\nHere are five potential airdrop opportunities for this year.\n\nzkSync Era\n\nzkSync Era is a layer-2 rollup on Ethereum based on zero-knowledge (ZK) proof technology. Experts, including Ethereum co-founder Vitalik Buterin, have argued that zk-based EVM-compatible rollups could be a game-changer technology with high scalability and throughput, leading to mass adoption.\n\nzkSync has the added advantage of being compatible with the Ethereum Virtual Machine, which enables access to the blockchain through MetaMask wallet itself.\n\nMatter Labs, the team behind zkSync, raised $200 million in December 2022 in a Series C funding round led by Blockchain Capital and Dragonfly. Leading decentralized applications on Ethereum like Chainlink, Uniswap and Aave have signaled intent to launch on zkSync.\n\nOn Feb. 16, Matter Labs opened the floodgates for registered projects to deploy their code on the zkSync mainnet. The public deposits will start shortly. Users looking to maximize their chances of gaining an airdrop will look to improve their on-chain footprint on the mainnet.\n\nStarknet\n\nStarknet is another ZK-based Ethereum rollup that supports decentralized applications. StarkWare, the developing firm behind Starknet, has confirmed a STARK token and its utility in decentralizing the Ethereum layer-2 network.\n\nThe team has previously worked on StarkEx, an Ethereum scaling engine used by independent Layer-2 solutions like Sorare, ImmutableX and dYdX. The success of its previous projects instills confidence in the success of Starknet.\n\nStarkWare launched the Starknet mainnet in November. The total deposits on Starknet jumped 45% to $2.49 million after the Aribtrum token launch announcement as users rushed to farm the next airdrop. On-chain analytics firm Nansen witnessed record deposits of $3.4 million Ether(ETH) and Dai (DAI) on March 17 to the Starknet ecosystem.\n\nDaily flows to/from Starknet. Source: Nansen\n\nScroll\n\nScroll, branded as a “true zkEVM,” is another zk-Rollup Ethereum layer 2. It’s similar to zkSync Era, which comes with full EVM compatibility. The project raised $30 million in April 2022 in an investment round led by Polychain Capital.\n\nThe blockchain is developed by Ye Zhang, a Ph.D. student at New York University. Scroll’s design replicates the same version of the Ethereum Virtual Machine as used on mainnet, making it easier for existing Ethereum developers to deploy code on Scroll, compared to alternatives like zkSync and Polygon’s zkEVM.\n\nOn February 28, the Scroll team launched on the Ethereum Goerli testnet, enabling public testing activity. According to the team, over 100,000 users accessed the previous testnet version of Scroll. The mainnet launch is scheduled for late 2023.\n\nRelated: Attack of the zkEVMs! Crypto's 10x moment\n\nSui Network\n\nSui Network is a Move-based layer-1 blockchain, similar to Aptos, born from the ashes of Meta’s failed blockchain project, Libra. Evan Cheng, who formerly headed Meta’s crypto wallet research and development unit, became the CEO of Mysten Labs, the team developing Sui.\n\nAptos Labs launched the blockchain’s native token, APT, on October 18, airdropping 20 million tokens to eligible users who minted a specific NFT on the Aptos testnet. On launch day, the airdrop was worth over $1,500. Sui testnet users can expect a similar airdrop upon mainnet launch in Q2 2023.\n\nOn March 21, Mysten Labs launched a Wave to Mainnet campaign, including a “series of events and content to further educate the community about the potential for Sui protocol.” Participating in the Sui campaigns and developing a digital footprint on the testnet could improve the chances of earning a future airdrop.\n\nSei Network\n\nSei Network is a Cosmos-based layer 1 blockchain focusing mainly on DeFi and high-frequency trading applications.\n\nThe blockchain comprises basic applications such as an order-matching engine and a unified liquidity model across the platform to enhance trading experience. The project is backed by industry heavyweights like Multicoin Capital, Coinbase Ventures and Delphi Digital.\n\nThe team launched its incentivized testnet in Q2 2022 with various mission and NFT minting campaigns along the way. Users who participated in these events will likely receive an airdrop upon mainnet launch. The team has hinted the launch will happen shortly.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiK2h0dHBzOi8vY29pbmRvby5jb20vaG93LXRvLWJ1eS1zYWl0YW1hLWludS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Mar 2023 07:00:00 GMT",
        "title": "How to Buy Saitama Inu – A Complete Guide - Latest Cryptocurrency Prices & Articles",
        "content": "SAITAMA is an ERC-20 token that started as a meme coin in 2021 and upgraded into a utility coin in June 2022. Like other ERC-20 tokens, the SAITAMA coin is created and hosted on the Ethereum blockchain, meaning it will eventually be part of it.\n\nTo transform from the perception of being a meme coin, SAITAMA added a wide range of innovative Decentralized Finance (DeFi) features into its ecosystem. This action aligns with making meme coins more accessible and safer for generation Z.\n\nAs a result, its platform (Saitama) comes loaded with unique features such as the ‘anti-whale’ that prevents established wallet holders from influencing the overall token prices or transactions.\n\nLet’s explore Saitama and how to buy it on different platforms.\n\nWhat is Saitama Inu?\n\nSaitama (SAITAMA) is a decentralized ERC-20 token built on the Ethereum blockchain designed to educate Generation Z on crypto investments. It was purposely created to inform users about blockchain technology, thus encouraging them to be part of the digital revolution.\n\nIn other words, Saitama aims to make cryptocurrency adoption easy for all Generation Z members by providing them with a user-friendly experience.\n\nUnlike most platforms, the Saitaima platform offers 100% free services to its users while allowing them to earn passive income through email campaigns, social media, and content creation.\n\nSaitaPro plays a crucial role in the Saitama ecosystem, serving as its main utility. Moreover, its partnership with EpayMe further enhances its value proposition.\n\nAccording to CoinMarketCap, SAITAMA coins in circulation stand at over 38 billion. This is a considerable supply, given that the token started trading in June 2022.\n\nSAITAMA token has a deflationary burning mechanism that helps protect its value and reward long-term holders. In SaitaPro, they have implemented a 1% Burn Tax to ensure sustainable growth. A 1% Buy Back and Burn contribution further strengthens their commitment to supporting worthy projects.\n\nBesides, the SAITAMA coin is planned to be the primary medium of exchange for an upcoming marketplace where people can buy and sell NFTs. When people use SAITAMA coin to buy or sell NFTs on this marketplace, investors will earn a small percentage of the transaction fees.\n\nYou can access the SAITAMA coin through some centralized and decentralized platforms.\n\nHow to Buy SAITAMA on Binance\n\nNow that you know what Saitama is, let’s find out what Binance is and how to buy SAITAMA tokens.\n\nBinance is the biggest crypto exchange platform by market cap. But while it constantly reviews and adds cryptocurrencies that can be traded on its platform, the SAITAMA coin is yet to be listed. However, below is a step-by-step guide to purchasing SAITAMA by linking your digital crypto wallet to a decentralized exchange using your Binance account to buy the base currency, Ethereum.\n\nDownload & Set Up MetaMask\n\nAlthough numerous decentralized, self-custodial, Ethereum-based digital wallets exist, MetaMask is the most trusted. Launched in 2016, MetaMask allows users to safely store, buy, convert, send, and swap crypto tokens. The MetaMask Wallet is a mobile application or browser extension on Google Chrome, Mozilla Firefox, Brave, or Opera. To install it on your browser, follow these steps (the browser we will use to illustrate is Brave, but the process is similar on all browsers on which MetaMask is available):\n\n1. Visit the MetaMask website and click the “Download” button.\n\nWhen accessing the official MetaMask website, on the first page, you will find a “Download” button that you will have to click. Once pressed, you will be redirected to the Download section on the Chrome Web Store.\n\n2. Add MetaMask to Your Browser.\n\nOnce in the Chrome Web Store, click on the add extension button in the browser and confirm the addition by clicking “Add Extension.”\n\n3. Create Your MetaMask Wallet or Import an Existing One\n\nAfter clicking the add extension button, you will be redirected to your MetaMask account setup page. If you already have an account, click “Import an existing wallet. If you do not have an account, click the “Create a new wallet” button.\n\nOf course, to go ahead, you must accept the terms and conditions.\n\nTo set up, you will need to choose a password for your account, secure your wallet by saving your Secret Recovery Phrase in a safe place (beware, losing this code may result in losing assets in your MetaMask wallet), and confirm your Secret Recovery Phrase.\n\n4. Pin Your MetaMask Extension\n\nNow, your MetaMask account is configured and ready to use. You can pin the MetaMask extension near the browser search bar for easier usage. To access your MetaMask wallet, click the Foxface icon on the top right.\n\nBuy Ethereum (ETH)\n\nIn order to convert ETH to SAITAMA, you obviously need to have ETH in your wallet. On MetaMask, you have two options: Either buy ETH directly from the platform or buy from a Crypto Exchange and then transfer it to your wallet.\n\nBuy Ethereum (ETH) Directly on MetaMask\n\nIf you choose the method to buy ETH directly from MetaMask, click on the “+” button and then select the payment processor through which you want to buy ETH. You will have three options: Coinbase Pay, Transak, and MoonPay. MoonPay is the easiest way to buy ETH on MetaMask using a bank card, Apple Pay, or Google Pay.\n\nOnce you’ve decided, select the processor and move on. The process is simple and fast.\n\nBuy Ethereum (ETH) on Binance\n\nAfter creating and downloading the MetaMask wallet, log in to Binance to purchase Ethereum. If you don’t have an account, you must create an account on Binance, confirm it, and follow the entire account validation process. Also, you need to fund your account if you do not have funds in your Binance account.\n\nTo buy Ethereum, click “Cash Balance” in the “Buy Crypto” menu.\n\nMake sure you are on the “Buy” menu in the open menu, enter the quantity you want to buy, and complete the transaction. Make sure you are buying ETH and not another currency. Select ETH by clicking on the button next to the Receive row.\n\nThis is not the only way to buy ETH on Binance, but it is one of the handiest.\n\nSend Ethereum from Binance to Your MetaMask Wallet\n\nTo send the Ethereum you bought on Binance to the MetaMask wallet, go to your Binance wallet section and withdraw it by filling in the required information. Set up the network to Ethereum and provide your MetaMask wallet address (copied from account 1) and the amount you want to transfer.\n\nClick “withdraw.” The transferred Ethereum will appear on your MetaMask wallet.\n\nAttention, be very careful when transferring from Binance to an external wallet. If you get the wrong address, this can result in the permanent loss of your funds.\n\nChoose a DEX\n\nNumerous DEX can integrate with MetaMask wallet, including 1inch Network, VoltSwap, UniSwap, and Biswap, among others. To illustrate, we will continue the process of buying SAITAMA through Uniswap.\n\nConnect Your MetaMask Wallet to the Chosen DEX\n\nConnect your MetaMask wallet to your preferred DEX using your wallet address copied from account 1. Some platforms allow an easier connection. In the example above, the connection takes place instantly after you confirm by pressing the “Connect” button on the UniSwap platform and then pressing MetaMask.\n\nTrade Your ETH for SAITAMA\n\nSelect Ethereum as the payment and SAITAMA as the coin you want to buy and proceed with the transaction. Now, you bought SAITAMA for ETH.\n\nHow to Buy SAITAMA on Coinbase?\n\nCoinbase is one of the best global exchange platforms because it is available in over a hundred countries and has user-friendly features. If you are a beginner in the cryptocurrency world, you would probably use Coinbase. First, opening up an account and linking your wallet takes a few minutes. The platform also offers a step-by-step guide on how to go about the exchange, thus making it the easiest among many others. At the time of writing, SAITAMA can only be purchased on Coinbase in the Coinbase Wallet.\n\nHere is a detailed guide on how to buy SAITAMA on Coinbase:\n\nDownload Coinbase Wallet & Set Up Your Account\n\nCoinbase is a non-custodial digital wallet available as a mobile app (Android & iOS) and browser extension. Coinbase Wallet account creation is similar to MetaMask. To get started, follow these steps:\n\n1. Install the Coinbase wallet extension from the Chrome Web Store\n\n2. Select “Create new wallet.”\n\n3. Back Up Your 12-word Recovery Phrase\n\nThis phrase is critical in recovering your Coinbase wallet if you forget your password. Therefore, it would be best to store it securely either by writing it down or memorizing it. Avoid storing it in a computer where a second party can easily access it. Confirm that you have saved your backup phrase before proceeding to the next step.\n\n4. Create Your Wallet Password\n\n5. Get Your Free Web3 Username\n\nThe username is what other Coinbase wallet users can use to find you. The platform automatically generates your username if you do not claim it.\n\n6. Fund Your Wallet\n\nThe process of buying Ethereum on Coinbase depends on whether you are using a mobile app or a chrome extension. If you are using the chrome extension, follow these steps:\n\nClick ‘+’ on the top right side of your screen to add crypto\n\nChoose ‘Add crypto with Coinbase Pay.’\n\nSign into your Coinbase account to authorize the Coinbase wallet extension.\n\nBuy Ethereum (ETH) on Coinbase\n\nIf you don’t have it, buy Ethereum in Coinbase and transfer it to your Coinbase Wallet.\n\nChoose a DEX\n\nNumerous DEX can integrate with MetaMask wallet, including 1inch Network, VoltSwap, UniSwap, and Biswap, among others. To illustrate, we will continue the process of buying SAITAMA through Uniswap.\n\nConnect Your Coinbase Wallet to the Chosen DEX\n\nConnect your Coinbase Wallet to your preferred DEX using your wallet address. Some platforms allow an easier connection. In the example above, the connection takes place instantly after you confirm by pressing the “Connect” button on the UniSwap platform and then pressing Coinbase Wallet.\n\nTrade Your ETH for SAITAMA\n\nSelect Ethereum as the payment and SAITAMA as the coin you want to buy and proceed with the transaction. Now, you bought SAITAMA for ETH.\n\nHow to Buy SAITAMA on SaitaPro\n\nSaitaSwap is advertised as the best-decentralized crypto exchange for Saitama Inu. If you want to purchase SAITAMA on this platform, follow these steps:\n\n1. Install the SaitaPro Wallet App\n\nThe SaitaPro app is freely available for Android and iOS. However, if you have another wallet, such as MetaMask, you can connect it to SaitaSwap and start trading.\n\n2. Buy Ethereum (ETH)\n\nSAITAMA currently has limited trading pairs, so the easiest way to purchase it is to buy ETH first and then exchange it for SAITAMA. However, it would help if you had enough ETH to cover gas fees.\n\n3. Trade ETH for SAITAMA\n\nOnce you have an ETH token in your SaitaPro wallet, you can swap them for SAITAMA by selecting “swap” on the digital assets section and then choosing SAITAMA as the token you want to acquire.\n\nFAQ\n\nI Can’t Find SAITAMA on the DEX. What Can I Do?\n\nIf SAITAMA does not appear on the selected DEX platform, find its smart contract address and copy and paste it on the decentralized exchange. Beware of scammers and ensure to get the address from SAITAMA’s official contract address.\n\nHow to Use SAITAMA Coins?\n\nThere are a few ways to use your SATAIMA coins. First, you can stake them on the SaitaPro wallet and earn rewards/ profit. Additionally, you can trade Saitama coins via a CFD trading account on an online exchange.\n\nConclusion\n\nAlthough SAITAMA coin is still new in the crypto market, especially as a trading token, it has proven that it is here to stay. Also, its popularity is expected to rise thanks to the ability to provide people with educative materials on crypto investments.\n\nShare this Post Twitter\n\nLinkedin\n\nFacebook\n\nReddit\n\n* The information in this article and the links provided are for general information purposes only and should not constitute any financial or investment advice. We advise you to do your own research or consult a professional before making financial decisions. Please acknowledge that we are not responsible for any loss caused by any information present on this website."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY3J5cHRvLm5ld3Mvdml0YWxpay1idXRlcmluLXRvLXBhcnRpY2lwYXRlLWluLWZpcnN0LWNvbmZlcmVuY2Utc2luY2UtZmVicnVhcnkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Mar 2023 07:00:00 GMT",
        "title": "Vitalik Buterin to participate in first conference since February - crypto.news",
        "content": "Ethereum co-founder Vitalik Buterin and eight other members of the Ethereum Foundation (EF) have confirmed their attendance at the Ethereum Conference EDCON 2023, to be held in Podgorica, Montenegro.\n\nIt will be the first time Buterin is seen in public since Feb. 12, when he gave a keynote speech at ETHDenver in Denver. He discussed the progress and challenges of Ethereum 2.0, a significant upgrade that aims to make Ethereum more scalable, secure, and sustainable.\n\nLarge in-person events I'm speaking at in person in Q2:\n\n\n\n* EDCON in Montenegro, May 19-23 @EDCON2023 https://t.co/TayUiql9zl\n\n* EthPrague, ~Jun 11 @EthPrague\n\n* EthWaterloo, ~Jun 25\n\n\n\nAlso speaking online (eg. @EthTaipei in Apr). Apologies to all the events I couldn't come to! — vitalik.eth (@VitalikButerin) April 13, 2023\n\nEDCON, or Community Ethereum Development Conference, is an annual event that aims to bring together Ethereum developers, researchers, entrepreneurs, and enthusiasts worldwide to share their ideas and experiences on Ethereum and its related technologies.\n\nThe conference will take place from May 19 to May 23, and the agenda includes keynote speeches, panels, and technical workshops focusing on issues around crypto and blockchain regulation, layer 3 (L3) solutions, decentralized governance and societies, and the state of the ETH network, among others.\n\nYou might also like: Vitalik Buterin: zkEVM can solve verification problems in Ethereum\n\nEthereum Foundation heavyweights to attend event\n\nApart from Vitalik Buterin, several EF members are also slated to speak at the Podgorica event, including Vlad Zamfir, Tim Beiko, Skylar Weaver, Barry Whitehat, Piper Merriam, Andy Guzman, and Leo Lara.\n\nOther notable speakers at the event will include former Coinbase CTO Balaji Srinivasan, Gitcoin co-founder Scott Moore, Polygon zkEVM technical lead Jordi Baylina, and StarkWare co-founder Eli Ben-Sasson.\n\nMany expect Buterin’s appearance at EDCON to generate a lot of attention and excitement among the Ethereum community since he rarely attends public events.\n\nPodgorica, scene of Do Kwon’s capture\n\nButerin’s visit to Podgorica will come nearly two months after Montenegrin law enforcement authorities apprehended another big name in the crypto space in the same city.\n\nTerra co-founder Do Kwon was arrested in Montenegro while trying to board a flight to Dubai with forged passports.\n\nHe was charged with fraud by US prosecutors in the district court in Manhattan for his alleged role in the collapse of the $40 billion Terra ecosystem in May 2022.\n\nDo Kwon is accused of two counts each of securities fraud, wire fraud, commodities fraud, and conspiracy, and is currently being held in Montenegro, awaiting extradition to South Korea or the United States.\n\nFollow Us on Google News"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC93aXRoLWJhbmtzLXNpbmtpbmctdGhlLWZ1dHVyZS1vZi1iaXRjb2luLWJ0Yy1yZW5xLWZpbmFuY2UtYW5kLWV0aGVyZXVtLWV0aC1zZWVtcy1icmlnaHRlci10aGFuLWV2ZXIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Mar 2023 07:00:00 GMT",
        "title": "With banks sinking, the future of Bitcoin (BTC), RenQ Finance, and Ethereum (ETH) seems brighter than ever - Analytics Insight",
        "content": "As traditional financial institutions face increased scrutiny and declining public trust, many investors are turning to cryptocurrencies as a more reliable and secure store of value.\n\nCryptocurrencies like Bitcoin, RenQ Finance, and Ethereum are becoming more attractive to investors. Their decentralized nature, security, and potential for long-term growth make them a strong choice for those looking to diversify their portfolios.\n\nBitcoin (BTC)\n\nBitcoin is the world’s first and most well-known cryptocurrency, launched in 2009 by an anonymous individual or group using the pseudonym Satoshi Nakamoto. Its decentralized nature and built-in scarcity have made it a popular choice for investors looking to diversify their portfolios.\n\nAs traditional banks struggle with issues of inflation, Bitcoin’s limited supply and algorithmically-capped maximum supply of 21 million coins make it a strong alternative store of value. Despite recent volatility in the crypto market, Bitcoin has maintained its position as the largest cryptocurrency by market capitalization.\n\nRenQ Finance (RENQ)\n\nRenQ Finance is a decentralized finance platform that uses advanced AI technology to offer users secure and efficient financial services. RenQ Finance is built on a blockchain that enables cross-chain interoperability, making it easy for users to transfer assets between different blockchains.\n\nRenQ Finance has gained significant attention in the crypto market, with its successful presale phase raising over $2.7 million and its potential for further growth. RenQ Finance has the potential to revolutionize the DeFi industry with its innovative approach to cross-chain exchange technology, offering a more effective and affordable method of transferring assets between different blockchains.\n\nAdditionally, Investors have gained more trust in RenQ Finance following its successful CertiK security audit. This has been a significant development for the project, as it assures investors that their investments are secure and that the platform is reliable. The audit found no critical vulnerabilities or issues in RenQ Finance’s smart contracts, demonstrating that the project is built on a strong and secure foundation. This has further strengthened the project’s position in the market and attracted more investors looking for a trustworthy DeFi project.\n\nEthereum (ETH)\n\nEthereum is a decentralized blockchain platform that allows developers to build decentralized applications (dApps) using smart contracts. Smart contracts are self-executing agreements that run on the Ethereum network, allowing developers to create a wide range of decentralized applications, from decentralized finance (DeFi) platforms to online marketplaces.\n\nEthereum’s popularity has grown significantly in recent years, and it is now the second-largest cryptocurrency by market capitalization. Its decentralized nature and strong community support make it a reliable and secure choice for investors looking to diversify their portfolios.\n\nBitcoin Vs Ethereum Vs RenQ Finance: What is the difference\n\nBitcoin, Ethereum, and RenQ Finance are all cryptocurrencies, but they have different features, use cases, and technologies behind them.\n\nBitcoin (BTC) was the first and most well-known cryptocurrency. It was created in 2009 as a decentralized digital currency that could be used to make peer-to-peer transactions without the need for intermediaries like banks or payment processors. Bitcoin’s main use case is as a store of value and a means of exchange. It has a limited supply, with a maximum of 21 million coins that can be mined, and its mining process is based on the proof-of-work (PoW) consensus algorithm.\n\nEthereum (ETH) is a decentralized blockchain platform that allows developers to build decentralized applications (dApps) and smart contracts. It was created in 2015 to create a decentralized platform for building decentralized applications. Ethereum’s main use case is as a platform for building dApps and smart contracts. It uses a proof-of-stake (PoS) consensus algorithm and has no fixed supply, but instead uses a dynamic issuance model.\n\nRenQ Finance (RENQ) is a multi-chain, decentralized exchange that allows for direct trading through the user’s wallet app. It is designed to enhance decentralized trading and support DeFi protocols. RenQ Finance’s main use case is as a decentralized exchange and it uses a Layer 2 scaling solution to reduce transaction costs and increase speed. RenQ Finance has a total supply of 1 billion coins.\n\nConclusion\n\nWhile the cryptocurrency market can be volatile, these three cryptocurrencies have shown resilience in the face of market fluctuations and are well-positioned for future growth. As the world becomes more digitally focused and decentralized, the future of Bitcoin, RenQ Finance, and Ethereum looks brighter than ever.\n\nClick Here to Buy RenQ Finance (RENQ) Tokens.\n\nVisit the links below for more information about RenQ Finance (RENQ):\n\nWebsite: https://renq.io\n\nWhitepaper: https://renq.io/whitepaper.pdf\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMioAFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2NvaW5iYXNlLXRvLWxpc3QtYXJiaXRydW0td2l0aC1leHBlcmltZW50YWwtbGFiZWwtd2FybnMtdXNlcnMtdG8tc2VuZC1hcmItb25seS1vdmVyLWV0aGVyZXVtLW5ldHdvcmstMjAyMzAzMjIyMzM50gGkAWh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9hbXAvY3J5cHRvY3VycmVuY2llcy9uZXdzL2NvaW5iYXNlLXRvLWxpc3QtYXJiaXRydW0td2l0aC1leHBlcmltZW50YWwtbGFiZWwtd2FybnMtdXNlcnMtdG8tc2VuZC1hcmItb25seS1vdmVyLWV0aGVyZXVtLW5ldHdvcmstMjAyMzAzMjIyMzM5?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Mar 2023 07:00:00 GMT",
        "title": "Coinbase to list Arbitrum with experimental label, warns users to send ARB only over Ethereum network - FXStreet",
        "content": "Share:\n\nCoinbase has revealed intentions to support Arbitrum’s upcoming native token ARB by listing it for trading on the platform.\n\nThe exchange will add support for the ERC-20 token but warns users not to send it to networks other than Ethereum.\n\nARB will be live for trading on Coinbase once sufficient supply and liquidity conditions are met.\n\nIn a March 22 announcement, Coinbase revealed intentions to support Arbitrum’s upcoming native token, ARB, by listing it for trading on the largest cryptocurrency exchange in the United States. The disclosure was bountiful, featuring several other details for Arbitrum users.\n\nCoinbase’s listing details for the ARB token\n\nBesides committing to adding support for the ERC-20 token, Coinbase said that the launch will take a step-by-step approach for the USD-ARB trading pairs on the exchange. Most importantly, ARB would feature an “experimental” tag on the US-based exchange to inform users that the Arbitrum token is new on the platform and that it does not impede holding, transferring, or trading.\n\nThe US-based exchange also cautioned users not to send ARB to networks other than Ethereum lest they lose their tokens. The exchange also added that it will start trading the token once adequate supply and liquidity conditions are met.\n\nCoinbase will add support for Arbitrum (ARB) on the Arbitrum network (ERC-20 token). Do not send this asset over other networks or your funds may be lost. Inbound transfers for this asset are available on @Coinbase & @CoinbaseExch in the regions where trading is supported. — Coinbase Assets (@CoinbaseAssets) March 22, 2023\n\nNotably, trading is scheduled to commence shortly after the March 23 airdrop. An excerpt from the announcement reads:\n\nThe Arbitrum network (ERC-20 token) contract address for Arbitrum (ARB) is 0x912CE59144191C1204E64559FE8253a0e49E6548.\n\nBefore the token airdrop happens, the first 1000 customers that buy ARB on PancakeSwap will get a 99% discount.\n\nCoinbase also noted that ARB trading would only be available for select jurisdictions but did not give further clarifications about this limitation.\n\nAs a forewarning, the exchange highlighted that some users could experience delays when depositing on the Arbitrum network but asserted that interventions were underway to solve the situation.\n\nBinance also confirmed plans to list Arbitrum (ARB) and has provisionally scheduled it for open trading for these spot trading pairs beginning March 23 at 1700 UTC.\n\nArbitrum community members eager for ARB launch\n\nAfter years of waiting, the Arbitrum community is eager for the ARB token to finally make its market debut. The anticipation was intensified when the network committed to distributing 56% of the token’s circulating supply to the Arbitrum community, comprising network users.\n\nAs reported earlier, the impending airdrop will distribute 11.5% of the total supply to eligible Arbitrum users. Another 1.1% to Decentralized Autonomous Organizations (DAOs) that operate within the Arbitrum ecosystem.\n\nThe process of eligible user selection will be transparent, leveraging several factors revealed during the airdrop announcement. Track the details here.\n\nMeanwhile, the ARB token launch anticipation has triggered a selling spree for eligible wallets, which are now going for discounted prices on prevailing speculation that ARB will get as close to $1 as possible in market value."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vZGVjcnlwdC5jby8xMjQ0MTQvYmxvY2tjaGFpbi1vZmZlcnMtYmV0dGVyLXJlcGFpci1jYXJlLXNlcnZpY2VzLWx1eHVyeS1wcm9kdWN0cy1sdm1oLWNpb9IBZmh0dHBzOi8vZGVjcnlwdC5jby8xMjQ0MTQvYmxvY2tjaGFpbi1vZmZlcnMtYmV0dGVyLXJlcGFpci1jYXJlLXNlcnZpY2VzLWx1eHVyeS1wcm9kdWN0cy1sdm1oLWNpbz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Mar 2023 07:00:00 GMT",
        "title": "Blockchain Offers 'Better Repair and Care Services' for Luxury Products: LVMH CIO - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe love story between luxury brands and Web3 continues.\n\nAt this year’s Paris Blockchain Week, LVMH presented the latest developments around its Aura Blockchain Consortium.\n\nFirst launched in 2021, the consortium, which includes Prada Group, OTB Group, and Cartier, focuses on promoting more sustainable trends in the fashion world and helping members upgrade their products’ traceability via blockchain technology.\n\nAD\n\nAD\n\n“When you talk about luxury, you are talking about long-term products, repair, and care,” Frank Le Moal, vice-chairman of Aura Blockchain Consortium and LVMH’s CIO, told Decrypt. “Digital passports backed by a blockchain are a way to provide better repair and care services to customers, and to develop a better one-to-one relationship with them.”\n\nOTB Group, which holds famous brands like Diesel, Maison Margiela, Marni, Viktor&Rolf, and Jil Sander, was one of the first entities to join the Consortium.\n\nSource: Aura Blockchain Consortium.\n\nThe CEO of the group’s web3 subsidiary BVX, Stefano Rosso, is convinced that blockchain technology is going to “change the way we interact, consume, socialize, and communicate,” he told Decrypt.\n\n“For us, it was fundamental to jump on the boat now. It was the right moment to experiment and join other fellows in this space,” Rosso said. “The sky is the limit.”\n\nThe Consortium’s real challenge was at some point to convince other luxury brands, most of them competitors, to join the project.\n\nAD\n\nAD\n\n“The luxury industry is very competitive, people are fighting most of the time,” said Le Moal. “But we managed to develop a collaborative concept, involving many brands. We want to offer this as a solution to the world of luxury.”\n\nLuxury brands build in public\n\nMore than a collection of luxury brands, Aura is also a private blockchain built on ConsenSys’ Quorum.\n\nAnd this week, LVMH also rolled out a new feature for its network called the “Multi-Token minter” (MTM).\n\nSource: Aura Blockchain Consortium.\n\nThe MTM lets consortium members build out smart contracts that can be deployed on Aura’s blockchain, but also on any public blockchain, including Ethereum, Solana, or Cosmos.\n\n“We want to allow every luxury brand to enjoy the possibilities of Web3. We are already more than pleased to have 24 brands on board, 21 of them using NFTs,” Frank Le Moel. “But with MTM, we feel a strong excitement. Because we know that some brands prefer to go on a public blockchain.”"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDMvMjIvem9yYS1hZGRzLW5ldy1mZWF0dXJlLXRvLWFsbG93LWNyZWF0b3JzLXRvLXdyaXRlLW5mdC1zbWFydC1jb250cmFjdC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Mar 2023 07:00:00 GMT",
        "title": "Zora Adds New Feature to Allow Creators to Write NFT Smart Contract - Crypto Times",
        "content": "The NFT marketplace on the Ethereum network, Zora announced the integration of a new feature on its platform that allows creators to create and deploy their own ERC-1155 smart contract.\n\nWith 1155 editions, blue sky’s the limit with what you can do with a body of work.\n\n\n\n→ Create curatorial cohesiveness.\n\n→ Tell a story that builds over time.\n\n→ Make multiple moments.\n\n\n\nImagine.https://t.co/TdHlMArwYa pic.twitter.com/j024I3XmcA — Zora (@ourZORA) March 20, 2023\n\nERC-1155 smart contract enables the creation of various types of tokens including fungible, non-fungible tokens (NFTs), and semi-fungible tokens. That means, with the help of a new feature added on Zora, users will be able to mint their own collections.\n\nZora is expecting a rush of new users after adding the new feature. Through ERC-1155, creators can curate multiple NFTs on a single organized contract, and add a new collection in the already deployed smart contract at any time. Also, they can do batch minting while saving transaction costs efficiently.\n\nAlso Read: Blur Overtakes OpenSea amid Increasing Hype of Ethereum NFT\n\nOn Twitter, Zora indicated the arrival of similar fascinating developments in the future. It stated, “More coming soon. Stay tuned.”"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZW4uZXRoZXJldW13b3JsZG5ld3MuY29tL2FydGh1ci1oYXllcy1iaXRjb2luLWNyb3NzLTEtbWlsbGlvbi1tYXJrL9IBT2h0dHBzOi8vZW4uZXRoZXJldW13b3JsZG5ld3MuY29tL2FydGh1ci1oYXllcy1iaXRjb2luLWNyb3NzLTEtbWlsbGlvbi1tYXJrL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Mar 2023 07:00:00 GMT",
        "title": "BitMEX Founder Arthur Hayes Believes Bitcoin Can Cross $1 Million Mark - Ethereum World News",
        "content": "Popular crypto veteran Arthur Hayes says it’s possible for Bitcoin to cross the $1 million threshold.\n\nHayes believes that the Federal Reserve’s new Bank Term Funding Program will pump BTC massively.\n\nThe $1 million projection became popular after former Coinbase executive Balaji Srinivasan made a public bet on the same.\n\nArthur Hayes, the popular crypto veteran who founded crypto exchange BitMEX, believes that Bitcoin has the potential to cross the million-dollar threshold. In a recent podcast with Bankless, Hayes shared his thoughts on the United States Federal Reserve’s new banking policy and its potential impact on the prices of crypto assets.\n\nHayes: Bitcoin will benefit from the Bank Term Funding Program\n\nAccording to Arthur Hayes, BTC will achieve this remarkable valuation thanks to the Federal Reserve’s new Bank Term Funding Program (BTFP), which allows banks, credit unions, and other eligible depository institutions to borrow funds for up to one year, using agency debt, U.S. Treasuries, mortgage-backed securities, etc, as collateral. The BFTP recently facilitated a $210 billion bailout of the big four U.S. banks i.e. JPMorgan Chase, Bank of America, Wells Fargo, and Citibank, by letting them borrow against their negative collateral value.\n\nHayes believes that this funding program will induce a “merry-go-round” effect wherein American banks will have an unlimited supply of cash from the Federal Reserve in exchange for holding government bonds. The BitMEX founder believes that this “sinister” program will pump Bitcoin to $1 million.\n\nIt will be profitable for the banks to have a deposit base, buy every single insurance they can of US government debt, and if they ever need to give their depositors back money, they give their debt to the Fed, the Fed gives them dollars. So we go on this little merry-go-round and the US government gets to stuff bonds down the throats of the banks and everybody’s happy.” Arthur Hayes\n\nThe $1 million projection for Bitcoin became popular earlier this week after Balaji Srinivasan, an entrepreneur who formerly served as Coinbase’s Chief Technology Officer, made a public bet predicting that BTC would be worth a million dollars within the next 90 days."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC90aGUtY29sbGFwc2Utb2YtdGhyZWUtYmFua3MtYS1ib29uLW9yLWEtYmFuZS1mb3ItYml0Y29pbi1hbmQtZXRoZXJldW0tYmlnLWV5ZXMtY29pbi1pbi1hLWJ1bGxpc2gtdHJlbmQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Mar 2023 07:00:00 GMT",
        "title": "The Collapse of Three Banks – A Boon or A Bane for Bitcoin and Ethereum? Big Eyes Coin in A Bullish Trend - Analytics Insight",
        "content": "The early March collapse of three significant cryptocurrency banks, Signature, Silicon Valley Bank, and Silvergate, which had a significant amount of exposure to cryptocurrencies, shocked the economic sectors. These financial institutions were explicitly labeled as adaptable hubs where cryptocurrency investors could store their funds. Fortunately, this week saw the two largest cryptocurrencies’ prices turn lushly green.\n\nExperts opine that the failure of these banks will probably have a temporary effect on the cryptocurrency market. They might even be advantageous for cryptocurrencies like Bitcoin and Ethereum. Following the announcement that the Federal Reserve, U.S. Treasury, and FDIC would step in to counterbalance all reserves at SVB and Signature banks, the cryptocurrency market popped to a roar starting last weekend night.\n\nPrices were pushed up by the excessive use of the Ethereum network by cryptocurrency holders trying to exchange their USDC, which had unreachable access to $3.3 billion in SVB, for other stablecoins. Nearly every one of the top thirty cryptocurrencies saw price progress. Along with Bitcoin and Ethereum, Filecoin (FIL), Polygon (MATIC), Solana (SOL), and BNB were some of the biggest gainers. Therefore, as the market prepares for the Bull Run, the Big Eyes coin has caught the attention of cryptocurrency analysts due to its potential for future growth.\n\nBitcoin and Ethereum Surge Post-Banking Crisis\n\nAccording to a Reuters report, the market for digital assets has become more well-liked as a result of the traditional banking sector’s increasing instability. This trend started with Silicon Valley Bank’s failure and has so far culminated in UBS’ acquisition of Credit Suisse at a discount over the weekend.\n\nThe data from Coin Market Cap indicates that the price of Bitcoin has risen 36% over the last ten days and is currently trading at $27,781. The industry-services financial institution’s failure caused BTC to lose about 10% of its value. The live market cap of BTC is $533,605,171,708.\n\nEthereum, the second-ranked coin in the market, has returned to its pre-recession level. ETH has increased 27% over the past seven days and is currently trading at $1,832. It has a circulating supply of 122,373,866 ETH coins with a live market cap of $212,506,040,339.\n\nBig Eyes Going Big\n\nSince its initial presale, Big Eyes Coin, a cryptocurrency with a cat-themed meme, has gotten a lot of backing from crypto analysts. Investors looking for promising investment opportunities are paying attention to the coin due to its astounding presale numbers and cutting-edge features it provides. The entire project offers one-of-a-kind use cases to entice investors. Big Eyes Coin offers 80% of its tokens through a public presale. Big Eyes Coins has made its mark in the cryptocurrency world by raising more than $31 million in just 12 stages of its presale phase. With a 5% split going to the charity wallet, the remaining portion of the funding will be split into one-fourth for marketing and three-quarter for locking in a liquidity pool for two years.\n\nBig Eyes, developed on the Ethereum Network, uses the Proof-of-Stake consensus method to validate transactions. Big Eyes seeks to utilize this protocol to do away with the need for energy-intensive cryptographic mining, which lowers carbon emissions. Additionally, Big Eyes Coin will enable users to scalable, quick, and secure processes. The platform’s availability of smart contract options makes it even more appealing to investors and cryptocurrency users. Big Eyes Coin has developed an ICO that enables investors to join the cat community and take part in the decision-making process. 90% of Big Eyes Coin will be available at launch, which is a great reason for cryptocurrency enthusiasts to invest in it.\n\n250% ROI with BULLRUN\n\nThe token price is still significantly below market price at stage 12 of the presale, allowing for a respectable profit once the project launches. During the 12th stage of its presale phase, Big Eyes Coin is issuing the bonus code BULLRUN250. This entitles the token purchasers to a return of 250% of their investment in $BIG. For instance, if a user spends $100, he will receive $250 worth of BIG rewards.\n\nBig Eyes Coin ones are here:\n\nPresale: https://buy.bigeyes.space/\n\nWebsite: https://bigeyes.space/\n\nTelegram: https://t.me/BIGEYESOFFICIAL\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vd3d3LmNyeXB0b3BvbGl0YW4uY29tL2V0aGVyZXVtLWZvdW5kZXJzLWNvbnRyaWJ1dGlvbi1zdWNjZXNzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Mar 2023 07:00:00 GMT",
        "title": "How Did the Ethereum Founders Contribute to its Development And Success? - Cryptopolitan",
        "content": "The Ethereum blockchain has been one of the most significant innovations in the cryptocurrency space in recent years, revolutionizing the way we think about decentralized applications and smart contracts. But behind this groundbreaking technology are the Ethereum founders, whose vision and expertise paved the way for its development and adoption. They are Vitalik Buterin, Gavin Wood, Charles Hoskinson, Anthony Di Iorio, and Joseph Lubin. Let’s talk about them.\n\nVitalik Buterin\n\nVitalik Buterin is a Russian Canadian computer programmer, writer, and co-founder of Ethereum. Buterin’s early fascination with the possibilities of blockchain technology led him to become a prominent figure in the cryptocurrency community, writing for Bitcoin Magazine and contributing to the blockchain space before co-founding Ethereum.\n\nIn 2013, at 19, Buterin first proposed the idea of Ethereum, a blockchain platform that could support decentralized applications and smart contracts. The platform would allow developers to create decentralized applications that would run on a distributed network of computers, removing the need for intermediaries and creating a new paradigm for online interaction.\n\nButerin’s role in the development of Ethereum was instrumental. He contributed to the creation of the Ethereum Yellow Paper, which outlined the technical specifications of the platform, and developed the Solidity programming language, which has become the standard for writing smart contracts on the Ethereum network. Buterin’s focus on creating a user-friendly platform that could enable developers to create decentralized applications easily was key to the platform’s success.\n\nBeyond Ethereum, Buterin has continued to contribute to the broader blockchain ecosystem. He has worked on projects such as Plasma, a scaling framework for Ethereum that aims to increase the platform’s transaction throughput.\n\nIn addition, Buterin has become an important thought leader in the blockchain community, attending conferences and events around the world to share his insights and ideas. He has been a vocal advocate for the potential of blockchain technology to transform industries beyond finance, including healthcare, supply chain management, and voting systems.\n\nButerin’s contributions to the blockchain industry have been recognized by a number of organizations and publications. In 2014, he was awarded the prestigious Thiel Fellowship, and in 2018 he was named to the Forbes 30 Under 30 list for technology. His work has helped to shape the direction of the blockchain industry, and his vision for a decentralized future continues to inspire developers and entrepreneurs around the world.\n\nGavin Wood\n\nGavin Wood is a prominent figure in the blockchain industry, known for his expertise in software engineering and cryptography. As one of the co-founders of Ethereum, Wood played a crucial role in the development of the platform, contributing to the creation of the Ethereum Yellow Paper and the Solidity programming language.\n\nWood’s contributions to the blockchain industry extend beyond Ethereum. In 2015, he founded Parity Technologies, a blockchain software development company that has worked on a number of projects related to blockchain scalability and interoperability. One of Parity’s most notable projects is Polkadot, a blockchain platform that aims to provide interoperability between different blockchain networks.\n\nPolkadot has gained significant traction within the blockchain community, and its innovative architecture has earned it recognition as one of the most promising blockchain projects currently under development. Wood’s focus on creating a scalable and interoperable platform has resonated with developers and entrepreneurs, and Polkadot’s potential to connect disparate blockchain networks has the potential to transform the way we think about blockchain technology.\n\nAside from Ethereum and Polkadot, Wood has been actively involved in numerous blockchain-related initiatives. He has spoken at conferences worldwide, sharing his vision for the future of blockchain technology and its potential to transform industries beyond finance. He has also served as an advisor to a number of blockchain projects, such as Orchid and Omise.\n\nWood’s contributions to the blockchain industry have been recognized by a number of publications. In 2018, he was named one of the 100 Most Influential People in Blockchain by Coindesk, and in 2019 he was included on the Forbes 40 Under 40 list for technology. His work has helped to shape the direction of the industry, and his vision for a decentralized future continues to inspire developers and entrepreneurs around the world.\n\nJoseph Lubin\n\nJoseph Lubin is a co-founder of Ethereum and a prominent figure in the blockchain industry. Lubin’s background in technology and finance made him an ideal partner for Vitalik Buterin and Gavin Wood in the creation of Ethereum.\n\nAfter co-founding Ethereum, Lubin went on to co-found ConsenSys, a blockchain-focused venture production studio. ConsenSys has been involved in a wide range of blockchain projects and initiatives, including the development of decentralized applications and the creation of blockchain-based solutions for enterprises.\n\nLubin’s contributions to the blockchain industry extend beyond Ethereum and ConsenSys. He has been involved in a number of other blockchain-related initiatives, including the founding of the Enterprise Ethereum Alliance, a global community of blockchain leaders working to promote the adoption of Ethereum technology in the enterprise space.\n\nIn addition to his work in blockchain, Lubin has been involved in a number of other industries throughout his career. He worked as a VP of technology at Goldman Sachs and founded a number of other companies before co-founding Ethereum.\n\nLubin’s impact on the blockchain industry has been significant, and his work on Ethereum, ConsenSys, and other initiatives has helped to shape the direction of the industry. He has been recognized as one of the most influential figures in the blockchain space, and his ongoing contributions to the industry continue to drive its growth and evolution.\n\nCharles Hoskinson\n\nCharles Hoskinson is a computer scientist and mathematician who was one of the original co-founders of Ethereum. Hoskinson played a crucial role in the early development of the platform and was instrumental in the creation of the Ethereum Foundation.\n\nAfter co-founding Ethereum, Hoskinson went on to found IOHK, a blockchain research and development company that has been involved in a number of high-profile blockchain projects, including the creation of the Cardano blockchain platform.\n\nHoskinson’s focus on creating blockchain solutions that are secure, scalable, and interoperable has earned him recognition as one of the most innovative thinkers in the blockchain industry. His work on Cardano, in particular, has gained significant traction within the blockchain community, with the platform’s focus on research-driven development and scientific rigor setting it apart from other blockchain projects.\n\nAlong with his team, Hoskinson has been actively working on improving the platform’s scalability and interoperability, which are key factors in its continued growth and success.\n\nAnthony Di Iorio\n\nAnthony Di Iorio, another co-founder of Ethereum, played a significant role in the project’s early development. Before Ethereum, Di Iorio was a prominent figure in the Canadian cryptocurrency scene, having co-founded the Bitcoin Alliance of Canada in 2013.\n\nDi Iorio was first introduced to Ethereum by Vitalik Buterin in late 2013, and he quickly recognized the potential of the project. Along with Buterin, Gavin Wood, and several others, Di Iorio contributed to the initial development of Ethereum and helped to secure funding for the project’s launch.\n\nAfter the launch of Ethereum in 2015, Di Iorio continued to play a significant role in the project’s growth and development. He co-founded the Ethereum-based startup Decentral, which aimed to build decentralized applications on top of the Ethereum blockchain. Decentral’s most notable product was Jaxx, a popular multi-currency wallet that allowed users to store and manage multiple cryptocurrencies.\n\nDi Iorio has been a vocal advocate for cryptocurrency and blockchain technology. He has invested in numerous blockchain projects and startups and is widely regarded as one of the most influential figures in the cryptocurrency industry.\n\nConclusion\n\nThe co-founders of Ethereum – Vitalik Buterin, Gavin Wood, Joseph Lubin, Charles Hoskinson, and Anthony Di Iorio – are some of the most influential figures in the blockchain industry. Their contributions to the development of Ethereum have helped to shape the direction of the industry and paved the way for the creation of new blockchain solutions and platforms.\n\nUnderstanding the backgrounds and contributions of Ethereum’s founders is crucial for anyone looking to get involved in the blockchain industry. Their vision and dedication have helped to create a new era of decentralized technology, one that has transformed industries and changed the world as we know it."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMilwFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vcmVwb3J0LW92ZXItMS1iaWxsaW9uLXdvcnRoLW9mLWV0aC1sb3N0LWZvcmV2ZXItbm90LWluY2x1ZGluZy1sb3N0LXdhbGxldC1hY2Nlc3Mtd2lsbC1zY2FyY2l0eS1kcml2ZS1ldGhlci1wcmljZXMtdXAv0gGdAWh0dHBzOi8vd3d3LmNyeXB0by1uZXdzLWZsYXNoLmNvbS9yZXBvcnQtb3Zlci0xLWJpbGxpb24td29ydGgtb2YtZXRoLWxvc3QtZm9yZXZlci1ub3QtaW5jbHVkaW5nLWxvc3Qtd2FsbGV0LWFjY2Vzcy13aWxsLXNjYXJjaXR5LWRyaXZlLWV0aGVyLXByaWNlcy11cC8_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Mar 2023 07:00:00 GMT",
        "title": "Report: Over $1 billion worth of ETH lost forever, not including lost wallet access – Will scarcity drive Ether prices up? - Crypto News Flash",
        "content": "The 2017 parity wallet bug has the highest amount of Ethereum locked, amounting to over 513k Ethers, worth over $924 million in current prices.\n\nHowever, the researchers noted that the figure is a rough estimate as it does not account for Ethereum units locked through lost private keys, among other things.\n\nThe cryptocurrency market is one of the most rewarding global industries but has unregulated risks. As the Web3 industry steers forward with the adoption of the blockchain and cryptocurrency industry, faulty designs and unfriendly protocols for novice users have contributed to losses amounting to billions of dollars. However, it is the thought of lost digital assets, which may never be recovered, that has hindered new traders from fully entering the cryptocurrency industry.\n\nAs such, developers in the Web3 industry are tasked with building user-friendly protocols to help investors not lose their coins. Moreover, the future success of the cryptocurrency and blockchain industry depends on the ability of layperson investors to interact with smart contracts on a daily basis.\n\nCloser Look at Lost Ethereum (ETH)\n\nAccording to recent research by Conor Grogan, the director of product strategy and business operations at Coinbase Global Inc., over $1 billion worth of ether has been completely lost through typos, user errors, and buggy contracts. Notably, Grogan, who regularly posts unique on-chain research work, highlighted that about 636,000 ETH, worth over $1.15 billion, have been lost along the way. Notably, the lost Ethereum represents about 0.5 percent of all circulating supply.\n\nOn the brighter side, the number of Ethereum trapped forever reduces the selling pressure on the existing tokens, thus adding more value in the long run.\n\nReportedly, the 2017 parity wallet bug has the highest amount of Ethereum locked, amounting to over 513k Ethers, worth over $924 million in current prices. With the Ethereum network leading other blockchains in the smart contract industry, over 85k ethers worth about $153 million have been completely locked.\n\nHowever, Grogan noted that the figure is a rough estimate as it does not account for Ethereum units locked through lost private keys, among other things. Grogan noted.\n\nTo be clear, this $1.1B+ number significantly undershoots the actual lost/inaccessible ETH amount- It just covers instances where Ethereum is locked forever. For example, it doesn’t cover lost private keys or things like Genesis wallets that have presumably been forgotten.\n\nInterestingly, about 11.5k Ethers worth approximately $20 million has been sent to a burn address for unknown reasons. The amount of Ethers lost due to NFT minting gone wrong amounts to over 11k.\n\nSome of the biggest losses: -Web3 foundation has 306K ETH ($538M) trapped due to the Parity Multisig bug\n\n-Quadriga lost 60K ($108M) to a faulty contract\n\n-Akutars lost 11.5k ETH in an NFT-mint gone wrong\n\n-People have collectively sent 24k ETH to a burn address for some reason (?) pic.twitter.com/ELAzFTvWe5 — Conor (@jconorgrogan) March 20, 2023\n\nBigger Picture\n\nThe Ethereum network has grown to a worldwide respected blockchain with over $218 billion in market capitalization. With the upcoming Shanghai upgrade, the Ethereum developers project the user interface will ease as investors can withdraw staked ethers.\n\nThis article is provided for informational purposes only and is not intended as investment advice. The content does not constitute a recommendation to buy, sell, or hold any securities or financial instruments. Readers should conduct their own research and consult with financial advisors before making investment decisions. The information presented may not be current and could become outdated."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDMvMjIvYmxvY2tjaGFpbnMtY29tcGF0aWJsZS13aXRoLWlzby0yMDAyMi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Mar 2023 07:00:00 GMT",
        "title": "blockchain compatible with ISO 20022 - The Cryptonomist",
        "content": "ISO 20022 is an ISO standard for electronic data exchange between financial institutions.\n\nThe standard covers financial information that is transferred between financial institutions, such as payment transactions, securities trading and settlement information, credit and debit card transactions, and more.\n\nThanks to ISO 20022, a huge amount of financial services metadata, stored in UML models with a special ISO 20022 UML profile, has been shared and standardized.\n\nAmong the organizations using ISO 20022 is SWIFT, which is the world’s leading messaging network through which international payments are made.\n\nThe standard was developed in 2013, or four years after Bitcoin was born, is issued by ISO Technical Committee 68 (TC68), and is managed by Working Group 4 (WG4), a subgroup of TC68.\n\nSince 2015, when Ethereum was being born, it has been widely adopted by European Union countries, as well as Switzerland, Britain, India and Japan, Australia, Canada, and New Zealand , as well as South Africa and Singapore.\n\nThe US Fed, on the other hand, began adopting it only in 2020, with the migration process expected to end only this year. This means that by now only China and Russia are not using it as a standard among large economies, in addition to South Korea and Brazil.\n\nISO 20022 blockchains\n\nIn light of all this, it is not at all strange that older blockchains, such as Bitcoin, are not compatible with this Standard, nor is it surprising that blockchains developed in Asia are not.\n\nIt is also not surprising that Ethereum is not compatible, because it is a project born when the ISO 20022 Standard was still spreading. Moreover, it had not yet been widely adopted in the US at that time.\n\nThe case of Ripple (XRP) is curious.\n\nIndeed, Ripple is a blockchain that was born in 2012, i.e., before the release of the ISO 20022 standard, and is a fundamentally US project. Yet it turns out to be among the few compatible blockchains.\n\nThe reason is that Ripple over time has specialized specifically in banking or institutional transactions, and so it wanted to integrate ISO 20022 compatibility over time in order to interact with the financial institutions that are using it.\n\nThe other major blockchain project that is compatible with this standard is, not surprisingly, Stellar (XLM), which is a project that grew out of a rib of Ripple when Jed McCaleb resigned as CTO of Ripple in 2013 specifically to found Stellar in 2014.\n\nStellar, however, is a very different project from Ripple because it is not run by a single for-profit company, but is intended to be a truly decentralized protocol.\n\nIt is worth noting that compatibility with ISO 20022 seems to have benefited only Ripple, which continues to be one of the top ten crypto projects in the world by market capitalization. In fact, XLM has now plummeted to 28th in this special ranking, surpassed even by outdated projects such as Bitcoin Cash.\n\nHowever, there are other blockchains that are compatible with this standard.\n\nFirst, there is Algorand, with its ALGO cryptocurrency. Although this is a project often considered to be of a high standard, so far it has been far less successful than the alternatives. It is enough to say that ALGO has fallen to 37th place by market capitalization.\n\nInterestingly, there are two other ISO 20022-compatible blockchains whose cryptocurrencies have very similar capitalization to ALGO: Hedera (HBAR) and Quant (QNT).\n\nTaking XRP, which capitalizes at $22.5 billion, as a benchmark, XLM capitalizes at only one-tenth ($2.4 billion), while HBAR (1.9), ALGO (1.6) and QNT (1.5) are all very close to just over half of XLM.\n\nAs far as is known, only two other ISO 20022-compliant blockchains remain, namely IOTA (MIOTA) and XDC Network (XDC).\n\nIOTA is a special case, because it was once among the most promising crypto projects, but then seems to have completely stalled due to major technical problems. Its cryptocurrency MIOTA has plummeted to 78th place by market capitalization with less than $600 million. It is enough to think that it capitalizes less than BitTorrent’s BTT, or BSV (Bitcoin SV), and its current value is lower than even its value at launch in June 2017.\n\nXDC capitalizes even less (550 million), but it has never been a particularly successful project. It is a project that was launched just under five years ago, and until February 2021 it had never been particularly talked about.\n\nSo except for XRP, which is a story in itself, none of the other blockchains compatible with the ISO 20022 standard have yet achieved much success. Indeed, only Ripple among them has an effective ongoing relationship with traditional financial institutions."
    }
]