[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vZm9ya2FzdC5uZXdzL2lzLWV0aGVyZXVtLW9uY2UtYWdhaW4tdmljdGltLW93bi1zdWNjZXNzL9IBQ2h0dHBzOi8vZm9ya2FzdC5uZXdzL2lzLWV0aGVyZXVtLW9uY2UtYWdhaW4tdmljdGltLW93bi1zdWNjZXNzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Is Ethereum once again the victim of its own success? - Forkast News",
        "content": "Ever since Ethereum’s shift to a proof-of-stake (PoS) consensus mechanism, an increasing number of users are getting in on the staking action to reap the rewards that come with it. Institutions are also paying attention, given the decrease in network risk and volatility following “The Merge.” This has led to concerns about how much ETH is getting locked into staking contracts, potentially interfering with liquidity on the network.\n\nDevelopers are already proposing possible solutions to limit the rate of staking, which benefits overall network health but has now limited the opportunities for users to earn a yield from the network. Coupled with an ongoing DeFi winter, there just aren’t as many lucrative returns opportunities in this space as there once were. Truth is, without profitable and reliable alternatives, ETH holders are going to continue to be drawn to staking as the best means of generating return on their assets.\n\nThe rise of Ethereum staking\n\nIt’s been about a year since Ethereum successfully completed the Merge, in which the blockchain switched from a proof-of-work (PoW) consensus mechanism, like Bitcoin, to a PoS one. This was done to significantly improve the efficiency of the Ethereum network and allowed users to earn a passive income by staking their ETH to secure the network. Ethereum 2.0 was born.\n\nOverall, this has been seen as a positive move for the Ethereum network. A significant number of users have staked their assets already, to the tune of 20% of all circulating Ether. In theory, this sounds great, as the idea is that a diverse array of users are both helping to ensure the security of the blockchain and are being rightly rewarded for doing so. The reality, however, is a bit different.\n\nThe rise of large staking providers have made it easier for virtually anyone to get involved, but this is causing the amount of ETH that is staked to continue to quickly rise. At the current trajectory, the amount of ETH locked up could balloon up to as much as 50% by May 2024 and even approach 100% by December next year, according to projections in an Ethereum Improvement Proposal co-authored by Ethereum co-founder Tim Beiko. While actually seeing the entire supply of Ethereum get locked up won’t happen, this situation could still cause a significant liquidity crunch that limits the functionality of the blockchain ecosystem, decentralized apps, and services built on top of it.\n\nThis fiasco has led to Ethereum developers approving a new proposal that would control the rate at which new validators could stake ETH. Known as EIP-7514, this change will modify the “churn limit” function to give it a maximum value that will regulate how many validators are able to join or exit the network within a given timeframe. The proposal is already being included in the Cancun-Deneb upgrade that was slated for this October but will likely now be delayed until early next year.\n\nWhile EIP-7514 will help to buy some time, it doesn’t actually address the underlying problem. Namely, the fact that Ethereum staking, as is, incentivizes locking up funds over keeping them liquid. It’s true that users don’t have to stake Ethereum directly but can turn to other yield-bearing services. However, in the wake of FTX and other recent disasters, the entire DeFi market has seen an almost 80% contraction over the last year. This means there are fewer and less useful places for asset holders to earn yield.\n\nWhat alternatives need to offer\n\nUsers need a safe and lucrative alternative that has advantages to staking, even if the returns aren’t quite at the level provided by staking. These could come in the form of yield-generating accounts that allow for returns on the Ethereum stored inside them, but don’t have days or weeks-long limits on when funds are accessible. Because no staking is actually done, users stay in full control of their own assets.\n\nBetter still, accounts such as these could be significantly more user-friendly than the confusing, alienating process of Ethereum staking, holders would simply need to deposit their funds and sit on them. They could remove them at any time, and overall liquidity on the network is not affected. Users also wouldn’t rely on the health of DeFi as a whole, and will generate returns regardless of what the market is doing.\n\nAnother essential aspect of these offerings is that they can also be “ring-fenced,” meaning the assets are never intermingled with other user’s funds or company activities and aren’t exposed to broader systemic risk. Assets that are used for growth opportunities are separate from those that are just being held as savings. This is important for keeping users safe, as even if the service itself should collapse, all held funds will be completely intact.\n\nImplementing a service where anyone can grow savings without the need to lock up ETH is the ultimate key to solving the ongoing staking issue that is plaguing Ethereum. Protocol changes are helpful, but what is essential is changing the incentive that users have for earning yield on their assets. By providing growth opportunities that don’t involve actual staking, these accounts can be simpler, safer and healthier for the whole ecosystem than centralized alternatives. The solution is obvious; now it’s time to bring something like this to Ethereum holders worldwide."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LnByb3ZpZGVuY2Vqb3VybmFsLmNvbS9zdG9yeS9zcGVjaWFsL2NvbnRyaWJ1dG9yLWNvbnRlbnQvMjAyMy8xMS8xNC90aGUtZXZvbHV0aW9uLW9mLWV0aGVyZXVtLzcxNTgyOTI3MDA3L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "The Evolution of Ethereum - The Providence Journal",
        "content": "William Mullane\n\nContributor\n\nOnce is was developed, word quickly spread about the potential of Ethereum, attracting developers from all corners of the globe. The community grew rapidly, becoming a vibrant ecosystem of innovation and collaboration. Each new member brought unique skills and ideas to the table, further enriching the platform. Ethereum was becoming a hub of creativity, with its limitless possibilities captivating the hearts and minds of those involved.\n\nAs Ethereum progressed, it underwent a series of updates and improvements. The team introduced Homestead, a more stable version of the platform, followed by Metropolis, which brought enhanced privacy features. With each update, Ethereum pushed the boundaries of what was possible, captivating even more developers and users.\n\nBut the Ethereum Virtual Machine (EVM) was the real game-changer. It allowed developers to write smart contracts in various programming languages, opening the platform to a wider audience. Suddenly, anyone with coding skills and a vision could create decentralized applications on Ethereum, igniting a wave of innovation and propelling its growth.\n\nThe increasing popularity of Ethereum did not go unnoticed by investors. The value of its native cryptocurrency, Ether, increased, attracting additional funding. Ethereum became a hotspot for Initial Coin Offerings (ICOs). Startups soon leveraged the platform to raise millions of dollars. This marked the birth of a new economy driven by smart contracts fueled by Ether, leading even Bitcoin to follow through its Lightning Network.\n\nWith success came challenges. Ethereum faced scalability issues as its user base expanded. But the team behind Ethereum remained relentless. They embarked on a mission to address these concerns and make Ethereum even more robust. This journey led to the development of Ethereum 2.0, a major upgrade aiming to enhance scalability and security through a new consensus mechanism known as Proof of Stake.\n\nThe story of Ethereum is an ongoing saga, with each chapter unveiling exciting new advancements and thought-provoking challenges. It demonstrates that a single idea can transform an entire industry and inspire countless others. Ethereum's evolution is due in large part to the resilience and ingenuity of its enthusiastic community.\n\nAnd as the journey of Ethereum continues, the possibilities are boundless. From a visionary's abstract concept to a billion-dollar blockchain that has captured the world's attention, Ethereum's impact on the future of finance, technology, and beyond is immeasurable. Furthermore, the Ethereum community's spirit of collaboration and passion will undoubtedly guide its path as it paves the way for a future where possibilities are limitless.\n\nThis is for informational purposes only. Please invest at your own risk."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vY3J5cHRvLm5ld3MvZXRoZXJldW0tbWFpbnRhaW5zLXBvc2l0aW9uLWFib3ZlLTJrLWFmdGVyLWV0Zi1wcm9wb3NhbC1zdXJnZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Ethereum maintains position above $2k after ETF proposal surge - crypto.news",
        "content": "Ethereum (ETH) has been holding above the $2,000 mark as investment products significantly surged after the exchange-traded fund proposal.\n\nThe largest asset manager with $9.4 trillion of assets under management, BlackRock, registered an iShares ETH Trust on Nov. 9. Since the proposal, Ethereum saw a 9% rise, surpassing the crucial $2,000 mark.\n\nETH price, whale activity, open interest and Binance funding rate – Nov. 14 | Source: Santiment\n\nAccording to data provided by Santiment, following the rise, whale transactions consisting of at least $100,000 worth of ETH surged by 25% over the past 24 hours — hiking from 2,151 to 2,678 transactions over the past day.\n\nYou might also like: NFT market revives as major collections soar in sales and volume\n\nAccording to a crypto.news report on Nov. 13, whales have accumulated over $58 million worth of Aave (AAVE), Ethereum, Arbitrum (ARB), Pepe (PEPE), and a few more altcoins over the past week.\n\nWith the hike in whale activity, data provided by Santiment shows that ETH’s price-daily active addresses (DAA) divergence took a deep dive, declining to negative 45.17%. When the price DAA divergence drops to below zero, the indicator suggests a “sell” signal since large whales might manipulate the market.\n\nOn the other hand, per Santiment, Ethereum’s total open interest (OI) declined from $4.15 billion on Nov. 10 to $3.85 billion at the time of writing.\n\nMoreover, ETH’s Binance funding rate currently stands at 0.02%, suggesting the dominance of short position holders until further movements.\n\nEthereum is up by 0.7% in the past 24 hours and is trading at $2,050 when writing. The asset’s market cap rose to $247.5 billion with a 24-hour trading volume of $13.4 billion.\n\nFollow Us on Google News"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzExLzE0L3Nob3VsZC15b3UtYnV5LWV0aGVyZXVtLXdoaWxlLWl0cy11bmRlcnBlcmZvcm1pbmcv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Should You Buy Ethereum While It's Still Underperforming the Market? - The Motley Fool",
        "content": "At first glance, Ethereum (ETH 2.45%), the world's second-most valuable cryptocurrency, seems to be having a banner year. Ethereum is up 57% and appears to be gaining momentum heading into the final weeks of the year. Over the past 30 days, Ethereum is up more than 20%.\n\nBut context matters, and right now, Ethereum is badly underperforming the crypto market. Bitcoin (BTC 5.54%), for example, is up a spectacular 112% this year. And other top cryptocurrencies are similarly posting triple-digit gains in 2023. All of this has complicated the decision-making calculus around Ethereum, which now looks like a market laggard. If you are thinking about buying Ethereum, this is what you need to know.\n\nWhy is Ethereum underperforming?\n\nWhat's particularly puzzling about Ethereum this year is that it's just so hard to pinpoint exactly why it's underperforming Bitcoin and other top cryptos. Heading into 2023, Ethereum seemed to be riding a wave of momentum after pulling off The Merge, which was widely hailed as one of the greatest technical achievements ever in the blockchain world. As a result of The Merge, Ethereum changed its overall blockchain infrastructure, all with the goal of reducing transaction fees, boosting transaction processing speeds, and improving overall efficiency.\n\nBut a number of issues have popped up throughout this year. For one, overall activity on the Ethereum blockchain seems to be down and that's not a good sign for future growth. Case in point: Bitcoin recently passed Ethereum for the first time ever in terms of 24-hour non-fungible token (NFT) sales volume, an area Ethereum has always dominated. And Total Value Locked (TVL), which measures activity on the blockchain, also recently reached a 12-month low, a potential sign of Ethereum's weakening position in decentralized finance. These might just be short-term blips on the radar, but they are still concerning.\n\nThere have been regulatory concerns, too, such as those related to staking activity on Ethereum's brand-new proof-of-stake blockchain. The primary concern is that the SEC's willingness to go after major cryptocurrency exchanges for their staking activity, as we saw earlier this year, will eventually erode the attractiveness of Ethereum as an investment option.\n\nMoreover, The Merge is not having the sort of breakthrough impact it was supposed to have, as measured by transaction fees and transaction processing speeds. For example, transaction fees for relatively straightforward activities, such as buying a new NFT, can sometimes run into the hundreds of dollars. And the main Ethereum blockchain can still only handle 20 to 30 transactions per second, a far cry from the 1 million transactions per second promised years ago.\n\nEthereum vs. Bitcoin\n\nPerhaps the best explanation, though, might be that investors are almost single-mindedly focused on Bitcoin at the moment. Just about everyone seems to be looking ahead to the imminent launch of the first-ever spot Bitcoin exchange-traded fund (ETF), and what that could mean for the broader crypto market. Ethereum almost feels like an afterthought right now.\n\nPerhaps as a result, the longtime strong correlation between Ethereum and Bitcoin appears to be weakening. Until mid-March, the correlation between Bitcoin and Ethereum was nearly 0.95. That's almost a perfect 1-to-1 match in terms of performance. But now the 90-day correlation between the two has dipped to the 0.8 level.\n\nEthereum vs. other altcoins\n\nIn addition, many other cryptos appear to be passing Ethereum right now. That's of particular concern in the case of Solana (SOL 1.82%), which is arguably Ethereum's greatest rival right now in the Layer-1 blockchain space. Solana is up a stunning 325% year to date. While Solana has its own fair share of regulatory and technical issues, investors have largely been willing to shrug them off due to Solana's perceived growth prospects. Solana's new \"crypto phone\" is just one of the most exciting projects.\n\nThese shifting investor perceptions of Ethereum are having an impact on institutional money flows. Quite simply, large institutional investors appear to be taking their money out of Ethereum and moving it into Solana. In 28 of 32 weeks this year, Solana has seen net positive inflows, according to CoinShares, which tracks inflows and outflows into different cryptocurrencies. In contrast, Ethereum has seen outflows. And that has led to CoinShares calling Solana \"the altcoin of choice\" for institutional investors right now.\n\nCan Ethereum bounce back?\n\nAt the end of the day, the decision whether or not to invest in Ethereum comes down to your view of its long-term growth prospects. Ethereum is still the clear leader in just about every niche or sector of the blockchain world and it's one of the few cryptos that seems to have the implicit support of federal regulators. Notably, SEC Chair Gary Gensler has always stopped short of calling Ethereum a \"security.\" And it's not like analysts have completely given up on Ethereum. Standard Chartered Bank, for example, just put out an aggressive $8,000 price target for Ethereum.\n\nGoing forward, I'm keeping a close eye on how Ethereum fends off the threat from rival Solana. This one factor could end up having the greatest impact on Ethereum's long-term growth prospects. If Ethereum is unable to keep up with Solana and other Layer-1 blockchains, that could have a huge impact on my decision of whether or not to invest in Ethereum going forward."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V0aGVyZXVtLXJlc2VhcmNoLXprLXByaXZhY3ktbWFpbm5ldNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Ethereum research explores zk-based privacy for mainnet - Blockworks",
        "content": "New research into the Ethereum blockchain looks at ways to use zk-SKNARKs (zero-knowledge succinct non-interactive argument of knowledge) to enable private transactions using Solidity, the primary programming language on Ethereum.\n\nThis research is primarily focused on being able to enable privacy-enhancing functionality that is traditionally reserved for layer-2 networks built on top of the Ethereum application layer.\n\nAccording to Mirror Tang, co-founder of Salus Security and author of the research paper, enabling ZK functionality within Solidity may remove the need for layer-2 blockchains, such as zero-knowledge rollups.\n\n“A lot of DeFi activity remains on Ethereum L-1, and less so on L-2s,” Tang told Blockworks. “If we can use computational optimization to enable ZK technology on Solidity, we would be able to reduce gas fees on Ethereum itself significantly.”\n\nThis may allow transaction activity to be concentrated on Ethereum rather than its disparate L-2 ecosystems, Tang explained.\n\nThere are existing technical barriers to introducing zk-SNARKs to Ethereum, however.\n\nFor example, Solidity is currently single-threaded in nature, meaning that it executes one transaction at a time. It will be important, therefore, to find ways to introduce multithreading to Ethereum.\n\nFurther, to enable zk-SNARKs to operate effectively and securely on the network, it will be necessary to ensure it is auditable.\n\nBy nature, ZK technology relies on provers to send accurate proofs to third-party verifiers without revealing the information of the statement, meaning there would be additional storage requirements at the verification stage.\n\nAbsent these barriers, Tang’s research indicates Zk-SNARKs on Solidity could enhance privacy and improve MEV resistance by enabling private transactions and voting on existing Ethereum projects. Fast-tracking the verification process would enhance the performance of the blockchain as a whole.\n\nThis research, if pursued, would be entirely open-source, enabling further development and contribution by the Solidity community, Tang said.\n\nHe hopes that his research will be noticed by venture capitalists in the crypto community so that his team can continue working towards making its findings a reality.\n\nInterview with Tang was conducted in Mandarin. Quotes in this article have been translated from Mandarin to English.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ibGFja3JvY2stYmxrLXNlZWtzLWNyeXB0by1leHBhbnNpb24tMTQwMTAwNDg5Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "BlackRock (BLK) Seeks Crypto Expansion, Files for Ethereum ETF - Yahoo Finance",
        "content": "BlackRock, Inc. BLK expands cryptocurrency exposure as the firm files for a spot Ethereum exchange-traded fund (ETF), named iShares Ethereum Trust, with U.S. Securities and Exchange Commission (SEC). The filing was submitted by Nasdaq exchange on behalf of the asset manager.\n\n\n\nFollowing the announcement of this filing, the price of Ethereum surged to its highest level this year before pulling back afterward.\n\n\n\nThe Ethereum ETF, if approved, will be the first of its kind in the United States, allowing investors to gain exposure to Ethereum without having to purchase the cryptocurrency directly.\n\n\n\nThe ETF would track the spot price of Ethereum, meaning that investors would be investing in the price of Ethereum itself rather than in a company that is involved in the Ethereum ecosystem.\n\n\n\nThe move by BLK has once again injected optimism into the crypto markets while initiating discussions around SEC’s regulatory approach to cryptocurrency-based ETFs.\n\n\n\nThe jump in the price of Ethereum is similar to Bitcoin rally experienced this June when BLK had filed an application with SEC to offer a spot Bitcoin ETF.\n\n\n\nIn July, SEC said that the applications filed by BLK and other asset managers for spot Bitcoin ETF were inadequate because the filings did not have enough detail with respect to the “surveillance-sharing agreements”. BLK’s Bitcoin ETF is expected to be approved by SEC by the first quarter of 2024.\n\n\n\nNotably, in June, BLK became the first asset manager to file for the spot Bitcoin ETF, paving the way for a wave of filings by other asset managers like Fidelity, Invesco IVZ and WisdomTree WT.\n\n\n\nThe applications had come at a time when the cryptocurrency industry was already battling criticism by SEC over alleged securities law violations.\n\n\n\nCoinbase and the world’s largest crypto exchange, Binance, were already sued by SEC, alleging securities violations.\n\n\n\nThus, SEC had proposed new custody rules that would place additional responsibilities on asset managers to make sure that customers’ assets were kept in properly segregated accounts.\n\n\n\nIn October 2021, IVZ withdrew its original application for a Bitcoin ETF (made earlier in 2021) because of regulatory headwinds within the industry. At that time, SEC was resistant in approving such funds due to concerns over potential fraud and market manipulation.\n\n\n\nLikewise, in October 2022, WT’s application for the launch of the WisdomTree Bitcoin Trust was not approved by SEC on account of insufficient investor protection.\n\n\n\nHowever, the fact that BLK is filing for a spot Ethereum ETF, following an application for a spot Bitcoin ETF, shows that this asset manager wants to expand its presence in the cryptocurrency markets, signaling a shift in the regulatory landscape.\n\n\n\nOver the past six months, shares of BLK have gained 2.6% compared with the industry’s 8.9% growth.\n\n\n\nStory continues\n\nZacks Investment Research\n\n\n\nImage Source: Zacks Investment Research\n\nCurrently, BlackRock carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nBlackRock, Inc. (BLK) : Free Stock Analysis Report\n\nInvesco Ltd. (IVZ) : Free Stock Analysis Report\n\nWisdomTree, Inc. (WT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vZW5nLmFtYmNyeXB0by5jb20vZXRoZXJldW0tYnVsbHMtYXJlLW9uLXRoZS1tb3ZlLXdoYXQtbm93L9IBRmh0dHBzOi8vZW5nLmFtYmNyeXB0by5jb20vZXRoZXJldW0tYnVsbHMtYXJlLW9uLXRoZS1tb3ZlLXdoYXQtbm93L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Ethereum bulls are on the move – What now? - AMBCrypto English",
        "content": "ETH prices surged as traders became hopeful.\n\nGas usage on ETH rose while overall interest in the network grew.\n\nEven though Ethereum [ETH] was late to the crypto rally, over the past few days, ETH prices have more than compensated for the delay.\n\nBulls take the lead\n\nETH saw an increase in Block trades in the last few days, totaling 60,000 options and making up 40% of the day’s volume, valued at $120 million.\n\nThe primary trades were Dec-calls, featuring a significant number of naked-buy ITM options, including a large order nearing $50 million, potentially closing out a previous market maker’s position.\n\nIn the ongoing bull market, some significant investors established long positions in October, reaping profits. The bull market persists, and these major investors are yet to close their positions, maintaining their optimistic stance.\n\nThe heightened trading activity, particularly in December calls and large orders, could influence Ethereum’s price dynamics. If the bullish sentiment continues, it may lead to an upward trend in ETH prices.\n\nHowever, the market’s reaction to such large trade and options activity can also introduce volatility, impacting short-term price movements.\n\nMarket makers closing out positions or adjusting strategies could contribute to increased volatility. Traders need to stay vigilant, considering these factors when making decisions.\n\nEthereum’s price performance is interconnected with market sentiment, and ongoing trends could shape the trajectory of ETH in the near term\n\nBack on the business day, ETH began to see more Block trade again, with 60,000 options accounting for 40% of the day's total volume, with a notional value of $120 million.\n\nThe main trade is Dec-calls, the largest of which included a large number of naked-buy ITM options, with a… pic.twitter.com/usnN0NK864 — Greeks.live (@GreeksLive) November 13, 2023\n\nState of ETH\n\nAt press time, ETH was trading at $2,112.79. It had grown by 9.6% in the last 24 hours. This surge might draw more investors, possibly driving prices higher.\n\nIts network growth also spiked. This indicated that new addresses were showing interest in the token.\n\nMoreover, the velocity of ETH had also grown. A rising velocity meant that the number of times ETH was being transferred increased.\n\nThese factors bode well for ETH. The possibility of ETH reaching even higher may become a reality if these bullish trends continue.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nIn terms of the state of the network, the gas used on the network has remained high. This implied that activity on the network was high and interest in the protocol was soaring.\n\nHigh usage of the Ethereum network could help with ETH’s price, during volatile times."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2V0aGVyZXVtLXNvbGFuYS1sZWFkLWRlZmktc3VyZ2UtYXMtdHZsLWFuZC1kZXgtYWN0aXZpdHktc29hci_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Ethereum and Solana lead DeFi surge as TVL and DEX activity soar - CryptoSlate",
        "content": "The DeFi sector has experienced a significant increase in both activity and token prices, primarily driven by Bitcoin’s October rally. Central to understanding this landscape is the concept of Total Value Locked (TVL) and decentralized exchange (DEX) volumes, two critical metrics that offer insights into the health and trajectory of DeFi protocols.\n\nTVL, the aggregate value of assets deposited in DeFi protocols, serves as a barometer for sector health and investor sentiment. CryptoSlate analysis found an interesting growth pattern across various chains. Ethereum, the frontrunner with $25.336 billion in TVL, has seen a 31.14% increase over the past month, cementing its dominant position in the DeFi space. Solana, though lower in overall TVL, showed the highest growth rate at 89.31%. Notably, all chains recorded positive growth over the month, indicating a robust expansion across the sector.\n\nThe number of active users on these chains offers additional insights. Despite its lower TVL, Tron boasts a significantly larger active user base of 1.69 million, which could result from a more retail-oriented user landscape. Conversely, Ethereum’s lower active user count than its TVL might indicate a higher engagement of institutional or sophisticated, high-net-worth investors.\n\nThe market cap to TVL ratio is another critical metric, shedding light on the market’s perception of a chain’s value. Ethereum’s ratio of 9.72 suggests a mature market. In contrast, Solana’s higher ratio of 43.49 indicates either potential growth opportunities or an undervalued ecosystem, warranting closer investor scrutiny.\n\nName Protocols Active Users 1D Change 7D Change 1M Change TVL Stablecoins 24h Volume 24h Fees Market Cap to TVL ratio 1.Ethereum 946 304,493 -0.12% +6.50% +31.14% $25.473b $64.929b $1.718b $7.27m 9.63 2.Tron 26 1.69m -1.34% +5.04% +25.14% $8.291b $47.455b $11.33m $1.66m 1.13 3. BSC 663 945,060 +0.22% +1.70% +12.58% $2.996b $4.992b $429.32m $348,294 12.62 4.Arbitrum 481 133,870 -0.38% +10.90% +25.21% $2.095b $1.844b $925.94m 0.66 5.Polygon 488 +1.28% +8.10% +21.93% $852.6m $1.17b $369m $87,858 10.06 6.Optimism 197 91,508 -0.12% +11.94% +25.87% $739.39m $576.85m $109.27m 2.11 7.Avalanche 344 33,880 -1.04% +12.63% +28.18% $615.82m $1.07b $140.2m $36,244 9.73 8.Solana 115 -1.55% +23.58% +89.31% $530.8m $1.513b $425.62m $108,773 42.62\n\nTable showing the TVL, active users, volume, and market cap to TVL ratio for the 8 largest L1 chains on Nov. 14, 2023 (Source: DeFi Llama)\n\nDEX volumes provide a lens into the trading activity within these ecosystems. Ethereum leads with a 24-hour volume of $1.718 billion, accounting for a substantial portion of the total market. The rapid growth in DEX volumes on platforms like Solana and Polygon, with increases of 81.35% and 86.32%, respectively, reflects growing user adoption and confidence.\n\nName Weekly change Volume (24h) Volume (7d) TVL % of total Cumulative volume 1. Ethereum +27.29% $1.718b $10.65b 5.941b 37.12% $1.888t 2. Arbitrum +58.15% $925.94m $4.415b 1.127b 20.00% $138.902b 3. BSC +7.54% $429.32m $2.752b 1.577b 9.27% $757.4b 4. Solana +81.35% $425.62m $2.571b 185.78m 9.19% $54.616b 5. Polygon +86.32% $369m $1.711b 0 7.97% $101.421b Table showing trading volumes and total value locked for decentralized exchanges (DEXs) across the five largest L1 chains on Nov. 14, 2023 (Source: DeFi Llama)\n\nThe observed trends in TVL, active users, and DEX volumes show a market booming with activity. Ethereum continues to lead, both in terms of TVL and DEX volume, signaling strong investor confidence and market dominance.\n\nHowever, the rapid growth of newer platforms like Solana and Polygon suggests a diversifying landscape, with different chains catering to varied user needs and investment profiles. The market cap to TVL ratios further confirms the growth potential of lower market cap chains, with Solana and Polygon positioning themselves for future growth."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vdGhlZGVmaWFudC5pby9zb2xhbmEtb3ZlcnRha2VzLWV0aGVyZXVtLWJ5LWFjdGl2ZS11c2Vycy1hZnRlci03MC1zcGlrZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 12:35:55 GMT",
        "title": "Solana Overtakes Ethereum By Active Users After 70% Spike - The Defiant - DeFi News",
        "content": "Solana surges past Ethereum but Layer 2s are still king\n\nBy: Samuel Haig • Loading...\n\nDeFi News\n\nThe number of daily active users on Solana overtook the Ethereum mainnet on Nov. 11 following a sharp uptick in activity.\n\nAccording to data to Artemix, Solana hosted 356,300 unique users on Saturday, surpassing Ethereum’s nearly 330,000 by 10%. The milestone was driven by a sharp uptick in activity on Solana, with the network hosting only 208,000 active addresses on Nov. 7.\n\nFor comparison, Ethereum consistently hosted between 290,000 and 350,000 users daily over the majority of the past three months, with two brief spikes above 400,000 and a surge to more than 1M wallets.\n\nDaily active users on various Layer 1 networks. Source: Artemis.\n\nThe milestone is the latest sign of Solana’s recovery following last year’s brutal bear and the fallout from the collapse of its major investor, FTX.\n\nThe price of SOL plummeted more than 96% from its November 2021 all-time high of $250 to less than $10 in January, according to CoinGecko. Active addresses on the network shrank 85% from 1.28M in May 2022 to around 200,000 this September, according to The Block.\n\nBut Solana refused to stay down, with the network outperforming the broader markets amid the recent cryptocurrency rally as evidenced by the recent surge in active addresses.\n\nThe price of SOL is up 145% in four weeks, beating out many rival digital assets by at least double. The total value locked in Solana-based DeFi protocols is up 62% over the same period, according to DeFi Llama, while NFT sales volume grew 35% in the past 30 days, according to Crypto Slam.\n\nThe move followed progress towards Solana's firedancer upgrade in the form of a testnet, and dissipating expectations that the FTX bankruptcy estate would soon offload large sums of SOL on the markets.\n\nEthereum’s Layer 2s\n\nWhile some analysts have been quick to pronounce that Solana has flipped Ethereum by active users in response to the recent uptick in activity. However, the Ethereum ecosystem has expanded beyond its base-layer, with the majority of activity now taking place on Layer 2.\n\nDeFi Alpha Premium Content DeFi Daily | Weekdays\n\nDeFi Alpha Letter | Weekly\n\nDefiant Podcast Transcript | Weekly\n\nInbox Dump | Saturday\n\nWeekly Recap | Sunday Looking for Alpha? Become a premium member of The Defiant and join our DeFi Alpha community. Start for free\n\nAccording to data from Token Terminal, more than 800,000 users were active on the top seven Layer 2 networks over the past day combined. Coupled with the Ethereum mainnet, the data suggests more than 1M wallets were active across the Ethereum ecosystem. However, said data does not account for users operating the same wallet across multiple networks.\n\nAccording to L2beat, Layer 2 networks are driving 80% of activity in Ethereum’s broader ecosystem, which is driving roughly 60 transactions per second."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvc29sYW5hLWhpdHMtbmV3LWFubnVhbC1oaWdoLWF0LSQ1OC1hbmFseXN0LXByZWRpY3RzLWV0aGVyZXVtLWtpbGxlci1jb3VsZC1za3lyb2NrZXQtdG8t0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Solana Hits New Annual High At $58 — Analyst Predicts 'Ethereum Killer' Could Skyrocket To $1000 - Nasdaq",
        "content": "Solana (CRYPTO: SOL), once called an ‘Ethereum (CRYPTO: ETH) killer' has experienced a remarkable surge in price, surging by 40% in the past week and reaching a new high for the year 2023 at approximately $58.\n\nWhat Happened: Crypto analyst Jacob Canfield has conducted a comprehensive analysis suggesting that Solana could be on the verge of an unprecedented market surge. Canfield suggests that Solana could potentially increase its market dominance to the range of 12-15%.\n\nCanfield’s analysis is based on several indicators. He highlights the Solana Dominance (SOL.D) chart, noting that even at its peak market cap, it didn’t surpass 3%. With the current trends and the breakout of SOLBTC from its weekly resistance, Canfield envisions a scenario where Solana could enter a parabolic rally phase.\n\nIn my opinion, I think that @Solana is going to continue to be one of the biggest movers during this current bull market cycle and I'm going to lay out some ideas for you.It's possible that with the Ethereum ETF news that some of these ideas don't play out, but it's worth… pic.twitter.com/oii8vWs0W9\n\n— Jacob Canfield (@JacobCanfield) November 9, 2023\n\nCanfield suggests that if Solana continues to trend against Bitcoin (CRYPTO: BTC), it could easily reach a price of $1,000 per coin and claim the second spot behind Bitcoin. \"Solana could triple or quadruple it's all time high market dominance around 12-15% and if it continues to trend against Bitcoin, could easily see a $1,000 per coin and take the #2 spot behind Bitcoin,\" the analyst said.\n\nWill The SEC Finally Approve Long-Awaited Bitcoin Spot ETF? Ask industry experts directly at Benzinga's Future of Digital Assets event happening in NYC on Nov. 14, 2023. Be a part of the discussions where you won't just be a passive spectator. Don't let this chance slip away – secure early bird discounted tickets now!\n\nWhy It Matters: Solana’s gains have been fueled by various factors, including the broader uptrend in the cryptocurrency market and the excitement surrounding Bitcoin ETFs, as well as an increasing appetite for risk among investors.\n\nInterestingly, Solana’s upward trajectory coincides with the daily selling of 250,000 to 750,000 SOL tokens by the FTX bankruptcy estate over the past two weeks. These sales follow the approval by the Delaware Bankruptcy Court in September 2023 to sell 55.75 million SOL tokens.\n\nImage Via Shutterstock\n\nRead Next: Here’s How Much You Should Invest In Shiba Inu Today For A $1M Payday If SHIB Hits 1 Cent?\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nProfit with More New & Research. Gain access to a streaming platform with all the information you need to invest better today. Click here to start your 14 Day Trial of Benzinga Professional\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL2NvaW5wZWRpYS5vcmcvcHJpY2UtYW5hbHlzaXMvZXRoZXJldW0tY291bGQtdHJpZ2dlci1hLW1ham9yLWxpcXVpZGF0aW9uLXdoaWxlLXRlc3RpbmctY3J1Y2lhbC1zdXBwb3J0LWhlcmVzLWV0aC1wcmljZXMtbmV4dC1tb3ZlL9IBjQFodHRwczovL2NvaW5wZWRpYS5vcmcvcHJpY2UtYW5hbHlzaXMvZXRoZXJldW0tY291bGQtdHJpZ2dlci1hLW1ham9yLWxpcXVpZGF0aW9uLXdoaWxlLXRlc3RpbmctY3J1Y2lhbC1zdXBwb3J0LWhlcmVzLWV0aC1wcmljZXMtbmV4dC1tb3ZlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Could Trigger A Major Liquidation While Testing Crucial Support! Here’s ETH Price’s Next Move - Coinpedia Fintech News",
        "content": "Shayan is a digital nomad and a professional journalist. He delivers high-quality engaging articles to Coinpedia through his in-depth research and analysis.\n\nDespite Ethereum’s (ETH) significant price increases towards $2,100, triggered by BlackRock’s application for a spot ETH ETF, there is growing concern about a potential profit-taking downturn as the price approaches a critical support line. Market analysts observe that investors who initiated long positions during the recent price rally are showing signs of impatience as the bullish momentum for ETH fades. Consequently, a drop below this support line could bring a substantial sell-off in the market.\n\nEthereum’s NVT Ratio Still Favors Bulls\n\nOver the last 24 hours, there has been a significant long liquidation after the ETH price failed to hold its momentum near $2,100. As a result, long-position holders liquidated over $7.2 million worth of positions as the price went against their bullish bets.\n\nHowever, there’s a bullish hope that might prevent a sudden decline as the NVT ratio still favors the bulls. Data from IntoTheBlock reveals that the NVT ratio (Network Value to Transaction) has been dropping over the past few days.\n\nThe “NVT ratio” serves as a metric comparing Ethereum’s market capitalization with its transaction volume. A high NVT ratio indicates that Ethereum’s market value significantly surpasses its network’s coin transaction capacity.\n\nThis difference could imply that the altcoin is currently overvalued. Conversely, a low NVT ratio suggests that Ethereum might be undervalued, as it denotes a relatively high transaction volume on the blockchain in comparison to its market cap.\n\nThe ratio has decreased from a peak of 66.91 to a current low of 47, indicating that as increasing numbers of holders engage in ETH transactions, the price of ETH is becoming more affordable.\n\nInterestingly, the long/short ratio currently trades at 0.99. This closely contested scenario reflects a nearly even split, with 49.8% of positions being long and 50.2% being short, highlighting a tough war in the market.\n\nWhat’s Next For ETH Price?\n\nEther recently bounced back from the key $2020 mark, suggesting that bulls are attempting to establish this level as a new support. However, bulls continue to struggle to hold momentum above $2,100. As of writing, ETH price trades at $2,054, declining over 0.5% from yesterday’s rate.\n\nThe buyers are gearing up for another push to breach the $2,200 barrier. If successful, the ETH price could gain significant momentum and potentially surge towards the $2,453 mark. Another push will send the price toward $3,000, especially since there’s no major resistance in that range.\n\nOn the flip side, the bears are preparing to strongly defend the $2,200 level. A reversal from this point could lead to a period of consolidation for the price, oscillating between $2,000 and $2,100. A negative shift in the short-term trend could be triggered if the price not only falls below $2,000 but also stays below it. Under such a situation, the price might plummet toward the 200-day Exponential Moving Average (EMA), currently at $1,860."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMipgFodHRwczovL2NyeXB0b25ld3MuY29tL25ld3MvZ2V0LWFoZWFkLW9mLXRoZS1ldGhlcmV1bS1wcmljZS1leHBsb3Npb24td2l0aC10aGUtZXRoZXRmLXRva2VuLWJlZm9yZS1ibGFja3JvY2stZXRoZXJldW0tZXRmLWxhdW5jaGVzLXByaWNlLXB1bXBzLTQwMC1pbi1lYXJseS1hY3Rpb24uaHRt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Get Ahead of the Ethereum Price Explosion With the ETHETF Token Before BlackRock Ethereum ETF Launches ... - Cryptonews",
        "content": "Get Ahead of the Ethereum Price Explosion With the ETHETF Token Before BlackRock Ethereum ETF Launches – Price Pumps 400% in Early Action\n\nA new cryptocurrency launched today called $ETHETF Token and it is the go-to digital asset to capitalize on approval of a spot Ethereum ETF from fund giant BlackRock.\n\nLaunched at 1pm GMT on Uniswap the price of the coin has rocketed 186% within the first 10 minutes of trading, currently priced at $0.02834. $ETHETF could easily 10x today as news of the launch spreads.\n\nNews that the world’s largest asset manager is planning to launch a spot Ethereum ETF, sent the price of ETH rocking through the important $2,000 level.\n\nBlackRock’s move has added to the excitement surrounding the likely approval of the first spot Bitcoin ETF to be made available to investors in the US.\n\nOn November 9, 2023, the official filing for BlackRock’s Ethereum ETF was made with the US Securities and Exchange Commission (SEC) by Nasdaq. A few days before, BlockRock had registered a corporate entity in Delaware named iShares Ethereum Trust.\n\nWhen the Delaware news broke, the price of ETH shot up 3% and then pumped again when the filing was confirmed. Ethereum is currently trading at $2,048, gaining 10% since the Delaware registration and the SEC filing took place.\n\nEthereum is the most-used blockchain for running applications based on smart contracts and as such is the base layer of Web3 decentralized applications. There are many other blockchain ecosystems vying to be Ethereum killers, but none comes close to Ethereum.\n\nBut you don’t have to wait for the approval by the US Securities and Exchange Commission (SEC) and their subsequent launch, because ETHETF is already trading on decentralized exchanges, enabling savvy investors to get exposure to the Ethereum ETF investment theme and capture the positive returns that have already started to flow.\n\nAn Ethereum ETF will take crypto mainstream and ETHETF Token lets you get in early\n\n\n\nJust as the approval of spot Bitcoin ETF will provide unprecedented validation for the top digital currency, approval of an Ethereum ETF will have a similar effect.\n\nBy providing a regulated way to gain exposure to the crypto asset class, exchange-traded funds promise to transform the existing investment landscape.\n\nExchange-traded funds track the price of an underlying asset by replicating its price performance. This can often be achieved by mirroring an index such as the S&P500. To achieve this end, a fund would need to buy a weighting of the 500 companies that comprise the S&P500 or use derivatives to achieve the same result.\n\nApplying that to ETH, it would mean issuers must buy the asset on the open market or over-the-counter, thus increasing the demand for the token.\n\nETFs exploded onto the financial scene when the first gold products appeared. Gold was the ideal candidate for the ETF treatment. By tracking an index of the gold price ordinary people were able to gain exposure to the precious metal without having to worry about custody expenses and accessing liquidity to trade their bullion.\n\nWhat ETFs have done for commodities, equities, fixed income and other asset classes, they can also do for crypto. Opening up cheap and regulated access to the two most valuable cryptocurrencies could see a wall of new money flowing into the markets.\n\nETHETF price is head for the moon as Ethereum goes mainstream with ETF approval\n\n\n\nWelcoming Ethereum into the world of ETFs is the $ETHETF Token. If Bitcoin’s defining value proposition is its digital gold store of value properties, then Ethereum can reasonably claim to be the king of dApp blockchains.\n\nAs might be expected, $ETHETF is an ERC20-compliant asset, which means it runs on the Ethereum blockchain. This design decision means the coin is linked to the fortunes of the Ethereum ecosystem, providing investors with a foothold inside the ecosystem of the premier blockchain platform.\n\nHowever, to incentivize holding the token and to boost its price, each purchase attracts a 2% burn tax.\n\nBurning 2% of the purchase amount eats into the total supply of 1 billion, thereby enhancing the value of the remaining tokens.\n\nIn addition to the ERC20 connection to Ethereum, the coin also builds into its tokenomics a direct way of celebrating the approval of a spot Ethereum ETF – the 2% burn tax will be lifted when the fund is approved.\n\nFinally, the token’s debut on the Uniswap decentralized exchange is a fair launch as there is no team allocation. The tokenomics allocates 95% of supply to DEX liquidity and 5% for CEX (centralized exchange) listings.\n\nTo buy the token, simply connect your crypto wallet to the DEX, copy and paste in the contract address to make sure you are buying the correct coin and then make your purchase. Be sure to have at least $20 spare in your wallet to pay the transaction gas fee.\n\nBuy $ETHETF todayDisclaimer: Crypto is a high-risk asset class. This article is provided for informational purposes and does not constitute investment advice. You could lose all of your capital."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vaGFja2Vybm9vbi5jb20vdGhlLXJpc2Utb2YtemVyby1rbm93bGVkZ2Utcm9sbHVwcy1pbi1ldGhlcmV1bS1zY2FsaW5n0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "The Rise of Zero-Knowledge Rollups in Ethereum Scaling - hackernoon.com",
        "content": "Too Long; Didn't Read\n\nPeople Mentioned\n\nZero-knowledge rollups are gaining momentum as the ultimate Ethereum scaling solution. They allow to outsource computation, all while leveraging the main chain’s decentralization and security. Unlike their closest competitor, optimistic rollups, zk rollups offer quicker transaction finality time and better user privacy."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzExLzEzL2V0aGVyZXVtLXdhbGxldC1kcmFpbmVyLXN0ZWFscy02MG0taW4tc2l4LW1vbnRocy_SAWJodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8xMS8xMy9ldGhlcmV1bS13YWxsZXQtZHJhaW5lci1zdGVhbHMtNjBtLWluLXNpeC1tb250aHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Wallet Drainer Steals $60M in Six Months - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vYnJhdmVuZXdjb2luLmNvbS9pbnNpZ2h0cy9ibGFja3JvY2stZmlsZXMtZm9yLWV0aGVyZXVtLWV0ZtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Fidelity follows BlackRock - files for Ethereum ETF - Brave New Coin",
        "content": "Fidelity follows BlackRock – files for Ethereum ETF\n\nFinancial management giant Fidelity had filed to create a spot Ethereum ETF that would be listed on an exchange owned by CBOE Global. The news follows a similar filing from BlackRock a week ago.\n\nIt was revealed late last week that financial management giant Fidelity had filed to create a spot Ethereum ETF that would be listed on an exchange owned by CBOE Global. They join fellow institutions, BlackRock, and six others as applicants for a spot Ethereum ETF.\n\nFor the new ‘Fidelity Ethereum Fund’, according to the filing, “each Share will represent a fractional undivided beneficial interest in the Trust’s net assets. The Trust’s assets will consist of ETH held by the Custodian on behalf of the Trust.”\n\nThe fund is pitched as a low-risk way for investors to gain exposure to ETH. Investors will have regulated avenues to gain exposure to Ethereum price action, without needing to worry about custody. This has the potential to drive a broader adoption of cryptocurrency and introduce a new investor base to the asset class.\n\nRetail investors in the United States have not had a regulated, easily accessible spot ETF version of Bitcoin or Ethereum like their counterparts in Europe and other countries. In mid-August 2023, Europe welcomed its first-ever spot Bitcoin ETF after the launch of Jacobi Asset Management’s Jacobi FT Wilshire Bitcoin ETF. “U.S. retail investors have lacked a U.S. regulated, U.S. exchange-traded vehicle to gain exposure to ETH,” the filing explained, noting that current channels for retail investors to access Ethereum involve dealing with counterparty risk, legal uncertainty, and technical risk.\n\nFidelity Follows BlackRock\n\nThe Fidelity news comes soon after BlackRock, the world’s largest asset manager, filed for an Ethereum exchange-traded fund (ETF) with the US Securities and Exchange Commission (SEC) last week. Depending on whose is approved first, the ETH ETF would be the first of its kind in the United States, and would allow investors to gain exposure to Ethereum without having to purchase the cryptocurrency directly.\n\nThe ETF would track the spot price of Ethereum, which means that investors would be investing in the price of Ethereum itself, rather than in a company that is involved in the Ethereum ecosystem. The ETF would be listed on the New York Stock Exchange (NYSE) and would be available to both retail and institutional investors.\n\nFollowing the news, the price of ETH surged to its highest level this year near $2,132, before pulling back afterwards.\n\nThe price of ETH jumped on the ETH news\n\nThe immediate jump in price is similar to the Bitcoin rally in June when BlackRock filed an application to list a spot Bitcoin ETF. ETFs stand for exchange-traded products, and they offer a convenient way for investors to buy exposure to an asset without having to own it themselves.\n\nThe news follows BlackRock’s existing application for a spot-based Bitcoin ETF, which is expected to be approved by the US Securities and Exchange Commission by Q1 2024.\n\nThe company’s Ethereum ETF plan was revealed in a filing by Nasdaq, the U.S. exchange where BlackRock will seek to list the ETF. On Thursday, we learned that the corporate entity “iShares Ethereum Trust” was registered in the state of Delaware; iShares is the name of BlackRock’s ETF division.\n\nThe filing states that U.S.-based crypto exchange Coinbase will be the custodian for the ETH held by the ETF, while an unnamed third party will hold its cash. BlackRock has a market-surveillance agreement with Coinbase; these surveillance-sharing agreements are seen as necessary for crypto ETFs to win approval by the U.S. Securities and Exchange Commission.\n\n“Either CME surveillance can detect spot-market fraud that affects both futures ETFs and spot exchange-traded products, or that surveillance cannot do so for either type of product,” said the filing. “Having approved ETH futures ETFs in part on the basis of such surveillance, the Commission has clearly determined that CME surveillance can detect spot-market fraud that would affect spot ETPs, and the Sponsor thus believes that it must also approve spot ETH ETPs on that basis.”\n\nMeanwhile, Galaxy Digital founder Mike Novogratz spoke to investors and said that 2024 will see the long awaited institutional adoption of crypto assets, following the approval of a slew of ETF applications. During Galaxy Digital’s third-quarter earnings call Novogratz said that the SEC’s approval of multiple ETFs “is now not a matter of if but when.” Galaxy Digital has filed for spot Bitcoin and ETH ETF applications.\n\nNot a Sure Thing\n\nWhether or not the spot-based Ethereum ETFs will be approved, however, remains uncertain. At present, the market’s view is that the long-awaited Bitcoin spot ETFs are almost certainly going to be approved by Q1 2024.\n\nThis is reflected by the analysis of Bloomberg ETF analyst James Seffart, who puts the odds of a spot Bitcoin ETF approval at 90% by January 10 as the tweet below shows.\n\nA spot ether ETF approval is less certain. The SEC has up to 240 days to decide whether or not to approve a product, which puts any potential release date deep into late 2024 at the earliest.\n\nAnother potential complication is the murky status of ETH itself, in the eyes of regulators. While the SEC views Bitcoin as a commodity, and not a security, SEC Head Gary Gensler has consistently declined to offer a definitive statement of ETH, instead hinting that outside of Bitcoin, all crypto assets are potentially securities.\n\nAs the crypto industry continues to push for clearer guidelines, the status of ETH in the eyes of the SEC will be one of the first and most important dominoes to fall.\n\n—"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy90b2tlbnVtLXVudmVpbHMtaW5ub3ZhdGl2ZS1nYXNsZXNzLXBsYXRmb3JtLTE1NTUwMDQ5Ny5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Tokenum Unveils Innovative Gasless Platform for the Ethereum Blockchain - A Game-Changer for the World of ... - Yahoo Finance",
        "content": "Tokenum\n\nTOKYO, JAPAN, Nov. 13, 2023 (GLOBE NEWSWIRE) --\n\nTokenum, a pioneering cryptocurrency platform, is proud to introduce its groundbreaking \"gasless technology.\" This revolutionary innovation simplifies cryptocurrency transactions and token offerings on the Ethereum blockchain, ushering in a new era of user-friendly accessibility.\n\nThe platform has already embarked on alpha testing, with an accelerated beta version scheduled for release within a week.\n\nRevolutionary Technology\n\nTokenum's gasless technology marks a significant advancement in the cryptocurrency landscape for several compelling reasons.\n\n1) Innovative Gas-free Transactions\n\nIn traditional banking, transaction fees are paid using the same currency that is being transacted. However, in the world of cryptocurrency, fees are often paid in another, blockchain-specific digital currencies. Such fees are referred to as \"gas.\" Tokenum's gasless technology eliminates the need for users to grapple with this complex concept, making cryptocurrency more accessible to a broader audience.\n\n2) Supercharged Token Sales\n\nNew cryptocurrency projects face various challenges, including scheduling, legal compliance, compatible wallets, and sale regulations. Additionally, for users to participate in project sales, users must first acquire specific coins to cover blockchain gas fees. Tokenum's gasless technology simplifies this process, making it easier for crypto projects to attract users and maximize revenue from each sale.\n\n3) NFT Industry Transformation\n\nTokenum's gasless technology presents an opportunity to reshape the NFT industry. NFT creators and owners can now prepay for NFT transfers, removing the burden of gas payments for users. This opens the door to entirely new audiences and streamlines the process, making it as effortless as managing digital art on Instagram or Pinterest.\n\n4) Removal of Entry Barriers for New Ecosystems\n\nTokenum also benefits new blockchains by allowing users to leverage the tokens they already have, eliminating the need to acquire blockchain-specialized coins for different networks and ecosystems. This significantly simplifies the sophisticated process of navigating and using new blockchains, platforms, or even metaverses.\n\nStory continues\n\nAll Gas No Brakes and Light-Years Ahead\n\nOne of the most notable aspects of Tokenum is its current full-fledged operational status. While other industry players, such as Circle Inc., Auros, 0xGasless, Open Zeppelin, and more, are still in the developmental stages, Tokenum is live and fully functional on the Ethereum network. The platform's future plans include expanding its support to encompass additional networks.\n\nThe AI-Powered CEO Behind Tokenum\n\nTokenum's powerful technology is spearheaded by a distinctive team, represented by Takeshi Tokenai, an AI-powered CEO. Notably, Takeshi was formally appointed as the leader on July 1, 2021, making him the world's first AI CEO. Conversely, Tokenum's technological prowess is underpinned by the collective expertise of its international team, boasting two decades of experience in the realms of cybersecurity, high technology, and blockchain. When asked to share their comments on the matter, Takeshi Tokenai's only statement was: \"Tokenum is here to take the crypto world by storm.\"\n\nWhat Lies Ahead\n\nIn summary, Tokenum's gasless technology is reshaping the cryptocurrency landscape by simplifying transactions, facilitating token sales, and supporting the growth of new blockchains. Now the project is already integrated with CyberWallet, the one of the most secure wallets at the market, and HyperID, the single identity solution. Together, they creates seamless entrance to any web3 project, space or activity for any user, regardless of their crypto skills. Tokenum is poised to become a major player in the future of cryptocurrency.\n\nCurrently, the company is offering giveaways and opportunities on its X channel (formerly Twitter), as well as on Zealy and QuestN, prominent crypto-community platforms. In the cryptocurrency world, such initiatives often signal preparations for rapid expansion and the potential launch of their own token.\n\nFor further updates and insights, please visit Tokenum's official website: https://tokenum.net\n\n\n\nJoin the conversation on Tokenum's X channel (formerly Twitter) by following @tokenum\n\n\n\n\n\n\n\nFor more information, press inquiries, or collaboration opportunities, please contact:\n\nTakeshi Tokenai at info (at) tokenum.net\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, or intended as investment advice, financial advice, or trading advice. It is strongly recommended that you practice due diligence (including consultation with a professional financial advisor) before investing in or trading securities and cryptocurrency.\n\nCONTACT: Takeshi Tokenai info at tokenum.net\n\n\n\n"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZW5nLmFtYmNyeXB0by5jb20vYml0Y29pbi1ldGhlcmV1bS1ncmFiLXRoZS1hdHRlbnRpb24tb2YtdGhlc2UtY29ob3J0cy_SAVNodHRwczovL2VuZy5hbWJjcnlwdG8uY29tL2JpdGNvaW4tZXRoZXJldW0tZ3JhYi10aGUtYXR0ZW50aW9uLW9mLXRoZXNlLWNvaG9ydHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin, Ethereum catch the attention of these whales - AMBCrypto English",
        "content": "Large transactions for Bitcoin and Ethereum increased by 80% and 170%, respectively.\n\nBTC and ETH have maintained their new price ranges despite declines.\n\nThe current upward trend of the crypto market has drawn the interest of large investors and institutions. As per a report from IntoTheBlock, there has been a significant rise in the volume of Bitcoin [BTC] and Ethereum [ETH] transactions exceeding $100,000.\n\nInstitutional and whale demand has picked up strongly, with Bitcoin seeing an 80% increase in the volume of transactions of over $100k, Ethereum 170%, and Polygon over 3,800% compared to 30 days ago. pic.twitter.com/ElM1CDZ3wA — IntoTheBlock (@intotheblock) November 11, 2023\n\nThe data presented in the tweet above indicated an 80% increase for BTC and a 170% increase for ETH. This suggested a rise in demand from institutional and large-scale investors as the prices of BTC and ETH climbed.\n\nThe increased interest from these groups boosted transaction volume. Also, it held the potential to further influence the trend of prices.\n\nAn analysis of Bitcoin and Ethereum’s large transactions\n\nAMBCrypto took a closer look at the Whale Transaction Counts for Bitcoin and Ethereum, which revealed increased activity for both coins. In the case of Ethereum, the chart for November showed consistent spikes in transactions, going over 1,900 on the 9th of November.\n\nThis metric rose to 1,400 on the 10th of November, a number last seen in August. As of this writing, the number was around 576.\n\nBitcoin’s chart for November indicated a similarly active period. Notably, large transactions have consistently exceeded 3,000 since around the 8th of November. It reached another peak on the 10th of November and maintained a level above 3,000 on the 11th of November.\n\nAs of press time, the count of Bitcoin transactions sat at around 582. This underscored the observations from IntoTheBlock, emphasizing the increased involvement of large wallets and institutional players in these markets.\n\nBTC and ETH maintain newfound price ranges\n\nAs of this writing, Bitcoin was experiencing a decline of less than 1%, with its press time value hovering around $37,100. This followed a similar trend at the end of the trading session on the 11th of November, where it closed with a loss of less than 1%, at $37,228.\n\nFortunately, these setbacks were not enough to disrupt the king coin’s ongoing bullish trend. It maintained a position above its short-moving average at the time of publication, indicating a strong price movement.\n\nRead Bitcoin’s [BTC] Price Prediction 2023-24\n\nLikewise, Ethereum was also undergoing a slight loss of less than 1%, trading at around $2050 as of this writing. In the previous trading session, it incurred a loss of over 1%.\n\nNevertheless, ETH remained within a bullish trend, as evidenced by the Relative Strength Index (RSI) line."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jYm9lLWxhdW5jaC1tYXJnaW4tZnV0dXJlcy10cmFkaW5nLTA1MzYyMTg0MC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "CBOE Will Launch Margin Futures Trading for Bitcoin and Ethereum in January 2024 - Yahoo Finance",
        "content": "CBOE Will Launch Margin Futures Trading for Bitcoin and Ethereum in January 2024\n\nCboe Digital, a regulated crypto-native exchange and clearinghouse, has announced the launch date for Bitcoin (BTC) and Ethereum (ETH) margin futures trading to be on January 11, 2024. This positions Cboe Digital as the first platform in the United States to offer both spot and leveraged derivatives trading on a single platform, with the aim of enhancing capital efficiency by allowing futures trading without requiring full collateral.\n\nCboe Digital President John Palmer said:\n\n“Futures have long served as valuable hedging instruments in the traditional financial markets, and we couldn't be more excited to extend access to this tool further into the digital assets markets.”\n\nHe also mentioned that the introduction of derivatives is expected to bring additional liquidity and hedging opportunities, marking a crucial step in the ongoing development of the market.\n\nThe platform, catering to both individuals and institutions, has received support from eleven firms, including both crypto and traditional financial entities such as B2C2, BlockFills, CQG, Cumberland DRW, Jump Trading Group, Marex, StoneX Financial, Talos, tastytrade, Trading Technologies and Wedbush.\n\nCboe Digital obtained approval for margin futures trading from the U.S. Commodity Futures Trading Commission in June, operating within traditional futures market structures and regulatory frameworks. The platform plans further expansion into physically delivered products, pending regulatory approval.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvY2hpbmFzLWJveWFhLWludGVyYWN0aXZlLXRvLXNwZW5kLTkwbS1vbi1iaXRjb2luLWFuZC1ldGhlcmV1bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "China's Boyaa Interactive to Spend $90M on Bitcoin and Ethereum - Watcher Guru",
        "content": "China’s largest board and card game company, Boyaa Interactive, is set to spend $100 million on purchasing cryptocurrencies like Bitcoin (BTC) and Ethereum (ETH). Indeed, the Hong Kong-listed company is set to acquire the digital assets over the next 12 months, according to a published update.\n\nThe online card game developer joins a list of public companies seeking a point of entry into digital assets. Subsequently, the initiative to acquire the digital assets was crafted by the board of directors. Moreover, the plan is currently pending approval from its shareholders.\n\nJUST IN: 🇨🇳 China's largest board and card game company, Boyaa, to acquire $90 million worth of #Bitcoin and Ethereum. November 14, 2023\n\nAlso Read: Bitcoin (BTC) Price on Thanksgiving 2022\n\nChina’s Largest Card Game Company Spending Big on Bitcoin and Ethereum\n\n2022 was undoubtedly a year-long crypto winter for the digital asset sector. However, things have certainly looked up this year, as the industry has maintained a sort of return to form. Moreover, part of that comeback is due to the host of companies that are seeking to get involved in the industry. That fact is reaffirmed through one huge initiative set in place by one of China’s largest companies.\n\nIndeed, China’s Boyaa Interactive has announced its plan to spend $100 million on purchasing Bitcoin (BTC), Ethereum (ETH), and other cryptocurrencies. Specifically, the plan was announced in a newly published update and would take place over the next 12 months.\n\nSource: Blockchain Reporter\n\nAlso Read: Ethereum Price on Black Friday 2022\n\nThe plan is currently pending approval from shareholders due to its overarching nature. Indeed, the board of directors is ensuring the $100 million fund is readily available. Subsequently, they would be able to curtail “prior shareholder approval for each purchase.”\n\nThe approval would then see a large selection of the funds used for acquiring BTC and ETH. Specifically, $45 million would be allocated to the two largest cryptocurrencies by market cap. Thereafter, $10 million would be used by Boyaa to purchase stablecoins like Tether and USD.\n\nConversely, a previous plan that was approved in August led to $5 million in crypto being purchased in the upcoming year. This plan approval would then increase the amount used for the acquisition of digital assets by the company."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoLWJ0Yy1yYXRpby1zaGlmdGluZy1ldGhlcmV1bS1tZWdhLXJhbGx5L9IBVWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoLWJ0Yy1yYXRpby1zaGlmdGluZy1ldGhlcmV1bS1tZWdhLXJhbGx5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "ETH-BTC Ratio Shifting: Is An Ethereum Mega Rally Incoming? - NewsBTC",
        "content": "Ethereum prices are firm at spot rates, still trading above the $2,000 level, and multiple other factors point to possible trend continuation.\n\nAccording to Kaiko’s data on November 12, not only is the ETH-BTC ratio shifting and reversing after extended periods of lower lows, but also there is a notable uptick in trading volume with funding rates in crypto derivative platforms shifting from negative to positive, suggesting increasing demand.\n\nEthereum Breakout Above $2,000\n\nAs of writing on November 13, Ethereum is relatively firm and changing hands at around the $2,090 level. Despite the expected contraction in trading volume over the past couple of days following the rally on November 9, the uptrend remains in place.\n\nSo far, the immediate support level technical analysts are watching remain at $2,000, marking July 2023 highs. Conversely, the $2,100 zone, marking the April high, is a critical liquidation level that optimistic bulls must break for a buy trend continuation pattern.\n\nAs it is, traders are optimistic. However, whether the uptrend will continue depends primarily on trader sentiment and if existing fundamental factors might spark more demand, lifting ETH to new 2023 highs. Thus far, even though the general ETH support base remains upbeat, the coin, unlike Bitcoin (BTC), is struggling to break key resistance levels recorded in H1 2023, which is a concern.\n\nETHBTC Turning Bullish As Funding Rate Flips Positive\n\nOn the positive side, looking at the ETHBTC candlestick arrangement in the daily chart, the sharp reversal of ETH fortunes on November 9 could anchor the next leg up, signaling a new shift in a trend that favors Ethereum buyers. Looking at the ETHBTC formation, Bitcoin bulls have had the upper hand in 2023.\n\nRelated Reading: XRP Price Path To $1: Exploring Two Potential Outcomes From The $0.66 Resistance Level\n\nTo quantify, BTC is up 33% versus ETH, with the climactic sell-off of October 23 pushing BTC to the highest point against the second most valuable coin in 2023. However, the sharp recovery on November 9 and the subsequent failure of BTC bulls to reverse losses suggest that ETH has the upper hand.\n\nThus far, ETHBTC prices are trending inside the November 9 bullish engulfing bar at the back of light trading volumes, a net positive for bullish ETH holders.\n\nFollowing this surge, Kaiko notes that the funding rate of the ETHUSDT pair is positive, signaling increasing demand in the crypto derivatives scene. When funding rates turn positive from negative, it means “long” traders are paying “short” traders to keep their positions open. This development indicates that more traders are long ETH, expecting prices to rise in the sessions ahead.\n\nFeature image from Canva, chart from TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vY29pbmdhcGUuY29tL2Jsb2cvaGFzLXRoZS1ldGhlcmV1bS1wcmljZS1idWxsLW1hcmtldC10cmFpbi1sZWZ0LXRoZS1zdGF0aW9uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Has The Ethereum Price Bull Market Train Left The Station? - CoinGape",
        "content": "In the rapidly changing landscape of blockchain technology, the second-largest cryptocurrency Ethereum remains a leader in innovation. The platform’s support for decentralized applications (dApps) and smart contracts continues to fuel a wide range of developments in sectors like decentralized finance (DeFi), gaming, and non-fungible tokens (NFTs). with its upcoming Cancun upgrade and optimism around the spot ETH, its future projection seems promising for this altcoin.\n\nIs Ethereum Ready for Uptrend?\n\nSource-Tradingview\n\nA look at the higher time frame is crucial to understanding the major trend in the asset and where it is currently positioned. Analyzing the data since 2013, the Ethereum coin has undergone three to four significant corrections, each obliterating about 70-80% of its market value, only to rebound with a substantial surge thereafter. This recurring pattern can offer significant insight into whether ETH price is ready for a major uptrend.\n\nJune-Dec 2016 Peak to Trough: The Ethereum price soared to a high of $21.5 and plunged to $6.2, registering 71.4%\n\n2018 High to Low: From the January high of $1529, the correction phase evaporated 94.8% to reach a December low of $79.06\n\nNovember 2021 to November 2022: from a peak of $4951 to a downfall of $883.6, the coin price witnessed an 82.16% loss.\n\nIf this repetitive pattern stands firm, the Ethereum price has witnessed a suitable downtrend of 82% which would likely trigger a bullish trend ahead.\n\nDaily transactions on the ETH network\n\nThe Ethereum price recovery from mid-October has been paralleled by a notable surge in daily transactions on its network. This uptick in transaction volume is a critical indicator of the network’s health, revealing insights into its active usage and the level of user interaction.\n\nThe data is telling: from a low of 921,231 daily transactions on October 15th, the Ethereum network activity escalated to an impressive 1.108 million transactions by November 11th. This significant jump highlights an increasing level of user engagement and growing adoption of Ethereum.\n\nEthereum- Global In/Out of the Money (GIOM)\n\nThe Global In/Out of the Money (GIOM) metric for Ethereum presents an optimistic picture: As of now, 62.13% of ETH addresses are ‘in the money,’ meaning they are currently profiting, while 34.19% are ‘out of the money,’ indicating they are at a loss. This suggests a stable investor base, less prone to panic selling, which could foster a sustained bullish trend.\n\nThe distribution of profitable versus non-profitable addresses is a key indicator of market sentiment and investor behavior.\n\nNew Address Created\n\nThis metric monitors the daily creation of new Ethereum addresses as a significant indicator of network activity and potential growth. The increase in new addresses, from 247.47M on October 15 to 249.66M on November 11, points to a rising level of participation in the ETH network. This surge in new addresses often precedes an uptick in demand for Ether, which can positively influence its price\n\nEthereum Cancun Upgrade\n\nThe Ethereum Cancun upgrade encompasses major enhancements for both layers of Ethereum: the Cancun upgrade for the execution layer (Layer 1, L1) and the Deneb upgrade for the consensus layer (Layer 2, L2). Scheduled for Q1 of 2024, this dual-layer upgrade aims to substantially improve the Ethereum network in several key areas.\n\nThe Cancun-Deneb upgrade is expected to elevate the scalability, security, and overall efficiency of the Ethereum network. One of the central features of this upgrade is the introduction of proto-danksharding, a process designed to optimize operations and reduce the high gas fees associated with Ethereum transactions. This enhancement is expected to address some of the long-standing challenges faced by the Ethereum network, potentially making it more accessible and user-friendly, and laying the groundwork for broader adoption and more diverse applications of Ethereum in the blockchain ecosystem\n\nBuzz for Ethereum Spot ETF\n\nThe largest asset management company, BlackRock filing for a spot Ethereum ETF, named the “iShares Ethereum Trust,” has created a significant stir in the crypto sphere. This move, confirmed on November 9, propelled the ETH value beyond the $2,000 psychological mark, marking a substantial 12.3% increase. This development caused a ripple effect in the altcoin market as it bolstered the continuation of the November rally.\n\nAdditionally, the crypto community is already buzzing with expectations for a regulatory green light on a spot Bitcoin ETF, a development that further solidifies the cryptocurrency industry’s standing in the financial world.\n\nETH/USD Daily Chart: Can Recovery Surpass $3000?\n\nSource-Tradingview\n\nThe daily time frame chart shows that the Ethereum price has been riding a slow yet steady recovery under the influence of a rising wedge pattern. The two rising trendlines of this pattern offer dynamic resistance and support and the prices rebounded twice from the upper boundary and thrice from the lower indicating its strong influence.\n\nThe ETH price has been under strong recovery since mid-October when the prices jumped from $1527 to the current trading price of $2055, accounting for a bullish recovery of 34.8%. With sustained buying, the coin price could surge another 8-10% to hit the upper trendline around $2240.\n\nConsider a bullish scenario, an upside breakout from the aforementioned resistance would intensify the buying momentum and may push the prices 40% higher to reach the $3175 target.\n\nETH/USD Weekly Chart: Pullback or Recovery?\n\nSource- Tradingview\n\nFrom June 22’ low of $883.6, the Ethereum price recovery has gained 133% to reach the $2055 mark. The bullish rally, which has crossed the 23.6% Fibonacci retracement level, marked a notable shift in its trajectory.\n\nThis move draws attention to key resistance levels: the 38.2% FIB at $2440 and the $2,900 mark at the 50% FIB level. Until the ETH price overcomes the 50% FIB threshold, the risk of a continuing downtrend persists.\n\nYet, a breakthrough above this level could signal a waning of bearish forces, pointing to an emerging bullish grip on the market."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmJsZWVwaW5nY29tcHV0ZXIuY29tL25ld3Mvc2VjdXJpdHkvZXRoZXJldW0tZmVhdHVyZS1hYnVzZWQtdG8tc3RlYWwtNjAtbWlsbGlvbi1mcm9tLTk5ay12aWN0aW1zL9IBcGh0dHBzOi8vd3d3LmJsZWVwaW5nY29tcHV0ZXIuY29tL25ld3Mvc2VjdXJpdHkvZXRoZXJldW0tZmVhdHVyZS1hYnVzZWQtdG8tc3RlYWwtNjAtbWlsbGlvbi1mcm9tLTk5ay12aWN0aW1zL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Ethereum feature abused to steal $60 million from 99K victims - BleepingComputer",
        "content": "Malicious actors have been abusing Ethereum's 'Create2' function to bypass wallet security alerts and poison cryptocurrency addresses, which led to stealing $60,000,000 worth of cryptocurrency from 99,000 people in six months.\n\nThis is reported by Web3 anti-scam specialists at 'Scam Sniffer,' who observed several cases of in-the-wild exploitation of the function, in some cases losses incurred by one individual reaching up to $1.6 million.\n\nLegitimate function\n\nCreate2 is an opcode in Ethereum, introduced in the 'Constantinople' upgrade, that allows creating smart contracts on the blockchain.\n\nUnlike the original Create opcode, which generated new addresses based on the creator's address and nonce, Create2 allows calculating addresses before the deployment of the contract.\n\nIt's a powerful tool for Ethereum developers, enabling advanced and flexible contract interactions, parameter-based contract address pre-calculation, deployment flexibility, suitability for off-chain transactions and certain dApps.\n\nCreate2 introduced significant benefits, but several security implications and new attack vectors also came along with them.\n\nCreate2 opcode abuse\n\nScam Sniffer's report explains that Create2 can be abused to generate fresh contract addresses with no history of malicious/reported transactions, hence bypassing wallet security alerts.\n\nWhen a victim signs a malicious transaction, the attacker deploys a contract at the pre-calculated address and transfers the victim's assets to it, a non-reversible process.\n\nIn a recent case analysts observed, a victim lost $927,000 worth of GMX after they were tricked into signing a transfer contract that sent the assets to a pre-computed address.\n\nThe smart contract used in the attack (Scam Sniffer)\n\nThe second type of Create2 abuse is generating addresses similar to legitimate ones owned by the recipient, thus tricking users into sending assets to the threat actors, thinking they're sending it to a known address.\n\nThe scheme, which is named 'address poisoning,' involves generating a large number of addresses and then picking those that match their specific phishing needs each time to trick their targets.\n\nSince August 2023, Scam Sniffer has recorded 11 victims losing nearly $3 million, with one of them transferring $1.6 million to an address resembling one they had sent money to recently.\n\nMost of these attacks went under the radar, silently siphoning millions, but some have caught the attention of the community.\n\nAt the beginning of the year, MetaMask warned about scammers using freshly-generated addresses that match those used by the victim in recent transactions.\n\nIn the scam, the threat actor may also send the victim a small amount in crypto to register the address in the wallet's history, thus increasing the chances of the victim making the payment.\n\nIn early August 2023, a Binance operator mistakenly sent $20 million to scammers who employed the 'address poisoning' trick but noticed the error quickly and froze the recipient's address.\n\nNotably, using lookalike cryptocurrency addresses is a trick seen in clipboard-hijacking malware tools, like the Laplas Clipper, highlighting the method's effectiveness.\n\nWhen performing cryptocurrency transactions, it is always recommended to check the recipient's address thoroughly, and not just the first and last three-four characters, before approving it."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLWFzLWJ1bGxzLWhvbGQtMjAwMC1sZXZlbC13aGVyZS1pcy1ldGgtaGVhZGluZy1uZXh0Lmh0bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction as Bulls Hold $2000 Level – Where is ETH Heading Next? - Cryptonews",
        "content": "Ethereum Price Prediction as Bulls Hold $2,000 Level – Where is ETH Heading Next?\n\nThe Ethereum price has dipped by nearly 0.5% in the past 24 hours, with the altcoin holding to the $2,051 level as the cryptocurrency market as a whole falls by 1% today.\n\nDespite this loss, ETH remains up by 8.5% in a week and by 31% in the last 30 months, as ETF-related enthusiasm carries the altcoin and the wider market further.\n\nETH has also risen by 71% since the beginning of the year, and with the possibility of ETF approvals set to user in a bull market next year, it may resume rising strongly once its current dip is over.\n\nEthereum Price Prediction as Bulls Hold $2,000 Level – Where is ETH Heading Next?\n\n\n\nEthereum’s indicators continue to look strong, even with today’s little misstep.\n\nThe coin’s RSI (purple) remains above 70, indicating considerable buying pressure that could help it rise again quickly in the next few days.\n\nMore bullishly, ETH’s 30-day average (yellow) recently climbed over its 200-day average (blue), forming a ‘golden cross’ that often signals breakouts.\n\nAs such, it may still be the case that ETH is on the brink of much bigger rises than it has enjoyed in the past couple of weeks.\n\nIndeed, its 24-hour trading volume remains comfortably above $21 billion, having stood at around $3 billion in the middle of October.\n\nThis indicates that investors are still very much interested in ETH, with a number of large transfers in the past couple of days showing that some whales are still moving the altcoin off exchanges.\n\nSo based on ongoing optimism surrounding Bitcoin – and Ethereum – ETFs, it’s likely that the Ethereum price will continue to rise in the coming weeks.\n\nAnd turning to the medium- and long-term, ETH’s fundamentals will also be pushing in this direction.\n\nEthereum continues to be the biggest layer-one blockchain in terms of usage and adoption, with its network accounting for more than half of the total value locked in of the entire sector.\n\nIt has also been attracting big names this year, with PayPal launching its own Ethereum-based stablecoin and with Coinbase opening its own Ethereum layer-two.\n\nIn other words, Ethereum’s continued dominance for the foreseeable future is more or less assured, which would imply a rising Ethereum price.\n\nFrom $2,000 now, it could reach $2,500 by the end of the year, with a fully fledged bull market in 2024 helping it to retest its all-time high.\n\nFundamentally Strong Altcoins\n\n\n\nIt’s never ideal to have a portfolio mostly in a single cryptocurrency, so traders looking for diversification are also advised to buy into newer tokens, exposing themselves to more positive upside.\n\nNewer tokens can also include presale coins, with the best and biggest presales often translating into big exchange listings.\n\nOne of the likeliest tokens to enjoy such a listing is Bitcoin Minetrix (BTCMTX), a stake-to-mine platform that has raised over $3.9 million in around a month.\n\nExperiencing the world of #BitcoinMinetrix, a tokenized cloud mining platform that enables everyday individuals to participate in decentralized $BTC mining. Saying goodbye to concerns about third-party cloud mining scams and gaining full control over your operations. 🔐 pic.twitter.com/Oa9A9y74SO — Bitcoinminetrix (@bitcoinminetrix) November 14, 2023\n\nDue for launch in the next few weeks, Bitcoin Minetrix will enable users to mine Bitcoin (BTC) simply by staking its native token, BTCMTX.\n\nBy staking enough BTCMTX, users receive tokenized mining credits that they can then use to buying Bitcoin mining power, earning them newly minted BTC in the process.\n\nSuch a system will potentially make Bitcoin Minetrix profitable for users, who will also receive issued BTCMTX in exchange for staking.\n\nInvestors can join its presale at the official Bitcoin Minetrix website, where 1 BTCMTX currently costs $0.0116.\n\nThis price rises with each successive stage of the sale, ending at $0.01190 once the offering reaches its final stage.\n\nAnd given just how promising Bitcoin Minetrix’s fundamentals are, it could rally much higher once it lists towards the end of the year.\n\nVisit Bitcoin Minetrix NowDisclaimer: Crypto is a high-risk asset class. This article is provided for informational purposes and does not constitute investment advice. You could lose all of your capital."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LnRlY2hyYWRhci5jb20vcHJvL3NlY3VyaXR5L2V0aGVyZXVtLWhhY2tlZC10by1zdGVhbC1taWxsaW9ucy1mcm9tLXVzZXJzLWFjcm9zcy10aGUtd29ybGTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Ethereum hacked to steal millions from users across the world - TechRadar",
        "content": "Hackers have been observed abusing a feature in the Ethereum blockchain to trick victims into sending money.\n\nIn the last six months, the criminals were able to trick almost 100,000 people into giving away a total of $60 million, according to a new report from Scam Sniffer.\n\nAs per the report, the hackers used a function called Create2, an opcode that allows users to predict the address of a contract before it is deployed on the Ethereum network. In other words, hackers can create temporary addresses for each individual transaction - addresses that greatly resemble the ones where the victims intended to send the funds. The scheme is dubbed “address poisoning”.\n\nReader Offer: $50 Amazon gift card with demo\n\nPerimeter 81's Malware Protection intercepts threats at the delivery stage to prevent known malware, polymorphic attacks, zero-day exploits, and more. Let your people use the web freely without risking data and network security. Preferred partner (What does this mean?)\n\nBypassing security\n\nMost users, before sending any funds, do two things: 1) they double-check the recipient’s address to make sure they’re sending the money to the right place; 2) they send a small transaction first to make sure everything works, before sending the remaining funds. However, as the addresses are a long string of seemingly random characters, most users just cross-check the first and last few characters, instead of comparing the entire strings.\n\nBy creating an address that differs in just a few characters, the attackers can trick people into thinking the address is valid, before sending the funds. That, however, still leaves the second failsafe - the test transaction. Criminals are working around this by forwarding the test transaction to the actual address.\n\nThe lookalike addresses don’t belong directly to a wallet controlled by the attackers, but are rather a smart contract that then transfers the funds to the final destination. The researchers said they observed multiple cases of fraud leveraging Create2, with one victim losing up to $1.6 million.\n\nUsers are advised to thoroughly check the entire address before sending the funds, and not just first and last characters.\n\nVia BleepingComputer"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vY29pbmNvZGV4LmNvbS9hcnRpY2xlLzM0NDAzL3JlbmRlci1uZXR3b3JrLW1pZ3JhdGVzLWZyb20tZXRoZXJldW0tdG8tc29sYW5hLWFzLXNvbC1lY29zeXN0ZW0tY29udGludWVzLXRvLWV4cGFuZC_SAXxodHRwOi8vYW1wLmNvaW5jb2RleC5jb20vYXJ0aWNsZS8zNDQwMy9yZW5kZXItbmV0d29yay1taWdyYXRlcy1mcm9tLWV0aGVyZXVtLXRvLXNvbGFuYS1hcy1zb2wtZWNvc3lzdGVtLWNvbnRpbnVlcy10by1leHBhbmQv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Render Network Migrates from Ethereum to Solana as SOL Ecosystem Continues to Expand - CoinCodex",
        "content": "Key Highlights:\n\nRender network unveils successful migration to the Solana network, and bids farewell to Ethereum.\n\nIn a bid to make the migration process an easy and convenient experience for users, the Render Foundation has offered 1.14 million RNDR tokens to incentivize token holders.\n\nSolana ecosystem continues to expand after seeing an impressive surge of +144.00% in the last one month.\n\nRender Network, a leader in the decentralized computing space, has just experienced a massive shift within its ecosystem as the platform announces successful migration from Ethereum to the Solana network.\n\n“We’re thrilled to welcome Render to the ecosystem, making it the latest project to fully migrate their network to Solana,” Ryan Shea, Advisor to the Render Foundation expressed excitement on the company's latest move.\n\nThis remarkable upgrade comes after the platform considers a need to leverage Solana's exclusive use cases while avoiding the high gas fees offered on the Ethereum network.\n\nIn essence, while the Render network has successfully upgraded its core infrastructure to the Solana blockchain, users of Render can now explore several use cases on the network without the need to bother about high transaction fees.\n\nWhy Solana?\n\nAccording to the announcement, the company believes that Solana's incredible features in collaboration with its core infrastructure has the potential to unlock significant and exciting opportunities for the Render ecosystem.\n\nThis may include crucial new capabilities like real-time streaming and dynamic NFTs, creating a whole new experience for the Render community.\n\nMoreso, the company has also emphasized that Solana's superior speed, cost-effectiveness, and scalability, aligns suitably with Render's expansive vision. Hence, the big transition to Solana will mark a remarkable stepping stone towards achieving its vision.\n\nThe Render Network is committed to building a scalable and decentralized metaverse infrastructure. Thus, Solana’s incredible transaction speeds, low costs, and commitment to web-scale architecture appears promising to facilitate the actualisation of the stated goals.\n\nRyan Shea, Advisor to the Render Foundation, acknowledged this noting that:\n\n“Solana is the home of DePIN, and Render Network is one of the most important DePIN networks in existence today. Solana will help extend Render Network into new applications, such as machine learning and inference training, and unlock new utility through Solana’s best-in-class technologies like compressed NFTs, on-chain order books, and real-time oracles.”\n\nRender Offers 1.14 million RNDR as Incentives to Aid Token Transfers\n\nPer the announcement, users of Render who hold the RNDR token can now proceed to transfer their tokens to the Solana blockchain.\n\nIn a bid to make this an easy and seamless experience for users, Render Network has launched an Upgrade Assistant and Incentive program. It also announced the allocation of 1.14 million RNDR in grants to subsidize the high transaction fees charged on Ethereum.\n\nNotably, the Upgrade Assistant program will offer users the opportunity to transfer their RNDR tokens to Solana blockchain easily with a guarantee on safety and trustless upgrade process using the Wormhole protocol.\n\nMoreso, through the Upgrade Assistant, users have been encouraged to transfer their tokens from the Ethereum network to Solana as soon as possible as early migrators will be awarded a share of the 1.14M RNDR. Notably, holders who do not transfer their tokens within the specified period of three months, will have to pay their own gas fees to migrate RNDR tokens to the Solana blockchain when the period elapses.\n\nSolana Ecosystem Continues to Expand as it Welcomes Render\n\nRender's integration with the Solana ecosystem marks a significant addition to the continuous improvement the network has been witnessing lately.\n\nThe Solana market performance has been on the bright side for several months, with the SOL price showcasing an impressive surge of +144.00% in the last one month.\n\nAlthough the SOL price has decreased by -6.66% in the last 24 hours, the network still retains a bullish sentiment, seeing it outperform the Ethereum network. While Solana has impressively risen by 15.89x against Ethereum, it appears that this may continue to be the case following Solana's recent collaboration with Render Network against Ethereum.\n\nThe transition of Render between Ethereum and Solana implies that there will be a reduction in the use of the Ethereum network, while the use of Solana will be increased as it will see new adoption from the users of Render.\n\nNonetheless, the Render Network has also instructed that while the ETH token ($RNDR) will remain, it will no longer be maintained by Render Foundation and won't function on the Render Network."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy92aWRlb3MvMjAyMy0xMS0xNS9zY2FyYW11Y2NpLXNheXMtYml0Y29pbi1ldGhlcmV1bS1wcmljZXMtdG8tdHJlbmQtaGlnaGVyLXZpZGVv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "SkyBridge's Scaramucci Says Bitcoin, Ethereum Prices to Trend Higher - Bloomberg",
        "content": "00:00\n\n[CC may contain inaccuracies] I want to get your thoughts initially on what do you think the economic and investment environment will be like in the US over the next 12 months? Do you think the Fed's done hiking rates? I do think the Fed is done hiking. And good morning to you guys. I think that the the inflation data was very positive and it's likely to go lower over the next quarter. And so Rick Rieder, a personal friend of mine, actually gave a presentation in Park City at Governor Romney's conference about a month ago and explained the the churning down of inflation. And I think that's very, very good for stock prices, very good for assets. But, of course, what do people want for Christmas in America? They want a low interest rate mortgage. And if you look at housing data in the United States right now, those markets are quite sluggish. I think the Fed is going to respond to that. You'll probably see cuts in interest rates before the end of the first quarter. And so that's very positive for asset prices across the board. Okay. You mentioned last time Bloomberg spoke with you about, you know, you had a great October for your fund. I think it's the best month you've had in the history of SkyBridge. A lot of it was crypto, which I'll get to later. But what what's the other part of that? I mean, is there any parts of that of your portfolio that really kind of benefit from maybe either higher for longer or a less sort of tightening environment? I guess who else, unfortunately, versus the bets that hurt us last year? We we left on for this year. And so unfortunately in investing, sometimes you can get the timing wrong. But we made the case in the fourth quarter of last year in the early part of 2023, that the Fed would start cutting rates more quickly, that inflation would come down more quickly once the supply chain had reconnected. And you saw all of this induction of new technology like A.I., robotic technology, etc., bringing down prices. And so we got the timing wrong. But if you're a long term investor, if you were patient with us, you did quite well. And and last year at this time here at this all conference, as I mentioned during the commercial break, I think Bitcoin was about 16 or 17,000. We have a 10% position in Bitcoin in our portfolio and of course that's gone up to 35, 36,000 in the last year. And I think that went up contrary to institutional sentiment at the time. Over the last year people were quite negative. I was in Davos, Switzerland, being interviewed by some of your colleagues. January of this year, everyone had written off Bitcoin. Of course, it went up about 115% since then. So it's a combination of a couple of different factors, but it's mostly about being bullish about the return of the global economy and global growth. post-COVID. It just took longer than people expected, but we're there now. Yeah, from 6000 to 35. Now, you mentioned 10% weighting. How are you managing your exposure to crypto? What do you suspect the changes will be over the next couple of months? Anthony? Well, I mean, I think one of the things we're very proud of is we're we were the first outside capital into the BlackRock Bitcoin Trust. And so as you guys know, they filed for a formal application with the SCC, the deadline for that application at least for the Ark application, Cathie Wood's is January 10th. It appears likely that these things will get approved if that happens. I think there's an induction of a tremendous amount of demand for Bitcoin and of course you have a happening in Bitcoin, which basically means the supply is going to get cut in half in April. So having lower supply, more demand, we think prices are going to trend higher for Bitcoin, Etherium and a few other currencies. And for those reasons we're going to stay long in the portfolio. And you know what? Well, you know, it's a concentrated bet for us, but we like it. It's a macro overlay. And I guess you guys will remember the beginning part of the year with the Silicon Valley bank crises. Bitcoin was quite resilient and it seems to also do what you'd want an alternative investment to do is go contra into carry indicatori to the overall market. And I think it's safe to say you're still deep into crypto. And of course, obviously your name was mentioned during those SBF trials. Well, I want to get your take on the verdict now that we have one here as well. And overall the future of FDX 2.0. Would you invest in it? Would I invest in it? Well, depends on who's running it. I think number one, I think if you read Michael Lewis's book, there was a business there. He had 12 and a half percent of the cryptocurrency market. So I think the sloppiness and the indiscretion and the eventual fraud obviously ruined the the business and ruin the reputation of that business. But there is a good. Underlying business of you. Tell me who's managing it. I would be open minded to that. But since you're mentioning FDA, I think it's important to point out to people last year at this time at this conference, Sam Bankman-fried had just declared bankruptcy and he was about to be arrested. And so it's a full year later. He's already been convicted for the fraud. His sentencing comes it comes in March. I think it was fair. You know, I spoke at an event here for the Singapore Monetary Authority yesterday and explained that a good regulatory process is clear, transparent rules. But if there are bad actors, they've got to get convicted and have to pay the price for the crimes that they're committing. And I think we're seeing that in the United States. I think that sending a message of deterrence to people, but it's also sending a message of greater safety in these markets for investors. So there's a combination of positive things happening this year. And of course, if you interviewed me last year at this time, there was less than positive things happening. So, Anthony, just everyone was asking about 2.0. Just a quick update, please. If you could give us a timeline on 1.0. They still have a stake in you guys. Do you still plan on buying them, taking that stake back? You have a timetable for that? Yes. So unfortunately, we're waiting for the bag. We've created a data room for the bankruptcy estate to look at and to make a decision on when they'll give us the opportunity to buy back those assets. I still think that's likely a year or two away, and we're in no rush because, of course, there was no controlling stake and there's no voting interest or even economic preference in that stake. So we're running the business just like we've run it before with no interruption. But you're asking about tax. If that's going to go alive, it'll probably be the back half of 2024. My prediction is that they'll eventually sell those assets and that technology to somebody that will restart that exchange. And so we'll have to see what happens. But I think that's very likely. How much time. So I've got to ask you about, you know, we have a U.S. election that's coming up as well. Do you do you have any sort of projection here? Are we going to back this time? Give me of course, you had a short stint in the White House. I'm in the I'm in the ABC camp. You know, anybody but anybody but Trump. And so if it's Trump versus Biden, I will be actively advocating for President Biden. I have supported Governor Christie, and I'm hopeful that he can have a good showing in New Hampshire. If that doesn't happen and the president does get the nomination. President Trump, I think it's just too big of a threat to the American democracy. And if you listen to him very carefully, he wants to put up refugee camps. He wants the poor people from the country. It's very un-American. It'll be very disruptive for business continuity globally and in the U.S. So I'll be with President Biden if it's a Trump versus Biden case. But if it isn't, I'm a long term Republican, so we'll see."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY3J5cHRvLm5ld3MvbG9va29uY2hhaW4tcmVwb3J0cy13aGFsZXMtYXJlLWRvbWluYXRpbmctdGhlLWV0aGVyZXVtLW1hcmtldC13aXRoLWJpZy1zYWxlcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Lookonchain reports whales are dominating the Ethereum market with big sales - crypto.news",
        "content": "In a Nov. 14 post, the cryptocurrency on-chain data analysis firm Lookonchain reports whale activity amid Ethereum price surge.\n\nNotable sales have included a $154 million profit for one whale and a loss of $183 million for another.\n\nWhale movement on chain\n\nIn the thread, Lookonchain points to the whale at address “0xee47,” that has reportedly increased their Ethereum (ETH) holdings by 3,200 ETH, equivalent to approximately $6.7 million. This accumulation comes seven months after the whale initially began acquiring ETH on July 5, 2022. Presently, their holdings stand at 183,742 ETH, valued at around $387.8 million, reflecting an unrealized profit of approximately $154 million.\n\nBullish or Bearish on $ETH?\n\n\n\nDid SmartMoneys and Whales buy or sell $ETH over the past week?\n\n\n\n1/🧵\n\n\n\nHere is a thread. pic.twitter.com/8yvCO0UI9H — Lookonchain (@lookonchain) November 14, 2023\n\nIn a parallel occurrence, another whale at address “0x78D0” has been actively accumulating ETH since May 24. This particular whale reportedly acquired 12,680 ETH at an average price of $1,768 from the Kraken exchange. As of the latest available data, their total holdings amount to $26.16 million, with an unrealized profit reaching an estimated $3.7 million.\n\nYou might also like: Ethereum and Everlodge price prediction: Dogecoin Foundation member issues warning\n\nAt the same time, whale “0xBf71” deposited 30,001 ETH, worth $62 million to finance, in what is a total loss of $183 million.\n\nHolding steady at $2,000\n\nOver the last five days, Ethereum has maintained a position above the $2,000 threshold following the registration of an iShares ETH Trust by BlackRock, the world’s largest asset manager boasting $9.4 trillion in assets under management.\n\nThe trust was officially registered on Nov. 9, and in the aftermath of this development, Ethereum experienced a 9% increase gaining the attention of the everyday investor and whale alike.\n\nFollow Us on Google News"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vZGVjcnlwdC5jby8yMDU5ODgvZGVmaS10b2tlbnMtc3VyZ2UtYml0Y29pbi1ldGhlcmV1bS1sYWfSAUZodHRwczovL2RlY3J5cHQuY28vMjA1OTg4L2RlZmktdG9rZW5zLXN1cmdlLWJpdGNvaW4tZXRoZXJldW0tbGFnP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin and Ethereum Lag While DeFi Tokens dYdX and Maker See Gains - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA number of decentralized finance (DeFi) assets surged on Tuesday while major cryptocurrencies—including Bitcoin and Ethereum—experienced losses.\n\nDecentralized lender dYdX, which runs on Ethereum, was at the time of writing trading for $3.34, having gained nearly 7% in 24 hours. Over the week, the protocol's native token, ETHDYDX, had boomed by 42%, CoinGecko data showed.\n\nElsewhere, Maker (MKR) also experienced a surge: at the time of writing, it was only up over 1%, trading for $1,366, but had shot up earlier on Tuesday morning Eastern Time to a high of $1,423.\n\nAD\n\nAD\n\nAnd decentralized exchange PancakeSwap (CAKE) was also up nearly 3%, coming in at a price of $2.24.\n\nDeFi refers to the projects in the cryptocurrency space which want to replace traditional financial services, such as borrowing, lending or banking.\n\nSuch projects are new, experimental and prone to hacks—which means respective coins and tokens are volatile.\n\nBitcoin, the largest digital asset by market cap, had lost more than 2% of its value by the time this story was published, and was trading hands for $36,049.\n\nAnd Ethereum, which last week pushed past $2,000, was down nearly 3%. It is priced at $2,041 per coin.\n\nAD\n\nAD\n\nLast week ETH saw major gains on news that BlackRock Advisors, a division of the Wall Street titan, was preparing to file an application for an Ethereum ETF. The iShares Ethereum Trust application is BlackRock's first official application for an Ethereum ETF.\n\nWithin 24 hours after the filing of the iShares Ethereum Trust application, the price of Ethereum crossed the $2,000 mark, a level it had not seen since July 2023. The price of Ethereum experienced a substantial increase, with gains reported at over 8%. Moreover, the trading volume surged by 259%, indicating a significant rise in market activity.\n\nConcurrently, the market capitalization of Ethereum increased by a little more than 10%—reflecting a marked growth in investor confidence and market valuation following the news of the filing.\n\nElsewhere, major coins and tokens were having a rough morning. Solana (SOL), which last week blew up in value, was trading little over $56 per coin, up less than 1%. Even when ETF optimism cooled for Bitcoin and Ethereum, Solana has held onto its gains.\n\nSOL has surged nearly 160% over 30 days. For a few days, it briefly overtook the market capitalization of major stablecoin USDC. But it has since dropped below it again. As of this writing, SOL has a market cap of $23.8 billion and USDC has a market cap of $23.9 billion.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL25hc2RhcS1maWxlcy1wcm9wb3NhbC1zZWVraW5nLXNlYy1ydWxlLWNoYW5nZS10by1hbGxvdy1zcG90LWV0aGVyZXVtLWV0Zi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Nasdaq files proposal seeking SEC rule change to allow spot Ethereum ETF - CryptoSlate",
        "content": "Nasdaq filed a proposal with the SEC seeking approval to list BlackRock’s spot Ethereum exchange-traded fund (ETF) based on the regulator’s recent approval of ETH-based futures ETFs in October.\n\nThe exchange proposed that the regulator allow it to create the iShares Ethereum Trust under its Nasdaq Rule 5711(d) — which governs the listing and trading of commodity-based Trust shares on the exchange.\n\nAdvocating for increased uniformity in the regulation of digital and traditional assets, Nasdaq posits that both Bitcoin (BTC) and Ethereum (ETH) should be governed as commodities and that the rules for spot ETFs for these digital assets should align with those of gold ETF.\n\nThe arguments proposed in the filing are similar to those used in the spot Bitcoin ETF applications. Nasdaq believes the SEC has no grounds to block a spot Bitcoin or Ethereum-based ETF because it allows the CME to host futures-based ETFs for both digital assets.\n\nNasdaq urged the SEC to approve the applications for spot ETFs as it will allow U.S. investors to gain exposure to Bitcoin and Ethereum safely.\n\nSurveillance issue\n\nNasdaq further argued that it meets every requirement set by the regulator to ensure that investors are protected and has a surveillance agreement to monitor market fraud and manipulation.\n\nThe exchange used the same arguments presented in the spot Bitcoin ETF applications. Essentially, Nasdaq claimed that, like the CME, it is a member of the Intermarket Surveillance Group (ISG), which monitors and reports on illicit activity to all its members.\n\nAccording to the exchange, this and its partnership with Coinbase, which monitors spot markets, are sufficient to ensure that investors are adequately protected from fraud and manipulation.\n\nTaking on potential concerns about market surveillance, Nasdaq emphasized that the surveillance mechanisms for a spot Bitcoin or Ethereum market are just as robust as those for a futures market. It added that the CME futures market meets the SEC’s criteria of a market of significant size that is appropriately monitored.\n\nETF details\n\nThe proposed iShares Ethereum Trust will be a collaborative effort, operating under a trust agreement between iShares Delaware Trust Sponsor, an indirect subsidiary of leading investment management corporation BlackRock Inc., and BlackRock Fund Advisors. The ETF will reflect the performance of the price of ETH, the cryptocurrency underlying the Trust.\n\nCoinbase Custody Trust Company will serve as the “Ether Custodian” and hold the bulk of the ETH in cold storage. The filing emphasized that the hardware, software, systems, and procedures of the Ether Custodian may not be easily accessible to investors.\n\nThe ETF’s net asset value (NAV) will be determined based on the total assets, including ETH and cash, minus total liabilities. The filing states that the NAV calculation may not be consistent with U.S. generally accepted accounting principles (GAAP) and that iShared Delaware Trust Sponsor will have the exclusive authority to determine the ETF’s NAV.\n\nThe ETF will rely on the CME CF Ether-Dollar Reference Rate – New York Variant (“CF Benchmarks Index”) for valuation purposes, calculated daily based on Ether-U.S. dollar trading activity across major spot trading platforms."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZGVjcnlwdC5jby8yMDU4MzAvc29sYW5hLXJhbGx5LWNvb2xzLWJpdGNvaW4tZXRoZXJldW0taG9sZC1zdGVhZHnSAU9odHRwczovL2RlY3J5cHQuY28vMjA1ODMwL3NvbGFuYS1yYWxseS1jb29scy1iaXRjb2luLWV0aGVyZXVtLWhvbGQtc3RlYWR5P2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Solana Rally Cools as Bitcoin and Ethereum Hold Steady and These Alts Surge - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAfter a stunning climb last week, Solana (SOL) has cooled its rally and is now down over the past 24 hours.\n\nSolana, the seventh biggest cryptocurrency by market cap, is down nearly 5% in the past day, trading hands for $55.39, CoinGecko data shows.\n\nLast week, the Ethereum-competitor had experienced a surge in price unlike any other coin or token over a month period. Its price notably soared past $50 for the first time since May 2022. The boom was likely down to a short squeeze caused by short sellers exiting their positions and renewed interest from institutions, experts said.\n\nAD\n\nAD\n\nBut despite the cool off today, Solana is up nearly 40% over the last seven days.\n\nBitcoin, the biggest cryptocurrency by market cap, is down 1% today Monday morning Eastern Time and is trading for $36,839. While the second-biggest digital asset Ethereum (ETH) is up nearly 2% and trading for $2,096.\n\nLast week Ethereum got a big boost past $2,000 for the first time in some months on the news that BlackRock had filed an application to list an iShares Ethereum Trust.\n\nMeanwhile, a number of Solana's altcoin rivals are experiencing gains today.\n\nLeading the charge out of the major coins and tokens is decentralized storage provider Filecoin's native token FIL, which is up nearly 10% in 24 hours and priced in at $5.33, according to CoinGecko. Over the past seven days, it has shot up in value by 23%.\n\nAD\n\nAD\n\nProtocol Labs, the company behind Filecoin, is this week hosting a its LabWeek23 event in Istanbul, which might explain the sudden surge.\n\nOf other major players in the crypto market, Polygon (MATIC) is also up significantly today: the 13th biggest digital asset by market cap has surged more than 6% in the past day and is now trading for $0.88.\n\nAnd Cosmos (ATOM), a project which aims to create an \"Internet of Blockchains\" by improving interoperability, has also shot up by more than 9%; it's right now priced at $9.90.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZGVjcnlwdC5jby8yMDU5NjYvZXRoZXJldW0tYW5kLWJpdGNvaW4taG9sZC1zdGVhZHktYXMtdXMtaW5mbGF0aW9uLWNvb2xzLXRvLTMtMtIBXWh0dHBzOi8vZGVjcnlwdC5jby8yMDU5NjYvZXRoZXJldW0tYW5kLWJpdGNvaW4taG9sZC1zdGVhZHktYXMtdXMtaW5mbGF0aW9uLWNvb2xzLXRvLTMtMj9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Ethereum and Bitcoin Hold Steady, But Solana Gains as US Inflation Cools to 3.2% - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCryptocurrency prices held ground on Tuesday after a widely watched inflation gauge in the U.S. showed consumer prices were flat in October.\n\nThe Consumer Price Index (CPI) rose 3.2% in the 12 months through October, the Bureau of Labor Statistics said Thursday. Economists expected the index to show an annual increase of 3.3%, down from a 3.7% clip reported last month.\n\nAD\n\nAD\n\nOn a month-to-month basis, the index, which tracks price changes across a broad range of goods and services, was unchanged after a 0.4% jump in September. October's rise in shelter prices was offset by a 5.3% decrease in gasoline prices, the BLS said.\n\n\"Overall, inflation came softer than expected,” Dessislava Aubert, a research analyst at Kaiko, told Decrypt. “And it’s pretty good news for risk assets in general because it means that the Fed is done hiking.”\n\nBitcoin and Ethereum traded hands at $36,600 and $2,000, respectively, according to CoinGecko. While both coins notched slight gains shortly after the report’s release, Bitcoin was down 0.6% over the past day, while Ethereum was flat.\n\nEven though crypto’s two largest coins had a muted reaction to the CPI print, the report appears to have influenced Solana, Lucas Outumuro, head of research at IntoTheBlock, told Decrypt. Solana rose 4.7% to $57 in the hour following its release, according to GoinGecko.\n\n“Naturally, capital rotates in crypto from the larger [market] caps into smaller [market] caps,” he said. “And that is people seeking higher risk.”\n\nAdditionally, altcoins like Solana tend to have a higher market capitalization relative to the fees they generate, especially when compared to Ethereum, Outumuro noted. A softer CPI print that is supportive of risk assets is good news for smaller protocols in general, he said.\n\nAD\n\nAD\n\n“They have much higher multiples in terms of like their market cap relative to their fees,” he said. “And the discount rate, in theory, should affect them more strongly, since most of their revenues are in the future, rather than in the present.”\n\nThe Federal Reserve has raised interest rates aggressively over the past year and a half to curb inflation, which topped out at a 40-year high of 9.1% last June. Inflation has moderated steadily since then, but it remains above the Fed’s target of 2% annually.\n\nThe U.S. central bank decided to hold interest rates steady this month at a target range of 5.25% to 5.50%, representing its second pause in a row. Fed Chair Jerome Powell signaled officials are “proceeding carefully” in light of risks and “how far we have come.”\n\nBy raising its benchmark rate, the Fed influences how expensive it is for businesses and consumers to borrow. The U.S. central bank hopes that U.S. companies will raise prices less rapidly in response to how higher rates subdue economic demand.\n\nWhile higher interest rates could help bring inflation under control, they could also tip the economy into a recession if borrowing rates suffocate economic growth too much. So far, the labor market and economy have shown signs of “resilience,” Powell said earlier this month.\n\nOliver Rust, head of product at independent inflation data aggregator Truflation, told Decrypt he doesn’t expect the U.S. central bank to raise rates in the near future. At the same time, Rust believes the Fed will hold rates where they are for a prolonged period. “I'm expecting interest rates to say higher for longer—for a very long time,” he said, adding that traders shouldn’t a rate cut in the first quarter of next year.\n\nOver the past month, expectations of a quarter-point rate hike in December have fallen to 15% from 29%, according to the CME Group’s FedWatch Tool. As of this writing, traders think it's most likely that the Fed will begin cutting rates in June.\n\nAmericans may feel inflation is still rampant. Yet prices in the U.S. appear stagnant compared to Argentina. As the country prepares for a presidential run-off, featuring an anti-central bank candidate, it reported inflation hit 143% in October on Monday.\n\nAD\n\nAD\n\nEditor's note: This post was updated to add comments from analysts at Kaiko, IntoTheBlock, and Truflation.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi1oaW50cy05LXJpc2UtYWhlYWQv0gFOaHR0cHM6Ly9jb2luZ2FwZS5jb20vbWFya2V0cy9ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLWhpbnRzLTktcmlzZS1haGVhZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction Hints 9% Rise Ahead, But There’s a Catch - CoinGape",
        "content": "Ethereum Price Prediction: The Ethereum (ETH) coin recently experienced a significant pullback, with prices dropping 5.5% in four days to reach $2,022. This decline coincided with the Bitcoin price retracement to $36,000, raising questions about Ether’s next move: will it continue its recovery or face a new correction?\n\nAlso Read: Ethereum Network Fees Hit 4-Month With ETH Price Under Pressure, What’s Next?\n\nadvertisement\n\nWill Correction Trend Extend?\n\nThe long-tail rejection at $2030 reflects ETH price found suitable support at this horizontal level\n\nThe post-breakout rally may surge the price by 9% before hitting the major resistance around $2250.\n\nThe intraday trading volume in Ether is $11.6 Billion, indicating 10% loss/\n\nSource- Tradingview\n\nIn the past month, the Ethereum price has shown a notable recovery of 38.44%, with its price escalating from a low of $1,543 to a high of $2136. However, a closer examination of the daily chart indicates that this recovery is still operating within the confines of a rising wedge pattern.\n\nThis pattern has been guiding the ETH price movements for the past 16 months, with the coin price resonating between the converging trendlines that offer dynamic resistance and support.\n\nRecently, as this altcoin price approached the upper trendline of this pattern, it experienced a minor pullback to $2200, likely in an effort to gather bullish momentum. If the buyers can maintain their position above the support levels of $1,222 or $1,830, there is a potential for a 9% surge from its current price, aiming for the overhead trendline around $2,240.\n\nHowever, as per the past price behavior, a retest to the resistance trendline has led to increasing supply pressure and a major correction. Ideally, this pullback may extend to the $1700 mark.\n\nWhale Activity Threatened for Correction\n\nOn November 14th, on-chain data provider Lookonchain on its X platform highlighted significant movements by smart money investors in Ethereum. The past week has seen several large transactions, suggesting that whales are actively engaged in the market. Interestingly, a majority of these transactions seem to be profit-taking or movements of the asset back to exchanges, potentially indicating a readiness to sell. This could increase supply pressure on Ethereum, possibly leading to a further decrease in its price\n\nExponential Moving Average (EMA): The 20-day EMA slope could provide an additional slope amid the pullback phase.\n\nMoving Average Convergence/Divergence: A bullish crossover state between the MACD (blue) and signal(orange) accentuates the overhead market sentiment."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vZGVjcnlwdC5jby8yMDU4ODYvbWFyZ2luZWQtYml0Y29pbi1ldGhlcmV1bS1mdXR1cmVzLWNib2XSAUZodHRwczovL2RlY3J5cHQuY28vMjA1ODg2L21hcmdpbmVkLWJpdGNvaW4tZXRoZXJldW0tZnV0dXJlcy1jYm9lP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Margined Bitcoin and Ethereum Futures Launching on Cboe in January - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCboe Digital today announced plans for margin Bitcoin and Ethereum futures.\n\nThe move will mean the platform will become the first to offer both spot and leveraged derivatives trading in one place, Monday’s announcement said.\n\nA margined futures contract requires the buyer and seller to deposit an initial margin and maintain a minimum margin balance as long as the contract remains open. Futures contracts themselves are a type of derivative that allow investors to bet on the future price movements of an asset.\n\nAD\n\nAD\n\nCboe Digital is the digital asset arm of the Chicago Board Options Exchange (CBOE), which accounts for roughly 34% of total U.S. options volume according to the company’s recent earnings report. The margin Bitcoin and Ethereum futures will launch on January 11, while physically delivered products will come at a later date, subject to regulatory approvals, it continued.\n\nFutures in the world of derivatives trading are agreements that obligate a trader to buy or sell an asset at a specific time, quantity and price.\n\nCboe Digital already offers crypto futures but this product will allow traders to use leverage—or borrowed funds to make bets with the hope of getting bigger returns.\n\nPresident of Cboe Digital John Palmer said: “Futures have long served as valuable hedging instruments in the traditional financial markets, and we couldn't be more excited to extend access to this tool further into the digital assets markets and offer margined trading for our customers.”\n\nA number of trading firms such as B2C2, BlockFills, CQG, Cumberland DRW, Jump Trading Group, Marex, StoneX Financial, Talos will support the launch by providing liquidity.\n\nAD\n\nAD\n\nAlthough the futures market is big, several Ethereum futures exchange-traded funds (ETFs) started trading in the United States for the first time last month but got off to a slow start."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3RoZWNyeXB0b2Jhc2ljLmNvbS8yMDIzLzExLzE0L2V0aGVyZXVtLWluc2lkZXItc2F5cy12aXRhbGlrLWJ1dGVyaW4tYW5kLWpvc2VwaC1sdWJpbi1zYWJvdGFnZWQtY3J5cHRvLWVuZ2FnZWQtaW4tZnJhdWR1bGVudC1pY29zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Insider Says Vitalik Buterin and Joseph Lubin Sabotaged Crypto, Engaged in Fraudulent ICOs - The Crypto Basic",
        "content": "Renowned crypto advisor Steven Nerayoff accuses Ethereum founders Vitalik Buterin and Joseph Lubin of sabotaging crypto and engaging in fraudulent ICOs.\n\nSteven Nerayoff, an early Ethereum advisor, has continued to make shocking allegations against ETH founders Joseph Lubin and Vitalik Buterin.\n\nEthereum Founders Accused of Sabotaging Crypto\n\nIn a series of tweets today, Nerayoff accused Buterin and Lubin of sabotaging the crypto industry.\n\n- Advertisement -\n\nAccording to the renowned crypto advisor, the Ethereum execs were more focused on issuing thousands of fraudulent tokens via initial coin offerings (ICOs) and fleecing investors.\n\nDid Vitalik invent anything? No he did not. Ethereum never scaled bc of him. Only killer app was issuing Utility Tokens on ICOs both of which I invented. Vitalik & Lubin sabotaged crypto. Their focus was merely to issue hundreds or thousands of fraudulent ICOs fleecing people. — Steven Nerayoff (@StevenNerayoff) November 14, 2023\n\nButerin Responsible for Ethereum Scalability Woes\n\nNerayoff made the claim in response to an XRP enthusiast who alleged that Buterin was sleeping on Ripple CTO David Schwartz’s couch when he sought an internship opportunity at the San Francisco-based blockchain company.\n\nAs reported last year, former Ripple director Matt Hamilton first drew attention to this allegation during a debate about decentralized projects. Since Hamilton made the allegation, several XRP enthusiasts have been using the comment to troll Buterin.\n\n- Advertisement -\n\nCommenting on this criticism, Nerayoff asserted that Buterin never did not invent anything. Furthermore, the crypto advisor mentioned Buterin as the major reason why the Ethereum network faced scalability challenges.\n\nNot New\n\nThis is not the first time Nerayoff has made shocking allegations against the team behind the Ethereum project. Earlier this month, Nerayoff claimed that the corruption that happened at Ethereum was 1,000 times bigger than the FTX saga,\n\nTo further buttress this, Nerayoff claimed that Lubin and Buterin had secret dealings with government officials, including SEC chairman Gary Gensler and his predecessor Jay Clayton, to establish a favorable regulatory environment for ETH.\n\nDuring his recent appearance on the Crypto Town Hall show, Nerayoff disclosed that he would soon start dropping evidence to support his claims about Ethereum founders’ fraudulent activities.\n\nNotably, the former advisor became vocal about Ethereum operations after he was charged with alleged extortion in 2019. However, the DoJ withdrew the case, with many speculating that Nerayoff’s allegations against the government could be factual."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tc3BvdC1ldGYtYmxhY2tyb2NrLXNlYy_SAUpodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2V0aGVyZXVtL2V0aGVyZXVtLXNwb3QtZXRmLWJsYWNrcm9jay1zZWMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Spot ETFs: BlackRock Takes The Fight To SEC With New Filing - NewsBTC",
        "content": "BlackRock and NASDAQ have outlined why the SEC needs to approve the investment company’s new spot Ethereum exchange-traded fund (ETF) filing. According to the filing with the SEC, approval of a Spot ETH ETP would represent a major win for the protection of U.S. investors in the crypto asset space.\n\nIf approved, the iShares Ethereum Trust would allow regular investors to trade Ether, the world’s second-largest cryptocurrency by market cap, as easily as stocks can be traded.\n\nBlackRock And NASDAQ Lobbies SEC To Allow Spot ETH ETFs\n\nBlackRock, the world’s largest asset manager, recently applied to the SEC to launch an Ethereum exchange-traded fund (ETF) linked to the spot price of Ethereum. BlackRock wasn’t the first investment company to make this type of application, as hedge fund Ark Invest already filed for a Spot Ethereum ETF in September. However, the news of BlackRock’s filing sent Ethereum surging more than 11% in less than 24 hours. As a result, ETH broke over the strong $2,000 resistance level for the first time in seven months.\n\nBlackRock’s Spot ETF is called the “iShares Ethereum Trust” and is sponsored by Ishares Delaware Trust Sponsor LLC, a subsidiary of Blackrock Inc. Coinbase, the largest crypto exchange in the US, acts as the custodian for the Trust’s ether holdings, which are to be traded on the NASDAQ exchange.\n\nIn its SEC filing, NASDAQ asked for a proposed rule change in order for it to list and trade shares of the ETF. According to the filing, US investors, for the most part, have lacked a US-regulated way to gain exposure to Ethereum investments. It also argues that most of the current methods are risky and subject to high trading fees and volatile discounts.\n\nFor example, an investor who purchased the largest OTC ETH Fund in January 2021 and held the position at the end of 2022 would have had a 30% loss due to the change in the premium/discount, even if the price of ETH did not change. However, a spot ETH ETP like the proposed iShares Ethereum Trust ETF would better protect investors against the risk of losses through fraud and high premiums.\n\n“To this point, approval of a Spot ETH ETP would represent a major win for the protection of U.S. investors in the cryptoasset space,” the filing said.\n\nPotential Impact On Ethereum Price If The ETF Is Approved\n\nDespite spot crypto ETFs being available in other countries, including Germany, France, and Canada, the SEC has been hesitant to greenlight a crypto ETF in the US, and 12 Bitcoin spot ETFs are currently waiting for approval.\n\nA US Spot Ethereum ETF would significantly boost interest and confidence in Ethereum and ultimately drive the asset to new highs. The hype leading up to the approval may also push the asset to a new yearly high.\n\nETH is up by more than 60% this year and has outperformed BTC in the past few days. It is currently trading at $2,060 and analysts believe a bullish cross over $2,150 would signal the end of the bear market for ETH.\n\nETH price remains above $2,000 | Source: ETHUSD on Tradingview.com\n\nFeatured image from DataWallet, chart from Tradingview.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLW5ldHdvcmstZmVlcy1oaXQtNC1tb250aC13aXRoLWV0aC1wcmljZS11bmRlci1wcmVzc3VyZS13aGF0cy1uZXh0L9IBZGh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLW5ldHdvcmstZmVlcy1oaXQtNC1tb250aC13aXRoLWV0aC1wcmljZS11bmRlci1wcmVzc3VyZS13aGF0cy1uZXh0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "ETH Price: Ethereum Network Fees Hit 4-Month With ETH Price Under Pressure, What’s Next? - CoinGape",
        "content": "After a string upswing to $2,100 last week after the news of BlackRock filing a spot Ethereum ETF, the ETH price has come under some selling pressure and is currently trading at $2,036.04 level.\n\nEthereum Fees Hit 4-Month High\n\nEarlier this week on Sunday, November 12, the Ethereum network fees climbed to $5.72 per transaction hitting its highest levels since July 2023.\n\nadvertisement\n\nOn-chain data provider Santiment noted that with the resurgence of Ethereum (ETH) above $2,000 last week and increased network activity, it’s no surprise that fees have also climbed. However, in relative terms, transaction costs remain affordable compared to the elevated average fee levels of $14 observed in May. Keep an eye on the potential impact on other ERC-20 tokens as well.\n\nETH Price and Options Data\n\nThe Ethereum chart reveals a recent pullback following a significant price surge, indicating a momentary pause in the market. This consolidation phase is considered healthy, providing an opportunity for the market to establish new support levels. Ethereum’s price remains comfortably above both its 50-day and 100-day moving averages, signaling an overall bullish trend. The relative strength index (RSI) has retreated from overbought levels, creating potential room for another upward price movement.\n\nIf Ethereum maintains its support and avoids dipping below the moving averages, there’s potential for another rally, potentially fueled by increased adoption and positive market sentiment. Observing a narrowing of Bollinger Bands, followed by a breakout above the upper band, could indicate the beginning of another bullish phase.\n\nIn recent trading activity, Ethereum witnessed increased block trades, with 60,000 options accounting for 40% of the day’s total volume, amounting to a notional value of $120 million. The primary trade involved December calls, with a notable transaction of nearly $50 million, likely representing the closure of a previous market maker’s position.\n\nDuring this ongoing bull market, significant whales initiated long positions in October, yielding substantial profits. With the bull market still intact, these major players have yet to close their positions, maintaining a continued bullish stance."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMilgFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3NvbC1iZWNvbWVzLWluc3RpdHV0aW9uYWwtaW52ZXN0b3JzLWNob2ljZS1vdmVyLWV0aGVyZXVtLWFzLXNvbGFuYS1wcmljZS1zdXN0YWlucy1hYm92ZS01MC0yMDIzMTExMzIzMjHSAZoBaHR0cHM6Ly93d3cuZnhzdHJlZXQuY29tL2FtcC9jcnlwdG9jdXJyZW5jaWVzL25ld3Mvc29sLWJlY29tZXMtaW5zdGl0dXRpb25hbC1pbnZlc3RvcnMtY2hvaWNlLW92ZXItZXRoZXJldW0tYXMtc29sYW5hLXByaWNlLXN1c3RhaW5zLWFib3ZlLTUwLTIwMjMxMTEzMjMyMQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "SOL becomes institutional investors' choice over Ethereum as Solana price sustains above $50 - FXStreet",
        "content": "Share:\n\nSolana price has been one of the biggest attention grabber over the past couple of days owing to its unexpected 25% rally in a single day right before the weekend. While a specific reason cannot be deduced for the rise, the potential lies in the fact that SOL is now becoming one of the most preferred institutional assets.\n\nSolana sees institutional interest\n\nSolana is already one of the biggest cryptocurrencies in terms of gains, and the institutions seem to be observing this keenly, too. Consequently, cryptocurrency has become the most in-demand asset when it comes to institutional investors, surpassing even Ethereum.\n\nThe CoinShares weekly institutional investors’ report highlights that for the week ending November 10, SOL observed inflows worth $12.4 million, which added to the monthly inflows of $23.1 million, bringing the year-to-date inflows to $121 million.\n\nEthereum and others, on the other hand, are far below SOL when it comes to year-to-date flows, although Ethereum is making slight progress this past month, as noted by the $62 million inflows since November began.\n\nSolana institutional investment\n\nThis will prove to be highly helpful for SOL in noting a boost in its value but also push the price and value of the Grayscale Solana Trust, also known as GSOL. The Grayscale investment product, following the rally in Solana price, has exploded, with the investment vehicle trading at a premium of 378% since the beginning of October.\n\nGSOL 3-day chart\n\nWhile investment product value is not considered to be an accurate measure of demand, it does highlight the rate of improvement.\n\nSolana price reverses after rally\n\nSolana price trading at $52.41 has noted a near 7% decline on the 3-day chart, with SOL noting an 18.02% decline from the intra-day trading highs of the token. The most likely outcome right now for the altcoin is slow declines followed by a reversal in the cryptocurrency’s price.\n\nSOL could see a gradual decline over the next couple of days, bringing the altcoin to test the support line at $46.42. While the drawdown may not be significant, losing this support would prove to be harmful as it would extend the 24-hour losses towards the $40 level.\n\nAlthough no clear signals of a price reversal are visible, the consistent rally has overheated the market, which would need some cooldown. This might result in further decline.\n\nSOL/USD 3-day chart\n\nHowever, if Solana price bounces off the $46.42 support line and climbs back to breach the $59.03 resistance level, it would invalidate the bearish thesis and send SOL towards tagging the new highs beyond $60.\n\n\n\n"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vZmluYm9sZC5jb20vYmxhY2tyb2Nrcy1zcG90LWV0aGVyZXVtLWV0Zi1hcHBsaWNhdGlvbi1jb3VsZC11bmxvY2stYmlsbGlvbnMtZnJvbS1pbnN0aXR1dGlvbmFsLWludmVzdG9ycy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "BlackRock's spot Ethereum ETF application could unlock billions from institutional investors - Finbold - Finance in Bold",
        "content": "BlackRock Inc. (NYSE: BLK), the financial giant, applied for a spot Ethereum (ETH) ETF on November 9, eyeing a substantial influx of institutional investment into the cryptocurrency market. The ETF, if approved, would allow investors direct exposure to Ether’s price without purchasing the digital asset directly.\n\nThe company’s step towards Ethereum signals a broadening interest in digital assets beyond Bitcoin (BTC). Historically, ETFs often attract substantial investment due to their ease of access and simplification of asset buying for institutional players who don’t want to self-custody their holdings.\n\nIndustry observers assert that BlackRock’s suite of offerings in the cryptocurrency sector could bolster market infrastructure and investor confidence. The move arrives amidst a more robust regulatory environment and a climbing interest in cryptocurrencies from traditional financiers.\n\nIf the U.S. Securities and Exchange Commission greenlights the application, this would mark an unprecedented step. It would establish the first-ever spot Ether ETF in the U.S. Nevertheless, BlackRock has also disclosed potential risks, like indirect exposure to stablecoins.\n\nAnalysts opinion on a BlackRock’s spot Ethereum ETF\n\nDespite the forecasted risks, analysts predict an ETF could lead to unlocking billions of dollars from institutional investors, according to a complete report by Kitico News on November 14.\n\nDavid Waugh, business development and communications specialist at Coinbits, believes this move highlights BlackRock’s interest in the “broader cryptocurrency space.”\n\n“The spot ETH ETF news has already caused short-term positive price movement. The increased buying from institutional investors will create upward price pressure.” — David Waugh\n\nNotably, four other experts demonstrate a bullish bias for both Ethereum, Bitcoin, and cryptocurrencies following this news. All of them told Kitico News they foresee an increased institutional interest moving forward and believe BlackRock’s filings have a very high chance of approval.\n\nThe firm’s influential position is repeatedly mentioned as a gateway for significant institutional money into the cryptocurrency market. BlackRock’s potential new product represents a pivotal moment for the integration of these previously rejected digital assets into mainstream finance.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vZGVjcnlwdC5jby8yMDU4NTkvZm9ybWVyLXBvbHlnb24tbGFicy1wcmVzaWRlbnQtcnlhbi13eWF0dC1qb2lucy1ldGhlcmV1bS1sYXllci0yLW9wdGltaXNt0gFoaHR0cHM6Ly9kZWNyeXB0LmNvLzIwNTg1OS9mb3JtZXItcG9seWdvbi1sYWJzLXByZXNpZGVudC1yeWFuLXd5YXR0LWpvaW5zLWV0aGVyZXVtLWxheWVyLTItb3B0aW1pc20_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Former Polygon Labs President Ryan Wyatt Joins Ethereum Layer-2 Optimism - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nFour months after departing Polygon Labs, Ryan Wyatt is joining the team supporting a totally different Ethereum scaling network: Optimism.\n\nOn Monday, the former Polygon Labs president was announced as the Chief Growth Officer for Optimism Unlimited, a newly created subsidiary of the Optimism Foundation. Wyatt will build a team to support adoption and development on Optimism across a variety of functions, including business development, marketing, partnerships, and beyond.\n\nAhead of the announcement, Wyatt described Optimism to Decrypt as having the “best team in all of crypto.”\n\nAD\n\nAD\n\n“They've really shown what they can do in the last 12 months, particularly, from both the tech perspective as well as people buying into Optimism and the ethos,” he continued. “I just think there's an opportunity to really ramp up the non-technical efforts of the Optimism Collective. That's what I'm good at and that's what I like doing.”\n\nWyatt was with Polygon Labs from February 2022 until this past July, when the company announced that he was stepping down. Marc Boiron, previously Polygon Labs’ Chief Legal Officer, stepped into a new CEO role to lead the firm as Wyatt departed. Wyatt said at the time that he planned to stay in the crypto industry.\n\nAsked why he wanted to leave Polygon Labs and take on a new challenge elsewhere in the space, Wyatt told Decrypt that his move was “less about leaving Polygon” and more about taking on a new challenge to grow a decentralized network that’s still relatively young.\n\n“There's really a special moment in time where you get to build out a team, build out a community, stand it up, and then turn the keys over to the world. And that is a moment in time that's happening now,” he said. “I want, on a personal level, to be really impactful during that time, and I think there's a huge opportunity to do it at Optimism.”\n\nJing Wang, co-founder of Optimism, told Decrypt that current adoption on the network has been supported by a two-person business development team. She believes that Wyatt’s addition, and his plans to ramp up those efforts, will make a considerable impact.\n\nAD\n\nAD\n\n“I think Ryan can 100x adoption for us,” said Wang. “That's what I'm most excited about.”\n\nAt Polygon Labs, Wyatt was credited with helping to court a number of prominent brands to build on the Ethereum scaling network, including Starbucks, Nike, and Reddit. Decrypt named Polygon its 2022 project of the year based in part on the significant mainstream brand adoption that took place during that span.\n\nAsked if he will approach business development and brand adoption for Optimism like he did with Polygon, Wyatt said that some of the same tactics will come into play. However, he said that given Optimism’s focus on decentralization, he plans to help encourage growth across communities rather than assemble a large, central team to try and drive adoption.\n\n“Optimism is so focused and so far ahead on the decentralization front,” he said. “And so there's a unique opportunity to leverage and rally around the community to be able to amplify our efforts.”\n\nOptimism’s OP Stack tech is already driving other networks, most notably Base, the Ethereum layer-2 network incubated by Coinbase and launched earlier this year. Base, which houses the buzzy social app Friend.tech and other applications, shows the kind of path forward that Wyatt hopes to see more broadly, with the OP Stack standing up various scaling networks.\n\n“You have Ethereum here; we want the bedrock of all the blockchains to be built on Optimism,” said Wyatt. “And that's where I think it's going, and that's where it's certainly going fast\n\nWyatt comes from a gaming and esports background, and led YouTube Gaming for several years before joining Polygon Labs. Before that, he was an esports commentator and industry executive. Wyatt said that gaming will be a significant focus for him at Optimism as he tries to drive forward adoption around digital item ownership.\n\n“I truly believe that digital ownership in a certain subset of games is going to be really important,” said Wyatt, affirming previous comments during his time at Polygon Labs. “Gaming will be very important for Optimism, and we're going to do a bunch of cool shit in gaming.”\n\nAD\n\nAD\n\n“That’s why it’s called the OP Stack,” added Wang, citing the gaming term “OP” or “overpowered.”"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZGFpbHljb2luLmNvbS9zb2xhbmEtdXAtMTUwLW92ZXJ0YWtlcy1ldGhlcmV1bS1pbi1hY3RpdmUtdXNlcnMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Solana Up 150%, Overtakes Ethereum in Active Users - DailyCoin",
        "content": "Solana sees almost 150% price increase in 30 days, trading above $50.\n\nSolana surpasses Ethereum in daily active users by 10%.\n\nProgress in Solana’s upgrades influences market confidence and user activity.\n\nSolana (SOL) has recently made headlines with its noteworthy performance. As a major player in the altcoin market, Solana’s movements have significant implications for the industry. Its recent surge in price and user activity, particularly overtaking Ethereum in daily active users, has attracted the attention of investors.\n\nSolana’s Remarkable Rise: A Detailed Look\n\nSince early October, Solana has been leading the altcoin rally with consistent gains. On Tuesday, November 14, SOL’s price skyrocketed by almost 150% over a 30-day timeframe, leading the latest crypto rally.\n\nThe latest surge saw Solana trade above $50 for the first time in 18 months. Currently, Solana is trading at $54.48. However, it’s not just investors that have seen renewed confidence in Solana; users are coming back too.\n\nOn November 11, Solana’s daily active users reached an impressive milestone, overtaking Ethereum mainnet users by 10%. This surge in user activity, from around 200,000 in September to over 356,000, underscores Solana’s growing relevance in the crypto ecosystem.\n\nSolana’s Ecosystem Growth and Market Impact\n\nThese developments are partly attributed to Solana’s ongoing upgrades and a broader market rally. The recent progress towards the network’s Firedancer upgrade and the easing of concerns regarding the FTX bankruptcy estate’s potential impact on SOL’s market have played a crucial role.\n\nAdditionally, the broader cryptocurrency market has shown signs of recovery, with Solana outperforming many rival digital assets.\n\nSolana’s ecosystem is experiencing significant growth across various sectors. The network’s total value locked in DeFi protocols, a key indicator of ecosystem health and utility, has seen a 62% increase, according to DeFiLlama.\n\nOn the Flipside\n\nWhile Solana’s progress is impressive, it’s essential to recognize Ethereum’s position. For one, Ethereum has a strong Layer 2 ecosystem. These networks, designed to enhance transaction speed and reduce costs, have attracted over 800,000 users across the top seven networks, overshadowing Solana.\n\nFurthermore, Ethereum’s broader ecosystem, including Layer 2 solutions, drives about 60 transactions per second, accounting for a significant portion of the blockchain activity.\n\nWhy This Matters\n\nSolana’s emergence as a formidable contender represents the broader blockchain innovation trend.\n\nRead more about Solana:\n\nSolana (SOL): The Fastest Layer One Blockchain\n\n\n\nRead more about JP Morgan’s stance on Bitcoin ETFs:\n\nJP Morgan Questions Bitcoin Spot ETF Market Excitement"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS92aWRlby9ldGhlcmV1bXMtbmV4dC13YXZlLW9mLWFkb3B0aW9uLWlzLWNvbWluZy1vcHRpbWlzbS11bmxpbWl0ZWQtY2hpZWYtZ3Jvd3RoLW9mZmljZXIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Ethereum's 'Next Wave' of Adoption Is Coming: Optimism Unlimited Chief Growth Officer - CoinDesk",
        "content": "Our next guest previously served as president at Polygon Labs and was also the head of Gaming at youtube. Now he's joining a unit of the Optimism Foundation. Joining us to discuss is Ryan Wyatt, the Chief Growth Officer of Optimism Unlimited Ryan. Welcome to the show. Good morning. Thanks for having me. It's good to be back. It's been a little bit. It really has and congratulations the new position. Thank you so much. I'm excited. I'm excited. I'm on the road. You can see him in the hotel room. You all have me up bright and early this morning. I'm ready to rock. We love to get people up bright and early. All right. So from polygon to optimism, both are layer twos, talk to us about the layer two race. Um What makes one layer two stand out above another? No, it's a great question. I think it's fun time to be a part of the Ethereum ecosystem and building. You know, I think one thing we've all really come to the realization as far as those building Ethereum ecosystem is that it's going to take a number of these, whether you call them dedicated app chains L twos, whatever the case may be to really scale this next wave of adoption that we all believe coming, you know, there's a new wave of a lot of developers that are building, there's been a lot of capital deployed across the app ecosystem. A lot of these apps that we haven't even seen yet. Um And so we, as we scale, we're going to need a lot of them. And so what does that mean? Well, how do these things start to speak to each other? How do they become interoperable so that you start to have these very seamless network experiences? You know, I think for users, it's been tough if you're not like very crypto native navigating the ecosystem hasn't been easy. And so we want to make that a lot easier. I think optimism is best positioned to do that with the op stack. You have, you know, companies like Coinbase has chosen optimism to build their, their stack with. So base is A L two that is built on the OPP stack. And when these things start to speak with, one of you can see all these users come in and then be able to seamlessly work around these protocols. So I think point of entry is going to be really important. And what optimism did with Coinbase was pretty critical because I think a lot of us would agree that, you know, a big funnel for crypto users coming in will be through Coinbase. So, why do you like optimism more than Polygon? Oh, I don't know if I would look at it that way. You know, I spent the last decade at youtube in Polygon. Two, almost two years of Polygon. Love my time there. I think it was really fun for me to get to build out, you know, a, a team and organization at Polygon. I think the work that I did there speaks for itself. But optimism is very special for a number of reasons. One, they are far ahead in what they've been able to do from a decentralization standpoint. So they have two different mechanisms which I find to be fascinating. One is what they call retroactive public goods funding. Um And what that does is it, it puts out kind of a, a process for developers on what to build and if they build that and they gain the right traction and activity, then they can be rewarded with op tokens. This is decided by the community. I think this is what's a great part about because as we usher in this next age, we really need to keep moving forward, genuine decentralization. And we can't grow these large teams that are sitting on the protocol side. Or else it's very disingenuous to the idea that we're going to have these networks that are truly owned by nobody. They are owned by the community. And optimism made that a core part of their ethos more than any other chain or protocol that I've seen. And so I think it makes them very special more than Polygon. Did you will get there? Yeah. Polygon will get there. You know, I think it's, it's part of polygon. Were they upset? Were you like, ha ha, I'm leaving for your competitor now? No, I love them. I actually, II, I give all credit to say deep, very kind uh as part of the process, You know, I hired a vast majority of that leadership team and so it's all love you poach their leadership team as well. No, no, I hired a lot of the leadership team at Polygon. I'm on day two. Come on, come on. I work fast but not that fast. I'm only on day two. No, I love that team. I think very highly of the Polygon team. It has more about like, what's a fit for me. And I really like working with this optimism team and where their hearts at and, and, you know, I've been a builder, I started the youtube gaming team. I built out a lot of polygon. I'm excited to do the same thing at optimism. I want to draw on your experience from youtube gaming. Are you hoping to bring game developers to the optimism ecosystem? And if so, what's the value prop there? Yeah, absolutely. I think, you know, that we can improve on as a, as you said in gaming. I love it. I think it's really a matter of focus, there's no technical limitations that's prohibiting optimism from participating in this ecosystem. So I think it's about making sure that we make it a focus a lot of where optimism has done well, has been even on social and identity. So things like friend tech and forecast are all building inside of the op ecosystem. So we're going to go after gaming and, and that will be a big focus for us. It's a good time too because if you think about like the last couple of years, games in web three have been largely pretty rudimentary. You know, if you think about the first iteration, they were, they were almost these, you know, financialized games that, you know, didn't have best kind of optimized outcomes that you would want for. Um So I actually think this next iteration is primed for it. Um And I'm really excited to bring gaming to optimism. It's, it's a no brainer for us. You know, when we talk about gaming, I think a lot of people automatically think about those financialized games when you talk about the next iteration. What does that look like? What is that? Yeah, you know, well, they look at, I mean, honestly, that's, it's such a broad spectrum. You know, there are things like uh fully on chain games where literally every activity that you're doing is actually on chain and then there will be parts of games that are only doing some of it, whether it's the marketplace, whether it's just uh membership passes, whatever they do. I mean, you could really run a variety of different outcomes for how you want games look. I think the really the point it needs to be is that it's got to be games first. You know, I think so much of it has been like the financialization aspect first in the game development, but you saw billions of dollars of capital come into specifically games, web three games, it takes years for games. So I think a lot of it is patience to see more of these, you know, better thought out games, better produced games. And so they're coming, they're on the horizon, they're going to be happening across the ecosystem and look that's just good for the space. I think we all are in an era now and out of our learning is like we need to root for each other and champion each other because we just want developer adoption and we want to start seeing these things succeed and games, games will be in prime time, I think in 2024. So uh what does the space look like right now though between uh let's say between optimism and polygon, as you said, you, you helped build that team. Uh what's the uh the current landscape like? Yeah, I think in terms of market share and, and revenue, etcetera, you know, market share is so is so nascent to have to like put too much of an emphasis on this. I think the real thing that everyone needs to focus on that are L two solutions is look, we've got to scale this thing and you know, one chain like a main net is not going to do it because there will be congestion. So it's like this accepting the fact that we're going to need a lot of L twos in order to do this and how you connect these across the ecosystem. So that's to be the focus. It's not going to be a developer issue. Like there are so many great developers, there's so much capital out there still for those developers, despite what, you know, public might say. And so it's, it's going to be making sure that these user journeys that people that are going to come in and use these apps that it's seamless that it's easy because it hasn't been right. And like that's what all of us need to be focusing on. You know, the big conversation around all of these ecosystems is mainstream adoption. I believe we spoke about it on the show during your time at Polygon lab, Starbucks started their NFT based loyalty program. Any big partnerships in the works for optimism with mainstream brands like Starbucks. Look, I think we'll, you know, my mo so uh I'm sure there will be some in the uh you know, in, in, in the iron but um can't share anything right now, but just work with developers of all sizes, right. Like, I think the beauty of it is you don't know where the next breakout is going to come from. It. It is not a guarantee that it's some large enterprise or fortune 500 company or whatever the case may be. I think it can come from all different shapes and sizes. Yes. You know, you have a company like Coinbase that picks optimism to choose to build their base network on. And so we that's Fortune 500 option. You'll see more of it in the future. But yeah, we are going to work with all sizes and that will be fun. So, yeah, I think keep your eyes peeled. Sure. We'll be on talking more. We'd love to have you back, Ryan. We're gonna have to wrap it there. Thanks so much and congratulations again on the new role. Thanks so much. It was good seeing you both have a great day today. See you soon. That was Ryan Wyatt, Chief Growth Officer of optimism Unlimited."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvY3J5cHRvcy1zdXJnZS1hcy1ibGFja3JvY2stZXRoZXJldW0tZXRmLXBsYW4taXMtY29uZmlybWVk0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Cryptos surge as BlackRock Ethereum ETF plan is confirmed - Nasdaq",
        "content": "Bitcoin (BTC) has again been making headlines and capturing the attention of crypto enthusiasts and traders. The popular digital currency has recently surged to levels not seen in almost eighteen months.\n\nSince taking out the $32,000 level of resistance near the end of October, the price of one bitcoin has surged to $38,000. The last time the bitcoin price traded near this level was over a year ago, in May 2022.\n\nBitcoin and another leading, popular digital currency, Ethereum (ETH), have also been in the headlines for reasons other than price surges. The world's largest asset manager, BlackRock, recently filed for an Ether exchange-traded fund. This move created further optimism that the crypto markets could see greater access, more significant institutional involvement, and liquidity.\n\nSo, as the price leading cryptocurrency’s trade higher in part due to the potential of a regulated exchange-traded product tied to the spot price of Ethereum, it’s worth looking closer at some individual stocks tied to digital currency and also noting where the U.S. Securities and Exchange Commission (SEC) stands with regards to approving a Bitcoin ETF.\n\nBlackRock takes steps toward launching Ethereum ETF\n\nBlackRock has officially confirmed its plans for a spot Ethereum exchange-traded fund (ETF) through a filing with the SEC. The filing, submitted by Nasdaq on behalf of BlackRock, proposes an ETF named the \"iShares Ethereum Trust.\" This move signifies BlackRock's intention to expand its ETF offerings beyond Bitcoin, marking a significant step in its cryptocurrency investment strategy.\n\nThe filing comes after BlackRock registered the corporate entity \"iShares Ethereum Trust\" in Delaware, hinting at the imminent submission of a spot Ether ETF filing. Several financial firms, including BlackRock, have shown interest in cryptocurrency-backed ETFs, with at least five firms vying for SEC approval for a spot Ethereum ETF, according to Bloomberg’s James Seyffart.\n\nSpeculation grows about the SEC approving a spot Bitcoin ETF\n\nSpeculation is growing about the SEC approving a spot Bitcoin ETF. Analysts have estimated a January approval at the earliest, emphasizing the SEC's cautious stance. Recent speculation suggests potential decisions on applications from BlackRock and Fidelity, but the SEC extended the timeline for the ARK 21Shares Bitcoin ETF to Jan. 10.\n\nSo, as speculation grows and the price for several popular digital currencies surges, here’s a list of four crypto-related stocks that could see rapid price appreciation should breaking news occur.\n\nFour crypto-related stocks to keep an eye on\n\nMarathon Digital (NASDAQ: MARA)\n\nMara is a Las Vegas-based digital asset technology company. The company specializes in blockchain-based mining and produces digital assets such as Bitcoin. Shares of the crypto company have skyrocketed this year, up about 180%. However, the stock has failed to join the latest crypto uptrend and, over the previous three months, fell almost 36%.\n\nMicroStrategy (NASDAQ: MSTR)\n\nMicroStrategy is a global provider of enterprise analytics software and services. MicroStrategy is actively involved with Bitcoin, holding and acquiring the cryptocurrency as part of its strategic investment strategy. As of November 1, 2023, MicroStrategy possesses 158,400 bitcoins, acquired at an average purchase price of $29,609.65 per bitcoin, resulting in a total investment of $4.69 billion.\n\nCoinbase Global (NASDAQ: COIN)\n\nCoinbase Global is a major cryptocurrency exchange offering tools for trading over 200 cryptocurrencies. COIN shares have performed exceptionally on the year by any standard, up almost 163% and recently rallying double-digits off key support in the $70s. However, analysts are not bullish on the stock, with a consensus Hold rating and a price target of $75.64, predicting almost 19% downside.\n\nRiot Platforms (NASDAQ: RIOT)\n\nRiot is a U.S. blockchain technology company that strives to be the premier provider of Bitcoin mining services in North America. The company offers cryptocurrency mining hardware, hosting services, and proprietary software. Shares of RIOT have impressed this year, to say the least, up 205%. However, the stock has failed to catch a bid off the recent sector headlines and has fallen almost 32% over the previous three months.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMioAFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3RvcC0zLXByaWNlLXByZWRpY3Rpb24tYml0Y29pbi1ldGhlcmV1bS1yaXBwbGUtNS1kcm9wLWxpa2VseS1mb3ItYnRjLWFzLWl0LXdvcmtzLW91dC1uZXh0LW1vdmUtbm9ydGgtMjAyMzExMTQxOTAw0gGkAWh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9hbXAvY3J5cHRvY3VycmVuY2llcy9uZXdzL3RvcC0zLXByaWNlLXByZWRpY3Rpb24tYml0Y29pbi1ldGhlcmV1bS1yaXBwbGUtNS1kcm9wLWxpa2VseS1mb3ItYnRjLWFzLWl0LXdvcmtzLW91dC1uZXh0LW1vdmUtbm9ydGgtMjAyMzExMTQxOTAw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Next 3 days could be interesting for BTC as Nov 17 draws - FXStreet",
        "content": "Share:\n\nBitcoin price could fall 5% to bounce at the 250-day EMA at $34,483 for the next leap north.\n\nEthereum price likely to rise 5% to $2,136 range high if the support provided by the ascending trendline above $2,029 holds.\n\nRipple price filling up a symmetrical triangle makes a 10% drop to $0.5981 likely as XRP erases its weekly gains.\n\nBitcoin (BTC) price along with that of Ethereum (ETH) and Ripple (XRP) are static for the moment. However, following recent comments by James Seyffart, an analyst with Bloomberg Intelligence, the US Securities and Exchanges Commission (SEC) has a narrow window ending November 17 to approve spot BTC exchange-traded funds (ETF). On the back of speculation and investors trying to front-run a possible launch, the next three days could be interesting for the king of cryptocurrency.\n\nAlso Read: Week Ahead: Bitcoin ETF approval this week, yay or nay?\n\nBitcoin price eyes 5% slump unless a spot BTC ETF launches\n\nBitcoin (BTC) price could fall 5%, or not, depending on what the US SEC decides to do in the next three days. Whether it will be a yay or nay in regard to the spot Bitcoin exchange-traded funds (ETFs) will be the determining factor as the detailed eight-day window closes fast.\n\nMeanwhile, a 5% slump seems likely for Bitcoin price amid falling momentum. It comes amid buyer exhaustion after BTC was massively overbought. With the Relative Strength Index (RSI) and the Awesome Oscillator (AO) supporting the downside, BTC could slide to test the support confluence between the 25-day Exponential Moving Average (EMA) and the horizontal line at $34,483 before a possible bounce.\n\nIn a more dire case, the slump could crack past $34,483 to test the 50-day EMA at $32,332. Selling pressure could see Bitcoin price lose critical support at $31,190. A daily candlestick close below this level would invalidate the bullish thesis.\n\nBTC/USDT 1-day chart\n\nOn the flipside, increased buying pressure, which would happen if the SEC approves the launch of a spot BTC ETF, could send Bitcoin price north, clearing the range high at $37,972 to bring the $40,000 psychological level into sight.\n\nAlso Read: Bitcoin rages on, $40,000 may not be a hopium pipe dream for BTC after all\n\nEthereum price must hold above ascending trendline to realize upside potential\n\nEthereum (ETH) price is showing weakness, but the overall trend remains bullish. To realize more gains, the second largest cryptocurrency by market cap must hold above the ascending trendline, which could deliver 5% gains for a test of the $2,136 range high. In a highly bullish case, the gains could stretch to the $2,200 psychological level.\n\nETH/USDT 1-day chart\n\nOn the other hand, increased seller momentum could send Ethereum price below the ascending trendline at $2,029. A break and close below this level could see ETH fall into the supply zone turned bullish breaker. A break and close below its midline at around $1,935 would solidify a continuation south.\n\nAlso Read: Ethereum Price Prediction: Eighteen-months ascending triangle pattern appraises $4,000 target for ETH\n\nRipple price fills up a triangle\n\nRipple (XRP) price has filled up a triangle amid reducing volatility in the XRP market. For the next directional bias, investors should wait for a confirmed breakout of this pattern. Meanwhile, all signs point to a downside move, amid falling momentum, indicated by the RSI and the AO histogram bars flashing red.\n\nIncreased selling pressure could see Ripple price break the lower trendline of the triangle to test the 25-day EMA at $0.6187. If the 25-EMA fails to hold as support, the slump could extend for XRP to tag the $0.5981 support level, 10% below the current price. A break and close below this level would clear the path for the remittance token to spiral further, slipping past the 50-day and 100-day EMAs at $0.5837 and $0.5619, respectively, to fall into the consolidation range between $0.5392 and $0.4735.\n\nXRP/USDT 1-day chart\n\nOn the flipside, a break above the upper trendline could see Ripple price stretch to reclaim the November 13 high of $0.7500. In a highly bullish case, it could break past the Fair Value Gap (FVG) ranging from $0.7519 to $0.7623, restoring balance before tagging the $0.8000 psychological level. Such a move would constitute a 20% climb above current levels.\n\nAlso Read: SEC v. Ripple lawsuit still drags on, Judge Torres sets schedule for 2024"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtcHJpY2Utc3VyZ2UtaGFsdGVkLWZvci1ub3ctaGVyZXMtd2hlbi1pdC1taWdodC1zdGFydC1hZ2FpbtIBW2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtcHJpY2Utc3VyZ2UtaGFsdGVkLWZvci1ub3ctaGVyZXMtd2hlbi1pdC1taWdodC1zdGFydC1hZ2Fpbj9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) Price Surge Halted for Now: Here's When It Might Start Again - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum's recent rally has paused, with the ETH price steadying after a substantial surge. This halt prompts investors to ask: When will Ethereum's price rally resume? Analyzing the chart and recent headlines gives us insights into possible future scenarios.\n\nAdvertisement\n\nThe Ethereum chart indicates a recent pullback after a sharp rise in price, with the market taking a breather. This consolidation phase is healthy, as it allows the market to establish new support levels. Ethereum's price is still well above its 50-day and 100-day moving averages, suggesting the overall trend remains bullish. The relative strength index (RSI) has retreated from overbought levels, which could provide room for another price increase.\n\nBullish scenario\n\nIf Ethereum maintains its support level and avoids falling below the moving averages, the price may gear up for another rally. This could be fueled by increased adoption and positive sentiment in the market. Watch for a narrowing of Bollinger Bands, followed by a breakout above the upper band, which could signal the start of another bullish phase.\n\nBearish scenario\n\nConversely, a break below the moving averages could signal a bearish reversal. Increased selling pressure and negative market sentiment could push the price down. A bearish crossover on the MACD could confirm this, suggesting it might be time to brace for a potential downtrend.\n\nRecent data indicates that Ethereum's burn rate has reached steady growth, outpacing emissions six months following the Merge upgrade, contributing to its deflationary aspect​​. Despite this, Ethereum's daily burn rate hit a seven-month low on March 12, showing a more than 89% drop since the record highs​​. Such a dynamic in the burn rate could influence the supply and demand economics, potentially affecting the price.\n\nInvestors should watch for a continuation of the net burn trend, which could lead to decreased supply and higher prices if demand remains steady or increases​​.\n\nShiba Inu joins party\n\nThe meme coin frenzy continues as Shiba Inu (SHIB) grabs the spotlight with its recent price actions, stirring up discussions about whether it can breach the $0.00001 threshold this week. Amid massive transfers by Binance, a technical deep dive is essential to evaluate SHIB's potential.\n\nAnalyzing the SHIB price chart, we observe a significant uptick in its value, with the token challenging previous resistance levels. The moving average convergence divergence (MACD) shows a positive trend, with the blue MACD line well above the signal line, indicating strong bullish momentum. The relative strength index (RSI), although not in the overbought territory, is trending upward toward the 70 mark, which could signify increasing buying pressure.\n\nA crucial factor to note is the breach of the 50-day and 100-day moving averages, which SHIB has surpassed, suggesting a robust uptrend. The volume bars align with the price increase, further confirming the bullish stance among traders. Additionally, the Bollinger Bands are expanding, which typically denotes increased market volatility and a potential for large price movements.\n\nThe psychological mark of $0.00001 is within sight for Shiba Inu. For a sustained move above this level, SHIB would need to maintain its current momentum and see a continued influx of buying volume. If the price can close above this level on the daily chart, it may confirm the bullish breakout, potentially leading to further gains.\n\nRecent SHIB transfers by Binance have added to the speculative fire. Such large-scale movements can be indicative of institutional interest or significant traders taking positions, which in turn can lead to dramatic price movements.\n\nThe current technical setup for SHIB is promising, with the potential to reach and exceed the $0.00001 mark. However, investors should remain cautious, as meme coins can be highly volatile and sensitive to market sentiment. Keeping an eye on the aforementioned technical indicators and the news around large transfers will be key in determining whether SHIB can maintain its upward trajectory."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5meGVtcGlyZS5jb20vZm9yZWNhc3RzL2FydGljbGUvZm9yZWNhc3QtY2FuLWV0aGVyZXVtLXByaWNlLXJlYWNoLTI1MDAtYXMtd2hhbGVzLWFkZC0yMTBtLXRvLW92ZXJoZWF0ZWQtbWFya2V0LTEzODgyMDjSAXJodHRwczovL2FtcC5meGVtcGlyZS5jb20vZW4vZm9yZWNhc3QtY2FuLWV0aGVyZXVtLXByaWNlLXJlYWNoLTI1MDAtYXMtd2hhbGVzLWFkZC0yMTBtLXRvLW92ZXJoZWF0ZWQtbWFya2V0LzEzODgyMDg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Forecast: Can Ethereum Price Reach $2,500 as Whales Add $210M to Overheated Market? - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tYnVsbHMtbWF5LXByb3BlbC1wcmljZS10by0zMTAwLWFuYWx5c3Qtc3VnZ2VzdHMv0gFjaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy9ldGhlcmV1bS9ldGhlcmV1bS1idWxscy1tYXktcHJvcGVsLXByaWNlLXRvLTMxMDAtYW5hbHlzdC1zdWdnZXN0cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Bulls May Propel Price To $3,100, Analyst Suggests - NewsBTC",
        "content": "Ethereum (ETH), the second-largest cryptocurrency, has seen a significant price increase over the past month. The recent bullish rush in the crypto market, coupled with BlackRock’s involvement, has pushed ETH to its year-to-date high of $2,139.\n\nEthereum Outshines Bitcoin And Altcoins\n\nAccording to market data provider Kaiko, ETH has outperformed BTC and many altcoins in recent weeks, signaling a shift in market dynamics.\n\nKaiko’s report highlights how ETH struggled to gain momentum over the past year, despite successful upgrades such as The Merge in April.\n\nHowever, the sentiment around ETH changed dramatically when BlackRock filed for a spot ETH exchange-traded fund (ETF), leading to a reversal in the ETH to Bitcoin (BTC) ratio.\n\nThe impact on the market was substantial, with ETH prices surging above $2,000 for the first time since April. Additionally, daily spot trade volumes reached $7 billion, the highest level since the collapse of FTX.\n\nThe ETH ETF narrative provided further impetus to the ongoing rally, amplified by improved global risk sentiment and declining US Treasury yields.\n\nThe dominance of altcoin + ETH volume relative to BTC has risen to 60%, marking its highest level in over a year. During bull rallies, altcoin volume typically increases relative to BTC.\n\nThis surge in demand has also led to rising leverage, as reflected in the recovery of ETH open interest to early August levels. Notably, BTC open interest has declined over the past month due to liquidations on Binance, resulting in the Chicago Mercantile Exchange (CME) outpacing Binance as the largest BTC futures market.\n\nFurthermore, ETH funding rates, a gauge of sentiment and bullish demand, have reached their highest levels in over a year, indicating a significant shift in sentiment. In November, both BTC and ETH 30-day volatility rose to 40% and 50% respectively, following a multi-year low of around 15% during the summer months.\n\nCrypto Expert Predicts ETH Breakout\n\nRenowned crypto expert Michael Van de Poppe believes that ETH is on the cusp of a significant breakthrough. According to Van de Poppe, if Ethereum manages to surpass the crucial $2,150 resistance level, it could signify the end of the bear market.\n\nDrawing a parallel with Bitcoin’s critical $30,000 barrier, Van de Poppe suggests that breaching this level could pave the way for a substantial rally, potentially propelling Ethereum towards the price range of $3,100 to $3,600.\n\nHowever, Ethereum has yet to touch the $2,150 resistance line, as it faces a pre-existing obstacle in the form of its yearly high of $2,139. This pivotal level has halted the cryptocurrency’s bullish momentum, acting as a formidable resistance.\n\nAs a result, Ethereum has been consolidating within a narrow range between $2,050 and $2,100 for the past three days.\n\nThe forthcoming days will reveal whether Ethereum can overcome its immediate resistance levels and establish a consolidated position above them. Alternatively, it may face a fate similar to Bitcoin, which failed to surpass the $31,000 level for over seven months before reaching its current trading price of $36,000.\n\nFeatured image from Shutterstock, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYm9sZC5jb20vZXhwZXJ0LXByZWRpY3RzLWV0aGVyZXVtcy1sYXN0LWh1cmRsZS1iZWZvcmUtc3VyZ2UtdG8tMzYwMC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Expert predicts Ethereum's last hurdle before surge to $3600 - Finbold - Finance in Bold",
        "content": "Following a solid performance period that has brought lucrative gains for most crypto assets carrying on from the gains made in October, Ethereum (ETH) posted substantial numbers, which saw its value exponentially increase in this timespan.\n\nCrypto specialist Michaël van de Poppe shared insights into the current Ethereum price and where it will face its next resistance point on November 13.\n\nThe analyst suggests that breaking above $2,150 in value could see this cryptocurrency settle between $3,100 and $3,600, as highlighted in his post on X.\n\nEthereum’s predicted resistance point. Source: Michaël van de Poppe\n\nAnother significance in breaking above the $2,150 value for ETH is that accomplishing this feat would mean an end to a bearish market and propel its projected value above the $3,000 threshold.\n\nVan de Poppe suggests that “breaking above $2,150 marks the end of the bear market (for ETH), as this level is comparable to the $30,000 barrier of Bitcoin (BTC).”\n\nEthereum price analysis\n\nAt the time of press, ETH was trading at $2,090, which marks a positive change of 1.88% in the past 24 hours. This comes after an upside in the value of 9.29% over a 7-day period and a substantial gain of 34.89% in the past 30 days.\n\nETH 7-day price chart. Source: Finbold\n\nEthereum currently portrays vital positive signs, with its price above the 200-day simple moving average and exhibition of 22 green days in the previous month.\n\nFurthermore, its price has increased by an impressive 69% in the previous year, while this period also saw it outperform 69% of the top 100 crypto assets.\n\nThis favorable period has seen ETH recuperate 10% of its value in a single day, showing further promising signs for this asset in the future period.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vY29pbmdhcGUuY29tL2JveWFhLXRvLWludmVzdC1pbi1jcnlwdG8td2l0aC0xMDBtLWJpdGNvaW4tZXRoZXJldW0tcGxhbi_SAVNodHRwczovL2NvaW5nYXBlLmNvbS9ib3lhYS10by1pbnZlc3QtaW4tY3J5cHRvLXdpdGgtMTAwbS1iaXRjb2luLWV0aGVyZXVtLXBsYW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Boyaa to Invest in Crypto with $100M Bitcoin, Ethereum Plan - CoinGape",
        "content": "Boyaa Interactive, a prominent Hong Kong-listed gaming firm, has taken a significant step towards expanding its investment portfolio. The company recently announced plans to invest a substantial $100 million in cryptocurrencies. This move marks a strategic shift for Boyaa, traditionally known for its online card games, as it delves deeper into the digital asset space.\n\nBoyaa Plans Major Bitcoin, Ethereum Investment\n\nSubject to shareholder approval, the investment would primarily focus on Bitcoin (BTC) and Ethereum (ETH). Boyaa intends to allocate $45 million to each of these leading cryptocurrencies, totaling $90 million. Additionally, the company plans to invest $10 million in stablecoins, specifically Tether (USDT) and USD Coin. This strategy not only diversifies Boyaa’s investment but also aligns with its vision to integrate with the burgeoning Web3 ecosystem.\n\nadvertisement\n\nBoyaa’s choice of stablecoins underscores its approach to balance stability with growth potential. By investing in stablecoins, the company gains exposure to the U.S. dollar, thus adding a layer of financial stability to its crypto investments. This strategy reflects a thoughtful approach to navigating the often-volatile cryptocurrency market, while still capitalizing on its growth prospects.\n\nCrypto Market Next for Boyaa’s Growth\n\nThe company’s financial health has been robust, as evidenced by a striking 119% year-on-year increase in net profits in the first quarter of 2023. This financial strength provides Boyaa with a solid foundation to venture into the crypto market, which presents another avenue for revenue maximization.\n\nWith this move, Boyaa Interactive joins a growing list of public companies that have embraced cryptocurrency investments. This list includes notable U.S. firms like MicroStrategy and Tesla and other Asian companies such as Meitu. Boyaa’s decision to invest in cryptocurrencies aligns it with global corporate trends and demonstrates its commitment to staying abreast of technological advancements in the digital era.\n\nRead Also: US CPI Rises By 3.2%, Will It Boost Gains In The Crypto Market?"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvZXRoZXJldW0tcHJpY2UtcmFsbHktZ2FpbmluZy1tb21lbnR1bS1hcy1pbnN0aXR1dGlvbmFsLWludmVzdG9ycy1mbG9jay10by1ldGgtaW5jcmVhc2luZy1hdW0v0gF-aHR0cHM6Ly9jb2luZ2FwZS5jb20vbWFya2V0cy9ldGhlcmV1bS1wcmljZS1yYWxseS1nYWluaW5nLW1vbWVudHVtLWFzLWluc3RpdHV0aW9uYWwtaW52ZXN0b3JzLWZsb2NrLXRvLWV0aC1pbmNyZWFzaW5nLWF1bS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Here’s What’s Coming Next If ETH Upholds $2k Support - CoinGape",
        "content": "Ethereum price like many of its peers is struggling to uphold a higher support amid widespread declines. This elevated support area, preferably at $2,000 could determine where ETH price goes after the current consolidation. On the upside, resistance at $2,130 must come down for gains to start increasing toward $2,500 and $3,000. However, losing immediate support could force Ethereum to seek fresh liquidity at lower support levels, for example, in the region between $1,800 and $1,900.\n\nInvestors turned their attention to Ethereum after news broke that BlackRock had made the first step toward filing for an ETH spot exchange-traded fund (ETF) with the Securities and Exchange Commission (SEC).\n\nadvertisement\n\nAlthough the news directly impacted Ethereum price, other cryptos broke out too, including Bitcoin, which hit a new year-to-date high of $38,000.\n\nEthereum price although bullish had corrected to trade at $2,032 at the time of writing, on Tuesday during US business hours. A higher support, preferably at $2,000 would go a long way to help sustain the uptrend, but for now, let’s dive into the burgeoning Ethereum assets under management (AUM).\n\nEthereum Records Highest Weekly AUM Inflows In Months\n\nThe previous week was extremely eventful for the crypto market, but more especially for Ethereum. In addition to the spot ETF filing, CoinShares latest report indicated that Ethereum AUM inflows rose to $49 million—the highest since August.\n\nInflows generally increased across the board totaling $293 million, cumulatively “bringing this 7-week run of inflows past the $1 billion mark, leaving year-to-date inflows at $1.14,” the CoinShares report said.\n\nDigital asset investment products saw inflows totalling US$293m last week, bringing this 7-week run of inflows past the US$1bn mark. Ethereum, saw its largest inflows since August 2022 of US$49m. Solana also saw further inflows totalling US$12m. https://t.co/peTZ1nIE2q — Wu Blockchain (@WuBlockchain) November 13, 2023\n\nThe spike in ETH AUM inflows reinforces the bullish sentiment “likely related to the recent spot-based ETF listing request in the US.”\n\nEthereum Price Upholds Bullish Outlook\n\nEthereum price started the new week in the green, up 8% in the last seven days and 32% in the last month. The resistance at $2,130 was expected, considering it rejected the bulls in April this year.\n\nA minor deep would confirm the strength from support at $2,000 and pave the way for a short consolidation period before Ethereum price triggers another breakout; this time aiming for highs above $3,000.\n\nThe path with the least resistance is to the upside based on the bullish thesis flaunted by the Moving Average Convergence Divergence (MACD) indicator. As long as the momentum indicator moves higher above the neutral zone and the blue MACD line’s position above the red signal line, traders and investors are likely to continue betting on more gains over the next few weeks.\n\nA couple of bullish crosses further cement the bullish narrative. A golden cross occurs in support of an ongoing uptrend and manifests with a short-term MA crossing above a long-term MA.\n\nIn Ethereum’s case, the 50-day Exponential Moving Average (EMA) started by crossing above the 100-day EMA ahead of the second one with the 50-EMA flipping above the 200-day EMA.\n\nThe last time Ethereum price formed these bullish crosses, it went ahead and surged to $2,130 from the January 2023 low of $1,190. Therefore, the formation of these two patterns is a significant bullish signal.\n\nRelated Articles"
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvaGFja2Vycy1zdGVhbC02MC1taWxsaW9uLWluLWNyeXB0by11c2luZy1ldGhlcmV1bS1jb2Rl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Hackers Steal $60 Million in Crypto Using Ethereum Code - Watcher Guru",
        "content": "Hackers have stolen over $60 million worth of crypto from nearly 100,000 victims in the past six months by exploiting a piece of Ethereum code to bypass security alerts, according to research from on-chain investigator ScamSniffer and security firm SlowMist.\n\nThe wallet drainers are misusing a function called Create2. This is normally leveraged by decentralized apps like Uniswap to predict the address of a smart contract before deployment. By abusing Create2, the hackers can instantly generate disposable wallet addresses to receive stolen funds after a user interacts with a malicious signature.\n\n1/ Wallet Drainers are misusing Create2 to bypass security alerts in some wallets by generating new addresses for each malicious signature.\n\n\n\nAfter a discussion with @SlowMist_Team, a group has employed the same technique in Address Poisoning to steal $3M since Aug. pic.twitter.com/yCdJs6Zke7 November 12, 2023\n\nTypically, crypto wallet software displays alerts when a signature requests access permissions. However, the hackers’ clever use of Create2 enables them to disguise malicious code within the signature, allowing wallet access without triggering warnings.\n\nAlso Read: China’s Boyaa Interactive to Spend $90M on Bitcoin and Ethereum\n\nCrypto hacks witness recent surge\n\nOne group of hackers alone has drained $3 million in crypto from 11 victims since August using this Ethereum technique. Overall, ScamSniffer and SlowMist estimate that around $60 million has been stolen from 99,000 victims in the past six months.\n\nThe rise of Create2-based wallet exploits highlights the growing sophistication of crypto-related cybercrime. Just last week, exchange Poloniex revealed a hot wallet breach, resulting in $125 million lost. October also saw victims of the LastPass breach lose $4.4 million in crypto in one day.\n\nAlso Read: US Options Exchange Cboe Launching Margined Bitcoin Futures\n\nAs hackers devise more methods to siphon funds from unsuspecting victims, extra vigilance is crucial. The innovative abuse of Create2 underscores that even trusted blockchain code can potentially be weaponized for theft at scale."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnBlZGlhLm9yZy9wcmljZS1hbmFseXNpcy9ldGhlcmV1bS13aGFsZXMtc2VsbGluZy1zcHJlZS1zcGFya3Mtd29ycmllcy1mb3ItZXRoLXByaWNlL9IBZGh0dHBzOi8vY29pbnBlZGlhLm9yZy9wcmljZS1hbmFseXNpcy9ldGhlcmV1bS13aGFsZXMtc2VsbGluZy1zcHJlZS1zcGFya3Mtd29ycmllcy1mb3ItZXRoLXByaWNlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Whales’ Selling Spree Sparks Worries for ETH Price - Coinpedia Fintech News",
        "content": "Qadir Ak is the founder of Coinpedia. He has over a decade of experience writing about technology and has been covering the blockchain and cryptocurrency space since 2010. He has also interviewed a few prominent experts within the cryptocurrency space.\n\nFor the first time since the Ethereum (ETH) Shanghai upgrade earlier this year, Ether’s price has closed above $2,000 following the recent Bitcoin (BTC) breakout towards $38,000. However, Ethereum’s price has encountered significant resistance at around $2,136, casting doubts on the sustainability of the uptrend. Despite this, crypto experts remain optimistic about the recent rally, anticipating further gains as some investors grow impatient.\n\nEthereum Whales Accelerate Profit-Taking:\n\nA recent on-chain analysis conducted by Lookonchain reveals that prominent Ethereum whales have been accelerating their profit-taking activities recently, potentially signaling an impending correction. Notably, one Ethereum whale transferred approximately 26.4k Ether, valued at roughly $54 million, to Bitfinex after being dormant for the past three years. Another Ethereum whale moved approximately 30k Ether, worth about $65 million, to Binance, resulting in a staggering loss of around $183 million.\n\nBullish or Bearish on $ETH?\n\n\n\nDid SmartMoneys and Whales buy or sell $ETH over the past week?\n\n\n\n1/🧵\n\n\n\nHere is a thread. pic.twitter.com/8yvCO0UI9H — Lookonchain (@lookonchain) November 14, 2023\n\nIn contrast, a savvy Ether whale deposited 25.7k Ether, equivalent to about $50 million, to Binance on November 09, securing a profit of approximately $1.5 million. Lookonchain’s analysis highlights that Ether whales who have refrained from taking profits face unrealized losses.\n\nRecently, the Ethereum network received a boost in credibility when BlackRock, a leading fund manager with over $9 trillion in assets under management (AUM), filed for a spot Ether ETF application. While the initial frenzy may have subsided, the filing by BlackRock could pave the way for more hedge fund managers to follow suit and compete in offering spot Ether ETFs. This development can potentially trigger further upside momentum in the near term.\n\nIn summary, Ethereum’s price surge past $2,000 has been notable, but resistance at $2,136 looms large. Ethereum whales taking profits may hint at a potential correction while filing a spot Ether ETF by BlackRock could bolster Ethereum’s position in the market. Crypto enthusiasts eagerly await further developments in this exciting and dynamic space."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy90ZXRoZXItaXNzdWVkLTRiLXVzZHQtb24tdHJvbi1hbmQtZXRoZXJldW0tbmV0d29ya3MtcmVwb3J0Lmh0bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Tether Issued 4B USDT on Tron and Ethereum Networks: Report - Cryptonews",
        "content": "Tether Issued 4B USDT on Tron and Ethereum Networks: Report\n\nMajor stablecoin issuer Tether has significantly increased its issuance of new USDT assets, reaching a total of $4 billion in the past month.\n\nWhale Alert, sharing this information on its Telegram channel, disclosed that Tether had minted an additional $1 billion worth of USDT on the Tron blockchain on November 10. This occurrence is a recent example of the stablecoin maker’s growing printing exercises.\n\nReacting to the report, Tether’s chief technology officer (CTO) Paolo Ardoino stated that the $1 billion USDT is an inventory replenishment on the Tron blockchain.\n\nArdoino explained that the stated amount is authorized but not issued, meaning that it would be used as an inventory for the next period of issuance requests and chain swaps.\n\nPSA: 1B USDt inventory replenish on Tron Network. Note this is an authorized but not issued transaction, meaning that this amount will be used as inventory for next period issuance requests and chain swaps. — Paolo Ardoino 🍐 (@paoloardoino) November 10, 2023\n\nPrior to this, Tether minted $1 billion of USDT on the Ethereum blockchain on November 9. This was complemented by a notable issuance of an additional $2 billion in fiat-backed stablecoins in two tranches on the Tron network on November 3 and October 19, as revealed by Whale Alert.\n\nThese figures push Tether’s minting spree to a total of $4 billion in USDT in the past month. However, this does not represent the final target for the blockchain-based platform in terms of minted USDT tokens for the year.\n\nAccording to data from Whale Alert, Tether is looking to print 22.75 billion USDT in 2023, with 13 billion (57%) to be issued on the Tron blockchain. The remaining 9.75 billion (43%) is expected to be added to the Ethereum blockchain.\n\nTo achieve this aim, Tether has been actively minting new tokens. In March 2023, the issuer printed 9 billion USDT tokens, adding to its already released 3 billion created in the past month.\n\nFollowing this, Tether further released 3.75 billion USDT tokens between June and July.\n\nBurning Alongside Minting\n\n\n\nFiat-backed stablecoins are usually pegged 1:1 with the fiat currency they are tracking.\n\nTo maintain this peg, many stablecoin issuers often hold cash or cash equivalents corresponding to the quantity of digital tokens in circulation.\n\nAn innovative approach gaining traction involves burning or permanently retiring a preset amount of tokens from open circulation.\n\nWhile buffering up its stablecoin portfolio, the USDT makers have also towed this unlikeliest of paths.\n\nAlthough burning often reduces the amount of an asset in circulation, thereby leading to an increase in value due to less supply relative to demand, it works differently in the case of the USDT stablecoin.\n\nIt only ensures that the value of the tokenized greenback does not fall below the $1 peg.\n\nFor instance, Tether burned 1.2 billion USDT tokens on the Tron blockchain on August 22.\n\nThis event was preceded by a similar activity in June that saw 3.1 billion USDT on the Tron protocol and 2 billion USDT on the Ethereum network permanently removed from circulation.\n\nWe're quite close to add another extremely powerful piece of the puzzle for @Tether_to ecosystem. Total of 5 mind-blowing projects (and counting) for 2024.\n\nCouple of these could obliterate some popular Web2 centralized services for good. Pure Real World Ecosystem aka \"Things… — Paolo Ardoino 🍐 (@paoloardoino) November 12, 2023\n\nMeanwhile, the stablecoin issuer is seemingly working on a new series of crypto-backed products scheduled for release in 2024.\n\nMaking this known, the platform’s CTO Paolo Ardoino stated that Tether is working on five new products that people could actually need."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vbGVhcm4uYnliaXQuY29tL2V4cGxhaW5lcnMvYmxhY2tyb2NrLWV0aGVyZXVtLXNwb3QtZXRmL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "BlackRock's Ethereum Spot ETF: What Does It Mean for Investors? - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vd3d3LmNvaW5zcGVha2VyLmNvbS9hcnRodXItaGF5ZXMtYml0Y29pbi0xLW1pbGxpb24v0gE_aHR0cHM6Ly93d3cuY29pbnNwZWFrZXIuY29tL2FydGh1ci1oYXllcy1iaXRjb2luLTEtbWlsbGlvbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Arthur Hayes Predicts Bitcoin to Reach $1 Million and Ethereum to Hit $100,000 - Coinspeaker",
        "content": "Last month, Hayes made a similar forecast, noting that Bitcoin could reach from $750,000 to $1 million towards the end of the current decade.\n\nAfter his visit to Rapa Nui, commonly known as Easter Island, Arthur Hayes, the co-founder and former CEO of leading crypto derivatives platform BitMEX, has once again predicted that Bitcoin (BTC) could reach $1 million, with Ethereum (ETH) soaring to $100,000.\n\nIn an unexpected turn, Hayes humorously hinted that the island’s ancestors might have provided him with a tip-off on the impending bull market that could lead to the explosion of the two crypto assets.\n\nArthur Hayes Bullish on Bitcoin\n\nDespite lacking any known roots in Rapa Nui, he suggested that, according to his ancestral guidance, the bull market is now, and the digital asset industry is about to take a different turn after the prolonged crypto winter.\n\nWhether Hayes genuinely believes in the soaring prospects of BTC and Ether or if he was playfully engaging with his followers on X, formerly Twitter remains unclear.\n\nThis summer I visited the ancestors in Rapa Nui and I asked them when the bull market would arrive? They told me to be patient, read the words of the Lord, and I would know when to YOLO. The time is now!$BTC = $1mm$ETH = $100k Yachtzee bitches!!! pic.twitter.com/ufV9nthSDg — Arthur Hayes (@CryptoHayes) November 10, 2023\n\nBefore now, the former BitMEX CEO predicted that the BTC soaring to $1 million is possible after the United States Federal Reserve decided to halt interest rate hikes and maintain the rate within the levels of 5.25% to 5.5%.\n\nLast month, Hayes made a similar forecast, noting that Bitcoin could reach from $750,000 to $1 million towards the end of the current decade, particularly in 2026.\n\n“I absolutely agree that there is going to be a major financial crisis, probably as bad or worse than the great depression, sometime near the end of the decade; before we get there, we’re gonna have, I think, the largest bull market in stocks, real estate, crypto, art, you name it, that we’ve ever seen since WW2.”\n\nIn a detailed blog post providing extensive insights into how the crypto asset could attain such ambitious heights, the former BitMEX CEO introduced a concept known as “The Doom Loop.” According to him, this intricate phenomenon represents three fundamental actions undertaken by countries globally to finance their deficits:\n\nSelling debt to domestic entities\n\nSelling debt to foreigners\n\nResorting to the central bank’s printing of money\n\nHayes believes this phenomenon will trigger the next bull market where the crypto asset could attain the predicted price.\n\nBTC Could Reach $43 000 This Year\n\nMeanwhile, with BTC currently hovering around $ 36,000 to $37,000 for the first time since 2022, veteran crypto trader and analyst Peter Brandt forecasted that the crypto asset could reach $43,200 this year.\n\nBrandt previously offered a long-term forecast for Bitcoin, suggesting that the crypto asset would enter an active growth phase no sooner than the third quarter of 2024, following the upcoming halving in April. He also emphasized that the crypto market has surpassed cyclical lows as experienced last year during the collapse of crypto exchange FTX in November, during which BTC plummeted to $15,000."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vdGVjaHBvaW50LmFmcmljYS8yMDIzLzExLzE0L3doYWxlcy1idWxsLW1hcmtldC1waWNrcy1kb2dlY29pbi1kb2dlLWV0aGVyZXVtLWV0aC1tZW1lLW1vZ3Vscy1tZ2xzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Whales' Bull Market Picks: Dogecoin (DOGE), Ethereum (ETH), Meme Moguls (MGLS) - Techpoint Africa",
        "content": "Discover the top picks of whales for the bull market, including Dogecoin, Ethereum, and Meme Moguls. Let's unpack why these digital coins, like Dogecoin and Ethereum, are catching fire in the market.\n\nWhales are strategically positioning themselves for maximum gains as the crypto market gears up for a bullish run. Among their top picks are the well-established Dogecoin (DOGE) and Ethereum (ETH), but a surprising newcomer to the scene, Meme Moguls (MGLS), is making waves. Let's delve into why these three cryptocurrencies are emerging as the top choices for whales in the current bull market.\n\nDogecoin (DOGE): BlackRock's Interest Sparks Speculation\n\nDogecoin (DOGE), the beloved meme-inspired cryptocurrency, is experiencing a surge in momentum. Recent speculation suggests that interest from investment giant BlackRock could further fuel its upward trajectory.\n\nAs prominent crypto analyst Lark Davis hinted, BlackRock's growing involvement in cryptocurrency ETFs may extend beyond Ethereum to encompass other digital assets, including the playful yet resilient Dogecoin. Regarding Dogecoin price movement, its value has surged from $0.071 on November 9th to $0.080 on November 11th.\n\nAs a result, experts in the crypto space have made a bullish Dogecoin price prediction. They forecast it to reach $0.091 within the fourth quarter of 2023. Therefore, it is no surprise why whales choose this token.\n\nEthereum (ETH): Bullish Trajectory Continues\n\nEthereum (ETH) is also gaining attention thanks to BlackRock. According to James Seyffart, a well-regarded analyst, BlackRock, one of the world's largest asset management firms, has entered Ethereum by submitting an ETF application to Nasdaq. This news has ignited anticipation and optimism among the Ethereum community and whales.\n\nSo, big-time companies like BlackRock jumping on the Ethereum bandwagon really seals its status in the mainstream. After that announcement hit, you could see a jump in Ethereum's price - it went from $1,913 to $2,058 in no time at all.\n\nForecasts are optimistic, with Ethereum price predictions from experts suggesting a surge to $2,316 before 2023 ends. This displays the positive trajectory for Ethereum as it continues to be a frontrunner for whales in the crypto space.\n\nMeme Moguls (MGLS): Redefining Meme-Based Investments\n\nIn a surprising turn of events, Meme Moguls (MGLS) has swiftly become a sought-after investment for whales looking to ride the meme coin wave. This presale star is in its Beta stage but has already made headlines with its unique platform. At its core, Meme Moguls will be the world's first meme-backed stock exchange.\n\nMoreover, Meme Moguls is upping the ante with an exciting play-to-earn feature, allowing you to earn rewards while fully engaged in gaming. It's all about leveling up your characters, creating bespoke items and selling them on the Moguls Marketplace - this could be your new way to a regular income stream.\n\nAt the heart of Meme Moguls lies a vibrant ecosystem powered by the MGLS utility token. MGLS tokens further enhance the gameplay, as they can be used to obtain lootbox keys, unlocking valuable meme assets and rare NFTs. Not only that, users can choose to stake these tokens to earn rewards.\n\nWith all these benefits, whales are beginning to stockpile this token, which currently costs only $0.0019. Analysts predict substantial growth of 100x for MGLS, making it a compelling choice for whales seeking high-return opportunities. Therefore, Meme Moguls may become the next Shiba Inu - only with more utility.\n\nVisit Meme Moguls"
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMiMWh0dHBzOi8vY29udGVudC5iaXRhenphLmNvbS9jcnlwdG8td2Vla2x5LTE0LW5vdi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Rallies on Prospect of ETF Opportunities for Institutional Investors - - Bitazza Content Hub",
        "content": "0 SHARES Share Tweet\n\nEthereum Rallies on Prospect of ETF Opportunities for Institutional Investors\n\nBlackRock has registered the iShares Ethereum Trust in Delaware, USA, leading to a significant increase in Ethereum’s price, which reached the $2,000 mark. This development has raised expectations for the launch of an Ethereum ETF, akin to those available for Bitcoin.\n\nIn a related development, BlackRock has argued with the U.S. Securities and Exchange Commission (SEC) over the treatment of ETFs that invest in spot crypto markets versus those in futures markets. BlackRock contends that differing approaches to these could result in legal complications.\n\nMatrixport’s analysis indicates that Ethereum’s blockchain fee revenue has surpassed its lowest point. Gas fees have consistently stayed above $30 million for two weeks, a significant increase from the annual low of $12 million in early October. This suggests that Ethereum is moving out of a period of low activity.\n\nThe CEO of Hong Kong’s Securities and Futures Commission is considering allowing retail investors to directly invest in digital asset ETFs like Bitcoin. Currently, Hong Kong has registered three funds based on Bitcoin and Ethereum futures.\n\nThe U.S. SEC has reopened negotiations with Grayscale Investments about converting the GBTC fund into a spot Bitcoin ETF. This comes after a federal court ruling required the SEC to reconsider Grayscale’s application for a Spot Bitcoin ETF.\n\nAnalysts from Bloomberg Intelligence believe there is over a 90% chance that a Bitcoin ETF will be approved by January 10, 2024. This is due to the time required to review applications from all 14 applicants, likely leading to simultaneous approval.\n\nCrypto market analyst Lark Davis views Chainlink and Solana as potential next points of interest for institutional investors following Bitcoin and Ethereum. He suggests that these coins could also have ETFs in the future, providing institutional investors with more investment options.\n\nWeekly Technical Analysis: 14 – 20 November 2023\n\nBitcoin (BTC)\n\nBTC has reached the resistance level of $38,000 and is currently moving sideways without a clear direction. It’s important to keep an eye on a potential correction as a Bearish Divergence is starting to form in the RSI. The first support level is estimated at $34,000, while the resistance level has been raised to $40,000. If this is breached, the next target is $42,000.\n\nEthereum (ETH)\n\nETH has shown a strong uptrend following news of an upcoming ETF. The momentum looks positive. The support level is at $1,900, which could be a good entry point if the price retracts. The first resistance level is at $2,200.\n\nBancor Network (BNT)\n\nBNT has increased by 96.8% over the past week. However, the rapid price surge could lead to significant selling pressure. The key support level to watch is 32.50 THB.\n\nTerra (LUNA)\n\nLUNA has risen by 69.9% in the past week. However, traders should exercise caution as this increase is linked to speculative trading amid news of FTX resuming services.\n\nTrading and Investment Considerations For The Week\n\nEven though Bitcoin’s price has started to stabilize, Altcoins in the DeFi, GameFi, and Blockchain Layer 1 and 2 categories continue to see ongoing speculative trading. This is viewed as an opportunity for short-term investment.\n\nIt is expected that the market will remain lively until the end of the year or until a Bitcoin ETF is officially approved, which may lead to a ‘Sell On Fact’ situation. Ethereum is seen as a promising alternative, especially after the news of the ETF setup, and it still lags 50% behind BTC in price this year.\n\nThe U.S. stock market, particularly the Nasdaq, continues to rise, positively impacting the digital asset market due to their close correlation. These markets have shown resilience against the strengthening U.S. dollar and the rising yields of U.S. government bonds.\n\nOn Tuesday, November 14, the U.S. CPI Index figures will be announced. The market expects it to be around 3.3%, down from 3.7% the previous month. A decrease in inflation would be positive for the market as it would reduce pressure on the U.S. Federal Reserve to hike interest rates, despite recent indications that another rate increase is possible.\n\n0 SHARES Share Tweet\n\nMore from Crypto Weekly"
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LmNpdHlhbS5jb20vYml0Y29pbi1hbmQtZXRoZXJldW0tc3VkZGVubHktdHJhZGluZy1pbi1kaWZmZXJlbnQtZGlyZWN0aW9ucy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin and Ethereum suddenly trading in different directions - CityAM - City A.M.",
        "content": "Bitcoin and Ethereum suddenly trading in different directions\n\nBitcoin is trading in the negative today, down by one per cent over 24 hours, while Ethereum seems to be going the other way and still trading above the key $2,000 level.\n\nAmong the third-gen cryptocurrencies, Polygon continues to rally with 5% gains overnight while others such as Solana pull back. The cryptocurrency known for its speedy throughput is in the red by more than 5%.\n\nXRP saw a 10% surge in price yesterday, following on the heels of a now debunked rumour that BlackRock is also planning to launch an XRP ETF. The price of XRP quickly corrected after the asset manager quashed the rumours.\n\nYesterday’s Crypto AM Daily\n\nIn the Markets\n\nThe Bitcoin Economy\n\n*Data can be found at https://terminal.bytetree.com/\n\nTotal crypto market cap\n\n🔵 $1.4 trillion\n\n🔻 0.69%\n\nWhat Bitcoin did yesterday\n\n🔺 Daily high $37,404\n\n🔻 Daily low $36,358\n\nBitcoin market capitalisation\n\n🟠 BTC $718.23 billion\n\n🟡 Gold $12.856 trillion\n\n💳 Visa $506.18 billion\n\nBitcoin volume\n\nTotal spot trading volume $18.38 billion\n\n🔺 39.26%\n\nEthereum staking entry queue\n\n0 minutes\n\nSP500\n\n🔻 0.084%\n\nFTSE/JSE Top 40\n\n🔺0.76%\n\nFear and Greed Index\n\nBitcoin’s market dominance\n\n52.19\n\nRelative Strength Index (RSI)\n\n70\n\nValues of 70 or above indicate that an asset is becoming overbought and may be primed for a trend reversal or experience a correction in price, while 30 or below indicates an oversold or undervalued condition.\n\n📣 What they said yesterday\n\nThis week's big data report is the October CPI\n\n\n\nWall Street forecasters expect the core index rose 0.34% from September, raising the 12-month rate to 4.2% from 4.1%\n\n\n\nThey see the headline index up 0.1% from September, lowering the 12-month rate to 3.3% from 3.7% pic.twitter.com/wADwEXGOTn — Nick Timiraos (@NickTimiraos) November 13, 2023\n\nCrypto AM: Editor’s picks\n\nKraken appoints crypto entrepreneur and fintech consultant Bivu Das to drive next chapter of UK growth story\n\nTransformBase initiative set for launch in November\n\nFCA’s new crypto advertising rules met with mixed industry response\n\nChatGPT urges crypto conference panel not to become over-reliant on AI\n\nSam Bankman-Fried: A tissue of lies soaked with fake tears?\n\nThree-in-four wealth managers are gearing up for more cryptocurrency exposure\n\nCrypto.com granted FCA licence to operate in UK\n\nQ&A with Duncan Coutts, Principal Technical Architect at IO Global\n\nJamie Bartlett – on the trail of the missing ‘Cryptoqueen’\n\nMPs are falling silent over potential of cryptocurrency\n\nCrypto AM: Features\n\nCrypto AM: Founders Series\n\nCrypto AM: Industry Voices\n\nCrypto AM: Contributors\n\nCrypto AM: In Conversation with James Bowater\n\nCrypto AM: Tomorrow’s Money with Gavin S Brown\n\nCrypto AM: Mixing in the Metaverse with Dr Chris Kacher\n\nCrypto AM: Visions of the Future, Past & Present with Alex Lightman\n\nCrypto AM: Tiptoe through the Crypto with Monty Munford\n\nCrypto AM: Taking a Byte out of Digital Assets with Jonny Fry\n\nCrypto on the catwalk\n\nCautionary Notes\n\nIt’s definitely tempting to get swept up in the excitement, but please heed these words of caution: Do your own research, only invest what you can afford, and make good decisions. The indicators contained in this article will hopefully help in this. Remember though, the content of this article is for information purposes only and is not investment advice or any form of recommendation or invitation. City AM, Crypto AM and Luno always advise you to obtain your own independent financial advice before investing or trading in cryptocurrency."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiNGh0dHBzOi8vdGVjaHJlcG9ydC5jb20vY3J5cHRvY3VycmVuY3kvYmVzdC1hbHRjb2lucy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "16 Best Altcoins to Buy In February 2024 - The Tech Report",
        "content": "16 Best Altcoins to Buy in 2024 for Massive Gains\n\nIn our content, we occasionally include affiliate links. Should you click on these links, we may earn a commission, though this incurs no additional cost to you. Your use of this website signifies your acceptance of our terms and conditions as well as our privacy policy.\n\nDon’t invest unless you’re prepared to lose all the money you invest. This is a high-risk investment and you should not expect to be protected if something goes wrong.\n\nAltcoins offer a great alternative to Bitcoin, especially those with a lower market capitalization – after all, Bitcoin is already valued at several hundred billion dollars, so there is a greater upside with altcoins.\n\nIn this guide, we analyze the 16 best altcoins to buy in 2024, looking at some of the best new altcoins to buy – such as presale projects like Bitcoin ETF Token, Wall Street Memes, Thug Life, and yPredict, which offer high upside potential – and the most popular altcoins like Ethereum and Dogecoin, which have grown to be some of the biggest altcoins on the market.\n\nRead on to discover new altcoins that have the potential to explode.\n\nThe Best Altcoins to Invest in 2024 Listed below are the 16 best altcoins to invest in 2023: Bitcoin ETF Token – An innovative ERC20 token offering dynamic token burns and high staking rewards, closely tied to the U.S. SEC’s potential approval of a Bitcoin spot ETF. The platform raised nearly $500K in under a week of launch, showing strong community support. Wall Street Memes – $WSM is a trendy meme coin from the Wall St Bulls NFT creators that has raised over $12.8 million USDT in a month. Even Elon Musk has interacted with WSM’s Twitter post, highlighting its viral traction. Thug Life – Hot new community-centric meme altcoin currently on presale that offers 70% of the total supply at a fixed price. With over $490K raised in a week and a hard cap of $2.058 million, the coin showed strong community support. It also reserves 15% of the supply for community rewards. yPredict – This new cryptocurrency project is also in presale, having raised $1.2 million so far. yPredict is building a decentralized marketplace for predictive models. Designed by data scientists and quants, yPredict models enable traders to make smart and informed decisions. Its native altcoin, YPRED, is currently being sold at a 70% discount, compared to its exchange listing price. Ecoterra – This is an up-and-coming altcoin project building a greener future. Through a recycle-to-earn infrastructure, ecoterra rewards users for recycling unwanted goods. It is also building a carbon-offsetting ecosystem alongside a recycled raw materials marketplace. ECOTERRA tokens, native to the project, are currently in presale. $4 million has already been raised, and generous discounts are still available. Chimpzee – New crypto project that integrates eco-conservation and blockchain. It offers a strong incentivization model and is currently on presale, which has raised over $725k relatively quickly. The unique Diamond NFT passport and AI-driven app offer users additional benefits and income opportunities, such as high APY. Launchpad XYZ – This innovative altcoin project is developing an all-in-one ecosystem for Web3 investments. Those staking its native token, LPX, will have access to premium features. This includes access to exclusive NFT launches and private presales, not to mention unreleased P2E games and fractionalized assets. LPX tokens are currently being sold via the Launchpad XYZ presale. AiDoge – AiDoge is a new altcoin project that is currently in presale. Its proprietary tool combines artificial intelligence and blockchain technology to create memes. Users simply need to type in what meme they want, and AiDoge will generate one instantly. AI tokens, the native altcoin backing AiDoge, are required to create memes. More than $9 million has been raised in the AiDoge presale, making this one of the best altcoins to buy for future growth. Scorpion Casino – Crypto-powered online gaming and sports betting platform that has raised over $450K in its ongoing $SCORP token presale. With a wide range of games, a user-rewarding affiliate system, and a tokenized economy promising passive income of up to $10,000 USDT daily, Scorpion Casino aims to redefine the online gambling landscape. eTukTuk – Offers a sustainable transportation solution through its electric TukTuks, aiming to reduce carbon emissions and increase drivers’ earnings by 400%. Currently in the whitelisting phase, its native token, $TUK, offers staking rewards for supporting its network. DeeLance – This project is building a blockchain-based marketplace to connect freelancers with recruiters. DeeLance improves on the current freelancing landscape with fast payments and low fees. It is also building a metaverse, enabling users to buy land and build virtual offices. All transactions in the DeeLance ecosystem are conducted in DLANCE. This is also a presale altcoin offering discounts to early investors. Ethereum – This is the largest altcoin by market capitalization. Ethereum enables developers to execute decentralized smart contracts. Thousands of projects, known as ERC-20 tokens, operate on the Ethereum blockchain. This gives the project’s native altcoin, ETH, unprecedented demand. Ripple (XRP) – This established altcoin project enables banks and financial institutions to conduct cross-border transactions. Compared to legacy networks like SWIFT, Ripple is significantly faster and cheaper. Its native token, XRP, remains one of the most popular altcoins to buy. Arbitrum – This innovative project has developed a layer 2 solution for the Ethereum blockchain. This means Ethereum-based transactions are cheaper, faster, and more scalable. Crucially, Arbitrum not only benefits Ethereum but the many thousands of ERC-20 tokens in the market. Dogecoin – While Dogecoin transactions are faster and cheaper than Bitcoin, it is primarily a meme coin investment. Currently, Dogecoin is trading at a bear market discount of over 90%. This may appeal to investors that believe Dogecoin will return to its former all-time high of $0.74 during the next bull run. Uniswap – This project was launched in 2020 and offers decentralized trading services. Uniswap uses an automated market maker protocol, enabling users to swap tokens without a third party. Uniswap, backed by the UNI token, also supports decentralized finance products, including lending and borrowing.\n\nDo remember that the altcoins listed above are the subjective viewpoints of the author. Readers should do their own homework before risking any money.\n\nThe Best Altcoins List in 2024\n\nIn this section, we take a much closer look at the best altcoins to buy for 2024. We explore each altcoin in great detail, including its use cases, long-term potential, and risks.\n\n1. Bitcoin ETF Token – Overall Best Altcoin With High Passive Income Potential, Raised Nearly $500K In A Week\n\nThe Bitcoin ETF Token is a promising new ERC20 token that offers a unique, rewarding opportunity tied closely to the developments surrounding the approval of a Bitcoin spot ETF by the U.S. Securities and Exchange Commission (SEC). This project stands out due to its dynamic tokenomics, including token burn mechanisms and high staking rewards.\n\nThe Bitcoin ETF Token introduces a token burn strategy linked to significant milestones in the Bitcoin ETF journey. Up to 25% of the total token supply, which amounts to 525 million tokens, will be permanently removed from circulation upon achieving certain key events.\n\nThese events include significant trading volume milestones for the token, the approval and launch of the first Bitcoin ETF, the total assets under management for all Bitcoin ETFs reaching $1 billion, and Bitcoin’s price exceeding $100,000.\n\nThe platform’s recently launched presale is structured across 10 stages, offering 84 million tokens in each stage. The pricing of these tokens will rise progressively from $0.005 in the first stage to $0.0068 in the final presale stage.\n\nCurrently, buyers can grab the $BTCETF tokens for $0.0052 per token. Nearly $500,000 has already been raised in under a week, showing strong community support.\n\nMoreover, early participants in the presale can benefit from an exceptionally high APY of over 500% for staking their tokens.\n\nThis lucrative offer, primarily available in the early stages of the presale, is designed to improve the appeal of holding onto the tokens while awaiting the Bitcoin ETF’s approval.\n\nIt’s important to note that the APY is expected to decrease as more tokens are staked, suggesting a strategic advantage for early stakers.\n\nInvestors can buy $BTCETF tokens using Ethereum (ETH), Tether (USDT), or a credit card through an Ethereum-based wallet like MetaMask.\n\nThe total token supply is capped at 2.1 billion, with 840 million allocated for the presale and an additional 525 million reserved for staking rewards.\n\nFor those interested in staying updated on the latest developments around the Bitcoin ETF Token and the broader context of the Bitcoin spot ETF approval, following their updates on various platforms like X (Twitter) and joining the platform’s Telegram channel is advisable.\n\nHard Cap $4.956 Million Total Tokens 2.1 Billion Tokens available in presale 840 Million Blockchain Ethereum Network Token type ERC-20 Minimum Purchase NA Purchase with USDT, ETH, BNB, MATIC, Card\n\n2. Wall Street Memes – Altcoin With Strong Community Backing of Over a Million Followers, Raised Over $12.8 Million In a Month\n\nThe recent meme crypto bull run mirrors the remarkable rise of GameStop and AMC stocks back in 2021, creating a new wave of affordable meme tokens.\n\nEthereum NFT creator Wall St Bulls, known for its strong following, has tapped into this trend with the debut of its Wall Street Memes token ($WSM).\n\nBuilding on their successful 2021 Ethereum NFT collection, which sold out within half an hour, Wall St Bulls has ventured into Bitcoin NFTs and meme tokens, aligning with the latest trends.\n\nTheir strong follower base of over a million people lays a strong foundation for the $WSM token.\n\nInvestors should remember that meme tokens, while having a high return potential, also carry significant risks. But tokens with strong community support often see long-term success.\n\nFrom its $30 million hard cap, the project raised over $12.8 million in just a month, showing strong investor enthusiasm.\n\nStrong community backing safeguards against ‘pump and dump’ trends typically associated with meme tokens. Wall Street Memes’ community backing could grab the attention of big crypto exchanges like Binance.\n\nMoreover, notable figures like Elon Musk have also shown interest, interacting with WSM’s Twitter posts.\n\nAs per the Wall Street Memes whitepaper, the $WSM presale offers investors 50% of its two-billion token pool. The rest are reserved for community rewards (30%) and exchange liquidity (20%).\n\nThis strategy eliminates potential market dumping from team tokens, a concern observed in other cryptos. Additionally, $50k has been allocated for an airdrop to reward active community members on their social media platforms.\n\nJoin the Wall Street Memes Telegram channel to stay updated with the presale progress.\n\nVisit Wall Street Memes\n\n3. Thug Life – Hot New Meme Crypto with 15% Supply Reserved For Community Rewards, Raised Over $490K in a Week\n\nThug Life ($THUG) is a community-focused meme altcoin that offers a chance for those who missed the earlier meme coin boom.\n\nThug Life’s presale uses a one-round model where 70% of the total 4.2 billion $THUG supply (around 2.94 billion tokens) is available at a fixed rate of $0.0007 USDT.\n\nThis setup offers an equal opportunity for all investors to buy tokens, discouraging any dumping by early investors. The ongoing presale seeks to hit a target of $2.058 million.\n\nThe community-centric strategy of Thug Life is showing promise, as $THUG raised over $490K in a week of its launch.\n\nWhile its website indicates that $THUG doesn’t offer immediate utility, its main aim is to build a strong community. This approach has helped coins like Pepe fetch returns that surpassed even Bitcoin and Ethereum this year.\n\nOnce the presale ends, $THUG will be available on decentralized exchanges (DEXs). Also, after listing, 15% of the token supply will be set aside for airdrops and giveaways to community members. This incentive aims to create community growth and loyalty among $THUG owners.\n\nTo ensure price stability and medium-term growth, Thug Life intends to lock the liquidity pool for three months post-launch. To lower scam risks, the Thug Life team has set aside no tokens for themselves, further reinforcing trust among investors.\n\nTo stay informed about $THUG, you can join the Thug Life Telegram channel.\n\nVisit Thug Life\n\n4. yPredict – Decentralized Marketplace for Buying and Selling AI Predictive Models\n\nyPredict (YPRED) is also one of the best new altcoins to buy at presale prices with the project developing a decentralized marketplace for predictive models.\n\nThese are high-level data sets backed by artificial intelligence and machine learning. Built by data scientists and quants, yPredict models enable traders to make smart investment decisions.\n\nFor example, there are predictive models that can automate the technical analysis process. Put simply, the model will alert users when an indicator flags a reading, such as overbought conditions or increased volatility. This enables traders to streamline the analysis process.\n\nIn another example, yPredict also offers predictive models that yield altcoin trading signals. For example, the signal might suggest short-selling ETH/USD at an entry price of $1,900. The yPredict signal will also provide the suggested limit, stop-loss, and take-profit order prices.\n\nIn order to access yPredict models, users will need to subscribe via a three-tired monthly fee set by the model creator and payable in YPRED tokens. This ensures that YPRED has real-world utility.\n\nWhat’s more, YPRED can also be used for staking, which yields a share of the revenue generated from prediction model subscriptions.\n\nOn the flip side, do remember that yPredict will only be as successful as the predictive models it sells. If there isn’t enough demand for its models, this will have a negative impact on the value of YPRED. To counter this risk, all yPredict models must go through a vetting process. Put simply, the yPredict DAO will test each model before it is listed on the marketplace.\n\nThose looking to buy yPredict tokens can do so via the presale. Having raised $1.2 million so far, the presale is quickly gaining traction. Currently, YPRED tokens are available to buy at just $0.07. This will soon increase by 28% to $0.09. After the presale, YPRED will be listed on an exchange at $0.12. That’s a 70% upside for current presale investors.\n\n5. Ecoterra – Green Altcoin Project Developing a Recycle-to-Earn Network\n\nEcoterra (ECOTERRA) is one of the best altcoins to invest in for exposure to green innovation. Its ecosystem, built on the Ethereum blockchain, offers various features to help the world become a more sustainable place and has developed a recycle-to-earn concept that incentivizes people to recycle.\n\nWhether it’s glass, plastics, or clothing – users will receive ECOTERRA tokens when recycling consumed or unwanted items. Users will first need to open the ecoterra mobile app to find their nearest reverse vending machine (RVM). Then, the user will scan the recycled items via the app before depositing them in the RVM.\n\nThe Ecoterra app will then credit the user’s wallet with ECOTERRA tokens. The long-term aim is to have RVMs installed globally, ensuring that ecoterra users can recycle with ease.\n\nNot only will this secure the lowest price possible but when paying with ECOTERRA tokens, discounts are available. Ecoterra will also enable users to offset their carbon footprint, achieved by using ECOTERRA tokens to purchase tokenized carbon credits that are then removed from circulation.\n\nAs well as being sold on exchanges, ECOTERRA can be used to fund other green activities such as ocean clean up or tree planting.\n\nEcoterra is also building a marketplace for businesses – this will provide access to a global database of recycled raw materials at discounted prices.\n\nECOTERRA tokens are currently available to buy via the Ecoterra presale. Rated as one of our best crypto presales, it has already raised $4 million, and early investors will secure a discounted price.\n\nCurrently, ECOTERRA can be purchased at $0.00775 per token but the exchange listing price after the presale will be $0.01 – 30% above the current price.\n\n6. Chimpzee – Green Crypto With High Staking Rewards of Up To 20%, Raised Over $725K\n\nChimpzee is a new crypto project that merges eco-friendly actions with digital incentives. It uses the CHMPZ token to promote environmental progress and widens the usual blockchain applications.\n\n10% of Chimpzee tokens and a portion of profits go toward green initiatives. Chimpzee also partners with eco-friendly groups, showing its commitment to eco-friendly change.\n\nThe CHMPZ presale is an attractive entry point for investors, with over $725k raised already, hinting at strong community support.\n\nThe platform’s key features, like Play-to-Earn, Shop-to-Earn, and Trade-to-Earn, encourage users to earn while supporting the environment.\n\nThe platform’s Zero Tolerance Game forms the Play-to-Earn aspect. Players can earn CHMPZ tokens by reaching game milestones, making gameplay even more rewarding.\n\nChimpzee’s shop offers a Shop-to-Earn model, where selling branded items earns users CHMPZ tokens and some of the profits go to green causes.\n\nThe Chimpzee whitepaper highlights that it also hosts an NFT marketplace using a Trade-to-Earn model, sharing trading fee profits with its users.\n\nThe Chimpzee Diamond NFT passport, available only during the first six presale stages, offers special benefits. These include a 20% staking APY and access to an AI-powered mobile app, helping users to increase their CHMPZ holdings.\n\nThe AI-based mobile app creates unique avatars for the NFT passport, which can be used in a play-to-earn game to support the environment and boost passive income.\n\nThus far, Chimpzee has funded the planting of 20,000 trees and donated $15K to elephant protection via the WILD Foundation. For updates on the project’s progress, follow the Chimpzee Telegram channel.\n\nVisit Chimpzee\n\n7. Launchpad XYZ – All-in-One Gateway to the Web 3.0 Investment Industry\n\nLaunchpad XYZ (LPX) is one of the best altcoin platforms to buy for exposure to the Web3 investment space. Aimed at casual investors with limited Web3 experience, Launchpad XYZ supports a wealth of features. This includes a decentralized exchange (DEX) that supports cryptocurrencies, NFTs, and fractionalized assets.\n\nThe latter refers to large stores of value that are tokenized into smaller units, such as real estate. Launchpad XYZ will also provide access to pre-released play-to-earn (P2E) games. This gives Launchpad XYZ users an edge, as they can evaluate the potential of the P2E gaming token before it launches to the public.\n\nAnother feature is access to private round presales. These are exclusive presale campaigns only available to whitelisted investors.\n\nLaunchpad XYZ will secure an allocation of tokens and offer them to its users. We also found that Launchpad XYZ provides unparalleled insights and data for crypto investors. This includes a risk-reward scoring system across hundreds of tokens, enabling investors to make smart decisions.\n\nThe Launchpad XYZ ecosystem is backed by its native LPX tokensm which are currently in presale – LPX provides access to premium features and those staking LPX can access private presales, pre-release P2E games, and discounted trading fees.\n\nThose staking LPX can also access private NFT launches and fractionalized assets. Almost $500,000 worth of LPX tokens have already been sold in the presale.\n\nCurrently, investors can buy Launchpad XYZ tokens at $0.0445. After the presale, LPX will be listed on the Launchpad XYZ DEX at $0.0565, an increase of 26% from the current presale price.\n\n8. AiDoge – Merging The Power of AI To Help Create Engaging Memes\n\nAiDoge is a presale project, meaning that investors can buy $AI tokens before it lists on a crypto exchange, which is beneficial for investors, considering that the AiDoge presale offers discounted prices. However, as a new altcoin project, investors will need to consider the added risk.\n\nIn a nutshell, AiDoge is developing a tool that can create memes from text prompts – the tool is proprietary to the project and is backed by blockchain technology and artificial intelligence. In order to create memes, users need to buy credits. AiDoge only accepts $AI tokens as a payment method, meaning its altcoin has actual utility.\n\nOnce credits have been obtained, users can type in the meme that they want to create. AiDoge will then create a unique meme with an image, which is owned 100% by the user, with ownership secured on the blockchain, as AiDoge memes are backed by NFTs. What’s more, users can share their memes at the click of a button.\n\nShould a meme go viral on social media, the owner might consider selling it via an NFT marketplace. Another way to earn on AiDoge is by staking AI tokens. This yields free credits, enabling users to create more memes.\n\nAiDoge is also building a public wall that showcases the most popular memes, based on a voting structure via the blockchain, with users able to upvote and downvote the memes and the most popular creations earning $AI tokens as a reward.\n\nWe should note that the AiDoge team has decided to remain anonymous. While this might concern some investors, do remember that some of the most successful cryptocurrencies have anonymous founders. This includes Bitcoin and Shiba Inu. Moreover, AiDoge is a brand-new project that is yet to establish itself. As such, nobody can predict whether the project will succeed.\n\nNonetheless, this also means that AI tokens will have a small market capitalization once listed on a crypto exchange. This offers an attractive upside potential for high-risk, high-return investors. In the meantime, investors can buy AI tokens at a discount via the presale.\n\nHaving already raised over $9 million in just three weeks, the AiDoge presale is already trending in the crypto community and is rated as our best crypto ICO.\n\nCurrently, AI tokens are available to buy at $0.0000304. But this price increases incrementally as each batch of AI tokens is sold. This enables early investors to secure an upside before the tokens are listed on exchanges.\n\n9. Scorpion Casino – Merging Blockchain with Online Gaming, Raised over $450K\n\nScorpion Casino combines online gaming, sports betting, and casino fun on a blockchain-backed platform.\n\nUsers can play 360+ games, enjoy live sports events, and benefit from in-built fair-play measures, ensuring a trustworthy gaming environment.\n\nThe SCORP token, currently available in presale for $0.014 USDT, is central to this platform, which aims to provide passive income and boost engagement. With the listing price set at $0.05 USDT, early buyers can capitalize on the upside potential.\n\nSo far, the presale has gathered over $450K, showing substantial market interest in the platform.\n\nThe Scorpion Casino ecosystem includes three main elements: the gaming platform, an affiliate rewards system, and the $SCORP token.\n\nScorpion Casino is licensed by Curacao EGaming-licensed and offers many games & betting options. The affiliate system promotes user involvement through rewards, while the SCORP token ensures governance and additional benefits for users.\n\nWith a total supply of 1 billion, the SCORP token is the primary payment method on the platform. Token owners can anticipate regular bonuses, free games, and a share of transaction taxes, boosting their holdings as platform usage grows.\n\nFor fairness and more engagement, a significant portion of tokens is set aside for presale and affiliate rewards.\n\nScorpion Casino plans to develop partnerships, host live affiliate events, and launch marketing campaigns on its roadmap.\n\nThe end-year focus is scaling the platform for substantial growth, reinforcing its mission to revolutionize online gaming and sports betting with a fair, rewarding, and engaging user experience.\n\nYou can enter the Scorpion Casino Telegram Channel to get the latest updates.\n\nVisit Scorpion Casino\n\n10. eTukTuk – Green Crypto Project Offering Affordable EVs That Can Boost Driver Earnings by 4x\n\nLaunching as a unique green crypto, eTukTuk, seeks to revolutionize transportation, targeting lower carbon emissions and financial exclusion. The project focuses on shifting traditional TukTuks to a sustainable model using electric power.\n\nThis innovative approach combines economic advantages with environmental preservation to lessen carbon emissions and provide an affordable solution to TukTuk drivers in Sri Lanka.\n\nIt is preparing to launch its native token, $TUK, currently in the whitelisting phase of its presale.\n\nBacked by The Capital Maharaja Group, a significant Sri Lankan conglomerate, eTukTuk aims to make EVs (Electric Vehicles) and charging stations accessible and affordable to everyday TukTuk operators.\n\nAs per the eTukTuk whitepaper, the project plans to establish Electric vehicle supply equipment across Sri Lanka and similar developing countries. This approach aims to decrease dependence on non-renewable energy.\n\nTo increase drivers’ earnings by up to 400%, eTukTuk focuses on safe, cost-effective EVs that require less maintenance.\n\neTukTuk uses digital identities to tackle financial inequality, making financial services more accessible. Its ‘Territory Partners’ idea lets network participants share in its growth and earn rewards.\n\nAdditionally, holding $TUK tokens allows users to participate in power staking. By staking these tokens, users support the nodes that maintain the EVs and could achieve a high annual return (APY).\n\nEmphasizing the role of blockchain in driving substantial change, eTukTuk seeks to set a standard for the green transport revolution in developing economies.\n\nTo stay updated with the platform’s progress, users can join the eTukTuk Telegram group.\n\nVisit eTukTuk\n\n11. DeeLance – Smart Contract-Based Ecosystem for Freelancers\n\nWhen exploring what altcoin to buy, DeeLance (DLANCE) is also worth considering. This is one of the best new altcoins that is revolutionizing the global freelancing market. According to some estimates, this market could be worth over $1.3 trillion by 2025. But currently, the freelancing space faces several issues surrounding fees, payments, and transparency.\n\nFor example, both clients and freelancers are charged high fees on platforms like Upwork and Fiverr. DeeLance is considerably more cost-effective, with clients paying just 2% and freelancers charged 10%.\n\nWhat’s more, DeeLance solves the issue of slow and costly payments – this ensures that payments are released as soon as the freelancer completes the work and, as an ERC-20 token, DLANCE payments take just seconds.\n\nMoreover, freelancers are protected by the DeeLance escrow system. This is because clients pay for the work upfront, with the DLANCE tokens locked in a transparent smart contract.\n\nDeeLance is also building a metaverse that connects freelancers with recruiters. The DeeLance metaverse will support land ownership, enabling users to build and work in virtual offices.\n\nThat said, investors should remember that DeeLance is a brand-new project that will compete with established freelancing platforms.\n\nWhile its blockchain-based ecosystem offers many benefits to both freelancers and recruiters, there is no guarantee it will become a major player in this space.\n\nNonetheless, DeeLance is currently selling DLANCE tokens via a presale. The current price is just $0.038 per DLANCE. This will increase by 50% to $0.057 when DLANCE is listed on an exchange, making it one of the best cryptos to buy now.\n\n12. Ethereum – Largest Altcoin by Market Capitalization Serving Thousands of ERC-20 Tokens\n\nEthereum (ETH) is the biggest altcoin on the market by market cap. Launched in 2015, Ethereum enables developers to create and execute smart contract agreements. In turn, this allows decentralized ecosystems to operate autonomously. Ethereum’s smart contract framework is now used by thousands of other altcoins, known as ERC-20 tokens.\n\nSome of the largest decentralized exchanges are built on Ethereum, making it one of the top altcoin platforms for other projects. This includes Uniswap, SushiSwap, and Yearn.finance – one of the most expensive altcoins in the market.\n\nCrucially, ERC-20 token ecosystems pay GAS fees in ETH. This means that the demand for ETH increases as more projects are built on its network.\n\nAlthough ETH currently has a market capitalization of over $200 billion, there is still plenty of upside available and many projects continue to see ETH as the go-to destination to build decentralized apps (dApps). Sshould ETH return to its former all-time high of almost $5,000, this would yield an upside of over 170% from current prices.\n\nCryptoassets are a highly volatile unregulated investment product.\n\n13. Ripple (XRP) – Fast, Cheap, and Scalable Cross-Border Transactions for Banks and Financial Institutions\n\nRipple (XRP) was launched in 2012, making it one of the oldest and most popular altcoins in the market. The project has built a blockchain-based network that supports cross-border transactions. Its innovative technology is already being used or trialed by hundreds of banks and financial institutions. This is because Ripple transactions are a lot more efficient when compared to legacy networks.\n\nFor example, suppose a manufacturer in Kenya wants to transfer funds to a supplier in Brazil. This cross-currency transaction would not only take several days to process but will attract unfavorable fees. This is especially the case considering that correspondent banks would be required to execute the transaction.\n\nIn contrast, the same transaction on the Ripple network would take under five seconds at a cost of just 0.00001 XRP. Based on current XRP prices, this amounts to just $0.0000045. XRP enables investors to gain exposure to Ripple’s cross-border network.\n\nCurrently, XRP is trading at under $0.50. Should it return to its former high of $3.84, that’s an upside of over 660%. Much of its future potential is also reliant on an ongoing court case against the SEC, with a win expected to send the price skyrocketing.\n\nCryptoassets are a highly volatile unregulated investment product.\n\n14. Arbitrum – Layer 2 Solution for More Scalable and Cost-Effective ERC-20 Token Transactions\n\nArbitrum (ARB) is one of the best altcoins to buy for long-term potential. This is a layer 2 solution for the Ethereum ecosystem. Put simply, ERC-20 tokens can bridge to Arbitrum to benefit from more efficient transactions. This is especially the case in terms of scalability. Currently, Ethereum can process 29-30 transactions per second.\n\nIn comparison, Arbitrum can handle up to 40,000 per transaction. Arbitrum is also significantly more cost-effective than Ethereum. For example, ERC-20 GAS fees currently average $4.64. But this often surpasses $10 when the network is busy. Arbitrum transactions currently average just $0.0077.\n\nThe efficiencies of Arbitrum will appeal to ERC-20 projects requiring a high transaction output. This includes decentralized finance platforms and exchanges, as well as NFT marketplaces. Over 220 ERC-20 tokens have already bridged to Arbitrum. To gain exposure to this project, investors can buy ARB tokens.\n\nCryptoassets are a highly volatile unregulated investment product.\n\n15. Dogecoin – Popular Altcoin Coin Currently Trading at a Huge Discount\n\nDogecoin (DOGE) is one of the best meme coins in the market, with a current valuation of over $10 billion. It has several million token holders, making Dogecoin one of the most popular cryptocurrencies globally. It is also one of the most established altcoins, with Dogecoin first entering the market in 2013.\n\nDogecoin claims to be the ideal cryptocurrency for global payments. Its network processes transactions faster and cheaper than Bitcoin. Dogecoin is also more scalable. That said, Dogecoin is still considered a speculative meme coin with limited utility. Moreover, there are more efficient alternatives to Dogecoin, including Solana, Cardano, and Arbitrum.\n\nNonetheless, Dogecoin is one of the best altcoins to watch in the current bear market. Those investing in Dogecoin today will pay just $0.07. At its peak in 2021, Dogecoin was trading at $0.74. While there are no guarantees that Dogecoin will regain its former all-time high, current prices offer a discounted entry price of 90%.\n\nWondering where to buy altcoins like Dogecoin? Here’s a step-by-step guide on how to buy Dogecoin on eToro from just $10.\n\nCryptoassets are a highly volatile unregulated investment product.\n\n16. Uniswap – Decentralized Exchange Supporting Trading, Lending, and Borrowing\n\nUniswap is one of the best altcoins to invest in for exposure to decentralized trading. Launched in 2020, Uniswap enables traders to swap cryptocurrencies without a third party. It uses an automated market maker (AMM) protocol for this purpose. In simple terms, the AMM uses liquidity pools containing two different tokens.\n\nFor example, an ETH/USDT pool would enable users to swap these tokens instantly without requiring a seller. Uniswap pools are funded by investors looking to earn passive income. Investors receive a share of the trading fees collected by the pool. What’s more, investors can withdraw their tokens from a Uniswap pool at any time.\n\nUniswap also has its own altcoin, UNI. This is a governance token that also trades on crypto exchanges. As such, those buying UNI tokens can gain exposure to the project. Uniswap currently has a market capitalization of $3 billion, pricing UNI tokens at just $5. During the prior bull market, UNI tokens were valued at over $40.\n\nCryptoassets are a highly volatile unregulated investment product.\n\nWhat are Altcoins?\n\nAlternative coins, or simply ‘altcoins’, refers to all cryptocurrencies other than Bitcoin. This means that there are over 24,000 altcoins to choose from. Currently, the cryptocurrency industry has a market capitalization of over $1 trillion. Of this figure, approximately 54% is attributed to altcoins.\n\nIn many cases, investors buy altcoins to diversify away from Bitcoin. Moreover, many altcoins have a small market capitalization. This presents an opportunity to target a higher upside. New altcoins enter the market daily, most offering early investors a discounted price via a presale campaign.\n\nThis includes the likes of Bitcoin ETF Token, Wall Street Memes, Thug Life, and yPredict. Presales are particularly attractive for growth investors, as these projects enter the market with a small valuation. Over time, it is hoped that the value of the altcoin will appreciate. Ethereum is a great example of this. Ethereum’s presale priced ETH at just $0.31. ETH has since hit highs of almost $5,000.\n\nThat said, it is important to remember that Bitcoin sentiment dominates the altcoin market. This means that when Bitcoin is bullish, the altcoin market follows suit. And vice-versa when Bitcoin is bearish. However, this isn’t a blanket rule. Instead, many altcoins perform well even when the broader markets are down.\n\nIs Investing in Altcoins Worth It?\n\nMany altcoins have produced unprecedented returns since they entered the market. Ethereum, for example, has increased in value by over 1 million percent since its 2014 presale. That said, there are also many examples of altcoins that have lost significant value. As such, investors should consider the risk of financial loss before investing in altcoins.\n\nNow let’s take a deeper dive into the investment thesis of altcoins.\n\nDiversification\n\nMany investors buy altcoins as part of a diversification strategy. This means that the investor will add many different altcoins to their portfolio. Considering there are thousands of options in the market, this makes altcoins ideal for this purpose.\n\nA well-diversified portfolio will contain altcoins from various niches\n\nTo ensure a balanced and risk-averse approach, investors will often allocate funds to more established altcoins too.\n\nThis might include large-cap altcoins like Ethereum, XRP, and Dogecoin.\n\nCreating a diversified altcoin portfolio ensures that investors are not overexposed to a single cryptocurrency.\n\nHigher Returns\n\nWhile Bitcoin is the largest and de-facto cryptocurrency, altcoins offer the chance to make higher returns. This is because altcoins have a smaller market capitalization than Bitcoin, offering greater upside potential.\n\nFor example, Arbitrum currently has a market capitalization of $1.5 billion.\n\nThis amounts to under 1% of Bitcoin’s valuation.\n\nAs such, those buying ARB tokens can target a much higher upside in the coming years.\n\nSome of the best new altcoins and upcoming altcoins discussed today have a significantly smaller market capitalization.\n\nThis is because small-cap cryptocurrencies have a low market depth due to reduced liquidity. Meaning, that low-cap altcoins can increase a lot faster than those with a large valuation.\n\nNew Concepts From the Ground Up\n\nSome of the best altcoins for 2023 are developing innovative concepts that offer real-world solutions to existing problems.\n\nFor example, Arbitrum has developed a layer 2 solution for the Ethereum blockchain.\n\nMore than 220 ERC-20 tokens have bridged to Arbitrum, meaning faster, cheaper, and more scalable transactions.\n\nThose buying ARB tokens will gain exposure to the growth of Arbitrum.\n\nSimilarly:\n\nEcoterra has developed a recycle-to-earn concept.\n\nAs the name implies, this rewards people that recycle their consumed or unwanted goods.\n\nRewards are paid in ECOTERRA tokens, which have plenty of use cases.\n\nFor instance, ECOTERRA can be used to buy tokenized carbon credits, eco-friendly products, or recycled raw materials.\n\nThe key point here is that altcoins offer exposure to new concepts from the ground up. This is especially the case when investing in altcoin presales, as the tokens will have yet to be listed on exchanges.\n\nBear Market Discounts\n\nDuring bear markets, most cryptocurrencies lose value. However, when compared to Bitcoin, altcoins generally decline by a greater amount. Some altcoin investors view this as a benefit. This is because investors can top up altcoins for 2023 at a huge discount.\n\nFor example, we mentioned that Dogecoin is trading 90% below its bear market peak. Similarly, Uniswap is trading at an 88% discount from its former highs. Discounts of this nature offer an attractive entry point. The hope is that the purchased altcoins will return to their prior all-time highs during the next bull run.\n\nInvestors should remember that there are no guarantees that this will be the case. Moreover, there is no certainty that the cryptocurrency markets will ever return to their former highs.\n\nHow Many Altcoins Are There?\n\nAccording to CoinMarketCap, there are over 24,000 altcoins to watch in the market today. Once again, this covers every cryptocurrency apart from Bitcoin. The altcoin market has grown considerably in recent years. Not only in terms of the number of altcoins but the broader market value.\n\nFor example, in 2013, the total altcoin market was worth just $91 million. At its peak in 2021, the altcoin market was valued at over $1.2 trillion. Due to bear market conditions, the altcoin market is currently worth $600 billion. Nonetheless, when compared to 2013 levels, this represents growth of over 6,000x.\n\nHow to Find the Best Altcoins to Invest in?\n\nWith over 24,000 tokens to choose from, finding the next big altcoin can be difficult. Here are some tips on how to find the best altcoins with the most potential:\n\nQuality Presales\n\nA good starting point is to look for new altcoin presales. Upconing altcoins enable investors to buy new crypto tokens at a discount before they are listed on crypto exchanges.\n\nAs noted earlier, the Ethereum price priced ETH tokens at just $0.31. At its peak in 2021, ETH was trading at almost $5,000.\n\nLarge-Cap Altcoins at a Discount\n\nAnother way to find the best altcoin investments is to focus on large-cap projects trading at a bear market discount. Large-cap altcoins come with reduced risks when compared to presales.\n\nThis is because large-cap altcoins are usually well-established. Currently, the most popular altcoins, including Dogecoin, Uniswap, XRP, and Arbitrum, are trading at huge bear market discounts.\n\nLook for Trending Altcoins\n\nSome of the best altcoins to buy are those that are trending online – this is because trending coins often create FOMO (Fear of Missing Out).\n\nThis is an emotional investment strategy, meaning people buy an altcoin because they don’t want to miss out on a potential windfall. A good example of this is Dogecoin.\n\nWhen Elon Musk began tweeting about Dogecoin in early 2021, this created a sudden wave of buying pressure. So much so that Dogecoin generated returns of over 14,000% in the first five months of 2021.\n\nOne of the best ways to find trending altcoins is on social media. In addition to Twitter, Reddit is also a good source. There are many altcoin-related forums on Reddit that offer insight into the most trending cryptocurrencies to watch.\n\nCoinMarketCap\n\nAnother way to find the best altcoins to invest in is via CoinMarketCap. This platform is the gold standard for crypto data aggregation, enabling investors to source altcoin investment ideas.\n\nFor example, CoinMarketCap has a dedicated page for trending cryptocurrencies. This is updated in real-time and is based on various metrics. This includes the number of people searching for a specific altcoin and recent trading volumes.\n\nCoinMarketCap also enables users to sort altcoins by their recent pricing performance. This enables users to view the best-performing altcoins over the prior hour, day, or week.\n\nBest Place to Buy Altcoins to Invest in 2024\n\nInvestors are able to buy the top altcoins in a variety of ways, often depending on which stage of their development they are in.\n\nFor example, many of the best upcoming altcoins listed above are in their crypto ICO or presale stage, meaning they cannot be purchased on crypto exchanges or with brokers and instead need to be bought directly on the project’s website.\n\nEventually, they will be listed on a variety of the best altcoin exchanges, just like the most popular altcoins in our list already are.\n\nWe rate eToro as the best altcoin trading platform, as it is a popular and highly-trusted broker that is heavily regulated in a variety of nations, including with with FINRA (US), ASIC (Australia), FCA (UK), and CySEC (Cyprus), with 30 million global customers.\n\nThe altcoin platform supports Bitcoin and a number of other top altcoins – more than 90 in total including ETH, BNB, XRP and ADA – as well as other financial instruments such as stocks and ETFs, with low and transparent fees.\n\nIt also has a smooth user experience and has features such as copy trading, although seasoned traders may prefer other platforms as it only offers limited trading tools. Some products, such as forex, commodities and indices, are not available in the US as they are traded as contracts-for-differences.\n\nVisit eToro\n\nCrypto assets are a highly volatile unregulated investment product. No UK or EU investor protection.\n\nHow to Buy Altcoins\n\nBelow we outline how to buy the most popular altcoins and the best new altcoin projects while on presale:\n\nHow to Buy Altcoins with eToro – Quick Guide\n\nFollow these quick steps to purchase ETH, XRP or other popular altcoins in the market with eToro:"
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vd3d3LmNyeXB0b3BvbGl0YW4uY29tL2V0aGVyZXVtLXRyYW5zYWN0aW9uLWZlZS1jbGltYnMtYWJvdmUtMjE5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Ethereum transaction fee climbs above 219% - Cryptopolitan",
        "content": "Over the recent three weeks, the realm of cryptocurrency transactions has witnessed a significant metamorphosis, particularly in the domains of Bitcoin (BTC) and Ethereum (ETH). Transaction costs for both these leading cryptocurrencies have experienced a noticeable surge, introducing a dynamic landscape for users partaking in digital asset transfers.\n\nEthereum transaction fees rise to $6.64\n\nBitcoin, as the pioneer in the cryptocurrency space, has encountered a sharp escalation in transaction costs, reaching a pinnacle of $15 per transfer just three days ago. This escalating trend in fees is not confined to Bitcoin alone; Ethereum has concurrently undergone a parallel trajectory. In the period spanning from October 22 to November 12, 2023, the average fee for Ethereum transactions soared by a striking 219%, elevating from $2.08 to $6.64 per transaction.\n\nThe synchronization in the movement of Ethereum’s fees with Bitcoin’s transaction costs can be attributed to the shared factor of gas expenses. The expenditure related to the gas required for executing transactions on both blockchains has seen an upswing during this timeframe. Currently, the average fee for an Ethereum transaction stands at $6.64, accompanied by a median fee of 0.0013 ETH, equivalent to $2.70 per transaction.\n\nInterestingly, the alignment between Ethereum and Bitcoin becomes more apparent when comparing the average and median charges for transactions on both networks. However, a notable distinction emerges when engaging in specific operations on the Ethereum blockchain, such as interacting with a smart contract. Executing operations like exchanging an ETH-based asset on a decentralized exchange (dex) platform incurs a distinct fee ranging from $27.77 to $28.50 per transaction.\n\nComplexities in ETH operations and transaction costs\n\nSimilarly, the cost associated with conducting a non-fungible token (NFT) transaction experiences fluctuations between $46.93 and $48.16. On November 12, the cost of transferring assets across different chains via bridging was estimated to be in the range of $8.93 to $9.17. This process accentuates the additional complexities and costs involved when moving assets across various blockchain networks. From October 22, 2023, to November 11, 2023, Ethereum has been processing an average of approximately 1,071,448 transactions daily.\n\nThis substantial transaction volume underscores the robust activity within the Ethereum network, despite the accompanying rise in transaction costs. In the broader comparison of Ethereum and Bitcoin, often referred to as the ‘Flippening Watch,’ Bitcoin maintains its lead over Ethereum in market capitalization, daily trading volume, and the fees collected by validators in the 24 hours compared to what BTC miners earn. Regardless of the chosen perspective, transactions on these two blockchains, which dominate in terms of market capitalization, come at a significantly higher cost compared to their other layer one (L1) counterparts.\n\nAs users navigate this evolving landscape of cryptocurrency transactions, the intricate interplay between fees, transaction volumes, and the distinctive characteristics of different blockchain operations becomes increasingly relevant. The surge in fees, while reflective of heightened activity and demand, prompts users to consider the cost-effectiveness of their chosen blockchain for specific operations and transactions in this ever-evolving digital financial ecosystem."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMikAFodHRwczovL3d3dy5jcnlwdG9nbG9iZS5jb20vbGF0ZXN0LzIwMjMvMTEvZXRoZXJldW0tcG9pc2VkLXRvLW91dHNoaW5lLWJpdGNvaW4taW4tY3J5cHRvcy1sYXRlLXNwcmluZy1waGFzZS1zYXlzLWZvcm1lci1nb2xkbWFuLXNhY2hzLWV4ZWN1dGl2ZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Raoul Pal Predicts Ethereum's Superior Performance Over Bitcoin in Crypto Market - CryptoGlobe",
        "content": "Raoul Pal is a well-known figure in the finance and investment world, particularly recognized for his expertise in macroeconomic trends. He is the co-founder and CEO of Real Vision, a financial media company offering in-depth video interviews and research publications with some of the world’s best investors and economists.\n\nBefore establishing Real Vision, Pal had a successful career in the hedge fund industry. He retired from managing money at the age of 36 after a successful stint at Goldman Sachs where he co-managed the hedge fund sales business in Equities and Equity Derivatives in Europe. He also ran a successful global macro hedge fund.\n\nPal is known for his global macroeconomic perspectives, which he shares through various media channels, including Real Vision and social media platforms. His insights cover a broad range of topics, including global financial markets, commodities, cryptocurrencies, and economic trends. He is particularly noted for his analysis of the cryptocurrency market and has been a vocal proponent of digital assets like Bitcoin and Ethereum.\n\nOn November 9, addressing his one million followers on the social media platform X (formerly known as Twitter), Pal referenced the Tom Demark Sequential indicator to support his view that Ethereum is gearing up to surpass Bitcoin.\n\nThe Tom DeMark Sequential is a technical analysis indicator developed by Tom DeMark to identify potential price exhaustion and reversal points in financial markets. This tool is particularly popular among traders and analysts in various markets, including forex, stocks, and cryptocurrencies.\n\nThe Sequential consists of two main components: the Setup and the Countdown. Here’s a brief overview of how it works:\n\nSetup: The Setup is the first phase and consists of nine consecutive candles. For a buy signal, each candle’s close must be lower than the close four candles earlier. Conversely, for a sell signal, each candle’s close must be higher than the close four candles earlier. Completing a Setup is the first indication of a potential trend reversal. Countdown: After the Setup is completed, the Countdown begins. This phase consists of 13 candles. For a buy Countdown, the low of each candle must be lower than the low two candles earlier. For a sell Countdown, the high of each candle must be higher than the high two candles earlier. The Countdown doesn’t need to be consecutive candles.\n\nThe Sequential indicator is often used to identify exhaustion points in a trend, suggesting that the current trend might be nearing its end and a reversal could be imminent. However, like all technical analysis tools, it’s not foolproof and is best used in conjunction with other indicators and methods to confirm signals.\n\nTom DeMark’s Sequential has gained a reputation for its effectiveness, especially in markets that exhibit strong trends, and is a favored tool among many professional traders for its ability to provide clear, actionable signals based on price action.\n\nPal highlighted a specific pattern, the weekly DeMark 9 count for the ETH/BTC cross, suggesting that Ethereum is likely to outperform Bitcoin in the current market phase.\n\nThat is the weekly DeMark 9 count for the ETH/BTC cross. ETH most likely outperforms from here as per usual at this stage in late Crypto Spring. pic.twitter.com/yBCrLRzFXn — Raoul Pal (@RaoulGMI) November 9, 2023\n\nFurthermore, Pal discussed the significance of Ethereum-based exchange-traded funds (ETFs), which he considers the “holy grail” for asset managers. He explained that these ETFs allow managers to capture yield while providing only price performance to holders, making it a highly profitable venture until competitive alternatives emerge.\n\nAn ETH ETF is the holy grail for asset managers as they can capture the yield and only give price performance to the ETF holders. It is a super profitable business until it gets competed away eventually. — Raoul Pal (@RaoulGMI) November 9, 2023\n\nFeatured Image via Pixabay"
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vd3d3LmNyeXB0b3BvbGl0YW4uY29tL3Jld2FyZHMtdG9wLWJsb2NrY2hhaW4tZ2FtZXMtb24tZXRoZXJldW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "What are the Rewards from the Top blockchain games on Ethereum? - Cryptopolitan",
        "content": "Blockchain games have become one of the hottest topics in the gaming industry, and Ethereum is at the forefront of this trend. Ethereum-based games leverage blockchain technology to provide players with a secure environment for gaming, as well as exciting rewards and incentives. Here’s a list of some of the top blockchain games on Ethereum that you can play right now!\n\nIlluvium\n\nTake up the adventure of a lifetime with Illuvium, an open-world RPG built on the Ethereum Blockchain. Traverse a vast and varied land on your quest to capture deity-like creatures called Illuvials – battle, upgrade, and make teams for triumph in the competition.\n\nWith over one hundred Illuvials, each possessing different affinities, classes, and abilities, there are endless combinations for crafting an unbeatable team. Capture them all, – then store them in Shards! These sleek crystal slivers hold the creature’s essence, so you can compare stats and brag about your rare collectibles. Then, join us in our community-based governance to earn $ILV through play and become one of our champions!\n\nGuild of Guardians\n\nGuild Of Guardians will appeal to passionate gamers looking to bring their love of gaming into a new, stratified arena.\n\nPlayers will become team Leaders in this multiplayer fantasy action RPG and assemble their dream team of ‘Guardians,’ which they can deploy against enemy forces and climb the ranks of their guild for epic rewards. Developed and published by Stepico Games and Immutable, respectively – these are two industry-leading companies that have made massive contributions to the gaming world. Stepico has created multiple titles with over 5 million downloads. Immutable has earned $17m in funding investments from notable sources such as Naspers, Galaxy Digital, and Coinbase, having also launched Gods Unchained, one of the most popular Blockchain Trading Card Games.\n\nWith such an established legacy under both companies’ belts, Guild Of Guardians promises an exciting new experience for gamers of all levels.\n\nCryptoKitties\n\nCryptoKitties is a virtual pet game built on Ethereum and one of the first to capture the public’s imagination. Players can purchase, breed, trade, and collect their favorite digital cats, each with unique traits.\n\nCryptoKitties have become incredibly popular due to their low barrier of entry – the game is accessible and intuitive for even those with no prior blockchain or gaming experience. With millions of kitties in circulation, CryptoKitties has become one of the most popular blockchain games and continues to grow each day as new players join.\n\nThe Sandbox\n\nThe Sandbox is a unique gaming platform where players can create, own and monetize their game experiences. Through this innovative play-to-earn model, players can earn SAND tokens by playing games or creating content within the world, which they can use to buy or sell items in The Sandbox’s virtual marketplace.\n\nPlayers can choose from various pre-made worlds and use their imagination to construct environments, create characters, and design adventures for other players. The Sandbox is revolutionary as it enables players to take ownership of their in-game assets, building a digital world and incentivizing users to stay and play.\n\nAxie Infinity\n\nAxie Infinity is a digital pet universe built on Ethereum and based in the fantasy world of ‘Lunia.’ In this game, players can collect and battle their favorite Axies. These adorable creatures have unique stats which can be improved through battles, creating a competitive and strategic online arena for Axie enthusiasts.\n\nAxie Infinity has seen tremendous success in the blockchain space, with its token AXS reaching an all-time high in November 2021 and its player count over 500k. It has also won prestigious awards, and numerous publications, such as Forbes, have featured it. Crypto gaming fans should check out this game and join its passionate community.\n\nAxie Infinity is an innovative and creative concept pushing the boundaries of blockchain gaming to create something truly unique. Players can explore Lunia’s vibrant world with their Axies, earn rewards through play, and participate in its ever-growing community. Join the fun today!\n\nDecentraland\n\nDecentraland is a virtual world powered by the Ethereum blockchain, where users can create and explore 3D experiences. Players can purchase land parcels (called LAND) which they can use to build their virtual creations, from games, shops, and galleries to art installations, music venues, and more.\n\nDecentraland’s cryptocurrency MANA is used for buying and selling goods in the virtual world and for staking purposes, allowing players to earn rewards through play. Decentraland’s popularity has steadily grown since its launch in 2017, and it now boasts over 1 million users worldwide.\n\nDecentraland provides an exciting opportunity for gamers and artists to express themselves in a virtual world and make real money from their creations. It’s a unique concept that will grow and evolve as more players join its vibrant community.\n\nMy Neighbour Alice\n\nMy Neighbor Alice is an exciting virtual world experience fusing two popular gaming genres: collecting and building. Developer Antler Interactive has created a unique environment for players to customize their virtual island, craft items, build structures and make new friends. Starting with the classic elements of successful builder games, like Animal Crossing, it also includes a blockchain-powered digital asset economy that rewards loyal players with Non-Fungible Tokens (NFTs), which they can collect and trade. With high-quality 3D graphics and a one-of-a-kind storyline, My Neighbor Alice offers every player something more special than just another multiplayer game.\n\nLeague of Kingdoms\n\nLeague of Kingdoms provides players with an innovative, intuitive, unique, and incomparable gaming experience.\n\nThis free-to-play MMO war strategy game runs on a blockchain, and the battles occur in fully immersive 3D worlds. At its core, League of Kingdoms is an RTS tasked with players developing their kingdoms, assembling an army, forming alliances, and conquering lands.\n\nPlayers can even purchase virtual land as non-fungible tokens (NFT). Moreover, with no prior experience or knowledge of cryptocurrencies needed to play this game, anyone can join in on the fun while potentially earning real rewards!\n\nIf you want to mix traditional gaming tactics with blockchain technology, League of Kingdoms delivers a genuinely unbeatable and revolutionary experience!\n\nGods Unchained\n\nGods Unchained has shaken the card gaming world with an innovative model that allows players to own their digital cards.\n\nThe studio behind this game wanted to break away from the traditional model of having your collection reset when rotation hits. Instead, players have complete control over their assets and can take them between any title that accepts NFTs.\n\nThere are four unique modes for users to explore, giving them various ways to enjoy Gods Unchained. First, the tutorial guides you through the basics and more advanced strategies before diving into the Solo mode, which pits you against computer-controlled opponents. Finally, direct Challenges and Ranked let you compete against others, allowing you to show off your skills for a chance at glory! Explore Gods Unchained with these exciting modes today!\n\nAavegotchi\n\nAavegotchi is a compelling and unique NFT gaming experience that lets you purchase and raise Aavegotchis in an explorable digital universe. After obtaining the GHST tokens, players can participate in the game by buying various items from the marketplace or using a portal to summon an Aavegotchi. This unique avatar has attributes defined by rarity score, so all Gotchis are unique! You can level up your Gotchi by petting it every 12 hours or feeding it one of many consumables to interact with it. Players who “farm” their Aavegotchi will be rewarded with incentives such as wearables for their avatar, making Aavegotchi an addictive and engaging game!\n\nDeRace\n\nDeRace is an innovative horse racing simulator that offers players a highly realistic and immersive experience. This dynamic platform allows users to take on the role of a bookmaker, gambler, or horse owner to create their ultimate horse racing game.\n\nFrom managing betting odds to becoming the top-dog horse breeder, DeRace provides players with various exciting activities and responsibilities. As they navigate the different aspects of the industry, they will get challenged while earning tangible profits determined by the success of their performance.\n\nMake sure you jump on the DeRace bandwagon, as it will provide thrilling entertainment for anyone looking for a realistic horseracing experience!\n\nConclusion\n\nThese NFT games are sure to keep players entertained for hours on end. With so many creative and captivating titles, there is something for everyone! From competitive card battles to virtual pet raising, explore these innovative gaming experiences today. Experience a new world of gaming with blockchain technology as you own your digital assets and reap the rewards!"
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3LnRyb253ZWVrbHkuY29tL3dlZWtseS1oaWdobGlnaHRzLWJpdGNvaW4tZXRoZXJldW0taG9sZC1zdHJvbmcv0gFOaHR0cHM6Ly93d3cudHJvbndlZWtseS5jb20vd2Vla2x5LWhpZ2hsaWdodHMtYml0Y29pbi1ldGhlcmV1bS1ob2xkLXN0cm9uZy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Weekly Highlights: Bitcoin & Ethereum Hold Strong, Altcoins Shines - TronWeekly",
        "content": "The cryptocurrency market is exciting as it concludes an upbeat week, with Bitcoin and Ethereum showing substantial gains on their weekly charts. However, the real stars of the week were the altcoins, which made remarkable strides, hinting at potential further growth in the near future.\n\nIn the top 50 cryptocurrencies list, several altcoins made impressive gains, and the standout performer was THORChain (RUNE). Solana (SOL) and Avalanche (AVAX) followed closely behind, securing the second and third positions, respectively, with impressive growth.\n\nSource: CoinMarketcap\n\nTHORChain (RUNE) made a significant mark with a remarkable 53% surge over the past week, reaching a peak of $5.83. As of the latest data, it is trading at $5.22, demonstrating robust performance despite experiencing a slight 1.80% increase in the last 24 hours.\n\nSource: CoinMarketcap\n\nSolana (SOL) also made waves with a 44% gain during the past week. SOL is currently trading at $58.4, with a marginal 0.86% decrease in price and a 47.49% decrease in trading volume in the last 24 hours.\n\nSource: CoinMarketcap\n\nAvalanche (AVAX) garnered significant attention, with a weekly increase of more than 39%. Currently, AVAX is trading at $18.08, with a 1% price decrease and a 26.63% drop in trading volume within the last 24 hours.\n\nOther popular altcoins such as Polygon (MATIC), Chainlink (LINK), and Cosmos (ATOM) also reported gains in their weekly charts, with MATIC up by 24%, LINK by 22%, and ATOM showing an 18% increase, according to data from CoinMarketCap.\n\nBitcoin (BTC) & Ethereum (ETH) Weekly Review\n\nThe Bitcoin (BTC) market is in a consolidation phase this Saturday, trading horizontally just below its annual peak at approximately $38,000 earlier this year. The recent surge has positioned Bitcoin for its most robust four-week performance since January, marking an impressive 42% increase from just under $17,000 to nearly $24,000.\n\nSource: CoinMarketcap\n\nThere is widespread speculation that the US Securities and Exchange Commission (SEC) is preparing to approve a series of spot Bitcoin ETFs, potentially as early as January, and updates on this matter are expected to impact the market significantly in the coming days.\n\nAccording to Santiment, Bitcoin, now up by +37% in the past two months, has seen an increase in the ratio of traders opening bullish positions compared to bearish ones, reaching three-month highs. Moreover, the total open interest on exchanges has surged to $7.2 billion. It is hoped that Bitcoin will continue to rise after the FOMO (Fear of Missing Out) settles.\n\n🤑 #Bitcoin, now up +37% in 2 months, has seen its ratio of traders opening #bullish positions (vs. #bearish) hitting 3-month highs. Also, the total open interest on exchanges has ballooned to $7.2B. Ideally, $BTC will continue rising after #FOMO settles. https://t.co/YImIUMGRyl pic.twitter.com/4TyZe5YfFz — Santiment (@santimentfeed) November 8, 2023\n\nIntoTheBlock shared a similar sentiment, noting that funding rates for BTC and ETH perpetual swaps have hit a yearly high, signaling potentially overheated markets. While not a direct predictor of decreasing prices, sustained high rates indicate a need for caution.\n\nFurthermore, Santiment highlighted that Ethereum has reached as high as $2,132, as optimism surrounding the second-largest cryptocurrency surged with BlackRock’s new ETF submission for the SEC’s review. The latest insights examine Ethereum’s on-chain health and its chances of continuing its growth.\n\n📊 #Ethereum has reached as high as $2,132 as optimism surrounding the #2 asset in #crypto surged with #Blackrock's new submitted #ETF for the #SEC's review. Our latest insight looks at $ETH's #onchain health and its chances to continue its growth. 👇 https://t.co/8sBC9d1lWT pic.twitter.com/2PruVIM4Ve — Santiment (@santimentfeed) November 11, 2023\n\nSantiment also pointed out that Ethereum’s market value has surged by +38% in the past four weeks, driven by high network growth. Micro addresses holding less than 0.1 ETH have recently surpassed 100,000 wallets for the first time, and even the 0.1-10 ETH and 10,000+ ETH tiers are finally on the rise.\n\nSource: CoinMarketcap\n\nAs of the latest data from CoinMarketCap, Bitcoin is currently trading at $37,007.49, showing a 6% increase over the past seven days and a 0.36% decrease in the past 24 hours. Ethereum (ETH) is trading at $2,057.01, displaying a 0.47% increase in the past 24 hours and an 8.58% gain over the past seven days. The cryptocurrency market is poised for continued excitement, with investors closely watching for further developments in the coming days.\n\nRelated Reading | Bitcoin Weekend Watch: DaanCrypto Signals Market Respite Amidst Volatility"
    }
]