[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vY3J5cHRvLm5ld3MvZ2lkZHktYS1zZWxmLWN1c3RvZHktc21hcnQtd2FsbGV0LWV4dGVuZHMtdG8tZXRoZXJldW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Giddy, a self-custody smart wallet, extends to Ethereum - crypto.news",
        "content": "Giddy, a self-custody smart wallet with advanced private key technology, has integrated Ethereum, the pioneer smart contract platform.\n\nThe aim is to enhance the wallet functionalities and accessibility across multiple networks, enhancing user experience.\n\nGiddy expands, supports Ethereum\n\nThe Giddy smart wallet aims to provide its users with an easy retail experience, allowing them to access decentralized finance (defi) earning opportunities. The project initially launched on Polygon.\n\nIn a press release shared exclusively with crypto.news, this expansion will set the course for future expansions into EVM-compatible laye-1 and layer-2 platforms. Specifically, the wallet provider aims to integrate Arbitrum, Base, BNB Chain, and many more, in the future.\n\nYou might also like: PancakeSwap launches on Ethereum layer-2 solution, Base\n\nThere are also solid plans to list Bitcoin.\n\nWith this, users can buy multiple coins using fiat straight from the Giddy wallet. At the same time, they can swap tokens, buy items of supported brands from 150 countries, and send assets.\n\nPrivate key technology\n\nGiddy wallet has a unique private key technology that splits the recovery phrases into three parts for security.\n\nThe first is a user-generated password, the second is their personal hardware or mobile device, and the third is a social login like Google Gmail or Apple ID. Each component alone doesn’t pose a major risk, minimizing the chance of compromise. If any part is lost, users can recover their wallet and funds, and they have the flexibility to export their private keys to a destination of their choice.\n\nEric Parker, the CEO and co-founder of Giddy, said their private key management solution is a “ game changer among crypto wallets” and will simplify user experience since the technology “breaks down the private key into multiple factors owned by the user”, empowering them as a result.\n\nRead more: US SEC postpones ruling on 6 spot Bitcoin ETF applications\n\nDisclosure: This content is provided by a third party. crypto.news does not endorse any product mentioned on this page. Users must do their own research before taking any actions related to the company.\n\nFollow Us on Google News"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9ldGgtc3Rha2luZy1zZXJ2aWNlcy1hZ3JlZS1saW1pdC1mb3ItdmFsaWRhdG9ycy1hbWlkLWNyaXRpY2lzbS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Staking Services Accept 22% Validators Limit Amid Criticism From ETH Community - CCN.com",
        "content": "Key Takeaways\n\nSome ETH staking service providers agreed to a self-imposed limit.\n\nThe limit restricts the amount of the staking market they control.\n\nThey promise to hold no more than 22% of the Ethereum staking market.\n\nPotential centralization of ETH liquid staking behind the move.\n\nEthereum has always been at the forefront of the debate about decentralization and now this is being protected by the adoption of a ground-breaking self-limit regulation by Ethereum staking providers.\n\nThe 22% Self-Limit Rule\n\nIn order to maintain Ethereum blockchain’s decentralized nature, at least five Ethereum liquid staking providers, including Rocket Pool , Stader Labs , Diva Staking , Puffer Finance , and StakeWise , have either adopted or are actively working to implement a self-limit rule. This regulation limits their ownership to no more than 22% of the Ethereum staking market.\n\nThis figure was selected due to Ethereum’s consensus algorithm requiring a 66% validator agreement on the network’s state. This rule mandates the collaboration of at least four major companies for finalizing the chain, making transactions unchangeable by setting the limit at 22%.\n\nStruggling Against Centralization\n\nThe Ethereum community has had ongoing concerns about staking service centralization, as indicated by the self-limit proposal presented by Superphiz, an Ethereum core developer, in May 2022 . The main goal is to maintain the network’s decentralized nature by preventing any one entity from obtaining disproportionate influence over it.\n\nThese providers are committed (or are in the process of committing) to self-limit to <22% of Ethereum validators. This is how our chain will be successful: Coordination above greed. Cooperation instead of winner-take-all.@Rocket_Pool @stakewise_io @staderlabs @divastaking — superphiz.eth 🦇🔊🛡️ (@superphiz) August 30, 2023\n\nLido Finance Mysteries\n\nThe biggest Ethereum liquid staking service, Lido Finance, stands out as an important exception to this trend. According to data from Dune Analytics , Lido has now a commanding 32.4% of all staked Ethereum, leaving Coinbase with just an 8.7% market share.\n\nIn an unexpected move, Lido Finance voted against self-limiting in June, with a whopping 99.8% majority.\n\n“They have expressed an intention to control the majority of validators on the beacon chain,” Superphiz said in an August 31 post.\n\nVarious Views in ETH Community\n\nThe self-limit rule has received a mixed reception from the Ethereum community. Some claim that the rule ignores the Ethereum tenets in favor of concentrating on economic self-interest. They argue that if proponents of the self-limit rule were in Lido’s position of power, they may view things differently.\n\nEasy to commit to self-limit when it seems that most of these will likely never reach 22% market share of Liquid staking on Ethereum. Folks in the ETH community should not shame more user-friendly solutions as greedy products. https://t.co/65vgti3Jrm — Neel Daftary 🦇🔊 (@DaftaryNeel) August 31, 2023\n\nOn the other hand, several members of the Ethereum community voiced worries about the risks of centralization posed by Lido’s substantial market share. They call this domination “selfish” and push for measures to maintain the health and decentralization of the larger Ethereum ecosystem.\n\nYeah because they have way less market share than that now… easy to chirp from the cheap seats. This has nothing to do with “Ethereum alignment.” None of these teams would self limit were they in Lido’s place. Everyone is doing the economically selfish and rational thing… — Mippo 🟪 (@MikeIppolito_) August 31, 2023\n\nThe debate over Ethereum’s decentralization will persist as it evolves. The 22% self-limit rule is a significant step in striking a balance between market growth and network decentralization.\n\nIt underscores the Ethereum community’s commitment to preserving decentralization for impartiality and permissionless innovation on the platform.\n\nThe Ethereum community’s commitment to decentralization is demonstrated by its acceptance of the 22% self-limit rule. This novel strategy aims to protect the fundamental values of the Ethereum platform by preventing any one company from exerting undue control over the Ethereum staking market.\n\nWhile opinions may vary, it underscores the Ethereum community’s ongoing commitment to striking the right balance between market dynamics and network integrity."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtcHJpY2UtYW5hbHlzaXMtZm9yLXNlcHRlbWJlci0xLTDSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Analysis for September 1 - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nBears have turned out to be more powerful than bulls on the first day of September.\n\nAdvertisement\n\nTop coins by CoinMarketCap\n\nETH/USD\n\nThe rate of Ethereum (ETH) has fallen by almost 4% over the last 24 hours.\n\nImage by TradingView\n\nDespite today's fall, there are no reversal signals yet, even on the hourly chart. The price of Ethereum (ETH) is on its way to testing the local support level of $1,630. If the bar closes near it, the breakout may lead to a sharp drop to the $1,600 zone soon.\n\nImage by TradingView\n\nA similar situation can be seen on the daily time frame. Traders should focus on the closest level of $1,622. If buyers lose it, the accumulated energy might be enough for a more profound drop to the $1,550-$1,600 range within the next few days.\n\nImage by TradingView\n\nA less positive picture can be see on the weekly time frame, as the rate is far from the support level. However, the bar is far from the closure, which means it is too early to draw any conclusions. But if the candle closes below the $1,600 zone, there is a good possibility of seeing the test of the $1,543 mark next week.\n\nEthereum is trading at $1,629 at press time."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zdGFyay13YXJlLWhlcm9kb3R1cy1sYXVuY2gtdGVjaC10by12ZXJpZnktZGF0YS1mcm9tLWV0aGVyZXVtLWJsb2NrY2hhaW7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "StarkWare, Herodotus launch tech to verify data from any point in Ethereum's history - Cointelegraph",
        "content": "A new zero-knowledge proof (ZK-proof) technology is set to improve the ability to access and verify historical data from the Ethereum blockchain, with deep chain validation cited as a usability barrier of the network.\n\nTechnology firm Herodotus has released its on-chain accumulator, which uses storage-proof cryptography, allowing users to verify data from any point of Ethereum’s blockchain without needing a third party. The solution makes use of StarkWare’s STARK proofs, the ZK-proof technology co-invented by mathematician Eli Ben-Sasson.\n\nStarkWare presented Herodotus with a custom-built instance of its shared prover service SHARP, which enables advanced scaling efficiency using recursive proofs. The latter allows a virtual machine to provide “proofs of proofs” by generating proofs of transactions or blocks in parallel and real-time, batching them into a subsequent proof.\n\nRelated: More TPS, less gas: Ethereum L2 Starknet outlines performance upgrades\n\nAt a slightly more technical level, the accumulator acts as a cache that stores block headers. If the accumulator has a header in its cache, the respective storage-proof computation can use it for validation.\n\nA visual representation of the possible use of recursive proofs to batch a variety of information into subsequent verified and cached proofs. Source: StarkWare\n\nIf the header is not cached, the prover has to generate a proof to cover the requested block range, add the block header to the accumulator and then complete the requested storage proof computation.\n\nAs the name suggests, the on-chain accumulator essentially accumulates proofs that rollup prior proofs, drastically reducing the time it takes to verify the Ethereum blockchain and associated data at any point in the network’s history.\n\nHerodotus chief technology officer Marcello Bardus notes that the technology removes the need to traverse the entire blockchain on the blockchain itself:\n\n“We can do it off chain, generate an accumulator and just cherrypick one specific block without iterating from the entire chain on the chain itself.”\n\nStarkWare notes that Storage proofs could prove groundbreaking as an alternative to cross-chain bridges that rely on third-party oracles to track and verify data.\n\nRelated: StarkNet overhauls Cairo programming language to drive developer adoption\n\nHerodotus co-founder Kacper Koziol added that the accumulator is an innovation that Ethereum has long needed to align with blockchain principles of transparency and accessibility. The technology will essentially allow any user to access any point in Ethereum’s history.\n\n“This will be very powerful. For the first time in the history of blockchains, people are going to be able to prove the correctness of any aspect of anyone’s on-chain information.”\n\nThe two teams highlight the potential for storage proofs to build “Web2 equivalent applications,” tapping into the pioneering ability to access and verify Ethereum blockchain data autonomously.\n\nAccount recovery is touted as one potential use case, where the ability to verify on-chain data could trigger a proverbial dead man’s switch or automate insurance protocols that use historical on-chain events to trigger smart contract payouts.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Recursive inscriptions: Bitcoin ‘supercomputer’ and BTC DeFi coming soon"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZGVjcnlwdC5jby8xNTQ2OTUvdGhpcy13ZWVrLWluLWNvaW5zLWJpdGNvaW4tZXRoZXJldW0tdG9uY29pbi10b24tcG9seWdvbi1tYXRpY9IBXWh0dHBzOi8vZGVjcnlwdC5jby8xNTQ2OTUvdGhpcy13ZWVrLWluLWNvaW5zLWJpdGNvaW4tZXRoZXJldW0tdG9uY29pbi10b24tcG9seWdvbi1tYXRpYz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Sep 2023 07:00:00 GMT",
        "title": "This Week in Coins: Bitcoin and Ethereum Unmoved in Slow Market Week - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt.\n\nMost of the top thirty cryptocurrencies by market capitalization posted negligible losses or gains over the last seven days.\n\nBitcoin (BTC) starts the weekend at $26,051, pretty much the same level it was at last week.\n\nAD\n\nAD\n\nThe world’s most popular cryptocurrency briefly surged on Tuesday after a judge representing the U.S. Court of Appeals for the D.C. Circuit ordered a review of the Securities and Exchange Commission’s (SEC) denial of crypto asset manager Grayscale’s spot Bitcoin ETF application. The Court said the SEC had failed to provide a “coherent explanation” for the denial.\n\nEthereum (ETH) took inconsequential seven-day losses of 0.4% and now changes hands at $1,646.\n\nVirtually every other leading cryptocurrency is approximately the same price it was last weekend except Toncoin (TON), which blew up 22% to trade at $1.75, and Bitcoin Cash (BCH), which rose 8.6% to $206.87.\n\nToncoin’s bullish momentum can be attributed to the development of the TON ecosystem.\n\nThe TON Foundation, which spun out from Telegram to develop TON, recently released a Telegram-centric Web3 app store and launched a community-driven initiative, Believers.ton, to promote ecosystem development.\n\nBitcoin Cash was one of the fastest risers when the Grayscale/SEC news broke on Tuesday and appears to have sustained the rally into the weekend. Similarly, Coinbase stock soared 15% in the hours following the news.\n\nAD\n\nAD\n\nAny intraweek gains that Bitcoin and Ethereum made were wiped out early on Friday as the industry reacted to news that the SEC needed more time to approve or reject 6 Bitcoin ETF applications.\n\nAll told, it was another excruciatingly slow news cycle this week for those looking to see some sign of growing global crypto adoption. On Thursday, airline Giant Lufthansa launched an NFT-based loyalty program on Polygon. Polygon’s MATIC token didn’t particularly react to the news, though—it ended the week 1.2% higher at a price of around $0.55."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOS8wMS9yZXRhaWwtdHJhZGluZy1naWFudC1yb2Jpbmhvb2QtdG8tZW5hYmxlLWluLWFwcC1zd2Fwcy1vbi10aGUtZXRoZXJldW0tbmV0d29yay1mb3ItbW9yZS10aGFuLTIwMC1jcnlwdG8tYXNzZXRzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Retail Trading Giant Robinhood To Enable In-App Swaps on the Ethereum Network for More Than 200 Crypto Assets - The Daily Hodl",
        "content": "Popular retail trading platform Robinhood says its self-custodial web3 wallet now supports in-app swapping on the Ethereum (ETH) network.\n\nIn a statement, Robinhood says select users can now swap for more than 200 tokens on Ethereum starting Wednesday, August 30th, and the feature will be available for all users in the coming weeks.\n\nUnlike other wallets, the Robinhood Wallet does not require users to hold ETH tokens to swap since the platform will automatically deduct the network fees from the crypto assets that its users already have.\n\nJohann Kerbrat, general manager of Robinhood Crypto, says the new in-app swap feature will make decentralized finance (DeFi) more accessible.\n\n“With Robinhood Wallet, we stripped away many of the complexities of DeFi and the broader Web3 ecosystem, and reduced some of the challenges and barriers to entry for everyday people.”\n\nRobinhood says it is launching Ethereum in-app swaps, along with custody, send, and receive support for Bitcoin (BTC) and Dogecoin (DOGE), in response to users’ request for access to more coins on more chains.\n\nThe trading platform also previously launched a crypto on-ramp that allows users to directly access and fund their Robinhood wallet without leaving decentralized applications (DApps) and needing to log into their accounts.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2Z0eC1jb2xkLXdhbGxldC1tb3ZlZC1hbG1vc3QtMTBtLWluLWFsdGNvaW5zLXRvLWV0aGVyZXVtLXNpbmNlLWF1Zy0zMS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Sep 2023 07:00:00 GMT",
        "title": "FTX cold wallet moved almost $10M in altcoins to Ethereum since Aug. 31 - CryptoSlate",
        "content": "A cold wallet owned by collapsed crypto exchange FTX moved almost $10 million in altcoins from Solana to Ethereum since Aug. 31 for undisclosed reasons, according to on-chain data.\n\nThe altcoins include notable tokens like LINK, SUSHI, LUNA, and YFI. The transfers were conducted through Wormhole Bridge.\n\nIt is unclear if the transfers are connected to the exchange’s bankruptcy proceedings or its recent request to hire Galaxy Digital to sell its crypto holdings for fiat.\n\nFTX did not respond to a request for comment as of press time.\n\nFTX looking to sell assets\n\nFTX recently filed a request with the bankruptcy court seeking permission to engage Galaxy Digital Capital Management as its investment manager for certain digital assets. The exchange also requested permission to stake some idle crypto assets to generate passive yield.\n\nUnder the proposed agreement, Galaxy would manage, trade, and convert FTX’s assets into fiat currency or stablecoins, and hedge the collapsed exchange’s exposure to volatile cryptocurrencies in return for a monthly fiduciary fee.\n\nFTX argued that Galaxy’s expertise in selling large cryptocurrency positions without affecting the market made it a suitable choice. The engagement aimed to support FTX’s restructuring efforts by monetizing its cryptocurrency holdings.\n\nAdditionally, the exchange has filed a separate motion to establish guidelines for managing and selling its digital assets and to enter into hedging arrangements on eligible cryptocurrencies — primarily Bitcoin and Ethereum.\n\nCreditors criticize pace\n\nFTX is facing criticism from creditors over the slow pace of its bankruptcy plan negotiations.\n\nThe exchange’s attorney, Brian Glueckstein, resisted calls for expedited mediation at the latest bankruptcy hearing on Aug. 23, saying the process is on track for conclusion in the second quarter of 2024.\n\nA draft plan proposed by FTX on July 31 outlined the intent to repay customers through asset liquidation and litigation against insiders. However, tensions have risen over FTX’s efforts to find a buyer for its international exchange, FTX.com, and the lack of information shared about incoming bids.\n\nCreditors’ committee attorney, Kris Hansen, also highlighted the $50 million monthly spent on attorneys’ fees and other costs due to FTX’s delay in resolving creditor concerns. FTX seeks to increase creditors’ recovery through lawsuits against its founder, Sam Bankman-Fried, investment firm K5, and the founders of FTX acquisition targets.\n\nThe bankruptcy case was filed in November 2022 after allegations that FTX misused and lost billions of dollars of customers’ crypto deposits."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLWFzLWJlYXJzLXB1c2gtZXRoLWRvd24tMTYwMC1sZXZlbC1tb3JlLXBhaW4td2F5Lmh0bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction as Bears Push ETH Down to $1,600 Level – More Pain on the Way? - Cryptonews",
        "content": "Ethereum Price Prediction as Bears Push ETH Down to $1,600 Level – More Pain on the Way?\n\nThe cryptocurrency market is experiencing waves of volatility, with Ethereum at the forefront of this turbulence.\n\nCurrently trading at $1,644, Ethereum has seen a 3.72% decline in the last 24 hours, pushing its market cap to approximately $197.67 billion.\n\nThis bearish movement, reflected in its trading volume of $6.4 billion, raises concerns about the potential for more losses.\n\nAs Ethereum holds its position at #2 on the CoinMarketCap ranking with a circulating supply of 120,215,528 ETH coins, the market anxiously awaits its next move.\n\nEthereum Price Prediction\n\nEthereum‘s valuation struggled to surpass the $1,750 mark, consequently erasing its gains relative to the greenback. A further downward trend might emerge if ETH breaches the $1,630 threshold.\n\nDespite attempts, Ethereum could not maintain its footing above $1,700 and subsequently witnessed a significant decline reminiscent of Bitcoin’s trajectory.\n\nA notable dip occurred beneath the $1,660 marker, with the price momentarily plunging under $1,640. After probing the $1,630 support, it’s currently in a phase of loss mitigation.\n\nFurthermore, an emerging bearish trend line, with a resistance around $1,690, is discernible on the hourly ETH/USD chart.\n\nSubsequent resistances lie around $1,680 and near the trend line at $1,700 – proximate to the 50% Fibonacci retracement of its recent downtrend.\n\nEthereum Price Chart – Source: Tradingview\n\nShould Ethereum surpass $1,700, it could potentially approach $1,750.\n\nA decisive ascent beyond $1,750 may pave the way for Ethereum to target the $1,800 barrier. Further positive traction could propel it towards the $1,850 mark.\n\nConversely, if Ethereum is unable to transcend the $1,700 barrier, we might observe a continued descent.\n\nImmediate support is located around $1,640, with significant supports at $1,630 and $1,600 respectively.\n\nA drop below the crucial $1,600 benchmark might amplify the decline to $1,540.\n\nFurther descent may push Ethereum closer to the $1,480 mark in the foreseeable future.\n\nWall Street Memes – The Alternative Coin Worth Considering\n\nCurrently, many investors are exploring diverse opportunities within the cryptocurrency realm, and Wall Street Memes has caught their eye. The $WSM presale, representing a meme coin, has stirred considerable excitement among the investment community.\n\nOriginating from Wall Street Memes, a renowned online community catering to these enthusiasts, this coin is making waves.\n\nThe crypto project by Wall Street Memes commenced its presale on May 26, 2023, accessible through their official portal wallstmemes.com.\n\nDuring its initial phase of the thirty-stage rollout, the WSM token was offered at a price of $0.025.\n\nThe response to the Wall Street Memes presale was overwhelmingly positive, with the first day witnessing a collection exceeding $300,000, eventually amassing a total of $25 million.\n\nCurrently, the WSM tokens in this presale phase are available for acquisition at $0.0337.\n\nSeizing this opportunity could pave the way for potential growth. Dive into the Wall Street Memes investment journey and experience a potentially lucrative venture.\n\nBuy $WSM Here\n\nDisclaimer: Crypto is a high-risk asset class. This article is provided for informational purposes and does not constitute investment advice. You could lose all of your capital."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vdGVjaHJlcG9ydC5jb20vY3J5cHRvLW5ld3MvaW52ZXN0b3JzLXdvcnJpZWQtYXMtZXRoZXJldW0tZXRoLXNsdW1wcy1ieS00LXNvbmlrLWNvdWxkLWJlLWEtZ29vZC1hbHRlcm5hdGl2ZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Investors Worried As Ethereum ETH Slumps by 4% - $SONIK Could Be a Good Alternative - The Tech Report",
        "content": "Ethereum ETH relapsed on August 30, 2023, after a noticeable bullish momentum on the previous day, which resulted in a positive change of 6%. The short-lived bull run emerged as Grayscale won the United States Securities and Exchange Commission (SEC) in a court ruling on August 29.\n\nToday, September 1, the asset market value is $1,641, representing a price decline of 4% in the last 24 hours.\n\nEthereum ETH Price Action Reveals a Market Down Turn Over the Past Week\n\nAccording to historical data from TradingView, the asset fully submerged the bearish trend on August 17 with an enormous negative change of 17% in market value.\n\nFollowing the bearish trend, Ether sustained eleven-day market fluctuations, oscillating between the $1626 and $1708 price levels.\n\nAgain, TradingView shows that the bears maintained a 2-day consecutive selling pressure in Ethereum ETH’s market between August 30 and 31, amounting to a 6% price decline. As a result, Ethereum sustained a 30-day price decline of 11%.\n\nMoreover, ETH price reflects a 3% price drop from its value over the past two weeks and a decline of 1% in the last seven days.\n\nTechnical Charts Shows That ETH Nears a Death Cross, What’s Next?\n\nSource: TradingView\n\nThe chart above shows that ETH could record a death cross as the 50-day Simple Moving Average (SMA) is about crossing below the 200-day SMA. Also, Ethereum (ETH) is trading below the 50-day and 200-day SMA, which indicates a strong bearish trend.\n\nFurthermore, the Moving Average Convergence Divergence (MACD) is slightly above the signal line with faded green histogram bars, suggesting a dwindling buy pressure.\n\nMoreover, ETH’s Relative Strength Index (RSI) at 36.85 confirms the bears are still very active in the Ether market. If the bulls allow the death cross to occur, panic could spread across the market, forcing the coin’s price to plummet further.\n\nEthereum ETH Support and Resistance Price Levels\n\nSource: TradingView\n\nThe chart above reveals that bears dominate the ETH market, and if the selling pressure persists, Ether’s price could drop to the support region at $1,573. However, ETH could rebound toward the $1729 resistance if traders embark on massive accumulation around the $1,573 price level. The asset could breach the $1,729 resistance.\n\nMeanwhile, positive news in the ETH ecosystem could excite buyers, leading to increased buying pressure. Their actions could push ETH’s market value to the $1,927 resistance, yielding a remarkable return on investment to traders who placed buy orders at the $1,573 support region.\n\nEthereum Finally Launched the Much-Anticipated EELS\n\nAfter conducting over a year of research, the Ethereum Foundation has officially unveiled the Ethereum Execution Layer Specification (EELS). This release aims to streamline the development process for developers and replace the complex Yellow Paper.\n\nEELS offers a comprehensive protocol overview at every fork, including upcoming ones. This sets it apart from EIP, which primarily suggests alterations, and production clients, which often blend multiple branches into a single code pathway.\n\nThe Ethereum Foundation’s goal for EELS is to become the standard method for outlining the Core EIP, the primary resource EIP authors turn to when creating their proposal prototypes, and the ultimate reference point for understanding Ethereum’s functioning.\n\nEELS eliminates the need to decipher the Yellow Paper and then layer EIP on top of it. This simplification is intended to streamline the work of Core Developers on the ETH network.\n\nEELS integration can boost confidence among Ethereum developers, as it could enhance efficiency, scalability, and user-friendliness, attracting more DApps and smart contracts on the network.\n\nThis increased development activity can lead to a higher demand for ETH as gas fees are required to execute transactions and smart contracts, further increasing the price of ETH.\n\nSONIK Aims for the $1m mark\n\n>>>Visit Sonik Coin Presale<<<\n\nThe recently launched meme coin, Sonik Coin (SONIK), started its presale around mid-August and has already garnered over $900,000 in funding. This presale is scheduled to conclude in four days or when it reaches its maximum fundraising limit of $2.09 million.\n\nSonik Coin aspires to attain a market capitalization of $100 million in record time, drawing inspiration from the SEGA video game franchise, a multi-billion-dollar valuation.\n\nPassive Income Generation Through Staking\n\n>>>Visit Sonik Coin Presale<<<\n\nSonik Coin differentiates itself from other meme coins through its unique feature of offering staking rewards, with 40% of the total supply allocated for this purpose.\n\nAdditionally, the remaining 10% is allocated to its locked liquidity pool; this allocation is designed to minimize potential price fluctuations after the launch. Meanwhile, the remaining 10% is held securely to guarantee exchange liquidity.\n\nThe total supply of SONIK tokens is 299,792,458,000, symbolically matching the speed of light in meters per second, which is also rumored to be Sonic’s top speed.\n\nStaking SONIK offers an annual percentage yield (APY) of 73%. Approximately 32 billion tokens have already been committed to staking, which represents nearly 18% of the initial circulating supply of SONIK.\n\nCan Sonik Be The Next 50x Asset?\n\nPredicting the price performance of $SONIK is a complex task. Yet, there are positive signs, such as the rapid acquisition of over $900k worth of $SONIK tokens in its presale round, hinting at a promising future for this meme coin.\n\nSimilar meme coins have often generated significant returns, sometimes increasing value tenfold within a few weeks after launch. Insights from analysts like Jacob Crypto Bury suggest that $SONIK could follow in the footsteps of meme coins like $PEPE, $SPONGE, and $SHIB.\n\nNone of the mentioned coins had staking rewards, potentially setting $SONIK up for even greater success as investors lock up their tokens, reducing the available supply.\n\n$SONIK tokens are currently priced at just $0.000014, offering meme coin enthusiasts a chance to engage with the project in its initial phases before it becomes available on a decentralized exchange (DEX) after the presale ends.\n\nThe project has successfully gathered more than $920,000 in its token sale. Interested users can acquire $SONIK by visiting the presale website."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3LnNlY3VyaXRpZXMuaW8vdXMtY291cnQtc2NyYXBzLXVuaXN3YXAtbGF3c3VpdC1kZWNsYXJlcy1ldGhlcmV1bS1hLWNvbW1vZGl0eS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "US Court Scraps Uniswap Lawsuit, Declares Ethereum a Commodity - Securities.io",
        "content": "After digital asset manager Grayscale secured a win against the US Securities and Exchange Commission (SEC), now the leading decentralized crypto exchange (DEX) Uniswap has also bagged a victory.\n\nIn a Wednesday filing, a New York court dismissed a proposed class action lawsuit against Uniswap while classifying popular cryptocurrencies Ether (ETH) and Bitcoin (BTC) as “commodities.”\n\nUniswap is an Ethereum-based DEX that allows anyone to swap ERC20 tokens. Any token can be added to the DEX by funding it with an equivalent value of ETH and the ERC20 token being traded. Any ERC20 token can be listed on Uniswap, and there is no requirement for permission, with each one having its own liquidity pool.\n\nA report released by ​​the Multidisciplinary Digital Publishing Institute last year claimed that 97% of tokens on Uniswap were “rug pulls” and received pushback from the crypto community.\n\nThe platform charges a 0.3% fee for swapping tokens, which is split by liquidity providers proportional to their contribution to liquidity reserves.\n\nThe DEX was launched in Nov. 2018, but it didn't start gaining significant traction until 2020 as liquidity mining and yield farming platforms gained popularity. Around this time, Uniswap airdropped its governance token UNI to every wallet address that had interacted with the Uniswap protocol.\n\nUniswap released its V2 in May 2020, allowing for direct ERC20 to ERC20 swaps and added support for incompatible ERC20 tokens like stablecoin Tether (USDT) to make it more desirable to use. Then, in May 2021, Uniswap V3 was launched, which brought concentrated liquidity and multiple fee tiers.\n\nIn June 2023, Uniswap published the code for its next iteration, dubbed v4, which will feature limit orders, automated fee revenue compounding for liquidity providers, and customizable plugins. Uniswap v4 pools will also allow traders to execute large orders over time. Uniswap Labs plans to launch v4 after Ethereum's next major upgrade, Dencun.\n\nDuring the second quarter of 2023, Uniswap processed roughly $110 billion worth of trades, surpassing that of the biggest centralized crypto exchange (CEX) in the US, Coinbase, at $90 billion. Uniswap's quarterly spot volume first exceeded Coinbase in Q1, with the exchanges facilitating approximately $155 bln and $145 bln worth of trades, respectively.\n\nThe DEX (v1, v2, and v3 combined) had its highest monthly volume of 2023 in March at just above $70.80 billion and earned $74.26 million in fees, which has been continuously falling to record the lowest for the year at $22.90 bln and $34.27 mln respectively in August, according to DeFi Llama. Uniswap accounts for 64% of all DEX market share.\n\nClick here to learn all about investing in Uniswap (UNI).\n\nScam Token Issuers Real Defendants Not Uniswap\n\nIn April 2022, a group of investors filed a class action lawsuit against Uniswap, its creator and CEO Hayden Adams, foundation, and venture capital backers. This group was composed of six individuals who bought tokens between Dec. 2020 and March 2022 on Uniswap.\n\nThe lawsuit alleged that the decentralized finance (DeFi) platform violated US securities laws by failing to register as an exchange or broker-dealer while offering and soliciting securities on an unregistered exchange. This way, the class action lawsuit alleged that the protocol conducted securities sales disguised as digital tokens.\n\nThe suit was looking to hold the platform and the related parties accountable for investors losing money to “scam tokens” that were issued and traded on Uniswap. The “scam tokens' cited in the lawsuit included EthereumMax (EMAX), Alphawolf Finance (AWF), and Bezoge (BEZOGE).\n\nArguing on behalf of a “nationwide class of users,” the lawsuit alleged that Uniswap Labs controlled liquidity pools created by the scammers.\n\nAccording to the plaintiffs, their claim was backed up by the fact that Uniswap held “liquidity provider funds and newly created tokens in Uniswap's proprietary core contracts,” and the defendants “likely” held the majority (at least 88%) of the UNI tokens.\n\nBut the ruling to scrap the lawsuit before it could go to trial said that the true defendants of the case were the issuers of the cited “scam tokens” and not Uniswap. Being a decentralized platform means the protocol cannot control which tokens are listed or who can interact with it.\n\nIn the opinion following Wednesday's order, Judge Katherine Polk Failla of the United States District Court for the Southern District of New York (SDNY) said the decentralized nature of the protocol made identifying scam token issuers “unknown and unknowable,” leaving no “identifiable defendant” in the case.\n\nShe then clarified that the plaintiffs argue they have no way to identify the “actual issuers” of the scam tokens. They claim that Uniswap, by “providing a marketplace and facilities for bringing together buyers and sellers of securities” for a fee, is complicit in the problematic trades. Therefore, they hope the Court might overlook the regulatory gaps in cryptocurrency that leave them without recourse for their specific claims in this case.\n\nA Huge Win for the DeFi Industry\n\nThe case against Uniswap was built on the transfer of title theory, under which the plaintiffs argued that by writing and maintaining the smart contracts that enabled token transactions, Uniswap was effectively transferring the title of the tokens to them. However, the court dismissed this argument, which stated that the protocol's responsibilities in drafting the platform's contracts did not imply it had the title to the tokens traded on the platform.\n\nAnother theory the case was built on was solicitation, which accused Uniswap of directly promoting and soliciting tokens to the plaintiffs in order to increase the value of its native UNI token. However, the court found this theory implausible, which said the plaintiffs failed to provide any substantial evidence to prove that Uniswap had actively solicited the purchase of a security for financial profit.\n\nThe judge also said that the drafter of computer code underlying a particular software platform could not be liable for a third party's misuse of that platform.\n\nAs for plaintiffs' argument that Uniswap was like a self-driving car manufacturer and that the protocol and its creators caused harm by creating a system that allowed for scam tokens, the court stated: “Indeed, this is less like a manufacturing defect, and more like a suit attempting to hold an application like Venmo or Zelle liable for a drug deal that used the platform to facilitate a fund transfer.”\n\nNoting the lack of clarity surrounding how securities laws apply to DeFi, Judge Falia said, “Whatever concerns DeFi transactions engender, the law is currently developing around these exchanges,” she wrote. “Regulators may someday address this gray area.”\n\nShe further called out the lack of relevant regulation and concluded that the concerns of the investors “are better addressed to Congress than to this Court.”\n\nShe also cited the unsuccessful class action brought against Coinbase last year for unregulated securities sales in her reasoning. The case has been dismissed with prejudice and, hence, cannot be retried.\n\nIn the ruling, Judge Polk Failla called Ethereum a commodity and declined to “stretch the federal securities laws to cover the conduct alleged” in the case against Uniswap. This is in direct contrast to the SEC chairman Gary Gensler's views, who has called all cryptocurrencies except Bitcoin a security.\n\nThe court's opinion on its dismissal of the class action suit is yet another huge win for the crypto market as it clarifies just how US securities law applies to DeFi. Moreover, the decision showed an understanding of DeFi.\n\nNot to mention, this decision can influence future litigations against decentralized protocols. Crypto lawyers can further use this case as a precedent to defend DeFi applications (DApps) against similar accusations in the future.\n\nThis could empower other DeFi projects to leverage their distributed nature as a defense against allegations of regulatory non-compliance or illegal activities. The dismissal further highlights the challenges regulators face in overseeing the rapidly evolving cryptocurrency industry, particularly in the DeFi space, where traditional regulations may not apply seamlessly.\n\nThis comes only a week after the arrest of Roman Storm, founder of Tornado Cash, who is now out on bail. However, the crypto community is still concerned about attacks on decentralized software development.\n\nAnd it only shows that crypto and DeFi continue to face significant regulatory hurdles in the US. For example, just last week, the Internal Revenue Service (IRS) proposed legislation requiring DEXs, NFTs marketplaces, and other entities facilitating digital asset trading to comply with stringent reporting requirements when serving users based in the US.\n\nThis context of evolving regulation makes individual cases against crypto companies especially significant. One such noteworthy case is overseen by Judge Polk Failla, who is also handling the SEC lawsuit against the publicly traded crypto exchange Coinbase (COIN), accusing it of facilitating trading of unlicensed securities.\n\n\n\nImpact on Price: Crypto Assets in a Decline Still\n\nDespite this win, the price of the 22nd largest cryptocurrency with a market cap of $3.3 bln UNI has fallen 6% in the past 24 hours to now trade at $4.39. The altcoin is down 30.4% in the past month and more than 15% in 2023 so far.\n\nUNI is also recording a negative performance of 27.5% over the past year while being down 90.27% from its all-time high (ATH), according to CoinGecko.\n\nThese latest losses for UNI have actually been due to Bitcoin taking a dip and being back under $26K.\n\nAt the time of writing, the largest cryptocurrency by market cap has been trading at $26,029, while Ether has been exchanging hands at $1,646. With this, Bitcoin and Ether are up 57.2% and 37.65% year-to-date (YTD) while being down 62.32% and 66.3% from their respective peaks.\n\nToday, the broad crypto space is in red, with the total cryptocurrency market cap down by 3.6% at $1.087 trillion.\n\nThe drawback in prices came after Bitcoin spiked to a high of $28,127 on Tuesday following investment fund manager Grayscale's court victory over the SEC in the crypto company's bid for a spot bitcoin ETF.\n\nA federal court ruled that the SEC must review its rejection of Grayscale's attempt to convert the Grayscale Bitcoin Trust (GBTC) into an ETF. This potentially opens the door for a spot Bitcoin ETF in the US.\n\nA spot Bitcoin ETF is expected to enable greater public interest in investing in the oldest crypto asset without having to actually hold the digital asset. But the SEC has disapproved every such ETF application it's reviewed to date.\n\nNow, earlier this week, Circuit Judge Neomi Rao, writing the DC Circuit Court of Appeals' opinion, said that federal agencies are required to “treat like cases alike,” referring to the SEC's approval of Bitcoin futures ETFs but denying approval of Grayscale's bitcoin fund “arbitrary and capricious.” The order, however, did not direct the SEC to immediately approve Grayscale's bid to convert its ETF application but rather to review the application again. The SEC has started “reviewing the court's decision to determine next steps.”\n\nThis resulted in the price of Bitcoin surging by 8%, one of the largest hourly moves since Terra's collapse last year, in part due to low liquidity. However, BTC has since given up all of those gains and returned to its pre-court decision level.\n\nBitcoin plunged under $26,000 Thursday afternoon and continues to show weakness on Friday, which will see the release of the monthly US jobs report, after the SEC delayed decisions on six applications for spot Bitcoin ETFs from BlackRock, WisdomTree, Invesco Galaxy, Wise Origin, VanEck, Bitwise, and Valkyrie Digital Assets.\n\nThe SEC has delayed making a decision on these applications until October. On Thursday, the Commission extended existing comment periods, allowing for greater public feedback on the applications. With this, the new deadline is mid-October.\n\nWhile the price dipped as decisions on applications got delayed, many have already been expecting a gradual sell-off in Bitcoin. While the approval of a Spot Bitcoin ETF will be bullish for BTC and the whole crypto market, until then, currently negative technicals and market fundamentals will be driving the price, which translates to the further downside over the next couple of months.\n\nClick here to learn all about buying Uniswap (UNI)."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi1ldGgtcHJpY2UtdG8taGl0LTE1MDAtc29vbi_SAVZodHRwczovL2NvaW5nYXBlLmNvbS9tYXJrZXRzL2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tZXRoLXByaWNlLXRvLWhpdC0xNTAwLXNvb24vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction: ETH Price to Hit $1500 if Buyers Lose this Key Support - CoinGape",
        "content": "During the aggressive sell-off in mid-August, the Ethereum price showed a bearish breakdown from the support trendline of the channel pattern. Losing the support which carried a bullish trend for nine months, reflects this coin is at risk of an extended correction. However, the falling price halted at 200 EMA slope around $1620 reflecting the buyers’ push to hold higher prices. Will this support bolster the continuation of the prior downtrend?\n\nAlso Read: End Of “Goerli” As Ethereum Clients Release Updates For Holesky Testnet\n\nadvertisement\n\nEthereum Daily Chart: Key Points\n\nThe Ethereum price may remain at risk of longer correction if the ETH price is unable to rebound from 200 weekly EMA\n\nA breakdown below 200 EMA will trigger a sharp 10% drop in the near term\n\nThe intraday trading volume in Ether is $4.8 Billion, indicating a 30% loss.\n\nSource- Tradingview\n\nDespite a high momentum breakdown from the channel pattern, the ETH sellers failed to offer a suitable follow up reflecting a lack of conviction in bears. Moreover, the weekly chart showed long-wick rejection candles at 200-day EMA as a sign of active accumulation.\n\nThe 200-day EMA is an important technical tool that segregates between the bullish or bearish sentiment in the market. Historically, this EMA slope has acted as major support or resistance and an important turning point in the market.\n\nConsidering the bearish momentum in the market, the Ether price should give a weekly candle closing above the aforementioned support to get a better confirmation for downtrend continuation.\n\nThe post-break fall may have plunged the price to $1500, followed by $1366.\n\nHere’s how ETH Price may restore a bullish trend.\n\nWhile the bearish momentum seems valid for the ETH price, the increasing demand pressure at EMA support could offer a significant bounceback. However, the potential upswing must surpass the aforementioned breakdown high of $1800 to get better confirmation of recovery.\n\nRelative Strength Index: A downtick in the daily RSI slope reflects the selling momentum is active.\n\nExponential Moving Average: A bearish crossover between the 20-and-50 weekly EMAs would bolster sellers for a prolonged downfall."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL3VucmF2ZWxpbmctcmFvdWwtcGFscy1hcHByb2FjaC10by1pbnZlc3RpbmctaW4tZXRoZXJldW0tYW5kLWJleW9uZC_SAWJodHRwczovL2NvaW5wZWRpYS5vcmcvbmV3cy91bnJhdmVsaW5nLXJhb3VsLXBhbHMtYXBwcm9hY2gtdG8taW52ZXN0aW5nLWluLWV0aGVyZXVtLWFuZC1iZXlvbmQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Sep 2023 07:00:00 GMT",
        "title": "Unraveling Raoul Pal’s Approach to Investing in Ethereum and Beyond - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nRenowned macro guru Raoul Pal expresses unwavering optimism in the face of lingering market uncertainties. Pal, a steadfast bull, maintains that his bullish stance, which he has held for an extended period, remains unshaken.\n\nWhen questioned about the foundation of his bullish outlook, Pal elucidated that he believes the much-anticipated recession, which had loomed ominously on the economic horizon, was largely factored into the market dynamics last year. According to him, the substantial downturns witnessed in equity markets and the cryptocurrency realm during that period were clear manifestations of this anticipatory pricing.\n\nRaoul Pal’s Unwavering Bullish Stance\n\nIn a recent interview with Crypto Banter, Pal reiterated his consistent perspective, asserting that the long-anticipated recession has already transpired and was duly assimilated by the markets in the preceding year.\n\nTo illustrate this point, he cited the substantial market fluctuations, including a precipitous 75% decline in cryptocurrencies and a 30-35% dip in stock values, as compelling evidence of the market’s proactive response to the impending economic cycle.\n\nPal expounded on how the market had preemptively adjusted to these anticipated changes in the prior year. Subsequently, it embarked on a path of anticipatory behavior, as evidenced by the discernible surge in liquidity since the month of June.\n\nDrawing from his forward-looking indicators, Pal revealed that liquidity had exhibited an upward trajectory since June of the preceding year. These indicators played a pivotal role in shaping his investment decisions, most notably in Ethereum, where he augmented his holdings during a significant market sell-off.\n\nContemplating the future landscape, Pal highlights that current data trends are now harmonizing with his forward-looking indicators. He emphasized that inflationary pressures are gradually receding, while unemployment figures are showing a gradual ascent. Furthermore, economic growth appears to be losing momentum. These unfolding trends, in Pal’s assessment, suggest that the Federal Reserve may, in due course, contemplate halting its ongoing rate hikes and, potentially, resort to rate cuts in a bid to sustain economic stability."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1zdGFraW5nLXNlcnZpY2VzLWFncmVlLXNlbGYtbGltaXQtdmFsaWRhdG9yc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Ethereum staking services agree to 22% limit of all validators - Cointelegraph",
        "content": "At least five Ethereum liquid staking providers have either imposed or are working to impose a self-limit rule in which they promise not to own more than 22% of the Ethereum staking market — seen as a move to ensure the Ethereum network remains decentralized.\n\nAmong the Ethereum staking providers either already committed or are working to commit to the self-limit rule include Rocket Pool, StakeWise, Stader Labs and Diva Staking, according to Ethereum core developer Superphiz.\n\nPuffer Finance, another liquid staking service, also announced its commitment to the self-limit.\n\nThese providers are committed (or are in the process of committing) to self-limit to @Rocket_Pool @stakewise_io @staderlabs @divastaking — superphiz.eth ️ (@superphiz) August 30, 2023\n\nThe proposal presumably aims to address concerns of Ethereum staking becoming increasingly centralized.\n\nAs to why the self-limit was proposed at 22%, Superphiz explained that because 66% of validators need to agree on the state of Ethereum, setting the limit below 22% means at least four major entities must collude in order for the chain to reach finalization.\n\nFinality is the point where transactions on a blockchain are considered immutable, supposedly ensuring that transactions within a block cannot be altered.\n\nThe idea was proposed by Superphiz in May 2022 when he questioned whether a staking pool would be willing to put the health of the chain before its own profits.\n\nInterestingly, the largest Ethereum liquid staking provider, Lido Finance, voted by a 99.81% majority not to self-limit back in June.\n\n“They have expressed an intention to control the majority of validators on the beacon chain,” Superphiz said in an Aug. 31 post.\n\nVotes casted from Lido (LDO) token holders on the self-limiting proposal. Source: Snapshot\n\nLido currently dominates the Ethereum staking market, accounting 32.4% of all staked Ether, while the next entity, Coinbase, accounts for only 8.7% of the market, according to data from Dune Analytics.\n\nEthereum stakers by staking amount and market share, showing that Lido is the only one above the 22% threshold. Source: Dune Analytics\n\nWho’s in the right? Mixed reactions from the Ethereum community\n\nOne industry pundit, “Mippo,” explained on Aug. 31 that the self-limit proposal has nothing to do with “Ethereum alignment” — a principle understood to enable credible neutrality and permissionless innovation on Ethereum.\n\nMippo claimed those trying to push the proposal wouldn’t make way if they were in Lido’s position.\n\nRelated: Ethereum is about to get crushed by liquid staking tokens\n\n“Everyone is doing the economically selfish and rational thing here,” Mippo concluded.\n\nYeah because they have way less market share than that now… easy to chirp from the cheap seats.\n\n\n\nThis has nothing to do with “Ethereum alignment.” None of these teams would self limit were they in Lido’s place.\n\n\n\nEveryone is doing the economically selfish and rational thing… — Mippo (@MikeIppolito_) August 31, 2023\n\n“Folks in the ETH community should not shame more user-friendly solutions as greedy products,” said another observer.\n\nHowever, others were more wary of the potential centralization issues at hand, describing Lido’s market share dominance as “disgusting and selfish.”\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: DeFi Dad, Hall of Flame: Ethereum is ‘woefully undervalued’ but growing more powerful"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2Fya2hhbS1pZGVudGlmaWVzLWdyYXlzY2FsZXMtZXRoZXJldW0tdHJ1c3QtYXMtc2Vjb25kLWxhcmdlc3QtZXRoLWhvbGRlci_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Arkham identifies Grayscale's Ethereum Trust as second-largest ETH holder - CryptoSlate",
        "content": "Arkham Intelligence identified Grayscale’s Ethereum Trust as the second-largest Ethereum (ETH) holder in a tweet on Sept. 1.\n\nThe company said that the trust is the “second largest ETH entity globally” and that the fund contains $5 billion of ETH (seemingly rounding up from $4.9 billion).\n\nAkrham said those funds are divided across more than 500 addresses, each containing $30 million or less. Arkham said it identified those addresses by analyzing activity and cross-referencing with balances that Grayscale reported publicly.\n\nThough Arkham claims that these holdings have never been identified, Grayscale’s own website reveals that its Ethereum Trust has nearly $5.0 billion in assets under management. As such, it seems that Arkham is the first to identify the particular addresses tied to the fund and not the first to discover the fund’s balance.\n\nNotably, there appears to be a significant discrepancy between Arkham’s data and Grayscale’s own reports regarding its other crypto funds. While Grayscale says its Bitcoin Trust holds $16.3 billion, Arkham reports that Grayscale has only $92.1 million in Bitcoin holdings. Various other cryptocurrency assets are also listed on Arkham’s profile for Grayscale.\n\nArkham previously identified Robinhood as the holder of the third-largest Bitcoin wallet (holding $3 billion) and the fifth-largest Ethereum wallet (containing $2.5 billion). Unlike those discoveries, the findings about Grayscale do not concern a single crypto wallet.\n\nNews comes alongside court victory\n\nGrayscale obtained a legal victory on Aug. 29 as courts overruled an earlier rejection from the U.S. Securities and Exchange Commission (SEC). The current legal outcome will require the SEC to review, but not necessarily approve, Grayscale’s proposal for converting its GBTC fund to a spot Bitcoin ETF.\n\nGrayscale seemingly abandoned plans to create an Ethereum futures ETF in May, according to reports from Bloomberg at that time."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOS8wMi9vbmUtdG9wLTMwLWV0aGVyZXVtLWJhc2VkLWFsdGNvaW4tc2lnbmFsaW5nLWEtcG90ZW50aWFsLXJhbGx5LXNheXMtY3J5cHRvLWFuYWx5dGljcy1maXJtLWJ1dC10aGVyZXMtYS1jYXRjaC_SAZEBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDkvMDIvb25lLXRvcC0zMC1ldGhlcmV1bS1iYXNlZC1hbHRjb2luLXNpZ25hbGluZy1hLXBvdGVudGlhbC1yYWxseS1zYXlzLWNyeXB0by1hbmFseXRpY3MtZmlybS1idXQtdGhlcmVzLWEtY2F0Y2gvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Sep 2023 07:00:00 GMT",
        "title": "One Top-30 Ethereum-Based Altcoin Signaling a Potential Rally, Says Crypto Analytics Firm – But There’s a Catch - The Daily Hodl",
        "content": "A blue-chip Ethereum (ETH)-based altcoin is showing signs of a potential rally, according to the crypto analytics platform Santiment.\n\nPer Santiment, various metrics are signaling that the native token of the blockchain oracle Chainlink (LINK) could surge, though the prediction is dependent on the behavior of Bitcoin (BTC) and the wider crypto market.\n\n“Chainlink has hit a key level that has historically foreshadowed a price rebound. Presuming Bitcoin and the overall crypto sector stays relatively stable, LINK’s drop in exchange supply (currently just 15.5%) is hinting at a bullish divergence.”\n\nLINK is trading at $6.00 at time of writing.\n\nTurning to the governance token of the decentralized finance (DeFi) protocol Maker (MKR), Santiment says that whales and sharks have accumulated over $71 million worth of the crypto asset since July 9th.\n\n“Maker has enjoyed a nice +12% day while the rest of crypto slumps. This can largely be attributed to the accumulation by the whales and sharks holding between $11,600 to $11.6 million [in] MKR. Their holdings will continue to correlate with future price movement.”\n\nMKR is trading at $1,155 at time of writing.\n\nOn Bitcoin Cash (BCH), Santiment says,\n\n“Bitcoin Cash enjoyed a healthy price rebound, currently back at $214 after being as low as $180 just two weeks ago. Short and long-term traders are both in profit for the first time since mid-June, and whales will be key to a further surge.”\n\nBCH is trading at $206 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Tithi Luadthong"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOS8wMi9vdmVyLTkwLW9mLWNhcmRhbm8tcG9seWdvbi1hbmQtb25lLWV0aGVyZXVtLXJpdmFscy1ob2xkZXJzLWFyZS11bmRlcndhdGVyLWFuYWx5dGljcy1maXJtLWludG90aGVibG9jay_SAYsBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDkvMDIvb3Zlci05MC1vZi1jYXJkYW5vLXBvbHlnb24tYW5kLW9uZS1ldGhlcmV1bS1yaXZhbHMtaG9sZGVycy1hcmUtdW5kZXJ3YXRlci1hbmFseXRpY3MtZmlybS1pbnRvdGhlYmxvY2svYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Sep 2023 07:00:00 GMT",
        "title": "Over 90% of Cardano, Polygon and One Ethereum Rival’s Holders Are Underwater: Analytics Firm IntoTheBlock - The Daily Hodl",
        "content": "A leading blockchain analytics firm says that a huge percentage of Cardano (ADA) and Polygon (MATIC) holders are underwater.\n\nAccording to IntoTheBlock, 94% of the holders of Ethereum (ETH) competitor Cardano are sitting on losses, just 5% are profitable and 1% are breaking even.\n\nCardano is trading for $0.25 at time of writing, down 91.73% from its all-time high of $3.09 which it hit on September 2nd, 2021.\n\nAccording to the analytics firm, 95% of the holders of the Ethereum scaling solution Polygon are at a loss, 4% are profitable and 1% are breaking even.\n\nPolygon is worth $0.54 at time of writing, down 81.48% from its all-time high of $2.92 recorded on December 27th, 2021.\n\nNearly all the holders of ETH rival Avalanche (AVAX) are at a loss, according to IntotheBlock.\n\nSome 99% of AVAX holders are underwater and 1% are breaking even.\n\nAvalanche is trading for $9.92 at time of writing, down 93.16% from its all-time high of $144.96 printed on November 21st, 2021.\n\nOther crypto projects that have a huge number of their investors seeing red include the layer-2 scaling solution Arbitrum (ARB), blockchain-based game Axie Infinity (AXS), fan-focused crypto project Chiliz (CHZ), native token of the Bored Ape Yacht Club ApeCoin (APE), decentralized virtual world The Sandbox (SAND) and proof-of-stake protocol Algorand (ALGO).\n\nAccording to IntoTheBlock, 100% of the holders of Arbitrum, Axie Infinity, ApeCoin and Algorand are all underwater.\n\nArbitrum is trading for $0.88 at the of writing, down 89.80% from its all-time high of $8.67 registered on March 23rd, 2023.\n\nAxie Infinity is worth $4.49 at time of writing, down 97.27% from its all-time high of $164.90 which it hit on November 6th, 2021.\n\nApeCoin is trading for $1.39 at time of writing, down 94.79% from its all-time high of $26.70 reached on April 28th, 2022.\n\nAlgorand is worth $0.0917 at time of writing, down 97.42% from its all-time high of $3.56 recorded on June 20th, 2019.\n\nAccording to the analytics firm, 95% of Chiliz holders are sitting on losses while 3% are profitable and 2% are at even money.\n\nChiliz is trading for $0.0599 at time of writing, down 93.19% from its all-time high of $0.878 printed on March 13th, 2021.\n\nMeanwhile, IntoTheBlock reveals that 98% of The Sandbox holders are in the red while 2% are sitting on profits.\n\nAt time of writing, The Sandbox is worth $0.30, down 96.37% from its all-time high of $8.40 which it hit on November 25th, 2021.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Quardia/Mingirov Yuriy/Sensvector"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9wb2x5Z29uLWNoYWluLWRldmVsb3BtZW50LWtpdC1vcGVuc291cmNl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Polygon's new open-source L2 chain developer stack to support Ethereum ZK-powered layer 2s - Cointelegraph",
        "content": "The Ethereum ecosystem could welcome a variety of new layer 2 (L2) protocols built on Polygon’s newly released open-source codebase, Chain Development Kit, which harnesses zero-knowledge proof (ZK-proof) technology to ensure security and fast finality.\n\nJordi Baylina, co-founder and technical lead for Polygon, spoke to Cointelegraph exclusively about the new toolset, which is publicly available on a GitHub repository:\n\n“The motivating idea is simple: It should be easy and seamless for developers to launch a ZK-powered layer 2 on Ethereum, tailored to the requirements of their project.”\n\nAccording to Baylina, a key aspect is that Polygon CDK enables automatic access to liquidity across all of Polygon’s chains as well as the wider Ethereum ecosystem, providing “on-demand scale, without fragmenting liquidity.”\n\nThe Ethereum developer pointed to a number of different projects building CDK-powered chains across a variety of use cases, including payment-specific L2s, decentralized finance, gaming, social-specific platforms, and creator or nonfungible token platforms.\n\nRelated: Are ZK-proofs the answer to Bitcoin’s Ordinal and BRC-20 problem?\n\nBaylina also highlighted the customizability of CDK for different appchains, featuring customizations for rollup or validium mode, zkEVM or another ZK-powered execution environment, various data availability solutions, native token and gas token customization, centralized or decentralized sequencer mode as well as permissioned networks with granular allowlists.\n\nThe importance of ZK-proof technology is another factor Baylina stressed, highlighting Polygon Labs’ belief that zero-knowledge is the future of scaling Ethereum. As the Hermez zkEVM lead explains, chains launched with Polygon CDK are automatically connected to a shared ZK bridge and plugged into an “interop layer,” which is a cross-chain communication protocol.\n\n“Suppose there are thousands of chains in the Polygon ecosystem. It’s inefficient for each of these to submit their proofs directly to Ethereum. Instead, the interop layer will receive proofs from chains and submit a single ZK-proof that proves the state of all Polygon chains.”\n\nBaylina said the technology unlocks sub-minute cross-chain transactions and creates the perception of a single-chain environment.\n\nCointelegraph also asked about the key differences between CDK and other Ethereum ecosystem programming languages like ZK-proof pioneer StarkWare’s Cairo codebase.\n\nBaylina explained that the architecture unlocked by Polygon CDK is different in that it enables automatic access to shared liquidity through a ZK bridge and interop layer of an L2 ecosystem secured by working ZK-proofs.\n\nHe finished by reaffirming the belief in ZK-proofs as the future of Ethereum scalability given its fast finality and withdrawal times, when compared with week-long delays by fraud proofs that feature in optimistic rollup L2 solutions.\n\n“ZK makes better bridges but also secures chains by rigorous math, without a need for social-economic components required by fraud proofs.”\n\nCointelegraph previously explored the Ethereum layer-2 ecosystem, unpacking the basics of Ethereum rollups and the different approaches to scaling the smart contract blockchain.\n\nMagazine: Recursive inscriptions: Bitcoin ‘supercomputer’ and BTC DeFi coming soon"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOS8wMS90cmFkZXItc2F5cy1ldGhlcmV1bS1iYXNlZC1hbHRjb2luLWNvdWxkLWNyYXNoLWJ5LXVwLXRvLTUwLXVwZGF0ZXMtb3V0bG9vay1vbi1iaXRjb2luLWJ0Yy1hbmQtb3B0aW1pc20tb3Av0gGPAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA5LzAxL3RyYWRlci1zYXlzLWV0aGVyZXVtLWJhc2VkLWFsdGNvaW4tY291bGQtY3Jhc2gtYnktdXAtdG8tNTAtdXBkYXRlcy1vdXRsb29rLW9uLWJpdGNvaW4tYnRjLWFuZC1vcHRpbWlzbS1vcC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Trader Says Ethereum-Based Altcoin Could Crash by Up to 50%, Updates Outlook on Bitcoin (BTC) and Optimism (OP) - The Daily Hodl",
        "content": "A widely followed crypto analyst says that one mid-cap altcoin could see a massive correction as whale transactions including the asset see a decline.\n\nCrypto trader Ali Martinez tells his 29,900 followers on the social media platform X that blockchain oracle provider Chainlink (LINK) could dip by as much as 50% from its current price.\n\n“Chainlink: unlike the June LINK price correction – where whale transactions and their holdings rose as prices fell – this time, we’re seeing whale transactions decline while their holdings stay steady.\n\nThis isn’t good! If LINK breaks below the $5 support level, expect a correction to $4 or even $3.”\n\nAccording to his chart, whale transactions of at least $1 million in LINK since May 19th reached a daily high of about 20 in late July. In the final days of August, transactions declined to under 10 and were nearly nonexistent on August 31st. A dip in whale transactions is a bearish sign indicating a lack of trading interest.\n\nChainlink is currently trading for $5.98, down 0.1% in the last 24 hours.\n\nNext, the analyst says that Bitcoin (BTC) could decline 10% from its current value if it loses a key support level.\n\n“Bitcoin: On-chain data suggests that BTC lacks strong support below the $25,400 mark.\n\nIf BTC breaks below this threshold, it could swiftly correct down to $23,340.”\n\nBitcoin is trading for $25,827 at time of writing, down 4.7% in the last 24 hours.\n\nLastly, the analyst is warning that Ethereum (ETH) layer-2 blockchain Optimism (OP) is trading in a bearish flag pattern, suggesting that it is on the verge of a continued move to the downside.\n\n“Optimism appears less than optimistic! OP is developing a bear flag on the 4-hour chart.”\n\nThe trader’s chart suggests Optimism could decline to $0.71 over the next two months, a more than 47% drop from its current price of $1.35 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/SVPanteon/David Sandron"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA5LzAxL3doYWxlcy1tb3ZlLW92ZXItNzMwMDAwMDAwLWluLWJpdGNvaW4tZXRoZXJldW0tYW5kLXhycC1oZXJlcy13aGVyZS10aGUtY3J5cHRvcy1oZWFkZWQv0gF7aHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDkvMDEvd2hhbGVzLW1vdmUtb3Zlci03MzAwMDAwMDAtaW4tYml0Y29pbi1ldGhlcmV1bS1hbmQteHJwLWhlcmVzLXdoZXJlLXRoZS1jcnlwdG9zLWhlYWRlZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Whales Move Over $730,000,000 in Bitcoin, Ethereum and XRP – Here’s Where the Crypto’s Headed - The Daily Hodl",
        "content": "Deep-pocketed crypto investors are moving hundreds of millions of dollars worth of digital assets into and from centralized crypto exchange platforms as the king crypto falls below $26,000.\n\nNew data from whale-surveying platform Whale Alert reveals that high-net-worth traders have abruptly shifted over $730 million worth of Bitcoin (BTC), Ethereum (ETH), and XRP, the majority of them moving into or out of prominent crypto exchanges such as Binance, Coinbase, and Kraken.\n\nThe BTC transactions on Whale Alert’s radar, which total to about $458 million, include:\n\nBitcoin is trading for $25,851 at time of writing, a 4.8% decrease during the last 24 hours.\n\nMoving on to XRP, the digital asset associated with Ripple Labs’ payments platform, Whale Alert finds about $240 million worth of movement. XRP transactions noticed by the whale-watching blockchain tracker include:\n\nXRP is trading for $0.50 at time of writing, a 2.89% decrease during the last day.\n\nLastly, Whale Alert finds that an ETH whale suddenly transferred 21,240 ETH worth $34,965,976 USD from an unknown wallet to Coinbase.\n\nEthereum is moving for $1,631 at time of writing, a 3% dip on the day.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/IgorZh"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3QvZXhwbG9yaW5nLXN0YXJrbmV0LXRoZS1yaXNpbmctc3Rhci1vZi1sYXllci0yLXNvbHV0aW9ucy1mb3ItZXRoZXJldW3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Exploring Starknet: The Rising Star of Layer 2 Solutions for Ethereum - BSC NEWS",
        "content": "In this guest article from Footprint Analytics, we delve deep into Ethereum layer-2 contender, Starknet. What is Starknet and what does it have to offer?\n\nThank you to Footprint Analytics, for submitting this guest article.\n\nThe blockchain trilemma, or the scalability trilemma, highlights the challenge of balancing security, decentralization, and scalability in blockchain platforms. Typically, blockchain architecture can only prioritize two out of the three pillars effectively. Ethereum, for instance, has prioritized security and decentralization, resulting in scalability challenges. However, the Ethereum community recognizes the importance of scalability and has been actively working on solutions to address this issue.\n\nWhen discussing scaling solutions for Ethereum, the focus is primarily on layer 2 solutions that aim to address the limitations of layer 1 blockchains. These layer 2 solutions aim to increase transaction throughput without compromising decentralization or security. There are several existing layer 2 solutions for Ethereum, including rollups, state channels, and nested blockchains.\n\nRollups\n\nRollups are layer 2 solutions that aggregate numerous transactions into a single transaction on layer 1, resulting in cost savings for users by distributing transaction fees across participants within the rollup. There are two main types of rollups: optimistic rollups and zero-knowledge rollups (ZK-rollups). Optimistic rollups utilize fraud proofs to ensure the validity of off-chain transactions, while ZK-rollups employ zero-knowledge proofs to enhance privacy and security. Examples of optimistic rollups include Optimism, Arbitrum, and Boba Network. On the other hand, ZK-rollup implementations include Starknet, zkSync, and Scroll.\n\nIn this article, we will examine Starknet, an innovative layer 2 solution that incorporates ZK-rollup technology.\n\nStarknet: What & Why?\n\nEli Ben-Sasson, the co-founder of STARK and ZCash, established StarkWare in January 2018 with the aim of enhancing blockchain scalability and privacy. StarkWare achieves this by leveraging STARK technology, a cryptographic proof system, to deploy and verify zero-knowledge proofs.\n\nOne notable product of StarkWare is Starknet, a permissionless ZK-rollup solution that enables general computation. Currently operating as a layer 2 network on top of Ethereum, Starknet ensures eventual layer 1 security through the utilization of STARK technology. Starknet achieves scalability by generating STARK proofs off-chain, which are then validated on-chain, allowing for increased transaction throughput and efficiency.\n\nPositive Trends\n\nStarknet is gaining popularity within the StarkWare ecosystem and is also attracting attention from the broader community.\n\nStarknet has experienced significant growth in daily active accounts since March 2023. As of August 26, 2023, the number of daily active accounts reached 161,252, indicating a steady increase in user engagement. This upward trend suggests a growing interest in Starknet and its capabilities as a layer 2 solution. It signifies a rising number of users actively participating in transactions, interactions, and dApps built on the Starknet ecosystem.\n\nNotably, the platform witnessed a peak of 384,447 daily active accounts on July 28, 2023. This surge in user activity can be attributed to the launch of a special NFT called SPOK (Starknet Proof-of-Kudos) on Unframed, the NFT marketplace for Starknet. The introduction of this unique NFT through an open and free minting event generated significant interest and engagement within the community. According to Footprint Analytics, an impressive 76.4% of active accounts interacted with the SPOK contract on that particular day, further highlighting the enthusiasm surrounding the event and the appeal of Starknet's NFT ecosystem.\n\nStarknet has witnessed a substantial increase in daily transactions since March 2023, indicating a growing volume of activity on the platform. On August 26, 2023, the number of daily transactions reached 598.2K, showcasing a significant surge in user interactions and engagement. Notably, the platform experienced a peak in daily transactions on July 28, 2023, with a total of 560.44K transactions. This surge in transactions was primarily driven by the launch of the SPOK NFT.\n\nTransaction fees on Starknet have also shown fluctuations during this period. On May 9, 2023, the platform experienced a peak in transaction fees, reaching 177.84 ETH. This indicates a higher demand for transaction processing and a willingness to pay higher fees for faster and more secure transactions. However, on August 26, 2023, transaction fees decreased to 73.36 ETH. This reduction in fees could be attributed to various factors, such as optimizations in the protocol, increased competition among validators, or changes in user behavior.\n\nAccording to Footprint Analytics, as of August 26, 2023, the total transactions were 32,788.39K, while the total transaction fee was 8,963.15 ETH. The growth in daily transactions and the fluctuations in transaction fees on Starknet highlight the platform's ability to handle increased user activity while maintaining cost-efficiency. As more users and dApps adopt Starknet, it is expected that transaction volumes will continue to rise, and transaction fees may vary based on market dynamics and network optimizations.\n\nStarknet has experienced a significant increase in the daily amount of ETH bridged since March 2023. On August 12, 2023, the daily amount bridged reached its peak at 12,570.13 ETH, coinciding with 7,397 active users. On August 26, 2023, when the number of active users peaked at 15,110, the daily amount bridged reached 6,622.88 ETH. This significant surge in bridged value suggests an increased level of trust and confidence in Starknet as a reliable and secure platform for transferring and storing ETH.\n\nKey Features\n\nStarknet offers several advantages as a layer 2 solution.\n\nFirstly, it ensures faster transaction finality by approving state updates once validity proofs are verified in layer 1. This means that transactions can be confirmed quickly and securely, enhancing the overall user experience.\n\nAdditionally, Starknet leverages layer 1 data storage, guaranteeing the security, censorship resistance, and decentralization of critical information. By storing the off-chain state recovery data in layer 1, Starknet ensures that users' data remains protected and accessible.\n\nFurthermore, Starknet provides capital efficiency and withdrawal flexibility to users. With the ability to withdraw funds from layer 2 without delays, users have greater control over their assets, which can drive widespread adoption of the platform.\n\nHowever, there are a few limitations to consider.\n\nStarknet's native programming language, Cairo, can pose a barrier for dApp developers who are accustomed to languages like Solidity. While efforts are underway to enable compatibility between Solidity and Cairo through the transpiler Warp, the learning curve associated with a new language may slow down development in the ecosystem.\n\nAdditionally, Starknet is not fully EVM-compatible, which means that synchronization with EVM updates will be required, potentially adding complexity to the development process.\n\nLastly, the production of validity proofs on Starknet requires specialized hardware, which may lead to centralized control and a limited number of participants capable of advancing the chain. This could increase the risk of malicious operators freezing the rollup's state and censoring users, highlighting the need for careful consideration of the network's governance and security mechanisms.\n\nEcosystem\n\nOne of the key advantages of Starknet is its ability to provide high throughput, low transaction costs, and privacy protection. These features make Starknet highly versatile and open up a wide range of application prospects in various areas, including GameFi, NFT, and DeFi.\n\nStarknet has positioned itself as a prominent supporter of fully on-chain games within the realm of public chains. The platform hosts a variety of highly popular and engaging fully on-chain games, including LootRealms, GOL2, Isaac, Unstoppable Games, and more. These games have garnered significant attention and have become a source of excitement and entertainment for users within the Starknet ecosystem.\n\nHere are some notable projects within the Starknet ecosystem to keep an eye on. NFT projects include Starknet Quest, Starknet.id, AlmanacNFT, and Comoco, while DeFi projects include JediSwap, Nostra, zkLend, Brine, and StarkEx. They demonstrate the potential for innovation and growth within the Starknet ecosystem.\n\n$STARK & Starknet Airdrop\n\n\n\nIn November 2022, Starknet introduced its native token, $STARK, on the Ethereum blockchain. These tokens were initially distributed among shareholders, employees, and independent partner software developers. However, these tokens are subject to a lock-up period of four years, with a gradual release scheduled to commence in November 2023.\n\nStarknet has been generating considerable buzz in the crypto community due to its upcoming token airdrop. The highly anticipated airdrop has sparked a surge in user engagement and activity on the platform since July 2023.\n\n‍\n\nAccording to Footprint Analytics, The monthly amount bridged in ETH on Starknet has shown significant growth since July 2023. In March, with 139,823 unique users, the monthly amount bridged reached 16,374.83 ETH. By August (up until August 26), the number of unique users on Starknet increased to 156,332. During this period, the monthly amount bridged rose substantially to 148,316.71 ETH.\n\nStarknet has gained attention for its inclusive approach to allocating tokens to community members. If the airdrop takes place, it is expected to be distributed to individuals who have actively engaged with the Starknet ecosystem. This may include users who have created a Starknet wallet, bridged assets to Starknet, utilized Starknet dApps and participated in Starknet governance.\n\nConclusion\n\nIn conclusion, Starknet is experiencing significant growth and positive trends, which indicate increasing user engagement, adoption, and trust in Starknet as a scalable and efficient layer 2 solution for Ethereum.\n\nVitalik Buterin projected that ZK-rollups would win the layer 2 scaling warfare against optimistic rollups during ETH Seoul 2022. With its promising features and capabilities, Starknet holds the potential to shape the destiny of Ethereum and solidify its position as a leading ZK-rollup platform. It’s indeed worthwhile to look ahead with anticipation and enthusiasm for the transformative influence that Starknet can bring to the blockchain ecosystem.\n\nWhat is Footprint Analytics?\n\nFootprint Analytics is a blockchain data solutions provider. It leverages cutting-edge AI technology to help analysts, builders, and investors turn blockchain data and combine Web2 data into insights with accessible visualization tools and a powerful multi-chain API across 20+ chains for NFTs, GameFi, and DeFi.\n\nFootprint Website: https://www.footprint.network\n\nDiscord: https://discord.gg/3HYaR6USM7\n\nTwitter: https://twitter.com/Footprint_Data"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9ldGgtcGx1bmdlZC10by1wcmUtZ3JheXNjYWxlLWxldmVscy1hdC1hLWNyaXRpY2FsLXBvaW50LW5vdy1ldGhlcmV1bS1wcmljZS1hbmFseXNpcy_SAXFodHRwczovL2NyeXB0b3BvdGF0by5jb20vZXRoLXBsdW5nZWQtdG8tcHJlLWdyYXlzY2FsZS1sZXZlbHMtYXQtYS1jcml0aWNhbC1wb2ludC1ub3ctZXRoZXJldW0tcHJpY2UtYW5hbHlzaXMvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "ETH Plunged to Pre-Grayscale Levels, At a Critical Point Now: Ethereum Price Analysis - CryptoPotato",
        "content": "The crypto markets suffered hard over the past 24 hours. From a technical analysis standpoint on higher timeframes, Ethereum’s price seems willing to drop further, as things still look bearish.\n\nTechnical Analysis\n\nBy Edris\n\nThe Daily Chart\n\nOn the daily chart, the price was able to retest the critical $1,750 level but has failed to maintain above it, getting heavily rejected to the downside. If ETH breaks below the short-term $1,650 support level, it will lead to a deeper drop toward the $1,400 area.\n\nMoreover, the 50-day and 200-day moving averages are about to go through a bearish crossover, with the 50-day crossing the 200-day to the downside (Death Cross). This is considered a very negative signal and could mark the beginning of another mid-term bearish phase.\n\nThe 4-Hour Chart\n\nLooking at the 4-hour timeframe, it is evident that the $1,750 resistance zone has rejected the price to the downside, pushing it back toward the $1,650 support level. The market is yet to show any intention for a rebound from the mentioned support area, as it is trying to break through it.\n\nThe RSI indicator has also dropped below the 50% threshold, indicating that the bears are now in control. Therefore, if ETH fails to hold above the $1,650 level and reclaim the $1,750 area quickly, a further decline would be imminent.\n\nOn-Chain Analysis\n\nBy: Edris\n\nEthereum Taker Buy Sell Ratio\n\nFollowing weeks of consolidation in a tight range, Ethereum’s price has recently experienced a significant drop. Analyzing the futures market metrics would be beneficial in determining where the price is likely to go next.\n\nThis chart shows the 30-day standard moving average of the taker buy-sell ratio metric. The metric indicates whether buyers or sellers are executing their orders more aggressively. Values above one are considered bullish, while values at one are associated with a bearish sentiment.\n\nAs the chart demonstrates, the taker buy-sell ratio has decreased over the past few months, constantly dropping deeper below one. As long as this trend persists, bearish price action is more likely. For the price to start a new impulsive uptrend, futures traders should buy more aggressively (using market orders), as indicated by the metric rising above one."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZGVjcnlwdC5jby8xNTQ1NjUvYml0Y29pbi1ldGhlcmV1bS1kcm9wLXNlYy1kZWxheXMtZXRmLWRlY2lzaW9u0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin, Ethereum Drop After SEC Delays ETF Decision - Decrypt",
        "content": "Create an account to save your articles.\n\nCreate an account to save your articles.\n\nYour Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin briefly dropped below $26,000 early this morning as optimism around the approval of a Bitcoin ETF application was again delayed.\n\nYesterday, the SEC extended the deadline to approve or deny six ETF decisions by 45 days, citing the need for additional time to evaluate the applications.\n\nAD\n\nAD\n\nThe negative price movement over the past day reversed the bullish gains in BTC following the Grayscale court decision earlier this week.\n\nOn August 29, the U.S. Court of Appeals for the D.C. Circuit overturned the SEC’s decision to block Grayscale from converting its Bitcoin Trust (GBTC) to a spot Bitcoin ETF, ordering the Commission to review the application again.\n\nThe ruling raised hopes of imminent approval, pushing Bitcoin’s price surged to a peak near $28,000, per CoinGecko, on Wednesday after the court’s verdict came out.\n\nAnother delay from the securities regulator crushed the market’s optimism, however, sending Bitcoin prices back towards $26,000.\n\nEthereum (ETH) followed the top cryptocurrency with a 3.5% dip since yesterday.\n\nThe crypto market cap declined by 3.5%, losing $11.2 billion overnight.\n\nAD\n\nAD\n\nNotably, Maker (MKR) and Toncoin (TON) resisted the bearish move, standing above the rest of the market with positive gains. MKR was up 5% and TON 3% over the last 24 hours.\n\nMaker’s governance token has likely benefited from accumulation by wealthy investors.\n\nOn-chain analysis outlet Santiment reported that addresses holding between 100 and 10,000 MKR coins bought around 61,500 MKR tokens since mid-July, worth $70.9 million at current prices, per CoinGecko.\n\nToncoin’s bullish momentum can be attributed to ecosystem development by the TON Foundation, the team managing and developing atop the Ton blockchain.\n\nThe Foundation released a Telegram-centric Web3 app store and also launched a community-driven initiative, Believers.ton, for promoting ecosystem development.\n\nMacro signals mean uncertainty for crypto\n\nThe global macroeconomic landscape also sent mixed signals yesterday, jarring all financial markets, including crypto.\n\nThe US Bureau of Economic Analysis (BEA) released key economic data that reduced the market's expectations regarding a potential interest rate hike.\n\nA higher benchmark interest rate eats into corporate profits while making low-risk instruments such as government bonds more lucrative, diminishing the future values of stocks and other risk assets.\n\nAD\n\nAD\n\nThe U.S. Personal Consumption Expenditures (PCE) price index for July stood at 3.3%, 0.3% higher from June.\n\nThe PCE index is the Federal Reserve's preferred measure of inflation, tracking the prices of goods and services that consumers purchase.\n\nWhile the inflation levels were higher than the previous month, PCE readings for July aligned with the market’s expectations raising hopes that the Fed might pause on interest rate hikes.\n\nThe S&P 500 index traded slightly lower on Thursday, closing 0.16% lower at 4,507.67 points. While the dollar index (DXY) against other global reserve currencies gained 0.44% Thursday, last trading at 103.56 points.\n\nInvestors are now eagerly awaiting the August U.S. employment data scheduled for release today, which will provide more clarity about the potential rate hike decision."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vY29pbmdhcGUuY29tL2dyYXlzY2FsZS1ldGhlcmV1bS10cnVzdC12YWx1ZS00LTZiLWFya2hhbS1yZXBvcnQv0gFLaHR0cHM6Ly9jb2luZ2FwZS5jb20vZ3JheXNjYWxlLWV0aGVyZXVtLXRydXN0LXZhbHVlLTQtNmItYXJraGFtLXJlcG9ydC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Sep 2023 07:00:00 GMT",
        "title": "Grayscale Ethereum Trust Hold $4.6B ETH Arkham Report - CoinGape",
        "content": "In its latest report, Arkham Intelligence found that Grayscale has accumulated Ethereum worth around $5 billion. Grayscale seems to have hit all the right notes in its crypto symphony as it nears the launch of its spot Bitcoin ETF after winning the lawsuit against the Securities and Exchange Commission (SEC).\n\nIt might not come as a surprise as Grayscale’s Ethereum Trust Fund is among the top-rated crypto funds in the industry. Grayscale’s $4.7 billion ETH holdings make Ethereum Trust Fund second-largest Ethereum Entity on the planet. The Ethereum price has slumped since Grayscale’s investment causing a slight correction in the initial investment worth $5 billion dollars.\n\nadvertisement\n\nAlso Read: Breaking: Grayscale Wins US SEC Lawsuit On Spot Bitcoin ETF\n\nOther Information About Grayscale Ethereum Trust\n\nArkham scanned over 500 wallets and thoroughly checked all activity linked to Grayscale in order to identify the on-chain activity. Each wallet holds less than $30 million, as per the report. Grayscale also has nearly $1.7M worth of Link tokens in the Grayscale Chainlink Trust and $1.1M worth of UNI tokens.\n\nAccording to Arkham’s report, Grayscale’s Bitcoin holdings are much less, amounting to about $92.1 million. However, according to Grayscale’s official website, the Grayscale Bitcoin Trust, otherwise known as GBTC, manages over $16 billion worth of Bitcoin.\n\nWill Victory Against The SEC Improve Grayscales Holdings?\n\nGrayscale holds nearly $60 million in its Bitcoin Cash Trust and about $179 million in the Ethereum Classic Trust. The Grayscale Litecoin Trust is another massive fund with about $94.2 million. As the list goes on, these holdings are just the tip of the Iceberg in the Grayscale portfolio.\n\nConsidering Grayscale’s victory against the SEC, it is bound for the Asset Management Firm to start accumulating more Bitcoin and other cryptocurrencies in its holdings.\n\nThe SEC still has 40 days to appeal the loss it faced against Grayscale in the Washington D.C court or move to the Supreme Court. However, till the SEC makes any move it is all speculation about how the major asset management firms will strategize their ETF applications.\n\nAlso Read: Bitcoin ETF: Here’s Key Hurdle Ahead for Potential Grayscale ETF"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY3J5cHRvYnJpZWZpbmcuY29tL2V0aGVyZXVtLWV0aC1jb21tb2RpdHktc2F5cy1qdWRnZS11bmlzd2FwLWxhd3N1aXQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) is a Commodity Says Judge in Uniswap Lawsuit - Crypto Briefing",
        "content": "Share this article URL Copied\n\nThis week, New York Judge Katherine Failla called ETH a commodity after rejecting a class action lawsuit against the leading decentralized exchange Uniswap. Judge Failla is also in charge of the SEC’s ongoing case against Coinbase.\n\nJudge Failla wrote, “The Court finds that the smart contracts here were themselves able to be carried out lawfully, as with the exchange of crypto commodities ETH and Bitcoin.”\n\nThe Securities and Exchange Commission has evaded questions regarding ETH’s classification since Gary Gensler took office. Gensler believes that “everything other than Bitcoin” is a security. Yet, the SEC hasn’t directly pursued ETH, suggesting they might not have a strong case to label it as a security.\n\nThe SEC uses a legal test called the Howey Test to decide whether a transaction qualifies as an investment contract, and therefore a security. According to this test, an investment contract exists if there is an “investment of money in a common enterprise with a reasonable expectation of profits to be derived from the efforts of others.”\n\nLast month, in a case against Coinbase, the SEC ruled that Solana, Polygon, Cardano, and nine other assets are securities. Following this decision, Coinbase raised questions about the SEC’s interpretation of securities laws, implying that the agency might be overstepping its legal authority.\n\nEthereum’s price dropped by 2.1% in the past 24 hours, according to CoinGecko."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZGVjcnlwdC5jby8xNTQ1ODMvYml0Y29pbi1ldGhlcmV1bS10cmFkaW5nLXZvbHVtZXMtaGVhZGVkLXdvcnN0LXF1YXJ0ZXItc2luY2UtMjAxOdIBYGh0dHBzOi8vZGVjcnlwdC5jby8xNTQ1ODMvYml0Y29pbi1ldGhlcmV1bS10cmFkaW5nLXZvbHVtZXMtaGVhZGVkLXdvcnN0LXF1YXJ0ZXItc2luY2UtMjAxOT9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin, Ethereum Trading Volumes Headed for Worst Quarter Since 2019 - Decrypt",
        "content": "Create an account to save your articles.\n\nCreate an account to save your articles.\n\nYour Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin's spot trading volumes for the current quarter have totaled $721.10 billion, according to CoinGecko data.\n\nIf September's volumes mirror those of July and August, it will mark the lowest trading volumes for a quarter since Q1 2019. Quarterly trading volumes hovered over $2 trillion for most of the time between 2019 and 2023.\n\nOver the previous two months, Bitcoin saw trading volumes of $345.89 billion and $354.84 billion, respectively.\n\nAD\n\nAD\n\nIf conditions remain unchanged and September's volumes hover around $350 billion, the quarterly trading volumes would come close to $1.05 trillion.\n\nFor comparison, last quarter, the total quarterly trading volumes were $1.25 trillion, marking a potential 14% decline month over month.\n\nCoinGecko data shows that the total trading volume for Bitcoin in the first quarter of 2019 was $541.3 billion.\n\nBitcoin quarterly trading volumes. Source: CoinGecko.\n\nBitcoin quarterly trading volumes. Source: CoinGecko.\n\nEthereum paints the same picture\n\nThe conditions are similar for Ethereum (ETH).\n\nAD\n\nAD\n\nIn July and August, ETH recorded trading volumes of $232.06 billion and $212.92 billion, respectively.\n\nIf Ethereum’s September trading volumes reach approximately $220 billion, the cumulative quarterly trading volume for ETH would be just over $650 billion, a level not seen since 2019.\n\nIn Q4 2019, the total spot trading volumes for ETH amounted to $740.64 billion.\n\nEthereum quarterly trading volumes. Source: CoinGecko.\n\nEthereum quarterly trading volumes. Source: CoinGecko\n\nAccording to a previous CoinGecko report, spot trading volumes for the entire crypto market on centralized crypto exchanges dropped by 43% in the second quarter of 2022.\n\nInstitutional trading firm Genesis Trading said in its last quarter report that derivatives will likely play a crucial role in the future growth of crypto volume, with “spot market liquidity suffering and spot order book depth chronically flagging.”"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vZmluYm9sZC5jb20vY2hhc2luZy10aGUtMTAweC1kcmVhbS1vcHRpbWlzbS1ldGhlcmV1bS1wb21lcmRvZ2Utd2hlcmUtZG8tdGhlLWV4cGVydHMtc3RhbmQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Sep 2023 07:00:00 GMT",
        "title": "Chasing the 100x Dream: Optimism, Ethereum, Pomerdoge: Where Do the Experts Stand? - Finbold - Finance in Bold",
        "content": "Press Releases are sponsored content and not a part of Finbold's editorial content. For a full disclaimer, please click here. If you encounter any issues, kindly report them to [email protected]. Crypto assets/products can be highly risky. Never invest unless you’re prepared to lose all the money you invest.\n\nIn this thrilling quest for the 100x dream, we navigate the intricate world of cryptocurrency, focusing on three key players – Pomerdoge (POMD), Optimism (OP), and the tried and true Ethereum (ETH). Pomerdoge, currently in its presale phase, teases the intriguing possibility of significant returns for early investors. Let’s take a closer look at which of these three assets stands out as a potential game-changer in the industry.\n\nClick Here To Find Out More About The Pomerdoge (POMD) Presale\n\nPomerdoge (POMD): More Than Just Another Meme Coin\n\nIn a world dominated by meme-themed cryptos, Pomerdoge steps onto the stage with a bark loud enough to challenge the established giants like Dogecoin. Pomerdoge uniquely intertwines a play-to-earn gaming model with its meme heritage, offering players both entertainment and genuine financial prospects.\n\nPomerdoge’s proposition goes beyond fun; players can genuinely earn from competing and actively engaging within its vibrant ecosystem. This ability to provide actual utility sets Pomerdoge apart in a crowded memecoin arena.\n\nThe heart of this dynamic platform is its gaming arena, a melting pot for enthusiasts worldwide. They don’t just play; they compete, connect, and most importantly, earn. With the trustworthiness of the Ethereum blockchain underpinning it, Pomerdoge participants can indulge in the assurance of security.\n\nBut Pomerdoge’s ambition doesn’t stop at play. Its dedication to transparency and safety is commendable, evident in its successful audit partnership with Interfi Network and the firm decision to lock its liquidity, ensuring stability for its community.\n\nThere’s already palpable enthusiasm for Pomerdoge, with millions of POMD tokens being sold for just $0.007 a piece during phase one of the presale. Observers who’ve witnessed Dogecoin’s meteoric rise in 2017 see parallels, and whispers abound of Pomerdoge mirroring that success to reach $1.00 by 2024.\n\nOptimism (OP): The Coinbase Collaboration and the 39% Price Jump\n\nThe buzz surrounding Optimism reached a fever pitch with its partnership with Coinbase on a Layer-2 product. This news not only showcased Optimism’s growing prominence but also triggered a substantial 39% price surge, pushing its value to $2.38 within a mere 24 hours.\n\nAfter navigating a drop to $0.90 in mid-June, Optimism has regained some of its lost ground and currently hovers around $1.55. Many are optimistic (pun intended) about Optimism’s prospects, suggesting that Optimism could potentially touch the $5.00 mark before 2025.\n\nYet, for Optimism holders on the hunt for even more lucrative opportunities, market analysts are converging on a common sentiment: Pomerdoge seems to be the most enticing bet. With Pomerdoge’s presale still in its initial phase, the window of opportunity for exponential returns appears wide open.\n\nWhile Optimism is doing well, the layer-2 space is becoming increasingly crowded, with projects like Arbitrum stealing market share from Optimism. Therefore, the potential for a 100x return that Pomerdoge offers is simply too hard to resist for many investors.\n\nEthereum (ETH): The $10,000 Dream vs. Pomerdoge (POMD)’s Potential\n\nAs the undisputed king of smart contracts, Ethereum has come a long way since its initial coin offering in 2014. Currently hovering around $1,851 per token, some analysts project that the value of Ethereum could cross $10,000 by 2024.\n\nThat said, growth could be stunted if scaling issues continue to plague the Ethereum blockchain. There is also the dreaded “death cross” on Ethereum’s weekly chart. The Ethereum price fell 60% the last time this occurred.\n\nOn the flip side, Pomerdoge appears to be bucking the bearish trend. An increasing number of Ethereum enthusiasts, possibly sensing greater promise in newer ventures, are trading their ETH for POMD during Pomerdoge’s presale event.\n\nAnalysts note that the $2,000 resistance is the key level for Ethereum to watch. If the price can break through this barrier, it could be on its way torward $2,500 and 10,000 in the longer term. Still, these gains pale in comparison to the potential of Pomerdoge, where returns of 100x are not out of the question.\n\nFind out more about the Pomerdoge (POMD) Presale Today:\n\nWebsite: https://pomerdoge.com/\n\nTelegram Community: https://t.me/pomerdoge"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vY3J5cHRvdGlja2VyLmlvL2VuL2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24td2lsbC1ldGhlci1wcmljZS1jcmFzaC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction: Ether Price hints at Potential CRASH? - CryptoTicker.io - Bitcoin Price, Ethereum Price & Crypto News",
        "content": "Ethereum’s (ETH) recent gains, boosted by Greyscale’s victory over the SEC, have been wiped out. Now, the coin hovers near a pivotal trendline. With Bitcoin dropping below $26,000, Ethereum’s stability is in question. Without prompt bullish action, Ethereum could see a significant price dip. Will Ether price crash?\n\nFactors Influencing Ethereum’s Price\n\nOn August 31st, the SEC delayed the approval of a Bitcoin ETF, leading to a sell-off in both Bitcoin and Ethereum. Earlier in the week, Grayscale Bitcoin Trust triumphed over the SEC in court. The SEC must now reevaluate Grayscale’s application for a Bitcoin ETF. This victory boosted Bitcoin prices by 5% and other cryptocurrencies followed suit.\n\nEthereum or Bitcoin: Who Leads?\n\nEthereum might be on the path to outshine Bitcoin. The ETH/BTC chart hints at a breakout from its falling wedge pattern, usually a bullish sign. If Ethereum breaks out, it could outdo Bitcoin by a 10% margin. Presently, the ETH/BTC ratio is at 0.063. A surge could push this past the 0.07 mark, especially if the 200-day moving average is surpassed.\n\nEthereum Price Prediction: Will Ether Price Crash?\n\nExamining the ETH to USD ratio, Ethereum has been following an upward trend since June 2022. However, any decline below this trend could spell disaster for its price. If this happens, Ethereum could drop to the $1080 support line.\n\nAdditionally, patterns suggest an ascending triangle, often a bearish sign. If this pattern holds, Ethereum could plummet to $759, a 54% decrease from its current value.\n\n\n\n\n\nYou might also like\n\nMore from Altcoin"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vdG9rZW5wb3N0LmNvbS9Pbmx5RmFucy1QYXJlbnQtQ29tcGFueXMtRXRoZXJldW0tSW52ZXN0bWVudHMtUmV2ZWFsZWQtaW4tRmluYW5jaWFsLVJlcG9ydC0xMDU4M9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "OnlyFans Parent Company's Ethereum Investments Revealed in Financial Report - TOKENPOST",
        "content": "OnlyFans Parent Company's Ethereum Investments Revealed in Financial Report\n\nRecent financial documents from the UK have unveiled that Fenix International, the leading company behind the subscription service OnlyFans, had a significant investment in Ethereum, the popular cryptocurrency. The disclosure shows a close to $20 million investment made over the span of 2021 and 2022.\n\nHowever, as crypto witnessed some fluctuations last year, the investment didn't entirely go in their favor. By the close of November 2022, the value of their Ethereum holdings shrunk by $8.5 million. By that month’s end, when Ethereum’s market price stood at $1,295 per unit, the company's total Ethereum was valued at roughly $11 million.\n\nYet, this financial setback in the crypto domain didn't cast a shadow on the company’s overall performance. Fenix International, throughout the year ending November 30, 2022, saw its revenues soar. There was a noticeable 17% boost in their earnings, rising from $5 billion the previous year to an impressive number of almost $6 billion.\n\nMoreover, the subscription-based platform, predominantly known for adult content, also reported substantial growth in its user base. The numbers were clear – a 47% surge in content creators and a 27% growth in subscriber count.\n\nDiving into the digital asset world isn't new for Fenix International. Early in 2022, they paved the way for their verified creators to adopt Ethereum-fueled NFTs as their profile images.\n\nAdditionally, in the summer of 2022, two ex-executives from OnlyFans launched Zoop, an innovative platform dedicated to trading 3D celebrity cards. What made Zoop stand out was its foundation on the Ethereum-based solution, Polygon.\n\nFenix International's revelation of its Ethereum holdings happens at a time when the adult content community is increasingly exploring the decentralized digital landscape. Many are turning their attention to Friend.tech, a fresh decentralized social media outlet in the cryptocurrency world, aiming to leverage its rising popularity.\n\nTokenPost | [email protected]\n\nTokenPost | [email protected]"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY3J5cHRvdGlja2VyLmlvL2VuL2V0aGVyZXVtLXBob25lcy13aXRoLWV0aG9zLXNvbGQtb3V0LWluLWp1c3QtYS1kYXkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Phones with ethOS Sold Out in Just a Day! - CryptoTicker.io - Bitcoin Price, Ethereum Price & Crypto News",
        "content": "In under a day, the pre-sale for the newest smartphone running on Ethereum sold out. This launch saw all 50 units, equipped with a special operating system, fly off the shelves.\n\nSource : ethOS Website\n\nWhat is the Ethereum Phone?\n\nThis phone is a version of the Google Pixel 7a. But, it’s not just any phone. It runs on ethOS. EthOS stands for Ethereum operating system. The name also has roots in Greek, meaning “character”.\n\nOne special thing about this phone is its built-in Ethereum light client. It allows the phone’s system to validate blocks on its own. So, the phone becomes a “light node” in the Ethereum network.\n\nThe Ethereum phone comes packed with tools. You can manage payments, send messages, and more. Plus, it’s user-friendly. For example, it links up with the Ethereum Name Services. This lets users make payments simply. The device also supports Ethereum Virtual Machines and Layer 2 networks.\n\nhttps://twitter.com/EthereumPhone/status/1694755024121811426\n\nSpecial NFT Purchase Method\n\nThis phone wasn’t just up for grabs. Only 50 were for sale. If you wanted one, you first needed an ethOS non-fungible token (NFT). You’d then “burn” or destroy this NFT to get your phone.\n\nOn OpenSea, some are selling the ethOS NFT for three Ethereum. That’s about $5,000. It’s a huge jump from the $499 Google Pixel 7a.\n\nFrom the Website:\n\nWant the first phone with ethOS ready to go? This Pixel 7a has a special ethOS to honor Nouns for backing the project. After making your NFT, you’ve got a year to swap it for the phone.\n\nBig thanks to our first supporters. All the pre-sale ethOS phone NFTs are now claimed!\n\nStarting in Fall 2023, we’ll have more for sale. Thanks for loving ethOS!\n\nHow Do I Get My Phone?\n\nBuy the NFT: Get the ethOS NFT for 0.39Ξ. Swap & Get Your Phone: Trade in your NFT for a phone loaded with ethOS.\n\nConclusion\n\nThe rapid sell-out of the Ethereum phone showcases the growing interest in the fusion of smartphones and blockchain technology. With the unique ethOS and features tailored for the Ethereum network, this phone has set a new standard for Web3 devices. As the lines between digital assets like NFTs and everyday gadgets blur, consumers and tech enthusiasts eagerly await what’s next in this innovative space. Keep an eye out for the regular sales in Fall 2023, as the ethOS phone’s journey is just beginning!\n\nYou might also like\n\nMore from Ethereum"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL2V0aGVyZXVtLWlzLWxhYmVsZWQtY29tbW9kaXR5LWluLXRoZS11bmlzd2FwLWNhc2UtaW5zaWdodHMtZnJvbS1sZWdhbC1leHBlcnQv0gFsaHR0cHM6Ly9jb2lucGVkaWEub3JnL25ld3MvZXRoZXJldW0taXMtbGFiZWxlZC1jb21tb2RpdHktaW4tdGhlLXVuaXN3YXAtY2FzZS1pbnNpZ2h0cy1mcm9tLWxlZ2FsLWV4cGVydC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Ethereum is labeled ‘Commodity’ in the Uniswap Case: Insights from Legal Expert - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nOn August 30, Judge Katherine Polk Failla dismissed a case involving Uniswap users who claimed they lost money due to scam tokens. She said that Ethereum (ETH) and Bitcoin (BTC) were seen as “crypto commodities” and used this to explain why she dismissed the case.\n\nBill Hughes, regulatory chief at Ethereum booster ConsenSys, took to social media and said that in the Risely v. Uniswap case, The SDNY (Failla, J.) made it clear in its decision on August 29 that Ethereum is categorized as a commodity, rather than a security.\n\nTaking to X, previously Twitter, Bill wrote, “The SDNY (Failla, J.) also explicitly found in its August 29 decision in Risely v. Uniswap that Ethereum is a commodity, not a security. No analysis of the issue, just the conclusion, but still, a pretty definitive statement if you ask me.”\n\nHe talked more about how this idea hints that wrapped BTC might be seen as a commodity, but not so confidently. The saying “Ethereum is a commodity” is super clear, and he is really sure about it, even sure enough to bet his own house – it doesn’t seem like the judge put it there by mistake.\n\nThe SDNY (Failla, J.) also explicitly found in its August 29 decision in Risely v. Uniswap that\n\n\n\nEthereum is a commodity, not a security.\n\n\n\nNo analysis of the issue, just the conclusion, but still, pretty definitive statement if you ask me.\n\n\n\n👀👀👀 pic.twitter.com/KEc5Pf5kTC — Bill Hughes : wchughes.eth 🦊 (@BillHughesDC) August 30, 2023\n\nIn another tweet, he said things are getting even better: When you give tokens to a pool as a liquidity provider, you still own those tokens. This idea is important beyond just AMMs. It’ll probably affect how courts see liquid staking setups and how taxes work for smart contracts."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iYWxhbmNlci1wcm90b2NvbC1leHBsb2l0ZWQtZm9yLTkwMGstYXMtZGVmaS1oYWNrcy1tb3VudC1maW5hbmNlLXJlZGVmaW5lZNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Balancer protocol exploited for $900K as DeFi hacks mount: Finance Redefined - Cointelegraph",
        "content": "Welcome to Finance Redefined, your weekly dose of essential decentralized finance (DeFi) insights — a newsletter crafted to bring you the most significant developments from the past week.\n\nIn this week’s newsletter, Ethereum staking services have agreed upon a 22% limit on all validators to ensure fair markets. August proved to be another costly month for DeFi as several protocols were collectively exploited for $16 million. In separate exploit news, Balancer protocol lost nearly $900,000 due to a vulnerability flagged months ago.\n\nShibarium’s second launch proved more stable as the layer-2 protocol already has over 100,000 new wallets, and USD Coin (USDC) is set to debut on Coinbase’s layer-2 platform later this week.\n\nThe DeFi market had another late-week bearish decline due to an overall market fall after news dropped of a delay in the decision on approval of a spot Bitcoin’s spot exchange-traded fund (ETF). Most DeFi tokens traded in the red, and the total value locked in DeFi tokens remained below $50 billion.\n\nEthereum staking services agree to a 22% limit for all validators\n\nAt least five Ethereum liquid staking providers have either imposed or are working to impose a self-limit rule in which they promise not to own more than 22% of the Ethereum staking market — in a move seen as ensuring the Ethereum network remains decentralized.\n\nAmong the Ethereum staking providers either already committed or working to commit to the self-limit rule are Rocket Pool, StakeWise, Stader Labs and Diva Staking, according to Ethereum core developer Superphiz.\n\nContinue reading\n\n$16 million in crypto lost to DeFi hacks in August: Report\n\nIn August, $15.8 million in cryptocurrencies was lost in DeFi hacks and exploits, specifically. According to an Aug. 31 report by blockchain security firm Immunfi, a combined $23.4 million in crypto was lost to a combination of hacks, exploits and fraud, a significant decrease compared with the $320.5 million lost in July. All exploits consisted of attacks against DeFi protocols, and not a single incident affected centralized finance entities.\n\nFive of the 21 security incidents reported occurred on the Ethereum blockchain, while four occurred on the BNB Chain. Coinbase’s highly anticipated layer-2 solution, Base, experienced four security exploits shortly after its launch on Aug. 9.\n\nContinue reading\n\nBalancer exploited for close to $900,000 after vulnerability warning\n\nEthereum automated market maker and DeFi protocol Balancer was exploited for nearly $900,000, the company confirmed on X (formerly Twitter) on Aug. 27, just days after disclosing a vulnerability that affected several pools.\n\nAn Ethereum address allegedly belonging to the attacker has been revealed by blockchain security expert Meier Dolev. Following the exploit, the address received two transfers of Dai (DAI) stablecoin worth $636,812 and $257,527, respectively, bringing its total balance to over $893,978.\n\nContinue reading\n\nUSDC will launch natively on Base network — Jeremy Allaire\n\nCircle’s United States dollar stablecoin, USDC, will launch natively on the Base network “next week,” according to an Aug. 29 social media post from CEO Jeremy Allaire. The new version will replace the current USD Base Coin (USDbC) that most users rely on as a substitute.\n\nCoinbase’s Base network launched on Aug. 9. At the time, no native version of USDC existed on the network. Users could not deposit cash into a Circle account and receive equivalent USDC on Base. To solve this problem, the Base team allowed users to bridge USDC from Ethereum via an official bridge app. The token issued by the bridge is called “USDbC” and is backed by native USDC locked on the Ethereum network.\n\nContinue reading\n\nShibarium wallets surpass 100,000 after SHIB devs relaunch bridge\n\nShibarium, a new layer-2 network for the Shiba Inu (SHIB) token, has surpassed 100,000 wallets on its platform, with 35,000 coming within 24 hours of Shibarium’s relaunch on Aug. 28. Shytoshi Kusama, the lead developer and co-founder of Shiba Inu, confirmed Shibarium was back up and running in an Aug. 28 blog post.\n\nAt the time, Kusama noted that Shibarium tallied 65,000 wallets across 350,000 transactions — however, those figures have rocketed upward since, increasing 55.8% and 20.2%, respectively, according to Shibariumscan.io.\n\nContinue reading\n\nDeFi market overview\n\nData from Cointelegraph Markets Pro and TradingView shows that DeFi’s top 100 tokens by market capitalization had a bearish week, with most tokens trading in the red on the weekly charts. The total value locked into DeFi protocols touched $49.25 billion.\n\nThanks for reading our summary of this week’s most impactful DeFi developments. Join us next Friday for more stories, insights and education regarding this dynamically advancing space."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiL2h0dHBzOi8vZGFpbHljb2luLmNvbS93aGF0LWlzLWJpbmFuY2UtY29pbi1ibmIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Sep 2023 07:00:00 GMT",
        "title": "What is Binance Coin (BNB) - DailyCoin",
        "content": "What is Binance Coin (BNB)? The native token of the world’s largest crypto exchange has certainly seen its fair share of FUD and euphoria, yet BNB coin has solidified itself as a staple of the blockchain industry.\n\nBNB stands out as more than just another digital asset in the bustling world of cryptocurrencies. It’s the lifeblood of the Binance ecosystem, a powerhouse exchange that has carved out a significant niche in the crypto market.\n\nThe BNB Chain witnesses more daily traffic than its greatest rival, Ethereum (ETH). On top of that, the BNB chain is also faster and cheaper to use than the top Layer-1 blockchain. By the numbers, it looks better in every way.\n\nIs Binance Coin merely a glorified exchange token, or does it pose a legitimate threat to Ethereum’s dominance? With regulatory vultures circling Changpeng Zhao and the Binance trading platform, is BNB Coin a crypto asset that needs to be taken with a grain of salt?\n\nWhat Is Binance Coin?\n\nBinance Coin, or BNB, is the native cryptocurrency of the Binance exchange, easily the largest and most influential trading platform in the crypto industry. Launched in 2017, BNB coin began its dramatic life on the Ethereum network as an ERC-20 token. As the Binance ecosystem exploded in scale, BNB transitioned and became the native currency of its own blockchain, the Binance Chain.\n\nBNB was introduced to the world through an initial coin offering (ICO), with a strict cap of 200 million tokens. The BNB whitepaper declared that token distribution would be allocated as follows:\n\n10% – Angel Investors.\n\n40% – Founding Team.\n\n50% – ICO Participants.\n\nBut BNB isn’t just a token for trading on Binance. It has evolved into a multi-faceted altcoin with many uses within and beyond the Binance ecosystem. In a thriving and dynamic blockchain network, what is Binance Coin actually used for?\n\nWhat Can I Do with Binance Coin?\n\nBinance Coin is a versatile digital asset that reaches far beyond the confines of Binance.com. While BNB was introduced as a utility token for discounted trading fees, its functionality has significantly expanded over the years, making it a multi-purpose token with a wide array of applications.\n\nFor starters, BNB can be used to pay transaction fees on the Binance platform, including trading, withdrawal, and listing fees. The advantage is that users who pay with BNB often receive a discount, making transactions more cost-effective. Holding a qualifying amount of BNB also reduces traders’ rates on their maker-and-taker trading fees.\n\nBut the use cases of BNB don’t stop there. For instance, you can use BNB to book travel accommodations and flights, buy products online using the Binance credit card, and even hire freelancers for your business.\n\nBNB is the backbone of the ecosystem and is used to pay gas fees and secure the blockchain network. DeFi apps use BNB as a financial asset and store of value, giving users the power to earn through liquidity pools on sites like PancakeSwap, the top Binance DEX.\n\nIt can also be used to participate in token sales on the Binance Launchpad, allowing retail investors to buy new cryptocurrencies before they get listed on public markets. Moreover, BNB is also used in non-fungible tokens (NFTs). It can be used to purchase virtual gifts, process payments, and even donate to charity.\n\nAt this stage, the question isn’t ‘What is Binance Coin used for?’ The question is what can’t it be used for?\n\nThe BNB Chain\n\nThe BNB Chain, also known as Binance Smart Chain (BSC), is a significant innovation and arguably the biggest growth sector in the Binance ecosystem. It’s a standalone blockchain that aims to make crypto onboarding as seamless as possible.\n\nThe BSC emerged in early 2021 as a threatening alternative to the Ethereum blockchain. While Layer 1 blockchains are a dime a dozen these days, that wasn’t always the case. In the early days of DeFi, Ethereum was the only network that supported enough users to create an on-chain economy.\n\nAnyone who wanted to trade on a DEX, or loan crypto assets on decentralized lending platforms had to do so on Ethereum. In periods of network congestion, gas fees on Ethereum make the chain almost unusable. No one wants to spend a $50 gas fee on a $100 USD trade, so Binance unveiled a cheaper, faster, and more accessible blockchain network for the masses.\n\nOne of the standout features of BSC is its compatibility with the Ethereum Virtual Machine (EVM). This means it supports all existing Ethereum tooling, making it easier for developers to build products and services on BNB Chain. It also allows for creating smart contracts and decentralized applications (dApps), opening up a world of possibilities for developers and users alike.\n\nHow Does BNB Chain Work?\n\nThe BNB Chain, or Binance Smart Chain (BSC), operates using a unique consensus mechanism known as Proof of Staked Authority (PoSA). This model combines elements of Proof of Authority (PoA) and Delegated Proof of Stake (DPoS) to achieve a balance of speed, security, and decentralization.\n\nIn the PoSA model, blocks are produced by a limited set of validators. While other Layer-1 networks like Cardano (ADA) create new tokens to reward validators, BNB Chain collects network transaction fees from users and distributors them to node operators who secure the network.\n\nUnlike legacy networks like Bitcoin (BTC) and Ethereum, the BNB Chain enjoys a much shorter block time. With a block time of around three seconds, BNB Chain can process transactions quickly, providing a smooth and efficient user experience. This is crucial for high-performance dApps that require fast and seamless transactions.\n\nDecentralized Finance (DeFi) on BNB Chain\n\nDeFi on BSC encompasses a wide range of financial applications available to anyone with a crypto wallet. The key advantage of DeFi is that it expands the scope of financial services beyond traditional institutions, offering a more inclusive and open financial system.\n\nThe most popular DeFi application on BNB Chain is PancakeSwap, a decentralized exchange (DEX) that allows users to swap BNB and other BEP-20 tokens directly from their wallets. PancakeSwap also offers yield farming and staking services, where users can earn rewards by providing liquidity to the platform.\n\nAnother notable DeFi platform on BSC is Venus Protocol, an algorithmic money market and synthetic stablecoin protocol. Venus allows users to earn interest on their cryptocurrencies, borrow against their crypto, and mint synthetic stablecoins like USDT.\n\nBNB Chain NFTs\n\nWhile DeFi on the BNB chain is alive and kicking, the network’s NFT scene leaves much to be desired. Compared with other networks like Ethereum or Solana, BNB Chain struggles to attract significant NFT trading volume.\n\nThat being said, the blockchain network has fostered solid NFT collections and communities. The most iconic BNB Chain-based NFT collection is the Pancake Squad, a fun art-based NFT project of 10,000 3D bunnies.\n\nBNB Burn\n\nTo drive token scarcity and maintain the long-term value of BNB, Binance implemented a unique burn mechanism. Binance periodically burns BNB coins from circulation, reducing the total supply of BNB.\n\nBinance conducts these burns every quarter, using a portion of its profits to buy back BNB from the open market and then permanently destroying or “burning” them. The amount of BNB that gets burned is based on the trading volume on the Binance exchange during the previous financial quarter.\n\nSince the inception of Binance Coin, several burns have already taken place, each time reducing the total supply of BNB. The last recorded burn removed over 2M BNB tokens from circulation, valued at over $600M USD.\n\nBNB Coin History\n\nBinance Coin’s journey began in 2017 when it was introduced through an Initial Coin Offering (ICO), a popular fundraising mechanism in the crypto industry. During the ICO, 100 million BNB tokens were sold to the public, raising approximately $15 million for Binance.\n\nInitially, BNB was an ERC-20 token on the Ethereum blockchain. However, in 2019, Binance launched its blockchain, the Binance Chain, and BNB was migrated to this new chain to become its native asset. This was a significant milestone in BNB’s history, as it marked the coin’s evolution from a utility token for the Binance exchange to a standalone cryptocurrency with its own blockchain.\n\nSince then, BNB has grown exponentially, both in terms of value and utility. This is mostly due to the adoption of the BNB Chain. DeFi exploded on the network in early 2021, which drove BNB’s price from $40 to its all-time high of $690 in months.\n\nHowever, like all cryptocurrencies, Binance Coin is not without its concerns.\n\nBinance Coin Concerns\n\nWhile BNB has seen significant growth and success, it’s not without its potential concerns. These primarily revolve around regulatory issues with the Binance exchange and questions about the centralization of the BNB Chain.\n\nBinance Exchange Regulatory Woes\n\nBinance has faced significant regulatory scrutiny in various jurisdictions around the globe. In most cases, these issues stem from concerns about compliance with financial regulations, consumer protection, and anti-money laundering (AML) measures.\n\nRegulators in several countries, including the United States, the United Kingdom, Germany, and Japan, have issued warnings or taken actions against Binance. The concerns these regulators raise often revolve around Binance operating without the necessary licenses or failing to implement adequate measures to protect consumers and prevent illicit activities.\n\nFor instance, in the United Kingdom, the Financial Conduct Authority (FCA) issued a warning in June 2021 stating that Binance Markets Limited was prohibited from undertaking any regulated activity in the country. In the United States, Binance has been investigated by the Department of Justice (DOJ) and the Internal Revenue Service (IRS) for potential violations of AML and tax regulations.\n\nMore recently, Gary Gensler and the SEC launched another attack on the Binance exchange, claiming that they are operating as an unlicensed securities exchange. These regulatory challenges pose a significant risk to Binance and, by extension, BNB. If Binance were to face severe penalties or restrictions, it could impact the utility and value of BNB.\n\nBNB Chain Centralization\n\nWhile the Binance Smart Chain (BSC) has brought many benefits to BNB and its users, it has also raised concerns about centralization. This is because Binance, the entity behind BSC, is a centralized organization with significant control over the network.\n\nIn a truly decentralized network, no single entity controls the entire system. This is one of the fundamental principles of blockchain technology and the very ethos of cryptocurrency. However, in the case of BSC, Binance has significant influence over the network’s operation and development.\n\nFor instance, Binance selects the validators for the BSC network. While this process is based on a staking model, the fact that Binance has the final say in validator selection has led to concerns about centralization. This is in contrast to networks like Ethereum, where anyone can become a validator or miner.\n\nBinance Coin Pros and Cons\n\nBinance Coin (BNB) comes with its own set of advantages and disadvantages, shaped by its unique features, the Binance ecosystem, and the broader crypto market dynamics. Let’s delve into the pros and cons to gain a balanced perspective on this prominent cryptocurrency.\n\nPros\n\nVersatility – BNB is a multi-purpose token with many uses within and beyond the Binance ecosystem. It can be used for trading, participating in token sales, paying discounted transaction fees, and even making purchases in the real world.\n\n– BNB is a multi-purpose token with many uses within and beyond the Binance ecosystem. It can be used for trading, participating in token sales, paying discounted transaction fees, and even making purchases in the real world. Performance – The BNB Chain offers fast transaction times and low fees, making BNB Chain an excellent host for DeFi applications.\n\n– The BNB Chain offers fast transaction times and low fees, making BNB Chain an excellent host for DeFi applications. Market Position – BNB is backed by Binance, one of the world’s largest and most influential cryptocurrency exchanges.\n\nCons\n\nRegulatory Risks – Binance, the entity behind BNB Coin, faces smoking guns from regulators on all sides.\n\n– Binance, the entity behind BNB Coin, faces smoking guns from regulators on all sides. Centralization Concerns – The BNB Chain is controlled by Binance, a centralized entity. This level of centralization could potentially impact the network’s security, transparency, and trustworthiness.\n\n– The BNB Chain is controlled by Binance, a centralized entity. This level of centralization could potentially impact the network’s security, transparency, and trustworthiness. Dependence on Binance – The value and utility of BNB are closely tied to the Binance ecosystem. If Binance were to lose its market position or face significant issues, it could negatively affect BNB.\n\nOn the Flipside\n\nThe BNB blockchain network has onboarded thousands of users to the world of cryptocurrency; it’s starting to fall behind compared to newer, more performant networks like Solana and Aptos (APT).\n\nWhy This Matters\n\nBNB Coin has established itself as one of the industry’s largest and most significant crypto assets. Like Bitcoin and Ethereum, it’s important to understand what BNB coin is and how it works to navigate the crypto market effectively.\n\nFAQs"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vY3J5cHRvY29pbi5uZXdzL3RlY2hub2xvZ3kvbW9uZXJvLWEtcHJpdmFjeS1maXJzdC1jcnlwdG9jdXJyZW5jeS1zZXR0aW5nLWl0c2VsZi1hcGFydC1mcm9tLWJpdGNvaW4tYW5kLWV0aGVyZXVtLTkyMjU1L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Sep 2023 07:00:00 GMT",
        "title": "Monero A PrivacyFirst Cryptocurrency Setting Itself Apart from Bitcoin and Ethereum - CryptoCoin.News",
        "content": ".\n\nIf you’re interested in cryptocurrencies, you’ve probably heard of Bitcoin and Ethereum. These two digital currencies have taken the world by storm and gained immense popularity. However, while Bitcoin and Ethereum focus on decentralization and security, there is another cryptocurrency that stands apart due to its unique emphasis on privacy and confidentiality – Monero (XMR). In this article, we’ll explore how Monero works, its history and evolution, key features, and how it compares to Bitcoin and Ethereum. We’ll also discuss how to buy and mine Monero, and whether it is a good investment.\n\nHow does Monero (XMR) work?\n\nWhat sets Monero apart from other cryptocurrencies is its privacy-enhancing technologies. Monero ensures the anonymity of its users through features like ring signatures, stealth addresses, and confidential transactions. Every user on the Monero network is anonymous by default, obscuring details about the sender, receiver, and transaction amount. This focus on privacy has made Monero a popular choice for individuals who value confidentiality and anonymity in their financial transactions. However, it has also raised concerns among some governments and resulted in bans and delistings on certain cryptocurrency exchanges.\n\nMonero’s Privacy-Enhancing Technologies\n\nLet’s take a closer look at the privacy-enhancing technologies that Monero utilizes:\n\nRingCT (Confidential transactions)\n\nMonero combines multiple transactions into a “ring,” making it difficult to determine the exact amount being sent. This enhances privacy by hiding individual transaction details within a larger group of transactions.\n\nRing Signatures\n\nBy employing ring signatures, Monero obscures the sender’s identity by including them in a group, or “ring,” of possible senders. This makes it virtually impossible to determine which specific user sent the transaction.\n\nStealth Addresses\n\nStealth addresses protect the privacy of both senders and recipients. Each transaction generates a one-time address, making it challenging to link multiple transactions to the same recipient.\n\nBulletproofs\n\nMonero utilizes bulletproofs, a form of zero-knowledge proof, to reduce the size of confidential transactions. This helps improve scalability and reduce transaction fees on the Monero network.\n\nP2Pool\n\nMonero promotes decentralization and prevents the concentration of mining power through P2Pool. This decentralized mining pool allows miners to pool their resources and mine XMR together.\n\nRandomX\n\nThe RandomX algorithm is optimized for central processing units (CPUs) and enhances the network’s security while preventing ASIC mining. This makes mining Monero more accessible to individuals using CPUs and general processing units.\n\nSmart Mining\n\nSmart mining is a less intrusive and energy-efficient way of mining Monero. It allows individuals to mine XMR using their computer’s unused processing power without causing drawbacks like overheating or draining the battery.\n\nMonero’s History and Evolution\n\nMonero’s roots can be traced back to Bytecoin, the first digital currency to utilize CryptoNote technology. While Bytecoin did not attain widespread success, it laid the foundation for the development of several privacy-focused cryptocurrencies, including Monero. Monero, initially known as Bitmonero, was created by seven developers from the Bytecoin project. Since its inception in 2014, Monero has evolved and undergone various upgrades to enhance its privacy, security, and efficiency. Notable milestones include the introduction of bulletproofs, atomic swaps with Bitcoin, and ongoing research and development by the Monero Research Labs (MRL) team.\n\nKey Features of Monero\n\nMonero offers several key features that make it stand out in the world of cryptocurrencies:\n\nPrivacy: Monero prioritizes user anonymity and confidentiality by default, making it one of the most privacy-centric cryptocurrencies available.\n\nMonero prioritizes user anonymity and confidentiality by default, making it one of the most privacy-centric cryptocurrencies available. Security: Monero’s emphasis on privacy goes hand in hand with its commitment to security. Through its privacy-enhancing technologies and robust consensus mechanism, Monero ensures secure transactions.\n\nMonero’s emphasis on privacy goes hand in hand with its commitment to security. Through its privacy-enhancing technologies and robust consensus mechanism, Monero ensures secure transactions. Scalability: Monero has implemented several upgrades, such as bulletproofs, to enhance its scalability and reduce transaction fees, allowing the network to handle a higher volume of transactions.\n\nMonero has implemented several upgrades, such as bulletproofs, to enhance its scalability and reduce transaction fees, allowing the network to handle a higher volume of transactions. Decentralization: Monero promotes decentralization through features like P2Pool, which allows miners to collaborate and prevent the concentration of mining power. This helps ensure a more resilient and distributed network.\n\nMonero vs. Bitcoin and Ethereum\n\nWhile Bitcoin and Ethereum are well-known cryptocurrencies, Monero differentiates itself through its privacy-centric approach. Bitcoin transactions, though pseudonymous, can still be traced on the blockchain, whereas Monero transactions are highly challenging to trace. Ethereum, on the other hand, focuses on decentralized applications (DApps) and smart contracts. Monero’s primary use case revolves around anonymous payments, making it a popular choice for those who prioritize financial privacy. Additionally, Monero’s blockchain is more agile and scalable than Bitcoin’s, thanks to its unique privacy-enhancing technologies.\n\nHow to Buy Monero\n\nIf you’re interested in buying Monero, there are various options available. XMR is listed on many decentralized money markets and cryptocurrency exchanges. However, it’s important to note that regulatory pressure has led to delistings in certain regions. Peer-to-peer (P2P) trading platforms, such as LocalMonero, provide direct connections between buyers and sellers looking to exchange Monero for fiat currencies or other cryptocurrencies. To transact Monero, you’ll need a Monero wallet and address, which should be protected with a seed phrase.\n\nHow to Mine Monero\n\nMining Monero involves utilizing the RandomX proof-of-work algorithm, which is optimized for general-purpose CPUs. While both CPUs and GPUs can mine Monero, CPUs tend to be more efficient. Solo mining can be done through either the command line interface or graphical user interface wallets. For those who prefer mining in a pool or solo mining with a GPU or dedicated hardware, software such as lXMRig and CSminer is required. By launching the mining software, your device’s processing power is utilized to solve complex mathematical puzzles, validate transactions, and reward you with XMR coins.\n\nIs Monero a Good Investment?\n\nMonero has garnered a reputation as a beacon of privacy and payment enablement among cryptocurrencies. Its growth and development depend on the contributions of developers, miners, and users convinced of Monero’s potential. Over the years, Monero has exhibited positive coin value, market cap growth, and protocol development. However, it’s essential to remember that cryptocurrencies, including Monero, can be volatile, and their value can fluctuate rapidly. Investing in Monero or any other cryptocurrency should be based on careful research, analysis of blockchains and market trends, and personal risk tolerance.\n\nIn conclusion, Monero’s focus on privacy and confidentiality sets it apart from other cryptocurrencies like Bitcoin and Ethereum. Its privacy-enhancing technologies, commitment to security, and emphasis on decentralization make it a compelling option for individuals seeking privacy in their financial transactions. Whether you’re interested in buying Monero, mining it, or considering it as an investment, it’s important to understand its unique features, history, and potential."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1hbmQtcG9seWdvbi1taW50ZWQtbmZ0cy1vbi1vcGVuc2VhLWZhbGwtdG8tbmV3LWxvd3Mv0gFXaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2V0aGVyZXVtLWFuZC1wb2x5Z29uLW1pbnRlZC1uZnRzLW9uLW9wZW5zZWEtZmFsbC10by1uZXctbG93cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Sep 2023 07:00:00 GMT",
        "title": "Ethereum and Polygon-minted NFTs on OpenSea fall to new lows - AMBCrypto News",
        "content": "NFT sales volume for Ethereum and Polygon-minted NFTs fell to new lows in August.\n\nDue to dropping interest, NFTs sales count plunged as well.\n\nThe monthly sales volume of Ethereum [ETH] and Polygon [MATIC]-based non-fungible tokens (NFTs) on leading marketplace OpenSea plummeted to new lows in August, data from Dune Analytics revealed.\n\nInformation from the on-chain data provider revealed that the monthly sales of Ethereum-minted NFTs on the marketplace reached an impressive peak of $659.02 million in February before experiencing a subsequent downturn.\n\nAt the end of August, the sales volume for this category of NFTs on OpenSea totaled $106.12 million, marking its lowest monthly volume since May 2021. This also represented an 84% fall from its February peak.\n\nSimilarly, following a record-breaking NFT sales volume of $109.12 million in February, Polygon-based NFTs on OpenSea since received decreased patronage from OpenSea’s users. The total sales volume in August was $7.02 million, marking a 94% decline in sales since February.\n\nWhat caused this decline?\n\nThe steady decline of sales volume for both Ethereum and Polygon NFTs on the marketplace was a result of waning interest in profile picture NFTs (PFPs) and OpenSea’s loss of market share to Blur.\n\nOn-chain data revealed that the market capitalization of top PFP NFT projects peaked at $5 billion in February 2023. As the overall NFT market declined, interest in this asset category waned, and the market capitalization is now $2.2 billion, down by over 50% from its peak.\n\nThe USD market cap of these top PFP projects peaked at $5b this year. It's now $2.2b, down 56% ($2.8b) from the Feb peak. pic.twitter.com/6aaUvyXTT0 — NFTstats.eth (@punk9059) August 29, 2023\n\nAlso, since its launch in October 2022, Blur, an NFT marketplace and aggregator, has gained significant traction, overtaking industry leader OpenSea. According to data tracked by DappRadar, of all NFT marketplaces, Blur recorded the highest sales volume of $222 million in the last month.\n\nThis occurred despite a 34% decline in month-over-month (MoM) sales. OpenSea, which saw a 45% uptick cross-board within the same period, trailed behind the NFT aggregator, data from DappRadar revealed.\n\nIn addition to a decline in sales volume, the number of traders who completed transactions involving Ethereum and Polygon-based collectibles on OpenSea in August also declined.\n\nRegarding Ethereum-minted NFTs on the marketplace, 244,907 NFTs were sold in April. This was an 11% decline from the 273,709 total NFTs sold in the month before and a 79% fall from the 1.14 million NFTs sold at the beginning of the year.\n\nAs for Polygon NFTs on OpenSea, sales plummeted by 37% to reach its lowest in nine months"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8venljcnlwdG8uY29tL2RlY2VudHJhbGl6ZWQtY29zbW9zLWV0aGVyZXVtLWludGVyb3BlcmFibGUtbGF5ZXItMS1ibG9ja2NoYWluLWthdmEtY2hhaW4tbm93LWF2YWlsYWJsZS1vbi1maXJlYmxvY2tzL9IBf2h0dHBzOi8venljcnlwdG8uY29tL2RlY2VudHJhbGl6ZWQtY29zbW9zLWV0aGVyZXVtLWludGVyb3BlcmFibGUtbGF5ZXItMS1ibG9ja2NoYWluLWthdmEtY2hhaW4tbm93LWF2YWlsYWJsZS1vbi1maXJlYmxvY2tzLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Sep 2023 07:00:00 GMT",
        "title": "Decentralized Cosmos-Ethereum interoperable Layer 1 blockchain, Kava Chain now available on Fireblocks - ZyCrypto",
        "content": "Advertisement\n\nOn Fireblocks, an enterprise platform to manage digital asset operations and create cutting-edge enterprises on the blockchain, Kava Chain, a decentralized Cosmos-Ethereum interoperable Layer 1 blockchain, is now accessible. Customers of Fireblocks will be able to access the burgeoning Cosmos DeFi ecosystem via the Kava Chain with the help of the integration safely and securely.\n\n“With the integration of Kava Chain onto the Fireblocks Network, we’re excited to bring Kava’s innovative suite of DeFi app protocols and Cosmos DeFi access to our customers,” said Idan Ofrat, Co-founder and Chief Product Officer at Fireblocks. “In the past year, we have seen growing institutional interest in DeFi. Fireblocks’ defense-in-depth security and customizable Transaction Authorization Policy (TAP) allow our customers to safely explore and innovate in the DeFi arena without compromising their compliance and security requirements. We look forward to unlocking more opportunities for our customers in the future.”\n\nThrough the bear market, the Kava Chain has been gradually accumulating and increasing. Top-tier crypto institutions have not, however, been able to interact with the dApps on-chain without a solid connection to an MPC (multi-party computation) custody technology supplier. More than 1,800 top digital asset and cryptocurrency institutions can now hold KAVA tokens and access Kava-native assets, including Cosmos-native USDt, which Tether chose to be issued solely on the Kava Chain, thanks to the Fireblocks interface.\n\nAlong with improving institutional access to Kava, this integration also enables customers of Fireblocks to:\n\nParticipate in DeFi opportunities on Kava ecosystem platforms, including Curve, Kinetix, and Hover.\n\nUse USDt, a native of Cosmos, to take part in market-making on significant exchanges.\n\nExamine fresh USDt DeFi possibilities on well-known Cosmos appchains.\n\n“Kava Chain’s role in arbitrage market making is becoming increasingly significant. With the Fireblocks integration, centralized exchanges (CEXs) and major market makers have a more capital-efficient option for cross-chain arbitrage,” said Scott Stuart, Co-founder of Kava Chain. “Instead of incurring high gas fees on Ethereum, they can now utilize Kava to transfer USDt between ecosystems efficiently. We’re excited about the future and the value this integration brings to our community!”\n\nAdvertisement\n\nFollow Kava Chain and Fireblocks on X (a.k.a. Twitter) for additional updates."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXR3aXNlLXdpdGhkcmF3cy1iaXRjb2luLWFuZC1ldGhlcmV1bS1tYXJrZXQtY2FwLWV0Zi1hcHBsaWNhdGlvbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Bitwise withdraws Bitcoin and Ether Market Cap ETF application - Cointelegraph",
        "content": "In an unexpected turn of events, Bitwise submitted a request to retract its application for its Bitcoin and Ether Market Cap Weight Strategy exchange-traded fund (ETF), initially filed with the United States Securities and Exchange Commission (SEC) on Aug. 3.\n\nWhile market sentiment turned bullish following Grayscale’s SEC victory, Bitwise appears to be reassessing its strategy. The withdrawal of the ETF application was unexpected; however, in the filing, a statement read, “The fund seeks to provide investors with capital appreciation. There can be no assurance that the fund will achieve its investment objective.”\n\nBitwise chief investment officer Matt Hougan advocated for SEC approval of all ETFs in a recent Bloomberg interview. The ETF intended to invest in either Bitcoin (BTC) futures contracts or Ether (ETH) futures contracts, determined by market capitalization. Bitwise also collaborated with ProShares to launch another ETF around the same time.\n\nIn the withdrawal statement, Bitwise said:\n\n“The Trust no longer intends to seek effectiveness of the Fund and no securities of the Fund were sold, or will be sold, pursuant to the above-mentioned Post-Effective Amendment to the Trust’s Registration Statement.”\n\nThe SEC has delayed its decision on Bitcoin ETF applications from WisdomTree, Invesco Galaxy, Valkyrie, VanEck, BlackRock, Bitwise and Fidelity. According to a SEC filing dated Aug. 31, the commission has designated a longer period in which it may review spot Bitcoin ETF applications from WisdomTree, VanEck, Invesco Galaxy, Bitwise and Valkyrie, Wise Origin Bitcoin Trust proposed by Fidelity, as well as BlackRock’s Bitcoin ETF. The next set of deadlines for the SEC is in mid-October, but these may also be delayed to the SEC’s third batch of deadlines in January or to the final possible decision dates in March, April and May of next year.\n\nBitwise was among the early asset management firms that lodged applications with the SEC for Bitcoin ETF products. Its January 2019 application with the U.S. securities regulator proposed a BTC-backed ETF tracking the Bitwise Bitcoin Total Return Index, which is calculated based on the value of Bitcoin derived from BTC transactions taking place on exchanges.\n\nRelated: SEC delays decision on 6 spot Bitcoin ETF applications\n\nThe company’s proposed Bitcoin ETF was touted to draw market data from a number of cryptocurrency exchanges in an effort to provide a trusted representation of the wider cryptocurrency markets. The firm would also require third-party custodians to physically hold Bitcoin.\n\nBitwise’s recent withdrawal isn’t its first. Earlier this year, it submitted an application for an Ethereum Strategy ETF designed to invest in both front-time and back-time Ethereum futures. However, the asset manager withdrew its application just one week later.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: SEC calls ETF filings inadequate, Binance loses euro partner and other news: Hodler’s Digest, June 25 – July 1"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDkvMDIvZ3JheXNjYWxlLWV0aGVyZXVtLXRydXN0LWlzLXdvcmxkcy1zZWNvbmQtbGFyZ2VzdC1ldGgtaG9sZGVyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Sep 2023 07:00:00 GMT",
        "title": "Grayscale Ethereum Trust Is World's Second Largest ETH Holder - Crypto Times",
        "content": "The onchain intelligence platform, Arkham has identified digital currency manager Grayscale’s Ethereum Trust on the blockchain.\n\nBreaking: Arkham has identified the Grayscale Ethereum Trust on chain.\n\n\n\nIt is now the second largest ETH entity globally with $5B in ETH.\n\n\n\nThis had not been previously reported or publicly identified. pic.twitter.com/MQqKT6E9v6 — Arkham (@ArkhamIntel) September 1, 2023\n\nArkham finds that the Grayscale ETH Trust holds approximately $5 billion in assets, making it the second-largest holder of Ether.\n\nGrayscale Ethereum Trust (ETHE), which was launched in December 2017, exposes Ethereum to the traditional finance ecosystem as a security and an investment asset. It essentially enables to invest in ETH without actually buying, storing or accessing ETH directly.\n\nThe funds in trust are distributed across more than 500 different addresses, with none of them holding ETH valued at more than $30 million in total. Arkham claims to be the first entity to discover Grayscale’s ETH holding on the blockchain.\n\nGrayscale’s Reported ETH Addresses – Arkham Intelligence\n\n“We were able to identify the addresses by analyzing activity and cross-referencing with Grayscale’s publicly reported balances,” it said.\n\nGrayscale is one of the leading players that connects crypto market with traditional finance with it offering numerous digital currency investment products. Recently, Grayscale won approval for its Bitcoin Trust ETF while slamming the SEC in a legal conflict against."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiM2h0dHBzOi8vd3d3LmxjeC5jb20vY3Jvc3MtY2hhaW4tdmVyc3VzLW11bHRpLWNoYWluL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Cross-Chain Versus Multi-Chain - LCX",
        "content": "What Is Multi-Chain?\n\nMulti-chain is a form of blockchain technology in which multiple chains are interconnected in a federated setting. Federated chains enable permissioned access between specific entities while preserving the autonomy of each network individually. This also means that in order for participants on one chain to transact with participants on other chained networks, they must first agree upon a set of norms. It also allows organizations or individuals to securely maintain their own private data stores, as each network could independently operate its own consensus algorithm.\n\nIn a multi-chain environment, each instance of a decentralized application (dApp) comprises a set of smart contracts that are isolated from other applications on other blockchains. Through the evolution of the multi-chain ecosystem, the availability of new on-chain environments has increased the total aggregate throughput of the smart contract economy, resulting in the enrollment of more users who can transact at a lower cost. In addition, each network takes a unique approach to scalability, decentralization, mechanism design, consensus, execution, data availability, and privacy, among other factors. All of these approaches can be implemented and battle-tested simultaneously in the multi-chain ecosystem to advance Web3 development.\n\nWhat Is Cross-Chain?\n\nCross-chain is a form of blockchain technology in which multiple chains are interconnected in an interoperable environment, enabling the exchange of assets and data across multiple networks. This permits the development of decentralized applications (Dapps), smart contracts, and secure transactions across multiple chains without the need for a centralized intermediary or controlling entity.\n\nCross-chain functionality enables developers to build natively cross-chain applications, where a single instance of a decentralized application (dApp) can function across multiple smart contracts deployed across multiple blockchains, as opposed to deploying multiple individual instances across distinct networks.\n\nIn a cross-chain context, different smart contracts on different chains execute distinct duties while remaining synchronized and supporting a single use case within a unified application. This allows developers to take advantage of the unique benefits of various networks.\n\nDifferences Between Cross Chain and Multi Chain\n\nWhile cross-chain and multi-chain are often used interchangeably, they actually refer to different concepts. Cross-chain refers to the ability to transfer assets between different blockchain networks, while multi-chain refers to the use of multiple blockchains within a single ecosystem.\n\nThe primary difference between these two concepts is their focus. Cross-chain technology is primarily concerned with interoperability, and enabling communication between different blockchains. Multi-chain technology, on the other hand, is primarily concerned with scalability and flexibility, enabling multiple blockchains within a single ecosystem.\n\nAnother key difference between cross-chain and multi-chain is their use cases. Cross-chain technology is well-suited for use cases that require the transfer of assets between different blockchains, such as decentralized exchanges or cross-chain lending platforms. Multi-chain technology, on the other hand, is well-suited for use cases that require the use of multiple blockchains within a single ecosystem, such as gaming platforms or supply chain management systems.\n\nUse Cases for Cross-Chain and Multi-Chain\n\nCross-chains are ideal for DApps that require high scalability, low latency, and cost-effectiveness due to their open and interoperable nature, whereas multi-chains provide superior security options for protecting sensitive data or information in a closed environment. Due to their distinct advantages over conventional solutions, there has been an increase in use cases for both technologies in recent years, spanning from finance to healthcare to gaming.\n\nCross Chain Scalability versus Multi-Chain\n\nCross-chain increases scalability by enabling multiple ledgers to communicate and interact with one another in order to process more transactions. Multi-chain, on the other hand, is limited by the number of nodes participating in the network, as only certain entities are permitted access. Nonetheless, multi-chains offer enhanced security because the data stored within them can be kept confidential and secure.\n\nCross-Chain vs. Multi-Chain Security\n\nCross-chain and multi-chain security are contingent upon the underlying consensus mechanism. Cross-chains utilize a distributed system in which data is cryptographically stored across multiple ledgers, so an assault on a single node does not compromise the entire network. Multi-chains are typically permissioned, so only certain nodes have access to the network, making it difficult for outsiders to obtain access or alter data stored within them.\n\nCross-Chain Versus Multi-Chain Cost-Efficiency\n\nCross-chain transactions typically require more computing power and energy than single-chain transactions, rendering them less cost-effective over time. Multi-chain networks are also costly to maintain due to the fact that each network requires its own hardware resources. Cross-chain solutions can provide enhanced scalability and interoperability, making them a beneficial investment for some organizations.\n\nCross-Chain vs. Multiple-Chain Performance & Speed\n\nAs data can be swiftly transferred between numerous ledgers, cross-chain networks typically offer quicker transaction times. Multi-chain networks, on the other hand, may be slower due to their permissioned nature and the requirement that all participating nodes attain consensus. Cross-chain and multi-chain each have their own distinct advantages and disadvantages, depending on the application. Cross-chain solutions should be considered by organizations seeking improved scalability, cost-effectiveness, and performance, whereas multi-chain networks may be advantageous to those seeking enhanced security. Before choosing the most appropriate technology for your project’s requirements, it is essential to evaluate its scope.\n\nInteroperability in a Cross-Chain Environment as Opposed to a Multi-Chain Environment\n\nCross-chain technology provides increased interoperability between blockchains, enabling the transfer of data and assets between networks. This means that users can access a variety of services from various chains without relying on a singular blockchain or set of protocols. As they are governed by a specific set of rules and protocols, multi-chain networks are typically less flexible.\n\nConclusion\n\nIn conclusion, cross-chain and multi-chain are two important concepts in the world of cryptocurrency and blockchain technology. While these terms are often used interchangeably, they actually refer to different concepts. Cross-chain technology enables the transfer of assets between different blockchain networks, while multi-chain technology enables the use of multiple blockchains within a single ecosystem.\n\nBoth cross-chain and multi-chain technology are helping to shape the future of blockchain technology, enabling new use cases and applications that were previously impossible. As the world of cryptocurrency continues to evolve, it will be interesting to see how these technologies continue to develop and evolve."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tZXRoLW1heS10YW5rLTUwLWJlZm9yZS1oYWx2aW5nL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction – ETH May Tank 50% Before Halving - Analytics Insight",
        "content": "Ethereum (ETH) price has lost all of its weekly gains that it made after Greyscale’s court win against the SEC. The native asset of the leading smart contract platform is trading close to a very critical trendline. If bulls don’t step in soon, bears may target a massive downside in the coming months.\n\nOn Friday, Bitcoin price fell below $26,000 once again. The pioneering cryptocurrency fully retraced its Tuesday pump, which pushed it above $28,000. The weakness in BTC has also affected the ETH price, which fell 3.5% on Thursday. On Friday, the price remained in a consolidation.\n\nWhy Is ETH Price Falling?\n\nOn 31st August, the SEC postponed the approval of spot Bitcoin ETF, pushing it to the next deadline. This triggered a sell-off in Bitcoin and Ethereum. The prices of both cryptocurrencies hit a fresh weekly low. Earlier this week, Greyscale Bitcoin Trust won its lawsuit against the Securities and Exchange Commission (SEC).\n\nThe court ruled that the SEC must reconsider Grayscale Investments’ application to launch the first bitcoin exchange-traded fund (ETF). The decision was a major victory for Grayscale and the crypto industry, and it sent shockwaves through the markets.\n\nBitcoin prices surged by more than 5% in the hours following the ruling, and other cryptocurrencies also saw gains. The news was seen as a positive sign for the future of the crypto industry, and it raised hopes that a Bitcoin ETF could be approved in the near future.\n\nEthereum To Outperform Bitcoin?\n\nThe following ETH/BTC chart shows that the pair is attempting to break out of the falling wedge pattern. Falling wedge breakouts tend to be extremely bullish and act as a great reversal pattern. Ethereum price may outperform Bitcoin in case of a breakout by 10%.\n\nAt the time of writing, the pair sits at 0.063. A breakout from the trendline can send the pair above the 0.07 level, which is the next major resistance level after the reclaim of the 200-day moving average. Many traders exchange their BTC to ETH when this pair flips bullish.\n\nEthereum Price Prediction Hangs By A Thread\n\nA look at the ETH to USD pair reveals that the pair has been respecting an upward trendline since its June 2022 bottom. A breakdown below this trendline would be cataclysmic for Ethereum price prediction. In case of a breakdown, the first bearish target would be the $1080 support level.\n\nA higher timeframe analysis also shows a formation of the ascending triangle pattern. These patterns usually break to the downside. The technical price target in case of an ascending triangle breakdown is $759, which is 54% below the current price level.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9tYWtlci1kYW8tY28tZm91bmRlci1wcm9wb3Nlcy1zb2xhbmEtY29kZWJhc2UtZm9yay1uYXRpdmUtY2hhaW7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Sep 2023 07:00:00 GMT",
        "title": "MakerDAO co-founder proposes fork of Solana codebase for native chain - Cointelegraph",
        "content": "MakerDAO co-founder Rune Christensen has submitted a proposal to build the decentralized finance project’s upcoming native chain off a fork of Solana’s codebase, not the Ethereum Virtual Machine (EVM), despite its long-running ties with Ethereum.\n\nMakerDAO’s native chain, dubbed “NewChain,” is part of the fifth and final phase of the MakerDAO “Endgame” upgrade announced in May.\n\nThe final phase is expected to take around three years to complete, and it will see the full re-implementation of the Maker protocol into a new stand-alone blockchain.\n\nIn a Sept. 1 X (formerly Twitter) post highlighting the proposal, Christensen stated: “After some research, I believe the Solana codebase should be considered as the basis for NewChain.”\n\nThe last phase of Endgame is the launch of a native blockchain for Maker with the codename NewChain\n\n\n\nIt will make the ecosystem more secure and efficient\n\n\n\nAfter some research, I believe the Solana codebase should be considered as the basis for NewChainhttps://t.co/KyGxBBGlVH — Rune (@RuneKek) September 1, 2023\n\nIn the proposal on the MakerDAO forum, Christensen described Solana’s codebase as the “most promising” option to explore, as he offered three key reasons why he thinks it should be used as the foundation for NewChain.\n\nFirstly, he highlighted the “technical quality” of the Solana codebase and argued that it is “highly optimized for the purpose of operating a singular, highly efficient blockchain.”\n\n“The Solana codebase is engineered well and benefits from being designed long after the bottlenecks and challenges of blockchains were already well understood, which fits nicely with the objective of NewChain itself in fixing the technical debt of Maker.”\n\nSecondly, Christensen argued that the Solana ecosystem has “proven its resilience by having gone through the FTX blowup” and several other challenges without crumbling.\n\nCo-founder @RuneKek of @MakerDAO, a DeFi protocol, proposes leveraging the Solana codebase for NewChain following extensive research.\n\n\n\nHe cites Solana’s technical quality, strong developer ecosystem, and resilience as primary reasons and suggests potential mutual benefits to the… https://t.co/p5w7pGf47h — Solana (@solana) September 1, 2023\n\nAs such, the MakerDAO co-founder suggested that the Solana ecosystem will likely stick around long term, maintaining a “high-quality pool of talent available for Maker to access and contribute to” while providing a cost-effective avenue to build and maintain NewChain.\n\nRelated: Controversy as MakerDAO’s Spark Protocol blocks users with VPNs\n\nFinally, Christensen noted that as “there already exists examples of the Solana codebase being forked and adapted to act as appchains,” MakerDAO could follow a similar process to develop NewChain.\n\nBack on Twitter, Christensen was questioned on why he favored using Solana code over the EVM.\n\nChristensen noted that while the EVM is the “most important when it comes to building stuff for users, since that’s where the users are,” it doesn’t suit MakerDAO’s specific requirements on the backend.\n\nEVM is still the most important when it comes to building stuff for users, since that’s where the users are. But for a specialized backend for Maker’s specific needs it is not ideal, and solutions like Solana or something like Sei are a much better fit. — Rune (@RuneKek) September 1, 2023\n\nNewChain will be a backend for the project’s SubDAO tokenomics and governance security. On the other side, its governance token Maker (MKR) and stablecoin Dai (DAI) will continue functioning as usual on Ethereum.\n\nMagazine: Recursive inscriptions — Bitcoin ‘supercomputer’ and BTC DeFi coming soon"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2JpdGNvaW4tc3BhcmstdGhlLW5leHQtZ2VuLWNyeXB0by1jb21iaW5pbmctdGhlLXN0cmVuZ3Rocy1vZi1kb2dlY29pbi1ldGhlcmV1bS1hbmQtY2FyZGFuby_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin Spark: The Next-Gen Crypto Combining the Strengths of Dogecoin, Ethereum, and Cardano - Analytics Insight",
        "content": "Bitcoin Spark has emerged as a force in the crypto space, skillfully blending the unique features of Dogecoin, Ethereum, and Cardano.\n\nUnraveling the Significance of Altcoins\n\nBefore going deep into what Bitcoin Spark has in store for the crypto space, let’s look at what altcoins are. Altcoin is the short-term term for Alternative coin. Cryptocurrencies exist as the alternative to the leading cryptocurrency, Bitcoin. While Bitcoin stands its ground, altcoins offer unique features and innovations catering to our digital economy. As the crypto space broadens, altcoins play a vital role in pushing the boundaries of technological innovations.\n\nThe Emergence of Bitcoin Spark\n\nAmongst all altcoins, Bitcoin Spark stands out with its innovative approach to blockchain technology. It uses an all-new Blockchain technology called the Proof of Process consensus mechanism for its activity.\n\nLet’s get into the unique feature from the triad that shapes Bitcoin Sparks’ identity.\n\nDrawing from Dogecoin’s Community Spirit\n\nDogecoin started as an Internet meme, blossoming into a cryptocurrency with an active community and widespread recognition. The welcoming values of the Dogecoin community, combined with its friendly branding, have left an imprint in people’s hearts. By building a welcoming and engaging community, Bitcoin Spark wants to democratize access to cryptocurrencies and promote broad adoption.\n\nIntegrating Ethereum’s Smart Contract Framework\n\nEthereum introduced the concept of Smart Contracts. These self-executing agreements created a safer path for decentralized applications and automated transactions—Bitcoin spark keys into this by implementing a layered Smart Contract Execution system. With Bitcoin Sparks smart contract execution system, developers can create smart contracts using different programming languages, making it a bit more versatile, thereby increasing the possibility of creating dApps in the Bitcoin Spark network.\n\nInheriting Cardano’s Scientific Precision\n\nCardano is known for its scientific and research-driven approach that has taken the blockchain space to greater heights. Bitcoin Spark adheres to Cardano’s values by incorporating practices that improve efficiency, scalability, and real-world practicality into its ecosystem.\n\nAmidst all these, crypto enthusiasts still ponder whether Altcoins have a future.\n\nDo Altcoins Have a Future?\n\nWithin the cryptocurrency community, the future course of altcoins causes arguments and controversies. While Bitcoin remains the industry’s pioneer, altcoins have shown durability and adaptation by solving specific use cases and technological challenges. Bitcoin Spark and other altcoins showcase the actual potential of the altcoin universe and are not just a duplication of Bitcoin achievement; instead, BTCS is a combination of different unique altcoins to create a new generation of cryptocurrencies that caters to various customers and multifaceted use cases.\n\nConclusion\n\nThe ambitious endeavor of Bitcoin Spark to merge the qualities of Dogecoin, Ethereum, and Cardano exemplifies the spirit of innovation that drives the cryptocurrency industry.\n\nWhile the future course of altcoins is unknown, Bitcoin Spark is a beacon of possibilities, showcasing the extraordinary prospects in the ever-changing cryptocurrency ecosystem.\n\nTo get familiar with Bitcoin Spark:\n\nWebsite: https://bitcoinspark.org/\n\nBuy BTCS: https://network.bitcoinspark.org/register\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmNyeXB0b3BvbGl0YW4uY29tL2dyYXlzY2FsZS1ldGhlcmV1bS10cnVzdC1zZWNvbmQtbGFyZ2VzdC1ldGgtaG9sZGVyLWFya2hhbS1pbnRlbGxpZ2VuY2Uv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Sep 2023 07:00:00 GMT",
        "title": "Grayscale Ethereum Trust identified as second-largest ETH holder by Arkham Intelligence - Cryptopolitan",
        "content": "In a revealing analysis, crypto data platform Arkham Intelligence identified Grayscale Ethereum Trust as the world’s second-largest holder of Ether (ETH), with nearly $5 billion in assets.\n\nOver 500 wallet addresses linked to Grayscale’s Ethereum Trust\n\nArkham Intelligence utilized on-chain analysis to identify over 500 wallet addresses associated with Grayscale’s Ethereum Trust. Interestingly, none of these wallets held more than $30 million in assets, a factor that Arkham noted made the identification process challenging. The data platform was able to pinpoint these addresses by scrutinizing transactional activity and cross-referencing it with Grayscale’s publicly reported balances. In total, Grayscale holds close to 3 billion ETH, solidifying its position as a major player in the Ethereum ecosystem.\n\nBreaking: Arkham has identified the Grayscale Ethereum Trust on chain.\n\n\n\nIt is now the second largest ETH entity globally with $5B in ETH.\n\n\n\nThis had not been previously reported or publicly identified. pic.twitter.com/MQqKT6E9v6 — Arkham (@ArkhamIntel) September 1, 2023\n\nGrayscale’s role in bridging crypto and traditional finance\n\nLaunched in December 2017, Grayscale’s Ethereum Trust (ETHE) serves as a bridge between the cryptocurrency market and traditional finance. The trust allows investors to gain exposure to Ethereum without the need to buy, store, or directly access the digital asset. This innovative financial product has positioned Grayscale as a leading entity that connects the crypto market with traditional financial systems. The company also recently gained approval for its Bitcoin Trust ETF, further cementing its role as a pioneer in digital currency investment products.\n\nGrayscale’s Ethereum Trust not only holds a significant amount of Ether but also plays a crucial role in introducing cryptocurrency to traditional financial markets. The trust’s structure, which eliminates the need for direct asset handling, makes it an attractive investment vehicle for those unfamiliar with the complexities of cryptocurrency management. As Grayscale continues to expand its range of digital currency investment products, it is likely to attract even more attention from both individual and institutional investors, especially given its recent legal victory against the SEC over its Bitcoin Trust ETF."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDkvMDEvZXRoZXJldW0tYmxvY2tjaGFpbi1zbWFydHBob25lLXNvbGQtb3V0LTI0LWhvdXJzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Ethereum blockchain smartphone sold out in 24 hours - The Cryptonomist",
        "content": "In an extraordinary breakthrough, pre-sales of smartphones based on Ethereum’s blockchain have shattered expectations: all 50 devices equipped with ethOS were sold in just 24 hours.\n\nThis news marks a significant step in the convergence of cutting-edge technology and blockchain innovation.\n\nThe ethOS revolution: the new Ethereum smartphone that marks the link between cutting-edge technology and blockchain innovation\n\nAt the heart of this revolutionary achievement is the ethOS operating system, a unique open-source platform that testifies to the rapid evolution of the Ethereum ecosystem.\n\nDerived from the Greek word meaning “character,” ethOS embodies the essence of Ethereum by seamlessly integrating blockchain functionality into the mobile landscape.\n\nethOS: more than an operating system\n\nAt the heart of the Ethereum smartphone is the ethOS operating system, a sophisticated, state-of-the-art platform that goes beyond its Greek-derived name, which means “character.” In this context, it embodies the character of Ethereum itself, seamlessly integrating blockchain functionality into the mobile experience.\n\nThe ethOS smartphone, built on the solid foundation of a Google Pixel 7a, is distinguished from conventional smartphones by its Ethereum light client.\n\nThis crucial feature allows the ethOS operating system to independently validate blockchain transactions, effectively positioning the device as a “light node” in the Ethereum network.\n\nThis means that users can actively participate in the Ethereum ecosystem with greater security and efficiency directly from their mobile devices.\n\nFeatures powered by Ethereum, the blockchain in a smartphone\n\nThe ethOS smartphone is not limited to exclusive blockchain integration. It comes with a wide range of tools designed for the needs of cryptocurrency enthusiasts.\n\nUsers can seamlessly manage payments, send and receive messages and delve into the vast landscape of Ethereum virtual machines (EVMs) and Layer 2 scaling networks.\n\nIn addition, ethOS integrates seamlessly with Ethereum Name Services (ENS), simplifying the payment process and enhancing the user experience.\n\nNFTs unlock access\n\nAccess to these revolutionary Ethereum smartphones was granted exclusively through the purchase of an ethOS non-fungible token (NFT).\n\nThis innovative approach allowed potential buyers to secure their devices by burning or destroying the ethOS NFT.\n\nIt is a testament to the ever-expanding utility of NFTs, demonstrating their versatility beyond the realm of digital art and collectibles.\n\nAs the Ethereum smartphone ecosystem takes its first steps, it is essential to recognize the challenges and dynamics at play in the mobile Web3 space.\n\nIn particular, there have been cases of counterfeit NFTs circulating on OpenSea, a major NFT exchange platform. Buyers need to be careful to avoid falling victim to these scams.\n\nRemarkably, some ethOS NFTs have been listed on OpenSea for the staggering figure of three Ethereum (ETH), or nearly $5,000.\n\nThis marked price difference from the standard Google Pixel 7a, which sells for $499 in the United States, highlights the added value of these pioneering devices.\n\nIt is a clear indication of the demand and enthusiasm surrounding Ethereum smartphones.\n\nCompetition and adaptation\n\nWhile Ethereum smartphones have had an explosive start, their counterparts in the mobile Web3 space face a number of challenges.\n\nSolana’s attempt to introduce a crypto-phone has had relatively modest success, with just over 2,000 units sold since its release, according to data from Flipside. In response, Solana Labs made a strategic decision to reduce the price from $1,000 to $599 to stimulate demand.\n\nThis decision follows the announcement of Ethereum’s imminent debut on smartphones, scheduled for the fall of 2023.\n\nThe mobile Web3 landscape is evolving rapidly, with each blockchain ecosystem trying to carve out its own niche.\n\nAs Ethereum smartphones emerge as pioneers, it remains to be seen how competitors will adapt and innovate to meet the growing needs of the crypto community.\n\nThe story of Ethereum smartphones is far from over. The intersection of blockchain technology and mobile devices presents a wealth of opportunities and challenges.\n\nThe pre-sale success of Ethereum smartphones testifies to the growing influence of blockchain technology in our daily lives.\n\nWith the convergence of smartphones and Ethereum capabilities, a new ecosystem is taking shape that promises to redefine the way we interact with the digital world.\n\nEngaging and exploring: shaping the future\n\nIn conclusion, the success of Ethereum smartphones marks a significant milestone in the integration of blockchain technology into our daily lives.\n\nThe intersection of smartphones and Ethereum’s capabilities opens up a world of possibilities, promising to reshape the way we interact with the digital realm.\n\nWhether you are passionate about technology, cryptocurrency, or simply curious about the future of mobile technology, we invite you to share your thoughts and insights. Join the discussion on our Telegram channel or connect with us on TikTok, Facebook or Twitter (X).\n\nYour perspectives are an integral part of this exciting journey into the world of Web3 mobile innovation."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNyeXB0by1uZXdzLWZsYXNoLmNvbS9ldGhvcy11bmxlYXNoZWQtZXRoZXJldW1zLXJldm9sdXRpb25hcnktc21hcnRwaG9uZS1zZWxscy1vdXQtbGlnaHRuaW5nLWZhc3Qv0gF0aHR0cHM6Ly93d3cuY3J5cHRvLW5ld3MtZmxhc2guY29tL2V0aG9zLXVubGVhc2hlZC1ldGhlcmV1bXMtcmV2b2x1dGlvbmFyeS1zbWFydHBob25lLXNlbGxzLW91dC1saWdodG5pbmctZmFzdC8_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Sep 2023 07:00:00 GMT",
        "title": "EthOS Unleashed: Ethereum’s Revolutionary Smartphone Sells Out Lightning Fast - Crypto News Flash",
        "content": "The ethOS smartphone, based on the Google Pixel 7a, sold out its first 50 units within 24 hours.\n\nEthOS NFTs, required to reserve a phone, are trading on OpenSea for nearly $5,000, a 10x markup compared to the base model of Google Pixel 7a.\n\nIf you were waiting to get your hands on the ethOS phone, you might be too late. The revolutionary Ethereum-based smartphone has sold out its first 50 units within 24 hours of going on pre-sale, marking a meteoric rise in demand for this next-gen device. Via X, @EthereumPhone recently tweeted:\n\nGM. ethOS phone pre-orders have arrived! Are you ready for the first physical phone with ethOS pre-installed? pic.twitter.com/4V6ZFZO93t — ethOS (@EthereumPhone) August 22, 2023\n\nMore Than Just an OS: An Ethereal Experience\n\nThe phone isn’t just a regular smartphone; it’s an entire Ethereum ecosystem in your pocket. Built on the Google Pixel 7a, the device comes loaded with ethOS—an open-source operating system deeply integrated with Ethereum. Beyond its catchy name that signifies both the Ethereum Operating System and “character” in Greek, ethOS supports a built-in Ethereum light client. This makes your phone a ‘light node’ in the Ethereum network, capable of independently validating blocks.\n\nPayment and Communication: Simplified and Streamlined\n\nThis is not just another gadget but a powerful tool that simplifies your interaction with the Ethereum blockchain. EthOS comes with an array of built-in utilities that handle payments, send and receive messages, and more. It also integrates with Ethereum Name Services (ENS) for easier payment processes, as well as supporting Ethereum Virtual Machines (EVM) and Layer 2 scaling networks.\n\nUnlocking the EthOS Experience Through NFTs\n\nBut how does one get their hands on such a groundbreaking device? Well, here’s the kicker. In order to qualify for purchasing one of these 50 ethOS smartphones, you needed to acquire an ethOS Non-Fungible Token (NFT). These NFTs then could be burned to reserve the smartphone. These ethOS NFTs have already made a splash in the market, trading on OpenSea for as much as three Ethereum, roughly equivalent to nearly $5,000. This stands in stark contrast to the Google Pixel 7a’s market price of $499.\n\nThe Web3 Arena: EthOS vs. Solana\n\nWhile ethOS steals the limelight, its competitor, the Solana (SOL) smartphone, has had a humbler reception. According to Flipside records, a mere 2,000 units of the Solana smartphone have been sold since its release. In an attempt to catalyze sales, Solana Labs slashed the price from $1,000 to $599, particularly after the ethOS smartphone made its grand entrance, set to premiere this fall.\n\nSo there you have it. As the Ethereum community celebrates this monumental achievement, the world watches with eager eyes for what’s next in this cutting-edge space."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDkvMDEvYml0Y29pbi1ldGhlcmV1bS1jbGFzc2lmaWVkLWNvbW1vZGl0aWVzLW55LWNvdXJ0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin and Ethereum classified as commodities: the final ruling of a New York court - The Cryptonomist",
        "content": "According to a New York judge, both Bitcoin and Ethereum, the top two cryptocurrencies by market capitalisation, can be considered commodities due to their decentralized nature.\n\nThis was ruled by the same judge dealing with the SEC vs Coinbase case, whose latest statement is guiding the public debate in reference to the exchange’s alleged violation of US securities laws.\n\nMeanwhile, a lawsuit against Uniswap and its founder ‘Hayden Adams’ has been dismissed over an affair involving the decentralized protocol and the emergence of a large number of token scams.\n\nFull details below.\n\nA New York court has defined both Bitcoin and Ethereum as commodities: the SEC is losing the war against crypto\n\nThe latest crypto news is about the decision of a New York court, which on Wednesday during the filing of a proposed class action against DEX Uniswap, explicitly cited that both Bitcoin and Ethereum are classified as commodities.\n\nThis was said by Judge Polk Failla, who also indirectly dealt with the SEC’s case against Coinbase, providing a key interpretation for upcoming legal proceedings on this issue.\n\nHence, the top two cryptocurrencies by market capitalisation are not comparable to financial securities, the sale of which for a broker must be preceded by an authorisation from the market supervisory authorities, but rather to commodities such as gold, platinum, oil, aluminium, palladium and many others.\n\n#ethereum and #bitcoin confirmed to be a commodity by a court/judge. The SEC doesn't get to decide. The SEC gets to follow the rules courts/judges set. How does that make you feel? pic.twitter.com/lSuv0HMMO4 — Dr. Julian Hosp (@julianhosp) September 1, 2023\n\nThe New York judge’s decision only sets precedents for the various lawsuits that the SEC has filed over the past three months, raising the hopes of the crypto community for the federal agency’s defeat.\n\nTo tell the truth, Gary Gensler himself has never gone so far as to define either Bitcoin or Ethereum as securities, aware that neither has the characteristics to be labelled as such, but has limited himself to attacking the so-called altcoins.\n\nThe agency will now have a lot of work to do, both in view of the upcoming deadlines for the long-awaited spot ETFs for the two assets, and with regard to the accusations made by the exchanges Binance and Coinbase, which are vigorously defending themselves before the law.\n\nAs far as only Bitcoin and Ethereum are concerned, without mentioning other currencies, the issue seems quite clear, especially given that the two crypto assets have already been present for years on the “Chicago Mercantile Exchange” (CME), a business centre where commodities are mainly traded.\n\nI mean both Eth & Btc have been on the Chicago Mercantile Exchange as commodities for years. So I’m unclear on why this is news tbh pic.twitter.com/yGfz00YUsC — metaflight.eth 🪐 (@NMetaverse) August 31, 2023\n\nLawsuit against Uniswap over scam tokens on the protocol is dismissed\n\nThe statements by Judge Katherine Polk Failla on the characteristics of Bitcoin and Ethereum, which classify digital currencies as commodities, came in the midst of a lawsuit filed by a group of investors against the decentralised platform Uniswap and its founder “Hayden Adams.”\n\nIn April 2022, a group of individuals sued Uniswap as being responsible for issuing scam tokens such as EthereumMax (EMAX), Bezoge (BEZOGE), Alphawolf Finance (AWF) and other ERC-20 tokens, at the same time violating US laws on unregistered securities.\n\nTo understand the matter, it is necessary to know that on the decentralised exchange in question, anyone can create and trade a token in a trustless manner, i.e. without anyone having to approve the transaction.\n\nMany times, those who create a new cryptocurrency have a plan to scam the buyer by suddenly removing all liquidity on the DEX or selling large batches of tokens on the market to make a profit.\n\nThe New York court expressed its opinion on the matter by agreeing with the defence and dismissing the case before it could go to trial.\n\nIn fact, it can be read from the papers that it is not Hayden Adams and his Uniswap protocol who are the real defendants in the case, but the issuers of the “scam tokens” who defrauded American investors.\n\nThe decentralised nature of the protocol makes it difficult to identify these issuers, especially given the fact that there is still no regulation in place that can go against law enforcement and facilitate the recognition and arrest of those responsible for the scams.\n\nIn this regard, citing the absence of relevant regulation, the Court concluded that investors’ concerns “are better addressed to Congress than to this Court”\n\nStating at the same time that Bitcoin and Ethereum represent two commodities, the judge refused to “extend federal securities laws to cover the alleged conduct.”\n\nThe story sounds very similar to the Tornado Cash case, where users outside the owners of the open source code used the protocol for illicit purposes, laundering money through the decentralised mixer.\n\nIn that case, the founders of Tornado Cash, unlike Hayden Adams, were arrested because they were held responsible for aiding the passage of dirty money through their platform without putting in place any preventive measures, even though they were aware of the illegalities that were taking place.\n\nThe founder of Uniswap himself described the final decisions of his trial as a great victory for DeFi, forgetting, however, that similar cases were closed in a totally different way.\n\nThere is still a long way to go before there is a homogenous interpretation by the courts on cases relating to wrongdoing on decentralised open source platforms."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LmJsb2NremVpdC5jb20vZXRoZXJldW0taW1wb3Nlcy0yMi1zZWxmLWxpbWl0LXJ1bGUtdG8tZW5zdXJlLWRlY2VudHJhbGl6YXRpb24v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Imposes 22% Self-Limit Rule To Ensure Decentralization - Blockzeit",
        "content": "Ethereum, one of the leading blockchain platforms, has been at the forefront of discussions surrounding decentralization. In recent developments, Ethereum staking services have embraced a groundbreaking self-limit rule, aimed at safeguarding the network’s decentralized nature.\n\nThe 22% Self-Limit Rule Explained\n\nAccording to Cointelegraph, at least five Ethereum liquid staking providers, including Rocket Pool, Stader Labs, Diva Staking, Puffer Finance, and StakeWise have either adopted or are actively working to implement a self-limit rule to keep the decentralized nature of the Ethereum blockchain. This rule restricts their ownership of the Ethereum staking market to no more than 22%.\n\nThe inspiration behind this number lies in the fact that Ethereum’s consensus mechanism requires 66% of validators to agree on the state of the network. By setting the limit at 22%, the rule ensures that a minimum of four major entities must collude for the chain to reach finalization, which is the point where transactions on the blockchain become immutable.\n\nThe Quest for Decentralization\n\nThis self-limit proposal, introduced by Ethereum core developer Superphiz in May 2022, reflects a deep-rooted concern within the Ethereum community about the potential centralization of staking services. The primary objective is to prevent any single entity from gaining excessive control over the network, thereby preserving its decentralized essence.\n\nThese providers are committed (or are in the process of committing) to self-limit to <22% of Ethereum validators. This is how our chain will be successful: Coordination above greed. Cooperation instead of winner-take-all.@Rocket_Pool @stakewise_io @staderlabs @divastaking — superphiz.eth 🦇🔊🛡️ (@superphiz) August 30, 2023\n\nThe Lido Finance Conundrum\n\nOne notable exception to this trend is Lido Finance, the largest Ethereum liquid staking provider. Lido currently dominates the Ethereum staking market, accounting for a substantial 32.4% of all staked Ether, with Coinbase trailing behind at just 8.7% market share based on data sourced from Dune Analytics.\n\nTop Ethereum Stakers (Source: Dune Analytics)\n\nIn a surprising move, Lido Finance, by an overwhelming 99.81% majority, voted against self-limiting in June.\n\nDivergent Opinions within the Ethereum Community\n\nThe Ethereum community’s response to the self-limit rule has been far from unanimous. Some argue that the rule doesn’t align with the principles of Ethereum, focusing instead on economic self-interest. They suggest that those pushing for the self-limit rule might have a different perspective if they were in Lido’s dominant position.\n\nBalancing Decentralization and Growth\n\nOn the other hand, there are those within the Ethereum community who express concerns about the centralization risks posed by Lido’s substantial market share. They view this dominance as “disgusting and selfish” and advocate for measures to ensure the broader Ethereum ecosystem’s health and decentralization.\n\nThe Future of Ethereum’s Decentralization\n\nAs Ethereum continues to evolve, the debate surrounding its decentralization will persist. The 22% self-limit rule represents a critical step towards maintaining a balance between market growth and network decentralization.\n\nIt serves as a reminder that the Ethereum community is vigilant in its commitment to keeping the platform decentralized, thereby enabling credible neutrality and permissionless innovation on the network.\n\nFinal Thoughts\n\nThe Ethereum community’s embrace of the 22% self-limit rule underscores its dedication to decentralization. This innovative approach seeks to prevent any single entity from gaining undue influence over the Ethereum staking market, thereby safeguarding the platform’s core principles.\n\nWhile opinions on this issue may vary, it highlights the Ethereum community’s ongoing commitment to striking the right balance between market dynamics and network integrity."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LmludmVzdGluZ2N1YmUuY29tL2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tZXRoLXR1bWJsZXMtYXMtYnRjLXB1bXAtZmFkZXMv0gFaaHR0cHM6Ly93d3cuaW52ZXN0aW5nY3ViZS5jb20vZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi1ldGgtdHVtYmxlcy1hcy1idGMtcHVtcC1mYWRlcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction – ETH Tumbles As BTC Pump Fades - InvestingCube",
        "content": "Ethereum (ETH) price is once again trending lower as the sell-off in the cryptocurrencies deepens. Most digital assets have lost their weekly gains as the BTC price fully retraced to its weekly lows. Technical analysis reveals that the ETH price is currently hanging by a thread.\n\nOn Friday, Ethereum is trading 0.61% lower after it suffered a 3.5% loss in its previous trading session. Most altcoins are showing a similar price action as the Bitcoin price fell below $26,000 today. Analysts are predicting more downside as the volatility increases in crypto markets.\n\nETH Price Faces Headwinds From Delayed Spot BTC ETF\n\nOn Thursday, the Securities and Exchange Commission (SEC) delayed the approval of spot Bitcoin ETF by another 45 days. The regulator is facing huge pressure from the community to approve a spot ETF for the biggest digital asset after the recent court win by the Greyscale.\n\nAfter the recent extension in deadline, Bitcoin and Ethereum prices lost their weekly gains as the short-term traders closed their longs. Despite the use of delaying tactics by the SEC, most analysts still believe that approval of a spot BTC ETF is only a matter of time.\n\nEthereum Price Prediction\n\nThe following daily chart shows that the ETH price is retesting the upward trendline. A breakdown below this trendline would make Ethereum price prediction extremely bearish, putting a massive downside on the cards. To avoid this bearish outlook, bulls need to break above the 200 MA, which currently lies at $1802.\n\nOn a weekly chart, ETH is trading below the 200 MA, which lies at $1638. If the price closes this week below the key moving average, I expect a major move to the downside. However, the week is not closed, and bulls still have some time to orchestrate a rebound.\n\nIn the meantime, I’ll keep sharing updated ETH to USD analysis and my personal trades on my Twitter, where you are welcome to follow me."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vaW5zaWRlYml0Y29pbnMuY29tL25ld3MvZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi1hcy1ldGgtZm9ybXMtYS1kcmVhZGVkLWRlYXRoLWNyb3NzLWhlcmVzLXdoYXQtdG8tZXhwZWN00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction: As ETH Forms A Dreaded 'Death Cross,' Here's What To Expect Next - Inside Bitcoins",
        "content": "Don’t invest unless prepared to lose all the money you invest. This is a high-risk investment, you shouldn’t expect to be protected if something goes wrong.\n\nJoin Our Telegram channel to stay up to date on breaking news coverage\n\nEthereum (ETH) has formed a so-called ‘Death Cross,’ but history suggests it may not necessarily prove deathly for the cryptocurrency’s price.\n\nThis Death Cross occurs when a short-term moving average crosses below a long-term moving average. In this case, it is the 50-day Simple Moving Average (red) and the 200-day SMA (green). The name comes as the crossover often triggers a bearish phase in the market in the long run.\n\nWith the Death Cross executed on the daily chart for the ETH/USD trading pair, a prolonged downside may be imminent and the price may drop below the psychological $1,000 level to the critical support of $882. This level, which is about 46% down from the current price level, has provided crucial support in the history of Ethereum’s price action.\n\nEthereum Price Support from a Historical Perspective\n\nIf we take a look at the extended daily price chart of ETH/USD since 2018, the cryptocurrency has experienced six Death Crosses. Yet it has often moved contrary to expectations.\n\nOut of the previous five death crosses, ETH’s price has experienced significant losses only twice. The above chart’s first and last death cross shows downside price movement. However, after the 2nd Death Cross, prices have remained in consolidation.\n\nFurthermore, the prices have moved in the upside direction after the 3rd and 4th Death Crosses. These contrary movements were due to the formation of the Golden Cross immediately after the Death Cross.\n\nPossible Outcomes\n\nNow, given this scenario, we can assume two outcomes:\n\nEthereum price will continue to fall until $882, its critical support in the long run, and it will experience double-digit losses following this Death Cross.\n\nEthereum price might move in consolidation and reverse back to the upside on the formation of Golden Cross in the next few days.\n\nTo conclude, the formation of the Death Cross is expected to decrease prices a little. However, it should be noted that the Death Cross indicator alone is not a reliable method for analyzing the future price movement of an asset.\n\nOn-chain Metric: IntoTheBlock\n\nData from IntoTheBlock shows that at current prices, 57.62% of token holders are incurring losses (out of the money), while only 36.43% are making a profit (in the money). Meanwhile, 5.96% of token holders are breaking even (at the money).\n\nWith the lion’s share of token holders suffering losses, Ethereum’s price could fall soon. This will come as the cohort that is “out of the money” looks to sell to avoid suffering more losses. They could either sell at current prices or wait for when they finally break even. The ensuing selling pressure is likely to send ETH market value downward, thereby activating the death cross effect.\n\nA Promising Alternative To Ethereum\n\nGiven the risky outlook for Ethereum, investors may want to consider alternatives such as SONIK Coin. Inspired by Sonic the Hedgehog, it has recently gained significant momentum. In its presale, the project has raised nearly $960,000 in total. Currently available at a presale price of just $0.000014 per token, investors have the opportunity to get in early. Once the project reaches its $2 million target, it will be listed on exchanges, potentially driving its value higher.\n\nOnly 3 days and 20 hours are left for the presale to end. This limited time period is an alarm for interested investors to join the project for future benefits.\n\nThe Sonik Coin team is ambitious, aiming for a market capitalization of $100 million. The market is expecting to see nearly fiftyfold return on initial investments following the end of presale.\n\nFurthermore, Sonik holders can stake their tokens to earn rewards along with the potential price gains.\n\nThe team has allocated about 40% of the total supply for distribution among stakers over the next four years. The current staking rate offers an annual percentage yield (APY) of 88%, which is above industry’s average. This stake-to-earn feature of a newly appeared memecoin is what giving strength to this project.\n\nHere is how to buy SONIK\n\nAlso Read:\n\nNew Crypto Mining Platform - Bitcoin Minetrix Rating Audited By Coinsult\n\nDecentralized, Secure Cloud Mining\n\nEarn Free Bitcoin Daily\n\nNative Token On Presale Now - BTCMTX\n\nStaking Rewards - Over 50% APY Learn More"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDkvMDEvdmMtc3BlY3RyYS1zcGN0LWJlc3QtcHJlc2FsZS1wZXJmb3JtYW5jZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "VC Spectra (SPCT): Best Presale Performance - The Cryptonomist",
        "content": "SPONSORED POST*\n\nThe crypto market is currently in an uptrend due to Grayscale’s recent victory in its case against the SEC. The win pumped BTC’s price alongside top altcoins in the market. BNB (BNB) and Ethereum Classic (ETC) have benefited greatly from this win. However, the Ethereum Classic price prediction shows a little twist in its ongoing price surge.\n\nOn the flip side, VC Spectra (SPCT), one of the new DeFi projects, continues to prove its potential in its ongoing presale. VC Spectra (SPCT) recently recorded an impeccable price surge that’s unmatched by both BNB (BNB) and Ethereum Classic (ETC). Let’s find out more!\n\n>>BUY SPCT TOKENS NOW<<\n\nBNB Integrates Backed: Grayscale’s Win Pumps Price\n\nOn August 29, 2023, Backed revealed it will be expanding its native token issuance to the BNB Smart Chain (BSC). The news suggests an increase in BNB’s adoption and utility within the blockchain system.\n\nThe Backed announcement was followed by Grayscale Investments’ victory in its case against the SEC. This caused an upsurge in Bitcoin’s (BTC) price, which pumped the price of other altcoins, including BNB.\n\nBetween August 29 and August 30, 2023, BNB made a 3% increase from $217.67 to $225.26. Due to its integration with Backed, market analysts suggest that BNB is bound to see some increase in its market capitalization in the coming weeks. As a result, the BNB price prediction shows that the token can reach $237.68 by September 2, 2023.\n\nEthereum Classic (ETC) Surges Due to Grayscale’s Victory\n\nEthereum Classic (ETC) has been trading in red over the past weeks. Since the beginning of August, the unity token has been trying to maintain the $18 price level. Sadly, the general market decline pushed Ethereum (ETC) down to $14 on August 17, 2023.\n\nHowever, due to Grayscale’s Victory that pumped Bitcoin’s (BTC) price, Ethereum Classic (ETC), along with other altcoins, appears to be making a comeback.\n\nBetween August 29 and August 30, 2023, Ethereum Classic (ETC) rose from $15.64 to $16.95. This represents an 8% increase in the price of Ethereum Classic (ETC) since Grayscale’s win on August 29, 2023.\n\nDespite its recent price pump, the Ethereum Classic price prediction still shows a pessimistic outlook. Market analysts suggest its current surge is a phase that will die soon. Due to its performance in the past months, experts predict that Ethereum Classic (ETC) will decline to $15.23 by September 2, 2023.\n\nVC Spectra (SPCT) Yields Impeccable Returns In the Presale Stage\n\nIn a rapidly evolving landscape, VC Spectra (SPCT) has emerged as one of the top DeFi coins in the world of asset management blockchains. As a decentralized investment management system, VC Spectra (SPCT) has garnered significant attention for its innovative approach to generating sustainable income.\n\nVC Spectra (SPCT) employs AI technology and algorithmic trading strategies to identify and invest in high-potential blockchain and fintech projects with the aim of generating the most returns to investors.\n\nVC Spectra (SPCT) is now in Stage 3 of its public presale, selling at $0.025 per token. This represents a whopping 212.5% ROI for investors who bought at the initial price of $0.008 in Stage 1 and 127.27% ROI for Stage 2 investors who bought at $0.011.\n\nVC Spectra’s (SPCT) ongoing price surge is aimed at reaching $0.08 by the end of the presale. This translates to 220% ROI for old investors and those who invest now!\n\nTo learn more about VC Spectra (SPCT) and its presale, visit:\n\nBuy Presale: https://invest.vcspectra.io/login\n\nWebsite: https://vcspectra.io\n\nTelegram: https://t.me/VCSpectra\n\nTwitter: https://twitter.com/spectravcfund\n\n*This article was paid for Cryptonomist did not write the article or test the platform."
    }
]