[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMitAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL21hZ2ljLWVkZW4tYW5ub3VuY2VzLWV0aC1nZW5lc2lzLWFuLWV0aGVyZXVtLW1hcmtldHBsYWNlLWFuZC10aGUtbGF1bmNoLW9mLW92ZXItMTAtbmZ0LWNvbGxlY3Rpb25zLXRocm91Z2gtaXRzLWV0aC1sYXVuY2hwYWQtMzAxNzg0NzUwLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Mar 2023 07:00:00 GMT",
        "title": "Magic Eden Announces 'ETH Genesis': An Ethereum Marketplace and the Launch of Over 10 NFT Collections Through ... - PR Newswire",
        "content": "With the upcoming launch of ETH Genesis, Magic Eden continues to expand its cross-chain capabilities to serve creators and collectors across NFT ecosystems\n\nSAN FRANCISCO, March 29, 2023 /PRNewswire/ -- Magic Eden (\"The Company\"), the leading cross-chain NFT platform, today unveiled ETH Genesis - the beta launch of its Ethereum (ETH) marketplace along with over 10 new Ethereum collections available for mint through its Launchpad. With the launch of ETH Genesis scheduled for Thursday, April 6, Magic Eden is curating the top ETH mints for collectors and providing a platform where they can seamlessly mint and trade ETH NFTs efficiently.\n\nTo expand its base of the creators and collectors the platform can serve, Magic Eden is pushing forward with its cross-chain efforts by rolling out its Ethereum marketplace and devoting its attention to its ETH Launchpad in order for the platform to become the ultimate destination for NFTs on all chains. ETH Genesis is the next step in Magic Eden's expansion within Ethereum, following its initial integration into the ecosystem last year. Magic Eden will launch a marketplace that will respect royalties for native listings, with the goal of eventually aggregating marketplaces across the ecosystem.\n\nZhuoxun Yin, COO and co-founder of Magic Eden, commented: \"We've always respected Ethereum as the largest, most established community for NFTs. We bring proven ability to partner with creators as the only NFT platform that has launched 400+ projects and raised over $120M for creators. We also have a team of shippers that can move nimbly. We think our strengths will continue to serve the growth of ETH's NFT ecosystem. In the spirit of iteration, we're going to start making inroads with our own marketplace and dedicated launch partners, and grow from there.\"\n\nTo commemorate the ETH marketplace launch, Magic Eden will be partnering with leading projects in the ecosystem, including Hashflow, CNWAFUKU, KaijuKingz, Realm Hunter, The Space Club, McPepe's, Blocky Doge 3.0, Freakz by Subber, Shrapnel, Magna, ZTX, Serial Experiments Lain, and Code Name: Stardust. For a limited time, Magic Eden will provide its partners with a \"royalty boost\" and share revenue from marketplace fees with the listed launchpad partners. The team will continue to support creators on the marketplace with royalties for all ETH NFT collections traded on native listings.\n\nMagic Eden acts as a single landing place for NFTs across various chains, where collectors visit to discover and mint the most vibrant projects selected through careful consideration and vetting processes. The team curates the top ETH mints, providing users a seamless experience where they can trade pieces from collections living on the most prominent blockchains, including the recent addition of Bitcoin.\n\nAs a marketplace that strives to best-serve both creators and collectors, Magic Eden has been introducing countless features that benefit both communities. These include rewards programs for collectors and traders, highlighted by advanced analytics for traders, and announcement support and Launchpad service for creators. Over the coming months, the company plans to scale its differentiators to continue expanding into new and existing markets. Today marks the initial phase of the ETH marketplace rollout, and the team will continue to expand upon the offering over the coming months.\n\nAbout Magic Eden\n\nMagic Eden is the leading cross-chain NFT platform driving the next billion users to Web3. Led by former crypto, tech, and hospitality leaders, Magic Eden is building a user-friendly platform powered by market-leading minting and trading solutions. Magic Eden brings dynamic cultural moments onto the blockchain, empowering users across thousands of digital communities to create, discover and collect unique NFTs. For more information, please visit www.magiceden.io .\n\nMedia Contact\n\nDillon Arace\n\n[email protected]\n\nSOURCE Magic Eden"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5maW5hbmNlbWFnbmF0ZXMuY29tL2NyeXB0b2N1cnJlbmN5L2VkdWNhdGlvbi1jZW50cmUvdGhlLXJvbGUtb2YtZW50ZXJwcmlzZS1ldGhlcmV1bS1hcHBsaWNhdGlvbnMtYmVuZWZpdHMtYW5kLWNoYWxsZW5nZXMv0gGJAWh0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvZWR1Y2F0aW9uLWNlbnRyZS90aGUtcm9sZS1vZi1lbnRlcnByaXNlLWV0aGVyZXVtLWFwcGxpY2F0aW9ucy1iZW5lZml0cy1hbmQtY2hhbGxlbmdlcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Mar 2023 07:00:00 GMT",
        "title": "The Role of Enterprise Ethereum: Applications, Benefits, and Challenges - Finance Magnates",
        "content": "Enterprise Ethereum is a blockchain network created primarily for enterprises. It is built on the Ethereum blockchain, which is well-known for its adaptability and scalability. This article will look into Enterprise Ethereum's position in business, including its applications, benefits, and challenges.\n\nWhat Is Enterprise Ethereum?\n\nEnterprise Ethereum is a blockchain technology intended specifically for enterprises. It is built on the Ethereum blockchain, a decentralized platform that allows for the development of smart contracts and decentralized apps. (DApps). Enterprise Ethereum is a private blockchain, which means that only authorized users may access it.\n\nEnterprise Ethereum Applications\n\nEnterprise Ethereum has several business applications. Among the most important applications are:\n\nSupply Chain Administration\n\nSupply chain management is a fundamental use of Enterprise Ethereum. It can be used to trace the flow of commodities, validate product authenticity, and streamline supply chain operations. Many supply chain management procedures, such as checking the legitimacy of items and completing payments, can be automated using smart contracts.\n\nKeep Reading Will Blockchain Technology Mark a Turning Point in Fraud Prevention?\n\nIdentity Administration\n\nIdentity management is another Enterprise Ethereum application. It can be used to manage and verify identities securely, lowering the risk of identity theft and fraud. Smart contracts can be used to maintain identification information and give authorized users secure access.\n\nEthereum can be utilized in financial services as well. It can be used to simplify payment procedures, lower transaction costs, and improve transparency. Smart contracts can be used to automate numerous financial services procedures, such as payment execution and contract management.\n\nAdvantages of Enterprise Ethereum\n\nEnterprise Ethereum provides various advantages to enterprises. Among the many advantages are:\n\nIncreased Enterprise Efficiency\n\nBy automating many of the processes involved in company operations, Ethereum can assist to boost efficiency. Smart contracts can be used to automate operations like confirming the legitimacy of items, making payments, and monitoring contracts.\n\nThis can help to reduce the amount of time and resources needed to complete transactions, hence enhancing efficiency and production.\n\nIncreased Security\n\nEnterprise Ethereum provides greater security than typical commercial platforms. Transactions are safe and tamper-proof due to the usage of blockchain technology. Smart contracts are also intended to be tamper-proof, which means they cannot be changed after they have been executed.\n\nAs a result, Enterprise Ethereum offers a safe and dependable means to execute transactions.\n\nEnterprise Cost Savings\n\nBy eliminating the need for intermediaries, such as banks or attorneys, Ethereum can assist to minimize transaction costs. Smart contracts can be used to perform transactions without the involvement of middlemen, lowering transaction costs and enhancing profitability.\n\nEnterprise Ethereum's Challenges\n\nWhile Enterprise Ethereum has many advantages for organizations, it has certain drawbacks. Among the major challenges are:\n\nTechnical Difficulty\n\nEnterprise Ethereum is a difficult technology that must be used with technical skills. To use Enterprise Ethereum efficiently, businesses must have a solid understanding of blockchain technology and smart contracts. This may necessitate substantial investment in training and development.\n\nLegacy System Integration\n\nIt can be difficult to integrate Enterprise Ethereum with legacy systems. Businesses must verify that their existing systems are Enterprise Ethereum compliant, which may necessitate significant investment in technical infrastructure.\n\nCompliance with Regulations\n\nEnterprise Ethereum adoption may also generate regulatory compliance concerns. Businesses must ensure that their activities are in accordance with applicable laws and regulations, which can be complicated and time-consuming.\n\nNew avenues for business\n\nOne of the key benefits of Enterprise Ethereum is its ability to enable new forms of collaboration and cooperation between businesses.\n\nSmart contracts\n\nSmart contracts, a key feature of Enterprise Ethereum, are self-executing contracts with the terms of the agreement between parties being directly written into code. This means that once the conditions specified in the contract are met, the contract automatically executes without the need for intermediaries or third parties. Smart contracts can automate many aspects of inter-business transactions, such as payment processing, supply chain management, and legal operations.\n\nOne of the main benefits of smart contracts in Enterprise Ethereum is that they can reduce friction and improve efficiency in business-to-business interactions. By automating processes and removing intermediaries, businesses can reduce costs, eliminate errors, and streamline their operations. This can significantly reduce the time and effort required for these tasks, allowing businesses to focus on their core activities.\n\nSmart contracts in Enterprise Ethereum can also enable more seamless collaboration between businesses. For example, in supply chain management, smart contracts can automate the process of verifying the authenticity and quality of goods, reducing the risk of fraud and enabling faster and more secure transactions. Additionally, smart contracts can automate the process of dispute resolution, reducing the time and effort required to resolve disputes between parties.\n\nDecentralized Applications\n\nAnother way that Enterprise Ethereum can enable new forms of collaboration is through the use of decentralized applications (dApps). dApps are software applications that run on the Ethereum blockchain, enabling secure and transparent transactions between parties. They can be used for a variety of purposes, such as decentralized finance (DeFi), supply chain management, and identity verification.\n\nBy using dApps built on Enterprise Ethereum, businesses can collaborate and cooperate in new ways. For example, in DeFi, businesses can participate in decentralized lending and borrowing, enabling faster and more secure transactions than traditional banking systems. In supply chain management, businesses can collaborate to improve efficiency and transparency in the supply chain, reducing costs and improving customer satisfaction.\n\nConclusion\n\nEnterprise Ethereum provides various benefits to enterprises, including higher productivity, improved security, and lower costs. However, it does provide several obstacles, including technical complexity, interaction with older systems, and regulatory compliance.\n\nOverall, Enterprise Ethereum can assist firms in streamlining operations, lowering expenses, and increasing profitability. However, before incorporating Enterprise Ethereum into their processes, organizations must carefully assess the opportunities and problems it presents.\n\nEnterprise Ethereum, with careful planning and execution, has the ability to alter the way organizations function and communicate with one another, enabling secure and transparent transactions without the need for middlemen.\n\nAs Enterprise Ethereum evolves and matures, we should expect to see even more inventive corporate use cases and applications. Businesses will be able to streamline processes, decrease costs, and boost efficiency by utilizing smart contracts and decentralized applications, while also improving security and transparency.\n\nOverall, Enterprise Ethereum plays an important and expanding role in business. While there are some challenges to overcome, the benefits of using Enterprise Ethereum are significant, and it is becoming a more popular choice for businesses looking to streamline operations and improve efficiency.\n\nWe should anticipate seeing many more fascinating advancements in the application of Enterprise Ethereum in business as the technology evolves and matures."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmZpbmV4dHJhLmNvbS9ibG9ncG9zdGluZy8yMzk4MC90aGUtZXRoZXJldW0tMjAtam91cm5leS1mcm9tLWJlYWNvbi10by1ldGVybml0edIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Mar 2023 07:00:00 GMT",
        "title": "The Ethereum 2.0 Journey: From Beacon to Eternity - Finextra",
        "content": "Last year September Ethereum blockchain entered a new phase in its Ethereum 2.0 journey. After launched the Beacon Chain in December 2020, a parallel blockchain which acts as consensus engine that runs on proof of stake, The Merge was concluded in September 2022 whereby the Beacon Chain and the Mainnet, the normal Ethereum blockchain, merged into one blockchain thereby switching from Proof of Work to Proof of Stake.\n\nRecently it was announced that a third important step is planned on 10 April: the Shanghai upgrade or hard fork. This upgrade is expected to bring significant improvements to the network, including enhanced scalability, improved security, better support for smart contracts and decentralized applications as well as greatly reducing energy consumption.\n\n\n\nIn this blog I will take you by the hand in the further Ethereum 2.0 journey towards the final stage: Eternity.\n\nBeacon Chain: start of the Ethereum 2.0 journey\n\n\n\nThe Ethereum 2.0 journey was kickstarted by the Beacon Chain launch in December 2020, termed Phase 0 of the Ethereum 2.0 roadmap. This phase aimed to introduce and test the proof of stake consensus in the Ethereum context.\n\nThe Beacon Chain was a blockchain which acted as a consensus engine of Ethereum 2.0, the part that coordinates the entire system. This upgrade proposed a parallel blockchain which runs on proof of stake, while the Ethereum Mainnet continued to be secured by proof of work.\n\nThe Beacon Chain did not process transactions or host the smart contracts. It was intended as the heart of Ethereum 2.0, which would replace the miners in Proof of Work with validators who decide the blocks.\n\n\n\nPrior to the Merge, validators began staking 32 ether (ETH) on the Beacon Chain in order to participate in the block validation process. Validators could stake their ethers in smart contracts, and as a reward they got interest. Before validators agreed to participate on the PoS blockchain, they were made aware that their staked ETH and any accrued rewards would remain locked up until a subsequent update to the chain.\n\nThe Merge\n\nOne of the most anticipated crypto occasions last year was the Ethereum Blockchain’s Merge. On 15 September 2022 the Beacon Chain with its new proof of stake consensus layer and the Mainnet, the normal Ethereum blockchain, merged into one blockchain. The Merge marked a significant step in the Ethereum blockchain’s transition to a proof-of-stake (PoS) consensus mechanism from proof-of-work (PoW).\n\n\n\nThe Merge represents the formal adoption of the Beacon Chain on the new consensus layer to the original Mainnet execution layer. The Merge will completely cast aside the role of crypto miners, to now assign the ‘validators’ who randomly approve transactions and add blocks to the Ethereum blockchain and earn a small reward, eliminating the need for energy-intensive mining. Instead of competing on speed and energy to generate a hash - it is estimated that Ethereum’s energy consumption got reduced to a whopping 99.95% - validators in PoS systems compete on the amount of ether staked (deposit).\n\nValidators are now responsible for processing the validity of all transactions and proposing blocks. A validator will be chosen at random from a group of individuals who have “staked” (basically, pledged at least 32 Ethereum tokens on the network) their money. The PoS system should ensure the validator nodes are sufficiently incentivized to maintain the network’s security. The more ETH a validator stakes, the more likely they will be selected to “propose” the next block of Ethereum transactions and earn some network rewards.\n\nBut in addition to accessing locked up funds, the PoS blockchain has not been fully featured ever since it went live. Even though the blockchain functions properly today, stakers have had to commit to keeping their funds locked in order to keep Ethereum running.\n\n\n\n\n\nUpcoming upgrades\n\nEthereum has announced a number of important upgrades on 10 April. Shanghai and Capella are the upcoming Ethereum hard forks names. Ethereum developers have started to refer to the blockchain’s upcoming hard forks – in this case a key upgrade – as (Shanghai + Capella =) “Shapella.”\n\nThe Ethereum protocol is made up of two layers: the execution layer and consensus layer. Now, the two layers have different functions that help move the Ethereum blockchain forward. The execution layer is where all smart contracts and protocol rules live. The consensus layer is in charge of making sure that all validators on the network are following those rules.\n\nTechnically the Shanghai upgrade is only on the execution side of Ethereum. Capella is the simultaneous upgrade happening on the consensus side. Major changes to the consensus layer include full and partial withdrawals for validators and independent state and block historical accumulators, replacing the original singular historical roots.\n\nShanghai upgrade\n\nThe Shanghai upgrade, also known as hard fork, initially scheduled for March was later postponed by Ethereum developers until 12 April. This upgrade is expected to bring significant improvements to the network, including enhanced scalability, improved security, and better support for smart contracts and decentralized applications. The network upgrade will address staked ether withdrawals and reductions in gas fees for developers.\n\nSome key Ethereum improvement proposals (EIP) on the execution layer include Beacon Chain push withdrawals and warm Coinbase. The Shanghai upgrade will complete Ethereum’s full transition to a proof of stake (PoS) network by finally allowing validators to withdraw their staked Ether from the Beacon Chain to the Ethereum Virtual Machine (the execution layer) via a new “system-level” operation type. The Ethereum Virtual Machine (EVM) is the environment where Ethereum is able to execute smart contracts.\n\nUp till now a total of 16 million ETH (roughly 30 bn dollar) have thus far been “staked” on the Beacon Chain to help secure the network since December 2020.\n\nTo prevent instability on the market, validators cannot stake in one go. They may be subject to a daily ETH redemption quota because of the processing constraints on the Ethereum network. They can only stake their saved staking yields immediately. In total less than 60.000 ETH a day will be available for withdrawal.\n\nThe warm Coinbase is the name of the software that builders use to receive new tokens on the network. Every new platform transaction must interact with the Coinbase software multiple times. With the introduction of EIP-3651 the Coinbase software will remain warm to begin with, requiring a lower gas fee to access it, instead of needed to ‘warm up’.\n\nNow with the mechanism that will unlock staked ETH, the full operation of a proof-of-stake blockchain will come to life, meaning that stakers can finally have control over their funds and decide what they want to do with their rewards.\n\nUpdated roadmap: Further upgrades\n\nThe Shanghai upgrade is a major upgrade and transformation of the Ethereum network. It is an essential step on the road to Serenity, which is the final phase of the broader roadmap for Ethereum 2.0.\n\nThe Ethereum updated Roadmap paves the way for a number of further upgrades within the coming years. The Merge has set the stage for further scalability upgrades not possible under proof-of-work, bringing Ethereum one step closer to achieving the full scale, security and sustainability. Ethereum 2.0 will thereby introduce several new technologies and protocols, proto-danksharding, and a new virtual machine (VM) called eWASM. There are four major upgrades with interesting names such as Surge, Verge, Purge and Splurge.\n\n\n\nThe Surge: Proto-danksharding\n\n\n\nDevelopers decided to keep the scope of the Shanghai upgrade relatively small, mainly so that staked ETH withdrawals would be released as soon as possible. As a result, some other big changes to the Ethereum protocol such a proto-danksharding primarily aimed at improving transaction output, were pushed back to the third quarter of 2023.\n\n\n\nThe initial plan was to implement sharding, splitting up transactions into multiple chains to reduce fees and speed up transactions. But, as sharding has proven difficult to implement and as Layer 2 technologies evolved, the sharding plan was updated to a format that improves the scalability of Layer 2 networks or rollups like Arbitrum and Optimism: the so-called Pro-danksharding also known as EIP-4844.\n\n\n\n“[Proto-]danksharding will be the most exciting thing devs will work on in 2023.” Proto-danksharding has “the potential to onboard millions of users and truly provide scalability to Ethereum.” Parithosh Jayanthi, DevOps engineer Ethereum Foundation\n\nThe proposed Proto-danksharding (PDS) aims to move all computation to Layer 2 networks (execution layer) and data to be posted on the Ethereum mainnet (data layer). Layer 2 networks are companion systems designed to help a cryptocurrency system handle a larger volume of data. Compared to sidechains, Layer 2 networks or rollups are considered to be the more secure way for Ethereum to scale. Rollups, like sidechains, take the stress off of Ethereum by executing transactions on a separate blockchain.\n\nWhile danksharding takes the same principle of splitting a network into shards, instead of providing more space for transaction, it is adding a new transaction type to Ethereum, the so-called blob-carrying transaction which can carry an extra piece of data called blob, allowing Ethereum to process more data. Transactions are ‘settled’’ on the rollup chain, bundled, and then ‘posted’ to Ethereum.\n\nUnlike sidechains, rollups borrow their security from the Ethereum mainnet, thereby using fancy cryptography and other methods (like a multi-day dispute period) to allow Ethereum mainnet nodes to confirm that transactions are legitimate.\n\nOnce the proto-danksharding and its associated updates are in place, it is expected to be able to at least increase the transaction throughput to 100,000 transactions per second and beyond (on rollups), significantly decreasing the cost of using rollups.\n\n\n\nThe Verge\n\n\n\nAnother upgrade is The Verge that reduces the amount of blockchain data that validators have to store for transaction validation purposes.\n\n\n\nThe verge will therefore introduce a new data structure called “Verkle trees”. This is – a modified version of a Merkle tree that blockchains like Bitcoin typically use. Verkle trees use vector commitments instead of hash functions in Merkle Tree. A Merkle-Tree requires more hashes as the number of child nodes increases, whereas using vector commitments allow the tree to expand without increasing the proof size.\n\n\n\nThe Verge will also introduce “stateless clients,” which allow users on the network to become validators without having to store extensive amounts of data on their machines. This means validators can run a node with a lower hardware requirement, making it more economical to run a node in the long run.\n\n\n\nThe Verge aims to simplify the verification of blocks. It has a set of plans which can decrease the hardware requirements of validators. Stateless clients can verify blocks without downloading a local copy of Ethereum’s state, which can boost the storage requirement. These updates are mainly related to zero-knowledge (ZK) technology.\n\n\n\nThe Purge\n\n\n\nThe purge aims to reduce the amount of space required on one’s hard disc, simplify the Ethereum protocol over time, and stop needing nodes to keep history using history and state expiration. Similar to Verge, the role of Purge is to minimise memory load on the client side, by reducing outdated excess historical data on the blockchain.\n\n\n\nHistory expiration will instruct nodes to stop serving historical blocks whose age is above a limit and allow nodes to delete these from their local copy of the blockchain. New nodes will follow a different syncing mechanism which will sync the chain from the most recently finalized block instead of the genesis block. Once a node is fully synced, it will not require historical data to validate future blocks.\n\n\n\nThis doesn’t mean that data would get deleted from the blockchain after some time. Only fewer services in the world would store the complete and full historical data of the Ethereum blockchain. This will also help minimise network congestion, as validators themselves can process each transaction without back-checking the entire blockchain history. The entire history becomes accessible only on demand.\n\n\n\nThe idea of state expiration is to prune portions of the state that have remained unused for a certain period. The shortened state will be represented by a Verkle tree root that users can use to retrieve the expired state. The expiration techniques can reduce the storage requirements for nodes and ease processing requirements on the client side. This phase also proposes changes to logs, data serialization and EVM operations.\n\n\n\n\n\nThe Splurge\n\n\n\nAs the name suggests, at this phase, Ethereum 2.0 devices can go on a “development splurge” to include features that are currently considered low priority.\n\n\n\nA series of upgrades will combine improvement proposals that don’t exactly fit in with the high priority upgrade phases. This includes a set of miscellaneous updates related to various factors to ensure that the network keeps operating smoothly and that the updates to the protocol in the previous sections do not cause any issues.\n\n\n\nIt is anticipated that Ethereum 2.0 will especially focus on introducing new features to enable the development of decentralized applications simpler. It will include new capabilities that will make it easier for programmers to comprehend what is happening between their code and the EVM. While the account abstraction aims to reduce from two account types down to one, a contract account. This will allow users to choose arbitrary verification logic, like quantum-resistant signature schemes.\n\nThe further road to Serenity\n\nSerenity, the final stage of the Ethereum 2.0 roadmap, is expected to bring even more significant improvements and enhancements to the network, including the ability to handle millions of transactions per second, support for private transactions, while also reducing energy consumption and improving security and decentralization.\n\nEthereum 2.0 and Serenity are highly anticipated by the Ethereum community. As the Ethereum blockchain is a house to some of the most widely used cryptocurrency applications, they are expected to play a significant role in the future of decentralized finance (DEFI), non-fungible tokens (NFTs), and other blockchain-based applications and services. It would however still take a number of years until Ethereum 2.0 reaches the final stage of this broader roadmap. By then, the Ethereum network would look very different to what we see today.\n\nMany analysts believe that the Ethereum 2.0 ecosystem that is now being constructed will lead to a system that will attract many more investors. They expect that Ethereum will play an important role especially for investors from the traditional money markets. They not only may benefit from a passive income with low maintenance costs to maintain their positions. What is more important is the fact that they may benefit of complete liquidity now Ether is no longer completely locked in stakes. It is this aspect that many do believe that Ethereum will enter a new area with more traditional institutional investors that wish to buy a stake in on one of the most important smart contract platforms."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDMvMjkva2VlcC1nb2VybGktZXRoZXItYWxpdmUtYXMtZXRoZXJldW0tY2FuYXJ5LW5ldHdvcmstZGFvLWFyZ3Vlcy_SAWtodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzAzLzI5L2tlZXAtZ29lcmxpLWV0aGVyLWFsaXZlLWFzLWV0aGVyZXVtLWNhbmFyeS1uZXR3b3JrLWRhby1hcmd1ZXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Mar 2023 07:00:00 GMT",
        "title": "Keep Goerli Ether Alive as Ethereum Canary Network, DAO Argues - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vdWsuZmluYW5jZS55YWhvby5jb20vbmV3cy9jcnlwdG8tYml0Y29pbi1ldGhlcmV1bS1wcmljZS11cy1mdHgtc2FtLWJhbmttYW4tZnJpZWQtYnJpYmVyeS0wOTMyMTgzMjIuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Mar 2023 07:00:00 GMT",
        "title": "Crypto: Bitcoin, ethereum price | US charges FTX's Bankman-Fried with bribery - Yahoo Finance UK",
        "content": "US prosecutors have added bribery added to the long list of charges against Sam Bankman-Fried. They say he paid $40m to Chinese government officials. Photo/Seth Wenig/AP (ASSOCIATED PRESS)\n\nBitcoin and ethereum made gains of over 4% in the past 24 hours, as fallen crypto-tycoon Sam Bankman-Fried has bribery allegations added to the 12 existing charges against him.\n\nThe cryptocurrency market cap has risen by 4.3% to $1.22m (£0.99m), according to data from Coingecko.\n\nRead more: Crypto roundup: US charges Sam Bankman-Fried | Binance faces CFTC | Bitcoin price\n\nBitcoin (BTC-USD) rose 4% to $28,098, with ether (ETH-USD) is up 4.4% to $1,808.\n\nAltcoins are also in the green, with polygon (MATIC-USD) up 8.4% to $1.14 and XRP (XRP-USD) rising by 16.5% to $0.55.\n\nCFTC declares E ethereum and l litecoin as commodities, like B bitcoin\n\nThe US Commodities Futures Trading Commission (CFTC) has stated that alongside bitcoin, it classifies ethereum and litecoin as commodities, which would see them recognised as trading assets, similar to gold or oil.\n\nADVERTISEMENT\n\nThe CFTC claimed in its suit against Binance on Monday, that the cryptocurrency exchange had engaged in transactions with “digital assets that are commodities including bitcoin (BTC), ether (ETH), and litecoin (LTC) for persons in the United States\".\n\nCCFTC chairman Rostin Behnam reiterated on Tuesday at a congressional hearing that he believes ethereum is a commodity, adding that \"because they are listed on CFTC exchanges, we do have a regulatory relationship, obviously with the derivatives market and that product, but the underlying market as well\".\n\nLawmakers inquired if Behnam still intends to create room for crypto innovation in the US, as he had previously expressed.\n\n\"It should be definitely a priority,\" he responded, adding that Europe has established an extensive framework to be implemented in the upcoming years, emphasising that the US should not fall behind in terms of innovation.\n\nIf ether is officially classified as a commodity, it could have more freedom and flexibility in terms of its development and use.\n\nSam Bankman-Fried accused of bribery by US prosecutors\n\nOn Tuesday, US prosecutors filed a revised indictment against Bankman-Fried, accusing him of paying a $40m bribe to Chinese government officials so that he could gain access to frozen Alameda Research trading accounts.\n\nStory continues\n\nAlameda Research was the sister company of collapsed FTX cryptocurrency exchange, and was also registered in the Bahamas.\n\nRead more: Crypto live prices\n\nThe revised indictment states that Bankman-Fried persistently strived to release the frozen accounts associated with Alameda Research, which involved hiring lawyers to advocate for the company's interests in China.\n\n\"In or about November 2021, Samuel Bankman-Fried, a/k/a 'SBF,' the defendant, and others directed and caused the transfer of at least approximately $40m in cryptocurrency intended for the benefit of one or more Chinese officials in order to influence and induce them to unfreeze the accounts,\" it said.\n\nWatch: Get your money off exchanges' warns Bitboy Crypto after FTX scandal | The Crypto Mile\n\nDownload the Yahoo Finance app, available for Apple and Android."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9hbmFseXN0cy1kZWJhdGUtdGhlLWV0aC1wcmljZS1vdXRjb21lcy1vZi1ldGhlcmV1bS1zLXVwY29taW5nLXNoYXBlbGxhLXVwZ3JhZGXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Mar 2023 07:00:00 GMT",
        "title": "Analysts debate the ETH price outcomes of Ethereum's upcoming Shapella upgrade - Cointelegraph",
        "content": "The Ethereum Foundation has announced April 12 as the date of deployment of the much-anticipated Shanghai and Capella upgrade, together dubbed as Shapella.\n\nThe upgrades will enable withdrawals from Ethereum 2.0 staking contracts. The staking contract was first launched in December 2020. It only accepted one-way deposits of Ether(ETH), which will change after the upgrade.\n\nTo date, users have deposited over 18 million ETH, worth around $32.5 billion, into the Ethereum staking contract since December 2020.\n\nAnalysts vary on the estimates of ETH sell pressure\n\nMost users opted for liquid staking derivatives (LSD) on decentralized or centralized exchanges. Because these stakers are already liquid, there will likely be no new reason to sell after the Shapella upgrade.\n\nDecentralized LSD platforms like Lido currently account for around 33.2% of the total ETH deposits on the Beacon Chain. Out of the rest, around 27.1% is deposited via centralized exchanges like Coinbase, Binance and Kraken. Thus, 60.3% of the staked ETH is deposited via liquid staking mediums.\n\nOn the other hand, the illiquid ETH, which is deposited into the contracts directly by setting up nodes or third-party service providers, accounts for around 40% of the total amount. These are most likely to sell after unlocking.\n\nAccording to analysis from Nansen, around 59% of the illiquid deposits, between 3.62 million and 4 million ETH, are in profit. These users are most likely to go through partial or complete withdrawals after the withdrawals are enabled.\n\nSome of the illiquid stakers might also choose to re-stake and the Nansen report estimated total selling pressure to be somewhere between 1.2 million and 3 million ETH. However, all ETH will not be dumped into the market right away.\n\nViews on daily selling pressure\n\nThe Shapella upgrade will implement a two-tier partial and full withdrawal system.\n\nThe minimum amount to stake on ETH is 32 ETH. Stakers can withdraw amounts exceeding 32 ETH or completely withdraw the entire 32 ETH, plus additional rewards from the staking contract.\n\nThere will not be a situation where stakers rush to withdraw their ETH after the upgrade leading to a spike in gas prices. Ether withdrawals have no gas costs but will be limited to 16 partial or complete withdrawals per block. Thus, there will be a delay in the amount of ETH unlocked and moved to sell.\n\nAccording to the Nansen report, there will be three phases of ETH selling pressure after the upgrade.\n\nIn the first phase, lasting 27 hours after the update, the selling pressure from partial withdrawals will be around 84,000 to 125,000 Ether per day (around $133 million to $197 million).\n\nThe second phase will see maximum selling pressure from partial and full withdrawals, amounting to 136,000 and 173,000 Ether per day (about $218 million to $275 million) in additional selling pressure. This phase will last between the third and fourth day after the upgrade.\n\nThe last phase of selling pressure, with mainly full withdrawals, will last between 19 to 52 days, adding a daily selling pressure of between 48,000 and 53,000 Ether per day.\n\nEstimated selling pressure after Shapella upgrade. Source: Nansen\n\nThe 30-day moving average of exchange inflows is 313,533 ETH (worth around $550 million), which means the additional inflows will be between 15% to 55% of the moving average. This could suppress Ether prices until the selling pressure subsides in three to eight weeks.\n\nAnother estimate by Arcana Research found that around 1.3 million ETH will be sold in the first ten days due to partial and full withdrawals. The selling pressure will peak in the first three days with around $527 million (adjusted for Ether’s current price of $1,800) daily selling pressure. It accounts for around 6.4% of the ETH daily trading volume.\n\nWith less than a fortnight to the upgrade, traders may attempt to front-run the selling pressure by placing short orders in the futures market. So far, the futures market shows no significant uptick in open interest volume or funding rates for short orders.\n\nRelated: Ethereum’s Shanghai upgrade could supercharge liquid staking derivatives — Here’s how\n\nThe beginning of ETH withdrawals will reduce the risk of holding liquid staking derivatives bought via decentralized or centralized exchanges because they will become directly redeemable for ETH. Thus, newfound staking interest among investors sitting on the sidelines would somewhat counter the selling pressure.\n\nThe Ethereum staking ratio, i.e., the percentage of staked ETH relative to its total circulating supply, is 14.96%. This is significantly less than the industry average across other Layer-1 blockchains. The ETH staking ratio is also expected to improve in the long run.\n\nTechnically, the ETH/USD pair faces resistance from the $1,970 level. Breakout above this resistance can see the pair reach bullish targets around $2,330 and $2,750. In case of a downturn, support lies around $1,569.\n\nETH/USD weekly price chart. Source: TradingView\n\nThe Ethereum network will undergo one of the most extensive upgrades since the Merge in September 2022. ETH withdrawals after the Shapella upgrade are likely to see increased selling in the first few days after deployment, putting short-term pressure on prices. However, as the selling subsides and more users move to stake ETH due to reduced risk and increased yields, the market conditions could start favoring more upside in the long term.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpbmFuY2Utc2Vlcy02MjctbWlsbGlvbi1pbi1ldGhlcmV1bS1vdXRmbG93LWZvbGxvd2luZy1jZnRjLWxhd3N1aXQv0gFdaHR0cHM6Ly9mb3JrYXN0Lm5ld3MvYmluYW5jZS1zZWVzLTYyNy1taWxsaW9uLWluLWV0aGVyZXVtLW91dGZsb3ctZm9sbG93aW5nLWNmdGMtbGF3c3VpdC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Mar 2023 07:00:00 GMT",
        "title": "Binance sees $627 million in Ethereum outflow following CFTC lawsuit - Forkast News",
        "content": "Binance saw about US$627 million in net Ethereum-related withdrawals in the 24 hours through Tuesday morning, data from blockchain analytics platform Nansen showed. This followed the Monday lawsuit filed by the Commodities Futures Trading Commission against the world’s largest cryptocurrency exchange for alleged violations of derivatives rules.\n\nSee related article: Binance rejects U.S. charges of violating trading rules, manipulating markets\n\nFast facts\n\nBinance held about US$64 billion worth of assets in publicly disclosed wallets as of Wednesday morning, according to Nansen data.\n\nFor the seven days through Tuesday morning, the data showed Binance had US$2.1 billion in net withdrawals of Ether and Ethereum-related assets.\n\nHowever, the withdrawals are significantly lower than what the exchange experienced in December, when daily outflows at one stage surged to US$3 billion following the collapse of the FTX exchange amid fraud allegations, according to the Nansen data. Binance’s stablecoin outflows reached a record high on Dec. 13 at US$5.78 billion, CryptoQuant data showed.\n\nBinance’s stablecoin outflows reached US$1 billion on Monday and US$810.8 million on Tuesday, data from CryptoQuant showed. Such withdrawals reached a new high for this year at US$2.56 billion on March 13 after the stablecoin USDC temporarily lost its peg to the U.S. dollar on March 11 and 12.\n\nBinance also saw US$2.3 billion in stablecoin outflows on Feb. 13 after the New York Department of Financial Services ordered Paxos to stop issuing Binance USD (BUSD) stablecoin.\n\nOn Monday, the CFTC filed a civil lawsuit against Binance and its chief executive officer Changpeng Zhao, alleging the company violated derivatives rules by allowing U.S. residents to trade various financial instruments involving digital assets without licensing approval.\n\nIn a Tuesday blog post, Zhao rejected allegations of wrongdoing, saying the CFTC complaint “appears to contain an incomplete recitation of facts.”\n\nSee related article: Bitcoin holds ground amid Binance lawsuit, XRP continues run up, U.S. equities dip"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2xpcXVpZC1zdGFraW5nLXRva2Vucy1yYWxseS1ieS0xNS1hcy1ldGhlcmV1bS1zaGFwZWxsYS11cGdyYWRlLWRyYXdzLW5lYXIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Mar 2023 07:00:00 GMT",
        "title": "Liquid staking tokens rally by 15% as Ethereum Shapella upgrade draws near - CryptoSlate",
        "content": "Liquid staking is the best-performing crypto sector in the last 24 hours after rallying by more than 15%, according to CryptoSlate data.\n\nAccording to the data, all seven projects in the space soared by more than 5%, with two of them — Lido (LDO) and Frax Share (FXS) — among the top five gainers for March 29.\n\nLiquid staking derivatives (LSD) platforms have enjoyed renewed interest following news that the highly anticipated Shapella network upgrade — enabling staked Ethereum withdrawals — will activate on April 12 at epoch 194048, according to an Ethereum Foundation statement.\n\nFrax Share leads peers\n\nAccording to CryptoSlate data, Frax Share’s FXS is the best-performing liquid staking derivatives token over the reporting period — up 19.63%.\n\nFXS is the governance token of Frax Protocol and has seen its price increase significantly after launching a liquidity staking program late last year.\n\nThe total value of assets locked (TVL) in Frax Ethereum (frxETH) surged 31.49% in the past 30 days to an all-time high of $231 million — equating to 131,970 ETH tokens, according to DeFillama data.\n\nIn February, Blockchain analytical firm Nansen reported that frxETH’s supply grew by 70,000 ETH within three months.\n\nLido remains dominant LSD\n\nMeanwhile, Lido remains the dominant staking platform in the crypto industry. Its LDO token increased by 15.57% in the past 24 hours to $2.43 at the time of writing.\n\nDespite Lido developer’s decision to sunset its staking services for Polkadot and Kusama, the protocol’s TVL rose 6.51% to $10.89 billion.\n\nAccording to Dune Analytics data, the protocol accounts for roughly 32% of all staked ETH — translating to around 5.8 million tokens.\n\nBesides that, it is also the most dominant decentralized finance protocol — with a 21.8% market dominance, according to DeFillama data.\n\nMeanwhile, other staking protocols like Rocket Pool (RPL), StakeWise (SWISE), ANKR, and Stafi (FIS) all recorded positive gains in the last 24 hours. Overall, the market cap of the crypto tokens in this sector sits at $3.98 billion as of press time.\n\nIn the last 24 hours, DeFillama data shows that the top 10 liquid staking protocols — except Marinade Finance — saw their TVL rise by an average of 5%.\n\nMentioned in this article"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiNGh0dHBzOi8vbWlsa3JvYWQuY29tL25ld3MvZXRoZXJldW0tc2hhbmdoYWktdXBncmFkZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Mar 2023 07:00:00 GMT",
        "title": "Ethereum's Shanghai Upgrade - Security & Market Impact - Milk Road",
        "content": "Key Takeaways\n\nEthereum’s Shanghai Upgrade is scheduled for April 12th.\n\nIt will enable withdrawals of staked ETH for the first time since staking went live in December 2020.\n\nPost-Shanghai, ~$33B worth of staked ETH could theoretically be withdrawn and sold. But the chances of a Shanghai-induced ETH sell-off are slim.\n\nShanghai should result in more ETH being staked over the coming months.\n\nShanghai: The Finishing Touch of “The Merge”\n\nThus far, Ethereum’s transition from proof-of-work (PoW) to proof-of-stake (PoS) has been marked by two main events:\n\nDecember 2020: The launch of the PoS Beacon Chain and ETH staking.\n\nThe launch of the PoS Beacon Chain and ETH staking. September 2022: ”The Merge” of the legacy PoW Chain with the PoS Beacon Chain.\n\nWith these upgrades in the rearview, the heavy lifting to get Ethereum off PoW and onto PoS is done. But there is still some clean-up to do.\n\nEnter Shanghai.\n\nShanghai will enable Ethereum stakers to withdraw their staked ETH (some of which have been locked up since December 2020) for the first time.\n\nWhat You Need to Know\n\nRelative to “The Merge,” Shanghai is a minor technical upgrade. But from a price perspective, it could be a big deal: ~$33B worth of ETH (17.6M ETH) is currently staked. Post-Shanghai, theoretically, all of it could be withdrawn and sold.\n\nSounds scary, right?\n\nNot that scary, though … Here’s why.\n\nOf the total 120.5M ETH in circulation, ~85% are not staked (gray bar), ~14% are staked deposits earning rewards (blue bar), and ~1% are staked rewards generated since the launch of the Beacon Chain (yellow bar).\n\nOur view is that the blue bar (staked deposits) has a low probability of withdrawal post-Shanghai, while the yellow bar (staked rewards) has a high probability of withdrawal post-Shanghai. To explain why, we’ll use a simple analogy.\n\nWhat are Staked ETH Deposits and Rewards?\n\nConsider a landlord that owns and rents out a beach house. The house has been generating steady rental income for over 2 years. But the landlord hasn’t been able to sell it since December 2020.\n\nThink of this landlord as an ETH staker and their beach house as their staked ETH deposits.\n\nNow imagine there is a big mailbox out in front of the landlord’s office. It’s chock full o’ rent checks. But the mailbox has been locked up since December 2020, so the rent checks are sitting inside collecting dust.\n\nThink of these rent checks as staked ETH rewards.\n\nNow imagine that on April 12th, the landlord can finally sell the house. And that same day, they finally get a key to that mailbox.\n\nIt would make a whole lot of sense for the landlord to get those checks out of the mailbox. After all, they have been sitting there collecting dust.\n\nBut what about the beach house? Even though it could be sold, it probably wouldn’t make sense for the landlord to sell it. It is still likely to appreciate in value (who doesn’t love the beach?), and it will continue to generate rental income for years to come.\n\nPost-Shanghai, we think a similar dynamic will play out as it relates to staked ETH withdrawals. Most stakers will withdraw their staked ETH rewards (i.e., get those rent checks out of the mailbox) but hold onto their staked ETH deposits (i.e., keep the beach house).\n\nCould it really be that simple? Pretty much. But let’s crunch some numbers.\n\nQuantifying The Market Impact of Shanghai\n\nHow much staked ETH could (realistically) be withdrawn and sold post-Shanghai?\n\nUnder conservative assumptions (50% to 70% of rewards are withdrawn and sold, 0.0% to 7.5% of deposits are withdrawn and sold), Shanghai could induce ~$130M to ~$500M of daily ETH sales the week after the upgrade.\n\nThat is not a drop in the bucket. But it’s also not the end of the world, considering ETH volumes. On a YTD basis, daily ETH spot volume has averaged $10.8B. Shanghai-induced sales of ~$130M to ~$500M would represent 1.2% to 4.5% of daily spot volume.\n\nPotentially a needle mover. But definitely not a big one.\n\nConsider that the bear case. Here are the more bullish considerations:\n\nEarly stakers knew they wouldn’t be able to withdraw when they staked. They staked anyway. Chances are their diamond hands won’t become paper hands anytime soon – especially since it’s a bad time to sell. ETH is still ~65% below its all-time high.\n\nLiquid staking protocols, which account for ~33% of all staked ETH, have already absorbed a big chunk of the demand to “unlock” staked ETH. Also, the largest liquid staking protocol, Lido, isn’t enabling withdrawals until mid-May – further reducing the chances of a near-term sell-off.\n\nEnabling withdrawals “de-risks” staking – it puts an end to long and indefinite lockups. This should result in more ETH, not less, being staked post-Shanghai.\n\nShanghai’s Impact on Ethereum’s Security\n\nOnly ~15% of ETH is currently staked. Most other layer-1 networks have staking rates in the 40% to 70% range. So, Ethereum’s 15% is low.\n\nWith withdrawals enabled, seeing this number double to ~30% is not at all outside the realm of possibility. That would increase the dollar value of ETH being staked from ~$30B to ~$60B – a positive for the security of the network.\n\nBottom Line\n\nAny ETH sell pressure induced by Shanghai should be minor. Ultimately, enabling withdrawals is expected to result in more, not less, ETH being staked over the coming months: a bullish catalyst for Ethereum and ETH.\n\nDisclaimer\n\nThis report is for informational purposes only and should not be relied upon as a basis for investment decisions, nor is it offered or intended to be used as legal, tax, investment, financial, or other advice. You should conduct your own research and consult independent counsel on the matters discussed within this report. Past performance of any asset is not indicative of future results.\n\n© 2023 MilkRoad.com. All rights reserved.\n\nAndrew Cahill Andrew previously was a Research Director at The Block; a crypto media and research company. Prior to that, he was a Research Analyst at Fundstrat; an investment research firm."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vaGFja2Vybm9vbi5jb20vaG93LXRvLXVzZS10aGUtbmV3LWluZnVyYS1zZXBvbGlhLWZhdWNldC1mb3ItZXRoZXJldW0tc21hcnQtY29udHJhY3QtdGVzdGluZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Mar 2023 07:00:00 GMT",
        "title": "How to Use the New Infura Sepolia Faucet for Ethereum Smart Contract Testing - hackernoon.com",
        "content": "3,790 reads\n\nHow to Use the New Infura Sepolia Faucet for Ethereum Smart Contract Testing"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LndlYWx0aG1hbmFnZW1lbnQuY29tL3RlY2hub2xvZ3kvZXRoZXJldW0tcy1ncmFkdWFsLWFwcHJvYWNoLWVuZHVyaW5nLXZhbHVl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Mar 2023 07:00:00 GMT",
        "title": "Ethereum's Gradual Approach to Enduring Value - Wealth Management",
        "content": "Most economic progress can be attributed to technological advancements like the printing press, steam engines, computers and the internet. Blockchain technology—a profound network that can improve value transfer and human productivity—may be the next driver of business innovation and financial evolution. Ethereum—one of the most actively used blockchain networks with the second biggest cryptocurrency (ETH) by market cap and average daily volume—will undergo its first major update since The Merge in September 2022. The upcoming Shanghai upgrade will introduce highly anticipated improvements that could yield more investment flexibility.\n\nEthereum is an interesting blockchain for developers, users and investors. The network provides a foundation for developing innovative applications and services while ensuring high security, flexibility and scalability. It was one of the first mainstream blockchains to incorporate smart contracts, and as a host to dApps, it enabled DeFi, Web3 and decentralized autonomous organizations (DAOs). In addition, developers flocked to the chain because of efficient, secure hosting capabilities.\n\nEthereum’s large and active community is one of the most significant factors driving the development and adoption of blockchain technology. Ethereum boasts the most developers of all blockchains—over 2,000 weekly active developers—which is often a reliable proxy for the long-term success of a chain. It is a vibrant ecosystem of individuals and organizations working toward a common goal of building decentralized, open-source applications.\n\nAs network activity increased, it boosted the value of ETH, making it more lucrative to mine. This increased mining activity manifested as increased energy consumption, and as innovation continued in the space, it became clear there were more environmentally and economically efficient ways to secure the blockchain.\n\nThe Merge was the culmination of several years of work by the Ethereum development team to join the “original proof-of-work (PoW) execution layer of Ethereum with its new proof-of-stake (PoS) consensus layer.” The PoW system was Ethereum’s longstanding method of verifying transactions and generating new coins, but it was expensive and energy-intensive. Conversely, the PoS system is much more efficient, eliminating “the need for energy-intensive mining and instead [enabling] the network to be secured using staked ETH.” As a result, The Merge decreased Ethereum’s energy usage by 99.9%. PoS became its method of verifying transactions via staking—a process whereby users stake, or put tokens into a contract to qualify for validation privileges. Users could then earn rewards while helping to secure the network.\n\nEthereum as an Internet Bond\n\nCurrently, staking is more comparable to a one-way street. When users staked their ETH, their capital was locked up for an indeterminate period to earn yield. In doing so, they demonstrated their trust in Ethereum. The Shanghai upgrade is expected to be a game changer because it will enable users to access their staked ETH and rewards at any time. There are more than 16.9 million staked ETH (over $27.5 billion at current prices), representing about 14% of the total supply. The ability to withdraw these funds will provide more investment flexibility and ultimately improve liquidity.\n\nStaked ETH’s access to newfound liquidity reduces capital risk, making it more enticing for institutional investors. Further, staking resembles fixed financial instruments like bonds in capital markets. ETH, as a currency, needs to finance itself and pay for its security. Similar to how the U.S. government might issue a bond to pay for its military budget, Ethereum does so by issuing financial rewards to validators who secure the network. Staking in Ethereum provides a yield akin to the yield offered by bonds. The ability for institutional investors to participate in staking, earn yield and withdraw staked ETH has the potential to attract even more investors and drive growth in the cryptocurrency industry.\n\nEthereum's Continued Innovation\n\nEthereum's periodic upgrades represent steps toward the ecosystem’s vision of greater sustainability, security, and scalability—essential components for healthy growth. The future potential is vast for a network built and maintained on solid footing. Moreover, the network’s concerted effort to continuously improve functionality of its cornerstone features exhibits a powerful catalyst for innovation. Knowledgeable institutions are watching closely and planning accordingly.\n\nEthereum is now where the internet was in 1995, or the iPhone was in 2007—new technology with powerful capabilities and uncharted possibilities at the juncture of mainstream adoption. The Merge substantiated the blockchain’s foundational strength, scalability and sophistication, showing a broader view of a promising avenue to modernize aging financial infrastructure. The upcoming Shanghai upgrade represents another valuable development for the network and is likely to drive additional development, contribution and growth in the industry.\n\nPeter Hans is managing director of IR and business development at Arca."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vdS50b2RheS9tYWpvci1leGNoYW5nZS1iaW5hbmNlLXdpbGwtc3VwcG9ydC1ldGhlcmV1bS1ldGgtc2hhcGVsbGEtdXBncmFkZS1vbi10aGVzZS10ZXJtc9IBZGh0dHBzOi8vdS50b2RheS9tYWpvci1leGNoYW5nZS1iaW5hbmNlLXdpbGwtc3VwcG9ydC1ldGhlcmV1bS1ldGgtc2hhcGVsbGEtdXBncmFkZS1vbi10aGVzZS10ZXJtcz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Mar 2023 07:00:00 GMT",
        "title": "Major Exchange Binance Will Support Ethereum (ETH) Shapella Upgrade on These Terms - U.Today",
        "content": "Major crypto exchange Binance has officially announced support for the next big upgrade in Ethereum (ETH), Shapella. According to the latest data, this should happen at blockchain epoch 194,048, which corresponds to the date of April 12. The event will take place in accordance with the exchange's rules, a list of which has been announced by Binance.\n\nAdvertisement\n\nThus, seven minutes before the approximate upgrade date, at 10:20 p.m. UTC, Binance will suspend withdrawals of both ETH and other tokens from the ERC-20 network. Trading in these tokens, however, will not be suspended. Further reopening of deposits and withdrawals of ERC-20 cryptocurrencies will be done without any notice. Of particular importance is Binance's increase in the minimum unlock count of deposits on the Ethereum network from the current 12 blocks to 64.\n\nEthereum, Shanghai and Capella\n\nThe Shapella upgrade is a merger of two events, Shanghai and Capella. Both involve the release of Ethereum (ETH) from its staking, the only difference being the layers. Thus, Shanghai is responsible for the execution layer (EL) and Capella for the consensus layer (CL). As Shapella approaches, the Ethereum Foundation has doubled the bug bounty, to $500,000.\n\nIt is known that the upgrade will release an estimated 2.9 million ETH. However, exactly how many tokens will come out of the staking and what will happen to those millions next is a big question."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZGVjcnlwdC5jby8xMjQ4MTIvZXRoZXJldW0tc3Rha2luZy10b2tlbnMtc2hhbmdoYWktdXBncmFkZS1nZXRzLWRhdGXSAVJodHRwczovL2RlY3J5cHQuY28vMTI0ODEyL2V0aGVyZXVtLXN0YWtpbmctdG9rZW5zLXNoYW5naGFpLXVwZ3JhZGUtZ2V0cy1kYXRlP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Mar 2023 07:00:00 GMT",
        "title": "Ethereum Staking Tokens Jump Double Digits as Shanghai Upgrade Gets a Date - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe Shanghai and Capella upgrades, named Shapella, will activate around 6: 30 pm UTC on April 12, 2023, per the Ethereum Foundation’s latest note.\n\nCrucially, this upgrade will let Ethereum stakers, including individuals and larger staking outfits, freely withdraw their ETH. Currently, that’s not possible.\n\nThe news boosted native tokens for staking projects like Lido DAO (LDO), Frax Shares (FXS), and Rocket Pool (RPL). The gains across these tokens surpassed Ethereum’s 5.5% rise over the last day, with LDO rising by 18.6%, RPL by 13.3%, and the FXS token by 20.4%, per CoinGecko.\n\nAD\n\nAD\n\nEach of these protocols lets users deposit as much or as little Ethereum and participate in staking. Depositing directly on the mainnet demands a minimum of 32 ETH to participate. When users deposit into a staking project, they receive a “staked” version of Ethereum which accrues staking yield and acts as a receipt of their deposit.\n\nOnce withdrawals are enabled, some analysts suggest that this may also reduce the risk of holding those staked versions of ETH, like Lido’s stETH and Frax’s frxETH, as they will finally be redeemable. The reduced risk could encourage more ETH holders to stake with LSD platforms for higher yields.\n\nLido DAO, the largest LSD entity with 31.5% of the total ETH deposits, already conducted withdrawals on the Goerli testnet yesterday.\n\n🎉 Lido V2 is currently being tested on Goerli with the first successful withdrawal already confirmed 🎉https://t.co/8NcTklCmjU Here's what to expect from the Goerli V2 Testnet 🧵👇 — Lido (@LidoFinance) March 28, 2023\n\nThe newest upgrade comes after Ethereum’s merge event in September 2022, when the blockchain shifted to a proof-of-stake (PoS) consensus mechanism.\n\nAD\n\nAD\n\nThis time, the Shapella upgrade will enable ETH withdrawals for various users who staked their Ethereum on the network as early as December 2020.\n\nToday, there are more than 16.3 million Ethereum staked on the network."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDMvMjkvc2hhbmdoYWktaXMtbmVhcmluZy1idXQtd2hlbi1jYW4taS13aXRoZHJhdy1teS1zdGFrZWQtZXRoL9IBZ2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDMvMjkvc2hhbmdoYWktaXMtbmVhcmluZy1idXQtd2hlbi1jYW4taS13aXRoZHJhdy1teS1zdGFrZWQtZXRoL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Mar 2023 07:00:00 GMT",
        "title": "Ethereum's Shanghai Is Nearing, but When Can I Withdraw My Staked ETH? - CoinDesk",
        "content": "So if you are hoping to cash in on any rewards from your staked ETH, make sure to check with your providers when that will happen because it may not occur on April 12. And if you are running your own validator, make sure to install the correct withdrawal credentials."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9sYXllci0yLXByb2plY3QtZXhlYy16b29tcy1pbi1vbi10aGUtY2FwYWJpbGl0aWVzLW9mLWV0aGVyZXVtLXNjYWxpbmctc29sdXRpb25z0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Mar 2023 07:00:00 GMT",
        "title": "Layer-2 project exec zooms in on the capabilities of Ethereum scaling solutions - Cointelegraph",
        "content": "In episode 13 of Cointelegraph’s Hashing It Out podcast, Elisha Owusu Akyaw sits down with Metis co-founder Elena Sinelnikova. Metis is an Optimistic Rollup built on Ethereum to explore the world of layer-2 blockchain technology, and its potential impact on decentralization, scalability and real-world applications. Sinelnikova shares her unique insights and experiences in the rapidly evolving blockchain space, and gives us a glimpse into the future of decentralized autonomous organizations (DAOs) powered by Metis.\n\nThe conversation begins with Sinelnikova providing a comprehensive introduction to Metis, its mission and the challenges it aims to address in the current blockchain landscape. Next, she dives deep into the limitations of Ethereum’s layer 1, highlighting issues such as high gas fees, congestion and slow transaction times. Sinelnikova explains how Metis leverages layer 2 technology to overcome these hurdles — enabling faster, more efficient, and cost-effective transactions for users and developers.\n\nMetis is built on top of the Optimism codebase. Sinelnikova explains that even though the Metis team believes Optimism is on the right path, the team needed to make some changes to the code to create a more efficient platform for the Web3 economy.\n\n“You see, Metis fees are way lower than Optimism fees. We needed these lower fees for the enterprise level — so the enterprise level apps can use Metis easier more than Optimism.“\n\nNext, Akyaw and Sinelnikova discuss the importance of decentralization in the blockchain ecosystem. Metis intends to use its unique approach to building and supporting decentralized autonomous organizations (DAOs) to shape the future of work and collaboration. What’s more, Sinelnikova emphasizes the role of Metis in empowering individuals and businesses to create, manage, and scale their DAOs, thereby fostering a more inclusive and transparent decentralized economy.\n\nRelated: Africa: The next hub for Bitcoin, crypto adoption and venture capital?\n\nThis episode also explores the topic of adoption and education. Sinelnikova believes that the most important thing is not getting new users into crypto but protecting users who have already ventured into crypto through extensive education.\n\nFinally, Sinelnikova discusses the future of Metis and layer 2 blockchain technology, outlining the vision for the platform’s ongoing development and growth.\n\nListen to the latest episode of Hashing It Out with Elena Sinelnikova on Spotify, Apple Podcasts, Google Podcasts, or TuneIn. You can also check out Cointelegraph’s full catalog of informative podcasts on the Cointelegraph Podcasts page."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDMvMzEvY2FyZGFuby11c2Vycy1jYW4tc29vbi1hY2Nlc3MtZXRoZXJldW0tZGFwcHMtZGlyZWN0bHktZnJvbS1hZGEtd2FsbGV0cy_SAXRodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzAzLzMxL2NhcmRhbm8tdXNlcnMtY2FuLXNvb24tYWNjZXNzLWV0aGVyZXVtLWRhcHBzLWRpcmVjdGx5LWZyb20tYWRhLXdhbGxldHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Mar 2023 07:00:00 GMT",
        "title": "Cardano Users Can Soon Access Ethereum Dapps Directly From ADA Wallets - CoinDesk",
        "content": "The new feature will allow Ethereum application developers to build on Cardano’s network using Solidity – the computer language used to code Ethereum – without the need to install new toolkits or learn a new computer language."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy93aXRoZHJhd2Fscy1hcmUtY29taW5nLWV0aGVyZXVtLWRldnMtY29uZmlybS1lcG9jaC1mb3Itc2hhcGVsbGEtZm9ya9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Mar 2023 07:00:00 GMT",
        "title": "'Withdrawals are coming!' — Ethereum devs confirm epoch for Shapella fork - Cointelegraph",
        "content": "Ethereum validators will soon be able to withdraw their Ether (ETH) from the Beacon Chain, with the Shapella hard fork set to be activated on the Ethereum mainnet on April 12.\n\nShapella will take effect at epoch 194,048, which is scheduled for 10:27 pm UTC on April 12, Ethereum core developers confirmed.\n\nThe withdrawals will be enabled by Ethereum Improvement Proposal EIP-4895 by “pushing” staked Ether from the Beacon Chain to the Ethereum Virtual Machine (EVM), otherwise known as the execution layer.\n\nIt's happening\n\n\n\nShapella is scheduled on mainnet for epoch 194048, scheduled for 22:27:35 UTC on Apr. 12, 2023\n\n\n\nClient releases compatible with the upgrade are listed in the announcement below https://t.co/I0hSv9lnjz — timbeiko.eth ☀️ (@TimBeiko) March 28, 2023\n\nThe epoch, slot, and time were confirmed following a week-long deliberation between members of the Ethereum Foundation, which was led by Ethereum core developer Tim Beiko.\n\nTim Beiko suggested three epoch, slot and time combinations to members of EF two weeks ago. Source: Ethereum.org\n\nWhile the hard fork will allow for partial and full withdrawals, several mechanisms are set in place to ensure a flood of Ether doesn’t disrupt the market.\n\nThere are now 17.81 million Ether staked on the Beacon Chain. At a current price of $1,776, this means $31.6 billion can be incrementally unlocked over time.\n\nStaked Ether added to the Beacon Chain since it launched in December 2020. Source: Beaconcha.in.\n\nWhile the Ethereum Foundation described the last testnet run on Goerli as “smooth,” there was a notable delay in activation time due to many validators not updating their client software.\n\nHowever, Beiko is confident it won’t be an issue this time, as Ethereum validators will be economically incentivized to make the update for the mainnet.\n\nEthereum’s key hard forks\n\nBecause of EIP-4895, Shapella is considered the most significant hard fork on Ethereum since Paris — the Merge — changed the network consensus mechanism from proof-of-work to proof-of-stake on Sept 15.\n\nPrior to that, London introduced EIP-1559 in August 2021, which introduced a base fee that users must pay instead of the old price auction method. While the validators still receive a block reward and tip, the base fee is burned, which is intended to make Ether deflationary over time.\n\nRelated: Ethereum’s Shapella transition is ‘on the horizon’\n\nBerlin optimized gas costs for some EVM actions in April 2021, while Beacon Chain Genesis marked the first block that was produced on the proof-of-stake chain on Dec. 1, 2020.\n\nFinally in December 2019, Istanbul served to improve denial-of-service attack resilience and make layer-2 scaling solutions based on SNARKs and STARKs more performant.\n\nIf you want to watch as the upgrade happens, you can join @ethStaker, @EthCatHerders, myself and others during the Shapella watch party here https://t.co/ZHWQfMemZc — timbeiko.eth ☀️ (@TimBeiko) March 28, 2023\n\nThe Ethereum Foundation also announced last week that it doubled rewards for any bugs found in the Shapella code. Successful bounties may receive a reward anywhere between $2,000 and $250,000, depending on how “critical” the bug is.\n\nMagazine: Crypto Twitter Hall of Flame: Lark Davis on fighting social media storms, and why he’s an ETH bull"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS93ZWIzLzIwMjMvMDMvMjkvYW5keS13YXJob2wtYXJ0d29ya3MtdG8tYmUtb2ZmZXJlZC1hcy10b2tlbml6ZWQtaW52ZXN0bWVudHMtb24tZXRoZXJldW0v0gF1aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3dlYjMvMjAyMy8wMy8yOS9hbmR5LXdhcmhvbC1hcnR3b3Jrcy10by1iZS1vZmZlcmVkLWFzLXRva2VuaXplZC1pbnZlc3RtZW50cy1vbi1ldGhlcmV1bS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Mar 2023 07:00:00 GMT",
        "title": "Andy Warhol Artworks to Be Offered as Tokenized Investments on Ethereum - CoinDesk",
        "content": "\"As more and more value moves on-chain, fractionalized art is increasingly being sought after by a younger, yet less financially flexible, class of investors,\" said Colin Johnson, CEO and co-founder of Freeport. \"Our platform goes far beyond just fractionalizing shares of fine art into security tokens – we've built a fullyvimmersive and interactive platform hosting an art-centric community and redefining the ownership experience surrounding fractionalized art.\""
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vbWlsa3JvYWQuY29tL2RhaWx5L3QtMTMtZGF5cy1ldGhlcmV1bXMtYmlnLXVwZ3JhZGUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Mar 2023 07:00:00 GMT",
        "title": "🥛 T-13 days: Ethereum's big upgrade - Milk Road",
        "content": "GM. This is Milk Road, your Web3 multivitamin. Get your daily dose of crypto, NFTs, blockchain news, AND jokes in one 3-minute horse pill.\n\nHere’s what we’re serving up for you today:\n\nShanghai upgrade is coming on April 12 ⏱️\n\nTBT: Bitcoin’s first big rally 💪\n\nTrademark Thursday 📂\n\nSBF’s using his dad’s gift for legal fees 🍪\n\nPrices as of 9:00 AM ET\n\nToday’s edition is brought to you by Awaken, the perfect place to file your crypto taxes.\n\nSHANGHAI UPGRADE SET FOR APRIL 12 ⏱️\n\nIt’s official. Ethereum developers announced a date for the Shanghai upgrade: April 12th. That’s right ladies & gents, we’re t-13 days away from The Great Unstaking.\n\nSo what? People will finally be able to unstake their ETH for the first time since December 2020.\n\nSome people think it will lead to a huge sell-off, others think it’ll be just another day that ends in y.\n\nSo how big of a deal is it, really? Well to help answer it, we sent the Milk Man on a mission to find everything he could about the upcoming upgrade.\n\n100 hours later, he created this guide – it has EVERYTHING you need to know about the Shanghai upgrade.\n\nThe biggest takeaway? Only ~15% of all ETH is currently staked. Check it out.\n\nThe blue segment below represents staked ETH deposits that will be unlocked on April 12 (~14%). The yellow sliver represents staked rewards (~1%).\n\nMilk Road Take: We rank this a solid 3 on the Milk-Road-Worry-Meter. It’s our view that there is a:\n\nlower probability that the staked deposits (blue part) will be sold and a\n\nhigher possibility that the staked rewards (yellow sliver) will be sold\n\nCheck out the rest of the Guide to the Shanghai Upgrade here to make sure you’re ready for game day!\n\nTrust us, you’ll be the smartest person on the elevator today after reading it.\n\nMAKE CRYPTO TAXES EASY WITH AWAKEN\n\nAwaken\n\nEveryone knows there are two certainties in life: death and taxes. Then there’s death from taxes….\n\nFiling your taxes is hard, confusing, boring, and it takes forever. Plus it’s 10x worse if you’re a crypto investor.\n\nIntroducing Awaken – a new tax software built for Web3. Awaken supports NFTs, staking, bridging, etc., and gives you all the crypto reports you need to file your personal taxes.\n\nIt makes filing taxes a breeze so the IRS won’t rain on your crypto parade.\n\nAnd today, we’ve got a special offer for all Milk Roaders: you can claim $30+ of free credits by using code “milkroad”.\n\nBut wait, there’s more… if you already paid for a different crypto tax product, Awaken will fully match your payment (just email andrew@awaken.tax with proof.)\n\nThe choice is yours. 👇\n\nCYPRUS 10-YEAR ANNIVERSARY 💪\n\nIt’s that time of the week… Throwback Thursday. The day we reminisce on the simple times, when our biggest worry was staying on our friends’ Top 8 on Myspace.\n\nToday’s TBT: The Cyprus Banking Crisis and Bitcoin’s Big Rally. Gather ‘round kids, this one’s a doozy. Here’s the story in 3 parts:\n\nPART 1: THE CALM BEFORE THE STORM. First, let me set the scene for you:\n\n*old man voice*:… The year was 2013, on a small Mediterranean island called Cyprus…\n\nAt the time, the island was known for one thing: lax taxes. This made Cyprus a tax haven for rich (and sketchy) people, which raked in billions of dollars in bank deposits.\n\nAs a result, the banks on this tiny island got HUGE. They held 8x as many assets as the entire country’s GDP. The banks became like that short guy at the gym that bench presses 300 lbs – tiny but mighty.\n\nBut there was a massive storm brewing in Cyprus:\n\nThe economy was in a recession and still recovering from the ’08 financial crisis.\n\nBig banks lost A LOT of money. They lent billions to Greece (whose economy was also nosediving), and then tried placing a double-or-nothing bet by buying up Greek government bonds in hopes of a bailout. They took an L & lost everything.\n\nSuddenly Cyprus banks were in a lot of trouble. And because they controlled (and lost) more money than the entire country’s GDP, they went from too big to fail → too big to save.\n\nPART 2: THE SH*TSTORM\n\nPop quiz: What do you do when you’re broke and owe a lot of money? Call your rich uncle.\n\nWhich is exactly what Cyprus did. They called up their rich uncle (AKA the European Union) and asked for a $17B bailout.\n\nBut here’s the thing: sometimes your rich uncle wants to teach you a lesson. And the European Union wasn’t super happy about the price tag.\n\nSo they made a deal… The EU would give $10B, but Cyprus would have to come up with the rest on its own.\n\nHow? By taking money from its own depositors.\n\nIn March 2013, Cyprus announced its two biggest banks would shut down and all deposits over $100K would be seized, with a large portion being used for the bailout.\n\nIt sent shockwaves throughout the island. But wait, it gets crazier…\n\nIn order to stop a bank run, the Cyprus government declared a national bank holiday and closed all the banks so people couldn’t withdraw any money. (Note to self: if we ever want a new holiday, just threaten a massive bank run.)\n\nThen when the banks opened back up, the Cyprus government placed restrictions on how much money people could withdraw (sometimes as low as $128 per day).\n\nIt was a living nightmare for the Cypriots that included longer lines than a new iPhone release…\n\nSource: CEPR\n\nBut this was also a wake-up call for a lot of people. They could no longer fully trust the governments and big banks. They needed to find an alternative…\n\nPART 3: THE RISE OF BITCOIN\n\nToday, Bitcoin is the king of crypto. Companies own it. Hedge funds own it. Countries own it. Even my mom owns it.\n\nIn 2013, Bitcoin was still just “magic internet money”. It was mainly super nerds and sketchy drug dealers that owned it.\n\nUntil….the Cypriots got in on the action. With banks collapsing and people losing trust in the system, people looked to Bitcoin as an alternative asset for the first time ever.\n\nBTC Weekly Chart (Trading View)\n\nBTC jumped 600% and was followed by the famous Bullrun of 2013 and BTC ended the year at ~$750.\n\nTHE LESSONS: 10 years later there are still some big takeaways from the Cyprus Baking Seizures:\n\nBanks can always collapse. 10 years ago it was Cyprus Banks. Today it’s SVB, Credit Suisse, and Deutsche Bank.\n\nDon’t put all your eggs in one basket. We’ve seen time after time that trusting a single bank with all your money is a bad idea. Don’t do it. You gotta spread your bread around.\n\nDiversify your assets. Put some money in gold, Bitcoin, Pokemon cards, whatever you want – just make sure to always have a backup plan in case sh*t hits the fan.\n\nTRADEMARK THURSDAY 📂\n\nThe biggest brands have all been diving into the Web3 swimming pool recently.\n\nSome cannonball right in. Others like to make a bigger splash off the diving board.\n\nThis is kinda like filing a trademark – it gives everyone a heads up that a big splash is coming soon.\n\nWe rounded up all the companies making moves in the space. Here’s who’s diving in:\n\nGiphy\n\nAeropostale filed a trademark for NFT-authenticated media, virtual clothing/footwear, bags, and sports gear. No word yet on if low-rise jeans are included…\n\nWrigley filed to trademark NFTs, virtual & physical candy, and crypto-collectible sharing software. It wants to name its ecosystem “Juicyverse,” and honestly… we’re here for it\n\nWynn Resorts filed 6 trademarks with plans involving an NFT marketplace, virtual casinos/hotels, virtual stores, and more\n\nCartier filed trademarks for NFT-backed items like digital watches, jewelry, and more\n\nMajor Cricket League filed trademarks for NFT-tied fanny packs, backpacks, and more\n\n🥛 MILK & COOKIES 🍪\n\nSBF is paying his legal fees with the millions of dollars he gifted his dad in 2021, per Forbes. The monetary gift was funded by a loan from Alameda, where FTX customer deposits were allegedly being illegally funneled to.\n\nTraders have pulled $2.1B out of Binance in the last seven days. That’s above normal amounts, but still lower than the outflows we’ve seen after previous regulatory threats against the company.\n\nKraken just struck a deal with Formula 1 for the crypto exchange’s branding to appear on racing cars for the rest of the 2023 season. Comeback SZN for crypto sponsorships?\n\n3AC founders Kyle Davis and Su Zhu could be found in contempt if they don’t respond to a court summoning in the British Virgin Islands. They’re required to provide liquidators with documents related to the bankruptcy by April 14. Tick tock, y’all…\n\nMILKY MEMES 🤣\n\nThat’s a wrap for today. Meet us on Twitter to talk all about it. It’s kinda like a family BBQ but better – no screaming kids, awkward photos, or drunk uncles telling weird stories (@MilkRoadDaily)\n\nHIT THE INBOX OF 250K+ CRYPTO INVESTORS\n\nAdvertise with the Milk Road to get your brand in front of the Who’s Who of crypto. The Roadies are high-income crypto investors who are always looking for their next interesting product or tool. Get in touch today.\n\nROADIE REVIEW OF THE DAY\n\nVITALIK PIC OF THE DAY\n\ngm 🤝 https://t.co/QlLYTOHzmL — Milk Road (@MilkRoadDaily)\n\nMar 30, 2023\n\nDISCLAIMER: None of this is financial advice. This newsletter is strictly educational and is not investment advice or a solicitation to buy or sell any assets or to make any financial decisions. Please be careful and do your own research."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9hcmItcHJpY2UtdG8tMi1ldGhlcmV1bS1sMi1yaXZhbC1hcmJpdHJ1bS13aWxsLWRvdWJsZS1ieS1hcHJpbC1mcmFjdGFsLXN1Z2dlc3Rz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Mar 2023 07:00:00 GMT",
        "title": "ARB price to $2? Ethereum L2 rival Arbitrum will double in April, fractal suggests - Cointelegraph",
        "content": "The price of Arbitrum (ARB) has dropped by nearly 20% a week after establishing its record high at $1.60 on March 23. However, the Ethereum layer-2 token looks set to resume its uptrend in the coming weeks.\n\nPolygon price fractal\n\nThe cues for a bullish Arbitrum token could be traced back to its Ethereum L2 rival Polygon's market debut.\n\nMATIC (MATIC) started trading on Binance on April 26, 2019, at $0.0026 per token. MATIC/USD rallied nearly 300% to reach $0.0105 on the same day before wiping out 70% of those gains in a market correction by May 9, 2019.\n\nIt regained its upside momentum afterward, rallying by nearly 1,350% to $0.045 on May 21, 2019.\n\nMATIC/USDT four-hour price chart. Source: TradingView/Mac\n\nThe price trajectory reflects a recurring phenomenon involving the launch of digital tokens with seemingly strong fundamental backing, according to independent market analyst Mac.\n\nFor instance, Solana (SOL), a layer-1 blockchain, rallied 50,000% before undergoing a similar pump, correction, and sideways consolidation phase after its exchange debut in April 2020.\n\nSOL/USD daily price chart. Source: TradingView/Mac\n\nArbitrum price could hit $2 by April\n\nFrom a fundamental perspective, Arbitrum has emerged as a strong contender in the Ethereum L2 space in recent months, with several leading DeFi protocols, including GMX, Uniswap, Sushi and Aave, among its users.\n\n\"GMX and Radiant on Arbitrum are two of the fastest-growing protocols in terms of both fundamentals and price appreciation this year,\" noted Dustin Teander, a researcher at analytics firm Messari, adding:\n\n\"Looking at user retention metrics, it’s apparent these protocols have gained above-market traction compared to imported protocols like Uniswap or Aave.\"\n\nOptimism vs. Arbitrum monthly user retention rates. Source: Messari\n\nAs of March 29, the total value locked (TVL) across Arbitrum pools rose to $2.2 billion versus around $981 million three months ago, according to data resource DefiLlama.\n\nRelated: Arbitrum airdrop sells off at listing, but traders remain bullish on ARB\n\nMac noted that Arbitrum’s strong fundamentals could limit ARB’s downside prospects and prompt traders to re-accumulate the token in the coming weeks.\n\nThat may lead to another price run-up, eyeing $2 by April, as illustrated below.\n\nARB/USDT hourly price chart. Source: TradingView/Mac\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiNWh0dHBzOi8vdGhlZGVmaWFudC5pby9zdGFrZWQtZXRoLXdpdGhkcmF3YWxzLWFwcmlsLTEy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Mar 2023 19:47:28 GMT",
        "title": "Staked ETH Withdrawals To Activate On April 12 - The Defiant - DeFi News",
        "content": "Ether Rallies 5%\n\nBy: Samuel Haig • Loading...\n\nDeFi News\n\nEthereum’s long-awaited Shanghai and Capella (Shapella) upgrades will be deployed on mainnet on April 12, allowing ETH stakers to withdraw their coins for the first time.\n\nShapella’s scheduling drove a spike in the price of Ether, with the second-largest digital asset rallying 5% on the news, according to The Defiant Terminal.\n\nEthereum node operators must ensure that their client software is up-to-date prior to the upgrade’s deployment. Stakers and node operators that do not update in time will experience their client syncing to the old version of the blockchain, meaning they cannot operate or transact on the post-Shapella network until upgrading.\n\nEthereum users and ETH holders do not need to make any changes to accommodate the update, which includes five Ethereum Improvement Proposals necessary to enable withdrawals.\n\nProof of Stake\n\nEthereum transitioned to Proof of Stake consensus with the activation of the Merge last September. The Merge unified Ethereum’s Proof of Stake Beacon Chain with its mainnet execution layer, eliminating energy-intensive Proof of Work miners from the network.\n\nHowever, ETH stakers have been unable to withdraw their coins until now, despite staking launching alongside the Beacon Chain in December 2020. Many in the Ethereum community expected withdrawals to activate last year.\n\nThe Merge reduced Ethereum’s energy consumption by more than 99.9% and dropped new ETH emissions by around 90%. Coupled with the fee-burning mechanism introduced with the EIP-1559 upgrade in August 2021, Ethereum is currently deflationary, meaning the network is destroying ETH faster than new supply is created as staking rewards.\n\nDeFi Alpha Premium Content DeFi Daily | Weekdays\n\nDeFi Alpha Letter | Weekly\n\nDefiant Podcast Transcript | Weekly\n\nInbox Dump | Saturday\n\nWeekly Recap | Sunday Looking for Alpha? Become a premium member of The Defiant and join our DeFi Alpha community. Start for free\n\nEther supply since the Merge. Source: ultrasound.money\n\nEthereum’s supply is down by 70,835 ETH ($128.5M) since the Merge, according to Ultrasound Money.\n\nShapella Upgrade\n\nShanghai and Capella will upgrade Ethereum’s execution and consensus layers, respectively.\n\nShapella has already undergone rigorous scrutiny on Ethereum’s testnets. The code passed its final dress rehearsal on the Goerli network on March 14, following successful deployments on Sepolia on Feb. 28 and Zhejiang on Feb. 8.\n\nGoerli’s activation experienced delays due to many testnet validators updating their client software late. However, Tim Beiko of the Ethereum Foundation attributed the delay to the lack of incentives for testnet validators to ensure timely upgrades. Beiko predicts validators will update their software in time for Shapella’s mainnet deployment.\n\nThe Ethereum Foundation has also doubled the value of the bug bounties it is offering to coders that identify any vulnerabilities with the Shapella code until April 5. Bounties of up to $500,000 are available to security sleuths depending on the severity of code bugs identified.\n\nRoughly 15.5% of Ethereum’s supply, worth roughly $34B, is currently staked.\n\nLiquid Staking\n\nThe Shapella upgrades are tipped to increase staking participation on the network by removing the barrier to exiting staked positions.\n\nHowever, Shapella also opens the floodgates to users withdrawing ETH from the Beacon Chain, igniting concerns that early stakers may race to unstake and offload their coins. The Ethereum Foundation is implementing measures to prevent a flood of ETH from getting dumped on the open market.\n\nRoughly 2,200 staked Ether withdrawals will process each day, restricting withdrawals to around 0.4% of the staked ETH capitalization.\n\n“We anticipate that demand for unstaking will be high soon after the upgrade, and it may take the protocol weeks to months [to] process unstaking requests,” tweeted Coinbase.\n\nAnalysts tip that Shapella boon to liquid staking token (LST) providers as arbitrageurs step in to take advantage of the spread between LSTs and Ethereum. LSTs are yield-bearing tokens representing staked Ether positions, allowing users to remain liquid and utilize the value represented by their staked ETH in DeFi protocols.\n\nLSTs already represent 44% of Ethereum’s staked capitalization, followed by individual whales with 39%, and centralized exchanges with 14.5%, according to Dune Analytics.\n\nLido, the top LST provider, is currently the largest Ethereum staker, commanding a market share of 31%. Kraken, a centralized exchange, ranks second with around 7% of the staked ETH."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiK2h0dHBzOi8vdGhlZGVmaWFudC5pby9jb25zZW5zeXMtbGluZWEtemtldm3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Mar 2023 19:51:32 GMT",
        "title": "ConsenSys Opens Public Testnet For ‘Linea’ zkEVM - The Defiant - DeFi News",
        "content": "Ethereum Scaling Race Heats Up\n\nBy: Samuel Haig • Loading...\n\nDeFi News\n\nConsenSys, the blockchain software company behind the popular MetaMask crypto wallet, has opened up the testnet for its zero-knowledge rollup to developers and users.\n\nLinea is one of several emerging zkEVM solutions seeking to couple Ethereum compatibility with the security and performance of zero-knowledge proofs.\n\nConsenSys said dApps deployed on Linea will be easily accessible via MetaMask wallet. Linea also offers native integrations with ConsenSys’s infrastructure and tooling for developers.\n\nLinea’s private testnet launched in January and processed 1.5M transactions in the first few weeks following its launch, according to the project.\n\nL2 Season\n\nEthereum’s Layer 2 ecosystem is becoming increasingly competitive, with Matter Labs’ mainnet launch of its zkEVM solution on March 24 and Polygon following with the beta launch of its zkEVM on March 27. Linea also faces competition from Coinbase’s new Layer 2, Base, and the forthcoming zkEVM from Scroll.\n\nEthereum’s scaling ecosystem is currently dominated by optimistic rollup solutions Arbitrum and Optimism, the two largest L2s by total value locked. Arbitrum and Optimism represent 66% and 22% of L2 TVL, respectively, according to L2beat.\n\nRollups work by bundling together transactions on Layer 2 before submitting them to the mainnet in batches for finalization, reducing the transaction fees incurred by each individual transaction.\n\nOptimistic rollups quickly rose to prominence thanks to their high compatibility with the EVM, Ethereum’s core smart contract engine, but require a seven-day delay on mainnet withdrawals for fraud detection.\n\nBy contrast, previous zero-knowledge-based rollups offered fast finalization but required developers to rework their code in native coding languages. However, the new generation of zkEVMs promises to combine the EVM compatibility of Optimistic rollups with the fast finalization and security benefits of zero-knowledge-based solutions.\n\nConsenSys raised $450M in a Series D funding round last March, bringing its valuation to $7B."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMy8zMC9jcnlwdG8td2hhbGVzLW1vdmUtb3Zlci02MDAwMDAwMDAtaW4tYml0Y29pbi1ldGhlcmV1bS14cnAtYW5kLXRoZS1zYW5kYm94LWhlcmVzLXdoZXJlLWl0cy1nb2luZy_SAYUBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDMvMzAvY3J5cHRvLXdoYWxlcy1tb3ZlLW92ZXItNjAwMDAwMDAwLWluLWJpdGNvaW4tZXRoZXJldW0teHJwLWFuZC10aGUtc2FuZGJveC1oZXJlcy13aGVyZS1pdHMtZ29pbmcvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Mar 2023 07:00:00 GMT",
        "title": "Crypto Whales Move Over $600,000,000 in Bitcoin, Ethereum, XRP and The Sandbox – Here’s Where It’s Going - The Daily Hodl",
        "content": "Crypto whales moved more than $600 million worth of Bitcoin (BTC), Ethereum (ETH), XRP and The Sandbox (SAND) in a two-day period this week as crypto markets traded sideways.\n\nThe largest transaction involved one unknown wallet sending 409,350,982 SAND worth more than $247.3 million to another unknown wallet, according to the blockchain tracker Whale Alert.\n\nThe Sandbox is a metaverse gaming project with decentralized governance.\n\nExplains the crypto analytics firm Santiment,\n\n“A known The Sandbox whale emptied out its entire 409 million SAND ($250 million in total) and moved to a new address today. This was the most coins moved since the asset’s first week of existence in August 2020. Today’s $261 million moved is the most moved in 7 months.”\n\nOther large transactions tracked by Whale Alert include an unknown wallet transferring 72,591 ETH worth more than $125.5 million to another unknown wallet.\n\nAdditionally, a separate unknown whale sent 5,200 Bitcoin worth more than 140.7 million to a different unknown address, and the crypto exchange Binance transferred 972 BTC worth more than $26.3 million to the crypto exchange Coinbase.\n\nXRP whales and exchanges moved the crypto asset in a flurry of smaller transactions, including:\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMy8zMC9vdmVyLTg1MjAwMDAwMC1pbi1ldGhlcmV1bS1wb2x5Z29uLWZhbnRvbS1hbmQtbW9yZS1sZWZ0LWJpbmFuY2UtZm9sbG93aW5nLWNmdGMtbGF3c3VpdC1zYXlzLW5hbnNlbi_SAYgBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDMvMzAvb3Zlci04NTIwMDAwMDAtaW4tZXRoZXJldW0tcG9seWdvbi1mYW50b20tYW5kLW1vcmUtbGVmdC1iaW5hbmNlLWZvbGxvd2luZy1jZnRjLWxhd3N1aXQtc2F5cy1uYW5zZW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Mar 2023 07:00:00 GMT",
        "title": "$852,000,000 in Ethereum, Polygon, Fantom and Additional Altcoins Have Left Binance Following CFTC Lawsuit: Nansen - The Daily Hodl",
        "content": "Crypto analytics firm Nansen says that more than $850 million worth of several crypto assets flowed out of Binance after a US federal agency accused the exchange of regulatory violations.\n\nAccording to Nansen, the world’s largest exchange by trading volume saw customers moving large volumes of virtual assets off the platform including Ethereum (ETH), Polygon (MATIC), Binance Coin (BNB), Avalanche (AVAX) and Fantom (FTM) within 24 hours of the alleged violations.\n\n“About $852 million* net outflow from Binance in 24 hours.\n\nAlso keep in mind that on December 13th last year, Binance processed $3 billion net outflow in one day.\n\n*Including ETH & Ethereum, Polygon, BNB Chain, Avalanche, Fantom tokens.”\n\nAccording to Nansen, Binance currently holds more than $62 billion in assets.\n\n“Binance holds $63.2+ billion in their publicly disclosed wallets, including: $19 billion in USDT, $14.5 billion in BTC $7.5 billion in ETH, $7.1 billion in BUSD, $3.2 billion in BNB. And others.”\n\nThe outflow occurred within 24 hours of Monday’s news that the US regulator the Commodities Future Trading Commission (CFTC) has charged crypto exchange Binance and its CEO Changpeng Zhao with a long list of violations.\n\nIn a press release from the CFTC, Chairman Rostin Behnam said Binance knowingly broke CFTC rules and has been actively avoiding compliance, and in a recent interview with CNBC Behnam said he is confident in its case against Binance.\n\nZhao responded to the complaint in a company blog post, saying he does “not agree with the characterization of many of the issues alleged in the complaint.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vdGhlZGFsZXNyZXBvcnQuY29tL2NyeXB0by1uZnRzL2JsYWNrcm9ja3MtbGFycnktZmluay1leGNpdGVkLWFib3V0LXRoZS1mdXR1cmUtb2YtY3J5cHRvY3VycmVuY2llcy1hbmQtZGlnaXRhbC1hc3NldHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Mar 2023 07:00:00 GMT",
        "title": "BlackRock's Larry Fink Excited About The Future Of Cryptocurrencies And Digital Assets - The Dales Report",
        "content": "It’s no secret that Bitcoin, Ethereum and most other major cryptocurrencies are trading well below their all-time highs. It’s why the phrase “crypto winter” has become a top discussion among investors.\n\nWhile a bear market has scared away many individual investors and financial institutions, others are now laying the groundwork for the next bull run.\n\nTwo of the world’s largest and most respected financial institutions — BlackRock Inc. and Fidelity Investments — recently dove headfirst into the cryptocurrency world. And with a combined $14 trillion in assets under management, it’s something to pay close attention to.\n\nBlackRock’s Larry Fink Excited About The Future\n\nIn his annual letter to shareholders, BlackRock CEO Larry Fink shared his excitement about the future of cryptocurrency and digital assets as a whole.\n\n“At BlackRock we continue to explore the digital assets ecosystem, especially areas most relevant to our clients such as permissioned blockchains and tokenization of stocks and bonds,” Fink wrote.\n\nLarry Fink on crypto: \"The technology and the opportunities are real. We do need better connectivity, more regulations, more AML. I believe the purpose of crypto will play a big role in the modern world but that being said, we have to make sure it's properly regulated. — Charles Gasparino (@CGasparino) January 13, 2023\n\nThis isn’t the first time BlackRock and Fink have made their intention clear about their involvement in the blockchain and emerging technology space. In 2022, BlackRock partnered with Coinbase to provide its institutional clients with access to Bitcoin. That was a bold move for an investment company with the size and reach of BlackRock, but it’s been a welcome addition.\n\nFidelity Joining The Crypto Revolution\n\nEarlier this month, Fidelity Crypto made its way to the public, allowing tens of millions of its retail customers to buy and sell Bitcoin, Ethereum and other cryptocurrencies. Adding to the excitement is the fact that all Bitcoin and Ethereum transactions on the app are commission-free.\n\nAnd don’t forget this: The investment manager filed three U.S. trademark applications at the end of 2022. The applications made mention of crypto trading, metaverse investment services, non-fungible tokens (NFTs) and virtual real estate investing. All of these areas are primed for hypergrowth in 2023 and beyond.\n\nWhen companies like BlackRock and Fidelity take a step into the future — such as going all-in on cryptocurrency and digital assets — it’s important to take notice. No one knows when the next crypto bull run will arrive, but when it does it’s safe to say that BlackRock and Fidelity will be in a position to take full advantage.\n\nThis article was originally published on Benzinga and appears here with permission."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMimAFodHRwczovL3d3dy5saXZlbWludC5jb20vYnJhbmQtc3Rvcmllcy9nZXQtcmVhZHktZm9yLXRoZS1uZXh0LWNyeXB0by1idWxsLXJ1bi13aXRoLWV0aGVyZXVtLWV0aC1zaGliYS1pbnUtc2hpYi1hbmQtcmVucS1maW5hbmNlLXJlbnEtMTE2ODAwODYwMTgzNzguaHRtbNIBnAFodHRwczovL3d3dy5saXZlbWludC5jb20vYnJhbmQtc3Rvcmllcy9nZXQtcmVhZHktZm9yLXRoZS1uZXh0LWNyeXB0by1idWxsLXJ1bi13aXRoLWV0aGVyZXVtLWV0aC1zaGliYS1pbnUtc2hpYi1hbmQtcmVucS1maW5hbmNlLXJlbnEvYW1wLTExNjgwMDg2MDE4Mzc4Lmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Mar 2023 07:00:00 GMT",
        "title": "Get ready for the next crypto bull run with Ethereum (ETH), Shiba Inu (SHIB), and RenQ Finance (RENQ) | Mint - Mint",
        "content": "As the crypto market continues to recover from the recent bearish trends, investors are gearing up for the next bull run.\n\nWhile Bitcoin (BTC) remains a popular choice for many investors, there are other cryptocurrencies that are worth considering, such as Ethereum (ETH), Shiba Inu (SHIB), and RenQ Finance (RENQ).\n\n>>>>> BUY RENQ TOKENS HERE <<<<<\n\nIn this article, we'll take a closer look at these three cryptocurrencies and why they could be worth adding to your portfolio.\n\nEthereum (ETH)\n\nEthereum is the second-largest cryptocurrency by market capitalization, and it's often considered to be the backbone of the DeFi (decentralized finance) space. The Ethereum network is used to build and host a wide range of decentralized applications (dApps), including many popular DeFi protocols.\n\nOne of the main advantages of Ethereum is its flexibility. The network allows developers to create custom smart contracts and dApps, which can be used for a variety of purposes. Ethereum is also known for its relatively fast transaction speeds and low fees, making it a popular choice for DeFi users.\n\nThe Ethereum network has paved the way for many of today's modern blockchain solutions, such as smart contracts, decentralized applications, DeFi, NFTs, tokens, and gaming. Its infrastructure provides a solid foundation for developers to build upon and is expected to continue to expand as blockchain technology gains wider adoption.\n\nFor these reasons, it is recommended to have Ethereum as a permanent part of your cryptocurrency portfolio.\n\nShiba Inu (SHIB)\n\nShiba Inu is a relatively new cryptocurrency that has gained a lot of attention in recent months. The token was created as a joke, modeled after the popular Dogecoin (DOGE) cryptocurrency, but it has since developed a strong community of supporters.\n\nOne of the main features of Shiba Inu is its burn rate mechanism, which involves a portion of each transaction being burned, effectively reducing the total supply of SHIB tokens. This has led to a significant increase in demand for the token, driving up its price.\n\nAnother factor contributing to the popularity of Shiba Inu is its use in the NFT (non-fungible token) space. Many NFT marketplaces and platforms now accept SHIB as a form of payment, further increasing its utility and demand.\n\n>>>>> BUY RENQ TOKENS HERE <<<<<\n\nRenQ Finance (RENQ)\n\nRenQ Finance is a relatively new DeFi protocol that aims to provide institutional-level liquidity and slippage-free trading for the DeFi community. The protocol utilizes a hybrid infrastructure model, combining on-chain and off-chain elements to provide fast and efficient trading.\n\nOne of the main advantages of RenQ Finance is its comprehensive approach to trading. The protocol offers a wide range of features, including a DeFi wallet, cross-chain swap, governance portal, and high-leverage trading. This all-in-one solution sets RenQ Finance apart from many other DeFi projects, which often focus on a single area of trading or liquidity provision.\n\nRenQ Finance has already achieved several notable milestones, including the launch of its DeFi wallet, cross-chain swap features, and passing the Certik Audit test. The recently released project protocol currently at presale has also attracted significant attention from investors and traders, raising over $3.6 million.\n\nFurthermore, RenQ Finance stands out in the cryptocurrency market due to its innovative approach to decentralized finance (DeFi), combined with its commitment to security and interoperability. These features make RenQ Finance an attractive investment option for investors who prioritize long-term growth and stability in their portfolio.\n\nConclusion\n\nAs the crypto market continues to evolve, it's important for investors to consider a diverse range of cryptocurrencies. Ethereum, Shiba Inu, and RenQ Finance all offer unique features and advantages that could make them worth adding to your portfolio.\n\nOf course, as with any investment, it's important to do your own research and consider your own risk tolerance before making any decisions.\n\nClick Here to Buy RenQ Finance (RENQ) Tokens.\n\nVisit the links below for more information about RenQ Finance (RENQ):\n\nWebsite: https://renq.io\n\nWhitepaper: https://renq.io/whitepaper.pdf\n\nDisclaimer: This article is a paid publication and does not have journalistic/ editorial involvement of Hindustan Times. Hindustan Times does not endorse/ subscribe to the contents of the article/advertisement and/or views expressed herein. The reader is further advised that Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Hindustan Times shall not in any manner, be responsible and/or liable in any manner whatsoever for all that is stated in the article and/or also with regard to the views, opinions, announcements, declarations, affirmations etc., stated/featured in same. The decision to read hereinafter is purely a matter of choice and shall be construed as an express undertaking/guarantee in favour of Hindustan Times of being absolved from any/ all potential legal action, or enforceable claims. The content may be for information and awareness purposes and does not constitute a financial advice.\n\nMilestone Alert! Livemint tops charts as the fastest growing news website in the world 🌏 Click here to know more.\n\nUnlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now!"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vYXJiaXRydW0tb3B0aW1pc20tYW5kLXBvbHlnb24td2hpY2gtaXMtdGhlLXVsdGltYXRlLWV0aGVyZXVtLWwyL9IBamh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vYXJiaXRydW0tb3B0aW1pc20tYW5kLXBvbHlnb24td2hpY2gtaXMtdGhlLXVsdGltYXRlLWV0aGVyZXVtLWwyL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Mar 2023 07:00:00 GMT",
        "title": "Arbitrum, Optimism, And Polygon: Which Is The Ultimate Ethereum L2? - NewsBTC",
        "content": "Ethereum Layer 2 (L2) blockchains are heating up in the crypto industry as they provide a very needed service to investors. These L2s make it so transaction on the Ethereum network is very cheap compared to the Layer 1 blockchain.\n\nThere are already a number of L2 blockchains that are now competing for market share on the Ethereum blockchain. Out of these, the top 3 are Polygon, Arbitrum, and Optimism, all of which have seen tremendous support in the market. In this report, we take a look at these L2s to determine which is the best performer.\n\nLooking At Ethereum Layer 2 Blockchains\n\nThe top 3 Ethereum Layer 2 blockchains are doing quite well and their total value locked (TVL) has grown since their inception. However, there has been a wide gap when it comes to usage, as well as a difference in the TVL on the blockchain.\n\nArbitrum, although the last to gain widespread popularity, has surged ahead of the rest in terms of TVL and usage. The L2 currently boasts the fourth largest TVL in the whole of decentralized finance (DeFi) with over $2.2 billion locked so far.\n\nFor comparison, Polygon is the second-best performing Layer 2 network but it only has around $1.07 billion in TVL, over 50% lower than that of Arbitrum. Furthermore, Optimism is the lowest performer of the three but it is not far behind Polygon with a TVL of $923 million.\n\nWhen it comes to usage, Arbitrum is still way ahead of the rest with a 24-hour volume of $583 million compared to $148 million for Polygon and $38 million for Optimism.\n\nArbitrum volume outpaces all other L2 | Source: DeFiLlama\n\nArbitrum, Optimism, And Polygon Token Performance\n\nWith Arbitrum’s airdrop last week, the top 3 Ethereum Layer 2 blockchains all have tokens now, which means their performances can be compared to one another. Some have done better than others, but the margin remains quite narrow.\n\nOP price performs best of the top 3 ETH L2 | Source: OPUSD on TradingView.com\n\nPresently, the price of Arbitrum (ARB) is sitting at $1.26, rising 10% in the last day, but it is not the only one that has achieved this fear. Optimism (OP) has done even better, surging over 10.39% in the same time period to cross $2.28.\n\nPolygon (MATIC) is the worse performer of the bunch in this regard with 8% gains that have brought its price to $1.14. However, MATIC remains the largest out of the three with a market cap of $10.35 billion compared to $1.6 billion for ARB and $716 million for OP.\n\nFollow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from InvestingCube, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vYnJhbmQtc3Rvcmllcy9iaXRjb2luLXZzLWV0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tZXhwZXJ0cy1iZWxpZXZlLXJlbnEtd2lsbC1naXZlLXByb2ZpdHMtMTAxNjgwMTgwNDcyMDI0Lmh0bWzSAZEBaHR0cHM6Ly93d3cuaGluZHVzdGFudGltZXMuY29tL2JyYW5kLXN0b3JpZXMvYml0Y29pbi12cy1ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLWV4cGVydHMtYmVsaWV2ZS1yZW5xLXdpbGwtZ2l2ZS1wcm9maXRzLTEwMTY4MDE4MDQ3MjAyNC1hbXAuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin vs Ethereum Price Prediction, Experts believe RenQ will give profits - Hindustan Times",
        "content": "New Delhi (India), March 30: Bitcoin and Ethereum have been the top two cryptocurrencies in the market for several years now. However, as the crypto industry continues to evolve, new altcoins are emerging that could offer better profit potential.\n\nRenQ Finance (RENQ) is one such altcoin that experts believe could outperform both Bitcoin and Ethereum in 2023.\n\nHindustan Times - your fastest source for breaking news! Read now.\n\n>>>>> BUY RENQ TOKENS HERE <<<<<\n\nBitcoin vs Ethereum: A Brief Comparison\n\nBitcoin and Ethereum are both decentralized, open-source blockchain networks that allow for peer-to-peer transactions without the need for intermediaries like banks. Bitcoin was the first cryptocurrency, launched in 2009 by an unknown person using the pseudonym Satoshi Nakamoto. Ethereum, on the other hand, was created by Vitalik Buterin in 2013 and launched in 2015.\n\nWhile Bitcoin's primary use case is as a digital currency, Ethereum's blockchain is designed to support smart contracts and decentralized applications (DApps). Ethereum's native cryptocurrency, Ether (ETH), is used to pay for transaction fees and computational services on the network.\n\nBitcoin has a fixed supply of 21 million coins, while Ethereum does not have a fixed supply but uses a mechanism called \"proof of stake\" to ensure the network's security and stability.\n\nBitcoin and Ethereum Price Forecast 2023\n\nBitcoin and Ethereum have had an impressive run over the past few years, with Bitcoin hitting an all-time high of nearly $69,000 in 2021, and Ethereum reaching an all-time high of over $4,300 in May 2021 as well. However, both cryptocurrencies have faced significant price fluctuations in recent months, with Bitcoin now trading at around $27,684 and Ethereum trading at around $1,755 as of writing.\n\nMany experts believe that both Bitcoin and Ethereum will continue to face price volatility in the coming years. Some predict that Bitcoin's price could reach $100,000 by the end of 2023, while others believe that it could fall as low as $10,000. Similarly, Ethereum's price forecasts for 2023 range from a high of $10,000 to a low of $500.\n\nRenQ Finance: The Altcoin with Better Profit Potential\n\nWhile Bitcoin and Ethereum have been the top performers in the cryptocurrency market, RenQ Finance (RENQ) is an altcoin that experts believe has better profit potential in the coming years. RenQ Finance is a decentralized finance (DeFi) platform that aims to provide institutional-grade liquidity to the DeFi market.\n\n>>>>> BUY RENQ TOKENS HERE <<<<<\n\nOne of the key features of RenQ Finance is its \"smart contract\" technology, which allows users to access liquidity from multiple sources, including centralized exchanges, decentralized exchanges, and lending platforms. This technology ensures that users always get the best price for their trades and allows them to move their assets seamlessly between different platforms.\n\nAnother significant advantage of RenQ Finance is its low transaction fees. Unlike Bitcoin and Ethereum, which have high transaction fees due to network congestion, RenQ Finance's fees are minimal, making it a more cost-effective option for users.\n\nExperts predict that RenQ Finance could see significant price growth in the coming years, with some forecasting a price of $1 or more by the end of 2023. The platform's unique features and strong community support make it an attractive investment option for those looking to diversify their portfolio and capitalize on the growing DeFi market.\n\nConclusion\n\nWhile Bitcoin and Ethereum have been the top performers in the crypto market for several years, new altcoins like RenQ Finance are emerging that offer better profit potential. RenQ Finance's innovative features, low transaction fees, and strong community support make it a promising investment option for those looking to capitalize on the growing DeFi market.\n\nHowever, as with any investment, it's essential to do your own research and carefully consider the risks before investing in any cryptocurrency.\n\nClick Here to Buy RenQ Finance (RENQ) Tokens.\n\nVisit the links below for more information about RenQ Finance (RENQ):\n\nWebsite: https://renq.io\n\nWhitepaper: https://renq.io/whitepaper.pdf\n\nDisclaimer: This article is a paid publication and does not have journalistic/ editorial involvement of Hindustan Times. Hindustan Times does not endorse/ subscribe to the contents of the article/advertisement and/or views expressed herein. The reader is further advised that Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Hindustan Times shall not in any manner, be responsible and/or liable in any manner whatsoever for all that is stated in the article and/or also with regard to the views, opinions, announcements, declarations, affirmations etc., stated/featured in same. The decision to read hereinafter is purely a matter of choice and shall be construed as an express undertaking/guarantee in favour of Hindustan Times of being absolved from any/ all potential legal action, or enforceable claims. The content may be for information and awareness purposes and does not constitute a financial advice."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3prLXJvbGx1cHMtY2hlYXBlci13aXRoLXNjYWxl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Mar 2023 07:00:00 GMT",
        "title": "Zero-knowledge Rollups Get Cheaper With Scale - Blockworks",
        "content": "Ethereum scaling with zero-knowledge (zk) proof technology has rapidly moved from theory to functioning public mainnet, with dueling zero-knowledge Ethereum Virtual Machines (zkEVMs) from Matter Labs and Polygon launching in the past week.\n\nSoon to follow will be ConsenSys, the Ethereum blockchain infrastructure company, which recently deployed its zkEVM onto an Ethereum testnet.\n\nZk rollups are considered a breakthrough in crypto technology, as zero-knowledge proofs allow information to be proven to be valid or invalid without revealing the information itself.\n\nOn Ethereum layer-2 rollups, this means that transactions can be batched and validated by Ethereum without revealing the specifics involved in the individual transactions on the Ethereum mainnet.\n\nThis type of technology can considerably lower transaction costs by compressing the data, making more efficient use of Ethereum blockspace.\n\nHow do zk rollups lower transaction fees?\n\nZk rollups built on Ethereum offload the computation and execution of smart contracts to a separate layer-2 blockchain built on top of the base layer.\n\nThis means that, rather than having the Ethereum mainnet validators process individual transactions, the rollup instead offloads that responsibility to a prover and verifier on the layer-2 network.\n\n“Anyone can download the data and check if it is correct for some period of time,” Blockworks Research said.\n\nUnlike Ethereum mainnet, where more users and more transactions lead to increased gas fees, the costs of writing data to mainnet from a zk rollup in fact decline as the number of users increases since the otherwise fixed cost is divided between all users whose transactions are in a batch, DeFi researcher who goes by the ​​pseudonym Ignas tweeted.\n\n“When there are fewer transactions the fixed cost is distributed among fewer users, leading to higher average gas fees per transaction. As transaction volume increases, the fixed cost gets spread out, and fees drop,” Ignas said.\n\nMikhail Komarov, founder of zk infrastructure developer =nil; Foundation, agrees, but with a caveat.\n\n“In terms of L-1 transactions, this is true. But a user pays an L-2 fee, not an L-1 fee,” Komarov told Blockworks. “This means a rollup can charge some larger or smaller end-user fee with the only difference of using its own L-2 token for that.”\n\nCurrent zk rollups, however, do not charge fees in a native token — if they have one — but instead use ether.\n\nWhat exactly gets posted back to Ethereum mainnet depends on the specifics of the rollup implementation.\n\nFor instance, Polygon’s zkEVMs posts full transactions to mainnet, Bartek Kiepuszewski of L2Beat explained on Twitter, Tuesday. By contrast, both zkSync and StarkNet only submit changes in the state of the EVM that occur as a result of those transactions.\n\nLoading Tweet..\n\n“Right now, we have to differentiate between systems that are EVM-equivalent and EVM-compatible,” Kiepuszewski said at Devcon Bogota, in October 2022. “I think we’re going to see a very interesting competition between systems that try to emulate the EVM as close as possible and systems that will prefer to make sure that the proving is optimized for the particular VM — and in this category I would definitely put zkSync and StarkNet. The competition between these two approaches is will be very interesting to watch.”\n\nSimilar to how transactions on layer-1 cost a gas fee, posting data from layer-2 validity proofs also requires a fee. Currently, transactions are posted through ordinary Ethereum “calldata” in a transaction. But this will change under EIP-4844, Blockworks research said.\n\n“It will be posted to these things called blobs that will have a separate fee market to normal transactions making it cheaper,” Blockworks Research said.\n\nEIP-4844, also known as Proto-Danksharding, will the part of the next major Ethereum upgrade after Shanghai, dubbed Cancun.\n\n“I would say the only thing which can drive down data availability cost is a better compression (proof and circuits ‘quality’),” Komarov said. “The better the compression — the smaller the L-1 [data availability] charge.”\n\nUltimately, technological and hardware improvements will reduce the costs of data availability further and, over the long run, transaction fees on Ethereum layer-2s using zk proofs will continue to come down, Blockworks Research said.\n\nUpdated March 30, 2023 at 12:02 pm ET: Additional comments.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vdS50b2RheS9ldGhlcmV1bXMtcm9ja2V0cG9vbC1ycGwtcGx1bmdlcy0xMi1hcy1tYWpvci1ob2xkZXItYWxsZWdlZGx5LXN1ZmZlcnMtbXVsdGltaWxsaW9uLWRvbGxhci1waGlzaGluZ9IBdmh0dHBzOi8vdS50b2RheS9ldGhlcmV1bXMtcm9ja2V0cG9vbC1ycGwtcGx1bmdlcy0xMi1hcy1tYWpvci1ob2xkZXItYWxsZWdlZGx5LXN1ZmZlcnMtbXVsdGltaWxsaW9uLWRvbGxhci1waGlzaGluZz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Mar 2023 07:00:00 GMT",
        "title": "Ethereum's RocketPool (RPL) Plunges 12% as Major Holder Allegedly Suffers Multimillion Dollar Phishing Attack - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nOne of the largest Ethereum (ETH) staking services, RocketPool, suffered a multimillion dollar sell-off today, allegedly caused by a phishing attack. According to Lookonchain, around 85,900 RPL were withdrawn from \"poap.eth\" and then exchanged for ETH, the equivalent of $3.8 million. The address itself most likely belongs to the founder of the POAP protocol, Patricio Worthalter.\n\nAdvertisement\n\nAfter exchanging all the stolen RPLs for Ethereum (ETH), the attacker further scattered the stolen funds between addresses marked \"Fake_Phishing\" and also sent 17 ETH to Binance, PeckShieldAlert reported.\n\nRocketPool (RPL) price reaction\n\nThe sale caused by the theft of RocketPool tokens from Worthalter's wallet has nullified all the positive price action of recent days. After losing more than 13% of its opening price at one point, RPL still managed to recoup some of its fall and is now quoted in the $43 per token area.\n\nAt the peak of the drop, RPL trading volume on Binance , the largest crypto exchange, reached 49,800 RPL within a quarter of an hour, roughly the daily trading rate of the token.\n\nRPL to USD by CoinMarketCap\n\nNeither Worthalter nor POAP has so far commented on what happened."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vdS50b2RheS9jYXJkYW5vLWFkYS10by1iZWNvbWUtbGFyZ2VzdC1ldm0tY2hhaW4tdGhhbmtzLXRvLXRoaXMta2lsbGVyLWlubm92YXRpb27SAVxodHRwczovL3UudG9kYXkvY2FyZGFuby1hZGEtdG8tYmVjb21lLWxhcmdlc3QtZXZtLWNoYWluLXRoYW5rcy10by10aGlzLWtpbGxlci1pbm5vdmF0aW9uP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Mar 2023 07:00:00 GMT",
        "title": "Cardano (ADA) to Become Largest EVM Chain Thanks to This Killer Innovation - U.Today",
        "content": "Leading blockchain developer and Milkomeda co-founder Sebastien Guillemot announced that Cardano (ADA) will become the top EVM chain by next month. This will be possible as a result of Milkomeda's introduction of a new feature that will allow every Cardano user to use any EVM contract directly from any Cardano wallet, and all within ADA, Guillemot said.\n\nAdvertisement\n\nThus, says the developer, Cardano will immediately become one of the largest EVM networks in terms of user base size. In addition, Milkomeda will soon launch staking rewards for all EVM users, including smart contract developers. This will make Cardano the largest EVM-compatible chain with a fully operational staking rewards system. On this occasion, Guillemot invites everyone interested to build on Cardano's EVM layer and receive rewards every five days.\n\nArbitrum uses WASM\n\nOptimism uses MIPS\n\nStarknet uses Cairo\n\n\n\nDo you also consider these self-owns? No, because they’re bringing new capabilities to chains making them stronger — Sebastien Guillemot (@SebastienGllmt) March 30, 2023\n\nHowever, some users were unhappy with this development regarding Cardano. In their view, this calls into question the validity and uniqueness of Cardano as a standalone blockchain. To some, it seemed like an attempt to make life easier for lazy developers who do not want to learn Haskell or Plutus, Cardano's native programming languages.\n\nCardano gaming\n\nThe developer also noted the growing activity on the Milkomeda network related to the adoption of the Paima Engine, a blockchain gaming innovation from the Guillemot team. In his view, this has the potential to turn Cardano into a powerhouse for on-chain gaming in the future."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy90d28tZmluYW5jaWFsLWluc3RpdHV0aW9ucy1wcmVwcGluZy1uZXh0LTE1MjkyMjk5My5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Mar 2023 07:00:00 GMT",
        "title": "These Two Financial Institutions Are Prepping For The Next Crypto Bull Run - Yahoo Finance",
        "content": "It’s no secret that Bitcoin, Ethereum and most other major cryptocurrencies are trading well below their all-time highs. It’s why the phrase “crypto winter” has become a top discussion among investors.\n\nWhile a bear market has scared away many individual investors and financial institutions, others are now laying the groundwork for the next bull run.\n\nDon’t Miss: This Startup Built the World's First AI Marketing Platform That Can Understand Emotion and Some of the Biggest Companies on the Planet Are Already Using It\n\nTwo of the world’s largest and most respected financial institutions — BlackRock Inc. and Fidelity Investments — recently dove headfirst into the cryptocurrency world. And with a combined $14 trillion in assets under management, it’s something to pay close attention to.\n\nBlackRock’s Larry Fink Excited About The Future\n\nIn his annual letter to shareholders, BlackRock CEO Larry Fink shared his excitement about the future of cryptocurrency and digital assets as a whole.\n\n“At BlackRock we continue to explore the digital assets ecosystem, especially areas most relevant to our clients such as permissioned blockchains and tokenization of stocks and bonds,” Fink wrote.\n\nThis isn’t the first time BlackRock and Fink have made their intention clear about their involvement in the blockchain and emerging technology space. In 2022, BlackRock partnered with Coinbase to provide its institutional clients with access to Bitcoin. That was a bold move for an investment company with the size and reach of BlackRock, but it’s been a welcome addition.\n\nTo stay updated with top startup news & investments, sign up for Benzinga’s Startup Investing & Equity Crowdfunding Newsletter\n\nFidelity Joining The Crypto Revolution\n\nEarlier this month, Fidelity Crypto made its way to the public, allowing tens of millions of its retail customers to buy and sell Bitcoin, Ethereum and other cryptocurrencies. Adding to the excitement is the fact that all Bitcoin and Ethereum transactions on the app are commission-free.\n\nStory continues\n\nAnd don’t forget this: The investment manager filed three U.S. trademark applications at the end of 2022. The applications made mention of crypto trading, metaverse investment services, non-fungible tokens (NFTs) and virtual real estate investing. All of these areas are primed for hypergrowth in 2023 and beyond.\n\nWhen companies like BlackRock and Fidelity take a step into the future — such as going all-in on cryptocurrency and digital assets — it’s important to take notice. No one knows when the next crypto bull run will arrive, but when it does it’s safe to say that BlackRock and Fidelity will be in a position to take full advantage.\n\nBanking Collapses as a Catalyst\n\nThe collapse of various regional banks has created a rebound in blockchain-based assets. While they are still off their all-time highs, they are considerably higher than their 2022 lows. The price of Bitcoin has rallied for several weeks now. Gamestop’s NFT marketplace has seen a volume rebound and retail investors have begun increased funding of startups in the space. For example, Gameflip recently crossed $900,000 raised from retail investors in their current equity crowdfunding raise. While institutions previously might have been skeptical of blockchain-based assets, institutional interest might be rebounding following the lack of stability in the banking system, as institutions look for liquid places to store their cash.\n\nSee more on startups investing from Benzinga.\n\nDon't miss real-time alerts on your stocks - join Benzinga Pro for free! Try the tool that will help you invest smarter, faster, and better.\n\nThis article These Two Financial Institutions Are Prepping For The Next Crypto Bull Run originally appeared on Benzinga.com\n\n.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy93aG8td2FzLWZyb250LXJ1bm5pbmctYmluYW5jZS11c2Vyc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Mar 2023 07:00:00 GMT",
        "title": "Who was front-running Binance users? - Cointelegraph",
        "content": "On Jan. 26, a Medium article revealed that an entity with control over multiple Ethereum addresses had consistently purchased cryptocurrencies prior to their listing on Binance, selling them for a million-dollar profit after the event.\n\nThe article refers to 16 cases from an on-chain analysis perspective, demonstrating how the mysterious entity was aware of Binance listings several days in advance, and how it was unlikely to be carried out by someone with little experience in concealing its tracks.\n\nSurprisingly, Binance founder Changpeng “CZ” Zhao issued a statement on the subject two months later, only after the article gained traction on Twitter. CZ claims that the exchange “froze $2 million associated with the address in question” but does not say whether Binance employees were involved.\n\nTraders are now demanding an investigation into the illegal use of insider information in these multiple “front-run” instances. However, the burden of proving illegal access to privileged information may prove difficult for prosecutors.\n\nOn-chain data reveals the covert operations of a Binance listings insider. Over the course of several months, this anonymous individual front-ran the infamous Binance listing pumps of multiple altcoins, booking a 7-figure profit. And he left a trail for us to follow... (1/9) — FatMan (@FatManTerra) March 28, 2023\n\nAt first glance, the accusations about front-running Binance listings appear to be reasonable. However, the on-chain data and numerous instances of “sheer luck” in purchasing cryptocurrencies on decentralized exchanges (DEX) prior to their listing on Binance may not constitute a crime.\n\nAltcoins do not necessarily constitute securities instrument\n\nA securities instrument is a financial asset that can be bought or sold on regulated exchanges, representing ownership or debt from a publicly traded company or government entity. The most common types of securities include stocks, bonds, options and futures contracts.\n\nThank you for pointing this out. We had frozen $2m associated with the address in question before your thread (and they never asked to re-claim). We are also always fighting potential leaks, etc. We welcome you to point them out in the future too. Helps all of us. — CZ Binance (@cz_binance) March 29, 2023\n\nIn the United States, securities listing and trading are primarily regulated by two government agencies: the Securities and Exchange Commission and the Financial Industry Regulatory Authority (FINRA). The SEC is responsible for enforcing federal securities laws, including overseeing the registration and disclosure requirements for securities issuers, while FINRA oversees the firms and professionals involved in the securities industry.\n\nThe accusations against an entity that has consistently run covert operations ahead of Binance listings, supposedly profiting by more than $1.4 million, may have all the elements that justify non-usual trading activities and, almost certainly, unethical. More importantly, such entities might have gotten the information without Binance employees’ knowledge. Still, there are three reasons why insider trading rules likely can not be applied to such a case.\n\nThe Coinbase front-run involved wire fraud\n\nUnlike securities, non-securities investments, such as real estate, art, commodities and cryptocurrencies, are not regulated by the SEC or any other regulatory body. As a result, there are no specific laws or regulations prohibiting front-running in these types of investments.\n\nEven though the above statement is true, the most notorious case of insider trading activity, involving a former product manager at Coinbase, ultimately involved wire fraud. Under U.S. federal law, wire fraud is defined as a crime that involves a scheme to defraud others, with the use of interstate wire communications, including electronic formats.\n\nRelated: Crypto exchanges keep failing, so why do we still trust Changpeng Zhao?\n\nWire fraud is a serious crime that can result in severe penalties, including fines and imprisonment. It is typically investigated and prosecuted by federal law enforcement agencies, such as the Federal Bureau of Investigation or the Department of Justice.\n\nNikhil Wahi and Sameer Ramani were charged with using Ethereum blockchain wallets to acquire digital assets and trading before the Coinbase announcements. However, jurisdiction is a huge difference versus the wallet tied to the Binance listing, as the exchange is not located in the U.S. and, supposedly, does not serve clients based in that region.\n\nIn many jurisdictions, there may not be specific laws or regulations that prohibit front-running in non-securities investments. Therefore, without a legal framework to prohibit this behavior, it may not be considered illegal.\n\nOne needs to prove that the information was illegally acquired\n\nFront-running in securities is often associated with insider trading, which is illegal. However, insider trading typically involves trading securities based on material, non-public information. Since non-securities investments do not involve securities, the concept of insider trading does not apply.\n\nRelated: Expect the SEC to use its Kraken playbook against staking protocols\n\nTo build a case against the owner of the Binance-related listing address, it would be necessary to demonstrate that the owner obtained the privileged information through illegal means. Even if the account has a perfect track record, circumstantial evidence is unlikely to hold in this case.\n\nUnfortunately, cryptocurrency regulation is at best ambiguous, and even the SEC has difficulty proving to courts what cryptocurrencies are considered securities. Moreover, the Commodity Future Trading Commission’s case against Binance and CZ demonstrates that users are not protected from illegal trading activities, regardless of whether they occur with the knowledge or approval of exchange management.\n\nMarcel Pechman is a crypto analyst who worked for 17 years as an equities sales trader for UBS, Deutsche Bank, Pactual & Banco Safra. He holds a post-graduate certificate in engineering and a bachelor’s degree in business administration.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vZGVjcnlwdC5jby8xMjQ5Njkvd2h5LXBpcmF0ZS1uYXRpb24tbGVhdmluZy1wb2x5Z29uLXNldHRpbmctc2FpbC10b3dhcmRzLWFyYml0cnVtLW5vdmHSAWRodHRwczovL2RlY3J5cHQuY28vMTI0OTY5L3doeS1waXJhdGUtbmF0aW9uLWxlYXZpbmctcG9seWdvbi1zZXR0aW5nLXNhaWwtdG93YXJkcy1hcmJpdHJ1bS1ub3ZhP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Mar 2023 07:00:00 GMT",
        "title": "Why Pirate Nation Is Leaving Polygon and Setting Sail Towards Arbitrum Nova - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAhoy, Arbitrum!\n\nPirate Nation is a role-playing game (RPG) with a boxy voxel-art aesthetic and dynamic NFTs, and is almost entirely on-chain. But while many games announce that they’re building on the Ethereum sidechain Polygon, studio Proof of Play is instead setting sail for new shores with Pirate Nation.\n\nProof of Play co-founder and CEO Amitt Mahajan—a veteran of Zynga and the smash casual game Farmville—told Decrypt that Pirate Nation needed to move to a more affordable and scalable platform. Despite what some might think about scaling networks, he said, those Polygon transaction fees really do add up.\n\nAD\n\nAD\n\nSince launching the game in December 2022, Mahajan has seen increased fees on the backend as more players get into the game. While some Pirate Nation players buy NFTs on the Ethereum mainnet before opening the game, any “transactions” or backend activities where players acquire items within the game do not force the user to sign with their wallet or pay gas fees.\n\nWelcome to Pirate Nation, an on-chain RPG on Ethereum by @ProofOfPlay. A game built at the intersection of casual gaming, web3 technology, and shared ownership & incentives. A thread 🧵 covering what you need to know about our game, ecosystem, & team. Let's dive in. 👇 1/many pic.twitter.com/3Urbap46qr — Pirate Nation (@PirateNationNFT) March 30, 2023\n\nIt's a move to simplify the game’s Web3 experience, making it as seamless and immersive as possible without the friction and cumbersome nature of engaging with smart contracts—which hold the code that powers autonomous Web3 apps and games. It has already become the norm for many blockchain games.\n\nWhile some studios opt for pre-authorization methods so that users only have to sign once, other studios instead eat the cost of in-game transactions. Either way, someone has to pay those fees in-game for users to engage with smart contracts—and Proof of Play has been covering those in-game gas fees itself to spare users the hassle.\n\n“As more people have migrated to Polygon, we just started to run into scaling issues with the Polygon chain,” Mahajan told Decrypt. “We were paying between $3,000 and $4,000 a day on gas. And so it just got untenable. It was preventing us from being able to scale the game.”\n\nAD\n\nAD\n\nMahajan said that many options were explored for Pirate Nation, including migrating away from Ethereum entirely or considering a private network—like a Polygon Supernet or an Avalanche Subnet. However, it chose Arbitrum Nova, another Ethereum scaling solution (a layer-2 network) for the game, because it offered support for Pirate Nation’s technical features like OpenZeppelin security products and nodes already implemented into the game.\n\nWhile there's a lot of buzz around zero-knowledge (ZK) scaling networks, including the newly-launched Polygon zkEVM network and the upcoming Immutable zkEVM gaming network based on Polygon's own, Mahajan admitted that he doesn't want to take a risk on something that may not yet be fully optimized.\n\n“There’s a lot of hype around the ZK stuff,” he said. “We don’t want to be the first adopters of these technologies. We’re just trying to provide a great experience to users. So we want to see proof of concepts, examples of projects that are running [in] production before we’re willing to move over.”\n\nDecentralized Focus\n\nWhile Pirate Nation’s team is cautious about anchoring on new shores, Proof of Play has developed its own tech solution called “mirroring” for the move to Arbitrum Nova.\n\nInstead of “bridging” assets through a process that effectively mints a new version of the NFT on the target chain, Pirate Nation has its smart contracts set up so that users will see the assets they buy on the Ethereum mainnet automatically appear in their game on Arbitrum Nova.\n\nPirates, we've been heads down preparing a number of massive upgrades to Pirate Nation, and the @ProofOfPlay game suite. The first of which is ready to be revealed: We are delighted to announce our migration to @Arbitrum Nova. 🥳 1/4 pic.twitter.com/befQBE8QrB — Pirate Nation (@PirateNationNFT) March 21, 2023\n\nIn other words, as the name suggests, it mirrors the game assets on both chains. And since Pirate Nation is nearly entirely on-chain and operated via automated smart contracts, almost every aspect of the game is stored on a blockchain.\n\n“Most Web3 games that are out there, they use NFTs and tokens as the basis for in-game items and currency. But the majority of gameplay still happens in a centralized fashion,” Mahajan said.\n\nAD\n\nAD\n\nHe likened most Web3 games to a game of chess, where the pieces are NFTs.\n\n“But if you actually want to play the game chess, you have to still go to someone's website and connect to their servers. And if for some reason that company goes away, your chess pieces are now useless, because you don't have the board or the game rules to go along with it,” Mahajan said of most Web3 games.\n\nPirate Nation is currently building an on-chain game engine, and also has what Mahajan calls the “equivalent” of a game server on-chain. Numerous smart contracts operate the game’s mechanics as well, meaning that the only major element of the game that isn’t currently stored on-chain is its art, which is stored on IPFS. And compressing and moving the art on-chain wouldn’t be entirely out of the question, Mahajan added.\n\nAs for whether users will notice any changes with Pirate Nation’s migration, Mahajan believes that’s unlikely: “From a user’s perspective, it’s going to be seamless—and, in fact, less friction.”"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3RoZS1jcnlwdG8tbWFya2V0LWV4cGxvZGVzLWFzLWJpdGNvaW4tYW5kLWV0aGVyZXVtLXByaWNlLXB1bXBzLTUtYmVzdC1jcnlwdG9zLXRvLWJ1eS1ub3cv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Mar 2023 07:00:00 GMT",
        "title": "The crypto market explodes as Bitcoin and Ethereum price pumps - 5 best cryptos to buy now! - Analytics Insight",
        "content": "While 2022 was unpleasant to many crypto investors, things seemed to improve again in 2023.\n\nThe bitcoin price has climbed to around $28,000 per bitcoin, up from under $17,000 at the beginning of the year. Price analysis shows bitcoin could be headed for approximately $35,000 per bitcoin.\n\nEthereum’s recent rise is the growing popularity of decentralized finance (DeFi) applications. As DeFi continues gaining traction, demand for ETH will likely increase, driving its price.\n\nHowever, with so many promising projects on the market, many are still figuring out where to start. There are over 22,000 digital currencies available in the market today, resulting in an overwhelming experience for new crypto investors.\n\nWith this in mind, we have studied the market and hand-picked the 5 best crypto to buy now.\n\nList of the 5 best cryptos to buy now\n\nLove Hate Inu (LHINU)\n\nLove Hate Inu is the latest addition to this list of meme coins, a so-called vote-to-earn coin, and is about to take over the crypto world with its unique and amazing features.\n\nLove Hate Inu is vastly more than just a simple meme token. On the contrary, it’s a project with a mission to offer a platform for people to gather and vote on the issues that matter most.\n\nLove Hate Inu allows you to make your voice heard and be part of a community that cares about your opinion. In addition, the voting process is anonymous, which means you can express your opinion without fear of judgment or retaliation.\n\nIt combines two fast-growing niches in one project: crypto dog-inspired meme coin and the online survey market. As a result, it will make it experience impressive growth in the coming years.\n\nCrypto experts forecast that LHINU will skyrocket during 2023 and acquire vastly higher growth in value than DOGE and other popular meme coins.\n\nCurrently, the price of 1 LHINU is 0.000095$. However, investors are recommended to act right now to get LHINU tokens since the price will rocket before the end of the presale.\n\n>>>Buy Love Hate Inu Now!<<<\n\nFight Out (FGHT)\n\nFight Out is the number one Play-2-Earn fitness app that gamifies the fitness lifestyle. This is done via personalized workout plans and training sessions on demand.\n\nFight Out is the innovative gaming platform that has acquired $5.8 million ahead of its initial exchange listings on April 5th, and it could potentially bring you more than 200x gains this year.\n\n>>>Buy Fight Out Now<<<\n\nFight Out brings a new paradigm that challenges the idea of gaming as something that exists in a console-generated world and instead links gaming results to what you do in the non-game world environment.\n\nThere is also a great bonus that could be worth up to 67% of the amount of FGHT tokens that investors have already bought. To get this offer, buyers must acquire up to $50,000 worth of FGHT and hold on to it for at least 36 months.\n\nMembers of Fight Out can gain financial benefits by completing fitness-related activities and exercises.\n\nThe platform provides a soulbound NFT avatar free to mint at account creation. They are linked to a member and cannot be sold. The avatar tracks movements and accomplishments and translates data from members’ workouts into statistical points.\n\n>>>Buy Fight Out Now<<<\n\nC+Charge (CCHG)\n\nC+Charge helps electric vehicle drivers by providing them with a unique and vital peer-to-peer payment system and charging ecosystem in the form of a simple app that will be used for payments and tracking data.\n\nC+Charge is a crypto project headed towards developing an ecosystem that will be straightforward to operate and reward users with carbon credits. As a result, the transparency and reward system will motivate many people to use an EV instead of the regular one, which will benefit the planet and the users’ wallets.\n\nC+Charge can significantly provide a more pleasing experience to EV owners with a back-end system competent in communicating with chargers and detecting and diagnosing problems in real-time.\n\nThe team behind the C+Charge project has confirmed that CCGH will be listed on Bitmart exchange, CoinMarketCap, and CoinGecko on March 31st.\n\nThe listings will surely increase the exposure of this token and drive its price, so make sure you get the CCGH tokens now before the presale ends and the price pumps.\n\n>>>Buy C+Charge Now<<<\n\nMetropoly (MET)\n\nMetropoly makes it possible for anyone from anywhere worldwide to buy fractions of a multi-million dollar villa, wholly decentralized and without any paperwork.\n\nMetropoly is the first NFT marketplace in the world that is fully supported by real estate and real-world utility. Their mission is to make the real estate market accessible to people worldwide regardless of their origin, country, or social status.\n\nThe Metropoly NFT holders enjoy all the benefits of investing in real property, which means that the rental income from the tenants gets divided equally among all NFT holders and paid in USDT.\n\n>>> Buy Metropoly Now<<<\n\nRobotEra (TARO)\n\nRobotEra is a metaverse gaming platform that aims to integrate NFT protocol and in-game earning methods using TARO, its native cryptocurrency.\n\nRobotEra promises its users a play-to-earn experience where players can experience gameplay such as mining, exploration, creation, and battle. Besides playing, players can cultivate sacred trees, sell NFTs, advertise, and stake tokens to earn income.\n\nDon’t miss your chance to join the RobotEra revolution and secure your share of TARO at a discounted presale price of $0.02 per token.\n\n>>>Buy RobotEra Now<<<\n\nConclusion\n\nThe crypto market is starting to recover after the recent unpleasant investing period. As all eyes are mainly on BTC and ETH, price analysis gives us hope that the next period will be more profitable and appealing to investors, with BTC hitting almost $30,000.\n\nThose who like to invest more into less popular coins than BTC but still with a huge ROI potential, offering real utility to people, and planning to stay in the crypto market for long-term, you may want to dig deeper into LHINU, FGHT, CCHG, MET, and TARO and see it for yourself why so many people are crazy about these cryptos.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY29pbmZvbWFuaWEuY29tL2V0aGVyZXVtLWFuYWx5c2lzLXN0cm9uZy1iZWFyaXNoLXNpZ25hbC1pbmRpY2F0ZXMtYS1kcm9wLWJsb3ctMTUwMC_SAV9odHRwczovL2NvaW5mb21hbmlhLmNvbS9ldGhlcmV1bS1hbmFseXNpcy1zdHJvbmctYmVhcmlzaC1zaWduYWwtaW5kaWNhdGVzLWEtZHJvcC1ibG93LTE1MDAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Mar 2023 07:00:00 GMT",
        "title": "Ethereum Analysis: Strong Bearish Signal Indicates a Drop Blow $1,500 - Coinfomania",
        "content": "Ethereum prices over the last seven days showed a gradual decline in the buying volume of the asset. A look at the chart paints a clearer picture of what transpired.\n\nThe chart above depicts almost equal candles of different colors. This is as a result of a near equilibrium in buying and selling pressure. An increase in one day is always shortlived as an opposing action may take place during the next intraday session.\n\nThis was dominant trend during the previous intraweek session. In the end, we noticed a red doji. This pattern is still present during the current seven-day period. As with the previous, we are also seeing a doji.\n\nMany traders are finding it hard to come up with possible predictions as to how prices may perform in the coming days. Indicators, however, are pointing to a massive downtrend. Let’s consider these metrics.\n\nThe Moving Average Convergence Divergence\n\nThe indicator shows that the apex altcoin had a bearish convergence a few days ago. However, it is not pronounced as the asset failed to record any huge price change.\n\nOver the last four days, we noticed that the 12-day EMA is very close to the 26-day EMA with no contact. This is also the trend at this time. Nonetheless, a divergence is almost inevitable as the crypto market is losing its bullish momentum.\n\nSuch a bearish event may spell out a massive in price in the coming days.\n\nYour crypto deserves the best security. Get a Ledger hardware wallet for just $79!"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiqAFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC8yMDIzLWlzLXRoZS15ZWFyLW9mLWNyeXB0b2N1cnJlbmNpZXMtYWNjb3JkaW5nLXRvLWJ1cm5pc2tlLWJpdGNvaW4tYW5kLWV0aGVyZXVtLW9uLWEtaGlnaC13aGlsZS1iaWctZXllcy1jb2luLW9mZmVycy1odWdlLWJvbnVzLWluLWljby_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Mar 2023 07:00:00 GMT",
        "title": "2023 Is The Year OF Cryptocurrencies According to Burniske, Bitcoin and Ethereum On A High While Big Eyes Coin ... - Analytics Insight",
        "content": "One of the leading cryptocurrency analysts, Chris Burniske has conveyed a bullish outlook in 2023 despite the banking crisis that caused much upheaval in the beginning of the year. He expressed that while the bank collapses might spread short term volatility in the digital currency environment, the situation is going to turn and become profitable for crypto investors in the long run. Hasty rate hike is the culprit for the banking crisis which according to Burniske can be resolved by adjusting monetary policies. He tweeted that “blockchains are critical infrastructure that provide solutions to the problems our society faces, including AI.”\n\nBitcoin Gets Its Mojo Back\n\nBitcoin (BTC) got its mojo back in March 2023 after a bleak 2022. It has seen gains of more than 70%, surpassing all other major assets and was trading at its highest in nine months this week. The bank collapse certainly hit the leading coin in the beginning of 2023 but it has bounced back even better.\n\nBitcoin’s core user base of retail investors have been the major driving force behind the bull run. According to CoinShares, BTC investments products witnessed outflows of $113 million favoured by large investors. Some analysts say that Bitcoin’s intrinsic characteristics are now totally capable of price support. BTC is currently trading at $27,078 with a market cap of $523.44 Billion. Looking at the figures, the crypto analysts might be right.\n\nEthereum Could Rise Up To $3049 in 2023\n\nEthereum (ETH) is one of the most technologically advanced cryptocurrencies which is also widely used. ETH has been showing tremendous growth rates in recent years. It is being predicted that 2023 is going to be the year where ETH rises to its full potential. According to price predictions made by analysts, ETH could rise up to $3049 this year.\n\nEthereum Merge was completed last year. Staked ETH was locked on the network. The upcoming Shanghai upgrade will enable the users to un-stake their staked ETH coins for the first time. The upgrade was first scheduled for March but has now been postponed to April. Currently ETH is priced at $1746.08 with a market cap of $213.67 Billion.\n\nBig Eyes Coin Set For Launch, Gives 250% Bonus\n\nBig Eyes Coin (BIG) is a new altcoin in the meme coin arena. With 80% of the 200 billion BIG tokens available at launch, it is definitely aiming to be one of the coolest cat coins amongst cryptocurrencies that have been historically more dog-themed. Big eyes Coin is in stage 12 of ICO and has raised a whopping $32.53 million. The ICO is soon going to end and launch will certainly lead to an immediate price hike.\n\nThe community or Kitty Cuddlers who have supported the meme coin since the beginning already enjoy 390% ROI. If you haven’t, all is not lost. Big Eyes Coin is offering the users 250% bonus on all purchases of BIG tokens and the Loot Boxes. One just has to apply the bonus code BULLRUN250 at the checkout for 250% additional BIG tokens. Believe it or not, this crypto cat is on the prowl in 2023.\n\nBig Eyes Coin (BIG)\n\nPresale: https://buy.bigeyes.space/\n\nWebsite: https://bigeyes.space/\n\nTelegram: https://t.me/BIGEYESOFFICIAL\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vY3J5cHRvdGlja2VyLmlvL2VuL2Jlc3Qtd2ViMy1vcGVuLXNvdXJjZS10b29scy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Mar 2023 07:00:00 GMT",
        "title": "Best Web3 open-source tools 2023 - CryptoTicker.io - Bitcoin Price, Ethereum Price & Crypto News",
        "content": "Share\n\nShare stories you like to your friends"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiGWh0dHBzOi8vd3d3LmxjeC5jb20vZWFybi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Mar 2023 18:13:53 GMT",
        "title": "LCX Earn Tokenized Bond | Earn 7% Interest on Investment | - LCX",
        "content": "World’s First Tokenized Bonds denominated in Euro, Bitcoin (BTC), Ethereum (ETH) and LCX Token.\n\nTokenized Bonds – Security Tokens based on security prospectus endorsed by financial market regulator. Available to verified retail investors in 30 countries.\n\nNote: Investment Period closed. Sign up to be on the waiting list. Next investment period to be announced."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9hcy1hbHRjb2luLXNlYXNvbi1zdGFydHMtc2l6emxpbmctdXAtZG9udC1taXNzLW91dC1vbi1kb2dldHRpLWNhcmRhbm8tYW5kLWV0aGVyZXVtLWJ1bGwtcnVuLWdhaW5zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Mar 2023 07:00:00 GMT",
        "title": "As Altcoin Season Starts Sizzling Up, Don't Miss Out On Dogetti, Cardano and Ethereum Bull Run Gains - Analytics Insight",
        "content": "The 2021 crypto bull run was an incredible time for investors all around! Whether you were knee-deep in crypto or just a newbie that decided to take a bet on crypto. Chances are that if you got in early, around the start of 2021, you saw some tremendous gains!\n\nDuring this previous bull run cycle, in November 2021, Bitcoin (BTC) reached a staggering peak of over 65,000 USD, which felt unbelievable for many – and many altcoins made even bigger gains than Bitcoin… Many would come to realise that although Bitcoin works as a store of value, the DeFi (decentralised finance) altcoins are where you can see the biggest gains in a short amount of time!\n\nIn this article, we will be going through our top three altcoin picks in preparation for the next bull run: Dogetti (DETI), Cardano (ADA) and Ethereum (ETH). We’ll also be discussing the volatility that comes along with altcoins and what you can do to hedge against losses.\n\nDogetti: The Top Dogs Rise To Fame Equals Gains\n\nDogetti (DETI) is the latest and greatest meme token, taking the crypto world by the horns! Dogetti aims to be the top dog in the world of dog-themed cryptos such as Dogecoin (DOGE) and Shiba Inu (SHIB), and with an incredibly rapid growing community (a.k.a family), this could happen sooner than you may think!\n\nAs a DeFi token, Dogetti has great tokenomics – with 6% of each transaction going to various charities, holder benefits, and liquidity/burn wallets, among other purposes! Since it is community-run, everyone in the family has a stake in the coin’s success.\n\nDon’t pass up this chance to participate in the craziness and join one of the most rapidly-expanding crypto projects! You can also receive a 50% bonus on your order by using the brand-new promotion code DON50!\n\nCardano Could See Big Gains Coming Its Way\n\nCharles Hoskinson founded the decentralised, open-source Cardano (ADA) blockchain platform in 2017. It promises to offer a more sustainable and safe way to manage digital assets. The goal of the initiative, which is to develop a more fair and open financial system, is one that many ADA users are deeply committed to!\n\nThe platform differs from other cryptocurrencies thanks to its distinctive features, including its proof-of-stake consensus method and its emphasis on academic research. Cardano has the potential to be a significant player in the blockchain and digital asset industries with a committed community and a solid staff at its back.\n\nThe devoted Cardano community is made up of a diverse group of programmers, entrepreneurs, investors, and supporters. All of them are motivated by the project’s potential to transform conventional finance and usher in a better future for everyone. With this level of importance that Cardano holds in crypto, we can imagine big gains coming for Cardano when altcoin season kicks in!\n\nEthereum – The Biggest Altcoin On The Blockchain\n\nIf Bitcoin (BTC) serves as the digital gold in the world of crypto, then Ethereum (ETH), the second largest crypto is the digital silver – and that is not to be undervalued!\n\nIn the Ethereum network, decentralised apps (DApps) can be created and deployed by developers. Users also have more control over their data than they have with conventional banking organisations or platforms.\n\nWith Ethereum 2.0 around the corner, which is a major upgrade that will bring millions more to crypto, Ethereum is surely one to invest in for altseason!\n\nFinal Thoughts\n\nAs altcoin season heats up, investors should consider Dogetti (DETI), Cardano (ADA), and Ethereum (ETH) for potential gains. Dogetti is a rapidly growing meme token with strong tokenomics and a dedicated community. Cardano is a unique blockchain platform with a commitment to creating a more fair and open financial system. Ethereum is the second-largest crypto with the potential for massive gains thanks to the upcoming Ethereum 2.0 upgrade.\n\nHowever, you should also be aware of the volatility that comes with altcoins and consider hedging against potential losses by diversifying your portfolio. Don’t miss out on the potential gains of altcoin season with these top picks!\n\nDogetti (DETI)\n\nPresale: https://dogetti.io/how-to-buy\n\nWebsite: https://dogetti.io/\n\nTelegram: https://t.me/Dogetti\n\nTwitter: https://twitter.com/_Dogetti_\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vZmluYm9sZC5jb20vZXRoZXJldW0tcG9pc2VkLWZvci1tYXNzaXZlLWJyZWFrLW91dC10by0yMDAwL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Mar 2023 07:00:00 GMT",
        "title": "Ethereum 'poised' for massive break out to $2,000 - Finbold - Finance in Bold",
        "content": "Ethereum (ETH) is on the cusp of a significant breakout, with the digital asset recently showing remarkable strength, reclaiming a crucial support level between $1,700 and $1,780.\n\nNotably, during this critical level’s reclaiming process, an impressive 1.41 million addresses bought 6.48 million ETH, indicating a growing interest in the asset. Furthermore, this support level’s successful reclaiming marks an important milestone for ETH, as it has provided a crucial base and cleared the path for further upside potential.\n\nIndeed, crypto trading analyst Ali Martinez highlighted on March 29, using IntoTheBlock’s In/Out of the money around price chart, that “given the lack of significant resistance ahead, it is entirely reasonable to expect further upside,” based on information for ETH addresses that bought between $1,533 and $2,077.\n\nEthereum price resistance levels. Source: IntoTheBlock’s\n\nIn summary, the current market trends suggest that ETH is primed for a significant surge in value. As Martinez noted, with a solid base established and no considerable resistance ahead, the asset’s upward trajectory is ‘poised to break out.’\n\nEthereum price analysis\n\nCurrently, Ethereum is changing hands at $1,818, up 5.21% in the last 24 hours and 1.47% across the previous week, with a total market capitalization of $222 billion.\n\nEthereum 1-day price chart. Source: Finbold\n\nMeanwhile, the one-day gauges at the finance analytics platform TradingView indicate a bullish sentiment for ETH, considering that their summary is in the ‘strong buy’ area at 17 – the result of moving averages suggesting a ‘strong buy’ at 14 and oscillators pointing to a ‘buy’ at 3.\n\nEthereum 1-day price gauges. Source: TradingView\n\nFinally, it’s worth mentioning that the Shapella network upgrade will be activated on the Ethereum mainnet on April 12, following an official consensus reached by core developers, according to a blog post by the Ethereum Foundation on Tuesday, March 28.\n\nThe EIP-4895 standard will be added to the Ethereum network after the whole of the Shapella update has been implemented. This EIP will make it possible, for the first first time, to withdraw ether that has been staked. In addition, Shapella has made various modifications to its network to reduce the transaction costs associated with certain activities.\n\nInvestors will be hoping that this has further bullish implications for the price of ETH as more than 90% of holders take their Ethereum off exchanges.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vaW52ZXN0b3Jza2luZy5jb20vMjAyMy8wMy8zMC9uZWFybHktOTAtb2YtZXRoZXJldW0tc3VwcGx5LW5vdy1oZWxkLW9mZi1jcnlwdG8tZXhjaGFuZ2VzL9IBZGh0dHBzOi8vaW52ZXN0b3Jza2luZy5jb20vMjAyMy8wMy8zMC9uZWFybHktOTAtb2YtZXRoZXJldW0tc3VwcGx5LW5vdy1oZWxkLW9mZi1jcnlwdG8tZXhjaGFuZ2VzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Mar 2023 07:00:00 GMT",
        "title": "Nearly 90% of Ethereum Supply Now Held Off Crypto Exchanges - Investors King Ltd",
        "content": "The first ever cryptocurrency was launched in 2009, and fourteen years later, crypto has experienced massive growth and adoption worldwide.\n\nFrom being accepted as legal tender in countries like El Salvador to being accepted as a payment method by businesses worldwide, digital currencies have proved they are here to stay and thrive. We have witnessed the boom of crypto globally, and Nigeria has not been left off the group chat.\n\nDespite the limitations of the Central Bank of Nigeria, Nigerians have been at the front line of cryptocurrency adoption in Africa , with millions of users. We all know Nigeria does not have the most stable economy, but we Nigerians have looked to crypto to give us leverage. It has helped us in many ways, from protection from inflation, currency devaluation and much more. With crypto, we can transact with anyone, anywhere in the world, without the need for middlemen, and it’s great for startups and small businesses in need of funding. All in all, crypto has been a game-changer for Nigerians, and it will only get bigger!\n\nAre you ready to hop on the crypto wave and start making money from it? It is never too late. That’s why I am here to share with you all you need to know on how to trade Ethereum in Nigeria. Keep reading to discover the benefits of trading Ethereum and exactly how to trade the popular crypto coin in Nigeria and get the most out of your investment.\n\nOverview of Ethereum\n\nIn 2015, Ethereum was released to the market by Vitalik Buterin, a young Russian programmer who saw the potential for blockchain technology beyond only crypto.\n\nWith Ethereum , developers can create decentralised applications (dApps) and smart contracts. Ethereum has its own crypto, Ether (ETH), used to pay for transactions and encourage developers to build on the platform.\n\nA brief history of Ethereum\n\nAlthough Ethereum was launched in 2015, the idea started in 2013 when Buterin wrote a whitepaper describing the concept of a blockchain platform that could be used beyond financial transactions.\n\nBut it did not stop there. In 2014, the project became quite popular as Buterin started a crowdfunding campaign to raise funds for Ethereum’s development.\n\nThe campaign was a huge success and even raised over $18 million worth of Bitcoin in only 42 days. Amazing, indeed.\n\nCurrently, Ethereum is one of the most popular blockchain platforms. It gave rise to thousands of decentralised applications, ranging from financial applications like decentralised exchanges (DEXs), stablecoins, to non-financial applications such as supply chain management and even voting systems.\n\nBenefits of Trading Ethereum in Nigeria\n\n1. Potential to Make Quick Profits:\n\nYou cannot deny that the whole point of making investments is to make a profit, which makes Ethereum a good choice. Like other crypto coins, the price of Ethereum is volatile, which means that its price can fluctuate rapidly over short periods. This makes it possible for traders to buy when the price is low and sell ETH for quick profit when it is high.\n\n2. Ability To Access a Global Market:\n\nTraditional financial markets are geographically limited, but the cryptocurrency market is global. This means that traders in Nigeria can buy Ethereum in Nigeria and also sell with anyone in the world, giving you access to a much larger market. Is Naira crashing again? Don’t worry; Ethereum has your back.\n\n3. Allows Traders To Bypass Traditional Financial Institutions:\n\nTraditional financial institutions are either inaccessible or unreliable in many parts of the world. The same is the case in Nigeria, from screaming at ATMs today to fighting for your money in the bank tomorrow. It’s a never-ending struggle.\n\nCrypto provides an alternative to these institutions, allowing you to transact directly with each other without the need for intermediaries.\n\nHow To Sell Ethereum For Cash in Nigeria\n\nIf you’re looking to sell your Ethereum in Nigeria, several options are available. One popular option is to use a crypto trading mobile app, Breet. Breet is a Nigerian-based OTC crypto trading app that allows you to convert Ethereum to naira , convert it to fiat currency and withdraw straight to your local bank account free of charge. Let me walk you through the steps of using Breet to sell Ethereum for Naira.\n\nStep 1: Download and Install Breet\n\nTo use Breet, you must first download and install the app on your mobile device. The mobile app is available for Android and iOS devices, and you can download it from the respective app stores.\n\nStep 2: Register and Verify Your Account\n\nOnce you’ve installed the app, you must create an account with Breet. To register, you’ll need to provide your name, email address, phone number, and password. You’ll also need to complete the app’s KYC (Know Your Customer) process by submitting a government-issued ID and a selfie.\n\nStep 3: Generate an Ethereum Wallet Address\n\nOnce your account is verified, you need to generate an Ethereum wallet address to receive crypto. To do this, click on ETHEREUM from the app’s dashboard. This will then open up the Ethereum trade page. Click on ‘Generate Wallet Address’. You’ll then be provided with a unique Ethereum address that you can use to transfer your Ethereum from your external wallet.\n\nStep 4: Send Ethereum To Your Wallet Address:\n\nThe Ethereum wallet address acts just like a bank account number. All you need to do is send your address to the sender or your external wallet through the multiple options available.\n\nStep 5: Sell Ethereum for Cash\n\nSend the amount of Ethereum you want to sell and select “Naira” as the currency you wish to receive. Breet will automatically calculate the amount of Naira you will receive based on the current market rate.\n\nOnce your Ethereum is sent into your Breet Ethereum wallet, you need to wait for at least three confirmations from the blockchain network. Once confirmation is complete, your transaction is tagged as successful, and your funds will reflect in your Breet Naira wallet.\n\nStep 6: Withdraw Your Naira to Your Bank Account\n\nAfter selling your Ethereum for Naira, you can withdraw your funds directly to your Naira bank account. Breet offers free and instant withdrawals to any Nigerian bank account. To withdraw your funds, select the “Withdraw” option, enter the amount you want to withdraw, and select your bank account from the list of available options. Click on “Withdraw” to complete the transaction.\n\nIf your automatic settlement feature is turned on from settings, your funds are automatically withdrawn to your provided local bank account after completing the transaction.\n\nConclusion\n\nTrading Ethereum is profitable, but it is not without risks. Using a crypto trading app like Breet can be a convenient and hassle-free way to sell your Ethereum for cash in Nigeria. With Breet, you can convert your Ethereum to Naira and withdraw your funds straight to your Naira bank account within minutes and free of charge."
    }
]