[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY3J5cHRvLm5ld3MvZXRoZXJldW0tMi0wLXVwZ3JhZGUtaGFzLWJyb3VnaHQtbW9yZS1jZW50cmFsaXphdGlvbi10by10aGUtYmxvY2tjaGFpbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Oct 2023 07:00:00 GMT",
        "title": "Ethereum 2.0 upgrade has brought more centralization to the blockchain - crypto.news",
        "content": "JPMorgan Chase &. Co. has shed light on how the Ethereum network decentralization has decreased significantly since the Merge event and Shanghai upgrade went live.\n\nThe rise of staking and centralization\n\nSince implementing the Merge and Shanghai upgrades, Ethereum has seen a substantial uptick in staking activities.\n\nStaking, a process where users lock up their crypto assets to support network operations, has its merits. According to a CoinDesk report citing JPMorgan research, this surge in staking activity comes at a cost: centralization.\n\nTraditionally, many in the crypto community prefer decentralized liquid staking platforms like Lido over their centralized counterparts.\n\nLido’s approach included adding more node operators to ensure no single entity controlled a significant portion of staked Ether (ETH). The aim was to address centralization concerns.\n\nHowever, centralization remains a risk. A concentration of liquidity providers or node operators could act as a single point of failure or even collude to create an oligopoly, potentially undermining the interests of the broader Ethereum community.\n\nEthereum, the world’s second-largest crypto, has become more centralized since the Merge and Shanghai upgrades. And JPMorgan is highlighting concerns over a decline in staking yields.\n\nYou might also like: Ethereum’s Dencun upgrade: the next major step in scalability\n\nThe menace of rehypothecation\n\nAnother highlight from the report is rehypothecation. This complex term refers to the practice of reusing liquidity tokens as collateral across multiple decentralized finance (DeFi) protocols simultaneously.\n\nDeFi encompasses lending, trading, and other financial activities carried out on the blockchain.\n\nThe problem arises when a staked asset’s value sharply declines or faces a security breach or protocol error.\n\nIn such scenarios, rehypothecation could trigger a cascade of liquidations, jeopardizing the stability of the DeFi ecosystem.\n\nFurthermore, the report points out that the increase in staking has diminished the appeal of Ethereum from a yield perspective.\n\nThis shift is especially noticeable amid rising yields in traditional financial assets. The total staking yield has fallen from 7.3% before the Shanghai upgrade to approximately 5.5%.\n\nFrom a different perspective, the research data presented in December following Ethereum’s Merge upgrade in September 2022 reveals a significant reduction in the network’s energy consumption, akin to the energy usage of entire countries such as Ireland and Austria.\n\nThis decrease in power consumption positively contributes to environmental sustainability, aligning with broader global efforts to reduce the carbon footprint associated with blockchain technologies.\n\nEthereum’s core developers have introduced an Ethereum Improvement Proposal (EIP-7514) as part of the upcoming Dencun upgrade, scheduled for activation in October 2023.\n\nThis proposal aims to slow down the rate of Ether staking. The intention is to provide the Ethereum community with more time to devise a practical reward scheme for stakers on the network.\n\nETH price analysis\n\nAs of the time of writing, the price of Ethereum (ETH) stands at $1,629, representing a 3.4% decline on the weekly timeframe.\n\nEthereum’s Relative Strength Index (RSI) is currently sitting at 40.4.\n\nThe price of ETH is struggling to maintain the $1600 level after facing rejection at the $1700 resistance level. A failure to hold the $1600 level could potentially lead to a further decline to the $1500 level.\n\nFollow Us on Google News"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZGFpbHljb2luLmNvbS90cm9uLWZvdW5kZXItZXRoZXJldW0tY28tZm91bmRlci1jb25kdWN0LW1ham9yLWV0aC1tb3Zlcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 07 Oct 2023 07:00:00 GMT",
        "title": "TRON Founder and Ethereum Co-Founder Conduct Major ETH Moves - DailyCoin",
        "content": "Sun’s actions have raised eyebrows as he has withdrawn millions from Lido Finance without selling.\n\nA mysterious connection has emerged as another entity has swiftly reshuffled ETH assets on Huobi.\n\nButerin, in contrast, has opted for smaller transfers, maintaining an air of enigma.\n\nIn a startling twist of events, two prominent figures in the blockchain space, TRON founder Justin Sun and Ethereum co-founder Vitalik Buterin, have recently made headlines by orchestrating Ethereum (ETH) transfers from their well-known digital wallets.\n\nJustin Sun Withdraws $37.7M in Ethereum from Lido Finance\n\nJustin Sun initiated a substantial withdrawal from Lido Finance, totaling 23,000 ETH, equivalent to a staggering $37.7 million. The entirety of this significant sum was then transferred to a new destination, identified as address 0x454. Remarkably, despite this sizable transaction, Sun chose not to liquidate his ETH holdings.\n\nIntriguingly, another address associated with HTX (Huobi) conducted a withdrawal of 42,999 ETH from Binance shortly after Sun’s ETH deposit into Binance, subsequently reallocating these assets to Lido for staking purposes.\n\nThis recent development marks another instance of Justin Sun’s impactful financial maneuvers. Two days prior, on October 5, Sun withdrew another substantial tranche of 19,000 ETH, totaling $32.8 million, from Lido Finance, subsequently depositing these funds into Binance.\n\nButerin’s Modest $1.64M Transfer Amid Crypto Cleaning\n\nBefore these actions, Sun had made a notable deposit of 5,000 ETH, equivalent to $9.2 million, into Huobi at an ETH price of $1,841 on August 12, 2023, just before the cryptocurrency market experienced a decline, resulting in ETH prices plummeting by more than 14%.\n\nIn contrast, Vitalik Buterin executed a comparatively modest transfer involving 1,000 ETH with a value of $1.64 million, directed towards address 0x556 on the same day. It’s worth highlighting that Buterin has consistently deposited a cumulative total of 2.6 thousand ETH, equivalent to $4.2 million, into Bitstamp and Paxos through this specific address since September 17.\n\nOn the Flipside\n\nJustin Sun’s repeated withdrawals and deposits of significant amounts of ETH may be part of a strategic move to capitalize on market fluctuations.\n\nWith notable amounts of ETH being moved by both Sun and Buterin, there’s potential for these actions to affect Ethereum’s price dynamics.\n\nWhy This Matters\n\nThese high-profile Ethereum transactions, involving influential figures like Justin Sun and Vitalik Buterin, underscore the dynamic nature of crypto. They shed light on the strategic moves of key players within the industry, potentially influencing market sentiment and investor behavior.\n\nTo learn more about Ether ETFs and their potential impact on institutional crypto adoption, read here:\n\nAre Ether ETFs Initiating an Institutional Surge in Crypto?\n\n\n\nAre you curious about the recent challenges facing the ETH burn mechanism amidst growing interest? Discover more details here:\n\nETH Burn Mechanism Struggles Amid Interest Gain Projection"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1wcmljZS1jYW50LWJyZWFrLTJrLWFuYWx5c2lz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 07 Oct 2023 07:00:00 GMT",
        "title": "3 reasons why Ethereum price can't break $2K - Cointelegraph",
        "content": "The price of Ethereum’s native token, Ether (ETH), has gained around 35% in 2023 so far. But its attempts to break above $2,000, a psychological resistance level, have witnessed strong bearish rejections multiple times.\n\nETH/USD daily price chart. Source: TradingView\n\nCointelegraph takes a closer look at the three likely reasons why Ethereum price has failed to decisively retake $2,000 since May 2022.\n\nEthereum price paints bear cycle fractal\n\nEthereum’s inability to cross above $2,000 in 2023 resembles the bearish rejection near $425 from 2018 to 2019.\n\nETH/USD weekly price chart. Source: TradingView\n\nIn both cases, Ether appears to be in a recovery phase while eying close above its 0.236 Fib line of the Fibonacci retracement graph.\n\nFrom 2018 to 2019, the 0.236 Fib line was near $425 and was instrumental in limiting Ether’s recovery attempts. In 2023, the same line is near $2,000, enforcing itself again as a selling area and, thus, pressuring ETH’s price lower.\n\nStronger U.S. dollar, Bitcoin\n\nA strengthening United States dollar has dampened demand for Ethereum in recent months, thus reducing its ability to close decisively above $2,000.\n\nThe prevailing negative correlation between top cryptocurrencies and the dollar has been the main culprit. In 2023, in particular, the weekly correlation coefficient between Ether and the U.S. Dollar Index (DXY) has been consistently negative, as shown below.\n\nETH/USD and DXY weekly correlation coefficient chart. Source: TradingView\n\nMeanwhile, Ethereum has largely underperformed Bitcoin in 2023 due to the ongoing spot Bitcoin ETF hype. For instance, the widely-tracked ETH/BTC pair is down 20% year-to-date.\n\nETH/BTC daily price chart. Source: TradingView\n\nAdditionally, the net capital held by Ethereum-tied investment funds has dropped by $114 million so far in 2023, according to CoinShares’ weekly report. In comparison, Bitcoin-based funds have attracted $168 million in the same period.\n\nRelated: Time to ‘pull the brakes’ on Ethereum and rotate back to Bitcoin: K33 report\n\nEthereum network activity dips\n\nThe total value locked (TVL) across the Ethereum ecosystem has dropped from 18.41 million ETH to 12.79 million ETH so far in 2023. That underscores a reduced availability of funds, resulting in lower yields for investors, as JP Morgan analysts also warned recently.\n\nEthereum TVL since 2019. Source: Defi Llama\n\nThe declining TVL has accompanied a drop in the Ethereum network’s gas fees, which reached a yearly low on Oct. 5.\n\n#Ethereum's network has been particularly cheap to use, and this week's average fee level of $1.13 is the lowest since November, 2022. Though not a perfect signal by any means, lower $ETH costs generally lead to a rise in utility and price rebound. https://t.co/ymXFwGJh49 pic.twitter.com/PEGpXMmZ3q — Santiment (@santimentfeed) October 4, 2023\n\nEthereum’s NFT volumes and unique active wallets have also dropped by 30% and 16.5% in the last 30 days, according to DappRadar.\n\nThat includes declines in the key metrics of popular apps, including decentralized exchange Uniswap v2, DEX aggregator 1inch Network, Ethereum staking provider Lido and others.\n\nEthereum technical analysis\n\nEthereum price technicals meanwhile show a potential rebound toward its 50-day exponential moving average (50-day EMA; the red wave) near $1,665.\n\nHowever, looking broadly, ETH/USD has been paining a bearish continuation pattern called an ascending triangle.\n\nAs a result, a break below the triangle’s lower trendline risks crashing the price by as much as the pattern’s maximum height. In this case, ETH’s price can drop to $1,465 and $1,560 in October 2023, depending on the breakdown point.\n\nETH/USD daily price chart. Source: TradingView\n\nIn the short term, a break above the 50-day EMA could have ETH’s price rise toward the triangle’s upper trendline near $1,730 in October 2023, coinciding with the 200-day EMA (the blue wave).\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3ZpdGFsaWstYnV0ZXJpbi1wcm9wb3Nlcy10d28tdGllci1tb2RlbC10by1hZGRyZXNzLWNlbnRyYWxpemF0aW9uLWNoYWxsZW5nZXMtaW4tZXRoZXJldW0tc3Rha2luZy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Oct 2023 07:00:00 GMT",
        "title": "Vitalik Buterin proposes two-tier model to address 'centralization challenges' in Ethereum staking - CryptoSlate",
        "content": "Ethereum’s founder, Vitalik Buterin, unveiled an innovative proposal this week aimed at refining the platform’s staking mechanism.\n\nAs the world’s second-largest blockchain by market capitalization, Ethereum’s continued evolution is crucial for its vast user base, and these proposed changes aim to bolster decentralization, efficiency, and security.\n\nA Decentralized Vision for Staking\n\nThe primary concern addressed in Buterin’s proposal revolves around the limitations of the current staking system.\n\nNotably, he pinpoints decentralization issues surrounding the selection process for node operators across various staking pools and identifies inefficiencies in the current Layer 1 (L1) consensus mechanism.\n\nPresently, the constraints of solo staking combined with issues surrounding liquid staking mean that the platform can only process between approximately 100,000 to 1 million BLS signatures per slot.\n\nA further complication arises from the need for accountability in signing, which demands a participation record for each signature. If Ethereum scales up globally, using full danksharding for storage might still fall short, with a mere 16 MB per slot accommodating around 64 million stakers.\n\nDrawing inspiration from models implemented by Rocketpool and Lido, Buterin suggests adopting a two-tiered staking system. In this structure, Node Operators and Delegators emerge as central figures.\n\nTo rectify this, Buterin suggests a two-tiered staking model:\n\nA high-complexity slashable tier with frequent activity but limited participants (around 10,000). A low-complexity tier, where members engage sporadically and face minimal or no slashing risk.\n\nThis model would involve the modification of the validator balance cap and implementing a balance threshold to categorize validators into these tiers.\n\nButerin elaborates on potential roles for small-stakers:\n\nRandom selection of 10,000 small-stakers for each slot who sign off on their slot’s head. If divergences arise between the staker and node operator choices, it triggers an error, prompting community intervention.\n\nA system where a delegator declares their online presence, offering to serve as a small-staker for a set duration. For a node’s message to be acknowledged, it needs endorsement from both the node and a randomly picked delegator.\n\nAn approach in which delegators signal their availability, and subsequently, chosen delegators confirm their online status. These delegators can then publish inclusion lists for block validation.\n\nThe roles envisioned for small-stakers are characterized by their sporadic participation and non-slashable nature. Importantly, these roles tackle the significant issue of a potential 51% node operator majority attempting transaction censorship.\n\nButerin also contemplates these solutions in the context of staking pool features. He suggests protocols allowing validators to designate two staking keys: a persistent key and a temporary one, which, when combined, influence the block finalization process.\n\nThe Implications\n\nButerin’s proposal isn’t just technical fixes; it’s a vision for Ethereum’s future. By decentralizing the staking process further and integrating safety nets, he aims to:\n\nEmpower those lacking resources for solo staking, granting them meaningful participation avenues. Reduce the transaction processing load on Ethereum’s consensus layer, making it easier for all to run a validating node.\n\nBy diffusing the staking process and embedding safeguards, the objectives are clear: to empower those who traditionally lack the means for solo staking by offering them a meaningful way to participate and alleviate the transaction processing strain on Ethereum’s consensus layer. This ensures a more accessible platform for everyone intending to run a validating node.\n\nThe proposed refinements underscore the pressing need for minimal, strategic protocol modifications, all pointing towards a balanced, decentralized, and high-functioning Ethereum network."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMC8wNy9vbi1jaGFpbi1hY3Rpdml0eS1oaW50cy1hdC1zaG9ydC10ZXJtLXJlYm91bmQtb3Bwb3J0dW5pdGllcy1mb3ItZXRoZXJldW0tYW5kLXR3by1hbHRjb2lucy1zYW50aW1lbnQv0gGJAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzEwLzA3L29uLWNoYWluLWFjdGl2aXR5LWhpbnRzLWF0LXNob3J0LXRlcm0tcmVib3VuZC1vcHBvcnR1bml0aWVzLWZvci1ldGhlcmV1bS1hbmQtdHdvLWFsdGNvaW5zLXNhbnRpbWVudC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 07 Oct 2023 07:00:00 GMT",
        "title": "On-Chain Activity Hints at Short-Term Rebound Opportunities for Ethereum and Two Altcoins: Santiment - The Daily Hodl",
        "content": "On-chain activity suggests Ethereum (ETH) and two altcoins could be primed for short-term price rallies, according to the crypto analytics firm Santiment.\n\nSantiment notes that ETH, Shiba Inu (SHIB) and SushiSwap (SUSHI) traders displayed “mild signs of panic” on Thursday.\n\nAll three networks displayed some of the highest levels of trader loss-taking (versus profit) in 2023, according to the analytics firm. Santiment notes the loss-taking indicators are big capitulation signals and are “typically signs of a short-term rebound opportunity.”\n\nETH is trading at $1,648 at time of writing. The second-ranked crypto asset is up nearly 2% in the past 24 hours.\n\nSHIB, a Dogecoin (DOGE) rival, is trading at $0.000007 at time of writing. The 19th-ranked asset by market cap is up 0.67% in the past 24 hours.\n\nSushiswap is a multi-chain decentralized exchange (DEX). The project’s native asset, SUSHI, is trading around $0.578 at time of writing and is up more than 3% in the past 24 hours.\n\nSantiment also notes that traders are bullish on Ethereum rival Avalanche (AVAX) due to the buzz around the recently launched Friend.tech challenger Stars Arena, a decentralized social finance application (SocialFi) on the AVAX blockchain. The analytics firm notes the Stars Arena launch led to an “injection” of new AVAX address activity.\n\nAVAX is trading at $10.66 at time of writing. The 21st-ranked crypto asset by market cap is up nearly 5% in the past 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vbWVkaXVtLmNvbS9jb2lubW9ua3MvZXRoZXJldW0tdGhlLXBsYXRmb3JtLW9mLXBvc3NpYmlsaXRpZXMtNGM5NTU0OWU0MTRm0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 07 Oct 2023 07:00:00 GMT",
        "title": "Ethereum: The Platform of Possibilities | by Staney Joseph 🎖️ | Coinmonks - Medium",
        "content": "Ethereum is not just a cryptocurrency, but a platform for decentralized applications. Ethereum allows developers to create smart contracts, which are self-executing agreements that run on the blockchain. Smart contracts can enable a variety of use cases, such as decentralized finance, gaming, identity management, and more. But what makes Ethereum so powerful and unique? And what are the risks and challenges that it faces? In this article, we will explore the potential and the pitfalls of Ethereum, and why it is more than just a digital currency.\n\nWhat is Ethereum?\n\nEthereum is a decentralized, open-source blockchain that supports smart contract functionality. It was launched in 2015 by Vitalik Buterin, a young programmer who envisioned a platform that could go beyond the limitations of Bitcoin. Unlike Bitcoin, which is mainly designed for peer-to-peer payments, Ethereum allows developers to build and deploy any kind of application that can run on the blockchain. These applications are called decentralized applications, or DApps.\n\nDApps are powered by smart contracts, which are pieces of code that define the rules and logic of the application. Smart contracts are stored and executed on the Ethereum network, which consists of thousands of nodes (computers) that validate transactions and maintain consensus. By using smart contracts, DApps can operate without intermediaries, censorship, or downtime. This makes them more transparent, efficient, and secure than traditional applications.\n\nSome examples of DApps that run on Ethereum are:"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL2Jsb2NrY2hhaW4ubmV3cy9uZXdzL2V0aGVyZXVtLWZvdW5kZXItdml0YWxpay1idXRlcmluLXByb3Bvc2VzLXR3ZWFrcy10by1pbXByb3ZlLWRlY2VudHJhbGl6YXRpb24tYW5kLXJlZHVjZS1jb25zZW5zdXMtb3ZlcmhlYWTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Founder Vitalik Buterin Proposes Tweaks to Improve Decentralization and Reduce Consensus Overhead - Blockchain.News",
        "content": "Vitalik Buterin, the founder of Ethereum, has proposed changes to the network's staking model aimed at improving decentralization and reducing the consensus layer's computational burden. The proposal includes the introduction of a two-tiered staking system involving node operators and delegators. Buterin suggests that these changes could significantly reduce the number of signatures required for consensus, thereby making it easier for more people to participate in the network's validation process.\n\nVitalik Buterin , the founder of Ethereum, has recently proposed a series of changes aimed at improving the network's staking model. The primary objectives are to enhance decentralization and reduce the computational burden on the consensus layer. The proposal comes as Ethereum faces challenges related to centralization risks and the sheer number of signatures required for consensus. Buterin's proposal could potentially revolutionize the way staking and consensus are approached on the Ethereum network, making it more accessible and efficient.\n\nIn the current Ethereum staking model, there are two types of participants: node operators and delegators. Node operators are responsible for running nodes and providing collateral, usually in the form of ETH. Delegators, on the other hand, contribute some amount of ETH but are not required to participate in any other way. This two-tiered staking model has been popularized by staking pools like Rocket Pool and Lido, which offer liquid staking tokens (LSTs). However, Buterin identifies two main issues with this system. First, there is a centralization risk in the mechanisms for choosing node operators, which are either not very decentralized or have other flaws. Second, the Ethereum Layer 1 verifies approximately 800,000 signatures per epoch, a number that could increase, thereby adding a significant computational load to the network.\n\nTo address these issues, Buterin suggests that delegators should have a more meaningful role in the network. He outlines two classes of solutions: delegate selection and consensus participation. In the delegate selection model, delegates could choose which node operators they want to support, thereby having a \"weight\" in the consensus. This would give them more power and make the network more decentralized. In the consensus participation model, delegators could be given a lighter role in the consensus process, which would act as a check on node operators. This would allow more people to participate in the network's validation process without taking on the full responsibilities and risks of being a node operator.\n\nButerin also provides concrete implementation ideas for these solutions. One such idea is to allow each validator to specify two staking keys: a persistent staking key (P) and a quick staking key (Q). These keys could be used in various ways to improve the consensus mechanism and reduce the number of required signatures. For example, the protocol could require both the node and a randomly selected delegator to sign off for a message from a node to count.\n\nIn conclusion, Buterin's proposal aims to achieve two main objectives. First, it seeks to empower those who do not have the resources or capability to solo-stake to participate meaningfully in the network. Second, it aims to reduce the number of signatures required for consensus to around 10,000, thus aiding decentralization and making it easier for more people to run a validating node. These changes could be implemented at different layers, including within staking pool protocols or as part of the Ethereum protocol itself, offering a flexible approach to improving the network's staking model.\n\nImage source: Shutterstock"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZGVjcnlwdC5jby8yMDA1MzIvdGhpcy13ZWVrLWluLWNvaW5zLWJpdGNvaW4tZXRoZXJldW0tYXZhbGFuY2hlLXNvbGFuYdIBVGh0dHBzOi8vZGVjcnlwdC5jby8yMDA1MzIvdGhpcy13ZWVrLWluLWNvaW5zLWJpdGNvaW4tZXRoZXJldW0tYXZhbGFuY2hlLXNvbGFuYT9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 07 Oct 2023 07:00:00 GMT",
        "title": "This Week in Coins: Bitcoin and Ethereum Hold Stable Amid Frantic News Cycle - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIt was a week full of headlines in crypto, but they weren't being made by market stalwarts Bitcoin and Ethereum. Their stable values suggest cryptocurrencies are less reactive to the current news cycle than they were during its heady 2021 bull run and subsequent 2022 crash.\n\nMarket leader Bitcoin (BTC) grew a modest 2.7% over the seven days and now changes hands at $27,952. It briefly hit a two-month high on Sunday night when it crossed the $28,000 threshold.\n\nAD\n\nAD\n\nThe closest contender Ethereum (ETH) had a comparably harder week and lost 2.1% to trade at $1,636 at the time of writing. Its weak performance comes despite several positive announcements, including a UBS asset tokenization trial supported by the Monetary Authority of Singapore (MAS) and the launch of nine Ethereum Futures ETFs in the U.S. on Monday.\n\nGrayscale announced on Monday that it hopes to convert its Ethereum trust into a spot ETF. The crypto asset manager’s application stems from its courtroom victory back in August when it won an appeal against the Securities and Exchange Commission after the latter rejected its application to convert its Bitcoin trust into a spot ETF.\n\nThe SEC also lost an appeal in its lawsuit against XRP progenitor Ripple this week. The SEC had hoped in vain that Judge Torres would reconsider her ruling that selling XRP to retail consumers doesn’t constitute a breach of American securities laws.\n\nRipple also secured a Major Payments Institution license from the MAS this week. However, the good news gains were reversed by the weekend. XRP fell 1.6% over the last seven days to hit $0.5224 by the weekend.\n\nOnly two cryptocurrencies posted any notable price movements, rallying around 15% this week: Avalanche (AVAX), which currently trades for $10.39, and Solana (SOL), which is currently worth $23.31.\n\nOn Monday, the Solana network's total value locked (TVL) hit a new 2023 high of $338.82 million.\n\nAD\n\nAD\n\nIn the news…\n\nThe week began with Coinbase secured a Major Payment Institution (MPI) license from MAS. This development follows the In-Principle Approval (IPA) Coinbase received last year, part of a drive by the exchange to expand globally due to the uncertain regulatory climate on the company’s U.S. home turf.\n\nOn Tuesday, Helen Boyd, Head of Capital Markets at the independent regulatory watchdog the Financial Conduct Authority (FCA), announced that the British Treasury hopes to launch a Digital Securities Sandbox (DSS) by the end of the first quarter of next year.\n\nA sandbox is a controlled test environment for those looking to bring innovative products to the market. The FCA already has a similar engagement via its Regulatory Sandbox where companies with viable products can begin pitching them to a closed circle of early customers, but the DSS has “a new rule set that would allow it to do new things with digital securities.”\n\nOn Thursday, Hong Kong’s police force and Securities and Futures Commission (SFC) launched a joint task force to monitor illegal activities on crypto exchanges following the suspension of trading on the JPEX exchange. The JPEX incident is one of the largest cases of financial fraud in Hong Kong history. involving at least 2,305 victims of the incident, who collectively have been defrauded of HK$1.43 billion ($182.9 million).\n\nA report published this week by blockchain data platform Chainalysis shows that recent inflows to Hong Kong have rivaled that of mainland China over the past year, despite hosting only 0.5% of the latter’s population.\n\nFinally this week, both Starbucks and the Museum of Modern Art launched NFTs."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbi1ldGhlcmV1bS1kb2dlY29pbi1kZWNsaW5lLWFtaWQtaXNyYWVsLWhhbWFzLWNvbmZsaWN0JTNBLWFuYWx5c3QtcHJlZGljdHMta2luZy1jcnlwdG_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, Dogecoin Decline Amid Israel-Hamas Conflict: Analyst Predicts King Crypto To Reach $30K As ... - Nasdaq",
        "content": "Major cryptocurrencies experienced a decline on Sunday evening, amid the attack on Israel by Hamas. This event has introduced geopolitical risk into an already delicate market grappling with inflation and surging interest rates.\n\nCryptocurrency Gains +/- Price (Recorded 9:30 p.m. EDT) Bitcoin (CRYPTO: BTC) -0.49% $27,868 Ethereum (CRYPTO: ETH) -0.73% $1,626 Dogecoin (CRYPTO: DOGE) -0.99% $0.060\n\nWhat Happened: Bitcoin, the largest cryptocurrency by market capitalization also declined due to the announcement of the U.S. economy adding 336,000 jobs in September, surpassing economist expectations by nearly double.\n\nThe Israeli-Palestinian conflict has reached a critical point, escalating into a full-blown war following an unexpected invasion by Hamas. Israeli Prime Minister Benjamin Netanyahu has vowed that the group, which rules the Gaza strip, will face unprecedented consequences. Meanwhile, global crude reserves are facing pressure due to production reductions by Saudi Arabia and Russia.\n\nPierre Andurand, founder of Andurand Capital Management LLP, believes that in the short term, the conflict is unlikely to impact oil supply. However, experts warn that it could eventually lead to supply disruptions and price fluctuations.\n\nMeet and engage with transformative Digital Asset and Crypto business leaders and investors at Benzinga’s exclusive event – Future of Digital Assets. Tickets are flying- get yours!\n\nTop Gainer (24 Hour)\n\nCryptocurrency Gains +/- Price (Recorded 9:30 p.m. EDT) Trust wallet token +9.40% $1 dYdX +3.30% $2 Frax Share +3.00% $5.52\n\nThe global crypto market cap currently stands at $1.09 trillion, reflecting a decrease of 0.10% in the past 24 hours.\n\nStock futures experienced a decline on Sunday due to the attack on Israel. This unfortunate event has introduced additional geopolitical risk to an already delicate market, which is currently grappling with inflation and surging interest rates.\n\nFutures linked to the Dow Jones Industrial Average dropped by 207 points, equivalent to a 0.6% decrease. Similarly, S&P 500 futures experienced a decline of 0.7%, while Nasdaq 100 futures slipped by 0.6%.\n\nSee More: Best Cryptocurrency Scanners\n\nAnalyst Notes\n\nCrypto analyst Michael Van de Poppe anticipates a week filled with volatility in the market. According to him, it is likely that Bitcoin will continue its upward grind, potentially surging to $30K \"as worldwide uncertainty grows.\"\n\nI've had an amazing business trip to Dubai. Can't wait to share news! Now; market perspective it's going to be a volatile week. My idea is that #Bitcoin continues the upwards grind & potentially reaches $30K as worldwide uncertainty grows. Stop the war.\n\n— Michaël van de Poppe (@CryptoMichNL) October 7, 2023\n\nPseudonymous analyst CediBull remains firm in their idea shared below, with a target of at least $27,100 and a high probability of testing the mid-range at $26,700. Taking a step back for a broader perspective, there is a significant amount of liquidity accumulated below us, accompanied by rejection wicks to the upside.\n\nAdditionally, Open Interest (OI) has reached its peak, which historically has signaled a local top in the past five out of five instances. The overall direction seems clear in my opinion, but the key question is how far the price will drop. It is important to remember that the long-term outlook is still bullish, and breaching $24,800 is not anticipated. I believe we may test the mid-range, and if it holds, we could experience an early bottom. However, there is also the possibility of a swift dip below $26,000 (but remaining above $24,800), which could present an excellent opportunity for a low-risk, high-reward entry once again.\n\nNo change to my idea shared below. Targeting 27.1k at minimum with a test of the mid-range at 26.7k seeming highly likely as well.Zooming out for some additional context- you can see that we have tons of liquidity built up below us after taking liq above with plenty of… https://t.co/62pvVl0PFu pic.twitter.com/2ldlhWT4Di\n\n— CrediBULL Crypto (@CredibleCrypto) October 9, 2023\n\nBenjamin Cowen predicts a prolonged decline in ETH / BTC .\"Collapse continues. It has been a pretty slow process so far (certainly slower than I was expecting), but the trend has in fact been down for a long time.\"\n\n#ETH / #BTC collapse continues. It has been a pretty slow process so far (certainly slower than I was expecting), but the trend has in fact been down for a long time. pic.twitter.com/JbbuXKdOTh\n\n— Benjamin Cowen (@intocryptoverse) October 6, 2023\n\nOn-chain analytics firm Santiment reported that the movement of over 10K $BTC off exchanges is the highest since September 7, indicating a significant shift in the Bitcoin market. Additionally, Bitcoin, the leading cryptocurrency, is making a second attempt to surpass the $28K market value. The importance of utility cannot be overlooked, especially considering that unique addresses have reached their lowest point in six weeks.\n\n📊 #Bitcoin had its most coins (over 10K $BTC) moving off exchanges since September 7th, and #crypto's top market cap asset is making a 2nd run at crossing a $28K market value. Utility will be important here, as unique addresses have fallen to 6-week lows. https://t.co/JoJv9YYJsA pic.twitter.com/3JELGuzJRG\n\n— Santiment (@santimentfeed) October 8, 2023\n\nPhoto by CMP_NZ on ShutterstockJoin Benzinga’s Fintech Deal Day & Awards on Nov. 13 and Future of Digital Assets on Nov. 14 in New York City to stay updated on trends like AI, regulations, SEC actions and institutional adoption in the crypto space. Secure early bird discounted tickets now!\n\nRead Next: Jim Cramer Advises Against Using Binance, Provokes Strong Reactions From Twitter Users\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nGet insight into trading platforms. Compare the best online stock brokerages.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL2hvdy1yaXBwbGUtY2FzZS1kZXZlbG9wbWVudHMtY291bGQtaW1wYWN0LWV0aGVyZXVtcy1mYXRlL9IBWGh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL2hvdy1yaXBwbGUtY2FzZS1kZXZlbG9wbWVudHMtY291bGQtaW1wYWN0LWV0aGVyZXVtcy1mYXRlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 07 Oct 2023 07:00:00 GMT",
        "title": "How Ripple Case Developments Could Impact Ethereum’s Fate - Coinpedia Fintech News",
        "content": "Qadir Ak is the founder of Coinpedia. He has over a decade of experience writing about technology and has been covering the blockchain and cryptocurrency space since 2010. He has also interviewed a few prominent experts within the cryptocurrency space.\n\nAshley Prosper, an XRP community member, highlighted factors from the SEC vs. Ripple lawsuit that might affect Ethereum.\n\nThe Ripple lawsuit emphasized the nature of XRP’s blind sales and lack of buyer knowledge.\n\nRipple’s programmatic sales were less than 1% of global XRP trading.\n\nDiscussions around Ethereum’s early sales are growing, with concerns about concealed major investments.\n\nEthereum’s early sales are making waves in the cryptocurrency community, drawing insights from recent SEC vs. Ripple lawsuit developments. Ashley Prosper, a prominent member of the XRP community, has shed light on five elements derived from the Ripple lawsuit, suggesting potential repercussions for Ethereum should the SEC decide to delve deeper into its past ICO dealings.\n\nEthereum’s Spotlight: Ripple’s Court Insights\n\nThe court’s findings in the Ripple lawsuit emphasized several critical factors regarding Ripple’s programmatic sales of XRP:\n\nThe nature of these sales was likened to blind bid/ask transactions, with buyers unaware if their funds were directed to the blockchain firm.\n\nSuch sales accounted for a mere sliver, less than 1%, of the global XRP trading activity.\n\nRipple, during these transactions, did not make any commitments or offers, primarily because the company lacked knowledge of the identities of those buying XRP on exchanges.\n\nA significant number of these buyers remained oblivious to Ripple’s very existence.\n\nThese XRP sales didn’t follow any contracts with clauses like lockup provisions or explicit statements of purpose.\n\nEthereum’s Sales: A Subject of Contention\n\nAdding fuel to the Ethereum sales discourse was former Ethereum adviser Steven Nerayoff. He presented the inherent difficulty in pinpointing the exact number of Ethereum ICO buyers. His insights stirred debates and led to suspicions that some major players, or “whales”, could be concealing their Ethereum positions.\n\nThe juxtaposition of the Ripple lawsuit’s findings with Ethereum’s historical sales opens a Pandora’s box of questions and potential regulatory scrutiny. Should the SEC choose to probe Ethereum’s past based on these Ripple precedents, Ethereum might find itself in a regulatory maze, raising concerns for its investors and stakeholders in the crypto industry."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3RoZWNyeXB0b2Jhc2ljLmNvbS8yMDIzLzEwLzA3L2hlcmUtaXMtaG93LW11Y2gtYmluYW5jZS1ob2xkcy1vZi11c2Vycy14cnAtYml0Y29pbi1ldGhlcmV1bS1zaGliYS1pbnUtbGl0ZWNvaW4tYW5kLW1hdGljL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 07 Oct 2023 07:00:00 GMT",
        "title": "Here Is How Much Binance Holds of Users' XRP, Bitcoin, Ethereum, Shiba Inu, Litecoin, and MATIC - The Crypto Basic",
        "content": "Binance, the leading crypto exchange platform, recently released its eleventh proof-of-reserve (POR) report detailing its holdings of users’ cryptocurrencies.\n\nThe exchange holds 385 digital assets, including XRP, Bitcoin (BTC), Ethereum (ETH), Shiba Inu, and other notable cryptocurrencies.\n\nBinance XRP Holdings\n\nAs per the official report, Binance claims to safeguard its customers’ XRP tokens at a one-to-one ratio. Specifically, the ratio of XRP in users’ net balances compared to Binance’s net holdings stands at 104.15%.\n\n- Advertisement -\n\nIn other words, XRP investors have entrusted 2,629,459,187 XRP tokens to Binance, while the exchange holds 2,738,661,519 XRP. Based on XRP’s market price, the figures translate to Binance holding over $1.43 billion XRP in relation to users’ deposits of $1.37 billion XRP.\n\nNotably, Binance’s XRP in this eleventh report indicated a slight increase compared to the tenth series report. In September, The Crypto Basic disclosed that Binance XRP was at 103.82%. Compared to the current 104.15%, it implies that XRP on the exchange grew by at least 52 million.\n\nAlso, Binance’s August report indicated it held 2.8 billion XRP, valued at approximately $1.75 billion, since XRP traded above $0.6 during the period. Interestingly, Binance has maintained a consistent XRP holding of over 2.5 billion XRP since it began publishing the POR reports.\n\nBitcoin Portfolio\n\nLike XRP, Binance POR suggested it holds the largest market cap, crypto Bitcoin, in a 104.67% ratio to customers’ deposits. In particular, the exchange keeps 616,394 BTC worth over $17 billion against users’ deposits of 588,879 BTC.\n\n- Advertisement -\n\nWhile users’ assets increased by 708 BTC since September, Binance’s overall Bitcoin holding dropped by 1,732 BTC or $48,068,299\n\nEthereum Portfolio\n\nOn the other hand, Binance’s ratio of Ethereum portfolio to customer deposits increased by over 2% in the past 30 days. The exchange holds over 4.109 million ETH worth $6.73 billion. In contrast, customers have deposited 3.83 Ether tokens worth $6.27 billion.\n\nNotably, the exchange’s Ethereum holding improved by 17,186 ETH since the last report.\n\nShiba Inu Portfolio\n\nMeanwhile, Binance’s eleventh POR report shows a reduction in its trillion units holding of the dog-themed sensational crypto Shiba Inu. According to the report, Binance’s Shiba Inu holding stands at 76,895,594,975,813 (76.8 trillion) against 74,623,682,522,683 (74.6 trillion) from customers.\n\nHowever, The Crypto Basic reported that Binance held 75,476,904,308,962 SHIB for users in September. The reduction signifies Shiba Inu enthusiasts have withdrawn 853,221,786,279 (853 billion) SHIB off the exchange in the past 30 days.\n\nLitecoin and MATIC Portfolios\n\nOn the other hand, Binance’s portfolio of Polygon (MATIC) tokens to customers’ net balances dipped more than 2.5% from 119.86% to 117.16%. Meanwhile, the eleventh POR indicated the exchange’s Litecoin (LTC) portfolio improved by 1% since the last report.\n\nIt is worth mentioning that no external auditor has independently verified Binance’s proof-of-reserve. Emphatically, the exchange clearly stated that the POR reports result from “self-verification.”"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vYW1iY3J5cHRvLmNvbS93aHktZXRoZXJldW0tZGV2ZWxvcGVycy1tYXktbm90LXByb2xvbmctdGhlLWZyZXNoLWRldm5ldC1sYXVuY2gv0gFaaHR0cHM6Ly9hbWJjcnlwdG8uY29tL3doeS1ldGhlcmV1bS1kZXZlbG9wZXJzLW1heS1ub3QtcHJvbG9uZy10aGUtZnJlc2gtZGV2bmV0LWxhdW5jaC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Oct 2023 07:00:00 GMT",
        "title": "Why Ethereum developers may not prolong the fresh Devnet launch - AMBCrypto News",
        "content": "The network participation rate on Ethereum increased to 90% as Devnet-9 closes in on completion.\n\nThe Dencun testnet could launch before November ends.\n\nEthereum [ETH] developers had their usual All Core Developers Consensus (ACD) call on 5 October. From the meeting, they decided the timing for the Devnet-10 launch could happen earlier than initially projected.\n\nHow much are 1,10,100 ETHs worth today?\n\nOnce the block generator clears the way\n\nAlthough the ACDC call #119 focused on the Dencun upgrade, the developers considered discussing the health and status of the latest developer Testnet Devnet-9 as a priority, alongside Devnet-10.\n\nFor the unfamiliar, Devnet-9 launched on 29 September, as a way to improve the network participation rate on the blockchain. The network participation rate is defined as the percentage of validators actively carrying out their duties on the network.\n\nDuring the meeting, the developers noted that the network participation rate was impressively high at 90%.\n\nHowever, Barnabas Busa, a DevOps Engineer for the Ethereum Foundation, mentioned that there were a few bugs with Devnet-9, especially in the execution layer. For context, the execution layer is the part of the network responsible for validating the state in the block header.\n\nMeanwhile, the Ethereum Foundation seemed to be working on fixing the bug as Geth developer Marius van der Wijden said that he was working on updating the block generator for the execution layer.\n\nNext, on the agenda was the Devnet-10, which is primarily to check the next maximum epoch churn limit in EIP-7514. EIP-7514 is designed to slow down the growth of the active validator set by tracking the soaring levels of staked ETH.\n\nDencun Testnet is set before November\n\nAt the time of writing, Santiment showed that the number of validator deposits was 1026. This was a notable decrease from the highs registered some weeks back. Therefore, the decline means that the objectives for Devnet-10 may already be set in motion.\n\nAs expected, Ethereum’s development activity has started to rise again. The Development Activity means the code committed by developers toward upgrades on a network. Over the past month, the metric tumbled. So, the slight rise implies that developers were starting to get back to polishing the network.\n\nRealistic or not, here’s ETH’s market cap in BTC terms\n\nAs per Devnet-10, Parithosh Jayanthi, another DevOps Engineer at the Foundation mentioned that it could launch as early as next week. The Berlin-based developer, however, mentioned that the timeframe could be subject to the quickness of solving outstanding bugs and issues. Busa also weighed in on the matter saying,\n\n“I would like to see all clients being able to participate and no more bugs on Devnet-9 before we proceed with the larger test. We should have a very stable, like 100% participation, before we move on.”\n\nRegarding the Dencun final upgrade the cal chairman Tim Beiko restated that the public Testnet would happen before Ethereum’s Instabul conference in mid-November called Devconnect."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtbWlnaHQtcmVjZWl2ZS1taW5pLWRhcHBzLXdpdGgtdGhpcy1lcmMtZGV0YWlsc9IBT2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtbWlnaHQtcmVjZWl2ZS1taW5pLWRhcHBzLXdpdGgtdGhpcy1lcmMtZGV0YWlscz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 07 Oct 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Might Receive Mini DApps With This ERC: Details - U.Today",
        "content": "Advertisement\n\nUnveiled in May 2022, the novel Ethereum (ETH) proposal is set to enable the creation of a completely new type of tokens with previously unseen functionalities. Familiar assets on Ethereum (ETH) and other EVM blockchains will be upgraded to small decentralized applications.\n\nBringing executable scripts to Ethereum (ETH) tokens: What is ERC-5169?\n\nThe ERC-5169 proposal is set to introduce a new function called scriptURI() to help locate executable scripts linked to tokens. As such, cryptocurrency tokens will be able to have advanced functionality thanks to third-party scripts from their issuers. Web3 researcher and educationist Stacy Muur shared a breakdown of the novel concept on her X.\n\nUnderstanding #ERC5169: A Simple Breakdown for Non-Techies\n\n\n\nTL;DR: @ERC5169 is a proposal for a new kind of contract interface on Ethereum.\n\n\n\nThis interface adds a new function called scriptURI() to help locate executable scripts linked to tokens.\n\n\n\nWhy should we care?\n\n\n\nImagine… pic.twitter.com/zLoAiUtEpJ — Stacy Muur (@stacy_muur) October 6, 2023\n\nThe new proposal is based on Uniform Resource Identifier or URI. When creating cryptocurrency tokens, their issuers will be able to link specific code logic to them. Once the token is created and pegged to a script, token holders will be able to access and use the linked script by calling the scriptURI function.\n\nDuring this process, scripts can be located in various storages, both centralized and decentralized to ensure maximum flexibility and composability in DeFi:\n\nIt could be on decentralized platforms like IPFS, on GitHub, or even regular cloud storage. The point is to give flexibility while ensuring authenticity\n\nOnce this standard is approved and implemented, it will pave the way for many use cases. First, users will be able to run mini applications using nothing but a single token and an associated script.\n\nAlso, developers can use this concept to create browser add-ons or automated security instructions, the researcher added.\n\nNew token experiences for Ethereum (ETH) ecosystem\n\nThe experience of using token-script designs with URI can be compared to the usage of \"smart keys\" while opening doors:\n\nThink of an office door that only opens for employees with a special token. Once an employee gets the token, they instantly know how to open the door because the instructions (script) are linked right in the token\n\nHowever, a number of security challenges come with the introduction of ERC-5169 tokens. All involved parties should be sure that only the issuer can control the script pegged to this or that token.\n\nIt should be accomplished via using \"permanent\" storage for scripts or by protecting it via some multi-signature mechanisms, the researcher concluded."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLW5ld3Mtdml0YWxpay1idXRlcmluLXNlbmRzLTEtNjQtbWlsbGlvbi1pbi1ldGgv0gFRaHR0cHM6Ly9jb2luZ2FwZS5jb20vZXRoZXJldW0tbmV3cy12aXRhbGlrLWJ1dGVyaW4tc2VuZHMtMS02NC1taWxsaW9uLWluLWV0aC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Oct 2023 07:00:00 GMT",
        "title": "Ethereum News: Vitalik Buterin Moves $1.64 Million In ETH To Bitstamp - CoinGape",
        "content": "Today Lookonchain, an on-chain analytics firm, reported that an address associated with Ethereum co-founder Vitalik Buterin transferred 1,000 ETH tokens, valued at approximately $1.64 million, noting that the coins are likely headed to Bitstamp, a popular cryptocurrency exchange.\n\nFrequent Activity in Ethereum Co-founder’s Wallet\n\nThis isn’t the first time that Buterin’s wallet has been active. Over the past two months, this specific address has deposited a substantial 4,400 ETH into Bitstamp, totaling approximately $7.23 million.\n\nadvertisement\n\nAs per Lookonchain , this address received a significant influx of 70,000 ETH from a wallet labeled “Vb3” and is widely believed to be connected to Vitalik Buterin himself.\n\nJust a couple of weeks ago, the firm reported another notable transaction involving Buterin’s wallet. He moved around $1 million worth of Ethereum to Coinbase, mirroring a similar move made in August when he sent 600 ETH to the same destination, presumably for selling purposes.\n\nEthereum Remains Stable\n\nInterestingly, these transactions have not exerted any notable influence on Ethereum’s market price, as the price has remained relatively stable. This stability can be partially attributed to a broader trend. Recent data from Santiment indicated a substantial withdrawal of 110,000 ETH from centralized exchanges (CEXes) on Wednesday marking the most significant Ethereum outflow from CEXes since August 21.\n\nAs a result, Santiment reported that the total Ethereum supply on exchanges has plummeted to its lowest point in over 5.5 years, whereas the non-exchange ETH supply has surged to a historic high of 115.88 million ETH.\n\nThat said, Ethereum demonstrated remarkable resilience after a challenging week. Over the past 24 hours, it has swiftly rebounded by roughly 1.24% and was trading at $1,641 at press time."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMC8wOC90cm9uLWZvdW5kZXItanVzdGluLXN1bi1hYnJ1cHRseS1tb3Zlcy0xMzIwMDAwMDAtd29ydGgtb2YtZXRoZXJldW0tZXRoLWhlcmVzLXdoZXJlLXRoZS1jcnlwdG8taXMtZ29pbmcv0gGMAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzEwLzA4L3Ryb24tZm91bmRlci1qdXN0aW4tc3VuLWFicnVwdGx5LW1vdmVzLTEzMjAwMDAwMC13b3J0aC1vZi1ldGhlcmV1bS1ldGgtaGVyZXMtd2hlcmUtdGhlLWNyeXB0by1pcy1nb2luZy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Oct 2023 07:00:00 GMT",
        "title": "Tron Founder Justin Sun Abruptly Moves $132,000,000 Worth of Ethereum (ETH) – Here’s Where the Crypto Is Going - The Daily Hodl",
        "content": "On-chain data shows that Tron (TRX) founder Justin Sun is suddenly relocating hundreds of millions of dollars worth of Ethereum (ETH).\n\nCrypto tracker Lookonchain initially spotted Sun’s series of ETH transactions to the tune of $132 million.\n\nAccording to Lookonchain, Sun is withdrawing the massive Ethereum trove to the tune of 80,251 ETH from the liquid staking service provider Lido (LDO).\n\n“So far, he has successfully withdrawn 43,000 ETH ($70 million) and deposited it to Binance.”\n\nSince Sun sent his ETH stack to a crypto exchange, it could potentially be sold on the open market.\n\nLookonchain is also watching the movement of a crypto address associated with Ethereum co-creator Vitalik Buterin. The on-chain data tracker says that the address could be depositing 1,000 ETH worth $1.64 million to crypto exchange Bitstamp.\n\n“This address has deposited a total of 4,400 ETH ($7.23 million) to Bitstamp in the past two months.\n\nThis address received 70,000 ETH ($115 million) from Vb3 and is believed to be related to vitalik.eth (may be the address of vitalik.eth).“\n\nAt time of writing, Ethereum is trading for $1,628.83, down less than 1% in the last 24 hours. The second-largest crypto asset remains 66.51% down from its all-time high of $4,878 which it hit in November 2021.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney\n\nShutterstock/Tomasz Makowski"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZGVjcnlwdC5jby8yMDA1MjAvZXRoZXJldW0taW5mbGF0aW9uLWV0aC1zdXBwbHktaGFzLWdyb3duLWJ5LTQ3LW1pbGxpb24taW4tMzAtZGF5c9IBYGh0dHBzOi8vZGVjcnlwdC5jby8yMDA1MjAvZXRoZXJldW0taW5mbGF0aW9uLWV0aC1zdXBwbHktaGFzLWdyb3duLWJ5LTQ3LW1pbGxpb24taW4tMzAtZGF5cz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Inflation? ETH Supply Has Grown by $47 Million in 30 Days - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum fans widely hyped last year’s merge as a decisive event that would permanently establish ETH as “ultrasound money.” Ethereum’s historic transition from proof of work to proof of stake last September reduced ETH issuance by 90%; many so-called Ethereum maximalists were convinced the change would clinch ETH’s status as a deflationary currency that would only, thereafter, appreciate in value.\n\nA year later, things aren’t looking so certain.\n\nIn the last 30 days alone, global ETH supply has surged by nearly 30,000 ETH, equivalent to roughly $47.9 million at writing, according to data aggregator ultrasound.money. That sharp uptick in the amount of ETH in circulation is mostly thanks to an equally stark decline in transaction flow on the Ethereum network: far fewer NFT trades, and much less DeFi activity.\n\nAD\n\nAD\n\nSince 2021, the Ethereum network has operated on a fee-burning mechanism: the more traffic on the network, the more gas prices—which are required to complete on-chain transactions—rise. The higher gas prices are, the more ETH is “burned” by the network, or permanently removed from circulation.\n\nAs of late, Ethereum gas fees have dropped remarkably low—an average network transaction currently costs 7 gwei, or just $0.24. An average transaction on NFT marketplace OpenSea costs about $0.94. Contrast that with just over a year ago: during the sale of Yuga Labs’ Otherside collection last May, for example, network users burned over $157 million worth of Ethereum to mint just 55,000 virtual land deed NFTs: an average of $2,854 in fees alone per transaction.\n\nWhile low gas fees might be good for the average Ethereum user, they also lead to the burning of less ETH—and thus, surges in global ETH supply.\n\nIs Ethereum becoming inflationary again? Yes, it is, and that's because Ethereum fees, which are supposed to burn ethers, are everywhere but not on Ethereum: its own L2s (Arbitrum, Polygon, etc.) and EVM competitors (BNB, Avalanche C, etc.) Limiting L1 dooms cryptocurrencies. pic.twitter.com/cE82gwUbZR — Nikita Zhavoronkov (@nikzh) September 23, 2023\n\nEthereum’s recent inflationary trend has caused some concern among crypto users and investors who fear current trends may spell trouble for the network’s long-term financial health.\n\nAD\n\nAD\n\nThe critical problem with Ethereum is that its future supply is unknown, unpredictable, and potentially inflationary. For Ethereum to be deflationary, tx fees must be high which means it must fail to scale and tx volume must not move to other crypto securities like Solana. pic.twitter.com/dITZ7RfSf6 — Joe Burnett (🔑)³ (@IIICapital) October 2, 2023\n\nBut the team behind Ethereum appears largely unconcerned about the development.\n\n“I suspect that none of the core devs care,” Micah Zoltu, an Ethereum core developer, told Decrypt of his colleagues’ attitudes on the subject. “If you look at the grand scheme of things, it is insignificant.”\n\nDanno Ferrin, another Ethereum core developer, said he had not been concerned by Ethereum’s recent inflationary kick.\n\n“It is still below the all-time high [ETH supply],” Ferrin told Decrypt. “And [Ethereum’s] short-term inflation is well below other chains and the economy as a whole.”\n\nInflation has been consistently on the rise globally since last year; in the United States, prices rose last June at the sharpest year-over-year rate recorded since 1981. In response to this economic climate, the U.S. Federal Reserve has repeatedly raised interest rates, a move that has persistently lowered the values of cryptocurrencies like Bitcoin and Ethereum."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1mYWlscy10by1yZWFjdC1hcy1leGNoYW5nZS1vdXRmbG93LWhpdHMtaGlnaGVzdC1zaW5jZS1hdWd1c3Qv0gFgaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2V0aGVyZXVtLWZhaWxzLXRvLXJlYWN0LWFzLWV4Y2hhbmdlLW91dGZsb3ctaGl0cy1oaWdoZXN0LXNpbmNlLWF1Z3VzdC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 07 Oct 2023 07:00:00 GMT",
        "title": "Ethereum fails to react as exchange outflow hits highest since August - AMBCrypto News",
        "content": "Ethereum’s daily exchange outflow reached its highest level since August on 4 October.\n\nETH’s accumulation has continued to dawdle.\n\nOn 4 October, over 110,000 Ethereum [ETH] coins, worth around $177.65 million, were withdrawn from known crypto exchange wallets, marking the highest daily exchange outflow since August.\n\n#Ethereum | Roughly 110,000 $ETH were withdrawn from known #crypto exchange wallets in the past 24 hours, worth around $177.65 million, according to onchain data from @santimentfeed. pic.twitter.com/3CGVgOQUbM — Ali (@ali_charts) October 5, 2023\n\nWhen an asset’s exchange outflow surges in this manner, it suggests that coin holders are moving their assets off exchanges and into cold storage or other non-custodial wallets, which could signify bullish sentiment.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nETH fails to react\n\nA surge in exchange outflows is typically followed by a rally in an asset’s price, which means a reduction in sell-offs. However, this has yet to manifest in ETH, as the price remains trapped within a narrow range.\n\nAt press time, the leading altcoin exchanged hands at $1,620. Following Bitcoin’s [BTC] brief surge above $28,000 during the intraday trading session on 5 October, ETH’s price touched $1648, after which it shed all its gains, data from CoinMarketCap showed.\n\nOn the daily chart, coin accumulation amongst spot traders has lost momentum. As of this writing, the coin’s Relative Strength Index (RSI) was positioned in a downtrend beneath its 50-neutral line.\n\nLikewise, the coin’s Chaikin Money Flow (CMF) was below the zero line at -0.11. A negative CMF value indicates that more money is flowing out of an asset than into it.\n\nA negative CMF value coupled with price consolidation or decline is taken as a bearish signal, suggesting that investors are selling the asset and reducing their exposure.\n\nAn assessment of the coin’s Directional Movement Index (DMI) revealed that ETH’s sellers regained market control after the coin’s price fell from its $1648 peak on 5 October. At press time, the negative directional indicator (red) at 20.63 was positioned above the positive directional indicator (green) at 20.23.\n\nThis crossover showed that the current price trend in the ETH market was a downtrend and that downward price movements outpaced upward price movements.\n\nRealistic or not, here’s ETH’s market cap in BTC terms\n\nFutures traders tread a different path\n\nDespite the recent price action and the significant bearish sentiments in the ETH market, futures traders have remained steadfast.\n\nThe month so far has seen an uptick in ETH’s Open Interest. According to data from Coinglass, the coin’s Open Interest has increased by 3% since 3 October.\n\nWhen ETH open interest increases, it means that the total number of ETH futures contracts that have not been settled has increased.\n\nIt is a bullish signal as it suggests that more investors are opening new positions in ETH. And that there is increasing demand for the asset.\n\nIt remains notable that the coin’s funding rates across exchanges have remained positive despite ETH’s headwinds since April."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMC8wOC9tYW55LW9mLWV0aGVyZXVtcy1yaXZhbHMtbWF5LW5vdC1yZWNvdmVyLWluLW5leHQtYnVsbC1tYXJrZXQtY3ljbGUtYWNjb3JkaW5nLXRvLWJsb29tYmVyZy1jcnlwdG8tYW5hbHlzdC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Oct 2023 07:00:00 GMT",
        "title": "Many of Ethereum’s Rivals May Not Recover in Next Bull Market Cycle, According to Bloomberg Crypto Analyst - The Daily Hodl",
        "content": "Alternative layer-1s attempting to dethrone Ethereum (ETH) might be running on borrowed time, according to Bloomberg crypto market analyst Jamie Coutts.\n\nCoutts says on the social media platform X that the rise of Ethereum layer-2s (L2s) is helping to take revenue away from ETH competitors.\n\n“The rise in L2s has meant that the Ethereum network has started to regain market share from the Alt-L1 (alternative layer-1) peers. In the past year, active address L2 growth outpaced Alt-L1s by 2x (albeit from a lower base)”\n\nCoutts says that alternative smart contract platforms are facing a number of headwinds that threaten their survival, including inflationary tokenomics, excessive block space and Ethereum’s rapidly growing network effects.\n\nEven though the total amount of fees generated by such blockchains is on a long-term uptrend, the analyst says that most of the chains could easily fade into obscurity over the next several years.\n\n“Despite the current bear market, Blockspace Demand is in a long-term structural uptrend. However, the crypto industry is plagued with serious issues that are entirely of its own making. It is possible that only a tiny subset will be relevant in a few years.”\n\nCoutts also says that many alternative layer-ones, due to a lack of activity, are most likely not generating enough fees to ensure the future security of their networks.\n\nSays the analyst,\n\n“Although a cratering treasury market may invalidate our thesis since 4Q22 that 2022 capitulation was the cycle low for ETH, our outlook for the asset remains positive.\n\nHowever, for many Alt-L1s (not all) due to inadequate demand and subpar tokenomics we maintain a negative outlook.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Salamahin/Angelatriks"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vZGVjcnlwdC5jby8yMDA2MDQvaHVvYmktcmVjbGFpbXMtOC1taWxsaW9uLWluLXN0b2xlbi1ldGgtYWZ0ZXItb2ZmZXJpbmctYm91bnR5LXRvLWhhY2tlctIBZmh0dHBzOi8vZGVjcnlwdC5jby8yMDA2MDQvaHVvYmktcmVjbGFpbXMtOC1taWxsaW9uLWluLXN0b2xlbi1ldGgtYWZ0ZXItb2ZmZXJpbmctYm91bnR5LXRvLWhhY2tlcj9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Oct 2023 07:00:00 GMT",
        "title": "Huobi Reclaims $8 Million In Stolen Ethereum After Offering Bounty to Hacker - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nHuobi Gloabl’s cryptocurrency exchange has recovered millions in stolen funds from a hacker who absconded with them in September after making contact with the attacker and negotiating a deal to see it returned.\n\nJustin Sun, a Huobi Global investor and HTX adviser, took to Twitter on Saturday to announce that $8 million in stolen Ether (ETH) was restored and that the hacker made “the right choice” to accept HTX’s offer.\n\n\"We have confirmed that the hacker has fully returned all funds, as promised, and we have also paid the hack a white hat bonus of 250 ETH,\" wrote Sun in a post. “Providing full security for user assets is always our goal to strive for!”\n\nAD\n\nAD\n\nHTX first disclosed the hack on September 25 after one of the exchange's hot wallets was compromised and drained of 5,000 ETH.\n\nAt the time, Sun assured customers that the amount was a \"relatively small sum\" versus what he said was HTX’s $3 billion in assets. Sun also said at the time that HTX would offer 5% of the stolen ETH as a \"white-hat reward\" to encourage the hacker to return the funds—but warned that the firm would contact law enforcement if the offer wasn't accepted within a week.\n\nCrypto firms have sometimes found themselves left negotiating with hackers to get stolen funds back rather than turning to law enforcement agencies for help. In more than one of these deals, the firm and the hacker were able to reach an agreement in which the bulk of the funds are restored, and a bounty is then paid to the hacker to close things out.\n\nHacks against cryptocurrency exchanges are a persistent risk, but the types of exchanges targeted have differed.\n\nIn the second quarter of 2023, there was a 63% increase in blockchain hacks compared to the same time last year, according to an Immunefi report from July. The company also found that most of the hacks happened on DeFi platforms, which lost $228 million across 79 incidents. By comparison, centralized exchanges—like HTX—only lost a reported $37 million across two incidents.\n\nAD\n\nAD"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vbGVhcm4uYnliaXQuY29tL2ludmVzdGluZy9ldGhlcmV1bS1mdXR1cmVzLWV0Zi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Futures ETFs: Are They Worth Investing In? - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1jby1mb3VuZGVyLXZpdGFsaWstYnV0ZXJpbi1tYWtlcy1hbm90aGVyLWV0aC1zYWxlLWRldGFpbHPSAVZodHRwczovL3UudG9kYXkvZXRoZXJldW0tY28tZm91bmRlci12aXRhbGlrLWJ1dGVyaW4tbWFrZXMtYW5vdGhlci1ldGgtc2FsZS1kZXRhaWxzP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 07 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Co-Founder Vitalik Buterin Makes Another ETH Sale: Details - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nLegendary programmer Vitalik Buterin, who co-founded the second biggest blockchain platform Ethereum, has made yet another transfer of ETH. According to a recent X post by the @lookonchain account, which tracks \"Smart Money\" wallets and other large addresses moving their crypto, the destination of this transaction is likely the Bitstamp exchange.\n\nButerin keeps moving ETH to Bitstamp and Coinbase\n\nButerin has been moving ETH to exchanges from his address quite often recently with speculations rising every time as to the purpose of these transfers. This time, he moved 1,000 ETH (worth approximately $1.64 million) to the exchange. Overall, per the same source, within the last two months, the co-founder and front man of Ethereum has sent 4,400 ETH (more than $7 million in fiat) to Bitstamp.\n\nvitalik.eth(@VitalikButerin) related address transferred 1K $ETH ($1.64M) out again, which may be deposited into #Bitstamp.\n\n\n\nThis address has deposited a total of 4.4K $ETH ($7.23M) to #Bitstamp in the past 2 months.https://t.co/LRrcqoxUhf pic.twitter.com/oO0rEAD6pd — Lookonchain (@lookonchain) October 7, 2023\n\nAs reported by U.Today, around two weeks ago, per the same blockchain sleuth Lookonchain, Buterin shifted approximately 400 ETH to the leading U.S. exchange Coinbase — back then it was worth around $1 million. A month before that, according to the aforementioned source, Buterin sent 600 ETH to the same destination with an intention to sell those coins.\n\nEach time he moved Ethereum to exchanges, that did not have any particular effect on the price of the asset.\n\nMassive 110,000 ETH withdrawn from exchanges\n\nAs reported by on-chain data aggregator Santiment two days ago, unknown whales transferred a whopping 110,000 ETH worth approximately $181 million in fiat from centralized exchanges.\n\nThat was the biggest withdrawal of Ethereum from CEXes since Sept. 21. The total supply of Ethereum held by exchanges now stands at the lowest level in more than 5.5 years, while the non-exchange ETH supply has reached an all-time high of 115.88 million ETH, per Santiment data.\n\nAfter the big red candle on Thursday that pushed ETH down 1.66%, by now the second largest crypto has managed to recover this loss, rising again to the $1,639 price mark. This is where it is changing hands at the time of this writing."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMTAvMDcvZXRoZXJldW0tb3JnLWRlY2xhcmVzLXE0LXByb2R1Y3Qtcm9hZG1hcC13aXRoLWtleS11cGRhdGVzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 07 Oct 2023 07:00:00 GMT",
        "title": "Ethereum.org Declares Q4 Product Roadmap with Key Updates - Crypto Times",
        "content": "Ethereum.org recently announced that it has released its roadmap for the fourth quarter, highlighting important updates and enhancements.\n\nHappy 1st Friday of Q4 for those who celebrate it 🪩🥂@ethdotorg Q4 2023 product roadmap is out!\n\n\n\nFrom planting seeds to platform exodus, @EFDevconnect to Dencun, wallets & pens… we've got a variety of projects you can contribute with 🧑‍💻\n\n\n\nTake a look👇https://t.co/sK7bevPkVy — ethereum.org (@ethdotorg) October 6, 2023\n\nKey milestones include the commencement of the second phase of the online writing program on October 20, a redesign of the menu navigation for improved user experience set to be implemented in early Q1 2024, and the inclusion of educational materials related to Seed phrases.\n\nAdditionally, the roadmap indicates an increased commitment from the core team to review GitHub issues and pull requests, the introduction of content related to the Dencun upgrade, guidance for node operators to update their settings, and clear communication with users regarding these changes and their implications. Plans for the 2024 roadmap and budget are also laid out.\n\nFurthermore, there are plans to transition the website from Gatsby to NextJS, with this migration expected to be finalized in the fourth quarter. The shift from Gatsby Cloud to Netlify is also part of the roadmap."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vY3J5cHRvdHZwbHVzLmNvbS8yMDIzLzEwL2Zsb3ctYmxvY2tjaGFpbi1lbWJyYWNlcy1ldGhlcmV1bS13aXRoLWV2bS1vbi1mbG93L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 07 Oct 2023 07:00:00 GMT",
        "title": "Flow blockchain embraces Ethereum with EVM on Flow - CryptoTvplus",
        "content": "The Flow community has unveiled a groundbreaking proposal known as ‘EVM on Flow,’ designed to achieve full Ethereum Virtual Machine (EVM) equivalence on the Flow blockchain.\n\nThis proposal aims to enable Ethereum developers to deploy their DApps on Flow without making substantial code changes, simplifying the process of migrating or creating DApps on this innovative platform.\n\nFlow blockchain is a fast, decentralized, and developer-friendly blockchain designed to be the on-chain home for mainstream IPs including NBA, NFL, Doodles, and Mattel, as well as an open ecosystem where anyone can build.\n\nThe layer-one blockchain, which was created by a team with experience working at CryptoKitties, Dapper Wallet, NBA Top Shot, has a native token, FLOW which is used to pay network fees for transactions and smart contract computations and can also be traded or invested.\n\nAccording to Flow, the introduction of EVM compatibility on Flow offers a game-changing advantage to Ethereum developers. It allows them to harness the benefits of the Flow blockchain without the need to learn a new programming language or undertake complex code modifications.\n\nAdditionally, the brain behind the proposal, who is also the co-founder of Dapper Labs and Lead Architect at Flow, Dieter Shirley, stated that the process of integration involves the creation of a “gateway” software that can wrap and submit Ethereum transactions to the Flow blockchain. The key highlight is that no fundamental code changes are necessary to achieve full Ethereum Virtual Machine equivalence on Flow.\n\nHe added that this ‘gateway’ software enables the Flow ecosystem to potentially support Ethereum-based decentralized applications (dApps). It allows developers to wrap external transactions using Cadence, a smart contract programming language for Flow.\n\nHe also revealed that the proposal, which opens the door for the transfer of ERC-20 and ERC-721 tokens between the two networks, presents challenges that need to be addressed. Notable issues include mapping EVM gas fees to Cadence and ensuring seamless interoperability. Additionally, there is a need to finalize details regarding the EVM environment on Flow and its integration with the existing Flow infrastructure.\n\nTo solve this problem, the co-founder said that community input is critical in addressing the technical intricacies and ensuring the successful realization of EVM equivalence on Flow."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3ByaWNlLXByZWRpY3Rpb25zLWZvci1ldGhlcmV1bS14cnAtYW5kLXNjb3JwaW9uLWNhc2luby10b2tlbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Oct 2023 07:00:00 GMT",
        "title": "Price Predictions For Ethereum, XRP, and Scorpion Casino Token - Analytics Insight",
        "content": "The crypto landscape is ever-evolving, and as more individuals and institutions dive into the world of digital assets, the quest for solid price predictions becomes even more critical. The future seems bright for many tokens, but today, we’re focusing on three specific ones: Ethereum (ETH), XRP, and Scorpion Casino Token ($SCORP). So, what does the future hold for these coins? Let’s delve into some expert speculations.\n\nEthereum: The King of Smart Contracts\n\nEthereum has undoubtedly paved the way for the adoption and development of decentralized applications (dApps) and smart contracts. Its blockchain technology has revolutionized various sectors, from DeFi platforms to NFT marketplaces. Now that Ethereum has completed its ETH 2.0 upgrade, the platform will benefit from enhanced scalability and has become more energy efficient.\n\nGiven its undeniably pivotal role in the blockchain space, experts suggest that Ethereum has the potential to see exponential growth in the next few years. With the expanding ecosystem and continuous innovation, a price prediction of around $20,000 for ETH doesn’t seem far-fetched, especially when considering its previous bull runs and the broader adoption of blockchain technologies. Some even claim that it could topple Bitcoin (BTC) and become the number one cryptocurrency.\n\nXRP: The Pioneer of Cross-Border Payments\n\nXRP, developed by Ripple, has long been celebrated for its fast, low-cost cross-border payments. Facilitating real-time global transactions at a fraction of traditional costs, it’s no surprise that many banking institutions have taken a keen interest in Ripple’s technology. At the end of the 2018 bull market, XRP was one of the major players in the crypto world. After the SEC filed a lawsuit against Ripple, the price plummeted and the token didn’t hit the heights of other projects in the bull run of 2021.\n\nGiven the ongoing developments and partnerships, along with a broader adoption of blockchain for cross-border payments, it’s conceivable that XRP’s value could soar in the coming years. Expert analysis and market trends point towards a potential price of around $10 for XRP within the next few years.\n\nScorpion Casino Token: The Future of Gaming and Passive Income\n\nScorpion Casino Token($SCORP) is currently priced at a mere $0.018 and offers an exciting blend of gaming and crypto investment. The ongoing presale, with a launch price of $0.05, presents a golden opportunity for early adopters. You already stand to 3x your investment if you bought this token today by the end of the presale but hurry, the price is increasing on October 8th.\n\nOne of the most enticing features of the Scorpion ecosystem is its Buy-Back scheme. This system ensures a consistent passive income for all holders by using a portion of the platform’s daily income to purchase $SCORP tokens. This is then split 50/50 with half of the tokens being burnt and therefore increasing the value of each $SCORP token. The other half is sent to token holders of $SCORP resulting in daily passive income.\n\nConsidering Scorpion Casino Token hasn’t even launched yet, the upside potential of this token is huge. Some believe that in the coming years, the price of $SCORP could hit the $1 mark\n\nThe Future Looks Bright For Crypto\n\nThe crypto space is filled with volatility, making price predictions a challenging task. Yet, considering the intrinsic value and innovative solutions offered by Ethereum, XRP, and Scorpion Casino Token, it’s apparent that these tokens have a promising future ahead. As with any investment, always conduct thorough research and only invest money that you are comfortable with potentially losing.\n\nGet $SCORP For The Lowest Possible Price, Find Out More Here:\n\nPresale: https://presale.scorpion.casino/\n\nTwitter: https://twitter.com/ScorpionCasino\n\nTelegram: https://t.me/scorpioncasino_official\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3Lm1hbHRhdG9kYXkuY29tLm10L3Nwb25zb3JlZC9zcG9uc29yZWQvMTI1MzEyL2V0aGVyZXVtX3ZzX2JpdGNvaW5fd2hpY2hfaXNfYmV0dGVyX2Zvcl9nYW1ibGluZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 07 Oct 2023 07:00:00 GMT",
        "title": "Ethereum vs. Bitcoin: Which is Better for Gambling? - MaltaToday",
        "content": "MediaToday is an independent media house based in Malta. Copyright © MediaToday Co. Ltd, Vjal ir-Rihan, San Gwann SGN 9016, Malta, Europe\n\nReproduction of material from this website without written permission is strictly prohibited."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vd3d3LmNyeXB0b3BvbGl0YW4uY29tL2V0aGVyZXVtcy1uZXctdHdvLXRpZXJlZC1zdGFraW5nLXNvbHV0aW9uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Oct 2023 07:00:00 GMT",
        "title": "Ethereum's new two-tiered staking solution: A game changer for security and scalability - Cryptopolitan",
        "content": "In a significant move aimed at improving the security, efficiency, and scalability of the Ethereum network, the platform has recently shifted from its traditional Proof-of-Work (PoW) consensus mechanism to a Proof-of-Stake (PoS) system. This transition is seen as a crucial step in addressing some of the challenges and limitations that have plagued the staking process on Ethereum.\n\nWhile this transition holds immense promise, it is not without its hurdles, including the steep 32 ETH entry barrier for solo staking and concerns about centralization within staking pools. In response to these challenges, Ethereum’s co-founder, Vitalik Buterin, has proposed an innovative two-tiered staking solution that promises to enhance the network’s security and scalability.\n\nEthereum: The two-tiered staking solution\n\nVitalik Buterin’s proposal revolves around the implementation of a two-tiered staking system, which introduces two distinct participant categories: node operators and delegators. This approach aims to strike a balance between security, decentralization, and accessibility within the Ethereum staking ecosystem.\n\nNode operators play a pivotal role in this new system by acting as validators. They commit a significant stake of 32 ETH while simultaneously running nodes responsible for handling transactions and generating new blocks. However, these operators are bound by strict ethical standards, and any engagement in malicious behavior exposes them to slashing penalties, which serve as a strong deterrent against misconduct.\n\nDelegators, on the other hand, possess stakes below the 32 ETH threshold required for solo staking. They are not involved in operating nodes themselves but have the freedom to assign their stakes to chosen node operators. This delegation allows them to support and engage with the consensus process in a lighter capacity. Delegators can carefully select the node operators they trust, fostering a sense of community and collaboration within the Ethereum network.\n\nBenefits of the two-tiered staking proposal\n\nVitalik Buterin’s proposal offers a multitude of benefits, both from the network’s perspective and for its users. One of the primary advantages of this proposal is the potential to significantly enhance scalability. By reducing the number of signatures required per block to approximately 10,000, the computational overhead is minimized, resulting in a more efficient network capable of processing a higher volume of transactions.\n\nThe two-tiered staking system raises the bar for potential attackers looking to gain control of a majority stake within the Ethereum network. This increased difficulty level serves to bolster network security and further decentralize the ecosystem, aligning with the core principles of blockchain technology.\n\nButerin’s proposal opens the door to more inventive and flexible staking solutions. It encourages the utilization of smart contracts and the adoption of liquidity tokens, among other mechanisms. This innovation not only diversifies the staking options available but also offers greater accessibility to a wider range of participants.\n\nFurthermore, the proposal suggests implementing these changes at various layers of abstraction within staking pools, between them, and within the Ethereum protocol itself. This approach allows for a gradual transition, minimizing disruptions while achieving the desired goal of a more secure and scalable network.\n\nConclusion\n\nEthereum’s shift to a two-tiered staking system, as proposed by Vitalik Buterin, marks a significant step forward in addressing the challenges associated with its transition to a Proof-of-Stake consensus mechanism. By striking a balance between node operators and delegators, this innovative solution promises improved security, scalability, and accessibility, ultimately paving the way for a more robust Ethereum ecosystem. As the Ethereum community embraces these changes, the future looks brighter than ever for this pioneering blockchain platform."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3LmluZmx1ZW5jaXZlLmNvbS9idXktYS1ob25kYS13aXRoLWJpdGNvaW4tZXRoZXJldW0tYW5kLWV2ZW4tc29tZS1tZW1lLWNvaW5zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 07 Oct 2023 07:00:00 GMT",
        "title": "Buy A Honda With Bitcoin, Ethereum, And Even Some Meme Coins - Influencive",
        "content": "In a game-changing move, Honda has entered the world of crypto. Teaming up with the blockchain payment platform called FCF Pay, they’re revolutionizing the way people engage with their services. Not only that, but they’re also shining the spotlight brighter onto Japan as a major player in the Web3 industry.\n\nLet’s take a closer look at this exciting partnership and explore the potential impact it could have on the automotive and financial sectors.\n\nNext-Gen Partnerships\n\nHonda’s exciting partnership with FCF Pay shows its commitment to innovation and staying ahead of the curve. This collaboration is set to revolutionize the way Honda customers make purchases, allowing them to use digital currencies like Bitcoin and Ethereum instead of traditional fiat money.\n\nFCF Pay Who??\n\nFCF Pay is a popular blockchain payment platform that supports various cryptocurrencies, including Bitcoin, Ethereum, Ripple, and even meme coins like Shiba Inu and Dogecoin. The collab between Honda and FCF Pay is a big step toward the widespread acceptance and use of crypto.\n\nJapan Is All In\n\nJapan is all in for Web3 innovation, as shown by the Web3 project team in the governing Liberal Democratic Party. They recently dropped a white paper with recommendations to boost Japan’s Web3 sector, proving their commitment to leading the tech game. This move is a clear sign that Japan is serious about nurturing innovation and driving growth in the rapidly evolving Web3 world. They’re definitely a global frontrunner…\n\nHonda Isn’t The First\n\nHonda wasn’t actually the first Japanese car company to jump on the crypto train. SBI Motor, another big player in the industry, had already jumped on board by accepting Bitcoin as a payment option. And let’s not forget the buzz that Tesla created when they announced they’d be accepting Bitcoin and even Dogecoin for buying their cars (although they did change their minds later on).\n\nNissan has also been diving into the Web3 world, checking out metaverse-based vehicle sales for brands like Infiniti, Nismo, and Nissan. These advancements show how crypto is becoming more common in the automotive sector, reflecting the broader trend of digital currencies being adopted by various industries.\n\nPartnerships On Top Of Partnerships\n\nHSBC has partnered with FCF Pay to offer a convenient solution for cryptocurrency users, allowing them to utilize digital assets such as XRP, Shiba Inu, and Dogecoin to pay off their mortgage bills and loans. This innovative collaboration aims to provide a seamless experience while retaining the essence of the original digital currency concept. It also shows how cryptocurrencies are gaining acceptance in different sectors, and how they’re becoming more integrated into traditional financial institutions.\n\nWhat Will The Future Bring?\n\nSince a global automotive giant like Honda started accepting cryptocurrencies as payment, it might inspire other industry players to do the same. This shows how the automotive, traditional finance and crypto sectors are coming together, and it could lead to more exciting innovations and collaborations down the road. The future is looking bright!\n\nCheers"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3LmNyeXB0b3BvbGl0YW4uY29tL2NoYXJsZXMtaG9za2luc29uLWRpc21pc3Nlcy1ldGhnYXRlLXNjYW5kYWwv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Oct 2023 07:00:00 GMT",
        "title": "Charles Hoskinson dismisses ETHGate scandal, argues Ethereum and XRP serve different ecosystems - Cryptopolitan",
        "content": "Cardano founder Charles Hoskinson recently fired back at allegations surrounding the ETHGate scandal. For those out of the loop, this scandal purports that members of the Ethereum community allegedly bribed U.S. regulatory officials. Hoskinson has fervently countered these claims, especially against critiques from the XRP community. Moreover, Hoskinson took to social media and an Ask Me Anything (AMA) session to clarify his position on the complex issue.\n\nHoskinson categorically emphasized the dissimilarities between Ethereum and Ripple‘s XRP. He underscored the absence of smart contracts in XRP’s ecosystem. Additionally, while Ethereum has been concentrating on a proof of work model, Ripple has been zeroing in on banks to promote remittance relations. Hence, Hoskinson stated that Ripple was never a direct competitor or a threat to Ethereum. He also named other blockchain projects like Nxt and Bitshares as more significant challengers to Ethereum’s space.\n\nRipple’s CTO clashes with Hoskinson’s view\n\nOn the other side of the debate, Ripple’s Chief Technology Officer, David Schwartz, offered an alternative viewpoint. Schwartz, differing from Hoskinson, argued that government favoritism in line with personal interests could be categorized as corruption. He dismissed Hoskinson’s claim that the ETHGate scandal revealed only an “unequal application” of U.S. law rather than corruption. Schwartz expressed his thoughts via social media, igniting further debates within the crypto community.\n\nThe Ripple executive’s comments have instigated debates that go beyond just the ETHGate scandal. Some community members are now questioning whether Hoskinson’s defense might be stemming from his intent to protect his history with Ethereum. It’s essential to note that Hoskinson was one of the eight co-founders of Ethereum and even served as its CEO for a brief period. After a public rift between the co-founders, he left Ethereum in 2014 to launch Cardano.\n\nHowever, both parties seem to agree on one point: The U.S. regulatory stance on cryptocurrencies like Ethereum and XRP has been inconsistent. Despite former SEC director William Hinman classifying Ethereum as not a security back in 2018, the status of other cryptocurrencies like XRP remains unclear. This inconsistency has led to considerable hindrances in the adoption and growth of cryptocurrencies other than Ethereum.\n\nIn this debate, one thing becomes abundantly clear. The crypto world is not just about technology; it’s also a field fraught with differing opinions on regulation, competition, and ethical considerations. The ETHGate scandal has merely peeled back a layer, revealing a host of complexities that market participants will have to navigate. Whether it’s about defining what constitutes corruption or discussing which cryptocurrencies pose a real threat to Ethereum, the debate continues to rage, and resolution seems far from near."
    }
]