[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vd3d3LndpcmVkLmNvbS9zdG9yeS9ldGhlcmV1bS1zaGFuZ2hhaS11cGRhdGUtY3J5cHRvLXJpZnQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Ethereum's Shanghai Update Opens a Rift in Crypto - WIRED",
        "content": "At 19:27 Eastern time on April 12, the Ethereum blockchain, home to the world’s second-most-popular cryptocurrency, ether, will finally sever its links to crypto mining. Within the Ethereum bubble, a sense of anticipation is building; some are planning “viewing parties” for the occasion. Codenamed “Shanghai,” the update to Ethereum caps off a process, after “The Merge,” which fundamentally changes the way transactions are verified and the network secured.\n\nUnder the old system, proof-of-work (PoW) mining, the right to process a batch of transactions and earn a crypto reward is determined by a race to solve a mathematical puzzle. The greater the computing power miners throw at the problem, the greater their chance of winning the race. Under Ethereum’s new proof-of-stake (PoS) system, there is no race and there are no miners; instead, the winner is determined by raffle. The greater the amount of ether somebody locks up on the network—or stakes—the greater the chance they hold a prize-winning ticket.\n\nBy demonstrating that a large-scale blockchain can shift from one system to another, Shanghai will reignite a debate over whether the practice of mining that still supports bitcoin, the most widely traded cryptocurrency, is viable and sustainable. Figures from the University of Cambridge suggest the Bitcoin network consumed 107 terawatt-hours of energy in 2022—equivalent to that of the Netherlands—of which only just over a quarter came from renewable sources. Prior to The Merge, Ethereum consumed roughly two-thirds as much energy as the Bitcoin network. But the move away from mining has cut that consumption, according to analysis by Alex de Vries, data scientist at De Nederlandsche Bank and creator of Digiconomist, a source of crypto emissions data, by at least 99.84 percent.\n\n“The energy consumption problem is Bitcoin’s achilles heel,” says de Vries. “It’s a simple fact that as the price of bitcoin gets higher, the energy consumption problem gets worse. The more money miners make, the more they will typically spend on resources: hardware and electricity.\n\nBut many bitcoiners dispute the characterization of the network as energy-guzzling and carbon intensive, saying that mining is increasingly powered by renewable energy. And, they say, PoS is inferior to PoW—prone to centralization (crypto’s great nemesis), concentrating influence and wealth in the hands of the wealthy, without any mitigating forces, like energy costs, pulling in the opposite direction. All of this makes Shanghai a proxy battle over the future of crypto.\n\nIn bitcoin’s infancy, the cryptocurrency could be mined effectively with just a personal computer and simple software. But as the level of appetite for bitcoin increased, the industry professionalized. Today, the mining scene is dominated by large companies—some publicly traded, like Marathon Digital and Riot Blockchain—that operate gargantuan facilities with rack upon rack of hardware. The largest of these mines, many of which are located in Texas, can draw upwards of 700 MW of power."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vdS50b2RheS9hbmFseXN0LW5hbWVzLXllYXItd2hlbi1ldGhlcmV1bS1ldGgtbWlnaHQtcmVhY2gtMTAwMDDSAUpodHRwczovL3UudG9kYXkvYW5hbHlzdC1uYW1lcy15ZWFyLXdoZW4tZXRoZXJldW0tZXRoLW1pZ2h0LXJlYWNoLTEwMDAwP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Analyst Names Year When Ethereum (ETH) Might Reach $10,000 - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a recent series of tweets , Chris Burniske, a well-known analyst, made a bold prediction about the future of Ethereum (ETH). Burniske hinted that Ethereum's price could reach $10,000 by 2025. While this may seem like a stretch, especially considering Ethereum's current price of $1,858, Burniske's optimism should not be disregarded.\n\nAdvertisement\n\nBurniske's tweets were seemingly aimed at those who have been consistently bearish on Ethereum, even as its price has risen from $1 to $10, $100 and $1,000. He suggests that the naysayers may have to reconsider their stance as Ethereum continues its upward trajectory, potentially reaching the $10,000 mark by 2025.\n\nThere are several factors that could contribute to Ethereum's bullish rally in the coming years. The recently announced staking contract unlock could lead to increased adoption of Ethereum and its associated technologies, such as decentralized finance (DeFi) and non-fungible tokens (NFTs).\n\nFurthermore, the resurgence of interest in blockchain technology and digital currencies from institutional investors may considerably boost Ethereum's value. As an increasing number of institutions start allocating a portion of their portfolios to cryptocurrencies, Ethereum is expected to reap the benefits of heightened demand and investment.\n\nIt is important to highlight that Ethereum's supply dynamics are undergoing a transformation due to the introduction of EIP-1559, which implements a fee-burning mechanism. This modification could render Ethereum scarcer, potentially resulting in a rise in its worth over time.\n\nAlthough Burniske's forecast of Ethereum hitting $10,000 by 2025 may appear excessively optimistic, it is crucial to bear in mind that the crypto market is infamously unstable and erratic. Even the most seasoned experts can have difficulty precisely predicting the future trajectories of digital assets."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ldGhlcmV1bS1zaGFuZ2hhaS11cGdyYWRlLXVubG9ja3MtdXMtMDUzMDE5ODg3Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Ethereum blockchain upgrade unlocks US$34 billion in Ether, what does it mean for crypto prices? - Yahoo Finance",
        "content": "Developers at Ethereum, the world’s second-biggest blockchain with a capitalization of US$231 billion, are set to upgrade the software network on Wednesday with reported new features and improvements to efficiency, cost and security.\n\nHowever, the main feature of the so-called Shanghai upgrade – to take place at 10:27 p.m. UTC on Wednesday, according to the Ethereum Foundation – is the EIP-4895. This allows users to withdraw their staked Ether, or tokens deposited to support the operations of a blockchain in return for a passive income, usually in the form of more tokens.\n\nWith around 18 million Ether (US$34.5 billion) – or about 15% of the total supply – staked into the network, according to Etherscan, concerns emerged that holders could rush to sell Ether to lock in profits, which would drive prices lower. Ether has risen about 60% so far this year and recently traded at more than US$1,900.\n\nBut on-chain data provider CryptoQuant doesn’t expect a flood of Ether sales, according to a report it released in February.\n\n“We argue that there would be low selling pressure for Ether from staking withdrawals after the Shanghai upgrade,” CryptoQuant said, adding that the majority of the staked Ether was still holding losses compared to Ether prices when it was staked. Ether reached all time highs of more than US$4,600 in November 2021.\n\n“Typically, selling pressure emerges when market participants are sitting on extreme profits, which is not the case right now for the Ether that has been staked,” CryptoQuant said.\n\nCryptoQuant also pointed out that the currently locked Ether cannot be withdrawn simultaneously, estimating it may take up to a year to withdraw the total value staked in the network,\n\nOther benefits\n\nZhuling Chen, chief executive officer of crypto staking service provider RockX, said some short-term market volatility is to be expected following the upgrade, but he preferred to focus on the “substantial” long-term benefits to the Ethereum blockchain.\n\nStory continues\n\n“Ethereum’s capacity to handle more transactions per second increases, transaction costs decrease, and the security and efficiency of smart contracts improve,” Chen said in a statement. The staking landscape will be transformed and Ethereum will become the benchmark yield for crypto, Chen added.\n\nThat’s a view shared by Alex Esin, chief executive officer of P2P.org, which offers institutional staking and blockchain development services. Expect a substantial increase in staking activity in the year following the Shanghai upgrade, Esin said in a statement.\n\n“We do not anticipate a massive unstaking once this functionality goes live,” Esin said.\n\nGuilhem Chaumont, chief executive officer of crypto-financial service Flowdesk, points out the system to withdraw staked Ether could itself prevent a sell off in the token.\n\n“It’s important to realize that the withdrawal queue only allows a limited set of requests per day (115,200), so while there may be sustained downward pressure on the price, unstaking is not likely to cause a sharp, sudden dip,” he said in an emailed comment.\n\nChaumont said it’s more likely a sizable portion of Ether will remain staked “with staking rewards outperforming current interest rates.”\n\nOverreact?\n\nKen Timsit, head of Cronos Labs, the accelerator of the Cronos chain that links the Ethereum and Cosmos blockchains, did caution that Ether stakers will monitor withdrawals after the Shanghai upgrade kicks in and may potentially overreact if there is significant withdrawal demand.\n\n“Once short-term volatility has been smoothed out, however, it is likely that the outcome will be neutral given that this upgrade has been priced into Ether value for some time,” Timsit said in an emailed comment.\n\nDanny Chong, co-founder of Tranchess, a decentralized app that offers Ethereum services, said the Shanghai upgrade will lower the risks associated with liquid staking and “should see increased institutional participation.”\n\nLiquid staking, also known as soft staking, allows investors to access their locked funds for other crypto-based activities while still earning rewards. Users with deposits locked on liquid staking platforms receive a tokenized version of their crypto assets, which then can be stored or traded elsewhere.\n\nThe total value of crypto assets locked in liquid staking services stood at US$17.3 billion on Tuesday, up from US$14 billion on March 1, making liquid staking the second-largest service in decentralized finance, following decentralized exchanges, according to data provider DefiLlama.\n\n“Earning yield from liquid staking shares similarities with certain traditional financial instruments such as bonds or stocks that offer interest payments,” Chong said. “Hence it would likely attract TradFi [traditional finance] participants who are familiar with such instruments.”\n\nChen of RockX shared similar views: “We will see more innovations coming from direct and liquid staking solutions, and liquid staking will start playing a much larger role in the cryptocurrency space.”\n\nSome cryptocurrency exchanges have also spotted opportunities to expand their staking products. For example, Singapore-based crypto exchange Bybit last month launched a new staking pool in time for the Shanghai upgrade.\n\n“The highly liquid and trading-integrated ETH staking options we will be rolling out around the time of Ethereum’s Shanghai upgrade will open up many new opportunities for our users,” Ben Zhou, chief executive officer of Bybit, said in a March statement.\n\nSee related article: What impact will Ethereum’s Shanghai upgrade have on ETH and crypto markets?"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V0aGVyZXVtLXNoYW5naGFpLWxpcXVpZC1zdGFraW5n0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Why the Ethereum Shanghai Upgrade Will Lead to War - Blockworks",
        "content": "DeFi industry: There is a new war on the horizon. Unlike the Curve Wars, fought over stablecoin liquidity dominance, this war will be fought over the future of liquid staking tokens.\n\nThe catalyst for this upcoming battle?\n\nThe Ethereum Shanghai fork, set to take place on April 12, when more than 18 million in staked ether (~$34.2 billion) will become unlocked and battlelines will be drawn.\n\nI believe that Shanghai will provoke a period of intense competition among liquid staking protocols that will come to be known as the “Liquid Staking Wars” — albeit wars that will ultimately benefit the entire industry.\n\nThose of us who were here for DeFi Summer will remember the Curve Wars well: the ruthless competition between the emerging stablecoin protocols, who “fought” on the Curve DEX to have the deepest liquidity and most diverse set of liquidity pairings.\n\nLet’s review the ingredients that precipitated the Curve Wars:\n\n1) a DEX Automated Market Maker (AMM) especially designed for trading stablecoins (Curve);\n\n2) a mechanism for protocols to incentivize liquidity providers (LPs) to move from LPing one stablecoin to another (Curve incentive contracts);\n\nand 3) a bunch of new stablecoin protocols jockeying for market share (USDC, USDT, DAI, FRAX, LUSD, etc).\n\nI see striking similarities with the Curve Wars in the burgeoning competition between protocols that offer liquid staking tokens (LSTs) — yield-bearing tokens that allow holders to stay liquid while enjoying the yield from staked ETH.\n\nWe already see the same ingredients coalescing with:\n\n1) novel DEX AMM protocols especially designed to facilitate LPing liquid staking token (LST) pairs;\n\n2) incentive contracts that LST protocols can use to reward LST LPs; and\n\n3) a cascade of emerging LST protocols vying for market share.\n\nThe Liquid Staking Wars have one last different ingredient — the imminent Shanghai upgrade that will enable LPs to easily and cheaply unstake ETH from one LST and move it to another LST.\n\nThe Liquid Staking Wars will be won by whichever protocol can capture the most TVL and volume for their LST. I believe that the battle for LST supremacy will see its first skirmishes by early May and that it will have a lasting impact on the DeFi ecosystem.\n\nAfter all staked Ethereum becomes unlocked in mid-April, unstaked ETH holders will be incentivized to move their ETH from one liquidity staking token solution to another, always seeking the highest potential returns in liquidity pools. LST protocols will likewise be incentivized to capture market share by having their token be the most liquid.\n\nThis war — or competition between LST protocols to provide the dominant asset in crypto — will reshape all crypto pairs across all DEXs.\n\nLiquidity provider (LP) strategies will also evolve based on the yield-bearing characteristics of LSTs; DEXs will evolve their offerings to accommodate this new landscape; and the DeFi industry will benefit from a wave of innovation (as we see in most periods of increased competition).\n\nThe Liquid Staking Wars’ tactics will mirror those of the Curve Wars\n\nWe will see LST protocols attempt to differentiate themselves through innovation, usability and yield. The most obvious mechanism will be yield: LST protocols will seek to maximize the incentives for LPs to fund liquidity pools using their LST over any other LST.\n\nPost Shanghai, there will be a big opportunity cost for LPs who add liquidity to ETH-denominated pools instead of pools denominated in an LST. The ETH LPs will be foregoing ~4% return for no good reason.\n\nEven pre-Shanghai, we have seen a massive demand for LST yield: Liquid staking tokens have skyrocketed in total value locked (TVL) to account for more than $14 billion, according to DeFiLlama as of April 3, 2023. The LST sector is second only to the current size of all decentralized exchange protocols combined.\n\nSome may claim that Lido — with a near 75% of LST TVL market share — has won the war before it has even begun. But while Lido has established itself as a leader, entrants such as Frax, Coinbase, Rocket Pool, and new protocols that have yet to launch are jockeying for position to have their LST become the preeminent ETH replacement.\n\nAs with any war, the winners and losers will be defined by strategically deploying the right set of tactics on the battlefield.\n\nThis competition — and specifically the competitive incentivization of liquidity pools it will entail — should also benefit other participants across the DeFi ecosystem. LSTs have a place not just paired with each other or with ETH in pools, but also with other utility tokens. For example, instead of WBTC-ETH being a popular pool on DEXs, I expect to see WBTC-WSTETH, WBTC-cbETH or WBTC-rETH.\n\nI expect a groundswell of co-incentive liquidity pool structures pairing utility and yield tokens. These partnerships should benefit long-tail tokens by providing the liquidity required to build their businesses, as well as some of the most well-known utility tokens seeking to expand their influence.\n\nIn addition to maximizing incentives into liquidity pools, subtle differences in Automated Market Makers (AMMs) can provide significant advantages to LST protocols — especially considering how LSTs gain value over time from the yield of underlying staked ETH. This intrinsic value-growth dictates that LPs will need to more closely monitor their positions to keep their liquidity active as prices move. Pairing with an AMM that can maximize LP capital efficiency for an LST pair, as an example, can provide significant benefit.\n\nI anticipate increased innovation from DEXs, specifically around the functionality of AMMs. To win the Liquid Staking Wars, protocols will need a set of tools to incentivize the liquidity of their liquid staking tokens using minimal incentives and maximum efficiency. Protocols that can boost LP incentives through this type of “surgical incentivization” and provide greater capital efficiency will ease the capital requirement burden from LSTs. This will in turn enable the LSTs to maximize their return on incentives, and capture a greater market share.\n\nFor stakers and LPs, it’s essential to understand the financials (fees, etc.) before they stake or provide liquidity on a particular platform. As mentioned, due to the unique return structure of LSTs, some existing AMMs are not capital efficient for LST liquidity. This is because LSTs and the unique liquidity challenges they represent did not exist when these AMMs were developed.\n\nFor instance, infinite-range AMMs like Sushi, Balancer, and Uniswap v2 are known to have low efficiency for almost any pair. But even Range AMMs like Uniswap v3 and related forks can have a low efficiency for an ETH-LST pair, because the price in the AMM will continuously exceed the LP’s range unless the LP actively manages their position or stakes a very wide price range. In addition to the incentives offered, LPs must be aware of these crucial structural details of the protocols before they deploy their capital.\n\nEven though I am calling this next phase in DeFi after Shanghai a “war,” what it’s ultimately leading to is more liquidity injected into the ecosystem. And with greater capital efficiency in liquidity pools ushering in an era of more “active capital,” these volumes will be more consistently utilized to the benefit of the entire industry.\n\nBob Baxley is a technologist, entrepreneur, and builder of technology companies. Bob is the core builder at Maverick Protocol, a new infrastructure for decentralized finance built to facilitate the most liquid markets for traders, liquidity providers, DAO treasuries, and developers. Bob designed Maverick AMM, a revolutionary Dynamic Distribution AMM that provides greater capital efficiency and control for liquidity providers.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDQvMTAvZXRoZXItY2FwaXRhbC1jZW8tc2hhbmdoYWktdXBncmFkZS1saWtlbHktdG8tYmUtYS1ub24tZXZlbnQtb24tZXRocy1wcmljZS_SAXdodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA0LzEwL2V0aGVyLWNhcGl0YWwtY2VvLXNoYW5naGFpLXVwZ3JhZGUtbGlrZWx5LXRvLWJlLWEtbm9uLWV2ZW50LW9uLWV0aHMtcHJpY2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Ether Capital CEO: Shanghai Upgrade Likely to Be 'Nonevent' on ETH's Price - CoinDesk",
        "content": "The Shapella upgrade is considered to be the network’s final shift towards fully implementing its proof-of-stake consensus mechanism. Besides giving users the ability to make withdrawals from the ETH they have staked, the upgrade will lower fees and create more room on the blockchain to handle transactions."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS12YWxpZGF0b3ItY2FzaGVzLWluLTY4OS1ldGgtZnJvbS1tZXYtYm9vc3QtcmVsYXnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Ethereum validator cashes in 689 ETH from MEV-Boost relay - Cointelegraph",
        "content": "A 689 Ether (ETH) reward worth $1.28 million has been paid from a single Maximal Extractable Value (MEV)-boost relay block on the Ethereum Beacon Chain in one of the largest rewards in recent months.\n\nEthereum liquid staking solution Lido was paid the reward from block number 17007842 on the Beacon Chain, which was finalized on April 9, containing 47 transactions, and built by beaverbuild.org, according to transaction data.\n\nHigh Proposer Payment Alert!\n\nValidator 0x388c... received 689.02 ETH.\n\nBlock built by a @beaverbuild builder (0x96a59d...)‍\n\nSlot: 6,181,978.\n\nReceived through the @GnosisDAO relay.https://t.co/Pv3bqfZMrU — MEV-Boost Bot (@mevproposerbot) April 9, 2023\n\nThe reward almost matched Lido’s most recent high of 691 Ether on March 20.\n\nThe figure raised the eyebrows of Martin Köppelmann, the co-founder and CEO of Ethereum-based infrastructure platform Gnosis, who suggested Ethereum users should use a service like MEV Blocker to prevent their transactions from being exploited.\n\nMore than 90% of the MEV currently being paid to validators could go to users if all users or wallets would use services like https://t.co/ijeJy3LwBl https://t.co/DHlp6tUz7J — Martin Köppelmann (@koeppelmann) April 9, 2023\n\nAccording to MEV Blocker, MEV bots have extracted more than $1.38 billion from Ethereum users attempting to trade, provide liquidity and mint nonfungible tokens (NFTs).\n\nThese centralized MEV-boost relays are able to extract value by aggregating blocks from multiple builders to select the one with the highest fees.\n\nOne of the most common MEV exploits is the “sandwich” attack, which occurs when an attacker places a large trade on either side of a target’s transaction, manipulating the price and profiting from the price change.\n\nRelated: ETH staking on top exchanges contributes to Ethereum censorship: Data\n\nMEV-boost relays stem from the concept of proposer-builder separation, which was introduced by the Ethereum research organization Flashbots in 2021 in the lead-up to Ethereum’s transition to proof-of-stake in September 2022.\n\nSeparating the role of proposers from block builders is intended to promote more competition at the consensus level, further decentralize the Ethereum network and strengthen censorship resistance.\n\nHowever, Ethereum has encountered several censorship issues since the Merge took place, namely compliance with standards laid down by the Office of Foreign Assets Control (OFAC), although the number of compliant blocks has since fallen.\n\nThere are currently 10 active relays, with Flashbots responsible for relaying more than 50% of the MEV-boost blocks since MEV was introduced in 2021, according to MEVBoost.org.\n\nMagazine: Unstablecoins: Depegging, bank runs and other risks loom"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vZGVjcnlwdC5jby8xMjU4NTkvZXRoZXJldW0tc2hhbmdoYWktdXBncmFkZS1wcmljZS1ldGjSAUNodHRwczovL2RlY3J5cHQuY28vMTI1ODU5L2V0aGVyZXVtLXNoYW5naGFpLXVwZ3JhZGUtcHJpY2UtZXRoP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "How the Ethereum Shanghai Upgrade Could Impact the Price of ETH - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum will conclude its two-year transition to proof of stake this week with the launch of the Shanghai upgrade on April 12. The move will introduce a number of technical improvements to the network, but most Ethereum traders only care about one thing: staking withdrawals.\n\nWith more than 18 million ETH—worth roughly $34 billion—locked up on the Ethereum network set to finally become available to validators, investors are understandably uneasy about what this might mean for the price of the second-largest cryptocurrency by market cap.\n\nAndrew Thurman, a data analyst at Nansen, told Decrypt that in his view price impact in the short-term, however, will be “a little bit more muted” than community expectations suggest.\n\nAD\n\nAD\n\nAlso known by its consensus name Capella, Shanghai ends the two-year lockup period on staked ETH and its corresponding rewards. If all goes well, Ethereum stakers will be able to begin sending withdrawal requests to the network immediately after Shanghai goes live—but that doesn’t mean users will receive the funds on day one. Because of the anticipated length of the withdrawal queue, holders may have to wait weeks to months to retrieve their assets.\n\n“With many speculating whether this event will cause a massive sell-off in price, it’s important to realize that the withdrawal queue only allows a limited set of requests per day (115,200),” Guilhem Chaumont, CEO and co-founder of Flowdesk, said in a statement shared with Decrypt. “So while there may be sustained downward pressure on the price, unstaking is not likely to cause a sharp, sudden dip.”\n\nIndividual stakers, those who were able to pony up at least 32 ETH (worth approximately $60,000 at today’s prices) themselves, can expect to wait at least two to three days to have withdrawal requests processed, Ethereum developers previously explained to Decrypt. Those staking through pools and other service providers, such as Lido or crypto exchanges like Coinbase, may have to wait several weeks or even months to withdraw their funds.\n\nAnd besides the wait times, others point out that the availability of liquid staking services such as Lido means that traders who have wanted the ability to trade staked ETH have been able to do so even before Shanghai.\n\n“Most people have been able to sell [staked ETH] for quite some time, because the majority of ETH is being staked through platforms with liquid staking tokens, like Lido or Rocket Pool,” Jacob Cantele, head of product at Ethereum layer-2 Mantle, previously told Decrypt. “So I don't actually think [Shanghai] represents a major shift in the economics of Ethereum.”\n\nAD\n\nAD\n\nMatthew Niemerg, co-founder of privacy-enhancing blockchain network Aleph Zero, concurs: “To be more direct, it's priced in,” he said.\n\n“It is entirely possible that there will be more people willing to stake ETH (locking up liquidity and reducing the available supply) after the upgrade, as people will be more certain that they can safely unstake their ETH,\" said Niemerg.\n\nNansen’s Thurman believes that while the short-term price action may be lackluster, Shanghai may give Ethereum investors reason to be more bullish in the long term.\n\n“It's gonna take a while for people to really understand what the dynamics are regarding whether or not this is a bullish or bearish action in the short to medium term,” he said. “I will say, though, that on a long enough time horizon, it's really difficult to come up with a thesis that isn't wildly bullish.”\n\nThurman argues that the reason for this is the enhanced business use-case for crypto custody. In recent years, major banks including JPMorgan Chase, Standard Chartered, and CACEIS have increasingly shown interest in cryptocurrency custody, a service which refers to the safekeeping and management of securities or financial assets on behalf of consumer clients.\n\n“Custody is going to get much more competitive,” Thurman told Decrypt, “because suddenly you can custody ETH as a bank, or as one of these solutions, for low to no fees. I think that’s going to lead to a lot of locked up [ETH]. And of course, that's going to be great for the price in the long run,” he said.\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2ZvcnR1bmUtY3J5cHRvLTQwLXNlbGVjdHMtZXRoZXJldW0tYXMtdG9wLXByb3RvY29sLWJpdGNvaW4tcmFua3Mtc2Vjb25kL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Fortune Crypto 40 selects Ethereum as top protocol, Bitcoin ranks second - CryptoSlate",
        "content": "In its newly launched Fortune Crypto 40 benchmark, the media firm ranked the top 5 firms in the crypto space in each of the eight categories.\n\nThe categories include centralized finance (CeFi), traditional finance (TradFi), Venture Capital, Non-fungible tokens (NFTs), Data, Infrastructure, decentralized finance (DeFi), and Protocols.\n\nTo find the top 40 firms, Fortune used various empirical metrics along with surveys of over 200 financial executives conducted by Researchscape. Fortune claims the results are “impartial and rigorous.”\n\nThe top 40 crypto firms by category\n\nThe benchmark ranked the Ethereum Foundation as the top protocol, followed by Bitcoin. Polygon Labs, which develops Ethereum scaling solutions, and Solana Foundation, the non-profit responsible for developing the Solana ecosystem, ranked third and fourth, respectively. Offchain Labs, the firm behind Ethereum scaling solutions provider Arbitrum, secured the fifth position in the Protocols category.\n\nCoinbase topped the CeFi category, followed by Binance and Kraken. Mike Novogratz-led Galaxy Digital and USD Coin (USDC) stablecoin issuer Circle grabbed the fourth and fifth positions in the benchmark.\n\nPayPal’s integration with MetaMask placed it at the top of the TradFi category, which ranked the top 5 firms innovating with blockchain technology. Stock trading platform Robinhood, which enables crypto trading, came in second, followed by JP Morgan Chase, which launched its own blockchain Onyx.\n\nFidelity, which received flak for allowing pensioners to invest part of their retirement funds in Bitcoin, ranked fourth, while Visa secured the fifth position.\n\nPolychain Capital ranked first in the VC category, followed by Animoca Brands and Andreessen Horowitz. The last two spots in the category went to Pantera Capital and Blockchain Capital.\n\nAs the largest NFT marketplace, OpenSea secured the top position in the NFT category. Yuga Labs, which launched some of the top NFT collections, including Bored Ape Yacht Club and Mutant Ape Yacht Club, ranked second.\n\nSky Mavis, creator of the popular NFT game Axie Infinity, and generative art NFT platform Art Blocks ranked third and fourth, respectively. RTFKT, which Nike acquired in 2021, is the fifth NFT firm in the benchmark.\n\nIn the data category, Chainalysis ranked first, followed by Coin Metrics and The Graph. Dune and Messari secured the two other spots.\n\nThe Fortune benchmark also included crypto firms that offer infrastructure for the industry. Non-custodial wallet provider Ledger topped the category. Bitcoin mining giant Genesis Digital Assets, not to be confused with the Digital Currency Group lender that filed for bankruptcy, secured the second spot.\n\nBitcoin mining chip developer Bitmain ranked third, followed by Alchemy, which provides plug-and-play tools to build products and services on blockchains. Crypto payment solution MoonPay ranked fifth in the infrastructure category.\n\nDeFi is all about Ethereum\n\nFortune listed Uniswap Labs, Lido, MakerDAO, Aave, and Curve as the top five contenders in the DeFi category. It is worth noting that all the DeFi applications are built on Ethereum.\n\nIn fact, according to DefiLlama data, these are the top five DeFi applications in terms of total value locked (TVL). The five DeFi applications have over $31 billion in TVL at the time of writing, as per DefiLlama.\n\nFurthermore, the Fortune benchmark includes a high number of Ethereum-based applications, not to mention that two out of the five top protocols are Ethereum scaling services.\n\nBut the focus on Ethereum may have been a result of the fact that Ethereum controls nearly 70% of all DeFi activity.\n\nMentioned in this article"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA0LTEwL2V0aGVyZXVtLXMtZXRoLXNoYW5naGFpLXVwZ3JhZGUtY29tZXMtd2l0aC1hZGRlZC1tYXJrZXQtcmlza9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Ethereum’s (ETH) Shanghai Upgrade Comes With Added Market Risk - Bloomberg",
        "content": "Crypto enthusiasts are about to get some good news: The Ethereum blockchain’s next big software upgrade is poised to happen on Wednesday. But like almost everything else in the digital-asset world these days, the long-anticipated tweaks won’t come without complications.\n\nThe overhaul, dubbed Shanghai, follows last year’s game-changing “Merge,” which replaced power-hungry computers with a process involving staked, or pledged, Ether tokens and so-called validators to order transactions on the most commercially successful crypto network. Now, Shanghai will allow withdrawals for the first time by owners of Ether who have staked their coins since December 2020. Owners of the cryptocurrency who stake earn a yield that is paid out in additional Ether tokens."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNC8xMC9jaHJpcy1idXJuaXNrZS11bnZlaWxzLW1hc3NpdmUtcHJpY2UtdGFyZ2V0LWZvci1ldGhlcmV1bS1zYXlzLXRyYWRlcnMtd2FpdGluZy1mb3ItY3J5cHRvLWNhcGl0dWxhdGlvbi13aWxsLWJlLXNpZGVsaW5lZC_SAZ0BaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDQvMTAvY2hyaXMtYnVybmlza2UtdW52ZWlscy1tYXNzaXZlLXByaWNlLXRhcmdldC1mb3ItZXRoZXJldW0tc2F5cy10cmFkZXJzLXdhaXRpbmctZm9yLWNyeXB0by1jYXBpdHVsYXRpb24td2lsbC1iZS1zaWRlbGluZWQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Chris Burniske Unveils Massive Price Target for Ethereum, Says Traders Waiting for Crypto Capitulation Will be Sidelined - The Daily Hodl",
        "content": "A venture capitalist who correctly called the November 2022 digital asset bottom says those who are waiting for a major crypto correction will likely be left in the sidelines.\n\nPlaceholder partner Chris Burniske tells his 258,300 Twitter followers that he believes the stage is set for a massive long-term Ethereum (ETH) rally.\n\nAccording to Burniske, he sees Ethereum rising to a new all-time high and printing gains of over 438%.\n\n“For the haters that have been negative on ETH at $1, $10, $100, and $1,000, but refuse to let data change their views, see ya at ETH $10,000.”\n\nBurniske says that ETH could hit his target in 2025.\n\nLooking at the broader crypto markets, Burniske believes that short-term pullbacks are possible, but he doesn’t think the asset class will witness steep drawdowns anytime soon.\n\n“Sure, we’ll get pullbacks, but if you’re waiting for mega-liquidation-based-capitulations like that, you’re gonna be waiting til after the next expansion.”\n\nHe also says the crypto markets are likely poised for a rally.\n\n“Loving how few people are bullish at the moment – 2022 trauma runs deep. See you higher sers and miladies.”\n\nAs for the recent enforcement actions against big players in the space like Binance, Burniske says the headlines are giving crypto free exposure.\n\n“The crackdown on crypto, while CBDCs [central bank digital currencies] get near prime time, is not a coincidence.\n\nBut antifragile systems will persist and flourish, so we can thank Uncle Sam for the free marketing.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/urzine/oneshot1"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLXNoYXBlbGxhLXVwZ3JhZGUtY2xvc2VzLWluLWV0aC1wcmljZS1zZXQtdG8tYmxlZWQtZXRoLW5ld3Mv0gFdaHR0cHM6Ly9jb2luZ2FwZS5jb20vZXRoZXJldW0tc2hhcGVsbGEtdXBncmFkZS1jbG9zZXMtaW4tZXRoLXByaWNlLXNldC10by1ibGVlZC1ldGgtbmV3cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Shapella Upgrade Closes In; ETH Price Set To Bleed? - CoinGape",
        "content": "Ethereum News: The Ethereum network is set to witness a much anticipated technical upgrade on April 12, 2023. The new development will allow the ETH holders/Users to withdraw their billion worth of Ethereum (ETH) tokens. However, On-Chain data shows that there is a decline in the deposit trend by the staking providers over the past week. It raises a crucial question here how do ETH holders’ action will impact the Ethereum price ahead?\n\nAlso Read: Cardano Whales Scoops 560 Million ADA; Something Big Coming Up?\n\nadvertisement\n\n$34 Billion Worth Of Ethereum Locked In\n\nThe cryptocurrency market is in a recovery phase for now. However, it is expected that the traders affected by the recent market downturn might seize the opportunity to withdraw their staked tokens.\n\nIntoTheBlock reported that the Shapella fork will enable Ethereum staked to be withdrawn by validators. This will allow $34 billion worth of locked ETH to enter the market. It mentioned that withdrawals of staked ETH will see a delay to be processed in order to mitigate an exodus and worse security for Ethereum. Read More Ethereum News Here…\n\nAlso Read: Binance Futures Users Affected; CZ Replies\n\nIt added that the partial withdrawals will take around 4 to 5 days, while, it is projected to take over 100 days for 1/3 of the full withdrawals to happen. This suggests that around $80 million to $100 million of Ethereum will be withdrawn daily if this happens.\n\nGlassnode reported a decline in deposit trends by staking providers. It mentioned a clear shift in deposits over time with Kraken, Binance, and Coinbase. However, Lido emerged as a winner defeating the three giants. Lido now continues to dominate deposit inflows.\n\nEthereum price has managed to surge by 33% over the past 30 days. ETH is trading at an average price of $1,857, at the press time. Its 24 hour trading volume is up by 7% to stand at $6 billion."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vbGVhcm4uYnliaXQuY29tL2FsdGNvaW5zL3RvcC1ldGhlcmV1bS1raWxsZXJzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Apr 2023 07:00:00 GMT",
        "title": "Top ETH Killers: What Are They & Where Are They Now? - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9hcy1wb2x5Z29uLXN1cnBhc3Nlcy1ldGhlcmV1bS1pbi10aGlzLW1ldHJpYy13aGVyZS1kb2VzLW1hdGljLXN0YW5kL9IBXmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9hcy1wb2x5Z29uLXN1cnBhc3Nlcy1ldGhlcmV1bS1pbi10aGlzLW1ldHJpYy13aGVyZS1kb2VzLW1hdGljLXN0YW5kL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Apr 2023 07:00:00 GMT",
        "title": "As Polygon surpasses Ethereum in this metric, where does MATIC stand - AMBCrypto News",
        "content": "Polygon outperformed Ethereum in terms of activity over the last 24 hours.\n\nHowever, TVL growth for Polygon remains low as DEX volume declined.\n\nPolygon [MATIC] has emerged as a prominent L2 solution in recent years, with several partnerships and an influx of NFT migrations contributing to its ability to remain competitive with other layer 2 solutions.\n\nRead Polygon’s [MATIC] Price Prediction 2023-2024\n\nAs per the data shared by Token Terminal, Polygon surpassed Ethereum [ETH] in daily active addresses owing to these factors. In the previous 24 hours, the count of daily active addresses on the Polygon network stood at 399,950, while Ethereum recorded 376,350 users.\n\nThe surge in activity on Polygon can be attributed to several factors, and one of them is the performance of its dApps. Notably, well-known dApps like Planet IX observed a significant increase in both active addresses and volume, with the latter rising by 15.29% in the last month.\n\nThe NFT market of Polygon also experienced a surge in interest, and this can be linked to the migration of y00ts NFT. After the transfer to the Polygon network, the y00ts NFT witnessed a notable rise in both volume and the count of holders.\n\nSince the migration started on 28 March, y00ts’ secondary sales saw $4.6M in volume from 1,043 sales, averaging $4,461 per sale.\n\nNot all roses and sunshine\n\nHowever, Polygon faced some challenges in the DeFi space, particularly in its DEX volume. Compared to other Layer 2 solutions, such as Arbitrum [ARB], Polygon’s DEX volume saw a significant decline. This had a knock-on effect on the total value locked (TVL) on the network, which also experienced a decrease.\n\nPolygon’s native token, MATIC, was also facing some setbacks. Santiment’s data revealed that the overall transaction count on the network saw a decline, and the price of MATIC dropped from $1.16 to $1.096 during this period.\n\nIs your portfolio green? Check the Polygon Profit Calculator\n\nDespite the price correction, there was a lack of interest in MATIC among new addresses, which was evident from the declining network growth.\n\nOnly time will tell whether Polygon’s surge in daily activity will have a positive impact on the price in the future."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNC8xMC90b3AtcGVyZm9ybWluZy10cmFkZXJzLXBvc2l0aW9uaW5nLXRoZW1zZWx2ZXMtbG9uZy1vbi1iaXRjb2luLWJ0Yy1hbmQtZXRoZXJldW0tZXRoLW9uLWNoYWluLWRhdGEv0gGGAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA0LzEwL3RvcC1wZXJmb3JtaW5nLXRyYWRlcnMtcG9zaXRpb25pbmctdGhlbXNlbHZlcy1sb25nLW9uLWJpdGNvaW4tYnRjLWFuZC1ldGhlcmV1bS1ldGgtb24tY2hhaW4tZGF0YS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Top Performing Traders Positioning Themselves Long on Bitcoin (BTC) and Ethereum (ETH): On-Chain Data - The Daily Hodl",
        "content": "The best-performing traders on decentralized exchange GMX are going long on Bitcoin (BTC) and Ethereum (ETH) while most of the market hesitates with uncertainty.\n\nAccording to blockchain tracking firm Lookonchain, three of the most profitable traders on GMX are currently long on BTC and ETH.\n\nLookonchain says one of the traders with a 70% win rate went long on Bitcoin at $28,000 and Ethereum just above $1860.\n\n“This trader earned $1,420,115 on GMX but he traded 78 times and won 55 times, with a winning rate of only 70.51%. He is currently long BTC and ETH with entry prices of $28,090 (BTC) and $1,861 (ETH) respectively.”\n\nThe firm says another high-performing trader positioned themselves long at similar price points.\n\n“This trader earned $1,380,206 on GMX but he traded 170 times and won 98 times, with a winning rate of only 57.65%.\n\nHe is currently long BTC and ETH with entry prices of $28,141 (BTC) and $1,859 (ETH) respectively.”\n\nA third trader with a fantastic 90% win rate, according to Lookonchain, went long on Ethereum at $1,888.\n\n“This trader has a very high win rate on GMX, traded 240 times, and won 216 times, with a win rate of 90%.\n\nHe made a total of $65,875 and currently long $ETH with an entry price of $1,888.”\n\nAt time of writing, Bitcoin is trading for $28,442 while Ethereum is priced at $1,860.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/FlashMovie"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1sYXllci0yLXByb3RvY29scy11bmRlci1zY3J1dGlueS1hbWlkLXJpc2luZy10cmFuc2FjdGlvbi1jb3N0cy1kZXRhaWxz0gFjaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtLWxheWVyLTItcHJvdG9jb2xzLXVuZGVyLXNjcnV0aW55LWFtaWQtcmlzaW5nLXRyYW5zYWN0aW9uLWNvc3RzLWRldGFpbHM_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Layer 2 Protocols Under Scrutiny Amid Rising Transaction Costs: Details - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe future of Ethereum as it relates to its scaling capabilities has been placed under deep scrutiny as the role of the growing horde of Layer 2 protocols in tapering down associated fees is being analyzed. According to data from L2Fees, the majority of L2 protocols have significantly lower fees associated with transfers and swaps of assets when compared with Ethereum's.\n\nAdvertisement\n\nPer the data, Loopring ranks as the cheapest platform to conduct transactions as the average cost to send Ethereum is pegged at $0.03, while swapping costs $0.05.\n\nArbitrum (ARB), Polygon's zkEVM and zkSync Era require 6 cents, 16 cents and 5 cents, respectively. While these protocols are notably more efficient, the fact that they are able to combine speed and low cost when compared to Ethereum has already positioned them as outfits with immense potential.\n\nImage Source: L2Fees.Info\n\nEthereum, despite its soaring gas fees, is still the most robust blockchain protocol in the world, though there has been an ongoing targeted rebrand in the network's features as a proof-of-stake (PoS) protocol. While a push to higher scalability is in the works, the best way to make use of the Ethereum protocol easily at this time is via the associated L2 protocol.\n\nAre L2s enough?\n\nThe majority of Layer 2 protocols out there make use of the Zero Knowledge Proof technology to verify transactions. zk-Proof, as it is fondly called, helps convey verification information faster in a way that frees up additional data that can drag down transaction processing.\n\nTo date, it is considered the most viable way to fully commercialize the Ethereum blockchain, as many transactions can be bundled and confirmed at the same time and for much less. While these technologies are still undergoing active development, they represent the best avenue to onboard the next billion users into the Ethereum ecosystem."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2V0aGVyZXVtLWJsb2NrLWV4cGxvcmVyLWV0aGVyc2Nhbi1hZGRzLWFudGktc2NhbS1mZWF0dXJlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Ethereum block explorer Etherscan adds anti-scam feature - CryptoSlate",
        "content": "Etherscan, a block explorer for the Ethereum blockchain, announced on April 10 a feature that is designed to prevent users from falling victim to scams.\n\nEtherscan to hide zero-value transfers\n\nEtherscan said that, in order to protect users from scams called address poisoning attacks, it will hide zero-value token transfers by default.\n\nWhile the site previously greyed out zero-value transactions, those transactions are now hidden entirely under the new feature, as seen below.\n\nDuring an address poisoning attack, a scammer creates a “spoofed” address that is nearly identical to one that their target has previously transacted with. The scammer then sends zero-value transfers from the spoofed address to the target’s address. The target may confuse the two similar addresses and direct funds to the spoofed address by mistake.\n\nBecause this approach depends on user error and is a type of phishing, hiding transactions that contain no value can make the scam far less alluring to its victims.\n\nEtherscan noted that preventing scams in a neutral manner is “an infinite cat-and-mouse game” and said that it recognized the value of “uncensored” blockchain records. As such, users will be able to toggle the option in settings, it said.\n\nEtherscan already includes other anti-scam features: for example, it flags addresses that are known to be involved in scams and hacks.\n\nZero-value attacks increasingly common\n\nThe type of scam in question has gained wider attention in the crypto industry. Two blockchain firms, X-explore and WuBlockchain, estimated that zero-value transfer phishing and related attacks have resulted in up to $32 million in thefts on Ethereum.\n\nCoinbase, meanwhile, suggested that this type of attack originated in November 2022 and had led to $19 million of thefts on various platforms by February 2023.\n\nThe Ethereum-focused wallet Metamask also warned of address poisoning scams in January 2023 and provided users with ways to protect themselves."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vdS50b2RheS9ieWJpdC1hZGRzLXN0YWtlZC1ldGhlci1zdGV0aC10by11bmlmaWVkLXRyYWRpbmctYWNjb3VudC1hcy1zaGFwZWxsYS11cGdyYWRlLWFwcHJvYWNoZXPSAWtodHRwczovL3UudG9kYXkvYnliaXQtYWRkcy1zdGFrZWQtZXRoZXItc3RldGgtdG8tdW5pZmllZC10cmFkaW5nLWFjY291bnQtYXMtc2hhcGVsbGEtdXBncmFkZS1hcHByb2FjaGVzP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Bybit Adds Staked Ether (stETH) to Unified Trading Account as Shapella Upgrade Approaches - U.Today",
        "content": "Advertisement\n\nAs the global cryptocurrency community is waiting for the mainnet activation of Shapella upgrade on Ethereum (ETH) network, top-tier CEX Bybit adds a new feature that is a crucial one for stakers.\n\nBybit adds stETH to Unified Trading Account\n\nAccording to a statement shared by the team of Bybit exchange, the final stage of Staked Ether (stETH) integration into Unified Trading Account has been concluded. Not all users can seamlessly mint Staked Ether (stETH) on Bybit Earn or buy it on a spot market module.\n\nDive into Bybit’s reward pools and grab your share of rewards! #ICMYI: Celebrate #Ethereum Shanghai Upgrades with us, P2P Egg-Celent Easter and many more events to participate in!\n\n\n\nRead more: https://t.co/y8nsw1blne#Bybit #TheCryptoArk pic.twitter.com/JjYRfxbgFW — Bybit (@Bybit_Official) April 10, 2023\n\nThen, immediately upon minting, Staked Ether (stETH) can be used as collateral in Unified Trading Account (UTA), an out-of-the-box trading module for Bybit users.\n\nAs such, Bybit is aiming to be the first cryptocurrency exchange to allow its traders to leverage Staked Ether (stETH) in margin trading. This makes liquidity usage on the platform more resource-efficient.\n\nBen Zhou, co-founder and CEO at Bybit, is excited by the opportunities this integration unlocks for all traders and ETH stakers on the platform:\n\nWe are excited to offer a new way for our users to make the most from their ETH investments. By combining two powerful features — ETH staking and UTA — into one product, we are creating an entirely new experience, which allows our users to enjoy capital efficiency and trade without missing out on the opportunity to earn yield.\n\nAs covered by U.Today previously, Bybit's UTA is among the most notable accomplishments in the CEX segment in Q1, 2023.\n\nStreamlined Ethereum (ETH) staking for Bybit users ahead of Shapella\n\nWith new functions by Bybit, Ethereum (ETH) stakers on the platform can significantly improve the logics of their operations. They do not need to withdraw Ethers (ETH) from staking modules any longer in order to increase the size of their portfolio.\n\nTypically, Ethereum (ETH) staking with such modules results in 3-4% in APR.\n\nEthereum's Shapella upgrade is the most anticipated release on the Ethereum (ETH) scene since The Merge. It is set to allow ETH unstaking from deposit contracts."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldmVuLWFzLWV0aC0yLTAtZGVwb3NpdC1jb250cmFjdHMtc3VyZ2Utd2h5LWFyZS1pbnZlc3RvcnMtb24tdGhlLXNpZGVsaW5lcy_SAWVodHRwczovL2FtYmNyeXB0by5jb20vZXZlbi1hcy1ldGgtMi0wLWRlcG9zaXQtY29udHJhY3RzLXN1cmdlLXdoeS1hcmUtaW52ZXN0b3JzLW9uLXRoZS1zaWRlbGluZXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Even as ETH 2.0 deposit contracts surge, why are investors on the sidelines - AMBCrypto News",
        "content": "ETH is winning on the staking side, but other metrics underline lower network activity.\n\nDemand slows down limiting ETH’s potential upside.\n\nInvestors keeping a close eye on Ethereum [ETH] may have noticed that investor interest was limited despite the hype surrounding the Shanghai upgrade. Meanwhile, at press time, some network developments underpinned substantial activity in its preparation.\n\nIs your portfolio green? Check out the Ethereum Profit Calculator\n\nAccording to 9 April’s Glassnode data, the amount of liquidity locked in ETH 2.0 deposit contracts has not only been rising but is at a new ATH. Such an observation would normally be associated with more confidence in the market, and also in line with a major development.\n\n? #Ethereum $ETH Total Value in the ETH 2.0 Deposit Contract just reached an ATH of 17,330,295 ETH View metric:https://t.co/SzbMPqvhlb pic.twitter.com/d5o6D7bFpX — glassnode alerts (@glassnodealerts) April 9, 2023\n\nThe timing of the growth in ETH 2.0 deposit contracts suggests that it might be heavily influenced by the countdown to the Shanghai upgrade. One potential reason for this is that ETH holders are locking their ETH on staking facilities so that they can earn passive rewards. Is this is in anticipation of increasing trading activities near, during, and after the upgrade? Not really, according to these metrics.\n\nEthereum network activity slows down\n\nETH’s daily active addresses have been declining, and at press time, were down to their lowest in the last seven days. This translates to lower transactions and thus, lower gas fees. It is therefore no surprise that ETH gas fees have also been at their lowest level in the last four weeks.\n\nLower gas fees, despite growing ETH 2.0 deposit contracts, may indicate a lack of organic growth underpinned by lower transactions. This meant that at press time, there was low demand for ETH. Higher gas fees are usually observed in times of strong network growth and usage, as network participants were willing to pay a premium under such conditions.\n\nActive deposits have also slowed down in the last few days, in line with the above observations. Therefore, Ethereum experienced negative network growth, especially in the last seven days. Its network growth metric fell to the lowest weekly level in the last 24 hours at press time.\n\nHow much are 1,10,100 ETHs worth today?\n\nETH enthusiasm thwarted\n\nThe declining network activity, despite a surge in ETH 2.0 deposits, reflected ETH’s price action. It closed last week on a net gain thanks to a strong bullish performance in the first half of the week. However, a mid-week pivot followed by a 5.6% correction to its $1838 press time ensured that most of retail buyers during the week got trapped.\n\nDespite the mid-week retracement, there was some excitement that fueled the rally at the start of the week. This was enough for a new YTD high as the price drew closer to the highly coveted $2000 price level. However, the second half ultimately revealed the state of low demand."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zeW1iaW9zaXMtaW50ZWdyYXRlcy16a3N5bmMtbmF0dXJhbC1ldm9sdXRpb24tb2Ytc2NhbGluZy1zb2x1dGlvbnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Symbiosis integrates zkSync: 'Natural evolution' of scaling solutions - Cointelegraph",
        "content": "Cross-chain automated marker maker Symbiosis has onboarded layer-2 scaling protocol zkSync to improve speed and reduce fees of token swaps on its platform.\n\nThe decentralized exchange (DEX) was launched in March 2022. It provides single-sided stablecoin pools that deliver zero impermanent loss to liquid providers. It also facilitates “any-to-any” native asset swaps on its platform across Ethereum Virtual Machine (EVM) and non-EVM networks.\n\nNick Avramov, a co-founder of Symbiosis, told Cointelegraph that the integration of zkSync will provide one-click swaps from Ethereum, Polygon, Avalanche, BNB Chain, Telos and other blockchains to zkSync and back.\n\nThe additional functionality also removes the need for users to switch between different wallets and interfaces. Avramov also confirmed that the integration improves the variety of token swaps through its DEX, supporting any-to-any native swaps to and from zkSync.\n\nRelated: ConsenSys zkEVM set for public testnet to deliver secure settlements on Ethereum\n\nThe integration of zkSync is also aimed at making liquidity transition to and from zkSync “secure, fast and cheap.” Avramov highlighted the importance of layer-2 scaling protocols to various decentralized finance (DeFi) platforms and services.\n\n“Scaling layers like Optimistic and ZK-rollups are extremely important for the next big wave in Web3, mostly because they’re lowering entry barriers both in terms of the price per swap and user experience of value-added services built on top.”\n\nThe Symbiosis co-founder also highlighted his personal view that zero-knowledge rollups could outcompete Optimistic Rollup solutions like Arbitrum and Optimism. Avramov also believes it is crucial for cross-chain players and interoperability layers to support zero-knowledge solutions as soon as possible.\n\n“ZK represents an inevitable and natural evolution among scaling solutions.”\n\nSymbiosis has processed over $100 million in total transaction volume in stablecoins, serves over 12,000 unique wallet addresses, and has an average of 3,000 daily transactions.\n\nEthereum-scaling ZK-rollups continue to grab headlines in 2023. As previously reported by Cointelegraph, Ethereum layer-2 scaling platform Polygon released its zkEVM to mainnet beta, allowing developers to deploy smart contracts with increased finality and lower costs.\n\nThe scaling technology is not only limited to Ethereum or other smart contract blockchains. Swiss-based nonprofit ZeroSync Association is currently developing zero-knowledge proof tools that will allow Bitcoin (BTC) users to expedite the process of verifying individual blocks and, eventually, the entire blockchain.\n\nMagazine: Crypto audits and bug bounties are broken: Here’s how to fix them"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMipAFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9ldGhlcmV1bXMtcmVjb2duaXRpb24tYXMtYS1jb21tb2RpdHktYm9vc3RzLWJ1bGxpc2gtbWFya2V0LWFsb25nc2lkZS1iaXRjb2luLWRvZ2V0dGktbWVtZS1jb2lucy1wcmVzYWxlLWV4cGVyaWVuY2VzLXN1cmdpbmctZGVtYW5kL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Ethereum's Recognition as a Commodity Boosts Bullish Market Alongside Bitcoin, Dogetti Meme Coin's Presale ... - Analytics Insight",
        "content": "Disclaimer: Any financial and crypto market information given on Analytics Insight are sponsored articles, written for informational purpose only and is not an investment advice. The readers are further advised that Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Conduct your own research by contacting financial experts before making any investment decisions. The decision to read hereinafter is purely a matter of choice and shall be construed as an express undertaking/guarantee in favour of Analytics Insight of being absolved from any/ all potential legal action, or enforceable claims. We do not represent nor own any cryptocurrency, any complaints, abuse or concerns with regards to the information provided shall be immediately informed here."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY3J5cHRvdGlja2VyLmlvL2VuL2NvbXBhcmluZy1ldGhlcmV1bXMtbGF5ZXItMi1zb2x1dGlvbnMtemtzeW5jLWFyYml0cnVtLWFuZC1vcHRpbWlzbS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Comparing Ethereum's Layer 2 Solutions: A Look at zkSync, Arbitrum, and Optimism - CryptoTicker.io - Bitcoin Price, Ethereum Price & Crypto News",
        "content": "Ethereum has been facing scalability issues, high gas fees, and network congestion. To address these problems, several projects are developing layer 2 solutions that aim to improve the performance and user experience of Ethereum without compromising its security and decentralization. Three of the most prominent layer 2 solutions are zkSync, Arbitrum, and Optimism. In this article, we will compare these solutions in terms of their advantages, disadvantages, and overall performance.\n\nzkSync:\n\nzkSync is a layer-2 scaling solution for Ethereum that uses zero-knowledge proofs to enable fast and cheap transactions without compromising security or decentralization. zkSync aims to bring the benefits of blockchain technology to mainstream users by providing a user-friendly interface, low fees, high throughput, and privacy guarantees. zkSync supports smart contracts, NFTs, and various tokens, and is compatible with the Ethereum Virtual Machine (EVM). zkSync also offers a developer-friendly environment with SDKs, APIs, and documentation to help developers build and deploy scalable applications on zkSync.\n\nAdvantages:\n\nzkSync can reduce the amount of data that needs to be stored on Ethereum, which lowers the gas costs and increases the throughput.\n\nzkSync can achieve up to 2000 TPS and sub-cent fees per transaction.\n\nzkSync supports smart contracts written in Solidity.\n\nDisadvantages:\n\nzkSync relies heavily on ZKPs, which can be complex and expensive to implement.\n\nzkSync may face issues with privacy and data availability.\n\nArbitrum:\n\nArbitrum is a layer-2 blockchain for Ethereum using optimistic rollups as scaling technology. It processes transactions on its proprietary sidechain and relays the new chain state to the Ethereum mainnet. Arbitrum aims to improve Ethereum’s performance by providing a more efficient and scalable environment for decentralized applications and smart contracts. Arbitrum benefits from the security and compatibility of Ethereum, but reduces the fees and congestion that users face on the mainnet. Arbitrum has attracted many developers and projects to its ecosystem, and has launched its own token, ARB, which is used for governance and incentives.\n\nAdvantages:\n\nArbitrum can reduce the amount of computation that needs to be done on Ethereum, which lowers the gas costs and increases the throughput.\n\nArbitrum can achieve up to 4500 TPS and sub-dollar fees per transaction.\n\nArbitrum supports smart contracts written in Solidity or any other language that compiles to EVM bytecode.\n\nDisadvantages:\n\nArbitrum may face issues with data availability and security.\n\nArbitrum’s challenge period can be up to one week, which can lead to slower finality and higher latency.\n\nOptimism:\n\nOptimism is a layer-2 scaling protocol for the Ethereum network. The scaling solution works by moving transactions and computations from layer-1 (L1) onto a second layer, thus reducing transaction fees and increasing network throughput. Optimism is compatible with the Ethereum Virtual Machine (EVM), which means that any smart contract or decentralized application (dApp) that runs on Ethereum can also run on Optimism with minimal changes. Optimism uses a technique called optimistic rollups, which are batches of transactions that are executed on the second layer and periodically posted to the main chain. Optimism also employs a fraud-proof system, which allows anyone to challenge an invalid transaction and revert it if proven wrong.\n\nAdvantages:\n\nOptimism’s OVM is compatible with EVM, making it easier for developers to write smart contracts.\n\nOptimism has a shorter challenge period than Arbitrum, which leads to faster finality and lower latency.\n\nOptimism can achieve up to 1000 TPS and sub-dollar fees per transaction.\n\nDisadvantages:\n\nOptimism’s OVM removes some opcodes that are not necessary for layer 2 execution, which may limit its functionality.\n\nOptimism may face trade-offs in terms of security due to its design choices.\n\nConclusion\n\nAt the end of the day, it’s clear that zkSync, Arbitrum, and Optimism are all promising solutions for Ethereum’s scalability and cost issues. Each one has its own unique features and drawbacks, so it really depends on what the user is looking for.\n\nIt’s pretty impressive how the Ethereum community is constantly finding ways to improve the platform’s performance and user experience, while still keeping its core values of security and decentralization intact. As Ethereum continues to evolve, we’re excited to see what new developments will come up in the world of layer 2 solutions. Who knows what the future of decentralized finance and other Ethereum-based applications will look like!\n\nMore from DeFi"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vaW52ZXN0b3JwbGFjZS5jb20vMjAyMy8wNC8xNS1jcnlwdG9zLXRvLWJ1eS1pZi15b3Utd2FudC10by1iZS1maWx0aHktcmljaC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Apr 2023 07:00:00 GMT",
        "title": "15 Cryptos to Buy If You Want to Be Filthy Rich - InvestorPlace",
        "content": "Tune in Wednesday, March 13th at exactly 1 PM ET for Louis’ Emergency Briefing and receive his #1 stock pick for 2024 FREE."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZGFpbHljb2luLmNvbS9kaWZmZXJlbmNlcy1iZXR3ZWVuLWJsb2NrY2hhaW4taGFyZC1mb3Jrcy1hbmQtc29mdC1mb3Jrcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Apr 2023 07:00:00 GMT",
        "title": "Forks in Crypto: Hard Forks vs Soft Forks - DailyCoin",
        "content": "Forks in Crypto are a perfect example of decentralization in action. The beauty of open-source, decentralized blockchain protocols is that anyone can suggest new rules and functionalities that improve the network.\n\nDespite blockchain forks having existed for years, there’s still plenty of confusion around what they are and how they work. Key milestones like Cardano’s (ADA) Vasil upgrade or Ethereum’s (ETH) Merge are much more than catchy names, they’re hard forks that improve the chain with new features.\n\nWhy do cryptocurrency forks happen and what do they mean for a blockchain network? What are the different kinds of blockchain forks and are they always for the best of the ecosystem?\n\nWhat is a Fork in Cryptocurrency?\n\nAs we all know, a blockchain network is a chain of data interconnected by units called blocks. When new blocks are created, they reference the data and events of previous blocks, which is why we can trace every transaction on the Bitcoin network right back to its genesis.\n\nWhen a blockchain fork occurs, it creates a permanent divergence from the network’s latest version. Like branches on a tree, a blockchain split causes a new version of the network to run, often with new features and new rules, like a change in block size.\n\nThis process is called forking and essentially creates a new blockchain without changing the old version of the blockchain. In most cases, the new chain benefits from software upgrades voted in by community members.\n\nWhy Do Forks Happen?\n\nForks in crypto help blockchain networks improve. For example, the Alonzo hard fork introduced smart contracts to the Cardano blockchain. Ethereum’s iconic hard fork, ‘The Merge,’ transitioned the network to a Proof-of-Stake algorithm, making it more scalable and energy efficient.\n\nOf course, not all forks stand the test of time and fulfill their vision of becoming new and improved versions of old chains. Bitcoin forks, despite being cheaper and more efficient networks, were never able to usurp Satoshi Nakamoto’s original and become the world’s largest cryptocurrency.\n\nJust like in your kitchen drawer, not all blockchain forks are created equal. Let’s take a look at what types of forks exist and how they’re different.\n\nThe Different Types of Blockchain Forks\n\nThere are two primary kinds of forks in the crypto world. In most cases, blockchain forks are recognized as either hard forks or soft forks. Both varieties serve the same purpose but have slight differences.\n\nAn easy way to understand the difference between hard forks and soft forks is to imagine upgrading your computer. In this example, a soft fork is like installing new software like an updated operating system. On the other hand, a hard fork is like replacing your computer entirely.\n\nHard Forks\n\nIn a hard fork, a significant upgrade means that the network effectively splits into two separate chains. Changes to the blockchain protocol are not backward-compatible, meaning that the new chain will not recognize the old chain. Node operators need to upgrade their software, or else the network won’t recognize their new blocks.\n\nWhen this happens, node operators and community members need to make an important decision. Will they continue to use the updated software protocols of the new chain? Or would they rather stick to the old rules and the previous version of the software?\n\nIf there is enough community support for the old chain and the old rules, the pre-fork chain may continue to exist. This is why we still have networks like Ethereum Classic.\n\nIf a hard fork creates a new chain that means it also creates a new coin. Because a fork is a split of an existing chain, you can usually expect to have new cryptocurrency tokens. For example, if you held 1 Ether during The Merge, you would also have 1 Ether on the Ethereum PoW chain that still exists alongside the new Ethereum PoS chain.\n\nSoft Forks\n\nA soft fork occurs when changes occur to the network, but nodes and miners aren’t required to upgrade themselves to continue participating in the blockchain. These nodes can still create new blocks under the new rules.\n\nIn blockchain technology, a soft fork is like a light software update. Any new blocks still recognize the existing network and node operators, so it doesn’t force a blockchain split and result in a new blockchain.\n\nDeFi Application Forks\n\nIf you have any experience in the wild world of decentralized finance, you’ve probably heard the word ‘fork’ mentioned in a slightly different way. DeFi application forks are essentially copies of existing platforms and smart contracts that might feature slight alterations.\n\nTo give you an example, think of the UniSwap decentralized exchange. The project is completely open source, so anyone can dive into the application’s source code to see how it works. As more blockchain networks, like BNB Chain and Polygon, emerged, these networks needed their own DEXes for users to trade tokens on.\n\nInstead of building new apps and code from scratch, it’s much easier to simply copy, or ‘fork’ an existing platform that works well. If you check the source code for QuickSwap, the leading DEX on Polygon, you’ll see that all its basic code and functionality are directly copied from UniSwap’s code.\n\nForking dApps is a common practice in the DeFi world. A comprehensive list of crypto projects created from forks is available on DefiLlama.\n\nHistoric Blockchain Forks\n\nCrypto history is full of crucial forks that have helped blockchain protocols address dangerous security issues and improve the most popular networks. Some of these hard forks have resulted in new coins that have held their position in the Top 100 cryptos by market cap for years on end.\n\nEven Dogecoin (DOGE), the most famous meme coin in the crypto market, was born from a fork of other networks. The Dogecoin blockchain was forked from LuckyCoin, which was in turn a Litecoin fork.\n\nBitcoin (BTC) Forks\n\nThe Bitcoin blockchain is the oldest and best-known cryptocurrency network in the world. Naturally, many developers have tried to fork Bitcoin and create new and improved networks.\n\nBitcoin Cash\n\nIn August 2017, Bitcoin Cash (BCH) made history by becoming the first-ever fork of the Bitcoin blockchain. Like the original Bitcoin, BCH has a maximum supply of 21,000,000 coins.\n\nBitcoin Cash features a larger block size, meaning that the network can process more transactions per second than the original Bitcoin network. It’s also cheaper to use, with lower transaction fees.\n\nThis Bitcoin fork is also called the SegWit upgrade, named after the initial proposal that eventually resulted in the Bitcoin Cash hard fork.\n\nBitcoin Gold\n\nAnother fork of the world’s first cryptocurrency, Bitcoin Gold aims to provide a more scalable alternative to Bitcoin as a payment network. Bitcoin Gold’s vision was to make Bitcoin mining accessible to everyone. The forked network used common GPUs to mine new coins, instead of Bitcoin’s competitive and intensive ASIC mining rigs.\n\nUltimately, Bitcoin Gold was more of a passion project than a genuine competitor. Its community appears to have abandoned the network. There have been no updates to the Bitcoin Gold site since 2021.\n\nEthereum Forks\n\nThe Ethereum blockchain has certainly witnessed a messy history, but you don’t become the future of finance without overcoming some challenges along the way. Fortunately, the Ethereum community is resilient, as proven through several significant hard forks throughout the network’s lifespan.\n\nEthereum Classic\n\nThe story of Ethereum Classic is an essential part of crypto history. It involves a historic hack worth hundreds of millions and a ‘gross misuse’ of blockchain technology from Vitalik Buterin and the Ethereum community.\n\nThe DAO was an investment group created in the early days of the Ethereum blockchain. In 2016, the DAO successfully raised over 150 million dollars worth of ETH, with the intention of becoming a venture capitalist firm in the emerging DeFi space.\n\nWhen hackers found a smart contract exploit in the DAO’s wallet, they were able to siphon over $60 million in Ether, giving the hackers an enormous stake in the network and raising concern over whether the network was truly usable. At the time, the DAO held over 14% of all circulating ETH.\n\nAfter much negotiating between Vitalik Buterin, the Ethereum community, and the hackers themselves, it was eventually decided that a network hard fork could kickstart a new network from before the hack occurred, returning funds to investors and rewriting Ethereum’s history.\n\nThis was an extremely controversial decision. It went against all the principles of blockchain technology, such as decentralization and immutable transactions. The Ethereum community was split in two; those who agreed with the hard fork proposal and those who did not.\n\nThe Ethereum blockchain we know and love today is the new chain created from this historic hard fork. The old chain, whose community did not accept the display of power and control, is now called Ethereum Classic.\n\nEthereum POW (Proof-of-Work)\n\nIn late 2022, the Ethereum blockchain finally completed its long-awaited migration to a Proof-of-Stake consensus mechanism. This new chain was the result of years of work and reduces Ethereum’s annual energy consumption by as much as 99%.\n\nEthereum miners who were against The Merge hard-forked the old chain and created Proof-of-Work Ethereum. The Ethereum PoW functions just like the normal Ethereum blockchain did pre-merge. However, the new coin, ETHPOW has little demand and the network doesn’t see much user traffic.\n\nOn the Flipside\n\nForks in crypto are essential processes that improve blockchain networks and help drive progress in the industry. However, they do pose security risks if poorly executed.\n\nWhy You Should Care\n\nHard fork events like The Merge, the Alonzo upgrade and the Shanghai update are crucial moments in blockchain evolution. Being informed about the processes involved can help you prepare for potential outcomes and help you better understand blockchain technology.\n\nFAQs"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiMGh0dHBzOi8vYml0Y29pbmtlLmlvLzIwMjMvMDQvaW50cm9kdWNpbmctemstZXZtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "MILESTONE: The Polygon ZK-EVM Can Now Scale Ethereum Infinitely, Says Polygon - bitcoinke.io",
        "content": "Polygon Labs, the Ethereum Layer 2 scaling solution, has launched Polygon zkEVM Mainnet, termed as an Ethereum scaling breakthrough that will make it possible for Ethereum to outpace Visa in terms of transaction throughput.\n\nToday, Polygon Labs is announcing that Polygon zkEVM is fully open-source. Every single component is licensed with AGPL v3, including the zkProver, which is where all of the ZK magic happens 🪄 More: https://t.co/H124ATcuWJ pic.twitter.com/adceTbOVMq — Polygon (Labs) (@0xPolygonLabs) March 27, 2023\n\nIn what Polygon Labs describes as a watershed moment for the Web3 industry, the launch of the zkEVM solution presents a resolution to the scaling problems such as lack of speed and throughput.\n\n“This solution has the capability to scale Ethereum infinitely, allowing the network to surpass the transaction throughput of major payment processors such as Visa,” said Polygon in a release.\n\nThe launch on mainnet comes almost a year since the zkEVM was first introduced in a testnet back in July 2022.\n\nzkEVMs, which are ZK rollups designed for compatibility with the Ethereum Virtual Machine, are considered the holy grail of scaling technology.\n\n“They are the only solution that can achieve three major blockchain design goals: scalability, security that is inherited directly from Ethereum itself, and a seamless experience for developers building on Ethereum.”\n\nZero-knowledge rollups (ZK-rollups) themselves are layer 2 protocols that bundle (or ‘roll-up’) hundreds of transfers off-chain and generate a cryptographic proof (or validity prooof) which gets posted on L1 drastically simplifying the process.\n\nPolygon Labs also announced that all aspects of Polygon zkEVM are now open-source under an AGPL v3 license. Open-source licenses allow developers to share their code and encourage collaboration and innovation within the developer community.\n\nAccording to Polygon, over 50 of the world’s biggest Web2 and Web3 companies have committed to building on Polygon zkEVM, including Spanish telecom giant, Telefónica, which will use the tech to improve the privacy and confidentiality of company data in enterprise use cases.\n\nJose Luis Nuñez, Head of Blockchain at Telefónica Tech said:\n\nTelefónica Tech, leading company in digital transformation, and leaders in the development of blockchain solutions for enterprises, will be one of the first companies to deploy its framework, TrustOS, for notarisation and traceability solutions on top of the zkEVM Mainnet to improve privacy and confidentiality of companies and user’s data in enterprise use cases.\n\nOther platforms adopting the zkEVM include:\n\nLens\n\nAavegotch i\n\nOvix\n\nQuickswap\n\nEtherScan\n\nPhantom\n\nMidnight Society\n\nLuganodes\n\nCeler\n\nGameSwift\n\nYeeha Games\n\nWhile several teams in the Web3 community are working on ZK rollups, Polygon indicates it has several advantages, not least being the first to launch a beta version on mainnet:\n\nIt is the only leading full-featured, open-source zkEVM with a complete, working, and audited prover\n\nIt’s EVM-equivalent, meaning existing developer tools on Ethereum, existing wallets, infrastructure, etc., can be used seamlessly, unlike ‘EVM-compatible’ alternatives, which require existing developer tools and smart contracts to be modified to work creating incompatibility and increasing the risk of security vulnerabilities\n\nWithdrawal times back to Ethereum take 30 – 60 minutes on Polygon zkEVM compared to a 24-hour withdrawal delay for zkSync Era, for example\n\nPolygon is the first to launch a mainnet beta making it the most advanced solution available. Alpha mainnets test basic functionality in a closed environment while beta mainnets are more stable and feature-rich\n\n“Today’s launch is an incredible milestone and the beginning of a new chapter for blockchain technology, fulfilling Ethereum’s original promise of becoming a true ‘world computer’ and creating a fairer, more egalitarian internet for all” said Mihailo Bjelic, Co-Founder of Polygon.\n\n_________________________________________\n\nFollow us on Twitter for the latest posts and updates\n\nJoin and interact with our Telegram community\n\n_________________________________________\n\n_________________________________________"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL3RlY2hwb2ludC5hZnJpY2EvMjAyMy8wNC8xMC9iaXRjb2luLWJ0Yy1hbmQtZXRoZXJldW0tZXRoLXByaWNlcy10cmFkZS1mbGF0LWNvbGxhdGVyYWwtbmV0d29yay1jb2x0LWZvcmVjYXN0ZWQtZm9yLTM1MDAtcHJlc2FsZS1yZXR1cm5zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC) and Ethereum (ETH) prices trade flat, Collateral Network (COLT) forecasted for 3500% presale returns - Techpoint Africa",
        "content": "Investors who understand the workings of market cycles within crypto will be more profitable than those who do not. Bitcoin (BTC) and Ethereum (ETH) prices have been trading flat after recent rallies, which means only one thing, altcoin season has begun. New projects have huge potential to rip, and one, Collateral Network (COLT), has already been forecast to gain 3,500% in its presale.\n\n>>BUY COLT TOKENS NOW<<\n\n\n\nBitcoin (BTC)\n\n\n\nBitcoin (BTC) has thrived in the past months as the failings of fractional reserve banking have been highlighted to the world. With decreasing confidence in the dollar, more and more people have begun to look to Bitcoin (BTC). This application-specific hard money may unseat gold as the world’s reserve currency in the coming decade.\n\n\n\nBitcoin (BTC) began in 2009 following the global financial crisis, and the same landscape which birthed Bitcoin (BTC) is helping it gain traction currently. Bitcoin (BTC), after surging upwards, has stalled as money floods into altcoins such as Collateral Network (COLT), and investors would be wise to rotate. Price predictions from analysts vary enormously, with some predicting that Bitcoin (BTC) will trade as high as $180,000 in 2025, whereas more conservative estimates put Bitcoin (BTC) trading between $77,000 and $92,000 in 2025.\n\n\n\n\n\n\n\nEthereum (ETH)\n\nWith the Shanghai upgrade for Ethereum (ETH) scheduled on the 12th of April, many investors have grown increasingly cautious about holding Ethereum (ETH). The Shanghai upgrade will enable Ethereum (ETH) staking withdrawals, and analysts predict that Ethereum (ETH) withdrawals will unleash heavy sell pressure.\n\n\n\nHowever, more bullish analysts and capital fund managers such as Chris Burnisky predict that Ethereum (ETH) withdrawals going live with lead to a greater influx of staked Ethereum (ETH). Regardless of the upgrade, traders should be cautious and, instead of holding Ethereum (ETH), should take advantage of altcoin season and projects like Collateral Network (COLT), which continue to rip to the upside.\n\n>>BUY COLT TOKENS NOW<<\n\n\n\nCollateral Network (COLT)\n\n\n\nCollateral Network (COLT) has generated a buzz not seen in the crypto landscape for a long time. This challenger lender unlocks liquidity for real-world assets. The growth and integration of real-world assets into DeFi have been an expected growth driver amongst venture-capital firms for several months. Collateral Network (COLT) makes this possible through its use of 100% asset-backed NFTs.\n\n\n\nAsset owners can collateralize their assets with Collateral Network (COLT), anything from real estate and vintage cars to fine art and luxury watches. Collateral Network (COLT) mints an NFT 100% backed by the asset, which then becomes liquid. The holder can access the crowdsourced liquidity through fractionalizing the NFT.\n\n\n\nThe COLT token powers this entire ecosystem and grants discounts to borrowers and lenders, and also enables access to the auction where distressed assets will be sold off. On top of this, it can be staked for passive income, making it a DeFi token with excellent utility cases.\n\n\n\nCollateral Network (COLT) aggressively expands liquidity flows and lending potential within DeFi. For this reason, analysts have already forecast a 3,500% growth in its presale. Still, many expect it will rally much harder when it launches on centralized exchanges, and early holders could see a 100X on their initial investment.\n\n\n\n\n\nFind out more about the Collateral Network presale here:\n\nWebsite: https://www.collateralnetwork.io/\n\nPresale: https://app.collateralnetwork.io/register\n\nTelegram: https://t.me/collateralnwk\n\nTwitter: https://twitter.com/Collateralnwk"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMimAFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9ldGhlcmV1bXMtY29tbW9kaXR5LXN0YXR1cy1saWtlLWJpdGNvaW4tc3BhcmtzLWJ1bGxpc2gtbWFya2V0LWRvZ2V0dGktbWVtZS1jb2luLXByZS1zYWxlLXdpdG5lc3Nlcy1za3lyb2NrZXRpbmctZGVtYW5kL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Apr 2023 07:00:00 GMT",
        "title": "Ethereum's Commodity Status Like Bitcoin Sparks Bullish Market, Dogetti Meme Coin Pre-Sale Witnesses Skyrocketing ... - Analytics Insight",
        "content": "Bitcoin (BTC) has reversed its downward trend and regained momentum, while Ethereum (ETH) has outperformed BTC, rising by more than 4%. This upward rally in the cryptocurrency market is attributed to several factors, including an increase in consumer confidence in March, recent advancements in the cryptocurrency industry, and Bitcoin’s reputation as a safe-haven asset. Additionally, consumers are losing trust in traditional banks following recent bank collapses, which is considered a key factor in the Bitcoin price increase.\n\nEthereum Now Recognised As A Commodity Like Bitcoin\n\nThe crypto market cap has risen by 2.56% to $1.16 trillion, with Bitcoin and ETH leading the charge. The head of the US CFTC has reiterated that Ether is a commodity, not a security, which could boost its value. Ethereum’s current price is $1,807.78, with a 24-hour trading volume of $7,635,430,660. It is likely to find an immediate resistance at $1,850, and a bullish breakout above this level could raise the price on to the next resistance level of $1,960.\n\nThe CFTC (Commodities Futures Trading Commission) has acknowledged Ethereum (ETH) and Litecoin (LTC) as commodities, similar to Bitcoin (BTC). This means that both of these altcoins are now considered trading assets, like gold or oil. The CFTC made this statement as part of an investigation into Binance, a popular cryptocurrency exchange. This development is likely to have a positive impact on BTC and ETH prices, as it verifies their commodity status, potentially enhancing their legitimacy and adoption in traditional financial markets. It could also lead to increased regulatory oversight and institutional investor approval.\n\nBitcoin Hitting Bull Market\n\nRecent strong predictions regarding Bitcoin’s future are also contributing to the rise in BTC prices. For instance, former Coinbase technical director Balaji Srinivasan has bet $2 million that bitcoin would reach $1 million in value within 90 days, implying that the value of Bitcoin will increase sharply in the near-term future. Marshall Beard, the Chief Strategy Officer of Gemini, an American-based cryptocurrency exchange, is more cautious and interested, estimating that Bitcoin will hit $100,000 this year. These forecasts are being influenced by several factors, including the growing adoption of cryptocurrencies by institutional investors, which may increase demand for Bitcoin and ultimately its price.\n\nAs of this writing, Bitcoin’s price is $28,259.78, and its 24-hour trading volume is $16.5 billion. A breakout above this level could potentially push Bitcoin’s price toward the next resistance level of $28,900. The bullish potential for Bitcoin is also supported by the violated downward trendline.\n\nDogetti Strives To Be The Top Dog Coin\n\nDogetti (DETI) is one of the new altcoins that has caught the attention of investors in the meme coin cryptocurrency space. Unlike traditional cryptocurrencies, meme coins are designed to be fun and engaging while providing investors with an opportunity to make a profit.\n\nThe Dogetti (DETI) team values community and aims to provide a healthy income for all investors. Dogetti NFTs are a fun way to interact with other DETI holders besides generating a steady stream of income. These NFTs are modelled after canine companions and can be bought, sold, and traded for $DETI. In the future, the platform plans to allow Dogetti NFTs to reproduce, which would result in more NFTs and more funds for investors.\n\nInvestors who want to get in on the ground floor of this exciting altcoin can participate in Dogetti’s presale. This presale offers investors the opportunity to purchase $DETI tokens before the official launch, giving them a chance to make a profit if the coin’s value increases. The presale also offers various bonuses and incentives to investors who participate, making it an attractive opportunity for those who believe in Dogetti’s potential.\n\nFor more information about Dogetti (DETI):\n\nPresale: https://dogetti.io/how-to-buy\n\nWebsite: https://dogetti.io/\n\nTelegram: https://t.me/Dogetti\n\nTwitter: https://twitter.com/_Dogetti_\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9hcmJpdHJ1bS1lY29zeXN0ZW0taXMtdGhlLXNvbHV0aW9uLXRvLWFsbC15b3VyLWV0aGVyZXVtLXdvZXMtYmlnLWV5ZXMtY29pbi1raWxscy1lbS13aXRoLWN1dGVuZXNzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Arbitrum Ecosystem Is The Solution To All Your Ethereum Woes, Big Eyes Coin Kills 'Em With Cuteness - Analytics Insight",
        "content": "Disclaimer: Any financial and crypto market information given on Analytics Insight are sponsored articles, written for informational purpose only and is not an investment advice. The readers are further advised that Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Conduct your own research by contacting financial experts before making any investment decisions. The decision to read hereinafter is purely a matter of choice and shall be construed as an express undertaking/guarantee in favour of Analytics Insight of being absolved from any/ all potential legal action, or enforceable claims. We do not represent nor own any cryptocurrency, any complaints, abuse or concerns with regards to the information provided shall be immediately informed here."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmVxdWl0aS5jb20vc2MtZW4vbmV3cy9tYXJrZXQtaW5zaWdodHMvZXRoZXJldW1zLXNoYW5naGFpLXVwZ3JhZGUtd2hhdC15b3UtbmVlZC10by1rbm93L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Ethereum's Shanghai Upgrade: what you need to know — Equiti - Equiti Global",
        "content": "The upgrade includes smaller EIPs to reduce gas fees and more upgrades are expected later in 2023, including those for scalability and improving the Ethereum Virtual Machine\n\nThe Shanghai upgrade may impact the price of ETH, with concerns about flooding the market, but investors may not immediately withdraw due to potential losses\n\nEthereum's highly-anticipated Shanghai upgrade (EIP-4895), dubbed the Shapella upgrade, is set to occur on April 12, 2023. The hard fork is set to enable stakers and validators to withdraw assets from the Beacon Chain, which is a major development associated with the upgrade. The Shapella upgrade is a combination of two Ethereum Improvement Proposals: Shanghai and Capella. With staked Ether accounting for roughly 16 million coins, or a seventh of the total supply, this upgrade has significant implications. The current value of all staked Ether stands at over $30 billion.\n\nEthereum upgrade enables ETH withdrawal and reduces transaction fees\n\nThe Shapella upgrade marks the culmination of Ethereum's transition to a proof-of-stake consensus mechanism for network maintenance. This hard fork will enable stakers to withdraw their ETH, among other benefits. Additionally, the upgrade will help lower transaction fees for users while enhancing Ethereum's capacity to process transactions.\n\nThe most crucial development associated with the Shanghai upgrade is Ethereum Improvement Proposal-4895, which allows validators to withdraw staked tokens. Validators have staked around 16 million ETH to secure the mechanism, which has become increasingly vital to the Ethereum blockchain since the Merge transitioned Ethereum's consensus mechanism from proof-of-work to proof-of-stake in September 2022. According to the new rules post-Merge, validators that stake 32 ETH in the chain can participate in validating blocks, and each staked ETH increases the likelihood of a validator receiving block rewards.\n\nFollowing the Merge, validators had to lock up their ETH and any rewards earned until a later chain update. Despite the Merge taking place in 2022, validators have been staking ETH since December 2020, when the Beacon Chain was released, relying on proof-of-stake as a mechanism.\n\nSince the Beacon Chain's launch in December 2020, over 16 million ether has been staked in the network. Although not the entire balance can be unstaked immediately after the upgrade, roughly 1.1 million coins received as staking rewards can be withdrawn instantly. ETH is used to pay rewards to ether stakers.\n\nSince that time, Ethereum staking has been unidirectional. Users are able to stake their ETH to become validators and receive rewards in their wallet for performing their duties. However, they are currently unable to withdraw their staked ETH.\n\nAdditional EIPs to reduce gas fees and support Ethereum developers in Shanghai Upgrade\n\nAside from Ethereum Improvement Proposal-4895, the Shanghai fork also includes several other smaller EIPs that aim to reduce gas fees during periods of high activity to benefit Ethereum developers. These include EIP-3651, EIP-3855, EIP-3860, and EIP-6049.\n\nWhile the Shanghai upgrade may seem relatively small compared to the Merge, it has the potential for a significant impact on those with staked ETH on the chain. Further upgrades to the Ethereum protocol are expected later in 2023, including those aiming to improve the Ethereum Virtual Machine and another that seeks to split the Ethereum blockchain into several \"shards\" to enhance scalability. EIP-4844, which aims to split the Ethereum blockchain, had initially been considered for inclusion in the Shanghai upgrade, but was later pushed back.\n\nHow the Shanghai Upgrade will affect the price of ETH is a point of some debate\n\nThere is a debate on how the Shanghai Upgrade will impact the price of ETH. One concern is that the release of more than 16 million staked ETH, valued at over $30 billion currently, could lead to a flood of ETH into the crypto market, causing an immediate price drop due to an increased supply without a corresponding increase in demand. However, it is important to note that two years ago, the price of ETH was nearly three times its current price, and it is currently trading at almost half the price it was a year ago. In addition, many investors who staked their ETH could face losses if they withdraw immediately, which may discourage them from doing so."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMilgFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vc2hpYmEtaW51LXRvLWJlY29tZS1tb3JlLWRlY2VudHJhbGl6ZWQtdGhhbi1ldGhlcmV1bS13aXRoLXNoaWJhcml1bS1vbmJvYXJkaW5nLXRob3VzYW5kcy1vZi1iaWxsaW9uLXBhcnRuZXJzLXJlcG9ydC_SAZwBaHR0cHM6Ly93d3cuY3J5cHRvLW5ld3MtZmxhc2guY29tL3NoaWJhLWludS10by1iZWNvbWUtbW9yZS1kZWNlbnRyYWxpemVkLXRoYW4tZXRoZXJldW0td2l0aC1zaGliYXJpdW0tb25ib2FyZGluZy10aG91c2FuZHMtb2YtYmlsbGlvbi1wYXJ0bmVycy1yZXBvcnQvP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Apr 2023 07:00:00 GMT",
        "title": "Shiba Inu to become more decentralized than Ethereum with Shibarium onboarding thousands of billion-$-partners – Report - Crypto News Flash",
        "content": "Shiba Inu is expected to become more decentralized than Ethereum.\n\nShiba Inu would also receive some critical infrastructure from Unification as UNODE plays a pivotal role in the ecosystem.\n\nShibarium is the project expected to transition Shiba Inu from a meme coin to a technologically focused ecosystem. It is set to operate as a blockchain layer that runs on top of Ethereum. Shibarium would take over a large portion of SHIB transactions to prevent the asset from solely relying on Ethereum. Recently, the beta testnet was launched. Shiba Inu could compete with Ethereum on the grounds of decentralization as development firm Unification, which is known as the main developer of the Shibarium project, considers this as an important objective.\n\n\n\n\n\n\n\nRingoshi Toitsu, a popular validator of the Unification (FUND) network tweeted a screenshot on April 5 featuring an interaction between the Unification Foundation and a community user. As captured in the screenshot, Unification was attempting to address the centralization of Ethereum Virtual Machine (EVM) node operations issue. The Unification’s upcoming tool UNODE for decentralized applications (dapps) in the Shibarium ecosystem would, therefore, be used by SHIB’s layer 2.\n\nIt is worth noting that the native token of Unification is FUND. This is said to play a critical role as the only crypto that would be used by UNODE. According to Toitsu, UNODE would be very useful in the SHIB ecosystem.\n\nUnification is now tackling the next major point of centralization for Shibarium operations – EVM node operations. UNODE’s launch in 2023 offers a more secure and decentralized infrastructure for developers & Dapps – using FUND as the gas!\n\nShiba Inu is currently bullish\n\nThe decentralization aspect of the project is very important considering how Ethereum has been a topic of discussion after its recent ETH.20 upgrade. According to Messari’s study conducted in the fall of 2022, 70 percent of leading Ethereum applications run on four centralized node providers. In a blog post, Unification mentioned that Alchemy, Infura, Moralis, and Quicknode are the four centralized industry incumbents that provide the most ETH nodes. This is said to create a vulnerability in the technology stack of decentralized applications. Many also require card payments through DApps, hence, are permissioned and identifiable. In this case, tracking could be triggered.\n\nUnification’s UNODE addresses this Achilles’ Heel, by democratizing, decentralizing, and incentivizing EVM node operations. In accordance with our ethos, this will be pure Web3.\n\nOracle of Oracles (OoO), is also part of the Unification technology. OoO provides real-time asset prices by combining data from decentralized and centralized exchanges. This would be integrated into the SHIB ecosystem and includes ShibaSwap, Shiboshi NFTs, and Shibarium.\n\n\n\n\n\n\n\nThis means important infrastructure from Unification would be received by Shiba Inu.\n\nUnification is doing an excellent job with their technology for Shibarium, and no one else can match it. We’re still in an early beta stage with a focus on delegating/staking. People know that BONE is gas, there will be REAL governance, and TRUE SHIB users will be able to earn rewards from using the blockchain.\n\nThe current sentiment of Shiba Inu is bullish and is trading at $0.000011 as of press time. In the last seven days, the asset has surged by 2 percent.\n\nThis article is provided for informational purposes only and is not intended as investment advice. The content does not constitute a recommendation to buy, sell, or hold any securities or financial instruments. Readers should conduct their own research and consult with financial advisors before making investment decisions. The information presented may not be current and could become outdated."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vYml0Y29pbmlzdC5jb20vZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi1waWthbW9vbi1yZWFkeS10by1yYWxseS0yMDAwMC_SAVNodHRwczovL2JpdGNvaW5pc3QuY29tL2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tcGlrYW1vb24tcmVhZHktdG8tcmFsbHktMjAwMDAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction: Pikamoon Ready to Rally 20,000% | Bitcoinist.com - Bitcoinist",
        "content": "If anything, the last couple of months have taught us that the crypto industry is a rollercoaster that goes both up and down—and sometimes really down. The market is seriously bearish across the board, and investors are sitting on their hands, waiting for the perfect time to buy the dip.\n\nWhen is the perfect time? Investors are itching to get into buy positions as many coins on their watchlist are etching close to their all-time low price. This means bigger returns for investors if they get in early and if these tokens rally as high as they’ve done in the past. The top item on this list for the majority of investors is Ethereum.\n\nIn this article, we’ll explore expert opinions on the Ethereum price prediction for 2023 and when exactly it is the best time to buy Ethereum in order to maximize profit. We’ll also dive into the world of Pikamoon, the new GameFi project that experts believe will outperform Ethereum in 2023.\n\nShould I Buy Ethereum Now? – Ethereum Price Prediction For 2023\n\nWhile Ethereum may have gained 2.5% in the last 7 days and 3.1% in the last 30 days, it is noteworthy to mention that the overall Ethereum trend is still bearish. Ethereum has dropped over 60% from its all-time high price and may still go lower if certain criteria are not met quickly.\n\nReports from Coinmarketcap show that 66% of investors holding ETH tokens are in profit, 29% are in loss, and a small 5% are at breakeven. With the majority of investors in profit, it is easy to get excited at the thought of loading up on your buy positions on Ethereum.\n\nExperts believe this may not be the best course of action at the moment as ethereum’s price is not quite settled yet. The price of the ETH token is presently trading above the $1920 support level. This is a good indicator that prices may reach as high as $2500 without major obstructions. Before taking any more buy positions, wait for a clear close of the daily or weekly candle above the $2121 price region and a retest of the $1890 support level.\n\nNonetheless, the $2500 resistance zone is a critical region for the price of Ethereum. If the price of Ethereum fails to break the level to the upside, the price of its token may fall to $1800 lows or even lower.\n\nThis is why analysts are telling ETH investors who are looking to diversify their portfolios to load up on as many $PIKA tokens in the ongoing Pikamoon presale as the GameFi token is poised to rally as much as 20,000% before the end of the year.\n\nWhat is Pikamoon?\n\nPikamoon is a leading P2E in the crypto industry developed by crypto experts and blockchain analysts who are fully doxxed and properly vetted by Coinsult, a leading blockchain audit company. This is one of the many reasons big investors, the crypto community, and big brands trust the Pikamoon project.\n\nThat’s not all. When it comes to community support, Pikamoon is way ahead of its peers in the industry. The Pikamoon community is made up of crypto enthusiasts and expert investors who are fully involved and invested in the project’s success. This is why experts believe Pikamoon is on its way to becoming an industry leader.\n\nTo top it all off, the Pikaverse, which is the metaverse of the Pikamoon game, is built on the best gaming engine in the industry, Unreal Engine 5. This is the same gaming engine that the legendary Fortnite game is built on. So when it comes to your expectations of the Pikamoon game, you can let your imaginations run wild.\n\nBoth gamers and crypto enthusiasts are patiently waiting for Pikamoon’s launch so they can experience the Pikaverse firsthand. This is why investors are loading up on $PIKA tokens on the ongoing presale because they know the value of Pikamoon will skyrocket once it launches.\n\nPikamoon Presale: The Easiest Way To Flip Your Portfolio In 2023\n\nPikamoon is the game changer you need to transform your financial situation, and there’s no better time to invest in the project than now. Pikamoon is in the third and last stage of its presale, where $PIKA tokens are selling for as little as $0.0006.\n\nThe price of the Pikamoon token will never be this low again. Experts believe the $PIKA token will rally as high as 20,000% after its launch on major exchanges. Don’t miss out on another massive price move that can make you a crypto millionaire.\n\nGet on the Pikamoon presale now!\n\nFind out more about Pikamoon (PIKA):\n\nBuy Now: https://pikamoon.io/buy\n\nWebsite: https://pikamoon.io\n\nTwitter: https://twitter.com/Pikamooncoin\n\nTelegram: https://t.me/pikamoonofficial\n\nDisclaimer: This is a paid release. The statements, views and opinions expressed in this column are solely those of the content provider and do not necessarily represent those of Bitcoinist. Bitcoinist does not guarantee the accuracy or timeliness of information available in such content. Do your research and invest at your own risk."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDQvMTAvd2hhdC1oYXBwZW5lZC1jcnlwdG9raXR0aWVzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "What happened to CryptoKitties? - The Cryptonomist",
        "content": "CryptoKitties is the NFT collection that made history in 2017, but what happened to them now? How are their prices performing? Let’s take a closer look at them below.\n\nCryptoKitties: what are the famous NFTs?\n\nAs one of the first and most popular NFT projects, CryptoKitties introduced blockchain technology to thousands of early users, players, traders, and collectors. In fact, the early days of the collection’s release and sales are now something of a crypto legend.\n\nInterest in CryptoKitties has been so great since its inception that it has created an estimated six-fold increase in the number of Ethereum transactions. At one point, it accounted for 25% of the volume of transactions on the network.\n\nThe increase in volume caused a significant drop in transaction speed and an increase in gas rates across the entire Ethereum network. When this event occurred, at the peak of the 2017 bull-run cycle, it emphasized the scalability challenges of the Ethereum network and threatened to exclude other decentralized blockchain-based application startups.\n\nNot only that, the demand for CryptoKitties NFTs can be partly credited to the 256-bit DNA sequence assigned to each. The unique characteristics of each CryptoKitty are derived from a combination of the cattributes of its parents.\n\nThis genome mechanism allows nearly four billion unique CryptoKitties to be minted from the parent CryptoKitties. The popularity of the CryptoKitties NFTs has also attracted high-profile celebrity collaborations.\n\nMuse, a popular rock band, and Momo Wang, a famous Chinese fashion designer, have both participated in custom-themed cats for the CryptoKitties franchise. NBA superstar Stephen Curry was perhaps the most prominent celebrity to support the project. His initial involvement led to the creation of three CryptoKitty NFTs inspired by him.\n\nGrowth and decline of CryptoKitties\n\nCryptoKitties, which launched on 28 November 2017 after a five-day closed beta, quickly gained notoriety with the tantalizing slogan “the world’s first Ethereum game.”\n\nAccording to nonfungible.com, sales volume increased significantly from only 1,500 non-fungible cats on launch day to over 52,000 on 10 December 2017, with many CryptoKitties selling for prices in the hundreds or thousands of dollars.\n\nIn addition, the game’s use of the Ethereum blockchain may have contributed to the success of that technology. Along with the launch of CryptoKitties, Ethereum took off like a rocket, going from less than $300 per token in early November 2017 to just over $1,360 in January 2018.\n\nHowever, CryptoKitties faltered when Ethereum rose higher, which would later prove to be a troubling indication for the future of blockchain games.\n\nEarly December 2017 saw a spike in daily sales, which declined in January and averaged less than 3,000 in March. The fact that the value of NFTs themselves declined more slowly is evidence that the game still has a strong fan following, including Rabono, who bought Dragon long after the game’s height.\n\nUntil 2018, their activity broke records for the value of NFTs. Nowadays, CryptoKitties are fortunate to reach 100 sales per day and the total value is often less than $10,000.\n\nThere are still significant transactions, such as the sale of Founder Cat No. 71 for 60 ether (about $170,000) on 30 April 2022, although they occur only occasionally. It is doubtful that CryptoKitties’ decline into obscurity will stop.\n\nThe company that owns CryptoKitties, Dapper Labs, has moved on to other businesses such as NBA Top Shot, a website that allows basketball fans to buy NFT “moments,” which are essentially video clips of NBA games.\n\nWhy have the popular NFTs collapsed?\n\nThe latest blog post (4 June 2021) on the game’s website, commemorating the breeding of the 2 millionth CryptoKitty, contains a hint about the end of the game. To date, it is believed that there are two main reasons why CryptoKitties have collapsed.\n\nThe first, concerns the amount of available kittens. In the sense that the more players increased demand, the more they also increased the ability to increase supply by breeding more cats. This has rapidly reduced the rarity of each NFT.\n\nSecond, there is the huge volume of CryptoKitties, which has effectively destroyed the Ethereum blockchain, the world’s second most valuable cryptocurrency by market capitalization (after Bitcoin).\n\nAs mentioned earlier, Ethereum values transactions using a fee called gas. Gas fees will increase whenever there is an increase in transactions (purchase, generation, and so on), and that is exactly what happened when CryptoKitties went to the moon.\n\nHence, high fees were a problem for more than just CryptoKitties. The entire blockchain was affected by the problem. As the game gained popularity, gas prices increased for anyone who needed to make a transaction on Ethereum for any reason."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LnRoZWNvaW5yZXB1YmxpYy5jb20vMjAyMy8wNC8xMC85Mi1vZi1oYWNrZXJzLXdhbnQtZXRoLWludGVyZXN0LWluLXRlem9zLXN1cmdlZC1ieS0xMjItc3VydmV5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "92% of Hackers Want ETH, Interest in Tezos Surged By 122%: Survey - The Coin Republic",
        "content": "– Whitehats see reentrancy as the most common vulnerability when reviewing code.\n\n– Whitehat hackers are not driven by money.\n\n– The more Web3 grows, the more career opportunities it offers.\n\nWhitehats prefer the Ethereum blockchain over the others, but interest in Ethereum dropped by 4 per cent, says Immunefi in its Hacker Ecosystem Survey 2023. The leading bug bounty and security services platform for Web3 surveyed whitehats to get an insight into their interests, challenges and opportunities in Web3. It saw a significant increase in interest in Tezos, a 122.2 per cent YoY growth.\n\nThe survey found “reentrancy” as the most common vulnerability whitehats come across when reviewing code, followed by access control. Other vulnerabilities include input validation, oracle manipulation and logical errors. There are also rounding errors, gas optimization, unchecked returned values, uninitialized proxy, and flash loans.\n\nNot Doing It for the Money\n\nImmunefi, in its report, highlighted that money is not the driving factor in whitehat hackers’ interest. Most respondents, 77 per cent, are mainly interested in solving technical challenges. About 69 per cent of respondents said financial gains, 62 per cent pointed out career opportunities, and 38 per cent said community.\n\nBut most whitehats (55.8 per cent) said hacking is their primary job. 44.2 per cent of the respondents phish in their free time and spend most of their day as software developers within the Web3 or security industries. But there has been a significant increase in whitehats hacking in their free time, compared to 39.8 per cent in the previous period – an 11 per cent YoY growth.\n\nThe survey found that more whitehats are joining the field and using their free time to work on transitioning to Web3 cybersecurity full-time. Most whitehats, on average, have worked in cybersecurity for almost four years and have been inclined towards Web3 security for almost two years.\n\nAll Eyes on Web3\n\nWeb3 is a high-paying industry. The more this space grows, the more career opportunities it offers. Whitehats believe their role in security is of high value for the industry and is well-rewarded as the technology leads to monetary funds being directly at risk. Web3 brings a host of possibilities. Whitehats see a steep learning curve, irrespective of previous cybersecurity or Web2 development background, as a key challenge.\n\nKeeping up with the industry is challenging given the complexity of solidity coding and protocols, possible attack vectors in Web3 and the continuously evolving requirements.\n\nMitchell Amador, CEO of Immunefi, believes there is a need always to stay ahead of bad actors. He said it’s crucial to have the most talented security ecosystem in place and to operate under a reliable incentivized system. Amador added that working closely with whitehats, sharing insights and growing from their experience is of tremendous value and will continue to be beneficial, as they are on the frontline of protecting the industry."
    }
]