[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3LnNpbXBsaWxlYXJuLmNvbS90dXRvcmlhbHMvYmxvY2tjaGFpbi10dXRvcmlhbC93aGF0LWlzLWV0aGVyZXVt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "What is Ethereum? Explained With Features and Applications - Simplilearn",
        "content": "Ethereum is considered by many to be the second most popular cryptocurrency, surpassed now only by Bitcoin. According to The Motley Fool, the Enterprise Ethereum Alliance (EEA) has some big-name founding members, including Microsoft, Intel, and JPMorgan Chase.\n\n“The adoption of Ethereum by the corporate world,” says CNBC, “means it could eventually be bigger than its early stage rival.” That means it’s time to get to know the Ethereum platform, including its features and applications, and what makes Ethereum different from Bitcoin.\n\nOur “Ethereum Explained” Ethereum tutorial video lays it all out for you, and here we’ll cover what’s discussed in the video.\n\nBasics to Advanced - Learn It All! Caltech PGP Full Stack Development Explore Program\n\nWhat is Ethereum?\n\nEthereum is a blockchain-based computing platform that enables developers to build and deploy decentralized applications—meaning not run by a centralized authority. You can create a decentralized application for which the participants of that particular application are the decision-making authority.\n\nEthereum Features\n\nEther: This is Ethereum’s cryptocurrency.\n\nSmart contracts: Ethereum allows the development and deployment of these types of contracts.\n\nEthereum Virtual Machine: Ethereum provides the underlying technology—the architecture and the software—that understands smart contracts and allows you to interact with it.\n\nDecentralized applications (Dapps): A decentralized application is called a Dapp (also spelled DAPP, App, or DApp) for short. Ethereum allows you to create consolidated applications, called decentralized applications.\n\nDecentralized autonomous organizations (DAOs): Ethereum allows you to create these for democratic decision-making.\n\nThese are Ethereum’s essential features. Before going deep into the Ethereum tutorial, let’s discuss each of these features in more detail.\n\n1. Ether\n\nEther (ETH) is Ethereum’s cryptocurrency. It is the fuel that runs the network. It is used to pay for the computational resources and the transaction fees for any transaction executed on the Ethereum network. Like Bitcoins, ether is a peer-to-peer currency. Apart from being used to pay for transactions, ether is also used to buy gas, which is used to pay for the computation of any transaction made on the Ethereum network.\n\nAlso, if you want to deploy a contract on Ethereum, you will need gas, and you would have to pay for that gas in ether. So gas is the execution fee paid by a user for running a transaction in Ethereum. Ether can be utilized for building decentralized applications, building smart contracts, and making regular peer-to-peer payments.\n\n2. Smart Contracts\n\nSmart contracts are revolutionizing how traditional contracts work, which is why you need to use the tutorial to become more familiar with them. A smart contract is a simple computer program that facilitates the exchange of any asset between two parties. It could be money, shares, property, or any other digital asset that you want to exchange. Anyone on the Ethereum network can create these contracts. The contract consists primarily of the terms and conditions mutually agreed on between the parties (peers).\n\nThe smart contract’s primary feature is that once it is executed, it cannot be altered, and any transaction done on top of a smart contract is registered permanently—it is immutable. So even if you modify the smart contract in the future, the transactions correlated with the original contract will not get altered; you cannot edit them.\n\nThe verification process for the smart contracts is carried out by anonymous parties in the network without the need for a centralized authority, and that’s what makes any smart contract execution on Ethereum a decentralized execution.\n\nThe transfer of any asset or currency is done in a transparent and trustworthy manner, and the identities of the two entities are secure on the Ethereum network. Once the transaction is successfully done, the accounts of the sender and receiver are updated accordingly, and in this way, it generates trust between the parties.\n\nBasics to Advanced - Learn It All! Caltech PGP Full Stack Development Explore Program\n\nSmart Contracts Vs. Traditional Contract Systems\n\nIn conventional contract systems, you sign an agreement, then you trust and hire a third party for its execution. The problem is that in this type of process, data tampering is possible. With smart contracts, the agreement is coded in a program.\n\nA centralized authority does not verify the result; it is confirmed by the participants on the Ethereum blockchain-based network. Once a contract is executed, the transaction is registered and cannot be altered or tampered, so it removes the risk of any data manipulation or alteration.\n\nLet’s take an example in which someone named Zack has given a contract of $500 to someone named Elsa for developing his company’s website. The developers code the agreement of the smart contract using Ethereum’s programming language.\n\nThe smart contract has all the conditions (requirements) for building the website. Once the code is written, it is uploaded and deployed on the Ethereum Virtual Machine (EVM).\n\nEVM is a runtime compiler to execute a smart contract. Once the code is deployed on the EVM, every participant on the network has a copy of the contract. When Elsa submits the work on Ethereum for evaluation, each node on the Ethereum network will evaluate and confirm whether the result given by Elsa has been done as per the coding requirements.\n\nOnce the result is approved and verified, the contract worth $500 will be self-executed, and the payment will be paid to Elsa in ether. Zack’s account will be automatically debited, and Elsa will be credited with $500 in ether.\n\nThe Ethereum tutorial video includes a demo on the deployment of an Ethereum smart contract.\n\nTake a deep dive on Bitcoins, Hyperledger, Ethereum, and Multichain Blockchain platforms with the Blockchain Certification Training Course!\n\n3. Ethereum Virtual Machine\n\nEVM, as mentioned above in this Ethereum tutorial, is designed to operate as a runtime environment for compiling and deploying Ethereum-based smart contracts. EVM is the engine that understands the language of smart contracts, which are written in the Solidity language for Ethereum. EVM is operated in a sandbox environment—basically, you can deploy your stand-alone environment, which can act as a testing and development environment. You can then test your smart contract (use it) “n” number of times, verify it, and once you are satisfied with the performance and the functionality of the smart contract, you can deploy it on the Ethereum main network.\n\nAny programming language in the smart contract is compiled into the bytecode, which the EVM understands. This bytecode can be read and executed using the EVM. Solidity is one of the most popular languages for writing a smart contract. Once you write your smart contract in Solidity, that contract gets converted into the bytecode and gets deployed on the EVM, thereby guaranteeing security from cyberattacks.\n\na) How Does EVM Work?\n\nSuppose person A wants to pay person B 10 ethers. The transaction will be sent to the EVM using a smart contract for a fund transfer from A to B. To validate the transaction; the Ethereum network will perform the proof-of-work consensus algorithm.\n\nBasics to Advanced - Learn It All! Caltech PGP Full Stack Development Explore Program\n\nThe miner nodes on Ethereum will validate this transaction—whether the identity of A exists or not, and if A has the requested amount to transfer. Once the transaction is confirmed, the ether will be debited from A’s wallet and will be credited to B’s wallet, and during this process, the miners will charge a fee to validate this transaction and will earn a reward.\n\nAll the nodes on the Ethereum network execute smart contracts using their respective EVMs.\n\nb) Proof of Work\n\nEvery node in the Ethereum network has:\n\nThe entire history of all the transactions—the entire chain\n\nThe history of the smart contract, which is the address at which the smart contract is deployed, along with the transactions associated with the smart contract\n\nThe handle to the current state of the smart contract\n\nThe goal of the miners on the Ethereum network is to validate the blocks. For each block of a transaction, miners use their computational power and resources to get the appropriate hash value by varying the nonce. The miners will vary the nonce and pass it through a hashing algorithm—in Ethereum, it is the Ethash algorithm.\n\nThis produces a hash value that should be less than the predefined target as per the proof-of-work consensus. If the hash value generated is less than the target value, then the block is considered to be verified, and the miner gets rewarded.\n\nWhen the proof of work is solved, the result is broadcast and shared with all the other nodes to update their ledger. If other nodes accept the hashed block as valid, then the block gets added to the Ethereum main blockchain, and as a result, the miner receives a reward, which as of today stands at three ethers. Plus, the miner gets the transaction fees that have been generated for verifying the block. All the transactions that are aggregated in the block—the cumulative transaction fees associated with all the transactions are also rewarded to the miner.\n\nc) Proof of Stake\n\nIn Ethereum, a process called proof of stake is also under development. It is an alternative to proof of work and is meant to be a solution to minimize the use of expensive resources spent on mining using proof of work. In proof of stake, the miner—who is the validator—can validate the transactions based on the number of crypto coins he or she holds before actually starting the mining.\n\nSo, based on the accumulation of crypto coins the miner has beforehand, he or she has a higher probability of mining the block. However, proof of stake is not widely used as of now compared to proof of work.\n\nd) Gas\n\nJust like we need fuel to run a car, we need gas to run applications on the Ethereum network. To perform any transaction within the Ethereum network, a user must make a payment, in this case paying out ethers, to get a transaction done, and the intermediary monetary value is called gas.\n\nOn the Ethereum network, gas is a unit that measures the computational power required to run a smart contract or a transaction. So, if you must do a transaction that updates the blockchain, you would have to shell out gas, and that gas costs ethers.\n\nIn Ethereum, the transaction fees are calculated using a formula (see screenshot below). For every transaction, there is gas and its correlated gas price. The transaction fees equal the amount of gas required to execute a transaction multiplied by the gas price. “Gas limit” refers to the amount of gas used for the computation and the amount of ether a user is required to pay for the gas.\n\nBelow is a screenshot from the Ethereum network showing the transaction cost. You can see for this particular transaction, the gas limit was 21,000, the gas used by the transaction was 21,000, and the gas price was 21 Gwei, which is the lowest denomination of ether. So, 21 Gwei * 21,000 gave the actual transaction fees: 0.000441 ethers, or about 21 cents as of today. As mentioned, the transaction fee goes to the miner, who has validated the transaction.\n\nTo understand the gas limit and price, let’s consider an example using a car. Suppose your vehicle has a mileage of 10 kilometers per liter and petrol costs $1 per liter. Under these parameters, driving a car for 50 kilometers would cost you five liters of petrol, which is worth $5. Similarly, to perform an operation or to run code on Ethereum, you need to obtain a certain amount of gas, like petrol, and the gas has a per-unit price, called gas price.\n\nBasics to Advanced - Learn It All! Caltech PGP Full Stack Development Explore Program\n\nIf the user provides less than the amount of gas to run an operation, then the process will fail, and the user will be given the message “out of gas.” And Gwei, as noted above, is the lowest denomination of ether used for measuring a unit of a gas price.\n\ne) How is Ethereum Mining Different from Bitcoin Mining?\n\nBitcoin Ethereum Hashing Algorithm SHA-256 Ethash Time is taken to mine a block An average of 10 minutes An average of 12-15 seconds Reward 12.5 BTC 3 ETH USD - 04/10/2019 1 Bitcoin = 5249.03 1 Ether = 180.89\n\n4. Decentralized Applications (Dapps)\n\nLet’s compare decentralized applications with traditional applications. When you log in to Twitter, for example, a web application gets displayed that is rendered using HTML. The page will call an API to access your data (your information), which is centrally hosted. It’s a simple process: your front end executes the backend API, and the API goes and fetches your data from a centralized database.\n\nIf we transform this application into a decentralized application when you log in, the same web application gets rendered, but it calls a smart contract-based API to fetch the information from the blockchain network. So, the API is replaced by a smart contract interface, and the smart contract will bring the data from the blockchain network, which is its back end.\n\nThat blockchain network is not a centralized database; it’s a decentralized network in which the participants of the network (the miners) validate (verify) all the transactions that are happening using the smart contract on the blockchain network. So, any transaction or action happening on a Twitter-type application that has now been transformed will be a decentralized transaction.\n\nA Dapp consists of a backing code that runs on a distributed peer-to-peer network. It is a software designed to work in the Ethereum network without being controlled by a centralized system, as mentioned, and that is the primary difference: it provides direct interaction between the end-users and the decentralized application providers.\n\nAn application qualifies as a Dapp when it is open-source (its code is on Github), and it uses a public blockchain-based token to run its applications. A token acts as fuel for the decentralized application to run. Dapp allows the back end code and data to be decentralized, and that is the primary architecture of any Dapp.\n\n5. Decentralized Autonomous Organizations (DAOs)\n\nA DAO is a digital organization that operates without hierarchical management; it works in a decentralized and democratic fashion. So basically, a DAO is an organization in which the decision-making is not in the hands of a centralized authority but preferably in the hands of certain designated authorities or a group or designated people as a part of an authority. It exists on a blockchain network, where it is governed by the protocols embedded in a smart contract, and thereby, DAOs rely on smart contracts for decision-making—or, we can say, decentralized voting systems—within the organization. So, before any organizational decision can be made, it must go through the voting system, which runs on a decentralized application.\n\nHere’s how it works. People add funds through the DAO because the DAO requires funding in order to execute and make decisions. Based on that, each member is given a token that represents that person’s percentage of shares in the DAO. Those tokens are used to vote in the DAO, and the proposal status is decided based on the maximum votes. Every decision within the organization must go through this voting process.\n\nBasics to Advanced - Learn It All! Caltech PGP Full Stack Development Explore Program\n\nReal-World Applications of Ethereum\n\nVoting Systems\n\nAs we’ve seen with DAO, voting systems are adopting Ethereum. The results of polls are publicly available, ensuring a transparent and fair democratic process by eliminating voting malpractices.\n\nAs we’ve seen with DAO, voting systems are adopting Ethereum. The results of polls are publicly available, ensuring a transparent and fair democratic process by eliminating voting malpractices. Banking Systems\n\nEthereum is getting adopted widely in banking systems because with Ethereum’s decentralized system; it is challenging for hackers to gain unauthorized access. It also allows payments on an Ethereum-based network, so banks are also using Ethereum as a channel to make remittances and payments.\n\nEthereum is getting adopted widely in banking systems because with Ethereum’s decentralized system; it is challenging for hackers to gain unauthorized access. It also allows payments on an Ethereum-based network, so banks are also using Ethereum as a channel to make remittances and payments. Shipping\n\nDeploying Ethereum in shipping helps with the tracking of cargo and prevents goods from being misplaced or counterfeited. Ethereum provides the provenance and tracking framework for any asset required in a typical supply chain.\n\nDeploying Ethereum in shipping helps with the tracking of cargo and prevents goods from being misplaced or counterfeited. Ethereum provides the provenance and tracking framework for any asset required in a typical supply chain. Agreements\n\nWith Ethereum smart contracts, agreements can be maintained and executed without any alteration. So in an industry that has fragmented participants, is subject to disputes, and requires digital contracts to be present, Ethereum can be used as a technology for developing smart contracts and for digitally recording the agreements and the transactions based on them.\n\nConclusion\n\nHead over to our “Ethereum Explained” Ethereum tutorial video to see an in-depth demo on how to deploy an Ethereum smart contract locally, including installing Ganache and Node in a Windows environment.\n\nAnd if you want to take your career to the next level, what are you waiting for? Sign up for Simplilearn’s Blockchain Basics course or Professional Certificate Program in Blockchain. Remember that blockchain is the underlying technology not just for Ethereum but for Bitcoin and other cryptocurrencies. And according to ZipRecruiter, the average salary for a blockchain developer is a little over $154,000 a year and some salaries are as high as $242,000!\n\nIf you have any questions or doubts, feel free to post them in the comments below. Our team will get back to you at the earliest."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LnRlY2hub2xvZ3lyZXZpZXcuY29tLzIwMjMvMDIvMjgvMTA2OTE5MC9ldGhlcmV1bS1tb3ZlZC10by1wcm9vZi1vZi1zdGFrZS13aHktY2FudC1iaXRjb2luL9IBamh0dHBzOi8vd3d3LnRlY2hub2xvZ3lyZXZpZXcuY29tLzIwMjMvMDIvMjgvMTA2OTE5MC9ldGhlcmV1bS1tb3ZlZC10by1wcm9vZi1vZi1zdGFrZS13aHktY2FudC1iaXRjb2luL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Ethereum moved to proof of stake. Why can’t Bitcoin? - MIT Technology Review",
        "content": "Bitcoin mining, the computationally intensive process by which new coins are created and accounted for, has become a global concern. After China cracked down on the process in mid-2021, miners sought out other areas of the world where energy was cheap, but not always clean. In places like Kazakhstan, miners put pressure on the power grid, which relies heavily on carbon-intensive coal-fired power stations, causing localized blackouts and contributing to civil unrest. In upstate New York, where miners took over shuttered factories and empty warehouses, locals have complained of rising energy bills and the high-frequency whine of whirring data center fans—and worried about the environmental toll mining is taking. The US currently hosts 38% of all bitcoin mining operations.\n\nA single Bitcoin transaction uses the same amount of energy as a single US household does over the course of nearly a month. But does it have to be that way? The Bitcoin community has historically been fiercely resistant to change, but pressure from regulators and environmentalists fed up with Bitcoin’s massive carbon footprint may force them to rethink that stance.\n\nA variety of other countries, including Kazakhstan, Iran, and Singapore, have also set limits on crypto mining. In April 2023, the European Parliament is due to pass a landmark crypto bill called Markets in Crypto Assets (MiCA), which mandates environmental disclosures from crypto firms. The law is expected to go into force sometime in 2024.\n\nThat may be just the start for the EU: the European Central Bank has previously stated it cannot imagine a world where governments would ban gasoline-powered cars in favor of electric vehicles but not act on Bitcoin’s persistence in pumping out CO2. “Some members of the European Parliament are already wondering why Bitcoin is not following Ethereum,” Alex de Vries, the data scientist behind Digiconomist, a website that tracks cryptocurrency energy use, told MIT Technology Review.\n\nEfforts to crack down on Bitcoin’s waste are gaining steam in the US as well. In November, New York became the first state to enact a temporary ban on new cryptocurrency mining permits at fossil-fuel plants. The new law also requires New York to study crypto mining’s impact on the state’s efforts to reduce its greenhouse-gas emissions.\n\nSo what would it take to make a switch?\n\nProof of work vs. proof of stake\n\nCryptocurrencies have no central guardian, like a bank, to oversee their public ledgers—the shared digital record of every transaction on the blockchain. Instead, they rely on consensus mechanisms to agree on updates. In proof of work, the approach Bitcoin relies on, a worldwide network of computers—known as “miners”—spends electricity trying to win a lottery of sorts. Whoever wins gets to append the next block and collect new coins in the process. The chance of winning is in direct proportion to the number of computations a miner does. As a result, massive server farms have sprung up around the globe dedicated solely to winning this lottery.\n\nProof of stake, the approach Ethereum now uses, does away with this massive energy consumption. Instead of miners, proof-of-stake systems employ vast numbers of “validators.” To become a validator, you have to deposit, or “stake,” a set amount in coins—32 ether, in the case of Ethereum. Staking gives validators a chance to check new blocks of transactions and add them to the blockchain so they can earn rewards on top of their staked coins. The more coins you stake, the better your odds of getting picked to add the next block of transactions to the chain."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDIvMjgvc2Vjb25kLWV0aGVyZXVtLXRlc3RuZXQtc3VjY2Vzc2Z1bGx5LXNpbXVsYXRlcy1zaGFuZ2hhaS1oYXJkLWZvcmsv0gFvaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wMi8yOC9zZWNvbmQtZXRoZXJldW0tdGVzdG5ldC1zdWNjZXNzZnVsbHktc2ltdWxhdGVzLXNoYW5naGFpLWhhcmQtZm9yay9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Second Ethereum Testnet Successfully Simulates Shanghai Hard Fork - CoinDesk",
        "content": "The final testnet upgrade will occur to Goerli sometime in the coming weeks. That would be the final dress rehearsal before the main blockchain is able to process staked ETH withdrawals. Goerli’s testing will also be the most anticipated given that it is the biggest testnet of the three and it mimics the main Ethereum blockchain’s activity most closely."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvaW5ub3ZhdGlvbi9zbWFydC1jb250cmFjdHMtb24tZXRoZXJldW0v0gFaaHR0cHM6Ly93d3cuZmluYW5jZW1hZ25hdGVzLmNvbS9jcnlwdG9jdXJyZW5jeS9pbm5vdmF0aW9uL3NtYXJ0LWNvbnRyYWN0cy1vbi1ldGhlcmV1bS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Smart Contracts on Ethereum - Finance Magnates",
        "content": "Smart contracts are programs that run on their own and can be executed on a blockchain. These contracts are intended to automate the execution of contractual agreements, and their application cases are rapidly expanding.\n\nThis article will look at the applications and limitations of smart contracts on the Ethereum blockchain.\n\nWhat Is Ethereum?\n\nEthereum is a blockchain-based platform on which developers can create decentralized applications (DApps). It is a decentralized, open-source platform for developing smart contracts and other blockchain-based applications.\n\nThe Ethereum blockchain enables code execution in a trustless, decentralized environment.\n\nWhat Are Smart Contracts?\n\nSmart contracts are computer programs that operate on a blockchain like Ethereum. They are intended to automatically carry out the terms of an agreement without the use of intermediaries.\n\nSmart contracts are secure, transparent, and immutable, making them an excellent solution for a wide range of business applications.\n\nSmart Contract Use Cases on Ethereum\n\nSupply Chain Administration\n\nSmart contracts can be used to manage supply chains by automating product tracking and verification as it moves through the chain. The movement of products can be tracked transparently using smart contracts, and the authenticity of products can be verified at each stage of the supply chain.\n\nServices in Finance\n\nSmart contracts have the potential to be used in financial services, such as insurance and lending. Smart contracts can be used to automate claim and loan processing, reducing the time and cost associated with these processes.\n\nProperty Management\n\nSmart contracts can be used to automate the buying and selling of property in the real estate industry. Smart contracts can be used to manage the transfer of ownership, the transfer of funds, and other real estate transaction processes.\n\nGaming\n\nIn the gaming industry, smart contracts can be used to provide transparency and fairness in online gaming. Smart contracts can be used to manage gaming assets and enforce game rules.\n\nSwitching Tokens\n\nA simple and one of the most common use cases for smart contracts is token switching.\n\nSmart contracts allow users to create liquidity pools with token pairs. Subsequently, investors can use them to switch one token for another. The standard way of operations is that as one begins to increase in terms of volume, the price of the other token will follow. This is done as a way of stabilizing the pool’s value.\n\nToken switching is a valuable tool for day traders who want to gain access to a coin or token which isn’t available on their exchanges of choice.\n\nFlash Loans\n\nWith flash loan technology, investors can instantly borrow and speculate on token prices. In fact, the key feature of a flash loan is that whoever is borrowing, returns that very same amount and the loan fees in under a minute or one block transaction (however, smart contracts can have different time frames coded in).\n\nBy using this technology, investors found a rather unique way of playing the crypto markets as they can speculate by buying a coin in their preferred platforms and selling it on a different one. If everything runs its course, day traders can effectively pocket the difference and thus profit, or even use a trading bot to do so.\n\nWhile becoming rarer, flash loans are still a great tool in the crypto universe.\n\nApplications That Are Decentralized\n\nOn the Ethereum blockchain, smart contracts can be used to create decentralized applications (DApps). These applications can be used to automate a variety of business processes, including supply chain management and financial services.\n\nEthereum Smart Contracts Have Limitations\n\nComplexity\n\nSmart contracts can be complex and difficult to write. Even experienced developers can struggle to write smart contracts that are secure and free of bugs. This complexity can lead to errors that attackers can exploit.\n\nImmutability\n\nSmart contracts on the Ethereum blockchain are immutable, which means they cannot be changed once they are deployed. This can be a limitation if the smart contract contains a bug or vulnerability. If a bug is discovered after the smart contract has been deployed, it cannot be resolved without the creation of a new contract.\n\nCost\n\nThe deployment and execution of smart contracts on the Ethereum blockchain can be costly. The cost of deploying a smart contract is determined by the contract's complexity and the current gas prices on the Ethereum network.\n\nScalability\n\nScalability issues on the Ethereum blockchain may limit the number of smart contracts that can be executed on the network. This can result in high transaction fees and long processing times.\n\nLegacy System Integration\n\nSmart contracts may be difficult to integrate with legacy systems, limiting their adoption in some industries. Businesses may need to modify their existing systems in order to use smart contracts, which can be costly and time-consuming.\n\nConclusion\n\nThe Ethereum blockchain's smart contracts are a powerful tool for automating business processes, but they have limitations. Some of the limitations that businesses must consider when using smart contracts are their complexity, immutability, cost, scalability challenges, and integration with legacy systems.\n\nDespite these limitations, smart contract use cases on the Ethereum blockchain are expanding, and the benefits of using smart contracts can outweigh their drawbacks. Some of these limitations are likely to be addressed as the Ethereum network evolves and improves.\n\nFor example, Ethereum 2.0, which is currently being rolled out, aims to address the current Ethereum network's scalability issues.\n\nFinally, smart contracts on the Ethereum blockchain have a diverse set of applications for businesses looking to automate their processes. However, businesses must be aware of smart contract limitations, such as their complexity, immutability, cost, scalability issues, and integration with legacy systems.\n\nBusinesses can make informed decisions about how to use this technology to improve their operations by understanding the benefits and limitations of smart contracts on the Ethereum blockchain."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vZGVjcnlwdC5jby8xMjIyNDYvZXRoZXJldW0tZGV2ZWxvcGVycy1sZXQtZ29lcmxpLXRlc3RuZXQtc2xvd2x5LWRpZS1jb2luLXByaWNlLXNvYXJz0gFiaHR0cHM6Ly9kZWNyeXB0LmNvLzEyMjI0Ni9ldGhlcmV1bS1kZXZlbG9wZXJzLWxldC1nb2VybGktdGVzdG5ldC1zbG93bHktZGllLWNvaW4tcHJpY2Utc29hcnM_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Ethereum Developers to Let Goerli Testnet ‘Slowly Die’ as Coin Price Soars - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nGETH, the native asset powering the Ethereum testnet Goerli, is soaring. And that’s a problem.\n\nThe testnet token peaked at $1.60 on Saturday and is now trading, according to CoinGecko, at about $0.31—and the fact that a testnet currency is even listed on price-tracking sites is indicative that something has gone wrong.\n\nMore importantly, though, developers are now turning away from testing their apps on it due to the new costs.\n\nAD\n\nAD\n\nEthereum developer ​​Marius van der Wijden told Decrypt that the problem isn't new, saying that after almost a year of discussions on how to fix the GETH supply, the easiest solution is to let Goerli \"slowly die.\"\n\n\"That's the intention with all testnets, they should live for a few years,\" van der Wijden said. \"Afterwards it becomes increasingly hard to sync them, so it's not of much use.\"\n\nAccording to him, the plan is to slowly phase out Goerli while moving users to the Sepolia testnet—which is already running but as a permissioned chain and not yet open for anyone to run a validator node.\n\nLaunched in 2019, Goerli is one of several Ethereum testnets that lets developers safely test their code before deploying them on the Ethereum mainnet. To make the testnet environment as real as possible, it also needed a native gas token. That gas token was freely trickled out via so-called faucets and from validators keeping the testnet alive.\n\nTo speed up distribution to developers, crypto project LayerZero enabled trading between mainnet and Goerli to help developers. This move had the side effect of turning GETH into the subject of rampant speculation.\n\nAD\n\nAD\n\nAs for alternatives, other Ethereum developers, such as Tim Beiko, are proposing a new testnet called Holli, which aims to make it easier for developers to acquire testnet ETH and reduce the need for a secondary market."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS10ZXN0bmV0LXN1Y2Nlc3NmdWxseS1mb3Jrcy1pbi1zaGFuZ2hhaS11cGdyYWRlLXJlaGVhcnNhbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Ethereum testnet successfully forks in Shanghai upgrade rehearsal - Cointelegraph",
        "content": "The Ethereum blockchain’s Sepolia testnet has undergone a successful upgrade that simulates the upcoming Shanghai hard fork expected to take place on mainnet in March.\n\nThe “Shapella” upgrade, which combines the names of the upcoming Shanghai and Capella hard forks, was successfully implemented on the testnet on Feb. 28.\n\nSepolia testnet has successfully upgraded to Shapella!\n\n\n\nSome of the Prsym validators are offline due to the old geth version. They will come online in the next 10 mins!\n\n\n\nNext stop: Goerli pic.twitter.com/pb43Gq7w9C — terence.eth (@terencechain) February 28, 2023\n\nShanghai is the fork’s name on the execution layer client side and Capella is the upgrade name on the consensus layer client side. One of the major changes enables validators to withdraw their staked Ether from the Beacon Chain back to the execution layer.\n\nRelated: Lido Finance activates staking rate limit after more than 150,000 ETH staked\n\nValidators needed to stake 32 Ether (ETH) to validate on the Ethereum blockchain. They will now be able to withdraw rewards in excess of 32 ETH and be permitted to keep validating while those who wish to fully withdraw can take all 32 ETH plus rewards and cease validating.\n\nThe next step before the Shanghai fork goes live on the mainnet will be to release the upgrade on the Ethereum Goerli testnet, which is expected to commence in March."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLXByaWNlLXRvZGF5LWV0aGVyZXVtLWRpcHMtYnktMC01MS1kZXNwaXRlLWFub3RoZXItc3RlcC1pbi1zaGFuZ2hhaS11cGdyYWRlL9IBbWh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLXByaWNlLXRvZGF5LWV0aGVyZXVtLWRpcHMtYnktMC01MS1kZXNwaXRlLWFub3RoZXItc3RlcC1pbi1zaGFuZ2hhaS11cGdyYWRlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Ethereum Price Today: ETH Drops Despite Shanghai Upgrade Development - CoinGape",
        "content": "Ethereum Price Today: The market is trading in red today, as most of the significant coins see a decline. Investors are currently exercising caution when it comes to investing in riskier assets, primarily due to concerns surrounding mounting macroeconomic issues, which have been exacerbated by higher-than-anticipated inflation rates.\n\nThe global crypto market cap stands at 1.07 trillion USD, a decrease of 0.36% over the past day. The total crypto market volume in the last 24 hours increased by 28.36% and is currently at 45.38 billion USD.\n\nadvertisement\n\nEthereum (ETH) decreases by 0.51%\n\nThe second largest crypto, Ethereum price today dropped by 0.51% in the last 24 hours. The market cap for Ethereum is 199.31 billion USD. Moreover, trading volume increases by 14.87% over the previous 24 hours. Each ETH token is trading for 1,628 USD, holding on to the support level of 1600. Source: coinmarketcap\n\nA step further to Shanghai Upgrade\n\nThe Sepolia testnet, Ethereum’s second test network, has successfully replicated withdrawals of staked ether (ETH), marking a significant step towards the highly anticipated Shanghai Upgrade for the Ethereum blockchain. This upgrade, which was triggered at epoch 56832, allows validators to withdraw their stake from the Beacon Chain back to the execution layer and introduces new features to the execution and consensus layers.\n\nOnce implemented, the Shanghai Upgrade will signify Ethereum’s complete transition to a fully functional proof-of-stake network, enabling validators to withdraw rewards earned from adding or approving blocks to the blockchain. The announcement of the live and finalized Shapella network on the Sepolia testnet was shared by Ethereum developers and clients on Twitter. The next upgrade will occur on the Goerli testnet, followed by the mainnet, ultimately finalizing the Shanghai upgrade."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtcHJpbWVkLWZvci1icmVha291dC1hZ2FpbnN0LWJpdGNvaW4tYnRjLWV4LWFyay1pbnZlc3QtY3J5cHRvLWFuYWx5c3Qtc2F5c9IBamh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtcHJpbWVkLWZvci1icmVha291dC1hZ2FpbnN0LWJpdGNvaW4tYnRjLWV4LWFyay1pbnZlc3QtY3J5cHRvLWFuYWx5c3Qtc2F5cz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) Primed for Breakout Against Bitcoin (BTC), Ex-Ark Invest Crypto Analyst Says - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe former head of crypto analysts at ARK Invest, Chris Burniske, shared his outlook on Ethereum's (ETH) price action against Bitcoin (BTC). According to the expert, after two years of consolidation, the market's main altcoin is ready to make a breakout against the market's main cryptocurrency.\n\nAdvertisement\n\nAfter almost 2 years of consolidation, $ETHBTC is primed for a monthly breakout. pic.twitter.com/btUzBP9Ew5 — Chris Burniske (@cburniske) February 27, 2023\n\nThe last time Ethereum had such a price spike was in May 2021. Then, in just over a month, ETH gained more than 150% against BTC, after having been in consolidation for 931 days beforehand.\n\nIf the outbreak Burniske is talking about really does happen, it can be assumed that it will be smaller than last time, considering that the current consolidation lasts a third of the days of the previous one and, therefore, the amount of accumulated \"energy\" is also lower.\n\nEthereum v. Bitcoin\n\nEqually interesting is whether Ethereum will renew its all-time high against Bitcoin in the event of a potential influx of liquidity into it. Currently, that mark is set at 0.1564 BTC per ETH, which is 123% higher than the current altcoin's price.\n\nFinally, a potential price break will answer the question of how close the \"flippening\" is. There has been talk of Ethereum displacing Bitcoin from the throne of the largest cryptocurrency since the very emergence of the market, but at the moment ETH is still only 43% of BTC in terms of capitalization."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LnRyYWRpbmd2aWV3LmNvbS9jaGFydC9FVEhVU0QvNmdiNDBSb24tVGhlLUV0aGVyZXVtLUVjb3N5c3RlbS1BLUxvb2staW50by10aGUtTGVhZGluZy1Jbm5vdmF0b3JzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "The Ethereum Ecosystem: A Look into the Leading Innovators for BITSTAMP:ETHUSD by ChainKnights - TradingView",
        "content": "The Ethereum Foundation, a Swiss non-profit organization created in 2014, aims to promote and support research, development, and education on the Ethereum platform. With a treasury of around 336,000 ETH, the foundation regularly awards grants to projects that make a significant contribution to the development of the Ethereum ecosystem. In 2021 alone, they allocated $26.9 million to 136 projects! 🔥👀\n\n\n\nConsenSys, a leading software development company, builds decentralized solutions on the Ethereum blockchain. With over 2,000 corporate clients and partners worldwide, ConsenSys collaborates with giants such as AWS, Microsoft, EY, WWF, P&G, and Hitachi. Their flagship product, MetaMask, is the largest non-custodial wallet for storing and managing crypto assets, with more than 30 million active users. ConsenSys invests its own funds in crypto assets within the Ethereum ecosystem and manages a corporate venture fund to support young projects. 💼💰\n\n\n\nThe Enterprise Ethereum Alliance, a non-profit consortium established in 2017, aims to provide organizations with the opportunity to implement and use Ethereum technology in their day-to-day business operations. The EEA connects Fortune 500 companies such as Microsoft, Intel, and JP Morgan with Ethereum experts, startups, and academic circles. Ethereum is the largest programmable blockchain in the world, leading in business, developer community, and DeFi activity. 🌐💻💰\n\n\n\nWith a strong management team in the form of the Ethereum Foundation actively working on improving the Ethereum blockchain, the future of Ethereum and its ecosystem looks brighter than ever. 🚀👨‍💼\n\n\n\nEthereum's Transition to PoS Reduces Energy Consumption by 99.95%!\n\n\n\nIn September 2022, Ethereum successfully transitioned from PoW to PoS, resulting in a 99.95% reduction in energy consumption and alleviating environmental concerns. Additionally, block rewards decreased by nearly 90%, significantly lowering ETH inflation.\n\n\n\nAs of 2022, the number of validators in the Ethereum network has grown by 79%, reaching 495,252. The amount of assets staked has exceeded 15.85 million ETH, with an inflow of around 7 million coins in 2022 alone.\n\n\n\nCurrently, Ethereum is transitioning from a monolithic structure where all transactions are processed at layer 1 to a modular model. More and more decentralized applications are launching on layer 2 networks like Arbitrum, Optimism, Polygon, and others, solving the problem of expensive and slow transfers on the Ethereum blockchain.\n\n\n\nMany blockchains like Hedera, Celo, Avalanche, Binance Smart Chain, and Filecoin, which have been in existence for several years, are betting on compatibility with the Ethereum Virtual Machine (EVM). According to Hedera's report, \"research shows that EVM is the default starting point for new Web3 developers.\"\n\n\n\nIt is highly likely that the future of blockchain will resemble other operating systems like Windows and Android, with one dominant ecosystem and one or two secondary ones, rather than a fragmented market of many different chains. The older Ethereum becomes, the harder it is to displace from the market.\n\n\n\nIn other news, Ethereum currently has around 122.4 million coins in circulation, with an inflationary model where new coins are emitted daily. Previously, when the network used the PoW consensus algorithm, mining produced around 13,000 ETH per day. Since transitioning to PoS in September 2022, the emission of new coins has been reduced by almost 90% to 1600 ETH per day.\n\n\n\nDespite this, EIP-1559 is still in effect, which means that a portion of ETH coins are burned daily (referring to network fees on Ethereum). If the average gas price in the Ethereum network exceeds 16 gwei per day, more than 1600 ETH will be burned, leading to deflation of the asset.\n\n\n\nEthereum is set to undergo some major changes in 2023. Here's what you need to know:\n\n\n\n🔥 Keep up with the daily burning and changing of ETH coins on this resource.\n\n\n\n💻 The Shanghai hard fork is expected to take place in March 2023 and will allow for the withdrawal of ETH from staking.\n\n\n\n💰 The implementation of EIP-4844 in 2023 will drastically reduce transaction processing costs in second-layer solutions such as Optimism and Arbitrum by 10-100 times, opening the door to non-financial transactions in gaming, social media, and other industries.\n\n\n\n🔥 Deflation may be in the cards for Ethereum as the total number of ETH coins in circulation may decrease by 1% in 2023 due to the swift growth of Layer-2 solutions like Arbitrum, Optimism, and Polygon.\n\n\n\n📈 The number of unique addresses in the Ethereum network is growing rapidly year over year.\n\n\n\n💻 After the Shanghai hard fork is implemented, staking ETH coins will become more accessible. Currently, only 13% of ETH coins are locked in staking, whereas in other PoS networks, this figure reaches 60%. With the growth of staked coins, the market supply of ETH will decrease.\n\n\n\n💰 2023 will be the first year in which the number of ETH coins in circulation will either remain practically unchanged or decrease (deflation).\n\n\n\n🚀 Stay tuned for more information and analysis on these exciting developments!\n\n"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1zZXBvbGlhLXRlc3RuZXQtc3VjY2Vzc2Z1bC1idXQtdml0YWxpay1hZG1pdHMv0gFRaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2V0aGVyZXVtLXNlcG9saWEtdGVzdG5ldC1zdWNjZXNzZnVsLWJ1dC12aXRhbGlrLWFkbWl0cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Ethereum: Sepolia testnet successful, but Buterin admits… - AMBCrypto News",
        "content": "The Ethereum Sepolia Testnet was successful as validators geared up for the Shanghai Upgrade.\n\nThe Georli Testnet is next but Vitalik said there is more work to be done.\n\nAs the Shanghai Upgrade inched closer, Ethereum [ETH] developers successfully deployed the Sepolia Testnet on the blockchain. The Sepolia, the second Testnet, finalized its checkpoint at 56830 while the epoch activated at 56832. Also, several Ethereum developers confirmed that the Georli Testnet would be next before the final upgrade.\n\nRead Ethereum’s [ETH] Price Prediction 2023-2024\n\nThe developers used the Testnet to simulate the staking withdrawal activity that would eventually happen with the Shanghai Upgrade on the Ethereum Mainnet. And, as soon as Georli is announced successful, validators who staked 32 ETH and above can withdraw their rewards.\n\nIt is noteworthy to reference that Ethereum also passed through similar stages of Testnets before the success of the Merge in 2022.\n\nAmbush on the road to Shanghai\n\nAt one point, the validator count decreased significantly around the fourth quarter of 2022. However, the number of addresses holding 32 ETH and more improved from the downturn of January. According to Glassnode’s data, the addresses slightly decreased to 129,364 as of 25 February. This metric describes the Ethereum externally owned address qualified for validating on ETH 2.0.\n\nWhile the drop might have signaled a lack of interest, the on-chain analytic platform revealed only minimal voluntary validator exit. Between 10 – 26 February, the number of departures was only 20 among the hundreds of thousands.\n\nMeanwhile, there have been fluctuations in the participation rate since the Ethereum Foundation confirmed the period the Shanghai Upgrade would occur.\n\nThe participation rate measures validator responsiveness while tracking the proportion of missed blocks and total slots. At press, the participation rate was 99.462%. This implied that involvement in staking was at one of its highest points since the new year began.\n\nTemporary glitches bring more work\n\nBut since the Testnet announcement, only a few reactions have come from the Ethereum community — most enthusiastic. However, the blockchain co-founder Vitalik Buterin took to his blog to share some thoughts.\n\nHow much are 1,10,100 ETHs worth today?\n\nAlthough unrelated to the Sepolia success, Vitalik referred to the glitches ETH wallets had in times past, as well as challenges with the User Interface (UI).\n\nHe also pointed out the previous transaction delays but noted that EIP-1559 had helped improved block stabilization time. However, he did not fail to admit that more needs to be done. The founder opined:"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS90aGUtY3J5cHRvLW1hcmtldC1iaWRlcy1pdHMtdGltZS0xMjk2NTc00gFEaHR0cHM6Ly9hbXAuZnhlbXBpcmUuY29tL2VuL3RoZS1jcnlwdG8tbWFya2V0LWJpZGVzLWl0cy10aW1lLzEyOTY1NzQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Price – Bullish Short-term Technical Picture for Bitcoin and Ethereum - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy92aXRhbGlrLWJ1dGVyaW4tc2F5cy1tb3JlLXN0aWxsLW5lZWRzLXRvLWJlLWRvbmUtb3Zlci1oaWdoLWV0aGVyZXVtLXR4bi1mZWVz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Vitalik Buterin says 'more still needs to be done' over high Ethereum txn fees - Cointelegraph",
        "content": "In a new blog post published on Feb. 28, Ethereum co-founder Vitalik Buterin documented the continued need to improve the network to better facilitate Ether (ETH) as a means of payment.\n\nButerin shared how he tried to pay for tea for himself and friends at a coffee shop in Argentina in 2021 but had to pay 0.01 ETH (around $40 at the time), as that was the minimum deposit for the owner’s exchange account. “I did not mind the 3x overpayment and treated it as a tip,” the co-founder wrote.\n\nIn another instance, Buterin explained how he tried to pay for tea at another location in 2022, but two separate transactions failed due to requiring “extra gas to process the transfer” and a UI glitch in his mobile wallet. Buterin also raised the issue of unpredictable transaction times, writing:\n\n“Many times, there has been a surprisingly long time delay between my transaction getting accepted on-chain, and the service acknowledging the transaction, even as ‘unconfirmed.’ Some of those times, I definitely got worried that there was some glitch with the payment system on their side.”\n\nAccording to Buterin, outliers nevertheless remain on the Ethereum network despite recent improvements. “If you send a transaction at the same time as when many others are sending transactions and the base fee is spiking up, you risk the base fee going too high and your transaction not getting accepted,” he wrote. “Even worse, wallet UIs suck at showing this. There are no big red flashing alerts, and very little clear indication of what you’re supposed to do to solve this problem.” Buterin added that even experts could be confused about how to speed up transactions in such cases.\n\n“Good user experience is not about the average case, it is about the worst case. A UI that is clean and sleek, but does some weird and unexplainable thing 0.723% of the time that causes big problems, is worse than a UI that exposes more gritty details to the user but at least makes it easier to understand what’s going on and fix any problem that does arise.”\n\nAmong other issues, Buterin raised the problem of the internet being “not 100% reliable” and the need for possible offline proof that customers indeed transfered their transaction data directly to the merchant. Another issue raised was “losing a small amount of BTC and ETH” due to secret-sharing-based off-chain social recovery methods for wallets, which Buterin deemed as fragile.\n\nAccording to YCharts, Ethereum transaction fees have fallen to an average of $0.656 at the time of publication, which is much lower than the average of $20 witnessed during the peak of the crypto bull market in 2021.\n\n“Along with the all-important issue of high transaction fees due to scaling not yet being fully solved, user experience is a key reason why many Ethereum users, especially in the Global South, often opt for centralized solutions instead of on-chain decentralized alternatives that keep power in the hands of the user and their friends and family or local community.”"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMilAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAzLzAxL2NyeXB0by1tYXJrZXQtZmVicnVhcnktcm91bmR1cC1iaXRjb2luLWxheWVyLTItcHJvdG9jb2wtc3RhY2tzLWV0aGVyZXVtLXN0YWtpbmctZGVyaXZhdGl2ZS10b2tlbnMtc3VyZ2Uv0gGYAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDMvMDEvY3J5cHRvLW1hcmtldC1mZWJydWFyeS1yb3VuZHVwLWJpdGNvaW4tbGF5ZXItMi1wcm90b2NvbC1zdGFja3MtZXRoZXJldW0tc3Rha2luZy1kZXJpdmF0aXZlLXRva2Vucy1zdXJnZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Crypto Market February Roundup: Bitcoin Layer 2 Protocol Stacks, Ethereum Staking Derivative Tokens Surge - CoinDesk",
        "content": "“Altcoin cycles tend to be short-lived, but this is beyond the norm and has all the hallmarks of a bored market chasing opportunities, in addition to no new capital inflows,” he wrote, adding: “Poor liquidity facilitates this erratic pattern, and you do not want to be the one holding the bag when the music ends.”"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZGVjcnlwdC5jby8xMjIyOTUvZXRoZXJldW0tZ2FzLWZlZXMtYXJlLXNsb3dseS1jbGltYmluZy1hcy1uZnQtbWFya2V0LXJlYm91bmRz0gFcaHR0cHM6Ly9kZWNyeXB0LmNvLzEyMjI5NS9ldGhlcmV1bS1nYXMtZmVlcy1hcmUtc2xvd2x5LWNsaW1iaW5nLWFzLW5mdC1tYXJrZXQtcmVib3VuZHM_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Ethereum Gas Fees Are Slowly Climbing as NFT Market Rebounds - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum’s fee market is slowly returning to form amid a recent resurgence in NFT trading activity across the network.\n\nAccording to on-chain analytics firm Glassnode, the median price for gas powering Ethereum transactions cost roughly 10 to 20 gwei over the past 9 months. This month, that cost had risen to 38 gwei—higher than during key bear market events including FTX’s collapse in November (36 gwei) and Binance’s “bank run” in December (24 gwei).\n\n“The incremental nature of the gas demand suggests an early resurgence of network activity may be underway,” wrote Glassnode in its weekly newsletter on Monday.\n\nAD\n\nAD\n\nGas prices fluctuate with network demand, meaning costs rise as more users seek to include their transactions in the next Ethereum block. In this case, rising activity in Ethereum’s NFT market appears to be a primary source of the newfound demand for gas.\n\nSpecifically, gas used by Ethereum NFT transactions has risen by 97% for two months straight, approaching levels last seen during the “NFT boom” from mid-2021 to mid-2022. Much of that rising activity is thanks to Blur, an NFT marketplace launched in October that’s now overtaken OpenSea in terms of trading volume.\n\n“The recent attention surrounding Blur has led to a surge in demand for block space, resulting in increased fees for validators, and more ETH being burnt via EIP1559,” explained Glassnode.\n\nOther drivers of NFT activity include all-new projects launched by the industry’s biggest names, including Yuga Labs’ Dookey Dash game and the announcement of Doodles 2 last month.\n\nNevertheless, Ethereum network adoption rate remains low. The number of new addresses being generated is still 40% below what it was 12 months ago. This suggests that the recent revival in NFT activity has been spurred among existing NFT users, rather than new ones.\n\n\n\nNot all corners of the Ethereum ecosystem are seeing rising revenues. In an interview with Decrypt on Friday, Doodle CEO Julian Holguin said that the competition between OpenSea and Blur is constricting cash available to many NFT projects that relied on secondary royalties for revenue.\n\nAD\n\nAD"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vY29pbmdhcGUuY29tL3Ryb24tZm91bmRlci1qdXN0aW4tc3VuLWJlY29tZXMtdG9wLWhvbGRlci1vZi1zdGFrZWQtZXRoZXJldW0tYW1pZC1zaGFuZ2hhaS11cGdyYWRlL9IBbWh0dHBzOi8vY29pbmdhcGUuY29tL3Ryb24tZm91bmRlci1qdXN0aW4tc3VuLWJlY29tZXMtdG9wLWhvbGRlci1vZi1zdGFrZWQtZXRoZXJldW0tYW1pZC1zaGFuZ2hhaS11cGdyYWRlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Justin Sun Becomes Top Staked Ethereum Holder Amid Shanghai Upgrade - CoinGape",
        "content": "Tron founder Justin Sun has become one of the largest holders of Lido Staked ETH (stETH), as per the recent on-chain data. Justin Sun has been actively staking Ethereum on the liquid staking platform Lido Finance ahead of the most-awaited Ethereum Shanghai upgrade in March.\n\nAccording to on-chain data shared by OKLink on February 27, two addresses beginning with 0x176F and 0x611F linked to Tron founder Justin Sun have become the 5th and 6th largest holders of stETH, respectively.\n\nadvertisement\n\nJustin Sun became one of the largest holders as he again staked over 88,000 Ethereum in Lido today through 0x611F. CoinGape earlier reported, Justin Sun staked over 200,000 ETH through 0x176F. His personal staked ETH has exceeded 300K Lido staked ETH (stETH), which is about $500 million.\n\nIt clearly indicates that Justin Sun is bullish on the Ethereum Shanghai upgrade and wants to utilize the opportunity. In fact, Ethereum staking continues to rise as the Shanghai upgrade comes near. Justin Sun has continued to deposit ETH into Lido all through the weekend.\n\nAlso Read: Ethereum Shanghai Upgrade, Developers Reveal Key Details Ahead Of Sepolia Upgrade\n\nEthereum Staking Rises Ahead of Shanghai\n\nAs per the current on-chain data, over 17.27 million ETH worth $28.67 billion have been deposited into the Beacon Chain. While increasing ETH staking on the Beacon Chain indicates signs of Ethereum security and adoption, Ethereum core developers need to enable withdrawals to maintain a balance on the network.\n\nData from Nansen indicates the number of unique staking depositors stands at roughly 97.2K. Data sourced from BeaconScan shows that the number of active validators has increased to 528,934.\n\nMeanwhile, Ethereum developers are all prepared for the Shapella (Shanghai/Capella) network upgrade scheduled on the Sepolia testnet at block height 56832, which is expected at 04:04:48 UTC on February 28. It will enable validators to withdraw their Ethereum staked on the Beacon Chain to the execution layer.\n\nEthereum price is currently trading at $1,660, up nearly 4% in the last 24 hours. The 24-hour low and high for the ETH price are $1,599 and $1,661, respectively. Meanwhile, stETH price trades at $1,647, up nearly 3%.\n\nAlso Read: Bitcoin Price Risks Massive Fall As Central Banks Sparks Bearish Sentiment?"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vZGVjcnlwdC5jby8xMjIzMTcvd2lubmluZy1kb29rZXktZGFzaC1rZXktbmZ0LXNlbGxzLXRvLWJpbGxpb25haXJlLWZvci0xLTYzLW1pbGxpb27SAWFodHRwczovL2RlY3J5cHQuY28vMTIyMzE3L3dpbm5pbmctZG9va2V5LWRhc2gta2V5LW5mdC1zZWxscy10by1iaWxsaW9uYWlyZS1mb3ItMS02My1taWxsaW9uP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Winning ‘Dookey Dash’ Key NFT Sells to Billionaire for $1.63 Million in Ethereum - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEsports player Kyle “Mongraal” Jackson has sold his winning “Dookey Dash” key NFT to billionaire entrepreneur Adam Weitsman for 1,000 ETH, or $1.63 million, the 18-year-old gamer announced Monday. Mongraal had previously listed the key NFT for sale for 3,333 ETH, which is equivalent to $5.43 million.\n\n“Super nice guy and thrilled the sale went through with him,” Mongraal said of the sale to Weitsman.\n\nI have agreed to sell the key for 1000 ETH to @AdamWeitsman. Super nice guy and thrilled the sale went through with him. A special thank you to @yugalabs for hosting an incredible competition. I look forward to competing in future events. Royalties will be paid in full.\n\n1/2 — Mongraal (@Mongraal) February 27, 2023\n\nAD\n\nAD\n\n“A special thank you to Yuga Labs for hosting an incredible competition. I look forward to competing in future events. Royalties will be paid in full,” the content creator added.\n\nThis means “Dookey Dash” creators Yuga Labs will receive 5% of the sale in royalties, which will be a noteworthy 50 ETH, or $81,500.\n\nMongraal enlisted the help of a Stanford grad and cofounder of NFT community Underground who goes by “Tre” online to help him with the sale.\n\n“I helped with negotiations with interested bidders,” Tre told Decrypt via Twitter DM. “Just wanted to help make sure he was getting the right price the key deserved.”\n\nLast week, the Web3 community UpDAO placed a bid for 690 WETH on the asset, which at the time was about $1.1 million. Meme site 9GAG later placed a 999 ETH bid on the key but was ultimately outbid by Weitsman, who currently sports a Bored Ape Yacht Club (BAYC) NFT as his Twitter profile picture.\n\nAD\n\nAD\n\nWhile Weitsman may be most known for his scrap metal businesses and massive social media following, the billionaire is also fond of cryptocurrency and started a crypto mining business, Viridium, in 2021.\n\nMongraal has not yet responded to Decrypt’s requests for comment."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvbXlzdGVyaW91cy1ldGhlcmV1bS13YWxsZXQtbm93LXdvcnRoLTQwMG3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "'Mysterious' Ethereum Wallet Now Worth $400M+ - Watcher Guru",
        "content": "Conor Grogan, Product Strategy Director at Coinbase, recently took to Twitter to reveal “one of the most mysterious addresses in all of crypto.” Using on-chain data, the executive highlighted that the address bought Ethereum tokens during the ICO in 2014. The wallet remains untouched, per the executive.\n\nFurthermore, Conor pointed out that the wallet is now worth more than $400 million, marking a 5333-fold growth. He additionally revealed that the address received millions of tokens via airdrops.\n\nOne of the most mysterious addresses in all of crypto:\n\n-Bought $75k worth of ETH at the ICO in '14\n\n-Completely untouched wallet; has never made a single transaction\n\n-Wallet now worth $400M+, a 5333x\n\n-Received $6.5M in airdrops just by hodling (a 87x on initial investment alone) pic.twitter.com/wBpw9pQcAB — Conor (@jconorgrogan) February 26, 2023\n\nAlso Read: Kevin O’Leary: Crypto Exchanges Will Continue Going To ‘ZERO’\n\nDeep diving into the Ethereum wallet\n\nData from Etherscan confirmed that the first transaction involving 250k Ethereum tokens took place 2768 days ago, i.e., around 7.5 years ago. All transactions in the wallet thus far have been inflows. Nothing has ever been sent out.\n\nA total of 45 transactions have taken place since the wallet was created. Notably, the latest transfers involving 0.0001 ETH and 0.001 ETH happened around four hours ago at press time.\n\nData from Etherscan further brought to light that there were around 202 assets held by the wallet. At press time, they were cumulatively worth $409 million.\n\nAlso Read: 2023’s ‘Largest Exit Scam’ on Arbitrum Unfolds, $2M Stolen\n\nLeaving aside ETH, the wallet was also in possession of other cryptos like HEX and OMG Network’s native token OMG, among others.\n\nChalking out the possible reason for the wallet’s inactivity, the Coinbase executive opined,\n\n“Imagine the mental fortitude of holding through multiple bull and bear markets. Though the far more likely outcome is they lost their keys.”\n\nOpining on similar lines, another user tweeted,\n\n“Hopefully they are alive and just diamond handing.”\n\nHowever, a few from the space did not shy away from outrightly speculating that the owner of the wallet could perhaps be dead.\n\nHopefully they are alive and just diamond handing — Joyce 📚 (@JoyceanNoia) February 27, 2023\n\nWell, apart from this wallet, several other prominent people from the space chipped in and bought Ethereum during its early days. As reported recently, Reddit’s co-founder, Alexis Ohanian, was one of them. He purchased 50,000 Ethereum tokens in 2014, during its pre-sale. The average buy price was around 30 cents per token. Ohanian forked out $15,000 in total to acquire the tokens.\n\nAlso Read: Reddit Co-Founder Purchased 50,000 Ethereum in 2014"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiMmh0dHBzOi8vd3d3LmF6b3JvYm90aWNzLmNvbS9OZXdzLmFzcHg_bmV3c0lEPTEzNjUx0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Shibanft.ai Gets Ready to Launch New AI Technology on the Ethereum Blockchain - AZoRobotics",
        "content": "Shibanft.ai Launches Groundbreaking AI Technology Set to Revolutionize Industry Standards on Ethereum Blockchain.\n\nShibanft.ai, the innovative AI company, is all set to launch its new AI technology on the Ethereum blockchain this week. This technology is designed to revolutionize industry standards and help to grow the Shibarium blockchain and ecosystem.\n\nOne of the most unique features of the Shibanft.ai project is their Gas Checker Google Extension, which provides real-time gas prices and a gas limit calculator for Ethereum transactions. This extension helps users to save money on transaction fees and ensures that transactions are processed quickly and efficiently.\n\nIn addition to the Gas Checker, Shibanft.ai also offers a Scam Checker Google Extension. This extension allows users to check if a website or token is a known scam, protecting them from fraudulent activities in the cryptocurrency space.\n\nShibanft.ai also offers a GPT3 chat on their website, which is powered by OpenAI's language model. This chat allows users to interact with the AI, which can answer questions and provide information on various topics.\n\nAnother notable feature of Shibanft.ai is their multiple image generator, which uses the DALL-E AI models to generate multiple images from a single text input. This feature can be used for a variety of purposes, including content creation and design.\n\nThe Shibanft.ai team has also developed a Telegram bot estate that includes an image generator, a TradingView-enabled advanced chat and technical indicator bot, a Binance recently added tokens bot, and a machine learning-enabled Binance divergence bot. These bots provide users with real-time market data and insights, allowing them to make informed decisions about their trades.\n\nThe technology developed by Shibanft.ai is already live and is far outweighing their competitors in the AI and machine learning space. The team at Shibanft.ai is composed of experts in the field of AI and blockchain, and their public team approach ensures transparency and accountability.\n\nThe launch of Shibanft.ai on the Ethereum blockchain this week is set to be a game changer in the world of AI and machine learning. With their innovative technology and commitment to providing the best possible service to their users, Shibanft.ai is poised to become a leading player in the industry.\n\n\"We are excited to launch our new AI technology on the Ethereum blockchain,\" said a spokesperson for Shibanft.ai. \"Our team has worked tirelessly to develop this technology, and we are confident that it will revolutionize industry standards and help to grow the Shibarium blockchain and ecosystem.\"\n\nShibanft.ai is committed to providing the best possible service to their users and will continue to develop innovative technology to meet their needs. With their Gas Checker Google Extension, Scam Checker Google Extension, GPT3 chat, multiple image generator, and Telegram bot estate, Shibanft.ai is at the forefront of the AI and machine learning space.\n\nSource: https://shibanft.ai/"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiKWh0dHBzOi8vdGhlZGVmaWFudC5pby96ZXJvLWtub3dsZWRnZS0yMDIz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 20:13:15 GMT",
        "title": "The Zero-Knowledge Moment Has Arrived - The Defiant - DeFi News",
        "content": "A Rundown on the Slew of ZK Developments Coming This Year\n\nBy: Evan Shapiro • Loading...\n\nOp-ed\n\nZero-knowledge rose to prominence within crypto last year primarily as a tool for enhancing scalability, particularly within the Ethereum ecosystem.\n\nBut we are only at the tip of the iceberg for practical implementation of ZK.\n\nIn recent months, the impact of Zero Knowledge (ZK) on crypto and decentralized applications is becoming plain to see As 2023 unfolds, expect to see major developments of ZK in terms of bridge security, wallet privacy, KYC compliance, and decentralized identity on social media.\n\nMoving Beyond Phase 1: ZK for Scalability\n\nWhy is ZK catching on? In a word, scalability.\n\nConstrained throughput on Ethereum leads to expensive transactions, which hinders a chain’s ability to support applications at any real scale — let alone one competitive with web2. One way to enhance scalability that made major strides last year is deploying zkEVMs, which make it very cheap to fully verify large numbers of EVM transactions.\n\nWhat is zkSync? A Step-by-Step Guide to the High-Capacity Blockchain Network\n\nPolygon plans to release its Beta zkEVM on Ethereum this spring while Matter Labs’ solutions zkSync opened up mainnet for deployment in February. These developments alone demonstrate significant progress from testnet announcements of 2022.\n\nNext Step: ZK for Security\n\nIt’s inevitable that we will have a multichain future with different networks and layers serving different purposes within the greater crypto economy. Bridges serve as connective highways between blockchains. Unfortunately, bridges are still a nascent development and so lack the same level of security as many Layer 1s. Hackers exploited this weakness as much as possible last year, resulting in $3.1B stolen from bridge hacks—comprising 64% of all DeFi hacks for 2022.\n\nTransactions on Arbitrum Leapfrog Ethereum Lower Fees Propel Layer 2 Blockchain Past Ethereum For First Time\n\nConnecting chains with a multisig is fine if risk tolerance is high, but ideally, we should have some secure, verifiable way of connecting multiple chains together. ZKPs are starting to be applied here, with zkBridging, with =nil; Foundation making significant progress in this area. But expect others to follow, as crypto prepares to have trusted secure connectivity across all of the L1s.\n\nAddressing MetaMask & Infura Privacy Infractions\n\nIt was highly disturbing to many in the crypto community when ConsenSys announced that their self-custody wallet, MetaMask, would collect user IP addresses when used with default Remote Procedure Call (RPC) application Infura.\n\nIP addresses can then be used to identify a user’s location and block transactions from going through if coming from within censored countries or regions with uncertain compliance requirements, which is exactly what MetaMask was caught doing, impacting users in Venezuela.\n\nZK can also offer a solution to this issue by being leveraged to make running your own wallet client that much more accessible. If users ran their own full node, they would be a participant in the process of verifying transactions settling on-chain, which could mitigate actions by third party providers to censor based on limited information.\n\nThe demand for trustless full nodes could kick in during the next bull market as activity ticks up and trust concerns come back up to the surface.\n\nTypically, running a full node is computationally resource-intensive, but by deploying recursive ZKPs for efficient verification, the computational cost for running a node can be dramatically reduced, increasing the feasibility for the everyday user.\n\nThe demand for trustless full nodes could kick in during the next bull market as activity ticks up and trust concerns come back up to the surface. The drawbacks of relying on quasi-centralized wallet and data providers have become increasingly apparent, making the need for secure and decentralized node solutions that much more pressing.\n\nInstitutional Involvement in Crypto is Putting Pressure on Compliance Needs\n\nWith TradFi institutions getting more deeply involved in crypto, the need for regulatory compliance intensifies. In many cases, these demands from financial institutions seem to conflict with the core values of crypto: decentralization and empowerment of users to control their own value.\n\nThese two camps do not need to be at odds. ZK can be leveraged to enable users to share a proof that they meet compliance requirements, without revealing personal information that could put them at risk of a hack.\n\nWhat Is DAI? A Step-by-Step Guide to One of DeFi's Most Important Stablecoins\n\nThis has use cases for CBDCs and dApps seeking to comply with regulations without jeopardizing user information or the core values of user data privacy. Governance decisions pertaining to KYC can also benefit from ZK, with techniques like zkKYC, private, scalable order books and private voting for key on-chain decisions needed to create environments that are compliant with regulations.\n\nOverall, the involvement of financial institutions will be net-positive for the space, bringing in massive amounts of liquidity and cementing DeFi as the new backbone for global finance. ZK will smooth the path to that transition by making compliance feasible.\n\nBuilding More User-Aligned Platforms, with Privacy and zkIdentity\n\nThe last place where ZK could have a massive impact is in building trustless, user-owned platforms. There is a huge disconnect between the centralized nature of the current, monolithic platform companies, and the users they intend to serve.\n\nMuch of the time, individual platforms work as expected – but we increasingly see a higher frequency of platforms living out failures borne out of a lack of inherent alignment with their users.\n\nJust last year, we saw this danger when FTX was exposed for not managing user funds as promised. The exchange came under investigation by several regulatory agencies, and declared bankruptcy, resulting in the closure of the platform and leaving customers dependent on the courts for recourse. In terms of its corporate structure, FTX was a traditional, centralized platform.\n\nBuilding a decentralized exchange with a user experience equal to or better than centralized ones seems now possible within crypto. Advancements in verifiable private identity with zkIdentity, higher throughputs of complex transactions possible on chain with zkRollups, and technology for making sensitive parts of systems private can all help advance DEXs.\n\nThese improvements allow the construction of decentralized platforms with user experiences rivaling or superior to those provided by centralized companies, which could be very meaningful to users and institutions in reducing substantial counterparty risks when using these otherwise convenient and useful platforms.\n\nThese counterparty risks are present not just on crypto exchanges like FTX, but also other platforms outside of crypto. Another space that has had visible challenges with platform trust and risk is social media, with users of Twitter and Meta both facing challenges in these areas.\n\nSuch is the nature of centralized platforms wherein a small group of executives, or, in this case, a single individual, has the power to upend the entire system.\n\nThe acquisition of Twitter by a single stakeholder, Elon Musk, created uncertainty around the platform’s future. Shaking up a system can sometimes yield positive results, but it also risks destroying the value and user benefit that has been created by Twitter so far.\n\nSuch is the nature of centralized platforms wherein a small group of executives, or, in this case, a single individual, has the power to upend the entire system. Another example of this would be Meta’s amplification algorithm that optimizes profits over social welfare and their continued poor monitoring and faulty assessment of misinformation.\n\nThere is an alternative model, made possible by decentralized systems built on blockchain networks, that empowers users with control over their own data and, ideally with a voice in the governance of the “public square.” ZK will be key to enable shielded, private voting within those governance systems through zk-identities.\n\nUser identity is an essential component of many social platforms, given the interactive and communicative nature of social discourse, but the difference in Web3 is that users own their identity data as opposed to the platforms.\n\nZK as Part of Key Infrastructure for Building a Better Future\n\nWe would be remiss if we did not mention the impact of AI, given the rise of ChatGPT and repercussions across content creation for news, entertainment, advertising, marketing, and even healthcare and education.\n\nAI platforms are particularly centrally controlled, due to the high costs of training the most impactful models, and the organizational requirements of building and deploying them.\n\nWhy Regulated Custody is the Next Step for DeFi The Loss of Trust in Crypto Needs a Response — Regulated Custodians\n\nFurther developments in AI will raise the demand for aligned platforms, as their ability to exploit existing misalignment for profit within existing platforms comes into effect and as the centralized control of powerful AI systems itself becomes suspect.\n\nAn increased need for decentralized systems that respect user privacy, integrate zkIdentity, and provide verifiable computation will be more and more useful in this coming environment, and ZK could play a powerful role in that.\n\nEvan Shapiro is the CEO of Mina Foundation & Co-Founder of Mina Protocol."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy93aW5uaW5nLWRvb2tleS1kYXNoLWtleS1uZnQtMjI0MDA0NzI1Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Winning 'Dookey Dash' Key NFT Sells to Billionaire for $1.63 Million in Ethereum - Yahoo Finance",
        "content": "Esports player Kyle “Mongraal” Jackson has sold his winning “Dookey Dash” key NFT to billionaire entrepreneur Adam Weitsman for 1,000 ETH, or $1.63 million, the 18-year-old gamer announced Monday. Mongraal had previously listed the key NFT for sale for 3,333 ETH, which is equivalent to $5.43 million.\n\n“Super nice guy and thrilled the sale went through with him,” Mongraal said of the sale to Weitsman.\n\nI have agreed to sell the key for 1000 ETH to @AdamWeitsman. Super nice guy and thrilled the sale went through with him. A special thank you to @yugalabs for hosting an incredible competition. I look forward to competing in future events. Royalties will be paid in full.\n\n1/2 — Mongraal (@Mongraal) February 27, 2023\n\n“A special thank you to Yuga Labs for hosting an incredible competition. I look forward to competing in future events. Royalties will be paid in full,” the content creator added.\n\nThis means “Dookey Dash” creators Yuga Labs will receive 5% of the sale in royalties, which will be a noteworthy 50 ETH, or $81,500.\n\nMongraal enlisted the help of a Stanford grad and cofounder of NFT community Underground who goes by “Tre” online to help him with the sale.\n\n“I helped with negotiations with interested bidders,” Tre told Decrypt via Twitter DM. “Just wanted to help make sure he was getting the right price the key deserved.”\n\nLast week, the Web3 community UpDAO placed a bid for 690 WETH on the asset, which at the time was about $1.1 million. Meme site 9GAG later placed a 999 ETH bid on the key but was ultimately outbid by Weitsman, who currently sports a Bored Ape Yacht Club (BAYC) NFT as his Twitter profile picture.\n\nWhile Weitsman may be most known for his scrap metal businesses and massive social media following, the billionaire is also fond of cryptocurrency and started a crypto mining business, Viridium, in 2021.\n\nMongraal has not yet responded to Decrypt’s requests for comment."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL2NyeXB0by1uZXdzLWFzaWEtYml0Y29pbi1ldGhlcmV1bS1zdXJnZS13aGlsZS10aGUtY3J5cHRvLW1hcmtldC1jYXAtc29hcnMtYS1saXR0bGUv0gFyaHR0cHM6Ly9jb2lucGVkaWEub3JnL25ld3MvY3J5cHRvLW5ld3MtYXNpYS1iaXRjb2luLWV0aGVyZXVtLXN1cmdlLXdoaWxlLXRoZS1jcnlwdG8tbWFya2V0LWNhcC1zb2Fycy1hLWxpdHRsZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Crypto News Asia: Bitcoin, Ethereum Surge While the Crypto Market Cap Soars a Little - Coinpedia Fintech News",
        "content": "A passionate cryptocurrency and blockchain author qualified to cover every event in the crypto space. Researching minute occurrences and bringing new insights lie within the prime focus of my task.\n\nGood morning Asia, Here’s the top crypto news for today:\n\nAfter a quiet weekend, the prices of top cryptocurrencies saw gains on Monday.\n\nBitcoin failed to rise beyond $23,500 and maintained a sluggish trend throughout the weekend. In the meantime, the altcoins also followed the star crypto and maintained a narrow trend. However, the market capitalization slightly raised to $1.07 trillion with a rise of 1.27% but the trading volume remain slashed by 2.63%. Bitcoin dominance is currently 42.19%, with an increase of 0.01% over the day.\n\nWhile Ethereum (ETH) maintained stability within the $1,600 range, other major altcoins such as Dogecoin (DOGE), Solana (SOL), Ripple (XRP), and Litecoin (LTC) experienced a mix of gains and losses. Among them, NEO token saw the highest increase, with a surge of more than 11 percent in the past 24 hours.\n\nTop Crypto News\n\nSolana network registers the first network outrage for 2023 after recording nearly 8 network halts in 2022\n\nThe network recently faced a slowdown in block production following an upgrade in the validator software, which disrupted the transactions. This further disrupted the transactions and led to the validators downgrading the software. However, the developers restarted the network twice as they had chosen the incorrect point to resume prior.\n\nIMF is in the mood to regulate the Crypto-space instead of an outright ban\n\nIn the wake of the G-20 summit that is to be held in India this year, the IMF managing director, Kristalina Georgieva said that the agency is in favor of regulating the crypto-space than banning them.\n\nUkraine received more than $70 million in donations in crypto\n\nEver since Russia began its ‘special military operations’ in Ukraine, the world has imposed multiple sanctions against Russia and donated heavily to Ukraine. Interestingly, Ukraine received $28.9 million in ETH, $22.8 million in BTC, and $11.6 million in Tether."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vd3d3LmFsdGNvaW5idXp6LmlvL2RlZmkvdHdvLW1ham9yLWJyaWRnZXMtZm9yLXBvbGthZG90LWRvdC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Two Major Bridges for Polkadot (DOT) - Altcoin Buzz",
        "content": "Crypto bridges play a huge role in the quest for interoperability. They serve as a link for the exchange or movement of tokens between chains. And their arrival has led to an easier user experience.\n\nThere are many different types of bridge designs, from more centralized and trusted to more decentralized and trustless. For the sake of its environment, Polkadot prefers the latter bridge design. Bridges are used to connect the Polkadot ecosystem to external blockchains like Tezos, Ethereum, and Bitcoin, among others.\n\nThe DOT token has three core purposes:\n\nStaking for operations and security, Facilitating network governance, Bonding tokens to connect parachains.\n\nSo, let’s look at 2 top bridges for Polkadot’s DOT token.\n\n1) Wanchain\n\nWanchain, one of the leading decentralized blockchain interoperability solutions, is integrated with Polkadot. The integration links Polkadot to the wider cross-chain DeFi community. There are already deployed direct bridges between Polkadot and Ethereum: Wanchain, Moonriver, and Avalanche.\n\nThis means that developers on all of these blockchain networks can create decentralized blockchain applications utilizing $DOT. Also, users can trade $DOT cross-chain and use it with EVM-compatible smart contracts.\n\n2) Interlay\n\nLast year. Interlay, a blockchain company, announced the launch of a Bitcoin based cross-chain bridge on Polkadot. The bridge, known as interBTC (iBTC), enables the deployment of Bitcoin on non-native blockchains for NFTs, cross-chain transfers, and DeFi, among other things.\n\nSource: Interlay\n\nAs a Polkadot Parachain, Interlay delivers best-in-class proof-of-stake security and compatibility with Ethereum, Cosmos, and many other blockchains. it empowers Bitcoin holders to put their BTC to use.\n\nExplaining the concept behind the project, Interlay co-founder and CEO Alexei Zamyatin said: “Bitcoin is the driving force behind global crypto adoption, while Polkadot, Ethereum, & co. is where technological innovation is happening. With interBTC, we combine the best of both worlds while preserving the trustless nature of Bitcoin.”\n\nPolkadot has a pretty different tech, making bridging a bit difficult. However, it is only a matter of time before we have more $DOT bridges in the system.\n\n⬆️ For more cryptocurrency news, check out the Altcoin Buzz YouTube channel.\n\n⬆️ Our popular Altcoin Buzz Access group generates tons of alpha for our subscribers. And for a limited time, it’s Free. Click the link and join the conversation today.\n\nDisclaimer\n\nThe information discussed by Altcoin Buzz is not financial advice. This is for educational, entertainment, and informational purposes only. Any information or strategies are thoughts and opinions relevant to the accepted levels of risk tolerance of the writer/reviewers and their risk tolerance may be different than yours. We are not responsible for any losses that you may incur as a result of any investments directly or indirectly related to the information provided. Bitcoin and other cryptocurrencies are high-risk investments so please do your due diligence. This article has been sponsored by Wanchain. Copyright Altcoin Buzz Pte Ltd."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMilAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAyLzI3L3N0YXJ0LW9mLXRoZS1lbmQtdGVzdG5ldC1nb2VybGktZXRoZXItc3Bpa2VzLXRvLTE2MC1hcy10cmFkZXJzLWp1bXAtb24tb3Bwb3J0dW5pdHktbWVhbnQtZm9yLWRldmVsb3BlcnMv0gGYAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDIvMjcvc3RhcnQtb2YtdGhlLWVuZC10ZXN0bmV0LWdvZXJsaS1ldGhlci1zcGlrZXMtdG8tMTYwLWFzLXRyYWRlcnMtanVtcC1vbi1vcHBvcnR1bml0eS1tZWFudC1mb3ItZGV2ZWxvcGVycy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Start of the End? Testnet Goerli Ether Spikes to $1.60 as Traders Jump on Opportunity Meant for Developers - CoinDesk",
        "content": "Start of the End? Testnet Goerli Ether Spikes to $1.60 as Traders Jump on Opportunity Meant for Developers\n\nLayerZero offered developers a way to get their hands on intrinsically worthless gETH tokens for testing purposes – but traders jumped on that opportunity, leading to an uncannily high-valued market.\n\nBy Shaurya Malwa Feb 27, 2023 at 7:00 a.m. UTC"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LnRoaXNtb3JuaW5nb25jaGFpbi5jb20vYXJ0aWNsZXMvZGVmaS9jb2luYmFzZS1sYXVuY2hlcy1iYXNlLWEtbmV3LWVyYS1mb3ItZXRoZXJldW0tbGF5ZXItMi1uZXR3b3Jrcy_SAXRodHRwczovL3d3dy50aGlzbW9ybmluZ29uY2hhaW4uY29tL2FydGljbGVzL2RlZmkvY29pbmJhc2UtbGF1bmNoZXMtYmFzZS1hLW5ldy1lcmEtZm9yLWV0aGVyZXVtLWxheWVyLTItbmV0d29ya3MvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Coinbase Launches Base: New Era for Ethereum Layer-2 Network - This Morning On Chain",
        "content": "Coinbase introduced its own Ethereum layer-2 (L2) network called Base. With ambitions to enable the next million decentralized applications within the next five to ten years, Coinbase obviously thinks it can leverage its over 100M users to take a significant portion of the L2 market. There’s reason to be excited–and skeptical.\n\nWhat Is Base and Why Is It Important for the DeFi Market?\n\nBase is a fork of popular Ethereum L2 Optimism, or as Base puts it: \"a rollup agnostic superchain powered by Optimism\" which processes batches of transactions on a separate chain and pushes information about those transactions to the mainnet, making transactions faster and cheaper than Ethereum. A testnet for Base has been live since the beginning of February, and Coinbase hopes to launch the mainnet in the next few months.\n\nThe L2 market is pretty crowded at this point, but Base is launching without a network token, which is a notable departure from the norm. From being heavy in the DeFi space, I’ve come to believe that having a token is often not a positive for the project. Also, dangling the possibility of an airdrop can help bring on early adopters.\n\nThe Future of Base: Decentralization and Partnerships\n\nCoinbase intends to make the governance of Base fully decentralized, although that won’t be the case initially. Many L1s have launched in a highly centralized space and are still working towards promises of becoming decentralized, and most have made no meaningful progress towards that.\n\nCoinbase is launching Base with dozens of partners committed to building and supporting the ecosystem, including Chainlink, Etherscan, and Aave. I often dismiss “partnerships,” but it feels a bit more meaningful in this case, since we’re talking about Coinbase.\n\nThe real thing to pay attention to here is how much of the network value add Coinbase is going to be able to capture. If you’re a major company looking to move onto an L2, I’m very confident you’d rather be able to tap into Coinbase’s 100M users who are covered by the industry leader’s KYC and AML protocols than a random L2. My prediction is that Coinbase’s L2 will be the top dog for big industries, assuming the tech is solid, and that means Coinbase would be in a good position to capture a lot more revenue than they already do.\n\nThis is part of an ongoing push by Coinbase to diversify out of a trading volume based revenue model. With the cyclical nature of cryptocurrency trading, that really puts the company in a tough position to predictably plan and grow. Their previous attempt at this was staking services for its customers to bring in “subscription revenue.” Turns out the SEC doesn’t like that model."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDIvMjgvc2Nyb2xscy16a2V2bS1kZXBsb3lzLW9uLWV0aGVyZXVtcy1nb2VybGktdGVzdG5ldC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Scroll’s zkEVM Deploys on Ethereum’s Goerli Testnet - Crypto Times",
        "content": "The zkEVM initiative, Scroll rolled out its testnet version of the Ethereum layer 2 solutions on the Goerli testnet, called it the final stage before its mainnet launch that is slated in late 2023.\n\nFor nearly two years, we've built our zkEVM in the open alongside @PrivacyScaling and other contributors, and today, we're taking the next step to Goerli, the final stage before mainnet.\n\n\n\nOur testnet on Goerli is 100% permissionless.\n\n\n\nHere are the details: — Scroll 📜 (@Scroll_ZKP) February 27, 2023\n\nzkEVMs are the layer-2 scaling solution on the Ethereum network to enhance the performance of the projects. It is the most essential part of future blockchain-based projects as well as the virtual assets economy.\n\nThe current deployment on the Goerli testnet is the transition of the Scroll’s zkEVM development phases from a pre-alpha to an alpha testing phase. Goerli is the public testnet, which means it allows developers to do activity on the open-source code. It also helps the project developer to filter out loopholes and bugs before the mainnet launch.\n\nIn order to transact digital assets between the Goerli testnet and Scroll, the bridge has been also developed.\n\n“We’ve been testing with mock mainnet transactions on our pre-alpha testnet but by having a more public testnet you can have more time to battle test it and make sure that everything is working properly — because of the huge difficulty of building a system like this,” said a researcher known as Pseudotheos at Scroll, in an interview."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0td2hhbGVzLXNoYWtlLW9mZi1tYXJrZXQtdW5jZXJ0YWludHktYnJlYWstNy15ZWFyLWFjY3VtdWxhdGlvbi1yZWNvcmQv0gF4aHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy9ldGhlcmV1bS9ldGhlcmV1bS13aGFsZXMtc2hha2Utb2ZmLW1hcmtldC11bmNlcnRhaW50eS1icmVhay03LXllYXItYWNjdW11bGF0aW9uLXJlY29yZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Ethereum Whales Shake Off Market Uncertainty, Break 7-Year Accumulation Record - NewsBTC",
        "content": "Ethereum has already seen a slowdown in its price over the past couple of days. Now, while investors mainly seem indifferent to the crypto market at the moment, some whales have taken this time to fill up their bags. This has brought their balances to a new seven-year high.\n\nEthereum Whales Go On Buying Spree\n\nSantiment reported on Tuesday that top Ethereum whales have been filing up their bags recently. These top ETH whales which are not exchange addresses added a significant sum to bring their collective total to more than 25 million ETH.\n\nInterestingly, the last time that the balances of these top 10 non-exchange addresses held this much ETH was back in 2016. Now, in 2016, when the top wallets held this much ETH, the price of the digital asset exploded over 1,000%, going from a meager $0.93 to over $12 by the time the rally was done.\n\nTop 10 non-exchange addresses now hold 25 million ETH | Source: Santiment\n\nAccording to Santiment, these whales had increased their holdings to this level over the last week. This was when the prices of digital assets in the space were beginning their descent, triggering panic in the space.\n\nAnother factor that could signal a resumption of the bull trend for ETH is the fact that the digital asset is still dominant for fee distribution. There is more ETH spent than WETH and USDC combined, which shows that the cryptocurrency is still very much dominant and front of mind for investors.\n\nBut Could ETH Face Pressure From Shanghai?\n\nIt is no longer a secret that the Ethereum Shanghai upgrade is set to happen sometime in March and will reportedly enable withdraws for staked ETH. Given that there is currently over 17 million ETH worth more than $28 billion staked on the Beacon Contract, there are already expectations of a dump.\n\nETH price struggles to hold above $1,600 | Source: ETHUSD on TradingView.com\n\nHowever, Ethereum developers have already assured the community that all of the ETH will not be available for withdrawal immediately. Perhaps a staggered withdrawal process will help to mitigate the effects of stakers who decide to sell their tokens.\n\nIt is still important to bear in mind that some of these investors have not had access to their tokens for over a year, which could lead to immediate selling once they get their hands on them. But with the price of the digital asset already down so much from its 2021 all-time high, it is possible that stakers will want to wait for better prices before selling.\n\nNevertheless, the Shanghai upgrade will no doubt have implications for the crypto market. But whether these implications will be good or bad remains to be seen. Right now, crypto investors are still neutral, dragging prices to a standstill.\n\nFollow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from Cryptorobin, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9saWRvLWZpbmFuY2UtYWN0aXZhdGVzLXN0YWtpbmctcmF0ZS1saW1pdC1hZnRlci1tb3JlLXRoYW4tMTUwLTAwMC1ldGgtc3Rha2Vk0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Lido Finance activates staking rate limit after more than 150,000 ETH staked - Cointelegraph",
        "content": "Liquid staking protocol Lido Finance activated a protocol safety feature called “staking rate limit” after more than 150,000 Ether (ETH) was staked with the protocol in a single day.\n\nLido is a liquid staking solution for digital assets, allowing users to stake Ether without them needing to have their tokens locked. When a user deposits Ether, Lido issues them a liquid variant of ETH, known as staked Ether (stETH), giving users staking rewards for each day the tokens are held in their wallets.\n\nLido protocol has registered its largest daily stake inflow so far with over 150,000 ETH staked.\n\n\n\nUpon reaching this number, a curious (but important) protocol safety feature called Staking Rate Limit was activated.\n\n\n\nHere’s how it works pic.twitter.com/ngBtWz7q18 — Lido (@LidoFinance) February 25, 2023\n\nAccording to the liquid staking protocol’s Feb. 25 tweet, the “dynamic mechanism” was activated after the daily staking limit of 150,000 Ether was reached.\n\nIn a related guide, Lido explained that the “safety valve” is aimed at limiting the amount of staked Ether that can be minted during high inflows, intended to address any potentially negative effects, such as rewards dilution.\n\n“This means it is only possible to submit this much Ether to the Lido staking contracts within a 24-hour timeframe,” it explained.\n\nThe mechanism works by limiting the amount that can be minted based on deposits within the last 24 hours, replenishing capacity at 6,200 ETH per hour.\n\n“It works by decreasing how much total stETH can be minted at any one time based on recent deposits, and then replenishing this capacity on a block-by-block basis,” Lido said.\n\nLido noted the staking rate limit mechanism would affect “all parties who may try to mint stETH, regardless of approach.“\n\nEagle eyed on-chain analyst Lookonchain shared a screenshot reportedly showing that the 150,100 ETH may have come from a single user, with three deposits 50,000 each and one of 100.\n\nCaption: An on-chain analyst has discovered that 150,100 ETH may have come from a single user. Source: DeBank\n\nAccording to Lido Finance’s website, as of Feb. 27, more than $8.9 billion in ETH has been staked with the protocol, up significantly from the $5.8 billion reported on Jan. 2.\n\nRelated: SEC’s crypto staking crackdown has uncertain consequences for DeFi: Lido Finance\n\nThe latest development from Lido comes as Ether staking volumes have reportedly continued to rise as the Shanghai upgrade nears. The Ethereum Shanghai upgrade is due in mid-March, leading to speculation about what could happen to the price of Ether.\n\nOne of the five planned upgrades, EIP-4895, is expected to unlock staked ETH and allow withdrawals, potentially leading to increased liquidity in the crypto market.\n\n$25 billion of ETH has been staked since the Beacon Chain was launched and introduced staking to ETH in December 2020."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vY29pbmdhcGUuY29tL2VkdWNhdGlvbi9jaGFybGVzLWhvc2tpbnNvbi1wZXJzb24td2l0aC1tYWpvci1jb250cmlidXRpb25zLW9mLWNvLWZvdW5kaW5nLWV0aGVyZXVtLWFuZC1jYXJkYW5vL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Charles Hoskinson : Ethereum and Cardano Co-founder - CoinGape",
        "content": "Charles Hoskinson is a well-known figure in the world of cryptocurrency and blockchain technology. He is the founder of Cardano , one of the most popular and fastest-growing cryptocurrencies in the world. Hoskinson’s work has been instrumental in pushing the boundaries of decentralized finance, bringing new ideas to the table, and developing innovative solutions that are changing the way we think about money.\n\nAfter completing his undergraduate degree, Hoskinson earned a Master’s degree in Mathematics from the University of Colorado Boulder. He later completed doctoral coursework in the same field at the same university, but he did not finish his Ph.D.\n\nCharles Hoskinson was born on November 5, 1987, in Honolulu, Hawaii. His parents were both teachers, and they instilled in him a love of learning and a strong work ethic from a young age. Hoskinson excelled in school, and later studied mathematics and computer science at the Metropolitan State University of Denver.\n\nCareer Proceedings\n\nHoskinson’s career began in the early 2000s when he started working as a contractor for the US Department of Defense. After that, he worked for a number of other technology companies, including Factom and Ethereum, where he served as one of the co-founders.\n\nIt was during his time at Ethereum that Hoskinson became interested in the potential of blockchain technology. He quickly recognized that this new technology had the power to revolutionize a wide range of industries, including finance, healthcare, and supply chain management.\n\nHow did Hoskison founded Cardano?\n\nIn 2015, Hoskinson founded IOHK, a technology company that specializes in blockchain development. Shortly thereafter, he began work on Cardano, a new cryptocurrency that would be built on a highly secure and scalable blockchain network.\n\nUnlike many other cryptocurrencies, Cardano was designed from the ground up to be highly flexible and adaptable. It was designed to be able to support a wide range of different applications and use cases and was built with an eye toward sustainability and long-term growth.\n\nSince its launch in 2017, Cardano has become one of the fastest-growing cryptocurrencies in the world. It is now valued at billions of dollars and is widely regarded as one of the most promising blockchain projects currently in development.\n\nHoskinson’s Contributions to the Crypto Industry\n\nCharles Hoskinson’s contributions to the world of cryptocurrency and blockchain technology have been significant. He is widely regarded as one of the most influential figures in the industry, and his work has helped to advance the field in a number of key ways.\n\nOne of Hoskinson’s most important contributions has been his emphasis on the importance of security and scalability in blockchain technology. Unlike some other blockchain projects, which prioritize speed and low fees over security, Hoskinson has always believed that security should be the top priority. This has led him to develop innovative solutions that make blockchain networks more secure and more resistant to hacking.\n\nAnother key contribution that Hoskinson has made to the industry has been his emphasis on interoperability. He has long believed that blockchain networks need to be able to communicate with one another in order to be truly effective, and he has worked to develop protocols and standards that make this possible."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYmxvY2tjaGFpbi93aHktdGhpcy1wb2x5Z29uLWxheWVyLTItaXMtaHVnZS1mb3Itc29sYW5hLWRldmVsb3BlcnMv0gFjaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy9ibG9ja2NoYWluL3doeS10aGlzLXBvbHlnb24tbGF5ZXItMi1pcy1odWdlLWZvci1zb2xhbmEtZGV2ZWxvcGVycy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Why This Polygon Layer-2 Is Huge For Solana Developers - NewsBTC",
        "content": "In what could be a huge relief for developers, the Eclipse Foundation recently announced the launch of the Polygon Sealevel Virtual Machine (SVM).\n\nEclipse To Release The Polygon SVM\n\nThe Polygon SVM is a roll-up platform designed for the Ethereum sidechain but is compatible with Solana. Its creators say Solana is a high throughput, fourth-generation network compatible with Ethereum.\n\nThe Polygon SVM relies on Optimistic roll-ups, a technique that bundles transactions off-chain before confirming later on the mainnet. The objective is to enhance scalability and lower transaction fees, a net positive for developers wishing to deploy smart contracts.\n\nDevelopers believe the release of the Polygon SVM is to encourage Solana developers to bridge over to the Ethereum sidechain. As they do so, they won’t have to build their code to be compatible with the Ethereum Virtual Machine (EVM). Polygon is an Ethereum sidechain and is, therefore, by default, compatible with Ethereum.\n\nThe roll-up used, in this case, will be launched on Avail, which is Polygon’s general-purpose data availability layer. Avail uses KZG commitments to proof blocks and was released in June 2021. In this arrangement, Polygon will communicate directly with Solana and the Ethereum mainnet through a cross-chain bridge. Consequently, developers will have the flexibility of deploying their dApps on Polygon.\n\nAs a result, developers running Solana dApps can deploy on Polygon because the SVM provides a coding environment that allows the launching of Rust-based solutions on several blockchains, including Polygon.\n\nTo do this, Solana developers will first have to transfer their code to Eclipse, from where it will be run on Polygon. With this provision, it can be settled back on Solana, meaning there will be higher levels of security.\n\nThe Polygon SVM will release its testnet in late Q1 2023, with the mainnet scheduled in H2 2023.\n\nThe Migration From Solana\n\nThis solution comes when Solana has been under extreme pressure following the collapse of FTX, the crypto exchange, and Alameda Research, the trading wing associated with the defunct ramp. Though there was no direct connection between the FTX and Alameda Research, and Solana, the former holds millions worth of SOL, the native currency of Solana.\n\nThe subsequent devaluation of SOL, as investors feared that FTX and Alameda Research would offload their bag, impacted the Solana ecosystem.\n\nSome projects have migrated to Polygon in the past few weeks after receiving incentives.\n\nHere is a screenshot of our latest @y00tsNFT Discord announcement. pic.twitter.com/qWxjBsexv6 — frankdegods.eth (@frankdegods) January 6, 2023\n\nFor example, early this year, DeLabs, the creator of Y00ts, was awarded a $3 million grant to build on Polygon.\n\nFeature image from Canva, Chart from TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS90ZXN0bmV0LWV0aGVyLW9uLWdvZXJsaS1za3lyb2NrZXRlZC1ieS02NzMtZGV2cy1wcm9wb3NlLW5ldy1wbGFuL9IBXmh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS90ZXN0bmV0LWV0aGVyLW9uLWdvZXJsaS1za3lyb2NrZXRlZC1ieS02NzMtZGV2cy1wcm9wb3NlLW5ldy1wbGFuLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Testnet Ether on Goerli Skyrocketed By 673%, Devs Propose New Plan - CryptoPotato",
        "content": "The Goerli testnet is a popular cross-client proof-of-authority testing network for Ethereum but is otherwise an entirely separate entity from the Ethereum ledger. It was established in March 2019. Tests are being run on applications before their final deployment on the mainnet.\n\nTraders can also send tokens from other chains to Goerli. The tokens used are the testnet version of the actual ether and are supposed to be free for the developers.\n\nGoerli’s distribution method for native ETH (GoETH) has been a major bone of contention since its distribution is primarily in the hands of a few validator entities. They distribute a small amount of GoETH. The traditional approach uses services called faucets to gain testnet tokens, which is deemed inconvenient by many.\n\nNew Approach\n\nIn response, a cross-chain platform LayerZero designed a way for Goerli’s testnet ether to be traded and swapped between the Ethereum mainnet and the testnet. The focus is to enable devs to purchase testnet ether directly from the decentralized exchange, Uniswap.\n\nThe LayerZero developers launched a cross-chain liquidity pool that allows users to buy GoETH to quell concerns about acquiring the token. But critics have warned against the new approach of monetizing the native currency of a testnet and believe that such a mechanism will end up threatening the free nature of the testnet.\n\nIn fact, the price of the testnet ether shot up to $1.60 on Saturday, increasing by more than 673% since trading at $0.15 around the end of last week. The token has lost much of its value since but is still trading near $0.31.\n\nUniswap founder Hayden Adams called out those buying the token and warned that it will lose support from the testnet in his latest tweet,\n\n“If you’re buying goerli eth, why in the actual hell are you doing that. Y’all know it’s a deprecated and soon to be fully unsupported testnet right? That said, always fun to have weird things happen on uniswap.”\n\nFollowing the development, Polygon’s Chief Information Security Officer, Mudit Gupta, also chimed in and stated,\n\n“Goerli eth is trading for ~$0.69. Not nice. Testnet ether is supposed to be free but is being marked up by speculators. Keyboard warriors will tell you that the developers are buying it but no, they are not. Maybe 0.1% are buying for consumption. This is the start of the end of the Goerli testnet. It served us well.”\n\nPotential Solution\n\nAcquisition of testnet ether has become a major problem. To address this, a solution has now been proposed by Ethereum core dev Tim Beiko to develop a new testnet called Holli. This one, speculated to be released later this year, is expected to improve the testing environment for client and application devs as well as node operators."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vY3J5cHRvLm5ld3Mva29yZWFuLWJ1eWVycy10YWtlLWV0aGVyLXRvLTMwMC1vbi1nZW9wb2xpdGljYWwtdHJlbW9yL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Ethereum Surpasses $300 Amidst Geopolitical Tremors - crypto.news",
        "content": "Since August 9, tensions between North Korea and the US have intensified, with South Korean traders piling money into the cryptocurrency of the second largest blockchain network, Ethereum. ETH-USD breached the $300 handle and now finds support at this psychological level; we provide an outlook for the cryptocurrency going forward.\n\nWhile markets across the world have shown increased volatility in response to the war of words, cryptocurrencies have remained fairly stable, incubated from any threat of a war on the Korean peninsula. The drama started on August 9, when a US report was released claiming that the North Koreans had developed a minature nuclear weapon.\n\nUS President Trump threatened the small, communist nation with “Fire and Fury,” while the North Koreans hit back with a warning of a strike on Guam, a US military base, which is the Westernmost edge of their influence in the Pacific. A retired Russian general, however, does not see the US taking the offensive, as North Korea would most likely target Seoul and US assets in retaliation. While the US army is much more powerful, morale and readiness for battle is suggested to be greater among the army of North Korea. China has also weighed in, stating that an attack on North Korea would not be permitted and it would not stand by and watch. On the other hand, it stated its neutrality in the event the US is attacked first.\n\nWhile in times of geopolitical uncertainty, assets like gold, US Treasuries and the Japanese Yen are sought after by investors, cryptocurrencies are beginning to steal the show. While stock indices fell across the board, this new asset class is rising to prominence, and has shown stronger resilience than more recognized safe haven assets in the past week. With the Cyprus bail-in, Brexit, and now the threat of another war breaking out, cryptocurrencies seem to be cementing their place as an asset to diversify with against geopolitical risk. Imagine, if South Korea is caught in the crossfire, as Seoul lies within the artillery range of North Korea, the South Korean Won would be hit hard, whereas the Ethereum network will still be running, with infrastructure spread across the world.\n\nRon Chernesky, CEO of InvestFeed, highlighted the use of cryptocurrencies as a hedge against a larger downturn in wider markets:\n\n“We’re seeing investors transferring their funds into cryptocurrencies as they try to diversify their risk in case of a severe downturn in the market. The space has gone from niche to more widely adopted with one of the main draws being that cryptocurrencies are seen as less correlated with other assets.”\n\nAs the news about North Korea permeated around the world, ether enjoyed higher volume, surpassing $2.5 billion on August 9, which was significantly larger than the volume for the most popular cryptocurrency, bitcoin.\n\nEther is favoured by Koreans since Vitalik Buterin made an effort to put a face to the cryptocurrency; as a result, ether has gained trust among investors in the country, compared with bitcoin, whose creator remains anonymous. But not only are investors in the country buying frequently, they are betting big on the digital asset, as explained by Bobby Kim, trader and advisor on Bitcoin Seoul:\n\n“When I started buying bitcoin, I noticed a huge difference between the orders in the U.S. and Korea. In the U.S., they trade around $100 up to $5,000 to $10,000 per trade. In Korea, these trade amounts are in $100,000 increments.”\n\nThe children of the “chaebol” conglomerates are the ones putting huge bets on cryptocurrency, investing their inherited riches. The huge volume increase saw ether rise to a fresh high against the Korean Won, above 363,000. In dollar terms, ETH-USD broke above the $300 handle, peaking at $315.12 on August 9. The price of ether has since retreated to the $300 handle. The chart below shows that as the news broke about North Korea’s supposed nuclear capability, volume increased on the Korbit exchange, which has a market share of around 6 percent of the entire ether market. Buyers managed to push ether up from 337,200 to 363,050 in just a few hours.\n\nETH-KRW also spiked later in the day as the Pentagon chief threatened the “rogue state” with the destruction of its people, with ether peaking around 351,450 against the Won. For ETH-USD, the cryptopair reached a fresh high at $316.92 in the rising heat of geopolitical tension.\n\nThe daily chart for ETH-USD is shown below and illustrates a bullish outlook for the cryptocurrency. We look to buy around the upper span of the Ichimoku cloud, which provides initial support around $269. Notice that the two previous candlestick are Doji’s, suggesting some indecision in the market, hence why we may see ETH-USD retreat to find a new floor around $270, before continuing higher. The Ichimoku cloud is also changing color, from red to green, providing an indication that a new uptrend is underway, confirmed with a breakout above the Ichimoku on August 6.\n\nSupport also lies at the conversion line ($267.24) and the base line ($235.46). Finally, notice that the lagging line has followed the price action, and is currently above the Ichimoku cloud, giving another bullish signal.\n\nThe 4-hour price action is displayed below, with a key support at $297.50. A 4-hour close below this level will open up the support provided by the base line, at $288.51. We look to buy if the market dips to this level. On the other hand, a break above the fractal resistance at $312.97 will point to further gains in the days ahead.\n\nIf ether manages to sustain above the $300 handle, we should see the bullish run continue, with a viable target at the all-time high above $400, which is the last remaining fractal resistance on the weekly timeframe. Hence, if ETH-USD remains above $271 by August 14, we should see the market take an attempt at $404.98.\n\nFollow Us on Google News"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vY29pbmdhcGUuY29tL3BvcHVsYXItYW5hbHlzdC1wcmVkaWN0cy1ldGgtbGluay1hdmF4LWZ0bS1hdG9tLWx0Yy1wcmljZS1pZi1iaXRjb2luLWJ1bGwtcnVuLXRvLTM1ay_SAW5odHRwczovL2NvaW5nYXBlLmNvbS9wb3B1bGFyLWFuYWx5c3QtcHJlZGljdHMtZXRoLWxpbmstYXZheC1mdG0tYXRvbS1sdGMtcHJpY2UtaWYtYml0Y29pbi1idWxsLXJ1bi10by0zNWsvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin $35K Scenario: ETH, LINK, AVAX, FTM, ATOM, LTC Price - CoinGape",
        "content": "Popular crypto analyst predicts prices of Ethereum (ETH), Chainlink (LINK), Avalanche (AVAX), Fantom (FTM), Litecoin (LTC), and Cosmos (ATOM) if Bitcoin price hit $35,000.\n\nMichael van de Poppe in a tweet on February 28 shared that if Bitcoin price reaches the $35,000 level, other leading cryptocurrencies will also witness some higher levels. Typically, the crypto market moves in the direction in which Bitcoin moves due to its dominance in the crypto market. Bitcoin price determines the overall bullish or bearish price action in the market, but not always.\n\nadvertisement\n\nBitcoin Price to $35K Scenario\n\nBitcoin price currently trades below the $23,500 level. The BTC price fell nearly 2%, making the 24-hour low and high of $23,205 and $23,611, respectively. The U.S. Core PCE inflation and pressure from the central banks around the world are the main reasons behind the recent retracement from $25,000.\n\nMichael van de Poppe predicts Ethereum (ETH) price between $2,500-2,800 if Bitcoin reaches the $35,000 level. Currently, the ETH price trades at $1,636, down nearly 2% in the last 24 hours.\n\nWith the Ethereum Shanghai upgrade slated for March and general bullish sentiment on Ethereum to have a better price rally than Bitcoin, $2,500 looks fairly possible. The reason is, bulls will fully take over bears if Bitcoin crosses the 200-WMA at $25,100.\n\nFurther, he believes Chainlink (LINK) price will trade between $12-15. The LINK price currently trades at $7.37, down 1% in the last 24 hours. Notably, the price has been trading in the same range for a very long period.\n\nChainlink’s move to above $12 is supported by Chainlink’s Proof of Reserve system and Web3 solutions. Moreover, the partnership with the SWIFT cross-border payment system has been the highlight recently.\n\nMichael van de Poppe predicts Avalanche (AVAX) price at $55-60 if the Bitcoin price hit $35,000. AVAX price decreased by 4% in the last 24 hours, with the price currently trading at $17.53. The price has jumped after a partnership with Amazon Web Services to fully supports Avalanche’s infrastructure and dApp ecosystem.\n\nFantom (FTM) price is predicted to reach $1.10-1.30. The FTM price currently trades at $0.4565, down 2% in the last 24 hours. The FTM price witnessed a major bullish momentum in the last 2 months due to the return of DeFi veteran and Fantom founder Andre Cronje.\n\nHe also predicts Litecoin (LTC) price to reach $185-210. The LTC price is currently trading at $95.82, up 1% in the last 24 hours. Litecoin is scheduled to undergo halving on August 3.\n\nLastly, Michael van de Poppe predicts Cosmos (ATOM) price at $22-25 if Bitcoin price hit $35,000. The ATOM price is trading at $12.57, down 3% in the last 24 hours.\n\nAlso Read: Vitalik Buterin Suggests Improvements On Ethereum Network"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMilwFodHRwczovL3d3dy50cmFkaW5ndmlldy5jb20vbmV3cy9jcnlwdG9uZXdzOjk1ZmI3Y2MyNDA5NGI6MC13aWxsLXRoaXMtNDAwbS1ldGgtbXlzdGVyeS13aGFsZS1rZWVwLXNpdHRpbmctb24taGlzLWhvbGRpbmctb3ItbWFrZS1hLW1hcmtldC1zaGFraW5nLW1vdmUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Will This $400m ETH Mystery Whale Keep Sitting on His Holding or Make a Market-Shaking Move? - TradingView",
        "content": "A mysterious Ethereum (ETH) wallet worth some $400 million has caught the attention of crypto Twitter. Community members now wonder whether the key is lost, or if the owner is just waiting to make a market-shaking move with the massive stack.\n\nThe mystery wallet was created during Ethereum’s initial coin offering (ICO) in 2014, and has never made a transaction. By simply ‘hodling’, the wallet has seen a massive increase in the US dollar value of its ETH tokens, in addition to accumulating more tokens through airdrops.\n\nAmong the airdrops is a large Ethereum Classic (ETC) airdrop that added 250,000 ETC tokens to the owner’s address. The 250k ETC alone are now worth some $5.3 million at the current exchange rate.\n\nEthereum Classic is the original Ethereum chain from before Ethereum underwent a hard fork as a result of a critical hacking incident in 2016, the so-called DAO hack.“One of the most mysterious addresses”\n\nDetails about the wallet were shared on Twitter this weekend by Conor Grogan, Coinbase’s Product Strategy Director and a former Senior Manager at Ray Dalio’s hedge fund Bridgewater Associates.\n\nGrogan called the wallet “one of the most mysterious addresses in all of crypto.”\n\nThe wallet bought $75k of ETH during the Ethereum ICO (initial coin offering) in 2014, but has since remained “completely untouched,” Grogan wrote in his tweet.\n\n“Imagine the mental fortitude of holding through multiple bull and bear markets,” he added, but also admitted that “a far more likely outcome” is that the private keys to the wallet are lost.“Dead or lost key”\n\nJudging from the majority of commenters on Twitter, it appears Grogan’s explanation is also the consensus view, and that the owner is simply unable to move the funds.\n\n“Dead or lost key. Mystery solved,” wrote the popular user @notsofast, while accusing Rogan of using the wallet mystery for “engagement farming.”\n\nOther users agreed, with many suggesting that the owner is dead.\n\n“RIP the owner who forgot to tell his wallet access info before he passed away,” one user wrote.\n\nAnother user suggested that a technical glitch during the Ethereum ICO may have caused an “unspendable error.”\n\n“I know a couple 1 BTC investments that are forever gone with it,” the user suggested, before another jokingly said the wallet has got to be the Ethereum Foundation’s retirement plan…"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzAyLzI4L3BlcmZlY3QtY3J5cHRvLXBvcnRmb2xpby1mb3ItaW52ZXN0b3JzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Here It Is, the Perfect Crypto Portfolio for Investors - The Motley Fool",
        "content": "Rather than trying to find the next meme coin that is trending, the best way to set up a successful crypto portfolio is by allocating funds to different sectors within the industry.\n\nThe true number of sectors in crypto is slightly subjective and not as clear cut as in the stock market. But after much research, I foresee the most long-term value coming from three sectors: payments, smart contracts, and Layer 2 blockchains.\n\nA disclaimer\n\nThis breakdown of sectors takes into consideration a few factors. First, the goal is to minimize risk and increase long-term potential (sorry, Dogecoin fans). This means investing in cryptocurrencies with a proven track record and that provide true value to the industry.\n\nSecond, consideration of the current landscape must be taken into account to project which cryptocurrencies possess the most upside. This involves some speculation, but analysis of current trends and demand can help investors determine which cryptocurrencies fit this criteria.\n\nThird, and finally, there are some cryptocurrencies that could have made this list, but they lacked some fundamental quality such as high throughput, decentralization, security, or providing a unique and novel solution.\n\nThe original payment crypto\n\nNo crypto portfolio is complete without some sort of allocation to Bitcoin (BTC 0.58%). The world's most valuable cryptocurrency was invented in the wake of the Great Recession in 2009 as an alternative to fiat currencies. With Bitcoin, users can protect their wealth because the total supply of the currency is capped at 21 million coins. Unlike fiat currencies, which continue to inflate, Bitcoin has grown into an attractive store of value for those looking to preserve wealth from inflation-prone fiat currencies.\n\nIn addition to its utility as a store of value, Bitcoin was also created as a way to circumnavigate the current means of transferring money. With Bitcoin, money can be sent to anyone in the world over the internet without the need of a bank or wiring company.\n\nFor these and a multitude of other reasons, Bitcoin still remains the most valuable cryptocurrency despite thousands of others coming into existence since its creation. Today, the total value of Bitcoin makes up more than 40% of all the value in crypto. Due to this overwhelming proportion, typically as Bitcoin goes, so does the rest of the market.\n\nThe undisputed smart contract leader\n\nWhile Bitcoin laid the foundation for crypto, Ethereum (ETH 0.37%) took it a step further. With its invention of smart contracts, Ethereum offered users a blockchain that could be programmed to self-execute preconfigured actions when particular criteria is met.\n\nThanks to Ethereum, entirely new use cases came into existence. Lending, borrowing, decentralized finance, NFTs, and other decentralized applications could all be developed as a result of the invention of smart contracts.\n\nDue to this novelty, Ethereum is the second most valuable cryptocurrency and currently makes up nearly 20% of all the value in crypto. Despite other smart contract blockchains being created in recent years, Ethereum still dominates its so-called competitors, making it a great long-term investment.\n\nTo quantify this we can look at a metric known as total value locked (TVL). TVL is used as a gauge to measure and compare the value a blockchain supports in decentralized finance (DeFi), one of the primary uses of smart contracts. Today, Ethereum supports nearly $30 billion, more than 58% of the value in all of DeFi. The next closest is Tron with a measly 10% and just $5 billion. It truly isn't even a close race.\n\nThe Layer 2 frontrunner\n\nAs one of the most used blockchains in the world, Ethereum's network at times becomes bogged down and leads to an increase in fees. This is where the use of Layer 2 blockchains comes into play.\n\nLayer 2 blockchains process transactions on their own network and then add them in bulk back to Ethereum. This provides users with the best of both worlds -- fast speeds and low fees while maintaining compatibility with Ethereum and its high levels of decentralization and security.\n\nWhile some foresee Ethereum's dominance being uprooted by another smart contract blockchain, the more likely scenario is that utilization of Layer 2 blockchains increases as users look to continue using Ethereum. In preparation of this reality, there is a proverbial arms race among Layer 2 blockchains jockeying for position to become the premier Ethereum scaling solution.\n\nThere are a handful of Layer 2 blockchains and solutions in the market today, but Polygon (MATIC -0.56%) stands out from the crowd. Compared to other Layer 2s, Polygon boasts a rare combination of long-term potential, proven utility for real world applications, and an ability to provide developers with a flexible and robust environment. As a result of this trifecta, Polygon finds itself at the forefront of the Layer 2 race.\n\nWith Polygon, users can still create NFTs, decentralized apps, blockchain-based games, Web3 applications, and much more, just at a cheaper cost and much faster speeds all while maintaining compatibility with Ethereum. Due to this functionality, a slew of well-known companies such as Disney, JPMorgan, Starbucks, Coca-Cola, and Nike have all utilized the blockchain in varying ways as they begin to develop blockchain-based business models. While there are a handful of Layer 2 solutions out there, few have achieved as much as Polygon in such a short time.\n\nA final word\n\nWhile exposure is good, there is such a thing as overexposure, and this can be detrimental to your portfolio. Keeping it simple and finding the right balance can help mitigate possible losses but also help ensure that returns are maximized.\n\nBy focusing on these three cryptocurrencies, your portfolio gains exposure to more than 60% of the value in all of crypto due to Bitcoin and Ethereum's disproportionate share while also providing exposure to up-and-coming trends that Polygon is pioneering such as gaming, DeFi, and Web3. With this combination, your portfolio should reap the benefits for years to come.\n\n\n\n\n\n"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmluZGlhdG9kYXkuaW4vY3J5cHRvY3VycmVuY3kvc3RvcnkvYml0Y29pbi1ldGhlcmV1bS1zb2xhbmEtaW4tdGhlLXJlZC16b25lLW9uLTI4LWZlYnJ1YXJ5LTIwMjMtMjM0MDUyNy0yMDIzLTAyLTI40gGBAWh0dHBzOi8vd3d3LmluZGlhdG9kYXkuaW4vYW1wL2NyeXB0b2N1cnJlbmN5L3N0b3J5L2JpdGNvaW4tZXRoZXJldW0tc29sYW5hLWluLXRoZS1yZWQtem9uZS1vbi0yOC1mZWJydWFyeS0yMDIzLTIzNDA1MjctMjAyMy0wMi0yOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Cryptocurrency price in India 28 February 2023: Bitcoin at $23,480, Ethereum falls 0.99%, the market remains in the red zone - India Today",
        "content": "After remaining in the green yesterday, the prices of top cryptocurrencies on Tuesday noticed a fall. Bitcoin decreased by 0.35 percent to stand at $23,480. This continued in the value of Ethereum by a 0.49 percent fall to trade at $1633.\n\nOn the declining value of Bitcoin, Mr. Sathvik Vishwanath, Co-Founder and CEO of Unocoin said, \"The cryptocurrency market has seen mixed moves over the past 24 hours, with Bitcoin facing significant resistance at $23,750, leading to a bearish correction that may push the value further down to $22,800.\"\n\nadvertisement\n\nHe added, \"On the other hand, the price of Ethereum fell by 0.99 percent to $1,627.03 with a trading volume of $7,497,106,810. However, there is still hope for an upside if Ethereum breaks the $1,625 resistance level, or eventually reaches $1,674.\"\n\nAs the market fell, the price of other top tokens like Solana and Litecoin recorded a loss of 1.95 percent to $22.58, and 0.74 percent to $94.32, respectively. This decline was further noticed in Polkadot by 1.42 percent to $6.58. The price of Avalanche was down by 2.88 percent to $17.80, followed by a slip in XRP of 0.29 percent to $0.375445. At that time, Cosmos dropped 0.81 percent and Monero dipped 1.89 percent.\n\nOn 28 February, the global crypto market cap decreased by 0.45 percent to $1.07 trillion in the past 24 hours. Contrastingly, the total crypto market volume stood at $45.38 billion, having registered an increase of 30.57 percent.\n\nGainers and decliners of the day\n\nAccording to CoinMarketCap, the top gainers were NEM, SingularityNET, Synthetix, and Stacks. Contrarily, the top losers were Bone ShibaSwap, Conflux, Polygon, and Aave.\n\nMeme coins notice decrease\n\nOn Tuesday, the value of meme coins plunged. Shiba Inu recorded a slip of 2.58 percent to $0.000013. The value of Dogecoin fell 0.06 percent to $0.082019. This continued in Dogelon Mars with a 3.70 percent decrease.\n\nMetaverse tokens in the green\n\nA majority of the top metaverse tokens remained in the red zone. The price of The Sandbox recorded a loss of 0.57 percent, which continued in Axie Infinity by a 0.27 percent reduction. In contrast, Decentraland was up by 0.27 percent."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiK2h0dHBzOi8vbmZ0cGxhemFzLmNvbS9jb2luYmFzZS1iYXNlLWxhdW5jaC_SAS9odHRwczovL25mdHBsYXphcy5jb20vY29pbmJhc2UtYmFzZS1sYXVuY2gvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Coinbase Celebrates ‘Base’ Launch with Free NFT Drop - NFT Plazas",
        "content": "Coinbase Celebrates ‘Base’ Launch with Free NFT Drop\n\nOn February 23, one of the largest cryptocurrency exchanges, Coinbase, celebrated the launch of Base, a layer-2 scaling network for Ethereum developed in partnership with Optimism. To mark this important milestone, Coinbase also released a free open-edition Ethereum NFT called “Base, Introduced,” which can be minted by anyone through the Zora NFT minting platform until the window closes on March 5.\n\n5/ Become a part of Base history Mint “Base, Introduced” — a commemorative NFT that celebrates the initial launch of Base. 1 per address, freely mintable on @OurZora through Sunday at midnight EST.https://t.co/zOiQilFKgH — Coinbase (@coinbase) February 23, 2023\n\nThe release of the open-edition has resulted in over 376,000 NFTs minted since the announcement, with the NFT smart contract becoming the biggest “gas guzzler” on the Ethereum network. Only allowing 1 NFT per wallet, over $271,000 worth of gas was used in the first three hours after release, indicating the level of interest and excitement generated by the move.\n\nAlthough the “Base, Introduced” NFT was not launched on the Coinbase NFT marketplace, it could still be found as secondary listings posted by users who minted the NFT through Zora. While the free Base NFT doesn’t promise any future utility or benefits, it has already begun to find traction on secondary markets, with some early-numbered editions or those with so-called “vanity numbers” commanding higher prices.\n\nCoinbase Developer-Friendly Ethereum L2 Network, Base.\n\nCoinbase’s move deeper into the NFT space comes when its own marketplace has “paused” development to focus on other features. Coinbase’s President and COO, Emilie Choi, recently confirmed that despite the exchange having a “very lean team” working on its marketplace, it is not giving up on its NFT ambitions.\n\n3/ Base will be: → The onchain home for @Coinbase\n\n→ An open ecosystem where anyone, anywhere, can build dapps that reach the next 1B+ users\n\n→ A bridge that brings our users onchain and enables them to go anywhere, including L1, other L2s, and ecosystems like Bitcoin & Solana — Base (@BuildOnBase) February 23, 2023\n\nBase network, created by Coinbase, is an Ethereum L2 solution designed to onboard a billion users into the crypto economy. This network emphasizes security through a combination of fraud-proof rollups, optimistic rollups, and state channels. In addition, the network offers low-cost transactions through sharding and Plasma-like constructions. With its developer-friendly open ecosystem, Base provides an ideal platform for building dapps on-chain.\n\nThe network provides easy and secure access to Ethereum L1, other L2s, and other L1 ecosystems like Solana, making it possible for anyone, anywhere, to participate in the cryptoeconomy. By launching Base, Coinbase is taking a significant step towards advancing the growth in the industry and making it more accessible to everyone.\n\nWant more? Connect with NFT Plazas\n\nJoin the Weekly Newsletter\n\nJoin our Discord\n\nFollow us on Twitter\n\nLike us on Facebook\n\nFollow us on Instagram\n\n*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vZGVjcnlwdC5jby8xMjIzNjkvd2FzaC10cmFkaW5nLWJsdXItZXRoZXJldW0tbmZ0c9IBP2h0dHBzOi8vZGVjcnlwdC5jby8xMjIzNjkvd2FzaC10cmFkaW5nLWJsdXItZXRoZXJldW0tbmZ0cz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "How Much Wash Trading Is Really Happening on Blur? - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nUpstart marketplace Blur has risen to the top of the NFT world in recent weeks, vaulting ahead of longtime leader OpenSea through tokenized trading rewards. The cause of the surging trading volume has split opinion in the NFT space, prompting a notable Web3 analytics firm to discount much of the recent trading data from the Blur marketplace.\n\nCryptoSlam, a leading platform for tracking NFT sales, announced on Friday that it would remove $577 million worth of Blur trades from its data due to “market manipulation.” The platform also said that it will filter future Blur trades on its platform through an updated algorithm that excludes what it sees as suspicious sales.\n\nOn-chain data shows that Blur’s sudden rise in NFT trading volume is primarily fueled by whales—that is, traders with significant holdings of a given asset—who are constantly buying and selling NFTs via the marketplace’s bid pools in an effort to “farm” token rewards for the next airdrop. But there’s some disagreement in the space over whether that kind of DeFi-like token flipping really constitutes wash trading.\n\nAD\n\nAD\n\nBlur, for its part, points to data aggregated on Dune Analytics that shows a much smaller percentage of wash trading on its platform, and CryptoSlam confirmed to Decrypt that it has expanded its methodology to denote alleged wash trades. But is this merely a quibble over semantics or a disagreement over how to interpret what’s really happening right now in the rapidly changing NFT space?\n\nA changing space\n\nIn an email to subscribers on Friday, CryptoSlam explained the decision to filter out a large chunk of the recent Blur trading data. The platform said that about 1% of high-value NFT traders are driving the majority of trading volume on Blur lately, flipping NFTs at a rapid rate in an effort to generate trading rewards on the marketplace.\n\n“This misrepresents the current NFT market,” CryptoSlam wrote in the email, “and puts traders at risk who often chase projects’ rising action.”\n\n💥CryptoSlam Update: We're Cleaning Up the Wash Trades ⚡️We're taking action to remove nearly $500 Million in wash trades, retroactively as well as applying an updated algorithm to prevent future wash trades. ⚡️This comes after they took similar action https://t.co/ArHdTqRe08… https://t.co/9OHvQKhgLe — CryptoSlam! (@cryptoslamio) February 24, 2023\n\nThat figure expanded to nearly $824 million as of Monday morning, representing over 80% of Blur’s total NFT trading volume ($1.02 billion) that CryptoSlam had recorded since the marketplace launched its BLUR token airdrop on February 14. CryptoSlam has yet to analyze all of Blur’s trading data from its October 2022 launch up until the airdrop.\n\nAD\n\nAD\n\nBy contrast, CryptoSlam says that rival marketplace OpenSea had facilitated about $6.6 million worth of “wash trades” between February 14 and early Monday, out of over $249 million in total volume—adding up to about 2.5% of its total trading volume. In other words, by CryptoSlam’s criteria, OpenSea is still handling more organic NFT trading volume than Blur.\n\nWash trading in the NFT space, as it has most commonly been described, occurs when a trader buys and sells NFTs between their own wallets, often at inflated sums, or when multiple traders do the same in a coordinated fashion. It’s typically done to manipulate trading volume metrics or game token reward models, as seen with earlier NFT marketplaces like LooksRare and X2Y2.\n\nRandy Wasinger, CryptoSlam’s founder and CEO, told Decrypt that unfiltered trading data paints what the company believes is an inaccurate picture of trading trends. CryptoSlam has a duty to separate “true sales from wash, farming, or otherwise artificial on-chain trades,” he said.\n\n\"These flagged transactions are the byproduct of token farming incentives recently introduced by Blur in their war with OpenSea and other marketplaces,” Wasinger said. “They're not arm's-length transactions between an unrelated buyer and seller.”\n\nAs Decrypt reported last week, Blur surged ahead of OpenSea in terms of total trading volume following the airdrop of its own Ethereum token on February 14. Blur launched some $290 million worth of free BLUR tokens to traders, based on the current value of the token, and promised another similar airdrop ahead with its “Season 2” campaign.\n\nBlur’s gamified rewards model dangles free tokens in front of traders who use the platform exclusively—which means not using rivals like OpenSea or X2Y2—and who trade via its bidding pools. The marketplace has generated some $487 million worth of total NFT trades over the last week alone, per data from DappRadar.\n\nIn practice, the marketplace’s heaviest users are constantly buying and selling assets, with some NFTs being flipped multiple times a day. According to public blockchain data surfaced last week, about 50% of Blur’s NFT trading volume is being generated by just 300 wallets, while 1% of traders (565 wallets) make up 74% of the total asset value locked in Blur’s bid pools.\n\nIn other words, a relatively tiny amount of users who are trading NFTs en masse like fungible tokens are heavily skewing the data. But even as Blur takes the lead in terms of raw NFT trading volume, OpenSea still has more daily wallets making trades.\n\nAD\n\nAD\n\nBlurred terms\n\nWhen asked Friday about CryptoSlam's claim that it had handled $577 million worth of \"wash trades” from the February 14 airdrop up until that point, a Blur representative pointed to another resource—a Dune dashboard based on public blockchain data, compiled by pseudonymous Web3 data analyst Hildobby.\n\nHis Dune dashboard points to about $345 million worth of wash trading through Monday, since Blur's October launch, or nearly 14% of its total recorded volume. He also previously declared Blur’s trading volume “legit” in early February, albeit ahead of the recent surge, and has detailed his methodology for tracking wash trades on NFT marketplaces.\n\nLooks like @blur_io has seen more (wash excluded) trading volume than @opensea almost every day in the first half of February 🔥 Source: https://t.co/yPbPkHn08h pic.twitter.com/beigRmpKW4 — hildobby (@hildobby_) February 15, 2023\n\nHildobby's methodology for categorizing wash trades comes down to four key elements. He flags trades if: the buyer and seller used the same wallet, an NFT is traded back and forth repeatedly between multiple wallets, if a wallet has purchased the same NFT three or more times (only for NFTs using the ERC-721 token standard), or if the buyer's and seller's wallet were both initially funded by the same wallet.\n\n“We typically like to reference analysts who have a history of doing thorough research with well-documented methodologies, rather than taking bold claims at face value,” the Blur rep said of CryptoSlam’s announcement. “Intellectual rigor is required to develop an understanding of what’s happening so that we can improve the space.”\n\nCryptoSlam’s Wasinger told Decrypt that its previous methodology for singling out wash trading was very similar to Hildobby’s, but that it has since expanded its criteria to “identify a new class of wash trades.” In short, it targets sales from traders who are providing liquidity to NFT trading pools without much consideration of their status as collectibles or unique assets.\n\n“This new class of wash trading is more difficult to detect and involves a key determination—that during a small time period, a particular wallet's trading activity signals that it has no regard for the metadata of a particular collection,” Wasinger said. “So we assume that it is trading an asset that has a similar risk profile and is ‘substantially identical’ to other assets that were recently traded.”\n\nCryptoSlam, which raised a $9 million seed round in 2022 and is backed by Mark Cuban, has previously taken action to exclude suspicious or manipulated data from its reporting. In early 2022, the company said that it had removed more than $8 billion worth of trading data from upstart marketplace LooksRare, which likewise incentivized traders with token rewards.\n\nAD\n\nAD\n\nOn LooksRare, traders were pricing the NFTs at exaggerated values and selling them amongst their own controlled wallets to create the illusion of organic trades. There may be some coordination happening with Blur trades as well, but much of the volume appears to come from NFT whales rapidly trading assets back and forth within the platform’s bid pools.\n\nThe Blur representative said that the startup had “been extremely careful” in developing a token incentive model that didn’t reward trades based solely on enormous sums of NFT trading volume, and said that it was “fortunate enough to learn from [LooksRare’s] mistakes and focus on rewarding liquidity.”\n\n“Many analysts have misunderstood the volume on Blur and compared it to LooksRare,” the Blur representative added, “which is understandable [because] the details are nuanced and good research is difficult to do in the space.”\n\nIs it wash trading?\n\nBoth CryptoSlam and Hildobby are talking about wash trading, but they’re not exactly saying the same thing. CryptoSlam has specifically expanded its own criteria to deal with what many in the NFT space call airdrop farming—trading huge amounts of NFTs with the apparent external motivator of boosting the amount of reward tokens they’ll receive as a result.\n\nIt’s a debate that has raged across the NFT community in recent weeks. Some NFT creators and collectors have decried Blur’s gamification tactics and how flippers are apparently forcing major market-wide shifts. OpenSea, long the market leader, recently cut some of its creator royalty protections as it scrambled to adapt to Blur’s sudden market dominance.\n\nOthers in the space see it as a natural evolution for NFTs. After all, financial gain has long been a key motivator for NFT traders. The idea of unique NFTs trading hands over and over again and being flipped like fungible tokens doesn’t sit right with everyone—but if it’s possible on the blockchain, traders will find a way to maximize the opportunity.\n\nWasinger admitted that “wash trading” may not be the best descriptor for what’s happening at Blur. He said that “inorganic trading” is a better fit, and it’s a broader term that encompasses what he called “some judgment calls in the code” beyond Hildobby’s own stated methodology.\n\nBut currently on CryptoSlam’s website, it’s all categorized as wash trading. CryptoSlam’s primary goal with the move, Wasinger said, was to clean up the data on its platform, which showed suddenly skyrocketing Ethereum NFT trading volume without context on the impact of Blur’s mechanics. In his view, it gave the wrong impression of the market.\n\nAD\n\nAD\n\n“The aggregate volume we're now reporting is significantly cleaner than it was before,” he said.\n\nIt appears that the entire NFT market is reckoning with Blur’s sudden impact, from creators to rival marketplaces and even data sources. The trading spike has muddled previously reliable metrics, and it has forced players in the space to reconsider their perceptions of NFTs and how they’re used."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9oZXJlLXMtd2h5LXN0eC1jZngtc3N2LWFnaXgtYW5kLWdydC1hcmUtdGhlLXRvcC1wZXJmb3JtaW5nLWFzc2V0cy1pbi1mZWJydWFyedIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Here's why STX, CFX, SSV, AGIX and GRT are the top performing assets in February - Cointelegraph",
        "content": "The month of February was filled with investors’ hope that an earlier-than-expected Federal Reserve policy pivot would occur, but this sentiment faded as the inflation and employment data came in hotter than expected. While the start of the month was bullish for the crypto market, Bitcoin (BTC) retraced 60% of the move from February’s low at around $21,500 to the peak of $25,250.\n\nNevertheless, some narrative-driven rallies still caused significant price growth in some altcoins. The leading narratives were Bitcoin NFTs, liquidity staking derivatives (LSDs) on Ethereum and Artificial Intelligence (AI) projects.\n\nLet’s review the top performing coins of the month.\n\nStacks (STX)\n\nStacks gained much attention as the hype over Ordinals kicked off at the start of the month. Gamma, a Stacks-based project, enabled the creation of Bitcoin Ordinals. However, full functionality in trading and public minting of Ordinals on Stacks is still in development.\n\nMeanwhile, Stacks faces competition from other blockchains, with developers working toward enabling Bitcoin NFT trading on Ethereum. Yuga Labs, the leading NFT firm, announced a 300-piece generative collection on Bitcoin on Feb. 27. The auction (or minting) will likely be held on Ethereum due to the lack of infrastructure on Bitcoin. Thus, as Stacks delays its development of making Ordinals accessible, more liquid chains are taking advantage of other solutions.\n\nThe fundamentals of the Stacks blockchain do not corroborate with the price surge, which suggests that it could be purely speculative given the potential for Stack’s growth. In the short term, STX risks a pullback from the top of its trading range in both STX/USD and STX/BTC pairs. Nevertheless, if buyers can conquer resistance at $1.02, there’s a probability of STX taking a shot at all-time highs of $3.40.\n\nSTX/USD weekly price chart. Source: TradingView\n\nConflux (CFX)\n\nConflux Network received a significant boost on Feb. 15 as the blockchain team announced a partnership with the second largest telecom service in China, China Telecom. The telecom giant will provide blockchain-enabled mobile SIM cards to over 200 million users. The SIM card will store a public and private key, storing transferable user data in encrypted form.\n\nOver the years, Conflux has earned the reputation of a Chinese enterprise blockchain with partners in Oreo China, McDonald’s China and Chinese Instagram equivalent Little Red Book. The blockchain also hosts a stablecoin pegged to the Chinese yuan with the approval of the Chinese government, which is highly encouraging given the strict influence of the authorities over state policies.\n\nThe Conflux Network deploys both proof-of-work and proof-of-stake mechanisms to increase scalability and decentralization. The network processes between 3,000 to 6,000 transactions per second, which is considerably faster than Ethereum’s speed of 15 tps.\n\nWhile Conflux has established partnerships with leading Chinese brands, the activity on the blockchain has yet to justify the 500% increase in CFX's price in February. Data shows that the number of new Conflux addresses and NFTs minted on the platform has stayed at par with previous months with no evident spike.\n\nThis raises concerns about the sustainability of the hype building around the blockchain. Extensive partnerships in the blockchain space have often failed due to a lack of real-world integrations.\n\nNumber of NFTs minted on Conflux every month. Source: Conflux Scan\n\nThe CFX/USD pair’s vertical rally met with resistance at the October 2021 high of $0.34. The psychological levels of $0.20 and $0.10 will act as support in case of a pullback.\n\nSSV Network (SSV)\n\nSSV Network benefited from the craze around the Ethereum Shanghai upgrade, which has fueled the rise of LSD tokens. SSV Network is an infrastructure provider that will likely provide backend support for LSD platforms to help decentralize the Ethereum network.\n\nThe project is working on the idea of Distributed Validator Technology (DVT), first proposed by Ethereum co-founder Vitalik Buterin in the Ethereum 2.0 design. It enhances the security and decentralization of the Ethereum PoS network by allowing smaller stakers and validators to use the SSV Network and run Ethereum validating nodes.\n\nOn Jan. 19, the team announced a $50 million ecosystem fund to support the development of the technology. The fund is backed by leading crypto venture capitalists including Digital Currency Group, Coinbase Ventures, HashKey, NGC, Everstake, GSR and SevenX.\n\nThe project gained a lot of attention as the official sponsor of the ETH Denver Hackathon 2023, where the project gave grants to teams developing on DVT technology. SSV Network shows significant potential for adoption by LSD protocols as the amount of staked Ether increases after the Shanghai upgrade.\n\nStill, a significant portion of the 160% gains in February could be due to a rotation from the crowded LSD tokens toward other protocols that stand to benefit after the Shanghai upgrade.\n\nTechnically, SSV token is in price discovery mode, making new all-time highs. Thus, it’s likely that the token continues to surge higher, especially if leading LSD platforms like Lido or Rocket Pool announce SSV Network integration.\n\nHowever, the token tagged the $50 psychological level on Feb. 27, which could see some profit booking from investors. On the downside, the token will likely find support near 2022 highs of $21.\n\nSingularityNET (AGIX)\n\nSingularityNET benefited from the continued hype in AI-related projects. The protocol’s marketplace invites users to purchase AI services in its native cryptocurrency, AGIX. The token’s price has jumped nearly 12 since the start of 2023, from $0.045 to a peak of $0.58.\n\nThe latest surge in SingularityNET can be attributed to its partnership with Cardano. The protocol currently resides on Ethereum for hosting rudimentary AI bots for image processing, language translations and statistical analysis. The migration to Cardano provided a huge boost to the protocol as it started offering ADA staking service and facilitating a decentralized bridge between Ethereum and Cardano.\n\nAGIX token reversed from its all-time high levels at $0.63, which could continue to provide resistance for bulls. As the AI hype subsides, a correction toward $0.33 and $0.15 support cannot be ruled out. Nevertheless, if buyers are successful in pushing the price above the $0.63 resistance level, AGIX can run significantly higher.\n\nGraph Protocol (GRT)\n\nSimilar to SingularityNET, The Graph protocol has also benefited from an increase in the AI narrative. The indexing protocol on Ethereum and IFPS is slowly transitioning to an independent layer-1 network. It works through coordination between subgraph developers, who create and store an easily accessible database of blockchains, and decentralized application developers, who use this database to create products.\n\nAccording to a recent report by Messari, The Graph’s revenue increased 66% in Q4 2022 compared to the previous quarter. The number of subgraphs on the network has increased consistently, with a 12% quarter-on-quarter increase in revenue for network participants.\n\nGRT token has significant upside potential if the growth of the network sustains. Technically, the July breakdown levels at $0.33 and 2022 highs of $0.51 will be the likely targets for bulls, with support at the psychological level of $0.1 and the 2023 yearly opening price of $0.056.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vbmV3cy5hYnBsaXZlLmNvbS9idXNpbmVzcy9jcnlwdG8vZXRoZXJldW0tZXRoLXByaWNlLXNlZWluZy1hLXN1cmdlLWluLTIwMjMtaXMtaXQtYS1nb29kLXRpbWUtdG8taW52ZXN0LTE1ODUxNzbSAXpodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2V0aGVyZXVtLWV0aC1wcmljZS1zZWVpbmctYS1zdXJnZS1pbi0yMDIzLWlzLWl0LWEtZ29vZC10aW1lLXRvLWludmVzdC0xNTg1MTc2L2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Why Is Ethereum Seeing A Surge In 2023? Is It A Good Time To Invest? - ABP Live",
        "content": "In recent times, Ethereum, the second-largest cryptocurrency by market capitalization, has been making headlines due to a sudden surge in value. The altcoin hit its all-time high in October 2021 at the $4,899 level. Despite ETH being down by nearly 66 percent from its all-time high, it has gained about 84 percent from its lowest cycle in the past seven months. However, several reasons are attributed to the recent surge above the $1,600 and $1,700 levels.\n\nUpcoming Shanghai Update\n\nEthereum's upcoming Shanghai update, scheduled for release in March this year, could be the primary driver behind the surge in the altcoin's value.\n\nOne of the crypto world’s long-awaited events since 'The Merge' last year, the Shanghai Update promises to enhance Ethereum's liquidity by unlocking the staked ETH in the Beacon Chain.\n\nAccording to Ethereum founder Vitalik Buterin, the update's primary focus is to address the platform's scalability challenges by fragmenting the ETH database, enabling the network to scale while preserving its decentralized nature.\n\nThe Shanghai update is one of the most anticipated events in the cryptocurrency industry, attracting the attention of crypto enthusiasts worldwide.\n\nAs a result, traders and investors are likely to buy ETH to take advantage of its anticipated utility services post-update, driving its value further.\n\nEase Of Macroeconomic Relaxation\n\nIn 2022, many macroeconomic factors affected the global economy. On the one hand, the US Federal Reserve increased interest rates aggressively to address inflation. On the other hand, there were issues such as the conflict between Russia and Ukraine and the uncertainty caused by the pandemic.\n\nWhen interest rates are increased aggressively, it can impact people who borrow large amounts of money. As a result, they may be less willing to invest in volatile assets like cryptocurrencies and instead keep their cash on hand.\n\nALSO READ: Why Crypto Is More Volatile Than Stocks\n\nLast year, the Fed cranked up interest rates eight times since March 2022, including four consecutive 0.75 percent base points increases to tackle inflation.\n\nHowever, the Fed has hiked 0.25 percent base points this January, as inflation showed signs of easing a bit. Investors and traders may anticipate fewer interest rate hikes than last year and may be interested in buying crypto assets.\n\nIncreased Institutional Adoption\n\nIn the past three months, there has been increasing institutional adoption of cryptocurrencies, contributing to Ethereum's rise in value. In the past three months, ETH has surged by 36 percent.\n\nMany large corporations and financial institutions, such as Visa, announced a proposal last December to enable Ethereum holders to set up programmable payments from their own self-custodial wallets. This would further eliminate banks and centralized third parties from the transaction process.\n\nSurge In Bitcoin Price\n\nBoth Bitcoin and Ethereum have exhibited a positive correlation in the past years. If BTC surges in value, ETH also tends to follow suit. This is likely because BTC is seen as a store of value, and in times of market volatility, it is the first cryptocurrency investors would turn to.\n\nALSO READ: Bitcoin Is Seeing A Resurgence This Year After A Challenging 2022: Here’s Why\n\nSo, generally, when BTC's value increases, it can increase investor confidence and investment in the broader crypto market, including Ethereum. However, this is not the only factor that has influenced Ethereum's value, but it could be one of the factors.\n\nHODLing\n\nHODLing — cryptospeak for holding assets for an extended period of time — can contribute to a surge in the price to a certain extent through increased confidence in the cryptocurrency. When more people hold Ethereum for a more extended period, it suggests that they believe in its long-term value and potential.\n\nThis might have attracted new buyers who saw the existing holders as a signal of the asset's value. And this again, the upcoming update could be one of the reasons why investors and traders might be holding it.\n\nIs This The Right Time To Invest In Ethereum?\n\nInvesting in assets is always a wise decision, but it's crucial to remember that investing is a long-term process focusing less on immediate or short-term profits.\n\nWith a high market capitalization, Ethereum is one of the leading cryptocurrencies. While Bitcoin has a finite supply, Ethereum possesses vast utility and is poised to undergo numerous upgrades, resulting in exceptional scalability and applications soon.\n\nALSO READ: How Crypto Diversification Can Protect Your Portfolio Against Volatility\n\nWhether or not to invest in such a cryptocurrency ultimately depends on the investor's preferences and convictions. But, while investing, it is always suggested to do your own research before putting your hard-earned money on any asset.\n\n(The author is the CEO and co-founder of Mudrex, a global crypto investing company)\n\nDisclaimer: The opinions, beliefs, and views expressed by the various authors and forum participants on this website are personal and do not reflect the opinions, beliefs, and views of ABP Network Pvt. Ltd. Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zdGFja3Mtc3R4LXN1cmdlcy1hcy1iaXRjb2luLW5mdC1oeXBlLWdyb3dzLWJ1dC1pdHMtYmxvY2tjaGFpbi1hY3Rpdml0eS1yYWlzZXMtY29uY2VybtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Stacks (STX) surges as Bitcoin NFT hype grows, but its blockchain activity raises concern - Cointelegraph",
        "content": "Stacks is one of the first blockchains to enable a way for minting Bitcoin (BTC) Ordinals, which puts it in an excellent position to benefit from the hype. However, Ordinals have invoked an issue from the past where Bitcoin maximalist ideologies will be tested if the NFTs lead to network congestion.\n\nOn top of that, Stacks has yet to deliver all the functionalities required to support an NFT trading ecosystem and it faces competition from projects in other blockchain ecosystems. The fundamental and technical analysis of the project suggests that the price surge might have reached overbought conditions and may correct in the near term.\n\nOrdinals development is unpredictable for now\n\nThe recent focus on inscribing NFTs on the Bitcoin network peaked in the last month after Casey Rodarmor inscribed an Ordinal on Jan. 29. While the trend took off to an overwhelming start, the minting is limited to technical users with a Bitcoin node and trading primarily takes place through OTC channels.\n\nIn comparison to Ethereum NFT marketplaces, the infrastructure for Bitcoin NFT trading remains significantly underdeveloped in regards to complex activities like decentralized trading. Many investors have expressed their belief that there needs to be a way to spin up marketplaces and NFT minting platforms for Ordinals.\n\nThe Bitcoin developer community has previously discouraged using the network for anything other than payments because it clogs the space and increases transaction fees. In the bull run of 2020 and 2021, many Ethereum users paid hundreds of dollars in fees per transaction as user activity on it exploded. On the other hand, Bitcoin’s fees stayed at optimum levels throughout the bull run, but the usage and earnings of the protocol lagged behind Ethereum.\n\nAccording to a CoinShare report, the adoption of Ordinals will again be subject to the social acceptance of the method to inscribe additional data on the Bitcoin blockchain, which is bound to present challenges such as network congestion and increased fees.\n\nThe report goes on to review previous failed attempts to use the Bitcoin blockchain for smart contract activity, saying that “similar projects of Bitcoin’s past have had little impact on investors and users alike.”\n\nThe number of Ordinals inscribed on Bitcoin surged significantly at the start of February as the instrument exploded. However, the trend slowed down due to a lack of trading infrastructure, with less than 10,000 NFTs inscribed on most days.\n\nStack blockchain’s native STX (STX) token jumped by 256% in February, thanks to hype around Bitcoin NFTs and an upcoming upgrade to the project.\n\nNumber of ordinals inscribed on Bitcoin daily. Source: Dune\n\nIt remains to be seen how the Bitcoin community reacts to an increase in network congestion and Bitcoin fees if the Ordinals hype grows.\n\nStacks price rises on speculation, while activity is low\n\nThe idea is that Stacks will make Bitcoin Ordinals more accessible to users by facilitating minting processes and hosting marketplaces.\n\nStacks Foundation, the team managing the blockchain, on Feb. 22 announced a new upgrade to the protocol, Stacks 2.1, which seeks to improve the blockchain by adding EVM compatibility and synthetic Bitcoin (sBTC) through a secure bridge to Bitcoin.\n\nOn top of that, the .BTC naming service lives on the Stacks network, which could generate a lot of trading activity if the demand for .BTC addresses increases. In its current state, a .BTC Stacks address is largely detached from the Bitcoin network. Meaning, users cannot send and receive Bitcoin at these addresses like its .ETH counterpart.\n\nAfter the 2.0 upgrade, Stacks will enable direct sending of Stacks assets to Bitcoin addresses. It will enable proxy access to the Bitcoin blockchain without creating a separate Stacks address. It remains to be seen if Bitcoin users find the feature attractive.\n\nWhile the upgrades sound promising, there’s still insufficient blockchain activity to justify the STX price surge. Only around 1,000 unique active wallets engaged with DApps on Stacks in February. The most striking part of Stack’s usage data was that the NFT marketplace Gamma also failed to attract considerable users to its platform, with less than 100 wallets trading daily on the marketplace.\n\nTop used dApps on Stacks between Jan. 28 and Feb. 27. Source: DappRadar\n\nGamma supports minting and sending Bitcoin ordinal NFTs via Stacks. However, many users have faced UX-related problems while using the feature, as it requires a separate address in a Stacks wallet that is Ordinal compatible. Many users have mistakenly sent their NFTs to wrong addresses. The wallet issue has also restricted the trading of Bitcoin NFTs.\n\nGamma NFT marketplace stats. Source: DappRadar\n\nDevelopers in the Stacks ecosystem, like the Xverse team, are working on a wallet to bring user-friendly Ordinals support. There's also an experiment with atomic swaps between Bitcoin NFTs and STX in the works. The aim is to develop this functionality into a complete marketplace.\n\nHowever, other ecosystems are also looking to bank on this trend. For instance, Ordinex is developing an Ordinals trading platform, which will be accessible for Ethereum users through Metamask. Some Ethereum native projects, like OnChainBirds and SappySeals, have also inscribed the NFTs on Bitcoin and enabled trading on OpenSea. However, the trading activity of these collections remains average, with little hype.\n\nBesides Stacks, many other ecosystems are trying to bank on the opportunity by facilitating Bitcoin NFTs. While Stacks enjoys a technical advantage over others, Ethereum has a loyal user base and adequate liquidity to outperform Stacks’ ecosystem if a feasible solution emerges. Moreover, in the end, it will depend on the response and demand of these NFTs from the Bitcoin community, which may not support euphoria around it.\n\nSTX/USD reaches key resistances zones\n\nThe STX token dilutes at the rate of 2.5% annually. The inflation will reduce after the Bitcoin halving, which is expected to occur in April 2024. The rate of supply increase of STX is low compared to other layer-1 blockchains like Solana and Cardano, which is encouraging. However, the network’s total fees or token economics do not balance the inflation, which needs to change soon.\n\nTechnically, the STX/USD pair is near the top of its two-year trading range at $1.02, which is a potential yellow flag for buyers. If bulls are able to overcome this level, STX can possibly take a shot at the all-time highs near $3.00. However, given that network activity doesn’t correlate to the price rise as of yet, there’s a chance of a pullback toward $0.68 and $0.24.\n\nSTX/USD daily price chart. Source: TradingView\n\nSimilarly, the STX/BTC pair is also near its all-time range of 0.00004350 BTC, which raises the possibility of a correction once those levels are tagged. The downside targets of STX are at 0.00002744 BTC and 0.00001233 BTC.\n\nSTX/USD weekly price chart. Source: TradingView\n\nBitcoin NFTs have a lot of potential, but it is still unclear if the Bitcoin community, which is usually against speculation and activities that clog the network, will allow the trend to prosper.\n\nCurrently, the most crucial aspect of NFT trading — an easily accessible marketplace and wallet — is still missing from the Ordinals ecosystem. As a Bitcoin sidechain, Stacks enjoys technical advantages with Bitcoin integration and it has a slight advantage over other blockchains in providing the tools to support an Ordinals craze.\n\nHowever, the applications to support Ordinals are still in development. Meanwhile, Stacks faces competition from other more liquid ecosystems, which could develop more feasible solutions to integrate Bitcoin NFTs on their chain.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmNpdHlhbS5jb20vb2t4LXNheXMtaXQtaG9sZHMtOC02LWJpbGxpb24taW4tYml0Y29pbi1ldGhlcmV1bS1hbmQtZG9sbGFycy1hcy1wcm9vZi1vZi1yZXNlcnZlcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "OKX says it holds $8.6 billion in Bitcoin, Ethereum and dollars as proof-of-reserves - CityAM - City A.M.",
        "content": "OKX says it holds $8.6 billion in Bitcoin, Ethereum and dollars as proof-of-reserves\n\nLennix Lai\n\nOKX, the world’s second-largest crypto exchange by trading volume, has revealed it holds $8,6 billion in Bitcoin, Ethereum and US dollars.\n\nThe Web3 platform published its fourth monthly proof-of-reserves (PoR) to allow users to view the reserves as well as using open-source tools to check their liabilities.\n\nOKX says more than 175,000 unique users visit the PoR page and in excess of 90,000 unique users verify their liabilities accounted for in the PoR. Third party data shows that OKX holds the largest 100% clean asset reserves among major exchanges.\n\n“We are proud to continue the monthly publishing of our proof-of-reserves in line with our unwavering commitment to transparency and trust here at OKX,” said Lennix Lai, Managing Director of Financial Markets.\n\n“Our data shows that hundreds of thousands of our users have taken an active interest in viewing our historical reserves and using open-source tools to verify their liabilities are included. Proof-of-reserves is far from a niche topic – it is of vital importance to building user trust and we are dedicated to ensuring OKX shows continued leadership in this area.”\n\nWhat does ‘proof-of-reserves’ mean?\n\nProof-of-reserves is a report of crypto assets that ensures the custodian (in this case OKX) holds the assets it claims to hold on behalf of its users. OKX uses the Merkle tree (hash tree) to prove this claim in two ways. First, users can find their balance in the tree and prove their assets are held in the total OKX balance. Second, the total OKX balance is compared to the publicized OKX on-chain wallet balance to determine proof-of-reserves.\n\nWhat are ‘clean reserves’?\n\nAssets are considered ‘clean’ in PoR when a third party analysis determines they do not include an exchange’s platform token, and are solely made up of high market cap ‘traditional’ crypto assets such as BTC, ETH and USDT. Blockchain analytics firm CryptoQuant monitors PoR across the industry, and found OKX’s assets to be ‘100% clean‘."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMinwFodHRwczovL2VuZ2xpc2guamFncmFuLmNvbS9idXNpbmVzcy9jcnlwdG9jdXJyZW5jeS1wcmljZXMtdG9kYXktZmVicnVhcnktMjgtYml0Y29pbi1ldGhlcmV1bS10cmFkZS1pbi1yZWQtYXMtZ2xvYmFsLWNyeXB0by1tYXJrZXQtY2FwLWRlY2xpbmVzLWZ1cnRoZXItMTAwNjcwNjPSAaQBaHR0cHM6Ly9lbmdsaXNoLmphZ3Jhbi5jb20vbGl0ZS9idXNpbmVzcy9jcnlwdG9jdXJyZW5jeS1wcmljZXMtdG9kYXktZmVicnVhcnktMjgtYml0Y29pbi1ldGhlcmV1bS10cmFkZS1pbi1yZWQtYXMtZ2xvYmFsLWNyeXB0by1tYXJrZXQtY2FwLWRlY2xpbmVzLWZ1cnRoZXItMTAwNjcwNjM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Cryptocurrency Prices Today February 28 Bitcoin, Ethereum Trade In Red As Global Crypto Market Cap Declines Further - Jagran English",
        "content": "Your browser does not support the audio element.\n\nThe cryptocurrency market traded in the red on Tuesday (February 28). The global crypto market cap declined 0.56% to reach the $ 1.06 trillion mark. Top cryptocurrencies Bitcoin and Ethereum are also trading in the red today.\n\nThe total crypto market volume in the past 24 hours is $45.76B, an increase of almost 24.44%. The total volume in DeFi at the time of writing is $5.11B, 11.16% of the total crypto market 24-hour volume. The volume of all stablecoins at $41.08B is 89.76% of the total crypto market 24-hour volume.\n\nThe price of the largest cryptocurrency Bitcoin was seen at USD$23,278.56, down 0.65% in the last 24 hours. BTC has a current market capitalization of USD$449,368,193,482. Bitcoin’s dominance is currently 42.26%, a rise of 0.06% over the day.\n\nHow Are Other Cryptocurrencies Performing Today?\n\nThe live price of Ethereum at USD$1,621.47 is down 1.04% in the last 24 hours. Ethereum has a 24-hour trading volume of USD$6,985,852,433 and its current market capitalization is USD$198,425,604,411.\n\nOther top crypto tokens that traded lower today included Polygon, Solana, Polkadot, Shiba Inu, Litecoin, etc.\n\nThe live price of Polygon fell 2.55% today at USD$553,075,971. Polygon’s current market capitalization is USD$10,640,116,429 and according to CoinMarketCap data, its current market ranking is 9.\n\nSolana is currently trading at USD$22.23 with a 24-hour trading volume of USD$449,204,930. The altcoin is down 2.47% in the last 24 hours. Solana commands a market capitalization of USD$8,410,468,755.\n\nAt the live market price of USD$6.45, Polkadot has slumped 2.04% in the last 24 hours. With a live market cap of USD$7,496,764,773, the altcoin’s CoinMarketCap ranking is 12.\n\nAmong the top crypto losers were Stacks (STX), Optimism (OP), and Neo (NEO) down 7.83%, 5.99%, and 5.20% respectively.\n\nComing to the world’s two most popular meme coins, on Tuesday, Shiba Inu was down 2.70% at USD$0.000012 with a 24-hour trading volume of USD$193,622,979, while Dogecoin was up 0.21% at USD$0.081265.\n\nLitecoin’s price was down 0.49% at USD$93.83 with a 24-hour trading volume of USD$403,853,356 USD."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmluZGlhdG9kYXkuaW4vY3J5cHRvY3VycmVuY3kvc3Rvcnkvc2Vwb2xpYS10ZXN0bmV0LWV0aGVyZXVtLXByb29mLW9mLXN0YWtlLXNoYW5naGFpLWhhcmQtZm9yay0yMzQwNjY1LTIwMjMtMDItMjjSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Sepolia testnet to successfully upgrade for upcoming Shanghai hard fork - India Today",
        "content": "The Ethereum blockchain's Sepolia testnet has successfully upgraded to Shapella to simulate the upcoming Shanghai hard fork, which is expected to occur on the network's mainnet at the beginning of March.\n\nWhat is this all about?\n\nOn 28 February, the 'Shapella' upgrade was successfully implemented on the testnet, combining the names of the upcoming Shanghai and Capella hard forks.\n\nadvertisement\n\nSepolia testnet has successfully upgraded to Shapella! ð\u009f\u008c\u0083\n\n\n\nSome of the Prsym validators are offline due to the old geth version. They will come online in the next 10 mins!\n\n\n\nNext stop: Goerli pic.twitter.com/pb43Gq7w9C— terence.eth (@terencechain) February 28, 2023\n\nShanghai is the name of the fork on the execution layer client side, and Capella is the name of the upgrade on the consensus layer client side. Among other new features, one of the major changes allows validators to withdraw their staked Ether (stETH) from the Beacon Chain back to the execution layer.\n\nUpgrades will be released on the Ethereum Goerli\n\nTo validate the Ethereum blockchain, validators needed to stake 32 Ethereum. They can now withdraw rewards in excess of 32 ETH and continue validating, whereas those who want to fully withdraw can take all 32 ETH plus rewards and stop validating. Before the Shanghai fork goes live on the mainnet, the upgrade will be released on the Ethereum Goerli testnet, which is expected to begin in March.\n\nThe Sepolia test was designed to give developers another practice run of withdrawals similar to those that will occur on the main Ethereum blockchain. Testnets are blockchain replicas that allow developers to test changes to their applications in a low-stakes environment.\n\nHow will the main test be?\n\nAccording to several reports, the final testnet upgrade to Goerli, the Ethereum testnet, will take place in the coming weeks. The Goerli testnet would be viewed as the final dress rehearsal before the final blockchain could process staked ETH withdrawals. Goerli's testing will also be the most anticipated because it is the largest of the three and would keenly watch the main Ethereum blockchain activity."
    }
]