[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmZpbmV4dHJhLmNvbS9ibG9ncG9zdGluZy8yMzk4MC90aGUtZXRoZXJldW0tMjAtam91cm5leS1mcm9tLWJlYWNvbi10by1ldGVybml0edIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Mar 2023 07:00:00 GMT",
        "title": "The Ethereum 2.0 Journey: From Beacon to Eternity - Finextra",
        "content": "Last year September Ethereum blockchain entered a new phase in its Ethereum 2.0 journey. After launched the Beacon Chain in December 2020, a parallel blockchain which acts as consensus engine that runs on proof of stake, The Merge was concluded in September 2022 whereby the Beacon Chain and the Mainnet, the normal Ethereum blockchain, merged into one blockchain thereby switching from Proof of Work to Proof of Stake.\n\nRecently it was announced that a third important step is planned on 10 April: the Shanghai upgrade or hard fork. This upgrade is expected to bring significant improvements to the network, including enhanced scalability, improved security, better support for smart contracts and decentralized applications as well as greatly reducing energy consumption.\n\n\n\nIn this blog I will take you by the hand in the further Ethereum 2.0 journey towards the final stage: Eternity.\n\nBeacon Chain: start of the Ethereum 2.0 journey\n\n\n\nThe Ethereum 2.0 journey was kickstarted by the Beacon Chain launch in December 2020, termed Phase 0 of the Ethereum 2.0 roadmap. This phase aimed to introduce and test the proof of stake consensus in the Ethereum context.\n\nThe Beacon Chain was a blockchain which acted as a consensus engine of Ethereum 2.0, the part that coordinates the entire system. This upgrade proposed a parallel blockchain which runs on proof of stake, while the Ethereum Mainnet continued to be secured by proof of work.\n\nThe Beacon Chain did not process transactions or host the smart contracts. It was intended as the heart of Ethereum 2.0, which would replace the miners in Proof of Work with validators who decide the blocks.\n\n\n\nPrior to the Merge, validators began staking 32 ether (ETH) on the Beacon Chain in order to participate in the block validation process. Validators could stake their ethers in smart contracts, and as a reward they got interest. Before validators agreed to participate on the PoS blockchain, they were made aware that their staked ETH and any accrued rewards would remain locked up until a subsequent update to the chain.\n\nThe Merge\n\nOne of the most anticipated crypto occasions last year was the Ethereum Blockchain’s Merge. On 15 September 2022 the Beacon Chain with its new proof of stake consensus layer and the Mainnet, the normal Ethereum blockchain, merged into one blockchain. The Merge marked a significant step in the Ethereum blockchain’s transition to a proof-of-stake (PoS) consensus mechanism from proof-of-work (PoW).\n\n\n\nThe Merge represents the formal adoption of the Beacon Chain on the new consensus layer to the original Mainnet execution layer. The Merge will completely cast aside the role of crypto miners, to now assign the ‘validators’ who randomly approve transactions and add blocks to the Ethereum blockchain and earn a small reward, eliminating the need for energy-intensive mining. Instead of competing on speed and energy to generate a hash - it is estimated that Ethereum’s energy consumption got reduced to a whopping 99.95% - validators in PoS systems compete on the amount of ether staked (deposit).\n\nValidators are now responsible for processing the validity of all transactions and proposing blocks. A validator will be chosen at random from a group of individuals who have “staked” (basically, pledged at least 32 Ethereum tokens on the network) their money. The PoS system should ensure the validator nodes are sufficiently incentivized to maintain the network’s security. The more ETH a validator stakes, the more likely they will be selected to “propose” the next block of Ethereum transactions and earn some network rewards.\n\nBut in addition to accessing locked up funds, the PoS blockchain has not been fully featured ever since it went live. Even though the blockchain functions properly today, stakers have had to commit to keeping their funds locked in order to keep Ethereum running.\n\n\n\n\n\nUpcoming upgrades\n\nEthereum has announced a number of important upgrades on 10 April. Shanghai and Capella are the upcoming Ethereum hard forks names. Ethereum developers have started to refer to the blockchain’s upcoming hard forks – in this case a key upgrade – as (Shanghai + Capella =) “Shapella.”\n\nThe Ethereum protocol is made up of two layers: the execution layer and consensus layer. Now, the two layers have different functions that help move the Ethereum blockchain forward. The execution layer is where all smart contracts and protocol rules live. The consensus layer is in charge of making sure that all validators on the network are following those rules.\n\nTechnically the Shanghai upgrade is only on the execution side of Ethereum. Capella is the simultaneous upgrade happening on the consensus side. Major changes to the consensus layer include full and partial withdrawals for validators and independent state and block historical accumulators, replacing the original singular historical roots.\n\nShanghai upgrade\n\nThe Shanghai upgrade, also known as hard fork, initially scheduled for March was later postponed by Ethereum developers until 12 April. This upgrade is expected to bring significant improvements to the network, including enhanced scalability, improved security, and better support for smart contracts and decentralized applications. The network upgrade will address staked ether withdrawals and reductions in gas fees for developers.\n\nSome key Ethereum improvement proposals (EIP) on the execution layer include Beacon Chain push withdrawals and warm Coinbase. The Shanghai upgrade will complete Ethereum’s full transition to a proof of stake (PoS) network by finally allowing validators to withdraw their staked Ether from the Beacon Chain to the Ethereum Virtual Machine (the execution layer) via a new “system-level” operation type. The Ethereum Virtual Machine (EVM) is the environment where Ethereum is able to execute smart contracts.\n\nUp till now a total of 16 million ETH (roughly 30 bn dollar) have thus far been “staked” on the Beacon Chain to help secure the network since December 2020.\n\nTo prevent instability on the market, validators cannot stake in one go. They may be subject to a daily ETH redemption quota because of the processing constraints on the Ethereum network. They can only stake their saved staking yields immediately. In total less than 60.000 ETH a day will be available for withdrawal.\n\nThe warm Coinbase is the name of the software that builders use to receive new tokens on the network. Every new platform transaction must interact with the Coinbase software multiple times. With the introduction of EIP-3651 the Coinbase software will remain warm to begin with, requiring a lower gas fee to access it, instead of needed to ‘warm up’.\n\nNow with the mechanism that will unlock staked ETH, the full operation of a proof-of-stake blockchain will come to life, meaning that stakers can finally have control over their funds and decide what they want to do with their rewards.\n\nUpdated roadmap: Further upgrades\n\nThe Shanghai upgrade is a major upgrade and transformation of the Ethereum network. It is an essential step on the road to Serenity, which is the final phase of the broader roadmap for Ethereum 2.0.\n\nThe Ethereum updated Roadmap paves the way for a number of further upgrades within the coming years. The Merge has set the stage for further scalability upgrades not possible under proof-of-work, bringing Ethereum one step closer to achieving the full scale, security and sustainability. Ethereum 2.0 will thereby introduce several new technologies and protocols, proto-danksharding, and a new virtual machine (VM) called eWASM. There are four major upgrades with interesting names such as Surge, Verge, Purge and Splurge.\n\n\n\nThe Surge: Proto-danksharding\n\n\n\nDevelopers decided to keep the scope of the Shanghai upgrade relatively small, mainly so that staked ETH withdrawals would be released as soon as possible. As a result, some other big changes to the Ethereum protocol such a proto-danksharding primarily aimed at improving transaction output, were pushed back to the third quarter of 2023.\n\n\n\nThe initial plan was to implement sharding, splitting up transactions into multiple chains to reduce fees and speed up transactions. But, as sharding has proven difficult to implement and as Layer 2 technologies evolved, the sharding plan was updated to a format that improves the scalability of Layer 2 networks or rollups like Arbitrum and Optimism: the so-called Pro-danksharding also known as EIP-4844.\n\n\n\n“[Proto-]danksharding will be the most exciting thing devs will work on in 2023.” Proto-danksharding has “the potential to onboard millions of users and truly provide scalability to Ethereum.” Parithosh Jayanthi, DevOps engineer Ethereum Foundation\n\nThe proposed Proto-danksharding (PDS) aims to move all computation to Layer 2 networks (execution layer) and data to be posted on the Ethereum mainnet (data layer). Layer 2 networks are companion systems designed to help a cryptocurrency system handle a larger volume of data. Compared to sidechains, Layer 2 networks or rollups are considered to be the more secure way for Ethereum to scale. Rollups, like sidechains, take the stress off of Ethereum by executing transactions on a separate blockchain.\n\nWhile danksharding takes the same principle of splitting a network into shards, instead of providing more space for transaction, it is adding a new transaction type to Ethereum, the so-called blob-carrying transaction which can carry an extra piece of data called blob, allowing Ethereum to process more data. Transactions are ‘settled’’ on the rollup chain, bundled, and then ‘posted’ to Ethereum.\n\nUnlike sidechains, rollups borrow their security from the Ethereum mainnet, thereby using fancy cryptography and other methods (like a multi-day dispute period) to allow Ethereum mainnet nodes to confirm that transactions are legitimate.\n\nOnce the proto-danksharding and its associated updates are in place, it is expected to be able to at least increase the transaction throughput to 100,000 transactions per second and beyond (on rollups), significantly decreasing the cost of using rollups.\n\n\n\nThe Verge\n\n\n\nAnother upgrade is The Verge that reduces the amount of blockchain data that validators have to store for transaction validation purposes.\n\n\n\nThe verge will therefore introduce a new data structure called “Verkle trees”. This is – a modified version of a Merkle tree that blockchains like Bitcoin typically use. Verkle trees use vector commitments instead of hash functions in Merkle Tree. A Merkle-Tree requires more hashes as the number of child nodes increases, whereas using vector commitments allow the tree to expand without increasing the proof size.\n\n\n\nThe Verge will also introduce “stateless clients,” which allow users on the network to become validators without having to store extensive amounts of data on their machines. This means validators can run a node with a lower hardware requirement, making it more economical to run a node in the long run.\n\n\n\nThe Verge aims to simplify the verification of blocks. It has a set of plans which can decrease the hardware requirements of validators. Stateless clients can verify blocks without downloading a local copy of Ethereum’s state, which can boost the storage requirement. These updates are mainly related to zero-knowledge (ZK) technology.\n\n\n\nThe Purge\n\n\n\nThe purge aims to reduce the amount of space required on one’s hard disc, simplify the Ethereum protocol over time, and stop needing nodes to keep history using history and state expiration. Similar to Verge, the role of Purge is to minimise memory load on the client side, by reducing outdated excess historical data on the blockchain.\n\n\n\nHistory expiration will instruct nodes to stop serving historical blocks whose age is above a limit and allow nodes to delete these from their local copy of the blockchain. New nodes will follow a different syncing mechanism which will sync the chain from the most recently finalized block instead of the genesis block. Once a node is fully synced, it will not require historical data to validate future blocks.\n\n\n\nThis doesn’t mean that data would get deleted from the blockchain after some time. Only fewer services in the world would store the complete and full historical data of the Ethereum blockchain. This will also help minimise network congestion, as validators themselves can process each transaction without back-checking the entire blockchain history. The entire history becomes accessible only on demand.\n\n\n\nThe idea of state expiration is to prune portions of the state that have remained unused for a certain period. The shortened state will be represented by a Verkle tree root that users can use to retrieve the expired state. The expiration techniques can reduce the storage requirements for nodes and ease processing requirements on the client side. This phase also proposes changes to logs, data serialization and EVM operations.\n\n\n\n\n\nThe Splurge\n\n\n\nAs the name suggests, at this phase, Ethereum 2.0 devices can go on a “development splurge” to include features that are currently considered low priority.\n\n\n\nA series of upgrades will combine improvement proposals that don’t exactly fit in with the high priority upgrade phases. This includes a set of miscellaneous updates related to various factors to ensure that the network keeps operating smoothly and that the updates to the protocol in the previous sections do not cause any issues.\n\n\n\nIt is anticipated that Ethereum 2.0 will especially focus on introducing new features to enable the development of decentralized applications simpler. It will include new capabilities that will make it easier for programmers to comprehend what is happening between their code and the EVM. While the account abstraction aims to reduce from two account types down to one, a contract account. This will allow users to choose arbitrary verification logic, like quantum-resistant signature schemes.\n\nThe further road to Serenity\n\nSerenity, the final stage of the Ethereum 2.0 roadmap, is expected to bring even more significant improvements and enhancements to the network, including the ability to handle millions of transactions per second, support for private transactions, while also reducing energy consumption and improving security and decentralization.\n\nEthereum 2.0 and Serenity are highly anticipated by the Ethereum community. As the Ethereum blockchain is a house to some of the most widely used cryptocurrency applications, they are expected to play a significant role in the future of decentralized finance (DEFI), non-fungible tokens (NFTs), and other blockchain-based applications and services. It would however still take a number of years until Ethereum 2.0 reaches the final stage of this broader roadmap. By then, the Ethereum network would look very different to what we see today.\n\nMany analysts believe that the Ethereum 2.0 ecosystem that is now being constructed will lead to a system that will attract many more investors. They expect that Ethereum will play an important role especially for investors from the traditional money markets. They not only may benefit from a passive income with low maintenance costs to maintain their positions. What is more important is the fact that they may benefit of complete liquidity now Ether is no longer completely locked in stakes. It is this aspect that many do believe that Ethereum will enter a new area with more traditional institutional investors that wish to buy a stake in on one of the most important smart contract platforms."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDMvMzEvY2FyZGFuby11c2Vycy1jYW4tc29vbi1hY2Nlc3MtZXRoZXJldW0tZGFwcHMtZGlyZWN0bHktZnJvbS1hZGEtd2FsbGV0cy_SAXRodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzAzLzMxL2NhcmRhbm8tdXNlcnMtY2FuLXNvb24tYWNjZXNzLWV0aGVyZXVtLWRhcHBzLWRpcmVjdGx5LWZyb20tYWRhLXdhbGxldHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Mar 2023 07:00:00 GMT",
        "title": "Cardano Users Can Soon Access Ethereum Dapps Directly From ADA Wallets - CoinDesk",
        "content": "The new feature will allow Ethereum application developers to build on Cardano’s network using Solidity – the computer language used to code Ethereum – without the need to install new toolkits or learn a new computer language."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9hbmFseXN0cy1kZWJhdGUtdGhlLWV0aC1wcmljZS1vdXRjb21lcy1vZi1ldGhlcmV1bS1zLXVwY29taW5nLXNoYXBlbGxhLXVwZ3JhZGXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Mar 2023 07:00:00 GMT",
        "title": "Analysts debate the ETH price outcomes of Ethereum's upcoming Shapella upgrade - Cointelegraph",
        "content": "The Ethereum Foundation has announced April 12 as the date of deployment of the much-anticipated Shanghai and Capella upgrade, together dubbed as Shapella.\n\nThe upgrades will enable withdrawals from Ethereum 2.0 staking contracts. The staking contract was first launched in December 2020. It only accepted one-way deposits of Ether(ETH), which will change after the upgrade.\n\nTo date, users have deposited over 18 million ETH, worth around $32.5 billion, into the Ethereum staking contract since December 2020.\n\nAnalysts vary on the estimates of ETH sell pressure\n\nMost users opted for liquid staking derivatives (LSD) on decentralized or centralized exchanges. Because these stakers are already liquid, there will likely be no new reason to sell after the Shapella upgrade.\n\nDecentralized LSD platforms like Lido currently account for around 33.2% of the total ETH deposits on the Beacon Chain. Out of the rest, around 27.1% is deposited via centralized exchanges like Coinbase, Binance and Kraken. Thus, 60.3% of the staked ETH is deposited via liquid staking mediums.\n\nOn the other hand, the illiquid ETH, which is deposited into the contracts directly by setting up nodes or third-party service providers, accounts for around 40% of the total amount. These are most likely to sell after unlocking.\n\nAccording to analysis from Nansen, around 59% of the illiquid deposits, between 3.62 million and 4 million ETH, are in profit. These users are most likely to go through partial or complete withdrawals after the withdrawals are enabled.\n\nSome of the illiquid stakers might also choose to re-stake and the Nansen report estimated total selling pressure to be somewhere between 1.2 million and 3 million ETH. However, all ETH will not be dumped into the market right away.\n\nViews on daily selling pressure\n\nThe Shapella upgrade will implement a two-tier partial and full withdrawal system.\n\nThe minimum amount to stake on ETH is 32 ETH. Stakers can withdraw amounts exceeding 32 ETH or completely withdraw the entire 32 ETH, plus additional rewards from the staking contract.\n\nThere will not be a situation where stakers rush to withdraw their ETH after the upgrade leading to a spike in gas prices. Ether withdrawals have no gas costs but will be limited to 16 partial or complete withdrawals per block. Thus, there will be a delay in the amount of ETH unlocked and moved to sell.\n\nAccording to the Nansen report, there will be three phases of ETH selling pressure after the upgrade.\n\nIn the first phase, lasting 27 hours after the update, the selling pressure from partial withdrawals will be around 84,000 to 125,000 Ether per day (around $133 million to $197 million).\n\nThe second phase will see maximum selling pressure from partial and full withdrawals, amounting to 136,000 and 173,000 Ether per day (about $218 million to $275 million) in additional selling pressure. This phase will last between the third and fourth day after the upgrade.\n\nThe last phase of selling pressure, with mainly full withdrawals, will last between 19 to 52 days, adding a daily selling pressure of between 48,000 and 53,000 Ether per day.\n\nEstimated selling pressure after Shapella upgrade. Source: Nansen\n\nThe 30-day moving average of exchange inflows is 313,533 ETH (worth around $550 million), which means the additional inflows will be between 15% to 55% of the moving average. This could suppress Ether prices until the selling pressure subsides in three to eight weeks.\n\nAnother estimate by Arcana Research found that around 1.3 million ETH will be sold in the first ten days due to partial and full withdrawals. The selling pressure will peak in the first three days with around $527 million (adjusted for Ether’s current price of $1,800) daily selling pressure. It accounts for around 6.4% of the ETH daily trading volume.\n\nWith less than a fortnight to the upgrade, traders may attempt to front-run the selling pressure by placing short orders in the futures market. So far, the futures market shows no significant uptick in open interest volume or funding rates for short orders.\n\nRelated: Ethereum’s Shanghai upgrade could supercharge liquid staking derivatives — Here’s how\n\nThe beginning of ETH withdrawals will reduce the risk of holding liquid staking derivatives bought via decentralized or centralized exchanges because they will become directly redeemable for ETH. Thus, newfound staking interest among investors sitting on the sidelines would somewhat counter the selling pressure.\n\nThe Ethereum staking ratio, i.e., the percentage of staked ETH relative to its total circulating supply, is 14.96%. This is significantly less than the industry average across other Layer-1 blockchains. The ETH staking ratio is also expected to improve in the long run.\n\nTechnically, the ETH/USD pair faces resistance from the $1,970 level. Breakout above this resistance can see the pair reach bullish targets around $2,330 and $2,750. In case of a downturn, support lies around $1,569.\n\nETH/USD weekly price chart. Source: TradingView\n\nThe Ethereum network will undergo one of the most extensive upgrades since the Merge in September 2022. ETH withdrawals after the Shapella upgrade are likely to see increased selling in the first few days after deployment, putting short-term pressure on prices. However, as the selling subsides and more users move to stake ETH due to reduced risk and increased yields, the market conditions could start favoring more upside in the long term.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vdWsuZmluYW5jZS55YWhvby5jb20vbmV3cy9wb2x5Z29uLWV0aGVyZXVtLWNyeXB0by1taWxlLTEzMjMyMzg5Ny5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Crypto Mile: Polygon co-founder on ambition to overtake Ethereum - Yahoo Finance UK",
        "content": "Watch: Polygon to 'overtake Ethereum in terms of economic activity,' claims co-founder | The Crypto Mile\n\nPolygon is set to \"overtake Ethereum in terms of economic activity\", claimed co-founder Mihailo Bjelic, after the layer two blockchain announced its zkEVM upgrade earlier this week.\n\nPolygon, which issues the matic (MATIC-USD) cryptocurrency, said that zkEVM (Zero-Knowledge Ethereum Virtual Machine) technology will now be used on their blockchain, which is built on top of the underlying Ethereum mainnet (ETH-USD).\n\nThe Ethereum blockchain gets congested and users face high transaction fees whenever the network gets too busy and high volumes of transactions need to be processed in short periods of time. Ethereum is known for its security and level of decentralisation, but it becomes slow and costly when used at scale.\n\nADVERTISEMENT\n\nPolygon's upgrade seeks to allow for the processing of high volumes of transactions at speed and at a low cost, without sacrificing privacy and network security.\n\nRead more: Binance: Investors withdraw more than $2bn after enforcement action by US regulators\n\nIt could see a shift in transaction volume from Ethereum to the Polygon network.\n\nOn this week's episode of The Crypto Mile, Mihailo Bjelic, co-Founder of Polygon, told Yahoo Finance UK: \"Polygon is going to overtake Ethereum in terms of economic activity.\n\n\"One of the previous implementations on Polygon already has higher transactional activity than Ethereum.\"\n\nBut he said there is no competition: \"Ethereum and Polygon as its layer two blockchain have this symbiotic relationship, where Ethereum serves as the foundational security layer\".\n\n\"The roadmap that Vitalik Buterin, as founder of Ethereum, communicated recently said that the intention of Ethereum is not to cause these end user transactions, but to become the security layer that will just verify activity from layer two blockchains, such as Polygon.\n\nRead more: 'Dressing digitally' pins hope on blockchain to clean up fashion's carbon footprint\n\nStory continues\n\n\"So it is a mutually beneficial relationship where it has already been agreed that Polygon will be the one hosting this end user activity.\",\n\nHe said the new upgrade was \"the beginning of a new chapter for blockchain technology, fulfilling Ethereum’s original promise of becoming a true 'world computer' and creating a fairer, more egalitarian internet for all\".\n\nPolygon is set to 'overtake Ethereum in terms of economic activity', claimed co-founder Mihailo Bjelic. Photo: Jakub Porzycki/NurPhoto via Getty (NurPhoto via Getty Images)\n\nHow far is Polygon from being adopted by business, enterprise, and industry?\n\nBjelic said the zkEVM upgrade was a critical step in seeing mass adoption of this web3 technology by the global technology, e-commerce, fashion, and entertainment industries.\n\nA number of big corporations and enterprises have started using Polygon and that companies including Telefónica (TEF) have said that they will build applications using Polygon zkEVM, according to Bjelic.\n\n\"Reddit, which is one of the biggest and most popular social networks has introduced their Collectible Avatars Programme on Polygon,\" he said.\n\n\"And, it has been a huge success with millions of people being onboarded through that to Polygon and to web3 in a matter of weeks.\n\nRead more: Crypto live prices\n\n\"Also, Starbucks (SBUX) is introducing a loyalty programme run on Polygon, and Instagram (META) has started to experiment with its creator economy and NFTs on Polygon.\n\n\"We are seeing very clear signs of mainstream adoption with a number of big popular games now deploying their game assets on Polygon.\n\n\"So, from in multiple industries, such as the fashion and automotive industry, with brands liuke Dolce & Gabbana and Mercedes (MBG.DE), we are seeing them delpoy on Polygon and exploring multiple use-cases of the technology.\"\n\nPolygon has committed $1bn (was £807.5m)and raised $450m to build zkEVM.\n\nOn Friday, Polygon's native cryptocurrency, matic, fell 2.7% to $1.08, according to data from Coinmarketcap.\n\nWatch: 'Dressing digitally' pins hope on blockchain to clean up fashion's carbon footprint | The Crypto Mile\n\nDownload the Yahoo Finance app, available for Apple and Android."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vaGFja2Vybm9vbi5jb20vaG93LXRvLXVzZS10aGUtbmV3LWluZnVyYS1zZXBvbGlhLWZhdWNldC1mb3ItZXRoZXJldW0tc21hcnQtY29udHJhY3QtdGVzdGluZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Mar 2023 07:00:00 GMT",
        "title": "How to Use the New Infura Sepolia Faucet for Ethereum Smart Contract Testing - hackernoon.com",
        "content": "3,790 reads\n\nHow to Use the New Infura Sepolia Faucet for Ethereum Smart Contract Testing"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3NvbGFuYS1vcHRpb25zLXByb3RvY29sLWNlZ2EtY29tZXMtdG8tZXRoZXJldW3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Solana Options Protocol Cega Comes to Ethereum - Blockworks",
        "content": "Exotic derivatives protocol Cega Finance will be launching on Ethereum mainnet, branching out from its native Solana.\n\nIn traditional finance, exotic options fill the same role, more or less, as regular options — enabling leveraged longs and shorts on an underlying asset, but they can be used to achieve specific investment goals that cannot be accomplished with American or European options.\n\nFor example, Barrier options have a payoff that depends on whether the underlying asset price reaches a certain barrier level during the life of the option, while Asian options’ payoff depends on the average price of the asset over a period of time.\n\n“Exotic options are a natural evolution in an economic market,” Arisa Toyosaki, Cega Finance co-founder, told Blockworks. “They are a conditional option on top of a vanilla option.”\n\nSeasoned investors can use exotic options to dial in risk preferences while trading a wider range of investment products.\n\nLeveraged options vaults\n\nCega also supports structured vault products pitched to enable yields during volatile market environments.\n\nThe protocol will be offering a leveraged options vault (LOV) strategy, expected to launch within the second quarter. This option will be offered on top of the products which are already available to those on the Solana blockchain.\n\nLOV is an options structured product that Toyosaki believes will resolve capital inefficiency in DeFi as it “does not require additional liquidity accessed through redemptions of user-funded margins or overcollateralization.”\n\nLOV’s Gotta Go Fast offering, for example, offers a 21% to 30% APY. The underlying assets will be BTC, ETH and SOL, and Cega says it will offer a 50% principal protection barrier.\n\nToyosaki notes that in order to take a leverage position in the existing market, the amount of capital that must be staked — but never put to work — is significant.\n\n“We created a method for our leverage options vaults that is extremely capital efficient and allows you to get a leveraged return by having a combination of options which can maximize your appetite for the market,” she said.\n\nLOV liquidations work like this, Blockworks Research analyst Ren Yu Kong explains:\n\nA user deposits crypto into a vault for a set time period of time — for example, 30 days; and\n\nif BTC, ETH, or SOL drop by over 50% across that period, then;\n\nthe 50% principal protection barrier has expired, requiring collateral to be taken.\n\n“From there, the vault takes the worst-performing asset. Say BTC decreased by 30%, ETH decreased by 45%, SOL decreased by 60%. Then the vault will return 40% (100-60) of your initial deposit,” Kong said.\n\nOn top of LOV, Cega is also launching a trading firm, Tras Mobian. The entity is designed to resolve one-sided demand issues in decentralized financial markets.\n\n“If you look at every DeFi option vault in the market, everyone is focused on selling options. There hasn’t been a lot of demand for users buying options,” Toyosaki said.\n\nThis is where Tras Mobian comes in. It will be focused on research and development in the space, according to Toyosaki, with the hopes of creating more demand for both sides of the market.\n\nTas Mobian will run independently of Cega, the company notes. A third-party custodian will manage its multisig and oversee its balance sheets and audits.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LndlYWx0aG1hbmFnZW1lbnQuY29tL3RlY2hub2xvZ3kvZXRoZXJldW0tcy1ncmFkdWFsLWFwcHJvYWNoLWVuZHVyaW5nLXZhbHVl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Mar 2023 07:00:00 GMT",
        "title": "Ethereum's Gradual Approach to Enduring Value - Wealth Management",
        "content": "Most economic progress can be attributed to technological advancements like the printing press, steam engines, computers and the internet. Blockchain technology—a profound network that can improve value transfer and human productivity—may be the next driver of business innovation and financial evolution. Ethereum—one of the most actively used blockchain networks with the second biggest cryptocurrency (ETH) by market cap and average daily volume—will undergo its first major update since The Merge in September 2022. The upcoming Shanghai upgrade will introduce highly anticipated improvements that could yield more investment flexibility.\n\nEthereum is an interesting blockchain for developers, users and investors. The network provides a foundation for developing innovative applications and services while ensuring high security, flexibility and scalability. It was one of the first mainstream blockchains to incorporate smart contracts, and as a host to dApps, it enabled DeFi, Web3 and decentralized autonomous organizations (DAOs). In addition, developers flocked to the chain because of efficient, secure hosting capabilities.\n\nEthereum’s large and active community is one of the most significant factors driving the development and adoption of blockchain technology. Ethereum boasts the most developers of all blockchains—over 2,000 weekly active developers—which is often a reliable proxy for the long-term success of a chain. It is a vibrant ecosystem of individuals and organizations working toward a common goal of building decentralized, open-source applications.\n\nAs network activity increased, it boosted the value of ETH, making it more lucrative to mine. This increased mining activity manifested as increased energy consumption, and as innovation continued in the space, it became clear there were more environmentally and economically efficient ways to secure the blockchain.\n\nThe Merge was the culmination of several years of work by the Ethereum development team to join the “original proof-of-work (PoW) execution layer of Ethereum with its new proof-of-stake (PoS) consensus layer.” The PoW system was Ethereum’s longstanding method of verifying transactions and generating new coins, but it was expensive and energy-intensive. Conversely, the PoS system is much more efficient, eliminating “the need for energy-intensive mining and instead [enabling] the network to be secured using staked ETH.” As a result, The Merge decreased Ethereum’s energy usage by 99.9%. PoS became its method of verifying transactions via staking—a process whereby users stake, or put tokens into a contract to qualify for validation privileges. Users could then earn rewards while helping to secure the network.\n\nEthereum as an Internet Bond\n\nCurrently, staking is more comparable to a one-way street. When users staked their ETH, their capital was locked up for an indeterminate period to earn yield. In doing so, they demonstrated their trust in Ethereum. The Shanghai upgrade is expected to be a game changer because it will enable users to access their staked ETH and rewards at any time. There are more than 16.9 million staked ETH (over $27.5 billion at current prices), representing about 14% of the total supply. The ability to withdraw these funds will provide more investment flexibility and ultimately improve liquidity.\n\nStaked ETH’s access to newfound liquidity reduces capital risk, making it more enticing for institutional investors. Further, staking resembles fixed financial instruments like bonds in capital markets. ETH, as a currency, needs to finance itself and pay for its security. Similar to how the U.S. government might issue a bond to pay for its military budget, Ethereum does so by issuing financial rewards to validators who secure the network. Staking in Ethereum provides a yield akin to the yield offered by bonds. The ability for institutional investors to participate in staking, earn yield and withdraw staked ETH has the potential to attract even more investors and drive growth in the cryptocurrency industry.\n\nEthereum's Continued Innovation\n\nEthereum's periodic upgrades represent steps toward the ecosystem’s vision of greater sustainability, security, and scalability—essential components for healthy growth. The future potential is vast for a network built and maintained on solid footing. Moreover, the network’s concerted effort to continuously improve functionality of its cornerstone features exhibits a powerful catalyst for innovation. Knowledgeable institutions are watching closely and planning accordingly.\n\nEthereum is now where the internet was in 1995, or the iPhone was in 2007—new technology with powerful capabilities and uncharted possibilities at the juncture of mainstream adoption. The Merge substantiated the blockchain’s foundational strength, scalability and sophistication, showing a broader view of a promising avenue to modernize aging financial infrastructure. The upcoming Shanghai upgrade represents another valuable development for the network and is likely to drive additional development, contribution and growth in the industry.\n\nPeter Hans is managing director of IR and business development at Arca."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMilQFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMDMzMTAwNTAxOC9lbi9DZWdhLWxhdW5jaGVzLW9uLUV0aGVyZXVtLWludHJvZHVjZXMtbmV3LWxldmVyYWdlZC1vcHRpb25zLXByb2R1Y3QtYW5kLWxhdW5jaGVzLXRyYWRpbmctZmlybdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Cega launches on Ethereum, introduces new leveraged options product, and launches trading firm - Business Wire",
        "content": "SINGAPORE--(BUSINESS WIRE)--Cega Finance, one of the leading derivatives protocols in DeFi, announced today that it has launched on Ethereum Mainnet. Cega is also thrilled to announce the launch of Leveraged Options Vaults (\"LOVs\"), a novel options strategy which represents innovation in DeFi primitives, as well as the launch of trading firm Tras Mobian.\n\nEthereum Mainnet Launch\n\nCega has launched on Ethereum Mainnet which brings its innovative, exotic options structured product vaults to the largest L1 blockchain.\n\nCega builds structured product vaults that allow investors to earn safer yields during volatile market environments while providing strong protection against severe market movements. Exotic options differ from vanilla options because they add customized, non-standard features that deliver unique payoffs for investors such as increased yield and principal protection. For example, investors can stake USDC in Cega to trade an exotic options strategy such as \" I will earn 12% APY if BTC or ETH do not decrease more than 50% in the next 27 days”.\n\nOn Ethereum Mainnet, Cega can be easily accessed by leading wallet service providers including Metamask, Coinbase Wallet, and WalletConnect which enables Fireblocks and Gnosis Safe users to stake with Cega.\n\nFor new users making their first deposit, staking can be done in three clicks. Users access Cega through its web application at https://app.cega.fi/. From there, users need to connect their Ethereum wallet, choose an options vault strategy, and deposit USDC. Cega offers a variety of vault options strategies that cater to different investment goals and risk appetites, with a range of crypto underlying assets (e.g. ETH, BTC, SOL, and AVAX).\n\nCega’s smart contracts on Ethereum Mainnet have been double audited to eliminate security attack vectors that could compromise user funds and to ensure code security. Cega audits were performed by Ottersec and Zellic, top security auditors in the space formed by former winners of global hacking competitions. In both audit analyses and reports, no critical vulnerabilities were identified and all code security recommendations were implemented to further strengthen the codebase.\n\nLeveraged Option Vaults\n\nCega is launching a novel leveraged options vault (“LOV”) strategy that delivers up to 5x higher yields ranging from 20% APY to 109% APY. This product development was driven by strong feedback from the community who frequently requested additional strategies to earn higher APY. LOVs are currently slated to launch within Q2.\n\nThe Cega team is committed to pushing the boundaries of DeFi innovation. The LOV is an elegant solution that enables leveraged yields without the need for additional collateralization. Instead, LOVs use an options structured product involving a put spread to create a new DeFi primitive. Unlike conventional leveraged products, the LOV does not require additional liquidity accessed through redemptions of user-funded margins or overcollateralization, which solves the issue of liquidity fragmentation and scalability of leveraged products.\n\nCega also remains committed to delivering real yields to users. This means that the LOV strategies’ yields are sourced from actual options premiums, not token emissions. Yields are paid in USDC and there is no impermanent loss risk for users.\n\nThe development of LOVs is already underway on Ethereum, and audits of the smart contract codebase are in progress. The following table indicates the types of LOV offerings and corresponding yields that users can expect:\n\nLOV Product Name APY\n\n(2x to 5x leverage range) Underlying\n\nAssets Principal\n\nProtection\n\nBarrier Gotta Go Fast 21.0% to 30% APY BTC, ETH, SOL 50% Insanic 25.4% to 47% APY ETH, SOL, AVAX 50% Supercharger 39.2% to 109% APY BTC, ETH 30% APY quoted as of 3/24/2023\n\nTras Mobian\n\nCega has also launched a trading firm, Tras Mobian. As Cega has grown rapidly to become a leading derivatives protocol in DeFi, there has been increasing demand for new features and product R&D. In the past, Cega has offloaded all positions to external market makers. However, the Cega team possesses one of the highest levels of knowledge and capabilities in exotic derivatives trading in the market, with a combined experience of 35+ years and having managed over $10 billion trading per year. Therefore, a small team at Cega has spun off to launch a market maker called Tras Mobian.\n\nTras Mobian has four trading mandates:\n\nProviding competitive Cega product liquidity alongside other market makers. Conducting research and development for new products and providing liquidity for other derivative protocols. Providing operational flexibility for Cega users, such as bespoke positions. Pursuing arbitrage opportunities in the market.\n\nIn order to focus on transparency, Tras Mobian acts independently to Cega and its auctions. Cega has also created risk management best practices including the verification of Tras Mobian’s balance sheet health by a third party, audits of all flow-of-funds via a custodian, and having a third party custodian as a multisig signer.\n\nWith Tras Mobian, Cega products will see a competitive market price without front running, as well as accrue additional value to future Cega token holders.\n\nFor those interested in learning more about Tras Mobian, please check out http://trasmobian.xyz\n\nFuture of Cega\n\nCega is thrilled to be at the forefront of building the future of DeFi by expanding the derivatives market through innovative products, and now trading. Cega is committed to pushing the boundaries of what is possible in the world of DeFi and to empower users to take control of their financial futures. Its mission is to be the #1 provider of DeFi derivatives and also to pioneer new ways to bring greater transparency, accessibility, and opportunities into DeFi. Cega encourages everyone to join its exciting journey to create a more inclusive and decentralized financial system.\n\nTwitter: http://twitter.com/cega_fi\n\nDiscord: http://discord.gg/cega"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vbWlsa3JvYWQuY29tL2RhaWx5L3QtMTMtZGF5cy1ldGhlcmV1bXMtYmlnLXVwZ3JhZGUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Mar 2023 07:00:00 GMT",
        "title": "🥛 T-13 days: Ethereum's big upgrade - Milk Road",
        "content": "GM. This is Milk Road, your Web3 multivitamin. Get your daily dose of crypto, NFTs, blockchain news, AND jokes in one 3-minute horse pill.\n\nHere’s what we’re serving up for you today:\n\nShanghai upgrade is coming on April 12 ⏱️\n\nTBT: Bitcoin’s first big rally 💪\n\nTrademark Thursday 📂\n\nSBF’s using his dad’s gift for legal fees 🍪\n\nPrices as of 9:00 AM ET\n\nToday’s edition is brought to you by Awaken, the perfect place to file your crypto taxes.\n\nSHANGHAI UPGRADE SET FOR APRIL 12 ⏱️\n\nIt’s official. Ethereum developers announced a date for the Shanghai upgrade: April 12th. That’s right ladies & gents, we’re t-13 days away from The Great Unstaking.\n\nSo what? People will finally be able to unstake their ETH for the first time since December 2020.\n\nSome people think it will lead to a huge sell-off, others think it’ll be just another day that ends in y.\n\nSo how big of a deal is it, really? Well to help answer it, we sent the Milk Man on a mission to find everything he could about the upcoming upgrade.\n\n100 hours later, he created this guide – it has EVERYTHING you need to know about the Shanghai upgrade.\n\nThe biggest takeaway? Only ~15% of all ETH is currently staked. Check it out.\n\nThe blue segment below represents staked ETH deposits that will be unlocked on April 12 (~14%). The yellow sliver represents staked rewards (~1%).\n\nMilk Road Take: We rank this a solid 3 on the Milk-Road-Worry-Meter. It’s our view that there is a:\n\nlower probability that the staked deposits (blue part) will be sold and a\n\nhigher possibility that the staked rewards (yellow sliver) will be sold\n\nCheck out the rest of the Guide to the Shanghai Upgrade here to make sure you’re ready for game day!\n\nTrust us, you’ll be the smartest person on the elevator today after reading it.\n\nMAKE CRYPTO TAXES EASY WITH AWAKEN\n\nAwaken\n\nEveryone knows there are two certainties in life: death and taxes. Then there’s death from taxes….\n\nFiling your taxes is hard, confusing, boring, and it takes forever. Plus it’s 10x worse if you’re a crypto investor.\n\nIntroducing Awaken – a new tax software built for Web3. Awaken supports NFTs, staking, bridging, etc., and gives you all the crypto reports you need to file your personal taxes.\n\nIt makes filing taxes a breeze so the IRS won’t rain on your crypto parade.\n\nAnd today, we’ve got a special offer for all Milk Roaders: you can claim $30+ of free credits by using code “milkroad”.\n\nBut wait, there’s more… if you already paid for a different crypto tax product, Awaken will fully match your payment (just email andrew@awaken.tax with proof.)\n\nThe choice is yours. 👇\n\nCYPRUS 10-YEAR ANNIVERSARY 💪\n\nIt’s that time of the week… Throwback Thursday. The day we reminisce on the simple times, when our biggest worry was staying on our friends’ Top 8 on Myspace.\n\nToday’s TBT: The Cyprus Banking Crisis and Bitcoin’s Big Rally. Gather ‘round kids, this one’s a doozy. Here’s the story in 3 parts:\n\nPART 1: THE CALM BEFORE THE STORM. First, let me set the scene for you:\n\n*old man voice*:… The year was 2013, on a small Mediterranean island called Cyprus…\n\nAt the time, the island was known for one thing: lax taxes. This made Cyprus a tax haven for rich (and sketchy) people, which raked in billions of dollars in bank deposits.\n\nAs a result, the banks on this tiny island got HUGE. They held 8x as many assets as the entire country’s GDP. The banks became like that short guy at the gym that bench presses 300 lbs – tiny but mighty.\n\nBut there was a massive storm brewing in Cyprus:\n\nThe economy was in a recession and still recovering from the ’08 financial crisis.\n\nBig banks lost A LOT of money. They lent billions to Greece (whose economy was also nosediving), and then tried placing a double-or-nothing bet by buying up Greek government bonds in hopes of a bailout. They took an L & lost everything.\n\nSuddenly Cyprus banks were in a lot of trouble. And because they controlled (and lost) more money than the entire country’s GDP, they went from too big to fail → too big to save.\n\nPART 2: THE SH*TSTORM\n\nPop quiz: What do you do when you’re broke and owe a lot of money? Call your rich uncle.\n\nWhich is exactly what Cyprus did. They called up their rich uncle (AKA the European Union) and asked for a $17B bailout.\n\nBut here’s the thing: sometimes your rich uncle wants to teach you a lesson. And the European Union wasn’t super happy about the price tag.\n\nSo they made a deal… The EU would give $10B, but Cyprus would have to come up with the rest on its own.\n\nHow? By taking money from its own depositors.\n\nIn March 2013, Cyprus announced its two biggest banks would shut down and all deposits over $100K would be seized, with a large portion being used for the bailout.\n\nIt sent shockwaves throughout the island. But wait, it gets crazier…\n\nIn order to stop a bank run, the Cyprus government declared a national bank holiday and closed all the banks so people couldn’t withdraw any money. (Note to self: if we ever want a new holiday, just threaten a massive bank run.)\n\nThen when the banks opened back up, the Cyprus government placed restrictions on how much money people could withdraw (sometimes as low as $128 per day).\n\nIt was a living nightmare for the Cypriots that included longer lines than a new iPhone release…\n\nSource: CEPR\n\nBut this was also a wake-up call for a lot of people. They could no longer fully trust the governments and big banks. They needed to find an alternative…\n\nPART 3: THE RISE OF BITCOIN\n\nToday, Bitcoin is the king of crypto. Companies own it. Hedge funds own it. Countries own it. Even my mom owns it.\n\nIn 2013, Bitcoin was still just “magic internet money”. It was mainly super nerds and sketchy drug dealers that owned it.\n\nUntil….the Cypriots got in on the action. With banks collapsing and people losing trust in the system, people looked to Bitcoin as an alternative asset for the first time ever.\n\nBTC Weekly Chart (Trading View)\n\nBTC jumped 600% and was followed by the famous Bullrun of 2013 and BTC ended the year at ~$750.\n\nTHE LESSONS: 10 years later there are still some big takeaways from the Cyprus Baking Seizures:\n\nBanks can always collapse. 10 years ago it was Cyprus Banks. Today it’s SVB, Credit Suisse, and Deutsche Bank.\n\nDon’t put all your eggs in one basket. We’ve seen time after time that trusting a single bank with all your money is a bad idea. Don’t do it. You gotta spread your bread around.\n\nDiversify your assets. Put some money in gold, Bitcoin, Pokemon cards, whatever you want – just make sure to always have a backup plan in case sh*t hits the fan.\n\nTRADEMARK THURSDAY 📂\n\nThe biggest brands have all been diving into the Web3 swimming pool recently.\n\nSome cannonball right in. Others like to make a bigger splash off the diving board.\n\nThis is kinda like filing a trademark – it gives everyone a heads up that a big splash is coming soon.\n\nWe rounded up all the companies making moves in the space. Here’s who’s diving in:\n\nGiphy\n\nAeropostale filed a trademark for NFT-authenticated media, virtual clothing/footwear, bags, and sports gear. No word yet on if low-rise jeans are included…\n\nWrigley filed to trademark NFTs, virtual & physical candy, and crypto-collectible sharing software. It wants to name its ecosystem “Juicyverse,” and honestly… we’re here for it\n\nWynn Resorts filed 6 trademarks with plans involving an NFT marketplace, virtual casinos/hotels, virtual stores, and more\n\nCartier filed trademarks for NFT-backed items like digital watches, jewelry, and more\n\nMajor Cricket League filed trademarks for NFT-tied fanny packs, backpacks, and more\n\n🥛 MILK & COOKIES 🍪\n\nSBF is paying his legal fees with the millions of dollars he gifted his dad in 2021, per Forbes. The monetary gift was funded by a loan from Alameda, where FTX customer deposits were allegedly being illegally funneled to.\n\nTraders have pulled $2.1B out of Binance in the last seven days. That’s above normal amounts, but still lower than the outflows we’ve seen after previous regulatory threats against the company.\n\nKraken just struck a deal with Formula 1 for the crypto exchange’s branding to appear on racing cars for the rest of the 2023 season. Comeback SZN for crypto sponsorships?\n\n3AC founders Kyle Davis and Su Zhu could be found in contempt if they don’t respond to a court summoning in the British Virgin Islands. They’re required to provide liquidators with documents related to the bankruptcy by April 14. Tick tock, y’all…\n\nMILKY MEMES 🤣\n\nThat’s a wrap for today. Meet us on Twitter to talk all about it. It’s kinda like a family BBQ but better – no screaming kids, awkward photos, or drunk uncles telling weird stories (@MilkRoadDaily)\n\nHIT THE INBOX OF 250K+ CRYPTO INVESTORS\n\nAdvertise with the Milk Road to get your brand in front of the Who’s Who of crypto. The Roadies are high-income crypto investors who are always looking for their next interesting product or tool. Get in touch today.\n\nROADIE REVIEW OF THE DAY\n\nVITALIK PIC OF THE DAY\n\ngm 🤝 https://t.co/QlLYTOHzmL — Milk Road (@MilkRoadDaily)\n\nMar 30, 2023\n\nDISCLAIMER: None of this is financial advice. This newsletter is strictly educational and is not investment advice or a solicitation to buy or sell any assets or to make any financial decisions. Please be careful and do your own research."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzAzLzMxL2V0aGVyZXVtLXJpdmFsLWNhcmRhbm8tc2V0LXRvLXBsdW5nZS03MC1hZ2FpbnN0LWJpdGNvaW4tc2F5cy1hbmFseXN0LWhlcmVzLXRoZS10aW1lbGluZS_SAX1odHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMy8zMS9ldGhlcmV1bS1yaXZhbC1jYXJkYW5vLXNldC10by1wbHVuZ2UtNzAtYWdhaW5zdC1iaXRjb2luLXNheXMtYW5hbHlzdC1oZXJlcy10aGUtdGltZWxpbmUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Ethereum Rival Cardano Set To Plunge 70% Against Bitcoin, Says Analyst – Here’s the Timeline - The Daily Hodl",
        "content": "Cryptocurrency analyst Benjamin is warning that Cardano (ADA) and other altcoins are primed for losses when paired against Bitcoin (BTC).\n\nCowen tells his 738,700 Twitter followers that against Bitcoin, Cardano could bottom out at 0.00000400 BTC, or $0.11, a drop of 69.8% from current levels.\n\n“I think ADA/BTC would be lucky to bottom at 0.00000800 BTC, but 0.00000400 BTC could be final support (though it could represent a higher US dollar valuation at 0.00000400 BTC than at 0.00000800 BTC).”\n\nIn a chart depicting the likely trajectory of Cardano when paired against Bitcoin, Cowen seems to suggest that the seventh-largest crypto asset by market cap could hit the final support level in the third quarter of 2023.\n\n“ADA/BTC”\n\nCardano is trading at 0.00001326 BTC, or $0.37, at time of writing.\n\nCiting his own experience, Cowen says that seemingly small gradual losses as altcoins depreciate against Bitcoin tend to balloon over time.\n\n“A common response to my posts about altcoins bleeding back to BTC is ‘Hey, it’s only -2%!’\n\nBut it goes on and on.\n\nI have lived this before. Before you know it, your altcoin is down 90-95% against BTC and you thought it was ‘holding up well’ the entire way down.”\n\nGiving the example of Chainlink’s (LINK) performance against BTC from 2018 to 2022, the popular analyst says that an altcoin that shows bullish price action against Bitcoin during a bear market is likely to perform well when altcoins start rallying.\n\n“Yes, for instance, LINK/BTC showed relative strength in 2018, and then did very well in 2019/2020.\n\nSo if you notice certain altcoins putting in higher lows on their BTC pairs (which most won’t be), then that could be a good sign for that altcoin during the next altcoin season.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3Lmpkc3VwcmEuY29tL2xlZ2FsbmV3cy9wYXJ0LWlpLXdoZW4teW91LWp1bXAtY2hhaW5zLWRvLW5mdHMtOTgzNTA0MS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Part II: When You Jump Chains, Do NFTs Stay the Same? Ordinals on the Bitcoin Blockchain - JD Supra",
        "content": "As discussed in Part I of this series, Ordinals are a pioneering new method of utilizing the Bitcoin blockchain that will usher in new and innovative use cases on Bitcoin. As promised, in Part II we will discuss the implications for creators and owners.\n\nImplications of Ordinal NFTs for Creators and Owners\n\nAs with most crypto innovation, capable users quickly flocked to the shiny new object. Copies of popular Ethereum NFT projects began appearing on the Bitcoin blockchain after the Ordinals launch. For example, a clone of CryptoPunks, named Ordinal Punks, popped up and is reportedly gaining traction. Further, the owner of Bored Ape Yacht Club (“BAYC”) #1626 permanently removed the NFT from its spot as one of the most valuable in the space by “burning” it, then inscribing the NFT on Bitcoin using Ordinals. While the owner of BAYC #1626 effectively deleted – or symbolically transferred – the NFT, it appears that some NFT creators are not purists and are willing to experiment on Bitcoin. For example, Yuga Labs, the creator behind the Bored Ape Yacht Club Ethereum-based NFT phenomenon, announced that it would release a NFT project called TwelveFold on the Bitcoin blockchain.\n\nIn our December article we asked: what do hard forks mean for my NFTs? In this article we ask a similar question: how does a copy of an NFT on completely different chain (Bitcoin, not Ethereum), affect value and licenses?\n\nA number of questions arise. Does the holder of the copycat Ordinal on Bitcoin require a license corresponding to the Ethereum NFT? What happens to the Ethereum NFT purchaser’s rights granted to it under the license, which may or may not include a commercial right to exploit and sublicense? Does an Ordinal inscription of an Ethereum NFT fall under a purchaser’s general non-commercial use and public display rights that are generally given to purchasers on NFT marketplaces? Does the original Ethereum NFT holder hold one set of rights and the holder of the copycat on Ordinals possess any rights that may be in conflict with the original NFT holder’s? Generally speaking, would the value of the NFT be affected if two identical copies exist on two different blockchains? Does the NFT owner or project have a say in which blockchain to recognize? Has any IP infringement occurred?\n\nThese rights are not insignificant, as the holder, depending on the license grant, is typically permitted to display or otherwise use the NFT in a non-commercial manner, and, in some cases, may even be able to commercially exploit, or grant a person(s) the right to commercially exploit, the NFT. Understanding what bundle of rights, and whether others share that bundle, is helpful to valuing the NFT and its underlying IP, as well as brand building.\n\nAs with everything in the constantly-evolving cryptosphere, there will be variability in how licensing agreements these issues. Certain licensing agreements may offer clues for how this issue may be handled. For instance, the terms of one NFT marketplace, Rarible’s Standard Collectibles Sale and License Agreement (the “Raribles Agreement”), indicates that it only recognizes NFTs on Ethereum:\n\n“ Collectible ” means the combination of: (A) an Ethereum-based NFT having a Uniform Resource Identifier (“URI”) identifying an appropriately configured JSON file conforming to the ERC-721 Metadata JSON Schema, ERC-1155 Metadata URI JSON Schema or a similar JSON schema, as applicable (such JSON file, the ” Collectible ID”); and (B) the Collectible Metadata specified by such Collectible ID.”\n\n[While the Rarible’s Agreement only recognizes Ethereum-based NFTs, the Agreement does recognize NFTs on each chain after a hard fork]:\n\n“ Collector ” of a Collectible means at each time, the person who lawfully holds exclusive title to and ownership of the NFT included in such Collectible, for so long as such person continues to hold such title to and ownership of such NFT. All references to “Collector” include the Collector’s lawful permitted successors and assigns. In the event of an Ethereum Persistent Fork creating copies of the Collectibles at the same addresses at which they were then held on Ethereum, the scope of the term “Collector,” and all licenses granted to and other rights of a Collector under these Terms, shall be deemed expanded to include each person who lawfully holds exclusive title to and ownership of the copies of such NFTs that are included on the Ethereum Persistent Fork. The parties acknowledge and agree that, as a result of the preceding sentence, in an Ethereum Persistent Fork, the aggregate number of the Collectibles may be increased, which could have an adverse effect on the value of each Collectible or the aggregate value of the total Collectibles.\n\nThis raises a second question, what would be the effect be if the Rarible’s Agreement (or any other similar terms of service on an NFT marketplace) was modified to permit an increase in the aggregate number of collectibles as a result of a new enablement on a new protocol, similar to how Rarible’s treats a hard fork?\n\nLike Rarible’s, Yuga Labs, a Web3 developer of NFTs – including CryptoPunks and BAYCs – provides a warranty disclaimer that each CryptoPunk NFT exists only by virtue of the ownership record on the Ethereum Blockchain:\n\nEACH CRYPTOPUNK NFT IS AN INTANGIBLE DIGITAL ASSET THAT EXISTS ONLY BY VIRTUE OF THE OWNERSHIP RECORD MAINTAINED ON THE ETHEREUM BLOCKCHAIN. ANY TRANSFER OF OWNERSHIP THAT MIGHT OCCUR IN ANY UNIQUE DIGITAL ASSET OCCURS ON THE DECENTRALIZED LEDGER WITHIN THE ETHEREUM BLOCKCHAIN, WHICH YUGA LABS DOES NOT CONTROL.\n\nBAYCs includes a similar provision in the Ownership section. As such, under these terms, Yuga Labs has de facto designated Ethereum as its blockchain of choice. However, whereas Rarible’s licensing agreement may result in doubling the amount of “Collectibles” in the event of a fork, Yuga Labs, a Web3 developer of NFTs, reserves the right to designate which fork is valid for their notable Cryptopunks:\n\nThe License applies only to the CryptoPunk NFT on the blockchain that Yuga, in its sole discretion, may designate, which designation shall apply retroactively. Thus, for example, if a fork or other event purports to result in duplicate CryptoPunk NFTs, only the non-fungible token recorded on the blockchain designated by Yuga Labs will be eligible to receive the benefit of the License. Any license purportedly granted hereunder to the owner of a non-fungible token recorded on a blockchain not designated by YugaLabs is void ab initio.\n\nThus, in addition to stating that CryptoPunks exist by virtue of the digital asset record on Ethereum, Yuga labs may designate the blockchain where CryptoPunks exist. In terms of forking, Yuga Labs’ approach is similar to venture capital firm a16z’s approach, which provided five template NFT licenses, each providing for the industry-recognized chain post-fork, merge or duplication.\n\nTransfer and Sublicensing . The licenses granted in these Terms are non-transferrable, except that if you lawfully transfer ownership of your Project NFT, the license to the NFT Media in Section 1.1 to you shall terminate upon the effective date of such transfer, and such licenses will be assigned to the new owner of the Project NFT associated with such NFT Media. As a condition to sales, transfers or similar transactions of the Project NFTs, the transferee agrees upon the acquisition of the Project NFT that (a) the transferee is not a Restricted Party and (b) the transferee accepts these Terms. Further, if you choose to sublicense any of your licensed rights set forth in Section 1.1 above, you are only permitted to do so if any such sublicensees agree (i) that they are not Restricted Parties, (ii) to the same covenant not to assert as set forth in the second to last sentence of Section 1.2, and (iii) that if your licensed rights in Section 1.1 are transferred (such as because you sell your Project NFT), then any such sublicenses you have granted in such licensed rights will automatically terminate. Because virtually all public blockchains are licensed under open source licenses, it is possible that the blockchain may fork, merge, or duplicate the original blockchain that initially recorded ownership of your Project NFT. In such case, any rights granted under these Terms to owners of any Project NFT will only be granted to the lawful owners of such Project NFT whose ownership is recorded on the mainnet version of the blockchain that is generally recognized and predominantly supported in the blockchain industry as the legitimate successor of the original blockchain (as determined in our sole discretion).\n\nHowever, under this version of the a16z NFT license, a16z does not specify that the only valid ownership ledger is on Ethereum, so arguably the licensing agreement may be used with respect to an Ordinal inscribed on the Bitcoin blockchain. Further, Bitcoin is neither a fork from, a merge into, nor a duplication of Ethereum, and the license is silent on NFT copies; however, the clear emphasis is that IP licenses will only be granted to the lawful owners of a project on a “blockchain that is generally recognized and predominantly supported as the legitimate successor of the original blockchain” as determined in the sole discretion of the Creator. It is an open question whether this language would give holders comfort if the argument could be made that their licenses are protected against copycats on a completely separate chain, like Bitcoin.\n\nAlternatively, as a creator may reserve the right to upgrade the NFT’s smart contract in the case of a fork, reserve the right to declare future restrictions on the NFTs use, or stay silent altogether, a creator may also decide to jump entirely to a separate chain. In the absence of a licensing agreement or specific guidelines, Archer v. Coinbase, Inc., 53 Cal. App. 5th 266 (2020), provides some clarity as to how new chains may be handled. In Archer, a user claimed that a cryptocurrency exchange was required to provide him access to all forked versions of the Bitcoin in his exchange account. The California state court disagreed, reasoning that the exchange’s user agreement did not obligate the exchange to support all forks. The court also found that Coinbase’s refusal to support a new form of forked cryptocurrency was not action amounting to conversion as Coinbase did not host the forked cryptocurrency in the first instance, and thus could not have deprived the plaintiff of a property right or exercised dominion over the forked cryptocurrency. Consequently, digital asset trading platforms (token, NFT, or otherwise) tend to expressly reserve the ability to determine which forks they support or otherwise reserve the broad right to place future restrictions on transactions.\n\nIt remains to be seen whether Bitcoin will become a widely popular chain for NFT enthusiastic and projects. In any event, the revolutionary capabilities enabled by Ordinals bring up novel questions surrounding NFTs and licensing agreements, so NFT issuers and marketplaces should consider what effect Ordinals might have on their business models and also reexamine relevant terms as needed to take into account any future NFT-enabled blockchains.\n\n[View source.]"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tc2V0LWZvci1hLW5ldy1yYWxseS1oZXJlcy13aHkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction - set for a new rally - here's why! - Analytics Insight",
        "content": "Never a dull day in the crypto market that’s for sure! 2023 has been a year of mostly growth and positivity which was badly needed after last year but as usual, we have to be ready for the bumps in the road when they come. Unfortunately, it looks like we could be due one in the near future as the SEC has set its targets on Coinbase which will face legal action which could have a big effect on the market.\n\nBinance is another exchange that could be in hot water as the Commodity Futures Trading Commission (CFTC) is charging them with a laundry list of alleged misdeeds, although after the FTX scandal, I think a lot of us could have predicted this.\n\nThe great thing about crypto investment, however, is that in times of difficulty, opportunity tends to flower. While weaker cryptos will struggle and fail, stronger projects will pump as investors turn to coins they know will survive the difficult spell. Coins with a strong history like Ethereum (ETH) are always good options but so are promising presale tokens like Love Hate Inu (LHINU), DeeLance (DLANCE), Metropoly (METRO), Ecoterra (ECOTERRA), and RobotEra (TARO).\n\nLet’s take a look at why traditional giant Ethereum is still a good investment option even if new regulations are brought in to tighten the market.\n\nEthereum price prediction\n\nAs we can see from the chart above Ethereum enjoyed a very successful Q1 of 2023, but what can we expect for Q2? Well as we mentioned above the CFTC could be about to crack down on some exchanges, which means it could be bad news for cryptos listed on said exchanges. It is therefore very good news that the head of the CFTC has stated that they consider Ethereum as a commodity, what this means in crypto terms is that ETH should be spared any restrictions that may be applied to other coins.\n\nMore positive news for the near future is the Shanghai update that is coming on April 12th. This has been a long time coming and Ethereum users will be very excited to learn it is less than two weeks away. Until now the coin holders could not remove their staked ETH from the ecosystem, well now they will be able to withdraw it along with all the rewards they may have occurred.\n\nSome have worried this could lead to a mass exodus as investors could remove all their investments but this is highly unlikely for two reasons. One, this isn’t some token with very little utility, it is the second biggest crypto on the market that has proved itself as a valuable asset. The second reason is Ethereum has set a daily withdrawal limit so even if investors wanted to remove everything this could not be possible.\n\nSo Ethereum looks like it is set for more growth in Q2 but what about the five coins going through presale we mentioned in the opening? Let’s take a look at them now.\n\nLove Hate Inu- Experts think this will be the hottest-selling meme coin of 2023\n\nWhile it is a meme coin Love Hate Inu (LHINU) is also much more than that, it is also a V2E platform where its users can go to vote on the trendiest and most pressing topics in the world of politics, social issues, and pop culture. What’s especially fun is either side of the vote will be represented by fun angel and devil illustrations representing love and hate.\n\nThe inventors of Love Hate Inu have gone to great lengths to ensure the project is both safe and secure. 90% of the total allocation of coins will be sold during presale which ensures the long-term future of the project and a stake-to-vote system will ensure the polls on their site can not be rigged or spammed in any way.\n\nDeeLance- The crypto that will fix the freelance industry\n\nThe amount of people working as a freelancer in their chosen sector of work has exploded since the pandemic. However traditional websites cause a lot of issues for both the freelancers and employers. With their decentralized platform DeeLance (DLANCE) will solve these issues.\n\nThe main selling point of the platform is how it will fix payment issues, its peer-to-peer payment system means its fees will be much smaller than traditional freelance sites and the blockchain will also allow much faster payment times. DeeLance will use escrow when it comes to payment which means employees need not worry about chasing an employer as the payment will be there for them once they finish their work.\n\nMetropoly- The markets first dedicated real estate token\n\nUntil now no crypto has been solely dedicated to real estate investment and that is likely because no one had as good an idea as Metropoly (METRO). They will bring real estate investment to the masses as for as little as $100 buyers will be able to own their part of some of the most sought after properties from around the world.\n\nHow it works is the properties will be tokenized into NFTs and then from there these will be fractioned and sold off to Metropoly customers, no added paperwork or delays simply choose your property and pay the price. New property owners will be able to earn a passive income just as if they owned the physical location through rent and appreciation.\n\n>>> Buy Metropoly Now<<<\n\nEcoterra- Earn crypto as you save the planet\n\nDespite only just beginning the presale of Ecoterra (ECOTERRA) has already generated a lot of buzz, this is likely because of its rewards for real life recycling. Through their app its users will be rewarded with the native token when they recycle. Simply scan the item you are recycling and watch the ECOTERRA pile up.\n\nEcoterra really has helping the environment as their main priority as the native token can be spent on green activities like cleaning up beaches.\n\n>>>Buy ECOTERRA Now<<<\n\nRobotEra- One of the most exciting P2E games of 2023\n\nRobotEra (TARO) looks like it could be one the most fun P2E games of 2023. The game is set in the Metaverse on the destroyed planet of Taro (also the native currency) which the players are tasked with rebuilding. No coding knowledge is necessary which is great because construction and ingenuity is where players will make their revenue.\n\nPlayers can explore and spend TARO just like they would in a second life game so building amenities or other attractive locations will draw in other players who will pay to enjoy the experience being offered.\n\n>>>Buy RobotEra Now<<<\n\nConclusion\n\nEthereum looks like it is still a safe option even if further regulations are introduced in the coming weeks or months. However the five coins going through presale are likely to pump even more and should give buyers more bang for their buck.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzAzLzMxL2Z1dHVyZS1vZi1maW5hbmNlLWV5cy1icm9keS1vbi13aHktdGVjaC1oaXN0b3J5LXNob3dzLXRoZXJlLWNhbi1iZS1vbmx5LW9uZS13aW5uaW5nLWJsb2NrY2hhaW4v0gGJAWh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDMvMzEvZnV0dXJlLW9mLWZpbmFuY2UtZXlzLWJyb2R5LW9uLXdoeS10ZWNoLWhpc3Rvcnktc2hvd3MtdGhlcmUtY2FuLWJlLW9ubHktb25lLXdpbm5pbmctYmxvY2tjaGFpbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Future of Finance: EY’s Brody on why tech history shows ‘there can be only one winning blockchain’ - Fortune",
        "content": "Welcome to Future of Finance, where Fortune asks prominent people at major companies about their jobs, how their firm fits into the crypto ecosystem, and what this all means for how we use money.\n\nThe following is from a recent conversation with Paul Brody, the global blockchain leader at EY and author of the upcoming Ethereum for Business: A plain-English guide to doing business on the world’s largest blockchain.\n\nBrody is a member of the Enterprise Ethereum Alliance, a CoinDesk contributor, and has done stints at IBM and McKinsey. He also has a soft spot for Swedish Fish.\n\n(This interview has been edited for length and clarity.)\n\nSo you’re writing an Ethereum book?\n\nI’m getting there. I started in December. I wrote like 10 chapters, and it was really, really tough. And now, there’s, like, six chapters left? The format of the book is how Ethereum works and why—why public blockchains are so important for business—specifically why they’re more important than private blockchains—business use cases, procurement, supply chain management, tokenization, carbon footprint, and why it takes so long for enterprises to adopt technology.\n\nWhen you were at IBM you did some Internet of Things stuff, and some other projects that were cutting edge. Is this sort of a pattern for you, where you want to do the “cool new thing”? Is that just what’s most appealing to you?\n\nThe thing is, I am very driven by intellectual curiosity. I don’t necessarily go after every single new thing, but when I find a thing that’s really, really important, I go after it. When I was in college—I’m dating myself here—I was like, “Wireless! Wireless is the thing!” I went to work as a summer job at the first mobile network operator in Africa, in Nigeria, and I took an entire year off to work for them before I came back and went to work at McKinsey, where I can remember just telling colleagues, “Mobile data, you’ve got to invest in mobile data.”\n\nThe best perk of being a VP at IBM was you had access to IBM research. And I had a couple of amazing products, and before I did the one that got me into crypto, I did another one, which was immensely fun, around 3D printing. A lot of people do these corporate white papers—they just do a survey, they present it like it’s subjective data that nine out of 10 executives think that not burning down the planet is a good idea—they present it as if it’s factual data, and it’s not really. What I love to do is get a couple layers below that, and what’s really fun is, for instance, we’d ask, “Okay, 3D printing will transform manufacturing, but how will it transform manufacturing?”\n\nWhat happened with that—the 3D printing?\n\nWe picked three products—a smartphone, an electric razor, and a washing machine—and we tore them down, literally one piece at a time, evaluated every single component, scanned them in 3D, and then tried to remanufacture as much of the product as possible using a 3D printer. And that was amazing. We came back with specific data on the carbon footprint of 3D printing, the cycle time with 3D printing, we built the economic model of what your manufacturing scales—it’s quite transformational. And the next project I did after that was IoT.\n\nHow did that lead you to Ethereum?\n\nSo I’m out at Samsung, talking to the head of the multimedia solution center, and he’s like, “Paul, we are going to go broke, the cloud is going to bankrupt us…you’ve got to come up with a better plan.” I thought to myself, this is really bizarre. Imagine a really smart light bulb with the brains of an iPhone, and it’s connected to WiFi. What is your iPhone processor doing? Like nothing, 99% of the time! So why on earth are we paying all this money to maintain massive cloud data centers, when your refrigerator could be providing cloud services, or your phone? So I called a bunch of guys and was like, “We should be able to make a cloud of computing devices that manage themselves, right?” The cloud should be in the devices.\n\nHalfway through this project, colleagues were like, “I want you to think about using this thing called Bitcoin, because it’s distributed computing. And we’ve had lots of debates—on the one hand, it’s very computationally intensive, but then on the other hand, it’s not like these machines are doing anything else. So John Cohn, an IBM distinguished engineer, comes and says, “Paul, I’ve met this guy, I think you’d really like him. His name is Vitalik [Buterin]. And he wants to do Bitcoin, but instead of for money, for computing. So we built this thing called ADEPT–Autonomous Decentralized Peer-to-Peer Telemetry, sort of this decentralized cloud infrastructure—for Samsung, with help from Vitalik. And we showed it at CES in January 2015. That’s how I got into Ethereum. That’s how I got into blockchain. And at that point, I was like, this is going to be absolutely revolutionary.\n\nWhat important lessons or ideas from other projects or jobs have you applied to ones on the blockchain?\n\nWe’re heading toward this world where the marginal cost of almost everything is zero. One of the most brilliant things that I heard when I worked at McKinsey was if you want to think about the future, try to imagine some important process or input is free. Just imagine, like, what if electricity was free? What if airfare was free? What if phone calls were free? Like 25 or 30 years ago, this idea that phone calls would be free, it was ridiculous. And yet, we sort of forget. One of the reasons we liked Ethereum was it comes with account payments and smart contracts. And we used to joke that we don’t know what anybody will actually pay for in the Internet of Things, but, eventually, someone will figure out how to monetize it. And when they do, they’ll be so glad this architecture has payments and contracts built in.\n\nHas embracing the blockchain helped EY from a competitive standpoint?\n\nIn the world of audit, we only have three competitors. So my “fair share” of any sort of global audit market is 25%, but it’s actually been better than that because I don’t think any of our peers have taken this space quite as seriously as we have.\n\nSo where is this leading? Can you tell me more about plans for the blockchain?\n\nA lot of tech systems are natural monopolies. That’s just how they are in a world where the marginal cost is zero for products. And then with Metcalfe’s law—the value of a network grows along with the number of participants—at a certain inflection point, your network becomes so valuable you’re effectively a natural monopoly. And that’s hugely shaped our strategy here because it led me down the path to believe there can be only one winning blockchain. There can’t be 50, can’t be 100, and it almost certainly will be a public blockchain. All paths lead to a dominant chain. And when you look at the history of computing platforms, that dominant chain usually becomes clearly visible within a decade of an ecosystem starting.\n\nAnd Ethereum’s that winner?\n\nEthereum was really the only programmable smart contract chain out there that was really dominant. So I said, “Okay, we’re making a play.” It’s a theory, a bit of the GE mentality where if I have a limited budget, am I going to spread it around, am I going to be okay with a bunch of different blockchains? Or am I going with the best?\n\nWhat prevents the rest of the Big Four from just copying what you’re doing at some point?\n\nObviously, in a decentralized system, you can’t do that. And that’s really tough. I’ve long accepted that. Even if we win this race, there will be no moment where we can just put our feet up and say, “Well, we’re a monopolist now. Great.” We will have to keep running hard.\n\nWhen clients come to EY, is it more often, “Oh, hey, by the way, we hear you have this blockchain guy”? or do they walk in like, “We’re here because of the blockchain guy”?\n\nIt comes in both forms. All the time, I’ll sit down with clients, and they’ll come over, like, “We had no idea you guys knew how to do this stuff.” And that’s great. I love that. And it makes me very happy. And, absolutely, you know, our senior people, it’s great when somebody writes to the chairman and says, “I just had this guy, Paul Brody, come in and talk to my clients—totally blew their minds. Like now they think of UI differently.”\n\nSo what’s next—both on your end, and more generally when it comes to the future of finance?\n\nIf you were to boil down all of our aspirations into a single sentence, it would be this: We believe that blockchain will do for networks and enterprises what ERP did for organizations. It was transformational. Before ERP, the left hand and the right hand didn’t really know what was going on.\n\nWith smart contracts on the public blockchain, I can create tokens that represent all the assets, that connect the buyers and the sellers—and that automatically enforce the processes. Like if you have a volume discount rule, when you achieve your targeted volumes, it automatically gives you a discount. This sounds like a small thing, but, actually, it just happens. No one has to remember. And think about an insurance contract, like in health care, and how after your deductible expires you’ll be referred to specialists, and then the logic just gets more complicated, more challenging. So my goal is to get to the point where we can take any arbitrarily complex business agreement and run it on the public blockchain."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9sYXllci0yLXByb2plY3QtZXhlYy16b29tcy1pbi1vbi10aGUtY2FwYWJpbGl0aWVzLW9mLWV0aGVyZXVtLXNjYWxpbmctc29sdXRpb25z0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Mar 2023 07:00:00 GMT",
        "title": "Layer-2 project exec zooms in on the capabilities of Ethereum scaling solutions - Cointelegraph",
        "content": "In episode 13 of Cointelegraph’s Hashing It Out podcast, Elisha Owusu Akyaw sits down with Metis co-founder Elena Sinelnikova. Metis is an Optimistic Rollup built on Ethereum to explore the world of layer-2 blockchain technology, and its potential impact on decentralization, scalability and real-world applications. Sinelnikova shares her unique insights and experiences in the rapidly evolving blockchain space, and gives us a glimpse into the future of decentralized autonomous organizations (DAOs) powered by Metis.\n\nThe conversation begins with Sinelnikova providing a comprehensive introduction to Metis, its mission and the challenges it aims to address in the current blockchain landscape. Next, she dives deep into the limitations of Ethereum’s layer 1, highlighting issues such as high gas fees, congestion and slow transaction times. Sinelnikova explains how Metis leverages layer 2 technology to overcome these hurdles — enabling faster, more efficient, and cost-effective transactions for users and developers.\n\nMetis is built on top of the Optimism codebase. Sinelnikova explains that even though the Metis team believes Optimism is on the right path, the team needed to make some changes to the code to create a more efficient platform for the Web3 economy.\n\n“You see, Metis fees are way lower than Optimism fees. We needed these lower fees for the enterprise level — so the enterprise level apps can use Metis easier more than Optimism.“\n\nNext, Akyaw and Sinelnikova discuss the importance of decentralization in the blockchain ecosystem. Metis intends to use its unique approach to building and supporting decentralized autonomous organizations (DAOs) to shape the future of work and collaboration. What’s more, Sinelnikova emphasizes the role of Metis in empowering individuals and businesses to create, manage, and scale their DAOs, thereby fostering a more inclusive and transparent decentralized economy.\n\nRelated: Africa: The next hub for Bitcoin, crypto adoption and venture capital?\n\nThis episode also explores the topic of adoption and education. Sinelnikova believes that the most important thing is not getting new users into crypto but protecting users who have already ventured into crypto through extensive education.\n\nFinally, Sinelnikova discusses the future of Metis and layer 2 blockchain technology, outlining the vision for the platform’s ongoing development and growth.\n\nListen to the latest episode of Hashing It Out with Elena Sinelnikova on Spotify, Apple Podcasts, Google Podcasts, or TuneIn. You can also check out Cointelegraph’s full catalog of informative podcasts on the Cointelegraph Podcasts page."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jYXJkYW5vLXVzZXJzLXNvb24tYWNjZXNzLWV0aGVyZXVtLTA2MjM0OTIxNC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Cardano Users Can Soon Access Ethereum Dapps Directly From ADA Wallets - Yahoo Finance",
        "content": "Join the most important conversation in crypto and web3! Secure your seat today\n\nThose who use the Cardano blockchain will soon be able to gain access to Ethereum Virtual Machine smart contracts with any cardano (ADA) wallet, expanding Cardano's usefulness.\n\nThat is thanks to an upcoming feature on Milkomeda, a network that connects blockchains such as Cardano and Algorand to EVM contracts.\n\n“Milkomeda (Cardano’s EVM layer) is launching a feature allowing EVERY Cardano user to use EVM contracts directly from ANY Cardano wallet,” Sebastien Guillemot, CEO of Milkomeda, said late Thursday.\n\n“Milkomeda is soon enabling staking rewards for all EVM users, including smart contract developers,” Guillemot stated, adding that staking rewards from Cardano products built on Milkomeda will be paid “automatically every five days.”\n\nAn Ethereum Virtual Machine is where all Ethereum accounts and smart contracts live, serving as a virtual computer used by developers to create decentralized applications, or dapps.\n\nWhen deployed on other blockchains, EVMs can allow developers to build dapps and decentralized-finance applications similar to the way they would on the Ethereum blockchain.\n\nThe new feature will allow Ethereum application developers to build on Cardano’s network using Solidity – the computer language used to code Ethereum – without the need to install new toolkits or learn a new computer language.\n\nSuch applications can then be used solely with Cardano tokens instead of ether (ETH), the native token of the Ethereum network, increasing the tokens' utility for holders."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMy8zMC9jcnlwdG8td2hhbGVzLW1vdmUtb3Zlci02MDAwMDAwMDAtaW4tYml0Y29pbi1ldGhlcmV1bS14cnAtYW5kLXRoZS1zYW5kYm94LWhlcmVzLXdoZXJlLWl0cy1nb2luZy_SAYUBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDMvMzAvY3J5cHRvLXdoYWxlcy1tb3ZlLW92ZXItNjAwMDAwMDAwLWluLWJpdGNvaW4tZXRoZXJldW0teHJwLWFuZC10aGUtc2FuZGJveC1oZXJlcy13aGVyZS1pdHMtZ29pbmcvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Mar 2023 07:00:00 GMT",
        "title": "Crypto Whales Move Over $600,000,000 in Bitcoin, Ethereum, XRP and The Sandbox – Here’s Where It’s Going - The Daily Hodl",
        "content": "Crypto whales moved more than $600 million worth of Bitcoin (BTC), Ethereum (ETH), XRP and The Sandbox (SAND) in a two-day period this week as crypto markets traded sideways.\n\nThe largest transaction involved one unknown wallet sending 409,350,982 SAND worth more than $247.3 million to another unknown wallet, according to the blockchain tracker Whale Alert.\n\nThe Sandbox is a metaverse gaming project with decentralized governance.\n\nExplains the crypto analytics firm Santiment,\n\n“A known The Sandbox whale emptied out its entire 409 million SAND ($250 million in total) and moved to a new address today. This was the most coins moved since the asset’s first week of existence in August 2020. Today’s $261 million moved is the most moved in 7 months.”\n\nOther large transactions tracked by Whale Alert include an unknown wallet transferring 72,591 ETH worth more than $125.5 million to another unknown wallet.\n\nAdditionally, a separate unknown whale sent 5,200 Bitcoin worth more than 140.7 million to a different unknown address, and the crypto exchange Binance transferred 972 BTC worth more than $26.3 million to the crypto exchange Coinbase.\n\nXRP whales and exchanges moved the crypto asset in a flurry of smaller transactions, including:\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24td2hhdC10by1leHBlY3QtZnJvbS1ldGgtYXMtdGhlLXNoYW5naGFpLXVwZ3JhZGUtbmVhcnMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction: What To Expect From ETH As The Shanghai Upgrade Nears - Analytics Insight",
        "content": "Ethereum price is at an inflection point as it trades above $1,700 with no clear directional bias. Apart from the market FUD emanating from increasing regulatory crackdowns and a global banking crisis, investors are treading cautiously as they want to see the direction Ether will take once the Shanghai upgrade goes live in the next two weeks.\n\nThe Ethereum Shanghai Upgrade To Go Live On April 12\n\nThe long-awaited Ethereum Shanghai upgrade, which will enable the withdrawal of staked Ether, is slated for April 12, 2023. The Ethereum devs team announced the launch date through a March 28 tweet saying, “Shapella is scheduled on mainnet for epoch 194048, scheduled for 22:27:35 UTC on Apr. 12, 2023.”\n\nAccording to data from analytics firm Dune, over 16.3 million ETH tokens are staked on the Ethereum network but cannot be withdrawn. The Shanghai upgrade, which has been named Shapella, is designed to give users who staked their ETH on the Ethereum network as early as December 2020 the freedom to withdraw their locked tokens.\n\nIt is believed that enabling withdrawals will reduce the risk associated with holding the staked version of Ethereum, including Frax’s froTH and Lido’s stETH, because they will be redeemable.\n\nHow Will The Ethereum Price Behave Post-Shanghai\n\nThere are mixed expectations on what may happen to the ETH price once the Shapella mainnet is launched. On the one hand, it is expected that some investors may want to cash out on their staking positions for liquid funds. Such a move would see them exit the Beacon Chain. Even if node operators withdraw and sell their ETH, they would want to maintain their staking positions for more yields.\n\nHowever, it is important to note that ETH stakers will not be able to withdraw their staked tokens all at once. A withdrawal process has been put in place that first allows holders to directly withdraw their staking rewards. This would represent $1.03 million ETH, worth about $1.8 billion at current rates. Given that Ethereum’s daily volume ranges between US $8-10 billion, chances of negligible selling pressure are high.\n\nIn addition, the amount of ETH staked per validator cannot be withdrawn directly given that a limit of 20,400 ETH ($85M at current rates) is required per day. This is a negligible amount as well when compared to Ether’s daily trading volume.\n\nTherefore, it is safe to say that the ETH price may not be too negatively impacted by the upgrade due to the relatively low selling pressure.\n\nOn the other hand, Ethereum holders could be motivated by the reduced risks to stake their ETH on the network and earn passive income. Note that staking rewards are inversely proportional to the number of validators. Therefore, if the number of node operators reduces, presumably because of stakers withdrawing their ETH, rewards will surge, attracting more validators. Given that ETH is now deflationary, however, we expect more buying pressure compared to selling pressure.\n\nIf Ether owners “HODL” their tokens and buy more, the equilibrium Ether price could rise because the quantity supplied will be reduced.\n\nEthereum Price Consolidating Before The Upgrade\n\nAfter rising above the $1,700 psychological level on March 17, the Ethereum price has been consolidating in a sideways price action. This points to decreasing volatility as both buyers and sellers fight for control.\n\nThe consolidation and decreasing volatility are illustrated by the choppy price action as well as the constriction of the Bollinger Bands. The more the bands squeeze toward each other, the more the volatility decreases, suggesting that a breakout may happen in either direction.\n\nThe horizontal price movement is also supported by the flattening of the moving averages and the leveling of the Relative Strength Index (RSI) close to the midline. This implies that the buying and selling pressures are balancing out.\n\nETH/USD Daily Chart\n\nShould the Ethereum price favor the buyers, it would rise from the current level to produce a daily candlestick close above the upper band of the Bollinger at $1,860, confirming a bullish breakout. Such a move would see the buyers collect the liquidity above the said level, bolstering ETH toward the $2,030 range high. This would represent a 13% ascent from the current levels.\n\nShould ETH move in favor of the downside, it would produce a daily candlestick close below the middle band of the Bollinger at $1,740 to seek solace from the $1,700 psychological level. Ethereum’s downside could be capped here in the short term, given that this level has provided support for the token for the last 14 days.\n\nLosing the support at $1,700 could initiate massive sell orders, with the first line of defense emerging from the 50-day Simple Moving Average (SMA) at $1,653. Additional support zones could be found at the $1,600 psychological level, the 100-day SMA at $1,540, and the 200-day SMA at $1,436, before reaching the March 10 swing low at $1,370. This would represent a 23% drop from the current price.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMy8zMC9vdmVyLTg1MjAwMDAwMC1pbi1ldGhlcmV1bS1wb2x5Z29uLWZhbnRvbS1hbmQtbW9yZS1sZWZ0LWJpbmFuY2UtZm9sbG93aW5nLWNmdGMtbGF3c3VpdC1zYXlzLW5hbnNlbi_SAYgBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDMvMzAvb3Zlci04NTIwMDAwMDAtaW4tZXRoZXJldW0tcG9seWdvbi1mYW50b20tYW5kLW1vcmUtbGVmdC1iaW5hbmNlLWZvbGxvd2luZy1jZnRjLWxhd3N1aXQtc2F5cy1uYW5zZW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Mar 2023 07:00:00 GMT",
        "title": "$852,000,000 in Ethereum, Polygon, Fantom and Additional Altcoins Have Left Binance Following CFTC Lawsuit: Nansen - The Daily Hodl",
        "content": "Crypto analytics firm Nansen says that more than $850 million worth of several crypto assets flowed out of Binance after a US federal agency accused the exchange of regulatory violations.\n\nAccording to Nansen, the world’s largest exchange by trading volume saw customers moving large volumes of virtual assets off the platform including Ethereum (ETH), Polygon (MATIC), Binance Coin (BNB), Avalanche (AVAX) and Fantom (FTM) within 24 hours of the alleged violations.\n\n“About $852 million* net outflow from Binance in 24 hours.\n\nAlso keep in mind that on December 13th last year, Binance processed $3 billion net outflow in one day.\n\n*Including ETH & Ethereum, Polygon, BNB Chain, Avalanche, Fantom tokens.”\n\nAccording to Nansen, Binance currently holds more than $62 billion in assets.\n\n“Binance holds $63.2+ billion in their publicly disclosed wallets, including: $19 billion in USDT, $14.5 billion in BTC $7.5 billion in ETH, $7.1 billion in BUSD, $3.2 billion in BNB. And others.”\n\nThe outflow occurred within 24 hours of Monday’s news that the US regulator the Commodities Future Trading Commission (CFTC) has charged crypto exchange Binance and its CEO Changpeng Zhao with a long list of violations.\n\nIn a press release from the CFTC, Chairman Rostin Behnam said Binance knowingly broke CFTC rules and has been actively avoiding compliance, and in a recent interview with CNBC Behnam said he is confident in its case against Binance.\n\nZhao responded to the complaint in a company blog post, saying he does “not agree with the characterization of many of the issues alleged in the complaint.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY3J5cHRvLm5ld3MvYml0Y29pbi1ldGhlcmV1bS1vbi1jZW50cmFsaXplZC1leGNoYW5nZXMtYXQtbXVsdGkteWVhci1sb3dzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin, ethereum on centralized exchanges at multi-year lows - crypto.news",
        "content": "A recent report by on-chain data analysis platform, Santiment, shows that the two most valuable cryptocurrencies by market cap, bitcoin (BTC) and ethereum (ETH), are actively being pulled from cryptocurrency exchanges like Binance.\n\nAccording to Santiment, crypto holders are moving their assets from custodial centralized exchanges to cold storage wallets where they have control of the coins’ private keys.\n\nPrivate keys are important seed phrases for signing transactions, sufficient proof that the sender owns coins.\n\nhttps://twitter.com/santimentfeed/status/1659830319724519425?s=20\n\nOn-chain data shows that the supply of these two major cryptocurrencies on leading crypto trading platforms has been decreasing and shifting to self-custody.\n\nSpecifically, the amount of bitcoin on crypto exchanges stands at 5.84%, the lowest level since December 2017. Meanwhile, ethereum on exchanges is at 10.1%, a 8-year low and a level last recorded during the mining of the Ethereum genesis block in July 2015.\n\nIn hard numbers, only 1.1m of the 18.3m BTC in circulation are held in exchanges. Similarly, only 12.1m ETH are on centralized crypto trading platforms.\n\nYou might also like: MicroStrategy bitcoin holdings keep growing: what it means for crypto\n\nRun on exchanges may be precursor to bull market\n\nSantiment also noted that while coin outflow from centralized ramps is not a perfect indicator, it does point to potential bull runs.\n\nEven so, bulls need to hold on until the two digital assets play out over time.\n\nFurthermore, it may illustrate a growing need for investors to have complete control over their crypto holdings and provide assurance that they are secure, given the distrust for exchanges caused by the collapse of FTX last year.\n\nIn March, withdrawals from Binance,the world’s leading cryptocurrency exchange, skyrocketed following a recent spat between the crypto exchange and the United States Commodity Futures Trading Commission (CFTC).\n\nSince September 2022, crypto investors have been moving coins in droves to self-custody addresses. The process was accelerated in November 2022 following the disastrous collapse of FTX. The failure of the now-defunct exchange eroded user trust in centralized platforms.\n\nPresently, some investors appear to be hurrying to transfer their holdings from Binance to cold wallets after the CFTC threatened to sue the exchange for allegedly breaking local trading laws.\n\nAccording to media reports, Binance clients pulled out $400m in the 24 hours following the CFTC’s statement.\n\nParallel data further revealed that Binance users withdrew about $850m from the platform in the 12 hours preceding the CFTC issue.\n\n1/ Large on-chain movements prior to the Binance indictment\n\n\n\nA few hours before the Binance CFTC Indictment, there were large stablecoin withdrawals across centralized exchanges, totaling almost $1.5B in just 12 hours\n\n\n\nNotably, Binance itself saw an $850M outflow. pic.twitter.com/yLD7f1cgmB — An Ape's Prologue (@apes_prologue) March 27, 2023\n\nEarlier, Binance had to deal with significant withdrawal requests in Q4 2022. This is after federal prosecutors in the United States said they could launch money laundering charges against the ramp.\n\nDespite fears, the exchange didn’t fail on their withdrawal obligations and completed all transactions without incident.\n\nCEO Changpeng Zhao, better known as CZ, dismissed assuaged user fears that all claims were a plot to create fear, uncertainty, and doubt (FUD) in the market.\n\nRead more: US presidential candidate accepts campaign donations in bitcoin\n\nFollow Us on Google News"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vbmZ0ZXZlbmluZy5jb20vdml0YWxpay1idXRlcmluLWFtb25nLXRoZS10b3Atc3BlYWtlcnMtYXQtZWRjb24tMjAyMy1pbi1tb250ZW5lZ3JvL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Vitalik Buterin Among the Top Speakers at EDCON 2023 In Montenegro - NFTevening.com",
        "content": "As one of the largest gatherings of the Ethereum and blockchain communities, the upcoming EDCON 2023 (Community Ethereum Development Conference) takes place in the beautiful city of Podgorica, Montenegro from May 19-23, 2023, and sees Vitalik Buterin take the helm to speak this year.\n\nThe conference features keynote speeches, technical workshops, and panel discussions on topics such as Blockchain Regulation, Layer 3, Decentralized Society, Decentralized Governance, the Network State, and more.\n\nEDCON 2023: Vitalik Buterin & Other Great Minds Unite For Web3!\n\nEDCON 2023 brings together the brightest minds of the Ethereum community. This includes Vitalik Buterin (co-founder of Ethereum), Balaji Srinivasan (author of the Network State), Scott Moore (co-founder of Gitcoin), Primavera De Filippi (Blockchain researcher at CNRS and the Berkman Klein Center at Harvard University), Tim Beiko (Ethereum Foundation), Barry Whitehat (Ethereum Foundation), Cy Li (Director of De University of Ethereum) as well as many other blockchain projects heads and research leaders.\n\nThe conference also includes an Ethereum Quorum day, a Community Event day, and a Super Demo competition. These activities also provide ample opportunities for collaboration and discussion.\n\nAbout EDCON\n\nOrganized by Linktime, De University of Ethereum, and ETHPlanet, EDCON is a non-profit annual global Ethereum conference. The event has attracted 10,000+ attendees, 2000+ developers, 300+ speakers, 450+ projects, 400+ supporters, and 300k+ online views since 2017. EDCON is mainly committed to serving the Ethereum ecosystem, boosting the communication and interaction of Ethereum communities worldwide."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vZGFpbHljb2luLmNvbS9wb2x5Z29uLW1hdGljLXRvLWRyb3Atc2VjcmV0LXprZXZtLW5mdHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Polygon (MATIC) to Drop Secret zkEVM NFTs: Here's How to Get Them - DailyCoin",
        "content": "Polygon is about to drop the first NFT collection on Polygon zkEVM.\n\nHolders of the commemorative soulbound NFTs “To Ethereum, with Love” will be rewarded with an NFT from the new collection.\n\nUsers can still qualify for the new NFT.\n\nThe Ethereum (ETH) space experienced an exciting past two weeks with multiple teams launching their scaling zkEVM projects.\n\nOne of the teams that launched a zkEVM is Polygon. Now the project wants to return the favor to its users by dropping them a secret NFT project on the newly launched zkEVM. Here’s how you get can it.\n\nPolygon to Drop Secret NFTs on zkEVM\n\nPolygon is known to be one of the most community-focused projects in the crypto space. It’s no wonder the team announced on Thursday that it would drop secret NFTs to its users to mark the launch of Polygon zkEVM.\n\nPolygon said that the holders of the commemorative soulbound NFTs “To Ethereum, with Love” will be able to receive a new NFT on the Polygon zkEVM. Polygon calls the yet-to-be-unveiled NFTs the “first NFT collection on Polygon zkEVM.”\n\nWE HAVE A SECRET TO SHARE 🤫\n\n\n\nTo the holders of the commemorative Soulbound NFT 'To Ethereum, with Love'…💜\n\n👉🏾We're gifting you an NFT, from the first collection on #zkEVM.\n\n\n\nThere are still 4 days to claim. Here's how…🧵👇🏼 pic.twitter.com/5tc9FD5tjx — Polygon (labs) (@0xPolygonLabs) March 30, 2023\n\nThe best part? Users still have four days until April 3rd to mint the “To Ethereum, with Love” NFTs and later be rewarded with the secretive zkEVM NFTs. They can mint them on fair.xyz.\n\nTo mint, go to the collection page on @fairxyzhttps://t.co/oqSuajzH64\n\n\n\n✅Collection Page\n\n✅Connect Wallet\n\n✅Follow @0xPolygonLabs & @fairxyz\n\n\n\nThen MINT 🙌\n\n\n\nYour SBT on Ethereum is non-transferable & is your moment of history. The NFT you receive on zkEVM WILL BE transferable. — Polygon (labs) (@0xPolygonLabs) March 30, 2023\n\nThe current commemorative soulbound NFTs are not transferable. The new ones that Polygon is about to drop to its users will be transferable and have the same ID as the soulbound NFTs. This means that users will be able to sell and buy them or transfer them to other wallets.\n\nOn the Flipside\n\nPolygon has yet to share information about the new NFT collection or when users will access it.\n\nWhy You Should Care\n\nSupporting blockchain projects almost always comes with certain benefits. In this case, Polygon users that want to be part of history can mint the commemorative zkEVM NFT and then get rewarded with NFTs minted on Polygon’s newly launched zkEVM.\n\nRead more about Polygon’s zkEVM:\n\nPolygon zkEVM Launches on Ethereum as ZK Season Heats Up\n\nRead more about Arbitrum’s ARB recent price action:\n\nARB Nears All-Time Low but Arbitrum Layer-2 Market Share Increases"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vYnJhbmQtc3Rvcmllcy9iaXRjb2luLXZzLWV0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tZXhwZXJ0cy1iZWxpZXZlLXJlbnEtd2lsbC1naXZlLXByb2ZpdHMtMTAxNjgwMTgwNDcyMDI0Lmh0bWzSAZEBaHR0cHM6Ly93d3cuaGluZHVzdGFudGltZXMuY29tL2JyYW5kLXN0b3JpZXMvYml0Y29pbi12cy1ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLWV4cGVydHMtYmVsaWV2ZS1yZW5xLXdpbGwtZ2l2ZS1wcm9maXRzLTEwMTY4MDE4MDQ3MjAyNC1hbXAuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin vs Ethereum Price Prediction, Experts believe RenQ will give profits - Hindustan Times",
        "content": "New Delhi (India), March 30: Bitcoin and Ethereum have been the top two cryptocurrencies in the market for several years now. However, as the crypto industry continues to evolve, new altcoins are emerging that could offer better profit potential.\n\nRenQ Finance (RENQ) is one such altcoin that experts believe could outperform both Bitcoin and Ethereum in 2023.\n\nHindustan Times - your fastest source for breaking news! Read now.\n\n>>>>> BUY RENQ TOKENS HERE <<<<<\n\nBitcoin vs Ethereum: A Brief Comparison\n\nBitcoin and Ethereum are both decentralized, open-source blockchain networks that allow for peer-to-peer transactions without the need for intermediaries like banks. Bitcoin was the first cryptocurrency, launched in 2009 by an unknown person using the pseudonym Satoshi Nakamoto. Ethereum, on the other hand, was created by Vitalik Buterin in 2013 and launched in 2015.\n\nWhile Bitcoin's primary use case is as a digital currency, Ethereum's blockchain is designed to support smart contracts and decentralized applications (DApps). Ethereum's native cryptocurrency, Ether (ETH), is used to pay for transaction fees and computational services on the network.\n\nBitcoin has a fixed supply of 21 million coins, while Ethereum does not have a fixed supply but uses a mechanism called \"proof of stake\" to ensure the network's security and stability.\n\nBitcoin and Ethereum Price Forecast 2023\n\nBitcoin and Ethereum have had an impressive run over the past few years, with Bitcoin hitting an all-time high of nearly $69,000 in 2021, and Ethereum reaching an all-time high of over $4,300 in May 2021 as well. However, both cryptocurrencies have faced significant price fluctuations in recent months, with Bitcoin now trading at around $27,684 and Ethereum trading at around $1,755 as of writing.\n\nMany experts believe that both Bitcoin and Ethereum will continue to face price volatility in the coming years. Some predict that Bitcoin's price could reach $100,000 by the end of 2023, while others believe that it could fall as low as $10,000. Similarly, Ethereum's price forecasts for 2023 range from a high of $10,000 to a low of $500.\n\nRenQ Finance: The Altcoin with Better Profit Potential\n\nWhile Bitcoin and Ethereum have been the top performers in the cryptocurrency market, RenQ Finance (RENQ) is an altcoin that experts believe has better profit potential in the coming years. RenQ Finance is a decentralized finance (DeFi) platform that aims to provide institutional-grade liquidity to the DeFi market.\n\n>>>>> BUY RENQ TOKENS HERE <<<<<\n\nOne of the key features of RenQ Finance is its \"smart contract\" technology, which allows users to access liquidity from multiple sources, including centralized exchanges, decentralized exchanges, and lending platforms. This technology ensures that users always get the best price for their trades and allows them to move their assets seamlessly between different platforms.\n\nAnother significant advantage of RenQ Finance is its low transaction fees. Unlike Bitcoin and Ethereum, which have high transaction fees due to network congestion, RenQ Finance's fees are minimal, making it a more cost-effective option for users.\n\nExperts predict that RenQ Finance could see significant price growth in the coming years, with some forecasting a price of $1 or more by the end of 2023. The platform's unique features and strong community support make it an attractive investment option for those looking to diversify their portfolio and capitalize on the growing DeFi market.\n\nConclusion\n\nWhile Bitcoin and Ethereum have been the top performers in the crypto market for several years, new altcoins like RenQ Finance are emerging that offer better profit potential. RenQ Finance's innovative features, low transaction fees, and strong community support make it a promising investment option for those looking to capitalize on the growing DeFi market.\n\nHowever, as with any investment, it's essential to do your own research and carefully consider the risks before investing in any cryptocurrency.\n\nClick Here to Buy RenQ Finance (RENQ) Tokens.\n\nVisit the links below for more information about RenQ Finance (RENQ):\n\nWebsite: https://renq.io\n\nWhitepaper: https://renq.io/whitepaper.pdf\n\nDisclaimer: This article is a paid publication and does not have journalistic/ editorial involvement of Hindustan Times. Hindustan Times does not endorse/ subscribe to the contents of the article/advertisement and/or views expressed herein. The reader is further advised that Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Hindustan Times shall not in any manner, be responsible and/or liable in any manner whatsoever for all that is stated in the article and/or also with regard to the views, opinions, announcements, declarations, affirmations etc., stated/featured in same. The decision to read hereinafter is purely a matter of choice and shall be construed as an express undertaking/guarantee in favour of Hindustan Times of being absolved from any/ all potential legal action, or enforceable claims. The content may be for information and awareness purposes and does not constitute a financial advice."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3prLXJvbGx1cHMtY2hlYXBlci13aXRoLXNjYWxl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Mar 2023 07:00:00 GMT",
        "title": "Zero-knowledge Rollups Get Cheaper With Scale - Blockworks",
        "content": "Ethereum scaling with zero-knowledge (zk) proof technology has rapidly moved from theory to functioning public mainnet, with dueling zero-knowledge Ethereum Virtual Machines (zkEVMs) from Matter Labs and Polygon launching in the past week.\n\nSoon to follow will be ConsenSys, the Ethereum blockchain infrastructure company, which recently deployed its zkEVM onto an Ethereum testnet.\n\nZk rollups are considered a breakthrough in crypto technology, as zero-knowledge proofs allow information to be proven to be valid or invalid without revealing the information itself.\n\nOn Ethereum layer-2 rollups, this means that transactions can be batched and validated by Ethereum without revealing the specifics involved in the individual transactions on the Ethereum mainnet.\n\nThis type of technology can considerably lower transaction costs by compressing the data, making more efficient use of Ethereum blockspace.\n\nHow do zk rollups lower transaction fees?\n\nZk rollups built on Ethereum offload the computation and execution of smart contracts to a separate layer-2 blockchain built on top of the base layer.\n\nThis means that, rather than having the Ethereum mainnet validators process individual transactions, the rollup instead offloads that responsibility to a prover and verifier on the layer-2 network.\n\n“Anyone can download the data and check if it is correct for some period of time,” Blockworks Research said.\n\nUnlike Ethereum mainnet, where more users and more transactions lead to increased gas fees, the costs of writing data to mainnet from a zk rollup in fact decline as the number of users increases since the otherwise fixed cost is divided between all users whose transactions are in a batch, DeFi researcher who goes by the ​​pseudonym Ignas tweeted.\n\n“When there are fewer transactions the fixed cost is distributed among fewer users, leading to higher average gas fees per transaction. As transaction volume increases, the fixed cost gets spread out, and fees drop,” Ignas said.\n\nMikhail Komarov, founder of zk infrastructure developer =nil; Foundation, agrees, but with a caveat.\n\n“In terms of L-1 transactions, this is true. But a user pays an L-2 fee, not an L-1 fee,” Komarov told Blockworks. “This means a rollup can charge some larger or smaller end-user fee with the only difference of using its own L-2 token for that.”\n\nCurrent zk rollups, however, do not charge fees in a native token — if they have one — but instead use ether.\n\nWhat exactly gets posted back to Ethereum mainnet depends on the specifics of the rollup implementation.\n\nFor instance, Polygon’s zkEVMs posts full transactions to mainnet, Bartek Kiepuszewski of L2Beat explained on Twitter, Tuesday. By contrast, both zkSync and StarkNet only submit changes in the state of the EVM that occur as a result of those transactions.\n\nLoading Tweet..\n\n“Right now, we have to differentiate between systems that are EVM-equivalent and EVM-compatible,” Kiepuszewski said at Devcon Bogota, in October 2022. “I think we’re going to see a very interesting competition between systems that try to emulate the EVM as close as possible and systems that will prefer to make sure that the proving is optimized for the particular VM — and in this category I would definitely put zkSync and StarkNet. The competition between these two approaches is will be very interesting to watch.”\n\nSimilar to how transactions on layer-1 cost a gas fee, posting data from layer-2 validity proofs also requires a fee. Currently, transactions are posted through ordinary Ethereum “calldata” in a transaction. But this will change under EIP-4844, Blockworks research said.\n\n“It will be posted to these things called blobs that will have a separate fee market to normal transactions making it cheaper,” Blockworks Research said.\n\nEIP-4844, also known as Proto-Danksharding, will the part of the next major Ethereum upgrade after Shanghai, dubbed Cancun.\n\n“I would say the only thing which can drive down data availability cost is a better compression (proof and circuits ‘quality’),” Komarov said. “The better the compression — the smaller the L-1 [data availability] charge.”\n\nUltimately, technological and hardware improvements will reduce the costs of data availability further and, over the long run, transaction fees on Ethereum layer-2s using zk proofs will continue to come down, Blockworks Research said.\n\nUpdated March 30, 2023 at 12:02 pm ET: Additional comments.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vdS50b2RheS9ldGhlcmV1bXMtcm9ja2V0cG9vbC1ycGwtcGx1bmdlcy0xMi1hcy1tYWpvci1ob2xkZXItYWxsZWdlZGx5LXN1ZmZlcnMtbXVsdGltaWxsaW9uLWRvbGxhci1waGlzaGluZ9IBdmh0dHBzOi8vdS50b2RheS9ldGhlcmV1bXMtcm9ja2V0cG9vbC1ycGwtcGx1bmdlcy0xMi1hcy1tYWpvci1ob2xkZXItYWxsZWdlZGx5LXN1ZmZlcnMtbXVsdGltaWxsaW9uLWRvbGxhci1waGlzaGluZz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Mar 2023 07:00:00 GMT",
        "title": "Ethereum's RocketPool (RPL) Plunges 12% as Major Holder Allegedly Suffers Multimillion Dollar Phishing Attack - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nOne of the largest Ethereum (ETH) staking services, RocketPool, suffered a multimillion dollar sell-off today, allegedly caused by a phishing attack. According to Lookonchain, around 85,900 RPL were withdrawn from \"poap.eth\" and then exchanged for ETH, the equivalent of $3.8 million. The address itself most likely belongs to the founder of the POAP protocol, Patricio Worthalter.\n\nAdvertisement\n\nAfter exchanging all the stolen RPLs for Ethereum (ETH), the attacker further scattered the stolen funds between addresses marked \"Fake_Phishing\" and also sent 17 ETH to Binance, PeckShieldAlert reported.\n\nRocketPool (RPL) price reaction\n\nThe sale caused by the theft of RocketPool tokens from Worthalter's wallet has nullified all the positive price action of recent days. After losing more than 13% of its opening price at one point, RPL still managed to recoup some of its fall and is now quoted in the $43 per token area.\n\nAt the peak of the drop, RPL trading volume on Binance , the largest crypto exchange, reached 49,800 RPL within a quarter of an hour, roughly the daily trading rate of the token.\n\nRPL to USD by CoinMarketCap\n\nNeither Worthalter nor POAP has so far commented on what happened."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vdS50b2RheS9jYXJkYW5vLWFkYS10by1iZWNvbWUtbGFyZ2VzdC1ldm0tY2hhaW4tdGhhbmtzLXRvLXRoaXMta2lsbGVyLWlubm92YXRpb27SAVxodHRwczovL3UudG9kYXkvY2FyZGFuby1hZGEtdG8tYmVjb21lLWxhcmdlc3QtZXZtLWNoYWluLXRoYW5rcy10by10aGlzLWtpbGxlci1pbm5vdmF0aW9uP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Mar 2023 07:00:00 GMT",
        "title": "Cardano (ADA) to Become Largest EVM Chain Thanks to This Killer Innovation - U.Today",
        "content": "Leading blockchain developer and Milkomeda co-founder Sebastien Guillemot announced that Cardano (ADA) will become the top EVM chain by next month. This will be possible as a result of Milkomeda's introduction of a new feature that will allow every Cardano user to use any EVM contract directly from any Cardano wallet, and all within ADA, Guillemot said.\n\nAdvertisement\n\nThus, says the developer, Cardano will immediately become one of the largest EVM networks in terms of user base size. In addition, Milkomeda will soon launch staking rewards for all EVM users, including smart contract developers. This will make Cardano the largest EVM-compatible chain with a fully operational staking rewards system. On this occasion, Guillemot invites everyone interested to build on Cardano's EVM layer and receive rewards every five days.\n\nArbitrum uses WASM\n\nOptimism uses MIPS\n\nStarknet uses Cairo\n\n\n\nDo you also consider these self-owns? No, because they’re bringing new capabilities to chains making them stronger — Sebastien Guillemot (@SebastienGllmt) March 30, 2023\n\nHowever, some users were unhappy with this development regarding Cardano. In their view, this calls into question the validity and uniqueness of Cardano as a standalone blockchain. To some, it seemed like an attempt to make life easier for lazy developers who do not want to learn Haskell or Plutus, Cardano's native programming languages.\n\nCardano gaming\n\nThe developer also noted the growing activity on the Milkomeda network related to the adoption of the Paima Engine, a blockchain gaming innovation from the Guillemot team. In his view, this has the potential to turn Cardano into a powerhouse for on-chain gaming in the future."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiugFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMzEtbWFyY2gtMjAyMy9hcnRpY2xlc2hvdy85OTEzODQ4OC5jbXPSAb4BaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXByaWNlcy10b2RheS1saXZlLW5ld3MtYml0Y29pbi1kb2dlY29pbi1ldGhlcmV1bS1zaGliaGEtaW51LWNyeXB0b2N1cnJlbmN5LWxhdGVzdC11cGRhdGVzLTMxLW1hcmNoLTIwMjMvYW1wX2FydGljbGVzaG93Lzk5MTM4NDg4LmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Crypto Price Today Live: Bitcoin holds above $28,000; Solana, Dogecoin slip up to 3% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nNew Delhi: The cryptocurrency markets were trading mixed on Friday. Bitcoin, Dogecoin and Solana were trading with cuts, while BNB, XRP and Tron were trading with gains.Bitcoin (BTC) fell 1.91% to $28,074, whereas Ethereum (ETH) was above the $1,800 level. BTC volume stood at approximately $19.14 billion, falling 17.89% in the last 24 hours.\"Bitcoin was seen consolidating above the US$28,000 pivot level in the past 24 hours following a recent surge above the US$29,000 level. This consolidation could be due to the anticipation of the upcoming US GDP report,\" Edul Patel, Co-founder and CEO at Mudrex, said.\"There is a key bullish trend line forming with support near US$27,900. BTC’s immediate resistance now lies at the US$28,500 level and then US$ 28,850 zone. However, BTC has not yet acquired enough strength to make a sharp move but the key uptrend support remains intact,\" Edul added.The total volume in DeFi is currently 4.44 billion, 10.21% of the total crypto market 24-hour volume. The volume of all stablecoins is now $38.58 billion, which is 88.73% of the total crypto market 24-hour volume.The global cryptocurrency market cap was trading lower around $1.18 trillion, falling 0.87% in the last 24 hours.The market cap of Bitcoin, the world's largest cryptocurrency, was around $543 billion. Bitcoin’s dominance is currently 46.17%, a decrease of 0.47% over the day, according to CoinMarketCap.\"The current technical outlook remains relatively stable, hovering around the $27,900 price level. A break of the resistance at $28,950 could lead to a potential rally for Bitcoin to $29,200 or even $30,700, while strong support levels are expected around $26,600 and $25,200 if the downtrend continues,\" Sathvik Vishwanath, Co-Founder & CEO of Unocoin, said.Rajagopal Menon, Vice President at WazirX said, \"Major market oscillators point to a neutral sentiment. The Relative Strength Index (14) sits at 62.71, with a neutral outlook. The Stochastic %K (14, 3, 3) and the Average Directional Index (14) indicate a Neutral outlook as well at 69.33 and 38.60 respectively.\"The MACD Level (12, 26), at 1198.04, indicates Sell. The Stochastic RSI Fast (3, 3, 14, 14) and the Williams Percent Range (14) continue to be Neutral at 30.11 and −41.78, respectively,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 12.28 hours, IST on March 31, 2023)Bitcoin $28,074 -1.91%Ethereum $1,801 0.13%Tether $1.00 0.04%BNB $316.48 1.19%XRP $0.5442 1.34%Cardano $0.3788 0.45%Polygon $1.09 -1.90%Dogecoin $0.07465 -0.82%Solana $20.40 -2.62%Polkadot $6.22 0.79%Tron $0.06513 1.29%Shiba Inu $0.00001062 0.01%Litecoin $89.30 -1.12%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy93aG8td2FzLWZyb250LXJ1bm5pbmctYmluYW5jZS11c2Vyc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Mar 2023 07:00:00 GMT",
        "title": "Who was front-running Binance users? - Cointelegraph",
        "content": "On Jan. 26, a Medium article revealed that an entity with control over multiple Ethereum addresses had consistently purchased cryptocurrencies prior to their listing on Binance, selling them for a million-dollar profit after the event.\n\nThe article refers to 16 cases from an on-chain analysis perspective, demonstrating how the mysterious entity was aware of Binance listings several days in advance, and how it was unlikely to be carried out by someone with little experience in concealing its tracks.\n\nSurprisingly, Binance founder Changpeng “CZ” Zhao issued a statement on the subject two months later, only after the article gained traction on Twitter. CZ claims that the exchange “froze $2 million associated with the address in question” but does not say whether Binance employees were involved.\n\nTraders are now demanding an investigation into the illegal use of insider information in these multiple “front-run” instances. However, the burden of proving illegal access to privileged information may prove difficult for prosecutors.\n\nOn-chain data reveals the covert operations of a Binance listings insider. Over the course of several months, this anonymous individual front-ran the infamous Binance listing pumps of multiple altcoins, booking a 7-figure profit. And he left a trail for us to follow... (1/9) — FatMan (@FatManTerra) March 28, 2023\n\nAt first glance, the accusations about front-running Binance listings appear to be reasonable. However, the on-chain data and numerous instances of “sheer luck” in purchasing cryptocurrencies on decentralized exchanges (DEX) prior to their listing on Binance may not constitute a crime.\n\nAltcoins do not necessarily constitute securities instrument\n\nA securities instrument is a financial asset that can be bought or sold on regulated exchanges, representing ownership or debt from a publicly traded company or government entity. The most common types of securities include stocks, bonds, options and futures contracts.\n\nThank you for pointing this out. We had frozen $2m associated with the address in question before your thread (and they never asked to re-claim). We are also always fighting potential leaks, etc. We welcome you to point them out in the future too. Helps all of us. — CZ Binance (@cz_binance) March 29, 2023\n\nIn the United States, securities listing and trading are primarily regulated by two government agencies: the Securities and Exchange Commission and the Financial Industry Regulatory Authority (FINRA). The SEC is responsible for enforcing federal securities laws, including overseeing the registration and disclosure requirements for securities issuers, while FINRA oversees the firms and professionals involved in the securities industry.\n\nThe accusations against an entity that has consistently run covert operations ahead of Binance listings, supposedly profiting by more than $1.4 million, may have all the elements that justify non-usual trading activities and, almost certainly, unethical. More importantly, such entities might have gotten the information without Binance employees’ knowledge. Still, there are three reasons why insider trading rules likely can not be applied to such a case.\n\nThe Coinbase front-run involved wire fraud\n\nUnlike securities, non-securities investments, such as real estate, art, commodities and cryptocurrencies, are not regulated by the SEC or any other regulatory body. As a result, there are no specific laws or regulations prohibiting front-running in these types of investments.\n\nEven though the above statement is true, the most notorious case of insider trading activity, involving a former product manager at Coinbase, ultimately involved wire fraud. Under U.S. federal law, wire fraud is defined as a crime that involves a scheme to defraud others, with the use of interstate wire communications, including electronic formats.\n\nRelated: Crypto exchanges keep failing, so why do we still trust Changpeng Zhao?\n\nWire fraud is a serious crime that can result in severe penalties, including fines and imprisonment. It is typically investigated and prosecuted by federal law enforcement agencies, such as the Federal Bureau of Investigation or the Department of Justice.\n\nNikhil Wahi and Sameer Ramani were charged with using Ethereum blockchain wallets to acquire digital assets and trading before the Coinbase announcements. However, jurisdiction is a huge difference versus the wallet tied to the Binance listing, as the exchange is not located in the U.S. and, supposedly, does not serve clients based in that region.\n\nIn many jurisdictions, there may not be specific laws or regulations that prohibit front-running in non-securities investments. Therefore, without a legal framework to prohibit this behavior, it may not be considered illegal.\n\nOne needs to prove that the information was illegally acquired\n\nFront-running in securities is often associated with insider trading, which is illegal. However, insider trading typically involves trading securities based on material, non-public information. Since non-securities investments do not involve securities, the concept of insider trading does not apply.\n\nRelated: Expect the SEC to use its Kraken playbook against staking protocols\n\nTo build a case against the owner of the Binance-related listing address, it would be necessary to demonstrate that the owner obtained the privileged information through illegal means. Even if the account has a perfect track record, circumstantial evidence is unlikely to hold in this case.\n\nUnfortunately, cryptocurrency regulation is at best ambiguous, and even the SEC has difficulty proving to courts what cryptocurrencies are considered securities. Moreover, the Commodity Future Trading Commission’s case against Binance and CZ demonstrates that users are not protected from illegal trading activities, regardless of whether they occur with the knowledge or approval of exchange management.\n\nMarcel Pechman is a crypto analyst who worked for 17 years as an equities sales trader for UBS, Deutsche Bank, Pactual & Banco Safra. He holds a post-graduate certificate in engineering and a bachelor’s degree in business administration.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vZGVjcnlwdC5jby8xMjQ5Njkvd2h5LXBpcmF0ZS1uYXRpb24tbGVhdmluZy1wb2x5Z29uLXNldHRpbmctc2FpbC10b3dhcmRzLWFyYml0cnVtLW5vdmHSAWRodHRwczovL2RlY3J5cHQuY28vMTI0OTY5L3doeS1waXJhdGUtbmF0aW9uLWxlYXZpbmctcG9seWdvbi1zZXR0aW5nLXNhaWwtdG93YXJkcy1hcmJpdHJ1bS1ub3ZhP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Mar 2023 07:00:00 GMT",
        "title": "Why Pirate Nation Is Leaving Polygon and Setting Sail Towards Arbitrum Nova - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAhoy, Arbitrum!\n\nPirate Nation is a role-playing game (RPG) with a boxy voxel-art aesthetic and dynamic NFTs, and is almost entirely on-chain. But while many games announce that they’re building on the Ethereum sidechain Polygon, studio Proof of Play is instead setting sail for new shores with Pirate Nation.\n\nProof of Play co-founder and CEO Amitt Mahajan—a veteran of Zynga and the smash casual game Farmville—told Decrypt that Pirate Nation needed to move to a more affordable and scalable platform. Despite what some might think about scaling networks, he said, those Polygon transaction fees really do add up.\n\nAD\n\nAD\n\nSince launching the game in December 2022, Mahajan has seen increased fees on the backend as more players get into the game. While some Pirate Nation players buy NFTs on the Ethereum mainnet before opening the game, any “transactions” or backend activities where players acquire items within the game do not force the user to sign with their wallet or pay gas fees.\n\nWelcome to Pirate Nation, an on-chain RPG on Ethereum by @ProofOfPlay. A game built at the intersection of casual gaming, web3 technology, and shared ownership & incentives. A thread 🧵 covering what you need to know about our game, ecosystem, & team. Let's dive in. 👇 1/many pic.twitter.com/3Urbap46qr — Pirate Nation (@PirateNationNFT) March 30, 2023\n\nIt's a move to simplify the game’s Web3 experience, making it as seamless and immersive as possible without the friction and cumbersome nature of engaging with smart contracts—which hold the code that powers autonomous Web3 apps and games. It has already become the norm for many blockchain games.\n\nWhile some studios opt for pre-authorization methods so that users only have to sign once, other studios instead eat the cost of in-game transactions. Either way, someone has to pay those fees in-game for users to engage with smart contracts—and Proof of Play has been covering those in-game gas fees itself to spare users the hassle.\n\n“As more people have migrated to Polygon, we just started to run into scaling issues with the Polygon chain,” Mahajan told Decrypt. “We were paying between $3,000 and $4,000 a day on gas. And so it just got untenable. It was preventing us from being able to scale the game.”\n\nAD\n\nAD\n\nMahajan said that many options were explored for Pirate Nation, including migrating away from Ethereum entirely or considering a private network—like a Polygon Supernet or an Avalanche Subnet. However, it chose Arbitrum Nova, another Ethereum scaling solution (a layer-2 network) for the game, because it offered support for Pirate Nation’s technical features like OpenZeppelin security products and nodes already implemented into the game.\n\nWhile there's a lot of buzz around zero-knowledge (ZK) scaling networks, including the newly-launched Polygon zkEVM network and the upcoming Immutable zkEVM gaming network based on Polygon's own, Mahajan admitted that he doesn't want to take a risk on something that may not yet be fully optimized.\n\n“There’s a lot of hype around the ZK stuff,” he said. “We don’t want to be the first adopters of these technologies. We’re just trying to provide a great experience to users. So we want to see proof of concepts, examples of projects that are running [in] production before we’re willing to move over.”\n\nDecentralized Focus\n\nWhile Pirate Nation’s team is cautious about anchoring on new shores, Proof of Play has developed its own tech solution called “mirroring” for the move to Arbitrum Nova.\n\nInstead of “bridging” assets through a process that effectively mints a new version of the NFT on the target chain, Pirate Nation has its smart contracts set up so that users will see the assets they buy on the Ethereum mainnet automatically appear in their game on Arbitrum Nova.\n\nPirates, we've been heads down preparing a number of massive upgrades to Pirate Nation, and the @ProofOfPlay game suite. The first of which is ready to be revealed: We are delighted to announce our migration to @Arbitrum Nova. 🥳 1/4 pic.twitter.com/befQBE8QrB — Pirate Nation (@PirateNationNFT) March 21, 2023\n\nIn other words, as the name suggests, it mirrors the game assets on both chains. And since Pirate Nation is nearly entirely on-chain and operated via automated smart contracts, almost every aspect of the game is stored on a blockchain.\n\n“Most Web3 games that are out there, they use NFTs and tokens as the basis for in-game items and currency. But the majority of gameplay still happens in a centralized fashion,” Mahajan said.\n\nAD\n\nAD\n\nHe likened most Web3 games to a game of chess, where the pieces are NFTs.\n\n“But if you actually want to play the game chess, you have to still go to someone's website and connect to their servers. And if for some reason that company goes away, your chess pieces are now useless, because you don't have the board or the game rules to go along with it,” Mahajan said of most Web3 games.\n\nPirate Nation is currently building an on-chain game engine, and also has what Mahajan calls the “equivalent” of a game server on-chain. Numerous smart contracts operate the game’s mechanics as well, meaning that the only major element of the game that isn’t currently stored on-chain is its art, which is stored on IPFS. And compressing and moving the art on-chain wouldn’t be entirely out of the question, Mahajan added.\n\nAs for whether users will notice any changes with Pirate Nation’s migration, Mahajan believes that’s unlikely: “From a user’s perspective, it’s going to be seamless—and, in fact, less friction.”"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY29pbmZvbWFuaWEuY29tL2V0aGVyZXVtLWFuYWx5c2lzLXN0cm9uZy1iZWFyaXNoLXNpZ25hbC1pbmRpY2F0ZXMtYS1kcm9wLWJsb3ctMTUwMC_SAV9odHRwczovL2NvaW5mb21hbmlhLmNvbS9ldGhlcmV1bS1hbmFseXNpcy1zdHJvbmctYmVhcmlzaC1zaWduYWwtaW5kaWNhdGVzLWEtZHJvcC1ibG93LTE1MDAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Mar 2023 07:00:00 GMT",
        "title": "Ethereum Analysis: Strong Bearish Signal Indicates a Drop Blow $1,500 - Coinfomania",
        "content": "Ethereum prices over the last seven days showed a gradual decline in the buying volume of the asset. A look at the chart paints a clearer picture of what transpired.\n\nThe chart above depicts almost equal candles of different colors. This is as a result of a near equilibrium in buying and selling pressure. An increase in one day is always shortlived as an opposing action may take place during the next intraday session.\n\nThis was dominant trend during the previous intraweek session. In the end, we noticed a red doji. This pattern is still present during the current seven-day period. As with the previous, we are also seeing a doji.\n\nMany traders are finding it hard to come up with possible predictions as to how prices may perform in the coming days. Indicators, however, are pointing to a massive downtrend. Let’s consider these metrics.\n\nThe Moving Average Convergence Divergence\n\nThe indicator shows that the apex altcoin had a bearish convergence a few days ago. However, it is not pronounced as the asset failed to record any huge price change.\n\nOver the last four days, we noticed that the 12-day EMA is very close to the 26-day EMA with no contact. This is also the trend at this time. Nonetheless, a divergence is almost inevitable as the crypto market is losing its bullish momentum.\n\nSuch a bearish event may spell out a massive in price in the coming days.\n\nYour crypto deserves the best security. Get a Ledger hardware wallet for just $79!"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiqAFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC8yMDIzLWlzLXRoZS15ZWFyLW9mLWNyeXB0b2N1cnJlbmNpZXMtYWNjb3JkaW5nLXRvLWJ1cm5pc2tlLWJpdGNvaW4tYW5kLWV0aGVyZXVtLW9uLWEtaGlnaC13aGlsZS1iaWctZXllcy1jb2luLW9mZmVycy1odWdlLWJvbnVzLWluLWljby_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Mar 2023 07:00:00 GMT",
        "title": "2023 Is The Year OF Cryptocurrencies According to Burniske, Bitcoin and Ethereum On A High While Big Eyes Coin ... - Analytics Insight",
        "content": "One of the leading cryptocurrency analysts, Chris Burniske has conveyed a bullish outlook in 2023 despite the banking crisis that caused much upheaval in the beginning of the year. He expressed that while the bank collapses might spread short term volatility in the digital currency environment, the situation is going to turn and become profitable for crypto investors in the long run. Hasty rate hike is the culprit for the banking crisis which according to Burniske can be resolved by adjusting monetary policies. He tweeted that “blockchains are critical infrastructure that provide solutions to the problems our society faces, including AI.”\n\nBitcoin Gets Its Mojo Back\n\nBitcoin (BTC) got its mojo back in March 2023 after a bleak 2022. It has seen gains of more than 70%, surpassing all other major assets and was trading at its highest in nine months this week. The bank collapse certainly hit the leading coin in the beginning of 2023 but it has bounced back even better.\n\nBitcoin’s core user base of retail investors have been the major driving force behind the bull run. According to CoinShares, BTC investments products witnessed outflows of $113 million favoured by large investors. Some analysts say that Bitcoin’s intrinsic characteristics are now totally capable of price support. BTC is currently trading at $27,078 with a market cap of $523.44 Billion. Looking at the figures, the crypto analysts might be right.\n\nEthereum Could Rise Up To $3049 in 2023\n\nEthereum (ETH) is one of the most technologically advanced cryptocurrencies which is also widely used. ETH has been showing tremendous growth rates in recent years. It is being predicted that 2023 is going to be the year where ETH rises to its full potential. According to price predictions made by analysts, ETH could rise up to $3049 this year.\n\nEthereum Merge was completed last year. Staked ETH was locked on the network. The upcoming Shanghai upgrade will enable the users to un-stake their staked ETH coins for the first time. The upgrade was first scheduled for March but has now been postponed to April. Currently ETH is priced at $1746.08 with a market cap of $213.67 Billion.\n\nBig Eyes Coin Set For Launch, Gives 250% Bonus\n\nBig Eyes Coin (BIG) is a new altcoin in the meme coin arena. With 80% of the 200 billion BIG tokens available at launch, it is definitely aiming to be one of the coolest cat coins amongst cryptocurrencies that have been historically more dog-themed. Big eyes Coin is in stage 12 of ICO and has raised a whopping $32.53 million. The ICO is soon going to end and launch will certainly lead to an immediate price hike.\n\nThe community or Kitty Cuddlers who have supported the meme coin since the beginning already enjoy 390% ROI. If you haven’t, all is not lost. Big Eyes Coin is offering the users 250% bonus on all purchases of BIG tokens and the Loot Boxes. One just has to apply the bonus code BULLRUN250 at the checkout for 250% additional BIG tokens. Believe it or not, this crypto cat is on the prowl in 2023.\n\nBig Eyes Coin (BIG)\n\nPresale: https://buy.bigeyes.space/\n\nWebsite: https://bigeyes.space/\n\nTelegram: https://t.me/BIGEYESOFFICIAL\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vY3J5cHRvdGlja2VyLmlvL2VuL2Jlc3Qtd2ViMy1vcGVuLXNvdXJjZS10b29scy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Mar 2023 07:00:00 GMT",
        "title": "Best Web3 open-source tools 2023 - CryptoTicker.io - Bitcoin Price, Ethereum Price & Crypto News",
        "content": "Share\n\nShare stories you like to your friends"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vdGhlbmV3ZGF3bmxpYmVyaWEuY29tL2J5Yml0LWxhdW5jaGVzLW9wdGltaXplZC1ldGgtc3Rha2luZy1haGVhZC1vZi1ldGhlcmV1bXMtc2hhbmdoYWktdXBncmFkZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Bybit Launches Optimized ETH Staking Ahead of Ethereum's Shanghai Upgrade - Liberia news The New Dawn Liberia ... - The New Dawn Liberia",
        "content": "DUBAI, United Arab Emirates 31st March 2023 -/African Media Agency(AMA)/- Bybit, the world’s third most visited crypto exchange, launched its new Web3 Staking Pool today, enabling users to take advantage of the exchange’s uncomplicated ETH staking options in time for Ethereum network’s much anticipated Shanghai upgrade.\n\nThe staking pool drastically simplifies the process of adding liquidity to premier decentralized finance protocol Curve Finance from 11 steps to just three and saves transaction fees, too. The added benefits could lead to an ETH staking APR of up to 6.5%. And Bybit users don’t even need to buy ETH as the product can be accessed using BTC, USDT and USDC balances.\n\nAccording to Ben Zhou, co-founder and CEO of Bybit, “By introducing our Web3 Staking Pool via a dedicated landing page, we are making it easier for users to interact with decentralized finance and gain more rewards for their assets. Essentially, we are offering single-sided staking, which boosts the APR of ETH.”\n\n“The highly liquid and trading-integrated ETH staking options we will be rolling out around the time of Ethereum’s Shanghai upgrade will open up many new opportunities for our users,” Zhou added. “By offering convenience and transparency, our users will gain more control over how they manage their funds and grow their wealth in the Web3 era.”\n\nEthereum’s Shanghai upgrade is also the theme of two special trading events hosted by Bybit. Both events kick off on April 4th at 10:00 am (UTC) and run until April 21 and 25, respectively.\n\nFirstly, the ETH Shanghai Upgrade Trading Bash opens the door for Bybit users trading any ETH-related derivatives (perpetuals, inverse or futures contracts) to share in a total prize pool of 450,000 USDC. Secondly, by entering Bybit’s Supreme Scorer 2023, users have the chance to predict the price movement of eight different ETH-related trading pairs and share in the 80,000 USDT bonus pool.\n\nBybit is proud to offer Web3 integrations that create a simple, streamlined user experience and bring next level opportunities and products to institutions, crypto-natives and newcomers alike.\n\nMore from Bybit\n\n[bsa_pro_ad_space id=1]\n\nDistributed by African Media Agency (AMA) on behalf of Bybit.\n\nAbout Bybit\n\nBybit is a cryptocurrency exchange established in 2018 that offers a professional platform where crypto traders can find an ultra-fast matching engine, excellent customer service and multilingual community support. Bybit is a proud partner of Formula One’s reigning Constructors’ and Drivers’ champions, the Oracle Red Bull Racing team, esports teams NAVI, Astralis, Alliance, Made in Brazil (MIBR), and Oracle Red Bull Racing Esports, and association football (soccer) team Borussia Dortmund.\n\nFor more information please visit: https://www.bybit.com\n\nFor updates, please follow Bybit’s social media platforms on\n\nhttps://discord.com/invite/bybit\n\nhttps://www.facebook.com/Bybit\n\nhttps://www.instagram.com/bybit_official/\n\nhttps://www.linkedin.com/company/bybitexchange/\n\nhttps://www.reddit.com/r/Bybit/\n\nhttps://t.me/BybitEnglish\n\nhttps://www.tiktok.com/@bybit_official\n\nhttps://twitter.com/Bybit_Official\n\nhttps://www.youtube.com/c/Bybit\n\nFor media enquiries, please contact: press@bybit.com\n\nSource : African Media Agency (AMA)"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LnRoZW5ld3NtaW51dGUuY29tL25ld3MvaW5kaWEtY29sbGVjdHMtb3Zlci0xNTctY3JvcmUtY3J5cHRvLXRheC0yMDIyLTIzLWV0aGVyZXVtcy1zaGFwZWxsYS11cGdyYWRlLXRha2XSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "India collects over ₹157 crore crypto tax in 2022-23; Ethereum's Shapella upgrade to take place on April 12 - The News Minute",
        "content": "Following a tumultuous year marked by arrests, scams, bankruptcies, and substantial losses in value, the cryptocurrency market has started the new year on a positive note, with Bitcoin's price recently reaching around $29,000 - a level not seen since June 2022. Over the past two weeks, Bitcoin has exhibited remarkable strength with a surge of more than 17%. This performance highlights the asset's resilience in the face of regulatory hurdles and implies that it might be starting a bullish market phase."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3LmNyeXB0b3BvbGl0YW4uY29tL2NhcmRhbm8tdXNlcnMtYWNjZXNzLWV2bS13aXRoLWFueS1hZGEtd2FsbGV0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Cardano users to access Ethereum Virtual Machine contracts with any ADA wallet - Cryptopolitan",
        "content": "Users of Cardano will soon be able to access Ethereum Virtual Machine (EVM) contracts using any ADA wallet, thanks to a new feature on Milkomeda. Milkomeda is a network that connects different blockchains, such as Cardano and Algorand with EVM contracts. According to CEO Sebastien Guillemot of Milkomeda, the upcoming feature will allow all Cardano users to access EVM contracts from any Cardano wallet. This is a major development for both developers and users that can expand the utility of the network.\n\nCardano users will soon be able to access Ethereum Virtual Machine (EVM) contracts by leveraging the upcoming feature on Milkomeda, a network that interlinks Cardano and Algorand with EVM contracts. Sebastien Guillemot, CEO of Milkomeda, announced late Thursday: “Milkomeda’s new feature will provide every Cardano user with the ability to use EVM contracts directly from any Cardano wallet.” This is a major development that will expand the network’s utility for developers and users alike.\n\nGuillemot announced Milkomeda is soon enabling staking rewards for all Ethereum Virtual Machine (EVM) users including smart contract developers. Staking rewards from Cardano products developed on Milkomeda will be paid out automatically every five days. This new feature will provide Ethereum application developers with an opportunity to build and deploy their dapps and decentralized finance (DeFi) applications on Cardano’s network using Solidity – the same programming language used for Ethereum – without needing to learn a new language or install any special toolkits.\n\nFurthermore, Ethereum users will be able to enjoy the same benefits of developing and deploying applications on Cardano’s network without having to switch blockchains. This is expected to open up a new wave of developers who may have been hesitant about making the switch due to the associated learning curve."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vaW52ZXN0b3Jza2luZy5jb20vMjAyMy8wMy8zMC9uZWFybHktOTAtb2YtZXRoZXJldW0tc3VwcGx5LW5vdy1oZWxkLW9mZi1jcnlwdG8tZXhjaGFuZ2VzL9IBZGh0dHBzOi8vaW52ZXN0b3Jza2luZy5jb20vMjAyMy8wMy8zMC9uZWFybHktOTAtb2YtZXRoZXJldW0tc3VwcGx5LW5vdy1oZWxkLW9mZi1jcnlwdG8tZXhjaGFuZ2VzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Mar 2023 07:00:00 GMT",
        "title": "Nearly 90% of Ethereum Supply Now Held Off Crypto Exchanges - Investors King Ltd",
        "content": "The first ever cryptocurrency was launched in 2009, and fourteen years later, crypto has experienced massive growth and adoption worldwide.\n\nFrom being accepted as legal tender in countries like El Salvador to being accepted as a payment method by businesses worldwide, digital currencies have proved they are here to stay and thrive. We have witnessed the boom of crypto globally, and Nigeria has not been left off the group chat.\n\nDespite the limitations of the Central Bank of Nigeria, Nigerians have been at the front line of cryptocurrency adoption in Africa , with millions of users. We all know Nigeria does not have the most stable economy, but we Nigerians have looked to crypto to give us leverage. It has helped us in many ways, from protection from inflation, currency devaluation and much more. With crypto, we can transact with anyone, anywhere in the world, without the need for middlemen, and it’s great for startups and small businesses in need of funding. All in all, crypto has been a game-changer for Nigerians, and it will only get bigger!\n\nAre you ready to hop on the crypto wave and start making money from it? It is never too late. That’s why I am here to share with you all you need to know on how to trade Ethereum in Nigeria. Keep reading to discover the benefits of trading Ethereum and exactly how to trade the popular crypto coin in Nigeria and get the most out of your investment.\n\nOverview of Ethereum\n\nIn 2015, Ethereum was released to the market by Vitalik Buterin, a young Russian programmer who saw the potential for blockchain technology beyond only crypto.\n\nWith Ethereum , developers can create decentralised applications (dApps) and smart contracts. Ethereum has its own crypto, Ether (ETH), used to pay for transactions and encourage developers to build on the platform.\n\nA brief history of Ethereum\n\nAlthough Ethereum was launched in 2015, the idea started in 2013 when Buterin wrote a whitepaper describing the concept of a blockchain platform that could be used beyond financial transactions.\n\nBut it did not stop there. In 2014, the project became quite popular as Buterin started a crowdfunding campaign to raise funds for Ethereum’s development.\n\nThe campaign was a huge success and even raised over $18 million worth of Bitcoin in only 42 days. Amazing, indeed.\n\nCurrently, Ethereum is one of the most popular blockchain platforms. It gave rise to thousands of decentralised applications, ranging from financial applications like decentralised exchanges (DEXs), stablecoins, to non-financial applications such as supply chain management and even voting systems.\n\nBenefits of Trading Ethereum in Nigeria\n\n1. Potential to Make Quick Profits:\n\nYou cannot deny that the whole point of making investments is to make a profit, which makes Ethereum a good choice. Like other crypto coins, the price of Ethereum is volatile, which means that its price can fluctuate rapidly over short periods. This makes it possible for traders to buy when the price is low and sell ETH for quick profit when it is high.\n\n2. Ability To Access a Global Market:\n\nTraditional financial markets are geographically limited, but the cryptocurrency market is global. This means that traders in Nigeria can buy Ethereum in Nigeria and also sell with anyone in the world, giving you access to a much larger market. Is Naira crashing again? Don’t worry; Ethereum has your back.\n\n3. Allows Traders To Bypass Traditional Financial Institutions:\n\nTraditional financial institutions are either inaccessible or unreliable in many parts of the world. The same is the case in Nigeria, from screaming at ATMs today to fighting for your money in the bank tomorrow. It’s a never-ending struggle.\n\nCrypto provides an alternative to these institutions, allowing you to transact directly with each other without the need for intermediaries.\n\nHow To Sell Ethereum For Cash in Nigeria\n\nIf you’re looking to sell your Ethereum in Nigeria, several options are available. One popular option is to use a crypto trading mobile app, Breet. Breet is a Nigerian-based OTC crypto trading app that allows you to convert Ethereum to naira , convert it to fiat currency and withdraw straight to your local bank account free of charge. Let me walk you through the steps of using Breet to sell Ethereum for Naira.\n\nStep 1: Download and Install Breet\n\nTo use Breet, you must first download and install the app on your mobile device. The mobile app is available for Android and iOS devices, and you can download it from the respective app stores.\n\nStep 2: Register and Verify Your Account\n\nOnce you’ve installed the app, you must create an account with Breet. To register, you’ll need to provide your name, email address, phone number, and password. You’ll also need to complete the app’s KYC (Know Your Customer) process by submitting a government-issued ID and a selfie.\n\nStep 3: Generate an Ethereum Wallet Address\n\nOnce your account is verified, you need to generate an Ethereum wallet address to receive crypto. To do this, click on ETHEREUM from the app’s dashboard. This will then open up the Ethereum trade page. Click on ‘Generate Wallet Address’. You’ll then be provided with a unique Ethereum address that you can use to transfer your Ethereum from your external wallet.\n\nStep 4: Send Ethereum To Your Wallet Address:\n\nThe Ethereum wallet address acts just like a bank account number. All you need to do is send your address to the sender or your external wallet through the multiple options available.\n\nStep 5: Sell Ethereum for Cash\n\nSend the amount of Ethereum you want to sell and select “Naira” as the currency you wish to receive. Breet will automatically calculate the amount of Naira you will receive based on the current market rate.\n\nOnce your Ethereum is sent into your Breet Ethereum wallet, you need to wait for at least three confirmations from the blockchain network. Once confirmation is complete, your transaction is tagged as successful, and your funds will reflect in your Breet Naira wallet.\n\nStep 6: Withdraw Your Naira to Your Bank Account\n\nAfter selling your Ethereum for Naira, you can withdraw your funds directly to your Naira bank account. Breet offers free and instant withdrawals to any Nigerian bank account. To withdraw your funds, select the “Withdraw” option, enter the amount you want to withdraw, and select your bank account from the list of available options. Click on “Withdraw” to complete the transaction.\n\nIf your automatic settlement feature is turned on from settings, your funds are automatically withdrawn to your provided local bank account after completing the transaction.\n\nConclusion\n\nTrading Ethereum is profitable, but it is not without risks. Using a crypto trading app like Breet can be a convenient and hassle-free way to sell your Ethereum for cash in Nigeria. With Breet, you can convert your Ethereum to Naira and withdraw your funds straight to your Naira bank account within minutes and free of charge."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vbmV3c2doYW5hLmNvbS5naC9pbmZzdG9uZXMtbGF1bmNoZXMtZXRoZXJldW0tdmFsaWRhdG9yLXNlcnZpY2Uv0gFHaHR0cHM6Ly9uZXdzZ2hhbmEuY29tLmdoL2luZnN0b25lcy1sYXVuY2hlcy1ldGhlcmV1bS12YWxpZGF0b3Itc2VydmljZS8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "InfStones launches Ethereum validator service - News Ghana",
        "content": "Shanghai Upgrade may not simplify staking on Ethereum – InfStones fills the gap, allows users to increase computing power with APIs and cloud-based nodes\n\nDALLAS, Texas, April. 12th, 2023 at 8:00 am – Today, InfStones, a leading blockchain infrastructure provider offering scalable PaaS, announced the release of its highly secure Ethereum validator service, designed to arrive just in time to serve the growing needs that will arise as a result of Ethereum’s long-awaited Shanghai upgrade which is currently expected to take place in April 2023.\n\nimage.png\n\nWith more than 16.4 million ETH currently staked on the Ethereum network, the eagerly awaited Shanghai upgrade aims to inspire numerous users who previously harbored reservations about participating in ETH staking to get involved. This software upgrade is designed to enable stakers to finally withdraw their ETH and all accumulated rewards, spanning the past three years since the pivotal Beacon Chain launch when Ethereum formally started the transition away from its original Proof of Work (PoW) consensus mechanism to Proof of Stake (PoS). Up until this point, ETH stakers have had the ability to stake their ETH directly on the network without being able to unstake their tokens.\n\nInfStones aims to address the heightened market demand for staking on Ethereum that will be spurred by the Shanghai upgrade. Recognizing the potential impact of the upgrade on the Ethereum ecosystem, InfStones is committed to offering a seamless and secure staking experience, allowing users to benefit from the network’s expanded capabilities. By providing a cutting-edge, feature-rich platform that simplifies the staking process, InfStones aims to empower a wider range of participants to join the Ethereum network while fostering increased decentralization and contributing to the overall growth and success of the Ethereum community.\n\nWhile the Shanghai hard fork will enable the unstaking of locked assets on Ethereum, one important technical issue still remains, which InfStones is helping to address with its validator service – Ethereum has not yet solved its scalability problem. This has led to many technical bottlenecks in the past, and will continue to be a significant barrier in the future. Institutional entities who intend on either setting up thousands of new validators or withdrawing their funds by closing all their existing validators will probably be doing so one at a time. In addition, most of the popular ETH staking platforms are both centralized and custodial, which goes against the Ethereum protocol’s vision of decentralization that it was intended to support.\n\nHow InfStones works\n\nInfStones’ cutting-edge validator service presents an elegant solution to these challenges and will enable an optimal user experience for staking on Ethereum after the Shanghai Upgrade. By harnessing APIs and cloud-based nodes, it amplifies users’ computational capabilities. The sophisticated scalability platform delivers exceptional throughput and decentralization, tapping into the strength of over 80 interconnected blockchains. This ensures unparalleled uptime and network stability, while empowering users to operate their own nodes and independently confirm and verify transactions after utilizing the setup service. The robust blockchain infrastructure provided by InfStones effectively eliminates bottlenecks arising from heavy traffic on Ethereum during peak periods of staking withdrawals or concurrent blockchain transactions.\n\nOne-click setup\n\nAs the longest-running validator service provider in the global market, InfStones boasts an impressive track record of operating Ethereum validators for over 19,000 consecutive hours and counting. To stake ETH on the InfStones platform, users can effortlessly set up their own validator node with the simple click of a button. The platform is crafted to enable a seamless experience with minimal need for customer support. However, a dedicated and experienced customer service team stands ready to assist 24/7, should any issues arise. Upon the implementation of the Shanghai upgrade, users will be able to conveniently withdraw all of their ETH staked through the InfStones platform at any time by the simple click of a button.\n\nBatch up to 1000 validators\n\nThe InfStones platform caters to large, institutional entities by offering the capability to batch up to 1,000 validators for ETH staking in a single click. Upholding a high standard of security and trust, InfStones never gains access to users’ wallets. Instead, it establishes a direct connection to the smart contracts that facilitate staking, ensuring a seamless non-custodial and secure experience for all participants.\n\nStake less than the current minimum of 32 ETH\n\nMany platforms require a minimum of 32 ETH (presently valued at approximately $53,000 USD) to partake in ETH staking. However, following the Shanghai Upgrade, InfStones will accommodate staking amounts below this threshold. By offering this flexibility, InfStones opens the door for participants with less than 32 ETH to join the Ethereum PoS network as well.\n\nCommenting on InfStones’ Ethereum validator service, Founder and CEO Dr. Zhenwu Shi remarked, “Our Ethereum validator service enables anyone to securely launch Ethereum validator nodes for staking purposes with just a few effortless clicks.”\n\nUsers staking ETH through InfStones’ validator service retain complete control over their tokens at all times, thanks to the utilization of non-custodial wallets for staking on the InfStones platform and the absence of a centralized token pool. Additionally, users can access detailed reports of all their validators and reward details around the clock.\n\nProminent Web3 industry leaders such as Binance, Lido, imToken, and Gate place their trust in InfStones’ Ethereum validator service. With more than 20,000 Ethereum validators already established and a flawless record of zero slashes, the company has garnered significant support, previously securing over $110 million in funding from top-tier investors like Softbank and GGV Capital."
    }
]