[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1jb25zb2xpZGF0ZXMtMTcyMC_SAUpodHRwczovL3d3dy5uZXdzYnRjLmNvbS9hbmFseXNpcy9ldGgvZXRoZXJldW0tcHJpY2UtY29uc29saWRhdGVzLTE3MjAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Price Consolidates Below $1,720: What Could Trigger Another Decline? - NewsBTC",
        "content": "Ethereum price is still struggling below $1,720 against the US Dollar. ETH could continue to move down if it stays below $1,700 and $1,720.\n\nEthereum is slowly moving higher from the $1,620 support zone.\n\nThe price is trading below $1,700 and the 100-hourly Simple Moving Average.\n\nThere is a key bearish trend line forming with resistance near $1,720 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could struggle to recover above the $1,700 and $1,720 resistance levels.\n\nEthereum Price Faces Uphill Task\n\nEthereum’s price remained in a bearish zone below the $1,720 resistance. ETH extended its decline below the $1,660 level, similar to Bitcoin.\n\nThere was a spike below the $1,630 support. The price tested the $1,620 zone. A low is formed near $1,620 and the price is now attempting a recovery wave. There was a move above the $1,640 and $1,650 levels. The bulls pushed the price toward the 50% Fib retracement level of the downward move from the $1,748 swing high to the $1,620 low.\n\nEther is still trading below $1,700 and the 100-hourly Simple Moving Average. There is also a key bearish trend line forming with resistance near $1,720 on the hourly chart of ETH/USD.\n\nImmediate resistance is near the $1,700 level or the 100-hourly Simple Moving Average. It is close to the 61.8% Fib retracement level of the downward move from the $1,748 swing high to the $1,620 low. The next major resistance is near the $1,720 level and the trend line.\n\nSource: ETHUSD on TradingView.com\n\nA proper move above the $1,700 and $1,720 resistance levels might start a steady recovery wave. The next resistance sits near $1,775, above which Ethereum could rise toward the $1,820 level. Any more gains above the $1,820 resistance zone might send the price toward the $1,850 resistance.\n\nFresh Decline in ETH?\n\nIf Ethereum fails to clear the $1,700 resistance, it could start another decline. Initial support on the downside is near the $1,640 level.\n\nThe next major support is near the $1,620 level. If there is a break and close below the $1,620 support, the price could dive toward the $1,550 support. Any more losses may perhaps send the price toward the $1,500 zone.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 level.\n\nMajor Support Level – $1,620\n\nMajor Resistance Level – $1,700\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjM1MTEwL2ZyYXgtZmluYW5jZS10by1sYXVuY2gtZXRoZXJldW0tbGF5ZXItMi1uYW1lZC1mcmF4Y2hhaW7SAV9odHRwczovL3d3dy50aGVibG9jay5jby9hbXAvcG9zdC8yMzUxMTAvZnJheC1maW5hbmNlLXRvLWxhdW5jaC1ldGhlcmV1bS1sYXllci0yLW5hbWVkLWZyYXhjaGFpbg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "Frax Finance to launch Ethereum Layer 2 named Fraxtal - The Block",
        "content": "The team behind Frax Finance, known for creating the Frax stablecoin, has unveiled its strategy to introduce a Layer 2 blockchain: Fraxtal (originally called Fraxchain).\n\nThe team said the network will be directed towards creating a smart contract platform with a strong emphasis on decentralized finance. “Fraxchain essentially represents the culmination of the entire Frax ecosystem and all of the traction and usage that we’ve gained,” Frax founder Sam Kazemian told The Block.\n\nThe network is expected be ready by the end of the year. Fraxtal's governance will be led by the holders of Frax Shares (FXS) tokens. The network will employ the use of the Frax stablecoin and Frax Ether, Frax's liquid staking derivative, for transaction fees. Furthermore, fees generated by the roll-up network could be partly burned or redirected back to the Ethereum mainnet to be distributed among stakers of FXS governance token, Kazemian added.\n\nIncorporating a Layer 2 rollup model in its design, Fraxtal will publish state roots to the Ethereum mainnet for securing the network.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nThe network will incorporate decentralized sequencers. These sequencers are specialized nodes responsible for ordering transactions into batches in a rollup network. They will be operated by any entity chosen via a governance vote. This feature, according to Kazemian, will differentiate Fraxtal from other Layer 2 solutions on Ethereum, which typically depend on a single sequencer.\n\n“Fraxchain proposes a solution where sequencer roles can be auctioned off and rotated, creating a decentralized sequencer base. If a sequencer is forced to shut down, it would allow the next elected sequencer to pick up from where the previous one left off,” Kazemian said."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vYW1iY3J5cHRvLmNvbS93aHktZXRoZXJldW1zLXByaWNlLXJpc2UtaXMtbm90LWNhdXNlLWZvci1jZWxlYnJhdGlvbi15ZXQv0gFUaHR0cHM6Ly9hbWJjcnlwdG8uY29tL3doeS1ldGhlcmV1bXMtcHJpY2UtcmlzZS1pcy1ub3QtY2F1c2UtZm9yLWNlbGVicmF0aW9uLXlldC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 17 Jun 2023 07:00:00 GMT",
        "title": "Why Ethereum’s price rise is not cause for celebration yet - AMBCrypto News",
        "content": "Ethereum’s price increased by nearly 2% in the last 24 hours.\n\nHowever, market indicators were bearish, suggesting a change in trends.\n\nThe Binance and Coinbase episode with the US Securities Exchange Commission caused havoc in the crypto industry. It caused a decline in the supply of Bitcoin [BTC] and Ethereum [ETH] on Binance, suggesting that investors were losing confidence in CEXes.\n\nRead Ethereum’s [ETH] Price Prediction 2023-24\n\nEthereum investors’ confidence in Binance declined\n\nGlassnode’s latest tweet revealed that after the SEC incident, investors actively withdrew their ETH and BTC from Binance. As per the tweet, Ethereum’s balance on Binance was around 4.56 million to 4.2 million.\n\nSince the SEC charges, the #Bitcoin and #Ethereum Balance on #Binance has declined by -48K BTC and -360K ETH respectively. ? BTC Balance: 706K BTC to 658K BTC (-48K BTC)\n\n? ETH Balance: 4.56M ETH to 4.2M ETH (-360K ETH) pic.twitter.com/rOKZpfgJwn — glassnode (@glassnode) June 15, 2023\n\nThis indicated that they were losing faith in the CEX. In order to keep their holdings safe, investors were moving their assets to self-custody, or DEXes. This was evident from Dune’s data.\n\nAfter a decline, ETH’s volume on DEXes registered an uptick, as per the chart ETH’s DEX volume has increased on multiple projects such as Curve [CRV], Uniswap [UNI], and more since 11 June.\n\nEthereum’s revenue has plummeted\n\nIt was interesting to see that ETH generated the highest revenue in Q1, driven by its high usage and gas fees. According to Messari’s recent tweet, Ethereum’s revenue was $457 million, almost 2.8 times the combined revenue of all other featured L1s.\n\n.@Ethereum generated the highest revenue in Q1, driven by its high usage and gas fees. Its revenue was $457M, almost 2.8x the combined revenue of all other featured L1s.@Hedera had the most significant revenue growth, up 489% QoQ, driven by its Consensus Service. pic.twitter.com/ybTQJhIq7I — Messari (@MessariCrypto) June 16, 2023\n\nHowever, things changed in the second quarter of this year. Token Terminal’s data revealed that ETH’s revenue had declined. After spiking on 5 May 2023, Ethereum’s revenue plummeted sharply, which was not good for the blockchain.\n\nETH investors had a good day\n\nThough ETH’s revenue declined, the token’s price moved the other way. According to CoinMarketCap, ETH’s price has increased by nearly 2% in the last 24 hours. At the time of writing, it was trading at $1,665.31, with a market capitalization of over $200 billion.\n\nAs per CryptoQuant, Ethereum’s Relative Strength Index (RSI) was in an oversold position. This might have increased buying pressure and pushed up the token’s price. Ethereum’s exchange reserve was also green, suggesting that the token was not under selling pressure.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nHere is the catch\n\nA look at ETH’s daily chart suggested that the uptrend might continue as the market indicators looked bearish. The MACD displayed a bullish upperhand in the market.\n\nEthereum’s Chaikin Money Flow (CMF) also registered a downtick. Additionally, its Exponential Moving Average (EMA) Ribbon also pointed out that the bears were leading the market, as the 20-day EMA was below the 55-day EMA."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1uZXR3b3JrLXVwZ3JhZGUtYW5kLXVwdGljay1pbi1hcmJpdHJ1bS1hY3RpdmUtdXNlcnMtY291bGQtdHJpZ2dlci1hbi1hcmItcHJpY2UtcmV2ZXJzYWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "Ethereum network upgrade and uptick in Arbitrum active users could trigger an ARB price reversal - Cointelegraph",
        "content": "While the Arbitrum governance token ARB has been in a consistent downturn since the airdrop in late March, its ecosystem shows healthy growth.\n\nA recent Nansen report shows that Arbitrum’s activity improved after the airdrop, stabilizing “at a level higher” than before the airdrop. The daily active users, gas fees and transaction count have maintained consistently higher levels since April 2023.\n\nThe gap between the number of active users on Arbitrum and Optimism widened after the Aribtrum airdrop, closing in on Ethereum.\n\nDaily active users of Arbitrum, Ethereum and Optimism (past 6 months). Source: Nansen\n\nThe trading volume on Arbitrum-based decentralized exchanges paints a similar picture, showing an evident rise in volume after the airdrop.\n\nThe trading volume of DEXs on Arbitrum. Source: DefiLlama\n\nMoreover, Nansen’s report shows that ARB airdrop recipients only accounted for around 5% of the activity on the blockchain and that Arbitrum has attracted considerably more new users after the airdrop.\n\nPotential catalysts for ARB upside\n\nMoreover, an upcoming update on Ethereum in the second half of 2023, dubbed as Cancun-Deneb (Dencun), will include EIP-4844 (proto-Danksharding), which will reduce the transaction fees on Arbitrum, increasing the blockchain’s value proposition.\n\nAdditionally, the Arbitrum Foundation recently revealed accumulated data from its sequencer, a part of the layer-2 fees paid by users for posting the data onto Ethereum.\n\nThe foundation has decided to pass on the sequencer’s earnings, totaling 3,352 Ether (ETH), or $5.4 million, to the Arbitrum DAO, and the ETH will be managed by ARB holders.\n\nIn total:\n\n\n\nThe Arbitrum DAO has accumulated ~3,352 ETH in revenue,\n\nThe Sequencer will be refunded ~5,954 ETH which is the cost for posting all data to the Ethereum network.\n\n\n\nHow exciting is that? — Arbitrum (,) (@arbitrum) May 10, 2023\n\nA revenue source for the DAO — a decentralized autonomous organization — can potentially create yields for ARB holders if the community votes to direct the rewards to holders. It remains to be seen how the funds will be managed by the foundation and the DAO.\n\n“Smart money” is holding ARB\n\nNansen’s data shows that the “smart money” and funds that accumulated ARB after the airdrop still haven’t sold, which is encouraging. The on-chain analytics firm tags Ethereum addresses of high-volume and profitable traders as “smart money.”\n\nFunds (purple) and smart wallets (green) are still holding ARB. Source: Nansen\n\nThe funding rate for ARB perpetual swap contracts turned negative like the rest of the crypto market after the Securities and Exchange Commission (SEC) brought lawsuits against the industry’s largest exchanges, Binance and Coinbase, per CoinGlass data.\n\nRelated: Deposits to zkSync surpass $110M as its DeFi ecosystem explodes\n\nFunding rates are paid by perpetual swap traders for shorting or longing an asset depending on its demand. If the demand for short orders is higher, it is deemed more expensive, so traders on the short side pay longs.\n\nCurrently, the funding rates are positive, suggesting that futures traders are bullish on ARB, which raises a yellow flag for late buyers.\n\nFunding rate across the perpetual swap markets. Source: CoinGlass\n\nThe ARB/USD pair has observed a downward trend since the token’s launch in March. The compression of the channel shows the possibility of a descending wedge pattern, which has a tendency to break to the upside. Consecutive daily closes above the wedge could propel the price toward 2023 highs around $1.80.\n\nARB/USDT daily price chart. Source: TradingView\n\nOn the ETH scale, ARB broke below May’s low of 0.00057 ETH after the SEC’s lawsuits. At the time of publication, the token was trading around resistance level at 0.00060 ETH. A breakout above this level could accelerate ARB further to the upside.\n\nARB/ETH 4-hour price chart. Source: GeckoTerminal\n\nTechnically, ARB shows the possibility of a negative trend reversal. Nevertheless, the upcoming Dencun update on Ethereum and decisions taken by the Arbitrum Foundation in directing revenue from the L2 rollup will ultimately dictate ARB’s price action.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA2LzE2L3doeS1iaXRjb2luLWV0aGVyZXVtLWFuZC1odXQtOC1taW5pbmctY29ycC1hcmUtcmlzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "Why Bitcoin, Ethereum, and Hut 8 Mining Stock Are Rising Today - The Motley Fool",
        "content": "What happened\n\nSeveral cryptocurrencies and crypto stocks rose today after BlackRock (BLK 0.54%), the largest asset manager in the world, filed to launch a spot Bitcoin exchange-traded fund (ETF).\n\nSince late afternoon yesterday, the price of Bitcoin traded 4.5% higher as of 3:42 p.m. ET today. The price of the world's second-largest cryptocurrency, Ethereum, traded 3.9% higher, while shares of the Bitcoin miner Hut 8 Mining (HUT) were up 14.5%.\n\nSo what\n\nBitcoin and other cryptocurrencies have struggled this week, dipping after the Federal Reserve indicated Wednesday that it thinks it will need to raise interest rates two more times this year.\n\nRiskier assets like Bitcoin typically don't perform well in a rising-rate environment because investors can get higher yields in safer assets. Cryptocurrencies have rallied this year on the belief that the Fed would soon be done with its aggressive rate-hiking.\n\nToday, though, investors seemed to overlook these concerns as BlackRock submitted a filing to the Securities and Exchange Commission (SEC) to launch a Bitcoin ETF, which would be the first spot crypto ETF if approved.\n\nDespite the plan's rejections in the past, some experts believe the proposal has a chance because BlackRock wants to enter a \"surveillance-sharing agreement,\" meaning it would share data about trading activity and their customers, in an effort to prevent market manipulation."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vdGhlZGVmaWFudC5pby9ldGhlcmV1bS1yZXN0YWtpbmctcHJvdG9jb2wtZWlnZW5sYXllci1sYXVuY2hlcy1vbi1tYWlubmV00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 19:57:48 GMT",
        "title": "Ethereum ‘Restaking’ Protocol EigenLayer Launches On Mainnet - The Defiant - DeFi News",
        "content": "Aims To Harness Ethereum As Shared Security Layer\n\nBy: Samuel Haig • Loading...\n\nDeFi News\n\nEigenLayer, a highly anticipated “restaking\" protocol for Ethereum, successfully completed the initial guarded stage of its mainnet launch on Wednesday.\n\nUsers can now deposit liquid staking tokens (LSTs) into the protocol, or set up and configure an EigenPod to natively restake ETH. The protocol supports Lido’s stETH, Rocket Pool’s rETH, and Coinbase’s cbETH tokens, with plans to onboard other LSTs in the future.\n\nOnce its rollout is complete, EigenLayer will allow Ethereum stakers to validate third-party services for a yield while simultaneously earning staking rewards for securing the network.\n\n“EigenLayer aims to empower the ecosystem stakeholders and innovate on both the future of shared security, as well as the future of decentralization,” the project said in a blog post.\n\nEigenLayer’s liquid staking pools are currently capped at 3,200 tokens each, with individual deposits limited to 32 tokens per transaction. The creation of new EigenPods will pause once native staking exceeds 9,600 ETH. Withdrawal requests will execute after a seven-day delay.\n\n$32B Market\n\nEigenLayer is seeking to harness Ethereum’s staking ecosystem as a shared security layer, but its success may hinge on its ability to compete with DeFi protocols as a source of additional yield for stakers.\n\nPopular LSTs like stETH and rETH enjoy integrations with a wide range of DeFi protocols, offering holders a variety of strategies for generating yield or accessing liquidity while continuing to accumulate staking rewards.\n\nAlthough Ethereum’s staked capitalization is already $32.5B, only 16% of circulating Ether is staked, suggesting the sector may still have significant room to grow.\n\nRestaking\n\nThe Ethereum network validates code written in its native Solidity programming language that is compatible with the Ethereum Virtual Machine (EVM), Ethereum’s core smart contract engine.\n\nDeFi Alpha Premium Content DeFi Daily | Weekdays\n\nDeFi Alpha Letter | Weekly\n\nDefiant Podcast Transcript | Weekly\n\nInbox Dump | Saturday\n\nWeekly Recap | Sunday Looking for Alpha? Become a premium member of The Defiant and join our DeFi Alpha community. Start for free\n\nEigenLayer allows stakers to also opt-in to validate modules containing non-EVM code, also called “Actively Validated Services (AVSs),” by harnessing Ethereum’s staking ecosystem as a shared security layer.\n\nEigenLayer said the second phase of its launch would introduce “Operators,” which perform validation tasks for AVSs built on the EigenLayer protocol. AVSs will come online later, completing EigenLayer’s mainnet launch.\n\n“Restakers have the flexibility to delegate their staked ETH to Operators or run validation services themselves, effectively becoming an Operator,” EigenLayer said. “Restakers retain agency over their stake and choose which AVSs they opt-in to validate for.”\n\nOperators and restakers face additional penalties if an AVS they secure misbehaves or if they fail to perform validation duties, on top of the regular slashing risks associated with staking.\n\nVitalik Buterin recently warned against protocols seeking to leverage Ethereum’s social consensus mechanism for purposes other than securing the Ethereum network.\n\n“We should be wary of application-layer projects taking actions that risk increasing the ‘scope’ of blockchain consensus to anything other than verifying the core Ethereum protocol rules,” Buterin said in a blog post last month.\n\nSreeram Kannan, EigenLayer’s founder, described Vitalik’s critique as an “excellent analysis,” advocating for restakers to use the protocol for “low-risk” activities.\n\nGovernance\n\nThe protocol’s contracts are upgradeable and pausable. Three multisig governance wallets oversee contract upgrades, pause functionality, and protocol parameter adjustments respectively.\n\nEigenLayer described the setup as a temporary governance solution and said it intends to decentralize in the future. Its multisig signers include Tim Beiko from the Ethereum Foundation, Swapnil Raj from Nethermind, and Ben Rodriguez from Coinbase Cloud.\n\n“These multisigs represent a rudimentary but working system of transparent initial governance, with appropriate checks and balances,” EigenLayer said.\n\nConsenSys and Sigma Prime audited EigenLayer’s code. The project is also offering $2M in bug bounties via Immunefi."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiMmh0dHBzOi8vY29pbmNlbnRyYWwuY29tL2Jlc3QtZXRoZXJldW0tbWluaW5nLXBvb2wv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 17 Jun 2023 07:00:00 GMT",
        "title": "The 3 Best Ethereum Mining Pool Options - CoinCentral",
        "content": "So, you’ve heard that mining Ethereum can be a profitable business. Maybe you even bought an Ethereum mining rig. You may have even considered joining an Ethereum mining pool– which is a group of miners working together to mine Ethereum. Joining a pool helps to lower the volatility of your payouts by providing smaller, more frequent payments rather than a lump sum that you only receive when a block is solved.\n\nHowever, since Ethereum moved to Proof-of-Stake, the network is no longer utilizing mining to keep the network moving. In other words, mining has switched off. Now, Ethereum is secured by validators who stake ETH.\n\nThe following article is preserved in its original form, but please be advised it isn’t relevant beyond simply just being a snapshot of Ethereum’s mining days.\n\nChoosing the Best Ethereum Mining Pool\n\nWhen choosing a mining pool, it’s important to join one with low fees that bring reliable returns. You should also consider the server location of the pool when deciding which is best for you. The closer your mining rig is to the server, the more efficiently it can mine.\n\nIn this article, we highlight three of the best Ethereum mining pools so you can confidently decide which one to join:\n\nEthpool/Ethermine\n\nEthpool and Ethermine are operated from two different websites but contribute to the same pool. With ~26.8% of the network hash rate power, this pool is the largest one on the Ethereum network. Ethermine currently has over 125,000 miners using the pool software while Ethpool has a little under 1,100.\n\nBoth Ethpool and Ethermine charge a 1% fee on each reward that you receive – one of the lowest fees of the pools researched.\n\nEthermine allows you to set the minimum payment threshold needed to receive your rewards. If you want to receive your payments infrequently, you can set the threshold to the maximum of 10 ETH. Set your threshold to the 0.05 ETH minimum to receive payments more often.\n\nNanopool\n\nNanopool is the third largest Ethereum mining pool with ~14.4% of the network hash rate and over 80,000 miners. The pool fee is also less than most competitors at 1%.\n\nThe default minimum payout threshold using Nanopool is 0.2 ETH, but you’re able to lower and raise the minimum in your settings. The interface is straightforward and simple to use if you’re just getting started.\n\nThe platform also has an extensive help and FAQ section to assist you in getting started. It walks you through how to set up your miner, configure the pool settings, and links you to the appropriate mining clients.\n\nBeyond that, the help section also guides you on which type of hardware is best suited for Ethereum mining. Nanopool recommends that you use an AMD GPU driver 15.12. You can mine with a CPU but your rewards will be few and far between, making it not worth the effort.\n\nNanopool also supports mining for Ethereum Classic, Siacoin, ZCash, Monero, Pascal, and Electroneum.\n\nSome miners have reported that their hash rate through Nanopool is significantly less (sometimes up to a 10% difference) than mining in other pools or on their own. The Nanopool team addresses this in their FAQ section. There are two main reasons for these differences:\n\nThe hashrate the Nanopool shows fluctuates because it’s based on the number of submitted shares. You should instead check what the average is over a 24-hour period. If your hashrate drops to zero, it may have been caused by corrupted DAG files on your miner. If so, stop the miner, delete the DAG files, and restart.\n\nOverall, the community seems to trust and like this pool.\n\nDwarfpool\n\nOnce a market leader, Dwarfpool is now smaller with only ~2.4% of the Ethereum network hash rate. Like Ethpool/Ethermine and Nanopool, Dwarfpool charges a 1% fee on block rewards.\n\nYour account balance needs to reach 1.01 Ethereum before payout and the pool pays out 6 times per day. Unless you’re mining with a powerful mining rig or using multiple miners, you may want to join a pool with a lower payout minimum.\n\nDwarfpool also supports the mining of other coins such as Monero, Zcash, Expanse, and Groestlcoin.\n\nConclusion\n\nYou really can’t go wrong joining any of the top mining pools. Most of the largest ones are fairly reliable and have a similar fee structure. In the end, it’s important to choose the one that you’re most comfortable using. Once you’ve started making a consistent profit, you’ll need to find the best way to sell the Ethereum that you’ve mined."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vdS50b2RheS90aGlzLWV0aGVyZXVtLXVwZ3JhZGUtbWlnaHQtY2hhbmdlLW5mdHMtc2VnbWVudC1mb3ItZ29vZC1oZXJlcy1ob3fSAVZodHRwczovL3UudG9kYXkvdGhpcy1ldGhlcmV1bS11cGdyYWRlLW1pZ2h0LWNoYW5nZS1uZnRzLXNlZ21lbnQtZm9yLWdvb2QtaGVyZXMtaG93P2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 17 Jun 2023 07:00:00 GMT",
        "title": "This Ethereum Upgrade Might Change NFTs Segment for Good, Here's How - U.Today",
        "content": "Advertisement\n\nAn eccentric Ethereum Improvement Proposal (EIP) introduced one month ago can totally change the technical design and economics of the segment of non-fungible tokens (NFTs). Besides paving the way for new generations of NFTs, it can advance the tooling of existing Apes and Mutants.\n\nERC-6551 blurs lines between NFTs, smart contracts and wallets\n\nPresented only five weeks ago, ERC-6551 opens up a plethora of previously unseen opportunities for the NFT and digital identity space. Such conclusion was made by The Spartan Group's VC arm Spartan Labs.\n\nERC-4337 was one of the biggest developments for the wallet space earlier this year.\n\n\n\nBut ERC-6551 is building on that to revolutionise the NFT space. ERC-6551 will change the way we view NFTs and digital identities.\n\n\n\nHere's how, and why you should care 🧵 pic.twitter.com/dHwmXKDmic — Spartan Labs (@TheSpartanLabs) June 16, 2023\n\nThis EIP, co-authored by the founders of CryptoKitties, the first-ever commercially successful NFT collection, allows non-fungible tokens to control ERC-4337-enabled cryptocurrency wallets. For instance, NFTs can make transactions, store assets and, therefore, interact with DeFi protocols just like regular non-custodial wallets.\n\nThe scope of possibilities of ERC-6551-powered NFTs looks really endless. The owner of such NFTs can collect POAPs and display them in a transparent and tamper-proof form.\n\nIn decentralized games, such NFTs can be associated with in-game wallets. This, in turn, will make the gaming experience more immersive for various generations of players.\n\nAs of today, the ERC-6551: Non-fungible Token Bound Accounts proposal is labeled with a \"Draft\" status on Ethereum Foundation's portal for EIPs.\n\nWeb3 media, decentralized messaging, reputation management: Plenty of new NFT use cases\n\nSpartan Labs' researchers indicated a number of other interesting use cases for NFT-powered wallets. They might finally make Web3 publishing platforms mainstream thanks to more democratic content monetization models.\n\nThen, decentralized messengers' interfaces might be upgraded with such NFTs. Traders can even share the addresses of their NFTs to demonstrate their PnL and trade history — and this data cannot be altered, being visible to everyone via explorers.\n\nThis ERC is backward compatible, which means all existing NFTs can be equipped with the full range of ERC-6551 functionalities. This can radically change the narrative in the global NFT ecosystem."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi1ldGgtcHJpY2UtZGlwcy10by1tb250aC1zdXBwb3J0L9IBW2h0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi1ldGgtcHJpY2UtZGlwcy10by1tb250aC1zdXBwb3J0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction: $ETH Price Dips to Multi-Month Support; Best Time To Accumulate? - CoinGape",
        "content": "Ethereum Price Prediction: June has been a challenging month for Ethereum holders, as the altcoin has witnessed a sharp decline of nearly 15% in market value over the past two weeks. Amidst this downturn, Ethereum’s price has recently reached a low of $1624.65, finding support at a long-established trendline. This dynamic support has played a crucial role in sustaining an uptrend for ETH price over the past seven months. Now the question arises: Can buyers initiate a new recovery rally from this point?\n\nAlso Read: Ethereum Leads, Hedera’s Revenue Surges Nearly 500%: Messari’s Q1’23 Report\n\nadvertisement\n\nEthereum Price Daily Chart\n\nA bullish reversal from the ascending trendline could replenish the bullish momentum in ETH\n\nThe 100-and-200-day EMA moving near $1775 and $1700 increases the resistance power of these levels.\n\nThe intraday trading volume in Ether is $5.8 Billion, indicating a 37.5% loss.\n\nSource-tradingview\n\nRecent Reversal and Buying Opportunity:\n\nThe falling Ethereum price has found reliable support at the ascending trendline of the daily chart. Historical data reveals that the price has rebounded from this support trendline on three occasions, suggesting active accumulation by buyers during dips.\n\nOn June 15th, the ETH price rebounded from the rising trendline, experiencing a 2.3% surge and reaching a current trading level of $1668. This reversal presents another opportunity for buyers to capitalize on the dip, with a suggested stop loss set at $1625.\n\nShould the coin price maintain sustainability above the trendline, buyers could gradually drive a recovery above the $2140 peak.\n\nCan $ETH Price Revisit the $2140?\n\nA retest of the long-established support trendline holds a high probability of reigniting a bullish momentum, leading to a new recovery phase. However, for traders seeking a safer entry point, waiting for a breakout above a significant resistance level is advisable. A potential breakout beyond the $1775 barrier would offer buyers additional confirmation of a bullish recovery, potentially driving the price toward the previous swing high of $2138.\n\nRelative Strength Index: The RSI slope on the daily timeframe currently slopes below 40%, indicating a high bearish momentum. Traders can wait for a breakout above $1775 to gain a stronger edge in their decision-making process.\n\nExponential Moving Average: t a bearish crossover between the 20-day and 100-day EMAs could further intensify selling pressure in the market."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNi8xNi9ldGhlcmV1bS1yaXZhbC1wb2xrYWRvdC1kb3QtbGF1bmNoZXMtbmV3LWdvdmVybmFuY2Utc3lzdGVtLWJ1dC10b2tlbi1wcmljZS1zbHVtcHMtYW1pZC1iZWFyaXNoLW1hcmtldC10cmVuZC_SAZEBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDYvMTYvZXRoZXJldW0tcml2YWwtcG9sa2Fkb3QtZG90LWxhdW5jaGVzLW5ldy1nb3Zlcm5hbmNlLXN5c3RlbS1idXQtdG9rZW4tcHJpY2Utc2x1bXBzLWFtaWQtYmVhcmlzaC1tYXJrZXQtdHJlbmQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Rival Polkadot (DOT) Launches New Governance System, but Token Price Slumps Amid Bearish Market Trend - The Daily Hodl",
        "content": "Ethereum (ETH) challenger Polkadot (DOT) is revamping its decision-making system with the introduction of a new decentralized and open governance platform, OpenGov.\n\nThe launch of OpenGov places full control of the network in the hands of the Polkadot community by allowing holders of native token DOT to propose referenda.\n\n“Polkadot OpenGov, the pinnacle of governance systems in Web3, has officially arrived! Welcome to the new era of fully autonomous, transparent, & efficient decision-making where the entire process is handed over to the DOT community.”\n\nOpenGov was first launched on Polkadot’s Canary Network, Kusama (KSM), which saw improved participation from the community.\n\n“The early signs are positive when it comes to deeper engagement. In the past six months, Polkadot’s canary network Kusama network has seen 200 proposals submitted, a four-fold increase compared to the same period last year.”\n\nPolkadot says OpenGov will also protect the network from bad actors as it bolsters the engagement of stakeholders.\n\n“OpenGov is a crucial development for the Polkadot community. Protocols that are not sufficiently decentralized can fall prey to malicious operators. OpenGov does two things: it empowers DOT holders and protects the network.”\n\nDespite the development, DOT remains in the red territory amid the general bearish sentiment in the crypto market. The altcoin is currently trading for $4.37, down by 5.63% over the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8venljcnlwdG8uY29tL2V0aGVyZXVtLWRldnMta2ljay1hZ2FpbnN0LXVuaXN3YXBzLXY0LW9wZW4tc291cmNlLWZhaWxlZC1wcm9taXNlL9IBW2h0dHBzOi8venljcnlwdG8uY29tL2V0aGVyZXVtLWRldnMta2ljay1hZ2FpbnN0LXVuaXN3YXBzLXY0LW9wZW4tc291cmNlLWZhaWxlZC1wcm9taXNlLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 17 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Devs Kick Against Uniswap’s V4 Open Source “Failed” Promise - ZyCrypto",
        "content": "Advertisement\n\nUniswap’s new upgrade has sparked a new controversy regarding its “open source” description, with developers saying “it is not as advertised.”\n\nThe company released its fourth version on a Business Source License, giving room for critics due to its four-year open-source period.\n\nUniswap has responded to critics explaining that four years is not a long time to balance incentivizing innovation and giving out exclusive rights.\n\nThis week, Uniswap’s developers noted that the new version of the decentralized exchange (DEX) will offer users limitless possibilities; while that may be true, some promises were not.\n\nPrior to the launch of Uniswap’s V4, the management team made several promises from the increased utility of the exchange to its open-source nature which attracted the attention of developers. The promise of it being open-source has been called a “misrepresentation” by a cross-section of Ethereum’s community.\n\nThe V4 was released as a Business Source License (BSL), which means that its code is open to the public and can be copied, reproduced, and redistributed, but there’s a caveat. All these can only be done after four years when it converts to a General Purpose License (GPL).\n\nLefteris Karapetsas, an Ethereum developer and founder of Rotki, expressed his displeasure stating that “Uniswap decided to go with a Business Source License (BSL), continuing what they did with v3. The reason is they don’t understand open source, and they believe their moat is their code which is wrong.” He was the first to call out Uniswap on Twitter and urged them to use the proper terminology as this “is insulting to actual open-source software.”\n\nAnother dev, Scott Lewis, pointed out that Unisawap’s V4 is a four-year proprietary license adding that “If anyone else misrepresented the truth like this, they would be torn to shreds. That’s the power of being powerful.”\n\nAdvertisement\n\nUniswap defend their “false” claims\n\nHayden Adams the founder of Uniswap alongside his development team addressed the controversy on YouTube. The group noted that the four-year period is not as long time as it appears, and it strikes a healthy balance between “incentivizing innovation and giving exclusive rights to the protocol, which has precedents in ‘normal’ settings as well.”\n\nGabriel Shapiro describes it as a tax on innovation, explaining further that it would be difficult for young devs to navigate while building from scratch.\n\n“Anyone who’s looked at BSL code even once, and then later codes something similar, is at a risk of catching a copyright claim,” he added.\n\nDespite the criticisms meted out against Uniswap, many have hailed the V4 for rolling out a new smart contract termed “hooks” which lets developers expand liquidity pools increasing customizability."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vbm9ydGhmb3J0eW5ld3MuY29tL2NhdGVnb3J5L2hvdy10by9tZW1wb29sLXNlY3VyaXR5LWFuZC1hbnRpLXNwYW0tbWVhc3VyZXMtcHJvdGVjdGluZy10aGUtbmV0d29yay_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 17 Jun 2023 07:00:00 GMT",
        "title": "Mempool Security and Anti-Spam Measures: Protecting the Network - North Forty News",
        "content": "Blockchain networks such as Ethereum rely on the mempool to store and manage pending transactions before they are added to the blockchain. However, the mempool is vulnerable to spam attacks and transaction flooding, which can compromise the network’s performance and security. In this article, we will explore the measures that can be taken to protect the Ethereum mempool from spam attacks and ensure its consistency and resilience.\n\nPreventing Spam Attacks and Transaction Flooding in Mempool\n\nSpam attacks and transaction flooding can overload the mempool and prevent legitimate transactions from being processed. To prevent such attacks, Ethereum nodes can implement anti-spam measures that limit the number of transactions that can be added to the mempool per second. These measures can include the use of transaction fees, which incentivize miners to prioritize transactions with higher fees, and gas limits, which limit the computational resources that can be used to process transactions.\n\nAnother way to prevent spam attacks is to implement transaction throttling, which limits the number of transactions that can be sent by a single user within a certain time period. This can prevent malicious users from flooding the network with a large number of transactions. Additionally, Ethereum nodes can implement transaction verification mechanisms that check the validity of incoming transactions. These mechanisms can include signature verification, input/output validation, and other checks to ensure that incoming transactions are legitimate.\n\nTransaction Validity Checks and Mempool Consistency Verification\n\nTo ensure the consistency and security of the mempool, Ethereum nodes can implement transaction validity checks that verify the correctness and completeness of incoming transactions. These checks can include syntax validation, nonce verification, and other cryptographic checks that ensure that the transaction has not been tampered with or double-spent. Additionally, nodes can implement mempool consistency verification mechanisms that check the consistency of the mempool with the blockchain state.\n\nMempool consistency verification can be done by comparing the set of transactions in the mempool with the set of transactions in the blockchain state. If there are any inconsistencies, the node can reject the incoming transaction and notify the user. This mechanism can prevent the inclusion of invalid transactions in the blockchain and ensure that the mempool is consistent with the blockchain state.\n\nDoS Protection Mechanisms for Mempool and Node Resilience\n\nDenial-of-service (DoS) attacks can overload the mempool and prevent legitimate transactions from being processed. To protect against such attacks, Ethereum nodes can implement DoS protection mechanisms that limit the number of incoming requests and connections. These mechanisms can include rate limiting, connection throttling, and other techniques that prevent the node from being overwhelmed by incoming requests.\n\nAdditionally, nodes can implement resiliency mechanisms that ensure that the node can recover from DoS attacks and other types of failures. These mechanisms can include redundancy, failover, and other techniques that ensure that the node can continue to operate even in the face of attacks or failures.\n\nAddressing Mempool Bloat and Potential Exploits\n\nThe mempool can become bloated with a large number of pending transactions, which can lead to slower transaction processing times and increased risk of potential exploits. To prevent mempool bloat, Ethereum nodes can implement transaction eviction mechanisms that remove stale or low-priority transactions from the mempool. These mechanisms can include time-based eviction, fee-based eviction, and other techniques that prioritize high-value transactions and remove low-value or expired transactions.\n\nAdditionally, nodes can implement security measures that prevent potential exploits such as transaction spamming, transaction malleability, and other types of attacks. These measures can include transaction filtering, input/output validation, and other techniques that ensure that incoming transactions are legitimate and secure.\n\nConclusion\n\nIn conclusion, the Ethereum mempool is a critical component of the Ethereum network that must be protected from spam attacks, DoS attacks, and potential exploits. To ensure the security and consistency of the mempool, Ethereum nodes can implement a variety of anti-spam measures, transaction validity checks, DoS protection mechanisms, and other security measures. By implementing these measures, the Ethereum network can remain secure, resilient, and reliable."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy8zLWtleS1ldGhlcmV1bS1wcmljZS1tZXRyaWNzLXBvaW50LXRvLWdyb3dpbmctcmVzaXN0YW5jZS1hdC0xNzUw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "3 key Ether price metrics point to growing resistance at the $1,750 level - Cointelegraph",
        "content": "Ether’s price plunged 7% between June 14 and June 15, reaching its lowest level in three months and impacting investors’ view that the altcoin was en-route to turning $2,000 to support.\n\nIt is worth noting that the $1,620 bottom represents a $196 billion market capitalization for Ether (ETH), which is higher than PetroChina’s $186 billion and not far from chipmaker AMD’s $198 billion.\n\nBeing the 66th largest global tradable asset is no small feat, especially considering that the cryptocurrency is merely eight years old and does not return any kind of direct profit for the project’s maintenance. On the other hand, securities enjoy the benefits of corporate earnings and eventual government subsidies, so perhaps investors should be concerned by the recent price drop in Ether.\n\nEther price pressured, succumbs to regulation and lowered network activity\n\nRegulatory pressure helped to subdue investors’ appetite for Ether as the Securities and Exchange Commission proposed a rule change regarding the definition of an exchange. Paul Grewal, chief legal officer of the Coinbase exchange, has pushed back against the proposed change, claiming that it violates the Administrative Procedure Act.\n\nMore concerningly, decentralized application (DApp) usage on the Ethereum network failed to gain momentum despite gas fees plummeting by 75%. The seven-day average transaction cost dropped to $4 on June 14, down from $16 one month prior. Meanwhile, DApp active addresses declined by 18% in the same period.\n\nThe 30-day Ethereum DApp activity. Source: DappRadar\n\nNotice that the decline happened across the board, affecting decentralized finance, nonfungible token marketplaces, gaming and collectibles alike. Curiously, the total value locked (TVL), which measures the deposits locked in Ethereum’s smart contracts, declined by a mere 2% versus mid-May to 14.6 million ETH, according to DefiLlama.\n\nTo analyze the odds of Ether’s price breaking below the $1,650 support, one should check for a reduced ETH futures premium and increased costs for protective put options.\n\nEther quarterly futures are popular among whales and arbitrage desks. However, these fixed-month contracts typically trade at a slight premium to spot markets, indicating that sellers are asking for more money to delay settlement.\n\nAs a result, ETH futures contracts in healthy markets should trade at a 5 to 10% annualized premium — a situation known as contango, which is not unique to crypto markets.\n\nEther 2-month futures annualized premium. Source: Laevitas\n\nAccording to the futures premium, known as the basis indicator, professional traders have been avoiding leveraged longs (bullish bets). Despite the modest improvement to 2%, the indicator remains far from the neutral 5% threshold.\n\nTo exclude externalities that might have solely impacted the Ether futures, one should analyze the ETH options markets. The 25% delta skew indicator compares similar call (buy) and put (sell) options and will turn positive when fear is prevalent because the protective put option premium is higher than the call options.\n\nEther 30-day 25% skew. Source: Laevitas\n\nThe skew indicator will move above 8% if traders fear an Ether price crash. On the other hand, generalized excitement reflects a negative 8% skew. As displayed above, the delta skew has been signaling fear since June 10 and peaked at 21% on June 15 — the highest level in three months.\n\nRelated: Here’s what happened in crypto today\n\nEther’s price looks poised to drop down to $1,560\n\nInvestors tend to focus solely on short-term price movements and forget that Ether’s price is up 37% year-to-date in 2023. Moreover, by relying too much on Ethereum’s $24 billion in TVL, traders might have missed the signals of weakening demand for DApp use.\n\nFor now, bears have the upper hand considering the ETH derivatives metrics, so a retest of the $1,560 support is the most likely outcome. That does not mean that the 2023 gains are at risk, but until the regulatory FUD — fear, uncertainty and doubt — dissipates, bulls will have a hard time moving Ether above the $1,750 resistance.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL3hycC94cnAtYWxsZWdlZGx5LWF0dGFja2VkLWJ5LXNlY3MtaGlubWFuLWZvci1ldGhlcmV1bXMtYmVuZWZpdC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "XRP Allegedly Attacked By SEC's Hinman For Ethereum's Benefit - NewsBTC",
        "content": "The legal battle between Ripple and the Securities and Exchange Commission (SEC) has taken a new twist as top lawyers accuse former SEC Director William Hinman of being paid to attack XRP in favor of Ethereum (ETH).\n\nFollowing the release of Hinman’s emails and drafts of his June 2018 speech, pro-XRP attorney John Deaton expressed his frustration with the intent of the released documents on a recent live CryptoLaw podcast.\n\nPayments To Disparage XRP In Favor Of Ethereum?\n\nJeremy Hogan, lawyer and cryptocurrency expert, also weighed in on the matter alleging that former SEC Director of Corporate Finance, Bill Hinman, was paid to give a speech in which he declared that Ethereum was not a security.\n\nAccording to Hogan, Ripple, a leading cryptocurrency company, has suggested that Hinman was paid by the Ethereum Foundation or someone related to Ethereum to give the speech and give Ethereum a free pass.\n\nHogan’s claims are based on email exchanges between Hinman and his colleagues, which reportedly show that Hinman had already named his first email “the Ether speech” before he began crafting the speech.\n\nThis, according to Hogan, suggests that “right from the get-go”, Hinman is saying that ETH is not a security, and that was the point of him making the speech.\n\nHinman’s speech, which was delivered in 2018, was seen by many in the cryptocurrency industry as a landmark moment in which the SEC effectively declared that Ethereum was not a security.\n\nThis was seen as a significant victory for Ethereum and the wider cryptocurrency industry, as it provided clarity on how the SEC would regulate cryptocurrencies.\n\nHowever, Hogan has suggested that the speech was not only a free pass for Ethereum but also an attack on XRP, which was at the time Ethereum’s biggest competition. Hogan’s claims are based on Ripple’s ongoing legal battle with the SEC, in which Ripple has argued that XRP is not a security and should not be regulated as such.\n\nHogan’s allegations are likely to fuel speculation about the relationship between the SEC and the cryptocurrency industry, and the extent to which the SEC’s decisions are influenced by external factors. However, it is important to note that Hogan’s claims are based on speculation and have not been proven.\n\nAt present, the value of XRP stands at $0.4731, indicating a marginal recovery of 0.6% over the past day. This comes after a dip to $0.4564 on Wednesday. Despite the recent drop, XRP enthusiasts remain optimistic and are looking forward to a positive outcome that could potentially boost the cryptocurrency’s price to a new yearly high, surpassing the $0.5833 mark hit in May.\n\nThis could position XRP, the sixth largest cryptocurrency on the market, in a favorable position to reach the $1 milestone.\n\nFeatured image from Unsplash, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLWxlYWRzLWhlZGVyYXMtcmV2ZW51ZS1zdXJnZXMtbmVhcmx5LTUwMC1tZXNzYXJpcy1xMTIzLXJlcG9ydC_SAV9odHRwczovL2NvaW5nYXBlLmNvbS9ldGhlcmV1bS1sZWFkcy1oZWRlcmFzLXJldmVudWUtc3VyZ2VzLW5lYXJseS01MDAtbWVzc2FyaXMtcTEyMy1yZXBvcnQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Leads, Hedera's Revenue Surges Nearly 500%: Messari's Q1'23 Report - CoinGape",
        "content": "The Q1 2023 report from Messari highlights the continued dominance of Ethereum in terms of revenue generation among Layer 1 blockchains. However, the report reveals a notable standout: Hedera Hashgraph (HBAR), which demonstrated remarkable revenue growth fueled by its Consensus Service.\n\nEthereum Dominates Q1 Revenue\n\nDuring Q1, Ethereum proved its dominance once again, emerging as the clear leader in revenue generation among Layer 1 blockchains. Driven by its widespread adoption and high gas fees, Ethereum recorded an impressive revenue of $457 million. This figure was nearly 2.8 times higher than the combined revenue of all other featured Layer 1 chains.\n\nadvertisement\n\nEthereum remained the leader in most key financial and ecosystem metrics including market cap, revenue, DeFi TVL and volume, NFT volume, and full-time developers. Ethereum scored a 22 in DeFi Diversity, followed by Polygon (19), Solana (18), and BNB Chain (16).\n\nHedera (HBAR) Growth In Q1’23\n\nWhile Ethereum dominated in terms of total revenue, the standout performer in Q1 was Hedera Hashgraph (HBAR). Hedera experienced an extraordinary revenue growth rate of 489% quarter-on-quarter (QoQ). This significant increase can be attributed to the adoption and utilization of Hedera’s Consensus Service\n\nHedera Hashgraph’s Consensus Service offers a unique approach to distributed consensus, enabling secure and scalable transactions. This service has gained traction among enterprises and developers seeking a robust and efficient blockchain solution.\n\nAcross featured networks, full-time developers (devs) decreased by 4% QoQ. Ethereum’s full-time dev count of 1,976 is almost equal to all other featured networks combined. Hedera’s full-time dev count increased the most of featured networks, growing 28% QoQ to 64.\n\nAbout Messari Report:\n\nThe Messari report aggregates and compares the financial, network, and ecosystem analyses of the 14 Layer-1 (L1) smart-contract platforms including Avalanche, BNB Chain, Cardano, Ethereum, Harmony, Hedera, NEAR, Polkadot, Polygon, Solana, Stacks, Tezos, TRON, and WAX.\n\nThe key takeaways are:\n\nEthereum remained the leader in most key financial and ecosystem metrics including market cap, revenue, DeFi TVL and volume, NFT volume, and full-time developers.\n\nincluding market cap, revenue, DeFi TVL and volume, NFT volume, and full-time developers. USDC’s temporary depeg and Paxos ceasing BUSD issuance shifted stablecoin dominance toward USDT, benefitting TRON. TRON’s stablecoin market cap increased 30% QoQ to $43.6 billion; all other featured L1s with a significant stablecoin market cap saw theirs decrease QoQ.\n\nTRON’s stablecoin market cap increased 30% QoQ to $43.6 billion; all other featured L1s with a significant stablecoin market cap saw theirs decrease QoQ. The featured L1s experienced an average QoQ increase of 83% in market cap, but network usage decreased by around 2.5%."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA2LzE2LzItY3J5cHRvY3VycmVuY2llcy10by1idXktZm9yLXRoZS1sb25nLWhhdWwv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "2 Cryptocurrencies to Buy for the Long Haul - The Motley Fool",
        "content": "Given the historical volatility in the crypto market, it can be hard to find high-quality cryptos that make good long-term prospects. But there are two cryptos that need to be on your investing radar as we head into the second half of 2023: Bitcoin (BTC 0.13%) and Ethereum (ETH 0.34%).\n\nBoth of these cryptos boast huge market caps, long track records of success, and promising future growth prospects. Here's a closer look at both.\n\nBitcoin\n\nBitcoin is the world's largest crypto by market cap, and for good reason. Bitcoin is the original cryptocurrency, and over its lifetime has turned in absolutely astronomical returns for patient investors. During the decade from 2011 to 2021, Bitcoin was the best-performing asset in the world, and it wasn't even close. Bitcoin's annualized return stands at 230%, which is 10 times higher than the second-best-performing asset class, the Nasdaq 100 Index.\n\nHowever, as savvy investors know, past performance is no guarantee of future performance. The good news, though, is that Bitcoin is just getting started. Institutional investors are now embracing Bitcoin, nations such as El Salvador are experimenting with Bitcoin as an alternative to the U.S. dollar, and new use cases are springing up regularly. This year, for example, saw the launch of Bitcoin Ordinals, a new class of non-fungible tokens (NFTs) for the Bitcoin blockchain. At the same time, nations around the world are now updating their regulatory frameworks to make Bitcoin a legitimate digital asset.\n\nOn the basis of these promising developments, future price targets for Bitcoin are growing increasingly aggressive. While some of these price targets are set by crypto enthusiasts and promoters, others have the imprimatur of Wall Street. Goldman Sachs, for example, has put out a $100,000 price target for Bitcoin. And Cathie Wood of Ark Investment Management has suggested a $1.48 million price target for Bitcoin. Given Bitcoin's current price of $26,000, there is obviously incredible upside potential for long-term investors. Just remember, though, that Bitcoin can be incredibly volatile, so there will be pull-backs along the way.\n\nEthereum\n\nEthereum is the world's second-largest cryptocurrency and has been an early pioneer in everything from decentralized finance to NFTs. The Ethereum ecosystem is incredibly diversified and includes everything from decentralized exchanges for trading digital assets to Web3 gaming platforms and metaverse worlds. Arguably, Ethereum is the single most diversified crypto that you can own right now, and that can help to reduce some of your risk exposure.\n\nJust like Bitcoin, Ethereum has turned in some head-spinning returns for long-term investors. Since its launch in 2015, Ethereum is now up an incredible 50,000%. While Ethereum likely will not be able to replicate those types of returns, it is certainly building the base for its next stage of growth. In 2022, for example, Ethereum carried out The Merge, a dramatic transformation of its blockchain architecture to make it faster, leaner, and more efficient. By transitioning to a proof-of-stake blockchain from a proof-of-work blockchain, for example, Ethereum became 99.9% more energy-efficient.\n\nIn terms of utility and real-world applications, Ethereum is well ahead of most blockchain rivals. Fortune 500 companies are using Ethereum blockchain solutions to improve their supply chains, while top Wall Street banks are experimenting with using Ethereum as a way to optimize trading. On the basis of these emerging use cases across a broad spectrum of industries, New York-based investment firm VanEck recently put out a $50,000 price target for Ethereum (the crypto now trades for about $1,650). While that forecast is aggressive, it does hint at the future upside potential of Ethereum.\n\nRisk factors\n\nAlthough Bitcoin and Ethereum stand out as the two cryptocurrencies that long-term investors can add to their portfolios, they are hardly risk-free. Right now, there is tremendous regulatory uncertainty hanging over the crypto market, so it's definitely important to keep an eye on what's happening in Washington, D.C., if you plan to invest in these cryptos. In addition, volatility is always an issue for cryptos, where valuations can rise and fall much faster than in equity markets. So you need to be ready to accept some down years in addition to the up years.\n\nBut if you are willing to take on this additional risk, you could be rewarded with tremendous potential returns. For that reason, I'm bullish on both Bitcoin and Ethereum as long-term investments."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vdS50b2RheS9meHMtcHJpY2Utc3Bpa2VzLW92ZXItNS1hcy1ldGhlcmV1bS1ldGgtZ2V0cy1jbG9zZXItdG8tZnJheC1maW5hbmNlcy1sMtIBW2h0dHBzOi8vdS50b2RheS9meHMtcHJpY2Utc3Bpa2VzLW92ZXItNS1hcy1ldGhlcmV1bS1ldGgtZ2V0cy1jbG9zZXItdG8tZnJheC1maW5hbmNlcy1sMj9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "FXS Price Spikes Over $5 as Ethereum (ETH) Gets Closer to Frax Finance's L2 - U.Today",
        "content": "Advertisement\n\nFrax Finance, the cryptocurrency ecosystem behind one of the most important decentralized stablecoins, FRAX, shared the details of its second-layer solution project. It will merge the benefits of Optimistic Rollups and Zero-Knowledge Proofs (ZKPs), two mainstream technologies for Ethereum (ETH) scaling.\n\nFrax Finance will launch L2 on Ethereum (ETH): What do we know about FraxChain?\n\nFrax Finance is developing a second-layer solution on the top of Ethereum (ETH). The upcoming network will use frxETH token for gas payments and employ Optimistic Rollups combined with Zero-Knowledge Proofs (ZKPs). Such statements were made by Frax Finance's Sam Kazemian yesterday, on June 15.\n\n⛓️FRAXCHAIN⛓️\n\n\n\nYesterday, we released a landmark episode where Sam revealed that Fraxchain would most likely be launched by the end of the year! 👀\n\n\n\nHeres a quick recap of what we learned👇 pic.twitter.com/iinwQT3AKH — FlywheelDeFi.eth (@FlywheelDeFi) June 15, 2023\n\nThe new blockchain that is currently dubbed FraxChain will be a fully EVM-compatible easy-to-code environment for all types of decentralized applications. All assets of Frax Finance ecosystem will be natively available on FraxChain.\n\nfrxETH will be used for gas fees on the new network. Users will be able to bridge their assets to it via FraxFerry, FraxChain's decentralized bridge.\n\nUsers will also be invited to restake their frxETH synthetic assets as sfrxETH to earn extra yield on their liquidity. As a result, the new blockchain will be an outstanding solution of many issues dangerous for the modern L2 ecosystem:\n\nThis design has multiple beneficial factors that will set Fraxchain apart from other L2's and rollups: faster transaction finality, enhanced security through validity proofs, increased throughput, capital efficiency, decentralization capabilities.\n\nfrxETH will then be redistributed among veFXS holders. The launch of a viable version of FraxChain is scheduled for Q4, 2023.\n\nFrax Shares (FXS) price adds 10% in less than 24 hours\n\nAlso, FraxChain will natively support account abstraction (AA) from the very beginning. This is the most anticipated upgrade for all EVM blockchains that can turn every wallet into a decentralized bank.\n\nThe announcement excited the global Web3 community: the price of Frax Share (FXS), a core asset of Frax Finance's ecosystem, spiked from $4.67 to $5.08.\n\nAs covered by U.Today previously, since December 2022, BNB Chain hosts a native version of Frax Finance's USD-pegged stablecoin FRAX."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1jbGFzc2ljLXRyYWRlcnMtc2hvdWxkLXdhdGNoLW91dC1mb3ItdGhlc2UtbGV2ZWxzLWluLWp1bmUv0gFdaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2V0aGVyZXVtLWNsYXNzaWMtdHJhZGVycy1zaG91bGQtd2F0Y2gtb3V0LWZvci10aGVzZS1sZXZlbHMtaW4tanVuZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Classic traders should watch out for these levels in June - AMBCrypto News",
        "content": "Disclaimer: The information presented does not constitute financial, investment, trading, or other types of advice and is solely the writer’s opinion.\n\nThe imbalance on the chart is likely to be partially filled before the next price move down.\n\nA break in structure with a move above $15.55 could hint at uncertain short-term conditions.\n\nIn a recent report, the lack of volatility behind Ethereum Classic was highlighted as a sign that a large move was imminent. At that time the direction was uncertain, but Bitcoin’s failure to reclaim $27k sealed the fate of ETC bulls.\n\nRealistic or not, here’s ETC’s market cap in BTC’s terms\n\nThe market structure and the trend were wholly on the side of the sellers. A reversal was unlikely, and another move down to a Fibonacci extension level was expected.\n\nThe sharp drop below $16.5 meant sentiment was extremely bearish\n\nThe market structure of Ethereum Classic became bearish in the latter half of April, when prices fell below the $20.23 mark. Since then, the asset has posted a series of lower highs and lower lows on the chart.\n\nThe second half of May saw ETC enter a phase of price contraction. This could have been taken as a phase of accumulation, if only the OBV was in an uptrend. It was the opposite, and the sentiment in the market was also in favor of the sellers.\n\nThe uncertainty in the crypto sphere and Bitcoin’s plunge below $26k saw Ethereum Classic dive by 26.6% from $17.18 to $12.61 on 10 June. A set of Fibonacci retracement levels (pale yellow) was plotted based on this move. It showed the 50% and 61.8% levels in a region of imbalance (white) that the quick dump had left behind.\n\nSuch an imbalance was seen at the $17.5 mark and is highlighted in white. It was partially filled before the price continued to trend downward. Therefore, a similar scenario could unfold in the coming days and presents a shorting opportunity targeting the 23.6% extension level. This idea would be invalidated if ETC pushes upward past $15.5 and $16.2 as that would signal bullish intent (but could also be a liquidity hunt).\n\nThe Open Interest chart posted a weak bounce as the bulls clawed their way above $15\n\nOn 14 and 15 June, Ethereum Classic bulls embarked on the toilsome task of driving prices higher. The spot CVD reflected a severe lack of demand, and the bounce was not accompanied by significant buying pressure.\n\nHow much are 1, 10, or 100 ETC worth today?\n\nDuring this minor bounce the OI increased by close to $5 million but this value paled in comparison to the losses the OI has seen over the past week. The funding rate was positive but overall, the sentiment was bearish and buyers had little conviction."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2V0aGVyZXVtLXJlbWFpbnMtYmVhcmlzaC13aWxsLWl0LXVwaGlsbC1vci1wbHVtbWV0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Remains Bearish: Will it Uphill or Plummet? - Analytics Insight",
        "content": "Ethereum, the second largest cryptocurrency, has dropped 7.69% in the past seven days\n\nDue to the selling pressures of Bitcoin (BTC), the second largest cryptocurrency by market capitalization, Ethereum (ETH), is crashing the market. Ethereum (ETH) was steadily approaching $1800, with a previous record increase due to Shanghai’s Blockchain upgrade.\n\nEthereum is trading at $1,674.76 after a gain of 2.68% in the past 24 hours. However, the ETH price has dropped 7.69% in the past seven days, and the current market cap has reached US$201 billion.\n\nInvestors pushed Ether (ETH) beyond the overhead resistance of $1,680 on June 16. However, the breakout didn’t stay for long, and the price closed below $1,680.\n\nThe upsloping 20-day Exponential Moving Average and the positive RSI imply that Ether bulls are in check. Investors might try to cross the overhead barrier at $1,680 and push the price to $2,000. As a result, the $1,800 level may cause some resistance, but the prices may be crossed.\n\nMany Crypto Analysts thought that Shanghai’s Blockchain upgrade would cause a price fall, but this was not the case. The upgrade caused Ethereum (ETH) to have steady increases. The upgrade allowed Ethereum (ETH) to shift from a proof of stake protocol to a proof of work protocol.\n\nUndoubtedly, much of the crypto market is bullish on Ethereum price prediction. The coin is an essential part of the industry, and with it, many of the top applications and services that have risen to popularity in the last few years would be here today.\n\nOf course, only some feel the same, and there are plenty of reasons some investors will not touch ETH. The shift allowed staked Ethereum (ETH) to be withdrawn from the blockchain. You don’t necessarily have to agree with them, but you must hear them out. You should be fully aware of ETH’s pitfalls and benefits. Because when some ask, ‘Will ETH continue falling?’ No one knows the answer.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8venljcnlwdG8uY29tL2V0aGVyZXVtLWNvLWZvdW5kZXItb3V0bGluZXMtY3J1Y2lhbC10cmFuc2l0aW9ucy1yZXF1aXJlZC10by1hdHRhaW4tc3VzdGFpbmFiaWxpdHkv0gFsaHR0cHM6Ly96eWNyeXB0by5jb20vZXRoZXJldW0tY28tZm91bmRlci1vdXRsaW5lcy1jcnVjaWFsLXRyYW5zaXRpb25zLXJlcXVpcmVkLXRvLWF0dGFpbi1zdXN0YWluYWJpbGl0eS8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Co-founder Outlines Crucial Transitions Required To Attain Sustainability - ZyCrypto",
        "content": "Advertisement\n\nIn a June 9, 2023 post on his website, Ethereum co-founder, Vitalik Buterin outlined the three major technical transitions that the Ethereum protocol must undergo to offer an open, global, and permissionless experience to the average user.\n\nAccording to Buterin, the three simultaneous transitions for Ethereum are; the Layer 2 (L2) scaling transition, the wallet security transition, and the privacy transition. Buterin says that intense coordination requiring deep changes from applications and wallets is required to achieve these transitions.\n\nButerin points out that smart contract wallets make the keeping of one address more difficult since some L2 blockchains are not compatible with Ethereum Virtual Machines (EVM), yet privacy may require each user to have even more addresses. The EVM is software that executes smart contracts and updates Ethereum Network after a new block is added to the chain.\n\nButerin says that since many users’ funds are stored in the same smart contract and hence at the same address, apps that rely on the assumption that address ownership is immutable will have to find alternative ways to achieve this goal.\n\nFor key recovery, Buterin proposes that instead of running the recovery procedure on each address separately, the wallet can include software to execute the recovery procedure across all of a user’s addresses at the same time.\n\nAdvertisement\n\nHowever, considerations still need to be made on gas cost implications and privacy concerns over publicly linking all addresses by recovering them at the same time and hence proposes the use of an architecture that separates verification logic and asset holdings.\n\nButerin says that overcoming the above challenges requires lots of secondary infrastructure to be updated and wallets interacting with spending and encryption keys will have to be improved.\n\nButerin gives an example of the Ethereum Name Service (ENS) that makes it a lot easier for regular users to minimize the possibility of using a wrong wallet address mistake considerably but is expensive. To enhance its use, Buterin says that ENS subdomains are now automatically verifiable on L2 blockchains.\n\nButerin says that although wallets are essential for securing assets, they also hold user data. Holding a single encryption key could resolve the protection of user data, however losing your encryption key, still results in loss of assets.\n\nHowever, to avoid users having multiple recovery paths, Buterin proposes that wallets will likely need to manage both the recovery of assets and encryption keys.\n\nButerin further proposes that any chosen design should maintain decentralization while at the same time offering easy access to users’ assets using open and not proprietary solutions.\n\nButerin says that achieving the three technical transitions is crucial and Ethereum must rise to the challenge for improved user experience and to attain a sustainable future."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhzLXByaWNlLXJlYWN0cy10by1mb21jLW1lZXRpbmctd2lsbC1iZWFycy1zdGljay1hcm91bmQv0gFUaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2V0aHMtcHJpY2UtcmVhY3RzLXRvLWZvbWMtbWVldGluZy13aWxsLWJlYXJzLXN0aWNrLWFyb3VuZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "ETH’s price reacts to FOMC meeting; will bears stick around? - AMBCrypto News",
        "content": "The Federal Reserve’s decision caused a significant decline in Ethereum’s [ETH] prices.\n\nRetail investors showed interest while whales and network growth declined, leaving ETH’s recovery uncertain.\n\nOn 14 June, the Federal Reserve opted not to proceed with an 11th consecutive interest rate hike. This was done as it assessed the consequences of the previous ten increases. The decision was made by the Federal Open Market Committee (FOMC) during their two-day meeting.\n\nHowever, the committee projected that two additional quarter percentage point rate increases will likely take place before the year concludes.\n\nRead Ethereum’s [ETH] Price Prediction 2023-2024\n\nFOMC causes FUD\n\nThe FOMC’s choice to halt interest rate hikes had an immediate effect on the price of Ethereum. CoinMarketCap‘s data revealed a 6.49% drop in ETH’s value within the past 24 hours.\n\nThe decisions made by the FOMC often carry significant weight in the market due to multiple factors. When the FOMC hints at potential interest rate increases, it alters investor sentiment.\n\nHigher interest rates make traditional investments more appealing, diminishing demand for cryptocurrencies. Additionally, market sentiment and risk perception come into play. If the FOMC expresses caution or concerns about economic stability, investors tend to become more risk-averse, resulting in a sell-off in cryptocurrencies.\n\nFurthermore, regulatory concerns and potential policy measures discussed during FOMC announcements can adversely impact the crypto markets.\n\nThe panic among investors was evident through the behavior of the whales. Data from Glassnode highlighted a considerable reduction in the number of addresses holding more than 10,000 ETH in recent months.\n\nHowever, retail investors continued to exhibit interest in ETH, perceiving the price decline as an opportunity to purchase the coin at a discounted rate. While retail investors’ interest may offer temporary support to ETH’s price, it leaves them vulnerable to whale behavior in the long term, considering that the majority of ETH was still held by ETH holders.\n\n? #Ethereum $ETH Number of Addresses Holding 0.01+ Coins just reached an ATH of 24,343,133 Previous ATH of 24,343,031 was observed on 11 June 2023 View metric:https://t.co/XXb0u19ouH pic.twitter.com/u7rzmRqXcz — glassnode alerts (@glassnodealerts) June 15, 2023\n\nSome traders remain hopeful\n\nRecent data also suggested a decline in Ethereum’s network growth alongside its price. This indicated a waning interest from new addresses. Moreover, the velocity of Ethereum also decreased. This was an indication of the substantial reduction in the number of ETH transactions occurring on the network.\n\nIs your portfolio green? Check out the Ethereum Profit Calculator\n\nDespite these factors, data from Coinglass revealed an increase in the number of long positions taken against ETH in the past few days. This suggested that investors remained hopeful and optimistic about Ethereum’s future prospects."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMizgFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWluLWluZGlhLWp1bmUtMTctY2hlY2stbWFya2V0LWNhcC1iaXRjb2luLWV0aGVyZXVtLW1lcmdlLWRvZ2Vjb2luLXNvbGFuYS1saXRlY29pbi1yaXBwbGUteHJwLWJpbmFuY2UtdG9rZW4tcW50LXByaWNlcy1nYWluZXItbG9zZXItMTYwOTYwNNIB0gFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWluLWluZGlhLWp1bmUtMTctY2hlY2stbWFya2V0LWNhcC1iaXRjb2luLWV0aGVyZXVtLW1lcmdlLWRvZ2Vjb2luLXNvbGFuYS1saXRlY29pbi1yaXBwbGUteHJwLWJpbmFuY2UtdG9rZW4tcW50LXByaWNlcy1nYWluZXItbG9zZXItMTYwOTYwNC9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 17 Jun 2023 07:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin, Ethereum See Gains As Quant Becomes Top Gainer - ABP Live",
        "content": "Bitcoin (BTC) and Ethereum (ETH) — two of the most valued crypto coins — managed to rise above the $26,000 and $17,00 marks, respectively, on early Saturday morning. Other popular altcoins — including the likes of Ethereum (ETH) and Dogecoin (DOGE) — landed in the positive as overall prices saw minor gains across the board. Quant (QNT) emerged to be the biggest gainer, seeing a 24-hour jump of over 18.30 percent. BitTorrent(New) (BTT), on the other hand, turned out to be the biggest loser.\n\nAt the time of writing, the global crypto market cap stood at $1.06 trillion, registering a 24-hour gain of 2.22 percent.\n\nBitcoin (BTC) price today\n\nBitcoin price stood at $26,293.73 seeing a 24-hour gain of 3.02 percent, as per CoinMarketCap. According to the Indian exchange WazirX, BTC price stood at Rs 23.23 lakhs.\n\nEthereum (ETH) price today\n\nETH price stood at $1,721.78, marking a 24-hour gain of 3.38 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 1.53 lakhs.\n\nDogecoin (DOGE) price today\n\nDOGE registered a 24-hour gain of 0.54 percent as per CoinMarketCap data, currently priced at $0.06199. As per WazirX, Dogecoin price in India stood at Rs 5.4569.\n\nLitecoin (LTC) price today\n\nLitecoin saw a 24-hour gain of 1.76 percent. At the time of writing, it was trading at $76.30. LTC price in India stood at Rs 6,654.73.\n\nRipple (XRP) price today\n\nXRP price stood at $0.4737, seeing a 24-hour loss of 1.16 percent. As per WazirX, Ripple price stood at Rs 41.6064.\n\nSolana (SOL) price today\n\nSolana price stood at $15.52, marking a 24-hour gain of 4.93 percent. As per WazirX, the SOL price in India stood at Rs 1,356.01.\n\nTop crypto gainers today (June 17)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nQuant (QNT)\n\nPrice: $114.95\n\n24-hour gain: 18.30 percent\n\nFrax Share (FXS)\n\nPrice: $5.65\n\n24-hour gain: 16.82 percent\n\nSui (SUI)\n\nPrice: $0.7338\n\n24-hour gain: 11.78 percent\n\nPepe (PEPE)\n\nPrice: $0.0000009869\n\n24-hour gain: 8.50 percent\n\nTrust Wallet Token (TWT)\n\nPrice: $0.9333\n\n24-hour gain: 8.32 percent\n\nTop crypto losers today (June 17)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nBitTorrent(New) (BTT)\n\nPrice: $0.0000005035\n\n24-hour loss: 2.38 percent\n\nFlare (FLR)\n\nPrice: $0.01442\n\n24-hour loss: 1.93 percent\n\nRipple (XRP)\n\nPrice: $0.4733\n\n24-hour loss: 1.40 percent\n\nEOS (EOS)\n\nPrice: $0.6309\n\n24-hour loss: 0.71 percent\n\nChainlink (LINK)\n\nPrice: $5.26\n\n24-hour loss: 0.47 percent\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vcGVyY2VudGFnZS1vZi1ldGgtYWRkcmVzc2VzLWluLXByb2ZpdC1yZWFjaGVzLTUtbW9udGgtbG93L9IBZGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vcGVyY2VudGFnZS1vZi1ldGgtYWRkcmVzc2VzLWluLXByb2ZpdC1yZWFjaGVzLTUtbW9udGgtbG93L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "Percentage Of ETH Addresses In Profit Reaches 5-Month Low - NewsBTC",
        "content": "The brutal bear market in crypto over the past few months has taken a serious toll on ETH’s price and profitability. The price of Ethereum has been stuck in a sideways range recently, and many ETH holders have been unlucky for it. According to data from Glassnode, the percentage of Ethereum addresses in profit has now dropped to a 5-month low.\n\nPercentage Of Addresses In The Green Drops To 55.414%\n\nBack in 2021, when the price of ETH was at its highest, the majority of addresses held a comfortable position. Now, two years later, for new investors who bought at higher prices, the wait for their positions to go green again has been a long one.\n\nGlassnode, a crypto analytics platform, reports that the percentage of Ethereum addresses in green while measuring over a 7-day moving average is now at a 5-month low of 55.414%.\n\nPercentage of addresses in profit drop to five-month low | Source: Glassnode on Twitter\n\nThis indicates that more than 44 percent of the people who own ETH are currently at a loss. In the same vein, the number of profitable addresses has dropped to its lowest point since March of this year, standing at 56,311,171.899 at the moment.\n\nMoving ETH Off Exchanges\n\nThe amount of ETH held on cryptocurrency exchanges has also dropped to its lowest level in over 5 years. This means less ETH is available for trading on exchanges, which can impact the price and liquidity. Traders are withdrawing their ETH from exchanges and holding it in private digital wallets.\n\nThe drop can also be linked to an all-time high level of staking in the ETH 2.0 deposit contract. Data shows that the majority of ETH held by large investors are now moving ETH into the contract, showing that interest in ETH staking is growing. This declining supply, coupled with increasing mainstream interest in ETH, could drive the price higher if demand remains strong.\n\nEthereum Plunges Below $1,700\n\nMeanwhile, Ethereum broke below critical price support earlier this week. The price plunged below $1,700 to $1,630 yesterday, marking its lowest value since March 16. The plunge in price and profitability is largely attributed to negative sentiment around rising inflation fears and the overall weakness in the crypto market recently.\n\nETH has since then recovered and is now trading at $1,720, looking to retest the $1,800 resistance once more. Of course, if $1,700 fails to hold, Ethereum could fall further to test support at $1,400 or even $1,300. A drop below $1,700 again would be very bearish and see the profitability percentage drop further.\n\nEthereum price recovers above $1,700 | Source: ETHUSD on TradingView.com\n\nFeatured image from The Cryptoknowmist, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiogFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9ob3ctd2lsbC1jcnlwdG9zLWxpa2UtZG9nZXR0aS1ldGhlcmV1bS1hbmQtYXVkZC1zdXJ2aXZlLXRoZS1oZWF0LW9mLXRoZS1tb21lbnQtaW4tdGhlLWJhY2tkcm9wLW9mLXNlY3MtdW5kZWNsYXJlZC13YXItb24tY3J5cHRvcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "How Will Cryptos Like Dogetti, Ethereum, And AUDD Survive The Heat Of The Moment In The Backdrop Of SEC's ... - Analytics Insight",
        "content": "The recent expansion of Novatti Group Limited’s Australian dollar-backed stablecoin, AUDD to the XRP Ledger, has sparked a discussion on the survival of various cryptocurrencies in the face of the SEC’s undeclared war. In this comparative article, we will delve into the similarities and differences between AUDD, Dogetti, and other notable cryptos like Ethereum, and analyze their ability to withstand the heat of the moment.\n\nNovatti Group Limited: A Fintech Powerhouse\n\nNovatti Group Limited is a leading Australian payments fintech company that has made significant strides in the crypto space. With the expansion of its AUDD stablecoin to the XRP Ledger, Novatti aims to provide users with a secure and stable digital asset that can be seamlessly utilized in various transactions.\n\nThe AUDD stablecoin offers a unique value proposition by being backed by the Australian dollar. This feature provides stability and mitigates the volatility often associated with cryptocurrencies. Moreover, Novatti’s established reputation in the fintech industry adds credibility to AUDD and enhances its potential as a reliable digital currency.\n\nDogetti: The Rising Star\n\nIn the midst of the crypto market’s dynamic landscape, Dogetti emerges as a meme coin with a vision of fostering a strong and united community of holders. Inspired by mafia-themed books and films, Dogetti brands its community as “The Family,” aiming to create a sense of uniqueness, togetherness, and a shared purpose among its members.\n\nThe primary goal of the Dogetti project is to uplift the net worth of every member of “The Family.” Through a 2% reflection protocol, Dogetti ensures that holders are rewarded on a regular basis. This innovative mechanism offers a tangible incentive for individuals to join the community and contribute to its growth.\n\nAdditionally, Dogetti incorporates utility features into its ecosystem. While the specifics are not provided, the project promises to integrate multiple forms of utility, adding further value to the meme coin.\n\nSurviving the SEC’s Undeclared War\n\nIn the backdrop of the SEC’s undeclared war on cryptocurrencies, it is crucial to assess how these digital assets, including Novatti’s AUDD, Dogetti, and other prominent cryptos like Dogecoin and Ethereum, will navigate the challenges ahead.\n\nThe SEC’s regulatory scrutiny has raised concerns about the legal status and compliance of cryptocurrencies. However, it is important to note that the landscape of crypto regulations is still evolving, and no definitive actions have been taken against any specific crypto projects, including Dogetti.\n\nWhile uncertainties loom, the distinct characteristics of Dogetti, such as its loyal and engaged community, may serve as an advantage. The strength and unity of “The Family” fostered by Dogetti’s branding strategy contribute to a resilient support system that can weather the storms of regulatory scrutiny.\n\nIn contrast, larger and more established cryptocurrencies like Ethereum may face heightened regulatory scrutiny due to their widespread adoption and market influence. This scrutiny could potentially impact their value and utility. However, the survival and success of these cryptocurrencies will depend on their ability to adapt to evolving regulations and demonstrate their compliance with legal frameworks.\n\nNovatti Group Limited’s AUDD and Dogetti represent two distinct approaches to the crypto market. While Novatti leverages its expertise in the fintech industry to introduce a stablecoin backed by the Australian dollar, Dogetti positions itself as a meme coin with a strong and united community.\n\nAmidst the SEC’s undeclared war on cryptocurrencies, Dogetti’s branding as “The Family” and its unique rewards system provide it with a competitive edge. The ability to withstand regulatory challenges will play a crucial role in the survival and success of cryptocurrencies like Dogetti, Dogecoin, and Ethereum.\n\nInvestors and enthusiasts looking for the next big crypto investment or meme coin with utility can find valuable opportunities in projects like Dogetti. By joining “The Family” and participating in a thriving community, individuals can potentially increase their net worth and be part of something unique and special.\n\nTo explore Dogetti further and join “The Family,” visit their website for more information. Embrace the crypto revolution and discover the potential that lies within the ever-evolving landscape of digital currencies.\n\nPresale: https://dogetti.io/how-to-buy\n\nWebsite: https://dogetti.io/\n\nTelegram: https://t.me/Dogetti\n\nTwitter: https://twitter.com/_Dogetti_\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3QvaW5xdWJldGFzLXN0YWtpbmctZmVhdHVyZS1pcy13YXktbW9yZS1sdWNyYXRpdmUtdGhhbi1ldGhlcmV1bS1hbmQtY2FyZGFub3PSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 17 Jun 2023 07:00:00 GMT",
        "title": "InQubeta's Staking Feature Is Way More Lucrative Than Ethereum and Cardano's - BSC NEWS",
        "content": "With lower minimum staking requirements, InQubeta's staking feature offers generous rewards, accessibility, flexibility, and alignment with the platform's mission of supporting AI startups.\n\nIn the ever-evolving landscape of cryptocurrencies, staking has become a popular method for investors to earn passive income and contribute to the security and stability of blockchain networks. Staking involves holding and \"staking\" a certain amount of tokens in a wallet to support network operations and validate transactions. While Ethereum and Cardano are known for their staking capabilities, InQubeta's staking feature offers a more lucrative opportunity for investors.\n\nInQubeta: A Unique Staking Mechanism For Earning Rewards\n\nInQubeta, the pioneering crypto AI funding platform, has developed a staking mechanism that provides investors with substantial rewards and incentives. By staking QUBE tokens, investors contribute to the network's growth and security and earn attractive returns on their investment.\n\nOne of the key advantages of InQubeta's staking feature is its generous reward system. When investors stake their QUBE tokens, they become eligible to receive rewards from the dedicated reward pool. This reward pool is funded by a 5% buy and sell tax allocated to staking rewards. The reward pool grows as more investors participate in staking, allowing participants to earn a significant portion of their staked tokens as additional income.\n\nCompared to Ethereum and Cardano, InQubeta's staking feature offers higher potential returns. Ethereum's staking rewards are currently estimated at around 6% to 10% annually, while Cardano's staking rewards range from 4% to 6% annually. In contrast, InQubeta's staking rewards have the potential to be much more lucrative, thanks to the dedicated reward pool and the growing demand for AI technology supported by the platform.\n\nAnother aspect that sets InQubeta's staking feature apart is its accessibility. While Ethereum and Cardano have minimum staking requirements that can sometimes be relatively high, InQubeta offers a more inclusive approach. Investors can stake their QUBE tokens with a minimum amount, allowing a broader range of participants to engage in staking and reap the rewards.\n\nInQubeta's staking feature also offers flexibility. Investors have the freedom to unstake their tokens at any time, providing liquidity and the ability to respond to changing market conditions. This flexibility allows investors to adapt their staking strategy and optimize their returns based on their individual preferences and investment goals.\n\nMoreover, InQubeta's staking feature aligns with the platform's overall mission of supporting AI startups and driving innovation. By staking QUBE tokens, investors actively contribute to the growth and success of AI projects, fostering the development of groundbreaking technologies and solutions. This alignment of financial incentives and the advancement of AI further reinforces the appeal of InQubeta's staking feature.\n\nVisit InQubeta Presale\n\nInQubeta’s Presale Has Raised Over $400,000\n\nAs the presale of InQubeta continues to gain momentum, it has already surpassed $400,000 in investment. This significant milestone is a testament to investors' trust and confidence in the platform. By participating in the ongoing presale, investors have the opportunity to secure their QUBE tokens at a favorable price and position themselves for potential future growth.\n\nAccording to industry experts, investing in QUBE tokens during the presale has the potential to generate returns of up to 30 times the initial investment. The combination of InQubeta's innovative platform, the rising demand for AI technology, and the lucrative staking feature makes QUBE tokens an attractive investment opportunity.\n\nInQubeta Is The Right Crypto Project To Stake and Earn Rewards\n\nIn conclusion, InQubeta's staking feature stands out in the crypto landscape with its generous rewards, accessibility, flexibility, and alignment with the platform's mission. Compared to Ethereum and Cardano, InQubeta offers a more lucrative staking opportunity, providing investors with the potential for attractive returns.\n\nAs the presale surpasses $400,000, now is the time to consider investing in QUBE tokens and take advantage of the unique benefits and opportunities that InQubeta's staking feature offers. Join the presale today and be part of the AI revolution with InQubeta.\n\nVisit InQubeta Presale"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9idXNpbmVzcy9ibG9ja2NoYWluLWNyeXB0by10cmFkaW5nLWJvdC1leGVjdXRlcy1hLTIwMC1taWxsaW9uLWZsYXNoLWxvYW4tb24tZXRoZXJldW0tYmxvY2tjaGFpbi0zMTI4Njg1L9IBjgFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9idXNpbmVzcy9ibG9ja2NoYWluLWNyeXB0by10cmFkaW5nLWJvdC1leGVjdXRlcy1hLTIwMC1taWxsaW9uLWZsYXNoLWxvYW4tb24tZXRoZXJldW0tYmxvY2tjaGFpbi0zMTI4Njg1L2xpdGUv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "Crypto trading bot executes a $200 million flash loan on Ethereum blockchain - The Financial Express",
        "content": "According to Cointelegraph, a crypto trading bot performing arbitrage trades made various complicated moves on the Ethereum blockchain. It is expected that it has executed a $200 million flash loan and made a profit amounting to about $3.24.\n\nSources revealed that on June 14, 2023, Arkham Intelligence, a blockchain analysis firm, shared the details of actions taken by the bot. The firm expects that the transaction was made by an arbitrage bot which executed the entire process through a flash loan, Cointelegraph highlighted.\n\nIt is believed by Arkham that the bot borrowed took about 200 million DAI from MakerDAO, a decentralised finance (DeFi) protocol and transferred the funds to the Aave DAI market. After this incident about 1.349 Wrapped Ether (WETH) was borrowed against the funds. Supposedly, WETH was used to buy Threshold Network (T) tokens on the Curve Finance exchange and then sold on Balancer, a liquidity protocol, Cointelegraph added.\n\nAlso Read Ripple to collaborate with Colombia’s central bank Banco de la República\n\nFurthermore, it is believed that the bot gained about 0.019 Ether (ETH) whose price rate was about $33 during the time it was traded, Cointelegraph concluded.\n\n(With insights from Cointelegraph)\n\nFollow us on Twitter, Facebook, LinkedIn"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9zZWNzLWNyeXB0by1jcmFja2Rvd24td2hhdC1pdC1tZWFucy1mb3ItaW52ZXN0b3JzLWFuZC10aGUtZnV0dXJlL2FydGljbGVzaG93LzEwMTAyNzY3My5jbXPSAZEBaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvc2Vjcy1jcnlwdG8tY3JhY2tkb3duLXdoYXQtaXQtbWVhbnMtZm9yLWludmVzdG9ycy1hbmQtdGhlLWZ1dHVyZS9hbXBfYXJ0aWNsZXNob3cvMTAxMDI3NjczLmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "SEC's Crypto Crackdown: What it means for investors and the future - The Economic Times",
        "content": "Crypto Crackdowns\n\n\n\nRegulatory compliance\n\nInvestor protection\n\nImpact on investment returns\n\nFuture of cryptocurrency\n\n\n\n\n\n\n\n\n\nFor decades, investment opportunities were primarily limited to traditional assets like real estate, commodities, bank deposits and stocks.However, the dawn of digital era has paved the way for a fresh wave of investments options, with cryptocurrencies being the most prominent digital asset. Despite initial hesitations and uncertainties surrounding unregulated assets, cryptocurrencies such as Bitcoin and Ethereum have garnered notable momentum and exhibited increasing competitiveness in daily returns, particularly in the Indian market.Furthermore, the Government of India in a recent G20 summit has published a comprehensive report that sheds light on the willingness of numerous countries to adopt and legitimize cryptocurrencies, ultimately augmenting their accessibility. Within this context, India has firmly established itself as the seventh-largest nation, poised to embrace cryptocurrencies in the coming years and beyond.Undoubtedly, as the adoption of cryptocurrencies continues to surge, India has solidified its position as a global frontrunner in embracing and integrating the digital currencies into its financial landscape.With the ever-increasing traction in India, a diverse array of businesses, young individuals, and first-time investors have developed a fervent interest in venturing into this digital landscape.According to data released by KuCoin, a global cryptocurrency exchange, despite the government's initial skepticism towards cryptocurrencies, India is estimated to have an astounding 115 million investors, all propelled by a collective aspiration for long-term gains.This comprehensive report not only illuminates the burgeoning prevalence of cryptocurrency adoption but also emphasizes that a significant 56% of investors believe cryptocurrencies will fundamentally shape the future of the financial ecosystem.So, before diving into the future of cryptocurrencies, it is better to understand what it means for investors and its avenues for desired results.While digital assets offer numerous advantages, they also raise specific concerns, including the risk of fraud, market manipulation, money laundering, security vulnerabilities, and the potential misuse of cryptocurrencies for illicit purposes.Thus, in order to address fraudulent and unlawful activities, cryptocurrency crackdown that involves the implementation of regulations, increased oversight, and the imposition of penalties in the segment, appeared as a rigorous approach. This regulation aims to bolster investor protection and uphold the market's integrity.In addition, recently, the Securities and Exchange Commission 's (SEC's) crypto crackdown has significant implications for investors and the future currencies. The SEC regulates securities offerings and protects investors in the United States.While cryptocurrencies are not classified as traditional securities, the SEC has taken steps to assert its authority and regulate certain aspects of the crypto market. It is, thus, safe to say that with this uncertainty, there is a possibility for market fluctuation in India too. So, let's delve into the potential aspect and what investors need to consider before investing in cryptocurrency.A cryptocurrency crackdown typically entails the introduction of more strict regulations and compliance requirements. In this context, investors may be required to adhere to Know Your Customer (KYC) and Anti-Money Laundering (AML) procedures, furnish additional documentation, and fulfill reporting obligations. As a result, this may heighten administrative burdens and lead to more stringent compliance requirements for crypto projects, potentially impacting their operations and raising barriers to entry for new projects.The protection of investors emerges as a primary goal of regulatory crackdowns, aiming to safeguard them against the inherent risks posed by fraud, scams, and illicit activities in the cryptocurrency market. Through the implementation of stricter regulations, a multitude of enhanced measures can be introduced to reinforce investor protection.These measures encompass a comprehensive range of disclosure requirements, thereby promoting increased transparency and instilling heightened confidence among investors. Furthermore, strengthened safeguards are established to counteract fraudulent practices, effectively establishing a fortified investment environment that fosters trust and security for individuals venturing into the dynamic realm of cryptocurrencies.The impact on investment returns resulting from a cryptocurrency crackdown may introduce uncertainty in the immediate aftermath.Regulatory interventions and the prevailing market sentiment have the potential to trigger short-term price fluctuations, possibly leading to market corrections. Nevertheless, when viewed holistically, a diligently regulated and unwavering market can offer investors a more promising investment landscape over the long haul. This steadfastness and regulatory oversight evoke heightened confidence and establish the foundation for a sustainable and thriving market, ultimately presenting investors with amplified.On the other hand, regulatory actions may also create short-term volatility and uncertainty in the market. This, in turn, could impact the overall growth and future adoption of cryptocurrencies.Thus, investors need to stay informed about the regulatory landscape, comply with the applicable regulations, and conduct thorough due diligence before making investment decisions in the cryptocurrency market. Moreover, seeking professional advice from financial and legal experts can help navigate the evolving regulatory environment and assess the potential impact on investment strategies.The outlook for cryptocurrency in India for investors during a crackdown is uncertain and contingent upon multiple elements. SEC's crackdowns may introduce initial obstacles, their primary objective is establishing a secure industry foundation. Investors may encounter short-term market volatility and heightened compliance obligations, affecting prices and the confidentiality of transactions.Nevertheless, crackdowns safeguard investors against fraud and illicit activities, bolstering confidence and attracting institutional investors to facilitate long-term market expansion. According to Statista, the cryptocurrency market is expected to grow at a CAGR of 9.83% to reach $324 million by 2027.In addition, the formulation of clear guidelines can stimulate innovation and responsible conduct, culminating in a sustainable investment environment. Despite direct uncertainties, the crackdown is anticipated to yield a regulated and mature cryptocurrency market, presenting growth prospects for compliant investors. Thus, in order to get long-term growth, investors need to focus on a trusted advisor before investing in cryptocurrency.(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of the Economic Times)"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vYWRtaXJhbG1hcmtldHMuY29tL2VkdWNhdGlvbi9hcnRpY2xlcy9jcnlwdG9jdXJyZW5jaWVzL2hvdy10by10cmFkZS1ldGh1c2TSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 10:21:20 GMT",
        "title": "How to Trade ETHUSD - Admiral Markets",
        "content": "Ethereum is the original alt-coin. After Bitcoin, it created waves around 2015. Today, Ethereum has the second-largest market capitalization among all cryptocurrencies.\n\nIn this article, we will dig deeper into what Ethereum is, what it offers, and how the US economy is doing. We will also look in more detail at how to trade Ethereum vs the USD, also known as how to trade ETHUSD.\n\nLastly, we will explore various factors and mindsets when creating Ethereum trading strategies and mention a few words about risk management.\n\nAre you ready to learn more about how to trade ETHUSD? Let’s get started.\n\nThe USD and the American Economy at a Crossroad\n\nThe largest economy in the world, in dollar terms, is still the United States. While China continues to catch up, the US is still ahead and has several advantages over China.\n\nThe US has one of the most talented human resource pools in the world which plays a big part in the US leading the world when it comes to innovation and technology.\n\nHowever, the technology stock sector has gone through a slump lately. The pandemic-time policies of the US and the accumulation of debt over a few decades mean the US faces a tough financial environment.\n\nThe Federal Reserve fights inflation, rising interest rates, and other challenges. However, the labour market remains tight. Bank collapses triggered by the SVB bank episode also continue to be a concern.\n\nYou can learn about forex, currencies, trading, and markets in one of the many free webinars that Admirals conducts regularly, hosted by experienced and reputable traders.\n\nClick the link below to join one of our upcoming webinars:\n\nFree trading webinars Tune into live webinars hosted by our trading experts REGISTER FOR FREE\n\nA Closer Look at Ethereum\n\nEthereum is a decentralized blockchain-based platform and the currency to transact on the Ethereum platform is called Ether.\n\nHowever, most people refer to Ether as Ethereum, and the terms are often used interchangeably - even though they actually mean two different things.\n\nEthereum made the concept of dApps (decentralized apps) popular. It brought terms like ‘smart contracts’ to the fore.\n\nThe Ethereum platform allows developers to create decentralized apps and program smart contracts.\n\nSmart contracts are self-executing contracts that find use cases in a wide variety of applications like supply chain management, voting, and crowdfunding.\n\nIf you’d like to practice trading the markets with cryptocurrency CFDs, without risking your capital, you can do so by registering a demo account with Admirals.\n\nThis is an option for beginner traders who would like to gain a better understanding of various financial markets.\n\nInterested? Click the banner below to register a free Admirals demo account:\n\nRisk Free Demo Account Register for a Free Online Demo Account and Master Your Trading Strategy OPEN DEMO ACCOUNT\n\nHow to Trade ETHUSD\n\nWhen one wants to buy Ether (ETH), one has to pay for it by using a base currency.\n\nUsually, the US dollar is used to transact. However, people in other countries use the Euro, the Pound, the Yen, or many other currencies.\n\nLet us take the example of the US dollar. Let us assume that you want to purchase one Ether. At an exchange rate of $1750, one can pay that amount to buy one ETH. ETH/USD denotes the Ethereum-US Dollar pair.\n\nETH is the base currency while the US dollar is the quote currency. The idea is to either go long or short the pair. A pair is like a ratio. If you think Ethereum will become more valuable and its price will rise, you would go long and pay US dollars to buy ETH.\n\nIf you think that ETH will face challenges or its price will fall for whatever reason, you could go short ETH/USD.\n\nOne can trade an ETH/USD Contract for Difference (CFD) and optionally use leverage for the trade. Leverage allows traders to place orders on ETH CFDs significantly higher than their actual deposit.\n\nHowever, just as leverage amplifies profits, it can also give you outsize losses. We will talk more about that in the risk management section towards the end of this article.\n\nYou can view the Daily fluctuations of ETHUSD, below, via the TradingView widget, to gain a better understanding of the price movements:\n\n*Past performance is not representative of future results.\n\nHow to Trade ETHUSD: Advantages and Disadvantages\n\nAs with all trading and investing activity, there are both advantages and disadvantages to consider before implementing any given strategy or decision with a financial asset.\n\nNaturally, not every financial asset will be suitable for all individuals; it’s important to always first consider your risk management tolerance while also making sure to monitor the performance of your positions.\n\nSome advantages of trading ETHUSD can include:\n\nHave exposure to the largest alt-coin in the cryptocurrency space\n\nExploit the correlation between Ethereum and the USD\n\nTrade in two assets that are among the most widely traded assets.\n\nAlternatively, we also look at some of the disadvantages of trading ETHUSD:\n\nFinding it tough to find any pricing anomalies as ETH and USD are widely traded assets\n\nDealing with the high volatility of cryptocurrency assets in general\n\nHow to Trade ETHUSD: Potential Scenarios\n\nLet us discuss how one may consider strategies that could be used when deciding how to trade ETHUSD.\n\nFor any trade, one may generally follow either a discretionary approach or a rules-based approach. A discretionary approach is ad-hoc - you spot an opportunity and you trade. Your instinct and psychology play a big part in this approach.\n\nA rules-based approach has predefined rules. If those rules are triggered, you take the trade. You then don’t think about how the market is or how your mood is or what your hunch says. You blindly follow the system that you have created.\n\nNo one approach is better than the other. You can follow whatever you are comfortable with. In both approaches, you can use one or more of the technical indicators that Admirals offers its users.\n\nYou can use these indicators to design rules, create trigger points, and analyze the price action. Some popular indicators include the relative strength index (RSI), the moving average (MA), and the Bollinger bands.\n\nOne moving average strategy could be to go long when the ETHUSD exchange rate is above its 200-day moving average. On the other hand, one could go short ETHUSD if the price is below its 200-day moving average.\n\nTraders may also use the RSI indicator to spot when the price action is bullish (RSI>50) or bearish (RSI<50) and accordingly go long or short.\n\nThese are general examples of how to use the indicators mentioned and should always be compared with other market factors. Please also always consider your risk tolerance and risk management style before entering into any given trade.\n\nHow to Trade ETHUSD: Conclusion\n\nWe wouldn’t want to end this discussion on how to trade ETHUSD without a word on risk management. It is recommended that a risk-reward ratio is defined before executing any trade.\n\nIt is also recommended that position sizes are such that you don’t cross your maximum loss threshold even if your stop-loss level is hit. It is important to use features like price alerts and stop losses to effectively execute a trading strategy.\n\nWe hope that you now have a solid understanding of how to trade ETHUSD. By now, you should have a basic idea of where the US dollar is and what the value proposition offered by Ethereum is.\n\nIf you feel ready to start your trading journey, then you may sign up with Admirals. Our registration process is seamless – Click the link below in order to open a live account:\n\nOpen a Live Account Trade the Live Markets and Trade Efficiently TRADE NOW\n\nWhat is ETHUSD? The acronym ETHUSD is the representation of the price of the Ethereum cryptocurrency against USD when represented in foreign exchange.\n\nHow do you trade Ethereum with USD? It's possible to trade Ethereum with USD (ETHUSD) via Contracts for Difference (CFDs) at a regulated broker (like Admirals) or you can trade ETHUSD on a traditional cryptocurrency exchange.\n\nOther Suggested Articles of Interest:\n\nINFORMATION ABOUT ANALYTICAL MATERIALS:\n\nThe given data provides additional information regarding all analysis, estimates, prognosis, forecasts, market reviews, weekly outlooks or other similar assessments or information (hereinafter “Analysis”) published on the websites of Admiral Markets investment firms operating under the Admiral Markets and Admirals trademarks (hereinafter “Admirals”). Before making any investment decisions please pay close attention to the following:\n\n1. This is a marketing communication. The content is published for informative purposes only and is in no way to be construed as investment advice or recommendation. It has not been prepared in accordance with legal requirements designed to promote the independence of investment research, and that it is not subject to any prohibition on dealing ahead of the dissemination of investment research.\n\n2. Any investment decision is made by each client alone whereas Admirals shall not be responsible for any loss or damage arising from any such decision, whether or not based on the content.\n\n3. With view to protecting the interests of our clients and the objectivity of the Analysis, Admirals has established relevant internal procedures for prevention and management of conflicts of interest.\n\n4. The Analysis is prepared by an independent analyst (hereinafter “Author”) based on Brandie E Blackler, Financial Analyst, personal estimations.\n\n5. Whilst every reasonable effort is taken to ensure that all sources of the content are reliable and that all information is presented, as much as possible, in an understandable, timely, precise and complete manner, Admirals does not guarantee the accuracy or completeness of any information contained within the Analysis.\n\n6. Any kind of past or modeled performance of financial instruments indicated within the content should not be construed as an express or implied promise, guarantee or implication by Admirals for any future performance. The value of the financial instrument may both increase and decrease and the preservation of the asset value is not guaranteed.\n\n7. Leveraged products (including contracts for difference) are speculative in nature and may result in losses or profit. Before you start trading, please ensure that you fully understand the risks involved."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3LnRyb253ZWVrbHkuY29tL2V0aGVyZXVtLWV0aHNjcmlwdGlvbnMtY3JlYXRlLWRpZ2l0YWwtYXJ0aWZhY3RzL9IBT2h0dHBzOi8vd3d3LnRyb253ZWVrbHkuY29tL2V0aGVyZXVtLWV0aHNjcmlwdGlvbnMtY3JlYXRlLWRpZ2l0YWwtYXJ0aWZhY3RzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 17 Jun 2023 07:00:00 GMT",
        "title": "Ethereum's Ethscriptions: A Revolutionary Way To Create & Share Digital Artifacts - TronWeekly",
        "content": "Middlemarch, a co-founder of NFT infrastructure Capsule 21, has recently unveiled an innovative Ethereum-based inscription system called Ethscriptions.\n\nThis new system allows users to create and share digital artifacts through Ethereum transaction call data, similar to Bitcoin inscriptions. Middlemarch has announced plans to open-source the indexer in the near future.\n\nThe announcement was made on Twitter, where Middlemarch expressed excitement about the launch of Ethscriptions. The tweet read, “Introducing Ethscriptions: a new way of creating and sharing digital artifacts on Ethereum using transaction calldata.”\n\nIntroducing Ethscriptions: a new way of creating and sharing digital artifacts on Ethereum using transaction calldata.https://t.co/XfQ7RdtblD\n\n\n\nALSO: Introducing Ethereum Punks. Because why should all non-contract Punk collecting happen on Bitcoin?https://t.co/d3Ycwbdc2Z… — Middlemarch (@dumbnamenumbers) June 16, 2023\n\nMiddlemarch also acknowledged the contributions of Michael Hirsch, the founder of Indelible_Labs, for helping build the front end and @duvtale for selecting the vibrant background color (#c3ff00).\n\nCreating & Sharing Digital Artifacts On Ethereum With Ethscriptions\n\nSo how exactly do Ethscriptions work? The process is quite intriguing. Any successful Ethereum transaction that contains input data interpreted as a valid data URI can create an Ethscription as long as the data URI is unique. Duplicate content is automatically disregarded.\n\nFurthermore, Ethscriptions support all valid mime-types, ensuring compatibility with a wide range of digital files.\n\nTo maintain uniqueness, an Ethscription’s content must not match that of any previous Ethscription from a previous block or a transaction within the same block.\n\nIt ensures that each Ethscription represents a distinct digital artifact. Additionally, any Ethereum transaction whose input data corresponds to the transaction hash of a valid Ethscription is considered a valid Ethscription transfer as long as the transaction’s sender is the Ethscription’s owner.\n\nThe recipient of the creation transaction determines the initial owner of an Ethscription, while the sender of the creation transaction is recognized as the Ethscription’s creator.\n\nethscriptions.com\n\nAccording to the original site page providing information on Ethscriptions, getting started with this new system is relatively straightforward. Users can either utilize an easy creation tool available on the site or follow a step-by-step process.\n\nTo create an Ethscription manually, one can convert an image (with a maximum size of approximately 90KB) into a Base 64-encoded data URI using a service like base64-image.de.\n\nAlthough Ethscriptions support all data URIs, images tend to yield the best results. The data URI should then be converted to hex using an online tool such as hexhero.\n\nFinally, users can send a 0 ETH transaction to the desired recipient, including the hex data from the previous step in the “Hex data” field. Within a short period, the Ethscription should appear on the page, provided no one has already created an Ethscription with the same data. The system automatically filters out duplicate content.\n\nHowever, as Middlemarch opens up the indexer to the public, it is expected to further empower artists and collectors in the world of NFTs, fostering creativity and innovation within the digital art community.\n\nRelated Reading | Entrepreneur Mark Cuban Slams SEC and John Reed Stark’s ‘Crypto Obsession’"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiJGh0dHBzOi8vd3d3LmFzaWFjcnlwdG90b2RheS5jb20vbmVvL9IBJGh0dHBzOi8vd3d3LmFzaWFjcnlwdG90b2RheS5jb20vbmVvLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 17 Jun 2023 07:00:00 GMT",
        "title": "What is Neo? China's Ethereum Rival - Asia Crypto Today",
        "content": "In an era where the digital economy is fast reshaping our understanding of finance and commerce, blockchain technology has surfaced as a pivotal innovator. Among the numerous platforms making strides in this space, NEO stands out, exhibiting a unique combination of technological advancements and forward-thinking economics. This guide delves into the heart of this dynamic platform, exploring its origins, distinctive features, security measures, dual-token system, and a plethora of benefits that make it a noteworthy player in the blockchain sphere.\n\nBackground\n\nEmerging in 2014 under the moniker Antshares, the NEO project aimed to innovate and lay the foundations for the “smart economy”. This innovative vision was spearheaded by Da HongFei and Erik Zhang, who then introduced the initial coin offering for Antshares (ANS). In the duration of the ICO, the founders successfully amassed over 6,000 BTC.\n\nIn 2016, Antshares underwent a significant metamorphosis and reemerged as NEO, in a move that offered ANS token holders the opportunity to transition their assets into the reimagined currency. The term “NEO”, which derives from the Greek language, symbolizes something that is “new” or “young”. This terminology epitomizes the mission of the NEO project – to usher in a novel, advanced, and more efficient smart economy, boasting an impressive potential transaction processing rate of 10,000 transactions every second.\n\nAnnounced in 2018, the Neo 3.0 protocol update is the next leap forward in the project’s development journey. This much-anticipated update was slated for official release in September 2021, symbolizing another important step towards realizing the project’s ambitious vision.\n\nWhat is Neo?\n\nNEO is a blockchain platform engineered to revolutionize asset and identity management by leveraging the power of smart contracts. The ultimate ambition is the realization of a fully-digitized, smart economy. In this futuristic economic model, digital identities and digital assets play a pivotal role in enhancing life quality for all individuals.\n\nThe unique strength of NEO lies in its aspiration to streamline digital asset management, utilizing the capabilities of smart contracts. Ultimately, it seeks to erect a decentralized, network-driven, smart economy infrastructure facilitated by an ecosystem of decentralized applications. The goal here is not only to digitize but also to automate, making transactions, interactions, and operations far more efficient and secure than ever before.\n\nHow is the Neo Blockchain Secured?\n\nThe NEO blockchain utilizes the Proof of Stake (PoS) consensus model alongside a distinctive protocol, delegated Byzantine Fault Tolerance (dBFT). This novel combination empowers NEO to process a vast number of transactions, reaching up to an impressive 10,000 transactions per second, while functioning across centrally endorsed nodes.\n\nThis hybrid of the PoS protocol and dBFT consensus mechanism furnishes NEO with the ability to scale its network effectively. It results in quicker transactions, smoother execution of smart contracts, and ease in the development of decentralized applications (Dapps).\n\nThe network supports two native tokens: NEO and GAS. NEO, which is indivisible, plays a central role in payment settlements on the platform and also has a significant role in network governance. NEO holders can stake their tokens to vote for consensus nodes. On the other hand, GAS, which is divisible up to 0.00000001, is utilized primarily for transaction fees. Consensus nodes, responsible for new block generation, receive rewards in GAS fees.\n\nFurthermore, the protocol offers a unique toolset for developers in the form of NeoContracts. These smart contracts allow for the creation and development of Dapps, directly mirroring real-world products and services. An attractive feature of NeoContracts is their compatibility with widely recognized programming languages such as Java, providing developers an advantage by not requiring them to learn a new language for Dapp development. This unique aspect sets them apart from smart contract protocols used by other Dapp networks.\n\nExploring NEO’s Dual-Token System\n\nA defining feature of NEO is its pioneering dual-token mechanism, making it the first public blockchain platform to separate network usage rights from governance rights. This also facilitates easy acquisition of the required tokens for transaction fees.\n\nNEO\n\nIn the context of network governance, tokenholders are granted the privilege of voting for the Neo Committee. This committee consists of various members and consensus nodes that oversee the governance of the NEO blockchain. They are tasked with a variety of critical functions such as upholding the network’s liveliness and making necessary adjustments to vital blockchain parameters.\n\nOne unique characteristic of NEO tokens is their indivisibility – the minimum unit of NEO is 1. This indicates that transactions, such as withdrawals from exchanges to wallets, can only occur in whole numbers. As a result, NEO stands out as one of the scarcest public blockchain tokens since it cannot be fragmented into smaller units.\n\nAt the inception of the network, 100 million coins were produced, with roughly half reserved by the Foundation to stimulate the development of the NEO ecosystem.\n\nGAS\n\nGAS, the second token in NEO’s dual-token system, is utilized for operations and storage of tokens and smart contracts within the network. This practice prevents the misuse of node resources. System fees are destroyed, while network fees are redistributed amongst consensus nodes, offering an economic incentive for their contributions to the network.\n\nThe smallest unit of GAS is 0.00000001, and unlike some other networks, NEO doesn’t require staking to claim GAS tokens. The majority of Neo wallets include a claim function, enabling users to gather their GAS at the click of a button. It’s worth noting that some exchanges distribute GAS to users who hold NEO on their platform, while others don’t.\n\nThe lion’s share of GAS is disseminated to voters as a reward for their active involvement in network governance. Thus, NEO holders who wish to partake in this process should ensure they select a wallet that supports the voting function.\n\nAdvantages of Neo\n\nNEO, an open-source blockchain, shares common traits with Ethereum and other platforms that allow developers to craft smart contracts and construct decentralized applications (dApps). With the initiation of a migration to a new version, N3, in 2021, NEO showcased a series of intriguing features, which include:\n\nMultilingual Support: Aiming to be a developer-friendly blockchain, the protocol extends its support to various programming languages. The Neo Blockchain Toolkit, designed for creating blockchain applications, offers compatibility with C#, Python, Go, TypeScript, and Java.\n\nDecentralized Storage: The distributed, decentralized storage network, known as NeoFS, is a unique feature of NEO. This system enables the encryption and secure storage of data.\n\nNative Oracle: NEO boasts its own oracle service, allowing developers to tap into off-chain or external data sources. This unique feature adds a whole new level of versatility to the platform.\n\nSelf-sovereign Identity: The NeoID, a decentralized identity tool, allows for user authentication in blockchain-based applications. This offers users an extra layer of security and control over their digital identities.\n\nInteroperability: As a founding member of Poly Network, an alliance designed to facilitate cross-blockchain transactions, NEO embodies true interoperability. This membership enables transactions across a myriad of networks, including Ethereum and BNB Chain, thus increasing the overall functionality and reach of the platform.\n\nConclusion\n\nNEO serves as a beacon of innovation in the ever-evolving world of blockchain technology. Its commitment to creating a “smart economy”, coupled with its unique dual-token system and various other notable features, solidifies its position in the global blockchain ecosystem. NEO’s mission to support multiple languages, offer decentralized storage, and provide native oracle services is a testament to its inclusive and adaptable nature.\n\nWith the ongoing development and implementation of advanced features, NEO remains poised to usher in the future of digitized assets and identities, carving a path towards a more secure, efficient, and interconnected digital economy. Whether you’re a developer, investor, or a blockchain enthusiast, NEO’s offerings undeniably hold vast potential in the years to come."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmJsb2NremVpdC5jb20vYXJnZW50LXdhbGxldC1yZXZpZXctaXMtdGhpcy10aGUtYmVzdC1ldGhlcmV1bS13YWxsZXQtdG8tdXNlLWluLTIwMjMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Jun 2023 07:00:00 GMT",
        "title": "Argent Wallet Review: Is This The Best Ethereum Wallet In 2023? - Blockzeit",
        "content": "Argent Wallet is one of the latest trends in the diversified range of cryptocurrency wallets. The wallet solely helps users who only operate on the Ethereum blockchain. Being a new player in the market, the wallet has quickly gained popularity among crypto enthusiasts. But what makes it stand out from the rest?\n\nIn this Argent wallet review, we explore the features, benefits, and drawbacks of the wallet, which may help you decide if it is the right choice.\n\nWhat is Argent Wallet?\n\nArgent Wallet is a leading Ethereum-based cryptocurrency wallet that launched in 2020. During the time, the wallet was only meant to be a layer one wallet. However, From that time, the demand for Ethereum has grown, and gas fees on the protocol skyrocketed. The team behind the wallet developed a faster, more scalable version, Argent Wallet Layer 2.\n\nThe updated version is not a substitute for the Layer 1 counterpart but includes a broader range of benefits. The Layer 1 option remains the wallet’s main settlement layer.\n\nThe wallet is available as a mobile app for iOS and Android. It allows you to store, send, earn interest, and invest within the wallet. It also brings in a unique functionality that assists in making decentralized apps (dApps).\n\nThe Argent Wallet is decentralized, and only you can access your assets, and nobody has the power to stop you from accessing them.\n\nPros\n\nGives multiple layers of security compared to other crypto wallets.\n\nIt supports tricky wallets and enables easy recovery.\n\nThe wallet gives returns as interest on the assets lent by users through DeFi.\n\nHas a low gas fee.\n\nCons\n\nSmart contract clashes when liquid staking ETH.\n\nCentralized infrastructure even though it is a decentralized hot wallet.\n\nThe indirect process of storing WBT can be challenging for new users.\n\nHow Does Argent Work?\n\nTo use Argent Wallet, you must download the mobile app on your iOS or Android smartphone. As the wallet is built on the Ethereum blockchain, your assets are stored, and you control them through the Argent app.\n\nYou have complete control over your wallet as you hold the private keys. Argent cannot access your assets or stop you from accessing them. You can also use the funds for other actions like transactions with external dApps.\n\nArgent Wallet Key Features\n\nArgent has some outstanding features. Such custom traits are mainly designed to ensure that you get maximum wallet benefits.\n\nETH Staking\n\nArgent offers a lucrative Ethereum staking on the Ethereum chain after the merge and cross-chain on leading Layer 1 blockchains like Solana, Polkadot, Terra, and Polygon.\n\nArgent has also integrated Lido Finance as one of its DeFi applications to achieve the requisite staking capabilities. Lido is a central liquid staking platform popular among enthusiasts. Stakers can commit their assets to the platform for profit, and then Lido generates derivative tokens.\n\nSecurity\n\nLike all crypto wallets, protecting your assets should be your number one concern. Argent operates as one of the most secure wallets. As a non-custodial DeFi wallet, only you can access and control your crypto assets, not even Argent. The platform implements some of the best security features targeted at transfer protection.\n\nArgent implements multi-sig protection, where you can select guardian accounts. There is also a seed-phrase-free wallet recovery. In this way, when you lose the credential to your wallet, you can quickly regain access without seed phrases. The wallet also implements wallet locking, where a guardian can prevent your wallet from making transactions.\n\nProfits from Liquidity Generation\n\nArgent allows for the presence of good liquidity pools. For instance, the USDC/DAI liquidity pool generates about 2.5% of revenue for its liquidity providers. However, it is crucial to note that Argent is more lucrative using the Balancer integration.\n\nArgent Wallet Fees\n\nAt its launch, Argent intended to provide fee-free transactions. However, the increase in gas fees made it no longer feasible for them to do so. Argent only charges a 0.5% commission per transaction. The commission is paid in ETH.\n\nBesides that, you may incur the network’s gas fee, which entirely goes to the Ethereum blockchain, facilitating transactions. Gas fees fluctuate based on network congestion. Argent is, however, affordable as it has reduced congestion due to its high transaction processing speeds.\n\nSupported Cryptocurrencies and DApps\n\nThe Argent wallet is built on the Ethereum blockchain and is focused on Ethereum. You can access over 240 different Ethereum-based (ERC20) tokens in Argent. Such tokens include ETH, DAI, MKR, LINK, USDT, UNI, and WBTC.\n\nAdditionally, the wallet paves the way to access the most popular DeFi dApps from within your wallet. You can easily earn interest by providing liquidity for loans and exchanges with Compound, DAI savings, AAVE, and PoolTogether.\n\nHow to Install Argent Wallet Extension on Your Computer\n\n1: Head over to the Chrome browser Argent Wallet extension and click the Add to Chrome button.\n\nStep 2: Click Add Extension on the pop-up button, which allows Chrome to download the extension.\n\nStep 3: Once the downloads s complete, you will be redirected to an Argent X tab with the options to either Create a new wallet or Restore an existing one. Create the new wallet option.\n\nStep 4: Read the disclaimer, check the boxes next to them, and click Continue to proceed.\n\nStep 5: Enter your password, reconfirm it, and click Create Wallet. Finish the process.\n\nFinal Thoughts\n\nArgent is a wallet with high potential and comprises a unique combination of functionalities that can be utilized by a vast range of users from varying blockchains. For any user who only deals with the Ethereum blockchain, Argent would be an easy recommendation for those who are okay with maintaining a separate wallet for their Ethereum-based assets.\n\nThe only drawback of its functionalities is that it only supports tokens built on the Ethereum blockchain. There is also no desktop app for Argent, only an extension.\n\nFAQs\n\nIs Argent Wallet free?\n\nYou do not need to pay a dime to use the Argent wallet.\n\nIs Argent Wallet safe?\n\nArgent Wallet operates as one of the safest software crypto wallets on the market. The wallet is self-custodial and implements more security features like multi-sig, seed-phrase-free wallet recovery, and wallet locking. Such measures prevent unauthorized asset transfers."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDYvMTcvaG93LXF1YWxpZnktc2Nyb2xsLWFpcmRyb3Av0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 17 Jun 2023 07:00:00 GMT",
        "title": "How to qualify for the Scroll airdrop - The Cryptonomist",
        "content": "In this guide, let’s look at all the steps you need to take to qualify for Scroll’s long-awaited airdrop.\n\nThe layer 2 network, currently still in testing, will be launched in 2 months and could reward one’s community with gift tokens.\n\nFull details below.\n\nWhat is Scroll?\n\nScroll is an Ethereum-based layer 2 zkEVM, under development since 2021, that will most likely release an airdrop to early users in its ecosystem.\n\nIt is currently still in testnet, but it is estimated that in August there will finally be a mainnet launch, which will likely decree the need to launch a native network token, which is still absent.\n\nThe team behind the new layer 2 has raised 80 million in funding from some Venture Capitalists such as PolyChain and Sequoia, so it seems feasible that some of this money could be used for various marketing strategies including an airdrop.\n\nUsually investments from external companies in ecosystems where there is no token (and on which there would be a need) is a signal warning of potential cryptocurrency reward airdrops.\n\nSince February, Scroll has landed on the Test Goerli Ethereum network, attracting much attention from the users of Vitalik Buterin‘s blockchain.\n\nShould a token actually be developed (it is very likely, but not 100% sure) those who will use the blockchain in its testing phase, performing various on-chain actions, could be rewarded with a 3-zero airdrop.\n\nIn terms of the technical features of this network, it is worth mentioning what Scroll focuses on.\n\nFirst, the network focuses heavily on the scalability concept, processing much of the off-chain transitions thanks to the computational proofs inherent in zk.\n\nHigh throughput plays a major role in ensuring much faster operations than those performed by the main Ethereum substrate.\n\nIn addition, the “EVM compatibility” factor means that all developers using solidity in the main DeFi industry network can easily deploy their work on Scroll.\n\nFinally, the security feature covers a key role in the vision of the Layer 2, which is subjected to several third-party checks to avoid unpleasant mishaps such as hacks or exploits that are unfortunately commonplace in the Web3 world.\n\nAirdrop Scroll: bridge from Ethereum\n\nThe first activity worth focusing on to try to get Scroll airdrop is to bridge funds from the Goerli Ethereum test network to the layer 2 network.\n\nOf course, all of these steps are free, as the network has not yet landed on the mainnet, so why not give it a try?\n\nFirst it is necessary to go to the official website dedicated to the alpha testnet of Scroll, and connect a MetaMask wallet to the decentralized application.\n\nOnce the wallet is connected, you will need to add Goerli Testnet and Scroll Testnet by simply clicking on the “add to metamask” items and approving transactions for free in the pop-up that will appear on your extension.\n\nOnce you have performed this step it will be mandatory to get hold of some GETH tokens (Goerli ETH).\n\nThe easiest way to obtain these test cryptocurrencies for free is to use the faucets on the web.\n\nWe recently presented a guide to the Mantle airdrop where it was explained how to do this.\n\nIn any case, if you don’t want to waste your time, try the various links on this google document.\n\nYou will only need to get a few fractions of GETH to continue with the next steps.\n\nAmong these, a key step involves bridging tokens to the Scroll network, which has to be done in this section.\n\nAfter bridging the tokens and obtaining the equivalent in ETH on the Scroll network, we will already be halfway done.\n\nIt is worth noting how repeating these moves several times over the next two months will be critical to increasing your chances of getting the airdrop.\n\nSometimes crypto projects that aim to reward the community with tokens, assessing the repetition of actions over several days, discard casual users.\n\nSo don’t be lazy and do as many transactions as possible!\n\nHow to become eligible for the Scroll airdrop: testing the protocols in the testnet\n\nThe last steps to perform, as in any self-respecting airdrop guide, involve exploring the decentralized protocols built on the Scroll network.\n\nThe layer 2 already hosts some very well-known dApps in the Web3 landscape, such as Aave, Orbiter Finance and Syncswap.\n\nThe goal is to perform as many transactions as possible between now and the next 2 months (as these are free) by going to prove from an on-chain activity point of view that they are regular users.\n\nThe first dApp to interact with is Syncswap, the DEX of reference for the ZkSync Era network, which has recently integrated the alpha testnet of Scroll.\n\nPerform a few swaps between ETH, USDC, WETH and USDT remembering to always leave a few fractions of ETH in the wallet to pay the gas fee, or you will have to repeat the faucet procedure on the Goerli and bridging the tokens again.\n\nThe price feeds may be off as the network is still being tested, so do not be alarmed if you can swap 0.2 ETH with over 3 million USDC, as shown in the image\n\nThe second dApp on which to play around a bit is Aave, the main borrowing/lending platform for the entire DeFi sector.\n\nThe first thing to do is to enable “testnet mode” in the settings in the upper right corner, and select the alpha Scroll network.\n\nNext, to simplify the whole process, click on “faucet” and request all the tokens in the platform, approving the transaction from your wallet.\n\nThe more types of tokens you have in your wallet the more transactions you can perform on the platform, maximizing the potential gain from the airdrop\n\nOnce this is done you can perform a long series of transactions, such as providing tokens in liquidity, borrowing assets, repaying debt, etc.\n\nThe operation is quite simple: in order to borrow assets you must first have provided something in liquidity (supply).\n\nOn Aave there is an interest rate to be paid in the case of borrowing or received in the case of providing liquidity, which varies according to the type of token.\n\nAfter supplying one asset as liquidity and borrowing another, you can repay the debt by clicking on “repay,” thus taking back the funds put up as collateral.\n\nRemember that in case you are trading on the mainnet, if you put a volatile asset into supply to take a debt, you risk being liquidated if the value of the collateral falls below the value of the amount borrowed.\n\nTake advantage of the fact that the tokens are all test tokens in order to familiarize yourself with Aave if you have never used it, so that you will be ready to use it should you need it in reality\n\nFinally, use Orbiter Finance (rinkeby version) to bridge more ETH from the Ethereum Goerli network to the Scroll Testnet, performing the same procedures listed in the previous paragraph.\n\nWait for the launch of the network mainnet to use real funds, increasing even more the likelihood of being eligible for the airdrop.\n\nWe do not yet know when tokens will actually be distributed as rewards for actions performed to the community, in the meantime, better not to waste time!\n\nWe look forward to more information from the Scroll team."
    }
]