[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2xheWVyLTItc2VjdXJlZC1ieS1ldGhlcmV1bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "So your layer-2 is 'secured by Ethereum' — what does that mean? - Blockworks",
        "content": "The chief selling point of layer-2 blockchains built atop Ethereum — aside from increased throughput — is security. Ideally, it should be faster and cheaper to interact with L-2s, but also as safe to transact as using Ethereum.\n\nUnsurprisingly, in practice it’s complicated and not always black and white.\n\n“Security,” in this context, refers to the settlement guarantees on Ethereum mainnet. That translates to how certain a user can be that their L-2 transactions will be finalized correctly — without censorship — and whether assets remain safe from being stolen by the more performant layer-2.\n\nWe’re not talking security from smart contract bugs at the level of applications (it’s not about avoiding exploits or rugpulls), but whether the Ethereum Virtual Machine runs the code and reconciles its state per specifications.\n\nThere’s not a universally accepted definition of what it means to be “secured by Ethereum.” According to Louis Guthmann, ecosystem lead at StarkWare, a key feature of assessing whether an L-2 qualifies is the existence of an “escape hatch” — a way to permissionlessly exit with one’s assets back to Ethereum mainnet.\n\n“A layer-2 requires a mechanism that allows itself to resolve its challenges using the main chain,” Guthmann told Blockworks.\n\nData aggregator L2Beat defines a layer-2 as “a chain that fully or partially derives its security from [Ethereum mainnet] so that users do not have to rely on the honesty of L2 validators for the security of their funds.”\n\nIt provides a handy “risk analysis” framework for keeping track of various L-2 options. Projects are ranked by total value locked (TVL), not security, but the framework compares all active layer-2s across a spectrum of security-related criteria.\n\nSource: L2Beat\n\nOf these, the “state validation” method is what L2Beat deems “most important” because that is how the chain “ensures that L2 validators cannot cheat and include invalid transactions in a L2 block, e.g. mint coins out of thin air or steal your coins,” according to the site’s FAQ.\n\nValidation occurs through either validity proofs (also known as ZK proofs) or fraud proofs (also known as fault proofs).\n\nA zero-knowledge proof is a cryptographic technique used in layer-2 rollups to verify the correctness of a transaction or computation without revealing any sensitive information.\n\nImagine you have a treasure chest with a secret combination lock, and you want to prove to your friend that you know the correct combination without actually telling them the numbers. With a zero-knowledge proof, you can demonstrate conclusively that you can open the chest and thus have the combination, without actually disclosing the code.\n\nFraud proofs are an alternative way to detect and prevent malicious activities or errors in the transaction processing on a rollup. It ensures that the transactions executed off-chain are honest and accurate.\n\nThe proof on Ethereum mainnet acts like a referee who checks the moves of a chess game to make sure they are legal. If anyone tries to cheat or submits an incorrect game state, the fraudulent or faulty action won’t be accepted.\n\nData availability refers to whether transaction data is stored on Ethereum mainnet — the most secure — or elsewhere.\n\nCombining these two, we have four widely accepted varieties of Layer-2s. Per L2Beat:\n\nzkRollups — Validity Proofs with data on L1 Ethereum;\n\nOptimistic Rollups — Fraud Proofs with data on L1 Ethereum;\n\nValidium — Validity Proofs with data kept off-chain; and\n\nPlasma — Fraud Proofs with data kept off-chain.\n\nEach of these varieties entails tradeoffs, and some may be more suited to specific use cases than others.\n\nThe first zk proof-based rollup was Loopring, which launched a dex back in February 2020. But it has stagnated in recent years, L2Beat data shows, processing about one transaction every 10 seconds, while the chain’s TVL has fallen 88% from its 2021 peak, and consists of over 50% LRC — the chain’s own native token.\n\nA new focus on its smart wallet and gaming initiatives remains.\n\nOptimistic rollup launch\n\nThe first optimistic rollups to hit mainnet were Arbitrum (ARB), launched in August 2021, and Optimism (OP) which followed in December 2021. Both took up the “secured by Ethereum” mantle through the mechanism of fraud proofs.\n\nAccording to Optimism developer OP Labs, “fault proofs” is a more accurate term.\n\n“The system isn’t always detecting ‘fraud,’ the majority of the time it’s just ‘fault’ (i.e. a node wasn’t synced and it agrees with an incorrect output root, etc.),” an OP Labs spokesperson told Blockworks. But L2Beat uses the more common “fraud proof” and they are conceptually interchangeable.\n\nThe difference initially was in the details of the fraud proof implementation. Optimism opted for a simpler “single-round” proof design, while Arbitrum developer Offchain Labs preferred “interactive proofs.”\n\nA subsequent audit of Optimism by security researcher Yoav Weiss showed in March 2022 that “single-round fraud proofs are hard to secure,” for which he received a retroactive grant from the Optimism team.\n\n“If fraud proofs become too complex, they could make full decentralization too risky,” Weiss wrote. “A malicious sequencer could corrupt and rugpull the entire rollup if it can make an unprovable state transition.”\n\nThe sequencer is a key component of rollups responsible for transaction ordering and can be centralized or decentralized, but today’s examples are predominantly centralized.\n\nOptimism switched to an approach more similar to Arbitrum’s, in its “cannon” release, although Ben Jones, director at the Optimism Foundation, told Blockworks the “vulnerabilities were not the driver for us changing course.”\n\n“It is true though that some flexibility is limited, and our decision to pioneer the first EVM equivalent L2 codebase made that flexibility and modularity more important than ever,” Jones said. “This was the main driver, alongside research breakthroughs resulting from the development of cannon.”\n\nOf the two major optimistic rollups by TVL and activity, only Arbitrum has implemented fraud proofs. That has been a major point of contention between the two teams over security claims, with Offchain Labs co-founder Steve Goldfeder going so far as to analogize Optimism’s current status to “building cars without engines” but then trying “to sell one by putting a sticker on it that says ‘very powerful engine’.”\n\nLoading Tweet..\n\nRelative immaturity\n\nOptimism’s recent Bedrock upgrade introduced a number of improvements, but fault proofs were not among them. Jones didn’t specify a timeline, but said “fault proofs are a key priority on our decentralization roadmap.”\n\n“We are aiming towards reaching [L2Beat’s] Stage 2 decentralization as quickly as possible, and in our view, Stage 2 requires multiple implementations of the fault proof.”\n\nL2Beat released its framework of “stages” earlier this month, building upon Ethereum co-found Vitalik Buterin’s proposed milestones. It notes the stages focus on decentralization “maturity” which is not necessarily directly analogous to security — although there are clear parallels.\n\n\n\nBedrock now has multiple execution clients, a unique feature Jones said, that is “paving the way for multiple [fault] proofs.”\n\nThe OP Stack’s “superchain” concept isn’t limited to fault proofs, but can include zero-knowledge proofs as well. The Optimism Foundation recently put out a request for proposal to develop exactly that, encouraging teams such as Mina protocol’s O(1) Labs to complete its design.\n\nLoading Tweet..\n\nJones said a successful candidate will improve composability between superchains in addition to providing redundancy.\n\n“A very important note on this RFP is that it is for the same exact state machine which the fault proofs run,” Jones said. “This means that having a ZK-secured chain will not require sacrifices to EVM equivalence.”\n\nStarkware’s Guthmann said “having more adoption of zk as their underlying proof system is very exciting for the ecosystem — it’s more investment more research and hopefully more efficient provers and infrastructure for blockchain to develop.”\n\nHe views L2Beat’s concept of Stage 0-to-2 rollups as “a bit too strict.”\n\nTo reach Stage 1, a rollup must have deployed a “complete and functional proof system,” with “at least five external actors who can submit fraud proofs,” and users must be able to exit to Ethereum mainnet “without the help of the permissioned operators.”\n\nStage 2 further requires “the rollup becomes fully managed by smart contracts,” with a permissionless fraud proof system — anyone can submit a proof — and at least a 30-day timelock for system upgrades, giving users “ample time to exit.”\n\nThis goes back to the notion of an “escape hatch.”\n\n“The gap from 0 to 1 is tremendous,” Guthmann said. “And even from 1 to 2 is unrealistic for any L-2 that’s going to have a governance, because basically number two assumes that you’re never going to upgrade your system, which is problematic,” he said.\n\nJones said “permissionless withdrawals are insufficient to be ‘secured by Ethereum,’ if there is still a multisig which can unilaterally break security properties.”\n\nMulti-signature wallet schemes are frequently used to manage the upgradability of smart contracts.\n\n“The ability to withdraw to L1 — to another environment — is what makes them more interesting as a scaleability solution where you keep self-custody,” Guthmann said. Governance of a system relies on some kind of upgradeability, whether it’s Ethereum’s social consensus process, or proof-of-stake token voting, or a multisig controlled by a smaller group.\n\nIt’s fundamentally a question of where chains fall on the decentralization spectrum, and Gutman said zero-knowledge tech enables scaleability gains to come without undermining decentralization.\n\nOf the major rollups, only Arbitrum has reached Stage 1. (Decentralized exchange dYdX is listed based on its deployment on Starkware’s StarkEx system, but it will soon migrate to a Cosmos-based sovereign rollup.)\n\nGuthmann thinks that classification is fully justified. “They’re doing much better than any of the other teams combined,” he said.\n\nBut ultimately, he expects zero-knowledge tech to become the standard on both a security and scalability basis.\n\n“There is a difference between Optimism and their lack of fraud proofs, and zkSync and what Starkware does. There is a difference of technological advancement.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjM3MjA5L2V0aGVyZXVtLW5hbWUtc2VydmljZS1wbGFucy1leHBhbnNpb24tdG8tbGF5ZXItMi1lY29zeXN0ZW3SAWJodHRwczovL3d3dy50aGVibG9jay5jby9hbXAvcG9zdC8yMzcyMDkvZXRoZXJldW0tbmFtZS1zZXJ2aWNlLXBsYW5zLWV4cGFuc2lvbi10by1sYXllci0yLWVjb3N5c3RlbQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Name Service plans expansion to Layer 2 ecosystem - The Block",
        "content": "The Ethereum Name Service (ENS), a decentralized domain name system built on the Ethereum blockchain, will implement Layer 2 interoperability with ENS domains, according to the project’s developer, ENS Labs, during a community call on Thursday.\n\nThe team said it identified Layer 2 interoperability as a crucial upgrade in the pipeline. Layer 2 solutions, such as Arbitrum and Optimism, are ‘off-chain’ mechanisms designed to handle transactions away from the Layer 1 Ethereum blockchain to improve scalability and reduce costs. By providing a mechanism for Layer 2 solutions to interact with ENS domains, the team aims to make domain name registrations and transactions more accessible to a broader user base.\n\nThe team plans to utilize off-chain resolvers with the help of an ENS off-chain registrar contract and various service providers, including the Coinbase-operated project cb.id, Lens Protocol (on Polygon), and OptiNames (on Optimism), among others.\n\nGasless import of web names\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nThe team announced that web-integrated domain name TLDs, including .art and .box, are collaborating with ENS Labs for close integration. This will allow users to register browser-supported names via ENS. Furthermore, it will also enable DNS names to be traded as NFTs on the Ethereum blockchain for the first time this year.\n\nIn this context, a new roadmap feature discussed during the call and included in the roadmap is the option to import DNS, the web naming protocol, into ENS at no transaction costs, thus making it \"gasless.\" This feature, slated for release in the third quarter of the year, has the potential to improve web accessibility to the ENS ecosystem and lower the barrier to entry for traditional internet users, the team noted.\n\n“Gasless DNS names and expanded Layer 2 interoperability, which we aim to launch before the end of Q3, are the next steps in our goal to make ENS names the standard for decentralized digital identity in Web3,” Nick Johnson, ENS founder and lead developer, said in a statement to The Block. “These types of developments are key for us as we work towards simplifying onboarding and increasing the accessibility of Ethereum and crypto.”"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA2LzMwL3doeS1ldGhlcmV1bS1zaGliYS1pbnUtYW5kLWJpdGNvaW4tY2FzaC1hcmUtcmlzaW5nL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Why Ethereum, Shiba Inu, and Bitcoin Cash Are Rising Today - The Motley Fool",
        "content": "What happened\n\nMost cryptocurrencies moved higher today, as more mainstream financial institutions filed to launch spot Bitcoin exchange-traded funds (ETFs) and as altcoins gained steam.\n\nSince late afternoon yesterday, the price of the world's second-largest cryptocurrency, Ethereum (ETH 0.42%), traded 3.4% higher as of 10:35 a.m. ET today. Meanwhile, the price of the meme token Shiba Inu (SHIB 0.73%) traded 4.5% higher, while the price of Bitcoin Cash (BCH 3.59%) had jumped nearly 26%.\n\nSo what\n\nEver since the world's largest asset manager, BlackRock, filed with the U.S. Securities and Exchange Commission (SEC) to launch a spot Bitcoin ETF, cryptocurrencies have been rallying on the belief that more interest in the sector from mainstream financial giants will ultimately increase exposure.\n\nWhile other spot Bitcoin ETFs have been rejected by the SEC, BlackRock's filing seemed to change the game because it proposed a surveillance-sharing agreement with the Nasdaq, where it intends to list the ETF. This agreement would share information about trading activity and the identity of customers, which the SEC believes is necessary to prevent market manipulation.\n\nFollowing BlackRock, a swarm of other players have proposed Bitcoin ETFs with the SEC and the latest is Fidelity, which has also proposed to have a surveillance-sharing agreement. These ETFs would ultimately make it easier for investors to gain access to Bitcoin without having to buy the cryptocurrency itself.\n\nIn other news, Bitcoin Cash has been exploding higher all week, most recently on a ton of trading volume out of investors in South Korea. The excitement continues to be fueled by the news that Bitcoin Cash is one of four cryptocurrencies being listed by a new exchange called EDX Markets, which is backed by Fidelity, Charles Schwab, and Citadel.\n\nInterestingly, the exchange decided to list Bitcoin Cash because it believes regulators are likely to determine that the cryptocurrency is a commodity and not a security. Whether or not cryptocurrencies are commodities or securities is a big point of contention in the crypto ecosystem right now. Commodities would be regulated by the Commodity Futures Trading Commission, while securities would be overseen by what is presumed to be the much stricter SEC.\n\nIn more regulatory news today, a new bill that formally recognizes cryptocurrencies as a regulated financial instrument and investment was officially made a law today in the United Kingdom. Many believe that regulatory clarity is a necessity for crypto to be able to move forward.\n\nNow what\n\nNews regarding spot Bitcoin ETFs has been the biggest driver of cryptocurrencies in recent weeks, so it makes sense that the news regarding Fidelity continued to fuel the sector today.\n\nBut the fact that investors are pouring into Bitcoin Cash because they think the token is likely to be deemed a commodity instead of a security is interesting and could represent a newer trend in the industry.\n\nWith the SEC seemingly getting more aggressive in its attempts to bring more cryptocurrencies under its purview, investors may start to favor those that they view as commodities. While I still like Ethereum the best in this group of cryptocurrencies, this is certainly a trend that bears watching."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDYvMzAvZXRoZXJldW0tZm91bmRlci1zYXlzLWNyeXB0by1pcy1vbi10aGUtY3VzcC1vZi1hLWJyb2FkYmFuZC1tb21lbnQv0gFsaHR0cHM6Ly9mb3J0dW5lLmNvbS9jcnlwdG8vMjAyMy8wNi8zMC9ldGhlcmV1bS1mb3VuZGVyLXNheXMtY3J5cHRvLWlzLW9uLXRoZS1jdXNwLW9mLWEtYnJvYWRiYW5kLW1vbWVudC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Ethereum founder says crypto is on the cusp of a ‘broadband moment’ - Fortune",
        "content": "Since the collapse of FTX in November, the conversation around crypto has been dominated by dark mutterings about its demise or endless chatter over regulation. That’s why it was refreshing to speak to Joe Lubin, one of the cofounders of Ethereum who is now best known for overseeing ConsenSys, which has evolved from a chaotic crypto incubator to a software company known for the popular MetaMask wallet.\n\nUnlike many in the industry, Lubin is brimming with optimism. He still espouses the original gospel of Ethereum, which celebrates decentralized software projects and views blockchains as a vehicle for a new political and social order beyond the reach of Big Tech. In our recent chat, he told me he’s untroubled by the fallout from FTX, which wiped out the likes of Voyager, Celsius, and other centralized crypto services.\n\n“I don’t consider them real crypto companies. They co-opted our messaging to cheat naive consumers,” says Lubin, suggesting the troubles of the past nine months amounted in part to a healthy cleansing.\n\nHe added that the demise of the centralized services has helped true crypto companies focus and rebuild, paving the way for “our broadband moment”—an analogy for when widespread fiber build-outs helped millions of consumers appreciate the benefits of the internet. To this end, ConsenSys is rebranding—replete with bright new colors—with the goal of expanding its services beyond a select group of developers and end users. Lubin says the new focus will be on making crypto tools ever easier to use and empowering people of all stripes to participate in building a new version of the web, based around people, not data-gobbling monopolies.\n\nA lot of what Lubin had to say echoes the theories put forth by venture capitalist and Web3 evangelist Chris Dixon prior to crypto’s massive downturn. I’m not sure how much of this I buy—especially since governments and old-line tech companies seem as powerful as ever, and as much of the public has soured on crypto. For now, it might be more prudent for the crypto industry to focus less on Web3 utopias and more on ensuring that people stop getting robbed.\n\nThat said, Lubin made a strong case that crypto is on the cusp of a new breakthrough to follow the sudden rise of DeFi and then of NFTs. He says the area to watch right now is wallets, especially as companies like Coinbase start building “wallet as a service” tools intended to make it easier for firms of any kind to integrate crypto into their operations. This doesn’t feel far-fetched given how giant brands like Starbucks, Nike, and Reddit are also quietly using crypto and NFTs behind the scenes.\n\nIn the broader picture, though, Lubin’s sunny vision feels far-fetched in many regards, but if even a portion of it is true, then the crypto industry is indeed poised for another big leap forward.\n\nA quick programming note: There will be no newsletter Monday or Tuesday given the July Fourth holiday. So have a safe and happy Independence Day, and to those of you north of the border, happy Canada Day. Go enjoy some hot dogs.\n\nJeff John Roberts\n\njeff.roberts@fortune.com\n\n@jeffjohnroberts\n\nDECENTRALIZED NEWS\n\nBitcoin has been trading in a narrow range of $1,500 since hitting a 52-week high of $31,400 a week ago, a sign of ongoing strength, analysts say. (Bloomberg)\n\nIsrael announced a first-of-its-kind operation, aided by Chainalysis and Binance, that broke up a crypto network supporting Hezbollah. (Fortune)\n\nThe crypto orb device Worldcoin is integrating with Okta, a corporate identity management service used by hundreds of millions. (CoinDesk)\n\nIn the latest setback for Binance in Europe, its banking partner Paysafe says it will no longer process crypto-to-euro transfers for the company. (Pymnts)\n\nFidelity filed a new application to launch a Bitcoin ETF, months after the SEC rejected an earlier bid by the giant asset manager. (Fortune)\n\nMEME O’ THE MOMENT\n\nHappy Fourth of July:"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2NlbHNpdXMtZ3JhbnRlZC1jb3VydC1hcHByb3ZhbC10by1jb252ZXJ0LWFsdGNvaW5zLWludG8tYml0Y29pbi1hbmQtZXRoZXJldW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Celsius granted court approval to convert altcoins into Bitcoin and Ethereum - CryptoSlate",
        "content": "Bankrupt crypto lender Celsius Network has been authorized by the bankruptcy court to sell all of its altcoins for Bitcoin (BTC) and Ethereum (ETH), effective tomorrow, July 1, as stated in a June 30 court filing.\n\n“[Celsius] may sell or convert any non-BTC and non-ETH cryptocurrency, crypto tokens, or other cryptocurrency assets other than such tokens that are associated with Withhold or Custody accounts (collectively, the “Altcoins”) to BTC or ETH commencing on or after July 1, 2023.”\n\nThe bankrupt crypto firm revealed that it held discussions with the Securities and Exchange Commission (SEC) due to the recent regulatory actions that classified several digital assets, including MATIC, SOL, ADA, and more, as securities.\n\nFollowing these discussions, Judge Martin Gleen approved Celsius to “use commercially reasonable efforts to maximize the value of the Altcoins to be sold or converted to BTC or ETH.”\n\nThe Court also ordered the bankrupt firm to submit a monthly “Budget and Coin Report” showing the number of Altcoins converted to BTC and ETH, adding that Celsius can only distribute cryptocurrencies to creditors in the top two cryptocurrencies alone.\n\nData from Arkham Intelligence showed that Celsius holds a substantial amount of “altcoins” worth $187.04 million, including assets such as BNB, Celsius, MATIC, FTT, AVAX, and others.\n\nMeanwhile, the lender also holds $409.03 million worth of BTC and ETH.\n\nMentioned in this article"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1ob2xkcy1zdHJvbmctMTgwMC_SAUpodHRwczovL3d3dy5uZXdzYnRjLmNvbS9hbmFseXNpcy9ldGgvZXRoZXJldW0tcHJpY2UtaG9sZHMtc3Ryb25nLTE4MDAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Price Holds Strong at $1,800 – A Strong Case for Upside - NewsBTC",
        "content": "Ethereum price is holding gains above the $1,800 level against the US Dollar. ETH could gain bullish momentum if it clears the $1,880 resistance zone.\n\nEthereum is attempting a fresh increase from the $1,820 zone.\n\nThe price is trading near $1,865 and the 100-hourly Simple Moving Average.\n\nThere was a break above a connecting bearish trend line with resistance near $1,838 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could rise steadily if it clears the $1,880 resistance in the near term.\n\nEthereum Price Aims Fresh Increase\n\nEthereum’s price started a downside correction below the $1,865 support. ETH even spiked below the $1,820 level but the downsides were limited, unlike Bitcoin.\n\nA low is formed near $1,817 and the price is now attempting a fresh increase. There was a break above the $1,840 resistance zone. Besides, there was a break above a connecting bearish trend line with resistance near $1,838 on the hourly chart of ETH/USD.\n\nEther is now testing the 50% Fib retracement level of the downward move from the $1,912 swing high to the $1,817 low. It is also trading near $1,865 and the 100-hourly Simple Moving Average.\n\nImmediate resistance is near the $1,875 level or the 61.8% Fib retracement level of the downward move from the $1,912 swing high to the $1,817 low. The next major resistance is near the $1,900 level. The first breakout level is near the $1,920 level.\n\nSource: ETHUSD on TradingView.com\n\nA close above the $1,920 zone could start a fresh rally. The next resistance sits near $2,000, above which the price could rise toward the $2,050 level. Any more gains could send Ether toward the $2,120 resistance.\n\nAnother Decline in ETH?\n\nIf Ethereum fails to clear the $1,875 resistance or $1,880, it could start another decline. Initial support on the downside is near the $1,860 level and the 100-hourly Simple Moving Average.\n\nThe next major support is near the $1,840 level. The first major support is near $1,820. If there is a move below $1,820, the price could drop toward $1,790. Any more losses may perhaps send the price toward the $1,740 support.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 level.\n\nMajor Support Level – $1,820\n\nMajor Resistance Level – $1,880\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vdS50b2RheS9jYXJkYW5vcy1ob3NraW5zb24tdGFrZXMtamFiLWF0LWV0aGVyZXVtLXN0YWtpbmfSAURodHRwczovL3UudG9kYXkvY2FyZGFub3MtaG9za2luc29uLXRha2VzLWphYi1hdC1ldGhlcmV1bS1zdGFraW5nP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Cardano's Hoskinson Takes Jab at Ethereum Staking - U.Today",
        "content": "Cardano's co-founder Charles Hoskinson has taken a swipe at Ethereum, the blockchain he helped create, over its staking mechanism.\n\nAdvertisement\n\nIn a pointed tweet, Hoskinson responded to Ethereum founder Vitalik Buterin's comments on the complications of staking Ether, the blockchain's native cryptocurrency.\n\nHoskinson claimed that \"all of our ADA is staked,\" insinuating that this is how a correctly designed proof-of-stake protocol should operate.\n\nThe comments came in reply to a user question about the percentage of Hoskinson's ADA that was staked, compared to Buterin's Ether.\n\nButerin had previously admitted that he only staked a relatively small portion of his Ether, explaining that the process was complex.\n\nHe noted that staking Ether required the associated keys to be made public, a requirement that raises safety concerns. As a solution, multi-signature (multi-sig) transactions are recommended, but Buterin admits these are still somewhat difficult to set up. \"And you know, it gets complicated in a bunch of ways,\" he added.\n\nHoskinson's criticism is the latest in a series of swipes at Ethereum. As reported by U.Today, he previously called Ethereum \"a dumpster fire.\" He also forecast that Ethereum could lose its popularity in the same way as older apps like MySpace and Netscape. His prediction suggested that Ethereum might eventually become obsolete, much like those early Internet giants that were eventually superseded by more innovative solutions.\n\nThe Cardano founder has also boldly suggested that Ethereum might one day migrate to Cardano, citing the potential for Cardano to become a better, faster, and cheaper platform with higher liquidity and more users"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLWZvdW5kZXItZmVlbHMtc29ycnktZm9yLXNvbGFuYS1oZXJlcy13aHktY3J5cHRvLW5ld3Mv0gFXaHR0cHM6Ly9jb2luZ2FwZS5jb20vZXRoZXJldW0tZm91bmRlci1mZWVscy1zb3JyeS1mb3Itc29sYW5hLWhlcmVzLXdoeS1jcnlwdG8tbmV3cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Founder Feels Sorry For Solana; Here's Why - CoinGape",
        "content": "Ethereum News: Vitalik Buterin, Ethereum co-founder announced that he will open up about crypto and non-crypto queries. This comes in when the biggest of the cryptos like Cardano (ADA), Polygon (MATIC), and Solana (SOL) got categorized as “Security” by the U.S. Securities and Exchange Commission (SEC) in the latest lawsuits.\n\nAlso Read: XRP Whales Scoops 360 Million XRP; Ripple Lawsuit Verdict Near?\n\nadvertisement\n\nEthereum To Emerge As Winner?\n\nA user asked Buterin, how he feels about the US policy approach to crypto amid recent enforcements. Ethereum founder stated that he feels bad that major projects like Solana are getting hit in this way. He asserted that these blockchains don’t deserve this.\n\nHe mentioned that if Ethereum ends up winning when all other blockchains are getting kicked off from crypto exchanges, would not present an honorable way to win. However, he suggests that this isn’t even a victory in the long term.\n\nAs per Ethereum founder, its real competition is not with other chains in the crypto industry as it is rapidly expanding in the centralized world. Meanwhile, Buterin wished that all the blockchain projects get a fair outcome amid the increasing uncertainty. Read More Ethereum News Here…\n\nAlso Read: ADA, MATIC, ALGO Are Not “Securities”: XRP Lawyer\n\nSolana Makes Huge Comeback?\n\nThe US SEC in the recent lawsuit filed against Binance and its CEO Changpeng Zhao alleged that crypto assets like Cardano (ADA), Solana (SOL) and Polygon (MATIC) as unregistered securities. However, the list carries other famous cryptos like SAND, MANA, ATOM, FIL and more.\n\nSolana price registered a huge collapse over SEC’s categorization. However, SOL made a huge recovery on Friday as its price spiked by around 15%. Solana is trading at an average price of $18.7, at the press time. Its 24 hour trading volume is up by 165% to stand at $997 million."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA2LzMwL3doYWxlcy1tb3ZlLW92ZXItMTI4MjgwMDAwMC1pbi1iaXRjb2luLWV0aGVyZXVtLWFuZC1kb2dlY29pbi1oZXJlcy13aGVyZS10aGUtY3J5cHRvLWlzLWhlYWRlZC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Whales Move Over $1,282,800,000 in Bitcoin, Ethereum and Dogecoin – Here’s Where the Crypto Is Headed - The Daily Hodl",
        "content": "Deep-pocketed crypto traders are moving around more than a billion dollars worth of Bitcoin (BTC), Ethereum (ETH) and Dogecoin (DOGE).\n\nNew data from whale-surveying platform Whale Alert reveals that crypto whales have shifted about $1.282 billion worth of funds during the last few days, with the largest chunk of transfers involving Bitcoin.\n\nWhale Alert notes 10 transactions involving the king crypto, totaling about $1.178 billion.\n\nOther notable multi-million dollar transactions on Whale Alert’s radar include dog-themed meme asset Dogecoin and leading smart contract platform Ethereum:\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vY3J5cHRvLm5ld3Mvc29sYW5hLXN1cnBhc3Nlcy1ldGhlcmV1bS1pbi0yNGgtbmZ0LXNhbGVzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Jul 2023 07:00:00 GMT",
        "title": "Solana surpasses Ethereum in 24h NFT sales - crypto.news",
        "content": "In the past 24 hours, Solana’s NFT daily sales volume increased, surpassing Ethereum’s for the first time since May 2022.\n\nDuring a 24-hour period from June 30, the Solana (SOL) network produced more NFT sales in volume than Ethereum (ETH). This contrasts with the high-value Ethereum NFT market, which has recently declined in trade volume.\n\nAccording to information provided by CryptoSlam, the sales of Solana NFTs on the secondary market generated close to $24.2 million over the previous day, while sales of Ethereum totaled $21.2 million.\n\nBlockchain sales by NFT volume | Source: CryptoSlam\n\nDespite the slight disparity between the platforms, this is the first time the smaller Solana market has surpassed Ethereum in terms of the dollar amount earned by sales over 24 hours in over one year. According to CryptoSlam, sales of Solana NFTs increased by 166.11% over that previous window’s 24-hour period.\n\nYou might also like: Solana’s Cardinal Protocol shuts down due to economic challenges\n\nLast year, Solana surpassed Ethereum in 24H sales volumes for the first time, reportedly fueled by Trippin’ Ape Tribe. The Trippin’ Ape Tribe was a brand-new Solana NFT profile image project that went live on Magic Eden in April 2022.\n\n🌀🌀GM 🌀🌀\n\n\n\nAre you following the White Rabbit? 🐰 pic.twitter.com/qKuTXbFRtV — Trippin’ Ape Tribe (@TrippinApeNFT) June 26, 2023\n\nTrippin’ Ape Tribe accounted for over $14.5 million of Solana’s NFT sales total over the said period. As a result, it outperformed all other Ethereum and Solana initiatives during that time by a significant amount. Ethereum’s Bored Ape Yacht Club, which generated $3.5 million in sales, came in second.\n\nOpenSea supports Solana NFTs\n\nSoon, these achievements might become more typical. In a recent fundraising round, OpenSea, a major NFT marketplace valued at $13.3 billion, announced that it would now support Solana NFTs. Before Polygon (MATIC) NFTs, OpenSea was only a marketplace for Ethereum NFTs. Shortly after, OpenSea’s rival Rarible swiftly imitated OpenSea’s actions and enabled Solana NFTs on its platform.\n\nEven though Solana is displaying several signs of growth, the Ethereum market continues to be considerably more valuable overall. According to CryptoSlam, Solana NFT trade volume over the past seven days has been close to $41 million, while Ethereum trading volume has been close to $166 million. The difference between Solana and Ethereum after 30 days considerably widen to about $380 million.\n\nFollow Us on Google News"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vZGVjcnlwdC5jby8xNDY4OTYvdml0YWxpay1idXRlcmluLWRvZXNudC1saWtlLXVzLWNyeXB0by1wb2xpY3ktYXBwcm9hY2gtbGFiZWxzLWl0LXVuZmFpctIBZmh0dHBzOi8vZGVjcnlwdC5jby8xNDY4OTYvdml0YWxpay1idXRlcmluLWRvZXNudC1saWtlLXVzLWNyeXB0by1wb2xpY3ktYXBwcm9hY2gtbGFiZWxzLWl0LXVuZmFpcj9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Founder Vitalik Buterin Says He Feels 'Bad' for Solana - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum co-founder Vitalik Buterin has said that he doesn’t like the way U.S. regulators are targeting crypto projects—including his blockchains’s biggest rival, Solana.\n\n“The one comment I’ll make is that I feel bad that Solana and other projects are getting hit in this way,” he wrote on Twitter Friday when asked by Paradigm co-founder Matt Huang about how he feels regarding America’s crypto policy approach.\n\n“They don’t deserve it, and if Ethereum ends up ‘winning’ through all other blockchains getting kicked off exchanges, that’s not an honorable way to win, and in the long term probably isn’t even a victory.”\n\nAD\n\nAD\n\nThe one comment I'll make is that I feel bad that @solana and other projects are getting hit in this way. They don't deserve it, and if ethereum ends up \"winning\" through all other blockchains getting kicked off exchanges, that's not an honorable way to win, and in the long term… — vitalik.eth (@VitalikButerin) June 30, 2023\n\nHe added that real competition wasn’t other chains, but the “rapidly expanding centralized world that is imposing itself on us as we speak.”\n\nThe U.S. Securities and Exchange Commission has launched a tough crackdown on the crypto industry this year, fining major exchanges like Coinbase, Binance, and Kraken.\n\nOne of the main reasons for the lawsuits is that SEC Chairman Gary Gensler believes that many exchanges are selling unregistered securities. Pooled staking products, like those that allow users to stake their Ethereum on the network and receive rewards, have come under fire.\n\nThe top regulator has said for years that most digital coins and tokens are unregistered securities—but that Bitcoin is a commodity. Although SEC Chair Gary Gensler hasn’t been clear on Ethereum, the Commodities and Futures Trading Commission (CTFC) has been. It's said that the asset is a commodity.\n\nAD\n\nAD\n\nThe SEC labeled SOL and a number of other cryptocurrencies as unregistered securities in its complaint against Binance this month.\n\nEthereum is the blockchain behind the second biggest cryptocurrency by market cap, ETH. Solana is an Ethereum competitor, and its native token SOL is the eleventh biggest digital asset.\n\nSolana was created to speed up transactions in the decentralized finance (DeFi) and non-fungible token (NFT) industries."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9sYXllci0zLXN1cGVyLXB1YmxpYy1jaGFpbi0xNDAwMDA2OTUuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Layer 3 super public chain, creating a new paradigm of digital economy - Yahoo Finance",
        "content": "Layer3\n\nSan Jose, CA, June 30, 2023 (GLOBE NEWSWIRE) -- In the last few years of blockchain development, the Layer paradigm has been changing from Layer 0 to Layer 3. Not long ago, Ethereum founder VitalikButerin stressed the significance of Layer 3, saying that the architecture can optimize and improve the network. The heavy-hitting Layer 3 super public chain will link every blockchain to build a truly open, transparent, inclusive, fast and secure decentralized world.\n\n\n\n◎ The congestion problem under the Ethereum boom needs to be solved\n\nAs the most mainstream smart contract platform, Ethereum is known for its security and decentralized characteristics, but it still lags behind in terms of scalability: Ethereum's current TPS (the number of transactions that can be processed per second) is between 10 and 15, and the supply is insufficient and the demand is strong, resulting in high fees determined by bidding, and each transaction needs to spend several dollars to tens of dollars.\n\n\n\n微信图片_20230628162753\n\nIn other words, on the first layer of the Ethereum blockchain, the growing demand for network usage has led to network congestion and pushed up transaction costs.Increased storage, network speed, and throughput are fundamental to meaningful mass adoption of Ethereum. Decentralization, Security, Scalability, the three can only choose two, which is also known as the blockchain impossible triangle. Ethereum's initial choice was to abandon scalability and bring it into line with the most important values of Web3.0. But if you implement scalability in a clean and crude way, you sacrifice security or decentralization! In this context, the congestion problem under the Ethereum boom needs to be solved.\n\n\n\n◎Layer 3 brings the perfect solution for Ethereum cross-chain scaling\n\nThe congestion problem of the Ethereum boom caught the world's attention, and Scaling was the solution - and that's where Layer 3 came into being. Layer 3 has been actively looking for Ethereum scalability solutions, and after the full research and development of the technical team, it has determined the cross-chain expansion route combining on-chain and off-chain expansion. Layer 3 combines cross-chain technology with Layer 1 and Layer 2 expansion solutions to bring a new chain expansion solution, support cross-chain interaction between major public chains, complete block transactions faster with lower GAS fees, and bring users a silky transaction experience.\n\n\n\nLayer 3, as an Ethereum expansion solution, aims to solve the congestion problem of Ethereum and realize the decentralized, low-cost and high-concurrency Ethereum ecosystem that people yearn for. It can be said that Layer 3 public chains start from the underlying algorithms and consensus protocols to help different public chains connect with each other and exchange value. Layer 3 public chain From the architecture design, to ensure that every public chain, even if there is no first-mover advantage, can be mirrored on the Layer 3 public chain, so that thousands of people understand and use.\n\n\n\nThe Layer 3 public chain's original series of core technologies build a cross-chain ecosystem integrating public chain, wallet, decentralized transaction, decentralized application and other layers to serve finance, artificial intelligence, metauniverse and other fields.\n\n\n\nIn short, the Layer 3 super public chain brings a new paradigm of the digital economy.\n\n\n\nFrom the perspective of technical architecture, Layer 3, like Layer 2, also contains the application Layer, and Layer 3 has better cross-chain interoperability, which means that there will be a lot of use cases that can be migrated to Layer 3.\n\n\n\nIn addition, for those types of use cases that require greater transaction throughput support and strong demand for further reducing network use costs, such as decentralized exchanges and blockchain games, transaction efficiency can also be improved on Layer 3 and real cost reduction and efficiency can be experienced.\n\n\n\nLayer 3's Ethereum cross-chain scaling solution has been tested to be the most secure and widely used scaling solution. The Layer 3 super public chain will truly link every blockchain and build an open, transparent, inclusive, fast and secure decentralized world.\n\nStory continues\n\nCompany：Layer Three Expansion Technology Inc\n\nWebsite:https://www.layer3.team\n\nTwitter：https://twitter.com/eth_layer_3\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, or intended as investment advice, financial advice, or trading advice. It is strongly recommended that you practice due diligence (including consultation with a professional financial advisor) before investing or trading securities and cryptocurrency.\n\nCONTACT: Jack Li Etbvilla668(at)layer3.team\n\n\n\n"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiM2h0dHBzOi8vY3J5cHRvdGlja2VyLmlvL2VuL2V0aGVyZXVtLWNhbmN1bi11cGdyYWRlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Cancun Upgrade: ETH price to Reach $3000 soon? - CryptoTicker.io - Bitcoin Price, Ethereum Price & Crypto News",
        "content": "Ethereum, the world’s second-largest cryptocurrency by market capitalization, is preparing for a significant upgrade known as Cancun-Deneb (Dencun). This upgrade is expected to enhance the scalability, security, and usability of the Ethereum network. With these improvements on the horizon, many are speculating whether this could be the catalyst that propels Ethereum’s price to the $3,000 mark.Let’s take a look a this Ethereum Cancun upgrade.\n\nThe Ethereum Cancun Upgrade: What to Expect\n\nThe Cancun upgrade follows the recent activation of Shanghai, another significant upgrade to Ethereum’s execution layer. The Cancun fork includes the highly anticipated Ethereum Improvement Proposal (EIP) 4844, also known as “Proto-Danksharding.” This feature is a milestone that lays the groundwork for full Danksharding implementation, which is expected to significantly enhance the network’s scalability.\n\nThe Importance of Proto-Danksharding\n\nEthereum core developer Péter Szilágyi has emphasized the importance of Proto-Danksharding, stating that it should be the primary focus of the upgrade. Proto-Danksharding will act as an intermediate upgrade to help scale rollups on the network, a crucial step towards improving Ethereum’s scalability and transaction speed.\n\nOther Key Features of the Ethereum Cancun Upgrade\n\nThe Ethereum Cancun upgrade may also include several other Ethereum Improvement Proposals (EIPs), such as EIPs 4758, 6046, 6190, which involve the removal of the SELFDESTRUCT function, and EIP-663, which allows for unlimited SWAP and DUP instructions. Other potential features include EIP-5920, the PAY opcode, and EIP-1153, which introduces transient storage.\n\nUnderstanding Danksharding\n\nDanksharding is the third and final part of the ETH2/Serenity upgrade, following the successful rollout of the Beacon chain and The Merge. This new sharding architecture will replace the project’s initially proposed idea of introducing 64 shard chains. Instead of increasing the number of transactions, Danksharding focuses on increasing data availability for rollups, a Layer 2 technology that bundles together blockchain transactions and processes them off-chain.\n\nThe Role of Proto-Danksharding\n\nProto-Danksharding, proposed by Ethereum developers Protolambda and Dankrad Feist, is an interim upgrade to the Ethereum network. It is described as a “stopgap” solution that will dramatically reduce rollup gas fees ahead of full sharding implementation. This feature introduces a transaction type called “blob-carrying transactions,” which can contain up to two blobs and will be more cost-effective than the current transaction data storage method.\n\nThe Impact of the Ethereum Cancun Upgrade\n\nThe Cancun upgrade aims to prepare the network for full data sharding while scaling rollups in the interim. The introduction of blob-carrying transactions will increase data availability for rollups and make them considerably cheaper. After the activation of Cancun, Ethereum users should expect faster, cheaper payments when using the ecosystem’s native cryptocurrency, applications, and ERC-based tokens.\n\nCan Ethereum Reach $3,000?\n\nETH/USD Weekly- TradingView\n\nWhile it’s impossible to predict with certainty, the Cancun upgrade could potentially be a significant catalyst for Ethereum’s price. By enhancing the network’s scalability, security, and usability, the upgrade could attract more users and developers to the Ethereum ecosystem, thereby increasing demand for ETH and potentially driving its price towards the $3,000 mark. However, as with all investments, it’s essential to do your research and consider the risks before making any decisions.\n\nEthereum’s Path to $3,000: A Predictive Analysis\n\nAs of today, Ethereum (ETH) is trading at $1,855.58. To reach the $3,000 mark, it would need to increase by approximately 62%. This is a significant leap, but not an impossible one, especially when considering the potential impact of the upcoming Cancun upgrade.\n\nHistorically, major network upgrades have often led to increased demand for cryptocurrencies. For instance, Ethereum’s price increased by about 60% in the two months leading up to the launch of Ethereum 2.0’s Beacon Chain in December 2020. If the Cancun upgrade has a similar effect, it could potentially push Ethereum’s price towards the $3,000 mark.\n\nFurthermore, Ethereum’s increasing adoption in decentralized finance (DeFi) and non-fungible tokens (NFTs) could also contribute to price growth. As more users and developers flock to the Ethereum network to take advantage of these innovations, demand for ETH could increase, driving up its price.\n\nCurrently, Ethereum (ETH) is priced at $1,855.58. For Ethereum to reach the $3,000 mark from its current price, we need to calculate the percentage growth required.\n\nThe formula to calculate percentage growth is:\n\n((Target Price – Current Price) / Current Price) * 100\n\nSubstituting the given values into the formula:\n\n((3000 – 1855.58) / 1855.58) * 100\n\nThis calculation results in a required growth of approximately 61.7%.\n\nIn simpler terms, Ethereum’s current price needs to increase by about 61.7% to reach the $3,000 mark. This is a significant increase, but it’s not unprecedented in the volatile world of cryptocurrencies.\n\nFor instance, if we consider Ethereum’s performance in 2021, it has shown periods of rapid growth. From January 2021 to May 2021, Ethereum’s price increased from around $730 to a peak of over $4,000, representing a growth of over 450%.\n\nWhile past performance is not a guarantee of future results, it does illustrate Ethereum’s potential for rapid price increases. With the upcoming Cancun upgrade and the continued growth of applications like DeFi and NFTs on the Ethereum network, a 61.7% increase to reach the $3,000 mark is within the realm of possibility. However, investors should always consider the inherent risks and volatility associated with cryptocurrency investments.\n\nConclusion\n\nIt is important to note that this is a predictive analysis and not a guarantee. Cryptocurrency prices are influenced by a wide range of factors, including market sentiment, regulatory news, and broader economic trends. As such, while the $3,000 target is achievable, it’s essential for investors to do their own research and consider the risks before making any decisions.\n\n\n\n\n\nYou might also like\n\nMore from Altcoin"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMimgFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3NvbGFuYS1iZWF0cy1ldGhlcmV1bS1pbi0yNC1ob3VyLW5mdC1zYWxlcy1mb3ItdGhlLWZpcnN0LXRpbWUtaW4taGlzdG9yeS1nZWFycy11cC1mb3ItcmVjb3ZlcnktMjAyMzA3MDExMzU10gGeAWh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9hbXAvY3J5cHRvY3VycmVuY2llcy9uZXdzL3NvbGFuYS1iZWF0cy1ldGhlcmV1bS1pbi0yNC1ob3VyLW5mdC1zYWxlcy1mb3ItdGhlLWZpcnN0LXRpbWUtaW4taGlzdG9yeS1nZWFycy11cC1mb3ItcmVjb3ZlcnktMjAyMzA3MDExMzU1?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Jul 2023 07:00:00 GMT",
        "title": "Solana beats Ethereum in 24 hour NFT sales for the first time in history, gears up for recovery - FXStreet",
        "content": "Share:\n\nNFT sales on Solana exceeded that on the Ethereum blockchain for the first time in the two altcoin’s history.\n\n24 hour NFT sales on the Solana blockchain exceeded $25.5 million while on the Ethereum blockchain it was capped at $24.5 million.\n\nEthereum creator Vitalik Buterin recently expressed his support for Solana and other ETH competitors.\n\nSolana ranks among the altcoins labeled as “securities” by the US Securities and Exchange Commission (SEC). The SEC’s clampdown on cryptocurrencies triggered a steep decline in SOL price and resulted in a delisting of the altcoin across crypto exchanges.\n\nThe total NFT sales on Solana exceeded that on Ethereum for the first time in the two altcoins’ history.\n\nAlso read: Attorney John Deaton says Judge Torres decision on SEC vs. Ripple is important to crypto for this reason\n\nNFT trade on Solana explodes in a 24 hour timeframe\n\nThe total volume of NFT sales on the Solana blockchain crossed $25.5 million, based on data from tracker Sol Bulletin. At the same time, the NFT trade volume on the Ethereum blockchain exceeded $24.5 million, lagging behind Solana by nearly a million.\n\nNFT sales volume by blockchain\n\nFor the first time in the history of the two altcoin blockchains, Solana outperformed Ethereum. This is a key milestone for SOL as the asset is tackling selling pressure from the SEC’s crackdown and series of delisting across crypto exchanges and social trading platforms.\n\nSolana price failed to catch up with the surge in the altcoin’s NFT trade volume. Interestingly, the DeFi protocols building on the Solana ecosystem are no match for Ethereum, therefore the NFT sales volume supported the theory of rising adoption and utility of the SOL blockchain.\n\nDeFi data tracker DeFiLlama pegs the total volume locked (TVL) in the Ethereum blockchain at $26.7 billion, while for Solana it is a meager $265.57 million. If the NFT trade volume on the Solana blockchain continues rising, there is a likelihood of the protocol’s TVL climbing in the long term, fueling SOL price recovery."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V0aGVyZXVtLXRyYW5zYWN0aW9ucy1mcm96ZW7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Ethereum transactions frozen for 12 seconds - Blockworks",
        "content": "A recently organized team of researchers, the ​​Special Mechanisms Group (SMG), demonstrated Thursday how to take advantage of a facet of the proposer-builder separation market to force through an Ethereum block containing just one transaction: theirs.\n\nProposer-builder separation (PBS) is intended to increase censorship-resistance by separating the roles of block builders and block proposers in the more-or-less unceasing Ethereum blockchain. But the group found a way to use the feature to make a very public point.\n\nLoading Tweet..\n\nThe block’s lone transaction embedded a URL to a presentation and research paper on SMG’s website, describing the problem and proposing potential ways to address it.\n\nReactions were decidedly mixed.\n\nRyan Berckmans, a former software engineer at Augur, was among many who pointed out that Ethereum’s gas fee market would make it difficult to delay transactions using this method for long, but noted it did reveal certain problems in the way some applications on Ethereum calculate fees needed to get transactions included in a block.\n\n“The interesting thing about the quoted method is that to censor all transactions for one block, they only have to outbid priority fees.”\n\nLoading Tweet..\n\nWhy does it matter?\n\nEthereum is designed to be “credibly neutral,” and therefore any time user transactions can be prevented from being included in a block, it’s cause for alarm.\n\n(Technically, post-Merge they’re called “slots,” but the terms are interchangeable.)\n\nBut most people conceptualize “censorship” as preventing a transaction permanently, not merely delaying it for a short time. It’s also not a new problem.\n\nLoading Tweet..\n\nThe SMG group disagrees.\n\n“When bidders in an auction, or agents in a financial system can censor their competition, the efficiency of these systems erodes,” they tweeted. “In other words, censorship-resistance is about more than just ensuring a transaction gets on-chain ‘eventually.’ It needs to be fast.”\n\nSMG’s head of research and one of the paper’s authors, Max Resnick, told Blockworks, “we are more worried about 12 seconds being enough time to cause a problem than 10 mins,” although he said the critics overestimate the cost of increasing the delay period further.\n\nEven on a short timeframe, however, “there are a lot of useful mechanisms (like auctions) that we can’t build on chain because it would be easy for participants to censor their competition’s bids,” Resnick said.\n\nSome use cases that don’t tolerate inclusion delays could migrate to layer-2s, but not all, he said.\n\n“Let’s use enshrined PBS as an example, because that is an auction that we want to run on-chain and can’t really be run on a rollup.”\n\nEnshrined PBS, or ePBS, would implement PBS at the protocol level — the Ethereum mainnet consensus layer — but how to do this is an active research topic and remains a relatively distant prospect.\n\n“This is particularly relevant in auctions, but also applies to fraud proofs and oracle updates to a lesser extent,” Resnick said.\n\nIn other words, this case implies that it may be hard to reduce the window for producing a fraud proof in optimistic rollups, although it does not impact ZK rollups.\n\n“I think if we could make the base chain more censorship resistant, then optimistic rollups would have better user experience,” Resnick said.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3ZpdGFsaWstYnV0ZXJpbi1zdGFrZXMtb25seS1hLW1vZGVzdC1wb3J0aW9uLW9mLWV0aGVyZXVtLWhlcmVzLXdoeS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Vitalik Buterin stakes only a modest portion of Ethereum, here's why - CryptoSlate",
        "content": "Ethereum co-founder Vitalik Buterin stakes a small amount of his ETH due to concerns about security and the complexity of staying safe.\n\nSpeaking on the Bankless Podcast, Buterin said he doesn’t stake all his Ethereum, only “a fairly small portion,” because staking safely on the network requires multi-sig, which remains a tricky process.\n\n“if you stake your ETH, the keys to access it have to be public on some system that’s online. For safety, it has to be a multi-sig, and multi-sigs for staking are still fairly difficult to set up. It gets complicated in a bunch of ways.”\n\nMulti-sig refers to requiring more than one user to sign and authorize a transaction. Therefore, crypto assets remain secure even if a private key is compromised.\n\nIn 2021, Ethereum Foundation researcher Justin Drake said he doesn’t stake all his ETH. Explaining why, he used a sausage-making analogy, adding that rare, unpredictable events also influenced his decision.\n\n“when you make the sausage, you know how it’s made, and there’s a bunch of tail risk that’s difficult to quantify.”\n\nInput-Output CEO and Cardano founder Charles Hoskinson seized upon Buterin’s comments, saying he stakes all of his ADA – taking the opportunity to infer Ethereum is not “properly designed.”\n\n“I had to listen to this a few times. I’m just at a loss for words. All of our Ada is staked. Guess what, that’s how it’s supposed to be for a properly designed Proof of Stake protocol.“\n\nHowever, Max Radeleus, the co-Founder of INTU, a protocol that introduced dEOAs (decentralized externally owned accounts) at ETHDenver this year, argued that Buterin might be underestimating what’s possible with continued Ethereum innovation.\n\nEOAs are the most basic type of Ethereum accounts using a public and private key pair. INTU introduced a cryptographic method to split private keys without needing a smart contract wallet, the kind of account likely referenced by Buterin when talking about multi-sigs.\n\n“As Mr Buterin so succinctly highlights, secure solutions on chain are currently difficult; I mean if he has issues with it, who wouldn’t? However, we’re not done innovating on Ethereum yet! dEOAs make it simple to launch multi-party (MPC) accounts which solve many of Vitalik’s issues here, and just perhaps, this is what is needed for further staking adoption.”\n\nMentioned in this article"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vdS50b2RheS9zb2xhbmEtc29sLW91dHNoaW5lcy1ldGhlcmV1bS1pbi10aGlzLWtleS1tZXRyaWMtZGV0YWlsc9IBTGh0dHBzOi8vdS50b2RheS9zb2xhbmEtc29sLW91dHNoaW5lcy1ldGhlcmV1bS1pbi10aGlzLWtleS1tZXRyaWMtZGV0YWlscz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Solana (SOL) Outshines Ethereum in This Key Metric: Details - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nMany Ethereum killers are seeing impressive growth in key aspects of their ecosystem, and Solana (SOL) is notably not left behind. In a remarkable twist, Solana has taken the center stage as it relates to the overall trading volume of its non-fungible tokens (NFTs) when compared to that of Ethereum.\n\nPer the data embedded in the screenshot shared by Sol Bulletin, Solana's NFT trading volume topped $25.5 million in a 24 hour range while that of Ethereum was pegged at $24.5 million. Notably, this bullish growth milestone is the first time Solana will be beating Ethereum in terms of total NFT trading volume.\n\n🚨 BREAKING NEWS: @solana JUST FLIPPED @ethereum IN 24 HOUR SALES VOLUME FOR THE 1ST TIME IN HISTORY. pic.twitter.com/MDB6UwZyfK — Sol Bulletin 📌 (@SolBulletin) June 30, 2023\n\nComparing Solana and Ethereum ecosystems\n\nAs Layer-1 blockchain protocols, the duo of Ethereum and Solana both have decentralized finance (DeFi) ecosystems. While Solana has a notable functional DeFi ecosystem, it is by no means a match for Ethereum.\n\nData from DefiLlama pegs the total value locked (TVL) on Ethereum at $26.7 billion, a figure that surpasses more than half of the entire industry TVL. Solana's TVL, on the other hand, is pegged at $265.57 million.\n\nTheir respective market capitalization is also a major distinguishing metric, with Ethereum's pegged at $231.17 billion while that of Solana is pegged at a mere $7.38 billion.\n\nEthereum has been tagged as the most liquid blockchain for smart contracts, and while Solana is an able contender, it is still miles apart. While Ethereum dominates in many ways, Solana's developers are arguably more laser focused on introducing unique real world utility into the protocol, which has led to the launch of the Saga Mobile Phone.\n\nObvious similarity\n\nWith the diversity in their ecosystem that makes them different, the duo of Solana and Ethereum are powered via the proof-of-stake (PoS) consensus model. Solana was designed as a PoS protocol from the start, but Ethereum transitioned to this new model from proof of work (PoW) through the Merge as the call for scalability and sustainability takes shape."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vdS50b2RheS9ldGhlcmV1bXMtdml0YWxpay1idXRlcmluLWZlZWxzLWJhZC1mb3Itc29sYW5hLXNvbC1oZXJlcy13aHnSAVBodHRwczovL3UudG9kYXkvZXRoZXJldW1zLXZpdGFsaWstYnV0ZXJpbi1mZWVscy1iYWQtZm9yLXNvbGFuYS1zb2wtaGVyZXMtd2h5P2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Ethereum's Vitalik Buterin Feels Bad for Solana (SOL), Here's Why - U.Today",
        "content": "Ethereum co-founder Vitalik Buterin recently made a compassionate remark about Solana (SOL) and other projects facing significant challenges. He expressed empathy over the issues they are dealing with, particularly with regulators marking certain cryptocurrencies as securities and the resulting effect on their market performance.\n\nAdvertisement\n\nIn a recent social media post, Buterin said, \"The one comment I'll make is that I feel bad that Solana and other projects are getting hit in this way. They don't deserve it, and if Ethereum ends up 'winning' through all other blockchains getting kicked off exchanges, that's not an honorable way to win, and in the long term probably isn't even a victory.\"\n\nThe one comment I'll make is that I feel bad that @solana and other projects are getting hit in this way. They don't deserve it, and if ethereum ends up \"winning\" through all other blockchains getting kicked off exchanges, that's not an honorable way to win, and in the long term… — vitalik.eth (@VitalikButerin) June 30, 2023\n\nThe issue at hand is increasing scrutiny from financial regulators worldwide, which are attempting to classify certain cryptocurrencies as securities. If a cryptocurrency is labeled a security, it falls under a different regulatory framework, potentially limiting its market reach and disrupting its trading on many exchanges. This development has put pressure on Solana, which is currently under investigation by authorities for its possible classification as a security.\n\nMoreover, Solana has also been grappling with recovery after the FTX crash. While it managed to bounce back, the road to recovery has been steep and complicated by regulatory issues.\n\nButerin's empathetic sentiment sheds light on the challenges faced by the whole blockchain ecosystem. Instead of seeing this as a competitive struggle between Ethereum and other projects, he views the real competition as the expanding centralized world imposing itself on the blockchain and crypto space.\n\nIn his post, Buterin implied that Ethereum's victory would not be meaningful if it came at the expense of other projects getting kicked off exchanges due to regulatory pressures. He suggests that the entire industry should stand together to face the threats posed by the growing centralized world."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jbWUtZ3JvdXAtbGF1bmNoLWV0aGVyZXVtLWJpdGNvaW4tMTAyMzI5MjUzLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "CME Group to Launch Ethereum-to-Bitcoin Ratio Futures Next Month - Yahoo Finance",
        "content": "The Chicago Mercantile Exchange (CME) Group on Thursday revealed plans for the launch of Ethereum/Bitcoin (ETH/BTC) ratio futures on July 31, pending regulatory approval.\n\nPer the product description on the company's website, the ticker for the ETH/BTC ratio futures is EBR, with the ratio defined as Ethereum futures price divided by the Bitcoin futures price. The ratio will be calculated as the final settlement price of ETH divided by BTC and will always be positive across all contract months.\n\n\"Historically, Ether and Bitcoin have been highly correlated; however, as the two assets have grown over time, market dynamics may affect the performance of one more than the other, creating relative value trading opportunities,\" CME Group Global Head of Cryptocurrency Products Giovanni Vicioso said in a statement.\n\nEfficiently capture the relative value of ether and bitcoin in a single trade with Ether/Bitcoin Ratio futures, launching July 31. https://t.co/WDFhIt5rJ7 — CME Group (@CMEGroup) June 29, 2023\n\nA ratio futures contract is a type of financial derivative that allows investors to speculate on or hedge against the relative performance of two underlying assets. The contract sets a predetermined ratio between the two assets and allows traders to take positions based on their expectations of how the ratio will change in the future. The two assets can be related or unrelated, such as stocks, commodities, or indices.\n\nAccording to Vicioso, the ETH/BTC ratio futures will enable investors to capture the crypto industry’s two largest assets “in a single trade, without needing to take a directional view.”\n\n“This new contract will help create opportunities for a broad array of clients looking to hedge positions or execute other trading strategies, all in an efficient, cost-effective manner,\" added Vicioso.\n\nStory continues\n\nCME’s foray into crypto\n\nCME introduced its first Bitcoin futures contract in December 2017 amid the strong bull run that took the price of the leading cryptocurrency from $1,000 at the start of the year to above 20,000 before Christmas. The move was significant for the cryptocurrency market as it provided institutional investors with a regulated platform to trade Bitcoin futures, allowing for greater mainstream adoption and potentially increased liquidity in the market.\n\nThe launch of Bitcoin futures on CME was, however, attributed to the consequent market slump though, although Tim McCourt, Global Head of Equity and FX Products at CME Group, dismissed such speculations.\n\nCME executive: Bitcoin futures did not tank market in 2017\n\nThe launch of Ethereum futures trading on CME followed in February 2021, which made it easier for institutional investors to gain exposure to the world’s second-largest cryptocurrency by market cap.\n\nThe exchange saw over 151,000 Bitcoin, or $4.67 billion in current prices, allocated in Bitcoin futures contracts in the last 24 hours, according to data from CoinGlass.\n\nEthereum futures at CME saw 226,000 ETH, or $429.2 million, over the span.\n\nOver the past several years, the CME Group also expanded its digital asset offerings to both Bitcoin and Ethereum options, as well as for micro BTC and micro ETH futures contracts."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDcvMDEvZGlvci1pbnRyb2R1Y2VzLWV0aGVyZXVtLWJhc2VkLXRva2VuaXplZC1zbmVha2Vycy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Jul 2023 07:00:00 GMT",
        "title": "Dior Introduces Ethereum-based Tokenized Sneakers - Crypto Times",
        "content": "The luxury fashion house Dior has unveiled a unique line of men’s sneakers linked to its ‘digital twin’ that are integrated with the Ethereum blockchain.\n\nThe innovative step taken by Dior links each pair of the new sneakers, termed the B33, with a non-fungible token (NFT). However, Dior refrained from explicitly labeling this as an ‘NFT’ initiative.\n\nSneakers Alert.\n\nIntroducing 'B33' sneakers by Kim Jones, from the #DiorMenFall 2023 collection. Each pair is equipped with an encrypted key granting access to a secure platform and exclusive services. Sign up to be the first to shop them online from July 6. — Dior (@Dior) June 29, 2023\n\nArtistically designed by Kim Jones, the Dior Menswear Artistic Director, the B33 sneakers will be part of Dior’s Men’s Fall 2023 collection.\n\nAccording to a Friday tweet from the company, these exclusive sneakers will be released in a limited run of only 470 pairs, each priced at $1,350. With this initiative, Dior aims to provide digital certificates of authenticity for their shoes through the Ethereum platform, enhancing the luxury experience for its customers.\n\nDior’s upcoming B33 sneaker collection will include six additional styles with an NFC chip under the right foot, but without a digital twin NFT. They will be ranging in price from $1,000 to $1,100.\n\nThis move by Dior is in line with recent Web3 trends and follows similar moves by other brands under the LVMH parent company. Brands such as French cognac Hennessy, watchmaker TAG Heuer, and luxury fashion house Louis Vuitton have also taken steps towards integrating blockchain into their operations.\n\nThe embrace of blockchain technology by Dior and its sister brands underlines the growing intersection of luxury fashion and digital innovation, shaping a new era in the industry."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMipQFodHRwczovL2RlY3J5cHQuY28vbmV3cy1leHBsb3Jlcj9waW5uZWQ9MjEyMTUxJnRpdGxlPXRoZS1ldGhlcmV1bS1uYW1lLXNlcnZpY2UtZW5zLXdpbGwtaW50cm9kdWNlLWxheWVyLTItaW50ZXJvcGVyYWJpbGl0eS1mb3ItaW1wcm92ZWQtc2NhbGFiaWxpdHktYW5kLXJlZHVjZWQtY29zdHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 12:26:03 GMT",
        "title": "News Explorer — Ethereum Name Service Working to Support Layer-2 Networks - Decrypt",
        "content": "Jun 30, 12:07 pm\n\nThe Block\n\nEthereum Name Service Working to Support Layer-2 Networks\n\nThe Ethereum Name Service (ENS) plans to implement layer-2 interoperability with ENS domains, allowing for improved scalability and reduced costs. This upgrade aims to make domain name registrations and transactions more accessible to a wider user base."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1uYW1lLXNlcnZpY2UtdmVudHVyZXMtaW50by1sYXllci0yLXdoYXQtYWJvdXQtZW5zL9IBVWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1uYW1lLXNlcnZpY2UtdmVudHVyZXMtaW50by1sYXllci0yLXdoYXQtYWJvdXQtZW5zL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Name Service ventures into Layer-2, what about ENS? - AMBCrypto News",
        "content": "Developers of ENS have announced plans to implement Layer 2 interoperability.\n\nENS has seen increased buying pressure in the past few weeks.\n\nDuring a community call on 28 June, ENS Labs, the developer team behind the Ethereum Name Service [ENS], announced its plans to introduce Layer 2 (L2) interoperability for ENS domains.\n\nRealistic or not, here’s ENS’s market cap in BTC’s terms\n\nThrough this implementation, ENS Labs seeks to provide users with improved performance, scalability, and cost efficiency in managing their ENS domains.\n\nAccording to ENS Labs, off-chain resolvers, which leverage an ENS off-chain registrar contract and the services of CoinBase’s cb.id, Lens Protocol, and OptiNames (on Optimism [OP]), will be implemented.\n\nThe decision by the decentralized domain name system to introduce L2 interoperability for its domain names comes at a time marked by an increased inflow of projects and protocols into the L2 ecosystem.\n\nAccording to data from L2Beat, the total value of assets locked on L2 service providers has grown by over 190% in the last year. At the time of writing, this stood at $9.78 billion, with Arbitrum [ARB] enjoying a 60% market share and a total value locked (TVL) of $5.87 billion.\n\nENS domain name purchases in Q2\n\nAccording to data from on-chain analytics platform Dune Analytics, monthly ENS domain name registrations totaled 79,463 last quarter.\n\nWith June marked by a steep fall in gas fees paid on the Ethereum Network, the month logged the highest count of registrations during the three-month period under review. Per data from Dune Analytics, 35,932 ENS name registrations were made in June alone.\n\nInterestingly, while monthly. eth name registrations ended Q2 with a rally, primary ENS name registrations experienced a significant decline. A primary ENS name is a unique domain name registered and associated with an Ethereum address on the ENS platform.\n\nFurther, protocol revenue logged a decline, according to Token Terminal. Notably, ENS registered a cumulative $4.8 million as profit between 1 April and 30 June. Inasmuch, its revenue dipped by 21% during this period.\n\nAccording to the data provider, on an annualized basis, ENS’ revenue has fallen by 5.11%.\n\nIncreased purchase of ENS tokens\n\nA look at ENS’ price performance on a daily chart revealed an uptick in ENS accumulation since the middle of June. Since then, the alt’s Relative Strength Index (RSI) and Money Flow Index (MFI) indicators have been on an uptrend.\n\nHow much are 1,10,100 ENS worth today?\n\nIn the same position at press time, they rested at 56.24 and 73.90, respectively. Within the same period, ENS has logged a corresponding 22% growth in value.\n\nWith the alt’s Moving Average Convergence Divergence (MACD) indicator posting slightly elongated histogram bars and its MACD line resting above the trend line, a bullish run was underway at press time."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvY2FyZGFuby12cy1ldGhlcmV1bS1ob3NraW5zb24tbGF1ZHMtYWRhcy1zdGFraW5nLW1lY2hhbnNpbdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Cardano vs. Ethereum: Hoskinson Lauds ADA's Staking Mechansim - Watcher Guru",
        "content": "Despite belonging to the same industry, the various networks in the crypto market often engage in conflicts. Ethereum [ETH], in particular, has faced criticism and backlash for its transition to the proof-of-stake [PoS] consensus mechanism. While Ethereum’s staking mechanism has been successful, Charles Hoskinson, co-founder of Cardano, took the opportunity to make a snide remark aimed at the second-largest cryptocurrency network.\n\nIn a tweet exchange, Charles Hoskinson called out Vitalik Buterin, the founder of Ethereum. This statement came in response to Buterin’s comments about the challenges associated with staking Ether [ETH]. Buterin previously stated that only a small portion of his Ether is staked as it gets complicated. Buterin pointed out that staking Ethereum involves the need to make the associated keys public, which raises concerns about security. To address this, he suggested using multi-signature transactions. However, he admitted that setting them up can still be challenging.\n\nHoskinson emphasized that all of Cardano’s native token ADA is staked. This statement implied that Cardano’s proof-of-stake protocol is well-designed and functioning effectively. This was done by indirectly highlighting potential flaws in Ethereum’s approach.\n\nI had to listen to this a few times. I'm just at a loss for words. All of our Ada is staked. Guess what that's how it's supposed to be for a properly designed Proof of Stake protocol. https://t.co/ye6va1DH06 June 29, 2023\n\nEthereum’s deposit contract value hits all new high\n\nFollowing the implementation of the Shanghai upgrade, which introduced the ability to withdraw staked Ethereum, there has been a notable increase in the number of individuals opting to lock their coins in beacon deposit contracts. This surge in staked Ethereum is evident as the amount has rapidly grown and has set a new record since the update.\n\nThe number of Ethereum that has been staked has now surged to 25.8 million ETH, marking a new all-time high ATH. At present, this staked amount is valued at over $48 billion.\n\nAmidst this, Ethereum continued to struggle to hit $2,000. At press time, the second largest crypto asset was trading for $1,889.79 with a 2.66% daily surge."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL3d3dy5iZW56aW5nYS5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS8yMy8wNi8zMzA4NDY2OS9ldGhlcmV1bS1kb2dlY29pbi1vdXRwYWNlLWJpdGNvaW4tYWhlYWQtb2YtanVseS1mb3VydGgtaG9saWRheS1hLWxvb2stYXQtdGhlLWNyeXB0b3MtaW50by3SAS1odHRwczovL3d3dy5iZW56aW5nYS5jb20vYW1wL2NvbnRlbnQvMzMwODQ2Njk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Ethereum, Dogecoin Outpace Bitcoin Ahead Of July Fourth Holiday: A Look At The Cryptos Into The Weekend - Benzinga",
        "content": "Bitcoin BTC/USD was volatile during Friday’s 24-hour trading session, popping up over 2% higher, then dropping over 3% lower before settling flat by the afternoon despite Americans showing high interest in the crypto.\n\nEthereum ETH/USD and Dogecoin DOGE/USD were showing comparative strength, rising about 4% over Thursday’s closing price.\n\nWhile the general market has moved higher since June 26, the crypto space has been consolidating mostly sideways after Bitcoin and Ethereum surged over 21% and over 16%, respectively, between June 15 and June 21.\n\nSince the beginning of 2023, Bitcoin has skyrocketed about 83% and Ethereum has surged 61%. Dogecoin, on the other hand, is trading down about 6% from its Jan. 1 opening price of 7 cents.\n\nAs the second half of the year begins on Saturday, traders and investors will be watching to see how the apex cryptocurrencies trade over the weekend, which could help to indicate how the stock market will trade after the fourth of July, when most of Wall Street returns to the desk.\n\nWant direct analysis? Find me in the BZ Pro lounge! Click here for a free trial.\n\nThe Bitcoin Chart: Bitcoin has been trading in a slight downtrend since June 23, but on Friday, the crypto negated the trend by forming a higher high. If Bitcoin closes the trading day near flat, the crypto will form a doji candlestick, which indicates indecision.\n\nBullish traders want to see Bitcoin trade higher on Saturday to surpass Friday’s high-of-day, which would confirm a new uptrend. Bearish traders want to see the bearish double top pattern that Bitcoin formed on June 23 and Friday recognized, which could indicate lower prices are in the cards.\n\nBitcoin has resistance above at $31,418 and $35.593 and support below at $30,050 and $28,690.\n\nBullish traders want to see continued momentum on Saturday push the crypto up above $1,950, which would break Ethereum up from the sideways pattern. Bearish traders want to see the stock consolidate sideways and then for big bearish volume to come in and push Ethereum under $1,796, which would be bearish.\n\nEthereum has resistance above at $1,957 and $2,150 and support below at $1,846 and $1,717.\n\nBullish traders want to see Dogecoin break up above a descending trend line, which has been holding the crypto down since June 23. If that happens it could signal a longer-term reversal to the upside. Bearish traders want to see big bearish volume drop Dogecoin down under the $0.056 mark, which could indicate a longer-term downtrend on large timeframes.\n\nDogecoin has resistance above at $0.069 and $0.075 and support below at $0.065 and $0.057.\n\nPhoto: Shutterstock"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9hbGwteW91LW5lZWQtdG8ta25vdy1hYm91dC1sc2QtdG9rZW5zLWFuZC10aGUtZXRoZXJldW0tcHJvdG9jb2wv0gFaaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2FsbC15b3UtbmVlZC10by1rbm93LWFib3V0LWxzZC10b2tlbnMtYW5kLXRoZS1ldGhlcmV1bS1wcm90b2NvbC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "All you need to know about LSD tokens, Ethereum protocol - AMBCrypto News",
        "content": "Liquid Staking Tokens control 41% of staked ETH, raising concerns about dependency and leveraging risks.\n\nLido and Rocket Pool dominate, witnessing increased interest in stETH and rETH tokens.\n\nLiquid Staking Derivative protocols have been increasingly occupying the DeFi space, gradually becoming dominant players in the Ethereum[ETH] staking arena. As a result, the tokens associated with these protocols experienced a massive surge in interest and adoption.\n\nIs your portfolio green? Check out the Ethereum Profit Calculator\n\nLSTs on the rise\n\nAccording to Kate Young Ju, an analyst on CryptoQuant, Liquid Staking Tokens (LSTs) have successfully utilized 41% of the total ETH staked in the ecosystem. This high level of utilization raises concerns, as it indicates a significant dependency on this particular form of staking.\n\nFurthermore, it was worth noting that these LSTs were leveraged by a factor of 2, introducing potential dangers and weaknesses to the ecosystem. Leveraging amplifies both gains and losses, making investments more volatile and susceptible to market fluctuations. This increased risk can pose challenges for participants involved in LSTs and may impact the stability and resilience of the ecosystem as a whole.\n\nAt press time, the largest players in this sector were Lido and Rocket Pool. The staked ETH tokens associated with both protocols, stETH and rETH respectively, witnessed a notable surge in interest and usage. This surge was evident from the growing number of token holders, indicating an increasing interest among various addresses.\n\nIn addition to the growing number of token holders, the velocity of these tokens also witnessed an uptick. This suggested that the frequency with which these tokens were being transferred and used also increased, reflecting a higher level of activity within the ecosystem.\n\nEthereum plays a big role\n\nHowever, it was essential to highlight that the growth of Liquid Staking Tokens was not solely driven by their own appeal, but also by the broader interest in the Ethereum protocol and ETH. Users are increasingly drawn to Ethereum, contributing to the rising traction and adoption of Liquid Staking Tokens.\n\nOver the past month, the revenue generated by validators witnessed a significant decrease of 62.07%. Despite a decline in revenue for validators on the Ethereum network, the number of validators experienced a notable surge of 7.65% in the last 30 days, reaching a count of 637,732 according to Staking Rewards’ data. This sustained interest in staking remains intact, even in the face of falling revenue.\n\nRealistic or not, here’s ETH’s market cap in BTC terms\n\nAs for the price of Ethereum, it was trading at $1,855.10 at press time according to CoinMarketCap’s data. It experienced a slight decline of 0.2% in the last 24 hours. Additionally, its trading volume decreased by 28.20% during the same period."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNy8wMS90b3AtY3J5cHRvLWFuYWx5c3QtcHJlZGljdHMtb3Zlci0zMC1zdXJnZS1mb3ItbGl0ZWNvaW4tc2F5cy1vbmUtZXRoZXJldW0tcml2YWwtZmxhc2hpbmctYnVsbGlzaC1zaWduYWwv0gGMAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA3LzAxL3RvcC1jcnlwdG8tYW5hbHlzdC1wcmVkaWN0cy1vdmVyLTMwLXN1cmdlLWZvci1saXRlY29pbi1zYXlzLW9uZS1ldGhlcmV1bS1yaXZhbC1mbGFzaGluZy1idWxsaXNoLXNpZ25hbC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Jul 2023 07:00:00 GMT",
        "title": "Top Crypto Analyst Predicts Over 30% Surge for Litecoin, Says One Ethereum Rival Flashing Bullish Signal - The Daily Hodl",
        "content": "A crypto trader who correctly called the 2018 Bitcoin (BTC) bear market bottom is predicting a strong burst to the upside for Litecoin (LTC).\n\nPseudonymous trader Bluntz tells his 223,300 Twitter followers that the peer-to-peer payments network Litecoin appears poised to surge ahead of its halving event slated for August.\n\nAccording to the crypto strategist, LTC looks bullish on both its USD and BTC pairs.\n\n“I think LTC is finally gearing up for the halving run.\n\nAttempting a 195-day range breakout on the USD pair and also firmly back into the prior breakdown range on its BTC pair indicating a move to the top of the range.\n\nAnother one I’m happy to hold for a long-term swing.”\n\nLooking at the analyst’s chart, he appears to predict a Litecoin rally toward $140. At time of writing, LTC is trading for $107.16, suggesting an upside potential of over 30% should Litecoin hit Bluntz’s target.\n\nTurning to Ethereum (ETH) competitor Solana (SOL), Bluntz says that the 11th-largest crypto asset by market cap is flashing a bullish reading against Bitcoin (SOL/BTC).\n\n“Nearly 10% four-hour candle on SOL plus a very nice daily engulfing forming on the BTC pair.”\n\nAt time of writing, the SOL/BTC pair is trading for 0.0006069 BTC worth $18.49.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DreamStudio"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vbmZ0bm93LmNvbS9mZWF0dXJlcy93aHktYXJlLXBlb3BsZS1idXJuaW5nLWNyeXB0b3B1bmtzLWZvci1vcmRpbmFscy1uZnRzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Why Are People Burning CryptoPunks for Ordinals NFTs? - nft now",
        "content": "On June 17, CryptoPunk #8611 was permanently removed from circulation. The NFT, which had recently sold for 54.49 ETH (just over $94,000 at the time), was soon after transferred to an Ethereum burn address, meaning it can never be recovered. From there, a digital asset visually similar to the original CryptoPunk was inscribed on the Bitcoin blockchain as an Ordinal, that ecosystem’s version of an NFT, and then sent to a Satoshi wallet. Moreover, anyone who burns a Punk will receive an allowlist spot for a new Bitcoin Ordinals collection: Ordinal Maxi Biz.\n\nThe event has raised Web3’s collective eyebrow, and for good reason. Punk #8611 isn’t the only Ethereum-based NFT or NFT project to make an appearance in the Bitcoin Ordinals ecosystem, and it certainly won’t be the last. But CryptoPunks are no regular NFT collection. One of the first projects minted on the Ethereum blockchain, the OG PFP project from Larva Labs has achieved an iconic status not only within the crypto art world but in the world of fine art collecting as well. They’re also obscenely valuable as a digital asset, as the lower end of the collection will cost you a cool 44.9 ETH ($86,000 at the time of writing).\n\nSo, why exactly are people burning these legendary and costly Ethereum NFTs? To answer that, we need to look at who’s behind the Ordinal Maxi Biz project, their aim, and how this could affect the original CryptoPunks collection.\n\nWho’s behind the CryptoPunks burn trend?\n\nThe buyers of Punk #8611 are part of a Web3 collective called Bitcoin Bandits, an Ordinals project of pixelated NFT characters led by Natan Stein. Stein has spent the last month leading an unspecified number of Bitcoin Ordinals enthusiasts in their mission to collectively buy a CryptoPunk and “move” it to the realm of Ordinals Inscriptions. While it’s impossible to translate an NFT from one blockchain to another like this, you can burn an Ethereum NFT (taking it out of circulation) and create its visual equivalent as an Ordinal on Bitcoin, which is what happened with Punk #8611. From a surface-level perspective, the NFT disappeared from one and appeared on the other.\n\nThe burning of CryptoPunks is part gall and part belief in the historicity of the Bitcoin’s Ordinals NFT movement, something that has split the Bitcoin community in two: Bitcoin purists, who oppose Ordinals (sometimes referred to as Bitcoin maxis), and those who welcome the change.\n\nHolders from @banditsbtc are crowdfunding to burn a CryptoPunk\n\n\n\nThe idea is to use @an_app_by_bb to burn a Punk on ETH, inscribe it on BTC and send it to Satoshi wallet!\n\n\n\n+ win @OrdinalMaxiBiz WL\n\n\n\nLet`s underunstand how the process will workhttps://t.co/dIekg2YaMF pic.twitter.com/b8IS1GMQoN — NatanStein (@natan_stein) June 16, 2023 TLDR:\n\n\n\n1 Share (0.01 BTC) = 1 Fraction of a CryptoPunk + 1 Fraction of a OMB\n\n\n\nMake history joining us on Phase #1https://t.co/dIekg2YaMF — NatanStein (@natan_stein) June 16, 2023\n\nBut the move also includes two other aims. For Bitcoin Ordinals enthusiasts, the first goal is to emphasize that blockchain’s potential for innovation in the NFT space. While the blockchain is far older than Ethereum, the latter has, without question, been at the forefront of NFTs for years. With the introduction of the Ordinals protocol in January of this year, a major shift has occurred, and many Web3 enthusiasts believe a golden age for the Bitcoin ecosystem is on the horizon.\n\nLikewise, a portion of Bitcoin Ordinals supporters believe in shaking up the ossified cultural lines that divide the two NFT ecosystems. Burning such well-known and respected NFTs and inscribing them on the Bitcoin as Ordinals, they claim, is a bold and symbolic way to achieve this, though few in the Ethereum ecosystem see it that way.\n\nCredit: OMB\n\nOn June 15, the team behind Bitcoin Bandits opened up their burn site for CryptoPunks, offering Punk holders an Ordinal Maxi Biz allowlist spot in return for inscribing their highly-valued Ethereum NFT to the Bitcoin ecosystem. Punk #8611 was the first to cross the threshold, leaving the Ethereum chain forever. #8611 was also fractionalized, and its ownership is split between the individuals who raised money to buy the original Ethereum NFT. A few days later, CryptoPunk #9146 followed suit.\n\nCryptoPunk #8611. Credit: Larva Labs CryptoPunk #9146. Credit: Larva Labs\n\nOrdinal Maxi Biz\n\nThe Ordinals collection that CryptoPunk burners received allowlist spots for is Ordinal Maxi Biz, a project from zk shark and Web3 historian Nullish consisting of roughly-sketched heads with varying traits, including red, green, and blue eyes drawn by Tony Tafuro. Red-eyed OMBs were the first in the collection, with blue-eyed OMBs being added later and inscribed on Bitcoin Block 78, which was created in 2009.\n\nWith a recent introduction of 1,900 green-eyed pieces (inscribed on Block 9, one of the blocks mined by Bitcoin’s creator, Satoshi Nakamoto), the collection currently stands at 2.1k pieces and has a healthy total trading volume on Magic Eden’s Ordinals marketplace of over 173.44 BTC ($5.3 million). Top sales include OMB #27 for 3.33 BTC ($88,321) and OMB #64 for 3.2 BTC ($83,453). The collection features no enforced royalties or metadata changes and will never move to another chain, according to a collection manifesto posted by the team in March.\n\nOMB NFTs. Credit: Magic Eden\n\nWhat happens next?\n\nNot everyone is pleased with what Bitcoin Bandits and OMB are doing to the legacy Ethereum collection, with some members of the CryptoPunks community expressing disbelief that people would ever consider burning the NFTs for the new Bitcoin Ordinals collection. Some have speculated that reducing the supply of Ethereum CryptoPunks could drive the price of that collection up, though not many seem pleased with the prospect even if it does occur, given the cultural and historical ramifications of burning a CryptoPunk.\n\nBut Bitcoin Bandits isn’t satisfied with just going after CryptoPunks, either. On June 27, the team tweeted out a call for people to burn their Azuki NFTs to bring them over to the Bitcoin ecosystem in just the same way.\n\n“Don’t let your beautiful Azuki NFTs get diluted with Elementals, bring them to Bitcoin,” the team wrote in a seeming attempt to capitalize on the recent controversy surrounding Azuki’s troubled Elementals mint.\n\nOrdinals Maxi Biz is still a relatively young Ordinals collection, and it remains to be seen just how its existence and gravity affect CryptoPunks in the long run. Regardless, the pull of the Ordinals protocol continues to be one of the dominant forces in the crypto art world and might just be getting started."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vdS50b2RheS9zaGliLWJ0Yy1ldGgtY2FuLW5vdy1iZS11c2VkLXRvLWJvb2stNjAwLWFpcmxpbmVzLXZpYS10aGlzLXBhcnRuZXJzaGlw0gFaaHR0cHM6Ly91LnRvZGF5L3NoaWItYnRjLWV0aC1jYW4tbm93LWJlLXVzZWQtdG8tYm9vay02MDAtYWlybGluZXMtdmlhLXRoaXMtcGFydG5lcnNoaXA_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "SHIB, BTC, ETH Can Now Be Used to Book 600 Airlines via This Partnership - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nShiba Inu, Bitcoin, Ethereum and other cryptocurrencies supported by Binance Pay are accepted as payments to book 600 airlines via the online booking platform Alternative Airlines.\n\nAdvertisement\n\nBinance said in a new tweet that crypto holders can now book their next vacation using cryptocurrencies. It adds that it has partnered with Alternative Airlines to provide users with discounts on flight bookings paid for with Binance Pay.\n\nBook your next vacation using crypto and save while you're at it!\n\n\n\nWe've partnered with Alternative Airlines to give you a 3% discount on flight bookings, when paid for using #Binance Pay.\n\n\n\nFind out more 👇 — Binance (@binance) June 30, 2023\n\nAlternative Airlines, a global flight booking site, accepts Binance Pay as a payment method, allowing users to buy and book flights with over 600 airlines.\n\nIn addition, Binance Pay, a cryptocurrency payment technology, has launched a promotion in collaboration with Alternative Airlines, spanning from July 1 until Aug. 31, that allows crypto users to get 3% off flights when they pay in crypto using Binance Pay.\n\nBesides Shiba Inu and Bitcoin, Binance Pay, a cryptocurrency payment technology by Binance, supports over 70 cryptocurrencies such as ADA, ATOM, AVA, BCH, BNB, BTC, DOGE, DOT, EGLD, EOS, ETC, ETH, FTM, HBAR, IOTX, LINK, LTC, MANA, MATIC, TRX, TUSD, UNI, USDC, USDT, VAI, VET, XLM, XMR, XRP, XTZ, XVS, ZEC, ZIL and others.\n\nShiba Inu exposure increases\n\nThis week, Shiba Inu scored a big new crypto exchange listing on SBI VC Trade, a cryptocurrency exchange subsidiary of SBI, a Tokyo-based financial holding company.\n\nBITPoint, Japan's first top exchange to list Shiba Inu, reaffirmed its support for Shiba Inu in a tweet.\n\nAt the time of writing, SHIB was marginally down in the last 24 hours to $0.0000075. According to the Shibburn Twitter account, 1,653,845,435 SHIB tokens were burned in June through 164 transactions. In the past 24 hours, a total of 3,894,189 SHIB tokens have been burned via three transactions."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY3J5cHRvZGFpbHkuY28udWsvMjAyMy8wNi9tYXN0ZXJjYXJkLXdvcmtpbmctb24tZXRoZXJldW0tYmFzZWQtbXVsdGktdG9rZW4tbmV0d29ya9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Mastercard Working On Ethereum-Based Multi-token Network - CryptoDaily",
        "content": "Mastercard, a leading provider of credit card services, is expanding its footprint into the burgeoning digital asset space.\n\nIn an ambitious move, the payments giant plans to launch a blockchain-based marketplace for financial applications, propelling the evolution of payment solutions beyond traditional parameters.\n\nDiving Deeper into Blockchain Technology\n\nIn the quest to foster innovation in the financial technology space, Mastercard is poised to launch the beta version of its Mastercard Multi Token Network (MTN) in the UK in the coming months. The venture is being touted as an \"app store powered by blockchain technologies for building regulated financial applications.\"\n\nRaj Dhamodharan, Mastercard's Executive Vice President and Head of Crypto and Blockchain, emphasized the value of the underlying technology that powers crypto, stating that it is \"actually quite useful.\"\n\nDevelopers leveraging MTN will gain access to a myriad of tools that the company has been developing, one of which includes a private Ethereum-based blockchain, specifically crafted for the creation of novel applications. Mastercard's deep-seated commitment to the digital asset sector is further affirmed by products such as 'Crypto Secure,' 'Crypto Source,' and 'Crypto Credential.' These are geared towards enhancing transparency and trust in the digital asset space.\n\nDevelopers working on the beta version will also be able to experiment with tokenized commercial bank deposits and blockchain data that provides real-time insights into a person's bank account balance.\n\nMastercard's Vision for the Future of Payments\n\nMastercard's vision for the MTN is to \"provide a set of foundational capabilities designed to make transactions within the digital asset and blockchain ecosystems secure, scalable and interoperable — ultimately enabling more efficient payment and commerce applications.\"\n\nThe company's official announcement highlighted the importance of trust in the new digital ecosystem, stating,\n\n\"To realize the potential of blockchain and digital assets as critical infrastructure for storing and moving value, we’re launching the Mastercard Multi-Token Network.\"\n\nMastercard equates the current trajectory of digital asset and blockchain technologies to the internet's growth arc, predicting a similar transformational impact on the global economy.\n\n\"We believe that digital asset and blockchain technologies today are on a similar trajectory, one day becoming critical infrastructure for storing and moving value.\"\n\nMastercard's venture into the blockchain app store space represents a major shift towards the adoption of crypto technology in the financial industry, showcasing the company's steadfast commitment to promoting a wider range of secure, accessible, and always-on payment solutions.\n\nThe launch of the MTN, which the company describes as one of their most ambitious projects to date, is a crucial step towards fulfilling their vision for the future of payments. Mastercard anticipates making the MTN available to more markets around the world in due course, fostering an environment where the wider digital asset industry can thrive.\n\nDisclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGgtbWFrZXMtYS1mcmVzaC1zdGFydC1pbi1xMy1idXQtdHJhZGVycy1uZWVkLXRvLWJlLWFsZXJ0LWJlY2F1c2Uv0gFdaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2V0aC1tYWtlcy1hLWZyZXNoLXN0YXJ0LWluLXEzLWJ1dC10cmFkZXJzLW5lZWQtdG8tYmUtYWxlcnQtYmVjYXVzZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Jul 2023 07:00:00 GMT",
        "title": "ETH makes a fresh start in Q3, but traders need to be alert - AMBCrypto News",
        "content": "Etheruem’s witnessed an 82% surge in its quarterly fees.\n\nETH’s RSI and MACD indicators indicated that there was some ongoing bullish relief for the altcoin\n\nThe start of Q3 2023 came with some good news for the altcoin market. This was because most altcoins stepped into the third quarter with some strong bullish strides. As per data from CoinMarketCap, Ethereum [ETH] was also exchanging hands 3.93% higher in the last 24 hours.\n\nTo add to the growing price of ETH, a tweet from IntoTheBlock also highlighted a significant update from Q2. As per the tweet, ETH’s quarterly fees witnessed an 83% growth over Q2 of 2023. Additionally, the tweet also highlighted that speculation around meme tokens could be the driving factor for the growth in the ETH fees.\n\nRead Ethereum’s [ETH] Price Prediction 2023-24\n\nNew hopes for a new quarter\n\nA look at Ethereum’s performance on the NFT front painted quite a positive picture. As per data from CRYPTOSLAM, ETH’s NFT sales volume witnessed a surge by 129.90% over the last seven days. Furthermore, the network also saw a 25% surge in buyers and a 23% surge in sellers along with the wash volume up by almost 79%.\n\nFurthermore, data from the intelligence platform Santiment depicted that the development activity metric could use some effort from the developer end. This was because, at press time, ETH’s development activity stood at 39.32, which was strikingly lower considering the trend over the last few days.\n\nHowever, ETH’s volume witnessed a spike as of 30 June. A rise in the volume along with a price movement in the positive direction could indicate a sign that investor were accumulating the altcoin. Furthermore, the weighted sentiment towards ETH also showed slow but steady improvement since touching a bottom on 9 June.\n\nWho sides with ETH?\n\nA tweet posted by the Ethereum Fear and Greed Index stated that the investor sentiment in the market was that of greed as the number stood at 55. However, does ETH’s daily chart reflect the same?\n\nAt press time, ETH was trading 4.22% higher than its opening price for the day. Additionally, looking at the position of ETH’s Relative Strength Index (RSI), it could be stated that there was significant buying pressure in the market. This was because ETH’s RSI stood at 60.25 and was seen moving towards the overbought zone.\n\nHow much are 1,10,100 ETHs worth today\n\nAdditionally, ETH’s Moving Average Convergence Divergence (MACD) line (blue) stood above the signal line (red) above the zero line. This indicated a strong bullish movement for ETH. However, despite the bulls supporting ETH as of 30 June, traders should maintain caution.\n\nThis was because ETH’s Awesome Oscillator (AO) flashed red bars above the zero line. A slight dip in the buying pressure may drive changes to the position of the indicators and a price correction for ETH."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMingFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9tYXJrZXQtYWN0aXZpdHktc2hvd3Mtd2hhbGVzLWFyZS1mYXZvdXJpbmctaW5xdWVidGEtcXViZS1vdmVyLWV0aGVyZXVtLWV0aC1hbmQtcG9seWdvbi1tYXRpYy1hcy1hbmFseXN0cy1wcmVkaWN0LTUwMDAtZ3Jvd3RoL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Market Activity Shows Whales Are Favouring InQuebta (QUBE) over Ethereum (ETH) and Polygon (MATIC) as Analysts ... - Analytics Insight",
        "content": "The crypto market is filled with excitement as investors and industry insiders closely watch the movement of whales, those with significant crypto holdings, who have been making strategic bets on promising projects. InQubeta (QUBE) has emerged as a dark horse, captivating the attention of whales who are choosing it over established crypto giants like Ethereum (ETH) and Polygon (MATIC) to potentially make exponential gains in 2023.\n\nWe explore the reasons why whales are flocking to InQubeta, its unique features, and the potential for significant growth, positioning it as an enticing investment opportunity.\n\nInQubeta: Disrupting the AI Funding Landscape\n\nInQubeta is revolutionizing the AI funding landscape by providing an ecosystem that connects AI startups with investors. Here’s why whales are favoring InQubeta over Ethereum and Polygon:\n\nInnovative Fractionalized NFTs: InQubeta introduces fractionalized non-fungible tokens (NFTs) that enable investors to participate in funding AI projects. By fractionalizing NFTs, investors can gain exposure to high-potential startups with a smaller investment, spreading their risk across multiple projects. This democratized approach to AI funding appeals to whales who seek diversification and the potential for substantial returns. QUBE Token: Utility and Governance: InQubeta’s native token, QUBE, plays a crucial role within the ecosystem. It serves as both a utility token for accessing services and a governance token, allowing holders to participate in decision-making processes. Whales recognize the value of QUBE in driving the ecosystem’s growth and actively seek to accumulate the token, driving up demand and potentially increasing its value over time. Experienced Team and Advisors: InQubeta boasts a team of experienced professionals with deep expertise in the AI and blockchain industries. Their knowledge and connections position InQubeta for success, attracting whales who recognize the importance of a strong team in executing the project’s vision. Additionally, the project has secured influential advisors who provide guidance and open doors to potential partnerships, further bolstering its appeal to whales. Burn Mechanism and Scarcity: InQubeta has implemented a burn mechanism for QUBE tokens, gradually reducing the token supply over time. This burn strategy creates scarcity and potentially contributes to price appreciation, attracting whales who anticipate a limited supply and increased demand for QUBE tokens in the future.\n\nInQubeta vs. Ethereum and Polygon: Differentiating Factors\n\nWhile Ethereum and Polygon are established players in the crypto market, InQubeta offers unique differentiating factors that attract whales:\n\nNiche Focus on AI: InQubeta focuses specifically on the AI industry, catering to a niche market with immense potential for growth. Whales recognize the significance of AI advancements and the transformative impact it can have across various sectors. By betting on InQubeta, they position themselves at the forefront of this disruptive industry, potentially reaping significant rewards. Early-Stage Investment Opportunities: InQubeta’s ecosystem provides whales with early-stage investment opportunities in AI startups. This allows them to get in on the ground floor of potentially groundbreaking projects, maximizing their potential returns. In contrast, Ethereum and Polygon, being more mature platforms, may offer fewer opportunities for early-stage investments. Ecosystem and Community Development: InQubeta fosters a vibrant ecosystem and community where startups, investors, and AI enthusiasts converge. This collaborative environment creates opportunities for networking, knowledge sharing, and potential partnerships. Whales recognize the value of being part of a thriving community and the potential for additional growth and opportunities that it brings.\n\nConclusion\n\nWith its innovative AI funding ecosystem, fractionalized NFTs, utility and governance token (QUBE), and experienced team, InQubeta presents a unique investment opportunity that appeals to whales seeking exponential gains in 2023. While Ethereum and Polygon have their own merits, InQubeta’s niche focus, early-stage investment potential, and community-driven approach make it an enticing choice for whales looking to diversify their portfolios and capitalize on the transformative power of AI.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jb2luYmFzZS1sYXllci0yLWJhc2UtY2xvc2VyLW1haW5uZXQtbGF1bmNo0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Coinbase layer-2 network Base closes in on mainnet launch - Cointelegraph",
        "content": "Base, a new layer 2 application-focused protocol by Coinbase, has just one criterion left to fulfill before being ready for mainnet launch.\n\nOn June 29, the team said the Optimism-powered, Ethereum-secured network has been subject to six months of rigorous security audits — both internally and externally — its second-last criteria required for launch.\n\n“With the completion of these audits, we’ve now fulfilled ⅘ of our criteria for mainnet launch,” Base said, adding that the team feels confident after not finding any critical code bugs:\n\n“Completing these in-depth security workstreams without discovering critical severity bugs gave the Base team confidence to proceed towards mainnet launch.”\n\nThe other three criteria passed included a “Regolith” hard fork in testnet, a successful infrastructure review with OP labs — the team behind Optimism — and Optimism’s “Bedrock” upgrade.\n\nP.S. In case you’re keeping track, with the completion of these audits, we’ve now fulfilled ⅘ of our criteria for mainnet launch…https://t.co/eRarQ4R7zG https://t.co/9o3vNidNtE — Base ️ (@BuildOnBase) June 29, 2023\n\nCoinbase officially launched Base on Feb. 23. It aims to be a low-cost, secure, developer-friendly network for building decentralized applications.\n\nTo “battle-test” Optimism’s tech stack, Coinbase’s protocol security team conducted its own internal audit to identify any vulnerabilities that may emerge on layer 1, layer 2 and on the bridges.\n\nIn addition to Coinbase's internal audit, Base invited the broader community to partake in a public smart contract audit test via Code4rena to report bugs found in the Optimism’s tech stack:\n\n“We engaged over 100 security researchers as part of this contest, and are happy to report there were no significant vulnerabilities discovered.”\n\nAmong the audits investigated by the security researchers included Optimism’s node software, Ethereum Virtual Machine (EVM) equivalence vulnerabilities, bridge vulnerabilities and miscellaneous smart contract issues.\n\nWe’ve detailed…\n\nHow we’re secured by the OP stack\n\nOur experience with both internal and external audits\n\nThe development of our open-source monitoring tool\n\nWhat it means to launch mainnet with this security first mindset — Base ️ (@BuildOnBase) June 29, 2023\n\nThe community audit ran from May 27 to June 10, with a maximum of $100,000 in rewards handed out to successful bounty hunters.\n\nDemonstrating “testnet stability” is the final criteria that needs to be passed prior to mainnet launch, according to a previous post from Base.\n\nThe five criteria required for Base to launch on mainnet. The timeline provided by Base was published on May 25. Source: Base\n\nWhile Base didn’t state how the final criteria would be fulfilled exactly, the team said that they’re still reviewing submissions from the 100 researchers that took part in the public smart contract audit in addition to reviews from past audit programs — namely “spearbit” and “sherlock.”\n\nBase added that they’d built Pessimism, an open-source monitoring tool that aims to notify builders of any anomalies that may arise in the protocol, such as account balance irregularities, contract events, or disparities between L1 and L2 states.\n\nRelated: Coinbase CEO says Bitcoin Lightning is 'something we’ll integrate'\n\nIn late March, Coinbase said they want to see an inflation-pegged “flatcoin,” an on-chain reputation system and an on-chain limit order book exchange built on Base.\n\nMany considered the development of Base to be a “massive vote of confidence for Ethereum” when the news was first announced in late February.\n\nSecured on Ethereum and powered by layer-2 network Optimism, Base aims to eventually become a network for building decentralized applications.\n\nMagazine: ’Account abstraction’ supercharges Ethereum wallets: Dummies guide"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC90aGlzLWFpLWFsdGNvaW4taXMtcG9pc2VkLWZvci1hLTEwMDAwLXN1cmdlLWluLTIwMjMtYW5kLWNvdWxkLWpvaW4tZXRoZXJldW0tZXRoLWFzLWEtdG9wLTUwLWNyeXB0by_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "This AI Altcoin is Poised for a 10,000% Surge in 2023 and could join Ethereum (ETH) as a Top 50 crypto - Analytics Insight",
        "content": "In the vast and ever-evolving crypto market, new altcoins emerge with the potential for extraordinary growth and disruptive impact. One such hidden gem is InQubeta (QUBE), an under-the-radar AI altcoin that has caught the attention of savvy investors.\n\nWith the potential to surge by a staggering 10,000% in 2023, QUBE aims to establish itself alongside established giants like Ethereum (ETH) in the top 50 cryptocurrencies. Let’s look at some compelling reasons why investors are flocking to the QUBE presale and why it is positioned for exponential growth.\n\nQUBE: Unlocking the Power of AI with Unique Features\n\nQUBE stands out from the crowd with its innovative features and utilities. Here’s why investors are eagerly participating in the QUBE presale and projecting tremendous growth for the altcoin:\n\nUtility Token with Fractional Investment Opportunities: QUBE serves as a utility token that enables investors to participate in AI startup investments through fractional ownership opportunities. By leveraging reward and equity-based non-fungible tokens (NFTs), QUBE empowers investors to diversify their portfolios and benefit from the potential success of multiple AI projects. Deflationary Token Structure: QUBE adopts a deflationary token model, encouraging scarcity and potential value appreciation. With a 2% buy and sell tax directed to a burn wallet and a 5% sell tax allocated to a dedicated reward pool, QUBE reduces the token supply over time, increasing each token’s scarcity and potential value. Built on established Ethereum Blockchain: QUBE’s foundation lies on the Ethereum blockchain, a proven and accomplished ecosystem that has established its dominance in crypto. By leveraging Ethereum’s robust infrastructure and network effects, QUBE benefits from the security, scalability, and interoperability offered by the Ethereum blockchain. Staking Features and Governance: QUBE provides users with staking capabilities, allowing them to earn rewards for holding and contributing to the stability and security of the network. Moreover, QUBE serves as a governance token, empowering holders to propose ideas, vote on proposals, and shape the project’s future direction. This inclusive approach enhances community involvement and aligns the project with the interests of its stakeholders. Verified Security and Audit: QUBE has undergone comprehensive security audits and verifications by renowned platforms such as Block Audit and Hacken, ensuring the integrity and reliability of its smart contracts. These third-party audits give investors confidence in the project’s security measures and help mitigate potential risks.\n\nParticipating in the InQubeta QUBE Presale: Inclusivity and Convenience\n\nParticipating in the QUBE presale is straightforward and accessible to a wide range of investors. Here’s how you can join the QUBE presale:\n\nImpressive Early Interest and Minimal Entry Fee: The QUBE project has already raised an impressive $600,000 in just a few weeks since its launch, highlighting the significant interest it has garnered. With a minimum entry fee of $50, the presale aims to be inclusive, enabling investors of varying financial capacities to participate and contribute to the project’s success. Multiple Payment Systems and Supported Cryptocurrencies: The QUBE presale accepts various payment systems, including popular cryptocurrencies such as BTC, USDT, ETH, BNB, and more. This flexibility provides investors with convenience and allows them to contribute using their preferred digital assets.\n\nBuy InQubeta Presale\n\nBottom Line\n\nAs investors seek the next big opportunity in the crypto market, QUBE has emerged as an under-the-radar AI altcoin with tremendous growth potential. With its utility token features, deflationary structure, Ethereum foundation, staking capabilities, governance functions, and verified security, QUBE embodies the qualities that attract investors looking for exponential gains. By participating in the QUBE presale, investors can position themselves to benefit from the altcoin’s projected surge and potential rise to the ranks of the top 50 cryptocurrencies.\n\nVisit InQubeta Presale\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmFmci5jb20vd2VhbHRoL2ludmVzdGluZy90aGlzLWludmVzdG1lbnQtcmV0dXJuZWQtNzRwYy1hcy1sb3NlcnMtdHVybi13aW5uZXJzLTIwMjMwNjI5LXA1ZGtoZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "ETF winners and losers in 2023: Global X's 21 shares ethereum ETF, FANG+ ETF - The Australian Financial Review",
        "content": "He suspects investors may be less concerned about inflation, and more interested in tilting towards potential revenue opportunities in AI. “It could just be that there is a level of mean reversion and some of the assets with the biggest falls from 2022 are bouncing back for no reason other than they fell quickly,” Mr Brycki added.\n\nThe second-highest performing ETF this financial year, the Global X Fang+ ETF was one of the worst performing in the 2022 calendar year, returning -37.02 per cent. Similarly, the provider’s ultra-long Nasdaq 100 hedge fund returned 42 per cent in the financial year to June 23, but was down 70.36 per cent over the 12 months to December 31.\n\nGlobal X Australia head of investment strategy Blair Hannon said there had been a “substantial” change in market sentiment for mega-cap tech stocks in the United States between 2022 and 2023. “You would have to live under a rock to avoid being inundated with news on generative AI and many of the FANG+ names are at the forefront of this trend,” he said.\n\nNvidia’s position as one of the leading companies producing AI hardware, coupled with Google and Microsoft’s decisions to implement AI into their search engines also boosted the ETF, Mr Hannon added.\n\nBetaShares’ global robotics and AI ETF also returned 39.6 per cent in the 12 months to June 23, 2023, but, likewise, was down 38.31 per cent over 2022.\n\nAdvertisement\n\nLosers\n\nAt the other end of the spectrum, Global X’s ultra-short Nasdaq 100 hedge fund, Betashares’ crude oil, currency hedged synthetic ETF and the Global X physical palladium ETF were the worst performers, followed by BetaShares US equities currency hedged ETF.\n\nHowever, in 2022, Global X’s ultra-short Nasdaq 100 fund, and Betashares’ crude oil and US equities currency hedged ETFs were among the 10 products with the highest returns.\n\nMr Hannon said Global X’s ultra-short Nasdaq ETF struggled simply because the Nasdaq itself was performing well.\n\n“It is actually performing exactly as it is designed to do. This does underscore the need for investors to understand how geared ETFs work, so they can use them effectively in a portfolio,” he said.\n\nStockspot’s Mr Brycki said the lesson for investors is to simply pay “no attention” to one-year returns, as they have no bearing on future performance, “or even whether some products are investible”.\n\n“Instead investors should be focusing on the areas that they can control when investing: diversification, costs and their own behaviour.”"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vd3d3LnRoZW5ld3NtaW51dGUuY29tL25ld3MvcmVzdXJnZW5jZS1iaXRjb2luLXMtZG9taW5hbmNlLTE3OTE3NtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "The resurgence of Bitcoin's dominance - The News Minute",
        "content": "In the immediate term, Bitcoin dominance may consolidate around 52-53% where it can encounter resistance. The eventual target for dominance this year is around 56-60% before the market finds a low and becomes healthy. By this time, most altcoins will further lose 20-40% in value against BTC from current levels – this calls for prudence among investors to stick to Bitcoin and Ethereum for most of their crypto portfolio. Once Bitcoin dominance hits its cycle high, altcoins become favourable from a risk-reward perspective."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3Rtcy1uZXR3b3JrLXRtc24taXMtbW9yZS1hdHRyYWN0aXZlLWRlc3BpdGUtYnVsbGlzaC1zaWduYWxzLWZvci1iaXRjb2luLWJ0Yy1hbmQtZXRoZXJldW0tZXRoL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Jul 2023 07:00:00 GMT",
        "title": "TMS Network (TMSN) is more attractive despite bullish signals for Bitcoin (BTC) And Ethereum (ETH) - Analytics Insight",
        "content": "After a week-long rally, the crypto market is taking a breather. Most cryptocurrencies that were on a surge are seeing minor market corrections. Bitcoin (BTC) is still trading above $30,000, and Ethereum (ETH) is trading above $1800. A price analysis of both suggests another rally is on the way.\n\nHowever, both Bitcoin (BTC) and Ethereum (ETH) have huge market capitalizations. They have already had years of explosive growth. They may still show profits, but they will be minor.\n\nTMS Network (TMSN), on the other hand, is a newly launched small-cap cryptocurrency with a great value proposition. This sets it up for a robust rally. Industry experts forecast a 100-fold increase during the upcoming bull run. This has made the token a hot pick among investors in its ongoing presale.\n\nTMS Network (TMSN) is a newly launched decentralized trading platform with many unique features, including margin trading, social trading, and an integrated derivatives market. This has made it attractive to traders looking for a more seamless and enjoyable trading experience.\n\nRead on as we examine expert projections for Bitcoin (BTC) and Ethereum (ETH), as well as the potential of TMS Network (TMSN) as a more promising pick.\n\nBitcoin (BTC) Price Prediction\n\nLast week, Bitcoin (BTC) embarked on a remarkable rally, temporarily surpassing the $31,000 mark to signal a comeback. The spike began shortly after BlackRock announced the launch of a Bitcoin exchange-traded fund (ETF). This was quickly followed by similar announcements from Fidelity Digital Assets and Citadel Securities. The resulting excitement caused Bitcoin (BTC) to rise 16.5% in one week, setting a new yearly high.\n\nThe current price of Bitcoin (BTC) is $30,519, with a daily trading volume of $13,551,974,388 and a market cap of $592,467,241,402. Bitcoin (BTC) has gained 1.67% in the last 24 hours and 3.79% in the last week. It is the largest cryptocurrency in the entire ecosystem, with a 50.4% market share.\n\nBitcoin is facing significant resistance at the $30,700 and $30,932 levels. If Bitcoin (BTC) breaks over this level, it will reclaim $31,000, with the next resistance level at $31,190.\n\nEthereum (ETH) Price Prediction\n\nEthereum (ETH) has managed to maintain a generally bullish year despite all the turmoil. ETH has traded above the crucial support level of $1075 for the better part of 2023.\n\nThe recent buzz surrounding Bitcoin ETFs spilled over to Ethereum (ETH), creating an upward trend that saw the token trade between $1,872.94 and $1,932.53 last week. Ethereum (ETH) is currently trading at $1,849.58, with a daily trading volume of $6,350,186,741. It is the second largest cryptocurrency behind Bitcoin (BTC), with a market valuation of $222,332,625,253. Ethereum (ETH) holds a market share of 18.9%.\n\nEthereum (ETH) has dropped 1.51% in the last 24 hours and 2.09% in the last seven days.\n\nIn a bullish scenario, Ethereum (ETH) should grow by 0.10% during the next week, reaching $ 1,858.24. ETH faces resistance around $1,868.03, $1,904.49, and the highest resistance at $1,932.53.\n\nTMS Network (TMSN) is more Attractive For Explosive Gains\n\nWhile Bitcoin (BTC) and Ethereum promise around 10% growth, TMS Network (TMSN) is on course for nearly 500%. TMSN has recently been dominating in presale, hitting one milestone after another. The presale recently surpassed $6.2 million, with more investors continuing to make deposits.\n\nTMS Network (TMSN) not only has the potential for explosive growth, but it also has a strong value proposition. The trading ecosystem is brimming with tools to help traders maximize profits. These include strategy builders, MT4 and MT5 compatibility, and on-chain analytics.\n\nThe platform goes to great lengths to accommodate even novice traders. Anyone can follow and copy the most successful traders on the TMS Network (TMSN) Social Trading Network and profit from their trades. The platform also provides trading classes that instruct users from the most fundamental notions of price analysis up to a pro-level, helping them become better traders.\n\nFinally, TMS Network (TMSN) offers a unique revenue-sharing model that ties everything together. Holders of TMSN tokens earn commissions on trading volumes generated by other traders on the platform. This encourages increased trading activity, which generates more revenue for the platform and token holders.\n\nOverall, TMS Network (TMSN) is an exciting project with the potential to shift the way people trade derivatives and turn token holders into millionaires. The network’s ongoing presale campaign provides a fantastic opportunity to purchase the TMSN token at a discount and enjoy explosive gains once the project launches into the market.\n\nFor more information on TMS Network (TMSN):\n\nPresale: https://presale.tmsnetwork.io/\n\nWebsite: https://tmsnetwork.io/\n\nTelegram: https://t.me/tmsnetworkio\n\nTwitter: https://twitter.com/tmsnetwork_io\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYm9sZC5jb20vZXRoZXJldW0tZGVuY3VuLXVwZ3JhZGUtY29taW5nLWNhbi1pdC1zZW5kLWV0aC10by01MDAwL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Dencun upgrade coming; Can it send ETH to $5,000? - Finbold - Finance in Bold",
        "content": "After the successful deployment of the Shapella upgrade that enabled staking withdrawals, the Ethereum (ETH) development team is preparing for the launch of the Dencun upgrade, expected in late 2023, which promises to bring lots of new updates and could even lead to an ETH price hike.\n\nSpecifically, ‘Dencun’ is a joint term for two major Ethereum upgrades – Cancun, which is the upgrade to Ethereum’s execution layer (EL), and Deneb, which refers to the consensus layer (CL) upgrade, as described in an article published by Ethereum-focused cryptocurrency market news site EtherWorld on June 24.\n\nAs it happens, the Cancun upgrade introduces several Ethereum Improvement Proposals (EIPs) focused on improving storage, scalability, and optimizing gas efficiency, such as through the regulation of block rewards and delaying the gradual increase in Ethereum mining difficulty for a smooth transition to Ethereum 2.0.\n\nAt the same time, Deneb focuses on expanding the size and efficiency of the Ethereum blockchain, with one notable EIP that aims to upgrade its proof-of-stake (PoS) consensus algorithm toward increasing its power and improving user experience.\n\nEthereum price analysis\n\nWhile the Ethereum crypto community eagerly awaits this major overhaul, the price of the second-largest cryptocurrency by market cap is currently $1,888.99, recording an increase of 1.13% in the last 24 hours, 0.49% across the previous seven days, and 1.19% in its monthly chart, as per data on June 30.\n\nETH 30-day price chart. Source: Finbold\n\nTaking into account all the advances and innovations that Dencun aims to unlock, the price of Ethereum could react to this major upgrade as it nears, as well as after the development team fully deploys it, particularly as the token continues to gain investors’ confidence as a go-to asset for passive income.\n\nIndeed, taking into account the best-case scenario data from the historical Ethereum Rainbow price chart patterns, the price of ETH, as the end of the year nears, could actually skyrocket toward $5,000 and even end up in the zone of around $7,000. However, if a more bearish chart pattern reoccurs, then ETH could well remain in the $1,880 area.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vYml0Y29pbmlzdC5jb20vZXRoZXJldW0tZmVlcy1leHBlcmllbmNlLWdyb3d0aC1pbi1xMi1oZXJlcy13aHkv0gFLaHR0cHM6Ly9iaXRjb2luaXN0LmNvbS9ldGhlcmV1bS1mZWVzLWV4cGVyaWVuY2UtZ3Jvd3RoLWluLXEyLWhlcmVzLXdoeS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Network Fees Experience Significant Growth In 2023 Q2, Here’s Why | Bitcoinist.com - Bitcoinist",
        "content": "The Ethereum ecosystem had a positive run in the second quarter of 2023. From the Shapella upgrade in April to May’s memecoin frenzy, there was a lot of buzz surrounding the most prominent smart contract blockchain.\n\nThis was reflected in the network’s on-chain activity and gas fees. According to the quarterly report by blockchain analytics company IntoTheBlock, Ethereum recorded an 83% increase in network fees in the past three months.\n\nEthereum Network Fees Surge Due To Memecoin Frenzy\n\nThe network fee surge experienced by the Ethereum network has been linked to the rise of Ethereum-based memecoins in the Q2 of 2023. In the last few months, new memecoins, like APED, BOBO, PEPE, etc., have taken over the market, with some of these tokens recording huge gains.\n\nAccording to an IntoTheBlock report, speculative activity in the memecoin market is one of the major forces behind the elevated Ethereum network fees.\n\nThe impact of memecoins on Ethereum’s network activity was so high that it caused a shift in the top gas-burning altcoins at some point in April. Meme tokens, such as TROLL, APED, and BOBO, were amongst the top 10 gas-burning altcoins, displacing popular assets, like ETH, Wrapped ETH (WETH), and USDT, from their positions, according to a Santiment analysis.\n\nInterestingly, Bitcoin also saw increased network fees in 2023’s second quarter, resulting from creating tokens via the BRC-20 standard. IntoTheBlock’s report revealed that Bitcoin fees increased by over 300% in the second quarter – the highest since Q2 2021.\n\nQuarterly Update: #Bitcoin transaction fees increased 4x compared to last quarter, marking the highest increase since Q2 2021. The surge is primarily driven by Ordinals-related activity.\n\nStay tuned, we’ll share more updates on this past quarter in the coming days. pic.twitter.com/sUuilxWBNN — IntoTheBlock (@intotheblock) June 30, 2023\n\nIt is worth noting that the Ethereum network fees have cooled since the May highs, returning to a range of 15-20 Gwei in recent weeks.\n\nETH Supply Reached All-Time Low In May\n\nWhile Ethereum’s network fees rose in May, the supply of Ether tanked, reaching its all-time low. According to IntoTheBlock’s analysis, Ether’s annualized net issuance rate dropped as low as 3.75% during the memecoin frenzy.\n\nFollowing the Merge last September, the amount of ETH issued per block dipped by 90%, making Ether more prone to deflation during fee spikes. Notably, the ETH supply trend has stabilized since the network fees dropped back into the normal range.\n\nSource: IntoTheBlock\n\nAccording to CoinGecko data, ETH trades at $1,935, gaining 4.6% in the past 24 hours. The token is the second-largest cryptocurrency, with a market cap of roughly $233 billion.\n\nETHUSD trading at $1,922 | Source: ETHUSD chart from TradingView"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmNyeXB0by1uZXdzLWZsYXNoLmNvbS9zb2xhbmEtc29sLXN0aWxsLXN0YW5kaW5nLWNhbi1pdC1jaGFsbGVuZ2UtZXRoZXJldW0tZXRoLWluLXRoZS1sb25nLXJ1bi_SAXBodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vc29sYW5hLXNvbC1zdGlsbC1zdGFuZGluZy1jYW4taXQtY2hhbGxlbmdlLWV0aGVyZXVtLWV0aC1pbi10aGUtbG9uZy1ydW4vP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Jul 2023 07:00:00 GMT",
        "title": "Solana (SOL) Still Standing: Can It Challenge Ethereum (ETH) in the Long Run? - Crypto News Flash",
        "content": "Solana has emerged as a serious contender to Ethereum due to its high speed, low transaction fees, and scalability.\n\nSolana’s key innovations, including Proof-of-History (PoH), Tower Byzantine Fault Tolerance (BFT), and Turbine, enhance its performance and network throughput.\n\nAccording to a report from the Finance Feed on Binance, Ethereum has been a significant player in the blockchain industry, particularly in the realms of decentralized applications (dApps) and decentralized finance (DeFi). However, its scalability issues and high transaction fees have opened the door for other networks to compete. Solana, a blockchain network, has quickly gained attention for its high speed, low fees, and scalability, positioning itself as a promising alternative to Ethereum.\n\nSolana’s Advantages Over Ethereum\n\nCompared to Ethereum, Solana stands out with its high speed, low transaction fees, and scalability. It has achieved this by building scalability into its Layer 1, unlike Bitcoin and Ethereum, which rely on Layer 2 solutions. Additionally, Solana utilizes a Proof-of-Stake (PoS) consensus mechanism, offering greater scalability and energy efficiency compared to Bitcoin’s energy-intensive Proof-of-Work (PoW) mechanism.\n\nKey Innovations Enhancing Solana’s Performance\n\nSolana has introduced key design innovations that enhance its performance. First, the Proof-of-History (PoH) protocol establishes a chronological timeline for transactions, reducing transaction overhead and increasing network throughput. Tower Byzantine Fault Tolerance (BFT) reduces network latency and enhances speed and efficiency. Finally, the Turbine protocol implements data sharding, increasing the network’s capacity to handle large traffic volumes.\n\nChallenges and Concerns\n\nDespite its performance advantages, Solana has faced security concerns and network outages due to excessive transactions. To address these issues, Solana has partnered with Jump Crypto to build a new validator client, aiming to increase the network’s throughput capacity. The successful mitigation of these issues will be crucial for Solana’s long-term success.\n\nThe Quest for Mass Adoption\n\nTo challenge Ethereum and achieve mass adoption, Solana needs to maintain scalability and infrastructure as the user base and number of transactions increase. Interoperability with other blockchains through technologies like the Wormhole bridge will attract users and developers. Additionally, fostering a strong developer community to build diverse dApps will be essential for Solana’s growth.\n\nThe Investor’s Perspective\n\nOne anonymous crypto investor believes Solana still has the potential to challenge Ethereum. The investor questions whether Ethereum’s 40x larger market cap truly reflects its superiority and suggests that Solana could become a strong competitor if it continues to innovate, provide better scalability, lower costs, and attract more dApps.\n\nConclusion\n\nSolana has emerged as a serious competitor to Ethereum, offering high speed, low transaction fees, and scalability. While challenges remain, addressing security concerns, maintaining scalability, fostering interoperability, and building a vibrant developer community will be crucial for Solana’s long-term success. With its promising position in the blockchain industry, Solana has the potential to become a leading Layer 1 blockchain and challenge Ethereum’s dominance.\n\nThis article is provided for informational purposes only and is not intended as investment advice. The content does not constitute a recommendation to buy, sell, or hold any securities or financial instruments. Readers should conduct their own research and consult with financial advisors before making investment decisions. The information presented may not be current and could become outdated."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vZmluYm9sZC5jb20vZXRoZXJldW0taXMtZ2FpbmluZy1pbnZlc3RvcnMtY29uZmlkZW5jZS1hcy1nby10by1hc3NldC1mb3ItcGFzc2l2ZS1pbmNvbWUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Ethereum is gaining investors' confidence as go-to asset for passive income - Finbold - Finance in Bold",
        "content": "After the Shanghai upgrade enabled staked Ethereum (ETH) withdrawals, more people are choosing to lock up their coins in beacon deposit contracts, demonstrated by the fact that since the update, the amount of staked Ethereum has increased rapidly and set a new record.\n\nSpecifically, the amount of Ethereum staked has reached a new all-time high (ATH) as it surpassed 25.8 million ETH, currently worth over $48 billion, according to the recent data shared by the blockchain and cryptocurrency industry analytics platform CryptoRank in a tweet on June 29.\n\nEthereum deposit contract value. Source: CryptoRank\n\nNotably, the Ethereum deposit contract balance had crossed the value of $40 billion in late May, demonstrating a sharp move upward since the introduction of the critical feature that was not present during Ethereum’s transition from the proof-of-work (PoW) to the proof-of-stake (PoS) consensus mechanism after the Merge upgrade.\n\nEthereum price analysis\n\nMeanwhile, Ethereum was at press time changing hands at the price of $1,885.63. This represents an increase of 2.08% in the last 24 hours, a 0.24% gain across the previous seven days, and an advance of 0.80% on its monthly chart, as per the latest information retrieved on June 30.\n\nEthereum 24-hour price chart. Source: Finbold\n\nRecently, the richest Ethereum non-exchange addresses have been growing their holdings while the top exchange addresses marked record lows, near genesis levels, illustrating fears of further lawsuits against crypto exchanges, as Finbold reported on June 27.\n\nIndeed, after the United States Securities and Exchange Commission (SEC) sued crypto trading platforms Coinbase and Binance, fears seem to have caused an increase in the migration of digital assets off them, including the flagship decentralized finance (DeFi) asset, Bitcoin (BTC).\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vZXRoZXJldW0tbmFtZS1zZXJ2aWNlLWVucy1leHBhbmRzLXRvLWxheWVyLTItZWNvc3lzdGVtLWVuaGFuY2luZy1zY2FsYWJpbGl0eS1hbmQtYWNjZXNzaWJpbGl0eS_SAYcBaHR0cHM6Ly93d3cuY3J5cHRvLW5ld3MtZmxhc2guY29tL2V0aGVyZXVtLW5hbWUtc2VydmljZS1lbnMtZXhwYW5kcy10by1sYXllci0yLWVjb3N5c3RlbS1lbmhhbmNpbmctc2NhbGFiaWxpdHktYW5kLWFjY2Vzc2liaWxpdHkvP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Name Service (ENS) Expands to Layer 2 Ecosystem, Enhancing Scalability and Accessibility - Crypto News Flash",
        "content": "Ethereum naming system developers plan to utilize off-chain resolvers.\n\nENS achieved an impressive milestone of over 2.2 million registered domain names.\n\nDuring a community call on Thursday, ENS Labs, the Ethereum Name Service developer (ENS), announced its plans to integrate Layer 2 interoperability with ENS domains. This decentralized domain name system, built on the Ethereum blockchain, aims to enhance its functionality by enabling seamless communication between Layer 2 solutions and ENS domains.\n\nThe team emphasized the significance of Layer 2 interoperability as a vital upcoming enhancement. Layer 2 solutions, such as Arbitrum and Optimism, improve scalability and reduce costs by facilitating off-chain transaction processing separate from the Layer 1 Ethereum blockchain.\n\nRecognizing the importance of accessibility, the team aims to enable the interaction between Layer 2 solutions and ENS domains. This initiative seeks to broaden the user base by making domain name registrations and transactions more accessible to a wider audience.\n\nENS’s Plans for Layer 2 Interoperability\n\nAs Ethereum gained popularity, the surge in gas prices prompted market participants to seek more economical alternatives. Among these alternatives is the Ethereum Name Service (ENS), which had previously expressed its plans to implement Layer 2 interoperability.\n\nThis has been in the works for some time and involves the incorporation of ENSIP-10 for Wildcard Resolution and EIP-3668 for CCIP Read, enabling secure off-chain data retrieval. According to the developers, enabling the interaction between current solutions and ENS domains would enhance accessibility regarding domain name registrations and transactions for a broader range of users.\n\nLooking ahead, the Ethereum naming system developers plan to utilize off-chain resolvers by implementing an ENS off-chain registrar contract and partnerships with various service providers. These providers include cb.id, a project operated by Coinbase, Lens Protocol on the Polygon network and OptiNames on Optimism, among others. By leveraging these resources, the developers aim to facilitate seamless integration and expand the reach of ENS domains.\n\nGasless Import: ENS Roadmap Feature to Lower Barriers and Enhance Web Accessibility\n\nThe ENS team announced the close collaboration between ENS Labs and web-integrated domain name TLDs such as .art and .box. This collaboration aims to establish seamless integration, allowing users to register browser-supported names through the ENS platform. Additionally, it marks a significant milestone as DNS names can be traded as NFTs on the Ethereum blockchain for the first time this year.\n\nDuring the community call, the team discussed a new feature added to the roadmap. This feature entails the option to import DNS, the web naming protocol, into ENS without incurring any transaction costs, making it a “gasless” process. Additionally, this upcoming feature, scheduled for release in the third quarter of the year, has the potential to enhance web accessibility within the ENS ecosystem and reduce barriers for traditional internet users, as highlighted by the team.\n\nEthereum Name Service Domain Registrations\n\nUndeterred by the tumultuous state of the digital asset market in the previous year, ENS achieved an impressive milestone of over 2.2 million registered domain names. Furthermore, this number has consistently increased, reaching a current total of 2.73 million spread across nearly 700,000 unique addresses. To further enhance accessibility and convenience, ENS introduced a new fiat on-ramp for domain registrations in April.\n\nThis innovative feature, facilitated through the Web3 fiat payment gateway MoonPay, allowed Web3 users to register decentralized .eth domains seamlessly. Additionally, this integration enabled users to utilize popular fiat payment options like Apple Pay, Google Pay, and debit and credit cards, expanding the range of choices available for domain registration.\n\nThis article is provided for informational purposes only and is not intended as investment advice. The content does not constitute a recommendation to buy, sell, or hold any securities or financial instruments. Readers should conduct their own research and consult with financial advisors before making investment decisions. The information presented may not be current and could become outdated."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmJpdGNvaW5zZW5zdXMuY29tL2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tZGFpbHktMzAtanVuZS1ldGgtYnVsbGlzaC1wcmVkaWN0aW9uLXBsYXlpbmctb3V0LWV4YWN0bHktd2hhdC1ub3cv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction Daily (30-June): ETH Bullish Prediction Playing Out Exactly! What Now? - Bitcoinsensus",
        "content": "Ethereum price prediction from a previous analysis Watch This ETH Bullish Target For This Key Pattern!\n\nIn our previous Ethereum analysis Watch This ETH Bullish Target For This Key Pattern! we identified the key Converging Triangle Pattern forming in the 4-hour timeframe and warned our readers of a potential price rally in the coming days.\n\nWell, that bullish prediction is playing out exactly, and in this ETH analysis, we will be updating you on what the ETH price is doing right now and what is possible in the coming days.\n\nTo trade ETH with leverage, sign-up to Bybit right now! Bybit’s BIGGEST Bonus Campaign is now live! You can get up to a $30,000 Bonus when you fund your Bybit account with our Bybit link\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nETH $1,933 Bullish Target Smashed! What Now?\n\nETH Bullish Prediction Playing Out Exactly! What Now? Watch this price prediction in the 4-hour timeframe\n\nThe Ethereum price has smashed through our $1,933 bullish target in the 4-hour timeframe and the price is still currently pushing up higher! This shows that the bulls are still in control of this market for now.\n\nHowever, the question most traders are asking is “How long will this current rally last and what should we expect next?”\n\nWell in this ETH analysis, we will be identifying the Bearish Divergence that is right now developing in the 4-hour timeframe. This bearish divergence is a clear warning to our readers to be cautious as this might be a sign that ETH does not have a long way to go to the upside.\n\nWhat Does A Bearish Divergence Mean?\n\nThe image above is what a completed bearish divergence should look like!\n\nBearish Divergence shows weakness in price. The bearish divergence is caused when the price is moving higher while the MACD indicator keeps on moving lower. Once this happens, it signifies that the asset might be weak and ready to sell off.\n\nRight now, the Ethereum price is rallying higher, but the MACD indicator is showing a clear sign of a downtrend.\n\nThis tells us that “while the price might be moving up, bullish volume is dying down” and if this continues, sooner or later the ETH price will reverse.\n\nFinal Verdict!\n\nThe ETH price has broken out of the 4-hour timeframe converging Triangle pattern and is pushing higher! So for now we remain bullish on the Altcoin price.\n\nHowever, we are beginning to see signs of weakness creep into the price chart as Ethereum is diverging from the MACD indicator. This is a sign of growing weakness in the bullish rally and we will stay cautious as we continue to watch the ETH price action develop.\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nHow to Trade Bitcoin (BTC)?\n\nTo understand the basics of Bitcoin trading, you can read our How To Trade Bitcoin Guide. It can prove helpful for traders who are just getting started with Bitcoin trading. You can also check out our list of top Bitcoin Exchanges To Trade With.\n\nPrimeXBT Covesting: Trade Hassel Free\n\nSign-up on PrimeXBT today to trade Bitcoin hassle-free. You can copy experienced traders and access hundreds of different strategies on the platform! Don’t forget to claim your 25% bonus by using the promo code “bitcoinsensus50” when you sign-up with our link PrimeXBT Covesting"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vd3d3LmNyeXB0b3BvbGl0YW4uY29tL2p1bmUtbmZ0LW1hcmtldC1zaGFrZS11cC1ldGhlcmV1bS1iaXRjb2luL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Jul 2023 07:00:00 GMT",
        "title": "June NFT market shake-up: Ethereum reigns, Bitcoin falters | - Cryptopolitan",
        "content": "There’s a surprising shift in the ether winds of the non-fungible token (NFT) realm as Ethereum solidifies its dominance while Bitcoin’s momentum ebbs. In this article, we take an illuminating journey into the depths of the NFT market landscape as it stood in June 2023.\n\nEthereum ascends as Bitcoin descends\n\nEthereum-based NFTs made a mark in June, with total sales eclipsing the $452 million milestone, which equates to over 63% of the entire NFT market’s turnover.\n\nThis represented a nearly 8% growth from May’s sales, reinforcing Ethereum’s stronghold over the market, especially as Bitcoin-based NFT transactions fell.\n\nThe king of cryptocurrency saw a staggering fall of 42.36% from May to June, closing the month with a total of $110.3 million, a significant decrease from the previous month.\n\nSolana, however, held a different narrative. It played the part of an unexpected dark horse, showcasing an impressive surge in its NFT sales. Solana’s NFT transactions skyrocketed by a staggering 65%, reaching an astounding $70.42 million.\n\nThis surprising growth story demonstrated the potential of Solana’s infrastructure for NFT enthusiasts and investors.\n\nMythos and Polygon trail behind amid the shift\n\nFurther down the ranks, Mythos and Polygon, despite their emerging platforms, unfortunately experienced a dip in their NFT transactions. Mythos saw a slump of nearly 20%, recording $28,322,124 in NFT sales.\n\nPolygon fared worse, suffering a sharp 45.91% drop to $27,846,781. This shows that not all networks could weather the market fluctuations and compete effectively against the might of Ethereum or ride on the rapid momentum of Solana.\n\nJune marked the meteoric rise of an unsung hero – Uncategorized Ordinals. The collection outpaced other contenders in the NFT market, boasting sales of a whopping $52.91 million, which marked a modest but crucial 1.44% increase from May.\n\nTrailing behind it was the Bored Ape Yacht Club (BAYC), which posted sales of $49.76 million, a robust 28.20% higher than its performance in May. Other noteworthy NFT collections that marked their presence were Azuki, Azuki Elemental, and SMB Barrel Raffle.\n\nNoteworthy NFT sales: The exception to the rule\n\nDespite Bitcoin’s struggle, it had a prominent presence among the highest-priced NFT sales for June. In a fascinating twist, four of the top five most valuable NFT sales were based on Bitcoin, proving that Bitcoin’s appeal still holds sway among some sections of the NFT market.\n\nThe sole exception was the Ethereum-based NFT, Fidenza #545.\n\nJune brought about a shift in the NFT market that underlines the dynamic nature of this digital assets landscape. The surge of Ethereum and the rise of Solana, alongside Bitcoin’s falter, point to a market that is constantly evolving.\n\nThese shifts invite market participants to remain vigilant and adapt to the changes. It will be intriguing to watch how these patterns evolve as we venture further into the world of NFTs."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL2luc2lkZWJpdGNvaW5zLmNvbS9uZXdzL2dteC1jcnlwdG8td2hhbGUtaW4tZGFuZ2VyLW9mLWh1Z2UtbGlxdWlkYXRpb24taWYtZXRoZXJldW0taGl0cy1wcmljZS1vZi0xOTUwLXdoYXQtY29pbnMtYXJlLXdoYWxlcy1idXlpbmfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Jul 2023 07:00:00 GMT",
        "title": "GMX Crypto Whale In Danger Of Huge Liquidation if Ethereum Hits Price of $1,950 - What Coins Are Whales Buying - Inside Bitcoins",
        "content": "Don’t invest unless prepared to lose all the money you invest. This is a high-risk investment, you shouldn’t expect to be protected if something goes wrong.\n\nJoin Our Telegram channel to stay up to date on breaking news coverage\n\nA GMX crypto whale that has been on an ETH shorting spree might be facing huge liquidation soon.\n\nPnL data shows that they are in danger of losing 80% of their funds if the Ethereum price touches the $1950 mark.\n\nPopular crypto Twitter influencer Taiki Maeda made his community aware of this situation via his tweet.\n\nLet's track this $ETH shorter on $GMX together On-chain positions create a social element to taking/monitoring positions, versus people just posting PnL after winning CEX trades. Never been a big fan of \"copy-trade\" platforms but might gain more traction If on-chain perps level… https://t.co/5XNds8jOBx — Taiki Maeda (@TaikiMaeda2) June 23, 2023\n\nMany crypto influencers on Twitter are asking, “why so many shorts” after seeing a chart showing that the GMX whale has shorted ETH 24 times between June 18th to June 22nd alone.\n\nGMX Trader Can’t Stop Shorting\n\nThe GMX whale has implemented this strategy of shorting ETH in a way that no one can explain. Many are saying that he is implementing Delta Hedge. And others are countering that argument by saying that it would not be ideal to use GMX to implement this strategy.\n\nWhat is Delta Hedge? Delta Hedge is an options trading strategy that a trader implements to reduce or hedge the risk related to the price movements of an underlying asset.\n\nThe yellow circles represent the shorting zones\n\nOne user has also stated that it is pretty “insane” that the whale has conditioned their orders to add all the way to their liquidity.\n\nAs you can see from this data, the liquidity price has been set at $1953. That is the reason many investors are wondering why the whale would take that position.\n\nAnd some investors are being cheeky about it, saying that GMX bears are adding a margin to their already low position.\n\nClick here to check to monitor the whale’s action by yourself.\n\nGMX Price Analysis\n\nWhen it comes to GMX, the price of the asset has been stable above the $53 range since last month. The chart shows that mid-June was the only time that the token dropped in the red zones, crashing past the $45 mark.\n\nBut a quick rebound has allowed it to move past the $52.98 support. The current candle shows red signs. If GMX falls below its current support, it will try to stay above $50.\n\nCurrently, the token’s RSI is around 55 – keeping it a bit in the oversold zone. But GMX’s current stable trend doesn’t make it seem like it will drop any time soon.\n\nMaybe They Know Something We Don’t – Twitter\n\nThe whale’s recent actions have started a slew of conspiracy theories, with many saying that the trader knows something that we don’t. While others say that the trader might know too much.\n\nmaybe he knows too much — zkspy🟠 (@Krypt0psy) June 25, 2023\n\nGMX is performing similarly to Ethereum (in a stable state). Ethereum’s current price chart on CoinMarketCap doesn’t show any volatility other than a little morning dip. At press time, it is trading around the $1916 mark.\n\nYou can check out our yearly price predictions about Ethereum in our Ethereum price forecast guide.\n\nWhich Other Cryptos Whales Are Buying?\n\nWhile we have highlighted shorter crypto in our article, they are not the only ones making rounds in the market. There are other tokens that users are interested in. Most of them are available as presales.\n\nPresale tokens are favored by those who don’t want to deal with the current volatility of the crypto market. While the recent trends are showing some signs of stability for the tokens we have mentioned, all it would take is one negative news to spread, and the bears might take over.\n\nIn such situations, presales allow users to make gains without being subject to the market’s erratic behavior. This is why some of the best presales that whales are interested in include the following:\n\nWall Street Memes (WSM)\n\nWall Street Memes is a community-centric asset that leverages memes to grow up in value. Inspired by the Reddit Group Wall Street Bets, Wall Street Memes aims to transform memecoins – a seemingly “useless” asset into a wealth generator.\n\nThe token’s appeal has grown since the launch of its presale. And it has already raised more than $11.7 million at press time. The community backing this token has a million followers across multiple social media platforms, and even Elon Musk has interacted with the group.\n\nThese factors can fuel it to make it the next 10x crypto of this year.\n\nThug Life (THUG)\n\nAnother token to have been inspired by the memecoin genre and has gained a lot of attention in a short time is Thug Life.\n\nThug Life is a “baller’s” memecoin inspired by the “Thug Life” mean, representing stoic individuals who got a perfect comeback for everything. That “grind” mentality also permeates across Thug Life’s official website, whose content uses “street talk” to communicate what the project is about.\n\nThug Life has been able to use this uniqueness to raise more than $180k within three days.\n\nIt is one of the top four crypto assets recommended by our resident crypto expert – Jacob Crypto Bury.\n\nConclusion\n\nWhile GMX’s whale recent move is heading them toward liquidation, there is a bigger picture that many retail investors aren’t seeing. This is why investors must look for alternative investment opportunities, such as Wall Street Memes and Thug Life.\n\nBoth are highly popular memecoin presales that have quickly gained the market’s attention. And if they follow the same trends as other ICOs in the past, early movers might make a 10x return.\n\nRelated\n\nNew Crypto Mining Platform - Bitcoin Minetrix Rating Audited By Coinsult\n\nDecentralized, Secure Cloud Mining\n\nEarn Free Bitcoin Daily\n\nNative Token On Presale Now - BTCMTX\n\nStaking Rewards - Over 50% APY Learn More"
    }
]