[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXZzLWV0aGVyZXVtLWNvbW11bml0eS1zcGxpdC1iZXR3ZWVuLWNhcHBlZC1zdXBwbHktYW5kLWRlZmxhdGlvbmFyeS1tb2RlbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin vs Ethereum: Community split between capped supply and deflationary model - Cointelegraph",
        "content": "Bitcoin (BTC) and Ether (ETH), the top two cryptocurrencies by market capitalization, have always been pitted against each other. With the start of the new year, the first debate has surfaced comparing BTC’s capped supply of 21 million to ETH’s deflationary supply, with disagreement over which of the two qualifies as sound money.\n\nAn Ethereum-focused Twitter user called ‘ultra sound money’ compared the supply issuance of both cryptocurrencies and suggested that “if capped-supply BTC is sound then decreasing-supply ETH is ultrasound.”\n\nif capped-supply BTC is sound\n\n\n\ndecreasing-supply ETH is ultra sound pic.twitter.com/L2tsFzPQ7q — ultra sound money (@ultrasoundmoney) January 15, 2023\n\nThe comparison between the two didn’t sit well with BTC proponents, who quickly pointed out that soundness comes from the credibility of the monetary policy and not an ever-changing one. Dan Held, a famous Bitcoin proponent, pointed out the flaw in the argument and noted that a constantly changing one has less credibility. He said:\n\n“Time builds trust with humans, it’s not all about code. According to your logic, if we spun up another crypto with more deflation, that would be “sounder.”\n\nAnother Bitcoin proponent questioned the credibility of Ethereum’s monetary policy, reminding that the same monetary policy has “changed a least 11 times in its seven years of existence.” On the other hand, Bitcoin has not changed its monetary policy once.\n\nEther's historical projected issuance rate. Source: ethhub.io\n\nEther became deflationary in August 2021 with the introduction of Ethereum improvement proposal-1559 (EIP-1559). The upgrade introduced a burn mechanism that automatically burns a portion of the transaction fee, decreasing the overall circulating supply of ETH.\n\nIn response to Alex Gladstein’s argument that “admins” can arbitrarily change Ethereum’s monetary policy, independent Ethereum educator Anthony Sassano claimed that every change on the Ethereum network had been approved by the thousands of node operators run by community members.\n\nThe term \"admins\" implies that there is a small group with superuser powers that can change things on Ethereum which is completely false and has been proven false many times.\n\n\n\nYou can believe what you want about the sound money vs ultra sound money debate. — sassal.eth (@sassal0x) January 16, 2023\n\nLeo Glisic, the founder of the Maitri network, said that ETH had become sound money now, but BTC won’t hit its cap until the year 2140.\n\nBitcoin has faced similar monetary changes and tweaking of the original code in the past. The most notable one came during 2017 when there was a growing demand for increasing the Bitcoin block size to accommodate more transactions per block and make it more scalable.\n\nRelated: Bitcoin steps out of 'fear' for the first time in nine months\n\nThe majority of the Bitcoin community remained against making any changes to the original code of Satoshi Nakamoto. As a result, the Bitcoin network experienced a hard fork in 2017, leading to the formation of Bitcoin Cash (BCH), a cryptocurrency with a block size of 8 MB against BTC’s 1 MB. However, today, BCH has had very little on-chain development and is currently trading at a 97% price drop from its all-time high."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1vbmNlLWFnYWluLWhhcy1iZWNvbWUtZGVmbGF0aW9uYXJ5LWhlcmVzLWhvdy_SAVBodHRwczovL2FtYmNyeXB0by5jb20vZXRoZXJldW0tb25jZS1hZ2Fpbi1oYXMtYmVjb21lLWRlZmxhdGlvbmFyeS1oZXJlcy1ob3cvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "Ethereum once again has become deflationary, here’s how - AMBCrypto News",
        "content": "ETH’s annualized inflation has dropped to 0.00002%.\n\nThe value of transaction settlements on the Ethereum network is significantly higher than that on the Bitcoin network.\n\nFor the first time since December 2022, Ethereum (ETH) issuance has returned to a deflationary state, data from ultra sound money revealed. The altcoin’s supply growth at the time of writing stood at -34.67 ETH, as its annualized inflation rate dropped to 0.00002%.\n\nWhenever ETH turns deflationary, it means that the rate of new ETH being added to the total supply is decreasing. In other words, since the year started, the leading smart contract blockchain has burned more ETH tokens than it has minted.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nPer data from Etherscan, the count of daily ETH burned since 1 January has climbed by 32%.\n\nThe year so far has been kind to the leading alt\n\nFurther to turning into a deflationary coin, ETH’s value has also risen by 31% since the commencement of the 2023 trading year. In the last week alone, the alt’s value rose by over 20%, data from CoinMarketCap showed.\n\nThe sharp surge in ETH’s value mirrors the growth in the general cryptocurrency market since the year started following a tumultuous close to the 2022 trading year. According to data from CoinGecko, global cryptocurrency market capitalization has risen by 21% in the past 16 days.\n\nIn addition, since the year began, the daily transaction settlements on Ethereum have surpassed $21 billion, significantly ahead of Bitcoin’s $2.6 billion daily transaction settlements.\n\nEthereum settling over $21b a day in value while Bitcoin struggles to settle over $2.6b in value… You tell me where the future lies pic.twitter.com/Ez0kcinM1W — Crypto Maxi (@cryptoMaxi420) January 15, 2023\n\nFurthermore, CryptoQuant analyst CryptoOnchain found that there has been a resurgence of new ETH smart contracts being created. According to the CryptoOnchain, following a decline between August 2021 and October 2022, the number of new smart contracts on the Ethereum network has risen in the last four months.\n\nA high number of new smart contracts on Ethereum can be seen as a sign of strong developer activity and interest in the platform, indicating that the Ethereum ecosystem is healthy and growing.\n\nThis is a positive sign for the future of Ethereum as it suggests that more and more developers are building on the Ethereum blockchain and that the network is becoming more robust and useful.\n\nRead Ethereum’s [ETH] Price Prediction 2023-24\n\nAhead of the Shanghai Upgrade\n\nWith the Shanghai Upgrade estimated to occur before the close of Q1 2023, a look at the Ethereum 2.0 contract revealed increased on-chain activity. According to Glassnode, the total number of Ether coins sitting in the Ethereum 2.0 deposit contract stood at 513,414 ETH. This has gone up by 1.3% since the year began.\n\nLikewise, the total number of validators on the proof-of-stake network stood at 501,666 at press time, having gone up by 1.2% in the last 16 days."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vbGVhcm4uYnliaXQuY29tL3N0cmF0ZWdpZXMvZXRoZXJldW0tbWVyZ2UtcHJpY2UtcHJlZGljdGlvbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction: How To Trade ETH Post-Merge - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMS8xNi9zaG9ydC1zZWxsZXJzLWdldC1oaXQtd2l0aC1vdmVyLTYwMDAwMDAwMC1pbi1saXF1aWRhdGlvbnMtYXMtYml0Y29pbi1idGMtZXRoZXJldW0tZXRoLWFuZC1hbHRjb2lucy1wb3Av0gGMAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzAxLzE2L3Nob3J0LXNlbGxlcnMtZ2V0LWhpdC13aXRoLW92ZXItNjAwMDAwMDAwLWluLWxpcXVpZGF0aW9ucy1hcy1iaXRjb2luLWJ0Yy1ldGhlcmV1bS1ldGgtYW5kLWFsdGNvaW5zLXBvcC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "$600,000,000 in Liquidations Hit Short Sellers As Bitcoin (BTC), Ethereum (ETH) and Altcoins Pop - The Daily Hodl",
        "content": "Crypto short sellers are drowning in a deluge of liquidations as Bitcoin (BTC), Ethereum (ETH) and other altcoins rally.\n\nAccording to liquidation data from CoinGlass, the crypto markets have experienced more than $180 million in liquidations in the last 24 hours alone.\n\nSince January 13th, short sellers have been hit with over $600 million in liquidations, according to the crypto data platform.\n\nIn the last 24 hours, Bitcoin liquidations have hit $34.71 million. The leading crypto by market cap is trading for $21,009 at time of writing, up 23% over the last seven days.\n\nOver the same period, Ethereum liquidations have reached $47.59 million. The leading smart contract platform by market cap is trading for $1,553 at time of writing, up 21% in the last week.\n\nDespite recent network struggles, ETH-competitor Solana (SOL) liquidations have reached $5.87 million over the last day. The 11th-largest crypto by market cap is trading for $23.10 at time of writing, up 61% over the last week.\n\nLiquidations for the 40th-largest crypto by market cap, Aptos (APT), have also reached over $5 million over the last 24 hours, hitting $5.36 million at time of writing. Currently, APT is trading for $8.14, up 112% over the last seven days.\n\nFinally, meme token Dogecoin (DOGE) liquidations have reached $3.29 million over the last day, according to CoinGlass. DOGE is trading for $0.0836 at time of writing, up 14% over the last week.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney\n\nFeatured Image: Shutterstock/PurpleRender/VECTORY_NT"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZGVjcnlwdC5jby8xMTkzMTUvbGF6YXJ1cy1ncm91cC1tb3Zlcy00MTAwMC1ldGhlcmV1bS1uYWJiZWQtaGFybW9ueS1icmlkZ2UtaGFja9IBXWh0dHBzOi8vZGVjcnlwdC5jby8xMTkzMTUvbGF6YXJ1cy1ncm91cC1tb3Zlcy00MTAwMC1ldGhlcmV1bS1uYWJiZWQtaGFybW9ueS1icmlkZ2UtaGFjaz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "Lazarus Group Moves 41,000 Ethereum Nabbed From Harmony Bridge Hack - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nNorth Korea-linked cybercrime syndicate Lazarus Group has reportedly transferred $63.4 million in Ethereum from 2022’s mammoth Harmony bridge hack, depositing it on Binance, Huobi, and OKX.\n\nAccording to on-chain sleuth ZachXBT, the group used the privacy and anonymity system Railgun before consolidating the funds and depositing them on the exchanges.\n\nRailgun is an Ethereum-based smart contract system that lets users obscure the nature of their crypto transactions, removing identifying information.\n\nAD\n\nAD\n\nThe sleuth claimed that the transfers, made on January 13, involved 350,000 separate wallet addresses.\n\n1/2 North Korea’s Lazarus Group had a very busy weekend moving $63.5m (~41000 ETH) from the Harmony bridge hack through Railgun before consolidating funds and depositing on three different exchanges. pic.twitter.com/huDumaJeSh — ZachXBT (@zachxbt) January 15, 2023\n\nBinance CEO Changpeng “CZ” Zhao said that his team, in collaboration with Huobi, had detected the funds' movements, which they then froze and recovered.\n\nThe Binance chief claimed that the total recovery came to 124 Bitcoin, suggesting that the attackers had converted funds from ETH to BTC.\n\nThough Lazarus reportedly originally made the illegitimate transfers in the form ETH, these tokens could have been later swapped for BTC at many points during the mixing and consolidating process.\n\nAD\n\nAD\n\nWe detected Harmony One hacker fund movement. They previously tried to launder through Binance and we froze his accounts. This time he used Huobi. We assisted Huobi team to freeze his accounts. Together, 124 BTC have been recovered. CeFi helping to keep DeFi #SAFU! 🙏 — CZ 🔶 Binance (@cz_binance) January 16, 2023\n\nHarmony hack and Lazarus Group\n\nIn June 2022, the Harmony attack saw hackers run off with $100 million after compromising the project’s token bridge. A blockchain bridge that connects different, incompatible blockchains together.\n\nMany, including blockchain analytics company Elliptic, attributed the attack to the North Korean state-sponsored hacking group Lazarus.\n\nThe group was said to have used the now-sanctioned cryptocurrency mixer Tornado Cash, a tool not dissimilar to Railgun.\n\nIt’s unknown, what if any, steps have been taken by OKX, in response to the alleged criminal transfers.\n\nCZ explained that Binance’s security teams are to an extent collaborative and talk to other exchanges, but added that “not all” other exchanges are collaborative.\n\nOur security teams talk to each other, not all exchanges are collaborative (some have a wrong competitive mindset), but many are. I am actually not in those chats myself. Don't know the details. — CZ 🔶 Binance (@cz_binance) January 16, 2023\n\nThe CEO added that he is not in those security chats himself and as a result, doesn’t “know the details.”\n\nAD\n\nAD\n\nDecrypt has contacted Binance, Huobi, and OKX about the transfers and their responses.\n\nDespite the size of Lazarus’s attack on Harmony, the hack is just a small portion of the overall number of funds the cybercrime syndicate has been implicated in stealing.\n\nLazarus was also implicated, to give just an example, in the March 2022 attack on the Ronin Network, which was estimated at being worth about $622 million. The group was also tied to a scheme that impersonated venture capital companies to spread malware to various crypto-related firms."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vaGFja2Vybm9vbi5jb20vaG93LWktYnVpbHQtYW4tYW5vbnltb3VzLXZvdGluZy1zeXN0ZW0tb24tdGhlLWV0aGVyZXVtLWJsb2NrY2hhaW4tdXNpbmctemVyby1rbm93bGVkZ2UtcHJvb2bSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "How I Built an Anonymous Voting System on the Ethereum Blockchain Using Zero-Knowledge Proof - hackernoon.com",
        "content": "1,003 reads\n\nHow I Built an Anonymous Voting System on the Ethereum Blockchain Using Zero-Knowledge Proof"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8venljcnlwdG8uY29tL2NhdGhpZS13b29kLXNlZXMtYml0Y29pbi1hbmQtZXRoZXJldW0tY29taW5nLW91dC1vZi10aGUtY3VycmVudC1tYXJrZXQtY3Jpc2lzLXN0cm9uZ2VyL9IBcGh0dHBzOi8venljcnlwdG8uY29tL2NhdGhpZS13b29kLXNlZXMtYml0Y29pbi1hbmQtZXRoZXJldW0tY29taW5nLW91dC1vZi10aGUtY3VycmVudC1tYXJrZXQtY3Jpc2lzLXN0cm9uZ2VyLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 15 Jan 2023 08:00:00 GMT",
        "title": "Cathie Wood Sees Bitcoin and Ethereum Coming Out of the Current Market Crisis Stronger - ZyCrypto",
        "content": "Advertisement\n\nCathie Wood, CEO of US-based investment management firm Ark Invest sees public blockchains like Bitcoin and Ethereum coming out ahead after the ongoing market crisis subsides.\n\nIn a letter dubbed “What The Market Overlooked in 2022”, sent to clients on Jan 12, Wood highlighted the breakthrough technologies that are already transforming the world, praising blockchain and digital wallets.\n\nThe crypto sector has faced various headwinds since Terra collapsed in mid-2021. More than six leading crypto firms have folded since then, with some like Voyager and BlockFi filing for chapter 11 bankruptcy. The collapse of FTX two months ago dealt a further blow to the sector, destroying billions of US dollars worth of user assets and threatening the future of more crypto firms.\n\nThis, however, did not interfere with the substratum of blockchain technology which continues to operate as intended, according to Wood.\n\n“Despite the recent collapse of crypto exchange FTX, underlying public blockchains like Bitcoin and Ethereum have not skipped a beat in processing transactions, highlighting that their transparent, decentralized, and auditable ledgers could be a solution to the fraud and mismanagement associated with centralized, opaque institutions,” she wrote.\n\nAdvertisement\n\nThe pundit also fronted Digital wallets as the next big thing, noting that they were replacing cash and credit cards. A recent report by California-based market research and consulting firm Grand View Research estimated the global crypto market wallet market to grow to about $48.27 billion in 2030 from 2022 estimates of about $8.42 billion. Crypto wallets help users keep their crypto assets safe and secure by storing their private keys. They also allow users to send, receive and spend cryptocurrencies like Ethereum and Bitcoin. Digital wallets overtook cash as the top transaction method for offline commerce in 2020 and accounted for ~50% of global online commerce volume in 2021.\n\nWood Buys More Crypto-Related Shares\n\nFollowing the FTX collapse, the share of trading volume on decentralized exchanges, which allow investors to trade without a central intermediary spiked 37%. Centralized crypto exchanges such as Binance and Crypto.com also saw a drastic increase in outflows as investors took flight in fear of an FTX-like incident.\n\nWood continued to express hope in the crypto sector, scooping more Coinbase shares. According to her, unlike other exchanges, “the fallout from Terra/Luna’s and FTX’s collapses propelled Coinbase’s share of fiat-based exchange volume (excluding Binance International) by 18 percentage points, from 22% in June to 40% in December.”\n\nOn Thursday, Ark Invest purchased 74,792 shares of Coinbase (COIN) for around $3.28 million, bringing its total holdings to 8.596 million shares valued at around $408.7 million based on Coinbase’s last closing price of $47.55 on Thursday. That stash now represents 2.92% of the firm’s entire portfolio allocation."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vdS50b2RheS94cnAtY29tbXVuaXR5LWhhcy1oYXRyZWQtZm9yLWFsbC10aGluZ3MtZXRoZXJldW0tY2hhcmxlcy1nYXNwYXJpbm8tY2xhaW1z0gFdaHR0cHM6Ly91LnRvZGF5L3hycC1jb21tdW5pdHktaGFzLWhhdHJlZC1mb3ItYWxsLXRoaW5ncy1ldGhlcmV1bS1jaGFybGVzLWdhc3Bhcmluby1jbGFpbXM_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "XRP Community Has Hatred for All Things Ethereum, Charles Gasparino Claims - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nFor an industry that is expected to be united against a common cause, there seems to be more division than anticipated. Media personality and correspondent with FOX Business Network Charles Gasparino has flagged the unhealthy rivalry, or what he tagged as \"hatred,\" that the members of the XRP community have for all things related to Ethereum (ETH).\n\nAdvertisement\n\nAccording to Gasparino, despite the fact that Ethereum holders are not shown much love by XRP holders, the majority of the people he knows who hold Ethereum notably want XRP to win its ongoing lawsuit with the United States Securities and Exchange Commission (SEC).\n\nThe SEC is charging blockchain payments firm Ripple Labs Inc for the sale of $1.3 billion in XRP as unregistered securities. The lawsuit from the regulator was brought on back in December 2020, and millions of dollars have been expended by the blockchain company to defend its stance that its sole use of XRP was as a payment utility.\n\nThe ongoing case has stirred a lot of enmity, and Gasparino believes XRP community members see those who are Ethereum supporters as their enemies, a claim Gasparino's position sharply disagrees with.\n\nCommunity's view\n\nAgainst the position of Charles Gasparino, many community members believed that it is indeed Ethereum maximalists that are constantly talking down to XRP. In one of the comments shared on Gasparino's post, a user with the handle BlackberryXRP shared a post from way back in December 2020, when Ethereum founder Vitalik Buterin called XRP a \"shitcoin.\"\n\nLooks like the Ripple/XRP team is sinking to new levels of strangeness. They're claiming that their shitcoin should not be called a security for *public policy reasons*, namely because Bitcoin and Ethereum are 'Chinese-controlled,' the post from Vitalik reads at the time, showing no iota of support from the most renowned figure in the Ethereum ecosystem.\n\nIrrespective of the divergent positions, Gasparino claims Ethereum holders understand what the victory for XRP would mean for the entire industry."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3JpYy1idXJ0b24tZ290LTEway1ldGgtZnJvbS1idXRlcmluLWluLTIwMTQtZm9yLWEtbW9udGgtb2Ytd29yay_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "Ric Burton received 10k ETH from Buterin for a month of work in 2014 - CryptoSlate",
        "content": "Web3 designer Ric Burton shared how Vitalik Buterin sent him 10,000 Ether (ETH) in 2016 as compensation for Buton’s one-month work in 2014 via a thread he posted on Twitter.\n\nMeeting the community\n\nBurton’s story starts in 2014, just after he got “kicked out of a profitable company” he co-founded. While listening to Bitcoin-related podcasts, Burton says he heard Buterin say, “I want to build a blockchain that I can run programs on.”\n\nWhile admitting being intrigued, Burton said he didn’t change his daily routine to pursue this “Ethereum thing.” However, after hearing about Ethereum two more times, Burton says, he finally decided to see Gavin Wood‘s speech.\n\nBurton wrote:\n\n“I went along to the gathering and watched Gavin talk about how Facebook’s control of WhatsApp, Instagram & all of the social web was antithetical to the principles upon which the Internet was founded. He talked about trying to shift the pendulum back towards decentralisation. I had absolutely not idea what he was talking about. But I liked the cut of his jib.”\n\nAfter the talk, Burton went up to Wood and asked if ETH needed any designers. Upon this, Wood invited Burton into the core ETH community. “I was hooked,” says Burton, and says he left the UK to fly to the Bay area to meet up with Buterin himself.\n\n“We met up, jumped on a train, and talked a bit about his plans. I could barely keep up.”\n\nBurton said. According to his thread, the only time Burton had with Buterin was the time they spent together on the train and the car drive to San Francisco the next day, where Buterin context-switched between “learning Mandarin on his phone, talking to engineers about protocol architecture, and engage deeply with Burton’s questions about user interfaces.”\n\nAfter that, Burton said he hadn’t seen Buterin for three years after that. However, Burton continued to stay engaged with the ETH community through Wood. According to the thread, Burton kept designing and adjusting according to Wood’s feedback. At the same time, however, Burton was running out of money. After a month, Burton said had to leave the community because he was “flat broke.”\n\nThe money comes back.\n\nBurton went about his business after leaving the ETH circle until he heard back from someone at the Ethereum Foundation two years later who wanted to pay him some ETH.\n\nHe writes:\n\n“I had no idea what that would involve, but I liked the sound of getting paid. I checked the price of Ether, it had skyrocketed to $1! That meant they were going to pay me ~$10,000—I was over the moon.”\n\nEven though Burton accepted immediately, the transfer never came. Since the price of ETH started to increase, Burton kept asking the foundation for the ETH, fearing they might change their minds about sending it.\n\nEventually, Burton says, “I hit a boiling point.” He sends Buterin a direct message on Skype, “begging for the Ether.” According to Burton, Buterin apologized for the delay and sent the funds immediately.\n\nBurton finalizes his story by saying:\n\n“This is the transaction that changed my life. I totally lost my mind. I had around $100,000 of liquidity from this wonderful community. I immediately sold a third of it to pay down debts. I had finally found: community liquidity.”\n\nMentioned in this article"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDEvMTYvc2hpYmEtaW51LWRldmVsb3BlcnMtcmV2ZWFsLWZpcnN0LWxvb2stb2YtbGF5ZXItMi1ibG9ja2NoYWluLXNoaWJhcml1bS_SAXRodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzAxLzE2L3NoaWJhLWludS1kZXZlbG9wZXJzLXJldmVhbC1maXJzdC1sb29rLW9mLWxheWVyLTItYmxvY2tjaGFpbi1zaGliYXJpdW0vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "Shiba Inu Developers Reveal First Look of Layer 2 Blockchain Shibarium - CoinDesk",
        "content": "In an introductory post on Sunday, Shiba Inu developers said Shibarium would have a focus on metaverse and gaming applications especially as the NFT sector is expected to heat up in the coming years, apart from Shibarium’s use as a cheap settlement for decentralized applications (dapps) built on the network."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiuQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9zdG9ja3MvbmV3cy9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMTYtamFudWFyeS0yMDIzL2FydGljbGVzaG93Lzk3MDIwODMxLmNtc9IBvQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9zdG9ja3MvbmV3cy9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMTYtamFudWFyeS0yMDIzL2FtcF9hcnRpY2xlc2hvdy85NzAyMDgzMS5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin above $21,000; crypto market cap nears $1 trillion - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nNew Delhi: The cryptocurrency market was trading in the green on Monday. Bitcoin (BTC) gained 2% to trade above $21,000, whereas Ethereum (ETH) rose nearly 3% to trade above the $1500 level.BTC volume in the last 24 hours stood at approximately $21.6 billion, which is a jump of 26.86% in the last 24 hours.\"Bitcoin reached a new high of $21,000, as investors are optimistic that it may have reached its lowest point and that inflation may have peaked. This marks the first time that Bitcoin has been above $20,000 in over two months. The cryptocurrency has also seen a 26.4% increase from its low of $16,496 on January 1. Ether, the coin associated with the Ethereum blockchain network, also saw a 5.91% increase,\" Edul Patel, CEO and Co-Founder of Mudrex said.Other top crypto tokens were also trading higher on Thursday. Shiba Inu rose 6.3%. Polygon, Dogecoin, Cardano and XRP were also trading with gains.\"The crypto market cap has crossed the $1 trillion mark, thanks to an over 20% jump in Bitcoin and Ether prices in just seven days. This is a strong sign that bulls are returning to the market with US central banks successfully bringing down the inflation and saving the economy from slipping into recession. The current market momentum is expected to continue if the macroeconomic factors remain favourable,\" Shivam Thakral, CEO of BuyUcoin said.The global cryptocurrency market cap was trading higher around $993.26 billion, increasing 1.99% in the last 24 hours.The total volume in DeFi is currently $4.84 billion, 10.05% of the total crypto market 24-hour volume. The volume of all stablecoins is now $42.53 billion, which is 88.35% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, hovered around $407.4 billion, with a dominance of about 40.98%, a decrease of 0.05% over the day, according to CoinMarketCap.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 10.25 hours, IST on January 16, 2023)Bitcoin $21,150 2.13%Ethereum $1,572 3.02%Tether $1 0.02%USD Coin $1 0.01%BNB $305 2.24%XRP $0.4024 3.37%Dogecoin 0.08674 2.22%Cardano $0.3598 3.89%Polygon $1.02 5.57%Polkadot $5.98 1.48%Tron $0.05653 2.81%Litecoin $87.82 0.94%Shiba Inu $0.00001078 6.53%Solana $23.26 1.58%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bXMtbGF0ZXN0LXVwZGF0ZS1jb3VsZC1nZXQtZXRoLWhvbGRlcnMtZXhjaXRlZC1mb3ItMjAyMy1iZWNhdXNlL9IB0wFodHRwczovL2FtYmNyeXB0by5jb20vZXRoZXJldW1zLWxhdGVzdC11cGRhdGUtY291bGQtZ2V0LWV0aC1ob2xkZXJzLWV4Y2l0ZWQtZm9yLTIwMjMtYmVjYXVzZS8_dXRtX3NvdXJjZT1yc3MmdXRtX21lZGl1bT1yc3MmdXRtX2NhbXBhaWduPWV0aGVyZXVtcy1sYXRlc3QtdXBkYXRlLWNvdWxkLWdldC1ldGgtaG9sZGVycy1leGNpdGVkLWZvci0yMDIzLWJlY2F1c2UmYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "Ethereum’s latest update could get ETH holders excited for 2023 because… - AMBCrypto News",
        "content": "The total value of ETH staked and validators on the network witnessed substantial growth\n\nWhales show interest in ETH as the number of transactions witnessed a surge\n\nEthereum’s [ETH] staking activity continued its upward swing as the total value staked in ETH 2.0. deposit contract reached yet another ATH, data from Glassnode revealed.\n\n? #Ethereum $ETH Total Value in the ETH 2.0 Deposit Contract just reached an ATH of 16,042,407 ETH Previous ATH of 16,042,391 ETH was observed on 14 January 2023 View metric:https://t.co/SzbMPqvhlb pic.twitter.com/QRT9ANf6dr — glassnode alerts (@glassnodealerts) January 15, 2023\n\nHow many are 1,10,100 ETHs worth today?\n\nA drill down of the chart further indicated that this value saw a substantial increase since 6 January. This was when developers announced that the Shanghai Upgrade, which will enable the withdrawal of staked ETH, will go live in March 2023.\n\nNotwithstanding the 1.3% drop observed in ETH’s price at the time of writing, the king of altcoins made a remarkable recovery since the FTX contagion hit the crypto market. The bullish cycle also witnessed ETH sprint towards its pre-FTX market cap levels.\n\nStaking gets hot\n\nThe number of validators on ETH network steadily increased by 0.61% over the seven-day period, per data from Staking Rewards. The revenue from transaction fees also shot up by almost 24% which lent credence to the lucrativeness of ETH staking.\n\nThe annualized reward rate or the reward that validators can expect to earn per year was estimated at 3.8%.\n\nInterestingly, the percentage of eligible tokens that were being staked stood at 13.87%, significantly lower than other popular chains like Cardano [ADA] and Solana [SOL] which had as staking ratio of over 70%.\n\nWhales’ transactions surge\n\nOn-chain indicators corroborated the growing appeal of the network. Whale transactions registered a sharp uptick to hit their highest value in more than two months. As of 14 January, the transactions hit 5646, a jump of almost 30% over the last month.\n\nThe new participants entering the network rose steadily indicating that Ethereum’s adoption was on the rise.\n\nThe increased activity was also highlighted by the velocity indicator which steeply increased to 3.99 on 14 January. This suggested that ETH moved more frequently across wallets.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nHowever, ETH investors are wary of the fact that the Shanghai Upgrade could intensify selling pressure in the market. Data analytics firm Bitwise challenged the claim and stated that mass sales will be impossible as the amount of ETH that could be unstaked will be limited at any point of time.\n\nBitwise also predicted that ETH will turn deflationary in 2023 and its total circulating supply will drop by 1% or more, bringing more relief to investors."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY29pbmdhcGUuY29tL2FoZWFkLW9mLWV0aGVyZXVtLXNoYW5naGFpLXVwZ3JhZGUtZXRoLXJlYWNoZXMtaHVnZS1taWxlc3RvbmUv0gFXaHR0cHM6Ly9jb2luZ2FwZS5jb20vYWhlYWQtb2YtZXRoZXJldW0tc2hhbmdoYWktdXBncmFkZS1ldGgtcmVhY2hlcy1odWdlLW1pbGVzdG9uZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "Ahead of Ethereum Shanghai Upgrade, ETH Reach Big Milestone - CoinGape",
        "content": "Ethereum Shanghai Upgrade: While Ethereum (ETH) price continues to follow an upward curve since the onset of 2023, the community is looking forward to the Shanghai upgrade. The developers have recently dropped the news of preparedness for the upgrade’s launch in March. The upgrade will mean that the staked Ethereum will be open for withdrawals. Meanwhile, the number of staked ETH hit a major milestone on Monday, along with the number of active Ethereum validators.\n\nAlso Read: Shiba Inu Becomes ETH Whales’ Largest Holding Ahead Of Shibarium Launch\n\nadvertisement\n\nIn this context, the Lido DAO token (LIDO) price saw huge gains in the recent past. The Ethereum liquid staking protocol benefitted with the anticipation around Shanghai upgrade. Compared to the $1 price range it maintained until the end of 2022, LIDO had recently doubled to around $2.10 currently.\n\nEthereum Active Validators At Half A Million\n\nAhead of the Shanghai upgrade, the ETH staked reached a major milestone. Ethereum had hit 500,000 validators whereas the total ETH staked reached 16 million figure. While the recent price recovery in the crypto market translated into rise in ETH price, the cryptocurrency could be in for further rise ahead of the upgrade. As of writing, ETH price stands at $1,544, up 0.70% in the last 24 hours, according to CoinGape price tracker.\n\nAlso Read: Bitcoin Price Moving To $65K? Here’s What On-Chain Data And Analysts Suggest\n\nMeanwhile, technical indicators suggest that the next level of price resistance for ETH could be found at $1,650. In the current rally seen since the New Year’s, the coin rose to a high of $1,573. While the previous resistance of $1,500 has been broken, it remains to be seen how long the cryptocurrency will take to breach the next resistance level. In the lead up to the Shanghai upgrade, it appears there is high chance of ETH breaking the resistance level."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vaW52ZXN0b3JwbGFjZS5jb20vMjAyMy8wMS83LWNyeXB0b3MtdGhhdC13aWxsLW1ha2UteW91LXJpY2gtaW4tMTAteWVhcnMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "7 Cryptos That Will Make You Rich in 10 Years - InvestorPlace",
        "content": "Tune in Wednesday, March 13th at exactly 1 PM ET for Louis’ Emergency Briefing and receive his #1 stock pick for 2024 FREE."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZGVjcnlwdC5jby8xMTkzMDYvc2hpYi10ZWFtLXNheXMtbGF5ZXItMi1uZXR3b3JrLXNoaWJhcml1bS1sYXVuY2gtc29vbtIBVGh0dHBzOi8vZGVjcnlwdC5jby8xMTkzMDYvc2hpYi10ZWFtLXNheXMtbGF5ZXItMi1uZXR3b3JrLXNoaWJhcml1bS1sYXVuY2gtc29vbj9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "SHIB Team Says Layer-2 Network Shibarium to Launch ‘Soon’ - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe team behind Shiba Inu (SHIB), the dog-themed meme coin, has announced the upcoming beta release of Shibarium, a layer-2 network that will operate on top of Ethereum.\n\nAccording to the team, Shibarium will reportedly minimize costs and increase transaction speeds —though the exact number of transactions per second has not yet been disclosed.\n\nThe announcement did not specify when the testnet will launch, but said that they are \"approaching the finishing touches.\"\n\nAD\n\nAD\n\nAs a delegated proof-of-stake (DPoS) layer-2 blockchain, Shibarium will be operated and secured via validators and delegators that stake their tokens to receive rewards. These rewards will come in the form of BONE—currently a governance token for decentralized exchange ShibaSwap that will become the Shibarium's gas token—and a soon-to-be-launched TREAT token.\n\nIt is unclear how exactly the TREAT token will be used, and the Shiba Inu team did not immediately respond to Decrypt’s request for comment.\n\nThe announcement also outlined a new SHIB burning mechanism that will replace the previous Burn Portal, which incentivized users to burn their SHIB but did not require it. After Shibarium is launched, all transactions on the network will require an amount of SHIB to be burned, putting deflationary pressure on the total SHIB supply—an often-requested feature by the Shiba community.\n\n\"By implementing this feature, burning SHIB tokens per transaction will be reflected in the total token supply as we hope it will have a significant impact on the circulating amount of the $SHIB supply over time,\" according to the announcement.\n\nWhile this announcement is for the launch of the Shibarium testnet, it also noted that one key update would not be included until the launch of the mainnet: the integration of ShibaSwap.\n\nAD\n\nAD\n\nOnce the mainnet goes live, ShibaSwap will be moved to the network \"to improve the Liquidity Pools and their curves to attract more liquidity, both in regular and stable pairs.\"\n\nAs for Shiba Inu’s token, SHIB jumped 2.5% over the last day, and a whopping 20% amid the wider crypto market’s rally."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvaG93LXRvLXJlYWQtY3J5cHRvLXRyYW5zYWN0aW9ucy1vbi1ldGhlcnNjYW4tZXhwbGFpbmVk0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "How to Read Crypto Transactions on Etherscan? Explained! - Watcher Guru",
        "content": "Etherscan is a block explorer and crypto analysis platform. The tool allows users to monitor and examine the crypto assets, balances, and transactions on the Ethereum network. Etherscan makes it simple to engage with smart contracts and check gas prices. The Ethereum foundation does not provide funding for Etherscan, which is an independent organization.\n\nThe Ethereum blockchain is mostly accessible via a read-only interface. As a result, Etherscan won’t be able to affect your private or public keys and will instead be limited to tracking transaction data.\n\nWhile searching for a crypto wallet or token address, Etherscan will display all the transactions that have been indexed on the blockchain. It makes its function similar to a search engine. Users can search for any type of transaction, whether successful, unsuccessful, or pending.\n\nHow to read crypto transactions on Etherscan?\n\nUsers can enter a crypto wallet address in the search bar or on the home page of Etherscan to view transaction data. Almost immediately, an overview page will appear. You can see the whole wallet balance in ETH and its USD value here.\n\nSource: Etherscan.io\n\nA list of transactions will be visible on the wallet’s main page. You may view internal transactions and also transactions for ETH, ERC-721, and ERC-20 tokens on different tabs. Moreover, you may view the transaction hash, transaction method, block number, wallet address that started the transaction, and transaction status on each of these tabs. The most recent transaction will be at the top.\n\nWhen a transaction is selected, users will come across additional details about the same (image below).\n\nSource: Etherscan.io\n\nTransaction hash is the ID of the transaction. Each transaction has a unique identifier.\n\nStatus indicates whether the transaction was successful, pending, or failed.\n\nFrom and Interacted With (To) show the addresses from where the funds were sent and to which wallet.\n\nValue shows the amount sent. While the Transaction Fee shows the cost of the transaction.\n\nEtherscan is one of the most useful platforms in the crypto sector. The site allows users to keep a check on their transactions, while also exploring the Ethereum blockchain."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vZW4uZXRoZXJldW13b3JsZG5ld3MuY29tL3NoaWJhLWludS10ZWFtLWxhdW5jaC1iZXRhLWwyLWJsb2NrY2hhaW4tcGxhdGZvcm0tc2hpYmFyaXVtLXVzaW5nLWJvbmUtYXMtbmF0aXZlLXRva2VuL9IBfGh0dHBzOi8vZW4uZXRoZXJldW13b3JsZG5ld3MuY29tL3NoaWJhLWludS10ZWFtLWxhdW5jaC1iZXRhLWwyLWJsb2NrY2hhaW4tcGxhdGZvcm0tc2hpYmFyaXVtLXVzaW5nLWJvbmUtYXMtbmF0aXZlLXRva2VuL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 15 Jan 2023 08:00:00 GMT",
        "title": "SHIBA INU Team Launch Beta L2 Blockchain Platform Shibarium Using $Bone As Native Token - Ethereum World News",
        "content": "Shiba Inu Team announced the launch of the beta L2 blockchain platform (Shibarium) that aims to lower gas fees on the Ethereum network.\n\nTransactions on Shibarium occur “off-chain” and are communicated back to the Ethereum blockchain, which allows for lower costs and faster processing times.\n\nShibarium also provides a robust development framework for the community to build their vision into the blockchain, and has potential uses in gaming, social media, education, and supply chains.\n\nThe platform also supports Non-Fungible Tokens (NFTs) and has a native token, $BONE, which will be used to pay for gas transactions and reward validators and delegators within the protocol. $BONE can currently be obtained through ShibaSwap and other platforms, and is expected to gain more attention and adoption as the launch of Shibarium approaches.\n\nA new blockchain platform, Shibarium, is set to launch as a solution for high gas fees on the Ethereum network from the Shiba Inu team.\n\n🍖 Introduction to Shibarium: Shiba Inu's Layer 2 Network — Rejoice #ShibArmy! Shibarium Beta is about to be launched, and through this article we want to introduce some basic concepts in order to provide clarity to the community.\n\n\n\nRead more: https://t.co/xWyPaVlQQ4 — Shib (@Shibtoken) January 15, 2023\n\nThe launch of Shibarium is to solve a common barrier for users looking to make small transactions in their day-to-day lives, with added fees of $50-$100 on top of a fractional $15 purchase, making it impractical and unrealistic for many to use these digital assets in their daily transactions.\n\nShibarium is a Layer 2 blockchain, meaning that transactions occur “off-chain” and are communicated back to the Ethereum blockchain. This allows the Shibarium blockchain to handle the majority of the processing work, which in turn reduces bandwidth and lowers costs and processing time for users.\n\nBeyond the cost and speed benefits, Shibarium’s development framework provides robust functionality to allow the community to build their vision into the blockchain. Decentralized Applications (dApps) are a critical component of the expansion of Web 3, and their uses are nearly endless. Gaming, social media, education, and supply chains are just a few of the many potential uses for dApps on Shibarium.\n\nThe platform also supports Non-Fungible Tokens (NFTs) with the ability to create chain-specific NFTs. These tokens can be used for a variety of applications such as event tickets, in-game items, art and music, and digital real estate.\n\nShibarium and $Bone\n\nShibarium, the highly anticipated Layer 2 blockchain platform, has also announced that its native token, $BONE, will be used to pay for gas transactions and reward validators and delegators within the protocol.\n\nSince its launch in July 2021, the main function of $BONE has been linked to governance, but, according to the team, it will now also play a crucial role in the upcoming Shibarium launch.\n\nValidators and Delegators are assigned a percentage of a token called $BONE that are distributed each time a specific time is reached. They will also be given a portion of another token called TREAT. A commission is a fee taken by the validator for the operation and maintenance of the node. Rewards are distributed based on the amount of tokens staked by each of them, after validator commissions.\n\nThe total supply of $BONE is 250 million, with 20 million of those tokens reserved to reward validators and delegators in the coming years. The allocation of these tokens was determined through a decentralized autonomous organization (DAO) process, which was voted on by the Shiba community.\n\n$BONE can currently be obtained through ShibaSwap and other decentralized and centralized platforms, and its contract address is:\n\n0x9813037ee2218799597d83d4a5b6f3b6778218d9.\n\nAs the launch of Shibarium approaches, $BONE is expected to gain more attention and adoption as it will be at the forefront of gas transactions and rewards within the protocol."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmZpbmFuY2lhbGV4cHJlc3MuY29tL2J1c2luZXNzL2Jsb2NrY2hhaW4tc2hpYmEtaW51LWRldmVsb3BlcnMtZXhwZWN0ZWQtdG8tdW52ZWlsLWV0aGVyZXVtLWJhc2VkLXNoaWJhcml1bS0yOTQ5OTEyL9IBgwFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9idXNpbmVzcy9ibG9ja2NoYWluLXNoaWJhLWludS1kZXZlbG9wZXJzLWV4cGVjdGVkLXRvLXVudmVpbC1ldGhlcmV1bS1iYXNlZC1zaGliYXJpdW0tMjk0OTkxMi9saXRlLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "Shiba Inu developers expected to unveil Ethereum-based Shibarium - The Financial Express",
        "content": "The developers behind the dog-themed token Shiba shared an update for its community around the incoming beta release of Shibarium, a layer-2 network which functions over the Ethereum mainnet, as reported by Cointelegraph.\n\nAccording to Cointelegraph, SHIB developers revealed data about layer-2 blockchains. It is believed that they emphasised on Shibarium’s development to provide a tool for permitting the community to ensure the project’s growth. “Patience is key, and some see Shibarium as a price-pumping tool, but that is not the project’s focus and never has been,” the developers stated.\n\nOn the basis of information by Cointelegraph, the developers highlighted the aim behind the new update in its infrastructure to “revolutionise the Shiba ecosystem,” through removal of barriers for small transactions’ entry, speed upgradation, permitting development of decentralised applications (dApps) and integration of non-fungible tokens (NFTs). Furthermore, the developers mentioned that “all transactions on the network will have an implicit burn amount for SHIB token.” While an official timeline has not been given around the release, the team said that the answer to all questions based on the time frame is “soon.”\n\nMoreover, Cointelegraph noted that on November 22, 2022, Shytoshi Kusama, developer, SHIB, said that the World Economic Forum (WEF) asked the project to partner on developing a global policy on the metaverse. Also, the developer expressed the intention to work with other technology companies such as Facebook and Decentraland for ensuring WEF’s development of the policy.\n\n(With insights from Cointelegraph)\n\nAlso Read Twitter’s crypto price index component to cover around 30 additional tokens\n\nFollow us on Twitter, Facebook, LinkedIn"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3LnRoZXN1bi5jby51ay9tb25leS8yMTA2MTY5NC9tYXJ0aW4tbGV3aXMtaXNzdWVzLXVyZ2VudC13YXJuaW5nL9IBT2h0dHBzOi8vd3d3LnRoZXN1bi5jby51ay9tb25leS8yMTA2MTY5NC9tYXJ0aW4tbGV3aXMtaXNzdWVzLXVyZ2VudC13YXJuaW5nL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "Martin Lewis issues urgent warning to stop Brits losing money and being targeted by criminals – here’s how... - The Sun",
        "content": "EXPERT'S WARNING Martin Lewis issues urgent warning to stop Brits losing money and being targeted by criminals – here’s how to stay safe\n\nMONEY saving expert Martin Lewis has issued an urgent warning to Brits not to fall for the latest scam.\n\nThe founder of MoneySavingExpert.com has said criminals are using a new tactic to steal people's hard-earned cash.\n\n1 Martin Lewis has issued a warning to Brits not to trust scammers using his name\n\nHe took to Twitter and posted the announcement from his handle @MartinSLewis.\n\nIt read: \"Warning from Martin Lewis.\n\n\"Sadly criminals are again hard pushing scams using my face and name, often with pics from TV shows.\n\n\"Be aware.\n\n\"I DON'T appear in adverts, so all are scams.\n\n\"I DON'T agree to be in promoted posts.\n\n\"Owt with me saying invest in Bitcoin code/trader (or similar) or get rich quick, or investment tricks is a scam.\n\n\"If in doubt, don't.\"\n\nThe TV presenter advised Brits to always check by searching on MoneySavingExpert.com to see if he has approved it.\n\nHe said if it isn't on his website - don't trust it.\n\nTwitter users revealed in the comment section that they had been targeted already.\n\nOne wrote: \"My wife said to me yesterday that you were advocating ETH. I told her straight away it was a scam. Even she fell for it! Terrible.\"\n\nAnother commented: \"My Facebook feed has been bombarded today with scams featuring Martin Lewis and I have reported them all.\"\n\n\"I have been scammed. Out of my inheritance. I need help if you could help me please,\" posted another.\n\nOther advised the money expert to retweet his post every morning, afternoon and evening as it is such a successful scam.\n\nThe journalist previously convinced Facebook to invest £3million tackling online fraud and scam adverts.\n\nHe dropped his lawsuit against the social media giant for hosting fake adverts featuring his name and face as they team up to tackle online fraudsters.\n\nFacebook now has a feature that acts as a reporting tool to allow users to flag scam adverts when they see one.\n\nConsumer charity network Citizens Advice set up the new project - called Citizens Advice Scams Action - using Facebook's £3m donation.\n\nThis comes as hackers and crooks increasingly turn to Facebook to get cash out of innocent victims.\n\nAccording to Jamie Akhtar, the CEO of CyberSmart, there are three main scams on the social media app.\n\nThe \"disabled account\" push, the \"romance scam\" and the \"bogus job offer.\"\n\nHow to stay safe According to the Met Police Be suspicious of all ‘too good to be true’ offers and deals. There are no guaranteed get-rich-quick schemes. Don’t agree to offers or deals immediately -insist on time to get independent or legal advice before making a decision. Don’t hand over money or sign anything until you’ve checked someone’s credentials and their company’s. Never send money to anyone you don’t know or trust, whether in the UK or abroad, or use methods of payment you’re not comfortable with. Never give banking or personal details to anyone you don’t know or trust -this information is valuable so make sure you protect it. Always log on to a website directly rather than clicking on links in an email. Don’t just rely on glowing testimonials. Find solid, independent evidence of a company’s success. Always get independent or legal advice if an offer involves money, time or commitment. If you spot a scam or have been scammed, report it and get help. Don’t be embarrassed about reporting a scam - by reporting it, you'll make it more difficult for them to deceive others."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmJpdGNvaW5zZW5zdXMuY29tL2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tZGFpbHktMTYtamFuLTItcG9zc2libGUtc2NlbmFyaW9zLXlvdS1zaG91bGQtd2F0Y2gtb3V0LWZvci1vbi1ldGhlcmV1bS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction Daily (16-Jan): 2 Possible Scenarios You Should Watch Out For On Ethereum - Bitcoinsensus",
        "content": "Ethereum price prediction from a previous analysis Urgent! The Most Important Support For The Ethereum Bulls!\n\nThe Ethereum bulls are still struggling to break through the $1,690 key resistance level in the 4-hour timeframe. And while the price continues to linger on at this key level, we are already beginning to see traders become anxious, worrying that this might be another failed attempt by the Ethereum bulls.\n\nWell, we understand why you might be anxious but Ethereum is still in bullish territory. And as far as it stays in this bullish territory, we will continue to only look for bullish trade setups to take advantage of.\n\nOur previous TA Urgent! The Most Important Support For The Ethereum Bulls! explains all about this bullish territory and the key support Ethereum must respect if it wants to remain in it\n\nHowever, for this Ethereum analysis, we will be talking about the two possible price scenarios we can be expecting from Ethereum in the coming days.\n\nOnce you are done reading this TA, you will be prepared for whatever, the ETH price chart throws at you in the coming days.\n\nTo trade ETH with leverage, sign-up to Bybit right now! Bybit’s BIGGEST Bonus Campaign is now live! You can get up to a $30,000 Bonus when you fund your Bybit account with our Bybit link\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nETH 1st Bullish Scenario!\n\n2 Possible Scenarios You Should Watch Out For On Ethereum. Watch this bullish prediction in the ETH Daily timeframe\n\nFor the first bullish scenario, we expect to see the Ethereum bullish momentum pick up in the coming days, breaking through the $1,690 key resistance level and continuing its move up to our bullish target of $2,014.\n\nWe believe this is very possible because Ethereum is not yet overextended to the upside and there is still a lot of room for the Altcoin to rally before the bulls lose steam.\n\nETH 2nd Bullish Scenario!\n\nFor the 2nd bullish price scenario, we expect to see the Altcoin try to cause as much pain to traders as possible. And what that pain would look like could be a potential pullback before the bullish rally continues.\n\nWhat that could look like is the image below where we see the Ethereum price sell-off back down to the $1,176 key support level in the 4-hour timeframe before finding support and rallying higher.\n\n2 Possible Scenarios You Should Watch Out For On Ethereum. Watch this bullish prediction in the ETH Daily timeframe\n\nFinal Verdict!\n\nNo matter what price scenario the Ethereum bulls decide to take in the coming days, we will remain bullish on the Altcoin as far as the ETH price stays within the bullish territory.\n\nOur previous TA Urgent! The Most Important Support For The Ethereum Bulls! explains all about this bullish territory and the key support Ethereum must respect if it wants to remain in it\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nIn Other News…\n\nBiggest Liquidations for Short sellers!\n\nOver $500M has just been liquidated as the Bitcoin price continues to surge. These massive liquidations were for open positions selling the Bitcoin market and expecting the coin to keep on going down.\n\nThis is very good because it shows that the crypto industry is not dead despite the multiple controversies and massive crashes that occurred! And if this bullish rally continues, we can expect to see the market regain its ATHs status very soon!\n\nEasy Steps From Beginner To Pro Crypto Trader\n\nYou can speed up your learning journey by reading our How To Trade Bitcoin Guide. This guide is the best for crypto traders who wants to get familiar with the basics of Bitcoin trading. You can also check out our top list of Best Bitcoin Exchanges To Trade With.\n\nPrimeXBT Covesting: Trade Hassel Free\n\nSign-up on PrimeXBT today to trade Bitcoin hassle-free. You can copy experienced traders and access hundreds of different strategies on the platform! Don’t forget to claim your 25% bonus by using the promo code “bitcoinsensus50” when you sign-up with our link PrimeXBT Covesting"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3LnRyb253ZWVrbHkuY29tL3BvbHlnb24tbWF0aWMtYnVsbC1ydW4tZmluYWwtdGVzdG5ldC16ay1yb2xsdXBzL9IBT2h0dHBzOi8vd3d3LnRyb253ZWVrbHkuY29tL3BvbHlnb24tbWF0aWMtYnVsbC1ydW4tZmluYWwtdGVzdG5ldC16ay1yb2xsdXBzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 15 Jan 2023 08:00:00 GMT",
        "title": "Polygon (MATIC) Bull Run As Final Testnet For Zero-Knowledge Rollups Approaches - TronWeekly",
        "content": "Polygon, the Ethereum layer-2 scaling solution, is currently conducting performance evaluations of its zero-knowledge roll-up technology prior to its official integration with the mainnet, as per a recent report.\n\nIn October 2022, Polygon announced the launch of its zero knowledge-EVM public testnet, a scaling tool designed to facilitate lower-cost transactions on the Ethereum blockchain.\n\nPolygon zkEVM: Now with more throughput and less latency. But how?\n\n\n\nRecursion makes proofs smaller. Aggregation makes them correct. Batches of proofs are also 150% larger. pic.twitter.com/3Hi9H2uasT — Polygon ZK (@0xPolygonZK) January 13, 2023\n\nThe company hopes that the introduction of zero-knowledge (ZK) roll-up technology will make Polygon the leading scalable system for Ethereum. It had previously announced plans to launch the zkEVM public testnet over the summer at ETHCC in Paris, with a mainnet launch planned for early 2023.\n\nThe new technology deploys the Ethereum Virtual Machine (EVM) for its ZK roll-up, allowing developers to use their existing smart contracts from Ethereum without additional programming.\n\nAccording to the latest report:\n\nThe team has confirmed that zero-knowledge proofs can be implemented on Ethereum by successfully generating over 12,000 zk-proofs in a primary version of the zkEVM testnet.\n\nThis development is poised to have a major impact on the Ethereum ecosystem, as it allows for greater privacy and security for transactions on the network.\n\nDavid Schwartz, the leader of Polygon zkEVM and PolygonID, provided insight into the progress of the technology in correspondence. He stated that Layer-2 platforms have become more advanced and enhanced the features of Ethereum, significantly contributing to its scalability.\n\nHe emphasized that by utilizing zero-knowledge technology in roll-ups on layer-2 platforms, transaction finality can be reached more rapidly while maintaining the security of the validated transactions through the use of zero-knowledge methods.\n\nAdditionally, Schwartz said Polygon zkEVM has a zkProver that passes all Ethereum tests at 99% and is the first complete EVM-equivalent source code available. He called completing validity proofs for transactions the most challenging and satisfying aspect of developing the native zkEVM.\n\nPolygon (MATIC) Price Rise\n\nPolygon (MATIC) experiences a significant price increase, breaking through key resistance levels and reaching $0.98, with notable gains seen in both daily and weekly charts following recent news.\n\nSource: CoinMarketcap\n\nAccording to CoinMarketCap, MATIC is currently trading at $0.9935 with a 10% increase in the daily chart and a 23.32% increase in the weekly chart. The trading volume of the token has also risen by 75.95%.\n\nMATIC has established a key long-term support level at $0.77. As long as the price remains above this level, the trend is considered bullish.\n\nA hard fork for Polygon is scheduled for January 17th, which aims to improve the user and developer experience. This could result in a potential increase in the price of MATIC, with the possibility of reaching the significant resistance level of $2.00 if the upward trend continues.\n\nRelated Reading | Here’s Why Binance Will Suspend Terra Classic Transactions"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LnRoZWNvaW5yZXB1YmxpYy5jb20vMjAyMy8wMS8xNi9ldGhlcmV1bS1iZWF0ZW4taW4tZGFpbHktdHJhbnNmZXItY291bnQtYnktYXJiaXRydW0tYW5kLW9wdGltaXNtLWNvbWJpbmVkL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "Ethereum beaten in Daily Transfer Count by Arbitrum and Optimism combined - The Coin Republic",
        "content": "L2 scaling network Arbitrum’s and Optimism’s combined daily transactions beat Ethereum’s daily transactions.\n\nEthereum manages 1.10 million while they manage 1.32 million combined.\n\nSince the Merge, there has been a considerable increase.\n\nTransaction volume plays a very important role, especially in the crypto industry; 2022 saw a drought in this aspect. Post-Ethereum merge, on-chain fees are lowered, and the combined transaction volume on Layer 2 (L2) chains, such as Arbitrum and Optimism, surpassed Ethereum’s on-chain transaction output.\n\nJanuary 14, 2023, Ethereum processed 1.10 million on-chain transactions; at the same time, Arbitrum and Optimism managed to get 1.32 million.\n\nThe on-chain transaction fees have been at the lower end of the spectrum since August 2022 and dropped further after the major shift towards Proof-of-Stake (PoS) from the energy-intensive Proof-of-Work (PoW) consensus on September 15, 2022.\n\nThe data from etherscan.io’s gas tracker shows the highest priority on-chain ether transaction cost only about $0.75 or just 23 gwei at 5:00 PM EST on Sunday.\n\nAs per data obtained on January 15, 2023, it cost around $0.101 per transfer for the average Arbitrum transaction and $0.1410 for the Optimism transaction. L2 scaling solutions with features they provide are increasingly gaining popularity from 2020, joining the bandwagon with Arbitrum and Optimism; the list includes Polygon Hermez, Zksync, Boba and Starknet.\n\nL2 allows faster and cheaper transactions by considerably reducing the computational workload on L1, or the main blockchain network, Ethereum. Transactions of Arbitrum and Optimism are “rolled up” periodically, to be recorded on Ethereum using an optimistic virtual machine or optimistic rollup. Further analysis of data shows that there has been a significant increase in Arbitrum and Optimism.\n\nOptimism recorded 737,191 transactions, and Arbitrum did 56,745 on January 14, 2023. Looking at the data from January 10, 2023, the combined transactions from Arbitrum and Optimism managed to beat the number of direct Ethereum on-chain transfers.\n\nOn January 10, 2023, Ethereum processed 1.06 million on-chain transfers, while the combined transactions of both L2 scaling networks managed 1.12 million.\n\nAs per the data from Dune Analytics from January 14, 2023, both L2 networks managed 1.32 million transactions, but Ethereum only managed 1.10 million. Although when compared with other Ethereum, it still processes more daily transactions. XRP and Polygon managed to settle more transactions than Ethereum.\n\nPolygon managed 3.10 million, while XRP did 1.25 million transactions settled on January 14, 2023. Even if these L2 chains could not surpass Ethereum alone, Polygon’s and XRP’s daily transactions count have increased considerably for the past 12 months.\n\nOn January 15, 2022, Ethereum managed 1.17 million transactions, Arbitrum processed 21,734 transfers, and Optimism managed 30,430 per day. In the last 12 months, Arbitrum saw a 2,599% increase and Optimism’s 2,322% increase in daily transactions."
    }
]