[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vYmxvY2tnZWVrcy5jb20vZ3VpZGVzL3dpbGwtZXRoZXJldW0tc3VycGFzcy1iaXRjb2luLWZvcmVjYXN0LWFuZC1hbmFseXNpcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Will Ethereum Surpass Bitcoin? Forecast and Analysis - Blockgeeks",
        "content": "Ethereum and Bitcoin, the titans of the cryptocurrency world, may face a shift in power with the rising popularity of btc and the emergence of smart contract platform like Binance. The bullish momentum is evident. With its rapidly growing market capitalization, Ethereum, a smart contract platform and a leading cryptocurrency, is poised to challenge and potentially surpass Bitcoin’s dominance in the dollar cryptocurrency market.\n\nThe increasing adoption of decentralized applications (dApps) on the Ethereum network positions it as a strong contender against Bitcoin in the crypto market. With the rising popularity of the dollar cryptocurrency and the bullish momentum of uniswap, Ethereum is poised for success. Moreover, Ethereum’s innovative features and smart contract capabilities give it an edge in the crypto market. Additionally, Ethereum is a popular choice for investors looking to diversify their portfolio with a dollar cryptocurrency. With platforms like Uniswap and Coinbase supporting Ethereum, it has become even more accessible to trade and invest in. As the battle for supremacy heats up in the crypto space, all eyes are on Ethereum to see if it can flippen Bitcoin and become the new reigning champion. Coinbase and Uniswap are closely monitoring this potential flippening.\n\nFactors Influencing Ethereum’s Overtaking of Bitcoin\n\nScalability Improvements\n\nEthereum’s potential to surpass Bitcoin in the crypto market lies in its scalability improvements, particularly the implementation of ETH 2.0 on Coinbase. With its enhanced scalability and the integration of AI technology, Ethereum aims to increase its market cap. This upgrade from the Ethereum Foundation aims to address the network’s current limitations and enhance its performance. Users can reply to this announcement on the Coinbase platform, which is a popular crypto exchange. By introducing features like sharding and a proof-of-stake consensus mechanism, Ethereum can increase its transaction processing capabilities and reduce congestion. This development is crucial for platforms like Coinbase, which rely on efficient transaction processing. Additionally, the implementation of AI technology can further enhance Ethereum’s performance, making it more competitive in the market. This progress brings us closer to the possibility of a flippening, where Ethereum surpasses other cryptocurrencies in terms of market capitalization and popularity. As a result, the ethereum price may become more attractive to users and developers seeking faster and cheaper transactions. Additionally, the ethereum foundation may reply to inquiries regarding the price.\n\nRising Interest in DeFi Applications\n\nAnother factor contributing to Ethereum’s potential dominance over Bitcoin is the growing interest in decentralized finance (DeFi) applications built on the Ethereum platform. In addition, the increasing number of users who reply to DeFi applications on Ethereum is also playing a significant role in its rise. DeFi enables users to lend, borrow, trade, and earn interest using smart contracts, all while taking advantage of the latest ethereum price. The increasing popularity of DeFi projects like Uniswap, Aave, and Compound has propelled Ethereum’s usage and value. As more innovative DeFi applications emerge on Ethereum, it could solidify its position as the go-to blockchain for decentralized finance.\n\nFlexibility through Community Consensus\n\nOne advantage that sets Ethereum apart from Bitcoin is its ability to adapt and evolve through community consensus. Unlike Bitcoin‘s more rigid structure, Ethereum allows for upgrades and changes based on community agreement. This flexibility enables developers to implement new features or fix existing issues promptly using ether. For example, when faced with high gas fees due to network congestion, the Ethereum community actively explored solutions such as layer-two scaling solutions or fee market reforms. This collaborative approach ensures that Ethereum remains responsive to user needs.\n\nComparative Analysis: Bitcoin as Digital Gold vs. Ethereum as Digital Oil\n\nWhile both cryptocurrencies have store-of-value properties, Ethereum offers additional utility beyond being a digital asset like gold.\n\nEthereum’s Programmability and Diverse Use Cases\n\nUnlike gold, which has limited industrial use cases, Ethereum’s programmability allows for diverse applications across various industries. It’s like comparing gold to oil to ether – sure, gold is valuable and shiny, but oil powers the world and ether revolutionizes transactions. In the same way, while Bitcoin holds value as digital gold, Ethereum serves as digital oil that fuels innovation.\n\nEthereum’s programmable nature enables the creation of smart contracts and decentralized applications (DApps). These smart contracts automatically execute predefined conditions without intermediaries. This functionality opens up a world of possibilities for industries such as finance, supply chain management, real estate, gaming, and more. With the use of ether, these industries can benefit greatly.\n\nPowering Smart Contracts and Decentralized Ecosystems\n\nAs digital oil, Ethereum powers smart contracts and enables the creation of new decentralized ecosystems. Developers can build their own tokens on top of the Ethereum blockchain through ERC-20 standards. This has led to the rise of decentralized finance (DeFi) platforms that offer lending, borrowing, yield farming, and other financial services without intermediaries, using the ether cryptocurrency.\n\nEthereum’s versatility also extends to non-fungible tokens (NFTs), which have gained significant popularity in recent years. NFTs allow for unique ownership rights over digital assets such as artwork or collectibles. The ability to create and trade these assets has opened up new opportunities for artists and creators in the digital realm.\n\nUnique Value Propositions: Bitcoin and Ethereum Comparison\n\nBitcoin and Ethereum are two prominent cryptocurrencies in the market, each with its own unique value propositions. While Bitcoin positions itself as a secure and censorship-resistant store of value with a fixed supply cap, Ethereum offers much more than just being a digital currency.\n\nBitcoin’s Key Value Propositions\n\nBitcoin has gained popularity as “digital gold” due to its ability to provide a secure and decentralized platform for financial transactions. Its limited supply of 21 million coins ensures scarcity, making it an attractive investment option. Some key value propositions of Bitcoin include:\n\nSecure Store of Value: Bitcoin’s blockchain technology ensures that transactions are secure and cannot be tampered with or reversed.\n\nCensorship Resistance: The decentralized nature of the Bitcoin network makes it resistant to censorship or control by any central authority.\n\nLimited Supply Cap: With a fixed supply cap, Bitcoin is designed to be deflationary over time, potentially increasing its long-term value.\n\nEthereum’s Unique Features\n\nIn contrast to Bitcoin, Ethereum offers programmability through smart contracts. This feature allows developers to build decentralized applications (DApps), enabling various use cases beyond simple financial transactions. Here are some key value propositions of Ethereum:\n\nSmart Contract Functionality: By utilizing smart contracts, developers can create self-executing agreements that automatically trigger actions when specific conditions are met.\n\nDiverse Token Ecosystem: Ethereum provides a platform for creating new tokens easily, giving rise to a vast ecosystem of diverse projects and applications.\n\nDecentralized Finance (DeFi): Ethereum’s programmability has paved the way for DeFi protocols like Uniswap, which allow users to trade cryptocurrencies directly without intermediaries.\n\nBoth cryptocurrencies have their strengths and cater to different needs within the blockchain ecosystem. While Bitcoin excels as a secure store of value, Ethereum offers greater functionality through its smart contract capabilities. Understanding these unique value propositions helps investors and users make informed decisions based on their specific requirements.\n\nEthereum Price Analysis: Targeting $X by 2025\n\nBased on current trends and market conditions, analysts predict that the price of Ether (ETH) could reach a target value by 2025. Several factors contribute to this projection for Ethereum, including increased adoption, technological advancements, and market demand.\n\nThe growing adoption of Ethereum as a platform for decentralized applications (dApps) and smart contracts is a key driver behind its potential price surge. As more developers and businesses utilize the Ethereum blockchain for various purposes, the demand for Ether increases. This increased demand can potentially drive up its price in the long term.\n\nTechnological advancements within the Ethereum ecosystem also play a significant role in its projected growth. The upcoming upgrade to Ethereum 2.0 aims to enhance scalability and security, making it more efficient and attractive to users. These improvements could further boost investor confidence and drive up the price of Ether.\n\nMarket demand is another crucial factor that influences cryptocurrency prices. As more individuals recognize the potential of cryptocurrencies like Ethereum as an investment asset class, there is an increasing demand for Ether tokens. This rising interest from investors can create upward pressure on the price of Ether over time.\n\nHowever, it’s important to note that cryptocurrency prices are highly volatile and subject to market fluctuations. While analysts may provide projections based on available data and trends, these predictions are not guaranteed outcomes.\n\nAssessing the Likelihood of Ethereum Surpassing Bitcoin\n\nEthereum has been gaining significant traction in recent years, leading many to wonder if it will eventually surpass Bitcoin in terms of market dominance. When considering Ethereum’s growing market share, technological advancements, and strong community support, it becomes clear that Ethereum does indeed have a realistic chance of surpassing Bitcoin.\n\nOne key factor contributing to this likelihood is the continuous improvement in network scalability. Ethereum developers are actively working on solutions such as Ethereum 2.0, which aims to address the current limitations and increase transaction throughput. By implementing these improvements, Ethereum can attract more users and decentralized applications (dApps), further solidifying its position as a leading blockchain platform.\n\nThe increased adoption of dApps built on the Ethereum network plays a vital role in its potential to surpass Bitcoin. As more developers and businesses recognize the benefits of building on Ethereum, we can expect an influx of innovative projects that could drive up demand for Ether (ETH) tokens.\n\nHowever, it’s important to note that numerous factors can influence the future growth and success of both cryptocurrencies. While Ethereum shows promise, Bitcoin remains the dominant player in terms of market capitalization and widespread recognition.\n\nHere are some factors that could affect the outcome:\n\nEvaluating the Case for Ethereum Becoming a Trillion-Dollar Cryptocurrency\n\nPopularity of DeFi Applications\n\nDecentralized finance (DeFi) applications built on Ethereum have been gaining significant popularity. This surge in interest could potentially drive Ethereum’s market capitalization towards the trillion-dollar mark. The growth and adoption of DeFi platforms offer various use cases, from lending and borrowing to decentralized exchanges and yield farming.\n\nContinued Innovation and Institutional Interest\n\nEthereum has remained at the forefront of blockchain innovation, constantly introducing new features and upgrades. These advancements attract institutional investors who recognize the potential of Ethereum as a valuable asset. As more institutions enter the cryptocurrency space, their involvement could contribute to driving up Ethereum’s market cap.\n\nGlobal Adoption\n\nEthereum’s global adoption plays a crucial role in its journey towards becoming a trillion-dollar cryptocurrency. With an extensive network of developers, users, and projects worldwide, Ethereum has established itself as a leading blockchain platform. As more individuals and businesses embrace Ethereum for various purposes such as smart contracts or token creation, its market capitalization is likely to see substantial growth.\n\nWhile these factors suggest that Ethereum has the potential to surpass Bitcoin in terms of market capitalization, it is important to consider several variables and market dynamics that may influence this outcome:\n\nMarket Volatility: The cryptocurrency market is highly volatile, which can impact both Bitcoin and Ethereum’s valuations.\n\nCompetitor Landscape: Other cryptocurrencies may emerge with innovative technologies or use cases that could challenge Ethereum’s dominance.\n\nRegulatory Environment: Government regulations regarding cryptocurrencies can significantly affect their adoption and value.\n\nScalability Challenges: As more users flock to the Ethereum network, scalability issues may arise that need to be addressed effectively.\n\nThe Future of Ethereum and its Potential to Outshine Bitcoin\n\nIn conclusion, the future looks bright for Ethereum as it continues to make significant strides in the cryptocurrency market. With its advanced technology, smart contract capabilities, and growing ecosystem of decentralized applications (dApps), Ethereum has positioned itself as a strong contender to surpass Bitcoin in terms of market dominance and value.\n\nWhile Bitcoin remains the most well-known and established cryptocurrency, Ethereum offers unique value propositions that set it apart. Just as oil fueled industrial revolutions, Ethereum has the potential to fuel a new digital revolution by providing a platform for innovation and development across various industries. Its ability to facilitate complex transactions and execute programmable contracts opens up a world of possibilities for businesses and individuals alike.\n\nSo what does this mean for you? As an investor or enthusiast, it’s important to stay informed about the developments in both Bitcoin and Ethereum. While Bitcoin may still hold its position as digital gold, Ethereum could emerge as the digital oil that powers the future economy. Keep a close eye on these two cryptocurrencies, evaluate their performance, consider their potential use cases, and make informed decisions based on your own investment goals.\n\nFAQs\n\nCan I invest in both Bitcoin and Ethereum?\n\nAbsolutely! Investing in both Bitcoin and Ethereum can provide diversification within your cryptocurrency portfolio. Each cryptocurrency has its own unique characteristics and potential for growth. By investing in both, you can spread your risk while potentially benefiting from the growth of both assets.\n\nIs Ethereum better than Bitcoin?\n\nIt depends on what you’re looking for. While Bitcoin is often considered a store of value like gold, Ethereum offers more advanced capabilities with its smart contract functionality. If you’re interested in participating in decentralized finance (DeFi) or building decentralized applications (dApps), then Ethereum might be a better fit for your needs.\n\nWhat factors could impact the future success of Ethereum?\n\nSeveral factors could influence how successful Ethereum becomes in relation to Bitcoin. These include technological advancements, regulatory developments, adoption by mainstream institutions, and competition from other cryptocurrencies. It’s important to stay informed about these factors and evaluate the potential impact on Ethereum’s future growth.\n\nHow can I buy Ethereum?\n\nYou can buy Ethereum on various cryptocurrency exchanges. First, you’ll need to create an account on a reputable exchange platform. Then, you can deposit funds into your account and use those funds to purchase Ethereum. Make sure to do thorough research and choose a trusted exchange that aligns with your needs.\n\nCan Ethereum reach a trillion-dollar market cap?\n\nWhile it’s impossible to predict the future with certainty, reaching a trillion-dollar market cap is not out of the realm of possibility for Ethereum. As the cryptocurrency market continues to grow and evolve, Ethereum’s unique value propositions and widespread adoption could drive its market capitalization higher in the coming years."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LnByb3ZpZGVuY2Vqb3VybmFsLmNvbS9zdG9yeS9zcGVjaWFsL2NvbnRyaWJ1dG9yLWNvbnRlbnQvMjAyMy8xMS8xNC90aGUtZXZvbHV0aW9uLW9mLWV0aGVyZXVtLzcxNTgyOTI3MDA3L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "The Evolution of Ethereum - The Providence Journal",
        "content": "William Mullane\n\nContributor\n\nOnce is was developed, word quickly spread about the potential of Ethereum, attracting developers from all corners of the globe. The community grew rapidly, becoming a vibrant ecosystem of innovation and collaboration. Each new member brought unique skills and ideas to the table, further enriching the platform. Ethereum was becoming a hub of creativity, with its limitless possibilities captivating the hearts and minds of those involved.\n\nAs Ethereum progressed, it underwent a series of updates and improvements. The team introduced Homestead, a more stable version of the platform, followed by Metropolis, which brought enhanced privacy features. With each update, Ethereum pushed the boundaries of what was possible, captivating even more developers and users.\n\nBut the Ethereum Virtual Machine (EVM) was the real game-changer. It allowed developers to write smart contracts in various programming languages, opening the platform to a wider audience. Suddenly, anyone with coding skills and a vision could create decentralized applications on Ethereum, igniting a wave of innovation and propelling its growth.\n\nThe increasing popularity of Ethereum did not go unnoticed by investors. The value of its native cryptocurrency, Ether, increased, attracting additional funding. Ethereum became a hotspot for Initial Coin Offerings (ICOs). Startups soon leveraged the platform to raise millions of dollars. This marked the birth of a new economy driven by smart contracts fueled by Ether, leading even Bitcoin to follow through its Lightning Network.\n\nWith success came challenges. Ethereum faced scalability issues as its user base expanded. But the team behind Ethereum remained relentless. They embarked on a mission to address these concerns and make Ethereum even more robust. This journey led to the development of Ethereum 2.0, a major upgrade aiming to enhance scalability and security through a new consensus mechanism known as Proof of Stake.\n\nThe story of Ethereum is an ongoing saga, with each chapter unveiling exciting new advancements and thought-provoking challenges. It demonstrates that a single idea can transform an entire industry and inspire countless others. Ethereum's evolution is due in large part to the resilience and ingenuity of its enthusiastic community.\n\nAnd as the journey of Ethereum continues, the possibilities are boundless. From a visionary's abstract concept to a billion-dollar blockchain that has captured the world's attention, Ethereum's impact on the future of finance, technology, and beyond is immeasurable. Furthermore, the Ethereum community's spirit of collaboration and passion will undoubtedly guide its path as it paves the way for a future where possibilities are limitless.\n\nThis is for informational purposes only. Please invest at your own risk."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vY3J5cHRvLm5ld3MvZXRoZXJldW0tbWFpbnRhaW5zLXBvc2l0aW9uLWFib3ZlLTJrLWFmdGVyLWV0Zi1wcm9wb3NhbC1zdXJnZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Ethereum maintains position above $2k after ETF proposal surge - crypto.news",
        "content": "Ethereum (ETH) has been holding above the $2,000 mark as investment products significantly surged after the exchange-traded fund proposal.\n\nThe largest asset manager with $9.4 trillion of assets under management, BlackRock, registered an iShares ETH Trust on Nov. 9. Since the proposal, Ethereum saw a 9% rise, surpassing the crucial $2,000 mark.\n\nETH price, whale activity, open interest and Binance funding rate – Nov. 14 | Source: Santiment\n\nAccording to data provided by Santiment, following the rise, whale transactions consisting of at least $100,000 worth of ETH surged by 25% over the past 24 hours — hiking from 2,151 to 2,678 transactions over the past day.\n\nYou might also like: NFT market revives as major collections soar in sales and volume\n\nAccording to a crypto.news report on Nov. 13, whales have accumulated over $58 million worth of Aave (AAVE), Ethereum, Arbitrum (ARB), Pepe (PEPE), and a few more altcoins over the past week.\n\nWith the hike in whale activity, data provided by Santiment shows that ETH’s price-daily active addresses (DAA) divergence took a deep dive, declining to negative 45.17%. When the price DAA divergence drops to below zero, the indicator suggests a “sell” signal since large whales might manipulate the market.\n\nOn the other hand, per Santiment, Ethereum’s total open interest (OI) declined from $4.15 billion on Nov. 10 to $3.85 billion at the time of writing.\n\nMoreover, ETH’s Binance funding rate currently stands at 0.02%, suggesting the dominance of short position holders until further movements.\n\nEthereum is up by 0.7% in the past 24 hours and is trading at $2,050 when writing. The asset’s market cap rose to $247.5 billion with a 24-hour trading volume of $13.4 billion.\n\nFollow Us on Google News"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzExLzE0L3Nob3VsZC15b3UtYnV5LWV0aGVyZXVtLXdoaWxlLWl0cy11bmRlcnBlcmZvcm1pbmcv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Should You Buy Ethereum While It's Still Underperforming the Market? - The Motley Fool",
        "content": "At first glance, Ethereum (ETH 2.45%), the world's second-most valuable cryptocurrency, seems to be having a banner year. Ethereum is up 57% and appears to be gaining momentum heading into the final weeks of the year. Over the past 30 days, Ethereum is up more than 20%.\n\nBut context matters, and right now, Ethereum is badly underperforming the crypto market. Bitcoin (BTC 5.54%), for example, is up a spectacular 112% this year. And other top cryptocurrencies are similarly posting triple-digit gains in 2023. All of this has complicated the decision-making calculus around Ethereum, which now looks like a market laggard. If you are thinking about buying Ethereum, this is what you need to know.\n\nWhy is Ethereum underperforming?\n\nWhat's particularly puzzling about Ethereum this year is that it's just so hard to pinpoint exactly why it's underperforming Bitcoin and other top cryptos. Heading into 2023, Ethereum seemed to be riding a wave of momentum after pulling off The Merge, which was widely hailed as one of the greatest technical achievements ever in the blockchain world. As a result of The Merge, Ethereum changed its overall blockchain infrastructure, all with the goal of reducing transaction fees, boosting transaction processing speeds, and improving overall efficiency.\n\nBut a number of issues have popped up throughout this year. For one, overall activity on the Ethereum blockchain seems to be down and that's not a good sign for future growth. Case in point: Bitcoin recently passed Ethereum for the first time ever in terms of 24-hour non-fungible token (NFT) sales volume, an area Ethereum has always dominated. And Total Value Locked (TVL), which measures activity on the blockchain, also recently reached a 12-month low, a potential sign of Ethereum's weakening position in decentralized finance. These might just be short-term blips on the radar, but they are still concerning.\n\nThere have been regulatory concerns, too, such as those related to staking activity on Ethereum's brand-new proof-of-stake blockchain. The primary concern is that the SEC's willingness to go after major cryptocurrency exchanges for their staking activity, as we saw earlier this year, will eventually erode the attractiveness of Ethereum as an investment option.\n\nMoreover, The Merge is not having the sort of breakthrough impact it was supposed to have, as measured by transaction fees and transaction processing speeds. For example, transaction fees for relatively straightforward activities, such as buying a new NFT, can sometimes run into the hundreds of dollars. And the main Ethereum blockchain can still only handle 20 to 30 transactions per second, a far cry from the 1 million transactions per second promised years ago.\n\nEthereum vs. Bitcoin\n\nPerhaps the best explanation, though, might be that investors are almost single-mindedly focused on Bitcoin at the moment. Just about everyone seems to be looking ahead to the imminent launch of the first-ever spot Bitcoin exchange-traded fund (ETF), and what that could mean for the broader crypto market. Ethereum almost feels like an afterthought right now.\n\nPerhaps as a result, the longtime strong correlation between Ethereum and Bitcoin appears to be weakening. Until mid-March, the correlation between Bitcoin and Ethereum was nearly 0.95. That's almost a perfect 1-to-1 match in terms of performance. But now the 90-day correlation between the two has dipped to the 0.8 level.\n\nEthereum vs. other altcoins\n\nIn addition, many other cryptos appear to be passing Ethereum right now. That's of particular concern in the case of Solana (SOL 1.82%), which is arguably Ethereum's greatest rival right now in the Layer-1 blockchain space. Solana is up a stunning 325% year to date. While Solana has its own fair share of regulatory and technical issues, investors have largely been willing to shrug them off due to Solana's perceived growth prospects. Solana's new \"crypto phone\" is just one of the most exciting projects.\n\nThese shifting investor perceptions of Ethereum are having an impact on institutional money flows. Quite simply, large institutional investors appear to be taking their money out of Ethereum and moving it into Solana. In 28 of 32 weeks this year, Solana has seen net positive inflows, according to CoinShares, which tracks inflows and outflows into different cryptocurrencies. In contrast, Ethereum has seen outflows. And that has led to CoinShares calling Solana \"the altcoin of choice\" for institutional investors right now.\n\nCan Ethereum bounce back?\n\nAt the end of the day, the decision whether or not to invest in Ethereum comes down to your view of its long-term growth prospects. Ethereum is still the clear leader in just about every niche or sector of the blockchain world and it's one of the few cryptos that seems to have the implicit support of federal regulators. Notably, SEC Chair Gary Gensler has always stopped short of calling Ethereum a \"security.\" And it's not like analysts have completely given up on Ethereum. Standard Chartered Bank, for example, just put out an aggressive $8,000 price target for Ethereum.\n\nGoing forward, I'm keeping a close eye on how Ethereum fends off the threat from rival Solana. This one factor could end up having the greatest impact on Ethereum's long-term growth prospects. If Ethereum is unable to keep up with Solana and other Layer-1 blockchains, that could have a huge impact on my decision of whether or not to invest in Ethereum going forward."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tZGVzdGluZWQtZm9yLTEwMDAwL9IBRmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tZGVzdGluZWQtZm9yLTEwMDAwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Breakout: Analyst Explains Why The King Of The Altcoins Is Destined For $10,000 - NewsBTC",
        "content": "Crypto analyst Tony The Bull, founder of CoinChartist, has revealed why Ethereum is destined to cross $10,000. According to the crypto analyst, the king of the altcoins has its top just right after $10,000 using the Fibonacci extension.\n\nHow Ethereum Gets To $10,000\n\nIn the latest issue of the CoinChartist newsletter, crypto analyst Tony The Bull used the Hurst Cycle Theory which showed cyclical reoccurrence across the ETH/USDT chart. As the analyst explains, the uptrend noticed in the Ethereum charts has usually come from the accumulation of the token.\n\nTony points out that this accumulation has always taken place “at the bottom boundary of the Ending Diagonal pattern.” The analyst further added that “Since intracycle harmonics come in twos and threes, three cycles should complete one larger cycle that concludes with a breakdown of this Ending Diagonal pattern.”\n\nTaking this Ending Diagonal Pattern into account, Tony reveals that the top of the pattern puts the ETH price at $10,000. However, this is not the only pattern that suggests that the king of the altcoins will end up beating the $10,000 level.\n\nHe also pointed out that the previous ETH rally had started at the 0.5 Fibonacci extension and reached 1.414 the last time that the ETH price peaked. The analyst notes that Ethereum is once again at the 0.5 Fibonacci extension which led to a break out in the price and the same could happen here. But this time, the target is able $10,000 if the 1.414 Fib is reached again.\n\nETH price reaches $2,019 | Source: ETHUSD on Tradingview.com\n\nETH Moves Into Overbought Territory\n\nOne interesting fact that the analyst points out in the newsletter is the fact that Ethereum is currently in overbought territory. However, where this would usually signal a bearish reversal coming for the digital asset, Tony does not believe this is the case here.\n\nRather, he explains that a cryptocurrency being overbought usually means that it is “a powerfully trending asset.” So even though it could lead to a reversal, it does not invalidate the bullishness of that digital asset.\n\nHe also mentions that “the Stochastic has confirmed a 1M above 80 on the Stock.” Now, whenever this has happened for Ethereum, it has often resulted in a pushup for the price. At the same time, ETH is moving to the upper Bollinger Band. Both of these setups could paint a bullish breakout for the asset.\n\nSource: CoinChartist\n\nHowever, the analyst warns that for this bullish scenario to play out, the Ethereum price would have to close above $2,450 this month. If the Stochastic moves back below 20, it could invalidate it and trigger a downtrend. “But if ETHBTC can push back above 20 this will generate a buy signal on the 1M Stochastic and kickstart Ether’s over-performance above Bitcoin,” Tony concluded.\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZW5nLmFtYmNyeXB0by5jb20vdGhlLWR5bmFtaWNzLW9mLWV0aGVyZXVtcy1zb2FyaW5nLWZlZXMtYW5kLWZsdWN0dWF0aW5nLWZvcnR1bmVzL9IBXmh0dHBzOi8vZW5nLmFtYmNyeXB0by5jb20vdGhlLWR5bmFtaWNzLW9mLWV0aGVyZXVtcy1zb2FyaW5nLWZlZXMtYW5kLWZsdWN0dWF0aW5nLWZvcnR1bmVzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "The dynamics of Ethereum’s soaring fees and fluctuating fortunes - AMBCrypto English",
        "content": "Ethereum fees per transaction rose to its highest level in months.\n\nETH Price and volume have gradually declined in the past few days.\n\nThe rise in Ethereum [ETH] prices caused a predictable increase in daily transaction fees. As these daily fees increased, they had a notable effect on the overall network fee as well.\n\nEthereum fee per transaction rises\n\nIn a recent Santiment post, it was highlighted that Ethereum transaction fees reached their highest point since July.\n\nAMBCrypto’s analysis of the fee chart revealed a peak of $5.72 per transaction on 13th November. The surge in fees coincided with the upward movement in Ethereum’s price starting around 22nd October.\n\nHowever, as of the latest update, the fee per transaction has decreased to approximately $3.61. Also, this decline suggests a reduction in the number of transactions, contributing to the fee decrease.\n\nDespite this drop, it’s noteworthy that the fees remain within the range of the highest observed in the past three months.\n\nNetwork fees see highest volume in months\n\nThe increase in Ethereum’s transaction fee had a favorable impact on network fees.\n\nAccording to the analysis of the fee chart on Crypto Fees, the network fees began to climb around 25th October, escalating from approximately $1 million to over $5 million.\n\nDespite some fluctuations, the overall trend indicated a consistent upward movement in fees. The chart highlighted a peak in network fees, surpassing $12 million in recent months.\n\nHowever, at the time of this update, the network fee decreased to approximately $9.2 million.\n\nEthereum volume and price dips\n\nThe decline in both network fees and transaction fees can be attributed to a decrease in trading volume and a drop in ETH price.\n\nAMBCrypto’s examination of the volume chart on Santiment revealed a notable decrease from the levels observed during the recent price surge.\n\nThe volume, which was over $20 billion a few days ago, has since fallen to around $12.6 billion at the time of this writing. CoinMarketCap data also indicated a more than 6% decline in volume over the last 24 hours.\n\nHow much are 1,10,100 ETHs worth today\n\nAdditionally, AMBCrypto’s assessment of the daily price trend highlighted a downward trajectory for Ethereum. The chart indicated a nearly 6% loss in ETH’s value over the past few days, with minimal gains.\n\nAs of the latest update, ETH was trading at approximately $1,980. This combination of reduced trading activity and a declining price suggests a waning sense of excitement in the market. Also, it could potentially explain the drop in both transaction fees and total network fees."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtbWlnaHQtZHJvcC10by0xNzAwLWlmLWl0LWJyZWFrcy10aGlzLWtleS1sZXZlbNIBT2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtbWlnaHQtZHJvcC10by0xNzAwLWlmLWl0LWJyZWFrcy10aGlzLWtleS1sZXZlbD9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) Might Drop to $1,700 If It Breaks This Key Level - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe second largest cryptocurrency by market capitalization, Ethereum (ETH), might risk a 16% drop from its current price if a critical price level is lost.\n\nAdvertisement\n\nAli, a crypto analyst, spots a sell signal presented by TD Sequential on the Ethereum three-day chart as the second largest cryptocurrency tests a major resistance zone between $2,000 and $2,150 within an ascending triangle pattern.\n\n#Ethereum | TD Sequential is flagging a sell signal on the $ETH 3-day chart! This comes as #ETH tests a major resistance zone between $2,000 and $2,150, aligning with the x-axis of an ascending triangle pattern.\n\n\n\nA pullback from this resistance level could lead to a dip toward… pic.twitter.com/oKGCT6tVrj — Ali (@ali_charts) November 15, 2023\n\nA break below this resistance level could lead to a dip toward the triangle's hypotenuse at $1,700 before the uptrend resumes.\n\nAli identified the $2,150 price point as the crucial level to watch, as a sustained three-day candlestick close above this level might offset the bearish outlook.\n\nAt the time of writing, ETH was down 0.75% in the last 24 hours to $2,019. This is as the crypto market held in a mixed price reaction after softer-than-expected inflation stats released on Tuesday.\n\nThe Consumer Price Index (CPI) increased by 3.2% in the year to October, according to the Bureau of Labor Statistics' latest release. Economists predicted the index would rise 3.3% year over year, down from 3.7% published last month.\n\nThe Federal Reserve of the United States opted to hold interest rates steady this month at a target range of 5.25% to 5.50%, its second pause in a row.\n\nAs the overall crypto market remains flat, Santiment, an on-chain analytics start-up, advises keeping an eye on the rising social volume for BTC and ETH, as well as large caps, as more traders seem to be getting interested in markets again.\n\nMeanwhile, Ethereum's fees have risen back to their highest levels in four months as network usage grew. ETH fees rose to $5.72 per transaction on Sunday, the highest since July 4, Santiment reported."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LnNjbWFnYXppbmUuY29tL2JyaWVmL2V4cGxvaXRhdGlvbi1vZi1ldGhlcmV1bS1mdW5jdGlvbmFsaXR5LWRyYWlucy02MG0td29ydGgtb2YtY3J5cHRv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Exploitation of Ethereum functionality drains $60M worth of crypto - SC Media",
        "content": "Nearly 67K impacted by U-Haul data breach Leading U.S. moving truck, trailer, and self-storage rental firm U-Haul had data from almost 67,000 customers in the U.S. and Canada exfiltrated following a cyberattack against one of its systems in early December, according to The Register."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ibGFja3JvY2stYmxrLXNlZWtzLWNyeXB0by1leHBhbnNpb24tMTQwMTAwNDg5Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "BlackRock (BLK) Seeks Crypto Expansion, Files for Ethereum ETF - Yahoo Finance",
        "content": "BlackRock, Inc. BLK expands cryptocurrency exposure as the firm files for a spot Ethereum exchange-traded fund (ETF), named iShares Ethereum Trust, with U.S. Securities and Exchange Commission (SEC). The filing was submitted by Nasdaq exchange on behalf of the asset manager.\n\n\n\nFollowing the announcement of this filing, the price of Ethereum surged to its highest level this year before pulling back afterward.\n\n\n\nThe Ethereum ETF, if approved, will be the first of its kind in the United States, allowing investors to gain exposure to Ethereum without having to purchase the cryptocurrency directly.\n\n\n\nThe ETF would track the spot price of Ethereum, meaning that investors would be investing in the price of Ethereum itself rather than in a company that is involved in the Ethereum ecosystem.\n\n\n\nThe move by BLK has once again injected optimism into the crypto markets while initiating discussions around SEC’s regulatory approach to cryptocurrency-based ETFs.\n\n\n\nThe jump in the price of Ethereum is similar to Bitcoin rally experienced this June when BLK had filed an application with SEC to offer a spot Bitcoin ETF.\n\n\n\nIn July, SEC said that the applications filed by BLK and other asset managers for spot Bitcoin ETF were inadequate because the filings did not have enough detail with respect to the “surveillance-sharing agreements”. BLK’s Bitcoin ETF is expected to be approved by SEC by the first quarter of 2024.\n\n\n\nNotably, in June, BLK became the first asset manager to file for the spot Bitcoin ETF, paving the way for a wave of filings by other asset managers like Fidelity, Invesco IVZ and WisdomTree WT.\n\n\n\nThe applications had come at a time when the cryptocurrency industry was already battling criticism by SEC over alleged securities law violations.\n\n\n\nCoinbase and the world’s largest crypto exchange, Binance, were already sued by SEC, alleging securities violations.\n\n\n\nThus, SEC had proposed new custody rules that would place additional responsibilities on asset managers to make sure that customers’ assets were kept in properly segregated accounts.\n\n\n\nIn October 2021, IVZ withdrew its original application for a Bitcoin ETF (made earlier in 2021) because of regulatory headwinds within the industry. At that time, SEC was resistant in approving such funds due to concerns over potential fraud and market manipulation.\n\n\n\nLikewise, in October 2022, WT’s application for the launch of the WisdomTree Bitcoin Trust was not approved by SEC on account of insufficient investor protection.\n\n\n\nHowever, the fact that BLK is filing for a spot Ethereum ETF, following an application for a spot Bitcoin ETF, shows that this asset manager wants to expand its presence in the cryptocurrency markets, signaling a shift in the regulatory landscape.\n\n\n\nOver the past six months, shares of BLK have gained 2.6% compared with the industry’s 8.9% growth.\n\n\n\nStory continues\n\nZacks Investment Research\n\n\n\nImage Source: Zacks Investment Research\n\nCurrently, BlackRock carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nBlackRock, Inc. (BLK) : Free Stock Analysis Report\n\nInvesco Ltd. (IVZ) : Free Stock Analysis Report\n\nWisdomTree, Inc. (WT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2V0aGVyZXVtLXNvbGFuYS1sZWFkLWRlZmktc3VyZ2UtYXMtdHZsLWFuZC1kZXgtYWN0aXZpdHktc29hci_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Ethereum and Solana lead DeFi surge as TVL and DEX activity soar - CryptoSlate",
        "content": "The DeFi sector has experienced a significant increase in both activity and token prices, primarily driven by Bitcoin’s October rally. Central to understanding this landscape is the concept of Total Value Locked (TVL) and decentralized exchange (DEX) volumes, two critical metrics that offer insights into the health and trajectory of DeFi protocols.\n\nTVL, the aggregate value of assets deposited in DeFi protocols, serves as a barometer for sector health and investor sentiment. CryptoSlate analysis found an interesting growth pattern across various chains. Ethereum, the frontrunner with $25.336 billion in TVL, has seen a 31.14% increase over the past month, cementing its dominant position in the DeFi space. Solana, though lower in overall TVL, showed the highest growth rate at 89.31%. Notably, all chains recorded positive growth over the month, indicating a robust expansion across the sector.\n\nThe number of active users on these chains offers additional insights. Despite its lower TVL, Tron boasts a significantly larger active user base of 1.69 million, which could result from a more retail-oriented user landscape. Conversely, Ethereum’s lower active user count than its TVL might indicate a higher engagement of institutional or sophisticated, high-net-worth investors.\n\nThe market cap to TVL ratio is another critical metric, shedding light on the market’s perception of a chain’s value. Ethereum’s ratio of 9.72 suggests a mature market. In contrast, Solana’s higher ratio of 43.49 indicates either potential growth opportunities or an undervalued ecosystem, warranting closer investor scrutiny.\n\nName Protocols Active Users 1D Change 7D Change 1M Change TVL Stablecoins 24h Volume 24h Fees Market Cap to TVL ratio 1.Ethereum 946 304,493 -0.12% +6.50% +31.14% $25.473b $64.929b $1.718b $7.27m 9.63 2.Tron 26 1.69m -1.34% +5.04% +25.14% $8.291b $47.455b $11.33m $1.66m 1.13 3. BSC 663 945,060 +0.22% +1.70% +12.58% $2.996b $4.992b $429.32m $348,294 12.62 4.Arbitrum 481 133,870 -0.38% +10.90% +25.21% $2.095b $1.844b $925.94m 0.66 5.Polygon 488 +1.28% +8.10% +21.93% $852.6m $1.17b $369m $87,858 10.06 6.Optimism 197 91,508 -0.12% +11.94% +25.87% $739.39m $576.85m $109.27m 2.11 7.Avalanche 344 33,880 -1.04% +12.63% +28.18% $615.82m $1.07b $140.2m $36,244 9.73 8.Solana 115 -1.55% +23.58% +89.31% $530.8m $1.513b $425.62m $108,773 42.62\n\nTable showing the TVL, active users, volume, and market cap to TVL ratio for the 8 largest L1 chains on Nov. 14, 2023 (Source: DeFi Llama)\n\nDEX volumes provide a lens into the trading activity within these ecosystems. Ethereum leads with a 24-hour volume of $1.718 billion, accounting for a substantial portion of the total market. The rapid growth in DEX volumes on platforms like Solana and Polygon, with increases of 81.35% and 86.32%, respectively, reflects growing user adoption and confidence.\n\nName Weekly change Volume (24h) Volume (7d) TVL % of total Cumulative volume 1. Ethereum +27.29% $1.718b $10.65b 5.941b 37.12% $1.888t 2. Arbitrum +58.15% $925.94m $4.415b 1.127b 20.00% $138.902b 3. BSC +7.54% $429.32m $2.752b 1.577b 9.27% $757.4b 4. Solana +81.35% $425.62m $2.571b 185.78m 9.19% $54.616b 5. Polygon +86.32% $369m $1.711b 0 7.97% $101.421b Table showing trading volumes and total value locked for decentralized exchanges (DEXs) across the five largest L1 chains on Nov. 14, 2023 (Source: DeFi Llama)\n\nThe observed trends in TVL, active users, and DEX volumes show a market booming with activity. Ethereum continues to lead, both in terms of TVL and DEX volume, signaling strong investor confidence and market dominance.\n\nHowever, the rapid growth of newer platforms like Solana and Polygon suggests a diversifying landscape, with different chains catering to varied user needs and investment profiles. The market cap to TVL ratios further confirms the growth potential of lower market cap chains, with Solana and Polygon positioning themselves for future growth."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMTEvMTUvZXRoZXJldW0tcGxhdGZvcm0taW5mdXJhcy1zdGVwLXRvd2FyZC1kZWNlbnRyYWxpemF0aW9uLWluY2x1ZGVzLW1pY3Jvc29mdC10ZW5jZW50L9IBf2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMTEvMTUvZXRoZXJldW0tcGxhdGZvcm0taW5mdXJhcy1zdGVwLXRvd2FyZC1kZWNlbnRyYWxpemF0aW9uLWluY2x1ZGVzLW1pY3Jvc29mdC10ZW5jZW50L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Platform Infura's Step Toward Decentralization Includes Microsoft, Tencent - CoinDesk",
        "content": "Infura, the crypto infrastructure firm from Consensys, is one of the most popular solutions for developers to hook up applications to blockchains. The platform has grown into a core pillar of the blockchain world – powering many of the largest apps on Ethereum and a variety of other blockchains. But it's also become an object of criticism."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vd3d3LnBheW1lbnRzam91cm5hbC5jb20vdGhlLWxvZ2ljLWJlaGluZC1ibGFja3JvY2tzLWV0aGVyZXVtLWV0Zi_SAU1odHRwczovL3d3dy5wYXltZW50c2pvdXJuYWwuY29tL3RoZS1sb2dpYy1iZWhpbmQtYmxhY2tyb2Nrcy1ldGhlcmV1bS1ldGYvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "The Logic Behind BlackRock’s Ethereum ETF - PaymentsJournal",
        "content": "The price of Ethereum jumped by 10% to surpass the $2,000 mark last week, after the world’s largest asset manager, BlackRock, filed to launch an ETF, the blockchain’s native currency. If it makes it to market, the ETF will likely have the effect of attracting billions of dollars in new investment to the cryptocurrency. BlackRock’s argument to the SEC about why the new vehicle should be approved is simple: Crypto investors deserve the kind of protection and security that a major asset manager can provide.\n\nThe Nasdaq Stock Market filed with the SEC to list BlackRock’s ETF last week. “To this point, the lack of an ETP [exchange-traded product] that holds spot ETH exposes U.S. investor assets to significant risk because investors that would otherwise seek cryptoasset exposure through a spot ETH ETP are forced to find alternative exposure through generally riskier means,” Nasdaq said in its filing. “Approval of a spot ETH ETP would represent a major win for the protection of U.S. investors in the cryptoasset space.”\n\nAn Antidote for Ethereum’s Problems\n\nEthereum is the world’s second largest cryptocurrency, after Bitcoin. The positive response to the BlackRock registration may help the currency move past some of the concerns that Ethereum investors have noted over the past few years. Ethereum’s notorious transaction costs, known as gas fees, have soared along with the increased activity that has come with more trading. Ethereum’s move to a proof-of-stake system last year was supposed to ease its price and congestion issues, but the BlackRock ETF may exacerbate these problems.\n\nOn the other hand, there are many benefits the currency could derive from working with the world’s largest asset manager. That may be why BlackRock emphasized safety and reliability in its filing with the SEC. Among other things, Ethereum knows that its customers would benefit from increased stability.\n\n“Institutional investments and support will not only further solidify the industry, but also help with the overall downside volatility over time,” said Joel Hugentobler, Cryptocurrency Analyst at Javelin Strategy & Research. “It will make a big difference in risk management and retirement planning if the volatility can be dampened.”\n\nIn addition to the Ethereum offering, BlackRock also has filed an application with the SEC for a spot bitcoin ETF. CEO Larry Fink said the company wants to diversify its crypto offerings, noting that crypto will “transcend any one currency.”"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL2NvaW5wZWRpYS5vcmcvcHJpY2UtYW5hbHlzaXMvZXRoZXJldW0tY291bGQtdHJpZ2dlci1hLW1ham9yLWxpcXVpZGF0aW9uLXdoaWxlLXRlc3RpbmctY3J1Y2lhbC1zdXBwb3J0LWhlcmVzLWV0aC1wcmljZXMtbmV4dC1tb3ZlL9IBjQFodHRwczovL2NvaW5wZWRpYS5vcmcvcHJpY2UtYW5hbHlzaXMvZXRoZXJldW0tY291bGQtdHJpZ2dlci1hLW1ham9yLWxpcXVpZGF0aW9uLXdoaWxlLXRlc3RpbmctY3J1Y2lhbC1zdXBwb3J0LWhlcmVzLWV0aC1wcmljZXMtbmV4dC1tb3ZlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Could Trigger A Major Liquidation While Testing Crucial Support! Here’s ETH Price’s Next Move - Coinpedia Fintech News",
        "content": "Shayan is a digital nomad and a professional journalist. He delivers high-quality engaging articles to Coinpedia through his in-depth research and analysis.\n\nDespite Ethereum’s (ETH) significant price increases towards $2,100, triggered by BlackRock’s application for a spot ETH ETF, there is growing concern about a potential profit-taking downturn as the price approaches a critical support line. Market analysts observe that investors who initiated long positions during the recent price rally are showing signs of impatience as the bullish momentum for ETH fades. Consequently, a drop below this support line could bring a substantial sell-off in the market.\n\nEthereum’s NVT Ratio Still Favors Bulls\n\nOver the last 24 hours, there has been a significant long liquidation after the ETH price failed to hold its momentum near $2,100. As a result, long-position holders liquidated over $7.2 million worth of positions as the price went against their bullish bets.\n\nHowever, there’s a bullish hope that might prevent a sudden decline as the NVT ratio still favors the bulls. Data from IntoTheBlock reveals that the NVT ratio (Network Value to Transaction) has been dropping over the past few days.\n\nThe “NVT ratio” serves as a metric comparing Ethereum’s market capitalization with its transaction volume. A high NVT ratio indicates that Ethereum’s market value significantly surpasses its network’s coin transaction capacity.\n\nThis difference could imply that the altcoin is currently overvalued. Conversely, a low NVT ratio suggests that Ethereum might be undervalued, as it denotes a relatively high transaction volume on the blockchain in comparison to its market cap.\n\nThe ratio has decreased from a peak of 66.91 to a current low of 47, indicating that as increasing numbers of holders engage in ETH transactions, the price of ETH is becoming more affordable.\n\nInterestingly, the long/short ratio currently trades at 0.99. This closely contested scenario reflects a nearly even split, with 49.8% of positions being long and 50.2% being short, highlighting a tough war in the market.\n\nWhat’s Next For ETH Price?\n\nEther recently bounced back from the key $2020 mark, suggesting that bulls are attempting to establish this level as a new support. However, bulls continue to struggle to hold momentum above $2,100. As of writing, ETH price trades at $2,054, declining over 0.5% from yesterday’s rate.\n\nThe buyers are gearing up for another push to breach the $2,200 barrier. If successful, the ETH price could gain significant momentum and potentially surge towards the $2,453 mark. Another push will send the price toward $3,000, especially since there’s no major resistance in that range.\n\nOn the flip side, the bears are preparing to strongly defend the $2,200 level. A reversal from this point could lead to a period of consolidation for the price, oscillating between $2,000 and $2,100. A negative shift in the short-term trend could be triggered if the price not only falls below $2,000 but also stays below it. Under such a situation, the price might plummet toward the 200-day Exponential Moving Average (EMA), currently at $1,860."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMipgFodHRwczovL2NyeXB0b25ld3MuY29tL25ld3MvZ2V0LWFoZWFkLW9mLXRoZS1ldGhlcmV1bS1wcmljZS1leHBsb3Npb24td2l0aC10aGUtZXRoZXRmLXRva2VuLWJlZm9yZS1ibGFja3JvY2stZXRoZXJldW0tZXRmLWxhdW5jaGVzLXByaWNlLXB1bXBzLTQwMC1pbi1lYXJseS1hY3Rpb24uaHRt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Get Ahead of the Ethereum Price Explosion With the ETHETF Token Before BlackRock Ethereum ETF Launches ... - Cryptonews",
        "content": "Get Ahead of the Ethereum Price Explosion With the ETHETF Token Before BlackRock Ethereum ETF Launches – Price Pumps 400% in Early Action\n\nA new cryptocurrency launched today called $ETHETF Token and it is the go-to digital asset to capitalize on approval of a spot Ethereum ETF from fund giant BlackRock.\n\nLaunched at 1pm GMT on Uniswap the price of the coin has rocketed 186% within the first 10 minutes of trading, currently priced at $0.02834. $ETHETF could easily 10x today as news of the launch spreads.\n\nNews that the world’s largest asset manager is planning to launch a spot Ethereum ETF, sent the price of ETH rocking through the important $2,000 level.\n\nBlackRock’s move has added to the excitement surrounding the likely approval of the first spot Bitcoin ETF to be made available to investors in the US.\n\nOn November 9, 2023, the official filing for BlackRock’s Ethereum ETF was made with the US Securities and Exchange Commission (SEC) by Nasdaq. A few days before, BlockRock had registered a corporate entity in Delaware named iShares Ethereum Trust.\n\nWhen the Delaware news broke, the price of ETH shot up 3% and then pumped again when the filing was confirmed. Ethereum is currently trading at $2,048, gaining 10% since the Delaware registration and the SEC filing took place.\n\nEthereum is the most-used blockchain for running applications based on smart contracts and as such is the base layer of Web3 decentralized applications. There are many other blockchain ecosystems vying to be Ethereum killers, but none comes close to Ethereum.\n\nBut you don’t have to wait for the approval by the US Securities and Exchange Commission (SEC) and their subsequent launch, because ETHETF is already trading on decentralized exchanges, enabling savvy investors to get exposure to the Ethereum ETF investment theme and capture the positive returns that have already started to flow.\n\nAn Ethereum ETF will take crypto mainstream and ETHETF Token lets you get in early\n\n\n\nJust as the approval of spot Bitcoin ETF will provide unprecedented validation for the top digital currency, approval of an Ethereum ETF will have a similar effect.\n\nBy providing a regulated way to gain exposure to the crypto asset class, exchange-traded funds promise to transform the existing investment landscape.\n\nExchange-traded funds track the price of an underlying asset by replicating its price performance. This can often be achieved by mirroring an index such as the S&P500. To achieve this end, a fund would need to buy a weighting of the 500 companies that comprise the S&P500 or use derivatives to achieve the same result.\n\nApplying that to ETH, it would mean issuers must buy the asset on the open market or over-the-counter, thus increasing the demand for the token.\n\nETFs exploded onto the financial scene when the first gold products appeared. Gold was the ideal candidate for the ETF treatment. By tracking an index of the gold price ordinary people were able to gain exposure to the precious metal without having to worry about custody expenses and accessing liquidity to trade their bullion.\n\nWhat ETFs have done for commodities, equities, fixed income and other asset classes, they can also do for crypto. Opening up cheap and regulated access to the two most valuable cryptocurrencies could see a wall of new money flowing into the markets.\n\nETHETF price is head for the moon as Ethereum goes mainstream with ETF approval\n\n\n\nWelcoming Ethereum into the world of ETFs is the $ETHETF Token. If Bitcoin’s defining value proposition is its digital gold store of value properties, then Ethereum can reasonably claim to be the king of dApp blockchains.\n\nAs might be expected, $ETHETF is an ERC20-compliant asset, which means it runs on the Ethereum blockchain. This design decision means the coin is linked to the fortunes of the Ethereum ecosystem, providing investors with a foothold inside the ecosystem of the premier blockchain platform.\n\nHowever, to incentivize holding the token and to boost its price, each purchase attracts a 2% burn tax.\n\nBurning 2% of the purchase amount eats into the total supply of 1 billion, thereby enhancing the value of the remaining tokens.\n\nIn addition to the ERC20 connection to Ethereum, the coin also builds into its tokenomics a direct way of celebrating the approval of a spot Ethereum ETF – the 2% burn tax will be lifted when the fund is approved.\n\nFinally, the token’s debut on the Uniswap decentralized exchange is a fair launch as there is no team allocation. The tokenomics allocates 95% of supply to DEX liquidity and 5% for CEX (centralized exchange) listings.\n\nTo buy the token, simply connect your crypto wallet to the DEX, copy and paste in the contract address to make sure you are buying the correct coin and then make your purchase. Be sure to have at least $20 spare in your wallet to pay the transaction gas fee.\n\nBuy $ETHETF todayDisclaimer: Crypto is a high-risk asset class. This article is provided for informational purposes and does not constitute investment advice. You could lose all of your capital."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vZW5nLmFtYmNyeXB0by5jb20vZXRoZXJldW0tYnVsbHMtYXJlLW9uLXRoZS1tb3ZlLXdoYXQtbm93L9IBRmh0dHBzOi8vZW5nLmFtYmNyeXB0by5jb20vZXRoZXJldW0tYnVsbHMtYXJlLW9uLXRoZS1tb3ZlLXdoYXQtbm93L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Ethereum bulls are on the move – What now? - AMBCrypto English",
        "content": "ETH prices surged as traders became hopeful.\n\nGas usage on ETH rose while overall interest in the network grew.\n\nEven though Ethereum [ETH] was late to the crypto rally, over the past few days, ETH prices have more than compensated for the delay.\n\nBulls take the lead\n\nETH saw an increase in Block trades in the last few days, totaling 60,000 options and making up 40% of the day’s volume, valued at $120 million.\n\nThe primary trades were Dec-calls, featuring a significant number of naked-buy ITM options, including a large order nearing $50 million, potentially closing out a previous market maker’s position.\n\nIn the ongoing bull market, some significant investors established long positions in October, reaping profits. The bull market persists, and these major investors are yet to close their positions, maintaining their optimistic stance.\n\nThe heightened trading activity, particularly in December calls and large orders, could influence Ethereum’s price dynamics. If the bullish sentiment continues, it may lead to an upward trend in ETH prices.\n\nHowever, the market’s reaction to such large trade and options activity can also introduce volatility, impacting short-term price movements.\n\nMarket makers closing out positions or adjusting strategies could contribute to increased volatility. Traders need to stay vigilant, considering these factors when making decisions.\n\nEthereum’s price performance is interconnected with market sentiment, and ongoing trends could shape the trajectory of ETH in the near term\n\nBack on the business day, ETH began to see more Block trade again, with 60,000 options accounting for 40% of the day's total volume, with a notional value of $120 million.\n\nThe main trade is Dec-calls, the largest of which included a large number of naked-buy ITM options, with a… pic.twitter.com/usnN0NK864 — Greeks.live (@GreeksLive) November 13, 2023\n\nState of ETH\n\nAt press time, ETH was trading at $2,112.79. It had grown by 9.6% in the last 24 hours. This surge might draw more investors, possibly driving prices higher.\n\nIts network growth also spiked. This indicated that new addresses were showing interest in the token.\n\nMoreover, the velocity of ETH had also grown. A rising velocity meant that the number of times ETH was being transferred increased.\n\nThese factors bode well for ETH. The possibility of ETH reaching even higher may become a reality if these bullish trends continue.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nIn terms of the state of the network, the gas used on the network has remained high. This implied that activity on the network was high and interest in the protocol was soaring.\n\nHigh usage of the Ethereum network could help with ETH’s price, during volatile times."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2V0aGVyZXVtcy1ibHVlLWNoaXAtZGVmaS10b2tlbnMtcG9pc2VkLWZvci1ncm93dGgv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Ethereum's blue chip DeFi tokens poised for growth - CryptoSlate",
        "content": "What is CryptoSlate Alpha? A web3 membership designed to empower you with cutting-edge insights and knowledge, powered by Access Protocol. Learn more ›\n\nConnected to Alpha Welcome! 👋 You are connected to CryptoSlate Alpha. To manage your wallet connection, click the button below.\n\nImportant: You must lock a minimum of 20,000 ACS If you don't have enough, buy ACS on the following exchanges: Coinbase Kucoin Orca\n\nConnect via Access Protocol Access Protocol is a web3 monetization paywall. When users stake ACS, they can access paywalled content. Learn more ›\n\nDisclaimer: By choosing to lock your ACS tokens with CryptoSlate, you accept and recognize that you will be bound by the terms and conditions of your third-party digital wallet provider, as well as any applicable terms and conditions of the Access Foundation. CryptoSlate shall have no responsibility or liability with regard to the provision, access, use, locking, security, integrity, value, or legal status of your ACS Tokens or your digital wallet, including any losses associated with your ACS tokens. It is solely your responsibility to assume the risks associated with locking your ACS tokens with CryptoSlate. For more information, visit our terms page."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8xMS8xNS9ibG9ja2NoYWluLXN0YXJ0dXAta2ludG8tcGxhbnMtZmlyc3Qta3ljZC1ldGhlcmV1bS1sYXllci0yLWJsb2NrY2hhaW4tYWZ0ZXItcmFpc2luZy01bS_SAYgBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMTEvMTUvYmxvY2tjaGFpbi1zdGFydHVwLWtpbnRvLXBsYW5zLWZpcnN0LWt5Y2QtZXRoZXJldW0tbGF5ZXItMi1ibG9ja2NoYWluLWFmdGVyLXJhaXNpbmctNW0vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Blockchain Startup Kinto Plans 'First KYC'd' Ethereum Layer-2 Network After Raising $5M - CoinDesk",
        "content": "\"We believe that a fully KYC'd layer 2 on top of Ethereum is an inevitability, and we have extremely strong conviction that Kinto is the right team to execute this vision,\" Alex Klokus, co-founder and managing partner at Kyber Capital Crypto, said in a statement."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jYm9lLWxhdW5jaC1tYXJnaW4tZnV0dXJlcy10cmFkaW5nLTA1MzYyMTg0MC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "CBOE Will Launch Margin Futures Trading for Bitcoin and Ethereum in January 2024 - Yahoo Finance",
        "content": "CBOE Will Launch Margin Futures Trading for Bitcoin and Ethereum in January 2024\n\nCboe Digital, a regulated crypto-native exchange and clearinghouse, has announced the launch date for Bitcoin (BTC) and Ethereum (ETH) margin futures trading to be on January 11, 2024. This positions Cboe Digital as the first platform in the United States to offer both spot and leveraged derivatives trading on a single platform, with the aim of enhancing capital efficiency by allowing futures trading without requiring full collateral.\n\nCboe Digital President John Palmer said:\n\n“Futures have long served as valuable hedging instruments in the traditional financial markets, and we couldn't be more excited to extend access to this tool further into the digital assets markets.”\n\nHe also mentioned that the introduction of derivatives is expected to bring additional liquidity and hedging opportunities, marking a crucial step in the ongoing development of the market.\n\nThe platform, catering to both individuals and institutions, has received support from eleven firms, including both crypto and traditional financial entities such as B2C2, BlockFills, CQG, Cumberland DRW, Jump Trading Group, Marex, StoneX Financial, Talos, tastytrade, Trading Technologies and Wedbush.\n\nCboe Digital obtained approval for margin futures trading from the U.S. Commodity Futures Trading Commission in June, operating within traditional futures market structures and regulatory frameworks. The platform plans further expansion into physically delivered products, pending regulatory approval.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zZWMtZGVsYXlzLWRlY2lzaW9uLWdyYXlzY2FsZS1ldGhlcmV1bS0wNTIzNTU2NzIuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "SEC Delays Decision on Grayscale Ethereum Futures Application - Yahoo Finance",
        "content": "SEC Delays Decision on Grayscale Ethereum Futures Application\n\nThe U.S. Securities and Exchange Commission (SEC) has communicated a postponement in its decision-making process for the Grayscale Ethereum futures exchange-traded fund (ETF). Grayscale Investments, a major player in the digital asset management sector, submitted the ETF request in September, aiming to provide investors with exposure to the anticipated future price movements of Ethereum.\n\nKnown for routinely extending timelines for crypto-related product decisions, the SEC clarified that it needs additional time to thoroughly assess the proposed changes in regulations and address related issues. While Grayscale's application revolves around an ETF tied to Ethereum futures, the SEC is currently managing a backlog of spot Bitcoin ETF applications, including those from significant Wall Street players such as BlackRock.\n\nDespite persistent investor demand for a Bitcoin ETF, the SEC has consistently rejected previous applications, citing concerns about potential market manipulation. However, Ethereum futures ETFs made their recent debut in the U.S. market, with several firms introducing a total of nine products on the Chicago Board Options Exchange (CBOE) just last month.\n\nGrayscale has actively been in discussions with the SEC, previously taking legal action against the regulator over its rejection of a spot Bitcoin ETF application. Despite these delays, analysts from Bloomberg Intelligence project a 90% likelihood of the SEC approving a Bitcoin ETF in the U.S. by January 10, 2024.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMS8xNS9ldGhlcmV1bS1iYXNlZC1kZWZpLWFsdGNvaW4tZXhwbG9kZXMtYW1pZC1uZXctc3Bpa2UtaW4td2hhbGUtYWN0aXZpdHktYW5hbHl0aWNzLWZpcm0tc2FudGltZW50L9IBhAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMS8xNS9ldGhlcmV1bS1iYXNlZC1kZWZpLWFsdGNvaW4tZXhwbG9kZXMtYW1pZC1uZXctc3Bpa2UtaW4td2hhbGUtYWN0aXZpdHktYW5hbHl0aWNzLWZpcm0tc2FudGltZW50L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Ethereum-Based DeFi Altcoin Explodes Amid New Spike in Whale Activity: Analytics Firm Santiment - The Daily Hodl",
        "content": "An Ethereum (ETH)-based decentralized finance (DeFi) protocol has exploded in price amid a recent spike in whale activity and new addresses, according to the crypto analytics firm Santiment.\n\nYFI, the native asset of automated yield-farming protocol Yearn.Finance, is trading at $10,242 at time of writing.\n\nSantiment notes that the number of YFI transactions valued at more than $100,000 recently surged to its highest level since July 2022. New address growth has also been “exponentially increasing,” according to the analytics firm.\n\nDespite its recent gains, YFI remains nearly 89% down from its all-time high of $90,786, which it hit in May 2021.\n\nSantiment also notes that Ethereum fees have risen back to their highest levels in four months.\n\nIn terms of the overall crypto market, Santiment says digital asset traders still have a bullish bias, which has historically made markets more likely to flatten or fade.\n\n“Crypto markets have flattened the past three days, but traders are still showing signs of optimism and FOMO. Historically, price rises are most likely to occur after the crowd becomes fearful and keywords like sell, top, or scam rise on social media.”\n\nThe 129th-ranked crypto asset by market cap is up more than 71% in the past seven days.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZW5nLmFtYmNyeXB0by5jb20vZXRoLWJ0Yy1yYXRpby1zb2Fycy1hZnRlci1ibGFja3JvY2tzLWV0aGVyZXVtLWV0Zi1maWxpbmcv0gFXaHR0cHM6Ly9lbmcuYW1iY3J5cHRvLmNvbS9ldGgtYnRjLXJhdGlvLXNvYXJzLWFmdGVyLWJsYWNrcm9ja3MtZXRoZXJldW0tZXRmLWZpbGluZy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "ETH/BTC ratio soars after BlackRock’s Ethereum ETF filing - AMBCrypto English",
        "content": "The ETH/BTC ratio has seen some growth in the last week.\n\nETH’s trading activity has climbed to multi-month highs following the BlackRock Ethereum ETF application.\n\nThe Ethereum [ETH] to Bitcoin [BTC] ratio climbed to new highs last week after asset management giant BlackRock filed for an exchange-traded fund (ETF) for Ethereum.\n\nThe ETH to BTC Ratio, which measures the relative performance of ETH against BTC, spent the last year in decline. This underlined the steep fall in the values of ETH and the general altcoin market.\n\nCrypto research firm Kaiko, in a new report, found that the ratio:\n\n“Has trended downwards ever since The Merge, even though ETH underwent another successful upgrade in April.”\n\nHowever, sentiments improved greatly after the news of BlackRock’s filing became public, causing the ratio to witness a reversal. At 0.05607 as of the 13th of November, the ETH to BTC Ratio increased by 10% since the application was made on the 9th of November.\n\nAll thanks to BlackRock\n\nSince the filing, ETH has seen a significant surge in trading volume across centralized exchanges. Kaiko found that daily Spot Trade Volume hit $7 billion after the application was made.\n\nThis represented the highest level since the collapse of cryptocurrency exchange FTX in November 2022.\n\nMoreover, the increased trading activity around the leading altcoin has caused it to exchange hands above the $2000 price level for the first time since April. At press time, ETH traded for $2060 per coin, according to data from CoinMarketCap.\n\nIn addition to a surge in ETH trading volume, the altcoin market share has rallied since the BlackRock filing.\n\nPer Kaiko’s report:\n\n“The market share of altcoin + ETH volume relative to BTC has risen to 60%, its highest level in more than a year.”\n\nAs the alt’s price grows, Futures market participants have increased their demand for leverage in expectation of a continued price rally. At $7.17 billion at press time, ETH’s Open Interest has recovered to levels seen before the market-wide liquidation event in August.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nLikewise, as per Kaiko, the coin’s Funding Rates:\n\n“Have also surged to their highest levels in more than a year, suggesting sentiment has turned.”\n\nAccording to data obtained from Coinglass, since the 1st of October, crypto exchanges have seen only positive funding rates for ETH. This shows that participants in the coin’s futures market have continuously placed bets in favor of a sustained price rally."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3ByZXNzLXJlbGVhc2VzL25vY3R1cm5lLWxhdW5jaGVzLW9uLW1haW5uZXQtdG8tYnJpbmctcHJpdmF0ZS1hY2NvdW50cy10by1ldGhlcmV1bS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Nocturne Launches on Mainnet to Bring Private Accounts to Ethereum - CryptoSlate",
        "content": "Chainwire Nocturne Launches on Mainnet to Bring Private Accounts to Ethereum Chainwire · · 3 min read\n\nDisclaimer: This is a sponsored press release. Readers should conduct their own research prior to taking any actions related to the content mentioned in this article. Learn more ›\n\nNEW YORK, United States, November 15th, 2023, Chainwire – Nocturne, a protocol enabling on-chain private accounts, today announced the successful deployment of Nocturne v1 to Ethereum mainnet. This marks a significant milestone in the journey towards a more private and accessible Ethereum. For the first time, users will have a compatible and easy-to-use product resembling a private onchain account.\n\nNocturne v1 is a step towards compatible onchain privacy that functions simply as another account rather than a distinct tool or ecosystem. Users will find transacting with Nocturne similar to using a smart contract wallet, with the added benefit of privacy. Nocturne v1 is currently out-of-the-box compatible with any DeFi protocol that represents state via output tokens (e.g. Uniswap swap tokens, Aave aTokens, Compound cTokens, etc). There are plans to later extend this compatibility to arbitrary protocols.\n\n“With Nocturne v1’s launch, we’re moving away from the notion of a ‘privacy tool.’ Privacy should be embedded at the account layer and the v1 launch is the first step in making this possible,” said Luke Tchang, CEO and co-founder of Nocturne. “Our goal is to ensure that everyone, from individual users to large institutions, can transact securely without exposing their financial history to the world. This is more than a product; it’s a commitment to making Etherereum more accessible and enabling secure and private money over the internet.”\n\nNocturne is built on the belief that privacy on public blockchains will only become mainstream if it’s seamlessly integrated with the existing user experience. Nocturne’s objective is straightforward: to create private user accounts on L1/L2 that are fully compatible with existing Ethereum accounts. To read more about private accounts, please see Nocturne’s recent blog post.\n\nPrivacy: The Keystone for Ethereum’s Growth\n\nThough DeFi and other onchain activities have surged in popularity, privacy concerns have prevented broader acceptance and use of crypto as money. Recognizing that the typical user may be uneasy with the idea of their financial dealings being public, and that institutions demand confidentiality for their transactions, Nocturne addresses these critical barriers head-on. Privacy isn’t just a feature—it’s foundational to the broader adoption of crypto.\n\nNocturne’s Future Vision\n\nAs they continue building new versions, Nocturne’s long-term vision is to make the experience so seamless that by default, every Ethereum user automatically has a private account which mirrors their public account. In short, a seamless parallel account layer for privacy.\n\nNocturne’s plans for achieving its longer-term vision include:\n\nTransition to a more permissionless protocol by migrating to proof of innocence, as described by Vitalik and Ameen Solemani in the Practical Privacy & Compliance paper.\n\nBring Nocturne accounts closer to usable as general wallets by extending Nocturne’s protocol compatibility to arbitrary smart contracts.\n\nImprove the compatibility of Nocturne accounts with EOAs and smart accounts through a scheme that allows for public wallet authorization to be leveraged within Nocturne for security.\n\nHow To Access\n\nNocturne v1 is live and can be accessed through a dedicated private vault UI, allowing users to discreetly manage their assets. The current UI capabilities include deposits, transfers to new burner addresses, and private swaps and staking. To get started, visit app.nocturne.xyz.\n\nAbout Nocturne Labs\n\nNocturne Labs is a forward-thinking blockchain technology company committed to addressing the most critical privacy and user experience challenges within the Ethereum ecosystem. With a pioneering protocol for private accounts, Nocturne enables users to transact safely with built-in privacy. This marks a substantial stride in advancing the usability of public blockchains. Backed by notable investors such as Bain Capital Crypto, Polychain Capital, Bankless, and Vitalik, Nocturne is led by a team of experienced developers dedicated to enabling a more secure and accessible Ethereum. For more information, visit https://nocturnelabs.xyz/.\n\nContact\n\nPR Manager\n\nKayla Gill\n\nSerotonin\n\n[email protected]"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMS8xNS9iaXRjb2luLWV0aGVyZXVtLWFuZC1hbHRjb2lucy1zZXQtZm9yLXBhcmFib2xpYy1tb3ZlLXRvLXVwc2lkZS1hZnRlci1jbGVhbi1icmVha291dC1nbGFzc25vZGUtY28tZm91bmRlcnMv0gGPAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzExLzE1L2JpdGNvaW4tZXRoZXJldW0tYW5kLWFsdGNvaW5zLXNldC1mb3ItcGFyYWJvbGljLW1vdmUtdG8tdXBzaWRlLWFmdGVyLWNsZWFuLWJyZWFrb3V0LWdsYXNzbm9kZS1jby1mb3VuZGVycy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin, Ethereum and Altcoins Set for Parabolic Move to Upside After Clean Breakout: Glassnode Co-Founders - The Daily Hodl",
        "content": "The co-founders of the crypto analytics firm Glassnode believe Bitcoin (BTC) and altcoins are setting the stage for a parabolic move.\n\nGlassnode co-founders Jan Happel and Yann Allemann, who share the Negentropic handle on the social media platform X, say that both Bitcoin and Ethereum (ETH) have printed bull flag patterns.\n\nA bull flag pattern typically signals that the uptrend which was underway prior to a price descent is about to resume.\n\nThe co-founders also say that the market capitalization of altcoins appears to have formed a bullish rounding bottom, which in technical analysis is a pattern found at the end of a lengthy downward trend marking a reversal.\n\n“BTC and ETH have broken higher-out of bull flags.\n\nNow altcoins seem to have finalized rounding bottom – and hence begins a new bull market.\n\n*See the details in our in-house chart analysis below.”\n\nThe traders also suggest that Bitcoin will head higher after the new US Consumer Price Index (CPI) data shows inflation is cooling.\n\n“Bitcoin experienced a peak at $37,900 on November 9th, only to dip to $36,880 today, erasing weekend gains. Now, all eyes are on the upcoming US Consumer Price Index (CPI) data.\n\nProjections suggest a yearly core CPI inflation of 4.1% and a monthly increase of 0.3%. Considering that higher inflation tends to increase selling pressure on risk assets like Bitcoin, the October CPI report is anticipated to influence BTC’s price trajectory.”\n\nBitcoin is trading for $35,597 at time of writing, down 2.2% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMS8xNS9iYW5rcnVwdC1jcnlwdG8tbGVuZGVyLWNlbHNpdXMtbW92ZXMtb3Zlci0xMDAwMDAwMC13b3J0aC1vZi1ldGhlcmV1bS1ldGgtdG8tZXhjaGFuZ2Utb24tY2hhaW4tZGF0YS_SAYgBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMTEvMTUvYmFua3J1cHQtY3J5cHRvLWxlbmRlci1jZWxzaXVzLW1vdmVzLW92ZXItMTAwMDAwMDAtd29ydGgtb2YtZXRoZXJldW0tZXRoLXRvLWV4Y2hhbmdlLW9uLWNoYWluLWRhdGEvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Bankrupt Crypto Lender Celsius Moves Over $10,000,000 Worth of Ethereum (ETH) To Exchange: On-Chain Data - The Daily Hodl",
        "content": "An address associated with failed crypto lending platform Celsius has moved millions of dollars worth of Ethereum (ETH) to an exchange, according to on-chain data.\n\nCiting data obtained from blockchain explorer Etherscan, on-chain data tracker Lookonchain says that Celsius moved 5,160 ETH worth approximately $10.49 million to institutional crypto trading platform FalconX.\n\nAccording to Lookonchain, Celsius, which filed for bankruptcy in July of 2022, possibly “wants to sell some assets with the rising prices.”\n\nEthereum is trading at $2,033 at time of writing, up by nearly 80% year-to-date.\n\nIn the first half of the year, Celsius also moved 428,000 staked Ether (STETH), worth $780 million at the time, from the liquid staking solution Lido Finance.\n\nLookonchain further says that Celsius also moved various tokens to FalconX as well as Binance and OKX crypto exchanges five days ago. The tokens include various stablecoins, the governance token of the Abracadabra DeFi platform Spell (SPELL) and the utility token of the Brave browser Basic Attention Token (BAT).\n\nThe large transfer of Ethereum by the bankrupt crypto lender comes days after a judge approved Celsius’ bankruptcy plan. The bankruptcy plan will see Celsius converted into a crypto mining and staking firm owned by the creditors.\n\nThe outfit will be known as NewCo and is expected to have a $1.25 billion balance sheet, of which 36% will be liquid crypto. Some or all of the liquid crypto will be staked on the Ethereum network and will potentially bring in “anywhere from $10 to $20 million per year”.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvY2hpbmFzLWJveWFhLWludGVyYWN0aXZlLXRvLXNwZW5kLTkwbS1vbi1iaXRjb2luLWFuZC1ldGhlcmV1bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "China's Boyaa Interactive to Spend $90M on Bitcoin and Ethereum - Watcher Guru",
        "content": "China’s largest board and card game company, Boyaa Interactive, is set to spend $100 million on purchasing cryptocurrencies like Bitcoin (BTC) and Ethereum (ETH). Indeed, the Hong Kong-listed company is set to acquire the digital assets over the next 12 months, according to a published update.\n\nThe online card game developer joins a list of public companies seeking a point of entry into digital assets. Subsequently, the initiative to acquire the digital assets was crafted by the board of directors. Moreover, the plan is currently pending approval from its shareholders.\n\nJUST IN: 🇨🇳 China's largest board and card game company, Boyaa, to acquire $90 million worth of #Bitcoin and Ethereum. November 14, 2023\n\nAlso Read: Bitcoin (BTC) Price on Thanksgiving 2022\n\nChina’s Largest Card Game Company Spending Big on Bitcoin and Ethereum\n\n2022 was undoubtedly a year-long crypto winter for the digital asset sector. However, things have certainly looked up this year, as the industry has maintained a sort of return to form. Moreover, part of that comeback is due to the host of companies that are seeking to get involved in the industry. That fact is reaffirmed through one huge initiative set in place by one of China’s largest companies.\n\nIndeed, China’s Boyaa Interactive has announced its plan to spend $100 million on purchasing Bitcoin (BTC), Ethereum (ETH), and other cryptocurrencies. Specifically, the plan was announced in a newly published update and would take place over the next 12 months.\n\nSource: Blockchain Reporter\n\nAlso Read: Ethereum Price on Black Friday 2022\n\nThe plan is currently pending approval from shareholders due to its overarching nature. Indeed, the board of directors is ensuring the $100 million fund is readily available. Subsequently, they would be able to curtail “prior shareholder approval for each purchase.”\n\nThe approval would then see a large selection of the funds used for acquiring BTC and ETH. Specifically, $45 million would be allocated to the two largest cryptocurrencies by market cap. Thereafter, $10 million would be used by Boyaa to purchase stablecoins like Tether and USD.\n\nConversely, a previous plan that was approved in August led to $5 million in crypto being purchased in the upcoming year. This plan approval would then increase the amount used for the acquisition of digital assets by the company."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoLWJ0Yy1yYXRpby1zaGlmdGluZy1ldGhlcmV1bS1tZWdhLXJhbGx5L9IBVWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoLWJ0Yy1yYXRpby1zaGlmdGluZy1ldGhlcmV1bS1tZWdhLXJhbGx5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "ETH-BTC Ratio Shifting: Is An Ethereum Mega Rally Incoming? - NewsBTC",
        "content": "Ethereum prices are firm at spot rates, still trading above the $2,000 level, and multiple other factors point to possible trend continuation.\n\nAccording to Kaiko’s data on November 12, not only is the ETH-BTC ratio shifting and reversing after extended periods of lower lows, but also there is a notable uptick in trading volume with funding rates in crypto derivative platforms shifting from negative to positive, suggesting increasing demand.\n\nEthereum Breakout Above $2,000\n\nAs of writing on November 13, Ethereum is relatively firm and changing hands at around the $2,090 level. Despite the expected contraction in trading volume over the past couple of days following the rally on November 9, the uptrend remains in place.\n\nSo far, the immediate support level technical analysts are watching remain at $2,000, marking July 2023 highs. Conversely, the $2,100 zone, marking the April high, is a critical liquidation level that optimistic bulls must break for a buy trend continuation pattern.\n\nAs it is, traders are optimistic. However, whether the uptrend will continue depends primarily on trader sentiment and if existing fundamental factors might spark more demand, lifting ETH to new 2023 highs. Thus far, even though the general ETH support base remains upbeat, the coin, unlike Bitcoin (BTC), is struggling to break key resistance levels recorded in H1 2023, which is a concern.\n\nETHBTC Turning Bullish As Funding Rate Flips Positive\n\nOn the positive side, looking at the ETHBTC candlestick arrangement in the daily chart, the sharp reversal of ETH fortunes on November 9 could anchor the next leg up, signaling a new shift in a trend that favors Ethereum buyers. Looking at the ETHBTC formation, Bitcoin bulls have had the upper hand in 2023.\n\nRelated Reading: XRP Price Path To $1: Exploring Two Potential Outcomes From The $0.66 Resistance Level\n\nTo quantify, BTC is up 33% versus ETH, with the climactic sell-off of October 23 pushing BTC to the highest point against the second most valuable coin in 2023. However, the sharp recovery on November 9 and the subsequent failure of BTC bulls to reverse losses suggest that ETH has the upper hand.\n\nThus far, ETHBTC prices are trending inside the November 9 bullish engulfing bar at the back of light trading volumes, a net positive for bullish ETH holders.\n\nFollowing this surge, Kaiko notes that the funding rate of the ETHUSDT pair is positive, signaling increasing demand in the crypto derivatives scene. When funding rates turn positive from negative, it means “long” traders are paying “short” traders to keep their positions open. This development indicates that more traders are long ETH, expecting prices to rise in the sessions ahead.\n\nFeature image from Canva, chart from TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLWFzLWJ1bGxzLWhvbGQtMjAwMC1sZXZlbC13aGVyZS1pcy1ldGgtaGVhZGluZy1uZXh0Lmh0bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction as Bulls Hold $2000 Level – Where is ETH Heading Next? - Cryptonews",
        "content": "Ethereum Price Prediction as Bulls Hold $2,000 Level – Where is ETH Heading Next?\n\nThe Ethereum price has dipped by nearly 0.5% in the past 24 hours, with the altcoin holding to the $2,051 level as the cryptocurrency market as a whole falls by 1% today.\n\nDespite this loss, ETH remains up by 8.5% in a week and by 31% in the last 30 months, as ETF-related enthusiasm carries the altcoin and the wider market further.\n\nETH has also risen by 71% since the beginning of the year, and with the possibility of ETF approvals set to user in a bull market next year, it may resume rising strongly once its current dip is over.\n\nEthereum Price Prediction as Bulls Hold $2,000 Level – Where is ETH Heading Next?\n\n\n\nEthereum’s indicators continue to look strong, even with today’s little misstep.\n\nThe coin’s RSI (purple) remains above 70, indicating considerable buying pressure that could help it rise again quickly in the next few days.\n\nMore bullishly, ETH’s 30-day average (yellow) recently climbed over its 200-day average (blue), forming a ‘golden cross’ that often signals breakouts.\n\nAs such, it may still be the case that ETH is on the brink of much bigger rises than it has enjoyed in the past couple of weeks.\n\nIndeed, its 24-hour trading volume remains comfortably above $21 billion, having stood at around $3 billion in the middle of October.\n\nThis indicates that investors are still very much interested in ETH, with a number of large transfers in the past couple of days showing that some whales are still moving the altcoin off exchanges.\n\nSo based on ongoing optimism surrounding Bitcoin – and Ethereum – ETFs, it’s likely that the Ethereum price will continue to rise in the coming weeks.\n\nAnd turning to the medium- and long-term, ETH’s fundamentals will also be pushing in this direction.\n\nEthereum continues to be the biggest layer-one blockchain in terms of usage and adoption, with its network accounting for more than half of the total value locked in of the entire sector.\n\nIt has also been attracting big names this year, with PayPal launching its own Ethereum-based stablecoin and with Coinbase opening its own Ethereum layer-two.\n\nIn other words, Ethereum’s continued dominance for the foreseeable future is more or less assured, which would imply a rising Ethereum price.\n\nFrom $2,000 now, it could reach $2,500 by the end of the year, with a fully fledged bull market in 2024 helping it to retest its all-time high.\n\nFundamentally Strong Altcoins\n\n\n\nIt’s never ideal to have a portfolio mostly in a single cryptocurrency, so traders looking for diversification are also advised to buy into newer tokens, exposing themselves to more positive upside.\n\nNewer tokens can also include presale coins, with the best and biggest presales often translating into big exchange listings.\n\nOne of the likeliest tokens to enjoy such a listing is Bitcoin Minetrix (BTCMTX), a stake-to-mine platform that has raised over $3.9 million in around a month.\n\nExperiencing the world of #BitcoinMinetrix, a tokenized cloud mining platform that enables everyday individuals to participate in decentralized $BTC mining. Saying goodbye to concerns about third-party cloud mining scams and gaining full control over your operations. 🔐 pic.twitter.com/Oa9A9y74SO — Bitcoinminetrix (@bitcoinminetrix) November 14, 2023\n\nDue for launch in the next few weeks, Bitcoin Minetrix will enable users to mine Bitcoin (BTC) simply by staking its native token, BTCMTX.\n\nBy staking enough BTCMTX, users receive tokenized mining credits that they can then use to buying Bitcoin mining power, earning them newly minted BTC in the process.\n\nSuch a system will potentially make Bitcoin Minetrix profitable for users, who will also receive issued BTCMTX in exchange for staking.\n\nInvestors can join its presale at the official Bitcoin Minetrix website, where 1 BTCMTX currently costs $0.0116.\n\nThis price rises with each successive stage of the sale, ending at $0.01190 once the offering reaches its final stage.\n\nAnd given just how promising Bitcoin Minetrix’s fundamentals are, it could rally much higher once it lists towards the end of the year.\n\nVisit Bitcoin Minetrix NowDisclaimer: Crypto is a high-risk asset class. This article is provided for informational purposes and does not constitute investment advice. You could lose all of your capital."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9va3gtbGF1bmNoZXMtZXRoZXJldW0tbGF5ZXItMi10ZXN0bmV0LXVzaW5nLXprLWJhc2VkLXBvbHlnb24tY2Rr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "OKX launches Ethereum layer-2 testnet using ZK-based Polygon CDK - Cointelegraph",
        "content": "Crypto exchange OKX has launched a testnet for an upcoming Ethereum layer-2 network named “X1,” according to a Nov. 14 announcement. The network is being developed using the Polygon chain development kit (CDK) and will use zero-knowledge proofs to validate deposits and withdrawals between layers.\n\nOKX exchange interface. Source: OKX\n\nOKX is the sixth-largest centralized crypto exchange by volume, with over $1.8 billion in trading volume per day, according to data from CoinMarketCap. Its token, OKB, has a current market cap of over $3.6 billion, making it one of the top 30 cryptocurrencies. When a mainnet version of the new network is launched, OKB will be the native coin used to pay gas fees on it, the announcement stated.\n\nX1 is being developed using the Polygon CDK, potentially making it part of the broader Polygon ecosystem that includes Polygon zero-knowledge Ethereum Virtual Machine, Polygon PoS, Near, Manta Pacific and other networks. According to the announcement, OKX will also be a core contributor to the Polygon CDK software going forward and will “invest substantial engineering resources to enhance the technology stack for Ethereum scaling solutions.”\n\nRelated: Polygon Labs and Near announce ZK prover for WASM integration\n\nOKX chief innovation officer Jason Lau claimed that the new network will help to onboard new users to Web3, stating:\n\n“X1 will be a key pillar of our efforts to educate and bring our users on-chain and into the world of Web3. This scalable and accessible network is perfect for developers, who can build on X1 to deliver user-friendly world-class consumer Web3 applications, all while maintaining interoperability with other networks and ecosystems.”\n\nOKX is also the creator of OKT Chain, an Ethereum sidechain that uses OKB as its native coin. It isn’t the only exchange to build its own network: Binance launched BNB Chain in 2019, and Coinbase launched its layer-2 “Base” network on Aug. 9."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzExLzE1L2FudGhvbnktc2NhcmFtdWNjaS1wcmVkaWN0cy1iaXRjb2luLWFuZC1ldGhlcmV1bS1yYWxsaWVzLXNheXMtZmVkLWdlYXJpbmctdXAtZm9yLXJhdGUtY3V0cy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Anthony Scaramucci Predicts Bitcoin and Ethereum Rallies, Says Fed Gearing Up for Rate Cuts - The Daily Hodl",
        "content": "SkyBridge Capital CEO Anthony Scaramucci is predicting that Bitcoin (BTC) and Ethereum (ETH) are on the cusp of rallies now that a Federal Reserve pivot seems likely.\n\nIn a new interview on Bloomberg Television, Scaramucci says that he believes the Fed is done increasing rate hikes, which he says will take the pressure off of risk assets.\n\nHe also predicts that the Fed will start cutting rates early next year.\n\n“I do think the Fed is done hiking. I think that the inflation data was very positive and it’s likely to go lower over the next quarter… and I think it’s very, very good for stock prices, very good for assets.\n\nBut of course, what do people want for Christmas in America? They want a low-interest-rate mortgage. And if you look at housing data in the United States right now, those markets are quite sluggish. I think the Fed is going to respond to that. You’ll probably see cuts in interest rates before the end of the first quarter. And so that’s very positive for asset prices across the board.”\n\nScaramucci says he is bullish on Bitcoin, Ethereum and other digital assets, and thinks they will “trend higher” in the near future.\n\nOne catalyst for a crypto uptrend, he says, is the likely approval by the U.S. Securities and Exchange Commission (SEC) of a spot Bitcoin exchange-traded fund (ETF).\n\n“If [approval] happens, I think there’s an induction of a tremendous amount of demand for Bitcoin. And of course, you have a halving in Bitcoin, which basically means that the supply is going to get cut in half in April. So a halving, lower supply, more demand, we think prices are going to trend higher for Bitcoin, Ethereum and a few other currencies.\n\nAnd for those reasons, we’re going to stay long in the portfolio. It’s a concentrated bet for us, but we like it. It’s a macro overlay. You guys will remember the beginning part of the year with the Silicon Valley Bank crisis, Bitcoin was quite resilient.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on Twitter, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Fortis Design"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LnRlY2hyYWRhci5jb20vcHJvL3NlY3VyaXR5L2V0aGVyZXVtLWhhY2tlZC10by1zdGVhbC1taWxsaW9ucy1mcm9tLXVzZXJzLWFjcm9zcy10aGUtd29ybGTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Ethereum hacked to steal millions from users across the world - TechRadar",
        "content": "Hackers have been observed abusing a feature in the Ethereum blockchain to trick victims into sending money.\n\nIn the last six months, the criminals were able to trick almost 100,000 people into giving away a total of $60 million, according to a new report from Scam Sniffer.\n\nAs per the report, the hackers used a function called Create2, an opcode that allows users to predict the address of a contract before it is deployed on the Ethereum network. In other words, hackers can create temporary addresses for each individual transaction - addresses that greatly resemble the ones where the victims intended to send the funds. The scheme is dubbed “address poisoning”.\n\nReader Offer: $50 Amazon gift card with demo\n\nPerimeter 81's Malware Protection intercepts threats at the delivery stage to prevent known malware, polymorphic attacks, zero-day exploits, and more. Let your people use the web freely without risking data and network security. Preferred partner (What does this mean?)\n\nBypassing security\n\nMost users, before sending any funds, do two things: 1) they double-check the recipient’s address to make sure they’re sending the money to the right place; 2) they send a small transaction first to make sure everything works, before sending the remaining funds. However, as the addresses are a long string of seemingly random characters, most users just cross-check the first and last few characters, instead of comparing the entire strings.\n\nBy creating an address that differs in just a few characters, the attackers can trick people into thinking the address is valid, before sending the funds. That, however, still leaves the second failsafe - the test transaction. Criminals are working around this by forwarding the test transaction to the actual address.\n\nThe lookalike addresses don’t belong directly to a wallet controlled by the attackers, but are rather a smart contract that then transfers the funds to the final destination. The researchers said they observed multiple cases of fraud leveraging Create2, with one victim losing up to $1.6 million.\n\nUsers are advised to thoroughly check the entire address before sending the funds, and not just first and last characters.\n\nVia BleepingComputer"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tYnVsbHMtbWF5LXByb3BlbC1wcmljZS10by0zMTAwLWFuYWx5c3Qtc3VnZ2VzdHMv0gFjaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy9ldGhlcmV1bS9ldGhlcmV1bS1idWxscy1tYXktcHJvcGVsLXByaWNlLXRvLTMxMDAtYW5hbHlzdC1zdWdnZXN0cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Bulls May Propel Price To $3,100, Analyst Suggests - NewsBTC",
        "content": "Ethereum (ETH), the second-largest cryptocurrency, has seen a significant price increase over the past month. The recent bullish rush in the crypto market, coupled with BlackRock’s involvement, has pushed ETH to its year-to-date high of $2,139.\n\nEthereum Outshines Bitcoin And Altcoins\n\nAccording to market data provider Kaiko, ETH has outperformed BTC and many altcoins in recent weeks, signaling a shift in market dynamics.\n\nKaiko’s report highlights how ETH struggled to gain momentum over the past year, despite successful upgrades such as The Merge in April.\n\nHowever, the sentiment around ETH changed dramatically when BlackRock filed for a spot ETH exchange-traded fund (ETF), leading to a reversal in the ETH to Bitcoin (BTC) ratio.\n\nThe impact on the market was substantial, with ETH prices surging above $2,000 for the first time since April. Additionally, daily spot trade volumes reached $7 billion, the highest level since the collapse of FTX.\n\nThe ETH ETF narrative provided further impetus to the ongoing rally, amplified by improved global risk sentiment and declining US Treasury yields.\n\nThe dominance of altcoin + ETH volume relative to BTC has risen to 60%, marking its highest level in over a year. During bull rallies, altcoin volume typically increases relative to BTC.\n\nThis surge in demand has also led to rising leverage, as reflected in the recovery of ETH open interest to early August levels. Notably, BTC open interest has declined over the past month due to liquidations on Binance, resulting in the Chicago Mercantile Exchange (CME) outpacing Binance as the largest BTC futures market.\n\nFurthermore, ETH funding rates, a gauge of sentiment and bullish demand, have reached their highest levels in over a year, indicating a significant shift in sentiment. In November, both BTC and ETH 30-day volatility rose to 40% and 50% respectively, following a multi-year low of around 15% during the summer months.\n\nCrypto Expert Predicts ETH Breakout\n\nRenowned crypto expert Michael Van de Poppe believes that ETH is on the cusp of a significant breakthrough. According to Van de Poppe, if Ethereum manages to surpass the crucial $2,150 resistance level, it could signify the end of the bear market.\n\nDrawing a parallel with Bitcoin’s critical $30,000 barrier, Van de Poppe suggests that breaching this level could pave the way for a substantial rally, potentially propelling Ethereum towards the price range of $3,100 to $3,600.\n\nHowever, Ethereum has yet to touch the $2,150 resistance line, as it faces a pre-existing obstacle in the form of its yearly high of $2,139. This pivotal level has halted the cryptocurrency’s bullish momentum, acting as a formidable resistance.\n\nAs a result, Ethereum has been consolidating within a narrow range between $2,050 and $2,100 for the past three days.\n\nThe forthcoming days will reveal whether Ethereum can overcome its immediate resistance levels and establish a consolidated position above them. Alternatively, it may face a fate similar to Bitcoin, which failed to surpass the $31,000 level for over seven months before reaching its current trading price of $36,000.\n\nFeatured image from Shutterstock, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vY29pbmNvZGV4LmNvbS9hcnRpY2xlLzM0NDAzL3JlbmRlci1uZXR3b3JrLW1pZ3JhdGVzLWZyb20tZXRoZXJldW0tdG8tc29sYW5hLWFzLXNvbC1lY29zeXN0ZW0tY29udGludWVzLXRvLWV4cGFuZC_SAXxodHRwOi8vYW1wLmNvaW5jb2RleC5jb20vYXJ0aWNsZS8zNDQwMy9yZW5kZXItbmV0d29yay1taWdyYXRlcy1mcm9tLWV0aGVyZXVtLXRvLXNvbGFuYS1hcy1zb2wtZWNvc3lzdGVtLWNvbnRpbnVlcy10by1leHBhbmQv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Render Network Migrates from Ethereum to Solana as SOL Ecosystem Continues to Expand - CoinCodex",
        "content": "Key Highlights:\n\nRender network unveils successful migration to the Solana network, and bids farewell to Ethereum.\n\nIn a bid to make the migration process an easy and convenient experience for users, the Render Foundation has offered 1.14 million RNDR tokens to incentivize token holders.\n\nSolana ecosystem continues to expand after seeing an impressive surge of +144.00% in the last one month.\n\nRender Network, a leader in the decentralized computing space, has just experienced a massive shift within its ecosystem as the platform announces successful migration from Ethereum to the Solana network.\n\n“We’re thrilled to welcome Render to the ecosystem, making it the latest project to fully migrate their network to Solana,” Ryan Shea, Advisor to the Render Foundation expressed excitement on the company's latest move.\n\nThis remarkable upgrade comes after the platform considers a need to leverage Solana's exclusive use cases while avoiding the high gas fees offered on the Ethereum network.\n\nIn essence, while the Render network has successfully upgraded its core infrastructure to the Solana blockchain, users of Render can now explore several use cases on the network without the need to bother about high transaction fees.\n\nWhy Solana?\n\nAccording to the announcement, the company believes that Solana's incredible features in collaboration with its core infrastructure has the potential to unlock significant and exciting opportunities for the Render ecosystem.\n\nThis may include crucial new capabilities like real-time streaming and dynamic NFTs, creating a whole new experience for the Render community.\n\nMoreso, the company has also emphasized that Solana's superior speed, cost-effectiveness, and scalability, aligns suitably with Render's expansive vision. Hence, the big transition to Solana will mark a remarkable stepping stone towards achieving its vision.\n\nThe Render Network is committed to building a scalable and decentralized metaverse infrastructure. Thus, Solana’s incredible transaction speeds, low costs, and commitment to web-scale architecture appears promising to facilitate the actualisation of the stated goals.\n\nRyan Shea, Advisor to the Render Foundation, acknowledged this noting that:\n\n“Solana is the home of DePIN, and Render Network is one of the most important DePIN networks in existence today. Solana will help extend Render Network into new applications, such as machine learning and inference training, and unlock new utility through Solana’s best-in-class technologies like compressed NFTs, on-chain order books, and real-time oracles.”\n\nRender Offers 1.14 million RNDR as Incentives to Aid Token Transfers\n\nPer the announcement, users of Render who hold the RNDR token can now proceed to transfer their tokens to the Solana blockchain.\n\nIn a bid to make this an easy and seamless experience for users, Render Network has launched an Upgrade Assistant and Incentive program. It also announced the allocation of 1.14 million RNDR in grants to subsidize the high transaction fees charged on Ethereum.\n\nNotably, the Upgrade Assistant program will offer users the opportunity to transfer their RNDR tokens to Solana blockchain easily with a guarantee on safety and trustless upgrade process using the Wormhole protocol.\n\nMoreso, through the Upgrade Assistant, users have been encouraged to transfer their tokens from the Ethereum network to Solana as soon as possible as early migrators will be awarded a share of the 1.14M RNDR. Notably, holders who do not transfer their tokens within the specified period of three months, will have to pay their own gas fees to migrate RNDR tokens to the Solana blockchain when the period elapses.\n\nSolana Ecosystem Continues to Expand as it Welcomes Render\n\nRender's integration with the Solana ecosystem marks a significant addition to the continuous improvement the network has been witnessing lately.\n\nThe Solana market performance has been on the bright side for several months, with the SOL price showcasing an impressive surge of +144.00% in the last one month.\n\nAlthough the SOL price has decreased by -6.66% in the last 24 hours, the network still retains a bullish sentiment, seeing it outperform the Ethereum network. While Solana has impressively risen by 15.89x against Ethereum, it appears that this may continue to be the case following Solana's recent collaboration with Render Network against Ethereum.\n\nThe transition of Render between Ethereum and Solana implies that there will be a reduction in the use of the Ethereum network, while the use of Solana will be increased as it will see new adoption from the users of Render.\n\nNonetheless, the Render Network has also instructed that while the ETH token ($RNDR) will remain, it will no longer be maintained by Render Foundation and won't function on the Render Network."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy92aWRlb3MvMjAyMy0xMS0xNS9zY2FyYW11Y2NpLXNheXMtYml0Y29pbi1ldGhlcmV1bS1wcmljZXMtdG8tdHJlbmQtaGlnaGVyLXZpZGVv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "SkyBridge's Scaramucci Says Bitcoin, Ethereum Prices to Trend Higher - Bloomberg",
        "content": "00:00\n\n[CC may contain inaccuracies] I want to get your thoughts initially on what do you think the economic and investment environment will be like in the US over the next 12 months? Do you think the Fed's done hiking rates? I do think the Fed is done hiking. And good morning to you guys. I think that the the inflation data was very positive and it's likely to go lower over the next quarter. And so Rick Rieder, a personal friend of mine, actually gave a presentation in Park City at Governor Romney's conference about a month ago and explained the the churning down of inflation. And I think that's very, very good for stock prices, very good for assets. But, of course, what do people want for Christmas in America? They want a low interest rate mortgage. And if you look at housing data in the United States right now, those markets are quite sluggish. I think the Fed is going to respond to that. You'll probably see cuts in interest rates before the end of the first quarter. And so that's very positive for asset prices across the board. Okay. You mentioned last time Bloomberg spoke with you about, you know, you had a great October for your fund. I think it's the best month you've had in the history of SkyBridge. A lot of it was crypto, which I'll get to later. But what what's the other part of that? I mean, is there any parts of that of your portfolio that really kind of benefit from maybe either higher for longer or a less sort of tightening environment? I guess who else, unfortunately, versus the bets that hurt us last year? We we left on for this year. And so unfortunately in investing, sometimes you can get the timing wrong. But we made the case in the fourth quarter of last year in the early part of 2023, that the Fed would start cutting rates more quickly, that inflation would come down more quickly once the supply chain had reconnected. And you saw all of this induction of new technology like A.I., robotic technology, etc., bringing down prices. And so we got the timing wrong. But if you're a long term investor, if you were patient with us, you did quite well. And and last year at this time here at this all conference, as I mentioned during the commercial break, I think Bitcoin was about 16 or 17,000. We have a 10% position in Bitcoin in our portfolio and of course that's gone up to 35, 36,000 in the last year. And I think that went up contrary to institutional sentiment at the time. Over the last year people were quite negative. I was in Davos, Switzerland, being interviewed by some of your colleagues. January of this year, everyone had written off Bitcoin. Of course, it went up about 115% since then. So it's a combination of a couple of different factors, but it's mostly about being bullish about the return of the global economy and global growth. post-COVID. It just took longer than people expected, but we're there now. Yeah, from 6000 to 35. Now, you mentioned 10% weighting. How are you managing your exposure to crypto? What do you suspect the changes will be over the next couple of months? Anthony? Well, I mean, I think one of the things we're very proud of is we're we were the first outside capital into the BlackRock Bitcoin Trust. And so as you guys know, they filed for a formal application with the SCC, the deadline for that application at least for the Ark application, Cathie Wood's is January 10th. It appears likely that these things will get approved if that happens. I think there's an induction of a tremendous amount of demand for Bitcoin and of course you have a happening in Bitcoin, which basically means the supply is going to get cut in half in April. So having lower supply, more demand, we think prices are going to trend higher for Bitcoin, Etherium and a few other currencies. And for those reasons we're going to stay long in the portfolio. And you know what? Well, you know, it's a concentrated bet for us, but we like it. It's a macro overlay. And I guess you guys will remember the beginning part of the year with the Silicon Valley bank crises. Bitcoin was quite resilient and it seems to also do what you'd want an alternative investment to do is go contra into carry indicatori to the overall market. And I think it's safe to say you're still deep into crypto. And of course, obviously your name was mentioned during those SBF trials. Well, I want to get your take on the verdict now that we have one here as well. And overall the future of FDX 2.0. Would you invest in it? Would I invest in it? Well, depends on who's running it. I think number one, I think if you read Michael Lewis's book, there was a business there. He had 12 and a half percent of the cryptocurrency market. So I think the sloppiness and the indiscretion and the eventual fraud obviously ruined the the business and ruin the reputation of that business. But there is a good. Underlying business of you. Tell me who's managing it. I would be open minded to that. But since you're mentioning FDA, I think it's important to point out to people last year at this time at this conference, Sam Bankman-fried had just declared bankruptcy and he was about to be arrested. And so it's a full year later. He's already been convicted for the fraud. His sentencing comes it comes in March. I think it was fair. You know, I spoke at an event here for the Singapore Monetary Authority yesterday and explained that a good regulatory process is clear, transparent rules. But if there are bad actors, they've got to get convicted and have to pay the price for the crimes that they're committing. And I think we're seeing that in the United States. I think that sending a message of deterrence to people, but it's also sending a message of greater safety in these markets for investors. So there's a combination of positive things happening this year. And of course, if you interviewed me last year at this time, there was less than positive things happening. So, Anthony, just everyone was asking about 2.0. Just a quick update, please. If you could give us a timeline on 1.0. They still have a stake in you guys. Do you still plan on buying them, taking that stake back? You have a timetable for that? Yes. So unfortunately, we're waiting for the bag. We've created a data room for the bankruptcy estate to look at and to make a decision on when they'll give us the opportunity to buy back those assets. I still think that's likely a year or two away, and we're in no rush because, of course, there was no controlling stake and there's no voting interest or even economic preference in that stake. So we're running the business just like we've run it before with no interruption. But you're asking about tax. If that's going to go alive, it'll probably be the back half of 2024. My prediction is that they'll eventually sell those assets and that technology to somebody that will restart that exchange. And so we'll have to see what happens. But I think that's very likely. How much time. So I've got to ask you about, you know, we have a U.S. election that's coming up as well. Do you do you have any sort of projection here? Are we going to back this time? Give me of course, you had a short stint in the White House. I'm in the I'm in the ABC camp. You know, anybody but anybody but Trump. And so if it's Trump versus Biden, I will be actively advocating for President Biden. I have supported Governor Christie, and I'm hopeful that he can have a good showing in New Hampshire. If that doesn't happen and the president does get the nomination. President Trump, I think it's just too big of a threat to the American democracy. And if you listen to him very carefully, he wants to put up refugee camps. He wants the poor people from the country. It's very un-American. It'll be very disruptive for business continuity globally and in the U.S. So I'll be with President Biden if it's a Trump versus Biden case. But if it isn't, I'm a long term Republican, so we'll see."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMTEvMTUvdGhlLXByb3RvY29sLWV0aGVyZXVtLWxheWVyLTJzLWtlZXAtY29taW5nLWFzLW9reC1hcGVzLWluL9IBZ2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMTEvMTUvdGhlLXByb3RvY29sLWV0aGVyZXVtLWxheWVyLTJzLWtlZXAtY29taW5nLWFzLW9reC1hcGVzLWluL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "The Protocol: Ethereum Layer-2s Keep Coming as OKX Apes In - CoinDesk",
        "content": "LAYER 2'S EVERYWHERE: In last week's The Protocol, we dedicated a not-inconsiderable quantity of ink to the fast-growing list of new \"layer 2\" blockchains aiming to provide a venue for fast and speedy transactions atop Ethereum. Grab another well, cause there's been plenty more announcements already this week. The most notable was inarguably Tuesday's disclosure by the crypto exchange OKX that it plans to build a layer 2 using Polygon's technology. Wednesday brought the news of Kinto, which has raised $5 million this year to develop a layer-2 network that's fully compliant with anti-money-laundering laws using Optimism's OP Stack, and Redstone, an \"alternative data availability\" chain designed by the Lattice team for OP Stack. There are nagging questions about just who is going to use all these networks, but developers suggest there's still not enough. \"We're going to need a lot of L2s,\" Ryan Wyatt, who was just hired by a unit of the Optimism Foundation as chief growth officer after leaving Polygon Labs several months ago, told CoinDesk TV this week. \"One chain, a mainnet, is not going to do it.\" Even Cardano founder Charles Hoskinson tried to elbow into the mix, posting Sunday on X (formerly Twitter) that \"I'm game if you are\" – attaching a link to CoinDesk's article last week about Kraken's discussions with prospective layer-2 technology partners including Polygon, Matter Labs and Nil Foundation – and tagging Kraken Chairman Jesse Powell. One snarky poster replied, \"If this is how we reaching out, most likely not happening.\""
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY3J5cHRvLm5ld3MvbG9va29uY2hhaW4tcmVwb3J0cy13aGFsZXMtYXJlLWRvbWluYXRpbmctdGhlLWV0aGVyZXVtLW1hcmtldC13aXRoLWJpZy1zYWxlcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Lookonchain reports whales are dominating the Ethereum market with big sales - crypto.news",
        "content": "In a Nov. 14 post, the cryptocurrency on-chain data analysis firm Lookonchain reports whale activity amid Ethereum price surge.\n\nNotable sales have included a $154 million profit for one whale and a loss of $183 million for another.\n\nWhale movement on chain\n\nIn the thread, Lookonchain points to the whale at address “0xee47,” that has reportedly increased their Ethereum (ETH) holdings by 3,200 ETH, equivalent to approximately $6.7 million. This accumulation comes seven months after the whale initially began acquiring ETH on July 5, 2022. Presently, their holdings stand at 183,742 ETH, valued at around $387.8 million, reflecting an unrealized profit of approximately $154 million.\n\nBullish or Bearish on $ETH?\n\n\n\nDid SmartMoneys and Whales buy or sell $ETH over the past week?\n\n\n\n1/🧵\n\n\n\nHere is a thread. pic.twitter.com/8yvCO0UI9H — Lookonchain (@lookonchain) November 14, 2023\n\nIn a parallel occurrence, another whale at address “0x78D0” has been actively accumulating ETH since May 24. This particular whale reportedly acquired 12,680 ETH at an average price of $1,768 from the Kraken exchange. As of the latest available data, their total holdings amount to $26.16 million, with an unrealized profit reaching an estimated $3.7 million.\n\nYou might also like: Ethereum and Everlodge price prediction: Dogecoin Foundation member issues warning\n\nAt the same time, whale “0xBf71” deposited 30,001 ETH, worth $62 million to finance, in what is a total loss of $183 million.\n\nHolding steady at $2,000\n\nOver the last five days, Ethereum has maintained a position above the $2,000 threshold following the registration of an iShares ETH Trust by BlackRock, the world’s largest asset manager boasting $9.4 trillion in assets under management.\n\nThe trust was officially registered on Nov. 9, and in the aftermath of this development, Ethereum experienced a 9% increase gaining the attention of the everyday investor and whale alike.\n\nFollow Us on Google News"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vZGVjcnlwdC5jby8yMDU5ODgvZGVmaS10b2tlbnMtc3VyZ2UtYml0Y29pbi1ldGhlcmV1bS1sYWfSAUZodHRwczovL2RlY3J5cHQuY28vMjA1OTg4L2RlZmktdG9rZW5zLXN1cmdlLWJpdGNvaW4tZXRoZXJldW0tbGFnP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin and Ethereum Lag While DeFi Tokens dYdX and Maker See Gains - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA number of decentralized finance (DeFi) assets surged on Tuesday while major cryptocurrencies—including Bitcoin and Ethereum—experienced losses.\n\nDecentralized lender dYdX, which runs on Ethereum, was at the time of writing trading for $3.34, having gained nearly 7% in 24 hours. Over the week, the protocol's native token, ETHDYDX, had boomed by 42%, CoinGecko data showed.\n\nElsewhere, Maker (MKR) also experienced a surge: at the time of writing, it was only up over 1%, trading for $1,366, but had shot up earlier on Tuesday morning Eastern Time to a high of $1,423.\n\nAD\n\nAD\n\nAnd decentralized exchange PancakeSwap (CAKE) was also up nearly 3%, coming in at a price of $2.24.\n\nDeFi refers to the projects in the cryptocurrency space which want to replace traditional financial services, such as borrowing, lending or banking.\n\nSuch projects are new, experimental and prone to hacks—which means respective coins and tokens are volatile.\n\nBitcoin, the largest digital asset by market cap, had lost more than 2% of its value by the time this story was published, and was trading hands for $36,049.\n\nAnd Ethereum, which last week pushed past $2,000, was down nearly 3%. It is priced at $2,041 per coin.\n\nAD\n\nAD\n\nLast week ETH saw major gains on news that BlackRock Advisors, a division of the Wall Street titan, was preparing to file an application for an Ethereum ETF. The iShares Ethereum Trust application is BlackRock's first official application for an Ethereum ETF.\n\nWithin 24 hours after the filing of the iShares Ethereum Trust application, the price of Ethereum crossed the $2,000 mark, a level it had not seen since July 2023. The price of Ethereum experienced a substantial increase, with gains reported at over 8%. Moreover, the trading volume surged by 259%, indicating a significant rise in market activity.\n\nConcurrently, the market capitalization of Ethereum increased by a little more than 10%—reflecting a marked growth in investor confidence and market valuation following the news of the filing.\n\nElsewhere, major coins and tokens were having a rough morning. Solana (SOL), which last week blew up in value, was trading little over $56 per coin, up less than 1%. Even when ETF optimism cooled for Bitcoin and Ethereum, Solana has held onto its gains.\n\nSOL has surged nearly 160% over 30 days. For a few days, it briefly overtook the market capitalization of major stablecoin USDC. But it has since dropped below it again. As of this writing, SOL has a market cap of $23.8 billion and USDC has a market cap of $23.9 billion.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL25hc2RhcS1maWxlcy1wcm9wb3NhbC1zZWVraW5nLXNlYy1ydWxlLWNoYW5nZS10by1hbGxvdy1zcG90LWV0aGVyZXVtLWV0Zi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Nasdaq files proposal seeking SEC rule change to allow spot Ethereum ETF - CryptoSlate",
        "content": "Nasdaq filed a proposal with the SEC seeking approval to list BlackRock’s spot Ethereum exchange-traded fund (ETF) based on the regulator’s recent approval of ETH-based futures ETFs in October.\n\nThe exchange proposed that the regulator allow it to create the iShares Ethereum Trust under its Nasdaq Rule 5711(d) — which governs the listing and trading of commodity-based Trust shares on the exchange.\n\nAdvocating for increased uniformity in the regulation of digital and traditional assets, Nasdaq posits that both Bitcoin (BTC) and Ethereum (ETH) should be governed as commodities and that the rules for spot ETFs for these digital assets should align with those of gold ETF.\n\nThe arguments proposed in the filing are similar to those used in the spot Bitcoin ETF applications. Nasdaq believes the SEC has no grounds to block a spot Bitcoin or Ethereum-based ETF because it allows the CME to host futures-based ETFs for both digital assets.\n\nNasdaq urged the SEC to approve the applications for spot ETFs as it will allow U.S. investors to gain exposure to Bitcoin and Ethereum safely.\n\nSurveillance issue\n\nNasdaq further argued that it meets every requirement set by the regulator to ensure that investors are protected and has a surveillance agreement to monitor market fraud and manipulation.\n\nThe exchange used the same arguments presented in the spot Bitcoin ETF applications. Essentially, Nasdaq claimed that, like the CME, it is a member of the Intermarket Surveillance Group (ISG), which monitors and reports on illicit activity to all its members.\n\nAccording to the exchange, this and its partnership with Coinbase, which monitors spot markets, are sufficient to ensure that investors are adequately protected from fraud and manipulation.\n\nTaking on potential concerns about market surveillance, Nasdaq emphasized that the surveillance mechanisms for a spot Bitcoin or Ethereum market are just as robust as those for a futures market. It added that the CME futures market meets the SEC’s criteria of a market of significant size that is appropriately monitored.\n\nETF details\n\nThe proposed iShares Ethereum Trust will be a collaborative effort, operating under a trust agreement between iShares Delaware Trust Sponsor, an indirect subsidiary of leading investment management corporation BlackRock Inc., and BlackRock Fund Advisors. The ETF will reflect the performance of the price of ETH, the cryptocurrency underlying the Trust.\n\nCoinbase Custody Trust Company will serve as the “Ether Custodian” and hold the bulk of the ETH in cold storage. The filing emphasized that the hardware, software, systems, and procedures of the Ether Custodian may not be easily accessible to investors.\n\nThe ETF’s net asset value (NAV) will be determined based on the total assets, including ETH and cash, minus total liabilities. The filing states that the NAV calculation may not be consistent with U.S. generally accepted accounting principles (GAAP) and that iShared Delaware Trust Sponsor will have the exclusive authority to determine the ETF’s NAV.\n\nThe ETF will rely on the CME CF Ether-Dollar Reference Rate – New York Variant (“CF Benchmarks Index”) for valuation purposes, calculated daily based on Ether-U.S. dollar trading activity across major spot trading platforms."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi1oaW50cy05LXJpc2UtYWhlYWQv0gFOaHR0cHM6Ly9jb2luZ2FwZS5jb20vbWFya2V0cy9ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLWhpbnRzLTktcmlzZS1haGVhZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction Hints 9% Rise Ahead, But There’s a Catch - CoinGape",
        "content": "Ethereum Price Prediction: The Ethereum (ETH) coin recently experienced a significant pullback, with prices dropping 5.5% in four days to reach $2,022. This decline coincided with the Bitcoin price retracement to $36,000, raising questions about Ether’s next move: will it continue its recovery or face a new correction?\n\nAlso Read: Ethereum Network Fees Hit 4-Month With ETH Price Under Pressure, What’s Next?\n\nadvertisement\n\nWill Correction Trend Extend?\n\nThe long-tail rejection at $2030 reflects ETH price found suitable support at this horizontal level\n\nThe post-breakout rally may surge the price by 9% before hitting the major resistance around $2250.\n\nThe intraday trading volume in Ether is $11.6 Billion, indicating 10% loss/\n\nSource- Tradingview\n\nIn the past month, the Ethereum price has shown a notable recovery of 38.44%, with its price escalating from a low of $1,543 to a high of $2136. However, a closer examination of the daily chart indicates that this recovery is still operating within the confines of a rising wedge pattern.\n\nThis pattern has been guiding the ETH price movements for the past 16 months, with the coin price resonating between the converging trendlines that offer dynamic resistance and support.\n\nRecently, as this altcoin price approached the upper trendline of this pattern, it experienced a minor pullback to $2200, likely in an effort to gather bullish momentum. If the buyers can maintain their position above the support levels of $1,222 or $1,830, there is a potential for a 9% surge from its current price, aiming for the overhead trendline around $2,240.\n\nHowever, as per the past price behavior, a retest to the resistance trendline has led to increasing supply pressure and a major correction. Ideally, this pullback may extend to the $1700 mark.\n\nWhale Activity Threatened for Correction\n\nOn November 14th, on-chain data provider Lookonchain on its X platform highlighted significant movements by smart money investors in Ethereum. The past week has seen several large transactions, suggesting that whales are actively engaged in the market. Interestingly, a majority of these transactions seem to be profit-taking or movements of the asset back to exchanges, potentially indicating a readiness to sell. This could increase supply pressure on Ethereum, possibly leading to a further decrease in its price\n\nExponential Moving Average (EMA): The 20-day EMA slope could provide an additional slope amid the pullback phase.\n\nMoving Average Convergence/Divergence: A bullish crossover state between the MACD (blue) and signal(orange) accentuates the overhead market sentiment."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZGVjcnlwdC5jby8yMDU5NjYvZXRoZXJldW0tYW5kLWJpdGNvaW4taG9sZC1zdGVhZHktYXMtdXMtaW5mbGF0aW9uLWNvb2xzLXRvLTMtMtIBXWh0dHBzOi8vZGVjcnlwdC5jby8yMDU5NjYvZXRoZXJldW0tYW5kLWJpdGNvaW4taG9sZC1zdGVhZHktYXMtdXMtaW5mbGF0aW9uLWNvb2xzLXRvLTMtMj9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Ethereum and Bitcoin Hold Steady, But Solana Gains as US Inflation Cools to 3.2% - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCryptocurrency prices held ground on Tuesday after a widely watched inflation gauge in the U.S. showed consumer prices were flat in October.\n\nThe Consumer Price Index (CPI) rose 3.2% in the 12 months through October, the Bureau of Labor Statistics said Thursday. Economists expected the index to show an annual increase of 3.3%, down from a 3.7% clip reported last month.\n\nAD\n\nAD\n\nOn a month-to-month basis, the index, which tracks price changes across a broad range of goods and services, was unchanged after a 0.4% jump in September. October's rise in shelter prices was offset by a 5.3% decrease in gasoline prices, the BLS said.\n\n\"Overall, inflation came softer than expected,” Dessislava Aubert, a research analyst at Kaiko, told Decrypt. “And it’s pretty good news for risk assets in general because it means that the Fed is done hiking.”\n\nBitcoin and Ethereum traded hands at $36,600 and $2,000, respectively, according to CoinGecko. While both coins notched slight gains shortly after the report’s release, Bitcoin was down 0.6% over the past day, while Ethereum was flat.\n\nEven though crypto’s two largest coins had a muted reaction to the CPI print, the report appears to have influenced Solana, Lucas Outumuro, head of research at IntoTheBlock, told Decrypt. Solana rose 4.7% to $57 in the hour following its release, according to GoinGecko.\n\n“Naturally, capital rotates in crypto from the larger [market] caps into smaller [market] caps,” he said. “And that is people seeking higher risk.”\n\nAdditionally, altcoins like Solana tend to have a higher market capitalization relative to the fees they generate, especially when compared to Ethereum, Outumuro noted. A softer CPI print that is supportive of risk assets is good news for smaller protocols in general, he said.\n\nAD\n\nAD\n\n“They have much higher multiples in terms of like their market cap relative to their fees,” he said. “And the discount rate, in theory, should affect them more strongly, since most of their revenues are in the future, rather than in the present.”\n\nThe Federal Reserve has raised interest rates aggressively over the past year and a half to curb inflation, which topped out at a 40-year high of 9.1% last June. Inflation has moderated steadily since then, but it remains above the Fed’s target of 2% annually.\n\nThe U.S. central bank decided to hold interest rates steady this month at a target range of 5.25% to 5.50%, representing its second pause in a row. Fed Chair Jerome Powell signaled officials are “proceeding carefully” in light of risks and “how far we have come.”\n\nBy raising its benchmark rate, the Fed influences how expensive it is for businesses and consumers to borrow. The U.S. central bank hopes that U.S. companies will raise prices less rapidly in response to how higher rates subdue economic demand.\n\nWhile higher interest rates could help bring inflation under control, they could also tip the economy into a recession if borrowing rates suffocate economic growth too much. So far, the labor market and economy have shown signs of “resilience,” Powell said earlier this month.\n\nOliver Rust, head of product at independent inflation data aggregator Truflation, told Decrypt he doesn’t expect the U.S. central bank to raise rates in the near future. At the same time, Rust believes the Fed will hold rates where they are for a prolonged period. “I'm expecting interest rates to say higher for longer—for a very long time,” he said, adding that traders shouldn’t a rate cut in the first quarter of next year.\n\nOver the past month, expectations of a quarter-point rate hike in December have fallen to 15% from 29%, according to the CME Group’s FedWatch Tool. As of this writing, traders think it's most likely that the Fed will begin cutting rates in June.\n\nAmericans may feel inflation is still rampant. Yet prices in the U.S. appear stagnant compared to Argentina. As the country prepares for a presidential run-off, featuring an anti-central bank candidate, it reported inflation hit 143% in October on Monday.\n\nAD\n\nAD\n\nEditor's note: This post was updated to add comments from analysts at Kaiko, IntoTheBlock, and Truflation.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLW5ldHdvcmstZmVlcy1oaXQtNC1tb250aC13aXRoLWV0aC1wcmljZS11bmRlci1wcmVzc3VyZS13aGF0cy1uZXh0L9IBZGh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLW5ldHdvcmstZmVlcy1oaXQtNC1tb250aC13aXRoLWV0aC1wcmljZS11bmRlci1wcmVzc3VyZS13aGF0cy1uZXh0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "ETH Price: Ethereum Network Fees Hit 4-Month With ETH Price Under Pressure, What’s Next? - CoinGape",
        "content": "After a string upswing to $2,100 last week after the news of BlackRock filing a spot Ethereum ETF, the ETH price has come under some selling pressure and is currently trading at $2,036.04 level.\n\nEthereum Fees Hit 4-Month High\n\nEarlier this week on Sunday, November 12, the Ethereum network fees climbed to $5.72 per transaction hitting its highest levels since July 2023.\n\nadvertisement\n\nOn-chain data provider Santiment noted that with the resurgence of Ethereum (ETH) above $2,000 last week and increased network activity, it’s no surprise that fees have also climbed. However, in relative terms, transaction costs remain affordable compared to the elevated average fee levels of $14 observed in May. Keep an eye on the potential impact on other ERC-20 tokens as well.\n\nETH Price and Options Data\n\nThe Ethereum chart reveals a recent pullback following a significant price surge, indicating a momentary pause in the market. This consolidation phase is considered healthy, providing an opportunity for the market to establish new support levels. Ethereum’s price remains comfortably above both its 50-day and 100-day moving averages, signaling an overall bullish trend. The relative strength index (RSI) has retreated from overbought levels, creating potential room for another upward price movement.\n\nIf Ethereum maintains its support and avoids dipping below the moving averages, there’s potential for another rally, potentially fueled by increased adoption and positive market sentiment. Observing a narrowing of Bollinger Bands, followed by a breakout above the upper band, could indicate the beginning of another bullish phase.\n\nIn recent trading activity, Ethereum witnessed increased block trades, with 60,000 options accounting for 40% of the day’s total volume, amounting to a notional value of $120 million. The primary trade involved December calls, with a notable transaction of nearly $50 million, likely representing the closure of a previous market maker’s position.\n\nDuring this ongoing bull market, significant whales initiated long positions in October, yielding substantial profits. With the bull market still intact, these major players have yet to close their positions, maintaining a continued bullish stance."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3RoZWNyeXB0b2Jhc2ljLmNvbS8yMDIzLzExLzE0L2V0aGVyZXVtLWluc2lkZXItc2F5cy12aXRhbGlrLWJ1dGVyaW4tYW5kLWpvc2VwaC1sdWJpbi1zYWJvdGFnZWQtY3J5cHRvLWVuZ2FnZWQtaW4tZnJhdWR1bGVudC1pY29zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Insider Says Vitalik Buterin and Joseph Lubin Sabotaged Crypto, Engaged in Fraudulent ICOs - The Crypto Basic",
        "content": "Renowned crypto advisor Steven Nerayoff accuses Ethereum founders Vitalik Buterin and Joseph Lubin of sabotaging crypto and engaging in fraudulent ICOs.\n\nSteven Nerayoff, an early Ethereum advisor, has continued to make shocking allegations against ETH founders Joseph Lubin and Vitalik Buterin.\n\nEthereum Founders Accused of Sabotaging Crypto\n\nIn a series of tweets today, Nerayoff accused Buterin and Lubin of sabotaging the crypto industry.\n\n- Advertisement -\n\nAccording to the renowned crypto advisor, the Ethereum execs were more focused on issuing thousands of fraudulent tokens via initial coin offerings (ICOs) and fleecing investors.\n\nDid Vitalik invent anything? No he did not. Ethereum never scaled bc of him. Only killer app was issuing Utility Tokens on ICOs both of which I invented. Vitalik & Lubin sabotaged crypto. Their focus was merely to issue hundreds or thousands of fraudulent ICOs fleecing people. — Steven Nerayoff (@StevenNerayoff) November 14, 2023\n\nButerin Responsible for Ethereum Scalability Woes\n\nNerayoff made the claim in response to an XRP enthusiast who alleged that Buterin was sleeping on Ripple CTO David Schwartz’s couch when he sought an internship opportunity at the San Francisco-based blockchain company.\n\nAs reported last year, former Ripple director Matt Hamilton first drew attention to this allegation during a debate about decentralized projects. Since Hamilton made the allegation, several XRP enthusiasts have been using the comment to troll Buterin.\n\n- Advertisement -\n\nCommenting on this criticism, Nerayoff asserted that Buterin never did not invent anything. Furthermore, the crypto advisor mentioned Buterin as the major reason why the Ethereum network faced scalability challenges.\n\nNot New\n\nThis is not the first time Nerayoff has made shocking allegations against the team behind the Ethereum project. Earlier this month, Nerayoff claimed that the corruption that happened at Ethereum was 1,000 times bigger than the FTX saga,\n\nTo further buttress this, Nerayoff claimed that Lubin and Buterin had secret dealings with government officials, including SEC chairman Gary Gensler and his predecessor Jay Clayton, to establish a favorable regulatory environment for ETH.\n\nDuring his recent appearance on the Crypto Town Hall show, Nerayoff disclosed that he would soon start dropping evidence to support his claims about Ethereum founders’ fraudulent activities.\n\nNotably, the former advisor became vocal about Ethereum operations after he was charged with alleged extortion in 2019. However, the DoJ withdrew the case, with many speculating that Nerayoff’s allegations against the government could be factual."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tc3BvdC1ldGYtYmxhY2tyb2NrLXNlYy_SAUpodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2V0aGVyZXVtL2V0aGVyZXVtLXNwb3QtZXRmLWJsYWNrcm9jay1zZWMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Spot ETFs: BlackRock Takes The Fight To SEC With New Filing - NewsBTC",
        "content": "BlackRock and NASDAQ have outlined why the SEC needs to approve the investment company’s new spot Ethereum exchange-traded fund (ETF) filing. According to the filing with the SEC, approval of a Spot ETH ETP would represent a major win for the protection of U.S. investors in the crypto asset space.\n\nIf approved, the iShares Ethereum Trust would allow regular investors to trade Ether, the world’s second-largest cryptocurrency by market cap, as easily as stocks can be traded.\n\nBlackRock And NASDAQ Lobbies SEC To Allow Spot ETH ETFs\n\nBlackRock, the world’s largest asset manager, recently applied to the SEC to launch an Ethereum exchange-traded fund (ETF) linked to the spot price of Ethereum. BlackRock wasn’t the first investment company to make this type of application, as hedge fund Ark Invest already filed for a Spot Ethereum ETF in September. However, the news of BlackRock’s filing sent Ethereum surging more than 11% in less than 24 hours. As a result, ETH broke over the strong $2,000 resistance level for the first time in seven months.\n\nBlackRock’s Spot ETF is called the “iShares Ethereum Trust” and is sponsored by Ishares Delaware Trust Sponsor LLC, a subsidiary of Blackrock Inc. Coinbase, the largest crypto exchange in the US, acts as the custodian for the Trust’s ether holdings, which are to be traded on the NASDAQ exchange.\n\nIn its SEC filing, NASDAQ asked for a proposed rule change in order for it to list and trade shares of the ETF. According to the filing, US investors, for the most part, have lacked a US-regulated way to gain exposure to Ethereum investments. It also argues that most of the current methods are risky and subject to high trading fees and volatile discounts.\n\nFor example, an investor who purchased the largest OTC ETH Fund in January 2021 and held the position at the end of 2022 would have had a 30% loss due to the change in the premium/discount, even if the price of ETH did not change. However, a spot ETH ETP like the proposed iShares Ethereum Trust ETF would better protect investors against the risk of losses through fraud and high premiums.\n\n“To this point, approval of a Spot ETH ETP would represent a major win for the protection of U.S. investors in the cryptoasset space,” the filing said.\n\nPotential Impact On Ethereum Price If The ETF Is Approved\n\nDespite spot crypto ETFs being available in other countries, including Germany, France, and Canada, the SEC has been hesitant to greenlight a crypto ETF in the US, and 12 Bitcoin spot ETFs are currently waiting for approval.\n\nA US Spot Ethereum ETF would significantly boost interest and confidence in Ethereum and ultimately drive the asset to new highs. The hype leading up to the approval may also push the asset to a new yearly high.\n\nETH is up by more than 60% this year and has outperformed BTC in the past few days. It is currently trading at $2,060 and analysts believe a bullish cross over $2,150 would signal the end of the bear market for ETH.\n\nETH price remains above $2,000 | Source: ETHUSD on Tradingview.com\n\nFeatured image from DataWallet, chart from Tradingview.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZGVjcnlwdC5jby8yMDYyMTIvc2VjLW5lZWRzLW1vcmUtdGltZS1vbi1ncmF5c2NhbGUtZXRoZXJldW0tZnV0dXJlcy1ldGbSAVVodHRwczovL2RlY3J5cHQuY28vMjA2MjEyL3NlYy1uZWVkcy1tb3JlLXRpbWUtb24tZ3JheXNjYWxlLWV0aGVyZXVtLWZ1dHVyZXMtZXRmP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "SEC Needs More Time on Grayscale Ethereum Futures ETF - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe U.S. Securities and Exchange Commission has delayed a decision on the Grayscale Ethereum futures exchange-traded fund (ETF).\n\nGrayscale Investments filed to the Wall Street regulator back in September. The fund would allow investors to buy shares that bet on the future price of Ethereum (ETH), the second-biggest digital asset by market cap.\n\nBut the SEC said today that it would delay the decision. The SEC regularly extends the period it has to give decisions on crypto products.\n\nAD\n\nAD\n\n\"The Commission finds it appropriate to designate a longer period within which to take action on the proposed rule change so that it has sufficient time to consider the proposed rule change and the issues raised therein,\" the SEC wrote in its filing.\n\nIt currently has a number of spot Bitcoin ETF applications to approve. Lots of high-profile Wall Street firms—including BlackRock—have applied to the regulator to release their own product.\n\nAn ETF is a popular investment vehicle that tracks the value of an underlying asset. Investors have been calling for a Bitcoin ETF for the best part of a decade, but the SEC has always said no to approving one, mainly citing concerns around market manipulation.\n\nEthereum futures ETF first started trading in the U.S. last month when firms ProShares, VanEck, Bitwise, Valkyrie, Kelly, and Volshares collectively debuted a total of nine products on the Chicago Board Options Exchange (CBOE).\n\nGrayscale has clashed with the SEC over its application to turn its Grayscale Bitcoin Trust into an ETF.\n\nAD\n\nAD\n\nGrayscale sued the SEC in June for denying its application; a judge then in August ordered that the SEC's denial of Grayscale's spot Bitcoin ETF application be reviewed, essentially siding with the firm.\n\nGrayscale also filed in October to turn its Ethereum trust into an ETF.\n\nAnalysts at Bloomberg Intelligence have since said there is a 90% chance the U.S. market will have a Bitcoin ETF by January 10.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1yb2xsdXBzLWdvbGQtc3RhbmRhcmQtcmV2aXNpdC1wbGFzbWEtYnV0ZXJpbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Ethereum's rollups are 'gold standard' but Plasma needs a revisit — Buterin - Cointelegraph",
        "content": "Plasma, a once-prominent Ethereum layer-2 scaling solution, should be revisited by teams currently working on zero-knowledge (ZK) Ethereum Virtual Machines (EVMs), said Ethereum co-founder Vitalik Buterin.\n\nInvented in 2017, Plasma diverts data and computation — except deposits, withdrawals and Merkle roots — to an off-chain environment.\n\nIt was superseded by optimistic and ZK-rollups as the two solutions offered cheaper client-side data storage costs and security properties that “cannot be matched,” Buterin explained in a Nov. 14 X (Twitter) post.\n\nExit games for EVM validiums: the return of Plasmahttps://t.co/QgyzXAl0wv — vitalik.eth (@VitalikButerin) November 14, 2023\n\nButerin said rollups remain the “gold standard,” but Plasma is an “underrated design space” that shouldn’t be forgotten.\n\n“Plasma can be a significant security upgrade for chains that would otherwise be validiums,” Buterin added.\n\n“The fact that ZK-EVMs are finally coming to fruition this year makes it an excellent opportunity to re-explore this design space, and come up with even more effective constructions to simplify the developer experience and protect users’ funds.”\n\nLike Plasma, validiums move data and computation off-chain but implement ZK-proofs to validate transactions. Plasma, on the other hand, uses fraud proofs, which are much slower.\n\nButerin argued improvements in ZK-proofs, such as validity proofs, address the past limitations of Plasma, making it more viable as a scaling solution.\n\nAdapting Plasma for applications beyond payments has also proven to be an Achilles heel for Plasma before ZK-proofs entered the mainstream, Buterin acknowledged.\n\nButerin expects the Ethereum layer-2 ecosystem to evolve with diverse technological approaches.\n\nBabe wake up Vitalik just revived Plasma — sassal.eth (@sassal0x) November 14, 2023\n\nRelated: Did Ethereum Silently Give Up on Plasma?\n\nMinimal Viable Plasma, Plasma Cash and Plasma Cashflow are among the iterations that have stemmed from Plasma.\n\nEthereum layer-2 scaling-focused firm Polygon Labs implemented Plasma in 2019 but has incorporated several other solutions since.\n\nThe movement away from Plasma was partially attributed to Plasma Group, a nonprofit research firm announcing that i would cease working on Ethereum-based scalability in January 2020.\n\nOMG, the token of OMG Network — which uses Plasma — spiked 28.6% to $0.78 in a three-hour window following Buterin’s post, according to CoinGecko. However, it has since fallen 14.3% to $0.67.\n\nMagazine: ZK-rollups are ‘the endgame’ for scaling blockchains: Polygon Miden founder"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtd2hhbGVzLWFyZS1tYWtpbmctd2VpcmQtbW92ZXMtd2hhdHMtaGFwcGVuaW5n0gFOaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtLWV0aC13aGFsZXMtYXJlLW1ha2luZy13ZWlyZC1tb3Zlcy13aGF0cy1oYXBwZW5pbmc_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) Whales Are Making Weird Moves: What's Happening? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nRecently, the trading behavior of an Ethereum whale has sparked intrigue as it deviates from the typical \"buy low, sell high\" mantra.\n\nAdvertisement\n\nA whale, known to have narrowly avoided the FTX/Alameda crash by timely withdrawing ETH from the exchange, executed a sale of 6,099 ETH for 12 million USDC at a price of $1,964 per ETH, pocketing approximately $14.3 million. This transaction, occurring just fourhours ago, has raised questions among the trading community: is this whale's trading pattern worth emulating?\n\n1/ A whale who made ~$14.3M on $ETH sold 6,099 $ETH for 12M $USDC at $1,964 4 hrs ago.\n\n\n\nIs this whale worth copy-trading?\n\n\n\nLet's take a look at how he trades.👇 pic.twitter.com/JngtszbIDf — Lookonchain (@lookonchain) November 15, 2023\n\nReviewing the whale's historical activity since December 2022 reveals a series of 22 buy and sell actions, suggesting a strategic approach to trading. However, it is crucial to note that the whale does not consistently buy at the lowest and sell at the peak prices. Instead, they exhibit a pattern that sometimes involves buying and selling in quick succession, regardless of significant price fluctuations, indicating a complex trading strategy that may factor in more than just immediate market prices.\n\nThis behavior indicates a level of risk-taking and a nontraditional strategy that may leverage market sentiment, news or other indicators not immediately apparent to the average trader. The whale's approach, while lucrative in some instances, also comes with its own set of risks, as rapid trading amid volatile price movements can lead to unpredictable outcomes.\n\nThe cryptocurrency community is often tempted to mirror the trades of these whales under the assumption that they have access to privileged information or superior market insights. However, the unpredictable nature of these \"weird moves\" suggests that copying such trading patterns without a deep understanding of the whale's strategy could be precarious.\n\nThe Ethereum market remains vibrant and fluid, with significant trades by whales adding to the complexity of market dynamics."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vdml0YWxpay1ldGhlcmV1bS1pbnNpZGVyL9IBQ2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vdml0YWxpay1ldGhlcmV1bS1pbnNpZGVyL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "‘Vitalik Slept On My Couch & Copied My Inventions’ Ethereum Insider Says - NewsBTC",
        "content": "An Ethereum insider has made startling allegations against Ethereum Founder, Vitalik Buterin, stating that the Russian inventor had copied his creations.\n\nNerayoff Accuses Buterin Of Invention Replication\n\nFormer Ethereum Advisor, Steven Nerayoff has taken to X (formerly Twitter) to accuse Ethereum Founder, Vitalik Buterin of copying his inventions. Nerayoff criticized the intelligence of the current Ethereum leadership, making contentious remarks about Buterin and co-founder of Ethereum, Joseph Lubin.\n\n“Vitalik slept on my couch & copied my inventions. He and SBF are images. They’re not smart because something seems off, something is off. The recording shows his and Joe’s stupidity and ignorance. Hear who understood Ethereum, me or them,” Nerayoff stated.\n\nThe former ETH Advisor continued on his tirade of allegations, casting doubts on Buterin’s contributions to the network. He stated that Buterin had never invented anything substantial and that the ETH founder was the sole reason behind the network never scaling.\n\nThe accusations also suggested that the only significant achievement in the Ethereum ecosystem was the issuance of utility tokens on ICOs, which Nerayoff claimed he had invented.\n\nNerayoff also made startling revelations, accusing Buterin and Lubin of deliberately damaging the cryptocurrency by focusing on issuing fraudulent ICOs to unsuspecting investors and potentially harming them.\n\n“Did Vitalik invent anything? No, he did not. Ethereum never scaled bc of him. The only killer app was issuing Utility Tokens on ICOs, both of which I invented. Vitalik & Lubin sabotaged crypto. Their focus was merely to issue hundreds or thousands of fraudulent ICOs fleecing people,” Nerayoff stated.\n\nEthereum Founder’s Scalability Competence Questioned\n\nIn an X post on Tuesday, Stephen Nerayoff presented thought-provoking questions to the crypto community about Vitalik Buterin’s Ethereum scalability capabilities.\n\nNerayoff released a video on X by a community member, Mr. Huber which featured Vitalik Buterin describing plans for the ETH Network. He told the crypto community to remember the video when he eventually released evidential recordings of his conversation with Buterin about his ideas for ETH 2.0.\n\n“Remember this video when I drop the recording and what I tell Vitalik about 2.0 and to fix misaligned incentive structures. Is Vitalik the savior they bill him as to make Ethereum scale or is he the reason it never scaled? Decide for yourselves,” Nerayoff stated.\n\nThe question raised by the former ETH Advisor has sparked debates and differing opinions about the Ethereum Founders. Although no proper evidence has been presented regarding the accusations laid against Buterin, the crypto community continues to watch and analyze the situation as it unfolds.\n\nETH bulls reclaim $2,000 | Source: ETHUSD on Tradingview.com\n\nFeatured image from CryptoSlate, chart from Tradingview.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9jaGluYS1iYXNlZC1ib3lhYS1pbnRlcmFjdGl2ZS10by1hY3F1aXJlLTEwMG0td29ydGgtb2YtYml0Y29pbi1ldGhlcmV1bS_SAWVodHRwczovL2NyeXB0b3BvdGF0by5jb20vY2hpbmEtYmFzZWQtYm95YWEtaW50ZXJhY3RpdmUtdG8tYWNxdWlyZS0xMDBtLXdvcnRoLW9mLWJpdGNvaW4tZXRoZXJldW0vP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "China-Based Boyaa Interactive to Acquire $100M Worth of Bitcoin, Ethereum - CryptoPotato",
        "content": "Boyaa Interactive, a board and card game company based in China and listed on the Hong Kong Exchanges and Clearing Limited, has announced plans to acquire approximately $100 million worth of cryptocurrency assets, primarily BTC and ETH.\n\nThis strategic business decision comes when institutional crypto investment rises, with Bitcoin and Ethereum emerging as major beneficiaries.\n\nBoyaa’s Purchase of BTC and ETH\n\nThe company’s board of directors suggested that buying crypto assets is vital to helping bolster its presence in the Web3 landscape.\n\nAccording to a document released by the Hong Kong Exchanges and Clearing Limited, Boyaa Interactive has proposed acquiring the assets within a 12-month period. The duration commences upon the proposal’s passage in the Extraordinary General Meeting (EGM).\n\nBoyaa has also stated that a notice for the EGM and any other necessary information as per the listing rules will be sent to the shareholders in the coming days, on or before November 30.\n\nThe document began by referencing a voluntary announcement made on August 10 by the company, which proposed the purchase of crypto.\n\nThis prominent firm is looking to acquire two primary assets: Bitcoin and Ethereum. According to reports, approximately $90 million will be allocated equally between ETH and BTC. The remaining $10 million will be used to purchase stablecoins Tether (USDT) and USD Coin (USDC).\n\nThe company emphasizes that the potential acquisitions will depend on bidding and asking prices for cryptocurrencies in the open market. Boyaa does not intend to pay premiums exceeding 10% of the market prices for these digital assets. The company plans to fund the potential acquisition using its idle cash reserves.\n\nThe board is responsible for determining which cryptocurrencies to acquire and their respective allocation ratios, including the optimal purchase timing.\n\nWhy Bitcoin and Ethereum?\n\nIn the documentation, Boyaa has emphasized its investment in Bitcoin and Ethereum and provided insights into its rationale. Specifically, the company aims to acquire cryptocurrencies that align with its business development strategies, passing rigorous risk management tests.\n\nAdditionally, Boyaa seeks to invest in cryptocurrencies with strong market liquidity and significant market values. Notably, Bitcoin, Ethereum, USDC, and USDT are among the assets with the highest market liquidity.\n\nRecently, large assets such as BTC and ETH have been gaining massive numbers in institutional investments. Reports suggest institutional investors have poured billions into the two significant crypto assets. Institutional investors are looking to take advantage of the long bull season also seemingly nearing."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vZmluYm9sZC5jb20vYmxhY2tyb2Nrcy1zcG90LWV0aGVyZXVtLWV0Zi1hcHBsaWNhdGlvbi1jb3VsZC11bmxvY2stYmlsbGlvbnMtZnJvbS1pbnN0aXR1dGlvbmFsLWludmVzdG9ycy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "BlackRock's spot Ethereum ETF application could unlock billions from institutional investors - Finbold - Finance in Bold",
        "content": "BlackRock Inc. (NYSE: BLK), the financial giant, applied for a spot Ethereum (ETH) ETF on November 9, eyeing a substantial influx of institutional investment into the cryptocurrency market. The ETF, if approved, would allow investors direct exposure to Ether’s price without purchasing the digital asset directly.\n\nThe company’s step towards Ethereum signals a broadening interest in digital assets beyond Bitcoin (BTC). Historically, ETFs often attract substantial investment due to their ease of access and simplification of asset buying for institutional players who don’t want to self-custody their holdings.\n\nIndustry observers assert that BlackRock’s suite of offerings in the cryptocurrency sector could bolster market infrastructure and investor confidence. The move arrives amidst a more robust regulatory environment and a climbing interest in cryptocurrencies from traditional financiers.\n\nIf the U.S. Securities and Exchange Commission greenlights the application, this would mark an unprecedented step. It would establish the first-ever spot Ether ETF in the U.S. Nevertheless, BlackRock has also disclosed potential risks, like indirect exposure to stablecoins.\n\nAnalysts opinion on a BlackRock’s spot Ethereum ETF\n\nDespite the forecasted risks, analysts predict an ETF could lead to unlocking billions of dollars from institutional investors, according to a complete report by Kitico News on November 14.\n\nDavid Waugh, business development and communications specialist at Coinbits, believes this move highlights BlackRock’s interest in the “broader cryptocurrency space.”\n\n“The spot ETH ETF news has already caused short-term positive price movement. The increased buying from institutional investors will create upward price pressure.” — David Waugh\n\nNotably, four other experts demonstrate a bullish bias for both Ethereum, Bitcoin, and cryptocurrencies following this news. All of them told Kitico News they foresee an increased institutional interest moving forward and believe BlackRock’s filings have a very high chance of approval.\n\nThe firm’s influential position is repeatedly mentioned as a gateway for significant institutional money into the cryptocurrency market. BlackRock’s potential new product represents a pivotal moment for the integration of these previously rejected digital assets into mainstream finance.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMinAFodHRwczovL2NyeXB0b25ld3MuY29tL25ld3MvY3J5cHRvLW1hY3JvLXdlZWtseS1ldGhlci1ldGgtcHVtcHMtMTEtYWJvdmUtMjEwMC1hcy1ibGFja3JvY2stZmlsZXMtZm9yLXNwb3QtZXRoZXJldW0tZXRmLWFzLWJyb2FkZXItbWFya2V0LXJhbGx5LWNvbnRpbnVlcy5odG3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Crypto Macro Weekly: Ether (ETH) Pumps 11% Above $2,100 as BlackRock Files For Spot Ethereum ETF as Broader ... - Cryptonews",
        "content": "Crypto Macro Weekly: Ether (ETH) Pumps 11% Above $2,100 as BlackRock Files For Spot Ethereum ETF as Broader Market Rally Continues\n\nEther (ETH), the cryptocurrency that powers the smart contract-enabled Ethereum blockchain that remains the dominant chain in the DeFi, NFT and broader web3 industries, stole the spotlight from its bigger rival Bitcoin (BTC) this week, and was last up close to 11% since Sunday after BlackRock filed to set up a US spot Ethereum ETF with Nasdaq.\n\nEther (ETH) eclipsed $2,100 for the first time since April on Thursday and came close to hitting new highs for the year as BlackRock revealed via its Nasdaq filing that it will soon apply to set up a spot Ethereum ETF with the SEC, just as it applied to set up a spot Bitcoin ETF with the SEC back in June.\n\nBlackRock’s June application to set up a spot Bitcoin ETF was quickly followed by a dozen similar applications from rival asset managers and was undoubtedly an important turning point for the Bitcoin market it 2023.\n\nIndeed, the Bitcoin price is up around 45% since the start of June after hitting fresh highs for the year above $38,000 this week as investors bet that spot Bitcoin ETFs will soon gain approval and this will spur significant institutional inflows into the cryptocurrency.\n\nAs per sources cited by Fox Business journalist Charles Gasparino in a tweet on Thursday, BlackRock is growing increasingly confident its spot Bitcoin ETF will be approved by January\n\nThursday’s announcement of its spot Ethereum ETF plans by BlackRock could be an important turning point for the crypto market.\n\nSince June, Bitcoin has increased its market dominance, outperforming by a significant margin, with the ETH/BTC ratio dropping over 24% at one point.\n\nHowever, in light of ETH’s latest spot ETF optimism-fuelled pump, the tide could be starting to turn.\n\nCould we be about to transition from a Bitcoin-led bull market, into a broader rally with the likes of ETH outperforming.\n\nETH to $3K and BTC to $69K? Bullish Calls Are Growing\n\n\n\nPrior to BlackRock’s spot Ethereum ETF announcement this week, Matrixport’s head of research Markus Thielen put out a now seemingly very well-timed call for a new period of ETH outperformance, even going as far as calling for a rally back towards $3,000.\n\nThielen cited an improvement in Ethereum network on-chain activity that has turned the ETH deflationary once again, as well as a technical breakout from a long-term pennant structure.\n\nMeanwhile, Matrixport has reiterated calls for Bitcoin to hit a price of at least $42,000 on spot Bitcoin ETF approvals in the US, while other analysts have outlined the $48,000 level as the next major bullish price target.\n\nTrading.biz analyst Cory Mitchell went even further in a note shared with members of the crypto press earlier this week, predicting that Bitcoin could hit new all-time highs as soon as mid-2024, an 85% rally from current levels.\n\n“Bitcoin uptrends tend to move quickly once they get going, moving hundreds of percent often in less than a year,” he noted, calling this stage of the market “the acceleration phase”.\n\nThe “really big gains” historically come a year and a half after Bitcoin price has bottomed, Mitchell explained, which points to a pump coming sometime around mid-2024, with BTC having last bottomed back in November 2022.\n\n“In 2013, bitcoin rallied 1200% in approximately 100 days… in 2017, it rallied 1900% in just under a year… in late 2020, it rallied 400% in about 140 days”.\n\nMacro Takes a Back Seat, But is a Growing Tailwind\n\n\n\nSpot crypto ETFs are the big talking point right now, with the broader macro picture taking a back seat in the minds of crypto investors.\n\nBut when investors do switch their focus to developments in traditional financial markets, they will notice that current market trends are undoubtedly positive for the crypto market, adding another potentially major tailwind.\n\nWhile Fed policymakers this week, including Fed Chair Jerome Powell, have tried to warn the market that further rate hikes remain on the table, investors appear to be betting otherwise.\n\nWeaker-than-expected US ISM manufacturing PMI data, seen as a strong lead indicator for the economy’s broader performance, flashed warning signs last week that the US economy is slowing drastically from its strong Q3 performance.\n\nMeanwhile, the US jobs market continues to cool, as evidenced by last Friday’s weaker-than-expected October NFP and unemployment numbers, which should make the Fed’s task in bringing inflation back under control easier, reducing the need for higher interest rates for longer.\n\nLong-term US government bond yields have dumped so far this month, with the 10-year yield last down over 30 bps at 4.6%, and this has helped spur a pump in the US stock market, with the S&P 500 up nearly 5%.\n\nRising stock prices and falling US yields as investors bet on a less “hawkish” stance from the Fed represent an easing of financial conditions, and cryptocurrencies tend to perform very well in such an environment, as was very much the case in 2020 and 2021.\n\nSmaller Altcoins Take the Lead\n\n\n\nIn a sign that sentiment in the crypto market is really starting to heat up, major altcoins continue to pump.\n\nIn just the past seven days, Chainlink (LINK) has pumped nearly 35%, Solana (SOL) is up over 30% and Polygon (MATIC) is up over 25%.\n\nAs per blockchaincenter.net, the crypto market Altcoin Season Index was last at 29, up from 17 at the start of the month, suggesting the crypto market has left “Bitcoin Season” territory (defined as below 25).\n\nHowever, we remain a long way from being in Altcoin Coin Season (defined as above 75), suggesting that there is a lot of room for disproportionate upside in the altcoin market, assuming the Bitcoin (BTC) price continues to pump.\n\nLooking ahead, crypto traders will remain transfixed on news relating to spot crypto ETFs in the US, but upcoming macro events like next week’s US Consumer Price Index inflation and Retail Sales figures for October could further spur the crypto rally if they trigger a fresh pullback on Fed tightening bets.\n\nBitcoin bulls will be eyeing a potential test of the psychologically important $40,000 level, while Ether bulls will be pushing for a break above earlier yearly highs inn the mid-$2,100s which could open the door to a pump towards $3,000."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZGFpbHljb2luLmNvbS9zb2xhbmEtdXAtMTUwLW92ZXJ0YWtlcy1ldGhlcmV1bS1pbi1hY3RpdmUtdXNlcnMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Solana Up 150%, Overtakes Ethereum in Active Users - DailyCoin",
        "content": "Solana sees almost 150% price increase in 30 days, trading above $50.\n\nSolana surpasses Ethereum in daily active users by 10%.\n\nProgress in Solana’s upgrades influences market confidence and user activity.\n\nSolana (SOL) has recently made headlines with its noteworthy performance. As a major player in the altcoin market, Solana’s movements have significant implications for the industry. Its recent surge in price and user activity, particularly overtaking Ethereum in daily active users, has attracted the attention of investors.\n\nSolana’s Remarkable Rise: A Detailed Look\n\nSince early October, Solana has been leading the altcoin rally with consistent gains. On Tuesday, November 14, SOL’s price skyrocketed by almost 150% over a 30-day timeframe, leading the latest crypto rally.\n\nThe latest surge saw Solana trade above $50 for the first time in 18 months. Currently, Solana is trading at $54.48. However, it’s not just investors that have seen renewed confidence in Solana; users are coming back too.\n\nOn November 11, Solana’s daily active users reached an impressive milestone, overtaking Ethereum mainnet users by 10%. This surge in user activity, from around 200,000 in September to over 356,000, underscores Solana’s growing relevance in the crypto ecosystem.\n\nSolana’s Ecosystem Growth and Market Impact\n\nThese developments are partly attributed to Solana’s ongoing upgrades and a broader market rally. The recent progress towards the network’s Firedancer upgrade and the easing of concerns regarding the FTX bankruptcy estate’s potential impact on SOL’s market have played a crucial role.\n\nAdditionally, the broader cryptocurrency market has shown signs of recovery, with Solana outperforming many rival digital assets.\n\nSolana’s ecosystem is experiencing significant growth across various sectors. The network’s total value locked in DeFi protocols, a key indicator of ecosystem health and utility, has seen a 62% increase, according to DeFiLlama.\n\nOn the Flipside\n\nWhile Solana’s progress is impressive, it’s essential to recognize Ethereum’s position. For one, Ethereum has a strong Layer 2 ecosystem. These networks, designed to enhance transaction speed and reduce costs, have attracted over 800,000 users across the top seven networks, overshadowing Solana.\n\nFurthermore, Ethereum’s broader ecosystem, including Layer 2 solutions, drives about 60 transactions per second, accounting for a significant portion of the blockchain activity.\n\nWhy This Matters\n\nSolana’s emergence as a formidable contender represents the broader blockchain innovation trend.\n\nRead more about Solana:\n\nSolana (SOL): The Fastest Layer One Blockchain\n\n\n\nRead more about JP Morgan’s stance on Bitcoin ETFs:\n\nJP Morgan Questions Bitcoin Spot ETF Market Excitement"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL3N0ZXZlbi1uZXlhcm9mZi1yYWlzZXMtc2VyaW91cy1hbGxlZ2F0aW9ucy1hZ2FpbnN0LWV0aGVyZXVtLWZvdW5kZXJzLWhlcmVzLXdoYXRzLWhhcHBlbmluZy_SAXpodHRwczovL2NvaW5wZWRpYS5vcmcvbmV3cy9zdGV2ZW4tbmV5YXJvZmYtcmFpc2VzLXNlcmlvdXMtYWxsZWdhdGlvbnMtYWdhaW5zdC1ldGhlcmV1bS1mb3VuZGVycy1oZXJlcy13aGF0cy1oYXBwZW5pbmcvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Founders Accused of Fraud and Scams: What’s the Truth? - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nStory Highlights Steven Neyaroff has accused Vitalik Buterin and Joseph Lubin of fraudulent activities.\n\nNeyaroff has promised to release evidence within 48 hours.\n\nIf proven true, Neyaroff's claims could have a significant impact on Ethereum's reputation and future.\n\nIn a surprising or rather, shocking, turn of events, Steven Neyaroff, a key player in Ethereum’s early days, has leveled serious accusations against the platform’s founders, Vitalik Buterin and Joseph Lubin. Neyaroff, using X (formerly Twitter), has vowed to reveal compelling evidence within the next 48 hours, alleging fraudulent activities by the Ethereum creators.\n\nHere’s what he has to say.\n\nNeyaroff’s Allegations\n\nNeyaroff’s statements have increasingly targeted Buterin, suggesting deeper involvement in what he describes as deceptive practices.\n\nRemember this video when I drop the recording & what I tell Vitalik about 2.0 and to fix misaligned incentive structures. Is Vitalik the savior they bill him as to make Ethereum scale or is he the reason it never scaled? Decide for yourselves. #CryptoJudas #InconvenientTruths https://t.co/BeGzOpYx4o — Steven Nerayoff (@StevenNerayoff) November 14, 2023\n\n“Remember this video when I drop the recording & what I tell Vitalik about 2.0 and to fix misaligned incentive structures. Is Vitalik the savior they bill him as to make Ethereum scale, or is he the reason it never scaled? Decide for yourselves.”\n\nButerin is the Target\n\nNeyaroff’s recent messages increasingly focus on Vitalik Buterin, suggesting deeper involvement in what he calls deceptive practices. He confidently questions Buterin’s role in Ethereum’s struggle to scale, hinting at a lack of innovation.\n\nQuestioning Buterin’s originality, Neyaroff asserts that Ethereum’s challenges in scaling can be directly linked to a lack of innovative solutions from Buterin. The cryptocurrency world is left wondering whether Buterin is the scaling savior he’s touted to be or a hindrance to Ethereum’s growth.\n\nFraudulent ICOs?\n\nIn a shocking twist, Neyaroff accuses Buterin and Lubin of orchestrating fraudulent initial coin offerings (ICOs), claiming these schemes have significantly hampered the cryptocurrency industry’s growth. According to Neyaroff, these ICOs weren’t just diversions but deliberate attempts to profit at the industry’s expense.\n\n“Only killer app was issuing Utility Tokens on ICOs, which I invented. Vitalik & Lubin sabotaged crypto. Their focus was merely to issue hundreds or thousands of fraudulent ICOs fleecing people.”\n\nRead More: Did Ethereum Purchase a Free Pass From Hinman? Ripple-SEC Lawsuit Takes a Shocking Twist\n\nUncertainty and Stress\n\nThe cryptocurrency community now waits anxiously for Neyaroff’s promised evidence, which could potentially shake Ethereum’s foundations. If proven true, Neyaroff’s claims may have broad implications for Ethereum’s reputation and future. As the clock ticks down, the next 48 hours hold the key to uncovering the truth behind Neyaroff’s explosive allegations, creating palpable anticipation worldwide."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS92aWRlby9ldGhlcmV1bXMtbmV4dC13YXZlLW9mLWFkb3B0aW9uLWlzLWNvbWluZy1vcHRpbWlzbS11bmxpbWl0ZWQtY2hpZWYtZ3Jvd3RoLW9mZmljZXIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Ethereum's 'Next Wave' of Adoption Is Coming: Optimism Unlimited Chief Growth Officer - CoinDesk",
        "content": "Our next guest previously served as president at Polygon Labs and was also the head of Gaming at youtube. Now he's joining a unit of the Optimism Foundation. Joining us to discuss is Ryan Wyatt, the Chief Growth Officer of Optimism Unlimited Ryan. Welcome to the show. Good morning. Thanks for having me. It's good to be back. It's been a little bit. It really has and congratulations the new position. Thank you so much. I'm excited. I'm excited. I'm on the road. You can see him in the hotel room. You all have me up bright and early this morning. I'm ready to rock. We love to get people up bright and early. All right. So from polygon to optimism, both are layer twos, talk to us about the layer two race. Um What makes one layer two stand out above another? No, it's a great question. I think it's fun time to be a part of the Ethereum ecosystem and building. You know, I think one thing we've all really come to the realization as far as those building Ethereum ecosystem is that it's going to take a number of these, whether you call them dedicated app chains L twos, whatever the case may be to really scale this next wave of adoption that we all believe coming, you know, there's a new wave of a lot of developers that are building, there's been a lot of capital deployed across the app ecosystem. A lot of these apps that we haven't even seen yet. Um And so we, as we scale, we're going to need a lot of them. And so what does that mean? Well, how do these things start to speak to each other? How do they become interoperable so that you start to have these very seamless network experiences? You know, I think for users, it's been tough if you're not like very crypto native navigating the ecosystem hasn't been easy. And so we want to make that a lot easier. I think optimism is best positioned to do that with the op stack. You have, you know, companies like Coinbase has chosen optimism to build their, their stack with. So base is A L two that is built on the OPP stack. And when these things start to speak with, one of you can see all these users come in and then be able to seamlessly work around these protocols. So I think point of entry is going to be really important. And what optimism did with Coinbase was pretty critical because I think a lot of us would agree that, you know, a big funnel for crypto users coming in will be through Coinbase. So, why do you like optimism more than Polygon? Oh, I don't know if I would look at it that way. You know, I spent the last decade at youtube in Polygon. Two, almost two years of Polygon. Love my time there. I think it was really fun for me to get to build out, you know, a, a team and organization at Polygon. I think the work that I did there speaks for itself. But optimism is very special for a number of reasons. One, they are far ahead in what they've been able to do from a decentralization standpoint. So they have two different mechanisms which I find to be fascinating. One is what they call retroactive public goods funding. Um And what that does is it, it puts out kind of a, a process for developers on what to build and if they build that and they gain the right traction and activity, then they can be rewarded with op tokens. This is decided by the community. I think this is what's a great part about because as we usher in this next age, we really need to keep moving forward, genuine decentralization. And we can't grow these large teams that are sitting on the protocol side. Or else it's very disingenuous to the idea that we're going to have these networks that are truly owned by nobody. They are owned by the community. And optimism made that a core part of their ethos more than any other chain or protocol that I've seen. And so I think it makes them very special more than Polygon. Did you will get there? Yeah. Polygon will get there. You know, I think it's, it's part of polygon. Were they upset? Were you like, ha ha, I'm leaving for your competitor now? No, I love them. I actually, II, I give all credit to say deep, very kind uh as part of the process, You know, I hired a vast majority of that leadership team and so it's all love you poach their leadership team as well. No, no, I hired a lot of the leadership team at Polygon. I'm on day two. Come on, come on. I work fast but not that fast. I'm only on day two. No, I love that team. I think very highly of the Polygon team. It has more about like, what's a fit for me. And I really like working with this optimism team and where their hearts at and, and, you know, I've been a builder, I started the youtube gaming team. I built out a lot of polygon. I'm excited to do the same thing at optimism. I want to draw on your experience from youtube gaming. Are you hoping to bring game developers to the optimism ecosystem? And if so, what's the value prop there? Yeah, absolutely. I think, you know, that we can improve on as a, as you said in gaming. I love it. I think it's really a matter of focus, there's no technical limitations that's prohibiting optimism from participating in this ecosystem. So I think it's about making sure that we make it a focus a lot of where optimism has done well, has been even on social and identity. So things like friend tech and forecast are all building inside of the op ecosystem. So we're going to go after gaming and, and that will be a big focus for us. It's a good time too because if you think about like the last couple of years, games in web three have been largely pretty rudimentary. You know, if you think about the first iteration, they were, they were almost these, you know, financialized games that, you know, didn't have best kind of optimized outcomes that you would want for. Um So I actually think this next iteration is primed for it. Um And I'm really excited to bring gaming to optimism. It's, it's a no brainer for us. You know, when we talk about gaming, I think a lot of people automatically think about those financialized games when you talk about the next iteration. What does that look like? What is that? Yeah, you know, well, they look at, I mean, honestly, that's, it's such a broad spectrum. You know, there are things like uh fully on chain games where literally every activity that you're doing is actually on chain and then there will be parts of games that are only doing some of it, whether it's the marketplace, whether it's just uh membership passes, whatever they do. I mean, you could really run a variety of different outcomes for how you want games look. I think the really the point it needs to be is that it's got to be games first. You know, I think so much of it has been like the financialization aspect first in the game development, but you saw billions of dollars of capital come into specifically games, web three games, it takes years for games. So I think a lot of it is patience to see more of these, you know, better thought out games, better produced games. And so they're coming, they're on the horizon, they're going to be happening across the ecosystem and look that's just good for the space. I think we all are in an era now and out of our learning is like we need to root for each other and champion each other because we just want developer adoption and we want to start seeing these things succeed and games, games will be in prime time, I think in 2024. So uh what does the space look like right now though between uh let's say between optimism and polygon, as you said, you, you helped build that team. Uh what's the uh the current landscape like? Yeah, I think in terms of market share and, and revenue, etcetera, you know, market share is so is so nascent to have to like put too much of an emphasis on this. I think the real thing that everyone needs to focus on that are L two solutions is look, we've got to scale this thing and you know, one chain like a main net is not going to do it because there will be congestion. So it's like this accepting the fact that we're going to need a lot of L twos in order to do this and how you connect these across the ecosystem. So that's to be the focus. It's not going to be a developer issue. Like there are so many great developers, there's so much capital out there still for those developers, despite what, you know, public might say. And so it's, it's going to be making sure that these user journeys that people that are going to come in and use these apps that it's seamless that it's easy because it hasn't been right. And like that's what all of us need to be focusing on. You know, the big conversation around all of these ecosystems is mainstream adoption. I believe we spoke about it on the show during your time at Polygon lab, Starbucks started their NFT based loyalty program. Any big partnerships in the works for optimism with mainstream brands like Starbucks. Look, I think we'll, you know, my mo so uh I'm sure there will be some in the uh you know, in, in, in the iron but um can't share anything right now, but just work with developers of all sizes, right. Like, I think the beauty of it is you don't know where the next breakout is going to come from. It. It is not a guarantee that it's some large enterprise or fortune 500 company or whatever the case may be. I think it can come from all different shapes and sizes. Yes. You know, you have a company like Coinbase that picks optimism to choose to build their base network on. And so we that's Fortune 500 option. You'll see more of it in the future. But yeah, we are going to work with all sizes and that will be fun. So, yeah, I think keep your eyes peeled. Sure. We'll be on talking more. We'd love to have you back, Ryan. We're gonna have to wrap it there. Thanks so much and congratulations again on the new role. Thanks so much. It was good seeing you both have a great day today. See you soon. That was Ryan Wyatt, Chief Growth Officer of optimism Unlimited."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9wbGF5LXRoZS1ibGFja3JvY2stZXRoZXJldW0tZXRmLXByaWNlLXB1bXAtd2l0aC1ldGhldGYtdG9rZW4tYWxyZWFkeS00MDAtZ2FpbnMtYXQtbGF1bmNoLmh0bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Play the BlackRock Ethereum ETF Price Pump with ETHETF Token – Already 400% Gains at Launch - Cryptonews",
        "content": "Play the BlackRock Ethereum ETF Price Pump with ETHETF Token – Already 400% Gains at Launch\n\nWednesday, November 15, 2023 – A 400% gain for early DEX hunters from ETHETF Token is fuelling a robust Ethereum ETF narrative in the crypto market after the new token launched on Uniswap yesterday.\n\n$ETHETF launched at 1pm GMT on Tuesday and secured quick 4x gains for the earliest buyers amidst strong liquidity and volume, signaling the possibility of much higher prices to come once news of its arrival gets out and the Ethereum narrative takes further hold of the market.\n\nA little over 24 hours after stealth-launching, $ETHETF – playing off positive sentiment around Ethereum ETF news – reached a market capitalization of over $2 million before finding support around $1.2 million. With $520,000 liquidity – locked in the Uniswap V3 pool for seven days – facilitating smooth trading and minimal price slippage, the token has formed a strong foundation.\n\nThe ETHETF Token website states the coin’s intention to be ahead of the curve before BlackRock’s spot ETF is brought to the market, an event that is expected to cause a price explosion for Ethereum (ETH) and all coins associated with it.\n\nTo keep abreast of the latest developments in the ETHETF Token project, follow the X account and join the ETHETF Telegram group.\n\nBlackRock starts off massive Ethereum ETF narrative\n\n\n\nThe Ethereum price broke out towards $2,000 last week following BlackRock’s application for an Ethereum spot ETF, but market watchers have now found another way to play this move.\n\nFor traders, Ethereum’s price has reached historical resistance at the $ 2,000 mark, and staying above this level was a requirement for many analysts to increase their bullish sentiment for altcoins.\n\nSeveral prominent altcoins have seen price increases as much as 100% or more recently as capital rotates from Bitcoin to Ethereum to larger cap alts. Key to sustaining this pump was the bullish BlackRock news for Ethereum.\n\nAs the positive market sentiment surrounding the likelihood of a Bitcoin spot ETF being approved by the US Securities and Exchange Commission (SEC) reaches fever pitch, the hype around a possible Ethereum ETF is only beginning.\n\nWith Bitcoin (BTC) surging 42% from a sticking point around $26,000 all the way up to $37,000 upon the news that the SEC has an option to approve all 12 pending spot Bitcoin ETF applications within a current 8-day window, capital now appears to be moving from BTC to other crypto assets.\n\nEthereum (ETH) spiked from $1,800 to close to $2,100 when the BlackRock ETF news was released, only a 16% move, and should be expected to keep going as more details come out regarding this development.\n\nEthereum’s bullish narrative continues in 2023/24\n\n\n\nDuring the last bear market in 2022, Ethereum stood firm compared to other assets, thanks in no small part to The Merge – an event that transitioned Ethereum from a proof-of-work protocol to proof-of-stake.\n\nThis event, also known as the ‘Shangella’ upgrade, announced Ethereum as a greener blockchain with enormous passive income opportunities due to the ease of being able to stake ETH 2.0 without expensive and complicated mining equipment.\n\nEthereum stayed strong throughout the bear market and bounced back well above its previous bull cycle all-time high of $1,400 thanks to hype around The Merge, while Bitcoin dropped below its $19,000 previous ATH for a good while. This set a strong foundation for bullish developments to take the ETH price higher in 2023 and 2024.\n\nAnd while Ethereum has underperformed compared to Bitcoin in 2023, the news that the largest financial asset manager in the world – with trillions of dollars managed on its books – intends to offer a spot ETF for Ethereum could open the floodgates for the largest altcoin.\n\nWhy Ethereum is the new silver\n\n\n\nThe excitement surrounding ETFs for Bitcoin is for good reason, and gold is often referenced as a precedent of what could happen when a spot ETF is eventually approved and launched. Gold was mainly being traded by institutions before a spot Gold ETF opened the market to retail investors.\n\nGold skyrocketed nearly 350% after the first Gold ETF was approved in the US in 2004, and something similar is expected to happen for Bitcoin.\n\nEnter Ethereum, which is the silver to Bitcoin’s digital gold. As the second-largest and most-trusted crypto asset outside of Bitcoin, a spot ETF for Ethereum would put the newly bonafide ‘digital silver’ into the largest portfolios and launch the currency into the stratosphere.\n\nAssuming BlackRock’s spot Bitcoin ETF gets approved, it should only be a matter of time before its spot Ethereum ETF is also launched to the market. The knock-on effect of that will be substantial as other financial firms launch their own Ethereum ETFs.\n\nSavvy traders view ETHETF Token as the intelligent way to play the Ethereum narrative\n\n\n\nEthereum is expected to hit $2,400 and eventually $3,000 if the crypto bull market continues to pick up steam. If this happens, tokens associated with Ethereum will pump even more, much like previous bull cycles in the market.\n\nWith capital rotation, the rule to play by is that after Bitcoin pumps, Ethereum pumps, and then altcoins. A surge for Ethereum past $3,000 will likely give a token like $ETHETF multiples that would be difficult to find anywhere else.\n\nETHETF Token is an ERC-20 token that is easily accessible on Uniswap for any trader and offers bullish conditions for traders leading up to an Ethereum spot ETF approval.\n\nThe website indicates that there was no presale, a stealth launch and that 95% of the 100 million token supply was allocated to DEX liquidity. With liquidity now at $520,000, locked for seven days, and 24-hour volume totaling $4.37 million, conditions are perfect for explosive upside action.\n\nWith 5% of the token supply allocated to CEX listings, it’s an indicator that the team behind ETHETF Token intends to create something unique and not just another meme-style token. In addition to this, 2% of every buy transaction is burned, which decreases the circulating supply all the time. After just one day, 5.35% of the $ETHETF token supply has already been burned.\n\nOne of the project’s major roadmap milestones happens when the first Ethereum spot ETF is approved; this will result in the 2% buy tax being removed from the smart contract, which will release the shackles for $ETHETF and encourage more upside pressure.\n\nTo buy the token, simply connect your crypto wallet to Uniswap, copy and paste it into the contract address to ensure you are buying the correct coin, and make your purchase. Make sure you have enough ETH left over to pay for gas.\n\nBuy $ETHETF todayDextools Link"
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMioAFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3RvcC0zLXByaWNlLXByZWRpY3Rpb24tYml0Y29pbi1ldGhlcmV1bS1yaXBwbGUtNS1kcm9wLWxpa2VseS1mb3ItYnRjLWFzLWl0LXdvcmtzLW91dC1uZXh0LW1vdmUtbm9ydGgtMjAyMzExMTQxOTAw0gGkAWh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9hbXAvY3J5cHRvY3VycmVuY2llcy9uZXdzL3RvcC0zLXByaWNlLXByZWRpY3Rpb24tYml0Y29pbi1ldGhlcmV1bS1yaXBwbGUtNS1kcm9wLWxpa2VseS1mb3ItYnRjLWFzLWl0LXdvcmtzLW91dC1uZXh0LW1vdmUtbm9ydGgtMjAyMzExMTQxOTAw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Next 3 days could be interesting for BTC as Nov 17 draws - FXStreet",
        "content": "Share:\n\nBitcoin price could fall 5% to bounce at the 250-day EMA at $34,483 for the next leap north.\n\nEthereum price likely to rise 5% to $2,136 range high if the support provided by the ascending trendline above $2,029 holds.\n\nRipple price filling up a symmetrical triangle makes a 10% drop to $0.5981 likely as XRP erases its weekly gains.\n\nBitcoin (BTC) price along with that of Ethereum (ETH) and Ripple (XRP) are static for the moment. However, following recent comments by James Seyffart, an analyst with Bloomberg Intelligence, the US Securities and Exchanges Commission (SEC) has a narrow window ending November 17 to approve spot BTC exchange-traded funds (ETF). On the back of speculation and investors trying to front-run a possible launch, the next three days could be interesting for the king of cryptocurrency.\n\nAlso Read: Week Ahead: Bitcoin ETF approval this week, yay or nay?\n\nBitcoin price eyes 5% slump unless a spot BTC ETF launches\n\nBitcoin (BTC) price could fall 5%, or not, depending on what the US SEC decides to do in the next three days. Whether it will be a yay or nay in regard to the spot Bitcoin exchange-traded funds (ETFs) will be the determining factor as the detailed eight-day window closes fast.\n\nMeanwhile, a 5% slump seems likely for Bitcoin price amid falling momentum. It comes amid buyer exhaustion after BTC was massively overbought. With the Relative Strength Index (RSI) and the Awesome Oscillator (AO) supporting the downside, BTC could slide to test the support confluence between the 25-day Exponential Moving Average (EMA) and the horizontal line at $34,483 before a possible bounce.\n\nIn a more dire case, the slump could crack past $34,483 to test the 50-day EMA at $32,332. Selling pressure could see Bitcoin price lose critical support at $31,190. A daily candlestick close below this level would invalidate the bullish thesis.\n\nBTC/USDT 1-day chart\n\nOn the flipside, increased buying pressure, which would happen if the SEC approves the launch of a spot BTC ETF, could send Bitcoin price north, clearing the range high at $37,972 to bring the $40,000 psychological level into sight.\n\nAlso Read: Bitcoin rages on, $40,000 may not be a hopium pipe dream for BTC after all\n\nEthereum price must hold above ascending trendline to realize upside potential\n\nEthereum (ETH) price is showing weakness, but the overall trend remains bullish. To realize more gains, the second largest cryptocurrency by market cap must hold above the ascending trendline, which could deliver 5% gains for a test of the $2,136 range high. In a highly bullish case, the gains could stretch to the $2,200 psychological level.\n\nETH/USDT 1-day chart\n\nOn the other hand, increased seller momentum could send Ethereum price below the ascending trendline at $2,029. A break and close below this level could see ETH fall into the supply zone turned bullish breaker. A break and close below its midline at around $1,935 would solidify a continuation south.\n\nAlso Read: Ethereum Price Prediction: Eighteen-months ascending triangle pattern appraises $4,000 target for ETH\n\nRipple price fills up a triangle\n\nRipple (XRP) price has filled up a triangle amid reducing volatility in the XRP market. For the next directional bias, investors should wait for a confirmed breakout of this pattern. Meanwhile, all signs point to a downside move, amid falling momentum, indicated by the RSI and the AO histogram bars flashing red.\n\nIncreased selling pressure could see Ripple price break the lower trendline of the triangle to test the 25-day EMA at $0.6187. If the 25-EMA fails to hold as support, the slump could extend for XRP to tag the $0.5981 support level, 10% below the current price. A break and close below this level would clear the path for the remittance token to spiral further, slipping past the 50-day and 100-day EMAs at $0.5837 and $0.5619, respectively, to fall into the consolidation range between $0.5392 and $0.4735.\n\nXRP/USDT 1-day chart\n\nOn the flipside, a break above the upper trendline could see Ripple price stretch to reclaim the November 13 high of $0.7500. In a highly bullish case, it could break past the Fair Value Gap (FVG) ranging from $0.7519 to $0.7623, restoring balance before tagging the $0.8000 psychological level. Such a move would constitute a 20% climb above current levels.\n\nAlso Read: SEC v. Ripple lawsuit still drags on, Judge Torres sets schedule for 2024"
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzExLzE1L25vY3R1cm5lLWxhdW5jaGVzLW9uLW1haW5uZXQtdG8tYnJpbmctcHJpdmF0ZS1hY2NvdW50cy10by1ldGhlcmV1bS_SAWhodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMS8xNS9ub2N0dXJuZS1sYXVuY2hlcy1vbi1tYWlubmV0LXRvLWJyaW5nLXByaXZhdGUtYWNjb3VudHMtdG8tZXRoZXJldW0vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Nocturne Launches on Mainnet To Bring Private Accounts to Ethereum - The Daily Hodl",
        "content": "November 15, 2023 – New York, United States\n\nNocturne – a protocol enabling on-chain private accounts – today announced the successful deployment of Nocturne version one to Ethereum mainnet.\n\nThis marks a significant milestone in the journey towards a more private and accessible Ethereum.\n\nFor the first time, users will have a compatible and easy-to-use product resembling a private on-chain account.\n\nNocturne version one is a step towards compatible on-chain privacy that functions simply as another account rather than a distinct tool or ecosystem.\n\nUsers will find transacting with Nocturne similar to using a smart contract wallet, with the added benefit of privacy.\n\nNocturne version one is currently out-of-the-box compatible with any DeFi protocol that represents state via output tokens – e.g., Uniswap swap tokens, Aave aTokens, Compound cTokens and more.\n\nThere are plans to later extend this compatibility to arbitrary protocols.\n\nLuke Tchang, CEO and co-founder of Nocturne, said,\n\n“With Nocturne version one’s launch, we’re moving away from the notion of a ‘privacy tool.’ Privacy should be embedded at the account layer, and the version one launch is the first step in making this possible.\n\n“Our goal is to ensure that everyone – from individual users to large institutions – can transact securely without exposing their financial history to the world. This is more than a product – it’s a commitment to making Ethereum more accessible and enabling secure and private money over the internet.”\n\nNocturne is built on the belief that privacy on public blockchains will only become mainstream if it’s seamlessly integrated with the existing user experience.\n\nNocturne’s objective is straightforward – to create private user accounts on layer ones and layer twos that are fully compatible with existing Ethereum accounts.\n\nTo read more about private accounts, please see Nocturne’s recent blog post.\n\nPrivacy – t he keystone for Ethereum’s growth\n\nThough DeFi and other on-chain activities have surged in popularity, privacy concerns have prevented broader acceptance and use of crypto as money.\n\nRecognizing that the typical user may be uneasy with the idea of their financial dealings being public, and that institutions demand confidentiality for their transactions, Nocturne addresses these critical barriers head-on.\n\nPrivacy isn’t just a feature – it’s foundational to the broader adoption of crypto.\n\nNocturne’s future vision\n\nAs they continue building new versions, Nocturne’s long-term vision is to make the experience so seamless that by default, every Ethereum user automatically has a private account which mirrors their public account.\n\nIn short, a seamless parallel account layer for privacy.\n\nNocturne’s plans for achieving its longer-term vision include the following.\n\nTransition to a more permissionless protocol by migrating to proof of innocence, as described by Vitalik and Ameen Solemani in the ‘Practical Privacy and Compliance‘ paper.\n\nBring Nocturne accounts closer to usable as general wallets by extending Nocturne’s protocol compatibility to arbitrary smart contracts.\n\nImprove the compatibility of Nocturne accounts with EOAs and smart accounts through a scheme that allows for public wallet authorization to be leveraged within Nocturne for security.\n\nHow to access\n\nNocturne version one is live and can be accessed through a dedicated private vault UI, allowing users to discreetly manage their assets.\n\nThe current UI capabilities include deposits, transfers to new burner addresses and private swaps and staking. To get started, visit the website.\n\nAbout Nocturne Labs\n\nNocturne Labs is a forward-thinking blockchain technology company committed to addressing the most critical privacy and user experience challenges within the Ethereum ecosystem.\n\nWith a pioneering protocol for private accounts, Nocturne enables users to transact safely with built-in privacy.\n\nThis marks a substantial stride in advancing the usability of public blockchains.\n\nBacked by notable investors such as Bain Capital Crypto, Polychain Capital, Bankless and Vitalik, Nocturne is led by a team of experienced developers dedicated to enabling a more secure and accessible Ethereum.\n\nFor more information, visit the website.\n\nContact\n\nKayla Gill, PR manager at Serotonin"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiogFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3RvcC0zLXByaWNlLXByZWRpY3Rpb24tYml0Y29pbi1ldGhlcmV1bS1yaXBwbGUtYnRjLXdhbnRzLWFub3RoZXItc2hvdC1hdC0zOC0wMDAtYWZ0ZXItdGVtcG9yYXJ5LWhpY2N1cC0yMDIzMTExNTE5MDDSAaYBaHR0cHM6Ly93d3cuZnhzdHJlZXQuY29tL2FtcC9jcnlwdG9jdXJyZW5jaWVzL25ld3MvdG9wLTMtcHJpY2UtcHJlZGljdGlvbi1iaXRjb2luLWV0aGVyZXVtLXJpcHBsZS1idGMtd2FudHMtYW5vdGhlci1zaG90LWF0LTM4LTAwMC1hZnRlci10ZW1wb3JhcnktaGljY3VwLTIwMjMxMTE1MTkwMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC bulls take advantage of recent dip with $40,000 in sight - FXStreet",
        "content": "Share:\n\nBitcoin price could climb 7%, recouping the ground covered since the November 9 rejection from the $37,972 range high.\n\nEthereum price defends the $1,935 support level at all costs, with success likely to initiate a 10% rally to $2,200.\n\nRipple price shows weakness, breaks the triangle to the south as the 25-day EMA provides support at $0.6183.\n\nBitcoin (BTC) price is showing strength again after a stark correction on Tuesday that bruised the market. Ethereum (ETH) is following the trend set by the largest cryptocurrency by market capitalization. However, the same cannot be said for Ripple (XRP), at least not yet, as the remittance token's price is showing weakness.\n\nAlso Read: Bitcoin price drops, $90 million in open interest wiped out amid jitter over spot BTC ETF window closing\n\nBitcoin price pulls north as momentum restores\n\nBitcoin (BTC) price is pulling north, trying to recover all the ground lost in the recent crash that saw up to $90 million in open interest wiped out of the market. With the 25-day Exponential Moving Average (EMA) coming into play at $34,572, BTC is trying to reclaim territory above the critical resistance at $36,788.\n\nFor a confirmed move north, investors should watch for Bitcoin price to break and close above the $36,788 level. This will set the tone for BTC to target the $37,972 range high before reaching the $38,000 psychological level.\n\nIn a highly bullish case, Bitcoin price could extend its reach to tag the $40,000 psychological level, with such a move constituting a 10% climb above current levels.\n\nThe Relative Strength Index (RSI) is tipping north, suggesting momentum is rising, while the Awesome Oscillator (AO) holds in positive territory. This adds credence to the bullish thesis.\n\nBTC/USDT 1-day chart\n\nConversely, another rejection from the $36,788 resistance level could see Bitcoin price losing support due to the 25-day and 50-day EMAs at $34,572 and $32,456, respectively, before dipping into the supply zone turned bullish breaker where it could test the 100-day EMA at $30,528.\n\nAlso Read: Over $1 billion worth of BTC susceptible to be sold as Bitcoin price hints at short-term correction\n\nEthereum price holds above $1,935\n\nEthereum (ETH) price maintains above the $1,935 level, a crucial support that could spell doom for ETH if lost. With the RSI tipping north and the AO holding in the positive zone, ETH could scale north, restoring itself above the $2,029 support in order to ride the ascending trendline. This could ship the second-largest cryptocurrency by market capitalization to the $2,136 range high.\n\nETH/USDT 1-day chart\n\nHowever, if selling pressure increases, Ethereum price could slip below the $1,935 support. A decisive move below this level would confirm the downtrend, with ETH likely to test the 25-day or 50-day EMA at $1,892 and $1,806, respectively.\n\nIn a worse case, Ethereum price could tag the 100-day EMA at $1,763, with a break and close below it invalidating the bullish thesis under the $1,753 support level.\n\nAlso Read: Ethereum Price Prediction: Eighteen-months ascending triangle pattern appraises $4,000 target for ETH\n\nRipple price breaks the triangle\n\nRipple (XRP) price has shown weakness, breaking out of the triangle to the downside amid reducing volatility. Increased selling pressure could send XRP below the 25-day EMA at $0.6181. A break and close below the $0.5981 would lower optimism for a move north.\n\nXRP/USDT 1-day chart\n\nHowever, if buyer momentum increases, Ripple price could restore back above the lower trendline of the triangle above $0.6584, which would set the tone for a move to $0.7000.\n\nIn a highly bullish case, the gains could extend toward the Fair Value Gap (FVG) between $0.7519 to $0.7623, with Ripple price filling the inefficiency and restoring balance.\n\nAlso Read: XRP price could extend gains with Ripple’s likely win through $20 million settlement with SEC"
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3NvbGFuYS1pcy1ldmVuLWZhc3Rlci1hbmQtbW9yZS1jb3N0LWVmZmVjdGl2ZS10aGFuLWV0aGVyLXNheXMtYXJrLWludmVzdC1jZW8tMjAyMzExMTUxMzEx0gGMAWh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9hbXAvY3J5cHRvY3VycmVuY2llcy9uZXdzL3NvbGFuYS1pcy1ldmVuLWZhc3Rlci1hbmQtbW9yZS1jb3N0LWVmZmVjdGl2ZS10aGFuLWV0aGVyLXNheXMtYXJrLWludmVzdC1jZW8tMjAyMzExMTUxMzEx?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Solana is even faster and more cost-effective than Ether, says ARK Invest CEO - FXStreet",
        "content": "The Ethereum-alternative token rallied, posting 11.50% gains for SOL token holders in the past 24 hours. Solana has climbed 46% in the past week as the token touched the $63.20 level for the first time since May 2022.\n\nWood shared her thoughts on existing crypto protocols and compared them with each other on cost-effectiveness and speed. The ARK Invest CEO noted that Ethereum was initially faster and more cost-effective than Bitcoin. However, Solana has now surpassed the second-largest blockchain protocol in these aspects. Wood highlighted Solana’s role in the blockchain space while discussing Bitcoin and Bitcoin-related equities in crypto.\n\nThe ARK Invest CEO spoke about infrastructure players in the blockchain ecosystem . Wood shared her insights into crypto while discussing ARK’s five new ETFs launching this week. The ETFs include a mix of Bitcoin futures, Ethereum futures and a wide range of Bitcoin and equity-exposed companies.\n\nCathie Wood, CEO of ARK Invest, shared her views on Bitcoin, Ethereum and Solana in an interview with CNBC’s Squawk Box. Wood commented on blockchain protocols used for payments and their cost-effectiveness, comparing the three assets.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9pcy1ldGgtYWJvdXQtdG8tY3Jhc2gtYmVsb3ctMmstZXRoZXJldW0tcHJpY2UtYW5hbHlzaXMv0gFUaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL2lzLWV0aC1hYm91dC10by1jcmFzaC1iZWxvdy0yay1ldGhlcmV1bS1wcmljZS1hbmFseXNpcy8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Is ETH About to Crash Below $2K? (Ethereum Price Analysis) - CryptoPotato",
        "content": "Technical Analysis\n\nBy GreatestTrader\n\nBuyers in the Ethereum market have recently driven the price into a strong uptrend, reaching a critical resistance level at $2K. However, encountering a significant hurdle around this crucial mark, there exists the potential for a temporary consolidation correction phase in the coming days.\n\nThe Daily Chart\n\nA thorough examination of the daily chart reveals substantial support around the crucial region, comprising the static support at $1,500 and the lower boundary of the wedge pattern. This support fueled a significant surge, indicating strong buying momentum, with buyers targeting the critical $2K resistance zone.\n\nDespite reaching this key level, aligned with the wedge’s upper boundary, Ethereum faced rejection, leading to a slight retracement towards the broken 200-day moving average at $1,783.\n\nConsidering the significance of the resistance at $2K and the associated wedge pattern’s upper boundary, a temporary continuation of the ongoing retracement followed by consolidation around the broken moving averages is highly likely. If the price completes a pullback to the broken moving averages, buyers may re-enter the market, aiming once again for the substantial $2K level.\n\n\n\nThe 4-Hour Chart\n\nOn the 4-hour chart, the intensified buying pressure around the $1,5K support region propelled Ethereum toward the substantial $2K resistance. This upward movement demonstrated significant bullish momentum, reflecting the buyers’ dominance in the market.\n\nHowever, the $2K region represents a crucial psychological resistance, posing challenges for buyers to push the price higher. Notably, a bearish divergence between the price and the RSI indicator suggested insufficient buying pressure, leading to a reversal and slight corrections.\n\nAdditionally, a recognizable double-top pattern around this pivotal resistance confirmed the presence of sellers in the short term.\n\nGiven the existing market dynamics, there is a high likelihood of an extended consolidation correction phase in the short term. This implies that the market might continue its retracement before definitively determining its next course of action. In this scenario, the support range between the 0.5 and 61.8 levels of the Fibonacci retracement ($1,839 – $1,769) is expected to be the next level of interest for Ethereum’s price.\n\n\n\nOn-chain Analysis\n\nBy GreatestTrader\n\nThe futures market has been a significant influencer of Ethereum’s price dynamics, making it imperative for the current uptrend to sustain favorable conditions in this market.\n\nIllustrated in the chart is the 30-day moving average of the Ethereum Taker Buy Sell ratio, a crucial metric for gauging sentiment in the futures market. During a period of substantial price increase in Ethereum, the taker buy-sell ratio exhibited a robust uptrend, signaling strong buying interest. However, a recent reversal in the metric’s trend has led to a downtrend, dipping below the threshold of 1. This reversal indicates that sellers are now executing more aggressive orders in the aggregate, potentially to realize profits or to take short positions.\n\nSignificantly, this shift in the metric aligns with the recent market rejection and its struggle to move higher. The confluence of these events suggests a potential for a short-term retracement in Ethereum’s price.\n\nShould the taker buy-sell ratio resume an upward trajectory, surpassing the 1 threshold, it would indicate a revival of bullish sentiment in the short term, potentially supporting the continuation of the uptrend. Conversely, a failure of the metric to exhibit upward movement would raise concerns about the sustainability of any bullish momentum."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vY29pbmdhcGUuY29tL2JveWFhLXRvLWludmVzdC1pbi1jcnlwdG8td2l0aC0xMDBtLWJpdGNvaW4tZXRoZXJldW0tcGxhbi_SAVNodHRwczovL2NvaW5nYXBlLmNvbS9ib3lhYS10by1pbnZlc3QtaW4tY3J5cHRvLXdpdGgtMTAwbS1iaXRjb2luLWV0aGVyZXVtLXBsYW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Boyaa to Invest in Crypto with $100M Bitcoin, Ethereum Plan - CoinGape",
        "content": "Boyaa Interactive, a prominent Hong Kong-listed gaming firm, has taken a significant step towards expanding its investment portfolio. The company recently announced plans to invest a substantial $100 million in cryptocurrencies. This move marks a strategic shift for Boyaa, traditionally known for its online card games, as it delves deeper into the digital asset space.\n\nBoyaa Plans Major Bitcoin, Ethereum Investment\n\nSubject to shareholder approval, the investment would primarily focus on Bitcoin (BTC) and Ethereum (ETH). Boyaa intends to allocate $45 million to each of these leading cryptocurrencies, totaling $90 million. Additionally, the company plans to invest $10 million in stablecoins, specifically Tether (USDT) and USD Coin. This strategy not only diversifies Boyaa’s investment but also aligns with its vision to integrate with the burgeoning Web3 ecosystem.\n\nadvertisement\n\nBoyaa’s choice of stablecoins underscores its approach to balance stability with growth potential. By investing in stablecoins, the company gains exposure to the U.S. dollar, thus adding a layer of financial stability to its crypto investments. This strategy reflects a thoughtful approach to navigating the often-volatile cryptocurrency market, while still capitalizing on its growth prospects.\n\nCrypto Market Next for Boyaa’s Growth\n\nThe company’s financial health has been robust, as evidenced by a striking 119% year-on-year increase in net profits in the first quarter of 2023. This financial strength provides Boyaa with a solid foundation to venture into the crypto market, which presents another avenue for revenue maximization.\n\nWith this move, Boyaa Interactive joins a growing list of public companies that have embraced cryptocurrency investments. This list includes notable U.S. firms like MicroStrategy and Tesla and other Asian companies such as Meitu. Boyaa’s decision to invest in cryptocurrencies aligns it with global corporate trends and demonstrates its commitment to staying abreast of technological advancements in the digital era.\n\nRead Also: US CPI Rises By 3.2%, Will It Boost Gains In The Crypto Market?"
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvaGFja2Vycy1zdGVhbC02MC1taWxsaW9uLWluLWNyeXB0by11c2luZy1ldGhlcmV1bS1jb2Rl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Hackers Steal $60 Million in Crypto Using Ethereum Code - Watcher Guru",
        "content": "Hackers have stolen over $60 million worth of crypto from nearly 100,000 victims in the past six months by exploiting a piece of Ethereum code to bypass security alerts, according to research from on-chain investigator ScamSniffer and security firm SlowMist.\n\nThe wallet drainers are misusing a function called Create2. This is normally leveraged by decentralized apps like Uniswap to predict the address of a smart contract before deployment. By abusing Create2, the hackers can instantly generate disposable wallet addresses to receive stolen funds after a user interacts with a malicious signature.\n\n1/ Wallet Drainers are misusing Create2 to bypass security alerts in some wallets by generating new addresses for each malicious signature.\n\n\n\nAfter a discussion with @SlowMist_Team, a group has employed the same technique in Address Poisoning to steal $3M since Aug. pic.twitter.com/yCdJs6Zke7 November 12, 2023\n\nTypically, crypto wallet software displays alerts when a signature requests access permissions. However, the hackers’ clever use of Create2 enables them to disguise malicious code within the signature, allowing wallet access without triggering warnings.\n\nAlso Read: China’s Boyaa Interactive to Spend $90M on Bitcoin and Ethereum\n\nCrypto hacks witness recent surge\n\nOne group of hackers alone has drained $3 million in crypto from 11 victims since August using this Ethereum technique. Overall, ScamSniffer and SlowMist estimate that around $60 million has been stolen from 99,000 victims in the past six months.\n\nThe rise of Create2-based wallet exploits highlights the growing sophistication of crypto-related cybercrime. Just last week, exchange Poloniex revealed a hot wallet breach, resulting in $125 million lost. October also saw victims of the LastPass breach lose $4.4 million in crypto in one day.\n\nAlso Read: US Options Exchange Cboe Launching Margined Bitcoin Futures\n\nAs hackers devise more methods to siphon funds from unsuspecting victims, extra vigilance is crucial. The innovative abuse of Create2 underscores that even trusted blockchain code can potentially be weaponized for theft at scale."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnBlZGlhLm9yZy9wcmljZS1hbmFseXNpcy9ldGhlcmV1bS13aGFsZXMtc2VsbGluZy1zcHJlZS1zcGFya3Mtd29ycmllcy1mb3ItZXRoLXByaWNlL9IBZGh0dHBzOi8vY29pbnBlZGlhLm9yZy9wcmljZS1hbmFseXNpcy9ldGhlcmV1bS13aGFsZXMtc2VsbGluZy1zcHJlZS1zcGFya3Mtd29ycmllcy1mb3ItZXRoLXByaWNlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Whales’ Selling Spree Sparks Worries for ETH Price - Coinpedia Fintech News",
        "content": "Qadir Ak is the founder of Coinpedia. He has over a decade of experience writing about technology and has been covering the blockchain and cryptocurrency space since 2010. He has also interviewed a few prominent experts within the cryptocurrency space.\n\nFor the first time since the Ethereum (ETH) Shanghai upgrade earlier this year, Ether’s price has closed above $2,000 following the recent Bitcoin (BTC) breakout towards $38,000. However, Ethereum’s price has encountered significant resistance at around $2,136, casting doubts on the sustainability of the uptrend. Despite this, crypto experts remain optimistic about the recent rally, anticipating further gains as some investors grow impatient.\n\nEthereum Whales Accelerate Profit-Taking:\n\nA recent on-chain analysis conducted by Lookonchain reveals that prominent Ethereum whales have been accelerating their profit-taking activities recently, potentially signaling an impending correction. Notably, one Ethereum whale transferred approximately 26.4k Ether, valued at roughly $54 million, to Bitfinex after being dormant for the past three years. Another Ethereum whale moved approximately 30k Ether, worth about $65 million, to Binance, resulting in a staggering loss of around $183 million.\n\nBullish or Bearish on $ETH?\n\n\n\nDid SmartMoneys and Whales buy or sell $ETH over the past week?\n\n\n\n1/🧵\n\n\n\nHere is a thread. pic.twitter.com/8yvCO0UI9H — Lookonchain (@lookonchain) November 14, 2023\n\nIn contrast, a savvy Ether whale deposited 25.7k Ether, equivalent to about $50 million, to Binance on November 09, securing a profit of approximately $1.5 million. Lookonchain’s analysis highlights that Ether whales who have refrained from taking profits face unrealized losses.\n\nRecently, the Ethereum network received a boost in credibility when BlackRock, a leading fund manager with over $9 trillion in assets under management (AUM), filed for a spot Ether ETF application. While the initial frenzy may have subsided, the filing by BlackRock could pave the way for more hedge fund managers to follow suit and compete in offering spot Ether ETFs. This development can potentially trigger further upside momentum in the near term.\n\nIn summary, Ethereum’s price surge past $2,000 has been notable, but resistance at $2,136 looms large. Ethereum whales taking profits may hint at a potential correction while filing a spot Ether ETF by BlackRock could bolster Ethereum’s position in the market. Crypto enthusiasts eagerly await further developments in this exciting and dynamic space."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9jZWxzaXVzLW1vdmVzLTEwLW1pbGxpb24taW4tZXRoZXJldW0tdG8tZXhjaGFuZ2UtZm9sbG93aW5nLWJhbmtydXB0Y3ktcGxhbi1hcHByb3ZhbC5odG3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Celsius Moves $10 Million in Ethereum to Exchange Following Bankruptcy Plan Approval - Cryptonews",
        "content": "Celsius Moves $10 Million in Ethereum to Exchange Following Bankruptcy Plan Approval\n\nCrypto lending company Celsius has transferred over $10 million worth of Ethereum to an exchange on Wednesday, just 6 days after a judge approved the firm’s bankruptcy plan.\n\nAccording to on-chain data tracked by Lookonchain, Celsius moved 5,160 ETH worth around $10.49 million to the institutional trading platform FalconX. The bankrupt company is currently transitioning to a new model under creditor ownership.\n\nCelsius Enters New Chapter Post-Bankruptcy\n\n\n\nCelsius filed for bankruptcy back in July 2022 amid a wider downturn in the cryptocurrency market. Under the newly approved plan, Celsius will be converted into a crypto mining and staking firm called NewCo, which is expected to have a $1.25 billion balance sheet. A portion of this balance sheet will consist of liquid crypto assets that can be staked to generate yields.\n\nWe noticed that #Celsius transferred 5,160 $ETH ($10.63M) to #FalconX. And #Celsius also transferred a lot of tokens to exchanges and #FalconX 5 days ago. It seems that #Celsius wants to sell some assets with the rising prices.https://t.co/3gGOucC9gY pic.twitter.com/ILhpK0qLJy — Lookonchain (@lookonchain) November 14, 2023\n\nThe transfer of Ethereum suggests Celsius may be looking to sell some holdings to raise capital as part of this transition. Ethereum prices have climbed nearly 70% since the start of 2023, recovering from the lows seen last year. The timing could allow Celsius to offload ETH at relatively favorable rates.\n\nEthereum Sale Preps Celsius for Focus on Staking\n\n\n\nAccording to Lookonchain, Celsius has also recently moved various other tokens to exchanges like Binance and OKX. These include stablecoins, governance tokens like SPELL, and utility tokens like BAT. The bankrupt company seems to be liquidating parts of its portfolio across the board.\n\nLast week, a judge approved a restructuring plan that will formally sign over ownership of Celsius to its creditors. Under the new ownership structure, creditors are expected to benefit from the staking yields generated by Celsius’ remaining crypto assets. Estimates suggest the staking operation could bring in $10 to $20 million per year.\n\nThe decision came after months of uncertainty surrounding the fate of the troubled lender. Celsius halted withdrawals back in June 2022, citing extreme market conditions. The freeze left thousands of customers unable to access their assets held on the platform.\n\nThe firm’s bankruptcy filing followed shortly after, with Celsius owing creditors nearly $5 billion at the time. The restructuring plan lays out the terms for creditors to recover a portion of the owed funds.\n\nWith ownership now being transferred to creditors, Celsius is distancing itself from its former retail lending model. The approved bankruptcy plan explicitly forbids the newly formed entity from “engaging in lending or rehypothecation of assets.”\n\nInstead, NewCo will function solely as a crypto mining and staking enterprise, using protocols like Lido to generate staking yields from assets like Ethereum. Liquidating ETH holdings to exchanges aligns with this strategy pivot.\n\nThe year-long Celsius drama highlights the risks associated with crypto lending platforms. Attractive yields enticed customers, but overly speculative practices put customer deposits in jeopardy when markets declined. With new management in place, Celsius hopes to chart a more sustainable path forward."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9oYXJkbHktYW55b25lLXVzaW5nLWV0aGVyZXVtLXNtYXJ0LWFjY291bnRz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "New figures show hardly anyone is using ERC-4337 smart accounts - Cointelegraph",
        "content": "Ethereum account abstraction advocate John Rising has shared some “sobering” numbers showing overall ERC-4437 adoption has been far from ideal.\n\nIn a Nov. 14 post on X (formerly Twitter), Rising shared data points that showed ERC-4337-enabled smart accounts suffered a decline in users, low transaction activity and poor operational costs for core infrastructure providers.\n\nThe ERC-4337 standard was launched through a surprise March 1 announcement at WalletCon in Denver. At the time, many were optimistic that ”smart accounts” would witness rapid adoption as the tech allows users to bypass the use of seed phrases and signing for certain transactions and would generally increase the user experience on Ethereum Virtual Machine (EVM)-compatible blockchains.\n\nUsing figures from account abstraction data platform BundleBear, Rising claimed monthly account retention had been “terrible,” with just 6.89% of all the initial smart accounts having stuck around for more than six months.\n\nRetention is terrible.\n\n\n\nThe one exception to this is CyberConnect, who had a lot of users return to claim an airdrop.\n\n\n\nData: @0xBundleBear pic.twitter.com/TUzQQJYcp8 — John Rising (@johnrising_) November 13, 2023\n\nRising also highlighted that bundlers — core infrastructure components that allow smart accounts to function on EVM-compatible chains — were largely unprofitable despite some projects accidentally paying “too much” in gas to the bundlers.\n\nAdditionally, the average smart account was found to have only sent five user operations — the execution of transactions or activities from the account.\n\nRelated: Fireblocks, UniPass Wallet tackle Ethereum ERC-4337 account abstraction vulnerability\n\nHowever, Coinbase protocols lead and Base creator Jesse Pollak pushed back on Rising’s description of the numbers as “sobering” — claiming instead that the adoption of the new technology would happen “slowly, then suddenly.”\n\n“Just seems very early. Growth seems to be healthy, standardization seems to be happening,” Pollak said. “More and more teams I’m talking to are making the jump.”\n\nfwiw, this doesn't feel sobering to me - just seems very early. growth seems to be healthy, standardization seems to be happening, more and more teams i'm talking to are making the jump.\n\n\n\nslowly, then suddenly :)https://t.co/F7sU4xUqbD — Jesse Pollak (jesse.xyz) ️ (@jessepollak) November 13, 2023\n\nDune analytics data showed August was the largest month for active account abstraction wallets, with over 420,000 active smart accounts across seven blockchains.\n\nThe number of monthly active smart accounts. Source: Dune Analytics\n\nActive smart accounts have been on a somewhat steady decline with 143,000 monthly active accounts recorded in October.\n\nMagazine: Slumdog billionaire — Incredible rags-to-riches tale of Polygon’s Sandeep Nailwal"
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vbGVhcm4uYnliaXQuY29tL2FsdGNvaW5zL3doYXQtaXMtYXJiaXRydW0tYXJiL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "What Is Arbitrum Crypto? A Beginner's Guide to Ethereum's Game-Changing Layer 2 Solution - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vdGVjaHBvaW50LmFmcmljYS8yMDIzLzExLzE0L3doYWxlcy1idWxsLW1hcmtldC1waWNrcy1kb2dlY29pbi1kb2dlLWV0aGVyZXVtLWV0aC1tZW1lLW1vZ3Vscy1tZ2xzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Whales' Bull Market Picks: Dogecoin (DOGE), Ethereum (ETH), Meme Moguls (MGLS) - Techpoint Africa",
        "content": "Discover the top picks of whales for the bull market, including Dogecoin, Ethereum, and Meme Moguls. Let's unpack why these digital coins, like Dogecoin and Ethereum, are catching fire in the market.\n\nWhales are strategically positioning themselves for maximum gains as the crypto market gears up for a bullish run. Among their top picks are the well-established Dogecoin (DOGE) and Ethereum (ETH), but a surprising newcomer to the scene, Meme Moguls (MGLS), is making waves. Let's delve into why these three cryptocurrencies are emerging as the top choices for whales in the current bull market.\n\nDogecoin (DOGE): BlackRock's Interest Sparks Speculation\n\nDogecoin (DOGE), the beloved meme-inspired cryptocurrency, is experiencing a surge in momentum. Recent speculation suggests that interest from investment giant BlackRock could further fuel its upward trajectory.\n\nAs prominent crypto analyst Lark Davis hinted, BlackRock's growing involvement in cryptocurrency ETFs may extend beyond Ethereum to encompass other digital assets, including the playful yet resilient Dogecoin. Regarding Dogecoin price movement, its value has surged from $0.071 on November 9th to $0.080 on November 11th.\n\nAs a result, experts in the crypto space have made a bullish Dogecoin price prediction. They forecast it to reach $0.091 within the fourth quarter of 2023. Therefore, it is no surprise why whales choose this token.\n\nEthereum (ETH): Bullish Trajectory Continues\n\nEthereum (ETH) is also gaining attention thanks to BlackRock. According to James Seyffart, a well-regarded analyst, BlackRock, one of the world's largest asset management firms, has entered Ethereum by submitting an ETF application to Nasdaq. This news has ignited anticipation and optimism among the Ethereum community and whales.\n\nSo, big-time companies like BlackRock jumping on the Ethereum bandwagon really seals its status in the mainstream. After that announcement hit, you could see a jump in Ethereum's price - it went from $1,913 to $2,058 in no time at all.\n\nForecasts are optimistic, with Ethereum price predictions from experts suggesting a surge to $2,316 before 2023 ends. This displays the positive trajectory for Ethereum as it continues to be a frontrunner for whales in the crypto space.\n\nMeme Moguls (MGLS): Redefining Meme-Based Investments\n\nIn a surprising turn of events, Meme Moguls (MGLS) has swiftly become a sought-after investment for whales looking to ride the meme coin wave. This presale star is in its Beta stage but has already made headlines with its unique platform. At its core, Meme Moguls will be the world's first meme-backed stock exchange.\n\nMoreover, Meme Moguls is upping the ante with an exciting play-to-earn feature, allowing you to earn rewards while fully engaged in gaming. It's all about leveling up your characters, creating bespoke items and selling them on the Moguls Marketplace - this could be your new way to a regular income stream.\n\nAt the heart of Meme Moguls lies a vibrant ecosystem powered by the MGLS utility token. MGLS tokens further enhance the gameplay, as they can be used to obtain lootbox keys, unlocking valuable meme assets and rare NFTs. Not only that, users can choose to stake these tokens to earn rewards.\n\nWith all these benefits, whales are beginning to stockpile this token, which currently costs only $0.0019. Analysts predict substantial growth of 100x for MGLS, making it a compelling choice for whales seeking high-return opportunities. Therefore, Meme Moguls may become the next Shiba Inu - only with more utility.\n\nVisit Meme Moguls"
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMiMWh0dHBzOi8vY29udGVudC5iaXRhenphLmNvbS9jcnlwdG8td2Vla2x5LTE0LW5vdi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Rallies on Prospect of ETF Opportunities for Institutional Investors - - Bitazza Content Hub",
        "content": "0 SHARES Share Tweet\n\nEthereum Rallies on Prospect of ETF Opportunities for Institutional Investors\n\nBlackRock has registered the iShares Ethereum Trust in Delaware, USA, leading to a significant increase in Ethereum’s price, which reached the $2,000 mark. This development has raised expectations for the launch of an Ethereum ETF, akin to those available for Bitcoin.\n\nIn a related development, BlackRock has argued with the U.S. Securities and Exchange Commission (SEC) over the treatment of ETFs that invest in spot crypto markets versus those in futures markets. BlackRock contends that differing approaches to these could result in legal complications.\n\nMatrixport’s analysis indicates that Ethereum’s blockchain fee revenue has surpassed its lowest point. Gas fees have consistently stayed above $30 million for two weeks, a significant increase from the annual low of $12 million in early October. This suggests that Ethereum is moving out of a period of low activity.\n\nThe CEO of Hong Kong’s Securities and Futures Commission is considering allowing retail investors to directly invest in digital asset ETFs like Bitcoin. Currently, Hong Kong has registered three funds based on Bitcoin and Ethereum futures.\n\nThe U.S. SEC has reopened negotiations with Grayscale Investments about converting the GBTC fund into a spot Bitcoin ETF. This comes after a federal court ruling required the SEC to reconsider Grayscale’s application for a Spot Bitcoin ETF.\n\nAnalysts from Bloomberg Intelligence believe there is over a 90% chance that a Bitcoin ETF will be approved by January 10, 2024. This is due to the time required to review applications from all 14 applicants, likely leading to simultaneous approval.\n\nCrypto market analyst Lark Davis views Chainlink and Solana as potential next points of interest for institutional investors following Bitcoin and Ethereum. He suggests that these coins could also have ETFs in the future, providing institutional investors with more investment options.\n\nWeekly Technical Analysis: 14 – 20 November 2023\n\nBitcoin (BTC)\n\nBTC has reached the resistance level of $38,000 and is currently moving sideways without a clear direction. It’s important to keep an eye on a potential correction as a Bearish Divergence is starting to form in the RSI. The first support level is estimated at $34,000, while the resistance level has been raised to $40,000. If this is breached, the next target is $42,000.\n\nEthereum (ETH)\n\nETH has shown a strong uptrend following news of an upcoming ETF. The momentum looks positive. The support level is at $1,900, which could be a good entry point if the price retracts. The first resistance level is at $2,200.\n\nBancor Network (BNT)\n\nBNT has increased by 96.8% over the past week. However, the rapid price surge could lead to significant selling pressure. The key support level to watch is 32.50 THB.\n\nTerra (LUNA)\n\nLUNA has risen by 69.9% in the past week. However, traders should exercise caution as this increase is linked to speculative trading amid news of FTX resuming services.\n\nTrading and Investment Considerations For The Week\n\nEven though Bitcoin’s price has started to stabilize, Altcoins in the DeFi, GameFi, and Blockchain Layer 1 and 2 categories continue to see ongoing speculative trading. This is viewed as an opportunity for short-term investment.\n\nIt is expected that the market will remain lively until the end of the year or until a Bitcoin ETF is officially approved, which may lead to a ‘Sell On Fact’ situation. Ethereum is seen as a promising alternative, especially after the news of the ETF setup, and it still lags 50% behind BTC in price this year.\n\nThe U.S. stock market, particularly the Nasdaq, continues to rise, positively impacting the digital asset market due to their close correlation. These markets have shown resilience against the strengthening U.S. dollar and the rising yields of U.S. government bonds.\n\nOn Tuesday, November 14, the U.S. CPI Index figures will be announced. The market expects it to be around 3.3%, down from 3.7% the previous month. A decrease in inflation would be positive for the market as it would reduce pressure on the U.S. Federal Reserve to hike interest rates, despite recent indications that another rate increase is possible.\n\n0 SHARES Share Tweet\n\nMore from Crypto Weekly"
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMipQFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0by1wcmljZS10b2RheS1ub3ZlbWJlci0xNS1jaGVjay1nbG9iYWwtbWFya2V0LWNhcC1iaXRjb2luLWJ0Yy1ldGhlcmV1bS1kb2dlLXNvbGFuYS1saXRlY29pbi10aWEtbGRvLWFicC1saXZlLXR2LTE2NDI4MDbSAakBaHR0cHM6Ly9uZXdzLmFicGxpdmUuY29tL2J1c2luZXNzL2NyeXB0by9jcnlwdG8tcHJpY2UtdG9kYXktbm92ZW1iZXItMTUtY2hlY2stZ2xvYmFsLW1hcmtldC1jYXAtYml0Y29pbi1idGMtZXRoZXJldW0tZG9nZS1zb2xhbmEtbGl0ZWNvaW4tdGlhLWxkby1hYnAtbGl2ZS10di0xNjQyODA2L2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Dips Below $36,000, Ethereum Loses $2,000 Mark - ABP Live",
        "content": "Bitcoin (BTC), the oldest and most valued cryptocurrency in the world, dipped below the $36,000 mark early Wednesday, continuing to slump over the past few days. Even Ethereum (ETH) lost its hard-earned $2,000 mark. The US CPI annual inflation came in below expectation, at 3.2 percent. It remains to be seen if that turns things around for crypto coins in the coming days. Other popular altcoins — including the likes of Solana (SOL), Ripple (XRP), and Litecoin (LTC) — landed in the reds across the board.\n\nThe global crypto market cap stood at $1.36 trillion at the time of writing, registering a 24-hour dip of 2.25 percent.\n\nBitcoin (BTC) Price Today\n\nBitcoin price stood at $35,428.64, registering a 24-hour loss of 2.87 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 30.87 lakh.\n\nEthereum (ETH) Price Today\n\nETH price stood at $1,971.91, marking a 24-hour dip of 4.05 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 1.72 lakh.\n\nDogecoin (DOGE) Price Today\n\nDOGE registered a 24-hour dip of 2.99 percent, as per CoinMarketCap data, currently priced at $0.0727 As per WazirX, Dogecoin price in India stood at Rs 6.30.\n\nLitecoin (LTC) Price Today\n\nLitecoin saw a 24-hour dip of 0.93 percent. At the time of writing, it was trading at $71.30. LTC price in India stood at Rs 6,108.18.\n\nRipple (XRP) Price Today\n\nXRP price stood at $0.6284, seeing a 24-hour dip of 4.87 percent. As per WazirX, Ripple price stood at Rs 54.70.\n\nSolana (SOL) Price Today\n\nSolana price stood at $56.31, marking a 24-hour gain of 3.93 percent. As per WazirX, SOL price in India stood at Rs 4,889.96.\n\nTop Crypto Gainers Today (November 15)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nCelestia (TIA)\n\nPrice: $5.89\n\n24-hour gain: 14.99 percent\n\ndYdX (ETHDYDX)\n\nPrice: $3.40\n\n24-hour gain: 10.90 percent\n\nGnosis (GNO)\n\nPrice: $173.35\n\n24-hour gain: 8.51 percent\n\nKaspa (KAS)\n\nPrice: $0.08842\n\n24-hour gain: 6.94 percent\n\nPancakeSwap (CAKE)\n\nPrice: $2.23\n\n24-hour gain: 2.91 percent\n\nTop Crypto Losers Today (November 15)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nLido DAO (LDO)\n\nPrice: $2.15\n\n24-hour loss: 11.13 percent\n\nNEAR Protocol (NEAR)\n\nPrice: $1.51\n\n24-hour loss: 11.07 percent\n\nApeCoin (APE)\n\nPrice: $1.38\n\n24-hour loss: 10.94 percent\n\nDecentraland (MANA)\n\nPrice: $0.4217\n\n24-hour loss: 10.80 percent\n\nRender (RNDR)\n\nPrice: $2.21\n\n24-hour loss: 10.07percent\n\nWhat Crypto Exchanges Are Saying About Current Market Scenario\n\nShubham Hudda, Senior Manager, CoinSwitch Markets Desk, said, “The crypto market has shown a healthy correction in the last 24 hours. BTC (-2.8 percent) dropped below the $36,000 mark. The next line of support for BTC is at $33,500; if BTC maintains that, we are still in a good uptrend. The market highlight remains the two-week-old token Celestia (TIA, +26.1 percent) as it pumped close to 50 percent at its peak yesterday and touched $6.3 before retracing back a bit. Celestia is a modular data availability network that had recently airdropped more than $120 million value at the time of airdrop for its active users.”\n\nShivam Thakral, CEO of BuyUcoin, said, “The crypto market witnessed a healthy pullback after a continuous rally. The positive US inflation data triggered a correction across crypto assets with BTC and ETH slipping by almost 3% and 4% respectively. US stocks saw an upward trend after the positive inflation data became public signaling renewed interest in traditional assets. The crypto market may face some selling pressure in the coming weeks owing to macroeconomic conditions.”\n\nCoinDCX Research Team told ABP Live, “Despite lower-than-expected United States inflation data, indicating a 3.2% yearly increase and a positive US stock market, the crypto market witnessed a decline yesterday. BTC and ETH both experienced drops of over 3% in the last 24 hours. Currently, BTC is positioned at the 20 EMA 1Day and is trading at $35,450, while ETH is trading at $1,970, below the support level of $2,011. In a positive development, despite China maintaining its prohibitive stance towards Bitcoin and cryptocurrencies, there is growing crypto adoption. A Chinese company, Boyaa, has announced a substantial investment of $100 million in Bitcoin and Ethereum.”\n\nSubscribe And Follow ABP Live On Telegram: t.me/officialabplive\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 76,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LmNpdHlhbS5jb20vYml0Y29pbi1hbmQtZXRoZXJldW0tc3VkZGVubHktdHJhZGluZy1pbi1kaWZmZXJlbnQtZGlyZWN0aW9ucy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin and Ethereum suddenly trading in different directions - CityAM - City A.M.",
        "content": "Bitcoin and Ethereum suddenly trading in different directions\n\nBitcoin is trading in the negative today, down by one per cent over 24 hours, while Ethereum seems to be going the other way and still trading above the key $2,000 level.\n\nAmong the third-gen cryptocurrencies, Polygon continues to rally with 5% gains overnight while others such as Solana pull back. The cryptocurrency known for its speedy throughput is in the red by more than 5%.\n\nXRP saw a 10% surge in price yesterday, following on the heels of a now debunked rumour that BlackRock is also planning to launch an XRP ETF. The price of XRP quickly corrected after the asset manager quashed the rumours.\n\nYesterday’s Crypto AM Daily\n\nIn the Markets\n\nThe Bitcoin Economy\n\n*Data can be found at https://terminal.bytetree.com/\n\nTotal crypto market cap\n\n🔵 $1.4 trillion\n\n🔻 0.69%\n\nWhat Bitcoin did yesterday\n\n🔺 Daily high $37,404\n\n🔻 Daily low $36,358\n\nBitcoin market capitalisation\n\n🟠 BTC $718.23 billion\n\n🟡 Gold $12.856 trillion\n\n💳 Visa $506.18 billion\n\nBitcoin volume\n\nTotal spot trading volume $18.38 billion\n\n🔺 39.26%\n\nEthereum staking entry queue\n\n0 minutes\n\nSP500\n\n🔻 0.084%\n\nFTSE/JSE Top 40\n\n🔺0.76%\n\nFear and Greed Index\n\nBitcoin’s market dominance\n\n52.19\n\nRelative Strength Index (RSI)\n\n70\n\nValues of 70 or above indicate that an asset is becoming overbought and may be primed for a trend reversal or experience a correction in price, while 30 or below indicates an oversold or undervalued condition.\n\n📣 What they said yesterday\n\nThis week's big data report is the October CPI\n\n\n\nWall Street forecasters expect the core index rose 0.34% from September, raising the 12-month rate to 4.2% from 4.1%\n\n\n\nThey see the headline index up 0.1% from September, lowering the 12-month rate to 3.3% from 3.7% pic.twitter.com/wADwEXGOTn — Nick Timiraos (@NickTimiraos) November 13, 2023\n\nCrypto AM: Editor’s picks\n\nKraken appoints crypto entrepreneur and fintech consultant Bivu Das to drive next chapter of UK growth story\n\nTransformBase initiative set for launch in November\n\nFCA’s new crypto advertising rules met with mixed industry response\n\nChatGPT urges crypto conference panel not to become over-reliant on AI\n\nSam Bankman-Fried: A tissue of lies soaked with fake tears?\n\nThree-in-four wealth managers are gearing up for more cryptocurrency exposure\n\nCrypto.com granted FCA licence to operate in UK\n\nQ&A with Duncan Coutts, Principal Technical Architect at IO Global\n\nJamie Bartlett – on the trail of the missing ‘Cryptoqueen’\n\nMPs are falling silent over potential of cryptocurrency\n\nCrypto AM: Features\n\nCrypto AM: Founders Series\n\nCrypto AM: Industry Voices\n\nCrypto AM: Contributors\n\nCrypto AM: In Conversation with James Bowater\n\nCrypto AM: Tomorrow’s Money with Gavin S Brown\n\nCrypto AM: Mixing in the Metaverse with Dr Chris Kacher\n\nCrypto AM: Visions of the Future, Past & Present with Alex Lightman\n\nCrypto AM: Tiptoe through the Crypto with Monty Munford\n\nCrypto AM: Taking a Byte out of Digital Assets with Jonny Fry\n\nCrypto on the catwalk\n\nCautionary Notes\n\nIt’s definitely tempting to get swept up in the excitement, but please heed these words of caution: Do your own research, only invest what you can afford, and make good decisions. The indicators contained in this article will hopefully help in this. Remember though, the content of this article is for information purposes only and is not investment advice or any form of recommendation or invitation. City AM, Crypto AM and Luno always advise you to obtain your own independent financial advice before investing or trading in cryptocurrency."
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LnNhbWFhLnR2LzIwODczNDQwOS1iaXRjb2luLXdpdG5lc3Nlcy1tb2Rlc3QtZG93bnR1cm4tYWx0Y29pbnMtbWlycm9yLWluLXR1cmJ1bGVudC1jaXJjdW1zdGFuY2Vz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Crypto prices today: Bitcoin, Ethereum, altcoins - 14 Nov, 2023 - Latest Updates - SAMAA",
        "content": "Photo: File\n\nOn the Tuesday of November 14, Bitcoin stepped into the trading with a moderate loss of 1.25%. Despite this dip, the influence on BTC's enduring price threshold remained confined.\n\nAt this point, the Bitcoin stood at a valuation of $36,456 (roughly Rs 10,333,227).\n\nDelving into the factors contributing to the present-day setback, Bitcoin underwent a dip of $623 (around Rs 176,585) over the past 24 hours.\n\nEthereum, conversely, exhibited a slight increase in price by 0.42% on Tuesday, with the present value resting at $2,052 (about Rs 581,626). Within the last day, Ether's value saw an up tick by $3 (approximately Rs 850).\n\nThe majority of alt coins trailed the footsteps of Bitcoin, incurring losses. The market's volatility is ascribed to impending data disclosures from the US, slated for later in the day.\n\nThe disclosure of US Consumer Price Index (CPI) figures (monthly and yearly) today is anticipated to have an impact on BTC prices.\n\nPositive data has the potential to propel prices upward, whereas adverse data might precipitate a decline in cryptocurrency valuations.\n\nEvidently, Tether, Binance Coin, USD Coin, Solana, Cardano, Dogecoin, and Tron recorded losses today.\n\nPrice downturns also affected Chainlink, Polkadot, Wrapped Bitcoin, Avalanche, Litecoin, and Shiba Inu, among other cryptocurrencies.\n\nAfter a stretch of four weeks marked by unwavering green candles, BTC appears to be entering a phase of moderation.\n\nIt's noteworthy that the market witnessed four consecutive weekly green candles only once this year, in January, succeeded by a pronounced correction.\n\nHowever, given the rising trend in the medium term, traders are gravitating towards extended positions, envisioning prospective profitability.\n\nIn the past 24 hours, the overall cryptocurrency market valuation fell by 0.66%, presently settling at $1.4 trillion, as per CoinMarketCap.\n\nConcurrently, alongside Ether, digital currencies like Polygon, Bitcoin Cash, Elrond, Iota, and Ardor successfully notched gains today."
    }
]