[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vZXRoZXJldW0tc2hhbmdoYWktdXBncmFkZS03Mzc3OTEy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "4 Things To Know About Ethereum's Shanghai Upgrade - Investopedia",
        "content": "Crypto watchers are setting their sights on Etherum this week, as the currency undergoes an upgrade that some think could have a negative impact on the price of the coin, at least in the short term.\n\nShanghai is an Ethereum upgrade that is scheduled to activate on Wednesday. Most notably, it will enable those who have previously staked their ether (ETH) on the network to make withdrawals for the first time, which some market commentators say could have negative implications for the ETH price going forward. The upgrade also includes the implementation of five different Ethereum Improvement Proposals (EIPs).\n\n\n\nKey Takeaways Shanghai is a hard-forking upgrade to Ethereum that will complete the network's transition from proof-of-work (PoW) to proof-of-stake (PoS).\n\nInvestors are worried the ability to withdraw staked ETH could have a negative impact on the price over the short term.\n\nOther technical improvements in the Shanghai upgrade are intended to improve the transactional aspects of ethereum.\n\nHere are four things to know about Ethereum's Shanghai upgrade and how it will impact the Ethereum ecosystem.\n\nFinalization of the Move to Proof-of-Stake\n\nShanghai is the final step in Ethereum's move from proof-of-work (PoW) to proof-of-stake (PoS) consensus mechanism. Proof-of-stake is considered a more energy-efficient way for verifying cryptocurrency transactions where validators are randomly selected based on the staked ETH as opposed to all validators competing to verify blocks first in proof-of-work.\n\nEthereum started as a PoW network but its PoS-based Beacon Chain, which ran along the live, PoW blockchain, was first launched in December 2020, and a merger between those two chains, known as The Merge, took place in September 2022.\n\nWhile Ethereum users have been able to stake their ETH since the launch of the Beacon Chain, they have not been able to unstake their ETH. The Shanghai update changes that in the form of EIP-4895 and finalizes this transition to PoS.\n\nInvestors Worry About Staked ETH Coming to Market\n\nThe ability to unstake ETH and their associated staking rewards earned so far has some investors worried, as it could enable many users who were previously unable to sell their staked ETH to dump their holdings on the market. Currently, roughly 15% of the total ETH supply is staked on the network.\n\nAccording to a report from CoinDesk, as much as $2.4 billion worth of selling pressure could hit the ETH market as a result of Shanghai.\n\nThat said, it should be noted that all of this staked ETH cannot be unstaked all at once. There is a limit to the amount of staking withdrawals that can take place per block, and one February estimate from Into The Block points out it would take around 60 days for 20% of validators (stakers on the network) to unstake their ETH.\n\n\n\nCrypto's Environmental Impact Debate in Focus\n\nShanghai's completion of Ethereum's transition to PoS also brings up crypto's ongoing debate about its potential environmental impact. PoW requires miners to prove their reliability to the network through the use of computer hardware, while PoS opts for an approach involving the staking of a crypto asset. For this reason, PoW uses much more energy than PoS.\n\nPoS proponents often refer to PoW as wasteful, while proponents of PoW, which is used in bitcoin and is unlikely to be removed from that crypto network, view PoS as less secure and prone to centralization.\n\n\n\nTechnical Upgrades for Ethereum Transactions\n\nOf course, the ability to unstake ETH is not the only change included in the Shanghai hard fork. For example, there is also EIP-3651, EIP-3855,, and EIP-3860, which are all intended to improve the efficiency of transactions on the Ethereum network and lower gas fees for various decentralized applications (dapps).\n\nIt should also be noted that there are a number of consensus-layer changes included in Wednesday's hard fork in the form of an upgrade known as Capella. For this reason, many Ethereum developers are referring to the combination of these two upgrades as Shapella (a combination of Shanghai and Capella)."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vd3d3LndpcmVkLmNvbS9zdG9yeS9ldGhlcmV1bS1zaGFuZ2hhaS11cGRhdGUtY3J5cHRvLXJpZnQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Ethereum's Shanghai Update Opens a Rift in Crypto - WIRED",
        "content": "At 19:27 Eastern time on April 12, the Ethereum blockchain, home to the world’s second-most-popular cryptocurrency, ether, will finally sever its links to crypto mining. Within the Ethereum bubble, a sense of anticipation is building; some are planning “viewing parties” for the occasion. Codenamed “Shanghai,” the update to Ethereum caps off a process, after “The Merge,” which fundamentally changes the way transactions are verified and the network secured.\n\nUnder the old system, proof-of-work (PoW) mining, the right to process a batch of transactions and earn a crypto reward is determined by a race to solve a mathematical puzzle. The greater the computing power miners throw at the problem, the greater their chance of winning the race. Under Ethereum’s new proof-of-stake (PoS) system, there is no race and there are no miners; instead, the winner is determined by raffle. The greater the amount of ether somebody locks up on the network—or stakes—the greater the chance they hold a prize-winning ticket.\n\nBy demonstrating that a large-scale blockchain can shift from one system to another, Shanghai will reignite a debate over whether the practice of mining that still supports bitcoin, the most widely traded cryptocurrency, is viable and sustainable. Figures from the University of Cambridge suggest the Bitcoin network consumed 107 terawatt-hours of energy in 2022—equivalent to that of the Netherlands—of which only just over a quarter came from renewable sources. Prior to The Merge, Ethereum consumed roughly two-thirds as much energy as the Bitcoin network. But the move away from mining has cut that consumption, according to analysis by Alex de Vries, data scientist at De Nederlandsche Bank and creator of Digiconomist, a source of crypto emissions data, by at least 99.84 percent.\n\n“The energy consumption problem is Bitcoin’s achilles heel,” says de Vries. “It’s a simple fact that as the price of bitcoin gets higher, the energy consumption problem gets worse. The more money miners make, the more they will typically spend on resources: hardware and electricity.\n\nBut many bitcoiners dispute the characterization of the network as energy-guzzling and carbon intensive, saying that mining is increasingly powered by renewable energy. And, they say, PoS is inferior to PoW—prone to centralization (crypto’s great nemesis), concentrating influence and wealth in the hands of the wealthy, without any mitigating forces, like energy costs, pulling in the opposite direction. All of this makes Shanghai a proxy battle over the future of crypto.\n\nIn bitcoin’s infancy, the cryptocurrency could be mined effectively with just a personal computer and simple software. But as the level of appetite for bitcoin increased, the industry professionalized. Today, the mining scene is dominated by large companies—some publicly traded, like Marathon Digital and Riot Blockchain—that operate gargantuan facilities with rack upon rack of hardware. The largest of these mines, many of which are located in Texas, can draw upwards of 700 MW of power."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3Lmdsb2JhbHhldGZzLmNvbS90aGUtc2hhbmdoYWktdXBncmFkZS1maW5hbGl6aW5nLWV0aGVyZXVtcy1wb3MtdHJhbnNpdGlvbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "The Shanghai Upgrade: Finalizing Ethereum's PoS Transition – Global X ETFs - Global X",
        "content": "Ethereum’s transition to a Proof-of-Stake (PoS) network marked the beginning of a major shift in Ethereum’s infrastructure. In addition to overhauling the network’s consensus mechanism and drastically reducing its energy consumption, the shift to a PoS system (“The Merge”) also introduced the foundation needed to improve Ethereum’s transactional capacity and scalability. These upgrades can be further explored in The Merge: Supercharging Ethereum.\n\nSince “The Merge,” the network has been secured by validators who have bonded or “staked” their ether (ETH) tokens to the Beacon Chain, Ethereum’s consensus engine. The process of staking, however, has been a one-way street as the network has not allowed validators to withdraw their staked assets. For Ethereum to become a fully-operational PoS network and for “The Merge” to be considered complete, the ability to withdraw staked assets is critical.\n\nIn this report, we will explore Ethereum’s upcoming and highly-anticipated Shanghai Upgrade, a software update that will enable staking withdrawals and mark the final step of Ethereum’s transition to PoS.\n\nKey Takeaways\n\nSince the inception of the Beacon Chain, network participants have staked ETH to secure Ethereum network activity in exchange for ETH-denominated rewards. To date, the Beacon Chain has not allowed for the withdrawal of staked ETH or their associated rewards.\n\nThe Shanghai Upgrade, scheduled for April 2023, is expected to unlock the withdrawal of staked ETH from the Beacon Chain.\n\nRemoving the restrictions on staking withdrawals fundamentally changes the risk and liquidity considerations associated with staking. This change is expected to make Ethereum a more complete PoS network, and its native asset ETH a more capital-efficient vehicle.\n\nStaked ETH Is the Foundation of Ethereum’s Security\n\nScheduled for April 2023, the Shanghai Upgrade includes various changes to Ethereum’s code base, referred to as Ethereum Improvement Proposals (EIPs). Among the changes being implemented in the upgrade, EIP-4895 is the most important as it allows for the withdrawal of staked ETH from the Beacon Chain.\n\nThe Beacon Chain is Ethereum’s PoS consensus engine first launched in December 2020. The Beacon Chain is responsible for coordinating how the network’s nodes come to an agreement about the state of the blockchain. In other words, it ensures that all nodes have a consistent copy of the blockchain’s ledger and that all transactions are valid and secure.\n\nPrior to Ethereum’s transition to PoS, the Beacon Chain operated in parallel to the Ethereum blockchain and served as a sandbox for developers to test the PoS code. During the event referred to as “The Merge,” the legacy Ethereum blockchain merged with the Beacon Chain, effectively switching Ethereum from a Proof-of-Work (PoW) to a PoS network.\n\nSince the Beacon Chain’s inception, network validators have been bonding or “staking” ETH for the right to validate network activity. To date, about 18 million ETH, or around 15% of the circulating supply of ETH has been staked to the Beacon Chain, representing roughly $32.9 billion of economic security.1 In exchange for these services, validators have been earning ETH-denominated rewards issued by the network, worth approximately $2.3 billion as of the current price of ETH.2\n\nIn exchange for these rewards, staking participants have been required to lock their ETH to the Beacon Chain staking contract indefinitely. The inability to unstake ETH following “The Merge” was an intentional choice made by Ethereum core developers as it ensured the new PoS consensus engine worked flawlessly in its initial stages. Unsurprisingly, the illiquidity associated with staking has sidelined many prospective stakers. With months of Ethereum operating under a PoS consensus mechanism, however, developers are now confident that the necessary conditions have been met to safely implement withdrawals from the Beacon Chain.\n\nThe Shanghai Upgrade Is Expected to Benefit Liquidity and Network Security Over the Long Run\n\nRemoving restrictions on staking withdrawals is expected to fundamentally change the risks associated with staking ETH to the Beacon Chain. Primarily, the Shanghai Upgrade removes the execution risk surrounding the software upgrade. Albeit small, the risk of unforeseen issues arising during software updates can be a concern for participants. Given that capital investment is a prerequisite for staking, execution risk can be enough to convince prospective stakers to remain on the sidelines. In addition, the implementation of staking withdrawals is expected to improve the liquidity profile of staked ETH, thereby reducing liquidity risk. In an asset class known for its volatility, the ability to efficiently enter and exit investment positions is paramount.\n\nThe seamless staking and unstaking of ETH from the Beacon Chain also holds implications for the capital efficiency of the Ethereum network and its native asset. ETH is an asset with a high degree of utility. It must be spent during the execution of any transaction on the Ethereum network, is a widely-accepted and high-quality form of collateral, and is used as a medium of exchange. With the implementation of staking withdrawals, staking and unstaking ETH will become a more efficient process, further expanding ETH’s utility by providing users with a means of accessing a fairly liquid and passive income stream. In practice, this use case will be akin to depositing excess cash into a short-term money market fund until a more compelling need for the cash arises.\n\nThe Shanghai Upgrade is also likely to have positive downstream effects on the security of the Ethereum network. PoS networks such as Ethereum rely on the value of staked assets to protect the network from attacks. So long as no malicious actor controls a majority of the capital staked to the network, the network is able to resist any attempts to manipulate current or historical transactions. This relationship means that PoS networks can improve their economic security via a few avenues: price appreciation of staked tokens, an increase in the number of tokens staked to the network, or a combination of the two. As the implementation of staking withdrawals represents a relative reduction in the risks associated with staking, it is possible that the amount of ETH staked to the Beacon Chain may grow as previously sidelined participants are incentivized to capture staking rewards. Should this occur, Ethereum’s economic security should become more robust all else equal.\n\nAfter the implementation of the Shanghai Upgrade, validators will have the ability to automatically withdraw accrued staking rewards. Those validators seeking to fully exit network staking will have to follow a gradual and dynamic release process intended to moderate the flow into and out of the staking contract in order to protect network security.\n\nOn the surface, the changes that the Shanghai Upgrade will bring to Ethereum are simple. This software update, however, will effectively complete Ethereum’s transition to PoS and bring the network one step closer to realizing its long-term vision."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vZm9ya2FzdC5uZXdzL2V0aGVyZXVtLXNoYW5naGFpLXVwZ3JhZGUtdW5sb2Nrcy11czM0LWJpbGxpb24taW4tZXRoZXItd2hhdC1kb2VzLWl0LW1lYW4tZm9yLWNyeXB0by1wcmljZXMv0gF1aHR0cHM6Ly9mb3JrYXN0Lm5ld3MvZXRoZXJldW0tc2hhbmdoYWktdXBncmFkZS11bmxvY2tzLXVzMzQtYmlsbGlvbi1pbi1ldGhlci13aGF0LWRvZXMtaXQtbWVhbi1mb3ItY3J5cHRvLXByaWNlcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Shanghai upgrade unlocks US$34 billion in Ether, what does it mean for crypto prices? - Forkast News",
        "content": "Developers at Ethereum, the world’s second-biggest blockchain with a capitalization of US$231 billion, are set to upgrade the software network on Wednesday with reported new features and improvements to efficiency, cost and security.\n\nHowever, the main feature of the so-called Shanghai upgrade – to take place at 10:27 p.m. UTC on Wednesday, according to the Ethereum Foundation – is the EIP-4895. This allows users to withdraw their staked Ether, or tokens deposited to support the operations of a blockchain in return for a passive income, usually in the form of more tokens.\n\nWith around 18 million Ether (US$34.5 billion) – or about 15% of the total supply – staked into the network, according to Etherscan, concerns emerged that holders could rush to sell Ether to lock in profits, which would drive prices lower. Ether has risen about 60% so far this year and recently traded at more than US$1,900.\n\nBut on-chain data provider CryptoQuant doesn’t expect a flood of Ether sales, according to a report it released in February.\n\n“We argue that there would be low selling pressure for Ether from staking withdrawals after the Shanghai upgrade,” CryptoQuant said, adding that the majority of the staked Ether was still holding losses compared to Ether prices when it was staked. Ether reached all time highs of more than US$4,600 in November 2021.\n\n“Typically, selling pressure emerges when market participants are sitting on extreme profits, which is not the case right now for the Ether that has been staked,” CryptoQuant said.\n\nCryptoQuant also pointed out that the currently locked Ether cannot be withdrawn simultaneously, estimating it may take up to a year to withdraw the total value staked in the network,\n\nOther benefits\n\nZhuling Chen, chief executive officer of crypto staking service provider RockX, said some short-term market volatility is to be expected following the upgrade, but he preferred to focus on the “substantial” long-term benefits to the Ethereum blockchain.\n\n“Ethereum’s capacity to handle more transactions per second increases, transaction costs decrease, and the security and efficiency of smart contracts improve,” Chen said in a statement. The staking landscape will be transformed and Ethereum will become the benchmark yield for crypto, Chen added.\n\nThat’s a view shared by Alex Esin, chief executive officer of P2P.org, which offers institutional staking and blockchain development services. Expect a substantial increase in staking activity in the year following the Shanghai upgrade, Esin said in a statement.\n\n“We do not anticipate a massive unstaking once this functionality goes live,” Esin said.\n\nGuilhem Chaumont, chief executive officer of crypto-financial service Flowdesk, points out the system to withdraw staked Ether could itself prevent a sell off in the token.\n\n“It’s important to realize that the withdrawal queue only allows a limited set of requests per day (115,200), so while there may be sustained downward pressure on the price, unstaking is not likely to cause a sharp, sudden dip,” he said in an emailed comment.\n\nChaumont said it’s more likely a sizable portion of Ether will remain staked “with staking rewards outperforming current interest rates.”\n\nOverreact?\n\nKen Timsit, head of Cronos Labs, the accelerator of the Cronos chain that links the Ethereum and Cosmos blockchains, did caution that Ether stakers will monitor withdrawals after the Shanghai upgrade kicks in and may potentially overreact if there is significant withdrawal demand.\n\n“Once short-term volatility has been smoothed out, however, it is likely that the outcome will be neutral given that this upgrade has been priced into Ether value for some time,” Timsit said in an emailed comment.\n\nDanny Chong, co-founder of Tranchess, a decentralized app that offers Ethereum services, said the Shanghai upgrade will lower the risks associated with liquid staking and “should see increased institutional participation.”\n\nLiquid staking, also known as soft staking, allows investors to access their locked funds for other crypto-based activities while still earning rewards. Users with deposits locked on liquid staking platforms receive a tokenized version of their crypto assets, which then can be stored or traded elsewhere.\n\nThe total value of crypto assets locked in liquid staking services stood at US$17.3 billion on Tuesday, up from US$14 billion on March 1, making liquid staking the second-largest service in decentralized finance, following decentralized exchanges, according to data provider DefiLlama.\n\n“Earning yield from liquid staking shares similarities with certain traditional financial instruments such as bonds or stocks that offer interest payments,” Chong said. “Hence it would likely attract TradFi [traditional finance] participants who are familiar with such instruments.”\n\nChen of RockX shared similar views: “We will see more innovations coming from direct and liquid staking solutions, and liquid staking will start playing a much larger role in the cryptocurrency space.”\n\nSome cryptocurrency exchanges have also spotted opportunities to expand their staking products. For example, Singapore-based crypto exchange Bybit last month launched a new staking pool in time for the Shanghai upgrade.\n\n“The highly liquid and trading-integrated ETH staking options we will be rolling out around the time of Ethereum’s Shanghai upgrade will open up many new opportunities for our users,” Ben Zhou, chief executive officer of Bybit, said in a March statement.\n\nSee related article: What impact will Ethereum’s Shanghai upgrade have on ETH and crypto markets?"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDQvMTEvd2hhdHMtbmV4dC1hZnRlci1ldGhlcmV1bXMtc2hhbmdoYWktdXBncmFkZS_SAVlodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA0LzExL3doYXRzLW5leHQtYWZ0ZXItZXRoZXJldW1zLXNoYW5naGFpLXVwZ3JhZGUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "What’s Next After Ethereum’s Shanghai Upgrade? - CoinDesk",
        "content": "The upgrade is sometimes referred to as \"Shapella\" because the planned changes to the blockchain's execution layer are collectively known as \"Shanghai,\" while changes to the consensus layer are known as Capella. (Shanghai + Capella = Shapella. Get it?) The ensemble is changes are expected to go into effect on Wednesday around 6:30 p.m. ET (22:30 UTC), enabling withdrawals of staked ether for the first time."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2JpdGNvaW4tY2xpbWJzLXBhc3QtMzBrLWV0aGVyZXVtLWFwcHJvYWNoZXMtMmsv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin climbs past $30k, Ethereum approaches $2k - CryptoSlate",
        "content": "Bitcoin (BTC) soared past the $30,000 mark on April 11 — reaching its highest point since June 2022.\n\nAt the time of writing, BTC was trading at $30,073 while its market cap reached $581.7 billion, according to CryptoSlate data. Bitcoin is up 6% over the past 24 hours and 7.41% over the past week.\n\nBitcoin’s rally buoyed the entire cryptocurrency market — the global crypto market cap is up more than 4% to $1.24 trillion over the past 24 hours. The total crypto market trading volume reached $47.26 billion.\n\nEthereum (ETH), the second-largest cryptocurrency, bagged 3.1% gains over the past day to trade at $1,917 at the time of publishing. The market cap of ETH stood at $230.9 billion. Ethereum last neared the $2,000 mark in August 2022.\n\nThe gains came ahead of the Shanghai upgrade scheduled for April 12 — when 18 million staked ETH worth around $34 billion will be unlocked. The unlocking is expected to create selling pressure on ETH and negatively impact the price of ETH.\n\nWith the gains of the past day, Bitcoin and Ethereum are up over 81% and 60% year-to-date, respectively.\n\nSolana (SOL) recorded the highest gains over the past day, rising 9.66% over the past day to $22.22 at the time of writing. BNB (BNB), Cardano (ADA), and XRP (XRP) prices climbed by 4% or more over the past 24 hours. BNB rose 4.66% to $327.49 while XRP price increased 4% to $0.52. Cardano price is up 4.32% to $0.40 at the time of writing.\n\nDogecoin (DOGE) and Polygon (MATIC) saw minor gains of 1.65% and 2.66% respectively over the past day.\n\nThe rise in crypto prices comes at a time when investors are awaiting key inflation data due to be released later this week. Traders are hoping to see a pause in Fed interest rate hikes, which could further boost crypto prices.\n\nMentioned in this article"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vdS50b2RheS9hbmFseXN0LW5hbWVzLXllYXItd2hlbi1ldGhlcmV1bS1ldGgtbWlnaHQtcmVhY2gtMTAwMDDSAUpodHRwczovL3UudG9kYXkvYW5hbHlzdC1uYW1lcy15ZWFyLXdoZW4tZXRoZXJldW0tZXRoLW1pZ2h0LXJlYWNoLTEwMDAwP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Analyst Names Year When Ethereum (ETH) Might Reach $10,000 - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a recent series of tweets , Chris Burniske, a well-known analyst, made a bold prediction about the future of Ethereum (ETH). Burniske hinted that Ethereum's price could reach $10,000 by 2025. While this may seem like a stretch, especially considering Ethereum's current price of $1,858, Burniske's optimism should not be disregarded.\n\nAdvertisement\n\nBurniske's tweets were seemingly aimed at those who have been consistently bearish on Ethereum, even as its price has risen from $1 to $10, $100 and $1,000. He suggests that the naysayers may have to reconsider their stance as Ethereum continues its upward trajectory, potentially reaching the $10,000 mark by 2025.\n\nThere are several factors that could contribute to Ethereum's bullish rally in the coming years. The recently announced staking contract unlock could lead to increased adoption of Ethereum and its associated technologies, such as decentralized finance (DeFi) and non-fungible tokens (NFTs).\n\nFurthermore, the resurgence of interest in blockchain technology and digital currencies from institutional investors may considerably boost Ethereum's value. As an increasing number of institutions start allocating a portion of their portfolios to cryptocurrencies, Ethereum is expected to reap the benefits of heightened demand and investment.\n\nIt is important to highlight that Ethereum's supply dynamics are undergoing a transformation due to the introduction of EIP-1559, which implements a fee-burning mechanism. This modification could render Ethereum scarcer, potentially resulting in a rise in its worth over time.\n\nAlthough Burniske's forecast of Ethereum hitting $10,000 by 2025 may appear excessively optimistic, it is crucial to bear in mind that the crypto market is infamously unstable and erratic. Even the most seasoned experts can have difficulty precisely predicting the future trajectories of digital assets."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL2F3cy5hbWF6b24uY29tL2Jsb2dzL2RhdGFiYXNlL2RlcGxveS1hbi1ldGhlcmV1bS1kZXZlbG9wbWVudC1lbnZpcm9ubWVudC11c2luZy1hbWF6b24tZWMyLWFuZC1hbWF6b24tbWFuYWdlZC1ibG9ja2NoYWluL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Deploy an Ethereum development environment using Amazon EC2 and Amazon Managed Blockchain | Amazon Web ... - AWS Blog",
        "content": "In this post, you learn how to deploy a cloud-based development environment with which to build, test, and deploy smart contracts on the public Ethereum Goerli testnet via a dedicated Ethereum full node managed using Amazon Managed Blockchain. You can also use the steps outlined in this post to create a development environment on the Ethereum mainnet and other public testnets supported on Managed Blockchain.\n\nEvery developer that wishes to create a decentralized application (dApp) that utilizes the Ethereum network, inclusive of both on-chain components like smart contracts and off-chain components such as a React frontend application, needs to utilize industry-standard developer tools such as Ethers.js and Hardhat. However, setting up a development environment to begin building can take a non-marginal amount of time, particularly for those who are just getting started using these tools.\n\nSolution Overview\n\nAmazon EC2 – Amazon Elastic Compute Cloud (Amazon EC2) offers secure and resizable compute capacity for virtually any workload. It offers a wide variety of compute instance families to cater to your specific use case. In this post, an EC2 instance running Amazon Linux 2 serves as the primary compute for your Ethereum development environment and connects to your Ethereum full node on Managed Blockchain.\n\n– Amazon Elastic Compute Cloud (Amazon EC2) offers secure and resizable compute capacity for virtually any workload. It offers a wide variety of compute instance families to cater to your specific use case. In this post, an EC2 instance running Amazon Linux 2 serves as the primary compute for your Ethereum development environment and connects to your Ethereum full node on Managed Blockchain. Visual Studio Code – Visual Studio Code is a popular desktop integrated development environment (IDE) that is used to develop, test, and debug code in virtually any programming language. With a VS Code plugin, you can connect your VS Code IDE directly to a remote EC2 instance, which will allow you to write code in VS Code and test it directly on your EC2 instance.\n\n– Visual Studio Code is a popular desktop integrated development environment (IDE) that is used to develop, test, and debug code in virtually any programming language. With a VS Code plugin, you can connect your VS Code IDE directly to a remote EC2 instance, which will allow you to write code in VS Code and test it directly on your EC2 instance. Amazon Managed Blockchain – Managed Blockchain is a fully managed service that allows you quickly deploy production-grade blockchain infrastructure with a few clicks, including single-tenant Ethereum nodes with which to interact with the public Ethereum mainnet and testnets. With a dedicated full node to connect to public Ethereum networks (Mainnet, Goerli, and Rinkeby), you can read data from the blockchain, broadcast transactions, and subscribe to events on the blockchain. Managed Blockchain for Ethereum does the heavy lifting of spinning up and maintaining Go-ethereum (geth) nodes for your applications, eliminating the requirement for you to manage instance configuration, software patching, and node health checks.\n\n– Managed Blockchain is a fully managed service that allows you quickly deploy production-grade blockchain infrastructure with a few clicks, including single-tenant Ethereum nodes with which to interact with the public Ethereum mainnet and testnets. With a dedicated full node to connect to public Ethereum networks (Mainnet, Goerli, and Rinkeby), you can read data from the blockchain, broadcast transactions, and subscribe to events on the blockchain. Managed Blockchain for Ethereum does the heavy lifting of spinning up and maintaining Go-ethereum (geth) nodes for your applications, eliminating the requirement for you to manage instance configuration, software patching, and node health checks. Ethers.js – Ethers.js is an industry-standard library that provides a complete and compact library for interacting with the Ethereum Blockchain and its ecosystem.\n\n– Ethers.js is an industry-standard library that provides a complete and compact library for interacting with the Ethereum Blockchain and its ecosystem. Hardhat – Hardhat provides a suite of Ethereum development environment tools to develop and test Solidity smart contracts. In this post, we use Hardhat to deploy our smart contracts and write tests for them.\n\nEthereum developer tools interact with the blockchain through your node through its JSON-RPC API, which serves as an interface for common blockchain interactions. There are two methodologies for access to your Ethereum node’s JSON RPC API when using Managed Blockchain: Signature Version 4 (SigV4) and Token-based Access (TBA).\n\nSigV4 is a hash-based message authentication code (HMAC) mechanism that is used to authenticate AWS SDK calls. It provides several security guarantees, including request expiration timestamping at signing time, payload signature per request, and more.\n\nAlthough SigV4 has been the main way to authorize requests, it poses interoperability challenges with established community tools (such as Ethers.js, Hardhat, Foundry, and so on) that rely on a direct connection to an Ethereum RPC endpoint and aren’t designed to create and append an AWS SigV4 signature to requests. As a result, customers have relied on middleware or custom proxies that were capable of signing mid-flight requests from applications using Ethereum developer tools to nodes hosted on Managed Blockchain.\n\nToken-based access, a new access method for Ethereum nodes on Managed Blockchain, presents a solution to this interoperability problem by allowing you to optionally use a token (accessor) to access your node rather than a SigV4 signature. Accessors can now be provided as part of the request object when communicating with the JSON RPC API for your Ethereum nodes. For a quick-start guide on how to create and use accessors to access these Ethereum JSON RPC API methods, refer to Introducing token-based access to Ethereum node APIs on Amazon Managed Blockchain.\n\nThe following figure illustrates the solution architecture.\n\nThe following sections outline how to configure, deploy, and test your cloud-based Ethereum development environment on the public Ethereum Goerli testnet. This guide utilizes the AWS Cloud Development Kit (AWS CDK) to provide a templated deployment that automates much of the process of deploying the environment in a repeatable manner.\n\nPrerequisites\n\nTo follow the steps in this post, you need to install a few dependencies and prepare your local environment to use AWS CDK and deploy resources in your AWS account. Complete the following steps:\n\nInstall the AWS Command Line Interface (AWS CLI).\n\nThe AWS CLI allows you to interact with AWS services from a terminal session. Make sure you have the latest version of the AWS CLI installed on your system, which you can install using the following methods: Windows – MSI installer (64-bit)\n\nLinux, macOS, or Unix – Bundled installer To use the AWS CLI to interact with AWS services, you must configure it with your AWS credentials and default region. In a terminal session, run the command aws configure, then follow the prompts to add your AWS access key ID, secret access key, and default Region. Leave the prompt for the default output format blank. To run the CDK application, you need to install Node.js with a version >=8.12.0. It is recommended that you use Node Version Manager (NVM) because it makes it easy to change your Node.js version on the fly for testing purposes. For instructions, refer to Installing and Updating. To access the EC2 instance that you create as your development environment, you need to create an EC2 key pair that you can use for SSH access to the instance: On the Amazon EC2 console, in the navigation pane, under Network & Security, choose Key Pairs.\n\nChoose Create key pair.\n\nFor Name, enter a descriptive name for the key pair.\n\nAmazon EC2 associates the public key with the name that you specify as the key name. A key name can include up to 255 ASCII characters. It can’t include leading or trailing spaces.\n\nFor Key pair type, choose either RSA or ED25519. For Private key file format, choose the format in which to save the private key. To save the private key in a format that can be used with OpenSSH, select pem. To save the private key in a format that can be used with PuTTY, select ppk. To add a tag to the public key, choose Add tag, and enter the key and value for the tag. Repeat for each tag. Choose Create key pair.\n\nThe private key file is automatically downloaded by your browser. The base file name is the name that you specified as the name of your key pair, and the file name extension is determined by the file format that you chose.\n\nSave the private key file in a safe place. If you will use an SSH client on a macOS or Linux computer to connect to your Linux instance, use the following command to set the permissions of your private key file so that only you can read it:\n\nchmod 400 <key-pair-name>.pem\n\nInstall the AWS SDK\n\nTo deploy the AWS services that will be used for your Ethereum development environment, such as a node on Managed Blockchain and an EC2 instance, you use the AWS CDK. The AWS CDK accelerates cloud development using common programming languages to model your applications, translating code into AWS CloudFormation templates to repeatably deploy your applications and architectures in AWS. In this example, you write an AWS CDK application in Typescript, an extension of JavaScript using a Node.js runtime. Therefore, you need to install the AWS CDK Toolkit for Node.js using Node Package Manager (NPM).\n\nTo install the AWS CDK Toolkit, a command-line utility that allows you to work with AWS CDK apps, open a terminal session and run the following command:\n\nnpm install -g aws-cdk\n\nNote that on Windows, you’ll need to run this as an administrator. On POSIX/UNIX systems, you may need to run this with sudo.\n\nYou can check the toolkit version by running the command:\n\ncdk --version\n\nDownload and run the AWS CDK application\n\nNext, you download the repository that contains the AWS CDK application for the Ethereum development environment deployment.\n\nFirst, run the git command to retrieve the repository to your local machine: git clone https://github.com/aws-samples/automated-goerli-development-environment Change directories to automated-goerli-development-environment/ to configure your AWS CDK application: cd automated-goerli-development-environment Configure the application for deployment in your preferred IDE (for example, VSCode) or using a command line editor like Vim. For example, to use Vim to edit your config file, run the following commands from the main project directory: cp ./configs/config_template.json ./configs/config.json vim ./configs/config.json In the Vim editor, choose i to enter Insert mode, which you use to modify a few key properties: { \"stackName\": \"BlogGoerliStack\", \"ec2Name\": \"AMB_Dev\", \"nickName\": \"AMB_Dev\", \"ec2Class\": \"t3\", \"ec2Size\": \"xlarge\", \"keyName\": \" <YOUR KEY NAME HERE> \", \"keyFile\": \" <./Key/YOURKEY.pem> \", \"userDataFile\": \"./Scripts/startup_user.sh\", \"cdkOut\": \"cdk-outputs.json\", \"timeBomb\": \"30\", \"awsConfig\": \"~/.aws\", \"clientIpAddr\": \" <Please add the CIDR IP address of client connecting to EC2> \", \"Mnemonic\": \" <your test 12 word seed phrase> “ **SEE IMPORTANT WARNING BELOW }\n\nReplace the keyName and keyFile properties with the name and path to your saved EC2 key file, respectively. Replace the placeholder for clientIpAddr with your IP address, which will restrict access to your development environment instance to only your IP address. You should also create a burner Ethereum wallet that you’ll use to test with, which you import into this development environment using a mnemonic seed phrase (12 words) for a test wallet that doesn’t have mainnet funds.\n\n***Note that you should not import an Ethereum wallet mnemomic seed phrase with funds or any wallet that you use on mainnet, because you risk losing your assets.\n\nAfter you have made your updates to the configuration file, save your changes in Vim by entering :wq and choosing Enter or Return on your keyboard.\n\nThis will write-quit, saving changes you made in Vim. Now you’re ready to deploy your AWS CDK application and create your environment.\n\nTo deploy the application, run the following commands from your project directory: npm install cdk bootstrap cdk deploy\n\nThe initial deployment will take about 3 minutes to complete, but due to sync times for the public Ethereum testnet, the Ethereum node on Managed Blockchain will not be usable for approximately 35 minutes while the blockchain data is synced. When the deployment is complete, an EC2 instance with the tools required to develop, test, compile, and deploy smart contracts on Ethereum will be available to you. This includes the creation of resources required to access the Ethereum node as well, including the VPC, accessor token, and necessary security policies.\n\nUse your Ethereum development environment using SSH\n\nAfter your AWS CDK application is deployed and your Ethereum node on Managed Blockchain is synced, in a new terminal tab, run the following command to connect to your EC2 instance via SSH:\n\nssh -i ./Key/YOURKEYNAME.pem ec2-user@INSTANCE_IP_ADDRESS\n\nYou can find the value of the variable INSTANCE_IP_ADDRESS in the output of the cdk deploy command run in the previous steps.\n\nWhen you’re connected to the EC2 instance, you can find boilerplate Solidity code for a simple smart contract along with node.js code to connect to the blockchain, compile the smart contract, deploy the smart contract, and run methods on the smart contract via blockchain transactions. Furthermore, the industry-standard developer tooling for Ethereum, Hardhat, is pre-installed with a sample script for testing the smart contract.\n\nThe following directory structure is created:\n\ndecentralized-app-for-goerli-nodejs/ ├─ artifacts/ ├─ cache/ ├─ contracts/ │ ├─ CountPerAccount.sol ├─ DemoApps/ ├─ test/\n\nThe directories are described as follows:\n\ndecentralized-app-for-goerli-nodejs – Parent directory\n\n– Parent directory artifacts – Directory used by compiler\n\n– Directory used by compiler cache – Directory used by compiler\n\n– Directory used by compiler contracts – Solidity code for the smart contract CountPerAccount.sol – a sample smart contract\n\n– Solidity code for the smart contract DemoApps – node.js code for blockchain and smart contract access\n\n– node.js code for blockchain and smart contract access test – Directory containing scripts to run some sample tests on the smart contract using Hardhat\n\nRun the following command to run the static tests on the smart contract using Hardhat before deploying:\n\ncd decentralized-app-for-goerli-nodejs npx hardhat test\n\nIf you desire, you can use other Hardhat tools and commands in this directory.\n\nTo connect to the blockchain to deploy the smart contract, you will run the node.js application code in DemoApps . First, you will connect to the Ethereum Goerli testnet via your Managed Blockchain Ethereum node and the app will get the balances of several accounts derived from your mnemonic seed phrase that was imported in earlier steps. Then, it will perform a transaction to transfer the native cryptocurrency with which to pay fees, gEth (Goerli Ether), from one account to another.\n\ncd DemoApps node demoBlockChainAccess\n\nNext, you call the node.js application method to compile and deploy the smart contract:\n\nnode demoContract\n\nOnce deployed to the blockchain, the address of the deployed smart contract is automatically saved to the environment for smart contract access. The demoContractAccess method uses this smart contract address to run a transaction to call a method on the smart contract and return the results:\n\nnode demoContractAccess\n\nThe above method is to access the smart contract. In this method, the transactions are signed and sent to the blockchain through your Amazon Managed Blockchain Ethereum testnet node, and the result is printed to the terminal.\n\nYou have now set up your Ethereum development environment on AWS and compiled, deployed, and tested a smart contract. You’re ready to build your own Ethereum application on top of this boilerplate example. Alternatively, you may also use an IDE like Visual Studio Code to connect to your EC2 instance.\n\nOPTIONAL: Connect to your development environment via VS Code\n\nOptionally, you can connect via VS Code:\n\nGo to the Visual Studio downloads website and download the VS Code for your appropriate environment. For detailed instructions, refer to the following based on your OS: macOS – Visual Studio Code on macOS\n\nWindows – Visual Studio Code on Windows Install the Remote Development Extension for Visual Studio Code. To configure the SSH config file, go to VS Code Command Palette by choosing Shift+Command+P (macOS) or Ctrl+Shift+P (Windows). Enter remote and choose Remote-SSH: Open SSH Configuration File 4.\n\nVS Code will present few locations for the configuration file.\n\nChoose the file in your /Users (macOS) or C:\\Users (Windows) folder. Enter the following in the SSH config file: Host AMB_DEV_ENV HostName _INSTANCE_IP_ADDRESS User ec2-user IdentityFile [location where the pem file you downloaded] (whole path like: \"/users/…/Key/YOURKEY.pem\" After the SSH configuration is saved, connect to EC2 instance by choosing the green icon at the bottom of the VS Code page. Choose Connect to Host and choose AMB_DEV_ENV on the drop-down menu.\n\nOnce connected to the EC2 instance, you may use the same steps as you followed in “Use Your Ethereum development environment via SSH” from the terminal within VS Code.\n\nCleanup\n\nTo remove the AWS resources you created during the preceding steps, run the following AWS CDK command:\n\ncdk destroy\n\nThis command may take a few minutes to complete. Remember to back up any code updates or files you may have created in your environment before running this command, if desired.\n\nConclusion\n\nIn this post, we showed you how to deploy a cloud-based IDE with which to build, test, and deploy smart contracts on the public Ethereum Goerli testnet via a dedicated Ethereum full node managed using Managed Blockchain. With this cloud-based development environment, developers can more easily build and test Ethereum smart contracts without having to manage an Ethereum node or manually configure an environment on their local machine.\n\nTo learn more about Token-Based Access, a new interoperability feature for Ethereum nodes on Amazon Managed Blockchain, read Introducing token-based access to Ethereum node APIs on Amazon Managed Blockchain.\n\nAbout the authors\n\nForrest Colyer is a blockchain specialist Solutions Architect at AWS. Through his experience with private blockchain solutions led by consortia and public blockchain use cases like NFTs and DeFi, Forrest helps enable customers to identify and implement high-impact blockchain solutions.\n\nMukesh is a Blockchain Global Senior Partner Solutions Architect at AWS. In this role Mukesh owns technical relationship with Blockchain ISV partners and is their trusted advisor, helping them design their Blockchain solutions most optimally on AWS Cloud. Mukesh is a deep technologist with a focus on driving the adoption of blockchain, Digital Assets and other innovative technologies in the public and private sectors, he is proficient in designing high-impact blockchain solutions, and guiding the development and implementation of blockchain applications in the industry. Mukesh lives in the windy city of Chicago, enjoys exploring new travel destinations and picking up new skills, whether it be a new coding language or whipping up a new Indian dish in the kitchen!"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V0aGVyZXVtLXNoYW5naGFpLWxpcXVpZC1zdGFraW5n0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Why the Ethereum Shanghai Upgrade Will Lead to War - Blockworks",
        "content": "DeFi industry: There is a new war on the horizon. Unlike the Curve Wars, fought over stablecoin liquidity dominance, this war will be fought over the future of liquid staking tokens.\n\nThe catalyst for this upcoming battle?\n\nThe Ethereum Shanghai fork, set to take place on April 12, when more than 18 million in staked ether (~$34.2 billion) will become unlocked and battlelines will be drawn.\n\nI believe that Shanghai will provoke a period of intense competition among liquid staking protocols that will come to be known as the “Liquid Staking Wars” — albeit wars that will ultimately benefit the entire industry.\n\nThose of us who were here for DeFi Summer will remember the Curve Wars well: the ruthless competition between the emerging stablecoin protocols, who “fought” on the Curve DEX to have the deepest liquidity and most diverse set of liquidity pairings.\n\nLet’s review the ingredients that precipitated the Curve Wars:\n\n1) a DEX Automated Market Maker (AMM) especially designed for trading stablecoins (Curve);\n\n2) a mechanism for protocols to incentivize liquidity providers (LPs) to move from LPing one stablecoin to another (Curve incentive contracts);\n\nand 3) a bunch of new stablecoin protocols jockeying for market share (USDC, USDT, DAI, FRAX, LUSD, etc).\n\nI see striking similarities with the Curve Wars in the burgeoning competition between protocols that offer liquid staking tokens (LSTs) — yield-bearing tokens that allow holders to stay liquid while enjoying the yield from staked ETH.\n\nWe already see the same ingredients coalescing with:\n\n1) novel DEX AMM protocols especially designed to facilitate LPing liquid staking token (LST) pairs;\n\n2) incentive contracts that LST protocols can use to reward LST LPs; and\n\n3) a cascade of emerging LST protocols vying for market share.\n\nThe Liquid Staking Wars have one last different ingredient — the imminent Shanghai upgrade that will enable LPs to easily and cheaply unstake ETH from one LST and move it to another LST.\n\nThe Liquid Staking Wars will be won by whichever protocol can capture the most TVL and volume for their LST. I believe that the battle for LST supremacy will see its first skirmishes by early May and that it will have a lasting impact on the DeFi ecosystem.\n\nAfter all staked Ethereum becomes unlocked in mid-April, unstaked ETH holders will be incentivized to move their ETH from one liquidity staking token solution to another, always seeking the highest potential returns in liquidity pools. LST protocols will likewise be incentivized to capture market share by having their token be the most liquid.\n\nThis war — or competition between LST protocols to provide the dominant asset in crypto — will reshape all crypto pairs across all DEXs.\n\nLiquidity provider (LP) strategies will also evolve based on the yield-bearing characteristics of LSTs; DEXs will evolve their offerings to accommodate this new landscape; and the DeFi industry will benefit from a wave of innovation (as we see in most periods of increased competition).\n\nThe Liquid Staking Wars’ tactics will mirror those of the Curve Wars\n\nWe will see LST protocols attempt to differentiate themselves through innovation, usability and yield. The most obvious mechanism will be yield: LST protocols will seek to maximize the incentives for LPs to fund liquidity pools using their LST over any other LST.\n\nPost Shanghai, there will be a big opportunity cost for LPs who add liquidity to ETH-denominated pools instead of pools denominated in an LST. The ETH LPs will be foregoing ~4% return for no good reason.\n\nEven pre-Shanghai, we have seen a massive demand for LST yield: Liquid staking tokens have skyrocketed in total value locked (TVL) to account for more than $14 billion, according to DeFiLlama as of April 3, 2023. The LST sector is second only to the current size of all decentralized exchange protocols combined.\n\nSome may claim that Lido — with a near 75% of LST TVL market share — has won the war before it has even begun. But while Lido has established itself as a leader, entrants such as Frax, Coinbase, Rocket Pool, and new protocols that have yet to launch are jockeying for position to have their LST become the preeminent ETH replacement.\n\nAs with any war, the winners and losers will be defined by strategically deploying the right set of tactics on the battlefield.\n\nThis competition — and specifically the competitive incentivization of liquidity pools it will entail — should also benefit other participants across the DeFi ecosystem. LSTs have a place not just paired with each other or with ETH in pools, but also with other utility tokens. For example, instead of WBTC-ETH being a popular pool on DEXs, I expect to see WBTC-WSTETH, WBTC-cbETH or WBTC-rETH.\n\nI expect a groundswell of co-incentive liquidity pool structures pairing utility and yield tokens. These partnerships should benefit long-tail tokens by providing the liquidity required to build their businesses, as well as some of the most well-known utility tokens seeking to expand their influence.\n\nIn addition to maximizing incentives into liquidity pools, subtle differences in Automated Market Makers (AMMs) can provide significant advantages to LST protocols — especially considering how LSTs gain value over time from the yield of underlying staked ETH. This intrinsic value-growth dictates that LPs will need to more closely monitor their positions to keep their liquidity active as prices move. Pairing with an AMM that can maximize LP capital efficiency for an LST pair, as an example, can provide significant benefit.\n\nI anticipate increased innovation from DEXs, specifically around the functionality of AMMs. To win the Liquid Staking Wars, protocols will need a set of tools to incentivize the liquidity of their liquid staking tokens using minimal incentives and maximum efficiency. Protocols that can boost LP incentives through this type of “surgical incentivization” and provide greater capital efficiency will ease the capital requirement burden from LSTs. This will in turn enable the LSTs to maximize their return on incentives, and capture a greater market share.\n\nFor stakers and LPs, it’s essential to understand the financials (fees, etc.) before they stake or provide liquidity on a particular platform. As mentioned, due to the unique return structure of LSTs, some existing AMMs are not capital efficient for LST liquidity. This is because LSTs and the unique liquidity challenges they represent did not exist when these AMMs were developed.\n\nFor instance, infinite-range AMMs like Sushi, Balancer, and Uniswap v2 are known to have low efficiency for almost any pair. But even Range AMMs like Uniswap v3 and related forks can have a low efficiency for an ETH-LST pair, because the price in the AMM will continuously exceed the LP’s range unless the LP actively manages their position or stakes a very wide price range. In addition to the incentives offered, LPs must be aware of these crucial structural details of the protocols before they deploy their capital.\n\nEven though I am calling this next phase in DeFi after Shanghai a “war,” what it’s ultimately leading to is more liquidity injected into the ecosystem. And with greater capital efficiency in liquidity pools ushering in an era of more “active capital,” these volumes will be more consistently utilized to the benefit of the entire industry.\n\nBob Baxley is a technologist, entrepreneur, and builder of technology companies. Bob is the core builder at Maverick Protocol, a new infrastructure for decentralized finance built to facilitate the most liquid markets for traders, liquidity providers, DAO treasuries, and developers. Bob designed Maverick AMM, a revolutionary Dynamic Distribution AMM that provides greater capital efficiency and control for liquidity providers.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vYnJhdmVuZXdjb2luLmNvbS9pbnNpZ2h0cy93aGF0LWlzLXRoZS1ldGhlcmV1bS1zaGFuZ2hhaS11cGdyYWRl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "What Is The Ethereum Shanghai Upgrade? - Brave New Coin Insights",
        "content": "What Is The Ethereum Shanghai Upgrade?\n\nEthereum is the 2nd largest digital asset and the largest platform blockchain in the world. It is set to undergo its first major network upgrade since the ‘Merge’ in 2022. So what is the Shanghai Upgrade and what does it mean for the ETH price?\n\nThe latest Ethereum fork date has been confirmed for April 12th, 2023. Called the Shanghai upgrade it is the first major Ethereum upgrade since the Merge in September 2022.\n\nThe Ethereum foundation stated that the Merge was ‘the most significant upgrade in the history of Ethereum.’ The Merge witnessed the joining together or ‘merging’ of the execution layer with a consensus layer called the Beacon chain that had been running separately until then. The Beacon chain uses a Proof-of-Stake (PoS) consensus model that replaced the Proof-of-Work (PoW) model that the mainnet previously used.\n\nWhat Is The Shanghai Upgrade?\n\nThe ETH Shanghai upgrade via Ethereum Improvement Proposal-4895 enables the withdrawal of staking rewards that were earned by participating in Ethereum Proof-of-Stake Consensus. Users will also be able to exit staking entirely and unlock their full validator balance. The Shanghai upgrade is affecting execution clients and this ETH fork is occurring in parallel with consensus client upgrade Capella.\n\nTogether, these updates are commonly referred to as \"Shapella\". Versions of the Upgrades on the Sepolia and Georli testnets are now complete and the functionality of ETH staking withdrawal has been clearly defined. The mainnet upgrade is now ready and is ETH fork date is set for April 12th.\n\nShapella is the first simultaneous upgrade of Ethereum’s execution and consensus layers.\n\nHow Does ETH staking work?\n\nPost-Merge Ethereum operates as a single blockchain with two layers. The execution layer is where Ethereum transactions are processed and then broadcast to the rest of the network and the consensus layer manages transaction settlement and finality via the proof-of-stake consensus model.\n\nEthereum staking refers to participation in Ethereum’s transaction validation. Users lock-in, or ‘stake’ their ETH tokens on the blockchain in order to earn transaction validation opportunities that secure the network in exchange for rewards.\n\nThe key outcome of Shapella will be to allow the ETH validators who manage proof-of-stake consensus to shift their balances, currently locked on the consensus layer, to an execution layer address. This is simply an address that any everyday user of the Ethereum network is familiar with. This means validators will finally be able to unstake their ETH and staking rewards.\n\nPerhaps the most significant impact of the Shanghai upgrade will be that it will the first time in recent history when the entire ETH staking community will be able to change how, who, and where they stake their Ethereum.\n\nEthereum functions as a decentralized network of validators who collectively secure and push forward the blockchain. Ethereum underpins a broader social community and stakers can use their stake to essentially vote on what network consensus will look like. If more stakers prefer assigning their stakes to a large institutional custodian then Ethereum will be less democratic than a consensus with a majority of independent stakers.\n\nStaking on Ethereum can occur in many ways including —\n\nSolo staking and running independently\n\nUsing a non-custodial staking service like Consensys Staking\n\nUsing a liquid staking service like LIDO\n\nSo far, because ETH staking withdrawals have not been available, Ethereum holders have been constrained in how they stake and signal their values. The Capella upgrade will offer an opportunity for stakers to vote with their stake. This may mean withdrawing their previously locked stakes and liquidating or shifting their stake to a staking method that more aligns with their values.\n\nNew Features —\n\nCapella delivers the ability to update the withdrawal credentials of an Ethereum validator from the older 0x00-type (derived from a BLS key), to the newer 0x01-type (derived from an Ethereum address).\n\nIt will allow for partial withdrawals, or the periodic and automatic “skimming” of earned, consensus layer rewards from an active validator’s balance (that has more than 32 ETH).\n\nIt will enable full withdrawals, or the reclaiming of an “exited” validator’s entire balance.\n\nEthereum Upgrade – What Do The Charts Say?\n\nAs the chart above shows, there has been a significant drop in the amount of Ethereum on centralized exchanges since May 2020. In general, a lower amount of a digital asset on an exchange, compared to those held in self-custody, is a bullish signal. More Ether on exchanges means a higher likelihood of incoming selling pressure. This suggests that the selling pressure emerging from Shanghai staking unlocks may be less intense.\n\nLiquid staking protocol Lido dominates the ETH staking ecosystem. Liquid staking is popular because it addresses the main drawback of staking—long lock-ups. When users deposit their ETH for staking through a liquid staking protocol, they receive back a tokenized version of the asset they deposit 1:1, with Lido ETH staking this asset is called stETH.\n\nOver time, if the user chooses to continue staking, the stETH position will continue to get larger but the user can withdraw and sell their stETH at any time without having to wait for a cool down or unlock period as a validator would.\n\n31.2% of all Ethereum staked is currently staked using Lido, 22.4% is staked unidentified (individual), 12.6% is staked with Coinbase, 6.8% is staked with Kraken and 5.7% is staked with Binance.\n\nIn a comment sent to Brave New Coin Ilya Volkov, CEO and co-founder of YouHodler, a Swiss-based international fintech platform providing a variety of Web3 crypto and fiat services, offered insights into why the market share of centralized exchanges offering staking services has slid. “Centralized exchanges are no longer able to offer staking services in the U.S. So, ETH will be withdrawn from these exchanges and staked elsewhere (e.g decentralized staking services). At the moment, the SEC cannot prevent users from staking ETH tokens via an individual node or via decentralized staking services.” Volkov says.\n\nWith Shapella, the number of node operators and types of validators can be accommodated by Lido. Following Shapella, Lido is set to introduce a staking router and a modular infrastructure. This will mean staking deposits will be spread to a much more diverse set of validators and Lido will have more diversity and security in how it manages user’s stakes.\n\nFollowing Shapella, users of Lido will be able to withdraw ETH 1-for-1 directly from Lido. More information on the changes Lido will make to its protocol Shapella can be found here.\n\nThe Ethereum Price Leading Into Shanghai Fork\n\nIn the lead-up to the Shanghai upgrade, the price of Ethereum has soared. The asset is up ~28.9% in the last 30 days. The strong performance may not be driven purely by the excitement around the Shanghai hard fork, though, given the strong performance of other large-cap digital assets. In fact, Ethereum is actually lagging as in the last 30 days the Bitcoin price (BTC) is up ~42.8% and the XRP price is up ~39.8%.\n\nThe correlation between ETH and BTC is also high and has been historically high. This suggests that either the same factors drive the price of both assets or one asset leads the other. BTC’s strong performance in the last month has been driven by its position as the ‘highest beta monetary irresponsibility hedge.’ Bitcoin has enjoyed excellent momentum as traditional financial markets have stuttered in recent months.\n\nYears of excessive money printing and low-interest rates that are now being reversed are creating chaos throughout global credit markets. Additionally, the government backstopping of a number of American banks and notable Swiss bank Credit Suisse has created concerns about the stability of global financial markets.\n\nGold has soared and continues to establish new all-time highs. Safe havens like the US dollar and Treasury bills have been affected by the chaotic interest rates – increasing the appeal of assets like BTC, gold, and silver.\n\nThe price of ETH and other digital assets maybe be benefiting from their close macro connection to BTC. They don’t have the same ‘flight to quality’ digital gold narrative that Bitcoin has – but are rising because of osmosis.\n\nThe Ethereum Price After The Shanghai Upgrade\n\nThere are some concerns that the large unlock of staked Ether will lead to a wave of selling pressure as stakers can finally regain liquidity, but some observers say the unlocked ETH liquidity will be swept up by new demand to stake. There is also a view that ETH staking will increase post-Shanghai, given the new flexibility offered to stakers.\n\nAt YouHodler, Volkov tells Brave New Coin that he expects volatility around the time of the Shanghai fork because of factors like the potential failure of the upgrade to implement on time.\n\nHe also points to a futures market where there has not been a significant increase in the number of short orders for ETH placed. This suggests that this market is unclear on whether Shapella will be a bullish or bearish event. Check here for more on what futures data tells us about where the smart money sees price going.\n\nDespite being the most staked asset in crypto, the ratio of staked ETH is just 15.64% of the total ETH supply according to stakingrewards.com. This compares poorly to the ratio of staked assets on other major proof-of-stake chains like BNB-chain, Cardano, and Solana, all of which have ratios of staked assets sitting above 70%.\n\nThis suggests that the adoption of Ethereum staking has been slow and that so far at least, the inability of validators to unstake has held up the adoption of Ethereum staking.\n\nConclusion\n\nThe upcoming Shanghai upgrade represents a significant milestone in the development of Ethereum consensus and the broader cryptocurrency market. With the ability for ETH validators to finally unstake their tokens and withdraw their rewards, there is likely to be a significant shift in how staking functions on Ethereum. Ethereum validators will finally be able to vote with their stake and will be able to shift to their preferred type of consensus participation.\n\nWhile there are concerns about potential selling pressure following the unlock, the strong performance of ETH and other digital assets leading up to the upgrade suggests that a bullish wider crypto market may outstrip any increased selling pressure.\n\nThe impact of the Shanghai upgrade on the cryptocurrency market remains to be seen, but it is clear that Ethereum continues to play a significant role in the development of Web 3.0 and the future of decentralized finance."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vdWsuZmluYW5jZS55YWhvby5jb20vbmV3cy9ldGhlcmV1bS1zaGFuZ2hhaS11cGdyYWRlLWJpdGNvaW4tY3J5cHRvLTA1MDAyMTE3Mi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Ethereum's Shanghai Upgrade: Here's what you need to know - Yahoo Finance UK",
        "content": "The upcoming Shanghai upgrade will mark Ethereum's complete transition to a proof of stake network. Photo: Getty (Dennis Diatel Photography via Getty Images)\n\nThe Ethereum blockchain's Shanghai upgrade is about to be launched, unlocking more than 18 million ether, worth around $34bn (£27.3bn).\n\nYahoo Finance UK spoke to industry experts about the effect that the increase could have on the crypto market.\n\nThe value of ether (ETH-USD) has been rising since November 2022, after the collapse of the FTX cryptocurrency exchange.\n\nOn Tuesday, ether rose 6.1% to $1,920. Bitcoin (BTC-USD) breached the $30,000 mark, rising to $30,129.\n\nEthereum's Shanghai upgrade\n\nEthereum's Shanghai upgrade is set to launch on 12 April, and will conclude Ethereum's transition to a 'proof of stake' blockchain, making it over 99% less energy intensive than the 'proof of work' blockchain which powers the Bitcoin network.\n\nADVERTISEMENT\n\nThe new upgrade will make over 18 million ether, worth about $34bn, available for withdrawal. This has led to fears of a sudden dump of supply on the market, causing a short term haemorrhaging in price.\n\nJim McDonald, CTO of London staking firm Attestant, told Fortune: \"The price of Ethereum is expected to dip sharply right after Shanghai as about 50% to 70% of early withdrawers cash out as the price of ETH has more than quadrupled since December, and there are profits to be had,\"\n\nHowever, some analysts forecast that the short-term price impact may be more muted as withdrawal queue restrictions and 'stakers' holding their ether could prevent a sharp price dip.\n\nEthereum 'stakers', those who currently have their ether locked in the blockchain's validation process, will need to wait for a period ranging from days to months to access their ether. This depends on whether they staked individually or through pools and service providers.\n\nRead more: Crypto live prices\n\nCEO of P2P.org Alex Esin told Yahoo Finance UK: \"We don’t think it’s likely many ether 'stakers' will rush and are not expecting to see a massive withdrawal spike.\n\n\"This is because many who have already staked on the Beacon Chain have a high-risk tolerance and are not holding out for the withdrawal date, those who may need to withdraw for other reasons will need to weigh this up against the growth expected from the Ethereum ecosystem and ETH strength expected over the next year.\n\nStory continues\n\n\"From a price perspective, we expect to see upward pressure as more people who previously were not comfortable locking away their ETH begin to participate in staking. As the ETH staking ratio increases, more ETH will be removed from the market pushing the price higher.”\n\nOther analysts say that Shanghai could make Ethereum more attractive for long-term investors and increase competition in crypto custody, as major banks show growing interest in the sector.\n\nRead more: Ethereum soars 8% – closes in on $2k ahead of Shanghai upgrade\n\nGuilhem Chaumont, co-founder of Flowdesk, said that the Ethereum Shanghai upgrade is a key de-risking event that may attract more institutional players to participate in staking or offer related services to clients.\n\nHe said: “Given the recent turmoil in the banking sector, there may be demand from institutional and retail investors looking for alternative assets to invest in and we may see a greater volume and engagement with the ecosystem post-Shanghai upgrade.\n\n\"For institutions in particular, Shanghai presents a key de-risking event. Prior to the upgrade, financial institutions looking to offer staking services may have been hindered due to the fact that they were locking up funds for a potentially indefinite period of time. Now that withdrawals are being enabled we may see more of these institutional players participating in staking or offering services to their clients.\"\n\nPotential risks of the Shanghai upgrade\n\nValerie Tetu, head of go-to-market strategy at Lido Finance, emphasised the need for strict security due diligence and testing to mitigate potential smart contract risks during and after the Shanghai upgrade.\n\nShe said: \"Staking withdrawals enabled by the Shanghai upgrade represent a significant milestone in the development of the Ethereum blockchain. Withdrawals will allow stakers to participate in securing the network with more confidence while increasing the capital efficiency of the tokens they decide to allocate.\n\n\"While the upgrade is well-positioned to drive more staking activity and participation, potential smart contract risks need to be considered and mitigated. All ecosystem stakeholders have the responsibility to commit to strict security due diligence standards and testing.\"\n\nWhat is Ethereum's Shanghai Upgrade?\n\nThe upcoming Shanghai upgrade follows Ethereum's previous 'merge' upgrade in September and will mark its complete transition to a proof of stake network.\n\nRead more: Germany considers following Italy in banning ChatGPT\n\nThe upgrade will reduce Ethereum's energy consumption by 99.9%.\n\nThe Shanghai upgrade will allow ether 'stakers' to withdraw their staked ETH for the first time.\n\nStaking involves earning financial rewards for contributing to the blockchain's network and supporting its functionality.\n\nWatch: Philip Hammond on CBDCs, stablecoins and crypto's place in global finance | The Crypto Mile\n\nDownload the Yahoo Finance app, available for Apple and Android."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1wcmljZS1yZXRlc3RzLWtleS1zdXBwb3J0LWxldmVsLXRoYXQtcHJlY2VkZWQtNjAtZ2FpbnMtaW4tanVuZS0yMDIy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Ethereum price retests key support level that preceded 60% gains in June 2022 - Cointelegraph",
        "content": "Ethereum’s Ether (ETH) token continued its losing streak versus Bitcoin (BTC) for the fifth day in a row as BTC’s price jumped above $30,000 for the first time since June 2022.\n\nETH/BTC bullish reversal fails midway\n\nOn April 11, the ETH/BTC pair dropped nearly 1.6% to 0.0634 BTC to retest multi-month lows.\n\nETH/BTC daily price chart. Source: TradingView\n\nThe ETH/BTC level is down 6.75% from its local peak of 0.0679 BTC set six days ago. It is also just 2% above the pair’s local low of 0.0622 BTC from March 20, showing that Ether’s bullish reversal attempt versus Bitcoin is near failure.\n\nInterestingly, institutional interest also appears to gravitate more toward Bitcoin than Ethereum, according to CoinShares’ weekly report. It shows that the Bitcoin-focused investment funds witnessed inflows worth $56 million in the week ending April 7.\n\nNet flows into crypto funds in the week ending April 7. Source: CoinShares\n\nIn comparison, the Ethereum-based funds received only $600,000 despite the hype around its long-awaited Shanghai hard fork on April 12.\n\nAnother ETH price rebound attempt ahead?\n\nETH/BTC’s ongoing decline has prompted it to retest its multi-month ascending trendline support (buy zone) near 0.0635 BTC for a potential price rebound toward its descending trendline resistance (sell zone) near 0.0750 BTC.\n\nIn other words, it will have been a 16.5% price rally by June, as covered in previous analysis.\n\nETH/BTC three-day price chart. Source: TradingView\n\nThe bullish reversal outlook takes cues from ETH/BTC’s price rebound in July 2022 after testing the same ascending trendline as support. Notably, the pair rose by about 60% to reach the descending trendline resistance near 0.0856 BTC.\n\nRelated: 3 reasons why Ethereum price can reach $3K in Q2\n\nConversely, a decisive break below the ascending trendline support would raise ETH/BTC’s possibility to eye its 200-week exponential moving average (200-week EMA; the blue wave) near 0.0563 BTC, down about 10% from current price levels.\n\nETH/BTC weekly price chart. Source: TradingView\n\nLike the ascending trendline support, the 200-week EMA was instrumental in stopping Ether’s price decline versus Bitcoin in July 2022. This makes it the most probable downside target in the coming months.\n\nMagazine: ‘Account abstraction’ supercharges Ethereum wallets: Dummies guide\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vZGVjcnlwdC5jby8xMjU4NTkvZXRoZXJldW0tc2hhbmdoYWktdXBncmFkZS1wcmljZS1ldGjSAUNodHRwczovL2RlY3J5cHQuY28vMTI1ODU5L2V0aGVyZXVtLXNoYW5naGFpLXVwZ3JhZGUtcHJpY2UtZXRoP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "How the Ethereum Shanghai Upgrade Could Impact the Price of ETH - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum will conclude its two-year transition to proof of stake this week with the launch of the Shanghai upgrade on April 12. The move will introduce a number of technical improvements to the network, but most Ethereum traders only care about one thing: staking withdrawals.\n\nWith more than 18 million ETH—worth roughly $34 billion—locked up on the Ethereum network set to finally become available to validators, investors are understandably uneasy about what this might mean for the price of the second-largest cryptocurrency by market cap.\n\nAndrew Thurman, a data analyst at Nansen, told Decrypt that in his view price impact in the short-term, however, will be “a little bit more muted” than community expectations suggest.\n\nAD\n\nAD\n\nAlso known by its consensus name Capella, Shanghai ends the two-year lockup period on staked ETH and its corresponding rewards. If all goes well, Ethereum stakers will be able to begin sending withdrawal requests to the network immediately after Shanghai goes live—but that doesn’t mean users will receive the funds on day one. Because of the anticipated length of the withdrawal queue, holders may have to wait weeks to months to retrieve their assets.\n\n“With many speculating whether this event will cause a massive sell-off in price, it’s important to realize that the withdrawal queue only allows a limited set of requests per day (115,200),” Guilhem Chaumont, CEO and co-founder of Flowdesk, said in a statement shared with Decrypt. “So while there may be sustained downward pressure on the price, unstaking is not likely to cause a sharp, sudden dip.”\n\nIndividual stakers, those who were able to pony up at least 32 ETH (worth approximately $60,000 at today’s prices) themselves, can expect to wait at least two to three days to have withdrawal requests processed, Ethereum developers previously explained to Decrypt. Those staking through pools and other service providers, such as Lido or crypto exchanges like Coinbase, may have to wait several weeks or even months to withdraw their funds.\n\nAnd besides the wait times, others point out that the availability of liquid staking services such as Lido means that traders who have wanted the ability to trade staked ETH have been able to do so even before Shanghai.\n\n“Most people have been able to sell [staked ETH] for quite some time, because the majority of ETH is being staked through platforms with liquid staking tokens, like Lido or Rocket Pool,” Jacob Cantele, head of product at Ethereum layer-2 Mantle, previously told Decrypt. “So I don't actually think [Shanghai] represents a major shift in the economics of Ethereum.”\n\nAD\n\nAD\n\nMatthew Niemerg, co-founder of privacy-enhancing blockchain network Aleph Zero, concurs: “To be more direct, it's priced in,” he said.\n\n“It is entirely possible that there will be more people willing to stake ETH (locking up liquidity and reducing the available supply) after the upgrade, as people will be more certain that they can safely unstake their ETH,\" said Niemerg.\n\nNansen’s Thurman believes that while the short-term price action may be lackluster, Shanghai may give Ethereum investors reason to be more bullish in the long term.\n\n“It's gonna take a while for people to really understand what the dynamics are regarding whether or not this is a bullish or bearish action in the short to medium term,” he said. “I will say, though, that on a long enough time horizon, it's really difficult to come up with a thesis that isn't wildly bullish.”\n\nThurman argues that the reason for this is the enhanced business use-case for crypto custody. In recent years, major banks including JPMorgan Chase, Standard Chartered, and CACEIS have increasingly shown interest in cryptocurrency custody, a service which refers to the safekeeping and management of securities or financial assets on behalf of consumer clients.\n\n“Custody is going to get much more competitive,” Thurman told Decrypt, “because suddenly you can custody ETH as a bank, or as one of these solutions, for low to no fees. I think that’s going to lead to a lot of locked up [ETH]. And of course, that's going to be great for the price in the long run,” he said.\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wNC8xMS9ldGhlcmV1bXMtc2hhbmdoYWktdXBncmFkZS13aWxsLXBlcm1hbmVudGx5LWFsdGVyLWV0aC1lY29ub21pY3Mv0gF7aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDIzLzA0LzExL2V0aGVyZXVtcy1zaGFuZ2hhaS11cGdyYWRlLXdpbGwtcGVybWFuZW50bHktYWx0ZXItZXRoLWVjb25vbWljcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Ethereum’s Shanghai Upgrade Will Permanently Alter ETH Economics - CoinDesk",
        "content": "Furthermore, as reported by Santiment, nearly 90% of all supply of ETH is in self-custody. Holders of crypto have been increasingly moving towards self-custody since September 2022. When the FTX exchange collapsed in November the trend accelerated, leading to a massive drop in ETH supplies on exchanges. This reduces immediate sell pressure as capital moves to the sidelines, and future sell-offs are expected to be limited."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zaGFwZWxsYS1jb3VsZC1icmluZy1pbnN0aXR1dGlvbmFsLWludmVzdG9ycy10by1ldGhlcmV1bS1kZXNwaXRlLXJpc2tz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Shapella could bring institutional investors to Ethereum despite risks - Cointelegraph",
        "content": "Ethereum’s Shanghai/Capella upgrade — also known by the portmanteau Shapella — may not be the technical marvel of last year’s “Merge” or introduce turbocharged speeds to the network.\n\nVolumes of over 100,000 transactions per second will have to wait for future “danksharding” upgrades, according to the Ethereum Foundation.\n\nBut the hard fork remains an important step on Ethereum’s roadmap to the future, i.e., further shoring up the network’s new validation mechanism while (potentially) removing barriers for institutional investors.\n\nCurrently scheduled for 10:27 pm UTC on April 12, the upgrade will allow stakers to unlock their Ether (ETH) rewards — or even exit staking entirely — for the first time since September’s Merge.\n\nIt's happening\n\n\n\nShapella is scheduled on mainnet for epoch 194048, scheduled for 22:27:35 UTC on Apr. 12, 2023\n\n\n\nClient releases compatible with the upgrade are listed in the announcement below https://t.co/I0hSv9lnjz — timbeiko.eth ☀️ (@TimBeiko) March 28, 2023\n\nPre-fork publicity hasn’t matched that surrounding last autumn’s change of consensus mechanisms from proof-of-work to a proof-of-stake (PoS). “This time, we won’t have a war room,” Freddy Zwanzger, Ethereum ecosystem lead at Blockdaemon, told Cointelegraph. Still, “there’s always risks” when one reshuffles the deck like this.\n\nEthereum’s stakers and validators will shortly be able to withdraw $32 billion of Ether from the Beacon Chain, which accounts for about 15% of the ETH’s circulating supply, according to Coinbase’s April 5 newsletter. Some worry that the upgrade, also known as the Shanghai hard fork, may lower the overall number of validators and put selling pressure on the network, among other concerns.\n\n“Every hard fork brings some upgrade risk,” Paul Brody, EY’s global blockchain leader, told Cointelegraph, especially in cases like this where you’re enabling withdrawals. On the technical side, there could be bugs latent since “day zero” in some of the network’s staking smart contracts, for example, that may not emerge until the withdrawal date — though Brody doesn’t think that’s likely.\n\nThe upgrade should mitigate risks for investors. “Lower volatility plus a yield makes for a more familiar and less risky asset to hold long-term,” Rich Rosenblum, co-founder and president at GSR, a crypto market-making firm, told Cointelegraph.\n\nMore institutional investors?\n\nWill Shapella really attract more institutional investors to the blockchain, as some believe? Research and brokerage firm AB Bernstein stated in a late-February research report that the upgrade could bring in staking from new institutional investors, and Blockdaemon’s Zwanzger, whose firm has many institutional clients, foresees more interest in Ethereum staking opportunities from large professional investors. Some institutional investors have been reluctant to lock up funds without a clear withdrawal option.\n\n“There’s probably going to be a queue for the first couple of weeks,” Zwanzger said. “So they might be better off waiting until that comes down to normal levels.”\n\nAccording to Rosenblum, “Once the PoS network is fully operational, more institutions will feel comfortable holding ETH, especially once the staking yield becomes more accessible.”\n\nEY’s Brody, on the other hand, doesn’t see much of a change. “A lot of the big institutional investors that we know and work with are basically sitting on the sidelines. They want to comply, but they want to be more comfortable that they know what the rules are.” Comprehensive crypto reform legislation in the United States would probably be more likely to get them off the sidelines.\n\nLonger-term risks\n\nSo what about regulatory risk, particularly in the United States? For years Bitcoin (BTC) and Ether were thought to be impervious to Securities and Exchange Commission (SEC) scrutiny, with many U.S. regulators tacitly agreeing that the native coins for decentralized systems like these were more like commodities than securities, placing them under the Commodity Futures Trading Commission’s jurisdiction. But with Ethereum’s move to a staking validation mechanism, some think the SEC may now have Ethereum in its sights.\n\nStill, “I wouldn’t consider it a significant risk for the network,” even if that happens, said Zwanzger. The Ethereum protocol is global, and not all jurisdictions will likely share the SEC’s view of what needs regulating. Of course, other countries could ultimately choose to follow the U.S., so one never knows.\n\nOthers worry that Ethereum’s move to staking may herald increasing network centralization. In March, Cointelegraph reported that “concentration of ETH staked through third parties raises concerns over decentralization at Lido and Coinbase in particular.”\n\nRecent: Crypto audits and bug bounties are broken: Here’s how to fix them\n\n“The battle to keep Ethereum sufficiently and properly decentralized is probably one of the most important ones out there in terms of governance and organization,” Brody told Cointelegraph. If any single staking partner were to have 33% of the ecosystem, that “could potentially — and I say potentially — have an impact on transaction finality, although you would get slashed for doing so.” If any single or cooperating group of entities controlled two-thirds of the staking infrastructure, “you would have the potential to change the governance of the chain” — something that would be “very suboptimal,” he said.\n\nBut these dangers remain largely theoretical given how things have evolved since the Merge. “A relatively vibrant staking ecosystem” has emerged, said Brody, with “a few highly centralized custodial players” but also “some semi-centralized custodial players” like Lido, which is a liquid staking pool leader that invests with funds from tens of thousands of individual crypto wallets. There are also prominent staking groups that are “trying to be more fully decentralized,” like the Rocket Pool, he added.\n\n“As long as this remains a very competitive ecosystem,” dangers from centralization are unlikely, Brody continued. Moreover, as more enterprise users join the network and become de facto stakeholders, including “Fortune 1000” companies, the system “becomes quite heavily decentralized.”\n\nZwangzer said that centralization was more of a threat in the pre-Merge days when a few proof-of-work pools dominated ETH mining. In any event, he added:\n\n“I don’t think this is going to become a problem as long as we can keep the centralized [cryptocurrency] exchanges at bay.”\n\n“The golden age of digital monopolies”\n\nOne might wonder why decentralized digital networks are even important for commerce and society. Cointelegraph posed this question to EY’s Brody, who believes that public blockchains, especially Ethereum’s, “are going to be the big global winners,” with the caveat that public blockchains will first need to be “privacy-enabled.”\n\nDecentralized blockchain-based networks simply offer the world’s best hope to develop monopoly-resistant global digital marketplaces, he said. “We live in the golden age of digital monopolies” like Amazon, Google and Facebook, mainly because that is simply the nature of networks. According to Metcalfe’s Law, as a network grows, its value increases exponentially. The first to market has a good chance to dominate.\n\nBut monopolies come at a social and economic cost. New York University finance professor Thomas Philippon has estimated that monopolies cost the median American family $300 a month, and the inefficiencies they entail “deprives American workers of about $1.25 trillion of labor income.” According to Brody, “If we want to fully digitize the economy, and we want to do it without digital monopolies, we should be doing it on public decentralized systems.”\n\nIn recent years, EY Global has been devoting significant resources to “industrializing blockchain privacy technology” through its Starlight project, a zero-knowledge proof compiler that enables secure, private business logic on the public Ethereum blockchain. The project is still in beta, but developers can now experiment with building privacy-enabled features for solidity smart contracts. The goal is to enable blockchain-based business agreements where business logic is shared at the network level, but privacy from potential competitors is still preserved.\n\nThis last point is critical. In the business world, no company wants another firm to know its commercial secrets, after all. A pharmaceutical manufacturer, for instance, may want to track its medicine packets through its supply chain, beginning with the drug’s raw materials, through to distributors and hospitals.\n\nEach packet can be attached to a nonfungible token recorded on a public blockchain. The pharma firm may also want to attach some business agreements as well. For example, a distributor selling one million units of the manufacturer’s drug could trigger an automatic rebate payment to the distributor via a smart contract. But the pharma firm doesn’t want the whole world to know about this rebate agreement.\n\n“We are starting to build a blockchain-based inventory management system that’s going to use privacy technology to manage those individual tokens,” said Brody. It’s starting on a private chain, but they “are building it with privacy technology because they want to go on to the public chain so that anybody can join with them using these standards.” Brody added:\n\n“So essentially, you’ll be able to take an entire business contract and supply chain operations and run it under privacy on public Ethereum at a cost-effective level.”\n\nTasks like tracking products and attaching business agreements to digital ledgers may seem mundane, but their economic impact could be huge. “Somewhere between 2 and 5% of all the money on earth in corporations is spent administering stuff, keeping track of it, moving it around,” said Brody. “By using smart contracts and tokenized assets, we could drive that down dramatically.”\n\nFeature: The state of the Bitcoin Lightning Network in 2023\n\nAll of this brings us back to Shapella and why such upgrades matter. A trouble-free launch would be further evidence that Ethereum is still on course to achieve the three key goals laid out in the Ethereum Foundation’s roadmap: scalability, security and sustainability. Or as Blockdaemon’s Zwanzger told Cointelegraph:\n\n“It also will reinforce the confidence in the network and in the protocol design so that a developer launching a project can be sure that, for example, gas fees and scalability will not be a big problem over the next one or two years.”"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA0LzEyL2V0aGVyZXVtcy1zaGFuZ2hhaS11cGdyYWRlLW9ubHktYS1zbWFsbC1zdGVwLWZvcndhcmQtYmFuay1vZi1hbWVyaWNhL9IBdmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA0LzEyL2V0aGVyZXVtcy1zaGFuZ2hhaS11cGdyYWRlLW9ubHktYS1zbWFsbC1zdGVwLWZvcndhcmQtYmFuay1vZi1hbWVyaWNhL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Ethereum’s Shanghai Upgrade Only a Small Step Forward: Bank of America - CoinDesk",
        "content": "The main concern around the Shanghai liquidity event is that validators could withdraw and sell staked ether (ETH), which makes up 16% of the total ETH supply, but the withdrawal process is designed to “prevent a short-term mass exodus of validators and the resulting security risks,” the note added."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS12YWxpZGF0b3ItY2FzaGVzLWluLTY4OS1ldGgtZnJvbS1tZXYtYm9vc3QtcmVsYXnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Ethereum validator cashes in 689 ETH from MEV-Boost relay - Cointelegraph",
        "content": "A 689 Ether (ETH) reward worth $1.28 million has been paid from a single Maximal Extractable Value (MEV)-boost relay block on the Ethereum Beacon Chain in one of the largest rewards in recent months.\n\nEthereum liquid staking solution Lido was paid the reward from block number 17007842 on the Beacon Chain, which was finalized on April 9, containing 47 transactions, and built by beaverbuild.org, according to transaction data.\n\nHigh Proposer Payment Alert!\n\nValidator 0x388c... received 689.02 ETH.\n\nBlock built by a @beaverbuild builder (0x96a59d...)‍\n\nSlot: 6,181,978.\n\nReceived through the @GnosisDAO relay.https://t.co/Pv3bqfZMrU — MEV-Boost Bot (@mevproposerbot) April 9, 2023\n\nThe reward almost matched Lido’s most recent high of 691 Ether on March 20.\n\nThe figure raised the eyebrows of Martin Köppelmann, the co-founder and CEO of Ethereum-based infrastructure platform Gnosis, who suggested Ethereum users should use a service like MEV Blocker to prevent their transactions from being exploited.\n\nMore than 90% of the MEV currently being paid to validators could go to users if all users or wallets would use services like https://t.co/ijeJy3LwBl https://t.co/DHlp6tUz7J — Martin Köppelmann (@koeppelmann) April 9, 2023\n\nAccording to MEV Blocker, MEV bots have extracted more than $1.38 billion from Ethereum users attempting to trade, provide liquidity and mint nonfungible tokens (NFTs).\n\nThese centralized MEV-boost relays are able to extract value by aggregating blocks from multiple builders to select the one with the highest fees.\n\nOne of the most common MEV exploits is the “sandwich” attack, which occurs when an attacker places a large trade on either side of a target’s transaction, manipulating the price and profiting from the price change.\n\nRelated: ETH staking on top exchanges contributes to Ethereum censorship: Data\n\nMEV-boost relays stem from the concept of proposer-builder separation, which was introduced by the Ethereum research organization Flashbots in 2021 in the lead-up to Ethereum’s transition to proof-of-stake in September 2022.\n\nSeparating the role of proposers from block builders is intended to promote more competition at the consensus level, further decentralize the Ethereum network and strengthen censorship resistance.\n\nHowever, Ethereum has encountered several censorship issues since the Merge took place, namely compliance with standards laid down by the Office of Foreign Assets Control (OFAC), although the number of compliant blocks has since fallen.\n\nThere are currently 10 active relays, with Flashbots responsible for relaying more than 50% of the MEV-boost blocks since MEV was introduced in 2021, according to MEVBoost.org.\n\nMagazine: Unstablecoins: Depegging, bank runs and other risks loom"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDQvMTAvZXRoZXItY2FwaXRhbC1jZW8tc2hhbmdoYWktdXBncmFkZS1saWtlbHktdG8tYmUtYS1ub24tZXZlbnQtb24tZXRocy1wcmljZS_SAXdodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA0LzEwL2V0aGVyLWNhcGl0YWwtY2VvLXNoYW5naGFpLXVwZ3JhZGUtbGlrZWx5LXRvLWJlLWEtbm9uLWV2ZW50LW9uLWV0aHMtcHJpY2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Ether Capital CEO: Shanghai Upgrade Likely to Be 'Nonevent' on ETH's Price - CoinDesk",
        "content": "The Shapella upgrade is considered to be the network’s final shift towards fully implementing its proof-of-stake consensus mechanism. Besides giving users the ability to make withdrawals from the ETH they have staked, the upgrade will lower fees and create more room on the blockchain to handle transactions."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiMWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL21ldi10aGUtcmVsYXlzLXByb2JsZW3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Dissecting MEV: The Problem of Relays - Blockworks",
        "content": "Ethereum is built on the principles of decentralization, trustlessness and free market competition. So it might be surprising to learn that an important mechanism in the protocol’s ecosystem is centralized, must be trusted and offers no economic incentive.\n\nRelays perform a key role in the infrastructure that supports MEV — or maximum extractable value — on Ethereum. Existing between builders and validators as middlemen, relays absorb large amounts of traffic from builders by only sending select blocks to validators.\n\nThe problem, as Matt Cutler, CEO and co-founder of Blocknative, explained on the Bell Curve podcast, is threefold: Few relays exist, they must be trusted, and they do not currently offer profitability to relay providers.\n\n“At the moment, there are 11 relays that power the Ethereum network,” Cutler says. “But only seven of them have more than 1% share [of the market].”\n\n“It’s pretty centralized, more centralized than any of us would like.”\n\nOn top of that, the MEV-Boost network is highly dependent on these few relays. “Without the relays, the network doesn’t operate, meaning that the MEV-Boost network is entirely dependent on them. They require 100% uptime because if they don’t do their job, you have missed slots.”\n\nCutler points out one crucial problem: “There’s absolutely no economic incentives for operating the relays.” Although the role carries costs and risk, it offers nothing in return.\n\n“And in fact, if your relay doesn’t do its job or there’s some misconfiguration and you miss slots, the validators often expect reimbursement. So they have negative economics.”\n\n“The economics of it kind of suck today,” host Michael Ippolito agrees.\n\nRead more: MEV: Who Should Profit From a Protocol’s Economic Activity?\n\nBoosting relay participation\n\n“One of the things we’re trying to do,” says Cutler, “is encourage more teams to participate as relays and to develop their own relays to encourage relay diversity.”\n\nCutler argues that relays offer “tremendous value to the entire network.” MEV-Boost uses block space more efficiently, increases the base fee burn, and pays validators significantly more, boosting the security budget.\n\n“And so there’s a huge amount of benefit that is driven specifically by the work of the relays and the rest of the supply chain and yet none of that value is today shared with those infrastructure operators.”\n\nThis leads to an interesting conundrum: is there a way to pay relay providers without breaking the system?\n\nBell Curve podcast co-host Hasu, strategy lead at Flashbots, points out that relays are not actually necessary for all parties because “only untrusted parties would be excluded from the MEV supply chain if relays didn’t exist.”\n\nMonetizing relays, Hasu argues, could inadvertently increase fragility in the system. Some participants might choose to circumvent relays to save on costs. In the current design, he says, “We have a social consensus — the social norm that everybody goes through a relay. And that’s really important because we want everybody to operate on the same footing.”\n\n“But once we start monetizing relays,” he says, it may drive away certain parties because that would “increase their bottom line.”\n\nCutler counters Hasu’s argument, explaining, “We want lots of relays. We want a lot of people going, ‘Look, the economics here is amazing. This is a great business to get in, and we can add value here.’”\n\n“Today,” Cutler adds, “there’s a small set of private entities who are using venture capital money to support the network and a couple of public goods that have passed the hat.”\n\n“And that strikes me as — at the core of the network — not sustainable and not ideal for a network that basically is trying to be able to fund its own operations overall.”\n\n“It’s not a free service. It’s, in fact, a very expensive service — and a high risk service.”\n\n“Ultimately,” Cutler says, “on a long enough timeline, these things are not sustainable.”\n\nRelays as a public good\n\nIn response, Hasu argues that one should instead look at the relay system as a “public good.”\n\n“We pay the same cost as you guys do at Blocknative for running the Flashbots relay. And we do that because we think it’s essential to uphold this market structure.”\n\n“We have to talk about it,” Hasu says, “from a funding public goods angle, more so than from an angle of how we can turn this into a market that can be monetized successfully.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2ZvcnR1bmUtY3J5cHRvLTQwLXNlbGVjdHMtZXRoZXJldW0tYXMtdG9wLXByb3RvY29sLWJpdGNvaW4tcmFua3Mtc2Vjb25kL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Fortune Crypto 40 selects Ethereum as top protocol, Bitcoin ranks second - CryptoSlate",
        "content": "In its newly launched Fortune Crypto 40 benchmark, the media firm ranked the top 5 firms in the crypto space in each of the eight categories.\n\nThe categories include centralized finance (CeFi), traditional finance (TradFi), Venture Capital, Non-fungible tokens (NFTs), Data, Infrastructure, decentralized finance (DeFi), and Protocols.\n\nTo find the top 40 firms, Fortune used various empirical metrics along with surveys of over 200 financial executives conducted by Researchscape. Fortune claims the results are “impartial and rigorous.”\n\nThe top 40 crypto firms by category\n\nThe benchmark ranked the Ethereum Foundation as the top protocol, followed by Bitcoin. Polygon Labs, which develops Ethereum scaling solutions, and Solana Foundation, the non-profit responsible for developing the Solana ecosystem, ranked third and fourth, respectively. Offchain Labs, the firm behind Ethereum scaling solutions provider Arbitrum, secured the fifth position in the Protocols category.\n\nCoinbase topped the CeFi category, followed by Binance and Kraken. Mike Novogratz-led Galaxy Digital and USD Coin (USDC) stablecoin issuer Circle grabbed the fourth and fifth positions in the benchmark.\n\nPayPal’s integration with MetaMask placed it at the top of the TradFi category, which ranked the top 5 firms innovating with blockchain technology. Stock trading platform Robinhood, which enables crypto trading, came in second, followed by JP Morgan Chase, which launched its own blockchain Onyx.\n\nFidelity, which received flak for allowing pensioners to invest part of their retirement funds in Bitcoin, ranked fourth, while Visa secured the fifth position.\n\nPolychain Capital ranked first in the VC category, followed by Animoca Brands and Andreessen Horowitz. The last two spots in the category went to Pantera Capital and Blockchain Capital.\n\nAs the largest NFT marketplace, OpenSea secured the top position in the NFT category. Yuga Labs, which launched some of the top NFT collections, including Bored Ape Yacht Club and Mutant Ape Yacht Club, ranked second.\n\nSky Mavis, creator of the popular NFT game Axie Infinity, and generative art NFT platform Art Blocks ranked third and fourth, respectively. RTFKT, which Nike acquired in 2021, is the fifth NFT firm in the benchmark.\n\nIn the data category, Chainalysis ranked first, followed by Coin Metrics and The Graph. Dune and Messari secured the two other spots.\n\nThe Fortune benchmark also included crypto firms that offer infrastructure for the industry. Non-custodial wallet provider Ledger topped the category. Bitcoin mining giant Genesis Digital Assets, not to be confused with the Digital Currency Group lender that filed for bankruptcy, secured the second spot.\n\nBitcoin mining chip developer Bitmain ranked third, followed by Alchemy, which provides plug-and-play tools to build products and services on blockchains. Crypto payment solution MoonPay ranked fifth in the infrastructure category.\n\nDeFi is all about Ethereum\n\nFortune listed Uniswap Labs, Lido, MakerDAO, Aave, and Curve as the top five contenders in the DeFi category. It is worth noting that all the DeFi applications are built on Ethereum.\n\nIn fact, according to DefiLlama data, these are the top five DeFi applications in terms of total value locked (TVL). The five DeFi applications have over $31 billion in TVL at the time of writing, as per DefiLlama.\n\nFurthermore, the Fortune benchmark includes a high number of Ethereum-based applications, not to mention that two out of the five top protocols are Ethereum scaling services.\n\nBut the focus on Ethereum may have been a result of the fact that Ethereum controls nearly 70% of all DeFi activity.\n\nMentioned in this article"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vdS50b2RheS8zNC1iaWxsaW9uLWV0aGVyZXVtLWV0aC10by1lbnRlci1tYXJrZXQtaW4tMjQtaG91cnPSAUdodHRwczovL3UudG9kYXkvMzQtYmlsbGlvbi1ldGhlcmV1bS1ldGgtdG8tZW50ZXItbWFya2V0LWluLTI0LWhvdXJzP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "$34 Billion Ethereum (ETH) to Enter Market in 24 Hours - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAs Ethereum finalizes its transition to a proof-of-stake (PoS) consensus mechanism with the upcoming Shapella fork, approximately $34 billion of locked, staked Ethereum (ETH) will become available for withdrawal by validators. The imminent unlock has led to speculation about the potential impact on the cryptocurrency market, especially considering that much of the locked volume is already liquid due to staking liquidity providers.\n\nAdvertisement\n\nStaking liquidity providers have been issuing liquid tokens in exchange for locking Ethereum in contracts, allowing investors to access and trade their staked assets without needing to wait for the unlocking event. This has created a situation where a significant portion of the locked, staked Ethereum is already circulating on the market, potentially reducing the immediate impact of the $34 billion unlock.\n\nEthereum is about to finalize its transition to proof of stake with the upcoming #Shapella fork. This will enable $ETH staked to be withdrawn by validators, allowing $34B of currently locked staked ETH to enter the market. How will the price react? pic.twitter.com/IyOm38kAdE — IntoTheBlock (@intotheblock) April 10, 2023\n\nHowever, it is still uncertain how the market will react to the unlocking event, as some investors may choose to sell their newly accessible Ethereum holdings, potentially putting downward pressure on the price. Others may decide to hold onto their Ethereum, anticipating further price appreciation as the network continues to evolve and improve with the transition to PoS.\n\nThe shift to a PoS consensus mechanism is expected to make Ethereum more energy-efficient, scalable and secure. This could result in increased demand for the cryptocurrency, as more developers and users are drawn to its improved capabilities. In the long term, the successful implementation of PoS could bolster Ethereum's position as the leading smart contract platform, driving further adoption and demand for the digital asset.\n\nAs more Ethereum is staked and withdrawn from contracts, the supply-demand dynamics could shift, potentially leading to an increase in the value of the asset."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNC8xMS9iZXN0LXNlbGxpbmctYXV0aG9yLXJpYy1lZGVsbWFuLXJldmVhbHMtY3J5cHRvLXBvcnRmb2xpby1zdHJhdGVneS1zYXlzLWhlLWhvbGRzLW1vcmUtZXRoZXJldW0tdGhhbi1iaXRjb2luL9IBkAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNC8xMS9iZXN0LXNlbGxpbmctYXV0aG9yLXJpYy1lZGVsbWFuLXJldmVhbHMtY3J5cHRvLXBvcnRmb2xpby1zdHJhdGVneS1zYXlzLWhlLWhvbGRzLW1vcmUtZXRoZXJldW0tdGhhbi1iaXRjb2luL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Best-Selling Author Ric Edelman Reveals Crypto Portfolio Strategy, Says He Holds More Ethereum Than Bitcoin - The Daily Hodl",
        "content": "Personal finance author and investor Ric Edelman has outlined his top strategy for navigating the digital asset markets.\n\nEdelman, who is also the founder of the Digital Assets Council of Financial Professionals (DACFP), says in a new Real Vision interview that he’s currently “overweight” in his exposure to crypto.\n\nThe investor says that many investors, especially those new to the space, could be better off just sticking to Bitcoin and Ethereum. He says he currently has more ETH than BTC due to his belief that ETH may offer more use cases to the commercial world.\n\n“I will tell you what I generally recommend to folks, what your crypto allocation ought to be. Number one, just Bitcoin. It’s the biggest, it’s the oldest, it’ll be the last man standing if it does blow up. Number two, Ethereum, the second biggest coin which has, I believe, a greater level of commercial application than Bitcoin. I personally own more Ethereum than Bitcoin, but not by much because the two are a big deal.\n\nYou could build a portfolio of just those two, Bitcoin and Ethereum. Together, they represent 70% of the total crypto market. They’re the Coke and Pepsi of crypto. Just do the two of them and call it a day.”\n\nEdelman is also a fan and investor of the Bitwise Top 10 Crypto Index Trust (BITW) which aims to track a basket of the 10 biggest digital assets.\n\n“Third, if you want to be more diversified, I’m a big fan of the Bitwise Top 10 Crypto Index trust, which is a grantor trust, there’s a lot of detail to how these things work. I’m an investor in Bitwise [and] a big fan of the company.\n\nThey call it the S&P500 (Standard and Poor’s 500) of crypto, it’s the top ten coins market cap weighted. So Bitcoin and Ethereum represent 70% of the fund, and then you got eight other coins that represent the fast growers, because the biggest won’t necessarily be the fastest growers.”\n\nO\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on Twitter Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA0LTEwL2V0aGVyZXVtLXMtZXRoLXNoYW5naGFpLXVwZ3JhZGUtY29tZXMtd2l0aC1hZGRlZC1tYXJrZXQtcmlza9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Ethereum’s (ETH) Shanghai Upgrade Comes With Added Market Risk - Bloomberg",
        "content": "Crypto enthusiasts are about to get some good news: The Ethereum blockchain’s next big software upgrade is poised to happen on Wednesday. But like almost everything else in the digital-asset world these days, the long-anticipated tweaks won’t come without complications.\n\nThe overhaul, dubbed Shanghai, follows last year’s game-changing “Merge,” which replaced power-hungry computers with a process involving staked, or pledged, Ether tokens and so-called validators to order transactions on the most commercially successful crypto network. Now, Shanghai will allow withdrawals for the first time by owners of Ether who have staked their coins since December 2020. Owners of the cryptocurrency who stake earn a yield that is paid out in additional Ether tokens."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNC8xMC9jaHJpcy1idXJuaXNrZS11bnZlaWxzLW1hc3NpdmUtcHJpY2UtdGFyZ2V0LWZvci1ldGhlcmV1bS1zYXlzLXRyYWRlcnMtd2FpdGluZy1mb3ItY3J5cHRvLWNhcGl0dWxhdGlvbi13aWxsLWJlLXNpZGVsaW5lZC_SAZ0BaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDQvMTAvY2hyaXMtYnVybmlza2UtdW52ZWlscy1tYXNzaXZlLXByaWNlLXRhcmdldC1mb3ItZXRoZXJldW0tc2F5cy10cmFkZXJzLXdhaXRpbmctZm9yLWNyeXB0by1jYXBpdHVsYXRpb24td2lsbC1iZS1zaWRlbGluZWQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Chris Burniske Unveils Massive Price Target for Ethereum, Says Traders Waiting for Crypto Capitulation Will be Sidelined - The Daily Hodl",
        "content": "A venture capitalist who correctly called the November 2022 digital asset bottom says those who are waiting for a major crypto correction will likely be left in the sidelines.\n\nPlaceholder partner Chris Burniske tells his 258,300 Twitter followers that he believes the stage is set for a massive long-term Ethereum (ETH) rally.\n\nAccording to Burniske, he sees Ethereum rising to a new all-time high and printing gains of over 438%.\n\n“For the haters that have been negative on ETH at $1, $10, $100, and $1,000, but refuse to let data change their views, see ya at ETH $10,000.”\n\nBurniske says that ETH could hit his target in 2025.\n\nLooking at the broader crypto markets, Burniske believes that short-term pullbacks are possible, but he doesn’t think the asset class will witness steep drawdowns anytime soon.\n\n“Sure, we’ll get pullbacks, but if you’re waiting for mega-liquidation-based-capitulations like that, you’re gonna be waiting til after the next expansion.”\n\nHe also says the crypto markets are likely poised for a rally.\n\n“Loving how few people are bullish at the moment – 2022 trauma runs deep. See you higher sers and miladies.”\n\nAs for the recent enforcement actions against big players in the space like Binance, Burniske says the headlines are giving crypto free exposure.\n\n“The crackdown on crypto, while CBDCs [central bank digital currencies] get near prime time, is not a coincidence.\n\nBut antifragile systems will persist and flourish, so we can thank Uncle Sam for the free marketing.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/urzine/oneshot1"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA0LzExL2JpdGNvaW4tbm90LWV0aGVyLWlzLWJlY29taW5nLW1vcmUtZG9taW5hbnQtaW4tY3J5cHRvLW1hcmtldC1haGVhZC1vZi1ldGhlcmV1bXMtc2hhbmdoYWktdXBncmFkZS_SAZEBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNC8xMS9iaXRjb2luLW5vdC1ldGhlci1pcy1iZWNvbWluZy1tb3JlLWRvbWluYW50LWluLWNyeXB0by1tYXJrZXQtYWhlYWQtb2YtZXRoZXJldW1zLXNoYW5naGFpLXVwZ3JhZGUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin, Not Ether, Builds Crypto Market Dominance Ahead of Ethereum's Shanghai Upgrade - CoinDesk",
        "content": "\"By being concerned, the market is actually 'pricing in' already any selling pressure that we are likely to get from the Shanghai hard fork and the upgrade could actually become a 'buy-the-news' event,\" she added. \"BTC dominance chart is at a multiyear resistance as well as we speak. All the stars are aligning for a rotation into ETH.\""
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiLGh0dHBzOi8vdGhlZGVmaWFudC5pby9yb29rLWFib3V0LXRvLXNwbGludGVy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 02:04:22 GMT",
        "title": "Ethereum Project Rook is About to be Splintered - The Defiant - DeFi News",
        "content": "Management, Tokenholder Split Would Give Team 1-Year Runway\n\nBy: Aleksandar Gilbert • Loading...\n\nDive\n\nA long-running protocol on Ethereum might splinter weeks after members of its community accused management of conspiring against them.\n\nThe protocol, Rook, helps users avoid fees on Ethereum. The DAO that governs Rook is currently voting to create an independent, spin-off organization that would receive almost 60% of the DAO’s assets. If the proposal succeeds, management would receive a little more than 40% of the DAO’s assets and keep rights to its intellectual property.\n\nThe protocol’s governance token, ROOK, is up more than 25% over the past week, according to CoinGecko.\n\nIt is the latest drama to unfold in the world of decentralized autonomous organizations, or DAOs. In recent weeks, multiple DAOs have been accused of “decentralization theater” — of making an effort to appear decentralized when ownership and control of the business in question is, in fact, in the hands of a select few.\n\nShaky Tokenomics\n\nLast month, the lone remaining co-founder said that pressure to innovate in Rook’s competitive sub-industry put management at odds with token holders who ostensibly control the Rook protocol.\n\nLast year, members of the DAO approved a proposal to “streamline” the ROOK token, stripping it of its use for anything other than voting in governance proposals.\n\nDespite the unanimous vote, users began to object to the token’s apparent lack of value. They also objected to the fact that ROOK was, in their view, trading at a discount. If each token were to represent an equal claim on the DAO’s treasury, they would be worth far more than their measly $16.\n\nRising Tension\n\nA pair of proposals – one to fund the development team through the first half of 2023, the other to extend the tenure of its CEO and CTO through the end of March – garnered opposition.\n\nDeFi Alpha Premium Content DeFi Daily | Weekdays\n\nDeFi Alpha Letter | Weekly\n\nDefiant Podcast Transcript | Weekly\n\nInbox Dump | Saturday\n\nWeekly Recap | Sunday Looking for Alpha? Become a premium member of The Defiant and join our DeFi Alpha community. Start for free\n\n“We acknowledge the tension between the team and community,” the co-founder, who goes by the pseudonym JZ wrote when proposing the Incubator DAO. “The source of this is an irreconcilable incompatibility between the competitive necessity to push technology to achieve the mission and the community’s expectation about project transparency, the token, and token holder’s desire to use the treasury for non-mission related purposes.”\n\nIncubator DAO vs. Rook DAO\n\nJZ, suggested Rook co-founders and core team would control Rook DAO and about 75% of assets via a multisig, while the rest of the community would control a new organization holding 25% of the treasury, called Incubator DAO, via the ROOK token.\n\nThe proposal was quickly panned. Rook holder Cmande3 called it an attempt by management to take the Rook DAO treasury for themselves.\n\n1 Year of Runway\n\nMembers of the DAO hammered out a compromise with management after a weeks-long debate in the Rook Discord: the Incubator DAO would receive the majority of treasury assets — 57%, according to one estimate — while the DAO would keep 43%, or about $20M.\n\nThat figure was good for one year of employee salaries and other business expenses, according to the pseudonymous CEO, hazard.\n\n“The team has taken the time and effort to give tokenholders a fully-vetted option to go their own way, de-fund the project, leave us with the liabilities, and do anything they want, today,” hazard wrote. “At this stage in the discussion, what we need to support that is only that enough remains behind to cover our minimum liabilities and a year of runway.”\n\nInsiders Selling\n\nBut the agreement almost fell apart Thursday after DAO members noticed some in management selling ROOK tokens.\n\nHazard suggested it was a misunderstanding — a way to ensure the team didn’t have any voting rights in a newly-formed Incubator DAO. The team re-purchased the tokens its members had sold and committed to burning them in the event the Incubator DAO proposal passes.\n\n“Okay Incubators — screenshot this,” hazard wrote, referring to supporters of the Incubator DAO proposal. “No team tokens going into circ[ulation], no team tokens using to vote, no team tokens being used in Incubator DAO gov. All the stuff you think is nefarious is just engineers sucking at politics.”\n\nThe voting to create an Incubator DAO ends Tuesday, and had 100% support as of Monday evening."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3NoYXBlbGxhLWluc3RpdHV0aW9uYWwtaW50ZXJlc3QtYmxvY2tjaGFpbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Shapella Upgrade Could Reignite Institutional Interest in Blockchain - Blockworks",
        "content": "Ethereum’s long-anticipated Shapella upgrade — the combination of the Shanghai execution layer and the Capella consensus layer, is just a day away.\n\nMany institutions and staking protocols are preparing for what could potentially be volatile market movements.\n\nEthereum’s network runs on a proof-of-stake model and is secured by validators who must deposit 32 ether ($52,500) to participate in block validation.\n\nShapella is a significant event for Ethereum as it will be the first time that ETH stakers, many of whom have had their ether locked up since Nov. 2020, will be able to retrieve their deposits from the network’s smart contract.\n\nLoading Tweet..\n\nAn attractive investment for institutional investors\n\nEther Capital CEO Brian Mosoff told Blockworks that this is an exciting time for the industry as “Shanghai unlocks the potential for new Ethereum investment vehicles to emerge, which could include structured products for investors looking for more traditional access points.”\n\n“The lack of liquidity on staked ETH is a sign that investors want to see the final stage of Ethereum’s PoW to PoS transition take place,” Mosoff said.\n\nFollowing this upgrade, Mosoff believes institutional investors may be more drawn to the network as there will be “lower barriers to entry when it comes to regulatory requirements for staked ETH funds.”\n\n“It won’t be as challenging to bring these products to market as liquidity can be offered with certainty around timing,” Mosoff said. “A lot of investors are speculating on what the price of Ether will be following Shanghai. I believe it will be a non-event, but it’s anyone’s best guess.”\n\nIn the long term, Mosoff believes that the Shapella upgrade will be a bullish event for Ethereum and strengthen its dominance in the blockchain space.\n\nHsuan Lee, the co-founder and CEO of Blocto, also shared this sentiment. He noted that although short-term price swings are expected, the upgrade is likely to bring in a fresh influx of institutional demand to the space.\n\n“Crucial to converting such institutional interest to participation is the establishment of robust security features to enhance collective confidence,” Lee said.\n\nWeb3 players such as Coinbase and Bybit have already ramped up their institutional and retail staking services. More recently, MetaMask Institutional also announced its plans to launch an institutional staking marketplace.\n\nMetaMask institutional product lead Johann Bornman previously told Blockworks that Shapella would be a landmark moment that would drive more institutional interest.\n\n“We’ve observed a real shift in interests from institutions into staking, particularly over the last six months,” Bornman said.\n\nLee agreed, adding that “overall, the expectation is that Shanghai will strengthen ether as a benchmark asset class for crypto by establishing a blueprint for staking protocols and giving users more confidence in their sovereignty over other assets.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNC8xMC90b3AtcGVyZm9ybWluZy10cmFkZXJzLXBvc2l0aW9uaW5nLXRoZW1zZWx2ZXMtbG9uZy1vbi1iaXRjb2luLWJ0Yy1hbmQtZXRoZXJldW0tZXRoLW9uLWNoYWluLWRhdGEv0gGGAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA0LzEwL3RvcC1wZXJmb3JtaW5nLXRyYWRlcnMtcG9zaXRpb25pbmctdGhlbXNlbHZlcy1sb25nLW9uLWJpdGNvaW4tYnRjLWFuZC1ldGhlcmV1bS1ldGgtb24tY2hhaW4tZGF0YS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Top Performing Traders Positioning Themselves Long on Bitcoin (BTC) and Ethereum (ETH): On-Chain Data - The Daily Hodl",
        "content": "The best-performing traders on decentralized exchange GMX are going long on Bitcoin (BTC) and Ethereum (ETH) while most of the market hesitates with uncertainty.\n\nAccording to blockchain tracking firm Lookonchain, three of the most profitable traders on GMX are currently long on BTC and ETH.\n\nLookonchain says one of the traders with a 70% win rate went long on Bitcoin at $28,000 and Ethereum just above $1860.\n\n“This trader earned $1,420,115 on GMX but he traded 78 times and won 55 times, with a winning rate of only 70.51%. He is currently long BTC and ETH with entry prices of $28,090 (BTC) and $1,861 (ETH) respectively.”\n\nThe firm says another high-performing trader positioned themselves long at similar price points.\n\n“This trader earned $1,380,206 on GMX but he traded 170 times and won 98 times, with a winning rate of only 57.65%.\n\nHe is currently long BTC and ETH with entry prices of $28,141 (BTC) and $1,859 (ETH) respectively.”\n\nA third trader with a fantastic 90% win rate, according to Lookonchain, went long on Ethereum at $1,888.\n\n“This trader has a very high win rate on GMX, traded 240 times, and won 216 times, with a win rate of 90%.\n\nHe made a total of $65,875 and currently long $ETH with an entry price of $1,888.”\n\nAt time of writing, Bitcoin is trading for $28,442 while Ethereum is priced at $1,860.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/FlashMovie"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vY29pbmNvZGV4LmNvbS9hcnRpY2xlLzI1NzMxL2V0aGVyZXVtLXByZWRpY3Rpb24tYXByaWwtMTEtMjAyMy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Ethereum is Predicted to Reach $2,186.82 By Apr 16, 2023 - CoinCodex",
        "content": "Disclaimer: This is not investment advice. The information provided is for general purposes only. No information, materials, services and other content provided on this page constitute a solicitation, recommendation, endorsement, or any financial, investment, or other advice. Seek independent professional consultation in the form of legal, financial, and fiscal advice before making any investment decision.\n\nEthereum is up 3.21% today against the US Dollar\n\nETH/BTC decreased by -2.48% today\n\nEthereum is currently trading 12.34% below our prediction on Apr 16, 2023\n\nEthereum gained 29.93% in the last month and is down -39.74% since 1 year ago\n\nEthereum price $ 1,916.89 Ethereum prediction $ 2,186.82 (14.08%) Sentiment Bullish Fear & Greed index 68 (Greed) Key support levels $ 1,864.65, $ 1,821.12, $ 1,795.62 Key resistance levels $ 1,933.68, $ 1,959.18, $ 2,002.71\n\nETH price is expected to rise by 14.08% in the next 5 days according to our Ethereum price prediction\n\nEthereum price today is trading at $ 1,916.89 after gaining 3.21% in the last 24 hours. The coin outperformed the cryptocurrency market, as the total crypto market cap increased by 2.68% in the same time period. ETH performed poorly against BTC today and recorded a -2.48% loss against the world’s largest cryptocurrency.\n\nAccording to our Ethereum price prediction, ETH is expected to reach a price of $ 2,186.82 by Apr 16, 2023. This would represent a 14.08% price increase for ETH in the next 5 days.\n\nETH Price Prediction Chart\n\nBuy/Sell Ethereum\n\nWhat has been going on with Ethereum in the last 30 days\n\nEthereum has been displaying a positive trend recently, as the coin gained 29.93% in the last 30-days. The medium-term trend for Ethereum has been bullish, with ETH increasing by 43.99% in the last 3 months. The long-term picture for Ethereum has been negative, as ETH is currently displaying a -39.74% 1-year price change. On this day last year, ETH was trading at $ 3,181.03.\n\nEthereum reached its all-time high price on Nov 10, 2021, when the price of ETH peaked at $ 4,867.17. The current ETH cycle high is $ 2,038.34, while the cycle low is at $ 897.01. ETH has been displaying low volatility recently – the 1-month volatility of the coin is at 5.57. Ethereum recorded 18 green days in the last 30 days.\n\nEthereum technical analysis for today - Apr 11, 2023\n\nThe sentiment in the Ethereum markets is currently Bullish, and the Fear & Greed index is reading Greed. The most important support levels to watch are $ 1,864.65, $ 1,821.12 and $ 1,795.62, while $ 1,933.68, $ 1,959.18 and $ 2,002.71 are the key resistance levels.\n\nBullish sentiment for Ethereum\n\n26 indicators are currently signaling a bullish prediction for Ethereum, while 2 indicators are showing a bearish forecast. With 93% of indicators favoring a positive prediction. This results in an overall Bullish sentiment for Ethereum.\n\nCrypto market is currently experiencing Greed\n\nCurrently, the Fear & Greed index is at 68 (Greed), which signals that investors have a positive outlook on the market. The Fear & Greed index is a measure of sentiment among cryptocurrency investors. A “Greed” reading suggests that investors are currently optimistic about the cryptocurrency market, but can also be an indication that the market is overvalued. A “Fear” reading, on the other hand, signals that investors are currently hesitant about the cryptocurrency market, which potentially represents a buying opportunity.\n\nEthereum moving averages & oscillators\n\nLet’s take a look at what some of the most important technical indicators are signaling. We’ll be going through key moving averages and oscillators that will allow us to get a better idea of how Ethereum is positioned in the market right now.\n\nPeriod Daily Simple Daily Exponential Weekly Simple Weekly Exponential MA3 $ 1,869.81 (BUY) $ 1,908.19 (BUY) - - MA5 $ 1,867.63 (BUY) $ 1,881.86 (BUY) - - MA10 $ 1,853.27 (BUY) $ 1,860.58 (BUY) - - MA21 $ 1,811.93 (BUY) $ 1,818.06 (BUY) $ 1,495.93 (BUY) $ 1,616.17 (BUY) MA50 $ 1,703.47 (BUY) $ 1,732.82 (BUY) $ 1,552.97 (BUY) $ 1,723.73 (BUY) MA100 $ 1,615.95 (BUY) $ 1,638.67 (BUY) $ 2,364.91 (SELL) $ 1,836.91 (BUY) MA200 $ 1,460.29 (BUY) $ 1,608.62 (BUY) $ 1,474.06 (BUY) $ 1,585.49 (BUY)\n\nPeriod Value Action RSI (14) 63.10 NEUTRAL Stoch RSI (14) 63.84 NEUTRAL Stochastic Fast (14) 69.60 NEUTRAL Commodity Channel Index (20) 66.67 NEUTRAL Average Directional Index (14) 24.40 NEUTRAL Awesome Oscillator (5, 34) 136.94 NEUTRAL Momentum (10) 65.49 NEUTRAL MACD (12, 26) -0.21 NEUTRAL Williams Percent Range (14) -30.40 NEUTRAL Ultimate Oscillator (7, 14, 28) 55.77 NEUTRAL VWMA (10) 1,842.74 BUY Hull Moving Average (9) 1,901.75 SELL Ichimoku Cloud B/L (9, 26, 52, 26) 1,770.42 NEUTRAL\n\nThe Relative Strength Index (RSI 14) is a widely used indicator that helps inform investors whether an asset is currently overbought or oversold. The RSI 14 for Ethereum is at 63.10, suggesting that ETH is currently neutral.\n\nThe 50-day Simple Moving Average (SMA 50) takes into account the closing price of Ethereum over the last 50 days. Currently, Ethereum is trading below the SMA 50 trendline, which is a bearish signal.\n\nMeanwhile, the 200-day Simple Moving Average (SMA 200) is a long-term trendline that’s calculated by taking an average of the ETH closing price for the last 200 days. ETH is now trading below the SMA 200, signaling that the market is currently bearish.\n\nThe bottom line about this Ethereum prediction\n\nAfter considering the above factors, we can conclude that the current forecast for Ethereum price prediction is Bullish. ETH would have to increase by 14.08% to hit our $ 2,186.82 target within the next five days. Moving forward, it will be important to monitor the ETH market sentiment, the key support and resistance levels, and other metrics. However, we have to keep in mind that the cryptocurrency markets are unpredictable, and even the largest crypto assets display a lot of price volatility. For long-term Ethereum price predictions click here.\n\nDisclaimer: This is not investment advice. The information provided is for general purposes only. No information, materials, services and other content provided on this page constitute a solicitation, recommendation, endorsement, or any financial, investment, or other advice. Seek independent professional consultation in the form of legal, financial, and fiscal advice before making any investment decision."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL3d3dy50cmFkaW5ndmlldy5jb20vbmV3cy90cmFkaW5ndmlldzo5M2FjZGIzOTQwOTRiOjAtZXRoLXVzZC1ldGhlcmV1bS1ob2RsZXJzLXByZXBhcmUtZm9yLXRoZS1lZmZlY3RzLW9mLWltbWluZW50LXNoYW5naGFpLXVwZ3JhZGUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "ETH/USD: Ethereum HODLers Prepare for the Effects of Imminent Shanghai Upgrade - TradingView",
        "content": "web3/ Unsplash\n\nEthereum's Shanghai Upgrade is fast approaching with an expected implementation set for tomorrow. And users of the network are anticipating what the upgrade’s effect on the network will be. Concerns are beginning to circulate that with excitement of tokens being unlocked could create a cascade of sell action, which would result in the price of ETH falling.\n\nThe great unstaking\n\nWhile there are concerns, experts in the space are suggesting that we are unlikely to see a mass sell off. This is in part due to the fact that unstaking of Ethereum will take time to be processed – with the length of delay varying from 5 days to 4 months depending on the amount being withdrawn.\n\nThis might prevent to some extent a large portion of ETH being unstaked and sold at the same time. Additionally, ETH is still trading significantly below its market highs, so the incentive to immediately sell the ETH-based profits of staking is further diminished.\n\nA long time coming\n\nThe withdrawal of staked ETH is one of the most highly anticipated events in the crypto industry at the moment. And with more than 18m ETH staked since its Beacon Chain went live, the implications of the change for the network could be substantial.\n\nSome exchanges such as Kraken have also been coming under increasing regulatory scrutiny for their offering of staking services, as the Securities and Exchange Commission (SEC) believes that in some instances they could be considered securities."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA0LzExL2FuYWx5c3QtaXNzdWVzLWNyaXRpY2FsLXBvbGthZG90LWRvdC13YXJuaW5nLXNheXMtZXRoZXJldW0tcml2YWwtaW4tbWFqb3ItcHJlZGljYW1lbnQv0gF7aHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDQvMTEvYW5hbHlzdC1pc3N1ZXMtY3JpdGljYWwtcG9sa2Fkb3QtZG90LXdhcm5pbmctc2F5cy1ldGhlcmV1bS1yaXZhbC1pbi1tYWpvci1wcmVkaWNhbWVudC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Analyst Issues Critical Polkadot (DOT) Warning, Says Ethereum Rival in Major Predicament - The Daily Hodl",
        "content": "A widely followed crypto strategist is warning that Ethereum (ETH) rival Polkadot (DOT) has one big fundamental weakness.\n\nThe anonymous host of InvestAnswers tells his 443,000 YouTube subscribers in a new strategy session that a lot of development is happening within the ecosystem of the interoperability protocol.\n\nHowever, he says Polkadot is experiencing a lack of adoption, which he notes is an ominous sign for any blockchain project.\n\n“Polkadot has an incredibly good [development] score when compared to the rest. But adoption is in the toilet. It has flatlined again, along with many others. It is critical, absolutely critical, for a chain like a mall to have customers. You can have the best technology in the world, but if it’s not adopted. you’re wasting your time. And that is the predicament that Polkadot is in right now.\n\nAgain, really good tokenomics, not too good of a SCP (smart contract platform) score for many different reasons. And here, adoption is nowhere to be seen…\n\nA quick and dirty summary here: the tokenomics are solid, development score is solid, SCP is number 10 out of 20 – beyond the top 20 they are just ghost chains that’ll never go anywhere. And the real issue is adoption.”\n\nAccording to the crypto strategist, Polkadot could solve its adoption issue overnight if the blockchain develops a killer use case that attracts millions of new users.\n\n“Crypto is not loyal. And we’ve seen how some chains will gradually wither away. But some can explode and flourish unexpectedly. I don’t know if Polkadot is going to be one of those. I don’t know if some of their sub-chains will be very successful. We can’t tell. But what I have seen is users are fickle. And if they have a value proposition product market fit that’s second to none, millions of users could go overnight.”\n\nPolkadot is trading for $6.31 at time of writing, up 1.7% in the past 24 hours.\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3LnNpbGljb24uY28udWsvZS1tYXJrZXRpbmcvZXBheW1lbnQvZXRoZXJldW0tdXByYWRlLXNoYW5naGFpLTUwNTc3N9IBUmh0dHBzOi8vd3d3LnNpbGljb24uY28udWsvZS1tYXJrZXRpbmcvZXBheW1lbnQvZXRoZXJldW0tdXByYWRlLXNoYW5naGFpLTUwNTc3Ny9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Upgrade Set To Release Billions In Value - Silicon UK",
        "content": "Shanghai-Capella upgrade to Ethereum blockchain continues shift away from energy-intensive ‘mining’ system to ‘proof of stake’\n\nThe price of the Ether token rose about 3 percent in early trading on Tuesday ahead of a planned major upgrade of the Ethereum blockchain on Wednesday.\n\nThe so-called Shanghai-Capella or “Shapella” hard fork is designed to give investors access to more than $30 billion (£25bn) of Ether that has been “staked” or pledged on the blockchain since December 2020.\n\nThe system introduced in 2020 allowed investors to stake or deposit Ether tokens on the blockchain in exchange for interest.\n\nAbout 15 percent of all Ether is staked, amounting to more than $30 billion in market value, according to Dune Analytics.\n\nWithdrawals\n\nThe latest upgrade follows last September’s overhaul called the “Merge”, which replaced the blockchain’s formerly energy-intensive proof-of-work system for verifying transactions with a proof-of-stake system, paving the way for Shanghai.\n\nWednesday’s upgrade unlocks some 18 million Ether, but only partial withdrawals of 1.1 million – the coins earned as staking rewards – will be immediately available to withdraw.\n\nThe partial withdrawals will take several days to process, meaning they are unlikley to place selling strain on the market, industry analysts have said.\n\n“If all partial withdrawals are attempted just after the Shapella fork (which seems highly improbable), it would take around four and a half days for these ETH profits to enter the market,” said IntoTheBlock head of research Lucas Outumuro in a Friday research note.\n\nSEC scrutiny\n\nThe availability of staking withdrawals is expected to make Ether more attractive to investors in the long run.\n\nBut regulatory issues may pose a concern for Ether, with the US Securities and Exchange Commission warning in recent months that it considers staking services offered by centralised exchanges to be an illegal sale of securities.\n\nRegulators have increasingly cracked down on cryptocurrencies this year, following a string of collapses of major crypto organisations in 2022, including that of the TerraUSD token and the exchange FTX.\n\nThe Shanghai upgrade completes the migration away from the energy-intensive proof-of-work system, posting questions for Bitcoin, which has remained with the older system.\n\nAlex de Vries, a data scientist at De Nederlandsche Bank, has estimated that the Merge reduced Ethereum’s energy consumption by at least 99.84 percent."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLXNoYXBlbGxhLXVwZ3JhZGUtY2xvc2VzLWluLWV0aC1wcmljZS1zZXQtdG8tYmxlZWQtZXRoLW5ld3Mv0gFdaHR0cHM6Ly9jb2luZ2FwZS5jb20vZXRoZXJldW0tc2hhcGVsbGEtdXBncmFkZS1jbG9zZXMtaW4tZXRoLXByaWNlLXNldC10by1ibGVlZC1ldGgtbmV3cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Shapella Upgrade Closes In; ETH Price Set To Bleed? - CoinGape",
        "content": "Ethereum News: The Ethereum network is set to witness a much anticipated technical upgrade on April 12, 2023. The new development will allow the ETH holders/Users to withdraw their billion worth of Ethereum (ETH) tokens. However, On-Chain data shows that there is a decline in the deposit trend by the staking providers over the past week. It raises a crucial question here how do ETH holders’ action will impact the Ethereum price ahead?\n\nAlso Read: Cardano Whales Scoops 560 Million ADA; Something Big Coming Up?\n\nadvertisement\n\n$34 Billion Worth Of Ethereum Locked In\n\nThe cryptocurrency market is in a recovery phase for now. However, it is expected that the traders affected by the recent market downturn might seize the opportunity to withdraw their staked tokens.\n\nIntoTheBlock reported that the Shapella fork will enable Ethereum staked to be withdrawn by validators. This will allow $34 billion worth of locked ETH to enter the market. It mentioned that withdrawals of staked ETH will see a delay to be processed in order to mitigate an exodus and worse security for Ethereum. Read More Ethereum News Here…\n\nAlso Read: Binance Futures Users Affected; CZ Replies\n\nIt added that the partial withdrawals will take around 4 to 5 days, while, it is projected to take over 100 days for 1/3 of the full withdrawals to happen. This suggests that around $80 million to $100 million of Ethereum will be withdrawn daily if this happens.\n\nGlassnode reported a decline in deposit trends by staking providers. It mentioned a clear shift in deposits over time with Kraken, Binance, and Coinbase. However, Lido emerged as a winner defeating the three giants. Lido now continues to dominate deposit inflows.\n\nEthereum price has managed to surge by 33% over the past 30 days. ETH is trading at an average price of $1,857, at the press time. Its 24 hour trading volume is up by 7% to stand at $6 billion."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tcmVhbGl6ZWQtdm9sYXRpbGl0eS1kcm9wcy1yYXJlL9IBUmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tcmVhbGl6ZWQtdm9sYXRpbGl0eS1kcm9wcy1yYXJlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Ethereum 1-Month Realized Volatility Drops To Rare Level Seen Only Thrice In History - NewsBTC",
        "content": "On-chain data shows that Ethereum realized volatility has now declined to rare levels observed only three times before in history.\n\nEthereum 1-Month Realized Volatility Has Plummeted To Just 39.8%\n\nAs per data from the on-chain analytics firm Glassnode, the month of December 2022 was historically quiet for both Ethereum and Bitcoin. The “realized volatility” is an indicator that measures the standard deviation of daily returns from the mean for the market in question.\n\nThe indicator is usually taken over a rolling window, with the one-week and one-month versions being generally the most useful timespans for it. In the context of the current discussion, the relevant metric is the one-month realized volatility.\n\nWhen the value of the metric is high, it means the asset’s price has been showing greater fluctuations from the average recently. Such a trend implies that the market is providing a high trading risk currently. On the other hand, low values suggest returns haven’t deviated much from the mean, and hence that the price has been stuck in stale consolidation.\n\nNow, here is a chart that shows the trend in the one-month Ethereum realized volatility over the last few years:\n\nLooks like the value of the metric has declined in recent days | Source: Glassnode on Twitter\n\nAs displayed in the above graph, the Ethereum one-month realized volatility has plunged to just 39.8% recently, suggesting that the past month has had very little diversity in day-to-day returns. This current level of the indicator is actually a historically low value, and as is apparent from the chart, there have only been three instances in the history of the crypto where the price has been this stable.\n\nInterestingly, after each occurrence of the volatility hitting these lows, the price has made a sharp move and the indicator has jumped back up. An important example of this was back in November 2018, when the value of ETH collapsed toward the bottom of the bear market in a sudden move, after the metric had reached these rare levels.\n\nGlassnode also points out that, just like for Ethereum, the one-month realized volatility for Bitcoin has also plunged to historical lows recently, as the below chart highlights.\n\nThe value of the metric seems to have hit very low values recently | Source: Glassnode on Twitter\n\nAs you can see above, the Bitcoin one-month realized volatility has only been lower than the current value (24.6%) a few times in the entire history of the crypto. A notable instance here was also in November 2018, where, just like ETH, BTC crashed down to form its bottom.\n\nIf these historical trends are anything to consider, then the current extremely low values in the one-month volatility for Ethereum and Bitcoin could mean both the cryptos may soon see a significant spike in the metric soon, but the accompanying price move could be toward either direction.\n\nETH Price\n\nAt the time of writing, Ethereum’s price floats around $1,300, up 8% in the last week.\n\nETH has shot up during the past day | Source: ETHUSD on TradingView\n\nFeatured image from Kanchanara on Unsplash.com, charts from TradingView.com, Glassnode.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tbmV3LXNtYXJ0LWNvbnRyYWN0cy1mYWxsLTYwL9IBT2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tbmV3LXNtYXJ0LWNvbnRyYWN0cy1mYWxsLTYwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Number of New Ethereum Smart Contracts Falls 60% in 2023 - NewsBTC",
        "content": "Ethereum prices might be solid, and bulls are looking to drive the coin toward $1,700, but on-chain data points to dropping activity from developers judging from the number of new smart contracts deployed in the first three weeks of January.\n\nNumber Of Smart Contracts Deployed On Ethereum Falling\n\nThe number of new smart contracts deployed over the past few weeks, since the beginning of 2023, has fallen by more than half. The number of new smart contracts deployed on January 1, 2023, stood at 139,699.\n\nHowever, a total of 56,370 smart contracts were deployed on Ethereum on January 23, a solid recovery from the 10,079 figure registered on January 14, but still a long way from its January 1 levels.\n\nThe contraction over the past three weeks represents a 60% drop from January 1 levels, a concern for analysts. Ordinarily, the number of contracts deployed on a smart contract network points to on-chain activity, and the more dApps there are on any frontier, in DeFi, NFTs, gaming, and more, the higher the probability that this activity could spill into price action since ETH, the native token of Ethereum, is used to settle network fees.\n\nWhenever there is a spike in on-chain activity, the demand for block space is higher, requiring developers to use more ETH for a slot in a block.\n\nFalling contracts deployment coincides with the exemplary performance of ETH prices over the month. ETH prices have rallied from $1,200 on January 1 to $1,659 on January 20. Even though bulls are yet to push the coin above $1,700, an immediate resistance level that, if broken, could see ETH prices float to new Q1 2023 highs.\n\nHistory shows a direct correlation between the number of contracts deployed and price action since developers often double down their efforts whenever prices are trending higher, deploying more contracts. This trend is not validated in the performance from early January, considering the divergence between spot prices and the number of contracts launched.\n\nEven though there was a near 5X spike between January 14 and January 23, there could be a significantly higher number of contracts if this action were aligned with ETH prices.\n\nNevertheless, smart contracts on the Ethereum network saw solid growth in 2022. A report by the software firm, Alchemy, showed that over 100,000 dApps were launched in 2022.\n\nTransaction Fees Falling\n\nThe average transaction fee on Ethereum has been on the rise since the beginning of the year, according to data from Cryptoquant. From January 1, fees have more than doubled, rising from $2.92 to $3.99 on January 23.\n\nEven though fees are relatively higher now compared to the start of the year, they are multiples lower than in May 2022 when the average fee to post a simple transfer was $22. Subsequently, deploying smart contracts, depending on their complexity, was multiples higher.\n\nFeature image from Canva, Chart from TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1sYXllci0yLXByb3RvY29scy11bmRlci1zY3J1dGlueS1hbWlkLXJpc2luZy10cmFuc2FjdGlvbi1jb3N0cy1kZXRhaWxz0gFjaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtLWxheWVyLTItcHJvdG9jb2xzLXVuZGVyLXNjcnV0aW55LWFtaWQtcmlzaW5nLXRyYW5zYWN0aW9uLWNvc3RzLWRldGFpbHM_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Layer 2 Protocols Under Scrutiny Amid Rising Transaction Costs: Details - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe future of Ethereum as it relates to its scaling capabilities has been placed under deep scrutiny as the role of the growing horde of Layer 2 protocols in tapering down associated fees is being analyzed. According to data from L2Fees, the majority of L2 protocols have significantly lower fees associated with transfers and swaps of assets when compared with Ethereum's.\n\nAdvertisement\n\nPer the data, Loopring ranks as the cheapest platform to conduct transactions as the average cost to send Ethereum is pegged at $0.03, while swapping costs $0.05.\n\nArbitrum (ARB), Polygon's zkEVM and zkSync Era require 6 cents, 16 cents and 5 cents, respectively. While these protocols are notably more efficient, the fact that they are able to combine speed and low cost when compared to Ethereum has already positioned them as outfits with immense potential.\n\nImage Source: L2Fees.Info\n\nEthereum, despite its soaring gas fees, is still the most robust blockchain protocol in the world, though there has been an ongoing targeted rebrand in the network's features as a proof-of-stake (PoS) protocol. While a push to higher scalability is in the works, the best way to make use of the Ethereum protocol easily at this time is via the associated L2 protocol.\n\nAre L2s enough?\n\nThe majority of Layer 2 protocols out there make use of the Zero Knowledge Proof technology to verify transactions. zk-Proof, as it is fondly called, helps convey verification information faster in a way that frees up additional data that can drag down transaction processing.\n\nTo date, it is considered the most viable way to fully commercialize the Ethereum blockchain, as many transactions can be bundled and confirmed at the same time and for much less. While these technologies are still undergoing active development, they represent the best avenue to onboard the next billion users into the Ethereum ecosystem."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2V0aGVyZXVtLWJsb2NrLWV4cGxvcmVyLWV0aGVyc2Nhbi1hZGRzLWFudGktc2NhbS1mZWF0dXJlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Ethereum block explorer Etherscan adds anti-scam feature - CryptoSlate",
        "content": "Etherscan, a block explorer for the Ethereum blockchain, announced on April 10 a feature that is designed to prevent users from falling victim to scams.\n\nEtherscan to hide zero-value transfers\n\nEtherscan said that, in order to protect users from scams called address poisoning attacks, it will hide zero-value token transfers by default.\n\nWhile the site previously greyed out zero-value transactions, those transactions are now hidden entirely under the new feature, as seen below.\n\nDuring an address poisoning attack, a scammer creates a “spoofed” address that is nearly identical to one that their target has previously transacted with. The scammer then sends zero-value transfers from the spoofed address to the target’s address. The target may confuse the two similar addresses and direct funds to the spoofed address by mistake.\n\nBecause this approach depends on user error and is a type of phishing, hiding transactions that contain no value can make the scam far less alluring to its victims.\n\nEtherscan noted that preventing scams in a neutral manner is “an infinite cat-and-mouse game” and said that it recognized the value of “uncensored” blockchain records. As such, users will be able to toggle the option in settings, it said.\n\nEtherscan already includes other anti-scam features: for example, it flags addresses that are known to be involved in scams and hacks.\n\nZero-value attacks increasingly common\n\nThe type of scam in question has gained wider attention in the crypto industry. Two blockchain firms, X-explore and WuBlockchain, estimated that zero-value transfer phishing and related attacks have resulted in up to $32 million in thefts on Ethereum.\n\nCoinbase, meanwhile, suggested that this type of attack originated in November 2022 and had led to $19 million of thefts on various platforms by February 2023.\n\nThe Ethereum-focused wallet Metamask also warned of address poisoning scams in January 2023 and provided users with ways to protect themselves."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMilwFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3Ryb24tb3V0cGVyZm9ybXMtZXRoZXJldW0tYW5kLXBvbHlnb24tb24tdGhpcy1mcm9udC1idXQtc3RpbGwtZmFpbHMtdG8tY2hhcnQtbmV3LTIwMjMtaGlnaHMtMjAyMzA0MTEyMzIw0gGbAWh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9hbXAvY3J5cHRvY3VycmVuY2llcy9uZXdzL3Ryb24tb3V0cGVyZm9ybXMtZXRoZXJldW0tYW5kLXBvbHlnb24tb24tdGhpcy1mcm9udC1idXQtc3RpbGwtZmFpbHMtdG8tY2hhcnQtbmV3LTIwMjMtaGlnaHMtMjAyMzA0MTEyMzIw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Tron outperforms Ethereum and Polygon on this front but still fails to chart new 2023 highs - FXStreet",
        "content": "Share:\n\nTron has observed significantly higher daily active users; 1.7 million across the chain against the likes of Ethereum, BNB chain and many others.\n\nConsequently, the number of on-chain transactions also exceeds Ethereum by nearly seven times.\n\nTron price is still struggling to observe decent gains, trading at $0.066 even as Bitcoin price crosses $30,000.\n\nTron has established itself as a core Decentralised Finance (DeFi) chain and has also managed to do the unthinkable by surpassing Ethereum in some ways. However, beyond the usage of Tron’s native token, TRX is still struggling to leave a positive mark on the chart.\n\nTron leads in daily active user count\n\nTron has emerged as a capable DeFi chain with over $5.5 billion in total value locked (TVL) across its 17 protocols. In comparison, Arbitrum, with over 280 protocols, has only $3 billion in TVL, while Binance’s BNB Chain has only $6.5 billion locked with nearly 580 protocols.\n\nThe appeal that it generates in the DeFi market has pushed its adoption significantly in the spot market as well. As per analysis, the daily active users on Tron sit at 1.7 million, outshining the likes of Ethereum, BNB chain and Polygon, with each having 317,000, 1.1 million and 387,000 daily active users, respectively.\n\nTron daily active users\n\nHowever, the chain’s exceptional performance is not limited to simply gaining the attention of the users but also to their participation in the network. On-chain data noted that the daily transactions on the network sit at a little over 1 million for Ethereum, while Tron processes close to 7.7 million transactions. But even though the chain usage is garnering the attention and presence of the users, it is not reflected in the asset’s price action.\n\nTron daily transactions\n\nTron’s native token, TRX, in the last three months, has only noted an increase of 17.04% in its price, which is significantly lower in comparison to ETH. The world’s second-biggest cryptocurrency breached the $1,900 mark for the first time in eight months and charted a new year-to-date high following a 43% rally.\n\nTRX/USD 1-day chart\n\nOne reason behind this could be the purpose of the cryptocurrency, which limits its real-world use cases. TRX is used only on the Tron network to pay the content creators, consequently gaining no attention apart from this and trading. Ethereum, on the other hand, is used as a payment system for verifying transactions, justifying its presence and movement on wallets.\n\nMoreover, TRX mostly sits in wallets until a major event occurs, such as the FUD of Tron founder Justin Sun’s arrest in Hong Kong earlier on April 11. Even then, the intra-day trading hours’ volatility was minimal, as noted in the 2% decline of the cryptocurrency.\n\nThus while Tron might be winning in terms of usage, Ethereum is winning in terms of use cases and demand which, at the end of the day, impacts the value of the entire network."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vdS50b2RheS9ieWJpdC1hZGRzLXN0YWtlZC1ldGhlci1zdGV0aC10by11bmlmaWVkLXRyYWRpbmctYWNjb3VudC1hcy1zaGFwZWxsYS11cGdyYWRlLWFwcHJvYWNoZXPSAWtodHRwczovL3UudG9kYXkvYnliaXQtYWRkcy1zdGFrZWQtZXRoZXItc3RldGgtdG8tdW5pZmllZC10cmFkaW5nLWFjY291bnQtYXMtc2hhcGVsbGEtdXBncmFkZS1hcHByb2FjaGVzP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Bybit Adds Staked Ether (stETH) to Unified Trading Account as Shapella Upgrade Approaches - U.Today",
        "content": "Advertisement\n\nAs the global cryptocurrency community is waiting for the mainnet activation of Shapella upgrade on Ethereum (ETH) network, top-tier CEX Bybit adds a new feature that is a crucial one for stakers.\n\nBybit adds stETH to Unified Trading Account\n\nAccording to a statement shared by the team of Bybit exchange, the final stage of Staked Ether (stETH) integration into Unified Trading Account has been concluded. Not all users can seamlessly mint Staked Ether (stETH) on Bybit Earn or buy it on a spot market module.\n\nDive into Bybit’s reward pools and grab your share of rewards! #ICMYI: Celebrate #Ethereum Shanghai Upgrades with us, P2P Egg-Celent Easter and many more events to participate in!\n\n\n\nRead more: https://t.co/y8nsw1blne#Bybit #TheCryptoArk pic.twitter.com/JjYRfxbgFW — Bybit (@Bybit_Official) April 10, 2023\n\nThen, immediately upon minting, Staked Ether (stETH) can be used as collateral in Unified Trading Account (UTA), an out-of-the-box trading module for Bybit users.\n\nAs such, Bybit is aiming to be the first cryptocurrency exchange to allow its traders to leverage Staked Ether (stETH) in margin trading. This makes liquidity usage on the platform more resource-efficient.\n\nBen Zhou, co-founder and CEO at Bybit, is excited by the opportunities this integration unlocks for all traders and ETH stakers on the platform:\n\nWe are excited to offer a new way for our users to make the most from their ETH investments. By combining two powerful features — ETH staking and UTA — into one product, we are creating an entirely new experience, which allows our users to enjoy capital efficiency and trade without missing out on the opportunity to earn yield.\n\nAs covered by U.Today previously, Bybit's UTA is among the most notable accomplishments in the CEX segment in Q1, 2023.\n\nStreamlined Ethereum (ETH) staking for Bybit users ahead of Shapella\n\nWith new functions by Bybit, Ethereum (ETH) stakers on the platform can significantly improve the logics of their operations. They do not need to withdraw Ethers (ETH) from staking modules any longer in order to increase the size of their portfolio.\n\nTypically, Ethereum (ETH) staking with such modules results in 3-4% in APR.\n\nEthereum's Shapella upgrade is the most anticipated release on the Ethereum (ETH) scene since The Merge. It is set to allow ETH unstaking from deposit contracts."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vdS50b2RheS8zLW1pbGxpb24taW4tZXRoZXJldW0tbWFkZS1ieS10aGlzLXNtYXJ0LW1vbmV5LW9uLWdteC1hbmQtZ25zLWhlcmVzLWhvd9IBW2h0dHBzOi8vdS50b2RheS8zLW1pbGxpb24taW4tZXRoZXJldW0tbWFkZS1ieS10aGlzLXNtYXJ0LW1vbmV5LW9uLWdteC1hbmQtZ25zLWhlcmVzLWhvdz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "$3 Million in Ethereum Made by This 'Smart Money' on GMX and GNS, Here's How - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nCrypto tracking account @lookonchain has spotted a \"Smart Money\" wallet that made a healthy profit on their GMX and GNX coins within less than an hour.\n\nWhale sells GNS and GMX bought on Binance\n\nThe crypto tracker shared that this anonymous whale had dumped their Gains Network (GNS) and GMX (GMX) tokens bought on the Binance exchange approximately one month ago.\n\nAccording to the tweet, this whale bought 41,302 GMX on Binance for $74 each, paying $3.05 million in total for that. He then sold it earlier today on the Uniswap DEX at $79 per each GMX, making 1,696 Ethereum worth $2.26 million in total. His net profit was $214,000.\n\nAs for GNX, he bought it on Binance, paying $8.36 per coin, and now sold them for $6.86. He made 211 Ethereum (or $405,000), thus losing approximately $88,000.\n\nAnother whale capitalizing on GMX sale\n\nIn a later published tweet, Lookonchain also reported about another Smart Money wallet, who also made some profit from selling its GMX tokens.\n\nHe had bought 5 GMX for 404,403 USDC four hours ago, paying $79.24 per coin. He also sold 1,645 GMX he had acquired on Feb. 11 at $61 per coin (spending 99,940 USDC on that), earning 107,017 USDC. His total profit was roughly $7,000.\n\nOn Jan. 11 and Feb. 3, the same whale sold 8,403 GMX at $53 per coin, making $141,000. He bought that amount of GMX from late October through early January at $36 per GMX token.\n\nGMX is currently trading at $79.18 after a marginal rise over the past 24 hours, according to data provided by CoinMarketCap. As for GNS, this token is changing hands at $6.79."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9ldGgtcHJpY2UtcHJlZGljdGlvbi1pcy10aGUtdG9wLWFsdC1jb2luLXRoZS1iZXN0LWludmVzdG1lbnQtb3Itd2lsbC10aGVzZS1uZXctY29pbnMtZ2l2ZS0yMDAtbW9yZS1nYWlucy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Ethereum is Top Alt-Coin but Others Make for Better Investments. - Analytics Insight",
        "content": "Ethereum (ETH) has long been considered the top alt-coin on the market, and for good reason. It’s the second-largest blockchain in the world, behind Bitcoin, and has often performed quite well for investors.\n\nThat hasn’t been the case, though in the last 12 months. In that time period, as of April 6, ETH has dropped 43.68% in value. It has rebounded decently in the last month, bumping up 18.27%. That has brought its total value to $1,868.18.\n\nMany people are wondering whether Ethereum, the top alt-coin, is the best investment. The quick answer is maybe not. Below, we’ll look at a price prediction for Ethereum to see what it’s all about, as well as look at five other alt-coins that could make for much better investments.\n\nThey are Love Hate Inu (LHINU), DeeLance (DLANCE), Metropoly (MET), Ecoterra (ECOTERRA) and RobotEra (TARO), and they’re all currently in presale.\n\n>>>Buy The Best Coin Now<<<\n\nEthereum Price Prediction\n\nBelow is an Ethereum price prediction on where the value could go in the next few years.\n\nYear Expected low Expected high 2023 $1,913.83 $2,201.94 2025 $2,011.77 $3,017.66 2030 $8,640.50 $10,368.60\n\nIf the above price prediction holds true, then Ethereum will gain 51.17% in value between the end of this year and 2025. Then, from 2025 through 2030, it could be expected to gain another 329%, all the way above the $8,600 mark.\n\nThose returns might sound fantastic in the traditional asset market, but in cryptocurrency, they’re not all that impressive. This is especially true of a big crypto like Ethereum. With the volatility it has experienced in recent times, a promise of a little more than 50% by the end of the year isn’t all that encouraging.\n\nInvestors would also have to hold onto their asset for another seven years before they could realize the really big gains above $8,600. That’s an eternity in crypto.\n\nAs such, there are some other alt-coins that are likely much better investments. We detail five of those below.\n\n>>>Buy The Best Coin Now<<<\n\nLove Hate Inu Revolutionizing Online Surveys\n\nThe online survey market is exploding, and Love Hate Inu (LHINU) is set to disrupt it all. Based on the blockchain, the platform is ensuring that all polls will be open and transparent, and won’t be able to be manipulated in any way. Users will have to stake $LHINU tokens to take part, which makes it more legitimate and also allows them to remain anonymous.\n\nThere are loads of growth opportunities for Love Hate Inu, including the possibility for international brands to offer sponsored polls with rewards such as NFT discount codes to those who participate. Love Hate Inu is still in presale but won’t be there for long. Buy now to get the best price.\n\n>>>Buy Love Hate Inu Now!<<<\n\nDeeLance Providing a Better Freelance Platform\n\nFreelancing has become commonplace in today’s work environment, yet the platforms that help connect freelancers with potential employers still aren’t perfect. Enter DeeLance (DLANCE), a new Web3 freelancing platform that’s about to change all of that.\n\nThere are many unique aspects to the platform, including the fact that all work will be minted into NFTs. This ensures that the companies that are paying for the work truly own it. It also protects freelancers from being stiffed on payments and helps to resolve issues before they can blossom into something larger.\n\nDeeLance just began its presale, which makes now the best time to buy.\n\n>>>Buy DeeLance Now<<<\n\nMetropoly Opening Real Estate Investing to All\n\nThrough Metropoly (MET), people can invest in real estate for as little as $100. This gives them the opportunity to own a slice of luxury real estate around the world and take advantage of all the fruits that it has to offer.\n\nThe platform is going to explode in value, and is timed really well, as real estate performs great during inflationary times. That’s why now is the best time to buy Metropoly as it’s still in its presale stages.\n\n>>>Buy Metropoly Now<<<\n\nEcoterra Incentivizing Recycling\n\nEcoterra (ECOTERRA) is a new Recycle2Earn platform that’s incentivizing people to recycle more. In an effort to help save the planet, the platform is also making it easier for manufacturers to obtain recycled materials that they can then use to create new products. This is an all-encompassing platform, then, making it easy for recycling to happen in a seamless fashion.\n\nEcoterra is one of the leading green crypto projects in the world, yet it’s providing investors with an amazing opportunity now since it’s only in presale. Hurry and buy before you miss out, or before the price increases with the next presale stage.\n\n>>>Buy Ecoterra Now<<<\n\nRobotEra Providing New NFT Opportunities\n\nUsers on RobotEra (TARO) will enter the beautiful metaverse of Taro, where they can become robot avatars and help to rebuild the planet after a long war. To do so, they’ll gather the resources from the planet, create robot companions and work with other users on the platform.\n\nIn the process, entirely new NFT communities will be created, and people will be able to join in and share on all the excitement and creation. Since it’s all based around the $TARO token, the project is set to soar in value.\n\nIt’s in presale stage 2 now, so hurry and buy before you miss out.\n\n>>>Buy RobotEra Now<<<\n\nBuy These Alt-Coins Instead of Ethereum\n\nEthereum is the most well-known alt-coin on the market, but that doesn’t mean that it’s the best investment – even if it’s the most valuable in terms of actual overall price. As you can see above, there are many concerns with Ethereum’s price prediction in the future, which is why many investors are staying on the sidelines with it for now.\n\nInstead of jumping in on Ethereum, you’d be better off investing in other alt-coin projects such as Love Hate Inu, DeeLance, Metropoly, Ecoterra and RobotEra. All are in various stages of presale right now, though, so don’t delay any longer if you want to get in on the best price available.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldmVuLWFzLWV0aC0yLTAtZGVwb3NpdC1jb250cmFjdHMtc3VyZ2Utd2h5LWFyZS1pbnZlc3RvcnMtb24tdGhlLXNpZGVsaW5lcy_SAWVodHRwczovL2FtYmNyeXB0by5jb20vZXZlbi1hcy1ldGgtMi0wLWRlcG9zaXQtY29udHJhY3RzLXN1cmdlLXdoeS1hcmUtaW52ZXN0b3JzLW9uLXRoZS1zaWRlbGluZXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Even as ETH 2.0 deposit contracts surge, why are investors on the sidelines - AMBCrypto News",
        "content": "ETH is winning on the staking side, but other metrics underline lower network activity.\n\nDemand slows down limiting ETH’s potential upside.\n\nInvestors keeping a close eye on Ethereum [ETH] may have noticed that investor interest was limited despite the hype surrounding the Shanghai upgrade. Meanwhile, at press time, some network developments underpinned substantial activity in its preparation.\n\nIs your portfolio green? Check out the Ethereum Profit Calculator\n\nAccording to 9 April’s Glassnode data, the amount of liquidity locked in ETH 2.0 deposit contracts has not only been rising but is at a new ATH. Such an observation would normally be associated with more confidence in the market, and also in line with a major development.\n\n? #Ethereum $ETH Total Value in the ETH 2.0 Deposit Contract just reached an ATH of 17,330,295 ETH View metric:https://t.co/SzbMPqvhlb pic.twitter.com/d5o6D7bFpX — glassnode alerts (@glassnodealerts) April 9, 2023\n\nThe timing of the growth in ETH 2.0 deposit contracts suggests that it might be heavily influenced by the countdown to the Shanghai upgrade. One potential reason for this is that ETH holders are locking their ETH on staking facilities so that they can earn passive rewards. Is this is in anticipation of increasing trading activities near, during, and after the upgrade? Not really, according to these metrics.\n\nEthereum network activity slows down\n\nETH’s daily active addresses have been declining, and at press time, were down to their lowest in the last seven days. This translates to lower transactions and thus, lower gas fees. It is therefore no surprise that ETH gas fees have also been at their lowest level in the last four weeks.\n\nLower gas fees, despite growing ETH 2.0 deposit contracts, may indicate a lack of organic growth underpinned by lower transactions. This meant that at press time, there was low demand for ETH. Higher gas fees are usually observed in times of strong network growth and usage, as network participants were willing to pay a premium under such conditions.\n\nActive deposits have also slowed down in the last few days, in line with the above observations. Therefore, Ethereum experienced negative network growth, especially in the last seven days. Its network growth metric fell to the lowest weekly level in the last 24 hours at press time.\n\nHow much are 1,10,100 ETHs worth today?\n\nETH enthusiasm thwarted\n\nThe declining network activity, despite a surge in ETH 2.0 deposits, reflected ETH’s price action. It closed last week on a net gain thanks to a strong bullish performance in the first half of the week. However, a mid-week pivot followed by a 5.6% correction to its $1838 press time ensured that most of retail buyers during the week got trapped.\n\nDespite the mid-week retracement, there was some excitement that fueled the rally at the start of the week. This was enough for a new YTD high as the price drew closer to the highly coveted $2000 price level. However, the second half ultimately revealed the state of low demand."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zeW1iaW9zaXMtaW50ZWdyYXRlcy16a3N5bmMtbmF0dXJhbC1ldm9sdXRpb24tb2Ytc2NhbGluZy1zb2x1dGlvbnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Symbiosis integrates zkSync: 'Natural evolution' of scaling solutions - Cointelegraph",
        "content": "Cross-chain automated marker maker Symbiosis has onboarded layer-2 scaling protocol zkSync to improve speed and reduce fees of token swaps on its platform.\n\nThe decentralized exchange (DEX) was launched in March 2022. It provides single-sided stablecoin pools that deliver zero impermanent loss to liquid providers. It also facilitates “any-to-any” native asset swaps on its platform across Ethereum Virtual Machine (EVM) and non-EVM networks.\n\nNick Avramov, a co-founder of Symbiosis, told Cointelegraph that the integration of zkSync will provide one-click swaps from Ethereum, Polygon, Avalanche, BNB Chain, Telos and other blockchains to zkSync and back.\n\nThe additional functionality also removes the need for users to switch between different wallets and interfaces. Avramov also confirmed that the integration improves the variety of token swaps through its DEX, supporting any-to-any native swaps to and from zkSync.\n\nRelated: ConsenSys zkEVM set for public testnet to deliver secure settlements on Ethereum\n\nThe integration of zkSync is also aimed at making liquidity transition to and from zkSync “secure, fast and cheap.” Avramov highlighted the importance of layer-2 scaling protocols to various decentralized finance (DeFi) platforms and services.\n\n“Scaling layers like Optimistic and ZK-rollups are extremely important for the next big wave in Web3, mostly because they’re lowering entry barriers both in terms of the price per swap and user experience of value-added services built on top.”\n\nThe Symbiosis co-founder also highlighted his personal view that zero-knowledge rollups could outcompete Optimistic Rollup solutions like Arbitrum and Optimism. Avramov also believes it is crucial for cross-chain players and interoperability layers to support zero-knowledge solutions as soon as possible.\n\n“ZK represents an inevitable and natural evolution among scaling solutions.”\n\nSymbiosis has processed over $100 million in total transaction volume in stablecoins, serves over 12,000 unique wallet addresses, and has an average of 3,000 daily transactions.\n\nEthereum-scaling ZK-rollups continue to grab headlines in 2023. As previously reported by Cointelegraph, Ethereum layer-2 scaling platform Polygon released its zkEVM to mainnet beta, allowing developers to deploy smart contracts with increased finality and lower costs.\n\nThe scaling technology is not only limited to Ethereum or other smart contract blockchains. Swiss-based nonprofit ZeroSync Association is currently developing zero-knowledge proof tools that will allow Bitcoin (BTC) users to expedite the process of verifying individual blocks and, eventually, the entire blockchain.\n\nMagazine: Crypto audits and bug bounties are broken: Here’s how to fix them"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbWFnYXppbmUvemtyb2xsdXBzLWVuZGdhbWUtc2NhbGluZy1ibG9ja2NoYWlucy1wb2x5Z29uLW1pZGVuLWZvdW5kZXIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "ZK-rollups are 'the endgame' for scaling blockchains: Polygon Miden founder - Cointelegraph",
        "content": "ZK-rollups are the hottest thing in Ethereum right now, having seemingly appeared out of nowhere in late 2018 to fundamentally reshape the “Eth2” plan to scale via sharding alone.\n\n\n\nZero-knowledge, or validity proof rollups, essentially perform the computations for many thousands of transactions away from Ethereum and then write a tiny cryptographic proof back to the blockchain that verifies those transactions were performed correctly. It’s much faster and cheaper than using the base layer and has the potential for virtually unlimited scaling.\n\nTo an outsider, it looked like the technology went from 0 to 100 in a couple of years, but from the perspective of Polygon Miden founder Bobbin Threadbare, it doesn’t seem fast enough.\n\n“Your internal perception is that it’s moving slowly,” he says. “People say, ‘We’re going to be doing this in a year,’ and it takes longer because people overestimate [how quickly it can be done].”\n\n“But if you take a step back out of your own bubble, I do think that the tech is moving at an amazing pace. A lot of the things we’re doing now did not exist 10 years ago — or even maybe like eight years ago — they were just theoretical concepts.”\n\n“So, it’s not often that you see that something goes from pure theory — that is probably not practical or ‘maybe we can do it in the long term future’ — to ‘OK, we’re doing it now, and there are now billions of dollars riding on it.’”\n\nPolygon Miden at StarkWare Sessions\n\nMagazine catches up with Threadbare at the StarkWare Sessions in Israel. Since Polygon Miden is a competing ZK-rollup solution to StarkWare’s tech, this is a little like interviewing the CEO of Pepsi at a Coca-Cola convention. But it turns out zero-knowledge proofs are not as cutthroat as sodas.\n\n\n\n“On the technical side, there is a lot of collaboration,” Threadbare explains. “If you follow Twitter, you may get an impression that people are at each other’s throats all the time, but you know, it’s Twitter more than anything.”\n\nHe points out that all of the projects are building open-source technology (or plan to make it open-source). “We’re not building like Web2 walled gardens here,” he says, adding that various projects “don’t necessarily perceive other rollups as their technical competitors; we learn from each other more.”\n\nPolygon’s crack team of co-founders, including Threadbare back row, second from the right. (Twitter)\n\nPolygon is the 8th-most valuable project\n\nPolygon’s MATIC became the eighth-most valuable cryptocurrency in the world thanks to its current Ethereum scaling solution, but Polygon’s founders knew ZK-rollups could potentially render the network obsolete and spent some of their massive war chest on a ZK tech acquisition and hiring spree.\n\nThe Polygon team’s approach is essentially to throw a lot of stuff at the wall and see what sticks. Their zkEVM project has just launched on mainnet in beta, and it enables any Ethereum Virtual Machine-compatible project to scale on its new network.\n\nOther ZK flavors at Polygon include Zero (recursive scaling), Hermez 2.0 (an EVM-compatible solution focused on decentralization and a proof-of-efficiency consensus) and Nightfall (Optimistic Rollups meet zero-knowledge cryptography).\n\nThreadbare, who was working for Facebook at the time, was headhunted to develop his open-source ZK technology into Miden.\n\n“This strategy made sense to me; the space is very early,” he says. “I mean, in all honesty, they didn’t even require that I use STARKs, or SNARKs, or anything.” STARKs (Scalable Transparent Argument of Knowledge) and SNARKs (Succinct Non-Interactive Argument of Knowledge) are the two main types of ZK proof systems.\n\n“They were very open to whatever technology because nobody had the answer. Hopefully, now we have more of an answer than we did like a year or two years ago.”\n\nA great overview of Miden design from @grjte https://t.co/4wH0uMeP4C — Bobbin Threadbare (@bobbinth) March 22, 2023\n\nWhat is Polygon Miden?\n\nPolygon Miden is essentially the Polygon version of StarkNet. It enables a bunch of transactions to be processed off the main blockchain, and then a validity proof demonstrating the transactions are computed correctly, to be written back as a single transaction on Ethereum.\n\nSTARKs have some advantages over SNARKs in that less trust is required for the setup, and they’ll be resistant to quantum computer attacks. However, STARKs have much, much larger validity proof sizes, which is more expensive to write back to Ethereum.\n\nIn another similarity to StarkNet, which uses the Cairo programming language and virtual machine instead of Solidity and EVM, Miden uses its own virtual machine. For both projects, this is a gamble, as it makes it more difficult for Ethereum projects to port over to the rollup. On the other hand, it means Polygon Miden can scale faster and further by enabling it to escape Ethereum’s constraints.\n\n“Within Polygon, we do think about How do we expand Ethereum?, and there are multiple dimensions,” Threadbare says. “So, scaling is one dimension but also features and other things that are not easy to do on Ethereum, such as privacy and parallel processing, would be another dimension, and this is where Miden comes in.”\n\nMagazine later asks StarkNet co-founder Eli Ben-Sasson for his assessment of his competitor, whom he’s known since the first StarkWare Sessions four years earlier.\n\n\n\n“I think Miden is amazing,” says Ben-Sasson. “I have a lot of respect for all of those working within the framework of general validity proofs.”\n\n“Having said that, and with all due respect, I do think that, as far as VMs and feature-laden compute frameworks go, I think that Cairo is better. And I’ve said so to Bobbin.”\n\n\n\nThreadbare isn’t a cryptographer; he’s a hands-on builder and says the instant he learned about ZK-rollups, he knew it would be the answer to blockchain scaling because it removes one of technology’s greatest inefficiencies — requiring everyone on the network to process each transaction.\n\n“Once I learned about ZK tech, it became almost obvious that this is going to be the end game. Because in the blockchain, basically, you have the same computation that everybody has to reexecute. And this is so wasteful. When you see this technology where you only have to execute once and everybody can verify your computation exponentially faster, that’s almost like an obvious thing that needs to be done.”\n\nThreadbare operates under a pseudonym but is not a shadowy anon coder. (Supplied)\n\nRun smart contracts locally with Polygon Miden\n\nWith Polygon Miden, anyone will be able to run a smart contract locally and just send the proof to the network, which enables transactions to be run in parallel, rather than sequentially. If Polygon Miden had stuck with the EVM, that would be very difficult, and that limits throughput.\n\nWith Ethereum currently processing a dozen or so transactions a second, that’s not a problem, but when TPS ticks over into the thousands, it will be. “You need to be able to process transactions in parallel because, in a single thread, there’s only so much you can do,” he says. “I don’t think you can go much more than a few thousand TPS without parallelizing things.”\n\n“Being able to execute transactions locally means you can run arbitrarily complex computation, and it places almost no burden on the network,” he explains, pointing out that running a 3D physics engine is impossible on Ethereum right now, but will become possible with Polygon Miden. “The design space opens up,” he says. “That enables a bunch of new use cases, but it also helps with privacy if I don’t have to actually reveal the computation.”\n\nLike zkSync Era and StarkNet, the plan is to launch with a centralized prover and then gradually decentralize. Eventually, all of Polygon’s ZK solutions will become interoperable, with MATIC remaining the key token. However, native account abstraction means users could pay with other major tokens, too.\n\nWho is Polgon Miden founder Bobbin Threadbare?\n\nThreadbare (not his real name) was born in the Republic of Georgia in the dying days of the USSR in the 1980s. He moved to the United States when he was 17 to study computer science in San Diego, later attending business school at the University of Chicago. He was a consultant for five years before he launched a Web2 startup that calculated user trustworthiness and reputation scores for things like P2P transactions. He started exploring blockchain in 2018 as a way to avoid having to store a large database of user information.\n\n“Self-sovereign identity is one of the things that was very interesting to me,” he says.\n\n“And then I got very deep into the technical aspects and then came across zero-knowledge proofs. Once I understood what they can do, the identity use case wasn’t all that interesting anymore. I thought there are much bigger and more interesting things you can do with them.”\n\nHe stumbled across a blog about STARKs by Ethereum co-founder Vitalik Buterin, and that set him off down the rabbit hole. “He actually had a code written that demonstrates a very basic proof-of-concept of how it works — and that was, for me, very, very useful.”\n\nThreadbare took the code and rewrote it in another language so he could understand how it worked from the inside out. A born tinkerer, he started improving aspects to make them more general. Before long, he’d built a basic general-purpose prover for STARKs and posted it on Eth Research.\n\nThreadbare’s post on Eth Research back in June 2019. (Eth Research)\n\n“A lot of people were interested in zero-knowledge proofs at that time, but there were not a lot of tools, especially around STARKs. And I just got lucky in the thing that I picked to learn and build on because it fascinated a bunch of people.”\n\n“Even Vitalik himself basically sent me a message on Eth Research, saying, ‘Hey, who are you? What are you doing?’” It was Buterin who introduced him to StarkWare, and they invited him along to the first StarkWare Sessions four years ago.\n\nThreadbare started creating ZK tools and libraries. He developed the AirScript and AirAssembly domain-specific languages, which in turn led him to develop the Distaff Virtual Machine in early 2020 so people could code without having to learn those new languages.\n\nFacebook experimented with ZK-rollups\n\nBut as the pandemic started, he took up a job as a core ZK researcher for Facebook, working on the Libra cryptocurrency project. Part of the appeal was working alongside and learning from “real” cryptographers, and he helped build the open-source Winterfell STARK prover and verifier.\n\nFacebook didn’t actually need one or plan to use it. “I don’t want to say that it was just for the hell of it,” he says. “The thought was it was going to be used at some point in time. But it was probably fairly clear this is not going to be used in the next two to three or maybe even five years time frame.”\n\nUltimately, regulators did not approve of the social media giant launching a private currency, and Libra transformed into Diem and then quietly disappeared. Around the same time in 2021, Polygon co-founder Mihailo Bjelic was assembling his crack team of ZK developers and remembered the shadowy anon who’d posted a bunch of useful ZK tech like Distaff on Eth Research. So, he got in touch, totally unaware Threadbare was working at Facebook.\n\nFor his part, Threadbare was totally unaware Polygon even existed but started holding regular calls every couple of weeks with Bjelic to talk about their scaling plans and sketch out a possible collaboration.\n\nSo you’ve heard all about Polygon zkEVM…\n\n\n\nBut are you ready for Polygon Miden?💜 pic.twitter.com/DuyB3vfIni — Narb (@NarbTrading) March 6, 2023\n\nPolygon zkEVM? Nope, Polygon Miden is something else\n\nThey discussed building a ZK EVM, but Threadbare was keen to use his own virtual machine and combine STARKs with the power of recursion. That’s where you take a bunch of validity proofs, each representing a bundle of transactions, and produce one validity proof that proves all other validity proofs were done correctly. Suddenly, the fact the STARK-proof size is 50–100 times bigger than a SNARK-proof size was a lot less important.\n\n“That’s one of the reasons I went the virtual machine route because if you have the VM, it’s much easier to have this infinite recursion because if you think about it, when you have a virtual machine that is Turing-complete, it basically it can execute any program.”\n\n“You just write a program that verifies itself, and you kind of have infinite recursion at this point in time. And that was appealing to me.”\n\nThis talk of infinite recursion recalls Declan Fox, product manager for rollups at ConsenSys, who told Magazine last year that ZK-rollups and recursion meant it was “theoretically possible” for the entire world’s financial system to run on Ethereum.\n\nInfinite scaling is unfortunately still limited by data availability on Ethereum — which refers to how much data needs to be, and can be, written back to the chain. The new rollup-focused roadmap will increase the amount of data each block can carry by 160 times. Even that probably won’t be enough.\n\n“There are still limitations like nothing is infinite,” he says. “Assuming the blockchain and the crypto space succeeds… the demand for TPS will be hundreds of thousands or maybe millions of TPS eventually, so I don’t know if the base layer will always be able to provide this much data availability.”\n\nBut he’s very hopeful we’ll see a huge amount of adoption within the next 10 years.\n\n“Hopefully, if we are successful, Ethereum will be the most secure base layer, and there will be a thriving rollup ecosystem that caters to different things, and hopefully, Polygon will be a big part of that ecosystem.”"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDQvMTEvaXMtdGhlLWFudGljaXBhdGlvbi1vZi1zaGFuZ2FpLXVwZ3JhZGUtZHJpdmluZy1ldGgtcHJpY2UtdG93YXJkcy0yay_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Is The Anticipation of Shangai Upgrade Driving ETH Price Towards 2k? - Crypto Times",
        "content": "The world’s second-largest cryptocurrency Ethereum is increasingly in favor of investors as ETH price continues to slide towards the $2,000 mark as the Shanghai upgrade is just one day away.\n\nThe cryptocurrency market looks positive as its crypto cap reached $1.23 trillion for the first time in 2023 with an overnight gain of 4.15%. The key factor behind this rapid gain is Bitcoin rising above $30,000.\n\nThe most prominent digital asset Bitcoin is up 6.5% thus the price of Ethereum is also up by 3.58% with the currency trading at $1,923 at press time. Meanwhile, the trading volume shows a 61% increase at $9.7 billion in the last 24 hours.\n\nEthereum Shanghai upgrade, Ethereum’s latest hard fork, scheduled for tomorrow, implements major Ethereum Improvement Proposal (EIP)-4895 and many others and also enables validators to withdraw nearly $18 million worth of ETH tokens.\n\nWith the current ETH prices, more than half of the staked ETH (9.7 million out of 17.9 million) is currently at a loss. pic.twitter.com/232BRTOIb7 — CryptoQuant.com (@cryptoquant_com) April 5, 2023\n\nHowever, analysts are assuming that, after the Shanghai upgrade, selling may occur due to the increase in withdrawals. On the other hand, an increase in BTC price washes away all the negative news and could take ETH price towards $2,000 soon.\n\nHowever, Ethereum’s price has been bullish since November as the price action formed an ascending parallel channel. At that point, the bulls attempt to propel ETH towards the key $2,000 level at the upper boundary of this channel.\n\nSpecifically, the 20-day simple moving average has been an unbreakable support area for the past several days. Conditions seem favorable for the $2K region, and the Shanghai upgrade could accomplish this minor feat tomorrow.\n\nSupport levels – $1700 and $1400\n\n– $1700 and $1400 Resistance levels – $2000 and $2500\n\nDon’t miss out on the latest developments in the world of crypto. Subscribe to The Crypto Times and stay ahead of the curve!!"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMipAFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9ldGhlcmV1bXMtcmVjb2duaXRpb24tYXMtYS1jb21tb2RpdHktYm9vc3RzLWJ1bGxpc2gtbWFya2V0LWFsb25nc2lkZS1iaXRjb2luLWRvZ2V0dGktbWVtZS1jb2lucy1wcmVzYWxlLWV4cGVyaWVuY2VzLXN1cmdpbmctZGVtYW5kL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Ethereum's Recognition as a Commodity Boosts Bullish Market Alongside Bitcoin, Dogetti Meme Coin's Presale ... - Analytics Insight",
        "content": "Disclaimer: Any financial and crypto market information given on Analytics Insight are sponsored articles, written for informational purpose only and is not an investment advice. The readers are further advised that Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Conduct your own research by contacting financial experts before making any investment decisions. The decision to read hereinafter is purely a matter of choice and shall be construed as an express undertaking/guarantee in favour of Analytics Insight of being absolved from any/ all potential legal action, or enforceable claims. We do not represent nor own any cryptocurrency, any complaints, abuse or concerns with regards to the information provided shall be immediately informed here."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY3J5cHRvdGlja2VyLmlvL2VuL2NvbXBhcmluZy1ldGhlcmV1bXMtbGF5ZXItMi1zb2x1dGlvbnMtemtzeW5jLWFyYml0cnVtLWFuZC1vcHRpbWlzbS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Comparing Ethereum's Layer 2 Solutions: A Look at zkSync, Arbitrum, and Optimism - CryptoTicker.io - Bitcoin Price, Ethereum Price & Crypto News",
        "content": "Ethereum has been facing scalability issues, high gas fees, and network congestion. To address these problems, several projects are developing layer 2 solutions that aim to improve the performance and user experience of Ethereum without compromising its security and decentralization. Three of the most prominent layer 2 solutions are zkSync, Arbitrum, and Optimism. In this article, we will compare these solutions in terms of their advantages, disadvantages, and overall performance.\n\nzkSync:\n\nzkSync is a layer-2 scaling solution for Ethereum that uses zero-knowledge proofs to enable fast and cheap transactions without compromising security or decentralization. zkSync aims to bring the benefits of blockchain technology to mainstream users by providing a user-friendly interface, low fees, high throughput, and privacy guarantees. zkSync supports smart contracts, NFTs, and various tokens, and is compatible with the Ethereum Virtual Machine (EVM). zkSync also offers a developer-friendly environment with SDKs, APIs, and documentation to help developers build and deploy scalable applications on zkSync.\n\nAdvantages:\n\nzkSync can reduce the amount of data that needs to be stored on Ethereum, which lowers the gas costs and increases the throughput.\n\nzkSync can achieve up to 2000 TPS and sub-cent fees per transaction.\n\nzkSync supports smart contracts written in Solidity.\n\nDisadvantages:\n\nzkSync relies heavily on ZKPs, which can be complex and expensive to implement.\n\nzkSync may face issues with privacy and data availability.\n\nArbitrum:\n\nArbitrum is a layer-2 blockchain for Ethereum using optimistic rollups as scaling technology. It processes transactions on its proprietary sidechain and relays the new chain state to the Ethereum mainnet. Arbitrum aims to improve Ethereum’s performance by providing a more efficient and scalable environment for decentralized applications and smart contracts. Arbitrum benefits from the security and compatibility of Ethereum, but reduces the fees and congestion that users face on the mainnet. Arbitrum has attracted many developers and projects to its ecosystem, and has launched its own token, ARB, which is used for governance and incentives.\n\nAdvantages:\n\nArbitrum can reduce the amount of computation that needs to be done on Ethereum, which lowers the gas costs and increases the throughput.\n\nArbitrum can achieve up to 4500 TPS and sub-dollar fees per transaction.\n\nArbitrum supports smart contracts written in Solidity or any other language that compiles to EVM bytecode.\n\nDisadvantages:\n\nArbitrum may face issues with data availability and security.\n\nArbitrum’s challenge period can be up to one week, which can lead to slower finality and higher latency.\n\nOptimism:\n\nOptimism is a layer-2 scaling protocol for the Ethereum network. The scaling solution works by moving transactions and computations from layer-1 (L1) onto a second layer, thus reducing transaction fees and increasing network throughput. Optimism is compatible with the Ethereum Virtual Machine (EVM), which means that any smart contract or decentralized application (dApp) that runs on Ethereum can also run on Optimism with minimal changes. Optimism uses a technique called optimistic rollups, which are batches of transactions that are executed on the second layer and periodically posted to the main chain. Optimism also employs a fraud-proof system, which allows anyone to challenge an invalid transaction and revert it if proven wrong.\n\nAdvantages:\n\nOptimism’s OVM is compatible with EVM, making it easier for developers to write smart contracts.\n\nOptimism has a shorter challenge period than Arbitrum, which leads to faster finality and lower latency.\n\nOptimism can achieve up to 1000 TPS and sub-dollar fees per transaction.\n\nDisadvantages:\n\nOptimism’s OVM removes some opcodes that are not necessary for layer 2 execution, which may limit its functionality.\n\nOptimism may face trade-offs in terms of security due to its design choices.\n\nConclusion\n\nAt the end of the day, it’s clear that zkSync, Arbitrum, and Optimism are all promising solutions for Ethereum’s scalability and cost issues. Each one has its own unique features and drawbacks, so it really depends on what the user is looking for.\n\nIt’s pretty impressive how the Ethereum community is constantly finding ways to improve the platform’s performance and user experience, while still keeping its core values of security and decentralization intact. As Ethereum continues to evolve, we’re excited to see what new developments will come up in the world of layer 2 solutions. Who knows what the future of decentralized finance and other Ethereum-based applications will look like!\n\nMore from DeFi"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiMGh0dHBzOi8vYml0Y29pbmtlLmlvLzIwMjMvMDQvaW50cm9kdWNpbmctemstZXZtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "MILESTONE: The Polygon ZK-EVM Can Now Scale Ethereum Infinitely, Says Polygon - bitcoinke.io",
        "content": "Polygon Labs, the Ethereum Layer 2 scaling solution, has launched Polygon zkEVM Mainnet, termed as an Ethereum scaling breakthrough that will make it possible for Ethereum to outpace Visa in terms of transaction throughput.\n\nToday, Polygon Labs is announcing that Polygon zkEVM is fully open-source. Every single component is licensed with AGPL v3, including the zkProver, which is where all of the ZK magic happens 🪄 More: https://t.co/H124ATcuWJ pic.twitter.com/adceTbOVMq — Polygon (Labs) (@0xPolygonLabs) March 27, 2023\n\nIn what Polygon Labs describes as a watershed moment for the Web3 industry, the launch of the zkEVM solution presents a resolution to the scaling problems such as lack of speed and throughput.\n\n“This solution has the capability to scale Ethereum infinitely, allowing the network to surpass the transaction throughput of major payment processors such as Visa,” said Polygon in a release.\n\nThe launch on mainnet comes almost a year since the zkEVM was first introduced in a testnet back in July 2022.\n\nzkEVMs, which are ZK rollups designed for compatibility with the Ethereum Virtual Machine, are considered the holy grail of scaling technology.\n\n“They are the only solution that can achieve three major blockchain design goals: scalability, security that is inherited directly from Ethereum itself, and a seamless experience for developers building on Ethereum.”\n\nZero-knowledge rollups (ZK-rollups) themselves are layer 2 protocols that bundle (or ‘roll-up’) hundreds of transfers off-chain and generate a cryptographic proof (or validity prooof) which gets posted on L1 drastically simplifying the process.\n\nPolygon Labs also announced that all aspects of Polygon zkEVM are now open-source under an AGPL v3 license. Open-source licenses allow developers to share their code and encourage collaboration and innovation within the developer community.\n\nAccording to Polygon, over 50 of the world’s biggest Web2 and Web3 companies have committed to building on Polygon zkEVM, including Spanish telecom giant, Telefónica, which will use the tech to improve the privacy and confidentiality of company data in enterprise use cases.\n\nJose Luis Nuñez, Head of Blockchain at Telefónica Tech said:\n\nTelefónica Tech, leading company in digital transformation, and leaders in the development of blockchain solutions for enterprises, will be one of the first companies to deploy its framework, TrustOS, for notarisation and traceability solutions on top of the zkEVM Mainnet to improve privacy and confidentiality of companies and user’s data in enterprise use cases.\n\nOther platforms adopting the zkEVM include:\n\nLens\n\nAavegotch i\n\nOvix\n\nQuickswap\n\nEtherScan\n\nPhantom\n\nMidnight Society\n\nLuganodes\n\nCeler\n\nGameSwift\n\nYeeha Games\n\nWhile several teams in the Web3 community are working on ZK rollups, Polygon indicates it has several advantages, not least being the first to launch a beta version on mainnet:\n\nIt is the only leading full-featured, open-source zkEVM with a complete, working, and audited prover\n\nIt’s EVM-equivalent, meaning existing developer tools on Ethereum, existing wallets, infrastructure, etc., can be used seamlessly, unlike ‘EVM-compatible’ alternatives, which require existing developer tools and smart contracts to be modified to work creating incompatibility and increasing the risk of security vulnerabilities\n\nWithdrawal times back to Ethereum take 30 – 60 minutes on Polygon zkEVM compared to a 24-hour withdrawal delay for zkSync Era, for example\n\nPolygon is the first to launch a mainnet beta making it the most advanced solution available. Alpha mainnets test basic functionality in a closed environment while beta mainnets are more stable and feature-rich\n\n“Today’s launch is an incredible milestone and the beginning of a new chapter for blockchain technology, fulfilling Ethereum’s original promise of becoming a true ‘world computer’ and creating a fairer, more egalitarian internet for all” said Mihailo Bjelic, Co-Founder of Polygon.\n\n_________________________________________\n\nFollow us on Twitter for the latest posts and updates\n\nJoin and interact with our Telegram community\n\n_________________________________________\n\n_________________________________________"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2NyeXB0by9ldGhlcmV1bS1iYXNlZC1mcmF4LWZpbmFuY2UtaXMtdXAtNjQtdXBzaWRlL9IBT2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2NyeXB0by9ldGhlcmV1bS1iYXNlZC1mcmF4LWZpbmFuY2UtaXMtdXAtNjQtdXBzaWRlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Ethereum-Based Frax Finance (FXS) Is Up 64%, Is There Still Opportunity? - NewsBTC",
        "content": "In the last seven days, the Ethereum-based project Frax Finance is the second biggest winner within the top 100 cryptocurrencies by market cap. With a price increase of 64%, the FXS token is only behind Decentraland (MANA), which has surged 76% within the same period.\n\nWith the massive pump, Frax Share Token (FXS) has moved up to the 63rd position in the ranking by market cap and has seen a bullish rally since January 2. While the price was $4.09 on that day, FXS was at $9.06 at press time.\n\nWhen the price briefly rose above $10 yesterday, the gain was over 140% since January 2. In the 1-day chart, FXS has broken the resistance zone established in May last year between $7.40 and $8.20 and is now facing resistance at $10.02.\n\nThe first two attempts to break this resistance have failed for now, so a retest of the former resistance zone could be on the cards before the Frax token continues to rally. This would also be a much-needed correction, as the RSI on the daily chart is still at 83.\n\nThe weekly chart confirms the extremely bullish picture for the FXS token. Once the price consolidates in the daily chart and subsequently breaks the $10.02 level, the way would be clear for a rise toward $13.\n\nThe price level served as strong support in November and December 2021, before FXS rallied to an all-time high of $52.80 in January 2022.\n\nWhat Do The Fundamentals Of Frax (FXS) Suggest?\n\nAs NewsBTC reported, Frax Finance is benefiting from the liquid staking (LSD) narrative that emerged earlier this year and has since caused all LSD tokens to skyrocket. However, it is questionable whether the hype can continue for a longer period of time.\n\nAs Jordi Alexander, CIO of Selini Capital explained, the Ethereum Shanghai hard fork could be in for a rude awakening:\n\nETH staking is going to explode after the Shanghai fork allows withdrawals- esp. now as Metamask integration makes it easy for Dummies. But LSD tokens are overvalued in anticipation of this – revenue is not going to change much, bc reward yields will plunge as staking % goes up.\n\nBut analyst Thor Hartvigsen doubts whether the same will be true for Frax Finance. The analyst shared five reasons via Twitter why Frax Finance will be a key player in DeFi this year.\n\nThe first reason is that Frax offers the largest APR among liquid staking providers at 6-10%, while its nearest competitor is only around 5%. The main reason for this difference is that frxETH can be used in DeFi applications such as the ETH/frxETH Curve pool.\n\nThe second reason Hartvigsen cites is that Frax Finance has made extensive improvements since its inception, in particular, it has improved its model (FRAXV2) and “has become a huge liquidity engine with a range of products.”\n\nThese include algorithmic market operations (AMOs), FraxSwap, FraxLend, FraxFerry (native bridge design), ETH liquid staking, and FPI (US inflation rate linked stablecoin).\n\n¤ Frax Finance has been crushing it lately🔮 And with their growing ecosystem of DeFi products, $FXS has a TON of upside in 2023. Here are 5 reasons why @fraxfinance will be a central player in DeFi this year and how you should be taking advantage of this 🧵 1/19 pic.twitter.com/epFMEgY4HF — Thor Hartvigsen (@ThorHartvigsen) January 17, 2023\n\nThird, it’s the AMOs that make Frax special, as they don’t just let collateral sit dormant, but use it in various DeFi applications. It also offers some of the highest stablecoin yields, which significantly strengthens FXS by increasing liquidity on Curve.\n\nLast but not least, Hartvigsen points to Frax’s roadmap to reach a market cap in the trillions and become the risk-free underlying in DeFi. The analyst touts the Fed Master Account (FMA) as the biggest innovation:\n\nA FMA is dollars deposited directly into the FED treasury’s ledger and grants access to US Treasuries. The FED gives a status on the ledger once a day which essentially is the ultimate audit. This would make FRAX one of the closest things to a ‘risk free dollar’. It’s a very ambitious goal however and likely a few years away.\n\nFeatured image from Inside Out, Charts from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZW4uZXRoZXJldW13b3JsZG5ld3MuY29tL2p1c3Rpbi1zdW4tYXJyZXN0LXJ1bW9ycy1pbi1ob25nLWtvbmcv0gFLaHR0cHM6Ly9lbi5ldGhlcmV1bXdvcmxkbmV3cy5jb20vanVzdGluLXN1bi1hcnJlc3QtcnVtb3JzLWluLWhvbmcta29uZy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Justin Sun Denies Rumors Of His Arrest In Hong Kong - Ethereum World News",
        "content": "Tron founder Justin Sun has denied the rumors claiming that he got arrested in Hong Kong.\n\nThe rumors started circulating on Twitter earlier today after multiple influencers reported Sun’s arrest.\n\nRumors of the Tron founder’s arrest led to the network’s native cryptocurrency tanking nearly 3%.\n\nCrypto entrepreneur Justin Sun has denied all rumors about his arrest in Hong Kong. Reports claiming that the Tron founder had been arrested in the island city started circulating on Twitter earlier today. The rumors led to considerable volatility in Tron network’s native cryptocurrency TRX.\n\nTRX tanks 3% on rumors of Justin Sun’s arrest\n\nThe rumors started with crypto influencers on Twitter who reported that Justin Sun was arrested in Hong Kong earlier today. While the reason for Sun’s arrest was not mentioned, the tweet claimed that the authorities were holding the Tron founder at Michinawanamun Station in the island city. Crypto Bitlord on Twitter cited his sources on the ground when he tweeted the news of the arrest. The tweet was followed by several other accounts on Twitter sharing the same news.\n\n4 — H.E. Justin Sun 孙宇晨 (@justinsuntron) April 11, 2023\n\nJustin Sun took to Twitter soon after the rumors started circulating and appeared to clarify that the news of his arrest was fake. Sun’s response to the rumors was one single number, “4”. The number has previously been used by Binance CEO Changpeng Zhao to indicate fear, uncertainty, doubt (FUD), and fake news. Sun did not provide any further clarification. Sun’s denial of the arrest report led to considerable backlash on Crypto Bitlord, particularly from the Tron community.\n\n“This could be fake. Don’t fall for this. If he was real, he would get on the camera and say something like today’s date, say the (news)paper. I don’t trust this, I think something is up.” Crypto Bitlord’s response to Justin Sun’s “4” tweet.\n\nMeanwhile, the reports of his arrest induced considerable volatility in Tron network’s native cryptocurrency TRX. The cryptocurrency tanked nearly 3% from its daily high, falling as low as $0.065, before pulling back up to $0.67. At the time of writing, TRX was trading at $0.0665."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL3RlY2hwb2ludC5hZnJpY2EvMjAyMy8wNC8xMC9iaXRjb2luLWJ0Yy1hbmQtZXRoZXJldW0tZXRoLXByaWNlcy10cmFkZS1mbGF0LWNvbGxhdGVyYWwtbmV0d29yay1jb2x0LWZvcmVjYXN0ZWQtZm9yLTM1MDAtcHJlc2FsZS1yZXR1cm5zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC) and Ethereum (ETH) prices trade flat, Collateral Network (COLT) forecasted for 3500% presale returns - Techpoint Africa",
        "content": "Investors who understand the workings of market cycles within crypto will be more profitable than those who do not. Bitcoin (BTC) and Ethereum (ETH) prices have been trading flat after recent rallies, which means only one thing, altcoin season has begun. New projects have huge potential to rip, and one, Collateral Network (COLT), has already been forecast to gain 3,500% in its presale.\n\n>>BUY COLT TOKENS NOW<<\n\n\n\nBitcoin (BTC)\n\n\n\nBitcoin (BTC) has thrived in the past months as the failings of fractional reserve banking have been highlighted to the world. With decreasing confidence in the dollar, more and more people have begun to look to Bitcoin (BTC). This application-specific hard money may unseat gold as the world’s reserve currency in the coming decade.\n\n\n\nBitcoin (BTC) began in 2009 following the global financial crisis, and the same landscape which birthed Bitcoin (BTC) is helping it gain traction currently. Bitcoin (BTC), after surging upwards, has stalled as money floods into altcoins such as Collateral Network (COLT), and investors would be wise to rotate. Price predictions from analysts vary enormously, with some predicting that Bitcoin (BTC) will trade as high as $180,000 in 2025, whereas more conservative estimates put Bitcoin (BTC) trading between $77,000 and $92,000 in 2025.\n\n\n\n\n\n\n\nEthereum (ETH)\n\nWith the Shanghai upgrade for Ethereum (ETH) scheduled on the 12th of April, many investors have grown increasingly cautious about holding Ethereum (ETH). The Shanghai upgrade will enable Ethereum (ETH) staking withdrawals, and analysts predict that Ethereum (ETH) withdrawals will unleash heavy sell pressure.\n\n\n\nHowever, more bullish analysts and capital fund managers such as Chris Burnisky predict that Ethereum (ETH) withdrawals going live with lead to a greater influx of staked Ethereum (ETH). Regardless of the upgrade, traders should be cautious and, instead of holding Ethereum (ETH), should take advantage of altcoin season and projects like Collateral Network (COLT), which continue to rip to the upside.\n\n>>BUY COLT TOKENS NOW<<\n\n\n\nCollateral Network (COLT)\n\n\n\nCollateral Network (COLT) has generated a buzz not seen in the crypto landscape for a long time. This challenger lender unlocks liquidity for real-world assets. The growth and integration of real-world assets into DeFi have been an expected growth driver amongst venture-capital firms for several months. Collateral Network (COLT) makes this possible through its use of 100% asset-backed NFTs.\n\n\n\nAsset owners can collateralize their assets with Collateral Network (COLT), anything from real estate and vintage cars to fine art and luxury watches. Collateral Network (COLT) mints an NFT 100% backed by the asset, which then becomes liquid. The holder can access the crowdsourced liquidity through fractionalizing the NFT.\n\n\n\nThe COLT token powers this entire ecosystem and grants discounts to borrowers and lenders, and also enables access to the auction where distressed assets will be sold off. On top of this, it can be staked for passive income, making it a DeFi token with excellent utility cases.\n\n\n\nCollateral Network (COLT) aggressively expands liquidity flows and lending potential within DeFi. For this reason, analysts have already forecast a 3,500% growth in its presale. Still, many expect it will rally much harder when it launches on centralized exchanges, and early holders could see a 100X on their initial investment.\n\n\n\n\n\nFind out more about the Collateral Network presale here:\n\nWebsite: https://www.collateralnetwork.io/\n\nPresale: https://app.collateralnetwork.io/register\n\nTelegram: https://t.me/collateralnwk\n\nTwitter: https://twitter.com/Collateralnwk"
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9hcmJpdHJ1bS1lY29zeXN0ZW0taXMtdGhlLXNvbHV0aW9uLXRvLWFsbC15b3VyLWV0aGVyZXVtLXdvZXMtYmlnLWV5ZXMtY29pbi1raWxscy1lbS13aXRoLWN1dGVuZXNzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Arbitrum Ecosystem Is The Solution To All Your Ethereum Woes, Big Eyes Coin Kills 'Em With Cuteness - Analytics Insight",
        "content": "Disclaimer: Any financial and crypto market information given on Analytics Insight are sponsored articles, written for informational purpose only and is not an investment advice. The readers are further advised that Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Conduct your own research by contacting financial experts before making any investment decisions. The decision to read hereinafter is purely a matter of choice and shall be construed as an express undertaking/guarantee in favour of Analytics Insight of being absolved from any/ all potential legal action, or enforceable claims. We do not represent nor own any cryptocurrency, any complaints, abuse or concerns with regards to the information provided shall be immediately informed here."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9zaWdudXB0b2tlbi1jb20tYm9vc3RzLW1pbGxpb25haXJlLWNhbXBhaWduLWFtaWQtZnJlbmNoLWVtYnJhY2Utb2YtY3J5cHRvY3VycmVuY2llcy1saWtlLWJpdGNvaW4tYW5kLWV0aGVyZXVtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "SignUpToken.com Boosts Millionaire Campaign Amid French Embrace of Cryptocurrencies like Bitcoin and Ethereum - Analytics Insight",
        "content": "Cryptocurrency is facing pressure from US regulators after the collapse of FTX and the closure of crypto-oriented banks. Silvergate Capital, for example, lost extensively in the wake of the FTX crash, as there was a bank run with over 60% of deposits withdrawn in one quarter. Following this, Silvergate announced its wind-down and other crypto-focused banks such as Signature also crashed. Major cryptocurrencies like Bitcoin and Ethereum have also been affected, with Bitcoin currently trading at around $28,409 and Ethereum at $1,810 per coin. As we analyze this, we will also assess the emergence of an innovative new cryptocurrency called SignUp Token.\n\nU.S Cracks Down On Cryptocurrency\n\nThe US Commodity Futures Trading Commission (CFTC) has sued Binance for violating trading and derivative laws by offering derivative trading services to US customers without a derivative license. This lawsuit, filed on March 27, accuses the crypto exchange of elevating commercial success over complying with regulations and discarding US federal laws while strengthening its customer base in America. This move represents a growing suspicion among US regulators that cryptocurrency’s unregulated nature cannot be sustained and must be brought into line.\n\nBig French Whopper For Cryptocurrencies\n\nAmid this uncertain regulatory environment, France has emerged as a cryptocurrency haven. Burger King, for example, now accepts cryptocurrency payments through its partnership with Instpower, which deploys power bank rental machines across the different store locations in Paris. This underlines the stark contrast between France and the US in their confidence in cryptocurrency. Such embracing could help cryptocurrencies maintain their trading levels, and France’s sizable market for investment could spark a reversal in fortunes.\n\nSignUp Token Is A Radical Yet Simple Idea\n\nAn intriguing new crypto initiative, SignUp Token, is also worth noting. Unlike traditional approaches that require presales or an initial coin offering (ICO), SignUp Token seeks to gain one million email sign-ups before it enters the crypto exchanges. The advantage of this approach is that those who register their emails get a healthy headstart over other investors, as they will be the first to know when the new token will enter the crypto market.\n\nIn conclusion, the regulatory landscape for cryptocurrency is uncertain, with US regulators cracking down on the industry. However, France has emerged as a cryptocurrency haven that could potentially help cryptocurrencies maintain their trading levels and even reverse the recent downturn. Moreover, the innovative SignUp Token initiative offers a new approach to launching a crypto coin that could benefit investors. The future of cryptocurrency is uncertain, but with unique initiatives and welcoming markets, there is still hope for this digital finance economy.\n\nFor those interested in what SignUp Token has to offer, visit their website at signuptoken.com. This unique approach could potentially make someone a millionaire by simply signing up for an email newsletter.\n\nSignUp Token:\n\nhttps://signuptoken.com/\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmVxdWl0aS5jb20vc2MtZW4vbmV3cy9tYXJrZXQtaW5zaWdodHMvZXRoZXJldW1zLXNoYW5naGFpLXVwZ3JhZGUtd2hhdC15b3UtbmVlZC10by1rbm93L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Ethereum's Shanghai Upgrade: what you need to know — Equiti - Equiti Global",
        "content": "The upgrade includes smaller EIPs to reduce gas fees and more upgrades are expected later in 2023, including those for scalability and improving the Ethereum Virtual Machine\n\nThe Shanghai upgrade may impact the price of ETH, with concerns about flooding the market, but investors may not immediately withdraw due to potential losses\n\nEthereum's highly-anticipated Shanghai upgrade (EIP-4895), dubbed the Shapella upgrade, is set to occur on April 12, 2023. The hard fork is set to enable stakers and validators to withdraw assets from the Beacon Chain, which is a major development associated with the upgrade. The Shapella upgrade is a combination of two Ethereum Improvement Proposals: Shanghai and Capella. With staked Ether accounting for roughly 16 million coins, or a seventh of the total supply, this upgrade has significant implications. The current value of all staked Ether stands at over $30 billion.\n\nEthereum upgrade enables ETH withdrawal and reduces transaction fees\n\nThe Shapella upgrade marks the culmination of Ethereum's transition to a proof-of-stake consensus mechanism for network maintenance. This hard fork will enable stakers to withdraw their ETH, among other benefits. Additionally, the upgrade will help lower transaction fees for users while enhancing Ethereum's capacity to process transactions.\n\nThe most crucial development associated with the Shanghai upgrade is Ethereum Improvement Proposal-4895, which allows validators to withdraw staked tokens. Validators have staked around 16 million ETH to secure the mechanism, which has become increasingly vital to the Ethereum blockchain since the Merge transitioned Ethereum's consensus mechanism from proof-of-work to proof-of-stake in September 2022. According to the new rules post-Merge, validators that stake 32 ETH in the chain can participate in validating blocks, and each staked ETH increases the likelihood of a validator receiving block rewards.\n\nFollowing the Merge, validators had to lock up their ETH and any rewards earned until a later chain update. Despite the Merge taking place in 2022, validators have been staking ETH since December 2020, when the Beacon Chain was released, relying on proof-of-stake as a mechanism.\n\nSince the Beacon Chain's launch in December 2020, over 16 million ether has been staked in the network. Although not the entire balance can be unstaked immediately after the upgrade, roughly 1.1 million coins received as staking rewards can be withdrawn instantly. ETH is used to pay rewards to ether stakers.\n\nSince that time, Ethereum staking has been unidirectional. Users are able to stake their ETH to become validators and receive rewards in their wallet for performing their duties. However, they are currently unable to withdraw their staked ETH.\n\nAdditional EIPs to reduce gas fees and support Ethereum developers in Shanghai Upgrade\n\nAside from Ethereum Improvement Proposal-4895, the Shanghai fork also includes several other smaller EIPs that aim to reduce gas fees during periods of high activity to benefit Ethereum developers. These include EIP-3651, EIP-3855, EIP-3860, and EIP-6049.\n\nWhile the Shanghai upgrade may seem relatively small compared to the Merge, it has the potential for a significant impact on those with staked ETH on the chain. Further upgrades to the Ethereum protocol are expected later in 2023, including those aiming to improve the Ethereum Virtual Machine and another that seeks to split the Ethereum blockchain into several \"shards\" to enhance scalability. EIP-4844, which aims to split the Ethereum blockchain, had initially been considered for inclusion in the Shanghai upgrade, but was later pushed back.\n\nHow the Shanghai Upgrade will affect the price of ETH is a point of some debate\n\nThere is a debate on how the Shanghai Upgrade will impact the price of ETH. One concern is that the release of more than 16 million staked ETH, valued at over $30 billion currently, could lead to a flood of ETH into the crypto market, causing an immediate price drop due to an increased supply without a corresponding increase in demand. However, it is important to note that two years ago, the price of ETH was nearly three times its current price, and it is currently trading at almost half the price it was a year ago. In addition, many investors who staked their ETH could face losses if they withdraw immediately, which may discourage them from doing so."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vY29pbmZvbWFuaWEuY29tLzYzLW9mLXRyYWRlcnMtZXhwZWN0LWV0aGVyLXRvLXJlYWNoLTUwMDAv0gFFaHR0cHM6Ly9jb2luZm9tYW5pYS5jb20vNjMtb2YtdHJhZGVycy1leHBlY3QtZXRoZXItdG8tcmVhY2gtNTAwMC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Wen Moon? 63% of Traders Expect Ether (ETH) to Reach $5000 by Year End - Coinfomania",
        "content": "Ether (ETH) has the potential of reaching the $5000 price mark, surpassing its previous all-time high of $4,800 before the year runs out, according to 63% of respondents to a survey conducted by crypto exchange OKX.\n\nOKX released results from its surveys as it inquired about the disposition of crypto enthusiasts about the upcoming Shangai upgrade. The Shanghai-Capella upgrade, based on the Ethereum roadmap, will see the network unlock all staked ETH and grant users access to withdraw them.\n\nWen Moon?\n\nDespite popular opinion among analysts that the Shapella upgrade will hamper the price of the second most valuable cryptocurrency in the world, poll results prove respondents are not buying that idea.\n\nAside from the 63% that predicted a $5,000 market value for ETH, an additional 33% believe that the digital asset will surpass $2,000 by December but will not reach its 12-month high of $3,000.\n\nEither way, participants are particularly optimistic that ether will not crash after the unstaking process. The survey shows that a whopping 93% of participants believe that the Proof-of-Stake-based digital asset will surpass its current price of $1,890 at press time.\n\nA Different Scenario?\n\nThe OKX survey revealed that 79% of respondents believe that the crypto market and ETH would react differently to The Merge, which happened late last year. The Merge saw Ethereum move from Proof-of-Work to the more energy-friendly Proof-of-Stake in September 2022.\n\nContrary to popular opinion, ether closed bearish on the month of The Merge, dropping 14% from its opening price. ETH closed slightly above $1,300 after opening the month as high as $1,554.\n\nThe survey participants expect a different outcome in the Shangai upgrade, with 59% disclosing they expect ETH to rise before and after the upgrade. The upgrade would go ahead despite division among the network’s core developers, as some described it as “hasty and early.”\n\nYour crypto deserves the best security. Get a Ledger hardware wallet for just $79!"
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3NpZ251cHRva2VuLWNvbS1zdGVwcy11cC1taWxsaW9uYWlyZS1jYW1wYWlnbi1hcy1iaXRjb2luLWFuZC1ldGhlcmV1bS1maW5kLXNoZWx0ZXItaW4tZnJhbmNlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Signuptoken.com Steps Up Millionaire Campaign as Bitcoin and Ethereum Find Shelter in France - Analytics Insight",
        "content": "The landscape of cryptocurrency could be changing as it finds itself embroiled in pressure from U.S. authorities. The spectacular collapse of FTX was followed by multiple crypto-orientated banks closing while Binance Holdings now faces heat from American regulators. But away from America, there is a different atmosphere in France, where cryptos like Bitcoin (BTC) and Ethereum (ETH) are embraced rather than confronted with regulations. As we look at how economic conditions for cryptocurrency could change through investment in the French market, we’ll also analyze a new crypto initiative called Signuptoken.com that could potentially make a millionaire out of someone for simply signing up to an email newsletter.\n\nU.S. Authorities Are Clamping Down On Cryptocurrency\n\nCryptocurrency has suffered from visible market volatility and shifting economic conditions following the collapse of the FTX last year. This prompted an immediate downturn in the prospects of the cryptocurrency market as investors began losing confidence. Major crypto-related banks began suffering, a prominent example being Silvergate Capital. A crypto-friendly bank, it bled extensively following the FTX crash as there was a bank run with over 60% of deposits withdrawn in one quarter as customers withdrew around $8.1bn.\n\nAlmost imminently, Silvergate announced it would be winding down its operations and other crypto-focused banks such as Signature also began feeling the strains and eventually crashed, prompting a bout of severe market volatility. Major cryptos such as Bitcoin and Ethereum have felt the pinch of the economic squeeze, struggling to maintain bullish runs. Bitcoin is currently trading at around $28,409 while Ethereum is selling for $1,810 per coin.\n\nThe downturn in market trends in cryptocurrency is not new. But what feels different this time is the mounting seriousness of U.S. authorities in cracking down on cryptocurrency. The United States Commodity Futures Trading Commission (CFTC) sued Binance for violating trading and derivative laws. The lawsuit was filed on the 27th of March and accused the worldwide crypto exchange of offering its derivative trading services to customers in the USA without applying for a derivative licence.\n\nThe lawsuit alleges Binance of having elevated commercial success over complying with regulations and said Binance had discarded U.S. federal laws whilst strengthening its customer base in America.\n\nThe move, which took many by surprise, represents a growing suspicion among U.S. authorities that cryptocurrency’s unregulated nature cannot be sustained and must be brought into line.\n\nBitcoin & Ethereum: Is France the New Haven?\n\nMarket trends are such that if a lucrative industry struggles in one such market it may find opportunities elsewhere. Keen to secure the lucrative investments of cryptocurrency, France has demonstrated a considerably more embracing nature of the digital finance economy in comparison to its American counterparts.\n\nAn example of this has been the fast food chain Burger King revealing that it was accepting cryptocurrency as payments for transactions in Paris. It’s done this by partnering with Instpower which will deploy power bank rental machines across store locations in the French capital. It underlines the stark contrast between France and the U.S. in the confidence in cryptocurrency. This could mean a boon for cryptocurrency which has much to offer people who prefer its decentralised nature compared to the regulations of centralised banks and financial institutions. Furthermore, the blockchain technology of a cryptocurrency like Ethereum has been revolutionary for application developers and underlines what cryptocurrency has to offer in comparison to traditional financial markets.\n\nIt could also be argued that the embrace of France as a sizable market for investment could help a coin like Bitcoin maintain its trading levels and eventually continue climbing in its market capitalisation. The value of major cryptos is often tied to external events such as the FTX crash and the closure of major crypto banks. This could prompt a positive reversal in fortunes and spark life into the cryptocurrency market that has been scarred by the recent implosion of major crypto banks.\n\nSignuptoken.com Offers An Easy Way To Become A Millionaire\n\nThe traditional approach for a crypto coin to launch itself has been through presales or an ICO. Although this works fine, other formats can be explored. Signuptoken.com is an intriguingly shrewd example of that.\n\nNot needing a presale or any kind of prepayment, instead, it pushes for one million email sign-ups before it enters the crypto exchanges. There are some noteworthy benefits to this, including the advantage of being the first to know when the new token will enter the crypto market, giving anyone who registers their email a healthy headstart on engaging with the new crypto over other investors.\n\nIf you’re interested in what it’s offering, have a look below:\n\nWebsite: https://www.signuptoken.com\n\nTwitter: https://twitter.com/_SignUpToken_\n\nTelegram: https://t.me/SignUpToken\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vd3d3LnRyb253ZWVrbHkuY29tL2JvbGQtcHJlZGljdGlvbnMtZXRoZXJldW0tcmVhY2gtMTAwMDAtYnktMjAyNS_SAU1odHRwczovL3d3dy50cm9ud2Vla2x5LmNvbS9ib2xkLXByZWRpY3Rpb25zLWV0aGVyZXVtLXJlYWNoLTEwMDAwLWJ5LTIwMjUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Bold Predictions For Ethereum: Could ETH Reach $10,000 By 2025? - TronWeekly",
        "content": "Well-known crypto analyst Chris Burniske has boldly predicted the future of Ethereum (ETH), the second-largest cryptocurrency in the market. Burniske, known for his insightful commentary on digital assets, recently took to Twitter to express his thoughts on the potential of ETH.\n\nFor the haters that have been negative on $ETH at $1, $10, $100, and $1,000, but refuse to let data change their views, see ya at $ETH $10K ✌️ — Chris Burniske (@cburniske) April 9, 2023\n\nAs more and more individuals turn to blockchain technology for various purposes, including financial transactions and smart contracts, the demand for ETH is likely to increase significantly.\n\nAccording to Burniske’s tweet, many skeptics have been negative about Ethereum at various price points, including $1, $10, $100, and $1,000. However, he believes these critics will be proven wrong in the long run.\n\nHe predicts Ethereum could soar to $10,000 by 2025, a staggering increase from its current price point. Nevertheless, he did not provide any specific reasons for his prediction.\n\nEthereum’s Shapella Upgrade: Impact On ETH Price & Staking\n\nEthereum (ETH) has recently crossed the $1,900 mark, reaching its highest level since August 2021. The second-largest market cap cryptocurrency currently trades at $1,896, with a 3.11% gain over the past 24 hours and a 5% increase over the past seven days.\n\nEthereum’s upcoming hard fork on April 12, Shapella, aims to address staked ETH withdrawals, leading market participants to believe it may increase the price.\n\nHowever, according to Brian Mosoff, CEO of Ether Capital, the Shapella upgrade is unlikely to impact the price of ether significantly. Mosoff believes that the upgrade will not cause a rush to liquidate and lead to pressure on the cryptocurrency’s price.\n\nInstead, he expects more ETH to be locked into staking, either from solo stakers or structured products, leading to changes in trading in the coming months.\n\nThe Shapella upgrade is Ethereum’s final shift towards fully implementing its proof-of-stake (PoS) consensus mechanism. It will allow users to withdraw from the ETH they have staked, lower fees, and create more room on the blockchain to handle transactions.\n\nMosoff also expects that the upgrade could attract a new group of investors, as it provides the ability to earn some yield on staked ETH.\n\nRelated Reading | Security Concerns Raised For Ethereum Staking Nodes Ahead Of Shanghai Upgrade"
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vd3d3LnRyb253ZWVrbHkuY29tL3NlY3VyaXR5LWNvbmNlcm5zLWZvci1ldGhlcmV1bS1zdGFraW5nLW5vZGVzL9IBTGh0dHBzOi8vd3d3LnRyb253ZWVrbHkuY29tL3NlY3VyaXR5LWNvbmNlcm5zLWZvci1ldGhlcmV1bS1zdGFraW5nLW5vZGVzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Security Concerns Raised For Ethereum Staking Nodes Ahead Of Shanghai Upgrade - TronWeekly",
        "content": "In a recent Twitter thread, Shenyu, the founder of Cobo, raised concerns about the security of private keys for Ethereum staking nodes. With an upcoming upgrade in Shanghai, more than two years of ETH staking can withdraw cash. However, Shenyu warns that the private keys of some staking nodes may have already been leaked.\n\nThis news comes after thousands of addresses eligible for arbitrum airdrops had their private keys leaked. Shenyu recommends that institutions that provide centralized staking should review their private key storage methods, check the status of authorized personnel, monitor server logs, and formulate emergency plans.\n\nInstitutions offering centralized staking services should heed this warning and implement necessary measures to safeguard their users’ funds. As staking gains more traction, the associated security risks also escalate, making it imperative to establish robust security protocols to protect users’ assets.\n\nAs the upgrade in Shanghai approaches, users and institutions should be vigilant and take all necessary precautions to prevent potential security breaches. Shenyu’s warning serves as a timely reminder of the importance of robust security measures for staking services.\n\nSharp Drop in Ethereum Options Implied Volatility (IV)\n\nIn another related update, the Ethereum market has experienced a sharp drop in options implied volatility (IV), despite the upcoming Shanghai upgrade. IV has fallen by as much as 8% in the past two days, which is a significant drop. This decline in IV is mainly attributed to the drop in market liquidity due to the Easter holidays.\n\nWhile it is not unusual for market liquidity to drop during holidays, it is unexpected for the monthly IV to fall to the same level as Bitcoin. This drop in IV is an indication that traders are not as concerned about Ethereum price movements as they have been in recent weeks.\n\nAccording to the analytics platform, GreeksLive, the fall in IV is primarily driven by the reduced demand for options rather than an increase in supply. The reduced demand for options can be attributed to the lower trading volume in the Ethereum market, as investors take a break during the holiday period.\n\nThe decline in IV indicates that traders are less concerned about potential price movements in the Ethereum market in the short term. However, this could change after the Shanghai upgrade, which is expected to significantly change the Ethereum network.\n\nEthereum traders and investors should monitor the market closely ahead of the upgrade. Although the drop in IV is not alarming at the moment, market sentiment can change rapidly, emphasizing the need to be updated on any potential market-moving events.\n\nRelated Reading | Weekly Market Watch: Ethereum Bullish Surge Boosts Altcoins’ Performance"
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMimwFodHRwczovL3d3dy5vdXRsb29raW5kaWEuY29tL291dGxvb2stc3BvdGxpZ2h0L2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tY3Jhc2gtcGFuaWMtd2hhbGVzLXBvc2l0aW9uLXRoZW1zZWx2ZXMtZm9yLWEtc2FsZS1pcy10aGUtY3Jhc2gtY29taW5nLS1uZXdzLTI3NzYwMdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction: Crash Panic! Whales Position Themselves For A Sale – Is The Crash Coming? - Outlook India",
        "content": "The ETH price fell more than 10% in the last 48 hours, as recession looms over the crypto market. This has caused several experts to predict a massive crash. As whales position themselves for a sale, insider sources are saying that these massive funds will mostly find their new homes among the newcomers on the market, namely Love Hate Inu (LHINU), DeeLance (DLANCE), Metropoly (METRO), Ecoterra (ECOTERRA), and RobotEra (TARO). These represent a new generation of cryptocurrency, each specializing in its niche and providing users with incredible utility on their respective platforms. But before we dig deeper into their merits let's examine more closely Ethereum price prediction and ETH future."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDQvMTAvd2hhdC1oYXBwZW5lZC1jcnlwdG9raXR0aWVzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "What happened to CryptoKitties? - The Cryptonomist",
        "content": "CryptoKitties is the NFT collection that made history in 2017, but what happened to them now? How are their prices performing? Let’s take a closer look at them below.\n\nCryptoKitties: what are the famous NFTs?\n\nAs one of the first and most popular NFT projects, CryptoKitties introduced blockchain technology to thousands of early users, players, traders, and collectors. In fact, the early days of the collection’s release and sales are now something of a crypto legend.\n\nInterest in CryptoKitties has been so great since its inception that it has created an estimated six-fold increase in the number of Ethereum transactions. At one point, it accounted for 25% of the volume of transactions on the network.\n\nThe increase in volume caused a significant drop in transaction speed and an increase in gas rates across the entire Ethereum network. When this event occurred, at the peak of the 2017 bull-run cycle, it emphasized the scalability challenges of the Ethereum network and threatened to exclude other decentralized blockchain-based application startups.\n\nNot only that, the demand for CryptoKitties NFTs can be partly credited to the 256-bit DNA sequence assigned to each. The unique characteristics of each CryptoKitty are derived from a combination of the cattributes of its parents.\n\nThis genome mechanism allows nearly four billion unique CryptoKitties to be minted from the parent CryptoKitties. The popularity of the CryptoKitties NFTs has also attracted high-profile celebrity collaborations.\n\nMuse, a popular rock band, and Momo Wang, a famous Chinese fashion designer, have both participated in custom-themed cats for the CryptoKitties franchise. NBA superstar Stephen Curry was perhaps the most prominent celebrity to support the project. His initial involvement led to the creation of three CryptoKitty NFTs inspired by him.\n\nGrowth and decline of CryptoKitties\n\nCryptoKitties, which launched on 28 November 2017 after a five-day closed beta, quickly gained notoriety with the tantalizing slogan “the world’s first Ethereum game.”\n\nAccording to nonfungible.com, sales volume increased significantly from only 1,500 non-fungible cats on launch day to over 52,000 on 10 December 2017, with many CryptoKitties selling for prices in the hundreds or thousands of dollars.\n\nIn addition, the game’s use of the Ethereum blockchain may have contributed to the success of that technology. Along with the launch of CryptoKitties, Ethereum took off like a rocket, going from less than $300 per token in early November 2017 to just over $1,360 in January 2018.\n\nHowever, CryptoKitties faltered when Ethereum rose higher, which would later prove to be a troubling indication for the future of blockchain games.\n\nEarly December 2017 saw a spike in daily sales, which declined in January and averaged less than 3,000 in March. The fact that the value of NFTs themselves declined more slowly is evidence that the game still has a strong fan following, including Rabono, who bought Dragon long after the game’s height.\n\nUntil 2018, their activity broke records for the value of NFTs. Nowadays, CryptoKitties are fortunate to reach 100 sales per day and the total value is often less than $10,000.\n\nThere are still significant transactions, such as the sale of Founder Cat No. 71 for 60 ether (about $170,000) on 30 April 2022, although they occur only occasionally. It is doubtful that CryptoKitties’ decline into obscurity will stop.\n\nThe company that owns CryptoKitties, Dapper Labs, has moved on to other businesses such as NBA Top Shot, a website that allows basketball fans to buy NFT “moments,” which are essentially video clips of NBA games.\n\nWhy have the popular NFTs collapsed?\n\nThe latest blog post (4 June 2021) on the game’s website, commemorating the breeding of the 2 millionth CryptoKitty, contains a hint about the end of the game. To date, it is believed that there are two main reasons why CryptoKitties have collapsed.\n\nThe first, concerns the amount of available kittens. In the sense that the more players increased demand, the more they also increased the ability to increase supply by breeding more cats. This has rapidly reduced the rarity of each NFT.\n\nSecond, there is the huge volume of CryptoKitties, which has effectively destroyed the Ethereum blockchain, the world’s second most valuable cryptocurrency by market capitalization (after Bitcoin).\n\nAs mentioned earlier, Ethereum values transactions using a fee called gas. Gas fees will increase whenever there is an increase in transactions (purchase, generation, and so on), and that is exactly what happened when CryptoKitties went to the moon.\n\nHence, high fees were a problem for more than just CryptoKitties. The entire blockchain was affected by the problem. As the game gained popularity, gas prices increased for anyone who needed to make a transaction on Ethereum for any reason."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LnRoZWNvaW5yZXB1YmxpYy5jb20vMjAyMy8wNC8xMC85Mi1vZi1oYWNrZXJzLXdhbnQtZXRoLWludGVyZXN0LWluLXRlem9zLXN1cmdlZC1ieS0xMjItc3VydmV5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "92% of Hackers Want ETH, Interest in Tezos Surged By 122%: Survey - The Coin Republic",
        "content": "– Whitehats see reentrancy as the most common vulnerability when reviewing code.\n\n– Whitehat hackers are not driven by money.\n\n– The more Web3 grows, the more career opportunities it offers.\n\nWhitehats prefer the Ethereum blockchain over the others, but interest in Ethereum dropped by 4 per cent, says Immunefi in its Hacker Ecosystem Survey 2023. The leading bug bounty and security services platform for Web3 surveyed whitehats to get an insight into their interests, challenges and opportunities in Web3. It saw a significant increase in interest in Tezos, a 122.2 per cent YoY growth.\n\nThe survey found “reentrancy” as the most common vulnerability whitehats come across when reviewing code, followed by access control. Other vulnerabilities include input validation, oracle manipulation and logical errors. There are also rounding errors, gas optimization, unchecked returned values, uninitialized proxy, and flash loans.\n\nNot Doing It for the Money\n\nImmunefi, in its report, highlighted that money is not the driving factor in whitehat hackers’ interest. Most respondents, 77 per cent, are mainly interested in solving technical challenges. About 69 per cent of respondents said financial gains, 62 per cent pointed out career opportunities, and 38 per cent said community.\n\nBut most whitehats (55.8 per cent) said hacking is their primary job. 44.2 per cent of the respondents phish in their free time and spend most of their day as software developers within the Web3 or security industries. But there has been a significant increase in whitehats hacking in their free time, compared to 39.8 per cent in the previous period – an 11 per cent YoY growth.\n\nThe survey found that more whitehats are joining the field and using their free time to work on transitioning to Web3 cybersecurity full-time. Most whitehats, on average, have worked in cybersecurity for almost four years and have been inclined towards Web3 security for almost two years.\n\nAll Eyes on Web3\n\nWeb3 is a high-paying industry. The more this space grows, the more career opportunities it offers. Whitehats believe their role in security is of high value for the industry and is well-rewarded as the technology leads to monetary funds being directly at risk. Web3 brings a host of possibilities. Whitehats see a steep learning curve, irrespective of previous cybersecurity or Web2 development background, as a key challenge.\n\nKeeping up with the industry is challenging given the complexity of solidity coding and protocols, possible attack vectors in Web3 and the continuously evolving requirements.\n\nMitchell Amador, CEO of Immunefi, believes there is a need always to stay ahead of bad actors. He said it’s crucial to have the most talented security ecosystem in place and to operate under a reliable incentivized system. Amador added that working closely with whitehats, sharing insights and growing from their experience is of tremendous value and will continue to be beneficial, as they are on the frontline of protecting the industry."
    }
]