[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy92aXNhLWludHJvZHVjZXMtd2F5LXBheS1ldGhlcmV1bS0wMzA1MzYxMDIuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 13 Aug 2023 07:00:00 GMT",
        "title": "Visa Introduces New Way To Pay For Ethereum Gas Fees Directly Using Visa Cards - Yahoo Finance",
        "content": "Visa Introduces New Way To Pay For Ethereum Gas Fees Directly Using Visa Cards\n\nVisa Has Been Actively Exploring The Crypto Sector\n\nVisa has finished testing a system to make it easier to pay transaction fees, or \"gas fees,\" on the Ethereum blockchain.\n\nAccording to the firm, the majority of users find the present gas payment methods to be unnecessarily complicated. Visa noted in a blog post that although blockchain technology has gained a lot of traction recently, people still find it difficult to understand the nuances of on-chain transactions.\n\nEvery transaction on Ethereum needs the payment of a gas fee, which often means ensuring one has a balance of Ether (ETH) in their wallet. The ERC-4337 Ethereum standard, which enables smart contracts to operate as wallets by utilizing account abstraction, is what Visa advises using in conjunction with a paymaster contract. This paymaster agreement might support users' gas fees, enabling users to pay for gas directly with a Visa card.\n\nThe testing for this process was conducted on the Ethereum Goerli testnet.\n\nVisa hopes that merchants or decentralized applications will use their existing wallets or paymaster systems to speed up transactions. By allowing customers to pay gas fees with a Visa card, this system aims to increase the use and accessibility of blockchain-based transactions.\n\nVisa has been actively exploring the crypto sector, including looking into accepting settlement payments using USDC on Ethereum."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvYnVsbGlzaC13ZWRnZS1wYXR0ZXJuLXNldHMtZXRoZXJldW0tcHJpY2UtcmFsbHktdG8tMjUwMC_SAVlodHRwczovL2NvaW5nYXBlLmNvbS9tYXJrZXRzL2J1bGxpc2gtd2VkZ2UtcGF0dGVybi1zZXRzLWV0aGVyZXVtLXByaWNlLXJhbGx5LXRvLTI1MDAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 13 Aug 2023 07:00:00 GMT",
        "title": "Bullish Wedge Pattern Sets Ethereum Price Rally to $2500 - CoinGape",
        "content": "Amid the rising FUD in the crypto market, the Ethereum price showed a slow yet steady downfall in the daily time frame chart. Within a month, this altcoin dropped from its July 14th peak of $2028 to its current price of $1850, registering a loss of 8.5%. However, a keen look at the bigger picture shows this correction is part of a long-term rally carried by a rising channel pattern.\n\nAlso Read: Picking Ethereum for PayPal Stablecoin Was an ‘Easy Choice’- PayPal Exec\n\nadvertisement\n\nETH Chart: Key Points\n\nA bullish reversal from the lower support trendline could set the ETH price at 12% to hit $2020\n\nThe coin price above 200-days EMA indicates the overall trend bullish\n\nThe intraday trading volume in Ether is $3.36 Billion, indicating a 29.6% gain.\n\nSource- Tradingview\n\nEarlier this week, the Ethereum price showed several higher price rejection candles near the $1875 mark. The high wicks candle signifies that traders are adhering to the prevailing bearish sentiment of engaging in selling when the price rallies.\n\nTherefore, if the overhead supply persists, the ETH price is likely to fall another 2% and retest the long-coming support trendline of the channel pattern. In the last nine months, the price has already rebounded five times from this dynamic support indicating a high accumulation zone for buyers.\n\nA potential fall to a lower trendline will likely recuperate buying pressure and kickstart a new bull cycle within the pattern. In ideal conditions, a bullish reversal from the lower trendline will set the Ethereum price back to the upper trendline, wavering around $2500.\n\nKey Resistance Levels to Watch?\n\nWhile the anticipated bullish upswing could drive the Ethereum price to $2500, the buyer could face in-between supply pressure at $2020, followed by $2133 and $2450. However, the bullish sentiment will invalidate if the coin price breaks below the support trendline.\n\nExponential Moving Average: The 200-day EMA rising along with an ascending trendline increases the support strength of this level.\n\nDirectional moving index: The DI+(blue) and Di-(Orange) slope in a bearish alignment reflect the correction phase is intact."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2V0aGVyZXVtLW1ldi1pbmNlbnRpdmVzLWxpbWl0LWRlY2VudHJhbGl6YXRpb24tbmV3LXJlcG9ydC1zaG93cy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 13 Aug 2023 07:00:00 GMT",
        "title": "Ethereum MEV incentives limit decentralization new report shows - CryptoSlate",
        "content": "On blockchain networks like Ethereum, decentralized validation underpins the entire ecosystem. Yet paradoxically, the highly-technical process of constructing the blocks that store transactions may be quietly accruing influence in the hands of just a few.\n\nAccording to an analysis by Ethereum researcher Thomas Thiery, block building has evolved into a high-stakes strategic arena. Specialized builders now utilize proprietary algorithms, privileged partnerships, and micro-optimized arbitrage strategies to maximize profits and the probability of block rights.\n\nBy quantifying bid timing, latency optimization, order flow sources, and transaction bundles, Thiery’s work exposes the competitive dynamics eroding Ethereum’s decentralized ethos.\n\nThe data proves that economic incentives drive builders toward consolidation, cooperation, and specialization in the relentless quest for profits.\n\nAccording to Thiery, left unchecked, these trends stand to undermine Ethereum’s core value proposition – a world computer operated by a distributed web of stakeholders, not an oligarchy of elites.\n\nThiery’s research illuminates the reality of block building today, setting the stage for informed dialogue on potential solutions. The coming sections distill vital insights from his analysis into an accessible synopsis for the crypto community.\n\nThe lucrative world of block creation\n\nCreating new blocks on blockchain networks like Ethereum is carried out by builders who compete to package transactions into blocks and earn profits in two primary ways:\n\nCollecting Transaction Fees\n\nThe first source of revenue stems from packaging transactions into a block and collecting the associated fees. When users submit transactions to the network, they can optionally specify a “gas price,” which compensates the builder for executing their transaction. The total fees collected from all transactions in a block represent one revenue stream for builders.\n\nOptimizing this requires efficiently packing in as many valuable transactions as possible from the public mempool queue. Builders develop algorithms and strategies to maximize the cumulative fee revenue from each block they construct.\n\nProfiting from Arbitrage Bundles\n\nThe second, more lucrative revenue source involves arbitrage opportunities that exploit market inefficiencies. Specialized “searchers” identify arbitrages like price discrepancies between exchanges, then bundle the transactions required to capitalize on the opportunity.\n\nThese exclusive bundles, often involving a centralized exchange, are transmitted directly to the builder rather than the public mempool. Builders can collect a portion of the profitable spread by including arbitrage bundles in a block.\n\nSome builders form exclusive partnerships with searchers to gain access to these private bundles, which studies indicate provide approximately 80% of total builder revenue. The most common and profitable arbitrage identified involves exchanges between centralized and decentralized platforms.\n\nStrategies for Block Building Supremacy\n\nBy leveraging technical expertise and strategic partnerships, blockchain builders employ complex strategies to optimize profits from block construction.\n\nUnderstanding the incentives and competitive dynamics provides insights into centralization risks and informs mechanisms to improve system decentralization.\n\nAccording to Thiery’s examination of block construction dynamics, builders utilize various approaches to maximize their profits and probability of winning block rights. Thiery’s work elucidates builder behavior and its implications by analyzing bid timing, efficiency optimizations, order flow sources, and profitable arbitrage strategies.\n\nBuilders increase their bids as Ethereum’s 12-second slot progresses to incorporate additional transactions and extractable value. However, most winning bids occur toward the end of the slot, consistent with consensus protocols.\n\nBuilders optimize latency and efficiency differently – some entities submit bids frequently to beat competitors, while others focus on seamless block assembly. Occasional bid cancellations also appear to serve as a tactic for concealing or adjusting value.\n\nQuantifying Centralization Risk\n\nExclusive transaction bundles from searcher partners account for around 80% of builder revenue, outweighing public mempool transactions. Specifically, Thiery wrote,\n\n“Exclusive transactions represent 30% of the transaction count, but account for 80% of the total value paid to builders. This supports the hypothesis that the majority of valuable transactions generating MEV are packaged into bundles and transferred exclusively from searchers to builders.”\n\nThis highlights the importance of strategic partnerships and vertical integration in attaining proprietary order flow.\n\nArbitrages between centralized and decentralized exchanges proved the most profitable among the transaction types analyzed. One specialized builder won over 60% of these transactions, exemplifying the maximization and centralization risks of over-optimization.\n\nThiery concludes that quantifying the strategies and behaviors of builders can inform the construction of profiles that evaluate and address centralization tendencies.\n\nThe data proves that incentives lead builders toward consolidation, cooperation, and specialization – limiting decentralization. Mechanisms that encourage diversity of techniques and providers may counteract these forces.\n\nOverall, the trends identified by Thiery highlight that prospering in this high-stakes environment necessitates exploiting latency, partnerships, exclusivity, and focus – with implications for global network structure. Understanding these issues can enlighten solutions.\n\nBuilders’ Behavioral Profiles (BBPs)\n\nBy peering behind the curtain of Ethereum’s block-building ecosystem, Thiery’s work sounds an alarm for the community.\n\nEconomic forces and incentives usher this domain toward greater centralization, cooperation, and consolidation amongst profitable entities. Left unaddressed, the drift contradicts the guiding vision of a decentralized world computer.\n\nYet hope remains – armed with data-driven insights into builder behavior, Ethereum developers and researchers can illuminate the way forward. Thiery posits a Builders’ Behavioral Profiles (BBPs) model with many metrics. These encapsulate bid timing, advancements in latency, bid withdrawal, access to order flow, and MEV strategies and extend to aspects like on-chain and CEX-DEX arbitrages, sandwiches, and liquidation.\n\nThiery also expressed his hope that the community will amplify the utility of BBPs by integrating new metrics and characteristics to shed light on the function of builders in their interactions with searchers, relays, and validators. According to him, this is a crucial move towards developing sturdy mechanisms that curb tendencies towards centralization and foster an equitable and proficient supply network."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vZGVjcnlwdC5jby8xNTIyNzEvdGhpcy13ZWVrLWluLWNvaW5zLWJpdGNvaW4tYW5kLWV0aGVyZXVtLXByaWNlcy1pbmNoLXVwd2FyZHMtYWZ0ZXItcGF5cGFsLXBpdGNoZXMtc3RhYmxlY29pbtIBe2h0dHBzOi8vZGVjcnlwdC5jby8xNTIyNzEvdGhpcy13ZWVrLWluLWNvaW5zLWJpdGNvaW4tYW5kLWV0aGVyZXVtLXByaWNlcy1pbmNoLXVwd2FyZHMtYWZ0ZXItcGF5cGFsLXBpdGNoZXMtc3RhYmxlY29pbj9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 12 Aug 2023 07:00:00 GMT",
        "title": "This Week in Coins: Bitcoin and Ethereum Prices Inch Upwards After PayPal Pitches Stablecoin - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt.\n\nLeading cryptocurrencies finally broke a six-week spell of poor price performance or inertia this week.\n\nMarket leader Bitcoin (BTC) added a modest 1.5% to its market value over the seven days to trade at $29,408 on Saturday.\n\nAD\n\nAD\n\nAccording to the latest weekly report by CoinShares, last week was a strong indicator that institutional investors have stopped shorting the leading currency for the first time in fourteen weeks.\n\nMeanwhile, Ethereum (ETH), the second-largest coin by market capitalization, appeared to match the top coin’s pace, adding 1.3% to enter the weekend at $1,851.\n\nThere were no significant price drops among the top thirty cryptocurrencies. However, three altcoins posted notable gains.\n\nSolana (SOL) grew 8.5% to its current price of $24.55; Toncoin (TON) added 10.1% to hit $1.32, and Shiba Inu (SHIB) blew up 17.8% to trade at $0.00001108.\n\nShiba Inu appears to have kept up the momentum of last week’s rally that commenced on news that the coin’s makers are shedding their memecoin reputation and introducing a new identity protocol to all apps on the ecosystem for increased security and privacy.\n\nAltogether the market made small gains this week, as July’s U.S. inflation readings indicated a continued cooling off.\n\nAD\n\nAD\n\nIn the news...\n\nThis week brought a fairly busy and diverse news cycle, with institutional and global adoption stories commanding attention alongside the Fed’s new stablecoin note and the U.S. Security and Exchange Commission’s face-saving tactics in its failing war on crypto.\n\nOn Monday, payments giant PayPal announced it would be releasing an Ethereum-based dollar-pegged stablecoin called PayPal USD (PYUSD).\n\nThe currency will be issued by Paxos and is expected to become \"a part of the overall payments infrastructure,\" according to a media quote by PayPal CEO Dan Schulman.\n\nStarting next month, Paxos will be publishing monthly reserve reports and third-party attestations of PYUSD’s reserves, enabling the public to keep track of the credibility and value of the assets underpinning the stablecoin’s value.\n\nDemocratic Congresswoman Maxine Waters (D-CA) aired her concerns in a written statement: “I am deeply concerned that PayPal has chosen to launch its own stablecoin while there is still no Federal framework for regulation, oversight and enforcement of these assets. [...] Given PayPal’s size and reach, Federal oversight and enforcement of its stablecoin operations is essential.”\n\nOn Tuesday, Brazil announced the name of its new central bank digital currency (CBDC): DREX, or the “digital real”— the name being a near-acronym for “digital real electronic transaction.”\n\nThe digital real is a centrally-issued tokenized real that utilizes distributed ledger technology similar to blockchain, but it’s not without controversy.\n\nEarly last month, the Brazilian Central Bank published the code of the pilot project on its GitHub profile. Developers thus discovered several problematic functions within the smart contract.\n\nAD\n\nAD\n\nThe capabilities given to the Central Bank include the ability to freeze users' accounts, decrease target balances, confiscate, and mint new units of the digital currency. This, in turn, has attracted criticism that the project enforces exactly the kind of centralization crypto was created to avoid.\n\nThat day, Binance announced it had secured licenses to operate in El Salvador, a country where Bitcoin is legal tender. Binance has been feeling the heat of the SEC’s spotlight in the U.S. after the federal securities regulator sued it for breaching securities laws, alleging further still that Binance execs are involved in commingling customer funds and market manipulation.\n\nAlso that day, the Federal Reserve issued a statement announcing incoming guidance for chartered banks dealing with dollar-pegged stablecoins. It also said it was stepping up its “novel activities supervision program” for banks dealing with crypto or crypto companies in its jurisdiction.\n\nIn particular, the Fed is looking to monitor the transaction validation process, including the “timing and finality of settlement of transactions, potential irreversibility of transactions, and the central authority of transaction records.”\n\nThe statement hints that the Fed will implement know-your-client (KYC) measures and ensure that nationally-chartered banks demonstrate appropriate risk-mitigation strategies.\n\nOn Friday, the SEC announced it plans to appeal Judge Torres’s landmark ruling in the agency’s ongoing lawsuit against Ripple for—you guessed it—breaching securities laws.\n\nTorres ruled that Ripple’s XRP was not a security by definition but could be presented as one depending on how it’s sold. Her verdict essentially contradicted the SEC’s claim that offerings to retail customers via exchanges constitute securities offerings.\n\nThe following day, the SEC once more played for time and delayed its decision to approve or reject a high-profile spot Bitcoin exchange-traded fund application from ARK 21Shares.\n\nAD\n\nAD\n\nFinally, on Saturday payments giant Visa announced an experimental solution on the Ethereum blockchain that enables users to pay gas fees using Visa credit or debit cards."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOC8xMi90cmFkZXItaXNzdWVzLWV0aGVyZXVtLXdhcm5pbmctc2F5cy1ldGgtY291bGQtc3VmZmVyLXByaWNlLWRlc3RydWN0aW9uLWFmdGVyLXJhbGx5aW5nLWhlcmVzLXRoZS10aW1lbGluZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 12 Aug 2023 07:00:00 GMT",
        "title": "Trader Issues Ethereum Warning, Says ETH Could Suffer Price ‘Destruction’ After Rallying – Here’s the Timeline - The Daily Hodl",
        "content": "A pseudonymous crypto trader is warning that the leading smart contract platform Ethereum (ETH) could collapse after a big run to the upside.\n\nIn a new strategy session, Altcoin Sherpa says that it is within the realm of possibility for Ethereum to rally well above $2,000 in the coming months.\n\nHowever, the analyst says that ETH will likely see a swift and deep correction following the surge.\n\n“It wouldn’t surprise me to see something like [a move to $2,5000] and then like, you know, come back down, maybe like $1,500 or whatever. And then we just chop around. There’s going to be some big rallies throughout this range. Don’t get me wrong. Like, for example, it wouldn’t surprise me as I said to go up to $2,500, but I’m still conflicted.\n\nI don’t think that $1,000 is going to come again. But it wouldn’t really surprise me at all to see some late-year destruction where we get down to like $1,500. It’s certainly possible in my opinion. But again, it’s going to depend on the next few weeks, months on how we get up.”\n\nLooking at his chart, the trader appears to predict that ETH could climb to $2,500 in November of this year and decline to about $1,500 in early 2024. The chart shows ETH crossing $1,800 again sometime in March 2004.\n\nThe trader also says that ETH’s price action is not convincingly forming a bull cycle.\n\n“I think that it’s just an overall choppy consolidation range right now. I don’t think there’s truly any strong convincing move personally. Yes, you can say this is a bullish market structure, because there are higher highs and higher lows, but it’s not very convincing in the sense that the higher highs are not super high. They don’t convincingly break the previous highs. And the same thing with the lows. They’re just kind of grinding up.”\n\nEthereum is trading for $1,849 at time of writing, down 0.1% in the last 24 hours.\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vdS50b2RheS9oZXJlcy13aGF0LWV0aGVyZXVtLWV0aC1mZWVzLWNhbi10ZWxsLXVzLWFib3V0LXByaWNlLWR5bmFtaWNzLWFuYWx5c3Rz0gFaaHR0cHM6Ly91LnRvZGF5L2hlcmVzLXdoYXQtZXRoZXJldW0tZXRoLWZlZXMtY2FuLXRlbGwtdXMtYWJvdXQtcHJpY2UtZHluYW1pY3MtYW5hbHlzdHM_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 12 Aug 2023 07:00:00 GMT",
        "title": "Here's What Ethereum (ETH) Fees Can Tell Us About Price Dynamics: Analysts - U.Today",
        "content": "Advertisement\n\nThis bullish rally can be a paradigm shift in Ethereum's L1/L2 ecosystem. Analysts foresee that by the year of 2026, Ethereum's L2 rollups will generate the majority of fees. Here's how this major indicator increased in seven months in 2023.\n\nEthereum (ETH) fees \"outperformed\" Ether price; bullish sign?\n\nIn the last seven months, the cumulative volume of Ethereum (ETH) fees increased by 176%. Over a similar period, the price of the second largest cryptocurrency only grew by 53%. Last time this \"imbalance\" was registered in 2020 after two years of the Crypto Winter.\n\nIn 2023 #Ethereum fees have climbed 176% vs. the price, up 53%. The relationship between the two was instructive for the last bull market when fees outpaced price in 2020 after a two year decline. -@Jamie1Coutts pic.twitter.com/0oIF54OgOK — Chris Burniske (@cburniske) August 12, 2023\n\nCryptocurrency veteran and seasoned blockchain researcher Chris Burniske posted these observations commenting on a thesis by Bloomberg Intelligence's analyst Jamie Coutts. Burniske also admitted that the correlation between these two indicators was \"instructive\" in previous rallies.\n\nAt the same time, migration of users from Ethereum's L1 to various L2 ecosystems is a dominant process in the ecosystem that heavily affects the indicators of fees.\n\nAs covered by U.Today previously, the second largest Ethereum L2 Optimism (OP) surprisingly flipped Arbitrum (ARB), the #1 scaler, in a number of metrics thanks to the overhyped Worldcoin (WDC) token release.\n\nOptimism (OP) exceeded Arbitrum (ARB) in the daily transactions volume and almost managed to eclipse it in the number of active wallets.\n\nL2s on fire in 2023, but we are still early\n\nHowever, by printing time, Arbitrum's (ARB) TVL is more than twice as high as that of Optimism (OP). Arbitrum's DeFi protocols total $5.94 billion in locked assets, while Optimism-based protocols only logged $2.82 billion.\n\nThings have only just started for L2s though. In seven months only, their share in Ethereum (ETH) ecosystem fees increased by more than 3x and almost reached 14%. The number of active addresses across L2s exceeded 900,000, Coutts' report says.\n\nShould L2 adoption keep this pace, major scaling solutions like Arbitrum (ARB), Optimism (OP) and zkSync will be responsible for 20% of Ethereum (ETH) fees by the end of 2023.\n\nIn three years, they will surpass L1's numbers, analysts conclude."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vZGFpbHljb2luLmNvbS9iYXNlLWNoYWluLWNvaW5iYXNlLWxheWVyLTItYmxvY2tjaGFpbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 13 Aug 2023 07:00:00 GMT",
        "title": "Coinbase's Base: A New Ethereum L2 - DailyCoin",
        "content": "Coinbase’s Base Chain hit the crypto space like an iceberg hitting the Titanic. One day, things seem relatively calm in the blockchain world; the next, a new Ethereum (ETH) Layer-2 emerges with its own minefield of explosive opportunity and catastrophic rugpulls.\n\nIn a bid to keep up with a rapidly evolving industry, Brian Armstrong and the team at Coinbase have successfully launched Base Chain. Designed to introduce millions of Coinbase users to the world of on-chain DeFi, Base has certainly made its presence felt in a competitive niche.\n\nBut what exactly sets Base Chain apart from dozens of other Layer-2 networks? Why should crypto enthusiasts, developers, and investors pay attention to the newest kid on the block?\n\nIntroducing Base Chain, Coinbase’s response to the growing demand for blockchain-based products and services.\n\nWhat Is Base?\n\nBase is a Layer-2 blockchain designed to enhance the capabilities of the Ethereum mainnet by improving transaction speed, reducing costs, and expanding functionality. Incubated by the team of pioneers at Coinbase, Base aims to make it easier, more secure, and more cost-effective for users to create a unique crypto economy of decentralized applications (dApps).\n\nBut Base isn’t just any Layer 2 blockchain. Built using Optimism’s OP Stack, Base will join the Optimism Superchain to create a thriving interoperable ecosystem with other popular Layer 2s.\n\nThis collaboration brings together Coinbase’s decade-long experience in building crypto products with Optimism’s cutting-edge technology, giving us an Ethereum L2 that’s powerful and efficient but also developer-friendly and secure.\n\nFollowing the release of the Base testnet in February 2023, the Base mainnet launch was completed ahead of schedule in the waning days of July.\n\nHow Does Coinbase’s Base Chain Work?\n\nBase leverages the underlying security of Ethereum, along with Coinbase’s best practices, to provide a secure environment for dApps like decentralized exchanges, lending platforms, and NFT marketplaces.\n\nAs is standard amongst Layer-2s, Coinbase’s Base offers full EVM (Ethereum Virtual Machine) compatibility at a fraction of the cost. The beauty of the EVM means that all existing Ethereum-based smart contracts and infrastructure work seamlessly with Base, making it easier for developers to build and deploy their dApps.\n\nOn top of that, Base’s rollup architecture significantly reduces costs for users. By ‘rolling up’ Base transactions into one neat pile off-chain and securing it on the Ethereum mainnet, gas fees on the Base chain cost little more than a few cents. Like other Layer-2s, such as Arbitrum (ARB) and Polygon zkEVM, Base helps to resolve Ethereum’s infamous scalability concerns.\n\nHow Is Base Different from Other Layer-2s?\n\nUnderneath the hood, there isn’t much that separates Base from other optimistic rollups and Ethereum Layer-2s. Thanks to the OP Stack, a standardized set of open-source tools and software for Layer-2 development, Base’s network architecture closely resembles Optimism (OP).\n\nHere’s the kicker. Coinbase is one of the most trusted and respected names in the space. The Coinbase cryptocurrency exchange boasts over 11 million verified users, many of whom haven’t ventured outside of top cryptos like Bitcoin (BTC) and Ether.\n\nBase represents a trusted path for these fringe crypto enthusiasts to make the leap and explore the world of decentralized Web3 apps from the safety of a familiar company. To give you an idea, the release of the Binance Smart Chain guided millions of users through their first blockchain transactions.\n\nWhat Does Coinbase’s Base Chain Mean for the Crypto Space?\n\nBy introducing Base Chain, Coinbase gives its users practical first-hand knowledge about blockchain technology and provides a low-cost environment for DeFi users and on-chain traders to access financial services.\n\nMoreover, Base Chain could bring liquidity to the on-chain environment. If Coinbase users decide to leave the comfort of their favorite crypto exchange, that would mean that more people are embracing self-custody and decentralized services.\n\nWhat Can I Do on Base Chain?\n\nBase Chain will be very familiar if you’ve ever used another Layer-2 blockchain like Arbitrum or Optimism. By design, Base essentially offers the same utility and use cases as the Ethereum mainnet with the added benefit of faster transactions and lower fees.\n\nBase DeFi\n\nJust days after Base’s mainnet launch, dozens of native decentralized exchanges have already been deployed by eager community developers, with LeetSwap and RocketSwap taking the lion’s share of TVL (Total Value Locked). Amongst the newcomers, classic DeFi apps like SushiSwap have already added support for the Base network, while AAVE has pledged to deploy lending services on Coinbase’s blockchain.\n\nNFTs and Gaming on Base\n\nAccording to the Base website, iconic Web3 gaming like Animoca Brands and NFT platforms like Magic Eden are part of the community of builders on Base.\n\nGiven the immense number of crypto projects supported by Coinbase Ventures, the crypto exchange’s venture capital arm, more emerging businesses are likely to integrate Base chain into their platform.\n\nGet Rugged?\n\nIronically, the big unifying story of Base’s first week of operation is the terrible tale of a classic meme coin rug pull. $BALD, a meme coin that was no doubt named after Coinbase’s founder, exploded overnight, running over 300,000% in a mere 13 hours. The hype was palpable, with almost every trader on the network having some exposure.\n\nIn a flash, the coin deployer pulled liquidity on the coin, leaving investors and traders scrambling to salvage what was left of their holdings. As a result, BALD’s price plummeted over 90% in value, with the deployer securing over $5 million USD in profit.\n\nRumors amongst the crypto community suggest that the scam artist behind BALD is none other the Sam Bankman-Fried, the disgraced founder and CEO of the FTX cryptocurrency exchange. It is speculated that SBF orchestrated the rugpull to prove the fraudulence of the crypto market and discredit Coinbase, which is currently in the grips of a legal battle with the SEC.\n\nWill There Be a BASE Token?\n\nCoinbase has declared that they have no intention of creating a network token for Base Chain. Instead, ETH will serve as the native gas token for transactions on the network. This decision aligns with Base Chain’s design as an Ethereum Layer-2 solution, leveraging the security and functionality of the Ethereum network.\n\nAt the same time, it’s important to note that the crypto landscape is dynamic, and plans can change over time. When Arbitrum first launched, the Arbitrum Foundation claimed there would never be an ARB token. Where are we now?\n\nIt should go without saying but don’t take any unofficial announcements about BASE tokens seriously. Anyone sliding into your DMs saying you qualify for a BASE crypto airdrop is trying to scam you.\n\nBase Chain Pros and Cons\n\nLike any technology, Base Chain comes with its own set of advantages and potential drawbacks. Understanding these can help users and developers make informed decisions about using Base Chain.\n\nPros\n\nAccessible – Base Chain is EVM-compatible, making it easy for users and developers to port over to the network.\n\n– Base Chain is EVM-compatible, making it easy for users and developers to port over to the network. Low Cost – Like most optimistic rollups, Base Chain boasts gas fees that only cost a few cents.\n\n– Like most optimistic rollups, Base Chain boasts gas fees that only cost a few cents. Secure and Scalable – Base combines Ethereum’s security with Layer-2 transaction speeds to offer a scalable network.\n\n– Base combines Ethereum’s security with Layer-2 transaction speeds to offer a scalable network. Backed by Coinbase – Coinbase is one of the most trusted businesses in the crypto space, with deep pockets to support the growth and development of Base.\n\nCons\n\nUnproven – As a new player in the blockchain space, Base’s architecture hasn’t been truly put to the test yet.\n\n– As a new player in the blockchain space, Base’s architecture hasn’t been truly put to the test yet. Competition – The Layer-2 field is arguably the most competitive niche in crypto, with rivals like Arbitrum and Polygon gunning for L2 dominance.\n\n– The Layer-2 field is arguably the most competitive niche in crypto, with rivals like Arbitrum and Polygon gunning for L2 dominance. Centralization – Although Base Chain is committed to progressive decentralization, the fact that it’s the brainchild of Coinbase raises concerns about centralization.\n\nOn The Flipside\n\nAlmost every crypto exchange now has its own dedicated blockchain network. Binance has BNB Chain, KuCoin has KCC, and even OKX has OKC. Apart from BNB Chain, none of these networks have sustained high usage. Why should Coinbase’s Base be any different?\n\nWhy This Matters\n\nCoinbase has over 11 million verified users, but many of these accounts have never taken their funds off the crypto exchange or used dApps due to the risks involved with self-custody. Base chain might be the network that gives these users the confidence and peace of mind to take this key step into the crypto world.\n\nFAQs"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1hdWd1c3QtdHJhZGluZy1hY3Rpdml0eS1wbHVtbWV0cy10aGUtcmVhc29uLXdoeS1pcy1vYnZpb3VzL9IBXmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1hdWd1c3QtdHJhZGluZy1hY3Rpdml0eS1wbHVtbWV0cy10aGUtcmVhc29uLXdoeS1pcy1vYnZpb3VzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 13 Aug 2023 07:00:00 GMT",
        "title": "Ethereum: August’s trading activity falls, the reason is obvious - AMBCrypto News",
        "content": "ETH reserves across centralized crypto exchanges fell to a five-year low.\n\nStaked ETH supply has been hitting new all-time highs almost daily.\n\nEthereum’s [ETH] liquid supply plummeted to new depths, as seasoned investors explored options other than active trading.\n\nAs per a recent update by on-chain analytics firm Glassnode dated 11 August, ETH reserves across centralized crypto exchanges fell to a five-year low of 15.1 million ETH. To put this in context, the amount represented just 12.57% of all ETH tokens in circulation, down from roughly 30% in mid-2020.\n\n? #Ethereum $ETH Balance on Exchanges just reached a 5-year low of 15,098,313.415 ETH Previous 5-year low of 15,099,982.201 ETH was observed on 01 August 2023 View metric:https://t.co/1dCpD2ey8E pic.twitter.com/TpipEZfhE0 — glassnode alerts (@glassnodealerts) August 11, 2023\n\nIs your portfolio green? Check out the Ethereum Profit Calculator\n\nTrading activity dries up\n\nSince the beginning of 2023, exchange supply has progressively reduced, marking a decisive shift in sentiment towards HODLing and staking.\n\nData from Token Terminal corroborated the aforementioned assertion. After hitting a crescendo in March, monthly ETH trading volumes have fizzled out.\n\nIn fact, August started on a much weaker note, recording volumes of just $66 billion as of this writing. If no substantial bullish or bearish event emerges, August could finish up with the dubious distinction of clocking the lowest monthly ETH volumes in 2023.\n\nDiamond hands stay put\n\nLong-term holders (LTH) have shown less willingness to let go of their ETH stashes. Dormant supply i.e. coins that haven’t moved in a particular time span, have been charging to new highs lately.\n\nAccording to data from Glassnode, the supply being held for more than two years but less than three years shot up to a 20-month high of 13.1 million ETH.\n\nA cursory glance at historical price charts was enough to reveal the factors driving HODLing for the aforementioned user cohort. Most of these investors acquired ETH during the historic bull market of 2020-21 when ETH reached new highs.\n\nDespite a spirited recovery in 2023, the price of ETH has not risen sufficiently since then. It’s possible that prompted the experienced traders to play the waiting game until the market regains bull momentum.\n\nRead Ethereum’s [ETH] Price Prediction 2023-24\n\nStaking remains a hot trend\n\nHowever, not everyone was HODLing to wait for the next bull cycle. Some traders took their ETH holdings out of the market and locked them up to generate passive income.\n\nThe launch of the Shapella upgrade spurred a new wave of optimism in ETH staking. Staked ETH supply has been hitting new all-time highs (ATH) almost on a daily basis since Shapella went live. The latest update by Glassnode revealed a total of 27.35 million ETH deposited in Ethereum’s staking contract."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMDgvMTIvdm95YWdlci1tb3Zlcy0yNTBiLXNoaWJhLWludS1hbmQtMS01ay1ldGhlcmV1bS10by1jb2luYmFzZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 12 Aug 2023 07:00:00 GMT",
        "title": "Voyager Moves 250B Shiba Inu and 1.5K Ethereum to Coinbase - The Crypto Basic",
        "content": "Bankrupt crypto lender Voyager shifts massive amounts of Shiba Inu coins (SHIB) and Ethereum (ETH) to Coinbase.\n\nBankrupt crypto lender Voyager has transferred over $5 million of its assets to San Francisco-based exchange Coinbase.\n\nIn a tweet shared today by Wu Blockchain, Voyager transferred a whopping 1,500 units of ETH ($2.77 million) and 250 billion units of SHIB ($2.7 million) to Coinbase.\n\nBankrupt crypto firm Voyager transferred 1,500 ETH ($2.77 million) and 250 billion SHIB ($2.7 million) to Coinbase. Additionally, Voyager is moving all remaining tokens to the main address. There are currently about $81.63 million worth of cryptocurrency in Voyager addresses.… — Wu Blockchain (@WuBlockchain) August 12, 2023\n\n- Advertisement -\n\nNotably, the combined value of the crypto assets moved by Voyager is worth $5.47 at the time of the report.\n\nVoyager Moves Its Assets to Main Address\n\nWhile the recent transfer may seem substantial, it is nothing compared to Voyager’s extensive crypto portfolio.\n\nWu Blockchain said Voyager recently moved its remaining tokens to the main address. Per the media outlet, Voyager still holds various crypto assets valued at around $81.63 million.\n\n- Advertisement -\n\nVoyager’s Past Transfers of ETH & SHIB\n\nIt bears mentioning that Voyager has been moving huge amounts of its assets to Coinbase since it filed for bankruptcy. As reported by the Crypto Basic in March, Voyager shifted 250 billion SHIB (worth around $3 million) to Coinbase.\n\nIn addition, the crypto lender also moved 17,000 ETH and 12 million Voyager tokens (VGX) in different transactions. In a similar development, PeckShield reported that Voyager transferred 250B SHIB and 15K ETH to Coinbase in February.\n\n#PeckShieldAlert Voyager has transferred $28.7M worth of cryptos to crypto-exchanges, including 15k $ETH ($25.3M) to BinanceUS & Coinbase ($ETH at $1,675) & 250B $SHIB ($3.4M) to Coinbase\n\nVoyager received 105k $ETH ($ETH at $1,559 on the day of transfer) from FTX on 7th Sep. 2022 https://t.co/WiFFMRgQr0 pic.twitter.com/qw0uYvXNka — PeckShieldAlert (@PeckShieldAlert) February 16, 2023\n\nAs reported earlier, Voyager sold a whopping 5.62 trillion SHIB coins between February and March 2023. While Voyager sells most of its assets on Coinbase, the crypto lender also uses Binance.US and Wintermute.\n\nSHIB & ETH Prices Soar Despite Voyager’s Transfers\n\nIt is worth noting that the recent transfers did not negatively impact SHIB and ETH prices. At the time of writing this line, Ethereum is up 1%, trading around $1,848.\n\nOn the other hand, Shiba Inu has risen over 9% over the past 24 hours, changing hands at $0.00001091."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiJmh0dHBzOi8vd3d3Lm9reC5jb20vbGVhcm4vd2hhdC1pcy1iYXNl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 13 Aug 2023 07:00:00 GMT",
        "title": "Comprehensive guide to Base: The new Ethereum layer 2 challenger - OKX",
        "content": "Layer 2 (L2) solutions help to enhance Ethereum's scalability, making it more accessible to a larger audience. Two notable L2 options are Optimistic Rollups (OP) and Plasma (POL). OP allows fast off-chain transactions by assuming their validity unless challenged.\n\nAt the same time, Plasma boosts scalability via child chains (which are smaller copies of the Ethereum mainnet) linked to the main Ethereum chain, batching transactions off-chain and committing them periodically to the primary chain. Both aim to augment Ethereum's capacity while maintaining its inherent security.\n\nThe latest buzz is around Base, an advanced new L2 solution designed to provide a secure, economical, and developer-centric platform for on-chain construction. It's been developed in collaboration with Optimism on the OP Stack framework.\n\nWhat's Base?\n\nImagine a bustling city that only has a single main highway. As more people move to the city and buy cars, this highway becomes congested. That's Ethereum layer 1 (L1) – the main Ethereum blockchain.\n\nTo deal with the traffic, the city constructs overhead express lanes that are faster and can accommodate more cars, but they're still part of the city's road network. These express lanes are what we refer to as Ethereum L2.\n\nWhat is Ethereum layer 2?\n\nEthereum L2 refers to a secondary framework or protocol built on the existing Ethereum blockchain (L1). The purpose of this layer is to increase the network's capacity, thereby allowing for more transactions per second, reducing fees, and alleviating congestion on the primary layer.\n\nHow does Base fit into this?\n\nUsing our highway analogy, Base is like a newly constructed express lane. It's built to be fast, secure, and efficient. Since Base is built as an Ethereum L2, it operates on top of the main Ethereum network, benefiting from its underlying security while providing multiple advantages:\n\nIncreased transaction throughput\n\nIncreased scalability\n\nLower gas fees\n\nImproved privacy and security\n\nBase launched its testnet back in February of this year, and with the 'on-chain summer' event in full swing, the mainnet has recently launched. There are currently over 100+ decentralized applications (DApps) and service providers in the Base ecosystem.\n\nHowever, be aware of potential scammers. Base does not have its own network token and there are no intentions to release one in the future. While some L2s have their own tokens, Base stands out with its tokenless design, made possible largely due to backing from Coinbase. Always stay vigilant and avoid falling for fraudulent claims or schemes related to a so called Base token.\n\nWhat are Base's main features?\n\nNow we've explored Base's role in the L2 ecosystem, here's a breakdown of the advantages Base brings.\n\nLeveraging Ethereum's robustness\n\nBase is meticulously engineered to align seamlessly with Ethereum's primary network. This allows developers to deploy any Ethereum Virtual Machine (EVM) codebase onto Base, paving the way for existing DApps to transition or work in tandem without hitches.\n\nCollaborative spirit\n\nWith its open-source DNA, Base is not just a platform — it's a collaborative endeavor. Its partnership with Optimism underscores its commitment to pushing the boundaries of what's possible in DApps.\n\nEconomical and efficient\n\nJust like express lanes designed for rapid cross-city commuting, Base offers the extensive capabilities of Ethereum but without the hefty price tag. It serves as a haven for DApps, delivering a full EVM experience at a fraction of the customary Ethereum fees.\n\nPioneering additions\n\nBase doesn't just emulate Ethereum's capabilities — it elevates them. Developers are equipped with new and inventive Ethereum tools such as Account Abstraction (ERC4337), gasless transaction APIs, and sophisticated smart contract wallets.\n\nSolidifying ties with Coinbase\n\nBase is uniquely positioned to streamline the transition of users and assets from traditional finance to Ethereum's decentralized realm. This integration offers unparalleled access to Coinbase's products, user base, and tools.\n\nA commitment to decentralization\n\nTrue to the core values of the crypto sphere, Base champions the cause of decentralization. While tied to Coinbase, Base is charting a course towards a progressively decentralized architecture, underscoring its dedication to trust, transparency, and inclusivity.\n\nSecurity as a priority\n\nDrawing strength from Ethereum's impeccable security features, coupled with the tried and tested best practices of Coinbase, Base stands as a fortress in decentralized applications.\n\nCost-effective evolution\n\nBy achieving full EVM equivalence, Base offers the richness of Ethereum's environment but in a more cost-effective manner — a testament to its commitment to accessibility and affordability.\n\nWhy Base?\n\nFor some, the crypto and blockchain ecosystems can be daunting, hindering the widespread adoption of DApps for daily use. With Base, as an L2 solution, DApps can become both user-friendly and economical. It makes sure of lower transaction fees, especially compared to the high fees seen during peak periods on their L1 counterparts.\n\nUsers can start their journey into the cryptoeconomy through Base, which acts as a bridge to various blockchain ecosystems. The platform offers a default on-chain experience and the ability to interact with multiple chains' products. For broad accessibility, Base emphasizes interoperability with different chains and, aligned to this, Coinbase aims to support multiple chains across its product range.\n\nCollaborative efforts often bolster decentralization. In conjunction with OP Labs, the Base is pooling its engineering expertise to devise features that potentially enhance decentralization. It's anticipated that external contributions will play a pivotal role in augmenting the decentralization of the broader cryptoeconomic platform.\n\nWorking collaboratively has profound implications for decentralization. Institutions such as Coinbase, Base, OP Labs, and the Optimism Collective actively pursue avenues to decentralize decision-making and control within the OP Stack and the Superchain. By jointly establishing key governance structures, the intention is to integrate decentralization into vital segments of the OP Stack architecture, which could influence the decentralization level of associated rollups.\n\nWhat's the Base ecosystem?\n\nThe Base Ecosystem Fund, with financial backing from Coinbase, can help secure a growing commitment towards advancing the DeFi ecosystem. This fund is specifically designed to propel early-stage innovations aiming to blossom on the Base platform.\n\nWhile there's no shortage of promising ideas in the crypto space, Base has strategically positioned itself as an incubator for those crypto-native visionaries who are in the nascent stages of their project development, particularly those focusing on decentralized exchanges (DEXs), lending, NFTs, and more.\n\nBase is keenly exploring an interesting niche — flatcoins, which is a type of stablecoin tethered to inflation rates. These digital assets aim to provide users with both stability in purchasing power and resilience against economic fluctuations. This need has become ever more crucial in light of the current global banking challenges. Base recognizes the importance of forging trust in an on-chain environment. The fund encourages projects working on decentralized identity and reputation and those crafting advanced decentralized exchanges with the potential for high throughput.\n\nAs DeFi continues to scale, ensuring the security and reliability of platforms and protocols becomes crucial. The Base Ecosystem Fund, therefore, also champions builders crafting tools and systems to make DeFi more secure, aiming to make on-chain storage safer for everyone.\n\nThe road ahead for Base\n\nIn February 2023, Base took a significant step forward by launching its testnet. This innovative platform has attracted praise from developers across the industry, characterizing it as a secure, economic, and developer-centric Ethereum L2.\n\nBase's mainnet is accessible to all users. Over 100 DApps, protocols, and brands, such as Coca-Cola, OpenSea, and Aave, have been integrated into the network. To mark its launch, Base is initiating an \"Onchain Summer\" campaign that includes daily NFT distributions and incentives for users engaging with the network's DeFi platform. If you're a developer looking to build on Base, here are some helpful tools to get you started.\n\nThe final word\n\nBase, an L2 solution, makes the crypto and blockchain realms more approachable, paving the way for the mainstream adoption of DApps. Addressing the sometimes high transaction costs of L1s, Base offers lower fees and acts as a bridge to multiple blockchains.\n\nIt prioritizes chain interoperability, mirroring Coinbase's multi-chain support ambitions. Collaborating with OP Labs, Base augments decentralization features, with external input deemed crucial for the platform's holistic decentralization.\n\nInstitutions like Coinbase, Base, OP Labs, and the Optimism Collective emphasize decentralization in decision-making processes. Together, they aim to embed decentralization deeply within the OP Stack framework and related rollups.\n\nBase is now live on the OKX wallet. Start exploring today.\n\nDisclaimer\n\nTHIS ARTICLE IS PROVIDED FOR INFORMATIONAL PURPOSES ONLY. IT IS NOT INTENDED TO PROVIDE ANY INVESTMENT, TAX, OR LEGAL ADVICE, NOR SHOULD IT BE CONSIDERED AN OFFER TO PURCHASE OR SELL OR HOLD DIGITAL ASSETS. DIGITAL ASSET HOLDINGS, INCLUDING STABLECOINS, INVOLVE A HIGH DEGREE OF RISK, CAN FLUCTUATE GREATLY, AND CAN EVEN BECOME WORTHLESS. YOU SHOULD CAREFULLY CONSIDER WHETHER TRADING OR HOLDING DIGITAL ASSETS IS SUITABLE FOR YOU IN LIGHT OF YOUR FINANCIAL CONDITION. PLEASE CONSULT YOUR LEGAL/TAX/INVESTMENT PROFESSIONAL FOR QUESTIONS ABOUT YOUR SPECIFIC CIRCUMSTANCES."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9kb25hbGQtdHJ1bXAtaG9sZHMtYmV0d2Vlbi0yNTBrLWFuZC01MDBrLXdvcnRoLW9mLWV0aC_SAVNodHRwczovL2NyeXB0b3BvdGF0by5jb20vZG9uYWxkLXRydW1wLWhvbGRzLWJldHdlZW4tMjUway1hbmQtNTAway13b3J0aC1vZi1ldGgvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 13 Aug 2023 07:00:00 GMT",
        "title": "Donald Trump Holds Between $250K and $500K Worth of ETH - CryptoPotato",
        "content": "Donald Trump’s latest public financial disclosure shows that he holds between $250,000 and $500,000 worth of Ethereum (ETH).\n\nTrump’s 2023 OGE financial disclosure documents, released recently, featured an item described as a “Cryptocurrency Wallet (Ethereum),” whose value the former President placed between $250,000 and $500,000.\n\nThe content of the crypto wallet is likely tied to the sale of non-fungible tokens (NFTs) he launched in December 2022 after exiting the White House.\n\nThe limited edition NFT collection sold out within a day and comprised 44,000 digital trading cards featuring the former President in different costumes and poses.\n\nAccording to reports, Trump’s NFT adventure netted upwards of $8.9 million in sales, earning him about $298,000 in licensing fees. The crypto wallet through which the earnings were collected is held under the same Trump entity, CIC Digital, that collected these licensing fees.\n\nFormer first lady Melania Trump also briefly dabbled in NFTs, turning several popular images from NASA’s Apollo moon landings into digital pieces that sold for $75 each. However, NASA criticized the venture, stating it violated the space agency’s merchandising regulations.\n\nIt is interesting that Trump now holds crypto, considering his past skepticism. In 2019, he stated he was “not a fan” of Bitcoin (BTC), which he described as “not money” and whose value he claimed was “based on thin air.”\n\nIn 2021, at the height of his re-election campaign, Trump reiterated his stance on crypto, calling the asset class “fake.”"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vZGVjcnlwdC5jby8xNTIzNjEvZG9uYWxkLXRydW1wLWV0aGVyZXVtLWNyeXB0by1ob2xkaW5nc9IBRWh0dHBzOi8vZGVjcnlwdC5jby8xNTIzNjEvZG9uYWxkLXRydW1wLWV0aGVyZXVtLWNyeXB0by1ob2xkaW5ncz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 13 Aug 2023 07:00:00 GMT",
        "title": "Donald Trump, Long Skeptical of Crypto, Holds Up to $500,000 In Ethereum - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nDonald Trump holds up to half a million in cryptocurrency, according to a recently released financial disclosure form submitted to a federal ethics agency.\n\nA filing submitted to the Office of Government Ethics included a listing of assets and other sources of income belonging to the former president. In one line on the second to last entry of the 82-page form, it lists a “cryptocurrency wallet (Ethereum)” with a value between $250,000 and $500,000.\n\nThe wallet appears to be connected to a line of non-fungible tokens (NFT) that his campaign launched as part of his bid to return to the White House in 2024 after his previous defeat to President Joe Biden in 2020.\n\nAD\n\nAD\n\nThe NFTs, a collection of virtual trading cards that feature illustrations of Trump in myriad poses as a superhero, cowboy, or astronaut, launched for $99 each in December 2022.\n\nSales of the tokens took off in the following months, including after his first indictment by a state court in New York, before dropping off after the candidate launched a second batch in April that crashed the first set’s value.\n\nTrump’s ownership of a crypto wallet comes against a backdrop of historically critical comments he has made about cryptocurrencies, as he questioned their value in ways more akin to his Democratic Party rivals than his Republican peers.\n\nWhen he was in office, Trump tweeted only once about crypto. In July 2019, he said that he was \"not a big fan of Bitcoin and other cryptocurrencies.\" Anthony Scaramucci, Trump's former communications director at the White House, later told Decrypt that he suspects Trump himself did not author the now-deleted tweet.\n\nAfter losing his re-election bid in 2020, Trump went on to tell Fox Business in June 2021 that Bitcoin—the first and most widely traded cryptocurrency—“just feels like a scam,” and made it clear that he prefers fiat currency.\n\nAD\n\nAD\n\n“I don’t like it, because it’s another currency competing against the dollar. I want the dollar to be the currency of the world. That’s what I’ve always said,\" Trump told Fox's Stuart Varney.\n\nTrump’s aversion to crypto comes in stark contrast to the warm embrace extended to the technology by others in his party. Since taking control of Congress, Republicans in the House and Senate have worked to advance new bills providing regulations for crypto that have been cheered on by the industry—albeit with some misgivings.\n\nAmong his GOP rivals for the White House, there have been a few who have staked out pro-crypto stances.\n\nMiami Mayor Francis Suarez and entrepreneur Vivek Ramaswamy have been publicly supportive of cryptocurrency adoption. Florida Gov. Ron DeSantis has also promised to end what he says is the Biden administration’s “war on Bitcoin” if elected. All of these candidates remain far behind Trump in opinion polling.\n\nOn the Democratic side, long-shot Democratic Party candidate Robert F. Kennedy Jr. has been publicly vocal about his support for cryptocurrencies. He revealed that he and his family own about 14 Bitcoin after previously saying he was not an investor."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMikQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOC8xMi9vbmUtbWlkLWNhcC1ldGhlcmV1bS1hbmQtc29sYW5hLXJpdmFsLWlzLWZsYXNoaW5nLWEtYnVsbGlzaC1zaWduYWwtYWNjb3JkaW5nLXRvLWNyeXB0by1hbmFseXRpY3MtZmlybS1zYW50aW1lbnQv0gGVAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA4LzEyL29uZS1taWQtY2FwLWV0aGVyZXVtLWFuZC1zb2xhbmEtcml2YWwtaXMtZmxhc2hpbmctYS1idWxsaXNoLXNpZ25hbC1hY2NvcmRpbmctdG8tY3J5cHRvLWFuYWx5dGljcy1maXJtLXNhbnRpbWVudC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 12 Aug 2023 07:00:00 GMT",
        "title": "One Mid-Cap Ethereum and Solana Rival Is Flashing a Bullish Signal, According to Crypto Analytics Firm Santiment - The Daily Hodl",
        "content": "A top-50 altcoin by market cap could be on the verge of an upside move, according to blockchain analytics platform Santiment.\n\nThe analytics platform says that the native token of smart contract-enabled blockchain Aptos (APT) could reach “another higher high” after partnering with software maker Microsoft on artificial intelligence (AI) and web3 projects.\n\n“Aptos has decoupled after its partnership with Microsoft was announced to build AI tools for blockchain integrations. The crowd showed major FOMO (fear of missing out) but has calmed down. However, rising volume and developer activity may foreshadow another higher high.”\n\nAptos is trading at $7.12 at time of writing, up by over 7% in seven days.\n\nSantiment also says that Shiba Inu (SHIB) is performing relatively better compared to other mid and low-cap altcoins as traders increasingly turn their attention to the second-largest memecoin.\n\n“Prices are mildly up for altcoins today, but most mid and small caps are still struggling to gain any traction on the weekly time frame. Many traders have shifted their focus to Shiba Inu, as the memecoin is one of the few bright spots. SHIB is +19% with rising social volume.”\n\nShiba Inu is trading at $0.0000118 at time of writing, up over 12% in the last 24 hours.\n\nTurning to Ethereum (ETH), Santiment says that the ten largest addresses of the second-largest crypto asset by market cap now hold more than a third of the supply.\n\n“Ethereum has been seeing its top 10 addresses expand and accumulate more and more of the total available coin supply. In five years, the top 10 largest addresses have gone from owning 11.2% to now 34.6% of ETH. The 27.86 million ETH added is worth $51.6 billion.”\n\nEthereum is trading at $1,848 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vdS50b2RheS9jYXJkYW5vLWZvdW5kZXItdGFrZXMtc3dpcGUtYXQtZXRoZXJldW0tYW1pZC1zdGFraW5nLWRlYmF0ZdIBT2h0dHBzOi8vdS50b2RheS9jYXJkYW5vLWZvdW5kZXItdGFrZXMtc3dpcGUtYXQtZXRoZXJldW0tYW1pZC1zdGFraW5nLWRlYmF0ZT9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 13 Aug 2023 07:00:00 GMT",
        "title": "Cardano Founder Takes Swipe at Ethereum Amid Staking Debate - U.Today",
        "content": "Charles Hoskinson, founder of Cardano, recently took a jab at Ethereum, referencing a video clip where developer Justin Drake comments about staking, \"I think that part of the reason is that when you make the sausage, you know how it's made.\"\n\nAdvertisement\n\nThe colloquialism, alluding to the undesirable aspects of sausage-making, was interpreted by some to be an honest dig at the murky processes behind Ethereum staking.\n\nAs reported by U.Today, Ethereum founder Vitalik Buterin previously explained that his apprehensions about staking his Ether revolve around security and operational complications.\n\nHe highlighted that staking Ethereum requires public visibility of user's keys, which subsequently raises safety red flags. The utilization of multi-signature (multi-sig) wallets, while enhancing security, adds a layer of complexity.\n\nWith Buterin's considerable wealth, estimated between $1.46-$1.5 billion, the challenge of managing and ensuring the safety of multiple wallets becomes evident. Despite these concerns, Buterin's \"small bit\" in staking could still represent a substantial sum, considering his estimated wealth.\n\nHoskinson's jab at Ethereum is not an isolated event; it adds to a history of critiques aimed at the platform. Previously, he labeled Ethereum as \"a dumpster fire\" and even predicted its potential decline, likening it to the eventual obsolescence of earlier internet platforms.\n\nIn a bolder prediction, Hoskinson hinted at the possibility of Ethereum transitioning to the Cardano platform in the future, emphasizing Cardano's promise of enhanced speed, cost-efficiency and user volume."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ob3ctZXRoZXJldW1zLWludGVncmF0aW9uLXdpdGgtdmlzYS1jYW4tZWFzZS10aGluZ3MtZm9yLWV0aC1ob2xkZXJzL9IBXmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ob3ctZXRoZXJldW1zLWludGVncmF0aW9uLXdpdGgtdmlzYS1jYW4tZWFzZS10aGluZ3MtZm9yLWV0aC1ob2xkZXJzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 12 Aug 2023 07:00:00 GMT",
        "title": "How Ethereum’s integration with Visa can ease things for ETH holders - AMBCrypto News",
        "content": "Visa aims to make Ethereum transactions easier with its new solution.\n\nETH has reportedly settled 33 trillion worth of transactions as compared to Visa’s 11 million.\n\nEthereum gas fees have been quite controversial in the past but the network has been making efforts to make it easier for its users. The latest effort surprisingly comes from global payments processor, Visa.\n\nRead Ethereum’s [ETH] price prediction 2023-24\n\nEthereum users will reportedly be able to use their Visa cards to pay for gas fees. Paying for gas fees on the Ethereum network has some complications such as having to fund your account with ETH. In addition, fluctuating ETH prices add to the complexities of facilitating transactions on the network.\n\n1/ ? @Visa is making major moves to simplify #blockchain transactions. Their latest experiment? Paying on-chain gas fees with a Visa card. The aim: to cut down on the complexity of managing #ETH balances for fees. ? #VisaCrypto via @akibablade https://t.co/EdjI2suUs9 — CryptoSlate (@CryptoSlate) August 11, 2023\n\n\n\nVisa plans to help ease those challenges through its Cybersource network to facilitate direct off-chain gas fee payments. Users will not need to hold ETH for gas fee payments. It will instead send a digital signature to the user’s wallet for payment approval.\n\nIf you can’t beat them, join them\n\nVisa’s new solution highlights its efforts toward becoming more entrenched in blockchain payments. Ethereum represents the ideal route thanks to its widespread adoption.\n\nVisa’s interest in Ethereum is not surprising. The blockchain network has reportedly settled more than $33 trillion worth of transactions. Meanwhile, Visa has so far settled $11.6 million worth of transactions despite being older.\n\nEthereum has already settled over $33.4T+ On-Chain since genesis. Stablecoin accounts for more than 50% of the volume Compared to Visa, it has processed $11.6T Payment volume and Ethereum settled $12T total volume in 2022 https://t.co/jUM4BeQvmQ pic.twitter.com/qNo1UOaT3r — Tom Wan (@tomwanhh) August 8, 2023\n\nThe transaction figures underscore the robust growth that the Ethereum network has achieved. It is not surprising that Visa was a piece of the pie, hence its involvement. Although Visa’s new solution represents a significant step in improving transactions, a recent IntoTheBlock analysis reveals that Ethereum fees have been declining.\n\nEthereum fees have dropped significantly this week by 21.2%, reaching a two-month low. This decline coincides with a period of stagnating volatility.#ETH pic.twitter.com/jgk23bbv1v — IntoTheBlock (@intotheblock) August 11, 2023\n\n\n\nA potentially major reason behind the decline is the fact that the market has been in a slow phase for the last few weeks. This phase is underscored by fewer network transactions. However, on-chain data revealed that Ethereum maintained decent activity despite the market slowdown.\n\nAccording to Glassnsode metrics, Ethereum’s gas used metric has improved considerably in the last four weeks. It bottomed out at 106.8 billion ETH on 15 July and stood at 107.79 billion ETH as of 10 August.\n\nIs your portfolio green? Check out the Ethereum Profit Calculator\n\nEthereum’s transaction count was lowest on 16 July (within the last four weeks) at 917,146 transactions. It was highest two days later at 1.4 million transactions and the latest readings reveal that it averaged slightly over 1 million transactions on 10 August. For comparison, its highest single-day transactions peaked at 1.9 million transactions."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOC8xMy9zb2xhbmEtc29sLWxvb2tzLWxpa2UtZXRoZXJldW0taW4tMjAxOC13aXRoLXBvdGVudGlhbC10by1kby13ZWxsLXNheXMtZXgtZ29sZG1hbi1zYWNocy1leGVjdXRpdmUv0gGGAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA4LzEzL3NvbGFuYS1zb2wtbG9va3MtbGlrZS1ldGhlcmV1bS1pbi0yMDE4LXdpdGgtcG90ZW50aWFsLXRvLWRvLXdlbGwtc2F5cy1leC1nb2xkbWFuLXNhY2hzLWV4ZWN1dGl2ZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 13 Aug 2023 07:00:00 GMT",
        "title": "Solana (SOL) Looks Like Ethereum in 2018 With Potential To Do Well, Says Ex-Goldman Sachs Executive - The Daily Hodl",
        "content": "Former Goldman Sachs executive Raoul Pal says that Solana (SOL) looks reminiscent of Ethereum (ETH) during its bear market of 2018 and 2019.\n\nIn a new interview, the Real Vision founder says that SOL, which is his second biggest crypto portfolio allocation, is most likely about to repeat Ethereum’s dramatic recovery from a bear market to new highs just years ago.\n\n“It’s still my second largest holding. I really like it. It reminds me of ETH in 2018-2019. I think there’s a huge amount of activity. I think [Solana founder Anatoly Yakovenko] has proven himself to be one of the better leaders and thinkers in this space, kind of in the Vitalik [Buterin] mode. I think the developer activity is great. I think on-chain activity is great. The Innovation is great. So, there is a probabilistic outcome that it does well.\n\nIt doesn’t mean I’m right or wrong, but yes, I’m still very interested in Solana.”\n\nAccording to Pal, crypto is part of the biggest macro setup in history as he believes the asset class will directly benefit from the rapid evolution of technology and the debasement of fiat currencies.\n\n“I’ve seen what I think is the biggest macro setup of all time, which is the exponential age meets crypto meets quantitative easing. Those are so explosive and I think it repeats over the next few years, but I want to have all of my excess savings in that. Because it’s a once-in-a-lifetime opportunity to me.”\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Quardia"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vdS50b2RheS9zb2xhbmEtc29sLW1pZ2h0LXJlcGVhdC1ldGhlcmV1bS1ldGgtcGVyZm9ybWFuY2UtaW4tbmV4dC1idWxsLXJ1btIBVWh0dHBzOi8vdS50b2RheS9zb2xhbmEtc29sLW1pZ2h0LXJlcGVhdC1ldGhlcmV1bS1ldGgtcGVyZm9ybWFuY2UtaW4tbmV4dC1idWxsLXJ1bj9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 12 Aug 2023 07:00:00 GMT",
        "title": "Solana (SOL) Might Repeat Ethereum (ETH) Performance in Next Bull Run - U.Today",
        "content": "Advertisement\n\nBased on a recent report by on-chain analyst Delphi Digital, the cryptocurrency researcher indicates a number of similarities between Ethereum's (ETH) DeFi Summer of 2020 and what Solana (SOL) might be up to in 2024.\n\n\"Safest bet\" in non-EVM chains: Analyst on Solana (SOL)\n\nAfter a massive rally in 2020 and a painful drawdown, in the next bull market, Solana (SOL) might reemerge from the ashes and repeat the performance of Ethereum (ETH). Analyst and podcaster Sal Qadir shared such conclusions with his Twitter followers yesterday, Aug. 11, 2023.\n\nQuick tl:dr of this great report @Delphi_Digital just put out:\n\n\n\n\"Ghosts of Cycles Past - The Early Innings of a New Cycle?\"\n\n\n\nI'll be focusing on what it means for @solana\n\n\n\nLet's dive in 🧵\n\n1/10 — Sal.xyz (@sal_coin) August 11, 2023\n\nBased on the four-year-cycles approach, the current performance can be compared to that of Q4, 2019, the analyst admits. At the same time, given the fact of the DeFi activity increase on Solana (SOL), the blockchain might be entering its version of Ethereum's 2020 DeFi Summer right now.\n\nAlso, in terms of total value locked in DeFi protocols, Solana (SOL) is an undisputed leader amid all L1 blockchains outside the Ethereum Virtual Machine (EVM) ecosystem.\n\nSolana's (SOL) liquid derivatives staking ecosystem has huge room for growth. Based on the ratio between all SOL staked and the TVL of Solana-based LSTs, Qadir foresees \"billions of capital\" that can be injected once SOL liquidity providers start seeking additional yield.\n\nAs covered by U.Today previously, Solana's (SOL) price might be due for an amazing comeback in 2023, based on a number of technical analysis indicators.\n\nFlashbots, NFTs might contribute to Solana (SOL) success\n\nBesides TA triggers, Solana's (SOL) potential growth might be driven by a couple of technical advancements that either have been deployed to the protocol or might be introduced in the coming months.\n\nFor instance, new-gen Solana DeFis by Jito Labs might address the problems of MEV in more advanced ways compared to mainstream Ethereum-centric protocols.\n\nAlso, with data compression scaling technology, the minting of non-fungible tokens on Solana (SOL) might be almost 3,000x cheaper than on Polygon (MATIC), Delphi's data says."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vZGVjcnlwdC5jby8xNTIyMDIvZXRoZXJldW0tZGVmaS1kYXNoYm9hcmQtZGViYW5rLWxhdW5jaGVzLWxheWVyLTItb24tb3B0aW1pc21zLW9wLXN0YWNr0gFlaHR0cHM6Ly9kZWNyeXB0LmNvLzE1MjIwMi9ldGhlcmV1bS1kZWZpLWRhc2hib2FyZC1kZWJhbmstbGF1bmNoZXMtbGF5ZXItMi1vbi1vcHRpbWlzbXMtb3Atc3RhY2s_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 12 Aug 2023 07:00:00 GMT",
        "title": "Ethereum DeFi Dashboard DeBank Launches Layer-2 on Optimism’s OP Stack - Decrypt",
        "content": "Create an account to save your articles.\n\nCreate an account to save your articles.\n\nYour Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nDeFi blockchain explorer platform DeBank has announced DeBank Chain, a new layer-2 blockchain built on Optimism’s OP Stack.\n\nBilled as an “asset later for social,” DeBank Chain is built as an optimistic rollup which claims to have reduced the “L1 data storage gas cost by 100 to 400 times.” The OP Stack is a blockchain development standard by Optimism team on which new layer-2 blockchains can be built.\n\nDeBank, a DeFi portfolio visualisation and blockchain explorer platform for Ethereum and other EVM-compatible blockchains, launched the testnet of its layer-2 network today with plans “to roll out the Mainnet in 2024.”\n\nAD\n\nAD\n\n1/7 We're excited to announce DeBank Chain, aiming to become the Asset Layer for Social! We're launching the Testnet today and it's planned to roll out the Mainnet in 2024. pic.twitter.com/Do1hwJtPGj — DeBank (@DeBankDeFi) August 11, 2023\n\nDeBank’s social media goals\n\nIn October 2022, DeBank rolled out an Ethereum L2 to facilitate DeBank Hi, a chat application embedded in its existing wallet tracking platform.\n\nUsers on the platform are paid to receive messages, creating a “market for attention.”\n\nDeBank has over 200,000 users registered on its Ethereum layer-2 network, per a Dune dashboard by Stakeridoo.\n\nThe team plans to expand DeBank Hi from a messaging app to a social media platform, DeBank Stream, where users would receive credit for “valuable contributions” on the platform.\n\nAD\n\nAD\n\nThe platform’s aim is to evaluate a “user's precise attention value” based on their social media interactions which will account for “every minute you invested, every post you published or read, every comment.”\n\nDecrypt has reached out to DeBank for comment.\n\nThe OP Stack is expanding\n\nDeBank has added to the list of new layer-2s building on the OP Stack.\n\nIt includes Coinbase’s Base, Andreessen Horowitz-backed Magi Protocol, and Binance-based BNB Chain, which launched a testnet built on the same standard on June 19, 2023."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vdGVjaG5leHQyNC5jb20vMjAyMy8wOC8xMi92aXNhLWludHJvZHVjZXMtZXRoZXJldW0tZ2FzLWZlZS1wYXltZW50LWZlYXR1cmUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 12 Aug 2023 07:00:00 GMT",
        "title": "Visa introduces Ethereum gas fee payment feature - Technext",
        "content": "Get the best of Africa’s daily tech to your inbox – first thing every morning.\n\nJoin the community now!"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2V0aGVyZXVtLXdoYWxlcy1zZXQtc2lnaHRzLW9uLWRpZ2l0b2Fkcy10aGUtbmV3LTEwMHgtbWVtZWNvaW4tcHJlc2FsZS1zZW5zYXRpb24v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 13 Aug 2023 07:00:00 GMT",
        "title": "Ethereum Whales Set Sights on DigiToads, The New 100x Memecoin Presale Sensation - Analytics Insight",
        "content": "With memecoin sensations like DigiToads (TOADS) just getting started: you don’t need any other crypto investment for success right now. With this memecoin powerhouse, your portfolio will have the potential to 100x in price over the next few months as TOADS unites memecoin superstar potential with real utility and mechanics you can enjoy along the way. And when whales make moves in this business, you should pay attention. Ethereum whales have recently spotted real potential with TOADS, and are moving some of their massive funds over. If they think TOADS will be the next big thing in crypto and the best crypto to buy right now: you should too. Here’s a bit more about why TOADS could be the perfect option for your portfolio:\n\nDigiToads (TOADS) continues to gain traction in presale\n\nThe DigiToads presale has been wowing onlookers in a big way recently. That’s because it recently smashed an impressive $6.8 million sales barrier, and this figure gets bigger every single day. Why does it keep going UP despite market turmoil across the board? TOADS has everything needed for crypto success, and early investors have enjoyed snapping up incredible discounts before its new ico launch. There isn’t much time left to enjoy these discounts, and you have already missed the biggest savings, but there’s still time left to buy TOADS tokens for only $0.05, before they go up to $0.055 on official launch day.\n\nDigiToads lets you play and win\n\nWith the best P2E mechanics ever seen in the memecoin world, you can enjoy battling it out with your own unique TOADS companions in the innovative digital swamp arena every season. Rewards are provided for by a 2% transaction tax, and can be taken as instant profit or withdrawn to your wallet and exchanged for any other major crypto. These are some of the most fun and rewarding earning mechanics ever seen in crypto, and you can enjoy battling your way to the top with your own TOADS tokens for ultimate fun and ultimate payouts.\n\nDigiToads brings real passive income to the memecoin world\n\nAlongside the P2E arena, you can also enjoy staking your own popular NFTs for long-term residual income as part of the TOADS platform. This is a separate standalone feature that allows you to sit back and count your gains with real passive and residual income potential, something no other memecoin token can match.\n\nEthereum (ETH) whales moving over\n\nSome people made a lot of money investing in Ethereum over the years as it became the most established blockchain for development and one of the biggest tokens ever. But those same upsides aren’t present if you invest in Ethereum right now, some argue it’s already at its cap. But there is still money to be made with ETH projects like TOADS, which is why whales are moving their funds over.\n\nConclusion\n\nEvery portfolio should have plenty of ETH in it, but perhaps yours should have more TOADS if you want the best gains in the business. ETH whales are already moving into TOADs with substantial investments, and there’s still time left to enjoy incredible discounts before it launches onto Uniswap. Grab this chance while you still can.\n\nVisit DigiToads Presale\n\nMint DigiToads NFTs Here\n\nBuy DigiToads NFTs on OpenSea\n\nJoin the community\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2VyYy1zdGFuZGFyZHMtZXZlcnl0aGluZy15b3UtbmVlZC10by1rbm93LWluLTIwMjMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 12 Aug 2023 07:00:00 GMT",
        "title": "ERC STANDARDS – Everything You Need to Know in 2023 - Analytics Insight",
        "content": "Discover everything about the different Ethereum standards like ERC20, ERC721, ERC1155 and more\n\nAccording to DefiLlama, Ethereum leads in terms of Total Value Locked (TVL) around $24 billion with an ecosystem of over 800 decentralised applications (dApps) based on the blockchain.\n\nThe data above signifies the popularity and robustness of Ethereum– the second-largest blockchain network in the world. With its genesis block created in July 2015 by Vitalik Buterin and Gavin Wood, the network has successfully managed to become the top choice for upcoming crypto projects.\n\nAnd the prime reason for the ever-growing usage and popularity of Ethereum is the development and maintenance of various crypto token standards by the ETH community. Some of the famous token standards include ERC20, ERC721, and ERC1155, which form the backbone of most of the stablecoins, NFTs and DeFi projects today.\n\nThis article comprehensively explains ERC standards and their pros & cons. Moreover, it also lists down different types of ERC tokens and standards widely used today.\n\nWhat is meant by ERC Standards?\n\nERC stands for ‘Ethereum Request for Comments.’ It is essentially a set of technical documentation comprising guidelines and standards for creating and managing smart contracts on the Ethereum blockchain. ERC standards state certain rules and guidelines that developers need to follow to ensure compatibility between the applications and the network.\n\nWhile Ethereum allows developers to create tokens that do not follow any crypto token standards, such tokens lack functionality and composability with other features of the network. Therefore, to enable features like transaction processing, fungibility/non-fungibility, security, and more, adhering to ERC standards is important.\n\nPros & Cons of ERC Standards\n\nPROS\n\nFacilitates composability and interaction between applications and the network\n\nEnhances the functionality of the network\n\nEnables features like token transfer functions, ownership, security and much more\n\nEstablishes a common language and set of guidelines for developers\n\nCONS\n\nRequires proper knowledge of blockchain and programming for one to understand\n\nEthereum’s core development team evaluates new token standards, causing uncertainty and delay in the deployment\n\nThe Ultimate List of All ERC Standards\n\nLet us have a look at an ERC tokens list comprising of 10 most-used token standards nowadays –\n\nERC20\n\nERC20 was one of the first Ethereum token protocols proposed in November 2015 by Fabian Vogelsteller that implements standards for fungible or interchangeable tokens. ERC20 Tokens show functionalities like balanceOf() for token balance checking, transfer() for token transfer, and approve() for transaction authorization. Due to their fungible nature, ERC20 tokens are suitable for stablecoins, utility and security tokens. Some famous ERC20 tokens are Ethereum(ETH), Chainlink(LINK), Tether(USDT) and Uniswap(UNI).\n\nERC165\n\nERC165, earlier known as EIP (Ethereum Improvement Proposal) 165 is a standard that allows smart contracts to run type introspection, an exercise of determining the properties of an object at runtime. Thus, ERC165 standard enables a smart contract to detect whether another contract implements certain features or not.\n\nERC621\n\nERC621 standard plays a key role in increasing and decreasing the total supply of circulation. This standard enhances the functionality of ERC20 tokens allowing them to be burned or redeemed for another asset.\n\nERC721\n\nHeard of NFTs? The ERC721 standard is the building block behind these Non-fungible Tokens. Unlike the ERC20, ERC721 tokens offer rarity and uniqueness. This means no ERC721 token is the same as another ERC721 token. Each NFT consists of a unique address and metadata (name or image) stored on the Ethereum network – making it easy to verify and transfer them.\n\nERC777\n\nERC777 offers extra features over the ERC20 tokens such as an emergency recover function in case the private key gets lost and a mixer contract for enhanced transaction privacy.\n\nERC827\n\nProposed in 2018, ERC827 is an Ethereum token standard that increases the functionality of ERC20 tokens by allowing users to transfer both data and currency simultaneously.\n\nERC865\n\nERC865 standard plans to reduce the transaction fee incurred by the users by introducing a function called ‘transferPreSigned’ – allowing a third party to pay the gas fees. This is helpful for dApps dealing with numerous token transfers.\n\nERC884\n\nERC884 is a proposed Ethereum standard that allows fractional ownership of assets across the blockchain. As fractional shares are economical, more users will adopt the network to buy the assets.\n\nERC1155\n\nProposed in 2018 by Witek Radomski (Enjin’s CTO), the ERC1155 standard enables the development of fungible, semi-fungible and non-fungible tokens on a single contract. This has led to a significant reduction in the number of transactions required to manage multiple types of ERC tokens and hence significantly increased the efficiency of the network.\n\nERC4626\n\nERC4626 standard is specially designed for yield-bearing vaults as it provides guidelines to optimize and combine their technical parameters. It can be beneficial for aggregators, lenders, and users as well to find the best yield for their crypto tokens.\n\nConclusion\n\nERC standards have been the driving force behind the growth and development of the Ethereum network. They provide a common set of guidelines for developers to build Native Tokens, DeFi projects, NFTs, etc. on the platform while ensuring the compatibility of these projects with other Ethereum-based applications as well. Therefore, following ERC standards is crucial for building functional, feature-rich, and seamless Ethereum-based applications.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9ob3ctY3J5cHRvLWlzLXRoZS1tb2Rlcm4tcGF0aC10by1maW5hbmNpYWwtaW5kZXBlbmRlbmNlL2FydGljbGVzaG93LzEwMjY5NjMwOS5jbXPSAYgBaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvaG93LWNyeXB0by1pcy10aGUtbW9kZXJuLXBhdGgtdG8tZmluYW5jaWFsLWluZGVwZW5kZW5jZS9hbXBfYXJ0aWNsZXNob3cvMTAyNjk2MzA5LmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 13 Aug 2023 07:00:00 GMT",
        "title": "How crypto is the modern path to financial independence - The Economic Times",
        "content": "(What's moving Sensex and Nifty Track latest market news stock tips and expert advice , on ETMarkets . Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .)\n\nDownload The Economic Times News App to get Daily Market Updates & Live Business News.\n\nSubscribe to The Economic Times Prime and read the Economic Times ePaper Online.and Sensex Today.\n\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LnRla2VkaWEuY29tL2dvb2dsZS1jbG91ZC12YWxpZGF0ZXMtY2Vsby1ldGhlcmV1bS1sYXllci0yLWV2b2x1dGlvbi1kb2dlbWl5YWdpLWRlZmktcG9seWdvbi1kOHgv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 13 Aug 2023 07:00:00 GMT",
        "title": "Tech Titans & Meme Magic: Google Cloud, DogeMiyagi, & Polygon’s DeFi Revolution In 2023 - Tekedia",
        "content": "Twenty years ago, Google was a word that was nothing more than gibberish, and cryptocurrencies like Bitcoin and Ethereum were nonexistent. However, in 2023, all 8 billion human beings inhabiting the Earth will be well-acquainted with the tech giant Google, along with Bitcoin and Ethereum. Consequently, if Google Cloud is willing to enter the realm of cryptocurrencies as a validator for Celo (CELO), an Ethereum Layer 2 carbon-negative project ecosystem, it signifies that the crypto industry has achieved global acceptance, and the realm of Decentralized Finance (DeFi) is on the verge of a transformative shift.\n\nThe project DogeMiyagi (MIYAGI), which intertwines the worlds of pop culture and DeFi, is poised to leverage this evolving terrain alongside Polygon (Matic).\n\nGoogle Cloud As Validator & Catalyst For Celo’s Ethereum Layer 2 Evolution\n\nGoogle Cloud will assume the role of a validator on the Celo blockchain, extending a previous collaboration aimed at supporting environmentally conscious startups within the Celo ecosystem by offering essential cloud infrastructure. By taking up the position of a validator for the Celo network, Google Cloud aligns itself with other prominent validators such as Animoca Brands and Deutsche Telekom. Network Validators bear the responsibility of verifying new transactions, a pivotal task that bolsters the network’s security against potential attacks.\n\nHowever, Google Cloud’s involvement surpasses its validator role. The partnership encompasses assistance in Celo’s transition from operating as an independent blockchain to evolving into a layer 2 network built upon Ethereum. To streamline this migration, CLabs (the entity behind Celo) intends to leverage Google Cloud’s Blockchain Node Engine, which provides capabilities for managing hosted nodes. This partnership underscores Google Cloud’s proactive role in safeguarding the Celo network while also contributing to its development into an Ethereum Layer 2 solution.\n\nElevating Cryptocurrency Dynamics: DogeMiyagi – Where Innovation Meets Community, Security, & Convenience\n\nDogeMiyagi introduces itself as a captivating new meme token poised to exert significant influence within the cryptocurrency realm. Beyond its origin rooted in The Karate Kid movie franchise and its embodiment of values such as wisdom, determination, and community camaraderie, as exemplified by Mr. Miyagi, the token has captured attention due to its distinct referral mechanism. This mechanism holds the potential to generate passive income, making it a lucrative opportunity for its users. Moreover, DogeMiyagi highly emphasises user protection and security, a commitment underscored by its engagement with KYC certification from Securi Land and ComplyCube. This deliberate approach underscores dedication to prioritizing quality over quantity, forming a robust foundation for the token’s initiatives.\n\nOne standout feature is the straightforward yet revolutionary Killer Swap Machine, a user-friendly decentralized exchange service operating on the Uniswap protocol. This innovative tool is crafted to enable users to seamlessly trade MIYAGI tokens with various ERC-20 tokens and Ethereum. The Killer Swap Machine aims to offer an uninterrupted, swift token-swapping experience. Users are required to specify their desired token pairs for trading and input the desired exchange amount. This machine enriches the utility of the MIYAGI token by providing a user-friendly and efficient method for holders to trade the token in a decentralized manner.\n\nAdvancing Institutional DeFi: Polygon’s $1.5 Million Backing Of D8X & The Paradigm Shift To Decentralized Derivative Trading\n\nPolygon (MATIC) has recently thrown its support behind a substantial institutional decentralized exchange (DEX) deal amounting to $1.5 million. This move signifies a strategic bet on the transition from Centralized Finance (CeFi) to the realm of Decentralized Finance (DeFi). The venture in question is D8X, an institutional-grade DEX that specializes in derivatives on the Polygon zkEVM (zero-knowledge Ethereum Virtual Machine).\n\nD8X has officially announced a pre-seed funding round backed by notable investors, including Polygon Ventures. This financial injection will empower D8X to launch a decentralized platform for trading derivatives in the latter half of 2023. The platform will offer a white-label solution to trading partners, granting them access to its potent derivatives products.\n\nThe founder of D8X is placing their bet on centralized entities desiring to extend decentralized crypto derivatives to their clients without the need to internally develop expert-level market-making and trading engines. D8X notably stands as the pioneer in the business-to-business (B2B) DEX landscape, constructed upon Polygon’s zkEVM. This integration leverages the potential of zero-knowledge proofs to reduce transaction fees, enhance security, and scale operations across both the Polygon and Ethereum networks.\n\nFinal Thoughts\n\nIn 2023, the validation of Celo by Google Cloud enhances Ethereum’s Layer 2 landscape, a stride towards global crypto acceptance. Meanwhile, DogeMiyagi merges pop culture and DeFi, pioneering secure, user-centric trading. Polygon’s support for D8X signifies the rise of decentralized derivatives in institutional DeFi. These groundbreaking steps exemplify technology’s transformative prowess, forging a future defined by innovation, widespread acceptance, and a reshaped financial landscape.\n\nDogeMiyagi (MIYAGI):\n\nWebsite: https://dogemiyagi.com\n\nTwitter: https://twitter.com/_Dogemiyagi_\n\nTelegram: https://t.me/dogemiyagi\n\nShare this: Facebook\n\nTwitter\n\nWhatsApp\n\nLinkedIn\n\nEmail\n\nPrint\n\n"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL3d3dy5jcnlwdG9nbG9iZS5jb20vbGF0ZXN0LzIwMjMvMDgvZXRoZXJldW1zLWludmVudG9yLXZpdGFsaWstYnV0ZXJpbi1zaGFyZXMtdmlld3Mtb24tc2JmLWFuZC10aGUtcG90ZW50aWFsLW9mLWFpLWluLWNyZWF0aXZpdHkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 12 Aug 2023 07:00:00 GMT",
        "title": "Ethereum's Inventor Vitalik Buterin Shares Views on SBF and the Potential of AI in Creativity - CryptoGlobe",
        "content": "Ethereum’s co-founder, Vitalik Buterin, recently expressed his perspective on Sam Bankman-Fried (aka “SBF”), the former CEO of now-defunct exchange FTX, and the crypto community’s initial skepticism toward him.\n\nAccording to a report by Decrypt, in episode 5 of The Aarthi and Sriram Show, Buterin revealed that despite Bankman-Fried’s prominence in mainstream media, many within the crypto space had reservations about him from the outset.\n\nButerin highlighted that a significant portion of the crypto community felt Bankman-Fried lacked a clear vision for the value of cryptocurrency technology. Instead, he seemed to view crypto primarily as a business opportunity to capitalize on. This perspective contrasted sharply with the foundational values of decentralization and the cypherpunk ethos that underpin projects like Bitcoin and Ethereum. Buterin emphasized that this might have been a primary reason for the existing mistrust towards Bankman-Fried.\n\nOn a different note, Buterin also commented on the advancements in artificial intelligence, particularly systems like ChatGPT. He expressed a positive outlook on AI’s potential to enhance human creativity rather than merely replace human roles. Buterin believes that, at its current stage, AI is more about empowering individuals than replacing them. He envisions a future where AI tools could enable individual creators to produce films and other artistic endeavors without the hefty costs associated with traditional Hollywood productions.\n\nButerin’s vision for AI in the entertainment industry is one where the cost of creating a movie could drastically reduce, allowing a single individual, armed with creativity and an AI platform to produce cinematic content. He sees this as an opportunity to move away from repetitive and overdone storylines, like the numerous remixes in popular culture, and shift towards unique narratives that reflect diverse values.\n\nFurthermore, Buterin regards the transition from human intelligence to superhuman AI as one of the most pivotal shifts in the history of our planet, likening its significance to only a few other monumental transitions in Earth’s history. However, he also acknowledged advanced AI’s challenges and potential risks. While he sees the need for research and possibly some targeted regulation, he cautioned against broad restrictions that could stifle innovation."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmNyeXB0by1uZXdzLWZsYXNoLmNvbS94cnAtbGVkZ2VyLXN1cnBhc3Nlcy1ldGhlcmV1bS1pbi1kYWlseS10cmFuc2FjdGlvbnMtaGl0cy0xLTItbWlsbGlvbi10cmFuc2FjdGlvbnMtcGVyLWRheS_SAYIBaHR0cHM6Ly93d3cuY3J5cHRvLW5ld3MtZmxhc2guY29tL3hycC1sZWRnZXItc3VycGFzc2VzLWV0aGVyZXVtLWluLWRhaWx5LXRyYW5zYWN0aW9ucy1oaXRzLTEtMi1taWxsaW9uLXRyYW5zYWN0aW9ucy1wZXItZGF5Lz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 12 Aug 2023 07:00:00 GMT",
        "title": "XRP Ledger Surpasses Ethereum in Daily Transactions, Hits 1.2 Million Transactions Per Day - Crypto News Flash",
        "content": "Since the beginning of August 2023, the XRP ledger has recorded 1.2 million transactions per day.\n\nAt the same time, the number of active addresses on the XRP ledger has also surged close to 200,000.\n\nEver since the court’s ripple ruling last month in July 2023, the XRP Ledger has witnessed a massive boost in transactions. Since the beginning of August 2023, the numbers have gone up even higher surpassing giants like Ethereum.\n\nOn-chain data shows that the XRP Ledger has been recording 1.2 million transactions per day this month in August. On the other hand, the Ethereum blockchain network recorded 1.09 million transactions every day, as per data on BitInfoCharts.\n\nAlso, the data shows that both these networks – XRPL and Ethereum blockchain – have been recording significantly higher transactions than Bitcoin, which has recorded 300,000 transactions per day on its blockchain. When considering total transaction volume, it’s important to highlight that Bitcoin led the way with over $8.35 billion transacted in July. In comparison, Ethereum witnessed $1.8 billion in transactions, while XRP recorded movement of nearly $500 million.\n\nIn the ruling last month, Judge Analisa Torres stated that the “programmatic” sales of XRP to retail players don’t constitute a security. Soon after the ruling, some of the top crypto exchanges like Coinbase re-listed the XRP token resulting in a huge surge in transaction volumes.\n\nXRP Active Addresses and XRP Price\n\nThe XRP network is experiencing a clear resurgence, with active addresses approaching 200,000. This metric underscores the network’s resilience despite recent price fluctuations.\n\nThe rising count of active addresses signifies that the XRP network retains a robust user base and transactional activity, even in the face of recent price declines. This growth in active addresses can be attributed to various factors.\n\nFirstly, the favorable outcome of the SEC lawsuit likely boosted confidence among current XRP holders and drew in new investors. The designation of XRP as a non-security may have acted as a guiding light, validating the asset’s credibility and its potential for future expansion.\n\nSoon after the Ripple court ruling, XRP was on an unprecedented price rally gaining more than 100% in less than a week’s time and hitting the 2023 high of $.094. However, it has reversed its trajectory since and has entered a significant retracement.\n\nAs of press time, the XRP price is trading at $0.63 and has a market cap of $33 billion. During this retracement, XRP lost its $20 billion market cap. XRP investors are once again waiting on the sidelines for the price to regain the important milestones of $1.\n\nRenowned cryptocurrency advocate and attorney, John Deaton, has outlined the factors contributing to XRP’s inability to reach the $1 mark, despite obtaining regulatory clarity from the XRP vs SEC case.\n\nIn a recent tweet, Attorney Deaton highlighted that had he foreseen XRP achieving regulatory clarity without reaching $1, many would have been skeptical. Similarly, he noted that people might have doubted his prediction that PayPal would unveil a stablecoin tied to the US dollar on the Ethereum network, while ETH’s value wouldn’t surge significantly.\n\nDeaton underscored that the subdued growth of XRP’s price can be attributed to Bitcoin’s strong consolidation phase. He further emphasized that Bitcoin, as the leading cryptocurrency by market capitalization, exerts substantial influence over the entire market. “Whether we like it or not, Bitcoin drives this market,” expressed Deaton.\n\nThis article is provided for informational purposes only and is not intended as investment advice. The content does not constitute a recommendation to buy, sell, or hold any securities or financial instruments. Readers should conduct their own research and consult with financial advisors before making investment decisions. The information presented may not be current and could become outdated."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDgvMTIvbGlrZWx5LWFpcmRyb3AtbGF5ZXItMi1saW5lYS1ibG9ja2NoYWluL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 12 Aug 2023 07:00:00 GMT",
        "title": "Likely airdrop of the layer-2 Linea blockchain: here's how to get free tokens - The Cryptonomist",
        "content": "Ethereum’s layer-2 blockchain, Linea, developed by technology company Consensys, recently landed on the mainnet and could release an airdrop to users in its ecosystem.\n\nA governance token has not yet been created for this project, but looking at how other layer-2 infrastructures have performed in the past, we can infer that it will be proposed in the coming months.\n\nHow do you go about being eligible for a possible airdrop?\n\nWe look at it in this article.\n\nThe layer-2 Linea from Consensys company: possible airdrop coming soon\n\nLinea is a layer-2 scaling solution for the Ethereum blockchain, based on a “zero-knowledge rollup” mechanism that achieves greater scalability through off-chain transaction validation.\n\nIt represents one of the most interesting ZK-evm infrastructures of the moment, given the potential of native integrations offered by Consensys, a world leader in the blockchain industry.\n\nIt is worth mentioning that Consensys, led by visionary Joseph Lubin, operates some of the most prominent products in the web3 landscape such as the non-custodial wallet Metamask, the smart contract development platform Infura and the open-source Ethereum Besu client.\n\nThe company is valued at a total of $7 billion, nearly 6 times the value of Matter Labs (a company involved in the development of zkSync), and recently announced that it has secured funding from private investors such as Animoca Brands and Coinbase Ventures.\n\nLinea formalized its move from testnet to mainnet on 11 July and has already registered a bridging of funds from the Ethereum network amounting to 16,000 ETH.\n\nThe project team has not yet released information regarding the possibility of the deployment of a governance token to be released to its early users in the form of an airdrop.\n\nHowever, taking a look at the state of the layer2 network world with the recent deployments of Arbitrum and Optimism and the likely future incentives on the ZkSync Era, Starknet, Base, and Mantle networks, we can infer that an airdrop will be coming here as well.\n\nNo one is aware of the timing, but it will likely be at least another 5-6 months before the token is actually listed in the markets.\n\nIn any case, it is better to be ready right now by registering transactions on this blockchain to be eligible for the Linea airdrop and earn free tokens.\n\nHow to do it? let’s take a detailed look at all the steps in the following paragraphs.\n\nHow to get the Linea airdrop: all the steps\n\nLet’s now see in practical detail how to get Linea’s airdrop, which is likely to give users in the decentralized ecosystem an average of $1,000 to $2,000 in rewards in the form of governance crypto.\n\nFirst make sure you have a non-custodial wallet like Metamask and have already deposited funds on the Ethereum network.\n\nIf you have never downloaded MetaMask, you can do so for free here. To deposit funds, do so from a centralized exchange such as Binance, Coinbase, Bybit or Kraken.\n\nThe next step to be an active user of the infrastructure, as in any self-respecting layer-2, is to go and bridge assets from the Ethereum blockchain to precisely the Linea blockchain.\n\nIt is best to make at least 3 separate bridges between now and the next 6 months, worth at least $100.\n\nObviously, the more funds are deposited and the more frequently the transactions are performed, the higher the probability of receiving the Linea airdrop. The official website to execute the bridge is this one.\n\nEnter an amount of ETH and select the “automatic claiming” item. The “manual claiming” item is cheaper than the previous one, but it assumes that you will be going to claim the assets on Linea once the transaction is processed.\n\nSince we are talking about $1 fees as a difference, better to do the process automatically.\n\nIt is worth noting that Linea has until recently been in testnet: performing operations on this testnet is advisable in order to appear to be a true early adopter.\n\nIn this case too, it is necessary to bridge tokens, but this time moving from the Ethereum Goerli testnet to the Linea testnet.\n\nIf you do not have funds on the Goerli network, you can get them for free by using this faucet or this other one. In both cases you must have a Twitter profile.\n\nAfter obtaining the test tokens, you can bridge funds (make sure you have at least 0.05 ETH in the wallet as a test token) and then explore the ecosystem of decentralized applications present on Linea.\n\nIn this respect, it is appropriate to conduct transactions on both the dApp present on the mainnet and those on the testnet. In the next section we will mention the most important ones.\n\nDecentralized applications to interact with\n\nRight after bridging on the Linea mainnet and on the testnet, you can go and interact with the various decentralized applications in the crypto ecosystem in order to increase your chances of getting airdrop.\n\nRemember that it is more important to conduct transactions on the mainnet rather than the testnet, but it is good to be active on both fronts.\n\nSome of the most important and secure dApps on the Linea mainnet to engage with include Horizon DEX, Velocore, Echo DEX, Orbiter Finance, Element, Linea Bank, OpenOcean, and Syncswap.\n\nIt is advisable to use at least 5 different smart contracts and generate trading volumes on DEXs in excess of $10,000 over a 6-month period.\n\nActing as a liquidity provider by going to provide liquidity will give you an extra boost on airdrop rewards, but could be risky in the case of hacks.\n\nRemember that to be successful in this context you have to repeat operations occasionally, not just try all the dApps at once.\n\n“Repeat users” is a very important factor that should be taken into account because that is where you can tell if a user is really a supporter of the ecosystem or just an opportunist.\n\nTurning to the decentralized platforms present on testnet we can rely on Echo DEX, Surfi, Bounce, Linea Bank, Layerswap, Mes protocol, Bilinear, Element, and Claimabl3.\n\nIt is worth noting that many apps in testnet are already live on the mainnet. To get a more in-depth view you can check for yourself which dApps are present in one or the other network directly on the ecosystem section of Linea.\n\nRegarding the frequency of transactions on the testnet, since you are not using “real money,” it is advisable to perform as many transactions as possible and going to create a high volume.\n\nIndicatively we can say that it is enough to connect with 5 smart contracts and create volumes for $10,000, similar to the mainnet.\n\nOther useful tips to increase Linea airdrop allocation:\n\nhold on the mainnet a minimum of 0.05 ETH;\n\nmake at least 1-2 asset transfers to other addresses;\n\ndo not create many interconnected addresses so as not to be blocked as a sybil;\n\ncheck your progress periodically using a tracker."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd3d3LmJsb2NremVpdC5jb20vZXRoLWhpdHMtYWxsLXRpbWUtaGlnaC1hbmQtc28tZG8tZXRoZXJldW0tZ2FzLWZlZXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 13 Aug 2023 07:00:00 GMT",
        "title": "ETH Hits All Time High And So Do Ethereum Gas Fees - Blockzeit",
        "content": "The price with ETH has ripped through it’s all-time high. However, the crises around Ethereum gas fees has yet to be solved. And today, gas fees are the highest that they’ve been in a long time if ever.\n\nAn unfair position for beginners\n\nOne simple trade of less than $1000 has a gas fee of nearly $200. That’s 20% of the entire trade. For traders with small capital this can cost them a lot of opportunity. Say, someone has only $2000 in crypto. Are they going to want to make a transaction which charges them a fee that is 10% of their entire portfolio? I would hope not.\n\nThis creates an environment that only people with large amounts of capital can afford to do any trading at all.\n\nWhy Ethereum 2.0 will lower gas fees\n\nEthereum 2.0 is set to be released later this year. This will change Ethereum from a proof of work network to a proof of stake network. In POW networks, miners are paid gas fees for running transactions which cost a high amount of electricity and require very expensive equipment. In a proof of stake network, instead of a few concentrated individuals working as validators, anyone who holds Ethereum can become a validator. So, with Ethereum 2.0, there will be thousands if not millions of people in time who will be running their own nodes.\n\nHow Ethereum 2.0 will cause price to explode\n\nWe will over time see an increase in the price of Ethereum as more people come to use the network. Ethereum 2.0 will cause more scalability through lower transaction fees, bringing in more people instead of deterring them from fees that for some make it impossible to trade.\n\nIf Ethereum price can soar to above $4,000 considering how awful the user experience can be, imagine how high the price could become once Ethereum 2.0 is released.\n\nHow will ethereum 2.0 affect price?https://t.co/LiVgvKeP2V\n\n\n\nIncreasing the number of transactions per second can push many traders to hold the coin and transfer it around exchanges for very low fees instantly.\n\n\n\nhttps:// #Defi#MustHaveCrypto pic.twitter.com/W4w7lXIvBw — #We Teach Crypto @MustHaveCrypto Token (@MustHaveCrypto) May 8, 2021\n\nAdditionally, as seen in the tweet above, Ethereum 2.0 will cause validators to hold their Ethereum instead of dumping it through staking incentives. Without major holders dumping their Ethereum, the value of the network will also continue to increase.\n\nWhen will Ethereum 2.0 be released?\n\nThis is actually a question with more than one answer. This is because Ethereum 2.0 is a release of several different upgrades with their own release. The Beacon Chain is one Eth 2.0 upgrade that already went live December 2020. And according to Ethereum.org these other updates will come later in 2021 and 2022. An excerpt of information from Ethereum.org reads,\n\nThe merge is when mainnet begins using the Beacon Chain for consensus, and proof-of-work is turned off. What’s mainnet? Shard chains should follow the merge, some time in 2022.\n\nFinal thoughts\n\nWhile gas fees are higher than ever before, it’s good to see that the price of Ethereum is still doing well. If it can do this under these circumstances, it’s speaks volumes of how Ethereum will continue to grow and be valued as one of the top networks in all of crypto.\n\nFind more information on the Ethereum price predictions in following article: Ethereum Will Explode Says Lark Davis – Bigger Than Bitcoin?"
    }
]