[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vcGF4b3MuY29tLzIwMjQvMDEvMTEvdHdvLXBvd2VyZnVsLWJsb2NrY2hhaW4tcGxhdGZvcm1zLW9mLXRoZS1mdXR1cmUtZXRoZXJldW0tYW5kLXNvbGFuYS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Two Powerful Blockchain Platforms of the Future: Ethereum and Solana - Paxos",
        "content": "Blockchain, once overlooked in the shadow of cryptocurrency, is now a powerhouse player in its own right with implications far beyond the financial sector. From improving supply chain integrity to facilitating transactions for a wide range of digital assets, its use cases are vast and varied.\n\nBut what lies at the heart of this innovative technology, and how can it be harnessed? It is helpful for enterprises across many industries to understand the fundamentals of blockchain and how key platforms like Ethereum and Solana are leading the charge in this technological revolution.\n\nWhat is blockchain?\n\nBlockchain is digital ledger technology that documents transactions across a network of computers. It can log and track everything from cryptocurrency payments to real-world assets to legal agreements.\n\nBlockchain technology is renowned for its security and immutability. The technology’s name stems from the fact that it’s comprised of a series of “blocks,” with each containing transaction data, a timestamp and a cryptographic hash of the previous block. Every transaction is linked in a “chain” and distributed across numerous nodes.\n\nBecause of the decentralized nature of the blockchain, there’s little risk of manipulation from entities like governments or financial institutions. In fact, a blockchain’s structure makes it nearly impossible to retroactively alter any single record without changing all subsequent blocks.\n\nBlockchain technology offers transparency and decentralization, making it an attractive option for transactional applications—among them, money movement, supply chain management and even digital identity verification.\n\nEthereum and Solana\n\nWithin blockchain technology, there are many different blockchain platforms. Two of the most prominent blockchain platforms are Ethereum and Solana, each with unique features and capabilities.\n\nEthereum (ETH): Ethereum, launched in 2015, is both a cryptocurrency and a platform for building decentralized applications. Ethereum introduced the concept of “ smart contracts ,” or self-executing contracts with the terms of the agreement written directly into lines of code. The latest iteration of Ethereum’s blockchain is secured using a proof-of-stake ( PoS ) consensus mechanism—essentially, th e process by which validators create new blocks. ( Learn more about consensus mechanisms and how they work here .)\n\nSolana (SOL): Solana is a newer blockchain platform that launched to the public in 2020. It’s known for speed and efficiency. It employs a unique hybrid consensus model, combining proof-of-history (PoH) with proof-of-stake (PoS). This enables it to process transactions rapidly and with lower fees compared to Ethereum. As such, Solana is an attractive platform for high-frequency trading and other applications requiring quick transaction times.\n\nEthereum and Solana have gained popularity because they offer solutions to common pain points related to scalability, speed and cost. These platforms have also sparked an entire ecosystem of subsequent innovation: Ethereum’s smart contract functionality has given rise to decentralized applications (dApps), decentralized finance (DeFi) platforms and non-fungible tokens (NFTs).\n\nThe future of finance: instant transfers and more\n\nImagine a world where international suppliers are paid the moment goods are shipped, employees receive compensation in real-time and complex financial transactions are settled instantly. This immediacy not only streamlines business operations, but also opens doors to new financial strategies like dynamic pricing. The ripple effects of such capabilities include more agile, responsive and competitive businesses and a transformation of the way global commerce operates.\n\nBlockchains like Ethereum and Solana have the potential to make such hypotheticals into realities. With their ability to power instant, 24/7 financial transactions across borders, blockchains may be particularly attractive to enterprises operating in multiple countries or those engaging in high-volume trade, not to mention the implications for sectors like e-commerce and digital supply chain management.\n\nBlockchain technology is evolving rapidly. Many enterprises need a hand when it comes to adopting it and maximizing its potential and a trusted partner can help you seamlessly integrate blockchain into existing operations.\n\nBlockchain is transforming the way we think about money, assets and transactions and is paving the way for new business models and strategies. With the right partners to help you navigate and implement blockchain systems, your business will be well-positioned to stay a step ahead in the digital finance era."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiNGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V0aGVyZXVtLWV0Zi1oeXBlLWNsYXNzaWPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum ETF hype spills over to Ethereum Classic, leading to 50% pump - Blockworks",
        "content": "Bitcoin is still down on 21-month highs set directly after the SEC bungled its spot ETF announcement on Tuesday. Ethereum, on the other hand, is way up.\n\nEther (ETH) has rallied more than 16% in that time and is now easily the year-to-date best performing top-20 cryptocurrencies by market cap. Bitcoin (BTC) is so far in second-place, with about half those returns.\n\nMarkets sold the news one day early due to the SEC’s unauthorized announcement and appear to have simultaneously bought the rumor on ether ETFs.\n\nEthereum Classic (ETC) — the original Ethereum hard fork in 25th position — is however having a moment. The blockchain’s native token ETC has spiked nearly 50% over the past day.\n\nDue to the timing, there doesn’t appear to be any real rhyme or reason for ETC to be climbing so quickly.\n\nThe devil’s advocate would say that Ethereum Classic is gearing up for a hard fork later this month tipped to better align the network’s EVM with Ethereum’s, which could help inspire projects to work with the chain.\n\nAnd the network’s hashrate did spike to all-time highs following Ethereum’s switched to proof-of-stake in late 2022, as former ETH miners sought a substitute revenue stream at which to direct their GPU mining rigs.\n\nEther has jumped from $2,200 to $2,650 this week. Ethereum Classic has gone from $20 to $30.\n\nMuch of Ethereum Classic’s post-Merge hashrate has stuck around, despite the network only seeing around 30,000 in transactions per day (about the baseline for Bitcoin Cash).\n\nFor scale, Litecoin is currently processing more than half a million transactions per day (boosted by the network’s own brand of inscriptions) while Ethereum mainnet handles about twice as much, per BitInfoCharts.\n\nStill, Ethereum Classic only boasts less than 15% of Ethereum’s hashrate recorded just before the Merge.\n\nETHPoW, the hard fork of Ethereum from around the Merge meant to compete with Ethereum Classic, currently has about one-tenth of the latter’s hashrate.\n\nRead more: Grayscale Still Deciding What To Do With ETHPoW\n\nIn fact, until yesterday’s formal SEC approval of spot bitcoin exchange-traded funds, ETC had returned nothing over the past year.\n\nThe more likely explanation is that traders are looking to frontrun the next big media narrative around crypto: the SEC approving spot bitcoin ETFs means an eventual greenlight for spot ether funds.\n\nDue to illiquid markets, dumb money or widespread left-curving, Ethereum Classic has tagged along for the ride but ended up dominating ether for gains over the short-term.\n\nGrayscale does already sell exposure to the token through one of its trusts, and the firm is now set to convert its $29 billion bitcoin trust into an ETF.\n\nSome reckon fund issuers might soon seek approval for ETFs for other cryptocurrencies, including XRP and solana.\n\nThe odds of fund issuers lining up to launch ETFs for Ethereum Classic are slim. Although stranger things have happened in crypto.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vY3J5cHRvLm5ld3MvZXRoZXJldW0tdG9rZW5zLWxlYWQtZm9yLXRoZS1zZWNvbmQtY29uc2VjdXRpdmUtZGF5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum tokens lead for the second consecutive day - crypto.news",
        "content": "Following a positive spot Bitcoin ETF announcement, Ethereum-based tokens continue to lead with up to 52% price gains.\n\nLeading CoinMarketCap charts on Jan. 11 is Ethereum Name Service (ENS), which functions as a decentralized naming system built on Ethereum. ENS simplifies human-readable Ethereum addresses like john.eth into machine-readable alphanumeric codes commonly associated with wallets such as Metamask. As of the latest data, ENS is sitting at $23.15, following a 55.1% increase in the last 24 hours, amid a positive trend in the overall Ethereum market.\n\nTop crypto gainers of the day | CoinMarketCap\n\nThe surge in ENS price coincides with Ethereum briefly surpassing the $2,400 mark on Jan. 10, marking a 10% rise within the week, in anticipation of the Bitcoin ETF Approval. Additionally, an earlier message from Vitalik.eth underscoring the importance of CCIP resolvers for Layer 2 solutions (L2s) has also been said to feed into positive market sentiment.\n\nYou might also like: Ethereum price to cross $3k after Bitcoin ETF approval?\n\nTaking the second spot in the gainers is Ethereum Classic (ETC), a hard fork of Ethereum (ETH) introduced in July 2016, which primarily operates as a smart contract network supporting decentralized applications (DApps). The live price of Ethereum Classic is recorded at $30.53 USD, after a 46% surge in the past 24 hours. The driving force behind this notable increase is again linked to the approval of Bitcoin ETFs by the U.S. SEC. This notable industry announcement has since resulted in the cryptocurrency surpassing $26 for the first time since October 2022.\n\nANNOUNCEMENT: TezFin Production Version has launched!\n\n\n\nDecentralized Lending/Borrowing on Tezos Blockchain. Visit: (https://t.co/KTSAW00EWH)\n\n\n\n– Security Audit by @inference_ag, sponsored by @TezosFoundation #Tezos pic.twitter.com/sXlyXvsF68 — TezFin | Tezos DeFi lending (now in beta) (@TezosFinance) January 10, 2024\n\nThe third token on the top gainers is not an Ethereum project, although it does share similarities. Tezos (XTZ) is a blockchain network functioning on smart contracts, although it is said to provide more advanced infrastructure. Its price surge is tied to an announcement from TezFin, the Tezos defi lending platform, which announced the launch of its production version, offering decentralized lending and borrowing on the Tezos blockchain. The live price of Tezos currently stands at $1.17, reflecting a 34.6% increase in the last 24 hours.\n\nWith cryptocurrencies being established as a tradeable asset class, many analysts believe big market moves will continue to play out in the coming days.\n\nRead more: Ethereum applications take place as top gainers ahead of ETF announcement\n\nFollow Us on Google News"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDI0LTAxLTExL2V0aGVyLWV0aC1qdW1wcy1vbi1iZXRzLXRva2VuLWlzLW5leHQtZm9yLXNlYy1ldGYtYXBwcm92YWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Rival Ether Jumps on Bets Token Is Next for ETF Approval - Bloomberg",
        "content": "Ether , the second-largest cryptocurrency, emerged as one of the biggest beneficiaries of the decision by US regulators to approve the country’s first spot- Bitcoin exchange-traded funds.\n\nEther rose 9% in the past 24 hours to $2,585 as of 7:11 a.m. Thursday in London — a 20-month high — whereas Bitcoin was little changed at $46,070 after a more than 160% jump in the past year."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDI0LzAxLzExL3Nob3VsZC15b3UtYnV5LWV0aGVyZXVtLXdoaWxlLWl0cy1zdGlsbC1iZWxvdy0yNTAwL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Should You Buy Ethereum While It's Still Below $2,500? - The Motley Fool",
        "content": "Amid the current crypto market rally led by Bitcoin, there's one crypto that seems to be getting completely overlooked: Ethereum (ETH 1.13%). That's somewhat surprising, given that Ethereum is the world's second-largest cryptocurrency, with an enormous $290 billion market cap.\n\nHowever, the hype around a spot Bitcoin exchange-traded fund (ETF) has focused investor attention squarely on Bitcoin. At the same time, a number of direct Ethereum rivals skyrocketed to triple-digit percentage gains last year, and have become the new darlings of crypto investors looking for maximum upside. But there are several reasons Ethereum might be undervalued at its current price of about $2,400.\n\nEthereum vs. the wannabe Ethereums\n\nAt the end of 2022, Ethereum was the talk of the crypto industry. It had just pulled off The Merge, which fundamentally transformed its blockchain to make it faster, cheaper, easier to use, and much more energy efficient. The hype around Ethereum grew to the point where some investors even thought that Ethereum might eventually surpass Bitcoin in terms of market cap.\n\nBut then came 2023. All of a sudden, rival blockchains like Solana started gaining traction with investors. At one point, Solana was up more than 1,000% for the year. Avalanche, another Ethereum rival, was up nearly 200% for the year. By way of comparison, Ethereum was up 90%, and seemed to be losing the attention of investors.\n\nSo the big question is whether Ethereum is still best-in-class. If you think that the so-called Ethereum killers are just a bunch of Ethereum wannabes with no long-term staying power, then Ethereum could be highly undervalued at its current price. But if you think that Ethereum's long reign as the top Layer-1 blockchain network in the world is coming to an end, then it's a completely different story.\n\nA spot Ethereum ETF incoming?\n\nRight now, the imminent arrival of the first spot Bitcoin exchange-traded fund (ETF) for the U.S. market is getting all the headlines. But, according to a growing number of crypto investors, a spot Ethereum ETF could be coming soon. And that means that Ethereum could soon get the same type of boost Bitcoin is getting right now.\n\nCertainly, the underlying logic makes sense. Wall Street is looking for more reliable ways to invest in crypto, and has apparently determined that the ETF investment product is the best way to achieve this. Once it can show that a spot Bitcoin ETF is successful, then it's time to crank up this formula for every other major cryptocurrency.\n\nGiven Ethereum's market heft -- it now accounts for about 17% of the market value of the entire crypto market, second only to Bitcoin -- it would only make sense that Ethereum would be next in line for a spot ETF. And, indeed, there is already an application in the works for just such a product. In September, Cathie Wood's Ark Invest filed for a spot Ethereum ETF. If the Securities and Exchange Commission (SEC) decides to approve this (admittedly, a big \"if\"), it could result in billions of dollars flowing into Ethereum, pushing up its price.\n\nA sexy new upgrade\n\nFinally, there's the matter of Ethereum's next big upgrade. Ethereum recently published its strategic roadmap for 2024, and one item on the roadmap that caught the attention of investors was something called EIP-4844 (\"Ethereum Improvement Proposal 4844\"). Basically, this is a proposed technical change that would enable the processing of transactions on the Ethereum blockchain to become much faster and more efficient.\n\nI know, I know. You're probably rolling your eyes right now. What a bunch of blockchain babble, right? But consider that EIP-4844 got J.P. Morgan really excited. In a research note to clients, JPMorgan specifically referred to EIP-4844 as a key reason it thinks Ethereum could outperform Bitcoin in 2024. That's because this major technical change would make it theoretically possible for the Ethereum blockchain to handle 100,000 transactions per second, up from about a dozen or so now. With that type of speed, Ethereum would basically be unstoppable.\n\nHow much higher can Ethereum go?\n\nFirst and foremost, Ethereum needs to convince investors that it is still the preeminent Layer-1 blockchain network. So keep an eye on how Ethereum deals with the growing threat from the likes of Solana. As long as investors buy into the idea that Solana is a faster and more cost-efficient version of Ethereum, it's hard to see Ethereum skyrocketing in price.\n\nWith that in mind, it's certainly possible to find a number of bullish Ethereum price predictions for 2024. Some crypto traders think that Ethereum could double, triple, or even quadruple in value. I may not be as bullish on Ethereum, but I'm certainly open to the idea that Ethereum could surprise a lot of people in 2024."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ldGhlcmV1bS1zcG90LWV0ZnMtY291bGQtbmV4dC0wNjU3MDQwMzYuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Spot ETFs Could Be Next, According to Bloomberg Analyst - Yahoo Finance",
        "content": "Ethereum Spot ETFs Could Be Next, According to Bloomberg Analyst\n\nWith the U.S. Securities and Exchange Commission (SEC) approving 11 spot Bitcoin exchange-traded funds (ETFs) on January 10, the path is now clear for spot Ethereum ETFs to be approved in 2024, according to Bloomberg ETF analyst Eric Balchunas.\n\nBalchunas believes there is a 70% chance that spot Ether ETFs will be approved by May, the month the SEC must make a final decision for several applications. Balchunas previously stated that he could not see a scenario where spot Bitcoin ETFs are approved but spot Ether ETFs are not. He compared the two cryptocurrencies, saying that \"Ether spot is tied to the hip of Bitcoin spot.\"\n\nThe earliest deadline for spot Ethereum ETFs decision is in May later this year for VanEck’s Ethereum ETF. BlackRock’s deadline is in August, however if the SEC does approve, it could approve all applicants like it did for the spot Bitcoin ETFs.\n\nPrior to the SEC's spot Bitcoin approval, Valkyrie Funds' chief investment officer Steven McClurg said he wouldn't be surprised if spot Ether and XRP ETFs come to market after Bitcoin. Several major asset managers, including BlackRock, VanEck, ARK Invest & 21Shares, Fidelity, and Invesco Galaxy, have filed applications for spot Ether ETFs. The SEC must make decisions on these applications by various dates ranging from May 23 to August 7.\n\nFollowing the Bitcoin ETF approval, Ethereum (ETH) gained 8.5% over the past 24 hours, and rallied over 15% in the past week, breaking above the $2.5K level, as investors speculate on the potential of a spot Ether ETF approval.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjcxODc0L2V0aGVyZXVtLWV0Zi1hcHByb3ZhbC1tYXktZXRoZXItcHJpY2Utc3VyZ2XSAVNodHRwczovL3d3dy50aGVibG9jay5jby9hbXAvcG9zdC8yNzE4NzQvZXRoZXJldW0tZXRmLWFwcHJvdmFsLW1heS1ldGhlci1wcmljZS1zdXJnZQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Speculation over potential Ethereum ETF approval in May sends ether price surging - The Block",
        "content": "Bloomberg senior exchange-traded fund analyst Eric Balchunas said there is a 70% possibility for the approval of spot Ethereum ETH +1.34% exchange-traded funds from the U.S. Securities and Exchange Commission by May of this year.\n\nOver the past 24 hours, the price of ether rose 8% to $2,613 — recording nearly 18% growth in the last seven days. Crypto industry experts say this signifies investor optimism for a potential ether ETF following the SEC’s approval of eleven spot bitcoin ETFs earlier today.\n\n“Starting with BTC ETF, we are seeing a 'buy the rumor, ignore the news, buy the next rumor' set up,” said Joe Caselin, head of institutional marketing at BIT crypto exchange. “BlackRock filed its ETH ETF application in Nov 2023, and while that is a lot less certain than the numerous BTC ETF applications that were just approved, the potential is huge, as it would mark the first such product for ETH, which already has a large appeal with institutional investors.”\n\nBlackRock, expected to launch its bitcoin ETF on Thursday, has a track record of 575 approvals from the regulator and only one ETF rejection. The first final decision deadline for the SEC on the spot ETH ETF application, from Ark and 21Shares, is on May 23.\n\nUncertainties remain surrounding the spot Ethereum ETF approval, given the current SEC chair Gary Gensler’s adamant stance that every cryptocurrency other than bitcoin is a financial security. Be that as it may, Gensler’s predecessor, Jay Clayton, once mentioned that a small number of tokens might cease to be considered securities if they became broadly decentralized. Former SEC director of corporate finance William Hinman also said during a speech in 2018 that, considering its decentralized nature, ether coins are not financial securities.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nIs a Solana ETF a possibility?\n\nIf the SEC decides to approve spot Ethereum ETFs, other large-cap cryptocurrencies — such as Solana — may be next, Rachael Lucas, crypto technical analyst at Australia-based crypto exchange BTC Markets, told The Block. “Although Solana is a comparatively young ecosystem compared to Bitcoin and Ethereum, its noteworthy performance in 2023, marked by positive news and increased developer activity, has captured investor attention. Notably, Solana achieved an impressive price gain of 920%, significantly outpacing Bitcoin's 155% growth in the same period,” Lucas said.\n\nCaselin of BIT shared the same opinion that an Ethereum ETF launch will bring more financial vehicles, giving access to a wider variety of crypto assets. “We might be looking at a whole range of ETFs that provide access to top market cap tokens and projects, although it may make more sense for a top 50 ETF rather than 50 individual ETFs — not unlike an S&P 500 for large-cap or 'blue-chip' tokens.”"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9ldGhlcmV1bS1ldGYtYXBwcm92YWwtdHJhZGVycy1iZXQtZXRoLXByb2R1Y3Qv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum ETF Approval Next? ETH Price Over $2.5K as Traders Bet on ETH Product - CCN.com",
        "content": "Key Takeaways\n\nEthereum ETFs are poised to gain traction now Bitcoin spot ETFs have regulatory approval.\n\nProminent crypto investor DCInvestor predicts Ethereum will outperform most assets in the current market cycle.\n\nEthereum’s prospects look bright as anticipation builds for the approval of a spot ETF in the United States, following Bitcoin’s recent approval.\n\nThe long-awaited approval of spot Bitcoin exchange-traded funds (ETFs) in the United States has opened the floodgates for further innovation in the cryptocurrency space.\n\nWith 11 spot Bitcoin ETFs now available to investors, the stage is set for the next major development: spot Ethereum ETFs.\n\nEthereum ETFs Emerge as New Bullish Catalyst\n\nEthereum, the second-largest cryptocurrency by market capitalization, has long been considered a prime candidate for an ETF. The asset’s strong fundamentals, growing adoption, and established ecosystem have made it a compelling investment proposition for institutional investors. And with the SEC’s recent decision to approve Bitcoin ETFs, the regulatory hurdles for Ether ETFs have significantly diminished.\n\nThe recent approval of spot Bitcoin ETFs by the SEC has sent Ether prices skyrocketing, as traders speculate that the regulatory agency may soon approve spot Ethereum ETFs as well. ETH traded at over $2,600 in early European hours on Wednesday, up 8% in 24 hours. Meanwhile, Bitcoin prices went up by 1.3% in the same period. BTC had been falling due to a series of tweets from the temporarily hacked SEC’s X account.\n\nConor Ryder, head of research at the stablecoin company Ethena Labs said :\n\n“Now that the Bitcoin ETF speculation has come to fruition it looks like traders are rotating to ether to get ahead of the next narrative, an ETH ETF, while ETH looks relatively cheap compared to most other tokens.”\n\nThe SEC should make a decision on spot ETH ETF applications in May. BlackRock, Invesco , Ark, and VanEck are among the companies vying for approval, with Grayscale also seeking to convert its existing Ethereum Trust (ETHE) into an ETF.\n\nAlright, that’s enough of spot bitcoin ETFs… Wen spot ether ETFs? — Nate Geraci (@NateGeraci) January 10, 2024\n\nRyder believes the approval of spot Bitcoin ETFs has fueled the recent rally in Bitcoin’s price. Meanwhile, he says Ethereum has failed to gain traction compared to smaller blockchain networks like Solana and Cardano.\n\nNew deadline to obsess over just dropped May 23rd is the final deadline for decision on VanEck’s spot ETH ETF pic.twitter.com/dgi5EVbPeQ — Will (@WClementeIII) January 10, 2024\n\nEthereum ETFs Poised for Breakout\n\nOn January 9, crypto Twitter personality DCInvestor Ethereum would outperform most other assets once the current market cycle ends.\n\ni am not going to tell you that ETH will be the BEST performer this cycle but it will do better and retain more value after this cycle than the vast majority of assets imo it's insanely undervalued at the moment this could be the last great opportunity of a lifetime — DCinvestor (@iamDCinvestor) January 8, 2024\n\nThe prediction is based on the assumption that Ethereum is the next logical candidate for a spot exchange-traded product (ETP). DCInvestor also noted that Ethereum already has futures-based ETFs. This, he says, indicates that the SEC could well approve a spot ETF soon.\n\nYouTuber Crypto Rover expressed a on Ethereum’s future to his 635,000 YouTube subscribers.\n\nHe :\n\n“An Ethereum spot ETF is the next big narrative on the horizon. After the Bitcoin spot ETF is approved and the hype surrounding it subsides, the focus will shift to Ethereum.”\n\nThe #Ethereum Spot ETF is going to be the next big narrative. After the Bitcoin Spot ETF is accepted, things will settle down, and the next hype will transfer to ETH. No one is paying attention to the upcoming hype on Ethereum, and actually, due to the recent $SOL pump, people… pic.twitter.com/AOxRfqNsrH — Crypto Rover (@rovercrc) January 8, 2024\n\nHe attributed the current lack of attention on Ethereum to the recent surge in Solana’s price. In the past 90 days, SOL has surged by 360%, while Ethereum’s performance has been relatively modest, with a 48% increase. He believes Ethereum will regain its prominence once the market calms down and the focus turns to its potential for institutional adoption.\n\nInstitutional Demand Drives Approval Prospects\n\nIn a recent analysis, Bloomberg ETF analyst James Seyffart pointed out that the SEC’s approving Ethereum futures and the CFTC’s classifying ETH as a commodity suggest that the possibility of the SEC approving spot Ethereum ETFs this year is increasing.\n\nA host of prominent financial institutions, including BlackRock, VanEck, ARK 21Shares, Fidelity, Invesco Galaxy, Grayscale, and Hashdex, are vying for SEC approval to launch spot Ether ETFs.\n\nThe SEC has set deadlines for each applicant to receive a decision on their proposal:\n\nVanEck: May 23\n\nARK 21Shares: May 24\n\nHashdex: May 30\n\nGrayscale: June 18\n\nInvesco: July 5\n\nFidelity: August 3\n\nBlackRock: August 7\n\nThis intense competition among established financial giants underscores the growing demand for Ether ETFs and the potential impact they could have on the cryptocurrency market."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1yYWxsaWVzLTI2NTAv0gFFaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vYW5hbHlzaXMvZXRoL2V0aGVyZXVtLXByaWNlLXJhbGxpZXMtMjY1MC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Rallies 5% and Outperforms Bitcoin – Is This Strong Bullish Sign? - NewsBTC",
        "content": "Ethereum price climbed higher above the $2,450 resistance. ETH outpaced Bitcoin and seems to be setting up for a larger increase toward $2,880.\n\nEthereum is gaining pace above the $2,450 resistance level.\n\nThe price is trading above $2,500 and the 100-hourly Simple Moving Average.\n\nThere was a break above a key rising channel with resistance near $2,440 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair is already up over 5% and might rise further above the $2,650 resistance.\n\nEthereum Price Gains Strength\n\nEthereum price started a decent increase above the $2,350 resistance. Recently, BTC’s spot ETFs were approved. However, there was no major increase in Bitcoin, but ETH gained bullish momentum.\n\nThere was a break above a key rising channel with resistance near $2,440 on the hourly chart of ETH/USD. The pair surged over 5% and even cleared the $2,500 resistance zone. There was a spike above the $2,600 resistance zone. A new multi-week high was formed near $2,642 and the price is now consolidating gains.\n\nThere was a minor decline below $2,600, but Ethereum stayed above the 23.6% Fib retracement level of the recent rally from the $2,346 swing low to the $2,642 high. Ethereum is now trading above $2,500 and the 100-hourly Simple Moving Average.\n\nIf there is a fresh increase, the price might face resistance near the $2,650 level. The next major resistance is now near $2,720. A clear move above the $2,720 level might send ETH toward $2,780. A close above the $2,780 resistance could push the price further into a bullish zone.\n\nSource: ETHUSD on TradingView.com\n\nThe next key resistance is near $2,840. If the bulls push Ethereum above $2,840, there could be a rally toward $2,920. Any more gains might send the price toward the $3,000 zone.\n\nAre Dips Limited in ETH?\n\nIf Ethereum fails to clear the $2,650 resistance, it could start a downside correction. Initial support on the downside is near the $2,580 level.\n\nThe first key support could be the $2,500 zone or the 50% Fib retracement level of the recent rally from the $2,346 swing low to the $2,642 high. A downside break and a close below $2,500 might send the price further lower. In the stated case, Ether could test the $2,440 support. Any more losses might send the price toward the $2,350 level.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 level.\n\nMajor Support Level – $2,500\n\nMajor Resistance Level – $2,650\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS13aGFsZS1zbmFwcy11cC00Njc3LWV0aC1pbi1ib2xkLWJldC1kZXRhaWxz0gFIaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtLXdoYWxlLXNuYXBzLXVwLTQ2NzctZXRoLWluLWJvbGQtYmV0LWRldGFpbHM_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Whale Snaps up 4,677 ETH in Bold Bet: Details - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nA crypto whale, or a large holder with a significant amount of cryptocurrency, just made a large purchase of 4,677 ETH, valued at roughly $11 million, according to data from Lookonchain.\n\nAdvertisement\n\nThe interesting thing about this purchase is that it seems to reflect a bold bullish bet on the Ethereum price.\n\nThis whale appears to be bullish on ETH and bearish on BTC, according to Lookonchain. Surprisingly, the whale exchanged his wrapped Bitcoin for Ethereum, borrowing 241 WBTC worth $11 million from Aave, which he exchanged for 4,677 ETH.\n\nWhile the real intentions of the whale remain unknown, indications point to the fact that the whale expects the price of ETH to rise shortly.\n\nEthereum outperforms Bitcoin\n\nExpectations for Bitcoin ETF approval are rising, and eyes are currently on Ethereum, which is presently outperforming Bitcoin at the moment.\n\nAt the time of writing, Bitcoin was down 2.11% in the last 24 hours to $45,647, following seesaw price activity in yesterday's trading. Ethereum, on the other hand, was up by 5.47% in this same time frame to $2,422.\n\nThis outperformance is causing Ethereum to rise against Bitcoin on multiple time frames. According to Matthew Hyland, a crypto analyst, this is not surprising, as both the BTC Futures in 2017 and the Coinbase IPO in 2021 saw ETH outperform BTC shortly after.\n\nWhile bullish expectations remain for the ETH price, it should be kept in mind that past performance does not guarantee future results.\n\nOn the other hand, legendary trader Peter Brandt retains a bearish bias from the standpoint of a swing trader rather than a \"hodler.\"\n\n\"My bias remains to be short ETH,\" Brandt said in a tweet, noting his belief that the Ethereum chart lacks underlying strength."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1jby1mb3VuZGVyLXZpdGFsaWstYnV0ZXJpbi1jYWxscy1mb3ItMzMtaW5jcmVhc2UtaW4tZ2FzLWxpbWl00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum co-founder Vitalik Buterin calls for 33% increase in gas limit - Cointelegraph",
        "content": "Ethereum co-founder Vitalik Buterin has advocated for a “modest” gas limit increase to potentially improve network throughput.\n\nDuring a Reddit ask-me-anything (AMA) organized by the Ethereum Foundation’s research team on Jan. 10, Buterin noted that the gas limit has not been increased for nearly three years, the longest time ever in the protocol’s history.\n\n“Honestly, I think doing a modest gas limit increase even today is reasonable,” said Buterin during the research team’s 11th AMA.\n\nButerin also made some brief calculations, saying this would imply an increase to around 40 million. The current gas limit is 30 million, according to Etherscan, so Buterin suggests an increase of 33%.\n\nEthereum average gas limit over time. Source: Etherscan\n\nThe average gas limit just after Ethereum’s genesis in 2015 was around 3 million, which has increased over time along with network usage and adoption.\n\nThe Ethereum gas limit refers to the maximum amount of gas spent on executing transactions or smart contracts in each block. Gas is the fee required to conduct a transaction or execute a contract on the blockchain.\n\nA gas limit is set to ensure that blocks are not too large, which would impact network performance and synchronization. Validators can also adjust the gas limit dynamically within specific parameters as they produce blocks.\n\nIncreasing the gas limit allows more transactions into each block, which theoretically increases the overall throughput and capacity of the network. However, it also increases loads on hardware and the potential risk of network spam and attacks.\n\nRelated: Daily gas spent on EVM inscriptions surges to record high of $8M\n\nAverage gas prices, or the cost of transacting on Ethereum, are currently around 35 gwei or $1.89, according to Etherscan. However, they have increased since the beginning of 2024 and are much higher for complex smart contract operations.\n\nNetwork gas fees spiked to a 2023 high of 150 gwei in May due to the inscriptions craze. A gwei is a denomination of Ethereum that represents one billionth of a single Ether (ETH).\n\nIn November 2023, Ethereum and Bitcoin users reignited the scalability debate as fees surged amid another round of inscriptions hype.\n\nMagazine: Lawmakers’ fear and doubt drives proposed crypto regulations in US"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vY29pbmdhcGUuY29tL2Jsb2cvd2h5LWlzLWV0aGVyZXVtLWNsYXNzaWMtZ29pbmctdXAv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Why is Ethereum Classic (ETC) Going Up? - CoinGape",
        "content": "Ethereum Classic price is continuously going up for the past few hours and is now floating around $28, at the time of writing. It recorded more than 30% gains in the last 24 hours with almost 35% weekly and monthly gains.\n\nThe approval news of the first Bitcoin spot ETF is spreading like wildfire in the crypto industry. And, it is already showing strong signs of impact on all major cryptocurrencies including Ethereum Classic. Let us learn more about what is happening in the industry and why ETC is going up, in the present article.\n\nBitcoin Spot ETF Approved, Finally\n\nThe long-awaited Bitcoin spot ETF was finally approved by the US SEC on 10 January, 2024. Entire crypto industry has been waiting for this news for several months. And, now that it is finally approved, several altcoins and Bitcoin are following an uptrend.\n\nThe anticipation of the Bitcoin ETF approval has itself brought considerable returns for Bitcoin since the past couple of months. From around $26,600 in October, 2023, Bitcoin’s value breached the $45,000 mark as soon as we entered January, 2024.\n\nWhile one of the strong reasons behind this price rally was the awaiting Bitcoin spot ETF approval, another reason is the upcoming Bitcoin halving event.\n\nAs the US SEC final judgment approached, a fake post was posted from the official X account. This caused a sharp price spike in the BTC chart. However, Gary Gensler, chair of the US SEC clarified that the US SEC account was hacked and the ETF approval post was posted by unauthorized individuals. As Gary Gensler stated that the post was fake, the BTC price dropped around 5% within a couple of hours.\n\nHowever, the US SEC finally approved the Bitcoin spot ETF application of Grayscale Investments. As a result, several altcoins like Ethereum, Ethereum Classic, Pepe Coin, and others are rising in value.\n\nEthereum Hits 20-Month High\n\nEthereum Price Chart on Jan 11, 2024\n\nSurprisingly, the Bitcoin spot ETF approval has more impact on altcoins when compared to Bitcoin. The BTC price rose slightly and briefly touched the $47,000 mark whereas the Ether price increased by around 10% in the last 24 hours and is trading above $2,600, at the time of writing.\n\nEthereum has hit its 20-month high as the last time it traded above $2,600 was in May, 2022. At present, Ethereum price is recording 18% weekly gains and 16% monthly gains. And, the ETH price is expected to rise further.\n\nMost of the investors believe that Ethereum is the next best cryptocurrency after Bitcoin. Because of its sophisticated technology and network upgrades Ethereum stands out from the rest of the cryptocurrencies. And, investors don’t hesitate when it comes to Ethereum in the market conditions like present.\n\nEthereum Classic to Reach the $30 Mark\n\nEthereum Classic Price Chart on Jan 11, 2024\n\nThe clear winner among all the altcoins is Ethereum Classic. The ETC price rose by 34% in the last 24 hours and is showing no signs of slowing down with its increasing trading volume. It is currently trading at around $28 and is just $2 away from reaching the $30 mark.\n\nSo far, Ethereum Classic is one of the top performing altcoins in the crypto industry after the Bitcoin spot ETF approval surfaced. In addition to the price, its trading volume is soaring by 276%, standing at $1.8 billion and implying that the price could surge further. Its market capitalization also surged by 34% and crossed the $4 billion mark today.\n\nThe approval of the Bitcoin spot ETF and the upcoming Bitcoin halving event are not only pushing the BTC price but also the prices of altcoins."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY3J5cHRvLm5ld3MvZXRoZXJldW0tYXBwbGljYXRpb25zLXRha2UtcGxhY2UtYXMtdG9wLWdhaW5lcnMtYWhlYWQtb2YtZXRmLWFubm91bmNlbWVudC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum applications take place as top gainers ahead of ETF announcement - crypto.news",
        "content": "According to CoinMarketCap, native tokens of Ethereum applications, including Lido DAO, Rocket Pool, and Aribtrum, take the lead ahead of spot Bitcoin ETF approval day.\n\nLido DAO (LDO) takes the top spot on the gainers on the Jan. 10 charts with a live price of $3.80, with a 24-hour trading volume reaching $385 million, in what is a 16.1% increase. The surge in the value of Ether (ETH) and native tokens of Ethereum-based applications is said to be driven by trader optimism surrounding the potential approval of an Ether exchange-traded fund (ETF) following the anticipated approval of a Bitcoin ETF in the United States.\n\nBlackRock’s iShares Ethereum Trust, a spot Ether ETF, may have its way paved by the approval of its Bitcoin counterpart.\n\nTop crypto gainers of the day | CoinMarketCap\n\nYou might also like: Stacks, Injective, Internet Protocol emerge as crypto top gainers\n\nFor similar reasons, Rocket Pool (RPL) has also seen an increase in value today, operating as a decentralized Ethereum staking pool that offers a competitive annual percentage rate (APR) of up to 4.3% for ETH2 staking. As of the most recent update, the live price of Rocket Pool stands at $31.76, accompanied by a 24-hour trading volume of $22 million, revealing a 14.9% increase in Rocket Pool’s value over the last 24 hours.\n\nRounding out the third spot is Arbitrum (ARB), which stands out as an Ethereum layer-two (L2) scaling solution, employing optimistic rollups to enhance speed, scalability, and cost-effectiveness within the Ethereum network. As of the latest data, the live price of Arbitrum is currently $1.94, accompanied by a 12.1% increase in value.\n\nWith the market experiencing significant volatility this week in response to ETF updates, investors are making many big moves in the crypto space.\n\nFollow Us on Google News"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjcxODQ3L3ZpdGFsaWstYnV0ZXJpbi1ldGhlcmV1bS1nYXMtbGltaXQtaW5jcmVhc2XSAVNodHRwczovL3d3dy50aGVibG9jay5jby9hbXAvcG9zdC8yNzE4NDcvdml0YWxpay1idXRlcmluLWV0aGVyZXVtLWdhcy1saW1pdC1pbmNyZWFzZQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Vitalik Buterin endorses raising Ethereum gas limit by 33% - The Block",
        "content": "Ethereum ETH +1.34% co-founder Vitalik Buterin voiced support for increasing the block gas limit — a move that could enhance the network’s capacity.\n\nIn a Reddit ask-me-anything session, when questioned about the safe increment of the gas limit, Buterin recommended a 33.3% increase, proposing to raise the Ethereum block gas limit from its current 30 million to 40 million units of gas.\n\nIf implemented, this adjustment would allow more transactions in each Ethereum block and improve capacity. Buterin stressed that the current gas limit, set at 30 million, has remained unchanged for nearly three years.\n\nThe gas limit in Ethereum represents the maximum computational effort that can be expended on processing transactions or executing smart contracts in a single block.\n\nMartin Köppelmann, co-founder of Gnosis, observed that increasing the gas limit would also push the operational requirements for nodes — likely necessitating more costs. Nevertheless, Köppelmann believed that the benefits of a higher gas limit, such as improved network efficiency and capacity, outweigh these potential issues.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nJesse Pollak, Coinbase protocols lead, also expressed strong support for the change. He stated, “I’m strongly in support of increasing the Ethereum gas limit to 40-45M — we have the network headroom and it will be beneficial for all parties.”\n\nUnlike several changes to Ethereum that necessitated hard forks, the increase in the Ethereum block gas limit can be achieved through validators adjusting their node configurations.\n\nSince Ethereum’s inception in 2015, the average gas limit was approximately three million. This limit has incrementally risen over time — reflecting the network’s escalating usage and adoption."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1zdXJnZS1hYm92ZS0yNDAwL9IBSWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1zdXJnZS1hYm92ZS0yNDAwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Technical Setup Suggests Fresh Surge Above $2,400 - NewsBTC",
        "content": "Ethereum price climbed higher above the $2,350 resistance. ETH outpaced Bitcoin and might even attempt a clear move above the $2,400 resistance.\n\nEthereum is attempting a fresh increase above the $2,350 resistance level.\n\nThe price is trading above $2,320 and the 100-hourly Simple Moving Average.\n\nThere is a key rising channel forming with support near $2,300 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could start a fresh surge if there is a close above the $2,400 level.\n\nEthereum Price Starts Increase\n\nEthereum price formed a base above the $2,220 level and started a fresh increase. ETH saw a sharp upward move despite a drop in Bitcoin below $46,500. The price gained pace for a move above the $2,300 and $2,320 levels.\n\nIt even broke the $2,350 resistance and tested the $2,400 zone. A high was formed near $2,399 and the price is now consolidating gains. There was a minor drop below $2,360. The price declined below the 23.6% Fib retracement level of the recent increase from the $2,243 swing low to the $2,399 high.\n\nEthereum is now trading above $2,320 and the 100-hourly Simple Moving Average. There is also a key rising channel forming with support near $2,300 on the hourly chart of ETH/USD.\n\nIf there is a fresh increase, the price might face resistance near the $2,380 level. The next major resistance is now near $2,400. A clear move above the $2,400 level might send ETH toward $2,440. A close above the $2,440 resistance could start a decent upward move.\n\nSource: ETHUSD on TradingView.com\n\nThe next key resistance is near $2,550. If the bulls push Ethereum above $2,550, there could be a rally toward $2,720. Any more gains might send the price toward the $2,800 zone.\n\nAnother Decline in ETH?\n\nIf Ethereum fails to clear the $2,400 resistance, it could start a fresh decline. Initial support on the downside is near the $2,320 level or the 50% Fib retracement level of the recent increase from the $2,243 swing low to the $2,399 high.\n\nThe first key support could be the $2,300 zone. A downside break and a close below $2,300 might send the price further lower. In the stated case, Ether could test the $2,240 support. Any more losses might send the price toward the $2,150 level.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 level.\n\nMajor Support Level – $2,300\n\nMajor Resistance Level – $2,400\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vY3J5cHRvLm5ld3MvZXRoZXJldW1zLXByaWNlLXN1cmdlcy1kZXNwaXRlLXRoZS1tYXJrZXQtd2lkZS1jaGFvcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum's price surges despite the market-wide chaos - crypto.news",
        "content": "The crypto market witnessed decline after false news about a Bitcoin (BTC) exchange-traded funds (ETF), but despite bearish sentiment in the market, Ethereum (ETH) posted gains.\n\nETH gained 3% in the past 24 hours and is trading at $2,380 at the time of writing. The second-largest cryptocurrency even got close to the $2,400 mark as the hacked X account of the U.S. Securities and Exchange Commission announced the approval of a spot BTC ETF.\n\nETH price, whale activity, open interest and RSI – Jan. 10 | Source: Santiment\n\nEthereum’s market cap is holding strong above $286 billion with a daily trading volume of $17.1 billion.\n\nYou might also like: Spot Bitcoin ETF issuers file new AP disclosures with SEC\n\nAccording to data provided by Santiment, whale transactions consisting of at least $100,000 worth of ETH surged by 7.9% over the past day — rising from 5,790 to 6,242 unique transactions in 24 hours.\n\nOn the other hand, Ethereum’s Relative Strength Index (RSI) is currently hovering around 59, per Santiment. The indicator suggests that ETH is still in a good position for a further potential rally.\n\nWhile the increased whale activity suggests high price volatility, Ethereum could still hold its current price point if the RSI stays below the 60 mark.\n\nFollowing the price surge, according to the market intelligence platform, Ethereum’s total open interest (OI) increased by 4% over the past 24 hours — rising from $3.75 billion to $3.90 billion.\n\nFollow Us on Google News"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ldGhlcmV1bS1vdXRwZXJmb3Jtcy1iaXRjb2luLWRlc3BpdGUtZXRmLTE3NTQyNjIyMS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum outperforms Bitcoin despite ETF debut - Yahoo Finance",
        "content": "Ethereum’s native cryptocurrency Ether has been outshining Bitcoin’s price despite the latter’s historic launch of several spot Bitcoin exchange-traded funds (ETFs) in the U.S.\n\nEther rose 6.4% to US$2,602 in the past 24 hours, while Bitcoin has been trading sideways at US$46,134, according to CoinGecko data.\n\nHowever, the non-fungible tokens market tells a different story, with Bitcoin-based assets outselling Ethereum-based NFTs. Bitcoin recorded over US$18.5 million in NFT sales in the past 24 hours, while US$15.8 million worth of Ethereum NFTs changed hands, according to CryptoSlam.\n\nThe Securities and Exchange Commission (SEC), which yesterday approved 11 spot Bitcoin ETFs, is expected to make its first decision on spot Ethereum ETF applications by May 23, 2024. Despite the optimism, SEC Chair Gary Gensler’s previous statements suggest a cautious approach to approving crypto asset securities, particularly for assets other than Bitcoin.\n\nThe price increase reflects a broader market sentiment that an Ethereum ETF could soon follow the path of Bitcoin ETFs, with firms like BlackRock and Ark having filed applications.\n\nThe possibility of an Ethereum ETF has sparked discussions about the classification of cryptocurrencies as securities or commodities, a debate that could impact the SEC’s decision-making process."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi1hY2N1bXVsYXRpb24tYWhlYWQtb2Ytc3BvdC1idGMtZXRmLTNrL9IBYWh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi1hY2N1bXVsYXRpb24tYWhlYWQtb2Ytc3BvdC1idGMtZXRmLTNrL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Whale Accumulation Surges Ahead of Spot BTC ETF; Is $3K Near? - CoinGape",
        "content": "Ethereum Price Prediction: Ethereum, the second-largest cryptocurrency, currently shows a lack of bullish momentum contrary to the generally bullish sentiment around Bitcoin spot ETFs. The ETH price has been resonating between the $2400 and $2140 horizontal levels for the past five weeks, with the overhead supply preventing the buyers from a higher rally. Will potential approval from the US SEC bolster the Ether price to escape this uncertainty?\n\n$2400 Breakout Will Trigger a Direction Rally\n\nA steep support trendline leads to the current recovery trend in the ETH price.\n\nA potential recovery may face new resistances at $2680 and $3000\n\nThe intraday trading volume in Ether is $20.8 Billion, indicating a 68% gain.\n\nAn ascending trendline in the daily time frame chart shows the Ethereum price recovery is intact and the current sideways trend is likely a post-rally consolidation to recuperate the exhausted bullish momentum.\n\nadvertisement\n\nInterestingly, the Ethereum whales have accumulated nearly $1 billion worth of Ether despite its underperformance relative to Bitcoin. A recent tweet from renowned crypto analyst Ali Martinez reveals that the Ethereum smart money has significantly increased its holdings by accumulating more than 410,000 ETH tokens during the past month(December).\n\nThis accumulation amid the crypto market’s progress towards the first spot Bitcoin ETF hints the ETH may also witness a major impact of US SEC approval as the potential for spot Ethereum ETF will also accelerate.\n\nBy press time, the ETH price shows a 3.77% jump and teases a bullish breakout from the $2400 resistance level. If buyers succeed in closing a daily candle above this barrier, it could lay a solid foundation for additional upward movement.\n\nSuch a breakout could potentially result in a 10% rise in ETH, setting its next target at around $2,680. Following this, a prolonged recovery could target the $3,000 and $3280 mark.\n\nThis Support Prevents ETH From Major Correction\n\nOver the past two months, the ETH price has been receiving dynamic support from an ascending trendline. The coin price rebounded several times from this support indicating the buyers are actively accumulating at a dip which is a key sign of sustainable recovery. Thus, it also indicates losing this support could intensify selling pressure and trigger a new correction in this asset.\n\nBollinger Band: An uptick in the upper boundary of the Bollinger band indicator suggests the bullish momentum is strengthening.\n\nAverage Directional Index: A low value of ADX(15%) hints the ongoing consolidation has managed to offer buyers sufficient break to kickstart a new rally.\n\nRelated Articles:"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDI0LzAxLzExL3doeS1iaXRjb2luLWV0aGVyZXVtLWFuZC1kb2dlY29pbi1hcmUtb24tdGhlLW1vdmUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Why Bitcoin, Ethereum, and Dogecoin Are on the Move Higher Today - The Motley Fool",
        "content": "It's finally here. The long-awaited spot Bitcoin (BTC 1.93%) ETF has been approved by the Securities and Exchange Commission (SEC), with 11 spot exchange-traded products officially getting the nod from regulators, after years of denials and a very hawkish regulatory stance. Since the Winkelvoss twins first proposed a spot Bitcoin exchange-traded fund (ETF) in 2013, investors have effectively been waiting for more than a decade for this product to be launched.\n\nBitcoin briefly surged to nearly $49,000 per token following this announcement, the highest level it's seen in almost two years. Ethereum (ETH 1.09%) and Dogecoin (DOGE 5.05%) saw similar spikes this morning, but have since given up some of these gains. As of 1 p.m. ET, Bitcoin is currently trading flat (having seen a big boost in its valuation yesterday prior to this announcement), but Ethereum and Dogecoin are 6.2% and 7.7% higher over the past 24 hours.\n\nLet's dive into what this approval means for Bitcoin and other top-tier cryptocurrencies right now.\n\nWhat does this spot Bitcoin ETF approval mean for the crypto sector?\n\nThe potential impacts of this approval on Bitcoin are notable. A range of estimates for how much capital could flow into these ETFs has been put forward, but Standard Charter believes that number could be as high as $100 billion. That's a tremendous amount of money, and certainly could change the investing landscape for institutional funds looking to diversify their portfolios into these asset classes.\n\nThe SEC's official approval of a swath of ETFs could pave the way for future spot Ethereum exchange-traded products to be launched. That's a key driver of enthusiasm around the world's second-largest cryptocurrency, with Dogecoin rallying as it usually does in tandem with the sector, in a familiar higher-volatility fashion today.\n\nThe 11 spot Bitcoin ETFs approved by regulators include: Grayscale Bitcoin Trust, iShares Bitcoin Trust, Valkyrie Bitcoin Fund, Ark 21Shares Bitcoin Trust, Invesco Galaxy Bitcoin ETF, VanEck Bitcoin Trust, WisdomTree Bitcoin Trust, Fidelity Wise Origin Bitcoin Trust, Bitwise Bitcoin ETF, Franklin Bitcoin ETF, and Hashdex Bitcoin ETF. These funds are now trading, and are seeing mixed performance.\n\nSome of this divergence among Bitcoin exchange-traded funds can be linked to the rather wide range of fees offered by providers. Updated pricing provided by a number of funds ahead of today's approvals show many ETFs dropping fees substantially, to as low as 0.2%. Given the similar nature of each of these funds, that could indicate a race to the bottom in terms of management fees, which is great for investors.\n\nNotably, crypto traders betting against Bitcoin have lost a substantial amount of money in the derivatives market. Estimates suggest closed short positions cost bears around $100 million.\n\nIs now the time to buy a Bitcoin ETF?\n\nThe value these ETFs provide is notable. Bitcoin, as representative of crypto and digital assets as whole, gains legitimacy in the eyes of many investors. Additionally, investors now don't have to go through the trouble of setting up a wallet, researching how blockchain technology works, and jumping through what can be perceived as too many hoops to invest in crypto.\n\nFor institutional investors, these ETFs also provide liquidity, allowing for seamless integration within their portfolios, and allowing for things like model portfolios (which are investment products tailored to specific investors) to include some proportion of crypto. Being able to readily trade Bitcoin on the open markets is a big deal for asset managers, and I think the market is correct to assume this will lead to a tsunami of cash headed into this space.\n\nEthereum's prospects in terms of getting proposed spot ETFs approved may be more murky. Given the incredibly long lag between proposals and approvals for Bitcoin ETFs, these products could still have a ways to go. That said, these approvals do provide a blueprint for regulators looking at spot Ethereum ETFs, and given the SEC's rather favorable stance toward both Bitcoin and Ethereum, one might certainly surmise that the probability of future approvals has increased over the past 24 hours.\n\nAs is the case with many asset classes, investing in ETFs has its pros and cons. For those comfortable with buying Bitcoin directly, saving even 20 basis points each year can add up over the long term. That said, for those seeking simplicity and convenience, these products certainly look more intriguing than involving oneself in the rigmarole around buying and selling Bitcoin on exchanges. Personally, I think a race to the bottom in fees could make Bitcoin ETFs the preferred investing option for most investors, and I think these are certainly worth considering right now."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjcxOTY3L3BvbnRlbS1yYWlzZXMtNi1taWxsaW9uLXRvLWVuYWJsZS1ldGhlcmV1bS1tb3ZlLWNvbXBhdGlibGUtYXBwc9IBZ2h0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL2FtcC9wb3N0LzI3MTk2Ny9wb250ZW0tcmFpc2VzLTYtbWlsbGlvbi10by1lbmFibGUtZXRoZXJldW0tbW92ZS1jb21wYXRpYmxlLWFwcHM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Pontem raises $6 million to enable Ethereum and Move-compatible apps - The Block",
        "content": "Web3 product development studio Pontem has raised a $6 million financing round, co-led by Faction and Lightspeed Venture Partners.\n\nParticipants in the round also include Pantera Capital, Aptos Foundation, Wintermute, Altonomy, Shima Capital and Kraken Ventures, among others.\n\nPontem plans on deploying the funds to enable developers to build apps that are both Ethereum Virtual Machine and Move-compatible — expanding the usage of the Move programming language beyond the Aptos and Sui blockchains.\n\n\"We aim to deploy this influx of capital to increase usage of Move beyond Aptos and Sui, empowering dapp teams with a programming language that enables devs to add new features that support the security and scalability needed for mass adoption,\" Pontem co-founder Alejo Pint said in a statement. \"Vendor lock into the EVM is only a temporary problem. We aim to solve this problem on Ethereum to enable Web2 devs to more easily and confidently enter the space.\"\n\n\"Pontem is building critical primitives for the Move ecosystems,\" Faction Partner Banafsheh Fathieh said. \"Pantera is excited to be investing into Pontem and help fuel the Move and Aptos ecosystem. We believe the team has been doing a tremendous job of building the necessary financial and technical infrastructure to bring consumers and developers to the decentralized web,\" Pantera Capital Managing Partner Paul Veradittakit added.\n\nThis latest funding round brings Pontem's total raised capital to $10.5 million, following a $4.5 million raise in June 2021 via a private token sale led by Mechanism Capital and Kenetic Capital, alongside Delphi Ventures and Animoca Brands.\n\nPontem's technology was originally developed by Aptos team members. Aptos is a relatively new Layer 1 blockchain based on the Move programming language developed at Meta — composed of people from Facebook’s now shut-down Diem stablecoin project.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nIncreasing the usage of Move ecosystems\n\nMove is a Rust-derived programming language designed for creating secure and efficient smart contracts. Unlike the EVM that utilizes the Solidity language, the Move VM aims to enhance throughput via parallel processing. Pontem also argues that Move is more appealing for Web2 developers from traditional finance and tech sectors looking to build in Web3 as they are already accustomed to similar static-type languages.\n\nThe capital is earmarked for developing Move Virtual Machine products on EVM-compatible blockchains like Ethereum, including the new Move-based Layer 2 Lumio — an optimistic rollup on Ethereum that leverages alternative Layer 1s like Aptos to process transactions.\n\nPontem claims products already deployed on Aptos, including the Pontem Wallet and Liquidswap DEX, have garnered 40,000 weekly active users and up to $1 million in daily volume, respectively.\n\nPontem also said it plans to add support for the Solana Virtual Machine and other blockchain languages in the future.\n\nDisclaimer: Evgeny Gaevoy, the founder and CEO of Wintermute, previously sat on The Block's board of directors from April 2023 to early November 2023 and remains a minority shareholder."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL2NvaW5wZWRpYS5vcmcvcHJpY2UtYW5hbHlzaXMvZXRoZXJldW0tZWNvc3lzdGVtLXRha2luZy1vZmYtaGVhdmlseS10aGUtZXRoLXByaWNlLWlzLWxpa2VseS10by1oaXQtdGhpcy1sZXZlbC1pbi1uZXh0LTQ4LWhvdXJzL9IBigFodHRwczovL2NvaW5wZWRpYS5vcmcvcHJpY2UtYW5hbHlzaXMvZXRoZXJldW0tZWNvc3lzdGVtLXRha2luZy1vZmYtaGVhdmlseS10aGUtZXRoLXByaWNlLWlzLWxpa2VseS10by1oaXQtdGhpcy1sZXZlbC1pbi1uZXh0LTQ4LWhvdXJzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Ecosystem Taking Off Heavily: The ETH Price is Likely to Hit This Level in Next 48 Hours - Coinpedia Fintech News",
        "content": "A passionate cryptocurrency and blockchain author qualified to cover every event in the crypto space. Researching minute occurrences and bringing new insights lie within the prime focus of my task.\n\nStory Highlights Ethereum is displaying extreme strength against Bitcoin, which suggests the token is extremely bullish in the mid-term\n\nBesides, Bitcoin's dominance experienced a fake-out after a channel breakout, which is an extremely bullish sign for altcoins\n\nThe Ethereum price displayed an epic retest after marking the daily highs above $2600. Besides, the trading volume on the previous trading day was the highest since November 2022, which elevated the levels by more than 10%. While the ETH price is pumping against Bitcoin because of bullish BTC events, it appears that the Ethereum ecosystem is heavily taking off. After marking new highs, there is a huge possibility of a bearish pullback below $2500 before triggering a fresh upswing.\n\nThe ETH price has maintained a decent upswing since the last few days of October, elevating over 70% from the interim lows of around $1522. The recent price action caused the price to pierce through the crucial resistance zone between $2400 and $2500 and closed the previous day’s trade beyond $2600. Moreover, the value sustained above $2600 at press time suggests the bulls have jumped in action, and hence the target at $3000 has now been activated.\n\nAfter consolidating between the $2150 and $2400 price ranges for over a month, the ETH price broke up and reached a high above the $2600 mark. The token is experiencing a minor pullback at the moment, which could be quickly overcome by giant bullish action soon. Being different from the previous price action, the ETH price is expected to hit $2500 any time from now on. The RSI has still not marked highs above the resistance, and the price soared above the crucial resistance, indicating the bullish momentum may prevail for a long time.\n\nThe upward momentum may lift the price beyond the next target at around $2800 in the next few days, but before hitting the milestone at $3000, bulls could lose their momentum. This is when a bearish divergence in RSI will be recorded, which may compel the price to initiate a fresh descending trend. However, the current resistance zone between $2400 & $2500 may act as a strong support base, which may hold and trigger a healthy rebound soon.\n\nTherefore, the next couple of days may be extremely crucial for the Ethereum (ETH) price, as a bullish weekly close may squash the bearish narrative."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tZXllcy1icmVha3Rocm91Z2gtYXMtYW5hbHlzdC1zaWduYWxzLXVwd2FyZC10cmVuZC_SAWVodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2V0aGVyZXVtL2V0aGVyZXVtLWV5ZXMtYnJlYWt0aHJvdWdoLWFzLWFuYWx5c3Qtc2lnbmFscy11cHdhcmQtdHJlbmQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ready For Liftoff: Ethereum Eyes Breakthrough As Analyst Signals Upward Trend - NewsBTC",
        "content": "Ethereum (ETH) is currently at a crossroads that could define its trajectory in the coming weeks. Renowned crypto analyst Michaël van de Poppe has shared a notably bullish perspective, highlighting Ethereum’s approach to its 2022 low as a potential springboard for a breakout.\n\nIn his analysis, Van de Poppe underscores the importance of Ethereum’s current positioning, suggesting that its proximity to last year’s low could be a catalyst for absorbing liquidity and igniting a bullish trend.\n\nAnalyst’ Ethereum Bullish Projection Amid Market Movements\n\nVan de Poppe’s forecast hinges on the broader market context, particularly the potential approval of a spot Bitcoin exchange-traded fund (ETF) in the US. Should this approval materialize, he anticipates a significant impact on the ETH/BTC trading pair, potentially leading to a liquidation candle – a sharp price movement.\n\nSubsequently, Van de Poppe predicts a substantial shift in market dynamics with funds rotating into Ethereum. This move, he believes, will be accompanied by a “bullish weekly divergence,” setting Ethereum on an upward trajectory.\n\n#Ethereum approaches the low of 2022 and is likely going to take the liquidity there. If an ETF approval for #Bitcoin happens, I think we’ll have a liquidation candle on ETH/BTC and after that a rotation into Ethereum, combined with a bullish weekly divergence. pic.twitter.com/kGq91S7kq9 — Michaël van de Poppe (@CryptoMichNL) January 9, 2024\n\nMeanwhile, Ethereum appears to be struggling to catch up with Bitcoin’s price performance. It recently surpassed the $2,300 mark, echoing Bitcoin’s surge above $47,000 – its highest since April 2022.\n\nHowever, Ethereum has seen a slight retracement and is currently trading around $2,249. This slight dip comes amid a week when the asset experienced a 5.8% decline, contrasting with its significant trading volume surge from $13 billion last Tuesday to over $23 billion today.\n\nUpward Swing With Potential Spot Bitcoin ETF Approval\n\nThe critical factor in Van de Poppe’s analysis is the potential approval of a spot Bitcoin ETF in the US. The market is on edge, with major players like BlackRock leading the spot ETF race alongside others like Grayscale Investments, Valkyrie, and ARK 21Shares.\n\nThese firms have recently submitted updated 19b-4 filings for their proposed Bitcoin ETFs, with the market sentiment heavily leaning towards a positive outcome.\n\nBlackRock just re-filed their S-1 based on last min comments given yesterday. Hard to tell what has changed at first glance, but imp thing is that the unheard of 24hr turnaround time bt filing, comments and re-filing tells us all parties aiming to get this show on road pronto. pic.twitter.com/61cPtGJ4Oy — Eric Balchunas (@EricBalchunas) January 9, 2024\n\nBlackRock, in particular, has stirred significant optimism in this spot Bitcoin ETF race. With an approval decision expected by January 10, tomorrow, such a development could bolster Bitcoin and catalyze a fund rotation into Ethereum.\n\nVan de Poppe isn’t alone in his bullish stance on Ethereum. Crypto Tony, another prominent crypto analyst, shares a similar outlook. Tony posits that Ethereum’s path to a bullish phase could commence if it maintains above the key level of $2,130.\n\nCurrently trading above this crucial point, Ethereum’s stability at or above this level is considered a sign of market strength, potentially paving the way for future gains. Furthermore, a push towards and above the $2,500 mark could significantly bolster Ethereum’s bullish momentum, as highlighted by Crypto Tony.\n\n$ETH / $USD – Update The ETH range is simple. Remain above $2,130 and we are bullish .. Reclaim the range high at $2,500 and we are really bullish pic.twitter.com/YKOph2YbRY — Crypto Tony (@CryptoTony__) January 8, 2024\n\nFeatured image from Unsplash, Chart from TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS9ldGhlcmV1bS1wcmljZS1mb3JlY2FzdC1ldGhlcmV1bS1zaG93LXNpZ25zLW9mLXN0cmVuZ3RoLW9uLXdlZG5lc2RheS0xNDAxMzky0gFoaHR0cHM6Ly9hbXAuZnhlbXBpcmUuY29tL2VuL2V0aGVyZXVtLXByaWNlLWZvcmVjYXN0LWV0aGVyZXVtLXNob3ctc2lnbnMtb2Ytc3RyZW5ndGgtb24td2VkbmVzZGF5LzE0MDEzOTI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Forecast – Ethereum Show Signs of Strength on Wednesday - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vY3J5cHRvLm5ld3MvZXRoZXJldW0tcHJpY2UtdG8tY3Jvc3MtMzAwMC1hZnRlci1iaXRjb2luLWV0Zi1hcHByb3ZhbC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum vs Bitcoin: Will ETH Price outperform BTC After ETF Approval? - crypto.news",
        "content": "Ethereum price briefly broke past the $2,400 mark on Jan. 10, up 10% within the weekly time frame, ahead of the much-anticipated Bitcoin ETF Approval.\n\nThe crypto market experienced widespread volatility on Jan 9 after the U.S. Securities and Exchange Commission (SEC) announced false Bitcoin (BTC) ETF approval in a now-denounced post on X.\n\nDespite the raging controversy, Ethereum’s (ETH) price has maintained a steady uptrend, trading as high as $2,440 on Jan. 10.\n\nEthereum vs Bitcoin: Crypto derivatives traders are betting bigger on ETH\n\nBetween Jan. 7 and Jan. 10, Ethereum’s 11% price growth performance has dwarfed Bitcoin’s 4%. Interestingly, vital derivative market metrics now suggest that ETH price could further outperform BTC if the SEC issues a timely positive verdict on Bitcoin Spot ETFs.\n\nFirstly, the funding rate represents the interest paid by bullish traders to inverse traders to keep their LONG futures contract positions open. As of morning trading hours Eastern time on Jan. 10, ETH currently has a Funding rate of 0.014%, which marginally exceeds currently exceeds BTC’s 0.12%\n\nEthereum (ETH) vs Bitcoin (BTC) Funding Rate | Source: Coinglass\n\nPut concisely, a higher positive funding rate in Ethereum than in Bitcoin implies increased demand for long positions in the ETH derivatives market, potentially reflecting a more optimistic sentiment.\n\nIn further confirmation that Ethereum price could outperform Bitcoin, the open interest dynamics have also flashed similar signals since the week’s turn.\n\nYou might also like: Bloomberg ETF analyst: Bitcoin ETF to be approved today\n\nETH open interest growth has outpaced BTC\n\nETH Open Interest has increased by 14.6% from $3.71 billion at close on Jan. 7 to $4.57 billion at the time of writing on Jan 10. Meanwhile, BTC open interest has witnessed only a 5% boost, from $6.4 billion to $7.3 billion during this period.\n\nEthereum (ETH) vs. Bitcoin (BTC) Open Interest | Source: Velo Data\n\nOpen interest represents the dollar value of all active futures contracts for a specific cryptocurrency. An increase in open interest implies more new entrants are bringing fresh capital than those closing out their positions.\n\nThe chart above clearly illustrates that the percentage increase in ETH has outpaced Bitcoin’s open interest amid intense speculation on the spot BTC ETF verdict. This affirms that crypto traders are betting on Ethereum to deliver larger price gains in the days ahead.\n\nWill ETH reach $3,000 after BTC ETF approval?\n\nDespite Bitcoin pulling more media traction, the current ETH Funding rate and Open Interest trends imply that crypto traders anticipate higher price gains in Ethereum after a positive ETF verdict. If this scenario continues, ETH’s price will likely reclaim the $2,500 territory.\n\nHowever, IntoTheBlock’s in/out of the money around price (IOMAP) data, which groups the current ETH holders by their historical entry points, shows a major resistance sell-wall around the $2,475 range.\n\nThe IOMAP depicts that 567,150 addresses have acquired 398,810 ETH at the average price of $2,475.\n\nGiven that this cluster of holders has been holding at a loss for nearly two years, they could rapidly book profits as ETH price approaches their break-even point again.\n\nBut if the derivative traders continue doubling their bullish positions as depicted by the elevated ETH funding rates, Ethereum’s price could break above $2,500 for the first time since May 2022.\n\nEthereum (ETH) Price Forecast, Jan. 2024 | Source: IntoTheBlock\n\nConversely, if a material market even sends ETH price into a down trend, the $2,200 support level could be crucial.\n\nAs seen above, the 2.85 million addresses that had acquired 7.7 million ETH coins at the minimum price of $2,220 could mount a formidable buy-wall to avert a prolonged Ethereum price downswing.\n\nRead more: SEC approves spot Bitcoin ETF on accelerated basis\n\nFollow Us on Google News"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvc25hcHNob3QvYW5hbHlzdHMtcGVnLWNoYW5jZS1vZi1ldGhlcmV1bS1ldGYtYXBwcm92YWwtYnktbWF5LWFzLWxpa2VseS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum ETF next? Here's when analysts expect approval - DLNews",
        "content": "Crypto market watchers say it’s likely that a spot Ethereum ETF could be approved this year.\n\nComments come as the US SEC approved spot Bitcoin ETFs on Wednesday.\n\nOn Wednesday, the US Securities and Exchange Commission Chair Gary Gensler begrudgingly approved 11 spot Bitcoin exchange-traded funds, sparking a new era for digital assets.\n\nNow, the question is whether Ethereum ETFs are far behind.\n\nIf you ask online bettors, ETF pundits, and crypto market analysts, they all agree: Ethereum funds are next.\n\nWill an Ethereum ETF be next?\n\nThere is a 74% chance that an Ethereum ETF will be approved by May 31, according to online bettors on prediction market Polymarket.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\nBloomberg Intelligence analyst and crypto’s go-to ETF pundit Eric Balchunas has similarly put the odds of the SEC giving Ethereum funds a thumbs up by May at 70% when speaking with Cointelegraph.\n\nThe SEC has to decide on several Ethereum ETF applications by May 23.\n\nFinancial powerhouses BlackRock, Fidelity, and Ark Invest are already among the institutions that have applied for spot Ethereum ETFs.\n\nMarket analysts also expect a spot Ethereum ETF may be in the works.\n\nJoin the community to get our latest stories and updates\n\n“With Ethereum futures ETF already live and Ethereum futures trading on CME, the same rationale for ETF spot approval should apply,” Gautam Chhugani, managing director at investment advisory firm Bernstein, wrote in a research report on Thursday.\n\nEarlier this week, Standard Chartered analysts wrote in a research report “that the SEC is ultimately likely to allow spot ETH ETFs” because Gensler has not previously listed Ethereum among the coins and tokens the agency deem to be securities.\n\nThe analysts also hinted how they thought the price of Bitcoin and Ethereum may change in the lead-up to a potential approval, looking at how the price of gold and silver changed when their respective exchange-traded products were launched in 2004 and 2006.\n\n“Gold outperformed after its ETP was introduced in the US, presumably on actual inflows, whereas silver outperformed in the lead-up to its ETP (presumably on anticipated flows into the relatively less liquid silver market),” the analysts wrote. “Silver then gave back its relative performance after its ETP was introduced.”\n\nOther voices remained more cautious.\n\nIt has “taken us a very long time to get the SEC comfortable” with Bitcoin ETFs, Leah Wald, CEO of alternative asset management firm Valkyrie, told CoinDesk, adding that “we have a lot of work to do” to get the agency comfortable about Ethereum.\n\nCrypto market movers\n\nBitcoin is up more than 4% on the day, trading just above $47,000.\n\nEthereum is up over 10% on the day, trading at over 2,600.\n\nWhat we’re reading"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDI0LzAxLzExL3doeS1iaXRjb2luLWNhc2gtZXRoZXJldW0tY2xhc3NpYy1hbmQtbGl0ZWNvaW4tYXJlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Why Bitcoin Cash, Ethereum Classic, and Litecoin Are Surging Today - The Motley Fool",
        "content": "The entire crypto world has been shaken, in a positive way, by recent developments around yesterday's approval of certain exchange-traded products. For Bitcoin Cash (BCH -3.65%), Ethereum Classic (ETC -0.50%), and Litecoin (LTC -1.44%), broadly positive sectorwide sentiment appears to be a key driver behind these tokens' impressive moves higher. As of 2 p.m. ET, these three tokens have rocketed 13.9%, 34.3%, and 6.3%, respectively, over the past 24 hours.\n\nThe approvals of 11 spot Bitcoin exchange-traded funds (ETFs) yesterday by the Securities and Exchange Commission (SEC) has undoubtedly led to significant interest across the cryptocurrency sector today. Much of today's increase can be attributed to expectations that institutional capital will flow into this sector in dramatic fashion. In fact, projections from some analysts peg the impact of these approvals at around $100 billion. That's a win not only for Bitcoin, but for investors considering this entire space, as it legitimizes crypto for institutional and retail investors alike.\n\nLet's dive into what's behind the specific moves in these three cryptos today, over and above the obviously bullish headline news dominating the market right now.\n\nWhy are these three tokens surging today?\n\nFor Bitcoin Cash, a peer-to-peer electronic cash system tied closely to Bitcoin, today's news is obviously a net positive for this network. However, there are other key drivers supporting Bitcoin Cash's recent performance. News that cryptocurrency payments have surged to a record high in 2024 is very bullish for the likes of Bitcoin cash and other payments-focused cryptocurrencies. A report on Jan. 10 cited that nearly 1.3 million Bitcoin transactions were reportedly processed in 2023 alone, bringing the total number of Bitcoin transactions to more than 4 million. For those bullish on crypto as a payments facilitation technology, this is a strong catalyst to consider for Bitcoin Cash.\n\nFor Ethereum classic, the proof-of-work fork of the Ethereum blockchain, excitement around the potential approval for spot Ethereum ETF approvals appears to be driving interest in this adjacent token. Essentially, investors and traders appear to be speculating on a potential hard fork for Ethereum Classic, which would better align the network with Ethereum's, and improve its outlook (if Ethereum surges as a result of ETF approvals, one could argue Ethereum Classic could be due for a rally as well). Of course, such a substantial move of more than 30% may be overdone, so this will certainly be a token traders focus in on in the coming days.\n\nLitecoin's more muted rise today appears to be tied more to sector-specific tailwinds than anything else. Largely viewed as a Bitcoin and Ethereum alternative, this is a token that typically rides the tides higher and lower over specific time frames. Right now, there's a rising tide lifting most boats in this sector, and Litecoin investors are certainly pleased to see momentum taking this token higher over the past 24 hours.\n\nIs this momentum sustainable?\n\nUltimately, we'll have to see if these spot ETF approvals are a \"sell the news\" event, or a strong catalyst that puts a floor beneath crypto prices for the foreseeable future. In many respects, we won't know which outcome will materialize until after the fact. Thus, some amount of hesitation may lead to a waiting period for certain long-term investors, and could present an opportunity for buyers considering these tokens to jump in and ride momentum higher over the medium term.\n\nOverall, I think yesterday's spot ETF approvals are a bullish catalyst for the sector. For one, these approvals legitimize crypto as an asset class institutional investors can buy into. Another key factor driving sectorwide interest is the flurry of institutional capital expected for large-cap cryptos. Accordingly, for those seeking exposure to these trends, and looking for less-visible (and potentially higher-upside) ways to play crypto, these three tokens will likely continue to be in focus in the coming weeks."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS9ldGhlcmV1bS1wcmljZS1mb3JlY2FzdC1ldGhlcmV1bS1jb250aW51ZXMtdG8tc2VlLWJ1eWVycy1qdW1wLWluLTE0MDE2NTXSAWRodHRwczovL2FtcC5meGVtcGlyZS5jb20vZW4vZXRoZXJldW0tcHJpY2UtZm9yZWNhc3QtZXRoZXJldW0tY29udGludWVzLXRvLXNlZS1idXllcnMtanVtcC1pbi8xNDAxNjU1?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Forecast – Ethereum Continues to See Buyers Jump In - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zcG90LWV0aGVyZXVtLWV0Zi1uZXh0LWZvci1zZWMtYXBwcm92YWwtYW5hbHlzdHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Spot Ethereum ETFs now have a straight shot for approval — Analysts - Cointelegraph",
        "content": "With 11 spot Bitcoin (BTC) exchange-traded funds approved on Jan. 10, spot Ether (ETH) ETFs should have a clear path to approval in 2024 — and one analyst is even tipping a 70% chance of approval by May.\n\nBloomberg ETF analyst Eric Balchunas previously told Cointelegraph he couldn’t see a scenario where spot Bitcoin ETFs are approved but spot Ether ETFs aren’t.\n\n“The Ether spot is tied to the hip of Bitcoin spot for sure. It’s gonna go wherever it goes. It’s basically like on a 15-foot rope following it.”\n\nBalchunas also noted he had heard “on the back channels” that spot Ether ETFs “will be fine.”\n\nNew deadline to obsess over just dropped\n\n\n\nMay 23rd is the final deadline for decision on VanEck’s spot ETH ETF pic.twitter.com/dgi5EVbPeQ — Will (@WClementeIII) January 10, 2024\n\nMeanwhile, digital asset lawyer Joe Carlasare has also tipped for spot Ether ETFs to be approved this year but believes “it will take a bit longer than folks expect.”\n\n“Ethereum spot ETFs will be approved [but] the SEC will try to carefully craft a precedent that permits them to retain some discretion in determining which digital asset ETFs will be permitted to come to market.”\n\n“Put another way, I think the SEC is trying to provide guidance that would deter applicants from filing ETFs for every major token,” Carlasare added.\n\nBalchunas said he estimates a 70% chance that spot ETH ETFs will be approved by May — which is the month the SEC must make a final decision for several applications — though he said the timing for launch was less clear.\n\nThe price of Ether spiked around 3% after the approvals, reaching over $2500 — the first time since May 2022. Ether is trading at $2533 at the time of publication, up 7% in the past 24 hours.\n\nThe price of Ether over 24 hours. Source: CoinMarketCap\n\nCarlasare believes that spot ETH ETFs won’t start trading until the third quarter of 2024, while one of the spot Ether ETF applicants, Hashdex, recently tipped the Ether products to begin trading as early as the second quarter.\n\nPrior to the SEC’s spot Bitcoin approval, Valkyrie Funds’ chief investment officer Steven McClurg said he wouldn’t be surprised if spot Ether and XRP (XRP) ETFs come to market after Bitcoin.\n\nRelated: SEC solicits comments on Fidelity’s spot Ether ETF application\n\nFellow Bloomberg ETF analyst James Seyffart is also confident the SEC will give the green light to spot Ether ETFs because the SEC implicitly accepted Ether as a commodity when it approved Ether futures ETFs in September.\n\n“By approving those Ethereum futures ETFs, they’re implicitly accepting those Ethereum futures as commodities futures,\" Seyffart said during CryptoQuant’s private webinar on Jan. 4.\n\nAlright, that’s enough of spot bitcoin ETFs…\n\n\n\nWen spot ether ETFs? — Nate Geraci (@NateGeraci) January 10, 2024\n\nBlackRock, VanEck, ARK 21Shares, Fidelity and Invesco Galaxy, Grayscale and Hashdex are among the spot Ether ETF applicants vying for SEC approval.\n\nThe SEC must decide on VanEck’s application by May 23, ARK 21Shares by May 24, Hashdex by May 30, Grayscale by June 18 and Invesco by July 5.\n\nFidelity and BlackRock’s applications must be decided by Aug. 3 and Aug. 7.\n\nMagazine: Magazine: BlackRock meets with SEC over ETF, Binance’s new era begins and SBF loses release bid: Hodler’s Digest, Nov. 19–25"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vY29pbnBlZGlhLm9yZy9wcmljZS1hbmFseXNpcy9ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLTIwMjQtZXRoLXByaWNlLXBvaXNlZC10by1oaXQtdGhpcy1sZXZlbC1ieS15ZWFyLWVuZC_SAXdodHRwczovL2NvaW5wZWRpYS5vcmcvcHJpY2UtYW5hbHlzaXMvZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi0yMDI0LWV0aC1wcmljZS1wb2lzZWQtdG8taGl0LXRoaXMtbGV2ZWwtYnkteWVhci1lbmQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction 2024 : ETH Price Poised To Hit This Level by Year End - Coinpedia Fintech News",
        "content": "Zameer is a financial analyst and writer with a particular interest in cryptocurrency markets. He has been studying cryptocurrencies and their market behavior for several years and deeply understands the factors that affect the price of cryptocurrencies. His expertise lies in his ability to use both technical and fundamental analysis to make informed predictions about the future direction of cryptocurrency prices. He has a strong understanding of market sentiment and uses this to inform his trading decisions and price predictions.\n\nAfter the approval of a Bitcoin ETF, the Ethereum based tokens, surged to its highest point since May 2022. This increase is attributed to investor speculation that an Ether (ETH) ETF will soon receive approval from the SEC.\n\nThe Ethereum markets experienced substantial growth during Thursday’s session, driven by strong buying interest. This trend suggests that the broader cryptocurrency market might be on the verge of a more significant movement. ETH Price is expected to gain substantially from this momentum.\n\nEthereum Price Prediction 2024 :\n\nThe renowned cryptocurrency expert Anthony Sano has recently expressed an extremely bullish outlook on Ethereum Price Prediction for 2024. In a detailed analysis, he predicted Ethereum’s potential to reach a staggering $10,000 mark within the year.\n\nHe highlighted the significance of Ethereum’s ability to offer yield through staking, a feature he believes gives it an edge over Bitcoin and makes it particularly attractive to institutions. With the increasing likelihood of an Ethereum ETF launching in mid-2024, he anticipates a surge in institutional interest.\n\nComparing Ethereum’s performance with that of Solana, he pointed out that despite Solana’s significant drop and subsequent recovery, Ethereum has maintained a consistent value over the year.\n\noverall, his predictions for 2024 range from a conservative $6,000 to a staggering $10,000, if the market hype intensify, particularly with the advent of the ETF."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjQvMDEvMTEvZXRoZXItcHJpY2Utc3Bpa2VzLW9uLWhvcGUtb2YtZXRoLWV0Zi1idXQtd2lsbC10aGUtc2VjLWFwcHJvdmUtaXQuaHRtbNIBamh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDI0LzAxLzExL2V0aGVyLXByaWNlLXNwaWtlcy1vbi1ob3BlLW9mLWV0aC1ldGYtYnV0LXdpbGwtdGhlLXNlYy1hcHByb3ZlLWl0Lmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ether prices spike on hopes of an ETF — but the SEC signals that's less clear cut than bitcoin - CNBC",
        "content": "In this article BTC.CM=\n\nETH.BF= Follow your favorite stocks CREATE FREE ACCOUNT\n\nwatch now\n\nSt. Moritz, SWITZERLAND — U.S. Securities and Exchange Chair Gary Gensler fired warning shots to the crypto industry, casting doubt over whether digital coin ether would follow next in the footsteps of bitcoin to receive approval for an exchange-traded fund. After the bitcoin ETF approval, prices for ether — the token linked with Ethereum — spiked to their highest level since May 2022. That was because investors are betting on an ether — or ETH — ETF to be rubberstamped by the SEC next. The agency is due to give decisions on spot ETH ETF applications beginning in May. BlackRock, Invesco, Ark and VanEck are among the firms in line for approval, as well as Grayscale.\n\nThe SEC has long been an opponent of cryptocurrencies, and its bitcoin ETF approval in no way changed its stance in a big way. After the ETF decision, Gensler issued a statement in which he called bitcoin \"speculative\" and said it could be used for \"illicit\" purposes. One comment poured cold water over hopes of an ETH ETF. \"Importantly, today's Commission action is cabined to ETPs holding one non-security commodity, bitcoin. It should in no way signal the Commission's willingness to approve listing standards for crypto asset securities,\" Gensler said Wednesday after the SEC decision on the ETFs.\n\nCrypto as commodities or securities?\n\nA long-running debate in the U.S. is over whether cryptocurrencies are classified as securities or as commodities. Key to Gensler's comments was his reference that bitcoin's status as a \"non-security commodity\" was one of the reasons why the SEC was comfortable approving the ETF. Gensler made clear that \"the vast majority of crypto assets are investment contracts and thus subject to the federal securities laws,\" in the SEC's view. This complicates matters for an ETH ETF. \"One distinction which I think people have to look at which is that bitcoin clearly has been bucketed as a commodity, Ethereum, there's still some question. Is it a security? Is it a commodity? And I think until that's resolved, it cannot be look at exactly like the bitcoin product, in terms of how do you structure and ETF around it,\" Bill Tai, chairperson of Aktai, told CNBC in an interview at the Crypto Finance Conference in St. Moritz. Tai said that approving an ETH ETF is \"not as clear cut\" as was the case of bitcoin. \"I do think that it's not out of the range of possibility, but there are additional factors to consider around that one because of its classification,\" Tai said. Securities and commodities are regulated under different laws and by different agencies.\n\nWill an ETH ETF happen this year?\n\nCommentators are split on when an ETH ETF may come to the market. Some, like Antoni Trenchev, co-founder of cryptocurrency exchange Nexo, think it will happen this year. \"I'd watch what the SEC does and not what it says, because it wasn't long ago that the prospect of a spot Bitcoin ETF seemed like a distant dream. Things move very fast in crypto and investors are front-running what they believe to be the next big spot ETF approval,\" Trenchev told CNBC by email. \"You'd have to say now that bitcoin has knocked down the door it's only a matter of when not if others will follow — most likely in 2024 — and ETH is definitely the leader of the pack.\" Christopher Giancarlo, co-founder of the digital dollar project and former chair of the U.S. Commodity Futures Trading Commission, oversaw the introduction of bitcoin futures in 2017. He said that, in his experience at the regulator, the approval of one product opens the doors for others. \"Once we greenlighted bitcoin futures, there as a tremendous movement in the CFTC jurisdiction area for greenlighting ethereum futures and that did come 18 months later,\" Giancarlo told CNBC on Thursday. He added that he would be \"shocked\" if there weren't growing demand for an ether ETF. \"The SEC's going to have deal with the growing demand for that product,\" Giancarlo added. Others are a little more skeptical that the SEC could approve an ETH ETF in the short term.\n\nwatch now"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1zLWNoYW5naW5nLW5hcnJhdGl2ZS1zcG90LWV0Zi1hbmQtYWx0Y29pbi1iZXRhLWh5cGUtYmFjay1ldGgtcmFsbHnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum's changing narrative, spot ETF and altcoin beta hype back ETH rally - Cointelegraph",
        "content": "Ether (ETH) price broke the resistance at $2,400 for the first time since May 2022, as traders turned their attention to the possibility of an Ethereum exchange-traded fund (ETF) coming after a spot Bitcoin ETF is approved.\n\nEther price rose sharply from the opening price of $2,343 on Jan. 10, soaring more than 7.8% in the last 24 hours and 85% over the last 12 months to reach a year-to-date high of $2,444.\n\nETH was the only non-stablecoin coin among the top 10 cryptocurrencies by market capitalization that traded with a bullish bias in the minutes after the SEC’s incorrect tweet on spot BTC ETF approvals contributed to significant price volatility in Bitcoin (BTC) price.\n\nTop 10 cryptocurrencies. Source: CoinMarketCap\n\nThe last time Ether traded above $2,400 was on May 3, 2022, when it reached a high of $2,529 before dropping to lows below $1,000 on July 18, 2022, following the implosion of the Terra ecosystem.\n\nTokens of layer 2 networks such as Mantle’s MNT and Optimism’s (OP) gained as much as 9% and 15% respectively. These networks are built atop the Ethereum network but operate as independent blockchains, allowing users to transact cheaply and much faster than the base blockchain.\n\nCrypto analysts on X suggest market participants are getting ready for a spot Ethereum ETF approval, giving professional investors in the U.S. indirect exposure to ETH.\n\n“Currently, the momentum is skewed surrounding Bitcoin and the ETF approval, but Ethereum might also get a Spot ETF”, CEO and Founder MN Trading Michaël van de Poppe said in a post on X.\n\nData from Coinglass shows short-position liquidations for Ethereum reaching $31.7 million over the last 24 hours, with the tally still increasing at the time of writing.\n\nEthereum liquidations chart Jan. 10. Source: Coinglass\n\nMeanwhile, the SEC is expected to make its decision on all spot Bitcoin ETF applications onJan. 10.\n\nMarket participants are confident that the approval will happen imminently, especially after r the Cboe gave notice of approved securities listings from several asset managers on Jan. 10.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2V0aGVyZXVtLXRha2VzLXRoZS1sZWFkLW92ZXItYml0Y29pbi1pbi1kZXJpdmF0aXZlcy10cmFkaW5nLXZvbHVtZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum takes the lead over Bitcoin in derivatives trading volume - CryptoSlate",
        "content": "What is CryptoSlate Alpha? A web3 membership designed to empower you with cutting-edge insights and knowledge, powered by Access Protocol. Learn more ›\n\nConnected to Alpha Welcome! 👋 You are connected to CryptoSlate Alpha. To manage your wallet connection, click the button below.\n\nImportant: You must lock a minimum of 20,000 ACS If you don't have enough, buy ACS on the following exchanges: Coinbase Kucoin Orca\n\nConnect via Access Protocol Access Protocol is a web3 monetization paywall. When users stake ACS, they can access paywalled content. Learn more ›\n\nDisclaimer: By choosing to lock your ACS tokens with CryptoSlate, you accept and recognize that you will be bound by the terms and conditions of your third-party digital wallet provider, as well as any applicable terms and conditions of the Access Foundation. CryptoSlate shall have no responsibility or liability with regard to the provision, access, use, locking, security, integrity, value, or legal status of your ACS Tokens or your digital wallet, including any losses associated with your ACS tokens. It is solely your responsibility to assume the risks associated with locking your ACS tokens with CryptoSlate. For more information, visit our terms page."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZGVjcnlwdC5jby8yMTI0MzAvZXRoZXJldW0tZXRmLWhvcGVzLXB1c2gtZXRoLXVwLTgtdG8tb3Zlci0yNjAw0gFNaHR0cHM6Ly9kZWNyeXB0LmNvLzIxMjQzMC9ldGhlcmV1bS1ldGYtaG9wZXMtcHVzaC1ldGgtdXAtOC10by1vdmVyLTI2MDA_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum ETF Hopes Push ETH Up 8% to Over $2,600 - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nFollowing Wednesday's landmark approval of multiple spot Bitcoin ETFs, hopes that a spot Ethereum ETF could be next to market have propelled ETH to levels not seen since May 2022.\n\nEthereum is currently up 8.7%, trading at just over $2,620, per data from CoinGecko.\n\nBitcoin itself is trading relatively flat, up 2% over the past day. The SEC's approval of a spot Bitcoin ETF Wednesday followed days of confusion, including a fake tweet posted by the \"compromised\" SEC Twitter account on Tuesday.\n\nAD\n\nAD\n\nSeveral hopefuls have filed applications for a spot Ethereum ETF with the U.S. Securities and Exchange Commission (SEC), including Ark 21Shares, BlackRock, Fidelity and Grayscale.\n\nThe SEC's approval of a spot Bitcoin ETF was a long time coming, but traders are betting that an Ethereum ETF might be quicker to market.\n\nBloomberg Intelligence's ETF analyst Eric Balchunas reportedly pointed to a 70% chance of an Ethereum ETF being approved by May, the SEC's final deadline for a decision on multiple spot Ethereum ETF applications. Balchunas noted that he had heard “on the back channels” that spot Ethereum ETFs “will be fine.”\n\nSEC chair Gary Gensler has repeatedly refused to confirm whether the regulator considers Ethereum a security or a commodity.\n\nPrior to taking up his post at the SEC, Gensler himself stated that the regulator considered Ethereum \"sufficiently decentralized\" that it doesn't qualify as a security. At the time, Gensler appeared to be referencing the views of SEC's former Director of Corporate Finance William Hinman, expressed in a much-cited June 2018 speech.\n\nAD\n\nAD"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS9ldGhlcmV1bS1ldGgtcHJpY2UtdGFyZ2V0cy0zMDAwLXZpdGFsaWstYnV0ZXJpbi1nYXMtcmV2aWV3LTE0MDE2ODPSAV5odHRwczovL2FtcC5meGVtcGlyZS5jb20vZW4vZXRoZXJldW0tZXRoLXByaWNlLXRhcmdldHMtMzAwMC12aXRhbGlrLWJ1dGVyaW4tZ2FzLXJldmlldy8xNDAxNjgz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Price targets $3,000 as Vitalik Buterin Calls for Gas Fee Review - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy94cnAtZXRmLW5leHQtcmlwcGxlLWV0aGVyZXVtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "XRP ETF Next? Analysts See Possibility for Ripple After Ethereum - CCN.com",
        "content": "Key Takeaways\n\nFollowing the SEC’s approval of spot Bitcoin ETFs, it looks more likely that the regulator will allow spot Ether funds too.\n\nAfter that, asset managers could turn their attention to altcoins like XRP.\n\nHowever, the regulator is unlikely to allow XRP ETFs while it is battling Ripple in court.\n\nNow that the Securities and Exchange Commission (SEC) has finally ended its longstanding resistance to spot Bitcoin Exchange Traded Funds (ETFs), it raises the prospect that it might accept other types of crypto funds too.\n\nSeveral of the asset managers recently granted permission to launch Bitcoin ETFs have already submitted proposals for spot Ether funds. But why stop there? After Ethereum, XRP could emerge as the next crypto ETF frontier.\n\nVanEck CEO Eyes Ripple ETF\n\nIn a recent interview, Valkyrie CIO Steve McClurg suggested that asset managers are eager to branch out into other cryptocurrencies after the approval of Bitcoin ETFs.\n\nWithout digressing what VanEck planned to do next, he said: “I think we’re going to see a lot of filings come out for Ethereum. I even think we might see something for Ripple, given the recent progress.”\n\nEchoing McClurg’s comments, Bloomberg analyst James Seyffart also believes that XRP is the next most likely ETF prospect after Bitcoin and Ether. However, he acknowledged that Ripple’s ongoing legal troubles will probably hold up progress.\n\nXRP Funds Unlikely Until Ripple Lawsuit Concluded\n\nObserving that Ethereum ETFs could be approved in the coming months, Seyffart suggested that the SEC would be unlikely to accept XRP funds while it is in the middle of a court battle with Ripple. “I don’t think that’s happening this year unless the court case is completely done,” he said.\n\nWhat’s more, whereas spot Bitcoin and Ether ETFs were preceded by funds that invest in crypto futures, there is no equivalent precedent for XRP. Observing that the existence of Bitcoin and Ether futures ETFs strengthens the argument for letting funds hold the cryptocurrencies directly, Seyffart noted that “we don’t have any of that for Ripple.”"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbnBlZGlhLm9yZy9wcmljZS1hbmFseXNpcy9ldGhlcmV1bS1wcmljZS1yYWxseS1ldGgtcHJpY2UtcG9pc2VkLXRvLWhpdC0yODAwLWJ5LXdlZWtlbmQv0gFmaHR0cHM6Ly9jb2lucGVkaWEub3JnL3ByaWNlLWFuYWx5c2lzL2V0aGVyZXVtLXByaWNlLXJhbGx5LWV0aC1wcmljZS1wb2lzZWQtdG8taGl0LTI4MDAtYnktd2Vla2VuZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Rally : ETH Price Poised To Hit $2800 By Weekend - Coinpedia Fintech News",
        "content": "Zameer is a financial analyst and writer with a particular interest in cryptocurrency markets. He has been studying cryptocurrencies and their market behavior for several years and deeply understands the factors that affect the price of cryptocurrencies. His expertise lies in his ability to use both technical and fundamental analysis to make informed predictions about the future direction of cryptocurrency prices. He has a strong understanding of market sentiment and uses this to inform his trading decisions and price predictions.\n\nOn January 10, 2024, the SEC approved all Bitcoin Spot ETFs. The first regulated spot, Bitcoin Exchange-traded-funds (ETF), was approved by the SEC a few hours after its fake release, causing $300 Million in Bitcoin liquidation within a few hours.\n\nETF Approval, Opens ETH Gateways to $2800!\n\nOn top of this huge development, Ethereum (ETH) is currently exhibiting notable strength, surpassing Bitcoin’s performance with an 8% surge, driven by the mounting anticipation surrounding the potential approval of spot Bitcoin Exchange Traded Funds (ETFs).\n\nNow that the outcome of Bitcoin ETF approvals is out, there is a growing expectation from analysts that Ethereum might experience a similar trend. Numerous institutions have already submitted applications for spot Ethereum ETFs, contributing to a supply shock as funds pour into the Ethereum market in anticipation of a potential ETF launch.\n\nETH’s price action shows a bullish flag pattern due to consolidation between $2200 support and $2400 resistance. Buyer enthusiasm rises as Ethereum breaks out, suggesting a bullish 2024.\n\nSo, what’s the deal? Is this correction a dip you should buy? Will Ethereum go up?\n\nTechnical, On-Chain Metrics Say’s Possible but with a Twist…\n\nTechnically, Ethereum’s price is navigating within an ascending parallel channel, indicating a bullish stance and the possibility of reclaiming the $2,457 range high. This upward momentum could propel ETH towards the $2,800 level, marking a substantial 15% increase from its current levels. In an exceptionally bullish scenario, Ethereum might even reach the $3000, indicating a 25% surge.\n\nSupporting this optimistic outlook are various on-chain metrics. Santiment’s daily active addresses metric reveals a consistent increase in crowd interaction with Ethereum, reflected in the rise of daily active addresses from 387,000 to 413,000 in under a month—a 6.7% growth. Additionally, whale transactions involving transfers of $100,000 and above have experienced a notable uptick, underlining heightened investor interest.\n\nHowever, it’s crucial to acknowledge the potential for correction, especially if bears take control. A downside correction could lead to ETH losing support at $2,388. In a more adverse scenario, a prolonged decline might push the proof-of-stake (PoS) token down to $2,135, signaling a potential shift in the prevailing bullish sentiment if a lower low is established. Overall, Ethereum’s current dynamics are intricately tied to the broader market sentiment and developments surrounding Bitcoin ETF approvals."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9oYXBwZW5lZC1jcnlwdG8tdG9kYXktZXRoZXJldW0tZXRmcy0xMjAwMDA5MTMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "What Happened in Crypto Today: Ethereum ETFs To Be Approved by May? - Yahoo Finance",
        "content": "What Happened in Crypto Today: Ethereum ETFs To Be Approved by May?\n\nAfter days of volatility and months of uncertainty, the SEC finally approved the first Bitcoin spot ETF. And as K33 Research expected, this long-awaited move did not become a \"sell the news\" event, as much of the leverage had already been shaken out last week.\n\nNow that this regulatory barrier has come down, we look ahead to what other opportunities may open up in crypto. But before we gaze too far into the horizon, let's recap today’s top crypto news stories.\n\nTLDR:\n\nSEC approves first-ever spot Bitcoin ETFs in the U.S. 🇺🇸\n\nFund issuers engage in battle royale for BTC ETF market share, slashing fees 🗡️\n\nGensler offers warnings despite approving BTC ETFs 🚨\n\nUK central banker criticizes BTC's value and efficiency 😐\n\nEthereum ETF approval odds look good for May 🤞\n\nRipple announces $785M stock buyback plan 💰\n\nNow let's dive deeper into each of those topics…\n\nBTC Spot ETF Approved fr! 🇺🇸\n\nFirst, the most important news…\n\nIt finally happened - the SEC approved not just one, but ELEVEN spot Bitcoin ETFs!\n\nThis mass greenlighting came on the expected deadline after months of bottled-up anticipation.\n\nFinancial giants like BlackRock, ARK Invest, Invesco and more now have the all-clear for their BTC funds. Even Grayscale's Bitcoin Trust secured conversion authority!\n\nOf course, Gary Gensler couldn't resist throwing some shade amidst his agency's watershed Bitcoin moment. Despite the reversal, he shilled the same old \"illicit activity\" 🙄(we will cover this one in detail).\n\nETF approval unlocks billions (or maybe trillions) in fresh institutional capital and mainstream accessibility.\n\nSo is it going to impact BTC’s price eventually? Read the full story!\n\nThe Hunger Games (ETF Edition) 🗡\n\nAnd the battle royale begins! After the SEC finally (and reluctantly) approved Bitcoin spot ETFs, fund issuers drew swords to compete over market share.\n\nAnd their chosen weapon? Significant fee cuts to attract capital inflows!\n\nStory continues\n\nBlackRock led the charge - dropping its ratio to 0.25% after originally demanding a 0.3% fee.\n\nNot to be outdone - ARK Invest, 21Shares, Bitwise and Valkyrie matched with reductions down to 0.2% or lower.\n\nOf course, one player remains the elephant in the room - Grayscale still demands 1.5% with its $28 billion GBTC AUM.\n\nWhat does this fee war indicate? Is it going to help crypto in any way? Read the full story!\n\nGensler’s Warnings Continue 🚨\n\nThe chief regulator couldn't resist throwing some shade on the assets underlying these new funds. Gensler emphasized the SEC does NOT endorse Bitcoin itself following approvals. He gave the same old narratives of volatility risks and usage for nefarious exploits. 🙄\n\nGens even dragged precious metals like gold and silver to emphasize BTC's inferior industrial utility.\n\nCheck out his entire statement!\n\nAnd while we are at it…\n\nUK Central Banker Criticizes Bitcoin Again 😐\n\nBank of England Governor Andrew Bailey also showed his skepticism about Bitcoin this week.\n\nDuring recent UK Parliament hearings, Bailey dragged Bitcoin as an \"inefficient\" payments innovator while doubting its intrinsic value.\n\nEchoing her boss' skepticism, Deputy Governor Breeden also spotlighted crypto's lack of regulatory guardrails as hindering mainstream adoption. But she did acknowledge the landscape is slowly evolving.\n\nThe banking bureaucrats also fretted about stablecoins and their “opaque” inner workings. Concerns we've heard ad nauseam at this point.\n\nRead the full story!\n\nEthereum ETF Approval 🤞\n\nAnd something we are looking forward to…\n\nWith Bitcoin's ETF floodgates busting wide open, the expectation now pivots to the impending ETH spot fund verdict!\n\nAnd Bloomberg's Eric Balchunas puts the odds of approval by May at 70%. That's when the SEC deadline hits for multiple Ethereum trust applications.\n\nHe previously said he can't imagine a scenario where BTC gets the green light but not Ethereum. After all - the ETH spot is \"tied to the hip of the Bitcoin spot.\"\n\nSo with OG coin's decade-long issue finally rectified, hopes run high for Ether's emancipation soon after!\n\nEthereum itself felt the warmth of positive sentiment this week. ETH pumped 15% in the last 7 days - piercing above $2.5K resistance as fund approval odds boost bull morale!\n\nIs Ethereum going to enjoy the same price ride as Bitcoin did? Read the full story!\n\nRipple’s Buyback Announcement 💰\n\nRipple Labs plans to use $285 million to buy back shares from early investors at a $11 billion valuation.\n\nThis liquidity largesse offers investors a chance to offload up to 6% of their holdings. Ripple also pledged an additional $500 million to grease the wheels on payroll tax and RSU conversions.\n\nRather than rushing to IPO, the firm reaffirmed its commitment to supporting native token growth and pursuing regulatory clarity abroad first.\n\nHow is it going to impact XRP? Read the full story!\n\nAnd that wraps up the key crypto news for today. May your trades be fruitful and your diamond hands stay strong forever! 💎🙌\n\nBefore you head out, take a sec to sign up for our newsletter below, and we'll deliver the hottest crypto stories straight to your inbox!\n\nSubscribe to Our Newsletter!"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vYmxvY2tvbm9taS5jb20vYWZ0ZXItdGhlLWJpdGNvaW4tZXRmLWZha2VvdXQtZXRoZXJldW0tZXRoLXByaWNlLXNvYXJzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "After the Bitcoin ETF Fakeout: Ethereum ETH Price Soars - Blockonomi",
        "content": "Ether (ETH) rallied past the key $2,400 level this week as traders speculated on the approval of a potential Ethereum exchange-traded fund (ETF). The second-largest cryptocurrency by market capitalization gained over 5% in 24 hours to hit its highest level since last September.\n\nKeypoints\n\nEther price surged past $2,400 as traders bet on a potential Ether ETF following Bitcoin ETF approvals.\n\nBlackRock previously filed for an Ethereum Trust ETF which added to speculation of an Ether product.\n\nTokens like LDO, RPL, MNT, and OP also rallied as they are connected to Ethereum and could benefit from an ETF.\n\nAnalysts say Ether looks positioned for a breakout with a bullish chart pattern targeting $3,500 if resistance around $2,320-$2,382 is broken.\n\nDespite market chaos from fake Bitcoin ETF tweets, Ether price still managed to surge due to strong fundamentals and on-chain data.\n\nDriving the bullish sentiment was previous news that BlackRock, the world’s largest asset manager, had filed paperwork with the U.S. Securities and Exchange Commission (SEC) for an Ethereum Trust ETF. The proposed “iShares Ethereum Trust” would allow mainstream investors easy exposure to spot Ether prices.\n\nWhile Bitcoin ETF approvals are widely expected this year, the BlackRock filing added credibility to hopes for an Ether product as well. This is significant because an SEC-approved crypto ETF would bring in fresh institutional capital from pension funds, endowments, and traditional finance players.\n\nAlong with Ether, native tokens of Ethereum-based protocols also benefited from the ETF speculation. For example, staking tokens Rocket Pool (RPL) and Lido DAO (LDO) notched double-digit percentage gains. As staking rewards are a prime feature of Ethereum’s shift to proof-of-stake consensus, an influx of new demand from an ETF could be a boon for staking platforms.\n\nOn the technical analysis front, Ether’s bullish chart signals also reinforced the positive fundamentals. According to analyst World of Charts, ETH appears to be consolidating in a “bullish pennant” pattern that has an ultimate target of around $3,500. To confirm this breakout, traders first want to see resistance levels at $2,320–$2,382 convincingly taken out.\n\nThe promising on-chain data also buoyed market confidence in Ether’s uptrend. Blockchain intelligence firm Santiment reported that the number of large “whale” transactions on Ethereum rocketed higher in the past day. This suggests that deep-pocketed investors still have an appetite to accumulate more ETH at these levels.\n\nRemarkably, Ether managed to post gains despite the wider crypto market reeling from fake news of a Bitcoin ETF approval. A series of forged tweets from a hacked SEC account initially sent Bitcoin spiking before a swift plunge once the ruse was uncovered. Still, Ethereum proved resilient with its strong fundamentals and held onto daily gains of nearly 4%.\n\nWith ETF excitement building, technicals flashing bullish signals, and whales continuing to stockpile, analysts broadly agree further upside appears in store for Ether. The next key resistance level to watch is the psychological $2,500 mark, which opens the door to test $3,000 and beyond. As long as crypto adoption trends remain intact, Ethereum looks poised to continue outpacing the broader digital asset market."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vYmxvY2tjaGFpbi5uZXdzL25ld3MvdXMtbGF3bWFrZXItbWlrZS1jb2xsaW5zLTY1ay1ldGhlcmV1bS1pbnZlc3RtZW50cy1uYXZpZ2F0aW5nLWV0aGljcy1hbmQtbWFya2V0LWR5bmFtaWNz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "US Lawmaker Mike Collins' $65K Ethereum Investments: Navigating Ethics and Market Dynamics - Blockchain.News",
        "content": "Rep. Mike Collins discloses purchasing up to $65,000 in Ethereum in early 2024, amid market surges and political events. His actions, while legal under the STOCK Act, raise questions about ethical implications and the need for stricter regulations in lawmakers' digital asset investments.\n\nUS Georgia Representative Mike Collins disclosed investments totaling up to $65,000 in Ethereum (ETH) in early 2024. This disclosure, filed on January 9 with the House’s Financial Disclosure Reports Database, includes purchases of $15,000 on January 3 and $50,000 on January 8, adding to his total ETH investments of approximately $110,000 since 2023​​​​​​.\n\nCollins' engagement with Ethereum, a leading cryptocurrency, aligns with his ongoing investments in digital assets. The STOCK Act, a regulatory framework designed to prevent conflicts of interest, mandates such disclosures by US lawmakers. However, it does not prohibit them from overseeing legislation potentially related to their investments, which has been a point of contention and debate regarding the intersection of personal wealth and public service responsibilities​​​​.\n\nThe timing of Collins’ investments coincides with a notable surge in Ethereum's price, which experienced an 11% increase in early January 2024. This market behavior is partly attributed to anticipations surrounding the SEC's potential approval of a spot Bitcoin ETF, a development that could have broader implications for the cryptocurrency market​​.\n\nThese financial activities occur against a backdrop of significant political events, including the looming possibility of a US government shutdown and the commencement of the 2024 presidential campaign. The intersection of these political dynamics with market movements underscores the complex relationship between governmental actions and financial markets, particularly in the realm of cryptocurrencies​​.\n\nThis development also highlights the broader trend of lawmakers engaging in cryptocurrency investments, reflecting the growing integration of digital assets into mainstream financial practices. However, it raises questions about the need for more stringent regulatory frameworks to ensure transparency and prevent potential conflicts of interest. The ongoing debates in this arena suggest a growing recognition of the unique challenges posed by the intersection of digital assets and political governance.\n\nImage source: Shutterstock"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9hcmJpdHJ1bS1kb21pbmF0ZXMtd2l0aC1uZWFybHktNTAtb2YtZXRoZXJldW0tbGF5ZXItMi10b3RhbC12YWx1ZS1sb2NrZWQuaHRt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Arbitrum Dominates with Nearly 50% of Ethereum Layer 2 Total Value Locked - Cryptonews",
        "content": "Arbitrum Dominates with Nearly 50% of Ethereum Layer 2 Total Value Locked\n\nThe Ethereum-based layer 2 network Arbitrum has shown significant strength in the market, with its native token, ARB, outperforming a number of other smart contract tokens over the past 30 days.\n\nAccording to data from CoinMarketCap, ARB has now risen some 75% during the 30-day period, outperforming the likes of Optimism’s OP token, Solana’s SOL, and BNB.\n\nOne key factor contributing to Arbitrum’s strength is its dominance in terms of total value locked (TVL) among layer 2 networks built on top of Ethereum.\n\nAccording to data from decentralized finance L2Beat, Arbitrum now has a market share of 49.17% among layer 2 networks, far surpassing number two on the list, Optimism Mainnet, with its 28.85% market share.\n\nThe network has also seen a consistent increase in its TVL at least since October last year, rising about 50% from $1.66 billion in October to the current value of $2.51 billion, data from DeFi tracking site DefiLlama showed.\n\nThe upcoming Ethereum Dencun upgrade, incorporating changes proposed by EIP-4844, is expected to reduce rollup transaction costs, benefiting layer 2 solutions like Arbitrum by lowering gas fees and improving network capacity.\n\nBullish chart pattern for Arbitrum\n\n\n\nDespite a recent pullback after reaching an all-time high of $2.11 on January 4, ARB’s daily chart reveals a potential bull flag formation.\n\nThe bull flag is generally seen as a continuation pattern, with price expected to resume its previous bullish trend once it breaks out of the pattern.\n\nAt the time of writing on Wednesday, ARB traded at $1.95, up an impressive 11.7% for the past 24 hours and up 3% for the past 7 days."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vdG9rZW5wb3N0LmNvbS9GYWtlLUFpcmRyb3AtZm9yLUV0aGVyZXVtLVNvbGFuYS1Ucm9uLVVzZXJzLUNhcnJpZWQtb3V0LWJ5LVNjYW1tZXJzLTExMDQ50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Fake Airdrop for Ethereum, Solana, Tron Users Carried out by Scammers - TOKENPOST",
        "content": "Fake Airdrop for Ethereum, Solana, Tron Users Carried out by Scammers\n\nHackers target the Ethereum, Solana, and Tron crypto communities by enticing them with a fake airdrop scheme.\n\nWallet drainers, previously fixated on executing crypto scams via EVM chains, have now expanded their horizons to target Ethereum (ETH), Solana (SOL), and Tron (TRX) communities.\n\nThis shift marks a concerning trend as these scammers venture into well-established crypto groups.\n\nPhishing Scams via Fake Airdrops\n\nThe modus operandi involves enticing crypto enthusiasts through fraudulent airdrops. The scammers create a webpage where users can supposedly claim Ethereum, Solana, and Tron airdrop rewards.\n\nThese scams are labeled an \"exclusive opportunity\" for the community, urging individuals to link their primary wallets for access. Scam Sniffer highlights that these fraudsters can drain various crypto wallets using this deceptive webpage.\n\nAccording to CoinGape, this development is particularly problematic given the popularity of Ethereum, the second-largest cryptocurrency, alongside Solana and Tron.\n\nThe lure of substantial crypto rewards might mislead investors, potentially resulting in significant losses amounting to millions or even billions in digital assets due to these wallet drainer scams.\n\nIdentifying and Avoiding Crypto Scams\n\nWhile scammers occasionally upgrade their strategies, identifying potential scams can still be achieved through simple checks.\n\nAccording to Blockworks, Scam Sniffer's shared snapshot reveals grammatical errors on the fraudulent airdrop webpage, serving as a red flag for cautious users. However, it's crucial to remain vigilant as scammers adapt and refine their tactics over time.\n\nTo stay secure, always verify the source of such links. If a reputable entity is not the source of the airdrop updates, it is advisable to steer clear of such offerings.\n\nFurthermore, heightened caution is necessary, considering recent incidents where hackers compromised verified X accounts of well-known companies like Certik and Mandiant to promote crypto scams.\n\nEarlier this month, Certik experienced a similar attack on its X account, followed by Mandiant on January 4, 2024, raising concerns about the security of even the most established platforms.\n\nPhoto: Nahel Abdul Hadi / Unsplash\n\nTokenPost | [email protected]"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3QvYmxvb21iZXJnLWFuYWx5c3QtcHJlZGljdHMtNzAtY2hhbmNlLW9mLXNwb3QtZXRoZXJldW0tZXRmLWFwcHJvdmFsLWJ5LW1hedIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Bloomberg Analyst Predicts 70% Chance of Spot Ethereum ETF Approval by May - BSC NEWS",
        "content": "Disclaimer: Overall it is vital to proceed with caution when purchasing tokens that have just been listed. For those who have not already read our articles on safety in the BSC it is crucial to reference the following items,\n\n\n\nThis is a paid press release, BSC.News does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. The project team has purchased this advertisement article for $1500. Readers should do their own research before taking any actions related to the company. BSC.News is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned in the press release. : Overall it is vital to proceed with caution when purchasing tokens that have just been listed. For those who have not already read our articles on safety in the BSC it is crucial to reference the following items, HERE and HERE This is a paid press release, BSC.News does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. The project team has purchased this advertisement article for $1500. Readers should do their own research before taking any actions related to the company. BSC.News is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned in the press release.\n\nDisclaimer: The content in the above article is a press release, provided by a third party. Readers should do their own research before interacting or engaging with the mentioned companies and/or any related services. BSC News is neither directly nor indirectly responsible for any damage or loss caused or alleged to be caused by or in connection with the use of any content, goods or services mentioned in the above article.\n\nDisclaimer: Overall it is vital to proceed with caution when purchasing tokens that have just been listed. For those who have not already read our articles on safety in the BSC it is crucial to reference the following items,\n\n\n\nThis is a paid press release, BSC.News does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. The project team has purchased this advertisement article for $2500. Readers should do their own research before taking any actions related to the company. BSC.News is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned in the press release. : Overall it is vital to proceed with caution when purchasing tokens that have just been listed. For those who have not already read our articles on safety in the BSC it is crucial to reference the following items, HERE and HERE This is a paid press release, BSC.News does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. The project team has purchased this advertisement article for $2500. Readers should do their own research before taking any actions related to the company. BSC.News is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned in the press release.\n\nDisclaimer: This is a paid Ask Me Anything (AMA), BSC.News does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. The project team has purchased this advertisement AMA for $2000 Readers should do their own research before taking any actions related to the company. BSC.News is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned in the AMA.\n\nDisclaimer: This article is exclusive BSC News Premium Content. Premium content is viewable without a membership for a limited time. After the limited time period expires, readers will need to either subscribe or hold a BSC News NFT to view Premium Content. Visit the BSC News NFT website, Discord, and Twitter to learn more about becoming a Premium member.\n\nDisclaimer: The content of this piece is the opinion of the writer. Nothing in this article is intended to constitute financial advice. The content of this article is intended for entertainment and educational purposes only. Investing in cryptocurrency carries a high degree of risk. Capital is at risk, and returns are never guaranteed. You should always do your own research.\n\nDisclaimer: Disclaimer: This article is written by a visiting author. Opinions herein are those of the visiting author. Nothing in this article is intended to constitute financial advice. The content of this article is intended for entertainment and educational purposes only. Investing in cryptocurrency carries a high degree of risk. Capital is at risk, and returns are never guaranteed. You should always do your own research."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL2NvaW5wZWRpYS5vcmcvcHJpY2UtYW5hbHlzaXMvZXRoZXJldW0tcHJpY2UtbWlnaHQtc3VyZ2UtNTAtaW4tamFudWFyeS0yMDI0LWhlcmVzLXRoZS1tYWpvci1kcml2aW5nLWZhY3Rvci1mb3ItZXRoLXByaWNlL9IBhAFodHRwczovL2NvaW5wZWRpYS5vcmcvcHJpY2UtYW5hbHlzaXMvZXRoZXJldW0tcHJpY2UtbWlnaHQtc3VyZ2UtNTAtaW4tamFudWFyeS0yMDI0LWhlcmVzLXRoZS1tYWpvci1kcml2aW5nLWZhY3Rvci1mb3ItZXRoLXByaWNlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Might Surge 50% in January 2024 : Here’s The Major Driving Factor For ETH Price - Coinpedia Fintech News",
        "content": "Qadir Ak is the founder of Coinpedia. He has over a decade of experience writing about technology and has been covering the blockchain and cryptocurrency space since 2010. He has also interviewed a few prominent experts within the cryptocurrency space.\n\nWith Bitcoin ETFs finally approved, and the call for spot ETH ETFs rising, Ethereum is now standing at the threshold of a potential surge, with pivotal developments setting the stage for a remarkable bull in January. The imminent activation of the Dencun upgrade, known as the protodanksharding upgrade or EIP-4844, on the Goerli testnet on January 17 is poised to be a game-changer.\n\nEIP-4844: Unleashing Efficiency\n\nThe Dencun upgrade, specifically EIP-4844, aims to cut Layer 2 transaction fees on Ethereum by introducing “data blobs” – sizable data pieces linked to Ethereum blocks and rollups. This innovation enhances efficiency and lowers transaction costs within the Layer 2 scaling solution.\n\nBy implementing EIP-4844, Ethereum looks forward to freeing up Ethereum’s processing capacity, streamlining operations, and enabling rollups to handle transactions at a much lower cost.\n\nThe Expected Bullish Storm\n\nEthereum is on a positive trajectory, surging to $2,500 after the SEC approved the Spot Bitcoin ETF. Keeping steady above key levels like the 50-day and 200-day Exponential Moving Averages at $2,231 and $1,959, analysts now set their sights on a promising target: the 78.6% Fibonacci retracement level at $3,004.\n\nAs Ethereum gears up with the Dencun upgrade, the optimistic market sentiment following the approval of the Spot Bitcoin ETF has made investors eagerly wait for a potential 50% surge within reach in January."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vY29pbmdhcGUuY29tL2V0Yy1wcmljZS1qdW1wcy0zNC1hcy1ldGhlcmV1bS1jbGFzc2ljLXRyYWRpbmctdm9sdW1lcy1zdXJnZS_SAVZodHRwczovL2NvaW5nYXBlLmNvbS9ldGMtcHJpY2UtanVtcHMtMzQtYXMtZXRoZXJldW0tY2xhc3NpYy10cmFkaW5nLXZvbHVtZXMtc3VyZ2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "ETC Price Jumps 34% As Ethereum Classic Trading Volumes Surge - CoinGape",
        "content": "In the weekly chart analysis, Ethereum Classic (ETC) has shown a departure from the lower high formation that characterized the previous bearish trend until 2022. After a year-long consolidation range throughout 2023, ETC struggled to surpass the resistance at $23.\n\nA recent resurgence, however, has resulted in a bullish breakout from the consolidation range, signaling a notable trend reversal for Ethereum Classic. This breakout is seen as a significant entry point for traders on the sidelines.\n\nThe heightened market activity has contributed to a remarkable 250% increase in the 24-hour trading volume, supporting the sharp upward movement and hinting at the potential continuation of an uptrend. Currently trading at $28.43, Ethereum Classic has formed a bullish engulfing candle in the daily chart.\n\nThe breakthrough above the $25 barrier positions Ethereum Classic for a sustained bullish rally. The rising sentiment in the market is fostering increased risk appetite among investors, contributing to the broader uptrend in the altcoin market.\n\nUnder favorable market conditions, Ethereum Classic’s price trajectory may lead to a breakout beyond multiple resistance levels, with a potential target of $40 on the horizon. However, should ETC struggle to maintain its momentum, a retest of the $25 level could be in the cards. Traders and investors are closely monitoring market dynamics to gauge the sustainability of Ethereum Classic’s current bullish momentum."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vY3J5cHRvLm5ld3MvZXRoZXJldW0tdXAtOS1hZnRlci1zcG90LWJpdGNvaW4tZXRmLWFwcHJvdmFsL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum up 9% after spot Bitcoin ETF approval - crypto.news",
        "content": "Ethereum (ETH) is up 9%, outpacing Bitcoin despite the U.S. Securities and Exchange Commission (SEC) approving spot Bitcoin ETFs.\n\nWhat’s next for Ethereum?\n\nEthereum break past $2,600\n\nWith the SEC approving 11 spot Bitcoin ETFs, the market promptly shifted its focus to Ethereum.\n\nIn November 2023, BlackRock and Fidelity filed applications for spot Ethereum ETFs. If history is an indication of the future, then these ETFs could very likely be passed.\n\nYou might also like: Ethereum price to cross $3k after Bitcoin ETF approval?\n\nSenior ETF analyst at Bloomberg Eric Balchunas noted in June that BlackRock had previously applied for 576 ETFs and won 575 of them.\n\nWith such a robust track record, traders understand the significance of its spot Ethereum ETF application.\n\nFor now, the recent spot Bitcoin ETF approvals provide a layer of certainty surrounding the potential Ethereum ETFs.\n\nYou might also like: Robinhood to add support for spot Bitcoin ETFs ‘as soon as possible’\n\nFollowing this, ETH rose 9% on Jan. 11 and 16.75% this week as trading volume rose 79%.\n\nThe Ethereum ETF narrative has been spurred on by Eric Balchunas, who remains bullish on its approval.\n\nTraders are anticipating a similar growth to Bitcoin, which rose 164% in the year leading up to its ETF approval.\n\nThis could lead to a long-term rally for Ethereum, potentially even after the ETF approval deadline.\n\nAs Ethereum rallied, attention shifted to Bitcoin Minetrix whose presale is in progress.\n\nBitcoin Minetrix poised for gains?\n\nBitcoin Minerix is a platform on Ethereum that allows users to easily mine Bitcoin.\n\nIt works by users staking BTCMTX tokens in exchange for Bitcoin mining credits. They can then burn these credits for BTC cloud mining power.\n\nThis process requires no technical expertise or hardware. As such, Bitcoin Minetrix can be ideal for beginners and those looking to generate passive rewards.\n\nFurthermore, the decentralized and transparent BTCMTX token removes the risk of cloud mining scams.\n\nOther benefits include no space or noise constraints on the user and that it offers a more environmentally friendly alternative to traditional Bitcoin mining.\n\nYou might also like: BTC surging on ETF approval expectations, Bitcoin Minetrix presale hits $8m\n\nAnalysts No Bs Crypto and ClayBro are bullish, expecting more gains once the Bitcoin Minetrix concludes and BTCMTX launches.\n\nDisclosure: This content is provided by a third party. crypto.news does not endorse any product mentioned on this page. Users must do their own research before taking any actions related to the company.\n\nFollow Us on Google News"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vZGVjcnlwdC5jby8yMTIzNjgvYml0Y29pbi1kaXBzLXRoZW4tYm91bmNlcy1hZnRlci1ldGYtYXBwcm92YWwtd2hpbGUtZXRoZXJldW0tdG9wcy0yNTAw0gFlaHR0cHM6Ly9kZWNyeXB0LmNvLzIxMjM2OC9iaXRjb2luLWRpcHMtdGhlbi1ib3VuY2VzLWFmdGVyLWV0Zi1hcHByb3ZhbC13aGlsZS1ldGhlcmV1bS10b3BzLTI1MDA_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Dips, Then Bounces After ETF Approval While Ethereum Tops $2,500 - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe United States Securities and Exchange Commission (SEC) officially approved the trading of spot Bitcoin exchange-traded funds (ETFs) Wednesday, as expected—but the price of Bitcoin itself has been choppy since, though it's currently sitting about where it was when the news hit.\n\nBitcoin (BTC) is currently trading for $45,814 according to CoinGecko. It was around $45,840 when the news leaked via an order on the SEC website that was posted and then removed, and the price jumped as high as $46,263 soon after. It's mostly down since, however, albeit not significantly.\n\nEthereum (ETH), on the other hand, rose above $2,500 for the first time since May 2022 on Wednesday afternoon, and has continued climbing while Bitcoin pops up and down. Ethereum is currently trading for about $2,550, up about 11% over the past day.\n\nAD\n\nAD\n\nOn top of that, native tokens for Ethereum scaling networks have also been hot on Wednesday. Arbitrum (ARB) is up 26% over the last 24 hours to a current price of $2.18, while Optimism (OP) is up 11% today to $3.92. Arbitrum set an all-time high price Wednesday afternoon, following the Bitcoin ETF approval.\n\nBroadly, the cryptocurrency market is up about 2% over the past 24 hours.\n\nEditor's note: This story was updated after publication with additional information.\n\nSHOW ALERT: Tune in to Rug Radio’s FOMO Hour at 10:30am ET Thursday to hear Decrypt’s Stacy Elliott and Fox Business’s Eleanor Terrett chat all things Bitcoin ETF with Farokh Sarmad, Michael Anderson, and Ovie Faruq."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYnVsbHMtY2hhcmdlLWFzLWV0aGVyZXVtLWJhcnJlbHMtcGFzdC0yNjAwLWlzLWFuLWV0Zi10aGUtc2VjcmV0LXdlYXBvbi_SAWhodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2J1bGxzLWNoYXJnZS1hcy1ldGhlcmV1bS1iYXJyZWxzLXBhc3QtMjYwMC1pcy1hbi1ldGYtdGhlLXNlY3JldC13ZWFwb24vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Bulls Charge As Ethereum Barrels Past $2,600 – Is An ETF The Secret Weapon? - NewsBTC",
        "content": "Ethereum (ETH) continued its upward trajectory Wednesday, clocking a 10% gain in 24 hours to breach past the vaunted $2,600 mark. Market watchers attribute this surge to a confluence of factors, primarily fueled by anticipation of a forthcoming Ethereum exchange-traded fund (ETF) in the wake of the expected approval for a Bitcoin ETF in the US.\n\nIn a historic move that cryptocurrency aficionados hope will bring more individual and institutional investors into the market, the US Securities and Exchange Commission has approved the first spot bitcoin exchange traded funds on Thursday.\n\nEthereum ETF Buzz Sparks Strategic Moves\n\n“There’s a noticeable trend towards frontrunning the ether ETF,” noted Alex Onufriychuk, CEO of Kaminari, in a Telegram message. This sentiment aligns with the prevailing belief that Ethereum, the second-largest cryptocurrency by market cap, would be the next candidate for an ETF after Bitcoin.\n\nAdding fuel to the fire, a prominent investor, dubbed a “whale” in the crypto universe, made a strategic move by transferring 9,705 ETH (nearly $23 million) from Binance to Compound. This was followed by a 12 million Tether (USDT) loan, seemingly used to further accumulate ETH. The whale subsequently executed three profitable ETH transactions, netting roughly $5 million.\n\nThis decisive action signaled two things: confidence in Ethereum’s future and the potential for profit-taking, which could introduce short-term volatility. Despite the risk, the whale’s activity bolstered positive market sentiment.\n\nEthereum currently trading at $2,607.8 on the daily chart: TradingView.com\n\nFurther validating this optimism, Ethereum’s network metrics experienced a surge. Both network growth and token velocity saw increases, indicating heightened interest from new addresses and more token movement. These on-chain metrics paint a promising picture for ETH’s future.\n\nETH Futures Surge Amid ETF Optimism\n\nAlso adding to the bullish case, Open Interest for ETH futures contracts jumped 15% in recent days, reaching $4.57 billion at the time of writing. This signifies more traders entering the market and anticipating significant price gains following a potential ETF approval.\n\nEthereum vs. Bitcoin Open Interest | Source: Velo Data\n\nAccording to reports, crypto traders expect Ethereum’s price to rise after a favorable ETF judgment, even though Bitcoin is getting more attention in the media. If this situation plays out, the price of ETH could soon go beyond $2,600.\n\nHowever, it’s crucial to remember that the cryptocurrency market remains volatile, and unforeseen factors could still impact prices.\n\nThe timeline for an Ethereum ETF approval is uncertain, and regulatory hurdles could create delays. Additionally, broader market conditions and news on Ethereum development could also play a role.\n\nInvestors should carefully consider their risk tolerance and conduct thorough research before making any investment decisions, particularly in the dynamic and unpredictable world of cryptocurrencies.\n\nFeatured image from Medium\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLWFuZC1hbHRjb2lucy1hcmUtdGhlLWJpZ2dlc3Qtd2lubmVycy1vZi1iaXRjb2luLWV0Zi1hcHByb3ZhbC_SAV9odHRwczovL2NvaW5nYXBlLmNvbS9ldGhlcmV1bS1hbmQtYWx0Y29pbnMtYXJlLXRoZS1iaWdnZXN0LXdpbm5lcnMtb2YtYml0Y29pbi1ldGYtYXBwcm92YWwvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum and Altcoins Are the Biggest Winners of Bitcoin ETF Approval - CoinGape",
        "content": "Bitcoin briefly reached $47,000 in a subdued ascent following the approval by the U.S. Securities and Exchange Commission of Bitcoin ETFs directly investing in the token. Traders are now monitoring the products to assess their financial impact. While Bitcoin gains stay limited, Ethereum (ETH) and other altcoins have registered maximum gains after the ETF approval.\n\nEthereum Investors Cheer the ETF approval\n\nSoon after the news of Bitcoin ETF approval, the Ethereum (ETH) price surged by a staggering shooting past $2,600 levels. Several market analysts have already predicted that ETH is likely to outperform BTC in Q1 2024.\n\nadvertisement\n\nAs Ether experienced a notable surge, its positive momentum extended to other cryptocurrencies within the Ethereum ecosystem. Tokens affiliated with Polygon observed a 13% increase, Chainlink saw an 11% advance, and Uniswap registered an impressive 14% surge.\n\nThe speculation around a Bitcoin ETF becoming a reality has prompted a shift in trader focus towards Ether, anticipating the next narrative of an Ethereum ETF. Conor Ryder, Head of Research at stablecoin company Ethena Labs, notes that with Ether appearing relatively inexpensive compared to most other tokens, traders are strategically positioning themselves in anticipation of developments in the Ethereum space.\n\nLooking ahead, the Securities and Exchange Commission (SEC) is slated to make decisions on spot Ethereum ETF applications starting in May. Major players such as BlackRock, Invesco, Ark, VanEck, and Grayscale, seeking to convert its existing Ethereum Trust (ETHE) into an ETF, are among the firms awaiting approval. Speaking to CNBC, Ryder added:\n\n“It’s all about getting ahead of the narratives — bitcoin has rallied versus ether for the last six months thanks to spot ETF speculation, and ETF approval ties a bow on that narrative. Meanwhile ETH has struggled to find any momentum and has underperformed compared to most of the smaller Layer 1s,” or blockchain networks, like Solana and Cardano”.\n\nOver the last 24 hours, ETH has experienced a surge of over 10%, contrasting with a general decline in Ethereum NFTs. Notably, Moonbirds has witnessed a drop exceeding 23%, marking its first instance below 1 ETH in history. Additionally, MAYC has seen a decrease of more than 6%, with approximately 290 MAYC currently in Blend liquidation auction status.\n\nAltcoins Join the Party\n\nApart from Ethereum, other altcoins like Cardano have also joined the party. The Cardano (ADA) price is up 12.48% and is currently trading at $0.58 with a market cap of $20.5 billion. As per the breakout on the technical chart, the ADA price can rally all the way to $1 this year.\n\nAt the same time, the Avalanche (AVAX) and Polkadot (DOT) prices are also up by 11.47% and 14.6% respectively."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvZXRoZXJldW0tY2xhc3NpYy1ldGMtcm9ja2V0cy1za3l3YXJkLW5vdGNoZXMtMzQtc3VyZ2XSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Classic (ETC) Rockets Skyward: Notches 34% Surge - Watcher Guru",
        "content": "Ethereum Classic (ETC) has emerged as a standout performer in the cryptocurrency market, registering an impressive 34% surge within the past 24 hours. This surge not only surpasses the performance of major cryptocurrencies like Bitcoin and Ethereum but also positions Ethereum Classic as the top performer among the 100 leading cryptocurrencies by market cap presently.\n\nRemarkable Rally of Ethereum Classic\n\nWhile Bitcoin recorded a modest 1% increase and Ethereum observed a substantial rise of over 9% in the last 24 hours, ETC’s surge has garnered significant attention. This noteworthy upward movement in price has elevated ETC to a prominent position. It has further established it as the leading performer among the top 100.\n\nBitcoin’s recent upswing, triggered by the announcement of a Bitcoin ETF, has propelled its value beyond the $26 mark for the first time since October 2022. The accompanying surge in trading volume indicates considerable interest from major traders.\n\nAlso Read: Robinhood CEO Announces Plan to List Bitcoin ETF Soon\n\nSustainability of Ethereum Classic’s Momentum\n\nThe crucial question on everyone’s mind is whether ETC can maintain its impressive momentum. According to Changelly, a cryptocurrency exchange platform, ETC is anticipated to stay in positive territory over the next few days. The altcoin is predicted to reach as high as $22.59 on Saturday, Jan. 12, following a 5% daily surge. The average anticipated percentage surge for Ethereum Classic in the upcoming days ranges between 3-5%.\n\nSurging Trading Volumes and Neutral Market Sentiment\n\nIn tandem with Ethereum Classic’s surge, there has been a significant spike in trading volumes. It escalated by 234% within a single day and reached a total of $1.54 billion. Despite these substantial movements in price and volume, the overall sentiment surrounding the Ethereum Classic remains neutral. This was indicated by on-chain data provided by Santiment.\n\nInvestor Watch: Monitoring Ethereum Classic Market Developments\n\nInvestors are closely monitoring the developments in the Ethereum Classic market. This is especially true in the aftermath of recent Bitcoin-related news that has stirred the cryptocurrency landscape. As Ethereum Classic continues to defy market expectations, its impressive surge and heightened trading volumes have captured the attention of enthusiasts.\n\nAlso Read: Ethereum Breaches $2,400 While BTC Bleeds, Will ETH Hit $3,000 Soon?\n\nThe recent 34% surge of Ethereum Classic serves as a testament to the dynamic nature of the cryptocurrency market. As ETC takes a prominent position with its remarkable performance, the upcoming days will play a pivotal role in determining whether it can sustain its momentum and potentially instigate further market developments. Investors are advised to remain vigilant, stay informed about the evolving cryptocurrency landscape, and closely monitor any subsequent news that may impact Ethereum Classic’s trajectory."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vY29pbnBlZGlhLm9yZy9wcmljZS1hbmFseXNpcy9ldGhlcmV1bS1wcmljZS1icmVha3Mtb3V0LW9mLWl0cy1rZXktbGV2ZWwtd2lsbC1ldGgtcHJpY2UtY3Jvc3MtMzAwMC10aGlzLW1vbnRoL9IBeWh0dHBzOi8vY29pbnBlZGlhLm9yZy9wcmljZS1hbmFseXNpcy9ldGhlcmV1bS1wcmljZS1icmVha3Mtb3V0LW9mLWl0cy1rZXktbGV2ZWwtd2lsbC1ldGgtcHJpY2UtY3Jvc3MtMzAwMC10aGlzLW1vbnRoL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Breaks Out Of Its Key Level! Will ETH Price Cross $3,000 This Month? - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nThe crypto industry starts the day with a strong bullish sentiment as the SEC has given the approval of the Spot Bitcoin ETF which resulted in the market displaying significant price action. Further, the leader of altcoins, ETH has added over 8% to its portfolio over the past day.\n\nThe Ethereum price traded in a consolidated range between $2,248 and $2,137 for a while, following which the market gained momentum and the price successfully broke out of the range.\n\nHowever, the rally was short-lived as the price faced rejection at $2,342, after which the ETH coin price traded under a bearish sentiment and experienced a pullback within the range. After multiple attempts, the bulls regained momentum and jumped over 11% in its valuation.\n\nTradingView: ETH/USDT\n\nAfter facing a price restriction of $2,450, the star altcoin displayed significant price volatility and after a second failed attempt to break out of the resistance, the bulls lost momentum and recorded a correction of over 10%.\n\nFollowing this, the price traded in a narrow space between $2,200 and $2,300 for a period, after which the bulls regained momentum and successfully broke out of the range. Recently, the price experienced a jump of over 16%, indicating a strong bullish sentiment in the market.\n\nThe technical indicator, MACD, displays a constant rise in the green histogram, indicating increased buying-over-selling pressure in the market. Further, the averages show a significant uptrend, suggesting a bullpower in the space.\n\nWill Ethereum Rise Back Up?\n\nIf the bulls push the price above the resistance level of $2,615, the ETH price will regain momentum and test its upper resistance level of $2,700. Maintaining the price at that level will set the stage for the ETH price to attempt to test its resistance level of $2,750 in the coming time.\n\nNegatively, if the bears overpowered the bulls, the ETH price will lose momentum and fall to test its support level of $2,500. Moreover, if the negative reversal occurs, the Ethereum price will plunge and prepare to test its lower support level of $2,450 by the weekend."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LnJlYWx2aXNpb24uY29tL3Nob3dzL2luc2lkZXItdGFsa3MtY3J5cHRvL3ZpZGVvcy9jYW4tZXRoZXJldW0tZHVzdC1pdHNlbGYtb2ZmLWxvUW3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Can Ethereum Dust Itself Off? - Real Vision",
        "content": "Access Pro Crypto Content\n\nThis content is reserved for the thousands of visionaries supporting the financial revolution. We'd love for you to join us. Interested?\n\nSee Our Plans\n\nAlready have an account? Log In"
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vdS50b2RheS9rZXktcmVhc29ucy13aHktZXRoZXJldW0tY2xhc3NpYy1ldGMtYmxhc3RlZC1oaWdoZXItYnktNTDSAU1odHRwczovL3UudG9kYXkva2V5LXJlYXNvbnMtd2h5LWV0aGVyZXVtLWNsYXNzaWMtZXRjLWJsYXN0ZWQtaGlnaGVyLWJ5LTUwP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Key Reasons Why Ethereum Classic (ETC) Blasted Higher by 50% - U.Today",
        "content": "Ethereum Classic (ETC), the original version of Ethereum that split from the main network in 2016, has blasted higher by 50% in the last 24 hours.\n\nAdvertisement\n\nThe coin, which ranks as the 21st largest cryptocurrency by market capitalization, has outperformed its more popular sibling, Ethereum (ETH), which gained only 11.24% in the same period.\n\nAt the time of writing, ETC was up 50% in the last 24 hours to $31.16, gaining 55% in the last seven days.\n\nETC appears to be the biggest beneficiary of the crypto market's positive sentiment following the approval of the first Bitcoin exchange-traded fund (ETF) in the United States.\n\nAccording to Santiment, an on-chain analytics platform, Ethereum Classic blasted off following the Bitcoin ETF announcement, surpassing $26 for the first time since October 2022.\n\n📈 #EthereumClassic has blasted off following the #BitcoinETF announcement, reaching above $26 for the first time since October, 2022. Trading volume has surged, indicating major trader interest. However, $ETC sentiment still appears neutral for now. https://t.co/LhebnauCQX pic.twitter.com/wEf3ujmqH6 — Santiment (@santimentfeed) January 11, 2024\n\nETC surged higher in today's session, extending a larger rally that began on Jan. 8 after support was met at $18.37.\n\nSantiment reported that Ethereum Classic trading volume has increased, indicating major trader interest. It went on to say that ETC trade volume has not surpassed 1.23 billion in a single day since Sept. 13, 2022.\n\nETC will have gained for the fourth day in a row if the market closes in the green today.\n\nAlso, an impending upgrade, due on Jan. 31, is adding to the excitement surrounding the Ethereum Classic network.\n\nThe Ethereum Classic upgrade, dubbed Spiral, will take place at block 19,250,000. The Ethereum Classic Spiral Hard Fork is expected to occur on Jan. 31, 2024.\n\nEthereum Classic core developers have published ECIP-1109, which contains details of ETC's Spiral hard fork.\n\nThis document proposes the following blocks for implementing these changes on Ethereum Classic networks: 9, 957, 000 on the Mordor testnet (already upgraded in November 2023) and 19,250,000 on the Ethereum Classic mainnet (expected for January 31, 2024)."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vd3d3LmNvaW5zcGVha2VyLmNvbS9ldGhlcmV1bS1ldGYtY291bnRkb3duLXRoaXMteWVhci_SAUFodHRwczovL3d3dy5jb2luc3BlYWtlci5jb20vZXRoZXJldW0tZXRmLWNvdW50ZG93bi10aGlzLXllYXIvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum ETF Countdown: Analysts Optimistic on Potential Approval This Year - Coinspeaker",
        "content": "The SEC faces deadlines ranging from May 23 to August 7 to make decisions on Ethereum ETF applications.\n\nThe crypto market is buzzing with expectations as analysts predict a high likelihood of the approval of Ethereum (ETH) Exchange-Traded Funds (ETFs) in the coming months.\n\nAnalysts’ Confidence and Comparisons with Bitcoin\n\nEric Balchunas, a notable ETF analyst at Bloomberg, has expressed optimism, estimating a 70% chance of approving an Ethereum spot ETF by May. This potential approval could have huge implications for the crypto market, as Ethereum continues gaining attention from institutional and retail investors.\n\nBalchunas draws parallels between Ethereum and Bitcoin, stating that he couldn’t envision a scenario where spot Bitcoin ETFs are approved while spot Ether ETFs are not. He emphasized the interconnected nature of the two cryptocurrencies, noting that “Ether spot is tied to the hip of Bitcoin spot”.\n\nBalchunas, who has reportedly heard positive signals through informal channels, believes that spot Ethereum ETFs “will be fine”. Balchunas’ 70% probability is worth taking note off. This is because the approval odds issued on spot Bitcoin ETFs last year turned out positive.\n\nAdding to the positive sentiment, Digital asset lawyer Joe Carlasare expressed confidence in the eventual approval of Ethereum spot ETFs this year. However, he adds a cautious note, suggesting that the approval process may take longer than expected. Carlasare believes the Securities and Exchange Commission (SEC) is working to establish a precedent that allows it to exercise discretion in determining which digital asset ETFs can enter the market, discouraging a flood of applications for various tokens.\n\nCarlasare anticipates that spot Ethereum ETFs might not commence trading until the third quarter of 2024, contrasting with the optimism of some applicants like Hashdex, which hints at potential trading as early as the second quarter. Notably, the timing of the launch remains uncertain, even though the approval odds are relatively high.\n\nJames Seyffart, another Bloomberg ETF analyst, supports the case for spot ETH ETF approvals, pointing out that the SEC implicitly accepted Ether as a commodity when approving Ether futures ETFs in September. The analyst believes this prior acceptance could pave the way for spot Ether ETFs to gain regulatory approval.\n\nEthereum ETF Application Deadlines\n\nMultiple asset managers, including BlackRock Inc (NYSE: BLK), VanEck, ARK Invest & 21Shares, Fidelity Investments, and Invesco Galaxy, have filed applications for spot Ether ETFs.\n\nThe SEC faces deadlines ranging from May 23 to August 7 to make decisions on these applications. If the SEC approves one, it may potentially approve all, similar to the approach taken with spot Bitcoin ETFs.\n\nMeanwhile, the anticipation of Ethereum ETF approval is already influencing the market. Following the recent approval of Bitcoin ETFs, ETH experienced a surge of 7.92% in the past 24 hours, with a notable 17% rally over the past week according to data from CoinMarketCap.\n\nEthereum’s open interest also rose by 11.52% to $7.81 billion, signaling increased trading activity and a bullish sentiment."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9jcnlwdG9jdXJyZW5jaWVzL25ld3MvYWZ0ZXItYml0Y29pbi1ldGYtYXBwcm92YWwtc3BlY3VsYXRvcnMtc3dpdGNoLXRvLWV0aGVyZXVtLTIwMjQwMTExMTA0MNIBeWh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9hbXAvY3J5cHRvY3VycmVuY2llcy9uZXdzL2FmdGVyLWJpdGNvaW4tZXRmLWFwcHJvdmFsLXNwZWN1bGF0b3JzLXN3aXRjaC10by1ldGhlcmV1bS0yMDI0MDExMTEwNDA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "After Bitcoin-ETF approval, speculators switch to Ethereum - FXStreet",
        "content": "Share:\n\nMarket picture\n\nThe US Securities Commission (SEC) has announced the approval of the Bitcoin-ETP. The initial fake announcement of this created a spike in volatility. This is a stark reminder of how short-term traders are vulnerable to volatility from the news.\n\nBitcoin soared to $48K before returning below $45K. Technically, these moves fit into a trend formed back in late October last year and gained new momentum after December's sideways consolidation. It's worth preparing for a scenario where altcoins, currently appearing undervalued compared to the leading cryptocurrency, start taking centre stage. But that doesn't negate the potential for BTCUSD to reach $50-51K before a significant correction.\n\nEthereum is obviously attracting the attention of speculators, adding over 13% in less than 36 hours, as it is the next favourite for ETP approval. Potentially, these expectations could drive the price of ETH up in the next couple of months all the way to the $3500 area – the peak in April 2022.\n\nNews background\n\nAccording to CoinMarketCap, traders lost nearly $1 billion due to a fake tweet about ETF approval. According to Bitfinex, the liquidation of positions in the futures market was the largest since August 2023.\n\nAbout a dozen fund companies in Hong Kong are exploring the possibility of launching spot bitcoin ETFs, HashKey reported. Potential issuers include firms with Chinese capital, as well as from other Asian and European countries.\n\nRobert Kiyosaki, author of the best-selling book \"Rich Dad, Poor Dad\", suggested the price of the first cryptocurrency to rise to the $150K level after the ETF was approved. According to him, he will \"buy more gold, silver and bitcoin with fake dollars\"."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZGFpbHljb2luLmNvbS9ldGhlcmV1bS1ldGMtc2t5cm9ja2V0LWZvbGxvd2luZy1zZWNzLWJpdGNvaW4tZXRmLWFwcHJvdmFsL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum, ETC Skyrocket Following SEC’s Bitcoin ETF Approval - DailyCoin",
        "content": "Ether-related altcoins come out as winners after BTC’s ETF approval.\n\nETH, ETC hit yearly highs upon soaring trading activity on both chains.\n\nProfessional trader shares potential targets if ETC’s breakout stands.\n\nWednesday night will go down in the history books for the cryptosphere, as the U.S. Securities and Exchange Commission (SEC) finally approved the inaugural Bitcoin exchange-traded fund (ETF). Following the ground-breaking move, the leading digital asset soared to a new yearly high at $47,598, later witnessing a slight market correction to hover above the $46,000 mark.\n\nMeanwhile, the second largest digital asset Ethereum (ETH) embarked on a parabolic 10.2% bull run and also claimed a brand new yearly high at $2,651.44. Ether scored a whopping $53,084,197,769 in trading volume over the past 24 hours, while the open interest in the asset rose by 15% this week.\n\nETH’s Proof Of Work sibling Ethereum Classic (ETC) emerged as the day’s top gainer, as most altcoins are enjoying a double-digit upswing following the bullish news from the U.S. Securities and Exchange Commission (SEC). The #24 spotted ETC soared by 48.7% to trade at $31.65, according to CoinGecko.\n\nETC has been trading in a downward parallel channel for most of December 2023 and dropped below $20 briefly at the beginning of the New Year. Today, while dwelling around the earlier $28 confluent resistance line, ETC finally broke through the barrier to confirm the price trend reversal.\n\nTrader Measures Ethereum Classic’s Potential To Triple Digits\n\nEthereum Classic (ETC) is a Proof of Work (PoW) fork of the original Ethereum (ETH). While the latter switched to a Proof of Stake (PoS) consensus mechanism, miners on the network were expected to flock to ETC to mine cryptocurrency.\n\nHowever, the transition took some time, as the blockchain analysis platform Santiment reported that ETC breached $1.23 billion in trading volume on January 10, 2024, for the first time since September 13, 2022.\n\nProfessional crypto trader Javon Marks describes the latest Ethereum Classic’s price movement as “displaying major strength towards $127.65,” basing this target on the fact that ETC’s price is still 81% down from its all-time high set at $167.09 over two years ago.\n\nIf the ongoing bullish trend persists, Marks sees potential for an “additional 380% upside.” Standing at a $4,511,651,295 market cap, ETC added approximately 1.5 billion in the last 24 hours.\n\n$ETC (#EthereumClassic) TAKES OFF, displaying MAJOR STRENGTH towards the $127.65 and we can still be EARLY in this run!\n\n\n\nAs prices continue to hold broken out, this target remains in play, meaning an additional +380% upside can be on the way to reach it… https://t.co/W4auGOq4MA pic.twitter.com/qRyiqbOSqu — JAVON⚡️MARKS (@JavonTM1) January 10, 2024\n\nOn the Flipside\n\nIn a bearish scenario, the Ethereum Classic (ETC) would be heading to retest the $23 resistance, a barrier that has been historically hard to break.\n\nETC’s Relative Strength Index (RSI) turned to an overbought condition, as the RSI metric is approaching 80 on both daily and weekly charts.\n\nWhy This Matters\n\nAs the inaugural Bitcoin exchange-traded fund (ETF) gained approval, the cryptosphere got a long-awaited entrance to the traditional financial market.\n\nDelve into DailyCoin’s latest cryptocurrency news:\n\nNASDAQ, NYSE, Cboe Gear Up to Offer Approved Bitcoin ETFs\n\nOnly 6% of Funding Goes to Female-Led Blockchain Startups"
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW1zLWJ1bGxpc2gtYnJlYWtvdXQtYW5hbHlzdHMtcHJlZGljdC1zdXJnZS10by0zNTAwLWhlcmVzLXdoeS_SAW5odHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2V0aGVyZXVtL2V0aGVyZXVtcy1idWxsaXNoLWJyZWFrb3V0LWFuYWx5c3RzLXByZWRpY3Qtc3VyZ2UtdG8tMzUwMC1oZXJlcy13aHkvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum’s Bullish Breakout: Analysts Predict Surge To $3,500 – Here’s Why - NewsBTC",
        "content": "Ethereum, the second-largest crypto by market capitalization, is currently exhibiting signs of a bullish breakout, as observed by two prominent analysts in the crypto space. According to World Of Charts, Ethereum shows consolidation within a bullish pennant pattern.\n\nThis technical formation typically suggests continuing an upward trend in Ethereum’s case. According to the analyst, if Ethereum successfully breaks out of this pattern, it could surge toward a significant level of $3,500.\n\n$Eth Trend Is Up Consolidating In Bullish Pennant Expecting Breakout Soon Incase Of Successful Breakout Expecting Move Towards 3500$#Crypto #Eth #Ethusdt #Ethereum pic.twitter.com/nlqbMfh3k0 — World Of Charts (@WorldOfCharts1) January 10, 2024\n\nCrucial Resistance Zone: Ethereum Path To Breakout\n\nAdding to World Of Charts’ optimistic outlook, crypto trader Skew has identified the $2,320–$2,382 range as a key resistance zone for Ethereum. This price range has historically acted as a barrier to Ethereum’s upward movement, with “numerous rejections” witnessed at these levels.\n\nSkew emphasizes the importance of Ethereum closing above $2,400 on the 1-hour and 4-hour charts. This decisive move would breach the resistance zone and confirm Ethereum’s bullish momentum.\n\nSkew also noted that technical indicators such as the Relative Strength Index (RSI) and stochastics still display significant momentum, supporting the potential for Ethereum’s continued upward trend.\n\n$ETH 4H\n\nMaybe it’s time for ETH to shine & run, would definitely help if the BTC Spot ETF is legitimately approved later $2320 – $2382 has proven to be strong resistance with numerous rejections the key confirmation would be a solid 1H & 4H close above $2400 4H trend &… pic.twitter.com/taWbcC7eWY — Skew Δ (@52kskew) January 10, 2024\n\nEthereum’s Solo Bull Run Amid Market Turbulence\n\nDespite recent market turbulence, including the plunge of several cryptocurrencies, including BTC, following the Securities and Exchange Commission’s (SEC) fake spot ETF approval announcement, Ethereum has shown resilience and is currently in the green.\n\nOver the past 24 hours, Ethereum has climbed by 5.5%, surpassing the $2,400 mark before a slight retracement to around $2,381 at the time of writing. This bullish trend is further supported by increased trading volume, which surged below $30 billion to approximately $39 billion in the past day.\n\nSkew suggests that Ethereum’s bullish momentum could receive an additional boost from the potential approval of a Spot BTC ETF. If such approval were to come to fruition, it could further support Ethereum’s upward trajectory.\n\nThis sentiment is echoed by Michaël van de Poppe, another renowned crypto analyst, who also foresees Ethereum’s approach to its 2022 low as a precursor to a potential breakout. Van de Poppe believes that Ethereum’s current positioning near last year’s low could be crucial in absorbing liquidity and fueling a bullish breakout.\n\nVan de Poppe’s analysis highlights the broader market context, specifically the awaited decision on a spot Bitcoin ETF in the US. An approval, he predicts, could notably impact the ETH/BTC trading pair, potentially triggering a sharp price movement known as a liquidation candle.\n\nFollowing this, Van de Poppe anticipates a significant reallocation of funds into Ethereum, accompanied by a bullish weekly divergence, propelling Ethereum onto an upward trajectory.\n\nFeatured image from Unsplash, Chart from TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjQvMDEvMTEvZXRoZXJldW1zLXZpdGFsaWstYnV0ZXJpbi1wcm9wb3Nlcy1nYXMtbGltaXQtaW5jcmVhc2Uv0gFjaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyNC8wMS8xMS9ldGhlcmV1bXMtdml0YWxpay1idXRlcmluLXByb3Bvc2VzLWdhcy1saW1pdC1pbmNyZWFzZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum's Vitalik Buterin Proposes Gas Limit Increase - CoinDesk",
        "content": "Ethereum's gas limit refers to the total amount of gas that can be squeezed into an individual Ethereum block – the bundles of transactions that get added to the Ethereum network at regular intervals. Increasing the gas limit would mean increasing the amount (and complexity) of transactions that can be added to a block."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyNC8wMS8xMC9ldGhlcmV1bS1ldGgtcHJpbWVkLXRvLWNvbGxhcHNlLWFnYWluc3QtYml0Y29pbi1idGMtdG8tbXVsdGkteWVhci1sb3dzLWFjY29yZGluZy10by1iZW5qYW1pbi1jb3dlbi_SAYgBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjQvMDEvMTAvZXRoZXJldW0tZXRoLXByaW1lZC10by1jb2xsYXBzZS1hZ2FpbnN0LWJpdGNvaW4tYnRjLXRvLW11bHRpLXllYXItbG93cy1hY2NvcmRpbmctdG8tYmVuamFtaW4tY293ZW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Primed To Collapse Against Bitcoin (BTC) to Multi-Year Lows, According to Benjamin Cowen - The Daily Hodl",
        "content": "Crypto analyst Benjamin Cowen believes that Ethereum (ETH) is about to collapse against Bitcoin (BTC).\n\nIn a new strategy session, Cowen tells his 789,000 YouTube subscribers that the ETH/BTC ratio is likely repeating a historical pattern and might soon lose a key support level.\n\n“I’m not saying it can’t ever bounce, and if it does bounce the bull market support band is what you would look towards and that’s currently at around .055 BTC. So I would keep an eye on that in case there are any bounces.\n\nBut I still think that there’s a good chance that we are just emulating what happened over here [in December 2017] and that we are about to enter this phase of the cycle [similar to 2019-2020] where support finally breaks [at the 0.049 BTC level], it comes down into these levels over here, finds some type of a bottom [at around 0.037 BTC], goes sideways for a while and then maybe by the end of the year starts trending back up [to 0.049 BTC].”\n\nETH/BTC is trading for 0.049 BTC ($2,298) at time of writing.\n\nCowen acknowledges that the ETH/BTC pair has both lower highs and higher lows in the weekly time frame, which makes it difficult to predict the trading pair as bullish or bearish.\n\n“How best to explain Ether/Bitcoin higher lows is perhaps on some type of logarithmic regression curve. And it is important to point out the higher lows…\n\nBut one concerning aspect are these lower highs. We can look at the higher lows, and a lot of people point to that…\n\nI look at these lower highs and think, where’s this thing ultimately heading? It’s putting in lower highs, but it’s also putting in higher lows. The truth is I don’t know what the ultimate outcome of this is. You could make a case, either way.”\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMTAvZXRoZXItanVtcHMtb3Zlci0yNGstYXMtdHJhZGVycy1iZXQtb24tcG9zc2libGUtZXRoZXItZXRmLW5leHQv0gFvaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyNC8wMS8xMC9ldGhlci1qdW1wcy1vdmVyLTI0ay1hcy10cmFkZXJzLWJldC1vbi1wb3NzaWJsZS1ldGhlci1ldGYtbmV4dC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ether Jumps Over $2.4K as Traders Bet on Possible Ether ETF Next - CoinDesk",
        "content": "But some stated that select tokens could gain in the coming days. \"Tokens in the ETH ecosystem like LIDO, ENS, and MKR experienced sharp up moves which should continue to take the attention away from BTC as traders now must position for the possibility of an ETH ETF,\" said Jack Tan co-founder of crypto exchange WOO X, in a Telegram message."
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL2NvaW5wZWRpYS5vcmcvcHJpY2UtYW5hbHlzaXMvdG9wLWFsdGNvaW5zLXRvLXdhdGNoLXBvc3QtZXRmLWFwcHJvdmFsLXJpcHBsZS14cnAtZXRoZXJldW0tZXRoLWFuZC1zb2xhbmEtc29sLXNldC10by1mdWxseS1jYXBpdGFsaXplL9IBkAFodHRwczovL2NvaW5wZWRpYS5vcmcvcHJpY2UtYW5hbHlzaXMvdG9wLWFsdGNvaW5zLXRvLXdhdGNoLXBvc3QtZXRmLWFwcHJvdmFsLXJpcHBsZS14cnAtZXRoZXJldW0tZXRoLWFuZC1zb2xhbmEtc29sLXNldC10by1mdWxseS1jYXBpdGFsaXplL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Top Altcoins To Watch Post ETF Approval: Ripple (XRP), Ethereum (ETH) And Solana (SOL) Set To Fully Capitalize - Coinpedia Fintech News",
        "content": "Shayan is a digital nomad and a professional journalist. He delivers high-quality engaging articles to Coinpedia through his in-depth research and analysis.\n\nContrary to predictions that Bitcoin’s price would quickly exceed $48,000 and settle around $50,000 following SEC’s approval on spot ETF, the pump is yet to occur. Meanwhile, the altcoin market has seen a notable rise, with leading altcoins showing an average growth of 10%-20%. In addition, Ethereum (ETH) has surpassed its $2,500 resistance mark, reaching close to $2,700, with XRP and SOL prices set to capitalize on the current momentum.\n\nBitcoin’s Recent Failure Induced An Altcoin Pump\n\nFollowing the SEC’s decision on the spot ETF application, which did not have the expected impact on BTC’s short-term targets, the altcoin market witnessed a surge in buying interest. ETH investors grew more confident about the possibility of a spot ETH ETF approval.\n\nAdditionally, investors are looking forward to a potential XRP ETF, which may materialize in the coming years, given the ongoing SEC lawsuit against Ripple. Furthermore, the recent approval of a Bitcoin ETF is expected to inject billions of dollars into the market, significantly increasing the DeFi market cap and potentially leading to further gains in Solana’s price.\n\nIn the past few hours, the altcoin season index has seen a remarkable exponential increase, rising from a low of 56 to reach 67. It’s worth highlighting that should this metric exceed 75, it could signal the start of an altcoin season. In such a scenario, many investors may shift their focus to altcoins if Bitcoin fails to show any promising trends.\n\nXRP Price Analysis\n\nXRP is currently facing a decline following Bitcoin’s rejection at $49K. However, the downtrend might not intensify as the market holds bullish momentum. As of writing, XRP price trades at $0.598, surging over 6.7% from yesterday’s rate.\n\nCurrently, the 100-day EMA is holding buying confidence and the RSI is trading below the overbought region, suggesting an advantage for the bulls. In the coming days, we might see a bullish attempt to break the crucial resistance at $0.66, pushing XRP’s price above $0.74.\n\nEthereum Price Analysis\n\nEther experienced a significant surge from its 20-day EMA, reflecting strong buying interest at lower prices. However, this upward momentum faced a rejection soon as the price reversed from $2,700, suggesting bearish dominance near that level. As of writing, ETH price trades at $2,585, surging over 6.1% from yesterday’s rate.\n\nShould the price remain stable above $2,500, it would signal a continuation of the upward trend. In this scenario, the ETH price may retest $2,700, followed by a potential climb to the significant $3,000 mark.\n\nSolana Price Analysis\n\nSolana price is hovering within a descending channel pattern as it continues to struggle near the resistance line at $107. However, bulls are defending the SOL price above moving averages. Currently, Solana is trading at $99.3, surging over 4.9% from yesterday’s rate.\n\nThe EMA lines are showing a leveling trend, and the Relative Strength Index (RSI) is trading close to the midpoint. This reflects a state of equilibrium between the supply and demand. If SOL breaks the current momentum above the channel’s resistance line, we might see a surge toward $120."
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vd3d3LmNvaW5zcGVha2VyLmNvbS9ldGhlcmV1bS1wcmljZS1idGMtc3BvdC1ldGgtZXRmL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Is Around $2600 after BTC ETF Approval, Will Spot ETH ETF Come Next? - Coinspeaker",
        "content": "The crypto community is discussing the chances to see the spot ETH ETF applications approved in May 2024.\n\nIn the aftermath of the recent approval of a spot Bitcoin exchange-traded fund (ETF) in the US, major cryptocurrencies, Ethereum included, witnessed a significant rally.\n\nWhile Bitcoin (BTC) saw a modest 1.35% gain, Ethereum (ETH) emerged as the standout performer, surging by 10% to surpass $2,600, reaching its highest value since May 2022.\n\nAnalysts had expected a possible “sell-the-news” reaction to the ETF approval, anticipating BTC to reach a new all-time high. However, the leading crypto asset underperformed and maintained its $47,000 position attained on January 9 before the ETF approval.\n\nNevertheless, K33 Research senior analyst Vetle Lunde suggested that BTC’s price could see improvement with the deal flow on the ETF approval, hinting at a potential cycle pushing BTC’s price beyond $300,000.\n\nEthereum Breaks Resistance amidst Strategic Trading\n\nWhile BTC maintained its $47,000 position, Ethereum broke the resistance, currently trading around $2,645 at the time of writing, signaling renewed interest among traders.\n\nConor Ryder, the head of Research at Ethena Labs, a stablecoin company, opined that traders are strategically accumulating the digital asset due to ETH’s comparatively lower price compared to many other tokens like BTC in anticipation for more developments within the ecosystem.\n\nWith ETH currently trading beyond $2,600, the crypto community hinted at the possibility of an Ethereum exchange-traded fund (ETF) approval. Last year, asset management companies such as VanEck, Ark Invest, and Hashdex submitted applications with the US Securities and Exchange Commission (SEC) for a spot Ethereum ETF product.\n\nThe financial watchdog is expected to make decisions regarding the applications in May 2024 and market analysts believe the SEC would approve the investment products in the coming months.\n\n$272 Million Liquidated after Bitcoin ETF Approval\n\nMeanwhile, the broader crypto market also witnessed positive movements, with the top 10 digital assets (excluding stablecoins) recording gains of more than 4% within 24 hours. Solana, (SOL) Cardano (ADA), Binance Coin (BNB) Avalanche (AVAX) Ripple (XRP), and Dogecoin (DOGE) showed increases ranging from 4% to 14% upon the BTC spot ETF approval.\n\nHowever, the surge in crypto prices led to significant liquidations, totaling approximately $272 million across more than 85,000 traders.\n\nBitcoin traders incurred losses of nearly $85 million, with ETH’s price surge resulting in significant losses for short traders, amounting to $54 million. Long traders for Ethereum faced approximately $30 million in losses.\n\nNotably, a $3.81 million short position against Ethereum on Binance marked the most substantial liquidation. Other assets like SOL, XRP, and BNB also saw notable liquidations.\n\nBinance and OKX emerged as the platforms with the highest total losses, accounting for more than $190 million at press time."
    },
    {
        "id": 76,
        "url": "https://news.google.com/rss/articles/CBMilAFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2V0aGVyZXVtLWNsYXNzaWMtcHJpY2UtZm9yZWNhc3QtY2hhbmNlcy1vZi0yMS1jb3JyZWN0aW9uLXdhbmUtb24tYnVsbGlzaC1tYXJrZXQtbW9tZW50dW0tMjAyNDAxMTAwMTE20gGYAWh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9hbXAvY3J5cHRvY3VycmVuY2llcy9uZXdzL2V0aGVyZXVtLWNsYXNzaWMtcHJpY2UtZm9yZWNhc3QtY2hhbmNlcy1vZi0yMS1jb3JyZWN0aW9uLXdhbmUtb24tYnVsbGlzaC1tYXJrZXQtbW9tZW50dW0tMjAyNDAxMTAwMTE2?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Classic Price Forecast: Chances of 21% correction wane on bullish market momentum - FXStreet",
        "content": "Share:\n\nEthereum Classic price formed a double-top reversal pattern that hints at a 21% decline.\n\nPrice indicators highlight the potential of the pattern failing due to bullish broader market cues.\n\nThe anticipated spot Bitcoin ETF approvals will likely have a bullish impact on altcoins, benefiting ETC.\n\nEthereum Classic price was seemingly adhering to the micro bearish reversal pattern, which failed despite the recent correction in the crypto market. The short-term outlook ahead of the spot Bitcoin ETF approval is now looking bullish as ETC is bouncing back from the crucial support of $19.33.\n\nEthereum Classic price notes a bearish reversal pattern\n\nEthereum Classic price on the 4-hour scale invalidates the double-top bearish reversal pattern that has been observed in the past four weeks. This pattern consists of two peaks or tops of nearly identical height positioned closely together, with a trough in between. It suggests a possible shift in market direction.\n\nThe potential trend reversal is indicated by the price encountering a resistance level on two separate occasions without successfully surpassing it. This is often interpreted as a sign to consider selling or initiating short positions as further declines in the market.\n\nIn the case of Ethereum Classic, this double top was formed at $23.42, with the neckline or support level of the pattern being marked at $19.33. This is also the breakout level, and an extended decline below this line would confirm the bearish reversal pattern. Furthermore, a successful pattern would only be observed when ETC falls to the target price of $15.24, which, according to the pattern, would register a 21% decline on the 4-hour chart.\n\nHowever, Ethereum Classic price took the other route and, instead of falling through the neckline, bounced off it to note minor recovery, trading at $19.90 at the time of writing. Although this does not rule out the potential for decline, the price indicators do suggest invalidation of the pattern is likely, too.\n\nETC/USD 4-hour chart\n\nThe Relative Strength Index (RSI) and the Moving Average Convergence Divergence (MACD) indicator are giving out mixed signals, with the former still sitting in the bearish zone and the latter noting a bullish crossover.\n\nEthereum Classic RSI and MACD\n\nIf Ethereum Classic price continues the current path and broader market bullish cues kick in, ETC could move sideways or upwards beyond $20 and invalidate the bearish pattern.\n\nOn the other hand, if the Ethereum namesake falls through the neckline and falls below $19, the bullish thesis would be invalidated, and the reversal pattern could be deemed mildly successful since absolute success would warrant a 21% correction."
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ldGhlci1ldGYtaG9wZXMtZHJpdmUtc21hcnQtMTExMzE4MzI3Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ether ETF Hopes Drive Smart Money Bets After Historic Bitcoin ETF Approval - Yahoo Finance",
        "content": "The approval of spot bitcoin ETFs has sparked optimism among ether traders, who are hoping for a spot ether product as well.\n\nBlackRock has already filed a prospectus for its iShares Ethereum Trust, a spot ether exchange-traded fund, with the SEC.\n\nThe potential approval of an ether ETF could increase investment and interest in Ethereum-based projects and layer 2 networks, leading to more innovation and growth within the ecosystem.\n\nThe historic U.S. approval of spot bitcoin [BTC] exchange-traded funds (ETF) on Wednesday has buoyed ether [ETH] traders, who are betting the token that powers the Ethereum network could be next in line.\n\nNew deadline to obsess over just dropped\n\n\n\nMay 23rd is the final deadline for decision on VanEck’s spot ETH ETF pic.twitter.com/dgi5EVbPeQ — Will (@WClementeIII) January 10, 2024\n\nThe ETH price has jumped 10% in 24 hours, while bitcoin added 1.3%. Tokens of layer 2 networks, which operate as individual blockchains but are ultimately built atop Ethereum, surged as well. Arbitrum’s ARB and Mantle’s MNT both gained more than 20%. Other Ethereum ecosystem tokens, ranging from meme coins to those that power Ethereum-based applications, rose 14% on average, the category tracked by CoinGecko shows .\n\n“The largest smart money inflows” were directed toward the Ethereum ecosystem in the past 24 hours, Nansen analyst Martin Lee said in a Telegram message. Nansen defines smart money as wallets that trade or invest in a way that is considered experienced or well informed and are usually profitable.\n\nThe process for a spot ether ETF has already started. Ark 21Shares and VanEck, both sponsors of approved bitcoin ETFs, filed the paperwork with the Securities and Exchange Commission (SEC) back in September. And BlackRock, the world's largest asset manager and also a bitcoin ETF sponsor, filed an S-1 prospectus for its iShares Ethereum Trust in November.\n\nStory continues\n\nSome traders told CoinDesk that an ether ETF could bolster the growth of Ethereum-based financial applications, whose use cases range from on-chain trading and lending to issuance of real-world assets, or tokenization, on the blockchain.\n\n“A potential approval of an ether ETF could further legitimize Ethereum's standing in the mainstream financial world, leading to increased investment and interest in Ethereum-based projects and layer 2 networks,” said RJ Ke, a researcher at Ethereum rollup service Taiko. “The anticipation could foster more innovation and growth within the Ethereum ecosystem as well.”\n\nBets on Ethereum-based tokens may spark a reversal of fortunes for ETH investors, which underperformed bitcoin in 2023. Bitcoin, the largest cryptocurrency by market cap, climbed more than 150% last year while ether, the No. 2, added about 90%.\n\n“The approval of the Bitcoin ETFs by the SEC has opened the door for other cryptocurrencies,” said Lucy Hu, a senior analyst at Metalpha, in an email. “The market is now paying close attention to Ethereum ETF applications ... As the ETH spot ETF deadline is coming close, we believe more institutional investors will allocate more ETH in their portfolios this year to capture more returns.”"
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyNC8wMS8xMS9jcnlwdG8tdHJhZGVyLW5hbWVzLW1hc3NpdmUtdGFyZ2V0LWZvci1iaXRjb2luLWJ0Yy1jeWNsZS1zYXlzLWV0aGVyZXVtLWV0aC1pcy1zdGFydGluZy1hLXN0cm9uZy1ydW4v0gGJAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDI0LzAxLzExL2NyeXB0by10cmFkZXItbmFtZXMtbWFzc2l2ZS10YXJnZXQtZm9yLWJpdGNvaW4tYnRjLWN5Y2xlLXNheXMtZXRoZXJldW0tZXRoLWlzLXN0YXJ0aW5nLWEtc3Ryb25nLXJ1bi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Crypto Trader Names Massive Target for Bitcoin (BTC) Cycle, Says Ethereum (ETH) Is Starting a Strong Run - The Daily Hodl",
        "content": "A widely followed crypto analyst says Bitcoin (BTC) is set to soar after the U.S. Securities and Exchange Commission (SEC) approved 11 BTC exchange-traded funds (ETFs) yesterday.\n\nCrypto trader Michaël van de Poppe tells his 683,000 followers on the social media platform X that BTC could reach as high as $600,000 this market cycle.\n\n“Range is defined.\n\n$48,000 has been reached, perhaps we’ll go there again with the deal flow on the ETF approval today for Bitcoin.\n\nDips at $36-40,000 are amazing to get.\n\nPerhaps we’ll go to $300-600,000 this cycle.”\n\nAccording to the trader, there is a chance that BTC could next see a consolidation period.\n\n“Bitcoin approaches crucial levels.\n\nThe highs at $48,000 seem likely to be broken or tested, and potentially even $50,000.\n\nQuestion is; what’s next?\n\nProbably consolidation, but the Bitcoin ETF is a significant event.”\n\nBTC is worth $46,255 at time of writing.\n\nWith BTC likely facing consolidation, Van de Poppe suggests traders consider a “rotation towards” the leading smart contract platform Ethereum (ETH).\n\n“Bitcoin reached the level I’ve mentioned for the past months.\n\nI think we’ll consolidate. The news is out, the ETF is live, it’s great.\n\nRotation towards Ethereum.”\n\nLooking at ETH/BTC, Van de Poppe says ETH and the rest of the altcoins are setting up for a rally.\n\n“The rotation game is happening already.\n\nA massive weekly bullish divergence on the ETH / BTC pair suggests that we’re going to have a strong run on Ethereum, and altcoins.\n\nWe’re at January 2016, good times ahead. Ethereum to $3,500.”\n\nETH is worth $2,581 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/TadashiArt"
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS13aGF0LXJpc2luZy13aGFsZS1pbnRlcmVzdC1tZWFucy1mb3ItZXRocy1mdXR1cmUv0gFUaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2V0aGVyZXVtLXdoYXQtcmlzaW5nLXdoYWxlLWludGVyZXN0LW1lYW5zLWZvci1ldGhzLWZ1dHVyZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum: Rising whale interest means this for ETH’s future - AMBCrypto News",
        "content": "Influential whales showed keen interest in Ethereum and accumulated large amounts of ETH.\n\nEthereum experienced a large price surge, coupled with increased network growth.\n\nAmid prevailing uncertainty surrounding the crypto market, Ethereum [ETH] became the focus of significant attention from influential whales.\n\nWhale move in\n\nInsights from Lookonchain shed light on a substantial whale transaction. This whale withdrew a considerable 9,705 ETH ($22.9M) from Binance [BNB], subsequently depositing the funds into Compound.\n\nIn a strategic move, the whale borrowed 12M Tether [USDT] to further accumulate ETH. The trading activity involved three ETH transactions, two of which resulted in profits, accumulating roughly $5M.\n\nThe whale’s decisive actions introduce a spectrum of implications for ETH. On one hand, the substantial investment signals a level of confidence in ETH’s future potential, bolstering positive sentiment within the market.\n\nConversely, the increased incentive for profit-taking introduced an element of risk, potentially impacting short-term price stability.\n\nAnalyzing ETH’s price movement\n\nAs of the latest data, ETH was trading at $2,415.34, reflecting a positive growth of 5.07% in the last 24 hours. Crucially, metrics such as network growth and velocity experienced a surge.\n\nThis indicated heightened interest from new addresses and an increase in token movements, collectively contributing to a positive outlook for ETH’s future.\n\nThe MVRV ratio, a metric gauging the profitability of ETH addresses, expanded in tandem with the recent surge in price.\n\nWhile this points to increased profitability for ETH holders, it also raises the specter of potential sell-offs, which could exert downward pressure on prices.\n\nCounterbalancing this, the rising long/short ratio, indicative of a prevalence of long-term addresses over short-term ones, suggests a greater inclination toward holding rather than selling.\n\nHow much are 1,10,100 ETHs worth today?\n\nA holistic view of Ethereum’s network revealed consistent gas usage, a critical metric for measuring transaction activity. However, a concerning decline in NFT trades on the network raises questions about overall network vitality.\n\nThe reduced engagement with NFT transactions may signify a shift in user preferences or potential challenges faced by the NFT sector within the Ethereum ecosystem."
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9ldGhlcmV1bS1wcmljZS1iaXRjb2luLW1pbmV0cml4LXJpc2UtZGVzcGl0ZS1vdGhlci1hbHRjb2lucy1mYWxsaW5nL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price & Bitcoin Minetrix Rise Despite Other Altcoins Falling - CryptoPotato",
        "content": "It has been a volatile week in the altcoin market so far, with most coins currently in the red.\n\nHowever, Ethereum (ETH) and Bitcoin Minetrix (BTCMTX) have bucked this trend, showcasing impressive resilience amid the broader market downturn.\n\nEthereum Eyes Breakout as Trading Volume Spikes\n\nAt the time of writing, ETH is trading around the $2,430 level – just below last week’s high.\n\nETH has posted two bullish daily closes in a row and looks to be heading for a third if the current momentum can be sustained.\n\nFrom a technical perspective, ETH’s price is still trapped in a range between $2,150 and $2,450 – a range that has been in play since early December.\n\nHowever, the recent bounce from the 50-day exponential moving average (EMA) on the daily time frame suggests that the token could be positioned to break out of this range to the upside.\n\nSpot trading volume for ETH has soared 35% in the past 24 hours as investors look to get involved before any breakout occurs.\n\nThis uptick in trading volume has come at the same time as the Crypto Fear & Greed Index ticking into “Extreme Greed” territory.\n\nAs such, all of the necessary factors are there for ETH to potentially make a run back to December’s yearly high in the coming days.\n\nBitcoin Minetrix Continues to Post Presale Gains as Stake-to-Mine Feature Catches Attention\n\nAlongside Ethereum, another altcoin that’s making progress while the market struggles is Bitcoin Minetrix (BTCMTX).\n\nUnlike ETH, Bitcoin Minetrix is not yet listed on the open market and is still in its presale phase – yet has just passed the $8 million funding milestone.\n\nInvestors have been piling into the presale in recent weeks due to the discounted price of BTCMTX that’s on offer.\n\nCurrently, investors can buy BTCMTX tokens for just $0.0127 – although this price is only available for one more day before increasing by 8% in the next stage.\n\nBitcoin Minetrix’s presale has seen enormous traction, mainly due to the project’s groundbreaking Stake-to-Mine feature.\n\nThis feature enables everyday crypto users to stake BTCMTX tokens and earn “cloud mining credits” as a reward.\n\nThese cloud mining credits can then be used to mine Bitcoin – significantly streamlining the mining process.\n\nGiven that the Bitcoin mining sector is expected to be valued at over $4.7 billion by 2028, this Stake-to-Mine setup has the potential to tap into a significant and growing market.\n\nMore than 16,500 people now follow Bitcoin Minetrix on Twitter, demonstrating the growing interest in the project’s features.\n\nWith a stellar roadmap containing plans for a dedicated mobile app and cloud mining partnerships, Bitcoin Minetrix could be an altcoin with an exciting future ahead.\n\nVisit Bitcoin Minetrix Presale\n\nSEC ETF Confusion Triggers Altcoin Selloff\n\nAlthough Ethereum and Bitcoin Minetrix are performing well, most coins in the altcoin market are currently experiencing a downturn.\n\nInvestor sentiment appears to have shifted bearish in the past 24 hours, leading to price drops for leading altcoins like Solana (SOL) and XRP (XRP).\n\nAvalanche (AVAX) has been one of the worst-hit altcoins, dropping over 8% in the past 24 hours alone.\n\nThis bearish trend appears to be linked to the ongoing confusion around whether a spot Bitcoin ETF will be launched in the US or not.\n\nOn Tuesday afternoon, the SEC’s official Twitter account was hacked, leading to a fake tweet being posted that said a spot ETF had been given the green light.\n\nHowever, shortly after, SEC chair Gary Gensler announced this was incorrect and that a spot BTC ETF had not yet been approved.\n\nUnsurprisingly, this led to chaos in the crypto market, causing the price of Bitcoin to rally and then drop.\n\nThe volatility spread to the altcoin space, contributing to the sell-off in major coins and tokens.\n\nDisclaimer: The above article is sponsored content; it’s written by a third party. CryptoPotato doesn’t endorse or assume responsibility for the content, advertising, products, quality, accuracy, or other materials on this page. Nothing in it should be construed as financial advice. Readers are strongly advised to verify the information independently and carefully before engaging with any company or project mentioned and do their own research. Investing in cryptocurrencies carries a risk of capital loss, and readers are also advised to consult a professional before making any decisions that may or may not be based on the above-sponsored content.\n\nReaders are also advised to read CryptoPotato’s full disclaimer."
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLWFzLWFuYWx5c3Qtc2F5cy1zYXlzLWV0aC1ldGZzLWFyZS1jb21pbmctaW4tMjAyNC10aW1lLXRvLWJ1eS5odG3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction as Analyst Says ETH ETFs are Coming in 2024 – Time to Buy? - Cryptonews",
        "content": "Ethereum Price Prediction as Analyst Says ETH ETFs are Coming in 2024 – Time to Buy?\n\nThe Ethereum price has surged by 10% in the past 24 hours, rising to $2,656 on the day after the SEC approved its first ever batch of spot-based Bitcoin ETFs.\n\nYet ETH seems to be doing better than most coins today, with its 24-hour gain surpassing the 6% rise the market as a whole has made in the past day.\n\nIt’s now up by 19% in a week and by 98% in a year, with experts now suggesting that the altcoin is the next in line to have spot-based ETFs approved for it in the US.\n\nAnd given ETH’s already-strong fundamentals, 2024 could end up being a very big year for the coin.\n\nEthereum Price Prediction as Analyst Says ETH ETFs are Coming in 2024 – Time to Buy?\n\n\n\nETH is clearly in the middle of a breakout at the moment, with its price shooting well beyond its 30-day average and likely to break its current resistance level (red).\n\nIt will therefore come as little surprise to see that the coin’s relative strength index (purple) has just topped 70, signalling very strong momentum while also leaving room for further gains before we enter overbought territory.\n\nLikewise, the 30-day is now rising more steeply beyond the 200-day average, providing another clear sign that ETH is seeing lots of buying pressure.\n\nIf this weren’t already clear enough, the coin’s trading volume – at around $53 billion – also provides a very strong indicator that ETH has likely begun a bull phase.\n\nIt actually seems that, after buying up Bitcoin (BTC) over the past few weeks, whales have now turned to Ethereum, with data showing some very aggressive accumulating at the moment.\n\nAfter the spot #Bitcoin ETF was approved, this whale continued to borrow $WBTC and exchange it for $ETH. This whale borrowed a total of 621 $WBTC($28.95M) and exchanged it for 11,663 $ETH at a rate of 0.05327. The whale is long the ETH/BTC trading pair!https://t.co/4uE6Lhgjzx pic.twitter.com/4x93OmYRHL — Lookonchain (@lookonchain) January 11, 2024\n\nIndeed, some analysts now predict that it’s only a matter of months before Ethereum benefits from the approval of its own spot-based ETFs in the US.\n\nFor instance, analyst Will Clemente noted yesterday on X that May 23 is the final deadline for the proposed VanEck Ethereum-based ETF.\n\nAs with the now-approved batch of BTC ETFs, these and other ETH ETFs could do wonders for the Ethereum price in the next few months.\n\nAnd when combined with Ethereum’s strong fundamentals as a layer-one blockchain, the launch of such funds could enable ETH to rise to new heights this year.\n\nAs such, now may be the last time to buy ETH this year before it gets too pricey.\n\nEmerging High Potential Altcoins\n\n\n\nFor those who may worry that ETH is heating up too much, there are other promising alts in the market that also have the potential to rally big in the next few weeks.\n\nThis includes Bitcoin Minetrix (BTCMTX), an Ethereum-based stake-to-mine platform that has raised over $8 million in its soon-to-ending presale.\n\nOne of the most interesting new projects in crypto, Bitcoin Minetrix will enable users to mine BTC by staking the platform’s native token, BTCMTX.\n\nUsers who stake BTCMTX will receive tokenized mining credits in return, which they can then spend to pay for Bitcoin mining to take place on their behalf.\n\nOn top of this, staking will also earn them a steady income in the form of BTCMTX, making Bitcoin Minetrix potentially one of the most profitable tokens to hold this year.\n\nThe presale has just entered its nineteenth stage, with investors able to join by going to the official Bitcoin Minetrix website.\n\nAdvantages of #BitcoinMinetrix: Convenient accessibility. Efficient cost structure. 💵 Abundant space and peaceful environment. No concerns about resale value. 🔁 pic.twitter.com/slptHOIHNk — Bitcoinminetrix (@bitcoinminetrix) January 11, 2024\n\nThey can buy BTCMTX at a price of $0.0128 per token, yet this price is likely to rise much higher once the coin lists on exchanges in the next few weeks.\n\nVisit Bitcoin Minetrix NowDisclaimer: Crypto is a high-risk asset class. This article is provided for informational purposes and does not constitute investment advice. You could lose all of your capital."
    },
    {
        "id": 83,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9jcnlwdG9jdXJyZW5jaWVzL25ld3MvZXRoZXJldW0taXMtY29taW5nLWhpZ2hlci1hcy1leHBlY3RlZC0yMDI0MDExMTA4MTbSAWVodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy9ldGhlcmV1bS1pcy1jb21pbmctaGlnaGVyLWFzLWV4cGVjdGVkLTIwMjQwMTExMDgxNg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum is coming higher as expected - FXStreet",
        "content": "Share:\n\nJust three days ago we shared an article about Etherem, where we mentioned and highlighted a corrective movement within uptrend. Ethereum is coming nicely higher as expected and it's now even extending the rally, as Traders Bet on Possible ETH ETF Next. Looking at the 4-hour chart, we can see it coming nicely higher after a completed projected complex W-X-Y correction in wave (4), so wave (5) can be now in progress, which should be completed by a five-wave cycle of the lower degree, so more upside can be seen, at least up to 2700 area or maybe even higher.\n\nGet Full Access To Our Premium Elliott Wave Analysis For 14 Days. Click here."
    },
    {
        "id": 84,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjQvMDEvMTAvdS1zLW1pa2UtY29sbGlucy1kaXNjbG9zZXMtMTEwMDAwLWV0aGVyZXVtLWludmVzdG1lbnQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "U.S. Mike Collins Discloses $110,000 Ethereum Investment - Crypto Times",
        "content": "Georgia’s Representative, Mike Collins, has recently revealed that he invested in Ethereum.\n\nAccording to the latest financial report documents submitted to the U.S. House of Representatives, Collins made two Ethereum (ETH) purchases in early 2024, totaling up to $65,000. This report highlights that he had previously declared an investment of up to $45,000 in Ether during 2023.\n\nFinancial Disclosure Reports Database submitted by Mike Collins\n\nCollins reported investments in Ethereum totaling $110,000 as part of his mandatory financial reports to Congress under the STOCK Act on January 9, 2024.\n\nHis recent transactions include purchasing Ethereum worth $15,000 on January 3 and an additional $50,000 on January 8. This active engagement in cryptocurrency trading dates back to at least 2023.\n\nThe reports align with an 11% rise in Ethereum’s market value over a week. This increase may be linked to expectations about the U.S. SEC’s decision on a Bitcoin ETF."
    },
    {
        "id": 86,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy92aXRhbGlrLWJ1dGVyaW4tYWR2b2NhdGVzLWZvci1tb2Rlc3QtZ2FzLWxpbWl0LWluY3JlYXNlLWluLWV0aGVyZXVtLW5ldHdvcmsuaHRt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Vitalik Buterin Advocates for Modest Gas Limit Increase in Ethereum Network - Cryptonews",
        "content": "Vitalik Buterin Advocates for Modest Gas Limit Increase in Ethereum Network\n\nEthereum co-founder Vitalik Buterin has recommended a “modest” increase in the gas limit to enhance the potential throughput of the Ethereum network. During a Reddit ask-me-anything (AMA) organized by the Ethereum Foundation’s research team, Buterin emphasized that the gas limit has not been raised for nearly three years, marking the longest duration without an increase in the protocol’s history.\n\nVitalik Buterin on Ethereum Gas Fees\n\n\n\nIn response to a question during the AMA, Buterin expressed his view, stating, “Honestly, I think doing a modest gas limit increase even today is reasonable.” He highlighted the historical context, noting that the last increase occurred around late 2021 with the implementation of EIP-1559, which effectively doubled the gas limit but resulted in only a roughly 9% increase in actual average usage.\n\nButerin went on to propose a potential gas limit of around 40 million, suggesting a 33% increase from the current 30 million gas limit reported by Etherscan. He explained that allocating the gains from Moore’s law post-2021 between increased capacity and enhanced ease of syncing and verification would justify such an increase.\n\nThe Ethereum gas limit, a crucial parameter that influences the network’s capacity for processing transactions and executing smart contracts, has evolved. Buterin’s suggestion aims to strike a balance between accommodating the growing demand on the Ethereum network and ensuring efficient syncing and verification processes.\n\nAs Ethereum continues to advance and undergo network upgrades, decisions regarding parameters like the gas limit play a crucial role in maintaining a healthy and scalable blockchain ecosystem. The proposal for a modest increase aligns with ongoing efforts to optimize Ethereum’s performance and adapt to changing demands.\n\nEthereum Gas Fees Surge Again, Averaging Around 35 Gwei Amid Increased Network Activity\n\n\n\nThe cost of transacting on the Ethereum network, measured by gas prices, has seen a surge, currently averaging around 35 gwei, or $1.89, according to Etherscan. This increase has been notable since the beginning of 2024, with higher fees observed for complex smart contract operations.\n\nEthereum gas fees reached a peak of 150 gwei in May 2023 during the NFT craze. The scalability debate was reignited in November 2023 as fees surged amid another wave of NFT-related activity. Data from Ycharts indicates a 141% increase in Ethereum gas fees over the past year, reaching a current fee of 0.9084 USD/tx.\n\nThe rising fees on Ethereum have led users to explore alternative solutions, with layer-2 solutions like Arbitrum gaining popularity due to their promise of faster and cheaper transactions. Ethereum’s modular approach to scalability may take time to materialize fully, prompting users to seek more immediate alternatives.\n\nOne potential solution to address high fees is the EIP-4844 upgrade, designed to make it cost-effective to send layer-2 data to the mainnet using blobs. The EIP-4844 upgrade is expected to go live in the first half of 2024.\n\nFrom a price perspective, Ethereum recently surpassed the $2,130 resistance level that had held for over a year. However, the momentum has slowed, and the price is currently consolidating below the $2,600 level."
    },
    {
        "id": 87,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLWFzLWluZmxvd3Mtc3VyZ2UtdG8tMjktbWlsbGlvbi1jYW4tZXRoLWhpdC01MDAwLXRoaXMtbW9udGguaHRt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction as Inflows Surge to $29 Million – Can ETH Hit $5,000 This Month? - Cryptonews",
        "content": "Ethereum Price Prediction as Inflows Surge to $29 Million – Can ETH Hit $5,000 This Month?\n\nThe Ethereum price has bounced by 5% in the past 24 hours, hitting $2,411 as the cryptocurrency market as a whole has actually dipped by 0.1%.\n\nETH’s move today means it is now up by 1.5% in a week and by 7.5% in the last 30 days, with the biggest altcoin in the market also sitting on an 81% gain in the past year.\n\nThese moves come as weekly Ethereum inflows top $29 million, according to the latest CoinShares data, making ETH the most popular altcoin among funds.\n\nAnd with the market hoping for a big surge in the event of Bitcoin ETF approvals today, the Ethereum price could rally strongly very soon.\n\nEthereum Price Prediction as Inflows Surge to $29 Million – Can ETH Hit $5,000 This Month?\n\n\n\nMore than most other major coins, ETH really looks like it’s on the brink of making strong price gains in the next few days.\n\nIts RSI (purple) has just risen back up to 60, a sure sign of increasing momentum, particularly after the indicator dropped below 50 a few days ago.\n\nAt the same time, ETH’s 30-day average is climbing more steeply again after slacking in recent days, another indicator that buying pressure is growing for the coin.\n\nOne of the encouraging signs as far as ETH is concerned, is that its support level (green) has risen consistently in recent weeks, implying that even if it doesn’t rally continuously, it’s not going to fall hard anytime soon.\n\nAnd as the latest CoinShares report makes clear, ETH is the most popular alt in the market this week, with its inflows comfortably exceeding those of its nearest rival, Cardano (ADA).\n\n🟢 2024 is off to a strong start, with US$151 million in inflows! Total inflows since the Grayscale vs SEC lawsuit now stand at US$2.3 billion. Notable asset inflows include:$BTC: US$113m inflows$ETH: US$29m inflows$ADA: US$3.7m inflows$AVAX: US$2m inflows$LTC: US$1.4m… pic.twitter.com/9wfshmqxsB — CoinShares (@CoinSharesCo) January 8, 2024\n\nIt’s possible that the market is getting excited about ETH because it could be one of the main beneficiaries in the event that the SEC approves Bitcoin ETFs today, which many think is likely.\n\nIf the regulator does approve Bitcoin ETFs, it’s possible that Ethereum ETFs could follow sooner or later, something which would obviously be a major win for Ethereum.\n\nYet Ethereum’s fundamentals are so strong that it’s more than capable of continuing to rise with ETFs.\n\nIt still accounts for more than half of the total value locked of the entire crypto sector, with the platform attracting the biggest adopters last year, including PayPal and Coinbase.\n\nAs such, 2024 is likely to be another good year for the Ethereum price, which could hit $3,000 in the next few months.\n\nOther High-Potential Altcoins for Big Gains\n\n\n\nTraders looking for lower cap alternatives to ETH may be interested in looking at newer alts and presale tokens, which can often rally big when listing on exchanges for the first time.\n\nOne coin likely to do this is Bitcoin ETF Token (BTCETF), a deflationary ERC-20 cryptocurrency that has raised close to $5 million in its presale, which has now closed.\n\nMajor players like @BlackRock, @ARKInvest, and more are adjusting their filings for a US #Bitcoin #ETF, now leaning towards cash redemption over in-kind transactions. The #SEC's stance signals a shift. What's your take on this regulatory move?#BitcoinETF hits beyond the $4.8… pic.twitter.com/bxixnW8m3T — BTCETF_Token (@BTCETF_Token) December 19, 2023\n\nDespite its sale running for only a short period of time, Bitcoin ETF Token was able to raise so much money because of its highly deflationary tokenomics.\n\nNamely, the coin set to burn 25% of its max supply over the course of its lifespan, burning this amount in five 5% instalments, as well as through a transaction tax.\n\nThe first of these will come when an SEC-approved Bitcoin ETF gains a trading volume of more than $100 million, and with the SEC likely to approve its first ever BTC ETF today, this milestone could arrive sooner rather than later.\n\nBy burning 25% of its supply, Bitcoin ETF Token will experience steadily rising demand, which could push its price up increasingly higher.\n\n#BitcoinETF Token Announcement! 📣 We can proudly announce that around 21 million #Tokens worth over $100K have been burnt through transaction taxes! This is also the equivalent of #Bitcoin's total supply! 🌐 pic.twitter.com/D8z2nvj4rG — BTCETF_Token (@BTCETF_Token) January 3, 2024\n\nWhile its presale has now closed, participants can begin to claim and stake their purchased tokens.\n\nAnd given that holders can stake BTCETF, it could end up being a very deflationary token, with much of its original supply being taken out of circulation.\n\nIn turn, its tokenomics could help it have one of the biggest exchange listings of the year, so new investors are advised to act quickly once it does list.\n\nVisit Bitcoin ETF Token NowDisclaimer: Crypto is a high-risk asset class. This article is provided for informational purposes and does not constitute investment advice. You could lose all of your capital."
    },
    {
        "id": 88,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNvaW50cmlidW5lLmNvbS9lbi9ldGhlcmV1bS1ldGgtZW1lcmdlcy1mcm9tLXRoZS1zaGFkb3dzLWNyeXB0by1hbmFseXNpcy1vZi1qYW51YXJ5LTExLTIwMjQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) emerges from the shadows: Crypto Analysis of January 11, 2024 - Cointribune EN",
        "content": "Thu 11 Jan 2024 ▪ 4 min of reading ▪ by Family Trading ▪\n\nThe price of Ethereum has crossed the upper limit of its range, propelling it towards a new high. Let’s examine the future prospects for ETH together.\n\nEthereum (ETH) Situation\n\nThe price of Ethereum was stuck in a range for more than a month. This period of consolidation ended, stimulated by the approval of the first Bitcoin spot ETFs by the SEC. As a result, ETH broke through its previous peak at $2,400, reaching the level of $2,600. It’s also important to mention that the CME Ethereum contract is on the verge of filling its bearish gap dating back to May 2022.\n\nThus, the recent fluctuations in Ethereum indicate that the bullish trend continues. This assertion is supported by the upward orientation of the 50 and 200 day moving averages. On the oscillators side, they remain above the median threshold. This signals a bullish momentum. However, a potential bearish divergence with ETH’s price suggests a slowdown in this dynamic, which could signal an upcoming period of consolidation or decline.\n\nETH/USD price chart on daily timeframe\n\nThe current technical analysis has been carried out in collaboration with Elie FT, an investor and passionate trader in the cryptocurrency market. Now a trainer at Family Trading, a community of thousands of proprietary traders active since 2017. You will find Lives, educational content and support around financial markets in a professional and warm atmosphere.\n\nFocus on Derivatives (ETHUSDT)\n\nThe open interest in Ethereum saw a significant rise of over 35% in two days. This increase started from $2,240. This surge represents the addition of over $1 billion on Ethereum’s perpetual contracts. Given that Ethereum’s trend is bullish, we can conclude that the majority of traders were anticipating a continuation of this upward trend. This assumption is reinforced by the fact that significant liquidations of short positions did not have a notable effect on the open interest.\n\nETHUSD Open Interest\n\nAssumptions for the Ethereum (ETH) Price\n\nIf the price of Ethereum maintains above $2,400, we could anticipate a bullish continuation up to the $2,700 level. The next resistance to consider, if the upward movement continues, would be the threshold of $29,000 to even $3,000. At this stage, this would represent an increase close to +17%.\n\nIf the price of Ethereum fails to hold above $2,400, we could envision a fallback to $2,140. The next support to consider, if the downtrend continues, would be more or less around the $2,000 level. At this stage, this would represent a decrease close to -23%.\n\nConclusion\n\nJust like its parent cryptocurrency, Ethereum is starting the year 2024 with notable volatility, partly due to the excitement related to the highly anticipated SEC decision regarding Bitcoin spot ETFs. On this matter, the question arises: After Bitcoin ETF, is it Ethereum’s turn? What is certain is that it will be crucial to carefully observe the price reaction at the various key levels to confirm or refute the current assumptions. It’s also important to stay vigilant about potential “fake outs” and market “squeezes” in each scenario. Finally, let’s remember that these analyses are based solely on technical criteria, and cryptocurrency prices can also move rapidly due to other more fundamental factors.\n\nMaximize your Cointribune experience with our 'Read to Earn' program! Earn points for each article you read and gain access to exclusive rewards. Sign up now and start accruing benefits.\n\nClick here to join 'Read to Earn' and turn your passion for crypto into rewards!\n\nA A Lien copié"
    },
    {
        "id": 89,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vZmluYm9sZC5jb20vbWFjaGluZS1sZWFybmluZy1hbGdvcml0aG0tc2V0cy1ldGhlcmV1bS1jbGFzc2ljLXByaWNlLWZvci1qYW51YXJ5LTMxLTIwMjMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Machine learning algorithm sets Ethereum Classic price for January 31, 2023 - Finbold - Finance in Bold",
        "content": "In 2016, the DAO, an Ethereum-based entity, suffered a $150 million worth code exploit later known as “the DAO hack.” The community performed a hard fork to recover the funds, causing a split into Ethereum (ETH) and Ethereum Classic (ETC).\n\nNotably, the Ethereum Classic surged from the most purist supporters, positioned against the hard fork to preserve the chain’s irreversibility. However, the reversed blockchain won the market competition, keeping the original name and the ticker ETH — further attracting more capital.\n\nIn 2022, Ethereum hard-forked again with “The Merge,” moving from a proof-of-work to a proof-of-stake network. Therefore, miners and proof-of-work supporters migrated to the classic chain, now with greater relevance.\n\nETC is currently trading at $29.50, surging by more than 41% since the Bitcoin ETF approval that moved the entire cryptocurrency market. In particular, the classic version reached a local high at $32.16 on January 11, still far behind the biggest chain.\n\nEthereum Classic (ETC) 4-hour price chart. Source: TradingView\n\nEthereum Classic (ETC) could reach $44 on January 31\n\nInterestingly, CoinCodex’s machine learning algorithm believes ETC will continue its bull rally. Data retrieved by Finbold at the time of publication shows a forecasted price of $44.41 on January 31.\n\nEthereum Classic (ETC) price prediction. Source: CoinCodex\n\nThis projection would mean another 50% increase in Ethereum Classic from current prices. Meanwhile, the artificial intelligence believes ETC can reach even higher levels at $53 per token a few days before.\n\nIt is important to understand that Ethereum Classic has a significantly low hashrate and a smaller Web3 ecosystem. Essentially, ETC still faces security risks and lower adoption compared to Ethereum, challenging its growth in the competitive cryptocurrency market.\n\nAll things considered, the accuracy of the above projection will depend on the project’s ability to attract demand. Investors must remain cautious and correctly evaluate the risks and opportunities of Ethereum Classic.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 90,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyNC8wMS8xMC9ldGhlcmV1bS1jby1mb3VuZGVyLWpvc2VwaC1sdWJpbi1zYXlzLWdpYW50LWFtb3VudC1vZi1tb25leS1vbi1zaWRlbGluZXMtd2FpdGluZy1mb3ItY3J5cHRvLWV0ZnMv0gGGAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDI0LzAxLzEwL2V0aGVyZXVtLWNvLWZvdW5kZXItam9zZXBoLWx1YmluLXNheXMtZ2lhbnQtYW1vdW50LW9mLW1vbmV5LW9uLXNpZGVsaW5lcy13YWl0aW5nLWZvci1jcnlwdG8tZXRmcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Co-Founder Joseph Lubin Says ‘Giant Amount of Money’ on Sidelines Waiting for Crypto ETFs - The Daily Hodl",
        "content": "Consensys CEO and Ethereum (ETH) co-founder Joseph Lubin says there’s a massive amount of sidelined capital waiting for crypto exchange-traded funds (ETFs) to hit the market.\n\nIn an interview with CNBC, Lubin says there are hundreds of billions of dollars sitting in the hands of professionals in the traditional finance industry waiting for easier, regulated exposure to digital assets via an ETF.\n\n“There is so much money on the sidelines managed by registered investment advisors (RIAs) in different kinds of funds like retirement funds and companies that want to access the technology, that want to gain exposure to these uncorrelated assets or digital asset classes.\n\nAnd so there was a bit of a run-up by speculators in our own industry in the price of Bitcoin anticipating these ETFs and soon hopefully an Ethereum ETF, but the point is, there’s a giant amount of money – hundreds of billions of dollars on the sidelines that’s waiting to get in and get exposure to this asset class.”\n\nLubin says although the SEC doesn’t directly reveal any of its plans or intentions to the Ethereum Foundation, after Bitcoin (BTC), he thinks ETH is likely the next best candidate for a spot ETF approval from the regulator.\n\n“Ethereum is arguably the most mature ecosystem, the deepest ecosystem. As a platform for decentralized applications, there’s just so much infrastructure and activity around the world. Bitcoin is a narrower technology but it’s a reasonably mature technology so they’re both prime candidates.\n\nSolana is a great technology but it’s not a mature ecosystem yet.”\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on Twitter, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/laskoart/Andy Chipus"
    },
    {
        "id": 92,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vd3d3LmFsdGNvaW5idXp6LmlvL3Jldmlld3MvMTAtZXRoZXJldW0tYXBwcy10by13YXRjaC1pbi0yMDI0LXBhcnQtMi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "10 Ethereum Apps to Watch in 2024 - Part 2 - Reviews - Altcoin Buzz",
        "content": "Today, we continue our two-part article series on Ethereum apps. To recap, we reveal 10 Ethereum apps to watch in 2024. These 10 apps all serve very different purposes. And, I’m sure that you, as a user, will find one that’s just right for you.\n\nBefore we begin, do check out the first part of this article series here. If you’ve done so, let us check out App #6 below.\n\n6) Daylight\n\nNumber 6 of the Ethereum apps we’re watching in 2024 is Daylight. Daylight’s main product is an Application Programming Interface (API). In short, an API provides a way for two programs to talk to each other. Daylight’s API does just that, for:\n\nWallets.\n\nTools.\n\nCreators.\n\nPost-transaction recommendations are now live on @daylight! After someone transacts, we surface the top 3 mints they are most likely to do based on our relevance data: social graph, holdings, etc. Next year, we will power this in our app partners to increase engagement. pic.twitter.com/Q3JAMXleJc — Kyle McCollom ☀️ (@kylemccollom) December 22, 2023\n\nBut, what does Daylight’s API do exactly? Well, its API focuses on recommendations. For instance, let’s say you mint an NFT from a collection. With this data, Daylight’s API recommends another three other NFT collections that you may like. Hence, you’ll find more NFTs that suit your preference.\n\nDaylight isn’t just for NFTs though. Said API can be integrated within wallets or apps. In turn, this creates a lot of potential use cases. With your transaction data, Daylight helps you find more of what you like in crypto.\n\n7) Dookey Dash\n\nNumber 7 of our 10 Ethereum apps is Dookey Dash. The creator of this game is the renowned Yuga Labs. Yes. That’s the same team behind blue-chip NFT projects like Bored Ape Yacht Club (BAYC) and CryptoPunks.\n\nI love to play with numbers. In some of these games, I concede defeat when trying to achieve top ranks. So, I make self-achievements like matching my lb rank with token ID. Got close with @yugalabs #DookeyDash REAL close with @10KTFshop Bell rankinghttps://t.co/taQOZqc2eX pic.twitter.com/8Vzfykwqsk — 🇨🇦𝐂𝐃𝐍 (@CDNHODLer) January 5, 2024\n\nIn summary, Dookey Dash is an NFT game. One that is simple but requires skills and reflexes. As you can see from the video above, you’ve got to dodge a ton of obstacles. At the same time, you’ve got to collect items too. The longer you last in the game, the higher the points you get.\n\nSadly, the game is not open to the public at the moment. But, you can follow the Yuga Labs Twitter account. Once the game is back, they’ll announce it. You can then try it out first-hand.\n\n8) Unlonely\n\nNow, if you aren’t into just having fun yourself, check out Unlonely. It’s one of the more fun Ethereum apps you can use. That’s because it links you up with others on the livestream. So, it’s similar to a “Web 3 Twitch” platform. Indeed, any lonely person with this app will for sure feel “Unlonely”.\n\nwe’re cooking… let us cook 👩🏼‍🍳🤌 if you’re new to love on leverage and weren't able to catch everything live (or just miss us too much already), here’s a one stop shop to tide you over until the next one ❤️‍🔥 pic.twitter.com/7IFCPz2vcS — 🟢 Live on Unlonely (@unlonely_app) October 18, 2023\n\nWell, of course, Unlonely isn’t all about just watching each other online. You can participate in prediction markets too! All while on the live stream. So, you can bet if a couple will go on another date or not. Or, you can bet on live sports results. The possibilities are endless here. Hence, if you frequently use Twitch, do check Unlonely out too!\n\n9) Hypersub\n\nNext is Hypersub, one of many NFT Ethereum apps. Hypersub is an NFT subscription platform. But unlike other apps, it has a special feature that you might or might not like. It grants NFT creators the ability to add an expiration date to their NFTs. So, you could be the owner of an NFT you like, but only for a limited time.\n\n9. hypersub @withfabricxyz a nft subscription platform. although still nascent, i think the idea of adding a time expiration for creators is really special. creators usually get the short-end of the stick when offering \"lifetime\" access to their offering. pic.twitter.com/DGwWeVzscj — 0xDesigner (@0xDesigner) December 28, 2023\n\nWith this feature, Hypersub can attract many NFT creators. Two of which showcase their work in the above tweet.\n\n10) Spinamp\n\nLast but not least, we’ve got Spinamp. It’s a leading project amongst music Ethereum apps, simply because it works well. It plays good music and it’s got a great app. And, it’s got a pipeline of artists launching their work here.\n\nSo many people still going to OpenSea to listen to the entire @RaverRealm soundtrack … Found out that all of the songs are found on @spin_amp on a DOPE player Hehe have this entire playlist on repeat today baby 🤤 pic.twitter.com/J3nG7UzRuq — Jadyn Violet | Text me 732-655-2159 (@jadynviolet) November 27, 2023\n\nIndeed, Spinamp has built an app that truly brings value to its users on-chain. But, no amount of words can describe beautiful music. Hence, we urge you to give the Spinamp app a try. You can download the app here. It’s available for iOS, Android, and Desktop.\n\nConclusion\n\nTa-da! We’ve shown you the 10 Ethereum apps to watch for 2024! But sometimes, just watching the apps doesn’t make sense. You’ve got to download one that suits you and then try it out. By doing so, you’re also contributing to the Web 3 ecosystem as well.\n\nNote: This article was inspired by this tweet.\n\nDisclaimer\n\nThe information discussed by Altcoin Buzz is not financial advice. This is for educational, entertainment, and informational purposes only. Any information or strategies are thoughts and opinions relevant to the accepted levels of risk tolerance of the writer/reviewers and their risk tolerance may be different than yours. We are not responsible for any losses that you may incur as a result of any investments directly or indirectly related to the information provided. Bitcoin and other cryptocurrencies are high-risk investments so please do your due diligence. Copyright Altcoin Buzz Pte Ltd."
    },
    {
        "id": 93,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy91cy1sYXdtYWtlci1ldGgtcHVyY2hhc2XSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "US lawmaker reports ETH purchases up to $65K in 2024 - Cointelegraph",
        "content": "According to disclosure documents filed with the U.S. House of Representatives, Georgia Representative Mike Collins purchased up to $65,000 worth of Ether (ETH) in 2024.\n\nAccording to a Jan. 9 filing with the House’s Financial Disclosure Reports Database, Rep. Collins revealed he had purchased up to $15,000 worth of ETH on Jan. 3 and up to $50,000 worth of the token on Jan. 8. The U.S. lawmaker has been trading ETH since at least 2023 according to similar filings, reporting total purchases up to $110,000.\n\nSource: Financial Disclosure Reports Database, U.S. House of Representatives\n\nUnder the Stop Trading on Congressional Knowledge Act, or STOCK Act, U.S. lawmakers are largely required to report investments to Congress. However, they are still permitted to oversee or propose legislation on matters potentially related to their investments, which many have called a potential conflict of interest between their public service and personal wealth.\n\nCollins’ ETH purchases came as the token’s price surged more than 11% in the last seven days, from roughly $2,200 on Jan. 3 to $2,466 at the time of publication. Some experts have speculated that ETH could rally in response to the U.S. Securities and Exchange Commission potentially approving a spot Bitcoin (BTC) exchange-traded fund for the first time — an event expected by Jan. 10.\n\nRelated: US lawmakers introduce bipartisan bill proposing ban on members investing in ‘financial instruments’\n\nThe disclosure filings came roughly nine days before the U.S. government is set to shut down should Congress fail to pass a spending bill before Jan. 19. Previous shutdowns have created ripples across markets, including cryptocurrencies, partly due to economic uncertainty.\n\nRepublican Party candidates for the 2024 U.S. Presidential Election will face off in Iowa on Jan. 10 for the first debate of the election season. Pro-crypto candidate Vivek Ramaswamy, who polled roughly 6% in Iowa, will not appear on the debate stage against Florida Governor Ron Desantis and Nikki Haley.\n\nMagazine: How to protect your crypto in a volatile market: Bitcoin OGs and experts weigh in"
    },
    {
        "id": 94,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmFsdGNvaW5idXp6LmlvL2NyeXB0b2N1cnJlbmN5LW5ld3Mvdml0YWxpay1idXRlcmluLXByb3Bvc2VzLWNoYW5nZXMtdG8tZXRoZXJldW1zLWdhcy1saW1pdHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Vitalik Buterin Proposes Changes to Ethereum's Gas Limits - - Altcoin Buzz",
        "content": "The Ethereum Foundation’s Research Team recently had a Reddit AMA where Vitalik Buterin, co-founder of Ethereum, proposed changing the network’s gas limit.\n\nCiting the greatest period of stagnancy in Ethereum’s history—nearly three years—Buterin suggested a 33% increase in the gas limit, possibly reaching 40 million. Let’s discover more about this important news.\n\nVitalik Buterin Advocates Gas Limit Modifications in Ethereum\n\nThis change attempts to increase the network’s throughput capacity, as opposed to the existing 30 million limit per Etherscan.\n\nShortly after Ethereum’s genesis in 2015, the average gas limit was approximately 3 million. This limit has grown over time in pace with adoption and network usage. According to Etherscan, the average gas price is currently 35 gwei, or $1.89. However, there has been a price increase since the new year for complicated smart contract operations.\n\n🚨BREAKING 🚨 VITALIK BUTERIN URGES FOR AN INCREASE IN ETHEREUM GAS LIMIT AFTER NEARLY THREE YEARS. pic.twitter.com/BpuxvqdWsV — Bullion (@Bullionclb) January 11, 2024\n\nThis proposed modification has significant effects on Ethereum’s performance. It goes beyond being a numerical tweak. For a start, the gas limit is an essential component of Ethereum’s architecture. It sets the maximum amount of gas that can be used to execute transactions or smart contracts on a block.\n\nEthereum requires gas fees for transactions or executing contracts on the chain. One of the benefits of the gas limit is that it prevents excessively large blocks. This can affect network synchronization and performance.\n\nSlightly higher hardware requirements and increased block processing time pic.twitter.com/i0W9SYNdGj — cygaar (@0xCygaar) January 10, 2024\n\nAnother core benefit of increasing the gas limit is that it would allow more transactions into each block. Thus, it increases the network’s capacity and throughput. But it also raises the possibility of network spam and attacks, as well as increasing the hardware load.\n\nIt is safe to say that Buterin’s proposal is a dilemma between boosting transactional capacity and sustaining network stability.\n\nDisclaimer\n\nThe information discussed by Altcoin Buzz is not financial advice. This is for educational, entertainment and informational purposes only. Any information or strategies are thoughts and opinions relevant to accepted levels of risk tolerance of the writer/reviewers, and their risk tolerance may be different from yours.\n\nWe are not responsible for any losses that you may incur as a result of any investments directly or indirectly related to the information provided. Bitcoin and other cryptocurrencies are high-risk investments, so please do your due diligence.\n\nCopyright Altcoin Buzz Pte Ltd."
    },
    {
        "id": 95,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy92YWxreXJpZS1jaW8tc2F5cy1tYXJrZXQtbWF5LXNlZS1yaXBwbGUtZXRoZXJldW0tZXRmcy1uZXh0Lmh0bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Valkyrie CIO Says Market May See Ripple, Ethereum ETFs Next - Cryptonews",
        "content": "Valkyrie CIO Says Market May See Ripple, Ethereum ETFs Next\n\nValkyrie Funds Chief Investment Officer Steven McClurg says it wouldn’t be surprising if a Ripple and Ethereum spot exchange-traded fund (ETF) came to the market speaking in an interview with Bloomberg TV.\n\n“It wouldn’t surprise me if we saw Ripple or Ethereum spot ETFs out there,” said McClurg. The CIO went on to add that Grayscale recently added XRP to their publicly traded which in turn shows that there is interest.\n\nMcClurg believes that the US Securities and Exchange Commission will approve spot Bitcoin ETFs on Wednesday.\n\n“The SEC will deem the ETFs effective at close of business Wednesday and the trading to begin on Thursday morning,” McClurg said in an interview.\n\nDozen Applications in Pipeline\n\nSo far, there are nearly a dozen spot Bitcoin ETF hopefuls who are significantly dropping their management fees in hopes of beating out their competitors, yet another sign of imminent approval.\n\nAccording to Bloomberg Intelligence ETF analyst James Seyffart, Fidelity lowered their fees to 0.25% from the previous 0.39% and has offered a fee waiver to 0% through July 31.\n\nIncluding Fidelity, 5 out of the 11 issuers have revised their fee structures or offered temporary waivers after they received feedback from the U.S. Securities and Exchange Commission on Jan. 8.\n\nWith the previously lowest fee of 0.24% offered already, Bitwise reduced it to 0.20% with a waiver to 0% for 6 months or 1 billion; Wisdomtree lowered its fee of 0.50% to 0.30% also with a waiver to 0% for 6 months or 1 billion.\n\nSEC’s X Account Hacked\n\n\n\nEarlier today, when the SEC’s X account shared a false tweet suggesting the approval of spot Bitcoin (BTC) ETF in the US. The excitement in the crypto community was short-lived as Chair Gary Gensler quickly revealed that the SEC’s X account had been compromised, and the tweet was unauthorized.\n\nFollowing the false SEC announcement, the cryptocurrency market was marked by heightened sensitivity to regulatory actions, Bitcoin’s price experienced a notable dip to $46,000, reflecting nearly 1.50% decrease on Wednesday."
    },
    {
        "id": 96,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLW9pLXNvYXJzLWFzLWZha2UtZXRmLWFwcHJvdmFsLXNlbmRzLWJpdGNvaW4tZnV0dXJlcy1kaXZpbmcv0gFdaHR0cHM6Ly9jb2luZ2FwZS5jb20vZXRoZXJldW0tb2ktc29hcnMtYXMtZmFrZS1ldGYtYXBwcm92YWwtc2VuZHMtYml0Y29pbi1mdXR1cmVzLWRpdmluZy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Fake ETF Approval: Ethereum OI Soars As Fake ETF Approval Sends Bitcoin Futures Diving - CoinGape",
        "content": "A fake approval post from the SEC regarding a Spot Bitcoin ETF sent shockwaves through the crypto market, impacting both Bitcoin and Ethereum Open Interest (OI). In addition, this incident triggered a volatile day for Bitcoin prices, which in turn led to a significant drop in Bitcoin Futures Open Interest (OI).\n\nHowever, amid a slip in Bitcoin OI, the Ethereum Futures Open Interest witnessed an unprecedented surge, indicating a shift in market sentiment.\n\nadvertisement\n\nEthereum OI Soars As BTC Faces Backlash Amid Fake ETF Approval Drama\n\nThe SEC found itself embroiled in controversy after an unauthorized post on its official X handle falsely claimed approval for a Spot Bitcoin ETF. This misinformation sparked enthusiasm among crypto enthusiasts, only to be quelled when SEC Chair Gary Gensler clarified that no such approval had been granted, revealing a compromised official handle.\n\nMeanwhile, as a consequence, the crypto community expressed strong dissatisfaction, accusing the U.S. SEC of market manipulation. Notably, according to CoinGlass data, Bitcoin Futures Open Interest plummeted by 3.29% over the last 24 hours to 431.76K BTC or $19.69 billion, reflecting the impact of the misleading information on investor confidence.\n\nIn contrast, while Bitcoin faced a downturn, Ethereum emerged as a resilient player in the market. Ethereum Futures Open Interest witnessed an impressive surge of 12.08% over the past 24 hours, reaching 3.33 million ETH or $8.05 billion. This surge was mirrored on various platforms, with Binance recording a 10.39% increase and Bybit experiencing a remarkable 16.07% jump in Ethereum OI.\n\nAlso Read: BlackRock and ARK 21Shares Slash Bitcoin ETF Fees In New S-1 Filings\n\nPrice Changes Amid Market Turbulence\n\nThe crypto market was down on Wednesday, which several experts attributed to the recent SEC chaos. Meanwhile, as of writing, the global crypto market cap was down 1.14% to $1.71 trillion, while the trading volume ticked up 2.81% to $83.95 billion.\n\nNotably, the Bitcoin price was down 3.74% to $44,915.91 during writing, after hitting a high of $47,898.70 in the last 24 hours. On the other hand, the Ethereum price noted gains of 3.17% over the last 24 hours and traded at $2,371.42. Notably, the ETH has touched a high of $2,410.96 today.\n\nMeanwhile, this contrasting performance between Bitcoin and Ethereum indicates a dynamic shift in investor sentiment. As Bitcoin grapples with the aftermath of the fake spot Bitcoin ETF approval saga, Ethereum appears to be gaining momentum, attracting renewed interest and investment within the crypto space.\n\nAlso Read: Binance Delists BTC, ETH, BNB, LTC, FLOKI Spot Trading Pairs"
    },
    {
        "id": 97,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vZGVjcnlwdC5jby8yMTI0NzgvYml0Y29pbi1ldGZzLWFyZS1oZXJlLXdoZW4tZXRoZXJldW0tZXRm0gFHaHR0cHM6Ly9kZWNyeXB0LmNvLzIxMjQ3OC9iaXRjb2luLWV0ZnMtYXJlLWhlcmUtd2hlbi1ldGhlcmV1bS1ldGY_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin ETFs Are Here—When Ethereum ETF? - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe first step is always the hardest.\n\nAfter years of repeated rejections, the Securities and Exchange Commission has finally approved its first spot Bitcoin ETFs—a seismic development that analysts say amounts to formally integrating Bitcoin with the global economy.\n\nIt’s a historic achievement—one that finally provides a way for Wall Street retail investors to gain direct exposure to Bitcoin without the need to fuss with cryptocurrency exchanges or wallets. And it might not just be good for Bitcoin.\n\nAD\n\nAD\n\nExperts now believe the SEC’s acquiescence could have opened the door to the approval of other crypto-backed spot ETFs, namely a spot Ethereum ETF. And thanks to the precedent set by a Bitcoin ETF, that financial product could enter the market in a matter of months, not years.\n\nEric Balchunas, a senior ETF analyst at Bloomberg, says he is 70% confident that a spot ETH ETF will be approved by May.\n\nHow could that be, when it took Bitcoin years to accomplish the same feat? Further, hasn’t the SEC repeatedly signaled that it is far more skeptical of Ethereum than of Bitcoin?\n\nDuring an appearance on Rug Radio’s FOMO Hour late last week, Balchunas said it all comes down to legal strategy. After the SEC approved a Bitcoin futures ETF in 2021, Grayscale sued the federal regulator, arguing it couldn’t arbitrarily approve a BTC futures ETF and reject a spot BTC ETF at the same time.\n\nFutures ETFs track the price of derivatives contracts, which themselves grant the buyer the ability to buy or sell Bitcoin at a later date. No Bitcoin is actually bought and sold when futures ETFs are bought and sold. Spot ETFs are different, and their issuers—BlackRock, Fidelity, Grayscale, and many more—do actually buy and store Bitcoin on behalf of their clients.\n\nAD\n\nAD\n\nWhen it comes to how they should be treated by the SEC, Grayscale argued in court that it shouldn’t make a difference—and won. Shortly thereafter, backed into a corner, the SEC changed its tune on spot Bitcoin ETFs.\n\nThe SEC now appears to be in a similar situation with Ethereum, Balchunas believes, given that the agency approved its first Ethereum futures ETFs in October.\n\n“Ipso facto, you have to approve an Ether spot [ETF], or you’re going to get sued again for the same exact reason,” the analyst explained during a Rug Radio appearance late last week.\n\nOther analysts share that optimism. In a report released earlier this week, British multinational bank Standard Chartered predicted that a spot Ethereum ETF is likely to gain approval by Q2 of this year.\n\nJames Butterfill, head of research at digital asset investment firm CoinShares, concurs.\n\n“Given that the SEC has treated both BTC and ETH in a very similar way, it is highly likely [that approval comes] Q2 this year,” he told Decrypt.\n\nBolstering that confidence is the stature of the applicants who’ve already lined up to list a spot ETH ETF. In November, Wall Street behemoth BlackRock threw its weight behind a spot ETH ETF application; the asset manager’s entrance to the spot Bitcoin ETF race last summer was widely considered a major boon for the financial product’s prospects.\n\n“These are not… minor companies,” Adam Berker, senior legal counsel at global payments platform Mercuryo, told Decrypt. “These requests originate from high-profile entities like BlackRock and Grayscale, both of which have considerable influence and a robust operational history.”\n\nAD\n\nAD\n\nOthers still in the crypto industry, however, feel that a spot Ethereum ETF isn't quite said and done—yet. William Quigley, co-founder of stablecoin Tether, believes the inescapable differences between smart contract-less Bitcoin, and the complex, multilayer Ethereum ecosystem could easily have an impact on proceedings.\n\n“Timing for an Ethereum ETF is hard to predict since it is a more complex technology platform than the Bitcoin blockchain, and therefore presents more potential risks from the SEC’s perspective,” Quigley told Decrypt.\n\nThat vast technical contrast between Bitcoin and Ethereum cuts both ways, though. Whenever a spot Ethereum ETF is eventually approved, Quigley believes, the product will prove immensely attractive to Wall Street investors eager to get a piece of the vast and incredibly active Ethereum ecosystem.\n\n“If Bitcoin is a lemonade stand, then Ethereum is a money center bank,” said Quigley. “Ethereum is more complex, has far more activity from its tens of thousands of active smart contracts and the layer 2 blockchains using it—and [Ethereum-based] tokens dominate the token trading ecosystem,” he said.\n\nWhat does that mean for Wall Street’s appetite for an Ethereum ETF? “It's easy to see that institutional demand will be strong,” Quigley said."
    },
    {
        "id": 98,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtanVtcHMtMTE0LWhlcmVzLWhvdy13aGFsZXMtYXJlLWNoYW5naW5nLWdhbWXSAU1odHRwczovL3UudG9kYXkvZXRoZXJldW0tZXRoLWp1bXBzLTExNC1oZXJlcy1ob3ctd2hhbGVzLWFyZS1jaGFuZ2luZy1nYW1lP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Jumps 11.4%, Here's How Whales Are Changing Game - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThere is ongoing mega accumulation of Ethereum (ETH) by whales within the crypto ecosystem. According to data from the crypto analytics platform Lookonchain, a whale with the wallet address \"0xAA15\" withdrew a total of 5,762 ETH worth approximately $15.06 million from Binance earlier today. Overall, this whale has bought a total of 50,733 ETH $99.2 million at an average price of $1,955 since Sept. 19, 2023.\n\nAdvertisement\n\nPer the Lookonchain outlook, another whale, \"0x9314\" also spent 7.29 million USDT to buy 2,800 ETH today, joining the host of accumulations of the second-largest cryptocurrency about two hours ago. This particular whale has a more robust portfolio, having stacked up a total of 82,780 ETH worth approximately $150.3 million at an average price of $1,816 since Jan 1, 2023.\n\nGiant whales continue to accumulate $ETH!\n\n\n\n0xAA15 withdrew 5,762 $ETH($15.06M) from #Binance again 2 hrs ago and has bought 50,733 $ETH($99.2M) at $1,955 since Sept 19, 2023.\n\n\n\n0x9314 spent 7.29M $USDT to buy 2,800 $ETH again 2 hrs ago and has bought 82,780 $ETH($150.3M) at $1,816… pic.twitter.com/2pH39afaiF — Lookonchain (@lookonchain) January 11, 2024\n\nThe intriguing switch to Ethereum by these whales complements the $8.2 billion in large transaction volumes according to data from IntoTheBlock. These large transactions, which involve ETH worth at least $100,000, have jumped by 65.99% in the past 24 hours.\n\nEthereum’s whales are notably helping to change the game as the digital currency strives to recoup its lost ground to price action.\n\nEthereum price in mix\n\nAt the time of writing, Ethereum has jumped by 11.42% in the past 24 hours to $2,645.07. The cryptocurrency has grown from a 24-hour low of $2,353.93 to its price at the moment, driven in part by the hype ravaging the market following the approval of a spot Bitcoin ETF by the United States Securities and Exchange Commission (SEC).\n\nThis approval is boosting sentiment that the spot Ethereum ETF might also be on the way. This has further pushed retail sentiment as well, with Ethereum now notably eyeing the $2,700 benchmark."
    },
    {
        "id": 99,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmNyeXB0by1yZXBvcnRlci5jb20vcHJlc3MtcmVsZWFzZXMvZXhwZXJ0cy1zZXQtYS1kYXRlLWZvci1ldGhlcmV1bS10by1yZWFjaC0xMGstYXJlLXlvdS1yZWFkeS01NDEyNy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Experts set a date for Ethereum to reach $10k, are you ready? - Crypto Reporter",
        "content": "Ethereum (ETH), the second-largest cryptocurrency by market capitalization, has long been a favourite among crypto enthusiasts and investors. Over the years, ETH has seen significant price appreciation, but the question on everyone’s mind is, can it reach $10,000?\n\nAccording to crypto analyst and author Chris Burniske, the answer is a resounding “yes,” and he’s not alone in his optimism. In this article, we’ll delve into the journey Ethereum has taken so far and explore the factors that could propel it to the coveted $10,000 mark. Additionally, we’ll introduce a promising token, Retik Finance (RETIK), as a project to watch in the evolving crypto landscape.\n\nEthereum’s Remarkable Ascent\n\nEthereum, often referred to as the “king of smart contracts,” has had a remarkable journey since its inception. Unlike Bitcoin, which primarily serves as digital gold and a store of value, Ethereum’s blockchain platform is designed to support decentralised applications (DApps) and smart contracts. This fundamental difference has opened up a world of possibilities and applications, making ETH an indispensable part of the crypto ecosystem. Ethereum’s price history tells a compelling story of growth and adoption. It began trading at just a few cents when it launched in 2015, and by 2017, it had breached the $1,000 mark. The subsequent years saw its price surge to new heights, with ETH reaching an all-time high of over $4,800 in November 2021. This impressive price trajectory underscores Ethereum’s significance and potential in the world of cryptocurrencies.\n\nChris Burniske’s Bold Prediction\n\nChris Burniske, a respected crypto analyst and author, shared his thoughts sometimes back on Ethereum’s future in a Twitter post. He expressed his astonishment at the persistent scepticism surrounding ETH’s potential, despite its consistent price appreciation. Burniske boldly stated, “For the haters that have been negative on ETH at $1, $10, $100, and $1,000, but refuse to let data change their view, see ya at ETH $10,000.” While Burniske doesn’t anticipate Ethereum reaching this milestone in the next few months, he firmly believes that it’s only a matter of time before it happens. He set his sights on the year 2025 as the timeframe for Ethereum to hit $10,000, a prediction that has garnered significant attention and sparked optimism among ETH supporters.\n\nCommunity Consensus\n\nBurniske’s prediction resonated with many members of the crypto community, and their responses to his post indicate widespread agreement. Some Ethereum enthusiasts even go a step further, suggesting that ETH could reach $10,000 as soon as 2024. The sentiment among believers is that Ethereum’s fundamental value proposition, combined with its growing adoption and use cases, makes a five-figure price tag entirely plausible in the coming years.\n\nFactors Fueling Ethereum’s Growth\n\nSeveral key factors contribute to the bullish outlook for Ethereum and its potential journey to $10,000:\n\nSmart Contracts and DApps: Ethereum’s smart contract capabilities are at the heart of its appeal. The platform enables developers to create decentralised applications, opening up a wide range of use cases in finance, gaming, NFTs, and more. As the DApp ecosystem continues to expand, demand for ETH to power transactions and interact with these applications will likely grow.\n\nEthereum Upgrade: The Ethereum Cancun upgrade, which is expected to happen in Q1 of 2024, will increase the scalability, security, and efficiency of the Ethereum network, optimising operation and reducing gas fees through a process known as proto-danksharding.\n\nDeFi and NFTs: The decentralised finance (DeFi) and non-fungible token (NFT) sectors have exploded in recent years, with Ethereum serving as the primary platform for these innovations. The growing popularity of DeFi protocols and NFT marketplaces drives demand for ETH as the preferred choice for transactions and collateral.\n\nInstitutional Adoption: Ethereum has attracted the attention of institutional investors, with major financial institutions and corporations exploring its potential. Institutional investment can bring significant liquidity and credibility to the Ethereum ecosystem.\n\n>>>> Click Here To Buy RETIK Tokens <<<<\n\nRetik Finance: A Promising Token to Watch\n\nWhile Ethereum’s journey to $10,000 is on the horizon, the crypto landscape is continually evolving, with new projects emerging to address various needs and challenges. One such project that has been gaining traction is Retik Finance (RETIK). As we look ahead to Ethereum’s potential growth, it’s essential to keep an eye on promising tokens like RETIK. Retik Finance is a decentralised finance (DeFi) project that aims to redefine the DeFi space by introducing innovative utilities that bridge the gap between traditional finance and cryptocurrencies. Its ecosystem includes features like the Retik Wallet, Retik DeFi Debit Card, and Retik Pay, all designed to simplify financial transactions and promote accessibility to DeFi for users of all backgrounds. The project’s presale stages have been a resounding success, raising over $6.7 million from the sale of over 134 million tokens. With experts predicting gains of up to 20,000%, Retik Finance is poised to make a significant impact in the crypto world.\n\nConclusion\n\nAs we embark on the journey into 2024 and beyond, Ethereum’s path to $10,000 remains an exciting narrative in the crypto space. Chris Burniske’s bold prediction, combined with the strong fundamentals and growing adoption of Ethereum, instils confidence in its potential to reach this milestone. While Ethereum takes center stage, it’s crucial to keep an eye on promising projects like Retik Finance (RETIK), which are innovating and offering solutions to the evolving needs of the crypto community. As Ethereum’s journey unfolds, it’s clear that the crypto landscape holds immense opportunities for those who dare to dream and believe in the transformative power of blockchain technology.\n\nClick Here To Take Part In Retik Finance Presale\n\nVisit the links below for more information about Retik Finance (RETIK):\n\nWebsite: https://retik.com\n\nWhitepaper: https://retik.com/retik-whitepaper.pdf\n\nLinktree: https://linktr.ee/retikfinance\n\nDisclaimer: The statements, views and opinions expressed in this article are solely those of the content provider and do not necessarily represent those of Crypto Reporter. Crypto Reporter is not responsible for the trustworthiness, quality, accuracy of any materials in this article. This article is provided for educational purposes only. Crypto Reporter is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods or services mentioned in this article. Do your research and invest at your own risk."
    }
]