[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vd3d3Lm9ubHlpbnlvdXJzdGF0ZS5jb20vbWljaGlnYW4vY2hvY29sYXRlLWJlZC1icmVha2Zhc3QtbWkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Treat Yourself To A Sweet Escape At Cocoa Cottage, A Chocolate-Themed Bed And Breakfast In Michigan - Only In Your State",
        "content": "As local travel experts, we know what travelers are looking for when it comes to finding the perfect accommodations for their next trip. To compile our lists, we scour the internet to find properties with excellent ratings and reviews, desirable amenities, nearby attractions, and that something special that makes a destination worthy of traveling for.\n\nWho doesn’t love chocolate? Whether you’re eight years old or eighty, there’s nothing better than indulging in a tasty and rich cacao treat! What’s even better than digging into a serving of chocolate? Immersing yourself in a chocolate-themed wonderland, of course! Michigan has just the spot, and you’re in for the sweetest getaway imaginable when you book a room. The Cocoa Cottage is an adorable (and delicious) chocolate-themed bed and breakfast in Michigan that you’re absolutely going to swoon over.\n\nThis is definitely one of the sweetest places to stay in Michigan! To learn more about Cocoa Cottage B&B and its many unique packages, in addition to its wonderful on-site cuisine selections, visit the Cocoa Cottage website or Facebook page.\n\nHave you checked out this fun Michigan bed and breakfast during previous travels? Share your tasty experiences with us in the comment section below!\n\nStill craving sugar? Read about the top destinations for chocolate lovers in Michigan!\n\nWant more Michigan in your inbox? Get the latest on things to see, do, and eat around Michigan! spinner Thank you! You will receive your first email soon. An error occured. Subscribe"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3Lm9ubHlpbnlvdXJzdGF0ZS5jb20va2VudHVja3kvYmVkLWFuZC1icmVha2Zhc3RzLWt5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Here Are 8 Of The Best Bed And Breakfasts In Kentucky - Only In Your State",
        "content": "As local travel experts, we know what travelers are looking for when it comes to finding the perfect accommodations for their next trip. To compile our lists, we scour the internet to find properties with excellent ratings and reviews, desirable amenities, nearby attractions, and that something special that makes a destination worthy of traveling for.\n\nEvery so often, a little convalescence is a good thing. We all deserve a good getaway, and the best bed and breakfasts in Kentucky offer the most relaxing escape imaginable. A Bed and Breakfast is often a perfect way to forget about responsibility for a day or two… or a few more. There are so many wonderful spots to visit, it can be difficult to make a choice on which one to stay in. The reviews are helpful, but knowing someone who stayed there is an added bonus, as you tend to get the truth from them. There is no better way to just get away from it all, then by staying in a beautiful B&B.\n\nHere are eight B&Bs in Kentucky that come highly recommended by our readers and locals alike:\n\nThe best bed and breakfasts in Kentucky are highly recommended for an overnight (or a few) getaway. They all offer something unique, be it environment, décor, architecture, amenities or amazing homemade food. If you are looking for a place to just escape and wind down after a busy work week (or anytime, for that matter), consider staying at one of these wonderful establishments. Have you ever stayed in a Kentucky B&B? If so, which one and what was the best thing about it?\n\nRound out this B&B adventure with a visit to Hidden Cave Ranch, a local getaway in a magnificent milieu.\n\nWant more Kentucky in your inbox? Get the latest on things to see, do, and eat around Kentucky! spinner Thank you! An error occured. Subscribe"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiugFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMzEtbWFyY2gtMjAyMy9hcnRpY2xlc2hvdy85OTEzODQ4OC5jbXPSAb4BaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXByaWNlcy10b2RheS1saXZlLW5ld3MtYml0Y29pbi1kb2dlY29pbi1ldGhlcmV1bS1zaGliaGEtaW51LWNyeXB0b2N1cnJlbmN5LWxhdGVzdC11cGRhdGVzLTMxLW1hcmNoLTIwMjMvYW1wX2FydGljbGVzaG93Lzk5MTM4NDg4LmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Crypto Price Today Live: Bitcoin holds above $28,000; Solana, Dogecoin slip up to 3% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nNew Delhi: The cryptocurrency markets were trading mixed on Friday. Bitcoin, Dogecoin and Solana were trading with cuts, while BNB, XRP and Tron were trading with gains.Bitcoin (BTC) fell 1.91% to $28,074, whereas Ethereum (ETH) was above the $1,800 level. BTC volume stood at approximately $19.14 billion, falling 17.89% in the last 24 hours.\"Bitcoin was seen consolidating above the US$28,000 pivot level in the past 24 hours following a recent surge above the US$29,000 level. This consolidation could be due to the anticipation of the upcoming US GDP report,\" Edul Patel, Co-founder and CEO at Mudrex, said.\"There is a key bullish trend line forming with support near US$27,900. BTC’s immediate resistance now lies at the US$28,500 level and then US$ 28,850 zone. However, BTC has not yet acquired enough strength to make a sharp move but the key uptrend support remains intact,\" Edul added.The total volume in DeFi is currently 4.44 billion, 10.21% of the total crypto market 24-hour volume. The volume of all stablecoins is now $38.58 billion, which is 88.73% of the total crypto market 24-hour volume.The global cryptocurrency market cap was trading lower around $1.18 trillion, falling 0.87% in the last 24 hours.The market cap of Bitcoin, the world's largest cryptocurrency, was around $543 billion. Bitcoin’s dominance is currently 46.17%, a decrease of 0.47% over the day, according to CoinMarketCap.\"The current technical outlook remains relatively stable, hovering around the $27,900 price level. A break of the resistance at $28,950 could lead to a potential rally for Bitcoin to $29,200 or even $30,700, while strong support levels are expected around $26,600 and $25,200 if the downtrend continues,\" Sathvik Vishwanath, Co-Founder & CEO of Unocoin, said.Rajagopal Menon, Vice President at WazirX said, \"Major market oscillators point to a neutral sentiment. The Relative Strength Index (14) sits at 62.71, with a neutral outlook. The Stochastic %K (14, 3, 3) and the Average Directional Index (14) indicate a Neutral outlook as well at 69.33 and 38.60 respectively.\"The MACD Level (12, 26), at 1198.04, indicates Sell. The Stochastic RSI Fast (3, 3, 14, 14) and the Williams Percent Range (14) continue to be Neutral at 30.11 and −41.78, respectively,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 12.28 hours, IST on March 31, 2023)Bitcoin $28,074 -1.91%Ethereum $1,801 0.13%Tether $1.00 0.04%BNB $316.48 1.19%XRP $0.5442 1.34%Cardano $0.3788 0.45%Polygon $1.09 -1.90%Dogecoin $0.07465 -0.82%Solana $20.40 -2.62%Polkadot $6.22 0.79%Tron $0.06513 1.29%Shiba Inu $0.00001062 0.01%Litecoin $89.30 -1.12%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiMGh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tYWJvdmUtMjgwMDAtYm5iLXVwL9IBNGh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tYWJvdmUtMjgwMDAtYm5iLXVwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin holds above US$28,000, BNB up despite regulatory woes - Forkast News",
        "content": "Bitcoin dipped in Friday morning trading in Asia, but held above US$28,000 after briefly breaking the US$29,000 mark on Thursday. Other top 10 non-stablecoin cryptocurrencies traded mixed as investors took some profits off the recent rally. BNB, the native token of the Binance exchange, led the winners despite the exchange facing a lawsuit by the Commodities Futures Trading Commission (CFTC) for allegedly offering its products to U.S. residents without a license. Binance has denied the allegation. U.S. equities gained Thursday on signs the banking turmoil was receding and economic readings pointed to a cooling economy, a signal the Federal Reserve may ease back on its interest rate hikes.\n\nSee related article: Hong Kong may license at least 8 crypto firms by year-end: former SFC regulator\n\nFast facts\n\nBitcoin dipped 0.40% to US$28,249 in the 24 hours to 9:00 a.m. in Hong Kong, to add 0.08% for the past seven days, according to CoinMarketCap data. The world’s largest cryptocurrency briefly traded above US$29,000 on Thursday for the first time in about nine months or since June 2022.\n\nOver US$4 billion worth of Bitcoin options on Deribit, the world’s biggest Bitcoin and Ethereum options exchange, are set to expire on Friday, which may add to the volatility of Bitcoin and other cryptocurrencies over the weekend, according to digital asset data tracker Amberdata on Wednesday. Options give the purchaser the right to buy or sell an underlying asset at a set price by a fixed date and are often used to speculate and hedge risk.\n\nEthereum rose 1.03% to US$1,806, but it’s down 0.28% for the past seven days.\n\nBNB, the native token of the world’s largest crypto exchange Binance, led the winners despite the mounting regulatory challenges the exchange faces in the U.S. The token rose 1.4% to US$317.17, but is off 3.7% for the week. Catherine Coley, a former chief executive of Binance U.S., hired a former official at the CFTC to represent her in the U.S. authorities’ investigation into the exchange, Reuters reported on Wednesday.\n\nThe total crypto market capitalization dipped 0.15% in the past 24 hours to US$1.18 trillion. Total trading volume over the last 24 hours rose 7.51% to US$50.98 billion.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index edged up 0.06% to 4,008.23 as of 09:00 a.m. in Hong Kong, but is off 2.88% for the week. The index is a proxy measure of the performance of the global NFT market and includes 500 eligible smart contracts on any given day. It is managed by Forkast sister company, CryptoSlam.\n\nNFT investors are waiting for the launch of a bridge between DeGods – a Solana-based NFT collection – and Ethereum, said Yehudah Petscher, NFT strategist at CryptoSlam. The upgrade would allow DeGods holders to migrate their NFTs to the Ethereum blockchain.\n\nU.S. equities closed higher on Thursday. The Dow Jones Industrial Average moved up 0.43%, the S&P 500 gained 0.57%, and the Nasdaq Composite Index rose 0.73.\n\nThe Federal Reserve’s lending to U.S. banks dropped in the week ended March 29, according to a Bloomberg report on Friday, indicating the U.S. banking system was stabilizing after a series of lender failures and sporadic runs on banks.\n\nU.S. jobless claims rose by 7,000 to 198,000 in the week ended March 25, higher than the expected 195,000, according to CNBC on Thursday. Gross domestic product (GDP) in the U.S. rose 2.6% in the last three months of 2022, lower than the forecast 2.7% and pointing to a slowing economy.\n\nWhile this suggests the Federal Reserve may temper its policy to raise interest rates, investors now await Friday’s U.S. Personal Consumption Expenditures index for more signals on how the Fed’s campaign to curb inflation may play out.\n\nFederal Reserve officials on Thursday said U.S. inflation – running at a pace of more than 6% on year in February – remains too high and more action from the Fed might be needed to get annual inflation into its target range of 2%, according to a Reuters report.\n\nAnalysts at the CME Group are mixed on the outlook for the next Fed meeting on May 3 to decide on interest rates, with 51.5% expecting the Fed will stand pat, while 48.5% expect a 25 basis-point rise. U.S. interest rates are currently between 4.75% to 5%, the highest since 2007.\n\nU.S. stock futures rose as of 9:00 a.m. in Hong Kong, pointing to an up day for stocks on Friday. The Dow Jones Industrial Average futures moved up 0.21, S&P 500 futures gained 0.32% and the Nasdaq Composite Index climbed 0.41%.\n\nSee related article: Montenegro hints U.S. may get to extradite Terra fugitive Do Kwon ahead of South Korea"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3LmV1cm9wZWFuYnVzaW5lc3NyZXZpZXcuY29tL2JuYi1zdWNjZXNzLWFjYWRlbXktcmV2aWV3LWxlZ2l0LW9yLXNjYW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "BNB Success Academy Review - Legit or Scam? - The European Business Review",
        "content": "Whether you’re looking to make some extra money or want to set up a full-time business, Airbnb can be an excellent source of income. With Airbnb, you can easily rent out a room, apartment, house, or other properties and start making money almost immediately.\n\nThere is, however, a lot of competition. Airbnb currently has over 4 million hosts and 6 million listings worldwide. The beginners might find it difficult to gain a foothold and become profitable with their Airbnb business right away.\n\nThis is where courses like BnB Success Academy can help. Their website claims that anyone can make money from Airbnb with the knowledge and insights they gain from the course, and with the right dedication.\n\nIs the training actually helpful? This review will help you find the answer.\n\nBnb Success Academy – An Overview\n\nThis course is aimed at anyone who wants to make semi-passive income with Airbnb without having to own a property prior to taking the course. The training program appeals to those who are looking to escape the traditional 9 to 5 job and achieve financial freedom. The course promises to provide a “proven system” to help individuals land their first property in less than 14 days.\n\nIt is important to approach these claims with a healthy dose of skepticism. It is important to thoroughly research the course and the people behind it to ensure they are credible and can deliver on their promises.\n\nWho are Fraser & Arthur?\n\nFraser Mackie is an entrepreneur from Victoria, BC, Canada who caught the entrepreneurial spirit early on, selling sneakers on eBay at the age of 16. He later went on to become an affiliate manager, honing his skills in generating and converting online traffic. In 2013, Mackie started his own affiliate network for Instagram influencers which led him and his friends to create their own direct-to-consumer brand, Kerotin Hair Care, which achieved 8-figure revenue in its first 24 months of operation. Mackie currently works on new e-commerce opportunities and helps medium and large businesses grow online with an emphasis on funding and acquisition strategies.\n\nArthur Diulgerian is an entrepreneur based in Victoria, BC who immigrated from Bulgaria at the age of 6. He has always had an entrepreneurial spirit and began his first venture delivering newspapers at the age of 9. He entered the digital marketing industry in 2012 by creating a successful Twitter affiliate network for Google AdSense. This led him to partner with Fraser in 2013 to build a large affiliate network for Instagram influencers. In 2015, Diulgerian co-founded Kerotin Hair Care, a direct-to-consumer brand that grew quickly and was sold to private equity in 2019. Today, he and Fraser work with online businesses looking to scale and potentially exit in the future.\n\nThey have worked together to build a successful BNB business with more than 87 properties. The BNB success academy is their latest venture in which they will share the entire process, tips, and tricks they used to achieve success.\n\nPros and Cons of the Program\n\nPros:\n\nThe best part about the training program? It’s affordable. Start your training journey by signing up for their 14-day challenge starting at $97 You can find inspiration and ideas from other Airbnb entrepreneurs in their Facebook group. No experience is required to join. To be eligible for membership, you don’t need to have a particular credit score. No prior experience is necessary with AirBnB and real estate investing. All you need to learn about AirBnB and real estate investing is available through the training videos and in-person seminars that are included with your membership. The BNB Success Academy’s training is both useful and comprehensive. This course covers everything you need to know about how to find deals and how to negotiate with sellers and homeowners, as well as how to overcome lenders who might not be interested in financing your deals. The program is extremely flexible and can be customized. The company is highly praised for its outstanding customer service and student support.\n\nCons:\n\nThe biggest challenge or drawback is that the AirBnB or Short term rental industry is very competitive. It’s not a get rich scheme.\n\nYou must remember that success with Airbnb or any passive income stream is not guaranteed. It will take effort and dedication to succeed. It is essential to approach every money-making opportunity realistically and be willing to work hard to make it a success.\n\nIs Airbnb a profitable method of making money?\n\nAirbnb is taking over tourism. It is already a $30 Billion dollar industry and it is growing at 20% per annum. It’s only going to get bigger with Airbnb.\n\nWhy?\n\nThe reason for this is that it is decentralized. Airbnb is growing rapidly and more properties will be available to rent in the coming months. There are a lot more opportunities to make money if you get involved early.\n\nThis also means that there will be more competition. That’s why you need a proven method or system to stand out and grab your slice of the cake."
    }
]