[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMikAFodHRwczovL3d3dy53Y3BvLmNvbS9uZXdzL2xvY2FsLW5ld3MvaGFtaWx0b24tY291bnR5L2NpbmNpbm5hdGkvc2l0Y29tLXN1aXRlcy15b3UtY2FuLW5vdy1yZW50LWZyaWVuZHMtYW5kLXNlaW5mZWxkLXRoZW1lZC1haXJibmJzLWluLWNpbmNpbm5hdGnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Sitcom Suites: You can now rent 'Friends' and 'Seinfeld'-themed Airbnbs in Cincinnati - WCPO 9 Cincinnati",
        "content": "CINCINNATI — Feel like it hasn't been your day, your week, your month or even your year already? Maybe you want to take a break and need a little \"serenity now?\" Now you can with two new stay-cation spots in Cincinnati.\n\nBrenda and Otto Baum are renting out Airbnb units themed after the 90s sitcoms \"Friends\" and \"Seinfeld.\"\n\nLocated in Pleasant Ridge, the one-bedroom units occupy the second story of a four-family apartment. They're designed to mimic both Rachel and Monica's apartment and Jerry Seinfeld's apartment.\n\nThe couple said the idea came to them during the pandemic. Stuck at home, they found themselves rewatching old sitcoms.\n\n\"You can get an Airbnb, but this would give you like, the Airbnb, you know. It's a thing,\" said Otto Baum. \"The idea came into our heads, 'It would be kind of fun to build something like that.' Instead of just watching on TV, you could actually experience it — be a part of it.'\n\nThe couple lives in the neighborhood and said they already owned the building, so after detailed planning, they were able to start construction last October.\n\nDonned the \"Sitcom Suites,\" the themed rentals take the experience one step further. In addition to memorabilia, the Baums filled the units with set replicas and one-of-a-kind pieces for added immersion.\n\nValerie Lyons/WCPO\n\nBrenda traveled to six different states in her search for furniture and decorations.\n\n\"Things like the print behind the TV, that was easy to find,\" Brenda Baum said. \"[But Monica] has very specific utensil holder on her stove so I wanted to get that right.\"\n\nThe \"Friends\" unit capitalizes on recognizable features including the purple living room, Monica's mix-matched color kitchen and the iconic floor-to-ceiling balcony window fitted with a digital print of an NYC red brick apartment.\n\nValerie Lyons/WCPO\n\n\"Where they look out at naked guy on the deck,\" Otto said.\n\nThe \"Seinfeld \" apartment includes a bike on the wall, a desktop computer in the corner, a cabinet above the kitchen sink lined with cereal boxes and even a hidden cutout of Cosmo Kramer behind Jerry's front door.\n\n\"We built partition walls so they don't go all the way up to the ceiling. When you walk in it sort of feels like you're on a stage,\" Otto said. \"We really focused on that even with the lights which are made to look like studio lights.\"\n\nValerie Lyons/WCPO\n\nWith king-sized beds, pull-out couches in the living rooms and fully functioning kitchens and bathrooms, each unit accommodates up to four guests. but if you're feeling like hosting a \"Festivus for the rest of us\" there's a listing to book the entire building.\n\n\"Just seeing our vision come into place, it's great,\" Brenda said.\n\nValerie Lyons/WCPO\n\nThe Baums are working on two more suites themed after \"Schitt's Creek\" and \"Golden Girls.\" All four will be ready by early April.\n\nPeople can start booking now for the \"Friends\" and \"Seinfeld\" units."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3QvZGFwcGJheS1waWNrcy10aGUtNDAtYmVzdC1kYXBwcy1vbi1ibmItY2hhaW4td2hvLW1hZGUtdGhlLWN1dNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 17:50:46 GMT",
        "title": "DappBay Picks the 40 Best Dapps on BNB Chain! Who Made the Cut? - BSC NEWS",
        "content": "BNB\n\nDappBay published a list of the best 40 Dapps on BNB Chain. Did your favorite project make the list? You might be surprised who did, and didn't!\n\nTop BNB Chain Dapps in 2023\n\nDapp aggregator DappBay has published a list of the “40 Best BNB Chain Dapps 2023,” in 10 different categories, including Decentralized Finance (DeFi), gaming, social, marketplaces, and more.\n\nCheck out the 40 Best BNB Chain dApps in 2023 on DappBay.\n\n\n\nCheck out our overview taking in a range of categories such as tools and utility, wallets, games, social...\n\n\n\nFind your favourite #dApp ⤵️https://t.co/yhdHMRmKfF pic.twitter.com/APcXB5lySo — BNB Chain (@BNBCHAIN) January 20, 2023\n\nThe list includes major entities such as PancakeSwap, OpenSea, and Chainlink, as well as well-known projects such as NodeReal, MOBOX, and Alpaca Finance.\n\nDappBay also gives a nod to newer Dapps, such as Wombat Exchange and Hooked Protocol.\n\nSome notable projects were left off the list, which we’re sure will lead to debate (constructive or otherwise) from supporters and haters online. Did your favorite project make the list? The only way to find out is to read it.\n\nWhat is DappBay:\n\nDappBay is an aggregator for decentralized applications built on the BNB Chain ecosystem. DappBay provides users with the tools necessary to make informed investment decisions. With Red Alarm, users are also safeguarded from exposure to risky projects on the chain.\n\nWhere to Find DappBay:\n\nWebsite"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMikAFodHRwczovL3d3dy53Y3BvLmNvbS9uZXdzL2xvY2FsLW5ld3MvaGFtaWx0b24tY291bnR5L2NpbmNpbm5hdGkvc2l0Y29tLXN1aXRlcy15b3UtY2FuLW5vdy1yZW50LWZyaWVuZHMtYW5kLXNlaW5mZWxkLXRoZW1lZC1haXJibmJzLWluLWNpbmNpbm5hdGnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Sitcom Suites: You can now rent 'Friends' and 'Seinfeld'-themed Airbnbs in Cincinnati - WCPO 9 Cincinnati",
        "content": "CINCINNATI — Feel like it hasn't been your day, your week, your month or even your year already? Maybe you want to take a break and need a little \"serenity now?\" Now you can with two new stay-cation spots in Cincinnati.\n\nBrenda and Otto Baum are renting out Airbnb units themed after the 90s sitcoms \"Friends\" and \"Seinfeld.\"\n\nLocated in Pleasant Ridge, the one-bedroom units occupy the second story of a four-family apartment. They're designed to mimic both Rachel and Monica's apartment and Jerry Seinfeld's apartment.\n\nThe couple said the idea came to them during the pandemic. Stuck at home, they found themselves rewatching old sitcoms.\n\n\"You can get an Airbnb, but this would give you like, the Airbnb, you know. It's a thing,\" said Otto Baum. \"The idea came into our heads, 'It would be kind of fun to build something like that.' Instead of just watching on TV, you could actually experience it — be a part of it.'\n\nThe couple lives in the neighborhood and said they already owned the building, so after detailed planning, they were able to start construction last October.\n\nDonned the \"Sitcom Suites,\" the themed rentals take the experience one step further. In addition to memorabilia, the Baums filled the units with set replicas and one-of-a-kind pieces for added immersion.\n\nValerie Lyons/WCPO\n\nBrenda traveled to six different states in her search for furniture and decorations.\n\n\"Things like the print behind the TV, that was easy to find,\" Brenda Baum said. \"[But Monica] has very specific utensil holder on her stove so I wanted to get that right.\"\n\nThe \"Friends\" unit capitalizes on recognizable features including the purple living room, Monica's mix-matched color kitchen and the iconic floor-to-ceiling balcony window fitted with a digital print of an NYC red brick apartment.\n\nValerie Lyons/WCPO\n\n\"Where they look out at naked guy on the deck,\" Otto said.\n\nThe \"Seinfeld \" apartment includes a bike on the wall, a desktop computer in the corner, a cabinet above the kitchen sink lined with cereal boxes and even a hidden cutout of Cosmo Kramer behind Jerry's front door.\n\n\"We built partition walls so they don't go all the way up to the ceiling. When you walk in it sort of feels like you're on a stage,\" Otto said. \"We really focused on that even with the lights which are made to look like studio lights.\"\n\nValerie Lyons/WCPO\n\nWith king-sized beds, pull-out couches in the living rooms and fully functioning kitchens and bathrooms, each unit accommodates up to four guests. but if you're feeling like hosting a \"Festivus for the rest of us\" there's a listing to book the entire building.\n\n\"Just seeing our vision come into place, it's great,\" Brenda said.\n\nValerie Lyons/WCPO\n\nThe Baums are working on two more suites themed after \"Schitt's Creek\" and \"Golden Girls.\" All four will be ready by early April.\n\nPeople can start booking now for the \"Friends\" and \"Seinfeld\" units."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmZyZW5jaGVudHJlZS5jb20vZnJlbmNoLXByb3BlcnR5L2dpdGUtYnVzaW5lc3MvcnVubmluZy1hLWNoYW1icmUtZGhvdGVzLW9yLW1haXNvbi1kaG90ZXMtaW4tZnJhbmNlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Running a Chambre d’hôtes or Maison d’hôtes in France - FrenchEntrée",
        "content": "3\n\nEssential Reading\n\nDenyse Betts shares her insight, tips and advice for running a chambres d’hôtes or maison d’hôtes, the French alternative to a British or American-style bed and breakfast. “Elegant and poised, focused and aware. Each step precise, keen eyes watchful. No matter what surprises the day brings, these feathers remain unruffled.” Those words do not belong to me, but they ring quite true, to the point that they can easily apply to any undertaking. In France, the bed and breakfast business still remains a widely popular formula. Just remember, there is more to owning a maison d’hôtes than just renting “guest bedrooms”, chambres d’hôtes in French. Whether a rural cottage, a maison de maîtres, or a grand manor house, the maison d’hôtes is a private home where paying guests are welcomed as friends. These establishments are the quintessential Bed and Breakfast à la française. Once the welcome mat is laid at your doorstep, you are joining the hundreds of owners who choose to be in this unique type of hospitality business, i.e., the people business. From the moment paying guests cross your threshold to the moment they depart, you are responsible for their well-being. You are in the position of making them feel unique and making their stay with you unique as well. Quite a responsibility, quite a challenge, but what an exhilarating experience if you have the mettle, and an opportunity to get acquainted with people you would never meet otherwise. Lasting friendships can ensue with lovely memories to share for years to come. But before you can boast of having an interesting coterie of friends, there are steps to take to ensure the success of your enterprise.\n\nBuying a Chambre d’hôtes or Maison d’hôtes in France Location, location, location; that is the first and foremost issue. Since France attracts millions of tourists every year, one would think everyone has a fair go in the hospitality business. The reality is more nuanced. In order to make a success out of your maison d’hôtes, it is wise to do some research before choosing an area that you consider worthwhile. Every region has its own particular charm. Ask yourself why you intend to live in a specific area. Is it to find a way of life that will make you feel safe and comfortable and where you think your guests will want to share your experience, or is it because it is a popular destination? You have to make the right choice. France is a treasure chest of picturesque villages, serene lakes, impressive mountain peaks, prestigious vineyards, famous spas, and endless coastlines. Alsace, Brittany, Normandy, the Limousin, the Charentes, the Loire, the Alps, Aquitaine, and Provence all have an enviable reputation and their drawbacks. Nevertheless, the choice remains mind-boggling. Keep in mind that selecting a good location is the first step to take whether you purchase an up-and-running business or a property that you intend to transform. It is important to note that not every property is suitable. Before making any commitment, try to visit as a guest yourself, a few chambres d’hôtes. Bring a notepad with you and grade them; write down your likes and dislikes. Finding the right house in a perfect setting is not that easy. It has to do with your instincts, your own feelings, your aspirations, and perhaps luck. Being close to an airport or a major highway is helpful, but there are many other things to consider. Ask yourself if your property is in the vicinity of a village or small town, where one can find a doctor, a pharmacy, a grocery store, restaurants, or a bank. A definite plus. Beyond that, you need a draw card, an attraction that will be interesting enough to warrant bookings throughout the season and beyond. Not everyone can view Mont-Blanc from a bedroom window, but think about landmarks such as famous caves, châteaux, lakes, beaches, sporting facilities, or theme parks. Making the right choice is the challenge. Ask yourself what you like the most about the property in that specific region, and you can bet you will get the kind of traveller you seek to welcome into your corner of La Belle France. In order to make your guests feel at home, look for quiet surroundings where they can relax. Before actually purchasing that property on your wish list, try and get acquainted with the neighbourhood. Check out the region, know it by heart, and discover all it has to offer. Is there a view? Something that will single you out? Are there noisy barking dogs, busy roads, farming equipment or train tracks that could disturb the quiet surroundings? Most guests are there to discover the region and will count on you to steer them to an interesting place. Look for nearby outdoor activities such as beautiful gardens to visit, mountain trails and bicycle paths to discover, or something out of the usual such as renting a donkey for a day`s outing. If you have time on your hands, you might even offer your services as a guide for the day.\n\nSetting up your Chambre d’hôtes business Now, once you have purchased the property of your dreams, what does it take to get established? Your greatest asset will be your charm and your willingness to greet people with an open mind, showing them how much you appreciate the fact they travelled from some far distant place to come to your establishment. With an equal dose of initiative, commitment, and imagination, a warm welcome will go a long way. Remember, you never have a second chance to make a good first impression. This entails maintaining a certain standard, delivering what you describe on the Internet, and creating an atmosphere that your guests will not find elsewhere. Yes, it is a demanding task. Do not expect miracles; the first two years are usually unrewarding, but as you move on, your reputation will grow as well as your guest list. Patience will be an important asset, and believing in yourself and your endeavours will be essential. You have chosen a home that you have to turn in part into a business. It is up to you to decide how large an enterprise you wish to have. Make a business plan Do you have a plan? How many chambres d’hôtes do you want to rent? How many do you think you can handle? Is it wiser to have two, three or more or just one? Do you want to attract young families with children, or do you want to welcome older, more sedate people who crave quiet surroundings, good food and quaint villages? Or both of the above? Spend some time doing the math: ask yourself if it is worth renting a room for only one night, just like in any hotel. If you wish to greet and make friends with your guests, it is advisable to aim for a two-night stay. It not only gives your guests a chance to unwind and settle, but it means you will find time to get acquainted. If you give it some thought, you will soon realize that the work involved is basically the same whether you rent for one night or more. There is always a room to clean in the morning, but the work is less intensive for a two-night stay, as you do not have to change the sheets, etc. Once you have purchased the property of your dreams, what does it take now to get established? Will it be a full-time occupation or simply a sideline?\n\nRunning a Chambre d’hôtes : the keys to a successful partnership That is where the second most important rule comes in. You cannot run a maison d’hôtes successfully on your own. The vast majority of establishments are owned by couples. That should come as no surprise. The tasks and the responsibilities are huge. You will both share the burden in order to reap the benefits together. You have to be two to equally divide the responsibility and the chores. You might share the housekeeping but bear in mind that not everybody is good at everything, and while you are both invested in greeting your guests, ask yourself what you are best at and where your natural talents will be of use. In other words, why not let your partner do the bookkeeping while you do the cooking? You might want to grow your own vegetables; you might have a pool, a tennis court, or extensive grounds with trees, bushes and flower beds to tend to. All of that takes time and energy, and unless you can afford professional help, you will have to pace yourself and share the workload. Business basics Making yourself known is the next most important factor. Owners today can rely on several forms of advertising. Nowadays, you have the possibility of getting known worldwide through your own website, a bevvy of renting platforms, and social media. But keep in mind, before getting the world to know you, get known by the locals. The French love to meet the new family in town. You should introduce yourself to your community and make contact with your local authorities, such as the mayor and the local bank manager, and your local tourism board. If you need advice or have a problem down the road, they will be glad to help you if they already know who you are. If you open an account at your local bank, you can ask for a découvert, a running overdraft, and a credit card machine that will be very helpful, if not a must. When booking, you may take the first night, as in any hotel, with the understanding that that first night is not reimbursed in case of a no-show unless there is a valid reason to cancel. Pay a visit to the local restaurants, post office, and bakery. Have on hand the names of a doctor, hairdresser, and tradesmen whose services you might need down the road. Also, if you decide to be totally integrated, a visit to the local chamber of commerce, chambre de commerce, can be of great help. Should you decide to register with them, you can form a small company, a micro enterprise, and obtain a siret number (a business registration number) which in turn will allow you to subscribe to the health care system. This is a quick and easy way to get established without the expense of a solicitor. To be on the safe side, it is a good idea to have a French accountant do your taxes. Not to worry, you will not be making millions. If you do not take a salary, you will have no personal income tax to pay; you will be, in some cases, non-imposable. As for the business, expenses will be deducted, and you will have very little or even might have nothing to pay for the taxe professionelle. Investment and profit Speaking of money, what are you willing to invest in order to get the return you wish to have? A guest bedroom has to be attractive in order to command a certain price. Again, the choice is as wide as it is personal. Just remember, no matter the price, the chores remain the same. Ask yourself. Are you better off with four cheap rooms or two luxurious suites? Are you willing to invest for today’s guests who expect much more when it comes to amenities? No one wants to share a bathroom anymore. Beds, mattresses, pillows, sheets, blankets, and towels have to be up to certain standards, as they will have to stand the test of time. If you intend to have two rooms, think of having a double bed in one and two twin beds in the other, thus allowing yourself to have flexibility. You will have to invest in a good water heater. Look up and compare existing chambres d’hôtes and then try to define your own style. The décor can be luxurious and lavish or simple yet sophisticated. Just avoid the mundane, the no surprises, the run-of-the-mill type of accommodation."
    }
]