[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA3LzA3L2NoYW5ncGVuZy16aGFvLWNhbGxzLWV4ZWMtZGVwYXJ0dXJlcy1mdWQv0gFaaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDcvMDcvY2hhbmdwZW5nLXpoYW8tY2FsbHMtZXhlYy1kZXBhcnR1cmVzLWZ1ZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jul 2023 07:00:00 GMT",
        "title": "Binance CEO 'CZ' Brushes Off News of Top Executive Departures - CoinDesk",
        "content": "Earlier, Fortune reported that high-profile personnel in senior leadership positions, including Chief Strategy Officer Patrick Hillmann, Senior Director of Investigations Matthew Price and SVP for Compliance Steven Christie had left the company because of CZ’s response to an ongoing investigation by the U.S. Department of Justice. Hillman tweeted that he was leaving the exchange on good terms and it’s “simply time for me to move on to the next challenge,\" while Christie tweeted that he has \"nothing but respect for the highly talented individuals that dedicate themselves to doing the right thing\" at Binance and that it was just time to take some time off for him and his family."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmJsb2NrY2hhaW5nYW1lci5iaXovZmVhdHVyZXMvMjU2NDcvYm5iLXNvbGFuYS1mYWRlLXBvbHlnb24tbW9zdC1wb3B1bGFyLWJsb2NrY2hhaW4tZm9yLWdhbWVzL9IBbWh0dHBzOi8vd3d3LmJsb2NrY2hhaW5nYW1lci5iaXovYW1wL2ZlYXR1cmVzLzI1NjQ3L2JuYi1zb2xhbmEtZmFkZS1wb2x5Z29uLW1vc3QtcG9wdWxhci1ibG9ja2NoYWluLWZvci1nYW1lcy8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jul 2023 07:00:00 GMT",
        "title": "BNB and Solana fade as Polygon becomes most popular blockchain for games - Blockchain Gamer",
        "content": "BNB and Solana fade as Polygon becomes most popular blockchain for games\n\nSign up to our Substack, follow us on Twitter and connect with us on Linkedin.\n\nAt the halfway mark through 2023 we’re crunching data from the Big Blockchain Game List. First up, we’re looking at the number of blockchain games that have ceased development.\n\n158 blockchain games were discontinued during H1 2023, bringing the total of games that have been taken off the list because they have been discontinued to 248.\n\nBNB experienced the highest number of failures with 39 titles, followed by Polygon (26) and Ethereum (27), although in the case of Ethereum, many of those games have transitioned to other EVM chains. Champions Ascension’s move from Ethereum to Polygon is one high profile example.\n\nSolana lost 24 games: again this isn’t surprising given market conditions.\n\nLooking at the blockchains with the most games, the trend is similar with BNB losing its #1 position to Polygon, which currently has 98 games (12%) compared to BNB’s 80 (10%).\n\nEthereum is third on 10% followed by Solana on 6% and IMX on 5%. Notably, Solana has slipped back from 10% to 6% since November 2022 whilst IMX has seen an increase from 3%.\n\nThe largest gainer is the category Multichain games, which includes games deployed on one or more chains, currently on 17%."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL3d3dy50cmFkaW5ndmlldy5jb20vbmV3cy90cmFkaW5ndmlldzowMzhlODA1MDYwOTRiOjAtYm5iLWJpbmFuY2UtaGFsdHMtd2l0aGRyYXdhbHMtYW5kLWRlcG9zaXRzLWZvci1zZXZlcmFsLW11bHRpY2hhaW4tdG9rZW5zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jul 2023 07:00:00 GMT",
        "title": "BNB: Binance Halts Withdrawals and Deposits for Several Multichain Tokens - TradingView",
        "content": "Binance\n\nAfter an upgrade to bridging platform Multichain caused technical issues resulting in a 30% selloff of its native token MULTI in May, Binance has now announced that it is halting both withdrawals and deposits for several tokens associated with the project. The largest crypto exchange in the world has not yet provided an official reason for the action, but it will come into effect this Friday. Some of the tokens which will have support suspended include Polkastarter (POLS) and Alchemy Pay (ACH).\n\nBinance had already temporarily suspended withdrawals and deposits for some assets associated with Multichain in late May, after many of its multichain pathways became non-functional, reportedly due to “technical issues”. It was also later rumored that the platform’s CEO, Zhaojun, (who had control over some of the project's functionality) had been arrested by Chinese authorities. Despite the halting of withdrawals and deposits, most of the network’s functionality has been restored since the incident.\n\n(About Binance)\n\nBinance is a prominent and highly popular cryptocurrency exchange that provides a platform for individuals and institutions to trade various cryptocurrencies. Founded in 2017 by Changpeng Zhao (better known as \"CZ\"), Binance quickly gained traction and became the largest and most influential exchange in the cryptocurrency market. Binance has also developed its own native cryptocurrency called Binance Coin (BNB). BNB serves multiple purposes within the Binance ecosystem, including reduced trading fees, participation in token sales on the Binance Launchpad platform, and to power its own blockchain known as BNB Chain."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8venljcnlwdG8uY29tL2JpbmFuY2UtYm9zcy16aGFvLXRpcHMtd2hlbi10aGUtbmV4dC11bnN0b3BwYWJsZS1iaXRjb2luLWJ1bGwtcnVuLXdpbGwtYmVnaW4v0gFmaHR0cHM6Ly96eWNyeXB0by5jb20vYmluYW5jZS1ib3NzLXpoYW8tdGlwcy13aGVuLXRoZS1uZXh0LXVuc3RvcHBhYmxlLWJpdGNvaW4tYnVsbC1ydW4td2lsbC1iZWdpbi8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jul 2023 07:00:00 GMT",
        "title": "Binance Boss Zhao Tips When The Next Unstoppable Bitcoin Bull Run Will Begin - ZyCrypto",
        "content": "Advertisement\n\nBitcoin is changing hands for over $30,000 per coin as institutional capital floods into the market following a number of high-profile exchange-traded fund filings.\n\nBut when will the bellwether cryptocurrency enter a new super-bullish cycle?\n\nBinance CEO Changpeng “CZ” Zhao recently shared his prediction for the next parabolic Bitcoin bull run while giving his thoughts on BlackRock’s giant entry into the crypto market.\n\nRelentless BTC Bull Run Likely After Halving: Zhao\n\nBinance chief executive officer Changpeng Zhao has revealed when he expects the onset of the next major bull run.\n\nSpeaking during a Twitter AMA session on July 5, Zhao noted that the price of bitcoin has typically moved in four-year-long cycles, and he believed this trend would likely continue. Although the Binance chief acknowledged that he could not predict the future accurately, Zhao maintained that 2025 would be the most likely year for the next majestic bull market as it will be the year after the next Bitcoin halving event. “The year after Bitcoin halving is usually the bull year,” CZ said.\n\nAdvertisement\n\nTrue to form, BTC tends to chalk out massive gains in the months after halving the mining rewards. The fourth halving is due in early 2024.\n\nDuring the “ask me anything” session, Zhao also said that BlackRock’s recent foray into the spot bitcoin exchange-traded fund territory is “hugely beneficial” for the nascent cryptocurrency industry.\n\nBlackRock, the world’s largest asset manager with $9.5 trillion under management, applied to the U.S. Securities and Exchange Commission (SEC) for a spot Bitcoin exchange-traded fund (ETF) a few weeks ago.\n\nPundits think the odds are in favour of the financial giant, which is almost unbeaten when going up against the SEC, at 575-1, as nearly every single one of its ETF filings has received a green light.\n\nBitcoin may be far below the all-time high of $69,044 it registered in November 2021, but this much is undeniable: It had transcended expectations in 2023 by jumping over 85% since the beginning of the year when it was trading at around $17,000. BTC has spiked by circa 20% since BlackRock’s spot ETF filing, wildly as more companies rushed to submit their applications.\n\nZhao further dismissed some worries that BlackRock could take up Binance’s market share in the course of time, noting that the overlap between their respective customer bases was “minimal.”\n\n“Anyone who’s coming into crypto that’s not in crypto today will bring additional people into crypto. Will they compete for any of the existing users with us? Yes, probably a little bit. But to be honest, look at our user base. The overlap is minimal.”\n\nFor Zhao, the heightened institutional demand and Bitcoin’s forthcoming halving are the two key factors why Binance aims to be “prepared for higher [trading] volumes” in the coming eighteen months."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vcm9ib3RpY3NhbmRhdXRvbWF0aW9ubmV3cy5jb20vMjAyMy8wNy8wNi90aGUtYmVuZWZpdHMtYW5kLWRyYXdiYWNrcy1vZi11c2luZy1iaW5hbmNlLWNvaW4tZm9yLXRyYW5zYWN0aW9ucy82OTg0Ny_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jul 2023 07:00:00 GMT",
        "title": "The Benefits and Drawbacks of Using Binance Coin for Transactions - Robotics and Automation News",
        "content": "Cryptocurrencies have taken the world by storm over the past few years, with their decentralized nature and anonymity making them an attractive alternative to traditional forms of currency.\n\nAmong these digital assets, Binance Coin (BNB) stands out as one of the most popular options. As the native cryptocurrency of the Binance exchange, which is one of the largest and most reputable cryptocurrency exchanges globally, BNB has established itself as a dominant force in the crypto world.\n\nOne of the primary benefits of using Binance Coin is that it allows for quick and easy transactions on the Binance exchange.\n\nBecause BNB is the native currency of the exchange, users can use it to pay for trading fees, withdrawal fees, and other fees that are associated with using the platform.\n\nBinance offers a discount on these fees for users who pay with BNB, making it a cost-effective option for frequent traders.\n\nImmediate Connect which is an Online trading platform also allows users to make use of cryptocurrencies such as Bitcoin, Ethereum, and Litecoin to name a few, for fast and secure trading.\n\nMoreover, Binance Coin has a limited supply, with a maximum of 200 million coins set to be created. This means that as demand for BNB increases, its value is likely to appreciate, providing users with an opportunity to earn significant returns on their investment.\n\nAnother advantage of using Binance Coin is its utility beyond just the Binance exchange. Binance has partnered with numerous businesses and merchants to accept BNB as a form of payment, expanding its use case beyond just the crypto world.\n\nFurthermore, Binance has developed its blockchain ecosystem called Binance Smart Chain, which allows for the creation of decentralized applications (dApps) and smart contracts using BNB. This opens up new possibilities for Binance Coin beyond just being a currency for trading fees.\n\nHowever, as with any investment, Binance Coin has some drawbacks that should be considered before investing. One potential downside is the volatility of the crypto market.\n\nThe value of Binance Coin, like any cryptocurrency, can fluctuate rapidly based on market conditions, making it a high-risk investment.\n\nFurthermore, while Binance Coin is a widely accepted cryptocurrency, its acceptance outside of the Binance ecosystem is limited.\n\nThis means that users who want to spend their BNB on goods and services outside of the Binance network may face difficulty finding merchants who accept it as a form of payment.\n\nBenefits of Using Binance Coin\n\nLower Transaction Fees\n\nOne of the most significant benefits of using Binance Coin for transactions is the lower transaction fees. Binance charges a 0.1% fee for every trade made on its platform.\n\nHowever, if you use Binance Coin to pay for the transaction fees, you can get a discount of up to 25%. This can significantly reduce the transaction fees, making it a more cost-effective option for traders.\n\nFaster Transaction Speeds\n\nAnother benefit of using Binance Coin is faster transaction speeds. Binance Coin uses the Binance Smart Chain, which is a faster and cheaper alternative to the Ethereum blockchain.\n\nThis means that transactions made using Binance Coin are processed much faster than those made using Ethereum.\n\nWide Range of Use Cases\n\nBinance Coin has a wide range of use cases. It can be used to pay for transaction fees on the Binance exchange, as well as for goods and services on other platforms that accept Binance Coin.\n\nAdditionally, Binance Coin can be used to participate in token sales and to pay for the listing of new cryptocurrencies on the Binance exchange.\n\nDrawbacks of Using Binance Coin\n\nVolatility\n\nLike most cryptocurrencies, Binance Coin is highly volatile. Its value can fluctuate rapidly, which means that there is a risk of losing money if you hold Binance Coin for an extended period of time.\n\nWhile this can also be an advantage for traders, it can be a drawback for those who want to use Binance Coin as a means of payment.\n\nLimited Acceptance\n\nWhile Binance Coin has a wide range of use cases, it is still not widely accepted as a means of payment. This means that there are limited options available for those who want to use Binance Coin to pay for goods and services.\n\nHowever, the acceptance of Binance Coin is expected to grow as more merchants and businesses begin to accept cryptocurrencies.\n\nCentralized\n\nAnother drawback of using Binance Coin is that it is centralized. This means that Binance has control over the supply and distribution of Binance Coin.\n\nWhile this may not be a concern for most users, it does mean that there is a risk of Binance Coin being manipulated by the exchange.\n\nMany Benefits\n\nBinance Coin offers many benefits to its users, including lower transaction fees, faster transaction speeds, and a wide range of use cases.\n\nHowever, it also has some drawbacks that should be taken into consideration, including volatility, limited acceptance, and centralization. Overall, Binance Coin is a promising cryptocurrency that has the potential to become more widely accepted in the future.\n\nMoreover, for a comprehensive exploration of cryptocurrency investments and trading, make sure to check out solarblox.co. This website offers a wealth of information and resources to empower your crypto journey."
    }
]