[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmJ1c2luZXNzaW5zaWRlci5jb20vaG93LXRleGFzLWNvdXBsZS1yZXN0b3JlZC1tb3JlLXRoYW4tY2VudHVyeS1vbGQtaGlzdG9yaWMtaG9tZS0yMDIzLTTSAWhodHRwczovL3d3dy5idXNpbmVzc2luc2lkZXIuY29tL2hvdy10ZXhhcy1jb3VwbGUtcmVzdG9yZWQtbW9yZS10aGFuLWNlbnR1cnktb2xkLWhpc3RvcmljLWhvbWUtMjAyMy00P2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Apr 2023 07:00:00 GMT",
        "title": "See how a couple restored a 110-year-old home into a rainbow paradise - Business Insider",
        "content": "In 2020, Katie Heim and her wife purchased a historic mansion in Gonzales, Texas.\n\nThe couple restored the home and renovated it with their unique sense of style.\n\nTake a look at the home's bright and colorful rooms, and its one-of-a-kind treasures.\n\nSign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time by visiting our Preferences page or by clicking \"unsubscribe\" at the bottom of the email.\n\nAdvertisement\n\nKatie Heim, 45, is a seventh-generation Texan with a soft spot for the Victorian era. In 2020, she found the home of her dreams: A more than century-old mansion built in the historic city of Gonzales, Texas.\n\nThe eight-bedroom and six-and-a-half-bathroom home was built in 1913 by Emily James \"Jimmie\" Lea Boothe, the wife of Joseph Henry Boothe, a former mayor of Gonzales. It was designed by Atlee B. Ayres, the famed architect that revolutionized architecture in San Antonio.\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now. Have an account? Log in ."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY3J5cHRvdHZwbHVzLmNvbS8yMDIzLzA0L2JuYi1xdWFydGVybHktYnVybi1jb21wbGV0ZWQtd2hhdC15b3Utc2hvdWxkLWtub3cv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Apr 2023 07:00:00 GMT",
        "title": "BNB Quarterly Burn Completed: what you should know - CryptoTvplus",
        "content": "The Binance ecosystem has completed its 23rd quarterly BNB token burn. The second quarterly burn includes an Auto-Burn as well as the Pioneer Burn Program where 2,020,132.25 BNB was burned via the Auto-Burn and 656.0230123 BNB effectively burned via the Pioneer Burn Program. The burn value in USD amounts to $676,744,304 and the Real Burn (Auto-Burn – Pioneer Burn) totaled 2,019,476.2269877 BNB.\n\nBinance made a commitment upon the launch of the platform in 2017 to remove 100 million BNB which is half of its total supply from circulation through a burning process. This means only 100 million BNB will be kept in circulation.\n\nIn 2021 Binance introduced a new procedure for quarterly BNB Burn, BNB Auto Burn. Interestingly, the burn will be based on the price of BNB. BNB Auto-Burn is an independent auditable method separate from Binance’s centralized exchange. The numbers are released quarterly and a percentage of BNB Chain’s gas fees are also still burned in real-time using the Real-Time-Burn method.\n\nThe Pioneer Burn Program also permanently removes from the market an amount of BNB equal to the money that has been proven to have been lost by qualified BNB Chain users. The overall quarterly burn amount is then calculated using the value obtained. Over 145,600 BNBs have been burned using this since the release of BEP-95. BEP-95 refers to Binance Evolution Proposal and introduces a real-time burning mechanism to BNB Smart Chain (BSC).\n\nBNB facilitates the BNB Chain ecosystem and is the native coin of the BNB Beacon Chain, the BNB Smart Chain, and the latest BNB Greenfield blockchain.\n\nGreenfield is a newly announced blockchain released in February 2023. It is a decentralized storage infrastructure for the webspace that enables users and decentralized apps (DApps) to produce, store, and exchange data with full ownership, thereby building a new data economy.\n\n23rd Quarterly BNB Burn Txid: https://explorer.bnbchain.org/tx/926B2A741628272FE9CC3883485CED145EADFE7EB3A900F3E5A45DD70AAEB25D\n\nThe market impact after 24 hours according to Coinmarketcap shows the price of BNB at $333.74 with a 24-hour trading volume of $766,876,569. BNB is up 0.28% in the last 24 hours at the time of writing.\n\nRead also;\n\nFloki teams up with Badminton Asia\n\nWhat do you think of this article? Share comments below."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY3J5cHRvdHZwbHVzLmNvbS8yMDIzLzA0L3R1c2QtdGFrZXMtb2ZmLWFzLWEtbmF0aXZlLXRva2VuLW9uLWJuYi1jaGFpbi0yL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Apr 2023 07:00:00 GMT",
        "title": "TUSD takes off as a native token on BNB Chain - CryptoTvplus",
        "content": "The TUSD team has announced the launch of its stablecoin TUSD on the BNB Chain as a native token. Individual and institutional clients can now mint and redeem native BSC (BNB Smart Chain) TUSD using the TUSD website. This action represents a turning point in TUSD’s multi-chain deployment and opens the door for TUSD’s deeper integration into the BSC (BNB Smart Chain) ecosystem.\n\nTUSD has embraced the multi-chain movement in recent years and has backed several chains, supplying reliable, high-quality liquidity to some DeFi ecosystems to strengthen their infrastructure.\n\nTUSD has been implemented on more than ten different public chains in addition to being native to a few other blockchains, such as TRON and Ethereum, in addition to BNB Smart Chain. TUSD holders can now participate in diverse blockchain ecosystems more quickly and easily through the support of crypto exchanges like Binance, Huobi, Poloniex, and OKX to deposit and withdraw different versions of TUSD.\n\nTUSD has formed a strong partnership with the Binance ecosystem. In terms of exchanges, the Binance exchange has introduced 13 TUSD spot trading pairs, including “TUSD/BTC, TUSD/ETH, TUSD/BNB, and TUSD/ARB,” with a trading volume of approximately $1,234,642,407 in the previous day.\n\nFurthermore, TUSD has been added to many Binance products, such as Binance VIP Loan and Binance Launchpad. Binance Futures supports TUSD as a margin asset in Multi-Assets Mode.\n\nTUSD has been successfully deployed on various chains within the BSC ecosystem and went live on PancakeSwap, Ellipsis, and other decentralized exchanges in the ecosystem. TUSD is also supported by some lending protocols, including Venus and Valas, as well as yield aggregators such as Acryptos and Beefy. As a result of these developments, it is anticipated that TUSD will gain acceptance from a larger group of users and protocols, further solidifying its position within the Binance ecosystem.\n\nAbout TUSD\n\nTUSD is the first stablecoin to provide live 24-hour attestation on the blockchain. TUSD’s collaboration with many banks and other organizations allows holders to mint and redeem their tokens around the clock. TUSD also uses some other techniques to guarantee industry-leading stability, security, and transparency. It evolved to become the first stablecoin with USD backing to use Proof of Reserves to safeguard minting after connecting with Chainlink.\n\nStablecoins serve as a link between cryptocurrencies and the real world. It is envisaged that TUSD will continue to be a model of openness, security, and robustness, extending its use cases at a lower cost while bringing in more market-oriented options and higher returns for its users.n\n\nRead Also;\n\nhttps://cryptotvplus.com/2023/04/cryptogpt-raises-10m-in-funding-valued-at-250m/"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3QvYWxwYWNhLWZpbmFuY2UtbGF1bmNoZXMtcGVycGV0dWFsLWZ1dHVyZXMtZXhjaGFuZ2Utb24tYm5iLWNoYWlu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Apr 2023 13:26:01 GMT",
        "title": "Alpaca Finance Launches Perpetual Futures Exchange on BNB Chain - BSC NEWS",
        "content": "BNB\n\nAlpaca Finance brings advanced security measures and attractive rewards program to perpetual futures trading on BNB Chain.\n\nDeFi Milestone for Alpaca Finance\n\nDecentralized Finance (DeFi) platform Alpaca Finance has launched its highly anticipated Perpetual Futures Exchange on the BNB Chain.\n\nWith up to 50x leverage on BTC, ETH, and BNB, the exchange provides an attractive instrument for both speculation and hedging.\n\nTo celebrate the launch, Alpaca Finance is offering zero-fee trading for a limited time. The company's Perp Exchange is fully decentralized, meaning users retain control of their funds at all times. This makes the funds immune to being frozen or becoming inaccessible for any reason, with their presence always being visible on-chain.\n\n\"Unlike centralized exchanges offering futures contracts, Alpaca’s Perp Exchange is fully decentralized, meaning users retain control of their funds at all times. This makes the funds immune to being frozen or becoming inaccessible for any reason, with their presence always being visible on-chain,\" the Alpaca team revealed to BSC News.\n\nWith $366 million in total value locked (TVL), Alpaca Finance is already a major player in the DeFi space. The platform operates the largest products in two DeFi verticals, Smart Vaults, and Leveraged Yield Farming. The company has been operational for two years, has had an industry-leading 21 professional security audits, and has demonstrated a spotless security track record with no exploits.\n\nAlpaca Finance’s Perpetual Futures Exchange offers value to not only traders but also liquidity providers and market makers. To provide liquidity, users can buy ALP tokens representing their share in the liquidity pool for the Perp Exchange. The liquidity pool is an Index-like pool consisting of blue-chip assets such as BTC, ETH, BNB, USDT, and USDC. Currently, the pool offers 19% APY on the deposited funds.\n\nTo offer a reliable trading experience, Alpaca’s Perp Exchange uses a price oracle system that sources data from multiple providers to ensure the most accurate and reliable pricing information. The product interface aims to be user-friendly, making it easy for both new and experienced traders to use the platform.\n\nThe Perp Exchange is currently in beta testing mode, with a full launch and the start of a larger rewards campaign scheduled for April 6, 2023. Alpaca Finance is aiming to replicate the success of the GMX Perpetual Exchange on Arbitrum by bringing its security expertise and decentralized approach to the perpetual futures market on the BNB Chain.\n\nAlpaca Finance’s Perpetual Futures Exchange is a major development in the DeFi space, providing traders with a reliable and user-friendly platform for perpetual futures trading. With its decentralized approach, advanced security measures, and attractive rewards program, Alpaca Finance is well-positioned to become a leading player in the perpetual futures market.\n\nWhat is Alpaca Finance:\n\nAlpaca Finance is one of the largest lending protocols that allows leveraged yield farming on BNB Chain. It helps lenders to earn safe and stable yields, and offers borrowers undercollateralized loans for leveraged yield farming positions, vastly multiplying their farming principles and resulting profits.‌\n\nAlpaca Finance prides itself on being a fair-launch project with no pre-sale, no investor, and no pre-mine. From the beginning, the project has always been a product built by the people, for the people––or as the Alpaca team likes to say: by the Alpacas, for the Alpacas.\n\nWhere to find Alpaca Finance:\n\nWebsite | Twitter | Telegram | Discord | Medium | GitHub |"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmhlcmFsZG5ldC5jb20vdHJhdmVsL3ZpY3Rvcmlhbi1ob21lLXB1enpsZS1pbnNwaXJlZC10aGlzLWxha2Utc3RldmVucy1tYW5zaW9uLTIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Apr 2023 07:00:00 GMT",
        "title": "A puzzle inspired this Victorian-style bed-and-breakfast in Lake Stevens | HeraldNet.com - The Daily Herald",
        "content": "Jessica Miguel is manager and caretaker of the Mansion Inn in Lake Stevens. Olivia Vanni / The Herald\n\nBy Sara Bruestle\n\nDespite its majesty, it’s likely you don’t even know it’s there. On the north shore of Lake Stevens, near Everett, WA, a Victorian beauty reigns.\n\nAbout a 15-minute stroll from downtown, the Mansion Inn is an award-winning bed-and-breakfast with lake and mountain views on all three floors.\n\nThe rambling 10,490-square-foot home features six rooms for rent, a grand staircase in the lobby, two dining rooms, a great room with fireplace, an 11-foot bar, a chef’s kitchen and a pool.\n\nThe B&B has earned six Booking.com’s Guest Review Awards, the latest from 2021, but out of nearly 500 guests who booked a room within the last year, only about 20 were from the area. It’s a Lake Stevens secret.\n\n“We have found that 90 percent of the locals don’t know this is here,” said Jessica Miguel, who keeps the inn. “That’s basically nobody.”\n\nWhile built in the Victorian style, construction of the Mansion Inn at Lake Stevens dates closer to the current king than the former queen. The history of this royal retreat, its exterior draped in cerulean blue and chestnut brown, spans only about two decades.\n\nMost of the rooms boast views of Lake Stevens and the Cascade Range. Olivia Vanni / The Herald\n\nThe Victorian aesthetic boomed from 1837 to 1901 amid Queen Victoria’s reign in the U.K., with the trend hitting the U.S. about 50 years later.\n\nNineteenth century architects sought to create complex roof lines — with towers, turrets and dormers — that would pull the eye to the top of the house. These ornately decorated homes are characterized by high pitched roofs, wraparound porches, bay windows, stained glass, decorative trim and bright paint colors.\n\nIf you want the house to yourself, you can rent all six rooms — just know that the innkeepers will still be there. The Mansion Inn isn’t run like a vacation rental.\n\nHosts Jessica and Aaron Miguel live on the third floor and in the carriage house above the garage, whereas the bed and breakfast comprises the first and second floors. The owners’ quarters has five bedrooms, four bathrooms, a kitchen, family room, living room and a jetted-tub room.\n\nThe Miguels have been trying to piece together the history of the house since 2021. The thing is, Snohomish County property records tell only so much.\n\nHere’s a piece of the puzzle: The Mansion Inn at Lake Stevens, according to Jessica, was inspired by a puzzle – literally.\n\nBrad and Sherri Whitsell wanted to own a bed-and-breakfast, but the husband and wife couldn’t find a house that they liked in Snohomish County. While shopping in the toy aisle at Fred Meyer, Brad saw a puzzle featuring a Victorian home that looked like the Lake Stevens inn.\n\nThe house was exactly what they’d been searching for, so Brad bought the puzzle, took it home to Sherri and said, “Honey, I found our house.”\n\nAfter purchasing a half-acre lot on Mitchell Drive, the Whitsells hired a father-and-son contractor to design and build the inn. The garage with carriage house was built in 2000, and so the owners lived there, while the bed and breakfast was under construction. Four years later, the Lake Stevens inn was open for business.\n\nWhether historical restorations or modern reproductions, there’s one thing these Victorian homes have in common — there’s no lack of character.\n\n“It’s perfect for a weekend getaway,” Jessica Miguel said. “Maybe you just need a night out. Relax in your room, enjoy a nice hot breakfast, take in the views.”\n\nJessica’s father, Stephen Tracy, purchased the inn in 2021, the latest of about 10 who’ve owned the house, according to property records.\n\n“I was curious about it for about a year and a half,” Tracy said. “I fell in love with it the moment I walked through the doors. When I found out that it was for sale, and that it was a running business, that’s when I realized I had to have it.”\n\nLooking northeast from the Mansion Inn toward Lake Stevens and the Cascades. Olivia Vanni / The Herald\n\nIt just so happens that hospitality is Tracy’s line of work. He also owns the Creekside Alehouse & Grill in Lake Stevens and Chan’s Place, with locations in Woodinville and Issaquah.\n\nTracy, of Woodinville, asked the Miguels to move from Las Vegas to Lake Stevens to run the B&B. He wanted his daughter, son-in-law and grandkids to live closer to him — and this was a business opportunity for all of them.\n\nJust as Tracy hoped, the Mansion Inn is a family-run business. While Jessica, 45, and Aaron, 47, are the innkeepers, their kids, Cody, 25, and Adelaide, 15, help them prepare the rooms for guests each day. The four split the long list of chores — they’ve learned to specialize their cleaning and maintenance tasks.\n\n“It’s a busy life, but it’s a good life,” Jessica Miguel said. “I mean, look out the window at that view. It really is nice.”\n\nFrom the home’s many windows, you can see the blue expanse of the city’s namesake – the largest natural lake in the county – rimmed by beaches and boat launches. If not the activity from canoes, jet skis, sailboats, surfboards, rowboats and windsurfers, you can take in the grandeur of the Cascade Range.\n\nAfter taking over the inn, the Miguels bought all new mattresses, bedding and towels. They also moved the laundry room to the second floor so no stairs are involved between loads of sheets and towels.\n\nThough she’s no chef, Jessica whips up a hot breakfast from the chef’s kitchen. Breakfast is served at 9 a.m. every day.\n\n“I cook old-fashioned breakfasts like my grandma used to make — biscuits and gravy, fruit, scrambled eggs and the like — and our guests tend to love it,” she said.\n\nIf you don’t want to take breakfast in one of the dining rooms, you can find a seat at one of three patio tables on the wraparound porch. It’s a favorite breakfast spot among guests.\n\nCan’t make the 9 a.m. breakfast? The inn also offers a to-go menu with toast and jam, bagels and cream cheese, muffins, etc.\n\nTracy said the Miguels’ job is to make you feel like you’re staying in a quaint B&B even though the house itself is, well, massive.\n\n“We try to keep it homey,” he said. “They’re doing a beautiful job. The place is beautiful all the time.”\n\nIf you go\n\nThe Mansion Inn, 1513 Mitchell Dr., Lake Stevens, is a bed and breakfast in a Victorian-style inn at Lake Stevens. Six rooms are available for booking, all with their own private bathroom, TV, fan and a hairdryer. Visit mansioninnlakestevens.com to book your stay in one of six available rooms. Check-in is at 3 p.m. and check-out is at 11 a.m. Breakfast is served at 9 a.m. Please BYOB — the bar is stocked with everything but the liquor. The pool isn’t open to guests at this time.\n\nCall 425-610-4746 or email info@mansioninnlakestevens.com for more information.\n\nSound & Summit\n\nThis article is featured in the spring issue of Sound & Summit, a supplement of The Daily Herald that invites you to explore Snohomish and Island counties with each quarterly magazine.\n\n***\n\nPlan your adventures throughout the West Coast at westcoasttraveller.com and follow us on Facebook and Instagram @thewestcoasttraveller. And for the top West Coast Travel stories of the week delivered right to your inbox, sign up for our weekly Armchair Traveller newsletter!"
    }
]