[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1ob2xkcy1uZWFyLTIzNzAwLXNvbGFuYS1ibmItcmlzZS11cC10by02L2FydGljbGVzaG93Lzk3NDM2NDQ0LmNtc9IBkwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1ob2xkcy1uZWFyLTIzNzAwLXNvbGFuYS1ibmItcmlzZS11cC10by02L2FtcF9hcnRpY2xlc2hvdy85NzQzNjQ0NC5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin holds near $23,700; Solana, BNB rise up to 6% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nNew Delhi: The cryptocurrency market was trading in the green on Monday. Bitcoin (BTC) rose 2% to $23,700, whereas Ethereum (ETH) was above the $1,600 level. BTC volume in the last 24 hours stood at approximately $25.72 billion, rising 46.95% in the last 24 hours.\"BTC gained 2% in the past 24 hours and is currently trading above the US$23,600 level. If bulls can hold BTC above the current level, the impulse may continue towards US$24,000 and US$25,000 soon. The volume is also high, indicating the buyers' strength in the market,\" Edul Patel, CEO and Co-Founder of Mudrex said.Other top crypto tokens were also trading higher. Solana rose 6%. Polkadot Shiba Inu, Dogecoin and BNB were also trading with gains.The global cryptocurrency market cap was trading around $1.07 trillion, rising 1.54% in the last 24 hours.The total volume in DeFi is currently $3.59 billion, 7.21% of the total crypto market 24-hour volume. The volume of all stablecoins is now $44.28 billion, which is 88.98% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, hovered around $457.24 billion, with a dominance of about 42.47%, an increase of 0.18% over the day, according to CoinMarketCap.\"It does seem like the winter is over for the crypto market. With two significant announcements said to be approaching this week (The national union budget and the US Fed FOMC meeting), the respective impact of both can cause a significant shift in price levels of major cryptocurrencies, ensuing high chances for volatility,” Marc Despallieres, Chief Strategy & Trading Officer at Vantage said.“Nevertheless, the affirmative outlook towards cryptocurrencies might push the bullish sentiment even further if the regulatory steps are taken keeping the interest of active market players in the VDA segment in mind,\" he added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 11.28 hours, IST on January 30, 2023)Bitcoin $ 23,699 2%Ethereum $1,635 2.38%Tether $1 -0.02%USD Coin $1 -0.01%BNB $314.95 2.02%XRP $0.4127 0.43%Dogecoin $0.08915 0.40%Cardano $0.3922 1.34%Polygon $1.16 0.83%Polkadot $6.55 0.60%Tron $0.06345 0.09%Litecoin $94.91 -0.32%Shiba Inu $0.00001208 1.34%Solana $25.55 5.86%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1ob2xkcy1uZWFyLTIzNzAwLXNvbGFuYS1ibmItcmlzZS11cC10by02L2FydGljbGVzaG93Lzk3NDM2NDQ0LmNtc9IBkwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1ob2xkcy1uZWFyLTIzNzAwLXNvbGFuYS1ibmItcmlzZS11cC10by02L2FtcF9hcnRpY2xlc2hvdy85NzQzNjQ0NC5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin holds near $23,700; Solana, BNB rise up to 6% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nNew Delhi: The cryptocurrency market was trading in the green on Monday. Bitcoin (BTC) rose 2% to $23,700, whereas Ethereum (ETH) was above the $1,600 level. BTC volume in the last 24 hours stood at approximately $25.72 billion, rising 46.95% in the last 24 hours.\"BTC gained 2% in the past 24 hours and is currently trading above the US$23,600 level. If bulls can hold BTC above the current level, the impulse may continue towards US$24,000 and US$25,000 soon. The volume is also high, indicating the buyers' strength in the market,\" Edul Patel, CEO and Co-Founder of Mudrex said.Other top crypto tokens were also trading higher. Solana rose 6%. Polkadot Shiba Inu, Dogecoin and BNB were also trading with gains.The global cryptocurrency market cap was trading around $1.07 trillion, rising 1.54% in the last 24 hours.The total volume in DeFi is currently $3.59 billion, 7.21% of the total crypto market 24-hour volume. The volume of all stablecoins is now $44.28 billion, which is 88.98% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, hovered around $457.24 billion, with a dominance of about 42.47%, an increase of 0.18% over the day, according to CoinMarketCap.\"It does seem like the winter is over for the crypto market. With two significant announcements said to be approaching this week (The national union budget and the US Fed FOMC meeting), the respective impact of both can cause a significant shift in price levels of major cryptocurrencies, ensuing high chances for volatility,” Marc Despallieres, Chief Strategy & Trading Officer at Vantage said.“Nevertheless, the affirmative outlook towards cryptocurrencies might push the bullish sentiment even further if the regulatory steps are taken keeping the interest of active market players in the VDA segment in mind,\" he added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 11.28 hours, IST on January 30, 2023)Bitcoin $ 23,699 2%Ethereum $1,635 2.38%Tether $1 -0.02%USD Coin $1 -0.01%BNB $314.95 2.02%XRP $0.4127 0.43%Dogecoin $0.08915 0.40%Cardano $0.3922 1.34%Polygon $1.16 0.83%Polkadot $6.55 0.60%Tron $0.06345 0.09%Litecoin $94.91 -0.32%Shiba Inu $0.00001208 1.34%Solana $25.55 5.86%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1ob2xkcy1uZWFyLTIzNzAwLXNvbGFuYS1ibmItcmlzZS11cC10by02L2FydGljbGVzaG93Lzk3NDM2NDQ0LmNtc9IBkwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1ob2xkcy1uZWFyLTIzNzAwLXNvbGFuYS1ibmItcmlzZS11cC10by02L2FtcF9hcnRpY2xlc2hvdy85NzQzNjQ0NC5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin holds near $23,700; Solana, BNB rise up to 6% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nNew Delhi: The cryptocurrency market was trading in the green on Monday. Bitcoin (BTC) rose 2% to $23,700, whereas Ethereum (ETH) was above the $1,600 level. BTC volume in the last 24 hours stood at approximately $25.72 billion, rising 46.95% in the last 24 hours.\"BTC gained 2% in the past 24 hours and is currently trading above the US$23,600 level. If bulls can hold BTC above the current level, the impulse may continue towards US$24,000 and US$25,000 soon. The volume is also high, indicating the buyers' strength in the market,\" Edul Patel, CEO and Co-Founder of Mudrex said.Other top crypto tokens were also trading higher. Solana rose 6%. Polkadot Shiba Inu, Dogecoin and BNB were also trading with gains.The global cryptocurrency market cap was trading around $1.07 trillion, rising 1.54% in the last 24 hours.The total volume in DeFi is currently $3.59 billion, 7.21% of the total crypto market 24-hour volume. The volume of all stablecoins is now $44.28 billion, which is 88.98% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, hovered around $457.24 billion, with a dominance of about 42.47%, an increase of 0.18% over the day, according to CoinMarketCap.\"It does seem like the winter is over for the crypto market. With two significant announcements said to be approaching this week (The national union budget and the US Fed FOMC meeting), the respective impact of both can cause a significant shift in price levels of major cryptocurrencies, ensuing high chances for volatility,” Marc Despallieres, Chief Strategy & Trading Officer at Vantage said.“Nevertheless, the affirmative outlook towards cryptocurrencies might push the bullish sentiment even further if the regulatory steps are taken keeping the interest of active market players in the VDA segment in mind,\" he added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 11.28 hours, IST on January 30, 2023)Bitcoin $ 23,699 2%Ethereum $1,635 2.38%Tether $1 -0.02%USD Coin $1 -0.01%BNB $314.95 2.02%XRP $0.4127 0.43%Dogecoin $0.08915 0.40%Cardano $0.3922 1.34%Polygon $1.16 0.83%Polkadot $6.55 0.60%Tron $0.06345 0.09%Litecoin $94.91 -0.32%Shiba Inu $0.00001208 1.34%Solana $25.55 5.86%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2NyeXB0by9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1ob2xkcy0yMzYwMC1zb2xhbmEtZXRoZXJldW0tYm5iLXJpc2VzLXVwLXRvLTYtMzY4MDQ4LTIwMjMtMDEtMzDSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin holds $23600; Solana, Ethereum, BNB rises up to 6% - Business Today",
        "content": "Top crypto tokens were trading higher on Monday, thanks to gains in Bitcoin which flirted with $24,000 level over the weekend. Markets have remained largely hopeful the past week despite conflicting economic data and worrisome fourth quarter earnings reports.\n\nBitcoin was able to hold weekend gains and was firm above $23,500 level. Its largest peer, Ethereum was comfortable above $1,600-mark. Other Altcoins also posted decent gains.\n\nBitcoin hovered at $23,946 level over the weekend as markets continued to react to the US personal consumption data and the rise of investor sentiment. It is the highest level since August 2022, said Edul Patel, CEO and Co-founder at Mudrex.\n\n\"However, BTC is currently trading above the $23,600 level and rose by 2 per cent over the previous day. If bulls can hold BTC above the current level, the impulse may continue towards $24,000 and $25,000 soon. The volume is also high, indicating the buyers' strength in the market,\" he said.\n\nBarring the US dollar pegged stablecoins, all top crypto tokens were trading higher on Monday. Solana surged 6 per cent, followed by Ethereum and BNB. Bitcoin and Polygon also added 2 per cent each during the early trade.\n\nThe global cryptocurrency market cap was trading higher at $1.08 trillion mark, rising about 2 per cent in the last 24 hours. However, the total trading volumes surged 24 per cent close to $49.64 billion.\n\nBitcoin is hitting new three month highs, boosted by institutional buying, wider adoption, and infrastructure improvements. Institutional investors are increasingly taking notice of cryptocurrencies, with companies like Tesla and Square investing in Bitcoin, contributing to demand and higher prices, said Sathvik Vishwanath, co-founder & CEO at Unocoin.\n\n\"Market sentiment plays a big role in the value of Bitcoin, with rising demand and belief that the price will rise to cause a self-fulfilling cycle. However, there is always the risk of market volatility and regulatory changes that may impact growth,\" he said.\n\nCrypto updates\n\nLawyers for Sam Bankman-Fried have argued he should be allowed access to assets and crypto held by his former company FTX, saying there's no evidence he's responsible for previous alleged unauthorized transactions.\n\nEmails obtained by CoinDesk shed new light on the ongoing debate over the opaque and disputed ownership of WazirX, India’s largest crypto exchange. In November 2019, the ownership of WazirX was uncontested: Binance published a blog post saying that it had purchased the Indian exchange. WazirX’s executives talked openly about the acquisition.\n\nTech View by Giottus Crypto Platform\n\nPolygon (MATIC), the popular layer 2 blockchain, has had a great 2022 in terms of its adoption and partnerships. Now, its token seems to be reflecting the added value, having gone from $0.75 earlier this month to nearly $1.2 today.\n\nOn its way, it has cleared several resistance levels, made higher highs and higher lows, and continued to hold its price. With such momentum, short term target of $1.3 (its last high in November) is certainly in play, but with its 200-day EMA untested throughout the month ever since its breakout, there may be some consolidation first. A confluence of resistances and an overbought RSI in the vicinity of the $1.2 level also suggest a path that may see a test of $1.04 first for MATIC.\n\nMajor Levels:\n\nSupport: $1.10, $1.04, $1.0\n\nResistance: $1.25, $1.30\n\n(Views and recommendations given in this section are the analysts' own and do not represent those of Business Today. Please consult your financial adviser before taking any position in the asset/s mentioned.)\n\nAlso read: ‘NFTs can help bring art closer to people': Actor Lisa Ray\n\nAlso read: Stocks in news: Tata Motors, NTPC, Vedanta, L&T, Tech Mahindra and more"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3Qvd2h5LWktYnVpbGQtb24tdGhlLWJuYi1jaGFpbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Why I Build on the BNB Chain - BSC NEWS",
        "content": "BNB\n\nLearn about the great support BNB Chain has given Mr. Lightspeed and why that has been crucial to building on the world's most active chain.\n\nIntroduction\n\nThis article aims to help new project founders and developers find their way on the BNB Chain as well as help those more experienced learn a new thing or two. As a project CEO, I have experienced many difficulties over the course of 2022 with many lessons learned along the way in leading a project: the good, the bad, and the ugly. However, engagement with the BNB Chain team, resources, and opportunities provided to the community are among the top reasons why I stay and build on the BNB Chain.\n\nCommunity Engagement\n\nCommunity Engagement is Mission #1 in the world of crypto and it is no different for those supporting BNB Chain. My first time engaging with the BNB Chain team was at Consensus in June of 2022 located in Austin, Texas. If you have ever never gone to a large conference, add this one to your bucket list!\n\nThis event was the point in my journey as a project CEO where I learned there is a divide between Binance as an exchange and building on BNB Chain as the blockchain. While I engaged the Binance exchange team to help answer questions related to my application as an institutional investor, my eyes were opened to the vast possibilities of building on this blockchain. Why? There was a large presence of BNB Chain Martians and Community Managers available to answer questions and get me pointed in the right direction as I looked to scale up my own project.\n\nThe first thing I learned at the conference is that there are some key resources, grants, incentives, and support systems available to builders. Some are free and some that you must compete to earn. There were thousands of conference attendees to share in this newfound knowledge and I had the chance to meet other founders to share lessons learned.\n\nBNB Chain Developer Program\n\nThe BNB Chain Developer Program is very robust and aimed to drive innovation and adoption of Web3. Many of the opportunities are even chain agnostic. Some programs include a growth incentive program, a builder grant program, a BNB Chain Kickstart program, advisory support programs, a game Jam (brand new!), and trailblazer programs for the best of the best.\n\nGrowth Incentives\n\nThere are several growth incentives programs, but two I wish to highlight are the Gas Fee Incentive Program and the Innovation Pitch Days.\n\nGas Fee Incentive Program\n\nThe BNB Chain Developer Program awards growth incentives to builders and Web3 projects who contribute to the BNB Chain ecosystem. The first opportunity I discovered was the BNB Chain Growth Incentive and is where I started my journey as a founder. Over $10M has been set aside for this program to help projects with user acquisition and growth. There is a simple application form that is filled. You can find the form here. There is a four-step process involved and if you are committed to growing your project and reporting progress then this is a great way to get started. Those steps are:\n\nStep 1 Application: This marks the initial application phase where projects and teams apply to initiate the evaluation process.\n\nStep 2 Evaluation: Relevant applications undergo a thorough evaluation. Upon completion of the application, an assessment process takes place where the BNB Chain team does their due diligence in evaluating the entire project.\n\nStep 3 Decision: Applicants that have fulfilled the evaluation criteria will be notified, and the BNB Chain team will collaborate with you diligently to ensure you put in place effective and useful growth targets.\n\nAnother opportunity to foster growth is Innovation Incubators that are done throughout the world. Most recently, BNB Chain led the European Innovation Incubator.\n\nInnovation Pitch Days\n\nThis was a big opportunity and BNB Chain chose my project, Puli Token, to attend along with about seventy other amazing projects in what I can only best describe as speed dating rounds! Each team had 5 minutes to present in front of a judging panel as well as a large audience of Venture Capitalists (VCs) and interested investors. The judging panel awarded some small prizes at the end to the top teams, but every team got amazing exposure and tremendous feedback plus an opportunity to gain experience and grow. I also had an opportunity to receive additional mentorship for a couple of weeks after the event via 1 to 1 video calls with BNB Chain leaders. Keep your eyes out for the next Innovation Pitch Day in your area.\n\nBesides the growth incentives mentioned above, and there are more you can discover, there are also BNB Chain Grant Programs available.\n\nBNB Chain Builder Grant Program\n\nThe BNB Chain Builder Grant Program provides both financial and non-financial support to aspiring projects. You can expect that the length of the applications and the scrutiny from the reviewers is proportional to the level of support being provided! For example, the Innovation Pitch Day was simple to submit (having had all the pre-requisite materials on hand) while the tailor-made value grant applications were deeply involved and required a full range of managerial and technical experience to pull off.\n\nBNB Chain Grants\n\nGrants are incredibly competitive, and you have to be very prepared. There are two types of grants: General Grants and Category Grants that change monthly. These grants come either as Financial Support in two tiers (Tier 1 are bespoke value grants and Tier 2 are up to $50,000 USD) or as non-financial support such as amplification and visibility, connections to other projects and community members, and dedicated advisory support. Advisory support is also available separately. You can apply for the grants here.\n\nAdvisory Support Programs\n\nI advise projects to take advantage of the Advisory Support Programs early in their process and before launching. BNB Chain provides dedicated advisory support programs that enable selected projects to further innovation and adoption of the Web3 space. You can get a 360-degree review over your technical needs and infrastructure that you will need for your project’s growth. There are also Tokenomics advisors that can review your overall project to ensure you can grow sustainably. You can apply to get some advice here.\n\nBNB Chain Kickstart Program\n\nThis is a new program that was instituted that I wish I had when I was getting started. From the program description:\n\n“The BNB Chain Kickstart Program provides essential tools and services provided by BNB Chain ecosystem partners, aimed to help projects kick start their building journey.\"\n\nProjects that are selected can get deep discounts and complimentary services from security auditors, cloud services, social graph protocols, naming services, infrastructure, wallet sdk, oracles, fiat on-ramp services, launchpads and much more! You can apply for these resources here.\n\nTrailblazer Programs\n\nThere are two trailblazer programs available for top-notch teams ready to take on the toughest challenges: Innovation Incubators and the highly coveted Most Valuable Builder Program\n\nBNB Chain Innovation Incubator\n\nA huge opportunity available for aspiring project leaders and development teams are the innovation incubators held around the world.\n\nFrom the BNB Chain website, “These are three-week virtual programs designed for innovative Web3 startups across Europe to build and scale dApps, driving toward a decentralized future.”\n\nThere is a virtual component as well as a meet-up where projects can present their projects for an opportunity to stand out and be awarded prizes and an opportunity for further exposure and support. Winners get a chance to win up to $50,000 in prizes, complimentary auditing, and token economics consultation. A strong referral to the Most Valuable Builder program is also possible (more on that later).\n\nPersonally, my team was not picked up for the European Innovator, but I got great feedback to further home in my project, achieve additional progress on our products, as well as user growth. I will be trying again soon, but the feedback led to being picked up at the innovation pitch day I mentioned earlier. You can go here to find when the next program starts. Another opportunity that teams can compete for is the BNB Chain Most Valuable Builder (MVB) Accelerator Program.\n\nBNB Chain MVB Accelerator Program\n\nThe MVB program is the most prestigious of all the offerings I have shared in the list. It is not easy to get into and you have to get used to hearing the word, ‘No.’ But that should not discourage you from trying! You will have an opportunity to gain experience and try again.\n\nThe MVB Accelerator Program is a BNB-focused accelerator program between the BNB Chain and Binance Labs to help projects develop and grow more organically through coaching, investment, and network support. This program provides an extensive and informative weekly curriculum for supporting top project teams to deliver a working product that reaches Product-market fit.\n\nThere is a curriculum that includes the following topics:\n\nProduct Design\n\nMarketing and Business Development\n\nData Tooling and Analytics\n\nSecurity and Audit\n\nScaling Infrastructure\n\nTokenomics\n\nFundraising\n\nIf your team can commit full-time to the rigorous program, apply here. Any project at any stage and valuation can compete for a spot in the program. This program encourages all types of innovation and progress within the BNB Chain ecosystem from infrastructure, middleware, DeFi, GameFi, SocialFi, Metaverse and more.\n\nConclusion\n\nI describe in this article why I build on the BNB Chain: Amazing support! I have had chances to apply for some of these opportunities and there are others I look forward to participating when the time is right. I encourage all developers and project teams to review this list and explore what fits for you. 2023 is barely getting started! Be on the lookout for future events led by the BNB Chain team. I hope one is close to you soon so you can meet the team.\n\nMr. Lightspeed, aka Christopher “CJ” Johnson, PhD., is the President of Lightspeed Games, LLC., and the CEO of Puli Token. He is a Binance Affiliate and a BNB Chain Martian where he dedicates his time informing and educating BNB Chain developers and investors of BNB Chain resources and opportunities.\n\n*This is a guest post.*"
    }
]