[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDUvMjUvYm5iLWNoYWluLWV4cGVjdGVkLXRvLXVuZGVyZ28tbHViYW4tdXBncmFkZS1pbi1qdW5lLWhlcmVzLWFsbC15b3UtbmVlZC10by1rbm93L9IBfGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDUvMjUvYm5iLWNoYWluLWV4cGVjdGVkLXRvLXVuZGVyZ28tbHViYW4tdXBncmFkZS1pbi1qdW5lLWhlcmVzLWFsbC15b3UtbmVlZC10by1rbm93L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 May 2023 07:00:00 GMT",
        "title": "BNB Chain Expected to Undergo ‘Luban’ Upgrade in June. Here’s all You Need to Know - CoinDesk",
        "content": "BNB Chain Expected to Undergo ‘Luban’ Upgrade in June. Here’s all You Need to Know\n\nThree distinct enhancements aim to make the network faster and more secure.\n\nBy Shaurya Malwa May 25, 2023 at 9:45 a.m. UTC"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vdHJhdmVsbm9pcmUuY29tL2phbWFpY2FuLW93bmVyLW9mLXZhY2F0aW9uLXJlbnRhbC1jb21wYW55LXNheXMtbm8tbW9yZS1ibGFjay1hbWVyaWNhbi1ndWVzdHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 May 2023 07:00:00 GMT",
        "title": "Jamaican Owner of Vacation Rental Company Says No More Black American Guests - Travel Noire",
        "content": "The Jamaican owner of the Rustic Mountain Living rental company shocked social media by saying she wouldn’t allow any more short-term stays. The reason? She’s fed up with the alleged misbehavior of Black American guests.\n\nIn a TikTok video, “The Barefoot Mountain Lady,” said she doesn’t believe all Black Americans are ill-mannered, but most of the ones she hosted were entitled, unappreciative and generally disrespectful in her presence.\n\nShe said she only ever had two mannerly Black American guests.\n\nThe most eyebrow-raising statement was toward the end. The owner claimed Black Americans are spoiled and expect the same “free sh*t” in Jamaica they supposedly get at home.\n\nIn the video, the woman does errands on her grounds, wades in the sea, and seems completely unbothered.\n\nPeople Had Heated Opinions\n\nUnsurprisingly, the woman’s announcement sparked a firestorm of criticism.\n\nPeople accused her of perpetuating dangerous, offensive stereotypes about Black Americans.\n\nOthers questioned the wisdom of making such a declaration on a public platform seemingly without a second thought. They also wondered how she can work in the hospitality industry and be so inhospitable.\n\nOn Twitter, one user said the owner was parroting white supremacist talking points about Black Americans. But to them, it was more comical than offensive.\n\nSome asked for clarification on the freebies point. “I’d like to receive my free things, please!” wrote one woman. “Is there a newsletter?”\n\nAfter one potential guest criticized the negative energy, The Barefoot Mountain Lady said, “You don’t have to come here.”\n\nAnother user gave the owner advice in the form of a Jamaican proverb: “Anno everything good fi eat, good fi talk,” meaning “some things are better left unsaid.”\n\nThe Owner Is Completely Unfazed and Won’t Back Down\n\nThe Barefoot Island Lady literally laughed at the blowback in yet a third video.\n\n“I’m not sorry,” she said. “You want to unfollow me? Block me? I don’t care.”"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmxlaGlnaHZhbGxleWxpdmUuY29tL25ld3MvMjAyMy8wNS9sYWZheWV0dGUtY29sbGVnZS10by1wdXJjaGFzZS1oaXN0b3JpYy1sYWZheWV0dGUtaW5uLWJlZC1hbmQtYnJlYWtmYXN0Lmh0bWzSAYgBaHR0cHM6Ly93d3cubGVoaWdodmFsbGV5bGl2ZS5jb20vbmV3cy8yMDIzLzA1L2xhZmF5ZXR0ZS1jb2xsZWdlLXRvLXB1cmNoYXNlLWhpc3RvcmljLWxhZmF5ZXR0ZS1pbm4tYmVkLWFuZC1icmVha2Zhc3QuaHRtbD9vdXRwdXRUeXBlPWFtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 May 2023 07:00:00 GMT",
        "title": "Lafayette College to purchase historic Lafayette Inn bed-and-breakfast - lehighvalleylive.com",
        "content": "Lafayette College will assure a historic bed-and-breakfast on the outskirts of its campus will remain a boutique hotel.\n\nThe college announced Thursday it has a deal in place to buy the Lafayette Inn at 525 W. Monroe St. Closing is scheduled for Aug. 31 on the 18-room Georgian mansion that dates to 1895, according to a news release.\n\n“The inn hosts many families visiting their students at Lafayette, potential Leopards touring the campus, and alumni who visit or speak at the college,” said Audra Kahr, Lafayette’s Executive Vice President for Finance and Administration. “We are thrilled to keep the property operating as an inn that will continue to welcome community members, Lafayette families, and visitors to Easton.”\n\nNew York transplant Steele Andrews bought the hotel in 2021. He said he was forced to sell due to expensive repairs caused by roots growing through a sewer line. He blames the previous owners, Laura and Paul Di Liello, for failing to disclose the problem until after the sale.\n\nHe sued the Di Liellos in 2022. The lawsuit was dismissed in April 2023. Andrews said he plans to appeal. The attorney for the Di Liellos didn’t immediately return a message seeking comment. Nor did Andrews’ attorney.\n\nAndrews said Lafayette College will give the elegant building the care it needs.\n\n“They can do what I can’t do,” he said.\n\nThe college says the inn will keep taking reservations up to and beyond the sale date. It helps meet a growing need for hotel rooms that has the college considering building a hotel on its Metzgar Fields property in Forks Township.\n\nLafayette College spokesman Scott Morse said the college has agreed to pay $2.7 million for the inn. He said the inn’s few part-time employees will be considered for positions deemed necessary.\n\nThe mansion was built by Elizabeth Wagner Leary in 1895. A group of investors purchased and renovated the property into an inn in 1986. It lies on part of the Wagner farm, owned by one of the families that helped settle Easton three generations earlier in the mid-1700s.\n\nAndrews said it was important for him to sell to someone willing to maintain and restore the property in keeping with its history. His renovation plans were derailed by the sewer issue.\n\nHe considered but ultimately rejected a development proposal that would have converted the inn into an office building for an insurance company.\n\n“What a terrible loss it would have been,” Andrews said.\n\nThe sale to Lafayette College will allow for appropriate renovations and will allow the building to remain a hotel. The Di Liellos owned the inn for 16 years.\n\nOur journalism needs your support. Please subscribe today to Lehighvalleylive.com.\n\nRudy Miller may be reached at rmiller@lehighvalleylive.com."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vbmV3cy5haXJibmIuY29tL21zL292ZXItNy1pbi0xMC1zYXktYWlyYm5iLWhhcy1hLXBvc2l0aXZlLWltcGFjdC1vbi1wZW5hbmdzLWxvY2FsLWNvbW11bml0eS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 May 2023 07:00:00 GMT",
        "title": "Over 7 in 10 say Airbnb has a positive impact on Penang's local community - Airbnb Newsroom",
        "content": "In light of Penang’s new short-term rental guidelines, Airbnb says it will continue to work with local authorities, strata buildings and Hosts to encourage responsible hosting\n\nFollowing the Penang government’s announcement of new local guidelines for short-term rental accommodation (STRA), Airbnb today reiterated the importance of STRA for the growth of state-level and national tourism.\n\nThe global hospitality platform encouraged Joint Management Bodies (JMBs) and Management Committees (MCs) of local strata buildings to consider the long-term economic benefits of STRA, when implementing their own guidelines at an individual building level.\n\nAccording to a latest Clearpath Strategies survey commissioned by Airbnb, there continues to be overwhelming support for STRA in the state. Over 7 in 10 (74 percent) Penangites polled said that renting out homes through Airbnb has a positive impact on their community and its residents*.\n\nPenangites support using STRA for hosting and travel\n\nNotably, 75 percent of Penang residents polled agreed that short-term rental accommodation should be allowed to take place in surplus vacant apartments, to tackle the property overhang in areas including Penang, Johor, Kuala Lumpur and Selangor. According to statistics from the National Property Information Centre (NAPIC), Penang has the third-highest number of overhang or unsold residential properties in Malaysia as of end 2022, with 3,593 units valued at RM2.74 billion**.\n\nAffordability remains a top priority for Penangites when it comes to travel, with locals polled saying their top concern remains the rising costs of living which are making it harder for people to afford travel*.\n\nLooking ahead, Airbnb is seeing strong growing interest among Penangites to host or be a guest on Airbnb. The survey revealed that 68 percent of Penangites polled are looking to book stays with the platform, while more than half (57 per cent) intend to host on Airbnb in the next year. Over 70 per cent polled said they have traveled with, and/or hosted with Airbnb*.\n\nLooking ahead to national STRA guidelines\n\nMich Goh, Airbnb’s Head of Public Policy for Southeast Asia, India, Hong Kong and Taiwan, said that the latest survey results underscore the increasingly important role that STRA plays as tourism sees a strong rebound across the region, especially in tourism hotspots like Penang.\n\n“At the national level, the federal government is developing STRA guidelines that all states can look towards. This may enable more Malaysians to both contribute and benefit from tourism through home sharing. We are committed to working with local authorities to support and educate our Hosts on responsible hosting, by utilizing our industry-first Malaysia STRA Code of Conduct and Neighbourhood Support Line.” Mich Goh, Airbnb’s Head of Public Policy for Southeast Asia, India, Hong Kong and Taiwan\n\n“I strongly encourage all strata buildings to decide whether or not to regulate STRA, and how they choose to do so. We know that the government’s guidelines are suggestions for JMBs, and that strata buildings can implement their own STRA by-laws under the national Strata Management Act. From my experience, noise and nuisance issues in strata buildings can be resolved through effective JMB management instead of by-laws that aim to reduce STRA activity. My JMB introduced a dedicated resident lift, fines for non-compliance, a hotline for complaints and homeowners group chats where owners can amicably share and resolve issues. It has truly been a win-win situation for homeowners, residents and guests.” Michael Goh Boon Tat, former JMB Chairman for Penang condominium Tropicana @ 218 Macalister\n\n“As someone who visits Penang often for medical treatment, short-term rental is the most ideal for me. I usually go for apartments on Airbnb that are close to established hospitals, and provide the amenities that my family and I need. We usually stay for more than a week as I need to rest post-treatment. I’m genuinely worried about the 3-day restriction on short-term rentals that the Penang government is suggesting, because this will definitely complicate any future medical visits.” Pak Hendry, a frequent traveler to Penang from Medan, Indonesia\n\n*Based on data from a ClearPath Strategies survey commissioned by Airbnb, that polled 1,267 respondents in Malaysia between 8 February – 2 March 2023\n\n**The Edge, March 2023"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMimgFodHRwczovL2JpdGNvaW5pc3QuY29tL2NhcnYtdGVhbXMtdXAtd2l0aC1ibmItY2hhaW4tZm9yLWl0cy16ZXJvMmhlcm8taGFja2F0aG9uLXRvLWdhdGhlci1nbG9iYWwtZGV2ZWxvcGVycy1mb3ItaW5ub3ZhdGl2ZS1pZGVhcy1pbi10aGUtd2ViMy1nYW1pbmctd29ybGQv0gGeAWh0dHBzOi8vYml0Y29pbmlzdC5jb20vY2Fydi10ZWFtcy11cC13aXRoLWJuYi1jaGFpbi1mb3ItaXRzLXplcm8yaGVyby1oYWNrYXRob24tdG8tZ2F0aGVyLWdsb2JhbC1kZXZlbG9wZXJzLWZvci1pbm5vdmF0aXZlLWlkZWFzLWluLXRoZS13ZWIzLWdhbWluZy13b3JsZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 May 2023 07:00:00 GMT",
        "title": "CARV Teams up with BNB Chain For Its Zero2hero Hackathon, To Gather Global Developers for Innovative Ideas - Bitcoinist",
        "content": "Santa Clara, May 25th, 2023 – Hackathons serve as valuable forums to harness groundbreaking ideas and recommendations, driving progress in the gaming industry. CARV, a pioneer in web3 gamer credentialing, proudly teams up with the BNB Chain Zero2hero Hackathon (hereinafter referred to as the hackathon) in May 2023, emerging as the sole bounty provider for NFT, Gamify, and Metaverse Track.\n\nIn collaboration with Encode Club, a web3 education community, the gaming track of this hackathon attracted over a thousand developers, fostering an environment conducive to the birth of revolutionary concepts and advancements in the web3 vertical. The Gamify track has received around 40 valid submissions by now, and the CARV team is supporting developers and reviewing submissions from community developers and other projects that fall into the categories of AI-powered gaming, on-chain credentials and analytics, and more.\n\nCARV’s partnership with the hackathon shows its dedication to supporting the growth of gaming in Web3. By offering experience and tools for developer onboarding, CARV sets a precedent for other projects. Through community engagement, CARV has established itself as a valuable player in the ecosystem and looks forward to seeing innovative ideas emerge.\n\nBridging Gaming and Players with a New Standard in Credentialing\n\nSince its inception in 2022, CARV, backed by Temasek, has been actively involved in building a gaming-focused credential infrastructure. Our mission is to enable gamers with enhanced social and seamless credential-based experiences across games while empowering games with privacy-preserving, AI-driven intelligence for growth and operations. Being part of the genesis cohort of BNBChain’s EU Incubator and UPenn Wharton’s Cypher Blockchain Accelerator, we have garnered invaluable insights and knowledge. Throughout our journey, we encountered challenges in bridging the gaming world with the on-chain layer, addressing issues related to web3 wallets (EVM, Solana, and Near) and web2 major gaming platforms such as Twitter, Discord, Steam, Xbox, and email. Overcoming obstacles such as gas fee inefficiencies and block rollbacks, CARV has evolved into a robust credential infrastructure, currently supporting over 160 games and half a million users.\n\nThe CARV protocol represents a new standard for credential generation and management within the gaming industry, fundamentally disrupting the current value distribution paradigm and shifting data sovereignty and value creation towards contributors. It is designed to be highly inclusive, welcoming developers of all backgrounds and expertise levels to contribute and leverage its technical capabilities. The protocol is based on a set of rules and conventions that define the format and interpretation of different components of credentials and data preservation. These rules enable peer entities across the gaming layer to seamlessly interact and exchange information, enhancing the overall data sovereignty and analytical intelligence in the ecosystem.\n\nRight now, we are onboarding more developers with white-glove experience and documents to help them reach new gamers.\n\nUnpack Game-changing Ideas\n\nCARV, as one of the earliest adopters of Soulbound Tokens (SBTs) in credentials, remains at the forefront of innovation. We continuously explore new fronts of private-preserving to enhance our offerings and deliver greater value to gamers and games. During the hackathon, we proposed compelling topics that align with our core objectives, including privacy-preserving gamer credential verification, generative AI tools for seamless web3 game creation, and comprehensive on-chain and digital activity representation in gamer profiles. Throughout the hackathon process, we continued to engage with many teams, and the discussions left us amazed. We eagerly anticipated standout ideas that will shape the future of Web3 gaming. In addition to engaging new talents, we are thrilled to collaborate with familiar faces on the gaming track, such as Footprint Analytics and Achainable.\n\nOur commitment to developers is unwavering, as we actively support and connect with them through daily sessions within the BNB Chain community. Recently, we had the pleasure of hosting a live-streaming office hour event with the Encode Club community and its developers. Moreover, CARV is excited to announce that we will be sponsoring winners in the gaming track, further fostering innovation and propelling the gaming industry forward.\n\nAbout CARV\n\nCARV is building a credential infrastructure focused on gaming, enabling gamers with enhanced social and seamless credential-based experiences across games while empowering games with privacy-preserving, AI-driven intelligence for growth and operations.\n\nSince its launch in May 2022, CARV has onboarded over half a million users, working with top gaming-focused chains including Oasys, NEAR, Polygon, IMX, and BNBChain, and over a hundred top web3 games such as Big Time, Illuvium, Apeiron, Ultiverse, and Splinterland. CARV provides value across user acquisition, user on-chain / in-game data analytics, gamer understanding, and credential-based user retention.\n\nCARV’s seed round funding was led by Temask’s Vertex, Infinity Ventures Crypto, and YGGSEA, with participation from other gaming strategy participants. Genesis cohort of UPenn’s Cypher Accelerator and BNBChain’s EU Incubator.\n\nWebsite: carv.io\n\nMedia contact: contact@carv.io\n\nDisclaimer: This is a paid release. The statements, views and opinions expressed in this column are solely those of the content provider and do not necessarily represent those of Bitcoinist. Bitcoinist does not guarantee the accuracy or timeliness of information available in such content. Do your research and invest at your own risk."
    }
]