[
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vY3J5cHRvLm5ld3Mvc2NhbW1lcnMtZXhwbG9pdC1iaXRjb2luLWV0Zi1oeXBlLXdpdGgtZmFrZS1pYnRjLXRva2VuL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Oct 2023 07:00:00 GMT",
        "title": "Scammers exploit Bitcoin ETF hype with fake IBTC token - crypto.news",
        "content": "Crypto investors have fallen victim to a scam token, which shares the same ticker as BlackRock’s legit ETF.\n\nBNB Chain-based iShares Bitcoin (IBTC) token has scammed investors for nearly $90,000 worth of crypto as the crypto community is abuzz with spot bitcoin exchange-traded fund (ETF) excitement.\n\nAccording to an X post from a blockchain analytics firm PeckShield, a bad actor has swapped one quadrillion IBTC tokens for 394.8 Binance Coin (BNB) worth of $89,000 through PancakeSwap, with IBTC’s price immediately dropping by 100% from $0.0025.\n\nOnce the scammer swapped IBTC for BNB. They sent the whole sum to 0x3f…04ed, an address that received over $700,000 worth of BNB tokens from PancakeSwap over the past few days, and contacted Binance’s withdrawal address.\n\nAccording to on-chain data seen by crypto.news, the address associated with the scammer (0xf49…c5b37) also contacted Binance on Oct. 24, receiving from the exchange’s hot wallet 0.0555 BNB.\n\nYou might also like: Bitcoin price surges as ETF anticipation grows: analysis and forecasts\n\nCrypto investors might have mistaken the scam token for BlackRock’s proposed iShares Bitcoin ETF, which shares the same IBTC ticker. As traders and Bitcoin proponents bet on an imminent regulatory nod from the U.S. Securities and Exchange Commission (SEC), lawyers surmised that approvals for spot Bitcoin ETFs could arrive before the end of 2023.\n\nAs crypto.news earlier reported, the U.S. Court of Appeals for the D.C. Circuit also formalized its ruling in the Grayscale case, mounting additional pressure on Gary Gensler’s SEC to review Grayscale Bitcoin Trust’s conversion to a Bitcoin ETF in a move that could part the floodgates of approvals or usher further delays for issuers."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vY3J5cHRvLm5ld3Mvc2NhbW1lcnMtZXhwbG9pdC1iaXRjb2luLWV0Zi1oeXBlLXdpdGgtZmFrZS1pYnRjLXRva2VuL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Oct 2023 07:00:00 GMT",
        "title": "Scammers exploit Bitcoin ETF hype with fake IBTC token - crypto.news",
        "content": "Crypto investors have fallen victim to a scam token, which shares the same ticker as BlackRock’s legit ETF.\n\nBNB Chain-based iShares Bitcoin (IBTC) token has scammed investors for nearly $90,000 worth of crypto as the crypto community is abuzz with spot bitcoin exchange-traded fund (ETF) excitement.\n\nAccording to an X post from a blockchain analytics firm PeckShield, a bad actor has swapped one quadrillion IBTC tokens for 394.8 Binance Coin (BNB) worth of $89,000 through PancakeSwap, with IBTC’s price immediately dropping by 100% from $0.0025.\n\nOnce the scammer swapped IBTC for BNB. They sent the whole sum to 0x3f…04ed, an address that received over $700,000 worth of BNB tokens from PancakeSwap over the past few days, and contacted Binance’s withdrawal address.\n\nAccording to on-chain data seen by crypto.news, the address associated with the scammer (0xf49…c5b37) also contacted Binance on Oct. 24, receiving from the exchange’s hot wallet 0.0555 BNB.\n\nYou might also like: Bitcoin price surges as ETF anticipation grows: analysis and forecasts\n\nCrypto investors might have mistaken the scam token for BlackRock’s proposed iShares Bitcoin ETF, which shares the same IBTC ticker. As traders and Bitcoin proponents bet on an imminent regulatory nod from the U.S. Securities and Exchange Commission (SEC), lawyers surmised that approvals for spot Bitcoin ETFs could arrive before the end of 2023.\n\nAs crypto.news earlier reported, the U.S. Court of Appeals for the D.C. Circuit also formalized its ruling in the Grayscale case, mounting additional pressure on Gary Gensler’s SEC to review Grayscale Bitcoin Trust’s conversion to a Bitcoin ETF in a move that could part the floodgates of approvals or usher further delays for issuers."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovLzI0N3Nwb3J0cy5jb20vY29sbGVnZS9hbGFiYW1hL2FydGljbGUvaXNhaWFoLWJvbmQtaGFzLWpvaW5lZC1qZXJtYWluZS1idXJ0b24tYXMtYWxhYmFtYS1yZWNlaXZpbmctZGVlcC10aHJlYXQtMjE4ODk1ODI3L9IBhAFodHRwczovLzI0N3Nwb3J0cy5jb20vY29sbGVnZS9hbGFiYW1hL2FydGljbGUvaXNhaWFoLWJvbmQtaGFzLWpvaW5lZC1qZXJtYWluZS1idXJ0b24tYXMtYWxhYmFtYS1yZWNlaXZpbmctZGVlcC10aHJlYXQtMjE4ODk1ODI3L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Oct 2023 07:00:00 GMT",
        "title": "Alabama’s Air B and B Provides Comfort - 247Sports",
        "content": "With many of the 100,000-plus who cram into Tuscaloosa for Alabama football game days, hotels are booked solid and that has been a boon for temporary housing from the likes of Air B&B.\n\nThe Crimson Tide has its own version of Air B and B — the receiving duo of Jermaine Burton and Isaiah Bond.\n\nBurton was a known commodity coming in after his 2022 performance after transferring from Georgia. Also coming to Bama last season from Georgia — famed Buford High School — was Bond.\n\nThe two are tied for the Alabama team lead in receptions this year with 23 each, Burton for 508 yards and five touchdowns, Bond for 360 and 3 TDs.\n\nMost recent for Bond was the 46-yard touchdown catch from Jalen Milroe on the second play of Alabama’s 34-20 win over Tennessee in Bryant-Denny Stadium last week.\n\nThe numbers 47-34-52-46 aren’t the contrived signal calls from an old football movie. Those are the lengths of some of Bond’s receptions this year. As a freshman he had 17 catches for 220 yards, a long of 53 yards, and one touchdown, that score the beginning of the Crimson Tide’s 45-20 win over Kansas State in the Sugar Bowl.\n\nNext up after this week’s open date is a critical Southeastern Conference West Division game against LSU on Nov. 4 in Bryant-Denny Stadium. Alabama is 7-1 overall and leading the West with a 5-0 conference record, LSU 6-2 and 4-1. CBS will televise the game beginning at 6:45 CDT.\n\n“Bond. Isaiah Bond.” I don’t know who initiated that take on 007 (it sounds like something Tide broadcaster Chris Stewart would have come up with), but it fits.\n\nBond has a knack for being in the right place — notably, behind opposing defensive backs, to make those killer plays. How does he do it? In his first meeting with reporters at Alabama this week, Bond answered a question honestly. “Yes sir. I would say I’m the fastest guy on the team.”\n\nAs a junior in high school he won the 6A 100- and 200-meter state titles.\n\nA lot goes in to a successful pass — protection, route, throw, catch.\n\nBond gives a lot of credit to his quarterback, Jalen Milroe, pointing out that Milroe has replaced the No. 1 player in this year’s NFL draft, former Heisman Trophy winner Bryce Young.\n\n“Jalen has shown great improvement, just getting better,” Bond said.\n\n“I think honestly just the raw talent that Jalen Milroe has to be able to throw the ball deep. Obviously, physical look-wise, you see he’s a bigger dude, bigger quarterback and also he has great receivers as well, that are able to stretch the field so it’s a tale of two ends.\n\n“I believe in Jalen Milroe and I believe in where this team can go.”\n\nBuilding chemistry between the quarterback and receivers started in the summer, when they worked together in Tampa.\n\nBond said, “Honestly,I’m excited to play every single down, but obviously you do get a little more excited when a pass is coming. But I’m excited all the time when I’m on the field playing for The University of Alabama.”\n\nKnowing the pass was coming in the start of the second half, Bond said, “My mama always told me, ‘Big time players make big time plays,’ so it’s going out there and believing in my training I’ve done my whole life and knowing I’m capable of going there and making a play to change the game is what really stuck with me.\n\n“My mindset on a deep route is just run as fast as I can down the field and put my trust in Jalen Milroe to get the ball out there. I believe in myself to go out there and make plays, so getting to the spot at the right time. Timing is a big part that plays into deep passes.”\n\nAlthough the long touchdown pass receptions are the ones that make the highlight video, midway through the second quarter against Tennessee Bond caught a short pass and started down the sideline where a Tennessee defender waited for him. After the collision, Bond was back in the huddle. The defender was headed to the sideline, stopping twice to collect himself.\n\n“Coming from the South, physicality is kind of something that’s instilled in you young,” he said. “So even though you might say I’m not the biggest wide receiver (he’s 5-11, 182), I play as if I was 6-4, 200 pounds.”\n\nBond has been a pleasant surprise, and may have another one coming.\n\nHe returned punts in high school and works on that skill in practice at Alabama.\n\n“You should be seeing me soon,” he said."
    }
]