[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiMGh0dHBzOi8vbWVzc2FyaS5pby9yZXBvcnQvc3RhdGUtb2YtMWluY2gtcTQtMjAyMtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Jan 2023 08:00:00 GMT",
        "title": "State of 1inch Q4 2022 - Messari",
        "content": "We believe crypto is the technology of free people, free thinking, and free markets."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMTgvZGVmaS1wcm90b2NvbC10aGVuYS1zZWVzLXRvdGFsLXZhbHVlLXN1cmdlLXRvLTkwbS1pbi1hLXdlZWsv0gFsaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wMS8xOC9kZWZpLXByb3RvY29sLXRoZW5hLXNlZXMtdG90YWwtdmFsdWUtc3VyZ2UtdG8tOTBtLWluLWEtd2Vlay9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Jan 2023 08:00:00 GMT",
        "title": "DeFi Protocol Thena's Total Value Locked Surged to $90M in Its First Week - CoinDesk",
        "content": "The decentralized finance (DeFi) sector has benefitted from the recent recovery in major crypto assets like bitcoin and ethereum. TVL across DeFi has increased from $38.75 billion to $45.46 billion since the turn of the year as capital sidelined during the bear market begins to resurface."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8venljcnlwdG8uY29tL2Zhc3R0b2tlbi1mdG4tYW5ub3VuY2VzLWl0cy1pbml0aWFsLWV4Y2hhbmdlLW9mZmVyaW5nLWllby_SAVNodHRwczovL3p5Y3J5cHRvLmNvbS9mYXN0dG9rZW4tZnRuLWFubm91bmNlcy1pdHMtaW5pdGlhbC1leGNoYW5nZS1vZmZlcmluZy1pZW8vP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Jan 2023 08:00:00 GMT",
        "title": "Fasttoken (FTN) Announces Its Initial Exchange Offering (IEO) - ZyCrypto",
        "content": "Advertisement\n\nFastex, a Web 3.0-driven ecosystem offering a diverse product range, is happy to announce its initial exchange offering (IEO) of Fasttoken (FTN), offering early holders an opportunity to join the project.\n\nThe IEO is set to take place from January 18 to January 20, 2023, with a limited number of 10 million tokens available for public sale. The FTN tokens will be sold for 0.35 euros per token for this event.\n\nFasttoken is the official cryptocurrency of the Fastex ecosystem. The FTN token serves numerous utilities, including supporting and empowering the evolution of digital finance and the FTN reward system. The IEO provides an opportunity for users to join the join Fastex community.\n\nPowered by IT giant SoftConstruct, Fastex delivers multiple centralized and decentralized solutions. The platform opens up a vast network of over 7000 users and more than 500 partners. Fastex hopes to provide effective solutions for businesses and communities while making Web 3.0 technologies more accessible than ever. Fastex’s mission is to ‘level up transparency and data ownership between businesses and communities.\n\nThe Fastex ecosystem consists of Fastex Chain, ftNFT marketplace, Fastex Pay, Fastex Exchange crypto & exchange platform, and Fastex Verse, the ecosystems’ metaverse. The ecosystem is designed to provide a seamless and integrated experience for users. The platform seeks to allow its users to engage easily with various services and features offered by the Fastex ecosystem.\n\nAdvertisement\n\nFastex pay is a crypto payment system that enables merchants to accept cryptocurrencies in e-commerce stores, while the fastex chain is an EVM blockchain with utilities. It serves as the backbone of the ecosystem, providing a new modification of the proof of stake consensus mechanism. The Fastex Chain is scheduled to have its test in February 2023.\n\nFtNFT marketplace is an NFT marketplace designed with exclusive features for creators, collectors, and traders to come together. The Fastex verse provides an immersive metaverse experience to all Fastex users.\n\nThe IEO comes after successful Private Sale rounds. The first phase of the private sale was held from November 29 to November 30, 2022, and hosted around 300 partners. The second phase was held on December 5 2022, running for 39 days."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LnRoZS1zdW4uY29tL2VudGVydGFpbm1lbnQvNzE2Mjk2Ny9zaXN0ZXItd2l2ZXMtZmFucy1tZXJpLWJyb3duLWV4cGVuc2l2ZS11dGFoLXByb21vdGVzLXJldHJlYXQv0gFvaHR0cHM6Ly93d3cudGhlLXN1bi5jb20vZW50ZXJ0YWlubWVudC83MTYyOTY3L3Npc3Rlci13aXZlcy1mYW5zLW1lcmktYnJvd24tZXhwZW5zaXZlLXV0YWgtcHJvbW90ZXMtcmV0cmVhdC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Jan 2023 08:00:00 GMT",
        "title": "Sister Wives fans rip Meri Brown for ‘crazy expensive’ weekend at her Utah bed and breakfast as she pro... - The US Sun",
        "content": "SISTER Wives fans have ripped star Meri Brown for promoting a ridiculously expensive weekend retreat on her social media.\n\nMeri, 52, took to Instagram on Tuesday and shared a video urging her followers to consider a weekend at Lizzie’s Heritage Inn in Utah.\n\n5 Sister Wives fans have ripped Meri Brown for promoting a ridiculously expensive weekend retreat on her social media Credit: Instagram\n\n5 Meri is inviting fans to come and stay at Lizzie’s Heritage Inn in Utah for $6,000 Credit: Google Maps\n\nIn connection with Real Life Retreats, Meri is offering guests the chance to stay at the bed and breakfast from February 16 until the 19 and enjoy a weekend of pampering.\n\nMeri began the video by telling her 822,000 followers: \"Hey you guys, I am here at the bed and breakfast, Lizzie's Heritage Inn and I have some information for you...\n\n\"We have so many good things planned. So, it's going to be February 16th through the 19th, right here at the bed and breakfast.\"\n\nShe continued: \"So, it's going to be about love, of course, because it's February. So rest, rejuvenation, pampering yourself, connecting with new friends and old friends.\"\n\nMeri went on to confirm that guests have three options to choose from when booking, which are Supreme, Elite, or Elite Plus.\n\nShe told potential customers: \"And then you just need to get here to the b&b on February 16th and I will take care of the rest!\"\n\nHowever, when fans went to the website and realized a Supreme stay costs $4,000 and an Elite Plus would cost $6,000, they took to the comments to have their say.\n\n\"Six. THOUSAND?!!! DOLLARS??!! What on earth could that include?! I’m genuinely curious,\" one person wrote.\n\nAnother fumed: \"most of the usa is struggling putting food on the table and buying medicine and getting medical help and u charge this amount?? i use to support u but nah.\"\n\nA third person noted: \"That's a lot of money for 3 days in Utah? and not much is included,\" and a fourth said: \"I’m pulling for you Mari, but these prices are ridiculously high.\"\n\nSomeone else commented: \"She’s out of her damn mind thinking $6,000 is a feasible cost! To spend time with her… Hard pass here!\"\n\nAnd a different person added: \"I love Meri, but $6,000? I don't understand the mentality here. I run a food pantry and there are people (children) that are literally starving and living in motel rooms. I just couldn't spend that kind of money to hang out with Meri even if I could afford it.\"\n\nSomeone else mocked: \"Apparently she didn't learn the first time she tried this! 6k for what? And a love lesson from you?\"\n\nMeri's post comes just days after she shocked fans by defending her ex Kody and slamming the comments about him.\n\nMERI'S WRATH\n\nThe TLC star defended her ex-husband in a joint announcement that officially confirmed the couple had ended their marriage.\n\nMeri, 51, posted the statement on her Instagram last Tuesday.\n\nIn it she and Kody, 53, explained: \"In light of a recent unapproved press release, we feel compelled to share our own truth, in our own way, and in our own timing.\"\n\nThe statement continued: \"After more than a decade of working on our relationship in our own unique ways, we have made the decision to permanently terminate our marriage relationship.\"\n\nThe former spouses added: \"During this process, we are committed to kindness and respect toward each other and all members of our family.\n\n\"We are also committed to the continued healing of any and all relationships with the family so that we can move forward with forgiveness, grace, and love.\"\n\nThe pair signed off with, \"In kindness, Meri and Kody.\"\n\nWhile the statement regarding the couple's divorce appeared to be congenial, the Sister Wives star sang a different, angrier tune in the post's caption.\n\nMeri began by writing: \"Today I reclaim my power,\" before focusing her annoyance on People, which first broke the news in December.\n\nShe wrote: \"Last month's article by the 'reputable' People Magazine quoting me as saying that I had 'confirmed' that Kody and I had separated was a complete lie.\"\n\nThe TV personality stated that the \"information, content, and timing was inaccurate\" adding that the information was \"based on a highly edited version of events that had been filmed months prior.\"\n\nDEFENDING KODY\n\nMeri then revealed that since \"the taping of those interviews,\" she and Kody participated in \"open and honest discussions\" that led to the announcement.\n\nThe reality TV star somewhat mysteriously added: \"There is so much more to be told about this story, and I assure you, my truth will be told. But for now, know that there is peace in my heart, and I hold no animosity toward Kody.\"\n\nShe continued: \"I am not, and pray that I never will be, in a place where I will enjoy making, or seeing you make, rude and demeaning comments about him.\"\n\nMeri then addressed her followers directly, writing: \"You likely will have a range of emotions and opinions at this news and want to offer comments.\n\n\"In doing so, please be considerate of the fact that we are real people, with real lives, and real emotions.\n\nThe mother-of-one asked her fans to \"refrain from congratulating\" her on the break up of her marriage,\" adding that she valued the relationship she and Kody had and \"look forward to stepping into 2023 and [her] future with grace, kindness, and power.\"\n\n5 In connection with Real Life Retreats, Meri offers guests the chance to stay at the bed and breakfast - but it's not cheap Credit: Instagram\n\n5 Meri told her followers that the retreat in Utah is all about 'rest, rejuvenation, and pampering' Credit: Instagram"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LnZpc2lvbnRpbWVzLmNvbS8yMDIzLzAxLzE4L2NoYXRlYXUtaGF0aG9ybi1hLWNoYXJtaW5nLWJlZC1hbmQtYnJlYWtmYXN0LXdpdGgtZ29yZ2VvdXMtdmlld3Mtb2YtdGhlLWNvdW50cnlzaWRlLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Jan 2023 08:00:00 GMT",
        "title": "Chateau Hathorn: A Charming Bed and Breakfast With Gorgeous Views of the NY Countryside - Vision Times",
        "content": "Offering scenic views of the countryside, Chateau Hathorn is a charming bed and breakfast located in the town of Warwick, upstate New York. The property is a restored 19th-century mansion that offers guests a unique and elegant experience.\n\nFeaturing five guest suites — each with its own unique decor and amenities — are spacious and well-appointed, complete with high ceilings, ornate furniture, fireplaces, and large windows that offer breathtaking views of the surrounding countryside.\n\nMORE ON VENUES AND EVENTS IN NEW YORK STATE:\n\nThe chateau’s common areas are also equally impressive — with beautiful antiques, intricate moldings, and elegant furnishings. Guests can relax in the library, enjoy a drink in the parlor and wine cellar — which the owners built from scratch — or take in scenic views from the veranda.\n\n“My husband built this whole wine cellar,” said owner Helene Zueger. “He wanted to make it look like a real chateau, and so he built wood frames and then built the planks around it,” she shared with Vision Times. The cellar has been a main attraction for the Chateau, with film scouts using it for Hallmark movies and other TV productions, Zueger said.\n\nThe wine cellar was built in the stye of a vintage European castle, said owner Helene Zueger. (Image: Vision Times Staff)\n\n“We have a wide selection of wines, and once you come in, it really feels like you are in Europe,” Zueger said, adding that, “Our wine cellar is one of a kind — it is the only one built in this style in New York State.”\n\nSIGN UP FOR OUR FREE NEWSLETTER For the best of our weekly content！ There is something wrong, please try again later By signing up, you agree to our Terms of Service and Privacy Policy , and to receive messages from Vision Times. SIGN UP Success You are now signed up for our newsletter Success Check your email to complete sign up\n\nThe chateau also features a grand ballroom, which can be reserved for special events such as weddings, parties, corporate events, and more.\n\nOwners Helene (L) and her husband Dolph Zueger (R) sat down with Vision Times to share what makes the Chateau unique and stand out from other venues in the area. (Image: Vision Times Staff)\n\n“Words can’t express how much [getting married at the chateau] meant to us,” said Lillian and Lou, who wrote in a testimonial that the venue was warm and inviting, and how they received “VIP treatment” during their special day. “The wine cellar was especially unique and interesting. Loved the adorable bridal suite.”\n\nFine dining\n\nChateau Hathorn is also known for its highly-rated cuisine and breakfasts, which is included with every stay. The breakfast menu changes daily and features a variety of fresh, local ingredients. The chateau also offers a wine and cheese reception in the evening, where guests can sample local wines and cheeses while mingling with other guests, and learn about the history of the estate.\n\nThe chateau offers fine Swiss and French cuisine in an authentically-furnished private mansion setting. The food at Chateau Hathorn is highly-rated and is cooked up by award-winning chefs. (Image: dp studio Ting Yi via Chateau Hathorn)\n\nIn addition, the chateau offers fine Swiss and French cuisine in an authentically-furnished private mansion setting. Chef Dolph Zueger, who is Zagat rated and is Helene’s husband, prides himself on using only the finest ingredients sourced from local farms and businesses — including the use of free-range poultry without any added hormones or preservatives. The power couple have worked together for decades to ensure the highest quality service on all fronts — from the food, wine and decor — down to the dedicated and warm hospitality they give each of their guests.\n\n“We just wanted to tell you that the wedding was a big success due to [the Chateau’s] wonderful staff! The grounds were immaculate, the food was superb, the wine never ran out and all your people were courteous, helpful and pleasant,” said guests Jack and Sue after choosing the Chateau as their wedding venue.\n\nStunning natural views\n\nSituated on 10 acres of beautiful gardens and woodlands, the chateau’s grounds offer tranquil views ideal for a stroll or a picnic. The property is also home to a pond and stream — providing a peaceful and serene setting for guests to partake in kayaking, fishing, or unwind by a campfire.\n\nChateau Hathorn is equipped with five guest rooms, each with its own unique decor and amenities, including high ceilings, ornate furniture and a fireplace. (Image: Chateau Hathorn)\n\nThe chateau is located just a short drive from the charming town of Warwick, which offers a variety of shops, restaurants, and art galleries. The area is also known for its many apple orchards, wineries, and farm markets — making it the perfect destination for a quiet getaway or romantic weekend away from the city.\n\nValentine’s day menu\n\nFor Valentine’s Day, the chateau is also offering a special Lover’s Day menu featuring scrumptious dishes such as lobster bisque, surf and turf, escargots cooked a la Café de Paris, pan-seared halibut, oven-roasted chicken, etc.\n\nWith its beautiful rooms, delicious breakfast, and stunning setting, Chateau Hathorn is the perfect place for you and your loved ones to relax and enjoy delicious food and wines. Whether you’re looking for a romantic getaway or a weekend of relaxation, Chateau Hathorn is the ideal destination.\n\nFor more information about Chateau Hathorn, including FAQs, availability and bookings, click here.\n\nChateau Hathorn\n\n33 Hathorn Road\n\nP.O. Box 845\n\nWarwick, NY 10990\n\nTel: (845) 986-6099\n\nEmail: [email protected]"
    }
]