[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wMi8yNy9jb2luYmFzZS10by1zdXNwZW5kLWJpbmFuY2UtdXNkLXN0YWJsZWNvaW4tc2F5aW5nLWl0LWRvZXNudC1tZWV0LWxpc3Rpbmctc3RhbmRhcmRzL9IBhAFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wMi8yNy9jb2luYmFzZS10by1zdXNwZW5kLWJpbmFuY2UtdXNkLXN0YWJsZWNvaW4tc2F5aW5nLWl0LWRvZXNudC1tZWV0LWxpc3Rpbmctc3RhbmRhcmRzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Coinbase to Suspend Binance USD Stablecoin, Saying It Doesn’t Meet Listing Standards - CoinDesk",
        "content": "Helene is a New York-based reporter covering Wall Street, the rise of the spot bitcoin ETFs and crypto exchanges. She is also the co-host of CoinDesk's Markets Daily show. Helene is a graduate of New York University's business and economic reporting program and has appeared on CBS News, YahooFinance and Nasdaq TradeTalks. She holds BTC and ETH."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wMi8yNy9jb2luYmFzZS10by1zdXNwZW5kLWJpbmFuY2UtdXNkLXN0YWJsZWNvaW4tc2F5aW5nLWl0LWRvZXNudC1tZWV0LWxpc3Rpbmctc3RhbmRhcmRzL9IBhAFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wMi8yNy9jb2luYmFzZS10by1zdXNwZW5kLWJpbmFuY2UtdXNkLXN0YWJsZWNvaW4tc2F5aW5nLWl0LWRvZXNudC1tZWV0LWxpc3Rpbmctc3RhbmRhcmRzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Coinbase to Suspend Binance USD Stablecoin, Saying It Doesn’t Meet Listing Standards - CoinDesk",
        "content": "Helene is a New York-based reporter covering Wall Street, the rise of the spot bitcoin ETFs and crypto exchanges. She is also the co-host of CoinDesk's Markets Daily show. Helene is a graduate of New York University's business and economic reporting program and has appeared on CBS News, YahooFinance and Nasdaq TradeTalks. She holds BTC and ETH."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vd3d3LmlzbGFtaWNmaW5hbmNlZ3VydS5jb20vYXJ0aWNsZXMvd2hhdC1pcy1iaW5hbmNlLWNvaW4taXMtaXQtaGFsYWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "What is Binance Coin? Is it halal? - Islamic Finance Guru",
        "content": "Binance Coin (ticker: BNB) is the cryptocurrency issued by the popular Binance cryptocurrency exchange.\n\nBNB is one of the biggest cryptocurrencies in the world issued by the largest cryptocurrency exchange in the world: Binance. BNB is the native cryptocurrency behind the BNB chain ecosystem and runs natively on the Binance cryptocurrency exchanges and the Binance chain.\n\nBNB holds considerable market dominance as the fourth most popular cryptocurrency in the world and is closely tied to Binance’s platform.\n\nMost scholars hold BNB to be halal, we also share this view.\n\nContinue reading for a deep dive into Binance coin.\n\nWhat is Binance Coin (BNB)?\n\nCryptocurrency exchanges were created in a similar spirit to stock exchanges, to allow people to buy and sell assets. Several crypto exchanges have now been established, with Binance and Coinbase being juggernauts in the industry.\n\nCrypto exchanges aim to make it as easy as possible for people to sign up and exchange crypto assets. Along the way, some exchanges create their own cryptocurrency to be completely compatible with the exchange’s ecosystem.\n\nIn addition to being fully compatible and native, the cryptocurrency created by a particular company or exchange offers benefits such as reduced fees on the platform.\n\nThe Binance exchange was launched in mid-July of 2017. Binance wanted to launch a cryptocurrency that could be fully integrated within their ecosystem, and so 11 days before Binance exchange opened for trading they launched Binance Coin (BNB) through an Initial Coin Offering (ICO).\n\nAn ICO can be likened to an Initial Public Offering (IPO) whereby a private company lists itself on a stock exchange so that its shares can be traded by public retail investors.\n\nAn ICO is a method through which projects can raise funds by offering coins to early supporters and enthusiasts. The company or team behind the cryptocurrency provides coins immediately or at some specified time in the future to public investors. The ICO allows the team to raise funds to progress their development of the cryptocurrency and its ecosystem.\n\nUsers that bought BNB coins at its ICO got early access to coins at low prices, though they were not entitled to anything else like a stake in the ecosystem.\n\nBinance originally launched BNB as an ERC-20 token on the Ethereum blockchain which meant that it could be used seamlessly within the Ethereum ecosystem and be sent to ETH addresses. Binance then decided to migrate the BNB token to their own standard: BEP-2. They swapped all ERC-20 BNB coins with BEP-2 BNB coins at a 1:1 ratio.\n\nBinance’s intention with Binance Coin and its BEP-2 standard is to have their own native cryptocurrency and blockchain that is fully integrated and entrenched within their ecosystem and works in sync with its exchange.\n\nWhat does BNB do?\n\nAt the time of its launch in 2017, BNB’s major use case was as a utility token for discounted trading fees in the Binance exchange. Binance incentivises its users to buy and hold BNB and allow them to pay for their fees using BNB. This feature of BNB remains, whereby users that pay for fees using BNB receive up to 25% discount on fees. Users can also use BNB to pay for fees in the Binance Decentralised Exchange, as well as BNB’s blockchains.\n\nSince 2017, Binance has dramatically expanded BNB’s use cases. A major use case of any cryptocurrency is to be able to buy things and spend your crypto since they are, after all, called ‘currency’.\n\nBinance Launchpad allows developers and teams to launch their own cryptocurrency tokens. Users can buy and invest in these projects using BNB.\n\nOne of the most impressive use cases is Binance Card.\n\nBinance Card is a VISA debit card issued by Binance that allows you to transact all over the world, both offline and online, using your cryptocurrency. Your card is linked to your cryptocurrency account, and when you spend money your BNB (or other select cryptocurrencies) are converted in real-time to allow you to pay with cryptocurrency just as you would with cash using a debit card.\n\nImpressively, Binance Card offers cashback rewards of up to 4% if your monthly average balance hits 40 BNB.\n\nBinance Pay is another offering from Binance where you can use BNB to pay select online stores and outlets. However, the amount of places that accept Binance Pay means it may not even be worth the hassle in setting it up.\n\nSeveral popular blockchain based travel agencies, such as travala.com, accept BNB as a valid payment method. In addition to that, Travala’s own AVA token is a BEP-2 token, so it is connected to the overall Binance ecosystem.\n\nAn impressive use case of the Binance ecosystem is Binance Charity. The first non-profit organisation that delivers donations through cryptocurrency and allows donors to trace funds through transparent and permanent records on the blockchain. Users can donate their BNB to several causes the organisation is involved in.\n\nFrom the above, you can see Binance is trying to open as many avenues and make as many partnerships as they can with their BNB coin. The more use cases a cryptocurrency has, the more it will attract customers who will then begin using it more often.\n\nHow does BNB work technically?\n\nBEP-2\n\nA cryptocurrency standard is like a set of rules that developers must adhere to if they want their token to be part of an ecosystem. The most popular standard is Ethereum’s ERC-20. ERC-20 is the basis for dozens of cryptocurrencies and allows full compatibility with the vast Ethereum ecosystem, from NFTs and games to shopping and metaverse.\n\nThe native token of the Binance chain is BNB, which means that when users want to transfer BEP-2 tokens within the ecosystem, it is necessary to hold some BNB. This provides huge incentives for people to hold and use BNB because they need it to interact with one of the biggest cryptocurrency ecosystems in the world.\n\nAn advantage BEP-2 tokens have, as part of one of the most popular ecosystems, is being compatible with numerous wallets.\n\nBNB burning\n\nBinance has been ‘burning’ BNB coins regularly on a quarterly basis since 2017. They spend some of their revenue to buy BNB and essentially delete them from the chain.\n\nIt may seem wasteful at first, but Binance has the goal of halving the maximum supply of BNB to reach 100 million coins. This is to increase the scarcity of BNB and prevent its price from being inflated away.\n\nWhat are the use cases of BNB?\n\nReduced fees in the Binance ecosystem\n\nA major use case of BNB is that it provides its users with a special discount on trading fees on the popular Binance cryptocurrency exchange.\n\nFees normally sit at around 0.1% on each transaction. Users who use BNB to pay these fees can save exorbitant amounts of money, especially if they trade regularly or trade large sums.\n\nConsumer spending\n\nBinance has been trying to expand the concrete uses of BNB to appeal to more retail consumers. It is no surprise then that some of the advantages of using BNB flouted by the marketing team at Binance is its consumer and shopping aspect.\n\nBinance have launched Binance Card and Binance Pay to allow people to transact in BNB like they would with their fiat currency.\n\nBinance Card is a VISA debit card that enables you to spend your cryptocurrency sitting in your wallet just as you would spend the fiat currency sitting in your bank account. Binance has added extra incentives such as 4% cashback offers.\n\nBinance Pay is an online solution where users can shop using BNB at select outlets. However, this solution isn’t widely accepted and is still in its infancy. You can expect Binance to try and make more deals with online outlets to accept Binance Pay.\n\nAre people using BNB right now?\n\nBNB has a daily transaction count of under 5 million.\n\nIn November 2021 BNB daily transactions reached a peak of around 15 million and has continued to fall as the market entered a bear market.\n\nMore than 800 merchants accept BNB as payment though it hasn’t hit mainstream yet and is still compatible with niche merchants. With an increasing market dominance, currently standing at 4.74%, BNB is being used more as time goes on.\n\nWhat are the strengths and weaknesses of BNB?\n\nStrengths\n\nDiscounted trading fees : Users who pay their fees in the Binance ecosystem using BNB receive a special discount.\n\nIncreased use cases : Binance is working hard to incentivise users to use BNB in addition to its core uses. As one of the most influential cryptocurrency companies in the world, Binance has the ability to make deals and develop infrastructure. Binance is developing new features like GameFi, SocialFi, and a metaverse.\n\nInfluence and adoption : Because Binance is one of the biggest ecosystems in the world, BNB adoption is increasing. In addition to BNB burning, this means BNB’s price should continue to increase.\n\nWeaknesses\n\nCentralised : Binance is a centralised for-profit company, so the entire Binance and BEP-2 ecosystem is at the mercy of the profit incentives of the company. If Binance were to clash with regulators as has happened in the past, this can affect the BNB you hold.\n\nBinance holds the majority : Around 85% of BNB is held by Binance , and combined with the centralised issue above, this means the supply and direction of BNB itself is highly dependent on the direction Binance decides to go. This almost cancels out the spirit of cryptocurrencies in not being at the mercy of authorities.\n\nClashes with regulators : Binance have been under intense scrutiny from government and regulators and have been found to purposefully try to avoid regulations.\n\nIs BNB a good investment?\n\nBNB is one of the largest cryptocurrencies in the world issued by the most popular cryptocurrency exchange in the world. BNB ranks 4th in the entire cryptocurrency space by market capitalisation. It has a market capitalisation of around $49 billion with a market dominance of 4.74%.\n\nBNB is available on Binance as its native coin.\n\nBNB has declined in price following the recent market downturn in 2022 just as other cryptocurrencies and assets have. It currently has a price of $304 after reaching highs of almost $700 in 2021.\n\nEven though Binance has had issues with regulators, it seems to have taken the market by storm mainly due to the fact that it is issued by the biggest cryptocurrency exchange company in the world.\n\nBNB’s utility will continue to increase as Binance increases its use cases, making it a popular cryptocurrency to hold. As long as Binance and its ecosystem continues to hold its position in the cryptocurrency exchange space, BNB will be held and used by its users. In addition to BNB burning, this means many investors see BNB as a valuable part of their crypto portfolio.\n\nAlternatives to BNB\n\nBitcoin (BTC)\n\nThe original cryptocurrency that started it all off probably makes a much better investment overall because of its 39% market dominance and its being synonymous with cryptocurrency.\n\nBitcoin has the advantage of having a limited supply of 21 million coins which gives it more scarcity. Bitcoin also has more acceptance for payments amongst businesses, with more than 2,000 US businesses accepting Bitcoin.\n\nAs a long-term investment, Bitcoin has the upper hand.\n\nEthereum (ETH)\n\nA valid alternative to BNB is the network and cryptocurrency on whose technology it was originally based: Ethereum. Given how Ethereum is synonymous with the DeFi space with its 80% market DeFi dominance, Ethereum is the giant that offers much more ecosystem uses than BNB can overall.\n\nBNB offers an ecosystem with NFTs and games, but Ethereum was not only the original smart contract, NFT, and cryptocurrency ecosystem, but has the largest market dominance in the DeFi space and the second largest market dominance in the entire cryptocurrency space.\n\nEthereum has a level of credentials, adoption, and respect that BNB is still trying to attain.\n\nIs Binance Coin (BNB) halal?\n\nMost scholars hold BNB to be halal. We also share this view.\n\nThe essence of the debate on whether cryptocurrencies are halal comes down to whether they are ‘Māl’ as we have explained previously. Māl is something that can be acquired, whether it be an item or a service.\n\nThere are three stances on cryptocurrencies today:\n\nCryptocurrency is not Māl, rather it is a speculative, non-Sharia-compliant investment. Cryptocurrency is a digital asset but not a currency. Cryptocurrency is a digital currency.\n\nProponents of view (1) argue that cryptocurrencies are not Sharia-compliant since they have no intrinsic value and are merely entries on a digital ledger.\n\nOur view has always been that (1) does not seem right since cryptocurrencies have value as millions of people are willing to buy, hold, and trade them. They are just as real as fiat currency today which mostly exists in the spreadsheets of banks. Our monetary system became predominantly digital a while ago.\n\nView (2) seems to be the most realistic view, as cryptocurrencies are a new and emerging technology that are yet to mature into fully fledged currencies used by economies at large. However, in practice, there is no real difference for casual users between (2) and (3) since they both consider trading cryptocurrencies to be permissible.\n\nIt is important to remember that Zakat will be due on cryptocurrencies you hold, and BNB is no exception. To find out about how to calculate this, please read our article on Zakat on crypto.\n\nConclusion\n\nBinance has lofty aspirations for BNB and is trying to replace Ethereum as the number one crypto ecosystem. With its influence, reach, and market dominance there is a good chance that Binance can continue to propel BNB and increase its adoption.\n\nInvestors in BNB just need to keep an eye on Binance’s clashes with regulators and the position governments take on Binance. The only thing standing in the way of BNB is Binance."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vd3d3LmlzbGFtaWNmaW5hbmNlZ3VydS5jb20vYXJ0aWNsZXMvd2hhdC1pcy1iaW5hbmNlLWNvaW4taXMtaXQtaGFsYWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "What is Binance Coin? Is it halal? - Islamic Finance Guru",
        "content": "Binance Coin (ticker: BNB) is the cryptocurrency issued by the popular Binance cryptocurrency exchange.\n\nBNB is one of the biggest cryptocurrencies in the world issued by the largest cryptocurrency exchange in the world: Binance. BNB is the native cryptocurrency behind the BNB chain ecosystem and runs natively on the Binance cryptocurrency exchanges and the Binance chain.\n\nBNB holds considerable market dominance as the fourth most popular cryptocurrency in the world and is closely tied to Binance’s platform.\n\nMost scholars hold BNB to be halal, we also share this view.\n\nContinue reading for a deep dive into Binance coin.\n\nWhat is Binance Coin (BNB)?\n\nCryptocurrency exchanges were created in a similar spirit to stock exchanges, to allow people to buy and sell assets. Several crypto exchanges have now been established, with Binance and Coinbase being juggernauts in the industry.\n\nCrypto exchanges aim to make it as easy as possible for people to sign up and exchange crypto assets. Along the way, some exchanges create their own cryptocurrency to be completely compatible with the exchange’s ecosystem.\n\nIn addition to being fully compatible and native, the cryptocurrency created by a particular company or exchange offers benefits such as reduced fees on the platform.\n\nThe Binance exchange was launched in mid-July of 2017. Binance wanted to launch a cryptocurrency that could be fully integrated within their ecosystem, and so 11 days before Binance exchange opened for trading they launched Binance Coin (BNB) through an Initial Coin Offering (ICO).\n\nAn ICO can be likened to an Initial Public Offering (IPO) whereby a private company lists itself on a stock exchange so that its shares can be traded by public retail investors.\n\nAn ICO is a method through which projects can raise funds by offering coins to early supporters and enthusiasts. The company or team behind the cryptocurrency provides coins immediately or at some specified time in the future to public investors. The ICO allows the team to raise funds to progress their development of the cryptocurrency and its ecosystem.\n\nUsers that bought BNB coins at its ICO got early access to coins at low prices, though they were not entitled to anything else like a stake in the ecosystem.\n\nBinance originally launched BNB as an ERC-20 token on the Ethereum blockchain which meant that it could be used seamlessly within the Ethereum ecosystem and be sent to ETH addresses. Binance then decided to migrate the BNB token to their own standard: BEP-2. They swapped all ERC-20 BNB coins with BEP-2 BNB coins at a 1:1 ratio.\n\nBinance’s intention with Binance Coin and its BEP-2 standard is to have their own native cryptocurrency and blockchain that is fully integrated and entrenched within their ecosystem and works in sync with its exchange.\n\nWhat does BNB do?\n\nAt the time of its launch in 2017, BNB’s major use case was as a utility token for discounted trading fees in the Binance exchange. Binance incentivises its users to buy and hold BNB and allow them to pay for their fees using BNB. This feature of BNB remains, whereby users that pay for fees using BNB receive up to 25% discount on fees. Users can also use BNB to pay for fees in the Binance Decentralised Exchange, as well as BNB’s blockchains.\n\nSince 2017, Binance has dramatically expanded BNB’s use cases. A major use case of any cryptocurrency is to be able to buy things and spend your crypto since they are, after all, called ‘currency’.\n\nBinance Launchpad allows developers and teams to launch their own cryptocurrency tokens. Users can buy and invest in these projects using BNB.\n\nOne of the most impressive use cases is Binance Card.\n\nBinance Card is a VISA debit card issued by Binance that allows you to transact all over the world, both offline and online, using your cryptocurrency. Your card is linked to your cryptocurrency account, and when you spend money your BNB (or other select cryptocurrencies) are converted in real-time to allow you to pay with cryptocurrency just as you would with cash using a debit card.\n\nImpressively, Binance Card offers cashback rewards of up to 4% if your monthly average balance hits 40 BNB.\n\nBinance Pay is another offering from Binance where you can use BNB to pay select online stores and outlets. However, the amount of places that accept Binance Pay means it may not even be worth the hassle in setting it up.\n\nSeveral popular blockchain based travel agencies, such as travala.com, accept BNB as a valid payment method. In addition to that, Travala’s own AVA token is a BEP-2 token, so it is connected to the overall Binance ecosystem.\n\nAn impressive use case of the Binance ecosystem is Binance Charity. The first non-profit organisation that delivers donations through cryptocurrency and allows donors to trace funds through transparent and permanent records on the blockchain. Users can donate their BNB to several causes the organisation is involved in.\n\nFrom the above, you can see Binance is trying to open as many avenues and make as many partnerships as they can with their BNB coin. The more use cases a cryptocurrency has, the more it will attract customers who will then begin using it more often.\n\nHow does BNB work technically?\n\nBEP-2\n\nA cryptocurrency standard is like a set of rules that developers must adhere to if they want their token to be part of an ecosystem. The most popular standard is Ethereum’s ERC-20. ERC-20 is the basis for dozens of cryptocurrencies and allows full compatibility with the vast Ethereum ecosystem, from NFTs and games to shopping and metaverse.\n\nThe native token of the Binance chain is BNB, which means that when users want to transfer BEP-2 tokens within the ecosystem, it is necessary to hold some BNB. This provides huge incentives for people to hold and use BNB because they need it to interact with one of the biggest cryptocurrency ecosystems in the world.\n\nAn advantage BEP-2 tokens have, as part of one of the most popular ecosystems, is being compatible with numerous wallets.\n\nBNB burning\n\nBinance has been ‘burning’ BNB coins regularly on a quarterly basis since 2017. They spend some of their revenue to buy BNB and essentially delete them from the chain.\n\nIt may seem wasteful at first, but Binance has the goal of halving the maximum supply of BNB to reach 100 million coins. This is to increase the scarcity of BNB and prevent its price from being inflated away.\n\nWhat are the use cases of BNB?\n\nReduced fees in the Binance ecosystem\n\nA major use case of BNB is that it provides its users with a special discount on trading fees on the popular Binance cryptocurrency exchange.\n\nFees normally sit at around 0.1% on each transaction. Users who use BNB to pay these fees can save exorbitant amounts of money, especially if they trade regularly or trade large sums.\n\nConsumer spending\n\nBinance has been trying to expand the concrete uses of BNB to appeal to more retail consumers. It is no surprise then that some of the advantages of using BNB flouted by the marketing team at Binance is its consumer and shopping aspect.\n\nBinance have launched Binance Card and Binance Pay to allow people to transact in BNB like they would with their fiat currency.\n\nBinance Card is a VISA debit card that enables you to spend your cryptocurrency sitting in your wallet just as you would spend the fiat currency sitting in your bank account. Binance has added extra incentives such as 4% cashback offers.\n\nBinance Pay is an online solution where users can shop using BNB at select outlets. However, this solution isn’t widely accepted and is still in its infancy. You can expect Binance to try and make more deals with online outlets to accept Binance Pay.\n\nAre people using BNB right now?\n\nBNB has a daily transaction count of under 5 million.\n\nIn November 2021 BNB daily transactions reached a peak of around 15 million and has continued to fall as the market entered a bear market.\n\nMore than 800 merchants accept BNB as payment though it hasn’t hit mainstream yet and is still compatible with niche merchants. With an increasing market dominance, currently standing at 4.74%, BNB is being used more as time goes on.\n\nWhat are the strengths and weaknesses of BNB?\n\nStrengths\n\nDiscounted trading fees : Users who pay their fees in the Binance ecosystem using BNB receive a special discount.\n\nIncreased use cases : Binance is working hard to incentivise users to use BNB in addition to its core uses. As one of the most influential cryptocurrency companies in the world, Binance has the ability to make deals and develop infrastructure. Binance is developing new features like GameFi, SocialFi, and a metaverse.\n\nInfluence and adoption : Because Binance is one of the biggest ecosystems in the world, BNB adoption is increasing. In addition to BNB burning, this means BNB’s price should continue to increase.\n\nWeaknesses\n\nCentralised : Binance is a centralised for-profit company, so the entire Binance and BEP-2 ecosystem is at the mercy of the profit incentives of the company. If Binance were to clash with regulators as has happened in the past, this can affect the BNB you hold.\n\nBinance holds the majority : Around 85% of BNB is held by Binance , and combined with the centralised issue above, this means the supply and direction of BNB itself is highly dependent on the direction Binance decides to go. This almost cancels out the spirit of cryptocurrencies in not being at the mercy of authorities.\n\nClashes with regulators : Binance have been under intense scrutiny from government and regulators and have been found to purposefully try to avoid regulations.\n\nIs BNB a good investment?\n\nBNB is one of the largest cryptocurrencies in the world issued by the most popular cryptocurrency exchange in the world. BNB ranks 4th in the entire cryptocurrency space by market capitalisation. It has a market capitalisation of around $49 billion with a market dominance of 4.74%.\n\nBNB is available on Binance as its native coin.\n\nBNB has declined in price following the recent market downturn in 2022 just as other cryptocurrencies and assets have. It currently has a price of $304 after reaching highs of almost $700 in 2021.\n\nEven though Binance has had issues with regulators, it seems to have taken the market by storm mainly due to the fact that it is issued by the biggest cryptocurrency exchange company in the world.\n\nBNB’s utility will continue to increase as Binance increases its use cases, making it a popular cryptocurrency to hold. As long as Binance and its ecosystem continues to hold its position in the cryptocurrency exchange space, BNB will be held and used by its users. In addition to BNB burning, this means many investors see BNB as a valuable part of their crypto portfolio.\n\nAlternatives to BNB\n\nBitcoin (BTC)\n\nThe original cryptocurrency that started it all off probably makes a much better investment overall because of its 39% market dominance and its being synonymous with cryptocurrency.\n\nBitcoin has the advantage of having a limited supply of 21 million coins which gives it more scarcity. Bitcoin also has more acceptance for payments amongst businesses, with more than 2,000 US businesses accepting Bitcoin.\n\nAs a long-term investment, Bitcoin has the upper hand.\n\nEthereum (ETH)\n\nA valid alternative to BNB is the network and cryptocurrency on whose technology it was originally based: Ethereum. Given how Ethereum is synonymous with the DeFi space with its 80% market DeFi dominance, Ethereum is the giant that offers much more ecosystem uses than BNB can overall.\n\nBNB offers an ecosystem with NFTs and games, but Ethereum was not only the original smart contract, NFT, and cryptocurrency ecosystem, but has the largest market dominance in the DeFi space and the second largest market dominance in the entire cryptocurrency space.\n\nEthereum has a level of credentials, adoption, and respect that BNB is still trying to attain.\n\nIs Binance Coin (BNB) halal?\n\nMost scholars hold BNB to be halal. We also share this view.\n\nThe essence of the debate on whether cryptocurrencies are halal comes down to whether they are ‘Māl’ as we have explained previously. Māl is something that can be acquired, whether it be an item or a service.\n\nThere are three stances on cryptocurrencies today:\n\nCryptocurrency is not Māl, rather it is a speculative, non-Sharia-compliant investment. Cryptocurrency is a digital asset but not a currency. Cryptocurrency is a digital currency.\n\nProponents of view (1) argue that cryptocurrencies are not Sharia-compliant since they have no intrinsic value and are merely entries on a digital ledger.\n\nOur view has always been that (1) does not seem right since cryptocurrencies have value as millions of people are willing to buy, hold, and trade them. They are just as real as fiat currency today which mostly exists in the spreadsheets of banks. Our monetary system became predominantly digital a while ago.\n\nView (2) seems to be the most realistic view, as cryptocurrencies are a new and emerging technology that are yet to mature into fully fledged currencies used by economies at large. However, in practice, there is no real difference for casual users between (2) and (3) since they both consider trading cryptocurrencies to be permissible.\n\nIt is important to remember that Zakat will be due on cryptocurrencies you hold, and BNB is no exception. To find out about how to calculate this, please read our article on Zakat on crypto.\n\nConclusion\n\nBinance has lofty aspirations for BNB and is trying to replace Ethereum as the number one crypto ecosystem. With its influence, reach, and market dominance there is a good chance that Binance can continue to propel BNB and increase its adoption.\n\nInvestors in BNB just need to keep an eye on Binance’s clashes with regulators and the position governments take on Binance. The only thing standing in the way of BNB is Binance."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3Lm5vdmluaXRlLmNvbS9hcnRpY2xlcy8yMTkwMjEvQnVsZ2FyaWFuK05hdGlvbmFsK0JhbmsrQW5zd2VyZWQrdGhlK01vc3QrRnJlcXVlbnRseStBc2tlZCtRdWVzdGlvbnMrYWJvdXQrdGhlK0V1cm_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Bulgarian National Bank Answered the Most Frequently Asked Questions about the Euro - Novinite.com",
        "content": "The Bulgarian National Bank (BNB) published questions and answers about the Eurozone on its website.\n\nWhat is the Eurozone?\n\nThe Eurozone is an association of those member states of the European Union (EU) that have adopted the euro as their national currency. A common currency, a single monetary policy aimed at price stability, and the coordination of economic and fiscal policies are the key features of the Economic and Monetary Union (EMU). All newly joined EU member states participate in the EMU with a derogation regarding the common currency and the single monetary policy until the moment of their accession to the Eurozone (except Denmark), with which they become full participants in the Economic and Monetary Union.\n\nWhen the euro was first introduced in 1999 – initially for cashless payments in trade and financial transactions – the Eurozone was made up of 11 of the then 15 EU member states. The number of participating countries increased to 12 on 1 January 2001 with the accession of Greece, just one year before the appearance of the available form of the euro as banknotes and coins. On 1 January 2007, Slovenia became the 13th member of the Eurozone, followed a year later by Cyprus and Malta, by Slovakia on 1 January 2009, Estonia on 1 January 2011, Latvia on 1 January 2014, Lithuania on 1 January 2015 and Croatia on 1 January 2023.\n\nAll EU member states have the obligation to join the Eurozone when they fulfill the necessary conditions for the introduction of the euro, until then they participate in the Economic and Monetary Union of the EU as a member state with a derogation. The only exception is Denmark, which has a right of non-participation specified in a protocol annexed to the Treaty, although the country may introduce the euro if desired in the future.\n\nAndorra, Monaco, San Marino and the Vatican have adopted the euro as their national currency under special monetary agreements with the EU and can issue their own euro coins within certain restrictions. Montenegro and Kosovo have also adopted the euro as their national currency, but with unilateral acts. Since none of the six countries are members of the EU, they are not part of the Eurozone.\n\nWhich countries are part of the Eurozone?\n\nThe member states of the Eurozone are 20 and these are: Austria, Belgium, Germany, Greece, Estonia, Ireland, Spain, Italy, Cyprus, Latvia, Lithuania, Luxembourg, Malta, Netherlands, Portugal, Slovakia, Slovenia, Finland, France and Croatia.\n\nWhat is the European Central Bank?\n\nAccording to the Treaty on the Functioning of the European Union, the European Central Bank (ECB) and the national central banks (NCBs) of all EU member states, whether or not they have adopted the euro, form the European System of Central Banks (ESCB). With the accession of Bulgaria to the EU on January 1, 2007, the Bulgarian National Bank is part of the ESCB.\n\nThe ECB and the national central banks of the Member States whose currency is the euro together make up the Eurosystem.\n\nThe ECB was established as the center of the Eurosystem and the ESCB and is based in Frankfurt am Main, Germany. The ESCB and the Eurosystem will exist in parallel as long as there are EU member states that have not adopted the euro as their currency.\n\nThe main objective of the Eurosystem is to maintain price stability, preserving the value of the euro. By maintaining low, stable and predictable levels of inflation, the aim is to assist citizens and businesses in planning their savings and spending. The goal is that tomorrow people will be able to buy as much with their money as they can today. Through its Governing Council, the ECB determines the monetary policy for the entire Eurozone – a single monetary authority with a single monetary policy and the main objective of maintaining price stability.\n\nThe ECB contributes to the security and stability of the European banking system, develops and issues euro banknotes, manages and maintains the normal functioning of payment systems, contributes to the preservation of financial stability.\n\nWhat are the criteria for adopting the euro?\n\nAchieving nominal and sustainable convergence is the condition for membership, according to the EU Treaty, which Bulgaria must fulfill. The achievement of such convergence is determined by the fulfillment of the criteria for membership of the Eurozone defined in the Maastricht Treaty, namely:\n\n• Price stability criterion, according to which the average rate of inflation does not exceed by more than 1.5 percentage points the average rate of inflation in the three member states with the best results in the area of price stability;\n\n• The budget deficit should not exceed 3% of GDP;\n\n• State debt should not exceed 60% of GDP;\n\n• The average amount of the nominal long-term interest rate, measured by the yield of ten-year government bonds denominated in the national currency, for a period of one year before the assessment does not exceed by more than 2 percentage points the average value of the indicator for the three best performing Member States results in the area of price stability;\n\n• Participation of the national currency in the Exchange Rate Mechanism II for a period of at least two years prior to the assessment, without depreciation relative to the central rate to the euro.\n\nAlong with the implementation of legal, economic and structural measures to strengthen the competitiveness and sustainability of the economy, the path to the smooth adoption of the euro is also connected with in-depth planning and practical preparation for the adoption of the single currency by both the administration, businesses and citizens.\n\nWhat are the benefits of the euro?\n\nThe euro offers many benefits to the citizens, businesses and economies of the countries that use it. Some of them are:\n\n• easy price comparison between euro area member states, which increases competition between businesses, thus benefiting consumers;\n\n• price stability;\n\n• an opportunity for companies to trade more easily, cheaper and safer in the Eurozone and with the rest of the world;\n\n• increasing economic stability and growth;\n\n• better integrated and therefore more efficient financial markets;\n\n• greater influence in the world economy through the use of the world's second reserve currency;\n\n• a tangible symbol of European identity.\n\nMany of these benefits are interrelated. For example, economic stability benefits the economy of an EU country as it makes it easier for the government to make strategic long-term decisions. But economic stability also benefits businesses, as it reduces uncertainty and stimulates investment. This, in turn, benefits the citizens due to increased employment and better quality jobs.\n\nWho is responsible for the coordination of Bulgaria's preparations for the introduction of the euro?\n\nThe Coordinating Council for the Preparation of the Republic of Bulgaria for Eurozone Membership (hereinafter referred to as \"the Council\") is responsible for organizing, coordinating and monitoring the practical preparation of the Republic of Bulgaria for Eurozone membership. The Council is also responsible for the development, implementation and, if necessary, the updating of the National Plan for the introduction of the euro in the Republic of Bulgaria.\n\nAmong its functions are also the approval of documents, activities and initiatives related to the preparation for the adoption of the single European currency, as well as periodic reporting to the Council of Ministers on the progress of the preparation. The Council was established back in 2015 (by Decree No. 168 of the Council of Ministers), and its activity was resumed after the accession of the Bulgarian lev to the Exchange Rate Mechanism II.\n\nThe Council is jointly chaired by the Governor of the Bulgarian National Bank and the Minister of Finance, who is the national coordinator of the preparation of the Republic of Bulgaria for membership in the Eurozone.\n\nMembers of the Council are:\n\n• The heads of the working groups and subgroups, which expertly support the work of the Council and whose scope of activity is described in the Plan for the introduction of the euro in the Republic of Bulgaria, including the Deputy Minister of Finance, the Deputy Minister of Economy and Industry, the Deputy Governors of the BNB and member of the Financial Supervision Commission;\n\n• The Deputy Prime Minister for the management of European funds;\n\n• Deputy Minister of Foreign Affairs;\n\n• Deputy Minister of Justice;\n\n• Deputy Minister of e-Government;\n\n• Deputy Minister of Internal Affairs;\n\n• The Chairman of the National Security State Agency;\n\n• Deputy Minister of Transport and Communications.\n\nWhere can I find complete and accurate information about the introduction of the euro in Bulgaria?\n\nThe website for the euro, which will start operating from the end of March 2023, will be the main institutional channel for informing citizens and businesses about the introduction of the euro in Bulgaria. It will publish information about:\n\n• Benefits of introducing the euro;\n\n• Useful practical information, incl. time periods and methods for currency exchange and dual pricing, changes for citizens and businesses;\n\n• Appearance and security features of euro banknotes and coins;\n\n• Good practices and experience of other countries that introduced the euro;\n\n• Documents regulating the process of introducing the euro: the National Plan, the Law on the introduction of the euro, guidelines/recommendations related to the adoption of the euro in various sectors, etc.\n\nInformation will also be available on a dedicated free phone line, which will be revealed later. A mobile application is also planned to be developed. Its function will be to inform and provide an opportunity to calculate the value of goods and services from BGN to EUR and vice versa.\n\nA comprehensive communication campaign will be conducted to inform citizens and businesses about the introduction of the euro. Various channels will be used to inform the public: TV channels, radio, social networks, online and print media, etc.\n\nAt what rate will leva be exchanged for euros after the introduction of the euro in Bulgaria?\n\nThe exchange of the lev with euro will take place at the current exchange rate of BGN 1.95583 for 1 euro. The commitment of the Bulgarian authorities for our country to join the Eurozone only with the current fixed exchange rate has been confirmed both in the National Plan for the introduction of the euro in the Republic of Bulgaria, adopted by the Council of Ministers in May 2022, and in the Decision of the National Assembly of 27 October 2022\n\nWhat does currency conversion between euro and lev mean?\n\nCurrency conversion means physical exchange of BGN for EUR and prices recalculation, deposits, loans, financial instruments and other balance sheet positions from levs in euro. The conversion will be carried out by applying the irrevocably fixed exchange rate of BGN 1.95583 per 1 euro, which will be confirmed by amendment to Regulation (EC) No 2866/98 of the Council of 31 December 1998 on the currency courses to the euro on the currencies to the Member States who accept the euro.\n\nThe prices and cash units of BGN in euro will be done by applying the full digital amount of the fixed conversion course, i.e. Using all five characters after decimal comma. The resulting amount will be rounded to two characters after the decimal comma based on the third sign after the decimal comma in accordance with the following mathematical Rule of rounding:\n\n1. When the third sign after the decimal comma is less than five, the second sign after the decimal comma remains unchanged;\n\n2. When the third sign after the decimal comma is equal to or greater than five, the second sign after the decimal comma increases by one.\n\nIt is not permitted to recalculate prices at a course other than the fixed exchange rate. Additional fees and commissions for recalculations will not be allowed to be charged from consumers.\n\nHow will the lev accounts be converted into euros?\n\nFrom the date of Bulgaria's membership in the Eurozone all types of accounts: payment accounts, deposit accounts, current budget accounts, savings accounts, accounting accounts, liquidation accounts and other accounts in local banks, as well as payment accounts with other payment service providers (payment institutions and electronic money companies), will be single, automatic and free of charge in euro. There will be no transitional period for these accounts. This means that from the first day of the euro adoption, the account holders will only be able to withdraw euro from their lev bills, whether the withdrawal will be through ATM/POS device or in the office of the payment service provider (bank, payment institution or Electronic Money Society). This is a quick and convenient way to replace the levs with the euro without a special commitment for the account holder himself. From the first day of the introduction of the euro, cashless payments will only be made in the euro.\n\nWith the introduction of the euro, does the lev immediately cease to be a legal tender?\n\nDuring the first one month from the date of the introduction of the unified European currency in the Republic of Bulgaria, the lev and the euro will be in circulation at the same time, with both currencies having status of legal tender. After this one month, the euro will remain the only legal currency for payment in Bulgaria.\n\nThe one-month transition period will help to provide a gradual transition to the new currency. During this one month, citizens will be able to pay with both currencies at retail outlets and service centers. On the other hand, traders must return their customers' change exclusively in euros unless they can’t do so for practical reasons. Thus, in practice, some of the levs in circulation will be exchanged through traders and persons providing services, thus providing another exchange channel for Bulgarian citizens. At the same time, in compliance with Council Regulation (EC) No 974/98 of 3 May 1998, the introduction of the euro will be adopted by which in this transitional period the trader may not accept more than 50 coins in BGN and pennies in limits of one transaction with the buyer.\n\nHow will the exchange of money in accounts be done?\n\nThe transformation of bank accounts from BGN to euro will be carried out on the day of the introduction of the euro. All funds in levs on current, deposit, savings and other accounts in local banks and other payment service providers will be transformed into euro free of charge on the day of the introduction of the euro. Therefore, in the months after the decision of the EU Council that Bulgaria is eligible for the adoption of the euro and before the introduction of the euro, citizens will be invited to deposit as many lev banknotes and coins in bank accounts. As of the day of the introduction of the euro, in Bulgaria all dematerialized payments will only be made in euro.\n\nHow will cash exchange be done? Where and how long will the levs be exchanged with the euro after the introduction of the euro in Bulgaria? Will there be a fee?\n\nFrom the date of introduction of the euro, the Bulgarian National Bank will exchange free of charge, in an unlimited quantity and without restriction in time, banknotes and coins from levs in the euro at the official exchange rate of BGN 1.95583 for 1 EUR.\n\nDuring the first six months from the date of introduction of the euro in Bulgaria, banks and Bulgarian Posts EAD will exchange for free of charge at the cashier banknotes and coins from BGN to euro at the official exchange rate.\n\nIn the next six months, banks will continue to exchange banknotes and coins from BGN in euros, but will have the right to impose a fee for this service.\n\nAfter the expiration of the first 12 months after the introduction of the euro, banks and Bulgarian Posts EAD may suspend the conversation of banknotes and coins from BGN to euro in cash.\n\nHow long will we be able to pay with BGN?\n\nDuring the first one month from the date of the introduction of the euro in Bulgaria, the lev and the euro will be in circulation at the same time, with both currencies with status of legal payment (the so-called double circulation of BGN and EUR). After this one month, the euro will remain the only currency of Bulgaria.\n\nIf I pay in BGN, do they have the right to return change in EUR and vice versa?\n\nDuring the first month of the introduction of the euro, citizens will be able to pay in both currencies at retail outlets and service centers.\n\nDuring this period, traders will have an obligation to return their customers' change only in euros. Only in the case of objective impossibility will the trader have the right to return the change in cash in BGN or in BGN and euros. In this way, another exchange channel will be provided for replacement of the lev with the euro and for the withdrawal of levs from circulation.\n\nIn compliance with Council Regulation (EC) No 974/98 of May 3, 1998, the introduction of the euro will be adopted by which in this one month the trader may not accept more than 50 coins in BGN, including pennies, within one transaction with the buyer.\n\nWhen will prices be labeled in EUR?\n\nOne month after the EU Council decides to adopt the euro in the Republic of Bulgaria, a requirement for a mandatory prices at the same time in BGN and euros will come into force. This obligation will continue to be in force for 12 months from the date of adoption of the euro.\n\nWhen will a double designation of prices be introduced in EUR and in BGN?\n\nThe obligation to double prices is planned to start operating one month after the decision of the Council to accept the euro in the Republic of Bulgaria and to remain in force 12 months after the adoption of the European currency. The experience of the Member States that last introduced the euro, shows that this obligation has produced very good results. It has helped to prevent speculative prices, allowing consumers to easily identify traders and other businesses that have unfarily raised prices.\n\nParticular attention will be paid to the merchants and service providers who should show the prices of their products and/or services in both currencies during the double prices period. During the same period, prices in BGN and in EUR should also be made in advertising materials containing information regarding the prices of advertised services and/or products.\n\nDouble prices will also apply to public authorities. During this period, all amounts due to the Bulgarian citizens of the state, including taxes, fees, etc., should be indicated in BGN and in EUR. The same applies to the amounts due from the state to the citizens. Public authorities should also prepare information materials in connection with the double labeling of prices and price lists in which the prices are written in both currencies.\n\nHow will merchants return the change on the day we adopt the euro?\n\nIn order to facilitate the introduction of the euro, during the first month from the date of Bulgaria's membership in the Eurozone, the change for payment in cash, regardless of BGN or euro, should be paid by traders only in EUR unless for objective reasons, this cannot be able to be done. To this end, companies and traders will be provided with Euro banknotes and coins before the date of introduction of the euro. The rule will also apply that in the transitional period of circulation of the two currencies the trader will not be obliged in one transaction to receive more than 50 coins in BGN, including pennies.\n\nWill goods and services double in price after the replacement of the lev with euro?\n\nReplacing the lev with the euro will not lead to a double rise in price of goods and services.\n\nThe manner of conversion the prices of goods and services will be regulated in the Law on the Introduction of the euro in the Republic of Bulgaria. It will be explicitly provided that the conversion of BGN in euro will be carried out and the price in BGN is divided into the full numeric value of the official exchange rate with all five characters after the decimal comma. Prevention will not be allowed by using a shortened form of the official exchange rate. After the overrun, the amount received will be rounded to two characters after the decimal comma based on the third sign after the decimal comma in accordance with the following mathematical Rule of rounding:\n\n1. When the third sign after the decimal comma is less than five, the second sign after the decimal comma remains unchanged;\n\n2. When the third sign after the decimal comma is equal to or greater than five, the second sign after the decimal comma increases by one.\n\nIt is also envisaged a long period of dual labeling of the prices of goods and services to avoid a speculative rise in their prices as a result of the introduction of the euro. This period will begin one month after the adoption of the decision of the Council of the European Union on the introduction of the euro by the Republic of Bulgaria and will be in force 12 months after the date of admission of the country in the Eurozone. The purpose of the introduction of the duty obligation is an easier adaptation of citizens to the new currency and preventing abuse and speculative price increase.\n\nIn EU Member States, last introduced the euro, the double prices has been proved as a successful measure in counteracting the rise in prices due to the introduction of the euro.\n\nIn order to encourage the correct traders, the Ministry of Economy and the Industry, together with the Commission for Consumer Protection and representatives of the non-governmental organizations, will organize an \"honest trader\" campaign with a clearly recognizable campaign logo. Those of the merchants/service providers who comply with the rules for accurate conversion of prices of their products/services from levs into euro, as well as for an understandable and correct pricing designation during the double pricing period, will receive a \"honest trader\" sticker to inform users that they are participating in the campaign. In order to monitor the good practices of traders, the institutions - the organizers of the campaign, will be responsible, and the citizens will be invited to join the process of collecting and reporting information.\n\nWill inflation rise after the introduction of the euro?\n\nThe experience of the last countries that joined the Eurozone shows that the immediate effect of entering the Eurozone at the price levels is in the percentage of 0.3-0.5 % increase in inflation. At the same time, it should be remembered that due to the catching economic effect and lower prices in Bulgaria compared to the EU, as well as the increase in energy prices and geopolitical turmoil in the last year, inflation in Bulgaria has grown.\n\nIt is expected that the introduction of the euro will have a minimal effect on price increases. If we look at the Republic of Croatia as an example, the latest country that joined the Eurozone, we will see that according to Eurostat Inflation in Croatia for January 2023, it has risen by 0.2%. The annual inflation in January 2023 was 12.5%, in December 2022 - 12.7%, and in November 2022 - 13%.\n\nThe effect from the transition to the euro in the total amount of inflation in Slovenia is 0.3, in Slovakia - 0.15, in Estonia - 0.3, in Latvia - 0.2, and in Lithuania - 0.11 percentage points.\n\nWho will keep track of fraud and sanction for abuse of prices?\n\nThe Bulgarian National Bank and the Financial Supervision Commission, in accordance with their powers, will exercise control over compliance with the requirements of their sub-party persons: banks, insurance and pension companies, etc.\n\nMain bodies regarding the control and sanctioning of the traders related to the introduction of the euro will be: the Consumer Protection Commission (CPC), the Commission for Protection of Competition, the National Revenue Agency (NRA) and the Economic Police Sector to the Ministry of Interior. Each citizen will have the right to report violations to the CPC or to the relevant control body.\n\nTraders who deliberately violate the rules for conversion or rounding will be sanctioned in accordance with the current legislation.\n\nWhere will I be able to signal if I encounter incorrect traders?\n\nThe signals will be able to be submitted through the website of the Consumer Protection Commission, on the euro page, as well as through the free telephone line for the euro, which will be opened 6 months before the date of introduction of the euro.\n\nWhen the conversion from BGN to EUR happens, if my salary is 1500 BGN, will it automatically become 1500 euros?\n\nThe salaries will be paid in euro after the date of introduction of the euro. The amounts in the employment contracts should be converted in favor of the employee, rounding the amount to the nearest Eurocent. If the sign that follows the last sign to which the rounding is made is greater than 0, one unit should be added to the last sign or a new amount of which is not lower than that in BGN will be determined. Thus, in the case of overrun the sum of 1500 BGN will become 766.94 euros and may be rounded by the employer at EUR 767.\n\nWhat about my savings in the bank, which are in BGN?\n\nFrom the date of Bulgaria's membership in the Eurozone, all accounts - payment, deposit, savings and other accounts in local banks - will be one-time, automatically and freely converted in euro.\n\nThere will be no transitional period for these accounts. This means that from the first day of the euro acceptance, the account holders will only be able to withdraw from their lev bills, whether the withdrawal will be through ATM/POS device or in the office of a bank, payment institution or e-money company.\n\nThis is a quick and extremely convenient way to replace the levs with the euro without a special commitment for the account holder himself.\n\nFrom the first day of the introduction of the euro, cashless payments will only be made in the euro.\n\nIf I have more than BGN 10,000 saved and they are not in the bank, how can I exchange them into euros after the introduction of the euro in Bulgaria?\n\nIn the months leading up to the introduction of the euro, citizens will be encouraged to deposit as many leva banknotes and coins as possible into bank accounts. Considering that all BGN funds on the accounts will be converted free of charge into Euros on the date of introduction of the Euro, starting from that day, cashless payment transactions will be carried out only in Euros.\n\nFrom the date of the introduction of the euro, the Bulgarian National Bank will exchange for free, in an unlimited quantity and without a time limit, banknotes and coins from levs into euros at the official exchange rate of BGN 1.95583 for 1 euro.\n\nDuring the first six months from the date of introduction of the euro in Bulgaria, banks and \"Bulgarian Posts\" EAD will exchange banknotes and coins from levs into euros at the cash desk free of charge at the official exchange rate.\n\nIn the next six months, banks will continue to exchange banknotes and coins from levs to euros, but they will have the right to charge a fee for this service.\n\nAfter the expiration of the first 12 months of the introduction of the euro, banks and \"Bulgarian Posts\" EAD may suspend the service for exchanging banknotes and coins from levs to euros in cash.\n\nHow will taxes be paid after the introduction of the euro in Bulgaria?\n\nWith the introduction of the euro, all taxes, fees and other payments to the state and municipalities must be made in euros. An exception to this rule will be made in the period of the double circulation of the leva and the euro, i.e. one month from the date of introduction of the euro.\n\nAfter the date of the introduction of the euro in Bulgaria, the refund of amounts unduly paid or collected before the introduction of the euro for taxes, state or municipal fees, mandatory insurance contributions, fines and property sanctions, and other public obligations, will be carried out in euros.\n\nAmounts on tax returns will be stated in the currency that was legal tender at the end of the tax period for which the tax return is submitted. When the tax period for which the declaration is submitted ends in the period of double circulation of leva and euro, the monetary values in the tax declaration should be indicated in euros.\n\nWith the adoption of the euro, will contracts change?\n\nIn the process of introducing the euro, the principle of continuity of contracts will be applied. This means that:\n\n• the introduction of the euro should not affect the operation of existing contracts with references of leva or with references to leva;\n\n• all values specified in BGN in the existing contracts will be considered as values in Euro when applying the official exchange rate and the rounding rules specified in the Law on the Introduction of the Euro;\n\n• the introduction of the euro does not lead to a change in any of the terms in a contract or exemption from obligation or performance under any contract, nor does it entitle a party to unilaterally amend or terminate such a contract unless otherwise expressly agreed between the parties;\n\n• the reference in contracts to BGN without specifying the value is considered a reference to the euro.\n\nI have a home loan in euros. Can the bank request a renegotiation of its terms after the introduction of the euro?\n\nFrom the date of the introduction of the euro, all loans originally granted in BGN or loans with a currency clause in euro will be considered as loans in euro. The introduction of the euro will not be allowed to be used as a condition for the renegotiation of clauses in contracts already concluded between banks and their customers or as a basis for other similar actions by banks in relation to their customers that would put them in a less favorable financial position relative to their position before the revaluation.\n\nThis will also apply to non-bank financial institutions that provide loans to customers.\n\nIf I buy a gift voucher shortly before the date of introduction of the euro and it remains unused until that date, will it be lost?\n\nPostage stamps, lotteries with a predetermined result, discount coupons, coupons for the value of returned goods, vouchers, including food vouchers and other bearer securities which were on sale or in circulation before the date of introduction of the euro and whose values are expressed in BGN, will be able to be used even after the date of introduction of the euro until their expiration date or until quantities are exhausted.\n\nI am a private trader, will the state cover my costs related to the introduction of the euro?\n\nIn the process of introducing the euro, the principle of efficiency and economy will be applied. According to this principle, the costs arising for individuals from the introduction of the euro as the monetary unit of the Republic of Bulgaria are at their expense and are not compensated with public funds.\n\nThe mere revaluation of receivables and liabilities, the servicing of bank accounts and the transition to payments in euros is not expected to lead to additional costs for the companies - clients of the banks.\n\nWhat changes will occur in the preparation of the Annual Financial Report of companies?\n\nThe annual financial statements will be prepared in the currency that is in official circulation in the Republic of Bulgaria at the end of the reporting period, and the comparable data for the previous reporting period should be in the same currency.\n\nHow will accounting be done when adopting the euro?\n\nWith a view to defining a uniform accounting procedure for the transition to the euro, the future Law on the introduction of the euro in the Republic of Bulgaria and/or other normative acts will adopt normative changes related to:\n\n• The preparation of accounting supporting documents, accounting registers and financial statements, where the valuation is in BGN;\n\n• Procedures for conversion of capital and shares of companies in euro;\n\n• Procedures for entering operations with cash registers during the transitional period in which payments in BGN and EUR are accepted.\n\nWith the introduction of the euro, economic and public entities should conduct their financial reporting in the new currency, and the data for the previous accounting period should be converted into euros in order to ensure comparability between the current and previous period. In the declarations and forms that citizens and legal entities will fill out after the introduction of the euro and which refer to tax and other obligations to the state or receivables from the state for the period preceding the year of introduction of the euro, the amounts will be in Bulgarian levs. However, the payments themselves based on these liabilities and receivables will be made in euros, with the amounts converted into the new currency at the official fixed exchange rate.\n\nHow will the deposits be converted from BGN to EUR?\n\nThe conversion of levs into euros on accounts with banks and other payment service providers will take place on the date of introduction of the euro. All funds in BGN in current, savings, custody and other accounts in local banks and other payment service providers will be converted into euros once and free of charge on the day of the introduction of the euro.\n\nWill the revaluation affect the interest rate on deposits?\n\nIf the agreed interest rate on the deposit is fixed, the bank should continue to apply a fixed interest rate even after the introduction of the euro. The mechanism for transferring from a fixed interest rate in BGN to a fixed interest rate in Euro should not lead to less favorable conditions or results for the parties to the transaction - both for the client and for the bank. In this regard, the transition from a fixed interest rate in BGN to a fixed interest rate in EUR should be determined according to the bank's methodology, guaranteeing that the resulting interest payment in EUR is equivalent to that in BGN on the date of conversion.\n\nIf the deposit is agreed with a variable interest rate, this parameter will be modified in a manner regulated in the provisions of the Law on the introduction of the euro. The transition from a variable interest rate in BGN to a variable interest rate in EUR should be determined according to the bank's methodology, ensuring that the resulting interest payment in EUR is equivalent to that in BGN on the date of the conversion. Unlike cash, the conversion of which is a relatively time-consuming and logistically more difficult task, money held in bank accounts and in payment accounts with other payment service providers will be converted into euros immediately, with no transition period required. In the months before the introduction of the euro, citizens will be invited to deposit as many leva banknotes and coins as possible in bank accounts. Considering that all BGN funds on the accounts will be converted into Euros on the day of the introduction of the Euro, starting from that day, cashless payment transactions will be carried out exclusively in Euros.\n\nHow will loans from levs to euros be converted?\n\nFrom the day of the introduction of the euro, all loans originally granted in BGN or loans with a currency clause in euro will be considered as loans in euro. It is not allowed that the revaluation be used as a condition for renegotiation of clauses of already concluded contracts between the banks and their customers or as a basis for other similar actions by the banks in relation to their customers, which would put them in a less favorable financial position compared to their position before the conversion. The same will apply to non-bank financial institutions that provide loans to customers.\n\nThe introduction of the euro does not require changes to the existing loan contracts, regardless of whether they are loans in BGN or loans with a currency clause in euros, as the question of their conversion will be regulated by the euro law. In particular, the Eurolaw will provide that the credit agreements remain in force and BGN-denominated amounts in those agreements will be considered as amounts in Euros, being converted at the official fixed rate expressed to five decimal places, and are rounded according to the rules laid down in the future Law on the introduction of the euro.\n\nWill the revaluation affect the interest rate on loans?\n\nIf the agreed interest rate on the loan is fixed, the bank should continue to apply a fixed interest rate even after the introduction of the euro.\n\nThe mechanism for transferring from a fixed interest rate in BGN to a fixed interest rate in Euro should not lead to less favorable conditions or results for the parties to the transaction - both for the client and for the bank. In this regard, the transition from a fixed interest rate in BGN to a fixed interest rate in EUR should be determined according to the bank's methodology, guaranteeing that the resulting interest payment in EUR is equivalent to that in BGN on the date of the conversion.\n\nIf the loan is contracted with a variable interest rate, this parameter will be modified in a manner regulated by the provisions of Eurolaw. The transition from a variable interest rate in BGN to a variable interest rate in EUR should be determined according to the bank's methodology, ensuring that the resulting interest payment in EUR is equivalent to the interest payment in BGN on the date of conversion.\n\nIn this regard, the financial situation of the debtor should not be a reason for the deterioration of the interest parameters under the contract. The change of the reference interest rates from BGN to EUR should be carried out in a sufficiently justified and transparent manner, which does not aggravate the financial situation of the clients and does not lead to additional costs compared to the interest costs that the client would incur in the BGN equivalent of his obligation.\n\nBanks and other financial institutions will have to inform their customers about the upcoming changes in advance (for example, three months) before the official switch to the euro, incl. and by disclosing its interest rate recalculation algorithm pages.\n\nHow will revaluation of securities and other financial instruments be carried out?\n\nFrom the date of introduction of the euro, all government securities originally denominated in levs are automatically converted into euros. Despite the prevailing volumes of government debt in the balance sheets of banks and financial institutions, there are also other forms of debt investments denominated in BGN - mostly investments in senior and subordinated debts (bonds) issued by financial and non-financial companies on the Bulgarian market, as and investments in shares of Bulgarian companies registered in the Central Depository. The value of the investments in such securities should also be converted into Euros, including the accumulated fair value revaluation and amortization reserves of the debt instruments to date. The change in the nominal value of debt securities and shares in the central securities register is carried out by the Central Depository.\n\nIf the agreed interest rate on the securities or other financial instruments is fixed, the issuer should continue to apply a fixed interest rate even after the introduction of the euro.\n\nThe mechanism for transferring from a fixed interest rate in BGN to a fixed interest rate in Euro should not lead to less favorable conditions or results for the parties to the transaction. In this regard, the transition from a fixed interest rate in BGN to a fixed interest rate in EUR should be determined according to the methodology of the issuer of the instrument, guaranteeing that the resulting interest payment in EUR is equivalent to that in BGN on the date of the conversion.\n\nIf the securities or other financial instruments are contracted with a variable interest rate, this parameter will be modified in a manner regulated by the provisions of Eurolaw. The transition from a variable interest rate in BGN to a variable interest rate in EUR should be determined according to the methodology of the issuer, ensuring that the resulting interest payment in EUR is equivalent to the interest payment in BGN on the date of the conversion.\n\nWhat happens to the collateral during conversion from BGN to EUR?\n\nThe change in the nominal value of collateral pledged/mortgaged in favor of banks and financial institutions should be automatically reflected through the register of special pledges and/or the property register. In order to protect the interests of the persons who established the security, no other changes in the value of the pledged/mortgaged property are allowed as a result of the automatic conversion from BGN to EUR - i.e. the replacement of leva with euro should not be used as a reason for a change (both in the direction of increase and in the direction of decrease) in the value of the collateral.\n\n/BNB\n\nFollow Novinite.com on Twitter and Facebook\n\nWrite to us at editors@novinite.com\n\nИнформирайте се на Български - Novinite.bg"
    }
]