[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiwAFodHRwczovL3d3dy50aGVhc2hsZXlzcmVhbGl0eXJvdW5kdXAuY29tLzIwMjMvMDQvMjUvc2lzdGVyLXdpdmVzLXN0YXItbWVyaS1icm93bi1yZWxvY2F0ZXMtdG8tdXRhaC1mb2xsb3dpbmctc3BsaXQtZnJvbS1odXNiYW5kLWtvZHktYnJvd24tZXhlcy1zcG90dGVkLWZpbG1pbmctdG9nZXRoZXItYXQtbWVyaXMtYmVkLWJyZWFrZmFzdC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Apr 2023 07:00:00 GMT",
        "title": "'Sister Wives' Star Meri Brown Relocates to Utah Following Split From Kody Brown; Exes Spotted Filming Together at ... - The Ashley's Reality Roundup",
        "content": "Meri Brown is moving on…to Utah.\n\nAccording to In Touch, the Flagstaff, Arizona, rental home the Sister Wives star was living in is back on the market for rent and available for move in on May 15. (If you want to live in Meri’s Mountain Mansion, it will set you back a cool $5800 a month!)\n\nOnline records indicate that Meri has also updated both her personal and business address to Parowan, Utah, which is the location of Lizzie’s Heritage Inn, her bed and breakfast.\n\nMeri’s move to Utah comes just months after she and husband Kody Brown announced they were “permanently terminating” their marriage (or whatever was left of it, at least) after more than 33 years.\n\nWhile Meri and Kody are no longer together as dysfunctional spouses, Starcasm reports that the exes were spotted filming for ‘Sister Wives’ together recently.\n\nA video of the two taken in Parowan outside of Lizzie’s Heritage Inn, was posted to Reddit this week. (Kody’s only remaining wife, Robyn Brown, may have been present as well.)\n\nMeri purchased the bed and breakfast in December 2017 on her own (after Kody & Co. turned her request for financial help from the family down). A moving truck spotted at the B&B seems to suggest that Meri is now making Lizzie’s Heritage Inn her new permanent residence. (This is a surprising turn of events, considering Meri stated during the previous season of ‘Sister Wives’ that she had no desire to live at her B&B, despite Kody suggesting that she do so.)\n\nMeri’s presumed relocation to Utah means Janelle Brown is the only ex-wife of Kody’s still residing in Flagstaff, where Kody and Robyn continue to live.\n\nAs The Ashley previously told you, Christine Brown moved to Utah shortly after her 2021 split from Kody. It was recently revealed that Christine and fiancé David Woolley purchased a home together in March, also located in Utah.\n\nRELATED STORY: ’Sister Wives’ Star Gwen Brown Unsure If Dad Kody Brown Will Attend Her Wedding: “Don’t Think He Wants Anything To Do With Us”; Gwen Reveals Who’s Walking Her Down the Aisle\n\n(Photos: TLC; Reddit)"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3LnlhaG9vLmNvbS9lbnRlcnRhaW5tZW50L3Npc3Rlci13aXZlcy1tZXJpLWJyb3duLWJ1c2luZXNzd29tYW4tMTM1OTM3Mzg2Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Apr 2023 07:00:00 GMT",
        "title": "Sister Wives' Meri Brown Is a Businesswoman: Details on Her Bed-and-Breakfast and LuLaRoe Businesses - Yahoo Entertainment",
        "content": "Businesswoman! Sister Wives star Meri Brown isn’t just a reality star ​– she also owns two successful businesses. Keep scrolling to learn about her bed-and-breakfast, Lizzie’s Heritage Inn, her LuLaRoe business and more.\n\nWhat Businesses Does ‘Sister Wives’ Star Meri Brown Own?\n\nMeri is the owner of the bed-and-breakfast, Lizzie’s Heritage Inn, which is located in Parowan, Utah.\n\nShe also makes money as a trainer at the fashion company LuLaRoe.\n\nHow Long Has ‘Sister Wives’ Star Meri Brown Owned Lizzie’s Heritage Inn?\n\nMeri’s plan to purchase Lizzie’s Heritage Inn was a major storyline during season 12 of the TLC show.\n\nAt the time, the mother of one sat down with her then-husband, Kody Brown, and his other wives — Janelle Brown, Christine Brown and Robyn Brown — to discuss purchasing the property that once belonged to her family. Kody was initially reluctant and argued that it didn’t seem like a lucrative opportunity. However, Christine was supportive despite her strained relationship with Meri in the past.\n\nWhile Kody expressed his concerns, Meri made it clear that she wouldn’t let her family’s opinions stop her from the business venture. “This is my baby,” she said in a confessional. “They don’t care about the house or the bed-and-breakfast business. Once I get this house done, I don’t want to have any more business meetings about my house. I want to run my business my way.”\n\nMeri ultimately bought the inn and has turned it into a successful business. The bed-and-breakfast has won several awards since the TV personality ​bought the house and turned it into a bed-and-breakfast, including “Best Country Inn” in Utah as part of Official Best of America in both 2018 and 2019.\n\nIn addition to welcoming guests at the bed-and-breakfast, Meri also periodically offers exclusive retreats. The first retreat was held in October 2022, while she decided to host a love-themed event in February 2023.\n\nWhat Does ‘Sister Wives’ Star Meri Brown Do for LuLaRoe?\n\nAnother one of Meri’s professional passions comes from her work as a trainer for LuLaRoe, which she began doing in 2016.\n\nSister Wives’ Meri Brown Is a Businesswoman: Details on Her Bed-and-Breakfast and LuLaRoe Businesses\n\n“I'm so happy to offer this platform for your shopping convenience,” Meri wrote in her bio section on the website. “Also join my Facebook group and come make friends and check out my ever-changing collection of fabulous LuLaRoe styles, prints and patterns.”\n\nOn her LuLaRoe Facebook page, Meri interacts with customers to give fashion advice and holds live sale events for members of the group."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3LnlhaG9vLmNvbS9lbnRlcnRhaW5tZW50L3Npc3Rlci13aXZlcy1tZXJpLWJyb3duLWJ1c2luZXNzd29tYW4tMTM1OTM3Mzg2Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Apr 2023 07:00:00 GMT",
        "title": "Sister Wives' Meri Brown Is a Businesswoman: Details on Her Bed-and-Breakfast and LuLaRoe Businesses - Yahoo Entertainment",
        "content": "Businesswoman! Sister Wives star Meri Brown isn’t just a reality star ​– she also owns two successful businesses. Keep scrolling to learn about her bed-and-breakfast, Lizzie’s Heritage Inn, her LuLaRoe business and more.\n\nWhat Businesses Does ‘Sister Wives’ Star Meri Brown Own?\n\nMeri is the owner of the bed-and-breakfast, Lizzie’s Heritage Inn, which is located in Parowan, Utah.\n\nShe also makes money as a trainer at the fashion company LuLaRoe.\n\nHow Long Has ‘Sister Wives’ Star Meri Brown Owned Lizzie’s Heritage Inn?\n\nMeri’s plan to purchase Lizzie’s Heritage Inn was a major storyline during season 12 of the TLC show.\n\nAt the time, the mother of one sat down with her then-husband, Kody Brown, and his other wives — Janelle Brown, Christine Brown and Robyn Brown — to discuss purchasing the property that once belonged to her family. Kody was initially reluctant and argued that it didn’t seem like a lucrative opportunity. However, Christine was supportive despite her strained relationship with Meri in the past.\n\nWhile Kody expressed his concerns, Meri made it clear that she wouldn’t let her family’s opinions stop her from the business venture. “This is my baby,” she said in a confessional. “They don’t care about the house or the bed-and-breakfast business. Once I get this house done, I don’t want to have any more business meetings about my house. I want to run my business my way.”\n\nMeri ultimately bought the inn and has turned it into a successful business. The bed-and-breakfast has won several awards since the TV personality ​bought the house and turned it into a bed-and-breakfast, including “Best Country Inn” in Utah as part of Official Best of America in both 2018 and 2019.\n\nIn addition to welcoming guests at the bed-and-breakfast, Meri also periodically offers exclusive retreats. The first retreat was held in October 2022, while she decided to host a love-themed event in February 2023.\n\nWhat Does ‘Sister Wives’ Star Meri Brown Do for LuLaRoe?\n\nAnother one of Meri’s professional passions comes from her work as a trainer for LuLaRoe, which she began doing in 2016.\n\nSister Wives’ Meri Brown Is a Businesswoman: Details on Her Bed-and-Breakfast and LuLaRoe Businesses\n\n“I'm so happy to offer this platform for your shopping convenience,” Meri wrote in her bio section on the website. “Also join my Facebook group and come make friends and check out my ever-changing collection of fabulous LuLaRoe styles, prints and patterns.”\n\nOn her LuLaRoe Facebook page, Meri interacts with customers to give fashion advice and holds live sale events for members of the group."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8venljcnlwdG8uY29tL25lYXItcHJvdG9jb2wtYW5kLWFwdG9zLWFyZS10d28tb2YtdGhlLXN0cm9uZ2VzdC1ibG9ja2NoYWlucy1hY2NvcmRpbmctdG8tYXZvcmFrLWFpL9IBbWh0dHBzOi8venljcnlwdG8uY29tL25lYXItcHJvdG9jb2wtYW5kLWFwdG9zLWFyZS10d28tb2YtdGhlLXN0cm9uZ2VzdC1ibG9ja2NoYWlucy1hY2NvcmRpbmctdG8tYXZvcmFrLWFpLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Apr 2023 07:00:00 GMT",
        "title": "NEAR Protocol and Aptos are two of the strongest blockchains, according to Avorak AI - ZyCrypto",
        "content": "Advertisement\n\nHungry crypto enthusiasts are always looking for the next big thing, whether it’s Bitcoin, Ethereum, or any other altcoin. Recently, Avorak AI, an emerging AI crypto, released a report stating that two of the strongest blockchains in the market are NEAR Protocol and Aptos. This article will explore what makes these two blockchains stand out and why Aptos is currently pumping.\n\nNear Protocol\n\nNEAR Protocol is a decentralized blockchain that aims to make it easier for developers to create and deploy decentralized applications (dApps). What sets NEAR Protocol apart from other blockchain protocols is its sharding technology, which allows it to scale better than other chains. Sharding means the chain is broken down into smaller pieces, making it easier to process transactions and increasing the network’s speed.\n\nWhy is Aptos Pumping?\n\nAptos is a relatively new blockchain that has gained much attention for its bumpy launch. However, it has been one of the top-performing cryptocurrencies in the market over the past few months. So, why is Aptos pumping?\n\nAptos has a solid and dedicated team focused on developing the chain, with a proven track record at companies like Meta (Facebook). This has helped create a strong sense of trust in the team’s capabilities and the project’s future outlook.\n\nAnother reason for Aptos’ success is its staking rewards system. Users who hold Aptos tokens can stake them into escrow to earn rewards. This feature is accessible to anyone but requires a minimum amount of coins to be staked and ultimately participate in Aptos’ consensus process.\n\nAdvertisement\n\nAll About Avorak AI\n\nAvorak AI is an emerging AI crypto that has been gaining much attention from the DeFi community after it raised over $1,500,000, passed two security audits during the ongoing ICO, and secured a centralized exchange (CEX) listing.\n\nAVRK, its native token, uses artificial intelligence and machine learning algorithms to analyze the market and provide users with a sophisticated and highly-profitable trading bot. Besides these fascinating features, the AI crypto boasts further chatbots and image-creation modules.\n\nMoreover, Avorak AI’s recent report highlighting NEAR Protocol and Aptos as two of the strongest blockchains in the market is a testament to the potential of these chains.\n\nFinal Thoughts\n\nCrypto adherents and traders looking for the next big thing should definitely keep an eye on these two blockchains. However, the technology behind Avorak AI is worth a look and might be the most profitable ICO of 2023.\n\nLearn more here:\n\nWebsite: https://avorak.ai\n\nBuy AVRK: https://invest.avorak.ai/register\n\nDisclaimer: This is a sponsored article, and views in it do not represent those of, nor should they be attributed to, ZyCrypto. Readers should conduct independent research before taking any actions related to the company, product, or crypto projects mentioned in this piece; nor can this article be regarded as investment advice."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3QvY29yZS1iYXNlZC1tZW1lLXByb2plY3QtaWdub3JlLWZ1ZC1zZXRzLXNpZ2h0LW9uLWJuYi1jaGFpbi1sYXVuY2jSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Apr 2023 08:39:33 GMT",
        "title": "Core-based Meme Project Ignore Fud Sets Sight on BNB Chain Launch - BSC NEWS",
        "content": "CORE\n\nThe expansion to BNB Chain will increase liquidity and open up new opportunities for token holders.\n\nIgnore Fud on BNB Chain\n\nCore DAO-based Hold-to-Earn meme project Ignore Fud is gearing up to expand to BNB Chain in May. A particular date has not been announced; however, the excitement is building up for the meme token community. The launch on BNB Chain will not result in new tokens or additional supply.\n\nAs of writing, Ignore Fud has achieved over 17,000 token holders barely one month since its public launch on the Core-based decentralized exchange ArcherSwap.\n\nIgnore Fud’s launch on BNB Chain is a significant step that is poised to contribute immensely to the growth of the project and its token. By expanding to BNB Chain, the meme project will be able to tap into a wider audience and access the numerous benefits that come with the thriving ecosystem. The move will increase liquidity, provide more trading pairs, and open up new opportunities for token holders.\n\nTo ensure the security of the project, Ignore Fud's smart contract has undergone an audit by the renowned industry security platform CertiK, underscoring its dedication to transparency and safety. Additionally, the meme project has taken significant strides towards establishing a sustainable meme economy by forming partnerships with reputable industry players. Through these alliances, Ignore Fud is positioning itself as a reliable participant in the Core DAO ecosystem, which in turn enhances its prospects for sustained success over time.\n\nWhat is Ignore Fud?\n\nIgnore Fud is a novel meme token on the Core chain that supports decentralized finance and blockchain innovations. Its objective is to facilitate the onboarding of more cryptocurrency users into Core DAO and the wider crypto industry. Ignore Fud boasts a community-centric meme ecosystem and a distinctive hold-to-earn feature, which enables investors to earn rewards by holding its native token “4Token”. Additionally, investors gain exposure to a vast and robust user community from across the globe.\n\nBesides Ignore Fud's Hold-to-Earn mechanism, the team intends to offer several utilities for 4Token, including staking nodes, NFT Marketplace and collection, compounding crypto asset vaults, DEX, and more.\n\nAs of writing, 4Token is currently trading at a price of $0.00009207. With the expansion to BNB Chain in view, Ignore Fud is well-positioned to reach even greater heights, attracting more users, increasing token adoption, and ultimately driving token growth.\n\nTo Learn more about Ignore Fud, visit the following links:\n\nWebsite | Twitter | Discord | Telegram | White Paper\n\nDisclaimer: This is a paid press release. BSC News does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page.\n\nThis article is part of a marketing package paid by Ignore Fud at the cost of 400,000,000 4Token. These have an estimated public launch value of $4,200, with a vested period of 10 Months."
    }
]