[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMikgFodHRwczovL3d3dy5vcmxhbmRvd2Vla2x5LmNvbS9vcmxhbmRvL2hpc3RvcmljLXNwYXJrbWFuLWhvdXNlLWJhbmRiLW5vdy1mb3Itc2FsZS1pbi1jZW50cmFsLWZsb3JpZGEtaXMtZHJlbmNoZWQtaW4tZ3JhbmRtYS1nbGFtL1NsaWRlc2hvdy8zMzkyMDY3OdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Historic 'Sparkman House' B&B, now for sale in Central Florida, is drenched in grandma glam - Orlando Weekly",
        "content": "A historic luxury bed and breakfast is now on the market in Central Florida — and it's completely decked out in grandma glam.The Sparkman House was originally built in 1905 on a sprawling estate in the heart of Plant City's Historic District. It's a peek into architectural history, with a six-bedroom main house and a separate carriage house — totaling seven bedrooms and six baths, all covered in antique fixtures and florals.Take a step into the past in the Queen Anne-style home, located at 707 N. Collins St., Plant City . The home boasts 12-foot-high ceilings and elegant formal spaces you'd only expect to see in an early 1900s period piece.Modern amenities meet Victorian charm throughout the house, with the wrap-around porch surrounded by towering oak trees and a lounge deck on the outside.The estate is listed for $1,249,900 and is being sold by Lisa Rhodes and Jeremiah Rhodes (Marzucco Real Estate)."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMikgFodHRwczovL3d3dy5vcmxhbmRvd2Vla2x5LmNvbS9vcmxhbmRvL2hpc3RvcmljLXNwYXJrbWFuLWhvdXNlLWJhbmRiLW5vdy1mb3Itc2FsZS1pbi1jZW50cmFsLWZsb3JpZGEtaXMtZHJlbmNoZWQtaW4tZ3JhbmRtYS1nbGFtL1NsaWRlc2hvdy8zMzkyMDY3OdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Historic 'Sparkman House' B&B, now for sale in Central Florida, is drenched in grandma glam - Orlando Weekly",
        "content": "A historic luxury bed and breakfast is now on the market in Central Florida — and it's completely decked out in grandma glam.The Sparkman House was originally built in 1905 on a sprawling estate in the heart of Plant City's Historic District. It's a peek into architectural history, with a six-bedroom main house and a separate carriage house — totaling seven bedrooms and six baths, all covered in antique fixtures and florals.Take a step into the past in the Queen Anne-style home, located at 707 N. Collins St., Plant City . The home boasts 12-foot-high ceilings and elegant formal spaces you'd only expect to see in an early 1900s period piece.Modern amenities meet Victorian charm throughout the house, with the wrap-around porch surrounded by towering oak trees and a lounge deck on the outside.The estate is listed for $1,249,900 and is being sold by Lisa Rhodes and Jeremiah Rhodes (Marzucco Real Estate)."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vY29pbmNoYXB0ZXIuY29tL2JuYi1jaGFpbi1hbm5vdW5jZXMtaGFyZC1mb3JrLWR1ZS10by1zZWN1cml0eS1yZWFzb25zL9IBUmh0dHBzOi8vY29pbmNoYXB0ZXIuY29tL2JuYi1jaGFpbi1hbm5vdW5jZXMtaGFyZC1mb3JrLWR1ZS10by1zZWN1cml0eS1yZWFzb25zL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "BNB Chain Announces Hard Fork Due To Security Reasons - CoinChapter",
        "content": "BNB Chain Announces Hard Fork Due To Security Reasons\n\nKey Takeaways:\n\nBNB Chain announced a hard fork upgrade after multiple security issues in 2023 Meanwhile, BNB price formed a bullish technical pattern\n\nNEW DELHI (CoinChapter.com) — BNB Smart Chain announced a scheduled hard fork upgrade called Planck. The upgrade would occur at block height 27,281,024, which the blockchain would reach around April 12.\n\nBNB smart chain stated the upgrade focuses on improving the stability and security of the blockchain network. The Planck upgrade would require full-node operators to switch their software to v1.1.21 before April 12.\n\nThe Planck upgrade would enhance the security of the cross-chain bridge between the Ethereum beacon chain and the BNB Smart Chain. BNB Smart Chain would migrate from the vulnerable IAVL proof verification to the more secure mechanism called the ICS23 specification.\n\nBNB smart chain set the Planck upgrade for a tentative date of April 12\n\nThe BNB smart chain hard fork would also introduce a timer lock mechanism for large funds cross-chain transfer. Moreover, the Planck upgrade would add functionality to pause cross-chain channels by forged proof detection automatically.\n\nThe BNB smart chain was the target of the most attacks in Q1 2023, according to a report by Immunefi. Combined with Ethereum, the blockchain network was victim to over two-thirds of all the attacks in Q1 2023.\n\nBNB Chain still has a serious issue with developers using forked code. Its community lacks a security-first approach and attracts many users looking for a quick way to earn money Adrian Hetman, tech lead at Immunefi, stated in the report\n\nBNB Price Moving Inside Bullish Pattern\n\nMeanwhile, the BNB price has formed a bullish technical pattern called the ascending triangle. A horizontal line connecting swing highs and a rising trendline connecting swing lows form the pattern.\n\nIn an ideal world, buyers would enter the market as the trendlines close the gap, pushing prices above horizontal resistance with heavy volumes. But, unfortunately, the horizontal trendline rebuffed BNB’s rally, forcing the token to pull back.\n\nBNB’s price formed a bullish technical pattern with a 107% price target. Source: Tradingview.com\n\nThe price target for a breakout is equal to the triangle’s height at its thickest point. Hence, BNB’s price target is $646, a jump of nearly 107% from the current price levels."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmNyeXB0b25ld3N6LmNvbS9zb2xhbmEtc2V0LXRvLWRlcGxveS1zdGF0ZS1jb21wcmVzc2lvbi10by1sb3dlci10aGUtbmZ0LW1pbnRpbmctY29zdC_SAWVodHRwczovL3d3dy5jcnlwdG9uZXdzei5jb20vc29sYW5hLXNldC10by1kZXBsb3ktc3RhdGUtY29tcHJlc3Npb24tdG8tbG93ZXItdGhlLW5mdC1taW50aW5nLWNvc3QvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Solana set to deploy State Compression to lower the NFT minting cost - CryptoNewsZ",
        "content": "Solana has currently dominated the market in terms of the most cost-effective minting pricing for non-fungible tokens. Compare it to Ethereum, and the difference reflects that while the cost is still on the lower side, State Compression further brings it down. To explain briefly, state compression is a way to store data on-chain and cut the cost by a huge margin.\n\nMinting 1 million NFTs on Solana costs approximately $253,680. With state compression in practice, the same cost is estimated to come down to $113.10. These numbers are based on the value of SOL as of April 5, 2023, when the token was valued at $21.41 each.\n\nPolygon looks rather good for minting a thousand NFTs since the cost for the same comes to around $33. However, a higher number of NFTs brings its own problems, and Polygon begins to fall short in the number of advantages it can offer. Minting a million NFTs comes to $32,832.16.\n\nState Compression is already live on some projects in Solana. Teams from Dialect and Crossmint have started sharing the benefits, while Helium, DRiP, and Wordcel are in the process of experiencing how it works.\n\nDialect is leveraging the capabilities of State Compression to cover the minting cost of NFT stickers. The benefit is ultimately being passed on to over a thousand users in the ecosystem. Dialect is a messaging service that is based on the technology of blockchain.\n\nCrossmint uniquely expresses the use case of State Compression by creating integrations that boost customer loyalty toward the companies. Crossmint is an NFT and API tooling company.\n\nOverall, the use of State Compression is primarily done to bring scalability and an enhanced user experience to Solana.\n\nThe utility of State Compression is currently limited to NFTs; however, it can later expand to store data of any sort. It has been built by the developers of Metaplex and Solana Labs and is widely supported by Triton, Helius, Phantom, SimpleHash, the Solana Foundation, and Solflare.\n\nUsers leveraging State Compression avail themselves of the benefits through Merkle trees, a data structure that allows the storage of a small bit of data on-chain while updating the same directly to the Solana Ledger. Merkle Trees assists State Compression to cut down on costs without compromising security and decentralization of the base layer of Solana.\n\nThe community has welcomed the move with a positive response to State Compression. Assure DeFi, pioneers of KYC and NFTs in decentralized finance, has called this great news, adding that they are loving this development.\n\nSolana is a blockchain that has been built to accelerate mass adoption. It is mainly characterized by the speed with which it executes transactions, composability, and staking a green stand with its operations."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmluZGVwZW5kZW50LmllL3JlZ2lvbmFscy9jb3JrL25ld3MvY29yay1sYXctc3R1ZGVudHMtdGFja2xlLWFpcmJuYi1wbGFubmluZy1vZmZlbmRlcnMvNDI0MjM0NTguaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Cork law students tackle Airbnb planning offenders - Irish Independent",
        "content": "Two final year law students at UCC have launched a campaign to compel Air BnB property owners to register their properties or put them back on the market for rent or sale.\n\nA pair of UCC law students who have launched a campaign of complaints against Air B&B properties which haven’t registered as short term lets with Cork City Council have vowed to tackle properties in the Cork County Council area next.\n\nBrian O’Kane, who hails from Blarney, and Peadar Ó Rathaille, a native of Ennis, both final year BCL students, have found 371 properties which haven’t been registered in the Cork City Council area and have already filed complaints against 80 of these properties. When they have completed the task of tackling Air B&B properties in the Cork City Council area, they are going to take on the huge challenge of registering complaints against an estimated 1,700 short term let properties in the area under the auspices of Cork County Council.\n\nSpeaking to The Corkman this week, Peadar said that the aim of the campaign was to tackle what he termed the ‘low hanging fruit’ of Air B&B properties which were openly advertised and flouting the planning regulations which require them to be registered with the relevant local authority.\n\n\"We’ve heard often that every lever is being pulled to address the housing crisis but it’s frustrating that no real efforts have been made to address illegal Air B&Bs,” he said.\n\n“To my mind this is probably the easiest lever to pull that hasn't yet been pulled to return potentially 25,000 houses to the market.\n\n\"I saw that the law was there but it just wasn't being enforced, which is a general theme in law in Ireland.\n\n\"It communicates that the 'law is here but we're never going to enforce that.”\n\nPeadar and Brian feel if their campaign succeeds, which they have every confidence it will, this will put Air B&B property owners in the position that they will have to register and seek a retention, at a cost of €10,000 or more, and pay a fine of €5,000 or put their property on the market for sale or rent.\n\nPutting even half of Air B&B properties back on the market, approximately 25,000 across the state, would result in a reduction of rents and sales prices.\n\n\"If we even succeeded in returning half of the 25,000 Air B&Bs to the market for renting or housing, there would be greater competition so the cost or rent or house prices would plummet,” said Peadar.\n\nPeadar, as a final year student, knows that he and thousands of other students attending UCC and other third level institutions have to pay extra for their rental accommodation at college – if they’re lucky enough to get it – because of the shortage of student lets. “You need to know someone who’s leaving a property and get a heads up to approach the landlord before the property is advertised to be in with a chance of getting the property.”\n\nHe has already made plans to emigrate later this year as he points out that doing a post graduate degree in France costs €200 to register and living expenses, inclusive of rent, amount to €300 per month whereas in Ireland it’s up to €15,000 per year according some estimates.\n\nWhile 80 complaints have been registered, the planning authority has just six weeks to respond and if they refuse to uphold a complaint, they have to give reasons. Peadar and Brian feel a rejection of a complaint is unlikely as they have a Supreme Court decision backing them up.\n\nTo find the properties, they’re using a combination of the Air B&B’s own website, the Eircodes and Inside AirBnB, a publicly funded website set up by Trinity College and other universities around the world mapping the growth of AirBnB and mapping each property, putting as much information as possible on each property into the public domain and the purpose of this was to assist local authorities to enforce planning permission regulations.\n\nThat it has come down to two final year law students to launch a campaign to ensure that planning regulations regarding Air BnBs are adhered to is, to say the least, a bit bizarre. Peadar points to the under-resourcing of local government by the central government as a factor in this.\n\n“The Local Government Management Agency requested €40m in their submission before last year’s budget to tackle the enforcment of planning regulations but they only received €5m, which has to be shared between all of the State’s local authorties.\""
    }
]