[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3QvZXhwbG9yaW5nLW5ldy1mcm9udGllcnMtd2l0aC1idWxsaW9uLWxhYnMtZ2FtZS1kYW_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Exploring New Frontiers with Bullion Labs' Game DAO - BSC NEWS",
        "content": "BNB\n\nThe Game DAO by Bullion Labs provides an innovative DeFi rewards platform that seamlessly integrates a DAO, staking portal, and a game of chance.\n\nWeb3 start-up Bullion Labs is making waves in the decentralized gaming and finance sectors with their innovative creation, The Game DAO. The platform combines an exciting game, a decentralized autonomous organization (DAO), and a staking portal to offer a one-of-a-kind user experience.\n\nThe Game: Chance and Transparency\n\nThe Game, a central component of the platform, is a game of chance that requires a $3.30 entry fee in BNB. The game pot grows with each participant, and every seven days, the Chainlink protocol assesses whether it holds a minimum of 0.3 BNB. If so, Chainlink VRFv2 technology determines a jackpot winner along with 20 runners-up, guaranteeing a fair and transparent result. Participants are rewarded as follows:\n\n• Jackpot Winner: 50% of Game Pot\n\n• Runners Up: 20% of Game Pot\n\n• DAO Treasury: 20% of Game Pot\n\n• DAO Members: 10% of Game Pot\n\nGame Structure:\n\n‍\n\nThe DAO: Empowering Users with Ownership\n\nThe Game DAO takes user involvement to the next level by offering an opportunity to own a share of the game. DAO members not only manage the game and its operations, but also decide which charities or web3 startups receive funding from the game pot, and are rewarded for their efforts. To become a DAO member, users must hold a membership ERC1155 token, which can be minted here. Each membership pass is priced at 1BNB to prevent spam and encourage members to be responsible and committed to the project's long-term vision. Membership sales revenue goes directly to the DAO treasury.\n\nDAO Structure:\n\n‍\n\nWhile game pot funds are exclusively designated for web3 grants and charities, the DAO can allocate membership sales revenue for other purposes. Members can propose ideas such as investing in or acquiring blockchain technology companies, depositing into yield-generating sources, and other initiatives that contribute to the DAO ecosystem's growth.\n\nVoting and proposal submission are simple, but members must hold at least 10,000 $BNGX tokens to vote or create proposals. This requirement reduces spam and ensures thorough discussion of proposals in designated discord channels before community voting. DAO members may adjust this threshold when the DAO is capable of passing votes with a 40% yes vote quorum. Members may also increase or decrease this quorum requirement when the DAO reaches capacity. Details about the $BNGX token and membership pass distribution can be found on the website: https://www.thegamedao.com/\n\nThe Staking Portal: Incentivizing Commitment\n\nThe Staking portal allows DAO members to earn rewards. The staking contract instantly distributes deposits to all staked users based on their membership passes. Users must stake all membership passes in their wallet for the protocol to accurately calculate reward shares. A minimum staking period of 21 days is enforced to limit the supply of membership passes on the open market and maintain value for holders.\n\nTransparency Notes:\n\nEntry fees — There is a 10% platform fee ≈ $0.30 on each entry.\n\nMembership Passes — There is a 10% platform fee ≈ $30 on each membership pass purchase.\n\nAntiRUG — LP tokens for $BNGX governance token has been burnt at TX: 0xfa5c07c4e0af38bacb60b3139ca2c7ed6b6185cccb327ddd296650c4be3a0e8e\n\nAntiRUG — Funds raised from ERC1155 membership pass sale is directly deposited to DAO treasury.\n\nHot Tip:\n\nBullion labs is currently airdropping 5,000 $BNGX tokens and 1 Membership pass to the first 1k players. Check out the game and become a DAO member!\n\nFollow Bullion Labs:\n\nWebsite | Twitter | Instagram | Discord"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDUvMTIvbWV0YW1hc2stYnV5LWNyeXB0by13aXRoLXBheXBhbC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "MetaMask: Buy crypto now with PayPal - The Cryptonomist",
        "content": "MetaMask, one of the most widely used Web3 crypto wallets, has introduced the ability to buy ETH directly through PayPal, but only for users in the United States.\n\nHere are all the details.\n\n#DYK\n\n\n\nMetaMask🦊 is the first web3 wallet to enable users to buy ETH using PayPal!\n\n\n\nGet started here👇https://t.co/RGcamJQoQ2 — MetaMask 🦊🫰 (@MetaMask) May 11, 2023\n\nMetaMask integrates PayPal for direct crypto purchases\n\nIn the news, MetaMask itself claimed to be the first Web3 wallet to offer ether transactions via PayPal.\n\nBut what changes in practice? Everything, actually.\n\nThanks to this collaboration, US users can now choose PayPal as a payment method to buy ETH on MetaMask. The integration also makes it possible to transfer ETH from PayPal to MetaMask.\n\nIn addition, the financial technology company collaborated with MetaMask’s parent company ConsenSys last December, claiming that the partnership would allow users to seamlessly buy cryptocurrencies and easily explore the Web3 ecosystem.\n\nWe see PayPal joining a large ecosystem of payment providers already integrated with MetaMask, including Coinbase Pay, MoonPay, Sardine, Transak, Wyre and others.\n\nIn a quarterly filing with the US Securities and Exchange Commission, the company revealed that it held a total of $943 million in crypto as of 31 March 2023. This is a 56% jump from the previous quarter, when the company reported $604 million in crypto.\n\nMetaMask and the new feature to buy crypto with fiat currency\n\nWe see that the new PayPal integration came just weeks after MetaMask announced a new feature that allows users to buy crypto with fiat currency directly from its DApp portfolio.\n\nKnown as “Buy Crypto”, the new feature allows users to purchase a range of cryptocurrencies using a variety of payment methods, including debit or credit cards and bank transfers, according to the company:\n\nWe foxes at MetaMask 🦊 are excited to announce that our Buy Crypto feature now also resides in our Portfolio Dapp, providing a simple and smooth purchasing journey👌\n\n\n\n🔗https://t.co/sEcCnQhbRB pic.twitter.com/UvaG2wMSpy — MetaMask 🦊🫰 (@MetaMask) April 10, 2023\n\nIn addition, the service will be available to users in over 189 countries and will offer over 90 tokens on eight different networks, including Ethereum, Polygon, Arbitrum, BNB Smart Chain, Avalanche Contract Chain, Fantom, Optimis and Celo.\n\nTo access the feature, MetaMask users can link their wallet to the dApp wallet or simply select the ‘Buy’ button in the MetaMask extension wallet.\n\nThey can then select their region, payment method, token and the network they wish to purchase on.\n\nBut that’s not all: the function also takes into account a number of factors, such as the user’s location and local regulations, in order to provide a customised offer for each purchase. Once the user has selected a quote, they are redirected to a third party website to complete the transaction.\n\nThe funds are then deposited directly into the user’s MetaMask wallet. In general, we know that MetaMask has always looked to integrations and partnerships to extend its reach and provide on-ramps for its customers.\n\nMetaMask and crypto expansion in Nigeria via MoonPay\n\nAnother recent development for MetaMask is the expansion of direct access to cryptocurrencies in Nigeria.\n\nIn this case, thanks to a partnership with crypto fintech company MoonPay, the wallet now allows users in the African country to purchase cryptocurrencies via instant bank transfers.\n\nAccording to the Chainalysis 2022 Global Crypto Adoption Index, Nigeria is one of the top twenty countries in terms of cryptocurrency adoption.\n\nAs we know, prior to the partnership, MetaMask users in Nigeria had access to wallets, but the process of buying cryptocurrencies was expensive and time consuming.\n\nAs Lorenzo Santos, MetaMask’s Product Manager, explained:\n\n“While Moonpay had a card integration feature, around 90% of attempts to buy cryptocurrencies with a credit or debit card were declined”.\n\nInstead, with the new integration supporting local bank transfers, buying cryptocurrency on MetaMask is now faster and cheaper, allowing users to access crypto without sending resources from a centralised exchange.\n\nZeeshan Feroz, Chief Product and Strategy Officer at MoonPay, said that the integration is estimated to reduce the decline rate of direct crypto purchases in Nigeria from 90% to 30%.\n\nIn addition, he noted that customers from all banks in Nigeria will be able to access the service via wire transfer, a popular payment method in Nigerian e-commerce businesses.\n\nDespite the current problems with crypto in Nigeria, the country has emerged as an important market for MetaMask, ranking third in terms of monthly active mobile users. Santos explained:"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LnN0cmF0Zm9yZHRvZGF5LmNhL2xvY2FsLW5ld3MvYXMtc2FiYmEtd2luZHMtZG93bi1vcGVyYXRpb25zLXN0cmF0Zm9yZC1pbm5rZWVwZXJzLWdldHMtcm9sbGluZy02OTkwODY10gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "As SABBA winds down operations, Stratford Innkeepers gets rolling - StratfordToday",
        "content": "The local bed and breakfast association is closing but Stratford Innkeepers, a collective of accommodators, is starting up\n\nStratford and Area Bed and Breakfast Association (SABBA) is closing down, though a new group has formed to take its place.\n\nSABBA was a longtime association of B&Bs in the area. For thirty years, they have been devoted to maintaining the high standards of the B&B industry in the Festival City. Victoria Sanderson of the Mornington Rose Bed and Breakfast and R. L. Read of Avonview Manor said that it was a lack of engagement in terms of leadership that prompted them to shut the organization down.\n\n“We were basically running it for the last three years by ourselves,” Sanderson said. “Which is very overwhelming.”\n\nIt was understandable, they said, since the pandemic had everyone worried about their own businesses.\n\nDuring the pandemic, the industry was rattled by numerous obstacles. First the stay-at-home-order rendered their businesses null. Then, according to Sanderson and Read, decisions made by Stratford City Council only exacerbated the unpredictability of their industry and prompted some to close their doors entirely.\n\nThe Municipal Accommodations Tax (MAT), a “tourist tax” that would apply only on accommodations, and the insurance liability premium increase from $2 million to $5 million were issues that would complicate their business further, after a devastating few years in the pandemic, they said.\n\nCouncil, on its part, pointed to other municipalities, which have similar accommodation taxes that go to funding the infrastructure that residents and tourists alike use. They argued such a tax was reasonable, with money accrued going to vital projects that benefit the city and its residents.\n\nThe insurance increase was introduced as recommended by the City’s insurer, saying that “$5 million was the new $2 million.”\n\nThe insurance decision was ultimately rescinded, with only businesses using City-property or services being required to increase their liability. The MAT tax is approved and set to take effect on July 1.\n\nDespite the backpedalling of the insurance decision, Sanderson and Read said that the damage was already done as many already went through the trouble of finding a new plan. They called those council initiatives “insensitive” after the last few years.\n\nTo put into perspective how the industry has changed, Sanderson said that when she got started in 2009 there were 72 SABBA members. In 2022, their last year, there were only 17.\n\n“It’s been a lot of fun,” Sanderson reminisced. “It’s been a situation where you always have somebody that you could call if you had a problem. You have overflow in your bed and breakfast? You knew who had availability. If you needed to split a box of frozen croissants, you would share … It was a very cooperative association … I miss that.”\n\nOn behalf of SABBA, Sanderson and Read presented a check this week for $4,500 to Cheryl Hunt, community giving manager, Stratford General Hospital Foundation (SGHF).\n\nThat money will go towards the foundation's $30 million “In Our Hands Campaign.”, specifically to a chemotherapy and pharmacy renovation, new MRI, and new beds throughout the hospital, among other things at Stratford General Hospital.\n\nPrices for medical equipment are skyrocketing and hospitals rely upon fundraising efforts to acquire vital, life-saving equipment. As Hunt said, their foundation relies on the community.\n\n“We rely on people like you,” Hunt told Sanderson and Read, thanking them for the donation.\n\nAside from the foundation, Stratford-Perth Archives received $1,000 and Stratford Perth Humane Society received around $350 from SABBA.\n\nThe money comes from the last of SABBA’s coffers, the last step of the organization’s final days.\n\nA sad end, but hope on the horizon…\n\nIn the wake of SABBA’s demise, a new group has started up.\n\nThe Stratford Innkeepers is a collective of accommodators — rather than just B&Bs. Like SABBA, they represent a community and have some of the same members of SABBA, though Sanderson and Read say that there are a few differences.\n\nWhereas SABBA had a formal leadership structure, the Stratford Innkeepers are a collective. They meet and vote on things, though no one is leading the group as of yet.\n\nUnlike SABBA, they are currently devoted to advocating on behalf of the industry, which could change.\n\nIn the past, SABBA set up tours of local B&Bs so that the industry were aware of their peers, could share ideas, and perhaps recommend places to potential customers.\n\nRecently, Sanderson and a former B&B owner, Joan Ayton, set up a tour with the Stratford Innkeepers. It did not have the same showing as the SABBA tours, though Read and Sanderson were hopeful that in the future accommodators will open their doors for members.\n\nThat community spirit – that SABBA-like spirit – is vital, they said."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LnNlY3VyaXRpZXMuaW8vY3J5cHRvLXJvbGxlcmNvYXN0ZXItYmluYW5jZXMtYnVsbGlzaC1ib3VuY2UtYW5kLXNvbGFuYXMtc3RlZXAtc2xpZGUtaW4tYmVhcmlzaC1ibGl0ei_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Crypto Rollercoaster: Binance's Bullish Bounce and Solana's Steep Slide in Bearish Blitz - Securities.io",
        "content": "The crypto market continues to lose ground, with Bitcoin falling under $26,200 and Ethereum below $1,750 this week.\n\nThe low liquidity in the market seems to be driving the prices lower. Market depth or liquidity has been worsening even on major exchanges like Binance while two of the biggest institutional liquidity providers, Jane Street and Jump Crypto, dialed back their crypto-trading businesses in the US. This move from the market makers came amidst the country's regulators' continuing their crackdown on the industry. As such, with order books thinner, it now takes less capital to move an asset's price.\n\nAn absence of liquidity, which has been failing to recover since the collapse of FTX, combined with the highly-leveraged nature of the crypto market, can cause a significant increase in volatility. Additionally, if the US equities market takes a dump, then the collapsing market can see an acceleration on the downside.\n\nThese latest losses have the total cryptocurrency market cap down by 3.% in the past 24 hours at $1.14 trillion, according to CoinGecko.\n\nWhile the combined market capitalization of all the coins in the crypto industry is up from the $820 billion low hit in Nov. 2022 as a result of the FTX collapse, it is still far off from the all-time high (ATH) a year prior to that when it surpassed $3 trillion.\n\nThis is because the majority of altcoins are down 80% to 90% from their peaks. And when it comes to majors, Bitcoin and Ether are down about 62% and 64% from their respective ATHs.\n\nBut among the top 20 crypto assets, there is one coin that has managed to do better than even BTC and ETH in sustaining its gains, while others have been hit far more brutally. So, let's take a look at them!\n\nBinance Coin (BNB)\n\nWhen it comes to the asset with the least percentage of downside from its ATH, BNB is the clear winner. The 4th largest cryptocurrency with a market cap of $47.7 billion has only lost about 56% of its value since its ATH of $686 hit on May 10, 2021.\n\nBNB is currently up 24.5% in 2023 so far and 32.3% in the past year while being down 7% in the past week. As of writing, BNB has been exchanging hands at $304.\n\nLately, BNB has been seeing some fresh accumulation among large institutional investors. While a group of whales with balances of 100,000 to one million BNB stopped selling, they added 90,000 BNB coins into their wallet balances.\n\nBNB is the native token of the largest cryptocurrency exchange Binance, which was founded by Changpeng Zhao, also known as “CZ,” in 2017. BNB holders get access to discounted fees on the platform. As such, demand for the token is linked to the exchange's usage and activity. This is why buying BNB can be seen as a bet on the exchange's success.\n\nIn April, the spot trading volume of Binance plummeted by 48%, marking the second consecutive month of declines and recording its second-lowest monthly trading volume since 2021, as per CCData's latest Exchange Review report.\n\nIn addition, Binance's market share kept on sliding, falling for the second consecutive month to 46.3%, its lowest since October 2022, prior to FTX's collapse. Despite this, Binance is still dominating the industry with a huge lead over its competitors.\n\nBNB was actually created to raise capital through an ICO in 2017, during which Binance sold 100 million BNB at a price of 2,700 BNB for 1 ETH. As per its original whitepaper, Binance proposed spending 20% of its profits every quarter buying and burning BNB, essentially removing coins from circulation, until the volume was brought down to 100 million. As of May 2023, the volume in circulation is around 157 million BNB, according to CoinGecko.\n\nOriginally, BNB was launched on the Ethereum blockchain but later migrated to its own blockchain called BNB Chain, which was launched in April 2019. The old tokens were destroyed and created on the new chain in equivalent numbers during this migration.\n\nBNB Chain is a layer 1 network that allows other applications to be built on top of it. It offers a faster and cheaper alternative to Ethereum, but it is more centralized. BNB token is also used to pay transaction fees on the blockchain. Besides its primary centralized exchange, Binance also has a decentralized exchange (DEX) on the BNB Chain.\n\nBNB Chain uses a proof-of-stake authority (PoSA) consensus mechanism under which it has a small number of the largest stakers as validators.\n\nBNB's gains in 2021 were the result of the growing popularity and a thriving ecosystem of decentralized applications (dApps), including DeFi and NFT on BSC.\n\nAt the time, the total value locked (TVL) in BSC went to almost $22 billion, as per DeFi Llama. This activity has since slowed down tremendously, with TVL currently standing at $4.51 billion — the third largest after Ethereum ($26.54 bln) and Tron ($5.31 bln).\n\nAccording to recent on-chain indicators, the BNB Chain has also been gaining market share. Over the past week, the number of Daily Active Users (DAU) on the network increased by 27%, from 4,068 to 5,148. DAU metric measures the number of unique wallet addresses interacting on a blockchain.\n\nBesides being a utility token, BNB also acts as a governance token for the BNB chain, allowing holders to participate in some of the project's decision-making. It is further in demand for staking on the BNB Chain.\n\nClick here to learn all about investing in Binance Coin (BNB).\n\nSolana (SOL)\n\nOnce a coveted cryptocurrency and one of the top-performing assets of the 2021 crypto bull run, SOL has suffered the most among the top 20 crypto assets, even worse than meme coins. The 10th largest cryptocurrency, with a market cap of $7.96 billion, is currently trading at $20.18, having lost just over 92% of its value since its ATH of almost $260 on Nov. 6, 2021.\n\nHowever, SOL is performing well in 2023 with gains of 102% YTD, the highest among the top 30 coins. Meanwhile, the cryptocurrency is down 7.7% in the past week and 54.3% in the past year.\n\nSOL is the native token of the Solana blockchain, which was founded by software engineer Anatoly Yakovenko in 2017. Those who invested in the project include Multicoin Capital, BlockTower Capital, Distributed Global, NEO Global Capital, Foundation Capital, Blockchange Ventures, Slow Ventures, Rockaway Ventures, and Passport Capital.\n\nLaunched in March 2020, Solana is a layer 1 platform that has fast transaction times and inexpensive fees. The token is used to pay transaction fees as well as to run smart contracts on the network.\n\nIt is an inflationary cryptocurrency with no hard cap on the total number of tokens. As of May 2023, about 395 million SOL tokens are in circulation. SOL has a starting annual inflation rate of 8%, which decreases by 15% every year until it reaches 1.5%, which will be the fixed long-term rate.\n\nSolana is secured through the popular proof-of-stake (PoS) consensus mechanism, where validators are tasked with ensuring transactions are valid. To become a validator and help secure the network, people can stake “some of their SOL. And in exchange for locking their tokens up, holders earn rewards. Validators are chosen based on how many SOL tokens they own.\n\nIn addition to PoS, Solana also uses proof-of-history, which is its core advancement and aims to speed up the process of ordering transactions in a blockchain. This mechanism is used to prove that an event has happened at a particular time.\n\nA competitor to Ethereum, Solana also offers a way to build dApps and currently has $263 million in TVL. This value has fallen considerably since it peaked at just above $10 bln in late 2021 but jumped 23.5% Quarter over Quarter (QoQ) this year.\n\nThe blockchain, which is known for offering users fast, secure, and scalable infrastructure for DeFi and NFT, experienced substantial growth in Q1 of 2023. When it comes to the NFT sector of the ecosystem, daily new NFTs on Solana surged from 2.6 Million to 2.9 Million QoQ, and NFT sales volume in the secondary market denominated in USD increased by almost 36%. Moreover, the network saw 96,000 unique active programs in 1Q23 compared to 58,000 in 1Q22.\n\nMeanwhile, the overall earnings of Solana declined by 17.9% in the last 30 days, according to the token terminal. The number of code commits, however, continued to increase on GitHub. This growth comes after turbulent times during which the blockchain saw a large number of downtimes and various prominent NFTs migrating to other protocols.\n\nWhile Solana has seen the most amount of losses during the last two years of the bear market, some coins like Dogecoin (DOGE), Polkadot (DOT), and Shiba Inu (SHIB) are not far behind with losses of 90.4%, 90.3%, and 90% respectively.\n\nClick here to learn all about investing in Solana (SOL)."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LnNlY3VyaXRpZXMuaW8vY3J5cHRvLXJvbGxlcmNvYXN0ZXItYmluYW5jZXMtYnVsbGlzaC1ib3VuY2UtYW5kLXNvbGFuYXMtc3RlZXAtc2xpZGUtaW4tYmVhcmlzaC1ibGl0ei_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Crypto Rollercoaster: Binance's Bullish Bounce and Solana's Steep Slide in Bearish Blitz - Securities.io",
        "content": "The crypto market continues to lose ground, with Bitcoin falling under $26,200 and Ethereum below $1,750 this week.\n\nThe low liquidity in the market seems to be driving the prices lower. Market depth or liquidity has been worsening even on major exchanges like Binance while two of the biggest institutional liquidity providers, Jane Street and Jump Crypto, dialed back their crypto-trading businesses in the US. This move from the market makers came amidst the country's regulators' continuing their crackdown on the industry. As such, with order books thinner, it now takes less capital to move an asset's price.\n\nAn absence of liquidity, which has been failing to recover since the collapse of FTX, combined with the highly-leveraged nature of the crypto market, can cause a significant increase in volatility. Additionally, if the US equities market takes a dump, then the collapsing market can see an acceleration on the downside.\n\nThese latest losses have the total cryptocurrency market cap down by 3.% in the past 24 hours at $1.14 trillion, according to CoinGecko.\n\nWhile the combined market capitalization of all the coins in the crypto industry is up from the $820 billion low hit in Nov. 2022 as a result of the FTX collapse, it is still far off from the all-time high (ATH) a year prior to that when it surpassed $3 trillion.\n\nThis is because the majority of altcoins are down 80% to 90% from their peaks. And when it comes to majors, Bitcoin and Ether are down about 62% and 64% from their respective ATHs.\n\nBut among the top 20 crypto assets, there is one coin that has managed to do better than even BTC and ETH in sustaining its gains, while others have been hit far more brutally. So, let's take a look at them!\n\nBinance Coin (BNB)\n\nWhen it comes to the asset with the least percentage of downside from its ATH, BNB is the clear winner. The 4th largest cryptocurrency with a market cap of $47.7 billion has only lost about 56% of its value since its ATH of $686 hit on May 10, 2021.\n\nBNB is currently up 24.5% in 2023 so far and 32.3% in the past year while being down 7% in the past week. As of writing, BNB has been exchanging hands at $304.\n\nLately, BNB has been seeing some fresh accumulation among large institutional investors. While a group of whales with balances of 100,000 to one million BNB stopped selling, they added 90,000 BNB coins into their wallet balances.\n\nBNB is the native token of the largest cryptocurrency exchange Binance, which was founded by Changpeng Zhao, also known as “CZ,” in 2017. BNB holders get access to discounted fees on the platform. As such, demand for the token is linked to the exchange's usage and activity. This is why buying BNB can be seen as a bet on the exchange's success.\n\nIn April, the spot trading volume of Binance plummeted by 48%, marking the second consecutive month of declines and recording its second-lowest monthly trading volume since 2021, as per CCData's latest Exchange Review report.\n\nIn addition, Binance's market share kept on sliding, falling for the second consecutive month to 46.3%, its lowest since October 2022, prior to FTX's collapse. Despite this, Binance is still dominating the industry with a huge lead over its competitors.\n\nBNB was actually created to raise capital through an ICO in 2017, during which Binance sold 100 million BNB at a price of 2,700 BNB for 1 ETH. As per its original whitepaper, Binance proposed spending 20% of its profits every quarter buying and burning BNB, essentially removing coins from circulation, until the volume was brought down to 100 million. As of May 2023, the volume in circulation is around 157 million BNB, according to CoinGecko.\n\nOriginally, BNB was launched on the Ethereum blockchain but later migrated to its own blockchain called BNB Chain, which was launched in April 2019. The old tokens were destroyed and created on the new chain in equivalent numbers during this migration.\n\nBNB Chain is a layer 1 network that allows other applications to be built on top of it. It offers a faster and cheaper alternative to Ethereum, but it is more centralized. BNB token is also used to pay transaction fees on the blockchain. Besides its primary centralized exchange, Binance also has a decentralized exchange (DEX) on the BNB Chain.\n\nBNB Chain uses a proof-of-stake authority (PoSA) consensus mechanism under which it has a small number of the largest stakers as validators.\n\nBNB's gains in 2021 were the result of the growing popularity and a thriving ecosystem of decentralized applications (dApps), including DeFi and NFT on BSC.\n\nAt the time, the total value locked (TVL) in BSC went to almost $22 billion, as per DeFi Llama. This activity has since slowed down tremendously, with TVL currently standing at $4.51 billion — the third largest after Ethereum ($26.54 bln) and Tron ($5.31 bln).\n\nAccording to recent on-chain indicators, the BNB Chain has also been gaining market share. Over the past week, the number of Daily Active Users (DAU) on the network increased by 27%, from 4,068 to 5,148. DAU metric measures the number of unique wallet addresses interacting on a blockchain.\n\nBesides being a utility token, BNB also acts as a governance token for the BNB chain, allowing holders to participate in some of the project's decision-making. It is further in demand for staking on the BNB Chain.\n\nClick here to learn all about investing in Binance Coin (BNB).\n\nSolana (SOL)\n\nOnce a coveted cryptocurrency and one of the top-performing assets of the 2021 crypto bull run, SOL has suffered the most among the top 20 crypto assets, even worse than meme coins. The 10th largest cryptocurrency, with a market cap of $7.96 billion, is currently trading at $20.18, having lost just over 92% of its value since its ATH of almost $260 on Nov. 6, 2021.\n\nHowever, SOL is performing well in 2023 with gains of 102% YTD, the highest among the top 30 coins. Meanwhile, the cryptocurrency is down 7.7% in the past week and 54.3% in the past year.\n\nSOL is the native token of the Solana blockchain, which was founded by software engineer Anatoly Yakovenko in 2017. Those who invested in the project include Multicoin Capital, BlockTower Capital, Distributed Global, NEO Global Capital, Foundation Capital, Blockchange Ventures, Slow Ventures, Rockaway Ventures, and Passport Capital.\n\nLaunched in March 2020, Solana is a layer 1 platform that has fast transaction times and inexpensive fees. The token is used to pay transaction fees as well as to run smart contracts on the network.\n\nIt is an inflationary cryptocurrency with no hard cap on the total number of tokens. As of May 2023, about 395 million SOL tokens are in circulation. SOL has a starting annual inflation rate of 8%, which decreases by 15% every year until it reaches 1.5%, which will be the fixed long-term rate.\n\nSolana is secured through the popular proof-of-stake (PoS) consensus mechanism, where validators are tasked with ensuring transactions are valid. To become a validator and help secure the network, people can stake “some of their SOL. And in exchange for locking their tokens up, holders earn rewards. Validators are chosen based on how many SOL tokens they own.\n\nIn addition to PoS, Solana also uses proof-of-history, which is its core advancement and aims to speed up the process of ordering transactions in a blockchain. This mechanism is used to prove that an event has happened at a particular time.\n\nA competitor to Ethereum, Solana also offers a way to build dApps and currently has $263 million in TVL. This value has fallen considerably since it peaked at just above $10 bln in late 2021 but jumped 23.5% Quarter over Quarter (QoQ) this year.\n\nThe blockchain, which is known for offering users fast, secure, and scalable infrastructure for DeFi and NFT, experienced substantial growth in Q1 of 2023. When it comes to the NFT sector of the ecosystem, daily new NFTs on Solana surged from 2.6 Million to 2.9 Million QoQ, and NFT sales volume in the secondary market denominated in USD increased by almost 36%. Moreover, the network saw 96,000 unique active programs in 1Q23 compared to 58,000 in 1Q22.\n\nMeanwhile, the overall earnings of Solana declined by 17.9% in the last 30 days, according to the token terminal. The number of code commits, however, continued to increase on GitHub. This growth comes after turbulent times during which the blockchain saw a large number of downtimes and various prominent NFTs migrating to other protocols.\n\nWhile Solana has seen the most amount of losses during the last two years of the bear market, some coins like Dogecoin (DOGE), Polkadot (DOT), and Shiba Inu (SHIB) are not far behind with losses of 90.4%, 90.3%, and 90% respectively.\n\nClick here to learn all about investing in Solana (SOL)."
    }
]