[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8venljcnlwdG8uY29tL3N3aXRjaC10b2tlbi1zZWVzLXN1cmdlLWluLXBvcHVsYXJpdHktZm9sbG93aW5nLWl0cy1yZWNlbnQtbGlzdGluZy1vbi1jb2lubWFya2V0Y2FwL9IBbWh0dHBzOi8venljcnlwdG8uY29tL3N3aXRjaC10b2tlbi1zZWVzLXN1cmdlLWluLXBvcHVsYXJpdHktZm9sbG93aW5nLWl0cy1yZWNlbnQtbGlzdGluZy1vbi1jb2lubWFya2V0Y2FwLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Apr 2023 07:00:00 GMT",
        "title": "SWITCH Token Sees Surge in Popularity Following Its Recent Listing on CoinMarketCap - ZyCrypto",
        "content": "Advertisement\n\nSince its February 23rd launch on the decentralized exchange Uniswap and subsequent April 7th listing on CoinMarketCap, the SWITCH Token has been very active.\n\nSWITCH made its Uniswap debut in February at $0.0035; it has since reached highs of $0.015 and is currently trading at about a penny with a daily average trading volume of more than $200,000.\n\nA well-known Ethereum blockchain-based decentralized cryptocurrency exchange is called Uniswap. A peer-to-peer exchange called Uniswap employs smart contracts to make trading possible. The world’s most popular cryptocurrency price tracking website, CoinMarketCap, offers prices, charts, and data on listed currencies.\n\nOn websites like Twitter, Discord, and Reddit, the Switch Blockchain community keeps expanding. The Etherscan block explorer confirms that the SWITCH ERC-20 token was stored in more than 1300 different wallets as of this writing.\n\nThe Switch Blockchain generates the SWITCH Token as a digital incentive for node owners that own and host node licenses that run the blockchain, unlike some tokens that are produced through ICOs or Initial Coin Offerings. The Charter that node owners voted for and approved governs the Switch Blockchain. The Native Switch Blockchain has been bridged to the Ethereum Network, converting the SWITCH Token into an ERC-20 token. SWITCH will have a maximum supply of 50 billion tokens, according to its Litepaper.\n\nAdvertisement\n\nVisit www.switchrewardcard.com to learn more about Switch Reward Card (the firm), Switch Nodes, and the rest of their blockchain-based financial ecosystem, which includes the Switch Trading Platform and the Switch Card product."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3QvYmFieS1kb2dlLXNlY3VyZXMtbGlzdGluZy1vbi10b3AtNS1leGNoYW5nZS1rdWNvaW7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Apr 2023 13:29:56 GMT",
        "title": "Baby Doge Secures Listing on Top 5 Exchange KuCoin - BSC NEWS",
        "content": "BNB\n\nBaby Doge Swap surpassed $83 million in TVL, approaching its all-time high.\n\nBig Year for Baby Doge\n\nBNB Chain MemeFi project Baby Doge Coin announced that its BabyDoge token is getting listed on KuCoin, its largest Centralized Exchange to date and a top 5 exchange overall.\n\nLast Friday, Baby Doge proclaimed that a top 5 CEX listing was coming soon, and sure enough the KuCoin announcement fulfilled that promise.\n\n$BabyDoge deposits are now open on KuCoin on both BNB Chain and Ethereum. Trading begins at 10 a.m. UTC on April 18.\n\nThe KuCoin listing exposes $BabyDoge to more than 27 million users. Currently, the token has more than 1.7 million holders on BNB Chain and nearly 11,000 on Ethereum.\n\nThe naming of KuCoin immediately appeared to be a “sell the news” event, as $BabyDoge dipped by several percentage points after the announcement. However, since Friday the value of $BabyDoge is up by more than 30%.\n\nThe KuCoin listing is the latest positive indicator for $BabyDoge, which is on a tear in 2023, with the value of the token multiplying by nearly four times since Jan. 1.\n\nAs BSC News previously reported, Baby Doge has grown into much more than a dog coin and now has an array of Decentralized Finance (DeFi) offerings, anchored by its Baby Doge Swap Decentralized Exchange (DEX) which recently surpassed $83 million in Total Value Locked, according to DefiLlama, and appears on track to break its all-time high.\n\n‍\n\nWhat is Baby Doge Swap:\n\nBaby Doge Swap is the acclaimed “son” of the popular meme token, DOGE. Baby Doge Swap started out as Baby Doge Coin and is a hyper-deflationary system that progressively increases its scarcity and increases its liquidity. The project is now a fully Decentralized Exchange with swaps, liquidity pools, yield farming, and more. Baby Doge considers its primary utility as building a fun meme community to spread awareness of animal adoption.\n\n‍\n\nWhere to find Baby Doge Swap:\n\nWebsite | Twitter | Telegram | Reddit | Swap |"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3RoZXZyc29sZGllci5jb20vYmluYW5jZS1jb2luLXByaWNlLWFuYWx5c2lzLXByZWRpY3Rpb24tYXByaWwtMTd0aC1ibmItcmVzdW1lcy1idWxsaXNoLWFmdGVyLWNvcnJlY3Rpb25zLWdhaW5zLTYtdGhpcy13ZWVrL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Apr 2023 07:00:00 GMT",
        "title": "Binance Coin Price Analysis & Prediction (April 17th) – BNB Resumes Bullish After Corrections, Gains 6% This Week ... - The VR Soldier",
        "content": "Binance Coin continues to trade inside a channel with a higher high and higher low pattern. It rebounded off a critical level in the past week and started to show signs of strength again. The price is up by a daily 10%.\n\nAfter marking a multi-high at $346 in late March, BNB went through a correctional phase and slowly fell to a key low level of $300 earlier this month. It found support there and recovered quickly with a long wick.\n\nThe price consolidated above $310 for days before it started to pick up this week. The price surged to a high of $333 on Tuesday but later retraced due to a sudden rejection. It found a solid rebound level at $315 and initiated another buy.\n\nToday, it reclaimed the previous high and pushed to $335 a few hours ago. A continuous surge in volatility could bring the price to the test of the channel’s upper boundary by the end of the month. However, the price needs to break through last month’s resistance.\n\nIn the case of a downward swing, BNB will have to decline below this week’s support level and especially last week’s before we can start to consider a drawdown.\n\nEven though the price collapses further, the channel’s lower boundary could provide support. The crypto asset must break below this ascending channel to validate a downtrend. BNB is technically bullish on the higher time frame.\n\nBNB Key Level To Watch\n\nAs the price nears the $337.5 resistance level, the subsequent level to watch for a breakup lies at March’s resistance of $346.4. From there, we can expect a quick rally to $361 and potentially $380 in the coming weeks.\n\nIf BNB retraces, the closest level to consider as support is $327.8 and $318.4. There’s minor support at $310 before dipping to the monthly low of $300.\n\nKey Resistance Levels: $337.5, $346.4, $361\n\nKey Support Levels: $318.4, $327.8, $300\n\nSpot Price: $332\n\nTrend: Bullish\n\nVolatility: Moderate\n\nDisclosure: This is not trading or investment advice. Always do your research before buying any cryptocurrency or investing in any projects.\n\nImage Source: igorigorevich/123RF // Image Effects by Colorcinch"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmdhZGdldHMzNjAuY29tL2NyeXB0b2N1cnJlbmN5L25ld3MvYmluYW5jZS1ibmItY2hhaW4tMTkxLXJpc2t5LWRhcHBzLXJlZC1hbGFybS1saXN0LW5ldHdvcmstZGV0YWlscy0zOTU2MDEy0gF7aHR0cHM6Ly93d3cuZ2FkZ2V0czM2MC5jb20vY3J5cHRvY3VycmVuY3kvbmV3cy9iaW5hbmNlLWJuYi1jaGFpbi0xOTEtcmlza3ktZGFwcHMtcmVkLWFsYXJtLWxpc3QtbmV0d29yay1kZXRhaWxzLTM5NTYwMTIvYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Apr 2023 07:00:00 GMT",
        "title": "Binance’s BNB Chain Reveals 'Red Alarm' List of 191 Risky dApps Running on Its Network: Details - Gadgets 360",
        "content": "Binance's BNB Chain has alerted the global crypto community against engaging with several suspicious dApps operating on its network. The BNB Chain, that currently plays host to a plethora of decentralised apps (dApps), has updated its 'Red Alarm' list with the names of 191 dApps that may pose financial risks to users. These flagged dApps include Cineru, Sezams, Shorter Finance, The Bandit Project, The Cake Monster, and OnlyBrain. BNB Chain's list of potentially risky dApps also reflects the reason why they have caught its attention and the reasons range from their Twitter handles being dormant to a lack of a functional website.\n\n“Often, these risky dApps' contracts don't align with their advertised functions, putting users at risk of losing funds,” the BNB Chain posted on its official blog page. Many of the dApps listed on the Red Alarm index have raised suspicions about offering fake tokens or high tax fees, raising the number of ways unsuspecting investors could lose their hard-earned funds.\n\nSome dApps like Piston Token, CycGo, and Shorter Finance made it to the list due to their association with crypto mixer Tornado Cash, that is facing heavy scrutiny in the US for helping cybercriminals distribute illegal tokens to anonymous wallets. As per the analysis conducted by the BNB Chain, these apps are suspected to be funded by assets emerging out of Tornado Cash, a CoinTelegraph report states.\n\nRiding on the success of ChatGPT, scammers have also launched a bunch of dApps sounding like ChatGPT to take advantage of crypto investors. As per the blockchain's blog, the Red Alarm list is updated every Friday to warn the crypto community of risks on the network.\n\nALERT:rotating_light:: BNB Chain releases a list of 191 risky #dApps and fake #tokens currently hosted on the blockchain\n\n\n\n:golf:️Red flag - Their websites or Twitter handles don't work. #BNB #Binance #Cryptonews pic.twitter.com/bOuPXuLMi5 — Bitinning (@bitinning) April 17, 2023\n\n“The Red Alarm list showcases high-risk dApps on BNB Chain, which may involve rugpulls or scams and are assigned significant risk levels. DappBay updates the Red Alarm list every Friday to include new high-risk projects and decentralized applications. To better navigate the growing list, users can sort dApps by category, date added to Red Alarm, or user count,” the official blog adds.\n\nAn element of the Web3 world, dApps are software programs that run on a blockchain rather than on a single computer or server, that keeps them away from the control of a single authority making them free of censorship. Developers are releasing dApps across verticals including gaming, social media, and finance among others.\n\nGaana, JioSaavn, Google Podcasts, Apple Podcasts,\n\nApple is opening its first stores in India, one in Mumbai and the other in Delhi. What does this mean for Apple customers in India? We discuss this and more on Orbital , the Gadgets 360 podcast. Orbital is available on Spotify Amazon Music and wherever you get your podcasts.\n\nAffiliate links may be automatically generated - see our ethics statement for details."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmdhZGdldHMzNjAuY29tL2NyeXB0b2N1cnJlbmN5L25ld3MvYmluYW5jZS1ibmItY2hhaW4tMTkxLXJpc2t5LWRhcHBzLXJlZC1hbGFybS1saXN0LW5ldHdvcmstZGV0YWlscy0zOTU2MDEy0gF7aHR0cHM6Ly93d3cuZ2FkZ2V0czM2MC5jb20vY3J5cHRvY3VycmVuY3kvbmV3cy9iaW5hbmNlLWJuYi1jaGFpbi0xOTEtcmlza3ktZGFwcHMtcmVkLWFsYXJtLWxpc3QtbmV0d29yay1kZXRhaWxzLTM5NTYwMTIvYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Apr 2023 07:00:00 GMT",
        "title": "Binance’s BNB Chain Reveals 'Red Alarm' List of 191 Risky dApps Running on Its Network: Details - Gadgets 360",
        "content": "Binance's BNB Chain has alerted the global crypto community against engaging with several suspicious dApps operating on its network. The BNB Chain, that currently plays host to a plethora of decentralised apps (dApps), has updated its 'Red Alarm' list with the names of 191 dApps that may pose financial risks to users. These flagged dApps include Cineru, Sezams, Shorter Finance, The Bandit Project, The Cake Monster, and OnlyBrain. BNB Chain's list of potentially risky dApps also reflects the reason why they have caught its attention and the reasons range from their Twitter handles being dormant to a lack of a functional website.\n\n“Often, these risky dApps' contracts don't align with their advertised functions, putting users at risk of losing funds,” the BNB Chain posted on its official blog page. Many of the dApps listed on the Red Alarm index have raised suspicions about offering fake tokens or high tax fees, raising the number of ways unsuspecting investors could lose their hard-earned funds.\n\nSome dApps like Piston Token, CycGo, and Shorter Finance made it to the list due to their association with crypto mixer Tornado Cash, that is facing heavy scrutiny in the US for helping cybercriminals distribute illegal tokens to anonymous wallets. As per the analysis conducted by the BNB Chain, these apps are suspected to be funded by assets emerging out of Tornado Cash, a CoinTelegraph report states.\n\nRiding on the success of ChatGPT, scammers have also launched a bunch of dApps sounding like ChatGPT to take advantage of crypto investors. As per the blockchain's blog, the Red Alarm list is updated every Friday to warn the crypto community of risks on the network.\n\nALERT:rotating_light:: BNB Chain releases a list of 191 risky #dApps and fake #tokens currently hosted on the blockchain\n\n\n\n:golf:️Red flag - Their websites or Twitter handles don't work. #BNB #Binance #Cryptonews pic.twitter.com/bOuPXuLMi5 — Bitinning (@bitinning) April 17, 2023\n\n“The Red Alarm list showcases high-risk dApps on BNB Chain, which may involve rugpulls or scams and are assigned significant risk levels. DappBay updates the Red Alarm list every Friday to include new high-risk projects and decentralized applications. To better navigate the growing list, users can sort dApps by category, date added to Red Alarm, or user count,” the official blog adds.\n\nAn element of the Web3 world, dApps are software programs that run on a blockchain rather than on a single computer or server, that keeps them away from the control of a single authority making them free of censorship. Developers are releasing dApps across verticals including gaming, social media, and finance among others.\n\nGaana, JioSaavn, Google Podcasts, Apple Podcasts,\n\nApple is opening its first stores in India, one in Mumbai and the other in Delhi. What does this mean for Apple customers in India? We discuss this and more on Orbital , the Gadgets 360 podcast. Orbital is available on Spotify Amazon Music and wherever you get your podcasts.\n\nAffiliate links may be automatically generated - see our ethics statement for details."
    }
]