[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vd3d3Lm9ubHlpbnlvdXJzdGF0ZS5jb20vYXJrYW5zYXMvcm9tYW50aWMtYmVkLWFuZC1icmVha2Zhc3QtYXIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "This Bed And Breakfast In Arkansas Is Perfect For A Romantic Getaway - Only In Your State",
        "content": "As local travel experts, we know what travelers are looking for when it comes to finding the perfect accommodations for their next trip. To compile our lists, we scour the internet to find properties with excellent ratings and reviews, desirable amenities, nearby attractions, and that something special that makes a destination worthy of traveling for.\n\nHave you had a romantic getaway lately? A weekend away from the kids, where you lavished in the arms of luxury with that special someone? Where you cozied up by a fireplace or soaked in a hot tub, while listening to soothing melodies? If this sounds like the perfect evening to you, consider booking a stay with Hilltop Manor. It’s the best bed and breakfast in Arkansas that is perfect for a romantic getaway.\n\nAre you ready to spend a peaceful night at this romantic getaway in Arkansas? Visit the website to start planning your escape. And be sure to follow Hilltop Manor on Facebook for monthly specials.\n\nWhile you’re in Hot Springs, enjoy a lovely dinner and cocktail at the oldest speakeasy bar in Arkansas.\n\nWant more Arkansas in your inbox? Get the latest on things to see, do, and eat around Arkansas! spinner Thank you! You'll receive your first newsletter soon! An error occured. Subscribe"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd29rcS5jb20veW91LWNvdWxkLW93bi10aGlzLWJlZC1hbmQtYnJlYWtmYXN0LWluLWRvdmVyLW5ldy1oYW1wc2hpcmUtZm9yLTMtbWlsbGlvbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "You Could Own This Bed and Breakfast in Dover, New Hampshire, for $3 Million - wokq.com",
        "content": "Never have I ever said, \"man, I would love to own a bed and breakfast...\"\n\nUntil now.\n\nBed and breakfasts seem really dated, in a good way. In fact, here is a hot take: I think bed and breakfasts will become really popular again in the next 10-20 years.\n\nThe idea behind B&B's is sweet. It's a comfortable, and simple stay with breakfast provided the next morning.\n\nMany bed and breakfasts are owned by families who live on site.\n\nWait, back to my point...never have I ever wanted to own a bed and breakfast, until now. One is listed in Dover, New Hampshire, for $3.5 million, and is pretty cool.\n\nThe opportunities are endless in this 10 guest room B&B. The property also has a very modern, gorgeous owners’ quarter with two bedrooms. This is above the event space, known as the carriage house.\n\nThe event space has room for 60 guests, but the owners’ quarters is completely private and a really nice addition to the antique and classic feel of the actual bed and breakfast.\n\nCurious about more?\n\n\"This Victorian, post-Civil War style bed and breakfast and event center located steps away from historic downtown Dover, NH has been recently renovated, preserving its vintage charm with modern functionality,\" according to the listing agent Kirstin Stallkamp of Bean Group. \"Rated 5 stars on TripAdvisor, the Silver Fountain Inn boasts 10 uniquely appointed guest rooms, each with private ensuite bathrooms. A kitchen in the Main House services the one-of-a-kind tea parlor enjoyed by guests and the public for both luncheons and themed events.\"\n\nThe property has 15 off street parking spots, beautiful landscape design, and a huge promise for return on investment.\n\nCheck out this unique bed and breakfast for sale in Dover, New Hampshire.\n\nSilver Fountain Inn & Tea Parlor"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd2N5eS5jb20vZGlkLXlvdS1rbm93LW1haW5lLWhlbGQtdGhlLXJlY29yZC1mb3Itd29ybGRzLTItdGFsbGVzdC1zbm93bWFuL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "Did You Know Maine Held the Record for World's 2 Tallest Snowman? - wcyy.com",
        "content": "This may shock you – but in the wintertime, New England used to get snow.\n\nYes, we’ve gotten some flurries this winter. But they stayed on the ground about as long as Mac Jones will wind up staying in Foxboro.\n\nBack in the old days, when winter was winter, New Englanders would partake in this activity known as “building snowmen” – or, snowwomen! It all depends on your placement of the carrot.\n\nIn fact, there was once so much snow, Mainers were able to build some really, really tall snowpeople – so large, they wound up in the Guinness Book of World Records.\n\nBuilt in Bethel in 1999, Maine's Angus, King of the Mountain measured 113 feet, seven inches – or 10 stories – or, almost as tall as Maine Red Claws legend Tacko Fall. The Snowman was comprised of 8 million pounds of snow.\n\nNamed for Maine’s then-Governor, Angus King (he's a person, not a burger at McDonald’s), Angus the Snowman lived on until he melted away that June.\n\nBut as is the case with a certain New England-shot movie franchise that Stephen Spielberg now apparently regrets…you never stop at one when you can go for a sequel.\n\nIn 2008, Bethel introduced the world to Olympia SnowWoman…\n\nBethel Area Chamber of Commerce via Facebook. Bethel Area Chamber of Commerce via Facebook. loading...\n\nHeight really does increase with every generation, as Olympia stood 122 feet, one inch (or, 11 stories). That’s 13 million pounds of snow (but nothing some Spanx can’t take care of). And, a new Guinness World Record.\n\nNamed after then-Maine Senator Olympia Snowe (because you kind of have to), Olympia SnowWoman lasted until July 30, 2008. Happy Frost of July!\n\nBut like snowmen, records don’t stand forever. In 2020, Austria earned that distinction when it unleashed Riesi (which translates to “giant” in English), reaching just under 125 feet. (But if what they say about Arnold Schwarzenegger wearing lifts is true, you have a right to be skeptical about the height of a guy from Austria.)\n\nIt could be difficult to build such a large snowman or snowwoman or snowperson, as the region could be on the verge of making history with its mild 2022-23 winter.\n\nBut, as veteran meteorologist Mark Rosenthal cautions, that could just mean Mother Nature gets even with us in the spring. Could we see a back-to-school snowman??\n\nAnd what if it came to life? Sounds like a great idea for Maine's most reclusive novelist, the mysterious Richard Bachmann.\n\nThis Maine Home for Sale is 2 Houses Down the Street from Stephen King"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL3d3dy5jaXR5YmVhdC5jb20vY2luY2lubmF0aS9zaXRjb20tc3VpdGVzLWZyaWVuZHMtYW5kLXNlaW5mZWxkLXRoZW1lZC1haXJibmJzLW5vdy1hdmFpbGFibGUtdG8tcmVudC1pbi1jaW5jaW5uYXRpL1NsaWRlc2hvdy8xNDU4NDQ3N9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "Friends- and Seinfeld-Themed Suites Available to Rent in Cincinnati - Cincinnati CityBeat",
        "content": "No one may have told you life was gonna be this way, but these two one-of-a-kind Cincinnati apartments you can rent may make up for it.\n\nFans of ‘90s sitcoms Friends and Seinfeld will love these themed rentals. Retro Retreats, formerly The Sitcom Suites, aren’t just full of memorabilia, but instead resemble real-life set replicas, making you feel like you’re a star in the show.\n\nBrenda and Otto Baum are behind the nostalgia-fueled apartments. Brenda told CityBeat via email that being stuck at home during the beginning of the COVID-19 pandemic sparked the idea.\n\n“About three years ago, COVID lockdowns had just begun. Sports, which is my husband's passion, had officially been canceled and we found ourselves with a whole lot of time. We started rewatching a lot of old television. Otto is an owner in a property development company and thought, ‘How cool would it be to recreate an actual set?’\" said Brenda. “With love of old TV, architecture, eye for design and drive for a new date night spot, the [Retro Retreats] idea was born.”\n\nThe apartments are located in the Baums’ neighborhood, Pleasant Ridge. Brenda said the proximity to them would make it easier to manage the listings, and Pleasant Ridge has a lot to offer guests.\n\n“Pleasant Ridge has bars, restaurants, coffee shops, comic book and record stores and is also central to everything else the city has to offer,” Brenda told CityBeat.\n\nBoth units are located in a four-family apartment. The Friends-themed one, The Purple Suite, mimics characters Monica’s and Rachel’s New York City apartment, complete with the kitchen’s turquoise cabinetry, purple living room and the large picture window with views of “NYC.” The Seinfeld-themed one, The New York Suite, likewise looks like Jerry’s New York City apartment with a bike on the wall, a toy basketball hoop on the door, a New York state license plate reading “ASSMAN” and a cutout of neighbor Cosmo Kramer.\n\nBrenda said bringing Otto’s idea to reality was the fun part in creating Retro Retreats.\n\n“The current apartment layouts are far from similar to those on the shows, so ‘set’ walls were built to block windows, faux doors were brought in and the light fixtures were chosen to replicate set camera lights. While Otto and his team are building the units, I have been hunting down the exact furniture and fixtures which have taken me all over the country and have some crazy stories. These units are truly unlike anything else,” she said.\n\nBoth apartments are one-bedrooms with king-sized beds, pull-out couches in the living rooms and fully equipped kitchens. For parents staying with kids, there is a rec center with a playground, pool and splash pad across the street from the building.\n\nRetro Retreats also now has rooms based on the motel rooms in Schitt's Creek and The Golden Girls' Miami home. All rentals start at $185 a night.\n\n\n\nMore info: retroretreatscincy.com."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMilAFodHRwczovL3d3dy53aXNjb25zaW5yYXBpZHN0cmlidW5lLmNvbS9zdG9yeS9tb25leS8yMDIzLzAxLzE2L2xlLWNoYXRlYXUtYmVkLWJyZWFrZmFzdC13aXNjb25zaW4tcmFwaWRzLW5ldy1vd25lcnMtaG9wZS10by1ob25vci1sZWdhY3kvNjk3ODI0NDkwMDcv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Jan 2023 08:00:00 GMT",
        "title": "Le Chateau Bed & Breakfast's new owners hope to honor legacy - Wisconsin Rapids Tribune",
        "content": "WISCONSIN RAPIDS – A new family is adding to the 134-year-old legacy of the Arpin house on First Street North in Wisconsin Rapids.\n\nMike and Rachel Stormoen are the new owners of the house and have continued operating Le Chateau Bed & Breakfast at 840 First St. N. in Wisconsin Rapids. The previous owners – Bill and Faye Collier – owned the house since 2015 and opened its doors as a bed and breakfast in 2016.\n\nWhile both Mike and Rachel grew up in Wisconsin Rapids, Rachel was always drawn to the historic three-story house with a wrap-around porch that stands along the river. But it wasn’t always the brown-and-tan house that people recognize today.\n\nRachel said she grew up in the neighborhood and would go for walks with her mother. She said she remembers walking by the house that had been painted \"an ugly green color\" with a huge teddy bear looking out a third-floor window, and she told her mom, “I’m going to own that someday.”\n\nIt’s a conversation Rachel’s mom reminded her of when she and Mike bought the house in August.\n\n“Don’t ever let someone tell you your dreams are silly,” Rachel said. “But then don’t sit in that dream state. Do it.”\n\nMore:Wisconsin Rapids' top business stories of 2022: Shopko, Kwik Trip and paper industry\n\nMore:Wisconsin Rapids development projects to watch in 2023: Shopko building, hospital, jail\n\nAll roads led back home.\n\nRachel said she and Mike were a little nervous to run the bed and breakfast out of that home, but it felt like everything up to that point led the whole family toward that opportunity.\n\nA study abroad opportunity in school sparked interest in travel and international studies in Rachel, leading her to work on a five-star cruise ship. There, she learned how to serve meals, set tables and make beds to a high standard – all skills beneficial in running a bed and breakfast. Later, a job at a chocolate company in Madison gave her experience planning events. An entrepreneur class taught her how to build a business plan, and an assignment for that class led to Rachel opening a wedding planning business.\n\nWhile living in Madison, Rachel said she felt a pull to be closer to home. The Stormoen family, with three children at the time, moved back to Grand Rapids. Mike and Rachel began looking into running a rental home with Airbnb and talked about starting that opportunity in 2023 when Le Chateau came up for sale.\n\nAs soon as she saw the listing, Rachel said she felt she and her family had to go for it. It was not quite what she and her husband had planned, and it was sooner than they expected, but she felt it was a great opportunity that might not come up again anytime soon. She said she prayed about the decision when she saw the listing, and then told her husband, hoping he’d be open to considering it. He agreed, and they closed on the sale in August and moved in at the beginning of October.\n\nRachel said her husband has always been her foundation and rock, working with her to make her dreams come true. She said there were a lot of bumps in the road that led to running Le Chateau, but it’s all been worth it to be able to raise their family there.\n\nIt’s all about community, connections and memories.\n\nRachel said she has always had a passion for community, no matter where she’s lived. She said she wants to actively add value to wherever she’s living, especially as she and her husband are raising four children.\n\nThat sense of community means that much more to Rachel as she and Mike are raising their kids where they themselves grew up. Rachel said she had a great childhood, and she’s looking forward to raising her kids in the same way she was, just down the street from where she spent her youth. The family lives at the Le Chateau home, with their family quarters on the third floor with a view of Rachel's childhood home.\n\nRachel said they want to bring the community together and offer events and experiences for people to build memories.\n\n“The Stormoen family wants you to come in and make memories here,” she said. “If I can use my house to do so, welcome. Come on in.”\n\n‘This house is made for memories.’\n\nLe Chateau builds on the legacy of John Arpin’s home. John Arpin, whose family owned the John Arpin Lumber Company in Arpin, had the house built for his wife, Clarice, in 1889. She named it Le Chateau, and it was one of the first modern homes in the area to have electricity, running water and a telephone at the time.\n\nThroughout the years, the home stood as multiple apartments and was sold multiple times before it was refurbished from 2004 to 2008. When Bill and Faye bought the home, they wanted to honor the history as they opened the bed and breakfast. The Stormoen family wants to continue honoring the history of the home, as well as some of the newer bed and breakfast traditions.\n\n“It didn’t feel right to buy it and shut the doors,” Rachel said.\n\nShe said she wanted to continue to give guests and community members what they’ve loved over the past few years, while also finding ways to make their experiences even better. Rachel brought her knowledge from wedding planning to the bed and breakfast, offering it as a venue for intimate weddings, as well as a space for events, luncheons and more. Rachel said she wants to be accessible to the community, too, offering monthly events for the public to enjoy.\n\n“This house is made for memories,” she said.\n\nWhat can you expect?\n\nOne tradition Le Chateau started as the bed and breakfast was its Christmas tree tours. People could take tours through the home and see dozens of Christmas trees decorated in various themes.\n\nIt’s a tradition Rachel said will continue. This year, the family set up 67 trees and told stories of the home’s history as they led tours through the home. In the future, Rachel wants to create more experiences, pairing tours with weekly events.\n\nBreakfast is a special event at Le Chateau, as well. Mike runs breakfasts and comes up with a different menu each day. Food is set up on the table family-style, allowing guests to pick whichever foods they want. Rachel said they try to offer something savory, something sweet and something in between during those breakfasts. Mike and Rachel wanted breakfast to feel like a family affair, like going to Grandma’s house for a homemade breakfast.\n\nBeyond the bed and breakfast stays, Le Chateau will host monthly events open to the community, like a Murder Mystery Dinner, Valentine Date Dinner or a Paint and Snack event. Rachel said she’s also planning a Hollywood-themed event with a red carpet and glamor for later this summer. The bed and breakfast partners with Derrie’s Foodworks Catering Co. for some events, as well.\n\nPeople can find events on Le Chateau’s Facebook page or website, or through the Wisconsin Rapids Area Convention & Visitors Bureau.\n\nFor more information, visit themanorwisconsin.org or find Le Chateau Bed & Breakfast/The Manor on Facebook.\n\nContact Caitlin at cshuda@gannett.com or follow her on Twitter @CaitlinShuda."
    }
]