[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDcvMDIvcG9seW5ldHdvcmstYXR0YWNrZXItaXNzdWVzLXdvcnRobGVzcy1iaWxsaW9ucy1pbi1zaGliLWJuYi1idXNkLWluLWxhdGVzdC1jcnlwdG8taGFjay_SAYMBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wNy8wMi9wb2x5bmV0d29yay1hdHRhY2tlci1pc3N1ZXMtd29ydGhsZXNzLWJpbGxpb25zLWluLXNoaWItYm5iLWJ1c2QtaW4tbGF0ZXN0LWNyeXB0by1oYWNrL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 02 Jul 2023 07:00:00 GMT",
        "title": "Poly Network Attacker Issues 'Worthless' Billions in SHIB, BNB, BUSD in Latest Crypto Hack - CoinDesk",
        "content": "Sunday’s attack was the second time PolyNetwork had been targeted by attackers. The protocol was exploited for $600 million in August 2021 – a then record hack – after the alleged leak of a private key that was used to sign a cross-chain message. As such, bridges remain a key, yet vulnerable, part of the crypto ecosystem: They are important for enabling the transfer of billions of dollars worth of tokens between various networks but have been the topmost target for attacks and hacks in the industry’s history."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LnNpLmNvbS9uYmEvaG9ybmV0cy9uZXdzL21pbGVzLWJyaWRnZXMtcmVhY3RzLXRvLXJlLXNpZ25pbmctd2l0aC1jaGFybG90dGXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 02 Jul 2023 07:00:00 GMT",
        "title": "Miles Bridges Reacts to Re-Signing With Charlotte - Sports Illustrated",
        "content": "Even though Miles Bridges didn't agree to a long-term contract extension this offseason, he will still be playing for the Charlotte Hornets in the 2023-24 season. As part of his agreement, Bridges now has the power to veto any trades involving him for the upcoming season. However, once the 2024 offseason arrives, he will become an unrestricted free agent. Charlotte will retain Bridges' Bird Rights next off-season which allows them to go over the cap to re-sign him, but Bridges has the complete freedom to sign elsewhere.\n\nBridges seems to be content rejoining his teammates after being away from the NBA for a year because of a domestic violence charge, to which he pleaded no contest. People will closely scrutinize the relationship between Bridges, the front office, and his agency Klutch over the next twelve months. Did the negotiations this offseason cause too much damage and tension between the two parties? Or was there mutual understanding and respect that this was the best way forward, leaving the possibility of a long-term agreement open in the future?\n\nFacebook - All Hornets\n\nTwitter - @All_Hornets and James Plowright"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8venljcnlwdG8uY29tL2phY2stZG9yc2V5LXVyZ2VzLWVsb24tbXVzay10by1pbnRlZ3JhdGUtdHdpdHRlci13aXRoLWJpdGNvaW4tYW5kLW5vc3RyLXRvLWhlbHAtZWFzZS1idXJkZW4v0gF1aHR0cHM6Ly96eWNyeXB0by5jb20vamFjay1kb3JzZXktdXJnZXMtZWxvbi1tdXNrLXRvLWludGVncmF0ZS10d2l0dGVyLXdpdGgtYml0Y29pbi1hbmQtbm9zdHItdG8taGVscC1lYXNlLWJ1cmRlbi8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 02 Jul 2023 07:00:00 GMT",
        "title": "Jack Dorsey Urges Elon Musk To Integrate Twitter With Bitcoin And NOSTR To ‘Help Ease Burden’ - ZyCrypto",
        "content": "Advertisement\n\nJack Dorsey, the founder and former CEO of Twitter, has urged the current leadership to integrate censorship-resistant protocols to help alleviate the burden of restrictions. This comes just months after billionaire Elon Musk acquired the social media giant and embarked on a journey to transform the platform.\n\nDorsey tweeted early Sunday, acknowledging the challenges of running Twitter and expressing hope for the platform’s success. He further emphasized the importance of building on open protocols like Bitcoin and NOSTR to preserve the open internet.\n\nNOSTR is a protocol designed to create a censorship-resistant global social network using simple and flexible event objects and standard elliptic-curve cryptography for keys and signing.\n\nThe timing of Dorsey’s tweet was notable, as it came just minutes before Elon Musk, the new owner of Twitter, announced temporary limits on account activities to address issues of data scraping and system manipulation.\n\nMusk’s tweet sparked speculation about the platform’s future direction under his leadership, with various users reporting temporary restrictions to views. In a later tweet, the Tesla boss stated that implementing the rate limit on Twitter was a last resort to prevent competitors from accessing Twitter’s data. While acknowledging that it is a temporary measure, he assured users that normal Twitter functionality would be restored.\n\nAdvertisement\n\nElon Musk’s acquisition of Twitter last year was met with anticipation and concern. The $44 billion deal marked a significant moment for the social media service but also raised questions about the platform’s direction under Musk’s ownership.\n\nMusk, known for his strong views on free speech, expressed his intention to create a more freewheeling platform, reverse the permanent ban on former President Donald J. Trump and integrate cryptocurrencies such as Dogecoin for payments. Musk’s ownership of Twitter also promised sweeping changes for the platform, including pledging new leadership, job cuts, and innovative strategies to monetize the service.\n\nCritics, however, have been voicing concerns about the potential for increased toxic content and misinformation on Twitter, with the public Square being sued for various alleged violations, including a $250 million copyright case last week by 17 music publishers.\n\nThat said, as Elon Musk addresses the challenges faced by Twitter, Dorsey’s proposition on the integration of Bitcoin and NOSTR holds the potential to revolutionize the platform into a more decentralized and censorship-resistant space, according to some. At press time, however, Musk was yet to respond to the proposition."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vY3J5cHRvLm5ld3MvcG9seW5ldHdvcmstYWxsZWdlZGx5LWhhY2tlZC1tYXNzaXZlLXRyYW5zYWN0aW9ucy1kZXRlY3RlZC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 02 Jul 2023 07:00:00 GMT",
        "title": "PolyNetwork allegedly hacked, massive transactions detected - crypto.news",
        "content": "PolyNetwork has allegedly been hacked again, according to PeckShield Inc., an on-chain data analytics and security company. The hackers appear to have made several transactions in huge assets on several chains.\n\nPolyNetwork assets have reportedly been hacked, and the perpetrators have added a huge number of assets to several chains.\n\nOn Heco, there is 999,8127T SHIB; Metis has received 99,99,184 BNB and 10 billion BUSD, while Polygon now has an additional 87,579,118 COW, and 999,999,434 OOE, 636,643,868 STACK, 88,640,563 GM and 2,175.0 53 03. Avalanche also appears to have received 82,854,568 XTM, 378,028,371 STACK, 11,026,341 SPAY and 89,383,712 GM and BSC, 926,160,132 DOV, 978,102,855 SLD, and 8,882,911 METIS.\n\nAccording to Metis, the newly minted BNB and BUSD on the platform, there is no available sell liquidity. Hence, the funds on Metis Andromeda are secure because the huge amount of the assets will not get to cross-chain. The platform has also assured that they are in contact with PolyNetwork to lower the attack’s impact and assess the situation more.\n\nWe are aware of Polybridge’s ongoing situation, and are currently in contact with the PolyNetwork team to minimize the impact of the attack and further asses the situation.\n\n\n\nIn regards to the newly minted BNB and BUSD on Metis, there is no sell liquidity available.\n\n\n\nAll funds on… — Metis🌿 (@MetisL2) July 2, 2023\n\nYu Xian, the SlowMist founder, finds no need to worry since the $4.2 billion worth of assets the hackers have are mostly “air” and will not be tangible assets.\n\nBinance CEO Chanpeng Zhao took to Twitter to state that the attack does not affect Binance users since the exchange does not support deposits from PolyNetwork. He further said that the Binance security team is assisting with investigations.\n\nThis does not affect @Binance users. We do not support deposits from this network. Our security team is assisting them in its investigations though. Stay #SAFU. https://t.co/0EsD5Ux6vW — CZ 🔶 BNB (@cz_binance) July 2, 2023\n\nYou might also like: Crypto hacker gets 5 years in prison after stealing $794,000\n\nSo far, PolyNetwork is yet to issue an official statement regarding the hack.\n\nPolyNetwork’s second hack in two years\n\nThe recent hack isn’t the first time the PolyNetwork has been attacked. Earlier, in August 2021, PolyNetwork had a major hack where the platform lost more than $600 million. The hack was named the greatest DeFi hack of all time. According to reports, the hack resulted from mismanaged access rights between two major Poly smart contracts, the EthCrossChainManager and EthCrossChainData.\n\nSince the hacker returned almost all the $600 million apart from $33 million in Tether, the issuer froze these funds soon after the theft. In a message, the hacker had previously claimed that PolyNetwork offered them $500,000 to return the money, and they had turned it down despite being granted immunity.\n\nAccording to a recent report, the second quarter of 2023 had more than 208 million in DeFi stolen, with only $4.5 million recovered. The report noted that the DeFi hacks in Q2 increased seven times year-over-year. There have been 117 incidents reported in Q2 2023 compared to only 17 in the same period in 2022. The report noted the same high numbers in the first half of 2023, whereby about $665 million was lost to the hacks."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMilwFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2RlZmktcGxhdGZvcm0tcG9seS1uZXR3b3JrLWhhY2tlZC1oYWNrZXJzLWlzc3VlLW1pbGxpb25zLW9mLXRva2Vucy1vbi1tZXRpcy1wb2x5Z29uLWFuZC1ic2MtMjAyMzA3MDIwNjU10gGbAWh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9hbXAvY3J5cHRvY3VycmVuY2llcy9uZXdzL2RlZmktcGxhdGZvcm0tcG9seS1uZXR3b3JrLWhhY2tlZC1oYWNrZXJzLWlzc3VlLW1pbGxpb25zLW9mLXRva2Vucy1vbi1tZXRpcy1wb2x5Z29uLWFuZC1ic2MtMjAyMzA3MDIwNjU1?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 02 Jul 2023 07:00:00 GMT",
        "title": "DeFi platform Poly Network hacked, hackers issue millions of tokens on Metis, Polygon and BSC - FXStreet",
        "content": "Poly Network is hacked yet again after the platform survived the largest DeFi hack, worth $610 million in 2021.\n\nThe attacker has issued nearly 1 billion BNB and 10 billion BUSD tokens on Metis, 999.81 trillion Shiba Inu tokens, among others.\n\nBinance’s Changpeng Zhao confirmed that the attack does not affect the exchange’s users and the security team is assisting Poly Network.\n\nDeFi platform PolyNetwork informed users of its temporary suspension due to the recent attack. The project is engaging with relevant parties to determine the extent of affected assets.\n\nBinance’s Changpeng Zhao (CZ) came out in support of users and explained that the exchange does not accept deposits from Poly Network and funds of Binance users are safe. The exchange’s security team is assisting Poly Network in tackling the attack.\n\nAlso read: Solana beats Ethereum in 24 hour NFT sales for the first time in history, gears up for recovery\n\nPoly Network confirms attack, second DeFi hack on the platform since 2021\n\nPoly Network is the same DeFi platform that gained popularity for being hit by the largest hack in decentralized finance history. In 2021, Poly Network suffered a hack on the Binance Smart Chain, Ethereum and Polygon blockchains.\n\nThe team identified three addresses that collectively identified $600 million in different cryptocurrencies, including USD Coin (USDC), Wrapped Bitcoin (WBTC), Wrapped Ether (WETH) and Shiba Inu (SHIB).\n\nThe hack was termed the largest one in DeFi history. Early today Poly Network informed crypto market participants that cybersecurity professionals have been engaged in investigating the recent attack on the platform.\n\nDear users, we would like to inform you that Poly Network is temporarily suspending its services due to a recent attack. We are actively engaging with relevant parties and diligently assessing the extent of the affected assets. 【1/3】 — Poly Network (@PolyNetwork2) July 2, 2023\n\nIn the attack on July 2, hackers minted 99,999,184 Binance Coin (BNB), 10 billion Binance USD (BUSD) on Metis; 999.81 Trillion SHIB on Heco , 87,579,118 COW and 999,998,434 OOE, 636,643,868 STACK, 88,640,563 GM and 2,175,053 03 were issued on Polygon, and 378,028,371 STACK, 82,854,568 XTM, 11 ,026,341 SPAY, issued 89,383,712 GM on Avalanche, 8,882,911 METIS, 926,160,132 DOV, 978,102,855 SLD and other assets were issued on Binance Smart Chain (BSC).\n\nCZ assures Binance users remain unaffected\n\nWhile investigation is currently underway, to determine the affected users and blockchains; Binance has confirmed that the exchange’s users are unaffected. The exchange platform does not accept deposits from the Poly Network.\n\nThis does not affect @Binance users. We do not support deposits from this network. Our security team is assisting them in its investigations though. Stay #SAFU. https://t.co/0EsD5Ux6vW — CZ Binance (@cz_binance) July 2, 2023\n\nFXStreet team has contacted Poly Network for more information.\n\nExpert commentary on Poly Network exploit\n\nAnatoly Makosov, Core Developer at TON Foundation analyzed the exploit on Poly Network. Makosov told FXStreet,\n\nThe exploit on the Poly Network further demonstrates the need to remain in a perpetual state of vigilance. Transfers of values between different blockchains use cross-chain transfer bridges managed by intermediary oracles. This usually provides an acceptable level of bridge security, but there is always a theoretical possibility that oracles can be hacked.\n\nMakosov explains that the security of oracle bridges helps support the DeFi project’s security infrastructure, avoiding such exploits as seen in the Poly Network attack."
    }
]