[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDkvMTMvYm5iLWNoYWlucy1sYXllci0yLW5ldHdvcmstb3BibmItZ29lcy1saXZlL9IBWGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDkvMTMvYm5iLWNoYWlucy1sYXllci0yLW5ldHdvcmstb3BibmItZ29lcy1saXZlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Sep 2023 07:00:00 GMT",
        "title": "BNB Chain’s Layer 2 Network opBNB Goes Live - CoinDesk",
        "content": "“Scalability and security are the top priorities of opBNB,” said Arno Bauer, Senior Architect at BNB Chain, in a message to CoinDesk. “Before opening the mainnet to the public, stringent criteria had to be met. This included High Availability (HA), 4K Transactions Per Second (TPS), rigorous stress testing, reduced gas costs under 0.2 gwei, fast finality under 1 second, and enhanced security with multiple external audits.”"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDkvMTMvYm5iLWNoYWlucy1sYXllci0yLW5ldHdvcmstb3BibmItZ29lcy1saXZlL9IBWGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDkvMTMvYm5iLWNoYWlucy1sYXllci0yLW5ldHdvcmstb3BibmItZ29lcy1saXZlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Sep 2023 07:00:00 GMT",
        "title": "BNB Chain’s Layer 2 Network opBNB Goes Live - CoinDesk",
        "content": "“Scalability and security are the top priorities of opBNB,” said Arno Bauer, Senior Architect at BNB Chain, in a message to CoinDesk. “Before opening the mainnet to the public, stringent criteria had to be met. This included High Availability (HA), 4K Transactions Per Second (TPS), rigorous stress testing, reduced gas costs under 0.2 gwei, fast finality under 1 second, and enhanced security with multiple external audits.”"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY29pbmZvbWFuaWEuY29tL2JuYi1jaGFpbi1sYXVuY2hlcy1tYWlubmV0LWZvci1vcHRpbWlzbS1iYXNlZC1sMi1uZXR3b3JrL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Sep 2023 07:00:00 GMT",
        "title": "BNB Chain Launches Mainnet for Optimism-Based L2 Network - Coinfomania",
        "content": "Blockchain developers of the layer-1 blockchain BNB Chain have announced the mainnet launch of the Optimism-based opBNB network. Three months ago, the opBNB testnet was deployed for developers to launch their decentralized applications (dApps) and test the network’s performance.\n\nopBNB is a layer-2 scaling network built on the BNB Chain. The L2 blockchain is an Ethereum Virtual Machine (EVM)-compatible network harnessing Optimism’s OP Stack to facilitate cheap and fast transactions.\n\nopBNB Mainnet Goes Live\n\nDuring the three months of testing, opBNB facilitated over 35 million transactions, housed more than 150 dApps on testnet, and was connected to nearly 436,000 unique wallet addresses.\n\nThe network also maintained a stable 2,600 transactions per second (TPS), with a peak TPS of 4,000. The opBNB ecosystem also boasts a block completion time of approximately one second, with the addition of over 86,000 blocks being completed daily. The developers added that the network saw an active daily user base of over 6,000.\n\nInternal and external security audits are conducted on the opBNB network to ensure its safety for users.\n\nBeing a layer-2 network built on the BNB Chain, transactions conducted on the opBNB blockchain are submitted for verification to the underlying blockchain.\n\nArno Bauer, Senior Architect at BNB Chain, echoed the achievements of the L2 network when he said:\n\n“Scalability and security are the top priorities of opBNB. Before opening the mainnet to the public, stringent criteria had to be met. This included High Availability (HA), 4K Transactions Per Second (TPS), rigorous stress testing, reduced gas costs under 0.2 gwei, fast finality under 1 second, and enhanced security with multiple external audits.”\n\nWhat to Expect Next\n\nThe blockchain developer team admits in its announcement that it still has a long way ahead in fortifying the L2 network.\n\nThese incoming features include proof enhancement, account abstraction, data availability and interoperability with BNB Greenfield, and decentralized sequencer. The team describes these features as ways to boost “the network’s resilience and decentralization.”"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY29pbmZvbWFuaWEuY29tL2JuYi1jaGFpbi1sYXVuY2hlcy1tYWlubmV0LWZvci1vcHRpbWlzbS1iYXNlZC1sMi1uZXR3b3JrL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Sep 2023 07:00:00 GMT",
        "title": "BNB Chain Launches Mainnet for Optimism-Based L2 Network - Coinfomania",
        "content": "Blockchain developers of the layer-1 blockchain BNB Chain have announced the mainnet launch of the Optimism-based opBNB network. Three months ago, the opBNB testnet was deployed for developers to launch their decentralized applications (dApps) and test the network’s performance.\n\nopBNB is a layer-2 scaling network built on the BNB Chain. The L2 blockchain is an Ethereum Virtual Machine (EVM)-compatible network harnessing Optimism’s OP Stack to facilitate cheap and fast transactions.\n\nopBNB Mainnet Goes Live\n\nDuring the three months of testing, opBNB facilitated over 35 million transactions, housed more than 150 dApps on testnet, and was connected to nearly 436,000 unique wallet addresses.\n\nThe network also maintained a stable 2,600 transactions per second (TPS), with a peak TPS of 4,000. The opBNB ecosystem also boasts a block completion time of approximately one second, with the addition of over 86,000 blocks being completed daily. The developers added that the network saw an active daily user base of over 6,000.\n\nInternal and external security audits are conducted on the opBNB network to ensure its safety for users.\n\nBeing a layer-2 network built on the BNB Chain, transactions conducted on the opBNB blockchain are submitted for verification to the underlying blockchain.\n\nArno Bauer, Senior Architect at BNB Chain, echoed the achievements of the L2 network when he said:\n\n“Scalability and security are the top priorities of opBNB. Before opening the mainnet to the public, stringent criteria had to be met. This included High Availability (HA), 4K Transactions Per Second (TPS), rigorous stress testing, reduced gas costs under 0.2 gwei, fast finality under 1 second, and enhanced security with multiple external audits.”\n\nWhat to Expect Next\n\nThe blockchain developer team admits in its announcement that it still has a long way ahead in fortifying the L2 network.\n\nThese incoming features include proof enhancement, account abstraction, data availability and interoperability with BNB Greenfield, and decentralized sequencer. The team describes these features as ways to boost “the network’s resilience and decentralization.”"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vY29pbmNoYXB0ZXIuY29tL2FzLWJpbmFuY2UtdXMtY2VvLWxlYXZlcy1mZWFycy1vZi1hbm90aGVyLWZ0eC1saWtlLWNvbGxhcHNlLXNwcmVhZC1ibmItcHJpY2Utc3RydWdnbGVzLWJlbG93LTIyMC_SAX1odHRwczovL2NvaW5jaGFwdGVyLmNvbS9hcy1iaW5hbmNlLXVzLWNlby1sZWF2ZXMtZmVhcnMtb2YtYW5vdGhlci1mdHgtbGlrZS1jb2xsYXBzZS1zcHJlYWQtYm5iLXByaWNlLXN0cnVnZ2xlcy1iZWxvdy0yMjAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Sep 2023 07:00:00 GMT",
        "title": "As Binance.US CEO Leaves, Fears Of Another FTX-Like Collapse Spread: BNB Price struggles below $220 - CoinChapter",
        "content": "Key Takeaways:\n\nBinance.US CEO Brian Shroder has become the latest executive to leave the company.\n\nThe latest actions against Binance raise fears that it may collapse like FTX.\n\nBNB, the native token of Binance, remains under the $220 mark\n\nInvestors fear that Binance (BNB), the largest crypto exchange, could collapse like rival FTX\n\nYEREVAN (CoinChapter.com) — Binance.US CEO Brian Shroder has stepped down from his position, with Norman Reed, the Chief Legal Officer at the firm, temporarily succeeding him.\n\nThe recent developments have instigated fears among traders that the crypto exchange will collapse. A subsequent folding of its de-facto parent firm, Binance Holding Ltd., could become the next major debacle after FTX.\n\nThe company has recently undergone a significant restructuring, resulting in the departure of approximately 100 employees, representing about one-third of its workforce. Shroder joined Binance.US in September 2021.\n\nHis departure and the wider organizational changes have occurred amid an ongoing lawsuit that Binance.US is facing from the US Government Agencies.\n\nWith several executives leaving Binance or its de-facto US subsidiary, investors have started seeing red flags.\n\nBinance, the parent company, has also seen a mass exodus recently. Earlier this month, Global Product Lead Mayur Kamat left the firm.\n\nKamat departed after Chief Strategy Officer Patrick Hillmann and Senior Director of Investigations Matthew Price quit. Binance SVP for Compliance Steven Christie and Asia-Pacific Head Leon Foong have already left.\n\nMeanwhile, BNB, the native token of the exchange, continues to tank. In June 2023, the token’s price fell below the $300 mark. The last time it slipped below that mark was in March this year.\n\nBNB, the native token of Binance, is around 70% below its all-time high of $690 from May 2021. Graph Credit: TradingView\n\nWhen writing, BNB exchanges hands at $211, over 35% below its price six months ago. Although most of the troubles evolve around Binance.US, the implications will also spill over to the main exchange.\n\nBinance caught in lawsuits with the SEC & CFTC\n\nIn March this year, the Commodity Futures Trading Commission (CFTC) filed lawsuits against Binance, Binance.US, and the exchange’s co-founder, Changpeng “CZ” Zhao. These legal actions accused them of operating an illicit exchange, selling unregistered securities, infringing upon commodities regulations, and mishandling customer funds.\n\nIn June, the Securities and Exchange Commission (SEC) also initiated a lawsuit against Binance and its CEO, accusing them of violating US securities laws.\n\nInvestors are worried that Binance.US will eventually collapse following CEO Brian Shroder’s resignation.\n\nBinance (BNB) is also facing an investigation from the US Department of Justice (DOJ). According to John Reed Stark, author and former chief of SEC’s Office of Internet Enforcement (OIE), the DOJ might be planning to file a criminal indictment related to Binance.\n\nIf these serious criminal charges stick, CZ could be in deep trouble. The crypto exchange is also under the scanner in France, The Netherlands, and Australia. Several EU countries, including Germany and Belgium, have also tightened their stance against Binance.\n\nBinance.US CEO Norman Reed’s departure comes when the firm is gearing up to fight the allegations in court. A part of its strategy is to put together a stellar defense team.\n\nNotably, the company has signed up George Canellos, the global head of litigation and arbitration group at Milbank LLP. Canellos previously served as the SEC’s Deputy Director of the Division of Enforcement and Director of the SEC’s New York regional office.\n\nIs Binance the next FTX?\n\nThe recent developments in Binance have investors worried. The markets have not recovered from the mayhem that Sam Bankman-Fried’s FTX caused after it went bankrupt.\n\nAt the time, nobody would have ever thought that the exchange would fold up so dangerously. But it did. Now, Binance is slowly becoming the next “sinking ship,” with executives rushing to jump out. Whenever there is troubling news related to the company, people predict it will collapse.\n\nIf BNB tanks, the consequences on the markets will be greater than the ones felt after the FTX collapse.\n\nAfter all, some people are already noticing similarities. Remember Sam Trabucco, the co-CEO of Alameda Research? He left the firm a few months before it collapsed in the FTX debacle. Do these Binance executives know something?\n\nThe recent developments have investors worried. To some, an eventual collapse is inevitable.\n\n“When Binance goes, it’ll leave a really ugly long lasting black eye on crypto. FTX was the warm up (easy logic: when FTX collapsed, there was a larger fish to fill the gap. Now, Binance is the only fish left),” crypto skeptic Not Tiger Global wrote.\n\nBinance has claimed it has more than enough funds in its reserves to service orders on the exchange.\n\nMeanwhile, Binance has maintained over 1:1 reserves against user assets in its latest audit. However, skeptics doubt if this is true.\n\nAfter all, the firm has announced it has self-verified its reserves instead of an independent auditor. Some even warn that users won’t be able to withdraw funds soon. So, is Binance the next FTX? Time will show."
    }
]