[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiMGh0dHBzOi8vbWVzc2FyaS5pby9yZXBvcnQvc3RhdGUtb2YtMWluY2gtcTEtMjAyM9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "State of 1inch Q1 2023 - Messari",
        "content": "We believe crypto is the technology of free people, free thinking, and free markets."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3QvYXB0b3MtaW50cm9kdWNlcy1kZWxlZ2F0ZWQtc3Rha2luZy13aHktaXQtbWF0dGVyc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 14:25:20 GMT",
        "title": "Aptos Introduces Delegated Staking: Why it Matters - BSC NEWS",
        "content": "APT\n\nDelegated staking allows users to delegate their staking power to a trusted validator and earn rewards without becoming a validator themselves.\n\nAptos Enables Token Holders to Secure the Network\n\nThe Aptos Foundation released Core Delegation Pool functionality through Aptos Implementation Proposal 6 (AIP-6), developed by Bware Labs. Aptos made this recent announcement on April 20 through a Twitter post.\n\nThe delegation pool extends Aptos' existing staking protocol. Its main purpose is to enable multiple parties to contribute to the staking requirement by entrusting the stake to a trusted validator.\n\nOnce the delegation pool reaches the minimum stake required to run a validator, the validator can enter the active set and start validating blocks. The number of validators participating in the network determines the security and decentralization of L1 protocols. The greater the number of validators, the more decentralized the blockchain becomes.\n\nFor Aptos, this further decentralizes the network by achieving two goals:\n\nBy delegating their staking power to a validator, token holders can support the security of the network and earn rewards without having to run a validator themselves. To reach the minimum stake required to join the validator set, node operators can spin up a delegation pool and have the public stake in it. As a result, the community can bootstrap validator nodes more quickly.\n\nPrior to Aptos Implementation Proposal 6 (AIP-6), only token holders with more than 1M $APT could stake tokens and earn rewards. The AIP-6 also allows multiple wallets to contribute to the stake required for a validator to enter the active set.\n\nThus, delegated staking offers everyone increased access, flexibility, and self-custody. By delegating staking, token holders keep ownership of their $APT in their wallets without relying on off-chain methods to aggregate funds.\n\nAptos ($APT) has a total volume locked (TVL) at $61.33 million. $APT is trading at $10.98, down 3.67% in 24 hours.\n\n‍\n\nWhat is Aptos:\n\nAptos is a new, independent project focused on delivering the safest and most production-ready Layer 1 blockchain in the world. The team includes the original creators, researchers, designers, and builders of Diem, the blockchain first built to serve this purpose.\n\n‍\n\nWhere to find Aptos Labs:\n\nWebsite | Twitter | Telegram | Medium | Discord |"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8venljcnlwdG8uY29tL3BpbmstbW9vbi1zdHVkaW9zLWxhdW5jaC1mcmVlLXRvLXBsYXktbW9kZS1mb3ItaXRzLWdhbWUta21vbi1nZW5lc2lzL9IBXmh0dHBzOi8venljcnlwdG8uY29tL3BpbmstbW9vbi1zdHVkaW9zLWxhdW5jaC1mcmVlLXRvLXBsYXktbW9kZS1mb3ItaXRzLWdhbWUta21vbi1nZW5lc2lzLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Pink Moon Studios Launch Free To Play Mode For Its Game KMON Genesis - ZyCrypto",
        "content": "Advertisement\n\nPink Moon Studios introduced the eagerly awaited free-to-play mode for its renowned strategic game KMON Genesis.\n\nFormerly known as Kryptomon, KMON Genesis was rebranded to lower the barrier of entry to one of the most popular Web3 games in the market. The game allows gamers to collect, breed and trade unique creatures in the KMON universe. These creatures are called Kyptomons, digital collectible pets built on the BSC blockchain. Players act as trainers for these digital pets. Trainers are responsible for breeding and training their pets to create new Kryptomons.\n\nEach Kryptomon has a unique genetic code comprising 38 different and randomized parameters. The parameters determine other traits of the pets, from visual appearance to prowess in combat. Like a natural pet, Kryptomons require attention, and failure to provide this will make them “freeze” (simulated death). In the unfortunate event a pet gets frozen, trainers can unfreeze them (simulated revival) using special items available on Pink Moon’s marketplace, which can be bought using KMON tokens, the native tokens on the platform.\n\nTrainers can also train their pets to prepare them for battle against others in the gameplay. Notably, Pink Moon Studios shares revenue from KMON Genesis with players weekly. This is done through monetary rewards of an average of $50 in tokens when a player completes in-game challenges.\n\nCommenting on the development, Umberto Canessa Cerchi, Founder & CEO of Pink Moon Studios, stated:\n\nAdvertisement\n\n“Our core mission has always been to make the enthralling KMON Genesis universe accessible to everyone. The introduction of the free-to-play mode is a game-changer, inviting players from all backgrounds to experience the innovative and exciting world we’ve developed without any financial barriers or web3-related technological hurdles.”\n\nFounded in 2021, the Pink Moon Studio was created by a group of experienced gamers and industry veterans who came together to bridge Web2 and Web3 games for a more enhanced player experience. The team behind the project has incorporated the Guild Affiliation Program to sustain the gaming guild while offering access to exciting games and allowing players to earn financial rewards. In addition, their gaming space has a Diamond contract solution that keeps gameplay fresh and exciting for users. Other features include on-chain AI, NFT forgoing, phygital items, and AR NFT Hunt.\n\nChief Product Officer and SVP of Game Development at Pink Moon Studios, Brian Bento, added:\n\n“We are eager to offer players a sneak peek into the mesmerizing digital realm of the World of Kogaea. Our dedicated team has poured countless hours into crafting a visually spectacular and engaging experience that players will find truly captivating.”"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vY29pbmNvZGV4LmNvbS9hcnRpY2xlLzI2MDQ2L3doYXQtaXMtb3Blbi1jYW1wdXMtaG93LXRvLWpvaW4tZWR1LXRva2VuLXNhbGUtYmluYW5jZS1sYXVuY2hwYWQv0gFoaHR0cDovL2FtcC5jb2luY29kZXguY29tL2FydGljbGUvMjYwNDYvd2hhdC1pcy1vcGVuLWNhbXB1cy1ob3ctdG8tam9pbi1lZHUtdG9rZW4tc2FsZS1iaW5hbmNlLWxhdW5jaHBhZC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "What is Open Campus Crypto & How to Join EDU Token Sale on Binance Launchpad? - CoinCodex",
        "content": "What is Open Campus Crypto & How to Join EDU Token Sale on Binance Launchpad?\n\nBinance, the world’s largest cryptocurrency exchange, has announced Open Campus as the next project to be featured on Binance Launchpad, a platform allowing users to participate in token sales of up-and-coming crypto projects.\n\nThe preparation period for the Open Campus initial exchange offering on Binance Launchpad will start on April 23 and last until April 28, 2023. In total, $2.5 million worth of EDU tokens (at an exchange rate of 1 EDU = 0.05 USD) will be distributed among participants.\n\nOpen Binance Account\n\nWhat is Open Campus?\n\nOpen Campus is a web3 education protocol that allows communities to create, distribute, and promote educational content they thinks is valuable for the broader society. In addition, the Open Campus protocol is designed to enable educators to earn revenue from their efforts.\n\nThe educational content produced via Open Campus can be tokenized into NFTs, meaning that educators can utilize various revenue-sharing strategies that can be coded into the smart contract. Here’s a quick excerpt of that functionality taken from Binance’s research paper:\n\n“Revenue generated from the content will be stored in a smart contract, co-owners will be able to withdraw based on their contribution (e.g. teachers for creating the content, publishers for marketing and localization).”\n\nThere are three fundamental concepts Open Campus is built upon. Here’s how the Open Campus team explains each of them:\n\nCommunities can utilize blockchain technology to fund, co-own and learn from educational content that fits their needs.\n\ncan utilize blockchain technology to fund, co-own and learn from educational content that fits their needs. Creators launch their content on the protocol by offering promotional rights through Publisher NFTs, where co-publishers can earn revenue based on their contributions.\n\nlaunch their content on the protocol by offering promotional rights through Publisher NFTs, where co-publishers can earn revenue based on their contributions. Philanthropists can support educational causes directly and track their donations on-chain through Smart Donations.\n\nThe native token of Open Campus is EDU, which fulfills governance, payments, and on-chain revenue-sharing use cases. In addition, EDU can be used to “incentivize and onboard” new users through Open Campus partners, and for purchasing the Publisher NFTs.\n\nThe Open Campus protocol has already secured its first adopter, a highly successful kids app, TinyTap. TinyTap is among the 10 top highest-grossing kids-focused mobile apps in both Android and iOS ecosystems. TinnyTap has over 100 thousand creators and more than 9 million families.\n\nHow to participate in the Open Campus token sale on Binance Launchpad\n\nThe Open Campus team will be selling 50 million EDU tokens through Binance Launchpad, which corresponds to 5% of the token’s total supply (1 billion tokens). Each token will be sold at a price equivalent to $0.05, which means that the team is looking to raise $2.5 million through the sale.\n\nHere are the important dates you should keep in mind when participating in the Open Campus token sale:\n\nStart End Preparation Period April 23 (00:00 AM UTC) April 28 (00:00 AM UTC) Subscription period April 28 (06:00 AM UTC) April 28 (09:00 AM UTC) Calculation period April 28 (09:00 AM UTC) April 28 (10:00 AM UTC) Final token distribution April 28 (10:00 AM UTC) n/a\n\nThe maximum investment a single user will be able to make into the Open Campus token sale on Binance Launchpad is the equivalent of $15,000. However, not all users will be able to invest this much, as each individual user’s allocation will be determined by their BNB token holdings.\n\nIf you want to participate in the Open Campus launchpad, you have to open an account on Binance and verify it. For more information, check our guide on how to invest in an IEO on Binance.\n\nHere’s a brief explanation of how to participate in the Open Campus Launchpad:\n\nStep 1 : Create an account on Binance\n\n: Create an account on Binance Step 2 : Verify your account\n\n: Verify your account Step 3 : Select Open Campus on the Binance Launchpad homepage\n\n: Select Open Campus on the Binance Launchpad homepage Step 4 : Commit your BNB\n\n: Commit your BNB Step 5: Wait for the EDU token distribution on April 28, 2023, at 10:00 UTC\n\nFor additional information, you can check out the performance of some of the previously completed IEOs on Binance Launchpad:\n\n*Data based on a snapshot taken on April 21, 2023, at 16:00 PM (UTC)\n\nWhen will the Open Campus token sale on Binance start?\n\nBinance will start recording users’ BNB balances for the purposes of the Space ID token sale on April 23 at 00:00 UTC. This will last until April 28 at 06:00 UTC, when the subscription period will be open and eligible users will be able to commit to buying ID tokens.\n\nTokens will be distributed to participants immediately after the token sale concludes, and we can also expect EDU to be listed for trading on Binance shortly after the token sale.\n\nThanks to the announcement, we’re already seeing increased demand in the markets for BNB. The cryptocurrency is up about 1% in the last 24 hours. In comparison, both Bitcoin and Ethereum have lost over -2% each in the same time period."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vY29pbmNvZGV4LmNvbS9hcnRpY2xlLzI2MDQ2L3doYXQtaXMtb3Blbi1jYW1wdXMtaG93LXRvLWpvaW4tZWR1LXRva2VuLXNhbGUtYmluYW5jZS1sYXVuY2hwYWQv0gFoaHR0cDovL2FtcC5jb2luY29kZXguY29tL2FydGljbGUvMjYwNDYvd2hhdC1pcy1vcGVuLWNhbXB1cy1ob3ctdG8tam9pbi1lZHUtdG9rZW4tc2FsZS1iaW5hbmNlLWxhdW5jaHBhZC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "What is Open Campus Crypto & How to Join EDU Token Sale on Binance Launchpad? - CoinCodex",
        "content": "What is Open Campus Crypto & How to Join EDU Token Sale on Binance Launchpad?\n\nBinance, the world’s largest cryptocurrency exchange, has announced Open Campus as the next project to be featured on Binance Launchpad, a platform allowing users to participate in token sales of up-and-coming crypto projects.\n\nThe preparation period for the Open Campus initial exchange offering on Binance Launchpad will start on April 23 and last until April 28, 2023. In total, $2.5 million worth of EDU tokens (at an exchange rate of 1 EDU = 0.05 USD) will be distributed among participants.\n\nOpen Binance Account\n\nWhat is Open Campus?\n\nOpen Campus is a web3 education protocol that allows communities to create, distribute, and promote educational content they thinks is valuable for the broader society. In addition, the Open Campus protocol is designed to enable educators to earn revenue from their efforts.\n\nThe educational content produced via Open Campus can be tokenized into NFTs, meaning that educators can utilize various revenue-sharing strategies that can be coded into the smart contract. Here’s a quick excerpt of that functionality taken from Binance’s research paper:\n\n“Revenue generated from the content will be stored in a smart contract, co-owners will be able to withdraw based on their contribution (e.g. teachers for creating the content, publishers for marketing and localization).”\n\nThere are three fundamental concepts Open Campus is built upon. Here’s how the Open Campus team explains each of them:\n\nCommunities can utilize blockchain technology to fund, co-own and learn from educational content that fits their needs.\n\ncan utilize blockchain technology to fund, co-own and learn from educational content that fits their needs. Creators launch their content on the protocol by offering promotional rights through Publisher NFTs, where co-publishers can earn revenue based on their contributions.\n\nlaunch their content on the protocol by offering promotional rights through Publisher NFTs, where co-publishers can earn revenue based on their contributions. Philanthropists can support educational causes directly and track their donations on-chain through Smart Donations.\n\nThe native token of Open Campus is EDU, which fulfills governance, payments, and on-chain revenue-sharing use cases. In addition, EDU can be used to “incentivize and onboard” new users through Open Campus partners, and for purchasing the Publisher NFTs.\n\nThe Open Campus protocol has already secured its first adopter, a highly successful kids app, TinyTap. TinyTap is among the 10 top highest-grossing kids-focused mobile apps in both Android and iOS ecosystems. TinnyTap has over 100 thousand creators and more than 9 million families.\n\nHow to participate in the Open Campus token sale on Binance Launchpad\n\nThe Open Campus team will be selling 50 million EDU tokens through Binance Launchpad, which corresponds to 5% of the token’s total supply (1 billion tokens). Each token will be sold at a price equivalent to $0.05, which means that the team is looking to raise $2.5 million through the sale.\n\nHere are the important dates you should keep in mind when participating in the Open Campus token sale:\n\nStart End Preparation Period April 23 (00:00 AM UTC) April 28 (00:00 AM UTC) Subscription period April 28 (06:00 AM UTC) April 28 (09:00 AM UTC) Calculation period April 28 (09:00 AM UTC) April 28 (10:00 AM UTC) Final token distribution April 28 (10:00 AM UTC) n/a\n\nThe maximum investment a single user will be able to make into the Open Campus token sale on Binance Launchpad is the equivalent of $15,000. However, not all users will be able to invest this much, as each individual user’s allocation will be determined by their BNB token holdings.\n\nIf you want to participate in the Open Campus launchpad, you have to open an account on Binance and verify it. For more information, check our guide on how to invest in an IEO on Binance.\n\nHere’s a brief explanation of how to participate in the Open Campus Launchpad:\n\nStep 1 : Create an account on Binance\n\n: Create an account on Binance Step 2 : Verify your account\n\n: Verify your account Step 3 : Select Open Campus on the Binance Launchpad homepage\n\n: Select Open Campus on the Binance Launchpad homepage Step 4 : Commit your BNB\n\n: Commit your BNB Step 5: Wait for the EDU token distribution on April 28, 2023, at 10:00 UTC\n\nFor additional information, you can check out the performance of some of the previously completed IEOs on Binance Launchpad:\n\n*Data based on a snapshot taken on April 21, 2023, at 16:00 PM (UTC)\n\nWhen will the Open Campus token sale on Binance start?\n\nBinance will start recording users’ BNB balances for the purposes of the Space ID token sale on April 23 at 00:00 UTC. This will last until April 28 at 06:00 UTC, when the subscription period will be open and eligible users will be able to commit to buying ID tokens.\n\nTokens will be distributed to participants immediately after the token sale concludes, and we can also expect EDU to be listed for trading on Binance shortly after the token sale.\n\nThanks to the announcement, we’re already seeing increased demand in the markets for BNB. The cryptocurrency is up about 1% in the last 24 hours. In comparison, both Bitcoin and Ethereum have lost over -2% each in the same time period."
    }
]