[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8venljcnlwdG8uY29tL3hycC13aGFsZS1hbmQtc2hhcmstYWRkcmVzcy1ob2xkaW5ncy1oaXQtMy1tb250aC1oaWdoLWZ1bGwtYmxvd24tbWVnYS1yYWxseS10by0xMC1wcmljZS1mb3J0aGNvbWluZy_SAX1odHRwczovL3p5Y3J5cHRvLmNvbS94cnAtd2hhbGUtYW5kLXNoYXJrLWFkZHJlc3MtaG9sZGluZ3MtaGl0LTMtbW9udGgtaGlnaC1mdWxsLWJsb3duLW1lZ2EtcmFsbHktdG8tMTAtcHJpY2UtZm9ydGhjb21pbmcvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 21 Oct 2023 07:00:00 GMT",
        "title": "XRP Whale And Shark Address Holdings Hit 3-Month High — Full-Blown Mega Rally To $10 Price Forthcoming? - ZyCrypto",
        "content": "Advertisement\n\nThe amount of XRP being held by XRP’s richest investors has surged to its highest level in three months. According to crypto analytics portal Santiment, XRP sharks and whales aggressively loading up comes as the fifth-largest crypto enjoys a remarkable upsurge during the past day.\n\nXRP Sharks And Whales Ramp Up Accumulation\n\nSantiment says deep-pocketed investors are accumulating huge amounts of XRP.\n\nThe blockchain sleuth says whale and shark wallets holding between 10,000 and 10 million XRP are accumulating rapidly, raising their net holdings to the highest levels since July 27. This accumulation by the cohort represents 29.5% of the total XRP supply.\n\n🐳📈 #XRPLedger enjoyed its first jump above $0.53 in 10 days despite most #altcoins continuing to decline. The rise can largely be attributed to the 'smart money' tiers, holding between 10K to 10M $XRP, accumulating rapidly. They hold 29.5% of the supply. https://t.co/KULxMtMGRL pic.twitter.com/LTzFcrwG3f — Santiment (@santimentfeed) October 20, 2023\n\nThis period of XRP accumulation coincides with the token’s latest price rally caused by the United States Securities and Exchange Commission (SEC) voluntarily dismissing its lawsuit against Ripple CEO Brad Garlinghouse and chairman Chris Larsen.\n\nThe dropped charges mark the third consecutive legal win for Ripple in the lawsuit with the SEC. In July, Judge Analisa Torres ruled that the Wall Street regulator had failed to conclusively prove XRP transactions broke securities laws. The SEC also lost an appeal aiming to reverse that decision in October.\n\nAdvertisement\n\nXRP is changing hands at $0.5202 by press time, an increase of 7.2% over the past 48 hours, according to CoinGecko.\n\nFull-Fledged XRP Pump Underway?\n\nIt is very obvious that XRP’s so-called whales and sharks are on a targeted mission to help revive the price of the coin and, perhaps, take it to a new record high. Accumulation, particularly continuous accumulation, always precedes a significant price rally, and, as such, XRP whales and sharks may be instrumental in driving the coin’s price higher.\n\nHowever, the jury’s very much out on when XRP will begin its recovery back to $1. But if this strong accumulation continues, then it’s only a matter of time before the token rises above the elusive $1 mark before eventually reaching $10."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vYmxvY2tjaGFpbnJlcG9ydGVyLm5ldC9kYWlseS1hbmFseXNpcy1idGMtZXRoLWJuYi1zb2wtYWRhL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 21 Oct 2023 07:00:00 GMT",
        "title": "Daily Analysis: BTC, ETH, BNB, SOL, ADA - Blockchain Reporter",
        "content": "Markets are on bear activity today, with the global market cap sitting 0.1% below its previous 24-hour mark, as the total cap still stands at $1.12T as of press time. The fear and greed index is at 53 as markets maintain neutrality. The global trading volume is 12.9% down in 24 hours, at $41.7B as of press time.\n\nBitcoin price analysis\n\nBitcoin (BTC) has started on slight bear activity, as Bitcoin price stood at $29.7K as of press time after recording a daily decrease of 0.14% and a weekly rise of 10.6%. As a result of the Bitcoin price, the token’s trade volume dropped by 24% during the same period and is presently at $15.2B.\n\nThe Bollinger bands are now diverging, showing increasing volatility levels on Bitcoin Price. Despite the dip, the Relative Strength Index (RSI) is above the average line in the overbought, showing bull dominance on Bitcoin price.\n\nBTC 1-day chart | Source: Tradingview\n\nEthereum price analysis\n\nEthereum (ETH) is also riding on bear activity, as Ethereum price stood at $1607 after recording a daily decrease of 0.4%, as the weekly rise now stands at 3.8%. ETH’s trade volume dropped by 18% during the same period and is presently at $4.9B.\n\nThe Bollinger bands are converging, showing low volatility levels on Ethereum Price as the Relative Strength Index (RSI) moves above the average line, showing bull effects on Ethereum price despite today’s fall.\n\nETH 1-day chart | Source: Tradingview\n\nBNB price analysis\n\nBNB (BNB) is also riding on bear activity, as BNB price stood at $213 after recording a daily decrease of 0.8%, and the weekly rise now stands at 3.52%. BNB’s trade volume dropped by 19% during the same period and is presently at $268M.\n\nThe Bollinger bands are close to each other, showing low volatility levels on Ethereum Price as the Relative Strength Index (RSI) moves above the average line, showing bull effects on BNB price despite today’s fall.\n\nBNB 1-day chart | Source: Tradingview\n\nSolana price analysis\n\nSolana (SOL) is, however, riding on bull activity, as Solana price stood at $28 after recording a daily increase of 4.9%, as the weekly rise now stands at 28%. SOL’s trade volume dropped by 19% during the same period and is presently at $795M.\n\nThe Bollinger bands are diverging, showing high volatility levels on Solana Price as the Relative Strength Index (RSI) moves above the average line in the overbought region, showing bull dominance on Solana price.\n\nSOL 1-day chart | Source: Tradingview\n\nCardano price analysis\n\nCardano (ADA) is also riding on bull activity, as Cardano price stood at $0.25 after recording a daily increase of 0.6%, as the weekly rise now stands at 3%. ADA’s trade volume dropped by 10% during the same period and is presently at $118M.\n\nThe Bollinger bands are converging, showing low volatility levels on Cardano Price as the Relative Strength Index (RSI) moves above the average line, showing bull effects on Cardano price."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8venljcnlwdG8uY29tL3hycC13aGFsZS1hbmQtc2hhcmstYWRkcmVzcy1ob2xkaW5ncy1oaXQtMy1tb250aC1oaWdoLWZ1bGwtYmxvd24tbWVnYS1yYWxseS10by0xMC1wcmljZS1mb3J0aGNvbWluZy_SAX1odHRwczovL3p5Y3J5cHRvLmNvbS94cnAtd2hhbGUtYW5kLXNoYXJrLWFkZHJlc3MtaG9sZGluZ3MtaGl0LTMtbW9udGgtaGlnaC1mdWxsLWJsb3duLW1lZ2EtcmFsbHktdG8tMTAtcHJpY2UtZm9ydGhjb21pbmcvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 21 Oct 2023 07:00:00 GMT",
        "title": "XRP Whale And Shark Address Holdings Hit 3-Month High — Full-Blown Mega Rally To $10 Price Forthcoming? - ZyCrypto",
        "content": "Advertisement\n\nThe amount of XRP being held by XRP’s richest investors has surged to its highest level in three months. According to crypto analytics portal Santiment, XRP sharks and whales aggressively loading up comes as the fifth-largest crypto enjoys a remarkable upsurge during the past day.\n\nXRP Sharks And Whales Ramp Up Accumulation\n\nSantiment says deep-pocketed investors are accumulating huge amounts of XRP.\n\nThe blockchain sleuth says whale and shark wallets holding between 10,000 and 10 million XRP are accumulating rapidly, raising their net holdings to the highest levels since July 27. This accumulation by the cohort represents 29.5% of the total XRP supply.\n\n🐳📈 #XRPLedger enjoyed its first jump above $0.53 in 10 days despite most #altcoins continuing to decline. The rise can largely be attributed to the 'smart money' tiers, holding between 10K to 10M $XRP, accumulating rapidly. They hold 29.5% of the supply. https://t.co/KULxMtMGRL pic.twitter.com/LTzFcrwG3f — Santiment (@santimentfeed) October 20, 2023\n\nThis period of XRP accumulation coincides with the token’s latest price rally caused by the United States Securities and Exchange Commission (SEC) voluntarily dismissing its lawsuit against Ripple CEO Brad Garlinghouse and chairman Chris Larsen.\n\nThe dropped charges mark the third consecutive legal win for Ripple in the lawsuit with the SEC. In July, Judge Analisa Torres ruled that the Wall Street regulator had failed to conclusively prove XRP transactions broke securities laws. The SEC also lost an appeal aiming to reverse that decision in October.\n\nAdvertisement\n\nXRP is changing hands at $0.5202 by press time, an increase of 7.2% over the past 48 hours, according to CoinGecko.\n\nFull-Fledged XRP Pump Underway?\n\nIt is very obvious that XRP’s so-called whales and sharks are on a targeted mission to help revive the price of the coin and, perhaps, take it to a new record high. Accumulation, particularly continuous accumulation, always precedes a significant price rally, and, as such, XRP whales and sharks may be instrumental in driving the coin’s price higher.\n\nHowever, the jury’s very much out on when XRP will begin its recovery back to $1. But if this strong accumulation continues, then it’s only a matter of time before the token rises above the elusive $1 mark before eventually reaching $10."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS90cmF2ZWwvMjAyMy9vY3QvMjEvMjAtYmVzdC11ay1ob3RlbHMtcHVicy1hbmQtYmJzLXVuZGVyLTE1MC1hLW5pZ2h00gFfaHR0cHM6Ly9hbXAudGhlZ3VhcmRpYW4uY29tL3RyYXZlbC8yMDIzL29jdC8yMS8yMC1iZXN0LXVrLWhvdGVscy1wdWJzLWFuZC1iYnMtdW5kZXItMTUwLWEtbmlnaHQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 21 Oct 2023 07:00:00 GMT",
        "title": "20 of the UK’s best hotels, pubs and B&Bs – for under £150 a night - The Guardian",
        "content": "Best for food lovers\n\nBrockencote Hall, Chaddesley Corbett, WorcestershireYou might think you’ve rolled up at a luxury Loire valley chateau when you arrive at this Victorian manor in landscaped parkland. There’s nothing too luxe about the price, though, with B&B from £138. Spend what you save on a nine-course tasting extravaganza in the restaurant, perhaps matching it with a flight of wine. A normal two- or three-course dinner might feature local produce such as Worcestershire duck breast with confit duck hash and artisanal cheeses. There’s plenty to do during the day – fishing, tennis, or a stroll around the 29 hectares. The 21 bedrooms range from contemporary classics to feature suites.\n\nDoubles from £138 B&B, nine-course dinner £85, brockencotehall.com\n\nThe White Hart Inn, Mersea, Essex\n\nView image in fullscreen Photograph: Oliver Suckling\n\nDerelict for almost a decade, this weatherboarded pub reopened last summer in the capable hands of Piers Baker, owner of Dedham’s Sun Inn. It’s worth crossing Mersea’s causeway (check the tides first) for the seafood alone, although carnivores and vegetarians are equally well catered for in this gastropub, where nibbles are less salted peanuts and more asparagus fritter with pea aioli. The long wine list offers plenty by the glass and reasonable prices. The bar forms part of an expansive dining room with colourful banquettes and parquet floor. Six colourful contemporary bedrooms have modern bathrooms and art (for sale) on the walls.\n\nDoubles from £150 B&B, whitehartinnmersea.co.uk\n\nParador 44, Cardiff\n\nCádiz comes to Cardiff in this boutique bolthole, whose nine rooms were added last year above acclaimed Spanish restaurant Asador 44. Mains range from Pyrenean milk-fed lamb to grilled carabinero prawns. The (soundproofed) bedrooms evoke Andalucía at every turn, with their tiles, shutters and headboards. They share a guest lounge whose honesty bar is stocked with Spanish wine and beer. Breakfast is a delightful mix of Welsh and Spanish produce, with Spanish cheeses and tarta de Santiago (almond sponge) alongside Welshcakes on the buffet; cooked dishes include “flamenco eggs” or a “full parador”.\n\nDoubles from £131 B&B, grupo44.co.uk\n\nThe Crown and Anchor, Ham, Wiltshire\n\nRun as a curry house before two local couples stepped in to renovate it, this village inn serves food several notches above the average chicken madras and pub grub. Unusual options might include torched salmon with hispi cabbage and tiger prawn spring roll, or celeriac schnitzel with truffle dressing. Dining dogs are served snacks from the open kitchen, while owners can try the Ham 1840 beer, made for the pub, or sparkling Winding Wood from a nearby vineyard. Interiors include a log burner and flagstone floor with interesting additions such as Martin Parr photos in the loos. The bedrooms don’t disappoint, either, with antique furniture, oversized fabric headboards and botanical prints.\n\nDoubles from £130 B&B, crownandanchorham.co.uk\n\nWestmorland Hotel, Penrith, Cumbria\n\nThose tired of motorway services sarnies can break the journey between Scotland and the south at Tebay Services, where the enterprising Dunning family created a unique roadside offering with a shop and hotel after the M6 carved through their hill farm. Local specialities in the restaurant include lamb from the farm and Cumbrian beef, as well as home-made bread and ice-cream. Stripped back Scandi-chic rooms have views of the fells, and despite the motorway there’s no traffic noise. In the morning, there are walks from the door, and supplies of cheese and more in the farm shop.\n\nDoubles from £93 room only, westmorlandhotel.com\n\nBest for walkers\n\nThe Barnsdale, Oakham, Rutland\n\nThe footpath circumnavigating Rutland Water is 23 miles long, taking in the picturesque waterside Normanton church. Or there’s a seven-mile trail around the reservoir’s central promontory. Five minutes’ drive away is the newly opened Barnsdale, which makes a great place to rest weary legs and load up on calories in the excellent restaurant. The interesting menu might include a starter of lobster and squid with orange and fennel, followed by steak, or perhaps gnocchi with wild field mushroom and spinach. There’s a good range of wines, plus complimentary ginger citrus liqueur in the colourful rooms, which surround a courtyard and have statement fabric headboards.\n\nDoubles from £126 B&B, barnsdalerutland.com\n\nBlack Bull, Sedbergh, Cumbria\n\nThere are hikes in the Howgill Fells from the door of this market-town pub on the edge of the Yorkshire Dales national park. Walkers can climb all the way to the highest point, the Calf, at 676 metres (2,217 feet), or take a shorter walk to the lower hilltop of Winder, with its views of the Dales and the Lakes – Windermere is just over half an hour away. Back at base, uncluttered wood-panelled bedrooms are in a soothing palette, with Cumbrian wool blankets. Co-owner Nina Matsunaga draws on her Japanese/German heritage to create dishes such as Herdwick lamb and kimchi tartare. A shot of wasabi vodka will help with aching limbs.\n\nDoubles from £134 room only, theblackbullsedbergh.co.uk\n\nForss House, Thurso\n\nIn winter, when prices drop, guests at this Georgian mansion can live the life of a Scottish laird for less; booking 30 days in advance offers the best rates. Wrapped in woodland and a curve of the River Forss near the north-east tip of the Scottish mainland, it makes a great base for exploring the hills and coast. Guided walks are organised by the Countryside Ranger service. There are other outdoor activities too, such as salmon fishing. After a day in the countryside, the panelled lounge is a great place to relax before a dinner of local specialities such as scallops or Scottish beef fillet. There’s the option of a whisky flight before snuggling down in one of the 14 elegant bedrooms.\n\nDoubles from £125 B&B, forsshousehotel.co.uk\n\nThe Castle Hotel, Bishop’s Castle, Shropshire\n\nThe Shropshire Way, a 200-mile walking route covering the Shropshire Hills and historic towns, runs past the front door of this market town inn, where dogs stay free of charge. Offa’s Dyke Path, along the Welsh borderlands, is just a few miles away. The hotel is on the hilltop site of a medieval castle a mile from the Welsh border. Some of the contemporary and comfortable bedrooms have far-reaching views of the surrounding hills. After their rambles, guests can eat in the oak-panelled restaurant or in any of the three bars, where pub classics are accompanied by a superb selection of Shropshire real ales.\n\nDoubles from £104 B&B, thecastlehotelbishopscastle.co.uk\n\nBurleigh Court, Brimscombe, Gloucestershire\n\nCotswolds charm on the cheap is on offer at this beautiful Georgian building remodelled by Clough Williams-Ellis. There’s a handful of circular walks straight from the door, some with pubs to visit en route, and other footpaths a short drive away. Back at the hotel, there’s a food option to suit everyone, including afternoon tea, all-day grazing, wine tastings, and a more formal dinner in the panelled dining room. The 18 rooms are split between the manor house and coach house (where the dog-friendly rooms are); there’s also a cottage with its own hot tub.\n\nDoubles from £149 B&B, burleighcourtcotswolds.co.uk\n\nB&Bs\n\nBurnside Cottage, Canisbay, Caithness\n\nKacey and Stephen George say their former croft house offers “superior B&B”. About half a mile from the North Coast 500 route, the cottage has two spacious ground-floor suites with views to Stroma and the Orkneys. Artist Stephen’s carvings and photography can be seen everywhere. Evening meals are served room service-style by trolley, and might include smoked salmon pasta, ribeye steak or teriyaki tofu. Dogs are welcome and can bag a bacon treat for breakfast, also delivered to the rooms by trolley.\n\nDoubles from £150 B&B, burnside-cottage.co.uk\n\nArthur’s, Royal Hillsborough, County Down\n\nIn Royal Hillsborough’s Georgian high street, this new B&B comes with its own coffee house, serving coffee and cakes daily until 3pm. The dozen rooms are plush affairs – owner Lynne McCabe studied interior design while renovating it with her husband Jonathan. (The couple also offer B&B at their family home, Lisnacurran, and at Ralph’s guest house in Moira.) Rooms have centrepiece headboards in fabric by Mulberry, Osborne & Little and Sanderson, colourful walls from the Zoffany design house, antique fair finds and velvet curtains. A Lord Downshire’s Ulster fry breakfast can be walked off with a stroll around the lake, fort and castle – the king’s official Northern Irish residence.\n\nDoubles from £140 B&B, arthurshillsborough.com\n\nBrooks Guesthouse, Bristol\n\nFor sheer fun factor, the rooftop caravans atop this central Bristol B&B are pretty cool. What was a three-storey 1950s office block was converted by Carla and Andrew Brooks into a modern, frills-free guesthouse, with Airstream-style caravans in the rooftop garden. The largest can take a family with two small children. Bedrooms are more traditional, with tongue-and-groove panelling, pale-wood bedsteads and colourful throws. Bathrooms are compact and there are wall hooks rather than wardrobes. Breakfast includes dishes such as homemade fruit compote, eggs benedict and a full English.\n\nBedrooms from £99 B&B, caravans from £108, brooksguesthousebristol.com\n\nHollamoor Farm, Barnstaple, Devon\n\nThey don’t stand on ceremony at this farmhouse B&B, even though it’s run by Sir Bourchier (George) and Lady Caroline Wrey. The place has been in the family since 1740, when Sir Bourchier’s ancestor married the Earl of Bath’s only daughter. Now, they welcome families, dogs and horses to the property, where chickens and ducks potter around the garden. Human guests are invited to tea and cakes in the owners’ sitting room. Rooms are cottage-chic; a hayloft suite has its own seating area. Breakfast is a homely affair around the table, with free-range eggs from the farm before guests head off to explore the estate on foot or horseback.\n\nDoubles from £125 B&B, devonhorsebedbreakfast.co.uk\n\nNewbegin House, Beverley, East Yorkshire\n\nWalter and Nuala Sweeney’s Georgian townhouse is minutes from Beverley town centre. They don’t stint on extras in the three traditional-style rooms, which come with sherry, fresh milk and flowers. Nor is the breakfast your standard fare – offering omelettes, smoked salmon, pancakes and a full Yorkshire. The house is filled with original features, antiques, books and heirlooms, with shuttered windows, polished wood floors and marble fireplaces. There’s a well upholstered feel throughout, with plump chairs and Victorian rugs; one bedroom has a rocking horse; another overlooks the pretty walled garden.\n\nDoubles from £110 B&B, newbeginhousebbbeverley.co.uk\n\nPubs with rooms\n\nThe George in Rye, East Sussex\n\nA fire raged through this 16th-century coaching inn in 2019, and restoration took until last summer. It’s looking good, though, with a sense of drama given to its chic interiors by co-owner Katie Clarke, who used to work on film sets. A former church altar is the reception desk, there’s an antique sailcloth on the restaurant walls and a ladies’ loo that looks like a shell grotto. The bedrooms have fabric headboards, brightly patterned wallpaper, Frette linens and REN toiletries. The pub makes a great base to explore Rye, as well as Camber Sands and Romney Marsh.\n\nDoubles from £95 B&B, thegeorgeinrye.com\n\nThe Meikleour Arms, Perth and Kinross\n\nThe Franco-Scottish union holds strong at this Georgian coaching inn on the Lansdowne estate, owned by Sam Mercer Nairne, a descendant of the Marquesses of Lansdowne, and his Bordeaux-born wife, Claire. Elements from both countries can be seen everywhere: bedrooms might have French antiques and a toile-draped canopy bed alongside Arran Aromatics toiletries. Estate-to-plate menus feature local specialities with a French twist, such as Meikleour black pudding scotch egg with celeriac remoulade or estate venison with dauphinoise potatoes. During the day, guests can go salmon fishing on their own stretch of the River Tay, or play a round at Blairgowrie Golf Club.\n\nDoubles from £90 B&B, meikleourarms.co.uk\n\nThe Rose and Crown, Romaldkirk, Durham\n\nStanding beside a Saxon church in a pretty Teesdale village, this 18th-century inn is owned by the Robinson family, who also run Headlam Hall. They take pride in running a “proper Dales bar” with flagstone floors, wood beams, fires blazing and dogs lolling under tables. The 14 bedrooms are full of character, particularly in the main inn, where exposed stone and beamed ceilings rub shoulders with locally made furniture. Rooms in the courtyard are more contemporary, but all have fresh milk, homemade biscuits and Molton Brown toiletries. The pub is very dog friendly, with treats and a hose-down area for use after one of the walks from the door.\n\nDoubles from £100 B&B, rose-and-crown.co.uk\n\nThe Inn at Whitewell, Lancashire\n\nThe riverside location is key to this old manor house, with bedrooms overlooking the River Hodder, walks along its banks (and over its stepping stones) and guest fishing for trout and salmon along seven miles of water. Run by the Bowman family, it is deeply traditional, with oodles of atmosphere. Local ales are served in the flagstone bar, and diners can look forward to impressive meals under long-serving chef Jamie Cadman, whose Whitewell fish pie is legendary. There is also an onsite wine shop. Bedrooms overflow with charm and eccentricities, with antiques, deep sofas, books and art. All are dog friendly, many have working fires, while some have four-poster beds and Victorian cabinet baths.\n\nDoubles from £145 B&B, innatwhitewell.com\n\nThe Three Daggers, Edington, Wiltshire\n\nSo much more than a pub with rooms, this 250-year-old village inn also has a farm shop, onsite brewery and spa barn with outdoor hot tub and sauna. Three beautiful bedrooms above the pub are in farmhouse chic style with a muted palette. The largest has a beamed ceiling and a bathroom with standalone tub and shower. They share an open-plan farmhouse-style kitchen and lounge with squishy sofas; guests who book all three rooms can have the top floor to themselves. Downstairs, farm-to-fork menus are served in the buzzy pub, filled with settles, beams and wood burners.\n\nDoubles from £111 B&B, threedaggers.co.uk\n\nThe new edition of The Good Hotel Guide is at goodhotelguide.com"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vYmxvY2tjaGFpbnJlcG9ydGVyLm5ldC9kYWlseS1hbmFseXNpcy1idGMtZXRoLWJuYi1zb2wtYWRhL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 21 Oct 2023 07:00:00 GMT",
        "title": "Daily Analysis: BTC, ETH, BNB, SOL, ADA - Blockchain Reporter",
        "content": "Markets are on bear activity today, with the global market cap sitting 0.1% below its previous 24-hour mark, as the total cap still stands at $1.12T as of press time. The fear and greed index is at 53 as markets maintain neutrality. The global trading volume is 12.9% down in 24 hours, at $41.7B as of press time.\n\nBitcoin price analysis\n\nBitcoin (BTC) has started on slight bear activity, as Bitcoin price stood at $29.7K as of press time after recording a daily decrease of 0.14% and a weekly rise of 10.6%. As a result of the Bitcoin price, the token’s trade volume dropped by 24% during the same period and is presently at $15.2B.\n\nThe Bollinger bands are now diverging, showing increasing volatility levels on Bitcoin Price. Despite the dip, the Relative Strength Index (RSI) is above the average line in the overbought, showing bull dominance on Bitcoin price.\n\nBTC 1-day chart | Source: Tradingview\n\nEthereum price analysis\n\nEthereum (ETH) is also riding on bear activity, as Ethereum price stood at $1607 after recording a daily decrease of 0.4%, as the weekly rise now stands at 3.8%. ETH’s trade volume dropped by 18% during the same period and is presently at $4.9B.\n\nThe Bollinger bands are converging, showing low volatility levels on Ethereum Price as the Relative Strength Index (RSI) moves above the average line, showing bull effects on Ethereum price despite today’s fall.\n\nETH 1-day chart | Source: Tradingview\n\nBNB price analysis\n\nBNB (BNB) is also riding on bear activity, as BNB price stood at $213 after recording a daily decrease of 0.8%, and the weekly rise now stands at 3.52%. BNB’s trade volume dropped by 19% during the same period and is presently at $268M.\n\nThe Bollinger bands are close to each other, showing low volatility levels on Ethereum Price as the Relative Strength Index (RSI) moves above the average line, showing bull effects on BNB price despite today’s fall.\n\nBNB 1-day chart | Source: Tradingview\n\nSolana price analysis\n\nSolana (SOL) is, however, riding on bull activity, as Solana price stood at $28 after recording a daily increase of 4.9%, as the weekly rise now stands at 28%. SOL’s trade volume dropped by 19% during the same period and is presently at $795M.\n\nThe Bollinger bands are diverging, showing high volatility levels on Solana Price as the Relative Strength Index (RSI) moves above the average line in the overbought region, showing bull dominance on Solana price.\n\nSOL 1-day chart | Source: Tradingview\n\nCardano price analysis\n\nCardano (ADA) is also riding on bull activity, as Cardano price stood at $0.25 after recording a daily increase of 0.6%, as the weekly rise now stands at 3%. ADA’s trade volume dropped by 10% during the same period and is presently at $118M.\n\nThe Bollinger bands are converging, showing low volatility levels on Cardano Price as the Relative Strength Index (RSI) moves above the average line, showing bull effects on Cardano price."
    }
]