[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9uZXdzbGV0dGVycy8yMDIzLTA2LTI3L2JpbmFuY2UtY29pbi1ibmItZGVjbGluZXMtYWZ0ZXItc2VjLWxhd3N1aXQtcHJlc3N1cmluZy1jcnlwdG8tZXhjaGFuZ2XSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 27 Jun 2023 07:00:00 GMT",
        "title": "Binance Coin (BNB) Declines After SEC Lawsuit, Pressuring Crypto Exchange - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDYvMjcvaGt2YWMtbGF1bmNoZXMtbmV3LWNyeXB0by1pbmRleC13aXRoLTMwLWNvaW5zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 27 Jun 2023 07:00:00 GMT",
        "title": "HKVAC Launches New Crypto Index with 30 Coins - Crypto Times",
        "content": "In an exciting move for the cryptocurrency market, Hong Kong-based rating agency HKVAC has released a new virtual asset index.\n\nBeyond established currencies like Bitcoin (BTC) and Ethereum (ETH), this index features an array of stablecoins, including WBTC, BTCB, stETH, BCH, LTC, BNB, MATIC, ADA, ATOM, FIL, NEAR, ALGO, ICP, XRP, DOGE, DOT, WTRX, SHIB, TRX, LINK, LEO, XMR, XLM, OKB, LDO, HBAR, VET, QNT, FTM, EOS.\n\nHong Kong rating agency HKVAC announced its virtual asset index, in addition to BTC ETH stablecoins, including WBTC, BTCB, stETH, BCH, LTC, BNB, MATIC, ADA, ATOM, FIL, NEAR, ALGO, ICP, XRP, DOGE, DOT, WTRX, SHIB, TRX, LINK, LEO, XMR, XLM, OKB, LDO, HBAR, VET, QNT, FTM, EOS.… — Wu Blockchain (@WuBlockchain) June 27, 2023\n\nHKVAC enjoys backing from key players in the industry, including Hong Kong legislators Johnny Ng, Huobi, KuCoin, and others. Despite this, there’s an ongoing debate in the Hong Kong community about the index’s actual reference value.\n\nThis debate arises from the inclusion of platform tokens, privacy tokens, and numerous tokens listed as securities by the US Securities and Exchange Commission (SEC) in the index.\n\nThe Hong Kong SFC mandates that retail-tradable tokens be included in at least two indices. Although this index is non-governmental, its judging criteria are straightforward, focusing on the top 30 cryptocurrencies by market capitalization.\n\nAlso Read: HSBC Hong Kong Offers Bitcoin and Ethereum ETF to Clients\n\nWith this bold initiative, HKVAC seeks to provide a comprehensive overview of the market, even if its value as a reference continues to be debated among local experts."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9uZXdzbGV0dGVycy8yMDIzLTA2LTI3L2JpbmFuY2UtY29pbi1ibmItZGVjbGluZXMtYWZ0ZXItc2VjLWxhd3N1aXQtcHJlc3N1cmluZy1jcnlwdG8tZXhjaGFuZ2XSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 27 Jun 2023 07:00:00 GMT",
        "title": "Binance Coin (BNB) Declines After SEC Lawsuit, Pressuring Crypto Exchange - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    }
]