[
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vd3d3Lm15bG9uZG9uLm5ld3Mvd2hhdHMtb24vd2hhdHMtb24tbmV3cy9hYS1iYnMtYXdhcmRzLTIwMjMtMjczMjA2NTfSAVBodHRwczovL3d3dy5teWxvbmRvbi5uZXdzL3doYXRzLW9uL3doYXRzLW9uLW5ld3MvYWEtYmJzLWF3YXJkcy0yMDIzLTI3MzIwNjU3LmFtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jul 2023 07:00:00 GMT",
        "title": "The best Bed and Breakfast stays in the UK named with second place just 90 mins from London - My London",
        "content": "The AA released their list of winners for their annual B&B awards, celebrating the very best of the UK’s bed and breakfasts and all they have to offer. The organisation announced the winners earlier this week, spanning eight different categories.\n\nB&Bs battled it out for the coveted titles in the Friendliest B&B of the Year; Inn of the Year; Guest Accommodation of the Year for England, Scotland and Wales; and Breakfast of the Year for England, Scotland and Wales categories. The AA revealed their winner of the Friendliest B&B of Year went to family-run The Fylde International in Blackpool, Lancashire. The runner up spot went to The Chudleigh in Clacton-on-Sea, Essex.\n\nAA Inn of the Year went to Cumbria’s The Punch Bowl Inn & Restaurant in Crosthwaite, while AA Guest Accommodation of the Year for England went to the Market Cross Guest House, Belford, Northumberland.\n\nREAD MORE: The 8 London restaurants named as the best for 2023 by the Good Food Guide\n\n(Image: Tripadvisor)\n\nVicky and Kate Easley, owners of The Fylde International, commented: “To say we are shocked is an understatement. We are very proud and humbled to have won the award. After owning and Managing The Fylde International Blackpool for the past 18 years this is an incredible achievement. Our customers are the forefront of our business, and we aim to provide them with excellent customer service, quality and clean accommodation and a homely atmosphere.\"\n\nMarket Cross Guest House’s owners Steve and Amanda White said: “Running Market Cross has always been more than just a business for us, it’s a lifestyle choice. This means everything we do and everything we offer to our guests is part of us. It’s who we are. We have always valued being part of the AA as it allows us to be assessed by the best in the industry and they're always there for advice and support. Winning this award is recognition of our passion and commitment.”\n\nBut not only is the accommodation situation, it’s also about the breakfast you get. The AA Inspector wrote of England’s winner, The Holcombe, Somerset: “Dating back to the 16th century, The Holcombe has views towards Downside Abbey. The attentive owners and pleasant staff create a friendly and relaxed atmosphere. Bedrooms are individually furnished and very comfortable. Real ales are served in the open-plan bar which has an attractive split-level restaurant.”\n\nOwners Caroline Gardiner and Alan Lucas, said: “We are thrilled to have received this award! The team are truly delighted, especially as breakfast is the last meal any guest remembers after they've checked out. It’s all about the finer details for us, like taking the time to source locally, and of course only the best ingredients! We use homegrown fruits on our delicious yoghurt, compote and granola pot, and reduce food wastage by asking guests to pre-order.”\n\nThe AA B&B awards 2023\n\nAA Friendliest B&B of the Year - The Fylde International, Blackpool, Lancashire\n\nAA Inn of the Year - The Punch Bowl Inn & Restaurant, Crosthwaite, Cumbria\n\nAA Guest Accommodation of the Year for Wales - Parc-le-Breos House, Parkmill, Swansea\n\nAA Guest Accommodation of the Year for Scotland - The Crusoe, Leven, Fife\n\nAA Guest Accommodation of the Year for England - Market Cross Guest House, Belford, Northumberland\n\nAA Breakfast of the Year for England - The Holcombe, Holcombe, Somerset\n\nAA Breakfast of the Year for Wales - The Old Vicarage, Corris, Gwynedd\n\nAA Breakfast of the Year for Scotland - Craigadam, Castle Douglas, Dumfries & Galloway\n\nGet the very best of What's On in London straight to your inbox London has it all - the best nightlife, food, drink, events, markets, everything! But how do you keep on top of this? Our weekly What's On newsletter, Going Out Out, is how. You'll get a fully curated newsletter with the most exciting stories, reviews, previews and more every single week. And the best bit? It's completely FREE. All you have to do is sign up for Going Out Out here.\n\nTop 15 friendliest B&Bs for 2023\n\nRunner-up: The Chudleigh, Essex\n\nSouthpark House, Dumfries & Galloway\n\nBianca Guesthouse, Lancashire\n\nBraithwaite Hall Bed & Breakfast, North Yorkshire\n\nMarket Cross Guest House, Northumberland\n\nThe Auld Kirk, Aberdeenshire\n\nThe Edwardene, Cumbria\n\nThe Emsworth, Hampshire\n\nThe Firs Guesthouse, North Yorkshire\n\nTrefloyne Manor, Pembrokeshire\n\nLion House Bed and Breakfast, Devon\n\nKingston House Torquay, Devon\n\nHill View House, Dartmouth, Devon\n\nStone's Throw Cottage, Mevagissey, Cornwall\n\nYou can book to stay at the winners on Booking.com and Hotels.com.\n\nIs there a story you think we should be covering? If so, please email whatson@mylondon.news or at ellen.jenne@reachplc.com\n\nOur What's On newsletter, Going Out Out, features everything from the most exciting events to the new bars and restaurants in the capital. You can sign up HERE."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL3d3dy5wanN0YXIuY29tL3N0b3J5L25ld3MvMjAyMy8wNy8xNS9haXJibmItbmVhci1tZS11cy1iZXN0LWhvc3RzLWdhbGVuYS1pbC1haXItYi1uLWItYm9va2luZy1pbGxpbm9pcy1haXItYi1hbmQtYi1ob3RlbHMvNzA0MTMwNDEwMDcv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jul 2023 07:00:00 GMT",
        "title": "Airbnb shares most hospitable hosts in each U.S. state. Here's the best stay in Illinois - Peoria Journal Star",
        "content": "Airbnb unveiled the most hospitable hosts in every state, according to a recent news release.\n\nFor the second time, \"The Guest House\" owned by Jim and Josie in Galena, Ill., was named the most hospitable Airbnb host in Illinois. The stay previously won the honor in 2021.\n\nSocial media study:Illinois among country's top sinners for bad behavior, survey says\n\nPositioned at the edge of Galena's historic district, the property is located on a hill with an uphill walk when returning from town.\n\nThe stay goes for $143 per night and has a 4.99-star review out of 5 stars, citing 271 critiques. In fact, perfect scores are shown for all six categories including accuracy, check-in, cleanliness, communication, location and value.\n\n\"The Guest House\" offers one bathroom, one bedroom, a dedicated workspace, a kitchenette, a lit walkway to the private entrance, an outdoor patio, a private backyard and wifi. There are 46 amenities listed overall on the listing.\n\nMost hospitable Airbnb hosts in the U.S. by state\n\nMost hospitable Airbnb hosts methodology\n\nHere are the criteria used by Airbnb to find each state's most hospitable hosts:\n\n100% 5-star ratings in the check-in, cleanliness and communication.\n\nMinimum number of reviews set at 100.\n\nMany states had more than one host achieving such high standards. Tiebreakers went to the stay with the most reviews.\n\nHere are a few fun facts about the 2023 most hospitable hosts:\n\nCollectively, they have over 10,0005-star reviews across the three categories.\n\n20% host in more urban areas versus 80% who host in more rural areas.\n\n70% of the hosts live on the property where they host.\n\nChris Sims is a digital producer for the Journal Star. Follow him on Twitter: @ChrisFSims."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vd3d3Lm15bG9uZG9uLm5ld3Mvd2hhdHMtb24vd2hhdHMtb24tbmV3cy9hYS1iYnMtYXdhcmRzLTIwMjMtMjczMjA2NTfSAVBodHRwczovL3d3dy5teWxvbmRvbi5uZXdzL3doYXRzLW9uL3doYXRzLW9uLW5ld3MvYWEtYmJzLWF3YXJkcy0yMDIzLTI3MzIwNjU3LmFtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jul 2023 07:00:00 GMT",
        "title": "The best Bed and Breakfast stays in the UK named with second place just 90 mins from London - My London",
        "content": "The AA released their list of winners for their annual B&B awards, celebrating the very best of the UK’s bed and breakfasts and all they have to offer. The organisation announced the winners earlier this week, spanning eight different categories.\n\nB&Bs battled it out for the coveted titles in the Friendliest B&B of the Year; Inn of the Year; Guest Accommodation of the Year for England, Scotland and Wales; and Breakfast of the Year for England, Scotland and Wales categories. The AA revealed their winner of the Friendliest B&B of Year went to family-run The Fylde International in Blackpool, Lancashire. The runner up spot went to The Chudleigh in Clacton-on-Sea, Essex.\n\nAA Inn of the Year went to Cumbria’s The Punch Bowl Inn & Restaurant in Crosthwaite, while AA Guest Accommodation of the Year for England went to the Market Cross Guest House, Belford, Northumberland.\n\nREAD MORE: The 8 London restaurants named as the best for 2023 by the Good Food Guide\n\n(Image: Tripadvisor)\n\nVicky and Kate Easley, owners of The Fylde International, commented: “To say we are shocked is an understatement. We are very proud and humbled to have won the award. After owning and Managing The Fylde International Blackpool for the past 18 years this is an incredible achievement. Our customers are the forefront of our business, and we aim to provide them with excellent customer service, quality and clean accommodation and a homely atmosphere.\"\n\nMarket Cross Guest House’s owners Steve and Amanda White said: “Running Market Cross has always been more than just a business for us, it’s a lifestyle choice. This means everything we do and everything we offer to our guests is part of us. It’s who we are. We have always valued being part of the AA as it allows us to be assessed by the best in the industry and they're always there for advice and support. Winning this award is recognition of our passion and commitment.”\n\nBut not only is the accommodation situation, it’s also about the breakfast you get. The AA Inspector wrote of England’s winner, The Holcombe, Somerset: “Dating back to the 16th century, The Holcombe has views towards Downside Abbey. The attentive owners and pleasant staff create a friendly and relaxed atmosphere. Bedrooms are individually furnished and very comfortable. Real ales are served in the open-plan bar which has an attractive split-level restaurant.”\n\nOwners Caroline Gardiner and Alan Lucas, said: “We are thrilled to have received this award! The team are truly delighted, especially as breakfast is the last meal any guest remembers after they've checked out. It’s all about the finer details for us, like taking the time to source locally, and of course only the best ingredients! We use homegrown fruits on our delicious yoghurt, compote and granola pot, and reduce food wastage by asking guests to pre-order.”\n\nThe AA B&B awards 2023\n\nAA Friendliest B&B of the Year - The Fylde International, Blackpool, Lancashire\n\nAA Inn of the Year - The Punch Bowl Inn & Restaurant, Crosthwaite, Cumbria\n\nAA Guest Accommodation of the Year for Wales - Parc-le-Breos House, Parkmill, Swansea\n\nAA Guest Accommodation of the Year for Scotland - The Crusoe, Leven, Fife\n\nAA Guest Accommodation of the Year for England - Market Cross Guest House, Belford, Northumberland\n\nAA Breakfast of the Year for England - The Holcombe, Holcombe, Somerset\n\nAA Breakfast of the Year for Wales - The Old Vicarage, Corris, Gwynedd\n\nAA Breakfast of the Year for Scotland - Craigadam, Castle Douglas, Dumfries & Galloway\n\nGet the very best of What's On in London straight to your inbox London has it all - the best nightlife, food, drink, events, markets, everything! But how do you keep on top of this? Our weekly What's On newsletter, Going Out Out, is how. You'll get a fully curated newsletter with the most exciting stories, reviews, previews and more every single week. And the best bit? It's completely FREE. All you have to do is sign up for Going Out Out here.\n\nTop 15 friendliest B&Bs for 2023\n\nRunner-up: The Chudleigh, Essex\n\nSouthpark House, Dumfries & Galloway\n\nBianca Guesthouse, Lancashire\n\nBraithwaite Hall Bed & Breakfast, North Yorkshire\n\nMarket Cross Guest House, Northumberland\n\nThe Auld Kirk, Aberdeenshire\n\nThe Edwardene, Cumbria\n\nThe Emsworth, Hampshire\n\nThe Firs Guesthouse, North Yorkshire\n\nTrefloyne Manor, Pembrokeshire\n\nLion House Bed and Breakfast, Devon\n\nKingston House Torquay, Devon\n\nHill View House, Dartmouth, Devon\n\nStone's Throw Cottage, Mevagissey, Cornwall\n\nYou can book to stay at the winners on Booking.com and Hotels.com.\n\nIs there a story you think we should be covering? If so, please email whatson@mylondon.news or at ellen.jenne@reachplc.com\n\nOur What's On newsletter, Going Out Out, features everything from the most exciting events to the new bars and restaurants in the capital. You can sign up HERE."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LnRoZXRlbGVncmFwaGFuZGFyZ3VzLmNvLnVrL25ld3MvMjM2NTQxNjYuc3RheS1xdWVlbnMtaGVhZC1sYWtlcy12aWxsYWdlLWFza2hhbS1saWtlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jul 2023 07:00:00 GMT",
        "title": "We reviewed The Queen's Head Askham in the Lake District | Bradford Telegraph and Argus - Telegraph and Argus",
        "content": "The Queen’s Head in Askham is a cosy 17th Century bed and breakfast with its own restaurant.\n\nThe kitchen has been taken over by talented Sous Chef Anthony Amos, who serves up a tasting menu worthy of a Michelin star.\n\nSurrounded by fields and a small village shop, it is the perfect getaway for those searching for a moment of peace and quiet.\n\nA corner of the cosy room at The Queens Head (Image: Newsquest)\n\nThe Queen’s Head feels like a relaxing crackly, warm fire - and I just wish I knew about it sooner.\n\nThe attention to detail does not go unnoticed, whether it’s the generous food portions, candle-lit dinner tables, or traditional design with a modern twist.\n\nI love visiting the Lakes for its natural sense of calm and relaxation and I felt like I could breathe from the moment I arrived.\n\nAfter a scenic drive past the rugged mountains and quick stop off in Penrith, the Queen’s Head was the cherry on top.\n\nThe bathroom was topped up with beautiful scents - including bubble bath - and it wasn’t long before I filled the tiny tea pot up.\n\nThe restaurant at The Queens Head (Image: Newsquest)\n\nAdorned with artwork and little extras like an illuminated mirror, the room was a spacious, clean and truly special experience.\n\nWe sat outside in the evening sun with a tipple from bar before sitting down for our meal.\n\nIt was clear just how popular this place is with food lovers - booking is essential - there was not a single table left for a family of walk-ins.\n\nWe didn’t expect to eat quite so much food, so swiftly. Chefs put the stunning plates together delicately whilst making sure we had plenty to indulge in.\n\nHors d'oeuvres at The Queen's Head (Image: Newsquest)\n\nThe tasting menu offers three options per course as well as Canapés, a sweet, and tea or coffee.\n\nThe hors d'oeuvres included light, crispy monkfish fritters with tartar sauce, beer bread and butter, and parmesan-sprinkled goats cheese bruschetta with sweet pepper ketchup.\n\nFor starters, we ordered the St Andrews cheddar cheese souffle with summer truffle and soy glazed home reared saddleback pork fillet with turnip, chard, and cider sauce.\n\nThe souffle was fluffy with a generous serving of cheese sauce and truffle. Meanwhile the pork fillet was so tender it almost melted in the mouth.\n\nWye Valley asparagus, courgette, basil pesto, polenta and parmesan (Image: Newsquest)\n\nThe mains arrived shortly after our plates were cleared - Wye Valley asparagus, courgette, basil pesto, polenta and parmesan on one plate, Gigha halibut, shrimp potato salad, peas, samphire, and mace hollandaise on another.\n\nThe fish dish was so fresh and light while the vegetarian dish was something unique and a little unusual.\n\nBut the star of the show was the divine Lowther Honey tart with nectarine and vanilla ice cream.\n\nIt was out of this world, extremely refreshing to the taste buds, and perfect for summery adventures in the Lakes.\n\nLowther Honey tart with nectarine and vanilla ice cream (Image: Newsquest)\n\nWe also tucked into the Casa Luka organic chocolate, hazelnut and frangelico. It was a cooling ice cream dessert hidden underneath an outer layer of chocolate with crunchy peanut brittle.\n\nBy the time we’d finished the matcha macarons and a cup of tea and coffee, so began the heavenly hazy feeling that constitutes a food coma.\n\nThe menu has been expertly crafted by the new head chef, formerly the sous chef at the Michelin-starred ‘Allium at Askham Hall’.\n\nAnthony Amos’s culinary career began at just 13 years old before he perfected his talents as a sous chef.\n\nHis impressive CV includes cooking for the Italian senate and, in most recent years, working alongside Allium’s Head Chef Richard Swale.\n\nHailed as bringing an international flavour to his dishes, his creations were made even more special by making use of seasonal, local produce.\n\nBreakfast time at The Queen's Head (Image: Newsquest)\n\nWe spent the night exploring the nearby village but it is possible to walk to Askham Fell which provides views of Ullswater and Lowther Castle.\n\nI highly enjoyed our day trip to nearby Penrith, where we meandered through the historic town centre and spent time visiting independent shops filled with little treasures.\n\nIt was impossible not to buy a treat or two in the beautiful James & John Graham artisan bakery and deli.\n\nFull and sleepy, we headed back to our room to enjoy a hot drink and fall into a peaceful slumber.\n\nIt felt like being in the candle-lit, warm world of Pride & Prejudice or Bridgerton with windows overlooking cottages, tree-lined meadows, and a mountain’s silhouette.\n\nBreakfast was just as delightful to the senses as we were guided to our table past pastries and glass jars filled with yoghurt and fruit. Our meal of choice was the full English breakfast.\n\nIt is hard to describe just how special staff at The Queen’s Head made us feel - perhaps you’ll simply have to experience it for yourself.\n\nI'd never heard of Askham until our trip, but for those searching for a new Lakes destination and sense of inner peace, this charming pit stop is worthy of your next adventure."
    }
]