[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3QvYnliaXQtbGF1bmNoZXMtZmlyc3QtaWRvLWZvci13ZWIzY2FtcC1vbi1ibmItY2hhaW7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Jan 2023 08:00:00 GMT",
        "title": "Bybit Launches First IDO for Web3Camp on BNB Chain - BSC NEWS",
        "content": "BNB\n\nByBit will give BNB Chain users access to knowledge on new projects from both Ethereum and BNB Chain.\n\nBybit IDO for Web3Camp\n\nBybit has announced it will launch its first Initial Decentralized Exchange (DEX) Offering (IDO) on BNB Chain for Web3Camp.\n\nThe IDO will run for a week between January 11-18 on Bybit’s new Bystarter platform, according to a PR shared with BSC News. The IDO will give users first access to the new Web3 and blockchain knowledge transfer project from Bybit. Web3Camp will bring users up-and-coming projects to learn about on both Ethereum and BNB Chain.\n\n“Web3Camp is a Quiz-to-Earn ecosystem that incentivizes learners to continue their education and establishes a patron-style system for content contributors, tokenizing and actualizing the value of knowledge and providing an entry for newcomers to the Web3 community,” says the press release.\n\nWeb3Camp will be available through a mobile app with a non-custodial wallet feature. The mobile app will feature a suite of Web3 integrations facilitated through smart contracts and connections to the world’s third-most-visited cryptocurrency exchange.\n\nWhat is Bybit:\n\nBybit is a cryptocurrency exchange established in 2018 that offers a professional platform where crypto traders can find an ultra-fast matching engine, excellent customer service and multilingual community support. Bybit is a proud partner of Formula One’s reigning Constructors’ and Drivers’ champions, the Oracle Red Bull Racing team, esports teams NAVI, Astralis, Alliance, Made in Brazil (MIBR), and Oracle Red Bull Racing Esports, and association football (soccer) team Borussia Dortmund.\n\nWhere to find Bybit:\n\nWebsite | Twitter | LinkedIn | Telegram | Medium |"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvY3J5cHRvLXN0YXRlLW9mLXN0YWtpbmctaW4tamFudWFyeS0yMDIz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Jan 2023 08:00:00 GMT",
        "title": "Crypto: State of Staking in January 2023 - Watcher Guru",
        "content": "According to data from crypto staking data provider Staking Rewards, Polygon (MATIC) is the top staking asset in the first week of 2023. The firm noted that the network hit an all-time high for its staking balance of $3.55 billion. MATCI’s weekly inflow increased to $127.99 million, accounting for a 4.60% rise.\n\nState of Staking | 09.01.2023\n\n\n\n🧵👇 pic.twitter.com/2CPuaLGOd9 — Staking Rewards (@StakingRewards) January 9, 2023\n\nPolygon (MATIC) is closely followed by Ethereum (ETH), which had an inflow of $122.01 million, a 0.57% increase. The largest Altcoin may be in for a positive scenario as the imminent Shanghai upgrade dominates market attention.\n\nThe upgrade which is planned for March 2023, will greatly lower the risk associated with staking ETH. Furthermore, it will give liquidity staking platforms a chance to develop. Hence, as the anticipation grows, some of these protocols’ governance tokens are rallying over the past week.\n\nEthereum (ETH) is followed by Cardano (ADA), with an inflow of $78.20 million, a 1.1% increase. Additionally, Cardano (ADA) is one of the best-performing crypto projects this week, with a 17.6% rally in the last 24 hours, and 30.5% in the last week.\n\nCrypto projects with poor staking performance\n\nBinance Coin (BNB) has the highest outflows at the moment. The exchange’s native token witnessed outflows of $12.61 million, a 0.20% drop. However, BNB is still close to its ATH staking balance. Moreover, the reward rate decreases as the staking balance increase for BNB. Therefore, the reward rate has dropped to an all-time low of 2.4%.\n\nGMX had the second-highest outflow this week. The project witnessed outflows of $6.94 million, a 1.90% decrease. Lastly, GMX is followed by Flow and Radix, which witnessed outflow rates of 0.51% and 1.80%, respectively. At press time, the global crypto market cap stood at $884 Billion, up by 3.1% in the last 24 hours."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vOTJtb29zZS5mbS92aXNpdC10aGlzLXRyZWVob3VzZS13aXRoLWEtaG90LXR1Yi1vdmVybG9va2luZy1iYWJibGluZy1icm9vay_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Jan 2023 08:00:00 GMT",
        "title": "Visit This Treehouse with a Hot Tub Overlooking Babbling Brook - 92moose.fm",
        "content": "Air BnB posted a picturesque rental in the forest overlooking a babbling brook and it is located here in Maine.\n\nI had to share this because I am always looking for fun or romantic getaways to try out, locally. Staycations are where it's at right now and I don't know about you but I love uncovering the beauty within my own state. It's especially nice to visit new rivers, bodies of water and waterfalls and this rental has all of that.\n\nThe best part is that this incredible rental is located right in Norway, Maine!\n\nPicture yourself propping up in this hot tub watching the river flow as you close your eyes and listen to the rushing water. Talk about peaceful moments.\n\nAir BnB Air BnB loading...\n\nThe description of the rental is below and it will blow you away, The rushing water will flow right by your bedroom overlooking the most pristine, undeveloped river in Maine. This is a complete oasis with no one in sight. Complete privacy in the hot tub overlooking the Crooked River. Wall of windows with mirror tint. Hot tub and outdoor shower just outside the front door. Hammocks, to relax in or hiking trails to discover right out the front door. Enjoy at-home yoga or massage in the yoga shed overlooking the river. Air BNB This space includes 1 bedroom and 1 bathroom. Not to mention the bedroom overlooks the water, so when you awaken, you will be witnessing rushing water and waterfalls. Additionally, if you're planning on scheduling a visit for the summer because it's never too early to plan a summer weekend, they do offer a waterfall outside shower!\n\nThis is a one-of-a kind listing if you need to shut life out for a while and be one with nature and yourself.\n\nLet's call it, \"Winter in the Woods.\" While you soak in a hot tub watching the snow fall around you, renewing your spirit!\n\nThe listing is referred to as, \"Crooked Reflections, Riverside Retreat.\"\n\nIf you'd like to check out the entire retreat take a look at the gallery below!\n\nVisit This Maine Treehouse with a Hot Tub Overlooking A Picturesque Babbling Brook Need a staycation? Check out this picturesque treehouse rental with an outside hot tub, overlooking waterfalls and a babbling brook."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LnRoZXRlbGVncmFwaGFuZGFyZ3VzLmNvLnVrL25ld3MvMjMyMzQxMTAuZGVuaG9sbWVzLXN0LXBhdWxzLWNodXJjaC1ub3ctb3Blbi1zdHVubmluZy1iLWIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Jan 2023 08:00:00 GMT",
        "title": "Denholme's St Paul's Church now open as stunning B&B | Bradford Telegraph and Argus - Telegraph and Argus",
        "content": "Sean and Debs Kennedy-Tallis spent just under £500,000 on turning the dilapidated St Paul’s Church in Halifax Road, Denholme, into a four-bedroom home for themselves.\n\nIt is now valued at between £950,000 and £1m.\n\nThey bought the church in its original damaged state for just £85,000 at auction in September 2017. They also got married during the renovation project work.\n\nPart of the renovated church is now open as a B&B (Image: Newsquest)\n\nNow it has become what Mrs Kennedy-Tallis describes as a \"unique and opulent\" B&B.\n\nThey welcomed their first guests on New Year’s Eve and are now taking bookings for more people to experience their converted church surroundings.\n\nSt Paul's Church in Denholme has gone through a dramatic makeover (Image: Newsquest)\n\nA one-night stay for two people at the church is charged at £150 per night.\n\nIt is priced at £275 for two nights for two people, while three nights for two people costs £375.\n\nA sofa can convert into a small double bed which is priced at an additional £50 per person per night. All of the stays include a continental-style breakfast.\n\nThe couple's conversion project has been featured on BBC One’s Homes Under the Hammer, which gave an update on the home in an episode broadcast in June 2021.\n\nThey hope to carry out conversion work on the church’s bell tower in the future.\n\nHere's how St Paul's Church looked before (Image: Sean and Debs Kennedy-Tallis)\n\nDebs said she is happy that the church is now open for business as a B&B.\n\nShe said: “It’s a lovely place and I think we have done it really well.\n\n“We’re quite excited by it and it was nice to get the conversion done by New Year’s Eve.\n\n\"We spent just short of £500,000 on it.\n\nThe bathroom of the church which is open as a bed and breakfast (Image: Newsquest)\n\n“We did it all in stages really. We had a couple of open days before Christmas for people to have a look around it.\n\n“It’s in a church and staying here is opulent and unique.”\n\nThe Grade II-listed church was built in 1846 and closed in 1999 due to dry rot.\n\nIt remained untouched until Sean and Debs started their work on it.\n\nAnother image inside the bed and breakfast section of the converted Gothic church (Image: Newsquest)\n\nThe church also features a graveyard which has been tidied up as part of the project.\n\nTo stay as a guest at St Paul's, or for more information, call Sean on 07552 494847 or Debs on 07836 799437. You can also send a private message to The Restoration and Conversion of the Church of St Paul Denholme Facebook page.\n\nHave you got a story for us? Email newsdesk@telegraphandargus.co.uk or contact us here.\n\nFollow us on Facebook, Twitter and Instagram to keep up with all the latest news.\n\nSign up to our newsletter to get updates sent straight to your inbox.\n\nYou can also call us on 01274 705292."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2JpbmFuY2Utc2Vlcy0xMmItd2l0aGRyYXduLWluLTYwLWRheXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Jan 2023 08:00:00 GMT",
        "title": "Binance sees $12B withdrawn in 60 days - CryptoSlate",
        "content": "Binance has experienced a significant outflow of assets in the past two months, a recent report from Forbes found.\n\nForbes analysts dove deep into Binance’s wallets and found that the exchange saw around $12 billion of outflows since November.\n\nAside from the massive outflows, the report finds the discrepancy between reports of Binance’s holdings troubling. A lack of consensus among analytics platforms led Forbes to worry about foul play within the exchange, as some reports showed gaps of several billion dollars in Binance’s wallets.\n\nHowever, the report only briefly addresses the state of the broad crypto market and underestimates its effect on Binance’s holdings.\n\nDiscrepancies in Binance’s asset reports\n\nEarlier in December, Binance made news as on-chain data showed the exchange lost $3 billion of assets in a single week. The exchange saw 4% of its total asset balance withdrawn, sending the market into a frenzy. At the time, Binance’s CEO Changpeng Zhao assured customers that the withdrawal amount wasn’t even among the exchange’s five largest and that there was no cause for concern.\n\nA Forbes report found that the exchange lost 15% of its assets since then. The exchange’s balance of BNB, its native token, was slashed in half since November. The number of BUSD stablecoins sitting on the exchange also decreased by 40%. Forbes noted that MATIC, APE, and GALA balances on the exchange also dropped between 40% and 50%.\n\nAggregating data from various crypto data firms showed that almost a quarter of Binance’s assets were drained from the exchange since the beginning of November.\n\nAccording to CoinMarketCap, around 31% of Binance’s total assets sat in BNB on Jan. 4. This is significantly higher than the amount Binance disclosed in its November transparency report. However, Forbes believes that the 57 million BNB tokens reported by CoinMarketCap are “questionable.”\n\nNamely, the number contrasts sharply with the number of BNB identified by Nansen, DefiLlama, and Arkham, which range from 22 million to 40 million tokens. Forbes’ own analysis of Etherscan found only 16 million BNB on the exchange.\n\nAround 40% of Binance’s BUSD balance also left the exchange since November. The discrepancy between the data provided by analytics firms led Forbes to believe that Binance itself reported holding several billion BUSD less than the numbers provided by Nansen and DefiLlama.\n\nThe report also found discrepancies in Binance’s BTC holdings. The number of tokens held by the exchange varied from 287,000 BTC to as much as 577,000 BTC. Analysis company CER.LIVE reportedly identified $9.6 billion in BTC in Binance’s wallets, which is more than twice the amount shown both by Glassnode and CoinMarketCap.\n\nForbes’ own estimate that Binance holds 4.49 million ETH is much higher than numbers shown on other platforms — CoinMarketCap estimates the exchange only holds around 2.58 million ETH.\n\nYou win some, you lose some\n\nHowever, it’s important to note that Binance hasn’t only been bleeding assets since November.\n\nWhile the exchange lost a significant number of BUSD, it saw its USDT and USDC balances double during the same period. The exchange now holds a combined $6.27 billion worth of the two stablecoins.\n\nForbes dismissed the possibility of Binance’s outflows being a result of broader market turmoil. Its analysis looked at exchanges with publicly available proof of funds and found that Binance saw the most outflows in the past 30 days. Other large market players such as Crypto.com, Bitfinex, Huobi, Bitmex, and OKEX saw only single-digit changes in their assets.\n\n“The situation indicates that there are trust issues concerning Binance, and its position as the largest crypto market raises the possibility of contagion should those prove well funded,” Forbes noted.\n\nThe publication concluded that the exchange is experiencing a “soft run on the bank” and that there is a possibility the run could intensify.\n\nThe possibility of Binance seeing a devastating bank run certainly is there. However, the Forbes report failed to address Binance’s size and hasn’t contributed the scale of its outflows to the number of users it services. It also doesn’t consider the volumes Binance handles — having a similar percentage of users withdraw assets from a smaller exchange would result in a much smaller total sum of outflows.\n\nThere is also the case of its rising USDT and USDC balances. A decrease in its BUSD and BNB holdings could be a result of its users swapping the exchange’s own tokens into less volatile and much larger stablecoins.\n\nMentioned in this article"
    }
]