[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY2FuYWxzb2xhci5jb20uYnIvZW4vYnVzY2EtcG9yLWNyZWRpdG8tbm8tYm5iLXBhcmEtc29sYXItcmVzaWRlbmNpYWwtY3Jlc2NlLTU1LWVtLTIwMjIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Mar 2023 07:00:00 GMT",
        "title": "Busca por crédito para solar residencial cresce 55% no BNB - Canal Solar",
        "content": "To the operations of BNB (Banco do Nordeste) for financing of systems solar energy in homes grew 55% in 2022 compared to the same period of the previous year.\n\nAccording to a report released by the financial institution, the number of customers who took out credit from the company went from 3,428 to 5,335 from one year to the next, which demonstrates a greater search for self-generation.\n\nYou contracted values also showed an increase in the comparison between the two periods. In 2021, R$ 113 million was financed, while in 2022 there were R$ 184 million – a high of the order of 62%.\n\nThe operations and values match to all line hiring FNE Sol Physical person, carried out in BNB's area of operation and which encompasses the nine states of North East and the northern regions of Minas Gerais It's from Holy Spirit.\n\nAccording to the president of BNB, José Gomes da Costa, in addition to the population's natural interest in implementing technology, some changes made in the last year by the institution would have helped to improve the numbers, such as the digitalization of the credit contracting, consultation and approval process. . .\n\n“We started to adopt the access opinion made by energy concessionaires, replacing three documentation that were previously required, which are technical feasibility, equipment certification and the technical inspection itself. In other words, we maintained security in operations, but reduced bureaucracy”, he said.\n\nAvailable resources\n\nO president of the institution highlighted even if are available for 2023 about R$ 186 million for new operations. “We believe that we will hire even more, as in January and February alone we already financed R$ 34 million. This is almost 20% of the target for the year”, he revealed.\n\nThe financing line FNE Sol uses FNE resources (Constitutional Financing Fund of the Northeast) in supporting the acquisition of systems for distributed micro and mini generation of energy from renewable sources for the borrower's own consumption or intended for rental.\n\nThe generating plants that can be installed through this credit must have an installed power of less than or equal to 75 kW (microgeneration) or greater than 75 kW and less than or equal to 5 MW (minigeneration), according to BNB."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL3p5Y3J5cHRvLmNvbS94cnAtd2lsbC1nZXQtcmVsaXN0ZWQtb24tY29pbmJhc2UtaW1tZWRpYXRlbHktYWZ0ZXItcmlwcGxlcy12aWN0b3J5LW92ZXItc2VjLWV4Y2hhbmdlcy1jaGllZi1sZWdhbC1vZmZpY2VyLWhpbnRzL9IBigFodHRwczovL3p5Y3J5cHRvLmNvbS94cnAtd2lsbC1nZXQtcmVsaXN0ZWQtb24tY29pbmJhc2UtaW1tZWRpYXRlbHktYWZ0ZXItcmlwcGxlcy12aWN0b3J5LW92ZXItc2VjLWV4Y2hhbmdlcy1jaGllZi1sZWdhbC1vZmZpY2VyLWhpbnRzLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Mar 2023 07:00:00 GMT",
        "title": "XRP Will Get Relisted On Coinbase Immediately After Ripple’s Victory Over SEC, Exchange’s Chief Legal Officer Hints - ZyCrypto",
        "content": "Advertisement\n\nIf Ripple wins the case against the U.S. Securities and Exchange Commission (SEC), a relisting of the coin on America’s largest cryptocurrency exchange could ensue.\n\nCoinbase chief legal officer Paul Grewal has delved into the possibility of relisting XRP in a recent interview.\n\nWill Coinbase Relist XRP Promptly?\n\nWhen the SEC filed its suit in December 2020, many pundits and observers felt it was a death knell for XRP, as the token was delisted from most crypto exchanges globally, including Coinbase. At the time, Coinbase said the move was motivated by its Digital Assets Framework policy, which assesses factors like securities compliance.\n\nSpeaking to Tony Edward — host of the Thinking Crypto podcast, Coinbase’s chief legal officer Paul Grewal acknowledged that this delisting had been a constant source of frustration for XRP fans.\n\nWhen asked whether Coinbase is planning to relist XRP after the court’s ruling in the SEC v. Ripple lawsuit, Grewal noted that it would depend on the grounds of the ruling, the judge’s legal reasoning, and the exchange’s assessment of whether or not the apex court would uphold the decision.\n\nAdvertisement\n\n“So a lot is going to depend on the particulars of that court rules. I know that’s not going to be terribly satisfying to some, but we do have a responsibility as a publicly listed company to tread carefully in this area and with respect to any token that’s a subject of federal court litigation,” the CLO explained.\n\nHe, however, assured XRP holders that Coinbase would immediately begin the review process as soon as the ruling was made.\n\n“But I am very eager as anyone else to see how the court rules and what I can say, as soon as we have the ruling, we will put in our process to see if we need to revisit our listing decision.”\n\nCoinbase Exec Praises Ripple’s Attorneys Ahead Of Crucial Court Ruling\n\nYou might recall that Coinbase petitioned a federal court for permission to back Ripple’s case against the SEC.\n\nIn his latest interview, Paul Grewal commended the incredible work of Ripple’s legal team. “I certainly paid attention to the fact that the defendants in this case have done a masterful job of pushing the SEC and raising serious questions about the SEC’s entire theory,” the CLO posited.\n\nGrewal revealed that these efforts by Ripple’s chief legal officer Stuart Alderoty and others at the San Francisco-based payments firm prompted Coinbase to file a friend of the court (“amicus”) brief in the long-standing suit between the XRP progenitor and the SEC.\n\nLike most people in the crypto community, Grewal is impatiently awaiting a decision in the case, and he is optimistic that the judge will rule in Ripple’s favour.\n\nRipple CEO Brad Garlinghouse previously speculated that the suit could be wrapped up by June but admitted that is only a guess."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3LnRoZXN1bi5jby51ay90cmF2ZWwvMjE3MjUyNDIvaG90ZWwtY3JpbWUtc2NlbmUtYm9nb3RhLWNvbG9tYmlhL9IBT2h0dHBzOi8vd3d3LnRoZXN1bi5jby51ay90cmF2ZWwvMjE3MjUyNDIvaG90ZWwtY3JpbWUtc2NlbmUtYm9nb3RhLWNvbG9tYmlhL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Mar 2023 07:00:00 GMT",
        "title": "The hotel room ‘crime scene’ that is shocking some holidaymakers – but it’s not what it seems... - The Sun",
        "content": "SCARE BNB The hotel room ‘crime scene’ that is shocking some holidaymakers – but it’s not what it seems\n\nHOLIDAYMAKERS have been left horrified after stumbling across a \"crime scene\" in a four-star hotel.\n\nTravellers discovered the seemingly alarming sight while\n\nsearching for accommodation with travel site Expedia.\n\n2 Some users thought the pattern on the rug of the king suite looked like a \"crime scene\" Credit: Expedia\n\nA photograph of the serviced ‘King Suite’ in Bogota, Colombia shows a neutrally-decorated lounge area and kitchenette.\n\nIn the middle of the shot, however, there is a black coffee table and\n\nwhat appears to be large and suspicious stain splattered all over the\n\nfloor.\n\nBut it is not what it seems.\n\nThe ‘stain’ is actually the pattern on a cream rug - yet it is was\n\nenough to catch the eye of dozens of shocked travellers on Facebook.\n\nUnder an ad for the hotel, one stunned person wrote: “Why does this\n\nlook like a crime scene?!”\n\nSomeone else replied: “I thought that too. Fire damage? Shooting?\n\nTable trashed?!”\n\nA third chipped in: “Crime scene rug, a floating worktop and sink,\n\nwhat other secrets are you hiding in this room?”\n\nAnd a fourth admitted: “I’ve zoomed in and still can’t work out what’s\n\nhappened!”\n\nThe King Suite is one of several accommodation options on offer at a\n\nhotel called HotelCity Flats in Colombia’s capital Bogotá.\n\nBooking prices for in the King Suite start at £88-per-night.\n\nSleeping up to three guests, it comes with a 42-inch TV, a kingsize\n\nbed, single sofa bed free WiFi and a desk and ironing board.\n\nDespite the suspect photograph, travellers have rated HotelCity fans\n\n9.2 out of 10 on Expedia.\n\nOne review positively reads: “Cosy and very clean. Breakfast was very\n\ngood. Location excellent. Definitely I recommend this hotel.”\n\nAnother person added: “The city Flats Hotel in Bogota in Zona Rosa is\n\none of the best hotels I have ever stayed at.\n\n“While it may not be the fanciest hotel or have the most amenities,\n\nthe staff and service were exceptional.”\n\nElsewhere, a casino hotel recently caused a stir when a guest claimed its carpets looked like they were covered in blood.\n\nThe gambler had arrived for a short stay and a flutter, but was disturbed at what they saw as a bizarre interior design option.\n\nThey shared a picture of the strange flooring on Reddit, to show other people exactly how bizarre it was.\n\nThey wrote: \"The casino hotel I stayed at a few days ago went with blood stained circuit board as its carpet pattern.\"\n\nThe room in the casino and the one in Bogota might have ended up being nicer than the crime scene some they were, but other hotels turn out to be a lot worse than they appear online.\n\nOne guest almost ended up in a crime scene, after he got a room with what he described as \"the worst view in the world\".\n\nComedian Neema Naz was staying in a hotel in Alberta, Canada when he made the horrifying discovery.\n\nHe said in a video he shared on TikTok: \"I'm in my hotel room and I was like 'wow, my blinds are closed - let me get some fresh light in here.'\n\n\"To then realise, this is my view - the ladies changing room, with a pool with kids in it.\n\n\"How about let me close the blinds actually so I don't get a peeping tom charge.\"\n\nHe added: \"This is a terrible place to have a window.\"\n\nMeanwhile, this could be Britain's worst hotel, with reviews calling it a \"hell hole\".\n\nAnd these are some of the worst hotels in the world, according to review site TripAdvisor."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDMvMTcvY3J5cHRvLXVuaXN3YXAtYXJyaXZlcy1iaW5hbmNlLWJuYi1jaGFpbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Mar 2023 07:00:00 GMT",
        "title": "Crypto: Uniswap arrives on Binance BNB Chain - The Cryptonomist",
        "content": "Important crypto news today: the largest DEX in existence, Uniswap, will officially offer its services on Binance’s BNB Chain, overcoming controversy over the “bridge issue.” Full details below.\n\nAs a reminder, Uniswap was born in 2018 on the Ethereum network, from the brilliant mind of Hayden Adams. Today, it is the most widely used decentralized exchange (DEX) and enables the exchange of cryptocurrencies on its platform through an automatism called ‘Automatic Market Maker’ (AMM), a new type of token exchange that takes place within DEXs.\n\nUniswap offers its crypto services on Binance’s BNB chain\n\nWorld’s largest decentralized exchange by trading volume, Uniswap, has been officially released on the BNB Chain, and will now be able to offer its services on the chain founded by exchange Binance.\n\nThe move came about following a governance proposal last February, and, before it came to fruition, a major debate had to be overcome around the “bridge” to be implemented.\n\nThe proposal was made because of Uniswap’s need to expand its reach and potentially drive further growth and adoption of DeFi.\n\nWith this opening to the BNB chain, Uniswap protocol users will be able to take advantage of the low fees of the new ecosystem, which is much cheaper than the Ethereum network.\n\nIn fact, according to the announcement, expansion to the BNB Chain offers several benefits, including user growth, lower fees, and access to new geographic markets.\n\nAlvin Kan, BNB Chain’s director of development, said the following on the matter:\n\n“With the community, scalability, and simple accessibility of the BNB Chain, the operation can be a stepping stone to all things web3 for protocols looking to reach a wider audience to thrive.”\n\nIndeed, Uniswap is constantly striving to provide value to its users and to build for the future of decentralization.\n\nUniswap on Binance’s BNB chain: more share in the DeFi market\n\nIn February, the governance proposal to implement Uniswap v3 on BNB Chain was approved with more than 55 million UNI token holders voting in favor.\n\nAt the time, Uniswap could have sought to capture up to 50% of the market share of PancakeSwap, the leading DEX on BNB Chain with a Total Locked Value (TVL) of $2.5 billion.\n\nThe implementation of Uniswap on BNB Chain also means capturing a larger share in the DeFi market, and marks a significant step toward improving accessibility for users.\n\nUltimately, Wormhole was chosen as the protocol’s designated bridge after a controversial governance vote that had pitted one party against the other and, more importantly, two of the venture capital firms most active in the debate, namely Andreessen Horowitz and Jump Crypto.\n\nVC firm A16z had actually leveraged its considerable UNI holdings by voting against the proposal to choose Wormhole, questioning whether the protocol was truly decentralized.\n\nPreviously, Wormhole had been chosen as the Protocol’s designated bridge for BNB Chain following a vote for Temperature Check. Temperature Check is a process to determine if there is sufficient desire to make changes to the status quo.\n\nUniswap and its recent problems with Apple\n\nUniswap Labs recently announced plans to release a new self-customized mobile wallet that will offer users the ability to swap over layer-1 or layer-2 networks without having to change blockchains.\n\nAccording to Uniswap Labs, the wallet will allow users to check price charts and search for any token on various networks, including Ethereum, Polygon, Arbitrum, and Optimism. To ensure maximum security, Uniswap Labs has partnered with Trail of Bits to audit the wallet.\n\nIn addition, the seed phrases and private keys of imported and newly created wallets will be encrypted and stored on the devices using Apple‘s Secure Enclave, which is excluded from device backups.\n\nUniswap also reported that users will be able to manually store their seed phrases with a hard copy or encrypt and store them on iCloud.\n\nHowever, even though the first version was approved in October, Uniswap Labs had problems with Apple’s App Store regarding its mobile wallet.\n\nIn fact, despite the approval of other self custody swapping wallets, the final build of Uniswap’s mobile wallet was rejected by Apple just days before its planned December 2022 launch.\n\nUniswap Labs said it has responded to Apple’s objections, all of its questions, and reiterated that it complies with its guidelines. However, Apple has not yet given the green light to launch and Uniswap Labs remains in limbo.\n\nAs a result, it is offering early access to a few thousand Testflight users while waiting for Apple to approve the launch."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDMvMTcvY3J5cHRvLXVuaXN3YXAtYXJyaXZlcy1iaW5hbmNlLWJuYi1jaGFpbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Mar 2023 07:00:00 GMT",
        "title": "Crypto: Uniswap arrives on Binance BNB Chain - The Cryptonomist",
        "content": "Important crypto news today: the largest DEX in existence, Uniswap, will officially offer its services on Binance’s BNB Chain, overcoming controversy over the “bridge issue.” Full details below.\n\nAs a reminder, Uniswap was born in 2018 on the Ethereum network, from the brilliant mind of Hayden Adams. Today, it is the most widely used decentralized exchange (DEX) and enables the exchange of cryptocurrencies on its platform through an automatism called ‘Automatic Market Maker’ (AMM), a new type of token exchange that takes place within DEXs.\n\nUniswap offers its crypto services on Binance’s BNB chain\n\nWorld’s largest decentralized exchange by trading volume, Uniswap, has been officially released on the BNB Chain, and will now be able to offer its services on the chain founded by exchange Binance.\n\nThe move came about following a governance proposal last February, and, before it came to fruition, a major debate had to be overcome around the “bridge” to be implemented.\n\nThe proposal was made because of Uniswap’s need to expand its reach and potentially drive further growth and adoption of DeFi.\n\nWith this opening to the BNB chain, Uniswap protocol users will be able to take advantage of the low fees of the new ecosystem, which is much cheaper than the Ethereum network.\n\nIn fact, according to the announcement, expansion to the BNB Chain offers several benefits, including user growth, lower fees, and access to new geographic markets.\n\nAlvin Kan, BNB Chain’s director of development, said the following on the matter:\n\n“With the community, scalability, and simple accessibility of the BNB Chain, the operation can be a stepping stone to all things web3 for protocols looking to reach a wider audience to thrive.”\n\nIndeed, Uniswap is constantly striving to provide value to its users and to build for the future of decentralization.\n\nUniswap on Binance’s BNB chain: more share in the DeFi market\n\nIn February, the governance proposal to implement Uniswap v3 on BNB Chain was approved with more than 55 million UNI token holders voting in favor.\n\nAt the time, Uniswap could have sought to capture up to 50% of the market share of PancakeSwap, the leading DEX on BNB Chain with a Total Locked Value (TVL) of $2.5 billion.\n\nThe implementation of Uniswap on BNB Chain also means capturing a larger share in the DeFi market, and marks a significant step toward improving accessibility for users.\n\nUltimately, Wormhole was chosen as the protocol’s designated bridge after a controversial governance vote that had pitted one party against the other and, more importantly, two of the venture capital firms most active in the debate, namely Andreessen Horowitz and Jump Crypto.\n\nVC firm A16z had actually leveraged its considerable UNI holdings by voting against the proposal to choose Wormhole, questioning whether the protocol was truly decentralized.\n\nPreviously, Wormhole had been chosen as the Protocol’s designated bridge for BNB Chain following a vote for Temperature Check. Temperature Check is a process to determine if there is sufficient desire to make changes to the status quo.\n\nUniswap and its recent problems with Apple\n\nUniswap Labs recently announced plans to release a new self-customized mobile wallet that will offer users the ability to swap over layer-1 or layer-2 networks without having to change blockchains.\n\nAccording to Uniswap Labs, the wallet will allow users to check price charts and search for any token on various networks, including Ethereum, Polygon, Arbitrum, and Optimism. To ensure maximum security, Uniswap Labs has partnered with Trail of Bits to audit the wallet.\n\nIn addition, the seed phrases and private keys of imported and newly created wallets will be encrypted and stored on the devices using Apple‘s Secure Enclave, which is excluded from device backups.\n\nUniswap also reported that users will be able to manually store their seed phrases with a hard copy or encrypt and store them on iCloud.\n\nHowever, even though the first version was approved in October, Uniswap Labs had problems with Apple’s App Store regarding its mobile wallet.\n\nIn fact, despite the approval of other self custody swapping wallets, the final build of Uniswap’s mobile wallet was rejected by Apple just days before its planned December 2022 launch.\n\nUniswap Labs said it has responded to Apple’s objections, all of its questions, and reiterated that it complies with its guidelines. However, Apple has not yet given the green light to launch and Uniswap Labs remains in limbo.\n\nAs a result, it is offering early access to a few thousand Testflight users while waiting for Apple to approve the launch."
    }
]