[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vY29pbmdhcGUuY29tL2JpdGNvaW4tYnRjLWNhbi1mb3JtLWEtZ29kLWNhbmRsZS1pZi1iaW5hbmNlLXNodXRzLXdpdGhkcmF3YWxzL9IBWGh0dHBzOi8vY29pbmdhcGUuY29tL2JpdGNvaW4tYnRjLWNhbi1mb3JtLWEtZ29kLWNhbmRsZS1pZi1iaW5hbmNlLXNodXRzLXdpdGhkcmF3YWxzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 23 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC) Can Form A God Candle If Binance Shuts Withdrawals - CoinGape",
        "content": "Major FUD has struck the crypto market as controversy triggers around the world’s largest cryptocurrency exchange Binance. Latest reports suggest that Binance is struggling to maintain its position amid current regulatory developments and has been selling Bitcoins in order to abate the BNB price drop.\n\nEarlier this week on Tuesday, the BNB price tanked under $210 levels with its year-to-date losses extending above 30%. There’s a fear brewing in the crypto space that an FTX-like situation could pan out with Binance if the BNB price crashes further.\n\nadvertisement\n\nAmid these developments, the Bitcoin price is also witnessing some selling pressure with a push under $26,000. Crypto analyst Mike Alfred suggests that if Binance were to suspend withdrawals, Bitcoin can actually bounce back strongly forming a god candle. He wrote:\n\n“CZ is dumping Bitcoin again today trying to hold up the value of BNB. It’s not working. BNB is bleeding out. I expect a $200 break, potentially within 48 hours. After Binance shuts withdrawals for all customers, BTC will rally. Could even see a God candle. Will be fun”.\n\nBinance (BNB) Coin to Drop Under $200?\n\nThe BNB price has bounced back from yesterday’s low of $205. As of press time, Binance (BNB) Coin is up 2.5% trading at $213 with a market cap of $32.9 billion.\n\nBut analyst Alfred believes that the BNB price can further drop under $200. He said: “Hard BNB bounce at $204 back over $205 and the BTC sell pressure magically relents. CZ’s affiliated market makers are not doing a very good job masking this behavior. It’s too obvious”.\n\nOther market players have also joined in the Binance criticism. Popular trader Peter Brandt wrote: “I have stated for years that CZ and @binance is a global scam and $BNB just a cheap fiat. Watch it all unravel”.\n\nIt’s too early to say anything at this moment, however, the crypto market is awaiting an assurance from Binance chief Changpeng Zhao who has yet to comment on the developments."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvYm5iLXByaWNlLWFuYWx5c2lzLWRpcC10by0yMDAtcGVyZmVjdC1idXktb3ItYS1iZWFyaXNoLWFjdC1pbi1wbGF5L9IBZGh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvYm5iLXByaWNlLWFuYWx5c2lzLWRpcC10by0yMDAtcGVyZmVjdC1idXktb3ItYS1iZWFyaXNoLWFjdC1pbi1wbGF5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 23 Aug 2023 07:00:00 GMT",
        "title": "BNB Price Analysis: Dip to $200 Perfect Buy or a Bearish Act in Play? - CoinGape",
        "content": "The Binance coin has been in aggressive correction mode since August’s second week. From a high of $248, the coin’s market value tumbled 16.7% and reached the current trading price of $206. This high momentum breakdown has recently breached the monthly support of $200, indicating that crypto holders may witness further downfall. Should you sell on this?\n\nAlso Read: Venus Protocol Faces Binance Coin (BNB) Liquidation Risk\n\nadvertisement\n\nBinance Coin Daily Chart: Key Points\n\nThe $220 support breakdown sets altcoin for a 10% drop\n\nA bullish breakout from the overhead resistance will signal a change in market sentiment.\n\nThe intraday trading volume in the BNB coin is $545.4 Million, indicating a 30% loss\n\nSource- Tradingview\n\nAmid increasing bearishness in the crypto market, the BNB price gave a massive breakdown from the $220 support on August 17th. After a minor retest phase, the coin price tumbled 6.7% in the last three days and currently exchange hands at $206.\n\nHowever, the daily time frame chart shows no significant support before the $200 level indicating the BNB price posed for another 10%. The buyers will retest this support after a year and should provide a strong footing for potential investors.\n\nWhile the selling momentum is aggressive it’s too early to expect a reversal from the aforementioned support. However, for interested traders, a better confirmation for a recovery rally or trend reversal would be a breakout from the overhead trendline.\n\nCan Binance Coin Recovery Back to 350?\n\nThe daily time frame chart, a descending trendline has marked the current correction trend in BNB price. The altcoin has turned down thrice from the resistance trendline indicating the traders are aggressively following selling at bullish bounces. Thus a bullish breakout from the barrel could bolster buyers for the first $350\n\nBollinger Band: The BNB price challenging the lower band Bollinger Band indicator reflects high momentum selling among trades.\n\nRelative Strength Index: The daily RSI slope at the oversold region indicates a high possibility for a bullish reversal."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ibmItdG9rZW4tc3R1bWJsZXMtMS1sb3ctMTgxMjIwMzI4Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 23 Aug 2023 07:00:00 GMT",
        "title": "BNB Token Stumbles to 1-Year Low Amid Mounting Scrutiny Over Binance - Yahoo Finance",
        "content": "BNB dropped to $204 as the WSJ reported that Binance helped Russian users move money abroad.\n\nMounting legal and regulatory scrutiny over the exchange and a large distressed BNB-secured loan has weighed on the token’s price.\n\nSome observers allege that Binance might be selling bitcoin to keep BNB price afloat.\n\nBNB, a cryptocurrency closely linked to crypto exchange Binance, fell to its lowest in more than a year following a news report regarding fresh risks over Russia sanctions added to already mounting regulatory and legal pressure on the company.\n\nThe token sank to as low as $204 earlier Tuesday afternoon, its weakest level since June 2022's crypto market crash. It's since pared some of those losses, currently changing hands at $205, down about 14% over the past week.\n\nThis latest decline happened after the Wall Street Journal reported that Binance was facilitating Russian users' ability to move money abroad despite widespread international sanctions.\n\nThe exchange was already facing sprawling regulatory scrutiny around the globe, including a lawsuit from the U.S. Securities and Exchange Commission (SEC) for multiple federal securities laws violations such as commingling customer funds and listing unregistered securities like BNB and Binance USD on the platform.\n\nRisks around Binance weigh heavily on BNB, which is the fourth largest cryptocurrency with $32 billion market value and powers the BNB Chain network, formerly known as Binance Smart Chain.\n\nIs Binance selling bitcoin (BTC) to support BNB price?\n\nFurther price declines could potentially impact the broader crypto markets, as some market observers have long alleged that Binance might attempt to prop up the token’s value by selling bitcoin (BTC). The exchange’s CEO, Changpeng “CZ” Zhao has previously denied such rumors.\n\nAlongside BNB's drop this afternoon, the price of bitcoin (BTC) also declined to session lows below $25,800.\n\nA looming liquidation of a crypto loan secured by $130 million worth of BNB on decentralized finance protocol Venus also adds pressure to the token’s price. BNB Chain is coordinating with Venus to dismantle the loan in an orderly fashion to avoid “cascading liquidation” and “unnecessary damage to the market,” according to a Venus governance vote.\n\nThe BNB Chain developer team liquidated a $30 million chunk of the outstanding debt on Monday, which somewhat helped ease liquidation risks, CoinDesk reported. Following the partial liquidation, BNB Chain received $30 million USDT from a Binance wallet, blockchain data on Arkham Intelligence shows."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ibmItdG9rZW4tc3R1bWJsZXMtMS1sb3ctMTgxMjIwMzI4Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 23 Aug 2023 07:00:00 GMT",
        "title": "BNB Token Stumbles to 1-Year Low Amid Mounting Scrutiny Over Binance - Yahoo Finance",
        "content": "BNB dropped to $204 as the WSJ reported that Binance helped Russian users move money abroad.\n\nMounting legal and regulatory scrutiny over the exchange and a large distressed BNB-secured loan has weighed on the token’s price.\n\nSome observers allege that Binance might be selling bitcoin to keep BNB price afloat.\n\nBNB, a cryptocurrency closely linked to crypto exchange Binance, fell to its lowest in more than a year following a news report regarding fresh risks over Russia sanctions added to already mounting regulatory and legal pressure on the company.\n\nThe token sank to as low as $204 earlier Tuesday afternoon, its weakest level since June 2022's crypto market crash. It's since pared some of those losses, currently changing hands at $205, down about 14% over the past week.\n\nThis latest decline happened after the Wall Street Journal reported that Binance was facilitating Russian users' ability to move money abroad despite widespread international sanctions.\n\nThe exchange was already facing sprawling regulatory scrutiny around the globe, including a lawsuit from the U.S. Securities and Exchange Commission (SEC) for multiple federal securities laws violations such as commingling customer funds and listing unregistered securities like BNB and Binance USD on the platform.\n\nRisks around Binance weigh heavily on BNB, which is the fourth largest cryptocurrency with $32 billion market value and powers the BNB Chain network, formerly known as Binance Smart Chain.\n\nIs Binance selling bitcoin (BTC) to support BNB price?\n\nFurther price declines could potentially impact the broader crypto markets, as some market observers have long alleged that Binance might attempt to prop up the token’s value by selling bitcoin (BTC). The exchange’s CEO, Changpeng “CZ” Zhao has previously denied such rumors.\n\nAlongside BNB's drop this afternoon, the price of bitcoin (BTC) also declined to session lows below $25,800.\n\nA looming liquidation of a crypto loan secured by $130 million worth of BNB on decentralized finance protocol Venus also adds pressure to the token’s price. BNB Chain is coordinating with Venus to dismantle the loan in an orderly fashion to avoid “cascading liquidation” and “unnecessary damage to the market,” according to a Venus governance vote.\n\nThe BNB Chain developer team liquidated a $30 million chunk of the outstanding debt on Monday, which somewhat helped ease liquidation risks, CoinDesk reported. Following the partial liquidation, BNB Chain received $30 million USDT from a Binance wallet, blockchain data on Arkham Intelligence shows."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vZm9ya2FzdC5uZXdzL3NvbC1mYWxscy1zaXgtd2Vlay1sb3ctYm5iLWJpZ2dlc3QtZ2FpbmVyLXJlcG9ydHMtYmluYW5jZS12aW9sYXRpbmctcnVzc2lhbi1zYW5jdGlvbnMv0gFvaHR0cHM6Ly9mb3JrYXN0Lm5ld3Mvc29sLWZhbGxzLXNpeC13ZWVrLWxvdy1ibmItYmlnZ2VzdC1nYWluZXItcmVwb3J0cy1iaW5hbmNlLXZpb2xhdGluZy1ydXNzaWFuLXNhbmN0aW9ucy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 23 Aug 2023 07:00:00 GMT",
        "title": "SOL falls to six-week low, BNB biggest gainer despite reports of Binance violating Russian sanctions - Forkast News",
        "content": "Bitcoin and Ether fell during Wednesday afternoon trading in Hong Kong, along with most other top 10 non-stablecoin cryptocurrencies by market capitalization. The SOL token saw the biggest loss in the top 10, while BNB saw the biggest gain, despite reports that Binance is violating Russian sanctions.\n\nSee related article: Weekly Market Wrap: Bitcoin falls below US$26,000 following Evergrande’s bankruptcy\n\nSOL falls to six-week low, BNB leads gainers despite reports of violating Russian sanctions\n\nSolana’s SOL token fell 1.68% in the 24 hours to 4:30 in Hong Kong to a six-week low of US$20.79, as the day’s biggest loser in the top 10, bringing its weekly losses to 11.13%. The token is down over 41% for the year, but losing the US$20 support level could return SOL to June’s low of US$14.49.\n\nBNB rose 2.77% over the past 24 hours to US$215 on Wednesday, as the day’s biggest gainer, but remained close to its yearly low of US$204 registered on Tuesday. The token continues to face downward pressure amid Binance’s mounting regulatory issues and ongoing lawsuit with the SEC.\n\nA Tuesday report by the Wall Street Journal claimed that Binance, the world’s largest exchange, is helping Russians transfer funds from sanctioned banks into balances on their platform, adding to investor concerns. Binance denied the allegations, saying that it has no relationships with any banks in Russia, in relation to its peer-to-peer trading program.\n\nBitcoin rose 0.4% during afternoon trading in Asia to US$26,052 as of 4:30 p.m. in Hong Kong after it briefly fell below the US$26,000 mark earlier today.\n\nEther rose 0.79% during afternoon trading in Asia to US$1,644 but fell 9.78% during the past week.\n\nDespite the market slump, the infrastructure being built, such as PayPal’s new stablecoin, will significantly improve global crypto adoption, according to Jamie Coutts, a senior market structure analyst at Bloomberg Intelligence.\n\n“Markets might not be pricing in the impact of PayPal’s stablecoin until it clearly gains traction, but it could be a key step in spurring the adoption of the Ethereum ecosystem. We expect more stablecoin innovation and issuance as global regulations accommodate this monetary\n\ninnovation, breathing life into the crypto economy,” wrote Coutts in a research note shared with Forkast.\n\nTotal crypto market capitalization over the past 24 hours fell 0.26% to US$1.05 trillion while market volume increased 26.89% to US$35.52 billion, according to CoinMarketCap data.\n\nForkast 500 refreshes all-time low after former OpenSea employee was sentenced for insider trading\n\nThe Forkast 500 NFT index fell 0.79% to 2,295.68 points in the 24 hours to 4:30 p.m. in Hong Kong marking a new all-time low for the index. All other FOrkast Labs indexes posted losses for the day.\n\nThe troubles continued for OpenSea, one of the world’s largest NFT marketplaces, after a former product manager at the marketplace was sentenced by a U.S. district court to three months in jail on Tuesday, for insider trading. He was found guilty of fraud and money laundering in May for using confidential information about the platform to profit from NFT trades.\n\nEthereum’s 24-hour non-fungible token sales fell 2.72% to US$8.83 million, as the largest Ethereum-based collection, the Bored Ape Yacht Club, lost some of yesterday’s momentum, with sales falling 47.04% to US$1.5 million. Yet, sales of its twin collection, the Mutant Ape Yacht Club, rose 38.10% to US$587,493, according to CryptoSlam.\n\nDraftKings, a Polygon-based NFT project, fell to become the fifth-largest collection across all chains, but its 24-hour sales volume rose 49.20% to US$486,705. Polygon’s 24-hour sales rose 10.7% to US$1.02 million, but the Forkast POL NFT Composite declined 0.18%.\n\nSolana’s 24-hour NFT sales rose 2.86% to US$1.12 million, with Solana remaining the second-largest network by 24-hour NFT sales volume.\n\nU.S. stock futures rise ahead of Nvidia earnings report, Asian equities mixed\n\nImage: elements.envato\n\nMajor Asian equities were mixed as of 4:30 p.m. in Hong Kong, with Japan’s Nikkei 225 and Hong Kong’s Hang Seng Index posting gains while the Shenzhen Component and the Shanghai Composite declined.\n\nThe Hang Seng continued distancing itself from its nine-month low recorded on Monday, lifted by an earnings recovery from China’s tech giant Baidu, which rallied over 4% after it reported that its revenue rose the most in over a year. The corporation is building itself into a leader in A.I. technology and introduced its latest generative A.I. model — Ernie 3.5 — in June 2023.\n\nMajor U.S. stock futures rose for a second consecutive day on Wednesday, with the Dow Jones Industrial Average futures, the S&P 500 futures index and the tech-heavy Nasdaq-100 futures all posting gains.\n\nThese gains came ahead of chipmaker Nvidia’s earnings report, scheduled for later today. Nvidia share prices were down 2.77% to US$456 after yesterday’s rally, despite HSBC raising its price target to US$780.\n\nOn the corporate front, investors are anticipating earnings reports from Analog Devices, Snowflake, Autodesk, NetApp and Splunk, scheduled for later today.\n\nInvestors are also looking ahead to Fed Chair Jerome Powell’s remarks at the Jackson Hole Economic Symposium on Friday. The Fed-held annual summit will be attended by central bank leaders from across the world. Powell’s speech could provide insights into the Fed’s future monetary policy.\n\nSee related article: Singapore’s Stablecoin framework, Australia’s crypto landscape & Binance shuts ‘Connect’\n\nUpdates with equities"
    }
]