[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3Qvd2ViM2dvLWRhaWx5LWRhdGEtYm5iLWNoYWluLW92ZXJ2aWV3LW9mLW1hcmNoLTIy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Mar 2023 07:00:00 GMT",
        "title": "Web3Go Daily Data: BNB Chain Overview of March 22 - BSC NEWS",
        "content": "BNB\n\nWeb3Go Daily Data: BNB Chain Overview of March 22\n\nby BSC News March 22, 2023\n\nThe daily Web3Go Data report specializing in blockchain data on BNB Chain. Here is the report for March 22, 2023."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAzLzIyL2JpbmFuY2UtbGF1bmNocGFkLWZvci1zcGFjZS1pZC10b2tlbnMtcmVjZWl2ZXMtb3Zlci0yOGItaW4tYm5iLWNvbW1pdG1lbnRzL9IBfGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAzLzIyL2JpbmFuY2UtbGF1bmNocGFkLWZvci1zcGFjZS1pZC10b2tlbnMtcmVjZWl2ZXMtb3Zlci0yOGItaW4tYm5iLWNvbW1pdG1lbnRzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Mar 2023 07:00:00 GMT",
        "title": "Binance Launchpad for Space ID Tokens Receives Over $2.8B in BNB Commitments - CoinDesk",
        "content": "After the BNB holding period, a claim ticket button will appear for 24 hours to users which need to confirm their lottery tickets, after which the lottery will start and the winners will automatically allow users to become participants of the token offering in exchange for BNB tokens."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vZm9ya2FzdC5uZXdzL2stcG9wLXN0YXItZy1kcmFnb24tbGF1bmNoZXMtbmZ0LW9uLW9wZW5zZWEtd2l0aC1mYW5kb20tc3R1ZGlvLWJuYi1jaGFpbi_SAWJodHRwczovL2Zvcmthc3QubmV3cy9rLXBvcC1zdGFyLWctZHJhZ29uLWxhdW5jaGVzLW5mdC1vbi1vcGVuc2VhLXdpdGgtZmFuZG9tLXN0dWRpby1ibmItY2hhaW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Mar 2023 07:00:00 GMT",
        "title": "K-pop star G-Dragon launches NFT on OpenSea with Fandom Studio, BNB Chain - Forkast News",
        "content": "Author profile\n\nTimmy Shen is a Taipei-based journalist at Forkast. Previously, he wrote for Caixin Global and TechNode, covering topics ranging from fintech to fan economy. He also cares about LGBT+ issues and is a shabu shabu fanatic. Timmy holds an MS degree from Columbia Journalism School.\n\nAuthor's email\n\nAuthor's profile on Twitter"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3LnRoZXN1bi5jby51ay90cmF2ZWwvMjE4MDE4NjUvaG9saWRheS1ob21lLWhvcnNlcy1sYWtlLWRpc3RyaWN0L9IBT2h0dHBzOi8vd3d3LnRoZXN1bi5jby51ay90cmF2ZWwvMjE4MDE4NjUvaG9saWRheS1ob21lLWhvcnNlcy1sYWtlLWRpc3RyaWN0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Mar 2023 07:00:00 GMT",
        "title": "The quirkiest holiday home in Britain has some very strange roommates... - The Sun",
        "content": "HAY, here’s an idea for holiday-seeking animal lovers — a night spent sleeping in a stable next to a horse.\n\nGuests can bed down beside a Friesian breed or a Shetland pony at a family-run equestrian centre from £350 a night.\n\n4 £300-a-night Stable Stays provides a unique opportunity to stay in a self-catering stable sleeping beside 17 Friesian horses and a Shetland pony Credit: mediadrumimages\n\n4 You'll find your fairy-lit stable equipped with luxury Egyptian cotton comfy double and single bunk bed Credit: mediadrumimages\n\nFor that, up to three people get a pad to live and sleep in — separated from their “equine companion” by a see-through room divider.\n\nFrom a top bunk, they can stroke or chat to their neighbour — while a gate lets them through to groom or feed them.\n\nExperienced riders can also take a mount for a run on the beach at Grange-over-Sands in the Lake District.\n\nTracey Alexander launched Stable Stays at her family’s farm in nearby Cartmel after a “light-bulb moment”.\n\nIt followed an off-the-cuff remark about their listed barn and being able to sleep beside a horse.\n\nShe said: “We have very friendly, people-orientated horses, so we thought we could set up a glamping-type unit in the barn.\n\n“We’ve had some great feedback. Everyone who has stayed has loved it.”\n\nA number of her Friesians — powerful black horses that originate in the Netherlands — and her miniature Shetland Pony, Mr JB, take part.\n\nShe said: “The Friesians love people and they love that interaction — it works well for the horses and the people.”\n\n4 The holiday let is in the village of Cartmel in Cumbria"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8va2t5ci5jb20vY2hhcm1pbmctdmljdG9yaWEtaGlzdG9yaWMtYmVkLWFuZC1icmVha2Zhc3QtZm9yLXNhbGUtaW4tYXJrYW5zYXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Mar 2023 07:00:00 GMT",
        "title": "Charming Victoria Historic Bed and Breakfast for Sale in Arkansas - kkyr.com",
        "content": "The historic Empress of Little Rock Bed and Breakfast is now up for sale. You can own a piece of Arkansas history.\n\nEmpress of Little Rock\n\nThe Empress of Little Rock Bed and Breakfast is being offered for sale for $1,999,000. This prestigious 7,128 sq ft Victorian-style mansion known as the Hornibrook Mansion was constructed in 1888 by Max Orlopp and Kasper Kusener for $20,000. In 2019 the property sold for $825,000 in June 2019.\n\nTracey Rancifer, Ausum Realty/ CARM Inc via Zillow Tracey Rancifer, Ausum Realty/ CARM Inc via Zillow loading...\n\nTracey Rancifer, Ausum Realty/ CARM Inc via Zillow Tracey Rancifer, Ausum Realty/ CARM Inc via Zillow loading...\n\nVictorian Architecture The Empress has been totally restored and preserved and is now listed on the National Register of Historic Places as the best example of ornate Victorian Architecture in Arkansas and the most important existing example of Gothic Queen Anne style regionally.\n\nZillow Tracey Rancifer, Ausum Realty/ CARM Inc via Zillow loading...\n\nZillow Tracey Rancifer, Ausum Realty/ CARM Inc via Zillow loading...\n\nZillow Tracey Rancifer, Ausum Realty/ CARM Inc via Zillow loading...\n\nZillow Tracey Rancifer, Ausum Realty/ CARM Inc via Zillow loading...\n\nZillow Tracey Rancifer, Ausum Realty/ CARM Inc via Zillow loading...\n\nMany of the original features include enormous stained glass windows, woodwork, and parquet floors with a divided staircase, a three-story corner tower, a stained glass skylight, and octagonal-shaped rooms that give this 10-bedroom, 11-bath, and breakfast mansion plenty of elegance and charm.\n\nZillow Tracey Rancifer, Ausum Realty/ CARM Inc via Zillow loading...\n\nZillow Tracey Rancifer, Ausum Realty/ CARM Inc via Zillow loading...\n\nZillow Tracey Rancifer, Ausum Realty/ CARM Inc via Zillow loading...\n\nZillow Tracey Rancifer, Ausum Realty/ CARM Inc via Zillow loading...\n\nThis property also has a grand ballroom, a parlor, a library, a formal dining room a separate carriage house, and a guest cottage.\n\nCarriage House\n\nZillow Tracey Rancifer, Ausum Realty/ CARM Inc via Zillow loading...\n\nThe Empress has specially landscaped gardens, a fountain, and a courtyard that offers its guest peace and tranquility.\n\nZillow Tracey Rancifer, Ausum Realty/ CARM Inc via Zillow loading...\n\nTop 10 Most Romantic Inns\n\nThe Empress of Little Rock has been named one of the \"Top 10 Most Romantic Inns\" by American Historic Inns.\n\nZillow Tracey Rancifer, Ausum Realty/ CARM Inc via Zillow loading...\n\nZillow Tracey Rancifer, Ausum Realty/ CARM Inc via Zillow loading...\n\nTo inquire about this property please call, Tracey Rancifier at 501-944-7707 or email tracy@ausumrealty.com. You can also go to Zillow for more information and photos."
    }
]