[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMTcvYm5iLWNoYWluLWJ1cm5zLW92ZXItNTAwbS1pbi1ibmItdG9rZW5zL9IBWGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMTcvYm5iLWNoYWluLWJ1cm5zLW92ZXItNTAwbS1pbi1ibmItdG9rZW5zL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Jan 2023 08:00:00 GMT",
        "title": "BNB Chain Burns Over $575M in BNB Tokens, Binance Confirms - CoinDesk",
        "content": "Token burn refers to the process of permanent deletion of coins from their circulating supply. Over 100 million BNB, or half of its total supply, are intended to be removed from circulation through a burning process and to eventually keep only 100 million BNB in circulation. This commitment is automatically honored each quarter and calculated according to the Auto-Burn formula, as previously reported."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMTcvYm5iLWNoYWluLWJ1cm5zLW92ZXItNTAwbS1pbi1ibmItdG9rZW5zL9IBWGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMTcvYm5iLWNoYWluLWJ1cm5zLW92ZXItNTAwbS1pbi1ibmItdG9rZW5zL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Jan 2023 08:00:00 GMT",
        "title": "BNB Chain Burns Over $575M in BNB Tokens, Binance Confirms - CoinDesk",
        "content": "Token burn refers to the process of permanent deletion of coins from their circulating supply. Over 100 million BNB, or half of its total supply, are intended to be removed from circulation through a burning process and to eventually keep only 100 million BNB in circulation. This commitment is automatically honored each quarter and calculated according to the Auto-Burn formula, as previously reported."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vOTJtb29zZS5mbS9mb3VyLWluLWphaWwtYWZ0ZXItcG9saWNlLXRpcC1sZWFkcy10by1iaWctY2VudHJhbC1tYWluZS1kcnVnLWJ1c3QtbW9uZGF5LW1vcm5pbmcv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Jan 2023 08:00:00 GMT",
        "title": "Four in Jail After Police Tip Leads to Big Central Maine Drug Bust Monday Morning - 92moose.fm",
        "content": "Four men are in custody and several drugs are off the streets of Central Maine following a Monday morning drug raid.\n\nAccording to WGME 13, an anonymous police tip led investigators to perform a drug raid on Monday morning at a home on Lake Auburn Avenue in Auburn, Maine. Police say they began the raid in the early morning hours at around 2 am Monday.\n\nDuring the drug raid, police were able to seize several different drugs including 15 grams of fentanyl, 4.27 ounces of crack cocaine, 4.02 ounces of cocaine HCI, 14 ounces of meth, a loaded gun, an array of drug selling paraphernalia and a cash counting machine.\n\nPolice say they took four suspects into custody following the raid on Lake Auburn Avenue.\n\nDwayne McDowell Dwayne McDowell loading...\n\nGary Pleau Gary Pleau loading...\n\nDarnel Andre Darnel Andre loading...\n\nJaden Andre Jaden Andre loading...\n\nWGME is reporting that Dwayne Mcdowell, 50 of Auburn, Gary Pleau, 58 of Auburn, Jaden Andre, 19 of Rockland and Darnel Andre, 26 of Auburn, were all taken into custody Monday morning on an array of various charges.\n\nMcDowell and Pleau were charged with criminal conspiracy for aggravated trafficking of schedule drugs and possession of firearm by prohibited person.\n\nThe article states that Darnel Andre and Jaden Andre were subsequently charged with aggravated trafficking of schedule drugs, unlawful possession of schedule w drug, and possession of firearm by prohibited person, according to WGME.\n\nWGME is reporting that all four suspects are currently being held at the Androscoggin County Jail. McDowell, Darnel Andre, and Jaden Andre’s bail has been set at $10,000 for each man."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL2JpbmFuY2UtY29tcGxldGVzLTIybmQtdG9rZW4tYnVybi1yZW1vdmVzLTYyMC1taWxsaW9uLXdvcnRoLW9mLWJuYi1mcm9tLWNpcmN1bGF0aW9uL9IBc2h0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL2JpbmFuY2UtY29tcGxldGVzLTIybmQtdG9rZW4tYnVybi1yZW1vdmVzLTYyMC1taWxsaW9uLXdvcnRoLW9mLWJuYi1mcm9tLWNpcmN1bGF0aW9uL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Jan 2023 08:00:00 GMT",
        "title": "Binance Completes 22nd Token Burn, Removes $620 Million Worth Of BNB From Circulation - Coinpedia Fintech News",
        "content": "Qadir Ak is the founder of Coinpedia. He has over a decade of experience writing about technology and has been covering the blockchain and cryptocurrency space since 2010. He has also interviewed a few prominent experts within the cryptocurrency space.\n\nIn a recent tweet, Binance announced that it has completed its 22nd BNB burn and first quarterly burn of 2023.\n\nWhen BNB was introduced in 2017, a promise was made to burn 100 million of the coin’s entire quantity, or half of it, and eventually leave only 100 million in circulation. Each quarter, this commitment is automatically carried out and the Auto-Burn formula is used to determine the amount.\n\nAccording to a statement from Binance, 2.064 million BNB, or around $620 million at today’s values, have been taken out of circulation. In terms of BNB tokens, the 22nd burn broke the previous record set by the 14th, which occurred two years ago.\n\nBNB Auto-Burn Formula\n\nThe Auto-Burn formula which is used by BNB provides an independently auditable, objective process. The figures are reported quarterly, and the mechanism is separate from the centralized Binance exchange. A fraction of BNB Chain’s gas fees are still being burned in real-time by a bespoke mechanism.\n\nBased on the price of BNB and the quantity of blocks created on the BNB Smart Chain (BSC) during the quarter, the auto-burn mechanism modifies the amount of BNB to be burned.\n\nThe native coin of the BNB Beacon Chain and BNB Smart Chain, BNB fuels the BNB Chain ecosystem. Binance, a cryptocurrency exchange, released it following an initial coin offering in 2017.\n\nThe current price of BNB is $ 301.98 per token with a current market cap of $ 47.68B USD. BNB has broken the $300 resistance this weekend to reach $314 last Saturday and shows an upward movement."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYmluYW5jZS1jb2luL2JpbmFuY2UtYm5iLWZvcm1zLWJlYXJpc2gtcGF0dGVybi_SAVBodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2JpbmFuY2UtY29pbi9iaW5hbmNlLWJuYi1mb3Jtcy1iZWFyaXNoLXBhdHRlcm4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Jan 2023 08:00:00 GMT",
        "title": "Binance Coin (BNB) Forms Bearish Pattern, But Fundamentals Look Strong - NewsBTC",
        "content": "In the wake of FTX’s collapse, many eyes focused on the now undisputed largest cryptocurrency exchange in the world, Binance. Due to an opaque proof of reserves, the withdrawal of accounting firm Mazars, and a bank run on the exchange, the Binance Coin (BNB) suffered a temporary loss of trust and excessive price losses.\n\nSlowly and gradually, however, investors seem to be regaining confidence in Binance. The BNB price has risen 9.3% over the last seven days, reaching $301 at press time.\n\nAlthough there was some positive news from Binance yesterday and today, the BNB price is facing a bearish pattern on the weekly chart. The pattern usually predicts a trend reversal and shows three peaks, with the two outer ones close to each other and the middle peak being the highest.\n\nThe left shoulder forms when investors drive the price up, and then temporarily lose their enthusiasm. The head builds up when enthusiasm reaches its peak. The right shoulder forms when the price rises again, but does not reach its previous peak before falling again.\n\nRelated Reading\n\nWhy A Morning Star Reversal Could Awaken A Monster Bitcoin Rally 1 year ago\n\nThe head of the BNB weekly chart was formed in the week when FTX filed for bankruptcy. In the following weeks, the price fell before BNB experienced a recent rally thanks to the generally bullish market sentiment. With this, BNB is in a crucial scenario.\n\nIf BNB breaks the neckline at $210 to the downside, the chart pattern could validate and BNB could see a downtrend within the next few weeks, pushing the price toward $153.\n\nBinance Coin Counts On Strong Fundamentals\n\nThere are also good fundamental reasons to be bullish on the BNB price. The crypto exchange announced its 22nd quarterly burn today. As part of it, the exchange has burned 7,181.03 BNB via the Pioneer Burn Program, which was equivalent to about $617 million.\n\nRelated Reading\n\nWhat Matters In Crypto This Week: Will Bitcoin Keep Pumping? 1 year ago\n\nIn total, Binance has now burned approximately 2.06 million BNB. With the latest quarterly burn, the exchange has burned about 1.28% of all BNB in circulation, which is the highest in almost two years. This shows that Binance’s trading business is again doing better than in previous months.\n\nIn other bullish news, the exchange yesterday launched a new off-exchange custody service that allows institutions to access trading and investment products within the exchange ecosystem without having to deposit collateral directly on the exchange:\n\nWe’re excited to announce the official launch of our off-exchange settlement solution, Binance Mirror. Through Mirror, institutions can deploy their liquidity on Binance while their assets remain secured in our segregated cold storage.\n\nAs the exchange explained, assets in Binance Mirror account for more than 60% of all assets secured in the custody product. With the new service, the exchange could hope for increased adoption by institutions that previously did not want to take the risk of third-party custody, but at the same time want to access the most liquid exchange in the market.\n\nAccording to the exchange, the adoption of Binance Mirror increased significantly in the last quarter of 2022 with a 67% increase in assets mirrored from Binance Custody to the exchange.\n\nFeatured image from Satheeshsankaran / Pixabay, Chart from TradingView.com"
    }
]