[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbmN1bHR1cmUuY29tL2F1L2J1c2luZXNzL2JpbGxpb25zLW9mLWZ1bmRzLXBhaWQtYnktZnR4LXRvLWludmVzdG9ycy1jb3VsZC1iZS1yZXR1cm5lZC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Jan 2023 08:00:00 GMT",
        "title": "Billions of Funds Paid by FTX to Investors Could Be Returned - Coin Culture",
        "content": "A bankruptcy counsel said that clawback clauses could compel firms and investors to refund billions of dollars received in the months preceding the collapse of the cryptocurrency exchange.\n\nBriefly, “clawback” refers to money given out that must be recovered owing to unique circumstances or occurrences, such as an insolvent corporation that must recover payments spent within 90 days before filing Chapter 11. If the creditor is an insider, the ninety-day timeframe is extended to twelve months.\n\nCreditors could therefore seek a clawback on transfers made by FTX to external parties, such as the $2.1 billion paid by FTX to Binance when Binance withdrew its Series A investment in FTX. In a recent interview, Binance CEO CZ dismissed worries regarding the return of the money, stating that Binance’s attorneys should handle it.\n\nMark Pfeiffer, a member of the Blockchain and Crypto Assets Practice group, explained that in the event of a clawback to recover funds for creditors, the bankruptcy court could require the return of crypto assets or the amount of money equal to the value of the crypto transferred.\n\nAs the bankruptcy action advances, several other businesses, including Silvergate Bank, may be asked to refund funds. In December, a complaint filed by FTX clients alleges that the bank assisted the defunct cryptocurrency exchange in illegal activities by improperly transferring funds.\n\nPfeiffer revealed that there are three primary forms of clawbacks. The first preference provision of Section 547 of the Bankruptcy Code permits the debtor or a trustee to nullify any transfer of property made to an insolvent creditor within ninety days before filing the petition.\n\nAccording to Section 548 of the Bankruptcy Code, the second type is a fraudulent property transfer committed to cheating creditors when the debtor is bankrupt.\n\nThe final type of fraudulent transfer under Section 548 is a transfer of property done while the debtor was bankrupt and for which the debtor got less than a value reasonably equivalent.\n\nFTX’s bankruptcy case may be similar to other bankruptcy cases involving fraud and mismanagement, but it may establish standards for how crypto assets are treated in bankruptcy courts.\n\nWhile regulators and other courts may not follow the norms of bankruptcy courts, similar issues are likely to occur. “Is it a currency, an investment, a commodity, or something else?” According to Pfeiffer, this issue will also arise outside of bankruptcy in areas like securities regulation and general litigation."
    }
]