[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMitAFodHRwczovL3R5bGVycGFwZXIuY29tL25ld3MvYnVzaW5lc3MvY2VyZWFsLXRoZW1lZC1haXJibmItd2lucy13b3JsZHdpZGUtZGVzaWduLWNvbXBldGl0aW9uLXNldC10by1iZS1jb21wbGV0ZWQtaW4tdHlsZXItYnktYXVndXN0L2FydGljbGVfZDQyZmYxZDgtYzlhMC0xMWVkLTk2YmYtZTNjODMzZjc1MThkLmh0bWzSAbgBaHR0cHM6Ly90eWxlcnBhcGVyLmNvbS9uZXdzL2J1c2luZXNzL2NlcmVhbC10aGVtZWQtYWlyYm5iLXdpbnMtd29ybGR3aWRlLWRlc2lnbi1jb21wZXRpdGlvbi1zZXQtdG8tYmUtY29tcGxldGVkLWluLXR5bGVyLWJ5LWF1Z3VzdC9hcnRpY2xlX2Q0MmZmMWQ4LWM5YTAtMTFlZC05NmJmLWUzYzgzM2Y3NTE4ZC5hbXAuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Mar 2023 07:00:00 GMT",
        "title": "Cereal-themed Airbnb wins worldwide design competition, set to be completed in Tyler by August - Tyler Morning Telegraph",
        "content": "Close Get email notifications on {{subject}} daily!\n\nYour notification has been saved.\n\nThere was a problem saving your notification.\n\n{{description}}\n\nEmail notifications are only sent once a day, and only if there are new matching items."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8venljcnlwdG8uY29tL2JpdGNvaW4tbWF4aW1hbGlzdC1tYXR0aGV3LWtyYXR0ZXItYXNzZXJ0cy0xLW1pbGxpb24tdmFsdWUtZm9yLWJ0Yy1jb3VudGVycy1iYWxhamlzLWZvcmVjYXN0L9IBdmh0dHBzOi8venljcnlwdG8uY29tL2JpdGNvaW4tbWF4aW1hbGlzdC1tYXR0aGV3LWtyYXR0ZXItYXNzZXJ0cy0xLW1pbGxpb24tdmFsdWUtZm9yLWJ0Yy1jb3VudGVycy1iYWxhamlzLWZvcmVjYXN0Lz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin Maximalist Matthew Kratter Asserts $1 Million Value For BTC, Counters Balaji’s Forecast - ZyCrypto",
        "content": "Advertisement\n\nBitcoin is going to tap $1,000,000, but not as Balaji Srinivasan predicts, veteran Bitcoin crusader Matthew Kratter has asserted.\n\nOn March 24, Kratter, founder of Bitcoin-focused investment firm Trader University highlighted Bitcoin in light of the ongoing US banking crisis, noting that the collapse of three major cryptocurrency banks earlier this month had just taken people “one giant step closer to a Bitcoin standard.”\n\n“What we’re witnessing is the ultimate flight to safety as people are fleeing to bitcoin. Where else are you going to go when the U.S banking system which is theoretically the safest banking system in the world is experiencing rolling Bank runs?” he said.\n\nAccording to him, Fed’s decision to re-introduce quantitative easing by turning the money printers back on would increase the dollar’s debasement risk and worsen counterparty risks. He thus noted that Bitcoin was the only asset that did not have a debasement risk due to its finite nature, meaning that with the Fed printing more money, everything else would only crash against the crypto asset.\n\nBalaji’s $1M Bitcoin Bet In 90 Days Improbable\n\nKratter also took a jab at a recent Coinbase ex-CTO, Balaji Srinivasan’s prediction that Bitcoin will reach $1 million in approximately 90 days from last week.\n\nAdvertisement\n\n“This is quite a sensational thing to say. Is this possible? Yes, anything is possible with Bitcoin. Is this likely? I would say definitely not,” Kratter said, referring to Balaji’s prediction.\n\nBalaji’s call was more of a marketing ploy by “trying to use Bitcoin to pump his own reputation” while trying to cover up for his past war against bitcoin maximalists, Kratter argued. He further claimed that Balaji was the ultimate self-promoter and VC pumper type who was largely responsible for bringing “shitcoins” to Coinbase.\n\n“We must never forget that he was busy pumping shitcoins and bashing bitcoiners for being so narrow-minded for being Bitcoin maximalist,” Kratter said.\n\nKratter further noted that he would be quite concerned if Bitcoin were to go to a million dollars within three months, adding that he would consider this to be not exactly a blessing. In his view, “it’s nice that Bitcoin appreciates slowly and doesn’t draw too much attention to itself.”\n\nHe then predicted that Bitcoin would likely be trading above $100,000 in three months. “I certainly expect it(BTC) to be trading in the millions by the end of this decade and it would be quite possible for it to trade above 100 000 in the coming three months,” he concluded."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8venljcnlwdG8uY29tL2FkYS10by0xNS1uZXh0LWNyeXB0by1wdW5kaXQtYm9sZGx5LXByZWRpY3RzLWFzLWNhcmRhbm8tc2V0cy1uZXctcmVtYXJrYWJsZS1taWxlc3RvbmUv0gFvaHR0cHM6Ly96eWNyeXB0by5jb20vYWRhLXRvLTE1LW5leHQtY3J5cHRvLXB1bmRpdC1ib2xkbHktcHJlZGljdHMtYXMtY2FyZGFuby1zZXRzLW5ldy1yZW1hcmthYmxlLW1pbGVzdG9uZS8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Mar 2023 07:00:00 GMT",
        "title": "ADA To $15 Next? Crypto Pundit Boldly Predicts As Cardano Sets New Remarkable Milestone - ZyCrypto",
        "content": "Advertisement\n\nRenowned crypto analyst Dan Gambardello has predicted Cardano ADA’s price will touch $15. This is after the Cardano network hit the historic 4 million milestone. Gambardello explained in a recent YouTube video why this crucial wallet number prompted him to set the ultra-bullish price target for ADA.\n\nCardano Wallets Rip Past 4 Million\n\nFounder of Crypto Capital Ventures, Dan Gambardello, has highlighted solid data that is strengthening his bullish stance. Specifically, he noted why he believes realistically that a $15 ADA price is plausible.\n\nGambardello correctly predicted in June 2020 the ADA all-time high of $3 back when the token was valued at around $0.09. At the time, Gambardello’s prediction hinged on Ethereum events. He is once again relying on Ethereum data to predict the future price of ADA.\n\nIn a March 25 video, the YouTuber observed that Ethereum reached 4 million wallets in 2017 at a market capitalization of $21 billion, while Cardano hit the 4 million wallet milestone with a $12 billion market cap. Ether went on to smash $125 billion market cap during the bull market, and Cardano reached $91 billion.\n\nGambardello expects ADA to hit $15 in the next bull market, with its market cap rising to a staggering $500 billion. He is of the opinion that developments within the Cardano ecosystem are in line with Ethereum, though he deems the former a better blockchain.\n\nAdvertisement\n\n“I’m not even discussing the fundamentals here. I’m not even discussing what Cardano as a blockchain is doing. When I did this video last time, Shelly wasn’t even here, the staking mechanism for Cardano wasn’t even here yet, the Mary hard fork was not even here yet, multi-asset Ledger, Alonzo, and smart contracts,” Gambardello postulated.\n\nHe further indicated that Cardano is more scalable and has great projects after undergoing the Vasil hard fork, which has been said to make smart contract deployment more efficient and allow decentralized applications (dApps) to run at much lower costs. Gambardello believes more groundbreaking Cardano innovations are on the horizon.\n\nCardano is now awaiting to transition to the fifth and final stage in development, the Voltaire era. Per Cardano creator Charles Hoskinson, Voltaire will teach the rest of the cryptosphere a lesson on how to execute decentralized governance.\n\nADA is currently trading hands at $0.3630, which is roughly 88% off the cryptocurrency’s historic high of $3.09 seen in September 2021. The seventh-placed Cardano has a long way to go in order to achieve Gambardello’s target."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8venljcnlwdG8uY29tL2FkYS10by0xNS1uZXh0LWNyeXB0by1wdW5kaXQtYm9sZGx5LXByZWRpY3RzLWFzLWNhcmRhbm8tc2V0cy1uZXctcmVtYXJrYWJsZS1taWxlc3RvbmUv0gFvaHR0cHM6Ly96eWNyeXB0by5jb20vYWRhLXRvLTE1LW5leHQtY3J5cHRvLXB1bmRpdC1ib2xkbHktcHJlZGljdHMtYXMtY2FyZGFuby1zZXRzLW5ldy1yZW1hcmthYmxlLW1pbGVzdG9uZS8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Mar 2023 07:00:00 GMT",
        "title": "ADA To $15 Next? Crypto Pundit Boldly Predicts As Cardano Sets New Remarkable Milestone - ZyCrypto",
        "content": "Advertisement\n\nRenowned crypto analyst Dan Gambardello has predicted Cardano ADA’s price will touch $15. This is after the Cardano network hit the historic 4 million milestone. Gambardello explained in a recent YouTube video why this crucial wallet number prompted him to set the ultra-bullish price target for ADA.\n\nCardano Wallets Rip Past 4 Million\n\nFounder of Crypto Capital Ventures, Dan Gambardello, has highlighted solid data that is strengthening his bullish stance. Specifically, he noted why he believes realistically that a $15 ADA price is plausible.\n\nGambardello correctly predicted in June 2020 the ADA all-time high of $3 back when the token was valued at around $0.09. At the time, Gambardello’s prediction hinged on Ethereum events. He is once again relying on Ethereum data to predict the future price of ADA.\n\nIn a March 25 video, the YouTuber observed that Ethereum reached 4 million wallets in 2017 at a market capitalization of $21 billion, while Cardano hit the 4 million wallet milestone with a $12 billion market cap. Ether went on to smash $125 billion market cap during the bull market, and Cardano reached $91 billion.\n\nGambardello expects ADA to hit $15 in the next bull market, with its market cap rising to a staggering $500 billion. He is of the opinion that developments within the Cardano ecosystem are in line with Ethereum, though he deems the former a better blockchain.\n\nAdvertisement\n\n“I’m not even discussing the fundamentals here. I’m not even discussing what Cardano as a blockchain is doing. When I did this video last time, Shelly wasn’t even here, the staking mechanism for Cardano wasn’t even here yet, the Mary hard fork was not even here yet, multi-asset Ledger, Alonzo, and smart contracts,” Gambardello postulated.\n\nHe further indicated that Cardano is more scalable and has great projects after undergoing the Vasil hard fork, which has been said to make smart contract deployment more efficient and allow decentralized applications (dApps) to run at much lower costs. Gambardello believes more groundbreaking Cardano innovations are on the horizon.\n\nCardano is now awaiting to transition to the fifth and final stage in development, the Voltaire era. Per Cardano creator Charles Hoskinson, Voltaire will teach the rest of the cryptosphere a lesson on how to execute decentralized governance.\n\nADA is currently trading hands at $0.3630, which is roughly 88% off the cryptocurrency’s historic high of $3.09 seen in September 2021. The seventh-placed Cardano has a long way to go in order to achieve Gambardello’s target."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8va3VlbnNlbG9ubGluZS5jb20vaXNzdWluZy1iYW5rcy1yZWplY3QtaW50ZXJuYXRpb25hbC1wYXltZW50LWdhdGV3YXkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Mar 2023 07:00:00 GMT",
        "title": "Issuing banks reject international payment gateway - Kuensel, Buhutan's National Newspaper",
        "content": "…cardholders are advised to contact their banks to verify a transaction\n\nThukten Zangpo\n\nMany a time, when tourists try to pay their visa and sustainable development fee (SDF) through international payment gateway in Bhutan, the transaction fails. The tourists panic, and there is not much that can be done.\n\nIt was learnt that more than 50 percent of online transactions do not work on the international payment gateway.\n\nAnother issue, Department of Tourism (DoT) officials said, is that the tourists in the country cannot buy things or pay for hotels because of the lack of credit card infrastructure in the country.\n\n“Some hotels insist on upfront payment from guests before they arrive due to issues,” the official said. Most retailers do not accept credit cards.\n\nUnlike in the past, tour operators now have to request tourists to pay their SDF and visa fee, a tour operator said, adding that the online transaction success rate would be less than 30 percent.\n\nCurrently, in Bhutan, two banks—only Bank of Bhutan Limited (BoB) and Bhutan National Bank Limited (BNB)—accept the international payment gateway.\n\nBoB accepts Visa and Mastercard and the Bank is working to integrate with American Express for international payment gateway. BNB accepts Visa, Mastercard, Maestro, American Express, JCB card (Japan), Diner card, and Discover card.\n\nFor physical transactions from ATM and POS terminals, the BoB accepts Visa, Mastercard, Maestro, American Express, RuPay and JCB; BNBL accepts Visa and RuPay; Druk PNB accepts Mastercard, Maestro, and RuPay.\n\n\n\n\n\n\n\n\n\nT-Bank Limited and Bhutan Development Bank Limited accept only RuPay.\n\nTransaction failures\n\nAccording to an official from the BoB, about 90 percent of transaction failures in the international payment gateway are issuer-related; technical failures constitute only a small percentage.\n\nHe added that the issuing banks do not decline transactions by default (unless the card is not enabled for international payments); their fraud and risk management (FRM) systems may reject the transaction request if they are considered suspicious.\n\nThe official said that some of the reasons the issuing banks trigger their FRM are because of the first-time transactions, unusual transaction behaviour or patterns, uncharacteristic behaviour, transactions originating from unfamiliar countries, multiple transactions in short periods, and incorrect details including wrong 3D security credentials or OTPS (one-time password SMS).\n\n“If the transaction does not meet the bank’s fraud and risk criteria, the issuing bank rejects the transaction,” an official said, adding that credit card fraud is a big problem in the world.\n\nAn individual bank has their own AI-powered FRM system. It is the process of identifying, understanding, and responding to fraud risks. The system ensures the cardholders are safe from fraud.\n\nAccording to the BoB official, the FRM kicks in and rejects the transaction if a visitor has no history of transaction in Bhutan.\n\nHe added that tourists visiting Bhutan usually make online payment of USD 2,000. “The FRM system checks the cardholders’ patterns and habits and will block the transaction if it is out of character.”\n\n\n\n\n\n\n\n\n\nBhutan falls in the Asia-Pacific region, a high-risk region of credit card fraud, an official said.\n\nHe added that BoBL has updated the online payment security to 3D security version (3DS) 2.0 which is mandated by the credit card network. Other banks, he said, are still in the 3DS version 1.0.\n\n“When there is a mismatch between the versions, the transaction fails,” he said.\n\n3DS is a technical standard that adds a layer of security in online credit and debit card transactions. It is created by Visa and Mastercard.\n\nBank officials said that if the cards are repeatedly used at the ATMs and POS, the issuer banks’ FRM triggers.\n\nThe issuing bank does not know that the Bhutanese cash withdrawal terminals can dispense only Nu 15,000 at a time, he added.\n\nThe official also said that there are cases of cardholders entering the wrong PIN or of failing the OTPS verification, insufficient balance, exceeding transaction amount and expired cards.\n\nThere is also rejection from the issuing bank, especially the Indian cards, which are designed for only domestic use.\n\n\n\n\n\n\n\n\n\nA tour operator said that most of the POS terminals are not working and that there is no proper network connectivity.\n\nBank officials said that the POS terminals in Bhutan do not support PIN.\n\nBoB has about 607 POS terminals; BNB has around 100 in the country.\n\nInterventions\n\nThe GovTech is working with Royal Monetary Authority (RMA) and the banks to coordinate and assist to make the payments smooth. They also have come with interventions to resolve the issues.\n\nIf the issuing banks decline the transaction because of the banks’ FRM, the BoB official said that the cardholders are advised to contact their issuing bank to verify their transaction.\n\n“Informing the issuing bank that it is a genuine transaction and for Bhutan, the banks will allow the transaction,” he said, adding that the BoB does not have connections with the issuing banks.\n\nThe bank has maintained its system capability, network and system infrastructure at the highest level of any developed country’s banking system, the BoB official said.\n\nAccording to GovTech, cardholders are advised to contact their banks prior to their visit or transaction attempt and be sure the card is enabled for use internationally.\n\nFor Indian bank-issued cards, cardholders are advised to contact their banks and verify if the cards can be used in Bhutan.\n\nHowever, an official from DoT said the cardholders are not always required to contact the banks. “Most people never have to do this when they travel or make international payments.”\n\nTo address the failures related to systems, the bank official said that the bank implemented a fall back system to accept less secure cards (3DS version 1.0 from version 2.0) at the risk of the bank’s increased fraud from October last year.\n\nThe RMA, the GovTech, and the banks also recommended SWIFT transfers for the department of immigration’s (DoI) visa payments, which are fully functional.\n\n\n\n\n\n\n\n\n\nThey added that according to the DoI requirements, a unique identifier number (UIN) generated by the DoI visa system should be presented to the bank by the tour operator.\n\nAnd the identifier is tied to specific visa applications and must be displayed in the DoI account statement.\n\nSince the bank’s core banking solution is currently unable to accommodate the full length of the UIN, DoI has been requested to shorten the UIN to a maximum of 13 characters per transfer.\n\nThere is also a recommendation to explore the direct wire transfer payment to DoI by tourists.\n\nFor POS, the PIN mandate at POS, fall back to the PIN-less transactions project is in progress."
    }
]