[
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vYm5iZmlzaGluZy5jb20uYXUvMjAyMy1tb3VyYS1tdWRkeS13YXRlci1jbGFzc2ljLWZpc2hpbmctY29tcGV0aXRpb24v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Mar 2023 07:00:00 GMT",
        "title": "2023 Moura Muddy Water Classic fishing competition - Bush 'n Beach Fishing mag",
        "content": "Easter for many means getting away on a camping and fishing trip, and what better place to do both than at the Muddy Water Classic fishing competition at Moura from April 7-9, 2023.\n\nAlways a great weekend of fun, fishing and mixing with friends.\n\nRun by the Moura Fish Stocking Group that, with the support of district and community, holds this awesome event at the Apex Park on the Dawson River, on the western side of Moura.\n\nCamp in the shaded grassy camp area and enjoy dollar-coin operated hot and cold showers at the facilities block.\n\nActivities kick off on Thursday 7 April with an outdoor movie, which is as popular with adults as it is with kids – so bring your chair, sit back and relax.\n\nNominate to fish or to be in the running for one of the two lots of major senior and junior lucky draws.\n\nNominations are $20 for seniors and $10 for juniors.\n\nThere are meals – breakfast, lunch and snacks – and refreshments available, and everyone’s favourite… the ice cream truck!\n\nJoining us is the barefoot fisho Dave ‘Hodgie’ Hodge, who will entertain and amaze you with his casting skills, plus share and chat with you about his fishing tips and techniques.\n\nFrom a fishing perspective, while the river has had its ups and downs with water flow, it has settled to a good level now – not far under the weir – and you can navigate a long way upstream.\n\nRemember, there is a lot of timber about and care is required for submerged stumps.\n\nThe water clarity is quite clear for the Dawson River, and saratoga and yellowbelly have been very active.\n\nLast year we introduced the catching of a tagged saratoga worth $1000.\n\nThis year, there are two tagged saratoga worth $1000 each when caught.\n\nHappy fishing and we can’t wait to see you there.\n\nFor more information, contact Zelma Lewis on 0428 971 932 or m.a.f.s.g@bigpond.com"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmNocm9uaWNsZWxpdmUuY28udWsvbmV3cy9ub3J0aC1lYXN0LW5ld3MvZm91bnRhaW4tY290dGFnZS1jaGFubmVsLTQtcmVhY3Rpb24tMjY1Mjc0NjjSAWVodHRwczovL3d3dy5jaHJvbmljbGVsaXZlLmNvLnVrL25ld3Mvbm9ydGgtZWFzdC1uZXdzL2ZvdW50YWluLWNvdHRhZ2UtY2hhbm5lbC00LXJlYWN0aW9uLTI2NTI3NDY4LmFtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Mar 2023 07:00:00 GMT",
        "title": "Bellingham B&B owners 'got everything they wanted' from Four In A Bed appearance - Chronicle Live",
        "content": "Sign up for free to get the latest Northumberland news and updates delivered straight to your inbox\n\nSign up for free to get the latest Northumberland news and updates delivered straight to your inbox\n\nThe owners of a Northumberland bed and breakfast say that they got everything they wanted from their appearance on Four In A Bed, despite finishing runners up.\n\nMichael and Danielle Hudson, both 30, introduced Fountain Cottage Café and Bed and Breakfast to the UK on the popular Channel 4 daytime programme earlier this month. On payment day, they received full payment from all their competition on their £120 rooms, and were complimented on having a \"beautiful place\" and being great hosts.\n\nDespite that, they finished runners up to Georgia and Paul of the Shuckburgh Arms in Northamptonshire, which received an overpayment. However, the couple say that they have got all the wanted from the show after their own valuation of what they offered was met, and feel that they were portrayed fairly - well, for most of it.\n\nRead more: Once derelict Northumberland pub celebrates booking boost after making Four In A Bed history\n\n\n\nDanielle said: \"A lot of our customers have said that we came across just as ourselves, and we're glad that people recognised that. We we tried to have fun but also tried to be friendly and constructive with the feedback, though Michael wasn't happy about how he was portrayed with the fridge!\"\n\nMichael said: \"In Georgia and Paul's place, the fridge was completely broken in my room. I only mentioned it once but the show made it look like I never stopped talking about it, but otherwise it's all been positive, it's been really good.\"\n\nAnd appearing on the show had an effect from the moment they sat down for their first viewing party with their staff. Danielle said: \"Before the show was finished, I had to go to one side [from our viewing party] because of the amount of bookings that we're coming through.\n\n\"The phone didn't stop, we had loads of emails. It was crazy.\"\n\nAnd that interest has continued in the week following Fountain Cottage's appearance. Danielle continued: \"It's been continuous, we've had people booking because they've seen us on the telly. People are coming to the café, coming for our breakfast just because they want to try it after seeing it on the show.\"\n\nOne couple who visited for breakfast were travelling from Yorkshire to Kendal - therefore taking a very long detour to taste Michael's Full English. He added: \"It put some pressure on the breakfast I was cooking them!\"\n\nThat couple were obviously more impressed than Stu and Lou, another couple who took part in the show, who said that they wouldn't return to Bellingham as it was \"too remote.\" However, Michael and Danielle aren't letting that \"weird\" comment get them down, and are already anticipating their property bringing more people to the village in Northumberland National Park.\n\nDanielle said: \"We definitely weren't the most remote one from the week, and that came up on payment day. It's a bit of a shock that it didn't make the final cut!\n\nMichael added: \"The area already does itself an absolute solid, it's beautiful with Hareshaw Lynn and being the gateway to Kielder. We just hope to be another part of that and hopefully we portrayed it well on the show.\"\n\nDespite Stu and Lou's unusual comment, Michael and Danielle say that all four couples plan to meet up later in the year and that they got on really well during filming. Danielle said: \"The filming was good, it was tiring and they were long days but we made some new friends.\"\n\nBut before that, it's a busy summer for Fountain Cottage. Michael said: \"Each year has grown and grown and we've got busier year on year. With the show coming out just before it, we're expecting to get busy this summer.\n\n\"We've also got the awards coming up for café of the year at England's Business Awards, which we've been nominated for again. So, we're nervously awaiting finding out if we've won that again - if we've maintained our standards.\"\n\nTo find out more about Fountain Cottage Café and Bed and Breakfast, visit the website.\n\nWhat did you think of Fountain Cottage's appearance on Four In A Bed? Let us know!\n\nRead next"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL3d3dy5oZXJhbGRtYWlsbWVkaWEuY29tL3N0b3J5L2xpZmVzdHlsZS9mZWF0dXJlcy8yMDIzLzAzLzI2L21lcmNlcnNidXJncy1oYXJyaWV0LWxhbmUtaG91c2UtdXBkYXRlZC1mb3ItYmVkLWFuZC1icmVha2Zhc3QvNjk5NTQ3MzQwMDcv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Mar 2023 07:00:00 GMT",
        "title": "Mercersburg's Harriet Lane House updated for bed and breakfast - Herald-Mail Media",
        "content": "Roxann Miller\n\nSahand Miraminy has been painstakingly restoring the historic Harriet Lane Mansion in downtown Mercersburg, Pa., to its former glory, in anticipation of welcoming its first guests to the Inn at Historic Lane House soon.\n\nIt’s been a labor of love for the Washington, D.C., native, who has done much of the work himself.\n\nMiraminy says he’s always had an interest in history and spent most of his professional life involved with historic house museums.\n\n“I always knew that I wanted to live in an old house one day, and fix one up,” he says.\n\nBut it was a late night of scrolling through what Miraminy called “fantasy houses” on Zillow, a real estate website, at four in the morning that drew him to the Lane House.\n\n“I expanded my search slightly and went into Pennsylvania, and I saw this house and it was immediate kismet,” he remembers.\n\nBy 10 a.m. the next morning, Miraminy was in Mercersburg to scope out the property.\n\n“I just fell in love with the house, and I immediately recognized Harriet Lane’s name because I had fixed up a house that she and James Buchanan had used during the summer months in D.C., to use as an event space,” says Miraminy, who works remotely as an event planner.\n\n“It was like all the stars had aligned. I already knew who she was. I already admired her, and this house popped up.”\n\nLane, niece of President James Buchanan, was born in the house. She served as mistress of the White House for her bachelor uncle during his presidency, just before the Civil War.\n\nCalling upon his experience in restoring historic homes and working for the National Trust for Historic Preservation, and his college degree in anthropology and archaeology, Miraminy rolled up his sleeves and started to restore the home to its 1828 appearance.\n\n“I do most of the work myself, but a good portion is also done by hired craftsmen in the area,\" he says.\n\nGrandest house in the region\n\nAt the time of its construction, it was described as the grandest house in the region, Miraminy says.\n\n“It was built at a time when this area was really the frontier, so most of the homes around it were log cabins. So, it sort of loomed over the town; and the Lane family, who married into the Buchanan family, controlled a lot of the trade, real estate and commerce in the area,” Miraminy says.\n\nMore local history:Lost to the ages: City plans park to honor forgotten Hagerstown history dating to 1700s\n\nThe house consists of the main block for the family, a servant’s wing that comes off the house like an L-shape, and several outbuildings.\n\nThere are six gracious bedrooms, each with a fireplace and bathroom.\n\n“I’m going to be renting five of the rooms, so the house will have an occupancy of 10 guests a night,” Miraminy says.\n\nOriginal floors and woodwork\n\nMiraminy is one of only a handful of owners of the Lane House. One of the families, the Weidliches, lived in the home for about 100 years.\n\nLuckily no one has made significant alterations to the house, so all the original woodwork and floors survived, he says.\n\nNearly everything is original to the historic home, except a room on the first floor that served a variety of functions — including a dry goods store, a hardware store and an appliance store in the early 1960s — which has since been restored.\n\nRight now, Miraminy plans to operate the inn by himself.\n\n“I’m going to be running it and cleaning it and marketing it all by myself,\" he says. \"I’m known in my friends’ group as a pretty good cook, so I’ll serve a full, proper breakfast to the inn’s guests.”\n\n“I want to create an environment where people come together from all walks of life, have breakfast together and meet other people who are staying here — kind of this family house feeling to it,” he says. “In my head, I think of it as almost like Thanksgiving — politics is off the table, there are certain topics that are off limits in the house because I want everyone to have a really great time and enjoy themselves.”\n\nThe first modern first lady made her mark\n\n“Both of Harriet’s parents died in the Lane Mansion, along with several of her siblings. She was essentially orphaned, and she asked her uncle James Buchanan to adopt her, and when he became ambassador to Great Britain, she joined him in England and that’s where she became friends with Queen Victoria and became an official consort,” Miraminy says.\n\nWhen James Buchanan became the 15th president of the United States, Lane served alongside him as first lady.\n\n“In her 20s, she was the youngest first lady. She was kind of the Jackie O of her time — wearing low necklines and starting musical performances and diplomatic dinners at the White House. She even created the White House Conservatory,” Miraminy says.\n\nPeople don’t really talk about her anymore, but at one point, she was the most famous woman in the country, says Miraminy.\n\n“They were naming songs, battleships, and perfumes after her, and there was a whole generation of girls named Harriet Lane in the 1800s,\" he notes. \"It’s weird how someone could be so popular, and time fades all that away.\n\n“But it’s fun because I collect anything that has to do with Harriet Lane. Recently, I got a Harriet Lane cigar box and postcards. It’s fun to see all the history come back to the house and come back to life.”\\\n\n“My favorite part of all of this is the research and tracking down original furniture and bringing it back to the house and hanging up portraits of people that haven’t been hung up for 200 years,” says Miraminy.\n\nHe wants guests at the Inn to enjoy a unique experience — almost as if they're staying at a museum.\n\n“The stuff that’s being put in here is very particular, and I’ve searched far and wide at auctions to track down the stuff. It’s not just an old house; there’s so much history recorded on it and even Harriet Lane visited this place as an old woman — she made pilgrimages here, so it was certainly important to her,” Miraminy says.\n\nTuscarora Area Chamber of Commerce Executive Director Chris Ardinger says he can’t wait to see the economic, tourism and quality of life benefits The Inn at the Historic Lane House will bring to Franklin County.\n\n“This beautiful piece of history is a huge asset to our community, and once restorations are completed, the world is the limit,” Ardinger says. \"In a historic town like Mercersburg, history preservation and business growth can sometimes conflict, in this case, Sahand and his team will bring all of that together.\"\n\nMiraminy says it’s a privilege to live in Mercersburg, a town enmeshed in history.\n\n“My hope is that as I fix up this house, it inspires other people to do it,\" he says. \"And folks have been really welcoming and excited that the house is getting the love that it deserves.”\n\nMiraminy is currently taking bookings upon request. Message him at info@lanehouseinn.com.\n\nThis article originally appeared in the winter edition of At Home Places, a Herald-Mail Media publication."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiJ2h0dHBzOi8vd3d3Lm9reC5jb20vbGVhcm4vd2hhdC1pcy1iZXAtMtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Mar 2023 07:00:00 GMT",
        "title": "BEP-2: What You Need To Know - OKX",
        "content": "Binance, one of the largest cryptocurrency exchanges in the world, launched its original mainnet back in 2017. However, three years later, in September 2020, the exchange decided to launch its second blockchain, called Binance Smart Chain (BSC). The original one, on the other hand, was known as Binance Chain or BNB Beacon Chain.\n\nBinance insisted that the new Blockchain was introduced to assist with the development of the company. It made it so that talented developers could make smart contracts, dApps, Decentralized Finance (DeFi) protocols, and more. However, it did not dismiss the original chain, and the two started running side-by-side. The BEP-20 token model, which runs on BSC, was deemed better for development. But what about the original token standard on Binance Chain, known as BEP-2? This guide will explain what BEP-2 is and how it compares to BEP-20.\n\nWhat Is BEP-2?\n\nBEP-2 is a technical standard for the issuance and implementation of tokens on Binance’s original blockchain. It contains a set of rules that tokens using this standard have to follow in order to function.\n\nBinance Chain was originally launched as the exchange’s response to Ethereum and ERC-20. ERC-20 itself is a token model derived from the Ethereum blockchain. Ethereum invented the concept of creating a model, or a blueprint used to create tokens. Before Ethereum, everyone had to build their blockchain and crypto tokens from scratch.\n\nEthereum’s ERC-20 came as a template, which allowed users to launch new tokens with ease. Even those without extensive technical experience can do that today. The fact that there are thousands of cryptocurrencies proves it. BEP-2 came as Binance’s attempt to offer something similar on BNB Beacon Chain.\n\nWhat Is Binance Chain?\n\nBinance Chain is the original blockchain of the digital asset exchange, Binance. It was launched in 2017, and it’s the tech behind BEP-2 — one of Binance’s two cryptocurrency standards. When it comes to technology, it uses a combination of DPoS (Delegated Proof-of-Stake) and pBFT (Practical Byzantine Fault Tolerance). This combination has served it well for block mining. It’s also worth noting that the two consensus algorithms combined offer a great alternative to the energy-consuming Proof-of-Work protocol, used by Bitcoin and formerly Ethereum.\n\nBinance Chain has seen several tokens migrate to its network. Some have switched fully, while others have only sent a portion of their supply to Binance Chain. One example of this is Bitcoin itself, which created a BEP-2 version of itself. Now known as BTCB, it’s a Bitcoin-pegged token on Binance’s network. That means that it still has the same price as BTC, but it can now interact on a different blockchain. This process is known as tokenization, and it produces wrapped versions of assets.\n\nWith BTCB, users can purchase other tokens that run on Binance Chain via Binance’s DEX, the platform’s own decentralized exchange.\n\nWhat Is BEP-20?\n\nDespite its features, Binance Chain was deemed unfit for Decentralized Finance (DeFi). This is why the exchange launched a new blockchain — Binance Smart Chain — with a new token standard. The new standard was named BEP-20, and it is still in use today on BSC.\n\nWhat Is the Difference Between BEP-2 and BEP-20?\n\nApart from the fact that BEP-2 and BEP-20 run on different blockchains, they differ in other ways. A prime example of this concerns smart contract support. BEP-2 doesn’t offer support batch transfers. Meanwhile, BEP-20 was tailored specifically to support smart contracts in Binance’s ecosystem.\n\nThe two differ when it comes to token addresses, as well. BEP-2 token addresses start with “bnb,” while BEP-20 addresses start with “0x,” like ERC-20 addresses. For this reason, BEP-20 tokens are compatible with Ethereum and EVM (Ethereum Virtual Machine) tokens.\n\nIt is also worth noting that the consensus mechanisms that the two token standards run on are different. BEP-2 runs on Proof-of-Work, while BEP-20 uses Proof-of-Stake Authority. BEP-2 also comes with transaction fees, whereas BEP-20 on the other hand, features no transaction fees. Finally, BEP-2 has limited support for scalability, while BEP-20 is a lot more flexible.\n\nHow Do Binance Chain and Binance Smart Chain Differ?\n\nBinance originally launched its Binance Chain — later renamed to BNB Beacon Chain — to run its DEX. In addition to that, it sought to offer anonymous trading and lower commissions, which were not offered on its CEX. Eventually, BNB Chain became a decentralized, community-driven, and permissionless blockchain ecosystem.\n\nBinance Smart Chain, or BSC, was launched in 2020. After Decentralized Finance (DeFi) blew up, projects started emerging all over the crypto industry. Of course, they were primarily coming out on Ethereum, where the concept originated. Developers started creating projects that offered lending, staking, yield farming and more. Binance recognized the opportunity, but it also recognized that Binance Chain was not fit to house DeFi. It had limited scalability, so users had no incentive to switch over from Ethereum.\n\nTo fix the problem, it launched Binance Smart Chain. As mentioned, it was specifically created for smart contracts and DeFi. It had a much more scalable token model and it swiftly attracted new projects as BSC also solved the issue surrounding high transaction fees.\n\nIt did not take long for users to recognize the advantages, which led to the rapid growth of BSC. Of course, many remained loyal to Ethereum and remained on its network. But BSC ended up being an overall success and one of Ethereum’s largest rivals.\n\nHow Does BEP-2 Compare to ERC-20?\n\nBEP-2 is a token standard for minting and deploying tokens on BNB Beacon Chain. ERC-20, on the other hand, is the technical standard for building and implementing smart contracts on Ethereum’s network. As such, it has little in common with BEP-2, even though BEP-2 was inspired by it.\n\nInstead, BEP-20 is much more similar to ERC-20, and it can be said that the two standards are twins. Although BEP-20 was created years after ERC-20, the two serve the same purpose and there are almost no differences between them. Of course, BEP-20 is still in Binance’s ecosystem, while ERC-20 remains in its own Ethereum ecosystem.\n\nWith the launch of Binance Bridge, the two are now connected, however, tokens transferring between the two ecosystems still need to be converted. ERC-20 tokens are still only fully compatible with Ethereum’s ecosystem. As such, they cannot be deployed in another network without converting to its token standard.\n\nBEP-2: The Final Verdict\n\nWhile BEP-2 was Binance’s original token standard that launched on its first blockchain, it is less useful than BEP-20. As a result, there are fewer BEP-2 tokens, and not as many wallets support BEP-2 tokens. There are still some that use it, but these tokens generally lack the use cases of projects from BSC. As a result, they are no longer that common. Still, BEP-2 is still an active standard, and it is useful for those who wish to engage with Binance DEX.\n\nFAQs\n\nWhat Is the Difference Between BEP-2 and BEP-20?\n\nThe main difference between BEP-2 and BEP-20 is that they run on different blockchains. While both chains belong to Binance, BEP-2 is on Binance Chain, and BEP-20 is on Binance Smart Chain. However, they also differ strongly when it comes to what they do and what kind of token standard they are.\n\nWhat Is the Difference Between ERC-20, BEP-2, and BEP-20?\n\nBEP-20 runs on Binance Smart Chain, and it is used for development, launching new tokens, DeFi, dApps, and more. ERC-20 does practically the same but on the Ethereum blockchain. BEP-2 serves as a technical standard for issuing and implementing tokens on Binance’s original blockchain — BNB Beacon Chain (Binance Chain).\n\nIs BEP-2 the Same As Bitcoin?\n\nNo, BEP-2 is the native cryptocurrency that runs on Binance Chain. Bitcoin, on the other hand, is its own coin that runs on the Bitcoin blockchain. However, there is a wrapped version of Bitcoin on the Binance Chain, called Bitcoin BEP2 (BTCB).\n\nHow Do You Tell if a Coin Is BEP-2 or BEP-20?\n\nThe easiest way to differentiate the two is to look at their token address. BEP-2, which runs on BNB Beacon Chain, has an address that starts with “bnb.” BEP-20, which runs on BSC, has an address that starts with “0x,” similar to ERC-20 addresses.\n\nWhat Wallets Support BEP-2?\n\nBEP-2 is not supported by as many wallets as BEP-20. However, you can still store it in Ledger Nano X, Ledger Nano S, Trezor Model T, or Coolwallet S."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiJ2h0dHBzOi8vd3d3Lm9reC5jb20vbGVhcm4vd2hhdC1pcy1iZXAtMtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Mar 2023 07:00:00 GMT",
        "title": "BEP-2: What You Need To Know - OKX",
        "content": "Binance, one of the largest cryptocurrency exchanges in the world, launched its original mainnet back in 2017. However, three years later, in September 2020, the exchange decided to launch its second blockchain, called Binance Smart Chain (BSC). The original one, on the other hand, was known as Binance Chain or BNB Beacon Chain.\n\nBinance insisted that the new Blockchain was introduced to assist with the development of the company. It made it so that talented developers could make smart contracts, dApps, Decentralized Finance (DeFi) protocols, and more. However, it did not dismiss the original chain, and the two started running side-by-side. The BEP-20 token model, which runs on BSC, was deemed better for development. But what about the original token standard on Binance Chain, known as BEP-2? This guide will explain what BEP-2 is and how it compares to BEP-20.\n\nWhat Is BEP-2?\n\nBEP-2 is a technical standard for the issuance and implementation of tokens on Binance’s original blockchain. It contains a set of rules that tokens using this standard have to follow in order to function.\n\nBinance Chain was originally launched as the exchange’s response to Ethereum and ERC-20. ERC-20 itself is a token model derived from the Ethereum blockchain. Ethereum invented the concept of creating a model, or a blueprint used to create tokens. Before Ethereum, everyone had to build their blockchain and crypto tokens from scratch.\n\nEthereum’s ERC-20 came as a template, which allowed users to launch new tokens with ease. Even those without extensive technical experience can do that today. The fact that there are thousands of cryptocurrencies proves it. BEP-2 came as Binance’s attempt to offer something similar on BNB Beacon Chain.\n\nWhat Is Binance Chain?\n\nBinance Chain is the original blockchain of the digital asset exchange, Binance. It was launched in 2017, and it’s the tech behind BEP-2 — one of Binance’s two cryptocurrency standards. When it comes to technology, it uses a combination of DPoS (Delegated Proof-of-Stake) and pBFT (Practical Byzantine Fault Tolerance). This combination has served it well for block mining. It’s also worth noting that the two consensus algorithms combined offer a great alternative to the energy-consuming Proof-of-Work protocol, used by Bitcoin and formerly Ethereum.\n\nBinance Chain has seen several tokens migrate to its network. Some have switched fully, while others have only sent a portion of their supply to Binance Chain. One example of this is Bitcoin itself, which created a BEP-2 version of itself. Now known as BTCB, it’s a Bitcoin-pegged token on Binance’s network. That means that it still has the same price as BTC, but it can now interact on a different blockchain. This process is known as tokenization, and it produces wrapped versions of assets.\n\nWith BTCB, users can purchase other tokens that run on Binance Chain via Binance’s DEX, the platform’s own decentralized exchange.\n\nWhat Is BEP-20?\n\nDespite its features, Binance Chain was deemed unfit for Decentralized Finance (DeFi). This is why the exchange launched a new blockchain — Binance Smart Chain — with a new token standard. The new standard was named BEP-20, and it is still in use today on BSC.\n\nWhat Is the Difference Between BEP-2 and BEP-20?\n\nApart from the fact that BEP-2 and BEP-20 run on different blockchains, they differ in other ways. A prime example of this concerns smart contract support. BEP-2 doesn’t offer support batch transfers. Meanwhile, BEP-20 was tailored specifically to support smart contracts in Binance’s ecosystem.\n\nThe two differ when it comes to token addresses, as well. BEP-2 token addresses start with “bnb,” while BEP-20 addresses start with “0x,” like ERC-20 addresses. For this reason, BEP-20 tokens are compatible with Ethereum and EVM (Ethereum Virtual Machine) tokens.\n\nIt is also worth noting that the consensus mechanisms that the two token standards run on are different. BEP-2 runs on Proof-of-Work, while BEP-20 uses Proof-of-Stake Authority. BEP-2 also comes with transaction fees, whereas BEP-20 on the other hand, features no transaction fees. Finally, BEP-2 has limited support for scalability, while BEP-20 is a lot more flexible.\n\nHow Do Binance Chain and Binance Smart Chain Differ?\n\nBinance originally launched its Binance Chain — later renamed to BNB Beacon Chain — to run its DEX. In addition to that, it sought to offer anonymous trading and lower commissions, which were not offered on its CEX. Eventually, BNB Chain became a decentralized, community-driven, and permissionless blockchain ecosystem.\n\nBinance Smart Chain, or BSC, was launched in 2020. After Decentralized Finance (DeFi) blew up, projects started emerging all over the crypto industry. Of course, they were primarily coming out on Ethereum, where the concept originated. Developers started creating projects that offered lending, staking, yield farming and more. Binance recognized the opportunity, but it also recognized that Binance Chain was not fit to house DeFi. It had limited scalability, so users had no incentive to switch over from Ethereum.\n\nTo fix the problem, it launched Binance Smart Chain. As mentioned, it was specifically created for smart contracts and DeFi. It had a much more scalable token model and it swiftly attracted new projects as BSC also solved the issue surrounding high transaction fees.\n\nIt did not take long for users to recognize the advantages, which led to the rapid growth of BSC. Of course, many remained loyal to Ethereum and remained on its network. But BSC ended up being an overall success and one of Ethereum’s largest rivals.\n\nHow Does BEP-2 Compare to ERC-20?\n\nBEP-2 is a token standard for minting and deploying tokens on BNB Beacon Chain. ERC-20, on the other hand, is the technical standard for building and implementing smart contracts on Ethereum’s network. As such, it has little in common with BEP-2, even though BEP-2 was inspired by it.\n\nInstead, BEP-20 is much more similar to ERC-20, and it can be said that the two standards are twins. Although BEP-20 was created years after ERC-20, the two serve the same purpose and there are almost no differences between them. Of course, BEP-20 is still in Binance’s ecosystem, while ERC-20 remains in its own Ethereum ecosystem.\n\nWith the launch of Binance Bridge, the two are now connected, however, tokens transferring between the two ecosystems still need to be converted. ERC-20 tokens are still only fully compatible with Ethereum’s ecosystem. As such, they cannot be deployed in another network without converting to its token standard.\n\nBEP-2: The Final Verdict\n\nWhile BEP-2 was Binance’s original token standard that launched on its first blockchain, it is less useful than BEP-20. As a result, there are fewer BEP-2 tokens, and not as many wallets support BEP-2 tokens. There are still some that use it, but these tokens generally lack the use cases of projects from BSC. As a result, they are no longer that common. Still, BEP-2 is still an active standard, and it is useful for those who wish to engage with Binance DEX.\n\nFAQs\n\nWhat Is the Difference Between BEP-2 and BEP-20?\n\nThe main difference between BEP-2 and BEP-20 is that they run on different blockchains. While both chains belong to Binance, BEP-2 is on Binance Chain, and BEP-20 is on Binance Smart Chain. However, they also differ strongly when it comes to what they do and what kind of token standard they are.\n\nWhat Is the Difference Between ERC-20, BEP-2, and BEP-20?\n\nBEP-20 runs on Binance Smart Chain, and it is used for development, launching new tokens, DeFi, dApps, and more. ERC-20 does practically the same but on the Ethereum blockchain. BEP-2 serves as a technical standard for issuing and implementing tokens on Binance’s original blockchain — BNB Beacon Chain (Binance Chain).\n\nIs BEP-2 the Same As Bitcoin?\n\nNo, BEP-2 is the native cryptocurrency that runs on Binance Chain. Bitcoin, on the other hand, is its own coin that runs on the Bitcoin blockchain. However, there is a wrapped version of Bitcoin on the Binance Chain, called Bitcoin BEP2 (BTCB).\n\nHow Do You Tell if a Coin Is BEP-2 or BEP-20?\n\nThe easiest way to differentiate the two is to look at their token address. BEP-2, which runs on BNB Beacon Chain, has an address that starts with “bnb.” BEP-20, which runs on BSC, has an address that starts with “0x,” similar to ERC-20 addresses.\n\nWhat Wallets Support BEP-2?\n\nBEP-2 is not supported by as many wallets as BEP-20. However, you can still store it in Ledger Nano X, Ledger Nano S, Trezor Model T, or Coolwallet S."
    }
]