[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vc3VubmV3c29ubGluZS5jb20vanVzdC1pbi1iaW5hbmNlLWNlby1kZWNsYXJlcy1iaW5hbmNlLW5pZ2VyaWEtbGltaXRlZC1zY2FtLWVudGl0eS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 18 Jun 2023 07:00:00 GMT",
        "title": "JUST IN: Binance CEO declares 'Binance Nigeria Limited scam entity' – The Sun Nigeria - The Sun Nigeria",
        "content": "Changpeng Zhao, the Chief Executive Officer of Binance, a global crypto currency exchange platform has declared Binance Nigeria as a scam.\n\nZhao made this known on Sunday via his Twitter handle @cz_binance , saying, “Binance have issued cease & desist notice to the scammer entity “Binance Nigeria Limited”.\n\nHe urged Nigerians and persons falling for these scam that they should “not believe everything you read in the news.”\n\nDetails later…"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZ2F6ZXR0ZW5nci5jb20vYmluYW5jZS1uaWdlcmlhLWxpbWl0ZWQtaXMtc2NhbS1lbnRpdHktY2hhbmdwZW5nLXpoYW8v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 18 Jun 2023 07:00:00 GMT",
        "title": "Binance Nigeria Limited is scam entity: Changpeng Zhao - Peoples Gazette",
        "content": "Changpeng Zhao, Binance Chief Executive Officer, has declared Binace Nigeria Limited a scammer entity, warning the public not to believe whatever they read in the news about it.\n\nThe world’s largest crypto market dissociated itself from Binance Nigeria Limited in a tweet Mr Zhao on Sunday morning.\n\n“Binance has issued cease & desist notice to the scammer entity “Binance Nigeria Limited,” Mr Zhao tweeted. “Don’t believe everything you read in the news.”\n\nThis comes a few days after Nigerian Security Exchange Commission banned Binance Nigeria Limited.\n\n“Binance Nigeria Limited is neither registered nor regulated by the Commission and its operations in Nigeria are therefore illegal. Any member of the investing public dealing with the entity is doing so at his/her own risk,” SEC said in a statement."
    }
]