[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vY29pbmNoYXB0ZXIuY29tL2JuYi1yaXNrcy1hLTMwLWRyb3Atd2hpbGUtYXVzdHJhbGlhbi1wYXltZW50LXNlcnZpY2UtcHJvdmlkZXItY3V0cy1iaW5hbmNlLW9mZi_SAWtodHRwczovL2NvaW5jaGFwdGVyLmNvbS9ibmItcmlza3MtYS0zMC1kcm9wLXdoaWxlLWF1c3RyYWxpYW4tcGF5bWVudC1zZXJ2aWNlLXByb3ZpZGVyLWN1dHMtYmluYW5jZS1vZmYvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "BNB Risks a 30% Drop While Australian Payment Service Provider Cuts Binance off - CoinChapter",
        "content": "Key Takeaways:\n\nBNB could drop to its year-low by the end of Q2.\n\nTechnical back the bearish prognosis.\n\nWestpac Bank discontinued Binance Australia support.\n\nYEREVAN (CoinChapter.com) – Binance’s in-house token BNB has flatlined for the previous ten days and changed hands at $310 in the Asian Pacific session on May 19. The token also risked a 30% drop in the current quarter due to a bearish technical setup.\n\nBNB is headed to a year’s low\n\nBNB has been trading within a pattern dubbed the ‘rising wedge.’ The latter entails two converging trendlines and a significant mid-range that take the token price incrementally higher while lowering the price swing, as seen in the chart below.\n\nBinance coin (BNB) price action in a rising wedge. Source: TradingView.com\n\nThe rising wedge is a bearish reversal pattern predicting a drop equal to the wedge’s maximal height after the asset price action breaks below the support. As of May 19, BNB retested the support and did not confirm the rising wedge yet.\n\nHowever, given the declining trading volumes and the bearish MACD oscillator, a further drop in price appears likely. If confirmed, the rising wedge could take Binance coin as low as $208, or 30% below the current value.\n\nBinance Australia discontinues withdrawals.\n\nBinance Australia said on May 18 that it is “unable to facilitate PayID AUD deposits for Binance users” due to a third-party payment service provider – Westpac Bank’s decision to discontinue support for the crypto exchange.\n\nScott Collary, the group executive of customer services and technology at Westpac, asserted the following:\n\nDigital exchanges have a legitimate role to play in the financial ecosystem. But since the rise of digital currency, we’ve noticed that scammers are increasingly using overseas exchanges. said Collary.\n\nThe bank also asserted that Westpac customers typically discover they have been scammed when the funds have already left the country. At that point, recovering the stolen funds is “extremely difficult.”\n\nBinance Australia informed its clients that the company is “working hard to find an alternative provider to continue offering AUD deposits and withdrawals to our users.”\n\nFellow Binancians,\n\n\n\nWe regret to inform you that with immediate effect we are unable to facilitate PayID AUD deposits for Binance users due to a decision made by our third party payment service provider. We understand from our third party payment service provider that Bank… — Binance Australia (@Binance_AUS) May 18, 2023\n\nBinance also noted that users could “rest assured” that their funds are safe through the Secure Asset Fund for Users (SAFU), an insurance fund that offers protection to Binance users and their funds in the event of extreme situations.\n\nAlso, read: Lido DAO Presents Proposal LDO Staking Plan As Token Outshines Peers."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8venljcnlwdG8uY29tL3dlZmktbWFrZXMtd2F2ZXMtaW4tZGVmaS13ZWZpLXRva2VuLWxhdW5jaGVzLW9uLXF1aWNrc3dhcC1hbmQtbWV4Yy1nbG9iYWwtZXhwYW5kaW5nLXVzZXItYWNjZXNzaWJpbGl0eS_SAYABaHR0cHM6Ly96eWNyeXB0by5jb20vd2VmaS1tYWtlcy13YXZlcy1pbi1kZWZpLXdlZmktdG9rZW4tbGF1bmNoZXMtb24tcXVpY2tzd2FwLWFuZC1tZXhjLWdsb2JhbC1leHBhbmRpbmctdXNlci1hY2Nlc3NpYmlsaXR5Lz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "WeFi Makes Waves in DeFi: $WEFI Token Launches on QuickSwap and MEXC Global, Expanding User Accessibility - ZyCrypto",
        "content": "Advertisement\n\nWeFi, a leading decentralized money market protocol where users can lend and borrow digital assets, is set to create a new standard for the DeFi space with its high-yield lending pool. This follows a series of successful token launches and an Initial DEX Offering (IDO).\n\nBeing a leading player in the decentralized finance (DeFi) space, WeFi continues to solidify its position with a remarkable entry onto the QuickSwap platform and a listing on MEXC Global. These strategic moves provide users unparalleled access to the $WEFI token, unlocking a world of opportunities on the Polygon network and through a renowned digital assets exchange.\n\nApart from its token launch on QuickSwap, and listing on MEXC Global, WeFi has also achieved a strategic partnership with Gamma Strategies, enabling it to pioneer a lucrative high-yield lending pool. This highlights its remarkable growth trajectory in the DeFi space.\n\nAccording to an official press release, the conclusion of its IDO on Kommunitas and Spores on May 5th, 2023, has influenced an impressive entry onto the QuickSwap platform. This launch enables users to access the $WEFI token on the Polygon network, benefiting from the network’s low gas fees and high-speed transactions. Furthermore, WeFi’s $WEFI token is now available on MEXC Global, a renowned digital assets exchange known for its user-friendly interface, secure environment, and diverse token selection. By offering dual-platform availability, WeFi ensures enhanced accessibility and choice for users in their trading activities.\n\nWhile expressing enthusiasm about these recent developments, Pranjal Prashar, the Founder and CEO of WeFi, highlighted the potential of Omnichain DeFi for the wider DeFi community and stated, “It feels like just day 1, from our successful IDO to our token’s launch on QuickSwap and MEXC Global, we are excited about the progress we are making and the potential Omnichain DeFi holds for the wider DeFi community. Our lending pool is just one example of our core use cases.”\n\nAdvertisement\n\nFurthermore, WeFi’s collaboration with Gamma Strategies also aims to incentivize the $WEFI-ETH/WEFI-USDC liquidity position on QuickSwap. The partnership also lays the groundwork for a possible integration of Chainlink Oracle for $WEFI and aligns with WeFi’s integration with LayerZero, aiming to establish $WEFI as an omnichain token across multiple blockchains.\n\n“We are thrilled to collaborate with Gamma Strategies, which promises to bring in-depth management to our liquidity position,” added Prashar. “This partnership holds enormous potential for optimizing the benefits for our users.”\n\nAdding to these achievements, WeFi announced the upcoming launch of its high-yield lending pool, offering an exceptional annual percentage yield (APY) of over 40%. This new addition to WeFi’s diverse suite of pools, such as USDC, USDT, and WETH pools, presents users with an unparalleled opportunity to earn remarkable returns."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vdGhlYXRsYW50YXZvaWNlLmNvbS9ib3RoLWJpZy1hbmQtc21hbGwtYmxhY2stb3duZWQtaG90ZWxzLWluLWdlb3JnaWEtYXJlLXNsb3dseS1ncm93aW5nL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "Both big and small, Black-owned hotels in Georgia are slowly growing - The Atlanta Voice",
        "content": "According to the National Association of Black Hotel Owners, Operators and Developers (NABHOOD) there are just nine Black-owned hotels in metro Atlanta. The Atlanta Voice explored a number of Black-owned hotels in order to further highlight the existences in the city’s hospitality space.\n\nThe Hamilton Howell House\n\nBy Isaiah Singleton\n\nIn the heart of Sweet Auburn in Atlanta’s Old Fourth Ward, just around the corner from the Martin Luther King Jr. National Historic Park and a mile from downtown, the Hamilton Howell House sits with decades of history and events.\n\nThe Hamilton Howell House, a bed and breakfast, was built in 1893 by Alexander Hamilton, Jr., the leading African American contractor, and builder in Atlanta as his family’s home.\n\nThe Howell/Youngblood family acquired the house in 1984, making them only the second family to live in the home since it was built 91 years earlier.\n\nThe rooms of the home have been named for American cultural icons such as Aretha Franklin – the Queen of Soul, but whose talent spanned all genres of music. Sun Ra – the avant-garde jazz musician. W.E.B. DuBois – scholar, author, philosopher, and activist. Elizabeth Catlett – painter, printmaker, and sculptor. Maya Angelou – poet, singer, playwright, director, and activist. John Coltrane – pioneering jazz saxophonist and composer.\n\nThe Hamilton Howell House is located at 102 Howell St NE, Atlanta.\n\nFor more information, visit https://www.hamiltonhowellhouse.com/. For information on how to book a stay at the Hamilton Howell House, visit https://www.hamiltonhowellhouse.com/eventspace.\n\nThe Hyatt Centric Midtown Atlanta\n\nBy Janelle Ward\n\nThe Hyatt Centric in Midtown is a 194-room hotel situated within walking distance of Piedmont Park and Georgia Tech. The property is also located in close proximity to Google’s Atlanta office, the Federal Reserve Bank of Atlanta and several local eateries. Public amenities for guests include two fully-functional restaurants, a swimming pool, fitness center and 3,700 square feet of conference space capable of holding up to 200 guests.\n\nRLJ Lodging Trust purchased the property in 2014, converting it to the first Hyatt Centric hotel in the state four years later. The trust was founded by Robert L. Johnson, an entrepreneur perhaps best known for co-founding the pro-Black television network BET in 1980. The REIT is the successor of RLJ Development, a hotel investment platform formed in 2000 by Johnson and his business partner, Thomas J. Baltimore, Jr. RLJ Lodging Trust became publicly traded in 2011, merged with another lodging trust in 2017 and evolved into the real estate investment trust tycoon it’s recognized as today in the following years.\n\nThe trust has since acquired approximately 100 branded hotels located across 23 states and Washington, D.C. RLJ Lodging Trust now owns five hotels in Atlanta, three in Midtown and two in Buckhead.\n\nThree-part formula for achieving real estate success in the hotel business\n\nBy Noah Washington\n\nLess than 2% of hotel proprietors are Black, according to research conducted in 2022 by the National Association of Black Hotel Owners, Operators, and Developers (NABHOOD). Jessica Myers is currently making history in the hotel real estate industry. Myers is a part of an exclusive group of Black and female hotel owners in America. An Atlanta resident and Georgia State University graduate, Myers was introduced to real estate through a career in media sales for CBS while in New York City. Through CBS, Myers was introduced to real estate investment trusts (REITS).\n\n\n\nAfter learning wholesaling, a strategy that involves a wholesaler obtaining a contract on a property with its seller and in turn selling the contract to an investor, Myers learned about how investors were able to borrow money and leverage debt to gain access to capital, and realized that she could do the same.\n\nThis was the beginning of Myers’ reign in real estate in America. Myers later made headlines with her partner, Davonne Reaves, after acquiring Home 2 Suites in El Reno, Oklahoma. The hotel, valued at $8.3 million dollars in early 2021, made the two the youngest Black hotel owners in the industry. At this point, Myers was very comfortable putting deals of this caliber together.\n\n“That was the entryway into the commercial space, which then led to more partnerships with more people, which then led to two more hotels,” Myers said.\n\nMyers came up with a three-part formula for achieving real estate success, comprising:\n\nOpportunity The knowledge on how to capitalize on said opportunity The capital to execute.\n\n\n\nWhen first meeting with Reaves, the two decided early on who would take on what role, and from there they were able to come together with multiple firms that would ultimately fund their excursion that led them to the acquisition of their first hotel. “We are currently working on an international resort,” added Myers."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDUvMTkvaG93LXRvLXNlbGwtYmluYW5jZS1jb2luLWluLWR1YmFpL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "How to Sell Binance Coin (BNB) in Dubai - Crypto Times",
        "content": "Selling BNB (Binance Coin) in Dubai can be a straightforward process, and it is important to be familiar with the steps involved. BNB is a cryptocurrency that is gaining popularity due to its multiple use cases, including being used as a payment method on the Binance exchange and powering the Binance Smart Chain.\n\nIf you own BNB and are looking to sell it in Dubai, there are several methods available to you, each with its own advantages and disadvantages. This guide will provide you with a step-by-step process on how to sell your BNB coins in Dubai.\n\nHere are the 5 important Steps to Sell your BNB in Dubai\n\nBinance Coin (BNB) is one of the fastest-growing cryptocurrencies, and it has gained immense popularity over the past few years. Following are the steps to sell BNB in Dubai.\n\nStep 1: Choose a Cryptocurrency Exchange\n\nThe first step to selling BNB in Dubai is to choose a reliable cryptocurrency exchange. It is crucial to research and compare the fees and services offered by different exchanges before choosing one.\n\nStep 2: Register and Verify Your Account\n\nOnce you have chosen an exchange, the next step is to register and verify your account. You will need to provide personal details such as your name, email address, and phone number, as well as proof of identity and address.\n\nStep 3: Transfer Your BNB Coins to the Exchange\n\nAfter verifying your account, the next step is to transfer your Binance Coins to the exchange wallet. This can be done by navigating to the wallet section of the exchange, selecting the BNB coin, and clicking on the deposit button. You will be provided with a unique wallet address, which you should use to transfer your Binance Coins from your personal wallet.\n\nStep 4: Sell Your Binance Coins\n\nOnce your Binance Coins have been transferred to the exchange wallet, the next step is to sell them. Navigate to the exchange’s trading section, select the Binance Coin, and choose the option to sell. Enter the amount of Binance Coin you wish to sell and the currency you want to receive. Review the transaction details and click on the sell button.\n\nStep 5: Withdraw Your Funds\n\nAfter selling your Binance Coins, the final step is to withdraw your funds. Navigate to the withdrawal section of the exchange, select the currency you want to withdraw, and enter the wallet address where you want to receive the funds. Review the transaction details and click on the withdraw button.\n\nWhy You Should Consider Selling BNB in Dubai?\n\nThere are several compelling reasons why you should consider selling BNB in Dubai:\n\nThriving Cryptocurrency Ecosystem:\n\nDubai has established itself as a global cryptocurrency hub, with a vibrant and well-regulated ecosystem. Selling BNB in Dubai means tapping into a market that understands and embraces cryptocurrencies, providing a seamless and efficient selling experience.\n\nAccess to a Diverse Investor Base:\n\nDubai attracts a diverse range of investors from around the world, including high-net-worth individuals and institutional investors. By selling BNB in Dubai, you gain exposure to this vast investor network, increasing your chances of finding competitive offers and securing a favorable selling price.\n\nAccess to a Diverse Investor Base:\n\nDubai is a global financial hub, attracting investors from around the world. Selling BNB coins in Dubai exposes you to a diverse pool of potential buyers, increasing the likelihood of finding competitive offers and securing a favorable selling price.\n\nLeverage Dubai’s Advanced Infrastructure and Technology:\n\nDubai’s infrastructure is known for its advanced technological capabilities, making it an ideal environment for selling BNB. The city offers state-of-the-art cryptocurrency exchanges, secure wallet providers, and robust liquidity networks, ensuring a smooth and secure selling process.\n\nTax Advantages:\n\nDubai is known for its favorable tax environment, with no personal income tax or capital gains tax. Selling BNB in Dubai may provide tax advantages compared to other jurisdictions, allowing you to retain a higher portion of your proceeds.\n\nBenefits of Selling BNB in Dubai\n\nThere are several benefits to selling BNB in Dubai. Following are some of the advantages you must note:\n\nProfit: If you have purchased BNB at a lower price and the value of BNB has increased, selling it can help you earn a profit.\n\nLiquidity: Selling BNB provides liquidity to investors and traders. By selling BNB, you can convert it into other currencies or assets, allowing you to diversify your investment portfolio.\n\nRisk management: Selling BNB can help you manage your risk exposure. If you have a large amount of BNB, selling some of it can help you reduce the risk of holding all your assets in one type of currency.\n\nCash flow: Selling BNB can provide you with cash flow, which can be useful for various purposes, such as paying off debt or funding other investments.\n\nTax implications: Selling BNB can also have tax implications. If you have held BNB for more than a year, you may be eligible for long-term capital gains tax, which is usually lower than short-term capital gains tax. Selling BNB can also help you offset any capital gains tax liabilities you may have.\n\nTo Summarize:\n\nSelling Binance Coins in Dubai is a straightforward process that can be completed in a few easy steps. It is important to choose a reliable cryptocurrency exchange, register and verify your account, transfer your coins, sell them, and withdraw your funds. With the right knowledge and a little research, you can sell your Binance Coins quickly and easily."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDUvMTkvaG93LXRvLXNlbGwtYmluYW5jZS1jb2luLWluLWR1YmFpL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "How to Sell Binance Coin (BNB) in Dubai - Crypto Times",
        "content": "Selling BNB (Binance Coin) in Dubai can be a straightforward process, and it is important to be familiar with the steps involved. BNB is a cryptocurrency that is gaining popularity due to its multiple use cases, including being used as a payment method on the Binance exchange and powering the Binance Smart Chain.\n\nIf you own BNB and are looking to sell it in Dubai, there are several methods available to you, each with its own advantages and disadvantages. This guide will provide you with a step-by-step process on how to sell your BNB coins in Dubai.\n\nHere are the 5 important Steps to Sell your BNB in Dubai\n\nBinance Coin (BNB) is one of the fastest-growing cryptocurrencies, and it has gained immense popularity over the past few years. Following are the steps to sell BNB in Dubai.\n\nStep 1: Choose a Cryptocurrency Exchange\n\nThe first step to selling BNB in Dubai is to choose a reliable cryptocurrency exchange. It is crucial to research and compare the fees and services offered by different exchanges before choosing one.\n\nStep 2: Register and Verify Your Account\n\nOnce you have chosen an exchange, the next step is to register and verify your account. You will need to provide personal details such as your name, email address, and phone number, as well as proof of identity and address.\n\nStep 3: Transfer Your BNB Coins to the Exchange\n\nAfter verifying your account, the next step is to transfer your Binance Coins to the exchange wallet. This can be done by navigating to the wallet section of the exchange, selecting the BNB coin, and clicking on the deposit button. You will be provided with a unique wallet address, which you should use to transfer your Binance Coins from your personal wallet.\n\nStep 4: Sell Your Binance Coins\n\nOnce your Binance Coins have been transferred to the exchange wallet, the next step is to sell them. Navigate to the exchange’s trading section, select the Binance Coin, and choose the option to sell. Enter the amount of Binance Coin you wish to sell and the currency you want to receive. Review the transaction details and click on the sell button.\n\nStep 5: Withdraw Your Funds\n\nAfter selling your Binance Coins, the final step is to withdraw your funds. Navigate to the withdrawal section of the exchange, select the currency you want to withdraw, and enter the wallet address where you want to receive the funds. Review the transaction details and click on the withdraw button.\n\nWhy You Should Consider Selling BNB in Dubai?\n\nThere are several compelling reasons why you should consider selling BNB in Dubai:\n\nThriving Cryptocurrency Ecosystem:\n\nDubai has established itself as a global cryptocurrency hub, with a vibrant and well-regulated ecosystem. Selling BNB in Dubai means tapping into a market that understands and embraces cryptocurrencies, providing a seamless and efficient selling experience.\n\nAccess to a Diverse Investor Base:\n\nDubai attracts a diverse range of investors from around the world, including high-net-worth individuals and institutional investors. By selling BNB in Dubai, you gain exposure to this vast investor network, increasing your chances of finding competitive offers and securing a favorable selling price.\n\nAccess to a Diverse Investor Base:\n\nDubai is a global financial hub, attracting investors from around the world. Selling BNB coins in Dubai exposes you to a diverse pool of potential buyers, increasing the likelihood of finding competitive offers and securing a favorable selling price.\n\nLeverage Dubai’s Advanced Infrastructure and Technology:\n\nDubai’s infrastructure is known for its advanced technological capabilities, making it an ideal environment for selling BNB. The city offers state-of-the-art cryptocurrency exchanges, secure wallet providers, and robust liquidity networks, ensuring a smooth and secure selling process.\n\nTax Advantages:\n\nDubai is known for its favorable tax environment, with no personal income tax or capital gains tax. Selling BNB in Dubai may provide tax advantages compared to other jurisdictions, allowing you to retain a higher portion of your proceeds.\n\nBenefits of Selling BNB in Dubai\n\nThere are several benefits to selling BNB in Dubai. Following are some of the advantages you must note:\n\nProfit: If you have purchased BNB at a lower price and the value of BNB has increased, selling it can help you earn a profit.\n\nLiquidity: Selling BNB provides liquidity to investors and traders. By selling BNB, you can convert it into other currencies or assets, allowing you to diversify your investment portfolio.\n\nRisk management: Selling BNB can help you manage your risk exposure. If you have a large amount of BNB, selling some of it can help you reduce the risk of holding all your assets in one type of currency.\n\nCash flow: Selling BNB can provide you with cash flow, which can be useful for various purposes, such as paying off debt or funding other investments.\n\nTax implications: Selling BNB can also have tax implications. If you have held BNB for more than a year, you may be eligible for long-term capital gains tax, which is usually lower than short-term capital gains tax. Selling BNB can also help you offset any capital gains tax liabilities you may have.\n\nTo Summarize:\n\nSelling Binance Coins in Dubai is a straightforward process that can be completed in a few easy steps. It is important to choose a reliable cryptocurrency exchange, register and verify your account, transfer your coins, sell them, and withdraw your funds. With the right knowledge and a little research, you can sell your Binance Coins quickly and easily."
    }
]