[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMDkvYmluYW5jZXVzLXN1c3BlbmRzLXVzZS1vZi1maWF0LWFzLWxlZ2FsLXRyb3VibGVzLW1vdW50L9IBZ2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMDkvYmluYW5jZXVzLXN1c3BlbmRzLXVzZS1vZi1maWF0LWFzLWxlZ2FsLXRyb3VibGVzLW1vdW50L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Jun 2023 07:00:00 GMT",
        "title": "Binance.US Suspends Use of Fiat as Legal Troubles Mount - CoinDesk",
        "content": "On Tuesday, the SEC filed for a temporary restraining order to freeze certain assets tied to Binance.US. The two are due back in court on June 13 regarding the matter — the same day Binance.US says it's transitioning to an all-crypto exchange."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMimgFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2NyeXB0by90b2tlbi9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1ob2xkcy0yNjAwMC1ldGhlcmV1bS1zbGlwcy1iZWxvdy0xODUwLXNvbGFuYS1ibmItZmFsbC11cC10by04LTM4NDY5My0yMDIzLTA2LTA40gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Jun 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin holds $26000; Ethereum slips below $1850; Solana & BNB fall up to 8% - Business Today",
        "content": "Bitcoin was back in the blue on Thursday amid a wider crypto decline that swept up altcoins mentioned and unmentioned in the Securities and Exchange (SEC) lawsuits against Binance and Coinbase earlier this week. Investors appear to price in the latest regulatory body blows against an industry already reeling from assorted debacles.\n\nBitcoin was back in the red as the largest crypto token dropped about 2 per cent barely holding the $26,000 mark. Its largest peer, Ethereum, was also in down as it declined more than 2 per cent and slipped below the $1,850 mark once again. However, the pain in the altcoins was severe.\n\n\n\n\"Bitcoin experienced a drop below the $26,400 threshold due to the ongoing tensions between SEC and Binance and Coinbase. Despite attempts, BTC failed to recover beyond the $27,000 mark. Presently, BTC's support rests at the $26,200 level, while resistance is observed at the $26,600 level,\" said Edul Patel, CEO and Co-founder of Mudrex.\n\n\n\n\"If the immediate resistance is successfully surpassed, it may propel the price even higher. Concurrently, many altcoins also recorded declines in the past day. The second largest cryptocurrency is currently being traded at the $1,830 level. ETH continues to face difficulties in surpassing the $1,900 resistance level as bears are active around this threshold,\" he further said.\n\n\n\nBarring the US dollar-pegged stablecoin Tether, all other top crypto tokens were trading sharply lower on Thursday. Solana tanked more than 8 per cent, whereas BNB and Cardano dropped 7 per cent each. Polygon declined 6 per cent, while Avalanche was down 4 per cent.\n\n\n\nThe global cryptocurrency market cap was trading sharply lower, falling down to the $1.1 trillion mark as it dropped more than 2 per cent in the last 24 hours. However, the total trading volumes tumbled more than 16 per cent to $38.18 billion.\n\n\n\nBitcoin recently witnessed a significant drop, while some altcoins such as Ethereum (ETH) and Lido (LDO) managed to recover from the previous fall in value as well, this price movement hasn't been mirrored by several altcoins that failed to respond in a similar manner, said CoinDCX Research Team.\n\n\n\n\"Banking infrastructure giant, SWIFT's collaboration with blockchain infrastructure firm Chainlink marks a significant step towards enhanced blockchain interoperability. With Chainlink's Cross-Chain Interoperability Protocol (CCIP), banks are now testing secure transactions on multiple blockchains using a single interface,\" it further stated.\n\n\n\nImage: Crypto-chart-price\n\n\n\nTech View by WazirX Trade Desk\n\n\n\nStella, previously called Alpha Finance, offers a borrowing cost of 0% whose primary goal is to revolutionize the mechanics of leveraged DeFi. By fostering increased utilization of these foundational components, Stella aims to facilitate the emergence of new protocols and innovative solutions that can leverage the abundant liquidity and strong infrastructure available.\n\nImage: Chart-Stella\n\n\n\nOn the weekly timeframe, the ALPHA/USDT trend had been consolidating around $0.1 levels since April of this year. The weekly chart has broken above the descending trendline with a buying volume surge. Immediate support is expected at 0.115 USDT and the next resistance is expected at 0.155 USDT.\n\n\n\n\n\n(Views and recommendations given in this section are the analysts' own and do not represent those of Business Today. Please consult your financial adviser before taking any position in the asset/s mentioned.)"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMilwFodHRwczovL3d3dy5ic2MubmV3cy9wb3N0L2ludmVzdG9ycy1hcmUtc2hpZnRpbmctaW50ZXJlc3QtdG8taW5xdWJldGEtcXViZS1iaW5hbmNlLWNvaW4tYm5iLWFuZC1jYXJkYW5vLWFkYS1hcy10aGV5LWxvb2stZm9yLXRoZS1iZXN0LWNyeXB0by10by1idXktbm930gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Jun 2023 07:00:00 GMT",
        "title": "Investors Are Shifting Interest to InQubeta (QUBE), Binance Coin (BNB), and Cardano (ADA) as They Look for the Best ... - BSC NEWS",
        "content": "ETH\n\nHaving raised over $295k in its ongoing presale, InQubeta continues to attract investor attention by offering investors the opportunity to buy equity-based NFTs of AI projects.\n\nThe crypto market has been at the center of innovation as new projects with unique offerings have been introduced. As new tokens enter the market, many investors look for significant returns. This is making them search for the best crypto to buy now for beginners and veterans alike.\n\nInQubeta (QUBE) is gaining traction as it attracts the attention of major investors in its first few days of the presale rally. The emerging token is investment-worthy, with over $295k raised so far. The token has the potential to become one of the best cryptos to invest in for massive gains, and investors are not taking any chances.\n\nInvestors are moving to InQubeta because of its enormous potential. This DeFi project keeps getting attention from the media and investors, alongside top 10 crypto powerhouses such as Binance Coin (BNB) and Cardano (ADA).\n\nWe shall examine why InQubeta, Binance Coin, and Cardano are attractive investment options.\n\nInQubeta (QUBE) is a crowdfunding platform for AI startups and projects\n\nInQubeta entered the market with a focus on expanding the artificial intelligence market. The innovative token leverages the DeFi market and AI technology's evolution. The token's presale run has been massive, with over $295k raised in a few days of launch. The token shows that it is a worthy investment option for anyone looking to increase their investment portfolio.\n\nAs a DeFi project, InQubeta allows investors to contribute to the growth of the artificial intelligence industry by allowing them access to the NFT marketplace. Investors will have the chance to buy equity-based NFTs of their most preferred projects. After buying these NFTs, they will own factions of the projects.\n\nThe QUBE token is a high-growth token with lots of promises. The token is one of the best cryptos for long-term returns. QUBE uses deflationary mechanics that will see the coin increase in value rapidly. Experts predict that the value of the QUBE token will increase by over 5000% before the end of the year.\n\nIn addition, InQubeta is positioned as the best crypto investment in 2023 because the innovative idea has been designed and created using the best technology available on the market today. It uses verified smart contracts that offer transparency and reliability while promising maximum security for funds. QUBE holders are eligible to receive maximum returns from the profits of the project they invest in. As the enthusiasm surrounding the AI industry increases this year, InQubeta will experience a surge in value as investors look to invest extensively in this industry. The growth of the QUBE token has been remarkable, and analysts predict that the coin will be listed on many top exchange platforms upon launch.\n\nVisit InQubeta Presale\n\nBinance Coin (BNB) retreats amidst market pressures\n\nBinance Coin has gained popularity in the crypto market because of the Binance exchange platform. The coin has a market cap of over $50 billion and is one of the top crypto coins for investment. BNB value has fluctuated within the last week, raising concerns for investors as the price dipped a few points.\n\nBinance Coin has remained a market leader because of its growth rate. The token is one of the most performing cryptos, with millions of users. Analysts predict that the BNB token is bound for growth.\n\nCardano (ADA) achieves a new milestone\n\nCardano has reached a new milestone as its staking value surpasses 400 million ADA. The token has made a tremendous leap to the top ten decentralized exchanges by trading volume with Minswap. This new feat puts the ADA token among the best investments.\n\nCardano's rally keeps increasing as investors move to the token for the best returns. The token indicates a higher gain on the long-term charts. This shows that ADA is an investment-worthy token.\n\nVisit InQubeta Presale\n\nFinal words\n\nInQubeta's presale is among the most talked about in the crypto market. This innovative token keeps attracting new and veteran investors. InQubeta is establishing a more democratic and community-driven ecosystem by converting the QUBE token into a governance token. This will encourage token holders to participate actively. Holders will also determine the platform's future and contribute to the growth and success of AI technology startups. You can start investing now before the price increases.\n\nVisit InQubeta Presale"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMilwFodHRwczovL3d3dy5ic2MubmV3cy9wb3N0L2ludmVzdG9ycy1hcmUtc2hpZnRpbmctaW50ZXJlc3QtdG8taW5xdWJldGEtcXViZS1iaW5hbmNlLWNvaW4tYm5iLWFuZC1jYXJkYW5vLWFkYS1hcy10aGV5LWxvb2stZm9yLXRoZS1iZXN0LWNyeXB0by10by1idXktbm930gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Jun 2023 07:00:00 GMT",
        "title": "Investors Are Shifting Interest to InQubeta (QUBE), Binance Coin (BNB), and Cardano (ADA) as They Look for the Best ... - BSC NEWS",
        "content": "ETH\n\nHaving raised over $295k in its ongoing presale, InQubeta continues to attract investor attention by offering investors the opportunity to buy equity-based NFTs of AI projects.\n\nThe crypto market has been at the center of innovation as new projects with unique offerings have been introduced. As new tokens enter the market, many investors look for significant returns. This is making them search for the best crypto to buy now for beginners and veterans alike.\n\nInQubeta (QUBE) is gaining traction as it attracts the attention of major investors in its first few days of the presale rally. The emerging token is investment-worthy, with over $295k raised so far. The token has the potential to become one of the best cryptos to invest in for massive gains, and investors are not taking any chances.\n\nInvestors are moving to InQubeta because of its enormous potential. This DeFi project keeps getting attention from the media and investors, alongside top 10 crypto powerhouses such as Binance Coin (BNB) and Cardano (ADA).\n\nWe shall examine why InQubeta, Binance Coin, and Cardano are attractive investment options.\n\nInQubeta (QUBE) is a crowdfunding platform for AI startups and projects\n\nInQubeta entered the market with a focus on expanding the artificial intelligence market. The innovative token leverages the DeFi market and AI technology's evolution. The token's presale run has been massive, with over $295k raised in a few days of launch. The token shows that it is a worthy investment option for anyone looking to increase their investment portfolio.\n\nAs a DeFi project, InQubeta allows investors to contribute to the growth of the artificial intelligence industry by allowing them access to the NFT marketplace. Investors will have the chance to buy equity-based NFTs of their most preferred projects. After buying these NFTs, they will own factions of the projects.\n\nThe QUBE token is a high-growth token with lots of promises. The token is one of the best cryptos for long-term returns. QUBE uses deflationary mechanics that will see the coin increase in value rapidly. Experts predict that the value of the QUBE token will increase by over 5000% before the end of the year.\n\nIn addition, InQubeta is positioned as the best crypto investment in 2023 because the innovative idea has been designed and created using the best technology available on the market today. It uses verified smart contracts that offer transparency and reliability while promising maximum security for funds. QUBE holders are eligible to receive maximum returns from the profits of the project they invest in. As the enthusiasm surrounding the AI industry increases this year, InQubeta will experience a surge in value as investors look to invest extensively in this industry. The growth of the QUBE token has been remarkable, and analysts predict that the coin will be listed on many top exchange platforms upon launch.\n\nVisit InQubeta Presale\n\nBinance Coin (BNB) retreats amidst market pressures\n\nBinance Coin has gained popularity in the crypto market because of the Binance exchange platform. The coin has a market cap of over $50 billion and is one of the top crypto coins for investment. BNB value has fluctuated within the last week, raising concerns for investors as the price dipped a few points.\n\nBinance Coin has remained a market leader because of its growth rate. The token is one of the most performing cryptos, with millions of users. Analysts predict that the BNB token is bound for growth.\n\nCardano (ADA) achieves a new milestone\n\nCardano has reached a new milestone as its staking value surpasses 400 million ADA. The token has made a tremendous leap to the top ten decentralized exchanges by trading volume with Minswap. This new feat puts the ADA token among the best investments.\n\nCardano's rally keeps increasing as investors move to the token for the best returns. The token indicates a higher gain on the long-term charts. This shows that ADA is an investment-worthy token.\n\nVisit InQubeta Presale\n\nFinal words\n\nInQubeta's presale is among the most talked about in the crypto market. This innovative token keeps attracting new and veteran investors. InQubeta is establishing a more democratic and community-driven ecosystem by converting the QUBE token into a governance token. This will encourage token holders to participate actively. Holders will also determine the platform's future and contribute to the growth and success of AI technology startups. You can start investing now before the price increases.\n\nVisit InQubeta Presale"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LnRydWVob2xseXdvb2R0YWxrLmNvbS9jaHJpc3R5LWNhcmxzb24tcm9tYW5vLWFubmVsaWVzZS12YW4tZGVyLXBvbC10YWxrLWFkdWx0aG9vZC1pbnRpbWFjeS1kdXJpbmctYXR4LXR2LWZlc3QtMjAyMy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Jun 2023 07:00:00 GMT",
        "title": "Christy Carlson Romano Talks PodCo During ATX TV Fest 2023 - True Hollywood Talk",
        "content": "This interview was conducted by Andrew Rossow, Esq. and Jhanelle Dionne.\n\nLaunched twelve years ago by Emily Gipson and Caitlin McFarland, ATX TV Festival is an annual festival in Austin, Texas that has since developed into a year-round event that is entirely focused on the television medium via its most engaging programming that brings together industry leaders and fans every June for a four-day event that consists of panels, premiere screenings, and late-night events.\n\nTrue Hollywood Talk attended this year’s ATX TV Fest Season 12, which among the many panels and discussions, brought podcast programming front-and-center.\n\nDuring this year’s ATX TV Fest, The Podcast Company (PodCo) certainly sparked waves of conversations as its sweet, ever-expanding line of podcast programming brings together many of the former Disney Channel child stars who have worked hard to build something that’s entirely their own – putting their Disney character personas behind them to have those uncomfortable conversations and discussions that play a much bigger part in our everyday lives.\n\nPodCo, a podcast production startup, founded by former Disney Channel star Christy Carlson Romano (Even Stevens, Kim Possible, The Vulnerable Podcast) and her husband, Brendan Rooney (The Vulnerable Podcast, I Hear Voices Podcast), has undeniably carved out a niche that is hard to compete with, bringing together a spectacular lineup of podcasts hosted by former Disney Channel stars and their journeys in navigating adulthood beyond the characters they’ve played on television for years.\n\nSince its February launch, PodCo now plays host to:\n\nThe Wizards of Waverly Pod, hosted by Jennifer Stone and David DeLuise;\n\nNed’s Declassified Podcast Survival Guide, hosted by Devon Werkheiser, Lindsey Shaw, and Daniel Curtis Lee;\n\nThe Brotherly Love Podcast, hosted by Joey, Matt, and Andy Lawrence; and\n\nThe Even More Stevens Podcast, hosted by Romano, Nick Spano, and Steven Anthony Lawrence\n\nBearing Witness to That Intimate Moment\n\nDuring ATX TV Fest, Romano and Anneliese van der Pol (That’s So Raven) announced the launch of PodCo’s latest podcast – the BNB Podcast, which will discuss topics surrounding vulnerability, parenthood, musical theater, their time on Disney Channel, as well as the current status of the world.\n\nTrue Hollywood Talk sat down with both Romano and van der Pol, diving into vulnerability, authenticity, and adulthood.\n\nAs for van der Pol and Romano coming together, van der Pol told True Hollywood Talk that their lives have “paralleled each other in a weird way,” and this was an opportunity for them both to explore a friendship they always wanted, but were never given the chance to experience.\n\n“We were sort of robbed of a friendship, and we like each other a lot, and always knew that,” said van der Pol. “When I came on to do Vulnerable, we realized we weren’t being so vulnerable; we were having a lot of fun, and I think [Christy] is ready to take a bit of a departure from that.” Anneliese van der Pol to True Hollywood Talk\n\nThe Vulnerable Podcast, hosted by Romano, invites her friends, celebrities, and experts for in-depth conversations discussing the good, the complicated, and beauty of being human, while exploring the nuances of vulnerability.\n\nOne of the things that Romano says will distinguish BNB Podcast from a lot of the “girl duos” that are really wonderful and trending\n\n“We’ve literally been everyone’s big sister or role models for a long time, but they’ve never had the chance to talk to us,” Romano told True Hollywood Talk.\n\n“The note that I get a lot from folks, is that podcasting as a whole is so popular and has such a great future ahead of it because you’re sharing an intimate moment, you’re bearing witness to people that you really would love to listen to. I think we’re offering a way in for folks that maybe grew up with us and really want to know what we think about the industry,” she continued. Christy Carlson Romano to True Hollywood Talk\n\nvan der Pol also added the point that when people come to the program to listen to them, they know they’re going to be getting the truth, while also having the ability to showcase her own voice independent of Disney.\n\n“I just don’t care about being famous…it doesn’t bring me any joy. I really just want to be a person in the world talking and having a voice that’s my own voice. I do think I have something to say and people who would want to listen,” she stated.\n\nRomano jumped in, emphasizing that “[w]hat we want to do with this show is to give [Anneliese] a platform to be herself and to shine,” Romano emphasized, noting that we’re no longer in an “influencer culture, but instead, a creator market where if you’re creating something special and unique that is “authentically you, then there’s a place for that now.”\n\nHair Color For Women and Becoming “Authentically You”\n\nFans of van der Pol who grew up watching her play ‘Chelsea’ on Disney Channel’s That’s So Raven, often associated her with her red hair, which during the show, she said she purposely changed to blonde.\n\n“One thing I think she did great was changing her hair color, because everyone knew her as a redhead,” Romano said. “I think it’s so funny how there’s certain things you do in hair color for women, which is something else we should talk about on the program.”\n\nAnd when it comes to being authentically you, hair color for women and men, is an equally important piece to the puzzle of understanding you.\n\nWe briefly spoke about Disney’s live-action film of “The Little Mermaid,” starring Halle Bailey as Ariel, which is now out on Disney+, and how it’s already left its mark on pop culture in more ways than one.\n\nSince the original animated movie’s release in 1989, fans of “The Little Mermaid” have come to expect any depiction of Ariel to “look” a certain way – including how her hair and makeup are done.\n\nOscar-nominated celebrity hairstylist Camille Friend, who was responsible for creating Bailey’s hairstyle to play the live-action Ariel, did so with intention.\n\nWhile there were widespread discussions from people on wanting to see Bailey rock the bright cherry red hair that the OG Ariel has always exhibited, the move away from tradition and taking into consideration what was best for Bailey, was a priority for Friend.\n\nFriend told PopSugar that when the topic of hair color came up, she was concerned about dyeing Bailey’s entire head red and the damage it would cause. So, Friend came up with a workaround solution, partnering with Extensions Plus, which provided three custom shades of red, 30-inch hair extensions made to encase Bailey’s locs.\n\n“We just started mixing the colors, starting from darker and working to lighter and, literally, taking and wrapping each of her locs with this hair,” Friend said. According to Friend, that process required a total of three stylists and took two days, which allowed for it to stay in Bailey’s hair for six to eight weeks.\n\nBy mixing the three different shades of red, Friend and the makeup team were able to completely transform Bailey’s brown hair into Ariel’s red hue, which gives off golden-orange reds to help bring out the golden-sunshiny color out of Bailey’s skin.\n\nBeing a Mom (And Not Being a Mom)\n\nWhen it comes to exploring the complexities and nuances with today’s understanding of ‘identity,’ the two co-hosts bring a unique perspective to the program when it comes to motherhood and independence.\n\nWe asked Romano and van der Pol for their advice to parents and kids who do have that dream of wanting to get into the industry:\n\n“I am making sure that my daughters have an appreciation for the arts first, before commodifying it. I think that it’s important that they just love it – that they love just being in a theater. What I think most importantly is ambition. Ambition in children is so rare, but if you have an ambitious child, you have to serve that ambition to them, because it’s healthy for them. Hopefully along the way, they aren’t so ambitious that they lose sight of their values and their agency, but overall, when it comes to the parent and the choices to do this, this isn’t an after-school activity,” Romano emphasized.\n\nvan der Pol says one of the biggest pieces of advice she can share with parents (and kids) revolves around the amount of “power” that presents itself when you’re making people laugh and bringing in large sums of money:\n\n“I had a very smart mother, a mother who was a big avid arts-goer, theater watcher, anything and everything. She told me all the right things, but it still didn’t matter, because when you’re making all of that money young, and you’re making people laugh, you’re so powerful. You have so much power (or you think you do), and you’re an adult taking care of your family,” van der Pol told True Hollywood Talk. I would just keep telling myself ‘girl, you’re not an adult, and this isn’t going to last. Just because you’re naturally talented, doesn’t mean you don’t have to work hard. I would have told myself not to drink and make so many mistakes, to be honest.’”\n\n“I would have told myself to focus more and do better. I made a lot of mistakes,” van der Pol confessed.\n\n“Are you grateful for any of those mistakes? Do you ever go back and say ‘I’m glad I fucked up in that area, because it created this new perspective?” Romano asked van der Pol.\n\n“I wish I could, but no, I think regrets are important. And I have a lot of them. I actually think all the mistakes I made were a detriment – I drank too much, I dated older guys on set. Disney was really freaked out about that, because I was dating a much older guy when I was 18, and that ruined it. They didn’t trust me anymore, it worried them. But, no, I wish I hadn’t made those mistakes, unless it’s a good thing that I’ve learned from it now and am able to tell you that,” van der Pol replied.\n\nHow Should Listeners Approach PodCo Programming?\n\nWith a pretty stacked lineup of podcasts already embedded within PodCo’s programming, and more on the way, how should listeners approach each of these shows as a homegrown company in Austin, Texas?"
    }
]