[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5uZXd5b3JrdXBzdGF0ZS5jb20vZW50ZXJ0YWlubWVudC8yMDIzLzA1L2dob3N0LWh1bnRlcnMtc2Vhc29uLWZpbmFsZS10by1mZWF0dXJlLWhhdW50ZWQtdXBzdGF0ZS1ueS1iZWQtYW5kLWJyZWFrZmFzdC5odG1s0gGUAWh0dHBzOi8vd3d3Lm5ld3lvcmt1cHN0YXRlLmNvbS9lbnRlcnRhaW5tZW50LzIwMjMvMDUvZ2hvc3QtaHVudGVycy1zZWFzb24tZmluYWxlLXRvLWZlYXR1cmUtaGF1bnRlZC11cHN0YXRlLW55LWJlZC1hbmQtYnJlYWtmYXN0Lmh0bWw_b3V0cHV0VHlwZT1hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "‘Ghost Hunters’ season finale to feature haunted Upstate NY bed-and-breakfast - newyorkupstate.com",
        "content": "Fans of the supernatural will finally get a peek inside the Upstate New York outdoor adventure bed and breakfast featured on this week’s episode of TV’s “Ghost Hunters.”\n\nTune in this week to see The Claire House in Ogdensburg on the “Ghost Hunters” episode titled “Diocese of the Dead.” It will air as the show’s season finale at 9 p.m., May 25 on The Travel Channel and stream on discovery+.\n\nThe historic home was once a Catholic rectory and convent of French Canadian nuns. During the pandemic it was purchased by Hal and Rachel Kench of Long Island after it caught Rachel’s eye during one of their visits to Hal’s hometown.\n\nOnce they moved in the flickering lights, strange noises, and things that go bump in the night began to happen. Hal reached out to “Ghost Hunters,” and after an initial visit, the television show decided to film a full episode.\n\n“They showed up with their whole crew and were there for a whole week. We can’t talk much about what they found until show it on TV. I was pretty shocked, but I also felt good and a little validated that this is a real thing,” Hal previously told a reporter.\n\nSetup as an outdoor adventure bed and breakfast, guests can visit the North Country, the ghosts, and take full advantage of what the area has to offer. To book a stay at The Claire House, visit their website.\n\nREAD MORE\n\nGhost hunting in Upstate NY: 7 haunted places to visit for a serious fright\n\nUpstate NY mansion — rumored to be haunted — completely transformed after stunning renovations\n\nFainting goats and friendly ghosts: One of the most haunted hotels in the U.S. is in Upstate NY\n\nHaunted dining in Upstate NY: Here are 17 creepy date night spots"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5uZXd5b3JrdXBzdGF0ZS5jb20vZW50ZXJ0YWlubWVudC8yMDIzLzA1L2dob3N0LWh1bnRlcnMtc2Vhc29uLWZpbmFsZS10by1mZWF0dXJlLWhhdW50ZWQtdXBzdGF0ZS1ueS1iZWQtYW5kLWJyZWFrZmFzdC5odG1s0gGUAWh0dHBzOi8vd3d3Lm5ld3lvcmt1cHN0YXRlLmNvbS9lbnRlcnRhaW5tZW50LzIwMjMvMDUvZ2hvc3QtaHVudGVycy1zZWFzb24tZmluYWxlLXRvLWZlYXR1cmUtaGF1bnRlZC11cHN0YXRlLW55LWJlZC1hbmQtYnJlYWtmYXN0Lmh0bWw_b3V0cHV0VHlwZT1hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "‘Ghost Hunters’ season finale to feature haunted Upstate NY bed-and-breakfast - newyorkupstate.com",
        "content": "Fans of the supernatural will finally get a peek inside the Upstate New York outdoor adventure bed and breakfast featured on this week’s episode of TV’s “Ghost Hunters.”\n\nTune in this week to see The Claire House in Ogdensburg on the “Ghost Hunters” episode titled “Diocese of the Dead.” It will air as the show’s season finale at 9 p.m., May 25 on The Travel Channel and stream on discovery+.\n\nThe historic home was once a Catholic rectory and convent of French Canadian nuns. During the pandemic it was purchased by Hal and Rachel Kench of Long Island after it caught Rachel’s eye during one of their visits to Hal’s hometown.\n\nOnce they moved in the flickering lights, strange noises, and things that go bump in the night began to happen. Hal reached out to “Ghost Hunters,” and after an initial visit, the television show decided to film a full episode.\n\n“They showed up with their whole crew and were there for a whole week. We can’t talk much about what they found until show it on TV. I was pretty shocked, but I also felt good and a little validated that this is a real thing,” Hal previously told a reporter.\n\nSetup as an outdoor adventure bed and breakfast, guests can visit the North Country, the ghosts, and take full advantage of what the area has to offer. To book a stay at The Claire House, visit their website.\n\nREAD MORE\n\nGhost hunting in Upstate NY: 7 haunted places to visit for a serious fright\n\nUpstate NY mansion — rumored to be haunted — completely transformed after stunning renovations\n\nFainting goats and friendly ghosts: One of the most haunted hotels in the U.S. is in Upstate NY\n\nHaunted dining in Upstate NY: Here are 17 creepy date night spots"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3p5Y3J5cHRvLmNvbS9kb2dlY29pbnMtZnV0dXJlLWlzLWNydXNoaW5nbHktYmxlYWstYXMtZG9nZWZhdGhlci1lbG9uLW11c2std2FybnMtaW52ZXN0b3JzLWFnYWluc3QtYmV0dGluZy10aGUtZmFybS1vbi1kb2dlL9IBhwFodHRwczovL3p5Y3J5cHRvLmNvbS9kb2dlY29pbnMtZnV0dXJlLWlzLWNydXNoaW5nbHktYmxlYWstYXMtZG9nZWZhdGhlci1lbG9uLW11c2std2FybnMtaW52ZXN0b3JzLWFnYWluc3QtYmV0dGluZy10aGUtZmFybS1vbi1kb2dlLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "Dogecoin’s Future Is Crushingly Bleak As Dogefather Elon Musk Warns Investors Against ‘Betting The Farm’ On DOGE - ZyCrypto",
        "content": "Advertisement\n\nElon Musk, at least at one point the world’s richest man, has issued a grim warning about the original meme cryptocurrency, Dogecoin (DOGE).\n\nSpeaking at the Wall Street Journal’s CEO Council Summit in London on May 23, the eccentric billionaire cautioned investors not to allocate all their money to DOGE. “I’m not advising anyone to buy crypto or bet the farm on Dogecoin,” Musk posited.\n\nDespite this warning, the Tesla/SpaceX CEO reaffirmed that Dogecoin remains his favourite crypto in the entire digital currencies market because “it has the best humor and has dogs”. Musk also noted that the most ironic outcome for global currencies would be if a meme coin created merely as a joke emerged as the global currency. As you are well aware, DOGE was invented as a joking tribute to the “doge” meme of a Shiba Inu dog. The idea was to poke fun at the largest and oldest crypto asset, Bitcoin.\n\nMusk’s History Of Endorsing And Pumping Dogecoin\n\nMusk is known for manipulating the price of dogecoin in the past through his intriguing remarks, actions, and Twitter posts. The self-proclaimed “Dogefather” even planned to bring DOGE to space with a SpaceX satellite launch. Dogecoin developers have also revealed in the past that Chief Twit Musk actually sat in on development calls as they discussed how they would revamp the meme coin.\n\nThe entrepreneur still owns dogecoin, along with Bitcoin and Ethereum, according to his tweets from March last year. Musk even bought some DOGE for his youngest son, X Æ A-Xii, in 2021.\n\nAdvertisement\n\nThere was speculation that the Tesla boss would soon integrate a permanent Dogecoin payment system on Twitter, the social media giant he overpaid for ($44 billion). However, DOGE’s integration has not yet materialized, leaving fans in a state of great disappointment.\n\nEarly last month, Musk replaced Twitter’s classic blue bird logo with a sprite of DOGE, triggering a 25% spike in the token’s price — only to remove the Dogecoin logo days later.\n\nDogecoin dropped sharply today after Musk said not to put life savings in DOGE. The OG meme coin was down 2.8% at the time of writing, trading for $0.071, according to CoinGecko data.\n\nDOGE is currently trading 90.25% lower than its May 2021 all-time high of $0.73."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8venljcnlwdG8uY29tL2ludG92ZXJzZS1yZXZvbHV0aW9uaXplcy1pdHMtc29jaWFsLW1pbmluZy10by1mb3N0ZXItc29jaWFsLWludGVyYWN0aW9ucy1pbi10aGUtd2ViMy1pbmR1c3RyeS_SAXdodHRwczovL3p5Y3J5cHRvLmNvbS9pbnRvdmVyc2UtcmV2b2x1dGlvbml6ZXMtaXRzLXNvY2lhbC1taW5pbmctdG8tZm9zdGVyLXNvY2lhbC1pbnRlcmFjdGlvbnMtaW4tdGhlLXdlYjMtaW5kdXN0cnkvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "INTOverse Revolutionizes Its Social Mining to Foster Social Interactions in the Web3 Industry - ZyCrypto",
        "content": "Advertisement\n\nINTOverse, a Web3 community management solution, has emerged as a trailblazer in the field of social mining, offering users a unique and profitable social experience. With its innovative approach to earning tokens effortlessly, INTOverse has gained significant attention and has become a leading player in the Web3 industry.\n\nAccording to an official press release, INTOverse has continued to pioneer social mining and spearhead the Web3 movement, following plans to usher in a new era of possibilities and opportunities in the Web3 world. Since its closed beta launch on May 9th, INTOverse has experienced remarkable user growth and a surge in social interactions. Within just two weeks, the platform’s daily active users (DAU) surpassed 10,083, with an impressive addition of 5,927 new users per day. The platform has distributed over 100 million messages, highlighting its highly active user base.\n\nThis explains the confidence of enthusiasts on the project with hopes that INTOverse is poised to shape the future of social mining and redefine the way users engage with blockchain technology.\n\nINTOverse And Its Social Mining Model\n\nINTOverse’s social mining model aims to revolutionize traditional mining by allowing users to earn physical rewards while enjoying social interactions. By integrating a Web3 encrypted wallet, digital identity, and AI assistance, INTOverse offers users a seamless and efficient mining experience. The more users interact socially, the higher their social weight and allocation of INTOverse tokens (TOX), providing users with tangible rewards for their engagement.\n\nWith a vision to create a global and inclusive social ecosystem, INTOverse offers exciting features such as group chats, one-on-one chats, and Moments resembling a social feed. These features foster user engagement and encourage the exchange of ideas and experiences within highly inclusive communities. INTOverse also plans to explore and introduce more blockchain application scenarios, providing users with a gateway to experience the potential of blockchain technology.\n\nAdvertisement\n\nOne of the remarkable features of INTOverse is its commitment to user experience and service. The platform offers a one-stop mining service, allowing users to start mining with a single click. Additionally, INTOverse provides round-the-clock technical assistance and customer support, ensuring users have a smooth and hassle-free experience.\n\nFurthermore, INTOverse has eliminated the need for manual transfers of digital assets to wallets, offering users a more convenient and secure solution. Users can now directly manage their digital assets within the platform, enhancing their overall experience.\n\nThe platform has also designed a comprehensive economic model where users receive token rewards during social mining. These tokens can be utilized for platform staking, NFT minting, online marketing, and other functional services. INTOverse’s continuous development and expansion of ecological scenarios, particularly in the area of platform staking, contribute to the deflationary destruction of INTOverse tokens (TOX) and ultimately increase their value.\n\nINTOverse’s impressive achievements in social mining have attracted numerous ecosystem developers, leading to rapid growth in both the ecosystem and user base. The platform’s continuous innovation and trend-setting approach have positioned it as a leader in the Web3 industry. Users can now enjoy a social experience that exceeds their expectations while reaping significant profits."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vd3d3LmZvbGxvd2NoYWluLm9yZy9jYW5ub3QtZXN0aW1hdGUtZ2FzLXBhbmNha2Vzd2FwL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "How to Fix \"cannot estimate gas\" on PancakeSwap - Followchain",
        "content": "Are you getting a “cannot estimate gas” error on PancakeSwap?\n\nHere’s the second part of the error message, “The transaction cannot succeed due to error: cannot estimate gas”.\n\nFollowed by, “transaction may fail or may require manual gas limit. This is probably an issue with one of the tokens you are swapping”.\n\nIf so, you won’t be able to buy or sell the token on PancakeSwap.\n\nThe error can occur when you’re swapping a token like Bonfire, Safemoon, or others.\n\nErrors like these are very common on PancakeSwap, so you’re not the only one experiencing them.\n\nIn this guide, you’ll learn what “cannot estimate gas” means on PancakeSwap and how to fix it.\n\nWhat does “cannot estimate gas” mean on PancakeSwap?\n\nCannot estimate gas on PancakeSwap means that the exchange cannot evaluate the fee of the transaction.\n\nThis typically happens when there are too many decimal places in the number of tokens.\n\nWhen there are too many decimal places in the number of tokens, the “cannot estimate gas” error will occur.\n\nFor example, if you’re swapping BNB for 155.948235 ANKR, you may get the error message.\n\nThis is because the token has too many decimal places.\n\nAnother reason why you got the “cannot estimate gas” error is that the token might be a scam.\n\nTo check whether the token is a scam, you need to view its recent transactions on bscscan.com.\n\nIf the token has a lot of recent transactions (both buys and sells), it’s most likely not a scam.\n\nHowever, if the token has little to no transactions, the token is probably a scam.\n\nHow to fix “cannot estimate gas” on PancakeSwap\n\nTo fix “cannot estimate gas” on PancakeSwap, you need to increase your slippage tolerance to 12%.\n\nAfter you’ve increased your slippage tolerance, you need to change the number of tokens you’re trying to swap.\n\nFor example, if you’re trying to swap BNB for Safemoon, the number of Safemoon may have a lot of decimal places.\n\nOtherwise, the last numbers of Safemoon might be very randomized (e.g. 5207218).\n\nIf that’s the case, PancakeSwap might not be able to estimate the fee of the transaction.\n\nAs a result, the transaction will fail and you’ll get the “cannot estimate gas” error.\n\nOn the other hand, a low slippage tolerance can cause your transaction to fail due to the fee of the token.\n\nYou can fix this by increasing your slippage tolerance in increments to find out the lowest slippage tolerance for the transaction to succeed.\n\nStep 1: Select the tokens and open the settings\n\nOpen PancakeSwap and connect your wallet. Select the token that you want to buy in the “To” field. Select the token that you want to use to swap for it in the “From” field. Tap on the Settings icon.\n\nStep 2: Change your slippage tolerance to 12%\n\nInput 12%* into the “Slippage tolerance” field. Tap on the “X” icon to close the Settings.\n\n*Instead of entering “12%”, you can increase your slippage tolerance in increments.\n\nFor example, you can start with a 2% slippage tolerance, then work your way up to 4%, 6%, 8%, and more.\n\nThis will allow you to find the lowest slippage tolerance for the transaction to succeed.\n\nHowever, if you’re trying to buy a token like Safemoon, you’ll need to set a slippage tolerance of 12% (this is due to the token’s fees).\n\nStep 3: Enter the amount of BNB/ETH you want to swap\n\nSelect the tokens that you want to swap if you haven’t already (e.g. from BNB to ANKR). Enter the amount of BNB or Ethereum that you want to swap for the token (e.g. if you want to swap 0.04515 BNB, input “0.04515” in the “From” field*).\n\n*This will make the “To” field estimated.\n\nDo note that the “To” field cannot be estimated if you’re buying a token, it can only work if you’re selling.\n\nIf the “To” field is estimated, you may receive an error message like the “cannot estimate gas” error when you tap on “Swap”.\n\nInstead, you need the “From” field to be estimated.\n\nStep 4: Change the last numbers to zero\n\nChange the last numbers of the token that you’re buying to zeroes* (e.g. if you’re trying to buy 155.958 ANKR, change it to 155.000). Swap the tokens!\n\n*When you’re buying a token, you need the “From” field to be estimated.\n\nIn most cases, changing the last numbers of the token that you’re buying to zeroes will fix the “cannot estimate gas” error.\n\nHowever, if the last numbers of the token that you’re trying to buy are already all zeroes, try changing it to random numbers.\n\nFor example, if you’re trying to buy 155.000 ANKR, try changing it to 155.958.\n\nIf you’re still getting the “cannot estimate gas” error, try changing the numbers in the “To” and “From” fields to random ones until the transaction succeeds.\n\nThis is because the error message is usually caused by the number of tokens that you’re trying to swap.\n\nConclusion\n\nGenerally, if you’re buying a token, make sure that the “From” field is estimated.\n\nTo do so, you need to change the last numbers of the token in the “To” field.\n\nOn the other hand, if you’re selling a token, make sure that the “To” field is estimated.\n\nTo do so, you need to change the last numbers of the token in the “From” field.\n\nThis will mitigate any transaction errors, such as the “cannot estimate gas” error.\n\nFurther reading\n\nBest International Trading Brokers in 2021\n\nHow to Buy Dogelon Mars (ELON)\n\nHow to Buy HODL Coin (HODL)"
    }
]