[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL2J1c2luZXNzLm91dGxvb2tpbmRpYS5jb20vbmV3cy9jcnlwdG8tcHJpY2VzLXRvZGF5LWJpdGNvaW4tYnRjLWdhaW5zLTAtMjMtZXRoZXJldW0tZXRoLXJpc2VzLTAtOTAtc29sYW5hLXNvbC11cC0yMi01OC0tbmV3cy0yNTA2NTDSAZQBaHR0cHM6Ly9idXNpbmVzcy5vdXRsb29raW5kaWEuY29tL2FtcC9zdG9yeS9uZXdzL2NyeXB0by1wcmljZXMtdG9kYXktYml0Y29pbi1idGMtZ2FpbnMtMC0yMy1ldGhlcmV1bS1ldGgtcmlzZXMtMC05MC1zb2xhbmEtc29sLXVwLTIyLTU4LS1uZXdzLTI1MDY1MA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 03 Jan 2023 08:00:00 GMT",
        "title": "Crypto Prices Today: Bitcoin (BTC) Gains 0.23%, Ethereum (ETH) Rises 0.90%, Solana (SOL) Up 22.58%, SOL, BTC Most Trending - Outlook Business",
        "content": "\n\nThe overall crypto market cap was up by 0.51 per cent to $809.40 billion and its trading volumew as down by 13.16 per cent to $26.82 billion, according to data from Coinmarketcap.com at 7 AM."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3QvdHJvbi1uZXR3b3JrLWZsaXBzLWJuYi1jaGFpbi1mb3ItdG9wLTMtYmxvY2tjaGFpbi1pbi10dmzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 03 Jan 2023 08:00:00 GMT",
        "title": "Tron Network Flips BNB Chain for Top 3 Blockchain in TVL - BSC NEWS",
        "content": "BNB\n\nTron maintains TVL level while small dip from BNB Chain pushed Tron ahead.\n\nTron Surpasses BNB Chain\n\nTron Network has surpassed BNB Chain to become the third-largest blockchain outside of Ethereum and Bitcoin.\n\nTron Network overcame BNB Chain on January 2-3, maintaining a total volume locked (TVL) of $4.15 billion USD. BNB Chain sits just behind at $4.08 billion USD. The difference is marginal but notable. BNB Chain held firm behind Ethereum for almost all of 2022.\n\nBNB Chain has been on a steady decline over the last few months. BNB Chain had over $6B in TVL in November 2022, while Tron Network has hovered between $4B-5B in TVL in the last two months.\n\nTron Network recently integrated BUSD, the stablecoin of Binance. The pegged version of BUSD has surpassed $101M in TVL just in the past week since integration.\n\nWhat is BNB Chain:\n\nPreviously known as the Binance Smart Chain (BSC), BNB Chain is a community-driven, decentralized, and censorship-resistant blockchain that is powered by Binance. It consists of BNB Beacon Chain and BNB Smart Chain, EVM compatible and facilitating a multi-chain ecosystem. Through the concept of MetaFI, BNB Chain aims to build the infrastructure to power the world’s parallel virtual ecosystem.\n\nFind more about BNB Chain here:\n\nWebsite | Twitter | Discord | Telegram | GitHub |\n\nWhat is TRON Network:\n\nTron is an open-source blockchain-based decentralized digital platform with its own cryptocurrency, called Tronix or TRX. Established in 2014 by Justin Sun and founded in 2017 by a Singapore non-profit organization, Tron Foundation aims to host a global entertainment system for the cost-effective sharing of digital content.\n\nWhere to find TRON Network:\n\nWebsite | Twitter | Telegram | Discord | Medium |"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvYmluYW5jZS1jb2luLXByaWNlLXByZWRpY3Rpb24td2lsbC10aGUtYmVhci1tYXJrZXRzLWRyYWctYm5iLXRvLTQ00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 03 Jan 2023 08:00:00 GMT",
        "title": "Binance Coin Price Prediction: Will The Bear Markets Drag BNB to $44? - Watcher Guru",
        "content": "Binance Coin (BNB) is arguably the only leading cryptocurrency that managed to weather the bear markets in 2022. Despite price drops, BNB clawed back to its previous levels and is now looking to breach the $250 mark on Tuesday. However, pseudonymous crypto analyst ‘Profit Blue’ has predicted that BNB could crash hard in 2023 and reach extremely low levels.\n\nAlso Read: Top 3 Cryptos To Watch In January 2023\n\nSource: Coingecko.com\n\nAlso Read: Bitcoin: AI Predicts BTC Price For January 31, 2023\n\nBinance Coin: BNB Might Crash to $44, Predicts Analyst\n\nProfit Blue, urged his 202,300 followers on Twitter to “stay careful” on Binance Coin (BNB) and predicted that it could crash to $44. The analyst claims that a cascading liquidation on the Binance ecosystem could lead BNB to slip to $44 this year. He shared a chart suggesting that BNB is following the same reversal pattern that sent Bitcoin from $69,000 to $15,000 last year.\n\n“A massive top reversal pattern is printing on charts. The neckline was broken and retested recently. BNB could go down aggressively from here,” tweeted Profit Blue and also added that investors need to “Stay careful” on “Binance”.\n\nAlso Read: How Many ‘Zeroes’ Shiba Inu Deleted From January 2022 to 2023?\n\nI don’t care about the hate or negative comments that I receive when I post about Binance. This is the same reversal pattern that sent #Bitcoin from 69k to 15k (10k soon). — PROFIT BLUE (@profit8lue) December 29, 2022\n\nThat’s a steep correction of 82% for BNB from its current price of $246, according to the analysts’ prediction.\n\n“I don’t care about the hate or negative comments that I receive when I post about Binance. This is the same reversal pattern that sent Bitcoin from $69K to $15K ($10K soon),” he tweeted.\n\nAccording to Profit Blue’s price prediction, BNB could crash to $44 while Bitcoin could tumble down to $10,000.\n\nAlso Read: Solana Will Crash to $4 After Being Decimated Below $10?\n\nCould BNB Fall to $44? Here’s Our Take\n\nSource: Ethereum World News\n\nThe markets remain on a slippery slope in 2023 and calls for a recession are looming. However, throwing FUD against BNB isn’t something new and is been occurring after the FTX-SBF fiasco routinely. Despite the constant negativity, investors hold a firm belief in Binance and it commands a strong set of investors who believe BNB to be a driving force.\n\nHowever, BNB could crash hard only if reports of the Binance exchange indulging in financial wrongdoings come to light.\n\nIn conclusion, it is guaranteed that BNB could plummet in the bear markets but a fall to $44 might be a bit of a stretch.\n\nAlso Read: Dogecoin: Will Doge Reach $1 After the Space Mission Is Launched?\n\nAt press time, BNB was trading at $246 and is up 0.1% in the 24 hours day trade. It is down 64.1% from its all-time high of $686, which it reached in May 2021."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8venljcnlwdG8uY29tL2dsaXAtdGVhbXMtdXAtd2l0aC1wcm9taW5lbnQtd2ViMi1zdHVkaW9zLXRvLWZ1cnRoZXItZGV2ZWxvcC13ZWIzLWdhbWluZy_SAWJodHRwczovL3p5Y3J5cHRvLmNvbS9nbGlwLXRlYW1zLXVwLXdpdGgtcHJvbWluZW50LXdlYjItc3R1ZGlvcy10by1mdXJ0aGVyLWRldmVsb3Atd2ViMy1nYW1pbmcvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 03 Jan 2023 08:00:00 GMT",
        "title": "Glip Teams Up With Prominent Web2 Studios To Further Develop Web3 Gaming - ZyCrypto",
        "content": "Advertisement\n\nGlip, the leading Web3 game discovery app, has reached 1 million created wallets and over 100,000 onboarded users for web3 games in just three months. More than 50,000 verified earners were also reported by the app, indicating a high demand for Web3 gaming.\n\nIt is becoming increasingly difficult for the Web3 gaming industry to attract genuine players rather than just speculators. Furthermore, existing Web2 platforms do not support crypto advertisements, and the play-to-earn scholarship model sees low interest during bear markets.\n\nGlip recognized these limitations early on and set out to improve the visibility and accessibility of Web3 games. By the end of Q4 2022, the platform had seen over 1 million wallets generated within its ecosystem, proving its viability and success.\n\nIt’s important to note that these are not fake accounts; they have been set up by serious players interested in learning more about play-to-win systems. Over the past three months, Glip has directed over a hundred thousand users to fresh Web3 titles; roughly half have become paying customers thanks to their gaming prowess.\n\nGlip’s increasing popularity can be attributed to a number of factors. To begin with, the best Web3 game developers and publishers, like Axie Infinity, Netmarble, PlayDapp, Kakao Games, Neowiz, etc. are all partners of the platform. Second, it gives games new ways to build communities through things like social events, quests, and competitions.\n\nAdvertisement\n\n“Glip has created one million unique gamer wallets in Q4 2022. Our community is learning to use exchanges, swaps, and NFT marketplaces with their earnings. Web3 games are unlocking new economic opportunities & enabling DeFi literacy for millions of young people across the world, and we are super excited to accelerate this revolution.” – Glip Founder & COO Ishan Shrivastava.\n\nThe new additions provide a welcome change of pace from the academic-focused ones. Scholarships are a major part of pay-to-play (P2P) gaming, but they’re not as popular when the cryptocurrency market is down. As a result, Web3 games have shifted to free-to-play models to appeal to actual gamers as opposed to speculators, as the value of game tokens and NFTs has decreased.\n\nUsing Glip’s method of Questing, developers of Web3 games can more easily draw in serious players. In-game achievements can serve as the basis for quests that award cryptocurrency as a reward. As more and more popular gaming communities adopt and utilize this system, the model is gaining traction. Organizations like YGG, GuildFi, and Avocado DAO use Questing to energize their communities, create new marketplaces, and encourage gamers to try out a variety of Web3 games.\n\n“My journey with gaming quests started with World of Warcraft. Now with Web3 games, gamers from any part of the world can earn crypto for completing quests. Glip has empowered 50k earners from emerging markets to date, and we are working closely with top studios to scale to millions in 2023.” – Glip Founder & CEO Parth Choudhary.\n\nGlip’s solution is an innovative user acquisition model that provides incentives for users to experiment with Web3 games. In addition, they are rewarded for reaching certain goals, which guarantees a high level of dedication."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmtlbnRvbmxpbmUuY28udWsvdGhhbmV0L25ld3MvdGhlLWJvbmtlcnMtYm5iLXdpdGgtcmFpbmJvd3Mtb24tdGhlLWNlaWxpbmctYW5kLWEtc3BvdHR5LWtpLTI3OTY1OC_SAXFodHRwczovL3d3dy5rZW50b25saW5lLmNvLnVrL3RoYW5ldC9uZXdzL2FtcC90aGUtYm9ua2Vycy1ibmItd2l0aC1yYWluYm93cy1vbi10aGUtY2VpbGluZy1hbmQtYS1zcG90dHkta2ktMjc5NjU4Lw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 03 Jan 2023 08:00:00 GMT",
        "title": "The bonkers BnB with rainbows on the ceiling and a spotty kitchen - Kent Online",
        "content": "Hidden in the heart of Margate's bustling Old Town is a quirky bed and breakfast with a cloud-like bedroom, bright yellow bathroom and rainbows on almost every wall.\n\nThe immersive, playful accommodation dubbed Big Bit is the brainchild of colour-lover Polly Chromatic.\n\nPolly Chromatic is the owner and brains behind the design of Big Bit in Margate. Picture: Ollie Harrop\n\nThe 39-year-old - who previously ran Little Bit, an equally colourful shop below the B&B - told KentOnline: \"I wanted to create places people would feel playful in, no matter what age they were.\n\n\"Play is a huge thing for me. I think as adults we should be able to play more, so I wanted to create those immersive spaces.\"\n\nThe cloud room is one of the unique feature of the place. Picture: Ollie Harrop\n\nMs Chromatic previously pursued a career in acting, but was forced to change direction due to severe anxiety.\n\n\"I didn’t know what else to do, so I opened the shop and made it very colourful,\" she said.\n\n\"I was embracing being out of acting and self-expression, dying my hair different colours.\"\n\nEvery inch of Big Bit is full of colour, which Ms Chromatic describes as her own type of therapy.\n\nBig Bit is a B&B in Margate's old town. Picture: Ollie Harrop\n\nThe unusual venue features an all-yellow rubber duck-inspired bathroom, a black and white spotty kitchen, a rainbow skylight, a dressing up box for children, and of course, the otherworldly crawl-in cloud room.\n\nThe hidden gem is on the corner of Duke Street and Broad Street in the heart of the town, but despite its central location, Ms Chromatic says it's \"very quiet\".\n\nThe design and decoration of the flat was a six-month \"labour of love\" for Ms Chromatic and ex-partner Jim Biddulph, who runs design company Polite Projects and painted the impressive rainbow mural in the living room.\n\n\"We did it all ourselves and didn’t have a massive budget,\" she explained.\n\n\"For example, the cloud room is stuffed full of people’s old pillows that they donated. I went round Margate collecting them.\"\n\nBig Bit usually attracts families, but Ms Chromatic stresses her \"ethos\" is that colour and fun is not just for children.\n\nPolly Chromatic spent six months decorating the creative features, such as the rubber duck inspired bathroom. Picture: Ollie Harrop\n\n\"Lots of families come, lots of kids - but equally I’ve had two women come and celebrate their 70th birthday here, so it’s for everyone,\" she said.\n\n\"That’s my whole ethos. I don’t have kids myself, I don’t think we should have to have kids to be able to enjoy colour.\"\n\nA black and white spotty kitchen is one of the stand-out rooms in the flat. Picture: Ollie Harrop\n\nBig Bit has attracted rave reviews from satisfied guests on Airbnb, with one describing the accommodation as \"sheer joy\".\n\nGlenda continued: \"The kids adored sleeping in the 'cloud room', and finding loads of hidden fun from a dressing up box to all sorts of games and toys.\"\n\nAlan posted: \"A fabulous quirky place in an excellent location.\"\n\nPolly Chromatic in her colourful B&B\n\nGary added: \"A wonderful space for children and the young at heart! An amazing explosion of colour is an understatement.\"\n\nAnd Kate described it as \"like living in an art installation\".\n\nSince closing her shop two months ago, Ms Chromatic has launched a new venture called The Happy Map, finding and experiencing joyful places around the UK and bringing them together into a guide.\n\nBig Bit is available to book on Airbnb.\n\nIt costs £300 for a two-night minimum stay."
    }
]