[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LjEwMTFub3cuY29tLzIwMjMvMDcvMzAvdmlkZW8tdG9ybmFkby1jYXVzZXMtZGFtYWdlLW1hcnRlbGwtYWZ0ZXItc2F0dXJkYXktc3Rvcm0v0gFraHR0cHM6Ly93d3cuMTAxMW5vdy5jb20vMjAyMy8wNy8zMC92aWRlby10b3JuYWRvLWNhdXNlcy1kYW1hZ2UtbWFydGVsbC1hZnRlci1zYXR1cmRheS1zdG9ybS8_b3V0cHV0VHlwZT1hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jul 2023 07:00:00 GMT",
        "title": "Tornado causes damage to Martell after Saturday storm - KOLN",
        "content": "LINCOLN, Neb. (KOLN) - A strong bow echo created an EF-1 tornado in southeast Nebraska Saturday morning.\n\nThe incident happened at around 8:18 a.m.\n\nAccording to official documents, the incident affected parts of Martell.\n\nOfficials said the tornado had estimated peak winds of 110 mph. The tornado’s width was 100 yards wide and a little more than a quarter-mile long.\n\nAccording to National Weather Service in Omaha/Valley, the tornado uprooted and snapped trees, caused roof and siding damage, and tore the roof off a Airbnb that was attached to a large barn.\n\nAutoplay\n\nThe Airbnb’s owner said that a couple and their children were staying in the Airbnb for a nearby wedding. They had to take cover in the closet under the mattress with their 3-year-old and 10-month-old.\n\nNo people were injured due to the incident.\n\nA strong bow echo surged through southeast Nebraska this morning, and produced an EF-1 tornado. Luckily there were no injuries however, the tornado uprooted and snapped trees, caused roof and siding damage, and tore the roof off a BnB that was attached to a large barn. pic.twitter.com/9cgcvyb8eN — NWS Omaha (@NWSOmaha) July 30, 2023\n\nCopyright 2023 KOLN. All rights reserved."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3QvcHJvamVjdC1pbnNpZ2h0LXR0Y29pbi1uZXR3b3JrLWJyaW5naW5nLWlubm92YXRpb24tdG8tdGhlLWNyeXB0by13b3JsZNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jul 2023 07:00:00 GMT",
        "title": "Project Insight: TTcoin Network - Bringing Innovation to the Crypto World - BSC NEWS",
        "content": "BNB\n\nWorking on both virtual and real-world projects, TTcoin aims to establish a strong and reliable foundation in the rapidly evolving blockchain and cryptocurrency market.\n\nTTcoin Network, founded on March 24, 2021, by Tayfun Taner and Tunahan Taner, is a TRC-20 smart contract operating on the TRON network. The project embarked on an intensive period of development, leading to the creation of two significant applications: the TTcoin mining app and TTcoin Network. The team's active efforts saw TTcoin launch on the Google Play store on June 16, 2021, rapidly gaining one million users and making impressive strides towards achieving its goals.\n\nWithin just three months, TTcoin secured listings on eight different exchanges, resulting in a remarkable 400% increase in its value. At its peak, TTcoin's value surged an astonishing 1900%. The project's dedication to real-world utility and institutionalism prompted the team to adopt a new logo featuring the letters TC.\n\nProject Vision\n\nTTcoin's vision is centered around building a strong and trustworthy foundation in the rapidly evolving blockchain and cryptocurrency market. The team's goals include conducting activities to attract users, organizing regular airdrop draws, and employing measures to protect the TTcoin price range from sudden drops.\n\nTTcoin Utility and Tokenomics\n\nTTcoin serves as a currency within the TC Token projects and applications. Headquartered in Turkey, TTcoin operates with a strong emphasis on security and has obtained permission from the Turkish Ministry of Interior for numerous real projects aligned with its objectives. The network operates on both the TRC20 and BEP20 networks, providing users with trading opportunities on various exchanges.\n\nToken Information\n\nName: TTcoin\n\nSymbol: TC\n\nDecimal: 4\n\nMax Supply: 6,000,000,000\n\nThe primary purpose of TTcoin is to add value to its investments by collaborating with authentic brands and institutions, thus safeguarding its users from manipulative events on exchanges. The project has secured agreements with advertising agencies to generate revenue from mobile applications and games, which is then used to fund TTcoin's development and services for its investors.\n\nTTcoin's economic model includes regular token burnings to achieve a stable supply and protect the project from manipulative movements. Two billion tokens are allocated for exchanges, with agreements planned in different countries. The team's wallet holds 500 million coins, which fund ongoing projects and exchange agreements.\n\nTo further strengthen user confidence, TTcoin smart contracts have been fully audited by smart contract auditing company eNebula solutions.\n\nTTcoin can be easily added to active cold or exchange wallets supporting the TRC20 and BEP20 networks. Popular wallets like Trust Wallet and Tronlink Pro can store TTcoin securely.\n\nTTcoin Ecosystem\n\nTTcoin actively works on both virtual and tangible projects. Besides its virtual projects, the team focuses on developing real-life initiatives. One notable venture is the establishment of the first cryptocurrency football club, TTcoin FC, which aims to engage investors and bridge the worlds of football and crypto.\n\nTTcoin Wallet: TTcoin offers a decentralized cryptocurrency wallet that supports TTcoin and various other cryptocurrencies. Fees for transactions are charged in TTcoin, enhancing the utility of the token.\n\nTTcoin Blockchain: The project operates a cryptocurrency blockchain capable of processing 100,000 transactions per second with low fees. Utilizing the TC20 smart contract, TTcoin enables affordable project development.\n\nTTcoin Swap: TTcoin Swap is an ecosystem that allows users to create TC20 tokens within TTcoin's shared network of networks. These created tokens can be sent with minimal network fees.\n\nTTcoin Meta: TTcoin Meta is a game set in diamond realms, where players can mine diamonds and convert them into TC. The game also features market and social areas for players to interact with each other.\n\nTTcoin Football Club Token Burning Plan\n\nTTcoin Football Club implements a token burning plan based on various club activities, such as matches played, goals scored, victories, and draws. Additionally, tokens are burned from the exchange during championships. Visit the whitepaper for a full breakdown.\n\nTTcoin Mobile Apps\n\nTTcoin offers a range of mobile apps, including TTcoin Network for mining, TTcoin Rewards for earning rewards through tasks, and TTcoin FC for football club-related information.\n\nThe TTcoin Team\n\nThe TTcoin team demonstrates dedication to transparency and accountability. They actively develop projects, implement marketing strategies, and secure exchange agreements to ensure a vibrant and open market for TTcoin. Delegates in various countries assist the community and promote TTcoin's development.\n\nTTcoin's commitment to real-world utility and institutionalism is evident in its partnerships with authentic brands and institutions. By introducing innovative applications like the TTcoin mining app and TTcoin Network, the project has showcased its ability to adapt and excel in a fast-paced market.\n\nAs TTcoin continues to push the boundaries of innovation and establish itself as a trustworthy ecosystem, investors and users can look forward to exciting developments and opportunities in the future.\n\nStay updated with TTcoin Network via the following links:"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd3d3LmRvcnNldC5saXZlL25ld3MvZG9yc2V0LW5ld3MvbXlzdGVyeS1tYW4tbWlzc2luZy0yNy15ZWFycy03MDkwMjY40gFRaHR0cHM6Ly93d3cuZG9yc2V0LmxpdmUvbmV3cy9kb3JzZXQtbmV3cy9teXN0ZXJ5LW1hbi1taXNzaW5nLTI3LXllYXJzLTcwOTAyNjguYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jul 2023 07:00:00 GMT",
        "title": "Mystery of man missing for 28 years - last seen at a bed and breakfast in Dorset - Dorset Live",
        "content": "The mystery of a man, who has been missing for 28 years, plagues one mother who is desperate to find her son. Marcus Rigby was last seen at a bed and breakfast on Portland in 1995. His mother Mary still honours his birthdays and is desperate to trace any information about him.\n\nMarcus was 27 years old when he went missing on April 17, 1995. He first left his home town of Grange-over-Sands near Cartmel in Cumbria, after telling his family that he was heading south to make a 'fresh start' and that he would be in touch in a week.\n\nSadly, the family never heard from him again. They later learnt that he had headed to his aunt's house for a couple of days and then went to Weymouth for work. There was a final sighting of Marcus, six months after his departure, and that was a bed and breakfast on Artists Row on Portland.\n\nRead more: Good Pub Guide: The 14 best pubs in Dorset you have to visit in 2022\n\nMarcus, an artist, left behind a son named Daniel who was 6 years old at the time of his disappearance, and his mother Mary has often spoken out about how all of the family yearn to see him.\n\nThe family are said to have received numerous reports of 'Marcus' being seen over the years around Dorset - however, these are unconfirmed. Marcus's disappearance has been featured on a variety of appeals, with some information citing that he may refer to himself as Marc Smith. Marc is described as being 5ft 11in, slim build and with brown hair.\n\nThe family continue to share updates and information on a dedicated Facebook page for Marcus here. If you have any information on missing Marcus, you can call Cumbria Police on 101. You can remain anonymous at Crimestoppers on 0800 555 111 or use their online reporting service. Alternatively, phone/text Missing People on 116 000 or email 116000@missingpeople.org.uk quoting reference 01-001194.\n\nGot a story to share or an issue for us to investigate? Email us at news.dorsetlive@reachplc.com to share your pictures, stories and information.\n\n\n\nYou can stay up-to-date on the top news near you with Dorset Live's FREE newsletters – enter your email address at the top of the page or sign up to our newsletters here."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vYW1iY3J5cHRvLmNvbS93aXRoLWJpbmFuY2VzLWJhY2tpbmctd2lsbC1mZHVzZC1yZXBsaWNhdGUtdHVzZHMtZmVhdC_SAVBodHRwczovL2FtYmNyeXB0by5jb20vd2l0aC1iaW5hbmNlcy1iYWNraW5nLXdpbGwtZmR1c2QtcmVwbGljYXRlLXR1c2RzLWZlYXQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jul 2023 07:00:00 GMT",
        "title": "With Binance’s backing, will FDUSD replicate TUSD’s feat? - AMBCrypto News",
        "content": "FDUSD started with a bang, recording 5 million in hourly trade volumes on the day of the listing.\n\nThe zero-fee trading program might have contributed to the soaring volume of the coin.\n\nStablecoin First Digital USD [FDUSD] made an impressive start after getting listed on the Binance exchange earlier this week.\n\nAccording to digital assets data provider Kaiko, FDUSD traded at a premium to world’s largest stablecoin, Tether [USDT], briefly on 28 July, reflecting greater demand for the newly-listed asset.\n\nEffect of the zero-fee promotion?\n\nThe USD-backed stablecoin started with a bang, recording 5 million in hourly trade volumes on the day of the listing. However, as indicated above, volumes have considerably cooled off since then. Consequently, FDUSD’s peg also stabilized at $1.00 at the time of writing, per data from CoinMarketCap.\n\nFDUSD is a 1:1 USD-backed stablecoin issued by Hong Kong-based First Digital Labs. The coin was listed as part of Binance’s now popular zero fee trading program with all spot trading pairs, including FDUSD/USDT, becoming exempt from maker and taker fees.\n\nThe exchange fee waive-offs might have contributed to the soaring volume of the coin as highlighted earlier. It should be noted that Binance employed the same promotional strategy to promote another stablecoin, TrueUSD [TUSD].\n\nTUSD’s market cap has more than tripled on a year-to-date (YTD) basis, as per Glassnode.\n\nBinance looks beyond BUSD\n\nBinance’s aggressive backing of newer stablecoins should be seen in the light of the phasing-out stage of Binance USD [BUSD], which once vied for the stablecoin crown with Tether.\n\nIts downfall commenced after a New York-based regulator instructed the issuing company Paxos to halt the minting of new tokens. Since then, Binance has attempted to distance itself from BUSD and is looking to promote other stablecoins.\n\nWill the market achieve parity?\n\nThe success of TUSD and FDUSD was imperative to correct the imbalance in the current state of stablecoin market.\n\nAt the time of writing, USDT accounted for a massive 66% of the overall market share, having benefitted from the decline of USD Coin [USDC], DAI, and BUSD.\n\nUSDT’s dominance could be ascertained by the fact that its market cap was twice as high as the combined market valuation of the next four stablecoins in the list.\n\nFDUSD’s launch was mired in controversy briefly after a popular Twitter user alleged links between Tron [TRX] founder Justin Sun and the custodian First Digital. However, nothing in the public eye as yet to suggest anything of this sort."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmNyeXB0b25ld3N6LmNvbS9kb2dlLXNvYXJzLTEwLXBlcmNlbnQteC10d2l0dGVyLWh5cGUtYm9vc3QtdmMtc3BlY3RyYS1idWxsaXNoL9IBXmh0dHBzOi8vd3d3LmNyeXB0b25ld3N6LmNvbS9kb2dlLXNvYXJzLTEwLXBlcmNlbnQteC10d2l0dGVyLWh5cGUtYm9vc3QtdmMtc3BlY3RyYS1idWxsaXNoL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jul 2023 07:00:00 GMT",
        "title": "DOGE soars 10%, X (Twitter) Hype Boost? VC Spectra Bullish? - CryptoNewsZ",
        "content": "Dogecoin (DOGE) has seen an investor rush leading to a 10% price rise after its logo was displayed on X, as Twitter is now known. Similarly, VC Spectra (SPCT), now in its second presale stage, is experiencing an investor surge due to the promise of significant gains.\n\nIs it time to buy and hold Dogecoin (DOGE)?\n\nDogecoin experienced increased investor activity on July 25 after Elon Musk rebranded Twitter to X and temporarily placed a Dogecoin sign on the logo and video on his profile. The action resulted in a price increase that investors hope will boost the price of DOGE beyond the $0.09 point.\n\nMoreover, in the last 24 hours, Dogecoin experienced a price increase from $0.07 to $0.08. The 14% price increase is due to the prediction that Elon Musk may integrate Dogecoin (DOGE) into X for payments. If it happens, the price of DOGE may rise to $0.09 and beyond.\n\nExperts project the price of Dogecoin will keep rising based on the market’s bullish sentiment. Analysts indicate that Dogecoin support levels and RSI are rising to show an increase in investors. Consequently, they predict Dogecoin (DOGE) will break the $0.08 price level by the end of July.\n\nWill the bullish momentum in Dogecoin reflect on VC Spectra?\n\n>>BUY SPCT TOKENS NOW<<\n\nVC Spectra (SPCT) early investors see increased interest amid projected gains\n\nVC Spectra recently started its second presale stage at a 37.5% growth over the previous one to sell at $0.011. Projected gains at the end of the presale have caused an increase in SPCT buyers.\n\nVC Spectra (SPCT) is a decentralized hedge fund that enables investors to engage in crypto ICOs calendar and gain stakes in blockchain tech firms.\n\nLeveraging cutting-edge AI and mechanical & algorithmic trading strategies, VC Spectra (SPCT) picks investments that guarantee profitability for its investors and growth for the fund.\n\nTo join VC Spectra, investors purchase SPCT, a blockchain-based token developed on the BRC-20 standard. SPCT enables seamless transactions on the VC Spectra platform. Moreover, it has a deflationary mechanism that reduces circulation and preserves long-term value.\n\nAfter the second presale stage, VC Spectra will advance into the third stage at a projected 127.27% price increase to $0.025. SPCT will launch on live exchanges at $0.08 after the final presale stage.\n\nNow is the best time to acquire a stake in VC Spectra & join this exciting investment journey.\n\nLearn more about the VC Spectra presale here:-\n\nPresale: https://invest.vcspectra.io/login\n\nWebsite: https://vcspectra.io\n\nTelegram: https://t.me/VCSpectra\n\nTwitter: https://twitter.com/spectravcfund"
    }
]