[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3Lm9ubHlpbnlvdXJzdGF0ZS5jb20vc291dGgtY2Fyb2xpbmEvY2Fib29zZS1iZWQtYW5kLWJyZWFrZmFzdC1yb29tLXNjL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "Stay In A Caboose Bed And Breakfast Room In South Carolina - Only In Your State",
        "content": "As local travel experts, we know what travelers are looking for when it comes to finding the perfect accommodations for their next trip. To compile our lists, we scour the internet to find properties with excellent ratings and reviews, desirable amenities, nearby attractions, and that something special that makes a destination worthy of traveling for.\n\nSouth Carolina has a long and fascinating railroad history, holding several records, even, including having the first railroad junction in the world, one of the first railroads in North America to be chartered and constructed, and providing the first steam-powered, scheduled passenger train service in the United States. From the small-town library housed in an old train depot building to the train museum in Winnsboro operated by volunteers, we are proud of this history and work hard to ensure it is well preserved. Now there’s even a caboose bed and breakfast room in South Carolina that you can stay in overnight!\n\nVisit the Clevedale Historic Inn and Gardens website or the Clevedale Historic Inn and Gardens Facebook page for more information and to book your stay in this charming caboose bed and breakfast room.\n\nWhat’s the most unique place in South Carolina you’ve ever stayed overnight? Please share about it with us in the comments section below!\n\nWant more South Carolina in your inbox? Get the latest on things to see, do, and eat around South Carolina! spinner Thank you! You will receive your first email soon. An error occured. Subscribe"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiMWh0dHBzOi8vbmZ0cGxhemFzLmNvbS9wdWRneS1wZW5ndWlucy1jcm9zcy1jaGFpbi_SATVodHRwczovL25mdHBsYXphcy5jb20vcHVkZ3ktcGVuZ3VpbnMtY3Jvc3MtY2hhaW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "Pudgy Penguins Goes Cross Chain with LayerZero Partnership - NFT Plazas",
        "content": "Pudgy Penguins Goes Cross Chain with LayerZero Partnership\n\nPudgy Penguins, an Ethereum-based NFT collection, has partnered with LayerZero to enable cross chain transactions. The project seeks to reach millions of Web3 users by utilizing the capabilities of various chains to aid access. Thus, it has chosen to work with Polygon, BNB Smart Chain, and Arbitrum thanks to their “rapidly growing usage and exposure.”\n\nNatively based on Ethereum, Pudgy Penguins is composed of 8,888 hand-drawn penguins with unique characteristics. Lately, the project has witnessed an uptick in transaction volume, averaging almost 2 million a day. However, this has created congestion on the Ethereum network, with gas fees shooting up by 1,000%. Thus, the project feels the current infrastructure is limiting as it seeks to onboard millions of new Web3 users.\n\nFor this to happen, it must be “easy for the next wave of users to be able to interact and become part of the pudgy Penguins ecosystem.” In addition, users should become part of the “ecosystem without having to worry about the huge gas fees.”\n\nThanks to cross-chain technology, the Pudgy Penguins community can have the best of both worlds: “provenance” and “user experience.” As a result, has teamed up with LayerZero, an omni-chain interoperability protocol that allows any project to go cross-chain. Using the protocol’s technology, Pudgy Penguins can now travel seamlessly across Ethereum, Polygon, Arbitrum, and the BNB Smart Chain.\n\nThere’s been a leak from the lab: A portal allowing Lil Pudgys to travel between chains has opened… The Lil Pudgys are officially cross-chain 🧵 pic.twitter.com/16xVApFduo — Pudgy Penguins (@pudgypenguins) January 25, 2023\n\nWhy Pudgy Penguins Chose The Three Chains\n\nOn their choice of Polygon, Pudgy Penguins notes that the chain has demonstrated excellent business development. Over the past few months, Polygon has managed to interact with the likes of Instagram, Reddit, and Robinhood. It was this ability to attract a new wave of users to become a part of the Web3 community that proved too appealing to Pudgy Peguins.\n\nThe project choose BNB Smart Chain (BSC) for its low gas fees and its commitment to inclusivity, and Arbitrum for its suitability for DeFi development.\n\nThat said, after you bridge your Pudgy Penguins NFTs to any of the chains, you will receive a commemorative SoulBound token, that serves as a souvenir tied eternally to your wallet.\n\nWant more? Connect with NFT Plazas\n\nJoin the Weekly Newsletter\n\nJoin our Discord\n\nFollow us on Twitter\n\nLike us on Facebook\n\nFollow us on Instagram\n\n*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2dhbWluZy11bmlxdWUtYWN0aXZlLXdhbGxldHMtZ3Jldy02MC1pbi0yMDIyLW9uLWNoYWluLXRyYW5zYWN0aW9ucy11cC0zNy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "Gaming unique active wallets grew 60% in 2022 – on-chain transactions up 37% - CryptoSlate",
        "content": "Web 3 gaming on-chain transactions and Unique Active Wallets (UAW) recorded 37% and 60% growth during 2022, according to a recent report from DappRadar.\n\nThe top three most popular gaming blockchains were Wax (WAXP), Hive (HIVE), and BNB Chain (BNB), with 353,000, 234,000, and 136,000 daily UAWs, respectively, according to the DappRadar report.\n\nGaming growth\n\nCurrently, 1.15 million daily UAWs connect to gaming dApps, marking a 60% increase over 2021. This increase in daily gaming UAW numbers also allowed games to dominate DeFi UAWs in 2022.\n\nIn 2021, Defi UAWs were dominant by occupying 41% of the industry share, while gaming’s was 39%. This changed to 28% for Defi and 49% for gaming in 2022, positioning the gaming UAWs as the dominants of the market.\n\nMeanwhile, on-chain game transactions have increased to 7.4 billion in 2022, marking a 37% increase since 2021 and an impressive 3,260% since 2020. One unique wallet conducted 25 gaming on-chain transactions on average in 2022.\n\nThis growth was recorded despite the halting effects of the bear market, which caused many aspects of the crypto sphere to shrink. Gaming activities, however, currently account for 49% of the on-chain activity DappRadar tracks.\n\nChains\n\nProtecting its ranking in 2021, Wax remained the most popular gaming blockchain that hosted the highest number of daily UAWs. Wax attracted 353,000 daily UAWs, which marked a 57% increase from 224,000 in 2021.\n\nHive, BNB Chain, and Polygon (MATIC) followed WAX as the second, third, and fourth in ranking with 234,000, 136,000, and 97,000 daily active UAWs, respectively. 2022’s numbers marked 96% and 20% year-over-year growth for Hive and BNB Chain.\n\nHowever, Polygon’s UAW count in 2022 marked a staggering 338% growth since 2021. The report states that the chain owes this expansion to the popularity of games like Arc8, Benji, Bananas, Crazy Defense Heroes, and Pegaxy.\n\nIncreasing its daily UAW count from 138 in 2021 to 12,300, Flow (FLOW) recorded the most extensive growth in 2022 with 8,881%.\n\nInvestments\n\nThroughout 2022, Web3 Gaming and metaverse projects jointly raised $7.6 billion in investment, which marks a 59% increase since 2021.\n\nIn 20219 and 2020, the total amount of investments raised by these fields was measured in millions. It reached billions for the first time in 2021, with a total of $3.7 billion.\n\nThe three most significant investments that fell under this category in 2022 were Flow’s $725 million Ecosystem Fund, the $500 million investment fund by Immutable X, and the $450 million funding raised by Yuga Labs and Polygon each.\n\nThe above graph represents the breakdown of the $7.6 billion spared in gaming and the metaverse in 2022. Projects focusing on infrastructure reserved 33.5% ($2.54 billion) for themselves. Another $2 billion went to individual gaming and metaverse projects, which accounted for 27.3% of the total amount. Guilds and incubator programs got another $1.4 billion, while investment firms got $1 billion.\n\nMentioned in this article"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3QvZmxva2ktZmx5aW5nLW9uLXByb3Bvc2FsLXRvLWJ1cm4tYnJpZGdlLXNsYXNoLXRva2VuLXRheNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 15:58:25 GMT",
        "title": "FLOKI Flying on Proposal to Burn Bridge, Slash Token Tax - BSC NEWS",
        "content": "BNB\n\nThe value of $FLOKI shot up by 20% in one day as the Floki DAO weighs a proposal to burn the memecoin's bridge and slash the transaction tax by 90%.\n\n99%+ in Favor of DAO Proposal\n\nWho says you shouldn’t burn your bridges? The price of $FLOKI has increased by 20% in the day since a proposal was floated to terminate the Floki cross-chain bridge between BNB Chain and Ethereum, burn more than $65 million worth of tokens on the bridge, and reduce the token’s buy/sell tax by 90%.\n\n#Floki's latest DAO proposal is live!\n\n\n\nIf this proposal passes:\n\n\n\n- 4.97 trillion $FLOKI tokens (worth ~$54,670,000) in the Floki bridge will be burnt.\n\n- The #Floki buy/sell transaction tax would be reduced to 0.3%.\n\n\n\nRead the full proposal and vote here:https://t.co/nmx4cxJ6v1 — FLOKI (@RealFlokiInu) January 26, 2023\n\nAs laid out in the proposal before the Decentralized Autonomous Organization (DAO) , the Floki team created the cross-chain bridge in order to expose the then-Ethereum-based memecoin to the BNB Chain community, while keeping the total supply of $FLOKI on both chains to 10 trillion tokens. Now, six times as many $FLOKI holders are on BNB Chain as opposed to Ethereum, although the total number of tokens held on Ethereum is slightly higher.\n\nCiting the equilibrium that has been achieved, the Floki proposal says the bridge is no longer needed and instead poses a security risk to the project since it holds a majority of the token’s maximum supply (most of it “inactive” tokens that a clever hacker could potentially activate).\n\nSo far, the ‘Ayes’ are running away with the votes.\n\nDestroying the bridge would also involve burning 4.97 trillion tokens, with a current value of -- as of the time of writing -- more than $65 million. Additionally, 600 billion tokens (current value $8.0 million) that were used to seed the bridge would be returned to the Floki treasury, and be split between boosting the Valhalla ecosystem and general operations and growth.\n\nThe influx of funds, plus Floki’s growing utility projects (such as the Shop Floki merchandise store), would offset the revenue generated by the token’s current 3% transaction tax, which has fallen off dramatically during the bear market. Accordingly, the proposal calls for cutting that tax to 0.3%.\n\nAccording to the dev team, the total supply of $FLOKI will remain below 10 trillion tokens.\n\nMidway through the voting period, which ends Jan. 28, the Viking community has responded to the proposal with practically unanimous support so far. Approximately 99.5% of votes have been cast in favor of the option to burn the bridge and cut the tax.\n\nWhat is Floki:\n\nFloki Inu began with a tweet from Elon Musk. When the billionaire announced he would name his Shiba Inu puppy Floki, it created a deluge of ‘Floki’ dogcoins. The most successful of these is Floki. Floki is currently the third most popular meme token on the market, behind Dogecoin and Shiba Inu. It is backed by a community of committed enthusiasts and a strong marketing campaign.\n\nWhere to find Floki:\n\nWebsite | Twitter | Telegram | Discord"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vY2EuZmluYW5jZS55YWhvby5jb20vbmV3cy9mbG9raS1pbnUtZGV2ZWxvcGVycy1mbG9hdC1kYW8tMDkyNDEzNTI5Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "Floki Inu Developers Float DAO Proposal to Burn $55M of Its Own Tokens - Yahoo Canada Finance",
        "content": "Developers behind Floki Inu, the Shiba Inu dog breed-themed project, have floated a governance proposal to burn nearly $55 million of its namesake FLOKI tokens and reduce a tax levied on each transaction.\n\nBurning tokens is a way of reducing supply, which subsequently adds value to each token as long as the level of demand remains the same. The Floki team hopes to position the project as serious decentralized finance (DeFi) contender. “Floki's latest DAO vote makes it clear that Floki is more than just a memecoin,” B, a Floki core team member told CoinDesk, referring to a decentralized autonomous organization.\n\n“Floki has demonstrated a strong focus on utility and fundamentals: through the mainnet release of our FlokiFi Locker protocol and the first major testnet release of our metaverse game Valhalla in a bear market,” the core team member added.\n\nThe proposal also pointed out security risks associated with bridges as another rationale. Last year alone saw over $2 billion lost or stolen from cross-chain bridges, as CoinDesk reported.\n\nADVERTISEMENT\n\n“More exploits and data have emerged to show how much of a threat cross-chain bridges could pose, especially if they hold a significant amount of a token’s supply,” the proposal stated.\n\n“In Floki’s case, an exploit on our main cross-chain bridge would have a catastrophic impact on the project since this bridge currently holds 55.7% of what FLOKI’s total circulating supply should be. This is a lot of tokens, and that’s more than enough to drain the project’s liquidity pools and essentially destroy the project if exploited,” they added.\n\nIf this proposal passes, some 4.97 trillion FLOKI tokens in the Floki bridge will be burnt while the self-imposed buy and sell tax on each transaction would be reduced to 0.3%. The bridge would also be permanently disabled.\n\nAt writing time on Friday, an overwhelming 99% of all voters were in support of the newly floated proposal, the governance forum shows.\n\nBridges refer to a blockchain-based tool that allows users to transfer tokens between different networks.\n\nStory continues\n\nThe Floki bridge\n\nFloki initially issued its token on Ethereum with a total supply of 10 trillion tokens before eventually expanding to the faster and cheaper BNB Chain in 2021, after community requests.\n\nThe team had to launch another contract on the BNB Chain with its own total supply of 10 trillion tokens. However, this required a cross-chain bridge to ensure the FLOKI total circulating supply at any given time never exceed a total supply of 10 trillion tokens and to allow for users to transfer their FLOKI from Ethereum to BNB Chain and vice versa.\n\nAt the time, the team used 600 billion tokens from its treasury on Ethereum and BNB Chain to provide the initial funds for the bridge.\n\nSince then, most holders locked their FLOKI tokens on Ethereum and transferred those out on BNB Chain. “As a result of this, while the majority of the supply is still on the [Ethereum] chain there is now such a balance that the absence of a bridge would not threaten the stability of project,” developers wrote in the proposal.\n\nFLOKI remained nominally changed over the past 24 hours, data from CoinGecko show. The tokens have appreciated 6% in the past week."
    }
]