[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL3d3dy5ibG9vbWJlcmcuY29tL25ld3MvYXJ0aWNsZXMvMjAyMy0wOC0yMi9iaW5hbmNlLXMtYm5iLXRva2VuLWFwcHJvYWNoZXMtbW9yZS10aGFuLXllYXItbG93LWFzLXJlZ3VsYXRvcnktcHJlc3N1cmUtbW91bnRz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 22 Aug 2023 07:00:00 GMT",
        "title": "Binance's Token Approaches More Than One-Year Low as Regulatory Pressure Mounts - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL3d3dy5ibG9vbWJlcmcuY29tL25ld3MvYXJ0aWNsZXMvMjAyMy0wOC0yMi9iaW5hbmNlLXMtYm5iLXRva2VuLWFwcHJvYWNoZXMtbW9yZS10aGFuLXllYXItbG93LWFzLXJlZ3VsYXRvcnktcHJlc3N1cmUtbW91bnRz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 22 Aug 2023 07:00:00 GMT",
        "title": "Binance's Token Approaches More Than One-Year Low as Regulatory Pressure Mounts - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL3d3dy5ibG9vbWJlcmcuY29tL25ld3MvYXJ0aWNsZXMvMjAyMy0wOC0yMi9iaW5hbmNlLXMtYm5iLXRva2VuLWFwcHJvYWNoZXMtbW9yZS10aGFuLXllYXItbG93LWFzLXJlZ3VsYXRvcnktcHJlc3N1cmUtbW91bnRz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 22 Aug 2023 07:00:00 GMT",
        "title": "Binance's Token Approaches More Than One-Year Low as Regulatory Pressure Mounts - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDgvMjIvYm5iLXRva2VuLXN0dW1ibGVzLXRvLTEteWVhci1sb3ctYW1pZC1tb3VudGluZy1zY3J1dGlueS1vdmVyLWJpbmFuY2Uv0gF1aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wOC8yMi9ibmItdG9rZW4tc3R1bWJsZXMtdG8tMS15ZWFyLWxvdy1hbWlkLW1vdW50aW5nLXNjcnV0aW55LW92ZXItYmluYW5jZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 22 Aug 2023 07:00:00 GMT",
        "title": "BNB Token Stumbles to 1-Year Low Amid Mounting Scrutiny Over Binance - CoinDesk",
        "content": "A looming liquidation of a crypto loan secured by $130 million worth of BNB on decentralized finance protocol Venus also adds pressure to the token’s price. BNB Chain is coordinating with Venus to dismantle the loan in an orderly fashion to avoid “cascading liquidation” and “unnecessary damage to the market,” according to a Venus governance vote."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMDgvMjIvdG9wLWludmVzdG9yLWFza3MtdXNlcnMtdG8td2l0aGRyYXctZnJvbS1iaW5hbmNlLWFsbGVnZXMtYm5iLWlzLWR5aW5nLWxpa2UtYnVzZC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 22 Aug 2023 07:00:00 GMT",
        "title": "Top Investor Asks Users to Withdraw From Binance, Alleges BNB Is Dying Like BUSD - The Crypto Basic",
        "content": "Some crypto community figures speculate that Binance could collapse should its native asset BNB plummet below the $200 psychological support.\n\nAmid the bearish trend affecting the crypto market, a prominent figure in the crypto space is speculating about the health of the largest crypto exchange Binance.\n\nIn a recent tweet, Mike Alfred, a director for Eaglebrook Advisors, argued about Binance’s financial health using BNB. Alfred believes that the performance of BNB, Binance’s native asset, reflects the exchange’s buoyancy.\n\n- Advertisement -\n\nSince BNB trades at $206.83, with a significant 13.44% drop over the past week, Alfred believea the asset is unhealthy. He extended the supposed poor health to the Binance trading platform.\n\n“As BNB goes, so goes Binance. And BNB looks sick,” the crypto investor remarked.\n\nAs BNB goes, so goes Binance. And BNB looks sick. BUSD is already dead in the water. If BNB breaks under $200, it could quickly collapse as the rats flee the sinking ship. This could get ugly quickly. Pull any remaining funds while the platform is still operational. Godspeed. — Mike Alfred (@mikealfred) August 21, 2023\n\nBUSD Is Already Dead\n\nFurthermore, Alfred highlighted the current condition of Binance stablecoin (BUSD). He noted that BUSD was already lifeless, given that it now rests at 23 on the ranking of prominent coins.\n\n- Advertisement -\n\nNotably, BUSD ranked number five with a market cap of over $39 billion early this year. However, the asset lost investors’ interest amid regulatory challenges. So far, BUSD has lost over $35 billion of its valuation since January.\n\nMeanwhile, Alfred argued that BNB breaking below $200 could be catastrophic for Binance. In his view, BNB below $200 would mean panic sell-offs, which he alleges would lead to the collapse of Binance.\n\nMoreover, Alfred urged Binance users to withdraw their funds from the exchange while the platform remains operational. In his words:\n\n“If BNB breaks under $200, it could quickly collapse as the rats flee the sinking ship. This could get ugly quickly. Pull any remaining funds while the platform is still operational.”\n\nIt bears mentioning that these are mere speculations and do not necessarily reflect the reality of things.\n\nBinance Defending BNB?\n\nInterestingly, Mike Alfred is not the only prominent figure holding this belief about Binance. In a recent tweet, a Professor of Science, Adam Cochran, highlighted more vital issues surrounding Binance.\n\nCochran alleged that Binance was using its SAFU fund to sustain the price of BNB from crashing. He highlighted that Binance sells Bitcoin (BTC) each time the BNB price falls. According to him, the purchases were being established using the Secure Asset Fund for Users (SAFU).\n\n6/7 It’s pretty clear that the SAFU fund and the now non-existent industry fund are what is being used to prop up BNB prices. And given the frantic BTC sell off each time BNB dips, I’m guessing the real balances of even the SAFU fund are getting low. — Adam Cochran (adamscochran.eth) (@adamscochran) August 19, 2023\n\nNotably, the conversation that prompted Cochran’s allegations was a claim that Binance was struggling to sustain BNB above $212. According to the claimants, BNB should have fallen much more, save for some $30 million re-buy order on BNB.\n\nThe CEO of Binance, Changpeng Zhao, responded to the claims, highlighting how it lacks logic. Zhao argued that a $30 million BNB re-buy is insignificant compared to the coin’s daily trading volume.\n\nAnd where did the $212 magic number come from? #BNB price is determined by the market. A $30m re-buy is less than 4% of a single day's volume. ?‍♂️ — CZ ? Binance (@cz_binance) August 19, 2023"
    }
]