[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vc2VlbmV3cy5jb20vbmV3cy9idWxnYXJpYW4tYy1iYW5rLWFsbG9jYXRlcy01Ni1tbG4tZXVyby1mb3ItcHJlcGFyYXRpb24tZm9yLWV1cm96b25lLWVudHJ5LTgxMDI4OdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Bulgarian c-bank allocates 56 mln euro for preparation for eurozone entry - SeeNews",
        "content": "January 4 (SeeNews) - Bulgaria's central bank will spend 109.7 million levs ($59.6 million\\ 56.1 million levs) this year on preparations for the introduction of the euro on January 1, 2024, it said.\n\nThe amount includes expenditure for maintenance of monetary circulation, personnel, equipment, hired services and fees for participation in the European Central Bank (ECB) and other EU financial institutions, the Bulgarian National Bank (BNB) said in its budget for 2023 published at the end of December.\n\nThe BNB's overall expenses were increased by an annual 88.5% to 265.7 million levs. The expenses for minting new coins in 2023 jumped by an annual 402% to 108.6 million levs, including 89.8 million levs for production of Bulgarian euro coins worth 780 million euro.\n\nInvestment expenditure was approved at some 97.5 million levs, or 231% more than in 2022. Preparations for euro adoption, including IT systems upgrades, construction and refurbishment, new equipment and devices, will absorb 52.7 million levs of the planned investment.\n\nLast month, BNB signed an initial agreement paving the way for the start of euro coin production once Bulgaria is cleared for euro zone membership.\n\n(1 euro = 1.95583 levs)"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmJpdGNvaW5zZW5zdXMuY29tL2JpbmFuY2UtYm5iLXByaWNlLXByZWRpY3Rpb24tdG9kYXktMDQtamFuLTIwMjItcHJpY2UtYnJlYWtpbmctb3V0LXJpZ2h0LW5vdy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Binance BNB Price Prediction Today (04-Jan-2022) Price Breaking Out Right Now - Bitcoinsensus",
        "content": "How is Binance BNB Looking Today?\n\nBinance BNB is currently trading above $250 and is finally gaining momentum on the lower timeframes. As mentioned in our previous analyses, the price faced resistance around the $250 mark and struggled to break above it on lower timeframes. Right now, we can see bullishness for BNB as the price managed to form a big green candle on the 4-hour timeframe earlier this morning. This move can also invite more trading volume, and we can expect further upside movement in the short term. Let’s take a quick look at the Binance BNB Price Prediction Today (04-Jan-2022) to see where the price could be headed next in the coming days.\n\nYou can trade Bitcoin with leverage on Bybit. By using our link, you can get up to a $30,030 bonus. (Bonus may vary based on deposit amount)\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nAnalyzing the Charts\n\nIf we take a look at the latest charts for BNB, we can also notice that the price was forming a symmetrical triangle on the 4-hour charts. The structure is now playing out, and BNB has broken above the resistance at $250.\n\nA symmetrical triangle is a neutral pattern that indicates that the price is being squeezed and could break out in either direction.\n\nBNB has broken towards the upside and its target, according to the structure, is around the $260 mark. The target was almost met with the first breakout candle on the 4-hour timeframe.\n\nOn the other hand, we can also notice that the trading volume is low. If the trading volume for BNB does not improve, BNB could drop below $250 again.\n\nIt is possible that the volume will start increasing because of the current breakout. Once BNB manages to break above $260, we can expect further continuation towards the upside.\n\nConclusion: Final Verdict on Binance BNB\n\nBNB is looking quite bullish at the moment as it is gaining momentum on the lower timeframes. If the volumes flow in the coming hours, we can expect the price to go above $260 once again. An increase in volume would be a promising sign, and we will be interested in placing a long trade on BNB if that happens. Right now, we will just be watching the price closely.\n\nMargin Trading for Beginners\n\nIf you are interested in leverage trading Bitcoin, you can go through our Margin Trading Guide to learn more about it. You can also check our list of top crypto exchanges to choose the platform that best suits your needs.\n\nPrimeXBT Covesting: Copy Trading\n\nSign up on PrimeXBT today to trade Bitcoin hassle-free. You can copy experienced traders and access hundreds of different strategies! Don’t forget to claim a bonus of up to $7000 by using the promo code “bitcoinsensus50” with our link.\n\nhttps://www.youtube.com/watch?v=dJih0exXvek\n\n[primexbt]"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMS8wNC9saXRlY29pbi1hYm91dC10by1leHBsb2RlLXRvcC10cmFkZXItbG9va3MtYXQtcG90ZW50aWFsLW9wcG9ydHVuaXRpZXMtaW4tbHRjLWFuZC1vbmUtbW9yZS1sYXJnZS1jYXAtYWx0Y29pbi_SAZEBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDEvMDQvbGl0ZWNvaW4tYWJvdXQtdG8tZXhwbG9kZS10b3AtdHJhZGVyLWxvb2tzLWF0LXBvdGVudGlhbC1vcHBvcnR1bml0aWVzLWluLWx0Yy1hbmQtb25lLW1vcmUtbGFyZ2UtY2FwLWFsdGNvaW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Litecoin About To Explode? Top Trader Looks at Potential Opportunities in LTC and One More Large Cap Altcoin - The Daily Hodl",
        "content": "A closely followed crypto trader says now may be the time to keep an eye on peer-to-peer payments network Litecoin (LTC).\n\nThe pseudonymous trader known as Cantering Clark tells his 156,000 Twitter followers that LTC is forming a structural pattern that previously signaled bottoms and reversals.\n\nCantering Clark’s chart shows LTC bouncing off a support level at around $71.\n\n“Is Litecoin about to wow everyone? I haven’t looked at this since the baby came, and when I did I was expecting a breakdown.\n\nInstead there is a lot of structural and trend similarity to a prior bottom. Difference is context and an unforgiving environment for risk. Will it care?”\n\nThe trader sees similar opportunities in Binance Coin (BNB), the native token of the world’s largest crypto exchange. He says that the FUD (fear, uncertainty and doubt) that Binance faced in previous weeks regarding its solvency is in the past, and that BNB should benefit from increased confidence.\n\n“[Eyes] on BNB – Binance fud is mostly out of the narrative.\n\nHistorically a strong pair against BTC and ETH, so maybe we see some strength and return back to prior norms.\n\nThe R:R (risk to reward) for a long here on a breakout of the last 2 week range is well defined & failure sets up a good short…\n\nELI5 (Explain like I’m 5):\n\nWe are in a contextually attractive area to define short term bias for both directions. If the long is invalidated by losing something like 253, then an attractive short opportunity with risk defined above today’s high sets up.”\n\nLast week, the popular trader said that Ethereum (ETH) rival Solana (SOL) was showing signs of a bottom.\n\n“Looks like the market might actually be a bit crowded here. I think that my own interpretation of calling for another 50% drop along with everyone else calling for $3 might be the signal that this thing is completely one-sided and potentially bottoming here for the near future.”\n\nSo far, the crypto trader’s call on Solana has been accurate. At time of writing, SOL is trading at $13.48, over 62% from its low of $8.30.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMS8wNC9hbmFseXN0LXByZWRpY3RzLXJhbGxpZXMtZm9yLWNoYWlubGluay1wb2xrYWRvdC1iaW5hbmNlLWNvaW4tYW5kLXR3by1hZGRpdGlvbmFsLWFsdGNvaW5zLWhlcmUtYXJlLWhpcy10YXJnZXRzL9IBkwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMS8wNC9hbmFseXN0LXByZWRpY3RzLXJhbGxpZXMtZm9yLWNoYWlubGluay1wb2xrYWRvdC1iaW5hbmNlLWNvaW4tYW5kLXR3by1hZGRpdGlvbmFsLWFsdGNvaW5zLWhlcmUtYXJlLWhpcy10YXJnZXRzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Analyst Predicts Rallies for Chainlink, Polkadot, Binance Coin and Two Additional Altcoins – Here Are His Targets - The Daily Hodl",
        "content": "Popular crypto analyst Michaël van de Poppe is predicting rallies for Chainlink (LINK), Polkadot (DOT), Binance Coin (BNB), Cosmos (ATOM) and SKALE (SKL).\n\nIn a new YouTube strategy session, Van de Poppe tells his 163,000 subscribers that Chainlink is likely to rally after the decentralized oracle network first dips by as much as 20%.\n\n“We’re probably going to see a case where things like Chainlink are going to bottom out around $4.50 to $5. It’s really close, I believe. And then we get a relief rally somewhere in 2023 taking place towards [about $17].”\n\nAt time of writing Chainlink is changing hands at $5.62.\n\nNext, he says Polkadot could surge by as much as 432% from its current value of $4.51 at time of writing.\n\n“I think that if we are in for a relief rally that one of those assets to add to the portfolio is definitely going to be Polkadot, given the fact that Polkadot is going to pretty much bring a rally towards the levels that we have here between $16 to $24.”\n\nVan de Poppe says Cosmos is already rallying and is likely to continue to surge.\n\n“We have had this retest at the high taking place. We’ve had a run to the highs and now we’re consolidating again. I think that once it cracks the high again [at $25.97] we’re going to have some sort of run-up taking place towards this block [up to about $35.00] as a relief rally just like we have been seeing in 2019 and 2020.”\n\nAt time of writing, Cosmos is changing hands at $10.10.\n\nHe next says that the native token of the crypto exchange Binance is finding support at its current price level. Looking at van de Poppe’s chart, he predicts BNB will surge to $400 by June.\n\n“We are into support level at $233, which makes me believe that if Bitcoin is not going to fall too much at this point, it’s not a bad case to have the biggest exchange in your portfolio given the simple case that it’s going to be a bigger winner even when the markets are going to turn around.”\n\nAt time of writing, BNB is valued at $245.71.\n\nLastly, he says SKALE will continue moving up if it breaks a key price level of $0.0250.\n\n“If it starts to break $0.025, it’s going to take out all these highs and start rallying quite fast towards [$0.200], which is, essentially, if you allocate it in a small portfolio, it could be an 8x to 12x during this year.”\n\nSKALE is changing hands at $0.0211 at time of writing.\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LnNjb3R0aXNoZGFpbHlleHByZXNzLmNvLnVrL25ld3Mvc2NvdHRpc2gtbmV3cy9zY290dGlzaC1yZWdpb25zLXNpdHRpbmctYWlyYm5iLWJvb20tMjg4NzQzNjDSAWtodHRwczovL3d3dy5zY290dGlzaGRhaWx5ZXhwcmVzcy5jby51ay9uZXdzL3Njb3R0aXNoLW5ld3Mvc2NvdHRpc2gtcmVnaW9ucy1zaXR0aW5nLWFpcmJuYi1ib29tLTI4ODc0MzYwLmFtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "The Scottish regions sitting on Airbnb boom with earnings of £500 a week - Scottish Daily Express",
        "content": "Something went wrong, please try again later.\n\nInvalid email Something went wrong, please try again later.\n\nGet the latest news from the Express straight to your inbox.\n\nSomething went wrong, please try again later.\n\nGet the latest news from the Express straight to your inbox.\n\nThe interest in taking up Airbnb is at an all-time high as people across the country look to let out their spare rooms to rake in some extra cash.\n\nAmidst a cost-of-living crisis, people are increasingly searching for alternative ways of generating income. For those with underutilised space in their homes or gardens, renting out a room for a short stay let can be a great way to make some additional cash.\n\nAnd luckily, according to new research Scots could be in for a pretty penny as it has been revealed you could be earning £349 per week on average by renting out a room in Scotland.\n\nREAD MORE: Scottish tourism faces £133m hit due to new SNP rules on AirBnB-type rentals\n\nThe study, by Crown Pavilions , also found that the Scottish Highlands was the county where you can expect to earn the most by renting out your room on Airbnb, with an average earning of £77 per night or £539 per week.\n\nThat is more than the average profit across the whole of the UK, which comes in at £340 per week.\n\nBut the Highlands wasn't the only region in Scotland where residents could be quids in. It was followed by Argyll and Bute (£73 per night) which would also rake in over £500 a week and East Lothian at (£69 per night), just under the mark at £483 per week which is still some considerably good income.\n\nSearches for “how to make money” and “passive income” have increased by 17% and 21% respectively compared to last year.\n\nThe research analysed Airbnb data in England, Scotland, Wales and Northern Ireland to determine the counties where you can earn the most. Meanwhile, Suffolk in England is the county where you can earn the most across the UK, with an average earning of £96 per night or £672 per week.\n\nHow to prepare your garden for an Airbnb rental\n\nFor those who do not have a spare room within their house, a garden room can be a great alternative for those looking to make some extra income with short-term stays.\n\nGarden rooms can be let out for short-term stays, providing that you have the appropriate planning permission and that your building adheres to regulations.\n\nThe top 10 counties in Scotland where you can earn the most Ranking County Average earning per night Average earning per week 1 Highlands £77 £539 2 Argyll and Bute £73 £511 3 East Lothian £69 £483 4 Shetland £66 £462 5 Angus £66 £462 6 Edinburgh city £64 £448 7 West Dunbartonshire £62 £434 8 Perth and Kinross £60 £420 9 Scottish Borders £60 £420 10 Orkney £57 £399\n\n“If you're planning on setting up your garden room for Airbnb rentals, there are a few steps you'll need to take to ensure that your space is ready for guests” explains Luke Dejahang, CEO & Co-founder of Crown Pavilions.\n\n“Having ensured that you have the right permissions, you'll then want to make sure that the room is clean and well-maintained. You should also consider adding amenities such as a shower, mini-fridge or TV to make your guests' stay more comfortable.\n\n“Additionally, be sure to provide detailed check-in instructions and make yourself available to answer any questions or address any concerns your guests may have. With a bit of preparation and attention to detail, your garden room can be a make a great short-stay rental.”\n\nYou can find more information and calculate how much you can earn from Airbnb in your area by visiting their online website here .\n\nREAD NEXT:\n\nFor more news, follow us on Facebook and Twitter but never miss the latest top headlines and sign up to our daily newsletter here."
    }
]