[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vZ3JhemlhZGFpbHkuY28udWsvbGlmZS90cmF2ZWwvYmVzdC1haXJibmJzLWluLXRoZS13b3JsZC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Feb 2023 08:00:00 GMT",
        "title": "The Best Airbnbs In The World To Immediately Add To Your Wishlist 2023 - Grazia",
        "content": "Gallery BOOK NOW: The Best Airbnbs In The World\n\nTake a deep breath and savour what the wilderness has to offer with this gorgeous villa in Joshua Tree, California. Perfect for four guests, this homestay has a pool and all the luxuries and amenities to offer while relaxing in the peaceful desert landscape.\n\nGuest review: 'We thoroughly enjoyed our stay at Aviv and Moses’s beautiful home. The home was beautifully designed and had fantastic views of Joshua Tree and the surrounding landscape. Aviv and Moses were communicative and helpful. We’d love to stay at their property again.'"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vZ3JhemlhZGFpbHkuY28udWsvbGlmZS90cmF2ZWwvYmVzdC1haXJibmJzLWluLXRoZS13b3JsZC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Feb 2023 08:00:00 GMT",
        "title": "The Best Airbnbs In The World To Immediately Add To Your Wishlist 2023 - Grazia",
        "content": "Gallery BOOK NOW: The Best Airbnbs In The World\n\nTake a deep breath and savour what the wilderness has to offer with this gorgeous villa in Joshua Tree, California. Perfect for four guests, this homestay has a pool and all the luxuries and amenities to offer while relaxing in the peaceful desert landscape.\n\nGuest review: 'We thoroughly enjoyed our stay at Aviv and Moses’s beautiful home. The home was beautifully designed and had fantastic views of Joshua Tree and the surrounding landscape. Aviv and Moses were communicative and helpful. We’d love to stay at their property again.'"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL3RoZXZyc29sZGllci5jb20vYmluYW5jZS1jb2luLXByaWNlLWFuYWx5c2lzLXByZWRpY3Rpb24tZmViLTZ0aC1ibmItc29hcnMtdG8tNy1tb250aC1oaWdoLWFtaWQtZnJlc2gtaW5jcmVhc2UtZ2FpbnMtOS1pbi1hLXdlZWsv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Feb 2023 08:00:00 GMT",
        "title": "Binance Coin Price Analysis & Prediction (Feb 6th) – BNB Soars to 7-Month High Amid Fresh Increase, Gains 9% in a ... - The VR Soldier",
        "content": "Binance Coin initiated another buy this week and continued to rise steadily toward the upper boundary of the channel. It now trades near a crucial resistance level with low pressure.\n\nFrom $220, the price went up by about 50% in five weeks to reach a new milestone. After facing several hurdles in the past weeks, it conquered the $318 resistance easily and added a few chunks of dollars to mark a 7-month high at $335 yesterday.\n\nBNB appears to be more volatile this week as the bulls continue to have the upper hand. The quest to tap more highs could rally the price at the channel’s resistance in the coming days.\n\nIf a retracement fails to occur around that resistance, a break above it will validate a continuation of the trend. Meanwhile, the $300 mark level, which posed threat to the bulls in the past month now acts as weekly support.\n\nApart from that, the past weeks of gains have made the bears struggle for dominance. They will continue to suffer in the race as long as the bulls keep reiterating actions by the day.\n\nIt is priced at $332 and remains the fourth best-performing crypto, with a market cap of $52.4 billion at the time of writing.\n\nBNB Key Level To Watch\n\nWhile the price is currently up by 9% in a week, it could still add some gains before the close of the week. It is still facing resistance at $337.5. A push above that price could send the crypto to $346 and $360, which lies around the channel’s resistance. There’s also resistance at $370.\n\nIf BNB looks for support, the first level to consider is the recent break level of $318.4 before we can think of the weekly support level mentioned above. Below this level lies the $284.4 support. More lows should be expected if the price dips further.\n\nKey Resistance Levels: $337.5, $346, $360\n\nKey Support Levels: $318.4, $300, $284.4\n\nSpot Price: $332\n\nTrend: Bullish\n\nVolatility: High\n\nDisclosure: This is not trading or investment advice. Always do your research before buying any cryptocurrency or investing in any projects.\n\nImage Source: igorigorevich/123RF // Image Effects by Colorcinch"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3QvY3otZG8tdGhpcy1hbmQtZWFybi1hbi1hdXRvbWF0aWMtYmxhY2tsaXN0LWZyb20tYmluYW5jZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Feb 2023 16:14:03 GMT",
        "title": "CZ: Do This and Earn an 'Automatic Blacklist' From Binance - BSC NEWS",
        "content": "BNB\n\nBinance CEO Changpeng Zhao (CZ) said if you see a project rep doing this, it is an assurance they will Never get listed on Binance.\n\nOne Strike and You’re Out\n\nLast month, Binance CEO Changpeng Zhao (CZ) gave his top tips on how to get tokens listed on his Centralized Exchange (CEX). Now, CZ has warned users against doing one thing that will get them an “automatic blacklist” from Binance.\n\nWhat is this unforgivable sin? Sharing a photo taken with CZ and claiming it’s an assurance that Binance will list your project’s token.\n\nFor all those that took selfies with me at SRT (Chatham House Rule) or anywhere, you are free to share them.\n\n\n\nJust don't use it to say \"hey see I am close with CZ and our project will list on #Binance.\" That's an automatic blacklist on our side.\n\n\n\nHappy posting. — CZ 🔶 Binance (@cz_binance) February 5, 2023\n\n“SRT” refers to a recent invitation-only crypto event held in Dubai. The Chatham House Rule is: When a meeting, or part thereof, is held under the Chatham House Rule, participants are free to use the information received, but neither the identity nor the affiliation of the speaker(s), nor that of any other participant, may be revealed.”\n\nIn response to a Twitter user’s comment, CZ further expounded that anyone who claims they will list on Binance before they are listed gets an automatic ban.\n\nAnyone saying \"they will list on Binance\" before they are listed is an automatic blacklist. It causes all kinds of problems.\n\n\n\nWe strictly forbid that. So, please report it. — CZ 🔶 Binance (@cz_binance) February 5, 2023\n\nCheck out our recent BSC News post giving 6 facts about Binance CEO CZ.\n\nWhat is Binance:\n\nBinance positions itself as the world’s leading blockchain ecosystem and crypto-asset infrastructure provider with a financial product suite that includes the largest digital asset exchange by volume. The Binance platform aims to increase the freedom of money for users and features a comprehensive portfolio of crypto-asset products and offerings, including trading and finance, education, data and research, social good, investment and incubation, decentralization, and infrastructure solutions.\n\nWhere to find Binance:"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3Qvd2hvLWlzLWN6LXNpeC1mYWN0cy1hYm91dC1iaW5hbmNlcy1jZW8tYW5kLWNvZm91bmRlctIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Feb 2023 00:39:03 GMT",
        "title": "Who is CZ? Six Facts about Binance's CEO and CoFounder - BSC NEWS",
        "content": "BNB\n\nHere we learn about some fun and personal facts about the face of the world's largest crypto exchange.\n\nSix Facts about CZ Binance\n\nBinance is the largest cryptocurrency company by several metrics. Whether it is daily trading volume or active users, Binance runs away with many important verticles. Add the success of BNB Chain as the most active and second most voluminous blockchain, and the ecosystem of Binance proliferates stronger than any across the crypto industry.\n\nThat makes CEO and CoFounder, Changpeng Zhao, affectionately known as CZ, one of the most influential figures in the space. Following the crash of Sam Bankman-Fried’s FTX empire, there is a strong case to make that CZ is the most influential figure in all of the crypto space.\n\nBut who is this influential figure? Here we will take a look at six quick and easy facts to know more about CZ, the man. Let’s dive in!\n\nCZ out on the slopes! | Source\n\nSix Facts about CZ Binance:\n\n1. CZ was born in Jiangsu, China, and grew up in Vancouver, Canada.\n\n2. Before founding Binance, CZ worked in finance and tech. He also co-founded other companies like Fusion Systems and OKCoin.\n\n3. CZ admits to having an unorganized workspace. He keeps his room, desk, and/or suitcase a mess.\n\n4. CZ has become a billionaire through Binance and is one of the richest icons in crypto. Despite his meteoric rise, he plans to donate up to 99% of his wealth.\n\n5. CZ does not watch sports or movies. He also admits to not liking social media despite spending considerable time on Twitter.\n\n6. CZ lists Fallen Dragon by Peter Hamilton as his favorite science fiction novel and one of his all-time favorite books.\n\nWhat is Binance:\n\nBinance positions itself as the world’s leading blockchain ecosystem and crypto-asset infrastructure provider with a financial product suite that includes the largest digital asset exchange by volume. The Binance platform aims to increase the freedom of money for users and features a comprehensive portfolio of crypto-asset products and offerings, including trading and finance, education, data and research, social good, investment and incubation, decentralization, and infrastructure solutions.\n\nWhere to find Binance:"
    }
]