[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMilAFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2NyeXB0by90b2tlbi9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1zbGlwcy1iZWxvdy0yOGstZXRoZXJldW0taG9sZHMtMTgwMC1wb2xrYWRvdC1ibmItZG93bi0zLTM3OTYzMi0yMDIzLTA1LTAy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 May 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin slips below $28k; Ethereum holds $1800; Polkadot & BNB down 3% - Business Today",
        "content": "Bitcoin and top crypto tokens were trading lower during the early trading hours in Asia. The digital asset market extended its cuts after the weekend selling pressure amid the thin trading volumes. Investors across the globe are awaiting the US Fed's monetary policy outcome later this week.\n\n\n\nBitcoin dropped another 2 per cent in the last 24 hours as the largest crypto token was trading below the $28,000 mark. Its largest peer Ethereum was also down but not much beaten. The second largest crypto asset dropped more than a per cent but remained about $1,800.\n\n\n\nBitcoin started the fresh week by trading in the red, as investors gear up for a crucial week of US economic events. Currently, Bitcoin is trading at the $28,000 mark, down from the weekend high of $29,900. In contrast, Ethereum remained stable at the $1,800 level, said Edul Patel, CEO and Co-Founder of Mudrex.\n\n\n\n\"Market participants are closely monitoring the Federal Reserve's interest rate hikes, which are expected to be announced on Wednesday, as well as the non-farm payroll data for April, which will be released on Friday. We might see some volatility in the market this week,\" he said.\n\n\n\nAll the top crypto tokens were trading lower on Tuesday. However, the fall in the altcoins was not very steep following the recent correction. Polkadot and BNB plunged about 3 per cent, each, followed by Polygon, Avalanche, and Shiba Inu dropped over 2 per cent, each.\n\nThe global cryptocurrency market cap was trading quite lower, falling near the $1.16 trillion mark as it jumped almost 2 per cent in the last 24 hours. However, the total trading volumes tanked about 2 per cent to $36.28 billion.\n\nCrypto markets came under selling pressure in the last 24 hours. Crypto fear and greed index stands at 55, down from 63 points yesterday, hinting towards shaky but still bullish investor sentiments, said Parth Chaturvedi, Crypto Ecosystem Lead at CoinSwitch. \"This week, investors will be closely following the developments from the Feds around interest rates.\"\n\n\n\n\"Bitcoin's market-cap dominance seems to be on the rise again, reaching June 2020 levels, even though liquidity continues to be a challenge. The US Banking system came under further stress as JP Morgan acquired First Republic Bank. Meanwhile, the BTC network continued to work like clockwork and set a new record for the number of daily transactions processed,\" he said.\n\n\n\nNote: Price change in last 24 hours\n\n\n\n\n\nTech View by WazirX Trade Desk\n\nChiliz(CHZ) is the leading digital currency for sports and entertainment by a Malta-based FinTech provider. Their platform, Socios, operates on blockchain technology and allows users to engage in the management of their preferred sports brands.\n\n\n\n\n\nSocios.com features various fan tokens that serve as an instance of this service. By using fan tokens, sports clubs and associations can connect with their fans and access novel revenue streams.\n\n\n\nOn the weekly time frame, CHZ can be seen traversing within a triangle pattern, trading close to the support levels. However, we could expect a bounce back from the lower trendline in the coming days. The next resistance is expected at $0.15 and immediate support is expected at the $0.10 level.\n\n\n\n\n\n(Views and recommendations given in this section are the analysts' own and do not represent those of Business Today. Please consult your financial adviser before taking any position in the asset/s mentioned.)"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vMjgwbGl2aW5nLmNvbS9idXNpbmVzc2VzL3JlYWx0b3ItcGxhbnMtNC1zdG9yeS1iZWQtYW5kLWJyZWFrZmFzdC1uZWFyLWhvb3Zlci1tZXQv0gFhaHR0cHM6Ly8yODBsaXZpbmcuY29tL2FwaS9hbXAvYnVzaW5lc3Nlcy9yZWFsdG9yLXBsYW5zLTQtc3RvcnktYmVkLWFuZC1icmVha2Zhc3QtbmVhci1ob292ZXItbWV0Lw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 May 2023 07:00:00 GMT",
        "title": "Realtor plans 4-story bed and breakfast near Hoover Met - 280 Living",
        "content": "× Expand Rendering courtesy of Tres31. This building design by Tres31 is the type of design that HBH Realty would like to use for a proposed four-story bed and breakfast in Hoover.\n\nA Hoover Realtor is pursuing plans to build a four-story bed and breakfast facility near the Hoover Metropolitan Complex.\n\nJordan Masaeid-Hosey’s company, HBH Realty, has purchased a 2.4-acre piece of property at the corner of Stadium Trace Parkway and Mineral Trace, across from Brock’s Gap Brewing Co., and wants to build a bed and breakfast with 18 suites, each able to accommodate 6-10 people, she said.\n\nThe lodging facility also would have a spa and breakfast/brunch café on the ground floor and rooftop bar and pool, Masaeid-Hosey said.\n\nBecause the Hoover City Council in February decided to mostly ban short-term rental properties in residential neighborhoods, Masaeid-Hosey is trying to provide an Airbnb-like experience in an area zoned for light industrial use near the Hoover Met.\n\nThere is a strong demand for short-term rental properties in Hoover, especially among people coming to take part in the many sports tournaments at the Hoover Met Complex, she said.\n\nMost of the people who come to those events don’t come alone, Masaeid-Hosey said. They come in groups that like to stay together, she said.\n\nHotels work for some groups, but others like to have a lodging experience that allows them to stay and hang out together instead of being broken up into separate hotel rooms, Masaeid-Hosey said. Short-term rentals of single-family homes gave people that option, but now that is no longer available, she said.\n\nMasaeid-Hosey, who has a short-term rental business called GameOn BnB, was left scrambling to find short-term rental properties where people could stay outside of the city because it’s no longer legal to do so in single-family neighborhoods in Hoover, unless for a special event and for less than seven days a year, she said.\n\nThat motivated her to move ahead with the bed and breakfast idea. She already was contemplating the idea near the Hoover Met but initially had put a lot of contingencies on her offer to buy the property, she said.\n\nAfter further evaluating the demand and possibilities for success, she later removed the contingencies and bought the property for $440,000, she said. “I know the area is ready for it.”\n\nSome residents in neighborhoods near the Hoover Met Complex in 2017 staunchly opposed commercial development near the Met, including the idea of a hotel. Opposition arose again in 2019 when the city hired a consultant to study the feasibility of a hotel on city property at the complex.\n\nMasaeid-Hosey said her proposal is much different than a hotel with 700 rooms. Her bed and breakfast would be much smaller and more quaint, she said. “It’s kind of like a hotel and Airbnb hybrid,” she said.\n\nPlus, “this is not an entry-level property,” Masaeid-Hosey said. “This is an extremely upscale, luxury, high-end-looking property. We plan on creating an experience like Hoover has never seen before that is going to be an asset to the community. It’s very elegant. It’s very sexy. It’s very sleek.”\n\nRental rates likely would start at $500 per night, she said.\n\nMasaeid-Hosey, who lives not far away in Blackridge, said she already has talked to some people in neighborhoods near the Met who are excited about what she wants to build and supportive of the idea. “People are really looking forward to it,” she said.\n\nShe immigrated to the United States from Jordan in 1999 as a child and graduated from Hoover High School. She’s not some out-of-state real estate person who doesn’t know anything about what the people of Hoover want, she said. “I know what my community wants. I know what my neighbors want.”\n\nThe four-story bed and breakfast likely will cost more than $10 million to build, Masaeid-Hosey said. She already has talked to several investors who are interested in fully funding it, but she would retain an ownership interest, she said.\n\nMasaeid-Hosey was able to get the Hoover City Council to amend its zoning ordinance to allow short-term rentals in light industrial zones, but she still must get conditional use approval from the Hoover Planning and Zoning Commission and Hoover City Council for this particular project.\n\nHBH Realty also is getting ready to open an eight-suite bed and breakfast in Helena called Buck Creek BnB in May."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vMjgwbGl2aW5nLmNvbS9idXNpbmVzc2VzL3JlYWx0b3ItcGxhbnMtNC1zdG9yeS1iZWQtYW5kLWJyZWFrZmFzdC1uZWFyLWhvb3Zlci1tZXQv0gFhaHR0cHM6Ly8yODBsaXZpbmcuY29tL2FwaS9hbXAvYnVzaW5lc3Nlcy9yZWFsdG9yLXBsYW5zLTQtc3RvcnktYmVkLWFuZC1icmVha2Zhc3QtbmVhci1ob292ZXItbWV0Lw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 May 2023 07:00:00 GMT",
        "title": "Realtor plans 4-story bed and breakfast near Hoover Met - 280 Living",
        "content": "× Expand Rendering courtesy of Tres31. This building design by Tres31 is the type of design that HBH Realty would like to use for a proposed four-story bed and breakfast in Hoover.\n\nA Hoover Realtor is pursuing plans to build a four-story bed and breakfast facility near the Hoover Metropolitan Complex.\n\nJordan Masaeid-Hosey’s company, HBH Realty, has purchased a 2.4-acre piece of property at the corner of Stadium Trace Parkway and Mineral Trace, across from Brock’s Gap Brewing Co., and wants to build a bed and breakfast with 18 suites, each able to accommodate 6-10 people, she said.\n\nThe lodging facility also would have a spa and breakfast/brunch café on the ground floor and rooftop bar and pool, Masaeid-Hosey said.\n\nBecause the Hoover City Council in February decided to mostly ban short-term rental properties in residential neighborhoods, Masaeid-Hosey is trying to provide an Airbnb-like experience in an area zoned for light industrial use near the Hoover Met.\n\nThere is a strong demand for short-term rental properties in Hoover, especially among people coming to take part in the many sports tournaments at the Hoover Met Complex, she said.\n\nMost of the people who come to those events don’t come alone, Masaeid-Hosey said. They come in groups that like to stay together, she said.\n\nHotels work for some groups, but others like to have a lodging experience that allows them to stay and hang out together instead of being broken up into separate hotel rooms, Masaeid-Hosey said. Short-term rentals of single-family homes gave people that option, but now that is no longer available, she said.\n\nMasaeid-Hosey, who has a short-term rental business called GameOn BnB, was left scrambling to find short-term rental properties where people could stay outside of the city because it’s no longer legal to do so in single-family neighborhoods in Hoover, unless for a special event and for less than seven days a year, she said.\n\nThat motivated her to move ahead with the bed and breakfast idea. She already was contemplating the idea near the Hoover Met but initially had put a lot of contingencies on her offer to buy the property, she said.\n\nAfter further evaluating the demand and possibilities for success, she later removed the contingencies and bought the property for $440,000, she said. “I know the area is ready for it.”\n\nSome residents in neighborhoods near the Hoover Met Complex in 2017 staunchly opposed commercial development near the Met, including the idea of a hotel. Opposition arose again in 2019 when the city hired a consultant to study the feasibility of a hotel on city property at the complex.\n\nMasaeid-Hosey said her proposal is much different than a hotel with 700 rooms. Her bed and breakfast would be much smaller and more quaint, she said. “It’s kind of like a hotel and Airbnb hybrid,” she said.\n\nPlus, “this is not an entry-level property,” Masaeid-Hosey said. “This is an extremely upscale, luxury, high-end-looking property. We plan on creating an experience like Hoover has never seen before that is going to be an asset to the community. It’s very elegant. It’s very sexy. It’s very sleek.”\n\nRental rates likely would start at $500 per night, she said.\n\nMasaeid-Hosey, who lives not far away in Blackridge, said she already has talked to some people in neighborhoods near the Met who are excited about what she wants to build and supportive of the idea. “People are really looking forward to it,” she said.\n\nShe immigrated to the United States from Jordan in 1999 as a child and graduated from Hoover High School. She’s not some out-of-state real estate person who doesn’t know anything about what the people of Hoover want, she said. “I know what my community wants. I know what my neighbors want.”\n\nThe four-story bed and breakfast likely will cost more than $10 million to build, Masaeid-Hosey said. She already has talked to several investors who are interested in fully funding it, but she would retain an ownership interest, she said.\n\nMasaeid-Hosey was able to get the Hoover City Council to amend its zoning ordinance to allow short-term rentals in light industrial zones, but she still must get conditional use approval from the Hoover Planning and Zoning Commission and Hoover City Council for this particular project.\n\nHBH Realty also is getting ready to open an eight-suite bed and breakfast in Helena called Buck Creek BnB in May."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL2Jsb2NrY2hhaW5yZXBvcnRlci5uZXQvc3VicXVlcnktbmV0d29yay1pbnRyb2R1Y2VzLWl0cy1iaWdnZXN0LXJlbGVhc2Utc2RrLXYyLTAtdG8tYWNjZWxlcmF0ZS1pdHMtZ3Jvd3RoLWFuZC1wZXJmb3JtYW5jZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 May 2023 07:00:00 GMT",
        "title": "SubQuery Network Introduces Its Biggest Release SDK V2.0 to Accelerate Its Growth and Performance - Blockchain Reporter",
        "content": "With the blockchain industry continuing to set milestones each day, one player is making significant strides in empowering developers and pushing the boundaries of what’s possible. SubQuery Network, a leading provider of decentralized data indexing and querying solutions, has announced the release of its much-anticipated Software Development Kit (SDK) V2.0. Dubbed their biggest release yet, SDK V2.0 promises to bring unprecedented performance enhancements and innovative new features that will onboard more users to the network.\n\nSubQuery Network Provides 2x Fast Performance With SDK V2.0\n\nRepresenting a major milestone for the leading Web3 data indexer, the v2.0 update introduces substantial performance enhancements and powerful new features aimed at streamlining the developer and user experience. Committed to excellence, SubQuery has focused on addressing key pain points and optimizing efficiency for customers across nine different chains.\n\nhttps://twitter.com/SubQueryNetwork/status/1653333899328487424?s=20\n\nSubQuery’s SDK v2.0 delivers impressive performance improvements that effectively double the indexing speed across all supported networks, including Polkadot, Ethereum, Polygon, BNB Smart Chain, Cosmos, Avalanche, NEAR, Algorand, and Flare. These enhancements ensure faster and more seamless data indexing for developers and users.\n\nAt the core of these improvements is the implementation of an advanced database cache. This new feature empowers even data-heavy SubQuery projects to experience a notable speed boost. By retaining more data in fast and efficient memory and saving it to the database through bulk operations, SubQuery has managed to enhance performance across the board significantly.\n\nMoreover, developers and users demand real-time access to data with minimal delays. Recognizing this need, SubQuery has devised an innovative solution to address this challenge. By indexing unfinalized or unconfirmed data directly from the RPC endpoint, SubQuery has managed to provide real-time access to the most probabilistic data before it is finalized or confirmed.\n\nSubQuery SDK2.0 Sets The Stage For Accelerated Development\n\nSubQuery SDK 2.0 introduces a groundbreaking testing framework that simplifies the process of testing mapping handlers and validating indexed data in an automated fashion. This innovative feature ensures data processing logic works as intended and helps detect errors early in the development process. Detailed summaries of failed tests enable developers to promptly identify and resolve issues, enhancing the quality and reliability of their SubQuery projects.\n\nThe testing framework has been seamlessly integrated into all starter projects, making it easy to set up and use for new initiatives.\n\nTo boost speed and reliability and reduce the load on RPC providers, SubQuery 2.0 now supports indexing data from multiple RPC endpoints. This enhancement delivers numerous benefits to projects, such as increased speed through distributed and parallelized RPC calls among providers, improved reliability with automatic switching to alternative RPC providers in case of an outage, and reduced load on RPC providers, lowering the chance of rate limitations.\n\nSubQuery 2.0 also introduces intelligent and automatic optimization of request sizes to RPC endpoints, effectively reducing the risk of being rate-limited. This improvement addresses the issue of rate-limited indexers, which previously caused significant errors and inefficiencies. Additionally, SDK 2.0 brings substantial improvements to error logging. Instead of providing only basic error information during runtime errors, the new version offers much more detailed insights. This enhancement streamlines error diagnosis and accelerates the resolution process for production projects, ultimately speeding up development time.\n\nSubQuery SDK 2.0 marks a significant milestone in the evolution of web3 data indexing, delivering a wide range of innovative features that promise to revolutionize the development process for developers and users. By introducing a streamlined testing framework, support for multiple RPC endpoints, intelligent automatic API request sizing, and enhanced error logging, SubQuery has demonstrated its commitment to strengthening the Web3 ecosystem’s accessibility and efficiency. This latest release not only empowers developers to create faster, more reliable applications but also reinforces SubQuery’s position as a leading innovator in the rapidly growing blockchain space."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3LnR5Y29vbnN0b3J5LmNvbS9ibmItc3VjY2Vzcy1hY2FkZW15LXJldmlldy1hcmUtZnJhc2VyLWFuZC1hcnRodXItbGVnaXQv0gFXaHR0cHM6Ly93d3cudHljb29uc3RvcnkuY29tL2JuYi1zdWNjZXNzLWFjYWRlbXktcmV2aWV3LWFyZS1mcmFzZXItYW5kLWFydGh1ci1sZWdpdC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 May 2023 07:00:00 GMT",
        "title": "BNB Success Academy Review – Are Fraser and Arthur legit? - Tycoonstory Media",
        "content": "Fraser Mackie and Arthur Diulgerian, two experienced entrepreneurs from Victoria, BC, Canada, have teamed up to create the BNB Success Academy.\n\nThis program is designed to help individuals learn the ins and outs of starting and running a profitable Airbnb business. With more than 87 successful properties under their belt, Mackie and Diulgerian have accumulated a wealth of knowledge and experience, and they are eager to share it with others who are looking to enter the short-term rental market.\n\nBNB Success Academy – What to expect?\n\nAdditionally, the program requires no prior experience or a specific credit score, making it accessible to anyone who is willing to learn.\n\nWhat does it teach?\n\nThe BNB Success Academy covers all aspects of Airbnb hosting, including setting up a listing, pricing strategies, guest communication, cleaning and maintenance, and legal and tax considerations. The program also provides templates and scripts for various aspects of hosting, such as responding to inquiries and dealing with guest issues. Students have lifetime access to the program and can go through the modules at their own pace.\n\nThe BNB Academy Facebook Group:\n\nAnother benefit of the BNB Success Academy is the community of other Airbnb hosts who can offer advice and support. Students can join a Facebook group where they can connect with other entrepreneurs, ask questions, and share ideas.\n\nThe BNB Success Academy is also highly praised for its outstanding customer service and student support. The program is designed to be flexible and customizable, allowing students to tailor their learning experience to their individual needs and goals.\n\nIs BNB Success Academy Legit?\n\nThis is a legit training program, but success with Airbnb or any passive income stream is not guaranteed. The short-term rental market is highly competitive, and it will take effort and dedication to succeed. The BNB Success Academy provides students with the tools and resources they need to build a profitable Airbnb business, but it’s up to them to put in the work.\n\nThe Short-Term Rental Industry\n\nWhile Airbnb is the most well-known platform for short-term rentals, it’s not the only player in the market. Other platforms, such as HomeAway, VRBO, and Booking.com, offer similar services and target different audiences. The techniques or strategies that you learn from BNB Academy can also be applied to any of these platforms. It’s essential to research and compare these platforms to determine which one is the best fit for your hosting goals.\n\nAirbnb’s large and active community of users is one of its main advantages. However, the platform has faced criticism and regulatory challenges in some cities and countries, which could impact your ability to host and your legal obligations. Other platforms might have different regulations or requirements, so it’s crucial to do your research and understand the local laws and regulations before starting your hosting business.\n\nHow to compete with other AirBNB hosts?\n\nOne of the most significant challenges within the Airbnb platform is the competition among hosts. With so many listings available, it can be challenging to stand out and attract guests. This is where BNB Success Academy can help. Pricing, location, and amenities are some of the key factors that can influence your success as an Airbnb host and the training will show how you can make the most of these factors. It’s essential to analyze your local market and your competitors to determine your niche and your unique selling points.\n\nBenefits of Signing Up for the BNB Success Academy Program\n\nIf you’re considering signing up for the BNB Success Academy program, there are several benefits that you can expect to gain:\n\nLearn from Industry Experts:\n\nFraser Mackie and Arthur Diulgerian have accumulated a wealth of knowledge and experience in the short-term rental market. By learning from them, you can gain insights into what it takes to succeed as an Airbnb host.\n\nComprehensive Training:\n\nThe BNB Success Academy program covers all aspects of Airbnb hosting, from setting up your listing to marketing your property and providing excellent guest experiences. You’ll learn about pricing strategies, guest communication, cleaning and maintenance, and legal and tax considerations.\n\nPractical Tools and Resources:\n\nThe program provides you with templates and scripts for various aspects of hosting, such as responding to inquiries, setting house rules, and dealing with guest issues. You’ll also have access to a community of other Airbnb hosts who can offer advice and support.\n\nSelf-Paced Learning:\n\nThe program is designed to be self-paced, so you can go through the modules at your own speed. You’ll also have lifetime access to the program, so you can revisit the content and updates whenever you need to.\n\nFlexibility:\n\nThe program is extremely flexible and can be customized to your individual needs and goals. You can tailor your learning experience to focus on the areas that are most relevant to your hosting business.\n\nExcellent Customer Service:\n\nThe customer service and student support are excellent. You can expect to receive prompt and helpful responses to any questions or concerns you may have.\n\nNetworking Opportunities:\n\nBy joining the BNB Success Academy, you’ll have the opportunity to connect with other Airbnb hosts who are also learning from the program. This can help you build a network of contacts and potentially form partnerships or collaborations.\n\nIn conclusion, if you’re serious about starting an Airbnb business and are willing to put in the time and effort to make it successful, the BNB Success Academy program could be a valuable asset."
    }
]