[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vbGFtYmdvYXQuY29tL25ld3MvMzgwMDgvcGFpbi1vZi10cnV0aC1hbmQtZGVhdGgtdGhyZWF0LXRvLWhlYWRsaW5lLWJuYi1ib3dsLTIwMjMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 Feb 2023 08:00:00 GMT",
        "title": "Pain Of Truth and Death Threat to headline BNB Bowl 2023 - Lambgoat",
        "content": "Black N' Blue Productions announced the BNB Bowl 2023 which takes place in Brooklyn, NY at the Monarch over the weekend of May 12 and 13.\n\nTickets for the event are available here.\n\nThe weekend line up is as follows:\n\nMay 12:\n\nPain Of Truth\n\nBulldoze\n\nMerauder (feat. Minus Rodriguez)\n\nAll Out War\n\nDivision Of Mind\n\nCombust\n\nSector\n\nRhythm Of Fear\n\nRisk\n\nWrong Move\n\nMissing Link\n\nCounttime\n\nStrangle You\n\nMay 13:\n\nDeath Threat (25th anniversary original lineup)\n\nBracewar\n\nNaysayer\n\nRestraining Order\n\nYear Of The Knife\n\nEnd It\n\nLife's Question\n\nFool's Game\n\nMH Chaos\n\nHold My Own\n\nDieja\n\nMutually Assured Destruction\n\nNever Again"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vbGFtYmdvYXQuY29tL25ld3MvMzgwMDgvcGFpbi1vZi10cnV0aC1hbmQtZGVhdGgtdGhyZWF0LXRvLWhlYWRsaW5lLWJuYi1ib3dsLTIwMjMvY29tbWVudHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 Feb 2023 08:00:00 GMT",
        "title": "Pain Of Truth and Death Threat to headline BNB Bowl 2023 | Comments - Lambgoat",
        "content": "Black N' Blue Productions announced the BNB Bowl 2023 which takes place in Brooklyn, NY at the Monarch over the weekend of May 12 and 13.\n\nTickets for the event are available here.\n\nThe weekend line up is as follows:\n\nMay 12:\n\nPain Of Truth\n\nBulldoze\n\nMerauder (feat. Minus Rodriguez)\n\nAll Out War\n\nDivision Of Mind\n\nCombust\n\nSector\n\nRhythm Of Fear\n\nRisk\n\nWrong Move\n\nMissing Link\n\nCounttime\n\nStrangle You\n\nMay 13:\n\nDeath Threat (25th anniversary original lineup)\n\nBracewar\n\nNaysayer\n\nRestraining Order\n\nYear Of The Knife\n\nEnd It\n\nLife's Question\n\nFool's Game\n\nMH Chaos\n\nHold My Own\n\nDieja\n\nMutually Assured Destruction\n\nNever Again"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vd3d3LmJsb2d0by5jb20vdHJhdmVsLzIwMjMvMDIvaGlnaGFjcmUtYm5iLW9udGFyaW8v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 Feb 2023 08:00:00 GMT",
        "title": "This new boutique hotel in Ontario has a personal spa in every suite - blogTO",
        "content": "The HighAcre is a new luxury boutique bed and breakfast which has everything you need to feel relaxed and pampered - without ever having to leave your room.\n\nLocated an hour away from Toronto in Dundas, The HighAcre takes r&r to the next level. The suites each have their own personal spa, including an infrared sauna, hammam steam room with aromatherapy, deep soaker tub, and fireplace.\n\n\"At the HighAcre we stack and include all of the best holistic health experiences so that your time here is transformational,\" the website reads.\n\nYou can experience the benefits of contrast bath therapy by alternating from hot to cold within your room. Each suite is stocked with ice to turn the bath into a cold plunge, or you can cool off under the steam room's rain shower after a session in the infrared sauna.\n\nThe HighAcre was originally a farm house built in 1867. The owners wanted to restore and modernize the property, while still maintaining its unique heritage and original charm.\n\nThe four suites pay homage to their farm house roots, with a blend of modern and rustic accents like their heart pine wood floors and ornate French doors. You'll feel like royalty in the bath overlooking the gardens next to the double-sided fireplace.\n\nIn the common area, The HighAcre also has a shared yoga studio, juice bar and lounge area, as well as an outdoor hot tub and pool (during the summer months). Talk about health and wellness!\n\nNearby, you'll be close to countless trails to escape into nature. With the city of waterfalls in your backyard, head to Dundas Peak for bird's eye views of Hamilton and to see Webster's Falls frozen over in the winter months.\n\nLast but not least, breakfast is also included in your stay. The offerings include a tasty spread of fresh croissants, farm fresh eggs, butter, jam, all the cooking supplies you need, and of course, coffee.\n\nThe HighAcre is now accepting reservations on their website. A one-night stay is a bit of a splurge starting around $450/night, but it looks like the ultimate retreat for some much-needed relaxation."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9jcnlwdG9jdXJyZW5jaWVzL25ld3MvaGVyZXMtd2hhdC10aGUtbmV3LWRvZ2Vjb2luLWZvcmstbWVhbnMtZm9yLWRvZ2UtaG9kbGVycy0yMDIzMDIwNTA2MTTSAXdodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy9oZXJlcy13aGF0LXRoZS1uZXctZG9nZWNvaW4tZm9yay1tZWFucy1mb3ItZG9nZS1ob2RsZXJzLTIwMjMwMjA1MDYxNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 Feb 2023 08:00:00 GMT",
        "title": "Here's what the new Dogecoin fork means for DOGE hodlers - FXStreet",
        "content": "EthereumFair, the world’s first Ethereum fork, discussed a Dogecoin fork with the DOGE community, proposing a new mining algorithm.\n\nDogecoin consensus mechanism will remain unchanged, proof-of-work and the mining algorithm will be changed to use Ethereum graphics card mining.\n\nDogecoin now ranks among the top 10 tokens by trade volume for the 100 largest whales on the Binance Smart Chain.\n\nEthereumFair, the project that brands itself as the world’s first Ethereum fork, is in talks with the Dogecoin community for a fork. The team proposes retaining DOGE’s consensus algorithm and changing the mining algorithm to make it compatible with Ethereum graphics card mining.\n\nDOGE ranks among the top traded tokens by Binance Smart Chain whales. These developments could act as bullish catalysts for Dogecoin.\n\nAlso read: Ethereum devs finalize fork on the Zheijang testnet; here’s what this means for ETH\n\nEthereum’s first fork discusses Dogecoin fork, proposes new mining algorithm\n\nEthereumFair is a fork chain led by a group of technologists that insists on maintaining ETH’s Proof-of-Work consensus mechanism. This group established a new hub for ETH miners and ecological projects while providing them with security and 100% decentralization.\n\nToday, we have discussed the dogecoin fork with the #dogecoin community. The #ETHF technical community will help #Dogecoin fork. — EthereumFair($ETHF) #PeoplePOW (@EthereumFair) February 4, 2023\n\nThe EthereumFair team discussed the fork and offered technical help to the Dogecoin community. A Decentralized Autonomous Organization (DAO) will be established where technologists, communities, project parties, exchanges, and miners are welcome to participate actively.\n\nThis is a worldwide linkage and a major reshuffle of liquidity. Dogecoin retains its Proof-of-Work consensus mechanism, and the mining algorithm will be separated from Wright to use the Ethereum graphics card mining machine.\n\nA larger consensus group will be generated; Dogecoin will be compatible with the Ethereum Virtual Machine (EVM), a trend, and the DAO will ensure the decentralization of the project.\n\nThe team announced that the Dogecoin fork will still retain the 1:1 ledger, but there will be some detailed adjustments from the Bitcoin series algorithm to the Ethereum series algorithm.\n\nDogecoin popularity takes off: Top traded token by Binance Smart Chain whales\n\nDogecoin ranks in the top 10 tokens by trade volume for the hundred largest wallet investors on the Binance Smart Chain. The meme coin ranks among favorites for BSC whales and enjoys high trade volume from whale activity.\n\nJUST IN: $DOGE @dogecoin is back in top 10 by trading volume among 100 biggest #BSC whales in the last 24hrs\n\n\n\nCheck the top 100 whales here: https://t.co/0SYnjw0xQs\n\n\n\n(and hodl $BBW to see data for the top 4000!)#DOGE #whalestats #babywhale #BBW pic.twitter.com/xkYwMnUh1n — WhaleStats - the top 1000 BSC rich list (@WhaleStatsBSC) February 4, 2023\n\nThe news of the fork that retains DOGE’s consensus mechanism and its popularity among whales could act as bullish catalysts for the meme coin. While competitor Shiba Inu bucks the large crypto market downtrend and yields double-digit gains, Dogecoin is gearing up to make a comeback with interest from whales and the Ethereum fork’s community."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3LmNyeXB0b2dsb2JlLmNvbS9sYXRlc3QvMjAyMy8wMi9ob3ctdG8tYnV5LWJuYi1vbi1tZXRhbWFzay_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 Feb 2023 08:00:00 GMT",
        "title": "How to Buy BNB on MetaMask | Cryptoglobe - CryptoGlobe",
        "content": "Binance Coin (BNB) is a cryptocurrency made by the popular cryptocurrency exchange Binance. What many cryptocurrency investors don’t know is that it’s possible to buy BNB on MetaMask, and interact with decentralized applications on the BNB Chain using the wallet.\n\nBNB uses its own set of technical standards: BEP-2, which is the original token for the Binance Chain, and BEP-20, specifically made for the decentralized BNB Chain (formerly Binance Smart Chain (BSC).\n\nMetaMask, on the other hand, is one of the world’s most popular cryptocurrency wallets, designed for storing cryptocurrency coins, tokens, and NFTs, and also GameFi assets. It also allows users to access and explore dApps (decentralized applications) co-existing in the Web3 world.\n\nMost people, however, associate MetaMask with Ethereum and forget about the wallet’s support for the BNB Chain, and that you can buy BNB with MetaMask.\n\nHow to Buy BNB Using MetaMask\n\nThe first step is to have MetaMask installed. It can be used on your desktop or on your mobile device. You can download it by visiting MetaMask’s official website or through the Chrome Web Store. Be careful with the download, as there are often forgeries out there trying to trick users. Only download from the official sources.\n\nHere are the steps to follow once downloaded:\n\nRun MetaMask and click on Create Wallet.\n\nThe app will provide you with a seed phrase, which works like a password that will give you access to your account, so you must store it somewhere safely (preferably off the internet).\n\nBy default, MetaMask is set to the Ethereum blockchain. To change it, go to settings, and select the BNB network.\n\nClick on Approve to add the network, and you’re ready to go.\n\nOnce your MetaMask wallet is set accordingly, you can explore the dApps on the BNB ecosystem. But you need the BNB first to make purchases and pay for gas fees.\n\nTo buy BNB directly from MetaMask, you’ll have to use the third parties provided. In this case, we can use Transak, which supports credit/debit cards, bank transfers in 100+ countries, Apple Pay and MobiKwik. The second option is to use MoonPay, which supports credit/debit cards, Samsung Pay, and supports bank transfers in over 145 countries.\n\nLet’s use Transak as an example. You’ll be redirected to a new page in which you’ll have to enter the amount of money to deposit and the payment method. Finally, check the fees, and click on Buy Now, and proceed with your payment method. Once done, the BNB will be deposited directly into your MetaMask wallet.\n\nOther Ways to Transfer BNB to MetaMask\n\nUnfortunately, Binance isn’t available in all jurisdictions worldwide. In the U.S. alone, there are a handful of states including Texas, Vermont, New York, and others in which Binance doesn’t operate due to regulatory hurdles.\n\nHowever, we can use a different crypto exchange like Coinbase to buy BNB and other cryptocurrencies using credit cards, crypto transactions, PayPal, and other methods. The next step would be to transfer your BNB funds to your MetaMask wallet.\n\nAlso read: How to Transfer From Coinbase to MetaMask\n\nTo do so, go to your MetaMask wallet and copy the BNB address corresponding to your account. Paste the address into the exchange from which you are sending and click Send.\n\nClosing Thoughts\n\nAs you can see, it’s fairly easy to buy BNB directly from MetaMask. If your current location is not supported by Binance, there’s a workaround you can try by just using a different exchange and sending the funds to your BNB address from MetaMask. Overall, the steps are very simple:\n\nInstall MetaMask and set up BNB Chain as your default network in Settings\n\nClick on Deposit and choose the available third parties\n\nFill in the boxes and information needed to proceed with your purchase\n\nThe BNB funds will be deposited into your account\n\nRemember to keep your seed phrase stored somewhere safe, preferably offline, to avoid potential risks of hacks and other cyber-attacks.\n\nFrequently Asked Questions\n\nIs Binance Available Across the US?\n\nWhile Binance is one of the leading exchanges globally, it’s not available for all US residents. Binance US is the regulated branch of the exchange, but it comes with limited capabilities and features.\n\nWhat Happens if I Lose My Seed Phrase?\n\nA seed phrase is a string of words generated by a wallet, specifically made for you. Losing your seed phrase means losing access to your account, and, therefore, your funds. No one else has access to the phrase, meaning the funds will be unrecoverable.\n\nWhat is the Difference Between Binance Chain and BNB Chain?\n\nBinance Chain is Binance’s centralized network that processes transactions, such as trades, swaps, p2p lending, etc, while BNB Chain is a decentralized blockchain with an ecosystem where DeFi protocols and developers can launch their projects/dApps"
    }
]