[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vd3d3LmxpdmVtaW50LmNvbS9taW50LXRvcC1uZXdzbGV0dGVyL2NyeXB0b25vdGVzMDYwMTIwMjMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 06 Jan 2023 08:00:00 GMT",
        "title": "Crypto Notes: What is the Token Economics of BNB? - Mint",
        "content": "This post covers the token economics of BNB.\n\nToken economics (tokenomics) studies the design and implementation of blockchain-based tokens. Understanding token economics is crucial for anyone considering investing in or using a particular token.\n\nWhat is the Token Economics of BNB?"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LnlheWNvcmsuaWUvcGxhbi1hLXNsZWVwb3Zlci1pbi10aGlzLWRvZy1mcmllbmRseS1jb252ZXJ0ZWQtc2Nob29sLWJ1cy1uZWFyLWxvdWdoLWh5bmUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 06 Jan 2023 08:00:00 GMT",
        "title": "Plan a sleepover in this dog-friendly converted school bus near Lough Hyne - Yay Cork",
        "content": "All aboard!\n\nThese days you can find all sorts of Airbnbs around the country. From hobbit pods and treehouses to cosy seaside cabins and gorgeous mountain lodges, there are plenty of eccentric options to make your getaway an experience to remember.\n\nWest Cork entrepreneur Kevin Kiely decided to create one of his own by completely revamping the interior of a retired school bus to create a spacious AirBnB experience in his backyard.\n\n“The bus was a working school bus up until a year ago. [We] bought it in Kildare and drove it up to our house last February, and did it up over a few months,” said Kevin who had plenty of help putting it together.\n\n“It’s a bit mad and quirky, kinda 80s style. Myself and my buddy Jerry did most of the work ourselves and Doreen and my girls Amy Shauna and Jazz were all stuck in too.”\n\nAnd they’re not entirely finished yet: Kevin is hoping to add an outdoor wood-burning hot tub to the set-up for the summer.\n\nThe bus retains its original fittings, blended with modern features for a comfortable stay. It boasts its very own kitchenette, fireplace, living area and ensuite bathroom, which is accessed through the emergency exit door at the back of the bus beside the bedroom.\n\nIt even has its very own Pacman machine and flatscreen TV to keep you entertained throughout your stay.\n\nView this post on Instagram A post shared by D’School Bus 🚍 Baltimore/Lough Hyne (@dschoolbus)\n\nD’School Bus is located between Baltimore and Lough Hyne and sleeps two adults plus any furry friends you might want to bring on your adventure.\n\nFor a weekend to remember, head to Lough Hyne for a night time Kayaking Tour to see the lake’s plankton light up between April and December -the bus is located close to the lake.\n\nD’School Bus is available to book from Air BnB for €140 per night. Click here for dates and availability."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vdGVjaHBvaW50LmFmcmljYS8yMDIzLzAxLzA2L2FmdGVyLWZ0eC1leHBlcnRzLXByZWRpY3QtZG93bmZhbGwtb2YtdGhlLWJpbmFuY2UtY29pbnMtd2hpbGUtc25vd2ZhbGwtc3VyZ2VzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 06 Jan 2023 08:00:00 GMT",
        "title": "After FTX, Experts Predict Downfall of the Binance Coins While Snowfall Surges - Techpoint Africa",
        "content": "Enron was a giant too big to fail. FTX was a giant which was too big to fail. If history has taught us anything, it is important not to get entrapped in the “too big to fail” philosophy.\n\nIf a company does not have the right management, it can often fail most pathetically. Since the FTX Token (FTT) collapsed, investors have grown wary of tokens from other centralized exchanges, including Binance (BNB) and Cronos (CRO). On the other hand, investors are showing confidence in coins from dexes like Snowfall Protocol (SNW) which offer useful applications. Here is a lowdown on the situation.\n\nThe Fall of Exchange Tokens\n\nAfter the fall of FTX, FTX Token (FTT) naturally plummeted. FTX Token (FTT) was the native token of the exchange and was used for paying trading fees on the platform. The use of FTX Token (FTT) tokens also fetched FTX users discounts on fees and staking rewards. After FTX declared bankruptcy, FTX lost its primary value. This disaster with FTX Token (FTT) has created a void of trust among users, and other exchange tokens, especially the native coin Binance (BNB) offered.\n\nThe fears are not completely misplaced. After the FTX collapse, Binance also saw withdrawals of the order of $9 billion in 30 days. Many analysts believe Binance (BNB) is forming a bearish trend in its price charts, called a double-top pattern.\n\nThe outflows from Binance (BNB) are not just a result of the FTX bankruptcy and the ensuing panic. Binance does not have a central headquarter; its decentralized model makes tracing the owners difficult in the case of fraud. This also comes at a time when Binance has been pushing hard for its users to convert their USD and stablecoin deposits into the exchange’s native tokens.\n\nAnother important red flag is the current auditor of the company. Given the size of Binance, it should have an external auditor from a globally renowned consultancy. Instead, their auditors are from Mazars, South Africa. This further adds to the threat that the company will implode.\n\nThe Rise of New Tokens\n\nNew tokens like Snowfall Protocol (SNW) have proved to be an incredible investment for crypto users in the bear market. Unlike centralized exchange tokens, Snowfall Protocol (SNW) derives its value from its use case of interoperability. All crypto users face the hassle of transferring their crypto assets from one blockchain to another. So, the use case has universal applications.\n\nIt is also important to note that early investors have already realized impressive returns from Snowfall Protocol (SNW). It was introduced at a price of $0.005 during its presale and has already reached $0.1 in value in the stage 3 sale. It has raised over $3 million from its investors even before the launch date. Snowfall Protocol (SNW) will launch on January 3, 2023, when it is expected to grow its investors’ wealth by 5000%.\n\nThese are conservative estimates given the currency crypto market conditions. As market conditions improve, the return on investment in Snowfall Protocol (SNW) will also increase.\n\nPresale: https://presale.snowfallprotocol.io\n\nWebsite: https://snowfallprotocol.io\n\nTelegram: https://t.me/snowfallcoin\n\nTwitter: https://twitter.com/snowfallcoin"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmNuYmN0djE4LmNvbS9jcnlwdG9jdXJyZW5jeS9hbHBpbmUtZjEtdGVhbS1mYW4tdG9rZW4tZXZlcnl0aGluZy1uZWVkLXRvLWtub3ctMTU1OTM1ODEuaHRt0gFpaHR0cHM6Ly93d3cuY25iY3R2MTguY29tL2NyeXB0b2N1cnJlbmN5L2FscGluZS1mMS10ZWFtLWZhbi10b2tlbi1ldmVyeXRoaW5nLW5lZWQtdG8ta25vdy0xNTU5MzU4MS5odG0vYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 06 Jan 2023 08:00:00 GMT",
        "title": "Everything you need to know about the Alpine F1 team fan token - CNBCTV18",
        "content": "Fan tokens have become extremely popular over the last year or so. Several leading sports teams, including FC Barcelona, Manchester City FC, Arsenal FC, etc, have all launched their fan tokens in recent times. Most of these coins are supported by Chiliz, which is currently the leading fan token platform in the world.However, another player that has thrown its hat into the fan token arena is the BNB Chain. The blockchain network of the world’s largest crypto exchange has launched a handful of fan tokens in the last few months and is looking to offer some competition to Chiliz, which was so far unchallenged in this domain.The Alpine F1 Team Fan Token (ALPINE) is one of four fan tokens developed on BNB. And in the short while that it has been around, the token has managed to gain significant ground. It currently ranks second in terms of market capitalization amongst all fan tokens and looks poised to grab the number 1 spot as well.But what is the Alpine F1 Team Fan Token (ALPINE), how does it work and why should fans purchase it? Tag along to find out.Launched on February 15, 2022, the Alpine F1 Fan Token (ALPINE) is a BEP-20 token built on the BNB chain. It serves as the utility token of the Alpine F1 team and promises token holders an enriched fan experience. Those who purchase this token will have access to several new and exciting fan engagement activities.ALPINE is the first F1 fan token on the BNB chain and its third fan token overall. The first fan tokens developed on BNB were the S.S. Lazio Fan Token (LAZIO) and the FC Porto Fan Token (PORTO) which were launched in Oct and Nov 2021, respectively.In terms of tokenomics, ALPINE has a maximum supply of 40 million tokens, of which 10 percent were sold at the token’s launchpad event at $1 per ALPINE. To prevent whales from buying massive amounts of the token, BNB has also implemented a limit of 10,000 ALPINE per user.ALPINE holders are privy to several exclusive benefits and experiences. To begin with, they provide fans access to several voting sessions on the Binance Fan Token platform. These voting sessions allow token holders to influence a number of team decisions. For instance, token holders were recently allowed to vote on the simulator circuit used for training. In the past, they were also allowed to choose the Alpine Esports jersey for 2022 and the livery design for the car.Besides voting rights, token holders can also participate in several activities and win signed merchandise or access exclusive experiences, such as meet-and-greet sessions with the driver. Users can also stake their ALPINE and receive exclusive digital collectables and fan rewards. In the future, users will also be able to donate their tokens in exchange for loyalty badges.The Alpine F1 FAN Token (ALPINE) is the ideal way for enthusiasts to become more involved with the team. It creates a more rewarding fan experience and provides a new way for fans to support the racing team they love. Besides the fan-related aspect, ALPINE can also serve as an investment. The token has more than doubled in valuation from its launchpad event, trading at $2.13 at the time of writing. It also has a trading volume of over $5 million, which is up 154 percent over the last 24 hours."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vcHJvdG9zLmNvbS9iaW5hbmNlcy1zdGFibGVjb2luLWJ1c2QtaGFzbnQtYWx3YXlzLWJlZW4tMTEtYmFja2VkLXJlcG9ydC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 06 Jan 2023 08:00:00 GMT",
        "title": "Binance's stablecoin BUSD hasn't always been 1:1 backed, report - Protos",
        "content": "Listen to this article.\n\nBinance has previously undercollateralized its stablecoin, BUSD, on its own blockchain, according to on-chain data revealing that the wallet backing the BUSD bridged from Ethereum’s blockchain onto Binance’s blockchain did not consistently equal one dollar’s worth of assets for each Binance-pegged BUSD.\n\nInvestigative reporter Jonathan Reiter of Data Finnovation collaborated with Patrick Tan of Novum Alpha to initially publicize the shortfall. Reiter has published five scholarly articles and specializes in stablecoin research. Both firms are based in Singapore. Their joint analysis shows insufficient backing of BUSD trading on BNB Chain for several months.\n\nNot-so-stablecoin BUSD\n\nBUSD is the world’s third-largest stablecoin with a market capitalization exceeding $16 billion. Binance worked with blockchain infrastructure firm Paxos to promise 1:1 backing.\n\nHowever, Paxos only promises 1:1 backing of BUSD on Ethereum. For a while, the public assumed that BUSD on any blockchain was fully backed — especially Binance’s own blockchain. Eventually, Paxos disclaimed responsibility for non-Ethereum-based BUSD.\n\nAiming to distance itself from non-Ethereum-based BUSD, Paxos clarified, “Binance-Peg BUSD is strictly a Binance product; it is not issued by Paxos nor regulated by the New York State Department of Financial Services.”\n\nRepeatedly assuring the public about BUSD’s 1:1 backing and dollar peg is of paramount importance for Binance. Binance itself holds 25% of its assets — a staggering $13 billion — in BUSD. Incredibly, the company forcibly liquidated customer holdings of competitors’ stablecoins USDC, USDP, and TUSD in order to increase BUSD adoption last year.\n\nBinance claims that BUSD reserves are audited monthly in compliance with all relevant regulations. Paxos affirms that it holds assets to back all BUSD tokens on Ethereum with fiat currency and US Treasury bills in US banks. However, Paxos does not back BUSD on BNB Chain, which have occasionally been undercollateralized.\n\nOrange line represents Paxos-linked $BUSD on Ethereum intended to back the equivalent $BUSD circulating on Binance Smart Chain.\n\n\n\nGreen line is the $BUSD that was circulating on Binance Smart Chain that ought to have been backed by the equivalent on Ethereum. pic.twitter.com/LgXgZnYey6 — Patrick Tan (@patrick_novum) January 3, 2023 The green line should always have been lower than the orange line.\n\nBinance wanted you to believe\n\nSkepticism is understandable regarding so-called stablecoins, many of which have failed to maintain their stability. Many stablecoins have collapsed all the way to $0.\n\nFans of Binance believed BUSD was different. Binance wanted to differentiate its stablecoin from a long history of lies by other stablecoin issuers. It convinced the world that it would fully back all BUSD at all times, no matter what. It failed.\n\nOf course, many stablecoins maintain their peg for years — trading at $1 until the very end, then suddenly crashing to $0. Terra (UST) traded at $1 for over a year and a half. Then, within one month, it traded from $1 to below one penny and never recovered, losing $18 billion dollars in market capitalization.\n\nIn fairness, Binance seems to have resolved these past issues with BUSD. Despite months of historical shortfalls, it currently backs Binance-peg BUSD 1:1.\n\nConclusion\n\nBinance promised that BUSD was fully backed without precisely qualifying that its promise applied only to BUSD on Ethereum’s blockchain. Worse, many BNB Chain users believed that assets at Paxos ultimately backed all BUSD on a 1:1 basis. We now know that Binance-peg BUSD was not always backed.\n\nProtos was able to verify, as documented by Data Finnovation, that the Ethereum-based backing wallet listed in Binance’s documentation occasionally undercollateralized BUSD tokens bridged onto BNB Chain. In other words, unbacked BUSD have circulated in the past. Subsequently, Binance topped-up funds in that backing wallet, albeit in a manner inconsistent with the official bridging process described in Binance’s documentation.\n\nTherefore, Protos can’t attest that Binance didn’t hold sufficient assets to back all Binance-peg BUSD at all times. We’re only certain that it didn’t fully back all Binance-peg BUSD with assets in its official Ethereum-based backing wallet. Today, Binance-peg BUSD is fully backed.\n\nFor more informed news, follow us on Twitter and Google News or listen to our investigative podcast Innovated: Blockchain City."
    }
]