[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3QvcGktZm91bmRlci1ibG9ncy1vbi1reWMtaW4tYWktdGVjaNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 22 Jan 2023 00:49:28 GMT",
        "title": "Pi Founder Blogs on KYC in AI Tech - BSC NEWS",
        "content": "PI\n\nThe Founder of Pi Network explains the importance of human verification in the AI age while unveiling the protocol’s decentralized KYC solution.\n\nKYC in the Age of AI\n\nFounder and Head of Technology at Pi Network, Dr. Nicolas Kokkalis, shared his thoughts about proving the humanity of people in a world shifting towards Artificial Intelligence (AI).\n\nAccording to the lifelong technologist, digital communities need real people. Although AI-powered algorithms can grow the user base, they can be problematic. One problem is the huge prevalence of spam bots and fake accounts. One way of solving this issue is verifying human identity through Know Your Customer (KYC). Nicolas wrote explicitly about the Pi Network native KYC solution in his article.\n\n“Communities, even (and especially) digital communities, need people. But how can you prove their humanity at scale? In the case of Pi Network, a massive global community powered by the world’s most distributed mobile-mined cryptocurrency, the secret has been balancing the intrigue of high-tech with the people. We found success through creating a native KYC solution,” Dr. Kokkalis wrote.\n\nPi Network’s native KYC solution combines scientific and human truths using machine automation and human verification for accurate results. Machine automation processes images, extract text, detects fake ID, and compares images. Pre-approved individuals process human verification, ensuring that the creation of fake accounts is prevented.\n\nPi KYC boasts an autonomous human validation workforce in more than 200 countries, representing 92.6% of the global population. This measure helps sustain its large community, preventing spam accounts and fake Pioneers.\n\nIn summary, Pi Network has established a decentralized KYC solution to efficiently build a legally compliant crypto community in the AI age. The solution also offers privacy, global accessibility, and verification accuracy. Read Nicolas’ full article on the Pi Application for more information or through this link .\n\nWhat is Pi Network:\n\nPi Network is a novel cryptocurrency and developer platform that allows mobile users to mine Pi coins without draining the device’s battery. Pi’s blockchain secures not only economic transactions via a mobile meritocracy system but also a full Web 3.0 experience where community developers can build decentralized applications (dApps) for millions of users.\n\nWhere to find Pi Network:"
    }
]