[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3QvYm5iLWhvbGRzLXN0ZWFkeS1kZXNwaXRlLWJpbmFuY2UtdHJvdWJsZXMtaW5xdWJldGEtbGF5cy1vdXQtYW1iaXRpb3VzLXJvYWRtYXAtdG8tcmljaGVz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 10:17:56 GMT",
        "title": "BNB Holds Steady Despite Binance Troubles, InQubeta Lays Out Ambitious Roadmap To Riches - BSC NEWS",
        "content": "ETH\n\nInQubeta's roadmap includes plans for an NFT marketplace, the InQubeta swap, and establishing an InQubeta DAO.\n\nIn the dynamic world of cryptocurrencies, resilience often speaks louder than temporary setbacks. As Binance navigates choppy regulatory waters, its native token BNB has displayed commendable stability. Parallelly, emerging platforms like InQubeta have a compelling narrative of their own. Here's an exploration of these intriguing developments.\n\nInQubeta: Charting the Future of AI Investment\n\nVenturing beyond the Binance narrative, the cryptocurrency world also presents uplifting stories of innovation and potential. Enter InQubeta. With a mission to democratize investments in AI start-ups, InQubeta’s model, anchored by QUBE tokens, is a game-changer.\n\nThrough QUBE, investors can own fractional stakes in AI start-ups, leveraging a platform that bridges potential investors with budding technological endeavors. This innovative mechanism not only promotes accessibility but also fosters a sense of community ownership in the AI domain's future. Being a deflationary token, QUBE encourages long-term holding for compounding gains. One can also stake it to reap significant rewards.\n\nFurthermore, InQubeta's comprehensive roadmap speaks volumes about its ambition. Launching the NFT marketplace, initiating InQubeta swap, and establishing the InQubeta DAO are all steps leading towards a transformative vision. The goal to become multi-chain by Q1 of 2024 encapsulates InQubeta's desire to embrace multiple blockchain platforms, amplifying accessibility and diversity for its community. The ongoing presale has received massive response from the community, with more than $2.2 million raised.\n\nBNB: Weathering the Regulatory Storm\n\nBinance, arguably the world's largest crypto exchange, finds itself at a crossroads. With the CFTC filing a lawsuit against them, alleging violations of US derivatives laws, the horizon seems challenging. Binance is accused of catering to US customers without adhering to necessary registrations. This alleged prioritization of commerce over compliance has plunged the exchange into the spotlight.\n\nYet, the narrative takes an interesting turn when we focus on Binance's native token, BNB. Despite the swirling storms of uncertainty, BNB has demonstrated resilience that few could anticipate. Its price and market dominance remain firm, echoing a sentiment that transcends immediate challenges. For many in the crypto space, BNB is more than just a token associated with Binance—it's a representation of an ecosystem, an innovation. This is a testament to BNB's robustness and the unwavering trust of its vast community.\n\nMoreover, Binance's tussle with the Securities and Exchange Commission (SEC) adds another dimension. The failure to meet the SEC's deadline for audited accounting documents reflects further challenges. However, even as these developments play out, BNB’s stability sends a clear message: it's not merely about the immediate scenario but the broader vision and legacy of what Binance and BNB represent.\n\nConclusion\n\nIn the cryptocurrency domain, stories of challenge and innovation often coexist. Binance and BNB's saga underscores the complexities of navigating the regulatory maze, while also celebrating the resilience of tokens like BNB that defy turbulence. Simultaneously, InQubeta's story is a call to the endless possibilities of the future, echoing the ethos of what makes the world of cryptocurrency so incredibly exciting.\n\nVisit InQubeta Presale\n\nJoin The InQubeta Communities"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMivAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMTctYXVndXN0LTIwMjMvYXJ0aWNsZXNob3cvMTAyNzk1NzI2LmNtc9IBwAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMTctYXVndXN0LTIwMjMvYW1wX2FydGljbGVzaG93LzEwMjc5NTcyNi5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin tanks below $28,700, Shiba Inu, Dogecoin fall up to 7% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe crypto tokens were trading in the red in Thursday's trade. Bitcoin (BTC) fell 1.62% to $28,629, whereas Ethereum (ETH) was below the 1,800 level.Meanwhile, the global cryptocurrency market cap was trading lower, around $1.14 trillion, falling 1.61% in the last 24 hours.\"Bitcoin has dropped 3% overnight and is fighting to hold $28,600 as support (which is in line with its 100-day moving average). This comes as global stock indices, including S&P 500, continue to be in the red - losing gains achieved over the past few months. Any further drop in Bitcoin will push the asset to retest $26,000 over the coming weeks,\" Vikram Subburaj, CEO of Giottus Crypto Platform, said.Other top crypto tokens, BNB Dogecoin , Solana, Shiba Inu, Polygon and Litecoin were also trading lower on Thursday.The market cap of Bitcoin, the world's largest cryptocurrency, was around $557 billion. Bitcoin's dominance is currently 49%, according to CoinMarketCap.BTC volume stood at approximately $16.49 billion, rising 24.8% in the last 24 hours.\"The BTC/USDT pair remains below the 20-day EMA, and the Relative Strength Index (RSI) is in negative territory. This suggests a minor advantage to the bears. Bitcoin remains confined within a tight range, showing no definite indications of breaking free. The recent market update from QCP Capital, a trading platform, suggests that Bitcoin, which is currently valued at $28,596, could potentially maintain this subdued state for several weeks before showing significant movement around September,\" said ZebPay Trade desk.Rajagopal Menon, Vice President at WazirX, said, \"Major market oscillators point to a Buy sentiment. The Relative Strength Index (14) sits at 36, with a neutral outlook. The Stochastic %K (14, 3, 3) at 16 and the Average Directional Index (14) at 13 indicate a Neutral outlook.\"\"The MACD Level (12, 26), at -171, indicates 'Buy'. The Stochastic RSI Fast (3, 3, 14, 14) is Neutral at 7 and William's Percentage indicates a Buy sentiment at -86,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com, data as of 11.47 hours, IST on August 17, 2023)Bitcoin $28,629 -1.62%Ethereum $1,798 -1.27%Tether $0.9987 -0.01%BNB $231 -1.48%XRP $0.59 -2.67%Cardano $0.2769 -0.84%Dogecoin $0.06799 -3.78%Solana $23.25 -0.71%Polygon $0.6217 -1.42%Litecoin $75.46 -3.80%Polkadot $4.76 -0.57%Tron $0.07455 -2.42%Shiba Inu $0.000009269 -6.73%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMivAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMTctYXVndXN0LTIwMjMvYXJ0aWNsZXNob3cvMTAyNzk1NzI2LmNtc9IBwAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMTctYXVndXN0LTIwMjMvYW1wX2FydGljbGVzaG93LzEwMjc5NTcyNi5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin tanks below $28,700, Shiba Inu, Dogecoin fall up to 7% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe crypto tokens were trading in the red in Thursday's trade. Bitcoin (BTC) fell 1.62% to $28,629, whereas Ethereum (ETH) was below the 1,800 level.Meanwhile, the global cryptocurrency market cap was trading lower, around $1.14 trillion, falling 1.61% in the last 24 hours.\"Bitcoin has dropped 3% overnight and is fighting to hold $28,600 as support (which is in line with its 100-day moving average). This comes as global stock indices, including S&P 500, continue to be in the red - losing gains achieved over the past few months. Any further drop in Bitcoin will push the asset to retest $26,000 over the coming weeks,\" Vikram Subburaj, CEO of Giottus Crypto Platform, said.Other top crypto tokens, BNB Dogecoin , Solana, Shiba Inu, Polygon and Litecoin were also trading lower on Thursday.The market cap of Bitcoin, the world's largest cryptocurrency, was around $557 billion. Bitcoin's dominance is currently 49%, according to CoinMarketCap.BTC volume stood at approximately $16.49 billion, rising 24.8% in the last 24 hours.\"The BTC/USDT pair remains below the 20-day EMA, and the Relative Strength Index (RSI) is in negative territory. This suggests a minor advantage to the bears. Bitcoin remains confined within a tight range, showing no definite indications of breaking free. The recent market update from QCP Capital, a trading platform, suggests that Bitcoin, which is currently valued at $28,596, could potentially maintain this subdued state for several weeks before showing significant movement around September,\" said ZebPay Trade desk.Rajagopal Menon, Vice President at WazirX, said, \"Major market oscillators point to a Buy sentiment. The Relative Strength Index (14) sits at 36, with a neutral outlook. The Stochastic %K (14, 3, 3) at 16 and the Average Directional Index (14) at 13 indicate a Neutral outlook.\"\"The MACD Level (12, 26), at -171, indicates 'Buy'. The Stochastic RSI Fast (3, 3, 14, 14) is Neutral at 7 and William's Percentage indicates a Buy sentiment at -86,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com, data as of 11.47 hours, IST on August 17, 2023)Bitcoin $28,629 -1.62%Ethereum $1,798 -1.27%Tether $0.9987 -0.01%BNB $231 -1.48%XRP $0.59 -2.67%Cardano $0.2769 -0.84%Dogecoin $0.06799 -3.78%Solana $23.25 -0.71%Polygon $0.6217 -1.42%Litecoin $75.46 -3.80%Polkadot $4.76 -0.57%Tron $0.07455 -2.42%Shiba Inu $0.000009269 -6.73%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8venljcnlwdG8uY29tL2Vhcmx5LWJpdGNvaW4tYWRvcHRlci1oYXMtdHdvLXJlbWFpbmluZy1wYXNzd29yZC1ndWVzc2VzLWJlZm9yZS1sb3NpbmctaGlzLTcwMDItYnRjL9IBbWh0dHBzOi8venljcnlwdG8uY29tL2Vhcmx5LWJpdGNvaW4tYWRvcHRlci1oYXMtdHdvLXJlbWFpbmluZy1wYXNzd29yZC1ndWVzc2VzLWJlZm9yZS1sb3NpbmctaGlzLTcwMDItYnRjLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Early Bitcoin Adopter Has Two Remaining Password Guesses Before Losing His 7,002 BTC - ZyCrypto",
        "content": "Advertisement\n\nGerman-born programmer and Coil CEO Stefan Thomas has continued to find himself at a crossroads, with only two attempts left to crack a code that holds the potential to unlock a fortune of staggering proportions after he forgot his password.\n\nThomas owned an IronKey, a small hard drive that housed the private keys to a digital wallet containing an astonishing 7,002 Bitcoin (approximately 198M today), which he purchased back when the cryptocurrency traded at around $5.\n\nThe story began when Thomas misplaced a paper containing his password to the IronKey wallet. With only ten guesses available before the IronKey’s contents were encrypted forever, Thomas’s urgency to retrieve his lost wealth was solid. He tried eight combinations, each attempt yielding nothing but frustration and desperation.\n\n“I would just lay in bed and think about it,” Thomas confessed in a 2021 interview. “Then I would go to the computer with some new strategy, and it wouldn’t work, and I would be desperate again.”\n\nIn an interview last month, Stefan further spoke about his relentless efforts to unlock the Bitcoin trapped in his hardware wallet. Talking on the “Thinking Crypto” YouTube channel, the pundit acknowledged that the recovery process was far from simple.\n\nAdvertisement\n\n“The process is still ongoing, so we’re still working on it,” he stated. He shed light on the intricate challenges faced due to the substantial sum at stake. “When you’re dealing with so much money, everything takes forever,” he emphasized.\n\nStefan detailed the thorough approaches required for both physical and software attacks. “Before you can do some physical attack, you first have to try it lots of times. Before you do a software attack, you first wanna try every angle,” he explained. He further expressed his desire for closure, stating, “Honestly, at this point, after 10 years, I don’t care. Just get it over with.”\n\nStefan Thomas’s plight is not an isolated incident. In 2013, a computer engineer named James Howells accidentally discarded a driver, which held 7,500 bitcoins, during an office cleaning session. This event convinced him that the valuable item was resting in a landfill in Newport, south Wales. Despite James Howells’ persistent appeals, the local council consistently denied his requests to search the landfill, citing environmental concerns.\n\nBitcoin’s decentralized nature, while empowering users, has also led to numerous stories of forgotten passwords and inaccessible fortunes. Around 20 per cent of 18.5 million Bitcoins, valued at approximately $93 billion, are believed to be trapped in lost or stranded wallets."
    }
]