[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5kZWxhd2FyZW9ubGluZS5jb20vc3RvcnkvbmV3cy9sb2NhbC8yMDIzLzExLzEzL21pbGxzYm9yby1uZXdlc3Qtd2VkZGluZy12ZW51ZS10aGUtZXN0YXRlLWF0LXBsYW50YXRpb24tcmlkZ2UvNzEzOTI4MDIwMDcv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "See Millsboro's newest wedding venue, The Estate at Plantation Ridge - The News Journal",
        "content": "No commitment required. Cancel anytime.\n\n*Offer available to new customers only. All savings based off the regular rate.\n\nRead the full Subscription Terms and Conditions."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8venljcnlwdG8uY29tL3dpdGgtYml0Y29pbi1mb3JtaW5nLWEtYnVsbGlzaC1wZW5uYW50LWlzLXRoZS00MzAwMC1idGMtcHJpY2Utem9uZS1pbi1zaWdodC_SAWVodHRwczovL3p5Y3J5cHRvLmNvbS93aXRoLWJpdGNvaW4tZm9ybWluZy1hLWJ1bGxpc2gtcGVubmFudC1pcy10aGUtNDMwMDAtYnRjLXByaWNlLXpvbmUtaW4tc2lnaHQvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "With Bitcoin Forming a Bullish Pennant, Is the $43,000 BTC Price Zone In Sight? - ZyCrypto",
        "content": "Advertisement\n\nBitcoin continues to be the talk of the town based on its current bullish run after months of stagnation, thanks to heightened optimism about the approval of spot BTC exchange-traded funds (ETFs) by the United States Securities and Exchange Commission (SEC).\n\nAs a result, veteran trader Peter Brandt believes a pennant is being formed on the Bitcoin network, and this is bullish because it could propel the pioneer cryptocurrency to the $43,000 level.\n\nSource: Peter Brandt\n\nBTC was trading at $36,773 at press time, according to CoinGecko data. Therefore, Brandt suggests that Bitcoin could experience a 15.7% surge if the pennant formation sees the light of day.\n\nA pennant depicts a continuing bullish pattern during an uptrend, comprising converging trendlines and a flagpole, which depicts the previous price increase. Therefore, the pennant formation shows a short-ranging market before the resumption of an uptrend.\n\nTherefore, if the present bullish pennant formation materializes, Brandt is optimistic that Bitcoin’s price could soar to highs of $43,289.\n\nAdvertisement\n\nMeanwhile, a market analyst under the pseudonym CryptoJelleNL was of a similar opinion that Bitcoin was not yet done with its current surge because it was eyeing $48,000. This is because the apex cryptocurrency had broken out of the bullish megaphone formation, as reported by ZyCrypto.\n\nTherefore, these sentiments show that Bitcoin bulls have not thrown in the towel yet, as their quest to maintain the present uptrend is still alive.\n\nMeanwhile, top analyst Michael van de Poppe suggested that a bearish divergence was not yet validated on the BTC network.\n\nHe added that even if Bitcoin were to drop to $35,000, the market remained optimistic because an uptrend would continue.\n\nSource: Michael van de Poppe\n\nA bearish divergence is a pattern that signals a potential downtrend because prices usually soar to a new high, but the oscillator fails to reach this peak."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8venljcnlwdG8uY29tL3hycC1ldGhlci1zb2xhbmEtY2FyZGFuby1zaGliYS1pbnUtYnJhY2UtZm9yLTEtdHJpbGxpb24tYnVsbC1zaG9jay1hcy1zcG90LWJpdGNvaW4tZXRmLWNvbWVzLW5pZ2gv0gF7aHR0cHM6Ly96eWNyeXB0by5jb20veHJwLWV0aGVyLXNvbGFuYS1jYXJkYW5vLXNoaWJhLWludS1icmFjZS1mb3ItMS10cmlsbGlvbi1idWxsLXNob2NrLWFzLXNwb3QtYml0Y29pbi1ldGYtY29tZXMtbmlnaC8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "XRP, Ether, Solana, Cardano, Shiba Inu Brace For $1 Trillion ‘Bull Shock’ As Spot Bitcoin ETF Comes Nigh - ZyCrypto",
        "content": "Advertisement\n\nThe prospect of spot Bitcoin ETFs has long been a dream for investors and traders alike. Amidst this anticipation, recent reports from esteemed data analytics platforms have set the crypto community abuzz, predicting a staggering $1 trillion market cap for crypto majors like Bitcoin, XRP, Ether, Solana, Cardano, and Shiba Inu if spot ETFs receive the green light.\n\nA report, crafted by the experts at CryptoQuant delves into the historical context that has shaped Bitcoin’s market trajectory. The first wave of institutional adoption witnessed during Bitcoin’s historic bull run in 2021 saw institutions adding BTC to their balance sheets. According to CryptoQuant researchers, the next significant wave of adoption is already underway, marked by major Asset Under Management [AUM] entities making Bitcoin accessible to their clients through spot ETFs.\n\nThe only hurdle on this promising path seems to be approval from the US Securities and Exchange Commission [SEC], an obstacle that has kept the crypto community on edge. However, recent favourable court rulings in the GBTC and XRP lawsuits against the regulator have injected a newfound optimism into the market.\n\nCryptoQuant’s experts have brought forth a compelling analysis that could fuel the already bullish sentiment in the crypto sphere. Historically, during bull markets, Bitcoin’s market cap has risen at a rate of 3–5 times higher than its realized cap. According to the report, for every $1 that pours into the Bitcoin network, its market cap could potentially surge by $3 to $5. If this pattern holds true and spot ETFs secure approval, Bitcoin’s price could skyrocket, reaching astronomical figures ranging between $50,000 and $73,000.\n\nRecall how a false rumour of a spot Bitcoin ETF approval sent the crypto community to a tizzy as BTC soared. Although this incident serves as a cautionary tale, if the predicted scenario unfolds and spot ETFs are approved, the entire crypto landscape could enter a prolonged period of bullish momentum, where the bears might find it challenging to resist the rising tide."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZGVjcnlwdC5jby8yMDU2NDYvd2h5LXNvLW1hbnktY3J5cHRvLWdhbWVzLXN3aWNoaW5nLWNoYWlucy1jYWxsaW5nLXF1aXRz0gFWaHR0cHM6Ly9kZWNyeXB0LmNvLzIwNTY0Ni93aHktc28tbWFueS1jcnlwdG8tZ2FtZXMtc3dpY2hpbmctY2hhaW5zLWNhbGxpbmctcXVpdHM_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Why So Many Crypto Games Are Switching Chains—Or Calling it Quits - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nWhile a fledgling industry, blockchain gaming has already faced massive challenges—resulting in a swath of games being put on indefinite pause by their respective developers, while others switch chains.\n\nIn 2022, a staggering 157 blockchain games were “halted” or otherwise stopped development, while another 43 titles were halted in 2023, according to a new Game7 report on the state of the Web3 gaming industry. Game7 is a decentralized community or DAO focused on blockchain gaming adoption.\n\nGame7 core contributor George Isichos told Decrypt that the blockchain or “Web3” games that stopped development this year struggled to get financial support and were generally titles that were established before 2021.\n\nFinancial troubles trip up games\n\nAD\n\nAD\n\nMost of the blockchain games that stopped development or live support this year were also mainly from very small studios, whereas very few “AA” or “AAA” games were shut down. Game7 defines “AA” as a studio with about $10-25 million in funding, and “AAA” studios as those with over $25 million in funding.\n\nDespite this, the majority of Web3 games are actually still indie games, according to the report, with 42% of Web3 games classified as “indie” or developed by individuals or small teams without any financial backers or publishers. Some 40% of Web3 games are “midsize,” meaning they have secured $10 million or less in funding. AA games make up just 5% of the blockchain gaming ecosystem—and AAA titles even less, comprising just 1% of the industry.\n\nImage: Game7.\n\nMore chains, more competition\n\nThe number of total gaming-focused blockchain networks spiked this year, going from 37 in 2022 to 53 in 2023. Competition among blockchains vying for game developers to use their networks has spiked as a result, and is correlated with a rise in developers switching chains this year.\n\nWhile most blockchain games still use a layer-1 blockchain like Ethereum’s mainnet, many have adopted Ethereum-compatible sidechains or scaling networks instead. About 81% of current blockchain games use a non gaming-focused layer-1 blockchain, according to Game7.\n\nThe Ethereum Virtual Machine (EVM) is overwhelmingly the most popular choice for blockchain games, with 74% of games choosing to use an EVM network. Solana’s virtual machine comes in a distant second, making up about 10% of games.\n\nAD\n\nAD\n\nSo which networks are most blockchain games using in 2023? Ethereum sidechain Polygon remains the top choice, with Binance’s BNB Chain coming in second. Ethereum’s mainnet is the third most popular. Solana, Immutable, Avalanche, and Arbitrum take the fourth to seventh top spots, respectively.\n\nImage: Game7.\n\nGames on the move\n\n2023 is poised to be the year of game migrations. In total, 65 blockchain games moved networks so this year, up from 48 games switching things up across all of 2022. While there are also many more blockchain games around now than in years past, the amount of chain-switching is still notable.\n\nThis year, games migrated to Polygon, Immutable, and Arbitrum in the largest numbers, respectively, per the report. And 60% of games that left a layer-1 network moved to a layer-2 scaling network.\n\nBut switching blockchains is no small feat. So why are games migrating?\n\nIndie developer Reinhardt Weyers is the creator of Untitled Platformer, a game launched back in 2021 on BNB Chain (formerly Binance Smart Chain, or BSC). Weyers told Decrypt via email that this year, he decided it was time to move to a gasless chain—one without transaction fees—and migrated his game to SKALE.\n\nSince Untitled Platformer made the switch, Weyers noticed that “players started actively trying my game more, with some sticking around for quite a while.”\n\nEarlier this year, both Mighty Action Heroes and on-chain game Pirate Nation independently moved from Polygon to Arbitrum.\n\n“As more people have migrated to Polygon, we just started to run into scaling issues with the Polygon chain,” Pirate Nation developer at Proof of Play, CEO Amitt Mahajan, previously told Decrypt.\n\nAD\n\nAD\n\n“We were paying between $3,000 and $4,000 a day on gas. And so it just got untenable. It was preventing us from being able to scale the game,” Mahajan said.\n\nWhile some developers switched chains for lower costs, others moved due to broader market and regulatory concerns.\n\nAnito Legends Cofounder and CMO Jayvee Fernandez told Decrypt in an email that the Philippines-based studio chose to move its first blockchain game from BNB Chain (aka BSC) to Polygon because of concerns around crypto exchange Binance.\n\n“General sentiment around BSC isn’t very favorable of late,” Fernandez told Decrypt.\n\n“After launching in 2022, we slowly felt the market uncertainty and anxieties with the whole SBF and CZ fiasco. We also saw Binance being under fire in other markets. We felt it was too ‘centralized’ and didn't want our game's future to be beholden to such drama,” the CMO shared.\n\nFernandez added that Polygon was chosen ultimately because the team believes it’s more decentralized—and saw an opportunity to connect with many other Philippines-based games using the Ethereum sidechain.\n\nOthers have created their own blockchains entirely, like Corey Wilto, CEO of Mirai Labs, whose studio created the Pegaxy blockchain game.\n\n\"For us it came down to value capture. Building a chain came at a reasonably low cost ($100K-$200K),” Wilto told Decrypt via email.\n\nAD\n\nAD\n\n“The value that it brings to the company when viewed from a VC perspective or even just monetizing users through swaps, bridging, and other DeFi tools, it came as a no-brainer because we had the technical capability internally,\" Wilto shared.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZGVjcnlwdC5jby8yMDU2NDYvd2h5LXNvLW1hbnktY3J5cHRvLWdhbWVzLXN3aWNoaW5nLWNoYWlucy1jYWxsaW5nLXF1aXRz0gFWaHR0cHM6Ly9kZWNyeXB0LmNvLzIwNTY0Ni93aHktc28tbWFueS1jcnlwdG8tZ2FtZXMtc3dpY2hpbmctY2hhaW5zLWNhbGxpbmctcXVpdHM_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Why So Many Crypto Games Are Switching Chains—Or Calling it Quits - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nWhile a fledgling industry, blockchain gaming has already faced massive challenges—resulting in a swath of games being put on indefinite pause by their respective developers, while others switch chains.\n\nIn 2022, a staggering 157 blockchain games were “halted” or otherwise stopped development, while another 43 titles were halted in 2023, according to a new Game7 report on the state of the Web3 gaming industry. Game7 is a decentralized community or DAO focused on blockchain gaming adoption.\n\nGame7 core contributor George Isichos told Decrypt that the blockchain or “Web3” games that stopped development this year struggled to get financial support and were generally titles that were established before 2021.\n\nFinancial troubles trip up games\n\nAD\n\nAD\n\nMost of the blockchain games that stopped development or live support this year were also mainly from very small studios, whereas very few “AA” or “AAA” games were shut down. Game7 defines “AA” as a studio with about $10-25 million in funding, and “AAA” studios as those with over $25 million in funding.\n\nDespite this, the majority of Web3 games are actually still indie games, according to the report, with 42% of Web3 games classified as “indie” or developed by individuals or small teams without any financial backers or publishers. Some 40% of Web3 games are “midsize,” meaning they have secured $10 million or less in funding. AA games make up just 5% of the blockchain gaming ecosystem—and AAA titles even less, comprising just 1% of the industry.\n\nImage: Game7.\n\nMore chains, more competition\n\nThe number of total gaming-focused blockchain networks spiked this year, going from 37 in 2022 to 53 in 2023. Competition among blockchains vying for game developers to use their networks has spiked as a result, and is correlated with a rise in developers switching chains this year.\n\nWhile most blockchain games still use a layer-1 blockchain like Ethereum’s mainnet, many have adopted Ethereum-compatible sidechains or scaling networks instead. About 81% of current blockchain games use a non gaming-focused layer-1 blockchain, according to Game7.\n\nThe Ethereum Virtual Machine (EVM) is overwhelmingly the most popular choice for blockchain games, with 74% of games choosing to use an EVM network. Solana’s virtual machine comes in a distant second, making up about 10% of games.\n\nAD\n\nAD\n\nSo which networks are most blockchain games using in 2023? Ethereum sidechain Polygon remains the top choice, with Binance’s BNB Chain coming in second. Ethereum’s mainnet is the third most popular. Solana, Immutable, Avalanche, and Arbitrum take the fourth to seventh top spots, respectively.\n\nImage: Game7.\n\nGames on the move\n\n2023 is poised to be the year of game migrations. In total, 65 blockchain games moved networks so this year, up from 48 games switching things up across all of 2022. While there are also many more blockchain games around now than in years past, the amount of chain-switching is still notable.\n\nThis year, games migrated to Polygon, Immutable, and Arbitrum in the largest numbers, respectively, per the report. And 60% of games that left a layer-1 network moved to a layer-2 scaling network.\n\nBut switching blockchains is no small feat. So why are games migrating?\n\nIndie developer Reinhardt Weyers is the creator of Untitled Platformer, a game launched back in 2021 on BNB Chain (formerly Binance Smart Chain, or BSC). Weyers told Decrypt via email that this year, he decided it was time to move to a gasless chain—one without transaction fees—and migrated his game to SKALE.\n\nSince Untitled Platformer made the switch, Weyers noticed that “players started actively trying my game more, with some sticking around for quite a while.”\n\nEarlier this year, both Mighty Action Heroes and on-chain game Pirate Nation independently moved from Polygon to Arbitrum.\n\n“As more people have migrated to Polygon, we just started to run into scaling issues with the Polygon chain,” Pirate Nation developer at Proof of Play, CEO Amitt Mahajan, previously told Decrypt.\n\nAD\n\nAD\n\n“We were paying between $3,000 and $4,000 a day on gas. And so it just got untenable. It was preventing us from being able to scale the game,” Mahajan said.\n\nWhile some developers switched chains for lower costs, others moved due to broader market and regulatory concerns.\n\nAnito Legends Cofounder and CMO Jayvee Fernandez told Decrypt in an email that the Philippines-based studio chose to move its first blockchain game from BNB Chain (aka BSC) to Polygon because of concerns around crypto exchange Binance.\n\n“General sentiment around BSC isn’t very favorable of late,” Fernandez told Decrypt.\n\n“After launching in 2022, we slowly felt the market uncertainty and anxieties with the whole SBF and CZ fiasco. We also saw Binance being under fire in other markets. We felt it was too ‘centralized’ and didn't want our game's future to be beholden to such drama,” the CMO shared.\n\nFernandez added that Polygon was chosen ultimately because the team believes it’s more decentralized—and saw an opportunity to connect with many other Philippines-based games using the Ethereum sidechain.\n\nOthers have created their own blockchains entirely, like Corey Wilto, CEO of Mirai Labs, whose studio created the Pegaxy blockchain game.\n\n\"For us it came down to value capture. Building a chain came at a reasonably low cost ($100K-$200K),” Wilto told Decrypt via email.\n\nAD\n\nAD\n\n“The value that it brings to the company when viewed from a VC perspective or even just monetizing users through swaps, bridging, and other DeFi tools, it came as a no-brainer because we had the technical capability internally,\" Wilto shared.\n\nEdited by Andrew Hayward"
    }
]