[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDUvMzAvdGFiaXMtYm5iLW5mdC1tYXJrZXRwbGFjZS1yYWlzZXMtMTBtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 May 2023 07:00:00 GMT",
        "title": "Tabi's BNB NFT Marketplace Raises $10M - Crypto Times",
        "content": "A prominent NFT marketplace, Tabi, previously known as Treasureland, on the BNB Chain, has successfully concluded an angel funding round, raising an impressive $10 million.\n\n📢 We are thrilled to announce that 𝗧𝗮𝗯𝗶 has raised a $𝟭𝟬 𝗺𝗶𝗹𝗹𝗶𝗼𝗻 angel round from Animoca Brands, Binance Labs, Draper Dragon, Hashkey Capital, Infinity Crypto Ventures, and Youbi Capital.\n\n\n\n♟️To learn more: https://t.co/qBrNVpmhDi — 𝗧𝗮𝗯𝗶 🎮 (@Tabichain) May 29, 2023\n\nVenture capital firms, including Animoca Brands, Binance Labs, Draper Dragon, Hashkey Capital, Infinity Crypto Ventures, and Youbi Capital took part in the funding round.\n\nNotable individual investors such as Bo Feng of Dragonfly Capital, Riyad AD of Saudi Arabia, and Suji Yan of Mask Network also contributed to the funding.\n\nTabi has big plans for the newly acquired funds, primarily focusing on the development of its gaming ecosystem and the creation of an on-chain identity protocol.\n\nThe marketplace, in addition to offering NFT trading and launchpad features, introduces the unique concept of converting users’ on-chain activities into “experience points,” which can be exchanged for future airdrop rewards and earnings.\n\nXavier Lee, the founder of Tabi, revealed the project’s future endeavors, which include the launch of an “NFT incubation fund.” This initiative aims to incentivize developers to bring their products, art, and brand to the BNB Chain.\n\nBy providing support and resources to these creators, Tabi aims to foster innovation within the NFT space. The marketplace, established in 2021, also expressed gratitude to its early supporters by introducing a “reward plan” on the same day as the funding announcement.\n\nThis recent funding round further showcases Binance’s growing involvement in the NFT realm.\n\nThe cryptocurrency exchange made headlines on March 2 with its native NFT AI generator, “Bicasso,” which reached its minting cap of 10,000 within just three hours of launch.\n\nHere’s a fun new #Binance AI product called #Bicasso 🎨\n\n\n\nYou can turn your creative visions into NFTs with AI. Give it a try and show me what you make with it.\n\n\n\nBeta version live now, limited to 10k mints.\n\n\n\n➡️ https://t.co/QeQS7oh9uH pic.twitter.com/22Dllhg2sP — CZ 🔶 BNB (@cz_binance) March 1, 2023\n\nOn March 8, Binance also announced its integration of Polygon (MATIC) support into its NFT marketplace, expanding its capabilities and reach. It is worth noting that Tabi’s ambitions align with the broader industry trend."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDUvMzAvdGFiaXMtYm5iLW5mdC1tYXJrZXRwbGFjZS1yYWlzZXMtMTBtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 May 2023 07:00:00 GMT",
        "title": "Tabi's BNB NFT Marketplace Raises $10M - Crypto Times",
        "content": "A prominent NFT marketplace, Tabi, previously known as Treasureland, on the BNB Chain, has successfully concluded an angel funding round, raising an impressive $10 million.\n\n📢 We are thrilled to announce that 𝗧𝗮𝗯𝗶 has raised a $𝟭𝟬 𝗺𝗶𝗹𝗹𝗶𝗼𝗻 angel round from Animoca Brands, Binance Labs, Draper Dragon, Hashkey Capital, Infinity Crypto Ventures, and Youbi Capital.\n\n\n\n♟️To learn more: https://t.co/qBrNVpmhDi — 𝗧𝗮𝗯𝗶 🎮 (@Tabichain) May 29, 2023\n\nVenture capital firms, including Animoca Brands, Binance Labs, Draper Dragon, Hashkey Capital, Infinity Crypto Ventures, and Youbi Capital took part in the funding round.\n\nNotable individual investors such as Bo Feng of Dragonfly Capital, Riyad AD of Saudi Arabia, and Suji Yan of Mask Network also contributed to the funding.\n\nTabi has big plans for the newly acquired funds, primarily focusing on the development of its gaming ecosystem and the creation of an on-chain identity protocol.\n\nThe marketplace, in addition to offering NFT trading and launchpad features, introduces the unique concept of converting users’ on-chain activities into “experience points,” which can be exchanged for future airdrop rewards and earnings.\n\nXavier Lee, the founder of Tabi, revealed the project’s future endeavors, which include the launch of an “NFT incubation fund.” This initiative aims to incentivize developers to bring their products, art, and brand to the BNB Chain.\n\nBy providing support and resources to these creators, Tabi aims to foster innovation within the NFT space. The marketplace, established in 2021, also expressed gratitude to its early supporters by introducing a “reward plan” on the same day as the funding announcement.\n\nThis recent funding round further showcases Binance’s growing involvement in the NFT realm.\n\nThe cryptocurrency exchange made headlines on March 2 with its native NFT AI generator, “Bicasso,” which reached its minting cap of 10,000 within just three hours of launch.\n\nHere’s a fun new #Binance AI product called #Bicasso 🎨\n\n\n\nYou can turn your creative visions into NFTs with AI. Give it a try and show me what you make with it.\n\n\n\nBeta version live now, limited to 10k mints.\n\n\n\n➡️ https://t.co/QeQS7oh9uH pic.twitter.com/22Dllhg2sP — CZ 🔶 BNB (@cz_binance) March 1, 2023\n\nOn March 8, Binance also announced its integration of Polygon (MATIC) support into its NFT marketplace, expanding its capabilities and reach. It is worth noting that Tabi’s ambitions align with the broader industry trend."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3LmNyeXB0b25ld3N6LmNvbS9uZnRiLWRlbGl2ZXJzLWl0cy1nYW1pbmctaHViLW9uLXRoZS1ibmItY2hhaW4v0gFOaHR0cHM6Ly93d3cuY3J5cHRvbmV3c3ouY29tL25mdGItZGVsaXZlcnMtaXRzLWdhbWluZy1odWItb24tdGhlLWJuYi1jaGFpbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 May 2023 07:00:00 GMT",
        "title": "NFTb delivers its Gaming Hub on the BNB Chain - CryptoNewsZ",
        "content": "NFTb, which is a multichain gaming and metaverse platform meant for digital ownership, has managed to successfully deliver its very own Gaming Hub on the BNB Chain. The entity is also involved in the boosting of Gamefi projects by helping to allocate, as well as come up with liquidity. This will indeed make their overall positioning in the iGaming arena all the more rock solid. In order to gain this achievement, the team put in more than two years of sheer effort and finally turned it into a success story.\n\nThe Gaming Hub comes with a whole lot of very beneficial attributes. Some of them would be the project token incorporations, which is a very first for the concerned industry. Then there is the affordable gaming scenario. The Gaming Hub possesses a robust gaming ecosystem, as well as staking pools and custom royalties. There are also bulk NFT listings.\n\nThe absolute highlighting feature, however, is the conventional project token incorporation. This provides the opportunity for developers to be able to work on their token liquidity and come out with robust in-game economies. Besides this, the incorporation comes with a variety of options in the case of gaming projects being in the position of controlling their conventional tokens inside of a healthy marketplace.\n\nFurther to all of this, the Gaming Hub also comes with a Social Hub, which is undoubtedly the very first social gaming marketplace ever to exist on the BNB Chain. This is indeed a landmark where the social gaming ecosystem is concerned. It provides the option for gamers to be in the position of linking up, as well as following and scouring at a very high level. There is also the chance to carry out trading, which has been thrown in. In all, the Social Hub brings about an invigorating experience for all connected players.\n\nThe NFTb also introduces what they call Yoda Labs. This is involved with a deep-rooted study of the overall iGaming arena and provides players with the satisfaction of receiving reviews of games, as well as deeply researched segments that draw attention towards the linking of esports with Web3 gaming. Yoda Labs comes across as a source of extremely relevant insights for the benefit and understanding of all connected players, as well as the developers. It also provides all-inclusive angles pertaining to gameplay methods, as well as graphics and the options for selecting games suiting their comfort level.\n\nNFTb has the serious support of companies such as Binance Labs, along with Polygon Studios, Klaytn Foundation, and Oasis Protocol. The entity is adequately capable of initiating the initial phase of funding in terms of GameFi communities by helping them to expand with the aid of the NFTb launchpad, along with the gaming MetaMarket and the staking of vault offerings. It also backs Web3 projects that are in their nascent stage through effective incubation programs and accelerator grants that are provided by Klaytn and Polygon."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiLGh0dHBzOi8vdGhlYW5uYXB1cm5hZXhwcmVzcy5jb20vc3RvcnkvNDMwNzcv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 May 2023 07:00:00 GMT",
        "title": "Over Easy BnB: For breakfast and more - Annapurna Express",
        "content": "A- A+\n\nWho doesn’t love good breakfast food? It’s light, soothing, and if it were up to me, I would have it for breakfast, lunch, and dinner. And I found a perfect place that serves you breakfast food all day round. Over Easy BnB in Bansbari, Kathmandu, is an all-day breakfast restaurant that serves you good food at a reasonable price. It’s quite popular for the Over Easy Eggs and its exclusive menu.\n\nThe place looks aesthetic. There is a pretty garden too. I was captivated by the villa-style decor with abstract artwork on the walls. The modest decor and vibrant artifacts kept the mood upbeat. Warm lights and beige teak wood interiors lift the ambiance even more. The counter is adorned with a large clock. In the garden, there are fairy lights strung across the trees and hedges.\n\nThe experience of visiting this restaurant is incomplete without trying out their Over Easy Special. It’s an innovative dish, with multigrain toast and two special toppings. One comes with two delectable over-easy eggs and smashed avocado, and another with a fine coating of peanut butter and pomegranate spread on top. It has a subtle balance of sweet and sour flavor. To make it more appealing, they serve it with fat juicy sausages, bacon, and lettuce.\n\nThe other dish you need to try is Florentine Eggs. It’s one of those fancy dishes that not only looks good but is also delicious. The dish has an earthy flavor from poached egg and spinach. It’s served with some bacon strips and freshly made chips on the side. It’s served on a pink earthenware plate making the aesthetic appeal of the meal hard to ignore. They prepare soft multigrain bread by letting the dough rise overnight and baking it the next morning. Every dish is made from scratch, so it’s understandable why their service is a tad bit slow. Most of the ingredients used are grown in their garden.\n\nBesides food, this restaurant is also popular for its fruit smoothies. Unfortunately, a smoothie bowl wasn’t available at the moment so we asked for The Breakfast Cake. The ingredients include three soft pancakes, sliced bananas, and chopped apples. They’ve included their signature over-easy eggs, bacon, and lettuce to make the dish nutritious. I’m glad the Chicken Wrap we ordered wasn’t a bad pick after knowing it’s made with spinach. It’s a rolled-up mix of spinach and chicken in tortillas. The spinach is neatly packed so it doesn’t get messy while eating. I also liked how the restaurant shortlists its specials every day. You can find them scribbled on a blackboard. It’s quite helpful for people who are indecisive about what to order. And it’s interesting how they have included different cultural foods for breakfast on their menu. You can select from classic Indian, classic Nepali, and mountain madness with sherpa bread for your breakfast meal. Over Easy BnB is all things classy and cozy. The place puts you at ease and the food makes you happy. Plus, there is plenty of parking space for both two- and four-wheelers so you don’t have to worry about that either. Their Specials:\n\nOver Easy Special\n\nThe Eggs Florentine\n\nThe Breakfast Cake\n\nLocation: Bansbari, Kathmandu\n\nBreakfast for two: Rs 1,200\n\nOpening Hour: 8:00 am to 10:00 pm\n\nContact: 9841587695\n\nOnline Payment: Accepted\n\nParking: Available"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vd3d3LmZ4bGVhZGVycy5jb20vZm9yZWNhc3RzL2NyeXB0by9iaW5hbmNlLWNvaW4tcHJpY2UtZm9yZWNhc3Qv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 May 2023 07:00:00 GMT",
        "title": "Binance Coin (BNB) Price Prediction for 2023: The Robust Binance Infrastructure Drives Bullish Momentum » FX Leaders - FX Leaders",
        "content": "Binance Coin price started off at $0.11 against the USD in 2017, with trading volumes of around $250,000. It then gained upward momentum to trade at $21, with trading volumes of about $389.23 million at the beginning of 2018. However, BNB/USD could not sustain the bull run, and it tumbled to $8 in April of 2018, with trading volumes reduced to $49 million. The crypto then remained subdued, below $30, until May 2019, when the trading volumes surged to $457 million, and the token seemed to gain some bullish momentum to the upside. BNB/USD then plunged again, to a low of $10, and trading volumes of $681 million by March.\n\nAccording to our Binance Coin price prediction, the coin gained renewed upward momentum at the beginning of 2021, which saw it surging from a low of $50 to $284, as it turned in more than 400% gains in just two weeks. It then retraced to $190 as of February 22, before embarking on another rally. The bullish momentum that followed took the pair from a low of $211, at the beginning of March 2021, to an all-time high of above $690 as of May 10 – a gain of over 200% in just two months. However, the price was destined to crash from the ATH, plummeting to around $259 as of May 17, and wiping out over 150% in gains in the process.\n\n2022 was rough. Terra collapsed. A few more blockchain companies fell into bankruptcy. Came to the FTX contagion that saw all cryptocurrency prices follow a downward trend. BNB closed around $250.\n\nToday in 2023, the Binance Coin trades around a range of $230 – $347. In this article, we want to look at some of the factors influencing the price of Binance Coin, and how they will influence the coin’s general trend in 2023 and beyond.\n\nBinance Coin began the fourth quarter of 2021 on a bullish note. The pair moved from $415 at the start of October, surging to trade at $474 in just two weeks, and gaining 14%, but the bullish sentiment was still not over. Another notable surge in BNB/USD took the price from $445 on October 28 to $661, and it began trading slightly under the previous high, with gains of around 50%. Between November 10 and December, BNB/USD has remained range-bound, between $510 and around $650. At the time of writing, the pair was trading at $588, after a bearish crypto market sentiment set in.\n\nBinance Price Prediction\n\nBinance Forecast: 2023\n\nPrice: $500 – $800 Binance Forecast: 2 Years\n\nPrice $1,000 – $2,000 Binance Forecast: 3 Years\n\n$3,000+\n\nAccording to strong use cases and a history of strong upside moves, BNB/USD will be bullish in the next three years. We expect the pair to close at $2,000 by the end of next year, supported by our technical and fundamental analysis. We also expect Binance Coin to jump to $3,000 in the next two years, and in the next three years, we could see the price go above that mark, with continued adoption. The predictions are speculative, based on previous price trails, and BNB/USD could even make higher jumps.\n\nIntroduction to Binance Coin\n\nBNB is Binance’s native currency; it is an ERC20 token that runs on the Ethereum blockchain. 166,801,148 BNB tokens are circulating out of a capped maximum supply of 200 million tokens. 50% of the tokens are allocated to the platform’s ICO, 40% to the founders, and the remaining 10% was divided among angel investors. BNB coin was introduced by the Binance platform in 2017. The platform has a repurchasing plan to buy back BNB tokens and destroy some each quarter, using 20% of its profits. Its target is to burn 100 million of the remaining BNB. Binance supports trading pairs, like BTC, LTC, ETH, NEO and BNB. The coin ranks as the third-largest cryptocurrency, with a market capitalization of $92 billion.\n\nBesides this, Binance has grown to be a decentralized blockchain network, and the leading crypto exchange in the world. The exchange can handle 1.4 million orders per second, making it one of the fastest cryptocurrency exchanges in the market. The centralized exchange also fulfills the highest transaction volumes per day, at $29 billion ahead of Coinbase Exchange, which handles about $6 billion transactions in 24 hours. The founders of Binance include CEO Changpeng Zhao and He Yi, who is the chief marketing officer.\n\nFactors Affecting the Price of Binance\n\nSupply of Binance Coins\n\nThe supply of BNB tokens affects the price, as an increased demand drives the price upward. There is a fixed supply of Binance coins, and the network has been destroying tokens to curb inflation. We expect to see a surge in the future, as the number of tokens is reduced.\n\nThe Growth of the Ecosystem\n\nBinance began as a cryptocurrency exchange platform, but it has continued to diversify its services in the cryptocurrency space. The platform has expanded its range of crypto derivative instruments on offer. Binance also provides numerous ways for investors to enter the futures markets. These include the USD Margined Futures Contracts, Coin Margin Futures contracts, Binance Leveraged Tokens and Binance Options. Binance has also attracted investors through its initial coin offerings. As the platform’s ecosystem continues to grow, there will be more buyers, resulting in a further surge of the Binance coin.\n\nBinance Smart Chain\n\nBinance Smart Chain is a blockchain platform that was developed by Binance. The Chain uses the Proof of Stake Authority (PoSA) to allow the development of decentralized applications and the launch of smart contracts. The platform features low transaction speeds of about 3 seconds block time and affordable prices. As BSC gains popularity, so will the demand for Binance Coins, which power the platform.\n\nFactors that could hinder Adoption\n\nRegulations\n\nThe crypto industry is facing a tough regulatory terrain. China cracked down on all the privately operated cryptocurrency and mining activities. The probe has affected the adoption of crypto assets in this highly populated country. Although the US has taken a more lenient approach in regulating the sector, like the launch of the Bitcoin futures ETF, there is still a long way to go. If the regulators continue to impose tougher regulations on the cryptocurrency sector, Binance Coin could be affected.\n\nCompetition\n\nMany global cryptocurrency exchanges compete directly with Binance. Coinbase, Huobi Global, and Kucoin are some of them. BNB also competes against other established cryptocurrencies, such as Bitcoin and Ethereum. More trading activities at the Binance exchange could drive adoption, and the price of BNB would go up accordingly. The Binance Smart Chain competes directly with blockchain networks, like Ethereum and Bitcoin. If BNB remains competitive against other cryptocurrencies, further growth is expected. This, of course, will depend on how much the Binance platform innovates, in order to attract users and retain the existing ones, so that they don’t migrate to rivals.\n\nBNB/USD Technical Analysis\n\nBullish Momentum Underway on the Daily Chart\n\nThe technical outlook for BNB/USD shows that it is on a bullish momentum. Looking at the daily chart, the cryptocurrency is in a clear uptrend, consisting of higher highs and higher lows. BNB/USD is becoming even more interesting, as the cryptocurrency fell by very small margins compared to its peers in a crypto rout over the weekend, which saw Bitcoin touch a low under $45,000. During the same period, BNB fell to a low of around $230, from above 500. At the time of writing, BNB/USD was trading at $330, and looking up on the daily chart. The trading happened after a quick jump from $515, which is now becoming a reference support area, as prices have tested the level several times. A long bullish pin bar can also be seen towering above the support, indicating that BNB/USD is set to go higher.\n\nBesides this, BNB/USD is supported by the 50-moving average (red) and the 100-moving average (yellow). The support by the moving average for the higher timeline suggests that BNB/USD is poised for higher levels in the long term. However, the 20-moving average (blue) is offering resistance to the current price, although this could change quickly if BNB/USD attracts more buyers. The 20 MA could potentially take BNB/USD slightly lower, before a strong surge, or we may see some days of consolidation before prices go higher.\n\nWeekly Chart -BNB/USD Attempts Rebound from a Developing Support\n\nOn the weekly chart, BNB/USD is seen rebounding from the developing support at $310. All the moving averages are acting as support, in a bullish momentum that has remained in place since the May crash. In particular, we are keen on the 20-moving average, which rose above the price from June to October, as BNB/USD demonstrated a sluggish bullish momentum. The fact that all the moving averages have joined the support for BNB/USD suggests an upside in the price in the medium and long term, although short-term consolidation could prevail, based on the technical pointers on the daily chart.\n\nMonthly Chart BNB/USD Needs to Clear a Hurdle at $320\n\nOn the monthly timeframe, BNB/USD is holding steady at the $300 support, with all the moving averages below it. At the current level, a bullish pin bar is seen forming, but it is not yet complete. Once it is, it could take BNB/USD to higher levels. Nonetheless, the monthly chart shows that the ATH of around $700 is developing as a strong resistance for the cryptocurrency. The price was resisted at that level in early May, before the crash, and subsequently, once again in November. The price is now taking a breather from the ATH. It is trading within a range, while remaining above the $515 to $519 support zone. Therefore, $700 is the most immediate hurdle that BNB/USD needs to clear before we see a strong surge, potentially in the early or first half of next year. Remember, we project $500 as the potential price floor for 2023, as any break above this level could see it turn into support and become a reference point for next year’s prices."
    }
]