[
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vd3d3LmJiYy5jby51ay9uZXdzL3VrLWVuZ2xhbmQtbGluY29sbnNoaXJlLTY1OTUxMDQy0gE_aHR0cHM6Ly93d3cuYmJjLmNvLnVrL25ld3MvdWstZW5nbGFuZC1saW5jb2xuc2hpcmUtNjU5NTEwNDIuYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "Boston: Special school plan for bed and breakfast - BBC",
        "content": "A bed and breakfast in Boston could be transformed into a school for children with special needs.\n\nThe owners of the Boston Lodge on Brown's Drove have submitted the plans to Boston Borough Council.\n\nThey said the school would support young people with learning obstacles such as Autism Spectrum Disorder (ASD).\n\nIt would have the capacity to accommodate about 40 pupils, aged between five and 16, and 30 members of staff.\n\nAccording to the Local Democracy Reporting Service, the plan states: \"The change of use is for educational purposes to serve as a school catering for pupils with special educational needs with each child having an Education, Health and Care Plan (EHCP).\"\n\nSchool hours are planned to run from 08.45 to 15:00, with staff working from 07:30 to 17:30.\n\nIt would be registered with the Department for Education (DFE) and subject to inspection by Ofsted.\n\nIf approved, the school will cover a broad spectrum of subjects including mathematics, science, expressive arts and PE, all while keeping a strong emphasis on reading and literacy.\n\nThe plans state the classes would be small with learning broken down into \"small achievable parts\".\n\n\"Reading and literacy will be at the core of the school, if a child cannot read and comprehend then they cannot access the wider world and will be further disadvantaged as they prepare for the adult world and community at large,\" they added.\n\nMinor construction work would include internal alterations to make some rooms larger and increase the width of corridors.\n\nA date for councillors to consider the application has not been set."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vdW5jaGFpbmVkY3J5cHRvLmNvbS9ibmItY2hhaW4tcmVsZWFzZWQtbGF5ZXItMi1ldm0tdGVzdG5ldC1iYXNlZC1vbi1vcHRpbWlzbS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "BNB Chain Released Layer 2 EVM Testnet Based on Optimism - Unchained - Unchained",
        "content": "Developers claim that the Layer 2 scaling solution will support 4000 transfers transactions per second at a cost lower than $0.005.\n\nBNB Chain, the Layer 1 network created by Binance in 2017, has unveiled a testnet of a Layer 2 solution that it calls the “answer to the scalability challenge” that has thus far limited mass adoption of blockchain technology.\n\nopBNB leverages the power of the BNB Smart Chain infrastructure, providing developers with a robust toolset to achieve high throughput, low fees, and seamless scalability. This Layer 2 solution unlocks limitless possibilities for decentralized applications. — BNB Chain (@BNBCHAIN) June 19, 2023\n\nThe opBNB solution is an Ethereum Virtual Machine (EVM) compatible chain that utilizes Optimism’s OP Stack. The technology is built on Optimistic Rollups, which reduces the computational load on blockchains by batching transactions together off-chain before submitting them to the main network.\n\nEarlier this year, Coinbase also unveiled its own Layer 2 solution ‘Base’ that is built on Optimism’s open source developer toolkit.\n\n“One key aspect that makes opBNB technically different is the optimisation of data accessibility, the caching layer and adjusting the submission process algorithm to allow simultaneous operations. All this enables opBNB to reach a gas limit up to 100M,” BNB Chain developers explained in a tweet on Monday.\n\nThe developers also expect that these new features will let opBNB deliver transaction speeds of 4000 transactions per second (TPS) and an average transaction cost that is lower than $0.005.\n\nThis boost to scalability will be particularly attractive for applications with a large number of daily active users that will be less concerned with network congestion issues.\n\nBNB Chain is the third largest network after Ethereum and Tron, with over $3.3 billion in Total Value Locked and over a million daily active users."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiL2h0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZ2FpbnMtZXRoZXItcmlzZXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin gains ground, Ether rises, Solana leads winners, BNB little-changed to lower - Forkast News",
        "content": "Bitcoin rose in Tuesday morning trading in Asia to hold above support at US$26,000. Ether also logged gains along with most other top 10 non-stablecoin cryptocurrencies. Binance’s BNB token was little changed to lower on signs the world’s largest crypto exchange may be winding down its expansion in Europe amid widespread regulatory woes. Equity futures in the U.S. edged lower after the long weekend break, recent mixed signals on the state of inflation, and speculation about more interest rate hikes by the Federal Reserve.\n\nCrypto\n\nBitcoin rose 1.41% over the last 24 hours to US$26,765 at 07:00 a.m. in Hong Kong, moving up 3.21% for the past seven days, according to data from CoinMarketCap. The world’s largest cryptocurrency reached a weekly high of US$26,984 early Tuesday to test resistance at US$27,000.\n\nEther gained 0.86% to US$1,734, but has flatlined over the past seven days to log a weekly loss of 0.48%. Solana led the winners in the top 10, rising 3.76% to US$15.95 and up 4.95% for the week.\n\nMost other top 10 non-stablecoin tokens moved higher in early morning trade. However, Binance’s BNB posted a dip of 0.25% to US$242.87, though the token is still holding onto a weekly gain of 5.38%. The Binance exchange seems to be reining in its global expansion plans amid growing regulation challenges.\n\nBinance Markets Ltd, the U.K. subsidiary of Binance, can no longer “provide regulated activities and products” for non crypto-related activities in the country, according to a Monday posting on the website of the country’s Financial Conduct Authority (FCA). According to reports, Binance had permission to provide such services in the U.K. but had requested to the FCA it be withdrawn as they were unlikely to be used.\n\nApart from the ongoing lawsuit with U.S. regulators, Binance is also facing challenges in Europe. The company on Friday said it will withdraw from the Netherlands after being unable to secure a virtual asset service provider registration in the country. The crypto exchange is also reportedly under an anti-money laundering probe in France.\n\nDigital asset investment products saw an outflow of US$5.1 million last week, according to data tracked by Europe-based cryptocurrency investment firm CoinShares on Monday. The data marks the ninth consecutive week of outflows, while the number is smaller than US$88 million in the previous week after the world’s biggest asset manager BlackRock filed for a spot Bitcoin ETF.\n\n“(BlackRock’s) move also conveys a compelling message to the SEC, implying a firm stand on the importance and role of cryptocurrencies in future financial innovation in the U.S,” Rachel Lin, the co-founder and chief executive officer of crypto derivatives exchange SynFutures, said in an emailed comment.\n\nBlackRock’s Bitcoin ETF efforts could be a sign of a major crypto trader migration, according to Markus Thielen, Head of Crypto Research & Strategy at digital asset service platform Matrixport.\n\n“There are now 420 million cryptocurrency holders; migrating them to regulated entities might be the most significant task in 2023 mainly because fighting those crypto companies with deep pockets is also very time-consuming for regulators,” said Thielen in an emailed comment. “Ripple Labs has spent $200m on its lawsuit with the SEC, while Coinbase, especially Binance, could spend billions. So why not approve the Blackrock ETF and let nature play is part?”\n\nCoinShares indicated the slump in prices of many tokens had brought in some bargain-hunting. “The prior week crash in altcoin prices prompted investors to add to positions (in altcoin-linked investment products),” wrote CoinShares in its Monday report, “with XRP, Cardano and Polygon being the focus.”\n\nThe total cryptocurrency market cap rose 0.86% to US$1.07 trillion in the last 24 hours, while crypto trading volume rose 35.69% to US$26.74 billion, according to CoinMarketCap data.\n\nNFT transactions rise\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index dipped 0.17% to 2,868.69 in the 24 hours to 09:20 a.m. in Hong Kong. The index is down 3.36% for the seven days.\n\nNFT transactions on Ethereum rose 6.74% in the past 24 hours to US$13.16 million, according to CryptoSlam data. Transactions on the Bitcoin blockchain surged 135.38% to US$3.43 million, while the Polygon and Cardano networks also logged two-digit gains in NFT transactions.\n\n“Forkast 500 NFT Index along with Ethereum, Solana, Polygon, and Cardano are all close to even, which may be a sign that the market has finished reacting to the SEC’s lawsuits against Binance and Coinbase,” said Yehudah Petscher, NFT Strategist at Forkast Labs, the parent company of Forkast.News.\n\n“Sneakerhunt”, a teased collaboration between Nike’s NFT platform .SWOOSH and online video game Fortnite is set to be unveiled on Tuesday, which might bring more public exposure to NFTs.\n\n“This may be a huge week for NFTs after Nike’s tease about an incoming in-game sneaker event in Fortnite,” said Petscher. “Many speculate that it’s Nike’s .SWOOSH shoes that may be the prize at the end of the hunt, titled Airphoria. With Fornite’s 242+ million strong userbase, this could end up being another mass onboarding event for NFTs.”\n\nElsewhere, CryptoPunk #8611 of the Ethereum-based CryptoPunk NFT collection was sold for around US$95,000 on Saturday and immediately burned and “revived” as an Ordinal inscription on the Bitcoin network, with the process directed by NFT enthusiast NatanStein.\n\n“(The action) may be a vote of confidence in the value of assets existing on Bitcoin, but this asset now loses any potential benefits it would have received from Yuga Labs if they were to incorporate it in their Otherside Universe,” said Petscher. “Yuga Labs famously had thousands of $APE Coin claimable for each BAYC NFT, along with land in their Otherside game, and some have speculated that CryptoPunks may one day see their own rewards.”\n\nU.S. futures lower\n\nFederal Reserve Chair Jerome Powell|Image: Getty Images\n\nU.S. stock futures traded lower as of 11.00 a.m. in Hong Kong. Dow Jones Industrial Average futures fell 0.37%, while the S&P 500 and Nasdaq futures both lost 0.22%.\n\nAll the three major U.S. stock indexes logged gains last week as the Federal Reserve left interest rates unchanged at the June 14 meeting, but this was tempered by Fed Chair Jerome Powell, noting “nearly all Committee participants expect that it will be appropriate to raise interest rates somewhat further by the end of the year.”\n\nThe Fed projects the interest rate to reach 5.6% in 2023, indicating two more rate hikes within the year. New York Fed President John Williams will be speaking on Tuesday in the U.S. and may make further comments on the Fed’s fight with inflation.\n\nOn the economic data front, the U.S. housing market index, a measurement of homebuilder sentiment, reached an 11-month high of 55 in June to beat analysts’ expectations, according to Bloomberg on Monday. Readings above 50 indicate more housebuilders see the market condition good than bad.\n\nU.S. interest rates are now between 5% and 5.25%, the highest since 2006, and the Federal Reserve’s next meeting on rates is July 26. The CME FedWatch Tool predicts a 25.6% chance the Fed will keep rates unchanged in July, and a 74.4% chance for another 25-basis-point rate hike, up from 71.9% on Monday.\n\nChina’s central bank lowered its one-year and five-year loan prime rates to 3.55% and 4.2% on Tuesday as economists expected, as the country seeks to boost its slow post-Covid recovery, according to the Financial Times on Tuesday.\n\n(Updates with equities section.)"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMikgFodHRwczovL3d3dy5sYXVnaGluZ3BsYWNlLmNvbS93L2FydGljbGVzLzIwMjMvMDYvMjAvaW50ZXJ2aWV3LWNocmlzdHktY2FybHNvbi1yb21hbm8tYW5kLWFubmVsaWVzZS12YW4tZGVyLXBvbC1yZXVuaXRlLWZvci1ibmItcG9kY2FzdC1mcm9tLXBvZGNvL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "Interview: Christy Carlson Romano and Anneliese van der Pol Reunite for \"BNB Podcast\" from PodCo - LaughingPlace ... - Laughing Place",
        "content": "If you grew up with Disney Channel in the early 2000s, then Christy Carlson Romano and Anneliese van der Pol need no introduction. As the stars of Even Stevens and That’s So Raven, these gal-pals seldomly worked together but certainly ran in the same circles. They even shared the role of Belle in Beauty and the Beast on Broadway towards the end of the show’s run. Following a guest appearance on the PodCo podcast Vulnerable with Christy Carlson Romano, Anneliese and Christy decided to join forces on an upcoming recurring show called the BNB Podcast. Shortly after making the announcement, I had the honor of speaking with both of them at ATX TV Fest, which concluded with a panel discussion with three of PodCo’s shows.\n\nAlex: In the episode of Vulnerable with Christy Carlson Romano that Anneliese was a guest on, you mentioned getting to work together when you were both on Disney Channel on projects like the Disney Channel Circle of Stars “Circle of Life” music video. Now you’re launching your own PodCo show together, the BNB Podcast. Can you tell me about getting together for this new show?\n\nChristy Carlson Romano: We reconnected, but were looking for a reason to get back together or connect in a way that we haven't been able to. And I am just so excited about Big Name B****es (BNB) because with Vulnerable, it's such a wonderful, safe space for folks to come on, and us to reconnect or connect. And it's kind of sad sometimes. I don't want to be sad. I want to have fun, go to brunch with my girlfriend, and laugh. And so, that's what we are going to do too.\n\nAnneliese van der Pol: We do. We're going to have guests. We can talk about what's current, and then also what's not, the juxtaposition of our similarities in Disney Channel and Broadway and Beauty and the Beast.\n\nChristy Carlson Romano: But as people, I'm a mom, and she's…\n\nAnneliese van der Pol: Not. Stop it. How dare you do this to me.\n\nChristy Carlson Romano: And she's childless.\n\nAnneliese van der Pol: And she's childless. And she's still struggling to get married.\n\nChristy Carlson Romano: Actually, no. She still has her core muscles. And I pee myself when I sneeze.\n\nAlex: Speaking of Broadway, on that episode of Vulnerable, you both swapped stories of playing Belle in Beauty and the Beast. Will that be a big part of the BNB Podcast?\n\nChristy Carlson Romano: Oh, we're going to have fun. Something that's so wonderful is that I'm terrified of singing. And if there's anybody that I know that's probably not terrified, it's her. She loves to sing. I love her voice more than anyone. I'm a huge, huge fan of her talent, and I always have been. And I've told her that too, like on Vulnerable. But I mean it, and it's like a dream for me to work with her.\n\nAnneliese van der Pol: Thank you, Christy. Yeah, I think we'll break out into songs.\n\nChristy Carlson Romano: We're going to sing a lot, yeah. She's going to bring me out of my shell.\n\nAlex: You both sang a little bit in that episode and it lit a fire within my gay self.\n\nChristy Carlson Romano: Well, we're going to be there for our gays.\n\nAnneliese van der Pol: Yeah, I really think that's why I was saying, \"We got to sing.\" I mean, I love that you said that, and we want to cater to our audience.\n\nChristy Carlson Romano: You better sing all the Judy Garland.\n\nAnneliese van der Pol: All the Judy Garland. But at the same time, it is hard because you want to reach the masses, and it's not the masses who love musical theater, so we have to be careful to not just make it a musical theater show.\n\nChristy Carlson Romano: It is. Yeah.\n\nAnneliese van der Pol: We're going to figure it out. And we will as we go.\n\nAlex: Speaking of music, Anneliese, your cover of “Candle on the Water” is one of my favorites. And Christy, my sister had your greatest hits album and we would bop to it all the time.\n\nChristy Carlson Romano: Oh, yeah. Because, I needed a greatest hits album. It was because Disney didn't want to give me a record deal.\n\nAlex: I say own it. Who else has a greatest hits album without having another album? Only you.\n\nAnneliese van der Pol: What is that? Like greatest hits of Disney?\n\nChristy Carlson Romano: So basically, they kept using me for different songs in different albums. And then, I came to them because we really loved Phil Guerini. Loved him, thought he was a great guy. Phil Guerini, he used to work at the parks, and then he became the president of Radio Disney. But before that, he was at Disney Records. And so, he was like the company man. And he was a sweetheart, and I loved him very much. And then, now, he's the president of Jonas Brothers Music, so he's really found his career. But he was a good guy. Phil Guerini was one of the only people that I felt like was a true Disney magic believer and advocate. So something that I think that is a misconception is that if we start talking about our Disney experience in any other way than a very narrow set of sentence structure, it's negative. It's not. We absolutely love Disney. I mean, [Anneliese] literally just came off tour with Disney Princesses.\n\nAlex: I saw you in Las Vegas. It was awesome.\n\nAnneliese van der Pol: You did? Oh my God. You were in Vegas. That was a fun time, where they put us up and everything. We had fun in Vegas.\n\nChristy Carlson Romano: I feel like Disney magic is so real. Disney magic is out there for everyone to fully enjoy when they make it for themselves, and they go to the parks, and they have fun. And I still very much believe in it with my kids. And I know you believe in it if you're performing all the Disney Princess songs\n\nAnneliese van der Pol: Yeah, and it's believing, as cheesy as it sounds. Their theme, and what we say to the kids, and everything from Disney Princesses is that dreams really do come true. That cheesy sentiment. But they do. They really do. And so many of our dreams have come through. I don't know. It's just crazy that your dreams really can come true on the smallest scale to a really big, huge scale.\n\nChristy Carlson Romano: Yeah. And that's what's happening, is that Disney has raised a generation of talent that has grown up, and went off to college, went out to school, whatever they did. They went off and lived their lives, and now they're coming back to each other, and finding that Disney magic with each other again.\n\nAnneliese van der Pol: Yes. It's crazy how universal Disney is.\n\nChristy Carlson Romano: Yeah. We love Disney. We love it. I think we love Disney magic is what I would say. When you say we love Disney.\n\nAlex:\n\nOne of the things I love about hearing your stories is that when I was watching Even Stevens and That's So Raven, I had this perception that as an actor on a Disney show, you must be set for life. Like they must’ve provided you with housing and clothes and transportation. It’s so demystifying to learn that this wasn’t the case.\n\nChristy Carlson Romano: I wonder how we got to that as a society.\n\nAnneliese van der Pol: Well, did we think that when we were watching TGIF?\n\nChristy Carlson Romano: No, I didn't. When I was watching them on TV, I wasn't thinking that.\n\nAnneliese van der Pol: But maybe because we were already in musical theater and already acting and already working.\n\nChristy Carlson Romano: And we knew it wasn't much.\n\nAlex: You were industry babies.\n\nAnneliese van der Pol: There's so many people who tell me that. So many people who think that, who say that. Anybody who's just maybe not in the industry or wasn't in the industry yet. That's so funny to me. It wasn't horrible, but we weren't rich by any means.\n\nChristy Carlson Romano: Well, it's branding. And Disney was extremely good at branding and making it feel aspirational. And all that kids were wanting to be was us.\n\nAnneliese van der Pol: It's so interesting. I was saying it is so universal too. Because when I do the Disney Princess concert, I do it all over the world. And sometimes, we'll go to Dubai, the Middle East. We're supposed to go to Poland and Australia.\n\nChristy Carlson Romano: Your people.\n\nAnneliese van der Pol: Yeah, my people. I don't know if I'm going to go, though, because it's a lot. It's really hard. I'm Dutch, which is near it. But it's crazy how universal is it. It's Disney. The kids there, it doesn't even matter if it's a sexist country or what. Even if politics are different, everybody freaking loves Disney.\n\nChristy Carlson Romano: See, it's Disney magic. It's Disney magic. I really do feel like, even with what I saw with Haley Bailey at that red carpet, with all the girls and her hugging. And I had to post it. I'm like, \"Disney magic is real,\" and I believe in that. And I believe in it for my girls when we go, and I start to cry at the little salon. We went to the little salon.\n\nAlex: Bibbidi Bobbidi Boutique?\n\nChristy Carlson Romano: Yes. And I was a mess.\n\nAnneliese van der Pol: The messages are great. It's great to believe in those dreams. But it's also great to tell the truth. Sometimes, it lacks that little … Wasn't it, who said it, Elizabeth Olsen recently about Marvel? Did you hear what she said about doing Marvel? Which is Disney, of course. She said, \"If you ever do a Marvel movie, make sure you only sign up for one.\"\n\nChristy Carlson Romano: That's actually really smart. So AKA, don't do a Marvel movie?\n\nAnneliese van der Pol: That's exactly what she said. She said it took over her life, and it's awful. She can't do anything else for seven years. She was basically saying she regretted it.\n\nChristy Carlson Romano: And she's an amazing actress. So that's why she's doing TV then, it's non-competitive. Wasn't she just here?\n\nAlex: I know she came to Austin for SXSW.\n\nAnneliese van der Pol: Yes. Do you live here now?\n\nAlex: No, I'm in the California near San Francisco, but not in the city. What’s funny is anytime I’m on a street corner and a trolly goes by, I go “doo-doo-doo-doo-doo-doo-bow-bow” (the That’’s So Raven bumper music).\n\nAnneliese van der Pol: Oh yeah, of course. I always forget, because we were in San Francisco when we were doing That's So Raven. And then we're in Chicago for Raven's Home. And I found out Disney does that with us because they go with the times. They go with politics.\n\nAlex: That was really interesting to learn on your episode of Vulnerable. When you said that, I was thinking, \"Oh, Cory in the House went to Washington when Obama became president.\" The timing of that all lined up.\n\nAnneliese van der Pol: I didn't think that. That's so interesting. Yes. Yes, they did. Yeah, I'm sure it had to do with that. Again, because Disney's about happiness and dreams, and we want to feel unified as much as you can.\n\nAlex: One of your Disney Princess: The Concert cast mates, Aisha Jackson, is playing Snow White in the Britney Spears jukebox musical Once Upon a One More Time on Broadway. I saw the show, which is about fairytale princesses who receive a copy of The Feminine Mystique at their scroll club and they start to become more modern. And I have to say, when it's time for that show to cycle out its cast, nobody would be more perfect than Disney stars like yourselves. And the narrator could be Fairy Godfather Benji.\n\nChristy Carlson Romano: That would be kind of fun.\n\nAnneliese van der Pol: Would you ever do Broadway again?\n\nChristy Carlson Romano: Yeah. But I can't right now. Honestly, I've always said this about theater. I would do Parade. And I would do Parade with [Anneliese] and I'd be Mary Phagan's mom, and she would be Lucille. But other than that, I think I would like to create a character. I would like to originate a character on Broadway just so I could be a part of that process like I did with Parade, originally. But I was so young. As an adult, I don't want to be stunt-casting as much anymore. Stunt casting is kind of very degrading.\n\nAnneliese van der Pol: It's hard to do that because you got to get in out of the ground floor when it's just a reading, when no one knows about it, and the script isn't perfect. It takes years.\n\nChristy Carlson Romano: I know, you're right.\n\nAnneliese van der Pol: I mean, there's other ways too, where it takes years with the person, and then you’re with that person for six months, and then they need somebody. That's not necessarily stunt. It's just a different choice.\n\nChristy Carlson Romano: Yeah, it is. It's a whole thing. It's a whole commitment. And it's kind of ignorant for me to be like, \"You know what? I'm going to go back to theater.\" It's like, \"Will theater have me?\" I mean, that's the thing is the community is very loving, but also they have such great new talent there. And the funny thing is that back in the day, musical theater, was it the two worlds of LA and New York?\n\nAnneliese van der Pol: Oh, I know.\n\nChristy Carlson Romano: Musical theater was persona non grata. But because of Glee and High School Musical, and because of all the musical elements now that are so one-for-one, I mean, Pamela Anderson was in Chicago. You know what I mean? Was she good? Was she good? I hope she was good.\n\nAlex: I actually got to see it with her. She was good. I was not expecting much because it was her first time even doing musical theater, to my knowledge. Her performance wasn’t as fluid and polished as your typical theater actor, but she wasn’t terrible.\n\nChristy Carlson Romano: She [must’ve been] terrified, that's what it was.\n\nAlex: I'm sure she was. And it was interesting to hear you both talk about beta blockers on Vulnerable.\n\nChristy Carlson Romano: Oh, I love that we talked about that.\n\nAnneliese van der Pol: I know. It's so true. After I took out my girlfriend, Anna Aimee White, who's done a bunch of these with theater, when I was talking, she's like, \"Gosh, Liese, you made it sound like we all do beta blockers.\" I was like, \"Did I?\" And she's like, \"Yeah.\" She's like, \"I love the excitement. I love the nerves.\"\n\nChristy Carlson Romano: I don't think you made anything sound any way.\n\nAnneliese van der Pol: No, I said, \"I was talking to Christy, who is a very good singer and talented artist, but has a block, and this would really help her.\" I was glad I said something.\n\nAlex: I mean, if your heart's pounding like that, you can't perform.\n\nAnneliese van der Pol: Yes. And you don't have to take them forever. They're non-addictive. You just get through the first couple of shows, and then you're like, \"Oh wait, I can do this.\" But that first night of when I did Beauty and the Beast, my opening night, was [so] terrifying.\n\nChristy Carlson Romano: You have to dissociate.\n\nAnneliese van der Pol: Yes. It was horrible. I don't remember any of it. I just wanted off-stage. The second night was better, and then the third night, I was fine. But that first night was horrible.\n\nChristy Carlson Romano: The thing that I would do is I would dissociate, and I have to focus so hard on my performance, the moves, and hitting all my marks. I would want to be the best. I don't know. You fail nightly at least 1 to 10 times when you're performing. And then, I've heard that winners have amnesia, but I was not winning every night. I was like, \"Oh, I [messed] so much up.\" I will say that the Beauty and the Beast people were rooting for me to succeed. And I think it was because they were at 50% capacity when I came in. And then, it was like, I'm sure you did the same thing, was boost up their sales.\n\nAlex: It’s all so revelatory. I could talk to you both all day, but I understand we’re out of time. I can’t wait to hear what you have cooking up for fans with the BNB Podcast.\n\nAnneliese van der Pol: You're so welcome. You're so welcome.\n\nChristy Carlson Romano: Drive home sare.\n\nNew episodes of Vulnerable with Christy Carlson Romano drop on Tuesdays, and Christy Carlson Romano can also be heard on Thursdays with the Even Stevens rewatch podcast, Even More Stevens. Stay tuned to PodCo for more news about the upcoming BNB Podcast with Christy Carlson Romano and Anneliese van der Pol."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMikgFodHRwczovL3d3dy5sYXVnaGluZ3BsYWNlLmNvbS93L2FydGljbGVzLzIwMjMvMDYvMjAvaW50ZXJ2aWV3LWNocmlzdHktY2FybHNvbi1yb21hbm8tYW5kLWFubmVsaWVzZS12YW4tZGVyLXBvbC1yZXVuaXRlLWZvci1ibmItcG9kY2FzdC1mcm9tLXBvZGNvL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Jun 2023 07:00:00 GMT",
        "title": "Interview: Christy Carlson Romano and Anneliese van der Pol Reunite for \"BNB Podcast\" from PodCo - LaughingPlace ... - Laughing Place",
        "content": "If you grew up with Disney Channel in the early 2000s, then Christy Carlson Romano and Anneliese van der Pol need no introduction. As the stars of Even Stevens and That’s So Raven, these gal-pals seldomly worked together but certainly ran in the same circles. They even shared the role of Belle in Beauty and the Beast on Broadway towards the end of the show’s run. Following a guest appearance on the PodCo podcast Vulnerable with Christy Carlson Romano, Anneliese and Christy decided to join forces on an upcoming recurring show called the BNB Podcast. Shortly after making the announcement, I had the honor of speaking with both of them at ATX TV Fest, which concluded with a panel discussion with three of PodCo’s shows.\n\nAlex: In the episode of Vulnerable with Christy Carlson Romano that Anneliese was a guest on, you mentioned getting to work together when you were both on Disney Channel on projects like the Disney Channel Circle of Stars “Circle of Life” music video. Now you’re launching your own PodCo show together, the BNB Podcast. Can you tell me about getting together for this new show?\n\nChristy Carlson Romano: We reconnected, but were looking for a reason to get back together or connect in a way that we haven't been able to. And I am just so excited about Big Name B****es (BNB) because with Vulnerable, it's such a wonderful, safe space for folks to come on, and us to reconnect or connect. And it's kind of sad sometimes. I don't want to be sad. I want to have fun, go to brunch with my girlfriend, and laugh. And so, that's what we are going to do too.\n\nAnneliese van der Pol: We do. We're going to have guests. We can talk about what's current, and then also what's not, the juxtaposition of our similarities in Disney Channel and Broadway and Beauty and the Beast.\n\nChristy Carlson Romano: But as people, I'm a mom, and she's…\n\nAnneliese van der Pol: Not. Stop it. How dare you do this to me.\n\nChristy Carlson Romano: And she's childless.\n\nAnneliese van der Pol: And she's childless. And she's still struggling to get married.\n\nChristy Carlson Romano: Actually, no. She still has her core muscles. And I pee myself when I sneeze.\n\nAlex: Speaking of Broadway, on that episode of Vulnerable, you both swapped stories of playing Belle in Beauty and the Beast. Will that be a big part of the BNB Podcast?\n\nChristy Carlson Romano: Oh, we're going to have fun. Something that's so wonderful is that I'm terrified of singing. And if there's anybody that I know that's probably not terrified, it's her. She loves to sing. I love her voice more than anyone. I'm a huge, huge fan of her talent, and I always have been. And I've told her that too, like on Vulnerable. But I mean it, and it's like a dream for me to work with her.\n\nAnneliese van der Pol: Thank you, Christy. Yeah, I think we'll break out into songs.\n\nChristy Carlson Romano: We're going to sing a lot, yeah. She's going to bring me out of my shell.\n\nAlex: You both sang a little bit in that episode and it lit a fire within my gay self.\n\nChristy Carlson Romano: Well, we're going to be there for our gays.\n\nAnneliese van der Pol: Yeah, I really think that's why I was saying, \"We got to sing.\" I mean, I love that you said that, and we want to cater to our audience.\n\nChristy Carlson Romano: You better sing all the Judy Garland.\n\nAnneliese van der Pol: All the Judy Garland. But at the same time, it is hard because you want to reach the masses, and it's not the masses who love musical theater, so we have to be careful to not just make it a musical theater show.\n\nChristy Carlson Romano: It is. Yeah.\n\nAnneliese van der Pol: We're going to figure it out. And we will as we go.\n\nAlex: Speaking of music, Anneliese, your cover of “Candle on the Water” is one of my favorites. And Christy, my sister had your greatest hits album and we would bop to it all the time.\n\nChristy Carlson Romano: Oh, yeah. Because, I needed a greatest hits album. It was because Disney didn't want to give me a record deal.\n\nAlex: I say own it. Who else has a greatest hits album without having another album? Only you.\n\nAnneliese van der Pol: What is that? Like greatest hits of Disney?\n\nChristy Carlson Romano: So basically, they kept using me for different songs in different albums. And then, I came to them because we really loved Phil Guerini. Loved him, thought he was a great guy. Phil Guerini, he used to work at the parks, and then he became the president of Radio Disney. But before that, he was at Disney Records. And so, he was like the company man. And he was a sweetheart, and I loved him very much. And then, now, he's the president of Jonas Brothers Music, so he's really found his career. But he was a good guy. Phil Guerini was one of the only people that I felt like was a true Disney magic believer and advocate. So something that I think that is a misconception is that if we start talking about our Disney experience in any other way than a very narrow set of sentence structure, it's negative. It's not. We absolutely love Disney. I mean, [Anneliese] literally just came off tour with Disney Princesses.\n\nAlex: I saw you in Las Vegas. It was awesome.\n\nAnneliese van der Pol: You did? Oh my God. You were in Vegas. That was a fun time, where they put us up and everything. We had fun in Vegas.\n\nChristy Carlson Romano: I feel like Disney magic is so real. Disney magic is out there for everyone to fully enjoy when they make it for themselves, and they go to the parks, and they have fun. And I still very much believe in it with my kids. And I know you believe in it if you're performing all the Disney Princess songs\n\nAnneliese van der Pol: Yeah, and it's believing, as cheesy as it sounds. Their theme, and what we say to the kids, and everything from Disney Princesses is that dreams really do come true. That cheesy sentiment. But they do. They really do. And so many of our dreams have come through. I don't know. It's just crazy that your dreams really can come true on the smallest scale to a really big, huge scale.\n\nChristy Carlson Romano: Yeah. And that's what's happening, is that Disney has raised a generation of talent that has grown up, and went off to college, went out to school, whatever they did. They went off and lived their lives, and now they're coming back to each other, and finding that Disney magic with each other again.\n\nAnneliese van der Pol: Yes. It's crazy how universal Disney is.\n\nChristy Carlson Romano: Yeah. We love Disney. We love it. I think we love Disney magic is what I would say. When you say we love Disney.\n\nAlex:\n\nOne of the things I love about hearing your stories is that when I was watching Even Stevens and That's So Raven, I had this perception that as an actor on a Disney show, you must be set for life. Like they must’ve provided you with housing and clothes and transportation. It’s so demystifying to learn that this wasn’t the case.\n\nChristy Carlson Romano: I wonder how we got to that as a society.\n\nAnneliese van der Pol: Well, did we think that when we were watching TGIF?\n\nChristy Carlson Romano: No, I didn't. When I was watching them on TV, I wasn't thinking that.\n\nAnneliese van der Pol: But maybe because we were already in musical theater and already acting and already working.\n\nChristy Carlson Romano: And we knew it wasn't much.\n\nAlex: You were industry babies.\n\nAnneliese van der Pol: There's so many people who tell me that. So many people who think that, who say that. Anybody who's just maybe not in the industry or wasn't in the industry yet. That's so funny to me. It wasn't horrible, but we weren't rich by any means.\n\nChristy Carlson Romano: Well, it's branding. And Disney was extremely good at branding and making it feel aspirational. And all that kids were wanting to be was us.\n\nAnneliese van der Pol: It's so interesting. I was saying it is so universal too. Because when I do the Disney Princess concert, I do it all over the world. And sometimes, we'll go to Dubai, the Middle East. We're supposed to go to Poland and Australia.\n\nChristy Carlson Romano: Your people.\n\nAnneliese van der Pol: Yeah, my people. I don't know if I'm going to go, though, because it's a lot. It's really hard. I'm Dutch, which is near it. But it's crazy how universal is it. It's Disney. The kids there, it doesn't even matter if it's a sexist country or what. Even if politics are different, everybody freaking loves Disney.\n\nChristy Carlson Romano: See, it's Disney magic. It's Disney magic. I really do feel like, even with what I saw with Haley Bailey at that red carpet, with all the girls and her hugging. And I had to post it. I'm like, \"Disney magic is real,\" and I believe in that. And I believe in it for my girls when we go, and I start to cry at the little salon. We went to the little salon.\n\nAlex: Bibbidi Bobbidi Boutique?\n\nChristy Carlson Romano: Yes. And I was a mess.\n\nAnneliese van der Pol: The messages are great. It's great to believe in those dreams. But it's also great to tell the truth. Sometimes, it lacks that little … Wasn't it, who said it, Elizabeth Olsen recently about Marvel? Did you hear what she said about doing Marvel? Which is Disney, of course. She said, \"If you ever do a Marvel movie, make sure you only sign up for one.\"\n\nChristy Carlson Romano: That's actually really smart. So AKA, don't do a Marvel movie?\n\nAnneliese van der Pol: That's exactly what she said. She said it took over her life, and it's awful. She can't do anything else for seven years. She was basically saying she regretted it.\n\nChristy Carlson Romano: And she's an amazing actress. So that's why she's doing TV then, it's non-competitive. Wasn't she just here?\n\nAlex: I know she came to Austin for SXSW.\n\nAnneliese van der Pol: Yes. Do you live here now?\n\nAlex: No, I'm in the California near San Francisco, but not in the city. What’s funny is anytime I’m on a street corner and a trolly goes by, I go “doo-doo-doo-doo-doo-doo-bow-bow” (the That’’s So Raven bumper music).\n\nAnneliese van der Pol: Oh yeah, of course. I always forget, because we were in San Francisco when we were doing That's So Raven. And then we're in Chicago for Raven's Home. And I found out Disney does that with us because they go with the times. They go with politics.\n\nAlex: That was really interesting to learn on your episode of Vulnerable. When you said that, I was thinking, \"Oh, Cory in the House went to Washington when Obama became president.\" The timing of that all lined up.\n\nAnneliese van der Pol: I didn't think that. That's so interesting. Yes. Yes, they did. Yeah, I'm sure it had to do with that. Again, because Disney's about happiness and dreams, and we want to feel unified as much as you can.\n\nAlex: One of your Disney Princess: The Concert cast mates, Aisha Jackson, is playing Snow White in the Britney Spears jukebox musical Once Upon a One More Time on Broadway. I saw the show, which is about fairytale princesses who receive a copy of The Feminine Mystique at their scroll club and they start to become more modern. And I have to say, when it's time for that show to cycle out its cast, nobody would be more perfect than Disney stars like yourselves. And the narrator could be Fairy Godfather Benji.\n\nChristy Carlson Romano: That would be kind of fun.\n\nAnneliese van der Pol: Would you ever do Broadway again?\n\nChristy Carlson Romano: Yeah. But I can't right now. Honestly, I've always said this about theater. I would do Parade. And I would do Parade with [Anneliese] and I'd be Mary Phagan's mom, and she would be Lucille. But other than that, I think I would like to create a character. I would like to originate a character on Broadway just so I could be a part of that process like I did with Parade, originally. But I was so young. As an adult, I don't want to be stunt-casting as much anymore. Stunt casting is kind of very degrading.\n\nAnneliese van der Pol: It's hard to do that because you got to get in out of the ground floor when it's just a reading, when no one knows about it, and the script isn't perfect. It takes years.\n\nChristy Carlson Romano: I know, you're right.\n\nAnneliese van der Pol: I mean, there's other ways too, where it takes years with the person, and then you’re with that person for six months, and then they need somebody. That's not necessarily stunt. It's just a different choice.\n\nChristy Carlson Romano: Yeah, it is. It's a whole thing. It's a whole commitment. And it's kind of ignorant for me to be like, \"You know what? I'm going to go back to theater.\" It's like, \"Will theater have me?\" I mean, that's the thing is the community is very loving, but also they have such great new talent there. And the funny thing is that back in the day, musical theater, was it the two worlds of LA and New York?\n\nAnneliese van der Pol: Oh, I know.\n\nChristy Carlson Romano: Musical theater was persona non grata. But because of Glee and High School Musical, and because of all the musical elements now that are so one-for-one, I mean, Pamela Anderson was in Chicago. You know what I mean? Was she good? Was she good? I hope she was good.\n\nAlex: I actually got to see it with her. She was good. I was not expecting much because it was her first time even doing musical theater, to my knowledge. Her performance wasn’t as fluid and polished as your typical theater actor, but she wasn’t terrible.\n\nChristy Carlson Romano: She [must’ve been] terrified, that's what it was.\n\nAlex: I'm sure she was. And it was interesting to hear you both talk about beta blockers on Vulnerable.\n\nChristy Carlson Romano: Oh, I love that we talked about that.\n\nAnneliese van der Pol: I know. It's so true. After I took out my girlfriend, Anna Aimee White, who's done a bunch of these with theater, when I was talking, she's like, \"Gosh, Liese, you made it sound like we all do beta blockers.\" I was like, \"Did I?\" And she's like, \"Yeah.\" She's like, \"I love the excitement. I love the nerves.\"\n\nChristy Carlson Romano: I don't think you made anything sound any way.\n\nAnneliese van der Pol: No, I said, \"I was talking to Christy, who is a very good singer and talented artist, but has a block, and this would really help her.\" I was glad I said something.\n\nAlex: I mean, if your heart's pounding like that, you can't perform.\n\nAnneliese van der Pol: Yes. And you don't have to take them forever. They're non-addictive. You just get through the first couple of shows, and then you're like, \"Oh wait, I can do this.\" But that first night of when I did Beauty and the Beast, my opening night, was [so] terrifying.\n\nChristy Carlson Romano: You have to dissociate.\n\nAnneliese van der Pol: Yes. It was horrible. I don't remember any of it. I just wanted off-stage. The second night was better, and then the third night, I was fine. But that first night was horrible.\n\nChristy Carlson Romano: The thing that I would do is I would dissociate, and I have to focus so hard on my performance, the moves, and hitting all my marks. I would want to be the best. I don't know. You fail nightly at least 1 to 10 times when you're performing. And then, I've heard that winners have amnesia, but I was not winning every night. I was like, \"Oh, I [messed] so much up.\" I will say that the Beauty and the Beast people were rooting for me to succeed. And I think it was because they were at 50% capacity when I came in. And then, it was like, I'm sure you did the same thing, was boost up their sales.\n\nAlex: It’s all so revelatory. I could talk to you both all day, but I understand we’re out of time. I can’t wait to hear what you have cooking up for fans with the BNB Podcast.\n\nAnneliese van der Pol: You're so welcome. You're so welcome.\n\nChristy Carlson Romano: Drive home sare.\n\nNew episodes of Vulnerable with Christy Carlson Romano drop on Tuesdays, and Christy Carlson Romano can also be heard on Thursdays with the Even Stevens rewatch podcast, Even More Stevens. Stay tuned to PodCo for more news about the upcoming BNB Podcast with Christy Carlson Romano and Anneliese van der Pol."
    }
]