[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8venljcnlwdG8uY29tL2JpdGNvaW4tcHJpY2UtZm9ybXMtbG9jYWwtdG9wLW1pbm9yLWNvcnJlY3Rpb24tZXhwZWN0ZWQtcHVuZGl0LWF2ZXJzL9IBXmh0dHBzOi8venljcnlwdG8uY29tL2JpdGNvaW4tcHJpY2UtZm9ybXMtbG9jYWwtdG9wLW1pbm9yLWNvcnJlY3Rpb24tZXhwZWN0ZWQtcHVuZGl0LWF2ZXJzLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Price Forms “Local Top”, Minor Correction Expected, Pundit Avers - ZyCrypto",
        "content": "Advertisement\n\nAfter a steady decline since Wednesday, Bitcoin traded flatly throughout the weekend despite recovering slightly on Saturday. In the past week, the leading cryptocurrency by market capitalization has lost over 8% of its value. At press time, BTC was trading at $27,644, up 1.27% in the past 24 hours, as per CoinMarketCap data.\n\nBTCUSD Chart by TradingView\n\nWhy is Bitcoin Falling?\n\nApart from crypto-industry-focused uncertainties that have afflicted the wider digital asset market, Bitcoin’s gradual descent can be attributed to the selling activities of miners.\n\nOn Sunday, “Tarek”, an analyst for Cryptoquant, noted that Bitcoin’s drop has brought its price closer to the cost of mining, which is currently around $27,200. This has prompted miners to offload their coins, resulting in downward pressure on the cryptocurrency’s value.\n\n“We notice an increase in the miner outflow index and the selling index of miners, along with a decrease in miners’ reserve. All of this indicates selling pressure from miners during the past few days,” he wrote, sharing a Bitcoin Miners Position Index (MPI) chart, which has been increasing.\n\nHe, however, advised investors against panicking, noting that he expects the selling pressure to subside around $27,200-$26,600.\n\nAdvertisement\n\n“Local Top” is in for Bitcoin\n\nJA Maartum, another Cryptoquant analyst, notes the recent uptick in the activity of movement of “ancient” Bitcoin or dormant addresses could signal a “local top” for Bitcoin.\n\nIn trading, a local top refers to a point in an asset’s price chart where the price peaks before starting to decline. This peak represents a level of resistance where the price has trouble breaking through and continuing to rise. After reaching the local top, the price typically retraces, creating a short-term bearish trend.\n\nAccording to Maartum, while it’s rare for dormant addresses to be moving around, considering they are still significantly profitable in dollar terms at current market prices, they occasionally re-enter circulation to take profits.\n\n“This is a rare occurrence, and it typically happens around market tops (when the market crashes) or bottoms (when old Bitcoin capitulates, such as during the FTX crash). And it happened yesterday as well. 6,000 BTC with an age between 7 and 10 years moved. This could be a sign of a local top,” he wrote.\n\nThat said, while Bitcoin has been experiencing a minor correction, various experts expect the cryptocurrency to bounce back soon, considering that most fundamentals remain strong. According to Caleb Franzen, a senior market analyst at Cubic Analytics, Bitcoin needs to reclaim $27,820 to establish a bullish move.\n\nIn a recent post, the pundit highlighted the cryptocurrency’s 12 and 24-month Williams %R oscillators, which he noted are no longer “oversold”. According to him, this has “historically meant that the lows of the BTC bear market are in & that a new bull market is starting.”"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vbWVhd3cuY29tL3doeS13ZXJlLWtvZHktYW5kLXJvYnluLWJyb3duLWF0LW1lcmlzLWJuYi1pbnRlcm5ldC1zbGFtcy1zaXN0ZXItd2l2ZXMtc3Rhci1mb3ItaG9zdGluZy1jb3VwbGXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Apr 2023 07:00:00 GMT",
        "title": "Fans slam Meri Brown after Kody and Robyn Brown spotted at her BNB - MEAWW",
        "content": "'Why do you keep catering to them?': 'Sister Wives' fans slam Meri Brown after Kody and Robyn Brown were spotted at her BNB\n\nAfter Kody and Robyn Brown were spotted at Meri Brown's Lizzie's Heritage Inn, fans were quick to come up with different theories regarding the visit\n\nPAROWAN, UTAH: It seems Kody Brown and his wife Robyn Brown recently met Meri Brown at Lizzie's Heritage Inn. Or did they just visit Meri's BNB? A fan recently spotted the couple at Parowan, Utah, entering Lizzie's Heritage Inn.\n\n'Sister Wives' star Meri has been recently been in the news ever since Christine got engaged to David Woolley. She has been posting cryptic messages on social media for a long time now. However, after Kody and Robyn were spotted at her BNB, fans were quick to come up with different theories. Some wondered about financial issues, while some slammed Meri for catering to her ex.\n\nRELATED ARTICLES\n\nMeri Brown's cryptic post about 'pain' leaves fans wondering if she's shading Christine Brown's engagement\n\nDid TLC star Meri Brown get a secret glow-up? Fans speculate plastic surgery behind radiant selfie\n\nKody and Robyn Brown (Youtube/TLC)\n\nKody and Robyn Brown spotted at Meri Brown's BNB Lizzie's Heritage Inn\n\nA fan started a Reddit thread on Saturday, April 22, 2023, with the title, \"Just saw Kody and film crew moving stuff at Meri's bnb.\" The fan further explained the entire incident. He claimed, \"We are on a trip to Vegas and we're driving past parawon and decided to drive by meris bnb just for shits and gigs and saw Kody & film crew and possibly Robyn moving a piano as well as a huge moving truck.\" The fan added, \"I wonder if meri is selling her bnb. We took videos but you can't see Kody.\" This was something that fans never expected to happen.\n\n'Why do you keep catering to them?'\n\nAs the thread opened, fans started building their own theories and expressed their view on Kody and Robyn visiting Meri's BNB. A fan slammed Meri and said, \"Why Meri⁉️⁉️⁉️ Why do you keep catering to them???? I don't think she'll ever stop.\" Another replied to this, \"She’s probably doing it strictly for financial reasons. Any sort of romantic links between them died out what seems like decades ago. But if Meri and K/R stick together - they all become relevant again. They have more power together - and more of a steady paycheck. I think this is all manufactured for filming. In real life, Meri is very much living her own life - just like Janelle and Christine.\"\n\n\"I like the thought of Meri refusing to finance CP but offering up the B&B for their downsizing needs. For aa small fee,\" commented another fan. A fan joked, \"Meri hired kody and Robyn cuz they needed jobs and she needed cheap labor.\" A fan wondered, \"With everything Meri went through to get the BnB, she ain't selling it!\"\n\nA few fans speculated whether the 'Sister Wives' stars are filming again. A fan commented, \"Someone else posted a video of themselves driving by the B&B and they were filming.\" As of now, nothing has been cleared about why Kody and Robyn went to Meri's BNB.\n\nThis article contains remarks made on the Internet by individual people and organizations. MEAWW cannot confirm them independently and does not support claims or opinions being made online."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3QvYm5iLWNoYWluLXVwZGF0ZXMtY29sbGFib3JhdGlvbnMtYW5kLXVwY29taW5nLXByb2plY3Rz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Apr 2023 07:00:00 GMT",
        "title": "BNB Chain: Updates, Collaborations, and Upcoming Projects - BSC NEWS",
        "content": "BNB\n\nExplore the latest advancements in BNB Chain ecosystem, including Greenfield testnet, reduced transaction costs, MEV research, Planck upgrade, Cocos-BCX & NodeReal Optimism solution, and upcoming technical improvements.\n\nUpdates and Developments\n\nThe BNB Chain ecosystem has been bustling with activity in the first part of 2023, with several significant developments and technological advancements taking place. In this article, we'll take a closer look at some of the updates that have occurred on the platform.\n\nBNB Greenfield is now underway.\n\nGreenfield Testnet\n\nThe Greenfield testnet is an open-source project that aims to provide a scalable and efficient data availability layer for decentralized applications (dApps). This testnet is now live, giving developers a chance to test their dApps on the platform and contribute to its development. The Greenfield testnet offers developers powerful tools for creating innovative solutions and exploring the full capabilities of the BNB Chain. The testnet is a significant milestone for the platform, and we invite more developers to explore its capabilities and join the thriving BNB Chain community.\n\nReduced Transaction Costs\n\nBSC validators have reduced transaction costs from 5 Gwei to 3 Gwei following extensive discussions. This reduction in fees will help drive network adoption, making BNB Chain an even more attractive platform for developers and users. The lower transaction costs will undoubtedly benefit the platform, making it more accessible and affordable for developers to create innovative solutions.\n\nMEV Research on BSC\n\nBSC recently hosted a Tech Community Call focused on Miner Extractable Value (MEV) research. The discussions showcased the active interest in addressing MEV-related issues on BSC, and more researchers and developers are invited to join the ongoing MEV research efforts on BNB Chain. This research is crucial to improving the platform's security and ensuring its continued growth and success.\n\nWith regular upgrades, BSC continues to make important progress.\n\nPlanck Upgrade\n\nThe Planck hard fork upgrade includes two crucial BEPs, BEP-171 and BEP-172, aimed at improving security and network stability. Additionally, the platform is working on an Integration API for EIP-4337 bundlers with L2 validators/sequencers, which will extend the \"sendRawTransaction\" RPC request with additional parameters and checks to ensure that no network changes could cause the transaction to revert. These upgrades are essential to maintaining a secure and stable platform for developers and users.\n\nCocos-BCX & NodeReal Optimism Solution\n\nThe collaboration between Cocos-BCX and NodeReal has resulted in an Optimism solution for the BNB Chain. This collaboration offers developers powerful tools for creating Web3 games and applications. This solution will help attract new developers to the platform and expand the range of applications that can be created on the BNB Chain.\n\nUpcoming Technical Improvements\n\nTwo significant upcoming projects are the OpBNB testnet, planned for mid-May, and the ZkBNB mainnet, scheduled for June 1st. These projects will further enhance the capabilities of the BNB Chain ecosystem, offering developers even more opportunities to innovate. Additionally, the BEP-206 proposal aims to optimize BSC storage through the hybrid state mode, which will enhance efficiency and scalability for the platform.\n\nIn conclusion, the BNB Chain developer community continues to push the boundaries of innovation with recent updates, collaborations, and upcoming projects. BNB Chain offers an array of opportunities for developers to build groundbreaking solutions, and we encourage more developers to join the BNB Chain ecosystem, contribute to its growth, and shape the future of blockchain technology.\n\nWhat is BNB Chain:\n\nPreviously known as the Binance Smart Chain (BSC), BNB Chain is a community-driven, decentralized, and censorship-resistant blockchain that is powered by Binance. It consists of BNB Beacon Chain and BNB Smart Chain, EVM compatible and facilitating a multi-chain ecosystem. Through the concept of MetaFI, BNB Chain aims to build the infrastructure to power the world’s parallel virtual ecosystem.\n\n‍\n\nFind more about BNB Chain here:\n\nWebsite | Twitter | Discord | Telegram | GitHub |"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3QvYm5iLWNoYWluLXVwZGF0ZXMtY29sbGFib3JhdGlvbnMtYW5kLXVwY29taW5nLXByb2plY3Rz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Apr 2023 07:00:00 GMT",
        "title": "BNB Chain: Updates, Collaborations, and Upcoming Projects - BSC NEWS",
        "content": "BNB\n\nExplore the latest advancements in BNB Chain ecosystem, including Greenfield testnet, reduced transaction costs, MEV research, Planck upgrade, Cocos-BCX & NodeReal Optimism solution, and upcoming technical improvements.\n\nUpdates and Developments\n\nThe BNB Chain ecosystem has been bustling with activity in the first part of 2023, with several significant developments and technological advancements taking place. In this article, we'll take a closer look at some of the updates that have occurred on the platform.\n\nBNB Greenfield is now underway.\n\nGreenfield Testnet\n\nThe Greenfield testnet is an open-source project that aims to provide a scalable and efficient data availability layer for decentralized applications (dApps). This testnet is now live, giving developers a chance to test their dApps on the platform and contribute to its development. The Greenfield testnet offers developers powerful tools for creating innovative solutions and exploring the full capabilities of the BNB Chain. The testnet is a significant milestone for the platform, and we invite more developers to explore its capabilities and join the thriving BNB Chain community.\n\nReduced Transaction Costs\n\nBSC validators have reduced transaction costs from 5 Gwei to 3 Gwei following extensive discussions. This reduction in fees will help drive network adoption, making BNB Chain an even more attractive platform for developers and users. The lower transaction costs will undoubtedly benefit the platform, making it more accessible and affordable for developers to create innovative solutions.\n\nMEV Research on BSC\n\nBSC recently hosted a Tech Community Call focused on Miner Extractable Value (MEV) research. The discussions showcased the active interest in addressing MEV-related issues on BSC, and more researchers and developers are invited to join the ongoing MEV research efforts on BNB Chain. This research is crucial to improving the platform's security and ensuring its continued growth and success.\n\nWith regular upgrades, BSC continues to make important progress.\n\nPlanck Upgrade\n\nThe Planck hard fork upgrade includes two crucial BEPs, BEP-171 and BEP-172, aimed at improving security and network stability. Additionally, the platform is working on an Integration API for EIP-4337 bundlers with L2 validators/sequencers, which will extend the \"sendRawTransaction\" RPC request with additional parameters and checks to ensure that no network changes could cause the transaction to revert. These upgrades are essential to maintaining a secure and stable platform for developers and users.\n\nCocos-BCX & NodeReal Optimism Solution\n\nThe collaboration between Cocos-BCX and NodeReal has resulted in an Optimism solution for the BNB Chain. This collaboration offers developers powerful tools for creating Web3 games and applications. This solution will help attract new developers to the platform and expand the range of applications that can be created on the BNB Chain.\n\nUpcoming Technical Improvements\n\nTwo significant upcoming projects are the OpBNB testnet, planned for mid-May, and the ZkBNB mainnet, scheduled for June 1st. These projects will further enhance the capabilities of the BNB Chain ecosystem, offering developers even more opportunities to innovate. Additionally, the BEP-206 proposal aims to optimize BSC storage through the hybrid state mode, which will enhance efficiency and scalability for the platform.\n\nIn conclusion, the BNB Chain developer community continues to push the boundaries of innovation with recent updates, collaborations, and upcoming projects. BNB Chain offers an array of opportunities for developers to build groundbreaking solutions, and we encourage more developers to join the BNB Chain ecosystem, contribute to its growth, and shape the future of blockchain technology.\n\nWhat is BNB Chain:\n\nPreviously known as the Binance Smart Chain (BSC), BNB Chain is a community-driven, decentralized, and censorship-resistant blockchain that is powered by Binance. It consists of BNB Beacon Chain and BNB Smart Chain, EVM compatible and facilitating a multi-chain ecosystem. Through the concept of MetaFI, BNB Chain aims to build the infrastructure to power the world’s parallel virtual ecosystem.\n\n‍\n\nFind more about BNB Chain here:\n\nWebsite | Twitter | Discord | Telegram | GitHub |"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3LnRoZXN1bi5jby51ay90cmF2ZWwvMjIxMjM3MDAva2luZy1jaGFybGVzLXRyYXZlbC10ZW4tcGxhY2VzLWNvcm9uYXRpb24v0gFXaHR0cHM6Ly93d3cudGhlc3VuLmNvLnVrL3RyYXZlbC8yMjEyMzcwMC9raW5nLWNoYXJsZXMtdHJhdmVsLXRlbi1wbGFjZXMtY29yb25hdGlvbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Apr 2023 07:00:00 GMT",
        "title": "From Britain to Barbados – inside ten of Charles’ favourite holiday escapes ahead of his coronation... - The Sun",
        "content": "HEIR BNB From Britain to Barbados – inside ten of Charles’ favourite holiday escapes ahead of his coronation\n\nIT’S nearly time to dust off the tea set and pop open the bubbly for the Coronation of King Charles.\n\nOn May 6, we will be tuning in to watch his official crowning.\n\n12 Sophie Swietochowski picks out some of King Charles favourite regal escapes Credit: Arthur Edwards / The Sun\n\nBut why let the celebrations come to an end there?\n\nHaving visited a wealth of countries during his time as Prince of Wales, Charles III knows a thing or two about fabulous holiday destinations.\n\nHere Sophie Swietochowski picks out some regal escapes.\n\nSri Lanka\n\n12 Charles visited Sri Lanka as part of a royal tour in 2021 Credit: Getty\n\n12 Sri Lanka is packed with soft sandy beaches and majestic wild species Credit: Getty\n\nTHE monarch had a fun-filled visit to the Indian Ocean island in 2021 as part of a royal tour.\n\nIt’s no surprise he enjoyed himself so much – the country is packed with soft sandy beaches lined by coconut palms, and deep sunsets bathe it in wonderful colours.\n\nBook by May 31 and you can save £800pp at the 5H Anantara Peace Haven Tangalle Resort, which has its own beach and is close to national parks and whale-watching spots.\n\nSeven nights’ half-board costs from £1,829pp, including flights on selected dates that depart between now and October 31.\n\nSee tropicalsky.co.uk or call 01342 331 795.\n\nItaly\n\n12 Charles and Diana's 1985 tour saw the pair visit several Italian regions, including Rome\n\nHAVING reportedly travelled 18 times on official visits, the King knows Italy pretty well.\n\nHis 1985 tour alongside Diana took him to several sun-soaked regions, including Sardinia, Milan and Rome.\n\nThe Italian capital, with its ancient Colosseum and the spectacular Trevi Fountain, is perfect for history buffs.\n\nYou can bag a long weekend there for under £700 with Jet2citybreaks.\n\nThree nights’ room-only at the well-located 4H Mercure Roma Corso Trieste is from £679pp, including flights from Newcastle on May 26.\n\nExpect chic rooms decorated with green velvet cushions and a lounge bar serving icy cocktails.\n\nSee jet2citybreaks.com.\n\nIsles of Scilly\n\n12 One of Charles' favourite British holiday spots is the Scilly Isles Credit: Getty\n\nCORNWALL and Devon may be the most popular staycation spots in South-West England, but our King prefers to venture a little farther than Penzance.\n\nOne of his favourite British holiday spots is the Scilly Isles, which include Tresco where he even has his own castle.\n\nThese magical islands are so unspoilt, the best way to see them is by campervan.\n\nThat way you can fully enjoy the glorious heathland, smoth-ered in beautiful bell heather and evergreen shrubs.\n\nA six-berth Mobilvetta motor-home comes with fully equipped kitchenette and bathroom, and costs £862 for seven days, including breakdown cover, two insured drivers and 200km mile-age per day.\n\nSee yescapa.co.uk.\n\nMalta\n\n12 Malta was where Charles made his first ever royal visit Credit: Getty\n\nTHIS sun-drenched archipelago has to be top of any royalist’s list, as it was where Charles made his first ever royal visit.\n\nHe went there as a five-year-old prince in 1954, with Princess Anne and his mother the Queen, the year after her Coronation..\n\nIt’s still a destination much loves by our royals – and their subjects, too, with lots of bargain holidays available.\n\nBlue Sea Holidays has seven nights’ all-inclusive at the 4H DB Seabank Resort & Spa Hotel from £649pp, including flights from Liverpool on May 8.\n\nThere is all you need including three massive pools, seven restauants, four bars, a kids’ club and regular entertainment.\n\nAnd you’ll feel just like a king, with all meals and drinks already paid for by the time you arrive.\n\nSee blueseaholidays.co.uk.\n\nBarbados\n\n12 The King is planning to visit several Caribbean countries on an official tour following the Coronation Credit: Getty\n\nHIS Majesty is planning to visit several Caribbean countries on an official tour following the Coronation, but Barbados is a particular favourite of his.\n\nEven though it removed the Queen as its head of state in 2021, it remains in the Common-wealth and there is guaranteed sunshine year round.\n\nSplurge on the all-suite 4H South Beach Hotel on the south coast of the island where seven nights’ B&B is from £1,335pp, including flights from Heathrow on June 29.\n\nThe resort has everything for a laid-back getaway, including pool, in-room spa services and white-sand beach.\n\nSee ba.com/southbeach or call 0344 493 0124.\n\nCanada\n\n12 King Charles visited Canada in 2022 on a brief three-day trip for Elizabeth's Platinum Jubilee Credit: www.mycanadatrips.co.uk\n\nTHE monarch has always taken pride in Britain’s relationship with Canada, which joined the Commonwealth as an independent state in 1931.\n\nKing Charles visited in 2022 on a brief three-day trip for Canada’s celebration for the Queen’s jubilee.\n\nIt’s worth spending a little more time out there when visiting yourself, though.\n\nMy Canada Trips offers bucket list getaways, ticking off some of the places our King has visited.\n\nBook by April 30 and you can bag an 11-day self-drive trip around Nova Scotia, from £2,379pp, including flights from London to Halifax on September 4, plus accommodation and car hire.\n\nSee mycanadatrips.co.uk.\n\nWales\n\n12 Book a walking holiday to soak up as much of Wales' captivating scenery as possible Credit: Philip - stock.adobe.com\n\nAS the longest-ever serving Prince of Wales, who studied for a semester at Aberystwyth University and has a home in Carmarthenshire, King Charles has strong roots in Wales.\n\nYou’ll find mementos of the monarch scattered all across this country, which is rich in culture and unspoilt landscape.\n\nBook a walking holiday to soak up as much of the captivating scenery as you can.\n\nHF Holidays has a three-night self-guided Snowdonia tour from £308pp, which includes accommodation at 3H Dolserau Hall and all meals as well as routes and maps.\n\nBetter still, if you visit during the Coronation day, you can watch the crowning on a big screen while tucking into a themed afternoon tea made up of fizz and big slices of Victoria sponge.\n\nSee hfholidays.co.uk.\n\nGermany\n\n12 Our King has visited Germany over 40 times Credit: Getty\n\nIT seems fitting that Charles’s first state visit as King was to Germany last month, where he was greeted by cheering crowds.\n\nHe not only has German ancestry, he speaks the language and reportedly has such a fondness for the country, he has visited more than 40 times.\n\nFor those keen to find out what’s so special about the region, TUI offers River Cruises that let you tick off several areas in one hit.\n\nChristmas is a great time of year to go and you can bag a five-night full-board Festive Flavours cruise along the Rhine from £900pp, calling at Mainz, Bonn, Cologne, Dusseldorf and Koblenz.\n\nThe price includes flights from Gatwick on December 12.\n\nSee tui.co.uk.\n\nThe Netherlands\n\n12 Amsterdam, known for its laid-back, friendly atmosphere, is much-loved by his highness Credit: Getty\n\nYOU can’t beat a city break in Amsterdam, where cafes spill on to the cobbled streets and canals criss-cross through the centre.\n\nIt is a cultural haven.\n\nThe city, known for its laid-back, friendly atmosphere, is much-loved by his highness too, who has visited The Netherlands nine times over his lifetime.\n\nGrab the cheapest accommodation deal you can as you’ll want to be out exploring most of the time.\n\nEasyJet Holidays is offering three nights’ room-only at the Best Western Plus Amstelveen from £280pp, including flights from Edinburgh on May 8.\n\nSee easyjet.com/holidays.\n\nCorfu\n\n12 With Greek in his blood, Corfu is one of his majesty’s favourite holiday destinations Credit: Getty\n\nThe rugged Greek island of Corfu is one of his majesty’s favourite holiday destinations and he once told an Athens newspaper: “Greece is in my blood and I have long had a fascination for her ancient culture and history”.\n\nThere are some really cracking deals out there right now too, such as seven nights’ B&B at the 3H Hotel Mimosa from £449pp with Jet2holidays.\n\nIt includes flights from Birmingham on May 4, so you can spend the Coronation in sizzling sunshine.\n\nThere are two outdoor pools, but the picturesque Sidari beach is only a two-minute walk away if you prefer to paddle in the sea.\n\nSee jet2holidays.com."
    }
]