[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovLzZhYmMuY29tL3BoaWxseS1ob21lLWFuZC1nYXJkZW4tc2hvdy1zY2hvb2xob3VzZS13b29kd29ya2luZy1zeWNhbW9yZS0tc3RvbmUtZmFybS1ncmVhdGVyLXBoaWxhZGVscGhpYS1leHBvLWNlbnRlci8xMjgyNTAxNS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "Sycamore & Stone Farm: A Place to Shop, Build, or Stay - WPVI-TV",
        "content": "Sycamore & Stone Farm: A Place to Shop, Build, or Stay\n\nSycamore & Stone Farm in Chester Springs Pennsylvania is the new home of SchoolHouse Woodworking, a retail location, an Air BNB, and more!\n\nSycamore & Stone Farm in Chester Springs Pennsylvania is the new home of SchoolHouse Woodworking, a retail location, an Air BNB, and more!\n\nSycamore & Stone Farm in Chester Springs Pennsylvania is the new home of SchoolHouse Woodworking, a retail location, an Air BNB, and more!\n\nSycamore & Stone Farm in Chester Springs Pennsylvania is the new home of SchoolHouse Woodworking, a retail location, an Air BNB, and more!\n\nOAKS, Pennsylvania (WPVI) -- Sycamore & Stone Farm in Chester Springs Pennsylvania is the new home of SchoolHouse Woodworking, a retail location, an Air BNB, and more! The goal of Sycamore & Stone Farm is to provide a sense of community and bring people together to enjoy and appreciate the history that surrounds us. So, whether you are coming to shop, build, or stay, Sycamore & Stone Farm has something for everyone.\n\nToday, we are joined by Jeff Devlin and Janelle Burdette, Founders of Sycamore & Stone Farm. They share decorating tips for couples moving in together for the first time, insights on renovating a home, and the importance of having a plan.\n\nFor more decorating and renovating inspirations be sure to visit the Philly Home and Garden Show at the Greater Philadelphia Expo center at Oaks, February 24-26.\n\nFor tickets visit PhillyHomeAndGardenShow.com."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9qZGItYW5ub3VuY2VzLWJyZWFrdGhyb3VnaC1mZWF0dXJlLWFsbG93cy0yMjU3MDAwNDguaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "JDB Announces Its Breakthrough Feature That Allows for Tracking and Analyzing All Data from the Entire BNB Chain - Yahoo Finance",
        "content": "With this unique feature, JDB is set to revolutionize blockchain data analysis.\n\nZurich, Switzerland--(Newsfile Corp. - February 17, 2023) - JDB, the company known for its powerful trading and research tools, has just announced that it has found a way to not only track live data but to analyze all data from the entire BNB Chain since its inception. This is going to be a milestone in the world of blockchain data analysis, as in the fast-paced world of cryptocurrency, making informed decisions has become more critical than ever.\n\nJDB's founder, Cedric Vecna, said, \"We are thrilled to announce this development. We believe that by providing complete transparency and insights to over 2.8 million DeFi traders on the BNB Chain, we can revolutionize how investors make decisions within the BNB Chain ecosystem. This means more security, fewer scam victims, and more transparency.\"\n\nJDB will be unveiling this data in the coming 2-3 weeks.\n\nAbout JDB\n\nJDB is known for providing cutting-edge trading tools bringing unparalleled transparency and analysis capabilities. JDB's DApp is packed with features that help users make better decisions about investing in a particular token.\n\nUsers can track, get notified, and copy successful trades with the' Follow' function.\n\nAdditionally, the DApp provides a graphical representation of the data, making it easier for users to understand and analyze it.\n\n\n\n\n\nJDB\n\n\n\nTo view an enhanced version of this graphic, please visit:\n\nhttps://images.newsfilecorp.com/files/9243/155263_185e19a874ea6909_001full.jpg\n\nJDB has also introduced a new tier system that gives users access to different features based on the amount of JDB tokens they hold. To access the DApp, users need at least 0.5 BNB worth of JDB tokens. The more tokens they hold, the more benefits they will have, such as following more wallets and having the possibility to make automated copy trading. This system makes the token more valuable and provides a sustainable ecosystem for users.\n\nThe team behind JDB is constantly working to improve the platform and provide users with more valuable data and insights. With the introduction of new features such as automated copy trading and extended data tracking to other EVM blockchains, JDB is positioning itself as a powerful tool for traders and investors.\n\nTo learn more, visit:\n\nSocials / Links: https://jdb.finance/\n\nDApp: https://dapp.jdb.finance/\n\nWhitepaper: https://www.jdb.finance/whitepaper\n\nLinktree: https://linktr.ee/jdb_official\n\nContact person: Cedric Vecna\n\nCompany name: JDB\n\nWebsite: https://dapp.jdb.finance/\n\nEmail: info@jdb.finance\n\nCountry: Switzerland\n\nCity: Zurich\n\nStory continues\n\nTo view the source version of this press release, please visit https://www.newsfilecorp.com/release/155263"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9qZGItYW5ub3VuY2VzLWJyZWFrdGhyb3VnaC1mZWF0dXJlLWFsbG93cy0yMjU3MDAwNDguaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "JDB Announces Its Breakthrough Feature That Allows for Tracking and Analyzing All Data from the Entire BNB Chain - Yahoo Finance",
        "content": "With this unique feature, JDB is set to revolutionize blockchain data analysis.\n\nZurich, Switzerland--(Newsfile Corp. - February 17, 2023) - JDB, the company known for its powerful trading and research tools, has just announced that it has found a way to not only track live data but to analyze all data from the entire BNB Chain since its inception. This is going to be a milestone in the world of blockchain data analysis, as in the fast-paced world of cryptocurrency, making informed decisions has become more critical than ever.\n\nJDB's founder, Cedric Vecna, said, \"We are thrilled to announce this development. We believe that by providing complete transparency and insights to over 2.8 million DeFi traders on the BNB Chain, we can revolutionize how investors make decisions within the BNB Chain ecosystem. This means more security, fewer scam victims, and more transparency.\"\n\nJDB will be unveiling this data in the coming 2-3 weeks.\n\nAbout JDB\n\nJDB is known for providing cutting-edge trading tools bringing unparalleled transparency and analysis capabilities. JDB's DApp is packed with features that help users make better decisions about investing in a particular token.\n\nUsers can track, get notified, and copy successful trades with the' Follow' function.\n\nAdditionally, the DApp provides a graphical representation of the data, making it easier for users to understand and analyze it.\n\n\n\n\n\nJDB\n\n\n\nTo view an enhanced version of this graphic, please visit:\n\nhttps://images.newsfilecorp.com/files/9243/155263_185e19a874ea6909_001full.jpg\n\nJDB has also introduced a new tier system that gives users access to different features based on the amount of JDB tokens they hold. To access the DApp, users need at least 0.5 BNB worth of JDB tokens. The more tokens they hold, the more benefits they will have, such as following more wallets and having the possibility to make automated copy trading. This system makes the token more valuable and provides a sustainable ecosystem for users.\n\nThe team behind JDB is constantly working to improve the platform and provide users with more valuable data and insights. With the introduction of new features such as automated copy trading and extended data tracking to other EVM blockchains, JDB is positioning itself as a powerful tool for traders and investors.\n\nTo learn more, visit:\n\nSocials / Links: https://jdb.finance/\n\nDApp: https://dapp.jdb.finance/\n\nWhitepaper: https://www.jdb.finance/whitepaper\n\nLinktree: https://linktr.ee/jdb_official\n\nContact person: Cedric Vecna\n\nCompany name: JDB\n\nWebsite: https://dapp.jdb.finance/\n\nEmail: info@jdb.finance\n\nCountry: Switzerland\n\nCity: Zurich\n\nStory continues\n\nTo view the source version of this press release, please visit https://www.newsfilecorp.com/release/155263"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3Lnd4eXouY29tL25ld3Mvc2lzdGVycy1iZWhpbmQtbHV4dXJ5LWRldHJvaXQtYmVkLWFuZC1icmVha2Zhc3QtdG8tdXNlLXNwYWNlLXRvLWxpZnQtdXAtbmV3LW5vbnByb2ZpdHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "Sisters behind luxury Detroit bed and breakfast to use space to lift up new nonprofits - WXYZ 7 Action News Detroit",
        "content": "DETROIT (WXYZ) — If there’s one thing you feel when you enter The Cochrane House Luxury Historic Inn Detroit in Brush Park — it's sisterly love.\n\nWe caught up with Roderica and Francina James last year, sharing how they renovated a 19th century mansion to create a luxury bed and breakfast right outside of Comerica Park.\n\nBut something that’s always run in tandem with their successful business is a desire to give back.\n\nSisters turn 19th century Detroit mansion into luxury bed and breakfast\n\n\"I tell people this all the time, even if it's down to your last cent, if you give it out, it will come back,\" said Roderica.\n\nThat giving spirit gave way to The Cochrane House Nonprofit, and that was even before their bed and breakfast was bustling.\n\n\"We didn't even know we were going to open our doors ... but what we did know is once we did, we wanted to be an impact on our community,\" Roderica said.\n\nThe nonprofit is now also known as the Mary Frances Almon-James Youth Organization — renamed to honor their late mother.\n\n\"My mom has always had a heart for giving. So even in her business, she was giving, giving, giving, giving, giving,\" said Roderica.\n\nThrough their nonprofit, Roderica and Francina give back to the youth in the community through mentorship, educational initiatives, resources and more.\n\nOne of their biggest events is their holiday gift giving, where they partner with schools at the end of the year to make sure kids in need have a memorable holiday.\n\n\"Basically in her name, we give out toys for Christmas every year to children ... in 2022, we were able to service 41 families and 107 children,\" she said.\n\nAnd they’re not just focused on their own work as a nonprofit — they have a plan to lift up other local nonprofits, too, teaming up with Monica Marie Jones Coaching to really make a difference this year when it comes to grassroots organizations.\n\n\"There's different nonprofits, local grassroots nonprofits that we've chosen for them to come into our space, talk to the women here, raise funds for the things that they need. And so we're actually, as a program, we're opening up our doors this year for other nonprofits to come in and get money, because a lot of times that's what it takes in order for you to reach the goals you're trying to reach within your community,\" said Roderica.\n\nThe sisters said they already have 10 events scheduled this year at The Cochrane House to help garner support for those chosen nonprofits.\n\n\"We want to be here for them, because everyone is here for us — and I think that's what we appreciate the most,\" said Francina.\n\nIt all goes back to that feeling of community — fueled by that sisterly love that Francina and Roderica try to give to everyone who walks through the doors of The Cochrane House. It's work that would undoubtedly make their mom proud.\n\n\"She poured into us awful lot. And we do this for her ... she would look up and she would say, 'my girls are doing exactly what I told them to do,'\" said Roderica.\n\nTo learn more about The Cochrane House Nonprofit, click here. To learn more about The Cochrane House luxury bed and breakfast, click here.\n\nThe sisters are running a 15% off discount through the end of the month at The Cochrane House. It expires on Feb, 28, 2023. The coupon code is wxyz15."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiOmh0dHBzOi8vY29pbmpvdXJuYWwubmV0L2JpbmFuY2UtY29pbi93aGF0LWlzLWJpbmFuY2UtY29pbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "What is Binance Coin & How Does it Work? BNB for Beginners - CoinJournal",
        "content": "Is Binance Coin Worth the Investment?\n\nOne of the most promising things about Binance Coin tokens is that even if it doesn’t make it a viable currency alternative, its success doesn’t solely hinge on that. It can still be used within the Binance Exchange ecosystem for powering operations and digital asset trading, providing a seamless experience to the platform users. It’s one of those coins which have an inherent use.\n\nThat being said, cryptocurrency space can be quite unpredictable, especially when it comes to price fluctuations. If you are looking to invest in BNB or any other cryptocurrency, do so with great deliberation and caution to ensure your investment capital remains secure. You can’t understate the importance of risk mitigation.\n\nIf you’re interested in buying then be sure to check out our how to buy Binance Coin guide, you can also follow the Binance Coin Price here and look at our prediction for the price of Binance coin.\n\nWhy Should You Invest?\n\nIf you are looking to invest in Binance Coin or any other altcoin, make sure you know the underlying cause of your investment. There is a multitude of reasons why people trade BNB and other tokens.\n\nYou want to earn passive income by trading the BNB tokens and other cryptocurrencies.\n\nYou want to make a long-term return on your investment by holding the BNB tokens for a while.\n\nYou want to park your capital in a safe and reliable decentralized network.\n\nYou believe in the Binance Coin project and want to support it with your finances.\n\nDon’t forget that different investors have different objectives when it comes to trading and you need a unique and well thought out strategy to achieve them. This is why it is crucial to identify why you would want to invest in BNB.\n\nPrice and Volatility – Why Is the Price So Volatile?\n\nWhen it comes to cryptocurrencies, there is no strict single-handed and centralized supervision such as a monetary policy by the State Bank. This means that they are totally driven by the market forces and sentiment which results in high volatility due to a wide range of factors including regulations, technology updates, opinion pieces, virality, or social acceptance. Having said that, BNB has been one of the more stable cryptocurrencies out there since it is a native coin of an established trading platform.\n\nThis means that while there is enough volatility to earn profits, it’s still relatively stable as compared to the other tokens which can see massive plummeting and surges within hours.\n\nWhere to Buy Binance Coin\n\nBNB is offered by many cryptocurrency exchanges and naturally the best place to purchase it is the native Binance platform. However, if you are looking for other options, you need to take different factors into account including fees, user-friendliness, customer support, and reputation. Three of our favourite and vetted trading platforms are listed below:\n\neToro – One of the top social trading websites that offer cryptocurrency CFDs and makes the experience swift, convenient, and affordable. With the ease of use, professional analysis, and economical fees, eToro is one of the best options.\n\nFXTB – Another reputed platform that was created for forex trading but has leveraged its exceptional market position to become one of the best cryptocurrency exchanges for buying BNB.\n\nWhere to Store Binance Coin\n\nWhen you purchase BNB, you cannot hold it in the exchange’s account for long periods as it’s quite unsafe. It means that you will need a more secure and robust option i.e. cryptocurrency wallets which are specially designed to store all types of tokens.\n\nWhat Are Wallets?\n\nCryptocurrency wallets are physical devices or software programs with the capacity to securely hold a wide variety of tokens and digital assets including Bitcoin, Dash, Bitcoin Cash, Iota, Ethereum, Chainlink, Tezos, Monero, Ripple, and more. They have modern security features to keep your funds safe and secure for longer periods.\n\nWhat Types of Wallets Are Available?\n\nWhen you are searching for the best wallet to store your BNB tokens, you need to review multiple options.\n\nWeb Wallet\n\nWeb wallets use browser extensions or are built into the cryptocurrency platform that is easily accessible through your credentials. They are user-friendly but don’t have a lot of security features.\n\nMobile Wallet\n\nIf you are looking for more portability and want to trade on the go, then what you need is a mobile wallet. Mobile wallets are offered as iOS or Android apps that you can install on your phone to store your crypto coins. These wallets offer reasonable security and set of features. Some of the Binance mobile wallets include Atomic Wallet, Exodus, and Coinomi Wallet.\n\nDesktop Wallet\n\nThese are software programs which you can install on your Windows or macOS computer to store your tokens. They bring more security features and offer built-in trading which can be quite useful for traders. Coinomi, Exodus, and Atomic Wallets are good options.\n\nHardware Wallet\n\nIf you prioritize security over everything else, the best bet for you is a cold or hardware wallet. They are completely disconnected from the outside networks which can make devices vulnerable. They also offer leading security features such as passphrases and 2FA. You can use Ledger Nano S and Trezor to store the Binance Coin.\n\nWallet Combinations\n\nYou also have the option to combine different types of wallets to get the best features of a variety of wallets including reliability, security, convenience, and ease of use. You can use Ledger Nano S in combination with the Atomic wallet.\n\nStoring Your Wallet on an Exchange, the Potential Upside and Downside\n\nAlthough there is nothing inherently wrong with storing your BNB in an exchange’s account, it is not the best idea to keep your tokens there for longer periods. While crypto exchange wallets deliver improved user experience, ease of use, and swift accessibility, they don’t have the best security. Apart from that, if the website is temporarily unavailable or experiences a hacking attempt or a security breach, your BNB tokens will either get stuck or may get stolen."
    }
]