[
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3Lm9ubHlpbnlvdXJzdGF0ZS5jb20vaWxsaW5vaXMvaGlkZGVuLWhlYXZlbmx5LWFjY29tbW9kYXRpb24taWwv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 May 2023 07:00:00 GMT",
        "title": "Cloran Mansion: Hidden Gem Bed And Breakfast In Galena, Illinois - Only In Your State",
        "content": "As local travel experts, we know what travelers are looking for when it comes to finding the perfect accommodations for their next trip. To compile our lists, we scour the internet to find properties with excellent ratings and reviews, desirable amenities, nearby attractions, and that something special that makes a destination worthy of traveling for.\n\nThere are tons of cool and unique places to stay in Illinois. Whether it’s a charming cabin or a luxury resort, the best places to stay in Illinois all have something in common: lots of character and the amenities you need for a relaxing stay. Personally, I always look for something that also has a historic twist — I love the thought of my accommodation being a place where stories were made. If you’re like me and enjoy a private, heavenly getaway with plenty of space to stretch out, then you’ll likely love this hidden gem bed and breakfast in Galena, Illinois.\n\nCould you see yourself enjoying a private weekend getaway at this hidden gem bed and breakfast in Galena, Illinois? What do you look for most when booking accommodations? Tell us in the comments! Start planning your trip now by checking out the Cloran Mansion Bed & Breakfast website and the Cloran Mansion Bed & Breakfast Facebook page. While you’re in Galena, take a moment to stop and smell the fields of wildflowers, take a spooky ghost tour, or dine at a haunted hotel!\n\nWant more Illinois in your inbox? Get the latest on things to see, do, and eat around Illinois! spinner Thank you! You'll receive your first newsletter soon! An error occured. Subscribe"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5mcmVlcHJlc3Nqb3VybmFsLmluL211bWJhaS90aGFuZS1uYXVwYWRhLXBvbGljZS1kZXRhaW5zLWlpdC1rYW5wdXItc3R1ZGVudC1hbmQtaGlzLWFzc29jaWF0ZS1pbi1jcnlwdG9jdXJyZW5jeS1mcmF1ZNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 May 2023 07:00:00 GMT",
        "title": "Thane: Naupada police detains IIT Kanpur student and his associate in cryptocurrency fraud - Free Press Journal",
        "content": "Representative Image\n\nThane: The Naupada police on Tuesday detained an IIT Kanpur student Shubransh Nayak and his five associates in connection with an alleged cryptocurrency fraud.\n\n“The initial complaint is of ₹2.5 lakh, but the scam could burgeon to several crores since we are expecting more complainants to approach us,\" said a police officer.\n\nA resident of Naupada, Sushil Kangya, had sent a written a complaint to senior inspector Sanjay Dhumal about being defrauded by people associated with multi-level marketing (MLM) companies Dronx.Biz and BNB Pool. He claimed that scam could be to the tune of ₹300 crore. He also sought the police's help in recovering the lost money of ₹2.5 lakhs which he had invested in cryptocurrency.\n\nInvest in the scheme and increase the network\n\nKangya mentioned in his letter that last year he was approached by two people named Shubhransh Nayak and Pankaj Pandhi who asked him and his sister to invest in a cryptocurrency scheme and get a regular interest of 8 per cent. They also promised that the returns can be even more if they got more people to invest in the scheme and increase the network of people.\n\n“Initially, we invested ₹ 2.5 lakhs and also got returns for a few months. Later the returns stopped. When we asked Shubhransh and Pankaj about non-payment of the returns they showed us a few videos of the prime minister allegedly promoting the organisations and that the companies were genuine,\" Kangya said.\n\nFake promotion\n\nThe claim about the PM promoting the companies appears to be fake.\n\n“When we realised that it was a scam, we asked for the refund of our money, but we were threatened with dire consequences,\" Kangya added.\n\nSanjay Dhumal, senior police inspector, at Naupada police station, said, \"We received the letter from complainant Sushil Kangya against two companies named DRONX BIZ and DRONX BNB Pool which are into MLM and involved in a cryptocurrency scam. The names of people running it are Rajesh Bapodra a diamond merchant who lives in Kandivali, Krish Reddy alias Phanni Beejam from Hyderabad, Shubhransh Nayak, Dr Peter Dhanraj, Avinash Upadhyay and Pankaj Pandhi. Based on the complaint lodged by Kangya we have detained them for the investigation. As of now no FIR has been registered against them.\""
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd3d3Lm9ubHlpbnlvdXJzdGF0ZS5jb20vbm9ydGhlcm4tY2FsaWZvcm5pYS9lbGVwaGFudC1yYW5jaC1iYi1ub3JjYWwv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 May 2023 07:00:00 GMT",
        "title": "Vision Quest Is An Awesome B&B Elephant Sanctuary In California - Only In Your State",
        "content": "As local travel experts, we know what travelers are looking for when it comes to finding the perfect accommodations for their next trip. To compile our lists, we scour the internet to find properties with excellent ratings and reviews, desirable amenities, nearby attractions, and that something special that makes a destination worthy of traveling for.\n\nNorthern California is definitely a long way from the Serengeti, but rest assured you can still partake in a safari-like experience without ever leaving the state. Vision Quest Ranch is a truly one-of-a-kind bed and breakfast where you can wake up to the sounds of lions, tigers, and elephants. We can guarantee you’ve never experienced anything like it before! This is one getaway you’ll wish could go on forever, so read on to check out this awesome elephant sanctuary in California!\n\nWhat do you think? Are you up for a stay at this safari-style bed and breakfast? Have you perhaps already enjoyed this unique elephant encounter in California? If so, what was your favorite part? We’d love to read about your experience in the comments section below!\n\nTo experience elephant seals in nature, check out this article about beautiful Año Nuevo State Park.\n\nIf you’re still in the mood for more Nothern California adventures, take a look at this video:\n\nWant more Northern California in your inbox? Get the latest on things to see, do, and eat around Northern California! spinner Thank you! You'll receive your first newsletter soon! An error occured. Subscribe\n\nMore to Explore More Adventures in Northern California Where can we find breweries in Northern California? Mad River Brewery Co. in Blue Lake is a unique tribally owned, women-led craft brewery.\n\nThe Brewing Lair in Blairsden is situated in the midst of a beautiful forest.\n\nThe Jack Russell Farm Brewery in Camino is set in a llama field. Read on to learn about some of the many other excellent breweries in Northern California. Where can we find trails in Northern California? The California Coastal Trail in Redwood National Park is a fairly short waterfront trail offering spectacular views.\n\nThe Truckee River Trail in the Tahoe National Forest is an easy 10.2-mile paved trail that follows along the Truckee River.\n\nThe Kehoe Beach Trail at the Point Reyes National Seashore goes right along the beach and offers amazing views of the ocean. Read on to learn about some of the many other hiking and biking trails in Northern California. Where can we find museums in Northern California? The Nevada County Narrow Gauge Railroad Museum in Nevada City encompasses a rail yard and restoration shop.\n\nThe Willow Creek-China Flat Museum & Bigfoot Collection houses some of the most sought-after Bigfoot photos and footprint casts.\n\nThe Aerospace Museum of California in North Highlands was originally founded as part of McClellan Air Force Base and remains as a repository of air and space exploration. Read on to learn about some of the many other wonderful museums in Northern California."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiKmh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvaG93LXRvLXN0YWtlLXhycNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 May 2023 07:00:00 GMT",
        "title": "How to Stake XRP? - Watcher Guru",
        "content": "Ripple (XRP) is the sixth-largest cryptocurrency by market cap. While cryptocurrencies have become extremely popular, so has their adoption rate. While numerous people make income from crypto by trading and investing, staking has also become a community favorite. Users stake crypto to earn passive income from their crypto holdings.\n\nIn case you had a decent holding of XRP and wanted to know how to earn passive income on that, we’ve got you covered. Before we dive deeper into how to stake XRP, let us understand what staking is.\n\nAlso read: How to Stake BNB?\n\nStaking in a nutshell\n\nCrypto staking is the technique of holding and locking cryptocurrency in a digital wallet in order to maintain the operations of a blockchain network. They contribute to the network’s security, consensus mechanism, and overall operation by doing so.\n\nStaking is typically connected with proof-of-stake (PoS) blockchain systems, in which validators are chosen based on the amount of cryptocurrency they hold and commit to staking to create new blocks and validate transactions.\n\nStaking provides cryptocurrency holders with an option to earn passive income on their holdings. Instead of resting their crypto assets in a wallet, users can stake them to make the assets work for them and earn free money.\n\nAlso read: How to Mine Dogecoin (DOGE)?\n\nWhat is Ripple (XRP)\n\nXRP was developed in 2012 by Jed McCaleb and David Schwartz as the native currency for the XRP Ledger (XRPL). The XRP Ledger is an open-source technology. Some notable characteristics of the XRP Ledger include its affordability, scalability, speed, and environmentally friendly nature.\n\nDevelopers leverage the XRP Ledger and its native coin, XRP, to create solutions for remittance and asset tokenization, aiming to address existing inefficiencies. Currently, the XRP Ledger is widely utilized in various domains, including payments, tokenization, decentralized finance (DeFi), central bank digital currencies (CBDCs), and stablecoins.\n\nAlso read: Does ChatGPT Save Data?\n\nCan you stake Ripple?\n\nRipple, technically speaking, does not support staking or staking rewards due to its consensus mechanism not being based on proof of stake. However, there are platforms such as Binance, Nexo, and Crypto.com that offer flexible savings options for XRP. These platforms allow users to lend out their coins to others in exchange for interest or returns.\n\nWhen participating in these lending programs, the custody of your coin is typically transferred to a third party, whether it be the platform itself or the borrowers. They may utilize the lent XRP to provide liquidity on their platform or lend it to individuals seeking to borrow it.\n\nAlso read: How to Unwrap Ethereum?\n\nAlso read: Is MetaMask Safe (2023)?\n\nHow to earn interest on XRP?\n\nIt should be noted that earning interest on your coins makes it necessary to trust your coins with a third-party website. There are many different platforms that provide interest for your XRP. Let’s look at how you can stake XRP and other coins, and earn interest on Binance.\n\nEnsure to have a Binance account. If not, sign up for an account and complete verification.\n\nOnce you are verified, deposit the amount of XRP that you want to lock away to earn interest.\n\nGo to Binance Earn and click on log in.\n\nOnce that is done, click on “Simple Earn.”\n\nYou will then be redirected to a page with different coins to choose from.\n\nSearch for “XRP” and click on “Subscribe.”\n\nYou will see a tab where you can enter the subscription amount. You can enter the amount of XRP that you like to stake.\n\nA real-time APR will pop up showing a live indication of rewards that you can receive. You can earn rewards depending on the APR.\n\nThe interest rate at press time is 2.26% but can change from time to time.\n\nOnce you enter the amount and read the summary, you can confirm the transaction.\n\nThat’s it. The rewards will be distributed to your earn wallet every minute. However, do proper research before trusting any website with your crypto."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vd3d3LmNvaW50cmlidW5lLmNvbS9lbi9iaW5hbmNlLXNob3VsZC13ZS1ydW4tYXdheS1mcm9tLWl0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 May 2023 07:00:00 GMT",
        "title": "Binance: Should we run away from it? - Cointribune EN",
        "content": "Tue 09 May 2023 ▪ 14 min of reading ▪ by La Rédaction C.\n\nIn 2017, an offshore exchange burst onto the crypto scene. Quickly rising to become a major player within the crypto industry, Binance is now showing signs of weaknesses though. Some dubious elements related to the centralization of BNB and the recent legal actions brought by the CFTC could well lead to the collapse of the colossus with feet of clay. So should we take the plunge to avoid a FTX-like scenario?\n\nBinance: a very successful ICO\n\nThe origin of Binance’s prosperity comes from 2017, in the midst of the Initial Coin Offering (ICO) boom. ICOs were celebrated as a new method of fundraising that allowed projects to raise capital by issuing and selling their own tokens to investors.\n\nIn hindsight, ICOs are now synonymous with fraud, as the majority of them turned out to be nothing more than blatant scams.\n\nLegend has it that CZ first heard about ICOs in the summer of 2017. Seeing an easy opportunity to raise money for his exchange, he rushed to launch his own token, which he named BNB. In just three days, the BNB white paper was written. Nine days later, the BNB ICO began. Within a week, CZ easily raised $15 millions.\n\nBinance issued a total of 200 millions BNB tokens. As with most ICOs at the time, the founding team received 40% of the tokens for future development and marketing efforts.\n\nBNB: a “security”?\n\nIn the white paper, it is stated that the purpose of the fundraising is to fund the company’s investments to become a world-class crypto exchange. Investors in BNB tokens bought them with the anticipation that they would increase in value as Binance grows, and because of the tokenomics around the token itself.\n\nBNB token holders received a discount on the platform’s fees\n\nEach quarter, Binance would use 20% of its profits to buy back BNBs and burn them, reducing the supply of tokens .\n\n. The BNBs would be used to pay the fees for Binance’s future decentralized platform, the Binance Chain, once it was built.\n\nWhen BNBs were issued by Binance, regulators began to question them, as to many market participants they looked very much like a security as defined by the Howey test.\n\nHowey test. Source: LeewayHertz\n\nThe Howey test is used to determine whether a financial product qualifies as an investment contract and therefore as a security under federal securities laws.\n\nThe BNB and the Howey test\n\nThese regulations impose registration and disclosure requirements with the SEC. Despite BNB’s striking resemblance to a security, Binance refrained from taking either of these necessary steps. Instead, it proceeded to issue the token and jumped in without regard to the regulator.\n\nWhen CZ was asked on a podcast in 2018 if BNB was a security, this is what he said.\n\n“No. In fact, it is not a corporate token. Right now the token lives on the Ethereum blockchain, but very soon we will have our own blockchain which is also a decentralized platform. We are the issuers. People bought it and the token spread. We hold a lot of them, but we won’t be able to issue it anymore. So we don’t have much control over the token anymore. What we could control, since we are the very large holders of the token, is that we have a financial incentive to increase the value of the coin. We have a strong incentive to do so. We don’t promise a return. But we are working hard to increase the value of BNB.” CZ\n\nCZ’s lies about the BNB\n\nThis statement from CZ is almost a lie. In it, the founder of Binance explains that even though Binance issued the tokens, it is not a corporate token because it “lives on the blockchain which is also decentralized.” He goes on to say that given the distribution of the tokens, Binance has no control.\n\nCZ\n\nTherefore, it is likely that Binance was funded by issuing an unregistered security (BNB), but let’s consider the possibility that CZ is right. Let’s assume that the existence of BNB on a decentralized blockchain and its distribution among holders makes it uncontrollable. But is this really true?\n\nBinance’s highly centralized blockchain\n\nInitially, Binance issued BNB as an ERC-20 token on the Ethereum blockchain. However, in 2019, Binance launched its own rival blockchain, dubbed Binance Chain. According to Binance, the main motivation for launching its own blockchain was to create a blockchain specifically designed for speed and scalability. Ethereum is infamous for being slow and congested during high-volume periods. Binance wanted to remedy this. The problem is that there are inherent trade-offs in designing a blockchain. This is commonly referred to as the “blockchain trilemma”.\n\nHow the Binance Chain works. Source: Messari\n\nBinance has the control\n\nIn the case of Binance Chain, Binance clearly sought to build a scalable blockchain and, in doing so, sacrificed decentralization and security. Binance’s stated goal was to gradually decentralize Binance Chain as new validators joined the network and the ecosystem grew. The initial heavy centralization was to be temporary during the product launch phase.\n\nIn September 2020, the BNB, now primarily on the Binance Chain, fueled the launch of the Binance Smart Chain (BSC), and the Binance Chain was renamed the Beacon Chain. The Beacon Chain is used for governance and decision-making platforms, and the BSC is used for smart contract functionality and decentralized application creation. In February 2022, the two chains came together to form the BNB Chain, which consists of the BNB Beacon Chain and the BNB Smart Chain.\n\nThe Proof of Staked Authority (PoSA)\n\nFirst, the BNB Chain uses a consensus mechanism called Proof of Staked Authority (PoSA) for transaction validation and network governance.\n\nIn this system, a validator must undergo a strict Binance verification process before being allowed to validate transactions and generate new blocks. Once approved, users can delegate their BNB tokens to these validators, who then share in the block rewards.\n\nIn Proof-of-Stake protocols, users can stake their tokens and become validators, thus influencing the governance of the protocol. But with the Binance consensus mechanism, a centralized company, Binance, authorizes validators. So you have to get Binance’s authorization to access all the validators on the chain, which is far from an authorization-free system.\n\nHow many validators are there in the BNB Smart Chain today?\n\nThere are only 21 active BNB chain validators. Even worse, most of the validators in the BNB Chain ecosystem are either directly managed by Binance or have close relationships or partnerships with the company.\n\nDecentralization, we were told…\n\nBinance and FTX: the same thing?\n\nAt the heart of the FTX fiasco was the issuance of its own token, FTT, which allowed the company to inflate its balance sheet. By controlling the liquidity of the FTT token on the exchange, FTX was able to inflate its price to astronomical levels, which caused the company’s valuation to skyrocket. This attracted additional funding from venture capitalists, allowing FTX to grow and increase its influence. The company even used FTT tokens as collateral for loans to acquire dollars, which were then spent on a variety of investments ranging from crypto startups to beachfront property in the Bahamas.\n\nBinance followed a similar path, offering its own exchange token (BNB), with over 40% of the offering allocated to the founding team. Looking at Binance’s strategy over time, it becomes clear that most of the action is focused on increasing the price of BNB. This makes sense since Binance is the largest holder of the token.\n\nComparison between FTX and Binance\n\nBNB must be pummeled at all costs!\n\nTherefore, Binance is actively bringing value to BNB through use cases, incentives and strategic implementations. Users receive discounts on transaction fees when using BNB, the token is also used as gas on the BNB blockchain, and users can bet on BNB to earn a return on the platform.\n\nThe most blatant method that Binance has employed to boost the price of BNB is its burn program. In the ICO white paper, it states, “Each quarter, we will use 20% of our profits to buy back BNB and burn them until we buy back 50% of all BNB.” In a 2018 interview, CZ said, “This burn mechanism is similar to a dividend, but instead of sending money, we destroy the coins we have.”\n\nBinance’s questionable audit\n\nFollowing the FTX collapse, Binance came under scrutiny and requested an independent audit to ensure that all user funds were safe on the exchange. In a now famous interview on CNBC, the anchor asked CZ if Binance could handle a $2.1 billion withdrawal request.\n\nCZ dodged the question by replying, “We’re financially comfortable. We will let the lawyers handle it. We are financially sound.” What followed was not a full independent audit as requested, but rather a report on the evidence of reserves from Binance’s audit firm, Mazar’s Group, which provided an incomplete view of the company’s balance sheet. Mazar’s Group eventually removed Binance’s proof of reserves from its website and then suspended all business with crypto companies.\n\nLike FTX, this creates a conflict of interest and leads us to wonder if Binance acted to manipulate the price of BNB for the benefit of its own business. The similarities in the price movements of BNB and FTX are certainly cause for concern.\n\nSource: Midjourney\n\nBinance: a prosperity based on shitcoins\n\nWhen Binance burst onto the scene in 2017, the platform attracted new users at an astonishing rate. One of the strategies Binance used to differentiate itself from its competitors was to offer visibility to a wide variety of cryptos. Binance has listed every conceivable shitcoin.\n\nIf a user wants to buy an obscure token, chances are they can find it on Binance. As of the end of 2018, Binance listed 151 coins. To put that in perspective, at the end of 2018, Coinbase had 9 cryptos listed. This led to many accusations that Binance did not have internal policies and procedures in place to verify if a token was a scam.\n\nThe point is that Binance has an incentive to list as many tokens as possible to collect fees and generate revenue, regardless of the legitimacy of the tokens.\n\nThe imaginary seat\n\nOne of the key factors that allowed Binance to become the world’s first crypto exchange was its ability to evade regulators by not establishing a fixed headquarters in a specific jurisdiction. Initially, Binance was based in China, but it moved its servers to Japan shortly before China cracked down on crypto platforms.\n\nJapanese regulators then issued a warning to Binance that it was operating without a license, prompting Binance to move to Malta in 2018. In February 2020, Malta’s financial regulators clarified in a statement that Binance did not have a license to operate in the country. The precise location of Binance’s operations remains unclear today. A holding company is located in the Cayman Islands, and at least 73 entities controlled by CZ exist around the world, but it refuses to disclose which entity is responsible for the main exchange.\n\nThis failure to comply with financial laws is at the heart of the CFTC’s recent lawsuit against Binance in the United States. In the complaint, the CFTC explains how Binance deliberately evaded U.S. regulations by concealing the location of its headquarters.\n\nIf Binance is found guilty, the court could fine the company billions of dollars. Although Binance has not yet been formally charged with fraud, it is hard to ignore the many red flags and striking similarities to the FTX collapse. If you still have funds in Binance, the warning signs are undeniable. Not your keys, not your coins.\n\nMaximize your Cointribune experience with our 'Read to Earn' program! Earn points for each article you read and gain access to exclusive rewards. Sign up now and start accruing benefits.\n\nClick here to join 'Read to Earn' and turn your passion for crypto into rewards!\n\nA A Lien copié"
    }
]