[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiLGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wcmljZS9hcmItcHJvdG9jb2wv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Mar 2023 07:00:00 GMT",
        "title": "ARB Price | ARB Price Index and Live Chart - CoinDesk",
        "content": "Bitcoin Price Index XBX\n\nThe CoinDesk Bitcoin Price Index (XBX) is the world’s leading reference for the price of bitcoin, used by the largest institutions active in crypto assets. It is the crypto market standard, benchmarking billions of dollars in registered financial products and pricing hundreds of millions in daily over-the-counter transactions. Built for replicability and reliability, in continuous operation since 2014, the XBX is relied upon by asset allocators, asset managers, market participants and exchanges. The XBX is the flagship in a portfolio of single- and multi-asset indices offered by CoinDesk ."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vd3d3Lm9ubHlpbnlvdXJzdGF0ZS5jb20vYWxhYmFtYS9iZWQtYW5kLWJyZWFrZmFzdHMtYWwv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Mar 2023 07:00:00 GMT",
        "title": "The 17 Best Bed & Breakfasts In Alabama For Your Next Getaway - Only In Your State",
        "content": "Best Bed and Breakfast in Alabama\n\nDoes Alabama have any haunted hotels?\n\nNow that you've browsed through some of the most charming inns in Alabama, you might be curious about another experience: haunted hotels. Well, you've come to the right place! Alabama is riddled with paranormal activity, and here are some infamous haunted hotels:\n\nThe Malaga Inn\n\nFort Conde Inn in Mobile\n\nThe Victoria Inn in Anniston\n\nSt. James Hotel in Selma\n\nKeep reading about these haunted hotels in Alabama and a few more in this article.\n\nA bit more about the Malaga Inn. The Malaga Inn started as a pair of twin townhomes in 1862, built for two sisters. The homes were eventually connected and became a hotel in the 1960s. The hotel still operates today and is considered to be one of the most unique and beautiful stays in Alabama. However, it's also notorious for being haunted. Seemingly filled with paranormal activity, the rooms are known to act on their own accord. In other words, it's not uncommon to experience flickering lights, furniture moving by itself, and even chandeliers swinging back and forth for no apparent reason. You may even spot the ghost of a woman dressed in all white, pacing the veranda of Room 7. Learn more about the haunted Malaga Inn... if you dare!\n\nWhat are some hidden gems in Alabama?\n\nOne of the best ways to experience Alabama is to explore the off-the-beaten-path destinations. In fact, an entire road trip itinerary has been assembled that will take you to the top hidden gems in the state. Some of the destinations along the way include\n\nRattlesnake Saloon in Tuscumbia\n\nDismals Canyon in Phil Campbell\n\nNatural Bridge\n\nLewis Smith Lake\n\nThe Pizitz Food Hall in Birmingham\n\nOrr Park in Montevallo\n\nWilderness Park in Pratville\n\nCurious to learn more? Check out the full itinerary of our hidden gems road trip through Alabama."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmRpeWludGVybmF0aW9uYWwuY29tL2NvbnRlbnQvZGl5cGx1cy8yMDIzLzAzLzIwL3RoYWktd2F0c2FkdS10by1maXJtLXVwLXBvc2l0aW9uaW5nLWluLXRoYWktaG9tZS1pbXByb3ZlbWVudC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Mar 2023 07:00:00 GMT",
        "title": "Thai Watsadu to firm up positioning... - DIY International",
        "content": "In a bid to buttress its hold on the second spot in the Thai home improvement market, multi-category, multi-format retailer Central Retail Corp. (CRC) is ramping up the expansion of Thai Watsadu. CRC told investors it plans to add ten Thai Watsadu outlets this year to the 70 it had as of end-2022. This is four more than the six Thai Watsadu stores built last year.\n\nThai Watsadu is CRC’s home improvement brand, along with Baan & Beyond/BNB Home. They fall under CRC’s hardline segment, which also includes Power Buy, OfficeMate, B2S, MEB and Nguyen Kim, which operates electronics stores in Vietnam.\n\nCRC's DIY business became number 2 with 70 stores in 42 provinces in Thailand, the company disclosed. “Thai Watsadu accelerates expansion to strengthen [this] position,\" the retailer underlines.\n\nThai Watsadu has three store formats: the large format, which has an average net selling space of 15 000 to 20 000 m²; the small format, known as Thai Watsadu: building, hardware, sanitary ware, with an average net selling space of 8 000 m²; and the hybrid format, which houses Thai Watsadu and BNB Home under one roof.\n\nCRC said it has earmarked 26 per cent of the group’s capital expenditures for 2023, amounting to 25-28 bn Thai baht (THB, EUR 686-768 mio) – or between THB6.5 bn and THB 7.28bn – for the construction of the new home improvement stores.\n\nHardline makes up 34 per cent of CRC’s revenues, though its food business takes up the biggest share at 40 per cent. Its fashion brands contribute the rest.\n\nRival Home Product Center Public Company Ltd., which ended 2022 with revenues of THB 65.091 bn and 110 stores, is widely considered the top Thai home improvement retailer.\n\nAlthough CRC’s hardline category raked in sales of THB 72.851 bn during the same period, the amount is not exclusively from Thai Watsadu; it reflects overall sales from CRC’s electronics, construction materials and equipment, home decor, DIY products, stationery, office supplies, and e-books businesses.\n\nThe first Thai Watsadu store was opened in 2010. Three years later, Baan & Beyond likewise welcomed the Thai public to its first standalone store.\n\nJennee Grace U Rubrico"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vcHJvdG9zLmNvbS9jb21tdW5pdHktcXVlc3Rpb25zLW9wYXF1ZS1maW5hbmNlcy1hdC1ibmItY2hhaW4tcHJvdG9jb2wtdmVudXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Mar 2023 07:00:00 GMT",
        "title": "Community questions opaque finances at BNB Chain protocol Venus - Protos",
        "content": "Listen to this article.\n\nThe largest DeFi money market on Binance’s blockchain, Venus (XVS), finances a curious book. A string of events put it at risk of overexposure to assets from hacks and bridge exploits. For example, Venus considers some $250 million worth of stolen BNB to be part of its so-called total value locked (TVL).\n\nToday, it claims to possess roughly $950 million of TVL within Binance’s Smart Chain ecosystem, inclusive of those illegitimate funds. While large, the figure is 85% below its May 2021 high of $7 billion.\n\nCommunity members have accused Venus Protocol of hiding some of its liabilities, as well.\n\nVenus only operates in the Binance ecosystem, but that hasn’t stopped it from issuing a flurry of tokens. Venus is as complicated as the labyrinth of companies that compose Binance itself.\n\nVenus has no less than three proprietary tokens: XVS, VRT, and VAI.\n\nIt also issues four wrapped versions of third-party stablecoins: vUSDC, vBUSD, vUSDT, and vDAI.\n\nIt also wraps at least a dozen popular assets, including vBTC, vETH, vLTC, BNB, vDOGE, vXRP, and many others.\n\nSome of the bad debt that finances Venus\n\nIn addition to holding the multi-hundred million dollar proceeds of one of the world’s largest thefts, Venus has also collected other forms of tainted collateral.\n\nAll the way back in 2021, the main Venus token (XVS) whipsawed within six hours and caused $200 million in Venus Protocol liquidations. Specifically, on May 18, XVS round-tripped from $76 to $143 to $76. Those liquidations left it with $100 million in bad debt. Nowadays, XVS is trading under $6.\n\nMost of that bad debt used XVS as collateral to take loans from Venus. Debtors simply defaulted on their XVS-backed loans altogether, escaping with the loaned finances rather than reclaiming their XVS posted as collateral.\n\nThe Block researcher Igor Igamberdiev suspected market manipulation involving large XVS holders who had posted their tokens as collateral for significant Tether, USD Coin, and Binance USD “loans” that they never intended to repay.\n\nVenus’ third quarter 2022 report indicated 1,619 insolvent accounts worth $51.3 million but otherwise didn’t provide a breakdown of liabilities.\n\nIt remained tight-lipped on outstanding financial obligations, disclosing a “long-lasting issue” with something called Autofarm that it admitted was 15% unresolved.\n\nMost concerningly, Venus hasn’t released an official financial report to its community for the last two quarters (Venus simply pointed to a third-party Q4 report by an independent Messari researcher, which overlooked Venus’ hundreds of millions of dollars in stolen funds from the BNB Smart Chain hack).\n\n3/ @VenusProtocol Q4 from @PortKey256\n\n\n\n+@Binance Launchpad and Launchpool drove interest revenue increase, up 246% QoQ\n\n+Users claimed 2.3M in $XVS tokens in 22'\n\n+Venus v4 upgrade emission reduction helped to lower sell pressure on $XVS\n\n\n\n🔗 https://t.co/M49ExDkkZ6 pic.twitter.com/1bTK7JQP4l — Messari (@MessariCrypto) January 13, 2023\n\nRead more: DeFi project LaunchZone claims to be latest victim of BNB chain exploits\n\nSome insiders are already fleeing to safety. On March 2, someone withdrew $21.4 million of Binance-peg stablecoin BUSD from Venus and deposited all of it into Binance. On March 11, a wallet labeled Justin Sun redeemed 1 million BUSD Binance-peg USDC from Venus.\n\nVenus founder Joselito Lizarondo initially attempted to put a positive spin on the whipsaw of May 18, 2021. He noted that the protocol worked as intended and pointed out attempts to generate Venus activity in order to qualify for the Venus Reward Token (VRT) airdrop for XVS holders as of its May 17, 2021 snapshot date.\n\n$220 liquidation price on BNB\n\nTo sum up: In February 2023, a researcher predicted Venus (XVS) could be in trouble again if any finances caused BNB to drop below $220. (In a close encounter, BNB recently dipped to $265 on March 9, 2023.) That price level, which rises slowly over time, could have triggered one of the largest auto-liquidations in the history of DeFi.\n\nThat researcher cited the same BNB bridge exploit that fraudulently minted 2 million BNB on October 7, 2022. The exploiter deposited 900,000 BNB into Venus Protocol to use as loan collateral and withdrew USDT, USDC, and BUSD.\n\nIt’s possible that Venus Protocol might hide off-balance-sheet or otherwise negative financials in its accounting. It was hit hard by bad loans in May 2021 as hackers used its lending platform to launder funds after one of the largest crypto thefts in history.\n\nFor more informed news, follow us on Twitter, Instagram, and Google News or subscribe to our YouTube channel."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3LmZpbmRlci5jb20uYXUvbmV3cy9iaXRjb2luLWRvbWluYW5jZS13aGVuLXRvLWV4cGVjdC1hbHRjb2luLXNlYXNvbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin dominance: when to expect altcoin season? - finder.com.au",
        "content": "The crypto market has shown a strong start to 2023 - let's look at some key factors to help determine if the momentum is sustainable.\n\nSponsored by Binance Australia. BTC / TUSD with zero spot trading fees.\n\n🔶 Plus: earn up to 100 USDT trading fee credit by completing welcome offer tasks within 7 days of sign up. T&Cs apply. Learn more\n\n\n\n\n\nSponsored by Binance Australia. Trade BTC / TUSD with zero spot trading fees. 🔶 Plus: earn up to 100 USDT trading fee credit by completing welcome offer tasks within 7 days of sign up. T&Cs apply.\n\nLearn more\n\nDisclaimer: This information should not be interpreted as an endorsement of cryptocurrency or any specific provider, service or offering. It is not a recommendation to trade.\n\nSince its launch in 2009, Bitcoin has dominated the crypto market. It has grown to become a mainstream asset class that attracts a wide variety of investors and turns over billions of dollars in daily trading volume.\n\nHowever, over the past few years, many other digital assets, known as altcoins, have emerged and gained significant popularity, eating away at Bitcoin's share of the total crypto marketcap – otherwise known as Bitcoin dominance.\n\nThis was witnessed at the highest degree during the 2021-2022 bull run when many coins and tokens rallied upwards of 1,000%. While BTC made new highs during this time, its returns were far less, causing a drastic drop in its dominance percentage.\n\nThe question on many people's minds is when will altcoins once again have their moment in the sun?\n\nThis article will explore the concept of Bitcoin dominance, its role in market cycles and the factors that could help indicate the dawn of a new altcoin season.\n\nIdentifying market cycles\n\nWhile markets are viewed by many as moving up or down - bullish or bearish - they often move in distinct long-term phases, known as cycles.\n\nMarket cycles are characterised by 4 phases – accumulation, markup, distribution and markdown.\n\nWhile there's no fixed or definitive timeline, the patterns typically remain the same. Identifying these patterns can help you enter during an accumulation or markup phase and amplify your long-term profit potential.\n\nAlthough price cycles are a result of money flowing in and out of the market, these fluctuations are primarily driven by market psychology – fear, greed and cognitive biases.\n\nMarket psychology plays an important role in identifying entries and exits and is explained in depth in the Binance Academy article - The Psychology of Market Cycles.\n\nBitcoin dominance on the rise\n\nBitcoin dominance is a key metric used by investors to help determine where we are in the market cycle and plan entries and exits accordingly.\n\nThis percentage value is calculated as follows:\n\nBTC marketcap / Total crypto marketcap * 100\n\nAt the time of writing, the combined marketcap of all cryptocurrencies is US $1.15 trillion, while Bitcoin's marketcap is US $530.5 billion.\n\nThis means that Bitcoin's dominance is currently sitting at 47.28%.\n\nBy monitoring Bitcoin's dominance percentage, investors can gain insight into market trends and identify potential opportunities.\n\nIn the past, traders have used this metric to help identify when money is flowing out of Bitcoin and into lower marketcap trading pairs. Recognising this change allowed these savvy investors to diversify their portfolios at the right time and gain early entry to altcoin season and the high returns that followed.\n\nBinance Guide: What Is Binance BTCDOM Index\n\nAltcoin season: How to plan your investments\n\nIn the past, altcoin season has come in various trends, including DeFi summer, the NFT boom and the Metaverse hype.\n\nWhile the coins and tokens may differ each cycle, altcoins season is typically characterised by a significant drop in Bitcoin's dominance percentage and the rallying of lower marketcap trading pairs.\n\nWe spoke to Liam O'Doherty from Binance Australia to get his thoughts on where we are in the current market cycle and what Bitcoin's current dominance of 47.28% might mean moving into the second quarter of 2023.\n\n\"When markets rally, major traders will look for better returns than Bitcoin (BTC). During these periods, they'll often trade between BTC and altcoins (instead of fiat or stablecoins) to take advantage of the overall market movement. When BTC rallies, a rally in altcoins often follows as traders use new profits to seek further gains in alts.\"\n\nWhile it's impossible to predict the exact timing of the next altcoin season, Liam raises a good point. After a shaky 2022, Bitcoin has shown strength in the early stages of 2023.\n\nThe 'king of crypto' has gained about 10% in the past 2 months, leading to a rise in its dominance percentage, with many traders turning to Binance to utilise the platform's zero spot trading fees across 13 Bitcoin spot pairs.\n\nAlthough BTC has a long way to go before reaching its previous all-time highs, investors who purchased at 2022 lows may look to take profits and diversify into lower marketcap altcoins.\n\nThis diversification was witnessed during the 2021 bull run when altcoins such as BNB (the native coin of Binance exchange and BNB Chain) saw exponential growth. Over the course of about 6 months, BNB gained 2,442% while BTC rose 284%.\n\nIt's important to remember that past performance is not an indication of future returns.\n\nDuring the 2021 altcoin season, Bitcoin's dominance percentage dropped below 40% as profits were taken and investors diversified their portfolios into high-performing alternatives.\n\nPiecing the puzzle together\n\nWhile understanding market cycles and tracking Bitcoin dominance can help you identify when an altcoin season is approaching, it's also important to watch the development progress and roadmap of some of your favourite projects.\n\nLiam from Binance agreed that the crypto space can be overwhelming and full of speculation. It's probably best to stay away from speculative and high-risk investments and focus on the fundamentals.\n\n\"To see a true alt season, you want to see a surge in development of tech.\"\n\nProjects that are reaching their goals and helping to push the limits of blockchain technology are the ones that will most likely perform well over the long term.\n\nThere's no set formula for predicting or trading the market – it's crucial to do your own research (DYOR) and consider your risk appetite before investing. Always follow a trading or investment plan and conduct due diligence in research through reputable sources such as Binance Academy.\n\nMarketcap vs price: thinking about when to buy One of the most important metrics to consider when planning your crypto investments is market capitalisation or simply marketcap. Marketcap refers to the total valuation of a cryptocurrency project. This value can be calculated by multiplying the price of an asset by its circulating supply of tokens or coins. For example, a project with 1 million tokens worth $10 each has the same marketcap as a project with 10 million tokens worth $1 each. Not understanding this can lead beginner investors to purchase cryptos based on their token price or because it's 'cheap' compared to the price of one Bitcoin. Some low-priced cryptos, such as Shiba Inu (SHIB) and Dogecoin (DOGE), are highly valued, with multi-billion dollar marketcaps. However, expecting these to reach a price of $10 per token is extremely unlikely and would lead to a total marketcap in the trillions – much higher than Bitcoin.\n\nDisclaimer: This information should not be interpreted as an endorsement of cryptocurrency or any specific provider, service or offering. It is not a recommendation to trade. Cryptocurrencies are speculative, complex and involve significant risks – they are highly volatile and sensitive to secondary activity. Performance is unpredictable and past performance is no guarantee of future performance. Consider your own circumstances, and obtain your own advice, before relying on this information. You should also verify the nature of any product or service (including its legal status and relevant regulatory requirements) and consult the relevant Regulators' websites before making any decision. Finder, or the author, may have holdings in the cryptocurrencies discussed.\n\nDisclosure: The author owns a range of cryptocurrencies at the time of writing\n\nImage: Getty\n\nGet started with Binance\n\n1 - 1 of 1 Name Product Deposit methods Fiat currencies Cryptocurrencies Offer Disclaimer Link OFFER Binance Australia Binance Australia OFFER Credit card, Cryptocurrency, Debit card, P2P 80\n\n381\n\nEarn up to US$100 in rewards by completing welcome tasks within 7 days of signup. T&Cs apply. Go to site Capital at risk View details Compare loading Fetching your data... loading\n\nCompare other crypto platforms here"
    }
]