[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vY29pbmdhcGUuY29tL3N1aS1nZXRzLWJpbmFuY2UtbGlzdGluZy1pb3UtcHJpY2Utc2V0LXRvLXNreXJvY2tldC_SAU1odHRwczovL2NvaW5nYXBlLmNvbS9zdWktZ2V0cy1iaW5hbmNlLWxpc3RpbmctaW91LXByaWNlLXNldC10by1za3lyb2NrZXQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 May 2023 07:00:00 GMT",
        "title": "Breaking: SUI Gets Binance Listing; IOU Price Set To Skyrocket - CoinGape",
        "content": "Crypto News: Sui Network, a Layer 1 blockchain’s native token SUI (IOU) is set to make its debut on the world’s largest crypto exchange, Binance. As per the announcement, Binance will list Sui and open trading for its 6 pairs (SUI/BTC, SUI/USDT, SUI/TUSD, SUI/BNB, SUI/EUR, and SUI/TRY) on May 3, 2023.\n\nAlso Read: Ripple Win Will Drag US SEC To Settle, Hints XRP Lawyer\n\nadvertisement\n\nBinance Yet To Announce SUI Perpetual Contracts\n\nSui network has been gaining traction among the crypto community as it moves close to its mainnet launch. Its native token SUI has already bagged listings of several crypto exchanges like OKX, Bybit, and Kucoin. However, unlike the launch of the APT future, Binance is yet to announce the listing of SUI perpetual contracts.\n\nAccording to the data provided by Coingeko, Sui price is up by 7% over the last 24 hours. It is trading at an average price of $3, at the press time. However, the token has registered a surge of over 2% in the last 1 hour. Read More Crypto News Here…\n\nRising among new trending cryptos, the token got a mention in an online quarrel between Changpend Zhao (CZ), Binance CEO, and Justin Sun, Tron Founder. However, it got settled in a few tweets.\n\nAlso Read: Cathie Wood’s Ark Goes Long On $COIN As Coinbase Moves Offshore\n\nCZ in a tweet stated that Binance and the team told Justin Sun an action will be taken against him if the Tron founder uses any of the tactics to grab the LaunchPool Sui token. He added that there LaunchPools are meant of air drops for retail users not for few whales."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZGVjcnlwdC5jby8xMzg2OTEvYmluYW5jZS11c2Vycy1kZXBvc2l0ZWQtNGItZmFybS1zdWktdG9rZW5zLWFoZWFkLW1haW5uZXQtbGF1bmNo0gFfaHR0cHM6Ly9kZWNyeXB0LmNvLzEzODY5MS9iaW5hbmNlLXVzZXJzLWRlcG9zaXRlZC00Yi1mYXJtLXN1aS10b2tlbnMtYWhlYWQtbWFpbm5ldC1sYXVuY2g_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 May 2023 07:00:00 GMT",
        "title": "Binance Users Deposited Over $4B to Farm SUI Tokens Ahead of Mainnet Launch - Decrypt",
        "content": "We do the research, you get the alpha! Get exclusive reports and access to key insights on airdrops, NFTs, and more! Subscribe now to Alpha Reports and up your game! Go to Alpha Reports\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBinance users flooded the exchange with over $4 billion to farm the highly-anticipated SUI token launch.\n\nThe world’s largest exchange by trading volume added support for the SUI token through its Launchpad for BNB and TUSD holders on Monday with the event ending on Tuesday.\n\nUsers staked tokens worth over $4 billion to farm SUI tokens. Due to the crowding of the pools, however, an average of one dollar invested in the launchpad only reaped 0.016 SUI.\n\nBinance Launchpad is a bootstrapping portal on the exchange, where the exchange sells or enables liquidity farming of tokens of new cryptocurrency projects.\n\nAD\n\nAD\n\nSUI is the native gas and governance token of the Move-based Layer-1 blockchain platform, Sui. The project was developed by several former senior executives and architects for Meta’s now-defunct digital wallet program, Novi. Its mainnet is expected to launch today at 8 am ET with the exchange indicating it will open trading shortly after.\n\nBinance will distribute 40 million SUI tokens, with 80% going toward BNB stakers and the rest toward TUSD stakers. The rewards were calculated on an hourly basis, with snapshots of staked balances taken each hour.\n\nThe total amount deposited in the pool officially surpassed $4.02 billion, with $770 million in the TUSD pool and BNB worth $3.2 billion.\n\nBinance isn’t the only exchange that’s partnered to dole out SUI tokens.\n\nAD\n\nAD\n\nKucoin and OKX were also tapped to launch to sell tokens, too, both of which concluded last month. The two platforms raised a total of $45 million via a public sale."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3Qvc3VpLW5ldHdvcmstbGF1bmNoZXMtbWFpbm5ldC1vcGVucy10b2tlbi1icmlkZ2UtZm9yLXVubGltaXRlZC10cmFuc2ZlcnMtYWNyb3NzLWNoYWluc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 May 2023 15:40:11 GMT",
        "title": "Sui Network Launches Mainnet, Opens Token Bridge for Unlimited Transfers Across Chains - BSC NEWS",
        "content": "WEB3\n\nDevelopers can now access the blockchain's resources and build the next big projects with unique utilities in the industry.\n\nSui Network Goes Live\n\nSui Network has finally announced its highly anticipated mainnet launch, allowing users to interact with its blockchain fully. In addition to the launch, the Layer-1 blockchain protocol’s secure token bridge is now available for users.\n\nSui’s mainnet went live on May 3 at 12:00 UTC, after devnet and multiple testnets. The launch represents a significant milestone for the blockchain protocol, coupled with its innovative token bridge. Now, developers can build on the fast, secure, and accessible blockchain. On the other hand, the bridge would allow users to seamlessly transfer assets between supported chains, including BNB Chain and Ethereum.\n\nFollowing the mainnet launch, the smart contracts platform could power the next generation of GameFi, Non-Fungible Tokens (NFT), and commercial Decentralized Applications (dApps) in the industry. Thus, users can expect numerous protocols which support digital asset ownership, transaction capabilities, and more in the coming weeks and months. Director of Sui Foundation, Greg Siourounis, promised support for developers in the long run.\n\n“I am deeply honored to help the Foundation support developers and proliferate the advancement of technology that is truly accessible and relevant to all facets of life, safe to use, and built by developers for developers,” Greg stated.\n\nSiu’s mainnet launch coincides with its native $SIU token launch on Binance exchange. As of writing, the coin is up over 1500% from its listing price, with huge potential to continue its bullish trend in the crypto market.\n\nWhat is Sui Network:\n\nSui is a layer-1 chain with low latency and high throughput. Sui's instant transaction finality makes it an excellent choice for on-chain use cases like DeFi and GameFi. Rust, a programming language focused on fast and secure transaction execution, creates the blockchain. Solana, another high-speed blockchain, also uses Rust as its programming language.\n\nLearn more about Sui Network:\n\nWebsite | Twitter | Discord\n\n‍"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8venljcnlwdG8uY29tL3NvbGFuYS1zdXJwYXNzZXMtZXRoZXJldW0taW4tbW9zdC1vbi1jaGFpbi1hY3RpdmUtYWRkcmVzc2VzL9IBVWh0dHBzOi8venljcnlwdG8uY29tL3NvbGFuYS1zdXJwYXNzZXMtZXRoZXJldW0taW4tbW9zdC1vbi1jaGFpbi1hY3RpdmUtYWRkcmVzc2VzLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 May 2023 07:00:00 GMT",
        "title": "Solana Surpasses Ethereum In Most On-Chain Active Addresses - ZyCrypto",
        "content": "Advertisement\n\nSolana, one of the largest “Ethereum Killers”, has surpassed the latter to become the network with the most transactions.\n\nOn Wednesday, Nansen shared a tweet comparing April’s most active on-chain addresses. According to the firm, Solana came in second after BNB Chain, becoming the network with the most active address by chain at 5.1 million in April.\n\nAnd despite that figure dropping by around 12% from March, the cryptocurrency network still managed to outdo Ethereum, which had 4.9 million active addresses in April.\n\nSolana also surpassed Ethereum by non-vote transactions last month. Non-vote transactions are transactions that do not involve any voting or decision-making by token holders. They typically involve the transfer of cryptocurrency between wallets or accounts and are the most common type of transaction on most blockchain networks due to their simplicity. According to Nansen data, as of April 30, Solana’s total non-vote transactions stood at 24.3 million compared to Ethereum’s 974,972.\n\nSolana’s attractive growth can be attributed to various factors, including a surge in developers and users due to its attractive transaction speeds and costs. Apart from announcing various developments that go into improving the network, including a Chat GPT plugin and a web3 phone, Solana’s ballooning transactions have also been propelled by NFTs.\n\nAdvertisement\n\nRecently, Mad Lads, a new project launched on Solana, became the most traded collection generating $17 million compared with $11 million for Yuga Labs’ Bored Ape Yacht Club collection during the last week of April. This is despite the Solana facing a major setback following the exit of y00ts and DeGods, two of its most popular collections, earlier this year.\n\nLaunched roughly a month ago, Mad Lads is a unique type of NFT that falls in a category called xNFTs. Ideally, xNFTs combine the features of traditional NFTs and executable code, meaning users can use them to conduct other activities such as gaming and chatting.\n\nThat said, Solana’s native token SOL has also performed well, soaring by over 116% since January 1. This is compared to Bitcoin, up 70%, and Ether, up just over 50% year-to-date.\n\nAt press time, SOL was trading at $21.47, down 3.36% in the past 24 hours, according to CoinMarketCap data. On the other hand, Ether rose by 1.66% in the same period and was exchanging hands at $1,851."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3Lm9ubHlpbnlvdXJzdGF0ZS5jb20vbmV3LW1leGljby9rb2tvcGVsbGlzLWNhdmUtYmVkLWFuZC1icmVha2Zhc3Qtbm0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 May 2023 07:00:00 GMT",
        "title": "Spend The Night In A Bed And Breakfast That's Inside An Actual Cave Right Here New Mexico - Only In Your State",
        "content": "As local travel experts, we know what travelers are looking for when it comes to finding the perfect accommodations for their next trip. To compile our lists, we scour the internet to find properties with excellent ratings and reviews, desirable amenities, nearby attractions, and that something special that makes a destination worthy of traveling for.\n\nAt Kokopelli’s Cave Bed and Breakfast in Farmington, New Mexico, we just know that you will feel like you’ve just stepped into an episode of “The Flintstones.” This bed and breakfast is not at a typical location for an overnight stay. Rather, Kokopelli’s Cave is located 70 feet below the surface of vertical cliffs. You’ll enjoy all of the comforts of the best bed and breakfast locations in the Land of Enchantment but with much more adventure when you stay at this house cave.\n\nTo learn more and to place your reservation, visit Kokopelli’s Cave Bed and Breakfast website.\n\nHave you ever been to this awesome bed and breakfast in Farmington, NM? If so, what was your favorite part? We’d love to read about your experience in the comments section below!\n\nIf you are looking for other interesting places to stay in New Mexico, here are 11 unique accommodations to consider.\n\nIf you’re still in the mood for more Land of Enchantment adventures, take a look at this video:\n\nWant more New Mexico in your inbox? Get the latest on things to see, do, and eat around New Mexico! spinner Thank you! You'll receive your first newsletter soon! An error occured. Subscribe\n\nMore to Explore Out and About in New Mexico Where can we find other accommodation options in New Mexico? Hacienda del Sol in Taos is set in an adobe home and was formerly used as a guest house for Georgia O'Keefe and other famous people.\n\nThe Hyatt Regency Tamaya Resort & Spa Santa Ana Pueblo in Bernalillo is a luxury accommodation and one of the top hotels in New Mexico.\n\nThe Hilton Santa Fe Buffalo Thunder in Santa Fe is popular, among other things, for its indoor as well as outdoor pools. Read on to learn more about some of the many other comfortable accommodation options in New Mexico. Where can we find waterparks in New Mexico? Cliff’s Amusement Park in Albuquerque has separate areas for younger and older kids.\n\nThe Santa Rosa Blue Hole (also called Park Lake) in Santa Rosa is an inflatable water park with aquatic-based activities.\n\nThe Abq Surf N' Slide at Hotel Cascada in Albuquerque features a wave pool, wading pools. water slides, and a lazy river. Read on to learn more about some of the many other waterparks in New Mexico. Where can we go for a weekend getaway in New Mexico? The town of Bernalillo is very popular for its great food, beautiful nature spots, and relaxing accommodation options.\n\nThe former ghost town now called Madrid draws folks from all over the state for its boutique shops, historic attractions, restaurants, and more.\n\nThe town of Red River is known for its wealth of mountain activities, restaurants, historic sites, and the Red River Resort in town which is very family-friendly. Read on to learn more about some of the many other places to go for a weekend getaway in New Mexico."
    }
]