[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8venljcnlwdG8uY29tLzAtMDAxLXNoaWJhLWludS1wcmljZS1pbi12aWV3LWFtaWQtc2hpYi1leHBsb2RpbmctZWNvc3lzdGVtLWFjdGl2aXR5LWFzLXNoaWJhcml1bS1kZWJ1dC1iZWNrb25zL9IBeWh0dHBzOi8venljcnlwdG8uY29tLzAtMDAxLXNoaWJhLWludS1wcmljZS1pbi12aWV3LWFtaWQtc2hpYi1leHBsb2RpbmctZWNvc3lzdGVtLWFjdGl2aXR5LWFzLXNoaWJhcml1bS1kZWJ1dC1iZWNrb25zLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 16 Aug 2023 07:00:00 GMT",
        "title": "$0.001 Shiba Inu Price In View Amid SHIB Exploding Ecosystem Activity As Shibarium Debut Beckons - ZyCrypto",
        "content": "Advertisement\n\nThe Shiba Inu ecosystem is flaring with massive developments and partnerships as the Shibarium launch finally comes knocking.\n\nAlpha Transform Holdings (ATH), a leading investment and digital advisory firm, has joined forces with the foundation behind SHIB Doggy DAO, a decentralised autonomous organisation governed by Shiba Inu token holders.\n\nAccording to a Tuesday announcement, ATH will provide advice and support to the foundation as it funds projects built on the Shibarium blockchain.\n\nThe partnership is a major coup for SHIB Doggy DAO, as it brings together a team of veteran leaders from Disney, News Corp, and Nasdaq with decades of experience in the blockchain industry. Enzo Villani, Michael Terpin, and Seth Shapiro are well-respected figures in the crypto space, and their expertise will be invaluable to the DAO as it seeks to build and grow the Shibarium ecosystem.\n\n“We are excited to partner with SHIB Doggy DAO to help them propel the Shibarium projects forward. We believe that Shibarium has the potential to be a major player in the blockchain space, and we are committed to providing the DAO with the support it needs to succeed.” Said Enzo Villani, ATH’s CEO and Chief Investment Officer.\n\nAdvertisement\n\nIn addition to the partnership with ATH, the SHIB Doggy DAO has also been making other moves to prepare for the launch of Shibarium. In recent weeks, the DAO has announced several new projects built on the Shibarium blockchain, including a decentralised exchange, a lending platform, and a non-fungible token (NFT) marketplace.\n\nThe announcement comes even as the crypto community anticipates the Shibarium layer 2 protocol launch this week. So far this week, the team behind the project have been dropping hints since the Blockchain Futurist Conference in Toronto, where Shibarium is likely to be announced, kicked off on Monday.\n\nAnd although the exact launch date of Shibarium had yet to be confirmed at press time, a tweet from LUCIE, the Chief Marketing Strategist for Shiba Inu, earlier on Wednesday hinted that it could be launched on Thursday, August 17.\n\nThat said, the launch of Shibarium is expected to be a major milestone for the Shiba Inu ecosystem as it will drastically reduce gas fees, increase transaction speeds and make it easier for developers to build decentralised applications on the Shiba Inu blockchain.\n\nWith over 2 million wallets already registering for the beta testnet, the live Shibarium could potentially lead to a surge in the adoption of Shiba Inu amid the SHIB price outlook to $0.001 and other tokens in the ecosystem."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8venljcnlwdG8uY29tL2luLWEtdmMtc3BlY3RyYS1kb21pbmF0ZWQtbWFya2V0cGxhY2UtYXB0b3MtaGVkZXJhcy1jaGFsbGVuZ2VzL9IBWGh0dHBzOi8venljcnlwdG8uY29tL2luLWEtdmMtc3BlY3RyYS1kb21pbmF0ZWQtbWFya2V0cGxhY2UtYXB0b3MtaGVkZXJhcy1jaGFsbGVuZ2VzLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 16 Aug 2023 07:00:00 GMT",
        "title": "In a VC Spectra-Dominated Marketplace, Aptos & Hedera’s Challenges - ZyCrypto",
        "content": "Advertisement\n\nAptos (APT) and Hedera (HBAR) face challenges in the market as VC Spectra (SPCT) continues to dominate. Aptos (APT) continues to trend lower in spite of a recent Microsoft partnership, while Hedera (HBAR) recently experienced a massive plunge, unaffected by a recent partnership with RAK DAO. Let’s dive into the news and examine why VC Spectra is proving to be a force to be reckoned with.\n\nAptos (APT) Plunges After A Microsoft-Driven Hype Rally\n\nAptos (APT) recently plunged 7.1% in just four days. Aptos (APT) fell from $7.82 on August 9, 2023, to trade at $7.16 on August 13, 2023.\n\nAlthough devastating, this drop is only a tenth of the 70% drop Aptos (APT) has experienced over the year. Aptos (APT) fell from a yearly high of $19.92 on January 26, 2023, to as low as $5.89 on June 10, 2023.\n\nOn a more positive note, the Aptos (APT) token experienced an 11.6% surge following the August 9, 2023, announcement of a collaboration with Microsoft to integrate AI tools into its blockchain network and enhance Web3 adoption in the financial sector. The partnership aims to leverage Microsoft’s Azure OpenAI service and introduce innovations in asset tokenization and on-chain payments.\n\nThis rapid price increase occurred within 50 minutes after the news was revealed, propelling APT to $7.92 before settling at $7.51. However, Aptos (APT) struggles to maintain these gains as it continues to trend lower.\n\nAdvertisement\n\nHedera (HBAR) Dips Lower Despite Promising Partnership\n\nHedera (HBAR) continues to trend lower, with the price falling 12.6% within three days. This occurred as Hedera (HBAR) fell from $0.063 on August 9, 2023, to $0.055 on August 12. Hedera (HBAR) has since slightly recovered as of August 13, trading higher at $0.056.\n\nRAK Digital Assets Oasis (RAK DAO), a United Arab Emirates (UAE) free zone catering to crypto companies, has partnered with the HBAR Foundation to assist Web3 startups. This assistance is provided via a grant program and expertise in leveraging the Hedera (HBAR) blockchain.\n\nWhile the partnership with Hedera (HBAR) is broadly considered a good move, the current regulatory uncertainties in the crypto industry might hamper startups looking to benefit from this initiative.\n\nAnalysts predict Hedera (HBAR) might continue to trend lower if a sustained break below the $0.055 support level occurs.\n\nVC Spectra Continues to See Massive Acquisition\n\nVC Spectra (SPCT) is a decentralized hedge fund specializing in lucrative prospects within the cryptocurrency and fintech sectors. VC Spectra (SPCT) users gain entry to a diverse selection of tokens and niche markets, coupled with the added benefits of quarterly dividends and buybacks derived from their asset gains.\n\nIn addition to serving as the primary transaction medium, VC Spectra’s native SPCT token offers users access to various platform services. Furthermore, SPCT tokens allow users to vote on the platform’s moves.\n\nVC Spectra (SPCT) is in the second stage of its public presale, offering its tokens for $0.011. Users who acquire SPCT now can anticipate a substantial 127.27% increase in value as VC Spectra (SPCT) progresses to Stage 3, where SPCT is projected to be worth $0.025.\n\nAs VC Spectra (SPCT) advances through its successive presale stages, its value is predicted to ascend to $0.080. This implies that Stage 2 users could enjoy remarkable gains of up to 627% when SPCT becomes available on exchanges. Additionally, participants can take advantage of an extra 25% bonus on their deposited funds.\n\nLearn more about the VC Spectra presale here:\n\nBuy Presale: https://invest.vcspectra.io/login\n\nWebsite: https://vcspectra.io\n\nTelegram: https://t.me/VCSpectra\n\nTwitter: https://twitter.com/spectravcfund\n\nDisclaimer: This is a sponsored article, and views in it do not represent those of, nor should they be attributed to, ZyCrypto. Readers should conduct independent research before taking any actions related to the company, product, or crypto projects mentioned in this piece; nor can this article be regarded as investment advice."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vaW5zaWRlYml0Y29pbnMuY29tL25ld3MvcGFuY2FrZXN3YXBzLWNha2UtcHJpY2UtcHJlZGljdGlvbi1wb2lzZWQtZm9yLTMyLWxlYXDSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 16 Aug 2023 07:00:00 GMT",
        "title": "PancakeSwap's CAKE Price Prediction: Poised for 32% Leap - Inside Bitcoins",
        "content": "Don’t invest unless prepared to lose all the money you invest. This is a high-risk investment, you shouldn’t expect to be protected if something goes wrong.\n\nJoin Our Telegram channel to stay up to date on breaking news coverage\n\nokenPancakeSwap’s native token, CAKE, appears set for a potential 32% surge. Given the asset’s expanding prominence, this projected leap holds promise for investors and underscores the platform’s growing influence in the DeFi space.\n\nAt 5:10 am EST on August 16, the price of CAKE is down by 2.48%. The token is trading at $1.44 with a 24-hour volume of over $23.78m, indicating a 21% increase.\n\nPrice Trends of PancakeSwap\n\nThe price of CAKE has fluctuated for some time, with the asset approaching the critical price level, fueling a potential price increase in the coming weeks. In the last seven days, the cake price decreased by 4%, and the DeFi coin lost 5% of its value in the previous 30 days.\n\nDespite the slight negative price trend in the past weeks, market observers and investors are optimistic about a positive price trajectory in the coming weeks.\n\nTechnical indicators on CAKE\n\nCAKE is trading below both 50-Day and 200-Day Simple Moving Averages (SMA), indicating that its price has been bearish in the short and long term. Although CAKE faces stiff resistance at the 50-Day SMA, a temporary price increase could follow suit if the asset flips this resistance.\n\nAlso, the Moving Average Convergence/Divergence is below the signal line with red histogram bars, which suggests a bearish price momentum.\n\nThe Relative Strength Index of 38.99 denotes price is approaching the overbought zone. A bullish trend reversal could occur if it crosses the oversold zone, signaling sellers’ exhaustion in lowering prices.\n\nThe combination of the following indicators denotes that prices could experience a significant increase in the coming weeks. However, the overall market sentiment is still bearish in the long term.\n\nFollowing Factors Could Affect Price of PancakeSwap\n\nHelio Protocol has introduced a new feature called SnBNB Liquid Staking on PancakeSwap. This new feature enables users to experience improved staking advantages while benefiting from the reliability of a trusted platform.\n\n1/4 🥳We're introducing a new token on our Liquid Staking Integration with Synclub – backed by @Helio_Money ✅You can now stake BNB and Earn SnBNB! 🥞Stake your BNB now https://t.co/IvorR45lt3 👇Let’s have a quick review of what is SnBNB and Liquid Staking pic.twitter.com/PeydVlPGjR — PancakeSwap v4🥞 (@PancakeSwap) August 15, 2023\n\nSnBNB functions as Synclub’s liquid staking token, providing both yield and appreciation in tandem with BNB’s staking annual percentage rate (APR).\n\nIn contrast to traditional staking approaches, which involve locking assets within a contract, liquid-staked tokens such as SnBNB provide versatility. They can be freely traded or used as collateral, enhancing yield across the decentralized finance (DeFi) ecosystem.\n\nThe process of converting BNB into SnBNB on PancakeSwap is both uncomplicated and smooth. Users can log on to PancakeSwap, connect their wallet, and swap BNB to SnBNB conversion.\n\nSnBNB Liquid Staking eliminates the need for users to make a trade-off between staking their assets and keeping liquidity accessible. By participating in staking through PancakeSwap, users can leverage the platform’s extensive user community and liquidity reserves.\n\nFurthermore, users can stake CAKE tokens to generate SnBNB rewards, which can boost the demand for the CAKE token and lead to an increase in price.\n\nChimpzee: Eco-Friendly Project with 40x ROI Potential\n\nChimpzee Coin strongly emphasizes environmental dedication, addressing vital concerns like safeguarding wildlife, mitigating climate change, and countering deforestation. The token demonstrated its commitment to wildlife and environmental conservation by donating over $20,000 to save endangered animals. It also planted over 20,000 trees.\n\nThe initiative blends cryptocurrency incentives with an innovative model for wildlife preservation, utilizing blockchain technology. This strategy is designed to safeguard wildlife and address climate change by employing tokenized incentives.\n\nChimpzee enables individuals to create a beneficial influence on the environment and rescue animals while gaining incentives. It offers a means for individuals to generate passive earnings while concurrently making a difference by safeguarding animals and combating climate change.\n\nThe Chimpzee ecosystem allows users to generate passive earnings while endorsing environmental initiatives. By allocating a portion of its profits to wildlife preservation and climate change groups, Chimpzee Coin effectively contributes to ecological well-being.\n\nThe project’s offerings, encompassing the Chimpzee shop, NFT marketplace, and Zero Tolerance Game, actively involve users and motivate their participation in advancing environmental objectives.\n\nChimpzee NFT passports offer enhanced benefits and incentives within the ecosystem, confirming your affiliation with the Chimpzee initiative dedicated to nature conservation and combating climate change.\n\nThe endeavor intends to develop a Chimpzee Transformation Generator. It’s an AI-driven application accessible on desktop and mobile devices, which will convert your photograph into a distinctive, individualized avatar.\n\nThe avatar can be utilized for platform access, gaming participation, trading within the Chimpzee NFT marketplace, or even printed on various items through Chimpzee’s printing service.\n\nThe CHMPZ token is selling out quickly in its presale round as the team has raised an impressive $1.195 million in funds with a token available for $0.00085 before the next game, where a token would be sold at $0.00095. Interested users can purchase $CHMPZ on the official project site using ETH/USDT or buy directly using a bank card.\n\nAlso Read:\n\nPlayDoge (PLAY) - Newest ICO On BNB Chain Rating 2D Virtual Doge Pet\n\nPlay To Earn Meme Coin Fusion\n\nStaking & In-Game Token Rewards\n\nSolidProof Audited - playdoge.io Join Presale"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZXh0ZW5kcy1sb3NzZXMtYXMtYm5iLWZhbGxzL9IBPWh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZXh0ZW5kcy1sb3NzZXMtYXMtYm5iLWZhbGxzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 16 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin extends losses as BNB falls - Forkast News",
        "content": "Bitcoin prices fell on Wednesday afternoon trade in Asia, along with all other top 10 non-stablecoin cryptocurrencies by market capitalization. Notably, BNB, the native token of the world’s largest cryptocurrency exchange Binance, added to its weekly drop after the company announced the closing of its cryptocurrency payment service Binance Connect. Investor concerns remained on edge following Fitch Ratings’ downgrade warning on Tuesday for dozens of major U.S. banks including JPMorgan.\n\nSee related article: TradFi has its eyes on crypto, and here’s the real reason why: Opinion\n\nBitcoin dips; Binance faces heat\n\nBitcoin dropped 0.69% to US$29,160 in the 24 hours to 4 p.m. in Hong Kong, bringing its weekly losses to 2.18%, according to CoinMarketCap data. Bitcoin has been trading below US$30,000 since last Wednesday. The world’s biggest cryptocurrency’s trading volume gained 8.71%, but its market capitalization lost 0.84% to US$567.23 billion in the past 24 hours.\n\n“Bitcoin’s earlier reputation as a highly volatile asset attracted traders who thrived on rapid price swings. With the decrease in volatility, such opportunities for substantial short-term gains have become less common,” said Nigel Green, founder and chief executive officer of financial management group deVere, in an emailed statement on Monday.\n\n“For investors who thrive on volatility, the calmer waters of the Bitcoin market can feel limiting. They must adapt their strategies to the new normal, focusing on longer-term trends and holding positions for extended periods,” Green added.\n\nBNB, the native token of the largest crypto exchange Binance, fell 1.92% to US$234.66, logging a 4.17% weekly decline. Binance said it will shut down its cryptocurrency payment service Binance Connect on Wednesday, due to “changing market and user needs.”\n\nBinance filed a protective court order against the U.S. Securities and Exchange Commission (SEC) on Monday, seeking to restrict the agency’s “overbroad” requests for information. The SEC sued Binance, its U.S. platform, and Chief Executive Officer Changpeng Zhao in June for alleged breach of securities laws.\n\nThe total crypto market capitalization fell 1.31% to US$1.16 trillion, while market volume climbed 22.48% to US$32.08 billion.\n\nDeGods sales drop, but tops rankings\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nThe Forkast 500 NFT index fell 0.14% to 2,471.55 over the 24 hours leading up to 7.10 p.m. in Hong Kong, but posted gains of 0.23% on the week.\n\nAt the same time, Forkast’s Ethereum NFT and the Polygon NFT indexes gained, while the index measuring Solana NFTs declined.\n\nTotal NFT sales volume dropped 2.16% in the past 24 hours to US$15.79 million, according to data from CryptoSlam. Total NFT transactions also dropped 9.78% to US$565,906.\n\nNFT sales volume on Ethereum dropped 7.97% to US$9.14 million, although the network topped CryptoSlam’s sales volume rankings.\n\nAmong collections, Ethereum-based DeGods topped sales rankings with US$1.23 million, although it was 37.85% lower than the previous day.\n\n“Clearly collectors have lost some faith in the DeGods team after fumbling the DeGods Season III art release, and the announcement of moving y00ts again from Polygon to Ethereum,” said Yehudah Petscher, NFT Strategist at Forkast Labs.\n\nMythos-based DMarket ranked second, rising 8.33% to US$1.01 million, while Polygon’s DraftKings ranked third after its sales volumes climbed 52.19% in the past 24 hours to US$771,722.\n\nAsian bourses, U.S. stock futures fall; European equities mixed\n\nImage: Envato Elements\n\nMost Asian equity markets were down on Wednesday. China’s Shenzhen Component, Hong Kong’s Hang Seng, Japan’s Nikkei, and South Korea’s Kospi dropped at the end of trading hours, following lackluster economic data coming out of China.\n\nThe country’s economic activity data for July — retail sales, industrial output and investment — all came in lower than expected, raising concerns about the health of the world’s second-largest economy. The People’s Bank of China on Tuesday unexpectedly cut loan rates by 15 basis points to 2.5%, the steepest cut in three years.\n\n“China’s cyclical soft patch keeps deepening. Data from a wide range of indicators, including credit growth, investment in capital markets and properties, industrial production, retail sales, construction, exports, and manufacturing and agricultural product prices reveal an overall loss of economic momentum,” Singapore-based DBS bank said in a research report on Monday.\n\n“In addition to lackluster economic data, a long-simmering threat to economic and financial stability, the intersection of weak property market prices and a mountain of debt in the sector, is causing considerable concern,” DBS added.\n\nU.S. stock futures dropped as of 8.30 p.m. in Hong Kong with the Dow Jones Industrial Average futures, the S&P 500 futures, and the Nasdaq 100 futures all in the red.\n\nRatings agency Fitch has warned of a downgrade for dozens of major U.S. banks including JPMorgan. The agency also downgraded the United States’ long term credit rating from AAA to AA+ earlier this month citing long-term macroeconomic concerns.\n\nMeanwhile, annual headline inflation in the United Kingdom dropped sharply to 6.8% in July from 7.9% in June, the lowest level since February 2022 and matching market expectations. However, core inflation, which excludes volatile energy, food, alcohol and tobacco prices, remained unchanged from June at 6.9%, and slightly above expectations of 6.8%.\n\n“The plan that we are executing on is clearly working, but we need to keep with that plan, keep making responsible decisions when it comes to public finances, and we need to make sure that fiscal policy is aligned with monetary policy at the Bank of England,” Gareth Davies, exchequer secretary at the U.K. Treasury, told CNBC on Wednesday.\n\nEuropean bourses were mixed on Wednesday, with the benchmark STOXX 600 falling while Germany’s DAX 40 strengthened during afternoon trading hours in Europe."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZXh0ZW5kcy1sb3NzZXMtYXMtYm5iLWZhbGxzL9IBPWh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZXh0ZW5kcy1sb3NzZXMtYXMtYm5iLWZhbGxzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 16 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin extends losses as BNB falls - Forkast News",
        "content": "Bitcoin prices fell on Wednesday afternoon trade in Asia, along with all other top 10 non-stablecoin cryptocurrencies by market capitalization. Notably, BNB, the native token of the world’s largest cryptocurrency exchange Binance, added to its weekly drop after the company announced the closing of its cryptocurrency payment service Binance Connect. Investor concerns remained on edge following Fitch Ratings’ downgrade warning on Tuesday for dozens of major U.S. banks including JPMorgan.\n\nSee related article: TradFi has its eyes on crypto, and here’s the real reason why: Opinion\n\nBitcoin dips; Binance faces heat\n\nBitcoin dropped 0.69% to US$29,160 in the 24 hours to 4 p.m. in Hong Kong, bringing its weekly losses to 2.18%, according to CoinMarketCap data. Bitcoin has been trading below US$30,000 since last Wednesday. The world’s biggest cryptocurrency’s trading volume gained 8.71%, but its market capitalization lost 0.84% to US$567.23 billion in the past 24 hours.\n\n“Bitcoin’s earlier reputation as a highly volatile asset attracted traders who thrived on rapid price swings. With the decrease in volatility, such opportunities for substantial short-term gains have become less common,” said Nigel Green, founder and chief executive officer of financial management group deVere, in an emailed statement on Monday.\n\n“For investors who thrive on volatility, the calmer waters of the Bitcoin market can feel limiting. They must adapt their strategies to the new normal, focusing on longer-term trends and holding positions for extended periods,” Green added.\n\nBNB, the native token of the largest crypto exchange Binance, fell 1.92% to US$234.66, logging a 4.17% weekly decline. Binance said it will shut down its cryptocurrency payment service Binance Connect on Wednesday, due to “changing market and user needs.”\n\nBinance filed a protective court order against the U.S. Securities and Exchange Commission (SEC) on Monday, seeking to restrict the agency’s “overbroad” requests for information. The SEC sued Binance, its U.S. platform, and Chief Executive Officer Changpeng Zhao in June for alleged breach of securities laws.\n\nThe total crypto market capitalization fell 1.31% to US$1.16 trillion, while market volume climbed 22.48% to US$32.08 billion.\n\nDeGods sales drop, but tops rankings\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nThe Forkast 500 NFT index fell 0.14% to 2,471.55 over the 24 hours leading up to 7.10 p.m. in Hong Kong, but posted gains of 0.23% on the week.\n\nAt the same time, Forkast’s Ethereum NFT and the Polygon NFT indexes gained, while the index measuring Solana NFTs declined.\n\nTotal NFT sales volume dropped 2.16% in the past 24 hours to US$15.79 million, according to data from CryptoSlam. Total NFT transactions also dropped 9.78% to US$565,906.\n\nNFT sales volume on Ethereum dropped 7.97% to US$9.14 million, although the network topped CryptoSlam’s sales volume rankings.\n\nAmong collections, Ethereum-based DeGods topped sales rankings with US$1.23 million, although it was 37.85% lower than the previous day.\n\n“Clearly collectors have lost some faith in the DeGods team after fumbling the DeGods Season III art release, and the announcement of moving y00ts again from Polygon to Ethereum,” said Yehudah Petscher, NFT Strategist at Forkast Labs.\n\nMythos-based DMarket ranked second, rising 8.33% to US$1.01 million, while Polygon’s DraftKings ranked third after its sales volumes climbed 52.19% in the past 24 hours to US$771,722.\n\nAsian bourses, U.S. stock futures fall; European equities mixed\n\nImage: Envato Elements\n\nMost Asian equity markets were down on Wednesday. China’s Shenzhen Component, Hong Kong’s Hang Seng, Japan’s Nikkei, and South Korea’s Kospi dropped at the end of trading hours, following lackluster economic data coming out of China.\n\nThe country’s economic activity data for July — retail sales, industrial output and investment — all came in lower than expected, raising concerns about the health of the world’s second-largest economy. The People’s Bank of China on Tuesday unexpectedly cut loan rates by 15 basis points to 2.5%, the steepest cut in three years.\n\n“China’s cyclical soft patch keeps deepening. Data from a wide range of indicators, including credit growth, investment in capital markets and properties, industrial production, retail sales, construction, exports, and manufacturing and agricultural product prices reveal an overall loss of economic momentum,” Singapore-based DBS bank said in a research report on Monday.\n\n“In addition to lackluster economic data, a long-simmering threat to economic and financial stability, the intersection of weak property market prices and a mountain of debt in the sector, is causing considerable concern,” DBS added.\n\nU.S. stock futures dropped as of 8.30 p.m. in Hong Kong with the Dow Jones Industrial Average futures, the S&P 500 futures, and the Nasdaq 100 futures all in the red.\n\nRatings agency Fitch has warned of a downgrade for dozens of major U.S. banks including JPMorgan. The agency also downgraded the United States’ long term credit rating from AAA to AA+ earlier this month citing long-term macroeconomic concerns.\n\nMeanwhile, annual headline inflation in the United Kingdom dropped sharply to 6.8% in July from 7.9% in June, the lowest level since February 2022 and matching market expectations. However, core inflation, which excludes volatile energy, food, alcohol and tobacco prices, remained unchanged from June at 6.9%, and slightly above expectations of 6.8%.\n\n“The plan that we are executing on is clearly working, but we need to keep with that plan, keep making responsible decisions when it comes to public finances, and we need to make sure that fiscal policy is aligned with monetary policy at the Bank of England,” Gareth Davies, exchequer secretary at the U.K. Treasury, told CNBC on Wednesday.\n\nEuropean bourses were mixed on Wednesday, with the benchmark STOXX 600 falling while Germany’s DAX 40 strengthened during afternoon trading hours in Europe."
    }
]