[
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA2LTE0L2JpbmFuY2UtYm5iLW1vdmVzLXRvLWRlcmVnaXN0ZXItY3lwcnVzLWVudGl0eS1haGVhZC1vZi1taWNhLWV1LWNyeXB0by1ydWxlc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Binance Moves to Deregister Cyprus Entity Ahead of New EU Rules - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA2LTE0L2JpbmFuY2UtYm5iLW1vdmVzLXRvLWRlcmVnaXN0ZXItY3lwcnVzLWVudGl0eS1haGVhZC1vZi1taWNhLWV1LWNyeXB0by1ydWxlc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Binance Moves to Deregister Cyprus Entity Ahead of New EU Rules - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvaGVyZXMtd2h5LWJpbmFuY2UtY29pbi1ibmItcHJpY2UtaXMtYXQtcmlzay1vZi1mdXJ0aGVyLWRvd25mYWxsLWlzLTIwMC1uZXh0L9IBbWh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvaGVyZXMtd2h5LWJpbmFuY2UtY29pbi1ibmItcHJpY2UtaXMtYXQtcmlzay1vZi1mdXJ0aGVyLWRvd25mYWxsLWlzLTIwMC1uZXh0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Here’s Why Binance Coin (BNB) Price Is at Risk of Further Downfall; Is $200 Next? - CoinGape",
        "content": "The first two weeks of June have been miserable for BNB holders as its price witnessed a significant freefall following its legal battle against the U.S. and the recent altcoin crash. From the June 1st high of $307.7, the Binance coin price lost nearly 28.5%, reaching a low of $220. However, amid this downfall, sellers gave a decisive breakdown from the symmetrical triangle pattern, suggesting that this altcoin may prolong its downward trend.\n\nAlso Read: Binance CEO CZ Responds to Allegations of Dumping BTC/BNB\n\nadvertisement\n\nBinance Price Daily Chart:\n\nThe breakdown of the triangle pattern intensifies the supply pressure in BNB prices.\n\nA long-wick rejection at $253 indicates that traders are experiencing high supply.\n\nThe intraday trading volume in the BNB coin is $745.5 million, indicating an 8% loss.\n\n(Source: Tradingview)\n\nOn June 10th, the falling BNB price breached the long-standing support trendline of a symmetrical triangle pattern. This pattern carried a sideways trend for nearly a year, and a breakdown below its key support intensified the underlying selling momentum.\n\nHowever, in the last two days, the coin price witnessed a minor upswing to retest the pierced support as potential resistance. At the time of writing, the Binance coin price traded at $248 and showed a rejection candle, suggesting that sellers are defending the new resistance.\n\nIf the supply pressure persists, sellers may resume the prevailing correction and plunge the prices 26.5% down to reach $182.5.\n\nWill the Binance Coin Price Plunge to $200?\n\nCompleting the symmetrical triangle pattern on a bearish note, the BNB price is poised for a massive downfall. The coin’s price is currently in a retest phase, where it validates that its price is experiencing sufficient supply pressure from the breached trendline. If sellers sustainably stay below the trendline, the coin price could drop to $220, followed by $200.\n\nAverage Directional Index: The ADX slope wavering at 41% reflects instability in the current downtrend, and thus, a minor pullback was necessary to replenish bullish momentum.\n\nExponential Moving Average: A bearish crossover between the 100-day and 200-day A bearish crossover between the 100-day and 200-day EMAs may attract more sellers to the market."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vYmxvY2ttYW5pdHkuY29tL25ld3MvYmluYW5jZS1jZW8tY2hhbmdwZW5nLXpoYW8tZGlzbWlzc2VzLWFsbGVnYXRpb25zLW9mLWJpdGNvaW4tc2FsZS10by1tYW5pcHVsYXRlLWJuYi1wcmljZXMv0gF7aHR0cHM6Ly9ibG9ja21hbml0eS5jb20vbmV3cy9iaW5hbmNlLWNlby1jaGFuZ3Blbmctemhhby1kaXNtaXNzZXMtYWxsZWdhdGlvbnMtb2YtYml0Y29pbi1zYWxlLXRvLW1hbmlwdWxhdGUtYm5iLXByaWNlcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Binance CEO Changpeng Zhao Dismisses Allegations of Bitcoin Sale to Manipulate BNB Prices - Blockmanity",
        "content": "In a recent development, Changpeng “CZ” Zhao, CEO of Binance, has strongly denied rumors suggesting that Binance has been selling Bitcoin in secret to artificially stabilize the price of its BNB token. The allegations, made by market commentators including analyst Dylan LeClair and Swan Bitcoin CEO Cory Klippsten, have sparked concerns over market manipulation and the authenticity of BNB’s value.\n\nResponding to the accusations on June 13, CZ took to Twitter to assert that Binance has not engaged in any BTC or BNB trading activities as alleged. Furthermore, he clarified that the exchange still retains a significant amount of FTX Tokens, the native currency of the now-defunct crypto exchange FTX. CZ dismissed the claims made by commentators, emphasizing the complexity of attributing specific sales to millions of traders based solely on a price chart, referring to the allegations as “FUD” (Fear, Uncertainty, and Doubt).\n\nThe response from CZ followed a post by technical analysis platform Skew on June 14, which accused Binance of manipulating the market through a series of trades involving BTC, BNB, and Tether. The post suggested that Binance was attempting to prevent BNB from crashing while inflating the value of the token.\n\nAllegations of Fake Volume and Wash Trading Surrounding Cryptocurrency Giant\n\nBitcoin analyst LeClair, participating in the same thread, labeled BNB’s market as “clearly fake,” highlighting its significantly lower realized volume compared to BTC. Additionally, Swan Bitcoin CEO Klippsten raised concerns about “wash trading” activities at Binance, alleging that the exchange was creating a false impression of support for BNB. Wash trading involves artificially inflating an asset’s demand or market activity by selling and subsequently repurchasing it.\n\nFurther scrutiny came from analyst Joe Consorti from The Bitcoin Layer, who deemed the price movement of BNB as “unusual,” specifically pointing out the firm defense of the $220 level. Consorti speculated that this level might be linked to the liquidation of BNB-collateralized loans.\n\nAs CZ’s response garnered attention, Consorti urged Binance to publish an audited statement to dispel any doubts about Binance’s BNB-collateralized liabilities and put an end to the “FUD” surrounding the matter.\n\nIt is worth noting that Binance.US, a separate entity from Binance, faced legal action from the United States Securities and Exchange Commission (SEC) on June 5. The SEC accused Binance.US of violating securities laws and engaging in wash trading through its trading firm Sigma Chain, owned by CZ. Binance and CZ have strongly denied the allegations and vowed to defend themselves vigorously in the U.S. District Court in Washington, D.C.\n\nAs the allegations continue to unfold, the crypto community awaits further developments and clarity regarding the accusations against Binance and its CEO.\n\nDiscuss this news on our Telegram Community. Subscribe to us on Google news and do follow us on Twitter @Blockmanity\n\nDid you like the news you just read? Please leave a feedback to help us serve you better\n\nDisclaimer: Blockmanity is a news portal and does not provide any financial advice. Blockmanity's role is to inform the cryptocurrency and blockchain community about what's going on in this space. Please do your own due diligence before making any investment. Blockmanity won't be responsible for any loss of funds."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vd3d3LmJpdGNvaW5tYXJrZXRqb3VybmFsLmNvbS9wcm90b2NvbHMtb24tYm5iLWNoYWluL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "The Ultimate Guide to the Top 10 Protocols on BNB Chain - Bitcoin Market Journal",
        "content": "Executive Summary: Since 2021, BNB Chain has made significant strides in the decentralized finance (DeFi) sector, now holding a roughly 8.5% market share and standing as a formidable competitor to Ethereum and Tron. BNB’s user-friendly design, compatibility with the Ethereum Virtual Machine, and lower transaction fees position it as an attractive alternative to Ethereum.\n\nOur investing thesis is that Layer-1 blockchains are like operating systems. Just as most of the world runs on either macOS or Windows, so most blockchain apps will likely end up running on either Ethereum, or some competitor. If you believe in the long-term potential of BNB Chain as a top blockchain platform, then buying and holding BNB is the way to invest in it.\n\nWith over 500 DeFi applications, BNB Chain continues to attract robust investor interest, bolstered by Binance’s native token (BNB) being the fourth-largest cryptocurrency. That said, the recent SEC lawsuit against Binance has impacted the BNB token negatively, sending the price roughly 20% lower in a week. That could be signs of worse things to come, or a good way to buy the token at a discount.\n\nBefore 2021, Ethereum monopolized the blockchain applications market, thanks to its intuitive smart contract feature and user-friendly programming language. It accounted for 95% of all DeFi applications. However, the dynamic nature of the crypto space led to the emergence of fierce competition.\n\nBinance, the world’s largest cryptocurrency exchange, launched its own public blockchain as a competitor to Ethereum. Today, it holds roughly 8.5% of DeFi’s total value locked (TVL), making it the third most popular DeFi ecosystem, following Ethereum and Tron.\n\nWhat is BNB Chain?\n\nBNB Chain has had several rebrandings, but today is made up of two separate blockchains: BNB Smart Chain (originally called Binance Smart Chain), and BNB Beacon Chain (BC).\n\nBNB Chain uses a Proof of Staked Authority (PoSA) consensus mechanism, supported by 50 validators, to ensure short block times and lower fees. The most-bonded validators become block producers, guaranteeing security, stability, and chain finality. BNB Chain is compatible with the Ethereum Virtual Machine (EVM) and facilitates cross-chain transfers and communications.\n\nBNB Chain offers security and safety through its elected validators. It supports Ethereum tooling, ensuring faster finality and cheaper transaction fees. The native token, BNB, is used for executing smart contracts and staking. Currently, BNB is the 4th largest cryptocurrency, with a market cap exceeding $47 billion.\n\nBSC hosts over 500 dapps, and we’ll discuss the top 10 by total value locked.\n\nTop 10 Protocols on BSC by Total Value Locked\n\nPancakeSwap\n\nType of dapp: DEX\n\nBMJ Score: 4.0\n\nPancakeSwap is a decentralized exchange (DEX) built on BNB Chain. It enables users to swap Binance’s BEP-20 tokens seamlessly. Borrowing elements from Ethereum-based Uniswap and SushiSwap, PancakeSwap implements an automated market maker (AMM) system, eliminating the need for a centralized order book or facilitator. This means users trade against liquidity pools funded by other users instead of trading directly with counterparties.\n\nBesides trading, PancakeSwap users can become liquidity providers, earn a share of transaction fees, participate in yield farming to earn CAKE tokens, and even engage in a lottery. Moreover, it supports trading and staking of non-fungible tokens (NFTs).\n\nPancakeSwap accounts for about 44% of all total value locked (TVL) on BNB Chain, so it easily makes the list of the top 10 largest DeFi protocols.\n\nVenus\n\nType of dapp: Lending\n\nBMJ Score: 4.0\n\nVenus is a DeFi lending platform for the BNB ecosystem. It aims to provide secure and decentralized lending and borrowing of cryptocurrency. Anyone can access this algorithm-based money market by connecting compatible wallets like MetaMask.\n\nUsers can lend or borrow supported digital assets, earn token rewards, and participate in governance via Venus’ native token, XVS. The protocol integrates the functionalities of Compound and MakerDAO, enabling users to lend, borrow, and mint stablecoins within a single ecosystem.\n\nOn Venus, interest rates are set by the protocol, responding to market demands, but the minimum and maximum levels are determined by the governance process.\n\nThe protocol was founded in 2020 by the team behind Swipe. The team’s goal was to bridge traditional finance and DeFi on the BNB Chain. With a TVL figure of $800 million, Venus is the second-largest DeFi protocol on BSC.\n\nBiswap\n\nType of dapp: DEX\n\nBMJ Score: 3.5\n\nBiswap, launched in May 2021, is a DEX offering token swapping on BSC with trading fees starting from as low as 0.1%. Besides providing a platform for trading, farming, and staking, Biswap offers an innovative three-type referral program rewarding users for their referees’ activities in farming, launchpools, and swaps.\n\nThe ecosystem also hosts an NFT marketplace and NFT game. Utilizing an AMM model, Biswap ensures swift transactions while maintaining user control over funds. Its native token, BSW, facilitates incentivization across the platform. With a strategic investment from Binance Labs, Biswap enhances its innovative DEX services.\n\nRadiant V2\n\nType of dapp: Lending\n\nBMJ Score: 3.5\n\nRadiant is an Arbitrum-native omnichain money market protocol that is also supported on BSC. It aims to facilitate cross-chain deposit and borrowing of major assets.\n\nWith the recent launch of Radiant V2, the protocol addresses some of the issues encountered in V1, such as initial emissions, liquidity provision, and fixed unlock times. Enhancements include refined tokenomics, increased utility, the integration of cross-chain capabilities, launches on multiple new EVM chains, and the implementation of LayerZero Omnifungible Token (OFT). V2 is also designed to amass fair value for the DAO, positioning Radiant as a leading fee-generating protocol in DeFi. Notably, the upgrade underwent rigorous security audits by Peckshield, Zokyo, and BlockSec, affirming its robust security framework.\n\nAlpaca Finance\n\nType of dapp: Yield farming\n\nBMJ Score: 3.0\n\nAlpaca Finance is a decentralized finance (DeFi) platform launched on BSC in early 2021. It offers leveraged yield farming and supports undercollateralized loans for enhanced yield farming positions, improving capital efficiency.\n\nWith over $300 million in TVL, it has grown rapidly since its launch, diversifying into single-asset staking, LP staking vaults, and experimental synthetics while actively partnering with other protocols.\n\nAlpaca’s lending mechanism lets users earn yield through Alpaca tokens and popular cryptocurrencies like BTC, ETH, and BNB.\n\nNotably, Alpaca adopts a deflationary buyback and burn model for a percentage of platform fees, reducing total supply over time, which further strengthens the value proposition of the protocol.\n\nBinance Staked ETH\n\nType of dapp: Liquid Staking\n\nBMJ Score: 3.0\n\nTo compete with the popular Lido, Binance launched its own Ethereum-based liquid staking product. Like Lido, this service enables users to earn staking rewards on ETH without locking up their assets, providing enhanced liquidity and more yield opportunities in DeFi.\n\nLaunched initially in response to the Ethereum network’s shift to Ethereum 2.0 and its Proof of Stake mechanism, this product was shifted to a wrapped version of Ether (WBETH) after Binance was served with an SEC lawsuit. Naturally, it caters to the Ethereum community’s increasing demand for staking. Users can stake any amount of ETH and receive WBETH tokens in exchange, which can be eventually used for yield opportunities across the BSC ecosystem. These tokens can be traded, transferred, or used as collateral on Binance, multiplying the options for staked ETH.\n\nPinkSale\n\nType of dapp: Launchpad\n\nBMJ Score: 3.0\n\nPinkSale is a decentralized launchpad unveiled in July 2021. It enables token creation and presale funding for projects across various networks, including BSC, Ethereum, Fantom, Polygon, KuCoin Community Chain, and Avalanche. It stands apart with its minimalist toolkit for swift token development and Initial Dex Offering (IDO) sales.\n\nPinkSale integrates innovative features such as an anti-rug pull system, antibot feature, and various token types, ensuring platform safety through regular audits by Certik. With more than 6,000 projects launched, 650,000 participants, and $220 million in TVL, PinkSale has solidified its status as a leading decentralized crypto launchpad while actively preventing scams and maintaining platform decentralization.\n\nWarning: These IDOs are most likely to be considered unregistered securities in the eyes of the U.S. Securities and Exchange Commission.\n\nUNCX Network (formerly UniCrypt)\n\nType of dApp: Launchpad\n\nBMJ Score: 2.5\n\nLaunched in June 2020, UNCX Network, previously UniCrypt, is a one-stop DeFi solution providing five principal services to streamline project development and enhance investor security. With offerings such as Initial Liquidity Offering (ILO) services, liquidity lockers, token vesting, staking-as-a-service, and ENMT Token Minter, UNCX Network facilitates transparency and safety for both project creators and investors.\n\nDevelopers can create bespoke presales, lock liquidity to protect investors, vest tokens for price stability, and establish staking pools. For those lacking token or solidity skills, the network’s minter creates pre-audited tokens, boosting project credibility. UNCX Network’s integrated platform simplifies project launch and operation while promoting secure investment.\n\nWarning: These ILOs are most likely to be considered unregistered securities in the eyes of the U.S. Securities and Exchange Commission.\n\nCoinWind\n\nType of dapp: Yield\n\nBMJ Score: 2.0\n\nCoinWind is a smart yield farming platform supported by HECO and BSC. Launched in 2021, it is strategically designed to optimize user revenues by automatically matching pledged tokens (digital assets locked for rewards). As of May 2023, the protocol’s TVL is over $200 million.\n\nCoinWind effectively addresses the issues of low revenues from single-token mining and high risks from LP mining in the DeFi landscape. As a smart decentralized finance management platform, CoinWind aggregates funds from various token pools to participate in diverse liquidity mining opportunities. It combines this with price hedging strategies to lessen impermanent loss, aiming to maximize user returns while minimizing unpredictable losses.\n\nTHENA\n\nType of dapp: General\n\nBMJ Score: 1.0\n\nTHENA is a relatively new project that aims to become the go-to DeFi trading platform on BNB Chain. According to its roadmap, the ecosystem will include a wide range of DeFi products, including ALPHA, an advanced perpetual trading platform, WARP, a launchpad accelerator, and CORE, a social hub promoting user interaction. On top of that, RAMP will ensure seamless fiat transactions – something that other DeFi projects don’t offer.\n\nInvestor Takeaway\n\nSince 2021, BNB Chain has demonstrated significant growth and adoption in the DeFi space, capturing nearly 10% of the total market and vying with Tron for the spot as second-largest DeFi ecosystem. Despite Ethereum’s dominance, BSC’s lower transaction costs, shorter block times, and compatibility with the Ethereum Virtual Machine have made it an appealing alternative for many projects.\n\nThe BNB Chain hosts a multitude of DeFi applications, with a diverse range of protocols leading the way. Projects like PancakeSwap and Venus have left their mark on the ecosystem, with the former accounting for almost half of BSC’s total value locked.\n\nWhile BNB is currently maintaining its position among the top 5 largest cryptocurrencies by market cap, investor interest and confidence in the BNB ecosystem has taken a hit due to the lawsuit brought by the U.S. Securities and Exchange Commission against Binance and its founder and CEO Changpeng Zhao. Given the uncertainty surrounding the exchange it would be wise to remain cautious about investing in BNB, as well as any project building within the Binance ecosystem.\n\nSubscribe to Bitcoin Market Journal to discover more investment opportunities in blockchain!"
    }
]