[
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY29pbmN1bHR1cmUuY29tL2F1L3RlY2gvYm5iLWNoYWluLXJlbGVhc2VzLW5ldy13ZWIzLXN0b3JhZ2UtbmV0d29yay13aGl0ZXBhcGVyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "BNB Chain Releases New Web3 Storage Network Whitepaper - Coin Culture",
        "content": "The BNB Chain core development team has published a whitepaper on BNB Greenfield, a Web3 platform that integrates smart contracts with data storage and is built on the blockchain.\n\nAccording to the whitepaper, the BNB Smart Chain employs BNB as its native token, allowing users to store data on a distributed network and access or monetize it using smart contracts.\n\nBNB Chain is excited to announce the release of the BNB Greenfield whitepaper. This new standard in Web3 data ownership and utility introduces a new structural and economic paradigm for data in the #Web3 era.https://t.co/6IZH1bJevW [1/7] 🧵… pic.twitter.com/tlCi77ZwPb — BNB Chain (@BNBCHAIN) February 1, 2023\n\nAccording to Victor Genin, “BNB Chain is creating a new theme for the ownership and utility of data with BNB Greenfield.” Greenfield is the BNB ecosystem’s third blockchain network, following BNB Beacon Chain and BNB Smart Chain. It will develop utility and monetization prospects for data in storage and add programmability to data ownership.\n\nWeb3 apps, mainly social media ones, would thrive on such a network. But the network will still use AWS and other centralised cloud providers for its data and computing needs.\n\nThe BNB Chain team has revealed that they are working with AWS, NodeReal, and Blockdaemon to deploy a Greenfield testnet in the following months."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vY29pbmdhcGUuY29tL3RvcC0xMC1jcnlwdG9jdXJyZW5jaWVzLWZvci1mZWItMTAwNDkv0gE_aHR0cHM6Ly9jb2luZ2FwZS5jb20vdG9wLTEwLWNyeXB0b2N1cnJlbmNpZXMtZm9yLWZlYi0xMDA0OS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "Top 10 Cryptocurrencies For Long Term Investing In February 2023 - CoinGape",
        "content": "The cryptocurrency market is going through a crucial time and finding the best cryptocurrency to invest in makes it difficult for many investors. With this in mind, we have come up with a list of the top 10 cryptocurrencies you will regret not buying on February 2, 2023. Have a look!\n\nTop 10 Cryptocurrencies to Buy Today\n\nTo help you get your investment thoughts clear, these are the top 10 cryptocurrencies based on their recent performance in the cryptocurrency market.\n\nadvertisement\n\nBitcoin – King of All Cryptocurrencies\n\nBitcoin is the largest cryptocurrency by market capitalization at current pricing levels of around $24,000. BTC price has surged a lot recently, rising from $16,547 to $23,814.16. Looking at its recent performance, many crypto investors are hopeful that the digital currency will regain its former all-time high in the near future.\n\nEthereum – Solid Smart Contract Platform\n\nIn the past few months, Ethereum has also experienced tremendous growth. From November 2022 to the beginning of February 2023, ETH price went from about $1,091 to over $1,669, increasing more than 52%.\n\nCardano – Ouroboros Proof-of-stake\n\nAiming to be the world’s financial operating system, Cardano is well-known for its early embrace of proof-of-stake validation. As of Feb 02, 2023, ADA price is trading at $0.402, during the last seven days, it has increased by 6.68%, making it one of the top 10 cryptocurrencies to consider in February 2023.\n\nXRP – Native Token for The XRP Ledger\n\nCreated as a payment system by Ripple in 2012, XRP can be used on that network to facilitate exchanges of different currency types. The current price of XRP is $0.4141 and it has risen by nearly 3.81% during the past 24 hours. XRP fans are positive that if Ripple wins the long going US SEC vs Ripple lawsuit, the price can surge up to $0.5 soon.\n\nRead More: 5 Reasons Why Ripple XRP Might Explode In February 2023\n\nBNB – A Utility Cryptocurrency That Operates as a Payment Method\n\nBinance Coin (BNB) is used for trading, payment processing or even booking travel arrangements. One can also trade or exchange BNB for other forms of cryptocurrency, such as Ethereum or Bitcoin. As of Feb. 02, 2023, Binance Coin has a $52 billion market capitalization, with one BNB valued at around $329.43.\n\nLitecoin – Silver to Bitcoin’s Gold\n\nLitecoin is an open-source blockchain project and a decentralized peer-to-peer cryptocurrency that has similarities with Bitcoin. People use it as an avenue to make payments around the world without a mediator. LTC price is trading around $100.03 and has achieved a surge of 12.63% within a week.\n\nPolygon – Ethereum’s internet of blockchains\n\nLaunched under the name Matic Network in 2017, Polygon is one of the top 10 cryptocurrencies that enables blockchain networks to connect and scale. At the time of writing, MATIC is trading around $1.22, it has increased by nearly 12.68% in the past 24 hours. Polygon has seen a surprising surge of 22.45% in a week.\n\nAvalanche – A Blockchain Platform that Rivals Ethereum\n\nSimilar to Cardano and Ethereum, Avalanche also works on the Proof of Stake (PoS) mechanism and is known as one of the fastest and most trustworthy smart contract platforms. AVAX is priced at levels of nearly $21.93, which increased by nearly 14.87% in a day. Also, it has achieved a surge of 21.75% within a week.\n\nSolana – A Public Blockchain Platform with Smart Contract Functionality\n\nSolana is a blockchain platform that runs on a unique hybrid proof-of-stake and proof-of-history mechanism. SOL, its native cryptocurrency powers the platform and is used to pay its transaction fees. SOL’s price is currently hovering around $24.95, increased by nearly 6.82% in the past 24 hours.\n\nPolkadot – A Unique Blockchain Interoperability Protocol\n\nCreated by the core founder of Ethereum, Gavin Wood, Polkadot is a unique PoS cryptocurrency. One of the most exciting features of DOT is that it has no hard limit on its total supply. Polkadot is currently trading around $6.21 (up 5.51%) and it has achieved a surge of 1.82% within a week.\n\nAlso read: Fast Recovering Polkadot Coin Eyes 10% Jump In Near Future, Buy Now?\n\nNote: The information in this article is solely the author’s opinion and not investment advice."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY29pbmN1bHR1cmUuY29tL2F1L3RlY2gvYm5iLWNoYWluLXJlbGVhc2VzLW5ldy13ZWIzLXN0b3JhZ2UtbmV0d29yay13aGl0ZXBhcGVyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "BNB Chain Releases New Web3 Storage Network Whitepaper - Coin Culture",
        "content": "The BNB Chain core development team has published a whitepaper on BNB Greenfield, a Web3 platform that integrates smart contracts with data storage and is built on the blockchain.\n\nAccording to the whitepaper, the BNB Smart Chain employs BNB as its native token, allowing users to store data on a distributed network and access or monetize it using smart contracts.\n\nBNB Chain is excited to announce the release of the BNB Greenfield whitepaper. This new standard in Web3 data ownership and utility introduces a new structural and economic paradigm for data in the #Web3 era.https://t.co/6IZH1bJevW [1/7] 🧵… pic.twitter.com/tlCi77ZwPb — BNB Chain (@BNBCHAIN) February 1, 2023\n\nAccording to Victor Genin, “BNB Chain is creating a new theme for the ownership and utility of data with BNB Greenfield.” Greenfield is the BNB ecosystem’s third blockchain network, following BNB Beacon Chain and BNB Smart Chain. It will develop utility and monetization prospects for data in storage and add programmability to data ownership.\n\nWeb3 apps, mainly social media ones, would thrive on such a network. But the network will still use AWS and other centralised cloud providers for its data and computing needs.\n\nThe BNB Chain team has revealed that they are working with AWS, NodeReal, and Blockdaemon to deploy a Greenfield testnet in the following months."
    }
]