[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiMWh0dHBzOi8vbGVhcm4uYnliaXQuY29tL3dlYjMvYnliaXQtd2ViMy1nYXMtZmVlcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 10 Jan 2023 08:00:00 GMT",
        "title": "Gas Fees: Why Do You Need to Pay Them for Bybit Web3 IDO? - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAxLTEwL2JpbmFuY2UtYm5iLWFja25vd2xlZGdlcy1wYXN0LWZsYXdzLWluLW1hbmFnaW5nLWJ1c2QtcGVnLXN0YWJsZWNvaW4tcmVzZXJ2ZXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 10 Jan 2023 08:00:00 GMT",
        "title": "Binance Admits Past Management Issues With BUSD-Peg Stablecoin Reserves - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAxLTEwL2JpbmFuY2UtYm5iLWFja25vd2xlZGdlcy1wYXN0LWZsYXdzLWluLW1hbmFnaW5nLWJ1c2QtcGVnLXN0YWJsZWNvaW4tcmVzZXJ2ZXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 10 Jan 2023 08:00:00 GMT",
        "title": "Binance Admits Past Management Issues With BUSD-Peg Stablecoin Reserves - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3QvNi10b3AtYXJ0aWZpY2FsLWludGVsbGlnZW5jZS1wcm9qZWN0cy13aXRoLWJuYi1jaGFpbi10b2tlbnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 10 Jan 2023 17:22:43 GMT",
        "title": "6 Top Artifical Intelligence Projects With BNB Chain Tokens - BSC NEWS",
        "content": "BNB\n\nCheck out these six artifical intelligence protocols that have BNB Chain tokens, ranging in market capitalization from ~$400,000 to $130 million.\n\nAI Tokens on BNB\n\nArtificial intelligence has been a hot topic in the crypto space in 2023. BNB Chain degens have plenty of projects to explore.\n\nHere’s a list of some of the biggest AI projects on the chain, according to market capitalization via CoinMarketCap. This is the first step to DYOR:\n\n1. Fetch.ai\n\nSymbol: $FET\n\nMarket cap: $129.7 million\n\nFully diluted market cap (FDMC): $539.8 million\n\nChains: BNB, Ethereum, Cosmos\n\n2. Singularity DAO\n\nSymbol: $SDAO\n\nMarket cap: $12.6 million\n\nFDMC: $22.3 million\n\nChains: BNB, Ethereum\n\n3. Oraichain\n\nSymbol: $ORAI\n\nMarket cap: $5.4 million\n\nFDMC: $52.3 million\n\nChains: BNB, Ethereum\n\n4. Matrix AI Network\n\nSymbol: $MAN\n\nMarket cap: $4.4 million\n\nFDMC: $20.6 million\n\nChain: BNB Chain\n\n5. Dotmoovs\n\nSymbol: $MOOV\n\nMarket cap: $2.3 million\n\nFDMC: $3.1 million\n\nChains: BNB, Ethereum\n\n6. aiRight\n\nSymbol: $AIRI\n\nMarket cap: $395,000\n\nFDMC: $2.9 million\n\nChain: BNB Chain\n\nWhat is BNB Chain:\n\nPreviously known as the Binance Smart Chain (BSC), BNB Chain is a community-driven, decentralized, and censorship-resistant blockchain that is powered by Binance. It consists of BNB Beacon Chain and BNB Smart Chain, EVM compatible and facilitating a multi-chain ecosystem. Through the concept of MetaFI, BNB Chain aims to build the infrastructure to power the world’s parallel virtual ecosystem.\n\nFind more about BNB Chain here:"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vZm9ya2FzdC5uZXdzL21hcmtldC1iaXRjb2luLWV0aGVyLWNyeXB0by1zb2xhbmEtYmluYW5jZS_SAURodHRwczovL2Zvcmthc3QubmV3cy9tYXJrZXQtYml0Y29pbi1ldGhlci1jcnlwdG8tc29sYW5hLWJpbmFuY2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 10 Jan 2023 08:00:00 GMT",
        "title": "Markets: Bitcoin, Ether rise with most of crypto market, Solana posts best start to the year for major - Forkast News",
        "content": "Bitcoin and Ether gained in Tuesday morning trading in Asia along with most other top 10 non-stablecoin cryptocurrencies, helped by signs inflation pressure is easing in the U.S. Solana posted the biggest gains and broke back into the top 10 list by market capitalization. BNB was the only token on the list to fall on a report the U.S. Justice Department is stepping up its probe into the token’s issuer and the world’s largest crypto exchange, Binance Global.\n\nSee related article: U.S. subpoenas hedge funds in Binance probe: report\n\nFast facts\n\nBitcoin was up 0.6% to US$17,193 in the 24 hours to 8 a.m. in Hong Kong, a 3% increase over the past calendar week. Ether gained 2.6% to US$1,321, an 8.8% weekly rise, according to CoinMarketCap.\n\nSolana rose 13.7% to trade at US$16.29, a gain of 44.5% for the week and the best start to the year for any major token. The gains follow the release of a new Solana-based, Dogecoin-themed token, called Bonk. Released late last year, Bonk is now trading around US$0.000001628, an increase of almost 1400%.\n\nBNB fell 0.7% to US$272.64, but is still up 11% for the past calendar week. Federal prosecutors have reportedly issued subpoenas to several U.S. hedge funds, requesting records of communications with Binance as part of its probe into possible money laundering violations.\n\nCardano’s ADA token gained 7.4% to US$0.32, bringing its weekly gains to 24.9%. The run started after ADA in 2022 made it into the top 10 most used cryptocurrencies for payments for the first time, according to a Jan. 4 report by Lithuanian cryptocurrency payments processor CoinGate.\n\nThe total crypto market capitalization rose 1.6% to US$848.3 billion, while trading volume jumped 112.2% to US$46.9 billion.\n\nU.S. equities had a mixed day of trading on Monday. The Dow Jones Industrial Average fell 0.3%, the S&P 500 Index lost 0.1%, while the Nasdaq Composite Index rose 0.6%.\n\nThe US Federal Reserve cranked up interest rates last year to curb inflation which helped drive stock indices lower and raised worries about a recession. The December U.S. Consumer Price Index, a key measure of inflation, is released this week on Jan. 12 and should provide further pointers on future Fed policy.\n\nIn other items to watch today, Fed Chair Jerome Powell is speaking at a central bank meeting in Sweden, while Japan announces its CPI report for December.\n\nSee related article: Hong Kong pushes ahead with crypto hub plans as tech firms, startups show interest: financial secretary"
    }
]