[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvYmluYW5jZS1jb2luLWlzLWZvcm1pbmctYS1mYWtlLWJ1bGxpc2gtcGF0dGVybi1oZXJlcy1ob3fSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Jul 2023 07:00:00 GMT",
        "title": "Binance Coin is Forming a Fake 'Bullish Pattern': Here's How - Watcher Guru",
        "content": "With the current market dynamics still somewhat bullish, altcoin investors are keeping a close eye on assets like Binance Coin. Now, long-term charts like the 12-hourly or daily time frame, usually conform to better trend direction. However, in this article, we will be looking at a present example, identifying a long-term trend, which lacks substance. Detecting such false setups is essential while dealing with a choppy market.\n\nAlso read: AI, Crypto Represents an ‘Important’ Opportunity for Web3: Coinbase\n\nBinance Coin’s ‘double bottom’ underwater?\n\nDouble bottom is a technical setup representing a possible bullish scenario. The pattern observed on a long-term chart usually allows recovery of market sentiment for that particular asset. At press time, Binance Coin had a similar conundrum.\n\nAs observed, BNB confirmed the formation of a double bottom pattern on the 12-hourly chart. With a common resistance at around $255, the current scenario may lead to a 12% upswing to $285. However, before making those bullish bets, a further look into the micro picture illustrates the origin or completion of the pattern. It is also important to note that the pattern did not close above 50-EMA, which is bearish from a trend shift perspective.\n\n1-minute anomaly\n\nWhile minute charts are the least confirmatory time frames for any asset, it plays a critical role in understanding breakouts and trend deviation. For BNB, its 12-hour bullish pattern was invalidated in the 1-minute chart.\n\nWhen the micro time frame chart is analyzed, it is observed that the price candle which confirmed the pattern in the 12-hour chart, was a flash spike. Almost immediately, Binance Coin lost its valuation and it is currently threading under the initial value. While these are common during liquidity gaps or manipulation, the occurrence may have led to an illusion of a bullish structure.\n\nAlso read: Spot Bitcoin ETF Approval by SEC ‘Fairly High’: Bernstein\n\nTakeaway\n\nAt the moment, Binance Coin is the worst performer among the top 20 tokens, so its ‘bullish signal’ is fairly dismissive. However, the major takeaway from this event is that investors need to analyze all aspects of a trend shift before placing bullish or bearish bets. This is a prime example of fakeouts during turbulent periods, which often lead to massive futures contract liquidation."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3Lm56aGVyYWxkLmNvLm56L3RyYXZlbC9hdXNzaWUtb25seWZhbnMtc3Rhci1hbm5hLXBhdWxzLWJlZC1idWctaG9ycm9yLWluLWFtc3RlcmRhbS1ibmIvTERaVDVURTc2TkZFQkJOWFZXNU5NSlFKUFUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Jul 2023 07:00:00 GMT",
        "title": "Aussie OnlyFans star Anna Paul’s bed bug horror in Amsterdam BnB - New Zealand Herald",
        "content": "OnlyFans star Anna Paul made a shocking discovery in her Amsterdam bed and breakfast. Photo / TikTok, Anna Paul\n\nAn Australian OnlyFans star claims to have made an unpleasant discovery in her bed that made her skin crawl.\n\nContent creator Anna Paul was enjoying a trip around Europe with her mother who complained of a strange sensation, crawling along her neck and through the bedding.\n\nRecently checked into their bedsit on a trip to Amsterdam, the model took to TikTok to document their discovery. What she found in the sheets shocked and disgusted them.\n\nThe influencer said she thought “she was tripping”.\n\n“When my mama lay down in bed last night, little bugs started crawling up her neck, they were crawling up her legs,” said the 24-year-old influencer from Queensland.\n\nPaul went on to share a clip of the tiny, brown insects recorded on her mother’s phone as they crawled over the white sheets.\n\n“Hopefully we get a refund.”\n\nTaking to social media she asked followers what she can do to get rid of the little blighters.\n\nShe stripped the bed but wasn’t sure they were gone, she said in the clip that has gained over 3 million views.\n\nWorried that they might have got into their luggage, which was open next to the bed, she despaired she may never get rid of the stowaways.\n\n“There’s so many of them,” she said.\n\nThe BnB host, however, was nowhere to be seen. In the caption she claims to have been “ghosted”.\n\nWhat to do about bed bugs in your hotel room\n\nBed bugs are able to hide in tiny crevices and fabric in luggage, clothing and linen. Arriving (and spreading) in the clothing of travellers, they are the number 1 enemy of hotels for their ability to cause an infestation, apparently out of nowhere.\n\nThe tiny, brown wingless insects normally only come out at night to feed and leave painful red bites on victims, according to the Mayo Clinic.\n\n“Bed bug bites usually clear up without treatment in a week or two” and “aren’t known to spread disease, but they can cause an allergic reaction or a severe skin reaction in some people.”\n\nBed bugs were reported by multiple passengers on Air India flights out of Newark, New Jersey. Photo / 123RF\n\nProfessional extermination is recommended.\n\nTravellers who suspect they have stayed in a room with bed bugs are advised to wash their clothes and luggage in hot water and, where possible, to tumble dry clothes on the hottest setting.\n\nThose who suspect bed bugs have gotten into their clothes or linen are urged to wash all of their potentially infected items in hot water and to dry on the hottest setting to kill the bugs.\n\n“You should have left,” one comment advised Paul. “If the bed has bed bugs then the couch does too and your things probably have them now as well.”\n\n“If you don’t want to throw your clothes away wash and dry with high heat and steam everything,” wrote another.\n\nAnother comment claimed it took a year to be sure they had rid their belongings of the bugs."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbmNvZGV4LmNvbS9hcnRpY2xlLzI5NDM3L2Vhcm4tcGVuZGxlLXBlbmRsZS10b2tlbnMtb24tYmluYW5jZS1ieS1zdGFraW5nLWJuYi1hbmQtdHVzZC_SAWRodHRwOi8vYW1wLmNvaW5jb2RleC5jb20vYXJ0aWNsZS8yOTQzNy9lYXJuLXBlbmRsZS1wZW5kbGUtdG9rZW5zLW9uLWJpbmFuY2UtYnktc3Rha2luZy1ibmItYW5kLXR1c2Qv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Jul 2023 07:00:00 GMT",
        "title": "Earn Pendle (PENDLE) Tokens on Binance by Staking BNB and TUSD - CoinCodex",
        "content": "The Binance cryptocurrency exchange has announced that Pendle (PENDLE) will be the next project featured on its Launchpool platform. This means that eligible users (KYC is required) will be able to earn PENDLE tokens by staking BNB and/or TUSD tokens.\n\nThe PENDLE farming period will begin on July 4, 2023 at 00:00 UTC and will last for a period of 25 days. The farming period will end on July 28 at 23:59 UTC.\n\nFarm PENDLE tokens on Binance\n\nBinance plans to distribute just over 5 million PENDLE tokens through the Launchpool program. This allocation corresponds to 2% of the PENDLE token supply (251 million tokens).\n\n4.01 million PENDLE tokens will be distributed to BNB stakers, while the remaining 1 million PENDLE will go to TUSD stakers. The amount of PENDLE each user will receive will depend on two factors: the size of their stake in proportion to the size of the respective staking pool, as well as the staking duration.\n\nIn addition to revealing the PENDLE farming program on its Launchpool platform, Binance has also announced that it will list the PENDLE token in trading pairs against Bitcoin, USDT and TUSD.\n\nBinance Launchpool is a great way to farm new tokens while taking on minimal risk. This is because users can choose to unstake their tokens at any time. Unstaked tokens become available for use immediately.\n\nWhat is Pendle (PENDLE)?\n\nPendle is a DeFi (decentralized finance) protocol that enables yield trading. The Pendle protocol splits yield-bearing assets into a principal token (PT) and a yield token (YT).\n\nPendle users can maximize their yield by increasing their exposure during bullish periods, or hedge against decreasing yields which are typical in bear markets. Pendle allows users to access advanced yield strategies including fixed yield, long yield or a mix of the two.\n\nThe protocol implements a utility token called PENDLE, which has various functions in the protocol. It incentivizes liquidity, provides voting rights, and PENDLE holders also receive a portion of the fees generated by the Pendle protocol.\n\nHow to farm PENDLE tokens on Binance?\n\nIf you want to farm Pendle tokens, the first thing you’ll need is a Binance account.\n\nCreate Binance Account\n\nPlease keep in mind that only users who complete an identity verification process with Binance are eligible to participate in Pendle token farming on Binance Launchpool.\n\nOnce you account is ready, you’ll need some BNB or TUSD tokens to stake. If you already own these tokens, you can deposit some to your Binance account. Otherwise, Binance offers plenty of ways of buying these tokens with either crypto or fiat.\n\nAfter your account is verified and loaded up with some BNB, TUSD, or both, head over to the menu in the top side of the Binance interface and select \"Earn\". Then, go to \"Launchpad\".\n\nThen, scroll down to the \"Launchpool\" section and you’ll be able to find the available PENDLE farming pools. Depending on which tokens you want to stake, select the TUSD Pool or the BNB Pool. Then, follow the instructions provided by the exchange."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbmNvZGV4LmNvbS9hcnRpY2xlLzI5NDM3L2Vhcm4tcGVuZGxlLXBlbmRsZS10b2tlbnMtb24tYmluYW5jZS1ieS1zdGFraW5nLWJuYi1hbmQtdHVzZC_SAWRodHRwOi8vYW1wLmNvaW5jb2RleC5jb20vYXJ0aWNsZS8yOTQzNy9lYXJuLXBlbmRsZS1wZW5kbGUtdG9rZW5zLW9uLWJpbmFuY2UtYnktc3Rha2luZy1ibmItYW5kLXR1c2Qv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Jul 2023 07:00:00 GMT",
        "title": "Earn Pendle (PENDLE) Tokens on Binance by Staking BNB and TUSD - CoinCodex",
        "content": "The Binance cryptocurrency exchange has announced that Pendle (PENDLE) will be the next project featured on its Launchpool platform. This means that eligible users (KYC is required) will be able to earn PENDLE tokens by staking BNB and/or TUSD tokens.\n\nThe PENDLE farming period will begin on July 4, 2023 at 00:00 UTC and will last for a period of 25 days. The farming period will end on July 28 at 23:59 UTC.\n\nFarm PENDLE tokens on Binance\n\nBinance plans to distribute just over 5 million PENDLE tokens through the Launchpool program. This allocation corresponds to 2% of the PENDLE token supply (251 million tokens).\n\n4.01 million PENDLE tokens will be distributed to BNB stakers, while the remaining 1 million PENDLE will go to TUSD stakers. The amount of PENDLE each user will receive will depend on two factors: the size of their stake in proportion to the size of the respective staking pool, as well as the staking duration.\n\nIn addition to revealing the PENDLE farming program on its Launchpool platform, Binance has also announced that it will list the PENDLE token in trading pairs against Bitcoin, USDT and TUSD.\n\nBinance Launchpool is a great way to farm new tokens while taking on minimal risk. This is because users can choose to unstake their tokens at any time. Unstaked tokens become available for use immediately.\n\nWhat is Pendle (PENDLE)?\n\nPendle is a DeFi (decentralized finance) protocol that enables yield trading. The Pendle protocol splits yield-bearing assets into a principal token (PT) and a yield token (YT).\n\nPendle users can maximize their yield by increasing their exposure during bullish periods, or hedge against decreasing yields which are typical in bear markets. Pendle allows users to access advanced yield strategies including fixed yield, long yield or a mix of the two.\n\nThe protocol implements a utility token called PENDLE, which has various functions in the protocol. It incentivizes liquidity, provides voting rights, and PENDLE holders also receive a portion of the fees generated by the Pendle protocol.\n\nHow to farm PENDLE tokens on Binance?\n\nIf you want to farm Pendle tokens, the first thing you’ll need is a Binance account.\n\nCreate Binance Account\n\nPlease keep in mind that only users who complete an identity verification process with Binance are eligible to participate in Pendle token farming on Binance Launchpool.\n\nOnce you account is ready, you’ll need some BNB or TUSD tokens to stake. If you already own these tokens, you can deposit some to your Binance account. Otherwise, Binance offers plenty of ways of buying these tokens with either crypto or fiat.\n\nAfter your account is verified and loaded up with some BNB, TUSD, or both, head over to the menu in the top side of the Binance interface and select \"Earn\". Then, go to \"Launchpad\".\n\nThen, scroll down to the \"Launchpool\" section and you’ll be able to find the available PENDLE farming pools. Depending on which tokens you want to stake, select the TUSD Pool or the BNB Pool. Then, follow the instructions provided by the exchange."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vZGVjcnlwdC5jby8xNDcxMTkvb255eC1wcm90b2NvbC1wYXJ0bmVycy13aXRoLWVhcm4tbmV0d29yay1hbmQtbXljb2ludGFpbmVyLXRvLWRyaXZlLXhjbi1hZG9wdGlvbi1vbi1ibmItc21hcnQtY2hhaW7SAYIBaHR0cHM6Ly9kZWNyeXB0LmNvLzE0NzExOS9vbnl4LXByb3RvY29sLXBhcnRuZXJzLXdpdGgtZWFybi1uZXR3b3JrLWFuZC1teWNvaW50YWluZXItdG8tZHJpdmUteGNuLWFkb3B0aW9uLW9uLWJuYi1zbWFydC1jaGFpbj9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Jul 2023 07:00:00 GMT",
        "title": "Onyx Protocol Partners with Earn Network and MyCointainer to Drive XCN Adoption on BNB Smart Chain - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nSweden, Götaland, July 3rd, 2023, Chainwire\n\nOnyx Protocol is today announcing an exciting new partnership with MyCointainer and Earn Network. Through the initiative, Earn Network will offer enhanced staking opportunities on BNB Smart Chain and cheaper transaction fees for the XCN token. XCN holders can potentially get up to 40% APY on their tokens when staked.\n\nThe partnership with Earn Network will see Onyx launch dedicated decentralized staking pools for XCN on BNB Smart Chain. Each user will have the opportunity to stake their XCN tokens using two formal staking processes, Flexible or Locked.\n\nFlexible Staking describes a staking pool in which users can deposit and withdraw tokens at any time without any restrictions or lock-up periods. It offers flexibility and liquidity, with rewards distributed on a regular basis. Users can choose to compound their earnings by leaving their rewards in the pool or withdraw them.\n\nLocked staking, also known as fixed-term or time-locked staking, involves staking tokens for a specific lock-up period. Onyx will offer two options here: 15-day and 30-day set staking periods. Users cannot withdraw their staked tokens until the lock-up period expires. In return for committing their tokens for a longer duration, participants typically receive higher staking rewards compared to flexible staking.\n\nAll of the ETH fees collected for bridging XCN from ERC20 to BEP20 will be refunded as part of the ongoing gas refund initiative. Onyx recently published an in-depth bridging article and will presently share further details regarding the staking process via Earn Network.\n\nOnyx’s partnership with MyCointainer will also see a dedicated profile dashboard launched. This will serve as a central hub for all Onyx-related products on the platform. Other products under development include wallet integration, facilitating deposits and withdrawals of XCN processed on BNB Smart Chain, and a staking mechanism based on smart contracts operated by Earn. This will enable XCN rewards on the platform for thousands of potential users.\n\nOnyx also intends to introduce 'Buy XCN with card' functionality, providing a MasterCard and Visa onramp for XCN, an XCN trading service offering pairs in EUR, USDT, and BTC, and extensive marketing activities. Keep an eye on the Onyx's socials for the latest updates!\n\nAbout Onyx Protocol\n\nOnyx Protocol represents a decentralized liquidity protocol that supports multiple token types with aggregated and unified capital access. This protocol solves the capital efficiency trilemma and eliminates the single points of failure inherent in centralized protocols. Unlike other lending protocols, Onyx Protocol offers transparency and trustless lending, making it a better choice for digital asset holders to access and earn liquidity.\n\nOfficial Website | Twitter | Discord | Telegram | Medium\n\nAbout Earn Network and MyCointainer\n\nEarn Network provides smart contract infrastructure to connect liquidity providers and pool creators in a completely non-custodial manner. MyCointainer's goal is to enable easy access to various rewarding crypto mechanisms for all. They want everyone to equally benefit from a changing financial landscape and speed up global crypto adoption.\n\nContact\n\nMr\n\nPaul Smith\n\nOnyx Protocol\n\ninfo@onyx.org\n\nDisclaimer: Press release sponsored by our commercial partners."
    }
]