[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vd3d3LmJsb2NrY2hhaW5nYW1lci5iaXovbmV3cy8yMjU2Mi9kZWdlbi16b28tbW92ZS1ibmIv0gFCaHR0cHM6Ly93d3cuYmxvY2tjaGFpbmdhbWVyLmJpei9hbXAvbmV3cy8yMjU2Mi9kZWdlbi16b28tbW92ZS1ibmIv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Mar 2023 07:00:00 GMT",
        "title": "Degen Zoo moves to BNB to avoid ETH gas costs - Blockchain Gamer",
        "content": "Still high riding on the attention following Logan Paul’s very messy CryptoZoo project, charity game Degen Zoo is looking to move from Ethereum to BNB in the next seven days.\n\nThe reason for the move was announced on the project’s Twitter, stating that “the impact from NFT ETH people is insignificant compared to gas fees, therefore we are moving.”\n\nOn medium, DAO Maker and founder of Degen Zoo Chris Zaknun explains further that “playing the game costs around $35 per [egg] hatch, which our users pay for no reason. Instead of waiting any longer, we adapted quickly right at the start of the game.”\n\nBridging the DZOO token on Ethereum to wDZOO on BNB is processed to start imminently and users will be airdropped $BNB as compensation for the move. Degen Zoo is hoping the move will see more players ape into the game from an early stage. Another measure is to lower the staking amount which means more users can stake into the eggs.\n\nZaknun goes on to state how grateful he is for the 205 devoted players the game has had on Ethereum so far, but ends with the note that “killing, hatching, and claiming eggs on ETH will not be activated again”.\n\nDegen Zoo’s story\n\nStarting out as a joke by the team behind DAO Maker, Degen Zoo was inspired by the hype and failure of the-now seemingly discontinued CryptoZoo.\n\nThe Degen Zoo website and whitepaper was up and running in five days but the team still largely considered the project a joke. However, the community viewed them as something more, which led them to build a proper blockchain game in 30 days, where all profits are claimed go to animal charities."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vd3d3LmJsb2NrY2hhaW5nYW1lci5iaXovbmV3cy8yMjU2Mi9kZWdlbi16b28tbW92ZS1ibmIv0gFCaHR0cHM6Ly93d3cuYmxvY2tjaGFpbmdhbWVyLmJpei9hbXAvbmV3cy8yMjU2Mi9kZWdlbi16b28tbW92ZS1ibmIv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Mar 2023 07:00:00 GMT",
        "title": "Degen Zoo moves to BNB to avoid ETH gas costs - Blockchain Gamer",
        "content": "Still high riding on the attention following Logan Paul’s very messy CryptoZoo project, charity game Degen Zoo is looking to move from Ethereum to BNB in the next seven days.\n\nThe reason for the move was announced on the project’s Twitter, stating that “the impact from NFT ETH people is insignificant compared to gas fees, therefore we are moving.”\n\nOn medium, DAO Maker and founder of Degen Zoo Chris Zaknun explains further that “playing the game costs around $35 per [egg] hatch, which our users pay for no reason. Instead of waiting any longer, we adapted quickly right at the start of the game.”\n\nBridging the DZOO token on Ethereum to wDZOO on BNB is processed to start imminently and users will be airdropped $BNB as compensation for the move. Degen Zoo is hoping the move will see more players ape into the game from an early stage. Another measure is to lower the staking amount which means more users can stake into the eggs.\n\nZaknun goes on to state how grateful he is for the 205 devoted players the game has had on Ethereum so far, but ends with the note that “killing, hatching, and claiming eggs on ETH will not be activated again”.\n\nDegen Zoo’s story\n\nStarting out as a joke by the team behind DAO Maker, Degen Zoo was inspired by the hype and failure of the-now seemingly discontinued CryptoZoo.\n\nThe Degen Zoo website and whitepaper was up and running in five days but the team still largely considered the project a joke. However, the community viewed them as something more, which led them to build a proper blockchain game in 30 days, where all profits are claimed go to animal charities."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vY3J5cHRvLm5ld3Mvc29sYW5hcy10dmwtZ3Jvd3RoLXNob290cy1wYXN0LWF2YWxhbmNoZS1hbmQtYm5iL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Mar 2023 07:00:00 GMT",
        "title": "Solana's TVL growth shoots past Avalanche and BNB - crypto.news",
        "content": "The Solana (SOL) network has seen 26.5% growth in total value locked (TVL) since the dawn of 2023, crossing the $259 million mark, despite some dents to its reputation caused by the FTX and Alameda Research collapse.\n\nAlthough the current TVL falls short of its all-time high of $10 billion, the growth is viewed as a positive sign, considering the network’s various challenges, including outages.\n\nAccording to CryptoCompare’s latest asset report, Solana’s TVL growth is a “positive sign for the ecosystem” when compared to other blockchains, with the exception of Kava.\n\nKava saw its TVL grow by over 36.5% in March, compared to Solana’s 16.5% growth and Tron’s 11.4%. Binance’s BNB Chain saw a 6.15% growth over the same period. In contrast, Fantom and Avalanche witnessed almost negligible growth in their TVL, with only a slight 0.53% and 0.91% rise in TVL, respectively.\n\nTVL Growth chart | Source: CryptoCompare\n\nDiverse ecosystem drives Solana’s growth\n\nSolana’s diverse ecosystem, including DeFi and NFT offerings such as Claynosaurz, Pixel Boy, and Moo Doo, has been a significant driver of this growth.\n\nSolana is competing with Ethereum in the smart contract hub market and has positioned itself as one of the most adaptable layer-1 protocols. The company is also diversifying its core business by launching its own crypto phone, the Saga, in Q1 2023, making it the first layer-1 blockchain to do so.\n\nHowever, the Solana team has faced concerns regarding the network’s reliability, including a significant 18-hour outage in February 2023. To improve network stability, one-third of the core engineers will focus on enhancing the network throughout 2023, supported by a six-point strategy to refine the network update process.\n\nInstitutional investors shift focus to altcoins, including SOL\n\nInstitutional investors are backing away from cryptocurrency investment products offering exposure to dominant digital assets like bitcoin (BTC) and ethereum (ETH). However, they are instead wagering on products that expose them to altcoins, such as XRP, solana (SOL), litecoin (LTC), and polygon (MATIC).\n\nDespite BTC’s price hike, institutional investors ditched BTC-related products, causing an outflow of $113 million this past week. Conversely, XRP products had $400,000 in inflows, and products with exposure to SOL, MATIC, and LTC saw $200,000 in inflows each. Ethereum products had outflows of $13 million last week."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vY3J5cHRvLm5ld3Mvc29sYW5hcy10dmwtZ3Jvd3RoLXNob290cy1wYXN0LWF2YWxhbmNoZS1hbmQtYm5iL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Mar 2023 07:00:00 GMT",
        "title": "Solana's TVL growth shoots past Avalanche and BNB - crypto.news",
        "content": "The Solana (SOL) network has seen 26.5% growth in total value locked (TVL) since the dawn of 2023, crossing the $259 million mark, despite some dents to its reputation caused by the FTX and Alameda Research collapse.\n\nAlthough the current TVL falls short of its all-time high of $10 billion, the growth is viewed as a positive sign, considering the network’s various challenges, including outages.\n\nAccording to CryptoCompare’s latest asset report, Solana’s TVL growth is a “positive sign for the ecosystem” when compared to other blockchains, with the exception of Kava.\n\nKava saw its TVL grow by over 36.5% in March, compared to Solana’s 16.5% growth and Tron’s 11.4%. Binance’s BNB Chain saw a 6.15% growth over the same period. In contrast, Fantom and Avalanche witnessed almost negligible growth in their TVL, with only a slight 0.53% and 0.91% rise in TVL, respectively.\n\nTVL Growth chart | Source: CryptoCompare\n\nDiverse ecosystem drives Solana’s growth\n\nSolana’s diverse ecosystem, including DeFi and NFT offerings such as Claynosaurz, Pixel Boy, and Moo Doo, has been a significant driver of this growth.\n\nSolana is competing with Ethereum in the smart contract hub market and has positioned itself as one of the most adaptable layer-1 protocols. The company is also diversifying its core business by launching its own crypto phone, the Saga, in Q1 2023, making it the first layer-1 blockchain to do so.\n\nHowever, the Solana team has faced concerns regarding the network’s reliability, including a significant 18-hour outage in February 2023. To improve network stability, one-third of the core engineers will focus on enhancing the network throughout 2023, supported by a six-point strategy to refine the network update process.\n\nInstitutional investors shift focus to altcoins, including SOL\n\nInstitutional investors are backing away from cryptocurrency investment products offering exposure to dominant digital assets like bitcoin (BTC) and ethereum (ETH). However, they are instead wagering on products that expose them to altcoins, such as XRP, solana (SOL), litecoin (LTC), and polygon (MATIC).\n\nDespite BTC’s price hike, institutional investors ditched BTC-related products, causing an outflow of $113 million this past week. Conversely, XRP products had $400,000 in inflows, and products with exposure to SOL, MATIC, and LTC saw $200,000 in inflows each. Ethereum products had outflows of $13 million last week."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vd3d3LmFybGluZ3Rvbm1hZ2F6aW5lLmNvbS8xNi1hd2Vzb21lLWhhcHB5LWhvdXJzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Mar 2023 07:00:00 GMT",
        "title": "Happy Hour Deals in Arlington, Del Ray, Fairfax, Falls Church, Tysons - Arlington Magazine",
        "content": "Happy hour. Perhaps the best time of day. Scores of restaurants around Arlington agree, offering discounts on bar bites and adult beverages, from dragon shrimp to espresso martinis. If you’re looking for great spots to visit, take a peek at our top happy hour vote-getters from the Best of Arlington 2023 Awards. Not enough choices? Here are some more great options:\n\nMonday-Friday | 4-7 p.m.\n\nHead to this Rosslyn tavern known for coccoli—doughnut balls served with prosciutto, truffle honey and fontina—and cocktails such as the gin-meets-lavender combo Italian Stallion. At happy hour, find a wide array of $5 drinks, including the Atlas Brew Works’ Dance of Days IPA; house sangria; spiked lemonade and rail drinks. And enjoy $2 off on all pizza and appetizers (Hint: Might be a good time to test drive an order of coccoli). // 1600 Wilson Blvd., Arlington (Rosslyn)\n\nDaily | 2-7 p.m.\n\nThis light-filled bar and restaurant at Hyatt Regency Tysons Corner pour 30-plus regional beers and more than 65 bourbons. As the weather warms up, pull up a seat on the patio or near one of the garage-style glass doors. The happy hour menu offers $2 off select appetizers (including deviled eggs and the jumbo hearth pretzel, served with cheese sauce and creole mustard), $2 off select beers, $6 house wines and $7 rail drinks. // 7901 Tysons One Place, Tysons\n\nMonday-Friday | 4-6 p.m.\n\nYou may have popped by this shop in The Little City for a bottle of Jules prosecco rose or a four-pack of Commonwealth Galaxy Magic. But ICYMI, they’ve also got a restaurant and bar upstairs. During happy hour, try any of their wines by the glass or draft pours for 20% off, and take advantage of discounted pricing on several apps, from dragon shrimp with sweet chili sauce to pommes frites with rosemary, garlic, sea salt and parmesan. // 107 Rowell Ct., Falls Church City\n\nMonday-Friday | 3-6 p.m.\n\nFor more than 30 years, El Paso Cafe has brought Tex-Mex cooking to Arlington’s Buckingham neighborhood, serving dishes like pork pupusas and pescado frito (pan-seared Rockfish, butterfly shrimp, white rice, pinto beans, house-made corn tortillas). While you’re considering your dinner order, sip on domestic beer for $3, imports for $4, $5 glasses of wine, $6 sangria and $7 Juarez margaritas, made with Juarez silver tequila. Hungry for a snack? Snag guacamole for $4, and queso or taquitos for $5 each. // 4235 N. Pershing Drive, Arlington (Buckingham)\n\nDaily | 4-7 p.m.\n\nIt may be a prime coffee destination, but this Clarendon spot also runs a daily happy hour with food options that could sub for dinner in a pinch. Choose from crispy chicken, cheeseburger or seared salmon sliders (one for $5 or three for $14); spicy Thai peanut wings (six for $8, 12 for $15); roasted butternut squash hummus ($7) and shoestring fries ($6). And wash those down with discounted prices on espresso martinis, Moscow mules and other select cocktails, as well as $3 off select beer and wine. // 3100 10th St. N., Arlington (Clarendon)\n\nDaily | 3-6 p.m.\n\nDig into deals on shareable plates and liquid refreshments at this cozy Wilson Boulevard eatery serving wood-fired pizza and house-made pasta (whose sister restaurant, Lyon Hall, was voted Best Happy Hour in our 2023 Best of Arlington Awards). The happy hour food options include arancini ($8), side Caesar salad ($5) and 10-inch red or white pies for $10. Accompany those with select $6 local beers, select $7 glasses of wine and $7 cocktails, such as the Kentucky mule or an Aperol spritz. // 3195 Wilson Blvd., Arlington (Clarendon)\n\nDaily | 3-7 p.m. & Friday-Saturday | 10 p.m.-Close\n\nThis Belgian bistro from chef Robert Wiedmaier brings steak frites, clam linguine and (you guessed it) mussels to Ballston. During happy hour, nibble on margherita flatbread ($12) or blue crab dip ($14), or dive into a half-pot of mussels paired with select beer or wine ($20). Also find drink deals, such as the Spanish gin and tonic ($10) or barrel-aged old fashioned ($11). // 800 N. Glebe Road, Arlington (Ballston)\n\nTuesday-Friday | 5-7 p.m.\n\nLike a side of jazz with your happy hour? Make your way to this swanky brasserie at Mosaic from restaurateurs Eric and Ian Hilton (Cafe Colline, El Rey), complete with a “vibey” rooftop that opens each spring. While happy hour runs four nights a week, Wednesday is jazz night, courtesy of local pianist Bobby Jasinski. The eats on the happy hour menu include prawn cocktail ($12) and smoked salmon rillettes ($12). Order drinks such as the French martini ($12) a la carte or take advantage of one of their food and drink pairings, such as a half-dozen oysters with two glasses of Chateau du Coing de Saint-Fiacre Muscadet ($32). // 8196 Glass Alley, Fairfax (Mosaic)\n\nTuesday-Friday | 4-7 p.m. & Saturday-Sunday Noon-7 p.m.\n\nThis neighborhood pizzeria—part of the restaurant group behind Cafe Pizzaiolo, St. Elmo’s Coffee Pub and Market 2 Market—regularly hosts events such as Beer Bingo and Steal the Pint Night. It’s also got a patio and an extended happy hour on weekends, with deals including $2 off draft beers, $5 glasses of wine or sangria, a Piece Out pilsner and a slice for $8, and a $6 chicken tender basket. // 2419 Mt. Vernon Ave., Alexandria\n\nWeekdays | 4-6 p.m.\n\nCalamari. Baked brie. Beef tartare. The selections at this Clarendon restaurant from Reese Gardner (Copperwood Tavern, Dudley’s Sport & Ale, Brass Rabbit, Quinn’s on the Corner) are hard to say no to. Luckily, you can say yes a bit easier during happy hour, when appetizers are buy one get one free, oysters are $1 and select wines by the glass as well as drafts are $6. // 1101 N. Highland St., Arlington (Clarendon)\n\nMonday-Thursday | 11 a.m.-6 p.m.\n\nHad a rough day at work? Catch the end of this Falls Church brewery’s seven-hour happy hour, where bar snacks such as crispy chicken thighs and loaded tots are $7, mixed drinks and wine by the glass are $2 off, and beer pints are $5. (Psst … They’ve also got trivia nights and some pretty stellar IPAs.) // 444 West Broad St., Falls Church City"
    }
]