[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA4LTMxL2NyeXB0by1iaW5hbmNlLWFzaWEtcGFjaWZpYy1oZWFkLWxlb24tZm9vbmctaXMtbGVhdmluZy1ibmLSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 31 Aug 2023 07:00:00 GMT",
        "title": "Crypto: Binance Asia Pacific Head Leon Foong Is Leaving (BNB) - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8venljcnlwdG8uY29tL3dvcmxkY29pbi1wbHVuZ2VzLW92ZXItNTAtYW1pZC1nbG9iYWwtZGF0YS1wcml2YWN5LWNvbmNlcm5zL9IBVWh0dHBzOi8venljcnlwdG8uY29tL3dvcmxkY29pbi1wbHVuZ2VzLW92ZXItNTAtYW1pZC1nbG9iYWwtZGF0YS1wcml2YWN5LWNvbmNlcm5zLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 31 Aug 2023 07:00:00 GMT",
        "title": "Worldcoin Plunges Over 50% Amid Global Data Privacy Concerns - ZyCrypto",
        "content": "Advertisement\n\nWorldcoin (WLD) continues to plunge on the back of increased regulatory crackdowns by governments worldwide.\n\nThe cryptocurrency has fallen from an all-time high of $3.58 in mid-July and currently trades at $1.15, reflecting a 54% drop in value.\n\nLaunched on July 24, 2023, Worldcoin is a digital identification platform that claims to prove personhood or a person is not a bot or robot by scanning their eyes. Users are scanned using a device known as an Orb and issued a global identity protocol known as a World ID in exchange for WLD coins, which they can sell for fiat or hold.\n\nSince its launch in July 2023, Worldcoin has witnessed epic growth, with the Open AI CEO Sam Altman-linked project announcing that it had hit 2.3 million world ID sign-ups worldwide as of August 31 2023. Nevertheless, despite the surging sing-ups, the project has had its fair share of challenges, with various governments raising alarm over its method of collecting user data.\n\nEarlier in August, the high court in Kenya issued orders barring Worldcoin from taking data from citizens pending the hearing and determination of a petition filed by the office of the Data Protection Commissioner. The project was further ordered to preserve the data collected from citizens pending the hearing of the suit. Earlier last week, the country’s parliament began probing Worldcoin, with lawmakers being told that its activities were a threat to national security.\n\nAdvertisement\n\nSeveral European regulators have also begun investigations into Worldcoin, including in Germany, where the Bavarian data protection office launched an investigation into the project in November 2022. France, too, has expressed its uneasiness with the National Commission of Informatics and Liberty questioning Worldcoin’s method of acquiring and storing data.\n\nLate last month, the UK data watchdog also issued a statement noting that it was probing Worldcoin.\n\nInterestingly, despite Woldcoin’s intended global reach, it remains unavailable in the US, mostly due to tough regulations. Notably, Worldcoin’s terms of service elaborate America’s position more clearly: “WLD tokens are not intended to be available for use, purchase, or access by US persons, including US citizens, residents, or persons in the United States, or companies incorporated, located, or resident in the United States, or who have a registered agent in the United States.”\n\nMeanwhile, despite the excitement around Worldcoin already giving way to scepticism, the cryptocurrency has gained unprecedented traction in some jurisdictions. The project has enthralled Argentinians, who have turned up in large numbers to have their eyeballs scanned in exchange for WLD. In a blog published on August 31, Worldcoin reported that 9,500 Argentinians had verified their World ID in a single day (one verification every 9 seconds), setting a new single-day record."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8venljcnlwdG8uY29tL2NhcmRhbm8td2lsbC1iZS1iaWdnZXItdGhhbi1iaXRjb2luLWFuZC1ldGhlcmV1bS1jaGFybGVzLWhvc2tpbnNvbi_SAVxodHRwczovL3p5Y3J5cHRvLmNvbS9jYXJkYW5vLXdpbGwtYmUtYmlnZ2VyLXRoYW4tYml0Y29pbi1hbmQtZXRoZXJldW0tY2hhcmxlcy1ob3NraW5zb24vP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 31 Aug 2023 07:00:00 GMT",
        "title": "Cardano to be Bigger than Bitcoin and Ethereum? Hoskinson Reveals Why ADA is Primed to Explode - ZyCrypto",
        "content": "Advertisement\n\nSpeaking during an event at the end of August, Charles Hoskinson, the founder of the popular blockchain Cardano, gave some insight into the future of the network. The foundational speech, titled ‘The Future of Cardano Governance in the Age of Voltaire,’ was delivered at the opening of Rare Evo, a prominent blockchain and crypto conference in Denver, Colorado.\n\nHoskinson highlighted the importance of Cardano as a leader in the blockchain space, saying that “the other two big guys, Ethereum and Bitcoin, have recused themselves”. He emphasized that both Bitcoin and Ethereum refused to have on-chain governance. He mentioned that in the case of Bitcoin, this anarchy meant that people had to rely on everything the initial founder did.\n\nThis makes changes to the original infrastructure impossible, and any changes imposed on the blockchain result in a fork, rendering the forked network useless for purists. It also implies relying on the original developer to get all aspects right on the first try, an almost unattainable feat.\n\nThe fundamental idea behind the blockchain is to establish a system that functions without the need for trust among participants. However, as per Hoskinson, Ethereum doesn’t even attempt to incorporate on-chain governance. This absence of governance efforts permits the platform’s founder to uphold an enduring dominant position without checks.\n\nCardano Aims to Change the Way We Live\n\nUnlike Ethereum, for example, Cardano’s endgame is to achieve full decentralization and to operate through user consensus and voting rather than being controlled by a single party. He acknowledged that this idea might seem intimidating to some but emphasized its necessity to drive positive change and move away from the traditional top-down hierarchy. He admitted that “it takes [power] away from people,” which is why many shy away from true decentralization.\n\nAdvertisement\n\nCardano’s stability record stands out, with zero downtime since its launch in 2017, spanning almost 6 years. This accomplishment can be attributed to its engaged community, which has established nearly 3,200 stake pools and is currently staking around 23 billion ADA. These efforts contribute to both decentralization and the blockchain’s security. In contrast, certain other blockchains, including Solana, have faced network outages, and even tech giants like Amazon and Google have experienced downtime.\n\nThe co-founder of Ethereum highlights that Cardano’s strength comes from its decentralized nature, emphasizing his belief that the blockchain will encompass a purpose beyond mere monetary functions.\n\nHe envisions Cardano to be the “biggest cryptocurrency in the world,” adding, “I think it’s going to become more than a cryptocurrency; I think it’s going to become the backbone of a new digital nation, a new society, a place where we can finally trust each other again.”\n\nCardano would be a platform encompassing voting, money, and ‘every dimension and aspect’ of our digital lives.\n\nThough technical challenges are still being worked on, Hoskinson says these can be overcome, as the true challenge lies within the social changes to leverage Cardano to make the world more equitable and fairer for all. While Hoskinson has a bold vision for Cardano, the transition to a fully decentralized governance will make or break the whole ecosystem."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA4LTMxL2NyeXB0by1iaW5hbmNlLWFzaWEtcGFjaWZpYy1oZWFkLWxlb24tZm9vbmctaXMtbGVhdmluZy1ibmLSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 31 Aug 2023 07:00:00 GMT",
        "title": "Crypto: Binance Asia Pacific Head Leon Foong Is Leaving (BNB) - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    }
]