[
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3LnRoZXN1bi5jby51ay90cmF2ZWwvMjE2ODM4NzUvY29udmVydGVkLXBsYW5lLWJvZWluZy1haXJibmItY2hhbGxlbmdlcy1lYmF5L9IBW2h0dHBzOi8vd3d3LnRoZXN1bi5jby51ay90cmF2ZWwvMjE2ODM4NzUvY29udmVydGVkLXBsYW5lLWJvZWluZy1haXJibmItY2hhbGxlbmdlcy1lYmF5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Mar 2023 08:00:00 GMT",
        "title": "I spent £2,000 converting a Boeing 737 plane into the ultimate AirBnB… but there were challenges I hadn’t c... - The Sun",
        "content": "A MAN forked out £2,000 to convert a Boeing 737 plane into the ultimate AirBnB.\n\nEntrepreneur and university lecturer Steven Northam, who admitted he knew nothing about planes, bought the 1960s Boeing 737-200 on eBay for £5,000 and has now converted it into a two-storey holiday let.\n\n10 Steven Northam bought the 1960s plane for £5,000 on eBay Credit: Solent\n\n10 The Boeing 737 is now ready to welcome Airbnb guests once he has approval from the local council Credit: Solent\n\n10 The holiday let has some of the plane's original seats Credit: Solent\n\n10 Steven's plane conversion has the original toilet Credit: Solent\n\nVisitors use airport boarding stairs to enter and it features the original seating, overhead lockers and there is even a flight simulator in the cockpit.\n\nThe front half of the 737 airliner sleeps four people and boasts a double bed in the cargo hold, and a hot tub in an old jet engine cowling.\n\nGuests even get to use the original onboard toilet.\n\nThe plane cost him £15,000 to renovate over three months and he has named it the 'Marwell High Club' due to its proximity to Marwell Zoo.\n\nMr Northam, 39, bought the 29ft-long, five-tonne front section from Chichester College, West Sussex, where aircrew had trained using the simulator.\n\nHe spent £3,000 transporting the 14 window-craft just 50 miles using a haulage firm and a crane to a patch of land near his home in Colden Common, near Winchester, Hampshire - on the same road as Marwell Zoo.\n\nHe then worked “fairly solidly” from 7.30am to 4pm on his project from July to September 2022 to make it a cosy place to stay - while retaining the original toilet, eight overhead lockers and three of the 30 passenger seats with trays and pouches underneath.\n\nDespite all that effort, the married dad of two is currently applying to Winchester City Council for a green light to rent the plane out as an Airbnb.\n\nIt has two single beds on the top floor and a double bedroom in the baggage hold, with a glass window to let light in from above.\n\nMr Northam, a Senior Lecturer in Business Management at Winchester University, found old passenger tickets - from Monastir, Tunisia to Lyon, France - tucked between the seats which revealed the Boeing belonged to the airline Tunisair - the national airline of Tunisia.\n\nHe believes it is around 54 years old and was one of the first to be built.\n\nHe said: “It’s a very old school plane. It’s one of the very early ones - it’s retro.\"\n\nThe initial Boeing 737 made its first flight in April 1967 and evolved through the years, with variants seating 85 to 215 passengers.\n\nMr Northam, who is also a business owner, admitted he knows “absolutely nothing” about aeroplanes, but found the craft while scrolling through eBay and thought it was an “interesting” opportunity for another venture.\n\nHe kept a lot of the original parts of the plane, using the passenger seats and signage inside but installed wifi, heating, a shower and an “entertainment hub”.\n\nThe emergency exit is in the kitchenette, but any guests hoping to use that for a speedy exit will find it's now sealed.\n\nHe said: “It was sat at Chichester College for ages, and they hadn’t used it in a while. It just popped up on eBay - I have no idea what happened to the rest of the plane.\n\n“It seemed pretty cheap to me - it was a bargain for the scrap value alone.\n\n“I got a special haulage firm to move it here with a massive crane - it must have been quite a sight on the motorway. I had a fear of it getting here and just rolling over.\n\n“There are a few aeroplane-AirBnBs like this dotted around the world, but only a handful.\n\n“It’s definitely not something you see every day.\n\n\"It’s a fun place to hang out in. Fun is the driver behind it all.\n\n“I’m not a plane fanatic - all I know is that they fly. It’s just a fun project.\"\n\nHe added: “It’s my most ridiculous purchase to date. I've got an armoured truck to convert into a caravan next.\n\n“I have this quirky desire to buy weird stuff.\n\n“I have some aircraft-related films in the plane and cheesy aeroplane-themed cushions on the beds - all the stuff you’d expect.\"\n\nThe AirBnB has sleeping space for four people and a small kitchenette as well as the shower and toilet.\n\nThe flight simulator in the cockpit has a 49\" curved 4k screen installed.\n\nMr Northam, a self-described “big kid”, also went the extra mile to install two 42\" HD TVs and two Xbox Series S.\n\nThere is parking space for two cars, a gas BBQ and an outdoor seating area - including the hot tub and another jet engine cowling which can be used as a seat.\n\nMr Northam is no stranger to innovative projects taking off, as he installed a microchip into his own hand in 2017 to act as a key to his car, home and office - and now the Boeing too.\n\nBut there's also a manual pin pad for guests who would shy away from having cyborg modifications done for their stay.\n\nMr Northam and his primary school teacher wife Rebecca, 36, have two daughters - Poppy, six, and Lottie, four.\n\nHe said: “I tell them this isn’t normal.\n\n\"I have been contacted by people who are obsessed with this stuff, asking to come and see it.\n\n“Parents of kids who love stuff like planes and trains ask me about it too.\n\n\"Inside, it’s a little like a caravan - it was quite large when it was empty with all the seats taken out.\n\n“I get a buzz from seeing projects before and seeing them after - it's satisfying.\"\n\nDue to the unusual shape, Mr Northam struggled to get furniture to fit.\n\nHe said: “The biggest challenge I had with it was that it’s quite an unusual shape so it was hard to find stuff that would fit in here properly.\n\n\"I had to cut a lot of the wooden pieces to fit it.\n\n“The shape of the fuselage is not quite circular, so that was a bit difficult to work with.”\n\n10 There's a small area to prepare some food Credit: Solent\n\n10 Even the hot tub is made from recycled airplane parts Credit: Solent\n\n10 There's a flight simulator in the cockpit Credit: Solent\n\n10 Steve admits he knows nothing about airplanes Credit: Solent\n\n10 There's enough space for four people Credit: Solent"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3LnRoZXN1bi5jby51ay90cmF2ZWwvMjE2ODM4NzUvY29udmVydGVkLXBsYW5lLWJvZWluZy1haXJibmItY2hhbGxlbmdlcy1lYmF5L9IBW2h0dHBzOi8vd3d3LnRoZXN1bi5jby51ay90cmF2ZWwvMjE2ODM4NzUvY29udmVydGVkLXBsYW5lLWJvZWluZy1haXJibmItY2hhbGxlbmdlcy1lYmF5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Mar 2023 08:00:00 GMT",
        "title": "I spent £2,000 converting a Boeing 737 plane into the ultimate AirBnB… but there were challenges I hadn’t c... - The Sun",
        "content": "A MAN forked out £2,000 to convert a Boeing 737 plane into the ultimate AirBnB.\n\nEntrepreneur and university lecturer Steven Northam, who admitted he knew nothing about planes, bought the 1960s Boeing 737-200 on eBay for £5,000 and has now converted it into a two-storey holiday let.\n\n10 Steven Northam bought the 1960s plane for £5,000 on eBay Credit: Solent\n\n10 The Boeing 737 is now ready to welcome Airbnb guests once he has approval from the local council Credit: Solent\n\n10 The holiday let has some of the plane's original seats Credit: Solent\n\n10 Steven's plane conversion has the original toilet Credit: Solent\n\nVisitors use airport boarding stairs to enter and it features the original seating, overhead lockers and there is even a flight simulator in the cockpit.\n\nThe front half of the 737 airliner sleeps four people and boasts a double bed in the cargo hold, and a hot tub in an old jet engine cowling.\n\nGuests even get to use the original onboard toilet.\n\nThe plane cost him £15,000 to renovate over three months and he has named it the 'Marwell High Club' due to its proximity to Marwell Zoo.\n\nMr Northam, 39, bought the 29ft-long, five-tonne front section from Chichester College, West Sussex, where aircrew had trained using the simulator.\n\nHe spent £3,000 transporting the 14 window-craft just 50 miles using a haulage firm and a crane to a patch of land near his home in Colden Common, near Winchester, Hampshire - on the same road as Marwell Zoo.\n\nHe then worked “fairly solidly” from 7.30am to 4pm on his project from July to September 2022 to make it a cosy place to stay - while retaining the original toilet, eight overhead lockers and three of the 30 passenger seats with trays and pouches underneath.\n\nDespite all that effort, the married dad of two is currently applying to Winchester City Council for a green light to rent the plane out as an Airbnb.\n\nIt has two single beds on the top floor and a double bedroom in the baggage hold, with a glass window to let light in from above.\n\nMr Northam, a Senior Lecturer in Business Management at Winchester University, found old passenger tickets - from Monastir, Tunisia to Lyon, France - tucked between the seats which revealed the Boeing belonged to the airline Tunisair - the national airline of Tunisia.\n\nHe believes it is around 54 years old and was one of the first to be built.\n\nHe said: “It’s a very old school plane. It’s one of the very early ones - it’s retro.\"\n\nThe initial Boeing 737 made its first flight in April 1967 and evolved through the years, with variants seating 85 to 215 passengers.\n\nMr Northam, who is also a business owner, admitted he knows “absolutely nothing” about aeroplanes, but found the craft while scrolling through eBay and thought it was an “interesting” opportunity for another venture.\n\nHe kept a lot of the original parts of the plane, using the passenger seats and signage inside but installed wifi, heating, a shower and an “entertainment hub”.\n\nThe emergency exit is in the kitchenette, but any guests hoping to use that for a speedy exit will find it's now sealed.\n\nHe said: “It was sat at Chichester College for ages, and they hadn’t used it in a while. It just popped up on eBay - I have no idea what happened to the rest of the plane.\n\n“It seemed pretty cheap to me - it was a bargain for the scrap value alone.\n\n“I got a special haulage firm to move it here with a massive crane - it must have been quite a sight on the motorway. I had a fear of it getting here and just rolling over.\n\n“There are a few aeroplane-AirBnBs like this dotted around the world, but only a handful.\n\n“It’s definitely not something you see every day.\n\n\"It’s a fun place to hang out in. Fun is the driver behind it all.\n\n“I’m not a plane fanatic - all I know is that they fly. It’s just a fun project.\"\n\nHe added: “It’s my most ridiculous purchase to date. I've got an armoured truck to convert into a caravan next.\n\n“I have this quirky desire to buy weird stuff.\n\n“I have some aircraft-related films in the plane and cheesy aeroplane-themed cushions on the beds - all the stuff you’d expect.\"\n\nThe AirBnB has sleeping space for four people and a small kitchenette as well as the shower and toilet.\n\nThe flight simulator in the cockpit has a 49\" curved 4k screen installed.\n\nMr Northam, a self-described “big kid”, also went the extra mile to install two 42\" HD TVs and two Xbox Series S.\n\nThere is parking space for two cars, a gas BBQ and an outdoor seating area - including the hot tub and another jet engine cowling which can be used as a seat.\n\nMr Northam is no stranger to innovative projects taking off, as he installed a microchip into his own hand in 2017 to act as a key to his car, home and office - and now the Boeing too.\n\nBut there's also a manual pin pad for guests who would shy away from having cyborg modifications done for their stay.\n\nMr Northam and his primary school teacher wife Rebecca, 36, have two daughters - Poppy, six, and Lottie, four.\n\nHe said: “I tell them this isn’t normal.\n\n\"I have been contacted by people who are obsessed with this stuff, asking to come and see it.\n\n“Parents of kids who love stuff like planes and trains ask me about it too.\n\n\"Inside, it’s a little like a caravan - it was quite large when it was empty with all the seats taken out.\n\n“I get a buzz from seeing projects before and seeing them after - it's satisfying.\"\n\nDue to the unusual shape, Mr Northam struggled to get furniture to fit.\n\nHe said: “The biggest challenge I had with it was that it’s quite an unusual shape so it was hard to find stuff that would fit in here properly.\n\n\"I had to cut a lot of the wooden pieces to fit it.\n\n“The shape of the fuselage is not quite circular, so that was a bit difficult to work with.”\n\n10 There's a small area to prepare some food Credit: Solent\n\n10 Even the hot tub is made from recycled airplane parts Credit: Solent\n\n10 There's a flight simulator in the cockpit Credit: Solent\n\n10 Steve admits he knows nothing about airplanes Credit: Solent\n\n10 There's enough space for four people Credit: Solent"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vY293Ym95bGlmZXN0eWxlbmV0d29yay5jb20vMTAtaG9yc2UtYWlyYm5icy13ZS1sb3ZlL9IBQGh0dHBzOi8vY293Ym95bGlmZXN0eWxlbmV0d29yay5jb20vMTAtaG9yc2UtYWlyYm5icy13ZS1sb3ZlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Mar 2023 08:00:00 GMT",
        "title": "10 Horse Airbnbs We Love - Cowboy Lifestyle Network",
        "content": "When traveling with horses, you may be tempted to stay in your trailer or find separate stalls and hotel rooms; but many Horse Airbnbs offer horse boarding! While Airbnb doesn’t currently offer a ‘Horse Boarding’ filter to search for these rentals, there are lots out there. We at Cowboy Lifestyle Network have compiled a list of 10 of our favorite horse-friendly Airbnbs.\n\nFarm Cottage – Anthony, Florida\n\nThis cottage is located on the 22-acre Red Sky Ranch next to an 8-stall horse barn and 4 paddocks; and it includes stall shavings, the wash bay, jump fields, the tack room, and more. In addition to stall boarding, this rental also offers pasture boarding and accommodates long-term stays. The cottage interior is renovated and decorated in a very cute, clean farmhouse way!\n\nRanch Home – Greenville, Texas\n\nThis Texas-style home with a Native American feel is located on a 50+-acre farm just outside of the hustle and bustle of Dallas. It features a hot tub, rocking chairs on the front porch, and a wonderful covered back patio with a gas grill that is perfect for entertaining! There are stables and several pastures available; and every Friday evening, this ranch hosts barrel races, horsemanship clinics, and ropings.\n\nGuesthouse – Elk City, Oklahoma\n\nThis guesthouse, located conveniently off I-40, is the perfect layover in Oklahoma! The luxurious suite is complete with a large walk-in shower with a rainfall shower head, and a large living space with a 75 in. TV and a furnished kitchenette area.\n\nRanch Home – Hesperus, Colorado\n\nThis completely private 4-bedroom Adobe-style home at Spring Hollow Ranch features 3 master suites, a kitchen island that seats eight and a backyard with a wood-burning fireplace, gas fire pit and a hot tub overlooking the La Plata Mountains. With stalls available, there are also riding trails and both an indoor and outdoor arena.\n\nFarmhouse – Seymour, Tennessee\n\nLocated in the heart of the Tri-C working horse and cattle farm, this cozy farm home is fully furnished with appliances including a stacked washer and dryer, and overlooks the hills of the Tennessee ranch. On the first Sunday of every month from April through December, the farm hosts youth rodeos on the property with free admission! This farm also has other rentals available.\n\nDane Hill Manor Suite – Nicasio, California\n\nThe Danehill Manor estate is a 45-minute drive from San Francisco but has stunning views overlooking the Nicasio Reservoir. There are four guest suites available with private terraces and access to the pool area, living quarters, and the 25-acre property. Natural horsemanship lessons are available, as well as somatic therapy, massages, and breathwork.\n\nRanch Home – Amarillo, Texas\n\nThis 1,700 sq. ft. brick home is decorated with patriotic and country decor and includes exercise equipment, an above-ground swimming pool, a ping pong table, an outdoor arena, and fenced front and back yards. There are 6 stalls with runs available, and plenty of parking space for semi and trailer rigs.\n\nRanch Apartment – Corryton, Tennessee\n\nThis apartment is attached to the main house on a ranch with an unobstructed view of House Mountain near Knoxville and the Smokey Mountains. It has a screened-in deck and plenty of parking space. The owners are also happy to offer concierge services, room decoration, gift baskets, champagne, etc.\n\nTack Shack Apartment – Fremont, New Hampshire\n\nAt Brookvale Pines Farm/Tack Shack, which hosts equestrian events for southern New Hampshire, this updated apartment is located above the Tack Shack with a separate entrance, full-size kitchen, large living area, and a washer and dryer. There is room to stall two horses with turnout available.\n\nCabin – Weatherford, Texas\n\nThis cabin at the Longhorn Ranch not only has pasture to turn out horses but the opportunity to fish right off the dock. There is a pool table, gas grill, porch seating, and a fire pit; and the open floor plan rental has plenty of natural lighting and a private drive with space for a truck and trailer. This property even has an official mascot, the young longhorn named Shadow.\n\nAll photos were provided directly from the AirBnB listings."
    }
]