[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vY29pbmZvbWFuaWEuY29tL3BhbmNha2Vzd2FwLWJ1cm5zLTEwbS1pbi1jYWtlLWluLWxhdGVzdC1idXJuLXNjaGVkdWxlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "PancakeSwap Burns $10M in CAKE in Latest Burn Schedule - Coinfomania",
        "content": "PancakeSwap, the dominant decentralized exchange (DEX) built on the BNB Chain, announced on Monday the burn of over 8.4 million CAKE tokens, representing $10 million. The latest burn joins a series of scheduled token burns held by the decentralized protocol.\n\nA token burn is a way of erasing a portion of a cryptocurrency from its circulating supply. The burn involves sending an assigned quantity of cryptocurrency to a burn address. The deflationary mechanism aims to reduce that asset’s total available units and increase its demand in the market.\n\nToken burns can be scheduled to occur every week, month, or after any other designated timeframe. In PancakeSwap’s case, the token burns occur weekly. Ether (ETH) and Binance Coin (BNB) are other examples of crypto assets using the token burn process to bolster their performance.\n\nPancakeSwap Burns 8.4M $CAKE\n\nThe announcement shows a breakdown of the token burn. Trading fees from crypto swaps and perpetual in PancakeSwap’s V2 were 271,000 CAKE tokens, equivalent to $321,000. Trading fees derived from PancakeSwap’s V3 were 66,000 CAKE tokens worth $78,000.\n\nThe protocol’s prediction and lottery services recorded a downsize of 66,000 CAKEs ($79,000) and 37,000 CAKEs ($44,000), respectively. PancakeSwap’s non-fungible token (NFT) business saw a burn of 8,000 CAKE tokens worth $1,000.\n\nLast week, the project recorded a token burn worth $11 million. Previous coverage by Coinfomania revealed that PancakeSwap burned $30 million worth of CAKE to bolster its ecosystem.\n\nOutlook on PancakeSwap’s Overall Performance\n\nA zoom-out on PancakeSwap’s performance since January reveals that the DEX is experiencing a gradual decrease in engagement, similar to the overall DEX market.\n\nOn-chain data from the analytics platform DeFiLlama shows that PancakeSwap currently holds a total value locked (TVL) of $1.37 billion.\n\nSource: DeFiLlama\n\nStill, the project continues to expand its reach to new audiences on several networks. The latest was the protocol’s launch on the Coinbase-backed layer-2 network, Base. Also, PancakeSwap’s recently launched V3 was deployed on BNB Chain and Ethereum as part of efforts to bring advanced features to more audiences.\n\nMeanwhile, PancakeSwap’s native cryptocurrency CAKE has been on a steady decline. After trading for as high as $4.66 earlier this year, the asset currently trades at $1.2."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vY29pbmZvbWFuaWEuY29tL3BhbmNha2Vzd2FwLWJ1cm5zLTEwbS1pbi1jYWtlLWluLWxhdGVzdC1idXJuLXNjaGVkdWxlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "PancakeSwap Burns $10M in CAKE in Latest Burn Schedule - Coinfomania",
        "content": "PancakeSwap, the dominant decentralized exchange (DEX) built on the BNB Chain, announced on Monday the burn of over 8.4 million CAKE tokens, representing $10 million. The latest burn joins a series of scheduled token burns held by the decentralized protocol.\n\nA token burn is a way of erasing a portion of a cryptocurrency from its circulating supply. The burn involves sending an assigned quantity of cryptocurrency to a burn address. The deflationary mechanism aims to reduce that asset’s total available units and increase its demand in the market.\n\nToken burns can be scheduled to occur every week, month, or after any other designated timeframe. In PancakeSwap’s case, the token burns occur weekly. Ether (ETH) and Binance Coin (BNB) are other examples of crypto assets using the token burn process to bolster their performance.\n\nPancakeSwap Burns 8.4M $CAKE\n\nThe announcement shows a breakdown of the token burn. Trading fees from crypto swaps and perpetual in PancakeSwap’s V2 were 271,000 CAKE tokens, equivalent to $321,000. Trading fees derived from PancakeSwap’s V3 were 66,000 CAKE tokens worth $78,000.\n\nThe protocol’s prediction and lottery services recorded a downsize of 66,000 CAKEs ($79,000) and 37,000 CAKEs ($44,000), respectively. PancakeSwap’s non-fungible token (NFT) business saw a burn of 8,000 CAKE tokens worth $1,000.\n\nLast week, the project recorded a token burn worth $11 million. Previous coverage by Coinfomania revealed that PancakeSwap burned $30 million worth of CAKE to bolster its ecosystem.\n\nOutlook on PancakeSwap’s Overall Performance\n\nA zoom-out on PancakeSwap’s performance since January reveals that the DEX is experiencing a gradual decrease in engagement, similar to the overall DEX market.\n\nOn-chain data from the analytics platform DeFiLlama shows that PancakeSwap currently holds a total value locked (TVL) of $1.37 billion.\n\nSource: DeFiLlama\n\nStill, the project continues to expand its reach to new audiences on several networks. The latest was the protocol’s launch on the Coinbase-backed layer-2 network, Base. Also, PancakeSwap’s recently launched V3 was deployed on BNB Chain and Ethereum as part of efforts to bring advanced features to more audiences.\n\nMeanwhile, PancakeSwap’s native cryptocurrency CAKE has been on a steady decline. After trading for as high as $4.66 earlier this year, the asset currently trades at $1.2."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8venljcnlwdG8uY29tL3ZlcnR1LXVudmVpbHMtbWV0YXZlcnR1LTItYXQtdG9rZW4tMjA0OS1hLXN0ZXAtZm9yd2FyZC1mb3Itd2ViMy1hbmQtdGhlLW1vYmlsZS1pbmR1c3RyeS_SAXFodHRwczovL3p5Y3J5cHRvLmNvbS92ZXJ0dS11bnZlaWxzLW1ldGF2ZXJ0dS0yLWF0LXRva2VuLTIwNDktYS1zdGVwLWZvcndhcmQtZm9yLXdlYjMtYW5kLXRoZS1tb2JpbGUtaW5kdXN0cnkvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "VERTU Unveils METAVERTU 2 At TOKEN 2049: A Step Forward For Web3 And The Mobile Industry - ZyCrypto",
        "content": "Advertisement\n\nVERTU, a luxury mobile phone brand based in the UK, is excited to unveil its next-gen Web3 phone METAVERTU 2, set to redefine the mobile landscape.\n\nThe unveiling was made during the TOKEN 2049, where Paul Veradittakit, Pantera partner, emphasized the need for mobile accessibility in the global adoption of crypto products. METAVERTU 2 is built on the success of its predecessor, METAVERTU, the first Web3 phone launched last year. METAVERTU 2 is set for an official release at the end of October.\n\nMETAVERTU 2 is a mobile device that seamlessly integrates users into decentralized networks and the overall blockchain space. Notably, METAVERTU 2 represents the pinnacle of VERTU’s mission to make blockchain and Web3 accessible to all users.\n\nVERTU, envisions METAVERTU 2 as a personal agent representing prestige, going beyond simple communication. The phone blends an exceptional design with many advanced features designed to enhance users’ mobile experience. First, the phone has a decentralized operating system (DOS) that allows users to switch between Web2 and Web3 with just a single tap. The team behind the project got the opportunity to demonstrate the dual system at the VETRU booth during TOKEN 2049. All Web3 apps will be managed separately within the METASPACE to ensure heightened privacy and security.\n\nAnother feature of METAVERTU 2 is its Hardware ZK (Zero-Knowledge Proof). This feature utilizes smartphones as edge computing nodes and secure Elements as computing units, enabling Zero-Knowledge Proof. The result is simplifying blockchain verification to the extent of a fingerprint scan. The new phone has also incorporated the I-DID protocol bound with an IMEI number. This eliminates Sybil attacks while ensuring the quality of high-net-worth users. The device has also integrated EQ and IQ agents for emotional companionship and task assistance.\n\nAdvertisement\n\nMETAVERTU 2 will introduce a Decentralized AI Agent (DAA) module for all users. DAA harnesses decentralized blockchain storage to offer tailored and memory-sharing features that enhance user experience.\n\nUsing its many years of experience in the market, VERTU hopes to advance Web3 on mobile platforms. In the long run, the company aims to converge luxury hardware and Web3 technology to offer its users access to blockchain technology while creating a secure environment for its users across the globe.\n\nCurrently, VERTU welcomes all eager users to make their pre-orders for the METAVERTU 2 on their website. Note all preorder participants stance a chance of whining Bitcoin in the coming days."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3LmNyeXB0b25ld3N6LmNvbS9wb2x5bmV0d29yay1oYWNrLXZpY3RpbXMtY2FuLW5vdy1maWxlLW1ldGlzLWNsYWltcy_SAVNodHRwczovL3d3dy5jcnlwdG9uZXdzei5jb20vcG9seW5ldHdvcmstaGFjay12aWN0aW1zLWNhbi1ub3ctZmlsZS1tZXRpcy1jbGFpbXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "PolyNetwork hack victims can now file Metis claims - CryptoNewsZ",
        "content": "Users who suffered losses as a result of the PolyNetwork hack can now settle their claims. Metis has announced that the claim-settlement mechanism is now live as of September 15, 2023, 1 p.m. UTC. The designated domain is redemption.metis.io. Metis is covering all the losses while attempting to begin a new chapter with the community.\n\nThis demonstrates the Metis people’s dedication to making up for the community’s losses. Users can find the best alternative DeFi solution on the Metis ecosystem page. The community has responded with mixed reactions to this announcement. One member has said that while the solution is fair, Metis took a long time to come up with it compared to the duration they would have preferred.\n\nThe redemption process by Metis is a 2-step process that starts with claiming rMETIS and ends with redeeming them for METIS. Users are required to connect their wallet with the BNB chain; however, the wallet should specifically be the one that holds METIS on the chain. The PolyNetwork hack should have also affected the wallet.\n\nCheck the Eligibility Check section to know if the claims can be sought. The webpage will reflect the deadline by which claims can be made for rMETIS tokens. The maximum time by which claims can be made is 13 months, starting September 15 this year. Meaning, an affected user can redeem the claim by October 15, 2024. This has a 12-month vesting period plus a 1-month grace period.\n\nUsers can alternatively choose to redeem the claim on the first day itself. It would affect the total number of tokens.\n\nUsers who were affected by the PolyNetwork hack are eligible to redeem the claim on BNB Chain at block 29591664. The claim’s actual value will depend on the date on which the user makes the redemption. It will be determined as follows:\n\nPrice Ratio at the current time = (current time – start date) / (end date – start date)\n\nThe METIS token will then be determined as:\n\nPrice Ratio * rMETIS Amount\n\nThe claiming formula can also be understood by the fact that if tokens are redeemed on the first day, then the settlement would be 0.5 METIS for every rMETIS held. One year later, it will change to 1 METIS for every rMETIS user holds. The one year has been put in place by Metis to protect the community.\n\nThose who have started to redeem their claims were last seen struggling with the process. Many members of the community asked each other if they had been able to complete the process. Another member on X, formerly Twitter, questioned how the settlement mechanism was working after the system reflected 6.5 rMETIS for 300 METIS.\n\nUsers are recommended to get in touch with Metis directly to get their questions answered instead of speculating about consequences."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vdGhlY3VycmVuY3lhbmFseXRpY3MuY29tL2FsdGNvaW5zL2JpbmFuY2UtY29pbi1ibmItZ2FpbnMtbW9tZW50dW0tZXllaW5nLTIxNy1hbmQtYmV5b25kLTcwNTI10gFpaHR0cHM6Ly90aGVjdXJyZW5jeWFuYWx5dGljcy5jb20vYWx0Y29pbnMvYmluYW5jZS1jb2luLWJuYi1nYWlucy1tb21lbnR1bS1leWVpbmctMjE3LWFuZC1iZXlvbmQtNzA1MjUvYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "Binance Coin (BNB) Gains Momentum, Eyeing $217 and Beyond - The Currency Analytics",
        "content": "In the world of cryptocurrency, Binance Coin (BNB) has been making significant moves over the past week, with a 1.08% increase in its price. Let’s break down the latest developments in simple terms for all to understand.\n\nOn the shorter-term hourly chart, BNB is showing some promising signs as it attempts to establish a foothold above the $215.2 resistance level. If we see the daily closing bar settle above this crucial mark, it could pave the way for further upward momentum, possibly reaching the $216 to $217 range.\n\nBut it’s not just about the hourly chart; we need to zoom out and consider the bigger picture. Traders and investors should closely monitor the daily closing bar. If it ends up near the peak seen yesterday, we might be looking at a scenario where BNB tests the resistance at $218.8 in the coming days.\n\nIn simpler terms, Binance Coin seems to be on an upward trajectory, and there are key price levels to watch out for. Now, let’s delve deeper into what’s driving this cryptocurrency’s recent performance.\n\nUnderstanding the BNB Surge\n\nBNB, the native cryptocurrency of the Binance exchange, has been gaining attention from both crypto enthusiasts and investors. Its recent uptick can be attributed to a combination of factors, including positive market sentiment, increased adoption, and broader developments in the cryptocurrency space.\n\nMarket Sentiment: Cryptocurrency markets are often influenced by sentiment. When investors feel positive about a particular asset, they are more likely to buy and hold it. Recent positive sentiment surrounding BNB has contributed to its price rise.\n\nIncreased Adoption: Binance Coin has found utility beyond just trading on the Binance platform. It is now used for various purposes, including paying transaction fees on the exchange, participating in token sales, and even as a form of payment in some online stores. This increased utility has made BNB more attractive to users.\n\nOverall Market Developments: The broader cryptocurrency market has also been experiencing positive movements. Bitcoin and other major cryptocurrencies have been on the rise, which often has a spillover effect on other digital assets like BNB.\n\nWhat Lies Ahead for Binance Coin (BNB)\n\nAs we look ahead, it’s essential to keep an eye on the key resistance levels and daily closing bars mentioned earlier. These are critical indicators of whether BNB will continue its upward journey. Breaking through the $215.2 resistance could open the door to further gains, potentially reaching $216 to $217.\n\nIf the daily closing bar aligns with yesterday’s peak, it’s possible that BNB could make a significant move towards the $218.8 resistance level in the near future.\n\nInvestor and Trader Strategies\n\nFor those considering BNB as an investment or trading opportunity, it’s important to approach it with a well-thought-out strategy:\n\n1. Risk Management: As with any investment, it’s crucial to manage risk. Set stop-loss orders to limit potential losses in case of adverse price movements.\n\n2. Stay Informed: Keep yourself informed about the latest developments in the cryptocurrency market, especially news related to Binance and BNB.\n\n3. Diversify: Don’t put all your eggs in one basket. Diversify your investment portfolio to spread risk across different assets.\n\n4. Long-Term vs. Short-Term: Determine whether you’re looking for short-term gains or a long-term investment. Your strategy may vary based on your goals.\n\n5. Consult Experts: If you’re new to cryptocurrency trading or investing, consider seeking advice from experts or financial advisors.\n\nClosing Thoughts\n\nBinance Coin (BNB) is currently on the move, with potential for further gains if key resistance levels are breached. As the cryptocurrency market continues to evolve, it’s crucial for both traders and investors to stay informed and make informed decisions.\n\nThe coming days will be critical for BNB, and the daily closing bars will provide valuable insights into its future direction. Keep a watchful eye on this digital asset as it navigates the exciting world of cryptocurrency."
    }
]