[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMinAFodHRwczovL3d3dy50aGVoaW5kdS5jb20vbmV3cy9uYXRpb25hbC90YW1pbC1uYWR1L2hvbWVzdGF5cy1iYnMtY2FtcGluZy1vdXRmaXRzLWluLW5pbGdpcmlzLWFza2VkLXRvLXJlZ2lzdGVyLXdpdGgtdG4tdG91cmlzbS1kZXBhcnRtZW50L2FydGljbGU2NzEzMTAwMS5lY2XSAaEBaHR0cHM6Ly93d3cudGhlaGluZHUuY29tL25ld3MvbmF0aW9uYWwvdGFtaWwtbmFkdS9ob21lc3RheXMtYmJzLWNhbXBpbmctb3V0Zml0cy1pbi1uaWxnaXJpcy1hc2tlZC10by1yZWdpc3Rlci13aXRoLXRuLXRvdXJpc20tZGVwYXJ0bWVudC9hcnRpY2xlNjcxMzEwMDEuZWNlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jul 2023 07:00:00 GMT",
        "title": "Homestays, B&Bs, camping outfits in Nilgiris asked to register with T.N. Tourism Department - The Hindu",
        "content": "Homestays, bed and breakfasts, as well as businesses that are part of the tourism industry in the Nilgiris have been urged to register themselves with the T.N. Tourism Department.\n\nIn a press release, the Nilgiris district administration stated that many homestays, bed and breakfasts as well as businesses offering camping experiences were operating without any permissions. They, along with new businesses were directed to register themselves on the tntourismtors.com website. Businesses that fail to do so will face action from the Nilgiris district administration, it was announced.\n\nPeople can get in touch with the district tourism officer’s office on Wenlock Road in Udhagamandalam, or get in touch with the office through their email address, touristofficeooty@gmail.com and on the phone at 0423-2443977 and 7550009231."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY29pbmZvbWFuaWEuY29tL2JuYi1jaGFpbi1kb21pbmF0ZXMtNDYtNzUtb2Ytc21hcnQtY29udHJhY3RzLW1hcmtldC1yZXBvcnQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jul 2023 07:00:00 GMT",
        "title": "BNB Chain Dominates 46.75% of Smart Contracts Market: Report - Coinfomania",
        "content": "A quarterly report published on Thursday showed that Binance’s native network, BNB Chain, dominated about 46.75% of smart contract shares in this year’s second quarter. The data collected between April and June 2023 displayed BNB Chain’s increasing number of verified smart contracts per month amidst the bear market.\n\nBNB Chain’s daily active users (DAU) also reached a high of 1.2 million in the quarter, keeping its position as the most-used network for smart contract verification. The report also showed that the Binance Coin Chain verifies an average of 5,000 smart contracts weekly.\n\nThe analysis contained a month-to-month breakdown of the number of verified smart contract activities on top networks like Ethereum, Polygon, BNB Chain, Fantom, Avalanche, Optimisms, and Arbitrum. Smart contract verification is the process of matching a smart contract source to its on-chain bytecode.\n\nGrowth Amidst Market Uncertainties\n\nThe BNB Chian smart contract verification has consistently grown amidst crypto market uncertainties. The Binance-owned network saw a 7% increment in market shares, closing at 45% from 38% at the beginning of Q2.\n\nBNB Chain’s usability is evident, as it has attracted top guns in the crypto industry. Decentralized exchanges (DEX) Unswap and Pancakeswap launched in BNB Chain earlier in the year, and their launch recorded huge success trading volume-wise. The Binance-owned chain’s drive for improvement and innovation saw it deploy various upgrades, like the BEP-126 feature, which improved the network’s security and reliability.\n\nDespite BNB Chain’s owners, Binance, facing regulatory scrutiny by several regulators globally, the Thursday report has shown how much developers still believe in the chain and its scalability.\n\nBroader Market Smart Contract Adoption\n\nEthereum and the other networks earlier mentioned also saw increased smart contract verification on-chain activities, particularly in May, in a broader market-improved appetite for web3 usage by new dApps and projects.\n\nThe Ethereum network kept its position in the pecking order as Etherscan was the second most-used smart contract validator. Its usage increased by 2% to 33% from 31% at the beginning of the quarter. Polygon, Fantom, and Avalanche saw slight improvements in their on-chain verification activities, with 2%, 1.9%, and 0.5% increments, respectively."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiL2h0dHBzOi8vbmZ0cGxhemFzLmNvbS9iaW5hbmNlLWFpLW5mdC1nZW5lcmF0b3Iv0gEzaHR0cHM6Ly9uZnRwbGF6YXMuY29tL2JpbmFuY2UtYWktbmZ0LWdlbmVyYXRvci9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jul 2023 07:00:00 GMT",
        "title": "Binance Replaces Bicasso with Bixel – AI NFT Generator Upgrade - NFT Plazas",
        "content": "Binance Replaces Bicasso with Bixel – AI NFT Generator Upgrade\n\nCapitalizing on a recent craze and amending past mistakes as per Bicasso, Binance recently launched a KYC-registered AI NFT generator, enabling users to create personalized artworks using highly regarded cutting-edge tech.\n\nThe tool ‘Bixel’ is now accessible to all interested, empowering creatives to quickly produce unique digital artworks — the first 10 of which are on the house — and easily partake in the limitless world of NFTs with the helping hand of machine learning.\n\n#Binance's AI NFT generator is back! Bixel is now publicly available, letting you unleash your creativity to generate your own AI artwork. Create your digital art before the 10th of August for the chance to win 1 #BNB! Learn more here 👇https://t.co/Mh5VYHmYmp — Binance (@binance) July 26, 2023\n\nFrom Bicasso to an Ever-Lasting Bixel\n\nThis Binance AI NFT generator may sound familiar due to the project rolling out a similar version in March. However, issues involving Bicasso soon began arising, despite it reaching total capacity within just 2.5 hours of launching and generating 10,000 assets. Critics accused Binance of copying the winners of BNB Chain’s hackathon, ‘Chatcasso’, due to launching the product with similarities just two weeks after the event.\n\nUndeterred, Binance’s new AI NFT generator claims to be here to stay. However, this time around, users must complete the platform’s KYC identity validation process to embark on creative ventures. Binance is committed to maintaining a secure and trustworthy environment by adhering to industry best practices and regulatory requirements.\n\nFurther ensuring flawless execution of NFT creation, users wishing to mint NFTs via Bixel must pay a minting fee of just 0.008 BNB ($1.90) through Binance’s blockchain network, BNB Smart Chain. These minting costs will be returned to users creating their artworks before August 10, following early trendsetters being granted 1 BNB as a token of gratitude. More exclusive rewards are also promised to unveil down the pipeline.\n\nRegardless of past controversies, Binance is committed to strengthening the potential of AI-powered NFTs with high regard for legality, empowering artists to create attractive digital art that can easily and securely be shared, sold, and traded for financial gain on a global scale.\n\nWant more? Connect with NFT Plazas\n\nJoin the Weekly Newsletter\n\nFollow us on Twitter\n\nLike us on Facebook\n\nFollow us on Instagram\n\n*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZXRoZXItZW5kLXdlZWstaW4tZG9sZHJ1bXMv0gE8aHR0cHM6Ly9mb3JrYXN0Lm5ld3MvYml0Y29pbi1ldGhlci1lbmQtd2Vlay1pbi1kb2xkcnVtcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether end week in interest rate doldrums; Binance’s BNB token leads winners - Forkast News",
        "content": "Bitcoin and Ether prices were largely mixed but running into the red on Friday morning in Asia, with both looking to end the week in the losers column after a period of directionless trading. The interest rate hike by the Federal Reserve on Wednesday was followed by a bigger than expected GDP number in the U.S. overnight, raising concern about rates staying higher for longer. Japan tweaked its ultra-loose interest rate policy on Friday, adding to the risk-averse mood. Most other top 10 non-stablecoin cryptocurrencies traded mixed. Binance’s BNB led the winners after the world’s largest crypto exchange said it would fully restore operations in Japan in August. The Forkast 500 NFT index dipped and U.S. equity futures moved higher after a down day on Wall Street on Thursday.\n\nLosing steam\n\nBitcoin dipped 0.41% in the last 24 hours to US$29,211 as of 07:45 a.m. in Hong Kong, bringing its loss for the past seven days to 1.97%, according to data from CoinMarketCap. The world’s largest cryptocurrency skidded lower on Thursday evening, managing to stay above support at US$29,000, but only just.\n\nConcern about higher interest rates compounded on Friday for risk assets like cryptocurrencies when the Bank of Japan – one of the last major central banks to maintain a loose monetary policy – adjusted its yield curve control policy, potentially creaking open the door to higher rates and raising the cost of money.\n\nThe Bank of Japan changing its ultra-loose monetary policies could be an issue to the crypto market, which is running out of price catalysts, Markus Thielen, head of crypto research & strategy at digital asset service platform Matrixport, said in an emailed comment.\n\nThe recent Bitcoin exchange-traded fund (ETF) filings in the U.S. could have boosted crypto higher but, “prices have instead been range-bound,” according to a Matrixport report on Thursday.\n\n“The Grayscale Bitcoin Trust (GBTC) net asset value has lowered its discount from -45% to just -27% this year, but as the discount has started to widen again (from -25%), we see this as a sign that the Blackrock Bitcoin ETF news is losing momentum. The result could be a drop in Bitcoin prices,” said the report.\n\n“Predictably, the crypto market has become very quiet during these summer weeks. This has caused trading volumes and volatility to fall markedly. Investors might be well advised to replace their Bitcoin spot with Bitcoin options, notably upside calls, as lower volatility has made option prices cheaper.”\n\nAlong with Bitcoin, Ether dipped 0.51% to US$1,860, down 1.68% for the seven-day period.\n\nOther top 10 non-stablecoin cryptocurrencies traded mixed, with Polygon’s MATIC leading the losers, and Binance’s BNB the winners.\n\nBinance’s BNB gained 0.75% to US$240.46, but was still trading 0.98% lower for the week.\n\nChangpeng Zhao, chief executive officer of Binance, announced at the WebX conference in Tokyo on Wednesday that the crypto exchange will restore full operations in Japan in August.\n\n“Japan is a flagship leader in this (Web3) area and I think is an example for the rest of the world to follow. And to that end, Binance is extremely happy to participate in the Japanese market again,” said Zhao in his address.\n\nOn the regulatory front in the U.S., the U.S. House Financial Services Committee passed a bill Wednesday aimed at defining whether cryptocurrencies are securities or commodities.\n\nThe bill, Financial Innovation and Technology for the 21st Century Act, seeks to increase the Commodity Futures Trading Commission’s oversight over the crypto industry and clarify the jurisdiction of the Securities and Exchange Commission (SEC).\n\nThe House of Representatives Agricultural Committee also voted on Thursday to approve the bill, which now moves to the House floor.\n\n“The US regulatory permafrost is thawing. For the first time, Congress took critical steps to establish a comprehensive federal regulatory framework for digital assets in the US,” said Sheila Warren, CEO of the Crypto Council for Innovation – a global alliance of crypto industry leaders, in an emailed comment.\n\n“Policymakers recognize that not only does legal uncertainty stifle responsible innovation, but it threatens to create an environment in which American investors must turn offshore,” Warren added.\n\nThe total crypto market capitalization dipped 0.47% in the past 24 hours to US$1.18 trillion, while trading volume dropped 16.53% to US$26.07 billion.\n\nForkast 500 dips (again), CyberKongz’s Genkai stumbles\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nThe main Forkast 500 NFT index dipped 0.65% in the past 24 hours to 2,619.60 as of 10:00 a.m. in Hong Kong, down 2.95% for the week. Forkast’s Ethereum, Solana and Polygon NFT market indexes all logged losses, while Cardano’s index edged higher.\n\nTotal NFT trading volume fell 16.28% in the past 24 hours to US$16.84 million, according to data from CryptoSlam. Volumes on the Ethereum, BNB Chain, Bitcoin and Polygon networks fell. The Solana, Mythos Chain, Immutable X and Cardano networks logged increases.\n\nBy NFT collections, Ethereum-based Bored Ape Yacht Club (BAYC) saw the largest 24-hour trading volumes, which edged up 2.92% to US$931,750.\n\nBut over a longer time scale the trading picture for BAYC doesn’t look so pretty, with the collection’s 30-day volume slumping 82% and the floor price falling 15% in the same period, according to NFT data tracker WGMI.io.\n\nAn NFT highlight this week is the Genkai collection of 20,000 anime-themed NFTs based on the CyberKongz NFT series. It was launched on Thursday and available on Ethereum and the Ronin blockchain operated by Sky Mavis, the Vietnam-based developer behind breakout play-to-earn title Axie Infinity.\n\nStill, the overall trading slump caused a bit of a stumble for Genkai.\n\n“The market continued to be very slow and the CyberKongz failed to mint out their full (Genkai) collection. However, they did sell out their full supply of NFTs on Ronin within an hour and so have raised roughly US$2 million,” said Yehudah Petscher, NFT Strategist at Forkast Labs.\n\n“Because of the slow sales in the Genkai collection, the team is giving free extra NFTs to those who mint, continuing a long tradition in NFTs of rewarding holders,” said Petscher.\n\nElsewhere, the U.S.-based online music store Beatport, which is known for selling music resources to DJs for remixes, launched its NFT marketplace Beatport.io on Thursday, where users can buy, sell and trade electronic music recordings as NFTs.\n\nThe Beatport NFT marketplace was developed in partnership with Germany-based Web3 startup Define Creative, and is built on Aventus, a parachain based on the Polkadot network.\n\nU.S. equity futures shrug off rate concerns\n\nImage: Getty Images\n\nU.S. stock futures traded higher as of 11:30 a.m. on Friday in Hong Kong. The three major U.S. stock indexes closed lower in regular trading the prior day, with the Dow Jones Industrial Average leading the losers with a 0.67% slide, ending its longest winning streak since 1987.\n\nIn Asia, the main stock indexes were mixed on Friday morning. China’s Shanghai Composite and Hong Kong’s Hang Seng rose, while South Korea’s Kospi and Japan’s Nikkei logged losses.\n\nU.S. gross domestic product (GDP) accelerated to 2.4% in the second quarter of the year, the Commerce Department said on Thursday. The number beat analysts’ expectation of 1.8% growth, further easing fears about a recession this year, Reuters reported on Friday.\n\nHowever, the bad news in that good news is faster GDP growth may suggest to the Federal Reserve it needs to do more policy tightening to curb inflation, according to a Bloomberg report on Thursday.\n\nHowever, the GDP report did show signs of a slowdown in price gains. The index for gross domestic purchases, an inflation gauge, rose at an annual rate of 1.9% in the second quarter, the slowest in three years.\n\nElsewhere, the Bank of Japan (BOJ) announced on Friday it will maintain its ultra-low interest rates, keeping its short-term policy interest rate target at -0.1% and the 10-year government bond yield at around 0%.\n\nBut the BOJ also announced an adjustment to its so-called yield curve control policy, saying it will allow “greater flexibility” in use of the monetary tool, a move seen by some investors as the first baby steps to the BOJ trying to normalize policy after years of an ultra-loose monetary regime to combat deflation.\n\nThe tool, known as YCC, aims to control the shape of the bond yield curve to suppress short- to medium-term rates – which affect corporate borrowers – without depressing super-long yields too much and reducing returns for pension funds and life insurers, according to the explainer by Reuters.\n\n(Adds equity section, updates introduction on BOJ, equity futures.)"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZXRoZXItZW5kLXdlZWstaW4tZG9sZHJ1bXMv0gE8aHR0cHM6Ly9mb3JrYXN0Lm5ld3MvYml0Y29pbi1ldGhlci1lbmQtd2Vlay1pbi1kb2xkcnVtcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether end week in interest rate doldrums; Binance’s BNB token leads winners - Forkast News",
        "content": "Bitcoin and Ether prices were largely mixed but running into the red on Friday morning in Asia, with both looking to end the week in the losers column after a period of directionless trading. The interest rate hike by the Federal Reserve on Wednesday was followed by a bigger than expected GDP number in the U.S. overnight, raising concern about rates staying higher for longer. Japan tweaked its ultra-loose interest rate policy on Friday, adding to the risk-averse mood. Most other top 10 non-stablecoin cryptocurrencies traded mixed. Binance’s BNB led the winners after the world’s largest crypto exchange said it would fully restore operations in Japan in August. The Forkast 500 NFT index dipped and U.S. equity futures moved higher after a down day on Wall Street on Thursday.\n\nLosing steam\n\nBitcoin dipped 0.41% in the last 24 hours to US$29,211 as of 07:45 a.m. in Hong Kong, bringing its loss for the past seven days to 1.97%, according to data from CoinMarketCap. The world’s largest cryptocurrency skidded lower on Thursday evening, managing to stay above support at US$29,000, but only just.\n\nConcern about higher interest rates compounded on Friday for risk assets like cryptocurrencies when the Bank of Japan – one of the last major central banks to maintain a loose monetary policy – adjusted its yield curve control policy, potentially creaking open the door to higher rates and raising the cost of money.\n\nThe Bank of Japan changing its ultra-loose monetary policies could be an issue to the crypto market, which is running out of price catalysts, Markus Thielen, head of crypto research & strategy at digital asset service platform Matrixport, said in an emailed comment.\n\nThe recent Bitcoin exchange-traded fund (ETF) filings in the U.S. could have boosted crypto higher but, “prices have instead been range-bound,” according to a Matrixport report on Thursday.\n\n“The Grayscale Bitcoin Trust (GBTC) net asset value has lowered its discount from -45% to just -27% this year, but as the discount has started to widen again (from -25%), we see this as a sign that the Blackrock Bitcoin ETF news is losing momentum. The result could be a drop in Bitcoin prices,” said the report.\n\n“Predictably, the crypto market has become very quiet during these summer weeks. This has caused trading volumes and volatility to fall markedly. Investors might be well advised to replace their Bitcoin spot with Bitcoin options, notably upside calls, as lower volatility has made option prices cheaper.”\n\nAlong with Bitcoin, Ether dipped 0.51% to US$1,860, down 1.68% for the seven-day period.\n\nOther top 10 non-stablecoin cryptocurrencies traded mixed, with Polygon’s MATIC leading the losers, and Binance’s BNB the winners.\n\nBinance’s BNB gained 0.75% to US$240.46, but was still trading 0.98% lower for the week.\n\nChangpeng Zhao, chief executive officer of Binance, announced at the WebX conference in Tokyo on Wednesday that the crypto exchange will restore full operations in Japan in August.\n\n“Japan is a flagship leader in this (Web3) area and I think is an example for the rest of the world to follow. And to that end, Binance is extremely happy to participate in the Japanese market again,” said Zhao in his address.\n\nOn the regulatory front in the U.S., the U.S. House Financial Services Committee passed a bill Wednesday aimed at defining whether cryptocurrencies are securities or commodities.\n\nThe bill, Financial Innovation and Technology for the 21st Century Act, seeks to increase the Commodity Futures Trading Commission’s oversight over the crypto industry and clarify the jurisdiction of the Securities and Exchange Commission (SEC).\n\nThe House of Representatives Agricultural Committee also voted on Thursday to approve the bill, which now moves to the House floor.\n\n“The US regulatory permafrost is thawing. For the first time, Congress took critical steps to establish a comprehensive federal regulatory framework for digital assets in the US,” said Sheila Warren, CEO of the Crypto Council for Innovation – a global alliance of crypto industry leaders, in an emailed comment.\n\n“Policymakers recognize that not only does legal uncertainty stifle responsible innovation, but it threatens to create an environment in which American investors must turn offshore,” Warren added.\n\nThe total crypto market capitalization dipped 0.47% in the past 24 hours to US$1.18 trillion, while trading volume dropped 16.53% to US$26.07 billion.\n\nForkast 500 dips (again), CyberKongz’s Genkai stumbles\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nThe main Forkast 500 NFT index dipped 0.65% in the past 24 hours to 2,619.60 as of 10:00 a.m. in Hong Kong, down 2.95% for the week. Forkast’s Ethereum, Solana and Polygon NFT market indexes all logged losses, while Cardano’s index edged higher.\n\nTotal NFT trading volume fell 16.28% in the past 24 hours to US$16.84 million, according to data from CryptoSlam. Volumes on the Ethereum, BNB Chain, Bitcoin and Polygon networks fell. The Solana, Mythos Chain, Immutable X and Cardano networks logged increases.\n\nBy NFT collections, Ethereum-based Bored Ape Yacht Club (BAYC) saw the largest 24-hour trading volumes, which edged up 2.92% to US$931,750.\n\nBut over a longer time scale the trading picture for BAYC doesn’t look so pretty, with the collection’s 30-day volume slumping 82% and the floor price falling 15% in the same period, according to NFT data tracker WGMI.io.\n\nAn NFT highlight this week is the Genkai collection of 20,000 anime-themed NFTs based on the CyberKongz NFT series. It was launched on Thursday and available on Ethereum and the Ronin blockchain operated by Sky Mavis, the Vietnam-based developer behind breakout play-to-earn title Axie Infinity.\n\nStill, the overall trading slump caused a bit of a stumble for Genkai.\n\n“The market continued to be very slow and the CyberKongz failed to mint out their full (Genkai) collection. However, they did sell out their full supply of NFTs on Ronin within an hour and so have raised roughly US$2 million,” said Yehudah Petscher, NFT Strategist at Forkast Labs.\n\n“Because of the slow sales in the Genkai collection, the team is giving free extra NFTs to those who mint, continuing a long tradition in NFTs of rewarding holders,” said Petscher.\n\nElsewhere, the U.S.-based online music store Beatport, which is known for selling music resources to DJs for remixes, launched its NFT marketplace Beatport.io on Thursday, where users can buy, sell and trade electronic music recordings as NFTs.\n\nThe Beatport NFT marketplace was developed in partnership with Germany-based Web3 startup Define Creative, and is built on Aventus, a parachain based on the Polkadot network.\n\nU.S. equity futures shrug off rate concerns\n\nImage: Getty Images\n\nU.S. stock futures traded higher as of 11:30 a.m. on Friday in Hong Kong. The three major U.S. stock indexes closed lower in regular trading the prior day, with the Dow Jones Industrial Average leading the losers with a 0.67% slide, ending its longest winning streak since 1987.\n\nIn Asia, the main stock indexes were mixed on Friday morning. China’s Shanghai Composite and Hong Kong’s Hang Seng rose, while South Korea’s Kospi and Japan’s Nikkei logged losses.\n\nU.S. gross domestic product (GDP) accelerated to 2.4% in the second quarter of the year, the Commerce Department said on Thursday. The number beat analysts’ expectation of 1.8% growth, further easing fears about a recession this year, Reuters reported on Friday.\n\nHowever, the bad news in that good news is faster GDP growth may suggest to the Federal Reserve it needs to do more policy tightening to curb inflation, according to a Bloomberg report on Thursday.\n\nHowever, the GDP report did show signs of a slowdown in price gains. The index for gross domestic purchases, an inflation gauge, rose at an annual rate of 1.9% in the second quarter, the slowest in three years.\n\nElsewhere, the Bank of Japan (BOJ) announced on Friday it will maintain its ultra-low interest rates, keeping its short-term policy interest rate target at -0.1% and the 10-year government bond yield at around 0%.\n\nBut the BOJ also announced an adjustment to its so-called yield curve control policy, saying it will allow “greater flexibility” in use of the monetary tool, a move seen by some investors as the first baby steps to the BOJ trying to normalize policy after years of an ultra-loose monetary regime to combat deflation.\n\nThe tool, known as YCC, aims to control the shape of the bond yield curve to suppress short- to medium-term rates – which affect corporate borrowers – without depressing super-long yields too much and reducing returns for pension funds and life insurers, according to the explainer by Reuters.\n\n(Adds equity section, updates introduction on BOJ, equity futures.)"
    }
]