[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wNi8xMC9iaW5hbmNlcy1uaWdlcmlhLXVuaXQtb3JkZXJlZC10by1oYWx0LWlsbGVnYWwtb3BlcmF0aW9ucy1ieS1zZWN1cml0aWVzLXdhdGNoZG9nL9IBf2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wNi8xMC9iaW5hbmNlcy1uaWdlcmlhLXVuaXQtb3JkZXJlZC10by1oYWx0LWlsbGVnYWwtb3BlcmF0aW9ucy1ieS1zZWN1cml0aWVzLXdhdGNoZG9nL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 10 Jun 2023 07:00:00 GMT",
        "title": "Binance Nigeria Ordered to Halt 'Illegal' Operations by Securities Watchdog - CoinDesk",
        "content": "Although Nigeria's SEC had previously said it viewed all crypto assets to be securities by default, this appears to be the first action taken by the regulator against a platform. In May, Bloomberg reported the SEC was processing crypto firms' applications for registration on a trial basis, but would not officially start registering them until it has reached an agreement with the country's central bank."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNi8xMC90cmFkZXItcHJlZGljdHMtZXRoZXJldW0tYmFzZWQtYWx0Y29pbi13aWxsLXBsdW1tZXQtYnktb3Zlci01MC11cGRhdGVzLW91dGxvb2stb24tYmluYW5jZS1jb2luLWFuZC1jaGFpbmxpbmsv0gGSAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA2LzEwL3RyYWRlci1wcmVkaWN0cy1ldGhlcmV1bS1iYXNlZC1hbHRjb2luLXdpbGwtcGx1bW1ldC1ieS1vdmVyLTUwLXVwZGF0ZXMtb3V0bG9vay1vbi1iaW5hbmNlLWNvaW4tYW5kLWNoYWlubGluay9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 10 Jun 2023 07:00:00 GMT",
        "title": "Trader Predicts Ethereum-Based Altcoin Will Plummet by Over 50%, Updates Outlook on Binance Coin and Chainlink - The Daily Hodl",
        "content": "A closely followed crypto strategist says that an Ethereum (ETH)-based altcoin is flashing signs of bullish exhaustion as he details his forecast for Binance Coin (BNB) and Chainlink (LINK).\n\nPseudonymous trader Altcoin Sherpa tells his 195,900 Twitter followers that the recent uptrend of the blockchain-based rendering protocol Render (RNDR) appears to be over for now.\n\nAccording to the crypto strategist, RNDR’s anemic volume over the last few weeks suggests that traders have lost interest in the project running on the Ethereum network.\n\n“RNDR: I think this one looks tired, expecting much lower prices.\n\nVery few trends are sustainable. Most will go all the way back down and very few alts outperform ETH over the long run.\n\nAm looking for shorts…\n\nYou can see the one last exhaustion push-up. I think that this one goes much lower. $1 or lower in time.”\n\nRender is trading at $2.27 at time of writing.\n\nNext up is Binance Coin (BNB), the utility token of the world’s largest crypto exchange. Altcoin Sherpa says that traders should think twice about becoming overly bearish on the fourth-largest altcoin by market cap as he says BNB is still trading within its yearly range.\n\n“BNB: I don’t see a true trend change for BNB overall. It’s still in the same range it’s been in for the last year, and I think a test around $220-250 is probably coming.\n\nI still think Binance is ok and will be the leader for the foreseeable future…\n\nI don’t think this is a good area to short. It’s a decent support area still and the EQ (equilibrium) of the entire range. Would wait for further breakdown or a move up to low $300s before shorting personally.”\n\nBNB is trading at $260 at time of writing.\n\nTurning to the decentralized oracle network Chainlink (LINK), the crypto trader says that the altcoin could ignite a short-term rally should it hit a key support level.\n\n“LINK: Expecting this to bounce around $5.50. Range lows and should be fine.\n\nThis current area is also a support level, so anywhere here to the range lows seems decent for support.”\n\nAt time of writing, LINK is trading for $5.90.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vYnVzaW5lc3Nwb3N0Lm5nL2Vjb25vbXkvc2VjLWJhbnMtYmluYW5jZS1vcGVyYXRpb25zLWluLW5pZ2VyaWEv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 10 Jun 2023 07:00:00 GMT",
        "title": "SEC Bans Binance Operations in Nigeria - Business Post Nigeria",
        "content": "By Adedapo Adesanya\n\nNigeria’s Securities and Exchange Commission has banned the operations of the world’s largest crypto exchange, Binance, in the country, declaring it an illegal entity.\n\nIn a statement signed on June 9, the commission said its attention had been drawn to the website operated by Binance Nigeria Limited, soliciting the Nigerian public to trade crypto assets on its various web and mobile-enabled platforms.\n\n“Binance Nigeria Limited is neither registered nor regulated by the commission, and its operations in Nigeria are therefore illegal. Any member of the investing public dealing with the entity is doing so at his/her own risk,” parts of the statement read.\n\nRegarding itself as “the regulator with the statutory mandate of investor protection, the commission urged Nigerians to be wary of investing in crypto-assets and crypto-asset related financial products and services if the service provider/its platform is not registered or regulated by the commission.”\n\n“Nigerian investors are hereby warned that investing in crypto-assets is extremely risky and may result in total loss of their investment.\n\n“By this circular, Binance Nigeria Limited is hereby directed to immediately stop soliciting Nigerian investors in any form whatsoever,” the SEC noted.\n\nFurther, the SEC said it would announce more measures against the company.\n\n“The commission shall provide updates on further regulatory actions with respect to the activities of Binance Nigeria Limited and other similar platforms and shall work with other regulators in Nigeria to provide further guidance on this matter.”\n\nRecall that the Central Bank of Nigeria (CBN) banned the trading of cryptocurrency through official channels in 2021.\n\nThe ban on Binance operations in Nigeria further adds to the compounding problems faced by Binance this week after the US SEC sued the crypto exchange, the operating company for Binance.US and Binance founder and CEO Changpeng “CZ” Zhao on allegations of violating federal securities laws on Monday.\n\nIt said Binance, Binance.US and Mr Zhao offered unregistered securities to the general public in the form of the BNB token and Binance-linked BUSD stablecoin, which also alleges that Binance’s staking service violated securities law.\n\nBusiness Post also understands that there are similar charges against BAM Trading – the operating company for Binance.US – and Binance itself, including failure to register as a clearing agency, failure to register as a broker and failure to register as an exchange.\n\nThe SEC also alleged that Binance allowed for the commingling of customer funds, that CZ was “secretly” controlling Binance.US and that a CZ-owned and operated entity was inflating Binance.US’s trading volume.\n\nShare this:\n\nPost\n\n\n\nLike this: Like Loading..."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYm5iLWRpc3BsYXlzLXNob3J0LXRlcm0tYnVsbGlzaC1tb21lbnR1bS1hbWlkc3QtbWFzc2l2ZS1iaW5hbmNlLW91dGZsb3dzL9IBamh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYm5iLWRpc3BsYXlzLXNob3J0LXRlcm0tYnVsbGlzaC1tb21lbnR1bS1hbWlkc3QtbWFzc2l2ZS1iaW5hbmNlLW91dGZsb3dzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 10 Jun 2023 07:00:00 GMT",
        "title": "BNB Displays Short-Term Bullish Momentum Amidst Massive Binance Outflows - NewsBTC",
        "content": "Binance finds itself entangled in a lawsuit filed by the US Securities and Exchange Commission (SEC), dealing a heavy blow to BNB, the token issued by Binance. The allegations leveled against the crypto exchange suggest its involvement in unlawful activities, specifically multiple violations of securities laws.\n\nConsequently, the impact of these allegations manifested as substantial outflows from the exchange, prompting Changpeng Zhao, the CEO, to disclose an astonishing figure of over $392 million in net outflows in the last 24 hours. It’s worth noting that Binance has dealt with significant outflows before, indicating a history of navigating such challenges.\n\nRelated Reading\n\nBleak Dogecoin (DOGE) Social Sentiment Raises Questions About Price Reversal 11 months ago\n\nAccording to our data, last 24hrs, @Binance net outflow is about $392m. Our wallet addresses are public. Some 3rd party analytics measure Change in AUM (asset under management) in USD equivalent as outflow. This would include crypto price drops (which decrease AUM) as “outflow”.… — CZ 🔶 Binance (@cz_binance) June 10, 2023\n\nMeanwhile, in the wake of the SEC filing, Nansen data indicates that Binance witnessed a staggering amount of nearly $3 billion in outflows. The aftermath of the recent lawsuit has caused BNB to plummet in value. Coingecko reports that the token has experienced a drastic decline of over 23% in just the span of a week.\n\nSource: Nansen\n\nBinance Vs. The SEC: What’s The Gist?\n\nAccording to the official SEC press release, the company and 13 other entities are being sued for the operation of an unregistered exchange and the commingling of customer funds through companies related to Binance.\n\nThe regulatory body also alleges that Binance had knowledge of the regulations regarding exchanges and securities but chose to ignore those laws, putting investor funds at risk just to maximize profits.\n\nThey also highlighted the sale of unregistered securities. The SEC targets the company’s “Simple Earn” and “BNB Vault” crypto-lending products. These products are part of Binance’s staking service and, with the recent crackdown on staking services by the SEC, are considered securities by the regulatory body.\n\nBNB market cap currently at $36.6 billion on the weekend chart: TradingView.com\n\nThe SEC also targeted Binance’s failure to restrict the exchange’s services to US citizens. Just this March, the Commodity Futures Trading Commission (CFTC) alleged that the company is breaking various financial laws including the ones intended to stop money laundering. The SEC also remarked that Binance misled customers through “strategic and targeted wash trading”.\n\nRelated Reading\n\nMATIC Faces Long-Term Struggle For Growth As SEC Claims It’s A Security 11 months ago\n\nBNB Yet To Make A Comeback\n\nSince then, BNB is the only altcoin that has not rebounded since the general market downturn. However, analysts are still somewhat bullish in the short-term capacity of the coin despite the market’s recent slippage.\n\nSource - Coingecko\n\nAt the token’s current price point of $235, BNB bulls should defend the $234 support level to target higher highs in the short term as long as no bearish news hits the market. But at the moment, it seems that the weight of the bears will defeat any attempt for a bullish breakout.\n\nHowever, if the bulls are able to defend this support level, a return to the $300 price point might be possible. Despite the optimism in the market, developments in the lawsuit will surely affect BNB in the long term.\n\nFeatured image from Protos"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LnJvbGxpbmdzdG9uZS5jb20vbXVzaWMvbXVzaWMtbmV3cy9iaW5hbmNlLWNvaW5iYXNlLXNlYy1pbnZlc3RpZ2F0aW9uLWNyeXB0by0xMjM0NzY4MjAyL9IBZ2h0dHBzOi8vd3d3LnJvbGxpbmdzdG9uZS5jb20vbXVzaWMvbXVzaWMtbmV3cy9iaW5hbmNlLWNvaW5iYXNlLXNlYy1pbnZlc3RpZ2F0aW9uLWNyeXB0by0xMjM0NzY4MjAyL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 10 Jun 2023 07:00:00 GMT",
        "title": "The Feds Are Coming for Crypto. Can It Survive? - Rolling Stone",
        "content": "The Securities and Exchange Commission filed suit on Monday against global giant Binance, the largest cryptocurrency exchange in the world. A second lawsuit came the very next day against Coinbase, the largest exchange based in the United States. After years of regulatory turf wars over an industry widely seen as the Wild West, the SEC has planted its flag in the cryptocurrency industry as firmly as ever, hoping that courts will support the agency’s opinion that the vast majority of crypto assets qualify as a type of carefully regulated financial instrument known as securities, and agree that the unregistered crypto platforms that have set up shop in the United States are flagrantly violating the laws that regulate them.\n\nBoth cases allege that the companies were illegally operating without registering with the SEC, and offered unregistered securities in the form of crypto staking: programs in which customers lock up their crypto tokens in exchange for rewards. Binance is additionally charged with engaging in unregistered securities offerings by issuing BNB, a token that the SEC alleges functions like a share in the Binance company, and BUSD, a stablecoin pegged to the US dollar. Unlike in the Coinbase suit, the Binance case also includes complaints aimed directly at the company’s CEO, Changpeng “CZ” Chao.\n\nThese are hardly the first lawsuits that the agency has used to take aim at the industry — in fact, the regulator has already brought more than a hundred cases against crypto platforms and their operators in the last decade. But they are a marked shift from the previous scattershot enforcement against crypto Ponzi schemers, one-off token issuers, and smaller platforms. By going after Binance and Coinbase, the SEC is kicking off the final boss fight, aiming to end the nose-thumbing by two of the largest companies in the sector that have brazenly ignored the agency’s repeated warnings. The SEC has had to adopt a more aggressive approach with crypto, says David Gerard, author of Attack of the 50 Foot Blockchain. “The SEC is used to the institutions under its purview taking them seriously. Crypto resents the very concept of regulation — they’ve been scofflaws by culture since bitcoin was founded.” Editor’s picks\n\nThese are hardly the first lawsuits that the agency has used to take aim at the industry — but they’re a marked shift.\n\nIt’s tough to be the buzzkill who comes in and shuts down a party when everyone’s having a good time, and the SEC seemed to know it. In 2021, the party was raging: crypto asset prices had skyrocketed, stories of overnight millionaires plastered the pages of newspapers, and companies like Crypto.com and FTX were splashing out millions of dollars on naming rights to sports stadiums and Super Bowl ads in hopes of convincing even more people to come join the mania. Entrepreneurs, venture capitalists, and lobbyists were describing crypto as the next iteration of finance, of technology, even of society — and influential people from the tech industry to Congress were buying the story. The SEC and other agencies mostly stayed out of the way.\n\nThe catastrophic implosion of the Terra project in May 2022 was among the first in a never-ending series of failures, soon followed by the crumbling of crypto hedge fund Three Arrows Capital, a linchpin of the sector whose insolvency destabilized other major firms. Through the summer, a slew of companies limited or halted withdrawals, leaving panicked customers unable to access the crypto assets they’d stored on the platforms. The bankruptcies followed, with Voyager Digital and Celsius filing within weeks of each other, followed later by BlockFi and Genesis. A once-titan of the crypto industry, Sam Bankman-Fried, swooped in and extended loans to floundering platforms. Only a few months later, his own crypto empire toppled amid allegations of fraud as it became apparent that billions in customer funds had gone missing.\n\nIt was only then that the SEC, the Commodity Futures Trading Commission, and the Department of Justice descended to belatedly clean up the mess they really should have prevented in the first place, unpopular though it might have been. Now that things have collapsed, this is an easier sell — people are expecting the bad players in the industry to be held to account. “The political will is there at last,” says Gerard. Researcher and computer scientist Nicholas Weaver describes the shift as a reaction to the sentiment that regulatory agencies failed to prevent the FTX catastrophe: “I think with the SEC… they have long had a habit of being reactive, coming in after the manure hits the whirling blades. But FTX was a big deal: billions of US persons’ [assets] lost, and it is clear from the record that if the existing rules were enforced against FTX then most US customers would be whole already.”\n\nSince the string of collapses began, the SEC has sued Terra and its CEO Do Kwon, and criminal authorities are seeking Kwon’s extradition from Montenegro to face fraud charges. The New York Attorney General filed fraud charges against Celsius CEO Alex Mashinsky. The SEC sued both the bankrupt Genesis and its close business partner Gemini. FTX executives face civil complaints from both the SEC and CFTC, which have been placed on hold pending federal criminal cases. And predating the new SEC lawsuit against Binance is one from the CFTC, which alleges violations of commodities laws as it also describes activities that sound like they would be more suited to a criminal indictment. Related\n\nIn recent months, the SEC has telegraphed that it won’t solely act reactively to crypto’s collapses, filing charges only after companies have been reduced to piles of rubble. The SEC began with actions against some of the smaller crypto companies left standing amidst the carnage of the prior year.\n\nThe outcomes of these cases are likely to shape the future of the cryptocurrency industry in the United States.\n\nHowever, the Binance complaint goes considerably beyond the one against Coinbase. While Coinbase’s CEO Brian Armstrong is not named as a defendant in the case, the Binance suit includes claims leveled directly at Zhao. That case also alleges much more serious malfeasance, including rampant wash trading, commingling of funds, material misstatements to investors, and intentionally pushing U.S.-based customers to circumvent the platform’s region-based restrictions. Like in the CFTC case, some of the behavior described in the SEC case seems criminal. “I think that the CFTC complaint and the SEC complaint evidence an egregious criminal enterprise on multiple levels,” former SEC enforcement attorney John Reed Stark tells Rolling Stone. Gerard agrees, speculating that criminal charges may have already been filed: “The CFTC complaint reeks of a shadow twin sealed indictment. The SEC complaint even more so.” Zhao has recently hired white-collar defense attorneys to represent him personally. (Both Binance and Coinbase did not respond to Rolling Stone‘s request for comment.)\n\nThe difference between the two cases is underscored by the emergency motion for a temporary restraining order against Binance that was filed by the SEC on Tuesday, which seeks to freeze assets belonging to Binance’s U.S. entities. A temporary restraining order is “the most powerful tool the SEC has,” says Stark. “It’s used sparingly,” reserved only for “really bad situation[s]” where substantial assets are deemed to be at serious risk. No such motion was filed in the Coinbase case, which also does not allege fraud or mishandling of customer funds.\n\nThe outcomes of these cases are likely to shape the future of the cryptocurrency industry in the United States, but the decisions probably aren’t coming anytime soon. For months, Coinbase has been posturing about its willingness to fight to the death against what they view as an increasingly aggressive yet opaque approach to the industry by the SEC, which Coinbase CEO Armstrong alleges is “harming America”. Binance has likewise promised to fight the SEC in court. Other legal battles between crypto firms and the SEC, such as the one involving the crypto token issuer Ripple, have dragged on for years. The industry will continue to be in limbo until then, with other unregistered platforms facing tough decisions over whether to delist the many prominent cryptocurrencies newly described by the SEC as securities, or whether to shut down crypto staking programs similar to those mentioned in the lawsuits. Meanwhile, traders have pulled more than $1.4 billion in assets out of Binance and more than $1.2 billion out of Coinbase."
    }
]