[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2NyeXB0by10YXgtd2hhdC1pbnZlc3RvcnMtbmVlZC10by1rbm93L2FydGljbGVzaG93LzEwMjAzMTQyMS5jbXPSAXdodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tdGF4LXdoYXQtaW52ZXN0b3JzLW5lZWQtdG8ta25vdy9hbXBfYXJ0aWNsZXNob3cvMTAyMDMxNDIxLmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jul 2023 07:00:00 GMT",
        "title": "Crypto Tax: What investors need to know - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nIt’s tax season, and for the first time, India’s crypto investors will be filing their taxes on gains and claiming TDS refunds, where applicable. The process will give regulators greater visibility into the fast-growing Indian crypto market, and help establish trust and transparency in the ecosystem.For a taxpayer, there are new schedules to be filled. Regular crypto traders with multiple transactions could find it all a bit overwhelming, and hence it is advisable to take the help of a qualified tax adviser. There is no substitute for a professional tax expert. Nevertheless, a few things are worth keeping in mind.The world of crypto, or Virtual Digital Assets to use the official term, has financial activities beyond just buying and selling the asset according to the market movement. There are crypto-specific activities such as staking, wherein an asset holder “locks up” their crypto in the blockchain network to support its operations and earn rewards in return. Crypto itself comes in different forms — NFT or non-fungible tokens are a type of digital asset that represents ownership of an item, be it artwork or tokenized form or a real-world asset. There are creators who mint NFT on the blockchain, often by paying a transaction fee, and there are collectors who trade them.As per the rules specified by the Indian government, gains from all such crypto transactions are taxable at a flat rate of 30%. These rules, introduced during the 2022 Union Budget, are governed by Section 115BBH of the Income Tax Act, 1961. As it stands, profits from a crypto transaction cannot be offset against losses incurred from another transaction, or even another asset. Even receiving crypto as a gift is taxable subject to the threshold prescribed under Income Tax Act, 1961.This means users should have an accurate record of all their transactions for the financial year. This is critical to calculate the capital gains or losses for each of these transactions and submit the taxes. If a user is trading on a recognized India-based platform, then he or she can access these details in the profit-and-loss report the platform provides.Besides the capital gains tax, crypto transactions are also subjected to a 1% tax deducted at source (TDS), under Section 194S of the Income Tax Act, 1961. TDS, an advance tax, establishes a transaction trail, providing regulators with an overview of the activities in the market. In the case of crypto, the TDS is applicable on all sell transactions above the threshold of Rs 10,000 in a fiscal year. This means that once a user's total transaction exceeds the value of Rs 10,000 for the financial year, all sell transactions will incur a 1% TDS. For “specified persons” this threshold is Rs 50,000.India-based crypto exchanges and platforms deduct this TDS on all applicable transactions and deposit the amount with the tax authorities on behalf of the users. These details can be found on Form 26AS as well as on the TDS certificate the platform provides to its users. Users can adjust the TDS amount against the tax liabilities when filing their returns.According to a recent statement by the Union Minister of State for Finance at Rajya Sabha, a TDS of Rs 157.9 crore has been deposited with the tax department on crypto transactions as of March 20, 2023.A point to stress here is, in case a user has been transacting peer-to-peer outside of a platform, then the onus of collecting the TDS and depositing it with the tax authorities lies with the individual. Non-payment or failure to deposit the TDS for crypto transactions will attract interest and penalty and is also punishable as per the Income Tax Law.If a taxpayer is unsure of any of these processes, it is always advisable to consult a professional. Keep in mind, the due date for filing income tax returns is July 31st."
    }
]