[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2NyeXB0b2N1cnJlbmN5LWFuYWx5dGljcy1pbnNpZ2h0L2hvdy10by1lYXJuLWZyZWUtYmluYW5jZS1jb2luLWluLTIwMjPSAXFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9hbXAvc3RvcnkvY3J5cHRvY3VycmVuY3ktYW5hbHl0aWNzLWluc2lnaHQvaG93LXRvLWVhcm4tZnJlZS1iaW5hbmNlLWNvaW4taW4tMjAyMw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "How to Earn Free Binance Coin in 2023? - Analytics Insight",
        "content": "This article shows how to earn free Binance coins in 2023 and when you get enough coins you may exchange them credit will be credited to your account as soon as feasible. The token was created with a total quantity of 200 million coins. According to the whitepaper, Binance intends to burn 50% of the total BNB supply (100 million) by reinvesting 20% of revenues each quarter."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMikQFodHRwczovL3d3dy5uZXdzMjQuY29tL25ld3MyNC9jb21tdW5pdHktbmV3c3BhcGVyL3R5Z2VyYnVyZ2VyL3dvbWVuLWNhdWdodC1hdC1iZWQtYW5kLWJyZWFrZmFzdC13aXRoLXN0b2xlbi1wcm9wZXJ0eS10by10aGUtdmFsdWUtb2YtcjFtLTIwMjMwNTE30gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Women caught at bed and breakfast with stolen property to the value of R1m - News24",
        "content": "A bed and breakfast in Parklands was in the spotlight last week after four women were arrested for being in posession of stolen property.\n\n“The women had been identified by the victim and been found in possession of property belonging to the victim,” says Table View police spokesperson Capt Adriana Chandler.\n\n“Among the stolen items identified were property not belonging to the complainant. These items included clothing, jewellery, suitcases, cell phones, electronic equipment and laptops,” Chandler says.\n\nThese items had an estimated value of over R1 million.\n\n“The complainant revealed that he was at a social establishment in Parklands one evening and met three unknown women. They all went to the complainant’s home, and whilst asleep, the women stole the property and left the following morning, without waking the complainant.”\n\nThe detective, immediately after interviewing the complainant, went to the establishment and viewed video footage.\n\nInformers were activated, and not long after, the women were traced to the bed and breakfast, where they were arrested.\n\n“The suspects aged 23, 24, 28 and 29 remained in custody until their court appearance at the Cape Town Magistrate’s Court.”\n\nThe suspects have also been linked to another three cases, where the same modus was used to commit this type of crime. The women have been charged with theft and possession of presumable stolen property.\n\nStation commander, Col Junaid Alcock has welcomed the arrest and applauded the detective for the swift investigation and apprehension of the suspects."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3QvY2Fwby10aGUtaG90dGVzdC1tZW1lLXRva2VuLXRha2luZy10aGUtZW50aXJlLWNyeXB0by1zcGFjZS1ieS1zdG9ybdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 08:16:22 GMT",
        "title": "CAPO: The Hottest Meme Token Taking the Entire Crypto Space by Storm - BSC NEWS",
        "content": "BNB\n\nIn just one week of launch on the BNB Chain, the meme token has quickly gained popularity among meme lovers and crypto enthusiasts.\n\nCAPO: Liquidating the Bears\n\nThe meme season has experienced a terrific swing in recent times, with tokens like $PEPE achieving over $1.5 billion in market capitalization and attracting listings from tier-one exchanges like Binance. The strong trend has even attracted top industry players like Tron founder Justin Sun who recently expressed his decision to actively trade meme coins via his public address.\n\nCentralized exchange Poloniex which coincidently is also owned by Sun, earlier tweet-shilled the token to Justin Sun as a comment, shattering the engagement metrics for any Poloniex tweet ever recorded on their page for a meme coin.\n\nAs the meme season continues to go on strong, CAPO has emerged as the latest meme token taking the industry by storm, leveraging the low fees and thriving community on BNB Chain. The token has made a significant impact on the BNB Chain in a short time.\n\nIn barely a week of launch, CAPO has quickly grown into the highest volume meme token on the entire BNB Chain, as well as in the top four across all chains. The meme token reached $35 million in market capitalization with over $30 million in trading volume in under three days. As of writing, the meme coin sits at a total market capitalization of $17.3 million, with over 12,000 token holders.\n\nThe success of CAPO can be attributed to the support it has received from several tier-one cryptocurrency influencers, including Davinci, Moon Carl, Evan Luthra, and Eunice Wong. These influencers have publicly endorsed the project, which has helped to increase its visibility and credibility among meme enthusiasts and the entire crypto community.\n\nAnother contributing factor is the strong community backing it. They are changing the meta in the meme space with the mantra of “making BNB Chain popular again”. This is a significant achievement, and it highlights the potential for CAPO to continue growing and thriving within the crypto community.\n\nExchange Listings\n\nAside PancakeSwap DEX, CAPO was quickly listed for free on centralized exchanges like MEXC, Poloniex, Bitget, and AscendEX - with rumors of some of the largest tier-one listings in the coming week - as user demand from its volume continues to surge.\n\nAbout CAPO\n\nCAPO is a new meme token created by “Butcher ”. What started as a troll token to a well-known counter-trading Twitter account, known as the \"IL Capo of Crypto\". The account is recognized for its bearish trading strategies, with popular comments like \"biggest bull trap I’ve ever seen\" and \"still short and strong\". Although the $CAPO token started inspired by this account, it has quickly established itself as a strong meme token with its own narrative, with serious plans to create an impact in this market.\n\nStay updated with CAPO and its developments via the following links:\n\nWebsite | Twitter | Telegram"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmJ1c2luZXNzaW5zaWRlci5jb20vY29ycG9yYXRlLWpvYi1ub3QtcmlnaHQtaW5ua2VlcGVyLWJlZC1hbmQtYnJlYWtmYXN0LWxpZmUtcXVhbGl0eS0yMDIzLTXSAWtodHRwczovL3d3dy5idXNpbmVzc2luc2lkZXIuY29tL2NvcnBvcmF0ZS1qb2Itbm90LXJpZ2h0LWlubmtlZXBlci1iZWQtYW5kLWJyZWFrZmFzdC1saWZlLXF1YWxpdHktMjAyMy01P2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Gen Zer says corporate life wasn't for her, works at inn with low rent - Business Insider",
        "content": "By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time by visiting our Preferences page or by clicking \"unsubscribe\" at the bottom of the email.\n\nCaroline Cardamone's work day typically starts with getting coffee and breakfast ready for guests or preparing to check in new guests at Thorp House Inn & Cottages in Wisconsin.\n\nCardamone, 24, is a senior innkeeper who oversees the property's rooms and cottages where guests can enjoy fireplaces and a view of the harbor. She has worked there since September 2021 and was promoted to the senior position last June. Before that, she worked at a marina as well as an orchard after graduating in 2021 and moving to Door County, Wisconsin.\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nBut these jobs weren't Cardamone's initial plans. Her career aspiration for after college was impacted by the pandemic. She's also one of the people in the labor market who realized they don't need to pursue a corporate role to be satisfied.\n\nFor instance, one person shared with Insider the story of how she left her job, where she felt burned out, and was able to work on teaching part time and launching her business. Some people have decided to leave well-paying jobs, full-time positions, or corporate life altogether as they prefer to prioritize things like caregiving duties, their own business, having work flexibility, or simply having a job or lifestyle that makes them happier.\n\nAdvertisement\n\nCardamone told Insider that she wanted a job where she could develop new skills, and her current position fit the bill.\n\n\"I've just learned so much on this job about people and interacting with people and the history of the inn,\" she said. \"Every day is exciting and new, and that's what I wanted when I first applied.\"\n\nA change of career plans meant leaving behind the pressure to conform to a corporate role\n\nCardamone studied German in college, with minors in computer science and religion, and hoped to teach English in Germany. But given lockdowns during the pandemic and not getting the chance to study abroad, she said \"my whole kind of path with German, it just felt like I was banging on a door that wouldn't open. It just didn't seem like it was going to work out.\" So, she searched for other work in the US for after college.\n\n\"I was looking for a corporate job just because that's what everybody in my life who didn't go to grad school did,\" she said.\n\nAdvertisement\n\nBut after a few interviews that were mainly in tech, she realized this isn't the kind of job she wanted.\n\nCaroline Cardamone. Courtesy of Caroline Cardamone.\n\n\"I just felt like that was not the lifestyle that was meant for me, so I wanted to reevaluate,\" she said. \"I was like, just, you need to find a job. You need to make money, but what will make you happy? What's something that you'll learn something interesting?\" she asked herself.\n\nShe started off doing seasonal work after college at a orchard and winery where she gave tours and poured wine for guests. She also worked at a marina, where her duties included putting gas into boats. She decided to remain in the area and look for a full-time gig, ending up as an innkeeper after seeing a job ad in a newspaper.\n\nRelated stories\n\n\"I wanted something where I would just still be interacting with people and that all of my days would look a little bit different,\" she said about her job search for a full-time role.\n\nAdvertisement\n\nCardamone is grateful she moved to a place where some may just vacation at or visit for a short time as a tourist.\n\n\"This morning I literally, I went to the beach and I paddle boarded for a few hours and all the people who were walking around were probably tourists who they see this view once a year and I get to live here,\" she said.\n\nShe said while it can be especially busy in the summer, there's still work-life balance in the job as she can rest or travel in the off season.\n\nInnkeeping is long hours, physical work, but 'so worth it'\n\nOne typical day as an innkeeper for her includes prepping the kitchen and getting breakfast ready with pastries and items from local businesses before breakfast is served. After talking to the guests, she will restock the guest pantry and do some housekeeping tasks. As senior innkeeper, her duties can also include making sure the other workers have what they need to do their jobs.\n\nAdvertisement\n\n\"Some days it's long hours and lots of physical work, and I'm cleaning toilets and making beds like left and right,\" she said. \"But, it's so worth it.\"\n\nCardamone has a TikTok account, with the account handle @innkeepercaroline, where she shares what it's like to be an innkeeper with her thousands of followers. In addition to day-in-the-life videos that highlight her work duties, she also talks about the personal benefits she's experienced from taking an alternate career path. For example, the text on one of Cardamone's videos reads, \"POV: you are only 24 but you chose the peaceful innkeeper at a B&B life over a corporate 9-5 hustle and are happier because of it.\"\n\nThe caption in a separate video states, \"On one of my last videos many people said they would like to be an innkeeper like this — except they would want to make more money which is 100% valid.\"\n\nShe told Insider she makes around $58,000 and part of her rent is covered, as she has employee subsidized housing.\n\nAdvertisement\n\n\"When I chose this path I knew I could still live comfortably with this job, but I did give up opportunities to make more in order to be happy,\" the caption on one of her video continues. \"For me it came down to what lifestyle I valued more.\"\n\nNo matter the kind of job someone works, Cardamone thinks happiness should be the priority\n\n\"I am aware that there are some people who they do like a 9 to 5. They do want an office job,\" she said. \"That's what they thrive on and that's what makes them happy.\"\n\n\"But what I'm trying to talk about, on my page is just, you should focus on what makes you happy,\" she said about her TikTok videos. \"You should choose a career that makes you happy. You should value that over just what other people around you are doing or what people have been putting pressure on you to do.\"\n\nShe said for her, \"I was trying so hard to force myself into that mold\" of a 9-to-5 job or an office role \"because that is just what I saw was available to me.\"\n\nAdvertisement\n\n\"But I want people to know, especially people who are graduating, that there are so many other things you can do and you can do those things and you can still live a good lifestyle,\" she said.\n\nAre you a Gen Zer or recent graduate who found a job outside of a 9-to-5 corporate job? Are you a worker that left a corporate job? Reach out to this reporter at mhoff@businessinsider.com."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmJ1c2luZXNzaW5zaWRlci5jb20vY29ycG9yYXRlLWpvYi1ub3QtcmlnaHQtaW5ua2VlcGVyLWJlZC1hbmQtYnJlYWtmYXN0LWxpZmUtcXVhbGl0eS0yMDIzLTXSAWtodHRwczovL3d3dy5idXNpbmVzc2luc2lkZXIuY29tL2NvcnBvcmF0ZS1qb2Itbm90LXJpZ2h0LWlubmtlZXBlci1iZWQtYW5kLWJyZWFrZmFzdC1saWZlLXF1YWxpdHktMjAyMy01P2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Gen Zer says corporate life wasn't for her, works at inn with low rent - Business Insider",
        "content": "By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time by visiting our Preferences page or by clicking \"unsubscribe\" at the bottom of the email.\n\nCaroline Cardamone's work day typically starts with getting coffee and breakfast ready for guests or preparing to check in new guests at Thorp House Inn & Cottages in Wisconsin.\n\nCardamone, 24, is a senior innkeeper who oversees the property's rooms and cottages where guests can enjoy fireplaces and a view of the harbor. She has worked there since September 2021 and was promoted to the senior position last June. Before that, she worked at a marina as well as an orchard after graduating in 2021 and moving to Door County, Wisconsin.\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nBut these jobs weren't Cardamone's initial plans. Her career aspiration for after college was impacted by the pandemic. She's also one of the people in the labor market who realized they don't need to pursue a corporate role to be satisfied.\n\nFor instance, one person shared with Insider the story of how she left her job, where she felt burned out, and was able to work on teaching part time and launching her business. Some people have decided to leave well-paying jobs, full-time positions, or corporate life altogether as they prefer to prioritize things like caregiving duties, their own business, having work flexibility, or simply having a job or lifestyle that makes them happier.\n\nAdvertisement\n\nCardamone told Insider that she wanted a job where she could develop new skills, and her current position fit the bill.\n\n\"I've just learned so much on this job about people and interacting with people and the history of the inn,\" she said. \"Every day is exciting and new, and that's what I wanted when I first applied.\"\n\nA change of career plans meant leaving behind the pressure to conform to a corporate role\n\nCardamone studied German in college, with minors in computer science and religion, and hoped to teach English in Germany. But given lockdowns during the pandemic and not getting the chance to study abroad, she said \"my whole kind of path with German, it just felt like I was banging on a door that wouldn't open. It just didn't seem like it was going to work out.\" So, she searched for other work in the US for after college.\n\n\"I was looking for a corporate job just because that's what everybody in my life who didn't go to grad school did,\" she said.\n\nAdvertisement\n\nBut after a few interviews that were mainly in tech, she realized this isn't the kind of job she wanted.\n\nCaroline Cardamone. Courtesy of Caroline Cardamone.\n\n\"I just felt like that was not the lifestyle that was meant for me, so I wanted to reevaluate,\" she said. \"I was like, just, you need to find a job. You need to make money, but what will make you happy? What's something that you'll learn something interesting?\" she asked herself.\n\nShe started off doing seasonal work after college at a orchard and winery where she gave tours and poured wine for guests. She also worked at a marina, where her duties included putting gas into boats. She decided to remain in the area and look for a full-time gig, ending up as an innkeeper after seeing a job ad in a newspaper.\n\nRelated stories\n\n\"I wanted something where I would just still be interacting with people and that all of my days would look a little bit different,\" she said about her job search for a full-time role.\n\nAdvertisement\n\nCardamone is grateful she moved to a place where some may just vacation at or visit for a short time as a tourist.\n\n\"This morning I literally, I went to the beach and I paddle boarded for a few hours and all the people who were walking around were probably tourists who they see this view once a year and I get to live here,\" she said.\n\nShe said while it can be especially busy in the summer, there's still work-life balance in the job as she can rest or travel in the off season.\n\nInnkeeping is long hours, physical work, but 'so worth it'\n\nOne typical day as an innkeeper for her includes prepping the kitchen and getting breakfast ready with pastries and items from local businesses before breakfast is served. After talking to the guests, she will restock the guest pantry and do some housekeeping tasks. As senior innkeeper, her duties can also include making sure the other workers have what they need to do their jobs.\n\nAdvertisement\n\n\"Some days it's long hours and lots of physical work, and I'm cleaning toilets and making beds like left and right,\" she said. \"But, it's so worth it.\"\n\nCardamone has a TikTok account, with the account handle @innkeepercaroline, where she shares what it's like to be an innkeeper with her thousands of followers. In addition to day-in-the-life videos that highlight her work duties, she also talks about the personal benefits she's experienced from taking an alternate career path. For example, the text on one of Cardamone's videos reads, \"POV: you are only 24 but you chose the peaceful innkeeper at a B&B life over a corporate 9-5 hustle and are happier because of it.\"\n\nThe caption in a separate video states, \"On one of my last videos many people said they would like to be an innkeeper like this — except they would want to make more money which is 100% valid.\"\n\nShe told Insider she makes around $58,000 and part of her rent is covered, as she has employee subsidized housing.\n\nAdvertisement\n\n\"When I chose this path I knew I could still live comfortably with this job, but I did give up opportunities to make more in order to be happy,\" the caption on one of her video continues. \"For me it came down to what lifestyle I valued more.\"\n\nNo matter the kind of job someone works, Cardamone thinks happiness should be the priority\n\n\"I am aware that there are some people who they do like a 9 to 5. They do want an office job,\" she said. \"That's what they thrive on and that's what makes them happy.\"\n\n\"But what I'm trying to talk about, on my page is just, you should focus on what makes you happy,\" she said about her TikTok videos. \"You should choose a career that makes you happy. You should value that over just what other people around you are doing or what people have been putting pressure on you to do.\"\n\nShe said for her, \"I was trying so hard to force myself into that mold\" of a 9-to-5 job or an office role \"because that is just what I saw was available to me.\"\n\nAdvertisement\n\n\"But I want people to know, especially people who are graduating, that there are so many other things you can do and you can do those things and you can still live a good lifestyle,\" she said.\n\nAre you a Gen Zer or recent graduate who found a job outside of a 9-to-5 corporate job? Are you a worker that left a corporate job? Reach out to this reporter at mhoff@businessinsider.com."
    }
]