[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMilQFodHRwczovL3d3dy5ibG9ja2NoYWluLWNvdW5jaWwub3JnL25ld3MvYm13LXRvLXVzZS10d28tcGhhc2UtdGVjaC1pbnRlZ3JhdGlvbi1mb3ItaXRzLWJsb2NrY2hhaW4tbG95YWx0eS1wcm9ncmFtLXBhcnRuZXJzLXdpdGgtYm5iLWNoYWluLWFuZC1jb2lud2ViL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 02 Jan 2023 08:00:00 GMT",
        "title": "BMW to use Two-Phase Tech Integration for its Blockchain Loyalty Program, Partners with BNB Chain and Coinweb - Blockchain Council",
        "content": "BMW to use Two-Phase Tech Integration for its Blockchain Loyalty Program, Partners with BNB Chain and Coinweb\n\nBlockchain Council\n\nIn a move towards increased transparency and permanence, the German luxury car maker BMW has partnered with Coinweb, a layer-2 cross-chain computation platform, to leverage Blockchain technology for its financial infrastructure. Leveraging Binance’s BNB Chain due to its low cost and fast transaction speed, BMW’s Thailand operations will be the first to execute the initial phase of the transition. This move signals a commitment to modernizing financial infrastructure and increasing trust through Blockchain technology.\n\nPurchasers of BMWs in Thailand will be able to access a platform designed by Coinweb, where they can securely store their KYC details and apply for financing per the nation’s laws. This platform aims to provide buyers with a simplified and irreversible process for purchasing their desired vehicle.\n\nCEO Bjorn Antonsson of BMW Leasing’s Thailand branch stated, “We anticipate this transition from manual paperwork to immutable records on the blockchain will greatly help unassailable productivity and transparency.”\n\nAs part of the initiative, BMW has undertaken a two-pronged approach to streamline customer-company interactions. The first step involves developing a comprehensive roadmap to explore the potential of cross-chain smart contracts, allowing for faster, more efficient transactions. This forward-thinking approach to customer service is set to revolutionize the automotive industry.\n\nDuring the second phase, Coinweb will create a unique Web3 service to create a blockchain-based loyalty program for Thailand’s customers. Customers may also receive exclusive discounts and services by earning rewards through this program.\n\nAlso read: Why is Web3 Ideal for Brand Building in 2023?\n\nCommenting upon the partnership, Coinweb CEO Toby Gilbert expressed enthusiasm and noted that this collaboration exemplifies the potential of Blockchain technology to revolutionize traditional businesses. He expressed confidence that it could be a model for others to follow, showing how to leverage the technology without compromising its core values and mission.\n\nAs Blockchain’s popularity continues to soar, several influential global organizations have embraced it. On December 14, Italy made history as the first EU nation to officially integrate Blockchain into its financial and insurance systems, with a partnership with Algorand Blockchain to create a digital guarantees platform for issuing bank and insurance guarantees. Furthermore, Maharashtra in India has recently decided to leverage the Algorand Blockchain to store and protect health data as Non-Fungible Tokens (NFTs).\n\nNews Source: CoinTelegraph\n\nIf you want to keep up with the Blockchain industry trends, join our communities on Discord, Reddit and Telegram."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiKmh0dHBzOi8vdHJvbnNwYXJrLmNvbS9iaW5hbmNlcGVnYnVzZC10cm9uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 02 Jan 2023 08:00:00 GMT",
        "title": "Binance: Binance-Peg BUSD Now Available on TRON - Tron Spark",
        "content": "Binance, the world’s largest cryptocurrency exchange completed the integration of the Binance-Peg BUSD on the TRON Network last weekend.\n\nThe integration into the TRON blockchain allows users to deposit and do withdrawals of the Binance-Peg BUSD, at the same time users would be able to transfer the said stablecoin across Ethereum, BNB Chain, Avalanche, Polygon, and TRON blockchains.\n\nBinance-Peg BUSD is a wrapped version of the BUSD.\n\nWhat is BUSD?\n\nThe Binance-Peg BUSD is a wrapped version of the BUSD stablecoin and it is a separate product from the BUSD stablecoin that was issued by Paxos.\n\nAs mentioned on their blog, Binance independently mints Binance-Peg BUSD on several blockchains and pegs the tokens to BUSD on a one-to-one basis.\n\nBinance-Peg BUSD is available on several blockchains such as Ethereum, BNB Chain, Avalanche, Polygon, and TRON.\n\nWhat is Binance?\n\nBinance is the largest cryptocurrency exchange in the world and it was founded by Changpeng Zhao, also known as CZ who is a trading software developer and he had been leading the exchange since July 2017.\n\nThe exchange provides its users with over 500 cryptocurrencies for trading, a massive selection of transaction types and they are one of the cheapest crypto trading platforms available in the market.\n\nBinance also provides options to traders when it comes to digital currency trading which is the basic and advanced views. The only difference between the two is that the advanced one offers a more in-depth technical analysis of digital currency value over time.\n\nBinance has its very own Binance Coin (BNB) which is their native crypto coin that powers the Binance ecosystem that can be used to pay for goods and services, settle transaction fees on Binance Smart Chain, participate in exclusive token sales, and more.\n\nBinance has a US-based exchange called Binance.US which was created to comply with the regulations within the United States and create a separate exchange for US customers.\n\nFor more news and updates, see Tron Spark."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vc29maWFnbG9iZS5jb20vMjAyMy8wMS8wMi9idWxnYXJpYS10by13aXRoZHJhdy0yMDA1LWlzc3VlLTIwLWxldmEtYmFua25vdGUtZnJvbS1jaXJjdWxhdGlvbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 02 Jan 2023 08:00:00 GMT",
        "title": "Bulgaria to withdraw 2005-issue 20 leva banknote from circulation - The Sofia Globe",
        "content": "The governing council of central Bulgarian National Bank (BNB) has decided to take out of circulation the banknotes of 20 leva denomination, issue 2005, which will cease to be legal tender as of February 1 2023.\n\nAs of that date, 20 leva banknotes, issue 2005, will be exchanged at the counters of the BNB at their face value, without any limit to the amount, free of charge, and without any deadline for the exchange, the central bank said.\n\n(Photo: BNB)"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMilQFodHRwczovL3d3dy5ibG9ja2NoYWluLWNvdW5jaWwub3JnL25ld3MvYm13LXRvLXVzZS10d28tcGhhc2UtdGVjaC1pbnRlZ3JhdGlvbi1mb3ItaXRzLWJsb2NrY2hhaW4tbG95YWx0eS1wcm9ncmFtLXBhcnRuZXJzLXdpdGgtYm5iLWNoYWluLWFuZC1jb2lud2ViL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 02 Jan 2023 08:00:00 GMT",
        "title": "BMW to use Two-Phase Tech Integration for its Blockchain Loyalty Program, Partners with BNB Chain and Coinweb - Blockchain Council",
        "content": "BMW to use Two-Phase Tech Integration for its Blockchain Loyalty Program, Partners with BNB Chain and Coinweb\n\nBlockchain Council\n\nIn a move towards increased transparency and permanence, the German luxury car maker BMW has partnered with Coinweb, a layer-2 cross-chain computation platform, to leverage Blockchain technology for its financial infrastructure. Leveraging Binance’s BNB Chain due to its low cost and fast transaction speed, BMW’s Thailand operations will be the first to execute the initial phase of the transition. This move signals a commitment to modernizing financial infrastructure and increasing trust through Blockchain technology.\n\nPurchasers of BMWs in Thailand will be able to access a platform designed by Coinweb, where they can securely store their KYC details and apply for financing per the nation’s laws. This platform aims to provide buyers with a simplified and irreversible process for purchasing their desired vehicle.\n\nCEO Bjorn Antonsson of BMW Leasing’s Thailand branch stated, “We anticipate this transition from manual paperwork to immutable records on the blockchain will greatly help unassailable productivity and transparency.”\n\nAs part of the initiative, BMW has undertaken a two-pronged approach to streamline customer-company interactions. The first step involves developing a comprehensive roadmap to explore the potential of cross-chain smart contracts, allowing for faster, more efficient transactions. This forward-thinking approach to customer service is set to revolutionize the automotive industry.\n\nDuring the second phase, Coinweb will create a unique Web3 service to create a blockchain-based loyalty program for Thailand’s customers. Customers may also receive exclusive discounts and services by earning rewards through this program.\n\nAlso read: Why is Web3 Ideal for Brand Building in 2023?\n\nCommenting upon the partnership, Coinweb CEO Toby Gilbert expressed enthusiasm and noted that this collaboration exemplifies the potential of Blockchain technology to revolutionize traditional businesses. He expressed confidence that it could be a model for others to follow, showing how to leverage the technology without compromising its core values and mission.\n\nAs Blockchain’s popularity continues to soar, several influential global organizations have embraced it. On December 14, Italy made history as the first EU nation to officially integrate Blockchain into its financial and insurance systems, with a partnership with Algorand Blockchain to create a digital guarantees platform for issuing bank and insurance guarantees. Furthermore, Maharashtra in India has recently decided to leverage the Algorand Blockchain to store and protect health data as Non-Fungible Tokens (NFTs).\n\nNews Source: CoinTelegraph\n\nIf you want to keep up with the Blockchain industry trends, join our communities on Discord, Reddit and Telegram."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vc29maWFnbG9iZS5jb20vMjAyMy8wMS8wMi9idWxnYXJpYS10by13aXRoZHJhdy0yMDA1LWlzc3VlLTIwLWxldmEtYmFua25vdGUtZnJvbS1jaXJjdWxhdGlvbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 02 Jan 2023 08:00:00 GMT",
        "title": "Bulgaria to withdraw 2005-issue 20 leva banknote from circulation - The Sofia Globe",
        "content": "The governing council of central Bulgarian National Bank (BNB) has decided to take out of circulation the banknotes of 20 leva denomination, issue 2005, which will cease to be legal tender as of February 1 2023.\n\nAs of that date, 20 leva banknotes, issue 2005, will be exchanged at the counters of the BNB at their face value, without any limit to the amount, free of charge, and without any deadline for the exchange, the central bank said.\n\n(Photo: BNB)"
    }
]