[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wNy8wNy9iaW5hbmNlLWZlZWxzLXN0cmFpbi1vZi13b3JsZHMtcmVndWxhdG9ycy1sZWFwaW5nLWludG8tYWN0aW9uL9IBbWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wNy8wNy9iaW5hbmNlLWZlZWxzLXN0cmFpbi1vZi13b3JsZHMtcmVndWxhdG9ycy1sZWFwaW5nLWludG8tYWN0aW9uL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Binance Feels Strain of World’s Regulators Leaping Into Action - CoinDesk",
        "content": "The exchange had operated for years without serious regulatory intervention, but the arrival of some of those cases has pushed the company onto its heels. In the last month since the U.S. Securities and Exchange Commission aimed a shotgun blast of charges at Binance and CEO Changpeng “CZ” Zhao, the company has seen substantial customer withdrawals and watched its native BNB token slip 17%. The U.S. Commodity Futures Trading Commission had made similar accusations against Binance earlier in the year, alleging the company deliberately evaded government oversight."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wNy8wNy9iaW5hbmNlLWZlZWxzLXN0cmFpbi1vZi13b3JsZHMtcmVndWxhdG9ycy1sZWFwaW5nLWludG8tYWN0aW9uL9IBbWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wNy8wNy9iaW5hbmNlLWZlZWxzLXN0cmFpbi1vZi13b3JsZHMtcmVndWxhdG9ycy1sZWFwaW5nLWludG8tYWN0aW9uL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Binance Feels Strain of World’s Regulators Leaping Into Action - CoinDesk",
        "content": "The exchange had operated for years without serious regulatory intervention, but the arrival of some of those cases has pushed the company onto its heels. In the last month since the U.S. Securities and Exchange Commission aimed a shotgun blast of charges at Binance and CEO Changpeng “CZ” Zhao, the company has seen substantial customer withdrawals and watched its native BNB token slip 17%. The U.S. Commodity Futures Trading Commission had made similar accusations against Binance earlier in the year, alleging the company deliberately evaded government oversight."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3QvYmFieWRvZ2UtbGF1bmNoZXMtbXVsdGktY2hhaW4tdG9rZW4tbG9ja2Vy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "BabyDoge Launches Multi-Chain Token Locker - BSC NEWS",
        "content": "BNB\n\nBabyDoge expands its services with a multi-chain token locker, now supporting Polygon and Ethereum in addition to BNB Chain—increased adoption expected in the DeFi industry.\n\nMulti-Chain Token Locker Goes Live\n\nBabyDoge, the popular cryptocurrency project, has taken a significant step forward with the launch of its multi-chain token locker.\n\nInitially operating on the BNB Chain, Baby Doge Swap DEX has expanded its services to include the Polygon and Ethereum blockchains. This expansion allows protocols across these chains to lock their tokens on the platform securely.\n\nThe introduction of multi-chain support marks a notable milestone for BabyDoge. In March, BSC News reported the protocol's achievement of surpassing $10 million in Total Value Locked (TVL) on the BNB Chain. With the integration of Polygon and Ethereum, the platform aims to attract even more users and increase its TVL as it seeks broader adoption within the rapidly growing Decentralized Finance (DeFi) industry.\n\nCurrently, the TVL on the Ethereum chain has crossed the $800K mark, indicating a strong start for BabyDoge's multi-chain expansion. By offering a secure and efficient token-locking solution, the platform enhances the confidence of protocols in the DeFi space, ensuring the safety and integrity of their assets across multiple blockchain networks.\n\nExpanding beyond BNB Chain demonstrates BabyDoge's commitment to providing a versatile and inclusive ecosystem for DeFi participants. By leveraging the capabilities of Polygon and Ethereum, BabyDoge aims to tap into the diverse user bases and thriving DeFi communities on these networks.\n\nAs BabyDoge continues to expand its presence across different blockchains, it positions itself as a significant player in the DeFi industry. With a growing TVL and increased adoption, the project is poised to contribute to the evolution and mainstream acceptance of decentralized finance, offering users more options and opportunities in the ever-expanding cryptocurrency world.\n\nWhat is Baby Doge Swap:\n\nBaby Doge Swap is the acclaimed “son” of the popular meme token, DOGE. Baby Doge Swap started out as Baby Doge Coin and is a hyper-deflationary system that progressively increases its scarcity and increases its liquidity. The project is now a fully Decentralized Exchange with swaps, liquidity pools, yield farming, and more. Baby Doge considers its primary utility as building a fun meme community to spread awareness of animal adoption.\n\nWhere to find Baby Doge Swap:\n\nWebsite | Twitter | Telegram | Reddit | Swap |\n\n‍"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3QvYmFieWRvZ2UtbGF1bmNoZXMtbXVsdGktY2hhaW4tdG9rZW4tbG9ja2Vy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "BabyDoge Launches Multi-Chain Token Locker - BSC NEWS",
        "content": "BNB\n\nBabyDoge expands its services with a multi-chain token locker, now supporting Polygon and Ethereum in addition to BNB Chain—increased adoption expected in the DeFi industry.\n\nMulti-Chain Token Locker Goes Live\n\nBabyDoge, the popular cryptocurrency project, has taken a significant step forward with the launch of its multi-chain token locker.\n\nInitially operating on the BNB Chain, Baby Doge Swap DEX has expanded its services to include the Polygon and Ethereum blockchains. This expansion allows protocols across these chains to lock their tokens on the platform securely.\n\nThe introduction of multi-chain support marks a notable milestone for BabyDoge. In March, BSC News reported the protocol's achievement of surpassing $10 million in Total Value Locked (TVL) on the BNB Chain. With the integration of Polygon and Ethereum, the platform aims to attract even more users and increase its TVL as it seeks broader adoption within the rapidly growing Decentralized Finance (DeFi) industry.\n\nCurrently, the TVL on the Ethereum chain has crossed the $800K mark, indicating a strong start for BabyDoge's multi-chain expansion. By offering a secure and efficient token-locking solution, the platform enhances the confidence of protocols in the DeFi space, ensuring the safety and integrity of their assets across multiple blockchain networks.\n\nExpanding beyond BNB Chain demonstrates BabyDoge's commitment to providing a versatile and inclusive ecosystem for DeFi participants. By leveraging the capabilities of Polygon and Ethereum, BabyDoge aims to tap into the diverse user bases and thriving DeFi communities on these networks.\n\nAs BabyDoge continues to expand its presence across different blockchains, it positions itself as a significant player in the DeFi industry. With a growing TVL and increased adoption, the project is poised to contribute to the evolution and mainstream acceptance of decentralized finance, offering users more options and opportunities in the ever-expanding cryptocurrency world.\n\nWhat is Baby Doge Swap:\n\nBaby Doge Swap is the acclaimed “son” of the popular meme token, DOGE. Baby Doge Swap started out as Baby Doge Coin and is a hyper-deflationary system that progressively increases its scarcity and increases its liquidity. The project is now a fully Decentralized Exchange with swaps, liquidity pools, yield farming, and more. Baby Doge considers its primary utility as building a fun meme community to spread awareness of animal adoption.\n\nWhere to find Baby Doge Swap:\n\nWebsite | Twitter | Telegram | Reddit | Swap |\n\n‍"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8venljcnlwdG8uY29tL3hycC1pcy1ub3QtYS1zZWN1cml0eS1wcm8tY3J5cHRvLWxhd3llci1oaW50cy1hdC1odWdlLXVucmF2ZWxpbmctaW4tcmlwcGxlLXZzLXNlYy1jYXNlL9IBcGh0dHBzOi8venljcnlwdG8uY29tL3hycC1pcy1ub3QtYS1zZWN1cml0eS1wcm8tY3J5cHRvLWxhd3llci1oaW50cy1hdC1odWdlLXVucmF2ZWxpbmctaW4tcmlwcGxlLXZzLXNlYy1jYXNlLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "XRP Is Not A Security? Pro-Crypto Lawyer Hints At Huge Unraveling In Ripple vs SEC Case - ZyCrypto",
        "content": "Advertisement\n\nOutspoken pro-Ripple lawyer John Deaton has expressed optimism regarding the SEC vs Ripple lawsuit, predicting that Judge Torres will thoroughly address the core question of whether XRP is a security in her upcoming summary judgment.\n\nIn a Twitter thread on Monday, Deaton firmly asserted that “XRP IS NOT A SECURITY.” He then established parallels between XRP and diverse assets like orange groves, whiskey, condos, and even Bitcoin (BTC). Deaton’s argument centred on the notion that despite these assets being marketed and sold as investment contracts, their inherent characteristics remained unaltered.\n\n“BTC was once sold as an investment contract (SEC v. Shavers), but that particular sale didn’t transform BTC into anything other than what it is: a digital commodity,” he stated.\n\nFurther, contrary to the belief of many experienced lawyers, Deaton asserted that Judge Torres would not shy away from addressing the issue of secondary sales concerning XRP.\n\n“I believe Judge Torres has to address the underlying asset and secondary market sales. Could she avoid the issues and issue a ruling? Of course she could. But it would be a greater act of judicial activism to ignore the SEC’s theory and NOT address these issues,” he said.\n\nAdvertisement\n\nTo support his argument, Deaton referred to a similar case handled by Judge Castel in 2020 involving the Telegram messaging app. This legal dispute began when the SEC intervened and halted Telegram’s intended distribution of GRAM tokens. However, Judge Castel ruled in favour of the SEC, stating that Telegram had to repay investors $1.2 billion from their unsuccessful initial coin offering (ICO) for the Telegram Open Network.\n\nIt is important to remember that the theory posited by the SEC was that Ripple engaged in continuous activity resembling an ICO, considering each sale of XRP as part of a broader plan involving securities. However, Deaton clarified that the situation with XRP differed from the Telegram case because the latter involved an ICO with written contracts.\n\nDeaton further contended that XRP, powered by the XRP Ledger (XRPL) technology, had been operating effectively and openly traded for over seven years. Notably, even SEC staff members were permitted to own XRP until 2019, which was not the case with the Gram token.\n\nThe issue of secondary market transactions of XRP has been a crucial aspect in the SEC and Ripple legal battle. While the SEC accused Ripple of offering XRP as an unregistered security, it did not clearly distinguish between Ripple’s direct sales and the subsequent trading on the secondary market, leading to confusion. Recently, Deaton opined that Judge Torres might address this issue based on a previous examination in the SEC vs LBRY lawsuit, as it sheds more light on the issue.\n\nThat said, while there’s no guarantee, Judge Torres’ summary judgment decision could shed light on XRP’s security classification, potentially impacting the crypto industry significantly."
    }
]