[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvYmluYW5jZS1jb2luLXByaWNlLXByZWRpY3Rpb24tYm5iLXByaWNlLXBvaXNlZC1mb3ItOC1kcm9wLWJ1dC10aGVyZS1jYXRjaC_SAWtodHRwczovL2NvaW5nYXBlLmNvbS9tYXJrZXRzL2JpbmFuY2UtY29pbi1wcmljZS1wcmVkaWN0aW9uLWJuYi1wcmljZS1wb2lzZWQtZm9yLTgtZHJvcC1idXQtdGhlcmUtY2F0Y2gvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Apr 2023 07:00:00 GMT",
        "title": "Binance Coin Price Prediction: BNB Price Poised for an 8% Drop this Week; But there is a Catch - CoinGape",
        "content": "Binance Coin Price Prediction: The Binance coin price is currently responding to two chart patterns in the daily time frame chart. For its overall sideways trendline, the coin price is following a symmetrical triangle(marked in blue). However, for the ongoing recovery within this triangle structure, the prices respect a rising wedge pattern(marked in yellow). Here’s how these patterns will further influence the BNB price for near-future growth.\n\nKey points:\n\nA symmetrical triangle pattern is a continuation pattern whose breakout from either of its trendline will bolster the future price movement\n\nA rising wedge pattern maintains a strong recovery within two rising trendlines until the lower one breaks.\n\nThe intraday trading volume in the BNB coin is $797.4 Million, indicating a 7% loss\n\nSource- Tradingview\n\nadvertisement\n\nOn April 16th, the BNB price turned down from the confluence point for two resistance trendlines mentioned above. With the increasing selling pressure in the market, the coin price tumbled 7% in the last three days and is currently trading at $325.3.\n\nWith sustained selling the coin price is likely to tumble 8% where it will hit the support trendline of the wedge pattern. Now until this pattern is intact, the ongoing recovery cycle within the triangle will remain intact and may encourage buyers to breach the symmetrical triangle resistance trendline.\n\nAlso Read: 15 New Cryptocurrencies To Buy In 2023\n\nA potential bullish breakout from the triangle’s resistance trendline will signal an early sign of an upcoming bull rally.\n\nOn the contrary, note, if the falling prices breached the wedge pattern support trendline, the BNB coin may witness further correction to the triangle pattern’s support trendline. Thus, the wedge pattern breakdown will thus prolong the long coming sideways trend,\n\nTechnical Indicators\n\nEMAs: The 200 EMA of the weekly chart maintains an overall bullish trend for BNB price.\n\nRelative strength index: The weekly RSI slope making new higher highs despite a sideways price action indicates the underlying buying pressure is growing which may increase the possibility of the triangle pattern breakout.\n\nSpot rate: $325\n\nTrend: Bearish\n\nVolatility: Medium\n\nResistance level- $325 and $360\n\nSupport level- $300 ad $283"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvYmluYW5jZS1jb2luLXByaWNlLXByZWRpY3Rpb24tYm5iLXByaWNlLXBvaXNlZC1mb3ItOC1kcm9wLWJ1dC10aGVyZS1jYXRjaC_SAWtodHRwczovL2NvaW5nYXBlLmNvbS9tYXJrZXRzL2JpbmFuY2UtY29pbi1wcmljZS1wcmVkaWN0aW9uLWJuYi1wcmljZS1wb2lzZWQtZm9yLTgtZHJvcC1idXQtdGhlcmUtY2F0Y2gvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Apr 2023 07:00:00 GMT",
        "title": "Binance Coin Price Prediction: BNB Price Poised for an 8% Drop this Week; But there is a Catch - CoinGape",
        "content": "Binance Coin Price Prediction: The Binance coin price is currently responding to two chart patterns in the daily time frame chart. For its overall sideways trendline, the coin price is following a symmetrical triangle(marked in blue). However, for the ongoing recovery within this triangle structure, the prices respect a rising wedge pattern(marked in yellow). Here’s how these patterns will further influence the BNB price for near-future growth.\n\nKey points:\n\nA symmetrical triangle pattern is a continuation pattern whose breakout from either of its trendline will bolster the future price movement\n\nA rising wedge pattern maintains a strong recovery within two rising trendlines until the lower one breaks.\n\nThe intraday trading volume in the BNB coin is $797.4 Million, indicating a 7% loss\n\nSource- Tradingview\n\nadvertisement\n\nOn April 16th, the BNB price turned down from the confluence point for two resistance trendlines mentioned above. With the increasing selling pressure in the market, the coin price tumbled 7% in the last three days and is currently trading at $325.3.\n\nWith sustained selling the coin price is likely to tumble 8% where it will hit the support trendline of the wedge pattern. Now until this pattern is intact, the ongoing recovery cycle within the triangle will remain intact and may encourage buyers to breach the symmetrical triangle resistance trendline.\n\nAlso Read: 15 New Cryptocurrencies To Buy In 2023\n\nA potential bullish breakout from the triangle’s resistance trendline will signal an early sign of an upcoming bull rally.\n\nOn the contrary, note, if the falling prices breached the wedge pattern support trendline, the BNB coin may witness further correction to the triangle pattern’s support trendline. Thus, the wedge pattern breakdown will thus prolong the long coming sideways trend,\n\nTechnical Indicators\n\nEMAs: The 200 EMA of the weekly chart maintains an overall bullish trend for BNB price.\n\nRelative strength index: The weekly RSI slope making new higher highs despite a sideways price action indicates the underlying buying pressure is growing which may increase the possibility of the triangle pattern breakout.\n\nSpot rate: $325\n\nTrend: Bearish\n\nVolatility: Medium\n\nResistance level- $325 and $360\n\nSupport level- $300 ad $283"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3Lm9ubHlpbnlvdXJzdGF0ZS5jb20vYXJrYW5zYXMvaGlkZGVuLWhlYXZlbmx5LWFjY29tbW9kYXRpb24tYXIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Apr 2023 07:00:00 GMT",
        "title": "Charming B&B In Arkansas: Country Oaks Bed and Breakfast - Only In Your State",
        "content": "As local travel experts, we know what travelers are looking for when it comes to finding the perfect accommodations for their next trip. To compile our lists, we scour the internet to find properties with excellent ratings and reviews, desirable amenities, nearby attractions, and that something special that makes a destination worthy of traveling for.\n\nPeace and serenity await at the Country Oaks Bed and Breakfast in the Ozarks. This delightful haven features a beautiful Carriage House situated on a 70-acre pasture nestled in the gorgeous countryside. Escape to this charming bed and breakfast in Mountain View, Arkansas, where you can marvel at picturesque lake views or relax on the porch and allow the day to unfold in the most heavenly way. You’ll want to make this hidden gem bed and breakfast your next peaceful getaway. Read more about the property below and you’ll be packing your bags in excited anticipation before you know it.\n\nAre you ready to escape to this heavenly B&B for a peaceful getaway? If so, visit the Country Oaks Bed & Breakfast website to secure your reservations. Have you already enjoyed this incredible hotel? What was your favorite part? Let us know in the comments below, we love to hear your firsthand accounts of these unique experiences.\n\nWhile you’re in Mountain View, be sure to check out this charming general store that will take you back in time.\n\nWant more Arkansas in your inbox? Get the latest on things to see, do, and eat around Arkansas! spinner Thank you! You'll receive your first newsletter soon! An error occured. Subscribe\n\nMore to Explore Best Hotels In Arkansas Where are the best hotels in Arkansas? You’ll definitely want to stay at this property but there are plenty of other incredible hotels in Arkansas to explore during your journey. Whether you like a quaint B&B or a luxury experience, there’s something for every taste. 21c Museum Hotel Bentonville\n\nBeckham Creek Cave Lodge\n\nDoubleTree by Hilton Hot Springs\n\nEmbassy Suites Northwest Arkansas\n\nCapital Hotel\n\nLookout Point Lakeside Inn\n\n1886 Crescent Hotel & Spa\n\nThe Reserve at Hot Springs\n\nInn at Carnall Hall\n\nCedar Lodge\n\nSugar Ridge Resort\n\nArlington Resort Hotel & Spa What are the most unique towns in Arkansas? Arkansas has so many interesting destinations and attractions to offer. You’ll be surprised and delighted by all the quirky and unusual things there are to see in the Natural State. When you’re planning a road trip, be sure to consider staying in the most unique towns in Arkansas. Tontitown\n\nBrinkley\n\nLake Village\n\nJasper\n\nPiggott\n\nHeber Springs\n\nParis\n\nDes Arc\n\nBull Shoals\n\nGentry\n\nElm Springs\n\nMountainburg\n\nPonca\n\nCalico Rock\n\nTontitown\n\nBrinkley\n\nLake Village\n\nJasper"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3Lm9ubHlpbnlvdXJzdGF0ZS5jb20vYXJrYW5zYXMvaGlkZGVuLWhlYXZlbmx5LWFjY29tbW9kYXRpb24tYXIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Apr 2023 07:00:00 GMT",
        "title": "Charming B&B In Arkansas: Country Oaks Bed and Breakfast - Only In Your State",
        "content": "As local travel experts, we know what travelers are looking for when it comes to finding the perfect accommodations for their next trip. To compile our lists, we scour the internet to find properties with excellent ratings and reviews, desirable amenities, nearby attractions, and that something special that makes a destination worthy of traveling for.\n\nPeace and serenity await at the Country Oaks Bed and Breakfast in the Ozarks. This delightful haven features a beautiful Carriage House situated on a 70-acre pasture nestled in the gorgeous countryside. Escape to this charming bed and breakfast in Mountain View, Arkansas, where you can marvel at picturesque lake views or relax on the porch and allow the day to unfold in the most heavenly way. You’ll want to make this hidden gem bed and breakfast your next peaceful getaway. Read more about the property below and you’ll be packing your bags in excited anticipation before you know it.\n\nAre you ready to escape to this heavenly B&B for a peaceful getaway? If so, visit the Country Oaks Bed & Breakfast website to secure your reservations. Have you already enjoyed this incredible hotel? What was your favorite part? Let us know in the comments below, we love to hear your firsthand accounts of these unique experiences.\n\nWhile you’re in Mountain View, be sure to check out this charming general store that will take you back in time.\n\nWant more Arkansas in your inbox? Get the latest on things to see, do, and eat around Arkansas! spinner Thank you! You'll receive your first newsletter soon! An error occured. Subscribe\n\nMore to Explore Best Hotels In Arkansas Where are the best hotels in Arkansas? You’ll definitely want to stay at this property but there are plenty of other incredible hotels in Arkansas to explore during your journey. Whether you like a quaint B&B or a luxury experience, there’s something for every taste. 21c Museum Hotel Bentonville\n\nBeckham Creek Cave Lodge\n\nDoubleTree by Hilton Hot Springs\n\nEmbassy Suites Northwest Arkansas\n\nCapital Hotel\n\nLookout Point Lakeside Inn\n\n1886 Crescent Hotel & Spa\n\nThe Reserve at Hot Springs\n\nInn at Carnall Hall\n\nCedar Lodge\n\nSugar Ridge Resort\n\nArlington Resort Hotel & Spa What are the most unique towns in Arkansas? Arkansas has so many interesting destinations and attractions to offer. You’ll be surprised and delighted by all the quirky and unusual things there are to see in the Natural State. When you’re planning a road trip, be sure to consider staying in the most unique towns in Arkansas. Tontitown\n\nBrinkley\n\nLake Village\n\nJasper\n\nPiggott\n\nHeber Springs\n\nParis\n\nDes Arc\n\nBull Shoals\n\nGentry\n\nElm Springs\n\nMountainburg\n\nPonca\n\nCalico Rock\n\nTontitown\n\nBrinkley\n\nLake Village\n\nJasper"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8venljcnlwdG8uY29tL29kb2dlLW9wdGltaXNtLWRvZ2UtaXMtbm93LWF2YWlsYWJsZS1mb3ItdHJhZGluZy1vbi1ob3RiaXQtZXhjaGFuZ2Uv0gFdaHR0cHM6Ly96eWNyeXB0by5jb20vb2RvZ2Utb3B0aW1pc20tZG9nZS1pcy1ub3ctYXZhaWxhYmxlLWZvci10cmFkaW5nLW9uLWhvdGJpdC1leGNoYW5nZS8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Apr 2023 07:00:00 GMT",
        "title": "ODOGE (Optimism Doge) is Now Available for Trading on Hotbit Exchange - ZyCrypto",
        "content": "Advertisement\n\nHotbit Exchange, a global crypto trading platform, will officially list ODOGE (Optimism Doge) on April 20th, 2023, and the ODOGE/nUSD trading pair will be available for trading for all users of Hotbit Exchange.\n\nOptimism Doge (ODOGE) is a popular meme coin named after an optimistic and cheerful dog representing hope and positivity. A community-driven meme coin with unlimited potential.The native token ODOGE will be listed on Hotbit Exchange on April 20th, 2023, at 12:00 AM UTC.\n\nINTRODUCING OPTIMISM DOGE\n\nODOGE is a well-established meme coin that operates on blockchain technology and draws its name from a cheerful and optimistic dog that symbolizes hope, positivity, and confidence in the future of blockchain and cryptocurrency. The coin’s mission is to create a strong and vibrant community and a comprehensive ecosystem that provides users with an all-encompassing and user-friendly experience.\n\nODOGE has many features, including ODoge NFTs, Game, swap, DEFI, farm, ODoge Chain, and Cross-chain Bridges, allowing users to engage with the coin in various ways. The team behind ODOGE is committed to continually developing and expanding the platform to provide users with new and exciting opportunities to interact with the coin.\n\nIn the short run, ODOGE’s primary objectives are centered around building a robust and engaged community, securing listings on reputable exchanges, and carrying out innovative burning experiments. The team aims to continually enhance the ecosystem and application facilities, leveraging cross-chain functionality and expanding the coin’s use cases to attract more investors to the community.\n\nAdvertisement\n\nIn the long run, ODOGE’s goal is to become a leading meme coin, following in the footsteps of Doge and Shib, ultimately achieving a listing on Binance. To achieve these objectives, the team will employ marketing principles and execute strategic initiatives to position ODOGE as a prominent and respected player within the crypto community.\n\nAbout ODOGE Token\n\nOptimism Doge, the popular meme coin, has a total supply of 42 trillion tokens, out of which 90% have already been burned, leaving 4.2 trillion tokens in circulation. The token distribution is allocated as follows: 5.3% for presale, 2.7% for liquidity pools, 0.3% for marketing, 0.3% for charity, 0.4% for development and community building, and 1% for exchange listing.\n\nOptimism Doge has implemented a transaction burn feature to ensure a deflationary model, where a portion of each transaction is destroyed, leading to a decrease in circulating supply over time. This scarcity effect may potentially increase the token’s value. Furthermore, the coin imposes a 10% transaction tax on every trade, with 5% of the tax distributed as dividends to all token holders, rewarding all investors.\n\nIn addition, 3% of the transaction tax will be allocated towards buyback and burn, community development, and exchange listing. The remaining 2% will be dedicated to marketing and ecosystem development. This ensures that the community continues to develop and grow, emphasising fostering a thriving ecosystem.\n\nABOUT HOTBIT\n\nFounded in 2018 and holding an Estonian MTR license, American MSB license, Australian AUSTRAC license, and Canadian MSB license, Hotbit cryptocurrency exchange is known as a leading trading platform that continues to develop and integrate various forms of businesses such as spot trading, financial derivatives, cryptocurrency investment and DAPP into one platform. Hotbit has already gained over 8 Million registered users from more than 210 countries and regions.\n\nBased on its globalized and unified strategies, Hotbit focuses on the world’s emerging markets, such as Russia, Turkey, and Southeast Asia markets and was ranked one of the top 3 most welcomed exchanges by Russian media in 2019. Hotbit is constantly introducing and listing high-quality crypto projects so that its users can directly trade, manage, track, and analyze cryptocurrencies, making the entire experience easier for ordinary people.\n\nStart Trading Now:\n\nTrading on Hotbit:\n\nHotbit Telegram: https://t.me/Hotbit_English\n\nHotbit Twitter: https://twitter.com/Hotbit_news\n\nODOGE Links:\n\nOfficial website: https://odoge.site/\n\nTwitter: https://twitter.com/odogeofficial\n\nTelegram: https://t.me/OptimismDoge\n\nDisclaimer: This is a sponsored article, and views in it do not represent those of, nor should they be attributed to, ZyCrypto. Readers should conduct independent research before taking any actions related to the company, product, or crypto projects mentioned in this piece; nor can this article be regarded as investment advice."
    }
]