[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiJGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wcmljZS9yYWNhL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "RACA Price | RACA Price and Live Chart - CoinDesk",
        "content": "Bitcoin Price Index XBX\n\nThe CoinDesk Bitcoin Price Index (XBX) is the world’s leading reference for the price of bitcoin, used by the largest institutions active in crypto assets. It is the crypto market standard, benchmarking billions of dollars in registered financial products and pricing hundreds of millions in daily over-the-counter transactions. Built for replicability and reliability, in continuous operation since 2014, the XBX is relied upon by asset allocators, asset managers, market participants and exchanges. The XBX is the flagship in a portfolio of single- and multi-asset indices offered by CoinDesk ."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3QvZmxva2ktYW5ub3VuY2UtcGhhc2Utb25lLW9mLWZsb2tpLWNhcmQtcG93ZXJlZC1ieS1mY2ZwYXnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Floki Announce Phase One of FLOKI Card Powered By FCFPay - BSC NEWS",
        "content": "BNB\n\nUsers can now create a virtual prepaid Visa/Mastercard debit card and fund it with $FLOKI or other cryptocurrencies. The virtual card is available to all merchants worldwide.\n\nPhase 1 of FLOKI Card Goes Live\n\nFloki has announced that phase one of the FLOKI Card integration powered by FCFPay is now live, adding more utility to the $FLOKI token and its ecosystem.\n\nThe first phase is the creation of virtual prepaid debit cards. The innovation enables users to fund prepaid Visa/Mastercard virtual debit cards with the native $FLOKI token. The card is issued in partnership with FCFPay and is open to all users worldwide.\n\nTherefore, users worldwide can generate virtual cards and fund them with $FLOKI tokens, including other crypto assets and stablecoins, across numerous blockchains. Most importantly, they are accepted anywhere.\n\n“FLOKI holders can now generate and fund prepaid Visa/Mastercard virtual debit cards with FLOKI tokens or a range of popular cryptocurrencies, including stablecoins, on multiple blockchains,” Floki wrote in the official announcement.\n\nThe virtual cards have a $5,000 limit for all users worldwide. Further, users have a daily transaction limit of $2,500. The virtual card also has a 3.75% top-up fee, which would be used to develop the Floki ecosystem. According to the announcement, 1% of the fee would be used to burn FLOKI tokens and make them more deflationary.\n\nAfter phase one, Floki will commence phase two, releasing physical cards to merchants later this year, conforming to the 2023 Roadmap. The move connects Decentralized Finance (DeFi) to the real world, showcasing the usefulness of cryptocurrencies in the industry. Interested users should visit https://floki.com/prepaid-card to purchase the card and learn more about its features.\n\nWhat is Floki:\n\nFloki Inu began with a tweet from Elon Musk. When the billionaire announced he would name his Shiba Inu puppy Floki, it created a deluge of ‘Floki’ dogcoins. The most successful of these is Floki Inu. Floki Inu is currently the market's third most popular meme token, behind Dogecoin and Shiba Inu. It is backed by a community of committed enthusiasts and a strong marketing campaign.\n\nWhere to find Floki:\n\nWebsite | Twitter | Telegram | Discord |\n\n‍"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vYmxvY2tjaGFpbi5uZXdzL25ld3MvYm5iLWNoYWluLWRvbWluYXRlcy1xMS0yMDIzLXJ1Zy1wdWxsLXNjYW1z0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "BNB Chain Dominates Q1 2023 Rug Pull Scams - Blockchain.News",
        "content": "In the first quarter of 2023, BNB Chain has been identified as the network with the highest percentage of rug pull scams, according to a report by blockchain security firm Immunefi. The report, titled “Crypto Losses in Q1 2023,” investigated a variety of crypto hacks and scams in the first quarter of the year. It found that BNB Chain saw 73.3% of all rug pulls in the crypto ecosystem, with Ethereum coming in second at 26.7%.\n\nThe report also revealed that BNB Chain and Ethereum were the two largest targets for hackers and scammers, accounting for 68.8% of total losses from these networks combined. Of these two networks, BNB Chain was hit the hardest, with 41.3% of total losses from hacks and scams.\n\nOne particular type of scam stood out on BNB Chain: rug pulls. This type of scam involves developers raising funds and then shutting down their project without delivering the promised product or service. According to Immunefi, BNB Chain saw 73.3% of all rug pull scams in the crypto ecosystem during Q1 2023.\n\nThe Immunefi report highlights the need for increased security measures in the crypto industry, particularly on BNB Chain. As the network continues to grow in popularity, it is likely that more hackers and scammers will try to exploit vulnerabilities in the system. This makes it essential for investors to remain vigilant and do their due diligence before investing in any crypto project.\n\nWhile BNB Chain has faced its fair share of challenges in Q1 2023, it remains one of the most widely used networks in the crypto ecosystem. Its popularity can be attributed to its low transaction fees, fast confirmation times, and support for smart contracts. As the network continues to evolve and improve, it is likely that it will remain a dominant force in the crypto industry for years to come.\n\nIn conclusion, BNB Chain dominated Q1 2023 rug pull scams, accounting for 73.3% of all such scams in the crypto ecosystem. While this is certainly concerning, it is important to remember that the crypto industry as a whole is still in its early stages of development. As the industry matures, it is likely that new security measures will be implemented to prevent these types of scams from occurring in the future. In the meantime, investors should remain cautious and do their own research before investing in any crypto project, particularly on networks like BNB Chain that are more susceptible to scams and hacks.\n\nImage source: Shutterstock\n\n. . .\n\nTags"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDQvMDUvcmFkaWFudC1jYXBpdGFsLXJkbnQtY3J5cHRvL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "What is the Radiant Capital (RDNT) crypto? - The Cryptonomist",
        "content": "Binance, the world’s leading cryptocurrency trading exchange, recently announced the introduction of a new launchpool, this time for the Radiant Capital (RDNT) crypto.\n\nHow does this interesting product from Binance work? What is Radiant Capital?\n\nDiscover it in this article.\n\nWhat is the Radiant Capital (RDNT) crypto?\n\nRadiant Capital is a money market similar to Aave, built on Arbitrum and BNB Smart Chain, using Layer Zero technology.\n\nIn the platform it is possible to provide liquidity or borrow assets such as DAI, USDC, USDT, ETH and WBTC.\n\nFor each crypto there is an interest rate to be paid in the event of borrowing, or to be received in the event of depositing. There is also a mechanism to receive tokens in Radiant Capital’s RDNT crypto and receive a higher return.\n\nThe same RDNT token can be staked by receiving interest in diversified fractions of other tokens.\n\nThis is a good method to accumulate mainly stablecoins, ETH and WBTC.\n\nIn this regard, it should be noted that there is still no native version of BTC in blockchain smart contracts, but “Dfinity Foundation” has recently launched its own Chain-key Bitcoin standard.\n\nOn the technical analysis front, Radiant Capital’s RDNT crypto has performed very well over the past 3 months.\n\nIt has gone from a value of $0.043, recorded on 5 January 2023, to its current value of $0.357 per token. That is a frightening price increase of about 830%.\n\nThe current market capitalization is $72 million, with volumes of nearly $35 million in the last 24 hours. Circulating supply equal to 20% of total supply.\n\nThe main centralized markets for trading the crypto RDNT are Binance, Gate.io, Okex and Kucoin. However, if you prefer to trade it on DEX, the best markets are found on Pancakeswap and Uniswap.\n\nThe token contracts are the following:\n\nBNB Chain: 0xf7de7e8a6bd59ed41a4b5fe50278b3b7f31384df\n\nArbitrum: 0x3082CC23568eA640225c2467653dB90e9250AaA0\n\nHow do Binance’s Launchpools work?\n\nLaunchpools are an interesting product that Binance offers to its users.\n\nIt is a very simple way to put one’s cryptocurrencies to work and earn new tokens without incurring great risks, other than the inherent risks of the platform itself and market volatility. Let’s try to explain in more detail what launchpools consist of.\n\nLaunchpool is a financial product created by Binance that allows its users to delegate tokens such as BNB and TUSD to earn passive returns paid in other tokens, usually those related to new projects launched in the market, such as in this case the Radiant Capital project and its RDNT crypto.\n\nThe mechanism is really simple:\n\nFirst, you need to be a registered and verified user on Binance.\n\nBy clicking on the “Earn” item and then on “Launchpad” you can enter the dashboard that shows all the projects on the platform’s launchpad.\n\nThis type of product is not always accessible; indeed, there is a time constraint in which you can “stake” your tokens.\n\nThere are no lock or vesting mechanisms; all assets can be redeemed at any time.\n\nIn the case of the Launchpool of Radiant Capital’s RDNT crypto, the farming period is 40 days. There are currently 34 days left for passive returns.\n\nFor each pool there is an APY, which is an annualized percentage yield and the total number of tokens put into staking.\n\nDo not be fooled by the APY figures, this is a percentage that is hypothetically paid out over a YEAR and not over the entire farming period.\n\nNonetheless, Launchpool remains a great product for earning returns untied from one’s time.\n\nHence if you already hold BNB (and do not need to buy it and incur the risk of market volatility) why not accept receiving free tokens, even if in a reduced amount?\n\nThe Radiant Capital project and the RDNT crypto were useful for receiving airdrop from Arbitrum\n\nThe RDNT crypto and its Radiant Capital platform were one of the horses to bet on to get Arbitrum’s recent airdrop.\n\nAs a reminder, the Arbitrum Dao recently announced the release of its governance token to all early adopters in the ecosystem who have dedicated their time and funds on platforms like Radiant Capital and crypto assets like RDNT.\n\nThe eligibility criteria are very complex, and it certainly would not have been enough to operate solely on Radiant’s platform.\n\nTo qualify for the airdrop it was necessary to be compliant in at least 3 of these points:\n\nhaving bridged on Arbitrum one or Arbitrum Nova\n\nhaving made transactions on multiple occasions\n\nhaving interacted with several smart contracts\n\nhaving carried out transactions with a value greater than $10,000\n\nhaving bridged on Arbitrum One with a value greater than $10,000\n\nHaving conducted at least 3 transactions on Arbitrum Nova.\n\nBeyond that, Radiant Capital and the RDNT crypto are key pillars of Arbitrum’s infrastructure.\n\nRadiant is the fourth-largest protocol by value locked on Arbitrum’s blockchain, behind only GMX, Uniswap, and Aave.\n\nAccording to DefiLlama’s data, the TVL on Arbitrum is $129 million, while that on the BSC is $61 million. It is very interesting to note that the total blocked stakes on Radiant are far greater than the entire market capitalization of the RDNT token."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vbmFpcmFtZXRyaWNzLmNvbS8yMDIzLzA0LzA1L3RvcC01LWNyeXB0b2N1cnJlbmNpZXMtdG8td2F0Y2gtaW4tYXByaWwtMjAyMy_SAVhodHRwczovL25haXJhbWV0cmljcy5jb20vMjAyMy8wNC8wNS90b3AtNS1jcnlwdG9jdXJyZW5jaWVzLXRvLXdhdGNoLWluLWFwcmlsLTIwMjMvP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Top 5 Cryptocurrencies to watch in April 2023 if you want to make money - Nairametrics",
        "content": "Key Highlights\n\nThe cryptocurrency market posted a bullish performance in March, with Bitcoin leading the way with a 23.03% gain. The cryptocurrency market capitalization gained 10.19%, while the altcoin market gained 2.03%.\n\nFive cryptocurrencies to watch out for in April 2023 are Bitcoin, BNB Chain’s BNB, Ethereum’s Ether, XRP, and Conflux’s CFX.\n\nThe article provides an overview of the performance of each of these cryptocurrencies in March, highlighting key events that impacted their prices and market trends.\n\nThe cryptocurrency space in March, saw it post a bullish performance pushing it into the fourth consecutive month of gain.\n\nDespite the gains seen, the market was crowded with a lot of regulatory and market FUD. However, despite these occurrences, the market still posted a massive bullish performance to end the first quarter of the year.\n\nFlagship cryptocurrency asset, Bitcoin, posted a bullish performance, as the rest of the market followed in its trend. It began trading from $23,147.35 at the beginning of the month and ultimately ended the month at $28,478.48, representing a 23.03% gain.\n\nThe cryptocurrency market capitalization in March gained 10.19% for the month, from $1.08 trillion at the start of the month to the end of the month at $1.19 trillion. The cryptocurrency market capitalization traded as high as $1.20 trillion during the month.\n\nThe Altcoin market experienced similar bullishness, gaining 2.03% in March, from approximately $622.1 billion to currently standing at $634.7 billion at the end of the month. During the month, we saw the altcoin market capitalization trade as high as $646 billion.\n\nWith the current bullish trend seen in the market, here is a look at 5 cryptocurrencies investors should watch out for in April 2023:\n\nBitcoin’s BTC\n\nFor Bitcoin, a key point of resistance from earlier in its current halving cycle indicates that the current trading zone represents a major hurdle for bulls to overcome. Should they manage it, price targets extend beyond the $30,000 mark. Matthew Hyland, a crypto analyst, summarized in his latest tweet on BTC that, “Bitcoin has been consolidating below the biggest resistance/support of the last 2+ years. A whole new ballgame if BTC breaks it. NASDAQ & S&P went strong into the weekly close. Still, major pessimism and disbelief while major milestones are close to being made for Stocks/BTC.”\n\nPopular Twitter account Byzantine General predicted that a breakthrough of resistance immediately above the spot price would result in a sea of liquidations, leading to further upward momentum. The account tweeted, “It feels like some bear is very desperately trying to defend the 29k to 30k region. I think that when this level breaks massive liqs will come in. And it does feel like a matter of ‘when’ not ‘if’ because there’s zero froth in the market, only some spot supply.”\n\nTo add, according to data from Coinglass, the 23% gain seen in March almost matches its 2021 performance, with 2013 remaining its most volatile. This is relevant because Bitcoin’s trajectory mimics both years, seeing at least three months “in the green” before significant consolidation began.\n\nBitcoin ended the month’s trading at $28,478.48.\n\nBNB Chain’s BNB\n\nOn March 27, the United States Commodity Futures Trading Commission sued Binance and its CEO, Changpeng “CZ” Zhao, alleging that the company illegally offered crypto derivatives services to Americans and facilitated illicit financial activity.\n\nBNB dropped by over 5.5% to $305 on the announcement day, logging its worst daily performance since Feb. 13, when its price dropped by over 5.8% due to another regulatory crackdown involving Binance-branded stablecoin Binance USD. BNB’s price stabilized on March 28, wobbling between gains and losses as CZ refuted CFTC’s allegations. However, the BNB/USD pair risked falling further if one considers its recent response to regulatory actions. For instance, the New York regulator’s BUSD crackdown in February 2023 preceded a 15%-plus BNB price decline.\n\nBNB ended the month’s trading at $317.04.\n\nEthereum’s Ether\n\nIn the digital assets space, Ethereum remains the largest smart contract platform, hosting a plethora of financial products, innovation, and automation, with varying degrees of decentralization (generally referred to as DeFi).\n\nFrom an on-chain perspective, Ether’s short-term and long-term trends look skewed toward the bulls. Most Ethereum whale cohorts have increased their ETH accumulation in recent weeks, according to the latest data from Santiment. For instance, the supply of Ether held by addresses with a 1,000-10,000 ETH balance (blue in the chart below) has grown by 0.5% in March.\n\nSimilarly, the 1 million-10 million ETH and the 10 million-100 million ETH balance cohorts have witnessed 0.4% and 0.5% rises, respectively. The growth appeared amid what appears to be the absorption of selling pressure introduced by the 100,000-1 million ETH (pink) and 10,000-100,000 ETH address cohorts. At the same time, the growth could be attributed to the network’s proof-of-stake contracts, directly or by using third-party stakers such as Lido DAO (LDO).\n\nThe net Ether deposited at the official Ethereum 2.0 address crossed above 18 million ETH after rising about 3.5% in March. The deposits have grown ahead of Ethereum’s Shanghai and Capella upgrades on April 12, which would enable stakers to withdraw ETH from the PoS smart contract. Currently, this is not possible.\n\nEther ended the month trading at $1,822.02.\n\nXRP\n\nRipple’s chances of winning the court case against the Securities Exchange Commission (SEC) improved on March 21 after the presiding judge, Analisa Torres, decided to exclude an expert’s opinion explaining how could be a security. On March 27, another U.S. regulatory move was a blessing in disguise for XRP holders. The Commodity Futures Trading Commission (CFTC) in the U.S. charged Binance with improper compliance procedures and market manipulation.\n\nThe regulatory body classified Bitcoin, Ethereum, and Litecoin as commodities in the filing. Some believe that this classification will extend to XRP as well. Thus, effectively refuting the SEC’s claim of XRP being a security. The market’s expectation of Ripple winning the case against the SEC has pushed XRP’s price to new yearly highs already this month and if Ripple goes on to win the case against SEC, the bullish momentum in XRP will likely continue in the medium to long term. To add, XRP was the fourth largest gainer for March 2023, as it hit a 10-month high.\n\nXRP ended the month’s trading at $0.5385.\n\nConflux’s CFX\n\nConflux (CFX) is a public layer-1 blockchain that was made to power decentralized applications (dApps), e-commerce, and Web 3.0 infrastructure by being more scalable, decentralized, and secure than existing protocols. The protocol makes it easier to transfer valuable assets by making the process quick, effective, free of network congestion, and with low transaction costs. The platform is based on the Tree-Graph consensus mechanism, and it combines Proof-of-Work (PoW) and Proof-of-Stake (PoS) algorithms to achieve consensus. The protocol uses Turing-complete smart contracts written in Solidity, just like those on Ethereum, and is compatible with the EVM (Ethereum Virtual Machine).\n\nConflux Network continued its positive run from February, nearly doubling its price in March. The project’s team continued to strengthen its partnerships in China by adding XCMD, the world’s third-largest construction machinery manufacturer, and Zen Spark Technology. The Conflux team also supports the development of permissionless applications. It has established a grants program to promote its ecosystem development.\n\nOver the years, Conflux has earned the reputation of a Chinese enterprise blockchain with partners in Oreo China, McDonald’s China, and Chinese Instagram equivalent Little Red Book. The blockchain also hosts a stablecoin pegged to the Chinese yuan with the approval of the Chinese government, which is highly encouraging given the strict influence of the authorities over state policies.\n\nThe Conflux Network deploys both proof-of-work and proof-of-stake mechanisms to increase scalability and decentralization. The network processes between 3,000 to 6,000 transactions per second, which is considerably faster than Ethereum’s speed of 15 tps.\n\nWhile Conflux has established partnerships with leading Chinese brands, the activity on the blockchain has yet to justify the 500% increase in CFX’s price rally in the last two months. Data shows that the number of new Conflux addresses and NFTs minted on the platform has stayed at par with previous months with no evident spike.\n\nCFX ended the month’s trading at $0.4134."
    }
]