[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vY3J5cHRvLm5ld3MvYmluYW5jZXMtMjAxNy1pY28tZmxvcHBlZC1leGNoYW5nZS1yZXBvcnRlZGx5LXJhaXNlZC01bS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 06 Oct 2023 07:00:00 GMT",
        "title": "Binance's 2017 ICO flopped, exchange reportedly raised $5m - crypto.news",
        "content": "A recent investigation by Forbes, in collaboration with Gray Wolf Analytics and Inca Digital, suggests that Binance’s initial coin offering (ICO) for BNB in 2017 “was a flop”.\n\nThe report claims that Binance likely raised less than $5 million for BNB, its native token, through its ICO, significantly less than what the exchange announced on its website.\n\nAn archived copy of Binance’s front page during its ICO | Source: Forbes\n\nThe analysis also found that investors received only around 10.78 million BNB, while an additional 20 million BNB were transferred to angel investors.\n\nForbes further suggests that Binance may have held the undistributed tokens. However, it is unlikely, given that investors would not want to keep them on an “unestablished” exchange.\n\nBinance initially advertised BNB as a way to receive a discount on the exchange, which may have incentivized some investors to keep the token in Binance’s wallets.\n\nThe report claims that Binance controlled nearly 117 million tokens on Aug. 31, 2023– 76% of the total outstanding supply. While it is unclear how Forbes came to this conclusion, the report claims that the analysis combined disclosed tokens issued to the founding team with a proprietary probabilistic analysis.\n\nInca Digital CEO Adam Zarazinski suggests that less than half of the 120 million tokens were distributed and that they were circulated between multiple, presumably Binance-controlled, wallets.\n\nBinance and its CEO, Changpeng Zhao, have not publicly commented on the matter."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3QvcGFuY2FrZXN3YXAteC13YWxsY2hhaW4taW50ZWdyYXRpb24tbWV2LXByb3RlY3Rpb24tZm9yLWJuYi1jaGFpbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 06 Oct 2023 07:00:00 GMT",
        "title": "PancakeSwap x Wallchain Integration: MEV Protection for BNB Chain - BSC NEWS",
        "content": "BNB\n\nPancakeSwap users will now be able to benefit from Wallchain’s innovative features and offerings, which are centred around protection from MEV attacks.\n\nAnnounced in a blog post by Wallchain investor, MH Ventures, this latest integration with BNB Chain’s leading decentralized exchange is aimed at allowing PancakeSwap’s community to benefit from Wallchain’s MEV protection and rebate features.\n\nAccording to the post, Wallchain’s integration partners “now cover 90%+ of the order flow on BNB chain”. Though beginning with BNB Chain, Wallchain reportedly plans to expand its offering across other major EVM ecosystems, with a view to improving the cryptocurrency user experience across the industry as a whole.\n\n“The integration with PancakeSwap is a significant leap forward. The PancakeSwap community will soon be able to leverage Wallchain's advanced MEV rebate features, thereby saving on MEV losses. This is a win-win situation for both platforms and users.” reads the post\n\nWallchain’s Solution to MEV Vulnerability\n\nWallchain leverages an innovative solution, known as ‘meta-intents’, to improve the cryptocurrency user journey.\n\nMeta-intents work by “combining user transaction data and searcher backrun into a single transaction” - a process which not only protects traders from MEV attacks, but also provides a financial benefit as a result.\n\nMH’s blog post further highlights three of Wallchain’s most notable achievements:\n\nEliminates the need for extra gas/bribe payment. Independence from blockchain type, making it blockchain agnostic MEV extraction before any OFA, RPCs, sequencers, validators etc.\n\n“The launch of Wallchain’s integration with PancakeSwap marks a pivotal moment in the crypto industry, setting new standards for user-focused innovation and cost-efficiency. This collaboration not only addresses the long-standing issue of MEV attacks but also transforms it into an opportunity for users to financially benefit.”"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpbmFuY2UtaWNvLXJhaXNlZC1sZXNzLXVzNS1tbG4tZm9yYmVzL9IBQGh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpbmFuY2UtaWNvLXJhaXNlZC1sZXNzLXVzNS1tbG4tZm9yYmVzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 06 Oct 2023 07:00:00 GMT",
        "title": "Binance ICO raised less than US$5 mln: Forbes - Forkast News",
        "content": "Binance’s 2017 initial coin offering (ICO) of its Binance Coin (BNB) reportedly raised less than US$5 million, contrary to the US$15 million claimed by the company and its Chief Executive Officer Changpeng Zhao.\n\nSee related article: U.S. SEC denied immediate access to Binance.US software\n\nFast Facts\n\nBinance coin (BNB) is the exchange’s native token that was launched through an ICO in 2017 with a maximum supply of 200 million tokens. It was originally released on the Ethereum blockchain but later migrated to Binance’s own blockchain.\n\nBinance claimed it sold 100 million BNB tokens during the ICO at 15 cents per coin, raising US$15 million.\n\nHowever, according to a Forbes investigation conducted with the assistance of two blockchain forensic firms, Binance’s crypto wallets transferred a total of 10.78 million BNBs to investor wallets in the summer of 2017, not 100 million.\n\nForbes said an additional 20 million coins have subsequently been transferred to angel investor wallets, doubling their allocation to 40 million BNB. Binance was left with 145 million of its newly-minted BNB coins by September 2018, instead of the initially planned 80 million, while the unsold 65 million coins, worth less than US$10 million at the time, would now be worth over US$14 billion.\n\nBinance did not immediately Forkast’s request for comment.\n\nBinance has been under the regulatory microscope in various jurisdictions, including the U.S., where Binance was sued by the Securities and Exchange Commission and the Commodities Futures Trading Commission earlier this year. Binance.US, the exchange’s U.S. affiliate, cut one-third of its employees in September, while also losing its then-chief executive officer, Brian Shroder.\n\nIn September, Binance said it would change its euro banking partner two weeks after Binance France was reportedly investigated for money laundering. In Australia, the country’s securities watchdog canceled the local branch’s derivatives license in April, a day after receiving the cancelation request from the exchange.\n\nBNB fell 0.11% in the 24 hours leading up to 3:25 p.m. in Hong Kong, to US$212, according to CoinMarketCap data.\n\nSee related article: Binance Japan partners with mega bank MUFJ on stablecoin project"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vdS50b2RheS8yNjItYmlsbGlvbi14cnAtaGVsZC1ieS1iaW5hbmNlLWluLXVzZXItYXNzZXRzLWRldGFpbHPSAUpodHRwczovL3UudG9kYXkvMjYyLWJpbGxpb24teHJwLWhlbGQtYnktYmluYW5jZS1pbi11c2VyLWFzc2V0cy1kZXRhaWxzP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 06 Oct 2023 07:00:00 GMT",
        "title": "2.62 Billion XRP Held by Binance in User Assets: Details - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nBinance, the leading cryptocurrency exchange, has published its eleventh proof of reserve, which reflects a snapshot of balances taken on Oct. 1.\n\nAdvertisement\n\nThe proof-of-reserves report, which verifies that Binance holds user assets 1:1, indicated that the crypto exchange held 2.6 billion XRP in user assets. The amount of 2,629,459,187.625 (2.62 billion) XRP accounted for customer net balances on Binance.\n\nBinance net balances for XRP are higher at 2,738,661,519.884 (2.73) billion. XRP has a collateral of 104.15%, implying that the exchange holds an extra 4.15% reserve for its XRP deposits.\n\nMeanwhile, users' BTC assets were 588,879, an increase of 0.12% from a month ago; users' ETH assets were 3.83 million, a decrease of 1.6%; and users' USDT assets were 15.31 billion, a decrease of 0.8%, as reported by Wu blockchain.\n\nBinance is the largest XRP market, with the XRP/USDT trading pair accounting for the majority of XRP trade volumes in the past 24 hours. In the last 24 hours, 1.463 billion XRP worth $762,436,233 were exchanged, according to CoinMarketCap data.\n\nBithumb, one of South Korea's largest crypto exchanges, and Coinbase also drive the largest chunk of XRP trading, sitting in second and third places, respectively.\n\nXRP price action\n\nThe price of XRP surged by up to 8% to $0.548 on Oct. 3 before sliding back to where it now trades. XRP had declined 0.44% in the previous 24 hours to $0.521 at the time of writing.\n\nBulls are currently thwarting bears' attempts to reenter the triangle in which XRP traded before its Oct. 3 breakout.\n\nIf they succeed, the bulls will try to break through the overhead resistance at $0.56, which might signify the start of a fresh rally.\n\nXRP might then begin its climb toward the coveted 0.66 level. If the price falls below $0.511, which coincides with the MA 50, this could lead to more range-bound action in the coming days."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmNvaW50cmlidW5lLmNvbS9lbi8xMWUtcHJldXZlLWRlLXJlc2VydmVzLWRlLWJpbmFuY2UtbGUtcmV0b3VyLWRlcy10cmFkZXJzLWJpdGNvaW4tMi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 06 Oct 2023 07:00:00 GMT",
        "title": "Binance Publishes its 11th Proof-of-Reserves Report - Cointribune EN",
        "content": "Fri 06 Oct 2023 ▪ 4 min of reading ▪ by Mikaia A.\n\nFollowing the FTX incident, Binance opted for transparency to maintain the trust of its hundreds of millions of users. Thus, in November 2022, the crypto giant engaged Mazars, an international auditing firm, to facilitate access to reliable data concerning customers’ holdings in BTC, ETH, USDT, and more. In early October, Binance released its 11th Proof-of-Reserves (PoR) report. Details follow.\n\nBinance Releases its 11th Cryptocurrency Proof of Reserves Report\n\nThe first report of this kind, published by Binance last November, failed to convince analysts. First, it lacked significant information regarding the structure of the crypto company. Additionally, our colleague pointed out, in an article, that the 1:1 ratio of reserves to Binance customer assets had not been achieved.\n\nHowever, these remarks did not deter Binance from repeating the same action: publishing a proof of reserves report at the beginning of each month.\n\nBinance releases its eleventh proof of reserve (snapshot date 10-1). Users' BTC assets were 588k, an increase of 0.12% from a month ago; users' ETH assets were 3.83 million, a decrease of 1.6%; users' USDT assets were 15.31 billion, a decrease of 0.8%.https://t.co/jGCPnwd2PR — Wu Blockchain (@WuBlockchain) October 5, 2023 Binance’s 11th Proof of Reserves Report Online\n\nA brief comparison with the last report published in September confirms this slight increase in bitcoin holdings as reported by WuBlockchain. If the number of BTC was 588,000 a month ago, an additional 878 coins have been added to Binance’s wallets.\n\nBinance Reserves Overview – Source: Binance Official Website\n\nRegarding the declines mentioned for other altcoins, AMB Crypto did not fail to mention the strong regulatory pressures faced by Binance at the moment. The crypto media even went as far as to discuss a rush of investors toward self-custody solutions. Furthermore, the figures presented represent only a very small proportion of Binance’s offerings.\n\nIs BNB Heading for a Crash?\n\nAMB Crypto also provided an analysis of BNB’s evolution with the publication of this Binance proof of reserves report. On one hand, there are signs of accumulation of Binance’s native crypto since August 22. This could potentially indicate a BNB upswing.\n\nBut at the same time, the possibility of a crash cannot be ruled out. Crypto analysts observed a similar trend between June 12 and August 11.\n\nMoreover, the 5% drop in BNB from its weekly high does not bode well. The Relative Strength Index (RSI) and Money Flow Index (MFI) for the period between June and August demonstrate low confidence in BNB. The weighted sentiment measure of BNB has also not risen since late September.\n\nIt’s worth noting that Binance’s crypto fell by as much as 14% between June and August.\n\nIn other words, the sentiment among crypto traders does not seem conducive to the long-awaited bullish rally.\n\nAt the time of writing this article, BNB was trading at $212.24 USD.\n\nAs for the increase in Binance’s bitcoin holdings, could it signify the return of BTC traders? For now, it’s challenging to make a definitive statement on this until further analysis from K33 Research provides compelling insights on the matter. Their latest report did indeed speak of a bitcoin trader exodus that shook the entire crypto industry.\n\nMaximize your Cointribune experience with our 'Read to Earn' program! Earn points for each article you read and gain access to exclusive rewards. Sign up now and start accruing benefits.\n\nClick here to join 'Read to Earn' and turn your passion for crypto into rewards!\n\nA A Lien copié"
    }
]