[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiNGh0dHBzOi8vbWVzc2FyaS5pby9yZXBvcnQvc3RhdGUtb2YtYm5iLWNoYWluLXE0LTIwMjLSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Feb 2023 08:00:00 GMT",
        "title": "State of BNB Chain Q4 2022 - Messari",
        "content": "We believe crypto is the technology of free people, free thinking, and free markets."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3Qvd29ybWhvbGUtZmFjZXMtdXAtYWdhaW5zdC1zcGVjaWFsLWludGVyZXN0LWluLXVuaXN3YXAtYm5iLWNoYWluLWJyaWRnZS1wcm9wb3NhbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Feb 2023 17:57:55 GMT",
        "title": "Wormhole Faces Up Against Special Interests in Uniswap-BNB Chain Bridge Proposal - BSC NEWS",
        "content": "BNB\n\nThe votes coming in for the governance bridge deployment are casting a dark shadow on industry behavior.\n\na16z Votes Push Out Wormhole Bridge\n\nWormhole has a big hole to climb in the race to become the Governance Bridge for Uniswap’s deployment on BNB Chain. The major venture capitalist a16z has pushed in all 15 million of its $UNI tokens, worth over $105 million, against the proposal.\n\nThe nays against Wormhole are winning the vote as of February 5 by over 64%, despite only 10% of the token supply voting. Voting opened on February 4 and will last until February 10. The deployment of all 15M tokens by Uniswap is the first time the VC has used all its tokens in a vote, signaling a major stroke of power from the group.\n\na16z votes against proposal to deploy latest Uniswap $UNI iteration on BNB Chain@a16z used all 15M of their $UNI tokens (worth over $105M) to vote against the proposal, which would use the Wormhole bridge for the @Uniswap V3 deployment on @BNBCHAIN.\n\n\n\n👉 https://t.co/gMyctJkXzS pic.twitter.com/X5l4IxxSro — TOP 7 ICO | #StandWithUkraine🇺🇦 (@top7ico) February 5, 2023\n\nWormhole was recently selected as the potential cross-chain governance messaging bridge between Ethereum and BNB Chain for when Uniswap v3 deploys in Spring 2023. The Uniswap community chose Wormhole over the three other bridges: Celer Network, LayerZero, and Debridge.\n\nUniswap is the most voluminous Decentralized Exchange (DEX) in all of the cryptocurrency industry and its actions hold considerable influence across the industry. The competition for protocols to facilitate Uniswap’s deployment onto BNB Chain is becoming fierce as the power and influence could set a project up for success.\n\nAnd the move from a16z is raising eyebrows. The vote by a16z is causing some controversy around centralization in the world of Decentralized Finance (DeFi) because a16z is a major backer of the bridge LayerZero, which lost the initial proposal. A16z helped lead a $135M fundraise for LayerZero in 2022.\n\nUniswap controlled by a16z? https://t.co/9QTi1KjVjG — CZ 🔶 Binance (@cz_binance) February 5, 2023\n\nMany on social media have come out against the optics playing out in the bridge bids. The bridge decision appears to be unraveling into a behind-the-scenes battle between VCs and special interest groups. The criticisms focus on how the bids display the negative role that special interest groups can play in the growth of DeFi.\n\nIs this a good look for the DeFi community? Steven Zheng, Research Director at The Block, opines that the vote may have gone too far.\n\nNarrator: They went that far pic.twitter.com/bAwCXVXKPY — Steven (@Dogetoshi) February 5, 2023\n\nThere is still a little less than a week to vote on the proposal. The Uniswap community has full power to rally and tip the vote in any direction. Uniswap expects to complete the bridge to BNB Chain by Q2 in 2023.\n\nWhat is Uniswap:\n\nUniswap was launched in November 2018 and has grown to become the largest decentralized exchange in its category. It was built open-source on the Ethereum blockchain and uses the AMM model to facilitate Ethereum ERC-20 token swaps. Uniswap\n\nMuch of the progress made in Ethereum-based DeFi expansion is attributable to Uniswap as it provided the market-making utility for Web3 apps to function in a decentralized environment. The platform consistently records daily trade volumes of over half a billion dollars and has a total volume locked (TVL) of more than $3 billion. The platform has traded over $1 trillion since it launched via over 129 million transactions.\n\nWhere to find Uniswap:\n\nWebsite | Twitter | Discord |\n\nWhat is Wormhole:\n\nThe Wormhole Network is a generic message-passing protocol that connects high-value blockchains and allows applications to leverage the messaging layer to facilitate interoperability between ecosystems. Secured by 19 guardians, developers are able to leverage the protocol to send arbitrary data cross-chain, including tokens, NFTs, oracle data, governance decisions and more.\n\nWhere to find Wormhole:\n\nWebsite | Twitter | Telegram | GitHub |"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiNGh0dHBzOi8vbWVzc2FyaS5pby9yZXBvcnQvc3RhdGUtb2YtYm5iLWNoYWluLXE0LTIwMjLSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Feb 2023 08:00:00 GMT",
        "title": "State of BNB Chain Q4 2022 - Messari",
        "content": "We believe crypto is the technology of free people, free thinking, and free markets."
    }
]