[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vdGVjaC5oaW5kdXN0YW50aW1lcy5jb20vdGVjaC9uZXdzLzEwMC1taWxsaW9uLW9mLWJpbmFuY2UtY29pbi1zdG9sZW4tNzE2NjUxMzQzMTk0NjIuaHRtbNIBZGh0dHBzOi8vdGVjaC5oaW5kdXN0YW50aW1lcy5jb20vYW1wL3RlY2gvbmV3cy8xMDAtbWlsbGlvbi1vZi1iaW5hbmNlLWNvaW4tc3RvbGVuLTcxNjY1MTM0MzE5NDYyLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 07 Oct 2023 07:00:00 GMT",
        "title": "$100 million of Binance Coin stolen - HT Tech",
        "content": "An already bad year for cryptocurrencies took another turn for the worse after roughly $100 million of Binance Coin was stolen in what appears to be the latest hack to hit digital assets.\n\nAn exploit occurred on a bridge between blockchains and the issue is “contained now,” Changpeng “CZ” Zhao, billionaire co-founder of Binance, the world's biggest crypto exchange, said on Twitter on Friday.\n\nA spokesperson for Binance-backed blockchain BNB Chain estimated the incident involved $100 million to $110 million of digital tokens. At least $7 million of stolen funds has already been frozen, the spokesperson added. The bridge, BSC Token Hub, has been suspended.\n\nAlso read Looking for a smartphone? To check mobile finder click here.\n\nAbout $2 billion has been lost in crypto hacks this year, many perpetrated by North Korea-linked groups. Cross-chain bridges used to transfer tokens across blockchains have been a popular target.\n\nThe Binance ecosystem is among the highest profile to be buffeted. Zhao said on Twitter that “in all likelihood, Binance will cover any fund that the hackers get away with.”\n\nBNB Chain said it's working with security services to freeze transfers of stolen funds. Binance Coin, also known as BNB, fell as much as 3.3% on Friday and was trading around $285 as of 10:08 a.m. in Tokyo.\n\nThe crypto sector has been pummeled both by hacks and a deep rout that's wiped some $2 trillion off the value of digital assets.\n\nThe wider crypto markets took the latest developments in their stride. Bitcoin was little changed at around $20,000."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiNGh0dHBzOi8vdGhlZGVmaWFudC5pby9uZXdzL2RlZmkvYnNjLXBhdXNlZC01NjBtLWhhY2vSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 07 Oct 2023 07:00:00 GMT",
        "title": "Binance Smart Chain Back Online After $560M Bridge Hack - The Defiant - DeFi News",
        "content": "BSC Back Online Friday After Major Exploit\n\nBy: Owen Fernau • Loading...\n\nDeFi\n\nAnother major DeFi bridge has been exploited, and Binance’s Ethereum-compatible blockchain is the target.\n\nBinance Smart Chain (BSC) was paused on Thursday after more than $500m in BNB, the Binance ecosystem’s native token, were drained from the official bridge.\n\nBNB fell 5% once news of the hack became public but has since pared some of its losses. On Friday, BNB Chain tweeted that the service was back online.\n\n\n\n“BNB Smartchain (BSC) is running ok from 20+ minutes ago,” the venture said in a post. “The validators are confirming their status and the community are upgrading as well.”\n\nBNB’s token has stabilized at $284.06 in late morning trading U.K. time, according to CoinGecko data.\n\nAccording to Zane Huffman, who works at Vesper Finance, a platform which gives users access to out-of-the-box DeFi earning strategies, the attacker obtained 2M BNB tokens through the official BNB Chain (BSC) bridge. Researcher Igor Igamberdiev notes that the attacker registered as a relayer for the bridge shortly before the exploit.\n\nExploiter’s Wallet. Source: DeBank\n\nThe stolen BNB is worth around $560M as of Oct. 6. The attacker then deposited BNB into Venus, a lending protocol on BSC, and borrowed 150M in stablecoins.\n\nThe attacker has since bridged some of those assets to multiple other chains — there are $53M in assets on Ethereum and almost $49M on Fantom as of 8pm ET, according to DeBank.\n\nChain Paused And Withdrawals Halted\n\nIn response to the hack, BSC’s Twitter account tweeted that the blockchain has been paused. The team also claims that only $70M to $80M in assets have been moved off-chain, which has observers asking about the remaining $400M-plus of BNB sitting in the attacker’s wallet.\n\nBinance, the world’s largest crypto exchange with $14.7B in trading volume in the past 24 hours, has suspended deposits and withdrawals on BSC. This makes it likely that the $430M of BNB left on BSC will remain inaccessible, leaving the hacker with roughly $100M in assets on other chains.\n\nThe attacker’s address has been blacklisted by Tether, the issuer of crypto’s largest stablecoin USDT. Blacklisting isn’t new to DeFi but underscores the extent of centralized control that exists in the ecosystem, which runs counter to crypto’s permissionless ethos.\n\nUpdated on Oct. 7 with Binance Smart Chain tweet and BNB prices."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8venljcnlwdG8uY29tL3Rvcm9iYXNlLWlzLWl0LWEtc2FmZS1hbmQtcmVsaWFibGUtYnJva2VyL9IBQ2h0dHBzOi8venljcnlwdG8uY29tL3Rvcm9iYXNlLWlzLWl0LWEtc2FmZS1hbmQtcmVsaWFibGUtYnJva2VyLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 07 Oct 2023 07:00:00 GMT",
        "title": "Torobase: Is it a Safe and Reliable Broker? - ZyCrypto",
        "content": "Advertisement\n\nNavigating the world of online trading can be tricky, but Torobase makes it simpler and safer for everyone. Let’s delve into why Torobase stands out as a safe, reliable, and trustworthy platform.\n\n1. Safety First: Secured Accounts\n\nSecurity in online trading is a necessity. Torobase ensures the highest level of safety by incorporating 2-factor authentication for all its transactions. What does this mean? Even if someone miraculously cracks your password, they’d still need verification from your e-mail to make a withdrawal. This double-layered security measure gives users an enhanced peace of mind, knowing their funds are secure.\n\n2. Reliability: Seamless Global Market Connectivity\n\nTorobase makes trading on global markets a breeze. Use it on your computer, tablet, or phone without tricky setups and installations. Whether you’re trading forex or crypto, Torobase ensures you’re always always stay updated. Also, having a crypto-based account means that your yields are automatically converted and stored in crypto, making transactions smooth and straightforward.\n\nAdvertisement\n\n3. Trustworthiness: Transparent Transactions\n\nNobody likes unpleasant surprises, especially regarding hidden fees in trading. Torobase rises above such practices. Traders are assured of zero hidden charges, minimal spreads, and transparent pricing. The platform’s revenue comes from the difference between the ask and bid prices. This clarity ensures that traders know precisely what they’re signing up for, fortifying Torobase’s position as a trustworthy partner.\n\n4. Modern & Adaptable: The Torobase Platform\n\nWhere some brokers remain anchored to dated platforms such as MetaTrader, Torobase strides forward. Recognizing the increasing relevance of algorithmic trading, the platform offers an Open API, a dream come true for automated trading robots and advanced algo traders. This modern approach ensures traders are equipped with the latest tools and technologies, making trading more efficient and adaptive.\n\n5. Empowerment Through Leverage\n\nLeverage can amplify a trader’s potential profits. Torobase offers a staggering 3000x instant leverage, which means traders can potentially harness much larger trading values, maximizing their profit-making opportunities. And all of this comes with no extra fees.\n\n6. User-Centric Approach\n\nTorobase emphasizes a user-centric approach. Becoming a trader on this platform is streamlined into three easy steps. The ease of registration, funding, and starting the trading is testimony to Torobase’s commitment to making online trading as user-friendly as possible.\n\n7. Integrated Crypto Solutions\n\nAs more people turn to cryptocurrency, Torobase’s crypto wallet gives traders the simplicity they need to get involved. A crypto-based trading account facilitates swift transactions while allowing traders to capitalize on the dynamic crypto market.\n\nIn Conclusion:\n\nTorobase stands out in the digital trading landscape as a safe, dependable, and reliable broker. With its progressive features, transparent policies, and user-centric approach, Torobase has solidified its reputation as a trustworthy broker in online trading.\n\nWhether you’re just starting out or an experienced trader, Torobase prioritizes security, ensuring that every transaction meets the utmost standards of reliability and simplicity.\n\nDisclaimer: This is a sponsored article, and views in it do not represent those of, nor should they be attributed to, ZyCrypto. Readers should conduct independent research before taking any actions related to the company, product, or crypto projects mentioned in this piece; nor can this article be regarded as investment advice."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vdGhlY3VycmVuY3lhbmFseXRpY3MuY29tL2FsdGNvaW5zL2JpbmFuY2UtY29pbi1ibmItc2Vlcy1zbGlnaHQtZGlwLWluLXZhbHVlLW92ZXItdGhlLXBhc3QtMjQtaG91cnMtNzQxMTfSAXRodHRwczovL3RoZWN1cnJlbmN5YW5hbHl0aWNzLmNvbS9hbHRjb2lucy9iaW5hbmNlLWNvaW4tYm5iLXNlZXMtc2xpZ2h0LWRpcC1pbi12YWx1ZS1vdmVyLXRoZS1wYXN0LTI0LWhvdXJzLTc0MTE3L2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 07 Oct 2023 07:00:00 GMT",
        "title": "Binance Coin (BNB) Sees Slight Dip in Value Over the Past 24 Hours - The Currency Analytics",
        "content": "In the ever-evolving world of cryptocurrencies, every minor price fluctuation captures the attention of traders, investors, and enthusiasts alike. Today, we take a closer look at Binance Coin (BNB), one of the prominent players in the digital currency arena. Over the past 24 hours, BNB has experienced a slight dip in its value, amounting to a mere 0.20% decrease. While this might appear insignificant at first glance, it’s worth delving deeper into the implications of this change.\n\nCryptocurrency markets are known for their volatility, and even a small change can set off a chain reaction of trading activity and speculation. So, let’s explore what this minor shift in BNB’s value might mean for the broader crypto landscape.\n\nUnderstanding Binance Coin (BNB):\n\nBefore we delve into the recent price movement, let’s briefly recap what Binance Coin (BNB) is all about. BNB is a cryptocurrency created by Binance, one of the world’s largest and most popular cryptocurrency exchanges. It’s part of the broader Binance ecosystem and serves various functions within the platform.\n\nOne of the primary uses of BNB is to pay for trading fees on the Binance exchange. Traders who use BNB to pay their fees often receive discounts, making it an attractive option for frequent traders. Additionally, BNB can be used for various purposes, including purchasing goods and services, participating in token sales on the Binance Launchpad, and more.\n\nBNB’s Recent Price Movement:\n\nOver the last 24 hours, BNB’s price has experienced a minor decrease of 0.20%. For context, at the time of writing, BNB was trading at $360. While this might seem like a small drop, it’s essential to remember that cryptocurrency markets operate 24/7, and even slight changes can accumulate over time.\n\nThe crypto market is influenced by a multitude of factors, including investor sentiment, news events, regulatory developments, and global economic conditions. Even though this decrease is relatively minor, it could be indicative of broader market trends or investor sentiment regarding BNB.\n\nImplications for Investors:\n\nFor cryptocurrency investors, any change in the market can be a cause for consideration. While a 0.20% drop in BNB’s value may not warrant immediate panic, it’s essential to monitor the situation and understand the potential reasons behind this fluctuation.\n\nMarket Sentiment: Cryptocurrency prices often react to market sentiment. A small dip could be the result of profit-taking by some investors or uncertainty in the broader crypto market. External Factors: Keep an eye on news and events that might impact BNB. Regulatory changes, security breaches, or technological developments can all influence the price of a cryptocurrency. Long-Term Perspective: It’s crucial to maintain a long-term perspective when investing in cryptocurrencies. Minor price fluctuations are common, and they don’t necessarily reflect the overall health or potential of a digital asset. Diversification: Investors may consider diversifying their crypto portfolio to spread risk. Holding a mix of different cryptocurrencies can help mitigate the impact of price fluctuations in any single asset.\n\nThe Crypto Market’s Wild Ride:\n\nThe cryptocurrency market is known for its wild and unpredictable nature. While BNB’s 0.20% drop over 24 hours is relatively modest, it’s just one piece of the larger puzzle. To provide some context, it’s essential to remember that cryptocurrencies like Bitcoin and Ethereum have experienced significant price swings over the years, sometimes rising or falling by hundreds or even thousands of dollars in a single day.\n\nThe crypto market is still relatively young and evolving, which contributes to its inherent volatility. It’s a space where innovative technologies and financial instruments are constantly emerging, making it an exciting yet challenging landscape for investors.\n\nKeeping an Eye on the Future:\n\nAs we keep an eye on Binance Coin’s price movements and the broader cryptocurrency market, it’s essential to stay informed and make well-informed decisions. Whether you’re a seasoned crypto investor or just starting to explore the world of digital currencies, remember that knowledge and a long-term perspective are your best allies.\n\nConclusion:\n\nIn the ever-fluctuating world of cryptocurrencies, even a minor 0.20% decrease in Binance Coin’s value over 24 hours can spark curiosity and speculation. While this change might not be earth-shattering, it serves as a reminder that the crypto market is in a constant state of flux.\n\nInvestors and enthusiasts should approach such fluctuations with a measured perspective, considering factors like market sentiment, external events, and their long-term goals. As we continue to navigate this exciting but unpredictable landscape, staying informed and maintaining a balanced portfolio will be essential for success."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LnRoZWF0bGFudGljLmNvbS9pZGVhcy9hcmNoaXZlLzIwMjMvMTAvYWlyYm5iLW5ldy15b3JrLWhvdXNpbmctbWFya2V0LWNhbi1tYXRjaC82NzU1NjEv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 07 Oct 2023 07:00:00 GMT",
        "title": "What Really Took Down Airbnb - The Atlantic",
        "content": "Earlier this month, I stayed in an Airbnb in the Bedford-Stuyvesant neighborhood of Brooklyn.\n\nIn the past decade or so, the neighborhood has undergone as dizzying a process of gentrification as a place can. The median sales price of a condo nearly doubled; the median sales price of a single-family home more than tripled. The share of Black residents dropped from 60 percent to 40 percent; the share of white residents increased from 15 percent to 33 percent. The neighborhood became less socioeconomically diverse, home to fewer immigrants, fewer families, and more single people. It became less like the old New York and more like the new New York, which is to say more like Greenwich or Short Hills—a place where family wealth or a job on Wall Street is table stakes.\n\nAirbnb is not responsible for Bed-Stuy’s transformation; the city’s extreme housing shortage and sky-high wealth inequality are the central, obvious culprits. But the “sharing economy’s” entry into real estate did not exactly help. An analysis earlier this year by the advocacy and data group Inside Airbnb and the publication Gothamist found that Bed-Stuy had the highest concentration of Airbnb listings of any neighborhood in the city. In one six-by-four-block area, there were 87 Airbnbs. That’s 87 apartments decorated in Ikea and auctioned off night after night to people with no investment in the neighborhood. That’s 87 families that could have lived in Bed-Stuy, moved to Bed-Stuy, stayed in Bed-Stuy.\n\nSome Airbnbs, to be fair, were owned and inhabited by people who were defraying their own housing costs. But many of the city’s Airbnbs were full-time short-stay units. They were hotel rooms, not homes, owned by investors, not families. And there were 39,000 of them, displacing 100,000 New Yorkers, give or take.\n\nNo more. Last month, New York started enforcing strict rules on short-term leases. Airbnb called it a “de facto ban.” And it is. Hosts have to register with the city to get paid. Apartments have to be rented for 30 days or more, or adhere to a few other conditions: The hosts have to be on site, residing in the same unit. Just 405 units have been registered, leaving a meager set of listings. I was curious to see what sort of places these were, and if they were indeed following the new rules, so I rented one. The spot described itself as “exempt” from the regulations. I couldn’t quite figure out why.\n\nThis unit aside, the crackdown seems to be working. There’s not much of a gray or black market for leases like these. The Airbnb apocalypse is here. The company helped to stoke the housing crisis in places such as Bed-Stuy. It benefited from the housing crisis. And now, in New York at least, it is getting crushed by it too.\n\nRead: Airbnb really is different now\n\nAirbnb came into being during the last great American housing crisis, one very different from today’s. Millions of Americans had become homeowners, putting little money down on properties they could not really afford. When those homeowners started missing mortgage payments, real-estate values dropped and a global economic depression ensued. This housing cataclysm planted the seeds for the next: The real-estate crash depressed the building of new housing, which is, remarkably, still taking place at a lower level than it was during the Bush years, when there were 30 million fewer Americans.\n\nAirbnb was not really a housing company or a hospitality company. It was a “sharing” company. And it was a platform—pioneering, alongside Uber, a business model that soon became ubiquitous in Silicon Valley. These firms created markets, connecting sellers who had supply (seats in cars, places in their home) with buyers who had demand (people needing a taxi ride, folks who wanted a kitchen along with a hotel room). Such firms handled the search and took care of the transaction.\n\nIt was not obvious at first that these companies would succeed. “Why would anyone need Airbnb?” my colleague Alexis Madrigal wrote back in 2010, noting the existence of Couchsurfing.com, which at the time was not totally dissimilar. “Would thousands of people really want strangers staying with them?”\n\nIndeed, they did. Using Airbnb in the early days, as I did often, generally meant taking an extra bed or a cramped bedroom in an occupied apartment. It was charming, if a little scary. You got to water other people’s plants and check out the kind of shampoo they used. You spent a lot of time wondering if the key would really be under the mat.\n\nQuickly, the operation professionalized and the weird got squeezed out of the experience. It became less common to land in someone’s home with their stuff in it, and more common to open the door to a perma-sublet. Hosting companies took over management. “Airbnb arbitrage” started to become common: People would rent apartments, put them on Airbnb, and make thousands and thousands of dollars a month. Thus, Airbnb came to compete directly with hotels. And it came to compete with homeowners and renters too.\n\nThe company has long denied that it has anything to do with the housing shortage. But of course it does. It made the crisis in places such as New York worse by siphoning units off of the housing market and adding them to the market for hotel rooms. One major study found that a 1 percent increase in Airbnb listings led to a 0.02 percent increase in rental prices and a 0.03 percent increase in sale prices. That might not sound like much, but it adds up. A report from the New York City comptroller confirmed that Airbnb fueled rent increases in neighborhoods such as Bed-Stuy. And as of last year, there were more apartments available to rent on Airbnb in the city than there were available to rent long-term.\n\nThad Russell: What I learned when I rented my parents’ former home as an Airbnb\n\nThat should not have been the case. The New York State Multiple Dwelling Law already barred rental bookings for stays shorter than 30 days if the host was not on premises, but the rule was never thoroughly enforced. Many Airbnb units in many places were in violation of some state or local statute or another. The whole business was a prime example of something the legal scholars Elizabeth Pollman and Jordan M. Barry called “regulatory entrepreneurship.” A start-up creates a business in likely violation of the law. It disrupts! This disruption gives the company an unfair advantage over its rivals. (Airbnb hosts do not tend to offer the same disability access that hotels do, for instance.) The company grows and demands that politicians “clarify” the laws to make its business legal.\n\nNew York dithered on cracking down or clarifying, even as politicians inveighed against the company and the city punished hosts with fines. The situation became less and less tenable as the housing crisis got worse and worse. “Every illegal short-term rental in our city represents a unit of housing that is not available for real New Yorkers to live in,” State Senator Liz Krueger said in one statement, a sentiment echoed by many, many, many local politicians. “In the middle of an ongoing affordable housing crisis, every single unit matters.”\n\nBefore I lived in New York, I often visited, and I was glad to rent an Airbnb. In an utterly different housing market, it could have been a good idea. But not in this one. At last, Mayor Eric Adams’s administration took action. But it wasn’t the government that killed off Airbnb in the city; it was the housing crisis. Is the end of Airbnb going to bring down the cost of apartments in Bed-Stuy? No. Is it going to mean less tourism revenue for the city? Sure, on the margin. But thousands of apartments are going to trickle onto the market, making it a little bit easier for New Yorkers to find a place to live."
    }
]