[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzAzLzE4L2ZvdXItbWFqb3ItY3J5cHRvLWV4Y2hhbmdlcy1hbm5vdW5jZS1zdXBwb3J0LWZvci1hcmJpdHJ1bS1hcmItYWhlYWQtb2YtbWFzc2l2ZS1haXJkcm9wL9IBfGh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzAzLzE4L2ZvdXItbWFqb3ItY3J5cHRvLWV4Y2hhbmdlcy1hbm5vdW5jZS1zdXBwb3J0LWZvci1hcmJpdHJ1bS1hcmItYWhlYWQtb2YtbWFzc2l2ZS1haXJkcm9wL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Mar 2023 07:00:00 GMT",
        "title": "Four Major Crypto Exchanges Announce Support for Arbitrum (ARB) Ahead of Massive Airdrop - The Daily Hodl",
        "content": "At least four major crypto exchanges have now announced they plan to list Arbitrum’s upcoming crypto asset, ARB.\n\nMEXC, Huobi and Bybit all say they will list ARB next Thursday, March 23rd, the date of the token’s airdrop.\n\nBitrue also plans to list ARB, noting in a Twitter post that the opening time for deposits and trading will be updated.\n\nIn a blog post this week, Arbitrum developers announced the airdrop and outlined the protocol’s upcoming plans to switch to being governed by a self-executing decentralized autonomous organization (DAO).\n\nThe Ethereum (ETH) scaling solution plans to airdrop 12.75% of the ecosystem’s token supply to users next Thursday.\n\nThe developers say they created a special points system that takes into account a variety of metrics to determine which users will receive the crypto assets.\n\nArbitrum currently ranks fourth among all chains in terms of total value locked (TVL) with $1.77 billion, behind Ethereum, Tron (TRX) and BNB Smart Chain, according to the decentralized finance tracker DeFi Llama. Polygon (MATIC) is fifth, with $1.06 billion in TVL.\n\nThe TVL of a blockchain represents the total capital held within its smart contracts.\n\nTVL is calculated by multiplying the amount of collateral locked into the network by the current value of the assets.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    }
]