[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiM2h0dHBzOi8vd3d3LmNudHJhdmVsbGVyLmNvbS9nYWxsZXJ5L2Jlc3QtYWlyYm5icy11a9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Apr 2023 07:00:00 GMT",
        "title": "The best Airbnbs in the UK for 2023 - Condé Nast Traveller",
        "content": "Best for: a girl's weekend\n\nYou can’t get more central than this tall, Grade II-listed townhouse squirrelled away down a quiet cobblestone street just footsteps from the ancient Roman Baths the city is named for. Built in 1748 by the same architect responsible for the Circus and Queen Square, it was previously run by the Freemasons – apparently it’s still possible to hear the occasional organ pipe and particularly loud high note waft down from the neighbouring Masonic Hall in one of the property’s ensuite bathrooms. Only available to rent since the end of 2020, it has interiors that are fresh and tastefully in keeping with the historic building – a four-poster here, an original Victorian loo there, and a couple of show-stopping huge round bathtubs to wallow in – though combined with some slick, modern conveniences, such as the electric oven brilliantly disguised as an Aga.\n\nThe housekeeper also handily lives just next door, and is on-hand to offer local tips or help with the house. The real wow moment, however, will strike you once you reach the very top of the third flight of stairs and step onto the spacious roof terrace looking out over Bath’s beautiful rooftops and famed abbey. (Insider tip: It’s ideal for those with little ones in tow. If you’re travelling with friends with babies, the three floors between the two basement rooms and the master bedroom mean new parents – or perhaps just seismic snorers – needn’t worry about waking the whole party at night.) By Becky Lucas\n\nSleeps: six, plus babies and toddlers\n\nPrice: from £506 a night"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL3p5Y3J5cHRvLmNvbS90b24tZGlhbW9uZHMtcGFydG5lcnMtd2l0aC1mb3VyLXRvcC1hcnRpc3RzLXRvLXNob3djYXNlLWN1dHRpbmctZWRnZS1kaWdpdGFsLXBpZWNlcy1hdC10aGUtZm9jdXMtYXJ0LWZhaXItaW4tbmV3LXlvcmsv0gGPAWh0dHBzOi8venljcnlwdG8uY29tL3Rvbi1kaWFtb25kcy1wYXJ0bmVycy13aXRoLWZvdXItdG9wLWFydGlzdHMtdG8tc2hvd2Nhc2UtY3V0dGluZy1lZGdlLWRpZ2l0YWwtcGllY2VzLWF0LXRoZS1mb2N1cy1hcnQtZmFpci1pbi1uZXcteW9yay8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Apr 2023 07:00:00 GMT",
        "title": "TON Diamonds Partners With Four Top Artists To Showcase Cutting-Edge Digital Pieces At The Focus Art Fair In New York - ZyCrypto",
        "content": "Advertisement\n\nTON Diamonds, a curated marketplace and auction powerhouse, announced its partnership with four visionary digital artists to showcase their work on the TON Blockchain.\n\nDuring the Focus Art Fair, this partnership seeks to showcase the cutting-edge artworks of Yonk (Sarah McDaniel), Ellen Sheidlin, Shane Fu, and Reeps100 (Harry Yeff) & Trung Bao. Focus Art Fair is a high-end art event in the heart of New York scheduled to start from May 18 to May 21, 2023. In addition, the unique NFT pieces will also be available for auction exclusively on the TON Diamonds platform.\n\nNotably, the concept for the exhibition is “The Flow of Consciousness: Exploring the Intersection of Art, Technology, and Spirituality.” The event brings these four artists together, allowing audiences to explore their interpretation of technology, spirituality, and art. Audiences will also look to interpret them in light of these aspects contributing to man’s understanding of themselves and the world around them. The four are best known for providing artwork that offers a rich tapestry of ideas that enable viewers to explore the essence of human consciousness. In a nutshell, the work provides a glimpse into the nature of human beings, complex emotions, and transcending language and culture.\n\nA former model, Yonk is a rising multimedia artist working with 2D, live-action, and stop motion which is married to CGI. Her work has been featured in music videos for artists such as Mark Ronson, G-Eazy, Mark Ronson, and Kevin Parker. Ellen’s works have placed her among the top figures in survirtualism, an emerging art movement that fuses elements of virtuality, realism, and dreamscapes to create a new form of expression.\n\nAlso known as Reeps100, Harry Yeff is best known for voice and tech-based expression. He has over 15 years of experience exploring the intersection of audio and virtual cultures to help transform vocal music into tangible forms, including sculptures, photography, and film. Lastly, Shane creates a mesmerizing collection of hyperreal artwork by combining his mathematics and computer graphics interests.\n\nAdvertisement\n\nBased on TON Blockchain, TON Diamonds has been a pioneering platform allowing different artists to release their artworks as NFTs. The platform leverage TON Blockchain’s cutting-edge technology to bridge the gap between conventional art and the digital realm. In addition to world-famous digital creators, TON Diamonds is home to art enthusiasts and collectors seeking to acquire unique and exclusive digital artworks.\n\nTON diamond has played a crucial part in democratizing the art industry by leveraging NFTs and blockchain technologies to open new opportunities for artist to expand their reach. Since its launch, the platform has seen significant growth gaining over 160,000 unique visors from many countries, including Belarus, German, USA, and more. The platform has a trading volume of 1,848,765 TON and a daily volume of $2,779.95 at the exchange rate."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMikgFodHRwczovL2ZvcnR1bmUuY29tLzIwMjMvMDQvMDEvYmluYW5jZS1uYmEtc3Rhci1qaW1teS1idXRsZXItYW5kLWNyeXB0by1pbmZsdWVuY2Vycy1oaXQtd2l0aC0xLWJpbGxpb24tc3VpdC1mb3ItcHJvbW90aW5nLXVucmVnaXN0ZXJlZC1zZWN1cml0aWVzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Apr 2023 07:00:00 GMT",
        "title": "Binance, NBA’s Jimmy Butler hit with class action suit - Fortune",
        "content": "Just four days after the Commodity Futures Trading Commission brought a highly-publicized suit against Binance, the world’s largest cryptocurrency exchange is facing another high-profile legal challenge.\n\nLate on the evening of March 31, the Moskowitz Law Firm and Boies Schiller Flexner, home to super-attorney David Boies, filed a class action suit that targets Binance, its founder Changpeng Zhao (CZ)—the world’s leading spokesman for the crypto industry—and hoops star Jimmy Butler of the Miami Heat.\n\nAdam Moskowitz, founding and managing partner of the Moskowitz Law Firm, discussed the suit with Fortune shortly after the filing, made in the Southern District of Florida.\n\nThe law firms previously teamed up to bring a class action against Voyager, which subsequently went bankrupt, and two suits tied to the failure of FTX. The first of the latter targeted celebrities who served as the exchange’s highly-paid brand ambassadors, a roster that included comedian Larry David, basketballers Shaquille O’Neal and Steph Curry, and football legend Tom Brady. In mid-March, Moskowitz Law and Boies Schiller sued eight compensated “influencers” for promoting FTT, FTX’s native coin. That suit alleges that the influencers are liable for customer losses on the collapsed coin because it qualified as an “unregistered security.”\n\nThe new action against Binance rests on the same basic assertion: that the exchange was trading cryptocurrencies that are in reality unregistered securities, and that social media influencers paid by Binance promoted these instruments unlawfully. “This is a classic example of a centralized exchange, which is promoting the sale of an unregistered security,” charges the complaint. The suit seeks damages in excess of $1 billion, in total, from the Binance companies and the influencers. “We’ve been investigating these same unregistered security issues against Binance for over a year,” notes Moskowitz.\n\nThe complaint states that under relevant state securities laws, anyone who purchases unregistered securities is entitled to damages equal to all losses they suffered. The defendants have no obligation to prove that they were deceived or even swayed by the social media posts or ads that touted the coins, only that they saw them. As Moskowitz told Fortune, “The statute clearly states that if an influencer is promoting an unregistered security, and has a financial interest in doing so, the influencer may be liable to everyone who bought the assets. The exchange that facilitates the trades would be liable as well.”\n\nThe plaintiffs are two Florida residents and a person from California, all of whom lost money trading coins promoted by Binance and the influencers. But the complaint estimates that the people eligible for damages could number “in the millions.” The defendants are Binance’s U.S. affiliate, Binance’s three principal international entities, CZ himself, and three influencers. Besides Butler, the influencer defendants at this stage are big-time crypto promoters Ben Armstrong, known as BitBoy Crypto, and Graham Stephan, who boasts 4.1 million subscribers on YouTube.\n\nIt’s especially noteworthy that the complaint cites both Binance’s native token, BNB, and its Affiliate Program, which is little known to the public. The action makes the case that CZ “burns” or eliminates BNB, reducing the supply in an effort to boost its price, an action that brands BNB as a security. It also gives detail on how Binance Affiliates receive rebates on the trades for investors they recruit and “click through their link” to buy and sell coins on the Binance platform. Hence, Armstrong and Stephan were allegedly getting paid for illegally promoting unregistered securities, via the Affiliate kickbacks. Moskowitz told Fortune that it will add a number of other Binance influencers to the suit in future filings.\n\nThe suit isn’t simply seeking damages for Floridians who lost money. It’s also suing under California law. The suit goes much further, citing the CFTC charges that Binance marketed secretly and heavily to customers all over the U.S., so that all people residing stateside who suffered losses are eligible for damages. The complaint doesn’t stop there: It includes a “global class” that encompasses “all persons and entities residing outside the U.S.”\n\nOf course, it’s not at all certain that the Florida court will deem BNB and other coins as unregistered securities. Moskowitz is encouraged that the SEC made that determination in actions against FTT and a recent suit versus Tron’s currency TRX.\n\n“If we win on the unregistered securities issue, there will be no question that Binance and the influencers are liable,” Moskowitz told Fortune. “It’s ironic that FTX was going to be the savior of Voyager until their fraud was uncovered, and now Binance is supposed to be the next savior. Given the cases in bankruptcy, this may be the last chance for the victims to seek any recovery from their losses from crypto fraud.”\n\nThe case is potentially a pivotal one. If the plaintiffs prevail, the social media cheerleaders who’ve done so much to boost this populist phenomenon could retreat, dealing a heavy blow to the crypto-verse."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3LmNiYy5jYS9uZXdzL2NhbmFkYS9icml0aXNoLWNvbHVtYmlhL2JjLWFpcmJuYi1yZWd1bGF0aW9ucy0xLjY3OTgwNTnSASBodHRwczovL3d3dy5jYmMuY2EvYW1wLzEuNjc5ODA1OQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Apr 2023 07:00:00 GMT",
        "title": "B.C. mulling provincial regulations on short-term rental apps like Airbnb - CBC.ca",
        "content": "With Quebec promising to introduce provincewide regulations on short-term rentals listed on the Airbnb app, the B.C. government says it is working on legislation of its own.\n\nA mandate letter issued to B.C. Housing Minister Ravi Kahlon includes a directive to introduce legislation to allow local communities to \"better regulate\" services like Airbnb, and the minister has told CBC News that he would work on it this year.\n\nThe scrutiny of Airbnb and similar platforms has increased across the country after seven people died in a fire at an illegal Airbnb in Old Montreal two weeks ago.\n\nAs Quebec promises to require the Airbnb app to only list rentals that have been registered with the province, here is the current state of regulation for vacation rental platforms in B.C., and what the government plans to do in the months to come.\n\nWho regulates short-term rentals?\n\nWhile the province is responsible for certain regulations — largely around whether Airbnb hosts pay PST — most oversight of short-term rentals (STRs) is done by local governments.\n\nThat means the issuing of business licences and appropriate bylaw enforcement is handled by cities and municipalities. Municipalities can also use zoning tools to ensure STRs can only operate in certain areas .\n\nIn addition, strata councils — which can be responsible for apartment complexes and similar developments — may also impose bylaws around STRs, even banning them outright .\n\nWhat are the current regulations?\n\nIt varies by jurisdiction, but many B.C. communities have bylaws restricting STR listings.\n\nVancouver , Kelowna and Victoria — among others — restrict short-term rentals to units where owners can prove either they or someone else lives on the property as a primary residence, with possible fines for infractions.\n\nRohana Rezel, a Vancouver-based housing advocate, also said another regulatory deterrent is that if an owner is caught running an Airbnb full-time, they no longer qualify for the principal residence exemption of the province's vacant homes tax .\n\n\"But the problem is, all this requires enforcement, and that's where things have been seriously lacking. Because enforcement has been so lax, people are willing to gamble,\" he said.\n\nA rental availability sign outside of an apartment building in Vancouver. Rohana Rezel says that if a person is caught running an STR in a building they don't occupy, they could be taxed. (Ben Nelms/CBC)\n\nAccording to Rezel, who tracks vacation rental listings, a \"cursory glance\" shows that a large number of Vancouver's listings are illegal under municipal bylaws.\n\nIndependent watchdog Inside Airbnb estimates nearly 29 per cent of Vancouver's 5,975 listings are unlicensed.\n\nWhy is the province considering stepping in?\n\nThe government says that while municipalities have the tools to regulate STRs, it's clear that they need additional tools that only the province can provide.\n\n\"Compliance and enforcement of local bylaws governing short-term rentals remain a challenge for [local governments],\" said a spokesperson for the Housing Ministry in a statement. \"This is why the premier has given the minister of housing a mandate to introduce legislation establishing new tools for local governments.\"\n\nSTRs and vacation rentals are controversial for multiple reasons. Neighbours have often complained about noise from so-called \"party houses,\" and the recent deadly Montreal fire highlighted how STRs can have few safety measures.\n\nA drone video shows a burned-out building in Old Montreal, where illegal Airbnbs were operating. (Steve Rompre/Radio-Canada)\n\n\"In Vancouver, for example … as you go online, you apply, you get the [short-term rental] licence immediately,\" Rezel said. \"Only a fraction of the licences are audited after that.\n\n\"You could just tick saying, 'OK, I meet the fire regulations', and that's it. There's no checking on that afterwards.\"\n\nRezel added that Airbnb and short-term rentals could deplete the housing stock in cities with very low vacancy rates like Vancouver and Victoria, something that has been shown in academic studies and dubbed the \"Airbnb effect.\"\n\nWhat could provincial legislation look like?\n\nIn its statement, the Housing Ministry said the government was looking at the regulations surrounding B.C.'s ride-hailing industry as it studied the regulation of STR platforms.\n\nThose regulations empower a provincial body, the Passenger Transportation Board, to license individual cab drivers while also requiring the ride-hailing apps to set a range of fares approved by them.\n\nRezel said that he supports provincial oversight of the platforms and they should bear responsibility for any infractions committed by STR owners.\n\nThe province says it will look at its regulatory regime for ride-hailing apps like Uber and Lyft as it studies any potential Airbnb regulations. (Ben Nelms/CBC)\n\nHe also said that business licences for STR operators should be public, just like they are for hotels.\n\nB.C.'s Office of the Information and Privacy Commissioner ruled in 2021 that the City of Vancouver should do just that. However, Airbnb subsequently filed a petition challenging the order, which remains before the B.C. Supreme Court.\n\n\"Licence holder names were removed for short-term rental operators due to security concerns, and with the goal of maintaining safety and protection for the operators,\" said Sarah Hicks, the City of Vancouver's chief licence inspector, in a statement.\n\nHicks also added that the city would support any further provincial oversight of STR apps.\n\nCBC News reached out to Airbnb for comment but did not hear back by deadline."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmRhaWx5bWFpbC5jby51ay9uZXdzL2FydGljbGUtMTE5MjQ3MjMvSG9tZW93bmVyLWJlYXQtZ3JhbmRtb3RoZXItZGVhdGgtbWlzdG9vay1ob3VzZS1CLUItamFpbGVkLTE0LXllYXJzLmh0bWzSAX1odHRwczovL3d3dy5kYWlseW1haWwuY28udWsvbmV3cy9hcnRpY2xlLTExOTI0NzIzL2FtcC9Ib21lb3duZXItYmVhdC1ncmFuZG1vdGhlci1kZWF0aC1taXN0b29rLWhvdXNlLUItQi1qYWlsZWQtMTQteWVhcnMuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Apr 2023 07:00:00 GMT",
        "title": "Tragic final moments of grandmother entering what she believed was B&B, before being beaten to death - Daily Mail",
        "content": "The tragic moment a 71-year-old woman entered a property she wrongly believed to be a B&B before she was dragged into the street and beaten to death has been revealed - as her attacker is jailed for 14 years.\n\nGrandmother Margaret Barnes had been visiting Barmouth in Wales from her home in Birmingham when she mistook the home of David Redfern for her accommodation, which was a few doors away, Caernarfon Crown Court heard.\n\nRedfern, 46, had drunk six or seven pints and a gin and tonic during a night out with his partner before returning home and falling asleep while watching Antiques Roadshow.\n\nBut when the couple decided to turn in for the night at around 11pm they found semi-naked Mrs Barnes lying in their bed, drinking and smoking, with a black travel case open on the floor.\n\nA row broke out and Mrs Barnes was dragged by her heels down the stairs and flung out of the house. Redfern also kicked or stamped on the frail pensioner, breaking three of her ribs and causing a catastrophic and unsurvivable injury to her liver.\n\nThe last moments before Margaret Barnes, 71, was murdered by David Redfern, 46, have been revealed, showing the grandmother hauling her small suitcase up the drive as she places her black handbag on a table outside of the door\n\nDavid Redfern, 46, (left) dragged 71-year-old Margaret Barnes downstairs by her feet after he found her asleep in a bed at his seafront home in Barmouth, North Wales, on July 11 last year\n\nMs Barnes ended up mistakenly entering Belmont House, Redfern's seaside property in Barmouth\n\nBut the 71-year-old had booked to stay in the Wavecrest B&B on Marine Parade - a few doors down from Redfern's property\n\nThe 'much-loved' wife, mother and grandmother died on the pavement outside, the court heard.\n\nRedfern denied murdering Mrs Barnes on July 11 last year but was convicted by a jury earlier this week.\n\nHanding him a mandatory life sentence for murder with a minimum 14 years before parole, Mr Justice Charles Bourne told the defendant: 'I accept you must have been very shocked to find a stranger in your house, your bedroom.\n\n'But your reaction surpasses anything that any reasonable person could imagine.\n\n'You are a large and strong man, aged 45 at the time.\n\n'She was small and slight, at least 25 years older than you, clearly affected by alcohol and unsteady on her feet.\n\n'I can understand why you might have escorted her out of your house, though a different person might have responded to this situation by trying to help her.\n\n'But the assault, a kick or stamp of sufficient force to cause a fatal injury, was a dreadful thing to do, to a defenceless elderly person.'\n\nDaughter Natalie Barnes read a victim impact statement to court describing her mother as a person who 'loved the little things in life.'\n\nPrior to the incident, Redfern had drunk six or seven pints and a gin and tonic during a night out with his partner\n\nDavid Redfern (pictured) was furious when he saw Margaret Barnes, 71, had undressed, unpacked and climbed into a bed at his house in Barmouth, North Wales\n\nShe said: 'When my mum called out for my dad and brother they were unable to save her.\n\n'As a family we will never get over what has happened. My mum didn't need to die and we don't understand why she had to.'\n\nPaying tribute to Mrs Barnes, her granddaughter Robyn Barnes said her death had left her 'completely heartbroken'.\n\nMeanwhile, in a statement read in court, her widower Raymond Barnes said his wife had left school at 15 and had been a Cadbury's packer for some 25 years and enjoyed needlework and dancing.\n\nThe couple had holidayed abroad including in China and Cape Verde, and she had a large group of female friends.\n\nRaymond said police knocked on his door on July 11 last year to inform him that she had passed away. 'We were in total shock,' he said. 'Our lives will never be the same again.'\n\nThe court heard Mrs Barnes 'simply mistook' Redfern's large seaside home for her hotel after travelling more than 100 miles to a seaside resort for a £95-a-night break.\n\nProsecutor Michael Jones said: 'It was a mistake that ultimately cost her her life.\n\n'The reason Mrs Barnes died is she had the misfortune of coming across a man who was an angry bully.'\n\nEarlier, the court heard that arrangements had been made with a local B&B for Mrs Barnes to stay in Barmouth and she had been out drinking with friends and was unsteady on her feet.\n\nWhen Redfern and his partner went upstairs to bed, Redfern at first calmly called police and asked officers to come and remove her. But things then went 'terribly wrong' after a row broke out, the court heard\n\nMrs Barnes had been booked into the Wavecrest B&B (pictured) which was several doors down on Marine Parade\n\nShe mistook her accommodation for Redfern's home and went inside and got in bed at around 10.10pm on July 10 last year.\n\nWhen Redfern and his partner went upstairs to bed, around 40 minutes later, Redfern at first calmly called police and asked officers to come and remove her.\n\nBut things then went 'terribly wrong' after a row broke out, the court heard.\n\nRedfern, a 6ft 1in man who weighed 21 stone, dragged the unwanted visitor downstairs by her heels and flung her suitcase into the street.\n\nHe also kicked or stamped on Mrs Barnes, causing the fatal injury.\n\nRedfern told the jury he had found Mrs Barnes sitting up in their bed drinking gin and tonic with her false teeth on the bedside table.\n\nOutside court, Detective Superintendent Mark Pierce of North Wales Police said: 'During a two-week trial Redfern showed no remorse, attempted to blame Margaret for his actions and subjected her family to the trauma of a two-week trial where details of the event were explored in graphic detail.\n\n'David Redfern is a cowardly, vicious bully and will now spend at least 14 years behind bars where he can reflect on what he has done.'\n\nMrs Barnes' family added: 'As a family it has been the hardest time of our lives.\n\n'It has been especially difficult for Margaret's husband who had been her partner for 56 years.\n\n'We now have some sort of closure on what has happened however no length of sentence will ever fill the void that Margaret has left behind.'"
    }
]