[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vbmZ0ZXZlbmluZy5jb20vcHVkZ3ktcGVuZ3VpbnMtbGlsLXB1ZGd5cy1jYW4tbm93LXRyYXZlbC1hY3Jvc3MtY2hhaW5zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Jan 2023 08:00:00 GMT",
        "title": "Pudgy Penguins Lil Pudgys Can Now Travel Across Chains! - NFTevening.com",
        "content": "Lil Pudgy’s, the NFT collection originating from Pudgy Penguins, are officially cross-chain! The collection is now available to other ecosystems such as Arbitrum, Polygon, and BNB Chain. Other ecosystems will be added down the line. Here’s what you should know about the recent announcement:\n\nLil Pudgys are Now Cross-Chain!\n\nPudgy Penguin’s Twitter account announced today that its collection can now travel across multiple chains. This includes Arbitrum, Polygon, and the BNB Chain. In other words, holders can bridge their Lil Pudgy’s NFT to other ecosystems. Additionally, you can transfer your Pudgy NFT by simply visiting the Pudgy Bridge website, selecting your NFT, and then choosing the chain of your choice. With this strategic move, Pudgy Penguins hopes to create unique opportunities in the future and expand its ecosystem. Moreover, the bridging feature was made possible due to the development of LayerZero Labs’ omnichain technology.\n\nPudgy Penguins Soulbound Token\n\nFurthermore, Pudgy Penguins is utilizing the new soulTransport technology to issue Soulbound tokens. To specify, soulTransport technology will automatically reward you with a soulbound token based on the chain you select for bringing your Lil Pudgy NFT. Bridgers can expect to receive their SBT within 5 minutes of bridging.\n\nIt’s worth noting that only the Lil Pudgy’s will be able to travel between chains. However, the Pudgy Penguins collection may be able to do the same in the future."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3B1ZGd5LXBlbmd1aW5zLWxhdW5jaGVzLWNyb3NzLWNoYWluLXRyYW5zYWN0aW9ucy1mb3ItcG9seWdvbi1ibmItY2hhaW4tYXJiaXRydW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Jan 2023 08:00:00 GMT",
        "title": "Pudgy Penguins launches cross-chain transactions for Polygon, BNB Chain, Arbitrum - CryptoSlate",
        "content": "Pudgy Penguins announced that it is using Layer-0 to allow cross-chain transactions on adding Polygon (MATIC), BNB Smart Chain, and Arbitrum (ARBI) to improve access for people beyond the Ethereum (ETH) blockchain.\n\nThe decision was made to increase easy access to the NFTs and improve the existing infrastructure, according to the announcement. In addition, the project aims at higher interoperability across chains and protocols built on them. The announcement states:\n\n“This is just the start of our efforts to expand and distribute the reach of Pudgy Penguins IP, and we’ll always be looking for new ways to do this. By expanding our horizons to more blockchains, we open up possibilities of working with various businesses that work on those chains.”\n\nEase of access and capacity\n\nIn the last week of December 2022, the transaction volume of Pudgy Penguins surged by 599%. Currently, the penguins experience almost 2 million transactions a day, which is hard on the ETH infrastructure and pushes gas fees up by almost 1,000%.\n\nThe project team also said they expect the next wave of users to be “hundreds of millions.” This is why the project decided to promote ease of access.\n\nThe three chains were selected “due to their rapidly growing usage and exposure.” After the expansion to Polygon, BNB Chain, and Arbitrum is completed, the project will continue to include more chains into its ecosystem.\n\nSoulbound token\n\nThe project team is also launching soulbound tokens to help facilitate cross-chain transactions. A total of three soulbound tokens will be issued to Pudgy Penguin NFT holders, each corresponding to one chain.\n\nDepending on the chain the penguin holders bridge to, a unique commemorative soulbound token representing the bridge will appear in the user’s wallets within five minutes.\n\nMentioned in this article"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMS8yNi9jcnlwdG8tYW5hbHlzdC13aG8tbmFpbGVkLWJpdGNvaW5zLTIwMTgtYm90dG9tLXdhcm5zLWJpbmFuY2UtY29pbi1hbmQtb25lLWV0aGVyZXVtLXJpdmFsLXByaW1lZC1mb3ItcHVsbGJhY2tzL9IBkwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMS8yNi9jcnlwdG8tYW5hbHlzdC13aG8tbmFpbGVkLWJpdGNvaW5zLTIwMTgtYm90dG9tLXdhcm5zLWJpbmFuY2UtY29pbi1hbmQtb25lLWV0aGVyZXVtLXJpdmFsLXByaW1lZC1mb3ItcHVsbGJhY2tzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Jan 2023 08:00:00 GMT",
        "title": "Crypto Analyst Who Nailed Bitcoin’s 2018 Bottom Warns Binance Coin and One Ethereum Rival Primed for Pullbacks - The Daily Hodl",
        "content": "A popular cryptocurrency analyst and trader is expressing near-term bearish sentiment for Binance Coin (BNB) and one Ethereum (ETH) competitor.\n\nStarting with Binance Coin, the pseudonymous analyst Smart Contracter tells his 219,100 Twitter followers that the fifth-largest crypto asset by market cap could plummet by about 12% from current levels.\n\nFrom the charts, it appears that the trader who applies the Elliott Wave Theory in his technical analysis is suggesting that Binance Coin has completed a five-wave bullish pattern and is poised to correct up to around $265, a level which coincides with the 61.8% Fibonacci level from the year-to-date high of $323.\n\n“BNB coming down to minimum $265 in my opinion, is definitely on my radar for shorts on any bounce after daily close.”\n\nBinance Coin is trading for $300 at time of writing.\n\nNext up is Ethereum competitor Avalanche (AVAX). According to Smart Contracter, Avalanche could correct by up to 30% in February after completing a five-wave bullish pattern.\n\nFrom Smart Contracter’s charts, it appears that Avalanche could fall to just below $14, an area that coincides with the 61.8% Fibonacci level from the year-to-date high of $18.97.\n\n“A lot of “majors” [large cap crypto assets], if we can call them that, have now done clean clear 5-wave rises on daily, not all of them, but enough.\n\nAVAX is one I think we can potentially see 25-30% pullbacks begin over the course of the next month.\n\nHate to be the bearer of bad news but it is what it is.”\n\nAvalanche is trading for $17.34 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiqAFodHRwczovL3d3dy5jaW5jaW5uYXRpLmNvbS9zdG9yeS9lbnRlcnRhaW5tZW50LzIwMjMvMDEvMjYvc2l0Y29tLXN1aXRlcy1haXJibmItcGxlYXNhbnQtcmlkZ2Utb2hpby1yZWNyZWF0ZXMtdHYtZnJpZW5kcy1zZWluZmVsZC1zY2hpdHRzLWNyZWVrLWdvbGRlbi1naXJscy82OTgyNzE3NzAwNy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Jan 2023 08:00:00 GMT",
        "title": "Sitcom Suites Cincinnati: This Airbnb recreates iconic TV homes - The Cincinnati Enquirer",
        "content": "\"Where's the naked guy?\"\n\nThis question, a reference to a nudist character from the 1990s sitcom \"Friends,\" was directed toward Brenda and Otto Baum, owners of a television-themed Airbnb in Pleasant Ridge called the Sitcom Suites. It is just one of many inquiries they've received about the short-term rental designed to look like Monica and Rachel's New York City apartment, according to Brenda.\n\nThe husband and wife team have been renovating a fourplex, located at 5904 Ridge Ave., since October, making its rentals look like iconic television sets from the shows \"Seinfeld,\" \"Schitt's Creek,\" \"Golden Girls\" and, of course, \"Friends.\"\n\nBengals:Joe Burrow wore an amazing pair of 'Seinfeld' sweatpants after beating Bills\n\nReal estate:The most unusual Airbnbs (or other rentals) in Ohio and Kentucky\n\nNeed a break? Play the USA TODAY Daily Crossword Puzzle.\n\nBrenda said the inspiration for the Sitcom Suites came during the height of the COVID-19 pandemic, when they would spend hours watching old reruns during quarantine. They eventually asked themselves, \"Wouldn't it be fun to recreate it?\"\n\nShe said they started with the \"Friends\" apartment, and the project took off from there.\n\n\"I feel like we should share this, it's cool ... I thought it was just too fun to pass up,\" Brenda said.\n\n'There are certain things that you had to nail'\n\nThe one-bedroom, one-bathroom units accommodate four people and come with king-size beds, pullout couches and fully functioning kitchens. The rentals also include replicas of furnishings and decor from each series.\n\nBrenda said she traveled all over the region searching for passable dupes and custom-made pieces, some of which contain a few surprises. Each unit also comes with studio lights to mimic a stage, fake doors resembling each show's entrance and custom-made neon signs.\n\n\"There are certain things that you had to nail,\" Brenda explained. \"Luckily, I had a friend who reached out, and she specializes in repeat patterns and said, 'I can do any wallpaper, fabric for you.'... So, there's actually some Easter eggs. She's hidden some really fun details.\"\n\nThe Baums, who are residents of the neighborhood, already owned the property and several others around town, making the project relatively easy to complete given their proximity to the location and the ability to oversee the construction.\n\nFor subscribers:These Ohio houses were featured on Zillow Gone Wild in 2022. Are they still for sale?\n\n\"I just love Pleasant Ridge so much, and that's why we had to have it here. I hope that more people come and fall in love with our little part of Cincinnati,\" Brenda said.\n\nThe couple said they plan to have all the units completed and available for booking by April 1. The \"Friends\" and \"Seinfeld\" units are already available via the Airbnb website. Pricing starts a $175 per night. Customers can choose between booking a single apartment or the entire building."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZmluYm9sZC5jb20vdG9wLTUtY3J5cHRvY3VycmVuY2llcy1yYW5rZWQtYnktcm9pLXNpbmNlLWluaXRpYWwtY29pbi1vZmZlcmluZy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Jan 2023 08:00:00 GMT",
        "title": "Top 5 cryptocurrencies ranked by ROI since initial coin offering - Finbold - Finance in Bold",
        "content": "The cryptocurrency market is riding on the wave of renewed bullish optimism that started at the turn of the year, but some cryptocurrencies have been recording continuous positive returns ever since their initial coin offering (ICO), including some less-than-expected assets.\n\nSpecifically, Tom Dunleavy, the senior research analyst at the crypto intelligence provider Messari, has shared the list of the top crypto assets ranked by their return on investment (ROI) since their ICO as per the data retrieved from the crypto analytics platform CryptoRank on January 25.\n\nTop 5 assets ranked by ROI since ICO. Source: CryptoRank\n\nAmong the expected well-known participants in the crypto field, some digital assets have made a surprise appearance thanks to their ROI since introductory fundraising, climbing to the highest positions on the list of the top cryptos by this indicator.\n\nEthereum (ETH)\n\nThe ultimate winner on the list, Ethereum (ETH) has grown its ROI 5,163 times since its ICO on July 22, 2014, taking into account that its original sale price was a measly $0.311 and, at the time of publication, it was changing hands at the price of $1,606.\n\nIts current price represents a daily increase of 4.94%, in addition to gaining 5.97% across the past week, and as much as 31.06% over the previous 30 days, whereas the market capitalization of Ethereum stood at $196.60 billion.\n\nEthereum 30-day price chart. Source: Finbold\n\nBNB (BNB)\n\nThe native token of the cryptocurrency trading platform Binance, Binance Coin (BNB) was originally sold for $0.150 apiece during its ICO on July 1, 2017, whereas, at press time, it was trading at the price of $304.26, recording an ROI gain of 2,028 times.\n\nMeanwhile, Binance Coin has grown its price by 1.3% on the day, 5.79% over the previous week, and 24.87% across the past 30 days, with a market cap of $48.11 billion, according to the data retrieved by Finbold on January 26.\n\nBNB 30-day price chart. Source: Finbold\n\nIOTA (IOTA)\n\nIn third place is IOTA (IOTA), which held its initial coin offering on November 25, 2015, when its token was available for purchase at the price of $0.00059, since then growing its ROI 384 times, and currently trading at the price of $0.226.\n\nPresently, IOTA’s price demonstrates an increase of 3.5% over the last 24 hours, in addition to the growth of 12.69% during the previous week, and the accumulated monthly gain of 29.23%, while its market cap stood at $630.65 million.\n\nIOTA 30-day price chart. Source: Finbold\n\nPolygon (MATIC)\n\nAt the same time, Polygon (MATIC) recorded ROI worth 380 times since its original fundraising on January 1, 2018, at the time going for the price of $0.00263, and now changing hands at the price of $0.999, with a market cap of $8.68 billion.\n\nThe price of the Polygon token at press time reflects an increase of 5.21% over the last 24 hours, 6.13% compared to the seven days before, as well as 22.69% in terms of its gains over the previous 30 days, as the charts demonstrate.\n\nMATIC 30-day price chart. Source: Finbold\n\nCOCOS BCX (COCOS)\n\nSurprisingly, the blockchain platform for metaverse and digital games COCOS BCX (COCOS) made it to number five on the list, thanks to achieving an ROI of 275 times worth its original selling price of $0.0023 during the initial fundraising, which ended on August 1, 2018.\n\nAt the time of publication, COCOS was trading at $0.633, up 2.18% over the previous day, adding up to its weekly gains of 11.37% and monthly advances of 18.19%, despite its lower market cap compared to the other big ROI gainers – $44.9 million.\n\nCOCOS 30-day price chart. Source: Finbold\n\nWhether these cryptocurrencies will manage to retain their strong ROI in spite of the unfavorable developments and atmosphere in the crypto market and the wider macroeconomic landscape, remains to be seen.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    }
]