[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3JlcG9ydC1maW5kcy10aGF0LWJpbmFuY2Utb25seS1kaXN0cmlidXRlZC0xMC1vZi1wcm9taXNlZC1ibmItdG9rZW5zLWR1cmluZy1pY28v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 05 Oct 2023 07:00:00 GMT",
        "title": "Report finds that Binance only distributed 10% of promised BNB tokens during ICO - CryptoSlate",
        "content": "An investigative report published in Forbes on Oct. 5 found that Binance may have significantly overstated the success of its initial coin offering (ICO) for Binance Coin (BNB) in 2017.\n\nAccording to the reporting, Binance founder and CEO Changpeng Zhao began to conceptualize BNB and circulate a white paper for the asset in June 2017. Binance finally completed BNB’s ICO that July, at which time Zhao declared the offering a success. Zhao also made more specific claims: he stated that the ICO had raised $15 million in total and said that BNB’s price averaged $0.15 per token.\n\nBinance’s white paper also set out details about token allocations that indicated it would mint 200 million BNB tokens. That total reserved 80 million tokens for Binance and its executives, 20 million for angel investors, and 100 million for ICO investors.\n\nHowever, according to the report, the actual allocations tell a different story, finding that ICO investors actually received 10.78 million BNB rather than 100 million BNB — about one-tenth of the amount they supposedly received. It was also suggested that Binance raised close to $5 million during its offering rather than $15 million.\n\nFurthermore, angel investors received a doubled token distribution that actually amounted to 40 million, rather than 20 million, BNB tokens.\n\nBinance could control billions of dollars in BNB\n\nThe revised sale results mean that Binance may hold a massive amount of value — up to 65 million unsold tokens in addition to its own 80 million BNB allocation.\n\nBlockchain analysis showed that Binance and its members continue to control the extra tokens. It concluded:\n\n“All of the suspected Binance wallets that we list held 63.1 million units of BNB worth $15.7 billion. Combined with … known wallets, Binance controls 116.9 million tokens worth $27.3 billion.”\n\nOverall, BNB has a market capitalization of $33 billion and ranks as the fourth-largest cryptocurrency.\n\nBinance did not respond to CryptoSlate‘s request for comment by press time.\n\nMentioned in this article"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnBlZGlhLm9yZy9wcmljZS1hbmFseXNpcy9ibmItcHJpY2UtYW5hbHlzaXMtc2VsbGVycy1kZWxheS1iaW5hbmNlLXRha2luZy1vZmYtdG8tMzAwL9IBZGh0dHBzOi8vY29pbnBlZGlhLm9yZy9wcmljZS1hbmFseXNpcy9ibmItcHJpY2UtYW5hbHlzaXMtc2VsbGVycy1kZWxheS1iaW5hbmNlLXRha2luZy1vZmYtdG8tMzAwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 05 Oct 2023 07:00:00 GMT",
        "title": "BNB Price Analysis: Sellers Delay Binance Taking Off To $300! - Coinpedia Fintech News",
        "content": "Sohrab is a passionate cryptocurrency news writer with over five years of experience covering the industry. He keeps a keen interest in blockchain technology and its potential to revolutionize finance. Whether he's trading or writing, Sohrab always keeps his finger on the pulse of the crypto world, using his expertise to deliver informative and engaging articles that educate and inspire. When he's not analyzing the markets, Sohrab indulges in his hobbies of graphic design, minimal design or listening to his favorite hip-hop tunes.\n\nStory Highlights BNB coin price displays a falling wedge breakout in the daily chart.\n\nBinance price struggles to overcome the selling pressure at the $219-$220 mark.\n\nThe $220 breakout can surge the BNB price higher to the $250 mark.\n\nTaking breaks within the consolidation range, the downtrend continuation in BNB price affects the market value drastically. With a fall of 41% between April 18th and September 11th 2023, the Binance coin price action forms a falling wedge pattern.\n\nMoreover, the declining trend in the 50-day EMA supports the resistance trendline and the bearish side. Nevertheless, the recent recovery rally fuels the altcoin price and leads to the breakout pattern, proving bullish Binance price predictions right.\n\nDespite the resistance trendline breakout of the falling wedge, the BNB price struggles to prolong the breakout rally. With sellers dominating the $219-$220 mark, the sideways trend continues for Binance.\n\nMoreover, the 50-day EMA adds additional bearish support to keep the uptrend in check. As per the Binance coin price action, the possibility of a double top arises as the sellers push back the prices for the second time from $219.\n\nCurrently, the BNB price trades at $212 with an intraday fall of 0.56% and warns of completing the bearish pattern with a neckline at $206-205. Completing the bearish pattern will increase the bearish load on the psychological mark at $200, which may nullify the wedge breakout.\n\nTechnical Indicators:\n\nEMA: With bears in control of the 50-day EMA, the downtrending average line stands strong against bullish comebacks.\n\nDMI indicator: The ADX line falls sharply, with a declining trend reflecting a major loss in trend momentum. Further, the DI lines remain indecisive for a long time but display a potential bearish crossover.\n\nWill Binance(BNB) Price Reach $250?\n\nConsidering the uptrend in the overall market continues, the BNB price may capitalize on the recovery and bounce back from $200. Further, the uptrend may crack above the $220 mark, and the 50-day EMA may prolong the uptrend. In such a case, the uptrend may reclaim $300 soon.\n\nOn the flip side, a downtrend below $200 will plunge the Binance coin price lower to new lows in 2023. The key support levels below $200 are present at $180 and $150."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vcHJvdG9zLmNvbS9iaW5hbmNlLWRvZXNudC1rbm93LWhvdy1tdWNoLWJuYi1pdC1oYXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 05 Oct 2023 07:00:00 GMT",
        "title": "Binance doesn't know how much BNB it has - Protos",
        "content": "BNB, the token associated with crypto exchange Binance, has attracted additional scrutiny with a recent Forbes investigation revealing that the original Initial Coin Offering (ICO) was a flop.\n\nThe report, produced in collaboration with Gray Wolf Analytics and Inca Digital, alleges that less than 11 million of the 100 million tokens on offer were actually sold in the sale. After this failure, Binance apparently chose to double the allocation for angel investors like Matthew Roszak and Roger Ver.\n\nThe report further alleges that Binance “likely raised less than $5 million,” significantly less than the $15 million that Changpeng Zhao, the founder and chief exec, bragged about on LinkedIn.\n\nThe end result of this failed ICO was, allegedly, that Binance ended up with vastly more BNB than it had planned, and as BNB has become more valuable over time, this has resulted in large financial benefits for the company.\n\nForbes highlights in its reporting that this could be because investors chose to keep BNB on the exchange and therefore it was not distributed in a recognizable way. Forbes and Gray Wolf feel this is an unlikely explanation “because investors would typically not want to keep it on an exchange whose security had not been established.”\n\nHowever, Protos does want to highlight that one of the primary advertised benefits of BNB was that it would provide a discount on Binance fees and would be used as ‘gas’ for Binance advanced features, so many purchasers would be incentivized to keep the assets on the exchange.\n\nEven today, there are still questions about the distribution of BNB. Deso, a pseudonymous cryptocurrency researcher, recently highlighted that Binance’s most recent ‘proof-of-reserves’ currently shows only approximately 33 million of the total 150 million BNB are stored on Binance, against 29 million in customer balances.\n\nIn November, Binance released a transparency report that shared many of its hot and cold wallet addresses. Confusingly, these addresses hold far more than the proof of reserves would seem to indicate.\n\nAddress Approximate Number of BNB bnb1edrs5cukhx060e02u98v9j8spum7vhuqg9ctxd 30 million bnb142q467df6jun6rt5u2ar58sp47hm5f9wvz2cvg 17 million bnb1u2agwjat20494fmc6jnuau0ls937cfjn4pjwtn 4.5 million bnb1lsmt5a8vqqus5fwslx8pyyemgjtg4y6ugj308t 500 thousand bnb1fnd0k5l4p3ck2j9x9dp36chk059w977pszdgdz 29 thousand bnb1jxfh2g85q3v0tdq56fnevx6xcxtcnhtsmcu64m 37 thousand 0x8894e0a0c962cb723c1976a4421c95949be2d4e3 255 thousand 0xbe0eb53f46cd790cd13851d5eff43d12404d33e8 393 thousand 0xf977814e90da44bfa03b6295a0616a897441acec 393 thousand\n\nRead more: Disaster relief or marketing ploy? Binance airdrops BNB to users in Morocco and Libya\n\nThis seems to add up to approximately 53 million tokens, or approximately 160% of the total it claims to hold. Protos has reached out to Binance to clarify this discrepancy between its proof-of-reserves and its previously disclosed holding addresses. We will update this if the company responds with information that clarifies the discrepancy.\n\nBinance-branded cryptocurrency assets have previously displayed on-chain behavior that contradicted Binance communications. Binance has previously failed to keep adequate collateral segregated for its ‘Binance-pegged Binance Dollar.’\n\nBinance is currently facing multiple legal and regulatory issues, including a Securities and Exchange Commission lawsuit and a Commodities Future Trading Commission lawsuit, as well as reportedly having prosecutors prepared to indict on money laundering charges.\n\nGot a tip? Send us an email or ProtonMail. For more informed news, follow us on X, Instagram, Bluesky, and Google News, or subscribe to our YouTube channel."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vcHJvdG9zLmNvbS9iaW5hbmNlLWRvZXNudC1rbm93LWhvdy1tdWNoLWJuYi1pdC1oYXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 05 Oct 2023 07:00:00 GMT",
        "title": "Binance doesn't know how much BNB it has - Protos",
        "content": "BNB, the token associated with crypto exchange Binance, has attracted additional scrutiny with a recent Forbes investigation revealing that the original Initial Coin Offering (ICO) was a flop.\n\nThe report, produced in collaboration with Gray Wolf Analytics and Inca Digital, alleges that less than 11 million of the 100 million tokens on offer were actually sold in the sale. After this failure, Binance apparently chose to double the allocation for angel investors like Matthew Roszak and Roger Ver.\n\nThe report further alleges that Binance “likely raised less than $5 million,” significantly less than the $15 million that Changpeng Zhao, the founder and chief exec, bragged about on LinkedIn.\n\nThe end result of this failed ICO was, allegedly, that Binance ended up with vastly more BNB than it had planned, and as BNB has become more valuable over time, this has resulted in large financial benefits for the company.\n\nForbes highlights in its reporting that this could be because investors chose to keep BNB on the exchange and therefore it was not distributed in a recognizable way. Forbes and Gray Wolf feel this is an unlikely explanation “because investors would typically not want to keep it on an exchange whose security had not been established.”\n\nHowever, Protos does want to highlight that one of the primary advertised benefits of BNB was that it would provide a discount on Binance fees and would be used as ‘gas’ for Binance advanced features, so many purchasers would be incentivized to keep the assets on the exchange.\n\nEven today, there are still questions about the distribution of BNB. Deso, a pseudonymous cryptocurrency researcher, recently highlighted that Binance’s most recent ‘proof-of-reserves’ currently shows only approximately 33 million of the total 150 million BNB are stored on Binance, against 29 million in customer balances.\n\nIn November, Binance released a transparency report that shared many of its hot and cold wallet addresses. Confusingly, these addresses hold far more than the proof of reserves would seem to indicate.\n\nAddress Approximate Number of BNB bnb1edrs5cukhx060e02u98v9j8spum7vhuqg9ctxd 30 million bnb142q467df6jun6rt5u2ar58sp47hm5f9wvz2cvg 17 million bnb1u2agwjat20494fmc6jnuau0ls937cfjn4pjwtn 4.5 million bnb1lsmt5a8vqqus5fwslx8pyyemgjtg4y6ugj308t 500 thousand bnb1fnd0k5l4p3ck2j9x9dp36chk059w977pszdgdz 29 thousand bnb1jxfh2g85q3v0tdq56fnevx6xcxtcnhtsmcu64m 37 thousand 0x8894e0a0c962cb723c1976a4421c95949be2d4e3 255 thousand 0xbe0eb53f46cd790cd13851d5eff43d12404d33e8 393 thousand 0xf977814e90da44bfa03b6295a0616a897441acec 393 thousand\n\nRead more: Disaster relief or marketing ploy? Binance airdrops BNB to users in Morocco and Libya\n\nThis seems to add up to approximately 53 million tokens, or approximately 160% of the total it claims to hold. Protos has reached out to Binance to clarify this discrepancy between its proof-of-reserves and its previously disclosed holding addresses. We will update this if the company responds with information that clarifies the discrepancy.\n\nBinance-branded cryptocurrency assets have previously displayed on-chain behavior that contradicted Binance communications. Binance has previously failed to keep adequate collateral segregated for its ‘Binance-pegged Binance Dollar.’\n\nBinance is currently facing multiple legal and regulatory issues, including a Securities and Exchange Commission lawsuit and a Commodities Future Trading Commission lawsuit, as well as reportedly having prosecutors prepared to indict on money laundering charges.\n\nGot a tip? Send us an email or ProtonMail. For more informed news, follow us on X, Instagram, Bluesky, and Google News, or subscribe to our YouTube channel."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vdGhlY3VycmVuY3lhbmFseXRpY3MuY29tL2FsdGNvaW5zL2JpbmFuY2UtY29pbi1ibmItd2Vla2x5LWFuYWx5c2lzLXN0dXJkeS1zdXBwb3J0LWF0LTIxMC1hbWlkc3QtcmVzaXN0YW5jZS1hdC0zNTAtNzM4MDnSAYMBaHR0cHM6Ly90aGVjdXJyZW5jeWFuYWx5dGljcy5jb20vYWx0Y29pbnMvYmluYW5jZS1jb2luLWJuYi13ZWVrbHktYW5hbHlzaXMtc3R1cmR5LXN1cHBvcnQtYXQtMjEwLWFtaWRzdC1yZXNpc3RhbmNlLWF0LTM1MC03MzgwOS9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 05 Oct 2023 07:00:00 GMT",
        "title": "Binance Coin (BNB) Weekly Analysis: Sturdy Support at $210 Amidst Resistance at $350 - The Currency Analytics",
        "content": "In the ever-evolving world of cryptocurrency, Binance Coin (BNB) has been making headlines with its recent price movements. To provide a simplified overview for a broader audience, let’s delve into the latest updates surrounding BNB.\n\nA Remarkable 960-Day Trend\n\nFor a staggering 960 consecutive days, BNB has exhibited remarkable stability, primarily hovering around the $210 price point. This prolonged period of price consistency has captured the attention of investors and crypto enthusiasts alike. It’s a trend that speaks to the resilience of Binance Coin in an often volatile market.\n\nRecent Signs of Life\n\nAround the week of September 11th to 18th, BNB offered an exciting twist to its ongoing narrative. Within the familiar $210 support area, a notable bounce occurred, marking this event with a vivid green icon on price charts. This bounce has triggered a wave of interest among cryptocurrency enthusiasts, as it hints at potential developments on the horizon.\n\nThe Long-Lasting Stability of Binance Coin\n\nTo comprehend the significance of Binance Coin’s stability, it’s essential to recognize the broader context of the cryptocurrency market. While digital currencies are notorious for their price volatility, BNB’s steadfastness around the $210 mark for almost three years is nothing short of extraordinary.\n\nInvestors in the cryptocurrency space are accustomed to wild price fluctuations, often causing anxiety and uncertainty. Binance Coin, however, has emerged as a beacon of stability. This extended period of relative price equilibrium has not only inspired confidence but also raised questions about what may lie ahead.\n\nThe September Bounce\n\nThe week of September 11th to 18th breathed new life into BNB. During this period, the cryptocurrency experienced a bounce within the $210 support area. This event, symbolized by a conspicuous green icon on price charts, generated substantial excitement within the crypto community.\n\nSuch a bounce is not merely a market anomaly but often a precursor to significant developments. Traders and investors pay close attention to these shifts in sentiment as they can offer valuable insights into the cryptocurrency’s short-term and long-term prospects.\n\nWhat Does the Bounce Signify?\n\nWhile cryptocurrency markets are inherently unpredictable, market analysts and enthusiasts have offered several theories to explain the recent bounce in Binance Coin’s price.\n\n1. Market Sentiment: Positive sentiment around Binance Coin, fueled by its impressive track record, may have contributed to the bounce. Investors who see BNB as a reliable asset may have taken advantage of the temporary dip in price to accumulate more.\n\n2. Utility and Use Cases: Binance Coin’s utility within the Binance ecosystem continues to grow. With various applications, including reduced trading fees on the Binance exchange, its value proposition has strengthened. This could have attracted new investors seeking to participate in the Binance ecosystem.\n\n3. Market-wide Factors: Cryptocurrency markets are highly interconnected. Developments in other cryptocurrencies or broader macroeconomic events can impact the entire market. The bounce in BNB may have been influenced by such external factors.\n\n4. Technical Analysis: Traders and analysts often rely on technical indicators and chart patterns to make investment decisions. The bounce could have been triggered by specific technical signals, prompting traders to enter or exit positions.\n\nThe Road Ahead for Binance Coin\n\nAs Binance Coin continues to make headlines, the question on everyone’s mind is, “What lies ahead for BNB?”\n\nPrice Exploration: With the recent bounce from the $210 support area, traders will be closely monitoring whether BNB can break out of this range. A sustained move above this level could signal a bullish trend, while a drop below might raise concerns. Market Developments: Binance, the exchange behind Binance Coin, is known for its innovative approach. Any upcoming developments or announcements from the Binance team could have a significant impact on BNB’s price and adoption. Regulatory Environment: The cryptocurrency market is subject to regulatory changes in various jurisdictions. Investors will be keeping a watchful eye on how regulations might affect Binance Coin’s trading and use. Crypto Ecosystem: Binance Coin’s utility extends beyond just trading. Its integration into various aspects of the Binance ecosystem, such as decentralized finance (DeFi) projects, can influence its long-term value.\n\nIn conclusion, Binance Coin’s remarkable 960-day trend of stability around the $210 mark has set it apart in the world of cryptocurrency. The recent bounce within this support area has sparked optimism and speculation about its future. As the crypto market continues to evolve, BNB’s performance remains a topic of great interest and intrigue, with many eager to see where this journey will lead. Cryptocurrency enthusiasts and investors should stay vigilant, as the digital landscape is ever-changing, and surprises can happen at any moment."
    }
]