[
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vZGFpbHljb2luLmNvbS9nYXZpbi13b29kLXNlcmlhbC1jcnlwdG8tZm91bmRlci_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 Feb 2023 08:00:00 GMT",
        "title": "Gavin Wood: The Serial Crypto Founder - DailyCoin",
        "content": "In 2011, Wood read about Bitcoin but was largely uninterested in it. In his own words, he was “focusing too much on the currency aspect” rather than the technology behind it. However, he revisited the idea of the blockchain in 2013 and began to see real potential in it. He saw that possibilities were opening up between the field of ICT and game theory, and he wanted to be an active player.\n\nThat same year, a mutual friend introduced Wood to Vitalik Buterin. At the time, Buterin had only recently published the Ethereum whitepaper, and Ethereum was still a theory. Immediately after Wood got his hands on the Ethereum whitepaper, he started building its codebase.\n\nBy early January 2014, Wood had already built the first Ethereum client. It was a proof of concept of sorts and was the first sign that Ethereum could be built. And Wood had built everything all alone. He also wrote the Ethereum Yellow paper, which specified the Ethereum virtual machine. It was the first formal specification of a blockchain’s state machine to be published.\n\nWhen the Ethereum team disbanded over questions surrounding Ethereum’s future, Wood sided with the winning faction. Over the next two years, he focused mainly on Ethereum and built much of the architecture supporting it. This includes the general platform, the initial solidity design (Ethereum’s smart contract programming language), and most of the C++ client."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLW5ld3MtcmFsbHktd2hhdHMtY29tbW9uLWJldHdlZW4tbm93LWFuZC1sYXN0LWJlYXItcnVuL9IBWGh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLW5ld3MtcmFsbHktd2hhdHMtY29tbW9uLWJldHdlZW4tbm93LWFuZC1sYXN0LWJlYXItcnVuL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 Feb 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) News: What's Common This Rally, Last Bear Run - CoinGape",
        "content": "Ethereum News: In the context of recovery in the macro environment and the recent crypto price rally, Ethereum (ETH) is among the top cryptocurrencies that stand to benefit the most from the ongoing momentum. This is because the timing of crypto rally bodes well for speculation around the upcoming Shanghai upgrade. Interestingly, historical data on ETH price points to similar patterns between the bear run of 2020 and the current scenario. However, it remains to be seen how the crypto market would react in the short term.\n\nAlso Read: Bone ShibaSwap (BONE) To Rank In Top 100?: SHIB Community Bullish\n\nadvertisement\n\nETH To The Moon?\n\nAccording to Bitcoinsensus, ETH’s price action is replicating the pattern that formed basis for last bull run. Essentially, the support strength is accumulated for the next Ethereum bullish breakout in the long term. Between 2019 and 2020, ETH price went through a triangular movement in fluctuation before following an upward curve going into the 2021 bull run. Hence, a similar price momentum can’t be ruled out given the current macro scenario and the Ethereum development scene.\n\n“Ethereum is forming similar price action as it formed in the last bear market. Are we in the final months of bearishness?”\n\nShort term projections for the U.S. Dollar Index (DXY) are also in favor of the crypto market, as the dollar finds resistance way below the current level of 102 at 90. The Ethereum Shanghai upgrade is scheduled for March 2023. This will be the biggest upgrade on the network after The Merge was completed in September 2022. Against the run of market expectations, The Merge failed to spur a price growth in not just Ethereum but other cryptocurrencies.\n\nAlso Read: Dogecoin News: DOGE To Get Forked By This Ethereum Competitor?\n\nAs of writing, ETH price stands at $1,678, up 0.61% in the last 24 hours, according to CoinGape price tracker."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1icmVha3MtaW50by0xNzAwLXJhbmdlLWJyaWVmbHktYXMtdHJhZGVycy1zY3JhbWJsZS1mb3ItcHJvZml0L9IBYWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1icmVha3MtaW50by0xNzAwLXJhbmdlLWJyaWVmbHktYXMtdHJhZGVycy1zY3JhbWJsZS1mb3ItcHJvZml0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 Feb 2023 08:00:00 GMT",
        "title": "Ethereum breaks into $1,700 range briefly as traders scramble for profit - AMBCrypto News",
        "content": "2 February saw ETH hit $1,713 for the first time in four months.\n\nThe inflow of ETH into exchanges exceeds the outflow signifying sell pressure.\n\nEthereum [ETH] experienced a price increase before the close of the trading session on 2 February, bringing it to its highest level in more than four months. How did traders respond to it, and how might their responses impact the future price of ETH?\n\nRead Ethereum’s (ETH) Price Prediction 2023-24\n\nBreaking resistance briefly\n\nThe daily timeframe price chart for Ethereum [ETH] may not have indicated any significant price movement on 2 February. When that timeframe is examined more closely, it could be observed that ETH broke the $1,700 barrier and briefly traded at $1,713.\n\nFor the first time in more than four months, the price exceeded $1,500, which prompted traders’ reactions.\n\nThe asset was trading at roughly $1,640 as of the time of this writing, and it appeared to have lost a small value. The price was still trading above the support line that was established near $1,500 despite the modest value drop.\n\nAdditionally, according to the Relative Strength Index, Ethereum was still moving in a bullish direction. As of the time of writing, the RSI was above 60 on a daily timeframe.\n\nScramble for profit\n\nThe Netflow measure may be a more accurate reflection of how investors reacted to Ethereum’s (ETH) modest gain on 2 February. The observed Netflow data shows that on 2 February, more Ethereum (ETH) flowed into exchanges than leaving them.\n\nSellers were ready to cash in since the inflow was over 29,000. The observed influx, however, was consistent; there was no noticeable surge.\n\nThe lack of a spike could indicate that the inflow is insufficient to affect the price of ETH significantly. At the time of this writing, the trend line had turned, and outflow exceeded inflow.\n\nExchanges see 11% of the total supply as supply in profit rise\n\nCoinMarketCap estimates that there is currently more than 122 million Ether in circulation. The amount now available on exchanges represents about 11% of the overall supply.\n\nEven though there was a scramble to cash in when the price of ETH spiked, this suggests that only a tiny fraction of the overall supply made its way to trading platforms.\n\nLooking at Glassnode’s Percent Supply in Profit also revealed that a sizable portion of the ETH supply is currently earning interest. Over 64% of the supply, as seen in the observed graph, was profitable as of this writing.\n\nIs your portfolio green? Check out the Ethereum Profit Calculator\n\nShort-term investors may be tempted to cash out their ETH holdings now that the price is at its highest point in months. Observed indicators suggest that more ETH are being held than sold, so this development should not have a profound effect on the price of ETH."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDIvMDQvaG93LXRvLWNob29zZS10aGUtYmVzdC1ldGhlcmV1bS10cmFkaW5nLWJvdC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 Feb 2023 08:00:00 GMT",
        "title": "How to Choose the Best Ethereum Trading Bot? - Crypto Times",
        "content": "When it comes to trading with cryptocurrencies, it’s important to choose a trading platform that suits your needs. While some platforms are designed for more advanced traders, others are user-friendly and can help beginners make the most of their investments. The year 2022 has brought the crypto market to a halt and is now paving the way for a bull run in 2023.\n\nCrypto predictions for 2023 suggest that the prices of cryptocurrencies, especially Bitcoin and Ethereum, will pick up by Q3 as the market has bottomed out and has a tendency to rebound. It becomes important to prepare your portfolio for upcoming bullish trends. Therefore, this article will help you choose the best Ethereum trading bot, which you can also consider when selecting a bot to trade any cryptocurrency.\n\nBefore we get into how to choose the best Ethereum trading bot, let’s understand what a crypto trading bot is.\n\nWhat is a Crypto Trading Bot?\n\nA crypto trading bot is automated software with special algorithms that analyze the data of crypto exchanges and offers additional tools to make it simpler for you to execute trades. Simply put, crypto trading bots automatically execute orders based on your trading strategy without manual intervention.\n\nAs such, automated trading saves time as you don’t need to gawk at your screen 24/7, and crypto bots in a way give you an edge over manual traders. You can also check out these top 10 crypto trading bots for 2023 to step up your trading game. Moving on, let’s learn what factors you should tick off to choose the best Ethereum trading bot to maximize your returns.\n\nFeatures to Consider when choosing an Ethereum trading bot\n\nWhen choosing an Ethereum trading bot, it’s important to look for options that can handle a variety of markets. Traders should be able to find a bot that can trade across several Ethereum exchanges, including Huobi, Binance, Kraken, and HitBTC. And since Ethereum is a volatile currency, you may want to pick a trading bot that uses Trailing Stop orders. These orders ride strong market moves and capture more upside than a simple holding.\n\nWell, there are several factors for choosing an Ethereum trading bot, and here we will discuss specific parameters that you must consider before signing up for any crypto bot.\n\nBefore choosing an Ethereum trading bot, you must check the parameters it is offering for technical indicators and market information.\n\nTrading bot should have a user-friendly interface.\n\nBacktesting is essential for traders. Using historical data, you can create a trading strategy that works well. If you have an established trading strategy, you can then use bots to automate the process. Bots are better than humans at detecting opportunities, placing orders, and executing trades in a timely manner. Moreover, they allow you to analyze more than one cryptocurrency.\n\nThe trading bot should be reputed and to check authenticity, you must see how many years the platform has been on the market and what are the reviews of users.\n\nBefore using a trading bot, pay attention if the bot is compatible with well-known crypto exchanges. This is important to check the authenticity of the platform.\n\nConclusion:\n\nTrading bots are not meant to be money-making machines. They are designed to save you time and stress. There are various types of bots to choose from. Some bots are cloud-based, while others are server-based. It is important to test a trading bot before signing up. You can get an idea of how the bot will work by using a demo account.\n\nA trading bot can be useful when you don’t have the time or energy to analyze the market yourself. The best ones are easy to set up, run, and monitor. Once you have a good bot, you can start putting your crypto portfolio to work."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzAyLzA0L2V0aGVyZXVtcy1idWxsLXJ1bi1iZXN0LXlldC10by1jb21lL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 Feb 2023 08:00:00 GMT",
        "title": "Ethereum's 2023 Bull Run: Why the Best Is Yet to Come - The Motley Fool",
        "content": "Through the first 30 days of the year, Ethereum (ETH 0.34%) is up a surprising 37.53%, and now trades close to $1,700. Heading into the year, though, many traders expected Ethereum to consolidate its gains after The Merge and trade sideways in early 2023. Some even thought Ethereum might drop below $1,000. As a result, many investors are now asking: Is Ethereum's 2023 bull run sustainable?\n\nThe answer to that question can be found using one single metric: total value locked (TVL). This metric is useful as a shorthand way of tracking how much activity is happening on a blockchain. Generally speaking, the higher the number, the better it is for a blockchain. Let's take a deep dive into this metric and see what it tells us about Ethereum's future prospects.\n\nWhat is TVL and why should I care?\n\nTotal value locked, as might be guessed by its name, refers to how much of a cryptocurrency is \"locked\" on a blockchain. There are various ways of \"locking\" your cryptocurrency, such as by choosing to participate in a crypto staking program. With staking, you agree to \"lock up\" your crypto to earn rewards for a certain amount of time, during which you can not trade it. Thus, blockchains that have successful staking programs also typically rank very high when it comes to total value locked.\n\nFrom a long-term investment perspective, you can think of TVL as a way of measuring trust in the future potential of a particular blockchain. At the very least, you need to trust that the blockchain is going to return your crypto funds after the \"lock up\" period is over.\n\nHow to use TVL to value Ethereum\n\nBy simply examining a table of blockchains ranked by TVL, you can immediately see which blockchains are having success in getting investors to \"lock up\" their crypto funds. According to this metric, Ethereum ranks No. 1 in the world, with $29.39 billion in TVL. And it's not even close. The No. 2 blockchain is Tron, with $5.35 billion in TVL. Taking a big-picture view, Ethereum is responsible for close to 60% of all blockchain TVL. That's a very compelling argument in Ethereum's favor, since it means Ethereum is having a lot of success in encouraging investors to \"lock up\" their funds and trust the blockchain.\n\nBut that's just the start. You can also use TVL with another popular metric -- total market capitalization -- to arrive at a much more nuanced view of which cryptocurrencies are overvalued and which cryptocurrencies are undervalued. For example, many investors like to divide total market capitalization by TVL to arrive at the crypto market's version of the price-to-book ratio. This ratio should be familiar to stock market investors, since it is often used to spot stocks that are trading very low compared to their overall intrinsic value.\n\nSo, for example, you can divide Ethereum's total market capitalization ($204.837 billion) by its TVL ($29.39 billion), to arrive at a very rough approximation of a price-to-book ratio for Ethereum. When you compare Ethereum's price-to-book ratio to that of its direct peers, you can see immediately how Ethereum is doing on a relative basis. For example, Ethereum has a 6.97 price-to-book ratio, compared to 34.36 for Solana, which is up more than 100% in 2023. Again, this is a very encouraging number for Ethereum, since it lets investors know that Ethereum may still have some room to run as part of its bull market rally, while the market might be getting too frothy and speculative for Solana.\n\nDeveloping an investment thesis for Ethereum\n\nThe final step in using TVL to evaluate Ethereum is to come up with an investment thesis based on where funds are moving on the Ethereum blockchain. Using a website like DeFi Llama, it's possible to see exactly which decentralized finance (DeFi) protocols are attracting the most action. For example, the top DeFi protocol for Ethereum involves staking. This makes sense, since Ethereum instituted staking as part of The Merge last year.\n\nYou can also see one of the top staking protocols involves Coinbase Global. This, too, makes sense. It appears that Coinbase is having relative success at getting its clients to stake Ethereum directly on its platform. Taken as a whole, Ethereum's success with staking should be a net positive for its long-term growth potential.\n\nAs a long-term investor in Ethereum, you might decide to track TVL over an extended period of time, to see which areas are growing. This can alert you to developments that are still under the radar for many investors.\n\nTVL is useful, but not perfect\n\nTVL can be a very useful metric. It can help you spot when a cryptocurrency is undervalued, and can let you see how a particular blockchain compares to its peers. And, finally, it can let you put actual numbers to some of the hype and speculation you might see in the media. For example, before The Merge, many analysts were hyping the importance of staking for Ethereum. Well, several months later, it looks like they were right. Looking at TVL, it appears staking is very important to Ethereum.\n\nAdmittedly, TVL is not a perfect metric, and there are plenty of analysts who claim the number really needs to be cleaned and scrubbed before it can be used with any accuracy. However, based on my own analysis of TVL, I remain bullish on Ethereum long-term."
    }
]