[
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMTAvMTEvZXRoZXItbWF5LWV2ZW50dWFsbHktaGl0LTM1MDAwLXByZWRpY3RzLXN0YW5kYXJkLWNoYXJ0ZXJlZC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Oct 2023 07:00:00 GMT",
        "title": "Ether may eventually hit $35,000, predicts Standard Chartered - CNBC",
        "content": "A report out Wednesday argues that the price of the ethereum cryptocurrency may eventually climb as high as $35,000. Ether's price has been stuck alongside bitcoin's this year, but patient investors with a long horizon could be rewarded as ethereum reclaims its dominance in crypto's smart contracts space and new use cases emerge, according to Standard Chartered. In recent years, a wave of ethereum competitors have emerged to challenge the flagship Web3 blockchain network's high fees and slow processing times, including Solana , Cardano and Polkadot . Now, \"layer 2\" scaling solutions and new use cases are becoming \"ever more important\" and could help lift the price of ether 5x in the next three years before rocketing even higher, Standard Chartered said in a note Wednesday. \"We expect further change ahead,\" said Geoff Kendrick, an analyst at the London-based bank. \"Layer 2 scaling solutions … are likely to grow in importance over time, particularly as architecture upgrades expected in early 2024 sharply lower fees on these platforms. This should help to cement ETH's dominance in the smart contract space, thereby increasing its P/E ratio (if not its earnings) over the next couple of years.\" \"Layer 2\" solutions such as Arbitrum and Optimism are developed on ethereum itself to enhance its efficiency and help keep transactions within the ethereum ecosystem, rather than moving to a competing network in an attempt to find lower fees. Keeping activity on ethereum should increase the token's price-to-earnings ratio, Kendrick said. \"We think Ethereum's established dominance in smart contract platforms, along with emerging uses in gaming and tokenization, has the potential to push ETH to the $8,000 level by end-2026,\" he added. That level is \"a stepping stone to our long-term 'structural' valuation estimate of $26,000-$35,000,\" he added. ETH.CM= 1Y mountain Ether (ETH) over the past year That valuation assumes future use cases and revenue streams that may not exist yet, Kendrick noted. He highlighted gaming and tokenization of real-world assets as the next big use cases for the network. Both could add demand to its existing nonfungible token and decentralized finance channels, respectively, by giving \"real world\" companies and industries examples of how and why they could benefit from moving certain processes onto ethereum. Standard Chartered expects \"significant developments on these fronts by 2025-26,\" Kendrick said. — CNBC's Michael Bloom contributed reporting."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMTAvMTEvZXRoZXItbWF5LWV2ZW50dWFsbHktaGl0LTM1MDAwLXByZWRpY3RzLXN0YW5kYXJkLWNoYXJ0ZXJlZC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Oct 2023 07:00:00 GMT",
        "title": "Ether may eventually hit $35,000, predicts Standard Chartered - CNBC",
        "content": "A report out Wednesday argues that the price of the ethereum cryptocurrency may eventually climb as high as $35,000. Ether's price has been stuck alongside bitcoin's this year, but patient investors with a long horizon could be rewarded as ethereum reclaims its dominance in crypto's smart contracts space and new use cases emerge, according to Standard Chartered. In recent years, a wave of ethereum competitors have emerged to challenge the flagship Web3 blockchain network's high fees and slow processing times, including Solana , Cardano and Polkadot . Now, \"layer 2\" scaling solutions and new use cases are becoming \"ever more important\" and could help lift the price of ether 5x in the next three years before rocketing even higher, Standard Chartered said in a note Wednesday. \"We expect further change ahead,\" said Geoff Kendrick, an analyst at the London-based bank. \"Layer 2 scaling solutions … are likely to grow in importance over time, particularly as architecture upgrades expected in early 2024 sharply lower fees on these platforms. This should help to cement ETH's dominance in the smart contract space, thereby increasing its P/E ratio (if not its earnings) over the next couple of years.\" \"Layer 2\" solutions such as Arbitrum and Optimism are developed on ethereum itself to enhance its efficiency and help keep transactions within the ethereum ecosystem, rather than moving to a competing network in an attempt to find lower fees. Keeping activity on ethereum should increase the token's price-to-earnings ratio, Kendrick said. \"We think Ethereum's established dominance in smart contract platforms, along with emerging uses in gaming and tokenization, has the potential to push ETH to the $8,000 level by end-2026,\" he added. That level is \"a stepping stone to our long-term 'structural' valuation estimate of $26,000-$35,000,\" he added. ETH.CM= 1Y mountain Ether (ETH) over the past year That valuation assumes future use cases and revenue streams that may not exist yet, Kendrick noted. He highlighted gaming and tokenization of real-world assets as the next big use cases for the network. Both could add demand to its existing nonfungible token and decentralized finance channels, respectively, by giving \"real world\" companies and industries examples of how and why they could benefit from moving certain processes onto ethereum. Standard Chartered expects \"significant developments on these fronts by 2025-26,\" Kendrick said. — CNBC's Michael Bloom contributed reporting."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvY291bGQtZXRoZXJldW0tcmVhY2gtJDgwMDAtaW4tMjAyNi1zY2ItYW5hbHlzdC1tYWtlcy10aGUtY2FzZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Oct 2023 07:00:00 GMT",
        "title": "Could Ethereum Reach $8000 In 2026? SCB Analyst Makes The Case - Nasdaq",
        "content": "Ethereum (CRYPTO: ETH) blockchain’s native cryptocurrency, Ether, is estimated to reach $8,000 by 2026-end, Standard Chartered Bank (SCB) research stated.\n\nThe bank’s long-term structural valuation for Ether ranged between $26,000 to $35,000, as it had estimated back in September 2021. Geoffrey Kendrick, head of forex and crypto research at SCB, believed real-world use cases of Ether in gaming and tokenization could support the token’s development.\n\nAlso Read: Tron Founder Justin Sun Is Dumping Ethereum, Holders Worry Whether Prices Will Fall\n\n“We think Ethereum’s established dominance in smart contract platforms, along with emerging uses in gaming and tokenization, has the potential to push ETH to the $8,000 level by end-2026 (a 5x multiple from the current price of $1,600),” Kendrick said, reported The Block.\n\nFind out more on Ethereum, Bitcoin prices and forecasts. Meet and engage with transformative Digital Asset and Crypto business leaders and investors at Benzinga's exclusive event: Future of Digital Assets. Tickets are flying: Get yours!\n\nIn April 2023, SCB’s Kendrick forecasted a $100,000 price for Bitcoin (CRYPTO: BTC) by 2024 end. He believed that with troubles surrounding the stablecoins, Bitcoin is now regarded as the digital gold of the crypto space.\n\nEthereum’s Strengths: Ethereum is said to have a dominance in the smart contract space which is further strengthened by its upcoming technical upgrades, such as proto-danksharding, that would help lower transaction fees on these platforms. In the past year, Ether prices saw a surge of 20% with the past 24-hour trading volume of almost $8 billion.\n\nRead Next: If You Invested ₹1,000 In Ethereum When The World's First NFT Was Minted, Here's How Much You'd Have Today\n\nAmong the many factors, the upcoming Bitcoin halving event in April 2024, potential regulation and spot ETFs in the U.S. are likely to push Ether prices to $4,000 by 2024-end.\n\nAfter the MiCA regulation is passed for European countries, the U.S. and Britain could follow suit and such regulations are likely to have a positive impact on investor interest and volatility.\n\nBenzinga's Future of Digital Assets conference is scheduled for Nov. 14. Attend and learn more about all the digital assets and their regulations. The gathering is seen as pivotal for the digital assets community. The event will spotlight the latest trends, innovations, and challenges in the digital asset realm.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nProfit with More New & Research. Gain access to a streaming platform with all the information you need to invest better today. Click here to start your 14 Day Trial of Benzinga Professional\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvY291bGQtZXRoZXJldW0tcmVhY2gtJDgwMDAtaW4tMjAyNi1zY2ItYW5hbHlzdC1tYWtlcy10aGUtY2FzZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Oct 2023 07:00:00 GMT",
        "title": "Could Ethereum Reach $8000 In 2026? SCB Analyst Makes The Case - Nasdaq",
        "content": "Ethereum (CRYPTO: ETH) blockchain’s native cryptocurrency, Ether, is estimated to reach $8,000 by 2026-end, Standard Chartered Bank (SCB) research stated.\n\nThe bank’s long-term structural valuation for Ether ranged between $26,000 to $35,000, as it had estimated back in September 2021. Geoffrey Kendrick, head of forex and crypto research at SCB, believed real-world use cases of Ether in gaming and tokenization could support the token’s development.\n\nAlso Read: Tron Founder Justin Sun Is Dumping Ethereum, Holders Worry Whether Prices Will Fall\n\n“We think Ethereum’s established dominance in smart contract platforms, along with emerging uses in gaming and tokenization, has the potential to push ETH to the $8,000 level by end-2026 (a 5x multiple from the current price of $1,600),” Kendrick said, reported The Block.\n\nFind out more on Ethereum, Bitcoin prices and forecasts. Meet and engage with transformative Digital Asset and Crypto business leaders and investors at Benzinga's exclusive event: Future of Digital Assets. Tickets are flying: Get yours!\n\nIn April 2023, SCB’s Kendrick forecasted a $100,000 price for Bitcoin (CRYPTO: BTC) by 2024 end. He believed that with troubles surrounding the stablecoins, Bitcoin is now regarded as the digital gold of the crypto space.\n\nEthereum’s Strengths: Ethereum is said to have a dominance in the smart contract space which is further strengthened by its upcoming technical upgrades, such as proto-danksharding, that would help lower transaction fees on these platforms. In the past year, Ether prices saw a surge of 20% with the past 24-hour trading volume of almost $8 billion.\n\nRead Next: If You Invested ₹1,000 In Ethereum When The World's First NFT Was Minted, Here's How Much You'd Have Today\n\nAmong the many factors, the upcoming Bitcoin halving event in April 2024, potential regulation and spot ETFs in the U.S. are likely to push Ether prices to $4,000 by 2024-end.\n\nAfter the MiCA regulation is passed for European countries, the U.S. and Britain could follow suit and such regulations are likely to have a positive impact on investor interest and volatility.\n\nBenzinga's Future of Digital Assets conference is scheduled for Nov. 14. Attend and learn more about all the digital assets and their regulations. The gathering is seen as pivotal for the digital assets community. The event will spotlight the latest trends, innovations, and challenges in the digital asset realm.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nProfit with More New & Research. Gain access to a streaming platform with all the information you need to invest better today. Click here to start your 14 Day Trial of Benzinga Professional\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9wcm90b2NvbC1iaXRjb2luLW1pZ2h0LWV0aGVyZXVtLXN0eWxlLTIwNTEyNjM4MC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Oct 2023 07:00:00 GMT",
        "title": "The Protocol: Bitcoin Might Get Ethereum-Style Smart Contracts Under 'BitVM' Plan - Yahoo Finance",
        "content": "Bitcoin tech is suddenly in the spotlight after the publication by ZeroSync’s Robin Linus of his “BitVM” paper, which outlines a plan to easily add smart contracts to the original blockchain. The announcement has generated enthusiasm in Bitcoin circles, since smart contracts are the key innovation behind the second-biggest blockchain, Ethereum, not to mention its hordes of imitators.\n\nAlso:\n\nIsraeli crypto firms scramble to deal with Hamas war.\n\nMore blockchain startups cut jobs as crypto winter drags on.\n\nAvalanche blockchain now used to track cannabis.\n\nYou're reading The Protocol, CoinDesk’s weekly newsletter that explores the tech behind crypto, one block at a time. Subscribe here to get it every week.\n\nNetwork news\n\nRobin Linus, core contributor to ZeroSync and the author of the BitVM paper. (Robin Linus)\n\nBITCOIN’S NEW PARADIGM? This week’s publication of a research paper outlining the design for BitVM, “a computing paradigm to express Turing-complete Bitcoin contracts,” got bitcoiners buzzing on social-media forums. The big idea is that Ethereum-style smart contracts and might be coming to Bitcoin, raising the possibility of a existential transformation of the originally payments-focused blockchain – perhaps even a bigger development than the advent of NFTs earlier this year via the Ordinals protocol. “Bitcoin is about to become a lot smarter,” according to one post on X. “Something really interesting cooking,” wrote another. The author of the BitVM paper is Robin Linus, a core contributor to ZeroSync, a Swiss non-profit that’s building tools for Bitcoin developers to use zero-knowledge proofs – a type of cryptography that has become one of the hottest trends of 2023 in the Ethereum ecosystem. “BitVM is an amazing breakthrough because while there are many gaping holes right now in the BitVM, they are mostly solvable,” Bob Bodily, CEO of Bioniq.io, a Bitcoin Ordinals marketplace, wrote in a post on X. One person went so far as to inscribe Linus’s paper onto the Bitcoin blockchain. BitVM relies on computations performed off-blockchain and then verified on-chain using a setup similar to those found in so-called optimistic rollups on Ethereum. The details are quite technical, as evidenced by an article on the topic in Bitcoin Magazine that delved into the arcana of “NAND gates.” A poster on X put up a white flag, asking “Can you explain BitVM in plain English?” and then giving only two choices, “No” and “No way.” There were memes aplenty.\n\nStory continues\n\nHARSH WINTER: In the last edition of The Protocol, we recounted the rounds of layoffs coursing through the blockchain industry – at Chia Network, Chainalysis and Yield Protocol. Such moves come as digital-asset markets have stalled over the past several months, prolonging what many experts describe as an unusually harsh “crypto winter.” According to the analysis firm Messari, fundraising for crypto startups has hit a three-year low. Well, over the past week, there’s been more job cuts. CoinDesk broke the news this week that Blocknative, a provider of tools on the Ethereum blockchain, had reduced headcount by a third, which works out to about a dozen people. Last week, the crypto custody firm Ledger cut 12% of staff, or about 88 jobs, citing “macroeconomic headwinds” that are “limiting our ability to generate revenue.” Yuga Labs, the NFT company behind the Bored Ape Yacht Club NFT collection, eliminated an unspecified number of roles, even though it closed a $450 million funding round just 18 months ago, Unchained reported. In a statement on Yuga’s website, CEO Daniel Alegre wrote that the company had “a number of projects that, while well-intentioned, either spread the team too thin or required execution expertise beyond our core competencies.” It bears pointing out that the broader economy doesn’t seem to be suffering in the same way; the U.S. added 336,000 jobs in September, double analysts’ forecasts, a government report last week showed.\n\nISRAELI CRYPTO FIRMS DEAL WITH WAR: The past week’s surprise attack on Israel by Hamas fighters has upended the daily routines of crypto firms based in the Middle Eastern country, known as a haven for startups and tech companies. Several Israeli crypto executives and developers told CoinDesk they weren’t experiencing severe business disruptions, especially since many of them work remotely. But already, many employees of the firms are getting called up to reserve duties in the army. There were the personal elements such as the stress – digesting the scope of the damage, and the tragedies – as well as coping with bare supermarket shelves and repeated siren warnings. One of the largest projects so far to come out of the disaster is Crypto Aid Israel, a campaign led by Israeli crypto firms to gather crypto donations to help citizens who have been affected or displaced by the ongoing war. Separately, a local media outlet reported that Israeli police have frozen cryptocurrency accounts linked to Hamas, working with the crypto exchange Binance. According to the Wall Street Journal, Hamas along with the militant groups Palestinian Islamic Jihad and their Lebanese ally Hezbollah received more than $100 million combined in crypto funding into their digital-currency wallets over the past couple years.\n\nAvalanche social app Stars Arena, which became a sudden sensation when it launched a week ago, generating enthusiasm in the market for the blockchain’s AVAX tokens, suffered a reversal of fortune on Oct. 7 when it got drained of nearly all locked funds, some $3 million worth. The episode was attributed to a “major security breach with the smart contract.” WAIT THIS JUST IN: On Wednesday, the smart-contract address that launched the attack encoded a message into a blockchain transaction: “I would like to cooperate.”\n\nThorswap, a decentralized cross-chain crypto exchange, shifted into “maintenance mode” after the infamous “FTX Exploiter” used a series of Ethereum transactions to move funds onto the platform; project says the action was taken after “consultation with advisors, legal counsel and law enforcement.”\n\nALSO:\n\nActivist crypto investors scored a $2.5M bounty after mounting a campaign on FloorDAO.\n\nTokenized U.S. Treasuries arrive on Coinbase’s Base blockchain with Backed’s RWA token.\n\nBlockticity mints hemp and cannabis certifications on Avalanche blockchain.\n\nTaiwanese crypto trader’s 6-cent fee leads to $310K win in tax-receipt lottery.\n\nProtocol Village\n\nHighlighting blockchain tech upgrades and developments.\n\n1. XYO Network, which aims to create a decentralized system of location oracles using zero-knowledge proofs, has launched on Optimism.\n\n2. Bitcoin financial services firm Swan is introducing a \"collaborative custody\" service using Blockstream's hardware wallet Jade.\n\n3. Quant, a London-based provider of what's described as central-bank-grade key management, has unveiled Overledger Authorise, which aims to integrate digital asset and blockchain keys with existing security systems, \"ensuring top-level security and compliance,\" according to a message from the team.\n\n4. Spark Protocol, DAI-centric DeFi lending platform in MakerDAO ecosystem, announced its \"deployment on Gnosis Chain, a decentralized Ethereum Virtual Machine sidechain with over 150,000 validators,\" according to the team.\n\n5. JPMorgan has carried out its first live blockchain-based collateral settlement transaction involving BlackRock and Barclays, the U.S. banking giant said on Wednesday.\n\nMoney Center\n\nFundraisings\n\nNeutral , which aims to build a regulated exchange for tokenized environmental assets including carbon and renewable-energy credits, has raised a $3.2 million in a financing round led by North Island Ventures with contributions from Redalpine, DCG, Cerulean Ventures, Factor Capital, Very Early Ventures and Rarestone, according to a message from co-founder and CEO Farouq Ghandour.\n\nBlackbird , crypto restaurant app, raises $24M in funding led by Andreesen Horowitz (a16z).\n\nCrypto prime broker Membrane Labs raises $20M from Brevan Howard, Point72, Jane Street, Flow Traders, QCP Capital, Two Sigma Ventures, Electric Capital, Jump Crypto, QCP Capital, GSR Markets, Belvedere Trading, and Framework Ventures.\n\nDeals and grants\n\nVechain , a layer-1 enterprise-grade blockchain based in the country of San Marino, said it awarded $46,000 in price money at a 36-hour sustainability-themed hackathon at Harvard University. Winners included Movelo, FiTag and PropelPixel.\n\nThe Web3 Foundation , the organization that supports the Polkadot Network and its DOT Token, announced on X Tuesday that it's launching a development fund for projects looking to build on Polkadot, allocating $41 million to the endeavor.\n\nImmutable, an operator of blockchain networks for Web3 gaming, announced it will work with Amazon Web Services on “infrastructure and go-to-market initiatives designed to accelerate the on-boarding of game studios to Web3 and drive ownership of in-game items,” according to a press release.\n\nData and tokens\n\nBitcoin HODLers – a misspelling of “holders” that’s come to represent those cryptocurrency investors who never take profits – stash BTC worth $1.35 billion each month, onchain data shows. Separately, the money-management giant Fidelity’s digital-asset division argued in a report that the cryptocurrency’s “first technological breakthrough was not as a superior payment technology, but as a superior form of money.”\n\nThe Polygon-based stablecoin Real USD (USDR), backed by real estate holdings, saw its value plunge to nearly 51 cents within a few hours after its treasury was drained of DAI.\n\nThe JOE token sank after supermarket chain Trader Joe’s sues the decentralized crypto exchange Trader Joe. The defendants “developed a narrative around a fictionalized 'Trader Joe' who sells his crops in the local marketplace, further evoking Trader Joe’s business and brand,\" the suit reads.\n\nCrypto Startup Fundraising in Deep Chill\n\nThe job cuts. The stall-out in this year’s bitcoin price rally. Those are just a couple signs of the prolonged crypto winter. Here’s another: a continued decline in funds raised by blockchain startups. Crypto firms raised $2.1 billion in the third quarter, down 36% from the prior quarter to the lowest in almost three years, according to a report last week from the analysis firm Messari. As the overall pie shrinks, investors are increasingly putting their money into early-stage startups rather than later-stage deals – “indicative of strategic bear-market positioning as investors attempt to fund projects with asymmetric upside that can return greater multiples when market sentiment eventually shifts in a positive direction,” according to Messari.\n\nCalendar"
    }
]