[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS92aWRlby9ldGhlcmV1bS1hdmVyYWdlLWdhcy1mZWVzLXRvdWNoZWQtaGlnaGVzdC1sZXZlbC1pbi1zaXgtbW9udGhzLWthaWtvL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Average Gas Fees Touched Highest Level in Six Months: Kaiko - CoinDesk",
        "content": "The chart of the day is presented by crypto.com, the leading crypto platform trusted by over 80 million users worldwide. Today's chart of the day shows that defi activity might be picking up. That's according to a recent report by Blockchain Analytics firm. Ko. This chart shows the average gas fees on Ethereum hitting their highest levels in six months earlier in November as activity on the network increased. The Analytics platform says gas usage has been led by Unis swap where meet tokens like rock and surging tokens like RLB and link have registered significant volumes. Ko added that trading bots like banana gun which allow users to trade tokens with a relatively user friendly interface on the messaging platform has also consumed significant amounts of gas. While whale activity has also increased uni prices are seeing a bit of a jump today. Uni is at around $6.20 up almost 4%. That's it for today's chart of the day. I'm Jen Sani. We will see you next time to unpack more of the data behind top news stories."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V0aGVyZXVtLXJvbGx1cHMtc2F2ZS1nYXMtZmVlc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Nov 2023 08:00:00 GMT",
        "title": "Rollups saved Ethereum users a boatload of gas fees: Report - Blockworks",
        "content": "Ethereum transaction fees would be five times more expensive if not for layer-2 rollup networks like Optimism and Arbitrum.\n\nThat’s according to a recent report from blockchain infrastructure unit Chainstack. Aside from fees between 360% and 419% higher, transactions themselves would take nearly twice as long on average, Chainstack found.\n\nWait times would even stretch to 114 seconds compared to a block time of about 12 seconds (the minimum wait time if transactions are sent between blocks).\n\nRollups are designed to solve the blockchain trilemma — a tradeoff layer-1 networks must make between security, scalability and decentralization. Blockchains can only offer two of those elements at any one time, says Ethereum co-founder Vitalik Buterin, who popularized the concept laid out in 2016.\n\nEthereum, for example, is built with security and decentralization in mind. But it’s not totally scalable — transaction fees generally rise alongside user activity and can grow exponentially at times of peak demand.\n\nWith rollups, Ethereum is able to offload some of the pressure. There are two popular rollup solutions today: Optimistic rollups and zero-knowledge (zk) rollups.\n\nOptimistic rollups, such as Arbitrum and Optimism, process transactions off-chain and then post the data of the transaction back onto Ethereum as “calldata.” ZK rollups, such as Polygon zkEVM and zkSync Era, post all data on-chain but use cryptography to validate whether transactions are accurate without revealing the information itself.\n\nUsage of rollups has grown considerably over the past two years, with Arbitrium and Optimism often together handling more daily transactions than Ethereum mainnet.\n\n“… it’s clear how roll-up transactions have gone from representing a minor fraction of the network’s activity in 2021 to playing a vital part in Ethereum’s functioning by 2023,” Chainstack wrote.\n\nThe report added that the growing number of transactions illustrated the crucial functioning of rollups to Ethereum’s overall network efficiency.\n\nAlthough, Ethereum gas fees (currently about $1 on average) have seen a constant uptrend between 2021 and 2023 despite the popularity of rollups. But Chainstack reasoned that L2 networks have still served as a necessary and useful counterbalance.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1jb3JyZWN0aW9uLTE5MzAv0gFIaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vYW5hbHlzaXMvZXRoL2V0aGVyZXVtLXByaWNlLWNvcnJlY3Rpb24tMTkzMC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Price Hints At Potential Correction, Buy The Dip? - NewsBTC",
        "content": "Ethereum price struggled above $2,100. ETH is now moving lower and might continue to drop toward the $1,930 support in the near term.\n\nEthereum is consolidating and facing resistance near the $2,060 zone.\n\nThe price is trading below $2,080 and the 100-hourly Simple Moving Average.\n\nThere is a key bearish trend line forming with resistance near $2,065 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could continue to move down if it breaks the $2,035 support zone.\n\nEthereum Price Drops Again\n\nEthereum price attempted a fresh increase above the $2,080 resistance zone. ETH even spiked above the $2,120 resistance zone, like Bitcoin. However, the bears were active above $2,120.\n\nA high was formed near $2,132 before the price started a fresh decline. There was a move below the $2,080 level. A low is formed near $2,037 and the price is now consolidating losses. It is struggling below the 23.6% Fib retracement level of the recent decline from the $2,132 swing high to the $2,037 low.\n\nEthereum is now trading below $2,080 and the 100-hourly Simple Moving Average. On the upside, the price is facing resistance near the $2,065 zone. There is also a key bearish trend line forming with resistance near $2,065 on the hourly chart of ETH/USD.\n\nThe first key resistance is near the $2,100 level or the 61.8% Fib retracement level of the recent decline from the $2,132 swing high to the $2,037 low. A clear move above the $2,100 level could send the price toward the $2,120 resistance zone.\n\nSource: ETHUSD on TradingView.com\n\nThe next resistance is near $2,135, above which the price could aim for a move toward the $2,200 level. Any more gains could start a wave toward the $2,250 level.\n\nMore Losses in ETH?\n\nIf Ethereum fails to clear the $2,080 resistance, it could start a fresh decline. Initial support on the downside is near the $2,035 level.\n\nThe next key support is $2,000. A downside break below $2,000 might send Ether toward the $1,930 support. The key support is now at $1,900, below which there is a risk of a move toward the $1,840 level.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 level.\n\nMajor Support Level – $2,035\n\nMajor Resistance Level – $2,080\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3LmNjbi5jb20vYW5hbHlzaXMvZXRoZXJldW0tcHJpY2Utc3RydWdnbGluZy1yZXNpc3RhbmNlLXJldmVyc2FsL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Price Struggling At Its $2100 Resistance -- Reversal In Sight? - CCN.com",
        "content": "Key Takeaways\n\nETH has underperformed compared to the general market.\n\nIt’s still on a lower high compared to April’s high.\n\nA reversal is in sight, but this can be bullish in the long run.\n\nThe cryptocurrency market has been surrounded by bullish sentiment from the start of the year, and we saw triple-digit growth all across the space. Bitcoin paved the way, and many altcoins followed, later surpassing it, especially recently from September, making explosive and parabolic rises.\n\nMeanwhile, the price of the largest altcoin – Ethereum, has been underperforming compared to many cryptocurrencies. It, too, saw a price appreciation but only 84% since the start of the year. Unlike many that have made new yearly highs, it stayed within its previous, completed in April of $2,150, and now, in November, it came just shy of it.\n\nFrom November 9, when it came to $2,124, we saw a choppy price action lasting 18 days. As the price struggles at these levels, is this an indication of a looming reversal?\n\nETH Price Analysis\n\nThe price of Ethereum fell to $920 on June 18 last year. This was the completion of the downtrend from the all-time high of $4,852, resulting in 82% depreciation. A recovery started as it did across the whole cryptocurrency market, but unlike many cryptocurrencies, the price of ETH didn’t make a lower low.\n\nInstead, it was on a continuous incline, initially coming to $2,000 on August 14 and later making a slightly higher high to around $2,150 on April 16, 2023. Its support level was ascending; the horizontal resistance around $2,100 formed an ascending flat triangle.\n\nThe last rise from October 11 was made from this ascending support at $1,530, but the price still found resistance at the same horizontal area instead of making another higher high. The flat zone proved to be strong, but if this whole ascending triangle structure was the starting formation of the larger bull phase, can we see a breakout to the upside?\n\nETH Price Prediction\n\nLooking at the wave structure, there is a possibility that the whole ascending triangle is the starting impulse wave from the next bull phase for Ethereum’s price. This is known as the leading diagonal pattern in the Elliott Wave theory.\n\nIf this count is correct, the price increase ended for now on the last interaction with the horizontal resistance around the $2,100 area. In that case, we are ready to see a first bull market correction that will establish the first macro higher low.\n\nMeasuring with the Fibonacci retracement tool at its optimal level, we have a price target of $1,380. This corresponds to the horizontal support area, but the price can fall even further until this possibility is invalidated.\n\nAll in all, the price of Ethereum has most likely ended its last uptrend from mid-October and will now make a reversal. If this turns out to be the correction we are expecting, it would mark the completion of the first two bullish waves and indicate the start of a larger uptrend at the beginning of 2024.\n\nDisclaimer\n\nPlease note that the contents of this article are not financial or investing advice. The information provided in this article is the author’s opinion only and should not be considered as offering trading or investing recommendations. We do not make any warranties about the completeness, reliability and accuracy of this information. The cryptocurrency market suffers from high volatility and occasional arbitrary movements. Any investor, trader, or regular crypto users should research multiple viewpoints and be familiar with all local regulations before committing to an investment."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1wcmljZS1mYWxscy1hcy1yZWd1bGF0b3J5LXdvcnJpZXMtYW5kLXBhdXNlLWluLWRhcHAtdXNlLWltcGFjdC1pbnZlc3Rvci1zZW50aW1lbnTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Nov 2023 08:00:00 GMT",
        "title": "Ethereum price falls as regulatory worries and pause in DApp use impact investor sentiment - Cointelegraph",
        "content": "Ether (ETH) is struggling to maintain the $2,000 support as of Nov. 27, following its third unsuccessful attempt in 15 days to surpass the $2,100 mark. This downturn in Ether’s performance comes as the broader cryptocurrency market sentiment deteriorates.\n\nIt’s possible that recent developments, such as the United States Department of Justice (DOJ) signaling potential severe repercussions for Binance founder Changpeng “CZ” Zhao, have contributed to the negative outlook.\n\nIn a filing on Nov. 22 to a Seattle federal court, U.S. prosecutors sought a review and reversal of a judge’s decision permitting CZ to return to the United Arab Emirates on a $175 million bond. The DOJ argues that Zhao poses an “unacceptable risk of flight and nonappearance” if allowed to leave the U.S. pending sentencing.\n\nEthereum DApps and DeFi face new challenges\n\nThe recent $46 million KyberSwap exploit on Nov. 23 has further dampened demand for decentralized finance (DeFi) applications on Ethereum. Despite being previously audited by security experts, including a couple in 2023, the incident has heightened concerns about the safety of the overall DeFi industry. Fortunately for investors, the attacker expressed willingness to return some of the funds, yet the event underscored the sector’s vulnerabilities.\n\nAdditionally, investor confidence was shaken by a Nov. 21 blog post from Tether, the firm behind the Tether (USDT) stablecoin. The post announced the U.S. Secret Service’s recent integration into its platform and hinted at forthcoming involvement from the Federal Bureau of Investigation.\n\nThe lack of details in the announcement has led to speculation about an increasingly stringent regulatory landscape for cryptocurrencies, especially with Binance facing heightened scrutiny and Tether’s closer collaboration with authorities. These factors are likely contributing to Ether’s underperformance, with various on-chain and market indicators suggesting a decline in ETH demand.\n\nInvestors become cautious as ETH on-chain data reflects weakness\n\nEther exchange-traded products (ETPs) saw only $34 million of inflows in the last week, according to CoinShares. This figure is a modest 10% of the inflow seen by equivalent Bitcoin (BTC) crypto funds during the same period. The competition between the two assets for spot exchange-traded fund (ETF) approval in the U.S. makes this disparity particularly noteworthy.\n\nMoreover, the current seven-day average annualized yield of 4.2% on Ethereum staking is less appealing than the 5.25% return offered by traditional fixed-income assets. This disparity led to significant outflows of $349 million from Ethereum staking in the previous week, as reported by StakingRewards.\n\nHigh transaction costs continue to be challenging, with the seven-day average transaction fee at $7.40. This expense has adversely affected the demand for decentralized applications (DApps), leading to a 21.8% decline in DApps volume on the network in the last week, as per DappRadar.\n\nTop Ethereum Dapps by volume. Source: DappRadar\n\nNotably, while most Ethereum DeFi applications saw a significant drop in activity, competing chains like BNB Chain and Solana experienced an 11% increase and stable activity, respectively.\n\nRelated: Changpeng Zhao may not leave the US pending court review, says judge\n\nConsequently, Ethereum network protocol fees have decreased for four consecutive days, amounting to $5.4 million on Nov. 26, compared to a daily average of $10 million between Nov. 20 and Nov. 23, as reported by DefiLlama. This trend could potentially create a negative spiral, driving users toward competing chains in search of better yields.\n\nEther’s current price pullback on Nov. 27 reflects growing concerns over regulatory challenges and the potential impact of exploits and sanctions on stablecoins used in DeFi applications.\n\nThe increasing involvement of the DOJ and FBI with Tether elevates the systemic risk for liquidity pools and the entire oracle-based pricing mechanism. While there’s no immediate cause for panic selling or fears of a drop to $1,800, the lackluster demand from institutional investors, as indicated by ETP flows, is certainly not a positive sign for the market.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    }
]