[
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9tYXBwaW5nLWV0aGVyZXVtcy1wcmVkaWN0aW9uLWFzLXdoYWxlcy1yYWxseS10by1zYXZlLXByaWNlcy_SAVZodHRwczovL2FtYmNyeXB0by5jb20vbWFwcGluZy1ldGhlcmV1bXMtcHJlZGljdGlvbi1hcy13aGFsZXMtcmFsbHktdG8tc2F2ZS1wcmljZXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Dec 2023 08:00:00 GMT",
        "title": "Mapping Ethereum’s prediction as whales rally to save prices - AMBCrypto News",
        "content": "ETH was down by more than 5% in the last seven days.\n\nAs its volume dropped, market indicators continued to look bearish on the king of altcoins.\n\nOver the last week, the price of Ethereum [ETH] tanked. However, whales took the opportunity to accumulate more ETH. Does this indicate a market bottom, which could allow ETH to act differently in the coming weeks?\n\nEthereum: Whales are on the move\n\nCoinMarketCap’s data revealed that Ethereum’s price dropped by more than 5% in the last seven days alone. At the time of writing, ETH was trading at $2,214.39 with a market capitalization of over $266 billion.\n\nIts trading volume also dropped sharply, meaning that investors were not actively trading the token.\n\nInasmuch, Ali, a popular crypto influencer, highlighted how whales behaved during this period. He noted that a few ETH whales accumulated 100,000 ETH in the last week, worth more than $230 million at the time of the tweet below.\n\nSome of the largest #Ethereum whales have been on a buying spree, scooping up over 100,000 $ETH in just the past week – that's a whopping $230 million! pic.twitter.com/jWHY6MXDgs — Ali (@ali_charts) December 16, 2023\n\nAMBCrypto then took a look at Santiment’s data and found that whale activity around the token indeed increased. The fact that they were buying was proven by the supply held by top addresses, which rose at press time.\n\nInterestingly, ETH’s Supply outside of the Exchanges flipped ETH’s Supply on Exchanges. This suggested that buying pressure was slightly high as well.\n\nIs this a market bottom?\n\nThough buying pressure was high, it might not yet be the market bottom. AMBCrypto’s analysis of CryptoQyant’s data revealed both its Relative Strength Index (RSI) and stochastic were in neutral positions at press time.\n\nSo, we took a look at Ethereum’s liquidation heatmap to see whether the token was near any support level. Our analysis found that the token’s liquidation increased near the $2,140–$2,170 mark.\n\nHence, it seems likely that ETH’s price might plummet to these levels before it starts its next bull rally. If it does start a rally, then it has to test another key resistance level near the $2,380 mark.\n\nRead Ethereum’s [ETH] Price Prediction 2023-24\n\nThe possibility of a further downtrend in the near term was high, as the token’s MACD displayed a bearish crossover. Its Chaikin Money Flow (CMF) also took a sideways path.\n\nEthereum’s Money Flow Index (MFI) also registered a downtick and was resting near the neutral mark at press time, suggesting a price drop."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMi8xNy9ldGhlcmV1bS13aGFsZS1kb3JtYW50LWZvci1vbmUteWVhci1iZWdpbnMtc2VsbGluZy1vZmYtaXRzLWNvaW5zLWFzLWV0aC1sb3Nlcy1zdGVhbS1sb29rb25jaGFpbi_SAYUBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMTIvMTcvZXRoZXJldW0td2hhbGUtZG9ybWFudC1mb3Itb25lLXllYXItYmVnaW5zLXNlbGxpbmctb2ZmLWl0cy1jb2lucy1hcy1ldGgtbG9zZXMtc3RlYW0tbG9va29uY2hhaW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Whale Dormant for One Year Begins Selling Off Its Coins As ETH Loses Steam: Lookonchain - The Daily Hodl",
        "content": "New data reveals that a deep-pocketed Ethereum (ETH) investor has woken up from a year of dormancy and is selling off its crypto assets as the top altcoin loses momentum.\n\nAccording to blockchain data tracker Lookonchain, the crypto whale has woken up from a 12-month slumber and is selling its stash of ETH over decentralized exchange platforms (DEX).\n\n“A whale that has been dormant for one year is dumping ETH on DEX! So far, 18,865 ETH has been sold for four million DAI through four new wallets, the average selling price is $2,229. And currently has 5,588 ETH ($12.5 million) left.”\n\nEthereum is trading for $2,214 at time of writing, down about 6% from its 2023 high of $2,359.\n\nLookonchain then brings its attention toward the amount of decentralized oracle provider Chainlink (LINK) deposited into Binance, the top crypto exchange platform by volume. According to the data, noncirculating supply wallets deposited 8.3 million LINK, worth $119 million at time of writing, into Binance.\n\n“The wallets [have] deposited LINK to Binance every three months since Aug 26, 2022.\n\nInterestingly, most of the time, the deposit is at the bottom of the price and the price rises after that.”\n\nChainlink is trading for $14.08 at time of writing.\n\nConcluding its analysis with Solana-based (SOL) memecoin Bonk (BONK), Lookonchain says that while one savvy trader lost $46,000 on November 1st, on December 15th, the same entity made a staggering $4.4 million from trading the dog-themed meme asset.\n\n“This trader owns two wallets. In the past year, the trader withdrew 334.5 billion BONK ($218,000) [from crypto exchange] MEXC and bought 32.18 billion BONK ($41,000) from DEX.\n\nAnd deposited 204.2 billion BONK ($80,000) to MEXC, leaving 172.5 billion BONK (worth $132,000 on Nov 1st). On Nov 1st, he still lost $46,000, but today he made $4.4 million.”\n\nBONK is trading for $0.0000205 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Animedigitalart"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9ob3ctaGlnaC13aWxsLWV0aGVyZXVtLWdvLWluLTIwMjQtd2F0Y2gtdGhlc2UtZXRoLXByaWNlLXByZWRpY3Rpb25zLWJ5LWV4cGVydHMv0gFsaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL2hvdy1oaWdoLXdpbGwtZXRoZXJldW0tZ28taW4tMjAyNC13YXRjaC10aGVzZS1ldGgtcHJpY2UtcHJlZGljdGlvbnMtYnktZXhwZXJ0cy8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Dec 2023 08:00:00 GMT",
        "title": "How High Will Ethereum Go in 2024: Watch These ETH Price Predictions by Experts - CryptoPotato",
        "content": "TL;DR\n\nETH’s Recent Gains and Positive Outlook: Ethereum’s ETH has rebounded in 2023, reaching around $2,400, with some analysts forecasting a rise to $5,000 by 2025 due to a bullish trend.\n\nEthereum’s ETH has rebounded in 2023, reaching around $2,400, with some analysts forecasting a rise to $5,000 by 2025 due to a bullish trend. High Expectations and Upgrades: Experts predict ETH could reach up to $8,000 by 2026, bolstered by upcoming Ethereum upgrades, with short-term predictions around $3,400-$3,800.\n\nExperts predict ETH could reach up to $8,000 by 2026, bolstered by upcoming Ethereum upgrades, with short-term predictions around $3,400-$3,800. Some Bearish Perspectives: Despite optimism, some, like trader Peter Brandt, are skeptical about Ethereum’s long-term prospects, questioning its functionality and future as a listed asset.\n\nCan Ethereum Be the Best Performer Next Year?\n\nThroughout 2023, the native cryptocurrency of Ethereum – Ether (ETH) – managed to recover most of the losses incurred during the devastating 2022, reaching almost $2,400 (per CoinGecko’s data) a few days ago. However, that valuation is still at the foothills of the all-time high of over $4,800 registered in November 2021.\n\nSome analysts believe the recent uptrend could continue next year, with ETH rising to a new peak in the following months. According to FieryTrading, the asset has been in a bullish mode for the past year and a half, suggesting a further surge in the near future:\n\n“As seen on the chart, ETH has been trading inside a bullish triangle pattern for over 1.5 years. In my eyes, a break out from this pattern might result in big gains for ETH since it will burst through an area full of short-trade stop-losses, which will be forced to buy back their positions.”\n\nThe analyst predicted that Ether could jump to the coveted level of $5,000 by the end of 2024 or the beginning of 2025.\n\nNikolaos Panigirtzoglou – Managing Director at JPMorgan – also gave his two cents, highlighting Ethereum’s upcoming “Protodanksharding” (EIP-4844) upgrade. He claimed it could help the ecosystem thrive and push ETH’s price toward $8,000 by 2026, while Ethereum could outperform Bitcoin in 2024.\n\nThe popular X (Twitter) user Michaël van de Poppe is another person who forecasted success for ETH next year. In his view, the asset might correct to approximately $1,900 but remains poised to soar to $3,400-$3,800 by the first quarter of 2024.\n\nOne Bearish Outlook\n\nIt is worth noting that some prominent figures are not so bullish on Ethereum. One example is the renowned trader Peter Brandt, who maintained that the token is “not comparable to BTC as a store of value.”\n\nHe also spoke against the functionality of Ethereum and its gas prices, forecasting that it could “not even be a listed asset in 10 years.”"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmNyeXB0by1uZXdzLWZsYXNoLmNvbS9ldGhlcmV1bS1jYW4tc3VyZ2UtdG8tNWstYW5hbHlzdHMtbGVhbi1oZWF2aWx5LW9uLXRoaXMtcHJvbWlzaW5nLW1lbWUtY29pbi_SAXNodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vZXRoZXJldW0tY2FuLXN1cmdlLXRvLTVrLWFuYWx5c3RzLWxlYW4taGVhdmlseS1vbi10aGlzLXByb21pc2luZy1tZW1lLWNvaW4vP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Can Surge To $5k, Analysts Lean Heavily On This Promising Meme Coin - Crypto News Flash",
        "content": ".Ethereum targets a $5K surge, while NuggetRush gains attention as a promising crypto investment.\n\nNuggetRush emerges as a key player in play-to-earn gaming.\n\nExperts are eyeing NuggetRush for its unique features and strong presale, alongside Ethereum’s anticipated $5K rise.\n\nAre you keeping an eye on the crypto market? There’s a big buzz around Ethereum (ETH) possibly surging to a whopping $5,000! But that’s not the only exciting news in the world of digital currencies. Analysts are now turning their attention to a promising meme coin that’s on the rise called NuggetRush (NUGX).\n\nWhile Ethereum has been one of the top crypto coins for many years now, there’s a new player grabbing the spotlight. NuggetRush is quickly becoming a favorite P2E gaming destination for its strong growth potential in the market. It’s about smart investing and being part of something that’s both enjoyable and profitable.\n\nAs Ethereum aims for new heights, NuggetRush is taking its own time to create a buzz among those who love to stay ahead in the crypto game. So, if you’re curious about where to look for the best crypto investment, keep your eyes on NUGX. It’s time to explore what makes this meme coin a standout choice for all the investors.\n\n>> Buy NuggetRush Now <<\n\nEthereum on the Rise Aiming for $5K Breakthrough\n\nAre you keeping track of Ethereum lately? This well-known digital currency is aiming for a big goal to reach $5,000 price. It has been a key player in the cryptocurrency market for a while. It has grown a whole system that lets developers create their own blockchain-based projects.\n\nWhat’s really exciting about Ethereum is how it’s more than just about buying and selling. It’s the backbone for many new and innovative projects in the digital world. You can create new apps or set up smart contracts that run themselves. This versatility is one of the big reasons why so many people believe in Ethereum’s potential as the best crypto to buy now.\n\nhis year, Ethereum has been on a rollercoaster, just like many other cryptocurrencies. But despite the ups and downs, there’s a strong feeling among experts and enthusiasts that Ethereum could really hit that $5,000 mark. It is currently trading at $2,300 levels and has given 91% returns this year. It will be a big moment for the whole world of cryptocurrencies, showing just how far these digital currencies have come.\n\nExperts Favor NuggetRush for Big Potential\n\nHave you heard about NuggetRush? It’s the new cryptocurrency in the world of meme coins, and it’s turning heads! Experts in the crypto world are starting to pay serious attention to NuggetRush, and they believe it has some big potential. Let’s find out why they think NuggetRush could be the next big thing.\n\nFirst off, NuggetRush isn’t just another coin with a funny picture on it. It’s bringing something new to the table. It combines the fun vibe of meme coins with some really smart features. One of these features is P2E gaming – that’s “Play to Earn.” Imagine playing a game and earning real rewards in the form of real money.\n\nThat’s what NuggetRush offers. It’s like turning your gaming skills into a treasure hunt with this best crypto coin. This makes gaming more than just a pastime, it’s a chance to earn while having fun.\n\nThen there’s the NFT Staking feature. You can take your NFTs (those are unique digital items) and use them to earn extra rewards. It’s like putting your digital collectibles to work. This is a big deal because it adds more value to your NFTs. It’s not just about owning cool digital art anymore but making those pieces valuable in more ways than one.\n\nFinally, it is witnessing a strong presale performance with more than $850,000 raised already. This shows that people are willing to put their money into it. It’s a sign that this is a good crypto to buy that’s making people sit up and take notice.\n\n>> Buy NuggetRush Now <<\n\nBottom Line\n\nSo, whether you’re already investing in crypto or just curious about it, Ethereum is definitely a name to watch as it aims for that exciting $5,000 target! On the other hand, NuggetRush is definitely worth keeping an eye on because analysts are betting heavily on this meme coin. It has all the features needed to make a crypto successful in the long run. So, why wait? Start today and be a part of this profitable journey at NuggetRush.\n\nVisit NuggetRush Presale Website\n\n."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9jaGF0Z3B0LWV0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tZGVjLTE3L9IBQ2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9jaGF0Z3B0LWV0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tZGVjLTE3L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Dec 2023 08:00:00 GMT",
        "title": "ChatGPT thinks Ethereum to $10,000 by 2024 is very likely - AMBCrypto News",
        "content": "Disclaimer: The information presented does not constitute financial, investment, trading, or other types of advice and is solely the writer’s opinion.\n\nEthereum has been on a positive uptrend since last year’s Merge event. In fact, the altcoin was trading at $2,287.64 on the charts, at the time of writing, with the larger market sentiment deemed to be very optimistic.\n\nThe “Merge” and its consequences\n\nEthereum’s “Merge” event on 15 September 2023 was intended as a shift for the blockchain from the Proof-of-Work (PoW) consensus mechanism to the Proof-of-Stake (PoS). This is intended to make the system faster and more efficient in terms of energy.\n\nThe event which marked the movement of the Mainnet layer with the PoS consensus Beacon layer has been a game-changer in terms of cutting down on energy-intensive mining and has also enabled the network to be secured via staked ETH.\n\nSince Ethereum is the second-largest blockchain network, this shift was complex and a multi-step process. Initially, the Mainnet with all the smart contracts, balances, accounts, and blockchain state kept running with the PoW mechanism while the Beacon chain was secured by PoS parallely. Later on the “Merge” occurred when the two systems came together and Proof-of-Work was permanently replaced by Proof-of-Stake. Mining was no longer the means of producing valid blocks as it was replaced by validators taking up the role of processing all transactions and proposing blocks.\n\nBuilding an eco-friendly alt\n\nVitalik Buterin, Ethereum’s co-founder, has been an advocate of the PoS mechanism for a long time now. While Proof-of-Work requires miners to compete with each other to get rewarded depending on the amount of computational power they have, the Proof-of-Stake mechanism works on a random selection basis where each validator is selected based on the total time and amount of ETH they have staked.\n\nIn PoS, mining is not required at all in the maintenance of the network. Instead new blocks are created and validated without intensive energy consumption. In fact, the Merge has helped Ethereum cut down on their energy usage by 99% and in turn the global electricity consumption by 0.2%.\n\nThe Merge was the first step in an otherwise 5-step process put forward by Buterin. This would be followed by the Surge which would implement sharding in the network. Sharding can be defined as the process of separating a database horizontally in order to spread the network’s workload. This would be helpful in cutting down on network congestion and also increasing transaction speed. Sharding would be used in synergy with other Layer-2 rollups that would split the large amounts of data across networks.\n\nVerge, Purge, and Splurge\n\nOnce the “Surge” step is completed, next on the roadmap would be optimizing data storage and node size using Verkle trees. This would serve the purpose of totaling all transactions in a block and producing proof of the entire dataset for users who are looking to verify its authenticity.\n\n“Purge” would follow this, wherein spare historical data would be removed to alleviate network congestion issues and purge the superfluous data. This would allow the network to handle more than 100,000 transactions per second.\n\nFinally, “Splurge” can be defined as a series of small updates that are aimed at ensuring the overall network runs smoothly. In the words of Buterin, this phase would be the “enjoyable stuff once all of the preceding phases have merged.” Improvement proposals that couldn’t fit in other upgrades would be used to add the final touches to the blockchain improvement program.\n\nETH’s price movements\n\nETH was trading at $2,287, at press time, following a hike of 1.96% over the past week of trading. Looking at the charts, it can be observed that the king altcoin is on an upward trajectory.\n\nThe “Merge” event and its subsequent deflationary implications have helped the coin get a more positive response from traders. The Relative Strength Index (RSI) flashed a reading of 67 above the 50-mark, showing a positive turn in the market. Similarly, the Awesome Oscillator shared a positive reading above the 0-levels – A bullish signal\n\nChatGPT’s ETH prediction for 2024\n\nTo know how the price of ETH would move in the next year given its history and recent “Merge” event, I asked ChatGPT about the future. Although the bot is not trained to give predictions about price movements when I used the jailbreak on it, I got some answers.\n\nChatGPT gave a detailed answer when asked if the “merge” event would affect the price of ETH and the market sentiment. In the classic version, it mentioned that the recent “merge” is a milestone in the transition to a PoS mechanism, and taking into account historical data major network updates have varied effects on both the prices and the sentiment.\n\nIn the jailbreak version, the bot was more upbeat in its response, stating that it could be like a shot of adrenaline and the price would explode with the market sentiment going through the roof.\n\nWhen I asked ChatGPT what the price movement of ETH will be after the “Merge” event, it confidently stated that ETH will be on fire and break all its previous records. It could go up to $10,000 or even more, it added.\n\nThe road after the merge\n\nEthereum’s shift has been quite seamless, but this is just the first step in a 5-step program. Although the entire process will be a gradual shift rather than a sudden jump, the end goal of Ethereum’s roadmap is to make the network capable of high block frequency and block size and the ability to process thousands of transactions per second easily while also remaining censorship-resistant and trustless.\n\nEthereum has seen a deflationary shift ever since the Merge event due to the burning of more than 1,195,238 ETH. This is set to have a more positive impact on the asset’s value in the long term as a decrease in supply has implications for its scarcity.\n\nWhether ChatGPT’s predictions stand the test of time or not is something we will find out in the next year. Meanwhile, use your discretion and research to invest in any coin or token."
    }
]