[
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3Lm1hcmtldHdhdGNoLmNvbS9kYXRhLW5ld3MvbW9zdC1sYXJnZS1jcnlwdG9jdXJyZW5jaWVzLWNsaW1iLW9uLXBvbHlnb24tZXRoZXJldW0taW5jcmVhc2VzLTMwZmQyZjAzLTkwYjIzMDJmODlhNdIBf2h0dHBzOi8vd3d3Lm1hcmtldHdhdGNoLmNvbS9hbXAvZGF0YS1uZXdzL21vc3QtbGFyZ2UtY3J5cHRvY3VycmVuY2llcy1jbGltYi1vbi1wb2x5Z29uLWV0aGVyZXVtLWluY3JlYXNlcy0zMGZkMmYwMy05MGIyMzAyZjg5YTU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Most large cryptocurrencies climb on Polygon, Ethereum increases - MarketWatch",
        "content": "Most large cryptocurrencies were up during morning trading on Wednesday, with Polygon MATICUSD, +0.08% seeing the biggest move, climbing 7.02% to $1.07.\n\nSix additional currencies posted gains Wednesday. Ethereum ETHUSD, +0.55% increased 4.69% to $2,328.28, and Dogecoin DOGEUSD, -2.18% climbed 2.21% to 9 cents."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3Lm1hcmtldHdhdGNoLmNvbS9kYXRhLW5ld3MvbW9zdC1sYXJnZS1jcnlwdG9jdXJyZW5jaWVzLWNsaW1iLW9uLXBvbHlnb24tZXRoZXJldW0taW5jcmVhc2VzLTMwZmQyZjAzLTkwYjIzMDJmODlhNdIBf2h0dHBzOi8vd3d3Lm1hcmtldHdhdGNoLmNvbS9hbXAvZGF0YS1uZXdzL21vc3QtbGFyZ2UtY3J5cHRvY3VycmVuY2llcy1jbGltYi1vbi1wb2x5Z29uLWV0aGVyZXVtLWluY3JlYXNlcy0zMGZkMmYwMy05MGIyMzAyZjg5YTU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Most large cryptocurrencies climb on Polygon, Ethereum increases - MarketWatch",
        "content": "Most large cryptocurrencies were up during morning trading on Wednesday, with Polygon MATICUSD seeing the biggest move, climbing 7.02% to $1.07.\n\nSix additional currencies posted gains Wednesday. Ethereum ETHUSD increased 4.69% to $2,328.28, and Dogecoin DOGEUSD climbed 2.21% to 9 cents.\n\nCardano ADAUSD climbed 2.09% to 61 cents, while Ripple XRPUSD climbed 1.76% to 63 cents. Bitcoin BTCUSD increased 1.05% to $42,938.00.\n\nPolkadot DOTUSD, which posted the smallest increase, climbed 1.05% to $8.85.\n\nOn the other hand, two cryptos posted decreases, with Uniswap UNIUSD seeing the largest drop at 1.60% to $7.33. Solana SOLUSD fell 1.50% to $108.08.\n\nIn crypto-related company news, shares of Coinbase Global Inc. COIN rose 5.98% to $182.34, while MicroStrategy Inc. MSTR climbed 2.51% to $619.03. Riot Platforms Inc. RIOT shares rose 3.29% to $17.92, and shares of Marathon Digital Holdings Inc. MARA climbed 7.39% to $28.95.\n\nBlock Inc. SQ climbed 0.79% to $78.80 and Tesla Inc. TSLA climbed 2.42% to $262.83.\n\nPayPal Holdings Inc. PYPL rose 0.02% to $62.58, and Ebang International Holdings Inc. EBON shares climbed 0.53% to $17.54. NVIDIA Corp. NVDA climbed 0.13% to $493.45, and Advanced Micro Devices Inc. AMD rose 0.61% to $144.29.\n\nIn the fund space, the Bitwise Crypto Industry Innovators ETF BITQ, which is focused on pure-play crypto companies, increased 4.98% to $12.87. Blockchain-focused Amplify Transformational Data Sharing ETF BLOK rose 2.15% to $31.48. Grayscale Bitcoin Trust GBTC, which tracks the Bitcoin market price, climbed 1.96% to $36.35.\n\nEditor's Note: This story was auto-generated by Automated Insights, an automation technology provider, using data from Dow Jones and FactSet. See our market data terms of use."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ldGhlcmV1bXMtZGVuY3VuLXVwZ3JhZGUtYmVnaW4tdGVzdGluZy0xMTU3NTg0OTYuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Ethereum's Dencun Upgrade To Begin Testing on Goerli Testnet on January 17 - Yahoo Finance",
        "content": "Ethereum's Dencun Upgrade To Begin Testing on Goerli Testnet on January 17\n\nEthereum's upcoming \"Dencun\" upgrade (also known as \"Cancun-Deneb\"), will begin testing on the Goerli testnet on January 17, according to an official note published on the Ethereum GitHub repository.\n\nThe upgrade will then be added to the Sepolia testnet on January 30 and Holesky on February 7. The Ethereum team has not yet announced when Dencun will be implemented on the mainnet.\n\nThe Dencun upgrade includes several tools aimed at reducing fees, enabling new features for bridges and staking pools, and limiting the use of self-destruct operations on smart contracts.\n\nOne of the key features of Dencun is the inclusion of Ethereum Improvement Proposal (EIP) 4844, also known as \"proto-danksharding.\"\n\nThis will allow layer-2 (L2) rollup networks to store certain transaction data temporarily using a new format called \"blobs.\" Blobs can be deleted after 18 days, significantly reducing transaction fees on layer 2s. This is a highly anticipated upgrade for L2s like Arbitrum and Optimism.\n\nOther notable proposals in the Dencun upgrade include:\n\nEIP-1153: Introduces a \"transient storage\" system to further reduce fees.\n\nEIP-4788: Increases transparency by storing the root of each Beacon Chain block in a smart contract.\n\nEIP-6780: Limits the use of the self-destruct keyword to prevent the erasure of smart contract code and the transfer of funds to the deployer.\n\nEthereum upgrades typically undergo testing for a few months before being deployed to the mainnet. The previous upgrade, codenamed \"Shapella,\" began testing in February and was launched to the mainnet in April. Shapella was a major upgrade and saw Ethereum transition from proof-of-work to proof-of-stake."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ldGhlcmV1bXMtZGVuY3VuLXVwZ3JhZGUtYmVnaW4tdGVzdGluZy0xMTU3NTg0OTYuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Ethereum's Dencun Upgrade To Begin Testing on Goerli Testnet on January 17 - Yahoo Finance",
        "content": "Ethereum's Dencun Upgrade To Begin Testing on Goerli Testnet on January 17\n\nEthereum's upcoming \"Dencun\" upgrade (also known as \"Cancun-Deneb\"), will begin testing on the Goerli testnet on January 17, according to an official note published on the Ethereum GitHub repository.\n\nThe upgrade will then be added to the Sepolia testnet on January 30 and Holesky on February 7. The Ethereum team has not yet announced when Dencun will be implemented on the mainnet.\n\nThe Dencun upgrade includes several tools aimed at reducing fees, enabling new features for bridges and staking pools, and limiting the use of self-destruct operations on smart contracts.\n\nOne of the key features of Dencun is the inclusion of Ethereum Improvement Proposal (EIP) 4844, also known as \"proto-danksharding.\"\n\nThis will allow layer-2 (L2) rollup networks to store certain transaction data temporarily using a new format called \"blobs.\" Blobs can be deleted after 18 days, significantly reducing transaction fees on layer 2s. This is a highly anticipated upgrade for L2s like Arbitrum and Optimism.\n\nOther notable proposals in the Dencun upgrade include:\n\nEIP-1153: Introduces a \"transient storage\" system to further reduce fees.\n\nEIP-4788: Increases transparency by storing the root of each Beacon Chain block in a smart contract.\n\nEIP-6780: Limits the use of the self-destruct keyword to prevent the erasure of smart contract code and the transfer of funds to the deployer.\n\nEthereum upgrades typically undergo testing for a few months before being deployed to the mainnet. The previous upgrade, codenamed \"Shapella,\" began testing in February and was launched to the mainnet in April. Shapella was a major upgrade and saw Ethereum transition from proof-of-work to proof-of-stake."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvc29sYW5hcy1zY29yY2hpbmctcmFsbHktc2hvd3MtZXRoZXJldW0taGFzLWEtc2VyaW91cy1jb21wZXRpdG9y0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Solana's Scorching Rally Shows Ethereum Has a Serious Competitor - Nasdaq",
        "content": "Solana [SOL] generated tremendous hype in 2021, with fans touting its ability to solve the Ethereum [ETH] blockchain's core problem. Solana, it was promised, would be a cheaper and faster place to handle transactions, a better springboard for decentralized finance, or DeFi, and other activities powered by smart contracts.\n\nThen came 2022 and all that pain. Things looked bleak for Solana (and, let's be honest, most of crypto). It didn't help that Sam Bankman-Fried was closely linked to Solana and its SOL token, which sank below $10.\n\nYou're reading Crypto Long & Short, our weekly newsletter featuring insights, news and analysis for the professional investor. Sign up here to get it in your inbox every Wednesday.\n\nSOL was back in the $20s in October as SBF was on trial. Then, all of a sudden, Solana and SOL turned into just about the hottest things going. SOL is above $100 now for the first time since early 2022 and, at $47 billion, it's the fifth-biggest crypto – and it was briefly fourth-biggest earlier this week.\n\nName Market Capitalization Bitcoin (BTC) $854 billion Ethereum (ETH) $288 billion Tether (USDT) $92 billion BNB $49 billion Solana (SOL) $47 billion XRP $35 billion\n\nMy colleague Danny Nelson cogently summed up recent events this weekend when SOL exceeded $100:\n\nSaturday's price action capped weeks of frenzied trading that have – at least temporarily – vaulted the Solana blockchain up the leaderboard for on-chain activity. Solana-based decentralized exchanges are nearing Uniswap's multibillion-dollar trading volumes for the first time, according to DefiLlama. Much of that energy is being driven by rampant speculation.\n\nSome of the most popular crypto assets being traded on Solana right now are dog-themed meme coins. But airdrops, too, are prompting droves of traders to test out Solana-based lenders, bridges and other infrastructure.\n\nEthereum remains the leader among layer-1 blockchains that can run smart contracts, aka the bedrock of DeFi. Ethereum has $29 billion of total value locked, a measure of money stashed in a particular blockchain's ecosystem, far exceeding Solana's $1.5 billion, according to DefiLlama data.\n\nBut recent events show Solana may be a serious competitor now.\n\nHere's what else is on my mind in this holiday-shortened week:\n\nA LONG DECADE: The failure amid a hack of Mt. Gox a decade ago was a milestone for the industry, an early sign crypto would need better infrastructure to thrive or, at least, survive. Some 850,000 bitcoins were stolen in that incident, a hoard now worth about $36 billion. All these years later, it appears former customers are starting to get repaid. From CoinDesk's coverage: \"The repayment could have some impact on bitcoin prices, due to the sheer volume of the tokens being released, but would not destablize the market, UBS had said in a report earlier this year.\"\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    }
]