[
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOS8yMy9pcy1ldGhlcmV1bS1ib3R0b20taW4tdG9wLWFuYWx5c3QtcmV2ZWFscy10aGUtbm8tcXVlc3Rpb25zLWFza2VkLWxldmVsLWhlLXdpbGwtc3RhcnQtcmVhY2N1bXVsYXRpbmctZXRoL9IBjQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOS8yMy9pcy1ldGhlcmV1bS1ib3R0b20taW4tdG9wLWFuYWx5c3QtcmV2ZWFscy10aGUtbm8tcXVlc3Rpb25zLWFza2VkLWxldmVsLWhlLXdpbGwtc3RhcnQtcmVhY2N1bXVsYXRpbmctZXRoL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Sep 2023 07:00:00 GMT",
        "title": "Is Ethereum Bottom In? Top Analyst Reveals the ‘No Questions Asked’ Level He Will Start Reaccumulating ETH - The Daily Hodl",
        "content": "A top crypto analyst is detailing his outlook on Ethereum (ETH) amid tepid price movements in the crypto market.\n\nIn a new video, pseudonymous analyst Bluntz says that Ethereum is likely witnessing the final stage of a corrective move while trading within an ascending triangle pattern.\n\nAccording to the analyst, Ethereum could print a bullish higher low setup to cap off the correction before breaking out and rallying to a fresh all-time high.\n\n“If ETH did pop down to one more new low and wicked that level at $1,430, $1,440, I would definitely, no questions asked, be looking to buy for some longer-term bags because overall I do still think that the major bottom is in and this is probably some kind of accumulation period here [between roughly $1,400 to $2,000] and then that would then would be buying the bottom of the range.\n\nOn this next leg down, I’d be positioning myself to take longs to potentially new all-time highs.”\n\nOn the likely price action of Ethereum over the short term, the pseudonymous crypto analyst and trader says,\n\n“Right now I think probably we’re probably still in chop here. I do think we’re probably going to go sideways for a bit longer and then break down to a new low [at around $1,430].”\n\nEthereum is trading at $1,595 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2V0aGVyZXVtcy1kZW5jdW4tdXBncmFkZS1saWtlbHktZGVsYXllZC1pbnRvLTIwMjQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Sep 2023 07:00:00 GMT",
        "title": "Ethereum's 'Dencun' upgrade likely delayed into 2024 - CryptoSlate",
        "content": "Ethereum’s next major upgrade, Dencun, will likely see a delayed launch according to statements from developers during a meeting on Sept. 21.\n\nThough Dencun is largely complete, it is still under development and in need of testing. Tim Beiko, a member of the Ethereum Foundation, said that Dencun still must be deployed to a testnet. He added that the timing of this step could delay Cancun’s launch on the Ethereum mainnet — where real transactions occur — into the new year.\n\nBeiko said during the meeting:\n\n“I think the implication is, if we don’t do a test net before Devconnect [Nov. 13-18] … it’s probably unlikely we can do mainnet before the … Christmas holidays … and people being gone so that’s probably not the best time for committment.”\n\nDevelopers previously did not give Dencun a definite date, but most previous estimates suggested that the upgrade would go live before the end of 2023.\n\nDevs consider target testnet\n\nNews of a possible Dencun delay comes shortly after Ethereum’s Holesky testnet experienced launch issues. Holesky continues to wait for a relaunch.\n\nDuring the current meeting, Developers addressed whether the Holesky testnet will be available for Dencun testing prior to Devconnect in November. Ethereum Foundation member Parithosh Jayanthi said that Holesky’s relaunch is set to take place on Sept. 28 and will be ready for Dencun testing before the upcoming conference.\n\nJayanthi nevertheless suggested testing Dencun’s first fork on an older testnet, Goerli, which will soon be discontinued. He noted that the end of Goerli’s lifespan means that any issues related to Dencun will be isolated to that testnet.\n\nJayanthi additionally suggested that Dencun’s second and third forks could be tested on the new Holesky testnet at a later date. “If [Dencun] goes badly on Holesky, then we have to figure out how to save it,” Jayanthi concluded.\n\nDencun will combine two upgrades, Deneb and Cancun, and will bring various new features. The most notable of those features is proto-danksharding, which will improve Ethereum’s scalability when finally arrives on mainnet."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtZmVlcy1oaXQteWVhcmx5LWxvd3MtaGVyZXMtd2hlcmUtdGhpcy1taWdodC1sZWFk0gFRaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtLWV0aC1mZWVzLWhpdC15ZWFybHktbG93cy1oZXJlcy13aGVyZS10aGlzLW1pZ2h0LWxlYWQ_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Sep 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Fees Hit Yearly Lows, Here's Where This Might Lead - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAccording to Santiment, an on-chain analytics firm, Ethereum's average fees have decreased to their lowest levels since 2023. It stated that the average Ethereum transaction fee has dropped to $1.15, the lowest since Dec. 26, 2022.\n\nAdvertisement\n\nSantiment emphasizes the historical significance of this as Ethereum's network fees reach yearly lows. Based on historical precedents, utility may begin to rise as ETH becomes less costly to circulate. This increased utility could ultimately contribute to market cap levels rebounding.\n\n🤑 #Ethereum network fees have dropped down to its lowest level of 2023, at just $1.15 per transaction. Historically, we see utility begin rising as $ETH becomes more affordable to circulate. Increased utility can then lead to recovering market cap levels. https://t.co/MpOLfMYKUp pic.twitter.com/JI8ZLhmb4p — Santiment (@santimentfeed) September 23, 2023\n\n\"Ethereum network fees have dropped down to its lowest level of 2023, at just $1.15 per transaction. Historically, we see utility begin rising as ETH becomes more affordable to circulate. Increased utility can then lead to recovering market cap levels,\" Santiment tweeted.\n\nAt the time of writing, Ethereum was trading near $1,594, just below $1,600. If the utility that arises from decreased fees impacts prices, ETH may attempt an upside move that targets the $1,692 and $1,804 levels next.\n\nIf this is accomplished, Ethereum may retest the $2,000 mark last seen in July. ETH, on the other hand, is gaining support just below its current level of $1,540.\n\nETH total fees drop to nine-month lows\n\nAccompanying the drop in average fees, Ethereum network fees, which refer to the sum of total fees spent to utilize the blockchain, also fell to a nine-month low of $22.1 million in the week.\n\nPer IntoTheBlock data, total fees on Ethereum fell during the week by 9.3%, while ETH saw negative exchange flows of $130 million, a decrease of $20 million. The net amount of inflows minus outflows of a certain crypto-asset going in or out of centralized exchanges is referred to as exchange netflows.\n\nEthereum's falling fees, which are being driven in part by L2 adoption, might be putting some pressure on the second-largest crypto asset, as its supply has been increasing over the last month, reversing its deflationary trend."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tbmV0d29yay1mZWVzLWhpdC0yMDIzLWxvdy13aGF0LWl0LWNvdWxkLW1lYW4tZm9yLWV0aC1wcmljZS_SAW5odHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2V0aGVyZXVtL2V0aGVyZXVtLW5ldHdvcmstZmVlcy1oaXQtMjAyMy1sb3ctd2hhdC1pdC1jb3VsZC1tZWFuLWZvci1ldGgtcHJpY2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Network Fees Hit 2023 Low: What It Could Mean For ETH Price - NewsBTC",
        "content": "In recent weeks, Ethereum (ETH), one of the most valuable assets in the cryptocurrency market, has not enjoyed favorable sentiment due to its struggling price and unstable on-chain performance. The general market condition has not offered much reprieve either, as most altcoins have failed to maintain an upward momentum. Fortunately, the latest on-chain revelation offers some hope for the price of Ethereum.\n\nEthereum Average Fee Drops To Lowest Level In 2023\n\nOn-chain analytics have been helpful in providing real-time insights into crypto market trends. And the latest on-chain revelations have highlighted a plunge in Ethereum network fees, which might prove to be a turning point for the cryptocurrency’s market value and performance.\n\nAccording to the on-chain analytics platform, Santiment, the Ethereum network fees have dropped to their lowest levels in 2023, with each transaction averaging about $1.15 as of this writing. This reflects a significant fall from the huge fees seen in 2021 and 2022, with demand for processing power causing the average fees to reach above $50.\n\nHistorically, such a decline in fees is a positive sign for Ethereum’s utility and adoption, as lower costs make it more profitable and worthwhile to use the network. Santiment also noted that rising utility is often the case due to Ether tokens becoming more affordable to circulate.\n\nIt is worth noting that the impact of this development can spread to the overall market value of the digital asset. Increased utility and adoption can contribute to the recovery of Ethereum’s market capitalization and value.\n\nThe Effect On ETH Price?\n\nIndeed, the plunging network fees positively benefit Ethereum and its users, especially as it can improve other network metrics and parameters. However, this development has not significantly impacted ETH price, as it seems to be struggling to break out from under the current selling pressure.\n\nOn Thursday, September 21, the cryptocurrency fell beneath the psychological $1,600 level for the second time this month. And the Ether token continues to trade below this price mark, with a roughly 2.6% decline in the past three days.\n\nInvestors will be watching to see if Ethereum can build positive network momentum while fees are low. However, it remains to be seen whether this will be enough to propel the ETH price out of consolidation, especially as there are no signs of buying pressure from Ethereum whales.\n\nThere are no signs of buying pressure from #Ethereum whales yet! pic.twitter.com/oqBbdbaOlb — Ali (@ali_charts) September 21, 2023\n\nMoreover, the dwindling number of major ETH holders adds zero optimism to this scenario. This is because such a decline in whale holdings can make the Ethereum price increasingly susceptible to downward pressure.\n\nAccording to CoinGecko data, the Ether token trades for $1,593, reflecting a 2.6% price dip in the past week. Ethereum is currently the second-largest cryptocurrency, with a market capitalization of $191.6 billion.\n\nEthereum price trading below $1,600 on the daily timeframe | Source: TOTAL chart on TradingView\n\nFeatured image from The Economic Times, chart from TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9iaXRjb2luLXByaWNlLWV0aGVyZXVtLXByZWRpY3Rpb24tbWluaW1hbC0xLWZsdWN0dWF0aW9ucy1vZmZlci10cmFkaW5nLWluc2lnaHRzLWZvci1idGMtZXRoLmh0bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin Price and Ethereum Prediction: Minimal 1% Fluctuations Offer Trading Insights for BTC and ETH - Cryptonews",
        "content": "Bitcoin Price and Ethereum Prediction: Minimal 1% Fluctuations Offer Trading Insights for BTC and ETH\n\nBitcoin and Ethereum, two paramount forces in the cryptocurrency realm, are currently experiencing minimal fluctuations of around 1%. They are trading near $26,500 and $1,600, respectively, with an intriguing neutrality, potentially influenced by a tempered trading volume.\n\nSuch a tight trading range can often serve as a harbinger for a breakout, and as investors eagerly scrutinize each shift, it becomes paramount to understand the underlying sentiments.\n\nAt the same time, the Fear & Greed Index remains neutral, suggesting indecision among investors. This could be one of the reasons behind the neutral trading bias in the cryptocurrency market.\n\nLet’s now dive into the technical aspects of the BTC/USD and ETH/USD pairs.\n\nBitcoin Price\n\nAs of the latest update, Bitcoin is priced at $26,557, boasting a 24-hour trading volume of $10 billion. Reflecting a modest decline, the digital asset has depreciated by 0.31% over the past day.\n\nIt retains its premier position on CoinMarketCap, supported by a live market capitalization of approximately $517.69 billion.\n\nThe available circulating supply registers at 19,493,312 BTC coins, approaching its predefined maximum of 21,000,000 BTC coins\n\nBitcoin Price Prediction\n\nFrom a technical perspective, Bitcoin demonstrates increased market sensitivity, recently surpassing the critical support level pegged at $26,600.\n\nThis benchmark previously acted as a resistance point. However, consistent confirmations, most notably on the 4-hour chart, have elevated its significance as a robust support zone for the cryptocurrency.\n\nFollowing its descent below the $26,650 mark, Bitcoin seems to gravitate towards an immediate support level of $26,300.\n\nAs evidenced on the 4-hour chart, the cryptocurrency now positions itself beneath the 50-day exponential moving average and has deviated from its prior ascending trajectory.\n\nBitcoin Price Chart – Source: Tradingview\n\nShould this downward trend continue, Bitcoin’s next target could potentially be the $25,511 mark.\n\nConversely, overcoming the $27,000 threshold might set Bitcoin on a trajectory towards $27,500.\n\nThis $27,000 juncture, underscored by the 50-day average, is a decisive pivot point dictating Bitcoin’s forthcoming market direction.\n\nEthereum Price\n\nEthereum is currently trading for $1,593, accompanied by a 24-hour trading volume of $3 billion. The cryptocurrency has seen a marginal appreciation of just under 0.10% over the preceding 24 hours.\n\nEthereum maintains its position as the second-ranked asset on CoinMarketCap, boasting a live market capitalization of $191 million.\n\nThere’s a circulating supply of 120,227,075 ETH coins, with its maximum supply data undisclosed.\n\nEthereum Price Prediction\n\nThe ETH/USD pair exhibits a turbulent trading pattern, encountering immediate resistance at $1,600 and support near the $1,575 mark.\n\nA breakout from this defined range could catalyse subsequent price movements.\n\nShould ETH successfully breach the $1,600 threshold, ensuing resistance may be anticipated around $1,625, with a more formidable barrier emerging near the double-top pattern of approximately $1,660.\n\nBitcoin Price Chart – Source: Tradingview\n\nConversely, if there’s a bearish descent beyond the $1,575 point, the trajectory might steer Ethereum’s price towards the $1,535 mark.\n\nConcurrently, the 50-day EMA, RSI, and MACD indicators all lean towards a bearish inclination, as is evident in the accompanying chart.\n\nInvestors would do well to monitor the $1,575 juncture, as a downward shift past this could unveil further selling prospects.\n\nTop 15 Cryptocurrencies to Watch in 2023\n\nGet ahead of the game in the world of digital assets by checking out our carefully curated selection of the top 15 alternative cryptocurrencies and ICO projects to watch for in 2023.\n\nOur list is compiled by industry experts from Industry Talk and Cryptonews, so you can expect professional recommendations and valuable insights for your cryptocurrency investments.\n\nStay updated and discover the potential of these digital assets.\n\nFind The Best Price to Buy/Sell Cryptocurrency\n\nCrypto Price Tracker – Source: Cryptonews\n\nDisclaimer: Cryptocurrency projects endorsed in this article are not the financial advice of the publishing author or publication – cryptocurrencies are highly volatile investments with considerable risk, always do your own research."
    }
]