[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vdS50b2RheS90aGlzLWV0aGVyZXVtLXVwZ3JhZGUtbWlnaHQtY2hhbmdlLW5mdHMtc2VnbWVudC1mb3ItZ29vZC1oZXJlcy1ob3fSAVZodHRwczovL3UudG9kYXkvdGhpcy1ldGhlcmV1bS11cGdyYWRlLW1pZ2h0LWNoYW5nZS1uZnRzLXNlZ21lbnQtZm9yLWdvb2QtaGVyZXMtaG93P2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 17 Jun 2023 07:00:00 GMT",
        "title": "This Ethereum Upgrade Might Change NFTs Segment for Good, Here's How - U.Today",
        "content": "Advertisement\n\nAn eccentric Ethereum Improvement Proposal (EIP) introduced one month ago can totally change the technical design and economics of the segment of non-fungible tokens (NFTs). Besides paving the way for new generations of NFTs, it can advance the tooling of existing Apes and Mutants.\n\nERC-6551 blurs lines between NFTs, smart contracts and wallets\n\nPresented only five weeks ago, ERC-6551 opens up a plethora of previously unseen opportunities for the NFT and digital identity space. Such conclusion was made by The Spartan Group's VC arm Spartan Labs.\n\nERC-4337 was one of the biggest developments for the wallet space earlier this year.\n\n\n\nBut ERC-6551 is building on that to revolutionise the NFT space. ERC-6551 will change the way we view NFTs and digital identities.\n\n\n\nHere's how, and why you should care 🧵 pic.twitter.com/dHwmXKDmic — Spartan Labs (@TheSpartanLabs) June 16, 2023\n\nThis EIP, co-authored by the founders of CryptoKitties, the first-ever commercially successful NFT collection, allows non-fungible tokens to control ERC-4337-enabled cryptocurrency wallets. For instance, NFTs can make transactions, store assets and, therefore, interact with DeFi protocols just like regular non-custodial wallets.\n\nThe scope of possibilities of ERC-6551-powered NFTs looks really endless. The owner of such NFTs can collect POAPs and display them in a transparent and tamper-proof form.\n\nIn decentralized games, such NFTs can be associated with in-game wallets. This, in turn, will make the gaming experience more immersive for various generations of players.\n\nAs of today, the ERC-6551: Non-fungible Token Bound Accounts proposal is labeled with a \"Draft\" status on Ethereum Foundation's portal for EIPs.\n\nWeb3 media, decentralized messaging, reputation management: Plenty of new NFT use cases\n\nSpartan Labs' researchers indicated a number of other interesting use cases for NFT-powered wallets. They might finally make Web3 publishing platforms mainstream thanks to more democratic content monetization models.\n\nThen, decentralized messengers' interfaces might be upgraded with such NFTs. Traders can even share the addresses of their NFTs to demonstrate their PnL and trade history — and this data cannot be altered, being visible to everyone via explorers.\n\nThis ERC is backward compatible, which means all existing NFTs can be equipped with the full range of ERC-6551 functionalities. This can radically change the narrative in the global NFT ecosystem."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8venljcnlwdG8uY29tL2V0aGVyZXVtLWRldnMta2ljay1hZ2FpbnN0LXVuaXN3YXBzLXY0LW9wZW4tc291cmNlLWZhaWxlZC1wcm9taXNlL9IBW2h0dHBzOi8venljcnlwdG8uY29tL2V0aGVyZXVtLWRldnMta2ljay1hZ2FpbnN0LXVuaXN3YXBzLXY0LW9wZW4tc291cmNlLWZhaWxlZC1wcm9taXNlLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 17 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Devs Kick Against Uniswap’s V4 Open Source “Failed” Promise - ZyCrypto",
        "content": "Advertisement\n\nUniswap’s new upgrade has sparked a new controversy regarding its “open source” description, with developers saying “it is not as advertised.”\n\nThe company released its fourth version on a Business Source License, giving room for critics due to its four-year open-source period.\n\nUniswap has responded to critics explaining that four years is not a long time to balance incentivizing innovation and giving out exclusive rights.\n\nThis week, Uniswap’s developers noted that the new version of the decentralized exchange (DEX) will offer users limitless possibilities; while that may be true, some promises were not.\n\nPrior to the launch of Uniswap’s V4, the management team made several promises from the increased utility of the exchange to its open-source nature which attracted the attention of developers. The promise of it being open-source has been called a “misrepresentation” by a cross-section of Ethereum’s community.\n\nThe V4 was released as a Business Source License (BSL), which means that its code is open to the public and can be copied, reproduced, and redistributed, but there’s a caveat. All these can only be done after four years when it converts to a General Purpose License (GPL).\n\nLefteris Karapetsas, an Ethereum developer and founder of Rotki, expressed his displeasure stating that “Uniswap decided to go with a Business Source License (BSL), continuing what they did with v3. The reason is they don’t understand open source, and they believe their moat is their code which is wrong.” He was the first to call out Uniswap on Twitter and urged them to use the proper terminology as this “is insulting to actual open-source software.”\n\nAnother dev, Scott Lewis, pointed out that Unisawap’s V4 is a four-year proprietary license adding that “If anyone else misrepresented the truth like this, they would be torn to shreds. That’s the power of being powerful.”\n\nAdvertisement\n\nUniswap defend their “false” claims\n\nHayden Adams the founder of Uniswap alongside his development team addressed the controversy on YouTube. The group noted that the four-year period is not as long time as it appears, and it strikes a healthy balance between “incentivizing innovation and giving exclusive rights to the protocol, which has precedents in ‘normal’ settings as well.”\n\nGabriel Shapiro describes it as a tax on innovation, explaining further that it would be difficult for young devs to navigate while building from scratch.\n\n“Anyone who’s looked at BSL code even once, and then later codes something similar, is at a risk of catching a copyright claim,” he added.\n\nDespite the criticisms meted out against Uniswap, many have hailed the V4 for rolling out a new smart contract termed “hooks” which lets developers expand liquidity pools increasing customizability."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMizgFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWluLWluZGlhLWp1bmUtMTctY2hlY2stbWFya2V0LWNhcC1iaXRjb2luLWV0aGVyZXVtLW1lcmdlLWRvZ2Vjb2luLXNvbGFuYS1saXRlY29pbi1yaXBwbGUteHJwLWJpbmFuY2UtdG9rZW4tcW50LXByaWNlcy1nYWluZXItbG9zZXItMTYwOTYwNNIB0gFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWluLWluZGlhLWp1bmUtMTctY2hlY2stbWFya2V0LWNhcC1iaXRjb2luLWV0aGVyZXVtLW1lcmdlLWRvZ2Vjb2luLXNvbGFuYS1saXRlY29pbi1yaXBwbGUteHJwLWJpbmFuY2UtdG9rZW4tcW50LXByaWNlcy1nYWluZXItbG9zZXItMTYwOTYwNC9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 17 Jun 2023 07:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin, Ethereum See Gains As Quant Becomes Top Gainer - ABP Live",
        "content": "Bitcoin (BTC) and Ethereum (ETH) — two of the most valued crypto coins — managed to rise above the $26,000 and $17,00 marks, respectively, on early Saturday morning. Other popular altcoins — including the likes of Ethereum (ETH) and Dogecoin (DOGE) — landed in the positive as overall prices saw minor gains across the board. Quant (QNT) emerged to be the biggest gainer, seeing a 24-hour jump of over 18.30 percent. BitTorrent(New) (BTT), on the other hand, turned out to be the biggest loser.\n\nAt the time of writing, the global crypto market cap stood at $1.06 trillion, registering a 24-hour gain of 2.22 percent.\n\nBitcoin (BTC) price today\n\nBitcoin price stood at $26,293.73 seeing a 24-hour gain of 3.02 percent, as per CoinMarketCap. According to the Indian exchange WazirX, BTC price stood at Rs 23.23 lakhs.\n\nEthereum (ETH) price today\n\nETH price stood at $1,721.78, marking a 24-hour gain of 3.38 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 1.53 lakhs.\n\nDogecoin (DOGE) price today\n\nDOGE registered a 24-hour gain of 0.54 percent as per CoinMarketCap data, currently priced at $0.06199. As per WazirX, Dogecoin price in India stood at Rs 5.4569.\n\nLitecoin (LTC) price today\n\nLitecoin saw a 24-hour gain of 1.76 percent. At the time of writing, it was trading at $76.30. LTC price in India stood at Rs 6,654.73.\n\nRipple (XRP) price today\n\nXRP price stood at $0.4737, seeing a 24-hour loss of 1.16 percent. As per WazirX, Ripple price stood at Rs 41.6064.\n\nSolana (SOL) price today\n\nSolana price stood at $15.52, marking a 24-hour gain of 4.93 percent. As per WazirX, the SOL price in India stood at Rs 1,356.01.\n\nTop crypto gainers today (June 17)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nQuant (QNT)\n\nPrice: $114.95\n\n24-hour gain: 18.30 percent\n\nFrax Share (FXS)\n\nPrice: $5.65\n\n24-hour gain: 16.82 percent\n\nSui (SUI)\n\nPrice: $0.7338\n\n24-hour gain: 11.78 percent\n\nPepe (PEPE)\n\nPrice: $0.0000009869\n\n24-hour gain: 8.50 percent\n\nTrust Wallet Token (TWT)\n\nPrice: $0.9333\n\n24-hour gain: 8.32 percent\n\nTop crypto losers today (June 17)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nBitTorrent(New) (BTT)\n\nPrice: $0.0000005035\n\n24-hour loss: 2.38 percent\n\nFlare (FLR)\n\nPrice: $0.01442\n\n24-hour loss: 1.93 percent\n\nRipple (XRP)\n\nPrice: $0.4733\n\n24-hour loss: 1.40 percent\n\nEOS (EOS)\n\nPrice: $0.6309\n\n24-hour loss: 0.71 percent\n\nChainlink (LINK)\n\nPrice: $5.26\n\n24-hour loss: 0.47 percent\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vYW1iY3J5cHRvLmNvbS93aHktZXRoZXJldW1zLXByaWNlLXJpc2UtaXMtbm90LWNhdXNlLWZvci1jZWxlYnJhdGlvbi15ZXQv0gFUaHR0cHM6Ly9hbWJjcnlwdG8uY29tL3doeS1ldGhlcmV1bXMtcHJpY2UtcmlzZS1pcy1ub3QtY2F1c2UtZm9yLWNlbGVicmF0aW9uLXlldC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 17 Jun 2023 07:00:00 GMT",
        "title": "Why Ethereum’s price rise is not cause for celebration yet - AMBCrypto News",
        "content": "Ethereum’s price increased by nearly 2% in the last 24 hours.\n\nHowever, market indicators were bearish, suggesting a change in trends.\n\nThe Binance and Coinbase episode with the US Securities Exchange Commission caused havoc in the crypto industry. It caused a decline in the supply of Bitcoin [BTC] and Ethereum [ETH] on Binance, suggesting that investors were losing confidence in CEXes.\n\nRead Ethereum’s [ETH] Price Prediction 2023-24\n\nEthereum investors’ confidence in Binance declined\n\nGlassnode’s latest tweet revealed that after the SEC incident, investors actively withdrew their ETH and BTC from Binance. As per the tweet, Ethereum’s balance on Binance was around 4.56 million to 4.2 million.\n\nSince the SEC charges, the #Bitcoin and #Ethereum Balance on #Binance has declined by -48K BTC and -360K ETH respectively. ? BTC Balance: 706K BTC to 658K BTC (-48K BTC)\n\n? ETH Balance: 4.56M ETH to 4.2M ETH (-360K ETH) pic.twitter.com/rOKZpfgJwn — glassnode (@glassnode) June 15, 2023\n\nThis indicated that they were losing faith in the CEX. In order to keep their holdings safe, investors were moving their assets to self-custody, or DEXes. This was evident from Dune’s data.\n\nAfter a decline, ETH’s volume on DEXes registered an uptick, as per the chart ETH’s DEX volume has increased on multiple projects such as Curve [CRV], Uniswap [UNI], and more since 11 June.\n\nEthereum’s revenue has plummeted\n\nIt was interesting to see that ETH generated the highest revenue in Q1, driven by its high usage and gas fees. According to Messari’s recent tweet, Ethereum’s revenue was $457 million, almost 2.8 times the combined revenue of all other featured L1s.\n\n.@Ethereum generated the highest revenue in Q1, driven by its high usage and gas fees. Its revenue was $457M, almost 2.8x the combined revenue of all other featured L1s.@Hedera had the most significant revenue growth, up 489% QoQ, driven by its Consensus Service. pic.twitter.com/ybTQJhIq7I — Messari (@MessariCrypto) June 16, 2023\n\nHowever, things changed in the second quarter of this year. Token Terminal’s data revealed that ETH’s revenue had declined. After spiking on 5 May 2023, Ethereum’s revenue plummeted sharply, which was not good for the blockchain.\n\nETH investors had a good day\n\nThough ETH’s revenue declined, the token’s price moved the other way. According to CoinMarketCap, ETH’s price has increased by nearly 2% in the last 24 hours. At the time of writing, it was trading at $1,665.31, with a market capitalization of over $200 billion.\n\nAs per CryptoQuant, Ethereum’s Relative Strength Index (RSI) was in an oversold position. This might have increased buying pressure and pushed up the token’s price. Ethereum’s exchange reserve was also green, suggesting that the token was not under selling pressure.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nHere is the catch\n\nA look at ETH’s daily chart suggested that the uptrend might continue as the market indicators looked bearish. The MACD displayed a bullish upperhand in the market.\n\nEthereum’s Chaikin Money Flow (CMF) also registered a downtick. Additionally, its Exponential Moving Average (EMA) Ribbon also pointed out that the bears were leading the market, as the 20-day EMA was below the 55-day EMA."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vYW1iY3J5cHRvLmNvbS93aHktZXRoZXJldW1zLXByaWNlLXJpc2UtaXMtbm90LWNhdXNlLWZvci1jZWxlYnJhdGlvbi15ZXQv0gFUaHR0cHM6Ly9hbWJjcnlwdG8uY29tL3doeS1ldGhlcmV1bXMtcHJpY2UtcmlzZS1pcy1ub3QtY2F1c2UtZm9yLWNlbGVicmF0aW9uLXlldC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 17 Jun 2023 07:00:00 GMT",
        "title": "Why Ethereum’s price rise is not cause for celebration yet - AMBCrypto News",
        "content": "Ethereum’s price increased by nearly 2% in the last 24 hours.\n\nHowever, market indicators were bearish, suggesting a change in trends.\n\nThe Binance and Coinbase episode with the US Securities Exchange Commission caused havoc in the crypto industry. It caused a decline in the supply of Bitcoin [BTC] and Ethereum [ETH] on Binance, suggesting that investors were losing confidence in CEXes.\n\nRead Ethereum’s [ETH] Price Prediction 2023-24\n\nEthereum investors’ confidence in Binance declined\n\nGlassnode’s latest tweet revealed that after the SEC incident, investors actively withdrew their ETH and BTC from Binance. As per the tweet, Ethereum’s balance on Binance was around 4.56 million to 4.2 million.\n\nSince the SEC charges, the #Bitcoin and #Ethereum Balance on #Binance has declined by -48K BTC and -360K ETH respectively. ? BTC Balance: 706K BTC to 658K BTC (-48K BTC)\n\n? ETH Balance: 4.56M ETH to 4.2M ETH (-360K ETH) pic.twitter.com/rOKZpfgJwn — glassnode (@glassnode) June 15, 2023\n\nThis indicated that they were losing faith in the CEX. In order to keep their holdings safe, investors were moving their assets to self-custody, or DEXes. This was evident from Dune’s data.\n\nAfter a decline, ETH’s volume on DEXes registered an uptick, as per the chart ETH’s DEX volume has increased on multiple projects such as Curve [CRV], Uniswap [UNI], and more since 11 June.\n\nEthereum’s revenue has plummeted\n\nIt was interesting to see that ETH generated the highest revenue in Q1, driven by its high usage and gas fees. According to Messari’s recent tweet, Ethereum’s revenue was $457 million, almost 2.8 times the combined revenue of all other featured L1s.\n\n.@Ethereum generated the highest revenue in Q1, driven by its high usage and gas fees. Its revenue was $457M, almost 2.8x the combined revenue of all other featured L1s.@Hedera had the most significant revenue growth, up 489% QoQ, driven by its Consensus Service. pic.twitter.com/ybTQJhIq7I — Messari (@MessariCrypto) June 16, 2023\n\nHowever, things changed in the second quarter of this year. Token Terminal’s data revealed that ETH’s revenue had declined. After spiking on 5 May 2023, Ethereum’s revenue plummeted sharply, which was not good for the blockchain.\n\nETH investors had a good day\n\nThough ETH’s revenue declined, the token’s price moved the other way. According to CoinMarketCap, ETH’s price has increased by nearly 2% in the last 24 hours. At the time of writing, it was trading at $1,665.31, with a market capitalization of over $200 billion.\n\nAs per CryptoQuant, Ethereum’s Relative Strength Index (RSI) was in an oversold position. This might have increased buying pressure and pushed up the token’s price. Ethereum’s exchange reserve was also green, suggesting that the token was not under selling pressure.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nHere is the catch\n\nA look at ETH’s daily chart suggested that the uptrend might continue as the market indicators looked bearish. The MACD displayed a bullish upperhand in the market.\n\nEthereum’s Chaikin Money Flow (CMF) also registered a downtick. Additionally, its Exponential Moving Average (EMA) Ribbon also pointed out that the bears were leading the market, as the 20-day EMA was below the 55-day EMA."
    }
]