[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMikgFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tZXRoLXBvbmRlcnMtc3RlZXAtY3Jhc2gtdG8tMS0wMDAtYXMtaXQtZW5jb3VudGVycy1rZXktaHVyZGxlLTIwMjMxMDIxMDU0MtIBlgFodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy9ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLWV0aC1wb25kZXJzLXN0ZWVwLWNyYXNoLXRvLTEtMDAwLWFzLWl0LWVuY291bnRlcnMta2V5LWh1cmRsZS0yMDIzMTAyMTA1NDI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 22 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Price Forecast: ETH crash to $1,000 can be prevented on the reclaim of a key resistance level - FXStreet",
        "content": "Share:\n\nEthereum price created a multi-month ascending triangle pattern that breached the downside.\n\nETH is currently retesting the $1,639 resistance level that has been pivotal for the past year.\n\nThe theoretical forecasting method hints at a 45% crash for ETH after the bearish breakout.\n\nEthereum (ETH) price breached its multi-month consolidation, favoring the bears. This breakout has caused panic among investors, and if the outlook does not improve for ETH, more downside is likely. While the weekend price action has given bulls some hope, ETH needs to overcome two key resistance levels before investors can breath a sigh of relief.\n\nRead more: Ether crosses $1.6K, Bitcoin SV leads Altcoin gains with 30% bump\n\nEthereum price at crossroads\n\nEthereum (ETH) price set up four higher lows and three equal highs since May 2022. Connecting key swing points using trend lines reveals an ascending triangle pattern. This technical formation is bullish, and a decisive breakout forecasts an uptrend equal to the distance between the first swing high and swing low.\n\nBut for Ethereum price, the breakout was bearish, which forecasts a 45% crash to $998. This target is obtained by adding the distance between the first swing high and swing low to the breakout point at $1,825.\n\nIn its descent, Ethereum price has already breached the $1,639 support level, which has been key for the past year. If buyers fail to overcome this hurdle, it is likely ETH will continue its southbound move and eventually tag the $1,000 psychological level. From the current position of $1,598, this descent would constitute a 38% crash.\n\nAlso read: Solana vs. Ethereum: Renewed debate erupts over efficiency, development and scalability\n\nETH/USDT 4-hour chart\n\nOn the other hand, Ethereum price has produced three distinctive higher lows over the past month, which are not confirmed by the Relative Strength Index (RSI). This non-conformity is termed as bullish divergence and often leads to a small rally to the upside.\n\nDue to the aforementioned bullish signal, if Ethereum price manages to flip the $1,639 hurdle into a support floor on the daily or three-day time frame, it could provide bulls a respite. This move could likely attract more sidelined buyers and potentially trigger a minor rally to retest the next key resistance levels at $1,767 and $2,000."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMC8yMi9vbmUtZXRoZXJldW0tcml2YWwtaXMtdGhlLWJlc3Qtbm9uLWNvbnNlbnN1cy1wbGF5LWZvci1uZXh0LWJ1bGwtcnVuLXNheXMtY3J5cHRvLWludmVzdG9yLWNocmlzLWJ1cm5pc2tlL9IBjQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMC8yMi9vbmUtZXRoZXJldW0tcml2YWwtaXMtdGhlLWJlc3Qtbm9uLWNvbnNlbnN1cy1wbGF5LWZvci1uZXh0LWJ1bGwtcnVuLXNheXMtY3J5cHRvLWludmVzdG9yLWNocmlzLWJ1cm5pc2tlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 22 Oct 2023 07:00:00 GMT",
        "title": "One Ethereum Rival Is the Best ‘Non-Consensus’ Play for Next Bull Run, Says Crypto Investor Chris Burniske - The Daily Hodl",
        "content": "A venture capitalist who called the bottom of the crypto bear market last year says that one of Ethereum’s (ETH) biggest rivals is the best contrarian altcoin play for the next bull run.\n\nCrypto investor Chris Burniske says that Solana (SOL) is the best “non-consensus” opportunity for an upcoming market expansion in the digital asset space.\n\nBurniske, the former head of crypto at Cathie Wood’s ARK Invest, says that SOL’s non-consensus status today is similar to ETH’s in the bear market of 2018.\n\n“ETH was non-consensus in 2018/2019, but is now consensus and anyone worth their salt as a crypto investor is there – quality asset.\n\nBut SOL is the strongest non-consensus asset of this bear. Watch out for when it becomes a consensus long, lots of momo investors will be scrambling.”\n\nLooking at Solana versus Ethereum (SOL/ETH), the investor says the pair looks like it may have enough steam to finally overcome the level that it lost during the collapse of the now-defunct crypto exchange FTX. FTX had close ties to Solana and its collapse brought uncertainty to the Ethereum competitor’s ecosystem.\n\n“SOL/ETH putting in some work to make 0.02 [ETH] happen, would close the FTX gap.”\n\nAt time of writing, SOL is trading for $29.51, up over 9% in the last 24 hours.\n\nThe crypto investor also says that other venture capitalists (VCs) are distracted with artificial intelligence (AI) and are missing out on the potential gains that could be had by picking up the discounts currently in the digital asset space.\n\n“VCs that are smug about crypto getting trashed, while AI has become the hot new thing, don’t realize the majority of overpriced AI rounds will be a graveyard for capital as the data incumbents mop the floor, while the low valuations we see in Web3 today will mint legends tomorrow.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS9mb3JlY2FzdC1ldGhlcmV1bS1ldGgtcHJpY2UtY291bGQtb3ZlcnRha2UtYml0Y29pbi10aGlzLXdlZWstMTM4Mjc3MtIBYGh0dHBzOi8vYW1wLmZ4ZW1waXJlLmNvbS9lbi9mb3JlY2FzdC1ldGhlcmV1bS1ldGgtcHJpY2UtY291bGQtb3ZlcnRha2UtYml0Y29pbi10aGlzLXdlZWsvMTM4Mjc3Mg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 22 Oct 2023 07:00:00 GMT",
        "title": "Forecast: Ethereum (ETH) Price Could Overtake Bitcoin This Week - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbi1ldGhlcmV1bS1kb2dlY29pbi1zcGlrZS1hcy0kNjVtLWluLXNob3J0cy1saXF1aWRhdGVkLWluLWEtc2luZ2xlLWRheTotYW5hbHlzdNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 22 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, Dogecoin Spike As $65M In Shorts Liquidated In A Single Day: Analyst Believes Major Bull Run ... - Nasdaq",
        "content": "Major cryptocurrencies experienced a significant surge on Sunday evening, propelled by Bitcoin’s impressive performance throughout the week. With prices soaring by approximately 10%, Bitcoin reached the psychologically significant milestone of $30,000.\n\nCryptocurrency Gains +/- Price (Recorded 9:30 p.m. EDT) Bitcoin (CRYPTO: BTC) +1.51% $30,334 Ethereum (CRYPTO: ETH) +3.10% $1,678 Dogecoin (CRYPTO: DOGE) +1.11% $0.062\n\nWhat Happened: This week, we witnessed a positive development in the cryptocurrency market as Bitcoin’s strength had a ripple effect on several altcoins, causing them to surge above their respective overhead resistance levels.\n\nAccording to data from CoinGlass, over $65 million worth of shorts were liquidated in the past 24 hours alone, contributing to a total of $98 million in total liquidations.\n\nAccording to a report by JPMorgan, the approval timing for spot Bitcoin ETFs is uncertain, but it is expected that they will be approved within the next few months, possibly before January 10, 2024. JPMorgan analysts stated in their report that the exact timing remains unclear, but it is likely to occur within months and most likely before the final deadline of Ark Invest and 21Shares applications on January 10, 2024.\n\nMeet and engage with transformative Digital Asset and Crypto business leaders and investors at Benzinga’s exclusive event – Future of Digital Assets. Tickets are flying- get yours!\n\nTop Gainer (24 Hour)\n\nCryptocurrency Gains +/- Price (Recorded 9:30 p.m. EDT) Aave +10.89% $76.83 Chainlink +7.64% $9.50 Quant +5.97% $93.63\n\nThe global crypto market cap currently stands at $1.11 trillion, reflecting an increase of 3.29% in the past 24 hours.\n\nStock futures are showing a slight uptick on Sunday night as traders anticipate the upcoming release of earnings reports from major tech companies. Futures tied to the Dow Jones Industrial Average have risen 59 points, or 0.18%.\n\nSimilarly, S&P 500 futures and Nasdaq 100 futures have climbed 0.23% and 0.15% respectively. These movements come after a challenging week for the stock market, with concerns about rising interest rates causing all three major indexes to enter negative territory. The S&P 500 ended the week 2.4% lower, marking its first losing week in three. The Dow Jones Industrial Average experienced a decline of 1.6%, while the Nasdaq Composite slumped 3.2%, resulting in its second consecutive losing week.\n\nOn Thursday, the yield on the 10-year U.S. Treasury surpassed the significant 5% level for the first time since July 2007. This increase was prompted by Federal Reserve Chairman Jerome Powell’s hawkish messaging during a speech at the Economic Club of New York.\n\nSee More: Best Cryptocurrency Scanners\n\nAnalyst Notes\n\nCrypto analyst Michael Van de Poppe believes that Bitcoin is currently encountering its next resistance level, which is estimated to be between $30,000 and $30,300. \"A breakout is ultimately going to lead towards a new yearly high. I don’t expect it as of yet, I’m assuming we’ll consolidate some more as CME closed at $29,690 too.\"\n\n#Bitcoin is currently facing the next resistance, which is $30,000-30,300.A breakout is ultimately going to lead towards a new yearly high.I don't expect it as of yet, I'm assuming we'll consolidate some more as CME closed at $29,690 too. pic.twitter.com/ybcj8zZEzC\n\n— Michaël van de Poppe (@CryptoMichNL) October 22, 2023\n\nPseudonymous analyst CrediBull on Wednesday stated that we have witnessed a significant development in the Bitcoin market. \"A beautiful weekly close- reclaiming the level from which we broke down nearly 2 months ago that led to the biggest liq event we have seen since the FTX collapse/bottom at 15k. If you’re lucky we get a clean retest of the green zone before continuation.\"\n\nA beautiful weekly close- reclaiming the level from which we broke down from nearly 2 months ago that led to the biggest liq event we have seen since the FTX collapse/bottom at 15k. If you're lucky we get a clean retest of the green zone before continuation. Send it. $BTC https://t.co/eVGkYwQJzt pic.twitter.com/3rsnaWK28h\n\n— CrediBULL Crypto (@CredibleCrypto) October 23, 2023\n\nSantiment, the on-chain analytics platform, has noticed a notable difference in Bitcoin’s recent move past the $30K resistance level. Unlike the previous two instances, where Bitcoin’s surge was not accompanied by a similar rise in altcoins, this time altcoins are also experiencing significant gains. Tokens like $LINK, $MATIC, $UIP, $APT, and $AAVE are witnessing their strongest decouplings of 2023.\n\n📈 Unlike #Bitcoin's previous two brief visits to $30K, this latest resistance level break to end the weekend has occurred as #altcoins surge, rather than falling behind $BTC's price. $LINK, $MATIC, $UIP, $APT, and $AAVE are all seeing their best performing decouplings of 2023. pic.twitter.com/ci7MPh25yf\n\n— Santiment (@santimentfeed) October 23, 2023\n\nJoin Benzinga’s Fintech Deal Day & Awards on Nov. 13 and Future of Digital Assets on Nov. 14 in New York City to stay updated on trends like AI, regulations, SEC actions and institutional adoption in the crypto space. Secure early bird discounted tickets now!\n\nPhoto by FellowNeko on Shutterstock\n\nRead Next: Jim Cramer Advises Against Using Binance, Provokes Strong Reactions From Twitter Users\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nGet insight into trading platforms. Compare the best online stock brokerages.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbi1ldGhlcmV1bS1kb2dlY29pbi1zcGlrZS1hcy0kNjVtLWluLXNob3J0cy1saXF1aWRhdGVkLWluLWEtc2luZ2xlLWRheTotYW5hbHlzdNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 22 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, Dogecoin Spike As $65M In Shorts Liquidated In A Single Day: Analyst Believes Major Bull Run ... - Nasdaq",
        "content": "Major cryptocurrencies experienced a significant surge on Sunday evening, propelled by Bitcoin’s impressive performance throughout the week. With prices soaring by approximately 10%, Bitcoin reached the psychologically significant milestone of $30,000.\n\nCryptocurrency Gains +/- Price (Recorded 9:30 p.m. EDT) Bitcoin (CRYPTO: BTC) +1.51% $30,334 Ethereum (CRYPTO: ETH) +3.10% $1,678 Dogecoin (CRYPTO: DOGE) +1.11% $0.062\n\nWhat Happened: This week, we witnessed a positive development in the cryptocurrency market as Bitcoin’s strength had a ripple effect on several altcoins, causing them to surge above their respective overhead resistance levels.\n\nAccording to data from CoinGlass, over $65 million worth of shorts were liquidated in the past 24 hours alone, contributing to a total of $98 million in total liquidations.\n\nAccording to a report by JPMorgan, the approval timing for spot Bitcoin ETFs is uncertain, but it is expected that they will be approved within the next few months, possibly before January 10, 2024. JPMorgan analysts stated in their report that the exact timing remains unclear, but it is likely to occur within months and most likely before the final deadline of Ark Invest and 21Shares applications on January 10, 2024.\n\nMeet and engage with transformative Digital Asset and Crypto business leaders and investors at Benzinga’s exclusive event – Future of Digital Assets. Tickets are flying- get yours!\n\nTop Gainer (24 Hour)\n\nCryptocurrency Gains +/- Price (Recorded 9:30 p.m. EDT) Aave +10.89% $76.83 Chainlink +7.64% $9.50 Quant +5.97% $93.63\n\nThe global crypto market cap currently stands at $1.11 trillion, reflecting an increase of 3.29% in the past 24 hours.\n\nStock futures are showing a slight uptick on Sunday night as traders anticipate the upcoming release of earnings reports from major tech companies. Futures tied to the Dow Jones Industrial Average have risen 59 points, or 0.18%.\n\nSimilarly, S&P 500 futures and Nasdaq 100 futures have climbed 0.23% and 0.15% respectively. These movements come after a challenging week for the stock market, with concerns about rising interest rates causing all three major indexes to enter negative territory. The S&P 500 ended the week 2.4% lower, marking its first losing week in three. The Dow Jones Industrial Average experienced a decline of 1.6%, while the Nasdaq Composite slumped 3.2%, resulting in its second consecutive losing week.\n\nOn Thursday, the yield on the 10-year U.S. Treasury surpassed the significant 5% level for the first time since July 2007. This increase was prompted by Federal Reserve Chairman Jerome Powell’s hawkish messaging during a speech at the Economic Club of New York.\n\nSee More: Best Cryptocurrency Scanners\n\nAnalyst Notes\n\nCrypto analyst Michael Van de Poppe believes that Bitcoin is currently encountering its next resistance level, which is estimated to be between $30,000 and $30,300. \"A breakout is ultimately going to lead towards a new yearly high. I don’t expect it as of yet, I’m assuming we’ll consolidate some more as CME closed at $29,690 too.\"\n\n#Bitcoin is currently facing the next resistance, which is $30,000-30,300.A breakout is ultimately going to lead towards a new yearly high.I don't expect it as of yet, I'm assuming we'll consolidate some more as CME closed at $29,690 too. pic.twitter.com/ybcj8zZEzC\n\n— Michaël van de Poppe (@CryptoMichNL) October 22, 2023\n\nPseudonymous analyst CrediBull on Wednesday stated that we have witnessed a significant development in the Bitcoin market. \"A beautiful weekly close- reclaiming the level from which we broke down nearly 2 months ago that led to the biggest liq event we have seen since the FTX collapse/bottom at 15k. If you’re lucky we get a clean retest of the green zone before continuation.\"\n\nA beautiful weekly close- reclaiming the level from which we broke down from nearly 2 months ago that led to the biggest liq event we have seen since the FTX collapse/bottom at 15k. If you're lucky we get a clean retest of the green zone before continuation. Send it. $BTC https://t.co/eVGkYwQJzt pic.twitter.com/3rsnaWK28h\n\n— CrediBULL Crypto (@CredibleCrypto) October 23, 2023\n\nSantiment, the on-chain analytics platform, has noticed a notable difference in Bitcoin’s recent move past the $30K resistance level. Unlike the previous two instances, where Bitcoin’s surge was not accompanied by a similar rise in altcoins, this time altcoins are also experiencing significant gains. Tokens like $LINK, $MATIC, $UIP, $APT, and $AAVE are witnessing their strongest decouplings of 2023.\n\n📈 Unlike #Bitcoin's previous two brief visits to $30K, this latest resistance level break to end the weekend has occurred as #altcoins surge, rather than falling behind $BTC's price. $LINK, $MATIC, $UIP, $APT, and $AAVE are all seeing their best performing decouplings of 2023. pic.twitter.com/ci7MPh25yf\n\n— Santiment (@santimentfeed) October 23, 2023\n\nJoin Benzinga’s Fintech Deal Day & Awards on Nov. 13 and Future of Digital Assets on Nov. 14 in New York City to stay updated on trends like AI, regulations, SEC actions and institutional adoption in the crypto space. Secure early bird discounted tickets now!\n\nPhoto by FellowNeko on Shutterstock\n\nRead Next: Jim Cramer Advises Against Using Binance, Provokes Strong Reactions From Twitter Users\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nGet insight into trading platforms. Compare the best online stock brokerages.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    }
]