[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vb3Bpbmlvbi9hcnRpY2xlcy8yMDIzLTEyLTE3L2lmLXlvdS1oZWxkLXlvdXItYml0Y29pbi1hbmQtZXRoZXJldW0tYWZ0ZXItZnR4LWNyYXNoLWl0LXMtY3J5cHRvbWFz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Dec 2023 08:00:00 GMT",
        "title": "If You Held Your Bitcoin and Ethereum After FTX Crash, It's Cryptomas! - Bloomberg",
        "content": "It's Merry Cryptomas, everybody! Bitcoin is up 167% year-to-date. Ethereum is up 91%. If a massive crypto rally was one of your predictions for 2023 a year ago, I take my hat off to you. Compare those returns with other asset classes. The NASDAQ is up 36%. The S&P 500 is up 19%. Gold is up 10.7%. If you were long oil or a broad basket of commodities, you are down 10%-12%.\n\nA year ago, many of us thought — I certainly did — that it was game over for crypto and that the naysayers were going to be vindicated."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vb3Bpbmlvbi9hcnRpY2xlcy8yMDIzLTEyLTE3L2lmLXlvdS1oZWxkLXlvdXItYml0Y29pbi1hbmQtZXRoZXJldW0tYWZ0ZXItZnR4LWNyYXNoLWl0LXMtY3J5cHRvbWFz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Dec 2023 08:00:00 GMT",
        "title": "If You Held Your Bitcoin and Ethereum After FTX Crash, It's Cryptomas! - Bloomberg",
        "content": "It's Merry Cryptomas, everybody! Bitcoin is up 167% year-to-date. Ethereum is up 91%. If a massive crypto rally was one of your predictions for 2023 a year ago, I take my hat off to you. Compare those returns with other asset classes. The NASDAQ is up 36%. The S&P 500 is up 19%. Gold is up 10.7%. If you were long oil or a broad basket of commodities, you are down 10%-12%.\n\nA year ago, many of us thought — I certainly did — that it was game over for crypto and that the naysayers were going to be vindicated."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vZmluYm9sZC5jb20vZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi1hcy0zLW91dC1vZi00LWV0aC1ob2xkZXJzLWFyZS1pbi1wcm9maXQtdGltZS10by1idXkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Dec 2023 08:00:00 GMT",
        "title": "Ethereum price prediction as 3 out of 4 ETH holders are in profit; Time to buy? - Finbold - Finance in Bold",
        "content": "Ethereum (ETH) is the largest and most used decentralized finance (DeFi) and Web3 layer-1 blockchain infrastructure. Its native token, ETH, is also the second-largest cryptocurrency by market cap, with $270 billion at the time of publication.\n\nNotably, Ethereum’s price is up 85% in the last year, now trading at $2,249 per token. This surge has rewarded ETH holders, who are now 76% in profit, according to data by IntoTheBlock on December 16.\n\nIn particular, the percentage of Ethereum investors in profit is the same as long-term holders, who have kept their positions for over a year. Both data sets are achieved by looking at all active addresses in the network from the received and spent transactions.\n\nHowever, 23% of all Ethereum wallets are holding a losing ETH position, while 1% acquired the token at current prices. At the same time, 21% of Ethereum holders have held their position for between one and 12 months, while 3% just recently bought ETH.\n\nEthereum (ETH) holders data. Source: IntoTheBlock\n\nIs it time to buy ETH with 76% of Ethereum holders in profit?\n\nIt is important to understand that the higher the number of Ethereum holders in profit, the higher the likelihood of a sell-off, as they might want to realize the, so far, unrealized profit. Therefore, buying ETH right now could mean becoming the profitable exit liquidity for 76% of all Ethereum holders.\n\nMeanwhile, only 46% of the tokens are concentrated in the hands of addresses holding at least 0.1% of its supply. The low concentration of whales and institutional investors lowers the risk of huge coordinated sell-offs. Balancing the previous analysis.\n\nCryptocurrency traders controversially believe we are experiencing either a bull rally in a bear market or a bull market already. Understanding the current status of cryptocurrencies is essential to make a profitable decision of buying or not buying ETH.\n\nMoreover, further developments and DeFi ecosystem growth for Ethereum could generate more demand for its token. An increased demand would drive ETH prices up, while a reduced demand would create an opposite outcome.\n\nAll things considered, the decision to buy ETH is personal, and investors must be aware of the risks. Essentially, having a good risk management start is necessary while investing in such a volatile and experimental market.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bXMtZGVuY3VuLXVwZ3JhZGUtZXRoLWRldmVsb3BlcnMtcmV2ZWFsLW1ham9yLW1pbGVzdG9uZS1hcy0yMDIzLWJvd3Mtb3V00gFjaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtcy1kZW5jdW4tdXBncmFkZS1ldGgtZGV2ZWxvcGVycy1yZXZlYWwtbWFqb3ItbWlsZXN0b25lLWFzLTIwMjMtYm93cy1vdXQ_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Dec 2023 08:00:00 GMT",
        "title": "Ethereum's Dencun Upgrade: ETH Developers Reveal Major Milestone as 2023 Bows Out - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAs reported by Christine Kim, the vice president of research at Galaxy, Ethereum developers are teasing a key step as regards the Dencun upgrade before the end of 2023.\n\nAdvertisement\n\nPer a report detailing the latest Ethereum All Core Developers Consensus Call, Ethereum developers stated that they are on track to launch a Goerli shadow fork testing the Cancun/Deneb upgrade with all clients within the next one to two weeks.\n\ngm, here with another update on the eth cancun/deneb upgrade:\n\n- devnet #12 now hosts all EL/CL client combinations, incl. prysm\n\n- devs say they are on track to launch a goerli shadow fork before the end of the year\n\n- cont...https://t.co/3i4LpLDzRh — Christine Kim (@christine_dkim) December 15, 2023\n\nA shadow fork is a smaller test fork that focuses on some of the improvements that must be made before the Dencun upgrade is implemented on the main protocol.\n\nTesting for the Cancun/Deneb upgrade is well underway on Devnet 12. Currently, all execution layer (EL) and consensus layer (CL) client combinations, including the Prysm client, have been onboarded to Devnet 12. MEV-Boost software has been activated for the majority of these client combinations, except for Prysm client combinations.\n\nThe much-awaited Ethereum Dencun upgrade will bring changes across Ethereum's two mainnet layers: the execution layer (EL) and the consensus layer (CL).\n\nThe upgrade to the execution layer is dubbed Cancun, while the consensus layer will receive the Deneb upgrade, forming the name Deneb-Cancun (or Dencun).\n\nThe exciting Dencun upgrade aims to tackle Ethereum's scalability challenges by implementing an improvement proposal named EIP-4844.\n\nAs earlier reported, developers might most likely begin upgrading public Ethereum testnets after the holidays in Q1, 2024.\n\nThe Goerli testnet, as it is presently known, will be sunsetting soon. Teams will begin exiting their validators either three months after the Dencun activation or one month after the Dencun mainnet activation, whichever comes later. Notably, the Dencun network upgrade will be the last one implemented on the network."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bXMtcHJpY2UtZWRnZXMtdG93YXJkLTI1MDAtc3VyZ2Utb3ItbWlyYWdlLWFoZWFk0gFLaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtcy1wcmljZS1lZGdlcy10b3dhcmQtMjUwMC1zdXJnZS1vci1taXJhZ2UtYWhlYWQ_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Dec 2023 08:00:00 GMT",
        "title": "Ethereum's Price Edges Toward $2,500: Surge or Mirage Ahead? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe Ethereum market has recently witnessed a tempting approach toward the $2,500 mark. However, this price movement occurs amid a less-than-ideal backdrop for its decentralized finance (DeFi) sector, which is currently struggling and showing no imminent signs of regaining its lost positions.\n\nAdvertisement\n\nThe underperformance of Ethereum's DeFi sector can be attributed to several factors, one of which is the soaring transaction fees that have rendered the layer-1 platform challenging for average users.\n\nNetwork fees have escalated to levels that are widely considered unreasonable, severely impacting usability. In response to these persistent issues, Ethereum cofounder Vitalik Buterin has hinted at the integration of zero-knowledge Ethereum Virtual Machine (zkEVM) scaling solutions directly into the mainnet, an advancement eagerly anticipated by the community.\n\nAmid Ethereum's challenges, competitors like Solana are capturing attention, with its platform maintaining lower fees and higher transaction throughput. This competition has intensified the pressure on Ethereum to enhance its scalability and efficiency to maintain its leading position in the blockchain space.\n\nEthereum's price action offers a compelling narrative. The chart illustrates a notable uptrend, with the price having recently surged above multiple key moving averages, a bullish indicator for many traders. The convergence of the 50-day moving average above the 100-day and 200-day moving averages could suggest sustained bullish momentum. However, this positive trend is met with caution as the Relative Strength Index (RSI) hints at a market that is neither overbought nor oversold, leaving room for volatility.\n\nThe chart also reveals that Ethereum has encountered resistance as it approaches the $2,500 level. This resistance zone is critical, and a convincing breakout above it could signal the start of a new rally. However, with the current strain on Ethereum's DeFi ecosystem and the competitive heat from blockchains like Solana, the potential for a breakthrough to $2,500 is enveloped in uncertainty.\n\nBONK's meteoric meme rise\n\nThe meteoric rise of Bonk (BONK) has sent ripples across the crypto industry, with its valuation reaching the billion-dollar mark and positioning it as a serious contender in the meme coin space. The recent listings on Coinbase and Binance, two of the largest cryptocurrency exchanges, have played a pivotal role in propelling BONK to new heights, reminding us of the astonishing ascent of Shiba Inu (SHIB) during the previous year's bull run.\n\nThe price chart for BONK displays a sharp upward trajectory, indicating a frenzied accumulation phase that often accompanies a new listing's excitement. Such price action is not uncommon for meme coins, which can capture the imagination of the trading community and lead to explosive short-term gains. The high social media buzz and community backing seem to reinforce the potential of BONK as the next viral sensation.\n\nHowever, seasoned market observers and analysts caution that the meme coin sector is notorious for its boom-and-bust cycles. As BONK's market cap has eclipsed that of other well-known meme tokens like Dogecoin (DOGE) and PEPE, comparisons to SHIB's rise are inevitable. Yet, there is an air of skepticism about whether BONK can maintain this blistering pace or if it will succumb to the same fate that befalls many high-flying tokens after the initial euphoria fades.\n\nIt is also important to stay extremely cautious when interacting with assets like Bonk: meme coins often experience significant corrections after such rapid expansions in price. The historical performance of similar assets suggests that BONK could face a challenging road ahead, especially if broader market sentiment shifts. While the dream of dethroning SHIB as a top meme coin is alive, the path is fraught with the potential for high volatility and sudden market turns."
    }
]