[
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMilwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1mYWxscy1iZWxvdy00MzQwMC1ldGhlcmV1bS1zb2xhbmEtanVtcC11cC10by0xNC9hcnRpY2xlc2hvdy8xMDU4MzUwMzYuY21z0gGbAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZS10b2RheS1iaXRjb2luLWZhbGxzLWJlbG93LTQzNDAwLWV0aGVyZXVtLXNvbGFuYS1qdW1wLXVwLXRvLTE0L2FtcF9hcnRpY2xlc2hvdy8xMDU4MzUwMzYuY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Dec 2023 08:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin falls below $43,400; Ethereum, Solana jump up to 14% - The Economic Times",
        "content": "At 12.15 a.m., BTC was trading 1.3% lower at $43,375, while the second most popular token, Ethereum, was up 4.8% at $2,373.Other popular altcoins, such as Solana and Cardano advanced 14% and 6%, respectively. Also, BNB , Avalanche, Tron, Chainlink, Polkadot, Siba Inu, and Litecoin surged. On the other hand, XRP Dogecoin , and Toncoin declined.BTC encountered a dip to $43,000 during the day, pulling back from its swift ascent to nearly $45,000 earlier this week. This suggests that traders opted to secure profits after the largest crypto's breakout from $38,000 a week ago, said CoinDCX Research Team.On the flip side, ETH witnessed a 5% upswing over the same period, reaching $2,372, marking its highest level since May 2022. This upward movement also positively influenced the prices of other ETH-related cryptocurrencies, positioning them as the top performers of the day. Ethereum's upsurge is credited to heightened institutional interest and the hopeful anticipation of an ETF approval by the SEC, CoinDCX added.\"From a technical standpoint, BTC is currently situated at the $44,000 resistance level. The overall momentum remains positive, with no clear signals of a reversal or bearish trend. Minor pullbacks and corrections are considered healthy for the current scenario,\" CoinDCX said.Meanwhile, Parth Chaturvedi, Investments Lead at CoinSwitch Ventures, said, \"The current phase of sideways correction is good for building steam for the next leg-up. If this trend continues, analysts predict the next stop for BTC will be $46,000.\"The total volume in DeFi is currently $8 billion, 10.77% of the total crypto market 24-hour volume. The volume of all stablecoins is now $65.78 billion, which is 88.55% of the total crypto market 24-hour volume.In the last 24 hours, the market cap of Bitcoin, the world's largest cryptocurrency , fell to $848 billion. Bitcoin's dominance is currently 52.65%, according to CoinMarketCap. BTC volume in the last 24 hours rose 7.91% to $28.25 billion."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMilwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1mYWxscy1iZWxvdy00MzQwMC1ldGhlcmV1bS1zb2xhbmEtanVtcC11cC10by0xNC9hcnRpY2xlc2hvdy8xMDU4MzUwMzYuY21z0gGbAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZS10b2RheS1iaXRjb2luLWZhbGxzLWJlbG93LTQzNDAwLWV0aGVyZXVtLXNvbGFuYS1qdW1wLXVwLXRvLTE0L2FtcF9hcnRpY2xlc2hvdy8xMDU4MzUwMzYuY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Dec 2023 08:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin falls below $43,400; Ethereum, Solana jump up to 14% - The Economic Times",
        "content": "At 12.15 a.m., BTC was trading 1.3% lower at $43,375, while the second most popular token, Ethereum, was up 4.8% at $2,373.Other popular altcoins, such as Solana and Cardano advanced 14% and 6%, respectively. Also, BNB , Avalanche, Tron, Chainlink, Polkadot, Siba Inu, and Litecoin surged. On the other hand, XRP Dogecoin , and Toncoin declined.BTC encountered a dip to $43,000 during the day, pulling back from its swift ascent to nearly $45,000 earlier this week. This suggests that traders opted to secure profits after the largest crypto's breakout from $38,000 a week ago, said CoinDCX Research Team.On the flip side, ETH witnessed a 5% upswing over the same period, reaching $2,372, marking its highest level since May 2022. This upward movement also positively influenced the prices of other ETH-related cryptocurrencies, positioning them as the top performers of the day. Ethereum's upsurge is credited to heightened institutional interest and the hopeful anticipation of an ETF approval by the SEC, CoinDCX added.\"From a technical standpoint, BTC is currently situated at the $44,000 resistance level. The overall momentum remains positive, with no clear signals of a reversal or bearish trend. Minor pullbacks and corrections are considered healthy for the current scenario,\" CoinDCX said.Meanwhile, Parth Chaturvedi, Investments Lead at CoinSwitch Ventures, said, \"The current phase of sideways correction is good for building steam for the next leg-up. If this trend continues, analysts predict the next stop for BTC will be $46,000.\"The total volume in DeFi is currently $8 billion, 10.77% of the total crypto market 24-hour volume. The volume of all stablecoins is now $65.78 billion, which is 88.55% of the total crypto market 24-hour volume.In the last 24 hours, the market cap of Bitcoin, the world's largest cryptocurrency , fell to $848 billion. Bitcoin's dominance is currently 52.65%, according to CoinMarketCap. BTC volume in the last 24 hours rose 7.91% to $28.25 billion."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vdW5jaGFpbmVkY3J5cHRvLmNvbS9ldGhlcmV1bS1kZXZzLWFpbS10by1hY3RpdmF0ZS1kZW5jdW4taW4tamFudWFyeS0yMDI0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Devs Aim to Activate Dencun in January 2024 - Unchained - Unchained",
        "content": "Ethereum developers agreed to set a Goerli fork date to activate Dencun in January 2024, if things keep going as planned.\n\nThe All Core Developers Execution Call (ACDE), a bi-weekly meeting where developers coordinate changes to the Execution Layer of the Ethereum blockchain, concluded on Thursday with an update on the activation date for the Dencun upgrade.\n\nThe developers agreed that, if all goes well, they will set a Goerli fork date to activate Dencun on the testnet in January 2024.\n\nGoerli is Ethereum’s first multi-client testnet, which went live ahead of The Merge in two phases last year. In the coming months, Goerli will stop being supported by Ethereum client and Ethereum Foundation testing teams, making Dencun the last-ever upgrade that will be implemented on the network.\n\nTim Beiko, the Ethereum Foundation’s protocol support lead, recommended coordinating a hard fork as soon as developers return from the holiday break, assuming no major bugs are discovered in clients on Devnet 12.\n\n“Teams seem generally ready to move towards forking testnets! We have a big Goerli shadow fork planned in the next couple weeks, and, assuming this doesn’t find issues, then forking Goerli itself would provide the most testing value,” he noted.\n\nBeiko has also created a Meta EIP document ahead of Dencun that lists all the Ethereum Improvement Proposals (EIPs) included in the upgrade.\n\nPrevious forks have their specs nested in two different places of two different repos, and combined EL/CL upgrades didn't have a single, canonical list of EIPs. Having Meta EIPs makes all of this much easier to understand. That said, no objections to changing the category name! — timbeiko.eth ☀️ (@TimBeiko) December 7, 2023\n\nThe final item on the agenda was planning for the Prague/Electra network upgrade, where certain code updates will require changes on both the Execution Layer and Client Layer, and as such the Prague and Electra upgrades will need to be coordinated at the same time.\n\nDevelopers have already started proposing the upgrades that they would like to include in a thread on EthMagicians."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMi8wOC9hbHRjb2lucy1jb3VsZC1zdXJnZS1pbi1wcmljZS1hZnRlci1iaXRjb2luLWFuZC1ldGhlcmV1bS1yYWxsaWVzLXRoaXMtd2Vlay1nbGFzc25vZGUtY28tZm91bmRlcnMv0gGGAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzEyLzA4L2FsdGNvaW5zLWNvdWxkLXN1cmdlLWluLXByaWNlLWFmdGVyLWJpdGNvaW4tYW5kLWV0aGVyZXVtLXJhbGxpZXMtdGhpcy13ZWVrLWdsYXNzbm9kZS1jby1mb3VuZGVycy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Dec 2023 08:00:00 GMT",
        "title": "Altcoins Could Surge in Price After Bitcoin and Ethereum Rallies This Week: Glassnode Co-Founders - The Daily Hodl",
        "content": "The co-founders of the crypto analytics firm Glassnode believe that altcoins are about to go on a rally as Bitcoin (BTC) and Ethereum (ETH) soar.\n\nGlassnode co-founders Jan Happel and Yann Allemann, who share the Negentropic handle on the social media platform X, say that the total altcoin market cap is already rising, indicating bullishness for alts.\n\n“How much longer will altcoins trail behind before making their move? The Bitcoin narrative continues to steer the ship, but a closer look reveals the total altcoin market cap playing catch-up. With Ethereum and BTC leading the way, we are potentially on the brink of an altcoin surge.”\n\nThe founders also predict increased volatility for Bitcoin’s price but a rally continuation. They say that the crypto king could dip to the $40,000 level while remaining in an overall uptrend.\n\n“BTC’s bullish momentum: navigating the uncharted journey to $46,000.\n\nDespite the four-hour timeframe indicating BTC is overbought BTC’s upward trend may persist, intensifying investor FOMO (fear of missing out) across the board.\n\nTechnically, BTC navigates uncharted territory towards $46,000. Expect volatile moves between $40,000-$46,000. The 20-day EMA (exponential moving average) provides a safety net for potential pullbacks, making shorting risky. Current patterns hint at a climb towards $45,000.\n\nConclusion: stay alert, but optimistic. Yet the BTC’s momentum suggests more upside.”\n\nBitcoin is trading for $43,424 at time of writing, down slightly in the last 24 hours.\n\nThe two also use the Elliott Wave theory to suggest that the total market cap for cryptocurrencies could soar to an all-time high (ATH) of $4.4 trillion during the current bull cycle, surpassing the previous ATH of about $3 trillion.\n\nThe Elliott Wave theory attempts to forecast price movements based on crowd psychology which tends to manifest in waves. Traditionally, the Elliott Wave theory suggests that price impulses happen in five waves after three-wave “ABC” corrections.\n\n“Third time a charm? When crypto starts its move, it goes vertical by the end of the move! The journey has just begun. And RSI (relative strength index) is in the ‘extremely bullish’ zone. Are you strapped up for this move? Extreme euphoria may likely be seen by the end of the rally.”\n\nAt time of writing, the total crypto market cap stands at $1.69 trillion.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2V0aGVyZXVtLWRldmVsb3BlcnMtc2V0LXJvYWRtYXAtZm9yLWFuLWV2ZW50ZnVsLTIwMjQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Dec 2023 08:00:00 GMT",
        "title": "Ethereum developers set roadmap for an eventful 2024 - CryptoSlate",
        "content": "Ethereum (ETH) developers have outlined a comprehensive plan for the network’s development in 2024, including significant upgrades and new proposals after their latest execution layer meeting on Dec. 8.\n\nA key focus is on the deprecation of the Goerli testnet, with a fork scheduled for early 2024. This move is part of the strategy to activate ‘Dencun’ on the Ethereum network in January, marking a significant advancement in its technological capabilities.\n\nDencun Activation\n\nThe Dencun upgrade will introduce a novel concept in transaction processing termed ‘blob-carrying transactions.’ In this context, ‘blobs’ is an acronym for ‘Binary Large Objects’. The primary purpose of these blobs is to refine the way Ethereum stores and retrieves data by reducing the amount of data that must be stored indefinitely on the Ethereum blockchain.\n\nConsequently, the transaction costs associated with data storage are expected to decrease, making overall transactions more economical. It is a critical step toward the long-term goal of danksharding, a planned scaling solution that breaks the network into smaller, parallel segments (shards) to increase capacity and efficiency.\n\nAnother notable development is the introduction of a new proposal aimed at enhancing the power of Execution Layer (EL) clients. The proposal, designed to counteract potential censorship in the mempool, would enable EL clients to override local builders using various heuristics.\n\nFor instance, clients could override when detecting transactions with excessively high fees pending for extended periods. However, adopting such heuristics has not yet been implemented broadly, with only Geth currently having an open pull request on the issue.\n\nIn terms of process updates, the development of a Meta Ethereum Improvement Proposal (EIP) for Dencun has been a significant milestone. This is complemented by a draft for a “Meta EIP backfill,” which aims to provide specifications for upgrades previously lacking Meta EIPs.\n\nThe discussion around Meta EIPs has been vital in simplifying access to fork specifications, although there is an ongoing conversation about their role and naming conventions, according to ETH developer Tim Beiko.\n\nPrague/Electra upgrade\n\nLooking forward, the Ethereum community is preparing for the Prague/Electra network upgrade. Among the proposals for this upgrade is EIP-6110, which proposes a new method for supplying validator deposits on-chain, replacing the older Eth1 bridge system.\n\nFuture upgrades may also include Verkle Tries on the Execution Layer and Data Availability Sampling (DAS) on the Consensus Layer, necessitating in-depth technical reviews and discussions.\n\nThe Ethereum community is encouraged to take an active role in shaping the future of the network by participating in these technical discussions and expressing their preferences for potential features in the upcoming upgrades through forums and GitHub threads.\n\nClient teams are set to review these proposals, with more detailed discussions planned for January. This planning forms part of the broader strategic development of the Ethereum network, reflecting the continuous efforts by the developer community to evolve and refine the platform.\n\nThe Ethereum developer community remains actively engaged in enhancing the network’s capabilities, with a clear roadmap set for 2024. The upcoming developments and proposals highlight the network’s ongoing commitment to innovation and responsiveness to community feedback."
    }
]