[
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ldGhlcmV1bS1leHByZXNzLWV0ZS1ub3ctYXZhaWxhYmxlLTE2MzUwMDgzMS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 13 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Express (ETE) Is Now Available for Trading on LBank Exchange - Yahoo Finance",
        "content": "Road Town, British Virgin Islands--(Newsfile Corp. - October 13, 2023) - LBank Exchange, a global digital asset trading platform, listed Ethereum Express (ETE) on October 13, 2023. For all users of LBank Exchange, the ETE/USDT trading pair is now officially available for trading.\n\n\n\n\n\nETE Listing Banner\n\nTo view an enhanced version of this graphic, please visit:\n\nhttps://images.newsfilecorp.com/files/8831/183884_bd0534eb549c89e1_001full.jpg\n\nEthereum Express (ETE) is a blockchain network that employs innovative consensus mechanisms, sharding, and cross-chain communication protocols to achieve scalability, security, and interoperability in the world of decentralized applications (DApps) and digital assets.\n\nIntroducing Ethereum Express\n\nLBank Exchange is thrilled to announce the listing of Ethereum Express (ETE), a cutting-edge blockchain network designed to address some of the most pressing challenges facing the world of decentralized applications (DApps) and digital assets. At its core, Ethereum Express leverages a hybrid randomized DPOS (Delegated Proof of Stake) consensus protocol known as \"Chaos Consensus.\" This unique consensus mechanism combines elements of DPOS and BFT (Byzantine Fault Tolerance), introducing a random selection process for validating nodes. This innovation not only enhances decentralization but also significantly boosts transaction confirmation speed, enhancing the overall throughput of the network.\n\nOne of Ethereum Express's standout features is its data availability sharding mechanism. By dividing complete blocks into smaller, verifiable pieces or shards, this approach maximizes decentralization while simultaneously improving scalability. Users can choose to store either all data or a subset of shards, ensuring that every node can participate in securing the network and that capacity scales with the addition of new nodes. Ethereum Express also introduces a robust proof of data availability system, utilizing Merkle proofs to ensure the validity and accessibility of data across the network.\n\nStory continues\n\nFurthermore, Ethereum Express emphasizes cross-chain communication and interoperability. The \"Time Crossing\" protocol facilitates trustless interactions between chains by establishing a root of trust between them, enabling secure cross-chain asset transfers and automatic verification of state changes. Additionally, Ethereum Express incorporates multi-chain architecture, allowing application-specific chains to be built on top of its infrastructure, providing flexibility and customization for various projects, especially those in the GameFi sector. Moreover, Ethereum Express supports cross-chain contract calls, enabling DeFi applications on one chain to be directly invoked from another.\n\nIn summary, Ethereum Express is a forward-looking blockchain network that addresses scalability, security, and interoperability challenges within the blockchain and DApp ecosystem. Its innovative consensus mechanisms, data availability sharding, and cross-chain communication protocols make it a promising platform for the future of blockchain technology, catering to a wide range of applications and use cases.\n\nAbout ETE Token\n\nETE token, short for Ethereum Express Token, is the native cryptocurrency of the Ethereum Express blockchain network. ETE plays a pivotal role within the ecosystem, serving as both a medium of exchange and a store of value. Users can utilize ETE tokens for transaction fees, staking, and participating in the network's governance processes. Additionally, ETE tokens are essential for incentivizing network security and validators, ensuring the integrity and robustness of the Ethereum Express network. As a fundamental element of this innovative blockchain platform, ETE token underpins its functionality and contributes to its vibrant and decentralized ecosystem.\n\nBased on ERC20, ETE has a total supply of 100 million (i.e. 100,000,000). The distribution of ETE tokens is designed to be fair and equitable, with a portion allocated for initial investors, validators, ecosystem development, and user adoption, fostering a balanced and sustainable growth of the Ethereum Express network. It is listed on LBank Exchange at 10:00 UTC on October 13, 2023. Investors who are interested in ETE can easily buy and sell it on LBank Exchange now.\n\nLearn More about ETE Token:\n\nOfficial Website: https://www.ethereumexpress.net/\n\nContract: https://etherscan.io/token/0x000000e29fa2bd3e5c215ffc71aa66b29c9769a2\n\nTwitter: https://twitter.com/ethereumexpres\n\nTelegram: https://t.me/Ethereum_Express_Group\n\nFacebook: https://www.facebook.com/Ethereum.Express/\n\nInstagram: https://www.instagram.com/ethereumexpress/\n\nMedium: https://medium.com/@EthereumExpress\n\nYouTube: https://www.youtube.com/@EthereumExpress/\n\nAbout LBank\n\nLBank is one of the top crypto exchanges, established in 2015. It offers specialized financial derivatives, expert asset management services, and safe crypto trading to its users. The platform holds over 9 million users from more than 210 regions across the world. LBank is a cutting-edge growing platform that ensures the integrity of users' funds and aims to contribute to the global adoption of cryptocurrencies.\n\nStart Trading Now: lbank.com\n\nCommunity & Social Media:\n\nl Telegram\n\nl Twitter\n\nl Facebook\n\nl LinkedIn\n\nl Instagram\n\nl YouTube\n\nPress contact:\n\npress@lbank.info\n\nBusiness Contact:\n\nLBK Blockchain Co. Limited\n\nLBank Exchange\n\nmarketing@lbank.info\n\nbusiness@lbank.info\n\nTo view the source version of this press release, please visit https://www.newsfilecorp.com/release/183884"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ldGhlcmV1bS1leHByZXNzLWV0ZS1ub3ctYXZhaWxhYmxlLTE2MzUwMDgzMS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 13 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Express (ETE) Is Now Available for Trading on LBank Exchange - Yahoo Finance",
        "content": "Road Town, British Virgin Islands--(Newsfile Corp. - October 13, 2023) - LBank Exchange, a global digital asset trading platform, listed Ethereum Express (ETE) on October 13, 2023. For all users of LBank Exchange, the ETE/USDT trading pair is now officially available for trading.\n\n\n\n\n\nETE Listing Banner\n\nTo view an enhanced version of this graphic, please visit:\n\nhttps://images.newsfilecorp.com/files/8831/183884_bd0534eb549c89e1_001full.jpg\n\nEthereum Express (ETE) is a blockchain network that employs innovative consensus mechanisms, sharding, and cross-chain communication protocols to achieve scalability, security, and interoperability in the world of decentralized applications (DApps) and digital assets.\n\nIntroducing Ethereum Express\n\nLBank Exchange is thrilled to announce the listing of Ethereum Express (ETE), a cutting-edge blockchain network designed to address some of the most pressing challenges facing the world of decentralized applications (DApps) and digital assets. At its core, Ethereum Express leverages a hybrid randomized DPOS (Delegated Proof of Stake) consensus protocol known as \"Chaos Consensus.\" This unique consensus mechanism combines elements of DPOS and BFT (Byzantine Fault Tolerance), introducing a random selection process for validating nodes. This innovation not only enhances decentralization but also significantly boosts transaction confirmation speed, enhancing the overall throughput of the network.\n\nOne of Ethereum Express's standout features is its data availability sharding mechanism. By dividing complete blocks into smaller, verifiable pieces or shards, this approach maximizes decentralization while simultaneously improving scalability. Users can choose to store either all data or a subset of shards, ensuring that every node can participate in securing the network and that capacity scales with the addition of new nodes. Ethereum Express also introduces a robust proof of data availability system, utilizing Merkle proofs to ensure the validity and accessibility of data across the network.\n\nStory continues\n\nFurthermore, Ethereum Express emphasizes cross-chain communication and interoperability. The \"Time Crossing\" protocol facilitates trustless interactions between chains by establishing a root of trust between them, enabling secure cross-chain asset transfers and automatic verification of state changes. Additionally, Ethereum Express incorporates multi-chain architecture, allowing application-specific chains to be built on top of its infrastructure, providing flexibility and customization for various projects, especially those in the GameFi sector. Moreover, Ethereum Express supports cross-chain contract calls, enabling DeFi applications on one chain to be directly invoked from another.\n\nIn summary, Ethereum Express is a forward-looking blockchain network that addresses scalability, security, and interoperability challenges within the blockchain and DApp ecosystem. Its innovative consensus mechanisms, data availability sharding, and cross-chain communication protocols make it a promising platform for the future of blockchain technology, catering to a wide range of applications and use cases.\n\nAbout ETE Token\n\nETE token, short for Ethereum Express Token, is the native cryptocurrency of the Ethereum Express blockchain network. ETE plays a pivotal role within the ecosystem, serving as both a medium of exchange and a store of value. Users can utilize ETE tokens for transaction fees, staking, and participating in the network's governance processes. Additionally, ETE tokens are essential for incentivizing network security and validators, ensuring the integrity and robustness of the Ethereum Express network. As a fundamental element of this innovative blockchain platform, ETE token underpins its functionality and contributes to its vibrant and decentralized ecosystem.\n\nBased on ERC20, ETE has a total supply of 100 million (i.e. 100,000,000). The distribution of ETE tokens is designed to be fair and equitable, with a portion allocated for initial investors, validators, ecosystem development, and user adoption, fostering a balanced and sustainable growth of the Ethereum Express network. It is listed on LBank Exchange at 10:00 UTC on October 13, 2023. Investors who are interested in ETE can easily buy and sell it on LBank Exchange now.\n\nLearn More about ETE Token:\n\nOfficial Website: https://www.ethereumexpress.net/\n\nContract: https://etherscan.io/token/0x000000e29fa2bd3e5c215ffc71aa66b29c9769a2\n\nTwitter: https://twitter.com/ethereumexpres\n\nTelegram: https://t.me/Ethereum_Express_Group\n\nFacebook: https://www.facebook.com/Ethereum.Express/\n\nInstagram: https://www.instagram.com/ethereumexpress/\n\nMedium: https://medium.com/@EthereumExpress\n\nYouTube: https://www.youtube.com/@EthereumExpress/\n\nAbout LBank\n\nLBank is one of the top crypto exchanges, established in 2015. It offers specialized financial derivatives, expert asset management services, and safe crypto trading to its users. The platform holds over 9 million users from more than 210 regions across the world. LBank is a cutting-edge growing platform that ensures the integrity of users' funds and aims to contribute to the global adoption of cryptocurrencies.\n\nStart Trading Now: lbank.com\n\nCommunity & Social Media:\n\nl Telegram\n\nl Twitter\n\nl Facebook\n\nl LinkedIn\n\nl Instagram\n\nl YouTube\n\nPress contact:\n\npress@lbank.info\n\nBusiness Contact:\n\nLBK Blockchain Co. Limited\n\nLBank Exchange\n\nmarketing@lbank.info\n\nbusiness@lbank.info\n\nTo view the source version of this press release, please visit https://www.newsfilecorp.com/release/183884"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy91cGxhbmQtY29tbXVuaXR5LWFwcHJvdmVzLWdvdmVybmFuY2Utdm90ZS0wNjQyMzU1NTguaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 13 Oct 2023 07:00:00 GMT",
        "title": "Upland Community Approves Governance Vote to Make Utility Token 'Spark' Tradable on Ethereum - Yahoo Finance",
        "content": "Upland is now preparing the next steps to make Spark tradable outside of Upland via a Token Trability Event (“TTE”)\n\nPALO ALTO, California --News Direct-- Upland\n\nUpland, the leading web3 Metaverse Super App, announces its plans to make its in-game utility token Spark tradable on Ethereum following an overwhelming majority (87.25%) approval in a recent community governance vote. This initiative allows Upland to accelerate on its mission to build the world’s largest digital open economy in the metaverse through its dynamic ecosystem of players, entrepreneurs, creators, and developers by allowing its utility token, Spark, to be traded outside of Upland’s boundaries.\n\nUpland presented the Sparklet White Paper to the community to review in late September, which outlined the initiative to bridge the in-app token Spark to Ethereum where it will be mirrored and minted as the Sparklet token, equivalent to one-thousandth of Spark. The Sparklet White Paper details the need for Spark to support value creation in the metaverse. It is the resource required for world-building, joint community projects, no-code NFT minting, and “manufacturing” of 3D map assets, such as cars, decor, and more. Current and future utility details along with tokenomics, Sparklet vesting schedules, implementation, and token distribution were also presented to the Upland community in the White Paper for comment ahead of the governance vote.\n\nWith the community approval of the Sparklet White Paper, Upland is now preparing the next steps to make Spark tradable outside of Upland via a Token Tradability Event (“TTE”), where Spark, a utility token on the EOS blockchain, will be mirrored by the Sparklet token on the Ethereum blockchain.\n\nBy executing the Spark TTE, Upland advances its path toward progressive decentralization, where Spark holders will now be able to trade Sparklet in liquid markets. Additionally, it aims to enhance its presence within the broader Web3 industry through listing on external exchanges, attracting a larger user base to the platform, and enhancing the platform’s network effects.\n\nStory continues\n\n“Adhering to our mission to build the largest digital open economy, Sparklet allows us to take the next step towards progressive decentralization in a responsible way by offering tradability to our users while having mechanisms in place that can shield and protect Upland’s economy from unwanted externalities,” says Co-Founder and Co-CEO of Upland, Dirk Lueth. “The upside of Sparklet traded on an external exchange means of course higher visibility and more credibility for Upland, which contributes to a positive ripple effect in the web3 community, and also improved liquidity for current Spark holders.”\n\nSpark holders in Upland will have different reasons why they want to increase or decrease their holdings. For instance, some players might want to accelerate building structures on their virtual properties which requires more Spark while others are done with most of their world-building plans and have a reduced need for Spark which they can now liquidate via Sparklet. Creators, Entrepreneurs and Brands might need different amounts of Spark because they want to increase or decrease their manufacturing capabilities. And finally Developers might create additional demand because they introduced a new utility for Spark.\n\n“We’ve been able to study the Spark economy since we launched it two years ago, which gives us the confidence to provide the right model for it to be sustainable for decades to come in Upland,” says Co-Founder and Co-CEO of Upland, Idan Zuckerman. “With Sparklet, we are excited that players will be able to truly own Spark and trade it in liquid markets.”\n\nCurrently, Spark needs to be staked in Upland in order to build or manufacture items. The white paper states that there are over 130,000 players in Upland who hold Spark, with 93.6% of those who purchased Spark using it to build in Upland.\n\nSparklet equals one-thousandth (1/1,000) of one Spark and will exist on Ethereum as an ERC-20 token. Sparklet tokens will be able to be uploaded from Ethereum to Upland, where they will be converted into Spark at x/1,000 factor, while Spark tokens can be reclaimed from Upland to Ethereum using the reverse calculation.\n\nAs part of the TTE, a total of 1,000,000,000 Sparklet tokens as finite supply will be issued on Ethereum. These tokens will be mirrored by 1,000,000 Spark that will be minted in Upland on the EOS blockchain. The community-approved Sparklet White Paper highlights that the amount of Spark that is under ownership in Upland will always be exactly equal to the amount of Sparklet that is present in an escrow on the Ethereum bridge.\n\nUpland, a US based company headquartered in Silicon Valley, CA, has not issued a tradable token given regulatory uncertainties in the US crypto space. Recent developments such as the groundbreaking SEC v. Ripple ruling the United States Southern District Court of New York opened the door for token tradability. Upland has never sold its internal utility token to investors.\n\nTo read the Sparklet White Paper and follow the announcements of Upland’s utility token, refer to the Sparklet pages on the Upland website www.upland.me/sparklet and follow Upland on X (formerly Twitter) and Discord.\n\nAbout Upland\n\nUpland, the Metaverse Super App, is a web3 metaverse platform mapped to the real world on a mission to build the largest digital open economy. Our ecosystem is a diverse community of players, entrepreneurs, creators, developers, and brands, all benefiting from true ownership and guaranteed intellectual property rights powered by blockchain technology. Currently, Upland is one of the most widely-used web3 platforms with over 3 million registered accounts, nearly 300,000 landowners, and have sold more than 6 million NFTs. Our platform offers various activities for players and creators, including virtual property trading, world-building, collecting, and fun competitions like car racing. Metaverse entrepreneurs can also operate their own shops, contributing to our thriving economy powered by UPX, our native currency which serves as a medium of exchange, and Spark, a utility token that fuels the value creation by the highly-engaged community. We're headquartered in Silicon Valley, with additional offices in Las Vegas, Ukraine, and Brazil. Upland was founded by serial entrepreneurs in July 2018 and launched in June 2019. Upland is accessible on the web, the App Store, and Google Play, allowing users from around the world to experience the metaverse.\n\nContact Details\n\nUpland\n\nLindsay Anne Aamodt\n\nlindsay.a@upland.me\n\nView source version on newsdirect.com: https://newsdirect.com/news/upland-community-approves-governance-vote-to-make-utility-token-spark-tradable-on-ethereum-657458724"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy91cGxhbmQtY29tbXVuaXR5LWFwcHJvdmVzLWdvdmVybmFuY2Utdm90ZS0wNjQyMzU1NTguaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 13 Oct 2023 07:00:00 GMT",
        "title": "Upland Community Approves Governance Vote to Make Utility Token 'Spark' Tradable on Ethereum - Yahoo Finance",
        "content": "Upland is now preparing the next steps to make Spark tradable outside of Upland via a Token Trability Event (“TTE”)\n\nPALO ALTO, California --News Direct-- Upland\n\nUpland, the leading web3 Metaverse Super App, announces its plans to make its in-game utility token Spark tradable on Ethereum following an overwhelming majority (87.25%) approval in a recent community governance vote. This initiative allows Upland to accelerate on its mission to build the world’s largest digital open economy in the metaverse through its dynamic ecosystem of players, entrepreneurs, creators, and developers by allowing its utility token, Spark, to be traded outside of Upland’s boundaries.\n\nUpland presented the Sparklet White Paper to the community to review in late September, which outlined the initiative to bridge the in-app token Spark to Ethereum where it will be mirrored and minted as the Sparklet token, equivalent to one-thousandth of Spark. The Sparklet White Paper details the need for Spark to support value creation in the metaverse. It is the resource required for world-building, joint community projects, no-code NFT minting, and “manufacturing” of 3D map assets, such as cars, decor, and more. Current and future utility details along with tokenomics, Sparklet vesting schedules, implementation, and token distribution were also presented to the Upland community in the White Paper for comment ahead of the governance vote.\n\nWith the community approval of the Sparklet White Paper, Upland is now preparing the next steps to make Spark tradable outside of Upland via a Token Tradability Event (“TTE”), where Spark, a utility token on the EOS blockchain, will be mirrored by the Sparklet token on the Ethereum blockchain.\n\nBy executing the Spark TTE, Upland advances its path toward progressive decentralization, where Spark holders will now be able to trade Sparklet in liquid markets. Additionally, it aims to enhance its presence within the broader Web3 industry through listing on external exchanges, attracting a larger user base to the platform, and enhancing the platform’s network effects.\n\nStory continues\n\n“Adhering to our mission to build the largest digital open economy, Sparklet allows us to take the next step towards progressive decentralization in a responsible way by offering tradability to our users while having mechanisms in place that can shield and protect Upland’s economy from unwanted externalities,” says Co-Founder and Co-CEO of Upland, Dirk Lueth. “The upside of Sparklet traded on an external exchange means of course higher visibility and more credibility for Upland, which contributes to a positive ripple effect in the web3 community, and also improved liquidity for current Spark holders.”\n\nSpark holders in Upland will have different reasons why they want to increase or decrease their holdings. For instance, some players might want to accelerate building structures on their virtual properties which requires more Spark while others are done with most of their world-building plans and have a reduced need for Spark which they can now liquidate via Sparklet. Creators, Entrepreneurs and Brands might need different amounts of Spark because they want to increase or decrease their manufacturing capabilities. And finally Developers might create additional demand because they introduced a new utility for Spark.\n\n“We’ve been able to study the Spark economy since we launched it two years ago, which gives us the confidence to provide the right model for it to be sustainable for decades to come in Upland,” says Co-Founder and Co-CEO of Upland, Idan Zuckerman. “With Sparklet, we are excited that players will be able to truly own Spark and trade it in liquid markets.”\n\nCurrently, Spark needs to be staked in Upland in order to build or manufacture items. The white paper states that there are over 130,000 players in Upland who hold Spark, with 93.6% of those who purchased Spark using it to build in Upland.\n\nSparklet equals one-thousandth (1/1,000) of one Spark and will exist on Ethereum as an ERC-20 token. Sparklet tokens will be able to be uploaded from Ethereum to Upland, where they will be converted into Spark at x/1,000 factor, while Spark tokens can be reclaimed from Upland to Ethereum using the reverse calculation.\n\nAs part of the TTE, a total of 1,000,000,000 Sparklet tokens as finite supply will be issued on Ethereum. These tokens will be mirrored by 1,000,000 Spark that will be minted in Upland on the EOS blockchain. The community-approved Sparklet White Paper highlights that the amount of Spark that is under ownership in Upland will always be exactly equal to the amount of Sparklet that is present in an escrow on the Ethereum bridge.\n\nUpland, a US based company headquartered in Silicon Valley, CA, has not issued a tradable token given regulatory uncertainties in the US crypto space. Recent developments such as the groundbreaking SEC v. Ripple ruling the United States Southern District Court of New York opened the door for token tradability. Upland has never sold its internal utility token to investors.\n\nTo read the Sparklet White Paper and follow the announcements of Upland’s utility token, refer to the Sparklet pages on the Upland website www.upland.me/sparklet and follow Upland on X (formerly Twitter) and Discord.\n\nAbout Upland\n\nUpland, the Metaverse Super App, is a web3 metaverse platform mapped to the real world on a mission to build the largest digital open economy. Our ecosystem is a diverse community of players, entrepreneurs, creators, developers, and brands, all benefiting from true ownership and guaranteed intellectual property rights powered by blockchain technology. Currently, Upland is one of the most widely-used web3 platforms with over 3 million registered accounts, nearly 300,000 landowners, and have sold more than 6 million NFTs. Our platform offers various activities for players and creators, including virtual property trading, world-building, collecting, and fun competitions like car racing. Metaverse entrepreneurs can also operate their own shops, contributing to our thriving economy powered by UPX, our native currency which serves as a medium of exchange, and Spark, a utility token that fuels the value creation by the highly-engaged community. We're headquartered in Silicon Valley, with additional offices in Las Vegas, Ukraine, and Brazil. Upland was founded by serial entrepreneurs in July 2018 and launched in June 2019. Upland is accessible on the web, the App Store, and Google Play, allowing users from around the world to experience the metaverse.\n\nContact Details\n\nUpland\n\nLindsay Anne Aamodt\n\nlindsay.a@upland.me\n\nView source version on newsdirect.com: https://newsdirect.com/news/upland-community-approves-governance-vote-to-make-utility-token-spark-tradable-on-ethereum-657458724"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3N0YWtpbmctY2FuLW1vZGVybml6ZS10aGUtZXRoZXJldW0tZXRm0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 13 Oct 2023 07:00:00 GMT",
        "title": "Staking can modernize the Ethereum ETF - Blockworks",
        "content": "Before diving into the crux of this op-ed, let’s be clear: The vision outlined here recognizes the pragmatic approach ETF issuers are currently taking.\n\nInitial Ethereum ETFs will be “plain vanilla” in structure and simply track the spot price of Ethereum as a first iteration. That said, just as the equity ETF market has evolved to offer a plethora of sophisticated products beyond simple price tracking offerings, so too must the Ethereum ETF space.\n\nWith that understanding, a particular vision emerges — one where, just as an investor in an equity ETF demands a pro-rata dividend, an Ethereum investor assertively seeks out staking rewards. To omit such rewards is akin to denying oneself a full, comprehensive return on investment.\n\nStaking is Ethereum’s beating heart. It is the mechanism that rewards any ETH holder for bonding their holdings to validators, who then propose and attest to new blocks on the Ethereum blockchain, and in return are rewarded with newly minted Ethereum as well as a portion of the transaction fees in the block.\n\nTo put it plainly, staking is the modern-day operating system for Ethereum. And therefore staking must play a role in an ideal Ethereum ETF.\n\nAs an example, a fund with a balance of 9,600 ETH (approx. $15 million) could earn an additional 32 ETH on a monthly basis by staking. This not only enhances the fund’s revenue, but also contributes to Ethereum’s network security. Staking ensures validators are actively participating and making the network more resilient against potential attacks.\n\nIncorporating staking rewards also gives investors a fuller experience of Ethereum ownership. These rewards can potentially provide enhanced returns over time when compared to solely tracking Ethereum’s price performance, as has historically been the case.\n\nStaking rewards can offer a unique avenue for fund managers. They can be innovative in compensating investors, either by directly distributing the rewards pro-rata to investors like a dividend, or by reducing management fees and adding staking rewards to the fund’s total allocation, thus increasing the net asset value (NAV) for each investor. This creates a win-win scenario for both the fund and the investor.\n\nWhy staking matters\n\nSince the Merge in 2022, Ethereum’s supply has been on a decline. A portion of the transaction fees paid by Ethereum users is burned, the amount of which is usually higher than the new supply issuance. This deflationary nature makes ETH scarcer by the day, increasing its inherent value.\n\nAn ETF that stakes and captures new issuance might, in essence, be capturing an increasingly valuable asset.\n\nA staking-centric approach reinforces Ethereum’s network. As more ETH is staked and more validators join the network, the cost to attack Ethereum rises exponentially, fostering a more secure environment for transactions and smart contracts.\n\nStaking is not without its challenges. The dynamic unbonding period of Ethereum means that once staked, the assets aren’t immediately liquid. To address this, an Ethereum ETF could strategically stake only 50% of its holdings.\n\nFurthermore, by incorporating a liquid staking protocol which adheres to KYC/AML norms, the ETF could allocate another 30% — ensuring the requirements of institutional investors are met without compromising liquidity.\n\nRead more from our opinion section: DeFi has a reputation problem\n\nLiquid staking is a mechanism where users stake their crypto assets — in this case, ETH — and receive a token representing their staked amount in return. These tokens can then be traded, sold or used in other decentralized finance (DeFi) protocols, essentially making them a liquid counterpart to an otherwise locked asset.\n\nIt’s essential that institutional investors look for protocols who fulfill KYC/AML requirements. The remaining 20% could be maintained in spot ETH, offering additional immediate liquidity.\n\nAs Ethereum ETFs gain momentum, their success will hinge on delivering returns while addressing liquidity concerns.\n\nAn intelligent combination of staking platforms and liquid staking protocols can be the bridge between these two worlds, ensuring Ethereum investors get the complete value they deserve, analogous to the dividends stock investors have come to expect. This vision paves the way for an Ethereum ETF that truly resonates with the modern investor’s needs.\n\nFor informational and advertising purposes only. The views and opinions expressed are those of the authors but not necessarily those of MarketVector Indexes GmbH or Figment. The information herein is being provided to you for general informational purposes only. It is not intended to be, nor should it be relied upon as legal, business, or investment advice. MarketVector Indexes GmbH and Figment undertakes no obligation to update the information herein.\n\nJosh Deems is Institutional Business Development Lead at Figment, leading efforts to bridge the gap between traditional finance and proof-of-stake services. With over eight years of experience in the “traditional finance meets digital assets” industry, Josh has played a pivotal role in shaping the landscape of digital asset adoption. As a founding employee at Fidelity Digital Assets, the industry’s largest initiative from a traditional institution, he successfully secured billions of dollars in assets under custody. Josh also contributed his insights at State Street, where he was a key member of the Emerging Technology Center, driving innovation through research on early blockchain protocols and digital asset services. As part of the investment team at Stillmark Ventures, Josh showcased his acumen in raising capital and conducting in-depth analyses of startups in the Bitcoin ecosystem, supporting their growth and success. Josh holds a Bachelor of Business Administration (BBA) from George Washington University and is based in Boston, MA.\n\nMartin Leinweber works as the Digital Asset Product Strategist at MarketVector Indexes (“MarketVector”) providing thought leadership in an emerging asset class. His role encompasses product development, research, and communication with the client base of MarketVector. Before joining MarketVector, he worked as a Portfolio Manager for equities, fixed-income, and alternative investments. Martin was responsible for the management of active funds for institutional investors such as insurance companies, pension funds, and sovereign wealth funds at the leading German quantitative asset manager Quoniam. Previously, he held various positions at one of Germany’s largest asset managers, MEAG, the asset manager of Munich Re and ERGO. Among other things, he contributed his expertise and international experience to the establishment of a joint venture with the largest Chinese insurance company PICC in Shanghai and Beijing. Martin is co-author of “Asset-Allokation mit Kryptoassets. Das Handbuch “(Wiley Finance, 2021). It’s the first handbook about integrating digital assets into traditional portfolios. He has a Master of Economics from the University of Hohenheim and is a CFA Charter holder.\n\nDon’t miss the next big story – join our free daily newsletter."
    }
]