[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDYvMDcvYWF2ZS1sZW5kaW5nLXByb3RvY29sLW1vdmVzLWNsb3Nlci10by1sYXVuY2hpbmctZ2hvLXN0YWJsZWNvaW4tb24tZXRoZXJldW0tbWFpbm5ldC_SAYABaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wNi8wNy9hYXZlLWxlbmRpbmctcHJvdG9jb2wtbW92ZXMtY2xvc2VyLXRvLWxhdW5jaGluZy1naG8tc3RhYmxlY29pbi1vbi1ldGhlcmV1bS1tYWlubmV0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Jun 2023 07:00:00 GMT",
        "title": "Aave Lending Protocol Moves Closer to Launching GHO Stablecoin on Ethereum Mainnet - CoinDesk",
        "content": "The token is expected to generate additional revenue for the Aave decentralized autonomous organization by sending 100% of interest payments on GHO borrows to the DAO, the proposal said at the time. It will initially be on Ethereum, and is expected to be issued on other blockchains based on community demand and voting, according to the proposals."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9qYWNrLWRvcnNleS1jb250cm92ZXJzeS1jbGFpbXMtZXRoLWlzLXNlY3VyaXR50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Jun 2023 07:00:00 GMT",
        "title": "Jack Dorsey courts controversy by claiming ETH is a security - Cointelegraph",
        "content": "Long-time Bitcoin (BTC) advocate Jack Dorsey has found himself in a Twitter war with several crypto industry pundits after he responded with “yes” to a question asking if Ether (ETH) was a security.\n\nThe comment caught the attention of Udi Wertheimer, a Bitcoin Ordinals developer at Taproot Wizards, who inferred Dorsey was a “clown” in a tweet on June 6.\n\nIn response, Dorsey tweeted, “ETH is not a security? Teach me wizard,” which prompted Wertheimer to share a five-year-old video of the United States Securities Exchange Commission Chair Gary Gensler stating that ETH was now “sufficiently decentralized” and wasn’t a security.\n\nHowever, Gabor Gurbacs, strategy adviser to stablecoin issuer Tether and investment management firm VanEck, weighed in on Wertheimer’s comment, stating that Ethereum’s recent transition to proof-of-stake may have re-triggered securities laws.\n\nThe online scuffle comes in light of the SEC filing lawsuits against cryptocurrency exchanges Binance and Coinbase on June 5 and 6 for allegedly offering tokens considered to be unregistered securities.\n\nDorsey also tweeted and implied approval of a screenshot of a post by Coinbase CEO Brian Armstrong in 2015, where he referred to altcoins as a “distraction” and that Coinbase should instead “be focused” on Bitcoin.\n\nDorsey continued on his pro-Bitcoin tweeting streak and retweeted a video of Jack Mallers — CEO of Bitcoin Lightning application Strike — calling out Armstrong for choosing to prioritize altcoins over building on Bitcoin and the Lightning Network.\n\nRelated: Jack Dorsey tips pro-crypto candidate Robert Kennedy to win presidency\n\nWhen Dorsey was in charge of Twitter in 2021 the company sold 140 Ethereum-based nonfungible tokens (NFTs) but he rejected investing in Ether at the time.\n\nDorsey also downplayed Ethereum’s development in August 2021 when he claimed that Ethereum alone wouldn’t be able to disrupt big tech.\n\nDorsey recently provided funding and became an advocate for Nostr, a decentralized “Twitter killer” network that integrates Bitcoin Lightning-based payments on the “Damus” platform.\n\nMagazine: Crypto regulation — Does SEC Chair Gary Gensler have the final say?"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vY29pbmdhcGUuY29tL3dpbGwtZXRoZXJldW0tcHJpY2UtYnJlYWstMTBrLXZhbmVjay1wcmVkaWN0cy1ldGgtcHJpY2UtdG8tcmVhY2gtMTEtOGstYnktMjAzMC_SAWhodHRwczovL2NvaW5nYXBlLmNvbS93aWxsLWV0aGVyZXVtLXByaWNlLWJyZWFrLTEway12YW5lY2stcHJlZGljdHMtZXRoLXByaWNlLXRvLXJlYWNoLTExLThrLWJ5LTIwMzAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Jun 2023 07:00:00 GMT",
        "title": "Will Ethereum Price Break $10k? VanEck Predicts $ETH Price To Reach $11.8k By 2030 - CoinGape",
        "content": "In the wake of Ethereum’s recent hard fork, which introduced the ability to withdraw staked ETH and presented a significant new competitor to US T-bills, VanEck revisits its Ethereum estimates with a robust valuation model. VanEck’s analysis predicts that Ethereum’s annual revenue will rise from $2.6 billion to $51 billion by 2030, potentially leading to a token price of $11.8k.\n\nVanEck Evaluates Ethereum\n\nVanEck values Ethereum by projecting cash flows for the year ending on April 30, 2030. In their Base Case scenario, they anticipate Ethereum achieving $51 billion in annual revenue by that time.\n\nadvertisement\n\nVanEck’s analysis incorporates various factors such as transaction fees, MEV (Maximal Extractable Value), and the concept of “Security as a Service” to provide a comprehensive valuation methodology.\n\nDeducting a validator fee of 1% and applying a global tax rate of 15%, the projected cash flows to Ethereum amount to $42.90 billion. Utilizing a free cash flow (FCF) multiple of 33x and considering a token supply of 120.7 million, VanEck arrives at a Base Case 2030 Price Target of $11,848 per token.\n\nRead CoinGape’s ETH Price Prediction..\n\nKey Takeaways- Ethereum Price:\n\nEthereum’s valuation is projected to rise from $2.6 billion to $51 billion in annual revenue by 2030. Assuming a 70% market share among smart contract protocols, a token price of $11.8k is predicted for Ethereum by 2030. The valuation methodology includes cash flow projections, deductions for validator fees and taxes, and the use of an FCF multiple. Market capture analysis reveals Ethereum’s dominance in key sectors such as transactions, finance, banking, payments, metaverse, social and gaming, and infrastructure. Ethereum’s potential as a store-of-value asset is explored, considering its programmability, cross-chain capabilities, and the concept of “Security as a Service”.\n\nAccording to CoinMarketCap data, the live Ethereum price today is $1,875.79 USD with a 24-hour trading volume of $9,361,683,038 USD. Ethereum is up 3.32% in the last 24 hours.\n\nAs Ethereum continues to evolve and capture market share, its role as a leading smart contract platform and a potential store-of-value asset becomes increasingly prominent in the crypto landscape."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZmluYm9sZC5jb20vbWFjaGluZS1sZWFybmluZy1hbGdvcml0aG0tc2V0cy1ldGhlcmV1bS1wcmljZS1mb3ItanVuZS0zMC0yMDIzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Jun 2023 07:00:00 GMT",
        "title": "Machine learning algorithm sets Ethereum price for June 30, 2023 - Finbold - Finance in Bold",
        "content": "Despite weeks of bearishness exacerbated by lawsuits against major crypto exchanges, the majority of the cryptocurrency market has turned over a greener leaf, and Ethereum (ETH) is no exception, with machine learning algorithms predicting a continuation of the positive price trend toward the end of the month.\n\nSpecifically, Finbold consulted the crypto forecast platform PricePredictions on the price of Ethereum on June 30, 2023, and its charts have suggested that the second-largest cryptocurrency by market capitalization would trade at an average price of $1,956.92 by that date, as per data on June 7.\n\nEthereum 30-day forecast. Source: PricePredictions\n\nIn fact, according to the algorithm that deploys indicators such as Bollinger Bands (BB), average true range (ATR), moving average convergence divergence (MACD), relative strength index (RSI), and others, Ethereum will grow 5% from its price at press time.\n\nEthereum price analysis\n\nAs things stand, Ethereum is currently trading at the price of $1,863.69, indicating a gain of 3.48% in the last 24 hours, a decline of 0.24% across the previous seven days, and an increase of 0.24% on its monthly chart, according to the information accessed on June 7.\n\nEthereum 24-hour price chart. Source: Finbold\n\nAt the same time, the 1-day technical analysis (TA) gauges over at the finance and crypto tracking website TradingView are generally bullish on Ethereum, suggesting a ‘buy’ at 14 – as summarized from oscillators in the ‘neutral’ at 8 and moving averages (MA) pointing at a ‘buy’ at 12.\n\nEthereum 1-day gauges. Source: TradingView\n\nSoaring ETH whale trades\n\nMeanwhile, the Ethereum network has witnessed massive whale activity, in which some of the largest investors have sold or distributed more than 1.6 million ETH over the previous 48 hours, as observed by the crypto trading expert Ali Martinez in a tweet on June 7.\n\nEthereum whale activity. Source: Ali Martinez\n\nShortly after, replying to the tweet by user Lookonchain, who noted that crypto trading firm Cumberland had bought the bottom, Martinez posted the above chart, adding that “Somebody sold the top.” Indeed, in accordance with the latest prices, this means that around $2.98 billion worth of Ethereum has changed hands in just two days.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zZWN1cml0eS1vci1ub3QtZXRoZXJldW0tcHJpY2UtbG9va3MtcG9pc2VkLXRvLWhvbGQtdGhlLTEtOGstbGV2ZWwtYmFzZWQtb24tMy1rZXktbWV0cmljc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Jun 2023 07:00:00 GMT",
        "title": "Security or not, Ether looks poised to hold the $1.8K level based on 3 key metrics - Cointelegraph",
        "content": "Ether’s price retested $1,780 after the news of the United States Securities and Exchange Commission (SEC) suing cryptocurrency exchanges Binance and Coinbase, but it’s not preposterous to suggest that Ether bulls should be more than happy that its price did not break below the 67-day support.\n\nThe SEC’s actions are actually a double-edged sword for Ether (ETH), and on Crypto Twitter, some analysts attributed the bounce in Ether to its not being listed as a security in either of the cases brought against Binance and Coinbase. For instance, the SEC explicitly mentioned BNB (BNB), Solana (SOL) and Cardano (ADA), which are direct competitors to Ethereum’s smart contract-processing capabilities.\n\nHowever, as noted by analyst Jevgenijs Kazanins, Ether’s omission does not mean that it has the green light from the SEC.\n\nSEC did not mention #ETH in the list of tokens that it considers to be securities when suing Coinbase and Binance. Could it be that the SEC is working on a separate lawsuit targeting Ethereum Foundation? — Jevgenijs Kazanins (@jevgenijs) June 6, 2023\n\nKazanins raises the question of whether the SEC could be targeting the Ethereum Foundation in a separate lawsuit. For now, the idea is a mere unfounded speculation, but it certainly has merit given that SEC Chairman Gary Gensler refused to answer questions about Ether’s status before the U.S. House Financial Services Committee in April 2023.\n\nIn the meantime, what traders can focus on is Ether’s price action, network data and other data that impacts investor sentiment and price in the short term.\n\nEthereum DApps get a slight boost\n\nTotal value locked (TVL) measures the deposits locked in Ethereum’s decentralized applications (DApps), which have been in a downtrend since mid-March. The indicator reached a 14.35 million ETH bottom on June 3 but bounced back to 14.6 million ETH by June 6, according to DefiLlama.\n\nThe number of active addresses interacting with DApps is also in a slump. Over the last 30 days, the top 12 DApps running on the Ethereum network saw a 4% increase in active addresses, even though the average transaction gas fee remained above $6.50.\n\nEthereum's 30-day DApp activity. Source: DappRadar\n\nIf investors fear that Ether has higher odds of breaking below the $1,800 support, it should be reflected in the ETH futures contract premium and increased costs for protective put options.\n\nEther derivatives metrics neutral as regulations ramped up\n\nEther quarterly futures are popular among whales and arbitrage desks. However, these fixed-month contracts typically trade at a slight premium to spot markets, indicating that sellers are asking for more money to delay settlement.\n\nAs a result, ETH futures contracts in healthy markets should trade at a 4 to 8% annualized premium — a situation known as contango, which is not unique to crypto markets.\n\nEther 2-month futures annualized premium. Source: Laevitas\n\nAccording to the futures premium, known as the basis indicator, professional traders have been avoiding leveraged longs (bullish bets). Still, not even the retest of the $1,780 level on June 6 was enough to flip those whales and market makers into bearish sentiment.\n\nTo exclude externalities that might have solely impacted the Ether futures, one should analyze the ETH options markets. The 25% delta skew indicator compares similar call (buy) and put (sell) options and will turn positive when fear is prevalent because the protective put option premium is higher than the call options.\n\nEther 30-day 25% skew. Source: Laevitas\n\nThe skew indicator will move above 8% if traders fear an Ether price crash. On the other hand, generalized excitement reflects a negative 8% skew. As displayed above, the 25% delta skew moved above the positive 8% threshold on June 5, indicating bearishness. However, the subsequent bounce to $1,880 on June 6 has moved the metric back to a neutral state.\n\nRelated: Coinbase reminds world it tried to ‘embrace regulation’ as SEC sues for violations\n\nEther’s price looks poised to hold above $1,800\n\nIn short, these three indicators signal resilience — namely, the TVL bounce to 14.6 million ETH, the 4% increase in DApps’ active addresses and a meager impact on Ether derivatives markets, despite the retest of the $1,800 level.\n\nEthereum network usage data remains healthy, and the recent retest of the 67-day support was not enough to scare professional traders, according to derivatives metrics.\n\nConsequently, bulls seem to have dodged a bullet, greatly reducing the risk of an imminent price crash.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    }
]