[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDUvMDgvYWF2ZS1kYW8tcGFzc2VzLXByb3Bvc2FsLXRvLWRlcGxveS1vbi1ldGhlcmV1bS1sYXllci0yLW1ldGlzLW5ldHdvcmsv0gFyaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wNS8wOC9hYXZlLWRhby1wYXNzZXMtcHJvcG9zYWwtdG8tZGVwbG95LW9uLWV0aGVyZXVtLWxheWVyLTItbWV0aXMtbmV0d29yay9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 May 2023 07:00:00 GMT",
        "title": "Aave DAO Passes Proposal to Deploy on Ethereum Layer 2 Metis Network - CoinDesk",
        "content": "The network will offer 100,000 native metis (METIS) tokens as a liquidity mining incentive for Aave users on the network that will be distributed over a six-month period. Elsewhere, a token mining reward program will distribute 4,000 METIS to participating protocols commensurate with the percentage of monthly transactions generated."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY3J5cHRvLm5ld3MvZGVzcGl0ZS1wZXBlLW1hbmlhLXRoZXJlLWFyZS0yeC1tb3JlLWJpdGNvaW4tdXNlcnMtdGhhbi1ldGhlcmV1bS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 May 2023 07:00:00 GMT",
        "title": "Despite PEPE-mania, there are 2x more bitcoin users than ethereum - crypto.news",
        "content": "Fresh data from blockchain analytics platform, Token Terminal, shows that bitcoin had two times more daily active users than ethereum as of May 8.\n\nBitcoin flips ethereum in user count\n\nAt the time of writing, bitcoin still leads ethereum in terms of daily active users.\n\nBitcoin has an average of 589,810 daily active users over a 30-day period, while ethereum has an average of 322,840 daily active users over the same time frame.\n\nToken Terminal is a platform that aggregates financial data on leading blockchains and decentralized applications, using traditional financial key performance indicators (KPI) to measure and evaluate their performance.\n\nWhile bitcoin and ethereum are popular, they offer different use cases. To illustrate, bitcoin is a currency and a store of value, while the ethereum network is a smart contracting platform for launching decentralized applications (dApps).\n\nBlame Ordinals for bitcoin woes, ethereum strained by PEPE\n\nData from Token Terminal suggests that despite the differences in their design and intended use cases, bitcoin is currently attracting more daily active users than ethereum.\n\nThis may be due to a variety of factors, such as bitcoin’s longer history and wider adoption, as well as its perception as a more stable and secure investment option.\n\nHowever, the introduction of the Bitcoin Ordinals platform and marketplace on Bitcoin’s blockchain could be the main reason for the spike in user adoption.\n\nThrough the Ordinals platform, users can attach files, such as videos, images, or texts, on every satoshi, effectively storing them on the mainnet. A satoshi is the smallest unit of a bitcoin (BTC).\n\nIn recent days, there has been a spike in the number of minted inscriptions from the Ordinals platform. The deluge has overwhelmed the network, forcing transaction fees high, even causing congestion on May 7.\n\nEven so, ethereum remains a significant player and is a go-to smart contracting platform.\n\nAs the Bitcoin network is inundated by Ordinals inscriptions, the popularity of meme tokens, including pepe coin (PEPE), has also forced ethereum’s gas fees higher after a lull of 2022.\n\nFollow Us on Google News"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1nYXMtc2t5cm9ja2V0aW5nLWFzLXRyYWRlci1wYWlkLTY0LWV0aC1pbi1mZWVzLXdoYXRzLWhhcHBlbmluZ9IBW2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1nYXMtc2t5cm9ja2V0aW5nLWFzLXRyYWRlci1wYWlkLTY0LWV0aC1pbi1mZWVzLXdoYXRzLWhhcHBlbmluZz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 May 2023 07:00:00 GMT",
        "title": "Ethereum Gas Skyrocketing as Trader Paid 64 ETH in Fees, What's Happening? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe Ethereum (ETH) blockchain network is giving traders enormous concerns at this time as the incidence of skyrocketing gas fees appears to be returning. According to a shared insight from crypto analytics service provider WhaleAlert, one trader paid as much as 64 ETH worth approximately $118,600 at the time of writing in fees for a single transaction.\n\nAdvertisement\n\n💸 A fee of 64 #ETH (119,121 USD) has just been paid for a single transaction!https://t.co/3w4UD0AZbw — Whale Alert (@whale_alert) May 8, 2023\n\nThe high gas fee is not a new thing on the Ethereum network; however, it is notably rare since the transition from the proof-of-work (PoW) protocol to proof-of-stake (PoS) through The Merge. While not an immediate dividend, the high gas fee was one of the major considerations for transitioning the protocol to PoS. The rationale is that a different transaction validation method can help in decongesting the network effectively.\n\nWith the high gas fees being recorded at the moment, the opposite appears to be the case. The cause may be linked to the massive meme coin hype that stirred intense network activity, causing a clog during the weekend.\n\nThis network activity reached a peak when Binance exchange listed PEPE tokens as well as Floki Inu for trading on its platform. This congestion, fueled in part by panic selling by whales and the accompanying soaring prices may reduce the gains accrued by these meme coins, especially for retail traders.\n\nPlace of Layer 2 solutions\n\nThe skyrocketing price of gas fees on Ethereum contributed to the birthing of innovative Layer 2 protocols like Polygon zkEVM, Arbitrum and Optimism. While the transaction fees on these protocols are a fraction of what it costs on the main Ethereum chain, users still bypass these L2s to carry out transactions on Ethereum.\n\nThe rationale for this remains unclear, but with innovative or community-focused protocols building on Ethereum mainnet, it generally becomes quite difficult for L2s to serve the purpose for which they are designed, lowering gas fees and championing scalability."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy8zLXVuZGVydmFsdWVkLWNyeXB0b3MtYnV5LWRpcC0wMDQ5NTA3MjAuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 May 2023 07:00:00 GMT",
        "title": "3 Undervalued Cryptos to Buy On the Dip in May 2023 - Yahoo Finance",
        "content": "While cryptocurrencies can be alluring, investors should remain cautious in ensuring a safe and well-diversified portfolio. That said, owning undervalued cryptos with impressive upside is the way to go, for investors with a higher risk appetite. Among the undervalued cryptos I think are worth holding are the following three tokens. These are each projects that have outperformed this year, and have plenty of upside potential over the long-term.\n\nOf course, while these may be undervalued cryptos relative to their previous valuations, they’re also risky. Thus, they’re not for everyone. That said, for those with the stomach for volatility, these are three cryptos I think could continue to outperform over the very long-term.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nArbitrum (ARB-USD)\n\nImage of two glowing blue chains shaking hands. representing sto platforms\n\nSource: LuckyStep/ShutterStock.com\n\nArbitrum (ARB-USD) is a new and popular addition to the Ethereum blockchain ecosystem that aims to transform how transactions are conducted on the network. Using optimistic rollups, a unique method, Arbitrum’s Layer-2 scaling solution promises to enhance the speed, scalability, and cost-effectiveness of Ethereum transactions.\n\nAltLayer has been chosen as the first rollups-as-a-service provider to assist Arbitrum Orbit as the Ethereum Layer 2 scaling solution now moves into the Layer 3 space. Arbitrum has gained investors’ attention due to its ability to enhance the efficiency and speed of transactions on the Ethereum network.\n\nArbitrum stands out for being a fast and cost-efficient solution that sends all transaction data to the main Ethereum blockchain. With a speed of 40,000 transactions per second, Arbitrum outpaces Ethereum’s 14 TPS. Additionally, while Ethereum’s transactions can cost several dollars, Arbitrum’s transactions cost only about two cents. Arbitrum is shaking up the competition in the Ethereum L2 space, outpacing other competitors.\n\nStory continues\n\nSolana (SOL-USD)\n\nSolana logo on phone screen stock image. SOL-USD, Solana price predictions\n\nSource: sdx15 / Shutterstock.com\n\nSolana (SOL-USD) has emerged as a standout performer of the year, surging 33.58% in the first week after facing a decline of almost 94% in 2022. While this remarkable rebound is impressive, it remains to be seen if Solana can maintain its upward momentum throughout the remainder of 2023.\n\nSolana is currently undervalued in the crypto market and offers multiple use cases as a platform for decentralized finance, NFTs, gaming, and the metaverse. Despite its significant drop in value in 2022, Solana’s potential as a Layer 1 blockchain network makes it difficult to believe that investors consider it worthless.\n\nIn other SOL news, Solana Labs announced that Saga, a crypto-focused smartphone, will be available for public purchase on May 8. The smartphone was created with the understanding that smartphone gadgets will have a significant part in the development of the crypto sector and function as specifically designed wallets for digital currencies. The idea was first teased almost 10 months ago, and Solana hopes that Saga will have a positive impact on its entire ecosystem.\n\nIn my opinion, Solana has a positive outlook, especially with its innovative crypto phone. I have been optimistic about Solana since its initial announcement. While it is logical that mobile devices optimized for crypto will be the future of the industry, the question remains whether the broader public shares the same view.\n\nEthereum (ETH-USD)\n\nConcept graphic of Ethereum Classic (ETC) crypto logo in green techno style\n\nSource: shutterstock.com/BT Side\n\nThe second-largest digital currency, Ethereum (ETH-USD), remains alive for a while and is now facing major shifts. Its price trend is also unstable. However, is it a good time to buy or sell this digital asset?\n\nThe popularity of meme tokens based on Ethereum has led to fluctuations in transaction fees. These price shifts are beneficial for developers and users since the average fees have been decreasing over the last two years. Ethereum’s recent technological upgrades have positioned it well for future success. The switch from PoW to PoS has made it more energy-efficient and scalable. Additionally, upcoming developments such as cheaper transactions, increased security, and improved user experience make for an exciting roadmap ahead.\n\nIn summary, Ethereum appears to be a promising investment choice at present. Its growth potential is gaining attention, and its technological advancements are laying the foundation for long-term success. While investing in the volatile cryptocurrency market is never a certainty, Ethereum’s overall strength makes it a strong contender for generating wealth.\n\nOn the date of publication, Chris MacDonald had a position in SOL and ETH. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nChris MacDonald’s love for investing led him to pursue an MBA in Finance and take on a number of management roles in corporate finance and venture capital over the past 15 years. His experience as a financial analyst in the past, coupled with his fervor for finding undervalued growth opportunities, contribute to his conservative, long-term investing perspective.\n\nMore From InvestorPlace\n\nThe post 3 Undervalued Cryptos to Buy On the Dip in May 2023 appeared first on InvestorPlace."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy8zLXVuZGVydmFsdWVkLWNyeXB0b3MtYnV5LWRpcC0wMDQ5NTA3MjAuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 May 2023 07:00:00 GMT",
        "title": "3 Undervalued Cryptos to Buy On the Dip in May 2023 - Yahoo Finance",
        "content": "While cryptocurrencies can be alluring, investors should remain cautious in ensuring a safe and well-diversified portfolio. That said, owning undervalued cryptos with impressive upside is the way to go, for investors with a higher risk appetite. Among the undervalued cryptos I think are worth holding are the following three tokens. These are each projects that have outperformed this year, and have plenty of upside potential over the long-term.\n\nOf course, while these may be undervalued cryptos relative to their previous valuations, they’re also risky. Thus, they’re not for everyone. That said, for those with the stomach for volatility, these are three cryptos I think could continue to outperform over the very long-term.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nArbitrum (ARB-USD)\n\nImage of two glowing blue chains shaking hands. representing sto platforms\n\nSource: LuckyStep/ShutterStock.com\n\nArbitrum (ARB-USD) is a new and popular addition to the Ethereum blockchain ecosystem that aims to transform how transactions are conducted on the network. Using optimistic rollups, a unique method, Arbitrum’s Layer-2 scaling solution promises to enhance the speed, scalability, and cost-effectiveness of Ethereum transactions.\n\nAltLayer has been chosen as the first rollups-as-a-service provider to assist Arbitrum Orbit as the Ethereum Layer 2 scaling solution now moves into the Layer 3 space. Arbitrum has gained investors’ attention due to its ability to enhance the efficiency and speed of transactions on the Ethereum network.\n\nArbitrum stands out for being a fast and cost-efficient solution that sends all transaction data to the main Ethereum blockchain. With a speed of 40,000 transactions per second, Arbitrum outpaces Ethereum’s 14 TPS. Additionally, while Ethereum’s transactions can cost several dollars, Arbitrum’s transactions cost only about two cents. Arbitrum is shaking up the competition in the Ethereum L2 space, outpacing other competitors.\n\nStory continues\n\nSolana (SOL-USD)\n\nSolana logo on phone screen stock image. SOL-USD, Solana price predictions\n\nSource: sdx15 / Shutterstock.com\n\nSolana (SOL-USD) has emerged as a standout performer of the year, surging 33.58% in the first week after facing a decline of almost 94% in 2022. While this remarkable rebound is impressive, it remains to be seen if Solana can maintain its upward momentum throughout the remainder of 2023.\n\nSolana is currently undervalued in the crypto market and offers multiple use cases as a platform for decentralized finance, NFTs, gaming, and the metaverse. Despite its significant drop in value in 2022, Solana’s potential as a Layer 1 blockchain network makes it difficult to believe that investors consider it worthless.\n\nIn other SOL news, Solana Labs announced that Saga, a crypto-focused smartphone, will be available for public purchase on May 8. The smartphone was created with the understanding that smartphone gadgets will have a significant part in the development of the crypto sector and function as specifically designed wallets for digital currencies. The idea was first teased almost 10 months ago, and Solana hopes that Saga will have a positive impact on its entire ecosystem.\n\nIn my opinion, Solana has a positive outlook, especially with its innovative crypto phone. I have been optimistic about Solana since its initial announcement. While it is logical that mobile devices optimized for crypto will be the future of the industry, the question remains whether the broader public shares the same view.\n\nEthereum (ETH-USD)\n\nConcept graphic of Ethereum Classic (ETC) crypto logo in green techno style\n\nSource: shutterstock.com/BT Side\n\nThe second-largest digital currency, Ethereum (ETH-USD), remains alive for a while and is now facing major shifts. Its price trend is also unstable. However, is it a good time to buy or sell this digital asset?\n\nThe popularity of meme tokens based on Ethereum has led to fluctuations in transaction fees. These price shifts are beneficial for developers and users since the average fees have been decreasing over the last two years. Ethereum’s recent technological upgrades have positioned it well for future success. The switch from PoW to PoS has made it more energy-efficient and scalable. Additionally, upcoming developments such as cheaper transactions, increased security, and improved user experience make for an exciting roadmap ahead.\n\nIn summary, Ethereum appears to be a promising investment choice at present. Its growth potential is gaining attention, and its technological advancements are laying the foundation for long-term success. While investing in the volatile cryptocurrency market is never a certainty, Ethereum’s overall strength makes it a strong contender for generating wealth.\n\nOn the date of publication, Chris MacDonald had a position in SOL and ETH. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nChris MacDonald’s love for investing led him to pursue an MBA in Finance and take on a number of management roles in corporate finance and venture capital over the past 15 years. His experience as a financial analyst in the past, coupled with his fervor for finding undervalued growth opportunities, contribute to his conservative, long-term investing perspective.\n\nMore From InvestorPlace\n\nThe post 3 Undervalued Cryptos to Buy On the Dip in May 2023 appeared first on InvestorPlace."
    }
]