[
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNuYmMuY29tL3ZpZGVvLzIwMjMvMTEvMTYvYmxhY2tyb2NrLWZpbGVzLXNwb3QtZXRoZXJldW0tZXRmLWFwcGxpY2F0aW9uLXdpdGgtc2VjLWNyeXB0by13b3JsZC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Nov 2023 08:00:00 GMT",
        "title": "BlackRock files spot Ethereum ETF application with the SEC - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nBlackRock files spot Ethereum ETF application with the SEC: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, Jonathan Levin, co-founder and chief strategy officer at Chainalysis, discusses his testimony before the House Financial Services Committee on crypto's role in illicit finance."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNuYmMuY29tL3ZpZGVvLzIwMjMvMTEvMTYvYmxhY2tyb2NrLWZpbGVzLXNwb3QtZXRoZXJldW0tZXRmLWFwcGxpY2F0aW9uLXdpdGgtc2VjLWNyeXB0by13b3JsZC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Nov 2023 08:00:00 GMT",
        "title": "BlackRock files spot Ethereum ETF application with the SEC - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nBlackRock files spot Ethereum ETF application with the SEC: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, Jonathan Levin, co-founder and chief strategy officer at Chainalysis, discusses his testimony before the House Financial Services Committee on crypto's role in illicit finance."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjYzMjk5L2JsYWNrcm9jay1ldGhlcmV1bS1ldGYtc2Vj0gFCaHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjYzMjk5L2JsYWNrcm9jay1ldGhlcmV1bS1ldGYtc2Vj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Nov 2023 08:00:00 GMT",
        "title": "BlackRock files for spot Ethereum ETF with SEC - The Block",
        "content": "BlackRock, the world's largest asset manager, has officially filed for a spot Ethereum ETH +2.80% exchange-traded fund with the United States Securities and Exchange Commission.\n\nThe ETF, dubbed iShares Ethereum Trust, seeks to \"reflect generally the performance of the price of ether,\" reads Form S-1 filed with the SEC by iShares late Wednesday. The iShares brand is associated with BlackRock's ETF products.\n\nThe Form S-1 comes a week after BlackRock registered iShares Ethereum Trust entity with the Delaware Department of State Division of Corporations. Then hours after Nasdaq filed for the proposed ETF, confirming BlackRock is working on a spot ether ETF.\n\nBlackRock has selected Coinbase Custody Trust Company as the custodian for its proposed spot Ether ETF. Additionally, the CME CF Bitcoin Reference Rate from administrator CF Benchmarks, a subsidiary of Kraken, has been chosen as the proposed ETF's benchmark. These selections align with those made for its proposed spot Bitcoin ETF.\n\nThe price of ether (ETH) jumped nearly 2% to around $2,080 on the news.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nBlackRock's bitcoin ETF filing awaits SEC approval\n\nBlackRock filed for the iShares Bitcoin Trust in June of this year, which moved markets. The SEC is currently reviewing multiple spot bitcoin ETF applications, including one from BlackRock. The asset manager's bitcoin ETF ticker, IBTC, has also appeared on the Depository Trust & Clearing Corp's website since August — but was noticed only late last month.\n\nBig trading firms, including Jane Street, Virtu Financial, and Jump Trading, are reportedly already in talks to provide liquidity for BlackRock's proposed spot bitcoin ETF if it obtains regulatory approval. Bitcoin's price has rallied over the past month due to the prospect of a spot bitcoin ETF approval. Last month, BlackRock CEO Larry Fink said that a rally in the price of bitcoin triggered by a false news report that said its spot ETF was approved served as an example of \"pent-up interest in crypto.\"\n\nEarlier this week, someone registered an entity named \"iShares XRP Trust\" in Delaware and attributed it to BlackRock. At the time, BlackRock said that the filing has no relation to the asset manager. The matter is now under investigation by the Delaware Department of Justice."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvZG9nZWNvaW4tbGVhdmVzLWJpdGNvaW4tZXRoZXJldW0taW4tdGhlLWR1c3QtYWZ0ZXItdGhpcy1zcGFjZS1jb21wYW55LWxpdGVyYWxseS1wbGFucy10b9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Nov 2023 08:00:00 GMT",
        "title": "Dogecoin Leaves Bitcoin, Ethereum In The Dust After This Space Company Literally Plans To Take It 'To The Moon' - Nasdaq",
        "content": "Even as the leading cryptocurrencies such as Bitcoin (CRYPTO: BTC) and Ethereum (CRYPTO: ETH) dip, the popular meme-inspired digital currency Dogecoin (DOGE) has bucked the trend with a 5% increase.\n\nWhat Happened: This growth comes after an announcement said that Dogecoin is scheduled for a lunar trip. Astrobotic, a pioneering space robotics technology company, affirmed plans to transport a physical representation of DOGE to the moon aboard the Peregrine Lunar Lander.\n\nThe official statement from Dogecoin asserted, \"Astrobotic plans to send a physical Dogecoin to the moon in the DHL Moonbox via ULA's (United Launch Alliance) Vulcan Centaur Rocket on 12/23/2023. Funded by our community in 2015, this mission embodies collective effort!\"\n\n🚀Dogecoin On The Moon Update🌕Exciting news for the Dogecoin community!🌑Astrobotic plans to send a physical Dogecoin to the moon in the DHL Moonbox via ULA's Vulcan Centaur Rocket on 12/23/2023. Funded by our community in 2015, this mission embodies collective effort! pic.twitter.com/QESz4ikHln\n\n— Dogecoin (@dogecoin) November 16, 2023\n\nSee More: Dogecoin HODLERs Are Beating Shiba Inu With 57% Landing In Profits, IntoTheBlock Data Reveals\n\nWhy It Matters: The decision to send Dogecoin to the moon is a literal translation of the popular ‘To the Moon’ rallying cry within the cryptocurrency community.\n\nTo facilitate this celestial voyage, Astrobotic will utilize DHL’s MoonBox service—a time capsule initiative intended to safely transport and harbor items on the lunar surface for potentially hundreds of years. The MoonBox will carry a diverse array of objects, including personal mementos and a part of Mount Everest. As described by the launch packet, \"Astrobotic accepted small personal mementos for inclusion on Peregrine Mission One. ‘Moon Capsules' containing payloads from around the world will be stored aboard Peregrine on the moon for centuries to come.\"\n\nSantiment, an on-chain analytics firm, said Dogecoin has had a modest 5% surge on a mostly flat crypto market day. \"It has been aided by $665M in on-chain transaction volume, its highest level in 3 months. There is also a notable amount of DOGE longs opening as traders bet on prices rising.\"\n\n🐶 #Dogecoin has had a modest +5% surge on a mostly flat #crypto market day. It has been aided by $665M in #onchain transaction volume, its highest level in 3 months. There is also a notable amount of $DOGE longs opening as traders bet on prices rising. https://t.co/uFgCCIxih0 pic.twitter.com/DussxIPJN2\n\n— Santiment (@santimentfeed) November 16, 2023\n\nPrice Action: At the time of writing, DOGE was trading at $0.081 up 5.33% in the last 24 hours, according to Benzinga Pro.\n\nRead Next: Here’s How Much You Should Invest In Shiba Inu Today For A $1M Payday If SHIB Hits 1 Cent?\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nGet insight into trading platforms. Compare the best online stock brokerages.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvZG9nZWNvaW4tbGVhdmVzLWJpdGNvaW4tZXRoZXJldW0taW4tdGhlLWR1c3QtYWZ0ZXItdGhpcy1zcGFjZS1jb21wYW55LWxpdGVyYWxseS1wbGFucy10b9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Nov 2023 08:00:00 GMT",
        "title": "Dogecoin Leaves Bitcoin, Ethereum In The Dust After This Space Company Literally Plans To Take It 'To The Moon' - Nasdaq",
        "content": "Even as the leading cryptocurrencies such as Bitcoin (CRYPTO: BTC) and Ethereum (CRYPTO: ETH) dip, the popular meme-inspired digital currency Dogecoin (DOGE) has bucked the trend with a 5% increase.\n\nWhat Happened: This growth comes after an announcement said that Dogecoin is scheduled for a lunar trip. Astrobotic, a pioneering space robotics technology company, affirmed plans to transport a physical representation of DOGE to the moon aboard the Peregrine Lunar Lander.\n\nThe official statement from Dogecoin asserted, \"Astrobotic plans to send a physical Dogecoin to the moon in the DHL Moonbox via ULA's (United Launch Alliance) Vulcan Centaur Rocket on 12/23/2023. Funded by our community in 2015, this mission embodies collective effort!\"\n\n🚀Dogecoin On The Moon Update🌕Exciting news for the Dogecoin community!🌑Astrobotic plans to send a physical Dogecoin to the moon in the DHL Moonbox via ULA's Vulcan Centaur Rocket on 12/23/2023. Funded by our community in 2015, this mission embodies collective effort! pic.twitter.com/QESz4ikHln\n\n— Dogecoin (@dogecoin) November 16, 2023\n\nSee More: Dogecoin HODLERs Are Beating Shiba Inu With 57% Landing In Profits, IntoTheBlock Data Reveals\n\nWhy It Matters: The decision to send Dogecoin to the moon is a literal translation of the popular ‘To the Moon’ rallying cry within the cryptocurrency community.\n\nTo facilitate this celestial voyage, Astrobotic will utilize DHL’s MoonBox service—a time capsule initiative intended to safely transport and harbor items on the lunar surface for potentially hundreds of years. The MoonBox will carry a diverse array of objects, including personal mementos and a part of Mount Everest. As described by the launch packet, \"Astrobotic accepted small personal mementos for inclusion on Peregrine Mission One. ‘Moon Capsules' containing payloads from around the world will be stored aboard Peregrine on the moon for centuries to come.\"\n\nSantiment, an on-chain analytics firm, said Dogecoin has had a modest 5% surge on a mostly flat crypto market day. \"It has been aided by $665M in on-chain transaction volume, its highest level in 3 months. There is also a notable amount of DOGE longs opening as traders bet on prices rising.\"\n\n🐶 #Dogecoin has had a modest +5% surge on a mostly flat #crypto market day. It has been aided by $665M in #onchain transaction volume, its highest level in 3 months. There is also a notable amount of $DOGE longs opening as traders bet on prices rising. https://t.co/uFgCCIxih0 pic.twitter.com/DussxIPJN2\n\n— Santiment (@santimentfeed) November 16, 2023\n\nPrice Action: At the time of writing, DOGE was trading at $0.081 up 5.33% in the last 24 hours, according to Benzinga Pro.\n\nRead Next: Here’s How Much You Should Invest In Shiba Inu Today For A $1M Payday If SHIB Hits 1 Cent?\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nGet insight into trading platforms. Compare the best online stock brokerages.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    }
]