[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vZGVjcnlwdC5jby8xMjE2MTUvbmJhLXN0YXItcGF1bC1waWVyY2Utc2VjLWZpbmUtZXRoZXJldW0tbWF40gFKaHR0cHM6Ly9kZWNyeXB0LmNvLzEyMTYxNS9uYmEtc3Rhci1wYXVsLXBpZXJjZS1zZWMtZmluZS1ldGhlcmV1bS1tYXg_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "NBA Star Paul Pierce Hit With $1.4 Million SEC Fine For Shilling Ethereum Max - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe U.S. Securities and Exchange Commission has come down on former NBA star Paul Pierce for unlawfully shilling a little-known cryptocurrency.\n\nEx-Boston Celtics star Paul Pierce agreed to pay over $1.4 million in penalties to settle the charges, the SEC announced today.\n\nAccording to the regulatory body, Pierce didn't disclose that he received over $244,000 in EthereumMax (EMAX) to promote the asset on Twitter.\n\nAD\n\nAD\n\nToday we announced charges against former NBA player Paul Pierce for touting EMAX tokens on social media without disclosing the payment he received for the promotion and for making false and misleading promotional statements about the same crypto asset. — U.S. Securities and Exchange Commission (@SECGov) February 17, 2023\n\n\"This case is yet another reminder to celebrities: The law requires you to disclose to the public from whom and how much you are getting paid to promote investment in securities, and you can’t lie to investors when you tout a security,\" said SEC Chair Gary Gensler, who is currently launching a tough crackdown on the crypto industry.\n\nEMAX is a token that runs on Ethereum, the blockchain behind the world’s second biggest cryptocurrency.\n\nIt doesn't appear to have any utility and is currently trading for $0.000000005150, a 392% 24-hour rise, according to CoinGecko. It is down 99% from its all-time high last year.\n\nEMAX made headlines in 2021 when super rich celebrities Kim Kardashian and Floyd Mayweather promoted it. Investors who say they were duped sued the celebrities last year, though the lawsuit was eventually dismissed.\n\nAD\n\nAD\n\nKim Kardashian, however, agreed to pay the SEC $1.26 million in fines over her promotion of EthereumMax.\n\nPierce agreed to pay the $1.4 million fine but did not admit or deny the SEC's charges, which claim he violated the anti-touting and antifraud provisions of the federal securities laws.\n\nHe also agreed to not promote any digital asset securities for three years."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYmx1ci10b2tlbi1haXJkcm9wLXNwaWtlcy1ldGhlcmV1bS1nYXMtcHJpY2VzLWFuZC1idXJuL9IBWGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYmx1ci10b2tlbi1haXJkcm9wLXNwaWtlcy1ldGhlcmV1bS1nYXMtcHJpY2VzLWFuZC1idXJuL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "Blur Token Airdrop Spikes Ethereum Gas Prices And Burn - NewsBTC",
        "content": "While the crypto market is still in an uptrend despite the Securities and Exchange Commission’s (SEC) increase in regulatory actions, projects have been seen taking advantage of the so-called ‘mini bull run’ with new launches. NFT marketplace Blur is one of them.\n\nOn Valentine’s day, February 14, Blur airdropped its native token under the ticker BLUR. The digital asset was launched on the Ethereum blockchain to users who have actively traded NFTs on the marketplace over the past six months.\n\nFollowing the project’s token airdrop, network activity on the Ethereum blockchain has soared, spiking the network’s gas prices and the amount of ETH burned in a day. This network’s spike in activity can be linked to Blur users claiming their respective airdropped tokens and to the transactions on the marketplace.\n\nBLUR Token Surges Ethereum Network Activity\n\nAccording to data from Ultra Sound Money, a total amount of 2,469 ETH worth roughly $4 million has been burned in the last seven days, removing a portion of ETH from circulation permanently, which has had a positive effect on ETH’s price.\n\nOver the past weeks, Ethereum network activity has been trending to the upside, mirroring ETH’s surge in price. Two weeks ago, NewsBTC reported that the amount of Ethereum burned recorded a new high exceeding the 3,000 ETH mark.\n\nThis metric seems relatively low to the ETH burned due to the BLUR token airdrop, which hasn’t been the only new high Ethereum has recorded in the past month. In January, the Ethereum staked on the Beacon chain, the proof-of-stake blockchain, reached an all-time high of over 16.16 million ETH, which holds more than 13.28% of the total ETH supply.\n\nEntering The Spotlight\n\nWhile the token has boosted Ethereum’s activity, the marketplace is beginning to seize the spotlight with massive recognition. According to the data provider, Dune analytics, the Blur NFT marketplace has gained traction, obtaining a larger share of the NFT market ecosystem.\n\nBlur controlled 64.6% of NFT market trading volume in the past week as opposed to OpenSea’s 24.4% and X2Y2’s relatively low trading volume of 5.1%. Though OpenSea has the most recognition, Blur’s recent airdrop has increased its popularity.\n\nBlur is an NFT marketplace and market aggregator that offers services such as advanced analytics, excellent portfolio management capabilities, and the ability to compare NFTs on multiple marketplaces.\n\nUnlike Opensea’s royalty fee, Blur takes a distinct approach of enforcing royalty fees only when requested by creators. The platform currently does not enforce full royalties. Instead, it enables the enforcement of only a 0.5% minimum creator royalty, allowing users to pay more when purchasing an NFT item on the marketplace.\n\nWhile the marketplace has begun to gain needed traction, its native token BLUR hasn’t been left out of the equation. Amid the increase in activity, BLUR went as high as $5 before suffering a massive retracement bringing its price to as low as $0.90.\n\nOver the past three days, BLUR has plummeted by over 80% and trades below $1 for $0.93. BLUR still ranks #131 on CoinGecko with a market cap above $350 million.\n\nFeatured image from Unsplash, Chart from TradingView.\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vZXhwbGFpbmVkL2V0aGVyZXVtLXNoYW5naGFpLXVwZ3JhZGUtZXhwbGFpbmVk0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "Ethereum Shanghai upgrade, explained - Cointelegraph",
        "content": "What is the Ethereum Shanghai upgrade? The Ethereum blockchain went through an upgrade termed “the Merge” in September 2022 that changed the consensus mechanism of the chain. Another upgrade to the chain termed the “Shanghai” is expected around mid-March and may have economic implications across the board. The Ethereum Shanghai upgrade is also called the “Ethereum Shanghai fork.” As part of this upgrade, there are five Ethereum Improvement Proposals (EIPs) that are expected to be rolled out. EIP-4895 is perhaps going to be the one grabbing all the headlines, as it will unlock staked Ether (ETH) and allow withdrawals. Through the Merge that happened in September 2022, the consensus mechanism of the blockchain moved from proof-of-work (PoW) to proof-of-stake (PoS). In doing so, the governance of the chain moved away from a resource-intensive mechanism and became more environmentally, socially and governance (ESG) friendly. While PoS might be more environmentally friendly, it relies on a staking process. ETH holders had to stake at least 32 ETH to participate in the consensus mechanism. They earn a staking yield that is currently just over 5%. As 32 ETH is around $52,000 at present, it is unfeasible for smaller investors to participate. However, platforms such as Lido and Coinbase offer staking facilities to users even for smaller Ether holdings and charge them a fee on their staking income. The staked Ether has been locked for about two years or since the staking market emerged. The Ethereum Shanghai upgrade allows users to withdraw their staked Ethereum. As a result, the Ethereum community is eagerly waiting to unlock their Ethereum post-upgrade.\n\nWhat does the Shanghai fork mean for Ethereum stakeholders? The Ethereum blockchain went live on July 30, 2015, and only had the Bitcoin blockchain to draw inspiration from. As a result, it still suffers from several suboptimal features from which subsequent blockchains have learned and implemented better. Can the upgrade help with addressing these pain points? Historically, Ethereum has suffered from slow transactions and high transaction fees. This has especially been noticeable since the decentralized finance (DeFi) boom increased the transaction value locked (TVL) on the chain. The rise of nonfungible tokens (NFTs) and the craze to mint NFTs through 2021 and early 2022 has added to bad user experiences and high gas fees. Apart from EIP-4895, which is largely focused on Ethereum stakers, EIP-3855 and EIP-3860 are expected to be shipped as part of the upgrade. EIP-3855 should help with transaction speeds, and EIP-3860 hopes to reduce transaction costs. These improvements should help improve network usage across DeFi and NFTs, as some of these ecosystems were affected by high gas fees and slow transactions. Projects had moved to other chains, such as Solana or Ethereum layer-2 scaling solutions like Polygon, due to these issues. These projects and newer ones consider Ethereum more favorably with these upgrades. More flexible staking, better performance and a rise in ecosystem stakeholders could amplify the resulting network effect and help the chain in the long run.\n\nHow will the Ethereum Shanghai upgrade affect ETH traders? Most blockchain upgrades have an impact on price action. The Ethereum Shanghai upgrade would be no different. Ether supplies on exchanges have already started to plunge as investors choose to move their assets to self-custody. The previous Ethereum upgrade created good volatility in the market, which traders tapped into. ETH prices skyrocketed from around $1,000 in July 2022 to over $2,000 in August and reached about $1,800 just around the time of the Merge. With exchange supplies of Ether plummeting fast, traders may see yet another spike in price leading to the Shanghai upgrade. However, short-term traders might want to note the fall in Ether’s price since the Merge was pushed in 2022. This upgrade may not be too different. The other factor to keep in mind is that Ethereum users who haven’t been able to withdraw their staked Ether for over two years will have access to do so right after the Shanghai upgrade. With over 16.4 million ETH staked, if some of that hits the market, it could increase the supply of Ether and bring prices down right after the Shanghai upgrade is complete. This relationship between supply and demand is a fundamental principle of economics and is a key factor in determining the price of any asset, including cryptocurrencies, stocks, bonds and commodities. It’s also worth noting that, although downside risks for price action exist after the Shanghai update due to staking withdrawals, ETH withdrawals will only be available in small chunks. For instance, traders who want to withdraw their Ether after the upgrade will only be able to do so in stages over time. This might mitigate downside risks to Ether prices. But the fear of increased supply is something that could hurt market sentiment in the short term.\n\nHow will the Ethereum Shanghai upgrade affect ETH users? Ethereum has long suffered from poor user experiences due to transaction inefficiencies and high costs. Some of these user experiences should improve with the Shanghai upgrade. As several Ethereum use cases have emerged since the 2018 bear market, the TVLs and usage of the chain have increased exponentially, resulting in network effects. The chain wasn’t engineered for this explosive growth and has struggled with high gas fees and slow transactions. As a result, Ethereum has often been tagged as the “rich people’s chain.” The minting of Yuga labs’ “The Otherside” was one such event when gas fees as high as 2.5 ETH were paid to get the NFTs. Such expensive affairs are non-existent in next-generation blockchains, such as Solana, where the user experience and low transaction fees have helped draw a large user base. Ethereum could be the chain of choice for all users if it solved the gas fee issue. Many gaming projects had moved off of Ethereum onto Solana, Polygon and Immutable X, as gaming had to support micro-transactions. Ethereum must become more efficient, fast and scalable to attract these kinds of projects. Sharding is one feature that Ethereum has in its pipeline, which is similar to parallel processing in traditional computing terms. The Shanghai upgrade is a stepping stone toward achieving sharding later in 2023. As transaction speeds increase and costs lower in due course, Ethereum will have more exciting applications for its user base and will be able to accommodate more than just wealthy users.\n\nWhat does the Ethereum Shanghai upgrade mean for investors? Investors generally tend to take a longer-term view of an asset than traders. As a result, they focus more on fundamentals than short-term price action and technical indicators. On that note, the Shanghai upgrade improves the fundamentals of the chain and should be viewed favorably by investors. Ethereum has the ability to lead the institutional adoption of cryptocurrencies. The Merge was the first step in that direction, as checking the ESG box could bring in more institutional capital onto Ethereum and, eventually, into the broader crypto ecosystem. Also, the ability for institutional investors to participate in staking and earn a yield resembles fixed financial instruments — e.g., bonds — in capital markets. As Ether becomes the blue-chip asset of the cryptocurrency market, the staking yields from Ether could be synonymous with the risk-free rate that traditional capital markets often use to price their assets. As a result, staking rewards from other chains and DeFi applications native to Ethereum must at least match — but, ideally, exceed — Ethereum staking yields. Therefore, the Ethereum upgrade is likely going to have economic model implications as other chains and applications design their product and service offerings. With the fundamentals of Ethereum improving through the Merge, the Shanghai upgrade and the introduction of sharding in 2023, retail and institutional investors will want to be part of the Ethereum ecosystem growth story."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiMGh0dHBzOi8vd3d3LmNuYmMuY29tL3NlbGVjdC9ob3ctaXMtY3J5cHRvLXRheGVkL9IBNGh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC9zZWxlY3QvaG93LWlzLWNyeXB0by10YXhlZC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "Everything you need to know about filing crypto taxes — especially if your exchange went bankrupt - CNBC",
        "content": "Cryptocurrency is classified as property by the IRS. That means crypto income and capital gains are taxable and crypto losses may be tax deductible. Last year, many cryptocurrencies lost more than half their value and major crypto exchanges — like FTX — collapsed. The silver lining is you may be able to reduce your 2022 tax burden if you lost money in crypto. CNBC Select talked with Shehan Chandrasekera, head of tax strategy at CoinTracker, a crypto tax software company, about how cryptocurrency is taxed and what you need to know if your crypto exchange declared bankruptcy.\n\nHow cryptocurrency is taxed\n\nMany of cryptocurrency's most passionate advocates emphasize the decentralization of the blockchain, but it's important to remember that the federal government is keeping tabs on who is earning how much when it comes to crypto and taxes. \"The biggest misconception in this space in general is that people think that crypto is invisible to the regulators. But that's not the case,\" says Chandrasekera. There's a permanent record of all your activity on the blockchain and many crypto exchanges report to the IRS. For the most part, the IRS treats crypto as an asset subject to its rules on capital gains and losses, similar to stocks. When you buy cryptocurrency or stocks, the original purchase price of the asset becomes its cost basis. When you sell that asset, you're taxed based on the difference between the cost basis and the sale price. Capital gains and capital losses are based on the net total of all transactions that year. If you sold five different assets for a total gain of $10,000 and three other assets at a total loss of $15,000, then you have $5,000 in capital losses. You can deduct up to $3,000 a year in capital losses from your taxable income and can carry over losses exceeding that annual limit to future years. For example, if you had $5,000 in capital losses in 2022, you can reduce your taxable income by $3,000 in 2022 and apply the remaining $2,000 in losses to 2023. Capital gains are taxed differently based on how long you hold an asset before selling. Short-term capital gains taxes apply to assets you've held for one year or less and long-term capital gains taxes are assessed when you sell an asset after owning it for more than one year. Your exact capital gains rate depends on several factors, but long-term capital gains are typically taxed at a lower rate than short-term gains. And you may not have to pay any capital gains tax at all, depending on your filing status and taxable income. If you use digital currency for daily transactions, you may want to enlist the help of a tax professional. For everyone else, tax software offered by companies such as H&R Block, TurboTax, TaxSlayer can help you file your taxes when you have taxable-crypto transactions.\n\nH&R Block Learn More On H&R Block's secure site Cost Costs may vary depending on the plan selected (Free Online, Deluxe, Premium, or Self-Employed) - click \"Learn More\" for details\n\nFree version Yes (for simple returns only)\n\nMobile app Yes\n\nLive support Available with some pricing and filing options Terms apply.\n\nTurboTax Learn More On TurboTax's secure site Cost Costs may vary depending on the plan selected - click \"Learn More\" for details\n\nFree version TurboTax Free Edition. ~37% of taxpayers qualify. Form 1040 + limited credits only.\n\nMobile app Yes\n\nLive support Available with some pricing and filing options Click here for TurboTax offer details and disclosures. Terms apply.\n\nTaxSlayer Learn More On TaxSlayer's secure site File your taxes for as low as $27.02 with TaxSlayer* Use Code: CNBC18\n\nCost Costs may vary depending on the plan selected\n\nFree version Yes (basic 1040)\n\nMobile app Yes\n\nTax expert support Yes, certain plans *18% off your federal tax return. Offer is valid on federal tax returns e-filed by April 15, 2024, at 11:59 p.m. ET. Only valid for new or first time TaxSlayer users only. Promotion code must be entered at checkout. Offer is not applicable to state tax returns or additional products. Offer is valid for one-time use only and cannot be combined with any other coupons, promotions, discounts, or offers. Offer is nontransferable, cannot be sold or otherwise bartered, and is not applicable to previous purchases or returns.\n\nIn most cases, capital gains and losses apply to your crypto transactions. However, there are instances where cryptocurrency is taxed as income, in which case it's subject to a marginal tax rate of up to 37% depending on your income level and filing status. Below we examine how each type of crypto transaction is classified for tax purposes: 1. Selling cryptocurrency (capital gains) Anytime you sell cryptocurrency the gain or loss in value has tax implications. This type of transaction tends to be straightforward, especially if you aren't frequently buying and selling crypto, and is classified under capital gains. 2. Exchanging one cryptocurrency for another (capital gains) A crypto swap is when you directly trade one cryptocurrency for another without exchanging your crypto for cash. Chandrasekera points out that many people mistakenly overlook this type of transaction when it comes to taxes because no cash was realized. But if you exchange Bitcoin for Litecoin or Ethereum for Bitcoin, it's a taxable event. 3. Spending crypto for goods or services (capital gains) Using crypto to buy goods or services has the same tax implications as selling it. \"It could be as little as you're going to Starbucks and spending a fraction of a Bitcoin to buy something and that could result in a taxable gain,\" Chandrasekera says. When you're buying anything with crypto, the taxable gain or loss is based on what you paid for the cryptocurrency and its value at the time of the transaction. 4. When you earn cryptocurrency (income) When you earn cryptocurrency it is considered taxable income based on the value of the coins at the time of receipt. This includes crypto earned from activities such as: Mining cryptocurrencies\n\nCrypto staking income\n\nYields on crypto accounts\n\nCrypto earned as regular pay or bonuses 5. Anytime you receive free coins (income) There are instances where you may receive free crypto and the value of the digital coins you receive is considered income. Two common scenarios where you may receive free crypto are airdrops and hard forks. An airdrop is when cryptocurrencies are given away for free and it's typically used as a marketing tool for new cryptocurrencies. A hard fork is a bit more complicated but to simplify it, it's essentially when a cryptocurrency splits into two types of tokens or coins. When this happens, you'll have your original coin and a new coin, with a separate value. The value of the cryptocurrency you receive from a hard fork is taxable income.\n\nWhat to do if your crypto exchange went bankrupt in 2022\n\nLast year, a crash in the crypto markets led to a string of crypto firms declaring bankruptcy — most notably FTX, which at its peak was valued at $32 billion. If you had crypto assets tied up in a company that's filed for bankruptcy, unfortunately, there isn't anything you can do for the 2022 tax year. \"When those bankruptcies get finalized in 2023, we will have more clarity on the amount of loss, the type of deduction you can get depending on the findings of the bankruptcies,\" Chandrasekera says. The bankruptcies could be the result of fraud or simply bad business decisions and, \"all those things affect the amount of the deduction, the type of the deduction and even when you can take the deduction,\" Chandrasekera says. It's also possible that you may get (some of) your money back, he says.\n\nSubscribe to the Select Newsletter! Our best selections directly into your inbox. Shopping recommendations that help upgrade your life, delivered weekly. Sign-up here.\n\nBottom line\n\nThe IRS classifies cryptocurrency as property or a digital asset. Any time you sell or exchange crypto, it's a taxable event. This includes using crypto used to pay for goods or services. In most cases, the IRS taxes cryptocurrencies as an asset and subjects them to long-term or short-term capital gains taxes. However, sometimes cryptocurrency is treated as income. Keep track of all your crypto activity so you don't get a nasty surprise at tax time. Catch up on CNBC Select's in-depth coverage of personal finance, tech and tools, wellness and more, and follow us on Facebook, Instagram and Twitter to stay up to date.\n\nEditorial Note: Opinions, analyses, reviews or recommendations expressed in this article are those of the Select editorial staff’s alone, and have not been reviewed, approved or otherwise endorsed by any third party."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiMGh0dHBzOi8vd3d3LmNuYmMuY29tL3NlbGVjdC9ob3ctaXMtY3J5cHRvLXRheGVkL9IBNGh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC9zZWxlY3QvaG93LWlzLWNyeXB0by10YXhlZC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "Everything you need to know about filing crypto taxes — especially if your exchange went bankrupt - CNBC",
        "content": "Cryptocurrency is classified as property by the IRS. That means crypto income and capital gains are taxable and crypto losses may be tax deductible. Last year, many cryptocurrencies lost more than half their value and major crypto exchanges — like FTX — collapsed. The silver lining is you may be able to reduce your 2022 tax burden if you lost money in crypto. CNBC Select talked with Shehan Chandrasekera, head of tax strategy at CoinTracker, a crypto tax software company, about how cryptocurrency is taxed and what you need to know if your crypto exchange declared bankruptcy.\n\nHow cryptocurrency is taxed\n\nMany of cryptocurrency's most passionate advocates emphasize the decentralization of the blockchain, but it's important to remember that the federal government is keeping tabs on who is earning how much when it comes to crypto and taxes. \"The biggest misconception in this space in general is that people think that crypto is invisible to the regulators. But that's not the case,\" says Chandrasekera. There's a permanent record of all your activity on the blockchain and many crypto exchanges report to the IRS. For the most part, the IRS treats crypto as an asset subject to its rules on capital gains and losses, similar to stocks. When you buy cryptocurrency or stocks, the original purchase price of the asset becomes its cost basis. When you sell that asset, you're taxed based on the difference between the cost basis and the sale price. Capital gains and capital losses are based on the net total of all transactions that year. If you sold five different assets for a total gain of $10,000 and three other assets at a total loss of $15,000, then you have $5,000 in capital losses. You can deduct up to $3,000 a year in capital losses from your taxable income and can carry over losses exceeding that annual limit to future years. For example, if you had $5,000 in capital losses in 2022, you can reduce your taxable income by $3,000 in 2022 and apply the remaining $2,000 in losses to 2023. Capital gains are taxed differently based on how long you hold an asset before selling. Short-term capital gains taxes apply to assets you've held for one year or less and long-term capital gains taxes are assessed when you sell an asset after owning it for more than one year. Your exact capital gains rate depends on several factors, but long-term capital gains are typically taxed at a lower rate than short-term gains. And you may not have to pay any capital gains tax at all, depending on your filing status and taxable income. If you use digital currency for daily transactions, you may want to enlist the help of a tax professional. For everyone else, tax software offered by companies such as H&R Block, TurboTax, TaxSlayer can help you file your taxes when you have taxable-crypto transactions.\n\nH&R Block Learn More On H&R Block's secure site Cost Costs may vary depending on the plan selected (Free Online, Deluxe, Premium, or Self-Employed) - click \"Learn More\" for details\n\nFree version Yes (for simple returns only)\n\nMobile app Yes\n\nLive support Available with some pricing and filing options Terms apply.\n\nTurboTax Learn More On TurboTax's secure site Cost Costs may vary depending on the plan selected - click \"Learn More\" for details\n\nFree version TurboTax Free Edition. ~37% of taxpayers qualify. Form 1040 + limited credits only.\n\nMobile app Yes\n\nLive support Available with some pricing and filing options Click here for TurboTax offer details and disclosures. Terms apply.\n\nTaxSlayer Learn More On TaxSlayer's secure site File your taxes for as low as $27.02 with TaxSlayer* Use Code: CNBC18\n\nCost Costs may vary depending on the plan selected\n\nFree version Yes (basic 1040)\n\nMobile app Yes\n\nTax expert support Yes, certain plans *18% off your federal tax return. Offer is valid on federal tax returns e-filed by April 15, 2024, at 11:59 p.m. ET. Only valid for new or first time TaxSlayer users only. Promotion code must be entered at checkout. Offer is not applicable to state tax returns or additional products. Offer is valid for one-time use only and cannot be combined with any other coupons, promotions, discounts, or offers. Offer is nontransferable, cannot be sold or otherwise bartered, and is not applicable to previous purchases or returns.\n\nIn most cases, capital gains and losses apply to your crypto transactions. However, there are instances where cryptocurrency is taxed as income, in which case it's subject to a marginal tax rate of up to 37% depending on your income level and filing status. Below we examine how each type of crypto transaction is classified for tax purposes: 1. Selling cryptocurrency (capital gains) Anytime you sell cryptocurrency the gain or loss in value has tax implications. This type of transaction tends to be straightforward, especially if you aren't frequently buying and selling crypto, and is classified under capital gains. 2. Exchanging one cryptocurrency for another (capital gains) A crypto swap is when you directly trade one cryptocurrency for another without exchanging your crypto for cash. Chandrasekera points out that many people mistakenly overlook this type of transaction when it comes to taxes because no cash was realized. But if you exchange Bitcoin for Litecoin or Ethereum for Bitcoin, it's a taxable event. 3. Spending crypto for goods or services (capital gains) Using crypto to buy goods or services has the same tax implications as selling it. \"It could be as little as you're going to Starbucks and spending a fraction of a Bitcoin to buy something and that could result in a taxable gain,\" Chandrasekera says. When you're buying anything with crypto, the taxable gain or loss is based on what you paid for the cryptocurrency and its value at the time of the transaction. 4. When you earn cryptocurrency (income) When you earn cryptocurrency it is considered taxable income based on the value of the coins at the time of receipt. This includes crypto earned from activities such as: Mining cryptocurrencies\n\nCrypto staking income\n\nYields on crypto accounts\n\nCrypto earned as regular pay or bonuses 5. Anytime you receive free coins (income) There are instances where you may receive free crypto and the value of the digital coins you receive is considered income. Two common scenarios where you may receive free crypto are airdrops and hard forks. An airdrop is when cryptocurrencies are given away for free and it's typically used as a marketing tool for new cryptocurrencies. A hard fork is a bit more complicated but to simplify it, it's essentially when a cryptocurrency splits into two types of tokens or coins. When this happens, you'll have your original coin and a new coin, with a separate value. The value of the cryptocurrency you receive from a hard fork is taxable income.\n\nWhat to do if your crypto exchange went bankrupt in 2022\n\nLast year, a crash in the crypto markets led to a string of crypto firms declaring bankruptcy — most notably FTX, which at its peak was valued at $32 billion. If you had crypto assets tied up in a company that's filed for bankruptcy, unfortunately, there isn't anything you can do for the 2022 tax year. \"When those bankruptcies get finalized in 2023, we will have more clarity on the amount of loss, the type of deduction you can get depending on the findings of the bankruptcies,\" Chandrasekera says. The bankruptcies could be the result of fraud or simply bad business decisions and, \"all those things affect the amount of the deduction, the type of the deduction and even when you can take the deduction,\" Chandrasekera says. It's also possible that you may get (some of) your money back, he says.\n\nSubscribe to the Select Newsletter! Our best selections directly into your inbox. Shopping recommendations that help upgrade your life, delivered weekly. Sign-up here.\n\nBottom line\n\nThe IRS classifies cryptocurrency as property or a digital asset. Any time you sell or exchange crypto, it's a taxable event. This includes using crypto used to pay for goods or services. In most cases, the IRS taxes cryptocurrencies as an asset and subjects them to long-term or short-term capital gains taxes. However, sometimes cryptocurrency is treated as income. Keep track of all your crypto activity so you don't get a nasty surprise at tax time. Catch up on CNBC Select's in-depth coverage of personal finance, tech and tools, wellness and more, and follow us on Facebook, Instagram and Twitter to stay up to date.\n\nEditorial Note: Opinions, analyses, reviews or recommendations expressed in this article are those of the Select editorial staff’s alone, and have not been reviewed, approved or otherwise endorsed by any third party."
    }
]