[
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vdmlkZW8vZXRoZXJldW0tdmV0ZXJhbi1sYXllci0xLWJsb2NrY2hhaW4tMTQwNDAxMzU4Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "Ethereum Veteran on Layer 1 Blockchain LUKSO's Mainnet Launch - Yahoo Finance",
        "content": "LUKSO, a layer 1 blockchain for creative types, is set to launch its mainnet on Tuesday. Fabian Vogelsteller, co-founder and chief blockchain architect at LUKSO, joins \"First Mover\" to discuss the launch and his outlook on decentralized social media. Plus, how LUKSO enables innovation and expansion on the blockchain."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZGVjcnlwdC5jby8xNDA5NDEvdG9rZW5pemVkLXNlY3VyaXRpZXMtZXRoZXJldW0tcG9seWdvbi1nbm9zaXMtaGl0LTIyNW0tbWFya2V0LWNhcNIBYGh0dHBzOi8vZGVjcnlwdC5jby8xNDA5NDEvdG9rZW5pemVkLXNlY3VyaXRpZXMtZXRoZXJldW0tcG9seWdvbi1nbm9zaXMtaGl0LTIyNW0tbWFya2V0LWNhcD9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "Tokenized Securities on Ethereum, Polygon, Gnosis Hit $225M Market Cap - Decrypt",
        "content": "Create an account to save your articles.\n\nCreate an account to save your articles.\n\nYour Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe tokenization trend is gaining momentum.\n\nA Dune dashboard shows that the niche now boasts a market capitalization of more than $220 million across the six projects measured.\n\nTokenization refers to issuing financial securities, like stocks and bonds, on the blockchain.\n\nAD\n\nAD\n\nFirms like Matrixport, Backed Finance, Ondo, and Franklin Templeton have all created ERC-20 tokens, representing government bonds or exchange-traded funds (ETFs)stock.\n\nLast month, for example, Franklin Templeton tapped Polygon to host a tokenized version of its Nasdaq-listed OnChain U.S. Government Money Fund (FOBXX). Elsewhere, Backed Finance launched a tokenized version of Coinbase’s stock on Ethereum.\n\nPer the same Dune dashboard, the collection of firms in the niche has issued tokenized securities on Ethereum, Polygon, and Gnosis Chain. The majority of activity is, however, occurring on Ethereum.\n\nTokenization of securities. Source: Dune.\n\nOndo and MatrixDock dominate the market with 61.4% and 32.1% share, with mostly short-term U.S. government bonds, which currently yield 4% to 5% due to the hike in benchmark interest rates by the Federal Reserve.\n\nBoth Ondo and MatrixDock provide tokenized securities on U.S. government bonds providing a suite of digital asset management tools, trading services, and financial products.\n\nAD\n\nAD\n\n\"From our conversations with the biggest DAOs, crypto treasuries, and venture capital funds, we can see that demand for tokenized securities, especially U.S. Treasuries will gain huge momentum this year,\" OpenEden co-founder Eugene Ng told Decrypt.\n\nOndo also offers a lending service called Flux, allowing users to put their ERC-20 securities token as collateral. So far, users have added bonds worth $41.2 million as collateral.\n\nBacked Finance’s tokenized fixed-income bonds are also accepted as collateral on DeFi protocols like Angle and Ribbon Finance.\n\nBesides issuing U.S. Treasury Bills, the Swiss-based firm also launched its own ERC-20 version of BlockRock’s ETF of over 400 companies in the S&P 500 index.\n\nBacked Finance’s head of marketing Kit Popplestone told Decrypt that the “interoperability between tokenized assets and DeFi platforms unlocks significant opportunities for new products and makes lending more efficient.”\n\nTokenization trend on the rise\n\nBlackRock’s CEO Larry Fink believes that tokenization of securities will form “the next generation for markets.”\n\nFink noted in a New York event last year that tokenized securities provide advantages such as instantaneous settlement, reduced fees, and simple integration in BlackRock’s business model.\n\nCiti Bank analysts shared similar opinions in a March 2023 report, noting that central bank digital currencies—called CBDCs—and tokenization would drive adoption.\n\nAD\n\nAD\n\nWhile blockchain technology shows promise of innovation with tokenized securities, regulatory clarity has restricted growth and adoption.\n\n“To continue this rapid growth, we need regulatory clarity and consistency, and just as importantly, tokens must be interoperable and composable with DeFi,” said Popplestone.\n\nNevertheless, he added that as the global interest in central bank digital currencies and on-chain assets rises, the demand for tokenized securities “is only going to increase.”"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vZmluYm9sZC5jb20vd2UtYXNrZWQtY2hhdGdwdC13aGF0LXdpbGwtYmUtZXRoZXJldW0tcHJpY2UtZW5kLW9mLTIwMjMtaGVyZXMtd2hhdC1pdC1zYWlkL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "We asked ChatGPT what will be Ethereum price end of 2023; Here's what it said - Finbold - Finance in Bold",
        "content": "As artificial intelligence (AI) technology is witnessing renewed worldwide and cross-industry interest sparked by the release of ChatGPT, the text-based AI platform has proven its worth in analyzing the cryptocurrency market to provide insights into the future price trends of assets such as Ethereum (ETH).\n\nIn this context, Finbold has asked ChatGPT to share its predictions on the potential trading range of Ethereum by the end of 2023, and after dutifully stating that it could not predict future prices, it has provided multiple factors that could affect ETH price by the year’s end.\n\nFactors affecting ETH price\n\nSpecifically, as for some of these factors, ChatGPT has singled out the overall sentiment and perception of Ethereum within the crypto community and general market, arguing that “positive sentiment, increased adoption, and growing interest from investors may potentially drive the price higher.”\n\nFurthermore, the AI chatbot explained that “the development and implementation of new features, upgrades, and improvements to the Ethereum network can impact its price,” such as the Ethereum 2.0 update, as well as highlighted the influence of the flagship decentralized finance (DeFi) asset, Bitcoin (BTC).\n\nChatGPT on Bitcoin affecting Ethereum price. Source: ChatGPT\n\nOn top of that, ChatGPT said that Ethereum had “a large and active community of developers, users, and supporters,” the growth of which, along with the continued development of decentralized applications (dApps) on the platform, could also positively impact the price.\n\nAccording to the AI language model, other influential factors include regulatory changes and government policies related to cryptocurrencies, economic conditions and geopolitical events, as well as social media platforms, news articles, and influential figures within the crypto space.\n\nAI ETH price prediction\n\nMeanwhile, the crypto price prediction platform CoinPriceForecast has been able to deliver specific figures on the possible price of Ethereum for the coming years, including by the end of 2023, with the current projection standing at $2,142, which would represent an increase of 15% to the price of the digital asset as of May 23.\n\nEthereum 2023 price projection. Source: CoinPriceForecast\n\nInterestingly, the latest year-end numbers are close to the earlier long-term forecast from February 2023, when the same platform placed the price of Ethereum at $2,146 by the end of 2023, although the mid-year figures were a lot more bullish, as Finbold reported on February 23.\n\nMore recently, in April, a poll of 32 fintech and crypto experts projected that the price of Ethereum could reach its peak in 2023 at around $2,758. However, after that, they expect the price to start dropping again in the second half of 2023, sinking to the still bullish $2,342 by the end of the year.\n\nEthereum price analysis\n\nAs things stand, Ethereum is currently trading hands at the price of $1,856, recording an increase of 2.18% in the last 24 hours and a 2.13% gain over the previous seven days, as it moves to reverse the 0.84% decline on its monthly chart. Since the year’s start, ETH has grown 54.56%.\n\nEthereum year-to-date (YTD) price chart. Source: Finbold\n\nWhether Ethereum truly manages to push toward the projected price by the end of 2023 will, indeed, depend on the factors enumerated by ChatGPT, particularly the positive sentiment that could be driven by developments such as record-breaking staking returns after the recent ‘Shapella’ upgrade.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL2NvaW50ZWxlZ3JhcGguY29tL25ld3MvZXRoZXJldW0tcHJpY2UtaXMtcGlubmVkLWJlbG93LTEtOWstYW5kLWRhdGEtc3VnZ2VzdHMtdGhhdC1pcy11bmxpa2VseS10by1jaGFuZ2UtaW4tdGhlLXNob3J0LXRlcm3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "Ethereum price pinned below $1.9K, and data suggests it's unlikely to change in short–term - Cointelegraph",
        "content": "Ether’s price has been stuck below $1,920 for the past 16 days, which is especially concerning since the latest breakout attempt on May 6 lasted less than 24 hours. Excluding this brief price pump, Ether’s (ETH) journey below $1,920 was initiated on April 21, over 30 days ago.\n\nOne can likely blame the Ethereum network’s $8.80 average transaction fee for investors’ diminished appetite, but the macroeconomic environment has also played an important role. On May 22, JPMorgan Chase CEO Jamie Dimon said it is impossible to predict the outcome of the Federal Reserve’s monetary policy, designed to curb inflation.\n\nAs CNN reported, Dimon added:\n\n“You’re already seeing credit tighten up because the easiest way for a bank to retain capital is not to make the next loan.\"\n\nThe uncertainty surrounding the United States debt ceiling standoff between Joe Biden’s administration and the U.S. Congress is the probable cause for the worsening sentiment among institutional investors toward cryptocurrencies. According to CoinShares’ latest “Digital Asset Fund Flows Report,\" outflows across digital asset investment products hit $232 million over the past five weeks.\n\nFurthermore, there are two indicators that impact Ether’s price and signal reduced demand for its decentralized finance ecosystem, in addition to weak leverage buying activity from professional traders.\n\nTotal Ethereum deposits are stable, but there’s a catch\n\nThe Ethereum network’s limited processing capabilities have been causing high gas fees, which greatly reduces the demand for smart contract usage. For the past five weeks, the average transaction fee has remained above $8, although at first sight, no impact was felt.\n\nEthereum network applications' total deposits in ETH. Source: DefiLlama\n\nThe total value locked (TVL) in the network remained stable at 15.1 million ETH versus four weeks prior, but it is nearing the lowest levels since August 2020. As a comparison, the TVL on the BNB Smart Chain in BNB (BNB) terms was essentially flat in the same period, while TRX (TRX) deposits on the Tron network declined by 12%.\n\nBNB Smart Chain flips Ethereum’s lead in DEX volume\n\nEthereum has historically been the absolute leader in decentralized exchange (DEX) volumes, but it all changed in the week ending May 21.\n\nWeekly DEX volume by chain. Source: DefiLlama\n\nThe Ethereum network’s DEX market share drastically dropped from a 75.5% peak on March 5 to 22.3% on May 21. Meanwhile, BNB Smart Chain was the biggest beneficiary, growing to 61.1% from 5.6%.\n\nThe number of active addresses interacting with decentralized applications (DApps) is also in a slump. Over the last 30 days, the top 12 DApps running on the Ethereum network saw an 11% drop in active addresses, possibly reflecting investor dissatisfaction with the high transaction costs.\n\n30-day Ethereum DApp activity. Source: DappRadar\n\nData shows drop leverage traders using derivatives\n\nEther quarterly futures are popular among whales and arbitrage desks. However, these fixed-month contracts typically trade at a slight premium to spot markets, indicating that sellers are asking for more money to delay settlement.\n\nAs a result, ETH futures contracts in healthy markets should trade at a 4 to 8% annualized premium — a situation known as contango, which is not unique to crypto markets.\n\nEther 2-month futures annualized premium. Source: Laevitas\n\nAccording to the futures premium, known as the basis indicator, Ether professional traders have avoided leveraged longs (bullish bets) for the past four weeks. Moreover, not even the brief rally toward $2,000 on May 6 was enough to flip those whales and market makers into bullish sentiment.\n\nIn short, these three indicators signal bearishness — namely, the record-low DEX market share, the declining addresses engaging with DApps and a lack of leveraged buying demand.\n\nMaybe investors were expecting some kind of announcement out of Ethereum inventor Vitalik Buterin’s appearance at Edcon 2023 in Montenegro, which wasn’t the case — the fact is there’s no imminent driver to justify a sustainable rally above $1,920 in the short term.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiKmh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvaXMtZXRoZXJldW0tZGVhZNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 May 2023 07:00:00 GMT",
        "title": "Is Ethereum Dead? - Watcher Guru",
        "content": "Ethereum’s Death Sentence: Fact or Fiction?\n\nCryptocurrency enthusiasts and investors alike have been buzzing with rumors that Ethereum, the world’s second-largest cryptocurrency, is on the verge of collapse.\n\nSome skeptics claim that the Ethereum network’s high gas fees and scalability issues have rendered it obsolete, while others believe that Ethereum’s future remains bright.\n\nIn this article, we’ll look closer at Ethereum’s current state and its potential for long-term growth.\n\nSource: Pixabay\n\nThe Controversy Surrounding Ethereum’s Future\n\nEthereum has been a hot topic of discussion in the cryptocurrency community lately. The network’s scalability issues have resulted in high gas fees, making it difficult for small investors to participate.\n\nEthereum’s Proof of Work (PoW) consensus mechanism has also been criticized for inefficiency. On the other hand, Ethereum’s supporters argue that the network’s transition to Proof of Stake (PoS) will address these issues and ensure its longevity.\n\nDuring the cryptocurrency frenzy, skeptics are raising eyebrows and questioning the future of Ethereum and Bitcoin.\n\nThe debate heats up with critics voicing concerns about their viability, potential manipulation, environmental impact, and outdated technology.\n\nDiscover the eight reasons why some experts believe these digital assets may become relics and explore the emerging alternatives that could reshape the investment landscape.\n\nUnderstanding Ethereum: Proof of Work vs. Proof of Stake\n\nEthereum’s PoW algorithm requires miners to solve complex mathematical problems to validate transactions and create new blocks. This process consumes significant energy and has been criticized for contributing to climate change.\n\nEthereum 2.0, the network’s upcoming upgrade, will transition to PoS, eliminating the need for miners and reducing energy consumption. PoS allows network participants to secure the network by staking their cryptocurrency, with rewards proportional to their stake.\n\nIs Ethereum dead?\n\nDespite the criticism surrounding Ethereum, the network remains the second-largest cryptocurrency by market capitalization. The Ethereum network’s decentralization and its role as a platform for decentralized applications (dapps) have contributed to its popularity.\n\nHowever, Ethereum’s high gas fees have made it difficult for small investors and dapp developers to use the network. The network’s scalability issues have also resulted in slower transaction times, further hindering its adoption.\n\nWhat the Experts Say About Ethereum’s Future\n\nSource: Business Today\n\nMany experts believe that Ethereum’s future is bright, despite its current challenges.\n\nThe network’s transition to PoS will improve its scalability and energy efficiency.\n\nAdditionally, Ethereum’s role as a platform for dapps and decentralized finance (DeFi) has attracted significant investment and development. Some experts predict that Ethereum’s market capitalization could exceed that of Bitcoin in the future.\n\nThe Relationship Between Bitcoin and Ethereum\n\nBitcoin and Ethereum are the two largest cryptocurrencies by market capitalization. While Bitcoin is primarily used as a store of value and a medium of exchange, Ethereum’s platform enables the creation of decentralized applications and smart contracts.\n\nEthereum’s supporters argue that its versatility and potential for innovation make it a more valuable asset than Bitcoin.\n\nHowever, Bitcoin’s first-mover advantage and wider adoption have contributed to its dominance in the cryptocurrency market.\n\nEthereum vs. Competitors: Where Does Ethereum Stand?\n\nEthereum faces competition from other blockchain platforms, including Binance Smart Chain, Polkadot, and Cardano.\n\nWhile these platforms offer similar functionality to Ethereum, they have different approaches to scalability and consensus.\n\nBinance Smart Chain, for example, uses a delegated proof of stake (DPoS) consensus mechanism, while Cardano uses a proof of stake (PoS) mechanism. Ethereum’s supporters argue that its established network effect and development community give it an advantage over its competitors.\n\nEthereum’s Potential for long-term growth\n\nDespite its current challenges, Ethereum’s potential for long-term growth remains strong. The network’s transition to PoS is expected to improve its energy efficiency and scalability, making it more accessible to small investors and dapp developers.\n\nAdditionally, Ethereum’s role as a platform for DeFi and NFTs (non-fungible tokens) has attracted significant investment and development. Some experts predict that Ethereum’s market capitalization could exceed that of Bitcoin in the future.\n\nWill Ethereum recover in 2023? Examining the Possibilities\n\nPredicting the future of any cryptocurrency is challenging, and Ethereum is no exception.\n\nHowever, many experts believe that Ethereum’s transition to PoS and the continued development of the network’s infrastructure could lead to a significant recovery in the coming years.\n\nAdditionally, the growing adoption of DeFi and NFTs could drive demand for Ethereum and its associated tokens. While there are no guarantees in the cryptocurrency market, Ethereum’s potential for growth remains strong.\n\nThe Role of Ethereum in the Crypto Market\n\nEthereum is pivotal in the cryptocurrency market, serving as a platform for decentralized applications and smart contracts. The network’s versatility and potential for innovation have attracted significant investment and development, making it a valuable asset for investors.\n\nAdditionally, Ethereum’s transition to PoS and its role in DeFi and NFTs could drive demand for the network’s associated tokens, further increasing their value.\n\nConclusion: Is Ethereum Dead?\n\nIn conclusion, are Ethereum and Bitcoin dead? Not really.\n\nWhile Ethereum faces challenges, its potential for long-term growth remains strong. The network’s transition to PoS and its role in developing DeFi and NFTs could significantly increase demand for Ethereum and its associated tokens.\n\nWhile there are no guarantees in the cryptocurrency market, Ethereum’s established network effect and development community give it an advantage over its competitors.\n\nAs such, ETH’s future remains bright despite the rumors of Ethereum being dead."
    }
]