[
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tZm91bmRlci03MDAwMC1ldGgtc2FsZS_SAUpodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2V0aGVyZXVtL2V0aGVyZXVtLWZvdW5kZXItNzAwMDAtZXRoLXNhbGUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Nov 2023 08:00:00 GMT",
        "title": "Did Ethereum Founder Vitalik Buterin Short Ethereum? Unraveling A 70,000 ETH Sale - NewsBTC",
        "content": "A video has surfaced on social media where Ethereum founder Vitalik Buterin revealed he sold 70,000 ETH tokens during its price all-time high.\n\nButerin Acknowledges Shorting Ethereum\n\nCrypto community member, MetaMan X, published a video post on X (formerly Twitter), disclosing a conversation where Ethereum Founder, Vitalik Buterin admitted that he had sold about 70,000 ETH tokens, essentially shorting the cryptocurrency during a major all-time high.\n\nIn the podcast with American hedge fund director, Eric Ross Weinstein, Buterin spoke on the price of Ethereum and Bitcoin in 2017. During Ethereum’s previous all-time high in 2017, when the price of ETH rose as high as $1,600 and Bitcoin’s price was up $20,000, Buterin voiced doubts about whether the significant price surge truly aligned with the crypto market’s modest achievements over the years.\n\n“The crypto space has reached half a trillion dollars, does it deserve it?” Buterin stated.\n\nWhen asked if he had shorted Ethereum during the all-time high, Buterin stated that he had convinced the Ethereum Foundation to sell a considerable amount of ETH tokens, and the result of the decision made a huge impact on the cryptocurrency later.\n\n“I did get the Ethereum Foundation to sell 70,000 ETH like basically at the top, and that’s doubled our runway now, so it was one good decision that had a lot of impact,” Buterin said.\n\nETH price at $1,886 | Source: ETHUSD on Tradingview.com\n\nCommunity Worries Over Buterin’s ETH Sell-Offs\n\nMany crypto community members have raised concerns about the multiple ETH transactions said to be conducted by Ethereum’s founder. Recently, Buterin was spotted making a transfer of 100 ETH, worth about $181,000 to Coinbase, one of the world’s largest crypto exchanges.\n\nThe motive behind the transaction has sparked curiosity among Ethereum investors and the crypto community. Earlier in August, Buterin was also reported moving 600 ETH worth $1 million to Coinbase.\n\nHowever, the Ethereum Founder had publicly clarified in October that he had not sold any ETH tokens for personal gain since 2018. He also stated that most ETH transactions were not him selling, but rather the recipients of his charitable donations selling the ETH tokens.\n\nThe founder has also been caught in controversy over the weekend when Ethereum whistleblower Steven Nerayoff alleged that Buterin was involved in some sort of fraud involving ETH.\n\nNerayoff says Ethereum is linked to corrupt SEC officials to carry out this fraud which he says is on a larger scale than what happened with FTX. For reference, FTX founder Sam Bankman-Fried has been found guilty of fraud charges after the exchange filed for bankruptcy in 2022 with a $9 billion hold in its balance sheet.\n\nFeatured image from Crypto News, chart from Tradingview.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzExLzA2L3doeS1ldGhlcmV1bS1kb2dlY29pbi1hbmQtc2hpYmEtaW51LWp1bXBlZC10b2RheS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Nov 2023 08:00:00 GMT",
        "title": "Why Ethereum, Dogecoin, and Shiba Inu Jumped Today - The Motley Fool",
        "content": "Cryptocurrencies had a great weekend and are off on the right foot on Monday as well. Economic news last week gave investors reason to move further out on the risk curve, and that meant in part bidding up the value of cryptocurrencies.\n\nThree of the biggest movers were Ethereum (ETH 2.02%), Dogecoin (DOGE 0.50%), and Shiba Inu (SHIB 2.63%). Ethereum rose as much as 5.4% between Friday's close and noon ET on Monday and is now up 4.8% over that time. Dogecoin had a more pronounced move, climbing 10.2% and currently trading 9.1% higher. Shiba Inu is at its high point, up 7.1%.\n\nEconomic data driving markets\n\nThe economic news last week helped push markets, including cryptocurrencies, higher to end the week. Investors saw the Federal Reserve's decision to pause rate hikes as a positive and there was a lot of speculation that rates would be kept flat through the end of the year.\n\nOn top of that, a weaker-than-expected jobs report was seen as a positive for markets. As the thinking goes, if job growth is slowing, the economy may not be overheating -- which means the Federal Reserve will stop raising rates to slow the economy.\n\nIt may seem counterintuitive, but lower interest rates are currently seen as very bullish for riskier assets like stocks and cryptocurrencies. And short term, that's driving values higher.\n\nETF speculation continues\n\nTrading momentum continues to be strong on speculation that more crypto ETFs will be approved. We know the SEC is considering multiple Bitcoin ETFs, and that could pave the way for both more crypto ETFs and more funds flowing into the industry more broadly.\n\nBlackRock is one of the leading institutions applying for a spot ETF. The company controls $9 trillion in assets under management, so it could lead to a big inflow of funds to the crypto industry. That's the speculation.\n\nMany institutions have shied away from crypto because of the legal grey area it operates in, especially in the U.S. So, approval by the SEC would be generally bullish for crypto broadly at a time when many countries are writing specific rules on how cryptocurrencies can be traded and how blockchain companies can operate.\n\nWhile the market is speculating that a Bitcoin ETF would eventually be bullish for tokens like Ethereum, Dogecoin, and Shiba Inu, it's not clear if they would eventually get spot ETFs as well.\n\nSpeculation rules the day\n\nThe reality is that everything I discussed above is speculation about the value of cryptocurrencies. There's no increased utility or ability to pay for goods using the blockchain. Investors are simply bidding up digital assets because of what the Federal Reserve did and what they think the SEC might do.\n\nIf any of this speculation ends up being false, it's possible that crypto values could crash again. I would like to see more real world utility being built into the blockchain and tokens like Dogecoin and Shiba Inu find real use cases. Until they do, this is just a speculative asset.\n\nEthereum still has the potential to be a valuable blockchain, but it also struggles with high costs and slow transactions. Upgrades could change that, but that will take time. Investors seem to be glossing over that utility need today."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaW5nLXZlbnR1cmVzLXByZXNlbnRzLWV0aGVyZXVtLTIwMzAtMTQwMDAwMzk3Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Nov 2023 08:00:00 GMT",
        "title": "Bing Ventures Presents Ethereum 2030, Devconnect's Premier Event - Yahoo Finance",
        "content": "Singapore --News Direct-- Bing Ventures Limited\n\nBing Ventures, a Singapore-based pioneering venture capital firm backing early projects in Web3 and Blockchain, is joining hands with leading crypto exchange BingX to present Ethereum 2030: Unraveling Tomorrow’s Innovations, a premier event during Devconnect 2023 on Wednesday, November 15, 2023, at 2:00 pm GMT+3 in Istanbul.\n\nEthereum 2030 will bring together industry heavyweights, visionaries, and trendsetters for a half-day of engaging keynote speeches, in-depth panel discussions, valuable networking opportunities, and audience engagement – all focused on inspiring and nurturing entrepreneurs for a new era of innovation.\n\nThe event will be held at Sofitel Istanbul Taksim, which sits in the heart of the city, with unique views of Taksim Square and the mesmerizing Bosphorus and has the capacity to welcome up to 1,000 attendees.\n\nThe agenda covers various topics, including decentralized finance, Ethereum scalability, Web3 security, and the crypto landscape in Turkey.\n\nEthereum 2030, a Devconnect 2023 event\n\nFeatured speakers include:\n\nYajin (Andy) Zhou, CEO of Blocksec\n\nAzeem Khan, Head of Impact at Gitcoin\n\nJack He, Co-founder at Aspecta\n\nBertuğ Oymak, Co-Founder and CEO of Utilify\n\nDougie DeLuca, Investor at Figment Capital\n\nFatih Taşdemir, Co-Founder of Koin Bülteni\n\nVolkan KORKMAZ, CEO and Co-Founder at Altcointurk\n\nLuca (Moss) Mossini, BD at Avantgarde & Enzyme Finance\n\nSeraphim Czecker, Head of Taking Risk\n\nVaruni Trivedi, Editor in Chief at Voice of Crypto\n\nAnıl Öz, Chief Technology Officer at DATS Project\n\nArif Kalem, Brand Ambassador of Turkey at BingX\n\nÖzge ERDEMİR, Web3 Advisor, Business Developer\n\nSima Baktas, Web3 Attorney at GlobalB Law / Co-Founder of CryptoFemale\n\nDaria Krasnova, Managing Editor at BeInCrypto\n\nWayne Wu, Partner of Bing Ventures highlighted the purpose of the conference, saying:\n\n“As the largest and most established decentralized programmable blockchain in the world, Ethereum has been at the forefront of ground-breaking trends. We’re thrilled to convene a diverse gathering of international and local industry participants to share knowledge, exchange ideas, and inspire one another to push the boundaries of Ethereum.”\n\nStory continues\n\nThe event is supported by event partners including Bankless Ventures, Figment Capital, Gitcoin, OneKey, Cedro Finance, Aspecta, Alchemy Pay, CryptoFemale, and Altcointurk, as well as media partners including Cointelegraph, BeinCrypto, Voice of Crypto, Bitcoin Insider, Unlock Blockchain, PANews, Coinpedia, Koinbülteni, and Muhabbit.\n\nTo learn more and register for the free event, please visit: https://Ethereum2030.eventbrite.sg\n\nAbout Bing Ventures\n\nBing Ventures is a pioneering venture capital firm that backs startups and entrepreneurs driving the next wave of Web3 and blockchain innovations. Its team of crypto veterans and natives collectively brings decades of experience in investing in, incubating, developing, and marketing Web 3.0 projects. With a sector-agnostic, value-investing approach, it now has a portfolio spanning infrastructure, DeFi, GameFi, DAOs, Web3, and more.\n\nContact Details\n\nBing Ventures\n\nJenny Liu\n\n+86 159 2140 1005\n\njenny@bing-ventures.com\n\nCompany Website\n\nhttps://www.bing-ventures.com/\n\nView source version on newsdirect.com: https://newsdirect.com/news/bing-ventures-presents-ethereum-2030-devconnects-premier-event-459531817"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy93aHktZXRoZXJldW0tcHJpY2UtaXMtdW5kZXJwZXJmb3JtaW5nLWFsdGNvaW5z0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Nov 2023 08:00:00 GMT",
        "title": "3 reasons why Ethereum price is underperforming altcoins - Cointelegraph",
        "content": "The price of Ether (ETH) surged by 6.2% from Nov. 3 to Nov. 5, but the altcoin is facing difficulty breaking the $1,900 resistance. Despite the current bullish trend, Ether’s 17% return over the last 30 days falls short of Bitcoin’s (BTC) impressive 27% gain during the same period.\n\nRegulatory hurdles and ecosystem centralization critiques linger\n\nAnalysts attribute some of Ether’s underperformance to uncertainty surrounding Consensys, a key player in the Ethereum ecosystem. Former employees have filed a lawsuit against the company and its co-founder Joseph Lubin. Over two dozen shareholders of the Swiss holding company, Consensys AG, claim that Lubin, who is also a co-founder of Ethereum, violated a “no-dilution promise” made in 2015.\n\nConsensys is responsible for developing and hosting infrastructure projects crucial to the Ethereum network. It was founded in October 2014, about nine months before the Ethereum blockchain launched in mid-2015. Furthermore, the High Court of Zug in Switzerland ruled in favor of the plaintiffs, exacerbating the current uncertainty.\n\nRegulatory challenges have hampered the growth of the Ethereum ecosystem. The latest concern centers around PayPal’s U.S. dollar-pegged stablecoin, PYUSD, which operates on the Ethereum network. This token is designed for digital payments and Web3 applications. On Nov. 2, PayPal disclosed a subpoena it received from the United States Securities and Exchange Commission.\n\nIn addition to regulatory pressures, there has been notable criticism of the decentralization of financial applications within the Ethereum network. Chainlink, a preferred solution for oracle services, quietly reduced the number of participants in its multisignature wallet from four out of nine to four out of eight. Analysts have highlighted the lack of governance by regular users as a significant issue.\n\nEther’s underperformance to altcoins is evidence of other issues\n\nSeveral major altcoins — including Solana’s SOL (SOL), XRP (XRP) and Cardano’s ADA (ADA) — have outperformed Ether, with returns of 75.5%, 37% and 35% in the last 30 days, respectively. This discrepancy suggests that the factors holding back ETH are not solely related to regulatory pressure or reduced demand for the decentralized finance and nonfungible token markets.\n\nOne pressing issue for the Ethereum network is the high gas fees associated with transactions, including those executed by smart contracts. The latest seven-day average transaction fee was $4.90, negatively impacting the usage of decentralized applications (DApps).\n\nMoreover, the total deposits on the Ethereum network, measured in Ether, have dropped to their lowest levels since August 2020. It’s essential to note that this analysis does not consider the effects of native Ethereum staking.\n\nEthereum network applications' total deposits in ETH. Source: DefiLlama\n\nAccording to DefiLlama data, Ethereum DApps had a total value locked (TVL) of 12.7 million ETH on Nov. 5, down 4% from the 13.2 million ETH two months earlier. In comparison, the TVL on the Tron network increased by 13% during the same period, while Arbitrum deposits remained at 1 million ETH. Data on DApp activity on the Ethereum network supports the notion of reduced activity.\n\nEthereum network top DApps, 30-day active addresses. Source: DappRadar\n\nEven excluding the significant 60% decline in the Uniswap NFT Aggregator, the average number of active addresses across the top Ethereum network DApps decreased by 3% compared with the previous month. In contrast, Solana’s top applications saw an average 18% increase in active users during the same period, according to DappRadar data.\n\nRelated: Aave pauses several markets after reports of feature issue\n\nFinally, on-chain activity indicates increased user deposits of ETH at exchanges. While this data doesn’t necessarily signal short-term selling, the mere availability of coins is typically viewed as a precautionary measure by analysts.\n\nAverage 7-day daily ETH deposits at exchanges, ETH thousands. Source: Coin Metrics\n\nThe present daily ETH deposit average of 255,614 represents a 30% increase from two weeks earlier, indicating that holders are more inclined to sell as Ether’s price approaches $1,900.\n\nThe data suggests that reduced TVL, declining DApps activity and a higher rate of ETH exchange deposits are negatively impacting the likelihood of Ether breaking the $1,900 resistance. The price level could be more challenging than initially expected, and for now, Ether bears can take a breath.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9ldGhlcmV1bS1jaGluYS1jb250cm9sLWNlbnRyYWxpemF0aW9uLWNvbmNlcm5zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Chinese Control: More Fuel for ETH Centralization Concerns - CCN.com",
        "content": "Key Takeaways\n\nEthereum is currently the second most popular blockchain.\n\nIts decentralization has been a persistent concern since it became Proof-of-stake.\n\nNow, a new post on X has raised new concerns about links to China.\n\nA recent X post from cybersleuth TruthLabs sparked fresh concerns around the level of Chinese influence and control in the Ethereum ecosystem. The investigator highlighted the deep involvement of entities affiliated to the Chinese Communist Party (CCP) in Ethereum’s genesis, mining network, and protocol development.\n\nWith Ethereum having transitioned to a proof-of-stake consensus model, the spotlight is back on the token distribution. The investigator argues that the outsized control of tokens by Chinese entities poses a severe threat to Ethereum’s decentralization credentials. Let’s analyze the cybersleuth’s claims to understand the implications for Ethereum.\n\nEthereum’s China Links\n\nTruthLabs points out that Chinese conglomerate Wanxiang group was an early backer of Ethereum. The group purchased $500,000 worth of ETH from Vitalik Buterin in 2015 and helped him set up the network’s original wallets.\n\nThat donation was later converted to 416,000 ETH tokens. Since then, there has never been any explanation of what Wanxiang received in return for this generous support.\n\nEthereum's hidden Centralization problem: The Chinese Communist Party. The same party using blockchain to track and control everything, Implementing Social Credit Scores, CBDC's, and a number of other surveillance protocols. The CCP, thru Wanxiang, and a number of other CCP… https://t.co/uYxIqUY6n5 — TruthLabs 🫡 (@BoringSleuth) November 5, 2023\n\n“Vitalik was out of cash, and he found it by selling ETH’s decentralized future to the CCP,” said TruthLabs.\n\nWanxiang Group was founded in 1969 by Lu Guanqiu as an agricultural machinery company in China. It has grown into one of China’s largest non-state-owned companies with over $30 billion in revenue.\n\nWanxiang Raising Concerns\n\nWanxiang entered the US market in 1994 and now has over 5,000 employees across the country. More recently, Wanxiang has shown strong interest in blockchain and crypto, establishing Wanxiang Blockchain Labs in 2017.\n\nIts deep ties with the CCP raise concerns that the Chinese government may be covertly running Ethereum nodes despite the network’s pseudonymous structure. Beyond holding large chunks of ETH, Chinese mining entities are also allegedly controlling over 80% of Ethereum’s mining power.\n\nA complete guess, 66.6%. I found 12 Genesis Block Wallets today, alone where they ended up with the majority of the ETH from. Its so hard to know. They were invested in over 500 projects by EOY 2021, and in many cases got the pre-ICO tokens prior to both ETH/altcoin price waves. — TruthLabs 🫡 (@BoringSleuth) June 28, 2023\n\nWhile the shift to proof-of-stake limits the influence miners can exert, critics argue that the excessive ETH hoarded by Chinese players still poses a threat. According to TruthLabs, entities linked to the CCP may hold up to 66% of all ETH in circulation. Although, the account has qualified that statement by saying it is a “complete guess.”\n\nIf true, this enormous, opaque concentration of ETH in wallets associated with the Chinese regime increases the risk of a centralized attack on the network. It also undermines Ethereum’s credibility as a decentralized ecosystem.\n\nAs TruthLabs has pointed out on multiple occasions, Ethereum’s China links are not breaking news. On top of early Chinese investment, Buterin also appeared preoccupied with learning Chinese as early as January 2014, according to Laura Shin’s book The Cryptopians—the period shortly before Chinese backers came on board.\n\nFurthermore, Buterin became the chief scientist of Wanxiang Blockchain Labs, a subsidiary, in the latter half of 2015. A 2016 Facebook post identified Buterin as a co-founder of WBL, alongside Xiao and Bo Shen, co-founders of the Bitshares decentralized exchange.\n\nTransparency Needed To Avoid Centralization Risks\n\nEthereum has firmly established itself as the leading smart contract platform, with an impressive array of DeFi and NFT projects built on it. However, for understandable reasons, lingering doubts remain around just how decentralized its network really is.\n\nThe concentration of nodes is an issue, as Buterin himself acknowledges. Transparency around the top ETH wallets is even more critical in light of the transition to proof-of-stake. A few unknown whales potentially hold enough ETH to sway votes or even attack the network.\n\nA quick 🧵showing that Wanxiang, Chinese auto and early Ethereum Investor funded and setup Vitalik Buterins official wallets. 1/6https://t.co/4uMLLnzguq pic.twitter.com/Ec1cjLOLz2 — TruthLabs 🫡 (@BoringSleuth) January 29, 2023\n\nWhile Ethereum downplays its ties to China today, evidence shows deep involvement of Chinese entities, including state-linked ones, during its early days.\n\nHowever, greater transparency on who the major ETH holders are could go a long way in reassuring users. Any blockchain touting decentralization credentials needs to identify and mitigate centralization risks proactively. For Ethereum, providing clarity on its relationship with Chinese entities is an important first step."
    }
]