[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jYXNhLWxhdW5jaGVzLW11bHRpLXNpZ25hdHVyZS1ldGhlcmV1bS1zZWxmLWN1c3RvZHktdmF1bHTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Jun 2023 07:00:00 GMT",
        "title": "Casa launches multisignature Ethereum self-custody vault - Cointelegraph",
        "content": "Cryptocurrency self-custody platform Casa has rolled out support for Ether (ETH) storage, touting its support for multisignature Bitcoin (BTC) and ETH self-storage as a first in the industry.\n\nSince its inception in 2016, Casa has promoted multisignature self-custody in the crypto industry. Its flagship Bitcoin vault allows users to store the cryptocurrency using up to five keys for more distributed security.\n\nCasa’s service originally catered to Bitcoin “whales” willing to spend $10,000 a year on custody before opening its service to a broader base of users. The company has now added an Ether vault to its platform, with ETH holders also able to use up to five keys to secure their holdings.\n\nAccording to Casa CEO Nick Neuman, with Bitcoin and Ethereum operating as entirely different protocols, the industry had not yet built a security solution that accommodates both on the same platform, aside from various hardware wallet models.\n\nThe firm is also engaging with users over the potential of adding self-custody support for various ETH-related assets, including nonfungible tokens, stablecoins and ERC-20 tokens.\n\nAs Cointelegraph previously reported, Casa co-founder and chief technical officer Jameson Lopp highlighted increasing calls for a multisignature ETH self-custody from its users and the wider cryptocurrency community.\n\nCasa announced its intent to launch an ETH storage solution amid several high-profile collapses of custodians like FTX, as many users not only lost access to ETH, but also to their Ethereum-based stablecoins and other ERC tokens.\n\nRelated: Ledger CEO says crypto key recovery service makes self-custody easier\n\nHackers also wrought havoc within the Web3 space in 2022, with billions of dollars stolen through decentralized finance bridge hacks and smart contract exploits. It’s a point Neuman highlighted when Casa announced its plans for ETH storage on its platform, with many hacks across the “Web3/crypto space due to poor private key management.”\n\nIn an interview with Cointelegraph journalist Joe Hall, cypherpunk Jameson Lopp stressed the importance of making self-custody solutions more accessible and easier to give users complete control of their assets and peace of mind managing the associated responsibilities.\n\nIndustry experts have also suggested that its difficult to estimate the amount of BTC currently held in self-custody wallets.\n\nMagazine: Ordinals turned Bitcoin into a worse version of Ethereum: Can we fix it?"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZmluYm9sZC5jb20vZXRoZXJldW0tcmFpbmJvdy1jaGFydC1zZXRzLWV0aC1wcmljZS1mb3ItamFuLTEtMjAyNC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Rainbow chart sets ETH price for Jan 1, 2024 - Finbold - Finance in Bold",
        "content": "Although Ethereum (ETH) has been struggling to regain the psychological threshold of $2,000 despite the recent positive momentum on the wider cryptocurrency market, its outlook might not look as bearish by the year’s turn if BlockchainCenter’s rainbow price chart for Ethereum is any indicator.\n\nSpecifically, some crypto traders and investors use Ethereum’s rainbow chart to observe the historical movements of the second-largest cryptocurrency by market capitalization in relation to various moving averages (MAs) and find patterns that could help them make better investment decisions.\n\nAs it happens, this chart suggests that Ethereum is currently still in the ‘Fire Sale’ phase, indicated by the color purple, and ranges between $0 and $2,593, below the ‘Undervalued’ blue zone between $2,593 and $3,668, as per data seen by Finbold on June 23.\n\nEthereum rainbow price chart. Source: BlockchainCenter\n\nProjection for January 1, 2024\n\nSpecifically, Ethereum has been stuck in the ‘Fire Sale’ area since early October 2022, which, judging by the previous behavior, it might get out of in a matter of weeks, as the same had happened in July 20202, when ETH moved into the ‘Undervalued’ zone after a period of eight months in the ‘Fire Sale.’\n\nFurther crunching the numbers, it took Ethereum 10 months to peak at the ‘But have we *earned* it?’ level at $4,336. If the same trend occurs this time around, it would mean that the crypto asset would end up in the same zone – currently between $16,353 – $23,742, by April 2024.\n\nIn other words, seven months from now, around January 1, 2024, Ethereum could be changing hands in the ‘Still cheap’ price area on the rainbow chart, which currently stands between $5,290 and $7,705, taking into consideration the exact same pattern.\n\nBefore that action, Ethereum was in the ‘Fire Sale’ area only one time – in October 2015 – soaring to the ‘Go back to BTC?’ price level four months later, followed by a subsequent drop to the ‘Undervalued’ zone in January 2017, where it stuck around very shortly until moving up again and beyond the ‘Maximum Bubble Territory.’\n\nShould this pattern repeat itself instead, it would mean that Ethereum could skyrocket to the ‘Go back to BTC?’ area in October 2023, at a price between $23,742 and $34,283, before dropping to the ‘Undervalued’ zone at $2,593 and $3,668 once again in January 2024.\n\nAlternatively, another Ethereum Rainbow Chart tool developed by CoinCodex estimates that under the same scenario, the asset’s price would hover around $778 per token if ETH remained inside the ‘Undervalued’ (or ‘BUY!’) zone in January 2024.\n\nEthereum rainbow price chart. Source: CoinCodex.com\n\nEthereum price analysis\n\nMeanwhile, Ethereum was at press time changing hands at the price of $1,872.40, recording a decline of 1.31% on the day but still an increase of 12.48% across the previous week and a 3.21% gain on its monthly chart, as per the latest data.\n\nEthereum 30-day price chart. Source: Finbold\n\nAll things considered, whether Ethereum moves in either of the two rainbow chart patterns will depend on further developments surrounding the Ethereum network, as well as the overall sentiment on the general crypto and macroeconomic landscape.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiM2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V0aGVyZXVtLXNwb3QtZXRmLWNvbWluZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin ETFs are all the rage — why not Ethereum? - Blockworks",
        "content": "As optimism grows regarding the potential approval of a bitcoin ETF in the United States, industry watchers suggest that fund issuers may soon apply to launch products holding crypto’s second-largest asset.\n\nYet the fate of such yet-to-be-filed ether funds would likely hinge on how the SEC treats the latest wave of filings from spot bitcoin ETF hopefuls.\n\nThe recent effort by asset management titan BlackRock to launch an ETF that would hold bitcoin directly has reinvigorated a decade-long attempt by a range of firms to get such an offering past the SEC.\n\nThe $9 trillion asset manager’s filing was followed by renewed attempts by Bitwise, WisdomTree, Invesco and Valkyrie to launch similar products.\n\nThe latest rush of spot bitcoin ETF proposals indicates prospective issuers believe “now is the time,” according to Neena Mishra, director of ETF research at Zacks Investment Research.\n\n“I would not be surprised to see an application to launch a spot ether ETF in the coming weeks,” she told Blockworks. “If one issuer starts the process, others would quickly join the race, not wanting to be left behind.”\n\nBut Townsend Lansing, head of product at crypto asset manager CoinShares, said ether ETF filings likely don’t make much sense right now — beyond being a publicity stunt.\n\n“The SEC would react the same way it has reacted to all the BTC filings,” he said. “It would analyze the filing, seek public comments, look at the underlying market and presumably reject it for a failure to evidence a proper surveillance-sharing agreement.”\n\nRead more: How ‘surveillance-sharing’ is designed to deter bitcoin ETF manipulation\n\nBut a spot bitcoin ETF approval would further add interest from fund issuers to try ether (ETH) next, some said.\n\n“It would indicate that the new proposed surveillance arrangement is enough to address their concerns and the same would apply to the second largest cryptocurrency,” Mishra said.\n\nLansing agreed, in the case of the SEC greenlighting a spot bitcoin ETF, that fund issuers looking to launch an ether ETF next is “a reasonable assumption.”\n\nBut the potential for such a product to be approved would depend on the SEC’s reasoning for permitting a spot bitcoin ETF, “and the extent to which the ether market exhibits similar characteristics,” he added.\n\n“Despite the recent press and surge of filings, we continue to believe approval of any spot crypto ETF remains a difficult proposition,” Lansing said.\n\nAndra Nicolau, head of business development and strategy at Origin Protocol, believes that it might still be premature to expect a spot ether ETF based on the demand for such a product.\n\nShe noted that institutional investors who hold bitcoin understand the asset’s scarcity and the need for it as a store of value amid inflation.\n\n“Ethereum is better understood by those who understand technology and rebuilding the internet from the ground up,” Nicolau said. “That doesn’t mean that ETH is not ETF worthy. It just means it may take a little while longer.”\n\nAn ether futures ETF first?\n\nThe SEC greenlit bitcoin futures ETFs in 2021 after Chair Gary Gensler said earlier that year the regulator would prefer reviewing filings limited to such contracts traded on the Chicago Mercantile Exchange (CME).\n\nBitcoin futures are cash-settled and are regulated by the CFTC — attributes some have said offer the SEC an additional layer of comfort.\n\nGrayscale Investments and Bitwise were among several firms in May to file for ETFs that would hold ether futures contracts. But these firms quickly halted plans to do so.\n\nTwo sources directly familiar with the matter told Blockworks those moves came after the SEC asked the firms to pull the plans — telling them the regulator is not yet ready to approve such products. A spokesperson for the regulator did not return a request for comment at the time.\n\nIndustry participants have labeled concerns around current ether futures liquidity levels, as well as a lack of clarity on whether ether is considered a security or a commodity, as possible rationales.\n\nBut concerns over the liquidity of the ether futures market would not apply to spot ether ETFs, Mishra argued.\n\n“The approval of a spot bitcoin ETF would mean that the SEC’s main concerns regarding fraud and manipulation, which many thought were inconsistent, have been addressed,” she said. “I don’t think there would be any need for the agency to experiment with a futures-based ether ETF first.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy8zLWJyZWFrb3V0LWNyeXB0b3MtY291bGQtMTB4LTEzMzAzMzk2My5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Jun 2023 07:00:00 GMT",
        "title": "3 Breakout Cryptos That Could 10x by 2025 - Yahoo Finance",
        "content": "After sliding for the past two months, the cryptocurrency market has seen a surge this past week and investors are once again on the hunt for cryptos that could 10x. The momentum is certainly there, and the resilience of the crypto market this year has been impressive. Snapping up some breakout cryptos right now can lead to some hefty gains if the trends continue.\n\nRegardless, there are still more long-term positive catalysts at play that can propel the crypto market. The upcoming Bitcoin (BTC-USD) halving and potential rate cuts are principal catalysts to keep in mind. Even if we see a cooldown from here, these three cryptos could 10x in the next few years.\n\nAs a side note, I will be excluding Bitcoin and Ethereum (ETH-USD), as they are two obvious choices.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nTicker Coin Price SOL-USD Solana $16.66 CKB-USD Nervos Network $0.0029 STORJ-USD Storj $0.25\n\nSolana (SOL)\n\nSolana logo on phone screen stock image. Solana price predictions.\n\nSource: sdx15 / Shutterstock.com\n\nSolana (SOL-USD) is the leading “Ethereum killer” and it remains a very solid competitor to other alternative Web 3.0 blockchains. While stability issues have always been my top concern with Solana, their focus on fixing such issues this year makes me believe this is a great contender for cryptos that could 10x by 2025.\n\nSolana has a lot of potential to become a leader in the decentralized finance (DeFi) space, as it offers low fees, scalability, and interoperability with other blockchains. It is capturing a lot of the non-fungible token market share from Ethereum, and once the project figures out its stability issues, I believe more developers are likely to migrate.\n\nStill, Ethereum remains the top dog, and fees are very low. Solana is much more cyclical and volatile and I only expect it to deliver substantial gains when the Ethereum network is congested.\n\nNervos Network (CKB)\n\nAn image of the blockchain, distributing digital crypto from a phone through the web to another tablet\n\nSource: elenabsl/Shutterstock\n\nNervos Network (CKB-USD) is an under-the-radar project with one very bullish catalyst this year. CKB will be undergoing a halving event sometime in November and we could see the price climb significantly from there.\n\nStory continues\n\nDespite the lack of momentum here, I’m optimistic about this project. The multi-layered blockchain network provides a secure, scalable, and interoperable platform for the next generation of decentralized applications.\n\nNervos consists of two layers: the Common Knowledge Base (CKB), which is a public and permissionless proof-of-work blockchain that stores data and assets; and the Application Chain Layer (ACL), which is a set of layer-2 solutions that enable fast and low-cost transactions. Simply put, it can combine the best aspects of both Ethereum and Bitcoin.\n\nThat said, I believe a lot of patience is needed here. That primarily concerns the lack of marketing. But as blockchain development continues to advance, the flexibility and interoperability offered by this project will make it very appealing.\n\nNervos Network is currently trading with a market cap of over $120 million and that leaves a lot of room for upside.\n\nStorj (STORJ)\n\nAn image of a hand holding a cell phone with several visualizations of digital building blocks floating above it. representing sto platforms\n\nSource: Marko Aliaksandr/ShutterStock.com\n\nStorj (STORJ-USD) is similar to Filecoin (FIL-USD), as it buys data storage from individuals worldwide with its STORJ token and then resells it in bulk to others. This project is overshadowed by the Filecoin project, and especially after the launch of FWS, many wonder why they should buy STORJ.\n\nThe answer here is tokenomics. Unlike Filecoin’s inflationary model (94% supply inflation), Storj does a great job of providing long-term value. The supply inflation here is at just 1% and your holdings won’t be eroded over time while enjoying the tailwinds from the decentralized cloud storage market.\n\nOf course, blockchain cloud storage has a long way to go. But both Filecoin and Storj have better pricing than their traditional counterparts and their customers enjoy the perks of no censorship, decentralization, and better stability.\n\nOn the date of publication, Omor Ibne Ehsan did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOmor Ibne Ehsan is a writer at InvestorPlace. He is a self-taught investor with a focus on growth and cyclical stocks that have strong fundamentals and long-term potential. He also has an interest in high-risk, high-reward investments such as cryptocurrencies and penny stocks. You can follow him on LinkedIn.\n\nMore From InvestorPlace\n\nThe post 3 Breakout Cryptos That Could 10x by 2025 appeared first on InvestorPlace."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy8zLWJyZWFrb3V0LWNyeXB0b3MtY291bGQtMTB4LTEzMzAzMzk2My5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Jun 2023 07:00:00 GMT",
        "title": "3 Breakout Cryptos That Could 10x by 2025 - Yahoo Finance",
        "content": "After sliding for the past two months, the cryptocurrency market has seen a surge this past week and investors are once again on the hunt for cryptos that could 10x. The momentum is certainly there, and the resilience of the crypto market this year has been impressive. Snapping up some breakout cryptos right now can lead to some hefty gains if the trends continue.\n\nRegardless, there are still more long-term positive catalysts at play that can propel the crypto market. The upcoming Bitcoin (BTC-USD) halving and potential rate cuts are principal catalysts to keep in mind. Even if we see a cooldown from here, these three cryptos could 10x in the next few years.\n\nAs a side note, I will be excluding Bitcoin and Ethereum (ETH-USD), as they are two obvious choices.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nTicker Coin Price SOL-USD Solana $16.66 CKB-USD Nervos Network $0.0029 STORJ-USD Storj $0.25\n\nSolana (SOL)\n\nSolana logo on phone screen stock image. Solana price predictions.\n\nSource: sdx15 / Shutterstock.com\n\nSolana (SOL-USD) is the leading “Ethereum killer” and it remains a very solid competitor to other alternative Web 3.0 blockchains. While stability issues have always been my top concern with Solana, their focus on fixing such issues this year makes me believe this is a great contender for cryptos that could 10x by 2025.\n\nSolana has a lot of potential to become a leader in the decentralized finance (DeFi) space, as it offers low fees, scalability, and interoperability with other blockchains. It is capturing a lot of the non-fungible token market share from Ethereum, and once the project figures out its stability issues, I believe more developers are likely to migrate.\n\nStill, Ethereum remains the top dog, and fees are very low. Solana is much more cyclical and volatile and I only expect it to deliver substantial gains when the Ethereum network is congested.\n\nNervos Network (CKB)\n\nAn image of the blockchain, distributing digital crypto from a phone through the web to another tablet\n\nSource: elenabsl/Shutterstock\n\nNervos Network (CKB-USD) is an under-the-radar project with one very bullish catalyst this year. CKB will be undergoing a halving event sometime in November and we could see the price climb significantly from there.\n\nStory continues\n\nDespite the lack of momentum here, I’m optimistic about this project. The multi-layered blockchain network provides a secure, scalable, and interoperable platform for the next generation of decentralized applications.\n\nNervos consists of two layers: the Common Knowledge Base (CKB), which is a public and permissionless proof-of-work blockchain that stores data and assets; and the Application Chain Layer (ACL), which is a set of layer-2 solutions that enable fast and low-cost transactions. Simply put, it can combine the best aspects of both Ethereum and Bitcoin.\n\nThat said, I believe a lot of patience is needed here. That primarily concerns the lack of marketing. But as blockchain development continues to advance, the flexibility and interoperability offered by this project will make it very appealing.\n\nNervos Network is currently trading with a market cap of over $120 million and that leaves a lot of room for upside.\n\nStorj (STORJ)\n\nAn image of a hand holding a cell phone with several visualizations of digital building blocks floating above it. representing sto platforms\n\nSource: Marko Aliaksandr/ShutterStock.com\n\nStorj (STORJ-USD) is similar to Filecoin (FIL-USD), as it buys data storage from individuals worldwide with its STORJ token and then resells it in bulk to others. This project is overshadowed by the Filecoin project, and especially after the launch of FWS, many wonder why they should buy STORJ.\n\nThe answer here is tokenomics. Unlike Filecoin’s inflationary model (94% supply inflation), Storj does a great job of providing long-term value. The supply inflation here is at just 1% and your holdings won’t be eroded over time while enjoying the tailwinds from the decentralized cloud storage market.\n\nOf course, blockchain cloud storage has a long way to go. But both Filecoin and Storj have better pricing than their traditional counterparts and their customers enjoy the perks of no censorship, decentralization, and better stability.\n\nOn the date of publication, Omor Ibne Ehsan did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOmor Ibne Ehsan is a writer at InvestorPlace. He is a self-taught investor with a focus on growth and cyclical stocks that have strong fundamentals and long-term potential. He also has an interest in high-risk, high-reward investments such as cryptocurrencies and penny stocks. You can follow him on LinkedIn.\n\nMore From InvestorPlace\n\nThe post 3 Breakout Cryptos That Could 10x by 2025 appeared first on InvestorPlace."
    }
]