[
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY3J5cHRvLm5ld3MvZXRoZXJldW0tY28tZm91bmRlci1kaWRudC1leHBlY3QtbmZ0cy10by1iZS10aGlzLXN1Y2Nlc3NmdWwv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Feb 2023 08:00:00 GMT",
        "title": "Ethereum co-founder didn't expect NFTs to be this successful - crypto.news",
        "content": "Vitalik Buterin, the co-founder of Ethereum, in a recent podcast, revealed that he didn’t expect non-fungible tokens (NFTs) to be as successful as it is at the moment.\n\nI didn’t expect NFTs to be this successful\n\nButerin, often the face of Ethereum and one of the six co-founders of the smart contracting platform, remains impressed at how the NFT industry has been gaining traction in recent years.\n\nIn his assessment, the co-founder said that among the many ideas he had projected to take root, Ethereum excluded the concept of creating non-fungible assets that can be transferred on-chain, representing value.\n\nHe said:\n\n“NFTs are probably the one thing that I did not predict, by the way. If you look at the list of applications that were in the Ethereum Whitepaper, and you look at the applications that are popular today, the big thing that’s in the second list and not the first is NFTs.”\n\nInstead, Vitalik had foreseen smart contracts shaping finance, resulting in the current spark in decentralized finance, and other fortes.\n\nAt the moment, decentralized finance protocols, including Lido Finance, MakerDAO, and Uniswap, are among the top dApps with billions in total value locked (TVL).\n\nUniswap, for example, has dominated the decentralized swapping of tokens, recently introducing the support of NFTs. During the interview, Vitalik said the launch of Uniswap in late 2018 ushered in the era of DeFi. By early 2020, DeFi TVL rose to above $1b for the first time.\n\nOther noteworthy applications in DeFi include MakerDAO, which was reported to be one of the most active DAOs, together with Optimism DAO. The protocol has impacted how users can lend and borrow digital assets without including the services of a third party.\n\nAs an industry, DeFi protocols control over $48b of different assets in protocols launched in several blockchains, including in Ethereum, the BNB Chain, Cardano, Polygon, and others.\n\nNFTs are core to crypto\n\nAmid the expansion of DeFi, gaming, metaverse, and other applications in Ethereum and smart contracting platforms is the rise of NFTs. NFTs allow users to create unique assets which, like fungible tokens, can be transferred in public chains. In Ethereum, NFTs mostly comply with the ERC-721 standard. However, depending on what its creators want, it can be designed to adopt other NFT standards, including ERC 1155.\n\nNFTs have found application in various spheres, including DeFi. For instance, Uniswap v3 uses liquidity NFTs, while gaming and metaverse platforms integrate NFTs to reward players.\n\nFollow Us on Google News"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY3J5cHRvLm5ld3MvZXRoZXJldW0tY28tZm91bmRlci1kaWRudC1leHBlY3QtbmZ0cy10by1iZS10aGlzLXN1Y2Nlc3NmdWwv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Feb 2023 08:00:00 GMT",
        "title": "Ethereum co-founder didn't expect NFTs to be this successful - crypto.news",
        "content": "Vitalik Buterin, the co-founder of Ethereum, in a recent podcast, revealed that he didn’t expect non-fungible tokens (NFTs) to be as successful as it is at the moment.\n\nI didn’t expect NFTs to be this successful\n\nButerin, often the face of Ethereum and one of the six co-founders of the smart contracting platform, remains impressed at how the NFT industry has been gaining traction in recent years.\n\nIn his assessment, the co-founder said that among the many ideas he had projected to take root, Ethereum excluded the concept of creating non-fungible assets that can be transferred on-chain, representing value.\n\nHe said:\n\n“NFTs are probably the one thing that I did not predict, by the way. If you look at the list of applications that were in the Ethereum Whitepaper, and you look at the applications that are popular today, the big thing that’s in the second list and not the first is NFTs.”\n\nInstead, Vitalik had foreseen smart contracts shaping finance, resulting in the current spark in decentralized finance, and other fortes.\n\nAt the moment, decentralized finance protocols, including Lido Finance, MakerDAO, and Uniswap, are among the top dApps with billions in total value locked (TVL).\n\nUniswap, for example, has dominated the decentralized swapping of tokens, recently introducing the support of NFTs. During the interview, Vitalik said the launch of Uniswap in late 2018 ushered in the era of DeFi. By early 2020, DeFi TVL rose to above $1b for the first time.\n\nOther noteworthy applications in DeFi include MakerDAO, which was reported to be one of the most active DAOs, together with Optimism DAO. The protocol has impacted how users can lend and borrow digital assets without including the services of a third party.\n\nAs an industry, DeFi protocols control over $48b of different assets in protocols launched in several blockchains, including in Ethereum, the BNB Chain, Cardano, Polygon, and others.\n\nNFTs are core to crypto\n\nAmid the expansion of DeFi, gaming, metaverse, and other applications in Ethereum and smart contracting platforms is the rise of NFTs. NFTs allow users to create unique assets which, like fungible tokens, can be transferred in public chains. In Ethereum, NFTs mostly comply with the ERC-721 standard. However, depending on what its creators want, it can be designed to adopt other NFT standards, including ERC 1155.\n\nNFTs have found application in various spheres, including DeFi. For instance, Uniswap v3 uses liquidity NFTs, while gaming and metaverse platforms integrate NFTs to reward players.\n\nFollow Us on Google News"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vYml0Y29pbmlzdC5jb20vZXRoZXJldW0tYnV0ZXJpbi1kb25hdGVzLXRvLXF1YWtlLXZpY3RpbXMv0gFFaHR0cHM6Ly9iaXRjb2luaXN0LmNvbS9ldGhlcmV1bS1idXRlcmluLWRvbmF0ZXMtdG8tcXVha2UtdmljdGltcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Feb 2023 11:27:44 GMT",
        "title": "Ethereum Co-Founder Vitalik Buterin Donates $150,000 To Victims Of Turkey, Syria Earthquake - Bitcoinist",
        "content": "Vitalik Buterin, co-founder of Ethereum, has shown his kindness and support for individuals affected by the recent earthquake in Turkey and Syria by making a sizeable donation.\n\nAccording to numerous news sources, Buterin gave approximately $150,000 worth of Ether to Ahbap Earthquake Support to assist with the recent natural disaster in the two countries.\n\nEthereum Co-Founder Reaches Out To Help\n\nVitalik transmitted a total of 99 ETH, or approximately $150,000, from his wallet address “vitalik.eth” to a wallet branded “Ahbap Yardm,” according to Etherscan transaction data.\n\nButerin’s generous contribution is sure to have a positive impact on the organization’s efforts to aid victims of the tragedy.\n\nThe contribution also highlights the increasing adoption of cryptocurrencies as a means of charitable assistance.\n\nEthereum co-founder Vitalik Buterin. Image: Bitcoinik\n\nCrypto’s Important Role During A Disaster\n\nNatural calamities make it harder for people to obtain funds for necessities such as medical supplies and food through standard banking services. Cryptocurrencies, such as Ethereum, will make the process of acquiring funds significantly simpler and quicker.\n\nChangpeng Zhao, CEO of Binance, stated in a press statement that the recent earthquakes in Turkey and Syria have had a catastrophic effect on so many individuals and communities.\n\n“We hope that our efforts will bring some relief to those affected. We are also calling on our industry peers to once again come together to offer support in these times of crisis,” Zhao said.\n\nOn Monday, the lives of millions of people in Turkey and Syria were irrevocably altered as a result of two tremors that occurred in quick succession and sent shockwaves across hundreds of miles.\n\nThe magnitudes of the earthquakes were 7.8 and 7.5 on the Richter scale, separated by nine hours, and they were the region’s strongest in nearly a hundred years.\n\nQuake Claims 25,000 Lives\n\nAs of Saturday, the number of deaths in the two countries has topped 25,000, making the earthquakes the worst in the globe in more than a decade.\n\nImage: Rami Al Sayed/AFP Via Getty Images\n\nThis week’s fatalities in Turkey and Syria eclipsed Japan’s 2011 Fukushima disaster, in which an earthquake of magnitude 9.0 caused a tsunami that claimed the lives of more than 18,400 people.\n\n“We are facing one of the biggest catastrophes not only of the history of the Turkish Republic but also of … the world,” President Recep Tayyip Erdogan, president of Turkey, said Tuesday.\n\nIn the aftermath of the earthquake, Chainalysis, a blockchain analytics startup, estimates that more than $5 million in Ethereum and other cryptocurrency donations were sent to Turkey and Syria.\n\nCrypto total market cap at $971 billion on the weekend chart | Chart: TradingView.com\n\nBinance Gives Out $5 Million In Total Donations\n\nElliptic, a competitor of Chainalysis, has verified these computations. Numerous crypto companies have guaranteed over $10 million in crypto tokens, as uncovered by the startups. Binance offered a total of $5 million in donated funds.\n\nButerin gave about $1 billion worth of Ethereum and other cryptocurrencies to various charities in May 2021, including those providing aid to victims of COVID-19 and the Indian earthquake.\n\n-Featured image from Sky News"
    }
]