[
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9wb2x5Z29uLWxhYnMtcGl0Y2hlcy1wbGFuLXRvLXN0cmVhbWxpbmUtY2Vsb3MtbW92ZS10by1ldGhlcmV1bS1sYXllci0yLXVzaW5nLWNkay_SAW5odHRwczovL2NyeXB0b3BvdGF0by5jb20vcG9seWdvbi1sYWJzLXBpdGNoZXMtcGxhbi10by1zdHJlYW1saW5lLWNlbG9zLW1vdmUtdG8tZXRoZXJldW0tbGF5ZXItMi11c2luZy1jZGsvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 24 Sep 2023 07:00:00 GMT",
        "title": "Polygon Labs Pitches Plan to Streamline Celo’s Move to Ethereum Layer 2 Using CDK - CryptoPotato",
        "content": "Polygon Labs has suggested that the Celo blockchain community consider utilizing its Chain Development Kit (CDK) to streamline the intended layer-2 migration on the Ethereum network.\n\nThe proposal comes after cLabs, the primary development team behind Celo, unveiled an alternative strategy in July to transition its layer-1 into an Ethereum-compatible layer-2 solution by utilizing Optimism’s OP Stack. OP Stack is a similar customizable toolkit that leverages Optimism’s “optimistic” technology.\n\nMove to Ethereum Layer-2 Via Polygon CDK\n\nPolygon Labs’ co-founder Sandeep Nailwal presented a proposal to the Celo community this week recommending that the blockchain ecosystem consider implementing Polygon’s Chain Development Kit, which is a codebase enabling developers to build customized layer-2 chains leveraging zero-knowledge (ZK) technology.\n\nThe proposal on the Celo governance forum stated,\n\n“Polygon Labs is excited to welcome Celo home to Ethereum in the chain’s transition from an independent EVM-compatible L1 to an Ethereum L2. As Ethereum devotees obsessed with scaling, we are beyond excited to see Celo expand into an emerging and thriving Ethereum ecosystem and help extend Ethereum blockspace.”\n\nNailwal explained that this shift would enable Celo to fully leverage the benefits of operating as an Ethereum layer-2 solution while preserving the fundamental traits that initially propelled the chain to success.\n\nThe exec further emphasized that the transition represents a significant technical enhancement, “that should come with built-in Ethereum alignment and as-close-as-possible developer experience, without compromising security.”\n\nPolygon CDK\n\nThe Polygon CDK toolkit was released in August, designed to allow developers to build blockchain networks with the help of ZK proofs. This open-source codebase offers developers the ability to interconnect chains through a ZK-based bridge, creating a unified ecosystem referred to as the “Value Layer.”\n\nSubsequently, Cosmos-based layer-1 blockchain, Canto, announced migrating to a zero-knowledge layer-2 on Ethereum via Polygin CDK. The platform explained that this transition is in line with its objectives to build a blockchain dedicated to real-world assets(RWA).\n\nBesides Canto, pther projects such as Astar, Gnosis, and IDEX, have already announced plans to build ZK layer-2 solutions utilizing the toolkit."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2V0aGVyZXVtLXdoYWxlcy1wcmVwYXJlLWFoZWFkLW9mLWZ1dHVyZXMtZXRoZXJldW0tZXRmLWFwcHJvdmFsLW9uLW9jdG9iZXItMi0yMDIzMDkyNDExNDnSAYsBaHR0cHM6Ly93d3cuZnhzdHJlZXQuY29tL2FtcC9jcnlwdG9jdXJyZW5jaWVzL25ld3MvZXRoZXJldW0td2hhbGVzLXByZXBhcmUtYWhlYWQtb2YtZnV0dXJlcy1ldGhlcmV1bS1ldGYtYXBwcm92YWwtb24tb2N0b2Jlci0yLTIwMjMwOTI0MTE0OQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 24 Sep 2023 07:00:00 GMT",
        "title": "Ethereum whales prepare ahead of futures Ethereum ETF approval on October 2 - FXStreet",
        "content": "Share:\n\nEthereum options’ open interest hit an all-time high on CME, suggesting interest from traditional investors.\n\nThis move comes ahead of a potential approval of futures ETH ETF on October 2.\n\nThe whale transaction metric also shows a spike on the recent dip, suggesting buying activity.\n\nSupplementing the bullish nature is the accumulation from holders with 10,000 to 100,000 ETH.\n\nEthereum (ETH) price is likely going to witness a massive spike in volatility soon due to the circumstances surrounding the approval of the token’s futures Exchange-Traded Fund (ETF). According to Twitter users, the ETF is likely going to be approved on October 2. So, a closer look at on-chain metrics reveal that whales and traditional investors are positioning themselves ahead of the potential ETF approval.\n\nRead more: First Ethereum futures ETF expecting approval by October 2\n\nEthereum futures ETF approval and volatility spike\n\nThe chart attached below adds proof that investors positioning themselves ahead of the Ethereum futures ETF approval on October 2 is the open interest of ETH options on the CME exchange. The open interest has hit $352 million, which is and all-time high.\n\nWhile this chart does not provide a directional bias, looking at other on-chain metrics does show signs that these investors are likely expeceting a bullish outcome.\n\nETH CME OI\n\nAlso read: SEC could approve multiple Ether ETF s soon while delaying Bitcoin spot ETF s\n\nSantiment’s Supply Distribution by on balance of addresses shows that Ether whales holding between 100,000 to 1,000,000 ETH has grown from 19.1 million on August 19 to 20.19 million as of September 24. In total, these whales added 1.09 million ETH to their holdings.\n\nThis moves comes after Ethereum (ETH) price dropped nearly 15% between August 15 and 20, suggesting that it was a buy-the-dip accumulation.\n\nETH supply distribution by balance of addresses\n\nFurther supporting that these holders are preparing for an approval of Ether futures ETF is the whale transaction metric. This index tracks transactions worth $100,000 or more and serves as a proxy of investor sentiment. A spike in this on-chain metric after a dip, hints at accumulation and the opposite often indicates that these holders are looking to sell.\n\nOn September 12, when Ethereum (ETH) price dropped to $1,551, this index saw a major uptick, suggesting nothing but accumulation."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZGFpbHljb2luLmNvbS9ldGgtYnVybi1tZWNoYW5pc20tc3RydWdnbGVzLWFtaWQtaW50ZXJlc3QtZ2Fpbi1wcm9qZWN0aW9uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 24 Sep 2023 07:00:00 GMT",
        "title": "ETH Burn Mechanism Struggles Amid Interest Gain Projection - DailyCoin",
        "content": "Cryptocurrency markets have responded cautiously to hints of a Federal Reserve rate hike.\n\nCrypto capitalization has experienced a $30 billion reduction amid uncertain economic signals.\n\nEthereum’s burn mechanism has encountered challenges as new ETH has entered the supply.\n\nIn response to the Federal Reserve’s recent hints at a potential interest rate hike later this year, the digital asset market experienced a tentative sell-off this week. Despite the Fed’s decision to maintain current interest rates on Wednesday, the prospect of an impending hike has cast uncertainty over the market.\n\nCrypto Market Sheds $30B as Fed Proposes Interest Rate Rise\n\nThe central bank’s projections, unveiled alongside their announcement, indicate a median interest rate of 5.6% by the end of this year. This marks an uptick from the current range of 5.25% to 5.5%. The proposed rate increase received support from 12 Federal Reserve officials, while 9 opposed the idea.\n\nAccording to data from CoinMarketCap, the cryptocurrency market witnessed a decline of $30 billion in its overall capitalization. As a result, the combined capitalization now stands at $1.05 trillion, following a 3% retracement. Bitcoin (BTC) and Ethereum (ETH) experienced a 2.5% and 3% drop, respectively, after the news, although they managed to regain roughly 1% since.\n\nETH’s Burning Mechanism Challenged by Increase in Supply\n\nAdding to the situation’s complexity, the close of September will also coincide with the expiration of $3 billion worth of quarterly Bitcoin options and $1.8 billion in contracts linked to ETH.\n\nEthereum’s on-chain activity in September has been the weakest throughout the year. According to Ultra Sound Money, over 13,000 ETH (equivalent to $21 million) has been introduced into Ethereum’s supply since the beginning of the month.\n\nThis suggests that Ethereum’s burn mechanism has failed to counterbalance the influx of new ETH entering the supply as rewards for validators, particularly during this period of reduced activity.\n\nOn the Flipside\n\nWhile the crypto market did see a retracement following the Fed’s announcement, factors beyond the interest rate decision could have influenced their prices.\n\nEthereum’s on-chain activity may have declined in September, but this could be attributed to various factors, including market sentiment and investor behavior, rather than solely the failure of the burn mechanism.\n\nWhy This Matters\n\nThe Federal Reserve’s potential interest rate hike and the resultant market fluctuations underscore the vulnerability of digital assets to macroeconomic shifts. This is a stark reminder of the crypto market’s interconnectedness with traditional financial systems and the need for vigilance among crypto enthusiasts and investors.\n\nTo learn more about the challenges Ethereum faces amidst record-low fees, read here:\n\nETH Price Struggles Continue Despite Record-Low Network Fees\n\n\n\nTo stay updated on the recent mysterious XRP transfers involving millions, click here:\n\nMillions of XRP Moved in Mysterious Internal Transfers"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL2NyeXB0b25ld3MuY29tL25ld3MvZXRoZXJldW0tZXRoLXByaWNlLXByZWRpY3Rpb24td2lsbC1ldGgtYnJlYWstMTgwMC1iYXJyaWVyLXNvb24tYXMtd2FsbC1zdHJlZXQtbWVtZXMtcHJlc2FsZS1jbG9zZXMtdG9tb3Jyb3cuaHRt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 24 Sep 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Prediction: Will ETH Break the $1,800 Barrier Soon as Wall Street Memes Presale Closes ... - Cryptonews",
        "content": "Ethereum (ETH) Price Prediction: Will ETH Break the $1,800 Barrier Soon as Wall Street Memes Presale Closes Tomorrow\n\nAs the cryptocurrency market continues to evolve with new developments, Ethereum (ETH) finds itself at a pivotal juncture.\n\nWith its price hovering just below the significant $1,800 threshold, many traders and analysts are keenly observing its next move.\n\nAdding to the intrigue, the impending closure of the Wall Street Memes presale tomorrow could bring about a fresh wave of interest and activity in the crypto sector.\n\nWill this event serve as a catalyst propelling Ethereum past the coveted $1,800 mark?\n\nLet’s delve into the factors influencing ETH’s price trajectory.\n\nEthereum Price\n\nToday’s Ethereum stands priced at $1,584, experiencing a trading volume of $3.6 billion over the past 24 hours.\n\nSeeing a slight dip, Ethereum has decreased by just under 0.50% within the same timeframe.\n\nCurrently holding its position as the second-ranked cryptocurrency on CoinMarketCap, its market capitalization is assessed at $190 billion.\n\nThere are 120,230,004 ETH coins in circulation, while its maximum supply remains undisclosed.\n\nEthereum Price Prediction\n\nThe trading pattern of ETH/USD has been highly volatile, with resistance encountered at $1,600 and support found around the $1,575 level.\n\nA breakout from this range could trigger further price movements.\n\nIf ETH manages to surpass the $1,600 level, it may face resistance at $1,625, while a more substantial barrier could arise near the $1,660 double-top pattern.\n\nEthereum Price Chart – Source: Tradingview\n\nIn case the price of Ethereum drops below $1,575, it could potentially head towards the $1,535 level.\n\nThe chart shows that the 50-day EMA, RSI, and MACD indicators all suggest a bearish trend.\n\nIt is advisable for investors to keep a close eye on the $1,575 level, as breaking below it could reveal more opportunities for selling.\n\nWall Street Memes Presale Closes Tomorrow\n\nCurrently, many investors are exploring diverse opportunities within the cryptocurrency realm, and Wall Street Memes have caught their eye. The $WSM presale, representing a meme coin, has stirred considerable excitement among the investment community.\n\nAs the crypto world anticipates the next meme coin to debut on Binance, all eyes are now on Wall Street Memes .\n\nTouted as one of the most significant crypto presales of 2023, Wall Street Memes’ presale is drawing to a close in less than 24 hours.\n\nThere is a lot of talk going around about the possibility of Binance, a top trading platform, being included in a list of upcoming exchanges.\n\nAccording to information found on the Wall Street Memes website, the first tier 1 centralized exchange (CEX) listings are set to be announced within the next three days, and it is suspected that at least two of these exchanges will be among the top 10 in the world.\n\nThe initial response to the presale of Wall Street Memes was overwhelmingly positive, with the first day alone seeing a collection that exceeded $300,000. Ultimately, the total collection amount reached $25 million.\n\nCurrently, the WSM tokens in this presale stage are available for purchase at $0.0337.\n\nTaking advantage of this opportunity could open up the possibility of potential growth. Join the Wall Street Memes investment journey and partake in a potentially profitable endeavor.\n\nBuy $WSM Here\n\nDisclaimer: Crypto is a high-risk asset class. This article is provided for informational purposes and does not constitute investment advice. You could lose all of your capital."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiNGh0dHBzOi8vY29pbmdhcGUuY29tL2Jsb2cvaG93LWhpZ2gtd2lsbC1ldGhlcmV1bS1nby_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 24 Sep 2023 07:00:00 GMT",
        "title": "How High Will Ethereum Go? - CoinGape",
        "content": "The biggest cryptocurrency of all time, Bitcoin, gained much traction much after its inception. The reason is simple, anything new with potential finally makes it to the top. Following the trend, Ethereum, a similar type but with a much improved concept, was soon to climb the ladder of fame.\n\nThe evolution of Ethereum also spiked traders’ interests. Over the years, Ethereum has become the second largest cryptocurrency in the world. However, despite the technological spike, the coin couldn’t surpass Bitcoin. Will it ever? How high will Ethereum go? Let’s delve into the topic and understand where this coin is going in the future.\n\nadvertisement\n\nEthereum Price History\n\nLet us take a quick look at Ethereum’s historical price performance before getting into price prediction. The price of Ethereum (ETH) has fluctuated significantly since its launch in 2015. ETH first surpassed the $10 threshold in March 2016, despite experiencing a sizable surge after its launch.\n\nThe price of ETH increased more noticeably in late 2016 and early 2017 as a result of the Ethereum network’s rising popularity, which was largely brought on by the proliferation of initial coin offerings (ICOs). The price of Ethereum skyrocketed past $1,000, peaking at about $1,400 in January 2018.\n\nHowever, this price increase came after a significant decline during the ensuing crypto winter. ETH’s cost plunged to an all-time low of $80 in December 2018. However, with the start of the subsequent bullish market cycle, Ethereum started to climb steadily, occasionally experiencing minor corrections, eventually reaching a new peak of about $2,000 in May 2021.\n\nAs the bull market came to an end in November 2021, the price of ETH hit an all-time high of $4,891.70. Unfortunately, numerous crypto disasters, bankruptcies, and an unfavourable global macroeconomic environment all served to exacerbate the bear market.\n\nHow High Will Ethereum Go?\n\nAs the chart indicates, Ethereum has been receiving long term support since 2020. However, a major resistance was also created around $2038. It is the same period, when Ethereum was seen touching its all time high of $4868.\n\nHowever, Ethereum suffered a lot in 2022. In, 2023 is here with all the positive news, starting with the upgrade and switch to proof of stake (PoS). While writing the price prediction, Ethereum was at $1,858. There is a $222,970,691,577 USD market cap. The maximum supply is not known, but there are 120,245,588 ETH coins in circulation.\n\nIn the coming years, Ethereum price is predicted to range as high as $4,204.12 and $5,063.95, respectively. The typical anticipated trading expense is $4,355.45. By 2030, the price can rise up to $15,000.\n\nThe anticipations about Ethereum is quite positive. The coming period for the coin holds high expectations from traders, as well as, developers.\n\nMarket cap $196,632,048,264 ROI 65610.57% All Time High (Nov 16, 2021) $4,891.70 All Time Low (Oct 21, 2015) $0.4209\n\nUnderstanding the Idea Behind Creating Ethereum\n\nBitcoin was launched to test two main features that were missing in the financial system – permissionless transactions and cryptography. It sought to use the stern tenacity of cryptography to investigate the potential of the decentralized database. It could send values across the world without the involvement of intermediaries. However, it was missing an important feature of turning into a complete scripting language. But, do you know who had the solution? Yes, you guessed it right, Ethereum.\n\nThe idea behind Ethereum was to make it simplest, even though there might be data storage incompetence or higher time usage. As envisioned, Ethereum soon received the deserved reaction among the technological prophets. And now, after more than a decade, it has evolved into a technology that is more meticulous than Bitcoin.\n\nEthereum has played a pivotal role in the development of the blockchain and cryptocurrency ecosystem, and it has been the foundation for a multitude of decentralized applications and projects in areas like decentralized finance (DeFi), non-fungible tokens (NFTs), and more. Its continued evolution and upgrades are aimed at addressing scalability and security concerns to ensure its long-term viability as a blockchain platform.\n\nConclusion\n\nIn conclusion, Ethereum is a transformative digital currency that has disrupted traditional finance. Its underlying blockchain technology has the potential to revolutionize various industries. As you embark on your journey into the world of Ethereum, remember to stay informed, practice security measures, and explore the endless possibilities this cryptocurrency offers.\n\n1. Is Ethereum Legal? Yes, Ethereum is legal in most countries. However, it’s essential to check your local regulations.\n\n2. How Do I Acquire Ethreum? You can acquire Ethreum through exchanges, mining, or by accepting it as payment for goods and services."
    }
]