[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V0aGVyLXNlY3VyaXR5LWNvbW1vZGl0eS1nZW5zbGVy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Apr 2023 07:00:00 GMT",
        "title": "If Ether's Status Is Unclear After This Article, It's Clearly A You Problem - Blockworks",
        "content": "Ether, the native token of the Ethereum blockchain, has been the subject of much discussion recently. While its status appeared to be settled by the SEC’s staff some time ago, the recent transition to a proof-of-stake consensus mechanism has apparently given the current SEC Chair, Gary Gensler, an opportunity to re-examine the token.\n\nGensler is adamant that the crypto industry has been given perfect clarity on such matters, and has repeatedly declared that the rules for what constitutes a security are absolutely clear, transparent, and not open to interpretation.\n\nSo, is Ether, or ETH, a security, a commodity, or something else?\n\nLuckily we have gathered together all the experts who’ve clearly answered this thorny question, in Blockworks’ Ultimate Guide to Regulatory Clarity.™\n\nWilliam Hinman, Director of the Division of Corporate Finance at the SEC, June 2018:\n\n“Based on my understanding of the present state of Ether, the Ethereum network and its decentralized structure, current offers and sales of Ether are not securities transactions.”\n\nLetitia James, New York Attorney General, March 2023:\n\n“The Tokens [including ETH] are securities because they each involve investments of money into a common enterprise with the expectation of profits due to the managerial efforts of the Tokens’ respective founders, developers, and management teams.”\n\nAlso Letitia James, New York Attorney General, March 2023:\n\n“Under both state and federal authority, ETH, LUNA, and UST are commodities.”\n\nJay Clayton, Chair of the SEC, March 2019 (reinforcing Hinman, above):\n\n“A digital asset may be offered and sold initially as a security because it meets the definition of an investment contract, but that designation may change over time if the digital asset later is offered and sold in such a way that it will no longer meet that definition.”\n\nRostin Behnam, Chair of the CFTC, May 2022:\n\n“I can say for sure Bitcoin, which is the largest of the coins and has always been the largest regardless of the total market cap of the entire digital asset market capitalization, is a commodity. Ether as well. I have argued this before, my predecessors as well said it is a commodity.”\n\nGary Gensler, Chair of the SEC, April 2023 (refusing to answer the actual question):\n\n“Ummm, I… I… it’s… actually all securities are commodities under the Commodity and Exchange Act, it’s that we’re excluded commodities, but I would agree that a security cannot also be an excluded commodity and an included commodity.”\n\nNow it’s time for your multiple choice test. Based on the statements above, select one answer.\n\nEther is not a security Ether is a security Ether is both a security and a commodity Ether was a security, but now it isn’t Ether is a commodity Gary Gensler is making it up as he goes along All of the above\n\nClear enough for you?\n\nThanks to Planet Crypto for this week’s illustration.\n\nA version of this op-ed first appeared in Blockworks’ newsletter: Subscribe below.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2JpdGNvaW4tYW5kLWV0aGVyZXVtLWNyZWF0aW5nLWEtYnVsbC1tYXJrZXQtZm9yLW5ldy1wcm9qZWN0cy1saWtlLWJpZy1leWVzLWNvaW4v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Creating a Bull Market for New Projects like Big Eyes Coin - Analytics Insight",
        "content": "After breaking the landmark height of $30,000 earlier in the week, Bitcoin has remained stable and continued to grow, offering a promising prospect of a bull run in the crypto market in the coming weeks.\n\nThis is only further cemented by Ethereum (ETH) breaking $2,000 after their “Shanghai” update yesterday. As many experts are claiming that we are now in a bull market, investors are looking towards alternative investment opportunities still in their infancy to achieve maximum returns, such as Big Eyes Coin (BIG).\n\nBig Eyes, Bigger Possibilities\n\nBig Eyes Coin is rapidly approaching the end of its presale period, which ends on the 3rd of June, and the excitement surrounding the launch is palpable. BIG, having raised an impressive £33.73 million so far, has captured the attention of many crypto enthusiasts, and publications are recognizing it as having the potential to become the world’s next most significant meme coin.\n\nAs many other currencies have been experiencing exciting gains over the past week, it is natural that investors are scouring the market for upcoming projects that have the potential to match the growth that we have seen with currencies like Bitcoin (BTC) and Ethereum (ETH). The proof of stake system will enable BIG to offer a sustainable and innovative approach that is in line with future progressions within the crypto market.\n\nEthereum’s Leap of Faith\n\nEthereum (ETH) is another currency that has adopted the proof of stake system with their recent “Shanghai” update, moving entirely away from the controversial proof of work system used by many others, like Bitcoin (BTC).\n\nETH’s update has caused a rift in the market, and this gamble has paid off as ETH is looking to continue climbing as it has risen above the $2,000 point. This clearly suggests that we have well and truly entered a bull market.\n\nThe Influence of Bitcoin\n\nBitcoin (BTC) continues to skyrocket, although it remains a long way off its peak of $69,044. As the entire crypto market often follows the trajectory that BTC takes, this shows other currencies, such as Ethereum (ETH) and Big Eyes Coin (BIG), will follow this rise and grow in value in tandem.\n\nBTC has been adopted by many gigantic institutions such as Tesla, Block, and Coinbase, all buying millions of dollars worth of BTC. This has driven up the price of BTC and continues to grow the influence of crypto in the broader economic market.\n\nAs the crypto market continues to gain momentum during this bull run, investors are both continuing to pay attention to innovations by Ethereum and Bitcoin and consider how this will influence the market for new projects like Big Eyes Coin to launch in the near future. Now more than ever, enthusiasts are excited about investing in promising new projects to profit as much as possible from this bull market.\n\nBig Eyes Coin (BIG)\n\nPresale: https://buy.bigeyes.space/\n\nWebsite: https://bigeyes.space/\n\nTelegram: https://t.me/BIGEYESOFFICIAL\n\nOpensea: https://opensea.io/collection/big-eyes-lootbox-cards\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA0LzIzL3doYXRzLWEtYmV0dGVyLWJ1eS1ldGhlcmV1bS1vci1zb2xhbmEv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Apr 2023 07:00:00 GMT",
        "title": "What's a Better Buy: Ethereum or Solana? - The Motley Fool",
        "content": "Since Ethereum (ETH -0.11%) was created in 2015 it has radically altered the cryptocurrency landscape. Thanks to an innovation known as smart contracts, developers could create blockchain-based applications that automatically run and transfer value when certain criteria are met.\n\nInitially, Ethereum was the only smart-contract-capable blockchain, but in recent years this has changed. New blockchains have come into existence that not only offer smart contract functionality, but also a slew of other features hoping to build off of Ethereum.\n\nOne of those blockchains is Solana (SOL -2.87%), a blazingly fast smart contract blockchain that has a considerable user base and is the 10th most valuable cryptocurrency by market cap. Many believe Solana could eventually outdo Ethereum as the premier smart contract blockchain, but those hopes might be greatly inflated.\n\nA looming problem\n\nFirst, let's address the elephant in the room: Solana's multiple outages. Over the past year, Solana has experienced at least six network outages, including the most recent one in February where the blockchain was down for more than 18 hours, disrupting a number of exchanges and apps running on the network.\n\nIn contrast, Ethereum has a proven track record of stability and reliability. Ethereum's network has been operating smoothly for years, even with the increasing demand for decentralized applications and smart contracts.\n\nThe undisputed DeFi champ\n\nAnother key factor to consider when comparing Ethereum and Solana is the total value locked (TVL) metric. TVL is an important measure of the adoption and usage of a blockchain in the world of decentralized finance (DeFi). Since DeFi functionality is one of the primary use cases for both Ethereum and Solana, evaluating TVL can be an easy way to compare the two.\n\nEthereum utterly dominates the decentralized finance (DeFi) market with a TVL of more than $31 billion, compared to Solana's TVL of just over $292 million. That means Ethereum supports 100 times more value in DeFi than Solana. Clearly, the competition isn't even close and demonstrates the greater adoption and usage of Ethereum's network in the DeFi market. From this perspective, Ethereum is a much more attractive investment option for those looking to tap into the growing DeFi niche.\n\nSpeed isn't everything\n\nFans of Solana often say that it has some of the fastest transaction speeds. While this is true, it distorts the purpose of a blockchain. One of the primary reasons blockchain technology is so profound is because it allows users to transfer value in a decentralized and secure fashion. While Solana prioritizes speed, it sacrifices higher levels of decentralization and security found in Ethereum.\n\nAlthough many are quick to point out that Ethereum moves at a snail's pace compared to Solana, they also fail to realize that there is serious progress being made to narrow this gap thanks to new solutions known as Layer 2s.\n\nThrough the use of Layer 2 solutions such as Optimism, Polygon, and Arbitrum, Ethereum is transformed into a lightning-fast network, while also maintaining its decentralized and secure nature. As these solutions continue to be developed and adopted, Ethereum's competitive advantage over Solana will likely become even more apparent.\n\nThe big picture\n\nSo, what does this mean for investors looking to pick between Solana and Ethereum? Although Solana may seem like a tempting option with its impressive speed, the lack of value it supports in DeFi and the sacrifices in decentralization and security make it a riskier investment, especially considering it still remains down more than 90% from its all time high.\n\nEthereum, on the other hand, has a proven track record and a solid foundation in the decentralized finance market. Its market dominance, along with the development of Layer 2 solutions, makes it a safer and more promising investment for those looking for long-term growth."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA0LzIzL3doYXRzLWEtYmV0dGVyLWJ1eS1ldGhlcmV1bS1vci1zb2xhbmEv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Apr 2023 07:00:00 GMT",
        "title": "What's a Better Buy: Ethereum or Solana? - The Motley Fool",
        "content": "Since Ethereum (ETH -0.11%) was created in 2015 it has radically altered the cryptocurrency landscape. Thanks to an innovation known as smart contracts, developers could create blockchain-based applications that automatically run and transfer value when certain criteria are met.\n\nInitially, Ethereum was the only smart-contract-capable blockchain, but in recent years this has changed. New blockchains have come into existence that not only offer smart contract functionality, but also a slew of other features hoping to build off of Ethereum.\n\nOne of those blockchains is Solana (SOL -2.87%), a blazingly fast smart contract blockchain that has a considerable user base and is the 10th most valuable cryptocurrency by market cap. Many believe Solana could eventually outdo Ethereum as the premier smart contract blockchain, but those hopes might be greatly inflated.\n\nA looming problem\n\nFirst, let's address the elephant in the room: Solana's multiple outages. Over the past year, Solana has experienced at least six network outages, including the most recent one in February where the blockchain was down for more than 18 hours, disrupting a number of exchanges and apps running on the network.\n\nIn contrast, Ethereum has a proven track record of stability and reliability. Ethereum's network has been operating smoothly for years, even with the increasing demand for decentralized applications and smart contracts.\n\nThe undisputed DeFi champ\n\nAnother key factor to consider when comparing Ethereum and Solana is the total value locked (TVL) metric. TVL is an important measure of the adoption and usage of a blockchain in the world of decentralized finance (DeFi). Since DeFi functionality is one of the primary use cases for both Ethereum and Solana, evaluating TVL can be an easy way to compare the two.\n\nEthereum utterly dominates the decentralized finance (DeFi) market with a TVL of more than $31 billion, compared to Solana's TVL of just over $292 million. That means Ethereum supports 100 times more value in DeFi than Solana. Clearly, the competition isn't even close and demonstrates the greater adoption and usage of Ethereum's network in the DeFi market. From this perspective, Ethereum is a much more attractive investment option for those looking to tap into the growing DeFi niche.\n\nSpeed isn't everything\n\nFans of Solana often say that it has some of the fastest transaction speeds. While this is true, it distorts the purpose of a blockchain. One of the primary reasons blockchain technology is so profound is because it allows users to transfer value in a decentralized and secure fashion. While Solana prioritizes speed, it sacrifices higher levels of decentralization and security found in Ethereum.\n\nAlthough many are quick to point out that Ethereum moves at a snail's pace compared to Solana, they also fail to realize that there is serious progress being made to narrow this gap thanks to new solutions known as Layer 2s.\n\nThrough the use of Layer 2 solutions such as Optimism, Polygon, and Arbitrum, Ethereum is transformed into a lightning-fast network, while also maintaining its decentralized and secure nature. As these solutions continue to be developed and adopted, Ethereum's competitive advantage over Solana will likely become even more apparent.\n\nThe big picture\n\nSo, what does this mean for investors looking to pick between Solana and Ethereum? Although Solana may seem like a tempting option with its impressive speed, the lack of value it supports in DeFi and the sacrifices in decentralization and security make it a riskier investment, especially considering it still remains down more than 90% from its all time high.\n\nEthereum, on the other hand, has a proven track record and a solid foundation in the decentralized finance market. Its market dominance, along with the development of Layer 2 solutions, makes it a safer and more promising investment for those looking for long-term growth."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vZGFpbHljb2luLmNvbS9zaGliYXJpdW0tZXZlcnl0aGluZy1hYm91dC1zaGliYS1pbnUtYmxvY2tjaGFpbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Apr 2023 07:00:00 GMT",
        "title": "Shibarium: Shiba Inu's Blockchain - DailyCoin",
        "content": "The upcoming Shibarium launch marks a critical turning point for Shiba Inu (SHIB). It signifies a long-awaited moment for the SHIB Army, when their beloved cryptocurrency evolves from a canine meme coin into a fully-fledged blockchain.\n\nShibarium promises to be the Shiba Inu community’s home in the Web3 world. It represents the fulfillment of Ryoshi’s vision and solidifies the Shiba Inu ecosystem. Led by Shytoshi Kusama, the Shib Army will finally leave Ethereum (ETH) forever and forge its own destiny with lower fees and newfound scalability.\n\nWhat exactly is Shibarium? What does this historic launch mean for SHIB holders, and what awaits the Shiba Inu community in this brave new world?\n\nWhat Is Shibarium?\n\nShibarium is a Layer-2 solution built on top of the Ethereum blockchain. Since Shiba Inu was first created back in 2020, the growth of its ecosystem has been restricted by Ethereum’s scalability issues.\n\nHigh gas fees and slow network transactions on Ethereum have made dApps like ShibaSwap challenging to use, discouraging crypto newcomers from exploring Shiba Inu’s potential.\n\nWith Shibarium, this is all set to change. By launching its own network, the Shiba Inu community will be able to grow its flourishing ecosystem without being inhibited by Ethereum’s limitations.\n\nThe Shibarium blockchain will be faster and cheaper than Ethereum while still enjoying the base network’s security.\n\nHow Does Shibarium Work?\n\nThe Shibarium blockchain uses a new consensus mechanism called Proof-of-Participation. In a PoP network, validator nodes are selected for verifying transactions and securing the network based on the number of BONE tokens they hold. This makes it far more energy efficient than Proof-of-Work chains like Bitcoin (BTC).\n\nLike most Ethereum Layer 2 networks, Shibarium will also operate an EVM (Ethereum Virtual Machine), allowing developers to easily deploy Ethereum-based smart contracts and dApps on the new network.\n\nMoreover, Shibarium developers intend to create a permissionless bridge between the two networks, making it easy to migrate Shiba Inu tokens from Ethereum to Shibarium.\n\nShibarium History: The Story So Far\n\nRyoshi, the founder of the Shiba Inu, teased the idea of an entire blockchain dedicated to the community as far back as May 2021. In the now-deleted blog post, Ryoshi envisioned a network where developers and users could create and explore applications that would expand the Shiba Inu ecosystem.\n\nShytoshi Kusama, the lead developer, has kept information about the development of Shibarium behind closed doors. The blockchain has been in the works for years, with the secrecy and mystique only adding to anticipation and excitement.\n\nThat all changed in March 2023 with the release of the Shibarium beta testnet. Nicknamed Puppynet, the test network is open to the public. This allows every member of the Shib Army to test dApps and products and deploy smart contracts in a risk-free environment.\n\nThe Shibarium puppynet is expected to be the final step in the development process before the official mainnet launch of the Shibarium blockchain.\n\nThe Shibarium Launch\n\nOn August 16, 2023, it finally happened. Shytoshi Kusama, the Shibarium development team, and the SHIB Army had poured years of blood, sweat, and tears into the iconic network. While Shibarium went live as expected, the architects behind Shiba Inu’s blockchain underestimated the demand.\n\nAmidst the excitement of Shibarium’s launch, extreme demand sent the network into a fail-safe ‘pause’ state, effectively halting the network. As expected, this outage caused fear, uncertainty, and doubt throughout the Shiba Inu community. Who’d have thought that after months of testing, Shibarium wouldn’t be able to handle the influx of users on launch day?\n\nShytoshi Kusama wasted no time in running community damage control, announcing in a blog post that there were no inherent technical issues with Shibarium or the bridge to the network. The outage was a simple security feature designed to protect users if the network was overwhelmed.\n\nWhile the Shibarium development team had expected a surge of users on launch day, the reality was that they simply didn’t purchase enough monthly compute units from Alchemy, their blockchain architecture provider.\n\nBased on testing, Shibarium is expected to need no more than 400 million monthly compute units. When the Shibarium launch expended over 160 million compute units in just half an hour, it became evident that Shibarium might be on track to become one of the most popular and active Layer 2 networks in the industry.\n\nThe Shibarium Bridge – Locked Funds\n\nEven after the halted network and ripples of FUD throughout the Shiba Inu community, the launch day drama was far from over. Wanting to be among the first to use Shibarium, hundreds of SHIB Army warriors attempted to bridge their funds to the network as quickly as possible.\n\nEager users were left wanting after the technical difficulties caused funds to be stuck in the Shibarium bridging contract with no means of escape until the network resumed. Over 1,000 ETH and 600,000 BONE were locked away and inaccessible, waiting for Shibarium to restart.\n\nIn typical Shytoshi fashion, the lead developer quickly put the community’s mind at ease. He guaranteed the SHIB Army that there were no faults in the bridging contract and insured all locked funds if there are ongoing difficulties after Shibarium kicks into action.\n\nWhat Can I Do On Shibarium?\n\nIf you’re familiar with Ethereum and any other Layer 2 networks built on top of it, like Arbitrum, Shibarium will offer a very similar experience. In the true spirit of a decentralized and permissionless blockchain, everyone will have complete freedom to create an application that they believe will bring value to the Shiba Inu community and ecosystem.\n\nDeFi\n\nDecentralized Finance on Shibarium will likely begin with ShibaSwap, Shiba Inu’s native DEX. Users can trade cryptocurrencies through on-chain liquidity pools, taking advantage of Shibarium’s high network speeds and low transaction fees.\n\nOther DeFi apps, like lending platforms, will bring greater liquidity to all tokens in the Shiba Inu ecosystem, like BONE, LEASH, and TREAT. The creativity of developers within the Shib Army only limits the potential for DeFi growth on Shibarium.\n\nShibarium NFTs\n\nThe Shibarium blockchain will provide a native home for all Shiba Inu ecosystem non-fungible tokens. NFT collectors will be able to buy and sell their favorite pieces without paying the prohibitive gas fees typical on Ethereum.\n\nThis isn’t limited to current collections like Shiboshis and SHIB Metaverse Land Plots. Shibarium allows the Shiba Inu community to launch their own NFT collections and contribute to the ecosystem.\n\nShibarium MetaVerse\n\nSHIB: The Metaverse is an immersive virtual world where the Shib Army can gather to play and create Shiba Inu-inspired games, build digital businesses and show off their digital identity. It aims to create a digital environment that the SHIB community will call home.\n\nDeveloped using Unreal Engine 5.1, SHIB: The Metaverse is visually stunning. The virtual landscape features various Hubs and allows every user to create dynamic, customizable Avatars to explore the space.\n\nThere are 100,595 land plots in the SHIB metaverse, with each plot having various development and characterization options. Owners can do whatever they please with their virtual real estate, like opening digital stores or hosting events.\n\nShiba Inu Tokens\n\nThe Shiba Inu ecosystem is home to a range of digital assets, each serving a different purpose. Let’s break down the role and utility of all the cryptocurrencies underneath the Shiba Inu umbrella.\n\nSHIB – The OG itself, SHIB, is the cornerstone of the Shiba Inu ecosystem.\n\nBONE – BONE plays a crucial role in the Shibarium network. It’s the native gas token of the network, meaning it’s needed to pay transaction fees on the Shibarium blockchain and can be staked to validator nodes to secure the network and create new blocks.\n\nLEASH – LEASH is a rewards token previously used to incentivize liquidity provision on ShibaSwap and give holders early access to SHIB Land Sales.\n\nTREAT – Still unreleased, TREAT is another rewards token to be distributed to BONE stakers and validators once they reach certain milestones.\n\nSHI – The native stablecoin of the Shibarium blockchain, SHI will be pegged to $1 and by a hedge against crypto market volatility.\n\nWhat Does Shibarium Mean for SHIB?\n\nThe launch of Shibarium is expected to be a positive catalyst for the growth of Shiba Inu. The network brings a wealth of utility to the entire ecosystem and gives the Shib Army a place to call home.\n\nPerhaps the biggest impact that Shibarium will have on the SHIB token will be felt through its unique burn mechanism.\n\nThe SHIB Burn\n\nSHIB has the largest token supply of any cryptocurrency on the market, with a total supply of one quadrillion tokens. While more than half of these tokens have already been burned, the Shibarium blockchain will introduce a creative new burn mechanic to permanently remove SHIB tokens from circulation and increase their scarcity.\n\nWhen transactions are processed on the Shibarium blockchain, 70% of every transaction base fee will be collected and stored in a locked contract. These fees are collected in BONE, the gas token of the network.\n\nOnce $25,000 worth of BONE has been accumulated, the Shiba Inu community can open the Burn Portal and initiate the token burn process. BONE is sent to the Ethereum Mainnet, which automatically trades to buy SHIB tokens, providing additional buy pressure. The smart contract then sends all the purchased SHIB to a burn address, making SHIB a deflationary asset in perpetuity.\n\nShibarium Pros & Cons\n\nThe Shibarium launch is arguably the most significant event in Shiba Inu’s history, apart from perhaps the disappearance of Ryoshi. Its success or failure will have an enormous impact on the future of SHIB. Let’s take a quick look at the benefits and drawbacks of the Shibarium network.\n\nPros\n\nScalability – Shibarium will be significantly faster and cheaper than Ethereum, making it far more accessible for most users.\n\nCompatibility – The network will be EVM compatible, making it easy for developers to port over Ethereum-based contracts and build a rich ecosystem of dApps quickly.\n\nBrings new utility to Shiba Ecosystem tokens – All Shiba Inu digital assets, including NFTs, will gain exciting new cases.\n\nSHIB Burn – The SHIB burn rate is expected to positively impact SHIB tokenomics, reducing the token supply and providing constant buy pressure to SHIB.\n\nSeparates SHIB from other meme coins – The launch of Shibarium gives SHIB new use cases and a far richer ecosystem than alternative meme coins like Dogecoin (DOGE).\n\nCons\n\nLayer-2 competition – Between Arbitrum, Polygon zkEVM, and zkSync, the Ethereum Layer-2 race is brutal. From what we know of Shibarium before its launch, there is nothing to indicate it has superior technology than its better-resourced competitors.\n\nUncertainty around performance – Key metrics when analyzing the performance and capabilities of a network, like transaction throughput and finality, are still unclear.\n\nLack of incentives – Other new networks with more resources offer ecosystem grants to encourage developers to build dApps on their chain. Shibarium is yet to offer any funding for developers, meaning we might not see a great range of applications when the network eventually launches.\n\nOn the Flipside\n\nOne thing that cannot be overlooked is the strength and tenacity of the Shib Army. Their enormous social media presence and community spirit have previously overcome all kinds of fear, uncertainty, and doubt.\n\nEven if Shibarium falls short of expectations and is technically inferior to alternative Layer 2s, Shiba Inu’s resilient community will probably still use it. It’s an extension of their culture and story, which, for the Shib Army, might be a stronger pull factor than blockchain performance.\n\nWhy You Should Care\n\nThe Shibarium launch is a massive milestone for Shiba Inu and its community. Shiba Inu is one of the largest cryptocurrencies in the space in terms of market cap, and the success or failure of Shibarium will likely have a domino effect of similar coins in the market.\n\nFAQs"
    }
]