[
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA1LzEwL2V5LWxhdW5jaGVzLWV0aGVyZXVtLWJhc2VkLWNhcmJvbi1lbWlzc2lvbi10cmFja2luZy1wbGF0Zm9ybS_SAW5odHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wNS8xMC9leS1sYXVuY2hlcy1ldGhlcmV1bS1iYXNlZC1jYXJib24tZW1pc3Npb24tdHJhY2tpbmctcGxhdGZvcm0vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 May 2023 07:00:00 GMT",
        "title": "EY Launches Ethereum-Based Carbon Emission Tracking Platform - CoinDesk",
        "content": "“Detailed traceability allows for tracking of emissions inventory through tokenization including the ability to link carbon output to specific product output,” Brody said in a statement. “By using carbon credit tokens, either created or sourced on the market, enterprises can now have visibility into their actions toward decarbonization.”"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS12YWxpZGF0b3JzLWVhcm4tYS1yZWNvcmQtNDZtLWFzLXN0YWtpbmctcmV3YXJkcy1yYXRlLXN1cmdlc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 May 2023 07:00:00 GMT",
        "title": "Ethereum validators earn a record $46M as staking rewards rate surges - Cointelegraph",
        "content": "Validators earned $46 million in the first week of May due to an increase in the staking rewards rate, which is a metric for validators’ annualized yield. According to data, validators earned 24,997 Ether (ETH) in the week, representing a 40% increase over the previous week’s income of $33 million, when 18,339 ETH were distributed as rewards.\n\nThe recent trading craze of a new memecoin called Pepe (PEPE) is the reason behind the increased rewards for validators. In the past week, the average fees on the Ethereum network have exceeded 100 gwei, marking the highest level since May 2022. As gas fees increase, end users pay over $30 per swap, resulting in higher fee income for validators from processing transactions and the regular validator rewards.\n\nETH staking rewards reference rate. Source: Beaconcha.in\n\nBeaconcha.in states that the present staking rate signifies the anticipated annualized return for validators. In order to engage in the network’s consensus procedure, validators on Ethereum are mandated to stake a minimum of 32 ETH, valued at roughly $58,000.\n\nThere are two types of rewards identified by ETH Store, a company that measures reward rates: consensus rewards for proposing and attesting blocks, and transaction fees for processing transactions on the Ethereum network.\n\nRelated: Worth it? Trader spends $120K on gas buying $155K worth of a memecoin\n\nSince Ethereum’s network moved to a proof-of-stake consensus mechanism with the Merge in 2022, and following the recent Shapella upgrade enabling validator withdrawals for the first time, ETH staking has attained significant interest from institutions.\n\nMagazine: Joe Lubin: The truth about ETH founders split and ‘Crypto Google’"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZGFpbHljb2luLmNvbS9ldGhlcmV1bXMtb2ZhYy1jb21wbGlhbnQtYmxvY2tzLWRyb3AtdG8tMjctd2hhdC1kb2VzLWl0LW1lYW4v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 May 2023 07:00:00 GMT",
        "title": "Ethereum's OFAC-Compliant Blocks Drop to 27%: What Does It Mean? - DailyCoin",
        "content": "Only 29% of all blocks on Ethereum are being censored due to OFAC sanctions.\n\nThe percentage of OFAC-compliant blocks was much higher in 2022.\n\nOFAC-compliant blocks can always increase.\n\nEthereum is the most widely-used blockchain in the crypto industry. It’s so popular that there are even blocks that are supposed to be censored due to regulations.\n\nHowever, Ethereum is known for being censorship-resistant. And on Wednesday, it proved to be just that.\n\nEthereum’s OFAC-Compliant Blocks Drop to 29%\n\nEthereum has just become more censorship-resistant. On Thursday, Ethereum’s OFAC-compliant blocks dropped to just 29%.\n\nEthereum OFAC compliance chart. Source: mevwatch.info.\n\nOFAC stands for Office for Foreign Assets Control, an agency of the U.S. Department of the Treasury that administers and enforces economic and trade sanctions to support national security and foreign policy objectives.\n\nIn August 2022, the OFAC imposed sanctions on Tornado Cash, a decentralized crypto mixer on the Ethereum blockchain, and several associated Ethereum addresses. The OFAC said Tornado Cash facilitated illegal and criminal money transfers and implemented measures to censor specific transactions.\n\nIn response to the OFAC sanctions, some relay operators, the most famous of them being Flashbots, started filtering transactions that were not compliant with the OFAC sanctions. Initially, around 80% of all transactions on Ethereum were OFAC-compliant.\n\nHowever, that number has since gone down drastically. According to data from mevwatch.info, only 29% of all transactions on the Ethereum network are currently OFAC-compliant. This means that Ethereum has maintained its censorship-resistance property.\n\nOn the Flipside\n\nRelayers can start blocking transactions that aren’t OFAC-compliant anytime if there are attractive maximal extractable value (MEV) opportunities.\n\nWhy You Should Care\n\nBeing censorship-resistant is one of the most important properties of a blockchain. The fact that Ethereum has maintained this property over the years speaks volumes about its resilience and importance in the blockchain world.\n\nRead more about Lido enabling stETH withdrawals:\n\nLido Finally Sets Date for stETH Withdrawals\n\nRead more about how Polygon is driving institutional adoption of DeFi:\n\nHere’s How Polygon Is Driving Institutional Adoption of DeFi"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vZGVjcnlwdC5jby8xMzk1NjgvYml0Y29pbi1ldGhlcmV1bS1yaXNlLWFzLWluZmxhdGlvbi1zbG93c9IBSGh0dHBzOi8vZGVjcnlwdC5jby8xMzk1NjgvYml0Y29pbi1ldGhlcmV1bS1yaXNlLWFzLWluZmxhdGlvbi1zbG93cz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 May 2023 07:00:00 GMT",
        "title": "Bitcoin, Ethereum Push Higher As Inflation Slows to 4.9% in April - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCryptocurrency prices rose on Wednesday after a widely-watched inflation gauge in the U.S. suggested the Federal Reserve’s fight against soaring prices is making progress.\n\nThe Consumer Price Index rose 4.9% in the 12 months through April, the Bureau of Labor Statistics (BLS) said Wednesday, coming in slightly below economists' estimates of 5%.\n\nOn a month-to-month basis, the index, which tracks price movements across a broad range of goods and services, rose 0.4% in April compared to a 0.1% bump in March and a 0.4% increase in February.\n\nAD\n\nAD\n\nBitcoin was up 1.4% over the past day, chipping away at weekly losses of 1.8% at around $27,900, according to CoinGecko. Ethereum was also in the green, notching a 1.6% daily increase and reversing a weekly downtrend at $1,870. Meanwhile, the global crypto market capitalization was sitting at $1.2 trillion—up 0.8% from the previous day.\n\n\n\nIn terms of the impact that Wednesday’s CPI print had on crypto markets, Managing Director at Wave Digital Assets Nauman Sheikh told Decrypt a lack of liquidity is likely at play, pointing to market makers like Jane Street and Jump who have scaled back.\n\n“Liquidity just fell off a cliff, so any market impact on the way up on the way down will be a little bit more exaggerated,” he said. “There's no depth to the market, which means any slight pressure on either side is just going to be exasperated.”\n\nThe index’s increase in April was largely fueled by a jump in housing prices, which grew 0.4% month-to-month, the BLS said. But the measure represented a notable decline compared to a monthly increase of 0.6% in March and 0.8% in February.\n\nThe report indicated that core inflation, which strips out volatile food and energy costs, rose 5.5% in the 12 months through April, edging down from 5.6% in March.\n\nAD\n\nAD\n\nFor the most part, inflation has steadily cooled over the past several months, down significantly from a sweltering 9.1% clip last June. Still, the latest report showed annual inflation remains far above the Fed’s target of 2%. And the U.S. central bank has jacked interest rates aggressively in response to rising prices. It’s lifted interest rates to their highest levels since 2007, delivering its 10th consecutive rate hike last week.\n\nHigher interest rates cool down the economy because of their ripple effect, impacting costs associated with credit cards and mortgages. They also weigh on stocks and other “risk” assets, such as crypto, making yields on cash reserves and U.S. Treasury Bills comparatively more attractive.\n\nThe Fed risks tipping the U.S. economy into a recession if it raises rates too quickly. And signs of stress emerged in the financial system when several banks collapsed in March. The tumult continued when First Republic Bank failed last week. Now a potential debt ceiling crisis looms.\n\nWhen the Fed decided to raise interest rates last week, Chair Jerome Powell indicated there could be a potential pause. But he said the central bank would wait and see how the economy performed before making a decision at the Fed’s next meeting in June.\n\n“The fact that [inflation] is within expectations, a bit better for the annual rate, it means the Fed will likely pause,” Kaiko analyst Dessislava Aubert told Decrypt, “Because the current banking turmoil in the U.S. is basically making traditional tightening less necessary—banks are already tightening lending standards.”"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1kZXJpdmF0aXZlcy1mbGlydGluZy13aXRoLWJlYXJpc2huZXNzLW1pbmQtdGhlLTEtODIwLXN1cHBvcnTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 May 2023 07:00:00 GMT",
        "title": "Ethereum derivatives flirting with bearishness: Mind the $1,820 support - Cointelegraph",
        "content": "After a brief overshoot above $2,000 on May 6, the Ether price has returned to a tight range between $1,820 and $1,950, which has been the norm for the past three weeks.\n\nAccording to the latest Ether (ETH) futures and options data, odds favor the Ether price breaking below the $1,820 support, as professional traders have been unwilling to add neutral-to-bullish positions using derivatives contracts.\n\nEther price in USD, 12-hour chart. Source: TradingView\n\nNot even the memecoin frenzy that boosted Ethereum network demand was able to instill confidence in investors. The average Ethereum transaction fee skyrocketed to $27.70 on May 6, the highest in 12 months, according to BitInfoCharts data. As reported by Cointelegraph, one of the main drivers behind the increase was the insatiable demand for Pepe (PEPE), among other memecoins.\n\nMoreover, the increased gas fees have driven users to layer-2 solutions, which could be interpreted as a weakness. For instance, it causes a decline in the total value locked by removing deposits from the Ethereum chain, especially in decentralized finance applications.\n\nSome analysts believe the $30 million Ether sale by the Ethereum Foundation contributed to ETH being unable to break above $2,000, as nearly 20,000 ETH were sent to the Kraken cryptocurrency exchange. The foundation’s last relevant transfer occurred in November 2021, when the price topped around $4,850 and subsequently declined by 80%.\n\nOn the macroeconomic side, the United States’ 4.9% April consumer price index (CPI) data announced on May 10, slightly below consensus, further increased investors’ expectations of stable interest rates at the next Federal Reserve meeting in June. CME Group’s FedWatch Tool showed 94% odds of stability at the current 5% to 5.25% range.\n\nTherefore, with no signs of a Fed pivot on the horizon, the demand for risk-on assets such as cryptocurrencies should remain under pressure. But if investors fear that Ether has higher odds of breaking the three-week sideways movement to the downside, i should be reflected in the ETH futures contract premium and increased costs for protective put options.\n\nEther futures reflect weak demand from longs\n\nEther quarterly futures are popular among whales and arbitrage desks. However, these fixed-month contracts typically trade at a slight premium to spot markets, indicating that sellers are asking for more money to delay settlement.\n\nAs a result, ETH futures contracts in healthy markets should trade at a 5% to 10% annualized premium — a situation known as contango, which is not unique to crypto markets.\n\nEther three-month futures annualized premium. Source: Laevitas\n\nEther traders have been extremely cautious in the past week, as there was no surge in demand for leverage longs during the rally above $2,000 on May 6. Presently at 1.4%, the ETH futures premium reflects a complete lack of appetite from buyers using derivatives contracts.\n\nEther options risk metric stood neutral\n\nTraders should also analyze options markets to understand whether the recent correction has caused investors to become more optimistic. The 25% call-to-put delta skew is a telling sign when arbitrage desks and market makers overcharge for upside or downside protection.\n\nIn short, if traders anticipate an Ether price drop, the skew metric will drop below 7%, and phases of excitement tend to have a positive 7% skew.\n\nRelated: Arbitrum's DAO to receive over 3,350 ETH revenue from transaction fees\n\nEther 30-day options 25% delta skew. Source: Amberdata & The Block\n\nAs displayed above, the ETH options' 25% call-to-put delta skew has been neutral for the past two weeks, as the protective put options were trading at a fair price relative to similar neutral-to-bullish call options.\n\nEther options and futures markets suggest that pro traders are not confident, especially considering the 10.6% rally between May 2-6. Therefore, the weak derivatives indicators are more likely to flip bearish if the three-week sideways movement breaks to the downside.\n\nIn other words, if Ether’s price breaks below $1,820, traders should expect a much higher appetite for bearish bets using ETH derivatives, an indicator of distrust and a lack of demand for longs.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    }
]