[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA0LTA3L3doeS1jcnlwdG8taXMtd2F0Y2hpbmctZXRoZXJldW0tZXRoLWJsb2NrY2hhaW4tc2hhbmdoYWktdXBncmFkZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Ethereum's 'Shanghai' Upgrade: What Does It Mean for Crypto and Ether? - Bloomberg",
        "content": "The Ethereum network is set to undergo a technical revamp on April 12 that will allow users to withdraw tens of billions of dollars of its native token, Ether. Known as the “Shanghai” upgrade, it’s a necessary step after the world’s most commercially important crypto platform shifted to a less power-hungry process for ordering transactions. Investors burned by recent turmoil in crypto markets will be wondering if, presented with their first opportunity to withdraw their tokens, some Ether holders will run for the hills.\n\nIt’s a computer network that hosts what are known as smart contracts — self-executing software agreements in which a chain of actions can flow from defined conditions and contingencies. Since it was introduced by crypto entrepreneur Vitalik Buterin in 2014, it’s become a popular platform for developing apps used for everything from trading to gaming. Transactions on Ethereum and many other crypto platforms known as blockchains are publicly viewable and are built on open source software, so developers can jump in and try to make improvements. Ether’s value tumbled during the “crypto winter” of 2022 that saw investors pull back from many digital assets. But the appeal of Ethereum’s underlying technology has endured."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA0LTA3L3doeS1jcnlwdG8taXMtd2F0Y2hpbmctZXRoZXJldW0tZXRoLWJsb2NrY2hhaW4tc2hhbmdoYWktdXBncmFkZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Ethereum's 'Shanghai' Upgrade: What Does It Mean for Crypto and Ether? - Bloomberg",
        "content": "The Ethereum network is set to undergo a technical revamp on April 12 that will allow users to withdraw tens of billions of dollars of its native token, Ether. Known as the “Shanghai” upgrade, it’s a necessary step after the world’s most commercially important crypto platform shifted to a less power-hungry process for ordering transactions. Investors burned by recent turmoil in crypto markets will be wondering if, presented with their first opportunity to withdraw their tokens, some Ether holders will run for the hills.\n\nIt’s a computer network that hosts what are known as smart contracts — self-executing software agreements in which a chain of actions can flow from defined conditions and contingencies. Since it was introduced by crypto entrepreneur Vitalik Buterin in 2014, it’s become a popular platform for developing apps used for everything from trading to gaming. Transactions on Ethereum and many other crypto platforms known as blockchains are publicly viewable and are built on open source software, so developers can jump in and try to make improvements. Ether’s value tumbled during the “crypto winter” of 2022 that saw investors pull back from many digital assets. But the appeal of Ethereum’s underlying technology has endured."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA0LzA3L2V0aGVyZXVtcy1zY2FsaW5nLXJhY2Utd2hpY2gtbGF5ZXItMi1jcnlwdG8taXMtdGhlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Ethereum's Scaling Race: Which Layer 2 Crypto Is the Best Buy Right Now? - The Motley Fool",
        "content": "Over the past few years, it's become clear that Ethereum (ETH 1.64%) has experienced significant growth. But as a result of becoming one of the most popular blockchains in the world, its network has become plagued by slow transaction speeds and costly fees. This extreme congestion has created demand for effective Layer 2 scaling solutions.\n\nLayer 2 scaling solutions are built on top of the Ethereum blockchain to enable faster and cheaper transactions while maintaining the blockchain's decentralization and security features.\n\nThere are currently a handful of Layer 2 scaling solutions that aim to solve Ethereum's issues. But the three front-runners today -- and also those with the most long-term potential -- are Arbitrum (CRYPTO:ARB), Optimism (OP), and Polygon (MATIC 2.14%).\n\nEach of these solutions operates a little differently, and as such have their own pros and cons. Let's see what sets these competitors apart and might be deserving of your hard-earned money.\n\nThe Layer 2 breakdown\n\nTo start, it should be clarified that all these Layer 2 solutions try to accomplish the same thing: Make Ethereum faster and cheaper. For the most part, they all use similar processes but differ slightly in how they actually scale up Ethereum.\n\nThese differences can be highly technical and are likely better saved for a conversation another day, but the key factor to understand is that all of these solutions present trade-offs depending on what they prioritize.\n\nFor example, Arbitrum and Optimism both use rollups, which combine groups of transactions into a single transaction. But Arbitrum does it in a way that is slightly slower, yet dramatically cheaper than Optimism. When looking at Polygon, its method of using a sidechain to process transactions makes it less decentralized than Optimism or Arbitrum.\n\nHowever, Arbitrum and Polygon have robust compatibility with Ethereum, making them great options for developers wanting to create decentralized apps.\n\nEach solution comes with its own benefits and drawbacks, but to truly understand which ones are in the most demand, we can look at some statistics.\n\nBy the numbers\n\nTo quantify each solution, it can be helpful to compare simple metrics such as speed and transaction costs since these are essentially the two reasons there is demand for a Layer 2 solution.\n\nPolygon is able to process as many as 65,000 transactions per second, while maintaining low fees that typically range between $0.1 to $0.5 depending on the transaction size. Arbitrum allows for 40,000 transactions per second, with fees ranging from $0.5 to $0.7. Optimism has the capacity to process up to 2,000 transactions per second, and fees are slightly higher compared to Arbitrum and Polygon, ranging from $0.6 to $0.9.\n\nOther statistics -- such as the number of wallets, number of transactions, and total value locked -- can also help paint a clearer picture of the layer 2 landscape.\n\nWhen it comes to the number of wallets and the number of transactions, the race really isn't even close. Polygon simply dominates. While Optimism lags behind Arbitrum and Polygon significantly, Arbitrum is gaining some ground on Polygon thanks to its newly released token that came out this March.\n\nThe other metric to consider is total value locked (TVL). You could think of this as a way to measure the value each solution supports in decentralized applications. The greater the TVL, the more valuable the solution. Surprisingly, Arbitrum has the highest TVL among these three, coming in at around $2.2 billion. Polygon follows at $1.1 billion, and Optimism is third at $920 million.\n\nThe front-runner\n\nConsidering this combination of statistics, it's clear that Polygon and Arbitrum are providing developers and users with a valuable solution. Both have proven usage, which is reflected in multiple sets of statistics.\n\nAn investment in both could be plausible, but if there is one Layer 2 solution deserving of your money, it is likely Polygon. It has a friendly developer environment, verifiable usage, and the best part: a plethora of partnerships with some of the world's most recognizable brands.\n\nIn the past year or so, companies including JPMorgan Chase, Starbucks, Disney, Nike, and Meta Platforms have all used Polygon in different ways to facilitate new blockchain-based business models.\n\nWith its price still down 62% from its all-time high, Polygon looks to have significant long-term potential, exactly the kind investors should be looking for.\n\nIf there is one downside to Polygon, it would be its higher levels of centralization. If decentralization is a priority, then Arbitrum seems to be the best choice. But with its new token just a few weeks old, I would personally like to see Arbitrum build more of a track record.\n\n\n\n\n\n"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zdGFrZWQtZXRoZXJldW0td2l0aGRyYXdhbHMtY291bGQtd2Vla3MtMjEwMTQ0OTA0Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Staked Ethereum Withdrawals Could Take Weeks After Shanghai Upgrade: Analyst - Yahoo Finance",
        "content": "Ethereum shifted to a more energy-efficient proof-of-stake model in September, but there’s still one upgrade that needs to be completed to let users unstake their ETH from the network. It's coming up next week—but the process could ultimately take weeks to complete, an analyst at crypto data platform Nansen told Decrypt.\n\nFollowing September's merge event, Ethereum's transition will conclude with the launch of the Shanghai upgrade on April 12, which is paired with another upgrade called Capella.\n\nThe upgrades are hotly anticipated by users who staked ETH in the network—either as individual validators or through platforms like Lido Finance and Rocket Pool—as they will soon be able to withdraw their assets and accumulated rewards.\n\nWhat the Ethereum Shanghai Upgrade Means for You, ETH, and the SEC\n\nBut Ethereum users may not be able to withdraw their funds immediately, or all at once. According to Andrew Thurman, a data analyst at Nansen, the length of the withdrawal queue could result in users having to wait several weeks to withdraw their funds.\n\n“When you look at the fundamentals,” Thurman told Decrypt, “whatever the impact of withdrawals going live is, it's going to play out over a period of weeks and not days.”\n\nThe Ethereum 2.0 upgrade process began in early December 2020 with the launch of the Beacon Chain, a parallel blockchain to Ethereum responsible for managing the staking process. Validators were required to stake 32 ETH to operate their own nodes and ensure the continual supply of blocks by processing transactions and maintaining the network.\n\nIt's happening 🎊 Shapella is scheduled on mainnet for epoch 194048, scheduled for 22:27:35 UTC on Apr. 12, 2023 📆 Client releases compatible with the upgrade are listed in the announcement below 👇https://t.co/I0hSv9lnjz — timbeiko.eth ☀️ (@TimBeiko) March 28, 2023\n\nTo supplement demand, third-party decentralized platforms such as Lido Finance also let users stake their ETH without the need to manage their own validator nodes. In exchange for depositing ETH into the Lido Finance smart contract, users received a staked version of their ETH—an ERC-20 token known as stETH.\n\nStory continues\n\nThe amount of stETH a user received was equivalent to the amount of ETH they deposited, and the value of stETH remained pegged (albeit with fluctuations) to the value of ETH.\n\nIn the wake of the Shanghai upgrade, Thurman believes that the “value proposition of projects like Lido will slightly alter, but ultimately won’t change significantly.”\n\n“Being able to use your staked ETH as a form of collateral in DeFi is hugely important for anybody who's pursuing any kind of sophisticated interest or yield bearing strategy,” he said. “So, there's still definitely a role for those tokens. But I think liquidity becomes slightly less important because withdrawals are open.”\n\nHow much is staked?\n\nTo date, more than 18 million ETH—that’s about $33.6 billion worth—has been staked and locked into the Beacon Chain across 564,000 validators. The current annual percentage yield (APR) for validators is 4.4%, providing an interest-like return for stakers.\n\nThurman described Ethereum’s two-year journey to proof-of-stake as a \"monumental event in the history of open source software,” and declared that drawing comparisons to a “plane changing engine midair is not much of an overstatement.”\n\nAs users look towards the withdrawal window opening next week, questions are being raised as to the expected timeline for accessing their funds.\n\nAccording to the Ethereum Foundation, a maximum amount of 16 withdrawals can be processed within a single block, totalling a maximum output of 115,200 per day. Today, there are 564,000 validators on Ethereum’s Beacon Chain.\n\nEthereum, LSD Tokens on the Rise Ahead of Next Week's Shanghai Upgrade\n\nIn theory, it would take about five days to process all withdrawals. Demand requests will almost certainly extend this timeline, however. Coinbase, for instance, announced that it “may take the protocol weeks to months [to] process unstaking requests.” Lido has said it could be early-to-mid May before it unlocks withdrawals, due to security audits.\n\nAlex Esin, CEO of P2P.org—an institutional staking provider with more than $1.2 billion worth of staked assets—told Decrypt that he’s “not expecting to see a massive withdrawal spike” following the upgrade.\n\n“Many who have already staked on the Beacon Chain have a high risk tolerance, and are not holding out for the withdrawal date,” he assessed. Esin added that stakers must weigh the prospect of withdrawing “against the growth expected from the Ethereum ecosystem and ETH strength expected over the next year.”\n\nEven if there’s a rush to withdraw staked funds, Thurman said that much of that ETH may ultimately be re-staked so that holders can continue earning rewards. Exactly how much may be re-staked, however, is difficult to assess at this point.\n\n“It’s like throwing darts,” Thurman said. “That’s why it's so much fun to debate on Twitter—because people just genuinely don't know.”"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vZGVjcnlwdC5jby8xMjU3MzEvc3Rha2VkLWV0aGVyZXVtLXdpdGhkcmF3YWxzLWNvdWxkLXRha2Utd2Vla3MtYWZ0ZXItc2hhbmdoYWktdXBncmFkZS1hbmFseXN00gFraHR0cHM6Ly9kZWNyeXB0LmNvLzEyNTczMS9zdGFrZWQtZXRoZXJldW0td2l0aGRyYXdhbHMtY291bGQtdGFrZS13ZWVrcy1hZnRlci1zaGFuZ2hhaS11cGdyYWRlLWFuYWx5c3Q_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Staked Ethereum Withdrawals Could Take Weeks After Shanghai Upgrade: Analyst - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum shifted to a more energy-efficient proof-of-stake model in September, but there’s still one upgrade that needs to be completed to let users unstake their ETH from the network. It's coming up next week—but the process could ultimately take weeks to complete, an analyst at crypto data platform Nansen told Decrypt.\n\nFollowing September's merge event, Ethereum's transition will conclude with the launch of the Shanghai upgrade on April 12, which is paired with another upgrade called Capella.\n\nThe upgrades are hotly anticipated by users who staked ETH in the network—either as individual validators or through platforms like Lido Finance and Rocket Pool—as they will soon be able to withdraw their assets and accumulated rewards.\n\nAD\n\nAD\n\nBut Ethereum users may not be able to withdraw their funds immediately, or all at once. According to Andrew Thurman, a data analyst at Nansen, the length of the withdrawal queue could result in users having to wait several weeks to withdraw their funds.\n\n“When you look at the fundamentals,” Thurman told Decrypt, “whatever the impact of withdrawals going live is, it's going to play out over a period of weeks and not days.”\n\nThe Ethereum 2.0 upgrade process began in early December 2020 with the launch of the Beacon Chain, a parallel blockchain to Ethereum responsible for managing the staking process. Validators were required to stake 32 ETH to operate their own nodes and ensure the continual supply of blocks by processing transactions and maintaining the network.\n\nIt's happening 🎊 Shapella is scheduled on mainnet for epoch 194048, scheduled for 22:27:35 UTC on Apr. 12, 2023 📆 Client releases compatible with the upgrade are listed in the announcement below 👇https://t.co/I0hSv9lnjz — timbeiko.eth ☀️ (@TimBeiko) March 28, 2023\n\nTo supplement demand, third-party decentralized platforms such as Lido Finance also let users stake their ETH without the need to manage their own validator nodes. In exchange for depositing ETH into the Lido Finance smart contract, users received a staked version of their ETH—an ERC-20 token known as stETH.\n\nAD\n\nAD\n\nThe amount of stETH a user received was equivalent to the amount of ETH they deposited, and the value of stETH remained pegged (albeit with fluctuations) to the value of ETH.\n\nIn the wake of the Shanghai upgrade, Thurman believes that the “value proposition of projects like Lido will slightly alter, but ultimately won’t change significantly.”\n\n“Being able to use your staked ETH as a form of collateral in DeFi is hugely important for anybody who's pursuing any kind of sophisticated interest or yield bearing strategy,” he said. “So, there's still definitely a role for those tokens. But I think liquidity becomes slightly less important because withdrawals are open.”\n\nHow much is staked?\n\nTo date, more than 18 million ETH—that’s about $33.6 billion worth—has been staked and locked into the Beacon Chain across 564,000 validators. The current annual percentage yield (APR) for validators is 4.4%, providing an interest-like return for stakers.\n\nThurman described Ethereum’s two-year journey to proof-of-stake as a \"monumental event in the history of open source software,” and declared that drawing comparisons to a “plane changing engine midair is not much of an overstatement.”\n\nAs users look towards the withdrawal window opening next week, questions are being raised as to the expected timeline for accessing their funds.\n\nAccording to the Ethereum Foundation, a maximum amount of 16 withdrawals can be processed within a single block, totalling a maximum output of 115,200 per day. Today, there are 564,000 validators on Ethereum’s Beacon Chain.\n\nIn theory, it would take about five days to process all withdrawals. Demand requests will almost certainly extend this timeline, however. Coinbase, for instance, announced that it “may take the protocol weeks to months [to] process unstaking requests.” Lido has said it could be early-to-mid May before it unlocks withdrawals, due to security audits.\n\nAD\n\nAD\n\nAlex Esin, CEO of P2P.org—an institutional staking provider with more than $1.2 billion worth of staked assets—told Decrypt that he’s “not expecting to see a massive withdrawal spike” following the upgrade.\n\n“Many who have already staked on the Beacon Chain have a high risk tolerance, and are not holding out for the withdrawal date,” he assessed. Esin added that stakers must weigh the prospect of withdrawing “against the growth expected from the Ethereum ecosystem and ETH strength expected over the next year.”\n\nEven if there’s a rush to withdraw staked funds, Thurman said that much of that ETH may ultimately be re-staked so that holders can continue earning rewards. Exactly how much may be re-staked, however, is difficult to assess at this point.\n\n“It’s like throwing darts,” Thurman said. “That’s why it's so much fun to debate on Twitter—because people just genuinely don't know.”"
    }
]