[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA3LzIwL2FuY2llbnQtZXRoZXJldW0td2hhbGUtY29tZXMtYWxpdmUtbW92ZXMtMTE2MDAwMDAwLWluLWV0aC1hdC1vdmVyLTYxNjAwMC1wcm9maXQv0gF1aHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDcvMjAvYW5jaWVudC1ldGhlcmV1bS13aGFsZS1jb21lcy1hbGl2ZS1tb3Zlcy0xMTYwMDAwMDAtaW4tZXRoLWF0LW92ZXItNjE2MDAwLXByb2ZpdC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jul 2023 07:00:00 GMT",
        "title": "Ancient Ethereum Whale Comes Alive, Moves $116,000,000 in ETH at Over 616,000% Profit - The Daily Hodl",
        "content": "A mysterious wallet address that has existed since Ethereum’s (ETH) inception has just moved its entire ETH stash after lying low for about eight years.\n\nAccording to blockchain tracker Lookonchain, the Ethereum whale received 61,216 ETH on July 30th of 2015 after participating in the second-largest crypto asset’s initial coin offering (ICO) the prior year.\n\nHours ago the whale transferred the entire ETH holdings to an address the blockchain tracker has identified as belonging to Kraken, a cryptocurrency exchange.\n\nThe blockchain tracker says that the whale received the ETH from Ethereum’s Genesis contract at an approximate cost of $0.31, translating to a profit of approximately 616,029% in about eight years. The entire ETH holding, which is now worth around $116.9 million, cost the whale slightly less than $19,000 at the time of the ICO.\n\nEthereum is trading at $1,910 at time of writing.\n\nWhile the mysterious wallet now holds zero Ethereum, there are numerous other tokens that it owns.\n\nDuring Ethereum’s ICO more than 50 million ETH were sold raising around $17.3 million at the time. Some of the proceeds went to the nonprofit Ethereum Foundation while a portion was allocated to the crypto asset’s founding team.\n\nA similar transfer of Ethereum by a hitherto dormant whale of coins acquired during the crypto asset’s early days occurred in April. Then, the whale moved 2,635 ETH at an equally eye-popping profit of 594,000%.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerate Image: Midjourney"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLW1pbmVyLWhpdmUtdXNpbmctb2xkLTE3NTA1Nzk2Ny5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Miner Hive Is Using Old Ethereum Rigs and AI to Make Ordinals Art - Yahoo Finance",
        "content": "Canadian crypto miner HIVE Digital Technologies wants to use Ordinals in one of its AI initiatives, inscribing generative art on Bitcoin’s blockchain with the help of old Ethereum mining rigs.\n\nHIVE CEO Aydin Kilic described the project as an exercise in technical prowess for one of crypto’s largest miners. He told Decrypt that Ordinals provides a new way for the firm to use its fleet of data-center-grade Nvidia GPUs, which it’s been using to mine altcoins after Ethereum switched to proof-of-stake during the “merge” and made miners obsolete.\n\n“We will create generative AI art with our own GPUs, on our own fine-tuned model of Stable Diffusion, [...] and then use our hash power on the Bitcoin network to inscribe those on the Bitcoin blockchain,” he said.\n\nWhat Is 'The Merge'? Ethereum’s Move to Proof of Stake\n\nOrdinals launched earlier this year, and the buzzy Bitcoin protocol has led to a wave of innovation with crypto’s oldest coin. As a way for people to create NFT-like assets on Bitcoin by “inscribing” data on individual satoshi, equal to 1/100,000,000 of a whole Bitcoin, Ordinals has also been a significant windfall for Bitcoin miners that benefit from elevated transaction fees.\n\nEven though Bitcoin transaction fees from Ordinals inscriptions have cooled over the past couple of months—fervor surrounding BRC-20 tokens, which are built on top of Bitcoin using Ordinals, sent them sky high—Kilic said HIVE is definitely “still leaning into them.”\n\nKilic compared the initiative to jet fighter squadrons like the Blue Angels who show off their skills by flying in tight formations. He described HIVE’s project as ambitious because it taps so many different segments of HIVE’s business, including its cloud computing platforms and custom versions of AI models like Stable Diffusion.\n\nBitcoin Mining Revenue Hits $184 Million in Q2 Amid Ordinals Fervor\n\n“We want to do a soup-to-nuts AI and Ordinals project that’s fully integrated,” he said. “It’s a reflection of our core competencies as a technology leader in the AI and Bitcoin space.”\n\nStory continues\n\nAside from creating a digital art pipeline, Kilic said HIVE is working with its custody providers to start transacting uncommon sats found through Ordinals. Uncommon sats, which are valued at a premium, are the first sat of each Bitcoin block. Kilic said HIVE has 272 of them. Sat is a common abbreviation for satoshi, the smallest denomination of Bitcoin that data is inscribed on.\n\nWhen Ethereum shifted to proof-of-stake last year, it changed the way that transactions are verified on the network and greatly reduced its energy consumption. With Bitcoin, miners use large amounts of energy to verify transactions through proof-of-work.\n\nEthereum Energy Usage, Carbon Footprint Down 99.99% After Merge: Report\n\nAfter Ethereum’s transition to proof-of-stake, HIVE said it was exploring alternatives to Ethereum mining. Developing a generative art pipeline using new technologies fits into HIVE’s overall corporate strategy of maximizing resources, Kilic said.\n\nHIVE went public in 2017 and trades on the TSX Venture Exchange in Canada under the HIVE.V symbol. It has also traded on the Nasdaq since 2021 under the HIVE symbol. Shares of HIVE currently change hands at $5.66, and the company has a market capitalization of around $477 million.\n\nEchoing comments made by MicroStrategy co-founder and executive chairman Michael Saylor, who said Ordinals holds potential in the realm of app development, Kilic said the protocol enables companies like HIVE to experiment with Bitcoin in previously unimagined ways.\n\n“I think that it’s unleashing a whole new era,” Kilic said. “We're all super supportive of it.”"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9pbnRyb2R1Y2luZy1iaXRyb2NrLXJldm9sdXRpb25hcnktZXRoZXJldW0taWJmdC0yMDAwMDA2MjMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jul 2023 07:00:00 GMT",
        "title": "Introducing Bitrock - A Revolutionary Ethereum IBFT 2.0 Side Chain with Multichain DEX Swap - Yahoo Finance",
        "content": "Bitrock\n\nROERMOND, NETHERLANDS , July 20, 2023 (GLOBE NEWSWIRE) -- Bitrock , an Ethereum IBFT 2.0 Proof of Authority (PoA) side chain, is pleased to announce its official launch as a game-changing layer 2 solution in the blockchain industry. The platform provides near-zero native gas fees and lightning-speed block times, making it a cost-effective, scalable, and high-speed infrastructure for users. Additionally, Bitrock's revolutionary multichain DEX swap allows seamless trading of cryptocurrencies directly on their native chains without the need for gas fees or holding native chain tokens.\n\nStealth Launch and Unique Offering\n\nUnlike many other side chains that suffer from limitations in speed, scalability, and cost, Bitrock emerges as a comprehensive and innovative Ethereum side chain solution. What sets Bitrock apart is its unique approach to a multichain DEX swap, enabling users to trade cryptocurrencies directly on their native chains without the need for additional intermediaries. Bitrock also stands out as a highly attractive investment opportunity due to its lack of private sales, large-raise presales, or VC backing, making it accessible to a wider retail investor demographic.\n\nImpressive Launch and Key Features\n\nFollowing rigorous Testnet testing, Bitrock launched its live Testnet, and just three days later, released the Mainnet with an impressive 2-second block time and near-zero gas fees. This achievement redefines transaction speed and cost norms for native chains, promising an efficient and user-friendly experience. In partnership with Sphynx labs, Bitrock will soon introduce a chain bridge to facilitate the seamless conversion of ERC-20 BROCK tokens to native BROCK. Moreover, the team is diligently working on the development of an innovative multichain DEX swap that aims to further enhance user convenience and reduce gas fees.\n\nBuild on Bitrock: The Future of Blockchain\n\nBitrock is designed to be fast, secure, scalable, and EVM-compatible, providing a solid foundation for smart contract deployment. With its remarkable 2-second block time, the platform ensures high transaction throughput while keeping gas fees negligibly low (~0.000001 GWEI). This makes Bitrock a top choice for developers seeking a cost-effective and user-friendly environment for building decentralized applications.\n\nStory continues\n\nTokenomics: Building a Sustainable Ecosystem\n\nBitrock's tokenomics are carefully crafted to foster a thriving and economically sound ecosystem. With a total token supply of 100,000,000, the platform implements a 4% tax distribution on both buying and selling transactions. Out of this tax, 3% goes towards development to fuel ongoing advancements and innovations, while 1% is allocated to liquidity to ensure a stable and liquid market for its users. These measures are aimed at promoting sustainability, encouraging growth, and providing a solid foundation for Bitrock's continued success in the blockchain space.\n\nLucrative Staking Opportunities\n\nBitrock also offers attractive staking opportunities for token holders, providing a substantial APY (Annual Percentage Yield) with a lock-up time of only 7 days. Staking Bitrock on the Ethereum network rewards users with an impressive 90% APY, allowing for flexible reward claims while ensuring security and long-term stability.\n\nRobust Ecosystem & Tools\n\nBitrock boasts a rich ecosystem of tools and services to enhance user experience and support developers. This ecosystem includes a comprehensive Network Explorer that indexes and tracks all blockchain activities, a user-friendly Swap/DEX for seamless token trading, a Token Builder dApp to create and launch BROCK-20 tokens effortlessly, and a vibrant NFT Marketplace that brings NFT buyers and sellers together on a single platform with attractive staking opportunities.\n\nJoin the Bitrock Revolution\n\nBitrock is now live and publicly accessible, supporting all EVM deployments and tools such as Metamask, Truffle, and Ethereum Bytecodes. The team behind Bitrock is highly competent, motivated, and dedicated to pushing the boundaries of Ethereum L2 solutions to achieve unprecedented cost-effectiveness, convenience, scalability, and speed.\n\nFor more information about Bitrock and its groundbreaking features, visit the official website at https://bit-rock.io/ .\n\nAbout Bitrock\n\nBitrock is an Ethereum IBFT 2.0 Proof of Authority (PoA) side chain with near-zero native gas fees and lightning-speed block times. The platform offers a unique multichain DEX swap, enabling direct trading of cryptocurrencies on their native chains without gas fees. Bitrock is committed to delivering a cost-effective, scalable, and high-speed infrastructure while providing attractive staking opportunities to token holders.\n\nWebsite | Twitter | Telegram | Discord | Uniswap | DEXTools | Whitepaper\n\n\n\nhttps://t.me/Bitrockchain\n\n\n\n\n\nDisclaimer:\n\nThreads-coin is in no way affiliated or associated with Threads by Meta. The information provided in this release is not investment advice, financial advice, or trading advice. It is recommended that you practice due diligence (including consultation with a professional financial advisor) before investing or trading securities and cryptocurrency.\n\n\n\n\n\nCONTACT: Kevin Kuiper Bitrock info at bit-rock.io\n\n\n\n"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9pbnRyb2R1Y2luZy1iaXRyb2NrLXJldm9sdXRpb25hcnktZXRoZXJldW0taWJmdC0yMDAwMDA2MjMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jul 2023 07:00:00 GMT",
        "title": "Introducing Bitrock - A Revolutionary Ethereum IBFT 2.0 Side Chain with Multichain DEX Swap - Yahoo Finance",
        "content": "Bitrock\n\nROERMOND, NETHERLANDS , July 20, 2023 (GLOBE NEWSWIRE) -- Bitrock , an Ethereum IBFT 2.0 Proof of Authority (PoA) side chain, is pleased to announce its official launch as a game-changing layer 2 solution in the blockchain industry. The platform provides near-zero native gas fees and lightning-speed block times, making it a cost-effective, scalable, and high-speed infrastructure for users. Additionally, Bitrock's revolutionary multichain DEX swap allows seamless trading of cryptocurrencies directly on their native chains without the need for gas fees or holding native chain tokens.\n\nStealth Launch and Unique Offering\n\nUnlike many other side chains that suffer from limitations in speed, scalability, and cost, Bitrock emerges as a comprehensive and innovative Ethereum side chain solution. What sets Bitrock apart is its unique approach to a multichain DEX swap, enabling users to trade cryptocurrencies directly on their native chains without the need for additional intermediaries. Bitrock also stands out as a highly attractive investment opportunity due to its lack of private sales, large-raise presales, or VC backing, making it accessible to a wider retail investor demographic.\n\nImpressive Launch and Key Features\n\nFollowing rigorous Testnet testing, Bitrock launched its live Testnet, and just three days later, released the Mainnet with an impressive 2-second block time and near-zero gas fees. This achievement redefines transaction speed and cost norms for native chains, promising an efficient and user-friendly experience. In partnership with Sphynx labs, Bitrock will soon introduce a chain bridge to facilitate the seamless conversion of ERC-20 BROCK tokens to native BROCK. Moreover, the team is diligently working on the development of an innovative multichain DEX swap that aims to further enhance user convenience and reduce gas fees.\n\nBuild on Bitrock: The Future of Blockchain\n\nBitrock is designed to be fast, secure, scalable, and EVM-compatible, providing a solid foundation for smart contract deployment. With its remarkable 2-second block time, the platform ensures high transaction throughput while keeping gas fees negligibly low (~0.000001 GWEI). This makes Bitrock a top choice for developers seeking a cost-effective and user-friendly environment for building decentralized applications.\n\nStory continues\n\nTokenomics: Building a Sustainable Ecosystem\n\nBitrock's tokenomics are carefully crafted to foster a thriving and economically sound ecosystem. With a total token supply of 100,000,000, the platform implements a 4% tax distribution on both buying and selling transactions. Out of this tax, 3% goes towards development to fuel ongoing advancements and innovations, while 1% is allocated to liquidity to ensure a stable and liquid market for its users. These measures are aimed at promoting sustainability, encouraging growth, and providing a solid foundation for Bitrock's continued success in the blockchain space.\n\nLucrative Staking Opportunities\n\nBitrock also offers attractive staking opportunities for token holders, providing a substantial APY (Annual Percentage Yield) with a lock-up time of only 7 days. Staking Bitrock on the Ethereum network rewards users with an impressive 90% APY, allowing for flexible reward claims while ensuring security and long-term stability.\n\nRobust Ecosystem & Tools\n\nBitrock boasts a rich ecosystem of tools and services to enhance user experience and support developers. This ecosystem includes a comprehensive Network Explorer that indexes and tracks all blockchain activities, a user-friendly Swap/DEX for seamless token trading, a Token Builder dApp to create and launch BROCK-20 tokens effortlessly, and a vibrant NFT Marketplace that brings NFT buyers and sellers together on a single platform with attractive staking opportunities.\n\nJoin the Bitrock Revolution\n\nBitrock is now live and publicly accessible, supporting all EVM deployments and tools such as Metamask, Truffle, and Ethereum Bytecodes. The team behind Bitrock is highly competent, motivated, and dedicated to pushing the boundaries of Ethereum L2 solutions to achieve unprecedented cost-effectiveness, convenience, scalability, and speed.\n\nFor more information about Bitrock and its groundbreaking features, visit the official website at https://bit-rock.io/ .\n\nAbout Bitrock\n\nBitrock is an Ethereum IBFT 2.0 Proof of Authority (PoA) side chain with near-zero native gas fees and lightning-speed block times. The platform offers a unique multichain DEX swap, enabling direct trading of cryptocurrencies on their native chains without gas fees. Bitrock is committed to delivering a cost-effective, scalable, and high-speed infrastructure while providing attractive staking opportunities to token holders.\n\nWebsite | Twitter | Telegram | Discord | Uniswap | DEXTools | Whitepaper\n\n\n\nhttps://t.me/Bitrockchain\n\n\n\n\n\nDisclaimer:\n\nThreads-coin is in no way affiliated or associated with Threads by Meta. The information provided in this release is not investment advice, financial advice, or trading advice. It is recommended that you practice due diligence (including consultation with a professional financial advisor) before investing or trading securities and cryptocurrency.\n\n\n\n\n\nCONTACT: Kevin Kuiper Bitrock info at bit-rock.io\n\n\n\n"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9pbnRyb2R1Y2luZy1iaXRyb2NrLXJldm9sdXRpb25hcnktZXRoZXJldW0taWJmdC0yMDAwMDA2MjMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jul 2023 07:00:00 GMT",
        "title": "Introducing Bitrock - A Revolutionary Ethereum IBFT 2.0 Side Chain with Multichain DEX Swap - Yahoo Finance",
        "content": "Bitrock\n\nROERMOND, NETHERLANDS , July 20, 2023 (GLOBE NEWSWIRE) -- Bitrock , an Ethereum IBFT 2.0 Proof of Authority (PoA) side chain, is pleased to announce its official launch as a game-changing layer 2 solution in the blockchain industry. The platform provides near-zero native gas fees and lightning-speed block times, making it a cost-effective, scalable, and high-speed infrastructure for users. Additionally, Bitrock's revolutionary multichain DEX swap allows seamless trading of cryptocurrencies directly on their native chains without the need for gas fees or holding native chain tokens.\n\nStealth Launch and Unique Offering\n\nUnlike many other side chains that suffer from limitations in speed, scalability, and cost, Bitrock emerges as a comprehensive and innovative Ethereum side chain solution. What sets Bitrock apart is its unique approach to a multichain DEX swap, enabling users to trade cryptocurrencies directly on their native chains without the need for additional intermediaries. Bitrock also stands out as a highly attractive investment opportunity due to its lack of private sales, large-raise presales, or VC backing, making it accessible to a wider retail investor demographic.\n\nImpressive Launch and Key Features\n\nFollowing rigorous Testnet testing, Bitrock launched its live Testnet, and just three days later, released the Mainnet with an impressive 2-second block time and near-zero gas fees. This achievement redefines transaction speed and cost norms for native chains, promising an efficient and user-friendly experience. In partnership with Sphynx labs, Bitrock will soon introduce a chain bridge to facilitate the seamless conversion of ERC-20 BROCK tokens to native BROCK. Moreover, the team is diligently working on the development of an innovative multichain DEX swap that aims to further enhance user convenience and reduce gas fees.\n\nBuild on Bitrock: The Future of Blockchain\n\nBitrock is designed to be fast, secure, scalable, and EVM-compatible, providing a solid foundation for smart contract deployment. With its remarkable 2-second block time, the platform ensures high transaction throughput while keeping gas fees negligibly low (~0.000001 GWEI). This makes Bitrock a top choice for developers seeking a cost-effective and user-friendly environment for building decentralized applications.\n\nStory continues\n\nTokenomics: Building a Sustainable Ecosystem\n\nBitrock's tokenomics are carefully crafted to foster a thriving and economically sound ecosystem. With a total token supply of 100,000,000, the platform implements a 4% tax distribution on both buying and selling transactions. Out of this tax, 3% goes towards development to fuel ongoing advancements and innovations, while 1% is allocated to liquidity to ensure a stable and liquid market for its users. These measures are aimed at promoting sustainability, encouraging growth, and providing a solid foundation for Bitrock's continued success in the blockchain space.\n\nLucrative Staking Opportunities\n\nBitrock also offers attractive staking opportunities for token holders, providing a substantial APY (Annual Percentage Yield) with a lock-up time of only 7 days. Staking Bitrock on the Ethereum network rewards users with an impressive 90% APY, allowing for flexible reward claims while ensuring security and long-term stability.\n\nRobust Ecosystem & Tools\n\nBitrock boasts a rich ecosystem of tools and services to enhance user experience and support developers. This ecosystem includes a comprehensive Network Explorer that indexes and tracks all blockchain activities, a user-friendly Swap/DEX for seamless token trading, a Token Builder dApp to create and launch BROCK-20 tokens effortlessly, and a vibrant NFT Marketplace that brings NFT buyers and sellers together on a single platform with attractive staking opportunities.\n\nJoin the Bitrock Revolution\n\nBitrock is now live and publicly accessible, supporting all EVM deployments and tools such as Metamask, Truffle, and Ethereum Bytecodes. The team behind Bitrock is highly competent, motivated, and dedicated to pushing the boundaries of Ethereum L2 solutions to achieve unprecedented cost-effectiveness, convenience, scalability, and speed.\n\nFor more information about Bitrock and its groundbreaking features, visit the official website at https://bit-rock.io/ .\n\nAbout Bitrock\n\nBitrock is an Ethereum IBFT 2.0 Proof of Authority (PoA) side chain with near-zero native gas fees and lightning-speed block times. The platform offers a unique multichain DEX swap, enabling direct trading of cryptocurrencies on their native chains without gas fees. Bitrock is committed to delivering a cost-effective, scalable, and high-speed infrastructure while providing attractive staking opportunities to token holders.\n\nWebsite | Twitter | Telegram | Discord | Uniswap | DEXTools | Whitepaper\n\n\n\nhttps://t.me/Bitrockchain\n\n\n\n\n\nDisclaimer:\n\nThreads-coin is in no way affiliated or associated with Threads by Meta. The information provided in this release is not investment advice, financial advice, or trading advice. It is recommended that you practice due diligence (including consultation with a professional financial advisor) before investing or trading securities and cryptocurrency.\n\n\n\n\n\nCONTACT: Kevin Kuiper Bitrock info at bit-rock.io\n\n\n\n"
    }
]