[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDIvMjgvc2Vjb25kLWV0aGVyZXVtLXRlc3RuZXQtc3VjY2Vzc2Z1bGx5LXNpbXVsYXRlcy1zaGFuZ2hhaS1oYXJkLWZvcmsv0gFvaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wMi8yOC9zZWNvbmQtZXRoZXJldW0tdGVzdG5ldC1zdWNjZXNzZnVsbHktc2ltdWxhdGVzLXNoYW5naGFpLWhhcmQtZm9yay9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Second Ethereum Testnet Successfully Simulates Shanghai Hard Fork - CoinDesk",
        "content": "The final testnet upgrade will occur to Goerli sometime in the coming weeks. That would be the final dress rehearsal before the main blockchain is able to process staked ETH withdrawals. Goerli’s testing will also be the most anticipated given that it is the biggest testnet of the three and it mimics the main Ethereum blockchain’s activity most closely."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy93aW5uaW5nLWRvb2tleS1kYXNoLWtleS1uZnQtMjI0MDA0NzI1Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Winning 'Dookey Dash' Key NFT Sells to Billionaire for $1.63 Million in Ethereum - Yahoo Finance",
        "content": "Esports player Kyle “Mongraal” Jackson has sold his winning “Dookey Dash” key NFT to billionaire entrepreneur Adam Weitsman for 1,000 ETH, or $1.63 million, the 18-year-old gamer announced Monday. Mongraal had previously listed the key NFT for sale for 3,333 ETH, which is equivalent to $5.43 million.\n\n“Super nice guy and thrilled the sale went through with him,” Mongraal said of the sale to Weitsman.\n\nI have agreed to sell the key for 1000 ETH to @AdamWeitsman. Super nice guy and thrilled the sale went through with him. A special thank you to @yugalabs for hosting an incredible competition. I look forward to competing in future events. Royalties will be paid in full.\n\n1/2 — Mongraal (@Mongraal) February 27, 2023\n\n“A special thank you to Yuga Labs for hosting an incredible competition. I look forward to competing in future events. Royalties will be paid in full,” the content creator added.\n\nThis means “Dookey Dash” creators Yuga Labs will receive 5% of the sale in royalties, which will be a noteworthy 50 ETH, or $81,500.\n\nMongraal enlisted the help of a Stanford grad and cofounder of NFT community Underground who goes by “Tre” online to help him with the sale.\n\n“I helped with negotiations with interested bidders,” Tre told Decrypt via Twitter DM. “Just wanted to help make sure he was getting the right price the key deserved.”\n\nLast week, the Web3 community UpDAO placed a bid for 690 WETH on the asset, which at the time was about $1.1 million. Meme site 9GAG later placed a 999 ETH bid on the key but was ultimately outbid by Weitsman, who currently sports a Bored Ape Yacht Club (BAYC) NFT as his Twitter profile picture.\n\nWhile Weitsman may be most known for his scrap metal businesses and massive social media following, the billionaire is also fond of cryptocurrency and started a crypto mining business, Viridium, in 2021.\n\nMongraal has not yet responded to Decrypt’s requests for comment."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy93aW5uaW5nLWRvb2tleS1kYXNoLWtleS1uZnQtMjI0MDA0NzI1Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Winning 'Dookey Dash' Key NFT Sells to Billionaire for $1.63 Million in Ethereum - Yahoo Finance",
        "content": "Esports player Kyle “Mongraal” Jackson has sold his winning “Dookey Dash” key NFT to billionaire entrepreneur Adam Weitsman for 1,000 ETH, or $1.63 million, the 18-year-old gamer announced Monday. Mongraal had previously listed the key NFT for sale for 3,333 ETH, which is equivalent to $5.43 million.\n\n“Super nice guy and thrilled the sale went through with him,” Mongraal said of the sale to Weitsman.\n\nI have agreed to sell the key for 1000 ETH to @AdamWeitsman. Super nice guy and thrilled the sale went through with him. A special thank you to @yugalabs for hosting an incredible competition. I look forward to competing in future events. Royalties will be paid in full.\n\n1/2 — Mongraal (@Mongraal) February 27, 2023\n\n“A special thank you to Yuga Labs for hosting an incredible competition. I look forward to competing in future events. Royalties will be paid in full,” the content creator added.\n\nThis means “Dookey Dash” creators Yuga Labs will receive 5% of the sale in royalties, which will be a noteworthy 50 ETH, or $81,500.\n\nMongraal enlisted the help of a Stanford grad and cofounder of NFT community Underground who goes by “Tre” online to help him with the sale.\n\n“I helped with negotiations with interested bidders,” Tre told Decrypt via Twitter DM. “Just wanted to help make sure he was getting the right price the key deserved.”\n\nLast week, the Web3 community UpDAO placed a bid for 690 WETH on the asset, which at the time was about $1.1 million. Meme site 9GAG later placed a 999 ETH bid on the key but was ultimately outbid by Weitsman, who currently sports a Bored Ape Yacht Club (BAYC) NFT as his Twitter profile picture.\n\nWhile Weitsman may be most known for his scrap metal businesses and massive social media following, the billionaire is also fond of cryptocurrency and started a crypto mining business, Viridium, in 2021.\n\nMongraal has not yet responded to Decrypt’s requests for comment."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vZGVjcnlwdC5jby8xMjIyNDYvZXRoZXJldW0tZGV2ZWxvcGVycy1sZXQtZ29lcmxpLXRlc3RuZXQtc2xvd2x5LWRpZS1jb2luLXByaWNlLXNvYXJz0gFiaHR0cHM6Ly9kZWNyeXB0LmNvLzEyMjI0Ni9ldGhlcmV1bS1kZXZlbG9wZXJzLWxldC1nb2VybGktdGVzdG5ldC1zbG93bHktZGllLWNvaW4tcHJpY2Utc29hcnM_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Ethereum Developers to Let Goerli Testnet ‘Slowly Die’ as Coin Price Soars - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nGETH, the native asset powering the Ethereum testnet Goerli, is soaring. And that’s a problem.\n\nThe testnet token peaked at $1.60 on Saturday and is now trading, according to CoinGecko, at about $0.31—and the fact that a testnet currency is even listed on price-tracking sites is indicative that something has gone wrong.\n\nMore importantly, though, developers are now turning away from testing their apps on it due to the new costs.\n\nAD\n\nAD\n\nEthereum developer ​​Marius van der Wijden told Decrypt that the problem isn't new, saying that after almost a year of discussions on how to fix the GETH supply, the easiest solution is to let Goerli \"slowly die.\"\n\n\"That's the intention with all testnets, they should live for a few years,\" van der Wijden said. \"Afterwards it becomes increasingly hard to sync them, so it's not of much use.\"\n\nAccording to him, the plan is to slowly phase out Goerli while moving users to the Sepolia testnet—which is already running but as a permissioned chain and not yet open for anyone to run a validator node.\n\nLaunched in 2019, Goerli is one of several Ethereum testnets that lets developers safely test their code before deploying them on the Ethereum mainnet. To make the testnet environment as real as possible, it also needed a native gas token. That gas token was freely trickled out via so-called faucets and from validators keeping the testnet alive.\n\nTo speed up distribution to developers, crypto project LayerZero enabled trading between mainnet and Goerli to help developers. This move had the side effect of turning GETH into the subject of rampant speculation.\n\nAD\n\nAD\n\nAs for alternatives, other Ethereum developers, such as Tim Beiko, are proposing a new testnet called Holli, which aims to make it easier for developers to acquire testnet ETH and reduce the need for a secondary market."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtcHJpbWVkLWZvci1icmVha291dC1hZ2FpbnN0LWJpdGNvaW4tYnRjLWV4LWFyay1pbnZlc3QtY3J5cHRvLWFuYWx5c3Qtc2F5c9IBamh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtcHJpbWVkLWZvci1icmVha291dC1hZ2FpbnN0LWJpdGNvaW4tYnRjLWV4LWFyay1pbnZlc3QtY3J5cHRvLWFuYWx5c3Qtc2F5cz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) Primed for Breakout Against Bitcoin (BTC), Ex-Ark Invest Crypto Analyst Says - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe former head of crypto analysts at ARK Invest, Chris Burniske, shared his outlook on Ethereum's (ETH) price action against Bitcoin (BTC). According to the expert, after two years of consolidation, the market's main altcoin is ready to make a breakout against the market's main cryptocurrency.\n\nAdvertisement\n\nAfter almost 2 years of consolidation, $ETHBTC is primed for a monthly breakout. pic.twitter.com/btUzBP9Ew5 — Chris Burniske (@cburniske) February 27, 2023\n\nThe last time Ethereum had such a price spike was in May 2021. Then, in just over a month, ETH gained more than 150% against BTC, after having been in consolidation for 931 days beforehand.\n\nIf the outbreak Burniske is talking about really does happen, it can be assumed that it will be smaller than last time, considering that the current consolidation lasts a third of the days of the previous one and, therefore, the amount of accumulated \"energy\" is also lower.\n\nEthereum v. Bitcoin\n\nEqually interesting is whether Ethereum will renew its all-time high against Bitcoin in the event of a potential influx of liquidity into it. Currently, that mark is set at 0.1564 BTC per ETH, which is 123% higher than the current altcoin's price.\n\nFinally, a potential price break will answer the question of how close the \"flippening\" is. There has been talk of Ethereum displacing Bitcoin from the throne of the largest cryptocurrency since the very emergence of the market, but at the moment ETH is still only 43% of BTC in terms of capitalization."
    }
]