[
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmJlbnppbmdhLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5LzIzLzEyLzM2MTc3Nzk1L2JpdGNvaW4tZXRoZXJldW0tcmVjb3JkLWxvc3Nlcy1mdHgtdG9rZW4tYmVjb21lcy10b3AtbG9zZXLSAS1odHRwczovL3d3dy5iZW56aW5nYS5jb20vYW1wL2NvbnRlbnQvMzYxNzc3OTU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin, Ethereum Record Losses; FTX Token Becomes Top Loser - Benzinga",
        "content": "Bitcoin BTC/USD moved lower, with the cryptocurrency prices falling below the $43,000 level on Monday.\n\nEthereum ETH/USD also recorded losses, trading below the key $2,300 mark this morning.\n\nInjective INJ/USD was the top gainer over the prior 24 hours, while FTX Token FTT/USD turned out to be the biggest loser.\n\nAt the time of writing, the global crypto market cap fell to $1.58 trillion, recording a 24-hour decline of 3.2%. BTC was trading lower by 3.6% at $42,218 while ETH fell by around 4.4% to $2,243 on Monday.\n\nHere are the top ten crypto gainers and losers over the past 24 hours:\n\nGainers\n\nInjective INJ/USD\n\nPrice: $22.81\n\n24-hour gain: 20.9%\n\nSynthetix SNX/USD\n\nPrice: $4.62\n\n24-hour gain: 11.5%\n\nAvalanche AVAX/USD\n\nPrice: $36.13\n\n24-hour gain: 10.8%\n\nImmutable IMX/USD\n\nPrice: $2.01\n\n24-hour gain: 10%\n\nBonk BONK/USD\n\nPrice: $0.0000121\n\n24-hour gain: 7%\n\nLosers\n\nFTX Token FTT/USD\n\nPrice: $4.95\n\n24-hour drop: 12.1%\n\nKava KAVA/USD\n\nPrice: $0.7759\n\n24-hour drop: 9.1%\n\nThe Sandbox SAND/USD\n\nPrice: $0.5147\n\n24-hour drop: 9.1%\n\nDecentraland MANA/USD\n\nPrice: $0.4968\n\n24-hour drop: 9%\n\nApeCoin APE/USD\n\nPrice: $1.66\n\n24-hour drop: 8.3%\n\nRead This Next: Alphabet, Best Buy And 2 Other Stocks Insiders Are Selling"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL3d3dy5iZW56aW5nYS5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS8yMy8xMi8zNjE4NDQ2MC93aGF0cy1nb2luZy1vbi13aXRoLWNhcmRhbm8tYWRhcy1kaXAtb3V0cGFjZXMtbG9zc2VzLWluLWJpdGNvaW4tZXRoZXJldW3SAS1odHRwczovL3d3dy5iZW56aW5nYS5jb20vYW1wL2NvbnRlbnQvMzYxODQ0NjA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Dec 2023 08:00:00 GMT",
        "title": "What's Going On With Cardano? ADA's Dip Outpaces Losses In Bitcoin, Ethereum - Benzinga",
        "content": "On Monday afternoon, Cardano ADA/USD experienced a significant decline, dropping over 8% in its 24-hour trading period. In comparison, major cryptocurrencies Bitcoin BTC/USD and Ethereum ETH/USD both saw an over 6% decline in the same timeframe.\n\nWhat Happened: According to CoinGlass, ADA's open interest in the past 24 hours has declined by 14%, signaling an outflow of money from the market.\n\nCrypto analyst, Ali Martinez took to his X handle on Dec.9, pointing out that sell signals can be seen on both the 3-day and 1-day ADA charts marking a potential correction of one to four candlesticks. He went on to add, “This may just be a short-term pullback before #Cardano resumes its uptrend!”\n\nThe Cardano community on Sunday celebrated the 208th birthday of Ada Lovelace, a pioneering mathematician and computer programmer. Her work laid the foundation for modern computing.\n\nWhy It Matters: With a Total Value Locked of $367.87 million, based on DefiLlama data, Cardano has managed its way into the top 10 cryptocurrencies. Notably, ADA has seen a price surge of 32.5% in its last seven-day trading session, peaking at its highest level since June 2022.\n\nThe Cardano Foundation announced the launch of a self-sovereign “Identity Wallet” on Monday for managing self-sovereign identities across Cardano and other blockchain networks. The wallet, which is a W3C-compatible mobile wallet, consists of a mobile application available for iOS and Android.\n\nThe wallet supports multiple identity and credential standards, securely manages digital assets, smooth interactions with DApps on Cardano, reduces barriers to entry for new users, and provides interoperability across various ecosystems.\n\nLast week, Cardano founder Charles Hoskinson tagged rapper 50 Cent on X stating that, “we are both in the same club.” The message received a positive response from the Cardano community.\n\nX Rumors Lead FREYA Rally: Separately, Hoskinson took to his X handle with a picture of his pet dog, Freya, and stated, “Santa Bart is coming for Christmas.” The post unintentionally sparked a trading frenzy in the Freya NFT project.\n\nHe later clarified in another post on X that he was not associated with the Freya project. \"I have nothing to do with fan projects like Freya or other NFT plays. It's flattering that people make artwork about my dog or my life, but I'm not affiliated, have not done any diligence on these projects, and do not endorse them.\"\n\nNow Read: Tesla Cybertruck Early Reservation Spots Fetch Big Bucks On eBay: Would You Pay $10K To Get Yours ASAP?\n\nPhoto: Shutterstock"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS9ldGhlcmV1bS1ldGgtcHJpY2UtYW5hbHlzaXMtd2hhdC10by1leHBlY3QtYWhlYWQtb2YtZmVkLXJhdGVzLWRlY2lzaW9uLTEzOTUxOTDSAWpodHRwczovL2FtcC5meGVtcGlyZS5jb20vZW4vZXRoZXJldW0tZXRoLXByaWNlLWFuYWx5c2lzLXdoYXQtdG8tZXhwZWN0LWFoZWFkLW9mLWZlZC1yYXRlcy1kZWNpc2lvbi8xMzk1MTkw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Dec 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) Price Analysis: What to Expect Ahead of US Fed Rate Decision - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1kaXZlcy10by0yMDAwL9IBRmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1kaXZlcy10by0yMDAwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price Dives To $2,000, Why Dips Remain Attractive - NewsBTC",
        "content": "Ethereum price took a major hit like Bitcoin and dropped over $350. ETH tested the $2,000 support and is currently attempting a fresh increase.\n\nEthereum declined over 8% and broke the $2,200 support zone.\n\nThe price is trading below $2,300 and the 100-hourly Simple Moving Average.\n\nThere was a break below a key bullish trend line with support near $2,340 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could rise again unless there is a close below the $2,100 support zone.\n\nEthereum Price Took A Major Hit\n\nEthereum price climbed further higher above the $2,300 level. ETH even cleared the $2,350 level but the bears remained active near the $2,400 zone. A high was formed near $2,401 and there was a sharp decline like Bitcoin.\n\nThe price declined over 8% and there was a move below the $2,200 level. Besides, there was a break below a key bullish trend line with support near $2,340 on the hourly chart of ETH/USD. The pair even spiked below the $2,000 support before the bulls appeared.\n\nA low was formed near $1,980 and the price is now attempting a recovery wave. There was a move above the $2,150 and $2,180 levels. The price climbed above the 50% Fib retracement level of the downward move from the $2,401 swing high to the $1,980 low.\n\nSource: ETHUSD on TradingView.com\n\nOn the upside, the price is facing resistance near the $2,275 zone. The next key resistance is near the $2,300 level or the 76.4% Fib retracement level of the downward move from the $2,401 swing high to the $1,980 low. A clear move above the $2,300 zone could send the price toward the $2,400 level. The next resistance sits at $2,450. Any more gains could start a wave toward the $2,500 level.\n\nAnother Decline in ETH?\n\nIf Ethereum fails to clear the $2,300 resistance, it could start another decline. Initial support on the downside is near the $2,180 level.\n\nThe next key support is $2,120. The main support is now near $2,100. A downside break below $2,200 might start an extended decline. The key support is now at $2,000, below which there is a risk of a move toward the $1,880 level in the near term.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 30 level.\n\nMajor Support Level – $2,100\n\nMajor Resistance Level – $2,300\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmNjbi5jb20vYW5hbHlzaXMvYml0Y29pbi1ldGhlcmV1bS1kcm9wLXRyYWRlcnMtZ2V0LWxpcXVpZGF0ZWQtbWFya2V0LXJldmVyc2FsL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin and Ethereum Drop As Traders Get Liquidated -- Is The Market Headed For a Reversal? - CCN.com",
        "content": "Key Takeaways\n\nOver $400 million worth of positions liquidated in the last 24 hours across BTC and ETH.\n\nBitcoin and Ethereum decreased by 11% as key resistance was reached.\n\nA Bull market correction might have started.\n\nThe price of Bitcoin reached $45,000 on December 5 and stayed there until yesterday, December 10, when it made a downturn. It fell to $40,335 at its lowest point as the week began, marking a decrease of 11%. On the other hand, Ethereum made its yearly high of $2,400 on December 9 after a downturn to $2,145, which is an 11% decrease as well.\n\nConsequently, we saw a larger amount of long positions getting liquidated. According to CoinGlass data, in the past 24 hours, 113,881 traders were liquidated, and the total liquidations came in at $403.96 million.\n\nMost were long positions with $348.62 million compared to only $55.52 million. With the prices getting overextended in the previous period and now seeing significant declines, is this an early sign of market weakness?\n\nBTC Price Analysis\n\nThe price of Bitcoin rose by 76% since its September 11 low of around $25,000. This is the start of the ending wave from the larger uptrend that started on November 21 last year.\n\nIn our previous analysis, we called for an interaction with the $45,000 area as the next significant resistance, and judging by today’s rejection, it has proven to serve as such. Analyzing the wave structure in the last advancement from November 6, it seems there might be another minor attempt to continue its upward trajectory.\n\nIt came slightly short from the interaction with the level, so an upward spike above it would look likely, but it ended as a wick and quickly snapped back below it. The rise ended as it is, and now the first bull phase correction has started.\n\nIn any case, this correction will be awaited shortly, and from the current downward movement, we will see if it has already begun. This ABC correction should bring the price of Bitcoin to the $25,000 area optimally but could go lower.\n\nETH Price Analysis\n\nWhat’s been said for Bitcoin applies to Ethereum as well. Its price was in an ascending structure from June 18 last year and most likely marked the completion of the leading diagonal, moving upward in a five-wave manner.\n\nDecember 9 high was an interaction with its ascending resistance level and ended as a rejection, displaying the same behavior as it did on two previous occasions. There could be another minor high ahead, but this chance is slim.\n\nMore likely, we saw the completion of this larger uptrend, and it is now headed to its first bull-significant correction. If so, ETH could now be sent to the $1,500 area in an ABC correction or to $1,400 if it reaches its optimal Fibonacci retracement level of 0.618.\n\nConclusion\n\nThe cryptocurrency market has continuously grown since November last year and recovered significantly, showing promising signs of a starting bull market. However, before it can continue sustainably, it must establish higher support and form its first higher low.\n\nThese higher lows are the corrections we have outlined in our price chart analysis and are referred to as higher price points compared to the lows of November last year when the larger uptrend started.\n\nAs the prices are getting overextended and we are approaching the holiday season, the euphoria might cause the market to continue or attempt to rise for another push, but these corrections are imminent.\n\nDisclaimer\n\nPlease note that the contents of this article are not financial or investing advice. The information provided in this article is the author’s opinion only and should not be considered as offering trading or investing recommendations. We do not make any warranties about the completeness, reliability and accuracy of this information. The cryptocurrency market suffers from high volatility and occasional arbitrary movements. Any investor, trader, or regular crypto users should research multiple viewpoints and be familiar with all local regulations before committing to an investment."
    }
]