[
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMi8wMi90b3AtZXRoZXJldW0tZXRoLXdhbGxldHMtZm9ybWluZy1hbi1lbmNvdXJhZ2luZy1wYXR0ZXJuLWFjY29yZGluZy10by1jcnlwdG8tYW5hbHl0aWNzLWZpcm0tc2FudGltZW50L9IBigFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMi8wMi90b3AtZXRoZXJldW0tZXRoLXdhbGxldHMtZm9ybWluZy1hbi1lbmNvdXJhZ2luZy1wYXR0ZXJuLWFjY29yZGluZy10by1jcnlwdG8tYW5hbHl0aWNzLWZpcm0tc2FudGltZW50L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Dec 2023 08:00:00 GMT",
        "title": "Top Ethereum (ETH) Wallets Forming an ‘Encouraging Pattern,’ According to Crypto Analytics Firm Santiment - The Daily Hodl",
        "content": "Leading crypto analytics firm Santiment says the largest non-exchange Ethereum (ETH) wallets are gobbling up the second-largest digital asset at record rates.\n\nSantiment says Ethereum wallets are “forming an encouraging pattern.”\n\nThe analytics firm notes that the 10 largest non-exchange Ethereum wallets now hold more than 41 million ETH for the first time ever, while the 10 largest exchange wallets now hold only 8 million ETH, a six-month low.\n\n“More and more coins continue moving to self-custody.”\n\nETH is trading at $2,085 at time of writing and is up 2.26% in the past 24 hours and nearly 13% in the past month.\n\nNot all of Ethereum’s metrics look bullish, however. Crypto trader Ali Martinez tells his 34,100 Twitter followers on the social media platform X to pay attention to the Tom DeMark (TD) Sequential indicator.\n\nThe TD Sequential indicator is used by traders to predict potential trend reversals based on the closing prices of the 13 previous bars or candles.\n\nSays Martinez,\n\n“The TD Sequential’s track record speaks volumes! Its accuracy in predicting ETH’s price movements on the four-hour chart is noteworthy.\n\nCurrently, it’s flashing a sell signal at a key resistance level. Should this signal hold true, we may see ETH retracting and heading toward $2,000.”\n\nDespite its recent gains, ETH remains more than 57% down from its all-time high of $4,878, which it hit in November 2021.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vdS50b2RheS9zb2xhbmEtc29sLWV4Y2VlZHMtZXRoZXJldW0tbDJzLWJ5LXRyYWRpbmctdm9sdW1lLWRhdGEtc2F5c9IBT2h0dHBzOi8vdS50b2RheS9zb2xhbmEtc29sLWV4Y2VlZHMtZXRoZXJldW0tbDJzLWJ5LXRyYWRpbmctdm9sdW1lLWRhdGEtc2F5cz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Dec 2023 08:00:00 GMT",
        "title": "Solana (SOL) Exceeds Ethereum L2s by Trading Volume, Data Says - U.Today",
        "content": "Advertisement\n\nTraders and analysts are discussing the roots of the \"New Solana Summer\" as all core metrics of on-chain activity are rocketing. Some of them have already reached pre-FTX collapse levels. NFTs and meme coin segments might be contributing to this upsurge, data says.\n\nSolana (SOL) exceeds Polygon (MATIC), Optimism (OP) by transactional volume\n\nIn early December 2023, the aggregated on-chain trading volume on the Solana (SOL) blockchain surged above $240 million per day in equivalent. As such, the blockchain managed to surpass both Polygon (MATIC) and Optimism (OP), two mainstream Ethereum-based L2s by this indicator.\n\nImage by DefiLlama\n\nIn the first days of December, Polygon (MATIC) and Optimism (OP) demonstrate trading volumes of $137 million and $40 million per day, respectively. As such, Solana (SOL) processes more money on-chain than they do combined.\n\nAlso, in the last 24 hours, Solana (SOL) exceeded its another rival Avalanche (AVAX) by net value locked in dApps. Solana's dApp ecosystem is responsible for $688 million in TVL, Avalanche (AVAX) dApps logged $660 million. At that pace, Solana (SOL) might surpass the TVLs of Polygon (MATIC) and Optimism (OP) in the coming days.\n\nIn the last month, Solana's (SOL) TVL added over 60%, while the SOL price soared by 45%.\n\nHowever, it is still lagging behind Arbitrum (ARB), a dominant Ethereum (ETH) L2. Arbitrum (ARB) amassed almost $2.2 billion in TVL, while its daily trading volume exceeds $363 million in equivalent.\n\nSolScriptions and meme coins triggered Solana (SOL) comeback\n\nThe rally of Solana (SOL) and its network indicators can be attributed to a combination of powerful catalysts. For instance, the interest in Solana-based Ordinals \"SolScriptions\" and meme coins triggered the growth of SPL tokens minted on-chain.\n\nThen, Solana-based liquid staking protocols like Jito and Marinade Finance are actively attracting new customers and liquidity. Decentralized exchanges like Raydium and Orca are also gaining traction.\n\nAs covered by U.Today previously, CoinEx Research indicated the DePIN (Decentralized Physical Infrastructure Networks) sector as yet another powerful catalyst for Solana (SOL) ecosystem's rebound."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMi8wMi9nYW1pbmctZm9jdXNlZC1ldGhlcmV1bS1ldGgtc2lkZWNoYWluLXJvbmluLWludGVncmF0ZXMtYmluYW5jZS1wYXktdG8tZW5hYmxlLWVhc2llci13YWxsZXQtZnVuZGluZy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Dec 2023 08:00:00 GMT",
        "title": "Gaming-Focused Ethereum (ETH) Sidechain Ronin Integrates Binance Pay To Enable Easier Wallet Funding - The Daily Hodl",
        "content": "A gaming-focused Ethereum (ETH) sidechain is integrating with Binance Pay as a means of making wallet funding easier for consumers.\n\nIn a new blog post, Ethereum sidechain Ronin (RON) says that it is collaborating with the world’s largest crypto exchange by volume to make it easier to fund the Ronin crypto wallet.\n\nAccording to Ronin, Binance Pay was chosen because it has a mechanism that allows traders to access their funds on Binance and use them outside of the crypto exchange.\n\n“Over the past few weeks, we’ve seen one question pop up again and again: ‘How can I onboard my funds to Ronin?’ While the Ethereum bridge and our partners at Ramp are a great place to start, today we’re introducing yet another onboarding partner into the Ronin ecosystem – Binance Pay.\n\nAs Axie Classic DAU (daily active users) surges and Pixels takes the world by storm, this is a great opportunity to tell your family and friends that it has never been easier to fund their first Ronin wallet.”\n\nRonin, which was launched in 2021 by Sky Mavis, the firm responsible for the decentralized gaming protocol Axie Infinity (AXS), was created as a scaling solution that could accommodate millions of daily users.\n\nHowever, the protocol was exploited in March 2022 to the tune of 173,600 ETH and 25.5 million USDC at the time worth $600 million by the Lazarus Group, a hacking crew associated with the North Korean government.\n\nIn February, Norwegian authorities seized nearly $6 million worth of digital assets stolen in the attack – the largest amount of crypto ever seized by Norwegian police at the time.\n\nRON is trading for $1.09 at time of writing, a 2.77% increase during the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS93ZS1hc2tlZC1jaGF0Z3B0LWlmLWV0aGVyZXVtLWV0aC1wcmljZS13aWxsLXJlYWNoLWF0aC1pbi0yMDI0L9IBW2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS93ZS1hc2tlZC1jaGF0Z3B0LWlmLWV0aGVyZXVtLWV0aC1wcmljZS13aWxsLXJlYWNoLWF0aC1pbi0yMDI0Lz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Dec 2023 08:00:00 GMT",
        "title": "We Asked ChatGPT if Ethereum (ETH) Price Will Reach ATH in 2024 - CryptoPotato",
        "content": "TL;DR\n\nEthereum’s Price and Prospects : Ethereum (ETH) currently trades around $2,100, with the potential for a new all-time high influenced by market trends and technological advancements, especially its shift to proof-of-stake (PoS).\n\n: Ethereum (ETH) currently trades around $2,100, with the potential for a new all-time high influenced by market trends and technological advancements, especially its shift to proof-of-stake (PoS). Regulatory and Economic Factors : Ethereum’s future price could be affected by regulatory changes, with positive developments boosting investments and stricter regulations posing risks. Economic conditions and investor sentiment also play a crucial role.\n\n: Ethereum’s future price could be affected by regulatory changes, with positive developments boosting investments and stricter regulations posing risks. Economic conditions and investor sentiment also play a crucial role. Ethereum vs. Bitcoin Market Cap: ETH’s possibility of surpassing Bitcoin in market capitalization is uncertain, dependent on factors like adoption rates and network upgrades. Bitcoin currently leads with a significantly higher market cap.\n\n‘There is Potential for Ethereum’\n\nEthereum’s native cryptocurrency – Ether (ETH) – is yet another digital asset that has experienced a rapid price increase since the beginning of 2023. It currently trades at around $2,100 (per CoinGecko’s data), with some wondering whether a new all-time high (ATH) could be achieved next year.\n\nAccording to ChatGPT, such a development could indeed occur should several vital factors be in place. The AI-powered language model noted market trends and technological advancements as the main ones.\n\nIt outlined Ethereum’s shift from a proof-of-work (PoW) consensus mechanism to proof-of-stake (PoS), suggesting other improvements of this type could be bullish for the asset.\n\nChatGPT estimated that positive regulatory developments might encourage institutional investments and thus trigger a rally. On the other hand, stricter rules could have the opposite effect.\n\nGlobal economic conditions, investor sentiment, adoption by mainstream finance, and historical performance are other elements worth observing.\n\nLastly, ChatGPT suggested that the potential rise of different blockchain protocols and cryptocurrencies could impact Ethereum, too.\n\n“Given these factors, while there is potential for Ethereum to reach new highs, it’s important to approach such predictions with caution and consider the inherent risks and uncertainties of cryptocurrency investments,” the AI language model concluded.\n\nCould ETH Flip BTC: Flippening Possible?\n\nAnother interesting question that has been circulating in the cryptocurrency space for quite some time is whether Ethereum could eventually outpace Bitcoin and become the largest digital asset by market capitalization. On that note, several months ago, we asked ChatGPT if such a scenario is plausible in the next five years.\n\nThe language model explained that this outcome is “uncertain and depends on various factors.” The primary ones are adoption rates and network upgrades. Overall economic condition, inflation, and other financial aspects are also worth considering, ChatGPT assumed.\n\nAs of the moment, Bitcoin’s market capitalization stands at over $750 billion, representing a dominance of around 50%. Ethereum is second with a market cap of approximately $250 billion, meaning it has a long way to go before flippening the leader."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtcHJpY2UtZXllcy1uZXh0LWJyZWFrdGhyb3VnaC1uZXctaGlnaC1vbi1ob3Jpem9u0gFRaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtLWV0aC1wcmljZS1leWVzLW5leHQtYnJlYWt0aHJvdWdoLW5ldy1oaWdoLW9uLWhvcml6b24_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Dec 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) Price Eyes Next Breakthrough: New High on Horizon - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nEthereum's price today is showcasing a bullish surge that is drawing attention across the crypto community. Ethereum is a bellwether for the altcoin market, and today's price action suggests that investors are increasingly confident in the asset's value proposition.\n\nThe technical chart for Ethereum indicates a strong push toward a key resistance level. After a period of consolidation, the price has broken out, suggesting a potential shift from a bearish to a bullish trend at around $2,100. This move aligns with a broader market recovery.\n\nAnalyzing the chart, Ethereum has been tracing an ascending trajectory, supported by a rising trendline that underscores a series of higher lows – a classic indicator of bullish sentiment. The 50-day moving average, which is often looked upon for trend confirmation, is positioned below the current price, serving as a dynamic support level. The price is pushing toward the $2,100 level, which has historically acted as a significant resistance zone.\n\nA breakthrough above this resistance could signal the start of a new uptrend, potentially challenging previous highs. However, traders will be watching closely for sustained volume to accompany this price increase, as higher trade volumes would lend credence to the breakout and suggest stronger conviction among buyers.\n\nThe Relative Strength Index (RSI), a momentum indicator, is currently hovering in the upper neutral zone, nearing overbought territory. While this could indicate that a pause or pullback is due, it also reflects the strong buying pressure that has driven the recent price increase.\n\nDogecoin not joking\n\nAt the time of writing, Dogecoin's price hovers around $0.38, which has established itself as a significant resistance point. This level has been tested multiple times over recent weeks, with each attempt bringing increased selling pressure. However, the persistence of DOGE bulls is noteworthy, as they continue to push the price back up to this threshold, indicating a potential accumulation phase preceding a breakout.\n\nThe technical indicators on the chart reinforce this narrative. The moving averages are aligned in a bullish formation, with the 50-day moving average serving as dynamic support below the current price. This could embolden the bulls, offering a psychological boost as they rally to break past the current resistance.\n\nFurthermore, the formation of a small symmetrical triangle suggests that volatility may be on the horizon for Dogecoin. This pattern, characterized by converging trend lines, points to a period of consolidation that typically precedes significant price movement. Given the positioning of the price at the upper end of the triangle, there is an argument to be made for an impending bullish breakout.\n\nExamining the volume, we see a consistency that accompanies the consolidation pattern, hinting that a breakout could be accompanied by a substantial increase in trade volume. This would provide the necessary market confirmation for a genuine breakthrough, rather than a false breakout that could trap overzealous bulls.\n\nADA's consolidation continues\n\nThe Cardano (ADA) market has entered a phase of consolidation, marked by a confluence of technical indicators that suggest brewing momentum. With the price oscillating around $0.38, the question on many investors' minds is whether this is the quiet before the storm of a significant breakout.\n\nA close examination of the daily chart reveals diverging moving averages, with the 50-day moving average trending upward, suggesting a bullish undercurrent, while the 200-day moving average is moving lower, indicating potential longer-term bearish sentiment. This divergence can often signal a period of market indecision, with shorter-term bullish sentiment wrestling against longer-term caution.\n\nThe immediate resistance level for ADA sits at around $0.40, a threshold that has capped upward price movements in recent times. For a confirmed breakout, ADA bulls need to push and sustain the price above this level, ideally with an increase in volume to signify strong market conviction."
    }
]