[
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8venljcnlwdG8uY29tL3doeS10aGlzLWNyeXB0by1pbnNpZGVyLWNsYWltcy1ldGhlcmV1bXMtY28tY3JlYXRvcnMtYXJlLTEwMDB4LWJpZ2dlci1mcmF1ZHN0ZXJzLXRoYW4tc2FtLWJhbmttYW4tZnJpZWQv0gGBAWh0dHBzOi8venljcnlwdG8uY29tL3doeS10aGlzLWNyeXB0by1pbnNpZGVyLWNsYWltcy1ldGhlcmV1bXMtY28tY3JlYXRvcnMtYXJlLTEwMDB4LWJpZ2dlci1mcmF1ZHN0ZXJzLXRoYW4tc2FtLWJhbmttYW4tZnJpZWQvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Nov 2023 07:00:00 GMT",
        "title": "Why This Crypto Insider Claims Ethereum’s Co-Creators Are 1000x Bigger Fraudsters Than Sam Bankman-Fried - ZyCrypto",
        "content": "Advertisement\n\nSteven Nerayoff, an early advisor to the developers of the Ethereum network, has dropped bombshells regarding ETH co-founders. Nerayoff claims that their fraudulent activities by far exceed the criminal scheme of former Boy Wonder Sam Bankman-Fried.\n\nSteven Nerayoff Accuses Ether Founders Of Massive Fraud\n\nSteven Nerayoff has boldly alleged that Ethereum founders Vitalik Buterin and Joseph Lubin are bigger fraudsters than the now-convicted Sam Bankman-Fried.\n\nNerayoff made this wild allegation regarding Buterin and Lubin in a recent post on X (formerly known as Twitter). According to the ex-Ethereum advisor, the pair committed more fraudulent activities regarding the ETH coin than Bankman-Fried.\n\n“Ethereum is the fraudulent elephant in the room in plain sight 1000x bigger than SBF,” Nerayoff opined.\n\nBankman-Fried orchestrated one of the biggest financial frauds in American history, involving his crypto exchange FTX and its sister trading firm Alameda Research. SBF’s scheme to pilfer funds from FTX customers and lenders to purchase luxury property, Binance’s stake in FTX, and political favor unraveled, taking the 31-year-old MIT graduate down with it. He was recently convicted on all seven counts and faces up to 110 years in prison.\n\nAdvertisement\n\nDo Ethereum Founders Have Ties To Corrupt SEC Officials?\n\nNerayoff did not offer any substantial evidence to back up his explosive allegations against Ethereum’s Buterin and Lubin, but he cited key figures in the U.S. government such as ex-SEC chair Jay Clayton and current chair Gary Gensler, who reportedly had private dealings with the duo.\n\n“Joe Lubin & Vitalik Buterin have been the front with corrupt officials at the highest levels of federal agencies such as Clayton, Gensler & many others. Cover this now,” Nerayoff asserted.\n\nNerayoff’s claims imply that Ethereum’s executives likely bribed high-ranking government officials, giving the project an unfair advantage in the cryptocurrency market. The bribery claim is that Ethereum execs gave the U.S. Securities and Exchange hush money to turn a blind eye to the network’s ICO and thus not lodge securities violation charges.\n\nAll in all, the credibility of Nerayoff’s allegations isn’t helped by his own reputation for often stretching the truth: He has labeled himself as one of the eight Ethereum co-creators in the past, which has been dismissed as baloney by other early Ethereum contributors."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtbmV0d29yay1oaXRzLW5ldy02LW1vbnRoLWhpZ2gtaGVyZXMtaG930gFIaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtLWV0aC1uZXR3b3JrLWhpdHMtbmV3LTYtbW9udGgtaGlnaC1oZXJlcy1ob3c_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Nov 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Network Hits New 6-Month High, Here's How - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe Ethereum network has witnessed a significant surge in transaction volumes, hitting a new six-month high. Over the last week, the mainnet alone settled over $213 billion in transactions, underscoring a robust uptick in on-chain activity. Layer 2 solutions such as Arbitrum, Optimism and Base have further buoyed this growth, adding another $16 billion to the aggregate volume. This uptrend reflects growing confidence and utility in the Ethereum ecosystem, suggesting an increasingly vibrant blockchain landscape.\n\nAdvertisement\n\nThe spike in transaction volume has come with other noteworthy metrics, such as an increase in transaction fees. While higher fees can indicate network congestion and increased demand for block space, they also reflect the economic activity on the network. Investors and users should monitor these fees as they can affect the cost-effectiveness of conducting transactions on the Ethereum network.\n\nOver the past week, the network burned an average of 855,000 ETH per year, a mechanism that could contribute to deflationary pressure on the token's supply over time. This \"burn\" counteracts the issuance of new ETH, aiming to create a balance that can benefit the asset's long-term valuation.\n\nLooking at the daily chart, Ethereum's price action appears bullish. The price is maintaining a consistent pattern above both the 50-day and 200-day moving averages, indicating sustained buyer interest. The chart showcases a series of higher lows and higher highs — a classical uptrend signal. The recent price has surpassed local resistance levels, potentially aiming for higher price points.\n\nThe increase in on-chain activity, coupled with the reduction in supply due to the burn mechanism, are both fundamental factors that could be driving optimism in the market. The Layer 2 scaling solutions are also contributing to increased accessibility and efficiency, potentially drawing more users and transactions to the network."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMS8wNS9jcnlwdG8tc3RyYXRlZ2lzdC1wcmVkaWN0cy1yYWxsaWVzLWZvci1ldGhlcmV1bS1hbmQtdGhyZWUtZXRoLWJhc2VkLWFsdGNvaW5zLWhlcmUtYXJlLWhpcy10YXJnZXRzL9IBhwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMS8wNS9jcnlwdG8tc3RyYXRlZ2lzdC1wcmVkaWN0cy1yYWxsaWVzLWZvci1ldGhlcmV1bS1hbmQtdGhyZWUtZXRoLWJhc2VkLWFsdGNvaW5zLWhlcmUtYXJlLWhpcy10YXJnZXRzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Nov 2023 07:00:00 GMT",
        "title": "Crypto Strategist Predicts Rallies for Ethereum and Three ETH-Based Altcoins – Here Are His Targets - The Daily Hodl",
        "content": "A widely followed crypto analyst believes that Ethereum (ETH) and three other altcoins in its ecosystem are primed for surges.\n\nPseudonymous analyst Kaleo tells his 601,300 followers on the social media platform X that Ethereum is threatening to take out its diagonal resistance at $1,900.\n\nAccording to a chart shared by the analyst, Ethereum may rally to as high as $2,100 following a breakout.\n\n“Considering it is a diagonal season, the fun for ETH should really start whenever it clears $1,900.”\n\nAt time of writing, Ethereum is trading for $1,854.\n\nThe crypto strategist is also keeping an eye on the Ethereum scaling solution Arbitrum (ARB). Kaleo says that ARB has already flipped a key diagonal resistance into support and may rally to as high as $1.30.\n\n“ARB also looks primed for new highs after breaking out/retesting a high time frame resistance.\n\nI’d like to see a move back to the mid-August breakdown level (~$1.15) followed by the July highs in the $1.30s.”\n\nAt time of writing, ARB is worth $1.10.\n\nNext up is layer-2 protocol and Arbitrum rival Optimism (OP). According to Kaleo, OP appears to be following in the footsteps of ARB after taking out a multi-month diagonal resistance.\n\n“Can’t mention ARB without taking a look at OP…\n\nA pretty clear flag forming beneath it – looks ready for a pushback toward the August highs near $2.00.”\n\nAt time of writing, OP is worth $1.529, above Kaleo’s diagonal resistance.\n\nThe last Ethereum-based altcoin on the trader’s radar is the native asset of the non-fungible token (NFT) marketplace Blur (BLUR). Kaleo shares a chart suggesting that BLUR is in an uptrend after breaking above its diagonal resistance.\n\n“BLUR looks like it’s ready to start the climb back to $0.50.”\n\nAt time of writing, BLUR is trading at $0.30.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Digital Store/oneshot1"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9yaXBwbGUteHJwLWRvbWluYXRlcy1ldGhlcmV1bS1ldGgtaW4taW50ZXJlc3QtaW4tYWxtb3N0LWV2ZXJ5LXVzLXN0YXRlL9IBZGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9yaXBwbGUteHJwLWRvbWluYXRlcy1ldGhlcmV1bS1ldGgtaW4taW50ZXJlc3QtaW4tYWxtb3N0LWV2ZXJ5LXVzLXN0YXRlLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Nov 2023 07:00:00 GMT",
        "title": "Ripple (XRP) Dominates Ethereum (ETH) in Interest in Almost Every US State - CryptoPotato",
        "content": "TL;DR\n\nGoogle Trends data shows that XRP is more popular than Ethereum in 47 US states, with the highest interest coming from Delaware, Nevada, Louisiana, Arizona, and Hawaii.\n\nXRP’s price fluctuations throughout 2023 have been influenced by the ongoing lawsuit between Ripple and the US SEC, with Ripple’s partial wins in court contributing to a positive trend.\n\nForecasting the future value of XRP varies greatly among analysts, with estimates ranging from a moderate increase to $0.90 by next summer to an extreme prediction of $500, which would require a market capitalization far exceeding the current total crypto market cap.\n\nAmericans are Interested in Ripple (XRP)\n\nRipple’s native token – XRP – seems to be a highly intriguing topic for many Americans. According to Google Trends data, the residents of 47 states have displayed higher interest in the asset than Ethereum (ETH).\n\nDelaware, Nevada, Louisiana, Arizona, and Hawaii are the regions where XRP is the most popular. On the other hand, Vermont, New York, Oregon, and the District of Columbia are the only areas where Ethereum has surpassed Ripple’s coin.\n\nXRP’s price has gone through numerous ups and downs since the beginning of 2023, experiencing a significant uptrend in the second half of the year. The positive performance could be a result of the developments surrounding the lawsuit between Ripple and the US SEC, specifically the three partial wins that the blockchain enterprise has secured so far.\n\nThe outcome of the legal battle, which has been ongoing since December 2020, is expected to be revealed in the spring of 2024 during a grand trial. Multiple analysts and experts have predicted that a decisive win for Ripple could propel a further jump for XRP.\n\nSome of the XRP Forecasts\n\nThe popular X (Twitter) user CrediBULL argued that the asset’s valuation could rise to approximately $0.90 by the summer of next year.\n\nWhile such a prediction sounds somewhat realistic, other analysts, like Shannon Thorp, have envisioned astronomical increases. She assumed that XRP could explode to $500 in the following years.\n\nIt is worth mentioning that the coin’s market capitalization should spike to over $250 trillion for this to happen. In comparison, the entire market cap of the sector was “just” $3 trillion in 2021 when many digital assets, including Bitcoin (BTC), charted all-time highs.\n\nThose curious to check how high XRP could shoot in the remaining months of the ongoing year could take a look at the video below:"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMS8wNS90cmFkZXItd2hvLW5haWxlZC0yMDE4LWJpdGNvaW4tYm90dG9tLXByZWRpY3RzLWV0aGVyZXVtLWFuZC1zb2xhbmEtcmFsbGllcy1zYXlzLWl0cy10aW1lLWZvci1yaXNrLW9uLWFzc2V0cy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Nov 2023 07:00:00 GMT",
        "title": "Trader Who Nailed 2018 Bitcoin Bottom Predicts Ethereum and Solana Rallies, Says It’s Time for Risk-On Assets - The Daily Hodl",
        "content": "An analyst who accurately called the 2018 floor price for Bitcoin (BTC) thinks rallies are in sight for Ethereum (ETH) and its rival Solana (SOL).\n\nLooking at Ethereum first, pseudonymous trader Bluntz tells his 226,200 followers on the social media platform X that ETH appears to have completed a corrective move on the lower time frame chart.\n\nAccording to the analyst, ETH also flashed a bullish divergence on the 30-minute chart, indicating that momentum is building up for the leading smart contract platform.\n\n“Even though ETH has been the bane of my existence because ETH/BTC has been a perpetual bag of sh*t, I still think there’s a nice flat setup here on the USD pair with five-wave down now done and a nice low time frame divergence to confirm it.\n\nI think ‘the dip’ is done and we at least go for one more high above $1,880 from here.”\n\nBluntz practices the Elliott Wave theory, a method of technical analysis that attempts to predict future price action by identifying crowd psychology which tends to manifest in waves. Looking at the trader’s chart, he appears to predict that ETH will rally above $1,900 in the short term.\n\nAt time of writing, Ethereum is worth $1,850.\n\nNext up is Solana, which the trader thinks has more gas left in the tank even though it’s already up about 338% this year.\n\n“18% three-wave pullback in a monster uptrend, yes, please. This is going straight to $50+.”\n\nAt time of writing, SOL is worth $42.\n\nBluntz is also watching the performance of the US dollar index (DXY), which keeps track of the USD’s value compared to a basket of foreign currencies. According to the analyst, risk-on assets like crypto may see upside moves as he believes the DXY is set for a significant correction.\n\n“DXY now well and truly back in the high time frame range.\n\nRisk on b***hes, lets go!”\n\nBased on the trader’s chart, he seems to predict that the DXY could fall below the key support level of 100 points.\n\nAt time of writing, the DXY is trading at 105.069 points.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    }
]