[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY3J5cHRvLm5ld3MvdmFsa3lyaWUtbW92ZXMtdG8tY29udmVydC1idGYtaW50by1kdWFsLWJpdGNvaW4tZXRoZXJldW0tZXRmL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 06 Aug 2023 07:00:00 GMT",
        "title": "Valkyrie moves to convert BTF into dual Bitcoin, Ethereum ETF - crypto.news",
        "content": "Valkyrie recently filed a Form 497 detailing its plan to transform its existing Bitcoin Technique exchange-traded fund (BTF) into a dual Bitcoin and Ether exchange-traded fund (ETF) on Oct. 3.\n\nFinance experts are questioning the decision to convert the current futures fund rather than forming a whole new business. Observers speculate that regulatory procedures under the U.S. Securities and Exchange Commission (SEC) make it impossible to deviate from the set deadline.\n\nBloomberg ETF analyst Eric Balchunas compares Valkyrie’s move to that of the first marijuana ETF, MJ, which also aimed to gain market share.\n\nINTERESTING: Valkyrie just filed a 497 that they plan to convert $BTF into a Bitcoin + Ether ETF on Oct 3rd, which would would be two wks ahead of the other 13 filers scheduled launch. We'll see if this flies. Something similar happened back in day with $MJ, the first pot ETF https://t.co/Ypnien30ED pic.twitter.com/W9WiU2xc0W — Eric Balchunas (@EricBalchunas) August 4, 2023\n\nYou might also like: Grayscale calls for SEC to approve all Bitcoin ETFs simultaneously\n\nValkyrie vs Blackrock\n\nThe decision follows BlackRock’s Bitcoin ETF proposal to the SEC’s approval on July 13. The heightened focus on ETF proposals from the regulatory body is a good indication, especially in the Bitcoin sector.\n\nValkyrie’s Bitcoin (BTC) Miners ETF is a leader among cryptocurrency exchange-traded funds (ETFs) for 2023. As of July 27, the fund had $24 million in assets under management and returned an astounding 261% year-to-date.\n\nValkyrie, under the helm of CEO Leah Wald, would be the first fund to succeed if given the go-light by the SEC. Other applicants include ProShares, VanEck, Grayscale, and Bitwise.\n\nThe introduction of the Bitcoin and Ether ETF ahead of schedule is an exciting development for the market as the cryptocurrency sector develops.\n\nThe year’s ETF trend reflects the rising popularity of cryptocurrency and other digital assets. The growth seen by cryptocurrencies in 2023 is reflected in the fact that all the top 10 ETFs for the year are focused on them. This congruence further demonstrates the promise of ETFs in the cryptocurrency market.\n\nBlackRock, ARK Invest, Fidelity Investments, WisdomTree, VanEck and Invesco are currently applying for a spot bitcoin ETF.\n\nFollow Us on Google News"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY3J5cHRvLm5ld3MvdmFsa3lyaWUtbW92ZXMtdG8tY29udmVydC1idGYtaW50by1kdWFsLWJpdGNvaW4tZXRoZXJldW0tZXRmL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 06 Aug 2023 07:00:00 GMT",
        "title": "Valkyrie moves to convert BTF into dual Bitcoin, Ethereum ETF - crypto.news",
        "content": "Valkyrie recently filed a Form 497 detailing its plan to transform its existing Bitcoin Technique exchange-traded fund (BTF) into a dual Bitcoin and Ether exchange-traded fund (ETF) on Oct. 3.\n\nFinance experts are questioning the decision to convert the current futures fund rather than forming a whole new business. Observers speculate that regulatory procedures under the U.S. Securities and Exchange Commission (SEC) make it impossible to deviate from the set deadline.\n\nBloomberg ETF analyst Eric Balchunas compares Valkyrie’s move to that of the first marijuana ETF, MJ, which also aimed to gain market share.\n\nINTERESTING: Valkyrie just filed a 497 that they plan to convert $BTF into a Bitcoin + Ether ETF on Oct 3rd, which would would be two wks ahead of the other 13 filers scheduled launch. We'll see if this flies. Something similar happened back in day with $MJ, the first pot ETF https://t.co/Ypnien30ED pic.twitter.com/W9WiU2xc0W — Eric Balchunas (@EricBalchunas) August 4, 2023\n\nYou might also like: Grayscale calls for SEC to approve all Bitcoin ETFs simultaneously\n\nValkyrie vs Blackrock\n\nThe decision follows BlackRock’s Bitcoin ETF proposal to the SEC’s approval on July 13. The heightened focus on ETF proposals from the regulatory body is a good indication, especially in the Bitcoin sector.\n\nValkyrie’s Bitcoin (BTC) Miners ETF is a leader among cryptocurrency exchange-traded funds (ETFs) for 2023. As of July 27, the fund had $24 million in assets under management and returned an astounding 261% year-to-date.\n\nValkyrie, under the helm of CEO Leah Wald, would be the first fund to succeed if given the go-light by the SEC. Other applicants include ProShares, VanEck, Grayscale, and Bitwise.\n\nThe introduction of the Bitcoin and Ether ETF ahead of schedule is an exciting development for the market as the cryptocurrency sector develops.\n\nThe year’s ETF trend reflects the rising popularity of cryptocurrency and other digital assets. The growth seen by cryptocurrencies in 2023 is reflected in the fact that all the top 10 ETFs for the year are focused on them. This congruence further demonstrates the promise of ETFs in the cryptocurrency market.\n\nBlackRock, ARK Invest, Fidelity Investments, WisdomTree, VanEck and Invesco are currently applying for a spot bitcoin ETF.\n\nFollow Us on Google News"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMizwFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWluLWluZGlhLWF1Z3VzdC02LWNoZWNrLW1hcmtldC1jYXAtYml0Y29pbi1ldGhlcmV1bS1tZXJnZS1kb2dlY29pbi1zb2xhbmEtbGl0ZWNvaW4tcmlwcGxlLXhycC1iaW5hbmNlLXRva2VuLXFudC1wcmljZXMtZ2FpbmVyLWxvc2VyLTE2MjA5MzjSAdMBaHR0cHM6Ly9uZXdzLmFicGxpdmUuY29tL2J1c2luZXNzL2NyeXB0by9jcnlwdG9jdXJyZW5jeS1wcmljZS10b2RheS1pbi1pbmRpYS1hdWd1c3QtNi1jaGVjay1tYXJrZXQtY2FwLWJpdGNvaW4tZXRoZXJldW0tbWVyZ2UtZG9nZWNvaW4tc29sYW5hLWxpdGVjb2luLXJpcHBsZS14cnAtYmluYW5jZS10b2tlbi1xbnQtcHJpY2VzLWdhaW5lci1sb3Nlci0xNjIwOTM4L2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 06 Aug 2023 07:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Remains Above $29,000 Mark As ApeCoin Becomes Top Gainer - ABP Live",
        "content": "Bitcoin (BTC) and Ethereum (ETH) — two of the most valued crypto coins — managed to remain above the $29,000 and $18,000 marks, respectively, on early Sunday morning. Other popular altcoins — including the likes of Litecoin (LTC), Dogecoin (DOGE) — landed in the positive as overall prices saw minor gains across the board. ApeCoin (APE) emerged to be the biggest gainer, seeing a 24-hour jump of over 14.20 per cent. Render (RNDR), on the other hand, turned out to be the biggest loser.\n\nAt the time of writing, the global crypto market cap stood at $1.16 trillion, registering a 24-hour gain of 0.39 per cent.\n\nBitcoin (BTC) price today\n\nBitcoin price stood at $29,038.95 seeing a 24-hour gain of 0.04 per cent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 24 lakhs.\n\nEthereum (ETH) price today\n\nETH price stood at $1,833.41, marking a 24-hour gain of 0.28 per cent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 1.57 lakhs.\n\nDogecoin (DOGE) price today\n\nDOGE registered a 24-hour gain of 1.85 per cent as per CoinMarketCap data, currently priced at $0.07569. As per WazirX, Dogecoin price in India stood at Rs 6.5101.\n\nLitecoin (LTC) price today\n\nLitecoin saw a 24-hour gain of 1.39 per cent. At the time of writing, it was trading at $83.19. LTC price in India stood at Rs 7,091.46.\n\nRipple (XRP) price today\n\nXRP price stood at $0.635, seeing a 24-hour gain of 2.23 per cent. As per WazirX, Ripple price stood at Rs 54.6800.\n\nSolana (SOL) price today\n\nSolana price stood at $22.90, marking a 24-hour gain of 1.13 per cent. As per WazirX, SOL price in India stood at Rs 1,955.04.\n\nTop crypto gainers today (August 6)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nApeCoin (APE)\n\nPrice: $2.04\n\n24-hour gain: 14.20 per cent\n\nGala (GALA)\n\nPrice: $0.02477\n\n24-hour gain: 11.29 per cent\n\nShiba Inu (SHIB)\n\nPrice: $0.000009601\n\n24-hour gain: 4.93 per cent\n\nFrax Share (FXS)\n\nPrice: $6.61\n\n24-hour gain: 4.79 per cent\n\nCompound (COMP)\n\nPrice: $58.17\n\n24-hour gain: 3.68 per cent\n\nTop crypto losers today (August 6)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nRender (RNDR)\n\nPrice: $1.64\n\n24-hour loss: 3.71 per cent\n\nMaker (MKR)\n\nPrice: $1,236.98\n\n24-hour loss: 3.30 per cent\n\nXDC Network (XDC)\n\nPrice: $0.06791\n\n24-hour loss: 2.56 per cent\n\nConflux (CFX)\n\nPrice: $0.1787\n\n24-hour loss: 1.01 per cent\n\nBone ShibaSwap (BONE)\n\nPrice: $1.67\n\n24-hour loss: 1.00 per cent\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vZGVjcnlwdC5jby8xNTE1MjgvbmZ0LXRyYWRlci1hZG1pdHMtbmFiYmluZy0xLTUtbWlsbGlvbi1pbi1ldGhlcmV1bS1hZnRlci1lbGl6YWItZXRoLWdldHMtcmVrdC1vbi1ibHVy0gF0aHR0cHM6Ly9kZWNyeXB0LmNvLzE1MTUyOC9uZnQtdHJhZGVyLWFkbWl0cy1uYWJiaW5nLTEtNS1taWxsaW9uLWluLWV0aGVyZXVtLWFmdGVyLWVsaXphYi1ldGgtZ2V0cy1yZWt0LW9uLWJsdXI_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 06 Aug 2023 07:00:00 GMT",
        "title": "NFT Trader Admits Nabbing $1.5 Million in Ethereum After ‘Elizab.eth’ Gets Rekt on Blur - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA series of transactions on the NFT marketplace Blur has captivated Crypto Twitter and sparked questions of legality after a prolific trader going by the name of Hanwe Chang duped a competitor into buying certain Azuki NFTs at an inflated price.\n\n“[I] noticed that someone's bot was copying my bids on Blur, so I decided to trick him,” Chang said on Twitter, adding he had made a profit of 800 Ethereum with the strategy, netting close to $1.5 million.\n\nA relative newcomer compared to NFT marketplaces like OpenSea and SuperRare, Blur surged ahead in terms of trading volume earlier this year due to gamified incentives that reward users with tokens based on trade-related activity.\n\nAD\n\nAD\n\nThis includes rewards for users that bid on NFTs by trait, a practice in which Chang has become established, according to Blur’s leaderboards. Profile picture NFTs, including those from Azuki, often have unique qualities that can impact their value based on rarity, like eye color or clothing.\n\nOn Saturday, 12 Azuki NFTs that shared the specific background color “Off White A” sold simultaneously for 50 Ethereum worth $91,500 each. The previous Azuki NFT with an “Off White A” background had sold for less than 5 Ethereum or around $9,000—making it a massive, eye-catching markup.\n\nThe 12 NFTs appear to have been gathered by Chang in a digital wallet. A large chunk of the trades’ profits was then sent to a wallet labeled as “hanwe.eth” using the Ethereum Name Service after they had been completed, according to Ethercan.\n\nKnowing there were bots out there copying his trait bids, Chang likely duped an unsuspecting trader into buying the Azuki NFTs at an elevated price by placing a bid on his own NFTs, an account that goes by A Raving Ape theorized on Twitter.\n\nContext on how @HanweChang executed a plan to perfection and made 800e by selling \"Off White A - Background color\" azuki at 50e each and azuki elementals at 15e each. This is an epic case of PvP in the current NFT trading market ⚔️ Hanwe has been coasting at the top spot of… pic.twitter.com/M8Ujm8CquJ — A-Raving-Ape.eth 🍌 (@a_raving_ape) August 5, 2023\n\nAD\n\nAD\n\nA Raving Ape described the interaction as “an epic case of PvP” in the NFT market, invoking the term “player versus player” that’s associated with confrontations in multiplayer video games. But it seems not everyone involved was entertained.\n\nThe bot’s apparent owner, “elizab.eth,” stepped forward on Twitter to claim the “funds were stolen form [their] bot.” The trader wanted to discuss the possibility of bounty and said Chang could keep 10% of the funds if they agreed to return the rest.\n\nThe pseudonymous NFT influencer Dave III said Chang’s statement wasn’t very wise and warned others not to “brag about committing fraud,” calling his trick “illegal market activity.”\n\nThese 2 crypto twitter posts will go down as the dumbest of all time. #1: Hanwe admits to ‘Bid Spoofing’ or ‘Shill Bidding’ — an illegal market activity of Fraud or Wire Fraud #2: Avi admits to Market Manipulation. He’s now serving jail time. Don’t brag about committing fraud. pic.twitter.com/zgDJJr9nEX — DAVE III (@dgoldzz) August 5, 2023\n\n“Placing bids you don’t want accepted solely to trigger other bids is the illegal part,” Dave III clarified in a comment on a separate post.\n\nWhile some commentators pushed back against the notion of impropriety and said elizab.eth was simply outsmarted, Delphi Labs General Counsel Gabriel Shapiro appeared sympathetic.\n\n\"I unironically think [elizab.eth] might have good legal claims to get their ETH back from the bot 'trick' if they hire a skilled litigator,” he said on Twitter. However, Shapiro acknowledged that “legally, the issues are a bit more nuanced.”"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vY29pbmdhcGUuY29tL2VkdWNhdGlvbi9ldGhlcmV1bS1pbXByb3ZlbWVudC1wcm9wb3NhbHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 06 Aug 2023 05:11:04 GMT",
        "title": "What are Ethereum Improvement Proposals (EIPs)? - CoinGape",
        "content": "This article explains what are Ethereum Improvement Proposals (EIPs), their significance, and how they work in detail.\n\nEthereum is the most innovative blockchain that exists today. Backed by a strong team of developers, software engineers, and researchers, it constantly upgrades over time. But, have you ever wondered who is deciding and implementing these upgrades?\n\nA decision or a proposal to make a change to the network has to be agreed upon by the entire development community of Ethereum. Only then, they can put it into action. The Ethereum Improvement Proposals (EIPs) concept was introduced to make this process smooth. Let us help you understand everything about Ethereum Improvement Proposals (EIPs) in this article.\n\nWhat are Ethereum Improvement proposals (EIPs)?\n\nEthereum Improvement Proposals (EIPs) are standard potential changes, new features, or processes that improve the Ethereum ecosystem as a whole.\n\nThey were first introduced in October 2015 following the footsteps of the Bitcoin Improvement Protocols (BIPs) process, which itself followed Python Enhancement Proposals (PEPs). EIPs have all the information of an upgrade and act as a “source of truth” to the community.\n\nDecentralization is the core feature of Ethereum and hence anyone can suggest a change to the network. But, you must follow the guidelines included in EIP-1 to suggest a proposal. Till now, most of the EIP authors are application developers or protocol developers. And, EIP editors like Gavin Wood and Vitalik Buterin, review them, correct them, and format issues.\n\nSignificance of Ethereum Improvement Proposals (EIPs)\n\nWhether it’s the transition of Ethereum from a PoW network to a PoS network or the creation of non-fungible tokens, everything started with an EIP. They play a key role in every upgrade happening around the Ethereum network.\n\nSome of the top Ethereum Improvement Proposals that were already implemented are EIP-1559 (fee market change), EIP-20 (ERC-20 token standard), and EIP-721 (ERC-721 standard). The historical “The Merge” event was proposed by the EIP-3675. Similar to these, every upgrade happening on the network consists of a set of EIPs.\n\nEIPs allow the network to change, improve, and adapt to the increase in its usage. This makes Ethereum flexible and constantly updates to changes in the industry and meets changing demands of the users. By going through the review process by the whole community, EIPs make sure that these decisions are inclusive and accurate.\n\nTypes of Ethereum Improvement Proposals (EIPs)\n\nThere are 3 types of EIPs which we are going to discuss here.\n\nStandards Track EIP\n\nThe Standards Track EIPs change almost all of the Ethereum implementations. These proposals make changes directly to the Ethereum network protocol. They include changes in block or transaction validity rules, changes that affect the interoperability of Ethereum dApps, etc.\n\nStandards Track EIPs have 3 parts of implementation – a design document, an implementation, and an update to formal specification. Furthermore, we can categorize these EIPs into Core, Networking, Interface, and ERC proposals.\n\nMeta EIP\n\nUnlike Standards Track EIPs, Meta EIPs do not make direct changes to the Ethereum network protocol. These are more like procedures, guidelines, or changes in the decision-making process. We can also call them Process EIPs and these changes require community consensus as they are more than just recommendations.\n\nInformation EIP\n\nThese EIPs neither make changes to the network protocol nor require community consensus. These proposals suggest general guidelines or information to the Ethereum community. Members of the community and implementers can ignore informational EIPs or follow their advice based on their choice.\n\nHow are EIPs Processed?\n\nSimilar to how a law must pass some stages to be finally implemented, an EIP must also go through some stages. Every EIP must pass through the following steps.\n\nDraft – In this phase, the EIP is still in the hands of the author. Once it follows all the guidelines of proposing an EIP like having no errors, proper format, and making technical sense, it can now be submitted to the Ethereum repository on GitHub for review.\n\nIn this phase, the EIP is still in the hands of the author. Once it follows all the guidelines of proposing an EIP like having no errors, proper format, and making technical sense, it can now be submitted to the Ethereum repository on GitHub for review. Review – After being checked officially by an editor, the author can publish the EIP on GitHub. The next step is to mark the EIP as suitable for peer review. After passing through the early stages of review, the proposal needs a review by a wider public.\n\nAfter being checked officially by an editor, the author can publish the EIP on GitHub. The next step is to mark the EIP as suitable for peer review. After passing through the early stages of review, the proposal needs a review by a wider public. Last Call – Any EIP must at least be in the review stage for a minimum of 2 weeks so that the community has enough time to read, review, and suggest changes. In this stage, the proposals can be sent back and forth for changes by the author. If the EIP remains in this phase for more than 6 months, it will move to “stagnant.”\n\nAny EIP must at least be in the review stage for a minimum of 2 weeks so that the community has enough time to read, review, and suggest changes. In this stage, the proposals can be sent back and forth for changes by the author. If the EIP remains in this phase for more than 6 months, it will move to “stagnant.” Final stage – When the EIP clears all the stages of review, non-core EIPs reach the final standard. But, core EIPs need to go through another phase. The core development team will implement the approved proposal into the software to enable it.\n\nConclusion\n\nEthereum Improvement proposals (EIPs) are an important part of Ethereum’s development over the years. The network is still under various upgrades to improve the overall scalability. All of these upgrades started with EIPs and are now making huge changes to the network. Overall, EIPs bring flexibility and adaptability to Ethereum which are essential to increase its adoption.\n\nFAQs\n\nWhat is the most popular EIP?\n\nEIP-20, EIP-721, EIP-137, and EIP-1559 are popular EIPs. However, many EIPs exist today that are included in the upgrades of Ethereum.\n\nWhat is the purpose of EIPs?\n\nEthereum Improvement Proposals make changes to the network to make Ethereum better. They make the network flexible, efficient, and adaptable to the changing needs of users.\n\nWhat is the difference between EIP and ERC?"
    }
]