[
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8venljcnlwdG8uY29tL2lzLWV0aGVyZXVtLWF0LWEtY3Jvc3Nyb2Fkcy1kZXNwaXRlLWV0aC13aGFsZXMtY29udGludW91c2x5LWFjY3VtdWxhdGluZy_SAWJodHRwczovL3p5Y3J5cHRvLmNvbS9pcy1ldGhlcmV1bS1hdC1hLWNyb3Nzcm9hZHMtZGVzcGl0ZS1ldGgtd2hhbGVzLWNvbnRpbnVvdXNseS1hY2N1bXVsYXRpbmcvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 14 Oct 2023 07:00:00 GMT",
        "title": "Is Ethereum at a Crossroads Despite ETH Whales Continuously Accumulating? - ZyCrypto",
        "content": "Advertisement\n\nAs bears continue calling the shots in the crypto market, Ethereum (ETH) has not attained significant momentum to exit the $1,500 level.\n\nAs a result, the second-largest cryptocurrency based on market cap finds itself at a crossroads because it’s sitting at a crucial area illustrating a make-or-break scenario.\n\nLeading analyst Ali took to X, formerly Twitter, to explain this development. He stated, “Ethereum is moving within a steady range. Interestingly, the TD Sequential presented a buy signal at the lower end of this range, suggesting ETH could rebound to $1,630. But be cautious – If ETH closes below $1,530, the bullish outlook will be invalidated.”\n\nSource:TradingView/Ali\n\nThe analyst added that $1,530 was a critical demand zone, and Ethereum ought to trade above it to avoid a steep correction.\n\nAdvertisement\n\nEthereum was hovering around the $1,550 area at the time of writing, according to CoinGecko. Therefore, ETH continues to maintain a bullish image despite it being on shaky grounds.\n\nEthereum Whales are on a Buying Spree\n\nDespite the downturn being experienced in the market, ETH whales are not relenting in their quest to accumulate more coins.\n\nLeading market insight provider Santiment acknowledged that both the top 10 exchange and non-exchange wallets were getting richer by the day as their spending rate was going through the roof.\n\nSource: Santiment\n\nAccording to Santiment data, the 10 largest non-exchange and exchange addresses hold ETH worth $61.6 billion and $10.9 billion, respectively.\n\nThis suggests that the bearish momentum in the general crypto market is not dampening the spirits of ETH whales as they continue accumulating more coins.\n\nMeanwhile, Ethereum is set for massive growth based on a recent analysis by Standard Chartered Bank. The financial giant stipulated that ETH could skyrocket by 5x and hit $8,000 by the end of 2026, as reported by ZyCrypto.\n\nEthereum continues to be king in various crypto sectors, such as decentralized finance (DeFi) and non-fungible tokens (NFTs).\n\nTherefore, Standard Chartered believes this, coupled with real-world adoption in areas such as tokenization and gaming, will spur Ethereum demand, which is bullish for ETH price."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMC8xNC9yaXNpbmctd2hhbGUtYWN0aXZpdHktb24tdGhlc2UtdGhyZWUtZXRoZXJldW0tYmFzZWQtYWx0Y29pbnMtYS1zaWduLW9mLXBvdGVudGlhbC1idWxsaXNoLXR1cm5hcm91bmQtc2FudGltZW50L9IBkwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMC8xNC9yaXNpbmctd2hhbGUtYWN0aXZpdHktb24tdGhlc2UtdGhyZWUtZXRoZXJldW0tYmFzZWQtYWx0Y29pbnMtYS1zaWduLW9mLXBvdGVudGlhbC1idWxsaXNoLXR1cm5hcm91bmQtc2FudGltZW50L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 14 Oct 2023 07:00:00 GMT",
        "title": "Rising Whale Activity on These Three Ethereum-Based Altcoins a Sign of Potential Bullish Turnaround: Santiment - The Daily Hodl",
        "content": "Crypto analytics platform Santiment says that three altcoins are showing signs of potentially reversing course after a bearish run.\n\nSantiment says that whale activity is on the rise for decentralized exchange protocol dYdX (DYDX), data exchange platform Ocean Protocol (OCEAN) and crypto payments network Request (REQ).\n\nAccording to Santiment, the rise in whale activity signals that a “turnaround becomes much more likely” after a period of price declines.\n\nDYDX is trading at $1.85 at time of writing while OCEAN is changing hands at $0.286. REQ is priced at $0.081 at time of writing.\n\nTurning to Ethereum (ETH), Santiment says that the largest exchange and non-exchange wallets are loading up on the second-largest crypto by market cap. The analytics firm notes that the 10 largest non-exchange wallets own $61.1 billion worth of Ethereum – a new all-time high.\n\nMeanwhile, the 10 largest exchange wallets control $10.9 billion worth of ETH.\n\n“Ethereum’s top 10 non-exchange and top 10 exchange addresses continue getting richer as its market value hovers just above $1,570. 8.51% of ETH currently sits on exchanges, and the 10 largest wallets away from exchanges hold a whopping 39.22 million of them.”\n\nSantiment also says that Ethereum is seeing an uptick in the social dominance metric as the rate ETH is being discussed on social media platforms is at the highest level in about a month.\n\nAccording to Santiment, old Ethereum coins are also moving at the highest rate in a month as interest from traders remains high.\n\nEthereum is trading at $1,550 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtbWFpbm5ldC1zaGFkb3ctZm9yay10ZWFzZWQtYWhlYWQtb2YtZGVuY3Vu0gFLaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtLWV0aC1tYWlubmV0LXNoYWRvdy1mb3JrLXRlYXNlZC1haGVhZC1vZi1kZW5jdW4_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 14 Oct 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Mainnet Shadow Fork Teased Ahead of Dencun - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum developers are teasing a mainnet shadow hard fork to occur before the release of the Dencun upgrade.\n\nAdvertisement\n\nAccording to the latest Ethereum ACDE call report compiled by Christine Kim, ETH developers have confirmed that a shadow fork of the Ethereum mainnet will be performed sometime after Devnet #10 to further test the Dencun upgrade. This will possibly be in parallel with testing efforts on public testnets.\n\ngm, here's my writeup of this week's Ethereum dev call where devs talked about ongoing issues and bugs on Devnet #9 and had a long debate on the merits of EOF.https://t.co/CbYKBaFlmZ — Christine Kim (@christine_dkim) October 13, 2023\n\nEthereum developers are gearing up for the upcoming release of Devnet #10. According to the article, Devnet #10 might be ready, hopefully next week.\n\nBarnabas Busa, an Ethereum engineer, underlined that developers are still working through \"big questions\" in the process of testing Dencun.\n\nDevelopers may not proceed with the launch of Devnet #10, likely the final devnet for Dencun, before the upgrade is launched on public Ethereum testnets like Goerli, until these questions are answered.\n\nThe forthcoming Devnet #10 will include a large validator set, maybe with 330,000 active validators. Its launch criteria include updated trusted setup files from the EIP 4844 KZG ceremony, improved visibility for blob transactions, the MEV pipeline and network stability.\n\nThe current Devnet #9 has a 93% participation rate, which means that 93% of validators are actively participating in network consensus. The 7% of invalidators that are not operational are mostly Geth (EL) and Teku (CL) validator nodes.\n\nThe Dencun upgrade contains the eagerly awaited Ethereum Improvement Proposal (EIP) 4844, often known as proto-danksharding, which seeks to improve scalability and lower transaction costs on Layer 2 rollup solutions like Arbitrum and Optimism."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1iaXRjb2luLTE1LW1vbnRocy1ldGgtcHJpY2UtcmV2ZXJzZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 14 Oct 2023 07:00:00 GMT",
        "title": "Ethereum losing streak vs. Bitcoin hits 15 months — Can ETH price reverse course? - Cointelegraph",
        "content": "The price of Ethereum’s native token, Ether (ETH), is trading around a 15-month low versus Bitcoin (BTC), and the lowest since Ethereum switched to proof-of-stake (PoS).\n\nWill it continue to weaken for the remainder of 2023? Cointelegraph takes a closer look at the charts.\n\nEthereum price breaks below critical support vs. Bitcoin\n\nThe ETH/BTC pair dropped to as low as 0.056 BTC earlier this week. In doing so, the pair broke below its 200-week exponential moving average (200-week EMA; the blue wave) near 0.058 BTC, raising downside risks further into 2023.\n\nThe 200-week EMA has historically served as a reliable support level for ETH/BTC bulls. For instance, the pair rebounded 75% three months after testing the wave support in July 2022. Conversely, it dropped over 25% after losing the same support in October 2020.\n\nETH/BTC weekly price chart. Source: TradingView\n\nETH/BTC stares at similar sell-off risks in 2023 after losing its 200-week EMA as support. In this case, the next downside target looks to be around its 0.5 Fib line near 0.051 BTC in 2023, down about 9.5% from current price levels.\n\nConversely, ETH price may rebound toward its 50-week EMA (the red wave) near 0.065 BTC if it reclaims the 200-week EMA as support.\n\nBitcoin bull case overshadows Ethereum\n\nEthereum’s persistent weakness versus Bitcoin is reflected in institutional capital flow data.\n\nFor instance, as of Oct. 6, Bitcoin-specific investment funds had attracted $246 million year-to-date (YTD), according to CoinShares. On the other hand, Ethereum funds have lost capital, witnessing outflows worth $104 million in the same period.\n\nNet flows into crypto funds (by asset). Source: CoinShares\n\nThe discrepancy is likely due to growing buzz about a potential spot Bitcoin exchange-traded product (ETF) approval in the United States.\n\nTrade pundits argue that a spot Bitcoin ETF launch will attract $600 billion. In addition, Bitcoin’s fourth halving on April 24, 2024, is also acting as a tailwind versus the altcoin market.\n\nRelated: Bitcoin price gets new $25K target as SEC decision day boosts GBTC\n\nThe halving will reduce the Bitcoin miners’ block reward from 6.25 BTC to 3.125 BTC, a bullish case based on historical precedent that cuts new supply in half.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzEwLzE0L2Nhbi1ldGhlcmV1bS1yZWFjaC01MDAwL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 14 Oct 2023 07:00:00 GMT",
        "title": "Can Ethereum Reach $5,000? - The Motley Fool",
        "content": "As equity markets benefit from a bounce-back year in 2023, so too has the crypto market.\n\nEthereum (ETH 5.05%) has climbed almost 30% this year, after it dropped 68% in 2022. But with it still being down significantly from its peak, some enthusiasts are hoping for huge returns in the years ahead.\n\nAs of this writing, Ethereum's price is sitting at about $1,500. For it to reach the $5,000 mark, that would translate to a gain of about 230%. Is this even a possible scenario? Let's take a closer look at this top digital asset.\n\nIt's gotten close\n\nEthereum's all-time high price was about $4,892, which was set in November 2021. At that point, the token's price skyrocketed 153,000% from its initial launch date in mid-2015. Some lucky early adopters got rich.\n\nBut it's worth pointing out that this huge price run-up happened during a major bull market in both the equity markets and the cryptocurrency industry. Monetary policy was still loose after the depths of the coronavirus pandemic.\n\nSince then, it's been a difficult ride for investors. Ethereum is currently 68% below its peak price. The so-called \"crypto winter\" was in full effect after a string of companies in the industry failing. Rapidly rising interest rates have also pressured riskier assets.\n\nWhile impossible to predict, investors can't ignore macroeconomic factors. They can both positively and negatively influence Ethereum's price action.\n\nThe bull case\n\nWithout a doubt, Ethereum has huge potential, according to the most supportive bulls.\n\nThanks to the added functionality and programmability of smart contracts, Ethereum is trying to become the world's decentralized computing platform. This blockchain innovation allows for two parties to transact for different use cases without the need for an intermediary. If it gains broader adoption, industries known for having expensive intermediaries are prone to disruption.\n\nSo far, the use cases have included various decentralized applications like financial protocols and non-fungible tokens (NFTs). While activity here has cooled off, developers continue working on trying to make the network better. According to a report by venture firm Electric Capital, Ethereum has 1,901 active developers working on it, significantly more than any other cryptocurrency. This bodes well for its ability to introduce advancements.\n\nSpeaking more to the development aspect, Ethereum's Merge upgrade is what many consider to be a positive step, particularly as it relates to scalability. Ethereum can only process 11 transactions per second, and when demand is high, transaction fees can soar.\n\nThe Merge transitioned Ethereum to a proof-of-stake (PoS) system, which can lower energy expenditures and set it up for further scaling enhancements. Future upgrades could add more capabilities to Ethereum. And in turn, this could drive usage and demand for the token, causing its price to rise.\n\nReasons to avoid Ethereum\n\nAs is the case with any unproven asset or new technology, there is a ton of uncertainty around the ultimate outcome.\n\nWith any cryptocurrency, there's always inherent technical risk. What happens if there's a bug in the software code that exposes private keys? Then everyone's crypto holdings can be stolen.\n\nIn Ethereum's case, its complex development roadmap introduces the possibility of errors to being made. This means its technical risks are even higher compared to a simpler and more straightforward crypto like Bitcoin.\n\nOne of the biggest bear arguments for Ethereum is that it's becoming more centralized, which goes against the entire premise of cryptocurrencies as tools for decentralization and giving power back to the users. The PoS consensus mechanism leads to larger pools of token holders controlling the processing of transactions.\n\nMoreover, a single person, co-founder Vitalik Buterin, has major influence over the direction of Ethereum. He can make decisions to his benefit at the expense of the average Ethereum user. And this can be a detriment to the integrity of the network.\n\nEthereum has promise, but the uncertainty remains sky-high. So I think investors hoping for the token to reach $5,000 should temper expectations. Unless wild enthusiasm takes over the crypto market again, that's a very lofty price target to set your eyes on"
    }
]