[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMTIvYmFuay1vZi1jaGluYXMtYm9jaS1pc3N1ZXMtdG9rZW5pemVkLXNlY3VyaXRpZXMtb24tZXRoZXJldW0taW4taG9uZy1rb25nL9IBeWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMTIvYmFuay1vZi1jaGluYXMtYm9jaS1pc3N1ZXMtdG9rZW5pemVkLXNlY3VyaXRpZXMtb24tZXRoZXJldW0taW4taG9uZy1rb25nL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 12 Jun 2023 07:00:00 GMT",
        "title": "Bank of China’s BOCI Issues Tokenized Securities on Ethereum in Hong Kong - CoinDesk",
        "content": "This BOCI transaction also underscores Hong Kong’s growing ambition as a key hub for crypto as the industry faces mounting regulatory pressure in the United States. Indeed, just days after the U.S. Securities and Exchange Commission (SEC) filed a lawsuit against Coinbase for offering unregistered securities, Hong Kong legislator Johnny Ng invited digital asset trading platforms – including Coinbase – to set up shop in the city."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JvYy1pbnZlc3RtZW50LWFybS10b2tlbml6ZWQtbm90ZXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 12 Jun 2023 07:00:00 GMT",
        "title": "Bank of China investment arm issues tokenized notes on Ethereum - Blockworks",
        "content": "BOCI, an investment arm of the Bank of China, issued tokenized notes in Hong Kong, marking the first time that a financial institution in China has issued a digital note in the region.\n\nUBS partnered with BOCI to issue the notes, which were tokenized on the Ethereum blockchain.\n\nBOCI issued 200 million Chinese yuan worth of notes, which translates to roughly $28 million.\n\n”Working together with UBS, we are driving the simplification of digital asset markets and products, for customers in Asia Pacific through the development of blockchain-based digital structured products, designed specifically for customers in Asia Pacific. We are encouraged by the evolution of Hong Kong’s digital economy and are committed to promoting the digital transformation and innovative development of Hong Kong’s financial industry,” said Ying Wang, deputy CEO at BOCI.\n\nHong Kong is working toward becoming a crypto hub, with Paul Chan Mo-po, the financial secretary, previously saying that Hong Kong will be embracing regulation.\n\nRead more: Hong Kong is getting cozy with crypto\n\n“The virtual asset market has fluctuated greatly, and some virtual asset exchanges have closed down recently, which makes some people in the society doubt the prospects of Web3. However, we believe this is the right time to push Web3 forward,” he said in a blog post.\n\nThe special administrative region lifted its crypto retail trading ban this month and has encouraged crypto exchanges to seek licenses in the region.\n\nThe Securities and Futures Commission established exchange guidelines — and firms such as Huobi, OKX and BitMEX have expressed intentions to apply for a Hong Kong license.\n\nJohnny Ng, a Hong Kong legislator, has even invited Coinbase to establish a Hong Kong hub after the SEC sued the exchange last week.\n\nUBS did not respond to a request for comment asking for the transaction ID by the time of publication.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1kb3dudHJlbmQtMTgwMC_SAUdodHRwczovL3d3dy5uZXdzYnRjLmNvbS9hbmFseXNpcy9ldGgvZXRoZXJldW0tcHJpY2UtZG93bnRyZW5kLTE4MDAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 12 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Price Could Avoid a Major Breakdown if it Closes Above One Key Level - NewsBTC",
        "content": "Ethereum price is moving lower from the $1,780 resistance against the US Dollar. ETH could decline heavily if there is a clear move below the $1,720 support.\n\nEthereum is struggling to clear the $1,780 and $1,800 resistance levels.\n\nThe price is trading below $1,800 and the 100-hourly Simple Moving Average.\n\nThere is a key bearish trend line forming with resistance near $1,760 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could decline heavily if there is a close below $1,720.\n\nEthereum Price Remains At Risk\n\nEthereum’s price attempted a fresh increase above the $1,775 and $1,780 resistance levels. ETH failed to gain bullish momentum above the $1,780 resistance, similar to Bitcoin.\n\nEarlier, the price climbed above the 23.6% Fib retracement level of the key decline from the $1,854 swing high to the $1,718 low. The price is now back below $1,750 and showing bearish signs. There is also a key bearish trend line forming with resistance near $1,760 on the hourly chart of ETH/USD.\n\nEther is clearly struggling to clear $1,800 and the 100-hourly Simple Moving Average. Immediate resistance is near the $1,755 zone and the trend line. The next major resistance is near the $1,780 level. It is close to the 50% Fib retracement level of the key decline from the $1,854 swing high to the $1,718 low.\n\nSource: ETHUSD on TradingView.com\n\nA proper move above the $1,775 and $1,780 resistance levels might send Ether toward $1,850. The next resistance sits near $1,880, above which Ethereum could rise toward the key barrier at $1,920. Any more gains above the $1,920 resistance zone might send the price toward the $2,000 resistance.\n\nMore Downsides in ETH?\n\nIf Ethereum fails to clear the $1,755 resistance, it could continue to move down. Initial support on the downside is near the $1,720 level.\n\nThe next major support is near the $1,700 level. If there is a break and close below the $1,700 support, the price could decline toward the $1,640 support. Any more losses may perhaps send the price toward the $1,600 level or even $1,550 in the coming sessions.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 level.\n\nMajor Support Level – $1,720\n\nMajor Resistance Level – $1,780\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy92aXRhbGlrLWJ1dGVyaW4tZXRoZXJldW0tZmFpbHMtd2l0aG91dC10aGVzZS10aHJlZS10cmFuc2l0aW9uc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 12 Jun 2023 07:00:00 GMT",
        "title": "Vitalik Buterin: Ethereum 'fails' without these 3 important 'transitions' - Cointelegraph",
        "content": "Ethereum co-founder Vitalik Buterin believes the success of Ethereum will come down to three major technical “transitions” that need to happen almost simultaneously — layer-2 scaling, wallet security and privacy-preserving features.\n\nIn a June 9 post via his personal blog, Buterin explained that the Ethereum blockchain outright “fails” without sufficient scaling infrastructure to make transactions cheap.\n\n“Ethereum fails because each transaction costs $3.75 ($82.48 if we have another bull run), and every product aiming for the mass market inevitably forgets about the chain and adopts centralized workarounds for everything,” he said.\n\nAnother point of failure, according to Buterin, relates to smart contract wallets.\n\nHe explained that a move to smart contract wallets has caused some issues, because of complexities from the user experience side of things when users take control of multiple addresses at once.\n\nEthereum needs to improve its layer-2 scalability, wallet security and privacy features, according to Buterin. Source: Vitalik Buterin’s website\n\nIn addition to wallets securing crypto assets, Buterin explained that wallets would need to secure data in order to truly transition into an on-chain world with zero-knowledge rollups:\n\n“In a ZK world, however, this is no longer true: the wallet is not just protecting authentication credentials, it's also holding your data.”\n\nThe last of Buterin’s three transitions — privacy — will need to come in the form of improved identity, reputation and social recovery systems.\n\n“Without the third, Ethereum fails because having all transactions (and POAPs, etc) available publicly for literally anyone to see is far too high a privacy sacrifice for many users, and everyone moves onto centralized solutions that at least somewhat hide your data,” he said.\n\nThe Ethereum co-founder suggested that stealth addresses could be implemented to resolve this issue.\n\nRelated: Vitalik Buterin reveals 3 ‘huge’ opportunities for crypto in 2023\n\nButerin said that achieving all three will be “challenging” because of the “intense coordination” involved between them.\n\nHe admitted that each of the three transitions “weaken” the “one user — one address” model, which, in turn, may complicate the way transactions are executed.\n\n“If you want to pay someone, how will you get the information on how to pay them?”\n\n“If users have many assets stored in different places across different chains, how do they do key changes and social recovery?\" he added.\n\nButerin concluded by stressing the need to build infrastructure that ultimately improvers user experience:\n\n“Despite the challenges, achieving scalability, wallet security, and privacy for regular users is crucial for Ethereum's future. It is not just about technical feasibility but about actual accessibility for regular users. We need to rise to meet this challenge.”\n\nMagazine: ZK-rollups are ‘the endgame’ for scaling blockchains, Polygon Miden founder"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMilAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1mYWxscy1iZWxvdy0yNTkwMC1ibmItc2hpYmEtaW51LXNoZWQtdXAtdG8tNS9hcnRpY2xlc2hvdy8xMDA5MzI5NjUuY21z0gGYAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZS10b2RheS1iaXRjb2luLWZhbGxzLWJlbG93LTI1OTAwLWJuYi1zaGliYS1pbnUtc2hlZC11cC10by01L2FtcF9hcnRpY2xlc2hvdy8xMDA5MzI5NjUuY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 12 Jun 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin falls below $25,900; BNB, Shiba Inu shed up to 5% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe cryptocurrency markets were trading mixed on Monday ahead of key inflation data later in the day. Bitcoin, XRP, Cardano, and Polygon were trading with gains, while Ethereum, BNB, Solana, and Shiba Inu were trading with cuts.Bitcoin (BTC) rose 0.28% to $25,864, whereas Ethereum (ETH) was below the $1,750 level.\"The crypto market is yet to respond to the US Fed's decision to pause rate hikes. It is important to note that the US Fed has increased interest rates by 500 basis points since it started its war against inflation and prevented the economy from slipping into possible recession,\" Shivam Thakral, CEO of BuyUcoin, said.\"The crypto market may respond positively to the latest development related to rate hikes in the coming weeks but the real relief will come if interest rates are brought down to boost market liquidity,\" Thakral added.The global cryptocurrency market cap was trading lower around $1.05 trillion, falling 0.12% in the last 24 hours.\"Crypto markets observed brisk selling pressure over the weekend. The crypto fear and greed index has maintained its position in the neutral zone since yesterday with a score of 47 points. This could be attributed to the ongoing lawsuits by the SEC against Binance and Coinbase, which has led to a mass exodus of deposits in these exchanges,\" Parth Chaturvedi, Investments Lead, CoinSwitch Ventures said.The total volume in DeFi is currently 1.9 billion, 7% of the total crypto market 24-hour volume. The volume of all stablecoins is now $25.15 billion, which is 94% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, was around $501 billion. BTC volume stood at approximately $11.55 billion, falling 24% in the last 24 hours. Bitcoin’s dominance is currently 47%, an increase of 0.21% over the day, according to CoinMarketCap.Rajagopal Menon, Vice President at WazirX said, \"Major market oscillators point toward a Neutral sentiment. The Relative Strength Index (14), one of the key indicators, sits at 41, with a neutral outlook. The Stochastic %K (14, 3, 3) and the Average Directional Index (14) is at 18 and 26, respectively, further indicating a Neutral market.\"The MACD Level (12, 26) at -376 indicates a Sell. The Stochastic RSI Fast (3, 3, 14, 14) is at 27 with a Neutral indicator, while the Williams Percent Range (14) at −82 signals Neutral,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com, data as of 12.20 hours, IST on June 12, 2023)Bitcoin $25,864 0.28%Ethereum $1,741 -0.92%Tether $1.00 -0.03%BNB $225 -5.18%XRP $0.514 1.32%Cardano $0.2764 4.52% Dogecoin $0.6084 -2.02%Polygon $0.6328 4.18%Solana $15.19 -2.76%Litecoin $76.44 -1.45%Polkadot $4.5 0.70%Tron $0.06982 0.72%Avalanche $11.43 -1.80%Shiba Inu $0.000006584 -3.58%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    }
]