[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wMy8wOS93aGF0LWhhcHBlbnMtaWYtZXRoZXJldW0taXMtYS1zZWN1cml0eS_SAVZodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMDMvMDkvd2hhdC1oYXBwZW5zLWlmLWV0aGVyZXVtLWlzLWEtc2VjdXJpdHkvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "What Happens if Ether Is a Security? - CoinDesk",
        "content": "It is not, however, a foregone conclusion that the SEC will seek to classify ETH as a security. \"From a practical standpoint I still think it is very unlikely that the SEC is going to declare the current offer and sale of ETH to involve unregistered securities transactions,\" said Gulovsen, because \"the impact of doing so would be devastating to a large number of American investors\" and \"the amount of resources necessary to properly enforce that declaration\" would be \"far beyond what the SEC is probably willing\" to allocate."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiOmh0dHBzOi8vdGhlZGVmaWFudC5pby9tYXJrZXRzLWRvd24tbnlhZy1jYWxscy1ldGgtc2VjdXJpdHnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 21:29:27 GMT",
        "title": "ETH Crashes 7% After NYAG Calls Ethereum A Security - The Defiant - DeFi News",
        "content": "Crypto Exchange Kucoin Accused Of Acting As Unlicensed Broker-Dealer\n\nBy: Aleksandar Gilbert • Loading...\n\nBreaking News\n\nCrypto markets plummeted Thursday after the New York Attorney General called Ether a security in a lawsuit against crypto exchange KuCoin.\n\nBitcoin and Ether fell more than 7% on the news. Tokens for BNB, Cardano and Polygon, the largest smart contract platforms by market capitalization after Ethereum, are down more than 6% from the previous day.\n\nIn its lawsuit, the New York Attorney General’s office accused KuCoin of acting as a securities broker-dealer and “falsely representing itself as an exchange.”\n\n“KuCoin did not have the necessary license to operate in the state of New York. That representatives from the attorney general’s office were able to buy and sell cryptocurrency through the site constituted a clear violation of the law,” they said.\n\nThe lawsuit seeks to block New Yorkers’ access to KuCoin “until it complies with the law.”\n\nIn a news release, the office highlighted its categorization of ETH as a security.\n\n“The petition argues that ETH, just like LUNA and UST, is a speculative asset that relies on the efforts of third-party developers in order to provide profit to the holders of ETH,” the release notes."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiNGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V0aC1zZWN1cml0eS1hbGxlZ2VzLW55YWfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "New York AG Alleges ETH is a Security in KuCoin Lawsuit - Blockworks",
        "content": "New York Attorney General Letitia James became the first regulator in the US to claim in court that ethereum is a security in a lawsuit against exchange KuCoin.\n\nSeychelles-based KuCoin has been operating in New York without registering as a securities and commodities broker-dealer, James alleged in the suit.\n\nKuCoin facilitates trading of ETH, James added, “a speculative asset that relies on the efforts of third-party developers in order to provide profit to the holders of ETH.” The exchange should have registered before offering ETH, LUNA and TerraUSD — all of which fall under the securities classification, according to James.\n\nHowever, the NYAG may not have the final say on the issue. Rostin Behnam of the CFTC told the Senate Agriculture Committee as recently as Wednesday that ETH is in fact a commodity, not a security.\n\n“We would not have allowed the Ether futures product to be listed on a CFTC exchange if we did not feel strongly that it was a commodity asset,” he explained.\n\nSEC leaders have made similar statements. In 2018, William Hinman, the then-Director of Corporate Finance at the SEC, said in a speech that both bitcoin and ETH are not securities. His justification was that bitcoin is “decentralized” and ETH, despite its 2014 initial coin offering, had become “sufficiently decentralized” over the past four years to make it a non-security.\n\nThe Office of the State Attorney General (OAG) confirmed KuCoin’s alleged unlawful actions because OAG Detective Brian Metz has been transacting on the exchange from New York since May 2022, the lawsuit states.\n\nKuCoin’s lending and staking product, KuCoin Earn, is also an unregistered security offering, the lawsuit alleges.\n\nThe OAG served KuCoin a subpoena on Jan. 10, 2023 but respondents did not reply and failed to appear to testify on the date specified in the subpoena, the lawsuit claims.\n\nThe lawsuit is similar to a suit brought against exchange CoinEx in February alleging the exchange offered trading services for tokens including AMP, LUNA and LBC, all of which the Attorney General’s office says are securities."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1pcy1wbHVuZ2luZy0xNTAwL9IBSWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1pcy1wbHVuZ2luZy0xNTAwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "Ethereum Price is Plunging, But It’s Too Early to Say Bulls Have Given Up - NewsBTC",
        "content": "Ethereum price is moving lower below $1,600 against the US Dollar. ETH must stay above the $1,500 support zone to start a recovery wave.\n\nEthereum is eyeing an upside break above the $1,560 and $1,580 resistance levels.\n\nThe price is trading below $1,560 and the 100 hourly simple moving average.\n\nThere is a connecting bearish trend line forming with resistance near $1,550 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could correct higher if there is a move above the $1,560 resistance zone.\n\nEthereum Price Extends Losses\n\nEthereum price failed to clear the $1,580 and $1,600 resistance levels. ETH formed a high near $1,565 and recently started a fresh decline. There was a move below the $1,545 support zone.\n\nThe price traded as low as $1,525 and the bulls were active above the $1,500 level. It is now consolidating losses below $1,560 and the 100 hourly simple moving average. Ether price corrected a few points above the $1,540 resistance zone.\n\nIt cleared the 23.6% Fib retracement level of the downward move from the $1,565 swing high to $1,525 low. On the upside, the price is facing resistance near the $1,550 zone. There is also a connecting bearish trend line forming with resistance near $1,550 on the hourly chart of ETH/USD.\n\nThe first major resistance is near the $1,560 zone. It is near the 76.4% Fib retracement level of the downward move from the $1,565 swing high to $1,525 low.\n\nSource: ETHUSD on TradingView.com\n\nThe next major resistance is near the $1,575 level, above which the price might start a decent increase. The next major resistance is near the $1,600 zone. A close above the $1,600 resistance zone might start a major upward move. In this case, the price may perhaps rise towards the $1,650 level.\n\nMore Losses in ETH?\n\nIf ethereum fails to clear the $1,560 resistance, it could start another decline. An initial support on the downside is near the $1,525 level.\n\nThe next major support is near the $1,500 zone. If there is a break below $1,500, the price might drop towards $1,435. Any more losses might call for a test of the $1,400 level.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is now gaining momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 level.\n\nMajor Support Level – $1,500\n\nMajor Resistance Level – $1,560\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZGVjcnlwdC5jby8xMjMxMDIvbmV3LXlvcmstYXR0b3JuZXktZ2VuZXJhbC1rdWNvaW4tZXRoZXJldW0tc2VjdXJpdHnSAVJodHRwczovL2RlY3J5cHQuY28vMTIzMTAyL25ldy15b3JrLWF0dG9ybmV5LWdlbmVyYWwta3Vjb2luLWV0aGVyZXVtLXNlY3VyaXR5P2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "New York Attorney General Sues KuCoin, Claims Ethereum Is a Security - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe New York Attorney General's office today filed a lawsuit against cryptocurrency exchange KuCoin for allegedly violating securities and commodities laws in the state.\n\nIn the complaint, Attorney General Letitia James makes the startling claim that not only are Terra (LUNA) and TerraUSD (UST) securities, as previously alleged by the United States Securities and Exchange Commission, but also Ethereum (ETH), the second-largest cryptocurrency by market capitalization.\n\n“This action is one of the first times a regulator is claiming in court that ETH, one of the largest cryptocurrencies available, is a security,” today’s announcement read. “The petition argues that ETH, just like LUNA and UST, is a speculative asset that relies on the efforts of third-party developers in order to provide profit to the holders of ETH.”\n\nAD\n\nAD\n\nThe NYAG's lawsuit targets KuCoin for allegedly “falsely representing itself as an exchange” when really it is a “securities and commodities broker-dealer.” It aims to block access to the exchange in New York by forcing KuCoin to geo-fence its website based on IP addresses and GPS location.\n\nThe Seychelles-based exchange ranks fifth on CoinGecko's list of crypto exchanges based on \"trust score\" and 17th in the world based on 24-hour trading volume. KuCoin allows users to buy and sell cryptocurrencies like Bitcoin and Ethereum from virtually anywhere in the world, including the United States. The company once touted itself as “the most advanced and secure cryptocurrency exchange,\" before suffering a $150 million hack in 2020.\n\nThe lawsuit argues that ETH is a security because, among other reasons, users can now earn financial rewards by holding the cryptocurrency. “Since transitioning to the proof-of-stake consensus, possession of ETH translates directly to profit potential by earning staking rewards,” reads the lawsuit.\n\nEthereum last year became a proof-of-stake blockchain. This is a consensus mechanism which requires users to stake or “lock-up” its native cryptocurrency, ETH, to keep the network running. And the more ETH a user stakes, the more rewards they can potentially earn.\n\nThe timing of the lawsuit is also notable, given the attention that staking services have received lately from regulators. Just last month, the SEC fined popular American exchange Kraken $30 million because its staking product allegedly violated securities laws. And SEC Chairman Gary Gensler has hinted that Ethereum may be on the Commission's radar, repeatedly making public statements that suggest Bitcoin is the only crypto asset the SEC believes is a non-security.\n\nAD\n\nAD\n\nAttorney General Letitia James’s move is the latest in a tough crackdown by U.S. authorities on the crypto industry.\n\nThe SEC has ramped up enforcement actions of late, and politicians and lawmakers have turned up the anti-crypto rhetoric following the dramatic collapse of the once-dominant FTX crypto exchange and the arrest of its founder Sam Bankman-Fried.\n\nThe state of New York, which has some of the strictest laws in the country regarding crypto, last month filed a lawsuit against crypto exchange CoinEx for also failing to register itself as a securities and commodities broker-dealer."
    }
]