[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvZXRoZXJldW0taXMtdHVybmluZy1kZWZsYXRpb25hcnktYnV0LXByaWNlLXJlbWFpbnMtc3RhZ25hbnTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 08 Aug 2023 07:00:00 GMT",
        "title": "Ethereum Is Turning Deflationary, But Price Remains Stagnant - Watcher Guru",
        "content": "According to Ultra Sound Money data, as of August 7, the Ethereum (ETH) network has burned over half the coins issued since the merge. Around 6.5 million ETH coins have been issued since the merge, and over 3.5 million of them have been burned.\n\nEthereum currently has a supply of about 120.2 million coins. And since the model is still inflationary, more coins are added every year. As of now, the network adds about 580,000 ETH each year. However, the Ethereum network burns about 1.75 million ETH each year, lowering the supply by roughly 0.98%. This makes the platform somewhat deflationary because the circulating ETH amount reduces as coins get actively burned on the network.\n\nAlso Read: Ethereum: These ETH Futures ETFs Are Awaiting Approval\n\nPresently, gas fees generated by ETH transfers and smart contract operations are the main drivers of these burns. Additionally, NFT and DeFi platforms like OpenSea and UniSwap, also play a role. Additionally, the transfer of USDT, an ERC-20 token on the ETH network, also adds to ETH burns.\n\nWill Ethereum prices react to the burns?\n\nSource: Forbes\n\nSo far, ETH’s prices have not heavily responded to the burns. This could be because of less demand as of now. Burns without demand will do little to push the asset’s price. However, the project’s end goal is for the burn rate to outpace the rate of issuing new coins. This would effectively turn Ethereum (ETH) deflationary.\n\nAlso Read: How To Check An Ethereum Transaction?\n\nMoreover, many argue that ETH has become more deflationary than Bitcoin (BTC) after the implementation of the EIP-1559 protocol. This protocol is responsible for burning a fraction of the gas fee from each transaction. However, ETH does not have a fixed cap on its supply, unlike BTC which is capped at 21 million coins. Therefore, ETH’s burn rate will have to outpace its issuance in order for it to be truly considered a deflationary asset. At press time, Ethereum was trading at $1,833.89, down by 0.2% in the last 24 hours."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2xpZG9zLWFkb3B0aW9uLXN1cmdlcy13aXRoLTEwMDAwLW5ldy1zdGFrZXJzLWRlc3BpdGUtZXRoZXJldW1zLXByaWNlLXN0cnVnZ2xlcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 08 Aug 2023 07:00:00 GMT",
        "title": "Lido adoption surges with 10000 new stakers despite Ethereum's price struggles - CryptoSlate",
        "content": "More than 10,000 new stakers joined Lido (LDO) in July, according to the latest report from the liquid staking protocol, indicating its continued adoption and growth despite the current market situation.\n\nIn July, Lido’s TVL briefly exceeded $15 billion for the first time since May 2022 but fell below the benchmark due to Ethereum’s (ETH) price struggles.\n\nOver the preceding month, the value of Ether underwent a modest decline of approximately 3% to $1,815 as of press time, according to CryptoSlate’s data. This price correction emerged as the initial enthusiasm within the crypto market, fueled by a bullish streak in June primarily driven by institutional investors, gradually subsided.\n\nEven though Lido’s TVL experienced a decline from its impressive $15 billion benchmark, it retains its position as the foremost DeFi protocol. Notably, Lido continues to command a substantial 36% share of the aggregate TVL encompassing all DeFi projects.\n\nPredicts staked Ether to grow beyond 8M\n\nThe DeFi protocol predicted that the total number of staked Ethereum via its platform will surpass eight million in August, as it has consistently experienced large monthly net inflows despite the activation of withdrawals.\n\nDeFillama data shows that this prediction has come to pass with the total value of assets locked on Lido in terms of Ethereum currently at 8.08 million ETH, an all-time high. However, Lido’s website places the number at around 7.9 million as of press time.\n\nCurve Finance exploit impact Lido\n\nIn the wake of the recent exploit of Curve Finance, several liquidity providers withdrew their assets from the platform’s stETH-ETH pool.\n\nDespite the fact that this specific pool remained untouched by the exploit, stETH’s usage in DeFi experienced a decline of 2.88% compared to the previous month of June. Consequently, the overall share held within the liquidity pools also underwent a substantial contraction, plummeting by 53.07%.\n\nOther metrics\n\nLido’s increasing adoption has also translated into the growing adoption of its staked ETH. The number of unique addresses holding stETH increased by 9.26% from June to 255,000. The amount in lending pools also increased by 3.63%, while wstETH in Layer-2 networks jumped by 12.83%.\n\nThe demand for wrapped staked ETH on the layer-2 networks has also increased, with Arbitrum and Optimism bridges witnessing more wstETH deposits.\n\nHowever, Lido’s LDO token struggled considerably in July, falling 7% amid the contagion fears that gripped the DeFi market.\n\nMentioned in this article"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vd3d3LmNvaW50cmlidW5lLmNvbS9lbi9jcnlwdG8tZXRoZXJldW0tbGVtcGlyZS1kdS1jeWJlcmNyaW1lLTIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 08 Aug 2023 07:00:00 GMT",
        "title": "Crypto: Ethereum, the empire of cybercrime - Cointribune EN",
        "content": "Tue 08 Aug 2023 ▪ 4 min of reading ▪ by Evans S.\n\nIn the crypto sector, Ethereum presents itself not as an idyllic asylum, but rather as an unsuspected empire of cybercrime. On this digital stage, an alarming manifestation of crime thrives, the titanic scale of which was recently unveiled by insightful researchers.\n\nThe proliferating shadow of cybercrime on Ethereum\n\nThe spectre of cybercrime is spreading in the shadow of the Ethereum network. While bitcoin remains the undisputed behemoth of the cryptosphere, Ethereum stands out for the complexity of its fraudulent activities, according to researchers.\n\nIts ability to host smart contracts offers a wider range of digital crimes. This characteristic transforms Ethereum into a veritable cybercrime empire.\n\nAccording to information extracted from blockchain explorers such as Etherscan, an alarming number of over 5,600 Ethereum addresses have been identified as being linked to cybercrime activities.\n\nWhat’s more, these findings find a powerful echo in the rigorous analyses carried out by Whale Alert’s ScamAlert. Together, these data reveal the frightening extent of cybercrime in the Ethereum ecosystem.\n\nThese tagged addresses traced over 1.78 million transactions from unsuspecting victims, totaling a staggering $1.65 billion in stolen funds. This figure is almost 16 times greater than self-reported losses to the FTC, revealing the severe extent to which crypto cybercrime is under-reported by regulators.\n\nThe many faces of cybercrime on Ethereum\n\nOn the throne of Ethereum crime, Ponzi schemes reign supreme. They account for 60% of stolen funds, far surpassing the scale of traditional financial Ponzi schemes. Fraudulent donations follow at 18%, followed by mining (13%) and hacking (5%).\n\nThe pseudonymity offered by blockchain has given Ponzi scams a mask of anonymity. This makes them harder to detect and crack down on.\n\nWhat’s more, the global reach of cryptocurrencies has widened the scope of these scams. As a result, crypto-Ponzi scams have become a ubiquitous and worrying threat to investors worldwide.\n\nBut the evil doesn’t stop there. New cybercrimes are emerging, specific to the cryptocurrency ecosystem. Rug pulls”, for example, lure investors into new projects only to abandon them abruptly, draining all liquidity. Phony token scams create worthless imitations of real coins to fool traders.\n\nRepercussions and the need for a shift in direction\n\nBeyond simple quantification, the researchers analyzed the impact of cybercrime on investor behavior.\n\nIn the short term, victims obtain higher returns by taking greater risks. But over the long term, their risk-adjusted returns significantly underperform those of non-victims.\n\nImproved consumer protection is urgently needed to safeguard mainstream investors as cryptocurrency adoption grows. Regulators must also step up their efforts to curb illicit crypto activity, before it seriously undermines confidence in blockchain technology as a whole.\n\nOnly increased diligence on the part of legislators and investors will enable decentralized finance innovation to continue to flourish. What’s more, Bitcoin’s spectacular spike to $150k during its halving could attract an influx of newcomers, unfortunately opening the door to a potential multiplication of scams. Stay safe!\n\nMaximize your Cointribune experience with our 'Read to Earn' program! Earn points for each article you read and gain access to exclusive rewards. Sign up now and start accruing benefits.\n\nClick here to join 'Read to Earn' and turn your passion for crypto into rewards!\n\nA A Lien copié"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vZmluYm9sZC5jb20vNS1mYWN0b3JzLXRoYXQtY291bGQtc2VuZC1ldGhlcmV1bS10by01MDAwL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 08 Aug 2023 07:00:00 GMT",
        "title": "5 factors that could send Ethereum to $5,000 - Finbold - Finance in Bold",
        "content": "With the majority of the cryptocurrency market dragging its feet in recent weeks, it is no surprise that its second-largest asset by market cap, Ethereum (ETH), is doing the same. However, the hope remains it could hit the high price level of $5,000 sometime in the future.\n\nAs it happens, Ethereum managed to get close to this mark on November 9, 2021, when it reached its all-time high (ATH) of $4,815.01, climbing by 168.25% from the $1,794.97 where it stood on July 21, 2021, which is close to its price at present and suggests a very real possibility of repeating this success.\n\nWith this in mind, Finbold has analyzed the main factors that could (but do not necessarily have to) lead Ethereum closer to the $5,000 price level and eventually overtake it – either by themselves or together with other influences.\n\nMass adoption of Ethereum-based applications\n\nWith Ethereum being the most popular blockchain choice to build a wide range of decentralized applications (dApps) on, such as in the sector of decentralized finance (DeFi), non-fungible tokens (NFTs), and gaming, it could help its cryptocurrency grow further in price, thanks to the growing demand.\n\nFor instance, one of the major companies building on the Ethereum blockchain is PayPal (NASDAQ: PYPL), which has recently announced the launch of its own ERC-20 United States dollar-pegged stablecoin PayPal USD (PYUSD), issued by crypto firm Paxos Trust Company, as Finbold reported on August 7.\n\nImproved scalability\n\nWith the launch of the better-performing, more accessible ‘Ethereum 2.0,’ the network has improved its scalability, helping it handle more transactions per second and making it more attractive to users and developers. If this trend continues, it could lead to growing demand for Ethereum and its higher price.\n\nIndeed, the Ethereum development team has been working hard on boosting the network’s usability, the work that also brought a shift from the proof-of-work (PoW) to the proof-of-stake (PoS) model with an aim to reduce energy waste and transaction times, as well as improve scalability.\n\nInstitutional adoption\n\nOn top of that, more institutional investors recognizing Ethereum’s potential and buying more ETH could drive the price higher simply by following the rules of supply and demand – the more desirable an asset is, the higher its price, and institutions can have the power to contribute in shaping market trends.\n\nFurthermore, Ethereum’s advance could also happen under the influence of the Tesla (NASDAQ: TSLA) and X (formerly Twitter) CEO, Elon Musk, supporting the bold prediction on the future of the crypto market that could see both Ethereum and Bitcoin (BTC) surge massively.\n\nRegulatory environment\n\nAmid increased regulatory pressure, particularly in the US, which has culminated in multiple lawsuits against some of the industry’s largest representatives, the cryptocurrency market as a whole can feel its effects, which is why positive regulatory developments and favorable regulations for digital assets could help drive their prices, including Ethereum.\n\nOne example of such positive developments is the refusal of the British financial services minister, Andrew Griffith, to agree with the Treasury Committee’s recommendation to regulate retail trading and investing in unbacked crypto assets as gambling in late July and his support of their treatment as other financial services.\n\nMarket sentiment\n\nFinally, the atmosphere in the wider crypto and macroeconomic landscape can often influence the price of particular assets, including cryptocurrencies like Ethereum, for instance, with positive (or negative) developments and news coverage about the industry.\n\nIndeed, the above factors could contribute to the bullish sentiment, and when people are feeling bullish about digital assets in general, they are more likely to invest in them, and the positive sentiment could affect the price of ETH, which is more likely to increase.\n\nEthereum price analysis\n\nMeanwhile, Ethereum was at press time changing hands at the price of $1,828.2, the same as the day before, in addition to losing 0.29% in the last week and declining 2.05% on its monthly chart, as per the latest information retrieved on August 8.\n\nEthereum 7-day price chart. Source: Finbold\n\nIn conclusion, time will tell if the above factors are truly powerful enough to push the price of Ethereum toward $5,000. But one thing is for certain – they could, indeed, contribute to its strengthening and, in time, possibly reaching this coveted price level.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9wYXlwYWwtdXNkLWJvb24tZm9yLWV0aGVyZXVtLWJ1dC1ub3QtZGVjZW50cmFsaXphdGlvbi1zYXlzLWNvbW11bml0edIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 08 Aug 2023 07:00:00 GMT",
        "title": "PayPal USD: Boon for Ethereum but not decentralization, says community - Cointelegraph",
        "content": "PayPal’s new Ethereum-based stablecoin, PYUSD, has been seen as bittersweet news for the crypto community.\n\nWhile it could finally see Ethereum find its place in mainstream adoption, it could also spell trouble for decentralization and personal control of assets, warns the community.\n\nThe new stablecoin, PayPal USD, was launched on Aug. 7 and is issued by Paxos Trust Co. — the firm behind Binance USD (BUSD). It’s built on Ethereum and “designed for digital payments and Web3,” with the firm saying it will soon be available to United States customers.\n\nThe launch has been seen as a boon for Ethereum adoption. Ethereum bulls Anthony Sassano and Ryan Sean Adams believe the ERC-20 stablecoin will push the blockchain closer toward becoming the money layer of the internet.\n\nThis is the Ethereum contract address for PayPal's stablecoin.\n\n\n\nI can't believe i get to tweet that.\n\n\n\nWe've come so far. pic.twitter.com/S6kSqcV4ut — RYAN SΞAN ADAMS - rsa.eth (@RyanSAdams) August 7, 2023\n\nThe number of daily active users on Ethereum currently hovers between 300,000-400,000, according to Etherscan.\n\nHowever, Sean Adams noted that 430 million accounts actively use the online payment processor, which means that over 5% of the world’s 8 billion people could theoretically be onboarded onto Ethereum through PayPal’s new stablecoin.\n\nMartin Koppelmann, the CEO and co-founder of Gnosis, added that by launching PYUSD on Ethereum’s base layer, Ethereum layer-2s will be able to interact with PYUSD too.\n\nOthers, including lawmakers, have seen it as another example of larger institutions embracing crypto, breathing new life into the traditional payments system.\n\nIn an Aug. 7 statement, Patrick McHenry, chair of the United States House Committee on Financial Services, said stablecoins like PayPal’s PYUSD “hold promise as a pillar of our 21st century payments system.”\n\n#NEW: Chairman @PatrickMcHenry releases a statement following the announcement of PayPal's payment stablecoin launch.\n\n\n\nRead more https://t.co/LOF9ayUNnG pic.twitter.com/sRfSfLYbXQ — Financial Services GOP (@FinancialCmte) August 7, 2023\n\nHowever, not everyone is convinced about PayPal’s new stablecoin.\n\nSeveral smart contract auditors highlighted that PYUSD’s smart contract contains “freezefunds” and “wipefrozenfunds” functions, which they claim are textbook examples of centralization attack vectors in Solidity contracts.\n\nThe new Paypal USD stablecoin has an \"assetProtection\" role which can wipe your balance in two transactions (first `freeze`, then `wipeFrozenAddress`)\n\n\n\nIn smart contract security we call this a \"centralisation attack vector\" pic.twitter.com/RsmqvsnKvi — pashov (@pashovkrum) August 7, 2023\n\nThis concern was echoed by cryptocurrency researcher Chris Blec, who believes that PayPal will use the controversial functions where necessary.\n\nDigital asset lawyer Sasha Hodder believes many characteristics of PayPal’s stablecoin resemble that of a censorship-enabled central bank digital currency. Another smart contract auditor noted that PYUSD’s smart contract can be changed by PayPal at any time.\n\nI just read the PayPal USD terms of service.\n\n\n\n- full KYC\n\n- custody by Paxos\n\n- tied to your PayPal login\n\n- PayPal can reverse any transaction\n\n- claimed to be fully backed by actual USD\n\n\n\nAll the censorship capabilities of a CBDC, but launched by big tech instead of the gov't. — Sasha Hodder (@sashahodler) August 7, 2023\n\nIn October, PayPal was slammed for a controversial policy that could’ve seen users fined $2,500 for spreading “misinformation.” The firm later backpedalled, claiming the policy update was published “in error.”\n\nRelated: PayPal’s crypto holdings increased by 56% in Q1 2023 to nearly $1B\n\nMeanwhile, blockchain engineer Patrick Collins took a slightly more neutral view, suggesting that PayPal’s PYUSD could have been “epic” but believes some of the engineering choices were suboptimal — such as choosing an outdated version of Solidity to program the contract, making the contract upgradeable and not making it gas efficient.\n\nSassano also explained in a separate post that while PayPal’s stablecoin is centralized, Ethereum users are free to choose whether they wish to use it or not.\n\nYes, PayPal's stablecoin is centralized.\n\n\n\nNo, that doesn't make it any less cool that PayPal has a stablecoin.\n\n\n\nEthereum being a settlement layer for all types of value means that different types of assets will exist on the network & you get to choose which ones you want to use. — sassal.eth (@sassal0x) August 8, 2023\n\nPayPal said PYUSD will be rolled out within the next few weeks.\n\nETH is currently priced at $1,825, which is approximately the same price at the time of PayPal’s announcement about 10 hours ago, according to CoinGecko. Only minor fluctuations have been observed in ETH’s price since then.\n\nMagazine: DeFi Dad, Hall of Flame: Ethereum is ‘woefully undervalued’ but growing more powerful"
    }
]