[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaW5hbmNlLWludHJvZHVjZXMtZXRoZXItYmFzZWQtbGlxdWlkLTEzMzgyMTQ0Ny5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Apr 2023 07:00:00 GMT",
        "title": "Binance Introduces Ether-based Liquid Staking Product Amid Ethereum 2.0 Transition - Yahoo Finance",
        "content": "Binance Introduces Ether-based Liquid Staking Product Amid Ethereum 2.0 Transition\n\nBinance Introduces Ether-based Liquid Staking Product Amid Ethereum 2.0 Transition\n\nBinance, one of the world's largest cryptocurrency exchanges, has announced the launch of an Ether-based liquid staking product. This new offering allows users to earn staking rewards on their Ether holdings without locking up their assets, providing increased flexibility and liquidity. The product is designed to capitalize on the growing demand for Ethereum staking as the network transitions to Ethereum 2.0 and the Proof of Stake (PoS) consensus mechanism.\n\nThis move by Binance is expected to further solidify its position as a leading provider of staking services, while also catering to the needs of the Ethereum community. The introduction of Ether-based liquid staking reflects the rising popularity of staking services and the growing acceptance of Ethereum's Proof of Stake system.\n\nBinance says its new Ether-based liquid staking product lets users stake their Ether and get rewards without the hassle of running or delegating a validator node. Users will be able to stake any amount of Ether and receive BETH tokens in return, which represent their staked Ether and the accrued rewards. BETH tokens can be freely traded, transferred, or used as collateral on Binance’s platform, giving users more options and flexibility with their staked assets."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaW5hbmNlLWludHJvZHVjZXMtZXRoZXItYmFzZWQtbGlxdWlkLTEzMzgyMTQ0Ny5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Apr 2023 07:00:00 GMT",
        "title": "Binance Introduces Ether-based Liquid Staking Product Amid Ethereum 2.0 Transition - Yahoo Finance",
        "content": "Binance Introduces Ether-based Liquid Staking Product Amid Ethereum 2.0 Transition\n\nBinance Introduces Ether-based Liquid Staking Product Amid Ethereum 2.0 Transition\n\nBinance, one of the world's largest cryptocurrency exchanges, has announced the launch of an Ether-based liquid staking product. This new offering allows users to earn staking rewards on their Ether holdings without locking up their assets, providing increased flexibility and liquidity. The product is designed to capitalize on the growing demand for Ethereum staking as the network transitions to Ethereum 2.0 and the Proof of Stake (PoS) consensus mechanism.\n\nThis move by Binance is expected to further solidify its position as a leading provider of staking services, while also catering to the needs of the Ethereum community. The introduction of Ether-based liquid staking reflects the rising popularity of staking services and the growing acceptance of Ethereum's Proof of Stake system.\n\nBinance says its new Ether-based liquid staking product lets users stake their Ether and get rewards without the hassle of running or delegating a validator node. Users will be able to stake any amount of Ether and receive BETH tokens in return, which represent their staked Ether and the accrued rewards. BETH tokens can be freely traded, transferred, or used as collateral on Binance’s platform, giving users more options and flexibility with their staked assets."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaW5hbmNlLWludHJvZHVjZXMtZXRoZXItYmFzZWQtbGlxdWlkLTEzMzgyMTQ0Ny5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Apr 2023 07:00:00 GMT",
        "title": "Binance Introduces Ether-based Liquid Staking Product Amid Ethereum 2.0 Transition - Yahoo Finance",
        "content": "Binance Introduces Ether-based Liquid Staking Product Amid Ethereum 2.0 Transition\n\nBinance Introduces Ether-based Liquid Staking Product Amid Ethereum 2.0 Transition\n\nBinance, one of the world's largest cryptocurrency exchanges, has announced the launch of an Ether-based liquid staking product. This new offering allows users to earn staking rewards on their Ether holdings without locking up their assets, providing increased flexibility and liquidity. The product is designed to capitalize on the growing demand for Ethereum staking as the network transitions to Ethereum 2.0 and the Proof of Stake (PoS) consensus mechanism.\n\nThis move by Binance is expected to further solidify its position as a leading provider of staking services, while also catering to the needs of the Ethereum community. The introduction of Ether-based liquid staking reflects the rising popularity of staking services and the growing acceptance of Ethereum's Proof of Stake system.\n\nBinance says its new Ether-based liquid staking product lets users stake their Ether and get rewards without the hassle of running or delegating a validator node. Users will be able to stake any amount of Ether and receive BETH tokens in return, which represent their staked Ether and the accrued rewards. BETH tokens can be freely traded, transferred, or used as collateral on Binance’s platform, giving users more options and flexibility with their staked assets."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNC8yNS9zdG9jay1tYXJrZXQtbGlrZWx5LWhlYWRzLW11Y2gtaGlnaGVyLWFzLWV0aGVyZXVtLWZvbGxvd3MtYml0Y29pbnMtMjAxNS1wcmljZS1wYXRoLXNheXMtbWFjcm8tZ3VydS1yYW91bC1wYWwv0gGSAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA0LzI1L3N0b2NrLW1hcmtldC1saWtlbHktaGVhZHMtbXVjaC1oaWdoZXItYXMtZXRoZXJldW0tZm9sbG93cy1iaXRjb2lucy0yMDE1LXByaWNlLXBhdGgtc2F5cy1tYWNyby1ndXJ1LXJhb3VsLXBhbC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Apr 2023 07:00:00 GMT",
        "title": "Stock Market Likely Heads ‘Much Higher’ As Ethereum Follows Bitcoin’s 2015 Price Path, Says Macro Guru Raoul Pal - The Daily Hodl",
        "content": "Real Vision founder and macro guru Raoul Pal is expressing bullish sentiment on the stock market and Ethereum (ETH).\n\nIn the latest installment of the Global Macro Investor newsletter, Pal says the bullish thesis on the stock market partly stems from the recent weakness of the US dollar index (DXY), which suggests that investors are leaving the safety of the dollar in favor of risk assets like equities and crypto.\n\nAccording to the macro guru, the DXY is flashing a bearish pattern that if confirmed, could give stocks and crypto a boost.\n\n“The DXY looks to be forming a big head-and-shoulders top. A break of 101 will lead to significant downside (but all within a secular dollar bull market). This should give risk assets a tailwind…”\n\nLooking at global equities, Pal says that the stock market looks poised to break out from a bullish head-and-shoulders pattern.\n\n“Global equities just look like the mirror image of the DXY and appear to be forming a large head-and-shoulders bottom. Again, all eyes on a potential DXY breakdown of 101. That’s the signal to watch for and will probably suggest equities head much higher from here…”\n\nAs for Ethereum, the macro guru says that the second-largest crypto asset by market cap appears to be following in the footsteps of Bitcoin’s (BTC) 2015 price action when it rallied from below $2,000 to above $3,000 in less than a year.\n\n“We’ll also throw in this chart on ETH that, as we’ve been flagging for quite some time, continues to trade a lot like Bitcoin during the 2014-2016 period…”\n\nAt time of writing, Ethereum is trading for $1,842.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiLWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3Zpc2EtY3J5cHRvLWhpcmluZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Apr 2023 07:00:00 GMT",
        "title": "Visa Hiring More Crypto Developers To Drive Mainstream Adoption - Blockworks",
        "content": "Payments giant Visa is looking to add backend developers to its crypto team — particularly those savvy with public blockchains and stablecoins.\n\nCuy Sheffield, Visa’s vice president and head of crypto, tweeted the vacancies on Thursday, saying the roles would help drive mainstream adoption of the technologies.\n\nVisa is specifically seeking individuals who have worked with cutting-edge AI-assisted engineering tools like Github Copilot to develop and debug smart contracts.\n\nThe job listing separately states that Visa is looking for engineers who are “passionate about the Web3 stack of technologies.”\n\nExpected experience includes testing frameworks such as Truffle, Mocha and Hardhat. Visa prefers hearing from candidates who have a good understanding of Layer-1 and Layer-2 solutions, as well as working knowledge of writing smart contracts using Solidity, Ethereum’s programming language.\n\nThey should also have an understanding of public and permissioned distributed ledger technology, security protocols and the new Ethereum account standard, ERC-4337.\n\nLoading Tweet..\n\nPublic blockchains refer to networks which don’t require prior authorization to join as validators, with Bitcoin and Ethereum the two most prominent examples. Permissioned blockchains differ in that vetted operators control most of the functions on the network.\n\nIn February, Visa rejected reports stating it would halt crypto activities after the collapse of high-profile companies across the ecosystem. Sheffield said on Twitter that the company continued to work with crypto firms to provide fiat on- and off-ramps and said its view on the potential of crypto has not changed.\n\nA Visa spokesperson at the time confirmed to Blockworks that the company was keeping close tabs on the industry and regulatory developments, saying it was committed to expanding offerings in the space.\n\nThe firm set up an advisory unit in late 2021 to help those interested in crypto explore opportunities. Direct rival Mastercard had months earlier flagged intent to adopt crypto on its payment network, starting with stablecoins.\n\nVisa has also recently explored the conversion of digital assets into fiat payments, similar to its existing currency conversion services.\n\nSheffield revealed at the StarkWare Sessions 2023 event in Tel Aviv that Visa has been testing settlement payments in stablecoin USDC on Ethereum.\n\nDon’t miss the next big story – join our free daily newsletter."
    }
]