[
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vZGFpbHljb2luLmNvbS8yMC1wZXJjZW50LXN0YWtlZC1ldGhlcmV1bS1zdGV0aC1pcy1pbi1wcm9maXQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Only 20% of All Staked Ethereum (stETH) is in Profit, Lido Finance Leads Staking - DailyCoin",
        "content": "Data from Dune Analytics shows that only approximately 20% of all staked ETH were done at prices lower than current levels and are still in the money. ETH currently trades at $1,250 from an all-time high of $4,891.\n\nAccording to the data, most of the 20% profit was made at the $600 price level in December 2020 when the Beacon Chain was launched."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDEvMDQvZXRoZXJldW0taW4tMjAyMy1oZXJlcy13aGF0LXRvLWxvb2stZm9yd2FyZC10by_SAVxodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzAxLzA0L2V0aGVyZXVtLWluLTIwMjMtaGVyZXMtd2hhdC10by1sb29rLWZvcndhcmQtdG8vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Ethereum in 2023: Here’s What to Look Forward To - CoinDesk",
        "content": "Devcon, the largest conference for Ethereum developers, is set to take place again in 2023 (though the location has yet to be determined). The conference, which took place in Colombia in 2022, is a highlight among Ethereum lovers, who often meet in different corners of the world to share their thoughts and innovations for the second-largest blockchain."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWFuYWx5c3QtcmV2ZWFscy1uZXcta2V5LWxldmVscy1hcy1ldGhlcmV1bS1wcmljZS1uZWFycy0zLXdlZWstaGlnaNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin analyst identifies new key levels as Ethereum price nears 3-week high - Cointelegraph",
        "content": "Bitcoin (BTC) continued to work on cracking the $17,000 mark on Jan. 4 as an “extremely tight” trading zone held firm.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\n$17,000 “possible” thanks to CPI print\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD hitting $16,906 on Bitstamp, up $300 from the previous day’s low.\n\nThe largest cryptocurrency had benefited from a positive start to the year on Wall Street, this giving a broader boost to previously sideways crypto assets.\n\n“Bitcoin trading with legacy markets yesterday,” Filbfilb, co-founder of trading suite DecenTrader, began a summary of recent events by stating.\n\nAnalyzing the 12-hour chart, he argued that the 50-day moving average (MA) needed to hold for bulls, with the immediate range support and resistance levels at $15,500 and $18,000, respectively.\n\nNext week’s Consumer Price Index (CPI) release for the United States, if favorable, could give BTC price action the catalyst it needs.\n\n“Bitcoin needs to maintain the 50 DMA and break last week's high but a trip there seems possible heading into the CPI data,” Filbfilb added:\n\n“At the moment we are in the upper range of last week’s price action.”\n\nBTC/USD annotated chart. Source: Filbfilb/ Twitter\n\nAs Cointelegraph reported, others had hoped that there would be sufficient impetus for Bitcoin to follow in the footsteps of both stocks and gold as 2023 got underway.\n\nThe latter, trading firm QCP Capital explained on the day, was due to a “Start of year allocation into alternative assets.”\n\nXAU/USD was up 15% in the last two months, it wrote in a market update sent to Telegram channel subscribers, with January historically its best month of the year.\n\n“Despite the mini rally, BTC is still trading in an extremely tight falling wedge - with 18k the key breakout level to the topside,” it continued, echoing Filbfilb:\n\n“In the medium-term, 28k is looking more and more key - as the Head and shoulders neckline, and 61.8% fibonacci retracement level of the $3,858 2020 low to $69,000 2021 high.”\n\nBTC/USD annotated chart. Source: QCP Capital\n\nAnalysis puts faith in $1,000 holding for Ethereum\n\nThe more confident performance looked set to greet Ether (ETH), meanwhile, with solid support levels giving bulls much-needed comfort in the event of a fresh market downturn.\n\nRelated: 3 reasons why it could be a rocky week for Bitcoin, Ethereum and altcoins\n\n“ETH continues looking decidedly more bullish than BTC, although it too is still trading within a consolidation pattern,” QCP wrote:\n\n“The top of the triangle comes in at 1,400 but the big resistance zone lies between 1,700 to 2,000 to the topside. On the downside we expect 1,000-1,100 to be very decent support.”\n\nETH/USD annotated chart. Source: QCP Capital\n\nETH/USD traded at $1,250 for the first time since Dec. 16 at the time of writing, its Jan. 4 daily candle so far sealing 3% gains.\n\nAnalyzing when the crypto market bottom might come, QCP was nonetheless prepared to lie in wait for many months to come.\n\nETH/USD 1-day candle chart (Binance). Source: TradingView\n\n“We expect this could only come in Oct-Nov again this year, but remain open minded to markets bottoming sooner than that,” it concluded.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmJ1c2luZXNzaW5zaWRlci5jb20vd2lsbC1jcnlwdG8tcmVjb3Zlci1hbmFseXN0cy1vZmZlci1jYXV0aW91cy1idWxsLWNhc2UtMjAyMy0x0gFgaHR0cHM6Ly93d3cuYnVzaW5lc3NpbnNpZGVyLmNvbS93aWxsLWNyeXB0by1yZWNvdmVyLWFuYWx5c3RzLW9mZmVyLWNhdXRpb3VzLWJ1bGwtY2FzZS0yMDIzLTE_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Will crypto recover in 2023? Analysts offer cautious bull case - Business Insider",
        "content": "By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAccess your favorite topics in a personalized feed while you're on the go. download the app\n\nSign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview\n\nCrypto did not have the best year in 2022. While the rest of the economy was on a downward slide, crypto was in a freefall.\n\n\n\nThe average value of bitcoin — the largest held and most well-known cryptocurrency — dropped 64% based on figures from Google Finance. And then came the implosion of FTX, a company that had plastered ads across America for most of 2022. Wall Street banks — which previously sought partnerships with crypto firms to offer access to customers — are newly skeptical about the space. And FTX cofounder Sam Bankman-Fried pleading not guilty to federal charges promises the fallen crypto bro will stay in the public eye.\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nSo, yes, there are many reasons to be pessimistic about crypto in 2023. But Bernstein analysts Gautam Chhugani and Manas Agarwal offer crypto true believers a few reasons to keep the faith.\n\nIn a note published on January 3, they wrote that despite a catastrophic 2022, the larger crypto ecosystem still has potential. Its decentralized nature allows it to bounce back even after debacles like FTX, it has a strong foundation in Ethereum, and crypto will likely benefit from the regulation it will be unable to avoid.\n\nIn their words, crypto has a \"survival instinct.\"\n\nAdvertisement\n\nCrypto keeps bouncing back\n\nThe past year was not the first \"crypto winter.\" Bitcoin saw large price drops in 2014, when annual returns fell by 58%, and prices stayed depressed until 2017. In 2018, Bitcoin plunged in value for nearly 18 months. But it managed to rally both times.\n\nEthereum — the other large crypto token — followed nearly the same pattern of steep declines followed by a sharp rally from 2018 to 2020.\n\nAs Ross Gerber put in during a 2021 appearance on Yahoo Finance Live: \"Bitcoin and Ethereum are like cockroaches. They're just not going to die.\"\n\nOne reason cyrpto is a cockroach is it's a largely decentralized system. Chhugani and Agarwal point out the contagion impact from FTX has not spread widely.\n\nAdvertisement\n\n\"FTX was terrible for the reputation of the sector and affected the faith of institutional investors, who invested in FTX,\" the analysts said. \"But FTX was 10% of the global trading volume and used mainly by wholesale participants such as brokers, trading firms, and large traders.\"\n\nMuch of the crypto space remains decentralized. Take decentralized finance, or DeFi, which uses the same distributed network of computers to provide financial services to people.\n\nChhugani and Agarwal said FTX's collapse had hastened DeFi adoption, which makes DeFi a bright spot in crypto investing, according to crypto VCs.\n\nDeFi's rise\n\nWith DeFi projects largely insulated from FTX's impact, the Bernstein analysts noted investor interest might shift towards Ethereum and its mainly application-based ecosystem.\n\nAdvertisement\n\nEthereum forms the basis of many crypto applications like NFT-based gaming, decentralized social media, and some commerce. These tend to use either the Ethereum blockchain to build or use the Ethereum currency to power transactions. Chhugani and Agarwal said crypto only touches 5% of total internet users, and the primary way of growing the space is through applications.\n\n\"We believe value within crypto will migrate from the speculative crypto assets to more utility and application-driven ecosystems such as Ethereum,\" they said.\n\nThe benefits of regulating the wild west of finance\n\nAgarwal and Chhugani believe regulation is coming for the crypto space and see it benefiting the market.\n\nCrypto enthusiasts typically deride moves to regulate their space. The blockchain and bitcoin began as a reaction to the 2008 financial crisis, and its first adopters had visions of leaving behind the tightly controlled world of traditional finance.\n\nAdvertisement\n\nBut as crypto began moving into the mainstream, investors demanded regulation. And after the fall of FTX, those calls have only increased.\n\nThe analysts said even if regulation brings about adjustments in the crypto market, policies bring in a more sustainable ecosystem and attract more institutional investors. In their view, regulated onshore exchange companies will survive the current cycle.\n\nFor Agarwal and Chhugani, crypto still has strong potential to grow, particularly as people stop seeing it as a quick money-making speculative asset and instead focus on its ability to be a part of the infrastructure of the next decade of internet development."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmJ1c2luZXNzaW5zaWRlci5jb20vd2lsbC1jcnlwdG8tcmVjb3Zlci1hbmFseXN0cy1vZmZlci1jYXV0aW91cy1idWxsLWNhc2UtMjAyMy0x0gFgaHR0cHM6Ly93d3cuYnVzaW5lc3NpbnNpZGVyLmNvbS93aWxsLWNyeXB0by1yZWNvdmVyLWFuYWx5c3RzLW9mZmVyLWNhdXRpb3VzLWJ1bGwtY2FzZS0yMDIzLTE_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Will crypto recover in 2023? Analysts offer cautious bull case - Business Insider",
        "content": "By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAccess your favorite topics in a personalized feed while you're on the go. download the app\n\nSign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview\n\nCrypto did not have the best year in 2022. While the rest of the economy was on a downward slide, crypto was in a freefall.\n\n\n\nThe average value of bitcoin — the largest held and most well-known cryptocurrency — dropped 64% based on figures from Google Finance. And then came the implosion of FTX, a company that had plastered ads across America for most of 2022. Wall Street banks — which previously sought partnerships with crypto firms to offer access to customers — are newly skeptical about the space. And FTX cofounder Sam Bankman-Fried pleading not guilty to federal charges promises the fallen crypto bro will stay in the public eye.\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nSo, yes, there are many reasons to be pessimistic about crypto in 2023. But Bernstein analysts Gautam Chhugani and Manas Agarwal offer crypto true believers a few reasons to keep the faith.\n\nIn a note published on January 3, they wrote that despite a catastrophic 2022, the larger crypto ecosystem still has potential. Its decentralized nature allows it to bounce back even after debacles like FTX, it has a strong foundation in Ethereum, and crypto will likely benefit from the regulation it will be unable to avoid.\n\nIn their words, crypto has a \"survival instinct.\"\n\nAdvertisement\n\nCrypto keeps bouncing back\n\nThe past year was not the first \"crypto winter.\" Bitcoin saw large price drops in 2014, when annual returns fell by 58%, and prices stayed depressed until 2017. In 2018, Bitcoin plunged in value for nearly 18 months. But it managed to rally both times.\n\nEthereum — the other large crypto token — followed nearly the same pattern of steep declines followed by a sharp rally from 2018 to 2020.\n\nAs Ross Gerber put in during a 2021 appearance on Yahoo Finance Live: \"Bitcoin and Ethereum are like cockroaches. They're just not going to die.\"\n\nOne reason cyrpto is a cockroach is it's a largely decentralized system. Chhugani and Agarwal point out the contagion impact from FTX has not spread widely.\n\nAdvertisement\n\n\"FTX was terrible for the reputation of the sector and affected the faith of institutional investors, who invested in FTX,\" the analysts said. \"But FTX was 10% of the global trading volume and used mainly by wholesale participants such as brokers, trading firms, and large traders.\"\n\nMuch of the crypto space remains decentralized. Take decentralized finance, or DeFi, which uses the same distributed network of computers to provide financial services to people.\n\nChhugani and Agarwal said FTX's collapse had hastened DeFi adoption, which makes DeFi a bright spot in crypto investing, according to crypto VCs.\n\nDeFi's rise\n\nWith DeFi projects largely insulated from FTX's impact, the Bernstein analysts noted investor interest might shift towards Ethereum and its mainly application-based ecosystem.\n\nAdvertisement\n\nEthereum forms the basis of many crypto applications like NFT-based gaming, decentralized social media, and some commerce. These tend to use either the Ethereum blockchain to build or use the Ethereum currency to power transactions. Chhugani and Agarwal said crypto only touches 5% of total internet users, and the primary way of growing the space is through applications.\n\n\"We believe value within crypto will migrate from the speculative crypto assets to more utility and application-driven ecosystems such as Ethereum,\" they said.\n\nThe benefits of regulating the wild west of finance\n\nAgarwal and Chhugani believe regulation is coming for the crypto space and see it benefiting the market.\n\nCrypto enthusiasts typically deride moves to regulate their space. The blockchain and bitcoin began as a reaction to the 2008 financial crisis, and its first adopters had visions of leaving behind the tightly controlled world of traditional finance.\n\nAdvertisement\n\nBut as crypto began moving into the mainstream, investors demanded regulation. And after the fall of FTX, those calls have only increased.\n\nThe analysts said even if regulation brings about adjustments in the crypto market, policies bring in a more sustainable ecosystem and attract more institutional investors. In their view, regulated onshore exchange companies will survive the current cycle.\n\nFor Agarwal and Chhugani, crypto still has strong potential to grow, particularly as people stop seeing it as a quick money-making speculative asset and instead focus on its ability to be a part of the infrastructure of the next decade of internet development."
    }
]