[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNy8yOS9ldGhlcmV1bS1jb3VsZC1leHBsb2RlLWJ5LXVwLXRvLTE1NTYtaW4tYW4tYWktcG93ZXJlZC1lY29ub215LXNheXMtYXJ0aHVyLWhheWVzLWhlcmVzLXRoZS10aW1lbGluZS_SAYgBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDcvMjkvZXRoZXJldW0tY291bGQtZXhwbG9kZS1ieS11cC10by0xNTU2LWluLWFuLWFpLXBvd2VyZWQtZWNvbm9teS1zYXlzLWFydGh1ci1oYXllcy1oZXJlcy10aGUtdGltZWxpbmUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Could Explode by Up to 1,556% in an AI-Powered Economy, Says Arthur Hayes – Here’s the Timeline - The Daily Hodl",
        "content": "BitMEX co-founder Arthur Hayes says the price of Ethereum (ETH) stands to benefit immensely from artificial intelligence (AI) technology.\n\nPainting a scenario where AI applications create decentralized autonomous organizations (DAOs) in order to execute smart contracts, Hayes says in a new blog post that Ethereum is the logical base of such a scenario since it is the most widely used decentralized virtual machine.\n\nAccording to Hayes, the tokens issued by the AI DAOs will trade on decentralized exchanges (DEXs), and mostly those built on top of Ethereum.\n\n“A DEX is naturally suited to support the trading of any type of equity, debt, utility, participation, etc. token issued by an AI-powered DAO…\n\nDAOs will fundraise and issue tokens on-chain. A plethora of new DAO tokens will trade on DEXs.\n\nAs DAOs capture more economic value than companies, DEXs will trade more than traditional CEXs.\n\nI believe the largest driver of on-chain activity will be an explosion of trading volume on DEXs hosted on Ethereum.”\n\nThe BitMEX founder says that if the above scenario plays out as he envisions, Ethereum could run up to 1,556%, from its current price of $1,875 to hit $31,063 if the DEX trading volumes were to reach 20% of traditional stock exchange volumes recorded in 2022.\n\nHayes says Ethereum could reach a five-figure price about half a decade from now.\n\n“Given the market is forward-looking, I want to guestimate the percentage that will be reached 5 years into the future. I am not concerned about getting this number exactly right. I want to be directionally correct and profit as the narrative shifts from “won’t happen” to “might happen”.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on Twitter, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DreamStudio"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vdS50b2RheS9ob3ctbWFueS1ldGhlcmV1bS1ldGgtYWRkcmVzc2VzLXNob3ctcmVhbC1hY3Rpdml0eS15b3Utd291bGQtYmUtc3VycHJpc2Vk0gFdaHR0cHM6Ly91LnRvZGF5L2hvdy1tYW55LWV0aGVyZXVtLWV0aC1hZGRyZXNzZXMtc2hvdy1yZWFsLWFjdGl2aXR5LXlvdS13b3VsZC1iZS1zdXJwcmlzZWQ_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jul 2023 07:00:00 GMT",
        "title": "How Many Ethereum (ETH) Addresses Show Real Activity? You Would Be Surprised - U.Today",
        "content": "Advertisement\n\nUsing a customized Dune Analytics dashboard, Jack Gorman tracked the paradigm of new Ethereum (ETH) wallets that were activated in the last 12 months. Simply put, it looks like the \"we are still very early\" motto of crypto veterans is still valid in late Q3, 2023.\n\nIn past year, 27 million new wallets were activated on Ethereum (ETH)\n\nIn the last 12 months, over 26.69 million wallets were created. As such, every 30 days, over 2 million new Ethereum (ETH) addresses started showing activity on the network. Such calculations were made by Jack Gorman, a data scientist at Variant Fund, a VC team that was among early backers of Uniswap (UNI), Polygon (MATIC), Aptos (APT), Worldcoin (WDC) and Matter Labs.\n\nEthereum Address Stats in Past Year\n\n\n\n-Monthly active addresses ranges from ~4.5M - 7M on Ethereum.\n\n\n\n-In the past year, more than 26.69 million wallets were created, averaging around 2 million new wallets per month.\n\n\n\n-The retention rate of new wallets is relatively modest, with… pic.twitter.com/c8DmYhHQUX — J.Hackworth (@jphackworth42) July 28, 2023\n\nHowever, only 4.5-7 million of Ethereum (ETH) addresses authorize at least one transaction every month. Over 70% of wallets are dropped after 30 days of activity, analyst says.\n\nThree out of five Ethereum (ETH) addresses on the network only completed one transaction. On the other hand, 400,000 wallets show notable activity as they authorized over 100 transactions in the last 12 months.\n\nThis domination of wallets with low activity (66% of active transacting addresses were only active for one day, while 95.5% were active for less than 10 distinct days within the last year) should likely be attributed to euphoria around retroactive airdrops.\n\nAs covered by U.Today previously, top \"airdrop hunters\" managed to have their accounts qualified for 12 NFT and token airdrops.\n\nOnly 1.9 million wallets show sustainable activity\n\nHowever, in order to optimize their strategies, \"airdrop hunters\" create hundreds of Ethereum (ETH) accounts with minimum activity. Sophisticated software is leveraged by the \"abusers\" of retroactive airdrops.\n\nDuring the ARB airdrop, the most overhyped campaign of the last year, thousands of accounts were controlled by manipulators; over 2,400 wallets were hacked.\n\nWhen the dust settles, activity on Ethereum (ETH) remains low. The total number of wallets that were active for over 10 days in the last year is around 1.9 million, the report says."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMikAFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3NoaWJhLWludS1wcmljZS1hbG9uZy13aXRoLWJvbmUtcmFsbHktYXMtc2hpYmFyaXVtLWV0aGVyZXVtLWJyaWRnZS10ZXN0bmV0LWtpY2tzLW9mZi0yMDIzMDcyOTAxMTfSAZQBaHR0cHM6Ly93d3cuZnhzdHJlZXQuY29tL2FtcC9jcnlwdG9jdXJyZW5jaWVzL25ld3Mvc2hpYmEtaW51LXByaWNlLWFsb25nLXdpdGgtYm9uZS1yYWxseS1hcy1zaGliYXJpdW0tZXRoZXJldW0tYnJpZGdlLXRlc3RuZXQta2lja3Mtb2ZmLTIwMjMwNzI5MDExNw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jul 2023 07:00:00 GMT",
        "title": "Shiba Inu price along with BONE rally as Shibarium-Ethereum bridge testnet kicks off - FXStreet",
        "content": "Share:\n\nShiba Inu price as well as Bone ShibaSwap price shot up by 5% and 8%, respectively, in the last 24 hours.\n\nThe Testnet bridge will allow the transfer of tokens between Ethereum and SHIB-based layer-2 chain Shibarium.\n\nThis bullish move may revive the receding interest from new investors, which has resulted in the network growth declining by 44%.\n\nShiba Inu price made some gains as the week came to an end on the back of its ecosystem development. The SHIB world seems to be changing become more serious with the development of Shibarium, an Ethereum based layer-2 solution. This brought gains to key tokens associated with the project, including BONE.\n\nShiba Inu price rise could attract investors again\n\nShiba Inu price noted a 4.7% increase over the past day but more than the meme coin rose another cryptocurrency within its ecosystem. Bone ShibaSwap, which is more famously known by its ticker BONE, shot up by more than 8% to trade at $1.42.\n\nBONE/USDT 1-day chart\n\nThe rally, interestingly, was limited only to these two cryptocurrencies and was not reflected in the rest of the meme coins. The reason behind this was the recent launch of the Shibarium-Ethereum bridge testnet, which led to a surge in the use of SHIB and BONE. Since the bridge is still in the testnet phase, no significant implications on price were observed.\n\nHowever, the investors’ bullishness was enough to still trigger a rise in the cryptocurrencies despite the transactions being conducted on the bridge holding no real-world value. It does suggest a potential increase in the use case of BONE and SHIB going forward when the bridge mainnet launches. The transfer of assets would consequently boost the Shiba Inu price as well.\n\nBut more than the price, the network needs a recovery of investors, which have been disappearing after the disappointing run of Shiba Inu price posted these last couple of weeks. While the Relative Strength Index (RSI) on BONE suggests that the coin is on the verge of being overbought, SHIB barely managed to close above the December 2022 lows of $0.00000791, trading at $0.00000826.\n\nSHIB/USD 1-day chart\n\nA quicker recovery is necessary to revive the arrival of new users, which has been declining rapidly this past week. The network strength, which measures the rate at which new addresses are formed, dipped by more than 44% in just five days, suggesting investors are pulling back.\n\nShiba Inu network strength\n\nThus their return would help not only boost the uptrend in Shiba Inu price but also prevent any significant drawdown."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZGVjcnlwdC5jby8xNTA1MjEvdGhpcy13ZWVrLWluLWNvaW5zLXdlYWstd2Vlay1iaXRjb2luLWV0aGVyZXVtLXdvcmxkY29pbi14cnDSAVtodHRwczovL2RlY3J5cHQuY28vMTUwNTIxL3RoaXMtd2Vlay1pbi1jb2lucy13ZWFrLXdlZWstYml0Y29pbi1ldGhlcmV1bS13b3JsZGNvaW4teHJwP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jul 2023 07:00:00 GMT",
        "title": "This Week in Coins: Weak Week for Bitcoin and Ethereum—and Worldcoin - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt.\n\nThe beginning of the week saw the underwhelming launch of Worldcoin Protocol, along with its native cryptocurrency, WLD.\n\nWorldcoin is co-founded by Open AI CEO Sam Altman and the premise is at once utopian and dystopian: anyone wanting some WLD has to visit an ”Orb”—these can currently be found in Berlin, Dubai, London, Mexico City, Miami, New York City, San Francisco, Seoul, and Tokyo— and get a snapshot of their eyeballs taken.\n\nAD\n\nAD\n\nThis biometric data is used alongside verification of their government-issued ID to confirm someone’s personhood before distributing a set number of coins to them.\n\nWorldcoin believes it’s building the infrastructure to bank the world’s unbanked, enabling everyone “to broadly share the coming technological prosperity ” says its website. but many are skeptical, including Ethereum creator Vitalik Buterin who listed “major issues” of privacy, accessibility, centralization and security and said it could take years for the protocol to work.\n\nBritish privacy watchdog the Information Commissioner's Office (ICO) agrees, at least on privacy and security concerns and told Decrypt that it \"[the organization notes] the launch of Worldcoin in the U.K. and will be making enquiries.\"\n\nWLD currently trades for $2.30, about 30% down from its high on launch day of $3.30, according to crypto data aggregator CoinGecko.\n\nThe market leaders\n\nIt was the fifth consecutive week of underwhelming price performance for market leaders Bitcoin and Ethereum.\n\nBitcoin (BTC) lost 1.7% and now starts the weekend at $29,291, while Ethereum (ETH) lost 0.9% and changes hands at $1,872.\n\nAD\n\nAD\n\nThe market leaders had a pretty static week overall and their prices haven’t moved much since Monday. This week’s news that the Fed was hiking interest rates yet again did not immediately move the leading coins.\n\nLast year, the U.S. central bank hiked interest rates by 75 basis points four times and finished the year with a 50 basis point hike. This year there have so far been two hikes—including Wednesday’s—of only 25 basis points each, but interest rates are now the highest they’ve been for 22 years.\n\nXRP’s recent growth spurt, which was prompted by a small but significant courtroom victory against the SEC a fortnight ago, appears to have settled. Ripple’s cryptocurrency—which is definitely not a security—is down 7.7% for the week and currently trades at $0.70786.\n\nThe only other notable price movement this week came from Toncoin (TON), which fell almost 15% this week to trade at $1.24 at the time of writing.\n\nCrypto politics in Russia, Korea and the U.S.\n\nOn Monday, Russian President Vladimir Putin signed into law a bill granting legal tender to a digital ruble, the issuance of which will be overseen by the country’s central bank—although officials say it could take years before the central bank digital currency (CBDC) is widely adopted.\n\nOn Wednesday, South Korea rolled out a new interagency investigation unit to tackle crypto crime and take a leading role in investor protection before regulations are implemented.\n\nOperating from the Seoul Southern District Prosecutors’ Office, The Joint Investigation Centre for Crypto Crimes will consist of 30 investigators drawn from several government agencies and bodies, including the prosecutor's office, the Financial Supervisory Service, the National Tax Service, and the Korea Customs Service.\n\nThat day, over in the states, Democrats and Republicans locked horns over the Financial Innovation and Technology (FIT) for the 21st Century Act. Rep. Maxine Waters (D-CA), the ranking Democrat on the House Financial Services committee, assailed the bill as a “wish list” for the crypto industry, and said it undermined the role of the SEC and existing legislation.\n\nAD\n\nAD\n\nDemocrats also accused the bill of having weak consumer protections, though this point was parried by Republicans like Committee chairman Patrick McHenry (R-NC), who argued that, while not perfect, the bill is “better at worst case” than the current regulatory regime.\n\nThe Committee members also debated a stablecoin bill called the “Clarity for Payment Stablecoins Act of 2023.” Democrats accuse Republicans of rushing to pass the bill, and Waters said the proposed legislation lacks clarity over the reserves underpinning stablecoins that are pegged to the U.S. dollar."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMilQFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC91bmxvY2stMzAwLWRheS1wYXNzaXZlLWluY29tZS1vcHBvcnR1bml0eS13aXRoLXN0YWtpbmctcmV3YXJkcy1hbHRjb2lucy1jaGFpbmxpbmstbGluay1kaWdpdG9hZHMtdG9hZHMtZXRoZXJldW0tZXRoL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jul 2023 07:00:00 GMT",
        "title": "Unlock $300/Day Passive Income Opportunity with staking rewards altcoins: Chainlink (LINK), DigiToads (TOADS ... - Analytics Insight",
        "content": "DeFi has been overwhelmingly successful due to the removal of intermediaries. This allows for more value to be retained between the transacting parties. For example, instead of a centralized institution providing liquidity to markets, ordinary investors become market makers by creating LP (Liquidity Provider) tokens.\n\n\n\nIn financial terms, the decentralization in the crypto market has opened up multiple opportunities to investors in the form of residual income. And anybody can unlock $300 a day passive income opportunities with staking rewards from altcoins. This article dives into the top three picks to begin earning passively today: Chainlink (LINK), DigiToads (TOADS) , and Ethereum (ETH).\n\n\n\nDigiToads (TOADS) Introduces NFT Staking\n\n\n\nDigiToads is one of the best altcoins when it comes to the provision of passive income. And this is all thanks to the self-propagating ecosystem (The Swamp) that does the heavy lifting on the investor’s behalf.\n\n\n\nThe Swamp opens up a new staking opportunity with its NFT Staking program that turns all 3,500 DigiToads NFTs into revenue-creating assets. These stakers earn consistent payouts funded by the protocol’s taxation system. This link between taxes and payouts causes the funds received by stakers to increase in tandem with ecosystem activity.\n\n\n\nAnalysts have forecast the floor price of these NFTs rocketing on the secondary market when payouts materialize on August 21st. This means as well as receiving dividend payments in line with ecosystem activity, stakers will also hold an appreciating asset.\n\n\n\nThe taxation system, Toad Tax, which funds the staking payout pool, directs 2% of every transaction to these holders. Additionally, it burns 2% meaning that users receive rewards in $TOADS, a hyper deflationary token.\n\n\n\nThe protocol’s treasury fund will also periodically top up the NFT Staking payout pool, and the active treasury management strategy employed by DigiToads, known as the Platinum Toads initiative, grants the best on-chain raiders remote control of the treasury.\n\n\n\nIn practical terms, it means stakers will earn rewards from taxes and rewards from trading activity in DeFi, hence analysts’ classification of DigiToads as a pioneering project and one of the best passive income plays of 2023.\n\nChainlink (LINK) Staking & CCIP\n\nChainlink (LINK) has seen a rush of economic activity due to the release of its CCIP (Cross-Chain Interoperability Protocol), which seeks to make an internet of smart contracts. This new tech stack will allow cryptos to travel freely across chains, enable developers to create cross-chain applications, and connect private and public blockchains. The final application of CCIP could see direct on-ramps between TradFi banks and DeFi.\n\n\n\n$LINK staking has caught the eye of many investors. Users can lock up their $LINK and earn staking rewards by providing economic security guarantees for Chainlink’s (LINK) oracle services. The staking program sees 7% APR rewards for node operators and nearly 5% for ordinary stakers. Analysts’ price predictions estimate $LINK trading between $13.62 and $15.62 in 2024, meaning stakers can currently stack up undervalued Chainlink (LINK) through the staking program.\n\nEthereum (ETH) Eclipses 20% Staked\n\n\n\nEthereum (ETH) has always been one of the best altcoins to buy, and recently the total volume of $ETH staked crossed 20%. Ethereum (ETH) staking has become the de facto risk-free rate within DeFi, with investors earning nearly 4% APR on a blue chip asset.\n\n\n\nThousands of new DeFi projects have launched, integrating liquid staking derivatives, sparking what analysts have called LSDFi Summer. The enabling of Ethereum (ETH) withdrawals acted as an enormous derisking event, and institutional inflows into the $ETH staking have been steadily increasing since.\n\n\n\nPrice forecasts predict a range between $3,051.80 and $3,754.46 for Ethereum (ETH) in 2024, meaning all investors accruing stakers rewards have a great upside on their dividends.\n\nClosing Thoughts: Staking and the Power of Passive Income\n\n\n\nThe top altcoins to hold in the run-up to the bull market and throughout the bear market have always been altcoins with staking rewards. Investors steadily build their stack and enjoy all the upside when the market starts rallying.\n\n\n\nComparing $TOADS, $ETH, and $LINK, although all three provide excellent passive income opportunities, the winner has to be TOADS because of the link between economic activity and staking rewards. Join the DigiToads presale, mint an NFT, and start earning deflationary rewards today!\n\n\n\nVisit DigiToads Presale\n\nMint DigiToads NFTs Here\n\nBuy DigiToads NFTs on OpenSea\n\nJoin the community\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    }
]