[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMjQvY2hpbmVzZS1ldGhlcmV1bS1jb25mbHV4LWRyYXdzLXNwb3RsaWdodC1hcy1ob25nLWtvbmctd2VsY29tZXMtcmV0YWlsLXRyYWRlcnMv0gF-aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNS8yNC9jaGluZXNlLWV0aGVyZXVtLWNvbmZsdXgtZHJhd3Mtc3BvdGxpZ2h0LWFzLWhvbmcta29uZy13ZWxjb21lcy1yZXRhaWwtdHJhZGVycy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "'Chinese Ethereum’ Conflux Draws Spotlight as Hong Kong Welcomes Retail Traders - CoinDesk",
        "content": "“Plus, today we heard good news from Hong Kong’s SFC that retail crypto trading will be permitted under regulatory supervision. While those rules are restricted to BTC and ETH for now, this series of bullish news for the Greater China region work highly in Conflux’s favor,” Mei added."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy95YXlvLWNvcnBvcmF0aW9uLWRvbWluYXRlcy1jYW50by1jaGFpbi0xODE2MDA1MTQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "YAYO Corporation Dominates Canto Chain and Announces Ethereum Bridge for YAYO NFTs - Yahoo Finance",
        "content": "MIAMI, May 24, 2023 /PRNewswire/ -- YAYO Corporation, a subsidiary of the distinguished Remilia Corporation, is thrilled to announce its game-changing decision to launch an Ethereum bridge for the YAYO NFT. This grand event is being held exactly 2 years since YAYO Corporation first debuted by raising $600,000 for the $YAYO Coin ILO in May 2021. This bridge comes after a remarkable display of market dominance on Canto's native marketplace, Alto, where YAYO NFTs have significantly outperformed all other assets.\n\nThe YAYO Man is an archetype representing various facets of masculinity, culture, industry, and themes within both fiction and history that molds the minds and hearts of young men across the world.\n\nThe YAYO NFT initially launched on the Canto chain for a mint price of 250 $CANTO, approximately $100 USD. After successfully minting out in mid-April, YAYO proceeded to completely outperform every other NFT project on the Canto ecosystem, exceeding the marketcap and floor price of Canto's premiere official project \"Canto Longnecks\" and consistently topping the 24-hour volume rankings every single day. Most recently, the YAYO NFT shot past the 10,000 $CANTO floor mark, achieving a 4,000% return on the mint price and placing it in the number one slot as the highest performing Canto NFT of all time, exceeding every other project in price, volume, and unique owners of all-time.\n\nDespite initial lower-than-expected support on Canto, YAYO NFT's success story is a testament to its inherent value and powerful design. The collection of 4000 figures, complete with vehicles, weapons, outfits, and backgrounds, carries meticulously accurate metadata labels mirroring real-world brands, makes, and models. The artistry, citation depth, and tasteful design make YAYO NFTs a prized asset for collectors and enthusiasts.\n\nAfter successfully reaching the number one spot on Canto and hitting every milestone the YAYO Corporation set out to achieve, they are now launching their planned Ethereum bridge on the two-year anniversary of their initial launch to find bigger fish to fry, in a one-way opt-in process which is set to further enhance YAYO's presence and value in the wider NFT ecosystem.\n\nStory continues\n\nAbout YAYO Corporation: The Yoshimoto Atlantic Yield Optimization Corporation is the premiere project of the Remilia Corporation, an iconic art collective and powerhouse in the fields of technology and finance. YAYO Corp has a distinguished history as a trend setting brand in crypto and has established a high energy community of motivated individuals looking to better themselves physically, mentally, financially, and spiritually. You can learn more about YAYO Corp through Twitter, https://twitter.com/YayoCorp, and can join the YAYO Community on their Discord: https://discord.com/invite/nbZtr7gcsg\n\nMedia Contact:\n\nMichael Dragovic\n\n727-275-0268\n\n359605@email4pr.com\n\nEvery YAYO NFT features assets that use real-world brands, makes, and models directly in the metadata.\n\nCision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/yayo-corporation-dominates-canto-chain-and-announces-ethereum-bridge-for-yayo-nfts-301833869.html\n\nSOURCE Remilia Corporation"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy95YXlvLWNvcnBvcmF0aW9uLWRvbWluYXRlcy1jYW50by1jaGFpbi0xODE2MDA1MTQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "YAYO Corporation Dominates Canto Chain and Announces Ethereum Bridge for YAYO NFTs - Yahoo Finance",
        "content": "MIAMI, May 24, 2023 /PRNewswire/ -- YAYO Corporation, a subsidiary of the distinguished Remilia Corporation, is thrilled to announce its game-changing decision to launch an Ethereum bridge for the YAYO NFT. This grand event is being held exactly 2 years since YAYO Corporation first debuted by raising $600,000 for the $YAYO Coin ILO in May 2021. This bridge comes after a remarkable display of market dominance on Canto's native marketplace, Alto, where YAYO NFTs have significantly outperformed all other assets.\n\nThe YAYO Man is an archetype representing various facets of masculinity, culture, industry, and themes within both fiction and history that molds the minds and hearts of young men across the world.\n\nThe YAYO NFT initially launched on the Canto chain for a mint price of 250 $CANTO, approximately $100 USD. After successfully minting out in mid-April, YAYO proceeded to completely outperform every other NFT project on the Canto ecosystem, exceeding the marketcap and floor price of Canto's premiere official project \"Canto Longnecks\" and consistently topping the 24-hour volume rankings every single day. Most recently, the YAYO NFT shot past the 10,000 $CANTO floor mark, achieving a 4,000% return on the mint price and placing it in the number one slot as the highest performing Canto NFT of all time, exceeding every other project in price, volume, and unique owners of all-time.\n\nDespite initial lower-than-expected support on Canto, YAYO NFT's success story is a testament to its inherent value and powerful design. The collection of 4000 figures, complete with vehicles, weapons, outfits, and backgrounds, carries meticulously accurate metadata labels mirroring real-world brands, makes, and models. The artistry, citation depth, and tasteful design make YAYO NFTs a prized asset for collectors and enthusiasts.\n\nAfter successfully reaching the number one spot on Canto and hitting every milestone the YAYO Corporation set out to achieve, they are now launching their planned Ethereum bridge on the two-year anniversary of their initial launch to find bigger fish to fry, in a one-way opt-in process which is set to further enhance YAYO's presence and value in the wider NFT ecosystem.\n\nStory continues\n\nAbout YAYO Corporation: The Yoshimoto Atlantic Yield Optimization Corporation is the premiere project of the Remilia Corporation, an iconic art collective and powerhouse in the fields of technology and finance. YAYO Corp has a distinguished history as a trend setting brand in crypto and has established a high energy community of motivated individuals looking to better themselves physically, mentally, financially, and spiritually. You can learn more about YAYO Corp through Twitter, https://twitter.com/YayoCorp, and can join the YAYO Community on their Discord: https://discord.com/invite/nbZtr7gcsg\n\nMedia Contact:\n\nMichael Dragovic\n\n727-275-0268\n\n359605@email4pr.com\n\nEvery YAYO NFT features assets that use real-world brands, makes, and models directly in the metadata.\n\nCision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/yayo-corporation-dominates-canto-chain-and-announces-ethereum-bridge-for-yayo-nfts-301833869.html\n\nSOURCE Remilia Corporation"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V0aGVyZXVtLXN0YWtpbmctZGVtYW5kLXNreXJvY2tldHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "Ethereum Staking Demand Skyrockets Following Network Upgrade - Blockworks",
        "content": "Ether (ETH) is witnessing its highest levels of staking activity following a critical update earlier this year.\n\nThe network’s transition to Proof-of-Stake (PoS) late last year, coupled with Ethereum’s “Shapella” network upgrade in April, which enabled withdrawals of staked ETH as well as rewards, has led demand for new validators to reach its highest level in two and a half years.\n\nPreviously, users could stake their ETH to the Beacon Chain as early as December 2020, but it wasn’t until Shapella was fully implemented that it became possible to withdraw.\n\nAs a result, over 1 million ETH was withdrawn shortly after the upgrade, sparking temporary concerns as to whether demand would simply rush to the exit indefinitely and cause the price of ETH to dip.\n\nYet, this rush has been balanced by an influx of eager validators waiting for activation, indicating a sustained demand for Ethereum staking, an analysis by Coin Metrics shows.\n\n“The entry queue has reached its highest level since the Beacon Chain’s genesis in December 2020, with a total of 64,000 validators eagerly waiting to participate,” Coin Metrics said.\n\nIn contrast, there are effectively zero validators wishing to withdraw, that are stuck in the queue. That’s a stark contrast to withdrawal queues just last month, which stood at roughly 17,500.\n\nThe surge of new validators has helped drive the active validator count to a new high of nearly 584,000, data shows. This number has more than made up for the transient decrease in complete withdrawals that occurred when withdrawals were initially introduced.\n\nAs the number of active validators approaches the 589,000 mark, an internal protocol parameter, known as the Churn Limit, will rise, allowing for the daily activation of an extra 225 validators.\n\nHowever, even with this increased pace, individuals or staking pools spinning up new validators to join the queue today would still need just over a month to become active, Coin Metrics noted.\n\nLiquid staking tokens predicted to fuel staking value\n\nA budding narrative in the decentralized finance (DeFi) world underscores the escalating demand for Liquid Staking Tokens (LSTs).\n\nThese tokens, representative of staked assets, bring a new level of liquidity to the traditionally illiquid PoS model by allowing staked assets to participate in DeFi applications while still contributing to the network’s security.\n\nThey provide a bridge between staking and DeFi by offering liquid tokens that represent staked ETH, allowing holders to freely interact with DeFi protocols while still earning staking rewards.\n\nThe growing prominence of LSTs within DeFi is intricately linked to Ethereum’s staking ecosystem. Behind every LST, there is a staking operation, providing the required security and validation for the Ethereum network.\n\nSome of the established decentralized players are jockeying for market share, such as Lido DAO (LDO), Frax (FXS) and Rocket Pool (RPL), alongside centralized staking providers such as Coinbase, and a slew of others, with new offerings cropping up regularly post-Shapella.\n\nIn essence, the explosion of LSTs within DeFi implies a parallel increase in Ethereum staking activity. As the role of LSTs becomes more integral to DeFi’s future, it may inadvertently fuel the demand for ETH, Blockworks was previously told.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbWFnYXppbmUvZXRoZXJldW0taXMtd29lZnVsbHktdW5kZXJ2YWx1ZWQtYnV0LWdyb3dpbmctbW9yZS1wb3dlcmZ1bC1kZWZpLWRhZC1oYWxsLW9mLWZsYW1lL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "Ethereum is 'woefully undervalued' but growing more powerful: DeFi Dad, Hall of Flame - Cointelegraph",
        "content": "DeFi Dad has 152,100 Twitter followers. He’s a DeFi podcaster, head of portfolios at Fourth Revolution Capital and a prolific crypto YouTuber.\n\nWho is this guy anyway?\n\nPodcaster and influencer DeFi Dad has been actively making crypto content since 2019 and now has a whopping 152,100 Twitter followers.\n\nHe’s also the head honcho of marketing and portfolio support at Fourth Revolution Capital, an adviser for several Web3 projects, including Zapper and Push Protocol, and hosts two podcasts, The Edge Podcast and The DeFi Podcast.\n\nSomehow, he still manages to tuck his two kids into bed every night and fight off monsters for them – which is completely on brand.\n\nBeen fairly checked out this week on vacation with kids and I have to say, it feels good to tune out while still having FOMO for what I missed.\n\n\n\nGot asked “don’t you enjoy being away from work?” and answer is “nah, I love what I do. And I love crypto.”\n\n\n\n😁 pic.twitter.com/631kznAFSU — DeFi Dad ⟠ defidad.eth 🦇🔊🐼 (@DeFi_Dad) February 24, 2023\n\nDeFi Dad, or DD, is a jack of many trades but has defied the old saying and actually mastered some, too.\n\nAfter completing his studies at the University of Chicago, he started a chemistry Ph.D. program with aspirations of becoming a teacher. He got bored of that idea and started a food delivery business, which he says “was a great and horrific experience.”\n\n“This was before Uber Eats and before the whole food delivery craze started. It was an exciting business.”\n\n“I’m pretty convinced I would be divorced today and probably have no children if I had stayed in food delivery,” he jokes.\n\nSeeking new challenges, DeFi Dad transitioned to software startups and then unexpectedly found himself selling “all sorts of camera equipment” in a camera shop.\n\n“I definitely have a lot of experience hopping different industries, which is probably why I ended up in crypto at one point in my life.”\n\nIt was during yet another role as a project manager at an events company in New York, where he was assigned to blockchain events, that DD discovered his passion for crypto, and he hasn’t looked back since.\n\nWho knows? In five years’ time, we might catch up with him only to find out he has become an astronaut.\n\nWhat led to Twitter fame?\n\nDeFi Dad exudes the vibe of a hustler determined to ensure his kids have a full plate every night.\n\n“No doubt it’s the typical combination of a lot of focus, really hard work, grinding it out and being present across as many different parts of Crypto Twitter at the same time,” he explains.\n\nHis early DeFi videos began amassing over 10,000 views during the first surge of interest in the topic in the lead-up to “DeFi Summer” in 2020.\n\n“I was very lucky with the timing that I was into DeFi in, like mid-early 2019, and obviously, it took off within a year’s time. It has exploded and become a mainstream talking point and financial news — that’s luck. Right place, right time.”\n\nDeFi Dad loves Ethereum and his kids, too. (Supplied)\n\nWhat to expect from his Twitter content\n\nDD describes his Twitter content as “advice on how to get started and how to upscale yourself in relation to DeFi, and Web3 games,” adding:\n\n“I’m more there to kind of help tell the story of what’s being built and why games need Web3 elements because we’re just not there yet — it’s way too early.”\n\nHe warmly welcomes memecoin enthusiasts to follow him on Twitter but wants to make one thing clear: He won’t be pumping them anytime soon.\n\n“I’m not someone who’s going to trade a memecoin like PEPE. I’m more of a long-term investor, but I’m super happy for folks making money off it,” he says.\n\nEvery now and then, you might be lucky enough to catch DD throwing out a cheeky price prediction.\n\nI think ARB goes to near $5-$10\n\n\n\nMid take: But that would put FDV at $100B! And that's absurd if you compare it to Optimism, Polygon, and others.\n\n\n\nI think the ARB price could shock people. — DeFi Dad ⟠ defidad.eth 🦇🔊🐼 (@DeFi_Dad) March 21, 2023\n\nWhat do you enjoy on Crypto Twitter?\n\nDD is an unashamed fanboy of Guy Turner, the founder and face of Coin Bureau, whose ethics he admires.\n\n“He has a team that acts with a lot of integrity, at least in my experience, and they are such great storytellers,” he says.\n\nDD admits he is “definitely trying to emulate” what Guy is doing by being very objective and creating content that is “going to onboard as many folks in the space as possible.”\n\n“There is a really fine line to ensuring that you don’t compromise on your ethics and become something of a shill.”\n\nTwitter Beef\n\nDD proudly states that he holds no grudges against anyone and jokes that his lack of Crypto Twitter beefs is “not going to be good for engagement on this article.”\n\nHowever, he doesn’t shy away from throwing some shade every now and then. When crypto exchange FTX collapsed, he didn’t hold back, taking a dig at Sam Trabucco, co-CEO of Alameda Research, calling him a “f*cking terrible trader.”\n\nNo, you didn't \"reach the point in life where I have to prioritize other things.\"\n\n\n\nYou're only ~29 yrs old and worked a job for 3 years.\n\n\n\nYou misused customer deposits from FTX, lost 11 figures, and then left before shit hit the fan.\n\n\n\nYou're a liar and a f*cking terrible trader. pic.twitter.com/XVOGwUQOmD — DeFi Dad ⟠ defidad.eth 🦇🔊🐼 (@DeFi_Dad) November 11, 2022\n\nWhile he’s a fan of healthy debates to keep people informed, he tends to avoid confrontation.\n\n“I don’t like being in conflict with people; I’d rather be more of a cheerleader for these different DeFi protocols,” he says.\n\nHe also tries to rally the troops following negative events, like the collapse of FTX, telling his followers that “crypto is so much bigger than FTX.”\n\nCan we stop saying today was the worst day in crypto history?\n\n\n\nCrypto is so much bigger than FTX\n\n\n\nCrypto is trustless\n\n\n\nCrypto is permissionless\n\n\n\nCrypto is decentralized\n\n\n\nFTX and Alameda were none of this\n\n\n\nSo good riddance\n\n\n\nLet’s get back to crypto\n\n\n\nOnward and upward\n\n\n\n🚀 — DeFi Dad ⟠ defidad.eth 🦇🔊🐼 (@DeFi_Dad) November 9, 2022\n\nPredictions?\n\nDespite being a man who steers clear of making price predictions, DD has confidence that Bitcoin’s price will skyrocket in the next decade, declaring:\n\n“I would be shocked if Bitcoin doesn’t go to $500,000, to a million, in the next 10 years.”\n\nBut as a DeFi Dad, it’s probably unsurprising that his big love is Ethereum.\n\n“To me, Ethereum is just woefully undervalued because of all the economic activity built on it,” he says.\n\nHe even likens Ethereum to the network effects and moats of Customer Relationship management platforms Salesforce and Marketo.\n\n“People use [Salesforce] as a database of all their contacts and all of the deal flow that they’re tracking,” believing that it hooks people in by seamlessly integrating with their business operations.\n\n“If you track all of your contacts and all of your sales data in it, that’s going to be very difficult to migrate away from and use a different software in the world,” DD says.\n\nHe compares this to Ethereum, saying that the more time is invested and “resources and data put into Ethereum, the more powerful it becomes over time.”\n\nAs for Ether’s price, DD states that $10,000 “is a conservative [price for Ether] at this point.”\n\n“It could go to $20,000 to $30,000 easily.”\n\nDD takes pleasure in shooting down those who underestimate the price potential of Ethereum.\n\nWhat FUD campaign is this @BanklessHQ?\n\n\n\nIs this an $ETH price for ants? pic.twitter.com/qasmZsxS6s — DeFi Dad ⟠ defidad.eth 🦇🔊🐼 (@DeFi_Dad) November 3, 2022"
    }
]