[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiNWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3Jhcmltby1wb2x5Z29uLWlkLWV0aGVyZXVt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "Polygon ID comes to Ethereum thanks to Rarimo integration, more chains to come - Blockworks",
        "content": "Interoperability protocol Rarimo is making Polygon ID, a verifiable credential infrastructure, available across multiple blockchains.\n\nRarimo announced the collaboration on Thursday, and now, users will be able to seamlessly use their credentials on the Ethereum network. Before the collaboration, a person’s Polygon ID could only be used on the chain on which it was issued.\n\n“This meant that if you issued your credential on Polygon, you would not be able to use it on Ethereum. Instead, you would have to issue a new, Ethereum-native credential,” Rarimo explained in a statement.\n\nNow that Ethereum has been included, credentials issued on Polygon will become available on BNB Chain and Avalanche in the coming weeks, according to Rarimo.\n\n“As the number of networks that Rarimo can scale to is limitless, a range of additional chains will be added with time,” Rarimo added.\n\nPolygon ID was announced in March 2022 and the infrastructure stack was made open source in March of this year. The solution uses zero-knowledge proofs, which allow users to prove they are who they claim to be without needing to reveal their private information to outside parties. This ensures a high level of privacy and security during identity verification processes.\n\nZero-knowledge proofs are a crucial component in the movement toward decentralized identity, the global market for which is expected to grow to $6.8 billion by 2027, according to MarketsandMarkets.\n\nOn Web2, the way individuals express their identity is dictated by giant companies like Meta and Google. The goal of decentralized identity is to flip the script. Whereas now, companies control when and where you share your data, the aim is to have companies request permission to verify your credentials.\n\nPolygon is just one player invested in ushering in this new way of thinking about identity. Disco, SpruceID, Iden3, Ceramic and the Ethereum Foundation are also exploring solutions on this front.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZGVjcnlwdC5jby8xNDk1MzIvaGFja2Vycy1kcmFpbi0zLTJtLWluLWV0aGVyZXVtLWZyb20tZGVmaS1wcm90b2NvbC1jb25pYy1maW5hbmNl0gFfaHR0cHM6Ly9kZWNyeXB0LmNvLzE0OTUzMi9oYWNrZXJzLWRyYWluLTMtMm0taW4tZXRoZXJldW0tZnJvbS1kZWZpLXByb3RvY29sLWNvbmljLWZpbmFuY2U_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "Hackers Drain $3 Million in Ethereum From DeFi Protocol Conic Finance - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nHackers have hit decentralized finance (DeFi) protocol Conic Finance with an attack and drained 1,700 Ethereum—worth over $3.2 million at current prices.\n\nIn a Friday tweet, the protocol said it was “continuing to investigate the root cause of the exploit and are consulting with relevant parties.”\n\nThe team behind the DeFi protocol later said the root cause was a \"re-entrancy attack,\" adding that \"a fix to the affected contract is being deployed.\" In a follow-up, the team claimed that withdrawals were safe and said that a more detailed post mortem was forthcoming.\n\nAD\n\nAD\n\nThe stolen crypto was all sent to one address, blockchain security company Beosin said in a tweet, linking to the transaction.\n\nSeems @ConicFinance was exploited for $3.26M in tx: https://t.co/K0VjnFprAE The stolen funds were sent to 0x3d32C5a2E592c7B17e16bdDc87EAb75f33ae3010 pic.twitter.com/mZr4MOkMQF — Beosin Alert (@BeosinAlert) July 21, 2023\n\nConic Finance is a new app which lets users deposit tokens into its “omnipools,” allowing them to earn rewards. The idea is that users can diversify funds across the Curve decentralized exchange using Conic’s liquidity pools.\n\nHackers targeted the Ethereum omnipool. Conic Finance has since said deposits have now been disabled to that pool.\n\nExploits like this one are very common in the DeFi space—the crypto sphere which aims to replace traditional financial services like borrowing and lending via blockchain technology.\n\nAD\n\nAD\n\nUpdate: - We are continuing to investigate the root cause of the exploit and are consulting with relevant parties. - We have disabled ETH Omnipool deposits on the Conic front end. https://t.co/Oln0zh2nCs — Conic Finance (@ConicFinance) July 21, 2023\n\nSuch apps are new and experimental and therefore sometimes have systems which hackers can take advantage of. Last year was the “the biggest year ever for hacking” in the crypto space according to blockchain data firm Chainalysis.\n\nMost of those attacks happen in the DeFi space. DeFi traders lost $228 million in just three months of Q2 this year alone, a 63% increase compared to the same period last year.\n\nAccording to Immunefi, most of the crypto losses originated from two specific incidents—the June 3 hack of Atomic Wallet and the May 23 exit scam by the now-defunct Fintoch platform.\n\nThe company also found that some chains were targeted more than others. It found that attacks on BNB Chain and Ethereum made up 77% of all losses in the last quarter, followed by Arbitrum at 12%. They said that attacks on Arbitrum were notable, given that it experienced no incidents at all in the same period last year."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tZGFpbHktdXNlcnMtcGx1bmdlL9IBRmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tZGFpbHktdXNlcnMtcGx1bmdlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Daily Users Plunge Amid Declining Network Revenue - NewsBTC",
        "content": "The second quarter of 2023 brought significant challenges for the Ethereum network as its revenue experienced a sharp decline. Ethereum network revenue plummeted from $1.27 billion to $847 million during Q2, representing a staggering 33.3% drop.\n\nThe network revenue for Ethereum encompasses all transaction fees paid by users to Ether validators, as well as the portion of charges that are removed from circulation through burning.\n\nGiven this, the decline in revenue reflects the decrease in overall activity on the platform, especially in the Decentralized Finance (DeFi) market, where developments have been far from welcoming.\n\nDuring Q2 2023, the DeFi market faced a lean period, characterized by a lack of significant growth and unfavorable events. Notably, hack incidents in the DeFi sector increased by a staggering 63% during the quarter, resulting in losses of $228 million across 79 hacks. This was confirmed by Arltduv, a Crypto Directory in a Twitter Post on July 20, 2023.\n\nThese incidents have had a negative impact on user confidence and contributed to the decline in the overall value locked (TVL) in DeFi protocols, with Ether-based protocols accounting for more than 90% of the total TVL.\n\nEthereum’s Daily Active Addresses Decline\n\nIn addition to the revenue decline, Ethereum’s daily active addresses experienced a notable drop of 6% during Q2 2023. The metric measures the number of unique wallet addresses that have conducted transactions on the Ether blockchain per day during the quarter. Despite the ongoing bear market, the decline in daily active addresses hasn’t worsened significantly, indicating a level of resilience in user activity.\n\nETH price resting at $1,891 | Source: ETHUSD on Tradingview.com\n\nEthereum’s performance during the second quarter suggests that while it faced challenges in network revenue and daily user engagement, the platform remains a key player in the DeFi space. The continuous efforts to improve the network’s usability and scalability are crucial in attracting a broader user base, as demonstrated by Ethereum co-founder Vitalik Buterin’s recent proposal.\n\nETH Still King Of DeFi\n\nDespite the decline in daily users and network revenue, Ethereum has managed to maintain its spot as the leading blockchain when it comes to DeFi activity. The network currently accounts for more than 50% of Total Value Locked (TVL) across all blockchains, establishing it as the leader in this regard.\n\nLayer 2 blockchains such as Arbitrum and Polyon built atop the Ethereum network are also doing incredibly well. Arbitrum is currently sitting at $2.649 billion in TVL, with Polygon trailing behind at $1.044 billion in TVL.\n\nIn terms of price, ETH is still closely following the performance of Bitcoin. The altcoin is trading at $1,892 at the time of this writing, with meager gains of 0.07% in the last day.\n\nFeatured image from Yahoo Finance, chart from Tradingview.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9iaXRjb2luLXByaWNlLWV0aGVyZXVtLXByZWRpY3Rpb24tYnRjLWV0aC1zbGlwLW5lYXJseS01LXBvdGVudGlhbC13ZWVrZW5kLWJvdW5jZS5odG3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Price and Ethereum Prediction; BTC and ETH Slip Nearly 5%: Potential Weekend Bounce? - Cryptonews",
        "content": "Bitcoin Price and Ethereum Prediction; BTC and ETH Slip Nearly 5%: Potential Weekend Bounce?\n\nBitcoin and Ethereum, two of the most prominent cryptocurrencies, have experienced a significant slip, with BTC currently trading at $29,780 and ETH at $1,889.\n\nAs investors closely monitor these developments, delving into the technical outlook becomes essential to determine the potential price action in the coming days.\n\nThis Bitcoin and Ethereum price prediction aims to analyze the recent price movements and explore the possibility of a bounce-off before the weekend for both BTC and ETH.\n\nBitcoin Price Prediction\n\nFrom a technical standpoint, Bitcoin trades slightly above a significant support level of $29,500.\n\nThis support level is further validated by the presence of a triple bottom pattern observed in the four-hour timeframe.\n\nThe Relative Strength Index (RSI) and Moving Average Convergence Divergence (MACD) indicators both indicate a bearish sentiment, with the RSI at 42 and the MACD hovering below 0.\n\nAdditionally, the 50-day exponential moving average acts as a resistance level at $29,995, just below the psychological level of $30,000.\n\nConsidering these factors, the likelihood of Bitcoin maintaining a bearish stance below $30,000 is significant.\n\nBitcoin Price Chart – Source: Tradingview\n\nThe cryptocurrency may encounter further downward pressure if it breaches the $29,500 support level, potentially reaching the next support at $28,900.\n\nOn the other hand, failure to break below $29,500 could trigger a bullish rebound, initially pushing the price toward $30,000 and possibly surpassing $30,500 in a bullish crossover.\n\nNotably, a surge in demand for Bitcoin leading to a breakthrough above $30,450 could drive the price toward the next resistance level at $31,200.\n\nAs a result, closely monitoring the $29,500 level becomes crucial, as a move above this point could present a buying opportunity, while a break below it may prompt selling positions.\n\nEthereum Price Prediction\n\nLooking at Ethereum from a technical standpoint, the cryptocurrency currently trades within a narrow range, with $1,920 serving as resistance and $1,880 as support.\n\nDoji and spinning top candlestick patterns in this range indicate that investors are uncertain and eagerly awaiting significant developments that could trigger a breakout in either direction.\n\nThe relative strength index (RSI) and moving average convergence divergence (MACD) indicators both suggest a neutral stance.\n\nThe RSI hovers around the 50 level, signaling a lack of clear market trends. However, the MACD histogram oscillates below the zero line, implying a slight bearish sentiment among investors.\n\nAdditionally, the 50-day exponential moving average aligns around $1,920, with Ethereum’s price moving above and below this level, reflecting investor indecisiveness.\n\nEthereum Price Chart – Source: Tradingview\n\nShould Ethereum surpass the $1,920 level, it holds the potential to target resistance at $1,945 or $1,975, indicating a continuation of the upward trend.\n\nConversely, a bearish breakdown below $1,900 could lead to a price decline towards $1,880 or even lower to $1,845.\n\nIn conclusion, closely monitoring the $1,900 level is essential, as a decisive move above or below this point could signal a shift in the market trend.\n\nTop 15 Cryptocurrencies to Watch in 2023\n\nStay informed about the latest initial coin offering (ICO) projects and alternative cryptocurrencies by regularly exploring our carefully selected collection of the top 15 digital assets to watch in 2023.\n\nThis thoughtfully curated list has been compiled by industry experts from Industry Talk and Cryptonews, ensuring that you receive professional recommendations and valuable insights.\n\nStay ahead of the game and discover the potential of these cryptocurrencies as you navigate the ever-changing world of digital assets.\n\nFind The Best Price to Buy/Sell Cryptocurrency\n\nCryptocurrency Price Tracker – Source: Cryptonews\n\nDisclaimer: Cryptocurrency projects endorsed in this article are not the financial advice of the publishing author or publication – cryptocurrencies are highly volatile investments with considerable risk, always do your own research."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgteW91LWRvbnQtd2FudC10by1taXNzLXRoaXMtcGF0dGVybtIBQ2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgteW91LWRvbnQtd2FudC10by1taXNzLXRoaXMtcGF0dGVybj9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "Ethereum (ETH): You Don't Want to Miss This Pattern - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nRecently, Ethereum has entered the ascending price channel, a pattern typically associated with an ongoing bullish trend. An ascending channel is characterized by two parallel trend lines, both slanting upward at the same angle, with the price oscillating between the upper and lower bounds.\n\nCurrently, Ethereum is situated at the lower border of this channel. In previous instances, a touch at the lower trend line within this pattern often precedes a rally toward the upper boundary. If Ethereum follows this pattern, we could expect a bullish move in the near future.\n\nHowever, it is important to note that Ethereum recently experienced a breakdown from the $2,000 level, a psychological barrier for many traders. This could apply some downward pressure on ETH. Yet, the current position on the ascending channel's lower border may provide enough support to counteract this bearish factor.\n\nAdditionally, the Relative Strength Index (RSI) - a popular momentum indicator - is presently hovering around the neutral 50 mark for Ethereum. This level often serves as a demarcation line between bullish and bearish market conditions. Notably, the RSI is maintaining its level above 50, implying that the prevailing uptrend could still have some steam.\n\nLastly, Ethereum's recent volatility appears to be lower than usual. In the world of cryptocurrencies, a decrease in volatility can often be a precursor to a significant price movement. A sudden surge in volatility could therefore potentially trigger a strong price swing for Ethereum.\n\nShiba Inu is asleep\n\nIn the world of meme cryptocurrencies, Shiba Inu (SHIB) has held a significant place, with a community that is known for its zeal and resilience. However, recent market trends suggest dampening energy surrounding this token, with volatility significantly waning, putting SHIB in an anemic state.\n\nSHIB recently encountered a critical resistance level, which typically represents a price point that an asset struggles to break above due to heightened selling pressure. Unfortunately, as it stands, the token is experiencing a rapid reduction in volatility.\n\nAn asset without volatility may become less attractive for traders looking to capitalize on price swings. Therefore, the diminishing volatility of SHIB could lead to a potential increase in selling pressure, which is the last thing SHIB needs at this crucial juncture.\n\nThe current status of SHIB paints a picture of a token that is losing momentum. Unless the scenario changes - with an influx of positive news or an increase in its adoption - the current anemic state could continue.\n\nPEPE's bounce is possible\n\nThe meme-based cryptocurrency market has often showcased its unpredictable nature, with sudden price movements keeping investors and traders on their toes. One such crypto asset, Pepe (PEPE), a popular meme token, has been showing signs of a potential upward price trajectory. PEPE has once again touched its local low at approximately $0.0000015, an event that has historically led to price reversals.\n\nThis local low coincides with a 50 Exponential Moving Average (EMA) support level, as well as a support line on the token's local trend. The Exponential Moving Average is a type of weighted moving average that gives more weight to the latest data. In PEPE's case, the token's price has come to rest on this 50 EMA line, suggesting that it could potentially be in for a price boost.\n\nMoreover, this is not the first time such a price pattern has been noticed for PEPE. In the past, similar falls to this threshold have led to relatively swift price reversals. If the past is any indicator, and if the pattern continues to hold true, PEPE may be poised for a 10% run upward from its current position.\n\nOf course, any such prediction is contingent on a number of factors, including overall market sentiment, investor interest and the general performance of meme-based cryptocurrencies. With that said, the recent trend and historical data for PEPE give investors some cause for optimism."
    }
]