[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vY29pbmdhcGUuY29tL3BvcHVsYXItYW5hbHlzdC1wcmVkaWN0cy1sb29taW5nLWV0aGVyZXVtLXByaWNlLWFuZC1hbHRjb2lucy1jcmFzaC_SAVxodHRwczovL2NvaW5nYXBlLmNvbS9wb3B1bGFyLWFuYWx5c3QtcHJlZGljdHMtbG9vbWluZy1ldGhlcmV1bS1wcmljZS1hbmQtYWx0Y29pbnMtY3Jhc2gvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Apr 2023 07:00:00 GMT",
        "title": "Popular Analyst Predicts Looming Ethereum Price and Altcoins Crash - CoinGape",
        "content": "Bitcoin price witnessed sharp volatility this April as the bear market comes to an end and Bitcoin prepares for the Bitcoin halving event. While traders anticipate upcoming bullish run amid the banking crisis, U.S. debt-ceiling crisis, and weakening macro, the outlook for Ethereum price and altcoins remains weak.\n\nEthereum price has mostly been under pressure after the Shanghai (Shapella) upgrade as all platforms slowly opened staked ETH withdrawals. The largest liquid staking platform Lido is expected to open withdrawals at the end of May.\n\nadvertisement\n\nEthereum Price and Other Altcoins Under Selling Pressure\n\nPopular analyst Michael van de Poppe shared his new analysis on altcoins on April 29 as the month comes to an end, with Bitcoin and Ethereum prices need to break key levels in order to maintain upside momentum.\n\nHe believes the bear market looming for Ethereum and altcoins as altcoins loses momentum against BTC and continues to fall. The collapse of First Republic Bank amid the brink of depression and recession will be huge trigger adoption of DeFi.\n\nOther news impacting the crypto prices includes the U.S. Fed rate hike decision, if Fed hike rates it will put addition pressure on the government and banks as they have to give more interest on the money they borrow. US Treasury Secretary Janet Yellen warned an economic catastrophe if the U.S. debt ceiling is not raised. The US House has passed the debt ceiling bill, and it now faces the Democratic-led US Senate hurdle.\n\nIn the weekly timeframe, Ethereum (ETH) against Bitcoin (BTC) is showing weakness and altcoins are in correction. ETH/BTC needs to break the 0.069 level for a bullish move and start an altcoin season. The resultant rally in Bitcoin above $30,000 will bring strength in the market and altcoins will follow suit, but BTC price needs to consolidate for ETH price to rally higher.\n\nMichael van de Poppe predicts BTC price reaching $50,000 in the next quarter as positive sentiment in the market considering macro weakness and bitcoin halving.\n\nAlso Read: Bitcoin Price To Hit $35000 As First Republic Starts Second Wave Of Banking Crisis"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vdS50b2RheS9jYXJkYW5vcy1kamVkLWRlcGxveXMtb24tZXRoZXJldW0tY29tcGF0aWJsZS1zaWRlY2hhaW4tZGV0YWlsc9IBUmh0dHBzOi8vdS50b2RheS9jYXJkYW5vcy1kamVkLWRlcGxveXMtb24tZXRoZXJldW0tY29tcGF0aWJsZS1zaWRlY2hhaW4tZGV0YWlscz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Apr 2023 07:00:00 GMT",
        "title": "Cardano's Djed Deploys on Ethereum-Compatible Sidechain: Details - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nDjed Alliance, the steward of Djed stablecoin protocol, has announced that a new deployment of the Djed stablecoin protocol is now live on Milkomeda-C1, the EVM-compatible sidechain of Cardano.\n\nAdvertisement\n\nA new deployment of the Djed stablecoin protocol is now live on Milkomeda-C1!\n\n\n\nKeep reading this thread to learn more about it…\n\n\n\n(@Milkomeda_com @NicoArqueros @SebastienGllmt @sir_mimok) (1/17) pic.twitter.com/bIUHf0tN3t — Djed Alliance (@DjedAlliance) April 28, 2023\n\nThis would mark its third deployment and, more significantly, its first deployment on Solidity, the main programming language for writing smart contracts for the Ethereum blockchain. The new deployment is expected to create room for its expansion to several additional EVM-compatible blockchains.\n\nIn January of this year, the Djed stablecoin went live on the mainnet and has since shown growth in its utility.\n\nAnother significant development is that Dead Pxlz, a non-fungible token (NFT) project, will soon launch a new game in the Cardano ecosystem.\n\nDead Pxlz is using the Paima Engine, according to a tweet from Paima Studios, the company that created it, to produce the upcoming PXL Wars game.\n\nRecent developments in Cardano ecosystem\n\nCardano builder IOG has published its most current weekly report, which highlights ecosystem developments.\n\nThe Hydra team investigated adding Hydra support to Kupo, worked on resolving state machine continuity on-chain and considered voting project possibilities. To prepare for the 0.10.0 release, the team also updated some dependencies and rectified a few problems in the test suites.\n\nThe Conway ledger era development and CIP-1694 have both seen additional progress over the past two weeks from the ledger team. Conway now supports Plutus v3 in particular, and CIP-1694 is the first version of Cardano's on-chain governance. Achieving widespread consensus is essential as Cardano looks to the future, given its significance."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vdS50b2RheS9jYXJkYW5vcy1kamVkLWRlcGxveXMtb24tZXRoZXJldW0tY29tcGF0aWJsZS1zaWRlY2hhaW4tZGV0YWlsc9IBUmh0dHBzOi8vdS50b2RheS9jYXJkYW5vcy1kamVkLWRlcGxveXMtb24tZXRoZXJldW0tY29tcGF0aWJsZS1zaWRlY2hhaW4tZGV0YWlscz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Apr 2023 07:00:00 GMT",
        "title": "Cardano's Djed Deploys on Ethereum-Compatible Sidechain: Details - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nDjed Alliance, the steward of Djed stablecoin protocol, has announced that a new deployment of the Djed stablecoin protocol is now live on Milkomeda-C1, the EVM-compatible sidechain of Cardano.\n\nAdvertisement\n\nA new deployment of the Djed stablecoin protocol is now live on Milkomeda-C1!\n\n\n\nKeep reading this thread to learn more about it…\n\n\n\n(@Milkomeda_com @NicoArqueros @SebastienGllmt @sir_mimok) (1/17) pic.twitter.com/bIUHf0tN3t — Djed Alliance (@DjedAlliance) April 28, 2023\n\nThis would mark its third deployment and, more significantly, its first deployment on Solidity, the main programming language for writing smart contracts for the Ethereum blockchain. The new deployment is expected to create room for its expansion to several additional EVM-compatible blockchains.\n\nIn January of this year, the Djed stablecoin went live on the mainnet and has since shown growth in its utility.\n\nAnother significant development is that Dead Pxlz, a non-fungible token (NFT) project, will soon launch a new game in the Cardano ecosystem.\n\nDead Pxlz is using the Paima Engine, according to a tweet from Paima Studios, the company that created it, to produce the upcoming PXL Wars game.\n\nRecent developments in Cardano ecosystem\n\nCardano builder IOG has published its most current weekly report, which highlights ecosystem developments.\n\nThe Hydra team investigated adding Hydra support to Kupo, worked on resolving state machine continuity on-chain and considered voting project possibilities. To prepare for the 0.10.0 release, the team also updated some dependencies and rectified a few problems in the test suites.\n\nThe Conway ledger era development and CIP-1694 have both seen additional progress over the past two weeks from the ledger team. Conway now supports Plutus v3 in particular, and CIP-1694 is the first version of Cardano's on-chain governance. Achieving widespread consensus is essential as Cardano looks to the future, given its significance."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1ldGgtc2hhcmtzLWFuZC13aGFsZXMtYXJlLW5vdC1iYWNraW5nLWF3YXktZnJvbS10aGUtY29pbi1oZXJlcy13aHkv0gFmaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2V0aGVyZXVtLWV0aC1zaGFya3MtYW5kLXdoYWxlcy1hcmUtbm90LWJhY2tpbmctYXdheS1mcm9tLXRoZS1jb2luLWhlcmVzLXdoeS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Apr 2023 07:00:00 GMT",
        "title": "Ethereum [ETH] sharks and whales are not backing away from the coin, here’s why - AMBCrypto News",
        "content": "Addresses holding more than 1,000 ETH accumulated more of the altcoin.\n\nETH nears $2,000 but overall activity on the network reduced.\n\nDespite being 33.93% down in the last year, Ethereum [ETH] whales and sharks seem to have found no good reason to deter from accumulating the coin. According to on-chain data, the number of addresses holding 1,000, or more ETH increased to 7091, representing a 5.7% rise.\n\nRealistic or not, here’s ETH’s market cap in BTC terms\n\nFurthermore, this action suggested that this group of holders has a long-term bullish outlook, even amid short-term price fluctuations.\n\nUp to the daunting task\n\nAlthough the price remained relatively stable over the past few months, the Ethereum blockchain itself was involved in a series of significant upgrades.\n\nAnd usually, when investors perceive that a particular development depicts remarkable improvement, they tend to stick with the project and contribute more. So, this could have also enabled the decision to accumulate.\n\nHowever, data from Santiment showed that Ethereum’s development activity has subdued. At press time, the metric was down to 53.\n\nFor context, the development activity measures the commitment of developers to polish the working system of a project. Therefore, the value mentioned above implies that major innovation around the Ethereum blockchain has slowed down.\n\nBut it was an entirely different scenario with the Market Value to Realized Value Ratio (MVRV). At press time, the 365-day MVRV ratio of Ethereum was at 22.79%. This means that the sharks who were committed to buying ETH made more in profits over the last year.\n\nAt the same time, the current metric condition could serve as an obstruction to a further hike if ETH pushes upwards. However, there were talks of a bull market resumption which could negate speculation around ETH being overvalued at the MVRV spot.\n\nSometimes, appearances are deceptive\n\nWhile whales have turned to spot buying opportunities, the overall market did not share the same sentiment. This was because the active addresses in the last 30 days dropped from 7.9 million to 5.8 million.\n\nActive addresses indicate the daily level of participation and speculation around a token. Therefore, the decrease is a reliable indication that activity has slowed down on the Ethereum network. Often time, this serves as a signal that the general interest in a cryptocurrency is low.\n\nRead Ethereum’s [ETH] Price Prediction 2023-2024\n\nWith respect to circulation, it was not surprising that ETH tremendously fell for most of 2022. However, the condition at the time of writing showed an improvement.\n\nAt 46.8 million, the rise in circulation signifies an increase in the use of ETH. The coin exchanged hands at $1,800, a 4.41% increase in the last 24 hours."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vZGFpbHljb2luLmNvbS90cm9uLXRyeC1qdXN0aW4tc3VuLWRlY2VudHJhbGl6ZWQtaW50ZXJuZXQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Apr 2023 07:00:00 GMT",
        "title": "Tron (TRX): Justin Sun's Decentralized Internet - DailyCoin",
        "content": "The Tron crypto ecosystem continues to fly somewhat under the radar in the eternally competitive race to be the top Layer-1 blockchain. The cornerstone of Justin Sun’s cryptocurrency empire, the Tron blockchain holds more funds than Cardano (ADA), Solana (SOL), and Avalanche (AVAX) combined, but attracts far less hype and attention.\n\nWith over 150 million unique accounts, the Tron blockchain claims to be the world’s fastest-growing public blockchain. On paper, the Tron network is a perfect candidate to lead a decentralized internet revolution. The network is fast, affordable, and supports smart contract and dApp development, fitting the bill as a potential Ethereum (ETH) killer.\n\nWhat is Tron, and how does it work? Led by the Tron Foundation, can this scalable network separate itself from the fierce competition and fulfill its destiny to become a truly decentralized internet?\n\nWhat Is Tron (TRX)?\n\nTron is a Layer-1 blockchain network that aims to provide a frictionless and accessible decentralized internet for the masses. Like most blockchains, Tron features an account-based structure, meaning anyone can create a wallet and store their digital assets on a public ledger.\n\nThe Tron network was initially designed to provide a global entertainment platform where content creators could easily share their work worldwide. While Tron still supports these features, the network has also grown to offer a range of blockchain-based applications, like DeFi apps and NFT functionality.\n\nHow Does Tron Work?\n\nWhat’s interesting about Tron is that from the get-go, the team never promised to bring any wildly new innovations or progressions in blockchain technology. Everything from Tron’s consensus mechanism to its programming language was recycled from other networks, drawing criticism from experts.\n\nDespite this, Tron has become one of the largest blockchains in the crypto industry, both in terms of user count and market cap.\n\nThe Tron Blockchain’s Consensus Mechanism\n\nA delegated-Proof-of Stake consensus secures the Tron blockchain. In this DPoS chain, Tron token holders delegate their tokens to validator node operators. These validators, called Super Representatives, are responsible for producing new blocks on the network and representing their stakers in matters of protocol governance.\n\nEvery six hours, 27 Super Representatives (SRs) are chosen from a selection pool of over 100 SR Partners, who are in turn shortlisted from over 300 SR Candidates. The 27 chosen Super Representatives earn TRX tokens as a reward for creating new blocks and securing the Tron blockchain.\n\nNew blocks are created every three seconds and added to the circulating supply, with each new block rewarding the chosen Super Representative with 32 TRX coins.\n\nTron Network Architecture\n\nThe Tron blockchain operates a TVM (Tron Virtual Machine), which records all accounts and transactions on the network and enables developers to build and deploy smart contracts on the Tron Mainnet.\n\nWhile similar to an EVM (Ethereum Virtual Machine), the Tron network is not EVM-compatible. Cryptocurrency tokens on the Tron network follow the rules set by the TRC-20 token standard, unsurprisingly similar to Ethereum’s ERC-20 standard.\n\nAs outlined in the Tron whitepaper, the main infrastructure of the Tron blockchain is broken down into three layers. Separating network responsibilities into different layers helps ease congestion and scale the blockchain.\n\nCore Layer – The Tron core layer handles computational instructions written in Java or Solidity. Transactions are then sent to the Tron Virtual Machine, which executes code logic.\n\nApplication Layer – Users and developers interact with this layer to execute on-chain transactions and deploy decentralized applications, products, and services.\n\nStorage Layer – As the name suggests, the storage layer records blockchain data and keeps a live register of the state of the network and all Tron-based smart contracts.\n\nTron Blockchain Performance\n\nDespite not boasting any revolutionary new technologies or innovative features, the Tron network achieves high levels of scalability and decentralization. Tron claims that its network can reach a maximum transaction throughput of around 2,000 TPS (transactions per second).\n\nOn top of that, transaction fees on the network are typically low, with users expecting to pay around $0.000005 per transaction. In this respect, the Tron blockchain is comparable to Ripple (XRP).\n\nThese are impressive figures compared to certain Layer-1 networks like Ethereum and BNB Chain, which respectively struggle to hit 15 TPS and 150 TPS. However, Tron still falls short of networks like Solana and Aptos, which theoretically handle over 100,000 transactions per second while maintaining low transaction fees.\n\nThe Tronix token\n\nThe native token of the Tron blockchain, Tronix, is used to pay transaction fees and secure the network through Tron’s DPos consensus mechanism.\n\nTRX tokens are also used as the main currency of exchange for Tron NFTs and can be used in DeFi apps within the Tron ecosystem.\n\nThe Tron Ecosystem\n\nDeFi is booming on Tron thanks to a variety of decentralized applications and products. What many people don’t know is that the Tron network is the king of Tether (USDT), the largest stablecoin in the crypto market. More Tether coins are stored on the Tron blockchain than on any other network. This adds to Tron’s impressive stablecoin dominance over all chains that aren’t Ethereum.\n\nThe Tron network also hosts several DeFi apps exclusive to the Tron ecosystem, including JustLend, JustStable, and SunSwap, a decentralized exchange. DeFi users can also trade wrapped versions of other popular coins, like Bitcoin (BTC), in liquidity pools on the Tron blockchain.\n\nAdmittedly, it seems ironic that a blockchain so committed to decentralization would name its main dApps after one person, Tron founder Justin Sun.\n\nTron Partnerships\n\nLed by Justin Sun and the Tron Foundation, the Tron blockchain is no stranger to blockbuster partnerships. In October 2019, the Tron network confirmed a partnership with Samsung, one of the world’s largest tech companies. Tron tokens are integrated directly into Samsung’s built-in blockchain wallet, while the Samsung App Store has a section exclusively dedicated to Tron applications.\n\nTron also acquired one of the world’s largest online file-sharing platforms, BitTorrent, in 2018. The acquisition brought over 100 million users to the Tron ecosystem, making BitTorrent the largest decentralized application.\n\nTron History\n\nJustin Sun founded the Tron Foundation in 2017 to create a blockchain-based platform to share digital files and data and fairly reward content creators. Tron hosted an ICO (initial coin offering) on the Ethereum blockchain, successfully raising $70M.\n\nThe platform proved a great success but was initially limited by Ethereum’s scalability issues. Sun set a course of action to deploy a dedicated blockchain to host the platform and launch the Tron blockchain just one year later.\n\nIn 2021, Justin Sun stepped down as the CEO of Tron. This marked a significant moment for the Tron blockchain, which became truly decentralized. The network is now governed by its community of token holders and the Tron Foundation, a non-profit organization.\n\nTron’s Controversial Founder: Justin Sun\n\nThe founder of Tron, Justin Sun, is a polarizing personality in the crypto community. He never shies away from an online argument, even with industry thought-leaders like Vitalik Buterin, who insinuated that Sun plagiarized content from Ethereum when writing the Tron white paper.\n\nSome believe that Justin Sun has more money than sense. He once paid over $4M to have lunch with legendary investor Warren Buffet. He also spent over $500,000 on an Etherrock NFT, laughing about his purchase on Twitter.\n\nTron Pros and Cons\n\nThe Tron blockchain has plenty to offer. It’s fast and cheap, with over 100 million unique accounts stored on the network. Despite this, the Tron network still has a lot of work to do if it wants to compete with other top Layer-1 blockchains.\n\nPros\n\nHigh Transaction throughput – The Tron network claims to execute up to 2,000 transactions per second, making it significantly faster than Ethereum.\n\nLow fees – Transaction fees of the Tron blockchain cost less than a cent, making it affordable and accessible to users from all kinds of backgrounds.\n\nHigh TVL – Second only to Ethereum, the Tron network has a higher TVL (Total Value Locked) than all its other competitors. This means more funds are stored on Tron than on most other networks.\n\nCons\n\nLow comparative volume – Despite hanging high TVL, the network sees comparatively low trading volume. This suggests that even if plenty of people store their cryptocurrency on the Tron blockchain, most DeFi users aren’t trading there.\n\nOutperformed by other chains – The competition between Layer 1 blockchains is fierce. While Tron’s scalability is superior to legacy chains like Ethereum, more powerful networks like Solana and Aptos blow it out of the water.\n\nLow developer activity – Tron has a high user count and plenty of value stored on-chain. However, there are few dApps on the network compared to other chains. What’s more, this doesn’t look to be changing anytime soon. Electric Capital’s developer report suggests that fewer than 100 developers are building on Tron, compared to Ethereum’s 5,000+.\n\nOn the Flipside\n\nThe cryptocurrency industry is rapidly evolving, with new technology being discovered and implemented every day to improve blockchains. Even when Tron was launched, it didn’t provide any innovative developments. With so many emerging chains pushing the boundaries of blockchain technology, there is a chance that Tron will be left behind if it cannot adapt.\n\nWhy You Should Care\n\nTron is one of the largest crypto projects in the blockchain industry and holds the largest supply of Tether on its network. Tether plays an immense role in the health and reputation of the crypto space; if the Tron network were to suffer an outage, it would have a significant impact on the entire crypto market.\n\nFAQs"
    }
]