[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9sZWFybi93aGF0LWFyZS10aGUtdG9wLW5mdC1ibG9ja2NoYWlucy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "What Are the Top NFT Blockchains? - CoinDesk",
        "content": "Today, Flow is best known for NBA Top Shot, the NFT collectibles of National Basketball Association highlights. It was one of most popular NFT projects until the profile-picture NFT trend took over as of mid-2021, which has led to Flow falling behind some of the other chains in terms of volume. As of writing, Flow has done over $1 billion in trading volume, but the activity has taken a dramatic downturn since its all-time high of over $244 million in February 2021. Two years later, Flow had just over $6 million in trading volume."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAzLzA4L2NyeXB0by1sb25nLXNob3J0LXdoeS1sYXllci0yLXByb3RvY29scy1tYXR0ZXIv0gFgaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDMvMDgvY3J5cHRvLWxvbmctc2hvcnQtd2h5LWxheWVyLTItcHJvdG9jb2xzLW1hdHRlci9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "Let’s Talk About Crypto Protocol Layers and Why Investors Must Examine Them - CoinDesk",
        "content": "New week, new source of trouble. Crypto bank Silvergate said it’s on shaky financial footing by giving the dreaded “going concern” warning . But something else it did might matter more to the institutional community: It closed the Silvergate Exchange Network (SEN), a platform that helped traditional finance (TradFi) players tie into crypto exchanges. It was a “24/7 instant settlement service the bank's clients could use to conduct transactions between each other at any time, including nights and weekends,” according to a recent CoinDesk story . It was an important service given so much of TradFi is not 24/7; this was a vital bridge. Signature Bank's Signet is an alternative, though, and BCB Group is rushing to add features to help fill the gap."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3Mvc29sYW5hL3NvbGFuYS1zdXBwb3J0LWZyb20tZXRoZXJldW0tZm91bmRlci_SAU1odHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL3NvbGFuYS9zb2xhbmEtc3VwcG9ydC1mcm9tLWV0aGVyZXVtLWZvdW5kZXIvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "SOL Jumps 15% In 24 Hours As Solana Receives Support From Ethereum Founder - NewsBTC",
        "content": "Solana (SOL) has been completely engulfed in FUD since the FTX crash. This invariably resulted in the price of the token declining much faster than the rest of the market, and last week, SOL touched single-digit values for the first time in almost two years. However, there seems to be a turn in the tide for the digital asset as it receives support from Vitalik Buterin.\n\nVitalik Buterin Offers Support To Solana\n\nTaking to Twitter, Ethereum founder Vitalik Buterin expressed support for Solana for the first time. Solana which had been the fiercest competitor of Ethereum had been unable to keep up given its ties to FTX crypto exchange, its sister company Alameda Research, and its disgraced founder Sam Bankman-Fried, but Buterin is not pleased that the competitor is essentially crumbling.\n\nIn the tweet, the Ethereum founder explained that “some smart people” had told it that there was still a good developer community on the blockchain who are earnest and smart. Furthermore, they added that since the opportunistic people trying to make a quick buck had now been pushed out, they expect the network to have a bright future.\n\nButerin himself explains that he couldn’t tell if this was true looking in from the outside but said that he hoped that “the community gets its fair chance to thrive. This tweet was made about four days ago and it had an incredibly positive impact on Solana.\n\nSOL Price Rallies On Buterin Comments\n\nThe price of SOL saw an upward trend following the tweets from the Ethereum founder. Although Solana remains a long way from its glory days, Buterin’s tweets had given the bulls just the morale boost they needed and by Monday, SOL’s price had surged as high as $12 before correcting back down.\n\nSOL recovers above $11 | Source: SOLUSD on TradingView.com\n\nPresently, the price of the digital asset is sitting above $11, rising over 15% in the last 24 hours. This recovery has also helped to wipe out most of the losses recorded over the last week, and now, it is down only 1.81% in the last 7 days compared to over 20% losses being recorded last week.\n\nThis recovery also puts the digital asset close to the top of the list of gainers for the day. It sits only behind Lido DAO which is up over 16% in the last hours.\n\nAs for whether SOL will be able to maintain current prices and go higher, it depends on the momentum in the market. The cryptocurrency is still subject to intense FUD and community morale remains low but the $13 level remains within sights as long as buy pressure keeps up.\n\nFeatured image from Coin Culture, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1iYWxrcy1hcy1kb3JtYW50LXdoYWxlcy1yZWFjdGl2YXRlL9IBW2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1iYWxrcy1hcy1kb3JtYW50LXdoYWxlcy1yZWFjdGl2YXRlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "Ethereum Price Balks As Dormant Whales Reactivate - NewsBTC",
        "content": "Ethereum price closely followed that of bitcoin throughout the week and this saw the digital asset fall below the $1,200 level once more. Presently, the entire market looks to be consolidating but Ethereum has been put under some pressure following the activation of two whale addresses. These addresses which had not transacted for about half a decade had suddenly moved tens of millions of dollars worth of ETH between them.\n\nFive-Year-Old Whales Move $27 Million\n\nIn the early hours of Monday, Lookonchain, an on-chain data tracker, took to Twitter to post the re-awakening of long-dormant Ethereum addresses. These addresses both held at least $10 million worth of ETH on their balances and had not seen any type of activity in the last five years, until today.\n\nBoth wallets, seemingly out of nowhere, had first transferred out 1 ETH to a new wallet in what looks like test transactions. What followed was another large transaction that would empty out their balances.\n\nThe first wallet would transfer a total of 9,877 ETH in a single transaction, worth $11.7 million at current prices, while the second wallet would transfer out a total of 13,103.99 ETH in its second transaction, worth $15.5 million at press time. This brought their cumulative total transactions to more than $27 million.\n\nETH stalls at $1,185 | Source: ETHUSD on TradingView.com\n\nAll of the ETH was transferred to new, unknown wallets with no prior history besides the 1 ETH test transaction. The ETH is now sitting in these new Ethereum addresses and has not been touched so far.\n\nBad News For Ethereum?\n\nThe movement of such a large amount of ETH has stopped the digital asset in its tracks. So far, there has not been any meaningful movement in the Ethereum price which shows a lot of wariness on the part of investors and traders alike.\n\nHowever, despite the ETH from these whales being significant, it does not look to have any market impact since the coins were just moved from one storage wallet to another, as it seems. There has been no movement to centralized exchanges, and if this was a sale, it was an OTC trade which eliminates the pressure such a sale would have had on the open market.\n\nEthereum price on the other hand has now moved into the control of the bears. The $1,200 support was flipped and is now a resistance level that bulls must beat to attain any momentum. This also drags the digital asset well below the 100-day moving average of $1,439, showing bearishness for the medium to long term.\n\nETH’s price is currently trending at $1,180. It is down 5.22% in the last 7 days and saw trading volumes of approximately $4 billion in the last 24 hours.\n\nFeatured image from Bitcoinist, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tYXRoLWNvcnJlbGF0aW9uLWJpdGNvaW4tbWVyZ2Uv0gFRaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy9ldGhlcmV1bS9ldGhlcmV1bS1hdGgtY29ycmVsYXRpb24tYml0Y29pbi1tZXJnZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "Ethereum Finishes 2022 With ATH Correlation To Bitcoin, Despite The Merge - NewsBTC",
        "content": "Data shows Ethereum’s year of high correlation with Bitcoin is coming to an end with the metric hitting ATH values.\n\nEthereum Ends 2022 With All-Time High Correlation To Bitcoin\n\nAccording to the year-end report from Arcane Research, the global markets have all fallen strongly correlated this year. The “30-day correlations” is an indicator that measures how in-tune Bitcoin has been with another asset in terms of price movement over a 30-day period.\n\nWhen the value of this metric is greater than zero, it means there has been a positive correlation between BTC and the other asset in the past month. On the other hand, negative values imply that the price of the crypto has been reacting to changes in the value of the other asset by moving in the opposite direction.\n\nAlso, the higher the metric value (in either direction), the more the degree of the correlation. Naturally, the metric has a value equal to zero suggesting the two prices aren’t tied to each other at the moment.\n\nNow, here is a chart that shows the trend in Bitcoin’s 30-day correlations with Ethereum, S&P 500, and Nasdaq over the past year:\n\nLooks like the metric's value corresponding to ETH has been very high in recent weeks | Source: Arcane Research's 2022 - Year in Review\n\nAs the above graph displays, Bitcoin positively correlated with these three assets during 2022. BTC’s correlation has been around or above 0.5 for most of the year for the US equities, suggesting it has been decently tied with them.\n\nThe correlation with Ethereum, however, has been at values of around 0.9 or more, implying Bitcoin has been extremely correlated with it. Even now, as the year’s end, the correlation between these cryptos stands at 0.97, around ATH levels.\n\nBack in September of this year, ETH successfully finished its much-anticipated transition to a Proof-of-Stake consensus system, an event known as the Merge. Since the Merge brought some developments unique to Ethereum, the correlation with BTC dropped, as is apparent in the chart.\n\nHowever, it wasn’t long before the two started moving on the same wavelength again, so even the Merge wasn’t enough to cause sufficient impact to separate the coins.\n\nAlso, since Bitcoin is highly correlated with stocks, so is Ethereum. Though, Arcane Research expects that this correlation between the cryptos and the US equities will soften in the next year due to trading volumes in the crypto market declining substantially.\n\nETH Price\n\nAt the time of writing, Ethereum’s price floats around $1,200, down 2% in the last week.\n\nETH seems to have gone down recently | Source: ETHUSD on TradingView\n\nFeatured image from Pierre Borthiry – Peiobty on Unsplash.com, charts from TradingView.com, Arcane Research\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    }
]