[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS93YW50LXRvLWJlY29tZS1hbi1ldGhlcmV1bS12YWxpZGF0b3IteW91LWhhdmUtdG8td2FpdC00NS1kYXlzLWFuZC1oZXJlcy13aHkv0gFpaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL3dhbnQtdG8tYmVjb21lLWFuLWV0aGVyZXVtLXZhbGlkYXRvci15b3UtaGF2ZS10by13YWl0LTQ1LWRheXMtYW5kLWhlcmVzLXdoeS8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 03 Jun 2023 07:00:00 GMT",
        "title": "Want to Become an Ethereum Validator? You Have to Wait 45 Days and Here’s Why - CryptoPotato",
        "content": "This year, Ethereum’s network officially transitioned to a Proof-of-Stake consensus algorithm, leaving Proof-of-Work forever behind.\n\nOne of the multiple implications The Merge has had on the protocol is that there are no longer Ethereum miners. Validators secure the network now, and the path to becoming one is supposed to be tremendously simplified – deposit 32 ETH to the staking contract and run the appropriate software.\n\nBut it turns out that there’s quite a queue for validators lined up, and becoming one might take some time.\n\n45 Days to Become an Ethereum Validator\n\nYou read that right – if you have ETH to spare and you want to invest in securing the network and earn rewards for this important task, you’d have to wait… a lot.\n\nIt appears that becoming a validator is something so sought after that the queue keeps on increasing.\n\nData from WenMerge shows that there are 92,536 validators currently waiting to enter the network. This will take approximately 45 days to clean up.\n\nThe competition is so high, and it appears that practically nobody wants to exit. The exit queue currently consists of only 4 validators.\n\nCelsius Enters the Queue\n\nThe embattled cryptocurrency lender is part of the reason why the queue is stretched out.\n\nThroughout the past couple of days, Celsius Network has moved some $600 million worth of ETH into the staking contract and this rate shows no signs of slowing down, according to Arkham Intelligence.\n\nCelsius is making moves to stake all the ETH they currently hold, representing movements totalling almost $1B in on-chain flows. Over the past 24 hours, they have staked over $600M of ETH, with their rate of deposits showing no sign of slowing. 👇 pic.twitter.com/8bW3xB15UH — Arkham (@ArkhamIntel) June 2, 2023\n\nAt current prices, the above is made up of around 316K ETH added to the validator enter queue.\n\nRecall that back in April, CryptoPotato reported that leading US-based cryptocurrency exchanges – Coinbase and Gemini – joined the bid for the lender’s assets."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vY29pbmdhcGUuY29tL2NlbHNpdXMtODAwbS1ldGgtc3Rha2luZy1leHRlbmRzLWV0aGVyZXVtLXF1ZXVlL9IBSWh0dHBzOi8vY29pbmdhcGUuY29tL2NlbHNpdXMtODAwbS1ldGgtc3Rha2luZy1leHRlbmRzLWV0aGVyZXVtLXF1ZXVlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 03 Jun 2023 07:00:00 GMT",
        "title": "Celsius’ $800M ETH Staking Extends Ethereum Queue - CoinGape",
        "content": "Bankrupt crypto lender Celsius Network has made an $800 million ether (ETH) staking move that has caused significant delays in the Ethereum validator queue. The company deposited $745 million of ETH into staking contracts in just two days, adding to the already long waiting time to deploy new validators on the Ethereum network.\n\nCelsius Ethereum Staking\n\nCelsius is reshuffling its staked ETH holdings after Ethereum’s Shanghai upgrade allowed withdrawals from staking contracts. This strategic shake-up has caused the queue to stretch to 44 days, with Celsius potentially adding nearly a week of delay, according to Tom Wan of 21Shares.\n\nadvertisement\n\nPreviously, Celsius held 460,000 ETH ($870 million) staked with Lido Finance and deployed 160,000 tokens ($300 million) in their own staking pool.\n\nCoinGape reported that it has reportedly withdrawn 428,000 staked Ethereum (stETH) valued at $780 million.\n\nBankrupt Crypto Lender Case\n\nThe reshuffling of staked assets coincides with Celsius’ ongoing efforts to restructure following a bankruptcy protection filing in July. The company faced liquidity issues due to plummeting cryptocurrency prices and a surge in user withdrawals.\n\nRecently, the U.S. bankruptcy court auctioned off Celsius to Fahrenheit, an investment group backed by Arrington Capital, which will take over the lender’s assets, including institutional loan portfolio, staked cryptocurrencies, and crypto mining units.\n\nRead Former Celsius CEO’s 1B Plan…\n\nCelsius Network on May 25 announced the completion of the auction process to transfer the assets to crypto consortium Fahrenheit LLC.\n\nEven after these transfers, Celsius’ wallets still hold around $109 million worth of ETH, according to data from Arkham. However, this influx of staking activity has further strained the Ethereum validator queue, which was already burdened with increased demand since the activation of the Shanghai upgrade on April 12.\n\nDeposits have exceeded withdrawals by nearly $5.5 billion, leaving new participants with a month-long wait to set up validators, according to blockchain intelligence firm Nansen."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA2LzAzL3BvcHVsYXItY3J5cHRvLWFuYWx5c3QtYnVsbGlzaC1vbi1vbmUtZXRoZXJldW0tYmFzZWQtYWx0Y29pbi1zYXlzLWl0cy1zaG93aW5nLXNvbGlkLXN0cmVuZ3RoL9IBggFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNi8wMy9wb3B1bGFyLWNyeXB0by1hbmFseXN0LWJ1bGxpc2gtb24tb25lLWV0aGVyZXVtLWJhc2VkLWFsdGNvaW4tc2F5cy1pdHMtc2hvd2luZy1zb2xpZC1zdHJlbmd0aC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 03 Jun 2023 07:00:00 GMT",
        "title": "Popular Crypto Analyst Bullish on One Ethereum-Based Altcoin, Says It’s Showing ‘Solid Strength’ - The Daily Hodl",
        "content": "A widely followed crypto analyst says that one Ethereum (ETH)-based altcoin is flashing signs of bullishness against both the US dollar and Bitcoin (BTC).\n\nPseudonymous crypto analyst Kaleo tells his 590,200 Twitter followers that the decentralized derivatives exchange Injective (INJ) looks poised to outperform Bitcoin (INJ/BTC).\n\nAccording to a chart shared by the analyst, the INJ/BTC pair appears to have successfully retested a diagonal resistance as support.\n\n“INJ is showing solid strength vs. BTC again. I’m long here.”\n\nKaleo later updates the chart, saying that the INJ/BTC pair could briefly cool off after rallying to as high as 0.0003031 BTC ($8.23).\n\n“INJ / BTC with a solid move so far. Wouldn’t be surprised to see a bit of accumulation here before a continuation higher.”\n\nKaleo is also keeping a close watch on INJ’s price action against the US dollar.\n\nThe popular analyst says that the pair also looks bullish after taking out its diagonal resistance and retesting it as support.\n\n“INJ / USD chart looks great as well.”\n\nInjective is worth $7.86 at time of writing, up 7.7% during the last 24 hours.\n\nInjective has recently announced a number of new developments to its ecosystem, including the integration with the blockchain-scaling solution Polygon (MATIC).\n\n“Injective launches a groundbreaking integration with [Polygon Labs] to enable true DeFi (decentralized finance) composability. For the first time, native assets from Polygon and Injective can be utilized for a diverse array of cross-chain use cases within the two ecosystems.”\n\nInjective also completed an upgrade to its Avalon mainnet after the proposal was approved by 99.8% of the community voters.\n\n“The Avalon Mainnet Upgrade is complete to bring you the most performant Injective infrastructure to date:\n\nRobust scalability optimizations\n\nPoS (proof of stake) validation revamp\n\nFastest block times on mainnet.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtbWlnaHQtZmluYWxseS1zdXJwYXNzLWJpdGNvaW4tYnRjLWJ5LW1hcmtldC1jYXAtYW5hbHlzdC1kaXNwbGF5cy1mb3VyLXNjZW5hcmlvc9IBcGh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtbWlnaHQtZmluYWxseS1zdXJwYXNzLWJpdGNvaW4tYnRjLWJ5LW1hcmtldC1jYXAtYW5hbHlzdC1kaXNwbGF5cy1mb3VyLXNjZW5hcmlvcz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 03 Jun 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Might Finally Surpass Bitcoin (BTC) by Market Cap, Analyst Displays Four Scenarios - U.Today",
        "content": "Advertisement\n\nIndependent cryptocurrency analyst shared the charts of Bitcoin (BTC) and Ethereum (ETH) \"domination,\" i.e., the percentage of net crypto segment market cap. He indicated two trend lines that may display the timeline of \"flippening\" much-anticipated by the Ethereum (ETH) community.\n\nEthereum (ETH) might flip Bitcoin (BTC) in 2025-2026, here's how\n\nMorgan Bennett tracked the dynamics of the share of Bitcoin (BTC) and Ethereum (ETH) market capitalization compared to the entire cryptocurrencies segment. Although he cannot call himself a \"fan\" of technical analysis, he is sure that two trends are obvious: Bitcoin's (BTC) domination shrinks while the Ethereum (ETH) one grows.\n\nNot a fan of technical analysis but it's hard to argue against long-term trends.\n\n\n\nIf the trend continues, $ETH will flip $BTC within the next 2-3 years. pic.twitter.com/CSFtnjwgnF — Mo (@MorganTBennett) June 2, 2023\n\nShould both trend lines be valid, the \"flippening\" might happen in the next two or three years. On the chart by Bennett, it takes place in Q4, 2026. Thanks to the growing size of the altcoin market, both cryptocurrencies will be responsible for 23-24% by the moment of \"flippening.\"\n\nEthereum (ETH) can surpass Bitcoin (BTC) \"gently,\" \"gradually,\" \"suddenly\" or both cryptocurrencies can fall victim to the \"Digital Gold\" narrative disappearing.\n\nBy press time, Bitcoin (BTC), the largest cryptocurrency, is in charge of over 46.2% of cryptocurrency market capitalization, while Ethereum's (ETH) share exceeds 19.5%. The third largest cryptocurrency, the U.S. Dollar Tether (USDT) stablecoin, totals 7.36% of net crypto market cap.\n\nBitcoin (BTC) and Ethereum (ETH), two largest cryptocurrencies, were at the closest point to \"flippening\" six years ago, in mid-June 2017. Bitcoin (BTC) was in charge of 37% of the market, and Ethereum's (ETH) capitalization comprised 32%.\n\nBy contrast, in September 2019, Bitcoin's (BTC) market cap was 10x larger than that of Ethereum (ETH) since the latter was much more affected by the Crypto Winter of 2018-2020.\n\n\"Flippening could happen, but line is ridiculous,\" crypto veteran Chris Blec says\n\nThe followers of Bennett agreed with his calculations. However, some of them stressed that they are tired of \"flippening\" narratives that have been discussed here and there since the launch of Ethereum (ETH) in June 2015.\n\nProminent DeFi analyst and influencer Chris Blec, author of the Blec Report project, says that in general, Bitcoin (BTC) has all chances of being surpassed by Ethereum (ETH), but the accuracy of the aforementioned model should not be overestimated:\n\nI don't disagree that the flippening could happen but that line is really ridiculous.. you just completely ignored all of the data points between 2016 and today\n\nBennett agreed with this point of view, but added that it is impossible to find a function that does not predict the flippening even if Ethereum's (ETH) dominance at the start was considered 0."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9yYXBpZC1ncm93dGgtaW4tZGVmaS1mb2N1c2VkLWV0aGVyZXVtLWxpcXVpZC1zdGFraW5nLWRlcml2YXRpdmVzLXBsYXRmb3Jtcy1yYWlzZXMtZXllYnJvd3PSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 03 Jun 2023 07:00:00 GMT",
        "title": "Rapid growth in DeFi-focused Ethereum liquid staking derivatives platforms raises eyebrows - Cointelegraph",
        "content": "Ether’s (ETH) decentralized finance (DeFi) activity has declined in the bear market, and the sector faces further competition from Ethereum’s annual staking reward of 4%, according to Glassnode analysts. However, a DeFi narrative is building around liquid staking derivative (LSD) tokens, which could revive Ethereum’s network activity.\n\nThe percentage of gas consumed by DeFi protocols has dropped from 34% in 2020 to between 8% and 16% presently, with nonfungible tokens (NFTs) commanding the maximum share of 25–30%, according to a recent report from Glassnode.\n\nEthereum gas usage by transaction type. Source: Glassnode\n\nGlassnode’s supply-weighted price index for DeFi, priced in United States dollars and ETH, recorded a 90% loss since early 2021.\n\nThe so-called DeFi “blue chips,” which represent a basket of governance tokens from well-known DeFi protocols like Uniswap (UNI), MakerDAO (MKR), Aave (AAVE), Compound (COMP), Balancer (BAL) and SushiSwap (SUSHI), have lost 88% of their market capitalization from all-time highs of $45 billion in May 2021.\n\nETH vs. DeFi tokens price performance. Source: Glassnode\n\nDeFi blue chip tokens have underperformed against ETH during bullish market rallies and experienced a more severe drop than ETH “on the downside during the bear.” The analysts predict that since the staking of ETH now yields 4%, it will act as a “new hurdle rate over which token returns must jump.” This yield represents the benchmark rate for Ether investors.\n\nLeading lending protocols like Aave and Compound offer between 2–3% yields on lending stablecoins and Ether. Moreover, DeFi protocols also come with smart contract risk, which is eliminated with proof-of-stake validators.\n\nStaking has become popular among Ethereum investors, especially after the Shapella upgrade in April 2023, which enabled redemptions from the staking contract.\n\nBy the end of May, Ethereum users staked 21.63 million ETH worth $40.021 billion, representing 18% of Ethereum’s total supply.\n\nLSD platforms like Lido and Rocket Pool account for one-third of this massive market. These applications offer a tokenized representation of staked ETH, allowing investors access to the staking yields without compromising liquidity.\n\nA growing trend among Ethereum investors is interacting with LSD financialization (LSDfi), which aims to put the liquidity offered by the LSD tokens to use in DeFi applications.\n\nRelated: LSD for DeFi: Tenet, LayerZero partner to drive cross-chain liquid staking adoption\n\nIs LSDfi the solution?\n\nLSDfi leverages the liquidity of LSD tokens into DeFi-like lending protocols and liquidity on exchanges for higher yields. Given that a considerable amount of ETH is staked with the LSD platforms, LSDfi has the potential to revive DeFi activity.\n\nA Dune analytics dashboard by data analyst Defimochi shows the total value locked (TVL) in LSDfi protocols has touched $411 million, rising exponentially since mid-May. Some of the popular names in the sector are Pendle Finance, Lybra Finance, Curve Finance and Alchemix Protocol.\n\nLSDfi total value locked. Source: Dune\n\nThe liquidity of LSD tokens on Curve Finance — the largest stablecoin exchange in the market — has surpassed $1.5 billion. Curve also enabled the minting of its overcollateralized stablecoin crvUSD (CRVUSD) using Frax Protocol’s staked Frax Ether (SFRXETH) as collateral.\n\nNew protocols like Lybra Finance and Pendle Finance, which are looking to leverage the liquidity provided by LSD tokens, have also become popular.\n\nAs has happened before with DeFi, newer applications will likely tap the liquidity of LSD tokens by facilitating liquidity mining of their governance tokens for early depositors.\n\nWhile these can bring decent gains for some users, these protocols could carry smart contract risks and the chance of getting rug pulled, introducing the risks that come with the higher gains that LSDfi provides.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    }
]