[
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9lYXJuLWJpdGNvaW4tZXRoZXJldW0tcGxheWluZy1ibGluZy0xOTEwMTU5MDUuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 26 Jun 2023 07:00:00 GMT",
        "title": "How to Earn Bitcoin or Ethereum by Playing Bling Mobile Games - Yahoo Finance",
        "content": "Bling Financial makes iOS and Android games that riff on familiar and well-trodden genres and formulas, ranging from the solitaire card game to bubble-popping puzzle games. But there’s a compelling twist in the mix: you can earn small amounts of Bitcoin or Ethereum by playing.\n\nThis feature is not enabled by default when you start playing Bling games like Sweet Bitcoin, Ethereum Blast, or Bitcoin Pop. Luckily, it’s easy to start earning Bling Points while you play levels and watch ads, and then those Points can be converted into BTC or ETH and then deposited into a Coinbase or PayPal account.\n\nWant to earn a little crypto while gaming? Here’s another way to do so.\n\nHow do I turn on crypto earnings?\n\nBy default, Bling’s games just look and play like standard mobile games—albeit ones with a lot of video ads in the mix. To earn cryptocurrency for playing, you’ll need to enable the feature by signing in with an account.\n\nJust tap the “Get Started” button at the top of a Bling app screen and then choose whether to log in with a Google or Facebook account or Apple account if you're using iOS. Tapping the downward-pointing arrow at the bottom also unearths an option to log in with an email address instead. Once logged in, you’ll earn Bling Points that can be redeemed for Bitcoin or Ethereum.\n\nScreenshots from Sweet Bitcoin, a Bling Financial game. Image: Decrypt\n\nWhich games does this work with?\n\nAs of this writing, Bling offers nine mobile games across iOS and Android that offer crypto rewards. The in-game interfaces are largely identical, and they all share the same Bling account so you can earn across games. Here are the games available so far, although this list may change over time:\n\nBitcoin Blast (iOS | Android)\n\nBitcoin Blocks (iOS | Android)\n\nBitcoin Food Fight (iOS | Android)\n\nBitcoin Pop (iOS | Android)\n\nBitcoin Solitaire (iOS | Android)\n\nBitcoin Sudoku (iOS | Android)\n\nEthereum Blast (iOS | Android)\n\nSweet Bitcoin (iOS | Android)\n\nWord Breeze (iOS | Android)\n\nHow do I cash out?\n\nYou’ll need to use the Bling Financial website to cash in your earned points for cryptocurrency and deposit your winnings. Simply click the “Cash Out” button in the upper right corner of the Bling website, and then log in with the same account you used in the Bling app.\n\nStory continues\n\nConverting Bling Points to Bitcoin. Image: Decrypt\n\nBling will show you how much you’ve earned. In this example, I have nearly 60,000 Bling points, which equates to 0.00000060 BTC—or just under $0.02 worth of Bitcoin as of this writing.\n\nYou can then choose either Bitcoin or Ethereum, and have the earnings transferred to a Coinbase account—or you can choose U.S. dollars and send that to a PayPal account. After cashing out, you’ll have to wait seven days to do so again."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9oc2JjLWhvbmcta29uZy1sYXVuY2hlcy1zdXBwb3J0LTIxMTU0NDQ3Ni5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 26 Jun 2023 07:00:00 GMT",
        "title": "HSBC Hong Kong Launches Support for Bitcoin and Ethereum ETFs - Yahoo Finance",
        "content": "HSBC Hong Kong customers can now trade Bitcoin and Ethereum futures Exchange Traded Funds (ETFs), broadening access to digital asset derivatives in the emerging Asia crypto hub.\n\nThe ETFs, which are traded as securities, were listed on HSBC Hong Kong’s so-called “Easy Invest” mobile app on Monday. They offer traders exposure to Bitcoin and Ethereum futures based on derivative contracts that trade on commodity exchanges.\n\nThe specific offerings are CSOP Bitcoin Futures ETF, CSOP Ethereum Futures ETF, and Samsung Bitcoin Futures Active ETF, a representative from HSBC Hong Kong confirmed to Decrypt. The news was first reported by Chinese crypto journalist Colin Wu.\n\nSCOOP: HSBC, the largest bank in Hong Kong, today allows its customers to buy and sell Bitcoin and Ethereum ETFs listed on the Hong Kong exchange, and is also the first bank in Hong Kong to allow it. The move will expand local users’ exposure to cryptocurrencies in Hong Kong. pic.twitter.com/vH0LieSVGw — Wu Blockchain (@WuBlockchain) June 26, 2023\n\nHSBC is the largest bank in Hong Kong, Wu said, and HSBC is the first lender in Hong Kong to allow its customers access to digital asset ETFs.\n\nAdding ETFs to its investment platform offers HSBC Hong Kong investors access to derivatives, without which customers might seek out access on an unregulated exchange, possibly using a VPN, Sei Labs co-founder Jeff Feng told Decrypt.\n\n“It’s a clear opportunity for [HSBC] to get ahead and offer this one product that is otherwise not allowed in Hong Kong,” he said, adding there’s a “clear customer need.”\n\nThe CSOP Bitcoin Futures ETF and CSOP Ethereum Futures ETF are managed by CSOP Asset Management, a firm that saw the two products listed on the Hong Kong Stock Exchange in December of last year. The two ETFs were the first in Asia to track digital asset futures, according to the firm’s website.\n\nStory continues\n\nBoth ETFs invest in futures contracts that trade on the Chicago Mercantile Exchange (CME), making them an “easy transparent way for investors to capture the performance” of Bitcoin and Ethereum, according to CSOP Asset Management.\n\nThe Samsung Bitcoin Futures Active ETF is managed by Samsung Asset Management Hong Kong and invests in CME contracts as well, but launched in January of this year.\n\nWhile there’s robust demand for spot access to crypto among retail investors in Hong Kong, Feng said that the demand for derivatives is equal, if not greater. And ETFs allow companies to offer exposure to crypto without opening themselves to regulatory risk in a nascent industry to which Hong Kong has only recently signaled openness.\n\n“If all of the centralized exchanges are getting this much regulatory scrutiny, it wouldn't be too wise to go out and try to launch another,” Feng said of crypto exchanges more generally. “It's much safer to do what's already been proven. There's a clear playbook.”\n\nFutures ETFs correlated to the performance of digital assets are nothing new in the United States. While the Securities and Exchange Commission (SEC) has not approved a spot-based Bitcoin ETF yet—BlackRock wants to change that—ProShares' Bitcoin futures ETF launched on the New York Stock Exchange in 2021.\n\nFeng said the “simplicity and convenience” of ETFs make them a much more palatable option for retail traders compared to other derivatives, such as options, where traders need to understand concepts like strike prices and gamma.\n\n“When you have simplicity, what you eventually will get is volume,” he said. “People will eventually speculate because it’s just so easy.”"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9oc2JjLWhvbmcta29uZy1sYXVuY2hlcy1zdXBwb3J0LTIxMTU0NDQ3Ni5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 26 Jun 2023 07:00:00 GMT",
        "title": "HSBC Hong Kong Launches Support for Bitcoin and Ethereum ETFs - Yahoo Finance",
        "content": "HSBC Hong Kong customers can now trade Bitcoin and Ethereum futures Exchange Traded Funds (ETFs), broadening access to digital asset derivatives in the emerging Asia crypto hub.\n\nThe ETFs, which are traded as securities, were listed on HSBC Hong Kong’s so-called “Easy Invest” mobile app on Monday. They offer traders exposure to Bitcoin and Ethereum futures based on derivative contracts that trade on commodity exchanges.\n\nThe specific offerings are CSOP Bitcoin Futures ETF, CSOP Ethereum Futures ETF, and Samsung Bitcoin Futures Active ETF, a representative from HSBC Hong Kong confirmed to Decrypt. The news was first reported by Chinese crypto journalist Colin Wu.\n\nSCOOP: HSBC, the largest bank in Hong Kong, today allows its customers to buy and sell Bitcoin and Ethereum ETFs listed on the Hong Kong exchange, and is also the first bank in Hong Kong to allow it. The move will expand local users’ exposure to cryptocurrencies in Hong Kong. pic.twitter.com/vH0LieSVGw — Wu Blockchain (@WuBlockchain) June 26, 2023\n\nHSBC is the largest bank in Hong Kong, Wu said, and HSBC is the first lender in Hong Kong to allow its customers access to digital asset ETFs.\n\nAdding ETFs to its investment platform offers HSBC Hong Kong investors access to derivatives, without which customers might seek out access on an unregulated exchange, possibly using a VPN, Sei Labs co-founder Jeff Feng told Decrypt.\n\n“It’s a clear opportunity for [HSBC] to get ahead and offer this one product that is otherwise not allowed in Hong Kong,” he said, adding there’s a “clear customer need.”\n\nThe CSOP Bitcoin Futures ETF and CSOP Ethereum Futures ETF are managed by CSOP Asset Management, a firm that saw the two products listed on the Hong Kong Stock Exchange in December of last year. The two ETFs were the first in Asia to track digital asset futures, according to the firm’s website.\n\nStory continues\n\nBoth ETFs invest in futures contracts that trade on the Chicago Mercantile Exchange (CME), making them an “easy transparent way for investors to capture the performance” of Bitcoin and Ethereum, according to CSOP Asset Management.\n\nThe Samsung Bitcoin Futures Active ETF is managed by Samsung Asset Management Hong Kong and invests in CME contracts as well, but launched in January of this year.\n\nWhile there’s robust demand for spot access to crypto among retail investors in Hong Kong, Feng said that the demand for derivatives is equal, if not greater. And ETFs allow companies to offer exposure to crypto without opening themselves to regulatory risk in a nascent industry to which Hong Kong has only recently signaled openness.\n\n“If all of the centralized exchanges are getting this much regulatory scrutiny, it wouldn't be too wise to go out and try to launch another,” Feng said of crypto exchanges more generally. “It's much safer to do what's already been proven. There's a clear playbook.”\n\nFutures ETFs correlated to the performance of digital assets are nothing new in the United States. While the Securities and Exchange Commission (SEC) has not approved a spot-based Bitcoin ETF yet—BlackRock wants to change that—ProShares' Bitcoin futures ETF launched on the New York Stock Exchange in 2021.\n\nFeng said the “simplicity and convenience” of ETFs make them a much more palatable option for retail traders compared to other derivatives, such as options, where traders need to understand concepts like strike prices and gamma.\n\n“When you have simplicity, what you eventually will get is volume,” he said. “People will eventually speculate because it’s just so easy.”"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tMjAwMC0xMi1tLXNob3J0LXNlbGxlci1uZWFycy1saXF1aWRhdGlvbi_SAVxodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2V0aGVyZXVtL2V0aGVyZXVtLTIwMDAtMTItbS1zaG9ydC1zZWxsZXItbmVhcnMtbGlxdWlkYXRpb24vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 26 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Poised To Break $2,000 As $12 Million Short Seller Nears Liquidation - NewsBTC",
        "content": "The Ethereum price has followed Bitcoin’s lead and has seen a 10.3% price increase over the past seven days. News of BlackRock’s Bitcoin spot ETF filing with the US Securities and Exchange Commission took the entire market by surprise and also breathed new life into altcoins. For one trader on the decentralized perpetual exchange GMX, however, the news is not really good news, but rather a nightmare.\n\nEthereum Short Seller Getting Rekt?\n\nThe largest short seller on GMX is using 6.64x leverage to short Ether (ETH) at an entry price of $1,703.97. A total of $1.8 million of collateral is at stake for the anonymous trader. At press time, the position was down 77.4% for a total of -$1.416 million.\n\nAs it stands, the trader’s short position of about $12 million in ETH will be liquidated when the Ethereum price reaches $1,945.18. According to a report from Chinese journalist Colin Wu, it could be the owner of rebelvarma.lens.\n\nAs popular analyst An Ape’s Prologue speculates, the ETH short seller could even double down on his bet. As the analyst writes, the consensus assumes that the short position will be liquidated when ETH reaches $1945. However, there are limit orders that could add a total of $149,000 to the trader’s collateral within the $1935 and $1945 price range. If triggered, this could increase the liquidation price to around $1967.\n\nThe analyst’s chart below shows how his liquidation price changes with ETH price swings. Until Ethereum reaches $1935, the liquidation price remains at $1945, but limit orders are triggered when ETH enters the $1935 and $1945 range, increasing the liquidation price to $1967.\n\nIn addition, the analyst notes that the address holds about $224,000 worth of other assets spread across Arbitrum and the Binance Smart Chain: $90,000 in USDT, $51,000 in USDC, $64,000 in WBTC and $21,500 in AAVE.\n\n“With a history of mitigating liquidation risk by bridging tokens from other chains to Arbitrum for collateral, we’ll probably see a similar strategy if ETH prices increase. The $224k in available assets could be used to top up collateral in this scenario,” the analyst notes.\n\nIf the ETH short seller uses up all of its assets and puts them up as collateral, the maximum liquidation price could rise to around $2,000, representing a further 6.5% price increase from the current price. Hence, Twitter user @apes_prologue concludes:\n\nWhile his position appears risky, the danger of liquidation is not as imminent as popularly believed, as he has mechanisms at his disposal to protect his position. Additionally, it is also possible he could have hedged his position in other markets that we are unaware of.\n\nETH On The Verge Of Breaking Above $2,000?\n\nRumors are circulating in the crypto community that the liquidation of the GMX short-seller could trigger a breakout of ETH above $2,000. The 1-hour chart of Ether shows that the price is currently stuck in the price range between $1,964 and $1,930 for the moment. A breakout to the upside or downside could be decisive for the next move.\n\nA look at the 1-day chart reveals that a breakout above $1,930 does not necessarily mean a follow-through to above $2,000. The 78.6% Fibonacci retracement level is at $1,975, where major resistance is expected. Ethereum bulls can only target the psychologically important $2,000 level if they break out above this price level.\n\nFeatured image from iStock, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLWFzLXNoYW5naGFpLXVwZ3JhZGUtYXBwcm9hY2hlcy1jYW4tZXRoLWhpdC1uZXctaGlnaC0yMDIzLmh0bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 26 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction as Shanghai Upgrade Approaches – Can ETH Hit a New High in 2023? - Cryptonews",
        "content": "Ethereum Price Prediction as Shanghai Upgrade Approaches – Can ETH Hit a New High in 2023?\n\nEthereum logo. Source: Adobe\n\nAfter hitting its highest level in a little under eight months on Wednesday in the mid-$1,900s, Ether (ETH) is experiencing a modest pullback and was last changing hands in the mid-$1,800s.\n\nOn the day, the world’s second most valuable cryptocurrency by market capitalization that powers the world’s most widely used smart-contract-enabled Ethereum blockchain is down a little over 2%, according to TradingView.\n\nBut the cryptocurrency’s near-term technical outlook continues to look good. ETH has been finding decent support recently from its 21-Day Moving Average, and all of its other major moving averages are on the rise in consecutive order.\n\nThe fact that ETH is currently finding decent support in the mid-$1,800s has spurred optimism that an extension of gains in the short-term toward the August 2022 highs just above $2,000 remains a strong likelihood.\n\nMoreover, ETH’s 14-Day Relative Strength Index (RSI) is not yet in overbought territory, suggesting a reduced risk of near-term profit-taking.\n\nSome analysts and traders have expressed concerns that, in the wake of a series of key upgrades to the Ethereum blockchain on the 12th of April, ETH could experience some short-term selling pressure.\n\nThe so-called “Shapella” upgrade will, amongst other things, allow for the withdrawal of staked Ether tokens.\n\nMost analysts view the development as a long-term positive for the network – it is assumed that more flexible staking withdrawals will eventually attract many more ETH owners into staking their tokens.\n\nBut some think ETH could experience either a “sell-the-news” reaction and have warned that there could be short-term price pressures as investors sell ETH tokens that have been stuck in staking contracts for a long time.\n\nETH staking has been active since late-2020 on Ethereum’s beacon chain, before the Ethereum blockchain’s merge to proof-of-stake last September.\n\nPrice Prediction – Can ETH Hit An All-Time High in 2023?\n\nEven if ETH was to experience a post-Shapella upgrade dip, many expect the downside would be short-lived.\n\nETH also saw a strong bounce from its 200DMA last month, a strong medium-term bullish indicator.\n\nThe “golden cross” (when the 50-Day Moving Average crosses above the 200-Day Moving Average) in early February is another good sign for ETH’s medium-term technical outlook.\n\nMoreover, macro tailwinds, such as expectations that the Fed will be cutting interest rates later this year to stave off a bank crisis and recession, continue to offer crypto markets broad support.\n\nWhile it can certainly be said that ETH has a positive medium-to-long-term outlook, betting on the cryptocurrency to return to all-time highs this year is another thing.\n\nEther hitting fresh all-time highs this year would require it to rally 160% from current levels.\n\nBut this is the crypto market. ETH is already up more than 100% from last year’s lows in the $800s.\n\nAnd between the months of November 2020 and April 2021, Ether gained 600%.\n\nA 160% rally this year should thus by no means be ruled out as a possibility.\n\nBuy Ethereum Now\n\nEthereum Alternatives to Consider\n\nWhile ETH’s outlook is strong, investors should nonetheless always be on the lookout to diversify their crypto holdings.\n\nOne high-risk-high-reward investment strategy that some investors might want to consider is getting involved in crypto presales.\n\nThis is where investors buy the tokens of up-start crypto projects to help fund their development.\n\nThese tokens are nearly always sold very cheap and there is a long history of presales delivering huge exponential gains to early investors.\n\nMany of these projects have fantastic teams behind them and a great vision to deliver a revolutionary crypto application/platform.\n\nIf an investor can identify such projects, the risk/reward of their presale investment is very good.\n\nThe team at Cryptonews spends a lot of time combing through presale projects to help investors out.\n\nHere is a list of 15 of what the project deems as the best crypto presales of 2023.\n\nDisclaimer: The Industry Talk section features insights by crypto industry players and is not a part of the editorial content of Cryptonews.com."
    }
]