[
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9mcmFua2xpbi10ZW1wbGV0b24tYmV0cy1iaWctZXRoZXJldW0tMTgwMDQ0NTAwLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Apr 2023 07:00:00 GMT",
        "title": "Franklin Templeton Bets Big on Ethereum by Putting Fund on Polygon - Yahoo Finance",
        "content": "Asset manager Franklin Templeton, which oversees $1.4 trillion on behalf of clients, today announced that one of its funds is now supported on the Polygon blockchain.\n\nOne of the world’s largest asset managers, Franklin Templeton said Wednesday that its Nasdaq-listed OnChain U.S. Government Money Fund (FOBXX) would use Polygon so it could “be further compatible with the rest of the digital ecosystem.”\n\nFOBXX is Franklin Templeton’s crypto product which puts cash into American government securities, cash and repurchase agreements. It currently has over $270 million in assets under management (AUM).\n\nIt is the first U.S.-registered fund to use a blockchain to process transactions and record share ownership.\n\nPolygon is the blockchain behind the 10th largest cryptocurrency by market cap, MATIC. It is a scaling platform for Ethereum, meaning that it works to make Ethereum faster and more efficient.\n\nHead of Digital Assets at Franklin Templetonton Roger Bayston said: “Extending the reach of the Franklin OnChain U.S. Government Money Fund to Polygon enables the Fund to be further compatible with the rest of the digital ecosystem, specifically through an Ethereum-based blockchain.”\n\nDecrypt’s 2022 Crypto Project of the Year: Polygon\n\nColin Butler, Global Head of Institutional Capital at Polygon Labs, added that “Franklin Templetonton is at the forefront” of tokenizing assets.\n\nInvestors can buy shares of FOBXX and hold them in digital wallets via the Benji Investments mobile app.\n\nFranklin Templeton has long been involved in crypto: It announced a digital asset venture fund two years ago, and started digitizing shares for a money market fund on Stellar’s blockchain back in 2019.\n\nEditor's note: This article has been updated to correct Franklin Templeton's assets under management and reflect that the firm has had its fund on the Stellar network since 2019.\n\n"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9kZWNlbnRyYWxpemVkLWV4Y2hhbmdlLXZlcnRleC1sYXVuY2hlcy1ldGhlcmV1bS0xMjQ1MDc0NDcuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Apr 2023 07:00:00 GMT",
        "title": "Decentralized Exchange Vertex Launches on Ethereum Layer 2 Arbitrum - Yahoo Finance",
        "content": "Join the most important conversation in crypto and web3! Secure your seat today\n\nVertex, a decentralized exchange for the spot and derivatives trading of digital assets, has gone live on Arbitrum (ARB), a popular network built atop the Ethereum blockchain.\n\nVertex, which had been operating on a test network, combines an off-chain order book layered on top of an on-chain automated market maker on a decentralized, self-custodial exchange. The firm, which has bases in Singapore and the Cayman Islands, counts Jane Street, Dexterity Capital, Hudson River Trading, GSR, Collab+Currency, JST Capital, Big Brain and Lunatic Capital among its early backers.\n\nThe messy collapse of FTX and other centralized trading platform blowups last year has fueled a shift toward decentralized exchanges and self-custody. Ethereum layer 2 system Arbitrum is now the fastest-growing blockchain in total value locked and has surpassed Ethereum in daily transaction volume.\n\nThe Vertex team has been working on the protocol for about a year. Co-founder Darius Tabatabai said the platform has drawn interest from institutional traders and from retail traders who use Arbitrum.\n\n“We built all the smart contracting ourselves, so we’re not forking anything,” Tabatabai said in an interview with CoinDesk. “The [automated market maker] is quite conventional, but we have a bunch of tech under the surface that enables you to do leveraged AMMs, to do looping, and we have an inbuilt money market. So you can think of it as a combination of Aave, dYdX and Uniswap, with an order book.”\n\nBuilding Vertex on Arbitrum and using an off-chain sequencer for the order book has enabled the venue to process between 10,000 and 15,000 transactions per second with the ability to match buy and sell orders in 10 to 30 milliseconds, a speed that rivals leading centralized venues and surpasses that on other decentralized exchanges, Tabatabai added.\n\n\n\n\n\n\n\n"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ldGhlcmV1bXMtcG9zdC1tZXJnZS1lbmVyZ3ktdXNhZ2UtMDkzMDAwODM0Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Apr 2023 07:00:00 GMT",
        "title": "Ethereum's post-Merge energy usage shows how blockchain tech can align with national sustainability goals - Yahoo Finance",
        "content": "The Ethereum blockchain's energy usage initially plummeted more than 99 per cent last year after a change to its architecture, a new report confirms, showing how a new token minting and validation process better aligns with sustainability goals two years after China's crackdown on crypto mining.\n\nFollowing a change from proof-of-work (PoW) to proof-of-stake (PoS) for creating new ether last September, power demand on the network cratered to 235 kilowatts from 2.44 gigawatts, according to the latest Cambridge Blockchain Network Sustainability Index released on Wednesday. Amid rising usage of the network, energy consumption reached 420,000 kilowatt hours in March, the index shows.\n\nIn its report on the index, the Cambridge Centre for Alternative Finance (CCAF) also notes that ether mining appeared to be of much less interest in China than bitcoin prior to the change. During Beijing's crackdown on mining activity in May 2021, the bitcoin network's hash rate, the measure of the network's computational power, was \"far more severely\" affected than Ethereum's, with each falling 71.1 per cent and 25.5 per cent, respectively.\n\nDo you have questions about the biggest topics and trends from around the world? Get the answers with SCMP Knowledge, our new platform of curated content with explainers, FAQs, analyses and infographics brought to you by our award-winning team.\n\nMonthly proof-of-stake energy usage for Ethereum leading up and following the merge. This chart shows consumption on the Beacon Chain, a proof-of-stake blockchain that merged with the main Ethereum chain in September 2022. Chart: SCMP alt=Monthly proof-of-stake energy usage for Ethereum leading up and following the merge. This chart shows consumption on the Beacon Chain, a proof-of-stake blockchain that merged with the main Ethereum chain in September 2022. Chart: SCMP>\n\nChina was once the world's largest cryptocurrency mining hub owing to its relatively cheap electricity, despite the digital assets being banned in the mainland. The crackdown two years ago briefly pushed measurable bitcoin mining activity in the country to near zero, although later data suggested much of that activity had largely moved underground.\n\nStory continues\n\nThe success of Ethereum's change in reducing energy usage shows how PoS blockchains can better align with green energy goals, which China has championed with a promise to reach peak carbon emissions by 2030 and carbon neutrality by 2060.\n\nConcerns about the energy usage of cryptocurrency mining were widely seen as a potential factor in Beijing's crackdown.\n\nPoW blockchains like bitcoin's are so energy intensive because the process requires hashing, or solving increasingly complex math problems, to add new tokens to the network and verify transactions. With PoS, users \"stake\" their own tokens, or put up a specified amount as collateral, to verify transactions.\n\nEther's switch to PoS was teased for years before the stakeholders pushing the change were able to make it stick. The network went through multiple technical changes before the so-called Merge last year, according to the report.\n\nBitcoin's monthly energy consumption has remained consistently high. Chart: SCMP alt=Bitcoin's monthly energy consumption has remained consistently high. Chart: SCMP>\n\nUntil the Merge, Ethereum's entire electricity consumption of 58.3 terawatt hours was more than Switzerland's average annual energy usage of 54.9 terawatt hours, according to the CCAF.\n\nEther is now estimated to consume 6.56 gigawatt hours of electricity annually, comparable to that of iconic structures such as the Eiffel Tower or the British Museum, the CCAF said.\n\nWhile the energy usage of Ethereum has climbed over the past several months, the CCAF said that is to be expected as more nodes and validators are added to the network. It is also still a far cry from what it used to consume and what the bitcoin network still consumes, which was 10.3 terawatt hours last month alone, more than 1,500 times Ethereum's annual consumption.\n\nThe bitcoin network's annual energy usage of 132.2 terawatt hours could power the entire country of Norway, according to the Cambridge Bitcoin Electricity Consumption Index.\n\nAmid a bitcoin price rally of about 75 per cent this year, the energy-intensive token remains the gold standard in cryptocurrency. However, governments are increasingly trying to balance innovation and sustainability goals regarding digital assets.\n\nBeijing has embraced blockchain technology and is promoting its development in the mainland. But with cryptocurrency illegal there, many projects focus on other uses of distributed ledger technologies.\n\nMeanwhile, Hong Kong's bid to become a regional virtual asset hub has received a nod of approval from mainland officials. A new licensing scheme in the city that goes into effect in June officially sanctions retail investor participation in the market for the first time.\n\nHong Kong's pro-digital asset stance has led some in the industry to speculate that it could be used as an experimental zone for crypto development in China. Some exchanges with ties to the mainland that fled during earlier crackdowns are looking to get licensed in Hong Kong.\n\nHowever, Hong Kong will also have to balance its Web3 initiatives with its own sustainability goals. The city has pledged to become carbon neutral by 2050, and it aims to become a green technology and finance centre with new initiatives set forth in this year's budget.\n\nThis article originally appeared in the South China Morning Post (SCMP), the most authoritative voice reporting on China and Asia for more than a century. For more SCMP stories, please explore the SCMP app or visit the SCMP's Facebook and Twitter pages. Copyright © 2023 South China Morning Post Publishers Ltd. All rights reserved.\n\nCopyright (c) 2023. South China Morning Post Publishers Ltd. All rights reserved."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ldGhlcmV1bXMtcG9zdC1tZXJnZS1lbmVyZ3ktdXNhZ2UtMDkzMDAwODM0Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Apr 2023 07:00:00 GMT",
        "title": "Ethereum's post-Merge energy usage shows how blockchain tech can align with national sustainability goals - Yahoo Finance",
        "content": "The Ethereum blockchain's energy usage initially plummeted more than 99 per cent last year after a change to its architecture, a new report confirms, showing how a new token minting and validation process better aligns with sustainability goals two years after China's crackdown on crypto mining.\n\nFollowing a change from proof-of-work (PoW) to proof-of-stake (PoS) for creating new ether last September, power demand on the network cratered to 235 kilowatts from 2.44 gigawatts, according to the latest Cambridge Blockchain Network Sustainability Index released on Wednesday. Amid rising usage of the network, energy consumption reached 420,000 kilowatt hours in March, the index shows.\n\nIn its report on the index, the Cambridge Centre for Alternative Finance (CCAF) also notes that ether mining appeared to be of much less interest in China than bitcoin prior to the change. During Beijing's crackdown on mining activity in May 2021, the bitcoin network's hash rate, the measure of the network's computational power, was \"far more severely\" affected than Ethereum's, with each falling 71.1 per cent and 25.5 per cent, respectively.\n\nDo you have questions about the biggest topics and trends from around the world? Get the answers with SCMP Knowledge, our new platform of curated content with explainers, FAQs, analyses and infographics brought to you by our award-winning team.\n\nMonthly proof-of-stake energy usage for Ethereum leading up and following the merge. This chart shows consumption on the Beacon Chain, a proof-of-stake blockchain that merged with the main Ethereum chain in September 2022. Chart: SCMP alt=Monthly proof-of-stake energy usage for Ethereum leading up and following the merge. This chart shows consumption on the Beacon Chain, a proof-of-stake blockchain that merged with the main Ethereum chain in September 2022. Chart: SCMP>\n\nChina was once the world's largest cryptocurrency mining hub owing to its relatively cheap electricity, despite the digital assets being banned in the mainland. The crackdown two years ago briefly pushed measurable bitcoin mining activity in the country to near zero, although later data suggested much of that activity had largely moved underground.\n\nStory continues\n\nThe success of Ethereum's change in reducing energy usage shows how PoS blockchains can better align with green energy goals, which China has championed with a promise to reach peak carbon emissions by 2030 and carbon neutrality by 2060.\n\nConcerns about the energy usage of cryptocurrency mining were widely seen as a potential factor in Beijing's crackdown.\n\nPoW blockchains like bitcoin's are so energy intensive because the process requires hashing, or solving increasingly complex math problems, to add new tokens to the network and verify transactions. With PoS, users \"stake\" their own tokens, or put up a specified amount as collateral, to verify transactions.\n\nEther's switch to PoS was teased for years before the stakeholders pushing the change were able to make it stick. The network went through multiple technical changes before the so-called Merge last year, according to the report.\n\nBitcoin's monthly energy consumption has remained consistently high. Chart: SCMP alt=Bitcoin's monthly energy consumption has remained consistently high. Chart: SCMP>\n\nUntil the Merge, Ethereum's entire electricity consumption of 58.3 terawatt hours was more than Switzerland's average annual energy usage of 54.9 terawatt hours, according to the CCAF.\n\nEther is now estimated to consume 6.56 gigawatt hours of electricity annually, comparable to that of iconic structures such as the Eiffel Tower or the British Museum, the CCAF said.\n\nWhile the energy usage of Ethereum has climbed over the past several months, the CCAF said that is to be expected as more nodes and validators are added to the network. It is also still a far cry from what it used to consume and what the bitcoin network still consumes, which was 10.3 terawatt hours last month alone, more than 1,500 times Ethereum's annual consumption.\n\nThe bitcoin network's annual energy usage of 132.2 terawatt hours could power the entire country of Norway, according to the Cambridge Bitcoin Electricity Consumption Index.\n\nAmid a bitcoin price rally of about 75 per cent this year, the energy-intensive token remains the gold standard in cryptocurrency. However, governments are increasingly trying to balance innovation and sustainability goals regarding digital assets.\n\nBeijing has embraced blockchain technology and is promoting its development in the mainland. But with cryptocurrency illegal there, many projects focus on other uses of distributed ledger technologies.\n\nMeanwhile, Hong Kong's bid to become a regional virtual asset hub has received a nod of approval from mainland officials. A new licensing scheme in the city that goes into effect in June officially sanctions retail investor participation in the market for the first time.\n\nHong Kong's pro-digital asset stance has led some in the industry to speculate that it could be used as an experimental zone for crypto development in China. Some exchanges with ties to the mainland that fled during earlier crackdowns are looking to get licensed in Hong Kong.\n\nHowever, Hong Kong will also have to balance its Web3 initiatives with its own sustainability goals. The city has pledged to become carbon neutral by 2050, and it aims to become a green technology and finance centre with new initiatives set forth in this year's budget.\n\nThis article originally appeared in the South China Morning Post (SCMP), the most authoritative voice reporting on China and Asia for more than a century. For more SCMP stories, please explore the SCMP app or visit the SCMP's Facebook and Twitter pages. Copyright © 2023 South China Morning Post Publishers Ltd. All rights reserved.\n\nCopyright (c) 2023. South China Morning Post Publishers Ltd. All rights reserved."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9mcmFua2xpbi10ZW1wbGV0b24tbW9uZXktbWFya2V0LWZ1bmQtMTgwMDAwMzcxLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Apr 2023 07:00:00 GMT",
        "title": "Franklin Templeton Money Market Fund Launches on Polygon Blockchain - Yahoo Finance",
        "content": "Franklin OnChain U.S. Government Money Fund, the first U.S.-registered mutual fund run on blockchain, is now supported on Ethereum via Polygon\n\nSAN MATEO, Calif., April 26, 2023--(BUSINESS WIRE)--Franklin Templeton today announces that the Franklin OnChain U.S. Government Money Fund (FOBXX) (the \"Fund\"), the first U.S.-registered mutual fund to use a public blockchain to process transactions and record share ownership, is now supported on the Polygon blockchain.\n\nFranklin Templeton continues to see operational efficiencies through use of a blockchain-integrated system, including increased security, faster transaction processing and reduced costs, benefiting Fund shareholders. The Fund’s transfer agent maintains the official record of share ownership via a proprietary blockchain-integrated system that utilizes blockchain technology for transaction activity.\n\n\"Extending the reach of the Franklin OnChain U.S. Government Money Fund to Polygon enables the Fund to be further compatible with the rest of the digital ecosystem, specifically through an Ethereum-based blockchain. This furthers our distribution reach through a Layer 2 (L2) blockchain that has a proven track record,\" said Roger Bayston, Head of Digital Assets at Franklin Templeton.\n\nTapping into the scope and breadth of the Ethereum ecosystem opens up a world of possibilities for investors. The Fund offers a competitive yield and is a regulated 1940 Act fund that invests at least 99.5 percent of its total assets in government securities, cash and repurchase agreements collateralized fully by government securities or cash. The Fund’s investment goal is to provide investors with as high a level of current income as is consistent with the preservation of shareholders’ capital and liquidity and aims to maintain a stable $1.00 share price.\n\nOne share of the Franklin OnChain U.S. Government Money Fund is represented by one BENJI token. Token holders can gain exposure to the Fund in digital wallets through the Benji Investments app, available in mobile app stores.\n\nStory continues\n\n\"It’s amazing to have a legacy institution like Franklin Templeton bringing transparency, interoperability, and secure, democratized access to their financial instruments, all things afforded with Polygon,\" said Colin Butler, Global Head of Institutional Capital at Polygon Labs. \"When we take a step back and look at these things less as blockchain products and more as benefits created by utilizing blockchain rails, we start to see the ‘why.’ Tokenized assets are going to positively rewire the global financial system, and Franklin Templeton is at the forefront of this movement.\"\n\n\"The Polygon blockchain ecosystem spans many L2, sidechains, and sovereign blockchains and our suite of Ethereum scalability solutions has seen significant adoption across DeFi, NFTs, and enterprises,\" added Mr. Butler. \"The Polygon blockchain also provides access to a $260 billion market — the approximate aggregate value of all ERC-20 (Ethereum-based) assets.\"\n\nAbout Franklin Templeton\n\nFranklin Resources, Inc. [NYSE:BEN] is a global investment management organization with subsidiaries operating as Franklin Templeton and serving clients in over 155 countries. Franklin Templeton’s mission is to help clients achieve better outcomes through investment management expertise, wealth management and technology solutions. Through its specialist investment managers, the company offers boutique specialization on a global scale, bringing extensive capabilities in equity, fixed income, multi-asset solutions and alternatives. With offices in more than 30 countries and approximately 1,300 investment professionals, the California-based company has 75 years of investment experience and approximately $1.4 trillion in assets under management as of March 31, 2023. For more information, please visit franklintempleton.com and follow us on LinkedIn, Twitter and Facebook.\n\nAbout Polygon Labs:\n\nPolygon Labs develops Ethereum scaling solutions for Polygon protocols. Polygon Labs engages with other ecosystem developers to help make available scalable, affordable, secure and sustainable blockchain infrastructure for Web3. Polygon Labs has initially developed a growing suite of protocols for developers to gain easy access to major scaling solutions, including layer 2s (zero-knowledge rollups and optimistic rollups), sidechains, hybrid chains, app-specific chains, enterprise chains, and data availability protocols. Scaling solutions that Polygon Labs initially developed have seen widespread adoption with tens of thousands of decentralized apps, unique addresses exceeding unique addresses exceeding 211 million, over 1.12 million smart contracts created and 2.36 billion total transactions processed since inception. The existing Polygon network is home for some of the biggest Web3 projects, such as Aave, Uniswap, and OpenSea, and well-known enterprises, including Robinhood, Stripe and Adobe. Polygon Labs is carbon neutral with the goal of leading Web3 in becoming carbon negative. If you're an Ethereum Developer, you're already a Polygon developer! Leverage Polygon’s fast and secure txns for dApps you develop, get started here.\n\nYou could lose money by investing in the Fund. Although the Fund seeks to preserve the value of your investment at $1.00 per share, it cannot guarantee it will do so. An investment in the Fund is not insured or guaranteed by the Federal Deposit Insurance Corporation or any other government agency. The Fund’s sponsor has no legal obligation to provide financial support to the Fund, and you should not expect that the sponsor will provide financial support to the Fund at any time.\n\nInvestors should carefully consider a fund’s investment goals, risks, charges and expenses before investing. To obtain a summary prospectus and/or prospectus, which contains this and other information, talk to your financial professional, call us at (800) DIAL BEN/342-5236 or visit franklintempleton.com. Please carefully read a prospectus before you invest or send money.\n\nCopyright © 2023. Franklin Distributors, LLC. Member FINRA/SIPC. All rights reserved.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20230426005743/en/\n\nContacts\n\nFranklin Templeton Corporate Communications:\n\nRebecca Radosevich, (212) 632-3207, rebecca.radosevich@franklintempleton.com\n\nKatherine Fox, (646) 818-9010, kfox@prosek.com"
    }
]