[
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9yZXZvbHV0LWxhdW5jaGVzLWNyeXB0by1zdGFraW5nLWV0aGVyZXVtLTExMTcxODM0Ni5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Revolut Launches Crypto Staking for Ethereum, Cardano, Polkadot, and Tezos - Yahoo Finance",
        "content": "Revolut is back with another crypto update.\n\nChallenger bank Revolut announced the launch of its crypto staking service for a variety of proof-of-stake (PoS) tokens: Ethereum (ETH), Cardano (ADA), Polkadot (DOT), and Tezos (XTz).\n\nStaking is the process by which users can deposit PoS-based tokens to a blockchain in order to help secure the network. Staking on Ethereum, for example, requires users to deposit 32 Ethereum to join. There are also alternative services that let users earn rewards for staking less, like Lido Finance and Rocket Pool.\n\nIndex Coop Launches New Staked Ethereum Index for the LSD-Curious\n\nRevout says users can earn up to 11.65% return in crypto rewards on certain tokens, though this varies and is subject to change depending on the token staked.\n\nPokadot, for example, offers the highest available yield, while Cardano offers the lowest at 2.79%. Ethereum and Tezos sit somewhere in the middle at 3.88% and 4.59%, respectively.\n\nThe new service will only be available in the UK and in select EEA markets initially.\n\nRevolut told Decrypt it intends to make more cryptocurrencies available for staking but didn’t say exactly which tokens or what countries are next on the list for expanding the service.\n\nAnnouncing new additions to our crypto family! Meet 10+ new tokens in-app! You can now trade 90+ tokens like UNFI, BOND, MINA & more. Which one have you got your eye on? 👀👇#RevolutCrypto pic.twitter.com/RB5sjqGwSs — Revolut (@RevolutApp) November 21, 2022\n\nRevolut betting on crypto\n\nRevolut is one of Europe's most valuable fintech firms, claiming over 25 million users worldwide, and it was valued at $33 billion in its latest funding round in July 2021.\n\nStory continues\n\nThe London-based company launched its first crypto offering back in December 2017, letting users buy, sell, and trade 25 of the most popular cryptocurrencies.\n\nBesides staking, the firm has also had its eyes on a new token launch, too.\n\nRevolut is also currently “assessing the best time” to launch its native cryptocurrency—known as RevCoin—this year.\n\nA spokesperson for the challenger bank told Decrypt via email that it is currently “scoping the market conditions and assessing the best time to launch RevCoin in the coming months.\""
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9yZXZvbHV0LWxhdW5jaGVzLWNyeXB0by1zdGFraW5nLWV0aGVyZXVtLTExMTcxODM0Ni5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Revolut Launches Crypto Staking for Ethereum, Cardano, Polkadot, and Tezos - Yahoo Finance",
        "content": "Revolut is back with another crypto update.\n\nChallenger bank Revolut announced the launch of its crypto staking service for a variety of proof-of-stake (PoS) tokens: Ethereum (ETH), Cardano (ADA), Polkadot (DOT), and Tezos (XTz).\n\nStaking is the process by which users can deposit PoS-based tokens to a blockchain in order to help secure the network. Staking on Ethereum, for example, requires users to deposit 32 Ethereum to join. There are also alternative services that let users earn rewards for staking less, like Lido Finance and Rocket Pool.\n\nIndex Coop Launches New Staked Ethereum Index for the LSD-Curious\n\nRevout says users can earn up to 11.65% return in crypto rewards on certain tokens, though this varies and is subject to change depending on the token staked.\n\nPokadot, for example, offers the highest available yield, while Cardano offers the lowest at 2.79%. Ethereum and Tezos sit somewhere in the middle at 3.88% and 4.59%, respectively.\n\nThe new service will only be available in the UK and in select EEA markets initially.\n\nRevolut told Decrypt it intends to make more cryptocurrencies available for staking but didn’t say exactly which tokens or what countries are next on the list for expanding the service.\n\nAnnouncing new additions to our crypto family! Meet 10+ new tokens in-app! You can now trade 90+ tokens like UNFI, BOND, MINA & more. Which one have you got your eye on? 👀👇#RevolutCrypto pic.twitter.com/RB5sjqGwSs — Revolut (@RevolutApp) November 21, 2022\n\nRevolut betting on crypto\n\nRevolut is one of Europe's most valuable fintech firms, claiming over 25 million users worldwide, and it was valued at $33 billion in its latest funding round in July 2021.\n\nStory continues\n\nThe London-based company launched its first crypto offering back in December 2017, letting users buy, sell, and trade 25 of the most popular cryptocurrencies.\n\nBesides staking, the firm has also had its eyes on a new token launch, too.\n\nRevolut is also currently “assessing the best time” to launch its native cryptocurrency—known as RevCoin—this year.\n\nA spokesperson for the challenger bank told Decrypt via email that it is currently “scoping the market conditions and assessing the best time to launch RevCoin in the coming months.\""
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9yZXZvbHV0LWxhdW5jaGVzLWNyeXB0by1zdGFraW5nLWV0aGVyZXVtLTExMTcxODM0Ni5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Revolut Launches Crypto Staking for Ethereum, Cardano, Polkadot, and Tezos - Yahoo Finance",
        "content": "Revolut is back with another crypto update.\n\nChallenger bank Revolut announced the launch of its crypto staking service for a variety of proof-of-stake (PoS) tokens: Ethereum (ETH), Cardano (ADA), Polkadot (DOT), and Tezos (XTz).\n\nStaking is the process by which users can deposit PoS-based tokens to a blockchain in order to help secure the network. Staking on Ethereum, for example, requires users to deposit 32 Ethereum to join. There are also alternative services that let users earn rewards for staking less, like Lido Finance and Rocket Pool.\n\nIndex Coop Launches New Staked Ethereum Index for the LSD-Curious\n\nRevout says users can earn up to 11.65% return in crypto rewards on certain tokens, though this varies and is subject to change depending on the token staked.\n\nPokadot, for example, offers the highest available yield, while Cardano offers the lowest at 2.79%. Ethereum and Tezos sit somewhere in the middle at 3.88% and 4.59%, respectively.\n\nThe new service will only be available in the UK and in select EEA markets initially.\n\nRevolut told Decrypt it intends to make more cryptocurrencies available for staking but didn’t say exactly which tokens or what countries are next on the list for expanding the service.\n\nAnnouncing new additions to our crypto family! Meet 10+ new tokens in-app! You can now trade 90+ tokens like UNFI, BOND, MINA & more. Which one have you got your eye on? 👀👇#RevolutCrypto pic.twitter.com/RB5sjqGwSs — Revolut (@RevolutApp) November 21, 2022\n\nRevolut betting on crypto\n\nRevolut is one of Europe's most valuable fintech firms, claiming over 25 million users worldwide, and it was valued at $33 billion in its latest funding round in July 2021.\n\nStory continues\n\nThe London-based company launched its first crypto offering back in December 2017, letting users buy, sell, and trade 25 of the most popular cryptocurrencies.\n\nBesides staking, the firm has also had its eyes on a new token launch, too.\n\nRevolut is also currently “assessing the best time” to launch its native cryptocurrency—known as RevCoin—this year.\n\nA spokesperson for the challenger bank told Decrypt via email that it is currently “scoping the market conditions and assessing the best time to launch RevCoin in the coming months.\""
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzAyLzA4L3RvcC10cmFkZXItaXNzdWVzLWV0aGVyZXVtLWFsZXJ0LXdhcm5zLW9mLXBvdGVudGlhbC1ldGgtZmx1c2gtYW1pZC1zaWducy1vZi13ZWFrbmVzcy_SAXpodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMi8wOC90b3AtdHJhZGVyLWlzc3Vlcy1ldGhlcmV1bS1hbGVydC13YXJucy1vZi1wb3RlbnRpYWwtZXRoLWZsdXNoLWFtaWQtc2lnbnMtb2Ytd2Vha25lc3MvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Top Trader Issues Ethereum Alert, Warns of Potential ETH Flush Amid Signs of Weakness - The Daily Hodl",
        "content": "A closely followed crypto strategist is issuing an alert to Ethereum (ETH) holders that they should be on the lookout for a possible corrective move.\n\nPseudonymous analyst Cred tells his 47,200 YouTube subscribers that Ethereum is currently struggling to take out a key resistance level on the monthly timeframe.\n\nAccording to the crypto strategist, Ethereum’s current market structure makes it at risk for a quick pullback.\n\n“If there’s a flush lower, I would look out for this triple higher low structure that makes it susceptible to some sort of poke or prod. I don’t like these very nicely stacked trendline-esque higher lows. So if there’s going to be any visible rejection from this monthly level [$1,678], I wouldn’t be terribly shocked if we saw some trading through those lows [below $1,600], especially given this pre-breakout consolidation has rather been messy.”\n\nAt time of writing, Ethereum is worth $1,673, still below Cred’s monthly resistance area.\n\nAs for Bitcoin (BTC), Cred explains why he believes the king crypto’s rally has stalled.\n\n“You can see on the daily timeframe that momentum has changed to a decent extent. Here [$18,000 to $21,000] you had impulse, very short consolidation, another strong impulse. Here [$23,000] you just had consolidation, attempt to break out, but you did not get continuation.\n\nAnd that’s because here [$21,000], we just reclaimed the big level [$18,000], and we’re in the middle of nowhere. Whereas where we are now, we are into a big level so you can’t expect the same type of price action necessarily.”\n\nAt time of writing, Bitcoin is worth $23,304.\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney\n\nFeatured Image: Shutterstock/Spyro the Dragon"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiM2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS93aGF0LWlzLW9wdGltaXNtLW9wLWd1aWRlL9IBN2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS93aGF0LWlzLW9wdGltaXNtLW9wLWd1aWRlLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "What is Optimism (OP): Guide to One of Ethereum’s Layer-Two Scaling Solutions - CryptoPotato",
        "content": "The cryptocurrency industry, in general, became a lot more popular in the past couple of years. This saw the development and launch of hundreds, if not thousands, of decentralized applications (dApps) in various fields, such as DeFi, gaming, learning, trading, investing, and whatnot.\n\nThere are many reasons for this, including but not limited to the massive bull run in 2021, the rise of non-fungible tokens, the popularity of memecoins, and more. This saw hundreds of thousands of users flocking to whatever the next trend may be.\n\nUnlike previous cycles, however, this time, we also saw regular users take advantage of on-chain availabilities and interact with various dApps such as Uniswap, OpenSea, and so forth. And while this had a massively beneficial effect on the industry’s growth and valuation, it also highlighted some very critical issues.\n\nBlockchains like Ethereum – where the lion’s share of dApp activity takes place – struggled in terms of affordability, scalability, and even accessibility. Layer one alternatives like Solana also proved to be insufficiently effective in handling the massive load of user requests.\n\nThis brought up a topic that’s been largely discussed in the cryptocurrency community for years – scalability. Now that scaling solutions became essentially imperative for the future growth of the industry, projects like Optimism saw the light of day.\n\nBeing one of the most popular Ethereum scaling solutions, Optimism aims to solve some of the underlying issues with the network with a particular focus on scaling.\n\nQuick Facts About Optimism\n\nOptimism’s mainnet went live on December 2021\n\nOptimism launched its native token (OP) on May 31st, 2022.\n\nA total of 231,000 addresses were eligible to claim 214 million OP tokens.\n\nQuick Navigation\n\nWhat is Optimism?\n\nOptimism is an Ethereum scaling solution. In essence, its purpose is to help the main network run smoothly by taking some of its transactional load. In technical terms, Optimism is an “Optimistic rollup,” and it’s important to understand what rollups do before diving deeper.\n\nWhat is a Rollup?\n\nRollups are one of the multiple scaling solutions intended to help Ethereum achieve a higher transaction throughput.\n\nThe Ethereum Foundation explains that they “perform transaction execution outside layer 1, and then the data is posted to layer 1 where consensus is reached.”\n\nThe main benefit of this is that it reduces the load on the main network while also guaranteeing the broadcasted information by its native security.\n\nThere are two main types of rollups, mainly differentiated by their security models:\n\nZero-Knowledge (ZK) Rollups – these run the computation off-chain and then submit proof of validity to the chain.\n\n– these run the computation off-chain and then submit proof of validity to the chain. Optimistic rollups – these assume that transactions are valid by default and only run computation through fraud-proof if there’s a challenge.\n\nOptimism falls within the second category, and, as you may have probably guessed already, its parent chain is Ethereum.\n\nHow Does Optimism Work?\n\nThe big idea that makes Optimism interesting to most is the Optimistic Rollup. The following is a brief explanation of the fundamental principles of the concept.\n\nHowever, the TLDR of it is that an Optimistic Rollup is another way of calling a blockchain that’s designed to take advantage of the security of another network that acts as a parent one.\n\nBlock Storage\n\nAll of the blocks on Optimism are stored within a specific smart contract that’s built on Ethereum and is called CannonicalTransactionChain – CTC to make it easier. They are helped within a list that’s inside of the CTC, and it’s append-only.\n\nThe CTC contains code that guarantees that the current list of blocks can’t be altered by newer transactions on Ethereum. This guarantee can be broken if the Ethereum network itself goes through a reorganization (reorg) and the order is changed.\n\nBlock Production\n\nThe ‘sequencer’ is the single party that manages block production on Optimism. It helps with the network by delivering the following:\n\nInstant transaction confirmations and state updates;\n\nConstructing and executing layer-two blocks;\n\nSubmitting user transactions to layer one.\n\nIt has no mempool, which means that the transactions are accepted (or rejected) immediately. This happens in the order they are received. When someone sends a transaction, the sequencer will check if it’s valid (pays a sufficient fee) and apply it to the local state as a block that’s pending. These pending blocks are then batched and periodically submitted to Ethereum’s network for finalization.\n\nThe main goal of this batching is to reduce the overall transaction fees by spreading certain fixed costs over all of the transactions within a single batch. Of course, this fee may vary depending on the network load at the time when the transactions were sent to the sequencer.\n\nBlock Execution\n\nIt’s important to understand that Ethereum nodes download blocks from Ethereum’s network that’s peer-to-peer. Optimism nodes, on the other hand, download blocks directly from the CTC append-only contract.\n\nThere are two primary components that make Optimism nodes. These are the Ethereum Data Indexer and the Optimism Client Software.\n\nEthereum Data Indexer\n\nIt’s designed to reconstruct the optimism blockchain from blocks that are published to the CTC contract. It’s also called the data transport layer.\n\nOptimism Client Software\n\nThis one closely resembles Geth, which means that Optimism, overall, is very close in its design to Ethereum. This is also because Optimism shares the same Ethereum Virtual Machine (EVM), as well as the same account and state structure and the metering mechanism for gas, and the fee schedule.\n\nFault Proofs\n\nUsing an Optimistic Rollup means that the state commitments are published to Ethereum’s network in a way that’s direct without requesting any proof of the validity of these commitments. Fault proofs are requested when a state commitment is challenged. If it’s challenged successfully, it would be then removed and eventually replaced by another one.\n\nThis document provides a more in-depth and technical explanation of the terms and overall process described above.\n\nHow to Bridge Assets Between Layers\n\nWith layer-two scaling solutions such as Optimism, being able to swap assets between different layers is obviously of paramount importance.\n\nThere are multiple ways you can go about it. First and foremost, you can hop on the official website and use the bridge provided there. This would only require you to have a Web3 wallet such as MetaMask.\n\nFrom there, you have to select the network that you want to bridge tokens from. This is the supported list:\n\nThere are also options to bridge from centralized exchanges, but it’s critical to note that these happen through providers that Optimism has simply linked to – meaning there’s no endorsement, and you should proceed with caution and after making thorough due diligence.\n\nFrom there, the process is particularly simple, as all you need to do is confirm the amount and sign the transaction in your wallet.\n\nTo bridge assets from Optimism, there are a couple of options. You can use a third-party bridge or use the official bridge instead. The following is an example of the latter, but keep in mind that bridging from Optimism to Ethereum takes seven days.\n\nAll you need to do is click the arrow in between the value boxes, and this will switch the above transaction. If you haven’t added Optimism to MetaMask, this will also handle it for you. From there, you only have to confirm the amount and sign the transaction:\n\nGovernance: Optimism’s Model\n\nThe native cryptocurrency of the Optimism ecosystem is the OP token.\n\nOptimism is governed by the so-called Optimism Collective. According to the official website, the collective is:\n\n“… a band of companies, communities, and citizens working together to reward public goods and build a sustainable future for Ethereum.”\n\nThat said, the governance of the Optimism Collective itself will consist of two separate houses: The Token House and the Citizens’ House. Let’s break it down.\n\nThe Token House\n\nThe launch of the OP token and the Token House set forth the beginning of the governance of Optimism. OP itself was distributed to hundreds of thousands of addresses, who engaged in community-oriented behavior through the first airdrop (more on that later.)\n\nIn any case, members of the Token House are responsible for deliberating, submitting, and voting on various proposals. To do so, OP holders can either vote directly o choose to delegate their voting power to a third party.\n\nIn essence, the Token House votes on proposals of the following types:\n\nProtocol u grades\n\nInflation adjustment\n\nTreasury appropriations\n\nRights protection\n\nGovernance fund grants\n\nThe Citizens’ House\n\nAt its core, the Citizens’ house is an experimental attempt at a non-plutocratic governance model. It is responsible for retroactive public goods funding.\n\nThe above brings us to our next point, which is the OP token.\n\nIntroducing the OP Token\n\nThe OP token was launched through an airdrop which distributed a total of 5% of the total supply.\n\nThat said, qualifying users included:\n\nDAO voters\n\nMulti-Sig signers\n\nRepeat Optimism users\n\nGitrcoin donors\n\nIf you suspect you are eligible, you can check out any associated wallets on the official claim page.\n\nMany wonder if there will be a new airdrop, and the short answer is – yes. The team has made it clear that it plans to allocate a total of 19% of the supply for this purpose. Here’s what the overall tokenomics of OP look like:\n\nFor a more complete look at the economics behind the Optimism ecosystem, please make sure to visit the official website.\n\nConclusion\n\nOptimism has quickly become one of the most popular Ethereum scaling solutions. Most recently, the Optimism Foundation released a proposal to upgrade the Optimism mainnet to Bedrock, which is a new generation of decentralized Rollup architecture developed by Optimism Labs. Speaking on the matter, the team said:\n\n“We are confident that the post-Bedrock experience will be a positive change for developers in the Optimism ecosystem and have received consistent excitement for the upgrade from our partners. We are committed to making this upgrade a success and are eager to see the results in the months and years to come.”\n\nIt’s also very interesting to monitor how the different layer-twos fare in the coming years as the battle between optimistic rollups and ZK-rollups continues."
    }
]