[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDMvMDEvdXBjb21pbmctdXBncmFkZXMtdGhhdC13aWxsLXNoYXBlLXRoZS1ldGhlcmV1bS1lY29zeXN0ZW0v0gFmaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wMy8wMS91cGNvbWluZy11cGdyYWRlcy10aGF0LXdpbGwtc2hhcGUtdGhlLWV0aGVyZXVtLWVjb3N5c3RlbS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Mar 2023 08:00:00 GMT",
        "title": "Upcoming Upgrades That Will Shape the Ethereum Ecosystem - CoinDesk",
        "content": "Matter Labs recently announced that it would rebrand and make open source its ZK rollup, zkSync 2.0, to zkSync Era, though it did not say when the full network would go live. Developers of Scroll, another layer 2 on Ethereum, have also said they are coming out with their own ZK rollup. Earlier this week, Scroll announced it is taking the zkEVM to Ethereum’s Goerli testnet."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vcHJvZmVzc2lvbmFsL2Jsb2cvZXRoZXJldW1zLW1vYXQtcmVpbmZvcmNlZC1pbi1iZWFyLW1hcmtldC1zb2xhbmEtaGFzLXZhbHVlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Mar 2023 08:00:00 GMT",
        "title": "Ethereum's moat reinforced in bear market; Solana has value | Insights - Bloomberg",
        "content": "This analysis is by Bloomberg Intelligence Senior Market Structure Analyst Jamie Douglas Coutts. It appeared first on the Bloomberg Terminal.\n\nLayer-1 (L1) chains that have bounced hard this year from technically deep oversold levels will need adoption metrics to reverse and sustain further price appreciation. Active addresses remain a statistically valuable fundamental metric for most L1s, highlighting relative value in the space.\n\nLayer-1 sector’s strong start to year\n\nThe L1 sector has experienced a scorching run after heading into December 2022 down by more than 90% on average. But price momentum will need to be matched with strengthening fundamentals in what is likely to be a volatile year for risk assets. As we expand coverage to L1 assets, markers for adoption and protocol monetary policy will be paramount. For this note we analyze a subset of the L1 sector — Solana, Avalanche, Binance Smart Chain or BNB, and Ethereum."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vcHJvZmVzc2lvbmFsL2Jsb2cvZXRoZXJldW1zLW1vYXQtcmVpbmZvcmNlZC1pbi1iZWFyLW1hcmtldC1zb2xhbmEtaGFzLXZhbHVlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Mar 2023 08:00:00 GMT",
        "title": "Ethereum's moat reinforced in bear market; Solana has value | Insights - Bloomberg",
        "content": "This analysis is by Bloomberg Intelligence Senior Market Structure Analyst Jamie Douglas Coutts. It appeared first on the Bloomberg Terminal.\n\nLayer-1 (L1) chains that have bounced hard this year from technically deep oversold levels will need adoption metrics to reverse and sustain further price appreciation. Active addresses remain a statistically valuable fundamental metric for most L1s, highlighting relative value in the space.\n\nLayer-1 sector’s strong start to year\n\nThe L1 sector has experienced a scorching run after heading into December 2022 down by more than 90% on average. But price momentum will need to be matched with strengthening fundamentals in what is likely to be a volatile year for risk assets. As we expand coverage to L1 assets, markers for adoption and protocol monetary policy will be paramount. For this note we analyze a subset of the L1 sector — Solana, Avalanche, Binance Smart Chain or BNB, and Ethereum."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V0aGVyZXVtLWVyYzQzMzctYWNjb3VudC1hYnN0cmFjdGlvbi1zbWFydC1jb250cmFjdNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Mar 2023 08:00:00 GMT",
        "title": "Ethereum's ERC-4337 Account Abstraction Smart Contract is Live - Blockworks",
        "content": "An audited version of the Ethereum Foundation’s ERC-4337 account abstraction standard is now available on Ethereum mainnet.\n\nThe standard has been implemented through the smart contract EntryPoint, which has been running for a few weeks already — and is designed to change how users interact with wallet services.\n\nMost of Ethereum’s existing wallets are externally owned accounts (EOA). The list, which makes up a majority of wallets now in the Ethereum ecosystem, includes providers like MetaMask and imToken.\n\nAnd it even extends to hardware wallets such as Ledger Nano, where only one key controls an account — meaning that if its key is compromised or lost, any tokens within the wallet would be, too.\n\nWith account abstraction, the idea would be to make the account flexible to match users needs, according to Yoav Weiss, a security fellow at the Ethereum Foundation.\n\nThe foundation is a nonprofit dedicated to supporting the development of the Ethereum ecosystem, including its native token, ether (ETH).\n\n“For some users, this may simply mean getting the user experience of a bank — where someone can always help recover your bank account even if you lose your password,” Weiss, an author of the ERC-4337 proposal, told Blockworks. “For more sophisticated users, it could mean adding more controls or features to your account.”\n\nAn example? Adding two-factor authentication to spend more than $5,000 dollars, Weiss said. The measure also allows users to use the cryptographic signature of their choosing, and it also authorizes transactions securely through cell phones.\n\nUnlike EOAs, account abstraction enables users to use smart contract wallets with arbitrary verification logic.\n\n“So now, users don’t need to think about writing down 12 words on a piece of paper, but instead, they are able to add and remove devices and include recovery options with a friend or a lawyer,” Weiss said.\n\nImplementing an ERC-4337 standard\n\nAccount abstraction has been in the works for over nine years. It’s been difficult to reach a consensus and change an entire protocol to support it.\n\n“We needed to better understand security and better understand usability, but you can’t [take] action for something that requires a protocol change because there is no input, and that’s where ERC-4337 comes in,” Weiss said.\n\nERC — short for Ethereum request for comment — is an opt-in standard that no one is obligated to use. Instead of changing consensus rules, ERC ensures everyone agrees to a standard before they begin using it on-chain.\n\nOne prevalent example: the ERC-20 token standard. ERC-20 doesn’t alter Ethereum at its protocol level. But, because developers have agreed tokens should follow ERC-20 rules, it has set a standard.\n\n“Having a standard creates an ecosystem,” Weiss said. “And what ERC-4337 does is it will create a standard for account abstraction.”\n\nExisting products such as Gnosis Safe and Argent have already implemented features such as social recovery. But in order to maintain them, they would have to connect to a centralized relayer.\n\nIf a centralized relayer is attacked, users would not be able to access their accounts.\n\nERC-4337 will introduce a new mempool for user operations.\n\nThis mempool is serviced by “bundlers” — similar to validators and miners — but on an accounts function level. So rather than submitting a transaction, a user would submit a user operation to the mempool, and bundlers will take it from the mempool and include it in blocks on Ethereum or any other EVM chain, Weiss said.\n\nOne of the first protocols to comply with the ERC-4337 standard for bundlers is Stackup.\n\n“We have a test for bundlers to make sure they are ready, and stackup was one of the first ones to be ready,” Weiss said.\n\nThe company will allow developers to build customized Web3 transaction flows and wallets using the latest ERC-4337 smart contract.\n\n“Developers won’t need to think about how each blockchain works, the wallet only needs to support ERC-4337, and it can be deployed and used on any EVM chain,” Weiss said.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMisQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9leHBlcnQtdmlldy9jcnlwdG8td2ludGVyLWZhci1mcm9tLW92ZXItc2hvdWxkLW9uY2UtYWdhaW4tYmUtdGVzdGluZy1sb3dlci1wcmljZXMtaWYtbm90LWxvd2VyLWJvdHRvbXMtYWplZXQta2h1cmFuYS9hcnRpY2xlc2hvdy85ODMyMzg3NS5jbXPSAbUBaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvZXhwZXJ0LXZpZXcvY3J5cHRvLXdpbnRlci1mYXItZnJvbS1vdmVyLXNob3VsZC1vbmNlLWFnYWluLWJlLXRlc3RpbmctbG93ZXItcHJpY2VzLWlmLW5vdC1sb3dlci1ib3R0b21zLWFqZWV0LWtodXJhbmEvYW1wX2FydGljbGVzaG93Lzk4MzIzODc1LmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Mar 2023 08:00:00 GMT",
        "title": "Crypto winter far from over, may once again be testing lower prices if not lower bottoms: Ajeet Khurana - The Economic Times",
        "content": "Unlock Leadership Excellence with a Range of CXO Courses Offering College Course Website IIM Lucknow IIML Chief Operations Officer Programme Visit IIM Lucknow IIML Chief Executive Officer Programme Visit IIM Kozhikode IIMK Chief Product Officer Programme Visit\n\n\n\n\n\n\n\n\n\n“According to me, the crypto winter is far from being over. We should once again be testing lower prices if not lower bottoms. We have seen some relief because money came into the market in hopes that there will be no further interest rate hikes. Also, the FTX crisis and before that the Luna crisis has now started getting forgotten and in the absence of any more new fraudulent activity coming up, people are feeling confident again,” says, Founder,Crypto prices are determined by three things -- one, which has nothing to do with crypto which is macroeconomics. US interest rates are 19 times higher than they were one year ago so 0.25 to 4.75, this has been the biggest driver of the crash but this has also been the driver of some relief we saw recently. The other two problems are very crypto centric. One is there are a lot of protocols and tokens that came out in the market and could only survive in the bull market. One by one they are crashing and then, of course, the ever persistent scams and frauds that may come up. This is the buzz in the crypto market.It would require me to have astrological ability to answer that with precision. In the absence of that I will give you my guess with a disclaimer that I am not a financial advisor. According to me, the crypto winter is far from being over. We should once again be testing lower prices if not lower bottoms. We have seen some relief because money came into the market in hopes that there will be no further interest rate hikes. Also, the FTX crisis and before that the Luna crisis has now started getting forgotten and in the absence of any more new fraudulent activity coming up, people are feeling confident again.Unlike the stock market which has such a long track record, in crypto we have had only four bull markets so far. So, we do not have too much of a track record. What we have seen is that in all cases, when the bear market ended, it was preceded by much more than one year of sideways movement of prices.In the previous bear market, the sideways movement was around the $10,000 mark. This time it is around the $20,000 mark. So even if we are looking at new players coming in or we are looking at money coming into the market. There are lots of people just waiting to sell at even slightly improved prices. So, prices going up is very unlikely in the near future or substantially up. There are some reasons why it might go down. I am clenching my teeth and even preparing for Q1 25 kind of revival though I suspect it will happen much earlier, maybe in early 24.One very interesting statistic which your viewers may not know is that only Bitcoin and Ethereum are two tokens which have survived more than one bull market and that is very interesting. That means when the bear market comes, the previous heroes do not remain heroes anymore. This time, barring Luna and FTT, that is a FTX token called FTT, we have not seen the demise of any major tokens and that worries me. Some of them might be coming up especially because crypto projects actually use their own tokens as if it is a currency and when the value of these tokens and currencies go down, their ability to buy and perform operations go down. Currently they are only firing people. We have not seen worse action than that. My worry is if some of that happens, prices could go down further.If you are looking at a global level, roughly 1% of the people who participate in all asset markets, real estate, forex, equity, mutual funds, etc, participate in crypto markets. The fact is that sentiment of this 1% is very different from the sentiment of the remaining 99% who have not yet come in. The remaining 99% still remain sceptical. They are not even sure that Bitcoin would not go down to zero for instance, but that is not the sentiment of people within the crypto markets. They are trying to be selective and look for companies that may have some more survival, some are going for the major tokens which is Bitcoin and Ethereum. The sentiment amongst crypto investors is pretty decent. Non-crypto investors are staying away.I always have buy orders at various prices and based on the percentage, not on amounts. I have bought all the way down to 15,700 on Bitcoin and my highest purchase has been around the 21,500 marks which was on the way down, not on the way up, which is very important. At present, I fear that all my buy orders which are much lower than present prices may not get fulfilled.Yesterday, one of the Emirates in the United Arab Emirates called Ras Al Khaimah actually opened a crypto free zone. In the last one week, Hong Kong has announced favourable crypto regulations. What we are finding is that there are several pockets around the world where more and more favourable regulations are happening. Even in the US, in the state of Wyoming, in the last one year, we have seen some very positive regulation.On the India front, while they may not officially agree to it, I always sense that there is a difference of opinion between the Reserve Bank of India and the Finance Ministry. Even in the G20, the Finance Minister continued her repeated mention that she would work with international collaboration while the Reserve Bank of India governor actually talked about the fact that we should consider a ban. Since the next discussion in G20 is only in October, it is fair to say that we have a little break and a respite of at least the next 10 months before this topic of ban comes up again.Let us consider two scenarios; one, eventually the whole world will ban crypto, in which case India will look like a visionary. I think the world is headed in the opposite direction and that is regulation. If that happens, given India's tech talent, given India's English speaking population and young population, I fear we are going to miss the bus.I fear that like we have done in the internet, e-commerce and social media, where we had to play catch up and by the way, we caught up pretty well, even here we are going to be condemned to do that. So I would require some visionary thinking from the central bank and finance ministry, recognize the direction in which the winds are blowing globally and align India to maximize its benefit from that.Regrettably, yes, and scams arise for three reasons; one is people come up with fraudulent activity as they literally are fly-by-night operators. If regulations come in, that should reduce.The second one is technological failures such as the one we saw in Luna. Now in this situation, we are just too early, pretty much like when debit cards came here. Debit cards had all the time. Despite more debit cards today, we are seeing that less. I think that is the industry that we are going up.The third one is that today the people who are in the crypto industry and I am talking of the likes of exchanges as well as other start-ups, are focused fundamentally on customer acquisition and not customer education. As a result, the customers, even the ones who are making profits are actually doing it by ignorance. When the audience is ignorant, there will be people who will prey upon that ignorance.If you look at India versus the rest of the world, we have a distinction. In India, the conservative financial investor is largely staying away from crypto markets. The people who invest in mutual funds, the people who have been investing in the stock market for decades, most of them have not touched crypto. It is the people who are in the 18-32 age group that accounts for 85% of crypto investors. Now, these people are investing despite hearing once every two or three months from the RBI that there should be a ban. So that means these people are the wild risk takers. So if a policy comes in, we bring in a new breed of larger relatively more conservative investors. At that point of time, we should see a reduction in the sort of speculative activity you see and hence a reduction in scams.There are two different categories although it sounded like one. The ones who have made severe losses are not necessarily the ones who have lost all hope. So here is the thing. Pretty much like any asset class, just because you may have lost 50%, 80% does not mean that you will have to hold it because it has to go up. Though it can go up, that does not mean it will not go down first.Second, those who are considering swapping between one token and another, may have a very interesting strategy. Please move to bigger, larger cap, more established tokens. The really bad tokens that some of us may have purchased hoping to become rich overnight have shown that they have no future. To believe that they will come up is a little far-fetched.Finally, please do as much research as possible before you enter into this. This is definitely a high-risk asset class. I think it is a very promising asset class. This is all that I invest in but still lots of research is required."
    }
]