[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDkvMTQvZXRoZXJldW0tY28tZm91bmRlci1vbi1zZWMtY3J5cHRvLWNyYWNrZG93bi1jbGVhci1oZWFkcy13aWxsLXByZXZhaWwuaHRtbNIBbWh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzA5LzE0L2V0aGVyZXVtLWNvLWZvdW5kZXItb24tc2VjLWNyeXB0by1jcmFja2Rvd24tY2xlYXItaGVhZHMtd2lsbC1wcmV2YWlsLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Sep 2023 07:00:00 GMT",
        "title": "Ethereum co-founder says 'clear heads will prevail' in the SEC's legal battles with crypto firms - CNBC",
        "content": "The co-founder of Ethereum, Joseph Lubin, said \"clear heads will prevail\" as the U.S. Securities and Exchange Commission continues to dispute with crypto firms in court over whether crypto tokens are considered securities.\n\n\"I anticipate that, with previous technologies like the internet, the web and cryptography, clear heads will prevail,\" Lubin told CNBC's \"Capital Connection\" on Thursday.\n\n\"America will see that decentralized protocols, blockchain, cryptocurrency are aligned with the philosophies of the U.S. And I think much of the rest of the world will follow suit,\" said Lubin, who is also the CEO of blockchain technology company ConsenSys.\n\nCrypto firms such as Binance, Coinbase and Ripple are fighting lawsuits with the SEC, which has accused them of law violations.\n\nThe SEC sued Ripple and its co-founders in 2020 of violating securities laws by selling its native cryptocurrency XRP without first registering it with the SEC. Meanwhile, the SEC accused Coinbase of operating an unregistered exchange and broker in June. In the same month, Binance was charged for several securities law violations."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDkvMTQvZXRoZXJldW0tY28tZm91bmRlci1vbi1zZWMtY3J5cHRvLWNyYWNrZG93bi1jbGVhci1oZWFkcy13aWxsLXByZXZhaWwuaHRtbNIBbWh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzA5LzE0L2V0aGVyZXVtLWNvLWZvdW5kZXItb24tc2VjLWNyeXB0by1jcmFja2Rvd24tY2xlYXItaGVhZHMtd2lsbC1wcmV2YWlsLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Sep 2023 07:00:00 GMT",
        "title": "Ethereum co-founder says 'clear heads will prevail' in the SEC's legal battles with crypto firms - CNBC",
        "content": "The co-founder of Ethereum, Joseph Lubin, said \"clear heads will prevail\" as the U.S. Securities and Exchange Commission continues to dispute with crypto firms in court over whether crypto tokens are considered securities.\n\n\"I anticipate that, with previous technologies like the internet, the web and cryptography, clear heads will prevail,\" Lubin told CNBC's \"Capital Connection\" on Thursday.\n\n\"America will see that decentralized protocols, blockchain, cryptocurrency are aligned with the philosophies of the U.S. And I think much of the rest of the world will follow suit,\" said Lubin, who is also the CEO of blockchain technology company ConsenSys.\n\nCrypto firms such as Binance, Coinbase and Ripple are fighting lawsuits with the SEC, which has accused them of law violations.\n\nThe SEC sued Ripple and its co-founders in 2020 of violating securities laws by selling its native cryptocurrency XRP without first registering it with the SEC. Meanwhile, the SEC accused Coinbase of operating an unregistered exchange and broker in June. In the same month, Binance was charged for several securities law violations."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V0aGVyZXVtLWpvZS1sdWJpbi11cy1yZWd1bGF0b3JzLWNyeXB0by1yZWd1bGF0aW9u0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Sep 2023 07:00:00 GMT",
        "title": "Ethereum co-founder says US regulators will ultimately embrace crypto - Blockworks",
        "content": "It’s a matter of time before the US embraces crypto, says Joseph Lubin.\n\nLubin, a co-founder of Ethereum and CEO of Consensys, struck a confident tone during a recent interview that rational decisions will be made amid ongoing disputes between US regulators like the US Securities and Exchange Commission and crypto companies.\n\nSimilar to previous tech advancements like the internet, practical thinking will ultimately guide the regulatory approach to the industry, Lubin said on CNBC’s “Capital Connection” on Thursday.\n\n“America will see that decentralized protocols, blockchain, cryptocurrency are aligned with the philosophies of the US,” he added. “And I think much of the rest of the world will follow suit.”\n\nUS crypto exchanges expect to face increased scrutiny after the SEC filed lawsuits against Coinbase and Binance in June, accusing them of violating securities regulations.\n\nElsewhere, Coinbase has initiated legal action against the SEC, urging the securities regulator to offer clearer regulatory guidelines for the crypto industry. The exchange maintains that the current regulatory framework in the US lacks clarity and practicality.\n\nLubin highlighted in the interview that the US regulatory approach influences many countries worldwide.\n\n“The US has a lot of influence on the world through financial intermediaries and other intermediaries, and decentralized protocol technology is about right sizing and eliminating intermediaries in many ways,” he told CNBC, adding that the country is “all about free markets, capitalism, free speech.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vY3J5cHRvLm5ld3MvZXRoZXJldW0tc2Vlcy1zZWNvbmQtaGlnaGVzdC1vbi1jaGFpbi1hY3Rpdml0eS1pbi1oaXN0b3J5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Sep 2023 07:00:00 GMT",
        "title": "Ethereum sees second-highest on-chain activity in history - crypto.news",
        "content": "The network saw over 1 million unique active wallets accepting or sending ETH, the second-highest amount in the asset’s history.\n\nThe Ethereum (ETH) network registered a spark of activity on Sept. 13, as the number of unique active wallets (UAW) connected to the network hit 1,089,893.\n\nIn an X post, Blockchain analysts at Santiment said this was the second-highest amount of UAW in Ethereum’s 8+ year history, suggesting that such spikes “could be the capitulation signal needed for prices to rebound.”\n\nDaily active addresses interacting with ETH (orange) vs Ethereum price (green) | Source: X\n\nThe last time the Ethereum network witnessed a spike in on-chain activity was on Dec. 9, 2022, when the amount of UAW set an all-time high at 1.42 million, with ETH trading at around $1,265, according to data from Santiment.\n\nDaily active addresses interacting with ETH (black) vs. Ethereum price (green) | Source: Santiment\n\nFTX liquidations as a possible trigger\n\nAlthough the real reason behind the activity remains unclear, the spark came when U.S. Bankruptcy Judge John Dorsey approved FTX’s request to sell up to $100 million weekly to return funds to its creditors.\n\nAs crypto.news reported, the ceiling can be increased to $200 million. However, any adjustments will be evaluated on an individual token basis. Before selling high-profile digital currencies such as Bitcoin (BTC) and Ethereum (ETH), the estate must provide a 10-day advance notice to the US Trustee’s office. FTX is set to sell $3.4 billion worth of crypto in total.\n\nNonetheless, the crypto market seems to rise despite the US Consumer Price Index (CPI) coming higher than expected and FTX’s liquidation approval. According to data provided by CoinGecko, the global crypto market capitalization rose from $1.031 trillion to $1.086 trillion at the time of writing. This indicates a $55 billion hike despite the two bearish events on Sept. 13.\n\nFollow Us on Google News"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1hY3RpdmUtYWRkcmVzc2VzLXNlY29uZC1oaWdoZXN0LWluLWhpc3RvcnktYW5hbHlzdHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Sep 2023 07:00:00 GMT",
        "title": "Ethereum's active addresses second-highest in history: Analysts - Cointelegraph",
        "content": "Through an examination of Ether’s (ETH) on-chain activity, market intelligence platform Santiment has published a report indicating that the count of daily active Ether addresses experienced a notable increase, reaching around 1,089,893 on Sept. 13.\n\nThis recent upsurge represents the second-highest number of daily active addresses ever recorded in Ethereum’s history. The highest count was registered on Dec. 9, 2022, aligning with Ether’s reevaluation following its losses from the post-2021 bear market.\n\nAs a result, analysts at Santiment suggest that the Ether market may experience increased volatility, potentially leading to a recovery. Additionally, this uptick in on-chain activity indicates a growing demand for the underlying asset.\n\nThe #Ethereum network just saw 1,089,893 unique wallets acting as a sender or receiver of $ETH on Wednesday, the 2nd highest amount in the asset's 8+ year history. This historic anomaly could be the capitulation signal needed for prices to rebound. https://t.co/JF0g8vvBWs pic.twitter.com/1dRnPCjxcA — Santiment (@santimentfeed) September 14, 2023\n\nEthereum, whose native crypto, ETH, is the second-largest by market capitalization, is presently encountering immediate market instability after a recent price decline that pushed it below the $1,700 threshold. Nevertheless, Ethereum maintains its position in the decentralized finance ecosystem and smart contract arena, securing around $20 billion in total value locked.\n\nEthereum remains attractive to institutional investors, as seen in the growing interest in spot exchange-traded funds. Additionally, the Ethereum network holds a central role in numerous blockchains due to its Ethereum Virtual Machine network. As a result, Ethereum’s prospects seem largely optimistic, supported by the network’s significant valuation, liquidity and strong trading activity.\n\nWhen it comes to analyzing Ether’s price, it’s worth noting that, despite being a prominent altcoin with unique fundamentals, ETH’s price movement is still considerably impacted by Bitcoin (BTC). Throughout history, September, particularly before a halving event, has been recognized as a bearish period for the cryptocurrency market.\n\nRelated: Nasdaq’s Hashdex mixed Ether ETF filing joins crypto ETF race\n\nThis might suggest that Ether’s price will continue its decline in the upcoming weeks, potentially nearing the next support level at approximately $1,500. In addition, the cryptocurrency is encountering significant selling pressure as both weekly and daily death crosses form between the 50- and 200-day moving averages.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Ethereum is ‘woefully undervalued’ but growing more powerful: DeFi Dad, Hall of Flame"
    }
]