[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY29pbmdhcGUuY29tL2hpc3RvcmljYWwtZGF0YS1zdWdnZXN0ZXRoZXJldW0tZm91bmRhdGlvbi12aXRhbGlrLWJ1dGVyaW4v0gFUaHR0cHM6Ly9jb2luZ2FwZS5jb20vaGlzdG9yaWNhbC1kYXRhLXN1Z2dlc3RldGhlcmV1bS1mb3VuZGF0aW9uLXZpdGFsaWstYnV0ZXJpbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 May 2023 07:00:00 GMT",
        "title": "Ethereum Foundation, Vitalik Buterin Dumps 15K ETH; Will History Repeat? - CoinGape",
        "content": "After Ethereum creator Vitalik Buterin dumped 200 ETH on Friday, Ethereum Foundation followed suit and dumped 15,000 ETH to a crypto exchange.\n\nTypically, Ethereum Foundation sells small amounts of ETH to manage operations and Vitalik Buterin usually dumps meme coins he received in his wallet for ETH. But this time it’s different.\n\nadvertisement\n\nEthereum Foundation and Vitalik Buterin Transfers Over 15K ETH\n\nOn Friday, Vitalik Buterin related address vitalik.eth transferred 200 ETH to crypto exchange Kraken as per PeckShieldAlert. As per Etherscan data, this is not the first time the address transferred ETH to the same Kraken wallet. There are 5 similar transactions to Kraken in the last 2 months.\n\nEthereum Foundation followed suit and transferred 15k ETH to Kraken, as per the transaction reported by PeckShieldAlert on Saturday, May 6. The large transaction by Ethereum Foundation raised FUD in the crypto community, with many thinking that an ETH price and meme coins crash could be coming.\n\nAlso Read: Ethereum Gas Fees Hit Record Levels Amid PEPE Meme Coin Hype; Flips SHIB, DOGE\n\nAs per historical data, a large ETH move by the Ethereum Foundation led to a massive fall in ETH prices. The last time 20,000 ETH was transferred to Kraken on November 12, 2021. After the Ethereum Foundation cash out at $4,722, near ATH, the ETH price fell 40% in 2 months.\n\nMeanwhile, Vitalik Buterin has sold several meme coins historically. The coins Vitalik Buterin sold mostly get rekt, similar to last time when shitcoins lost most value after he dumped massive amounts of shitcoins. In March, Vitalik sold 50 billion MOPS for 1.25 ETH, 10 billion CULT for 58 ETH, and 500 trillion SHIK for 380 ETH. In Addition, he sold 3.4M BITE for 5.9 ETH and transferred 214 ETH worth $337k to Ethereum Foundation.\n\nETH price fell 3% in the last 24 hours, with the price currently trading below $1800. The 24-hour low and high are $1,794 and $2,017, respectively. Furthermore, the trading volume has increased slightly by 52% in the last 24 hours, indicating an interest among traders.\n\nAlso Read: New York Introduces Landmark Crypto Regulatory Bill “CRPTO”"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtZGlhbW9uZC1oYW5kcy1zZXQtbmV3LXJlY29yZC1hcy1ldGgtcHJpY2UtcmVjb25xdWVycy0yMDAw0gFaaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtLWV0aC1kaWFtb25kLWhhbmRzLXNldC1uZXctcmVjb3JkLWFzLWV0aC1wcmljZS1yZWNvbnF1ZXJzLTIwMDA_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 May 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Diamond Hands Set New Record as ETH Price Reconquers $2,000 - U.Today",
        "content": "Advertisement\n\nExperts of Glassnode, a leading on-chain analytical firm, noticed an interesting pattern in Ethereum's (ETH) supply distribution. Six months after the FTX collapse, one crucial metric revisited historic highs. Speculators might not be as powerful as they seem to be.\n\nLong-term holders dominate Ethereum (ETH) supply\n\nOn-chain wallets that belong to long-term holders of Ethereum (ETH) are now responsible for 74% of its total available supply. \"Diamond hands\" accumulated a whopping 14,350,000 Ethers (ETH), latest Glassnode data says.\n\nAs the Long-Term Holder threshold of 155 days ages through the FTX failure, accumulated coins\n\nwhich have not been spent since are maturing to LTH status.\n\n\n\nThis has pushed the total supply held by Long-Term Holders to an ATH of 14.35M coins (74% of the circulating supply). pic.twitter.com/ea8bYUTqLB — glassnode (@glassnode) May 5, 2023\n\nThis impressive level has never been surpassed in the entire eight-year history of the second cryptocurrency. Besides growing confidence in bullish prospects for the ETH price, there is one more powerful catalyst that drives this upsurge.\n\nIn Glassnode, LTH metrics covers all coins that were not moved for at least 155 days. As such, in mid-May, Ethereum (ETH) wallets that were only active during the collapse of the FTX exchange will be mature enough to be included into this research.\n\nThe followers of the Glassnode account stressed that for Bitcoin (BTC), the largest cryptocurrency and the only token that exceeds Ethereum (ETH) by market cap, the long/short-term holder ratio looks just the same.\n\nAs U.Today reported yesterday, one more metric of the Ethereum (ETH) supply inches closer to multi-month highs. The number of new deposits hit an eight-month high, Santiment analysts noticed.\n\nEthereum (ETH) rejected at $2,000, meets aggressive bears\n\nWhile the Ethereum (ETH) community is generally optimistic about Ethereum's (ETH) prospects post-Shanghai, bulls are still failing to gain an upper hand.\n\nToday, in early morning hours, they briefly managed to push the Ethereum (ETH) price above the psychological level of $2,000 per coin. However, they met strong sellers who prevented ETH from growing higher.\n\nAs of press time, it is struggling to protect the $1,900 level on major spot exchanges. In the last 24 hours, the Ethereum (ETH) price lost almost 3%."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vd3d3LmNjbi5jb20vZXVyby1mb290YmFsbC1jbHViLWFjY2VwdHMtYml0Y29pbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 May 2023 07:00:00 GMT",
        "title": "Crypto Goal! Major Euro Football Club Now Accepts Bitcoin & Ethereum - CCN.com",
        "content": "By CCN.com: The beautiful game just got much prettier after European football giant Benfica announced they’d be accepting bitcoin and Ethereum payments. Now, fans of the Portuguese Primera Liga champions can pay for match tickets and club merchandise using cryptocurrency.\n\nEuro Elite Benfica Accept Bitcoin and Ethereum\n\nThis isn’t the first time the footballing elite has flirted with cryptocurrency, but it is the first time its been accepted as regular payment.\n\nIn the recent past, Italian champions Juventus played around with the idea of launching its own club token. Football supporters were even able to pay for match access with bitcoin during 2018’s World Cup in Russia – although that was a one-off.\n\nNow the transactional value of cryptocurrency can be employed in full around the Estádio da Luz – Benfica’s home ground. The sudden move comes courtesy of UTRUST, a crypto payments processing firm which also utilizes its own ETH-based token, UTK.\n\nAccording to Wednesday’s press release:\n\n“UTRUST’s core technology will allow Benfica to take advantage of the increased security and convenience of cryptocurrency payments while protecting the club from market volatility. It will also significantly reduce processing fees and eliminate inconvenient credit-card chargebacks and fraudulent payments.”\n\nBenfica CEO Domingos Soares de Oliveira said the decision to accept crypto payments came from a recognition that the club must “stay ahead of the curve,” adding:\n\n“[We] recognize that many of our supporters are now digital users first so we want to be ahead of the curve when it comes to accepting novel technologies.”\n\nFootball in Bed With Cryptocurrency?\n\nIt would have been difficult to imagine a more unlikely bedfellow for bitcoin than football, but no other popular industry has embraced crypto anywhere near as much.\n\nFormer Tottenham manager Harry Redknapp once pumped a cryptocurrency via his Twitter account. Footballing legend Ronaldinho even launched his own token. More names familiar to British and European football fans round up this list, which is growing by the month.\n\nIndeed, as recently as April, controversial cryptocurrency Bitcoin SV (BSV) signed a sponsorship deal with Scottish club Ayr United. The small seaside club carries the nickname of ‘The Honest Men.’ Make of that tidbit what you will.\n\nBenfica has a long, glorious history in European football and regularly fills out its 65,000 capacity stadium weekly. The club boasts 14 million followers worldwide and 7 million active fans across the internet and social media accounts.\n\nOnly bitcoin, Ethereum, and UTRUST’s UTK token will be accepted for payments to start."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1ldGgtZGlwcGluZy1wcmljZXMtcmlzaW5nLW5lZ2F0aXZlLXNlbnRpbWVudHMtYW5kLWV2ZXJ5dGhpbmctaW4tYmV0d2Vlbi_SAWtodHRwczovL2FtYmNyeXB0by5jb20vZXRoZXJldW0tZXRoLWRpcHBpbmctcHJpY2VzLXJpc2luZy1uZWdhdGl2ZS1zZW50aW1lbnRzLWFuZC1ldmVyeXRoaW5nLWluLWJldHdlZW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 May 2023 07:00:00 GMT",
        "title": "Ethereum [ETH]: Dipping prices, rising negative sentiments and everything in between - AMBCrypto News",
        "content": "Ethereum Proof-of-Stake network experienced a drop in active validator count since the Shapella upgrade.\n\nETH’s value has since posted a double-digit decline.\n\nSince Ethereum’s [ETH] Shapella upgrade went live on 12 April, there has been a steep decline in active validator count on the proof-of-stake (POS) network, data from Glassnode revealed.\n\nRead Ethereum’s Price Prediction 2023-2024\n\nInformation obtained from the on-chain data provider put the active validator count on the network at 562,941 on 12 April. Just 24 hours after the Shanghai upgrade went live, this fell to 561,655, where it has since remained.\n\nObserved on a 30-day moving average, the total number of validators that voluntarily exited Ethereum’s validator pool since Shapella rose significantly by over 400%.\n\nThe continued decline in active validator count on the Ethereum POS network is due to a rally in the withdrawals of previously deposited ETH coins by some validators on the network.\n\nFollowing the Shapella upgrade, validators that had previously secured the network with more than 18 million ETH were free to initiate withdrawals, which some of them did. According to a Nansen dashboard, 10,675 validators were scheduled for full exit in the last hour at press time.\n\nETH prices take a plunge\n\nMany expected ETH’s value to dip significantly once Shapella went live due to increased withdrawals and sell-offs to make a profit by those who had initially staked their ETH coins. In contrast, the alt’s value rose momentarily after the upgrade.\n\nAccording to data from CoinMarketCap, ETH’s price jumped by 14% between 12 and 16 April. As of 16 April, the leading altcoin traded above $2000, after which the price descent began. Exchanging hands at $1,897.75 at press time, ETH’s price has since decreased by 11%.\n\nDespite the price fall, ETH whales that hold between 100,000 to 10,000,000 ETH coins have intensified accumulation. Per data from Santiment, since the Shapella, the count of these big whales increased by 2.5%.\n\nConversely, whales that hold between 1,000 and 100,000 ETH coins have taken a risk-averse approach and dumped some of their ETH holdings. Data from Santiment revealed that their number has gone down by 1% since Shapella.\n\nRealistic or not, here’s ETH’s market cap in BTC terms\n\nFurther, while the ephemeral jump in ETH’s value following the Shapella upgrade caused market sentiment to turn positive on 14 April, the price decline caused the alt’s weighted sentiment to return to negative territory, where it has since remained.\n\nAt press time, this was -1.172. With persistent negative sentiment lingering in the market, any significant spike in ETH’s price might be hard to come by."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vdS50b2RheS92aXRhbGlrLWJ1dGVyaW4tYW5kLWV0aC1mb3VuZGF0aW9uLXNlbGwtMzAtbWlsbGlvbi1pbi1ldGhlcmV1bS1hcy1ldGgtYWJvdXQtdG8tYnJlYWstMjAwMNIBbWh0dHBzOi8vdS50b2RheS92aXRhbGlrLWJ1dGVyaW4tYW5kLWV0aC1mb3VuZGF0aW9uLXNlbGwtMzAtbWlsbGlvbi1pbi1ldGhlcmV1bS1hcy1ldGgtYWJvdXQtdG8tYnJlYWstMjAwMD9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 May 2023 07:00:00 GMT",
        "title": "Vitalik Buterin and ETH Foundation Sell $30 Million in Ethereum As ETH About to Break $2,000 - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nAccording to data shared by @lookonchain, an analytics platform that tracks large crypto transactions and transfers of \"Smart Money\" wallets, Vitalik Buterin sent nearly half a million worth of Ethereum to a major exchange.\n\nAfter he did that, the Ethereum Foundation did the same but transferred a lot more Ethereum to the same platform — nearly $30 million worth of it.\n\nIn the meantime, the second largest cryptocurrency, ETH, is trading at the $1,960 level. Santiment on-chain data company believes that ETH is on the cusp of breaking above $2,000.\n\nButerin and ETH Foundation sell ETH\n\nLookonchain shared that the vitalik.eth wallet was the first to move 200 Ethereum (worth about $400,000) to the U.S.-based Kraken exchange. Following Buterin's transaction, the Ethereum Foundation did the same but on a much bigger scale — they shifted 15,000 ETH to Kraken as well.\n\nTogether with Buterin's crypto, that makes $40,000,000 USD in fiat. The second transaction was also noticed and highlighted by the popular crypto tracker Whale Alert.\n\nIt seems that Buterin just sells Ethereum from time to time in more or less the same amounts. As reported by U.Today earlier, in the middle of February, he sold 210 ETH for roughly $325,000 in the USDC stablecoin. Curiously, that chunk of ETH was also sold on Kraken.\n\nBack then, Ethereum was trading at $1,545.\n\nOn March 13, he moved another 200 ETH to Kraken, selling it at the price of $1,656 per coin.\n\nEthereum on verge of breaking $2,000: Reasons\n\nSantiment data aggregator reported on Friday that ETH had reached an eight-month high in flows to crypto exchanges. The analytics team believes that this may be a sign of an upcoming volatility increase similar to what it was like after the collapse of FTX in early November and the Merge in mid-September.\n\nIn a tweet that followed, Santiment added that while \"sky-high active deposits\" of ETH to exchanges are the highest since November last year, ETH is now showing signs of decoupling from BTC and may be about to break above the $2,000 level.\n\n🚀 Updating our report on #Ethereum's sky-high active deposits, exchange addresses interacting on the network is now at its highest level since November, 2021. As expected, $ETH is showing decoupling signs and on the cusp of breaking $2k once again. https://t.co/zYjY7669yj https://t.co/dQlKsTVyt2 pic.twitter.com/2nMXOUGgYC — Santiment (@santimentfeed) May 5, 2023\n\nBesides, a record amount of ETH was burned at the end of this week, as U.Today reported. That was down to the meme coin season unwrapping at the moment — the majority of meme coins run on Ethereum and so are being actively moved with high ETH fees, providing a great opportunity to burn ETH and decrease the circulating supply."
    }
]