[
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9ldGgtdW5hYmxlLXRvLWJyZWFjaC0yay1idXQtaXMtYS1tYXNzaXZlLW1vdmUtY29taW5nLWV0aGVyZXVtLXByaWNlLWFuYWx5c2lzL9IBamh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9ldGgtdW5hYmxlLXRvLWJyZWFjaC0yay1idXQtaXMtYS1tYXNzaXZlLW1vdmUtY29taW5nLWV0aGVyZXVtLXByaWNlLWFuYWx5c2lzLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jul 2023 07:00:00 GMT",
        "title": "ETH Unable to Breach $2K But is a Massive Move Coming? (Ethereum Price Analysis) - CryptoPotato",
        "content": "Ethereum buyers have been struggling to push the price above the significant resistance region of $2K. Nevertheless, the price is currently navigating a crucial range bounded by that level and the dynamic support provided by the 100-day moving average.\n\nTechnical Analysis\n\nBy Shayan\n\nThe Daily Chart\n\nOn June 21st, Ethereum managed to surpass the 100-day moving average and continued its prevailing uptrend after a pullback, eventually reaching the critical resistance area at $2K. Yet, the bullish momentum faded due to increased selling pressure around this level, resulting in minor rejections.\n\nNevertheless, the price finds support at the 100-day MA, currently situated at $1,867, which has prevented further declines over the past few weeks. A breakout from this significant price range will likely play a pivotal role in determining Ethereum’s overall prospects in the mid-term.\n\nThe 4-Hour Chart\n\nUpon analyzing the 4-hour timeframe, a bearish trend for Ethereum becomes evident as the price broke below its multi-week upward trendline after facing rejection at the $2K resistance zone. A subsequent pullback confirmed the breakout.\n\nAt present, ETH remains confined between two critical price levels: the static resistance at $2K and the critical support at $1,850. This suggests the potential for a range-bound market stage characterized by consolidation candles and the absence of a strong trend.\n\nThe price is expected to remain within this range until a breakout occurs, revealing the upcoming direction for Ethereum.\n\nOn-chain Analysis\n\nBy Shayan\n\nThe provided chart displays the Estimated Leverage Ratio in correlation with ETH’s price. This metric gauges the average leverage employed by participants in the futures market. Generally, higher values indicate more investors are taking on greater leverage and risk in the derivatives market.\n\nIn recent weeks, the Estimated Leverage Ratio has seen a slight increase, suggesting that the futures market may be getting overheated due to the recent bullish price trends. However, it hasn’t reached concerning levels yet. Nonetheless, if the metric continues to surge, caution is advised as it could lead to a short or long-squeeze event.\n\nIn such a scenario, Ethereum’s price could experience a sudden and significant movement."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNy8yMi9zb2xhbmEtdG8tc2t5cm9ja2V0LWJ5LW92ZXItODcwLW9uY2UtZXRoZXJldW1zLWJ1bGwtcnVuLXN0YXJ0cy1wcmVkaWN0cy1jcnlwdG8tYW5hbHlzdC1oZXJlcy10aGUtdGltZWxpbmUv0gGPAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA3LzIyL3NvbGFuYS10by1za3lyb2NrZXQtYnktb3Zlci04NzAtb25jZS1ldGhlcmV1bXMtYnVsbC1ydW4tc3RhcnRzLXByZWRpY3RzLWNyeXB0by1hbmFseXN0LWhlcmVzLXRoZS10aW1lbGluZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jul 2023 07:00:00 GMT",
        "title": "Solana To Skyrocket by Over 870% Once Ethereum’s Bull Run Starts, Predicts Crypto Analyst – Here’s the Timeline - The Daily Hodl",
        "content": "A widely followed crypto analyst believes that Solana (SOL) will come close to its all-time highs once Ethereum (ETH) kicks off its bull market.\n\nIn a new strategy session, the host of InvestAnswers tells his 446,000 YouTube subscribers that Solana could go up to $250, an increase of more than 870% from its current price of $25.75.\n\nAccording to the pseudonymous analyst, Solana’s rise will likely be triggered by Ethereum’s Cancun upgrade, which is expected to further elevate the leading smart contract platform’s scalability. The InvestAnswers host mentions a prediction made by Blofin, a crypto-financial services firm that sees Ethereum rising to $9,700 following the update.\n\n“Per Blofin, they predict that after the Cancun upgrade of Ethereum, price could exceed $9,700 per ETH in the first quarter of 2024. And of course, that is their most optimistic case…\n\nThe next question is always, ‘Well if Ethereum goes to $9,700, what’s the price of Solana?’ I calculated it for you. It’s going to be at least $250 if ETH hits $9,700.\n\nRemember $9,700 from where it is now is over a 5x and of course, Solana goes up faster than ETH will at that time.”\n\nWhile the InvestAnswers host believes that Ethereum could rally to $9,700, he doesn’t see the surge happening in the coming months.\n\n“Great to see $9,700 ETH. Maybe we’ll see in the bull run. I doubt we’ll see it in the first quarter of 2024, but perhaps early 2025.”\n\nLooking at Bitcoin (BTC), the anonymous analyst reiterates his prediction that the flagship crypto asset will soar by over 40% from current levels by early next year.\n\n“I did say many times a few months ago, I would not be surprised if we had a $42,000 Bitcoin target by somewhere between January and April of 2024.”\n\nBitcoin is trading at $29,804 at time of writing.\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1hZGRyZXNzZXMtZmFsbC10by04LW1vbnRoLWxvd3MtYnV0LWFsbHMtbm90LWxvc3Qv0gFUaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2V0aGVyZXVtLWFkZHJlc3Nlcy1mYWxsLXRvLTgtbW9udGgtbG93cy1idXQtYWxscy1ub3QtbG9zdC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jul 2023 07:00:00 GMT",
        "title": "Ethereum addresses fall to 8-month lows, but all’s not lost - AMBCrypto News",
        "content": "Address outflows from whales contributed heavily to ETH’s latest sell pressure.\n\nSome whales are re-accumulating, but it may not be enough to turn the ship around.\n\nEthereum [ETH] has been on an overall bearish trajectory for the last seven days – an outcome that saw it shed last month’s gains. But what has been driving this bearish retracement?\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nOutflows from whale addresses may have largely contributed to ETH’s downside. A recent Glassnode alert offered some confirmation. It revealed that the number of addresses holding 100 or more ETH recently fell to their lowest level in the last eight years.\n\nThe Glassnode alert warrants a look at whether other whale categories have been contributing to sell pressure. We found that addresses holding at least 1,000 ETH and those above the 10,000 ETH (Denoted by blue and black respectively) have been trimming their balances.\n\nIn other words, they have been contributing to the downside.\n\nWe also found something interesting. Retail buyers (smaller accounts) holding at least 0.01 ETH have increased their balances overall. This is during the same period that whales have been selling off some of their ETH.\n\nIn other words, ETH’s price action in the last few weeks has been significantly influenced by whale games.\n\nOne in the chamber?\n\nWe looked into the supply distribution which collaborates with the Glassnode address activity analysis above. However, we observed that addresses holding over 10 million ETH have been growing during the month.\n\nIn addition, the same whale category controls the second largest share of ETH in circulating supply.\n\nIt was unclear whether the aforementioned address category represented private addresses or exchange addresses. Aside from that, addresses holding between 1,000 and 100,000 ETH shifted in favor of accumulation in the last 24 hours.\n\nAlso, investor confidence remained favorable for the bulls, judging by the steady rise in weighted sentiment.\n\nETH’s MVRV ratio has also been steadily rising during the last four months and was at its highest level during the same period. The above information coincided with the latest price action.\n\nHow much are 1,10,100 ETHs worth today?\n\nETH’s bearish assault slowed down in the last three days, but the press time momentum was not yet strong enough for a substantial bounce back.\n\nETH exchanged hands at $1894 at press time. It was, at press time, showing signs of a potential bounce back at the RSI mid-point. Moreover, the MFI has already indicated that there has been some accumulation in the last few days."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtc2V0cy1uZXctcmVjb3JkLXdpdGgtNTItYmlsbGlvbi13b3J0aC1zZWN1cmluZy1uZXR3b3Jr0gFXaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtLWV0aC1zZXRzLW5ldy1yZWNvcmQtd2l0aC01Mi1iaWxsaW9uLXdvcnRoLXNlY3VyaW5nLW5ldHdvcms_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jul 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Sets New Record With $52 Billion Worth Securing Network - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe second-largest cryptocurrency, Ethereum, has set a new record with a massive $52 billion worth now securing the ETH network.\n\nAdvertisement\n\nPer IntoTheBlock, the Ethereum network is currently being secured by a staggering $52.3 billion, marking the highest value ever reached.\n\nRecent data reveals that the total value of the ETH 2.0 Deposit Contract has reached an ATH of 26,232,679 ETH.\n\nThe Ethereum network is currently being secured by a staggering $52.3 billion, marking the highest value it has ever reached. As the value of #ETH used to secure the network increases, it becomes increasingly challenging for any potential attacker to gain control over it. pic.twitter.com/2hrzj82Nk0 — IntoTheBlock (@intotheblock) July 21, 2023\n\nIntoTheBlock notes that as the value of ETH used to secure the network increases, it becomes increasingly challenging for any potential attacker to gain control over it.\n\nEthereum migrated to the proof-of-stake (PoS) consensus during the Merge upgrade last September. The proof-of-work (PoW) consensus was used by Ethereum for the first seven years of its life, much like Bitcoin.\n\nThe network's security was then derived from the enormous quantities of energy needed to solve mathematical puzzles, as any attacker would have to obtain 51% of the chain's energy usage, which is a nearly impossible feat.\n\nEthereum is now secured by stakers rather than miners. To be a validator, which is in charge of ensuring the validity of new blocks, stakers must stake 32 ETH.\n\nConsensus mechanisms, which allow a decentralized network to confidently decide which blocks to add to the chain, are the most important aspect of any blockchain's security. If the consensus mechanism is exploited, as might happen in a 51% attack, the chain could suffer irreparable harm.\n\nEthereum Deneb/Cancun testing efforts progress\n\nChristine Kim summarizes the Ethereum ACDE call, a twice-weekly conference call where Ethereum client teams debate and plan updates to the Ethereum execution layer (EL).\n\nThis week, developers talked about DevNet 8 planning and some adjustments to Deneb/Cancun EIPs. Various teams are working on new software releases in advance of DevNet 8.\n\nDevelopers will move on with the launch of the following test network once all client releases have passed the pertinent Hive tests for DevNet 8, which is scheduled to debut sometime in the first week of August, according to developers.\n\nA shadow fork of Sepolia has already been finished by developers with a small number of clients, and this helped to find a few flaws in the client code."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tZXRoLXJlY29yZHMtaGlnaGVzdC1jZXgtaW5mbG93cy1pbi0yLW1vbnRocy_SAV9odHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2V0aGVyZXVtL2V0aGVyZXVtLWV0aC1yZWNvcmRzLWhpZ2hlc3QtY2V4LWluZmxvd3MtaW4tMi1tb250aHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jul 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Records Highest CEX Inflows In 2 Months - NewsBTC",
        "content": "Over the past week, Ethereum (ETH) registered the highest inflows into centralized exchanges (CEX) in the past two months. These significant asset movements have suggested a potential price dip for ETH.\n\nCoinGecko data shows that the second-largest cryptocurrency has been experiencing a slight price decline, losing 2.5% of its value in the past week. As of this writing, the Ether token changes hand at $1,892.65, with a negligible 0.2% gain in the last 24 hours.\n\nEthereum Registers $383 Million Worth Of ETH In CEX Inflows\n\nAccording to data from IntoTheBlock, Ethereum witnessed the largest inflows into centralized exchanges in the past two months. The data analytics platform found that at least $383 million worth of ETH was deposited into these exchanges.\n\nIntoTheBlock also revealed that a significant percentage of the CEX inflows came from a single address and in a single transaction. This deposit came from an old wallet that accumulated 61,216 ETH during the Ethereum Initial Coin Offering (ICO).\n\nThis pre-mine wallet had been dormant for eight years, with its constituent ETH worth more than $116 million untouched. On Wednesday, July 19, this address became activated, and its stash of Ether tokens was abruptly moved to another address associated with the Kraken exchange.\n\nData from Whale Alert shows that a significant amount of Ether tokens has been transferred to crypto exchanges by several whales over the past week. Notably, more than 200,000 Ether tokens have been transferred to Coinbase in separate transactions within this period.\n\nIndeed, the movement of massive amounts of ETH to centralized exchanges can signal impending selling pressure, which can drive the asset’s price down. However, not all large transfers to an exchange precipitate a downward price movement, as the whales might not intend to sell immediately or all at once.\n\nTotal ETH Staked Reaches All-Time High\n\nThe Ethereum network has been experiencing a steady increase in the total amount of ETH staked on the blockchain. According to data from IntoTheBlock, this figure has reached $52.3 billion, representing its highest value ever.\n\nThe data analytics company also noted that with an increasing amount of staked ETH, the Ethereum blockchain is bound to become even more secure, as there will be a corresponding decrease in the risk of the network being taken over by a single entity.\n\nIt is worth noting that this surge in staking activity can be linked to the successful launch of the Shapella upgrade. The Shapella upgrade offered a new dimension to ETH staking, as investors can now lock and unlock their assets at will.\n\nThis increased flexibility eliminated a substantial portion of risk that has been attributed to ETH staking in the past.\n\nETHUSD trading at $1,886.82 | Source: ETHUSD daily chart from TradingView\n\nFeatured image from Getty, chart from TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    }
]