[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtcmVnYWlucy0xODIwLWZ1ZWxlZC1ieS10aGVzZS10cmlnZ2Vycy1kZXRhaWxz0gFOaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtLWV0aC1yZWdhaW5zLTE4MjAtZnVlbGVkLWJ5LXRoZXNlLXRyaWdnZXJzLWRldGFpbHM_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Regains $1,820 Fueled by These Triggers: Details - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nOver the past 24 hours, the second most popular cryptocurrency, Ethereum, has added nearly 6%, rising to the $1,821 level. A recent tweet published by the Santiment analytics team hints at the reasons that have suddenly pushed ETH up.\n\nEthereum jumps 5.93%: reasons behind it\n\nThe main reason, per Santiment, for the Ethereum price surge is that it has been following the growth of Bitcoin, just like the rest of the crypto market. The flagship cryptocurrency recaptured the $28,000 level (surging by 7.71% within 24 hours) after the news of main Wall Street companies — Fidelity, Charles Schwab and Citadel Securities — launching a crypto exchange dubbed EDX.\n\n📈 Powered by #Bitcoin's jump back above $28.8k & #Ethereum's return above $1,820, price pumps are being seen market-wide. Based on @santimentfeed's coverage of 2,648 #crypto assets, volume is 30.2% higher than the past week & discussion rates are up big. https://t.co/ZB9dcl8Tvv pic.twitter.com/TFIZha0ylk — Santiment (@santimentfeed) June 21, 2023\n\nThe news of these top players entering the crypto space has apparently fueled the sudden spike of Bitcoin followed by Ethereum and other cryptos jumping in price as well. Prior to that, the world's largest wealth manager, BlackRock, announced that it filed for a Bitcoin spot ETF, with rumors about Fidelity having similar plans following almost immediately.\n\nBesides, as reported by U.Today earlier, global wealth management company Invesco also filed for a spot BTC exchange-traded fund, according to a recently published SEC document.\n\nAside from the new Wall Street-backed exchange, a lot of dormant BTC whales have begun moving their Bitcoins back into the market, according to another tweet by Santiment.\n\nSantiment also stated that Ethereum was pushed up not only by Bitcoin but also by a massive surge in trading volume on the crypto market — $222 billion last week, which was 30% more than the week before that seen.\n\nWall Street enters crypto, while SEC sues major exchanges\n\nLast week, the crypto market experienced a wave of shock as the SEC filed charges against the two largest crypto exchanges in the U.S., Binance and Coinbase. The regulator claimed that these platforms violated U.S. securities laws.\n\nThis happened after SEC first sued Ripple Labs in late 2020 and has recently been clamping down on various crypto platforms, including, again, Coinbase (when it forbade them to launch a crypto lending service last year) and Kraken.\n\nHowever, at the same time, large Wall Street companies are entering the crypto space as was mentioned above, including the largest bank in Germany, Deutsche Bank, now seeking a license to start offering crypto custodial services to its clients.\n\nSome thought leaders in crypto believe that the SEC is sweeping out major crypto companies from the U.S., so that Wall Street giants can take their place and grab up their income. However, many Bitcoin maxis believe that Wall Street entering crypto is a great sign for Bitcoin adoption and for BTC's future."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ldGhlcmV1bS1mb3VuZGVyLXZpdGFsaWstYnV0ZXJpbi10aWVzLTE4MTUzNTA4Ni5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Founder Vitalik Buterin Has Ties to SEC Darling Prometheum—Here's How - Yahoo Finance",
        "content": "The connection between Ethereum co-founder Vitalik Buterin and Wanxiang Blockchain Labs, although it’s been public for years, is suddenly a very big deal. That’s because as the industry pores over Prometheum, now the SEC’s poster child for regulatory compliance, Crypto Twitter has realized that the startup is partly owned by Shanghai Wanxiang Blockchain.\n\nCrypto Twitter is in shock that Vitalik Buterin was the Chief Scientist for Wanxiang. I don't think they realize yet that it was Wanxiang that setup and funded the wallets for both the Ethereum Foundation, & Vitalik Buterin. Yes CT, it goes much much Deeper. https://t.co/PzG45UE7Ys — TruthLabs 💄 (@BoringSleuth) June 16, 2023\n\nEyebrows were raised among the digital assets community following testimony from Prometheum co-CEO Aaron Kaplan on Capitol Hill, where his sentiments on regulatory compliance contrasted talking points from countless crypto firms and mirrored statements made by the SEC.\n\nPrometheum touts that it's the first crypto firm ordained by the SEC and a member of FINRA, the finance-focused self-regulatory organization. Upheld by Gary Gensler as an example of how regulatory compliance for crypto companies is indeed possible, the firms' connection to Shanghai Wanxiang Blockchain drew scrutiny.\n\nWanxiang Blockchain Labs is a non-profit organization and China-based research institution started in 2015 by China Wanxiang Holding. The Labs’ resources were integrated into Shanghai Wanxiang Blockchain, a firm established in 2017.\n\nWhy Vitalik Buterin is Known as the 'V God' in China\n\nButerin’s connection to the nonprofit can be traced back to Ethereum’s early days. In 2015, then-CEO of Wanxiang Blockchain Labs Feng Xiao formed a relationship with Buterin and purchased $500,000 worth of Ethereum. The funds helped Buterin pay developers, according to a report from Global Coin Research.\n\nStory continues\n\nButerin was one of several guest speakers at Blockchain Week 2016, a conference co-hosted by the Ethereum Foundation and Wanxiang Blockchain Labs, which also featured talks from Circle CEO Jeremy Allaire and Ripple Labs co-founder Jed McCaleb, according to the event’s website.\n\nAt the time Buterin was described on the event’s website as Wanxiang Blockchain Labs’s chief scientist. That assertion is backed by a description of Buterin’s role on the non-profits’ website now. Separately, Buterin is described as a co-founder of the non-profit on Facebook.\n\nEthereum co-founder @VitalikButerin is listed as a co-founder of @WXblockchain, a part owner of @PrometheumInc which was recently given rights to operate a #crypto exchange in the U.S. Other filings show Buterin is also Chief Scientist at Wanxiang Blockchain Labs. pic.twitter.com/ywdl4u97RM — Eleanor Terrett (@EleanorTerrett) June 21, 2023\n\nNeither Wanxiang Blockchain Labs nor the Ethereum Foundation immediately responded to a request for comment from Decrypt.\n\nPrometheum established a strategic partnership and joint development agreement with Shanghai Wanxiang Blockchain years later in 2018, according to an SEC filing. The deal gave Prometheum access to Wanxiang’s “technology resources, industry contacts, [and] intellectual capital,” adding that the organizations are committed to sharing resources.\n\nPrometheum eventually terminated its agreement with Shanghai Wanxiang Blockchain in October 2021, Kaplan of Prometheum wrote in written testimony prepared for the House Financial Services Committee last week. After a year, it was apparent that “joint development was not viable,” according to Kaplan.\n\n“Wanxiang and its affiliates have no access to any Prometheum code, technology, software, or to the Prometheum ecosystem,” he wrote, adding the company’s code has been developed internally. “Prometheum is proud to be an American-born, bred, and controlled company.”"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ldGhlcmV1bS1mb3VuZGVyLXZpdGFsaWstYnV0ZXJpbi10aWVzLTE4MTUzNTA4Ni5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Founder Vitalik Buterin Has Ties to SEC Darling Prometheum—Here's How - Yahoo Finance",
        "content": "The connection between Ethereum co-founder Vitalik Buterin and Wanxiang Blockchain Labs, although it’s been public for years, is suddenly a very big deal. That’s because as the industry pores over Prometheum, now the SEC’s poster child for regulatory compliance, Crypto Twitter has realized that the startup is partly owned by Shanghai Wanxiang Blockchain.\n\nCrypto Twitter is in shock that Vitalik Buterin was the Chief Scientist for Wanxiang. I don't think they realize yet that it was Wanxiang that setup and funded the wallets for both the Ethereum Foundation, & Vitalik Buterin. Yes CT, it goes much much Deeper. https://t.co/PzG45UE7Ys — TruthLabs 💄 (@BoringSleuth) June 16, 2023\n\nEyebrows were raised among the digital assets community following testimony from Prometheum co-CEO Aaron Kaplan on Capitol Hill, where his sentiments on regulatory compliance contrasted talking points from countless crypto firms and mirrored statements made by the SEC.\n\nPrometheum touts that it's the first crypto firm ordained by the SEC and a member of FINRA, the finance-focused self-regulatory organization. Upheld by Gary Gensler as an example of how regulatory compliance for crypto companies is indeed possible, the firms' connection to Shanghai Wanxiang Blockchain drew scrutiny.\n\nWanxiang Blockchain Labs is a non-profit organization and China-based research institution started in 2015 by China Wanxiang Holding. The Labs’ resources were integrated into Shanghai Wanxiang Blockchain, a firm established in 2017.\n\nWhy Vitalik Buterin is Known as the 'V God' in China\n\nButerin’s connection to the nonprofit can be traced back to Ethereum’s early days. In 2015, then-CEO of Wanxiang Blockchain Labs Feng Xiao formed a relationship with Buterin and purchased $500,000 worth of Ethereum. The funds helped Buterin pay developers, according to a report from Global Coin Research.\n\nStory continues\n\nButerin was one of several guest speakers at Blockchain Week 2016, a conference co-hosted by the Ethereum Foundation and Wanxiang Blockchain Labs, which also featured talks from Circle CEO Jeremy Allaire and Ripple Labs co-founder Jed McCaleb, according to the event’s website.\n\nAt the time Buterin was described on the event’s website as Wanxiang Blockchain Labs’s chief scientist. That assertion is backed by a description of Buterin’s role on the non-profits’ website now. Separately, Buterin is described as a co-founder of the non-profit on Facebook.\n\nEthereum co-founder @VitalikButerin is listed as a co-founder of @WXblockchain, a part owner of @PrometheumInc which was recently given rights to operate a #crypto exchange in the U.S. Other filings show Buterin is also Chief Scientist at Wanxiang Blockchain Labs. pic.twitter.com/ywdl4u97RM — Eleanor Terrett (@EleanorTerrett) June 21, 2023\n\nNeither Wanxiang Blockchain Labs nor the Ethereum Foundation immediately responded to a request for comment from Decrypt.\n\nPrometheum established a strategic partnership and joint development agreement with Shanghai Wanxiang Blockchain years later in 2018, according to an SEC filing. The deal gave Prometheum access to Wanxiang’s “technology resources, industry contacts, [and] intellectual capital,” adding that the organizations are committed to sharing resources.\n\nPrometheum eventually terminated its agreement with Shanghai Wanxiang Blockchain in October 2021, Kaplan of Prometheum wrote in written testimony prepared for the House Financial Services Committee last week. After a year, it was apparent that “joint development was not viable,” according to Kaplan.\n\n“Wanxiang and its affiliates have no access to any Prometheum code, technology, software, or to the Prometheum ecosystem,” he wrote, adding the company’s code has been developed internally. “Prometheum is proud to be an American-born, bred, and controlled company.”"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA2LzIxL3dpbGwtZXRoZXJldW0tYmUtYS10cmlsbGlvbi1kb2xsYXItY3J5cHRvY3VycmVuY3kv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "Will Ethereum Be a Trillion-Dollar Cryptocurrency by 2024? - The Motley Fool",
        "content": "Ethereum, as the world's second-biggest cryptocurrency behind Bitcoin, already is a billion-dollar player. This cryptocurrency and blockchain is a market leader, attracting developers and users to its platform -- and investors to buy and stake coins.\n\nBut the past year hasn't been easy for cryptocurrency in general. The market's value tumbled last year. Amid economic woes, people turned away from cryptocurrency and favored the safest investments. This year, the crypto market has been on the rise -- but it's slipped from its 2023 peak reached in April. Could this hold back Ethereum? Or could this market leader become a trillion-dollar cryptocurrency by 2024? Let's find out.\n\nDevelopers love Ethereum\n\nIf you ask developers which blockchain they're building on, many of them would say Ethereum. In fact, the blockchain has the most total developers of any other player, according to the latest Electric Capital developer report. And the number has increased 52% from two years ago to more than 5,800.\n\nWinning over developers is key because they are the ones building content -- and that, in turn, adds to the use cases for a particular blockchain.\n\nAnd that's part of why Ethereum also is a leader when it comes to hosting decentralized applications (dApps). This big player is No. 1 in the sales of non-fungible tokens, too, CryptoSlam data show.\n\nStill, people have had one complaint about Ethereum since its early days. That's its slow transaction speed and the costs associated with this. But the good news is Ethereum is working on this problem, and thanks to a series of planned updates, the blockchain should become much faster and cheaper down the road.\n\nEthereum has already started that process. An update last year helped the blockchain reduce its energy consumption by 99%. That's as it switched to the proof-of-stake validation method from proof of work. While proof of work relies on intense computational power to validate blocks of data, proof of stake doesn't. Instead, it grants the right to validate to those holding a significant stake.\n\nThe role of rollups\n\nEthereum also is scaling up by using a layer 2 solution known as a rollup. Rollups involve handling transactions in batches and then sending output back to the mainnet. Already, rollups are as much as eight times cheaper than using the mainnet -- and in the future, fees could become at least 40 times cheaper.\n\nThe blockchain also is working on improving security and even \"future proofing\" the system. For example, eventually quantum computing may represent a risk for the cryptography used to secure Ethereum today. Even though the threat probably is far down the road, right now Ethereum is exploring two forms of quantum-safe cryptography.\n\nAll of this means the Ethereum of tomorrow is likely to be even better than the Ethereum of today. Now, let's consider whether that could push Ethereum from its $208 billion market value of today into trillion-dollar territory. If we use today's circulating supply of Ethereum -- about 120 million coins -- we can see that to reach a market value of $1 trillion, Ethereum would have to more than quadruple from today's price.\n\nThe economic backdrop\n\nAgainst a strong economic backdrop, that could happen rather quickly. But I'm not convinced we're there yet. The Federal Reserve is modeling for a recession later this year. Even though it's expected to be mild, this still could weigh on demand for crypto. Ethereum has increased more than 40% this year. And it still may continue to climb -- but it may not do so at a pace that will catapult it to $1 trillion in value by next year.\n\nThat said, this isn't bad news. Ethereum's outlook remains bright. And planned upgrades should help the network excel over the long term. And that's great news for investors who buy this leading cryptocurrency now."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy8zLXJlYXNvbnMtd2h5LWV0aGVyZXVtLW1hcmtldC1jYXAtZG9taW5hbmNlLWlzLXJpc2luZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Jun 2023 07:00:00 GMT",
        "title": "3 reasons why Ethereum's market cap dominance is on the rise - Cointelegraph",
        "content": "Ethereum has been the dominant smart contract and decentralized application (DApp) network since its inception. An analysis of Ether’s price (ETH) and market capitalization shows indisputable evidence that the blockchain has been gaining market share.\n\nEther market capitalization dominance (%). Source: TradingView\n\nAs shown above, Ether’s dominance in market capitalization terms has grown over the past couple of years, from an 18% average in July 2021 to the current 20%. Excluding Bitcoin (BTC) from the analysis, Ether’s market share presently stands at 40.6%, while its next competitor, BNB (BNB), holds a 7.2% share.\n\nThe disparity between Ethereum and others is also evident when analyzing the total value locked (TVL) on each network’s smart contracts. Ethereum is the absolute leader with $24.6 billion in TVL, followed by Tron’s $5.4 billion and BNB Chain’s $3.3 billion.\n\nTotal value locked market share (%). Source: DefiLlama\n\nThe above chart depicts how Ethereum’s TVL market share declining from 70.5% in June 2021 to 49.5% in May 2022 as Terra and Avalanche gained a combined 20% market share. However, following the Terra ecosystem collapse in May 2022 — which culminated in developers halting network activity — Ethereum quickly regained a 58% market share.\n\nDespite the emergence of DApps on the BNB and Tron blockchains, Ethereum’s leadership has remained uncontested over the past 12 months. This data shows the irrelevance of the total number of unique active wallets (UAW) interacting with smart contracts per chain.\n\nFor instance, according to DappRadar, WAX has 363,600 active users, followed by BNB Chain’s 517,300 30-day UAW. These figures are way higher than the Ethereum network’s 66,300 unique active addresses, but they reflect much lower transaction fee, opening room for manipulation.\n\nDecentralization matters, and Ethereum stands out among its competitors\n\nThe Ethereum ecosystem has the highest number of active developers, surpassing 1,870, which is more than the next three competitors — Polkadot (752), Cosmos (511) and Solana (383) — combined.\n\nCurrently, the Ethereum network has over 700,000 validators, with 99% of the balances locked in staking participating in the process. The 32 ETH threshold limit per validator undoubtedly inflates this number, but Lido, the largest known staking pool, controls 32% of the staking, with Coinbase coming in second with 9.6%.\n\nConsequently, it is safe to say that Ethereum is far less centralized in terms of development and validation compared with Tron, BNB Chain and Solana.\n\nOther reasons Ether’s dominance has been on the rise, even as Bitcoin reached a 50% market share on June 19, include derivatives activity and its dominance of the NFT market\n\nDerivatives markets are essential to institutional investors\n\nEther’s future contracts are essential for institutional trading practices like hedging and trading with leverage. Ether’s cash-settled futures were added to the Chicago Mercantile Exchange in February 2021. To date, no other cryptocurrency, apart from Bitcoin, has reached the world’s largest derivatives exchange.\n\nIn futures markets, longs and shorts are balanced at all times, but having a larger number of active contracts — open interest — allows the participation of institutional investors who require a minimum market size. Ether futures aggregated open interest stands at $5.4 billion, while competitor BNB hold $380 million and Solana a mere $178 million.\n\nEthereum is still the market leader in NFTs\n\nNonfungible tokens are a perfect example of how cheaper, faster transactions do not always translate to increased adoption. Nothing is stopping NFT projects from shifting between blockchains, whether for new listings or existing collections. In fact, y00ts and DeGods moved to Polygon earlier in 2023.\n\nDespite facing gas fees that often break above $10, Ethereum remains the absolute leader in the number of buyers and total sales. According to CryptoSlam, the leading network reached $380 million in sales over the past 30 days, while Solana, Polygon and BNB Chain totaled a combined $93 million.\n\nUltimately, the data favors Ethereum versus its competing smart contract-focused blockchains. The positive trend in Ether’s dominance might fade over time if the promised network upgrade to allow parallel processing (sharding) does not come to fruition, but for now, Ether’s 20% market capitalization share remains unchallenged.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    }
]