[
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDUvMTEvbWVldC1kZW5jdW4tZXRoZXJldW0tZGV2ZWxvcGVycy1hcmUtYWxyZWFkeS1wbGFubmluZy1uZXh0LWhhcmQtZm9yay_SAXFodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA1LzExL21lZXQtZGVuY3VuLWV0aGVyZXVtLWRldmVsb3BlcnMtYXJlLWFscmVhZHktcGxhbm5pbmctbmV4dC1oYXJkLWZvcmsvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Meet ‘Dencun.’ Ethereum Developers Are Already Planning Next Hard Fork - CoinDesk",
        "content": "As for the full scope of what Dencun will look like? That’s to be determined over the next few weeks. The developers are testing out other EIPs before they solidify what other proposals will make it into the next big hard fork."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2V0aGVyZXVtLWZhaWxlZC10by1maW5hbGl6ZS10cmFuc2FjdGlvbnMtZm9yLTI1LW1pbnV0ZXMtYnV0LWF2b2lkZWQtZnVsbC1vdXRhZ2Uv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Ethereum failed to finalize transactions for 25 minutes but avoided full outage - CryptoSlate",
        "content": "The Ethereum blockchain failed to finalize transactions for slightly less than half an hour, developers said on May 11.\n\nThe incident lasted for approximately 25 minutes, and Ethereum contributor terence.eth said that the issue has now been solved. He wrote:\n\n“Mainnet has been finalized, and we are investigating the incident now. More to come!”\n\nEthereum contributor Superphiz said that although Ethereum’s beacon chain stopped finalizing, the blockchain is “designed to be resilient” against such issues. The chain continued to partially process transactions during the incident.\n\nThough the cause is still unknown, Superphiz suggested that the issue may have resulted from a lack of diversity of clients. He said that loss of finality could have been avoided if no client had more than one-third dominance over the network. He added that the blockchain avoided forking because no client had a supermajority.\n\nCurrently, two consensus clients — Lighthouse and Prsym — dominate Ethereum, each with 38% dominance. Only three other clients have a notable presence.\n\nEthereum has experienced other outages in the past: it experienced a DDOS attack in 2016 and saw partial Infura-related outages in November 2020. In 2016, an attack on The DAO also greatly affected Ethereum.\n\nusechatgpt init success"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA1LzExL2V0aGVyZXVtLWNvdWxkLWJlLWhlYWRpbmctdG8tb3Bwb3J0dW5pdHktem9uZS1hbWlkLW9uZS1oaXN0b3JpY2FsbHktYmVhcmlzaC1zaWduYWwtc2FudGltZW50L9IBggFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNS8xMS9ldGhlcmV1bS1jb3VsZC1iZS1oZWFkaW5nLXRvLW9wcG9ydHVuaXR5LXpvbmUtYW1pZC1vbmUtaGlzdG9yaWNhbGx5LWJlYXJpc2gtc2lnbmFsLXNhbnRpbWVudC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Ethereum Could Be Heading to ‘Opportunity Zone’ Amid One Historically Bearish Signal: Santiment - The Daily Hodl",
        "content": "One metric indicates Ethereum (ETH) could be heading into an “opportunity zone,” according to the crypto analytics firm Santiment.\n\nThe firm notes in a new analysis that ETH’s 30-day market value to realized value (MVRV), which traders use to detect overbought or oversold conditions, is now out of the “danger zone” and headed towards the “opportunity zone,” an area where ETH prices have historically bottomed out.\n\nMVRV is the ratio of an asset’s current market cap divided by its realized capitalization – i.e. the value of all measured ETH at the price they were bought. MVRV 30-Day is a timebound metric that only analyzes that ratio among tokens that have moved at least once in the past 30 days.\n\nSantiment also notes that ETH’s recent local price top coincided with the Ethereum Foundation moving 14,999 ETH to the crypto exchange Kraken over the weekend.\n\n“With the ETH foundation moving 14,999 coins to Kraken, an argument can be made that this move perfectly coincided with Ethereum’s local price top. Our insight covers the massive surge in active deposits & potential dip buy opportunities coming up.”\n\nThe last three times a significant amount of ETH left the Ethereum Foundation wallet, it marked local price tops, according to the analytics firm. Santiment does clarify, however, that Ethereum Foundation transactions prior to that did not indicate price tops.\n\nEthereum is trading at $1,831 at time of writing. The second-ranked crypto asset by market cap is up 1.86% in the past 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JlYWNvbi1jaGFpbi10ZW1wb3JhcmlseS1zdG9wcy1maW5hbGl6aW5n0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Ethereum's Beacon Chain Temporarily Stops Finalizing: Chain Consultant - Blockworks",
        "content": "Ethereum’s Beacon Chain temporarily stopped finalizing Thursday, according to a community health consultant of the blockchain.\n\nThe incident occurred at roughly 4 pm ET, according to tweets by the pseudonymous superphiz.eth.\n\n“I don’t know why yet, but in general the chain is designed to be resilient against this, transactions will continue as usual and finalization will kick in when the problem is resolved,” they tweeted.\n\nEthereum had a hard time reaching consensus, resulting in a brief, but drastic, downtick in validator participation on the consensus layer, according to Blockworks Research Senior Analyst Sam Martin.\n\n“This led to a period of time where Ethereum blocks were not being finalized, but blocks were still being validated as normal on the execution layer,” he added. “This is yet another instance that highlights the importance of client diversity amongst Ethereum’s validator set.”\n\nClient diversity refers to the need to have multiple independent clients to ensure the decentralization of a network.\n\nA follow-up tweet at about 4:50 pm ET suggested blocks were being finalized again.\n\nIf a consensus client has over 33% of its Ethereum nodes compromised, the Beacon Chain could stop finalizing.\n\nThis means that user transactions could be tampered with or changed, threatening the security of the Ethereum blockchain as a whole.\n\nHistorical precedent shows that having a diverse set of validators can prevent denial-of-service attacks. During the Shanghai denial-of-service attacks in 2016, attackers tricked the dominant client at the time (Geth) into slowing down block operations. Alternative clients who were not affected by the vulnerability were online at the time, and able to prevent Ethereum from being compromised.\n\nSuperphiz.eth said the loss of finalization might be “the first real-world test of our consensus client diversity work,” and called the incident “big, but inconsequential.”\n\n“Decentralization on all levels limits the impact of these events, regardless of what caused this we must continue hardening every vector,” superphiz.eth added.\n\nSuperphiz didn’t immediately return a request for comment.\n\nThe incident is currently being investigated by Ethereum developers and more information is expected to be revealed.\n\nLoading Tweet..\n\nUpdated May 11, 2023 at 5:54 pm ET: Added additional context and comments throughout.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMimAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1mYWxscy1iZWxvdy0yNzYwMC1wb2xrYWRvdC1saXRlY29pbi1yaXNlLXVwLXRvLTIvYXJ0aWNsZXNob3cvMTAwMTU1Mjc2LmNtc9IBnAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1mYWxscy1iZWxvdy0yNzYwMC1wb2xrYWRvdC1saXRlY29pbi1yaXNlLXVwLXRvLTIvYW1wX2FydGljbGVzaG93LzEwMDE1NTI3Ni5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin falls below $27,600, Polkadot, Litecoin rise up to 2% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nNew Delhi: The cryptocurrency markets were trading mixed on Thursday after the consumer price inflation in April rose at a slower-than-expected pace. Cardano, Solana, and Polkadot were trading with gains, while Bitcoin, Ethereum, and Polygon were trading with cuts.Bitcoin (BTC) declined 0.37% to $27,537, whereas Ethereum (ETH) was below the $1,850 level. Meanwhile, BTC volume stood at approximately $20.82 billion, rising 53.29% in the last 24 hours.\"The crypto market remained almost flat as encouraging CPI data showed that inflation is cooling down and we can expect relaxation of monetary policies in the future,\" Shivam Thakral, CEO of BuyUcoin, said.“Historically, BTC volatility increases around the inflation data release and we can see some fluctuations later today or during the week,” Thakral added.The global cryptocurrency market cap was trading lower around $1.14 trillion, falling 0.20% in the last 24 hours.The total volume in DeFi is currently 3.33 billion, 7.23% of the total crypto market 24-hour volume. The volume of all stablecoins is now $41.56 billion, which is 90.13% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, was around $533 billion. Bitcoin’s dominance is currently 46.92%, a decrease of 0.02% over the day, according to CoinMarketCap.\"The current trading range is $27,250 to $27,700. A break of the resistance can lead to $28,050 and even $28,650. Failure to do so may result in shortening with targets of $27,450 and $27,150,\" Sathvik Vishwanath, Co-Founder & CEO of Unocoin, saidRajagopal Menon, Vice President at WazirX said, \"Major market oscillators point to a neutral sentiment. The Relative Strength Index (14) sits at 42, with a neutral outlook. The Stochastic %K (14, 3, 3) at 21 and the Average Directional Index (14) at 18 indicate a Neutral outlook as well.\"\"The MACD Level (12, 26), at −168, indicates Sell. The Stochastic RSI Fast (3, 3, 14, 14) is Neutral at 0 and William's Percentage is Neutral at −77 as well,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com, data as of 1.01 hours, IST on May 11, 2023)Bitcoin $27,537 -0.37%Ethereum $1,836 -0.25%Tether $1.00 0.02% BNB $311 -0.03% XRP $0.4274 -0.17%Cardano $0.3651 0.69% Dogecoin $0.07267 -0.47%Polygon $0.8646 -1.41%Solana $20.67 0.49%Polkadot $5.45 2.15%Tron $0.6949 0.21% Litecoin $80.66 1.61%Shiba Inu $0.00000888 -0.56%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    }
]