[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL25ldy1lcmMtMjAtdG9rZW4tdm1weC10cmlnZ2Vycy1ldGhlcmV1bS1idXJuLXNwaWtlLWNvbnN1bWVzLTNtLWluLWdhcy1mZWVzLWluLTI0LWhvdXJzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jul 2023 07:00:00 GMT",
        "title": "New ERC-20 token VMPX triggers Ethereum burn spike, consumes $3M in gas fees in 24 hours - CryptoSlate",
        "content": "VMPX, a newly launched ERC-20 token, is responsible for over 30% of all Ethereum (ETH) burns in the last 24 hours, according to data from Ultrasound.money.\n\nSoftware engineer 0xCygaar first called attention to the project, claiming its minting contract had no purpose except to increase the network’s overall gas usage.\n\n“The top ETH gas guzzler is this contract where users make validators run useless/unnecessary code just to increase overall gas usage. People are literally burning their money to increase gas fees for everyone else.”\n\nQedk, a smart contract engineer at Polygon (MATIC), confirmed this, adding that the ERC-20 token would make users spend more gas if they want to mint more tokens.\n\nAccording to tweets from the project founder, Jack Levin, VMPX is the first ever BRC-20 token linked to Ethereum’s ERC-20 token. The project’s website states that its supply is 108.62 million but fails to provide additional information about its utility.\n\nVMPX consumed nearly $3M in gas fees\n\nMeanwhile, Etherscan data shows that the VMPX mint contract consumed over 1,500 ETH, around $3 million, in gas fees during the last 24 hours. This represents around 30% of all the gas fees spent during the period, above those generated by the Uniswap (UNI) decentralized exchange.\n\nHarrison, the co-founder of PopPunk, pointed out that those who minted the token paid gas fees as high as 1.36ETH.\n\nEigenPhi, a DeFi data platform, corroborated Harrison’s statement, adding that an average mint transaction of VMPX was 0.167ETH, around $317 per tx.\n\nThis high network activity saw Ethereum network fees jump to as high as 76.3 Gwei during the reporting period, according to Ultrasound.money.\n\nA representative from Push Protocol, the Ethereum messaging service, told CryptoSlate:\n\nGas fees still play a vital role in interacting with Ethereum and is probably one of the reason projects are moving to L2s or prefering off-chain yet verifiable executions.”\n\nMentioned in this article"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ldGhlcmV1bS11c2Vycy1idXJuaW5nLWV0aC1taW50LTAzNTc1NzI2NC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Users Have Been Burning ETH To Mint VMPX Tokens - Yahoo Finance",
        "content": "The smart contracts that account for the highest transaction fees on Ethereum are generally household names, so an unknown project topping the charts is an unusual event.\n\nThat’s what happened this week when users racing to use a smart contract to mint a token called VMPX pushed gas prices on Ethereum to their highest levels since May.\n\nEthereum Users Have Been Burning ETH To Mint VMPX Tokens\n\nVMPX is an asset designed to connect the Bitcoin and Ethereum blockchains, according to Jack Levin, the founder of the XEN ecosystem, a token with ties to VMPX.\n\n“We’re developing one of the first bridges between the world's largest crypto ecosystems, Bitcoin and Ethereum,” he told The Defiant, adding that holders will be able to stake VMPX in order to earn fees when people transfer assets between the two blockchains.\n\nVMPX led all contracts in terms of burned ETH as of July 6, putting it ahead of typical gas guzzlers like Uniswap and the USDT stablecoin.\n\nEthereum Users Have Been Burning ETH To Mint VMPX Tokens\n\n$90M Burned\n\nProjects in the XEN ecosystem have spiked gas before.\n\nXENTorrent, another project in the ecosystem, accounted for 11% of gas usage in April. XEN also pushed ETH to become a deflationary asset in October 2022.\n\n“I think in total, we burned about $90 million dollars worth of ETH so far,” Levin said.\n\nXEN is an outlier as a project — while most crypto ventures tend to at least have some affiliation with a specific blockchain to begin with, XEN has been multichain from the start.\n\nIn fact, across major blockchains like Avalanche, Polygon, BNB Chain, and Fantom, XEN is either the number one or number two token in terms of how many addresses have sent or received it.\n\nThis week’s mint was for a version of VMPX on Ethereum. A version of VMPX using the emerging Bitcoin standard called BRC-20 already exists and has a $7.8M market capitalization, according to BitX, an exchange and data provider.\n\nLevin said that he wanted to expand XEN to Bitcoin, but it wasn’t feasible due to the blockchain’s design. “We thought okay, we need to launch a XEN-like product, but it cannot be called XEN because it will not have the same economics,” he said.\n\nStory continues\n\nSimulated PoW\n\nLevin said that they wrote the code for VMPX’s launch on Ethereum, to mimic how Bitcoin’s Proof-of-Work system works.\n\nLike many projects in crypto, XEN and VMPX, are experimental, with utility that isn’t entirely clear. Levin likened XEN to a currency in a game like Monopoly board game.\n\n“It’s like a marketing token that gets you crypto without you needing to buy it from anyone,” he said. “You come to the smart contract and mint it yourself.”\n\nNotably, XEN doesn’t have a “premine,” a preset amount of tokens allocated to investors and early contributors. “We wanted to go back to the roots of Bitcoin creation, which never had to raise any money,” Levin said."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ldGhlcmV1bS11c2Vycy1idXJuaW5nLWV0aC1taW50LTAzNTc1NzI2NC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Users Have Been Burning ETH To Mint VMPX Tokens - Yahoo Finance",
        "content": "The smart contracts that account for the highest transaction fees on Ethereum are generally household names, so an unknown project topping the charts is an unusual event.\n\nThat’s what happened this week when users racing to use a smart contract to mint a token called VMPX pushed gas prices on Ethereum to their highest levels since May.\n\nEthereum Users Have Been Burning ETH To Mint VMPX Tokens\n\nVMPX is an asset designed to connect the Bitcoin and Ethereum blockchains, according to Jack Levin, the founder of the XEN ecosystem, a token with ties to VMPX.\n\n“We’re developing one of the first bridges between the world's largest crypto ecosystems, Bitcoin and Ethereum,” he told The Defiant, adding that holders will be able to stake VMPX in order to earn fees when people transfer assets between the two blockchains.\n\nVMPX led all contracts in terms of burned ETH as of July 6, putting it ahead of typical gas guzzlers like Uniswap and the USDT stablecoin.\n\nEthereum Users Have Been Burning ETH To Mint VMPX Tokens\n\n$90M Burned\n\nProjects in the XEN ecosystem have spiked gas before.\n\nXENTorrent, another project in the ecosystem, accounted for 11% of gas usage in April. XEN also pushed ETH to become a deflationary asset in October 2022.\n\n“I think in total, we burned about $90 million dollars worth of ETH so far,” Levin said.\n\nXEN is an outlier as a project — while most crypto ventures tend to at least have some affiliation with a specific blockchain to begin with, XEN has been multichain from the start.\n\nIn fact, across major blockchains like Avalanche, Polygon, BNB Chain, and Fantom, XEN is either the number one or number two token in terms of how many addresses have sent or received it.\n\nThis week’s mint was for a version of VMPX on Ethereum. A version of VMPX using the emerging Bitcoin standard called BRC-20 already exists and has a $7.8M market capitalization, according to BitX, an exchange and data provider.\n\nLevin said that he wanted to expand XEN to Bitcoin, but it wasn’t feasible due to the blockchain’s design. “We thought okay, we need to launch a XEN-like product, but it cannot be called XEN because it will not have the same economics,” he said.\n\nStory continues\n\nSimulated PoW\n\nLevin said that they wrote the code for VMPX’s launch on Ethereum, to mimic how Bitcoin’s Proof-of-Work system works.\n\nLike many projects in crypto, XEN and VMPX, are experimental, with utility that isn’t entirely clear. Levin likened XEN to a currency in a game like Monopoly board game.\n\n“It’s like a marketing token that gets you crypto without you needing to buy it from anyone,” he said. “You come to the smart contract and mint it yourself.”\n\nNotably, XEN doesn’t have a “premine,” a preset amount of tokens allocated to investors and early contributors. “We wanted to go back to the roots of Bitcoin creation, which never had to raise any money,” Levin said."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ldGhlcmV1bS11c2Vycy1idXJuaW5nLWV0aC1taW50LTAzNTc1NzI2NC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Users Have Been Burning ETH To Mint VMPX Tokens - Yahoo Finance",
        "content": "The smart contracts that account for the highest transaction fees on Ethereum are generally household names, so an unknown project topping the charts is an unusual event.\n\nThat’s what happened this week when users racing to use a smart contract to mint a token called VMPX pushed gas prices on Ethereum to their highest levels since May.\n\nEthereum Users Have Been Burning ETH To Mint VMPX Tokens\n\nVMPX is an asset designed to connect the Bitcoin and Ethereum blockchains, according to Jack Levin, the founder of the XEN ecosystem, a token with ties to VMPX.\n\n“We’re developing one of the first bridges between the world's largest crypto ecosystems, Bitcoin and Ethereum,” he told The Defiant, adding that holders will be able to stake VMPX in order to earn fees when people transfer assets between the two blockchains.\n\nVMPX led all contracts in terms of burned ETH as of July 6, putting it ahead of typical gas guzzlers like Uniswap and the USDT stablecoin.\n\nEthereum Users Have Been Burning ETH To Mint VMPX Tokens\n\n$90M Burned\n\nProjects in the XEN ecosystem have spiked gas before.\n\nXENTorrent, another project in the ecosystem, accounted for 11% of gas usage in April. XEN also pushed ETH to become a deflationary asset in October 2022.\n\n“I think in total, we burned about $90 million dollars worth of ETH so far,” Levin said.\n\nXEN is an outlier as a project — while most crypto ventures tend to at least have some affiliation with a specific blockchain to begin with, XEN has been multichain from the start.\n\nIn fact, across major blockchains like Avalanche, Polygon, BNB Chain, and Fantom, XEN is either the number one or number two token in terms of how many addresses have sent or received it.\n\nThis week’s mint was for a version of VMPX on Ethereum. A version of VMPX using the emerging Bitcoin standard called BRC-20 already exists and has a $7.8M market capitalization, according to BitX, an exchange and data provider.\n\nLevin said that he wanted to expand XEN to Bitcoin, but it wasn’t feasible due to the blockchain’s design. “We thought okay, we need to launch a XEN-like product, but it cannot be called XEN because it will not have the same economics,” he said.\n\nStory continues\n\nSimulated PoW\n\nLevin said that they wrote the code for VMPX’s launch on Ethereum, to mimic how Bitcoin’s Proof-of-Work system works.\n\nLike many projects in crypto, XEN and VMPX, are experimental, with utility that isn’t entirely clear. Levin likened XEN to a currency in a game like Monopoly board game.\n\n“It’s like a marketing token that gets you crypto without you needing to buy it from anyone,” he said. “You come to the smart contract and mint it yourself.”\n\nNotably, XEN doesn’t have a “premine,” a preset amount of tokens allocated to investors and early contributors. “We wanted to go back to the roots of Bitcoin creation, which never had to raise any money,” Levin said."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy80LXJlYXNvbnMtZXRoZXJldW0tcHJpY2UtY2FudC1icmVhay0xLTk3MNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jul 2023 07:00:00 GMT",
        "title": "4 reasons why the Ether price can't break $1,970 - Cointelegraph",
        "content": "Ether’s price faced resistance after hitting the $1,970 level on July 3. A number of factors capped the rally, including higher odds of more interest rate hikes in the coming months and a tighter regulatory cryptocurrency environment.\n\nMacro headwinds from the Fed\n\nBesides the external factors, the Ethereum network has faced withdrawals from its smart contract applications, which also put the June rally in check.\n\nInvestors now question whether tailwinds from requests for a spot Bitcoin (BTC) exchange-traded fund have faded, opening room for an Ether (ETH) correction down to the $1,700 level last seen on June 16.\n\nThe recent macroeconomic events may provide some hints, including the fact that the gross domestic product grew in the United States by an annualized 2% rate in the first quarter, Germany’s Consumer Price Index increased 6.8% in June versus the previous year, and China’s Caixin Global purchasing managers’ index reported activity expansion.\n\nThus, strong economic indicators have heightened investors’ expectations of further tightening measures from the U.S. Federal Reserve.\n\nFed Chair Jerome Powell’s suggestion of two more interest rate hikes in 2023, coupled with the increasing cost of capital and higher returns on fixed-income investments, have diminished interest in cryptocurrencies.\n\nOn the regulatory front, the most pressing news and events included:\n\nJune 28: European Union lawmakers moved ahead with the controversial Data Act, imposing requirements for smart contracts, including kill switches, that allow them to be safely terminated and rules for providing shareable data.\n\nEuropean Union lawmakers moved ahead with the controversial Data Act, imposing requirements for smart contracts, including kill switches, that allow them to be safely terminated and rules for providing shareable data. July 4: Binance Australia had its corporate offices searched by local authorities, part of an ongoing probe of its derivatives business, whose license was shut down in April 2023.\n\nTVL nears three-year lows as network demand falls\n\nThe Ethereum network is likely facing its own challenges, particularly after co-founder Vitalik Buterin stated on June 29 that he does not stake all of his Ether due to the complexities associated with multisignature wallets.\n\nEthereum network total smart contract deposits in ETH terms. Source: DefiLlama\n\nThe total value locked (TVL), which measures the deposits locked in Ethereum’s smart contracts, reached its lowest level since August 2020. The indicator declined by 3.1% to 13.7 million Ether in the 30 days leading up to July 4, according to DefiLlama.\n\nA lower TVL means either investors are losing interest in the network’s smart contract use or have moved to layer-2 alternatives in search of lower transaction fees. Either way, the potential demand for the Ethereum network is negatively impacted, which is being interpreted as bearish.\n\nETH price gains fueled by leveraged longs\n\nAnalyzing the positions of professional traders in ETH derivatives is crucial to determining the likelihood of Ether’s price surpassing the $1,970 resistance level.\n\nThere are occasional methodological discrepancies between different exchanges, so readers should monitor changes instead of absolute figures.\n\nETH top traders' futures long-to-short ratio. Source: CoinGlass\n\nDespite Ether trading within a narrow range of $1,815 to $1,975 since June 22, professional traders have increased their leveraged long positions in futures, as indicated by the long-to-short ratio.\n\nAt crypto exchange Binance, the long-to-short ratio sharply increased, from 1.14 on June 20 to 1.30 on July 4. Similarly, at OKX, the long-to-short ratio increased from 0.76 on June 20 to a 2.25 peak on July 4, favoring leveraged longs.\n\nTo exclude externalities that might have solely impacted Ether futures, one should analyze the ETH options markets. The 25% delta skew indicator compares similar call (buy) and put (sell) options and will turn positive when fear is prevalent because the protective put option premium is higher than the call options.\n\nEther 30-day 25% delta skew. Source: Laevitas\n\nThe skew indicator will move above 8% if traders fear an Ether price crash. On the other hand, generalized excitement reflects a negative 8% skew.\n\nAs displayed above, the delta skew flirted with moderate optimism between July 3 and July 4 but was unable to sustain such a level. Presently, the negative 2% metric displays a balanced demand for call and put options.\n\nRelated: The Supreme Court could stop the SEC’s war on crypto\n\nETH at $1,700 might be distant, but so is $2,000\n\nConsidering these four reasons — namely, increased leverage long-to-short ratio, declining TVL, potential interest rate increases and tighter cryptocurrency regulation — ETH bears are in a better position to hold back the positive price impact coming from the Bitcoin ETF saga.\n\nAlthough these factors may not be sufficient to drive ETH’s price down to $1,700, they present significant obstacles for ETH bulls. Notably, the previous attempt to break $2,000 on April 13 lasted less than a week. Therefore, in the short term, bears have better odds of successfully defending the $1,970 resistance.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    }
]