[
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA1LTI1L2V4cGxhaW5pbmctd2h5LXBlcGUtZnJvZy1tZW1lY29pbi1jcnlwdG8tY3JhemUtaXMtYS1zdHJlc3MtdGVzdC1mb3ItYml0Y29pbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 May 2023 07:00:00 GMT",
        "title": "Popular Pepe Frog Memecoin NFT Puts Pressure on Bitcoin (BTC) Value - Bloomberg",
        "content": "Bitcoin may be the most widely recognized name in crypto, but its chief rival Ethereum has cornered a bigger share of the recent innovation in digital assets, whether it’s nonfungible tokens or decentralized finance apps. That’s because Ethereum’s underlying software is seen as more versatile and better able to handle bursts of activity without getting clogged up and slowing down. Now Bitcoin finds itself playing host to crypto’s latest speculative frenzy, a frog-branded “memecoin” called Pepe, putting the original crypto network’s technology under strain.\n\nMemecoins are digital tokens depicted with an image — often an animated character or animal — that can quickly gain notoriety and soar in value. Although they have little practical use, they can draw an exuberant community of followers who hoard or trade them. (The name takes its cue from so-called meme stocks, such as Gamestop Corp., that were seized upon by retail traders during the pandemic and driven to stratospheric valuations based on social media chatter.) There are hundreds of memecoins, some worth almost nothing, others with market values of $100 million or more. Investors often leap upon a newly minted memecoin when it starts trading on a digital exchange such as Coinbase or Robinhood. Others pile in after them for fear of missing out. One famous memecoin, Dogecoin, ascended to stardom when Elon Musk tweeted memes based on the coin, which inspired a number of dog-themed memecoins such as Shiba Inu."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA1LTI1L2V4cGxhaW5pbmctd2h5LXBlcGUtZnJvZy1tZW1lY29pbi1jcnlwdG8tY3JhemUtaXMtYS1zdHJlc3MtdGVzdC1mb3ItYml0Y29pbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 May 2023 07:00:00 GMT",
        "title": "Popular Pepe Frog Memecoin NFT Puts Pressure on Bitcoin (BTC) Value - Bloomberg",
        "content": "Bitcoin may be the most widely recognized name in crypto, but its chief rival Ethereum has cornered a bigger share of the recent innovation in digital assets, whether it’s nonfungible tokens or decentralized finance apps. That’s because Ethereum’s underlying software is seen as more versatile and better able to handle bursts of activity without getting clogged up and slowing down. Now Bitcoin finds itself playing host to crypto’s latest speculative frenzy, a frog-branded “memecoin” called Pepe, putting the original crypto network’s technology under strain.\n\nMemecoins are digital tokens depicted with an image — often an animated character or animal — that can quickly gain notoriety and soar in value. Although they have little practical use, they can draw an exuberant community of followers who hoard or trade them. (The name takes its cue from so-called meme stocks, such as Gamestop Corp., that were seized upon by retail traders during the pandemic and driven to stratospheric valuations based on social media chatter.) There are hundreds of memecoins, some worth almost nothing, others with market values of $100 million or more. Investors often leap upon a newly minted memecoin when it starts trading on a digital exchange such as Coinbase or Robinhood. Others pile in after them for fear of missing out. One famous memecoin, Dogecoin, ascended to stardom when Elon Musk tweeted memes based on the coin, which inspired a number of dog-themed memecoins such as Shiba Inu."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vZGVjcnlwdC5jby8xNDI0MTMvYml0Y29pbi1ldGhlcmV1bS1pZi11cy1kZWZhdWx0cy1vbi1kZWJ00gFHaHR0cHM6Ly9kZWNyeXB0LmNvLzE0MjQxMy9iaXRjb2luLWV0aGVyZXVtLWlmLXVzLWRlZmF1bHRzLW9uLWRlYnQ_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 May 2023 07:00:00 GMT",
        "title": "What Happens to Bitcoin and Ethereum If the US Defaults on Its Debt? - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe United States is barreling toward a date that could have historic consequences for global markets, running the risk of its first-ever debt default. It's a potential black swan event that could have an outsized impact on Bitcoin, Ethereum, and the rest of the crypto market.\n\nU.S. Treasury Secretary Janet Yellen warned weeks ago that the government would soon run out of funds if the debt ceiling isn’t suspended or raised—possibly as early as June 1. If lawmakers remain deadlocked and can’t come to an agreement on spending, Washington won’t be able to pay its bills, she said.\n\nSimilar standoffs over the debt ceiling have rattled markets in the past, like a prolonged disagreement over the debt ceiling that sent the S&P 500 tumbling 16% in 2011, startling investors before a resolution was reached.\n\nAD\n\nAD\n\nThis time around, Wall Street has yawned. The S&P 500 is down less than 1% since Yellen issued her sobering remarks on May 1. However, Bitcoin has fallen more than 7% and Ethereum is down nearly 3% during the same period, according to CoinGecko.\n\nAmerica's “X-date”\n\nTypically, debt ceiling debacles create more noise than market-moving news, Amberdata’s Director of Derivatives Greg Magadini told Decrypt—but he acknowledged that a U.S. debt default is far from off the table.\n\n“It feels like a pretty intense game of chicken right now,” he said. “And given how crazy things have gone in the past couple of years, I think anything is possible.”\n\nIn the event that the government defaults on its debts, risk assets like stocks and crypto would face short-term pain, Magadini said. He explained that’s because a drop in the quality of government-backed debt would likely raise borrowing costs, counterintuitively increasing its yield and strengthening the dollar compared to other assets.\n\nSimilarly, the dollar could strengthen during a U.S. default as American traders tend to onshore their dollars—swapping foreign currencies and assets for the greenback—during risk-off events, CoinShares’ Head of Research James Butterfill told Decrypt.\n\nAD\n\nAD\n\n“Technically speaking, the dollar should sell off in the event of a default, but it won't because people tend to onshore their dollars in periods of market stress,” he said. “The dollar might actually strengthen, perversely, because people are getting worried, and that actually won’t be so great for Bitcoin.”\n\nButterfill envisions the dollar will strengthen and Bitcoin will slide as the U.S. approaches what the White House has described as America's “X-date,” the official date at which the government can no longer pay its bills.\n\n“This is a really complicated scenario,” Butterfill said, noting he doesn’t think a default is likely. “It’s not that obvious what exactly will happen.”\n\nBitcoin May Bounce\n\nBitcoin and Ethereum could react differently in the event of a default, Amberdata’s Magadini said. Bitcoin may bounce alongside gold after an initial slide—as a check on government-issued currency—while Ethereum would likely remain depressed alongside tech stocks, he said.\n\nThe sentiment was echoed by Genesis’ Co-Head of Trading Gordon Grant, who told Decrypt that Bitcoin has more upside than Ethereum if the government can no longer meet its debt obligations, but both coins would face pressure initially.\n\n“Maybe there's an initial wick down, as risk assets get absolutely trounced, because the stock market is going to get decimated,” he said. “But Bitcoin is probably going higher.”\n\nFor Ethereum, Grant said that the second largest crypto by market cap is often tied to indexes tracking tech stocks like the NASDAQ, making it likely to underperform compared to Bitcoin if a default takes place.\n\n“It doesn't matter whether I think that that's a fair comparison,” he said, noting that that’s how certain models trade the relationship between things like the NASDAQ and Ethereum. “So, we would tend to expect underperformance of Ethereum.”\n\nAD\n\nAD\n\nSVB and Sausage\n\nAs an example of how crypto has performed during recent risk-off events, Grant pointed to Bitcoin’s outsized gains compared to Ethereum in the wake of several bank collapses in March, including Silicon Valley Bank. However, he noted that there’s zero data to suggest how cryptocurrencies could react if the government defaults for the first time in history.\n\nBoth Grant and Magadini highlighted increased activity in the options market for Bitcoin as a potential default draws closer, saying it suggests that traders—mostly institutional ones—are betting the coin will see increased volatility.\n\nAt the end of the day, Grant said he’s confident that lawmakers will exhaust their differences on Capitol Hill and reach an agreement like they always have. But, pointing to the logic of Bloomberg’s Tom Keene, Grant said the bigger question is whether events like these become more common in an ever-more-polarized political climate, and if they’ll ever go away.\n\n“We can ruminate and pontificate, but the real story is this phenomenon of the US government, as a debtor nation, bumping up against a debt ceiling,” Grant said, adding it’s become “how the sausage gets made in the 21st century.”"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMilgFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vaW5kdXN0cnkvYmFua2luZy9maW5hbmNlL3VubG9ja2luZy10aGUtcG90ZW50aWFsLWJlc3QtbHNkLWNyeXB0by10b2tlbnMtdG8tYWRkLXRvLXlvdXItcG9ydGZvbGlvL2FydGljbGVzaG93LzEwMDUwNTg4OS5jbXPSAZoBaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL2luZHVzdHJ5L2JhbmtpbmcvZmluYW5jZS91bmxvY2tpbmctdGhlLXBvdGVudGlhbC1iZXN0LWxzZC1jcnlwdG8tdG9rZW5zLXRvLWFkZC10by15b3VyLXBvcnRmb2xpby9hbXBfYXJ0aWNsZXNob3cvMTAwNTA1ODg5LmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 May 2023 07:00:00 GMT",
        "title": "Unlocking the Potential: Best LSD Crypto Tokens to Add to Your Portfolio - The Economic Times",
        "content": "Thanks to the recent Ethereum Shanghai upgrade, liquid staking derivatives (LSDs) have become the latest trend in the decentralized finance space (DeFi), offering stakers unconventional ways to unlock liquidity for their staked crypto assets and earn additional yields.\n\nLiquid staking derivatives are gaining momentum across the Ethereum network and have the potential to dominate other ecosystems, including major layer-1 blockchains like Avalanche and Polygon.\n\nRecent data from DeFiLlama shows that approximately $17.99 billion is currently locked up in LSDs, with Lido (currently the largest liquid staking protocol) dominating the space with approximately $11.95 billion total value locked (TVL).\n\nFollowing the major ethereum upgrade (also known as the Shanghai or Shapella upgrade), there has been a sharp rise in interest in LSDs, which has led to a surge in cash flow in DeFi and made staking more accessible to a lot of people who can now take advantage of both staking rewards and liquidity. The upgrade enables withdrawals from Ethereum staking contracts, significantly reducing the risk of holding staked Ethereum (stETH).\n\nWhat are liquid staking derivatives (LSDs)?\n\nLiquid Staking Derivatives (or Liquid Staking Tokens) are a unique kind of token that allows stakers to earn yield without losing the liquidity of their staked assets. These liquid tokens can be used in various ways; they can be sold, traded or used in Defi applications just like regular ETH.Staking tokens in proof-of-stake blockchains means locking tokens as collateral to secure the network and earn rewards, however, due to the lock-up nature, these tokens become illiquid.\n\nThe Ethereum Shanghai Upgrade Revolution\n\nAfter the merge in September 2022, ethereum blockchain successfully swapped from Proof-of-Work (PoW) consensus mechanism to Proof-of-Stake (PoS) mechanism. By moving from PoW to PoS, the Ethereum blockchain now relies on validators instead of miners to run it.\n\nSince the launch of Ethereum's Beacon Chain in December 2020, the first phase of the PoS transition, individuals could stake their ETH and serve as validators to process transactions and secure the network. To become a validator, stakers needed a specialized hardware and at least 32 ETH stake to run nodes themselves and receive rewards in blocks. However, they were unable to unstake their tokens and withdraw their rewards. Thanks to the Ethereum Shanghai upgrade, validators can now unstake their staked ETH and withdraw their rewards.\n\nWhy are LSD tokens on the Rise?\n\nThe recent upgrade includes a code referred to as EIP 4895, which allows Beacon Chain staked ETH withdrawals, enabling a 1:1 exchange of staked Ether for Ether. With this development, ETH holders can now stake their tokens through liquid staking pools to generate yields, thus increasing the demand for LSDs and triggering rapid growth in DeFi TVL.\n\nLiquid staking derivatives solve the problem of capital inefficiency by providing users with a liquid and usable token representing their staked asset. They also eliminate the 32 ETH entry barrier, enabling anyone to stake any amount of ETH they can afford in exchange for additional yields.\n\nBest LSD Crypto Tokens In 2023\n\nLSD tokens have quickly become the biggest crypto trend in 2023. As such, an increasing number of DeFi protocols have rolled out to offer a more flexible way to stake and earn by providing LSDs.\n\nCurrently, 18.5 million ETH (~33.40 billion) are being staked in liquid staking pools. The annual percentage rate (APR) for staking ETH currently sits at around 8.98% today.\n\nAs Ethereum staking ratio increases, the use cases for liquid staking protocols and their tokens will also increase. Here are some of the best LSD protocols and their tokens for ETH holders looking to earn yield through staking.\n\n1) Lido ($LDO)\n\nAs a crypto trader, this is one of the best LSD tokens in the market to look out for. Lido is currently the largest liquid staking protocol dominating the space with an estimated $11.95 billion TVL at the time of writing. It has a market cap of about $2 billion, 85% of the total 1 billion LDO tokens are already in circulation.\n\nLido allows users to stake their ETH and earn additional rewards - with no lock ups and daily rewards. It supports Ethereum, Solana, Polygon, Terra, Kusama and Polkadot.\n\nLDO – the native utility token, is used for granting governance rights and managing fee distribution. The token is available for trading on various exchanges, with cryptocurrency and stablecoin pairs currently available.\n\nWith LSDs on the rise, LDO has the potential to offer higher annual yield and market share than other protocols.\n\n2) Rocket Pool ($RPL)\n\nRocket Pool is one of the largest decentralized Ethereum LSD protocols after the Lido protocol. The protocol aims to reduce both the capital and hardware requirements for staking on ETH 2.0, adding to the decentralization and security of Ethereum.\n\nRPL is the ERC-20 utility token of Rocket Pool, and it's used to govern the PDAO and can be staked by node operators.\n\nUsers can run their own nodes with only 16 ETH and 1.6 ETH worth of RPL. Node operators stake RPL as insurance, where users stake Ether and receive rETH, a liquid ERC-20 token, in return. This token automatically accrues staking rewards based on the performance of the entire network of node operators.\n\nOn Rocket Pool, node operatives receive a delegation of 15 per cent, which covers their operational costs and incentivizes them to provide high quality services to their users.\n\nThe current Rocket Pool market capis $958,730,935 with a circulating supply of 19,401,735 RPL. Over the last year, Rocket Pool price has increased by 102.20%. During the last month, the price of RPL has risen by 5.09%.\n\nRPL is available on UniSwap (V3), Hoo, BKEX, XT.COM, Hotbit, and Bvnex.\n\n3) Tenet Protocol ($TENET)\n\nTenet, the first layer-1 blockchain to create a DeFi ecosystem for LSDs. The DeFi ecosystem implants a unique model called Diversified Proof of Stake (DiPoS), which supports staking with any LSD asset from other chains, such as ETH, BNB, ATOM, SOL and ADA. As such, Tenet becomes partially secured by all its supported networks, thus improving security compared to standard single-token Proof of Stake.\n\n$TENET is the native token of TENET. It is used at the base layer of the blockchain to pay for transaction execution as a gas token. TENET can also be staked in a Validator to secure the blockchain through TENET's revolutionary DiPoS--mechanism. When you stake TENET you will receive an LSD of TENET called tTENET. tTenet also needs to be locked up with the corresponding staking provider to receive Validation rewards from securing the blockchain.\n\nBy participating in Tenet validation and earning network transaction fees with LSDs like stETH and cbETH, one can still benefit from the ETH staking yield that these LSDs provide.\n\nThe platform offers a zero management fee, that is, it eliminates the 10% management fee charged by protocols like Lido, as a form of security incentivization.\n\nWith its unique blockchain mechanism and utility, the token is sure to be a promising one with significant use cases.\n\n4) Ankr ($ANKR)\n\nAnkr is a leading blockchain infrastructure provider which offers multi-chain API connections and runs RPC nodes besides staking solutions. The LSD protocol aims to make the adoption of Web3 easier by offering a platform where users can deploy nodes on PoS blockchains, stake their PoS tokens and access decentralized finance (DeFi) applications.\n\nANKR, the native utility and governance token of Ankr, has many use cases, including as payment for services within the Ankr ecosystem and as a means of earning passive income by staking. The Ethereum token can be used for on-chain governance and also as an insurance for network participants.\n\nWith a market cap of over $250 million and a maximum supply of 10 billion (100%), Ankr is one of the largest Ethereum staker and go-to staking infrastructure providers for ecosystems like the BNB, Polygon, and more.\n\nConclusion\n\nThe Shanghai upgrade helped to bring back confidence in the Ethereum blockchain and served as fuel for LSD protocols. Issues like capital inefficiency and lock up periods that made stakes illiquid are now being resolved with the emergence of LSD protocols. By providing liquidity and yield opportunities for stakers, these protocols are unlocking the potential of the rapidly growing LSD market.\n\nDisclaimer\n\nThis is an advertorial. BCCL disclaims any and all warranties - expressed or implied - relating to the content and does not guarantee, vouch for, or endorse any of the content. The content does not promote, suggest or present Crypto products to be a way to solve financial difficulties / achieve financial security / act as an alternative to employment / income opportunity. Crypto products, crypto currencies, NFTs are unregulated and may be risky, with no legal recourse in case of monetary loss. Views expressed herein are independent opinions based on studies. You may act at your own risk while relying on the content of this advertorial. Should you make a decision to act, or omit to act, you should seek appropriate legal advice in the relevant jurisdiction.\n\nDisclaimer: Content Produced by Heylin Spark"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMilgFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vaW5kdXN0cnkvYmFua2luZy9maW5hbmNlL3VubG9ja2luZy10aGUtcG90ZW50aWFsLWJlc3QtbHNkLWNyeXB0by10b2tlbnMtdG8tYWRkLXRvLXlvdXItcG9ydGZvbGlvL2FydGljbGVzaG93LzEwMDUwNTg4OS5jbXPSAZoBaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL2luZHVzdHJ5L2JhbmtpbmcvZmluYW5jZS91bmxvY2tpbmctdGhlLXBvdGVudGlhbC1iZXN0LWxzZC1jcnlwdG8tdG9rZW5zLXRvLWFkZC10by15b3VyLXBvcnRmb2xpby9hbXBfYXJ0aWNsZXNob3cvMTAwNTA1ODg5LmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 May 2023 07:00:00 GMT",
        "title": "Unlocking the Potential: Best LSD Crypto Tokens to Add to Your Portfolio - The Economic Times",
        "content": "Thanks to the recent Ethereum Shanghai upgrade, liquid staking derivatives (LSDs) have become the latest trend in the decentralized finance space (DeFi), offering stakers unconventional ways to unlock liquidity for their staked crypto assets and earn additional yields.\n\nLiquid staking derivatives are gaining momentum across the Ethereum network and have the potential to dominate other ecosystems, including major layer-1 blockchains like Avalanche and Polygon.\n\nRecent data from DeFiLlama shows that approximately $17.99 billion is currently locked up in LSDs, with Lido (currently the largest liquid staking protocol) dominating the space with approximately $11.95 billion total value locked (TVL).\n\nFollowing the major ethereum upgrade (also known as the Shanghai or Shapella upgrade), there has been a sharp rise in interest in LSDs, which has led to a surge in cash flow in DeFi and made staking more accessible to a lot of people who can now take advantage of both staking rewards and liquidity. The upgrade enables withdrawals from Ethereum staking contracts, significantly reducing the risk of holding staked Ethereum (stETH).\n\nWhat are liquid staking derivatives (LSDs)?\n\nLiquid Staking Derivatives (or Liquid Staking Tokens) are a unique kind of token that allows stakers to earn yield without losing the liquidity of their staked assets. These liquid tokens can be used in various ways; they can be sold, traded or used in Defi applications just like regular ETH.Staking tokens in proof-of-stake blockchains means locking tokens as collateral to secure the network and earn rewards, however, due to the lock-up nature, these tokens become illiquid.\n\nThe Ethereum Shanghai Upgrade Revolution\n\nAfter the merge in September 2022, ethereum blockchain successfully swapped from Proof-of-Work (PoW) consensus mechanism to Proof-of-Stake (PoS) mechanism. By moving from PoW to PoS, the Ethereum blockchain now relies on validators instead of miners to run it.\n\nSince the launch of Ethereum's Beacon Chain in December 2020, the first phase of the PoS transition, individuals could stake their ETH and serve as validators to process transactions and secure the network. To become a validator, stakers needed a specialized hardware and at least 32 ETH stake to run nodes themselves and receive rewards in blocks. However, they were unable to unstake their tokens and withdraw their rewards. Thanks to the Ethereum Shanghai upgrade, validators can now unstake their staked ETH and withdraw their rewards.\n\nWhy are LSD tokens on the Rise?\n\nThe recent upgrade includes a code referred to as EIP 4895, which allows Beacon Chain staked ETH withdrawals, enabling a 1:1 exchange of staked Ether for Ether. With this development, ETH holders can now stake their tokens through liquid staking pools to generate yields, thus increasing the demand for LSDs and triggering rapid growth in DeFi TVL.\n\nLiquid staking derivatives solve the problem of capital inefficiency by providing users with a liquid and usable token representing their staked asset. They also eliminate the 32 ETH entry barrier, enabling anyone to stake any amount of ETH they can afford in exchange for additional yields.\n\nBest LSD Crypto Tokens In 2023\n\nLSD tokens have quickly become the biggest crypto trend in 2023. As such, an increasing number of DeFi protocols have rolled out to offer a more flexible way to stake and earn by providing LSDs.\n\nCurrently, 18.5 million ETH (~33.40 billion) are being staked in liquid staking pools. The annual percentage rate (APR) for staking ETH currently sits at around 8.98% today.\n\nAs Ethereum staking ratio increases, the use cases for liquid staking protocols and their tokens will also increase. Here are some of the best LSD protocols and their tokens for ETH holders looking to earn yield through staking.\n\n1) Lido ($LDO)\n\nAs a crypto trader, this is one of the best LSD tokens in the market to look out for. Lido is currently the largest liquid staking protocol dominating the space with an estimated $11.95 billion TVL at the time of writing. It has a market cap of about $2 billion, 85% of the total 1 billion LDO tokens are already in circulation.\n\nLido allows users to stake their ETH and earn additional rewards - with no lock ups and daily rewards. It supports Ethereum, Solana, Polygon, Terra, Kusama and Polkadot.\n\nLDO – the native utility token, is used for granting governance rights and managing fee distribution. The token is available for trading on various exchanges, with cryptocurrency and stablecoin pairs currently available.\n\nWith LSDs on the rise, LDO has the potential to offer higher annual yield and market share than other protocols.\n\n2) Rocket Pool ($RPL)\n\nRocket Pool is one of the largest decentralized Ethereum LSD protocols after the Lido protocol. The protocol aims to reduce both the capital and hardware requirements for staking on ETH 2.0, adding to the decentralization and security of Ethereum.\n\nRPL is the ERC-20 utility token of Rocket Pool, and it's used to govern the PDAO and can be staked by node operators.\n\nUsers can run their own nodes with only 16 ETH and 1.6 ETH worth of RPL. Node operators stake RPL as insurance, where users stake Ether and receive rETH, a liquid ERC-20 token, in return. This token automatically accrues staking rewards based on the performance of the entire network of node operators.\n\nOn Rocket Pool, node operatives receive a delegation of 15 per cent, which covers their operational costs and incentivizes them to provide high quality services to their users.\n\nThe current Rocket Pool market capis $958,730,935 with a circulating supply of 19,401,735 RPL. Over the last year, Rocket Pool price has increased by 102.20%. During the last month, the price of RPL has risen by 5.09%.\n\nRPL is available on UniSwap (V3), Hoo, BKEX, XT.COM, Hotbit, and Bvnex.\n\n3) Tenet Protocol ($TENET)\n\nTenet, the first layer-1 blockchain to create a DeFi ecosystem for LSDs. The DeFi ecosystem implants a unique model called Diversified Proof of Stake (DiPoS), which supports staking with any LSD asset from other chains, such as ETH, BNB, ATOM, SOL and ADA. As such, Tenet becomes partially secured by all its supported networks, thus improving security compared to standard single-token Proof of Stake.\n\n$TENET is the native token of TENET. It is used at the base layer of the blockchain to pay for transaction execution as a gas token. TENET can also be staked in a Validator to secure the blockchain through TENET's revolutionary DiPoS--mechanism. When you stake TENET you will receive an LSD of TENET called tTENET. tTenet also needs to be locked up with the corresponding staking provider to receive Validation rewards from securing the blockchain.\n\nBy participating in Tenet validation and earning network transaction fees with LSDs like stETH and cbETH, one can still benefit from the ETH staking yield that these LSDs provide.\n\nThe platform offers a zero management fee, that is, it eliminates the 10% management fee charged by protocols like Lido, as a form of security incentivization.\n\nWith its unique blockchain mechanism and utility, the token is sure to be a promising one with significant use cases.\n\n4) Ankr ($ANKR)\n\nAnkr is a leading blockchain infrastructure provider which offers multi-chain API connections and runs RPC nodes besides staking solutions. The LSD protocol aims to make the adoption of Web3 easier by offering a platform where users can deploy nodes on PoS blockchains, stake their PoS tokens and access decentralized finance (DeFi) applications.\n\nANKR, the native utility and governance token of Ankr, has many use cases, including as payment for services within the Ankr ecosystem and as a means of earning passive income by staking. The Ethereum token can be used for on-chain governance and also as an insurance for network participants.\n\nWith a market cap of over $250 million and a maximum supply of 10 billion (100%), Ankr is one of the largest Ethereum staker and go-to staking infrastructure providers for ecosystems like the BNB, Polygon, and more.\n\nConclusion\n\nThe Shanghai upgrade helped to bring back confidence in the Ethereum blockchain and served as fuel for LSD protocols. Issues like capital inefficiency and lock up periods that made stakes illiquid are now being resolved with the emergence of LSD protocols. By providing liquidity and yield opportunities for stakers, these protocols are unlocking the potential of the rapidly growing LSD market.\n\nDisclaimer\n\nThis is an advertorial. BCCL disclaims any and all warranties - expressed or implied - relating to the content and does not guarantee, vouch for, or endorse any of the content. The content does not promote, suggest or present Crypto products to be a way to solve financial difficulties / achieve financial security / act as an alternative to employment / income opportunity. Crypto products, crypto currencies, NFTs are unregulated and may be risky, with no legal recourse in case of monetary loss. Views expressed herein are independent opinions based on studies. You may act at your own risk while relying on the content of this advertorial. Should you make a decision to act, or omit to act, you should seek appropriate legal advice in the relevant jurisdiction.\n\nDisclaimer: Content Produced by Heylin Spark"
    }
]