[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMTEvMjEvbmV3LWV0aGVyZXVtLWxheWVyLTItYmxhc3QtYXR0cmFjdHMtMzBtLWhvdXJzLWFmdGVyLWJyaWRnZS1nb2VzLWxpdmUv0gFyaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8xMS8yMS9uZXctZXRoZXJldW0tbGF5ZXItMi1ibGFzdC1hdHRyYWN0cy0zMG0taG91cnMtYWZ0ZXItYnJpZGdlLWdvZXMtbGl2ZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "New Ethereum Layer 2 Blast Attracts $30M Hours After Bridge Goes Live - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMTEvMjEvd2UtYXJlLXByZXBhcmVkLXRvLWdvLXRvLXRoZS1tYXQtZW5zLWZvdW5kZXItb24tcGF0ZW50LWRpc3B1dGUtd2l0aC11bnN0b3BwYWJsZS_SAX1odHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzExLzIxL3dlLWFyZS1wcmVwYXJlZC10by1nby10by10aGUtbWF0LWVucy1mb3VuZGVyLW9uLXBhdGVudC1kaXNwdXRlLXdpdGgtdW5zdG9wcGFibGUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "'We Are Prepared to Go to the Mat:' ENS Founder on Patent Dispute With Unstoppable - CoinDesk",
        "content": "'We Are Prepared to Go to the Mat:' ENS Founder on Patent Dispute With Unstoppable\n\nENS Founder Nick Johnson told CoinDesk he’s unhappy with Unstoppable Domains's patenting of work that he claims he produced and published earlier."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjYzOTY3L2V0aGVyZXVtLWxzZC1kZWNlbnRyYWxpemF0aW9u0gFFaHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjYzOTY3L2V0aGVyZXVtLWxzZC1kZWNlbnRyYWxpemF0aW9u?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "How to mitigate liquid staking derivatives threatening Ethereum's decentralization - The Block",
        "content": "Episode 99 of Season 5 of The Scoop was recorded with The Block's Frank Chaparro and Ethereum decentralized staking advocate Superphiz.\n\nListen below, and subscribe to The Scoop on Youtube, Apple, Spotify, Google Podcasts, Stitcher, or wherever you listen to podcasts. Please send feedback and revision requests to [email protected].\n\nSuperphiz is a long-time Ethereum community member and a became a vocal advocate for staking decentralization following the Ethereum 'Merge' to a proof-of-stake consensus mechanism last year.\n\nIn this episode of The Scoop, Superphiz unpacks how Ethereum's merge to proof-of-stake has caused liquid staking derivatives to pose a potential threat to Ethereum's credible neutrality, as well as the best pathways to mitigate the potential for staking centralization.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nOUTLINE:\n\n00:00 - Introduction\n\n2:55 - Success of ‘The Merge’\n\n5:28 - Ethereum Centralization Concerns\n\n13:34 - Lido’s LSD Dominance\n\n20:54 - Scaling Ethereum\n\n25:33 - New Use Cases\n\n27:37 - Closing Thoughts\n\n\n\n\n\nThis episode is brought to you by our sponsor PayPal.\n\nMake your crypto move with PayPal. Get started today at PayPal.com/crypto"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWZlZXMtZmxpcC1ldGhlcmV1bS1vcmRpbmFscy1jb21lYmFja9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin transaction fees flip Ethereum's as Ordinals hype returns - Cointelegraph",
        "content": "Average daily transaction fees on Bitcoin (BTC) have flipped with Ethereum following a frenzy of Ordinals-related activity on the Bitcoin network.\n\nOn Nov. 20, the average daily transaction fee for Bitcoin stood at $10.34, while Ethereum transaction fees came to an average of $8.43, according to BitInfoChart data.\n\nBitcoin’s average daily trading fee notched a new six-month high on Nov.16, reaching a peak of $18.67, while Ethereum fees reached $7.90.\n\nBitcoin’s average daily fees have surged above Ethereum in the last five days. Source: BitInfoCharts\n\nThe sudden uptick in Bitcoin transaction fees stems from a renewed market appetite for assets inscribed with the Ordinals Protocol — a tool for creating nonfungible token (NFT)-like assets and BRC-20 tokens on Bitcoin.\n\nFollowing a significant lull in activity between Sept. 25 and Oct. 23, Ordinals-based assets saw a drastic uptick beginning in late October, according to Dune Analytics data.\n\nThe number of Ordinals inscriptions grew by over six million since late October. Source: Dune Analytics\n\nRelated: Bitcoin Ordinals team launches nonprofit to grow protocol development\n\nSince Oct. 24, over six million Ordinal assets have been created, resulting in more than 800 BTC in fees — worth roughly $30 million — being redistributed to the network.\n\nThe uptick in Ordinals inscription activity compounded as ORDI — the second largest BRC-20 token by market cap — was listed on Binance on Nov. 7. The listing spurred a wider wave of BRC-20 buying activity from traders with the price of the ORDI token jumping by just over 50% on the day.\n\nAdditionally, on Nov. 17, the Ordinals-based project Taproot Wizards announced a $7.5 million seed round.\n\nMagazine: I spent a week working in VR. It was mostly terrible, however…"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjYzOTQ4L2V0aGVyZXVtLWxheWVyLTIta2ludG8tbWlncmF0ZXMtdG8tYXJiaXRydW0tZWNvc3lzdGVt0gFdaHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjYzOTQ4L2V0aGVyZXVtLWxheWVyLTIta2ludG8tbWlncmF0ZXMtdG8tYXJiaXRydW0tZWNvc3lzdGVt?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Layer 2 Kinto migrates to the Arbitrum ecosystem - The Block",
        "content": "Ethereum Layer 2 Kinto has migrated to the Arbitrum ecosystem via the Arbitrum Nitro technology stack after previously launching its testnet using Optimism’s OP Stack in May.\n\nThe migration follows a change in the structure of the Arbitrum Orbit ecosystem of chains that granted the Arbitrum Foundation greater autonomy in negotiating Layer 2 deployments, according to a statement.\n\nKinto claims it can bridge the gap between traditional finance and decentralized finance by building a KYC-compliant Layer 2 to support both modern financial institutions and decentralized protocols. It also aims to reduce the risk of DeFi exploits, providing built-in insurance for all smart contracts.\n\nWhy Arbitrum?\n\nThe decision to migrate to Arbitrum was driven by a need to provide similar levels of security, reliability and regulatory compliance typical in traditional financial systems while reducing the costs and friction associated with traditional asset issuance.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\n“Arbitrum’s ability to provide a credibly neutral, efficient and mature platform, with a strong understanding of decentralized finance, made it a perfect fit for the foundation of Kinto,” the team said.\n\n“Arbitrum is the indisputable leader in the rollup space regarding adoption, TVL and technology maturity,” Kinto founder Ramon Recuero added. “Arbitrum is a community driven ecosystem with thousands of projects being built by crypto-natives and we are excited to add Kinto into that discussion. We seek to extend a bridge for TradFi into DeFi without alienating the principles and ethos of crypto and Arbitrum is the best place to do so.”\n\nEarlier this month, Kinto announced it had raised $5 million over two funding rounds from investors, including Kyber Capital Crypto, Spartan Group and Parafi. Kinto’s mainnet launch is scheduled for Q1, 2024."
    }
]