[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvY2FuLXlvdS1idXktZXRoZXJldW0tb24tY2FzaC1hcHAtMjAyM9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "Can you Buy Ethereum on Cash App (2023) - Watcher Guru",
        "content": "Ethereum has grown in popularity over time. Because of its rising usage, ETH has become a popular cryptocurrency and has evolved into the second-largest one. Even though there are multiple sites for buying, trading, and sending Ethereum, users wonder whether they can do the same on the Cash App.\n\nEven though the application is called “Cash App,” it allows users to send and receive Bitcoin. However, can users buy Ethereum using the app? Before that, let us get to know the app a little better.\n\nWhat is Cash App?\n\nThe Cash App, which was formerly known as Square Cash, is a mobile payment service that was released in 2013. It was developed by Square, Inc., with its services available in the US and the UK.\n\nUsing a smartphone app, users can send and receive money between and among friends, family, and companies. Peer-to-peer money transfers, the opportunity to buy and sell Bitcoin, a card to make purchases, and the choice to invest in stocks and cryptocurrencies are just a few of the features offered by the app.\n\nTo ensure smooth transactions, users may connect their bank accounts or debit cards to their Cash App account. Because of its straightforward layout and practical payment alternatives, it has become increasingly popular.\n\nAlso read: How to Stake BNB?\n\nCan you buy Ethereum on Cash App?\n\nThe app does not currently support the purchase of Ethereum. While users can buy Bitcoin and Bitcoin Cash through the app, Ethereum is not available for direct purchase on the platform.\n\nTo acquire Ethereum, individuals will need to utilize alternative cryptocurrency exchanges such as Coinbase or Gemini. Both of these offer Ethereum trading options. It’s important to note that cryptocurrency offerings can change over time, so it is recommended to verify the available options on the app to always double-check."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiuQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtNS1qdW5lLTIwMjMvYXJ0aWNsZXNob3cvMTAwNzYyMDIzLmNtc9IBvQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtNS1qdW5lLTIwMjMvYW1wX2FydGljbGVzaG93LzEwMDc2MjAyMy5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin falls below $26,800; Litecoin, BNB decline over 2% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe cryptocurrency markets were majorly trading mixed on Monday. Bitcoin, Ethereum, and BNB were trading with cuts, while XRP , Solana, and Tron were trading with gains.Bitcoin (BTC) fell 1.20% to $26,797, whereas Ethereum (ETH) was below the $1,900 level. BTC volume stood at approximately $11.57 billion, falling 39.42% in the last 24 hours.\"Crypto markets have continued to be tightly range-bound as overall market capitalization remained just below $1.2 trillion over the weekend, without any change in the last 24 hours. Investors are currently displaying a lack of initiation for trend control. It is because of this that we can expect the market to perform sideways till a prominent narrative picks up,\" Parth Chaturvedi, Investments Lead at CoinSwitch Ventures, said.The total volume in DeFi is currently $2.29 billion, 8.67% of the total crypto market 24-hour volume. The volume of all stablecoins is now $24.44 billion, which is 92.65% of the total crypto market 24-hour volume.The global cryptocurrency market cap was trading higher around $1.12 trillion, declining 0.92% in the last 24 hours.The market cap of Bitcoin, the world's largest cryptocurrency, was around $519 billion. Bitcoin’s dominance is currently 45.83%, a decrease of 0.08% over the day, according to CoinMarketCap.Rajagopal Menon, Vice President at WazirX said, \"Major market oscillators point to a neutral sentiment. The Relative Strength Index (14) sits at 45, with a neutral outlook. The Stochastic %K (14, 3, 3) at 44 and the Average Directional Index (14) at 18 indicate a Neutral outlook as well.\"The MACD Level (12, 26), at −151, indicates “Sell”. The Stochastic RSI Fast (3, 3, 14, 14) is “Neutral” at 46 and William's Percentage is “Neutral” at 62 as well,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 12.24 hours, IST on June 5, 2023)Bitcoin $26,796 -1.20%Ethereum $1,871 -1.43%Tether $1.00 -0.02%BNB $301 -2.01%XRP $0.5376 2.72%Cardano $0.3723 -1.36% Dogecoin $0.07211 -1.54%Polygon $0.867 -1.78%Solana $21.53 0.18% Litecoin $93.37 -2.1%Polkadot $5.26 -1.53%Tron $0.08147 0.71%Shiba Inu $0.000008539 -1.15%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiuQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtNS1qdW5lLTIwMjMvYXJ0aWNsZXNob3cvMTAwNzYyMDIzLmNtc9IBvQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtNS1qdW5lLTIwMjMvYW1wX2FydGljbGVzaG93LzEwMDc2MjAyMy5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin falls below $26,800; Litecoin, BNB decline over 2% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe cryptocurrency markets were majorly trading mixed on Monday. Bitcoin, Ethereum, and BNB were trading with cuts, while XRP , Solana, and Tron were trading with gains.Bitcoin (BTC) fell 1.20% to $26,797, whereas Ethereum (ETH) was below the $1,900 level. BTC volume stood at approximately $11.57 billion, falling 39.42% in the last 24 hours.\"Crypto markets have continued to be tightly range-bound as overall market capitalization remained just below $1.2 trillion over the weekend, without any change in the last 24 hours. Investors are currently displaying a lack of initiation for trend control. It is because of this that we can expect the market to perform sideways till a prominent narrative picks up,\" Parth Chaturvedi, Investments Lead at CoinSwitch Ventures, said.The total volume in DeFi is currently $2.29 billion, 8.67% of the total crypto market 24-hour volume. The volume of all stablecoins is now $24.44 billion, which is 92.65% of the total crypto market 24-hour volume.The global cryptocurrency market cap was trading higher around $1.12 trillion, declining 0.92% in the last 24 hours.The market cap of Bitcoin, the world's largest cryptocurrency, was around $519 billion. Bitcoin’s dominance is currently 45.83%, a decrease of 0.08% over the day, according to CoinMarketCap.Rajagopal Menon, Vice President at WazirX said, \"Major market oscillators point to a neutral sentiment. The Relative Strength Index (14) sits at 45, with a neutral outlook. The Stochastic %K (14, 3, 3) at 44 and the Average Directional Index (14) at 18 indicate a Neutral outlook as well.\"The MACD Level (12, 26), at −151, indicates “Sell”. The Stochastic RSI Fast (3, 3, 14, 14) is “Neutral” at 46 and William's Percentage is “Neutral” at 62 as well,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 12.24 hours, IST on June 5, 2023)Bitcoin $26,796 -1.20%Ethereum $1,871 -1.43%Tether $1.00 -0.02%BNB $301 -2.01%XRP $0.5376 2.72%Cardano $0.3723 -1.36% Dogecoin $0.07211 -1.54%Polygon $0.867 -1.78%Solana $21.53 0.18% Litecoin $93.37 -2.1%Polkadot $5.26 -1.53%Tron $0.08147 0.71%Shiba Inu $0.000008539 -1.15%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiMGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3NvdXRoLWtvcmVhLXhycC10cmFkZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "South Korea Has Traded Way More XRP Than Ethereum This Year - Blockworks",
        "content": "People who trade crypto in South Korea are far from bitcoin (BTC) or ether (ETH) maxis. In fact, based on the latest data from Kaiko, they might be XRP maxis.\n\nOutside of BTC and ETH, collective volume for the top 20 most-traded cryptocurrencies listed on South Korea’s biggest crypto exchanges — Upbit, Bithumb, Coinone and Korbit — was $201.8 billion from the start of the year up to May 30, according to Kaiko data exclusively provided to Blockworks.\n\nBitcoin and ether saw $36.7 billion and $8.9 billion in trade, respectively.\n\nSouth Korea has a storied history in trading cryptocurrencies outside of the top two by market cap. Those digital assets typically account for 70% to 80% of total South Korean trade volume, according to Kaiko senior analyst Dessislava Aubert.\n\nAside from BTC, Ripple’s XRP is the most popular in South Korea by far.\n\nXRP captured 12% of the non-BTC and ETH volume.\n\n$24.5 billion XRP traded over the first five months of the year.\n\nXRP saw 66% of bitcoin’s volume and nearly three times ether’s.\n\nSouth Korea has traded more than $3.8 billion in Serum so far this year, one of the ill-fated ‘Sam Coins’ wrecked by the FTX scandal\n\nDogecoin (DOGE) was second at nearly 4%, with payments-focused network Solar (SXP) trailing with 3.4%. (Solar was rebranded from Swipe.io after Binance acquired the firm in 2020).\n\nEthereum Classic (ETC) and metaverse play The Sandbox (SAND) followed closely behind with about 3% each.\n\nSouth Korea watches XRP-SEC case\n\nTo explain XRP’s dominance in the peninsula nation, Aubert said its “largely due to the surge in XRP trading volume in late March and early April, when volumes in the Korean markets hit a multi-month high.”\n\nAlso during that time, markets were anticipating that Ripple’s contentious legal battle with the SEC was coming to a head. In an Apr. 3 Kaiko newsletter, analysts claimed traders were betting on Ripple to triumph, which sent the token soaring and led the entire altcoin sector to its peak year to date.\n\n‘Altcoin’ has become a derogatory term for crypto which isn’t bitcoin or ether — South Korea isn’t phased\n\nThe case persists without any clear indication for when it might find a conclusion. Ripple Labs CEO Brad Garlinghouse in January said he anticipated the case would be resolved within the first half of the year.\n\nAs for whether the top traded cryptocurrencies are trading at a premium — as they’ve done over the years from time to time — Aubert told Blockworks that “XRP has traded at an average premium of 1.8% in Korean markets over the past year.”\n\nBitcoin saw an average 1.4% premium across the same period.\n\nDogecoin is the worst performing of South Korea’s top five most-traded\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL2NyeXB0b3NsYXRlLmNvbS90aGUtZXRoZXJldW0tcXVlc3Rpb24td2h5LWRvZXMtdGhlLXNlYy1hdm9pZC10YWtpbmctYWN0aW9uLWFnYWluc3QtZXRoZXJldW0td2hlbi1hbGwtZWxzZS1hcmUtZmFpci1nYW1lL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "The ETH Question: Why does the SEC avoid taking action against Ethereum when all else are fair game? - CryptoSlate",
        "content": "The U.S. Securities and Exchange Commission (SEC) filed suit against Binance today in a move that has rocked the cryptocurrency industry.\n\nThe complaint notably includes language in which the SEC clearly elucidates that it considers many of the tokens that traded on Binance to be unregistered securities and lays out its case against several it considers notable offenders. The SEC identifies these “crypto asset securities” as including (but not limited to) Solana, Cardano, Polygon, Filecoin, Cosmos, The Sandbox, Decentraland, Algorand, Axie Infinity, and Coti.\n\nToday’s filing contains some of the SEC’s most explicit language to date in clarifying its judgment, but once again avoids taking on the big question: is Ethereum a security or not? If so, why is the SEC silent on it? And if not, what is it?\n\n“Crypto Asset Securities”\n\nThe SEC’s argument for designating these tokens as “crypto asset securities” is exhaustively outlined in Section VIII of the complaint (pages 85 through 123). Notable patterns emerge from the filing: the process of initial coin offerings (ICOs), vesting of tokens, allocations for the core team, and the promotion of profit generation through ownership of these tokens, are all repeated themes.\n\nBut Ethereum is not listed among these. Gensler has remained consistently vague on the question of whether Ethereum and its namesake coin count as securities. ETH is commonly held as an investment, suggesting it could be classified as a security, but it is also extensively used day-to-day as a medium of exchange across protocols, making its function more akin to cash or ACH settlement.\n\nGensler has previously suggested that “everything other than Bitcoin” in the crypto space could be seen as a security, but has notably refused to clearly state as much about Ethereum. When pressed to say the words, “I believe Ethereum is a security,” the Hon. Chair just will not do it. Gensler’s reluctance to classify Ether is curious when his SEC is so eager to claim as much for others. Why?\n\nThe Ethereum problem\n\nIt might be a simple matter of intragovernmental contention. Ethereum could potentially fall under the purview of the Commodity Futures Trading Commission (CFTC), which regards Bitcoin, Ethereum, and Tether as commodities, not securities. Not only do the two categories differ wildly from one another, this overlap could create a regulatory tug-of-war that would Gensler’s public stance on Ethereum while trying to avoid the appearance of infighting within the federal government.\n\nAnother analysis from Protos, argues that Gensler’s evasion on the matter may be a consequence of the SEC’s earlier inaction following the infamous DAO hack, which saw the blockchain fork into Ethereum Classic and put the entire ecosystem at risk. However, at the time the SEC did nothing, and now Gensler finds himself in the unenviable position of making up for his predecessors’ oversights. Now that the Ethereum ecosystem has spent years recovering and building credibility, retroactively declaring it an unregistered security would have unforeseen, but no doubt disastrous, consequences for investors.\n\nIn other words, protecting investors in this case would mean protecting them from the protector.\n\nHowever, perhaps another reason could lie beneath Gensler’s reluctance to clearly classify Ethereum: he may not know.\n\nCryptocurrencies and their underlying technologies are innovative and novel. They represent a fundamental shift in how we understand finance and asset ownership, and in the case of decentralized ecosystems like Ethereum, they introduce entirely new paradigms.\n\nIf this is true, it’s not unreasonable to suspect that most people—even those deeply involved in the space—may not fully understand the implications of these innovations just yet. Anything that is fundamentally new will resist categorization, and Ethereum does so—this lack of a concrete “concept” that both defines Ethereum but fits into previous understandings is the core problem around regulating it.\n\nThis regulatory ambiguity presents a complex challenge for Ethereum, but it does not lessen the urgency to address it. The advancement of the crypto industry hinges on obtaining clear legal definitions for Layer 1 (L1) tokens, such as Ethereum, that function simultaneously as mediums of daily exchange and investment vehicles within their respective ecosystems. The ambiguity in their status poses a significant hurdle, stalling progress and fostering uncertainty in a space that is ripe for growth and innovation.\n\nThe dichotomy of these tokens’ roles blurs the boundary between conventional asset classes, forcing us to confront inadequacies in existing legal structures. To propel the crypto industry forward, regulators must acknowledge and address this nuanced reality. Until a refined framework emerges that accurately captures the dual functionality of these L1 tokens, regulatory ambiguity will continue to shroud the industry, stifling its full potential and deterring mainstream adoption. This unique crypto space requires equally unique rules—ones that can encapsulate its dynamism and complexity.\n\nMaking meaningful progress\n\nThe path towards comprehensive crypto regulation is obscured by two significant obstacles, which must be addressed urgently for the sector’s responsible advancement.\n\nFirstly, the U.S. Securities and Exchange Commission (SEC) must establish a formal position on Ethereum. Given the SEC’s historical inaction in restraining Ethereum’s growth when opportunities were present, it has inadvertently fostered an environment where investors are left in regulatory limbo. The SEC, as the protector of investors, has a duty to provide some form of regulatory guidance—even if it proves to be temporary—to offer a foundational starting point and eliminate the current state of speculation. The lack of clear regulation is not merely an inconvenience; it is a failure to provide the necessary protections for participants in an increasingly significant market.\n\nSecondly, authentic, open-ended discussions about the nature of digital assets are crucial. This implies engaging in conversations devoid of preconceived notions, biases, ideological posturing, or empty rhetoric. We often speak of making space to “have the conversation,” but acknowledging that conversation needs to take place and actually having one are two very different exercises indeed. Perhaps everyone in the industry—as well as those watching over it—would benefit from practicing the latter.\n\nMentioned in this article"
    }
]