[
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vdS50b2RheS9tYWpvci1leGNoYW5nZS1kZWxpc3RzLXRvcC1iaXRjb2luLWJ0Yy1hbmQtZXRoZXJldW0tZXRoLXBhaXJzLWFtaWQtcmVndWxhdG9yeS1maXJlc3Rvcm3SAWtodHRwczovL3UudG9kYXkvbWFqb3ItZXhjaGFuZ2UtZGVsaXN0cy10b3AtYml0Y29pbi1idGMtYW5kLWV0aGVyZXVtLWV0aC1wYWlycy1hbWlkLXJlZ3VsYXRvcnktZmlyZXN0b3JtP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Nov 2023 08:00:00 GMT",
        "title": "Major Exchange Delists Top Bitcoin (BTC) and Ethereum (ETH) Pairs Amid Regulatory Firestorm - U.Today",
        "content": "In a recent announcement, Binance, the world's largest crypto exchange, revealed plans to delist Bitcoin (BTC) and Ethereum (ETH) cross margin and isolated margin pairs. This strategic move, effective from Nov. 28, is part of Binance's efforts to address mounting legal challenges within the digital assets industry.\n\nAdvertisement\n\nThe affected pairs are directly associated with BUSD, a stablecoin developed in collaboration with Paxos. Isolated margin borrowing on these pairs will be suspended on Nov. 28, followed by the closure of auto-settled user positions and the cancellation of pending orders on Dec. 7.\n\nPressure rise\n\nThis decision follows allegations by the U.S. SEC, which previously classified BUSD as a security. In response, both Paxos and Binance promptly halted the further minting and circulation of the stablecoin. This reflects the ongoing adjustments made by crypto exchanges to comply with evolving regulatory frameworks.\n\nIn a parallel development, Changpeng Zhao, or CZ, the founder of Binance, has stepped down from his role. This decision is part of a broader agreement with the U.S. Department of Justice to settle criminal charges against the exchange. Richard Teng has been named as the new CEO in the midst of this transitional period.\n\nCZ's guilty plea earlier this week, related to charges of operating an unlicensed money transfer business, conspiracy and violating restrictions, resulted in a significant $4.3 billion fine for Binance. As the crypto space grapples with these regulatory challenges, the implications for the market are uncertain.\n\nThe delisting of major pairs and the leadership change at Binance underscore the growing regulatory pressures faced by crypto exchanges globally, highlighting a pivotal moment for the industry."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL3d3dy5meGVtcGlyZS5jb20vZm9yZWNhc3RzL2FydGljbGUvZXRoZXJldW0tbGl0ZWNvaW4tYW5kLXNvbGFuYS1mb3JlY2FzdC1rZXktcHJpY2UtbW92ZW1lbnRzLWFuZC1wcmVkaWN0aW9ucy1mb3Itbm92LTIzLTEzOTA4MjXSAXhodHRwczovL2FtcC5meGVtcGlyZS5jb20vZW4vZXRoZXJldW0tbGl0ZWNvaW4tYW5kLXNvbGFuYS1mb3JlY2FzdC1rZXktcHJpY2UtbW92ZW1lbnRzLWFuZC1wcmVkaWN0aW9ucy1mb3Itbm92LTIzLzEzOTA4MjU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Nov 2023 08:00:00 GMT",
        "title": "Ethereum, Litecoin and Solana Forecast: Key Price Movements and Predictions for Nov 23 - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLTIxMjAv0gFIaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vYW5hbHlzaXMvZXRoL2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tMjEyMC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction: After 5% Surge, Is ETH Increase Just Getting Started? - NewsBTC",
        "content": "Ethereum price recovered all losses and climbed above $2,050. ETH outperformed Bitcoin and might aim for more gains above the $2,120 resistance.\n\nEthereum remained strong above $1,930 and started a fresh increase above $2,000.\n\nThe price is trading above $2,020 and the 100-hourly Simple Moving Average.\n\nThere was a break above a major bearish trend line with resistance near $1,980 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair is up over 5% and the bulls could aim for more upsides above $2,100.\n\nEthereum Price Turns Green\n\nEthereum price remained well-bid above the $1,930 support after a steady decline post report of Binance settlement. ETH formed a base and started a strong increase above the $2,000 resistance.\n\nThere was a break above a major bearish trend line with resistance near $1,980 on the hourly chart of ETH/USD. The pair gained strength and climbed above the $2,020 resistance. It gained over 5% and outperformed Bitcoin. Finally, it tested the $2,100 zone.\n\nA high is formed near $2,092 and Ethereum is now consolidating gains. It is testing the 23.6% Fib retracement level of the upward move from the $1,930 swing low to the $2,092 high.\n\nIt is well above $2,020 and the 100-hourly Simple Moving Average. On the upside, the price is facing resistance near the $2,080 zone. The first key resistance is near the $2,120 level. A clear move above the $2,120 level could spark another strong increase.\n\nSource: ETHUSD on TradingView.com\n\nThe next resistance is near $2,200, above which the price could aim for a move toward the $2,250 level. Any more gains could start a wave toward the $2,320 level.\n\nAnother Downside Correction in ETH?\n\nIf Ethereum fails to clear the $2,120 resistance, it could start a fresh decline. Initial support on the downside is near the $2,050 level. The next key support is $2,000 or the 50% Fib retracement level of the upward move from the $1,930 swing low to the $2,092 high.\n\nThe main support is now near $1,980. A downside break below the $1,980 support might trigger more losses. In the stated case, Ether could drop toward the $1,920 support zone in the near term.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 level.\n\nMajor Support Level – $2,000\n\nMajor Resistance Level – $2,120\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vY3J5cHRvLm5ld3MvbmVhcmx5LTYtNWItaW4tYml0Y29pbi1hbmQtZXRoZXJldW0tb3B0aW9ucy1hcmUtc2V0LXRvLWV4cGlyZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Nov 2023 08:00:00 GMT",
        "title": "Nearly $6.5b in Bitcoin and Ethereum options are set to expire - crypto.news",
        "content": "Over $6.51 billion in Bitcoin and Ethereum options are due to expire on Nov. 24, potentially indicating heightened trading activity.\n\nA vast number of Bitcoin (BTC) and Ethereum (ETH) options are set to expire on Nov. 24, potentially influencing market dynamics. This comes in the wake of the U.S. DOJ’s recent criminal charges against the Binance and its hefty $4.3 billion fine.\n\nSpecifically, about 108,000 BTC options are nearing their expiration date. These options carry a Put Call Ratio of 0.83, indicating a slightly higher inclination towards call options (betting on price increase) than put options (betting on price decrease).\n\nThe ‘max pain point’ for these options is $33,000, which is the price level where the collective holders of the options contracts would experience the most financial loss. The total notional value of these BTC options is a staggering $4.04 billion.\n\n24 Nov Options Data\n\n108k BTC options are about to expire with a Put Call Ratio of 0.83, a max pain point of $33,000 and a notional value of $4.04 billion.\n\n1.2 million ETH options are about to expire with a Put Call Ratio of 0.71, a max pain of $1,700 and a notional value of $2.47… pic.twitter.com/fhrOpr6bnE — [email protected] (@BTC__options) November 23, 2023\n\nIn parallel, approximately 1.2 million ETH options are also approaching expiration. These have a Put Call Ratio of 0.71, further leaning towards call options. The max pain point for these ETH options is set at $1,700, with a notional value amounting to $2.47 billion.\n\nThe concept of ‘max pain’ in options trading is crucial to understand. It refers to the price level at which the total value of options (both calls and puts) expiring on a certain date will cause the maximum financial loss to the option holders. This concept is often used by traders to assess potential market movements as options near their expiration dates.\n\nWhat does it mean?\n\nWhen BTC options are set to expire, it means that the contracts, which give the holder the right but not the obligation to buy or sell Bitcoin at a predetermined price (the strike price) by a specified date (the expiration date), are reaching the end of their validity period.\n\n#Bitcoin options seem to have a major impact on $BTC price!\n\n\n\n💥 Call options are dominating the options market as Bitcoin prepares for a significant $3.8 billion options expiry.\n\n\n\nThis dominance could significantly impact BTC's price trajectory in the coming days. pic.twitter.com/SeFjoANJmw — Satoshi Club (@esatoshiclub) November 23, 2023\n\nOn the expiration date, these options must be either exercised or they will become worthless. If the market price of Bitcoin is favorable relative to the strike price, the option holder may choose to exercise the option to buy Bitcoin at this lower price. Conversely, if the market price is below the strike price of a put option, the holder may exercise the option to sell Bitcoin at the higher strike price.\n\nThe impending expiration of these options could result in heightened trading activity and potentially unpredictable price movements in the market. Traders and investors are closely monitoring these developments, especially in light of the recent legal actions against Binance, which have already injected notable volatility into the market.\n\nFollow Us on Google News"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZGFpbHljb2luLmNvbS9tb3ZlbWVudC1sYWJzLXVudmVpbHMtbTItZmlyc3QtbW92ZS12bS1sMi1mb3ItZXRoZXJldW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Nov 2023 08:00:00 GMT",
        "title": "Movement Labs Unveils M2, First Move VM L2 for Ethereum - DailyCoin",
        "content": "Movement Labs announces M2, the first Move VM-based L2 for Ethereum.\n\nM2 incorporates Celestia’s modular data availability.\n\nM2 promises over 145k transactions per second, boosting Ethereum’s scalability.\n\nAs the Ethereum network grapples with scalability challenges, its ecosystem actively seeks and implements innovative solutions. This rich and vibrant ecosystem of projects and developers gives Ethereum the edge over other networks.\n\nMost recently, Movement Labs announced M2, the first Move Virtual Machine (VM)-based Layer Two (L2) solution for Ethereum. The solution offers enhanced performance, security, and scalability for the network.\n\nMovement Labs’ M2 Addresses Ethereum Scalability\n\nOn Tuesday, November 22, in a significant development for the Ethereum network, Movement Labs announced the launch of M2. The technology is the first Move Virtual Machine (VM) Layer Two (L2) solution, integrated with Celestia’s modular data availability.\n\nThis announcement marks a notable stride in addressing the longstanding scalability issues faced by Ethereum. Known for its diverse range of applications, Ethereum has often grappled with high transaction costs and slower processing times, presenting challenges to its scalability and efficiency.\n\nM2 promises a transformative solution to these challenges. It is engineered to enhance Ethereum’s transaction capacity substantially, with the capability of theoretically processing over 145,000 transactions per second. This efficiency is set to mitigate network congestion, high transaction fees, and slow processing times.\n\nThe core innovation of M2 lies in its integration of the Move VM, known for its robust security features. Moreover, the Move VM fosters a developer-friendly environment and Celestia’s modular data availability.\n\nThe influence of M2 extends beyond the Ethereum network. Movement Labs aims to foster a more interconnected blockchain environment by integrating with various blockchain networks and virtual machines. This effort enhances liquidity and accessibility across the broader blockchain spectrum.\n\nWhat Sets Move VM in M2 Apart\n\nM2’s integration of the Move Virtual Machine (VM) introduces advanced technical features tailored for enhanced smart contract functionality. Unlike traditional smart contract environments, the Move VM offers a unique resource model that treats assets as singular and uncopyable, reducing the risks of double-spending and accidental loss. This model is particularly advantageous for financial applications and NFTs, where asset integrity and authenticity are paramount.\n\nCelestia’s contribution to M2 through its modular data availability layer is another crucial aspect. This technology separates consensus from data availability, allowing for more flexible and scalable blockchain architectures. In M2, Celestia’s system enables the distribution and storage of data in a more efficient and less resource-intensive way.\n\nOn the Flipside\n\nAdopting new technologies like M2 often comes with a learning curve for developers and users. Ensuring widespread adoption may require significant community engagement, education, and support efforts.\n\nM2 is part of a broader landscape of Layer Two solutions being developed for Ethereum. These alternative solutions with unique features and approaches contribute to a diverse ecosystem.\n\nWhy This Matters\n\nFor the broader blockchain community, M2’s launch is a testament to the ongoing innovation and collaboration within the space. It highlights the potential of new technologies to address fundamental challenges and opens up new possibilities for blockchain applications and services\n\nRead more about L2 solutions for Ethereum:\n\nTypes of Layer 2: Comparing Different Ethereum Scaling Solutions\n\n\n\nRead more about Binance’s settlement with US authorities:\n\nBinance Set to Thrive Post $4.3B Settlement: Analysts"
    }
]