[
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi1pcy1ldGgtZ2VhcmluZy11cC10by1yZWFjaC0xODAw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Jan 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Is ETH Gearing Up to Reach $1,800? - Watcher Guru",
        "content": "Ethereum went from $1,300 to $1,595 in less than a week and is attracting heavy bullish sentiments in the indices. The Altcoin breached its resistance levels of $1,500, briefly testing the $1,600 mark on Tuesday. The overall crypto market cap reclaimed the $1 trillion mark as Bitcoin saw an inflow of more than $70 billion. The inflows come from both retail and institutional investors as the ‘Fear & Greed Index‘ came out of ‘Fear’ for the first time in nine months.\n\nAlso Read: Why Is the Crypto Market Up Today?\n\nEthereum Price Prediction: ETH To Reach $1,800 Next?\n\nSource: Unsplash\n\nEthereum price triggered a strong increase at the $1,450 level where it found resistance and got a breakthrough catapulting to $1,500. ETH cleared its resistance zone at $1,500 surpassing $1,550 on Tuesday after spiking nearly 5% within hours.\n\nHowever, ETH faced resistance near the $1,600 zone before briefly retracing in price during the day’s trade. Nonetheless, the ETH chart shows that a swing high is formed at $1,606 levels with a low of $1,520.\n\nAlso Read: Bitcoin at $20,000 is Full of Roses: Where are the Thorns?\n\nSource: TradingView\n\nEther’s price is now trading above the swing low of $1,520 and is hovering around the $1,570 mark. A key bullish trend line is forming at $1,550 levels and ETH seems to be consolidating in price. An upside from here could take Ethereum to $1,620 levels before finding another resistance zone.\n\nIf ETH manages to break the resistance of $1,620 and move further, its next leg could be at $1,700. Therefore, further gains from hereon might move ETH from $1,750 to $1,800 during the ongoing rally.\n\nAlso Read: When is the Best Time to Buy Bitcoin? Wall Street Analysts Explain\n\nAt press time, Ethereum was trading at $1,565 and is up 2.6% in the 24 hours day trade. ETH is down 67.9% from its all-time high of $4,878, which it reached in November 2021."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ldGhlcmV1bS1zbWFydC1jb250cmFjdHMtZGVwbG95bWVudC1qdW1wZWQtMTM1OTAyNjU4Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Jan 2023 08:00:00 GMT",
        "title": "Ethereum Smart Contracts Deployment Jumped 293% in 2022: Alchemy Developer Report - Yahoo Finance",
        "content": "Despite the fierce headwinds the crypto industry faced over the last year, Web3 development activity has grown at an impressive rate, according to a new report.\n\nOne such key indicator is the number of smart contracts deployed on the Ethereum mainnet, which grew 293% as compared to 2021, reaching rates that resembled the peaks of the previous year, per the “Q4'22 State of Web3 report” released today by blockchain software and development company Alchemy.\n\nRemarkably, this peak of activity came in the fourth quarter of 2022, just as FTX collapsed, driving hefty outflows of funds across the industry’s largest exchanges.\n\nPer the report, the number of deployed smart contracts in Q4 2022 grew 453% quarter-to-quarter, reaching a staggering 4.6 million.\n\nAdditionally, the deployment of smart contracts on Ethereum’s Goerli testnet grew 187% over the last three months of 2022—and as much as 721% year-to-year—to reach an all-time high of 2.7 million and signal that more decentralized applications (dapps) may enter the market in the future.\n\nThe report used several sources for data collection purposes, including Dune Analytics, DappRadar, and Github, among others.\n\nQ4 2022 building up across the board. Source: Alchemy\n\nDeveloper activity on the rise\n\nSmart contracts, a term coined by blockchain pioneer Nick Szabo in the 1990s, are self-executing pieces of computer code that debuted on the Ethereum blockchain, laying the groundwork for decentralized exchanges (DEXs) and non-custodial lending and borrowing apps.\n\n\"The Web3 developer community is proving to be extremely resilient. This report shows that they're as focused and motivated as ever to build the future of this ecosystem—while honestly acknowledging the unnecessary setbacks we have seen in 2022,” Alchemy's head of growth Jason Shah told Decrypt.\n\nAlchemy Acquires Ethereum Coding Platform ChainShot\n\nAdditionally, in December Alchemy surveyed 985 developers, and of those, 94% said they were committed to building in Web3, which “highlighted a positive outlook despite being in the thick of crypto winter,” per Alchemy.\n\nFollowing the launch of its Alchemy University in October, the San Francisco-based firm said that more than 100,000 applications poured in, indicating strong interest in building Web3 development skills.\n\n“We're encouraged by these numbers and expect developer activity to continue to increase in 2023,” Shah told Decrypt, although conceding that this may potentially be happening at a slower rate given decreasing investment in Web3 companies."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ldGhlcmV1bS1zbWFydC1jb250cmFjdHMtZGVwbG95bWVudC1qdW1wZWQtMTM1OTAyNjU4Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Jan 2023 08:00:00 GMT",
        "title": "Ethereum Smart Contracts Deployment Jumped 293% in 2022: Alchemy Developer Report - Yahoo Finance",
        "content": "Despite the fierce headwinds the crypto industry faced over the last year, Web3 development activity has grown at an impressive rate, according to a new report.\n\nOne such key indicator is the number of smart contracts deployed on the Ethereum mainnet, which grew 293% as compared to 2021, reaching rates that resembled the peaks of the previous year, per the “Q4'22 State of Web3 report” released today by blockchain software and development company Alchemy.\n\nRemarkably, this peak of activity came in the fourth quarter of 2022, just as FTX collapsed, driving hefty outflows of funds across the industry’s largest exchanges.\n\nPer the report, the number of deployed smart contracts in Q4 2022 grew 453% quarter-to-quarter, reaching a staggering 4.6 million.\n\nAdditionally, the deployment of smart contracts on Ethereum’s Goerli testnet grew 187% over the last three months of 2022—and as much as 721% year-to-year—to reach an all-time high of 2.7 million and signal that more decentralized applications (dapps) may enter the market in the future.\n\nThe report used several sources for data collection purposes, including Dune Analytics, DappRadar, and Github, among others.\n\nQ4 2022 building up across the board. Source: Alchemy\n\nDeveloper activity on the rise\n\nSmart contracts, a term coined by blockchain pioneer Nick Szabo in the 1990s, are self-executing pieces of computer code that debuted on the Ethereum blockchain, laying the groundwork for decentralized exchanges (DEXs) and non-custodial lending and borrowing apps.\n\n\"The Web3 developer community is proving to be extremely resilient. This report shows that they're as focused and motivated as ever to build the future of this ecosystem—while honestly acknowledging the unnecessary setbacks we have seen in 2022,” Alchemy's head of growth Jason Shah told Decrypt.\n\nAlchemy Acquires Ethereum Coding Platform ChainShot\n\nAdditionally, in December Alchemy surveyed 985 developers, and of those, 94% said they were committed to building in Web3, which “highlighted a positive outlook despite being in the thick of crypto winter,” per Alchemy.\n\nFollowing the launch of its Alchemy University in October, the San Francisco-based firm said that more than 100,000 applications poured in, indicating strong interest in building Web3 development skills.\n\n“We're encouraged by these numbers and expect developer activity to continue to increase in 2023,” Shah told Decrypt, although conceding that this may potentially be happening at a slower rate given decreasing investment in Web3 companies."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ldGhlcmV1bS1zbWFydC1jb250cmFjdHMtZGVwbG95bWVudC1qdW1wZWQtMTM1OTAyNjU4Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Jan 2023 08:00:00 GMT",
        "title": "Ethereum Smart Contracts Deployment Jumped 293% in 2022: Alchemy Developer Report - Yahoo Finance",
        "content": "Despite the fierce headwinds the crypto industry faced over the last year, Web3 development activity has grown at an impressive rate, according to a new report.\n\nOne such key indicator is the number of smart contracts deployed on the Ethereum mainnet, which grew 293% as compared to 2021, reaching rates that resembled the peaks of the previous year, per the “Q4'22 State of Web3 report” released today by blockchain software and development company Alchemy.\n\nRemarkably, this peak of activity came in the fourth quarter of 2022, just as FTX collapsed, driving hefty outflows of funds across the industry’s largest exchanges.\n\nPer the report, the number of deployed smart contracts in Q4 2022 grew 453% quarter-to-quarter, reaching a staggering 4.6 million.\n\nAdditionally, the deployment of smart contracts on Ethereum’s Goerli testnet grew 187% over the last three months of 2022—and as much as 721% year-to-year—to reach an all-time high of 2.7 million and signal that more decentralized applications (dapps) may enter the market in the future.\n\nThe report used several sources for data collection purposes, including Dune Analytics, DappRadar, and Github, among others.\n\nQ4 2022 building up across the board. Source: Alchemy\n\nDeveloper activity on the rise\n\nSmart contracts, a term coined by blockchain pioneer Nick Szabo in the 1990s, are self-executing pieces of computer code that debuted on the Ethereum blockchain, laying the groundwork for decentralized exchanges (DEXs) and non-custodial lending and borrowing apps.\n\n\"The Web3 developer community is proving to be extremely resilient. This report shows that they're as focused and motivated as ever to build the future of this ecosystem—while honestly acknowledging the unnecessary setbacks we have seen in 2022,” Alchemy's head of growth Jason Shah told Decrypt.\n\nAlchemy Acquires Ethereum Coding Platform ChainShot\n\nAdditionally, in December Alchemy surveyed 985 developers, and of those, 94% said they were committed to building in Web3, which “highlighted a positive outlook despite being in the thick of crypto winter,” per Alchemy.\n\nFollowing the launch of its Alchemy University in October, the San Francisco-based firm said that more than 100,000 applications poured in, indicating strong interest in building Web3 development skills.\n\n“We're encouraged by these numbers and expect developer activity to continue to increase in 2023,” Shah told Decrypt, although conceding that this may potentially be happening at a slower rate given decreasing investment in Web3 companies."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy83LWNyeXB0b3MtcmljaC0xMC15ZWFycy0xMTAwMjgxNzguaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Jan 2023 08:00:00 GMT",
        "title": "7 Cryptos That Will Make You Rich in 10 Years - Yahoo Finance",
        "content": "Despite the recent market conditions, there is still a lot of potential in cryptos. Despite a more than 50% drop in crypto values last year, the long-term bull case for digital assets remains firmly intact.\n\nThe technology that powers these digital assets will undoubtedly be used more universally, providing stability, security, and transparency to numerous transactions worldwide. The long-term potential for cryptocurrency investment and the article covers the best cryptos that will make you rich in 1o years.\n\nWhen deciding which cryptos to wager on, it’s imperative to consider the upside and the risks involved. Some cryptos are riskier than others; therefore, finding a balance between growth and safety is critical.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nPerhaps the most compelling argument to invest in cryptos is that they have shed a ton of value this year. Markets have taken a monumental beating as the Fed continues to wage its battle against rising inflation and interest rates.\n\nBitcoin (BTC)\n\nUp trend Technical graph of Bitcoin (BTC-USD) in futuristic concept, BITI ETF is a Bitcoin short fund for investors betting against Bitcoin.\n\nSource: Sittipong Phokawattana / Shutterstock.com\n\nGiven its 13-year price history, Bitcoin’s (BTC-USD) relative stability rivals that of the conventional stock market and helps to provide a sense of security for those looking to invest in digital currency.\n\nThis also implies greater liquidity for BTC, which may increase its global reach, making it more accessible to wider markets. Furthermore, the growing adoption of Bitcoin by mainstream financial institutions has only been hastened by the Bitcoin ETFs that have sprung up in recent years.\n\nThe current economy is showing clear signs of health and growth, with the most recent jobs report indicating a flourishing labor market. With Bitcoin’s expected halving event within its usual cycle, BTC’s value will likely shoot up in response if the Fed reverses course on its monetary policy in late 2023 or early 2024.\n\nStory continues\n\nEthereum (ETH)\n\nCrypto currency etherium. ethereum coin on exchange charts. e-currency Ethereum. Ethereum price predictions\n\nSource: viktoryabov / Shutterstock.com\n\nEthereum (ETH-USD) is the most valuable and preferred blockchain network for developers, dubbed the “lifeblood” of everything useful in this sector.\n\nEthereum is unparalleled in creating decentralized applications (dapps) with its robust and scalable platform. It dominates crypto niches such as non-fungible tokens and dapps, holding more than a 50% market share in these markets. Hence, it’s arguably the top crypto in terms of real-world utility.\n\nEthereum made waves in the crypto sphere with the Merge upgrade last year. Even more exciting is the upcoming Shanghai upgrade, slated for some time in March. This upgrade will bring even more options to ETH enthusiasts.\n\nThese upgrades will surely be game changers and only add further value to those already holding Ether tokens. It’s no wonder Ethereum is being hailed as one of the most sought-after cryptos.\n\nCardano (ADA)\n\nCardano (ADA) token with blue and orange digital background.\n\nSource: Stanslavs / Shutterstock\n\nCardano (ADA-USD) is an exciting cryptocurrency platform for those looking to load up on a “millionaire-maker” digital asset.\n\nThe smart contract platform features a native currency, ADA, which allows users to build decentralized applications and create tokens. Plus, with the backing of its team made up of Ethereum co-founder Charles Hoskinson and pertinent partnerships, it’s no surprise that Cardano is quickly becoming one of the most promising digital assets on the market.\n\nCardano is making a big move towards the world of DeFi by launching their Layer 2 scaling solution, Hydra. With a potential theoretical maximum speed of up to 10 million TPS, it would certainly make Cardano much more competitive than before.\n\nWith the addition of Djed as an algorithmic stablecoin, Cardano could become one of the leaders in decentralized finance. According to crypto analytics platform Santiment, Cardano outpaced its peers in development activity last year.\n\nSolana (SOL)\n\nSolana logo on phone screen stock image. Solana price predictions.\n\nSource: sdx15 / Shutterstock.com\n\nSolana (SOL-USD) is a game-changer for the DeFi space. This groundbreaking layer-1 blockchain has previously enabled developers to create and deploy formerly-impossible solutions. Thanks to its lightning-fast transaction speeds, this new challenger has quickly gained traction in the Ethereum-dominated market, providing a better user experience.\n\nWith an innovative proof-of-history validation mechanism, Solana can handle thousands of transactions per second while keeping low costs and fees, allowing users to access the benefits of DeFi without breaking the bank.\n\nSolana has proven to be a powerful DeFi platform for multiple projects. The amount of activity on the platform is already huge and impressive. In addition, it’s fast becoming an industry leader in the NFT space, with record-breaking trading volume happening this year.\n\nWhat’s more, the technical infrastructure that Solana has built up over time is only strengthening their position in the market. As such, Solana could easily become the go-to protocol for DeFi and NFTs in the upcoming years.\n\nBinance (BNB)\n\nA Binance Coin sits in front of trading charts. Binance price predictions\n\nSource: Shutterstock\n\nBinance (BNB-USD) is one of the most popular cryptocurrencies, with a market cap of over $45 billion.\n\nThe massive growth in its platform is mainly credited to Binance, which offers a world-class exchange platform that users leverage to buy, sell, and trade digital assets securely and efficiently.\n\nOver the past year, the blowup of FTX has caused waves within the crypto community, with investors growing increasingly concerned about centralized exchanges. Despite this, the truth is that retail investors still rely heavily on exchanges like Binance as an integral part of gaining exposure to cryptos.\n\nIn other words, despite the rising demand for decentralization, Binance still plays a major role in bringing cryptocurrency access to everyday traders.\n\nBinance’s BNB utility token is now being used to support web 3.0 decentralized apps on the BNB Smart Chain, and that’s just the start of some exciting times ahead for this burgeoning blockchain. As more developers choose this infrastructure, it’s possible to see a healthy expansion in BNB’s ecosystem.\n\nPolkadot (DOT)\n\nGolden Polkadot (DOT-USD) dot coin cryptocurrency on computer electronic circuit board background\n\nSource: Thichaa / Shutterstock.com\n\nPolkadot (DOT-USD) saw its value skyrocket in value in 2021 and was one of the standout performers of that year, but it plummeted to multi-year lows as part of the crypto winter last year. Nevertheless, it remains one of the top crypto bets this year due to its burgeoning use cases.\n\nPolkadot’s interconnectivity enables it to act as a bridge between multiple blockchain networks, thereby creating an extremely secure network for efficient data transfer.\n\nThis same underlying technology that allowed Polkadot to gain popularity among investors is still there and provides the potential for future growth. While DOT has recently had difficulty, the fundamentals remain strong.\n\nIt could be an excellent opportunity for potentially huge returns if investors stay patient long enough for its value to begin surging again. Moreover, with Europe’s largest telecom business, Deutsche Telekom, buying a large quantity of DOT tokens in 2021, the platform will continue garnering mainstream attention.\n\nChainlink ( LINK )\n\na digital representation of the chainlink (LINK) cryptocurrency\n\nSource: Stanslavs / Shutterstock.com\n\nChainlink’s (LINK-USD) ability to create secure, universal connections between various blockchains is extraordinary.\n\nIt has opened up an entire world of potential applications through its abstraction layer technology, bringing us closer to achieving interoperability between disparate blockchains for smart contract development. Its reliable and secure pathways make it easier to develop smart contracts without worrying about compatibility woes from blockchain-to-blockchain interactions.\n\nChainlink has established itself as one of the most important blockchain projects in revolutionizing how we use distributed ledger technology today.\n\nChainlink is a power player in decentralized finance, offering cutting-edge solutions for creating crypto products with added layers of security. This is thanks partly to its extraordinary advisory team including celebrity execs such as former Google CEO Eric Schmidt and ex-LinkedIn honcho Jeff Weiner.\n\nThe wealth of experience and knowledge brought to the table by Chainlink’s board members should open lots of doors to developing technology with real-world relevance and usability.\n\nDisclosure: On the date of publication, Muslim Farooque held a LONG position in Ethereum and Solana. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines\n\nMuslim Farooque is a keen investor and an optimist at heart. A life-long gamer and tech enthusiast, he has a particular affinity for analyzing technology stocks. Muslim holds a bachelor’s of science degree in applied accounting from Oxford Brookes University.\n\nMore From InvestorPlace\n\nThe post 7 Cryptos That Will Make You Rich in 10 Years appeared first on InvestorPlace."
    }
]