[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNS8wNy9ldGhlcmV1bS1vbi1jdXNwLW9mLWJyZWFraW5nLW91dC1hcy10cmFkZXJzLXJvdGF0ZS1tZW1lY29pbi1wcm9maXRzLWludG8tZXRoLXNheXMtYW5hbHl0aWNzLWZpcm0v0gGGAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA1LzA3L2V0aGVyZXVtLW9uLWN1c3Atb2YtYnJlYWtpbmctb3V0LWFzLXRyYWRlcnMtcm90YXRlLW1lbWVjb2luLXByb2ZpdHMtaW50by1ldGgtc2F5cy1hbmFseXRpY3MtZmlybS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 May 2023 07:00:00 GMT",
        "title": "Ethereum on Cusp of Breaking Out As Traders Rotate Memecoin Profits Into ETH, Says Analytics Firm - The Daily Hodl",
        "content": "A leading analytics firm says that Ethereum (ETH) is flashing a bullish on-chain signal as traders pile into the leading smart contract platform.\n\nSantiment says that Ethereum is witnessing a strong surge in active deposits, a metric that tracks the number of unique deposit addresses on an exchange that have been active on a particular day.\n\nAccording to Santiment, Ethereum has hit 20,000 active deposits for the first time since November 2021 as traders rotate their profits from red-hot memecoin Pepe (PEPE) to ETH.\n\n“Exchange addresses interacting on the network is now at its highest level since November, 2021. As expected, ETH is showing decoupling signs and on the cusp of breaking $2,000 once again.”\n\nPepe, a frog-themed memecoin, is up an eye-popping 4,543% from its all-time low of $0.00000005, which it hit less than three weeks ago.\n\nAt time of writing, Ethereum is trading for $1,928.\n\nLooking at the broader crypto markets, Santiment says that digital assets are starting to show signs of decoupling from the stock market. According to Santiment, crypto has remained relatively firm following the Fed’s latest interest hike.\n\n“As expected, the Fed raised interest rates by 25 basis points in the Federal Open Market Committee meeting. Rates have now been raised by a jarring 5% in 14 months as the US continues to battle inflation. Crypto’s correlation to these events has lessened, a positive signal.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Terablete"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMikQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNS8wNy9lY29ub21pc3QtaGVucmlrLXplYmVyZy1wcmVkaWN0cy1leHBvbmVudGlhbC1yYWxseS1pbi1ldGhlcmV1bS1iYXNlZC1hbHRjb2luLWFtaWQtY29taW5nLXN1cGVyLWV1cGhvcmlhLW9mLTIwMjMv0gGVAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA1LzA3L2Vjb25vbWlzdC1oZW5yaWstemViZXJnLXByZWRpY3RzLWV4cG9uZW50aWFsLXJhbGx5LWluLWV0aGVyZXVtLWJhc2VkLWFsdGNvaW4tYW1pZC1jb21pbmctc3VwZXItZXVwaG9yaWEtb2YtMjAyMy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 May 2023 07:00:00 GMT",
        "title": "Economist Henrik Zeberg Predicts Exponential Rally in Ethereum-Based Altcoin Amid Coming ‘Super Euphoria’ of 2023 - The Daily Hodl",
        "content": "Closely followed economist and Bitcoin (BTC) bull Henrik Zeberg is calling for a mega bullish finish to this year for the crypto markets, and currently has his eye on one particular altcoin project based on Ethereum (ETH).\n\nZeberg tells his 110,000 Twitter followers that Internet of things (IoT) project Jasmy (JASMY), has the ability rally over 100x from its current price levels.\n\n“FLY”\n\nJasmy, a Japanese crypto project, aims to combine blockchain and IoT technology to create and infrastructure that allows anyone use data safely and securely. It is currently trading at $0.007, about 99.8% down from its all-time high.\n\nZeberg’s JASMY call is in line with his outlook that crypto is about to enter a euphoric stage that outdoes the bull market of 2021. He shares a chart that suggests the total crypto market cap could explode rather quickly to the $4.4 trillion level.\n\n“If you liked the Crypto Euphoria in markets in late 2021, you are going to LOVE the coming SUPER EUPHORIA in late 2023.”\n\nContrary to popular belief that the US economy is either in or entering into a recession, Zeberg is of the viewpoint that the macro situation is actually bullish based on a number of ecomomic points. He says the Federal Reserve has finished raising interest rates, and that risk assets like crypto are now in for a boost.\n\n“Economy is 100% NOT in Recession.\n\nInflation down strongly – and moving lower.\n\nFed is DONE!\n\nGOLDILOCKS ZONE\n\nBlow-off top developing.”\n\nThe popular analyst has previously called for a major uptrend to begin for Bitcoin and the rest of the crypto markets.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on Twitter, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Klavdiya Krinichnaya\n\nGenerated Image: DALLE-2"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy90aGUtZXRoZXJldW0tZm91bmRhdGlvbi1qdXN0LXNvbGQtMzBtLWluLWV0aGVyLWJ1dC13aWxsLWV0aC1wcmljZS1mYWxsLXRoaXMtdGltZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 May 2023 07:00:00 GMT",
        "title": "The Ethereum Foundation just sold $30M in Ether — But will ETH price fall this time? - Cointelegraph",
        "content": "On May 6, Ethereum Foundation transferred nearly $30 million in Ether (ETH) to the Kraken cryptocurrency exchange, causing jitters in the market about a potential selloff event.\n\nETH price fell 4.8% to $1,900 on the day, but the decline has been negligible so far amid a wider recovery trend.\n\nETH price holding key support\n\nEther’s price recovered modestly to $1,920 on May 7 after testing its 50-day exponential moving average (50-day EMA; the red wave) near $1,850 as support a day ago.\n\nMoreover, the price volatility dropped on Kraken in the said period, per the contracting Bollinger Bands width in the chart above. That further shows traders’ calm amid the Ethereum Foundation transfer.\n\nNotably, the 50-day EMA has capped Ether's downside attempts so far in 2023, barring the early March selloff that saw the price briefly falling below the red wave. Meanwhile, testing it as support has prompted the ETH price to pursue a breakout above $2,000.\n\nAs a result of this support, ETH bulls may attempt to take the price above $2,000 again.\n\nConversely, a drop below the 50-day EMA could have traders eye a support confluence comprising a multi-month ascending trendline and the 200-day EMA (the blue wave) near $1,700 as the next downside target, down about 13% from current price levels.\n\nEven with a larger decline, ETH would be maintaining its overall recovery trend when measured from its June 2022 bottom of $880.\n\nEthereum exchange reserves vs. Kraken reserves\n\nA rising exchange balance suggests potential selling pressure rising and vice versa. In Ethereum’s case, the balance remained lower across all the exchanges despite the Ethereum Foundation’s transferring $30 million into Kraken.\n\nFor instance, Kraken's Ether balance increased to 1.84 million ETH on May 6, from 1.83 million one day earlier.\n\nEther Kraken balance vs. exchange balance. Source: Glassnode\n\nNevertheless, the balance across all exchanges actually dropped to 18.15 million ETH from 18.22 million ETH on the day, indicating that any potential sell-pressure from the Ethereum Foundation can easily be absorbed.\n\nNot necessarily a ETH market top\n\nThe Ethereum Foundation’s last big transfer was 20,000 ETH in November 2021, when the price topped around $4,850, declining 80% thereafter. Similarly, the foundation sold 35,053 ETH at the local market top of around $3,500 in May 2021.\n\nRelated: Ethereum up 20% in April while Markets Pro sees 379% gain in one day\n\nMany analysts treated these fractals as a sign of another possible market top formation near $2,000, arguing that the price may fall in the coming sessions.\n\nEthereum Foundation sold another 20,000 Ethereum at the recent local top.\n\n\n\nEvery time the eth foundation / Vitalik / Consensys dumps a massive presale bag it marks the top.\n\n\n\nWhat’s the difference between ripple dumping hundreds of millions on retail vs ETH founders doing it? https://t.co/pw8ukMiR8v — Brad Mills ⚡️ (@bradmillscan) January 28, 2022\n\nBut broader data suggests otherwise. For instance, Ethereum Foundation’s large ETH sales occurred also during the 2020-2021 bull cycle, boosted by growing demand for risk-on assets in a lower interest rate macro environment.\n\nThe Ethereum Foundation's large ETH transfers to exchanges since 2018. Source: Wu Blockchain\n\nIn other words, there’s little evidence to suggest that the Ethereum Foundation’s sales have any impact on Ethereum’s price trend. Instead, the cryptocurrency market is currently taking cues from the U.S. banking crisis and whether this will force the Federal Reserve to stop hiking and cut interest rates.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA1LzA3L2V0aGVyZXVtLWluLTItY2hhcnRzLWlzLWl0LXRpbWUtdG8tc2VsbC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 May 2023 07:00:00 GMT",
        "title": "Ethereum in 2 Charts: Is It Time to Sell? - The Motley Fool",
        "content": "Ethereum (ETH -0.01%), the world's second most valuable cryptocurrency by market cap, is in a unique position. Since the start of the year it is up more than 50%, and yet it is still down more than 60% from its all-time high of almost $4,900.\n\nBecause of its hot start in 2023, it can be difficult to gauge whether Ethereum is a buy or a sell today. To get an answer to this question we need to do a little digging to find data from Ethereum's network that provides some historical context on its current position in the market.\n\nThe foundation for The Merge\n\nOne of the most important developments to come out of the cryptocurrency industry recently was The Merge, an upgrade that switched Ethereum from the clunky and energy-consuming proof-of-work method of verifying transactions to the more robust and energy-efficient proof-of-stake method.\n\nHowever, although The Merge dominated headlines, there is a lesser-known upgrade that is likely more meaningful for Ethereum's price than it is given credit for.\n\nKnown as the London hard fork, this upgrade was introduced in August 2021 and included a new pricing mechanism with a fixed base fee to be burned, or permanently destroyed. Essentially, the more transactions that occur on the network, the greater the number of ether tokens that could be removed from the supply. Because the fixed base fee is permanently removed from circulation, under some circumstances the total number of ether in circulation can actually decrease.\n\nData by TradingView\n\nBecause of the London hard fork Ethereum has effectively become a deflationary asset, as the chart above shows. It can be a little difficult to see, but around the end of 2022 the line showing the total supply of ether starts to bend. It was around this time that the number of transactions on the network started to increase, causing the burn mechanism to truly start to become evident.\n\nThanks to this new feature, Ethereum's price is now highly correlated to the dynamics of supply and demand. Before the London hard fork, Ethereum had a relatively high inflation rate, but now this has all changed and it could mean great things for Ethereum's price, especially if a bull market is on the horizon.\n\nContinued growth of active users\n\nThere is another metric we can look at to get a better idea of Ethereum's current valuation versus its potential future price. It's relatively simple, but evaluation of the number of active addresses on the Ethereum blockchain can provide a useful glimpse at activity on the network. Active addresses are the number of unique addresses that have either sent or received a transaction on the blockchain during a certain period, and the thinking goes that the greater the number of active addresses, the more demand for the cryptocurrency.\n\nData by TradingView\n\nWhen taking a look at these addresses, it becomes clear that while there has been a downtrend since the market peak in 2021, there has been substantial growth in recent months. It suggests that more people are using the blockchain for various purposes, such as making payments, creating decentralized applications, and executing smart contracts. As the number of users on the Ethereum network increases, so does the amount of ether burned, thus adding more deflationary pressure.\n\nDue to the newness of the burn mechanism and recent trends in active addresses, it's more than likely that Ethereum's price has yet to realize the full potential of this combination. As such, Ethereum seems to be in a position that could benefit users for years to come.\n\nWhen considering Ethereum was able to hit an all-time high of almost $4,900 without any burn mechanism and while still operating on the former proof-of-work methodology, it's difficult to imagine what could be in store for its price as it begins to reap the rewards of its new deflationary features.\n\n\n\n\n\n"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FsbC92aXRhbGlrLWJ1dGVyaW4tYW5kLWV0aGVyZXVtLWZvdW5kYXRpb24tc2VsbGluZy1ldGgtd2lsbC1wcmljZXMtZmFsbC_SAWVodHRwczovL3d3dy5uZXdzYnRjLmNvbS9hbGwvdml0YWxpay1idXRlcmluLWFuZC1ldGhlcmV1bS1mb3VuZGF0aW9uLXNlbGxpbmctZXRoLXdpbGwtcHJpY2VzLWZhbGwvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 May 2023 07:00:00 GMT",
        "title": "Vitalik Buterin And Ethereum Foundation Selling ETH – Will Prices Fall? - NewsBTC",
        "content": "Ethereum supporters are confident that prices will break the $2,000 level. However, recent moves by its founder, Vitalik Buterin, and the Ethereum Foundation, the team managing the smart contracting platform, raises concerns, especially from coin holders and traders, on whether the coin has what it needs to break above key resistance levels.\n\nETH Transfer Raises Concerns Among Investors\n\nOn May 5, a tracker, LookOnChain, noticed that Vitalik.eth, the domain associated with Ethereum co-founder Vitalik Buterin, transferred 200 ETH, which is worth about $400,000 at current valuation, to Kraken, a cryptocurrency exchange.\n\nShortly after that, the Ethereum Foundation also made a much larger transfer, moving 15,000 ETH, worth about $30 million, to the same platform.\n\nThis has raised concerns among holders, who are worried that the dumping of such a large amount of ETH could further pressure prices.\n\nIt’s worth noting that ETH is currently down 13% from its April highs, and sliding.\n\nCoin holders, including those of ETH, typically send tokens from time to time. Even so, any transfer to a centralized exchange is interpreted as bearish. Vitalik Buterin might need funds to cover operating costs or even invest in projects. At this time, it is not known why he sells.\n\nIn the past, Buterin has sold ETH in batches without causing a significant price drop.\n\nDespite this development, some analysts, including Santiment, believe that ETH may be decoupling from Bitcoin, and that it might soon recover, breaking above $2,000.\n\nAccording to data from Santiment, a leading on-chain data company, there has been a significant increase in the amount of Ethereum being moved to crypto exchanges over the past few months.\n\n😮 #Ethereum's active deposits just hit an 8-month high. As we research the most likely cause, we can currently state that this likely will foreshadow upcoming increased $ETH volatility, similar to the result of spikes during the #merge & #FTX collapse. https://t.co/aBeHQudM52 pic.twitter.com/oHeypfUPvJ — Santiment (@santimentfeed) May 5, 2023\n\nEthereum Sees Increased Adoption\n\nDespite these concerns, there are also positive signs, based on on-chain activity.\n\nA record amount of ETH was burned at the end of this week, thanks to the meme coin craze, and specifically, PEPE. The majority of meme coins run on Ethereum and are being actively moved with higher gas fees, providing a great opportunity to burn ETH and decrease the circulating supply.\n\n31.7K $ETH has been burned in the past seven days. To put that in perspective, since the merge (231 days ago), 152K ETH total has been burned. That’s ~21% of the total burn in ~3% of the total days. This is the power of meme coins. pic.twitter.com/iFsZaDH5LU — K A L E O (@CryptoKaleo) May 5, 2023\n\nIn addition, Ethereum is seeing increased adoption from major companies and institutions, which is driving up demand for the cryptocurrency.\n\nLast week, the European Investment Bank (EIB) announced that it had issued its first-ever digital bond on the Ethereum blockchain, marking a significant milestone for the cryptocurrency.\n\nThe increased adoption and burning of ETH due to the meme coin mania could sustain prices above key support levels in the days ahead. Still, it remains to be seen how prices will react in the days ahead.\n\nThe sharp drop on May 6, reversing gains of May 5, could anchor the next leg down, forcing even more liquidations towards the $1,500 support line.\n\n-Featured Image From Canva, Chart From TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    }
]