[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vY29pbmdhcGUuY29tL29ubHlmYW5zLWludmVzdHMtaW4tZXRoZXJldW0tYXMtcmV2ZW51ZS10b3BzLTEtYmlsbGlvbi_SAVBodHRwczovL2NvaW5nYXBlLmNvbS9vbmx5ZmFucy1pbnZlc3RzLWluLWV0aGVyZXVtLWFzLXJldmVudWUtdG9wcy0xLWJpbGxpb24vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 27 Aug 2023 07:00:00 GMT",
        "title": "OnlyFans Invests in Ethereum as Revenue Tops $1 Billion - CoinGape",
        "content": "OnlyFans, the UK-based adult content subscription platform, is diving deep into cryptocurrency. As part of its capital ventures, the company has invested in Ethereum, the world’s second-largest cryptocurrency, per an Evening Standard report. This move comes as the firm celebrates a milestone, with revenues surpassing $1 billion for the first time in 2022.\n\nEthereum and the Future of Digital Investments\n\nEthereum price is currently trading at $1,643.71 and boasting a 24-hour trading volume of $2,693,591,545, remains an attractive investment for many businesses, with OnlyFans being the latest to explore its potential.\n\nadvertisement\n\nThe capital infusion into Ethereum suggests a forward-thinking strategy on OnlyFans’ part, indicating a shift towards diversifying assets and possibly integrating blockchain technology or cryptocurrency-based models into its operations. With a circulating supply of 120,216,173 ETH coins and the max supply undisclosed, Ethereum presents promising returns for early adopters.\n\nGrowth Amidst Controversy\n\nIt’s worth noting that OnlyFans has witnessed remarkable growth in the past year. According to the Evening Standard, the platform reported a 17% increase in sales, settling at $1.1 billion, and an impressive jump of 21% in pre-tax profits, which stands at $525 million. Over 50 million new users, accompanied by 1 million fresh content creators, flocked to the platform, cumulatively spending $5.5 billion on the site.\n\nHowever, the firm hasn’t been without its challenges. A BBC News investigation last year uncovered incidents of underage individuals selling and appearing in videos on the platform, sparking safety concerns. In response to these allegations, OnlyFans defended its safety protocols, stating in its accounts that the company “goes above and beyond the legal requirements” to ensure a safe and controlled environment for its community."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZGVjcnlwdC5jby8xNTM5NDcvb25seWZhbnMtZXRoZXJldW0taG9sZGluZ3MtMTktbWlsbGlvbi00MC1wZXJjZW50LWRyb3DSAVVodHRwczovL2RlY3J5cHQuY28vMTUzOTQ3L29ubHlmYW5zLWV0aGVyZXVtLWhvbGRpbmdzLTE5LW1pbGxpb24tNDAtcGVyY2VudC1kcm9wP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 27 Aug 2023 07:00:00 GMT",
        "title": "OnlyFans' Ethereum Holdings Sank—But 2022 Was Still A Good Year - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nMore fans, more creators, more money. For the content creator site OnlyFans, 2022 was a pretty good year. For Ethereum? Maybe not so much.\n\nOver the weekend, Crypto Twitter zeroed in on a financial statement submitted by OnlyFans’ parent company Fenix International Limited to British authorities on Thursday. It showed that the company had owned over $19 million in Ether (ETH), Ethereum’s native token, but its value was slashed to about $11.4 million by the end of the reporting period in November 2022.\n\n“During this year, the group diversified part of its working capital into a cryptocurrency asset—ETH or Ethereum,” the company said in a strategic statement that opens the 48-page document. “There are no limitations or restrictions on the group's ability to sell the cryptocurrency assets. The asset has been impaired to its fair value at the year end.\"\n\nAD\n\nAD\n\nLast year, OnlyFans—infamous for the many adult performers hosted on the platform—made a splash in the crypto space by announcing that creators could use verified Ethereum NFTs in their profile images. Creators who did so received an Ethereum symbol to show their ownership of the asset.\n\nAt the time, OnlyFans’ CEO Amrapali Gan said the feature—similar to one introduced for Instagram and Facebook by Meta—aimed to \"empower creators to own their full potential.\"\n\n\"This feature is the first step in exploring the role that NFTs can play on our platform,\" Gan told Reuters.\n\nUnfortunately, the company could not have anticipated the crypto bear market lurking around the corner. At the time of the NFT announcement, ETH was trading at $2,797.43, but fell to $1,298.94 by November 30 when the reporting period ended. At the time of writing, ETH is trading at $1,645.90.\n\nImage: Coingecko\n\nLast year was a tumultuous one for cryptocurrency markets. It was marked by a cascade of failures including the collapse of Terra's UST stablecoin and governance token LUNA, the bankruptcy of crypto lender Celsius, and the implosion of cryptocurrency exchange FTX.\n\nAD\n\nAD\n\nBut apart from its ETH woes, OnlyFans enjoyed a positive 2022. According to the financial statement, the site saw the company's revenue shoot up to $5.6 billion from $4.8 billion in 2021. It also experienced a 47% increase in the number of creators on its platform, on top of a 27% increase in the total number of subscribers."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1iZWFycy1nYWluaW5nLWdyb3VuZC1oZXJlcy1ob3cv0gFCaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2V0aGVyZXVtLWJlYXJzLWdhaW5pbmctZ3JvdW5kLWhlcmVzLWhvdy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 27 Aug 2023 07:00:00 GMT",
        "title": "Ethereum bears gaining ground – Here’s how - AMBCrypto News",
        "content": "ETH’s MVRV ratio slipped below its 180-day small moving average.\n\nThis is a bearish signal, and it indicated a further price decline might be imminent.\n\nLeading altcoin Ethereum [ETH] is at risk of further decline, as its daily Market Value to Realized Value (MVRV) ratio has fallen below its 180-day small moving average (SMA), Twitter crypto analyst Ali_Charts found.\n\n#Ethereum MVRV Ratio, compared to the 180-day SMA, offers insights into market trends! When MVRV surpasses the 180-day SMA, it indicates macro uptrends; when below, downtrends are suggested. Notably, after the recent #ETH price decline, MVRV fell beneath the 180-day SMA,… pic.twitter.com/ITvA586HBf — Ali (@ali_charts) August 25, 2023\n\nThe MVRV ratio tracks the ratio between an asset’s current market price and the average price of every coin or token of that asset acquired. A positive MVRV ratio above one signals that an asset is overvalued.\n\nAccording to Santiment, the more this ratio increases, the more likely traders have historically demonstrated their willingness to sell.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nConversely, a negative MVRV value shows that the asset in question is undervalued, as if holders sold at the asset’s current price, they would realize losses.\n\nAs noted by Ali_Charts, when an asset’s MVRV ratio rests above the 180-day SMA, the market capitalization is greater than the total amount of profit realized, which suggests that the market is in an uptrend.\n\nOn the other hand, when the MVRV ratio is below the 180-day SMA, the market capitalization is less than the total amount of realized profit, which suggests that the market is in a downtrend.\n\nRegarding ETH, its MVRV ratio recently fell below the 180-day SMA, suggesting that its recent price decline may not be over.\n\nETH traders continue to dawdle\n\nWith many uncertain of the coin’s next direction, the recent market deleveraging event has caused ETH holders to stay their hands from accumulating the altcoin. Since 17 August, when the market suffered a huge liquidity exit, key momentum indicators have plummeted, suggesting a drop in buying pressure.\n\nBelow their respective center lines at press time, ETH’s Relative Strength Index (RSI) and its Money Flow Index (MFI) were 30.44 and 18.54.\n\nLikewise, as of this writing, the alt’s Chaikin Money Flow (CMF) returned a negative value of -0.08, a position it has occupied since the capital exodus. Generally, a CMF value below the zero line is a sign of weakness in the market.\n\nHow much are 1,10,100 ETHs worth today?\n\nOutside the spot market, reduced ETH trading was also observed in the futures market. Across cryptocurrency exchanges, the total amount of ETH’s Open Interest valued in dollars has trended downwards since 17 August. In the last seven days alone, this has declined by 4%.\n\nAlso, on leading exchanges Binance and dYdX, ETH’s funding rates have been predominantly negative for the past two weeks. This signaled where market sentiment lies, showing investors preferred to bet against the alt’s price."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYm9sZC5jb20vb25seWZhbnMtYm91Z2h0LTIwLW1pbGxpb24td29ydGgtb2YtZXRoZXJldW0tcmVjb3Jkcy1zaG93L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 27 Aug 2023 07:00:00 GMT",
        "title": "OnlyFans bought $20 million worth of Ethereum, records show - Finbold - Finance in Bold",
        "content": "United Kingdom-based subscription platform for adult content, OnlyFans, has entered into the cryptocurrency space coinciding with a period in which the company has registered significant growth.\n\nAccording to the company’s financial filing, OnlyFans had purchased $19.889 million worth of Ethereum (ETH). However, the value of the purchased Ethereum has decreased, leading to an impairment loss of $8.455 million by November 30, 2022.\n\nAdult content subscription service Onlyfans’ financial report shows that it invested part of its working capital into Ethereum.\n\n\n\nOnlyfans purchased $19.889 million worth of ETH. The purchased ETH has a Impairmnent loss of $8.455m as of November 30, 2022, with a Carrying amount… pic.twitter.com/dW1sYQfIkp — Wu Blockchain (@WuBlockchain) August 27, 2023\n\nAs a result, the remaining value of Ethereum, known as the carrying amount, stands at $11.434 million. This impairment loss indicates that the initial investment in Ethereum has declined in value, aligning with the recent price movements in the general cryptocurrency market.\n\nAccording to the filings, investing in cryptocurrency is part of putting money into intangible assets with an ‘indefinite useful life. OnlyFans’ venture into cryptocurrencies could have several implications, pointing towards a deliberate move towards diversification and embracing blockchain technology.\n\nThis move coincides with Ethereum being increasingly considered an attractive asset for its potential as a viable store of value. Its growing integration into mainstream financial establishments further enhances the asset’s allure as a sustainable investment option.\n\nAdditionally, the investment might be linked to Ethereum’s capability to serve as an inflation-resistant asset, potentially allowing it to remain less affected by the fluctuations of conventional financial markets.\n\nApart from its cryptocurrency investments, OnlyFans has previously expanded its financial portfolio through ventures in non-fungible tokens (NFT). In February 2022, OnlyFans introduced a feature enabling users to showcase verified NFTs as profile images. The adult platform only allowed NFTs minted on the Ethereum blockchain.\n\nOnlyFans strong financial postings\n\nFor the 12 months ending on November 30, 2022, the company posted strong financial results, reaching a revenue milestone of over $1 billion. Simultaneously, the platform attracted over 50 million new users, and more than 1 million new content creators joined its ranks. Collectively, users spent a substantial $5.5 billion on the site.\n\nThe filings indicated that Leonid Radvinsky, a Ukrainian based in the US who acquired the company in 2018, accumulated approximately $485 million in dividends since the beginning of the previous year as demands for OnlyFans grew.\n\nIt is worth noting that OnlyFans’ revenue model involves the company keeping around £1 out of every £4 earned by its content creators. This approach has been highly profitable for numerous adult content creators, leading to significant earnings for some individuals on the platform."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL2NvaW5wZWRpYS5vcmcvYWx0Y29pbi90b3AtYWx0Y29pbi1waWNrcy1mb3ItbmV4dC13ZWVrLWV0aGVyZXVtLWV0aC1saXRlY29pbi1sdGMtYW5kLXNoaWJhLWludS1zaGliLWFyZS1vbi10aGUtd2F5LXRvLXJlY292ZXJ5L9IBigFodHRwczovL2NvaW5wZWRpYS5vcmcvYWx0Y29pbi90b3AtYWx0Y29pbi1waWNrcy1mb3ItbmV4dC13ZWVrLWV0aGVyZXVtLWV0aC1saXRlY29pbi1sdGMtYW5kLXNoaWJhLWludS1zaGliLWFyZS1vbi10aGUtd2F5LXRvLXJlY292ZXJ5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 27 Aug 2023 07:00:00 GMT",
        "title": "Top Altcoin Picks For Next Week: Ethereum (ETH), Litecoin (LTC) And Shiba Inu (SHIB) Are On The Way To Recovery - Coinpedia Fintech News",
        "content": "Shayan is a digital nomad and a professional journalist. He delivers high-quality engaging articles to Coinpedia through his in-depth research and analysis.\n\nIn the past week, Bitcoin has experienced significant price fluctuations within its consolidation range, influenced by various macroeconomic factors such as Jerome Powell’s address. As Bitcoin falls short of meeting the short-term bullish expectations of investors, capital is increasingly flowing into the altcoin sector. Looking ahead to the coming week, a substantial recovery rally in the altcoin market is anticipated, with Ethereum, Litecoin, and Shiba Inu potentially leading this rally.\n\nAltcoins On The Edge Of Recovery\n\nBitcoin’s price continues to flash volatility near $26K in response to Powell’s hawkish comments. This development is somewhat expected, considering the bearish trend Bitcoin had been exhibiting in the days leading up to the Jackson Hole symposium. Traders had been preparing for Powell’s ongoing moves on controlling the inflation to align with the central bank’s 2% target.\n\nAmid this, the prices of Ethereum, Litecoin, and Shiba Inu have been hovering near key support levels. With sellers unable to push prices further downward, a potential bounce-back from these support levels is anticipated for the coming week.\n\nEthereum Price Analysis\n\nEther’s price recently attempted to break above $1,700 but couldn’t maintain its position, indicating strong defense from the bears at this price point.\n\nThe declining moving averages and the RSI below the midline suggest that bearish momentum still dominates. Sellers are likely to aim for pushing the price into the $1,625 to $1,544 range. If successful, we could see a drop below the support channel, plunging the ETH price toward the $1,360 level.\n\nConversely, bulls aren’t leaving the field easily. They are expected to robustly defend the support zone and attempt to push the price above the 50-day EMA of $1,678. If they manage this, it would imply that the ETH price could continue to hover in a bullish range of $1,785-$1,863.\n\nLitecoin Price Analysis\n\nLitecoin has been trading within a narrow band of $60 to $67 over the last several days. While the bulls have managed to hold a decline below the $60 support level, they’ve been unable to push past the $67 resistance.\n\nAn extended consolidation often leads to a solid breakout momentum ahead, and LTC price might experience that soon. If bulls successfully break above the consolidation next week, LTC price could initially target the 200-day EMA at $77 before aiming for the more ambitious $85 mark, where significant bearish activity is expected.\n\nConversely, it’s crucial for the bulls to defend the $60 support level. Failure to do so could trigger the next downward phase, potentially driving the price to $47.\n\nShiba Inu Price Analysis\n\nThe extended wick on SHIB’s candle pattern indicates that bearish traders are still active, selling off during upward movements.\n\nIf the price falls below the immediate support level of $0.000008, it would imply that the bears are still in control. In such a scenario, SHIB’s price could decline to a low of $0.0000077. A further drop below this point could lead to a retest of the long-standing support at $0.00000705.\n\nOn the other hand, a surge above EMA50 will strengthen bullish positions, sending the meme coin toward $0.00001."
    }
]