[
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA3LzA0L3NvbGFuYS1zb2wtY291bGQtbWF0Y2gtZXRoZXJldW1zLXBhcmFib2xpYy1nYWlucy1mcm9tLTIwMjEtc2F5cy1jcnlwdG8tYW5hbHlzdC_SAXRodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNy8wNC9zb2xhbmEtc29sLWNvdWxkLW1hdGNoLWV0aGVyZXVtcy1wYXJhYm9saWMtZ2FpbnMtZnJvbS0yMDIxLXNheXMtY3J5cHRvLWFuYWx5c3QvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jul 2023 07:00:00 GMT",
        "title": "Solana (SOL) Could Match Ethereum’s Parabolic Gains From 2021, Says Crypto Analyst - The Daily Hodl",
        "content": "A closely followed crypto trader believes that Solana (SOL) could soon mirror the parabolic 2020-21 price pattern of Ethereum (ETH).\n\nPseudonymous crypto analyst Inmortal tells his 194,900 Twitter followers that Solana’s price action may be in a similar set up to ETH just before it soared from $400 to nearly $5,000 in a matter of months.\n\n“ETH vs SOL. If you remember this fractal, you’re a bear market OG.”\n\nBased on Inmortal’s chart, he suggests Solana could soon skyrocket back to all-time highs and beyond after breaching the resistance of $60, similar to ETH hitting $400 in late 2020 before its explosion to new highs.\n\nSolana is trading for $19.71 at time of writing, up 3.3% during the last 24 hours.\n\nWidely followed pseudonymous analyst Kaleo is also bullish on Solana.\n\nKaleo tells his 593,100 Twitter followers that he believes Solana will start to move to the upside against Bitcoin (BTC).\n\nHe says that he’s impressed by how SOL has recovered from the hit it took during the fallout of the FTX debacle, and how its ecosystem has rapidly developed over the last several months.\n\n“The more I see how much the Solana community has continued to build after the FTX collapse, the more likely I think it is that it fills the gap back to pre-FTX insolvency levels this year.”\n\nSolana is currently trading for $0.000634 BTC ($19.70 USD) at time of writing. Kaleo predicts that Solana will soon breakout toward $0.00200 BTC.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on Twitter, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vdS50b2RheS9naWFudC13aGFsZXMtYmV0LWJpZy1vbi1ldGhlcmV1bS1ldGgtYml0Y29pbi1idGMtc3BhcmtpbmctbWFya2V0LW9wdGltaXNt0gFdaHR0cHM6Ly91LnRvZGF5L2dpYW50LXdoYWxlcy1iZXQtYmlnLW9uLWV0aGVyZXVtLWV0aC1iaXRjb2luLWJ0Yy1zcGFya2luZy1tYXJrZXQtb3B0aW1pc20_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jul 2023 07:00:00 GMT",
        "title": "Giant Whales Bet Big on Ethereum (ETH) & Bitcoin (BTC), Sparking Market Optimism - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe crypto space witnessed abnormal activity today, as major investors, often referred to as \"whales,\" made substantial investments in options contracts for Ethereum (ETH) and Bitcoin (BTC), as reported by Greeks Live portal. This surge in activity has sparked optimism within the market, pointing toward potential positive developments in the second half of the year.\n\nAdvertisement\n\nIn particular, a considerable number of block calls, primarily involving Buy-DEC-2200C/2400C and Sell-DEC-3000C Ethereum contracts known as bull spreads, dominated the trading floor. These bullish strategies suggest that traders anticipate favorable price movements for ETH. Impressively, over 12,500 sets of these options contracts were traded, with a total notional value exceeding $50 million, indicating a significant response from the market.\n\nBTC and ETH to USD by CoinMarketCap\n\nAdditionally, there was notable buying activity in out-of-the-money (OTM) JUL calls for Ethereum. This suggests that buyers initiated transactions for options contracts with strike prices above the current market value of ETH. Such buyer interest implies a belief among investors that Ethereum's price may experience further appreciation in the coming months.\n\nWhile Bitcoin did not witness the same level of activity as Ethereum, signs of active buying were still evident, reaffirming the cryptocurrency's appeal to traders and investors.\n\nThese events are surprising, particularly given the usual decrease in market activity after quarterly expiration. The confidence displayed by major investors has challenged this convention, prompting speculation among analysts and enthusiasts regarding the market's prospects for the second half of the year."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1zdXJnZXMtYWJvdmUtMzEwMDAtbWFya2V0LWNhcC1jcm9zc2VzLTYwMC1iaWxsaW9uL2FydGljbGVzaG93LzEwMTQ4MTI2MC5jbXPSAZ0BaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXByaWNlLXRvZGF5LWJpdGNvaW4tc3VyZ2VzLWFib3ZlLTMxMDAwLW1hcmtldC1jYXAtY3Jvc3Nlcy02MDAtYmlsbGlvbi9hbXBfYXJ0aWNsZXNob3cvMTAxNDgxMjYwLmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jul 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin surges above $31,000, market cap crosses $600 billion - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe cryptocurrency market was trading on a mixed note on Tuesday. Bitcoin, Ethereum, XRP and Cardano were trading with gains, while BNB , Litecoin, Polkadot and Solana witnessed some cuts.Bitcoin (BTC) rose 1.17% to $31,021, whereas Ethereum (ETH) was below the $1,950 level. BTC volume in the last 24 hours stood at approximately $16.17 billion, rising 47.24% in the last 24 hours.\"The crypto market witnessed a remarkable surge in the past 24 hours, with a total volume of $37.82 billion, marking an impressive 25.34% increase. Notably, the DeFi sector contributed $2.94 billion, accounting for 7.78% of the overall market volume,\" Shivam Thakral, CEO of BuyUcoin, said.\"Adding to the excitement, Bitcoin surpassed the $31,000 mark, driven by the euphoria surrounding the application for a Bitcoin ETF. This achievement further fuels optimism and interest in the cryptocurrency market,\" he added.The global cryptocurrency market cap was trading around $1.22 trillion, rising 0.97% in the last 24 hours.The market cap of Bitcoin, the world's largest cryptocurrency, was around $602 billion. Bitcoin's dominance is currently 49.56%, an increase of 0.18% over the day, according to CoinMarketCap.\"It has been nearly two weeks now that BTC has been trading in the range of $30 - $31.5k. BTC's stability hints towards a weakening grip by the bears. It is now a matter of when instead of 'if' BTC will cross the psychological resistance of $31.5k and mark a 14-month high again,\" Shubham Hudda, Senior Manager at CoinSwitch, said.Vikram Subburaj, CEO of Giottus Crypto Platform, said, \"Bitcoin has to break its resistance at $32,400 to fructify this rally in the near term. A rally towards $35,000 may also represent a local top. BTC dominance is consolidating above 51% and can break out to the upside post this phase.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 11.54 hours, IST on July 4, 2023)Bitcoin $31,021 1.17%Ethereum $1,955 0.55%Tether $1 0.01%BNB $245 -0.42%XRP $0.4883 1.49%Cardano $0.2967 1.45% Dogecoin $0.06854 0.80%Polygon $0.7086 -3.17%Solana $19.20 -0.98%Litecoin $107.8 -3.78%Polkadot $5.46 -0.63%Tron $0.07747 1.12%Avalanche $13.28 0.36%Shiba Inu $0.00000776 1.14%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V0aGVyZXVtLXVwZGF0ZS1saXF1aWQtc3Rha2luZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jul 2023 07:00:00 GMT",
        "title": "Upcoming Ethereum update stimulates liquid staking token growth - Blockworks",
        "content": "Liquid staking tokens (LSTs) have begun to pick up momentum this month as the second half of the year edges closer toward a highly anticipated Ethereum upgrade.\n\nDubbed Cancun-Deneb (or “Dencun” for short), the upgrade — expected sometime in the fourth quarter of this year — will see the introduction of a mechanism known as “blob-carrying transactions.”\n\nLiquid staking providers, especially Lido, have gained significant traction, underlining users’ preference for greater liquidity and flexibility in their staking activities, blockchain analytics firm Glassnode wrote in a research note on Monday.\n\nAs such, protocols and assets linked with staked ETH are delivering outsized gains when compared to other major digital assets in the market on the week.\n\nAs of 5 am ET, the governance token for liquid staking solution Lido DAO (LDO), has jumped about 11% and 24% on 1-week and 2-week timeframes respectively.\n\nFrax Share (FXS) — the governance token of the Frax ecosystem responsible for frxETH — and the staking pool known as Rocket Pool (RPL) have also risen by 11% and 2.4% over the past week.\n\nTo date, LST platforms and protocols have so far accrued $20 billion in total value locked, representing some 10.3 million ETH, data from DeFiLlama shows.\n\nLido has garnered a significant portion of the market, boasting roughly 7.5 million ETH staked on its platform, as per data from Nansen. That figure accounts for approximately 77% of the total market, data shows.\n\nBitcoin (BTC) and ether (ETH), on the other hand, were up approximately 1.9% and 3.9% over seven days — even as renewed investor interest comes via Blackrock’s spot ETF application last month. The pair of major blue-chip digital assets retain roughly 51% and 20% of the total market share, respectively.\n\nCancun upgrade could fuel further growth\n\nThe next update to Ethereum focuses on EIP-4844 (also known as proto-dank sharding), which would effectively allow for larger “blobs” of data to be transmitted to Ethereum nodes for a limited duration, as opposed to hosting that data permanently on the layer-1 chain.\n\nThe data is stored long enough for nodes to demonstrate that provers from layer-2 rollups, which make sure the transactions from the L2 chain are correct, have done their job.\n\n“With the upcoming Cancun upgrade, L2 sequencers can anticipate considerably higher profit margins as L1 data costs are set to decrease substantially,” Delphi analyst Joo Kian wrote in a blog post late last month.\n\nSequencers, whose role is to receive and order transactions in a way that reduces the load on the main Ethereum blockchain, would effectively be allowed to “operate more efficiently and profitably,” Kian added.\n\nIn the wake of the Shanghai hard fork, Ethereum’s staking landscape has seen a significant transformation. The upgrade, which introduced the ability to withdraw staked ETH, has catalyzed a surge in staking deposits, while demand for withdrawals has been scant.\n\nNotably, the volume of ETH staked surpassing or equalling exchange inflows post-upgrade, Glassnode wrote.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3NoYXJkcy1hbmQtbGF5ZXItMnMtdW5wYWNraW5nLW5lYXItYW5kLWV0aGVyZXVtcy1jb250cmFzdGluZy1hcHByb2FjaGVzLXRvLWJsb2NrY2hhaW4tc2NhbGFiaWxpdHkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jul 2023 07:00:00 GMT",
        "title": "Shards and Layer-2s: Unpacking NEAR and Ethereum's contrasting approaches to blockchain scalability - CryptoSlate",
        "content": "The landscape of blockchain scalability has evolved significantly in recent years, with Layer-2s (L2s) and sharding emerging as the two dominant approaches.\n\nEthereum, a key player in the crypto industry, has adopted rollup-centric L2s to scale its network, while NEAR protocol has taken a different path, choosing to scale via sharding. Both strategies offer unique solutions to blockchain scalability, but they also present their distinctive challenges.\n\nEthereum’s Layer 2s: A Rollup-Centric Approach\n\nNEARWEEK, a NEAR protocol publication, commended Ethereum for garnering considerable attention for its innovative rollup-centric scaling strategy. An L2 protocol is built atop an existing blockchain to enhance scalability, throughput, and privacy. This is achieved by executing state transitions off-chain from the Layer-1 (L1) they’re built upon and committing state roots and transactional data to the underlying L1.\n\nNEAR sees the driving philosophy behind rollups as the belief that a rollup can outperform the underlying L1 in terms of throughput due to decreased consensus overhead. However, in practice, NEAR believes the overall scaling achieved by rollups collectively has been somewhat disappointing, barely surpassing what a single rollup can offer.\n\nHowever, data from L2 analysis platform L2Beat offers a contrasting view due to increased L2 activity over the past year, as shown in the chart below.\n\nFurther, reviewing the top 10 Ethereum L2s shows Arbitrum One and zkSync Era closing in on Ethereum’s monthly transaction count. Additionally, Immutable X and Arbitrum Nova have surpassed Ethereum’s growth in average transactions per second (TPS) over seven days. Notably, Ethereum had a higher active TPS than any L2 scaling solution on the network on July 3.\n\n# Name Past Day TPS 7D Change Max Daily TPS 30D Count Data Source 1 Ethereum 12.29 6.48% 22.37 (2022 Dec 09) 31.45 M Blockchain RPC 2 Arbitrum One 9.69 -4.17% 31.64 (2023 Mar 23) 24.81 M Blockchain RPC 3 zkSync Era 8.63 -14.74% 12.00 (2023 May 16) 22.27 M Blockchain RPC 4 OP Mainnet 6.00 -12.97% 9.26 (2023 Jan 12) 14.82 M Blockchain RPC 5 dYdX 3.09 -38.54% 11.45 (2022 Feb 15) 9.42 M Closed API 6 Immutable X 2.01 7.47% 39.35 (2022 Mar 11) 5.67 M Closed API 7 Starknet 1.79 -9.17% 3.05 (2023 May 16) 4.61 M Explorer API 8 Arbitrum Nova 1.34 18.15% 10.93 (2023 Apr 27) 2.99 M Blockchain RPC 9 ApeX 0.95 2.27% 1.38 (2023 Apr 13) 2.68 M Closed API 10 zkSync Lite 0.89 -27.20% 3.29 (2023 Mar 21) 2.52 M Explorer API 11 Polygon zkEVM 0.64 -5.13% 0.82 (2023 Jun 13) 1.34 M Blockchain RPC\n\nData from L2Beat.com\n\nHowever, the primary cause of NEAR’s suggested lackluster performance is attributed to the fact that popular Ethereum decentralized applications (dApps) operate on nearly all rollups, resulting in similar transactions being ‘duplicated’ across different rollups.\n\nNEAR’s Shard-Centric Approach\n\nNEAR Protocol has, conversely, opted to tackle scalability through sharding, which partitions the network into distinct segments built directly into the protocol. According to NEARWEEK, each shard in NEAR’s architecture can be likened to an optimistic rollup in Ethereum’s approach.\n\nThe key advantage of NEAR’s sharding approach lies in its composability, which allows applications on one shard to interact with applications on another shard natively. This homogeneous sharding model allows applications to interact in the same way regardless if they’re deployed on the same shard, relieving developers from deciding which shard to deploy their applications.\n\nAdditionally, NEAR’s sharding model offers faster transaction finality, typically within two to three seconds, outperforming the extended finality times in the rollup universe.\n\nWhile NEAR Protocol does not list its real-time TPS on the block explorer, it can be calculated based on data from the most recent blocks. A CryptoSlate analysis of transactions from the NEAR block explorer showed an average TPS of roughly 5.7 transactions per second on July 4. This snapshot of NEAR’s TPS aligns with the top five L2s on the Ethereum network. The NEAR community foresees the protocol’s potential through sharding will reach 100,000 TPS in the future.\n\nContrasting Design Philosophies\n\nThe different scaling approaches adopted by Ethereum and NEAR highlight their contrasting design philosophies. While Ethereum prioritizes resilience, maintaining a simple L1 protocol design, NEARWEEK stated NEAR Protocol leans towards a simplified user experience, taking on additional protocol complexity to ensure a superior UX.\n\nFurthermore, it’s important to note that NEAR is not aiming to be “just an L1” as it seeks to function as a Blockchain Operating System (BOS), providing a universal layer for navigating and discovering open web experiences. Through the BOS, NEAR aims to\n\n“empower developers and users from various blockchains, including Ethereum Layer 2s, to construct and utilise applications across a multitude of blockchain ecosystems.”\n\nMore details on NEAR’s BOS vision can be found on its Medium account.\n\nBlockchain scalability remains a complex and crucial issue in the crypto world. As Ethereum’s rollup-centric L2s and NEAR’s sharding evolve, it will be intriguing to see which approach proves most effective in the long run.\n\nMentioned in this article"
    }
]