[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMS8xMS9hcnRodXItaGF5ZXMtc2F5cy1ldGhlcmV1bS1jb3VsZC1leHBsb2RlLWJ5LW92ZXItNDYwMC1kb3VibGVzLWRvd24tb24tMS1taWxsaW9uLWJpdGNvaW4tcHJlZGljdGlvbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Arthur Hayes Says Ethereum Could Explode by Over 4,600%, Doubles Down on $1 Million Bitcoin Prediction - The Daily Hodl",
        "content": "BitMEX co-founder Arthur Hayes is doubling down on his massively bullish Bitcoin (BTC) predictions while forecasting that Ethereum (ETH) could hit a six-figure price.\n\nHayes says that the time to turn bullish on crypto is “now” while unveiling a target of $100,000 for Ethereum – an increase of about 4,669% from the current level.\n\nThe BitMEX founder also reiterates his prediction that Bitcoin will hit $1 million.\n\nIn a new blog post, Hayes further says that as currencies debase across the globe, the “smartest trade” would be “going long crypto.” According to the BitMEX founder, Bitcoin and Ethereum are “crypto’s reserve assets” while “everything else is a sh*tcoin.”\n\nBesides Bitcoin and Ethereum, Hayes says there are other opportunities that exist in the crypto space offering the potential of higher returns at a greater risk.\n\n“Then, we get to other layer-one blockchains that claim to be an improvement on Ether. Solana is an example. These all got beaten up real bad during the bear market. As such, they will levitate off extreme lows and provide great returns for intrepid investors. But, they are still all overhyped, me-too, pieces of sh*t that won’t overtake Ethereum in terms of active developers, decentralized applications (DApps) activity, or Total Value Locked.\n\nFinally, all manner of DApps and their respective tokens will pump. This is the most fun, because down here is where you get the 10,000x returns. Of course, you’re also more likely to get rugged, but where there is no risk there is no return.”\n\nEthereum is trading at $2,097 at time of writing while Bitcoin is worth $37,083.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMinwFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tZWlnaHRlZW4tbW9udGhzLWFzY2VuZGluZy10cmlhbmdsZS1wYXR0ZXJuLWFwcHJhaXNlcy00LTAwMC10YXJnZXQtZm9yLWV0aC0yMDIzMTExMTA3MzDSAaMBaHR0cHM6Ly93d3cuZnhzdHJlZXQuY29tL2FtcC9jcnlwdG9jdXJyZW5jaWVzL25ld3MvZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi1laWdodGVlbi1tb250aHMtYXNjZW5kaW5nLXRyaWFuZ2xlLXBhdHRlcm4tYXBwcmFpc2VzLTQtMDAwLXRhcmdldC1mb3ItZXRoLTIwMjMxMTExMDczMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Eighteen-months ascending triangle pattern appraises $4,000 target for ETH - FXStreet",
        "content": "Share:\n\nEthereum price has been consolidating along an ascending trendline for the past eighteen months, with the $2,035 level holding as resistance.\n\nThe overall price action has formed an ascending triangle pattern, which forecasts a $4,736 price target for ETH.\n\nThe bullish thesis will be invalidated once the altcoin breaks and closes below the ascending trendline at the $1,500 psychological level.\n\nEthereum (ETH) price is bullish on lower and higher timeframes alike, as token holders ride the wave of what already seems to be the making of a bull market. On the higher timeframe, however, the target objective for the largest altcoin by market capitalization looks overly ambitious, but not impossible as community members turn faces toward the exchange-traded fund (ETF) narrative and the much-anticipated Bitcoin (BTC) halving, together with their combined effect on asset prices.\n\nAlso Read: Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC rages on, $40,000 may not be hopium after all\n\nEthereum price 18-month ascending triangle forecasts $4,736 target\n\nEthereum (ETH) price consolidating above an ascending triangle, combined with the effect of the formation of multiple local tops around the$2,035 level has led to the formation of an ascending triangle pattern.\n\nSuch a technical formation is created when the asset’s price lead to the formation of a horizontal line connecting the swing highs, while a rising trendline trails it from below connecting the swing lows. Together, the trendlines form a triangle, with traders watching for breakouts from the horizontal trendline. The target objective for such a technical formation is determined by measuring the height of the triangle and superimposing it at the breakout point.\n\nFor Ethereum price, the height of the triangle is around 134%, from $865 to $2,035 on the weekly timeframe. Superimposing this percentage difference on the weekly chart puts a target objective of $4,736.\n\nThe Relative Strength Index (RSI) spurs optimism, moving north to signify rising momentum while its position at 64 shows there is still more room to the north. Effectively, the Awesome Oscillators (AO) histogram bars are also flashing green to show the bulls maintain a strong presence in the ETH market.\n\nETH/USDT 1-week chart\n\nOn the flip side, profit-taking could nullify the projection by sending Ethereum price south, potentially losing the support offered by the ascending trendline at the $1,500 psychological level. This would invalid the bullish thesis."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5meGVtcGlyZS5jb20vbmV3cy9hcnRpY2xlL2ZpdmUtdGhpbmdzLXRvLWtub3ctaW4tY3J5cHRvLXRoaXMtd2Vlay1ibGFja3JvY2stYW5kLWV0aGVyZXVtLWV0Zi1uZXdzLXN0ZWFscy10aGUtc2hvdy0xMzg4MDI50gF7aHR0cHM6Ly9hbXAuZnhlbXBpcmUuY29tL2VuL2ZpdmUtdGhpbmdzLXRvLWtub3ctaW4tY3J5cHRvLXRoaXMtd2Vlay1ibGFja3JvY2stYW5kLWV0aGVyZXVtLWV0Zi1uZXdzLXN0ZWFscy10aGUtc2hvdy8xMzg4MDI5?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Five Things to Know in Crypto This Week: BlackRock and Ethereum ETF News Steals the Show - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tZGFpbHktcmV2ZW51ZS1zb2Fycy10by00LW1vbnRoLWhpZ2gv0gFXaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy9ldGhlcmV1bS9ldGhlcmV1bS1kYWlseS1yZXZlbnVlLXNvYXJzLXRvLTQtbW9udGgtaGlnaC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Daily Revenue Soars To A 4-Month High Of $10 Million - NewsBTC",
        "content": "When Ethereum (ETH) exploded past $2,000 on November 9, Erik Smith, the Chief Investment Officer of 401 Capital, observed that the platform’s average daily revenue surged to the highest level in four months.\n\nAccording to data, Ethereum generated $10 million in daily revenue, extending gains registered on the previous day and pushing the metric to the highest point since July.\n\nEthereum Prices Above $2,000, Revenue Rising In November\n\nFor now, ETH prices remain muted but are trading around November 9 highs and remain within a bullish formation backed by decent trading volumes. Prices are still trending above the $2,000 psychological support, a critical reaction level.\n\nA look at the Ethereum candlestick arrangement in the daily chart shows that while there is a notable spike in daily revenue, prices are still below July 2023 highs. Then, the coin soared to as high as $2,100 before pulling back as the momentum triggered by the broader crypto’s expectation of a Bitcoin Exchange-Traded Fund (ETF) approval faded. However, prices have since sharply recovered, adding roughly 40% from October lows and shaking off the weakness registered on August 17 when the coin plunged by 14%.\n\nToken Terminal data shows that Ethereum’s daily revenue has steadily risen in the first ten days of November. Looking at trends, the average daily income has doubled from $5 million in the first five days of the month. Usually, an uptick in daily average revenue in a network points to increasing on-chain activity either through smart contract deployment or simple transfers, which necessitates the payment of gas fees.\n\nImproving Scalability In The Long Term\n\nHow the widespread adoption of Ethereum layer-2 and sidechain scaling solutions will impact the network revenue is not immediately apparent. }\n\nWhat’s clear is that the more protocols leverage the protocol, deploying multiple solutions, the more revenue the network will generate for validators and stakers. Staking rewards are drawn partly from transaction fees paid as gas, new issuance, and burned miner extractable value (MEV).\n\nStill, the dollar value of ETH minted as revenue depends on spot rates. If the uptrend is sustained, this figure will continue expanding. Even so, there might be more demand for the network, which is still struggling to scale on-chain.\n\nEthereum 2.0 aims to resolve these challenges in the coming years by increasing the general throughput via solutions like Sharding. Sharding will split Ethereum into small but interconnected networks called shards. Each shard will independently process each set of transactions and maintain its state, allowing the mainnet to scale.\n\nFeature image from Canva, chart from TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY3J5cHRvLm5ld3MvYml0Y29pbi1wcmljZS13aWxsLWNvbnRpbnVlLWR3YXJmaW5nLWV0aGVyZXVtLXRvcC1jcnlwdG8tYW5hbHlzdC1zYXlzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin price will continue dwarfing Ethereum, analyst says - crypto.news",
        "content": "Into The Cryptoverse CEO Benjamin Cowen recently discussed Ethereum’s (ETH) performance in relation to Bitcoin’s (BTC) dominance as the flagship digital asset.\n\nIn a recent YouTube video, Cowen suggests a continued rise in Bitcoin dominance (BTC.D), indicating that Ethereum may lag behind and show smaller gains compared to BTC.\n\nCowen explains that his crypto portfolio has predominantly held more Bitcoin because he anticipates that BTC will outperform numerous assets, though not all.\n\nAdditionally, Cowen notes that Ethereum against Bitcoin (ETH/BTC) is encountering substantial resistance after falling below the trendline and attempting a retest.\n\nYou might also like: Bitcoin and Ethereum outperform traditional assets in 2023\n\nA BTC rally would result in the breakdown of Ether-Bitcoin, he explained. He pointed out how the ETH/BTC pair finally broke the wedge to the downside, highlighting that it’s akin to what happened in the last cycle.\n\nAs he connects the dots, the Ether-Bitcoin pair is potentially backtesting the trendline that served as support in October 2022, March 2023, June 2023, and September 2023. Since the ETH/BTC pair is now testing from beneath the wedge in November 2023, it could offer a significant resistance level.\n\nHowever, Cowen cautions that even if ETH/BTC manages to move above the trendline, the pair will encounter several resistance levels to the upside. These levels must be successfully flipped as support to convincingly reverse the downtrend.\n\nHe further explained, stating that, there are numerous resistance levels. Whether one opts to depict them horizontally or analyze them differently, ETH/BTC still faces a significant challenge. It must have to overcome these resistance levels to indicate a meaningful reversal.\n\nAt the time of writing, ETH/BTC is valued at 0.05578 BTC, equivalent to $2,068.80 on Tradingview. Meanwhile, BTC/USDT is valued at $37,112, according to Coingecko.\n\nETF expectations\n\nThe recent surge in Bitcoin and Ethereum has significantly influenced the cryptocurrency market.\n\nBitcoin has reached $37,000, marking highs not seen since May 2022. This may be driven by the ongoing expectation that U.S. regulators approve a spot Bitcoin exchange-traded fund (ETF).\n\nSimultaneously, Ethereum has rallied close to $2,100, reclaiming the $2,000 level for the first time since mid-July. The rise in digital assets, especially XRP, may also be attributed to Bitcoin surpassing $35,000.\n\nAdditionally, news about BlackRock planning to file for an ETH-based ETF may have also fueled Ethereum’s upward momentum.\n\nFollowing the anticipation of the ETF approval, which has propelled cryptocurrency prices and related stocks, This rally could be part of a broader uptrend in the crypto sector, recognized as a significant $17.7 trillion opportunity by market strategists.\n\nHowever, altcoins like XRP, DOGE, UNI, and XLM have experienced declines, possibly due to a pause in capital rotation towards smaller tokens.\n\nFed chair Jerome Powell recently delivered a policy address to the Economic Club of New York, providing insights into the current state of the US economy and monetary policy.\n\nThis statement is significant given the critical juncture of the U.S. economy, marked by improving inflation figures alongside surging Treasury yields, creating conflicting signals about the direction of monetary policy.\n\nInterpreted as a signal, Powell’s statement suggests that the Fed might persist with its tightening cycle, contrary to recent market expectations of a more dovish approach.\n\nRead more: Bitwise withdraws bitcoin and ethereum ETF application\n\nFollow Us on Google News"
    }
]