[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDcvMzEvY2Vsby1wcm9wb3NhbC10by1taWdyYXRlLXRvLWV0aGVyZXVtLWxheWVyLTItcGFzc2VzL9IBYWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDcvMzEvY2Vsby1wcm9wb3NhbC10by1taWdyYXRlLXRvLWV0aGVyZXVtLWxheWVyLTItcGFzc2VzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Celo Proposal to Migrate to Ethereum Layer 2 Passes - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvZXRoZXJldW0tcHJpY2UtYW5hbHlzaXMtd2lsbC1tZWdhcGhvbmUtcGF0dGVybi1yZWNvdmVyeS1jeWNsZS10by0yMjAwL9IBZ2h0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvZXRoZXJldW0tcHJpY2UtYW5hbHlzaXMtd2lsbC1tZWdhcGhvbmUtcGF0dGVybi1yZWNvdmVyeS1jeWNsZS10by0yMjAwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Price Analysis: Will Megaphone Pattern Trigger a New Recovery Cycle to $2200? - CoinGape",
        "content": "Ethereum Price Analysis: Amid the increasing FUD in the crypto market, the Ethereum price correction phase stalled at the support of the megaphone pattern near the $1830 mark. This support was expected to bolster buyers for a bullish reversal, but the price trend turned sideways. The consolidation reflects a weakness in bullish momentum as buyers fail to push the altcoin higher despite obtaining strong support. Will ETH price rebound to $2000 or the correction phase may prolong below $1800?\n\nAlso Read: Ethereum Price Charts Signal Buy The Dip Opportunity Ahead\n\nadvertisement\n\nEthereum Price Daily Chart\n\nThe price range between $1890 and $1830 creates a no-trading zone.\n\nA bullish breakout from the $1890 resistance would trigger a new recovery cycle within the megaphone pattern\n\nThe intraday trading volume in Ether is $4.8 Billion, indicating a 48% gain.\n\nSource- Tradingview\n\nOn July 24th, the Ethereum price witnessed a 2% intraday fall and reached the bottom trendline of the megaphone pattern at $1830. Since then the price trend turned sideways and remained within the range of the aforementioned red candle.\n\nThe $1890 resistance and $1830 support are the crucial levels that can influence the near future trend of ETH coins. Currently, the second-largest cryptocurrency Ethereum trades at $1868, with a bullish candle of 0.3% gain.\n\nIf the overhead supply continues to pressure the market participants, a breakdown below the pattern support trendline and $1830, will increase the selling momentum. The breakdown may. pull the price to $1800 support, registering a potential 4% drop.\n\nThe anticipated pullback to $1800 can allow interested traders to accumulate at the support trendline carrying the current uptrend.\n\nHere’s How ETH Price May Regain $2000 Mark\n\nFor Ethereum price to regain its bullish recovery, the buyers need to break the overhead resistance of $1890. This breakout will indicate the microphone pattern is still intact and the bull cycle within this structure could lead Ethereum price near $2200.\n\nBollinger band: The lower support of Bollinger band moving sideways could offer strong support for crypto buyers.\n\nMoving average convergence divergence: the MACD (blue) and signal(Orange) lines going flat at the median level indicate uncertainty traders."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL3d3dy5iZW56aW5nYS5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS8yMy8wNy8zMzQ4MzU5Ni9iaXRjb2luLWV0aGVyZXVtLWRvZ2Vjb2luLXR1bWJsZS1hZnRlci1zZWMtbGF3c3VpdC1hZ2FpbnN0LWludGVybmV0LW1hcmtldGVyLXJpY2hhcmQtaGVhcnTSAS1odHRwczovL3d3dy5iZW56aW5nYS5jb20vYW1wL2NvbnRlbnQvMzM0ODM1OTY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, Dogecoin Tumble After SEC Lawsuit Against Internet Marketer Richard Heart: Analyst Say - Benzinga",
        "content": "Major cryptocurrencies experienced a decline on Monday evening after the Securities and Exchange Commission (SEC) launched a lawsuit against internet marketer Richard Heart, along with his projects Hex, PulseChain, and PulseX. Additionally, the market grappled with the consequences of the recent exploit on the stablecoin exchange Curve.\n\nCryptocurrency Gains +/- Price (Recorded 9:30 p.m. EDT) Bitcoin BTC/USD -0.80% $29,186 Ethereum ETH/USD -0.94% $1852 Dogecoin DOGE/USD -1.31% $0.077\n\nWhat Happened: CRV, the token associated with Curve Finance’s DAO, has experienced a decline of 10.3%, reaching 56 cents.\n\nAnother contributing factor is the lending position held by founder Michael Egorov on the Aave lending protocol. Egorov currently has a substantial $168 million lending position secured by CRV, which is approaching the liquidation point. If the position is liquidated, the consequent rapid price declines could trigger a series of cascading liquidations, leading to a flood of liquidated assets in the market.\n\nTop Gainer (24 Hour)\n\nCryptocurrency Gains +/- Price (Recorded 9:30 p.m. EDT) Bitcoin Gold +12.83% $18.45 Bone Shibaswap +5.90% $1.54 XDC Network +2.88% $0.05927\n\nCurrently, the global crypto market capitalization stands at $1.18 trillion, a 0.78% decrease in the last day.\n\nStocks saw a modest increase on Monday as Wall Street began a busy earnings week, capping off a successful month. The S&P 500 inched up by 0.15%, while the Nasdaq Composite experienced a 0.21% rise.\n\nSee More: Best Crypto Day Trading Strategies\n\nAnalyst Notes: Edward Moya, Senior Analyst at OANDA believes that Curve Finance hack is \"a blow for Ethereum's DeFi ecosystem, but not likely to trigger a massive selloff for Bitcoin.\"\n\nCrypto analyst Benjamin Cowen said Ethereum may not be ready to shine just yet, supported by historical data.\n\nCowen analyzes Ethereum’s historical average monthly return on investment (ROI) and finds that Q3, or the summer months, are generally not the most favorable times to accumulate or hold ETH.\n\n\n\n\"The one-year timeframe shows you that December and January are best, on average. The worst month was July. If you think about it, think about where ETH was last July. It wasn't at a very different price than what it is today, I mean you're talking pretty much the same price, maybe plus or minus a couple of hundred dollars but that's where we were last July. And you can see there's this sort of lull in even the one-year ROI buying in that April, May, June July timeframe but as you get further out into Q4, it tends to go up.\"\n\nPhoto Courtesy: Shutterstock.com\n\nRead Next: Jim Cramer Advises Against Using Binance, Provokes Strong Reactions From Twitter Users"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL3d3dy5iZW56aW5nYS5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS8yMy8wNy8zMzQ4MzU5Ni9iaXRjb2luLWV0aGVyZXVtLWRvZ2Vjb2luLXR1bWJsZS1hZnRlci1zZWMtbGF3c3VpdC1hZ2FpbnN0LWludGVybmV0LW1hcmtldGVyLXJpY2hhcmQtaGVhcnTSAS1odHRwczovL3d3dy5iZW56aW5nYS5jb20vYW1wL2NvbnRlbnQvMzM0ODM1OTY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, Dogecoin Tumble After SEC Lawsuit Against Internet Marketer Richard Heart: Analyst Say - Benzinga",
        "content": "Major cryptocurrencies experienced a decline on Monday evening after the Securities and Exchange Commission (SEC) launched a lawsuit against internet marketer Richard Heart, along with his projects Hex, PulseChain, and PulseX. Additionally, the market grappled with the consequences of the recent exploit on the stablecoin exchange Curve.\n\nCryptocurrency Gains +/- Price (Recorded 9:30 p.m. EDT) Bitcoin BTC/USD -0.80% $29,186 Ethereum ETH/USD -0.94% $1852 Dogecoin DOGE/USD -1.31% $0.077\n\nWhat Happened: CRV, the token associated with Curve Finance’s DAO, has experienced a decline of 10.3%, reaching 56 cents.\n\nAnother contributing factor is the lending position held by founder Michael Egorov on the Aave lending protocol. Egorov currently has a substantial $168 million lending position secured by CRV, which is approaching the liquidation point. If the position is liquidated, the consequent rapid price declines could trigger a series of cascading liquidations, leading to a flood of liquidated assets in the market.\n\nTop Gainer (24 Hour)\n\nCryptocurrency Gains +/- Price (Recorded 9:30 p.m. EDT) Bitcoin Gold +12.83% $18.45 Bone Shibaswap +5.90% $1.54 XDC Network +2.88% $0.05927\n\nCurrently, the global crypto market capitalization stands at $1.18 trillion, a 0.78% decrease in the last day.\n\nStocks saw a modest increase on Monday as Wall Street began a busy earnings week, capping off a successful month. The S&P 500 inched up by 0.15%, while the Nasdaq Composite experienced a 0.21% rise.\n\nSee More: Best Crypto Day Trading Strategies\n\nAnalyst Notes: Edward Moya, Senior Analyst at OANDA believes that Curve Finance hack is \"a blow for Ethereum's DeFi ecosystem, but not likely to trigger a massive selloff for Bitcoin.\"\n\nCrypto analyst Benjamin Cowen said Ethereum may not be ready to shine just yet, supported by historical data.\n\nCowen analyzes Ethereum’s historical average monthly return on investment (ROI) and finds that Q3, or the summer months, are generally not the most favorable times to accumulate or hold ETH.\n\n\n\n\"The one-year timeframe shows you that December and January are best, on average. The worst month was July. If you think about it, think about where ETH was last July. It wasn't at a very different price than what it is today, I mean you're talking pretty much the same price, maybe plus or minus a couple of hundred dollars but that's where we were last July. And you can see there's this sort of lull in even the one-year ROI buying in that April, May, June July timeframe but as you get further out into Q4, it tends to go up.\"\n\nPhoto Courtesy: Shutterstock.com\n\nRead Next: Jim Cramer Advises Against Using Binance, Provokes Strong Reactions From Twitter Users"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS10dXJucy1laWdodC1iaXJ0aGRheS1jcnlwdG8tY29tbXVuaXR50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Ethereum's 8th birthday: Crypto industry shares its top moments - Cointelegraph",
        "content": "The crypto community has come together to celebrate the 8th birthday of the Ethereum network, marking eight years since the Ethereum Foundation first sent the network live.\n\nOn July 30, 2015, former Ethereum Foundation CCO Stephan Tual penned a blog post, officially announcing that the network had been rolled out.\n\n\"The vision of a censorship-proof ‘world computer’ that anyone can program, paying exclusively for what they use and nothing more, is now a reality,\" he wrote.\n\nScreenshot of blog post from Stephan Tual. Source: Ethereum Foundation\n\nEight years later, Ethereum and its native currency Ether (ETH) has grown to become the second-largest crypto asset in existence, boasting a market capitalization of $225 billion and more than 1,900 monthly active developers.\n\n8 years of growth\n\nCommunity members marked the occasion by sharing fond memories and looking back at its prices, development and overall growth since inception.\n\nBankless co-host Ryan Sean Adams noted that Ethereum reportedly boasts $400 billion in secured value, $3.6 billion in annualized profits and a total of 17.8 million blocks of digital assets.\n\nHappy birthday Ethereum!\n\n\n\n$400 billion in secured value, $3.6 billion in annualized profits, and a total of 17.8 million blocks of uncensorable digital property.\n\n\n\nNot bad for an 8 year old. — RYAN SΞAN ADAMS - rsa.eth (@RyanSAdams) July 30, 2023\n\nUsing the networks’ eth birthday as an opportunity to reminisce, Binance CEO Changpeng Zhao posted a tweet on X recounting the time that Ethereum co-founder Vitalik Buterin stayed with him in Tokyo in the months leading up to the launch of Ethereum.\n\nCZ said Buterin was speaking about ETH “non-stop” at the time and joked about missing out on buying Ethereum at inception. “If I had bought ETH then, I might not have had the need or drive to start Binance. Who knows?” he quipped.\n\nOn this 8th birthday of #Ethereum, a little throw back to May 2, 2015, in Tokyo, just before #ETH was officially born. @VitalikButerin stayed in my apartment in Tokyo during this trip. He was already working on and talking about ETH non-stop. And I still missed (didn't buy)… pic.twitter.com/84B6KN73Qf — CZ Binance (@cz_binance) July 30, 2023\n\nReformed Bitcoiner Udi Wertheimer celebrated the occasion with a dash of humor, referring to the Ethereum network as his “favorite Bitcoin sidechain.”\n\nHappy birthday Ethereum!\n\n\n\nMy favorite bitcoin sidechain — Udi Wertheimer (@udiWertheimer) July 30, 2023\n\nRelated: Ethereum is about to get crushed by liquid staking tokens\n\nEthereum was co-founded by a number of prominent figures, most notably Buterin, along with Charles Hoskinson, Gavin Wood, Joseph Lubin and Anthony Di Iorio.\n\nBy allowing developers to create smart contracts and build new blockchain-based applications, Ethereum became integral to the initial coin offering boom in late 2017 and the explosion of decentralized finance (DeFi) protocols and development — dubbed “DeFi summer” — in 2020.\n\nIt was 8 years ago today, we launched #ethereum from a small office in Waldemarstraße 37A in Berlin\n\n\n\nWhat a journey its been since then?\n\n\n\nIt became the most widely used cryptocurrency network, switched to PoS and spawned many alt-L1s and L2s\n\n\n\nExcited for what the future brings! pic.twitter.com/bmgcjTVLbE — Lefteris Karapetsas | Hiring for @rotkiapp (@LefterisJP) July 30, 2023\n\nA little more than a year after DeFi summer, Ether notched its all-time-high of $4,878 on Nov. 10, 2021. At the time of writing ETH was changing hands for $1,869.\n\nEthereum all-time price chart. Source: CoinGecko\n\nMost recently, crypto enthusiasts witnessed the successful implementation of the Merge upgrade on Sept. 15, 2022, which saw the network transition from aproof-of-work to a proof-of-stake consensus mechanism — driving down its energy usage and unlocking staking incentives for validators and investors.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Here’s how Ethereum’s ZK-rollups can become interoperable"
    }
]