[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2JpbmFuY2UtY29udmVydHMtMWItYnVzZC10by1iaXRjb2luLWV0aGVyZXVtLWJuYi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Binance converts $1B BUSD to Bitcoin, Ethereum, BNB - CryptoSlate",
        "content": "Binance CEO Changpeng Zhao (CZ) has confirmed that the exchange has converted the remaining $1 billion in its industry recovery fund to native crypto assets — including Bitcoin, Ethereum, and BNB.\n\nThe transaction was completed during the early trading hours of March 13, according to on-chain data. CZ pointed out how cheap the transaction was and added that:\n\n“Imagine moving $980 million through a bank before banking hours on a Monday.”\n\nBinance set up the industry recovery fund in November 2022 following the collapse of several crypto firms. CZ said the fund is meant to provide liquidity for strong projects facing a liquidity crisis.\n\nWhy Binance is converting BUSD\n\nIn a March 13 tweet, CZ said the conversion was necessary because of the changes that have affected stablecoins and banks in recent weeks.\n\nThe recovery fund was initially in its Binance USD (BUSD). However, recent events have led to the capitulation of several crypto-friendly banks — Silvergate, Silicon Valley Bank, and Signature — and have affected confidence in some stablecoins.\n\nU.S. regulators took control of these crypto-friendly banks citing systemic risks to the broader financial landscape. President Biden said he directed Treasury Secretary Janet Yellen to work with banking regulators to address the problems with these firms.\n\nMeanwhile, the stablecoin BUSD also came under regulatory scrutiny. New York’s financial regulator ordered its issuer Paxos to stop other mints in February.\n\nMentioned in this article"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1jby1mb3VuZGVyLXZpdGFsaWstYnV0ZXJpbi1zZWxsaW5nLWV0aC1ob2xkaW5ncy10aGlzLW1pZ2h0LWJlLXJlYXNvbtIBYWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1jby1mb3VuZGVyLXZpdGFsaWstYnV0ZXJpbi1zZWxsaW5nLWV0aC1ob2xkaW5ncy10aGlzLW1pZ2h0LWJlLXJlYXNvbj9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Ethereum Co-Founder Vitalik Buterin Selling ETH Holdings, This Might Be Reason - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAccording to blockchain security firm PeckShieldAlert, Ethereum creator Vitalik Buterin recently moved 200 ETH to the Kraken crypto exchange.\n\nAdvertisement\n\nInvestors often move their crypto to exchanges when they are looking to sell. This often attracts a transaction cost, which might imply there is an intent behind such moves.\n\nThat said, the Ethereum creator likely needed the funds for a specific purpose, such as funding a fresh project or covering expenditures, although the exact reason for the transaction remains unknown.\n\nAt the time of writing, ETH was up 13% in the past 24 hours at $1,656.\n\nReflexer received 500 Ethereum from Vitalik Buterin's designated address over the weekend, according to PeckShieldAlert. Later, he minted the 150,000 Rai Reflex Index (RAI).\n\nThe address subsequently exchanged 17,500 RAI for 50,000 DAI, and then 132,500 RAI for 378,500 USDC.\n\nIn the past week, Buterin sold some of his altcoin holdings, later declaring that the coins had \"no cultural or moral value.\"\n\nFor 58 ETH, Buterin sold 9.9 billion CULT tokens, CultDAO's native token. In addition, he sold his BITE and MOPS stakes. The sales came to 220 ETH in total."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLXByaWNlLXRvZGF5LWV0aC1oaWtlcy1nb2VybGktdGVzdG5ldC1jcnlwdG8tbWFya2V0LWNhcC1icmVhY2hlcy10cmlsbGlvbi_SAWtodHRwczovL2NvaW5nYXBlLmNvbS9ldGhlcmV1bS1wcmljZS10b2RheS1ldGgtaGlrZXMtZ29lcmxpLXRlc3RuZXQtY3J5cHRvLW1hcmtldC1jYXAtYnJlYWNoZXMtdHJpbGxpb24vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Ethereum Price Today: ETH Hikes Over 9% Ahead Of Goerli Testnet As Crypto Market Cap Breaches Trillion Mark - CoinGape",
        "content": "Ethereum Price Today: The market is trading in green as Bitcoin and other Altcoins are seeing a jump today despite the collapse of two major crypto-related banks last week. As of writing, Bitcoin price increased by 8.68% in the last 24 hours. Ethereum price increased by 8.01%.\n\nThe global crypto market cap stands at 1.03 trillion USD, an increase of 7.18% over the past day. The total crypto market volume in the last 24 hours increased by 2.09% and is currently at 75.21 billion USD.\n\nadvertisement\n\nEthereum (ETH) price rises by 8.68%\n\nThe second largest crypto, Ethereum price today escalated by 8.68% in the last 24 hours. The market cap for Ethereum is 196.50 billion USD. Moreover, trading volume increases by 11.29% over the previous 24 hours, showing increased interest among investors. Each ETH token is trading for 1,605 USD. Source: coinmarketcap\n\nAlso read: Bitcoin (BTC) Price Shoots Over 8%, Why Is the Market Up Despite Bank Collapses?\n\nThe Shanghai upgrade which was all set to be executed by the end of March has been pushed further to April. The launch of the Goerli testnet, which serves as a thorough dress rehearsal for the Shanghai upgrade, is currently scheduled by Ethereum’s developers to take place on or around March 14.\n\nWhat’s next for ETH?\n\nThe price of Ethereum experienced a surge toward $1,370, which was met with resistance from the bulls. However, ETH established a strong foundation and continued to climb above the $1,450 resistance level.\n\nNotably, there was a distinct increase above the $1,500 and $1,565 resistance levels. Additionally, a significant bearish trend line was broken, with resistance close to $1,480 on the hourly chart of ETH/USD. Eventually, the pair exceeded the $1,600 resistance level, peaking at $1,636.\n\nAlso read: Breaking: USDC Set To Regain $1 Peg As Circle Devises New Strategy To Cover Shortfall"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1zaGFuZ2hhaS13aXRoZHJhd2Fscy1hbmQtcmVjZW50LXVwZGF0ZXMtZm9yLWV0aC1ob2xkZXJzL9IBW2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1zaGFuZ2hhaS13aXRoZHJhd2Fscy1hbmQtcmVjZW50LXVwZGF0ZXMtZm9yLWV0aC1ob2xkZXJzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Ethereum: Shanghai withdrawals and recent updates for ETH holders - AMBCrypto News",
        "content": "With Ethereum’s Shanghai upgrade, the $28 billion worth of staked ether will start to become available in a few weeks.\n\nDue to the high yield, around 17.5 million ETH have been invested in self-hosted or staking-as-a-service validators.\n\nWithin a few weeks, the $28 billion worth of staked ether (ETH) will start to become available thanks to Ethereum’s Shanghai upgrade.\n\nThis supply, which is now unavailable for withdrawal and cannot be sold, will gradually be restored to the public markets and have an impact on the price of Ethereum.\n\nAccording to the Ethereum website, Shanghai may become live in the first half of 2023. According to some analysts, the change might go into effect as soon as April 15, which is U.S. tax day. Staking into Ethereum’s Beacon Chain hasn’t permitted ETH withdrawals since late 2020.\n\nEthereum guaranteed participants in its proof-of-stake validation a variable 3-12% annualized yield as payment for their multi-month pledge to refrain from selling.\n\nAround 17.5 million ETH have been invested in self-hosted or staking-as-a-service validators as a result of that high yield.\n\nShanghai update staking reward\n\nThe future updates consist of two simultaneous upgrades that have been combined to cover every aspect of the upgrade.\n\nShanghai alludes to modifications made to Ethereum’s execution layer, primarily making it possible to deposit staked ETH to execution layer wallets. The Beacon Chain, now known as Capella, must adapt concurrently with the Shanghai upgrading.\n\nA lot of investors might be preparing for a large exodus of ETH, which would be bad for pricing or less secure for Ethereum’s blockchain. Nevertheless, the new upgrade has restrictions that prevent customers from withdrawing all of their staked ETH at once.\n\nThe Shanghai upgrade to Ethereum distinguishes staking payouts from the 32 ETH minimum requirement formerly necessary to activate Proof-of-Stake validator keys.\n\nIn summary, withdrawing validators’ incentives is much simpler and quicker than withdrawing the greater 32 ETH amount from validator activation. Around 18 months will pass before all prizes and the first 32 ETH can be fully withdrawn.\n\nThe post-Shanghai method will permit around 1,800 validators to withdraw their entire initial deposit plus rewards each day. This function deftly restricts the daily withdrawal of ETH.\n\nEthereum chooses 1,800 at random and gives no technical justification; the quota is just eight complete withdrawals every epoch and is meant to reduce sell pressure on ETH.\n\nEthereum developers made staking easy and withdrawing difficult\n\nThe Ethereum developers made stakes simple and withdrawals challenging. Instead of the typically preferred 0x00 prefix, validators will need to alter their credential prefixes to 0x01 before withdrawing.\n\nA withdrawal address must be manually specified by validators because, for some reason, it can only be done so once. Any error could prevent a validator from withdrawing in the future.\n\nOnly after the validator has a withdrawal address set and moves up in the long queue to become eligible for withdrawal can withdrawals take place."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZGVjcnlwdC5jby8xMjMyOTUvYmluYW5jZS1zd2Fwcy1idXNkLXN0YWJsZWNvaW4tYml0Y29pbi1ldGhlcmV1bS1ibmLSAVJodHRwczovL2RlY3J5cHQuY28vMTIzMjk1L2JpbmFuY2Utc3dhcHMtYnVzZC1zdGFibGVjb2luLWJpdGNvaW4tZXRoZXJldW0tYm5iP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Binance Swaps BUSD Stablecoin From 'Recovery Fund' to Bitcoin, Ethereum, BNB - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBinance, the world’s largest crypto exchange by trading volume, responded to the latest drama around the USDC stablecoin by converting the remainder of its $1 billion Industry Recovery Initiative funds into Bitcoin (BTC), Ethereum (ETH), and other digital currencies.\n\n“Given the changes in stablecoins and banks, Binance will convert the remaining of the 1 billion Industry Recovery Initiative funds from BUSD to native crypto, including BTC, BNB, and ETH,” Binance CEO Chanpeng Zhao wrote in a tweet early Monday.\n\nBinance launched its crypto industry “Recovery Fund” in November 2022 following the collapse of the FTX exchange. The initiative was aimed “ to help projects who are otherwise strong but in a liquidity crisis.”\n\nAD\n\nAD\n\nGiven the changes in stable coins and banks, #Binance will convert the remaining of the $1 billion Industry Recovery Initiative funds from BUSD to native crypto, including #BTC, #BNB and ETH. Some fund movements will occur on-chain. Transparency. — CZ 🔶 Binance (@cz_binance) March 13, 2023\n\nThe move also comes in the wake of Paxos, BUSD's owner and issuer, being hit by a lawsuit from the United States Securities and Exchange Commission (SEC), with the agency claiming last month that the firm violated investor protection laws. Paxos announced it would halt BUSD minting and \"end its relationship with Binance,\" for the stablecoin.\n\nIt is not immediately clear how much money from Binance's fund has been converted or is earmarked to be converted into the mentioned coins.\n\nThe ETH address shared by CZ shows some substantial transfers over the past few hours, with the original wallet almost emptied at the time of this writing. Transactions are continuing to be executed at the time of writing.\n\nIt's worth noting that last September Binance began auto-converting USDC deposits into its native BUSD—effectively delisting the rival stablecoin.\n\nAD\n\nAD\n\nDecrypt reached out to Binance for additional comments but was yet to hear back by press time.\n\nUSDC regains USD peg\n\nFurthermore, Binance's decision comes hot on the heels of the USDC stablecoin depegging from its intended $1 price.\n\nThe depegging event was triggered by the ongoing crisis surrounding the collapse of the Silicon Valley Bank (SBV), where the firm holds about $3.3 billion.\n\nSilicon Valley Bank was among the 20 largest banks in the U.S. when it failed Friday after a bank run by customers. California state regulators placed the bank under the control of the FDIC, which in turn created a new entity—the Deposit Insurance National Bank of Santa Clara—through which the remaining assets will be managed.\n\nUSDC plummeted to an all-time low of $0.87 on Friday night.\n\nThe collapse of SBV, preceded by the meltdown of the Silvergate Bank, also sent shockwaves through the stock market, while the crypto industry saw a depressing drop as well, with Bitcoin crashing below $20,000 for the first time since mid-January.\n\nIn a separate move, the Federal Reserve moved to shut down the Signature Bank on Monday morning, another crypto-friendly bank with total assets of around $117 billion as of the end of last year.\n\nThe scare, at least for now, appears to be short-lived though: according to a joint statement from the Fed, U.S. Treasury, and FDIC on Sunday, all depositors of now-shuttered Silicon Valley Bank and Signature Bank will be able to get their funds out on Monday.\n\nAD\n\nAD\n\n\"Circle is now out of the woods, which is a huge positive for the crypto world,” Bradley Duke, co-CEO at ETC Group, said in a statement shared with Decrypt.\n\nCircle has meanwhile stated that it will “cover any shortfall” caused as a result of the $3.3 billion in its funds held by the collapsed SBV.\n\nThe Boston-based company also reiterated that USDC is 100% collateralized with cash and U.S. Treasuries.\n\nAccording to the firm, “USDC is currently collateralized 77% ($32.4B) with U.S. Treasury Bills (with a three month or less maturation period), and 23% ($9.7B) with cash held at a variety of institutions, of which SVB is only one.”\n\nThe latest news helped the broader crypto market flip green again, with Bitcoin trading around $22,280 by press time, up 9.1% over the day.\n\nUSDC is changing hands at $0.989, according to CoinGecko."
    }
]