[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9tYXJrZXRzLWJpdGNvaW4tZXRoZXJldW0tY2FyZGFuby1sZWFkcy0wMTQ2MjU0MTMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 01 Jan 2023 08:00:00 GMT",
        "title": "Markets: Bitcoin, Ethereum up, Cardano leads gains - Yahoo Finance",
        "content": "Bitcoin and Ethereum prices were little changed on Monday morning in Asia along with most non-stablecoin top 10 cryptocurrencies by market capitalization. Cardano led gains with 1.65% while BNB lost most with 0.96%.\n\nSee related article: A series of events: Crypto’s 2022 timeline\n\nFast facts\n\nBitcoin was up 0.4% to US$16,603 in the 24 hours to 9:00 a.m. in Hong Kong on Monday, after dropping 1.38% in the last seven days. Ethereum was up 0.26% to US$1,198 and has dropped 1.63% over the past week, according to CoinMarketCap.\n\nCardano gained the most at 1.65% to trade at US$0.2489.\n\nBNB, the native token of top cryptocurrency exchange Binance, led losses and was down 0.96% in the last 24 hours to trade at US$243. U.S. authorities are reportedly reviewing Binance.US’s attempt to acquire bankrupt digital assets brokerage Voyager Digital.\n\nU.S. equity markets closed lower on the final trading day of 2022 last Friday. Nasdaq Composite was down 0.11% while S&P 500 closed 0.25% lower on Friday.\n\nU.S. and Hong Kong markets are closed on Monday for New Year’s Day.\n\nOKB, the utility token of Seychelles-based cryptocurrency exchange OKX, gained close to 15% during Asia trading hours on Monday. OKT, the native token of the exchange’s blockchain OKX Chain, increased 13%.\n\nSee related article: Biggest blockchain trends for 2023 and beyond"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9tYXJrZXRzLWJpdGNvaW4tZXRoZXJldW0tY2FyZGFuby1sZWFkcy0wMTQ2MjU0MTMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 01 Jan 2023 08:00:00 GMT",
        "title": "Markets: Bitcoin, Ethereum up, Cardano leads gains - Yahoo Finance",
        "content": "Bitcoin and Ethereum prices were little changed on Monday morning in Asia along with most non-stablecoin top 10 cryptocurrencies by market capitalization. Cardano led gains with 1.65% while BNB lost most with 0.96%.\n\nSee related article: A series of events: Crypto’s 2022 timeline\n\nFast facts\n\nBitcoin was up 0.4% to US$16,603 in the 24 hours to 9:00 a.m. in Hong Kong on Monday, after dropping 1.38% in the last seven days. Ethereum was up 0.26% to US$1,198 and has dropped 1.63% over the past week, according to CoinMarketCap.\n\nCardano gained the most at 1.65% to trade at US$0.2489.\n\nBNB, the native token of top cryptocurrency exchange Binance, led losses and was down 0.96% in the last 24 hours to trade at US$243. U.S. authorities are reportedly reviewing Binance.US’s attempt to acquire bankrupt digital assets brokerage Voyager Digital.\n\nU.S. equity markets closed lower on the final trading day of 2022 last Friday. Nasdaq Composite was down 0.11% while S&P 500 closed 0.25% lower on Friday.\n\nU.S. and Hong Kong markets are closed on Monday for New Year’s Day.\n\nOKB, the utility token of Seychelles-based cryptocurrency exchange OKX, gained close to 15% during Asia trading hours on Monday. OKT, the native token of the exchange’s blockchain OKX Chain, increased 13%.\n\nSee related article: Biggest blockchain trends for 2023 and beyond"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMS8wMS9xdWFudC1xbnQtZGVjZW50cmFsYW5kLW1hbmEtYW5kLW9uZS1ldGhlcmV1bS1iYXNlZC1hbHRjb2luLXNob3dpbmctZ29vZC1zaWducy1mb3ItMjAyMy1zYW50aW1lbnQv0gGGAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzAxLzAxL3F1YW50LXFudC1kZWNlbnRyYWxhbmQtbWFuYS1hbmQtb25lLWV0aGVyZXVtLWJhc2VkLWFsdGNvaW4tc2hvd2luZy1nb29kLXNpZ25zLWZvci0yMDIzLXNhbnRpbWVudC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 01 Jan 2023 08:00:00 GMT",
        "title": "Quant (QNT), Decentraland (MANA) and One Ethereum-Based Altcoin Showing Good Signs for 2023: Santiment - The Daily Hodl",
        "content": "Prominent market analytics firm Santiment says that a trio of altcoins is showing healthy signs moving into 2023.\n\nAccording to the crypto intelligence firm, interoperability blockchain Quant (QNT), metaverse protocol Decentraland (MANA) and Ethereum-based (ETH) gaming blockchain Enjin Coin (ENJ) may have bright futures ahead of them.\n\nSantiment says there is a sharply diminishing supply of the three coins on crypto exchanges, which could bode well for price action this year.\n\n“Quant, Decentraland, and Enjin are among the largest market cap assets that saw significant amounts of coins leaving exchanges in 2022. Though their respective prices are down big, as is the rest of crypto, these are good signs for a better 2023.”\n\nQNT is trading for $105.46 at time of writing while MANA and ENJ are valued at $0.292 and $0.241, respectively.\n\nLooking at Bitcoin (BTC), Santiment says it suffered a “sputtering” end to the year as whales and sharks aggressively sold the king crypto asset throughout 2022. The data reveal deep-pocketed investors unloaded $10.75 billion worth of Bitcoin in over 12 months.\n\n“Since two weeks before the Nov. 2021 Bitcoin all-time high, shark and whale addresses holding 10 to 10,000 BTC have dumped a collective $10.75 billion. This drop, combined with circulation drying up, has led to a sputtering end to 2022.”\n\nBitcoin is changing hands for $16,518 at time of writing, a fractional dip during the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Sergey Nivens/Nikelser Kate"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vY2FuLXRoZS1zZWMtZGVjbGFyZS1iaXRjb2luLWEtc2VjdXJpdHktYW5kLWRlc3Ryb3ktdGhlLW1hcmtldC1sYXd5ZXItZGVhdG9uLXNheXMtc2VjLXRvby1wb3dlcmZ1bC_SAYoBaHR0cHM6Ly93d3cuY3J5cHRvLW5ld3MtZmxhc2guY29tL2Nhbi10aGUtc2VjLWRlY2xhcmUtYml0Y29pbi1hLXNlY3VyaXR5LWFuZC1kZXN0cm95LXRoZS1tYXJrZXQtbGF3eWVyLWRlYXRvbi1zYXlzLXNlYy10b28tcG93ZXJmdWwvP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 01 Jan 2023 08:00:00 GMT",
        "title": "Can the SEC declare Bitcoin a security and destroy the market? Lawyer Deaton says SEC too powerful - Crypto News Flash",
        "content": "Attorney John Deaton has also labeled Bitcoin as security and warned that SEC could soon turn on the digital asset.\n\nEvan Van Ness, an Ethereum maximalist, tweeted that the Bitcoin production block is controlled by two entities.\n\nThe US Securities and Exchange Commission (SEC) is currently in court with Ripple Labs over the security status of XRP. As the case is edging closer to its final ruling, Attorney John Deaton has labeled Bitcoin as security and warned that SEC could soon turn on the digital asset. Evan Van Ness, an Ethereum maximalist tweeted that the Bitcoin production block is controlled by two entities.\n\nMAJORITY OF #Bitcoin BLOCK PRODUCTION CURRENTLY CONTROLLED BY TWO ENTITIES Out of the last 1000 $BTC blocks, 501 have been built by Antpool and FoundryUSA Two pools control more than 50% of block production!\n\nIn response, former SEC enforcement attorney John Reed Stark questioned why the asset is then not regarded as security that requires SEC registration. Stark has suggested that Bitcoin is an unregistered security due to its mining centralization.\n\n\n\n\n\n\n\n\n\nDeaton also responded that the security status of Bitcoin has been a topic of discussion in the past with some SEC officials regarding it as an unregistered security.\n\nThere are others at the SEC who believe the same thing. In 2015, some at the SEC argued BTC was an unregistered security. This is why it’s absurd for Maxi’s like @saylor and @maxkeiser to encourage/celebrate the SEC’s actions 🆚 XRP and other tokens. SEC overreach is bad for the USA.\n\nBitcoin and Ethereum maximalists’ support for SEC could backfire\n\nDeaton has in the past warned that SEC could turn on Ethereum for switching to Proof of Stake. His mention of Bitcoin maximalists and Ethereum proponents comes as a result of their lack of support in the Ripple vs SEC lawsuit. Michael Saylor and Max Keiser have both shown support for SEC with Saylor claiming Ethereum and Ripple are committing security fraud.\n\nAccording to him, ETH and XRP are unregistered securities and should be shut down. In the past, Ethereum co-founder Vitalik Buterin also labeled XRP as centralized. Buterin’s position is due to Ripple’s comment in a court filing two years ago that Ethereum was China controlled. In August, Buterin said XRP has lost its protection from the Ethereum community.\n\n\n\n\n\n\n\n\n\nDeaton, however, believes that the support by the anti-Ripple community and the so-called Bitcoin maximalists could come back to bite them.\n\nPerfect picture summarizes the danger of supporting government overreach just because the current overreach doesn’t involve the asset of your choice.\n\nBrad Garlinghouse, Ripple Labs CEO, has called on the entire crypto community to support them, as a victory for the SEC could affect the rest of the digital assets.\n\nU.S. Congress candidate January Walker also made a similar claim.\n\nThe world follows the actions of the USA, and how the government handles one of us, sets precedence for how they handle all of us. Instead of battling against each other claiming one group is better than another we need to work together for the right legislation.\n\nPresident of the Texas Blockchain Council, Lee Bratcher, however, thinks otherwise. According to him, the XRP model fits the Howey test and should be categorized under security.\n\nThis article is provided for informational purposes only and is not intended as investment advice. The content does not constitute a recommendation to buy, sell, or hold any securities or financial instruments. Readers should conduct their own research and consult with financial advisors before making investment decisions. The information presented may not be current and could become outdated."
    }
]