[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZGVjcnlwdC5jby8xNDY2NjEvZm9yZ29uZS1jb25jbHVzaW9uLWV0aGVyZXJ1bS1pcy1hLWNvbW1vZGl0eS1qb2UtbHViaW7SAVVodHRwczovL2RlY3J5cHQuY28vMTQ2NjYxL2ZvcmdvbmUtY29uY2x1c2lvbi1ldGhlcmVydW0taXMtYS1jb21tb2RpdHktam9lLWx1YmluP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "It’s A 'Forgone Conclusion' That Ethereum Is A Commodity, Says Joe Lubin - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThough the U.S. Securities and Exchange Commission (SEC) is waging legal war across the crypto space, Ethereum co-founder Joseph Lubin isn’t breaking a sweat.\n\nWhen asked about regulators potentially treating Ether (ETH) like a security, the Consensys CEO explained during a Tuesday interview with CNBC that the regulatory verdict on Ethereum is already in.\n\n“The SEC has spoken,” he said, referring to former SEC commissioner Bill Hinman’s 2018 speech on crypto securities and Ethereum.\n\n\n\nAD\n\nAD\n\nNew documents have revealed that Hinman received multiple warnings from colleagues that the speech could confuse markets into thinking that the SEC had already deemed the asset a non-security.\n\n\n\nA security is a financial instrument often (but not always) associated with some kind of investment contract. A commodity, by contrast, is a basic or natural good, like gold, wheat, or cattle.\n\n“The CFTC has spoken very crisply a number of times that they consider Ether like a commodity,” added Lubin.\n\nWhile Commodities and Futures Trading Commission (CFTC) Chairman Rostin Benham agrees that many cryptocurrencies are securities, he also thinks the three top assets—including Bitcoin (BTC), Ethereum, and Tether (USDT)—belong under his agency’s jurisdiction as commodities.\n\nSEC Chairman Gary Gensler, by contrast, has only publicly deemed Bitcoin as such.\n\n\n\nOn the topic of Ether, Gensler has kept a tight lip. Some videos from his time as an MIT professor suggest he once thought it was a security, while others indicate he believed it had graduated from a security into a commodity by 2018.\n\nMembers of Congress are drafting legislation to clear up this issue, including Cynthia Lummis and Kirsten Gillibrand, and have voiced agreement with the CFTC that Ether is a commodity alongside Bitcoin.\n\n\n\n“It’s really a forgone conclusion at this point,” said Lubin. “There may be a regulator or two in the United States that can’t bring himself to utter the fact that Ether is not a security, but I don’t know why that’s the case.”\n\n\n\nThe SEC sued Binance and Coinbase earlier this month alleging that over a dozen assets listed on their platform were securities, including Paxos-issued stablecoin BUSD.\n\nAD\n\nAD"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1jb3JyZWN0aW9uLTE3OTAv0gFIaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vYW5hbHlzaXMvZXRoL2V0aGVyZXVtLXByaWNlLWNvcnJlY3Rpb24tMTc5MC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Price Indicators Signal Extended Correction To $1,790 - NewsBTC",
        "content": "Ethereum price is slowly moving lower from the $1,920 resistance against the US Dollar. ETH could extend its decline toward the $1,790 support.\n\nEthereum is still struggling to surpass the $1,920 resistance.\n\nThe price is trading below $1,900 and the 100-hourly Simple Moving Average.\n\nThere was a break below a key bullish trend line with support near $1,885 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could decline further toward the $1,790 support in the coming sessions.\n\nEthereum Price Stuck In A Range\n\nEthereum’s price attempted another upside break above the key $1,920 resistance zone. ETH failed to gain bullish momentum for a close above the $1,920 level, similar to Bitcoin.\n\nA high is formed near $1,912 and the price is now moving lower. There was a break below the $1,900 level. The price declined below the 50% Fib retracement level of the recent increase from the $1,838 low to the $1,912 high. Besides, there was a break below a key bullish trend line with support near $1,885 on the hourly chart of ETH/USD.\n\nEther is now trading below $1,900 and the 100-hourly Simple Moving Average. It is now testing the 76.4% Fib retracement level of the recent increase from the $1,838 low to the $1,912 high.\n\nIf Ethereum stays above $1,850, it could attempt another increase. Immediate resistance is near the $1,880 level or the 100-hourly Simple Moving Average. The next major resistance is near the $1,900 level.\n\nSource: ETHUSD on TradingView.com\n\nThe main barrier is still near the $1,920 and $1,930 levels. A close above the $1,930 zone could start a steady increase and send the price further higher. The next resistance sits near $2,000, above which the price could rise toward the $2,050 level. Any more gains could send Ether toward the $2,120 resistance.\n\nMore Losses in ETH?\n\nIf Ethereum fails to clear the $1,900 resistance, it could continue to move down. Initial support on the downside is near the $1,850 level.\n\nThe next major support is near the $1,840 level. If there is a move below $1,840, the price could accelerate lower toward $1,790. Any more losses may perhaps send the price toward the $1,750 support.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 level.\n\nMajor Support Level – $1,840\n\nMajor Resistance Level – $1,900\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy93aHktZGlkLWNpdGFkZWwtYmFja2VkLWVkeC0yMzE2NTIxMDMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "Why Did Citadel-Backed EDX List Bitcoin, Ethereum, Litecoin, and Bitcoin Cash? - Yahoo Finance",
        "content": "Bitcoin Cash, a spin-off from the oldest digital asset, has struggled to find a market since launching in 2017. But it’s been on a roll this month: since the start of June, Bitcoin Cash (BCH) is up 98%, jumping from $113 to $224.\n\nThe slightly obscure digital asset—one of many cryptocurrency “forks”—is following Bitcoin, like many other coins and tokens which have surged in price since the biggest digital asset experienced a run. But BCH is doing by far the best.\n\nWhy? The coin is one of the lucky four chosen for EDX Markets, a new crypto exchange backed by major Wall Street players Charles Schwab, Citadel Securities, and Fidelity Digital Assets.\n\nEDX, which launched last week, decided to let its traders—institutional investors only—start off with Bitcoin, Ethereum, Litecoin, and Bitcoin Cash.\n\nThe reason is simple: regulatory clarity.\n\n“These specific cryptocurrencies are generally perceived as commodities by regulatory bodies, which significantly mitigates potential legal challenges,” Sei Labs co-founder Jeff Feng told Decrypt.\n\nYouwei Yang, Chief Economist at BTCM, added that the four assets are “widely regarded as digital commodities, making them relatively safe” from the U.S. Securities and Exchange Commission because they are made with electricity—a commodity.\n\nIn perhaps its toughest regulatory crackdown yet, the SEC has gone after a number of major crypto brands for allegedly flogging unregistered securities. Earlier this month, it went after Coinbase for allegedly offering and selling unregistered securities via its staking service. It also targeted Binance, the world’s biggest exchange, with a massive lawsuit for allegedly “operating as a fking [sic] unlicensed securities exchange in the U.S.A. bro,” according to the SEC.\n\nIn February, it hit Kraken with a $30 million fine for allegedly failing to register the offer and sale of its crypto asset staking-as-a-service program.\n\nEvery Crypto Project Must Reckon With the SEC's Howey Test\n\nStory continues\n\nThese regulatory enforcements are all because SEC Chairman Gary Gensler thinks—and has said for years—that most cryptocurrencies are unregistered securities.\n\nBut he has made it clear that Bitcoin is a commodity. He has been less clear on Ethereum, but the Commodities and Futures Trading Commission (CTFC) has said the asset is a commodity.\n\nAnd Bitcoin Cash and Litecoin are both Bitcoin forks—new cryptocurrencies that emerged from the asset’s original code—meaning they are likely to have the same status in the eyes of regulators.\n\nGreg Moritz, Co-Founder at the crypto hedge fund AltTab Capital, said that “none have been listed by the SEC as unregistered securities,” adding that all four assets are established and have history, “key factors in the decision-making process of EDX’s backers.”\n\nEDX Markets CEO Jamil Nazarali also said that he felt “very comfortable” that the four assets weren’t securities.\n\nFor now, these four “old school” cryptocurrencies will give “old school” investors a taste of the crypto world. But things could change, Feng noted. “As regulations evolve and the understanding of different cryptocurrencies becomes more nuanced, we could anticipate exchanges like EDX broadening their offerings,” he added."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy93aHktZGlkLWNpdGFkZWwtYmFja2VkLWVkeC0yMzE2NTIxMDMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "Why Did Citadel-Backed EDX List Bitcoin, Ethereum, Litecoin, and Bitcoin Cash? - Yahoo Finance",
        "content": "Bitcoin Cash, a spin-off from the oldest digital asset, has struggled to find a market since launching in 2017. But it’s been on a roll this month: since the start of June, Bitcoin Cash (BCH) is up 98%, jumping from $113 to $224.\n\nThe slightly obscure digital asset—one of many cryptocurrency “forks”—is following Bitcoin, like many other coins and tokens which have surged in price since the biggest digital asset experienced a run. But BCH is doing by far the best.\n\nWhy? The coin is one of the lucky four chosen for EDX Markets, a new crypto exchange backed by major Wall Street players Charles Schwab, Citadel Securities, and Fidelity Digital Assets.\n\nEDX, which launched last week, decided to let its traders—institutional investors only—start off with Bitcoin, Ethereum, Litecoin, and Bitcoin Cash.\n\nThe reason is simple: regulatory clarity.\n\n“These specific cryptocurrencies are generally perceived as commodities by regulatory bodies, which significantly mitigates potential legal challenges,” Sei Labs co-founder Jeff Feng told Decrypt.\n\nYouwei Yang, Chief Economist at BTCM, added that the four assets are “widely regarded as digital commodities, making them relatively safe” from the U.S. Securities and Exchange Commission because they are made with electricity—a commodity.\n\nIn perhaps its toughest regulatory crackdown yet, the SEC has gone after a number of major crypto brands for allegedly flogging unregistered securities. Earlier this month, it went after Coinbase for allegedly offering and selling unregistered securities via its staking service. It also targeted Binance, the world’s biggest exchange, with a massive lawsuit for allegedly “operating as a fking [sic] unlicensed securities exchange in the U.S.A. bro,” according to the SEC.\n\nIn February, it hit Kraken with a $30 million fine for allegedly failing to register the offer and sale of its crypto asset staking-as-a-service program.\n\nEvery Crypto Project Must Reckon With the SEC's Howey Test\n\nStory continues\n\nThese regulatory enforcements are all because SEC Chairman Gary Gensler thinks—and has said for years—that most cryptocurrencies are unregistered securities.\n\nBut he has made it clear that Bitcoin is a commodity. He has been less clear on Ethereum, but the Commodities and Futures Trading Commission (CTFC) has said the asset is a commodity.\n\nAnd Bitcoin Cash and Litecoin are both Bitcoin forks—new cryptocurrencies that emerged from the asset’s original code—meaning they are likely to have the same status in the eyes of regulators.\n\nGreg Moritz, Co-Founder at the crypto hedge fund AltTab Capital, said that “none have been listed by the SEC as unregistered securities,” adding that all four assets are established and have history, “key factors in the decision-making process of EDX’s backers.”\n\nEDX Markets CEO Jamil Nazarali also said that he felt “very comfortable” that the four assets weren’t securities.\n\nFor now, these four “old school” cryptocurrencies will give “old school” investors a taste of the crypto world. But things could change, Feng noted. “As regulations evolve and the understanding of different cryptocurrencies becomes more nuanced, we could anticipate exchanges like EDX broadening their offerings,” he added."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1wcmljZS0yay1mdXR1cmVzLW1hcmtldC1kYXRhLW5vdC1zb29u0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "Ethereum price won't see $2K anytime soon, market data suggests - Cointelegraph",
        "content": "The price of Ether (ETH) faced strong resistance at $1,920 after a 17.5% rally between June 15 and June 22. Several factors contributed to the limited upside, including worsening macroeconomic conditions, the regulatory cryptocurrency environment and weaker demand for decentralized applications (DApps) on the Ethereum network.\n\nETH price faces macroeconomic headwinds\n\nOn June 26, a federal judge denied a motion from Binance that could have stopped the United States Securities and Exchange Commission (SEC) from issuing public statements related to the case.\n\nIn addition, in its mid-year outlook, HSBC Asset Management’s report warned of an economic downturn in the U.S. in the fourth quarter, followed by a “year of contraction and a European recession in 2024”. The report also noted that “corporate defaults have started to creep up.”\n\nFinally, International Monetary Fund chief economist Gita Gopinath told CNBC on June 27 that central bankers should “continue tightening” by keeping interest rates high for longer than expected.\n\nEthereum network demand, gas fees drop\n\nUsage of DApps on the Ethereum network failed to gain momentum as gas fees dropped 60%. Notably, the seven-day average transaction cost dropped to $3.7 on June 26, down from $9 four weeks prior.\n\nDApp active addresses also declined by 27% in the same period.\n\n30-day Ethereum DApp activity. Source: DappRadar\n\nA large chunk of the decline was concentrated on Uniswap and MetaMask Swap, while most nonfungible token (NFT) marketplaces saw a surge in their unique active wallets (UAW).\n\nDespite Uniswap NFT Aggregator’s lackluster performance, the sector faced a decent influx of users on OpenSea, Blur, Manifold, LooksRare and Unick.\n\nMore concerningly, however, is that the total value locked (TVL) — measuring the deposits locked in Ethereum smart contracts — reached its lowest level since August 2020. The indicator declined by 6.9% between April 28 and June 28 to 13.9 million ETH, according to DefiLlama.\n\nETH price rally not supported by derivatives markets\n\nSo how are professional traders positioned for the next ETH price move? Let’s look at Ether futures to gauge the odds of ETH/USD breaking above the $1,920 resistance.\n\nETH quarterly futures are the preferred instruments of whales and arbitrage desks. However, these fixed-month contracts usually trade at a slight premium to spot markets, as they demand an additional fee to postpone settlement.\n\nAs a result, in healthy markets, ETH futures contracts should trade at a 5–10% annualized premium, a situation known as contango.\n\nEther two-month futures annualized premium. Source: Laevitas\n\nAccording to the futures premium — known as the basis indicator — professional traders have been avoiding leveraged longs (bullish bets). Despite the modest improvement to 3%, the metric remains far from the neutral 5% threshold.\n\nTo exclude externalities that might have solely impacted the Ether futures, one should analyze the ETH options markets. The 25% delta skew indicator compares similar call (buy) and put (sell) options, and will turn positive when fear is prevalent because the protective put option premium is higher than the call options.\n\nEther 30-day 25% skew. Source: Laevitas\n\nThe skew indicator will move above 8% if traders fear an Ether price crash. On the other hand, generalized excitement reflects a negative 8% skew.\n\nAs displayed above, the delta skew has been flirting with moderate optimism since June 22 but has been unable to sustain it for long. Presently, the negative 2% metric displays a balanced demand for options.\n\nResistance below $2,000 remains formidable\n\nJudging by the ETH derivatives metrics, and declining TVL and DApps use, bears are better positioned to defend the $1,920 resistance. Moreover, the worsening macroeconomic conditions and cryptocurrency regulatory news confirm the moderate pessimism for risk-on assets, including Ether.\n\nRelated: 3 reasons why Ethereum’s market cap dominance is on the rise\n\nThat does not necessarily mean that Ether is bound to retest $1,750, but it certainly presents an enormous hurdle for ETH bulls after failing to break the $1,920 level on three occasions between June 21 and June 25.\n\nConsequently, at least for the short term, bears have better odds of successfully defending this important price level.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    }
]