[
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtdXAtNS10aHJlZS1rZXktZmFjdG9ycy1kcml2aW5nLWdyb3d0aNIBRmh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtdXAtNS10aHJlZS1rZXktZmFjdG9ycy1kcml2aW5nLWdyb3d0aD9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) up 5%, Three Key Factors Driving Growth - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nWith the broader jump in the performance of most crypto assets today, Ethereum (ETH) is notably riding the train. The price of the digital currency is pegged at $1,671.53, up by 5.69% over the past 24 hours at the time of writing. With the growth, Ethereum is now rebuilding its week-to-date (WTD) metrics, having accrued just about 4.13% within that time frame.\n\nAdvertisement\n\nWhile the most important factor fueling the growth in the price of Ethereum remains broader crypto market sentiment, two other distinct factors can be pointed out.\n\nFirst is the intense activities of both retail and whale buyers, according to popular crypto market analytics platforms. While Glassnode showed that the total number of nonzero addresses topped 93,275,549, an indication of intense buying, WhaleStats confirmed the use of the Ethereum protocol by whales, as measured through the accumulation of altcoins like Gala (GALA) and Chainlink (LINK).\n\n\n\n\n\nBesides this, the network activities have lent positivity among all Ethereum investors. Besides the circulating supply of the digital currency dropping to its lowest point, the public testnet that will help simulate the staking Ether withdrawal process has also been launched, per an earlier U.Today report.\n\nEthereum's journey to $2,000\n\nFollowing the completion of the transition of Ethereum from the proof-of-work (PoW) model to the proof of stake (PoS) through The Merge, many expected a corresponding upshoot in the coin's price.\n\nWith the positive rally Ethereum has gained thus far this year, the projection that it will retest a new high of $2,000 has resurfaced. While this price growth, if it happens, will not come as a surprise seeing as Ethereum's all-time high (ATH) remains pegged at $4,891.70, the projected short-term $2,000 growth might be unrealistic.\n\nThis is because, with the advent of the Shanghai upgrade, a number of staked Ethereum may be withdrawn and liquidated, a trend that may tank the price of the coin."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V1cm9wZWFuLXVuaW9uLWludmVzdG1lbnQtYmFuay1ldGhlcmV1bS1ibG9ja2NoYWluLWJvbmRz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "European Union Again Uses Ethereum to Explore Tokenized Bonds - Blockworks",
        "content": "The European Investment Bank (EIB) is once again leveraging Ethereum in its quest to tokenize capital markets, this time while issuing the first-ever digital pound sterling (GBP) bond on a seperate private blockchain.\n\nEIB, the primary lender of the European Union, deployed the £50 million ($86.6 million) bond to a permissioned network underpinned by HSBC’s tokenization platform, Orion. The EIB is a public institution owned by the EU’s 27 member states.\n\nThe bank opted for a private network for privacy and efficiency, according to a statement. In an effort to increase transparency, the bond was also recorded on Ethereum, a spokesperson told Blockworks.\n\nThis was done to provide evidence the issuance took place while still maintaining the anonymity of bondholders (Blockworks reached out for some transaction IDs but they weren’t readily available. We’ll update this piece should EIB provide them).\n\nHSBC debuted Orion last November, when it first flagged intent to launch the tokenized GBP bond. BNP Paribas, HSBC, and RBC Capital Markets were named as joint lead managers of the bond, with those firms serving as custodians. Client assets will be stored in digital securities accounts kept on Orion, the bank said.\n\nThe EIB’s new vehicle is expected to bring a range of benefits to market participants, including reduced costs, improved efficiency and real-time data synchronization in an otherwise cumbersome process.\n\nDigital bonds have garnered interest from financial institutions in various countries, including Australia, Germany, France and Sweden since at least 2017.\n\nA Luxembourg legal framework that enables firms to issue dematerialized securities using distributed ledger technology was enacted into law in January 2021, paving the way for further exploration.\n\nDematerialized securities refer to digital representations of financial assets that exist only in electronic form, rather than as physical certificates or paper documents.\n\n“The time has come for further innovation in the financial sector,” said EIB Vice-President Ricardo Mourinho Felix. “This new financial tool will provide additional capital flow that the EIB will invest in projects with global impact.”\n\nThis isn’t the first digital bond issued by the EIB. That happened back in Apr. 2021, when the European Union’s investment bank deployed a two-year, 100 million euro ($110 million) bond entirely on Ethereum.\n\nDavid Canellis contributed reporting.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3Jlc2VhcmNoLWFzaWEtZXUtdXMtYXJlLWJ1bGxpc2gtb24tYml0Y29pbi1ldGhlcmV1bS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "Research: Asia, EU, US are bullish on Bitcoin, Ethereum - CryptoSlate",
        "content": "Glassnode data analyzed by CryptoSlate analysts shows that Asia, the U.S., and the EU have been bullish on Bitcoin (BTC) and Ethereum (ETH) since late January.\n\nAs the regional price metrics indicate, investors from all three regions feel more bullish on BTC than they do on ETH. In the meantime, year-over-year BTC supply for Asia means BTC will continue to increase in the short term.\n\nRegional prices\n\nThe regional price metric used in this research shows the 30-day change in the regional prices of Asia, the EU, and the U.S. The price movements during the working hours of a region must be recorded before calculating the regional price metric. Then, the price for a region can be determined by calculating the cumulative sum of the price changes recorded within the working hours of that region.\n\nThe chart below reflects the regional BTC prices for all three regions since the beginning of 2022. The red bars represent the regional price for the U.S., while the blue and green ones represent the EU and Asia, respectively.\n\nIf the metric falls below the zero line, this indicates that the region is bearish on BTC. If it places above the line, it represents the region’s bullish sentiment.\n\nAccording to the chart, that all three regions turned on the bullish side in late January 2023 and have been bullish since then, with the U.S. being the most bullish. The last time all three regions were bullish was during a short time in August 2022, right after the Luna collapse.\n\nEthereum\n\nThe regional ETH prices for Asia, the U.S., and the EU also represent a similar bullish sentiment. The chart below illustrates the regional ETH prices for each region since the beginning of the year 2022. The U.S., the EU, and Asia are represented with red, blue, and green, respectively.\n\nSimilar to the regional BTC prices, all three regions currently appear bullish on ETH, with the U.S. being the most bullish one. However, none of the regions show the same level of enthusiasm as they do with BTC.\n\nYear-over-Year supply of Asia\n\nThis metric provides an estimate for the year-over-year (YoY) change in the market share between the BTC supply held and being traded. The chart below shows the YoY supply for the Asia region since the beginning of 2010.\n\nThe data shows that the region’s YoY supply is currently over 8.5%. This percentage indicates that Asia is at the highest bullish point it has ever been.\n\nPrevious CryptoSlate research revealed that Asian investors built and maintained a smart money reputation by consistently buying at the bottom and selling at the top. Assuming Asiacontinuesg to act “smart,” their bullish sentiment indicates that BTC will continue to increase, at least in the short term.\n\nMentioned in this article"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1kZWZsYXRpb25hcnkteWVzLWJ1dC10aGVyZS1pcy1tb3JlLXRoYW4tbWVldHMtdGhlLWV5ZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "Ethereum: Deflationary? Yes, but there is more that meets the eye - AMBCrypto News",
        "content": "In January, ETH’s supply decreased by 10,145.72 units.\n\nFebruary might be marked by a price decline.\n\nAccording to data from Ultrasound Money, in January, Ethereum’s [ETH] supply decreased by 10,145.72 units, resulting in a net deflationary value of approximately $16 million. As of this writing, the current total supply of ETH stood at 120,515,752, with an annual growth rate of -0.012%.\n\nRead Ethereum’s [ETH] Price Prediction 2023-24\n\nEthereum: Deflation is the preferred option\n\nThe decrease in the supply of ETH has several implications for the cryptocurrency market. A decrease in supply leads to an increase in demand, as less of the asset is available for purchase. This can drive up the price of ETH, making it more valuable. Thus, the increase in demand could also attract more investors to the market, which could further boost the price of ETH.\n\nAlso, the net deflationary value of ETH could positively impact the currency’s stability. Notably, deflationary currencies maintain their value over time, as the decrease in supply creates a scarcity of the asset. This reduces the risk of inflation and can make the currency more attractive to investors, as it is less likely to depreciate.\n\nOutlook is gloomy in the interim\n\nWhile ETH’s net deflationary value might ensure price stability in the long term, an assessment of price movements on a daily chart revealed that an imminent price reversal was on the horizon.\n\nAt press time, ETH traded at $1,569.93. In January, the altcoin’s value rose by 32%. However, as many investors rallied to take profits, buying pressure appears to have declined significantly.\n\nA look at ETH’s moving average convergence/divergence (MACD) confirmed the commencement of a new bear cycle on 27 January. Since then, the indicator has returned only red histogram bars, and ETH’s price has fallen by 2%.\n\nAt press time, key momentum indicators aimed for their respective neutral zones. ETH’s Relative Strength Index (RSI) and Money Flow Index (MFI) have declined persistently in the last week and remained in downtrends at 56.33 and 59.40, respectively, at the time of writing. A drop in ETH accumulation marked the past week, and many took to selling their holdings.\n\nLikewise, the dynamic line (green) of the coin’s Chaikin Money Flow (CMF) aimed to cross into the negative zone. Many investors shied away from buying more ETH.\n\nHow many ETHs can you buy for $1?\n\nThe lack of new demand for ETH was depicted by a consistent decline in its Open Interest in the past ten days, data from Coinglass revealed. Within that period, ETH’s Open Interest fell by 16%.\n\nTypically, a decline in an asset’s Open Interest means that traders are closing out their positions and there is a decline in new contracts being created. This suggests that they are becoming less confident in the future price movements of the asset and are reducing their exposure."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMi8wMi9iaXRjb2luLXNvbGFuYS1hbmQtYWRkaXRpb25hbC1ldGhlcmV1bS1yaXZhbC1oYXZlLWhpZ2hlci10by1nby1zYXlzLXRvcC1jcnlwdG8tYW5hbHlzdC1oZXJlLWFyZS1oaXMtdGFyZ2V0cy_SAZEBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDIvMDIvYml0Y29pbi1zb2xhbmEtYW5kLWFkZGl0aW9uYWwtZXRoZXJldW0tcml2YWwtaGF2ZS1oaWdoZXItdG8tZ28tc2F5cy10b3AtY3J5cHRvLWFuYWx5c3QtaGVyZS1hcmUtaGlzLXRhcmdldHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin, Solana and Additional Ethereum Rival Have Higher To Go, Says Top Crypto Analyst – Here Are His Targets - The Daily Hodl",
        "content": "A popular crypto strategist says Bitcoin (BTC) and two Ethereum (ETH) rivals, Solana (SOL) and Fantom (FTM), have more room to run.\n\nPseudonymous analyst Altcoin Sherpa tells his 190,500 Twitter followers that Bitcoin is likely to surge at least 25% from its $24,007 value at time of writing.\n\n“BTC: The longer that this hangs around this area, the more bullish I am. I think that it’s quite likely that we see a gap fill up to $30,000 eventually.”\n\nNext, Sherpa says Solana appears headed to the $30 range.\n\n“Solana has done well and it should go to the mid-$30s if BTC holds up. I’m not sure what the long-term future for this coin is, FTX/Alameda had a big bag of it iirc (if I recall correctly) and who knows how that’ll get liquidated. The culture of this chain is still good though.”\n\nSolana is trading for $24.89 at time of writing.\n\nTurning to Fantom, he sets a price target of more than $0.60. Fantom is worth $0.58 at time of writing.\n\n“FTM: Looks extremely… strong, I like this one. It will eventually hit $0.60ish IMO [in my opinion].”\n\nSherpa also looks at four other altcoins.\n\nHe says Avalanche (AVAX) is likely going to retrace to $17, a more than 20% decline from its $21.48 value at time of writing.\n\n“AVAX: Strong move but you probably still get some bids lower at like $17. High volume node around there and some S/R levels. Price currently pulling back due to S/R + 200-day EMA, which acts as resistance in these situations.”\n\nNext, he says Cardano (ADA) is holding up against Bitcoin but he doesn’t expect a strong rally in price, especially when compared to the upside potential of other altcoins. Cardano is trading at $0.40 at time of writing.\n\n“ADA: I don’t really see any reason to buy this coin. The ADA/BTC pair looks pretty good to be honest and at support but I don’t think this outperforms other altcoins relatively. Still, it has an insane community.”\n\nHe says Polkadot (DOT) is underperforming relative to other altcoins and does not see a strong case for the token to move to the upside.\n\n“DOT: I don’t see any reason to buy this coin. It’s unpumped relative to the rest of the market but it has performed horribly overall. Not a fan of the chart.”\n\nLastly, he says STEPN (GMT) is likely forming a bottom and will rally to $0.79, a more than 38% increase from its $0.57 value at time of writing.\n\n“GMT: Wouldn’t be surprised if this forms a low around here and continues higher to the $.79 area if BTC is stable. 200-d EMA acted as resistance but it’s still ok for now IMO. I still use this app every week and invested in this one.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    }
]