[
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDUvMDkvZXRoZXItc3Rha2luZy1kZXBvc2l0cy10b3Atd2l0aGRyYXdhbHMtZm9yLWZpcnN0LXRpbWUtc2luY2Utc2hhcGVsbGEtdXBncmFkZS_SAXpodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA1LzA5L2V0aGVyLXN0YWtpbmctZGVwb3NpdHMtdG9wLXdpdGhkcmF3YWxzLWZvci1maXJzdC10aW1lLXNpbmNlLXNoYXBlbGxhLXVwZ3JhZGUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 May 2023 07:00:00 GMT",
        "title": "Ether Staking Deposits Top Withdrawals for First Time Since Shapella Upgrade - CoinDesk",
        "content": "In a proof-of-stake blockchain such as Ethereum, users stake, or lock, cryptocurrency – ether in this case – to help secure and confirm new data blocks. These stakers receive network rewards in the form of tokens, creating a form of passive investing strategy."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wNS8wOS9jb2luZGVzay10dXJucy0xMC1ob3ctdGhlLWRhby1oYWNrLWNoYW5nZWQtZXRoZXJldW0tYW5kLWNyeXB0by_SAXpodHRwczovL3d3dy5jb2luZGVzay5jb20vY29uc2Vuc3VzLW1hZ2F6aW5lLzIwMjMvMDUvMDkvY29pbmRlc2stdHVybnMtMTAtaG93LXRoZS1kYW8taGFjay1jaGFuZ2VkLWV0aGVyZXVtLWFuZC1jcnlwdG8vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 May 2023 07:00:00 GMT",
        "title": "CoinDesk Turns 10: 2016 - How The DAO Hack Changed Ethereum and Crypto - CoinDesk",
        "content": "What was lost in the shift from DAO to ICOs was any sort of expert oversight or vetting, Jentzch argues. “The DAO was kind of a mix of the wisdom of the crowd and these mature investors who were doing due diligence, and know what they’re doing. Something like 50% [of investors] were retail and small holders, and roughly 50% was owned by 51 people. The idea was projects will go to the DAO, and they won’t just get a check, they’ll get a smart contract that sends money over time.”"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtaGl0cy1uZXctYWxsLXRpbWUtcmVjb3JkLWFmdGVyLWRpcC1mb3ItYW50c9IBTGh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtaGl0cy1uZXctYWxsLXRpbWUtcmVjb3JkLWFmdGVyLWRpcC1mb3ItYW50cz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 May 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Hits New All-Time Record After 'Dip for Ants' - U.Today",
        "content": "Ethereum (ETH) recently achieved a new all-time record, as the amount of ETH locked reached a staggering 19,375,242 ETH. This milestone comes after what can be described as a \"dip for ants,\" as the recent withdrawals appear minuscule when viewed from a broader perspective. This achievement has significant implications for Ethereum and its investors, particularly in terms of the cryptocurrency's future growth potential.\n\nAdvertisement\n\nThe locked ETH includes several categories, such as ETH staked on the Beacon chain, ETH deposited to the Beacon contract but not yet validating and rewards on the Beacon chain. Collectively, these categories represent the ETH that is \"out of circulation,\" thereby reducing the available supply and potentially driving up demand and price.\n\nETH locked* hit an all-time recently at 19,375,242 ETH\n\n\n\nWhen you zoom out, the withdrawals seem like a dip for ants\n\n\n\n*All ETH that is \"out of circulation\":\n\n• ETH staked on Beacon chain\n\n• ETH deposited to the beacon contract but not validating yet\n\n• Rewards on the Beacon chain pic.twitter.com/N1jyR7hcBO — Nansen 🧭 (@nansen_ai) May 9, 2023\n\nThe fact that such a substantial amount of ETH is locked away demonstrates increasing interest in and adoption of Ethereum's proof-of-stake (PoS) system. As more investors stake their ETH on the Beacon chain, it showcases confidence in Ethereum's long-term viability and growth prospects. This trend could further solidify Ethereum's position as a leading cryptocurrency and smart contract platform.\n\nWhen analyzing recent withdrawals in the context of the broader Ethereum ecosystem, it becomes clear that these movements are relatively insignificant. The locked ETH has continued to grow despite minor fluctuations, suggesting that the cryptocurrency's overall health remains robust. For investors, this serves as a reminder of the importance of maintaining a long-term perspective when evaluating market movements.\n\nThe new all-time record for locked ETH underscores the strength of the Ethereum network and its potential for continued growth. As Ethereum 2.0 progresses and the transition to a PoS model becomes more firmly established, it is likely that the amount of locked ETH will continue to rise."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZGFpbHljb2luLmNvbS9ldGhlcmV1bS1oaXRzLXJlY29yZC1nYXMtZmVlcy1hcy1wZXBlLW1hbmlhLXN3ZWVwcy1jb21tdW5pdHktcmVhY3RzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 May 2023 07:00:00 GMT",
        "title": "Ethereum Hits Record Gas Fees as PEPE Mania Sweeps: Community Reacts - DailyCoin",
        "content": "Ethereum gas fees have hit record highs in the past few weeks.\n\nMeme coin mania, led by PEPE, has been the main culprit for high gas fees.\n\nThe community joked about being priced out of Ethereum.\n\nJust a few weeks ago the crypto industry seemed to be dead with little on-chain activity compared to the bull market of 2020/2021.\n\nHowever, the recent meme coin mania that seemingly came out of nowhere changed the status quo: Crypto activity picked up, especially on Ethereum, where gas fees increased to record levels.\n\nEthereum Hits Record Gas Fees Amid PEPE Mania\n\nThe Ethereum blockchain has become unusable, at least to most people trying to use it. The gas fees have gotten so high during the ongoing meme coin PEPE mania that some users have become priced out.\n\nOver the past few weeks, amid the PEPE hysteria, the average Ethereum gas price went to levels not seen since May 2022. Since PEPE launched on April 18, the average gas price has been 74 gwei. On May 5, the average gas price hit 155 gwei, according to data from Etherscan.\n\nEthereum average gas price chart. Source: Etherscan.\n\nSome users paid hundreds of dollars for a single transaction. One user even paid 64 ETH in gas fees for a single transaction, equivalent to $120,000.\n\nPEPE has since gone down 60% in the past few days. However, gas is still high and fluctuating between 145-190 gwei while PEPE has dumped 60% in the past few days.\n\nCommunity Reacts to High Ethereum Gas Fees\n\nThe crypto community on Twitter reacted to the astronomical gas fees on Ethereum. One user cried for help about paying $100 in gas fees for a $10 purchase.\n\n$10 purchase, gas fees $101+\n\n\n\nETH miners or devs, pls make it make sense to me. 😤😤 pic.twitter.com/4JBYxp4dbm — Officialjioke 📉📊📈💰 (@official_jioke) May 5, 2023\n\nAnother one joked that selling their left kidney is the only way to pay the high Ethereum gas fees.\n\nA new option to pay eth gas fees pic.twitter.com/R2M9QA3x4I — Sadie (@SadieCalls) May 5, 2023\n\nA Cardano community member mocked the high Ethereum fees and sarcastically asked whether Ethereum users have heard of Cardano, a blockchain with lower fees.\n\nEstimated gas fees for a tx on Eth right now: $187.71\n\n\n\nHey guys, ever heard of Cardano? pic.twitter.com/mTZ2KW9xOe — Rami (@CardanoRami) May 8, 2023\n\nOn the Flipside\n\nThere lies a paradox in the saying that “no one is using Ethereum because the gas fees are so high.” Gas fees are high precisely because there’s an increased demand for Ethereum block space.\n\nWhy You Should Care\n\nHigh gas fees on Ethereum indicate higher activity on the network. However, many users get priced out of using Ethereum when gas prices are high. At the same time, there are multiple Ethereum Layer-2 solutions that are working towards scaling Ethereum and eliminating high gas fees.\n\nRead more about PEPE dumping in the past few days:\n\nMeme Coin PEPE Dumps 42% as Whales Continue to Exit\n\nRead more about Lido setting a date for st ETH withdrawals:\n\nLido Finally Sets Date for stETH Withdrawals"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9pbnNpZGUtZXRoZXJldW1zLWV0aC1zdGFraW5nLWNoYW1iZXItc3RhcnZlZC1vZi1iYWxhbmNlLXRhbGwtb24tZXhpdHMv0gFgaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2luc2lkZS1ldGhlcmV1bXMtZXRoLXN0YWtpbmctY2hhbWJlci1zdGFydmVkLW9mLWJhbGFuY2UtdGFsbC1vbi1leGl0cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 May 2023 07:00:00 GMT",
        "title": "Inside Ethereum’s [ETH] staking chamber: Starved of balance, tall on exits - AMBCrypto News",
        "content": "Centralized staking pools experienced an array of farewells.\n\nValidators have opted not to cross the minimum balance required to stake.\n\nWithin Ethereum’s [ETH] ecosystem, staking activity has become a topic of increasing interest and scrutiny since the Shapella upgrade’s success. But contrary to projection, ETH did not witness a high level of sell pressure after staking withdrawals resumed. Instead, it was around that time that the altcoin surged to $2,000.\n\nHow much are 1,10,100 ETHs worth today?\n\nHowever, post Shapella and ETH’s loss of its hold on the price, there have been some notable changes in the Ethereum staking world.\n\nChange of plans for ETH?\n\nGlassnode, in its 8 May report, revealed that full withdrawals had now outpaced partial withdrawals, which were initially rampant. Unstaking all initially staked Ether means that validators, who deposited a minimum of 32 ETH, have decided to grab their rewards and take out their capital.\n\nFurthermore, the number of complete validator exits in the ecosystem determines the full withdrawals. And, as of 4 May, the complete exit from the system was as much as 1.23 million in ETH.\n\nBesides the departure, the has been a change in the validators’ contrition to equilibrium. According to the on-chain analytic platform, the validators’ balance, which was pegged at 32 ETH, enjoyed an average of 2 ETH addition before the upgrade.\n\nBut since Shanghai took center stage, the balance has reduced to 32.35 ETH. This inferred that those who had not deployed their assets had exchanged their rewards.\n\nDespite the withdrawals, which were as much as 48.341 validators, there were also instances of those waiting to enter the staking pool.\n\nIn fact, Glassnode showed that the number of waiting depositors was over 23,000, at the time of the report. This confirmed investors’ interest in staking, and a bid to balance the growth in the number of exits. Based on Glassnode’s data, exits from the staking pool had already been minimized.\n\nIndividual retirements, but Lido remains king\n\nAlthough the net validator count was near zero, Glassnode noted that it expected a positive return in the future. The report noted that:\n\n“Given the tapering off of exits and persistently high inflow of new staking entrants, we expect a net increase to validator counts in the near future.”\n\nHowever, it was noteworthy to mention that most of the exits came from exchange activity. Exchanges including Binance, Kraken, Coinbase, and Gate.io topped the list.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nLido Finance [LDO], which is the most effective liquid staking platform out of the lot, had not yet enabled withdrawals. Moreover, only 6.6% of the overall withdrawals were linked to the decentralized staking providers.\n\nIn addition, Lido remained the largest pool with the highest share of stakers. While a large number of exits were from individual stakers on centralized exchanges, Coinbase and Kraken could still rank second and third, respectively, in market share."
    }
]