[
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNS8yNy90b3AtY3J5cHRvLWFuYWx5c3Qtc2F5cy1vbmUtY2F0YWx5c3Qtd2lsbC1rZWVwLWxpdGVjb2luLXByb3BwZWQtdXAtdXBkYXRlcy1vdXRsb29rLW9uLWJpdGNvaW4tYW5kLWV0aGVyZXVtL9IBkAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNS8yNy90b3AtY3J5cHRvLWFuYWx5c3Qtc2F5cy1vbmUtY2F0YWx5c3Qtd2lsbC1rZWVwLWxpdGVjb2luLXByb3BwZWQtdXAtdXBkYXRlcy1vdXRsb29rLW9uLWJpdGNvaW4tYW5kLWV0aGVyZXVtL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 May 2023 07:00:00 GMT",
        "title": "Top Crypto Analyst Says One Catalyst Will Keep Litecoin ‘Propped Up’, Updates Outlook on Bitcoin and Ethereum - The Daily Hodl",
        "content": "A popular crypto trader is weighing in on the prospects of Litecoin (LTC), Bitcoin (BTC) and Ethereum (ETH) moving forward.\n\nStarting with Litecoin, the pseudonymous analyst Bluntz tells his 223,000 Twitter followers that the 14th-largest crypto asset by market cap is consolidating in readiness for what could be a breakout.\n\nAccording to Bluntz, the upcoming halving of Litecoin is likely to keep the altcoin bullish. Litecoin’s third halving is expected to occur in about two months.\n\n“Solid high timeframe contraction happening on LTC. I think the halving narrative keeps this one propped up.”\n\nLooking at the chart, it appears that the analyst is predicting a symmetrical triangle breakout for Litecoin en route toward his target above $110.\n\nLitecoin is trading at $86.96 at time of writing.\n\nTurning to Bitcoin and Ethereum, the pseudonymous analyst says that the two leading crypto assets could trade in a range for a while before breaking down. However, Bluntz says that the plunge could take some time.\n\n“So far, lows holding on both BTC and ETH.\n\nWouldn’t be surprised to see a more longer drawn-out channel/bear flag play out here, doesn’t quite look like a breakdown is imminent just yet.”\n\nBitcoin and Ethereum are trading at $26,471 and $1,814, respectively, at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS13aWxsLWxpcXVpZGF0aW9ucy1tYWtlLTIwMDAtYS1waXBlLWRyZWFtL9IBTGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS13aWxsLWxpcXVpZGF0aW9ucy1tYWtlLTIwMDAtYS1waXBlLWRyZWFtL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 May 2023 07:00:00 GMT",
        "title": "Ethereum: Will liquidations make $2000 a pipe dream - AMBCrypto News",
        "content": "Ethereum’s long positions face record-high liquidations, surpassing $58 million in May.\n\nDespite a slight price increase, Ethereum remains in a bearish trend around the $1,830 price range.\n\nEthereum’s [ETH] price has been trapped within the $1,800 price range for quite some time, but lately, we’ve witnessed a glimmer of hope with a modest surge. Unfortunately, even this slight upward movement hasn’t proven sufficient to safeguard certain traders’ positions from being forcefully liquidated.\n\nRead Ethereum’s [ETH] Price Prediction 2023-24\n\nEthereum long liquidations hit monthly high\n\nGlassnode Alerts reported that the Mean Liquidated Volume in Ethereum Futures Contracts’ Long Positions peaked on 27 May. According to the observed chart, the average amount of Ethereum Futures Long Liquidations exceeded 32,000 ETH, equivalent to over $58 million at the press time valuation. This made it one of the highest ETH Futures Liquidations in May.\n\nIn futures contracts, the mean liquidated volume signifies the average number of contracts forcefully closed or liquidated due to traders’ inability to fulfill margin requirements. When engaging in long positions for Ethereum futures contracts, traders are speculating on the price of ETH increasing.\n\nHowever, if ETH falls below a specific threshold, traders’ accounts may lack sufficient funds to cover the losses, resulting in the unfortunate event of liquidation.\n\nEthereum’s 24-hour liquidation map\n\nExamining the Ethereum liquidation within a 24-hour timeframe revealed a notable amount of liquidation activity. According to CoinGlass, ETH experienced liquidations totaling $8.42 million in the past 24 hours.\n\nFurther analysis indicated that long positions witnessed liquidations amounting to $2.48 million, whereas short positions faced liquidations totaling $5.94 million.\n\nAs of this writing, long positions accounted for over $600,000 in liquidations, while short positions stood at over $500,000. Taking a broader perspective by examining the ETH liquidation chart, it becomes evident that long positions experienced more liquidations in May when compared to short positions.\n\nHow much are 1,10,100 ETHs worth today?\n\nObserving price swings in a daily timeframe\n\nAnalyzing Ethereum’s daily timeframe chart revealed a 1.26% increase in value at the close of trade on May 26. As of this writing, Ethereum was trading around $1,830, exhibiting a minor upward trend of less than 1%. Although ETH remained within a bearish trend, it was showing signs of weakening due to the recent modest growth it has experienced.\n\nNotably, the Relative Strength Index (RSI) line indicated that ETH was approaching the threshold of transitioning to a bullish trend."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vZGVjcnlwdC5jby8xNDI2MjcvdGhpcy13ZWVrLWluLWNvaW5zLWJpdGNvaW4tZXRoZXJldW0tZm91cnRoLWZsYXQtd2Vlay10cm9uLXRldGhlci1zdXJnZdIBZmh0dHBzOi8vZGVjcnlwdC5jby8xNDI2MjcvdGhpcy13ZWVrLWluLWNvaW5zLWJpdGNvaW4tZXRoZXJldW0tZm91cnRoLWZsYXQtd2Vlay10cm9uLXRldGhlci1zdXJnZT9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 May 2023 07:00:00 GMT",
        "title": "This Week in Coins: Bitcoin and Ethereum See Fourth Flat Week as TRON and Tether Surge - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIt was the fourth consecutive week of flat prices. A generally slow news cycle meant that market leaders Bitcoin and Ethereum remained where they were last weekend.\n\nBitcoin depreciated a nominal 0.5% and currently trades at $26,815, while Ethereum rose 1% over the seven days and now enters the weekend at $1,829.\n\nOn Monday, an AI-generated photo depicting a fabricated explosion at the Pentagon briefly caused a selloff in stocks and Bitcoin.\n\nAD\n\nAD\n\nMarkets were decidedly flat across the board, with no top thirty cryptocurrency posting significant gains except TRON, which rallied 8% to $0.076778.\n\nTRON’s rally this week appears to have been driven by the climbing market capitalization of the U.S. dollar-pegged stablecoin Tether (USTD), as the latter inches towards overtaking its all-time high of $83.2 billion, set in May last year.\n\nAccording to CoinGecko, Tether may set a new high watermark any day now.\n\nTRON and USDT’s joint rally appears to be linked to the fact that the majority of USDT, approximately $46 billion, is issued on Tron, surpassing the $36 billion on Ethereum. Recent data shows a steep rise in USDT on the TRON network throughout 2023 so far.\n\nThe biggest losses among cryptocurrencies this week were posted by Internet Computer (ICP), which fell 6% to $4.88, and Lido DAO (LDO), which dropped 7.1% to $1.96.\n\nAD\n\nAD\n\nCoin politics\n\nCrypto is already a major talking point in Bitcoin-friendly Florida Governor Ron DeSantis’s campaign as he gets ready to run as the GOP’s candidate in next year’s U.S. presidential elections.\n\nDeSantis headlined an otherwise disastrous Twitter Spaces the day he announced his candidacy and told his host, Twitter/Tesla CEO Elon Musk, that Biden’s administration “[has] it out for Bitcoin, and if it continues for another four years, they’ll probably end up killing it.”\n\nOn Tuesday, The International Organization of Securities Commissions (IOSCO) released a report outlining policy recommendations for global crypto regulation as part of the public consultation process.\n\nIn a nod to the fall of FTX, the IOSCO recommendations warn regulators about crypto companies \"combining certain functions in a single legal entity or group of affiliated entities,” such as one entity running exchanges, trading firms, and custody businesses under one roof.\n\nOn Thursday, watchdog the European Systemic Risk Board (ESRB) released a report concluding that the industry’s economic impact is minimal, but advising vigilance and policymaking that monitors leveraged trading and the industry’s financial contagion risks.\n\nThat same day, the European Securities and Markets Authority (ESMA) and National Competent Authorities (NCAs) issued a statement saying that cryptocurrencies must be clearly labeled as unregulated and both investors and investment firms should understand the financial risks involved in trading them."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2J1aWxkaW5nLWEtc3Ryb25nLWNyeXB0by1wb3J0Zm9saW8tc3RhcnRzLXdpdGgtYml0Y29pbi1ldGhlcmV1bS1hbmQtYXZvcmFrLWFpL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 May 2023 07:00:00 GMT",
        "title": "Building a strong crypto portfolio starts with Bitcoin, Ethereum, and Avorak AI - Analytics Insight",
        "content": "In crypto, as is with any investment, it is important to diversify your portfolio. Several analysts suggest that building a strong crypto portfolio starts with Bitcoin (BTC), Ethereum (ETH), and Avorak AI (AVRK).\n\nWhy you should hold Bitcoin\n\nWith several banks collapsing and the FED raising interest rates, the traditional financial systems are clearly unstable, and this could lead to cryptocurrencies becoming increasingly popular. Bitcoin (BTC) is the largest and most valuable cryptocurrency by market cap. It is also the first-ever cryptocurrency and has already seen massive worldwide adoption. Bitcoin (BTC) has a maximum supply of 21 million, and more than 19 million are already in circulation. And by laws of demand and supply, BTC is expected to increase in value over time. Additionally, Bitcoin is nearly a year away from its halving event, which is usually a catalyst for a spike in its value.\n\nWhat’s next for Ethereum?\n\nAfter Ethereum’s recent Shapella upgrade, many in the crypto community wonder what is next for the world’s second-largest cryptocurrency. It can seem like Ethereum is always in a state of development, and that is because its team is working on what they call Ethereum 2.0. Opponents of Ethereum have often criticized the network’s scalability, pointing to its high transaction costs, slow speeds, and energy usage. Ethereum 2.0 aims to provide a more scalable network by offering safer, faster, cheaper, and more energy-efficient transactions. Analysts suggest that Ethereum’s developmental success could see its value increase significantly.\n\nAvorak AI (AVRK): Better for 100x\n\nAvorak is a new AI crypto project running on the BNB Smart Chain. The project includes a suite of AI products and services that can streamline human-led processes. For example, Avorak’s digital assistants and chatbots can enhance customer service by providing accurate and immediate answers to customers’ queries. The Avorak Trade bot can optimize the trading of any asset, including crypto, fiat, and stocks. The bot uses AI algorithms to analyze market trends, provide predictions on future prices, and find the best possible trades. The trade can be easily programmed to automate trades on multiple exchanges.\n\nAvorak’s suite of AI solutions can be used in many fields, including content creation, data analytics, online shopping, and security. AVRK is Avorak’s native utility token and functions as a credit for accessing the Avorak AI services. AVRK can be staked or traded on various centralized and decentralized exchanges once the project goes live. Avorak also distributes a share of its profits to AVRK holders through its revenue feedback system. There is a maximum supply of 40 million AVRK, and Avorak AI has burn mechanics that ensure continuous deflation of the AVRK token.\n\nEvery cryptocurrency investor seeks to find a 100X gem, that is, a coin that will skyrocket in value and turn a small investment into a fortune. Well, AVRK provides just that. Avorak has an ongoing ICO (initial coin offering) event, selling AVRK at a comparatively low price and offering a number of advantages to its investors. AI crypto is expected to generate substantial profits in 2023, and several analysts believe Avorak AI could lead this bull run once it’s launched.\n\nFor more information on Avorak AI:\n\nWebsite: https://avorak.ai\n\nBuy AVRK: https://invest.avorak.ai/register\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2Nhbi1ibG9ja2NoYWluLXRlY2hub2xvZ3ktYmUtdXNlZC1mb3ItcnVyYWwtZGV2ZWxvcG1lbnQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 May 2023 07:00:00 GMT",
        "title": "Can Blockchain Technology be Used for Rural Development? - Analytics Insight",
        "content": "Explore the impact of leveraging blockchain technology for empowering rural development\n\nIn recent years, blockchain technology has gained significant attention for its potential to revolutionize various sectors. While often associated with cryptocurrencies, the underlying technology offers much more. One promising application lies in rural development, where blockchain can empower marginalized communities by enhancing transparency, efficiency, and trust. This article explores the transformative potential of blockchain technology for rural development and presents a compelling example of its successful implementation.\n\nBlockchain for Transparent Land Governance:\n\nLand governance is a critical aspect of rural development, as it directly impacts access to resources and livelihoods. Unfortunately, many rural areas suffer from insecure land tenure systems, leading to disputes, corruption, and exclusion. Blockchain technology can address these challenges by providing transparent and immutable land registries. Through decentralized finance and tamper-proof databases, land ownership records can be securely stored, ensuring trust among stakeholders. For instance, Bitland, a blockchain-based land registry in Ghana, has successfully enabled small-scale farmers to secure their land rights, reducing disputes and unlocking access to credit and other development opportunities.\n\nEnhancing Supply Chain Management\n\nBlockchain technology can transform the supply chain management of agricultural products, benefiting both farmers and consumers. By creating a transparent and immutable record of every stage of the supply chain, from production to distribution, blockchain ensures that the quality and authenticity of products can be verified. This is particularly crucial for rural communities that heavily rely on agriculture as their primary source of income. For example, coffee farmers in remote regions can use blockchain to track the journey of their coffee beans, ensuring fair prices and minimizing the risk of fraud throughout the supply chain. This not only improves the farmers’ income but also assures consumers of the product’s origin and quality.\n\nSmart Contracts and Agricultural Insurance\n\nSmart contracts, powered by blockchain technology, enable the automation and execution of agreements without intermediaries. In the context of empowering rural development, smart contracts can streamline agricultural insurance processes. By using predefined conditions and triggers, smart contracts can automatically trigger insurance payouts when specific events, such as crop failure due to adverse weather conditions, occur. This eliminates the need for manual claims processing and reduces administrative costs, making agricultural insurance more accessible and affordable for farmers in rural areas. Such initiatives have the potential to safeguard farmers’ livelihoods and foster sustainable agricultural practices.\n\nFinancial Inclusion and Microfinance:\n\nAccess to financial services is a crucial driver of rural development, yet many rural communities lack formal banking infrastructure. Blockchain technology can facilitate financial inclusion by enabling secure and low-cost transactions without the need for traditional banks. By leveraging mobile devices and digital identities, blockchain-based platforms empower rural populations to access microfinance services, make payments, and build credit histories. The BanQu project in Kenya exemplifies this potential, offering a blockchain-based platform that enables smallholder farmers to create a verifiable economic identity, access loans, and improve their economic prospects.\n\nCase Study: Blockchain-based Supply Chain for Rwandan Coffee\n\nOne notable example of blockchain technology’s impact on rural development is the partnership between the Rwandan government, technology company Bext360, and the coffee industry. Through a blockchain-based supply chain platform, coffee farmers in Rwanda can trace the entire journey of their beans, from harvest to export. This has significantly improved transparency and accountability in the supply chain, ensuring fair prices for farmers and enhancing the reputation of Rwandan coffee in international markets. By directly connecting farmers to buyers and facilitating instant payments, blockchain technology has empowered rural coffee farmers, contributing to poverty reduction and sustainable economic growth in the region.\n\nIn Conclusion\n\nBlockchain technology holds immense promise for rural development, offering innovative solutions to address the challenges faced by marginalized communities. By providing transparent and immutable records, blockchain can enhance land governance, empowering farmers with secure land rights. Furthermore, blockchain can revolutionize agricultural supply chains, enabling fair compensation for farmers and connecting them directly with consumers. Lastly, by promoting financial inclusion and microfinance, blockchain can empower rural populations to access vital financial services. As we explore the vast potential of blockchain technology, it is crucial to ensure its responsible implementation, bridging the digital divide and creating a more equitable future for rural communities worldwide.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    }
]