[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY3J5cHRvLm5ld3MvZXRoZXJldW0tY28tZm91bmRlci12aXRhbGlrLWJ1dGVyaW4tc2Vlcy00Mm0taW4td2Vla2x5LWdhaW5zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Oct 2023 07:00:00 GMT",
        "title": "Ethereum co-founder Vitalik Buterin sees $42m in weekly gains - crypto.news",
        "content": "Ethereum co-founder Vitalik Buterin’s crypto portfolio has increased by $57 million over the past week, according to blockchain analytics platform Arkham Intelligence.\n\nThe value of the portfolio held in Buterin’s publicly-known addresses rose by over 14% from $396 million on Oct. 17 to $453 million on Oct. 24.\n\nThe gain coincides with a significant increase in the price of Ethereum (ETH), which makes up the vast majority of Buterin’s holdings. ETH is currently trading at $1,835, up 9.4% compared to just a week ago.\n\nYou might also like: Vitalik Buterin’s holdings lost $20m in a week\n\nButerin was an early contributor to the Ethereum project. He holds nearly 247,000 ETH spread across various publicly-known wallet addresses. As Ethereum’s co-founder, he was allocated a significant share of ETH in the project’s early days. With ETH hitting new highs, Buterin’s stake has substantially increased in value.\n\nThe 27-year-old crypto billionaire is known for periodically donating to charity. Very recently, he dispelled rumors that he sold some of his holdings, claiming that instead, he was donating more money to charity.\n\nFollow Us on Google News"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zaWducy1wb2ludC1wb3RlbnRpYWxseS1zaWduaWZpY2FudC1ldGhlcmV1bS0xMzI5MTU1MjEuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Oct 2023 07:00:00 GMT",
        "title": "Signs Point to Potentially Significant Ethereum Rally - Yahoo Finance",
        "content": "This article was originally published on ETFTrends.com.\n\nThe cryptocurrency universe is growing increasingly enthusiastic regarding the possibility that the SEC will soon approve a spot bitcoin ETF. But market participants shouldn’t take their eyes off ethereum.\n\nEthereum is the digital platform for transactions conducted in ether, the second-largest digital currency behind bitcoin. Alone, that status makes ethereum worth watching, if not investing in. Regarding the latter point, a slew of recently launched U.S.-listed ETFs make that process easier. That group includes the VanEck Ethereum Strategy ETF (EFUT).\n\nThe actively listed EFUT \"offers exposure to ether-linked investments through an accessible exchange traded vehicle. The Fund does not invest in ether or other digital assets directly,” according to VanEck. Some interesting signs are pointing to near-term upside for ethereum, potentially signaling that EFUT is a new ETF for risk-tolerant investors to consider.\n\nEthereum Whale Watching\n\nA favorite pastime of some experienced crypto investors is monitoring “whale” activity in some of the more broadly tracked, liquid digital currencies; namely, bitcoin and ether. In simple terms, whales are sizable owners of these cryptocurrenices, and their buy and sell orders can affect pricing.\n\nEFUT could receive a spark from ether whales because data indicates that cohort of market participants has recently been active.\n\n“Indeed, Ethereum whale transactions, specifically those above $100,000, have skyrocketed to a six-month high, while the supply of ETH on exchanges has hit a record low since its genesis in 2015, according to the data shared by blockchain analytics platform Santiment on October 25,” reported Ana Zirojevic for Finbold.\n\nIncreased activity among large traders could very well be one reason ether is higher by more than 14% over the past week. As Finbold noted, there were nearly 6,050 ethereum trades worth at least $100,000 on Tuesday, representing the biggest day by that metric in six months.\n\nStory continues\n\nPotentially adding to the case for EFUT is that point that the recent uptick in sizable activity in ethereum isn’t a one-off contained to this digital currency. Rather, it’s occurring across other major cryptocurrencies as well.\n\n“At the same time, Bitcoin (BTC), Cardano (ADA), and Dai (DAI) are witnessing massive increases in whale activity themselves, with Bitcoin recording 14,833 of $100,000+ transactions on October 24, the most since June’s news of the multiple filings for a spot Bitcoin exchange-traded fund (ETF), according to the blockchain platform’s analysis,” observed Finbold.\n\nFor more news, information, and analysis, visit the Beyond Basic Beta Channel.\n\nPOPULAR ARTICLES AND RESOURCES FROM ETFTRENDS.COM\n\n\n\nREAD MORE AT ETFTRENDS.COM >"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zaWducy1wb2ludC1wb3RlbnRpYWxseS1zaWduaWZpY2FudC1ldGhlcmV1bS0xMzI5MTU1MjEuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Oct 2023 07:00:00 GMT",
        "title": "Signs Point to Potentially Significant Ethereum Rally - Yahoo Finance",
        "content": "This article was originally published on ETFTrends.com.\n\nThe cryptocurrency universe is growing increasingly enthusiastic regarding the possibility that the SEC will soon approve a spot bitcoin ETF. But market participants shouldn’t take their eyes off ethereum.\n\nEthereum is the digital platform for transactions conducted in ether, the second-largest digital currency behind bitcoin. Alone, that status makes ethereum worth watching, if not investing in. Regarding the latter point, a slew of recently launched U.S.-listed ETFs make that process easier. That group includes the VanEck Ethereum Strategy ETF (EFUT).\n\nThe actively listed EFUT \"offers exposure to ether-linked investments through an accessible exchange traded vehicle. The Fund does not invest in ether or other digital assets directly,” according to VanEck. Some interesting signs are pointing to near-term upside for ethereum, potentially signaling that EFUT is a new ETF for risk-tolerant investors to consider.\n\nEthereum Whale Watching\n\nA favorite pastime of some experienced crypto investors is monitoring “whale” activity in some of the more broadly tracked, liquid digital currencies; namely, bitcoin and ether. In simple terms, whales are sizable owners of these cryptocurrenices, and their buy and sell orders can affect pricing.\n\nEFUT could receive a spark from ether whales because data indicates that cohort of market participants has recently been active.\n\n“Indeed, Ethereum whale transactions, specifically those above $100,000, have skyrocketed to a six-month high, while the supply of ETH on exchanges has hit a record low since its genesis in 2015, according to the data shared by blockchain analytics platform Santiment on October 25,” reported Ana Zirojevic for Finbold.\n\nIncreased activity among large traders could very well be one reason ether is higher by more than 14% over the past week. As Finbold noted, there were nearly 6,050 ethereum trades worth at least $100,000 on Tuesday, representing the biggest day by that metric in six months.\n\nStory continues\n\nPotentially adding to the case for EFUT is that point that the recent uptick in sizable activity in ethereum isn’t a one-off contained to this digital currency. Rather, it’s occurring across other major cryptocurrencies as well.\n\n“At the same time, Bitcoin (BTC), Cardano (ADA), and Dai (DAI) are witnessing massive increases in whale activity themselves, with Bitcoin recording 14,833 of $100,000+ transactions on October 24, the most since June’s news of the multiple filings for a spot Bitcoin exchange-traded fund (ETF), according to the blockchain platform’s analysis,” observed Finbold.\n\nFor more news, information, and analysis, visit the Beyond Basic Beta Channel.\n\nPOPULAR ARTICLES AND RESOURCES FROM ETFTRENDS.COM\n\n\n\nREAD MORE AT ETFTRENDS.COM >"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8venljcnlwdG8uY29tL2V0aGVyZXVtLWZhY2VzLWNyaXRpY2FsLXRlc3QtYXQtMTk2MC1hcy1tYXNzaXZlLTMzLW1pbGxpb24tZXRoLXJlc2lzdGFuY2UtZW1lcmdlcy_SAWtodHRwczovL3p5Y3J5cHRvLmNvbS9ldGhlcmV1bS1mYWNlcy1jcml0aWNhbC10ZXN0LWF0LTE5NjAtYXMtbWFzc2l2ZS0zMy1taWxsaW9uLWV0aC1yZXNpc3RhbmNlLWVtZXJnZXMvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Faces Critical Test At $1,960 As Massive 33 Million ETH Resistance Emerges - ZyCrypto",
        "content": "Advertisement\n\nEthereum (ETH), the second-largest cryptocurrency by market capitalization, has been making significant strides in recent weeks, riding on the wave of positive developments in the crypto industry.\n\nOver the past seven days, Ether has witnessed a remarkable surge of 16%. However, its primary rival, Bitcoin, has outpaced it with a 20% surge during the same period. Notably, this surge saw Ethereum breaking key resistance at $1,745, sparking optimism among investors and analysts.\n\nDespite these gains, Ethereum’s upward momentum is now at a critical juncture. The crypto community is closely monitoring a formidable resistance level at $1,960, which has raised concerns.\n\nOn Thursday, popular crypto analyst Ali Martinez took to Twitter to shed light on this impending challenge, stating, “When will Ethereum break out? Well, you may need to wait for $ETH to overcome the huge supply wall at $1,960. Here, 1.14 million addresses bought nearly 33 million ETH, according to data from Into the Block.”\n\nThis said resistance level, often referred to as a “buy wall,” represents a level where a substantial amount of Ethereum was bought in the past. Investors who bought then may be inclined to sell their Ethereum at this price point, which can act as a significant barrier to further price appreciation.\n\nAdvertisement\n\nInterestingly, the close correlation between Ethereum and Bitcoin has been evident, where changes in one frequently impact the other. In another tweet, Martinez pointed out that Bitcoin’s potential 5% correction to $33,000, driven by its formation of an ascending triangle on the hourly chart, a move that could trigger a similar selloff in Ethereum.\n\nAdding to Martinez’s views, crypto analyst ‘Cryptotony’ also presented a bearish perspective on Ethereum, telling his 346,000 X followers that the cryptocurrency might gain momentum and test the $2,500 resistance zone before entering a distribution phase and possibly decline leading up to the next halving event.\n\nAnother analyst, ‘Cryptonary,’ emphasized the significance of Ethereum’s ongoing test, stating that it was crucial to determine whether the bulls could break through the resistance at $1,960 or if Ethereum would echo Bitcoin’s overbought signals.\n\nNotably, the pundit’s technical analysis revealed that Ethereum had been oscillating between support at $1,745 and resistance at $1,823-$1,853, with no clear breakout yet. Additionally, he noted that the daily Relative Strength Index (RSI) was overbought but not as extended as Bitcoin’s.\n\nThat said, as Ethereum faces a pivotal moment along the $1,960 resistance level, the outcome of this test will determine whether Ethereum can continue its recent bullish trend, plunge or face a period of consolidation.\n\nEther was trading at $1,796 at press time after a 0.32% increase over the past 24 hours."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V0aGVyZXVtLWRldmVsb3BlcnMtaGFyZC1mb3Jr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Oct 2023 07:00:00 GMT",
        "title": "Core devs rule out Dencun fork this year - Blockworks",
        "content": "Ethereum client developers confirmed on Thursday that the anticipated Dencun upgrade will not be implemented in a network hard fork before the end of 2023.\n\nAlready last month, when the new Holešky testnet was successfully launched behind schedule, the consensus was that putting the upgrade through its paces by the time December holidays rolled around was unlikely.\n\nWhen an optimistic scenario was put forward on today’s All Core Developers call, the consensus was evidently with pseudonymous Prysm developer Potuz, who commented, “there is no way we are forking mainnet in 2023.”\n\nHe pointed to consistent consensus issues arising on the 10 developer networks (devnets) that have been spun up so far to test the upgrade over the past few months, adding that “not a single one went well.”\n\nRead more: Devnet, testnet, mainnet: Ethereum’s next upgrade progresses — slowly\n\nEthereum clients are divided into two main camps, one for the execution layer and the other the consensus layer, with the distinction reflected in the name of the upgrade — consensus teams use cities where Ethereum’s major conference, Devcon, has been held (e.g. Cancun), while execution client developers opt for star names (e.g. Deneb) — hence “Dencun.”\n\nIn contrast to the consensus teams, execution layer client teams reported being in good shape for the upcoming testnets.\n\n“We are in a pretty good place, a lot of things are also on Master now,” said Geth developer known as Lightclient, referring to the Go Ethereum project’s digital workspace where the code, files, and revision history are stored.\n\nDevnet 10 was launched this week, with plans for the execution clients to transition to a larger test on the Goerli testnet. But Prysm’s Potuz is not on board with that idea.\n\n“I’m definitely not comfortable at all having a full client fork on Goerli,” he said. “I see very large and deep changes still being pushed in the branch,” he added regarding Prysm, the software currently runs 45% of the consensus layer clients.\n\nA smaller Devnet 11 is planned, but it now appears the move to testnets will be put off until after Ethereum’s Devconnect developer conference, which will be held in Istanbul in mid-November.\n\nCelebrating the KZG ceremony\n\nThe Dencun upgrade required a bit of fancy cryptography to ensure the Ethereum scaling improvement, known as Proto-Danksharding, a key feature, remains secure.\n\nThe KZG Ceremony involved multiple participants, each concocting a secret and performing a computation to blend it with preceding contributions. This process results in the formation of a “structured reference string” (SRS), which is crucial for the KZG Commitments cryptographic scheme, and integral to Proto-Danksharding.\n\nThe final outcome of this chain of contributions is then put into the upgrade. The whole setup remains secure so long as there is at least one honest participant in the ceremony. After months of soliciting contributions, a total of 141,416 makes that all but certain.\n\nCarl Beekhuizen, who coordinated the ceremony for the Ethereum Foundation, invited participants to verify that their contributions are, in fact, included, by visiting ceremony.ethereum.org.\n\nThere, one can input a contributing wallet address, and receive a commemorative POAP NFT.\n\nDon’t miss the next big story – join our free daily newsletter."
    }
]