[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMi8yMy9ldGhlcmV1bS1zaGliYS1pbnUtYW5kLW9uZS1hbHRjb2luLXRoYXRzLWV4cGxvZGVkLW92ZXItMjUwLWluLXR3by1tb250aHMtZmxhc2hpbmctYnVsbGlzaC1zaWduYWxzLXNhbnRpbWVudC_SAZEBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMTIvMjMvZXRoZXJldW0tc2hpYmEtaW51LWFuZC1vbmUtYWx0Y29pbi10aGF0cy1leHBsb2RlZC1vdmVyLTI1MC1pbi10d28tbW9udGhzLWZsYXNoaW5nLWJ1bGxpc2gtc2lnbmFscy1zYW50aW1lbnQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "Ethereum, Shiba Inu and One Altcoin That’s Exploded Over 250% in Two Months Flashing Bullish Signals: Santiment - The Daily Hodl",
        "content": "Cryptocurrency analytics platform Santiment is naming three digital assets that it says possess long-term bullish prospects.\n\nSantiment says that Ethereum (ETH), Shiba Inu (SHIB) and the artificial intelligence-focused crypto project Fetch.ai (FET) are witnessing a reduction of the supply held on exchanges by their top 10 holders.\n\nAccording to Santiment, the moving of the three crypto assets by the respective top 10 holders from exchanges is a “bullish long-term signal”.\n\nThe crypto analytics platform says that in the case of Fetch.ai, the top 10 largest wallets have reduced their FET holdings on exchanges by 26.1% in the last three months. The top 10 holders of Ethereum and Shiba Inu, on the other hand, have cut their holdings on exchanges by 4.3% and 2.7%, respectively, over the past 90 days.\n\nEthereum is trading at $2,306 at time of writing, while Shiba Inu is changing hands at $0.0000106. Fetch.ai is priced at $0.729 at time of writing, up by 259% from its October 23rd price of $0.203.\n\nEarlier this week, Santiment said that the supply of Ethereum on exchanges had reached a new low since the official launch of the second-largest crypto asset by market cap.\n\n“As Ethereum’s market value hangs just above $2,170, the largest exchange wallets continue to move coins into smaller wallets or off exchanges entirely. 240,000 ETH has been collectively moved from these wallets in 24 hours, a 2.99% drop in coins held.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8venljcnlwdG8uY29tL2V0aGVyZXVtLWZhY2VzLWNyb3Nzcm9hZHMtYXMtc29sYW5hLWdhaW5zLWdyb3VuZC1pbi1zbWFydC1jb250cmFjdC1kb21pbmFuY2Uv0gFmaHR0cHM6Ly96eWNyeXB0by5jb20vZXRoZXJldW0tZmFjZXMtY3Jvc3Nyb2Fkcy1hcy1zb2xhbmEtZ2FpbnMtZ3JvdW5kLWluLXNtYXJ0LWNvbnRyYWN0LWRvbWluYW5jZS8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Faces Crossroads as Solana Gains Ground in Smart Contract Dominance - ZyCrypto",
        "content": "Advertisement\n\nEthereum (ETH), the once-revered pioneer in smart contract platforms, now finds itself at a crucial juncture as Solana (SOL) makes significant strides in the domain.\n\nOver the past week, the cryptocurrency community has been abuzz with discussions sparked by Solana’s 800% YTD price surge and the ecosystem’s impressive growth, with some speculating about its potential to surpass Ethereum. The ongoing debate revolves around scalability, transaction fees, and the fundamental shift from Proof of Work (PoW) to Proof of Stake (PoS) that Ethereum made.\n\nNotably, Ethereum’s troubles seem to compound, with the ultra-sound money narrative faltering as Ether (ETH) faces a 30% decline year-to-date against Bitcoin (BTC). Simultaneously, it’s losing ground to Solana on the smart contract front, as highlighted by popular trader Rip Vanwinkle on Saturday via X (formerly Twitter).\n\nAccording to Vanwinkle, Ethereum’s move from Proof of Work (PoW) to Proof of Stake (PoS) was a betrayal of its initial principles. In the tweet, he argued that the transition aimed at enriching founders and insiders by enabling them to stake ETH and profit from fees that would otherwise be burned as gas. This transition, according to him, undermined Ethereum’s core purpose as a gas token and challenged the principles of decentralization.\n\nIn response to these criticisms, Ethereum co-founder Vitalik Buterin has recently acknowledged the need for improvements, noting they are actively working on the Ethereum 2.0 upgrade. This upgrade intends to address scalability and transaction fee issues by implementing a PoS consensus mechanism. However, the success of this transition remains uncertain, leaving Ethereum vulnerable to the growing popularity of Solana.\n\nAdvertisement\n\nIt is important to note that Solana’s appeal lies in its scalability and cost-effectiveness for smart contracts. Despite lacking complete decentralization, users prioritize low fees and fast transactions over absolute decentralization.\n\nMeanwhile, the broader cryptocurrency landscape has witnessed a surge in smart contract platform tokens, with Solana and Avalanche closing in on Ethereum and Binance Coin (BNB). Notably, in terms of value, Solana has experienced a 67% surge in the past month, positioning itself as the closest contender to Ethereum which is up only 11%.\n\nAdditionally, as highlighted by ZyCrypto, Solana’s Decentralized Exchange (DEX) trading volumes surpassed those of Ethereum for the first time in history this week, holding consistently for three days. Digital asset platform Coinchange has even predicted that this trend could extend to the Total Value Locked (TVL) in DeFi in the near future.\n\nThat said, Ethereum’s fate in this evolving landscape remains uncertain as it grapples with internal challenges and external competition. It thus remains to be seen whether Ethereum can maintain its dominance as a smart contract platform."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL3d3dy5iZW56aW5nYS5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS8yMy8xMi8zNjM1OTgyMS9iZW56aW5nYS1idWxscy1hbmQtYmVhci1hcHBsZS10ZXNsYS1ldGhlcmV1bS1hbmQtYW5hbHlzdC1kZXRhaWxzLWNvbmRpdGlvbnMtZm9yLWRvZ2Vjb2lucy3SAS1odHRwczovL3d3dy5iZW56aW5nYS5jb20vYW1wL2NvbnRlbnQvMzYzNTk4MjE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "Apple, Tesla, Ethereum And Analyst Details Conditions For Dogecoin's 'Gorgeous Pump' This Christmas: Benz - Benzinga",
        "content": "Benzinga examined the prospects for many investors' favorite stocks over the last week — here's a look at some of our top stories.\n\nThe three primary stock indices marked their eighth straight week of gains, a milestone not seen for the S&P 500 since 2017 and for the Dow since 2019, with increases of 0.8% for the S&P 500, 0.2% for the Dow, and 1.2% for the Nasdaq.\n\nInflation, as measured by the Personal Consumption Expenditures (PCE) index, decreased to 2.5% in November, reaching its lowest point since March 2021, and heightening the anticipation of multiple interest rate cuts in 2024. Following the significant drop in the Federal Reserve's preferred inflation gauge, economists on Friday started to reevaluate the potential impact on the Fed's plans for the next year.\n\nThe disclosure of the PCE inflation figures was accompanied by varied economic data, including an increase in the Michigan Consumer Sentiment Index for December and a substantial drop in November's home sales, which fell below projections.\n\nBenzinga provides daily reports on the stocks most popular with investors. Here are a few of this past week's most bullish and bearish posts that are worth another look.\n\nThe Bulls\n\n\"2024 Predictions For Apple, Tesla, 'Magnificent 7' And Musk From Analyst Dan Ives: It's AI's '1995 Moment',\" by Chris Katje, discusses Daniel Ives' predictions for 2024, highlighting major anticipated developments for Apple Inc. AAPL and Tesla Inc. TSLA, and a monumental breakthrough in AI, which was likened to the internet's emergence in 1995.\n\n\"Novogratz Explains Why Bitcoin Could Be About To Make A 'Parabolic Move' To All-Time Highs And Beyond,\" by Adam Eckert, features Mike Novogratz's forecast of a dramatic rise in Bitcoin BTC/USD, which could potentially surpass previous highs as a result of the anticipated ETF approval and market dynamics.\n\n\"'Gorgeous Pump On DOGE This Christmas:' Crypto Analyst Predicts Dogecoin Rally If It Breaches This Level,\" by Mehab Qureshi, reports that a crypto analyst predicts a significant rally for Dogecoin DOGE/USD if it surpasses the $0.106 mark amid recent whale activities and supportive market trends.\n\nFor additional bullish calls of the past week, check out the following:\n\nShiba Inu Makes History: First Decentralized Ecosystem With Plans To Secure .shib Top-Level Domain, Revolutionizing Web3\n\n'Magnificent 7' Widens Gap With Rest Of S&P 500, But That May Change In 2024\n\nNetflix Has 'Right Formula With Global Content Creation': Why Analyst Is Bullish For Fourth Quarter Results\n\nThe Bears\n\n\"Oil Prices Fall After Angola Says It Will Quit OPEC,\" by Neil Dennis, details a more than 1% decline in oil prices on Thursday, including Brent crude and U.S. West Texas Intermediate crude, and a 0.2% drop in the United States Oil Fund USO, following Angola's announcement to leave OPEC.\n\n\"Veteran Trader Says Ethereum Will Drop Over 75% To $650; 'Price Charts Are Not Sacred',\" by Mehab Qureshi, reports Peter Brandt's prediction of a dramatic over 75% drop in Ethereum ETH/USD to $650, citing the unreliability of classical chart patterns and concerns over Ethereum's functionality and transaction fees.\n\n\"Roku Analyst Turns Bearish, Believes This Revenue Growth Driver Is Less Economic,\" by Priya Nigam, reports on Seaport Research Partners analyst David Joyce downgrading Roku Inc. ROKU from \"Neutral\" to \"Sell,\" citing concerns over its business model and competition in the streaming market.\n\nFor more bearish takes, be sure to see these posts:\n\nWe're In For A Santa Claus Rally Alright, But It Might Be Subpar: Here Are 5 Reasons Why\n\nBankruptcies On The Rise Following End Of COVID Relief Measures And High-Interest Rates\n\nMark Zuckerberg's Meta Said To Be Worried About Indian Telecom Bill's Impact On WhatsApp\n\nKeep up with all the latest breaking news and trading ideas by following Benzinga on Twitter."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL3d3dy5iZW56aW5nYS5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS8yMy8xMi8zNjM1OTgyMS9iZW56aW5nYS1idWxscy1hbmQtYmVhci1hcHBsZS10ZXNsYS1ldGhlcmV1bS1hbmQtYW5hbHlzdC1kZXRhaWxzLWNvbmRpdGlvbnMtZm9yLWRvZ2Vjb2lucy3SAS1odHRwczovL3d3dy5iZW56aW5nYS5jb20vYW1wL2NvbnRlbnQvMzYzNTk4MjE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "Apple, Tesla, Ethereum And Analyst Details Conditions For Dogecoin's 'Gorgeous Pump' This Christmas: Benz - Benzinga",
        "content": "Benzinga examined the prospects for many investors' favorite stocks over the last week — here's a look at some of our top stories.\n\nThe three primary stock indices marked their eighth straight week of gains, a milestone not seen for the S&P 500 since 2017 and for the Dow since 2019, with increases of 0.8% for the S&P 500, 0.2% for the Dow, and 1.2% for the Nasdaq.\n\nInflation, as measured by the Personal Consumption Expenditures (PCE) index, decreased to 2.5% in November, reaching its lowest point since March 2021, and heightening the anticipation of multiple interest rate cuts in 2024. Following the significant drop in the Federal Reserve's preferred inflation gauge, economists on Friday started to reevaluate the potential impact on the Fed's plans for the next year.\n\nThe disclosure of the PCE inflation figures was accompanied by varied economic data, including an increase in the Michigan Consumer Sentiment Index for December and a substantial drop in November's home sales, which fell below projections.\n\nBenzinga provides daily reports on the stocks most popular with investors. Here are a few of this past week's most bullish and bearish posts that are worth another look.\n\nThe Bulls\n\n\"2024 Predictions For Apple, Tesla, 'Magnificent 7' And Musk From Analyst Dan Ives: It's AI's '1995 Moment',\" by Chris Katje, discusses Daniel Ives' predictions for 2024, highlighting major anticipated developments for Apple Inc. AAPL and Tesla Inc. TSLA, and a monumental breakthrough in AI, which was likened to the internet's emergence in 1995.\n\n\"Novogratz Explains Why Bitcoin Could Be About To Make A 'Parabolic Move' To All-Time Highs And Beyond,\" by Adam Eckert, features Mike Novogratz's forecast of a dramatic rise in Bitcoin BTC/USD, which could potentially surpass previous highs as a result of the anticipated ETF approval and market dynamics.\n\n\"'Gorgeous Pump On DOGE This Christmas:' Crypto Analyst Predicts Dogecoin Rally If It Breaches This Level,\" by Mehab Qureshi, reports that a crypto analyst predicts a significant rally for Dogecoin DOGE/USD if it surpasses the $0.106 mark amid recent whale activities and supportive market trends.\n\nFor additional bullish calls of the past week, check out the following:\n\nShiba Inu Makes History: First Decentralized Ecosystem With Plans To Secure .shib Top-Level Domain, Revolutionizing Web3\n\n'Magnificent 7' Widens Gap With Rest Of S&P 500, But That May Change In 2024\n\nNetflix Has 'Right Formula With Global Content Creation': Why Analyst Is Bullish For Fourth Quarter Results\n\nThe Bears\n\n\"Oil Prices Fall After Angola Says It Will Quit OPEC,\" by Neil Dennis, details a more than 1% decline in oil prices on Thursday, including Brent crude and U.S. West Texas Intermediate crude, and a 0.2% drop in the United States Oil Fund USO, following Angola's announcement to leave OPEC.\n\n\"Veteran Trader Says Ethereum Will Drop Over 75% To $650; 'Price Charts Are Not Sacred',\" by Mehab Qureshi, reports Peter Brandt's prediction of a dramatic over 75% drop in Ethereum ETH/USD to $650, citing the unreliability of classical chart patterns and concerns over Ethereum's functionality and transaction fees.\n\n\"Roku Analyst Turns Bearish, Believes This Revenue Growth Driver Is Less Economic,\" by Priya Nigam, reports on Seaport Research Partners analyst David Joyce downgrading Roku Inc. ROKU from \"Neutral\" to \"Sell,\" citing concerns over its business model and competition in the streaming market.\n\nFor more bearish takes, be sure to see these posts:\n\nWe're In For A Santa Claus Rally Alright, But It Might Be Subpar: Here Are 5 Reasons Why\n\nBankruptcies On The Rise Following End Of COVID Relief Measures And High-Interest Rates\n\nMark Zuckerberg's Meta Said To Be Worried About Indian Telecom Bill's Impact On WhatsApp\n\nKeep up with all the latest breaking news and trading ideas by following Benzinga on Twitter."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy8zLXJlYXNvbnMtd2h5LWV0aGVyZXVtLWV0aC1wcmljZS1jb3VsZC1yYWxseS1hYm92ZS0yNTAw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "3 reasons why Ether (ETH) could rally above $2,500 - Cointelegraph",
        "content": "Ether (ETH) last approached the $2,400 resistance on Dec. 9 but failed to break through, resulting in a retest of the $2,120 support level. This time, investors are gaining confidence in surpassing this level, venturing into territory not seen since May 2022, before the collapse of the Terra ecosystem. On Dec. 22, Ether stood out with a 4% increase, while Bitcoin (BTC) and BNB (BNB) remained primarily unchanged.\n\nWhile the spotlight is on the exchange-traded fund (ETF) narrative as the primary driver of recent cryptocurrency gains, there are several reasons supporting Ether’s price surge that could potentially push it above $2,500 before the expected ETF approval in mid-January, although the United States Securities and Exchange Commission (SEC) might take until March.\n\nEthereum network DApp volumes and protocol fees\n\nRather than attempting to predict the future, which is a challenging task in the fast-paced cryptocurrency industry, it’s more prudent to analyze recent trends influencing the demand for Ether using decentralized applications (DApps) activity as an indicator. One can start by examining DApp volumes, as some sectors do not require a large total value locked (TVL), such as nonfungible token marketplaces, games, layer-2 bridges and social networks.\n\n7-day DApp volumes per blockchain in U.S. dollars. Source: DappRadar\n\nEthereum DApp volumes reached $27.8 billion in the last seven days, marking a 14.2% increase on the previous week. This growth was driven by a 21% gain in Uniswap and a 52% gain in Balancer volumes. In contrast, BNB Chain’s volumes for the same period stood at $4.5 billion, while Arbitrum amassed another $5 billion. Most notably, Ethereum was the only blockchain among the top six to experience a volume increase in the past seven days.\n\nTo provide some perspective, Solana (SOL) would need to increase by 12 times to reach half of Ethereum DApps’ current transaction volume. In general, 20% of users account for 80% of the volume, which holds for DApps. Given Ethereum’s first-mover advantage and substantial treasury for ecosystem development support, the odds do not favor a flipping in the short to medium term.\n\nFurthermore, no other blockchain can match Ethereum’s protocol, which generated $95.4 million in fees in the last seven days, excluding Bitcoin, which is not a direct competitor in the DApp ecosystem. Aside from incentivizing network security, this data indicates significant potential for increased activity following future updates, including ’DenCun’ scheduled for January, which aims to enhance processing capacity and reduce costs.\n\nEthereum spot ETF approval is not priced in according to derivatives markets\n\nThe eventual approval of the Ether spot ETF will set Ether apart from other cryptocurrencies in terms of regulation. Competitors have only been nominally mentioned by regulators in recent court cases against exchanges, which face charges for offering securities brokerage and services without proper registration.\n\nRelated: Community responds to Gary Gensler’s latest jab at crypto\n\nFinally, investors should assess the positioning of Ether derivatives traders, especially large investors and market makers. The Ether futures premium, measuring the difference between two-month contracts and the spot price, has reached its highest level in over a year. In a healthy market, the annualized premium, or basis rate, typically falls within the 5% to 10% range.\n\nEther two-month futures premium vs. spot markets. Source: Laevitas.ch\n\nThe current 13.5% Ether futures annualized premium suggests that traders are not taking the spot Ether ETF approval for granted. During widespread excitement, this indicator tends to exceed 20%, driven by increased demand for leveraged long positions, causing price distortions relative to the spot market. This data implies the potential for a positive price impact in case of approval, whether in January or March.\n\nBased on Ethereum’s network activity, Ether investors should not yield to the pressure from contenders gaining momentum, at least not until these contenders pose a genuine threat in terms of volumes and deposits. Furthermore, the ETH derivatives indicator provides clear guidance that professional traders are bullish despite Ether’s price nearing its highest level since May 2022. This suggests that investors are confident in Ether’s ability to break above $2,500.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    }
]