[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMC8xNS80NjEtc29sYW5hLXNvbC1wcmljZS10YXJnZXQtb24tdGhlLXRhYmxlLWlmLWV0aGVyZXVtLWV0aC1kb2VzLXRoaXMtbmV4dC1idWxsLWN5Y2xlLWludmVzdGFuc3dlcnMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 15 Oct 2023 07:00:00 GMT",
        "title": "$461 Solana (SOL) Price Target on the Table if Ethereum (ETH) Does This Next Bull Cycle: InvestAnswers - The Daily Hodl",
        "content": "A closely followed crypto analyst says that traders may be underestimating Solana’s (SOL) potential in the next bull market.\n\nIn a new strategy session, the host of InvestAnswers says that his base-case thesis for SOL is that it should reach 10% of Ethereum’s (ETH) market cap during the next market expansion.\n\nUnder the presumption that Ethereum tops out at $8,000 in the next bull market, the analyst theorizes that if Solana were to reach 10% of ETH’s market cap, which it already hit in the past, it would imply a $231 price target for SOL.\n\nHowever, InvestAnswers says that SOL reaching 20% of ETH’s market cap isn’t completely out of the realm of possibility.\n\n“If – which has always been part of my thesis – if Solana goes to 20% of the ETH market cap, that would take us to a $192 billion [market cap], and, given today’s prices and the number of tokens, that would take the price to $461, and that would be an ROI (return on investment) of 2,038%, and that would only be 5%, approximately of the crypto market cap. So, it’s not beyond the realm of possibilities at all.\n\nBut what’s even more strange is we got above the 10% threshold already in the past.\n\nThis is the SOL upside chart… You can see here the yellow line is the 10% of ETH market cap, and the Solana price in blue breached that back in October 2021.”\n\nAt time of writing, SOL is trading for $21.99.\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Midjourney"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi1hcy1uZXctcmVjb3ZlcnktbWF5LWVtZXJnZS_SAVZodHRwczovL2NvaW5nYXBlLmNvbS9tYXJrZXRzL2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tYXMtbmV3LXJlY292ZXJ5LW1heS1lbWVyZ2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 15 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction As New Recovery May Emerge From $1500 - CoinGape",
        "content": "The first half of October has been notably bearish for ETH coin, with the price plummeting 12% from a last recorded high of $1,745 down to a local support level of $1,531. Despite this descent, the appearance of a few green candles at this support level suggests that buyers are attempting to rally and set the stage for a potential recovery.\n\nAlso Read: What Should Ethereum Investors Do Amid Bullish Call for $8000 ETH Price?\n\nadvertisement\n\nWill Buyers Regain the $1700 Mark\n\nThe crypto buyers could witness high demand pressure around $1500\n\nThe Ethereum fear and greed index at 41% indicates neutral to bearish sentiment in the market\n\nThe intraday trading volume in Ether is $2.2 Billion, indicating a 34% loss.\n\nSource- Tradingview\n\nThe short-term trend in Ethereum coin price is currently sideways with its price wobbling between two horizontal levels of $1745 to $1530. With the recent downturn in the crypto market, the ETH price has dropped to the bottom support of the aforementioned range.\n\nOn October 13th, the buyers tried to rebound from this support but could not push the price above the $1573 level. Today, with an insignificant intraday loss of 0.05%, the daily candle shows uncertainty among market participants.\n\nTherefore, for traders to gain a better confirmation of a bullish reversal, the price should surpass the October 13th high of $1573. Under the influence of this range pattern formation, this bullish reversal should surge the prices 12.4% higher to rechallenge the $1745 mark.\n\nWill ETH Price Break Below $1500 Mark\n\nWhile the ETH price struggle to bounce back from the $1,530 mark suggests tepid bullish sentiment, a further slip below this support could find immediate support around the $1,500 level, which aligns with a longstanding trendline. This trendline forms the lower boundary of a rising channel pattern that has historically guided this altcoin’s recovery phases for nearly 500 days. Should market participants continue to respect this pattern, the Ethereum coin could find a footing at $1,500, aiming for a more ambitious target above the last significant swing high of $2,138.\n\nRelative Strength Index: Despite the sideways action, the daily RSI slope rising with a pair for new higher highs and lows reflects the buyers. Attempt to regain higher ground.\n\nPivot levels: the traditional pivot level accentuates the $1573 as significant resistance followed by $1630 and $1732."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtaW5mbGF0aW9uLWxvc2luZy10by1iaXRjb2lucy1idGPSAUFodHRwczovL3UudG9kYXkvZXRoZXJldW0tZXRoLWluZmxhdGlvbi1sb3NpbmctdG8tYml0Y29pbnMtYnRjP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 15 Oct 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Inflation Losing to Bitcoin's (BTC) - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe recent behavior of Ethereum (ETH) on the market and its deflation have gathered the attention of many crypto traders and investors. Since December 2022, the supply of Ether has been on an upward trajectory. Several factors have contributed to this inflationary trend in Ethereum. Notably, the decreased transaction fees, paired with an increased daily issuance, have accelerated the rise in ETH's supply.\n\nAdvertisement\n\nThe provided graphical representation highlights Ethereum's deflationary trend, juxtaposed with its network activity. An analysis of this chart brings forth some striking revelations. The burn rate is currently at 402K ETH per year, indicating that while transactions are ongoing and fees are being paid, a significant portion of Ether is being destroyed or \"burned\" but it is still not enough.\n\nOn the other hand, the supply growth shows an increase of 0.36% over a 30-day time frame. Moreover, the issuance sits at 834K ETH per year, which underscores the increasing creation of new Ether in the ecosystem.\n\nHowever, even with these factors pushing Ethereum toward an inflationary stance, it is crucial to note that the net issuance for Ethereum stands at a mere 0.44% annually. When juxtaposed with Bitcoin's inflation rate, Ethereum's figure is still considerably lower.\n\nFrom a pricing perspective, Ethereum has recently faced some challenges. The cryptocurrency has seen a retreat below the $1,600 mark, sparking concerns among investors and traders. With the current trajectory, Ethereum's price is inching closer to the critical $1,400 support level, which historically played a pivotal role in March as a point of trend reversal.\n\nFor now, Ethereum's price movement indicates downward pressure. While it is showing some resilience around the $1,575 zone, the continuous testing of this support suggests a potential breakdown. If ETH fails to maintain this stance, the road toward the $1,400 mark might be its next destination."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vZmluYm9sZC5jb20vY2FuLWV0aGVyZXVtLWV0aC1wcmljZS1yZWJvdW5kLW5leHQtd2Vlay_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 15 Oct 2023 07:00:00 GMT",
        "title": "Can Ethereum (ETH) price rebound next week? - Finbold - Finance in Bold",
        "content": "Ethereum’s (ETH) value has experienced another decline this week, dropping to $1,557. This represents a 5% decline over the course of a week that has generally seen negative trends in the cryptocurrency market.\n\nETH last 7 days performance. Source: Finbold.com\n\nThe loss of momentum extends further, as Ethereum’s price has fallen by 8% in the last two weeks and 2% over the past 30 days. However, it’s important to note that despite recent setbacks, the market’s top altcoin has still managed to maintain a year-to-date increase of 29.6%.\n\nEthereum’s situation remains somewhat mixed, but recent overselling may position the asset for a potential rebound in the coming weeks, particularly when considering the fundamental strength of the Ethereum network, and the potential inflow of investors.\n\nIs the bearish trend set to continue?\n\nEthereum’s price has been on a downward trajectory for a couple of months, showing significant weakness in its indicators since mid-August, coinciding with a broader market downturn.\n\nThe relative strength index (RSI) for ETH, represented by the purple line, has dropped from nearly 70 at the beginning of the month to 35 today. Although there has been a slight uptick in the past few hours, it remains weak, indicating that the token is currently oversold.\n\nA similar situation can be observed with ETH’s 30-day exponential moving average (EMA) in yellow, which continues to slide further below its 200-day average (blue). This emphasizes the presence of substantial selling pressure.\n\nOne of the most discouraging signals at present is the decline in the token’s support level, denoted by the green line, over the past few days. This suggests that ETH may struggle to resist further declines in the coming days.\n\nETH last 2 months performance. Source: TradingView\n\nHowever, despite the potential for minor drops in the very near future, the fact that ETH has been heavily sold recently makes it likely that traders will eventually seize the opportunity to purchase the token at an attractive discount.\n\nIn fact, ETH is currently undervalued relative to its underlying fundamentals, making it a favorable time to invest in the cryptocurrency, which is expected to make a full recovery, particularly given its dominant position in the crypto ecosystem.\n\nEthereum maintains a significant share of the Total Value Locked (TVL) in the industry, with its network and major layer-twos like Optimism (OP), Polygon (Matic), Arbitrum (ARB), and Base accounting for approximately 63% of the sector’s total TVL.\n\nEthereum also continues to evolve and expand, as evidenced by the upcoming launch of the Holesky testnet, a development that will contribute to Ethereum’s progress toward the eventual implementation of Proto-Danksharding, which promises significant improvements in scalability.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vYmVzdC10aW1lLXRvLWJ1eS1ldGhlcmV1bS1jb3VsZC1iZS1zb29uLWxhc3QtY3ljbGUtc3VnZ2VzdHMv0gFmaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy9ldGhlcmV1bS9iZXN0LXRpbWUtdG8tYnV5LWV0aGVyZXVtLWNvdWxkLWJlLXNvb24tbGFzdC1jeWNsZS1zdWdnZXN0cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 15 Oct 2023 07:00:00 GMT",
        "title": "Best Time to Buy Ethereum Could Be Soon: Last Cycle Suggests - NewsBTC",
        "content": "Ethereum has been in a descending channel against Bitcoin since August of last year, meaning Bitcoin has been the better investment over this time. However, historical trends show the tides could be changing soon, with Ethereum possibly on the brink of entering an accumulation phase.\n\nEthereum Price Action\n\nEthereum is trading at $1600, marking a 22% decrease from its price last August. Bitcoin, on the other hand, is 8% up over the same period.\n\nThis is a common trend that happens during bear markets. Coins with larger market capitalizations tend to be more resilient against price decreases as investors become more risk-averse and look to preserve their capital. While Ethereum isn’t short at a market capitalization of $187 billion, it’s still considerably lower than Bitcoin at $525 billion.\n\nDuring bull markets, coins with lower market capitalization outperform Bitcoin again as investors lean towards assets with greater potential returns.\n\nEthereum Price Compared Against Bitcoin\n\nWhen comparing ETH’s value to BTC, it’s evident that Ethereum has been trading within a descending channel since last August. This pattern, characterized by its lower highs and lower lows, often indicates a bearish trend in the market.\n\nETH's valuation against BTC over time. Source: ETHBTC on TradingView\n\nThe chart above highlights three other distinct phases:\n\nAccumulation phase: During this phase, price tends to stabilize, hinting at an upcoming change in momentum\n\nAscending channel: Here, the price experiences a significant reversal, often on a parabolic trajectory, characterized by highs and higher lows.\n\nDistribution phase: In the final phase, the price ceases its upward movement. Investors typically use this phase to capitalize on their gains and liquidate their positions.\n\nThe accumulation phase is typically the best time for investors to convert their Bitcoin into Ethereum. This phase is marked by price holding on at the bottom and then showing signs of reversal. Ethereum is still forming lower lows against Bitcoin, so it has not entered the accumulation phase yet. However, the last cycle shows that this could be changing soon.\n\nLast Cycle\n\nReflecting on the last cycle, Ethereum was in a descending channel against Bitcoin for 17 months. The accumulation phase then occurred from September 2019 up until February 2020. Based on the four-year theory, which suggests similar phases in the market occur every four years, this shows that the accumulation phase should also be approaching very soon in this cycle.\n\nYet, while the last cycle offers valuable insights, it’s important to note that no two cycles are the same. In the current cycle, ETH’s price action has not seen as much of a drop as in the previous cycle, which could be attributed to changing fundamentals and asset maturation.\n\nFinal thoughts\n\nWhile an accumulation phase for Ethereum has not been confirmed yet, there remains the potential for its price to drop even further relative to Bitcoin. However, if the previous cycle is anything to go by, we could enter the accumulation phase soon. This phase typically presents prime buying opportunities for Ethereum.\n\nInvestment Disclaimer: The content provided in this article is for informational and educational purposes only. It should not be considered investment advice. Please consult a financial advisor before making any investment decisions. Trading and investing involve substantial financial risk. Past performance is not indicative of future results. No content on this site is a recommendation or solicitation to buy or sell securities or cryptocurrencies.\n\nFeatured image from ShutterStock, Charts from TradingView.com\n\nPredycto is the author of a cryptocurrency newsletter . Sign up for free . Follow @Predycto on Twitter.\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    }
]