[
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jb2luYmFzZS12ZW50dXJlcy1pbnZlc3RzLWV0aGVyZXVtLWxpcXVpZC0wMzU1NTY3NTEuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 10 Aug 2023 07:00:00 GMT",
        "title": "Coinbase Ventures Invests in Ethereum Liquid Staking Protocol Rocket Pool - Yahoo Finance",
        "content": "Coinbase Ventures Invests in Ethereum Liquid Staking Protocol Rocket Pool\n\nCoinbase has acquired an undisclosed amount of RPL\n\nRocket Pool, a liquid staking protocol, has received a strategic investment from Coinbase Ventures, the investment arm of cryptocurrency exchange Coinbase.\n\nRocket Pool's innovative approach allows users to support new validators and receive rewards even if their holdings are less than the minimal amount needed to independently fund a validator node on the Ethereum network.\n\nAn undisclosed sum of RPL, the protocol's native token, was purchased by Coinbase as part of its investment in Rocket Pool. In order to promote decentralization, Rocket Pool has a network of over 3,100 node operators and over 780,000 ETH staked for liquid staking on Ethereum.\n\nFollowing the news, the RPL token increased by over 6.9% to $28.78. RPL is up 0.10% over the past 24 hours, according to CoinMarketCap data.\n\nCoinbase is involved with Rocket Pool's Oracle DAO in addition to providing funding, and it uses ETH taken from its corporate balance sheet to run a sizable number of nodes on the Rocket Pool network.\n\nThe decision fits in with Coinbase's broader initiatives to secure and decentralize the expansion of Ethereum's infrastructure in order to bring more users on to the blockchain."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jb2luYmFzZS12ZW50dXJlcy1pbnZlc3RzLWV0aGVyZXVtLWxpcXVpZC0wMzU1NTY3NTEuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 10 Aug 2023 07:00:00 GMT",
        "title": "Coinbase Ventures Invests in Ethereum Liquid Staking Protocol Rocket Pool - Yahoo Finance",
        "content": "Coinbase Ventures Invests in Ethereum Liquid Staking Protocol Rocket Pool\n\nCoinbase has acquired an undisclosed amount of RPL\n\nRocket Pool, a liquid staking protocol, has received a strategic investment from Coinbase Ventures, the investment arm of cryptocurrency exchange Coinbase.\n\nRocket Pool's innovative approach allows users to support new validators and receive rewards even if their holdings are less than the minimal amount needed to independently fund a validator node on the Ethereum network.\n\nAn undisclosed sum of RPL, the protocol's native token, was purchased by Coinbase as part of its investment in Rocket Pool. In order to promote decentralization, Rocket Pool has a network of over 3,100 node operators and over 780,000 ETH staked for liquid staking on Ethereum.\n\nFollowing the news, the RPL token increased by over 6.9% to $28.78. RPL is up 0.10% over the past 24 hours, according to CoinMarketCap data.\n\nCoinbase is involved with Rocket Pool's Oracle DAO in addition to providing funding, and it uses ETH taken from its corporate balance sheet to run a sizable number of nodes on the Rocket Pool network.\n\nThe decision fits in with Coinbase's broader initiatives to secure and decentralize the expansion of Ethereum's infrastructure in order to bring more users on to the blockchain."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2NvaW5iYXNlcy1ldGhlcmV1bS1sYXllci0yLWNoYWluLWJhc2UtaXMtbGl2ZS10by10aGUtcHVibGljL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 10 Aug 2023 07:00:00 GMT",
        "title": "Coinbase's Ethereum layer-2 chain Base is live to the public - CryptoSlate",
        "content": "Coinbase, a leading U.S. crypto exchange, officially launched Base, its Ethereum layer 2 network, to the general public on August 9, 2023.\n\nThe Base testnet launched in February, followed by a developer-specific release in July. Built on Optimism’s software stack known as the OP Stack, Base operates as a rollup network, a scaling solution that processes transactions off the main Ethereum (ETH) blockchain, providing a more efficient and affordable network for decentralized applications (dApps).\n\nBetting on Base\n\nSince its inception, Base has integrated with a wide array of crypto projects, including DeFi protocols, wallets, bridges, oracles, analytics, and infrastructure providers.\n\nUnlike other layer-2 networks like Arbitrum and Optimism, Coinbase has confirmed that it has no plans to introduce any native tokens to Base. Pollak insisted that tokens “distort” what is being done on a network, something Coinbase would rather avoid in favor of focusing on incubating developers.\n\nThe launch of Base aligns with Coinbase CEO Brian Armstrong’s vision for the fourth phase of the company’s development, aimed at mass adoption through decentralized apps. The new network is anticipated to become the default network for Coinbase’s on-chain products.\n\nIn connection with the Base launch, Coinbase announced plans for corporate partnerships, including with Coca-Cola, to showcase the new project’s capabilities, and it emphasizes integration into daily life rather than mere speculation.\n\nThe launch of Base represents a significant step forward in the evolution of blockchain technology, opening new opportunities for developers, users, and the broader crypto ecosystem."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vbmV3LW1pbGVzdG9uZS1mb3ItZXRoZXJldW0v0gFFaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy9ldGhlcmV1bS9uZXctbWlsZXN0b25lLWZvci1ldGhlcmV1bS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 10 Aug 2023 07:00:00 GMT",
        "title": "New Milestone For Ethereum Could Spell Good News For ETH Price - NewsBTC",
        "content": "The number of Ethereum non-zero addresses, meaning addresses that hold at least some amount of Ether, just reached an all-time high. According to data from Glassnode, this metric which counts only externally owned addresses just reached an all-time high of 104,127,318. But what does this mean for the price of Ethereum?\n\nEthereum Non-Zero Addresses Reach New All-Time High\n\nMore addresses mean more people are using the network and Ethereum is in the driver’s seat when it comes to most application aspects of the crypto industry. As a result, the Ethereum blockchain has seen the highest growth rate in new addresses in recent years.\n\nThis growth has been particularly high as more people flock to decentralized finance (DeFi) protocols and non-fungible tokens (NFTs), the majority of which are built on the Ethereum blockchain.\n\nAs of the time of writing, there are now 104,127,318 Ethereum addresses holding at least one wei, the smallest unit of ETH. Just around two years ago in 2021, this metric was around 50 million addresses, showing a 100% jump during this time.\n\nAlthough only a fraction of these wallets are active, the high number of non-zero addresses shows the sheer increase in ETH adoption. In the same vein, the number of non-zero Bitcoin addresses only recently reached an all-time high of 47.8 million addresses.\n\nMore Addresses Means Increased Network Activity and Adoption\n\nThe growing interest in trading, smart contracts, DeFi, and NFTs will continue to boost the number of Ethereum users and non-zero addresses, especially now that the industry sits on the cusp of a possible bull run.\n\nETH bulls continue to hold above $1,800 | Source: ETHUSD on Tradingview.com\n\nAccording to a similar metric by Glassnode Alerts, the amount of Ethereum supply last active within a seven to 10-year timeframe also just reached n new all-time high of 4.312 million ETH. This extended state of inactivity is suggestive of HODLing and long-term faith on the part of investors.\n\nBullish For The Price Of ETH\n\nIn the past, major rallies in Ether’s price have coincided with a surge in new addresses on the network. During the 2021 bull run, Ethereum saw a flurry of new addresses and non-zero addresses, as its price reached an all-time high of $4,810.\n\nAs mainstream interest and adoption of Ethereum grow, the value and price of Ether (ETH) are likely to increase. Non-zero addresses mean activity on many addresses is increasing, which can create buy pressure in addition to other factors that should push ETH’s price higher.\n\nAdditionally, investment companies are looking to launch exchange-traded funds (ETFs) tied to Ethereum futures, which could propel a spike in ETH’s price.\n\nRight now, ETH is currently trading at $1,852 and is looking to break above the resistance being mounted at $2,000 by the bears.\n\nFeatured image from iStock, chart from Tradingview.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy8zLXJlYXNvbnMtd2h5LWV0aGVyZXVtLXByaWNlLWlzLXN0aWxsLXBpbm5lZC1iZWxvdy0xOTAw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 10 Aug 2023 07:00:00 GMT",
        "title": "3 reasons why Ether price is still pinned below $1,900 - Cointelegraph",
        "content": "Ether's price has been locked within a tight trading range spanning from $1,800 to $1,900 since July 21. This remarkable lack of volatility has instilled a sense of uncertainty and skepticism among investors, despite recent positive developments, which include the launch of PayPal’s Ethereum-based stablecoin and a surge in requests for Ether-based exchange-traded funds (ETFs).\n\nPayPal’s entrance into the world of cryptocurrencies could signify a major step toward mainstream adoption for Ethereum. However, this move also raises concerns about centralization and the potential loss of control over personal assets.\n\nAt the same time, the United States Securities and Exchange Commission has recently witnessed a surge in applications for Ether (ETH) ETFs, which mirrors a trend of major asset management firms seeking to establish spot Bitcoin (BTC) ETFs.\n\nETH’s drop in DApp deposits and active users is concerning\n\nThe Ethereum network is having problems because of high gas fees, which are the costs for transactions, including those done with smart contracts. For the past two months, the average transaction fee has been more than $4, which limited the demand for its decentralized apps (DApps).\n\nEthereum network applications' total deposits in ETH. Source: DefiLlama\n\nThere has been a noticeable decline in the total value locked (TVL) of deposits on the Ethereum network. This decrease marked the lowest TVL level observed over the past three years, as reported by DefiLlama.\n\nWhile there may have been some shifts in this trend over the past week, the current scenario still reflects a substantial reduction in Ether deposits, specifically around 12.9 million, in contrast to the 14.75 million recorded three months ago.\n\nTo ascertain whether the decline in Ethereum’s TVL correlates with a decline in its user base, investors should monitor the utilization of DApps. It’s important to note that certain DApps, such as gaming platforms and marketplaces, do not require substantial deposits.\n\nEthereum's 30-day DApp activity. Source: DappRadar\n\nThe number of active addresses using DApps is down, which is concerning. In the last 30 days, the main DApps on Ethereum had 25% fewer active users. This might reflect that investors aren’t satisfied with how much it costs to transact on the network.\n\nExamining Ether derivatives can help to figure out whether the $1,800 level could actually prove a reliable support level based on how ETH investors are positioned.\n\nDerivatives metrics show balanced demand between bulls and bears\n\nEther quarterly futures are popular among whales and arbitrage desks. However, these fixed-month contracts typically trade at a slight premium to spot markets, indicating that sellers are asking for more money to delay settlement. As a result, ETH futures contracts in healthy markets should trade at a 5 to 10% annualized premium — a situation known as contango, which is not unique to crypto markets.\n\nEther 3-month futures annualized premium. Source: Laevitas\n\nAs per the futures premium, also referred to as the basis indicator, professional traders in the Ether market have remained unable to adopt a bullish stance since July 16. The current level of 5% hovers on the brink of a neutral-to-bearish threshold, indicating a state of equilibrium in demand between leveraged long and short positions.\n\nRelated: NFT project y00ts to return $3M grant as it ditches Polygon for Ethereum\n\nThe unveiling of Coinbase's Base network on Aug. 9 could contribute to Ether’s challenge of surpassing the $1,900 mark. Several development teams within the ecosystem have announced their offerings for the Base network, which presently incorporates a version of the decentralized exchange Uniswap.\n\nWhile Ether’s bullish prospects are fueled by the potential approval of an ETF and the substantial user base facilitated by PayPal’s stablecoin, the network finds itself confronted by competition from existing smart contract platforms and challengers with ample resources. Such a scenario introduces an element of uncertainty surrounding the resilience of the $1,800 support level.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    }
]