[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjY5Nzk5L3ZpdGFsaWstYnV0ZXJpbi1zaGFyZXMtdXBkYXRlZC0yMDI0LXJvYWRtYXAtZm9yLWV0aGVyZXVt0gFgaHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjY5Nzk5L3ZpdGFsaWstYnV0ZXJpbi1zaGFyZXMtdXBkYXRlZC0yMDI0LXJvYWRtYXAtZm9yLWV0aGVyZXVt?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 30 Dec 2023 08:00:00 GMT",
        "title": "Vitalik Buterin shares updated 2024 roadmap for Ethereum - The Block",
        "content": "Ethereum ETH +1.73% co-founder Vitalik Buterin has shared an updated 2024 roadmap for the blockchain, outlining the core priorities for the ecosystem moving forward.\n\nThese priorities include the Merge (a robust proof-of-stake consensus), the Surge (a goal of 100,000 transactions per second across Ethereum and its Layer 2 networks), the Scourge (mitigating risks around MEV and liquid pooling), the Verge (easier block verification), the Purge (simplifying the protocol), and the Splurge (everything else).\n\nVitalik, in his thread on X, endorsed single-slot finality (SSF) as \"the easiest path to resolving a lot of the Ethereum [Proof of Stake] design's current weaknesses\" and praised the progress made on L2 networks and with Verkle tree implementations.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nVitalik also described how the Scourge priority has been re-oriented around fighting economic centralization in Ethereum in two key \"theatres:\" MEV and liquid stake pooling. The growth of Ethereum staking service Lido has raised concerns around economic centralization in Ethereum since the blockchain's transition to a proof-of-stake consensus.\n\nAside from other small changes, the core priorities of the Ethereum ecosystem remain the same from last year's outline. Vitalik declined to estimate a timeline for the changes to the ecosystem, though the changes are ordered roughly according to priority."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vY29pbnBlZGlhLm9yZy9wcmljZS1hbmFseXNpcy9ldGhlcmV1bS1zbGlkZXMtZG93bi1iZWxvdy0yMzAwLWhhcy10aGUtZXRoLXByaWNlLXJldmVyc2VkLXRoZS10cmVuZC_SAW5odHRwczovL2NvaW5wZWRpYS5vcmcvcHJpY2UtYW5hbHlzaXMvZXRoZXJldW0tc2xpZGVzLWRvd24tYmVsb3ctMjMwMC1oYXMtdGhlLWV0aC1wcmljZS1yZXZlcnNlZC10aGUtdHJlbmQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 30 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Slides Down Below $2,300: Has the ETH Price Reversed the Trend? - Coinpedia Fintech News",
        "content": "A passionate cryptocurrency and blockchain author qualified to cover every event in the crypto space. Researching minute occurrences and bringing new insights lie within the prime focus of my task.\n\nThe Ethereum price was on its way to reach the upper resistance above $2500, but the bears held back just below $2400. After making repetitive attempts to rise above the ascending trend line, the ETH price formed a clear bearish pattern. This may not be in favour of the bulls, as the selling pressure has accumulated to a large extent at the moment.\n\nThe second-largest crypto has a string of reversal indications that forecast a bearish price action. Despite the prevailing bearish claws, the ETH price appears to be preparing itself well for a bullish monthly close, and hence begins the fresh yearly trade above $2300 to $2350. However, the current trade setup suggests a bullish reversal may be on the horizon.\n\nEver since the price flipped from the lower support during October, the rally has maintained an ascending trend to mark the highs around $2,446. Despite this, the token failed to rise above the trend line that could have lifted the levels to close to $2,500. However, the fresh price action, which is the continuation of the previous bearish trend, suggests a rebound could be imminent.\n\nBesides, the DMI is going bearish as the ADX has plunged and the other signal lines are about to undergo a bearish cross-over. Therefore, the Ethereum (ETH) price may print another couple of bearish candles to test the lower support at around $2,179, which may trigger a healthy rebound. However, the bullish strength could be a major concern, as the price may begin with a fresh upswing only if it makes its way above the ascending trend line that has been a major resistance level."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vdS50b2RheS9ob3ctZXRoZXJldW0td2hhbGUtcmlza3MtbGlxdWlkYXRpb24tYWZ0ZXItYnV5aW5nLTI1Njc0LWV0aC1kZXRhaWxz0gFXaHR0cHM6Ly91LnRvZGF5L2hvdy1ldGhlcmV1bS13aGFsZS1yaXNrcy1saXF1aWRhdGlvbi1hZnRlci1idXlpbmctMjU2NzQtZXRoLWRldGFpbHM_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 30 Dec 2023 08:00:00 GMT",
        "title": "How Ethereum Whale Risks Liquidation After Buying 25,674 ETH: Details - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAccording to Lookonchain, an Ethereum whale has recently made a huge purchase of 25,674 ETH; however, this action could backfire if the price of ETH falls below a specific threshold, triggering a liquidation event.\n\nAdvertisement\n\nFrom all indications, it appears that the whale obtained the said ETH from MakerDAO. This decentralized lending platform allows users to mint stablecoins (DAI) by locking up their crypto assets as collateral.\n\nWhen the price of $ETH drops to $2,257, the smart money will be in danger of liquidation.\n\n\n\nThe healthy ratio on #Maker is as low as 1.03.\n\n\n\nThe smart money once again spent 61M $DAI to buy 25,674 $ETH, and then sold 5,851 $ETH for 14M $DAI, making ~$99K.https://t.co/yGkFI6qpnj pic.twitter.com/VRmstUCngE — Lookonchain (@lookonchain) December 29, 2023\n\nLookonchain reports that the whale had spent 61 million DAI to buy 25,674 ETH; however, the whale shortly after sold 5,851 ETH out of this stash for a value of 14 million DAI, of which they made a profit of $99,000.\n\nAlthough the whale had made some profits from this strategy, they also faced the risk of liquidation. If the ETH price goes below a certain level, the whale's collateral will be insufficient to cover their debt, and MakerDAO will automatically liquidate the ETH to reclaim the DAI.\n\nAccording to Lookonchain, if the price of ETH drops to $2,257, the said large ETH holder might be in danger of liquidation. This is because the healthy ratio on MakerDAO is presently as low as 1.03.\n\nThe Ethereum price is nearing this threshold, having fallen 3.56% in the last 24 hours to trade at $2,280, according to CoinMarketCap data. Since reaching a high of $2,448 on Dec. 28, the price of Ethereum has steadily dropped.\n\nIf today closes in red, ETH might be set to mark its third consecutive day of losses. The ETH price fell to intraday lows of $2,255 on Dec. 29, but at present, it has held up above the lows of $2,267 marked in today's trading session.\n\nWherever ETH price trends, the whale's fate is now related to the performance of ETH and the crypto market as a whole, which is currently declining as investors book profits through the end of 2023."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iZWhpbmQtc29sYW5hLXJlY2VudC1zdXJnZS0xMjEzMzA3NjUuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 30 Dec 2023 08:00:00 GMT",
        "title": "What's Behind Solana's Recent Surge - Yahoo Finance",
        "content": "What’s Behind Solana’s Recent Surge\n\nSolana Flipped Ethereum in Google Search Interest\n\nGoogle searches for the term \"Solana\" surpassed \"Ethereum\" for the first time in 2023, indicating growing interest in the Solana ecosystem.\n\nFrom December 17 to 23, Solana's search interest score reached 56, while Ethereum's was 50. Google Trends data suggests that Solana's search interest is set to peak during the week of December 24 to 30, with a score of 100.\n\nUsers searching for Solana also showed interest in terms like \"bonk\" and \"tensor.\" Bonk (BONK) is the leading Solana memecoin that reached a peak market cap of $1.9 billion after being listed on Binance and Coinbase, while Tensor is the leading NFT marketplace on Solana, after surpassing Magic Eden in trading volume.\n\nSolana’s DEX Volumes and NFT Sales Surpassed Ethereum’s\n\nOn December 23, Solana surpassed Ethereum in weekly decentralized exchange (DEX) volume and non-fungible token (NFT) sales.\n\nDEX volume on Solana surged to over $10 billion, surpassing Ethereum's $8.8 billion for that week. Meanwhile, Solana also processed $109 million in NFT sales in that week, eclipsing Ethereum by $30 million.\n\nAt the time of writing, Ethereum is leading in terms of DEX volumes, with $10.12 billion compared to Solana’s $8.71 billion. However, Solana’s NFT sales volume is still ahead of Ethereum’s, although Bitcoin is leading due to the recent Ordinals frenzy.\n\nThe current frenzy on Solana is partly driven by memecoins, particularly BONK, which has skyrocketed by 300% in December and has a market cap of over $1 billion. Another Solana-based memecoin, Dogwifhat, has also gained 428% in the past week.\n\nSolana Flipped BNB in Market Cap Momentarily\n\nOn December 22, Solana surged by 18% to overtake BNB (BNB), propelling it to 4th place in terms of market capitalization. SOL traded at a market cap of $41.9 billion, surpassing BNB, which had a market cap of $41.8 billion.\n\nThis surge came after SOL overtook XRP in market cap on December 21. However, BNB has since regained its position after gaining over 17% in the past week. BNB is currently trading at a market cap of $47.8 million, compared to SOL’s market cap of $43.7 million.\n\nStory continues\n\nSOL gained over 71% in the past month, outperforming many large-cap cryptocurrencies such as ETH, which has only gained 12.4%.\n\nWhat’s the Reason Behind Solana’s Recent Rally?\n\nSolana's recent price surge can be attributed to several factors, including:\n\nIncreased User Activity\n\nActive addresses on Solana have increased by nearly 400% in the last three months, surpassing Ethereum’s in mid-November. This suggests an exceptional increase in retail activity, with crypto users likely migrating to Solana for its lower transaction costs, increased speculative activity, airdrop farming and more.\n\nAirdrops and Memecoins Caused Surge in DEX Volume\n\nRecent airdrops on Solana, particularly the Jito (JTO) airdrop worth five figures, have resulted in more users flocking to other Solana-based protocols in hopes of securing a future airdrop. Furthermore, memecoins trading craze, led by the Bonk memecoin, have boosted speculative user activity, causing the DEX volume on Solana to surpass Ethereum’s for a week. Other memecoins on Solana, like Dogwifhat (WIF) and Silly Dragon (SILLY), also saw millions in daily volume on-chain, contributing to the rise in DEX volumes.\n\nInstitutional Capital Flows Into Solana\n\nSource: CoinShares\n\nSolana-based investment funds attracted $156 million in institutional inflows as of December 16, making it the crypto asset with the highest inflows behind only Bitcoin, suggesting robust institutional interest in Solana."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iZWhpbmQtc29sYW5hLXJlY2VudC1zdXJnZS0xMjEzMzA3NjUuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 30 Dec 2023 08:00:00 GMT",
        "title": "What's Behind Solana's Recent Surge - Yahoo Finance",
        "content": "What’s Behind Solana’s Recent Surge\n\nSolana Flipped Ethereum in Google Search Interest\n\nGoogle searches for the term \"Solana\" surpassed \"Ethereum\" for the first time in 2023, indicating growing interest in the Solana ecosystem.\n\nFrom December 17 to 23, Solana's search interest score reached 56, while Ethereum's was 50. Google Trends data suggests that Solana's search interest is set to peak during the week of December 24 to 30, with a score of 100.\n\nUsers searching for Solana also showed interest in terms like \"bonk\" and \"tensor.\" Bonk (BONK) is the leading Solana memecoin that reached a peak market cap of $1.9 billion after being listed on Binance and Coinbase, while Tensor is the leading NFT marketplace on Solana, after surpassing Magic Eden in trading volume.\n\nSolana’s DEX Volumes and NFT Sales Surpassed Ethereum’s\n\nOn December 23, Solana surpassed Ethereum in weekly decentralized exchange (DEX) volume and non-fungible token (NFT) sales.\n\nDEX volume on Solana surged to over $10 billion, surpassing Ethereum's $8.8 billion for that week. Meanwhile, Solana also processed $109 million in NFT sales in that week, eclipsing Ethereum by $30 million.\n\nAt the time of writing, Ethereum is leading in terms of DEX volumes, with $10.12 billion compared to Solana’s $8.71 billion. However, Solana’s NFT sales volume is still ahead of Ethereum’s, although Bitcoin is leading due to the recent Ordinals frenzy.\n\nThe current frenzy on Solana is partly driven by memecoins, particularly BONK, which has skyrocketed by 300% in December and has a market cap of over $1 billion. Another Solana-based memecoin, Dogwifhat, has also gained 428% in the past week.\n\nSolana Flipped BNB in Market Cap Momentarily\n\nOn December 22, Solana surged by 18% to overtake BNB (BNB), propelling it to 4th place in terms of market capitalization. SOL traded at a market cap of $41.9 billion, surpassing BNB, which had a market cap of $41.8 billion.\n\nThis surge came after SOL overtook XRP in market cap on December 21. However, BNB has since regained its position after gaining over 17% in the past week. BNB is currently trading at a market cap of $47.8 million, compared to SOL’s market cap of $43.7 million.\n\nStory continues\n\nSOL gained over 71% in the past month, outperforming many large-cap cryptocurrencies such as ETH, which has only gained 12.4%.\n\nWhat’s the Reason Behind Solana’s Recent Rally?\n\nSolana's recent price surge can be attributed to several factors, including:\n\nIncreased User Activity\n\nActive addresses on Solana have increased by nearly 400% in the last three months, surpassing Ethereum’s in mid-November. This suggests an exceptional increase in retail activity, with crypto users likely migrating to Solana for its lower transaction costs, increased speculative activity, airdrop farming and more.\n\nAirdrops and Memecoins Caused Surge in DEX Volume\n\nRecent airdrops on Solana, particularly the Jito (JTO) airdrop worth five figures, have resulted in more users flocking to other Solana-based protocols in hopes of securing a future airdrop. Furthermore, memecoins trading craze, led by the Bonk memecoin, have boosted speculative user activity, causing the DEX volume on Solana to surpass Ethereum’s for a week. Other memecoins on Solana, like Dogwifhat (WIF) and Silly Dragon (SILLY), also saw millions in daily volume on-chain, contributing to the rise in DEX volumes.\n\nInstitutional Capital Flows Into Solana\n\nSource: CoinShares\n\nSolana-based investment funds attracted $156 million in institutional inflows as of December 16, making it the crypto asset with the highest inflows behind only Bitcoin, suggesting robust institutional interest in Solana."
    }
]