[
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ldGhlcmV1bS1sc2QtdG9rZW5zLXJpc2UtYWhlYWQtMDk0OTUzODE4Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Ethereum, LSD Tokens on the Rise Ahead of Next Week's Shanghai Upgrade - Yahoo Finance",
        "content": "The price of Ethereum jumped 4.7% overnight, per CoinGecko data, as the second-largest cryptocurrency approaches its much-anticipated Shapella upgrade on April 12.\n\nShapella is the joined term for two key improvements coming to the Ethereum network: Shanghai and Capella. These refer to unlocking withdrawals for staked Ethereum on the network at the execution layer and on the consensus layer, respectively.\n\nNotably, Ethereum’s price action has also outpaced Bitcoin's increase of 1.3% during the same period.\n\nNext week’s upgrade will enable ETH withdrawals from the staking contract, lowering the risk of holding staked Ethereum (stETH), also known as liquid staking derivatives (LSDs) via platforms like Lido Finance.\n\nAs such, governance tokens linked to various liquid staking platforms have also enjoyed a hefty rise in price. These platforms emerged to let Ethereum holders stake their ETH and earn a liquid staking token in return. This token could then be reused throughout the world of DeFi to earn additional yield.\n\nThe governance tokens of top liquid staking platforms in Lido DAO (LDO), Rocket Pool (RPL), and Frax Shares (FXS) enjoyed double-digit percentage gains in the last 24 hours.\n\nOverall, these LSD tokens have yielded higher percentage gains, at least twice that of ETH in 2023. The top LSD tokens have recorded up to 150% compared to Ethereum's near 65% gains year-to-date.\n\nETH (blue), FXS (yellow), LDO (orange), RPL (blue) price comparison. Source: TradingView.\n\nCurrently, decentralized liquid staking platforms account for 33.3% of the total staked ETH. Lido DAO is a clear leader within this space, with a 93.79% share.\n\nShapella is the most important Ethereum upgrade since the network’s merge event last September when the protocol moved from a proof-of-work (PoW) consensus mechanism to a proof-of-stake (PoS) mechanism.\n\nThe views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zd2lzcy1iYW5rLXBvc3RmaW5hbmNlLXJvbGwtYml0Y29pbi0xMDM0NDQ0OTIuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Swiss Bank PostFinance to Roll Out Bitcoin, Ethereum Services for Clients - Yahoo Finance",
        "content": "PostFinance, the financial services firm fully owned by the Swiss government, will offer its customers a range of regulated crypto services delivered through Sygnum's B2B banking platform.\n\nThanks to the partnership with digital assets bank Sygnum, its customers will now be able to buy, store, and sell cryptocurrencies such as Bitcoin (BTC) and Ethereum (ETH), according to an announcement. PostFinance is Switzerland’s fifth-largest financial services firm boasting more than 2.5 million customers.\n\n\"This partnership illustrates how digital assets are now an integral part of the financial landscape in Switzerland. In this sense, the PostFinance and Sygnum partnership represents an important, and fully regulated step, towards increased asset class adoption,\" Sygnum's chief B2B officer Fritz Jost told Decrypt. \"Switzerland as an investment ecosystem offers a number of strategic advantages, including regulatory clarity for cryptocurrencies and off-balance sheet segregation of crypto assets which eliminates credit risks.\"\n\nA PostFinance spokesperson told Decrypt that its \"analyses show that our customers want access to the crypto market. The past few months have shown that customers want more security, regulation, and trust. We can offer this. Our top priority is to offer trading and safekeeping within a secure framework for our customers and to ensure the highest level of regulatory compliance.\"\n\n📰📣 NEWS: @PostFinance partners with Sygnum, the world’s first digital asset bank, to offer its customers regulated digital asset banking services via Sygnum's B2B banking platform. Read the announcement here 👇 https://t.co/zuWRP3lXIS — Sygnum Bank (@sygnumofficial) April 5, 2023\n\nSygnum's B2B banking solution lets existing financial institutions crypto products and services, with PostFinance joining more than a dozen of the platform’s other banking partners.\n\nStory continues\n\n“Digital assets have become an integral part of the financial world, and our customers want access to this market at PostFinance, their trusted principal bank,” PostFinance's CIO Chief Investment Philipp Merkt said in a statement. “A reputable and established partner like Sygnum Bank with an excellent service offering is more important than ever.”\n\nHow Switzerland's Role in Global Finance Is Evolving With The Crypto Era\n\nPostFinance did not respond immediately to Decrypt's request for comment.\n\nInstitutional-grade staking services\n\nThe new partnership also enables PostFinance to provide revenue-generating services such as crypto staking—a process of locking crypto assets for a set period of time to help secure a blockchain network in exchange for rewards on users’ holdings.\n\nSygnum’s staking offerings include Ethereum, the industry’s second-largest cryptocurrency by market capitalization, Cardano (ADA), Internet Computer (ICP), and Tezos (XTZ).\n\n\"Our continually expanding B2B offering, which currently includes 25 leading cryptocurrencies including DeFi-focused, 60+ trading pairs, and four leading fiat currencies, is available for deployment by PostFinance on a flexible basis. Additional details about the token and staking offering roadmap will be communicated by PostFinance in the lead-up to launch,\" Jost told Decrypt.\n\nSygnum Adds Banking Services for DeFi Tokens Including Aave and Uniswap\n\nIn June 2021, Sygnum also launched institutional-grade custody and trading services for the USDC stablecoin, as well as for a portfolio of decentralized finance (DeFi) tokens, such as Aave (AAVE), Aragon (ANT), Curve (CRV), Maker (MKR), Synthetix (SNX), Uniswap (UNI), and 1inch (1INCH)."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ldGhlcmV1bS1jcnlwdG8tY3J5cHRvY3VycmVuY3ktcHJpY2UtYml0Y29pbi1wcmljZS1zaGFuZ2hhaS11cGdyYWRlLTA4MzAxODYyMi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Ethereum soars 8% – closes in on $2k ahead of Shanghai upgrade - Yahoo Finance",
        "content": "Ethereum is edging towards $2,000. Illustration/Dado Ruvic/Reuters (Dado Ruvic / reuters)\n\nEthereum has gained 8% in the past 24 hours as it edges closer to the $2,000 (£1,602) mark ahead of the blockchain's Shanghai upgrade.\n\nEthereum (ETH-USD), the world's second largest cryptocurrency by market capitalisation, reached a high of $1,920 in the last 24 hours, a price level not seen since August 2022.\n\nThe upward trajectory comes despite uncertain macroeconomic conditions caused by successive US Federal Reserve rate hikes, and turmoil in the global banking sector following the collapse of Silicon Valley Bank (SIVB).\n\nWhat is Ethereum's Shanghai Upgrade?\n\nThe upcoming Shanghai upgrade will mark Ethereum's complete transition to a proof-of-stake network, further solidifying its position within the cryptocurrency landscape as the most widely adopted layer one blockchain.\n\nScheduled for April 12, the Shanghai upgrade, commonly known as 'Shapella', will signify the blockchain's complete shift from a proof of work (PoW) to a proof of stake (PoS) network. Proof of stake blockchains use over 99% less energy to validate than those that operate using proof of stake.\n\nThis transition follows the previous 'merge' upgrade in September, and for the first time, it will allow users to withdraw their staked ether, Ethereum's native cryptocurrency.\n\nRead more: Germany considers following Italy in banning ChatGPT\n\nBy moving to a proof of stake network, Ethereum will reduce its energy consumption by 99.9%, and enable users to generate passive income through staking their cryptocurrency.\n\nStaking involves earning financial rewards for contributing to the blockchain's network and supporting its functionality.\n\nThe Shanghai Upgrade will allow those ether 'stakers' who lock their funds to make the network function, to withdraw their staked ETH.\n\nThis is a relief to many stakers who experienced anxiety throughout the last quarter of 2022 when the price of the cryptocurrency was sent into a downward spiral after the collapse of the FTX exchange.\n\nStory continues\n\nToday's crypto prices\n\nThe global cryptocurrency market cap today stands at $1.25tn (£860bn), a gain of 2.5% in the last 24 hours, according to data from Coingecko.\n\nEthereum stands at $1,911 as of the time of writing, a gain of 8% in the past week.\n\nBitcoin (BTC-USD) is now priced at $28,531, up 5% in the past week.\n\nBitcoin has gained 70% since beginning of the year, and according to data from Coinglass, in the past 24 hours most traders of the digital asset hold long positions, suggesting market sentiment is currently in favour of more upward momentum.\n\nCoinglass data showed that in the past 24 hours, across the entire cryptocurrency market, 30,188 traders were liquidated, with the total liquidations comes in at $97.95m. The majority of these liquidations were of short positions as the whole market gained in value.\n\nRead more: Crypto live prices\n\nHowever, one of the most prominent losers in the past 24 hours was dogecoin (DOGE-USD).\n\nThe price of dogecoin shot up yesterday after Twitter changed the logo on the social media platform's website from the iconic blue bird to an image of a Shiba Inu dog associated with the dogecoin cryptocurrency.\n\nThe price of dogecoin, which is typically volatile, soared 35% in one day, however, it fell as day traders dumped the memecoin to take gains.\n\nDogecoin now sits at $0.096 per token, a fall of 2.2% in the past 24 hours, according to data from Coingecko.\n\nWatch: Polygon to 'overtake Ethereum in terms of economic activity,' claims co-founder | The Crypto Mile\n\nDownload the Yahoo Finance app, available for Apple and Android."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDQvMDUvZXRoZXItcmVhY2hlcy1uaW5lLW1vbnRoLWhpZ2gtYWhlYWQtb2Ytc2hhcGVsbGEtdXBncmFkZS5odG1s0gFgaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjMvMDQvMDUvZXRoZXItcmVhY2hlcy1uaW5lLW1vbnRoLWhpZ2gtYWhlYWQtb2Ytc2hhcGVsbGEtdXBncmFkZS5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Ether is rallying ahead of major upgrade that will let holders more easily access their tokens - CNBC",
        "content": "Ethereum underwent a huge network upgrade called the merge which proponents say will make transactions much more energy efficient. Following the merge, ether prices have dropped following a huge run up ahead of the event. Jakub Porzycki | Nurphoto | Getty Images\n\nEther has spiked this week to a nine-month high, ahead of a major network upgrade that some crypto enthusiasts say will make the digital currency a more profitable long-term investment. The world's second-biggest cryptocurrency is up about 6% over the past three days, surpassing $1,900, while bitcoin is roughly flat over that stretch. Beginning next Wednesday, an upgrade to the blockchain, dubbed \"Shapella,\" will allow owners of ether to withdraw their assets. Up to this point, investors would have to use centralized exchanges like Coinbase or decentralized finance (DeFi) protocols like Lido, to essentially exchange their locked-up ether for a token of equivalent value. The recent rally has followed a similar pattern to past bouts of enthusiasm surrounding network upgrades. In September, ethereum ran up ahead of a historic transition to a more energy-efficient way of securing the network, called proof-of-stake. Ethereum previously had a vast network of miners all over the planet running highly specialized computers that crunched math equations in order to validate transactions. After the so-called \"Merge\" upgrade in September, ethereum migrated to a proof-of-stake system, swapping out miners for validators. Instead of running large banks of computers, validators leverage their existing cache of ether as a means to verify transactions and mint new tokens.\n\nwatch now\n\n\"Ether itself becomes a productive asset,\" said Danny Ryan, a researcher at the Ethereum Foundation, regarding the September upgrade. \"It's not something you might just speculate on, but it's something that can earn returns.\" In the post-merge era, ether has taken on some characteristics of a traditional financial asset, paying interest to holders. \"It's probably the lowest-risk return inside of the ethereum ecosystem,\" said Ryan, adding that yield in other corners of DeFi involve smart contracts and other types of counter-party risk. So far this year, ether has underperformed bitcoin , but recent gains have helped to close the gap. Ether is up nearly 59% this year, versus bitcoin's gain of 70% in 2023. Currently, over 18 million ether tokens worth about $32.5 billion are staked, meaning that 15% of ether's total supply are considered locked assets. While the coming upgrade will unlock much of that value, giving holders more control over their assets, there's some concern that the release of so many tokens will have a flooding effect of sorts on the market. Even with capped withdrawals, some $2.4 billion worth of ether could hit the open market, K33 Research said in a note on Tuesday. \"A plunge is likely to happen shortly after the completion of the upgrade, as a huge amount of ETH will be unlocked, and many people will also be selling their ETH,\" said Ilya Volkov, who runs a blockchain-based fintech platform. Volkov said he's bullish over the long term.\n\nwatch now\n\nThe ratio between the open interest of ether put and call options reached its highest level since May on Tuesday, according to data presented by crypto data analytics and news firm The Block. That could signal a buildup of bearish bets leading up to the network upgrade. According to research from Bernstein, of the 18 million ether tokens locked on the blockchain, almost 70% are staked through protocols like Lido, creating a measure of liquidity for investors. \"Liquidity for 70% of staked ETH is not new, they could do it anyways,\" Bernstein wrote. The firm described the remaining 30% of holders as \"original believers,\" who are unlikely exit their positions at this price. Having the ability to deposit and withdraw tokens might encourage more investors to stake ether, and some analysts said they expect a significant influx of capital onto the network once it proves that money that's been staked can be taken out with relative ease. WATCH: Bitcoin climbs as investors shrug off regulatory concerns"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDQvMDUvZXRoZXItcmVhY2hlcy1uaW5lLW1vbnRoLWhpZ2gtYWhlYWQtb2Ytc2hhcGVsbGEtdXBncmFkZS5odG1s0gFgaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjMvMDQvMDUvZXRoZXItcmVhY2hlcy1uaW5lLW1vbnRoLWhpZ2gtYWhlYWQtb2Ytc2hhcGVsbGEtdXBncmFkZS5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Ether is rallying ahead of major upgrade that will let holders more easily access their tokens - CNBC",
        "content": "Ethereum underwent a huge network upgrade called the merge which proponents say will make transactions much more energy efficient. Following the merge, ether prices have dropped following a huge run up ahead of the event. Jakub Porzycki | Nurphoto | Getty Images\n\nEther has spiked this week to a nine-month high, ahead of a major network upgrade that some crypto enthusiasts say will make the digital currency a more profitable long-term investment. The world's second-biggest cryptocurrency is up about 6% over the past three days, surpassing $1,900, while bitcoin is roughly flat over that stretch. Beginning next Wednesday, an upgrade to the blockchain, dubbed \"Shapella,\" will allow owners of ether to withdraw their assets. Up to this point, investors would have to use centralized exchanges like Coinbase or decentralized finance (DeFi) protocols like Lido, to essentially exchange their locked-up ether for a token of equivalent value. The recent rally has followed a similar pattern to past bouts of enthusiasm surrounding network upgrades. In September, ethereum ran up ahead of a historic transition to a more energy-efficient way of securing the network, called proof-of-stake. Ethereum previously had a vast network of miners all over the planet running highly specialized computers that crunched math equations in order to validate transactions. After the so-called \"Merge\" upgrade in September, ethereum migrated to a proof-of-stake system, swapping out miners for validators. Instead of running large banks of computers, validators leverage their existing cache of ether as a means to verify transactions and mint new tokens.\n\nwatch now\n\n\"Ether itself becomes a productive asset,\" said Danny Ryan, a researcher at the Ethereum Foundation, regarding the September upgrade. \"It's not something you might just speculate on, but it's something that can earn returns.\" In the post-merge era, ether has taken on some characteristics of a traditional financial asset, paying interest to holders. \"It's probably the lowest-risk return inside of the ethereum ecosystem,\" said Ryan, adding that yield in other corners of DeFi involve smart contracts and other types of counter-party risk. So far this year, ether has underperformed bitcoin , but recent gains have helped to close the gap. Ether is up nearly 59% this year, versus bitcoin's gain of 70% in 2023. Currently, over 18 million ether tokens worth about $32.5 billion are staked, meaning that 15% of ether's total supply are considered locked assets. While the coming upgrade will unlock much of that value, giving holders more control over their assets, there's some concern that the release of so many tokens will have a flooding effect of sorts on the market. Even with capped withdrawals, some $2.4 billion worth of ether could hit the open market, K33 Research said in a note on Tuesday. \"A plunge is likely to happen shortly after the completion of the upgrade, as a huge amount of ETH will be unlocked, and many people will also be selling their ETH,\" said Ilya Volkov, who runs a blockchain-based fintech platform. Volkov said he's bullish over the long term.\n\nwatch now\n\nThe ratio between the open interest of ether put and call options reached its highest level since May on Tuesday, according to data presented by crypto data analytics and news firm The Block. That could signal a buildup of bearish bets leading up to the network upgrade. According to research from Bernstein, of the 18 million ether tokens locked on the blockchain, almost 70% are staked through protocols like Lido, creating a measure of liquidity for investors. \"Liquidity for 70% of staked ETH is not new, they could do it anyways,\" Bernstein wrote. The firm described the remaining 30% of holders as \"original believers,\" who are unlikely exit their positions at this price. Having the ability to deposit and withdraw tokens might encourage more investors to stake ether, and some analysts said they expect a significant influx of capital onto the network once it proves that money that's been staked can be taken out with relative ease. WATCH: Bitcoin climbs as investors shrug off regulatory concerns"
    }
]